[
    {
        "                 Susan B. Anthony was an American social reformer and womens rights activist who played a pivotal role in the ": null
    },
    {
        "womens suffrage": "Womens Suffrage In The United States"
    },
    {
        " movement. Born into a ": null
    },
    {
        "Quaker": "Quaker"
    },
    {
        " family committed to social equality, she collected ": null
    },
    {
        "anti-slavery": "Anti-Slavery Movement"
    },
    {
        " petitions at the age of 17. In 1856, she became the New York state agent for the ": null
    },
    {
        "American Anti-Slavery Society": "American Anti-Slavery Society"
    },
    {
        ".     In 1851, she met ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        ", who became her lifelong friend and co-worker in social reform activities, primarily in the field of ": null
    },
    {
        "womens rights": "Womens Rights"
    },
    {
        ". In 1852, they founded the New York Womens State Temperance Society after Anthony was prevented from speaking at a ": null
    },
    {
        "temperance": "Temperance Movement In The United States"
    },
    {
        " conference because she was female. In 1863, they founded the ": null
    },
    {
        "Womens Loyal National League": "Womens Loyal National League"
    },
    {
        ", which conducted the largest petition drive in United States history up to that time, collecting nearly 400,000 signatures in support of the abolition of slavery. In 1866, they initiated the ": null
    },
    {
        "American Equal Rights Association": "American Equal Rights Association"
    },
    {
        ", which campaigned for equal rights for both women and African Americans. In 1868, they began publishing a womens rights newspaper called  The Revolution . In 1869, they founded the ": null
    },
    {
        "National Woman Suffrage Association": "National Woman Suffrage Association"
    },
    {
        " as part of a split in the womens movement. In 1890, the split was formally healed when their organization merged with the rival ": null
    },
    {
        "American Woman Suffrage Association": "American Woman Suffrage Association"
    },
    {
        " to form the ": null
    },
    {
        "National American Woman Suffrage Association": "National American Woman Suffrage Association"
    },
    {
        ", with Anthony as its key force. In 1876, Anthony and Stanton began working with ": null
    },
    {
        "Matilda Joslyn Gage": "Matilda Joslyn Gage"
    },
    {
        " on what eventually grew into the six-volume  History of Woman Suffrage . The interests of Anthony and Stanton diverged somewhat in later years, but the two remained close friends.     In 1872, Anthony was arrested for voting in her hometown of ": null
    },
    {
        "Rochester, New York": "Rochester, New York"
    },
    {
        ", and convicted in a ": null
    },
    {
        "widely publicized trial": "Trial Of Susan B. Anthony"
    },
    {
        ". Although she refused to pay the fine, the authorities declined to take further action. In 1878, Anthony and Stanton arranged for Congress to be presented with an amendment giving women the right to vote. Introduced by Sen. Aaron A. Sargent , it later became known colloquially as the Susan B. Anthony Amendment. It was ratified as the ": null
    },
    {
        "Nineteenth Amendment to the U.S. Constitution": "Nineteenth Amendment To The United States Constitution"
    },
    {
        " in 1920.     Anthony traveled extensively in support of womens suffrage, giving as many as 75 to 100 speeches per year and working on many state campaigns. She worked internationally for womens rights, playing a key role in creating the ": null
    },
    {
        "International Council of Women": "International Council Of Women"
    },
    {
        ", which is still active. She also helped to bring about the ": null
    },
    {
        "Worlds Congress of Representative Women": "Worlds Congress Of Representative Women"
    },
    {
        " at the ": null
    },
    {
        "Worlds Columbian Exposition": "Worlds Columbian Exposition"
    },
    {
        " in Chicago in 1893.     When she first began campaigning for womens rights, Anthony was harshly ridiculed and accused of trying to destroy the institution of marriage. Public perception of her changed radically during her lifetime, however. Her 80th birthday was celebrated in the White House at the invitation of President ": null
    },
    {
        "William McKinley": "William Mckinley"
    },
    {
        ". She became the first female citizen to be depicted on U.S. coinage when her portrait appeared on the ": null
    },
    {
        "1979 dollar coin": "Susan B. Anthony Dollar"
    },
    {
        ".             Susan Anthony was born on February 15, 1820, to Daniel Anthony and Lucy Read in ": null
    },
    {
        "Adams, Massachusetts": "Adams, Massachusetts"
    },
    {
        ", the second oldest of seven children. She was named for her mothers mother Susanah, and for her fathers sister Susan. In her youth, she and her sisters responded to a great craze for middle initials by adding middle initials to their own names. Anthony adopted B. as her middle initial because her namesake aunt Susan had married a man named Brownell.  This interview is reprinted along with extensive notes in Gordon . Anthony never used the name Brownell herself, and did not like it. Harper , Vol. 1, p. 12     Her family shared a passion for social reform. Her brothers ": null
    },
    {
        "Daniel": "Daniel Read Anthony"
    },
    {
        " and Merritt moved to ": null
    },
    {
        "Kansas": "Kansas"
    },
    {
        " to support the ": null
    },
    {
        "anti-slavery movement": "Abolitionism"
    },
    {
        " there. Merritt fought with ": null
    },
    {
        "John Brown": "John Brown"
    },
    {
        " against pro-slavery forces during the ": null
    },
    {
        "Bleeding Kansas": "Bleeding Kansas"
    },
    {
        " crisis. Daniel eventually owned a newspaper and became mayor of ": null
    },
    {
        "Leavenworth": "Leavenworth, Kansas"
    },
    {
        ". Harper , Vol. 1,  Anthonys sister ": null
    },
    {
        "Mary": "Mary Stafford Anthony"
    },
    {
        ", with whom she shared a home in later years, became a public school principal in Rochester, and a womans rights activist. , pp. 16, 18          Anthonys father was an ": null
    },
    {
        "abolitionist": "Abolitionism In The United States"
    },
    {
        " and a ": null
    },
    {
        "temperance": "Temperance Movement In The United States"
    },
    {
        " advocate. A ": null
    },
    {
        "Quaker": "Quaker"
    },
    {
        ", he had a difficult relationship with his traditionalist congregation, which rebuked him for marrying a non-Quaker and then disowned him for allowing a dance school to operate in his home. He continued to attend Quaker meetings anyway and became even more radical in his beliefs. Anthonys mother was a ": null
    },
    {
        "Methodist": "Methodist"
    },
    {
        " and helped raise their children in a more tolerant version of her husbands religious tradition. Their father encouraged them all, girls as well as boys, to be self-supporting, teaching them business principles and giving them responsibilities at an early age. Harper , Vol. 1,      When Anthony was six years old, her family moved to ": null
    },
    {
        "Battenville, New York": "Battenville, New York"
    },
    {
        ", where her father managed a large cotton mill. Previously he had operated his own small cotton factory.     When she was seventeen, Anthony was sent to a Quaker ": null
    },
    {
        "boarding school": "Boarding School"
    },
    {
        " in Philadelphia, where she unhappily endured its severe atmosphere. She was forced to end her studies after one term because her family was financially ruined during an economic downturn known as the ": null
    },
    {
        "Panic of 1837": "Panic Of 1837"
    },
    {
        ". They were forced to sell everything they had at an auction, but they were rescued by her maternal uncle, who bought most of their belongings and restored them to the family. To assist her family financially, Anthony left home to teach at a Quaker boarding school. Harper , Vol. 1,      In 1845, the family moved to a farm on the outskirts of ": null
    },
    {
        "Rochester, New York": "Rochester, New York"
    },
    {
        ", purchased partly with the inheritance of Anthonys mother. There they associated with a group of Quaker social reformers who had left their congregation because of the restrictions it placed on reform activities, and who in 1848 formed a new organization called the Congregational Friends. The Anthony farmstead soon became the Sunday afternoon gathering place for local activists, including ": null
    },
    {
        "Frederick Douglass": "Frederick Douglass"
    },
    {
        ", a former slave and a prominent ": null
    },
    {
        "abolitionist": "Abolitionist"
    },
    {
        " who became Anthonys lifelong friend. Harper , Vol. 1,  Hugh Barbour, Christopher Densmore, Elizabeth H. Moger, Nancy C. Sorel, Alson D. Van Wagner, Arthur J. Worrall, ed. . Quaker Crosscurrents: Three Hundred Years of Friends in the New York Yearly Meetings, . Syracuse, N.Y: Syracuse University Press. p. 135. .     As several others in that group were already doing, the Anthony family began to attend services at the ": null
    },
    {
        "First Unitarian Church of Rochester": "First Unitarian Church Of Rochester"
    },
    {
        ", which was associated with social reform. The ": null
    },
    {
        "Rochester Womens Rights Convention of 1848": "Rochester Womens Rights Convention Of 1848"
    },
    {
        " was held at that church in 1848, inspired by the ": null
    },
    {
        "Seneca Falls Convention": "Seneca Falls Convention"
    },
    {
        ", the first womens rights convention, which was held two weeks earlier in a nearby town. Anthonys parents and her sister Mary attended the Rochester convention and signed the ": null
    },
    {
        "Declaration of Sentiments": "Declaration Of Sentiments"
    },
    {
        " that had been first adopted by the Seneca Falls Convention. Harper , Vol. 1,      Anthony did not take part in either of these conventions because she had moved to ": null
    },
    {
        "Canajoharie": "Canajoharie , New York"
    },
    {
        " in 1846 to be headmistress of the female department of the Canajoharie Academy. Away from Quaker influences for the first time in her life, at the age of 26 she began to replace her plain clothing with more stylish dresses, and she quit using thee and other forms of speech traditionally used by Quakers. Harper , Vol. 1,  She was interested in social reform, and she was distressed at being paid much less than men with similar jobs, but she was amused at her fathers enthusiasm over the Rochester womens rights convention. She later explained, I wasnt ready to vote, didnt want to vote, but I did want equal pay for equal work. National Woman Suffrage Association,  Report of the International Council of Women, Volume 1, 1888,      When the Canajoharie Academy closed in 1849, Anthony took over the operation of the family farm in Rochester so her father could devote more time to his insurance business. She worked at this task for a couple of years but found herself increasingly drawn to reform activity. With her parents support, she was soon fully engaged in reform work. Harper , Vol. 1,  For the rest of her life, she lived almost entirely on fees she earned as a speaker. Sherr , p. 226            Anthony embarked on her career of social reform with energy and determination. Schooling herself in reform issues, she found herself drawn to the more radical ideas of people like ": null
    },
    {
        "William Lloyd Garrison": "William Lloyd Garrison"
    },
    {
        ", ": null
    },
    {
        "George Thompson": "George Thompson"
    },
    {
        " and ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        ". Soon she was wearing the controversial ": null
    },
    {
        "Bloomer dress": "Bloomers"
    },
    {
        ", consisting of pantaloons worn under a knee-length dress. Although it was more sensible than the traditional heavy dresses that dragged the ground, she reluctantly quit wearing it after a year because it gave her opponents the opportunity to focus on her apparel rather than her ideas. Barry , pp. 60–61, 82            In 1851, Anthony was introduced to ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        ", who had been one of the organizers of the ": null
    },
    {
        "Seneca Falls Convention": "Seneca Falls Convention"
    },
    {
        " and had introduced the controversial resolution in support of ": null
    },
    {
        "womens suffrage": "Womens Suffrage"
    },
    {
        ". Anthony and Stanton were introduced by ": null
    },
    {
        "Amelia Bloomer": "Amelia Bloomer"
    },
    {
        ", a feminist and mutual acquaintance who had not signed the Declaration of Sentiments and subsequent resolutions despite her attendance at the Seneca Falls Convention. Anthony and Stanton soon became close friends and co-workers, forming a relationship that was pivotal for them and for the womens movement as a whole. After the Stantons moved from Seneca Falls to New York City in 1861, a room was set aside for Anthony in every house they lived in. One of Stantons biographers estimated that over her lifetime, Stanton spent more time with Anthony than with any other adult, including her own husband. Griffith ,      The two women had complementary skills. Anthony excelled at organizing, while Stanton had an aptitude for intellectual matters and writing. Anthony was dissatisfied with her own writing ability and wrote relatively little for publication. When historians illustrate her thoughts with direct quotes, they usually take them from her speeches, letters and diary entries. For Anthonys lack of confidence in her writing ability, see letter from Anthony to Stanton, June 5, 1856, quoted in Sherr , p. 22     Because Stanton was homebound with seven children while Anthony was unmarried and free to travel, Anthony assisted Stanton by supervising her children while Stanton wrote. One of Anthonys biographers said, Susan became one of the family and was almost another mother to Mrs. Stantons children. Barry , p. 64   A biography of Stanton says that during the early years of their relationship, Stanton provided the ideas, rhetoric, and strategy; Anthony delivered the speeches, circulated petitions, and rented the halls. Anthony prodded and Stanton produced. Griffith ,    Stantons husband said, Susan stirred the puddings, Elizabeth stirred up Susan, and then Susan stirs up the world! Letter from Stanton to Anthony, August 20, 1857, quoted in Griffith , p. 74   Stanton herself said, I forged the thunderbolts, she fired them. Stanton .   By 1854, Anthony and Stanton had perfected a collaboration that made the New York State movement the most sophisticated in the country , according to ": null
    },
    {
        "Ann D. Gordon": "Ann D. Gordon"
    },
    {
        ", a professor of womens history. Gordon .          ": null
    },
    {
        "Temperance": "Temperance Movement In The United States"
    },
    {
        " was very much a womens rights issue at that time because of laws that gave husbands complete control of the family and its finances. A woman with a drunken husband had little legal recourse even if his alcoholism left the family destitute and he was abusive to her and their children. If she obtained a divorce, which was difficult to do, he could easily end up with guardianship of the children. Flexner ,      While teaching in Canajoharie, Anthony joined the Daughters of Temperance and in 1849 gave her first public speech at one of its meetings. Harper , Vol. 1,    In 1852, she was elected as a delegate to the state temperance convention, but the chairman stopped her when she tried to speak, saying that women delegates were there only to listen and learn. Anthony and some other women immediately walked out and announced a meeting of their own, which created a committee to organize a womens state convention. Largely organized by Anthony, the convention of 500 women met in Rochester in April and created the Womens State Temperance Society, with Stanton as president and Anthony as state agent. Harper , Vol. 1,      Anthony and her co-workers collected 28,000 signatures on a petition for a law to prohibit the sale of alcohol in New York State. She organized a hearing on that law before the New York legislature, the first that had been initiated in that state by a group of women. At the organizations convention the following year, however, conservative members attacked Stantons advocacy of the right of a wife of an alcoholic to obtain a divorce. Stanton was voted out as president, whereupon she and Anthony resigned from the organization. Harper , Vol. 1,      In 1853, Anthony attended the Worlds Temperance Convention in New York City, which bogged down for three chaotic days in a dispute about whether women would be allowed to speak there. Harper , Vol. 1,    Years later, Anthony observed, No advanced step taken by women has been so bitterly contested as that of speaking in public. For nothing which they have attempted, not even to secure the suffrage, have they been so abused, condemned and antagonized. Susan B. Anthony, Fifty Years of Work for Woman Independent, 52 , pp. 414–17, quoted in Sherr , p. 134 After this period, Anthony focused her energy on abolitionist and womens rights activities.       When Anthony tried to speak at the ": null
    },
    {
        "New York State Teachers Association": "New York State Teachers Association"
    },
    {
        " meeting in 1853, her attempt sparked a half-hour debate among the men about whether it was proper for women to speak in public. Finally allowed to continue, Anthony said, Do you not see that so long as society says a woman is incompetent to be a lawyer, minister, or doctor, but has ample ability to be a teacher, that every man of you who chooses this profession tacitly acknowledges that he has no more brains than a woman. Stanton, Anthony, Gage , Vol. 1,    At the 1857 teachers convention, she introduced a resolution calling for the admission of black people to public schools and colleges, but it was rejected as not a proper subject for discussion. National Anti-Slavery Standard, August 15, 1857, quoted in Sherr , p. 18 When she introduced another resolution calling for males and females to be educated together at all levels, including colleges, it was fiercely opposed and decisively rejected. One opponent called the idea a vast social evil... the first step in the school which seeks to abolish marriage, and behind this picture I see a monster of social deformity. Harper , Vol. 1,      Anthony continued to speak at state teachers conventions for several years, insisting that women teachers should receive equal pay with men and serve as officers and committee members within the organization. Harper , Vol. 1,        Anthonys work for the womens rights movement began at a time when that movement was already gathering momentum. Stanton had helped organize the ": null
    },
    {
        "Seneca Falls Convention": "Seneca Falls Convention"
    },
    {
        " in 1848, a local event that was the first womens rights convention. In 1850, the first in a series of ": null
    },
    {
        "National Womens Rights Conventions": "National Womens Rights Convention"
    },
    {
        " was held in ": null
    },
    {
        "Worcester, Massachusetts": "Worcester, Massachusetts"
    },
    {
        ". In 1852, Anthony attended her first National Womens Rights Convention, which was held in ": null
    },
    {
        "Syracuse, New York": "Syracuse, New York"
    },
    {
        ", where she served as one of the conventions secretaries. Harper , Vol. 1,  According to ": null
    },
    {
        "Ida Husted Harper": "Ida Husted Harper"
    },
    {
        ", Anthonys authorized biographer, Miss Anthony came away from the Syracuse convention thoroughly convinced that the right which woman needed above every other, the one indeed which would secure to her all others, was the right of suffrage. Harper , Vol. 1,  Suffrage, however, did not become the main focus of her work for several more years.     A major hindrance to the womens movement was a lack of money. Few women at that time had an independent source of income, and even those with employment generally were required by law to turn over their pay to their husbands. Dudden ,    Partly through the efforts of the womens movement, a law had been passed in New York in 1848 that recognized some rights for married women, but that law was limited. In 1853, Anthony worked with ": null
    },
    {
        "William Henry Channing": "William Henry Channing"
    },
    {
        ", her activist ": null
    },
    {
        "Unitarian": "Unitarian Universalism"
    },
    {
        " minister, to organize a convention in Rochester to launch a state campaign for improved property rights for married women, which Anthony would lead. She took her lecture and petition campaign into almost every county in New York during the winter of 1855 despite the difficulty of traveling in snowy terrain in horse and buggy days. Harper , Vol. 1,      When she presented the petitions to the New York State Senate Judiciary Committee, its members told her that men were actually the oppressed sex because they did such things as giving women the best seats in carriages. Noting cases in which the petition had been signed by both husbands and wives , the committees official report sarcastically recommended that the petitioners seek a law authorizing the husbands in such marriages to wear petticoats and the wives trousers. Harper , Vol. 1,    The campaign finally achieved success in 1860 when the legislature passed an improved ": null
    },
    {
        "Married Womens Property Act": "Married Womens Property Acts In The United States"
    },
    {
        " that gave married women the right to own separate property, enter into contracts and be joint guardian of their children. The legislature rolled back much of this law in 1862, however, during a period when the womens movement was largely inactive because of the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        ". Barry , pp. 136, 149     The womens movement was loosely structured at that time, with few state organizations and no national organization other than a coordinating committee that arranged annual conventions. Million , pp. 109, 121   ": null
    },
    {
        "Lucy Stone": "Lucy Stone"
    },
    {
        ", who did much of the organizational work for the national conventions, encouraged Anthony to take over some of the responsibility for them. Anthony resisted at first, feeling that she was needed more in the field of anti-slavery activities. After organizing a series of anti-slavery meetings in the winter of 1857, Anthony told a friend that, the experience of the last winter is worth more to me than all my temperance and womans rights work, though the latter were the school necessary to bring me into the antislavery work. Letter from Anthony to ": null
    },
    {
        "Abby Kelley Foster": "Abby Kelley Foster"
    },
    {
        " and ": null
    },
    {
        "Stephen Symonds Foster": "Stephen Symonds Foster"
    },
    {
        ", April 20, 1857, quoted in Million , p. 234   During a planning session for the 1858 womens rights convention, Stone, who had recently given birth, told Anthony that her new family responsibilities would prevent her from organizing conventions until her children were older. Anthony presided at the 1858 convention, and when the planning committee for national conventions was reorganized, Stanton became its president and Anthony its secretary. Million , pp. 235, 250–52   Anthony continued to be heavily involved in anti-slavery work at the same time.       In 1837, at age 16, Anthony collected petitions against slavery as part of organized resistance to the newly established ": null
    },
    {
        "gag rule": "Gag Ruleunited States"
    },
    {
        " that prohibited anti-slavery petitions in the U.S. House of Representatives.  This citation references the 1964 edition of a book that was first published in 1933 by the American Historical Association.   In 1851, she played a key role in organizing an anti-slavery convention in Rochester. , p. 6   She was also part of the ": null
    },
    {
        "Underground Railroad": "Underground Railroad"
    },
    {
        ". An entry in her diary in 1861 read, Fitted out a fugitive slave for Canada with the help of ": null
    },
    {
        "Harriet Tubman": "Harriet Tubman"
    },
    {
        ". Harper , Vol. 1,         In 1856, Anthony agreed to become the New York State agent for the ": null
    },
    {
        "American Anti-Slavery Society": "American Anti-Slavery Society"
    },
    {
        " with the understanding that she would also continue her advocacy of womens rights. Barry , p. 110   Anthony organized anti-slavery meetings throughout the state under banners that read No compromise with slaveholders. Immediate and Unconditional Emancipation. Harper , Vol. 1,      In 1859, ": null
    },
    {
        "John Brown": "John Brown"
    },
    {
        " was executed for leading a violent ": null
    },
    {
        "raid on the U.S. arsenal at Harpers Ferry": "John Browns Raid On Harpers Ferry"
    },
    {
        " in what was intended to be the beginning of an armed slave uprising. Anthony organized a meeting of mourning and indignation Harper , Vol. 1,  in Corinthian Hall in Rochester on the day he was executed. She also presided over the meeting, which raised money for Browns family.     She developed a reputation for fearlessness in facing down attempts to disrupt her meetings, but opposition became overwhelming on the eve of the ": null
    },
    {
        "Civil War": "American Civil War"
    },
    {
        ". Mob action shut down her meetings in every town from Buffalo to Albany in early 1861. In Rochester, the police had to escort Anthony and other speakers from the building for their own safety. Harper , Vol. 1,  In Syracuse, according to a local newspaper, Rotten eggs were thrown, benches broken, and knives and pistols gleamed in every direction. , quoted in Barry , p. 148.     Anthony expressed a vision of a racially integrated society that was radical for a time when abolitionists were debating the question of what was to become of the slaves after they were freed, and when people like ": null
    },
    {
        "Abraham Lincoln": "Abraham Lincoln"
    },
    {
        " were calling for African Americans to be shipped to newly established colonies in Africa. In a speech in 1861, Anthony said, Let us open to the colored man all our schools ... Let us admit him into all our mechanic shops, stores, offices, and lucrative business avocations ... let him rent such pew in the church, and occupy such seat in the theatre ... Extend to him all the rights of Citizenship. Manuscript of speech in the Susan B. Anthony Papers collection at the Library of Congress. Quoted in McPherson ,      The relatively small womens rights movement of that time was closely associated with the American Anti-Slavery Society led by ": null
    },
    {
        "William Lloyd Garrison": "William Lloyd Garrison"
    },
    {
        ". The womens movement depended heavily on abolitionist resources, with its articles published in their newspapers and some of its funding provided by abolitionists. DuBois ,  There was tension, however, between leaders of the womens movement and male abolitionists who, although supporters of increased womens rights, believed that a vigorous campaign for womens rights would interfere with the campaign against slavery. In 1860, when Anthony sheltered a woman who had fled an abusive husband, Garrison insisted that the woman give up the child she had brought with her, pointing out that the law gave husbands complete control of children. Anthony reminded Garrison that he helped slaves escape to Canada in violation of the law and said, Well, the law which gives the father ownership of the children is just as wicked and Ill break it just as quickly. Harper , Vol. 1,      When Stanton introduced a resolution at the National Womans Rights Convention in 1860 favoring more lenient divorce laws, leading abolitionist ": null
    },
    {
        "Wendell Phillips": "Wendell Phillips"
    },
    {
        " not only opposed it but attempted to have it removed from the record. Dudden , . The proposal for more lenient divorce laws was also controversial among women activists. When Stanton, Anthony, and others supported a bill before the New York legislature that would permit divorce in cases of desertion or inhuman treatment, ": null
    },
    {
        "Horace Greeley": "Horace Greeley"
    },
    {
        ", an abolitionist newspaper publisher, campaigned against it in the pages of his newspaper. Stanton, Anthony, Gage , Vol. 1,      Garrison, Phillips and Greeley had all provided valuable help to the womens movement. In a letter to ": null
    },
    {
        "Lucy Stone": "Lucy Stone"
    },
    {
        ", Anthony said, The Men, even the best of them, seem to think the Womens Rights question should be waived for the present. So let us do our own work, and in our own way. Letter from Anthony to Lucy Stone, October 27, 1857, quoted in Sherr , p. 54       Anthony and Stanton organized the ": null
    },
    {
        "Womens Loyal National League": "Womens Loyal National League"
    },
    {
        " in 1863 to campaign for an amendment to the ": null
    },
    {
        "U.S. Constitution": "Constitution Of The United States"
    },
    {
        " that would abolish slavery.   It was the first national womens political organization in the United States.  In the largest petition drive in the nations history up to that time, the League collected nearly 400,000 signatures to abolish slavery, representing approximately one out of every twenty-four adults in the Northern states. Venet , . The League was called by several variations of its name, including the Womens National Loyal League.   The petition drive significantly assisted the passage of the ": null
    },
    {
        "Thirteenth Amendment": "Thirteenth Amendment To The United States Constitution"
    },
    {
        ", which ended slavery. Anthony was the chief organizer of this effort, which involved recruiting and coordinating some 2000 petition collectors. Barry , pp. 153–154     The League provided the womens movement with a vehicle for combining the fight against slavery with the fight for womens rights by reminding the public that petitioning was the only political tool available to women at a time when only men were allowed to vote. Venet ,    With a membership of 5000, it helped develop a new generation of women leaders, providing experience and recognition for not only Stanton and Anthony but also newcomers like ": null
    },
    {
        "Anna Dickinson": "Anna Elizabeth Dickinson"
    },
    {
        ", a gifted teenaged orator. Venet , .   The League demonstrated the value of formal structure to a womens movement that had resisted being anything other than loosely organized up to that point. Flexner ,    The widespread network of women activists who assisted the League expanded the pool of talent that was available to reform movements, including the womens suffrage movement, after the war. Venet , .       Anthony stayed with her brother ": null
    },
    {
        "Daniel": "Daniel Read Anthony"
    },
    {
        " in Kansas for eight months in 1865 to assist with his newspaper. She headed back east after she learned that an amendment to the U.S. Constitution had been proposed that would provide citizenship for African Americans but would also for the first time introduce the word male into the constitution. Anthony supported citizenship for blacks but opposed any attempt to link it with a reduction in the status of women. Her ally Stanton agreed, saying if that word male be inserted, it will take us a century at least to get it out. Letter from Stanton to Gerrit Smith, January 1, 1866, quoted in DuBois ,      Anthony and Stanton worked to revive the womens rights movement, which had become nearly dormant during the ": null
    },
    {
        "Civil War": "American Civil War"
    },
    {
        ". In 1866, they organized the Eleventh ": null
    },
    {
        "National Womens Rights Convention": "National Womens Rights Convention"
    },
    {
        ", the first since the Civil War began. Stanton, Anthony, Gage ,    Unanimously adopting a resolution introduced by Anthony, the convention voted to transform itself into the ": null
    },
    {
        "American Equal Rights Association": "American Equal Rights Association"
    },
    {
        " , whose purpose was to campaign for the equal rights of all citizens, especially the right of suffrage. Stanton, Anthony, Gage ,  The leadership of the new organization included such prominent activists as ": null
    },
    {
        "Lucretia Mott": "Lucretia Mott"
    },
    {
        ", ": null
    },
    {
        "Lucy Stone": "Lucy Stone"
    },
    {
        " and ": null
    },
    {
        "Frederick Douglass": "Frederick Douglass"
    },
    {
        ".     The AERAs drive for ": null
    },
    {
        "universal suffrage": "Universal Suffrage"
    },
    {
        " was resisted by some abolitionist leaders and their allies in the ": null
    },
    {
        "Republican Party": "History Of The United States Republican Party"
    },
    {
        ". During the period before the 1867 convention to revise the New York state constitution, ": null
    },
    {
        "Horace Greeley": "Horace Greeley"
    },
    {
        ", a prominent newspaper editor, told Anthony and Stanton, This is a critical period for the Republican Party and the life of our Nation... I conjure you to remember that this is the negros hour, and your first duty now is to go through the State and plead his claims. Stanton, Anthony, Gage ,  Abolitionist leaders ": null
    },
    {
        "Wendell Phillips": "Wendell Phillips"
    },
    {
        " and ": null
    },
    {
        "Theodore Tilton": "Theodore Tilton"
    },
    {
        " met with Anthony and Stanton in the office of the ": null
    },
    {
        "National Anti-Slavery Standard": "National Anti-Slavery Standard"
    },
    {
        ", a leading abolitionist newspaper. The two men tried to convince the two women that the time had not yet come for womens suffrage, that they should campaign not for voting rights for both women and African Americans in the revised state constitution but for voting rights for black men only. According to ": null
    },
    {
        "Ida Husted Harper": "Ida Husted Harper"
    },
    {
        ", Anthonys authorized biographer, Anthony was highly indignant and declared that she would sooner cut off her right hand than ask the ballot for the black man and not for woman. Harper , Vol. 1, . Anthonys words here have been misquoted in increasingly elaborate ways. Alma Lutzs biography converted Harpers words into a direct quote by Anthony but made no other changes: I would sooner cut off my right hand than ask for the ballot for the black man and not for woman. Eleanor Flexners Century of Struggle changed hand to arm and made other changes, reporting that Anthony said, I will cut off this right arm of mine before I will ever work for or demand the ballot for the Negro and not woman.   Paul Finkelmans African-Americans and the Right To Vote quoted Anthony as saying, I swear that I will cut off this right arm of mine before I will ever work for or demand the ballot for the Negro and not the woman. The American Pageant, a textbook by David M. Kennedy and Lizabeth Cohen, reported  that Anthony held out her arm and said, Look at this, all of you. And hear me swear that I will cut off this right arm of mine before I will ever work for or demand the ballot for the negro and not the woman. Kennedy and Cohen placed this supposed quote by Anthony in the context of her anger at the exclusion of women from the 14th Amendment rather than, as Harper originally reported, at being told that she should work for suffrage only for black men, not for both women and blacks. Anthony and Stanton continued to work for the inclusion of suffrage for both African Americans and women.     In 1867, the AERA campaigned in Kansas for ": null
    },
    {
        "referenda": "Referendum"
    },
    {
        " that would ": null
    },
    {
        "enfranchise": "Suffrage"
    },
    {
        " both African Americans and women. ": null
    },
    {
        "Wendell Phillips": "Wendell Phillips"
    },
    {
        ", who opposed mixing those two causes, blocked the funding that the AERA had expected for their campaign. Dudden ,    After an internal struggle, Kansas Republicans decided to support suffrage for black men only and formed an Anti Female Suffrage Committee to oppose the AERAs efforts. Dudden ,    By the end of summer, the AERA campaign had almost collapsed, and its finances were exhausted.   Anthony and Stanton created a storm of controversy by accepting help during the last days of the campaign from ": null
    },
    {
        "George Francis Train": "George Francis Train"
    },
    {
        ", a wealthy businessman who supported womens rights. Train antagonized many activists by attacking the Republican Party and openly disparaging the integrity and intelligence of African Americans. DuBois , .   There is reason to believe, however, that Anthony and Stanton hoped to draw the volatile Train away from his cruder forms of racism, and that he had actually begun to do so. Dudden ,      After the Kansas campaign, the AERA increasingly divided into two wings, both advocating universal suffrage but with different approaches. One wing, whose leading figure was Lucy Stone, was willing for black men to achieve suffrage first and wanted to maintain close ties with the Republican Party and the abolitionist movement. The other, whose leading figures were Anthony and Stanton, insisted that women and black men should be enfranchised at the same time and worked toward a politically independent womens movement that would no longer be dependent on abolitionists. The AERA effectively dissolved after an acrimonious meeting in May 1869, and two competing woman suffrage organizations were created in its aftermath. DuBois , .     The Revolution The Revolution  in New York City in 1868. It focused primarily on womens rights, especially suffrage for women, but it also covered other topics, including politics, the labor movement and finance. Its motto was Men, their rights and nothing more: women, their rights and nothing less. Rakow and Kramarae eds. ,    One of its goals was to provide a forum in which women could exchange opinions on key issues from a variety of viewpoints. Anthony managed the business aspects of the paper while Stanton was co-editor along with ": null
    },
    {
        "Parker Pillsbury": "Parker Pillsbury"
    },
    {
        ", an abolitionist and a supporter of womens rights. Initial funding was provided by ": null
    },
    {
        "George Francis Train": "George Francis Train"
    },
    {
        ", the controversial businessman who supported womens rights but who alienated many activists with his political and racial views. Rakow and Kramarae eds. ,         In the aftermath of the ": null
    },
    {
        "Civil War": "American Civil War"
    },
    {
        ", major periodicals associated with the radical social reform movements had either become more conservative or had quit publishing or soon would. Dudden ,    Anthony intended for The Revolution to partially fill that void, hoping to grow it eventually into a daily paper with its own printing press, all owned and operated by women. The Working Womens Association , The Revolution, November 5, 1868, p. 280. Quoted in Rakow and Kramarae eds. ,  The funding Train had arranged for the newspaper, however, was less than Anthony had expected. Moreover, Train sailed for England after The Revolution published its first issue and was soon jailed for supporting Irish independence. Barry , p. 187     Trains financial support eventually disappeared entirely. After twenty-nine months, mounting debts forced Anthony to transfer the paper to ": null
    },
    {
        "Laura Curtis Bullard": "Laura Curtis Bullard"
    },
    {
        ", a wealthy womens rights activist who gave it a less radical tone. The paper published its last issue less than two years later.   Despite its short life, The Revolution gave Anthony and Stanton a means for expressing their views during the developing split within the womens movement. It also helped them promote their wing of the movement, which eventually became a separate organization. The role of The Revolution during the developing split in the womens movement is discussed in chapters 6 and 7 of Dudden . An example of its use to support their wing of the movement is on .       The ": null
    },
    {
        "National Labor Union": "National Labor Union"
    },
    {
        " , which was formed in 1866, began reaching out to farmers, African Americans and women, with the intention of forming a broad-based political party. DuBois , . The Revolution responded enthusiastically, declaring, The principles of the National Labor Union are our principles. The National Labor Union and U.S. Bonds, The Revolution, April 9, 1868, p. 213. Quoted in DuBois , . It predicted that The producers—the working-men, the women, the negroes—are destined to form a triple power that shall speedily wrest the sceptre of government from the non-producers—the land monopolists, the bond-holders, the politicians. National Labor Congress, The Revolution, October 1, 1868, p. 200.   Anthony and Stanton were seated as delegates to the NLU Congress in 1868, with Anthony representing the ": null
    },
    {
        "Working Womens Association": "Working Womens Association"
    },
    {
        " , which had recently been formed in the offices of The Revolution. DuBois , .     The attempted alliance did not last long. During a printers ": null
    },
    {
        "strike": "Strike Action"
    },
    {
        " in 1869, Anthony voiced approval of an employer-sponsored training program that would teach women skills that would enable them in effect to replace the strikers. Anthony viewed the program as an opportunity to increase employment of women in a trade from which women were often excluded by both employers and unions. At the next NLU Congress, Anthony was first seated as a delegate but then unseated because of strong opposition from those who accused her of supporting ": null
    },
    {
        "strikebreakers": "Strikebreakers"
    },
    {
        ". DuBois , .     Anthony worked with the WWA to form all-female labor unions, but with little success. She accomplished more in her work with the joint campaign by the WWA and The Revolution to win a pardon for ": null
    },
    {
        "Hester Vaughn": "Hester Vaughn"
    },
    {
        ", a domestic worker who had been found guilty of ": null
    },
    {
        "infanticide": "Infanticide"
    },
    {
        " and sentenced to death. Charging that the social and legal systems treated women unfairly, the WWA petitioned, organized a mass meeting at which Anthony was one of the speakers, and sent delegations to visit Vaughn in prison and to speak with the governor. Vaughn was eventually pardoned. DuBois ,      Originally with a membership that included over a hundred wage-earning women, the WWA evolved into an organization consisting almost entirely of journalists, doctors and other middle-class working women. Its members formed the core of the New York City portion of the new national suffrage organization that Anthony and Stanton were in the process of forming. DuBois ,             In May 1869, two days after the final AERA convention, Anthony, Stanton and others formed the ": null
    },
    {
        "National Woman Suffrage Association": "National Woman Suffrage Association"
    },
    {
        " . In November 1869, ": null
    },
    {
        "Lucy Stone": "Lucy Stone"
    },
    {
        ", ": null
    },
    {
        "Julia Ward Howe": "Julia Ward Howe"
    },
    {
        " and others formed the competing ": null
    },
    {
        "American Woman Suffrage Association": "American Woman Suffrage Association"
    },
    {
        " . The hostile nature of their rivalry created a partisan atmosphere that endured for decades, affecting even professional historians of the womens movement. DuBois , .     The immediate cause for the split was the proposed ": null
    },
    {
        "Fifteenth Amendment": "Fifteenth Amendment To The United States Constitution"
    },
    {
        " to the ": null
    },
    {
        "U.S. Constitution": "Constitution Of The United States"
    },
    {
        ", which would prohibit the denial of suffrage because of race. In one of her most controversial actions, Anthony campaigned against the amendment. She and Stanton called for women and African Americans to be enfranchised at the same time. They said that by effectively ": null
    },
    {
        "enfranchising": "Suffrage"
    },
    {
        " all men while excluding all women, the amendment would create an aristocracy of sex by giving constitutional authority to the idea that men were superior to women. Rakow and Kramarae eds. ,  In 1873, Anthony said, An oligarchy of wealth, where the rich govern the poor; an oligarchy of learning, where the educated govern the ignorant; or even an oligarchy of race, where the Saxon rules the African, might be endured; but surely this oligarchy of sex, which makes the men of every household sovereigns, masters; the women subjects, slaves; carrying dissension, rebellion into every home of the Nation, cannot be endured. Stanton, Anthony, Gage , Vol. 2,      The AWSA supported the amendment, but Lucy Stone, who became its most prominent leader, also made it clear that she believed that suffrage for women would be more beneficial to the country than suffrage for black men. Stanton, Anthony, Gage, Harper , Vol. 2, . Stone is speaking here during the final AERA convention in 1869. Support for the amendment did not necessarily mean that all AWSA members were free from the racial presumptions of that era. ": null
    },
    {
        "Henry Blackwell": "Henry Brown Blackwell"
    },
    {
        ", Lucy Stones husband and a prominent AWSA member, published an open letter to Southern legislatures assuring them that if they allowed both blacks and women to vote, the political supremacy of your white race will remain unchanged and that the black race would gravitate by the law of nature toward the tropics . See  Cited in Dudden , p. 93     The two organizations had other differences as well. The NWSA was politically independent, but the AWSA at least initially aimed for close ties with the Republican Party, hoping that the ratification of the Fifteenth Amendment would lead to a Republican push for womens suffrage. The NWSA focused primarily on winning suffrage at the national level while the AWSA pursued a state-by-state strategy. The NWSA initially worked on a wider range of womens issues than the AWSA, including divorce reform and ": null
    },
    {
        "equal pay for women": "Equal Pay For Women"
    },
    {
        ". DuBois , pp. 197–200. The high point of Republican support was a non-committal reference to womens suffrage in the 1872 Republican platform.     Events soon removed much of the basis for the split in the womens movement. In 1870, debate about the Fifteenth Amendment was made irrelevant when that amendment was officially ratified. In 1872, disgust with corruption in government led to a mass defection of abolitionists and other social reformers from the Republicans to the short-lived ": null
    },
    {
        "Liberal Republican Party": "Liberal Republican Party"
    },
    {
        ". DuBois , pp. 166, 200 As early as 1875, Anthony began urging the NWSA to focus more exclusively on womens suffrage rather than a variety of womens issues. Barry , pp. 264–65 The rivalry between the two womens groups was so bitter, however, that a merger proved to be impossible for twenty years. The AWSA, which was especially strong in ": null
    },
    {
        "New England": "New England"
    },
    {
        ", was the larger of the two organizations, but it began to decline in strength during the 1880s. Gordon .    In 1890, the two organizations merged as the ": null
    },
    {
        "National American Woman Suffrage Association": "National American Woman Suffrage Association"
    },
    {
        " , with Stanton as president but with Anthony as its effective leader. When Stanton retired from her post in 1892, Anthony became NAWSAs president. Barry , pp. 296–99, 303            By the end of the Civil War, according to historian ": null
    },
    {
        "Ann D. Gordon": "Ann D. Gordon"
    },
    {
        ", Susan B. Anthony occupied new social and political territory. She was emerging on the national scene as a female leader, something new in American history, and she did so as a single woman in a culture that perceived the spinster as anomalous and unguarded ... By the 1880s, she was among the senior political figures in the United States. Gordon, Ann D., Knowing Susan B. Anthony: The Stories We Tell of a Life , in Ridarsky, Christine L. and Huth, Mary M., editors . Susan B. Anthony and the Struggle for Equal Rights. Rochester, NY: University of Rochester Press. pp. 202, 204;      After the formation of the NWSA, Anthony dedicated herself fully to the organization and to womens suffrage. She did not draw a salary from either it or its successor, the NAWSA, but on the contrary used her lecture fees to fund those organizations. Sherr , pp. 226–27 There was no national office, the mailing address being simply that of one of the officers. Flexner , p. 241     That Anthony had remained unmarried gave her an important business advantage in this work. A married woman at that time had the legal status of ": null
    },
    {
        "feme covert": "Coverture"
    },
    {
        ", which, among other things, excluded her from signing contracts . As Anthony had no husband, she was a ": null
    },
    {
        "feme sole": "Coverture"
    },
    {
        " and could freely sign contracts for convention halls, printed materials, etc. Barry , pp. 57–58, 259   Using fees she earned by lecturing, she paid off the debts she had accumulated while supporting The Revolution. With the press treating her as a celebrity, she proved to be a major draw. Gordon ,  Over her career she estimated that she averaged 75 to 100 speeches per year. Travel conditions in the earlier days were sometimes appalling. Once she gave a speech from the top of a billiard table. On another occasion her train was snowbound for days, and she survived on crackers and dried fish. Sherr , pp. 123–24, 132–33        Both Anthony and Stanton joined the lecture circuit about 1870, usually traveling from mid-autumn to spring. The timing was right because the nation was beginning to discuss womens suffrage as a serious matter. Occasionally they traveled together but most often not. Lecture bureaus scheduled their tours and handled the travel arrangements, which generally involved traveling during the day and speaking at night, sometimes for weeks at a time, including weekends. Their lectures brought new recruits into the movement who strengthened suffrage organizations at the local, state and national levels. Their journeys during that decade covered a distance that was unmatched by any other reformer or politician. Ward , Taking Possession of the Country by Ann D. Gordon, pp. 163–69   Anthonys other suffrage work included organizing national conventions, lobbying Congress and state legislatures, and participating in a seemingly endless series of state suffrage campaigns.     A special opportunity arose in 1876 when the U.S. celebrated its 100th birthday as an independent country. The NWSA asked permission to present a Declaration of Rights for Women at the official ceremony in Philadelphia, but was refused. Undaunted, five women, headed by Anthony, walked onto the platform during the ceremony and handed their Declaration to the startled official in charge. As they left, they handed out copies of it to the crowd. Spotting an unoccupied bandstand outside the hall, Anthony mounted it and read the Declaration to a large crowd. Afterwards she invited everyone to a NWSA convention at the nearby Unitarian church where speakers like ": null
    },
    {
        "Lucretia Mott": "Lucretia Mott"
    },
    {
        " and ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        " awaited them. Flexner ,  Bacon , pp. 132–33     The work of all segments of the womens suffrage movement began to show clear results. Women won the right to vote in Wyoming in 1869 and in Utah in 1870. Her lectures in Washington and four other states led directly to invitations for her to address the state legislatures there.     ": null
    },
    {
        "The Grange": "National Grange Of The Order Of Patrons Of Husbandry"
    },
    {
        ", a large advocacy group for farmers, officially supported womens suffrage as early as 1885. The ": null
    },
    {
        "Womens Christian Temperance Union": "Womens Christian Temperance Union"
    },
    {
        ", the largest womens organization in the country, also supported ": null
    },
    {
        "suffrage": "Suffrage"
    },
    {
        ". Flexner ,      Anthonys commitment to the movement, her spartan lifestyle, and the fact that she did not seek personal financial gain, made her an effective fund-raiser and won her the admiration of many who did not agree with her goals. As her reputation grew, her working and travel conditions improved. She sometimes had the use of the private railroad car of ": null
    },
    {
        "Jane Stanford": "Jane Stanford"
    },
    {
        ", a sympathizer whose husband owned a major railroad. While lobbying and preparing for the annual suffrage conventions in Washington, she was provided with a free suite of rooms in the Riggs Hotel, whose owners supported her work. Sherr , pp. 85, 122     To ensure continuity, Anthony trained a group of younger activists, who were known as her nieces, to assume leadership roles within the organization. Two of them, ": null
    },
    {
        "Carrie Chapman Catt": "Carrie Chapman Catt"
    },
    {
        " and ": null
    },
    {
        "Anna Howard Shaw": "Anna Howard Shaw"
    },
    {
        ", served as presidents of the NAWSA after Anthony retired from that position. Flexner ,      United States v. Susan B. Anthony     The NWSA convention of 1871 adopted a strategy of urging women to attempt to vote, and then, after being turned away, to file suits in federal courts to challenge laws that prevented women from voting. The legal basis for the challenge would be the recently adopted ": null
    },
    {
        "Fourteenth Amendment": "Fourteenth Amendment To The United States Constitution"
    },
    {
        ", part of which reads: No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States . Gordon ,      Following the example set by Anthony and her sisters shortly before election day, a total of nearly fifty women in Rochester registered to vote in the ": null
    },
    {
        "presidential election of 1872": "1872 United States Presidential Election"
    },
    {
        ". On election day, Anthony and fourteen other women from her ": null
    },
    {
        "ward": "Ward"
    },
    {
        " convinced the election inspectors to allow them to cast ballots, but women in other wards were turned back. Barry , pp. 249–51 Anthony was arrested on November 18, 1872, by a U.S. Deputy Marshal and charged with illegally voting. The other women who had voted were also arrested but released pending the outcome of Anthonys trial. Gordon ,    Anthonys trial generated a national controversy and became a major step in the transition of the broader womens rights movement into the womens suffrage movement. Hewitt ,      Anthony spoke throughout ": null
    },
    {
        "Monroe County, New York": "Monroe County, New York"
    },
    {
        ", where her trial was to be held and from where the jurors for her trial would be chosen. Her speech was entitled Is it a Crime for a U.S. Citizen to Vote? She said, We no longer petition Legislature or Congress to give us the right to vote. We appeal to women everywhere to exercise their too long neglected citizens right to vote. Gordon ,    The U.S. Attorney arranged for the trial to be moved to the ": null
    },
    {
        "federal circuit court": "United States Circuit Court"
    },
    {
        ", which would soon sit in neighboring Ontario County with a jury drawn from that countys inhabitants. Anthony responded by speaking throughout that county also before the trial began. Gordon ,      Responsibility for that federal circuit was in the hands of Justice ": null
    },
    {
        "Ward Hunt": "Ward Hunt"
    },
    {
        ", who had recently been appointed to the U.S. ": null
    },
    {
        "Supreme Court": "United States Supreme Court"
    },
    {
        ". Hunt had never served as a trial judge; originally a politician, he had begun his judicial career by being elected to the ": null
    },
    {
        "New York Court of Appeals": "New York Court Of Appeals"
    },
    {
        ". Hull , pp. 115–16, 158     The trial,  United States v. Susan B. Anthony , began on June 17, 1873 and was closely followed by the national press. Following a rule of ": null
    },
    {
        "common law": "Common Law"
    },
    {
        " at that time which prevented criminal defendants in federal courts from testifying, Hunt refused to allow Anthony to speak until the verdict had been delivered. On the second day of the trial, after both sides had presented their cases, Justice Hunt delivered his lengthy opinion, which he had put in writing. In the most controversial aspect of the trial, Hunt directed the jury to deliver a guilty verdict. Gordon ,      On the third day of the trial, Hunt asked Anthony if she had anything to say. She responded with the most famous speech in the history of the agitation for woman suffrage , according to ": null
    },
    {
        "Ann D. Gordon": "Ann D. Gordon"
    },
    {
        ", a historian of the womens movement. Gordon ,    Repeatedly ignoring the judges order to stop talking and sit down, she protested what she called this high-handed outrage upon my citizens rights , saying, you have trampled under foot every vital principle of our government. My natural rights, my civil rights, my political rights, my judicial rights, are all alike ignored. Gordon ,    She castigated Justice Hunt for denying her a trial by jury, but said that even if he had allowed the jury to discuss the case, she still would have been denied a trial by a jury of her peers because women were not allowed to be jurors.     When Justice Hunt sentenced Anthony to pay a fine of $100, she responded, I shall never pay a dollar of your unjust penalty , Gordon ,  and she never did.   If Hunt had ordered her to be jailed until she paid the fine, Anthony could have taken her case to the Supreme Court. Hunt instead announced he would not order her taken into custody, closing off that legal avenue. Gordon ,      The U.S. Supreme Court in 1875 put an end to the strategy of trying to achieve womens suffrage through the court system when it ruled in  Minor v. Happersett  that the Constitution of the United States does not confer the right of suffrage upon anyone . Gordon , . This article points out that Supreme Court rulings did not establish the connection between citizenship and voting rights until the mid-twentieth century. The NWSA decided to pursue the far more difficult strategy of campaigning for a constitutional amendment to achieve voting rights for women.     History of Woman Suffrage   Anthony and Stanton initiated the project of writing a history of the womens suffrage movement in 1876. Anthony had for years saved letters, newspaper clippings, and other materials of historical value to the womens movement. In 1876, she moved into the Stanton household in New Jersey along with several trunks and boxes of these materials to begin working with Stanton on the  History of Woman Suffrage . Harper , Vol. 1,      Anthony hated this type of work. In her letters, she said the project makes me feel growly all the time ... No warhorse ever panted for the rush of battle more than I for outside work. I love to make history but hate to write it. Harper , Vol. 2,    The work absorbed much of her time for several years although she continued to work on other womens suffrage activities. She acted as her own publisher, which presented several problems, including finding space for the inventory. She was forced to limit the number of books she was storing in the attic of her sisters house because the weight was threatening to collapse the structure. Harper , Vol. 3,      Originally envisioned as a modest publication that could be produced quickly, the history evolved into a six-volume work of more than 5700 pages written over a period of 41 years. The first three volumes, which cover the movement up to 1885, were published between 1881 and 1886 and were produced by Stanton, Anthony and ": null
    },
    {
        "Matilda Joslyn Gage": "Matilda Joslyn Gage"
    },
    {
        ". Anthony handled the production details and the extensive correspondence with contributors. Anthony published Volume 4, which covers the period from 1883 to 1900, in 1902, after Stantons death, with the help of ": null
    },
    {
        "Ida Husted Harper": "Ida Husted Harper"
    },
    {
        ", Anthonys designated biographer. The last two volumes, which bring the history up to 1920, were completed in 1922 by Harper after Anthonys death.     The History of Woman Suffrage preserves an enormous amount of material that might have been lost forever. Written by leaders of one wing of the divided womens movement , it does not, however, give a balanced view of events where their rivals are concerned. It overstates the role of Anthony and Stanton, and it understates or ignores the roles of Stone and other activists who did not fit into the historical narrative that Anthony and Stanton developed. Because it was for years the main source of documentation about the suffrage movement, historians have had to uncover other sources to provide a more balanced view. Cullen-DuPont  History of Woman Suffrage Tetrault , . Tetrault says she describes the Seneca Falls story as a myth not to indicate that it is false but in the technical sense of a venerated and celebrated story used to give meaning to the world. See Tetrault ,            Anthony traveled to Europe in 1883 for a nine-month stay, linking up with Stanton, who had arrived a few months earlier. Together they met with leaders of European womens movements and began the process of creating an international womens organization. Harper , Vol. 2,    The ": null
    },
    {
        "National Woman Suffrage Association": "National Woman Suffrage Association"
    },
    {
        " agreed to host its founding congress. The preparatory work was handled primarily by Anthony and two of her younger colleagues in the NWSA, ": null
    },
    {
        "Rachel Foster Avery": "Rachel Foster Avery"
    },
    {
        " and ": null
    },
    {
        "May Wright Sewall": "May Wright Sewall"
    },
    {
        ". Delegates from fifty-three womens organizations in nine countries met in Washington in 1888 to form the new association, which was called the ": null
    },
    {
        "International Council of Women": "International Council Of Women"
    },
    {
        " . The delegates represented a wide variety of organizations, including suffrage associations, professional groups, literary clubs, temperance unions, labor leagues and missionary societies. The ": null
    },
    {
        "American Woman Suffrage Association": "American Woman Suffrage Association"
    },
    {
        ", which had for years been a rival to the NWSA, participated in the congress. Anthony opened the first session of the ICW and presided over most events. Barry , pp. 283–287     The ICW commanded respect at the highest levels. ": null
    },
    {
        "President Cleveland": "Grover Cleveland"
    },
    {
        " and his wife sponsored a reception at the ": null
    },
    {
        "White House": "White House"
    },
    {
        " for delegates to the ICWs founding congress. The ICWs second congress was an integral part of the ": null
    },
    {
        "Worlds Columbian Exposition": "Worlds Columbian Exposition"
    },
    {
        " held in Chicago in 1893. At its third congress in London in 1899, a reception for the ICW was held at ": null
    },
    {
        "Windsor Castle": "Windsor Castle"
    },
    {
        " at the invitation of ": null
    },
    {
        "Queen Victoria": "Queen Victoria"
    },
    {
        ". At its fourth congress in Berlin in 1904, ": null
    },
    {
        "Augusta Victoria": "Augusta Victoria Of Schleswig-Holstein"
    },
    {
        ", the German Empress, received the ICW leaders at her palace. Anthony played a prominent role on all four occasions. Barry , pp. 287, 328–29, 349. ": null
    },
    {
        "Queen Victoria": "Queen Victoria"
    },
    {
        " arranged for the Windsor Castle reception, but she was not present at it.   Still active, ICW is associated with the United Nations.             The ": null
    },
    {
        "Worlds Columbian Exposition": "Worlds Columbian Exposition"
    },
    {
        ", also known as the Chicago Worlds Fair, was held in 1893. It hosted several world congresses, each dealing with a specialized topic, such as religion, medicine and science. At almost the last moment, the U.S. Congress decided that the Exposition should also recognize the role of women. After it was over, one of the organizers of the Expositions congress of women revealed that Anthony had played a pivotal but hidden role in that last-minute decision. Fearing that a public campaign would rouse opposition, Anthony had worked quietly to organize support for this project among women of the political elite. Anthony increased the pressure by covertly initiating a petition that was signed by wives and daughters of Supreme Court judges, senators, cabinet members and other dignitaries. Stanton, Anthony, Gage, Harper , Vol. 4, . The official who revealed this information was Rachel Foster Avery, an associate of Anthony who served on the organizing committee for the womens congress.     A large structure called the Womans Building, designed by ": null
    },
    {
        "Sophia Hayden Bennett": "Sophia Hayden Bennett"
    },
    {
        ", was constructed to provide meeting and exhibition spaces for women at the Exposition. Two of Anthonys closest associates were appointed to organize the womens congress. They arranged for the ": null
    },
    {
        "International Council of Women": "International Council Of Women"
    },
    {
        " to make its upcoming meeting part of the Exposition by expanding its scope and calling itself the ": null
    },
    {
        "Worlds Congress of Representative Women": "Worlds Congress Of Representative Women"
    },
    {
        ". Sewall, May Wright, editor . The Worlds Congress of Representative Women. New York: Rand, McNally,  ": null
    },
    {
        "Bertha Palmer": "Bertha Palmer"
    },
    {
        " was in charge of womens activities at the Exposition. She appointed ": null
    },
    {
        "May Wright Sewall": "May Wright Sewall"
    },
    {
        " as chair and ": null
    },
    {
        "Rachel Foster Avery": "Rachel Foster Avery"
    },
    {
        " as secretary of the organizing committee for the womens congress; both were associates of Anthony. This week-long congress seated delegates from 27 countries. Its 81 sessions, many held simultaneously, were attended by over 150,000 people, and womens suffrage was discussed at almost every session. Harper , Vol. 1, . Anthony spoke to large crowds at the Exposition.      ": null
    },
    {
        " Buffalo Bill Cody": "Buffalo Bill"
    },
    {
        " invited her as a guest to his Wild West Show, located just outside the Exposition. Larson, Eric . Devil in the White City: Murder, Magic, and Madness at the Fair That Changed America, New York: Random House, p. 133 When the show opened, he rode his horse directly to her and greeted her with dramatic flair. According to a co-worker, Anthony, for the moment as enthusiastic as a girl, waved her handkerchief at him, while the big audience, catching the spirit of the scene, wildly applauded. Shaw, Anna Howard . The Story of a Pioneer, . New York: Harper and Brothers. Instead of applauding, women of that era sometimes waved white handkerchiefs to show approval, a practice known as the ": null
    },
    {
        "Chautauqua": "Chautauqua Institute"
    },
    {
        " salute. See Sherr , p. 308.       After Anthony retired as president of the ": null
    },
    {
        "National American Woman Suffrage Association": "National American Woman Suffrage Association"
    },
    {
        ", ": null
    },
    {
        "Carrie Chapman Catt": "Carrie Chapman Catt"
    },
    {
        ", her chosen successor, began working toward an international womens suffrage association, one of Anthonys long-time goals. The existing ": null
    },
    {
        "International Council of Women": "International Council Of Women"
    },
    {
        " could not be expected to support a campaign for womens suffrage because it was a broad alliance whose more conservative members would object. In 1902, Catt organized a preparatory meeting in Washington, with Anthony as chair, that was attended by delegates from several countries. Organized primarily by Catt, the ": null
    },
    {
        "International Woman Suffrage Alliance": "International Alliance Of Women"
    },
    {
        " was created in Berlin in 1904. The founding meeting was chaired by Anthony, who was declared to be the new organizations honorary president and first member. Stanton, Anthony, Gage, Harper , Vol. 6,      According to Anthonys authorized biographer, no event ever gave Miss Anthony such profound satisfaction as this one . Harper , Vol. 3,    Later renamed the ": null
    },
    {
        "International Alliance of Women": "International Alliance Of Women"
    },
    {
        ", the organization is still active and is affiliated with the United Nations.             Anthony and Stanton worked together in a close and productive relationship. From 1880 to 1886 they were together almost every day working on the  History of Woman Suffrage . Griffith , p. 182   They referred to each other as Susan and Mrs. Stanton . Barry , p. 63   Anthony deferred to Stanton in other ways also, not accepting an office in any organization that would place her above Stanton. Barry , p. 297   In practice this generally meant that Anthony, although ostensibly holding a less important office, handled most of the organizations daily activities. Ward , p. 72   Stanton sometimes felt the weight of Anthonys determination and drive. When Stanton arrived at an important meeting in 1888 with her speech not yet written, Anthony insisted that Stanton stay in her hotel room until she had written it, and she placed a younger colleague outside her door to make sure she did so. Barry , p. 286   At Anthonys 70th birthday celebration, Stanton teased her by saying, Well, as all women are supposed to be under the thumb of some man, I prefer a tyrant of my own sex, so I shall not deny the patent fact of my subjection. Gordon .      Their interests began to diverge somewhat as they grew older. As the drive for womens suffrage gained momentum, Anthony began to form alliances with more conservative groups, such as the ": null
    },
    {
        "Womens Christian Temperance Union": "Womens Christian Temperance Union"
    },
    {
        ", the nations largest womens organization and a supporter of womens suffrage. Griffith , pp. 182, 194   Such moves irritated Stanton, who said, I get more radical as I get older, while she seems to grow more conservative. Stantons diary, January 9, 1889, quoted in Griffith , p. 195 In 1895 Stanton published  The Womans Bible , which attacked the use of the  Bible  to relegate women to an inferior status. It became a highly controversial best-seller. The NAWSA voted to disavow any connection with it despite Anthonys strong objection that such a move was unnecessary and hurtful. Griffith , pp. 210–13   Even so, Anthony refused to assist with the books preparation, telling Stanton: You say women must be emancipated from their superstitions before enfranchisement will have any benefit, and I say just the reverse, that women must be enfranchised before they can be emancipated from their superstitions. Harper , Vol. 2,    Despite such friction, their relationship continued to be close. When Stanton died in 1902, Anthony wrote to a friend: Oh, this awful hush! It seems impossible that voice is stilled which I have loved to hear for fifty years. Always I have felt I must have Mrs. Stantons opinion of things before I knew where I stood myself. I am all at sea... Harper , Vol. 3,             Having lived for years in hotels and with friends and relatives, Anthony agreed to settle into her sister ": null
    },
    {
        "Mary Stafford Anthonys": "Mary Stafford Anthony"
    },
    {
        " house in Rochester in 1891, at the age of 71. Barry , pp. 262, 300   Her energy and stamina, which sometimes exhausted her co-workers, continued at a remarkable level. At age 75, she toured ": null
    },
    {
        "Yosemite National Park": "Yosemite National Park"
    },
    {
        " on the back of a mule. Harper , Vol. 2,      She remained as leader of the NAWSA and continued to travel extensively on suffrage work. She also engaged in local projects. In 1893, she initiated the Rochester branch of the ": null
    },
    {
        "Womens Educational and Industrial Union": "Womens Educational And Industrial Union"
    },
    {
        ".  In 1898, she called a meeting of 73 local womens societies to form the Rochester Council of Women. She played a key role in raising the funds required by the ": null
    },
    {
        "University of Rochester": "University Of Rochester"
    },
    {
        " before they would admit women students, pledging her life insurance policy to close the final funding gap. , pp. 22–23     In 1896, she spent eight months on the California suffrage campaign, speaking as many as three times per day in more than 30 localities. In 1900, she presided over her last NAWSA convention. During the six remaining years of her life, Anthony spoke at six more NAWSA conventions and four congressional hearings, completed the fourth volume of the History of Woman Suffrage, and traveled to eighteen states and to Europe. Sherr , pp. 320–21, 120 As Anthonys fame grew, some politicians were happy to be publicly associated with her. Her seventieth birthday was celebrated at a national event in Washington with prominent members of the House and Senate in attendance. Sherr , pp. 265–70, 310 Her eightieth birthday was celebrated at the ": null
    },
    {
        "White House": "White House"
    },
    {
        " at the invitation of President ": null
    },
    {
        "William McKinley": "William Mckinley"
    },
    {
        ". Barry , pp. 331–32       Susan B. Anthony died at the age of 86 of heart failure and pneumonia in her home in ": null
    },
    {
        "Rochester, New York": "Rochester, New York"
    },
    {
        ", on March 13, 1906.  She was buried at ": null
    },
    {
        "Mount Hope Cemetery, Rochester": "Mount Hope Cemetery, Rochester"
    },
    {
        ". Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 . McFarland & Company, Inc., Publishers. Kindle Edition. At her birthday celebration in ": null
    },
    {
        "Washington D.C.": "Washington D.C."
    },
    {
        " a few days earlier, Anthony had spoken of those who had worked with her for womens rights: There have been others also just as true and devoted to the cause  — I wish I could name every one  — but with such women consecrating their lives, failure is impossible! Harper , Vol. 3, . According to Sherr , p. 367, footnote 324, a variation of this statement appeared in several newspapers, but it also ends with Failure is impossible . Failure is impossible quickly became a watchword for the womens movement.     Anthony did not live to see the achievement of womens suffrage at the national level, but she still expressed pride in the progress the womens movement had made. At the time of her death, women had achieved suffrage in Wyoming, Utah, Colorado and Idaho, and several larger states followed soon after. Legal rights for married women had been established in most states, and most professions had at least a few women members. 36,000 women were attending colleges and universities, up from zero a few decades earlier. Sherr , pp. xxiv–xxv, 310 Two years before she died, Anthony said, The world has never witnessed a greater revolution than in the sphere of woman during this fifty years .  Quoted in Sherr , p. xxvi.     Part of the revolution, in Anthonys view, was in ways of thinking. In a speech in 1889, she noted that women had always been taught that their purpose was to serve men, but Now, after 40 years of agitation, the idea is beginning to prevail that women were created for themselves, for their own happiness, and for the welfare of the world.  Quoted in Sherr , p. 58. Anthony was sure that womens suffrage would be achieved, but she also feared that people would forget how difficult it was to achieve it, as they were already forgetting the ordeals of the recent past:          Anthonys death was widely mourned. ": null
    },
    {
        "Clara Barton": "Clara Barton"
    },
    {
        ", founder of the ": null
    },
    {
        "American Red Cross": "American Red Cross"
    },
    {
        ", said just before Anthonys death, A few days ago someone said to me that every woman should stand with bared head before Susan B. Anthony. Yes, I answered, and every man as well. ... For ages he has been trying to carry the burden of lifes responsibilities alone... Just now it is new and strange and men cannot comprehend what it would mean but the change is not far away. Stanton, Anthony, Gage , Vol. 4, .     In her history of the womens suffrage movement, ": null
    },
    {
        "Eleanor Flexner": "Eleanor Flexner"
    },
    {
        " wrote, If ": null
    },
    {
        "Lucretia Mott": "Lucretia Mott"
    },
    {
        " typified the moral force of the movement, if ": null
    },
    {
        "Lucy Stone": "Lucy Stone"
    },
    {
        " was its most gifted orator and ": null
    },
    {
        "Mrs. Stanton": "Elizabeth Cady Stanton"
    },
    {
        " its most outstanding philosopher, Susan Anthony was its incomparable organizer, who gave it force and direction for half a century. Flexner ,      The ": null
    },
    {
        "Nineteenth Amendment": "Nineteenth Amendment To The United States Constitution"
    },
    {
        ", which guaranteed the right of American women to vote, was colloquially known as the Susan B. Anthony Amendment.   After it was ratified in 1920, the ": null
    },
    {
        "National American Woman Suffrage Association": "National American Woman Suffrage Association"
    },
    {
        ", whose character and policies were strongly influenced by Anthony, was transformed into the ": null
    },
    {
        "League of Women Voters": "League Of Women Voters"
    },
    {
        ", which is still an active force in U.S. politics. Sherr , p. 328.     Anthonys papers are held in library collections of ": null
    },
    {
        "Harvard University": "Harvard University"
    },
    {
        " . Harvard University. Retrieved June 1, 2017 and its ": null
    },
    {
        "Radcliffe Institute": "Radcliffe Institute For Advanced Study"
    },
    {
        ", Harvard University, , ": null
    },
    {
        "Radcliffe Institute": "Radcliffe Institute For Advanced Study"
    },
    {
        ", Harvard University. Retrieved June 1, 2017 ": null
    },
    {
        "Rutgers University": "Rutgers University"
    },
    {
        ",  at ": null
    },
    {
        "Rutgers University": "Rutgers University"
    },
    {
        ". Retrieved June 1, 2017 the ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        ",  at the ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        ". Retrieved June 1, 2017 and ": null
    },
    {
        "Smith College": "Smith College"
    },
    {
        ".  Smith College. Retrieved June 1, 2017           Anthony was raised a ": null
    },
    {
        "Quaker": "Quaker"
    },
    {
        ", but her religious heritage was mixed. On her mothers side, her grandmother was a ": null
    },
    {
        "Baptist": "Baptist"
    },
    {
        " and her grandfather was a ": null
    },
    {
        "Universalist": "Universalist Church Of America"
    },
    {
        ". Harper , Vol. 1,  Her father was a radical Quaker who chafed under the restrictions of his more conservative congregation. When the Quakers split in the late 1820s into Orthodox and ": null
    },
    {
        "Hicksites": "Elias Hicks"
    },
    {
        ", her family sided with the Hicksites, which Anthony described as the radical side, the Unitarian . Susan B. Anthony , , The Elizabeth Cady Stanton and Susan B. Anthony Papers Project, Rutgers University. ": null
    },
    {
        "Unitarianism": "Unitarianism"
    },
    {
        ", the belief that God is one person, contrasts with ": null
    },
    {
        "Trinitarianism": "Trinitarianism"
    },
    {
        ", the traditional Christian belief that God is three persons in one, with Jesus being one of those three. Elias Hicks, after whom the Hicksites were named, taught that Jesus was not God but had achieved a divine state through obedience to the Inner Light. Harper , Vol. 1,      In 1848, three years after the Anthony family moved to Rochester, a group of about 200 Quakers withdrew from the Hicksite organization in western New York, partly because they wanted to work in social reform movements without interference from that organization. Some of them, including the Anthony family, began attending services at the ": null
    },
    {
        "First Unitarian Church of Rochester": "First Unitarian Church Of Rochester"
    },
    {
        ". When Susan B. Anthony returned home from teaching in 1849, she joined her family in attending services there, and she remained with the Rochester Unitarians for the rest of her life. Harper , Vol. 1,  Her sense of spirituality was strongly influenced by ": null
    },
    {
        "William Henry Channing": "William Henry Channing"
    },
    {
        ", Stanton  a nationally known minister of that church who also assisted her with several of her reform projects. Channing wrote the call for the Womens Rights Convention that Anthony organized in Rochester in 1853 and playing a leading role in it. He wrote an appeal that Anthony circulated as part of her womens suffrage work. See Harper , Vol. 1,  Anthony was listed as a member of First Unitarian in a church history written in 1881.     Anthony, proud of her Quaker roots, continued to describe herself as a Quaker, however. She maintained her membership in the local Hicksite body but did not attend its meetings. Bacon , p. 117 She joined the Congregational Friends, an organization that was created by Quakers in western New York after the 1848 split among Quakers there. This group soon ceased to operate as a religious body, however, and changed its name to the Friends of Human Progress, organizing annual meetings in support of social reform that welcomed everyone, including Christians, Jews, Mahammedans, and Pagans .   Anthony served as secretary of this group in 1857.     In 1859, during a period when Rochester Unitarians were gravely impaired by factionalism,  Anthony unsuccessfully attempted to start a Free church in Rochester ... where no doctrines should be preached and all should be welcome. Harper , Vol. 1,    She used as her model the Boston church of ": null
    },
    {
        "Theodore Parker": "Theodore Parker"
    },
    {
        ", a ": null
    },
    {
        "Unitarian": "Unitarian Universalism"
    },
    {
        " minister who helped to set the direction of his denomination by rejecting the authority of the Bible and the validity of miracles.  During Anthonys lifetime, the ": null
    },
    {
        "Unitarian": "Unitarian Universalism"
    },
    {
        " denomination transformed from one based on Unitarian Christianity to one that was not based on any creed. Theodore Parker and William Channing Gannett played important roles in this transformation. Anthony later became close friends with William Channing Gannett, who became the minister of the Unitarian Church in Rochester in 1889, and with his wife Mary, who came from a Quaker background. Lutz , pp. 271, 303 William had been a national leader of the successful movement within the Unitarian denomination to end the practice of binding it by a formal creed, thereby opening its membership to non-Christians and even non-": null
    },
    {
        "theists": "Theist"
    },
    {
        ", a goal for the denomination that resembled Anthonys goal for her proposed Free church.      After Anthony reduced her arduous travel schedule and made her home in Rochester in 1891, she resumed regular attendance at First Unitarian and also worked with the Gannetts on local reform projects. Her sister Mary Stafford Anthony, whose home had provided a resting place for Anthony during her years of frequent travel, had long played an active role in this church. Harper , Vol. 3,      Her first public speech, delivered at a temperance meeting as a young woman, contained frequent references to God. Gordon .  She soon took a more distant approach, however. While in Europe in 1883, Anthony helped a desperately poor Irish mother of six children. Noting that the evidences were that God was about to add a No. 7 to her flock , she later commented, What a dreadful creature their God must be to keep sending hungry mouths while he withholds the bread to fill them! Harper , Vol. 2,      ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        " said that Anthony was an ": null
    },
    {
        "agnostic": "Agnostic"
    },
    {
        ", adding, To her, work is worship ... Her belief is not orthodox, but it is religious. Stanton .   Anthony herself said, Work and worship are one with me. I can not imagine a God of the universe made happy by my getting down on my knees and calling him great. New York World, February 2, 1896, quoted in Harper , Vol. 2.    When Anthonys sister Hannah was on her death bed, she asked Susan to talk about the great beyond, but, Anthony later wrote, I could not dash her faith with my doubts, nor could I pretend a faith I had not; so I was silent in the dread presence of death. Harper , Vol. 2,      When an organization offered to sponsor a womens rights convention on the condition that no speaker should say anything which would seem like an attack on Christianity , Anthony wrote to a friend, I wonder if theyll be as particular to warn all other speakers not to say anything which shall sound like an attack on liberal religion. They never seem to think we have any feelings to be hurt when we have to sit under their reiteration of orthodox cant and dogma. Harper , Vol. 2,           As a teen, Anthony went to parties, and she had offers of marriage when she was older, but there is no record of her ever having a serious romance. Sherr , p. 5, 13   Anthony loved children, however, and helped raise the children in the Stanton household. Referring to her niece, she wrote, The dear little Lucy engrosses most of my time and thoughts. A child one loves is a constant benediction to the soul, whether or not it helps to the accomplishment of great intellectual feats. Harper , Vol. 1,      As a young worker in the womens rights movement, Anthony expressed frustration when some of her co-workers began to marry and have children, sharply curtailing their ability to work for the understaffed movement. When ": null
    },
    {
        "Lucy Stone": "Lucy Stone"
    },
    {
        " abandoned her pledge to stay single, Anthonys scolding remarks caused a temporary rupture in their friendship. Barry, p. 119 Journalists repeatedly asked Anthony to explain why she never married. She answered one by saying, It always happened that the men I wanted were those I could not get, and those who wanted me I wouldnt have. The Womans Column, August 14, 1897, quoted in Sherr, p. 13 To another she answered, I never found the man who was necessary to my happiness. I was very well as I was. San Francisco Chronicle, June 28, 1896, quoted in Sherr, p. 13 To a third she said, I never felt I could give up my life of freedom to become a mans housekeeper. When I was young, if a girl married poor, she became a housekeeper and a drudge. If she married wealth she became a pet and a doll. Just think, had I married at twenty, I would have been a drudge or a doll for fifty-nine years. Think of it!     Anthony fiercely opposed laws that gave husbands complete control over the marriage. ": null
    },
    {
        "Blackstones Commentaries": "Commentaries On The Laws Of England"
    },
    {
        ", the basis for the legal systems in most states at that time, stated that, By marriage, the husband and wife are one person in law: that is, the very being or legal existence of the woman is suspended during the marriage . Gordon ,      In a speech in 1877, Anthony predicted an epoch of single women. If women will not accept marriage with subjugation, nor men proffer it without, there is, there can be, no alternative. The woman who will not be ruled must live without marriage. Homes of Single Women by Susan B. Anthony, 1877, quoted in The Elizabeth Cady Stanton  – Susan B. Anthony Reader edited by Ellen Carol DuBois, Northwestern University Press, Boston, 1981 and 1992, p. 148;           Anthony showed little interest in the topic of abortion. ": null
    },
    {
        "Ann D. Gordon": "Ann D. Gordon"
    },
    {
        ", who led the ": null
    },
    {
        "Elizabeth Cady Stanton and Susan B. Anthony Papers": "Elizabeth Cady Stanton And Susan B. Anthony Papers"
    },
    {
        " project, an undertaking to collect and document materials written by those two co-workers, said that Anthony never voiced an opinion about the sanctity of fetal life  ... and she never voiced an opinion about using the power of the state to require that pregnancies be brought to term.  ": null
    },
    {
        "Lynn Sherr": "Lynn Sherr"
    },
    {
        ", author of a biography of Anthony, said that Anthony never stated her views on abortion, saying, I looked desperately for some kind of evidence one way or the other as to what her position was, and it just wasn’t there.     A ": null
    },
    {
        "dispute over Anthonys views on abortion": "Susan B. Anthony Abortion Dispute"
    },
    {
        " developed after 1989 when some members of the ": null
    },
    {
        "anti-abortion movement": "Anti-Abortion Movement"
    },
    {
        " began to portray Anthony as an outspoken critic of abortion ,  citing various statements they said she had made. Gordon, Sherr and others contested this portrayal, saying these statements either were not made by Anthony, were not about abortion, or had been taken out of context.  Thomas, Tracy A. , Seattle University Law Review, Vol. 36, No. 1 , p. 8        The first memorial to Anthony was established by African Americans. In 1907, a year after Anthonys death, a stained-glass window was installed at the ": null
    },
    {
        "African Methodist Episcopal Zion": "African Methodist Episcopal Zion"
    },
    {
        " church in Rochester that featured her portrait and the words Failure is Impossible , a quote from her that had become a watchword for the womens suffrage movement. It was installed through the efforts of ": null
    },
    {
        "Hester C. Jeffrey": "Hester C. Jeffrey"
    },
    {
        ", the president of the Susan B. Anthony Club, an organization of African American women in Rochester.  Speaking at the windows dedication, Jeffrey said, Miss Anthony had stood by the Negroes when it meant almost death to be a friend of the colored people. The Rochester Democrat & Chronicle newspaper, August 1907, as quoted in 17 Madison Street, the newsletter of the Susan B. Anthony Museum and House, , p. 2. This church had a history of involvement in issues of social justice: in 1847, ": null
    },
    {
        "Frederick Douglass": "Frederick Douglass"
    },
    {
        " printed the first editions of The North Star, his abolitionist newspaper, in its basement.      Anthony is commemorated along with ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        " and ": null
    },
    {
        "Lucretia Mott": "Lucretia Mott"
    },
    {
        " in a sculpture by ": null
    },
    {
        "Adelaide Johnson": "Adelaide Johnson"
    },
    {
        " at the ": null
    },
    {
        "United States Capitol": "United States Capitol"
    },
    {
        ", unveiled in 1921. Originally kept on display in the crypt of the US Capitol, the sculpture was moved to its current location and more prominently displayed in the rotunda in 1997.      In 1922, sculptor ": null
    },
    {
        "Leila Usher": "Leila Usher"
    },
    {
        " donated a bas-relief of Susan B. Anthony to the ": null
    },
    {
        "National Womans Party": "National Womans Party"
    },
    {
        ", which was installed at their headquarters near ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        "  Usher was also responsible for the creation of a similar bronze medallion donated to Bryn Mawr College in 1901.       The U.S. Post Office issued its first postage stamp honoring Anthony in 1936 on the 16th anniversary of the ratification of the ": null
    },
    {
        "19th Amendment": "Nineteenth Amendment To The United States Constitution"
    },
    {
        ", which ensured womens right to vote.  A second stamp honoring Anthony was issued in April 1958.      In 1950, she was inducted into the ": null
    },
    {
        "Hall of Fame for Great Americans": "Hall Of Fame For Great Americans"
    },
    {
        "; a bust of her was placed there in 1952 that had been sculpted by ": null
    },
    {
        "Brenda Putnam": "Brenda Putnam"
    },
    {
        ".  Charlotte Streifer Rubinstein, American Women Sculptors: A History of Women Working in Three Dimensions , pp. 248–49.     ": null
    },
    {
        "New York Radical Feminists": "New York Radical Feminists"
    },
    {
        ", founded in 1969, was organized into small cells or brigades named after notable feminists of the past; ": null
    },
    {
        "Anne Koedt": "Anne Koedt"
    },
    {
        " and ": null
    },
    {
        "Shulamith Firestone": "Shulamith Firestone"
    },
    {
        " led the ": null
    },
    {
        "Stanton": "Elizabeth Cady Stanton"
    },
    {
        "-Anthony Brigade.       Since 1970, the Susan B. Anthony Award is given annually by the NYC chapter of the ": null
    },
    {
        "National Organization for Women": "National Organization For Women"
    },
    {
        " to honor grassroots activists dedicated to improving the lives of women and girls in New York City.       In 1971, ": null
    },
    {
        "Zsuzsanna Budapest": "Zsuzsanna Budapest"
    },
    {
        " founded the Susan B. Anthony Coven 1 – the first feminist, women-only, witches coven.   . Lesbian-pride.com . Retrieved on 2011-06-23. Witchcraft Today: An Encyclopedia of Wiccan and Neopagan Traditions by James R. Lewis ABC-CLIO Voices from the Pagan Census: A National Survey of Witches and Neo-Pagans in the United States by Helen A. Berger, Evan A. Leach and Leigh S. Shaffer. University of South Carolina Press     In 1973, she was inducted into the ": null
    },
    {
        "National Womens Hall of Fame": "National Womens Hall Of Fame"
    },
    {
        ".      In 1979, the ": null
    },
    {
        "United States Mint": "United States Mint"
    },
    {
        " began issuing the ": null
    },
    {
        "Susan B. Anthony dollar": "Susan B. Anthony Dollar"
    },
    {
        " coin, the first U.S. coin to honor a female citizen.      The artwork  The Dinner Party , first exhibited in 1979, features a place setting for Anthony. . Brooklyn Museum. Retrieved on August 6, 2015.      The ": null
    },
    {
        "Elizabeth Cady Stanton and Susan B. Anthony Papers": "Elizabeth Cady Stanton And Susan B. Anthony Papers"
    },
    {
        " project was an academic undertaking to collect and document all available materials written by ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        " and Anthony, which began in 1982. The project has since been ended. Making It Happen by Ann D. Gordon in Project News: Papers of Elizabeth Cady Stanton and Susan B. Anthony, , p. 5. Retrieved March 17, 2014.      In 1999, ": null
    },
    {
        "Ken Burns": "Ken Burns"
    },
    {
        " and others produced the documentary  Not for Ourselves Alone: The Story of Elizabeth Cady Stanton & Susan B. Anthony .      Also in 1999, a sculpture by Ted Aub was unveiled commemorating when on May 12, 1851, ": null
    },
    {
        "Amelia Bloomer": "Amelia Bloomer"
    },
    {
        " introduced Anthony to ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        ".   This sculpture, called When Anthony Met Stanton , consists of the three women depicted as life-size bronze statues, and is placed overlooking Van Cleef Lake in ": null
    },
    {
        "Seneca Falls, New York": "Seneca Falls, New York"
    },
    {
        ", where the introduction occurred.     In 2007, the Troup–Howell bridge in Rochester, NY, was redesigned and renamed the ": null
    },
    {
        "Frederick Douglass–Susan B. Anthony Memorial Bridge": "Frederick Douglass–Susan B. Anthony Memorial Bridge"
    },
    {
        ".     The place where Anthony and other women led by her voted in 1872 now has a bronze sculpture of a locked ballot box flanked by two pillars, which is called the 1872 Monument, and was dedicated in August 2009, on the 89th anniversary of the ": null
    },
    {
        "Nineteenth Amendment": "Nineteenth Amendment To The United States Constitution"
    },
    {
        ". Leading away from the 1872 Monument there is the Susan B. Anthony Trail, which runs beside the 1872 Café, named for the year of Anthony’s vote. Nearby is the “Let’s Have Tea” sculpture of Anthony and ": null
    },
    {
        "Frederick Douglass": "Frederick Douglass"
    },
    {
        ".      The ": null
    },
    {
        "U.S. Treasury Department": "United States Department Of The Treasury"
    },
    {
        " announced on April 20, 2016, that an image of Anthony would appear on the back of a newly designed $10 bill along with ": null
    },
    {
        "Lucretia Mott": "Lucretia Mott"
    },
    {
        ", ": null
    },
    {
        "Sojourner Truth": "Sojourner Truth"
    },
    {
        ", ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        " and ": null
    },
    {
        "Alice Paul": "Alice Paul"
    },
    {
        ". The original plan was for a woman to appear on the front of the $10 bill, with Anthony under consideration for that position. The final plan, however, calls for ": null
    },
    {
        "Alexander Hamilton": "Alexander Hamilton"
    },
    {
        ", the first U.S. Secretary of the Treasury, to retain his current position there. Designs for new $5, $10 and $20 bills will be unveiled in 2020 in conjunction with the 100th anniversary of American women winning the right to vote via the 19th Amendment.       In 2016, ": null
    },
    {
        "Lovely Warren": "Lovely Warren"
    },
    {
        ", the mayor of Rochester, put a red, white and blue sign next to Anthonys grave the day after ": null
    },
    {
        "Hillary Clinton": "Hillary Clinton"
    },
    {
        " obtained the nomination at the ": null
    },
    {
        "Democratic National Convention": "Democratic National Convention"
    },
    {
        "; the sign stated, Dear Susan B., we thought you might like to know that for the first time in history, a woman is running for president representing a major party. 144 years ago, your illegal vote got you arrested. It took another 48 years for women to finally gain the right to vote. Thank you for paving the way.  The city of Rochester put pictures of the message on Twitter and requested that residents go to Anthonys grave to sign it.     Anthonys home in ": null
    },
    {
        "Rochester": "Rochester, New York"
    },
    {
        " is now a ": null
    },
    {
        "National Historic Landmark": "National Historic Landmark"
    },
    {
        " called the ": null
    },
    {
        "National Susan B. Anthony Museum and House": "Susan B. Anthony House"
    },
    {
        ".  The ": null
    },
    {
        "house of her birth": "Anthony House"
    },
    {
        "  in ": null
    },
    {
        "Adams, Massachusetts": "Adams, Massachusetts"
    },
    {
        ", and her ": null
    },
    {
        "childhood home": "Susan B. Anthony Childhood House"
    },
    {
        "  in ": null
    },
    {
        "Battenville, New York": "Battenville, New York"
    },
    {
        ", are listed on the ": null
    },
    {
        "National Register of Historic Places": "National Register Of Historic Places"
    },
    {
        ".     The ": null
    },
    {
        "Cathedral of St. John the Divine": "Cathedral Of St. John The Divine"
    },
    {
        " in Manhattan, one of the worlds largest, has a sculpture honoring four spiritual heroes of the twentieth century: Anthony, ": null
    },
    {
        "Martin Luther King": "Martin Luther King"
    },
    {
        ", ": null
    },
    {
        "Albert Einstein": "Albert Einstein"
    },
    {
        ", and ": null
    },
    {
        "Mohandas Gandhi": "Mohandas Gandhi"
    },
    {
        ".      ": null
    },
    {
        "Susan B. Anthony Day": "Susan B. Anthony Day"
    },
    {
        " is a commemorative holiday to celebrate the birth of Anthony and ": null
    },
    {
        "womens suffrage in the United States": "Womens Suffrage In The United States"
    },
    {
        ". The holiday is February 15—Anthonys birthday.      The ": null
    },
    {
        "Susan B. Anthony List": "Susan B. Anthony List"
    },
    {
        " is a ": null
    },
    {
        "non-profit": "Non-Profit"
    },
    {
        " organization that seeks to reduce and ultimately end abortion in the U.S.  ": null
    },
    {
        "Hester C. Jeffrey": "Hester C. Jeffrey"
    },
    {
        " Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        ", and ": null
    },
    {
        "Lucretia Mott": "Lucretia Mott"
    },
    {
        ", created by ": null
    },
    {
        "Adelaide Johnson": "Adelaide Johnson"
    },
    {
        ", as originally installed in the ": null
    },
    {
        "United States Capitol Building": "United States Capitol Building"
    },
    {
        " Leila Usher": "Leila Usher"
    },
    {
        ", next to the bas-relief of Susan B. Anthony she donated to the ": null
    },
    {
        "National Womans Party": "National Womans Party"
    },
    {
        ".  ": null
    },
    {
        "Commemorative stamp": "Commemorative Stamp"
    }
]