[
    {
        "                    Synchronization is the coordination of events to operate a ": null
    },
    {
        "system": "System"
    },
    {
        " in unison. For example, the ": null
    },
    {
        "conductor": "Conductor"
    },
    {
        " of an orchestra keeps the orchestra synchronized or in time. Systems that operate with all parts in synchrony are said to be synchronous or in sync—and those that are not are  asynchronous .     Today, time synchronization can occur between systems around the world through ": null
    },
    {
        "satellite navigation": "Satellite Navigation"
    },
    {
        " signals.       Time-keeping and synchronization of clocks has been a critical problem in long-distance ocean navigation. Before ": null
    },
    {
        "radio navigation": "Radio Navigation"
    },
    {
        " and ": null
    },
    {
        "satellite-based navigation": "Radionavigation-Satellite Service"
    },
    {
        ", navigators required accurate time in conjunction with astronomical observations to determine how far east or west their vessel traveled. The invention of an accurate ": null
    },
    {
        "marine chronometer": "Marine Chronometer"
    },
    {
        " revolutionized marine navigation. By the end of the 19th century, important ports provided ": null
    },
    {
        "time signals": "Time Signal"
    },
    {
        " in the form of a signal gun, flag, or dropping ": null
    },
    {
        "time ball": "Time Ball"
    },
    {
        " so that mariners could check their chronometers for error.     Synchronization was important in the operation of 19th century railways, these being the first major means of transport fast enough for differences in ": null
    },
    {
        "local time": "Local Mean Time"
    },
    {
        " between nearby towns to be noticeable. Each line handled the problem by synchronizing all its stations to headquarters as a standard ": null
    },
    {
        "railroad time": "Time Zonerailroad Time"
    },
    {
        ". In some territories, companies shared a single railroad track and needed to avoid collisions. The need for strict timekeeping led the companies to settle on one standard, and civil authorities eventually abandoned local ": null
    },
    {
        "mean solar time": "Mean Solar Time"
    },
    {
        " in favor of that standard.          In ": null
    },
    {
        "electrical engineering": "Electrical Engineering"
    },
    {
        " terms, for digital logic and data transfer, a ": null
    },
    {
        "synchronous circuit": "Synchronous Circuit"
    },
    {
        " requires a ": null
    },
    {
        "clock signal": "Clock Signal"
    },
    {
        ". However, the use of the word clock in this sense is different from the typical sense of a clock as a device that keeps track of time-of-day; the clock signal simply signals the start and/or end of some time period, often very minute , that has an arbitrary relationship to sidereal, solar, or lunar time, or to any other system of measurement of the passage of minutes, hours, and days.     In a different sense, electronic systems are sometimes synchronized to make events at points far apart appear simultaneous or near-simultaneous from a certain perspective. Timekeeping technologies such as the ": null
    },
    {
        "GPS": "Global Positioning System"
    },
    {
        " satellites and ": null
    },
    {
        "Network Time Protocol": "Network Time Protocol"
    },
    {
        " provide real-time access to a close approximation to the ": null
    },
    {
        "UTC": "Utc"
    },
    {
        " timescale and are used for many terrestrial synchronization applications of this kind.     Synchronization is an important concept in the following fields:   ": null
    },
    {
        "Computer science": "Synchronization"
    },
    {
        "    Cryptography": "Cryptography"
    },
    {
        " Multimedia": "Multimedia"
    },
    {
        " Neuroscience": "Neural Synchronization"
    },
    {
        " Physics": "Physics"
    },
    {
        "    Synthesizers": "Oscillator Sync"
    },
    {
        " Frame synchronization": "Frame Synchronization"
    },
    {
        " Frame synchronization ": "Frame Synchronization"
    },
    {
        "             Synchronization of multiple interacting ": null
    },
    {
        "dynamical systems": "Dynamical System"
    },
    {
        " can occur when the systems are ": null
    },
    {
        "autonomous oscillators": "Self-Oscillation"
    },
    {
        ". For instance, integrate-and-fire oscillators with either two-way or one-way coupling can synchronize when the strength of the coupling is greater than the differences among the free-running natural oscillator frequencies. Poincare phase oscillators are model systems that can interact and partially synchronize within random or regular networks.  In the case of global synchronization of phase oscillators, an abrupt transition from unsynchronized to full synchronization takes place when the coupling strength exceeds a critical threshold. This is known as the ": null
    },
    {
        "Kuramoto model": "Kuramoto Model"
    },
    {
        " phase transition. Synchronization is an emergent property that occurs in a broad range of dynamical systems, including neural signaling, the beating of the heart and the synchronization of fire-fly light waves.          Synchronization of movement is defined as similar movements between two or more people who are temporally aligned.  This is different to mimicry, as these movements occur after a short delay.  ": null
    },
    {
        "Muscular bonding": "Muscular Bonding"
    },
    {
        " is the idea that moving in time evokes particular emotions.  This sparked some of the first research into movement synchronization and its effects on human emotion.     In groups, synchronization of movement has been shown to increase conformity,  cooperation and trust  . ": null
    },
    {
        "Military step": "Military Step"
    },
    {
        " has long been used for these purposes but more research on group synchronization is needed to determine its effects on the group as a whole and on individuals within a group. In ": null
    },
    {
        "dyads": "Dyad"
    },
    {
        ", groups of two people, synchronization has been demonstrated to increase affiliation,  self-esteem,  compassion and altruistic behaviour  and increase rapport.  During arguments, synchrony between the arguing pair has been noted to decrease, however it is not clear whether this is due to the change in emotion or other factors.  There is evidence to show that movement synchronization requires other people to cause its beneficial effects, as the effect on affiliation does not occur when one of the dyad is synchronizing their movements to something outside the dyad. This is known as interpersonal synchrony.     There has been dispute regarding the true effect of synchrony in these studies. Research in this area detailing the positive effects of synchrony, have attributed this to synchrony alone; however, many of the experiments incorporate a shared intention to achieve synchrony. Indeed, the Reinforcement of Cooperation Model suggests that perception of synchrony leads to reinforcement that cooperation is occurring, which leads to the pro-social effects of synchrony.  More research is required to separate the effect of intentionality from the beneficial effect of synchrony.         ": null
    },
    {
        "sound film": "Sound Film"
    },
    {
        ". Synchronization is important in fields such as ": null
    },
    {
        "digital telephony": "Digital Telephony"
    },
    {
        ", video and ": null
    },
    {
        "digital audio": "Digital Audio"
    },
    {
        " where streams of sampled data are manipulated. More sophisticated film, video, and ": null
    },
    {
        "audio": "Sound"
    },
    {
        " applications use ": null
    },
    {
        "time code": "Time Code"
    },
    {
        " to synchronize audio and video.   In ": null
    },
    {
        "electric power": "Electric Power"
    },
    {
        " systems, ": null
    },
    {
        "alternator synchronization": "Alternator Synchronization"
    },
    {
        " is required when multiple generators are connected to an electrical grid.   ": null
    },
    {
        "Arbiters": "Arbiter"
    },
    {
        " are needed in digital electronic systems such as ": null
    },
    {
        "microprocessors": "Microprocessor"
    },
    {
        " to deal with asynchronous inputs. There are also electronic digital circuits called synchronizers that attempt to perform arbitration in one clock cycle. Synchronizers, unlike arbiters, are prone to failure. .   ": null
    },
    {
        "Encryption": "Encryption"
    },
    {
        " systems usually require some synchronization mechanism to ensure that the receiving cipher is decoding the right bits at the right time.   Automotive ": null
    },
    {
        "transmissions": "Transmission"
    },
    {
        " contain ": null
    },
    {
        "synchronizers": "Synchromesh"
    },
    {
        " that bring the toothed rotating parts to the same rotational velocity before engaging the teeth.   ": null
    },
    {
        "Flash synchronization": "Flash Synchronization"
    },
    {
        " synchronizes the ": null
    },
    {
        "flash": "Flash"
    },
    {
        " with the ": null
    },
    {
        "shutter": "Shutter"
    },
    {
        ".     Some systems may be only approximately synchronized, or ": null
    },
    {
        "plesiochronous": "Plesiochronous"
    },
    {
        ". Some applications require that relative offsets between events be determined. For others, only the ": null
    },
    {
        "order": "Partially Ordered Set"
    }
]