[
    {
        "                 A tank is an ": null
    },
    {
        "armoured fighting vehicle": "Armoured Fighting Vehicle"
    },
    {
        " designed for ": null
    },
    {
        "front-line": "Front-Line"
    },
    {
        " combat. Tanks have heavy ": null
    },
    {
        "firepower": "Firepower"
    },
    {
        ", strong ": null
    },
    {
        "armour": "Vehicle Armour"
    },
    {
        ", and good ": null
    },
    {
        "battlefield": "Battlefield"
    },
    {
        " manoeuvrability provided by ": null
    },
    {
        "tracks": "Continuous Track"
    },
    {
        " and a powerful ": null
    },
    {
        "engine": "Engine"
    },
    {
        "; usually their main armament is mounted in a ": null
    },
    {
        "turret": "Gun Turret"
    },
    {
        ". They are a mainstay of modern 20th and ": null
    },
    {
        "21st century": "21St Century"
    },
    {
        " ground forces and a key part of ": null
    },
    {
        "combined arms": "Combined Arms"
    },
    {
        " combat.     Modern tanks are versatile mobile land ": null
    },
    {
        "weapon system": "Weapon System"
    },
    {
        " platforms that have a mounted large-": null
    },
    {
        "calibre": "Caliber"
    },
    {
        " cannon": "Cannon"
    },
    {
        " called ": null
    },
    {
        "tank gun": "Tank Gun"
    },
    {
        " in a rotating ": null
    },
    {
        "gun turret": "Gun Turret"
    },
    {
        " supplemented by mounted ": null
    },
    {
        "machine guns": "Machine Gun"
    },
    {
        " or other weapons such as ": null
    },
    {
        "anti-tank guided missiles": "Anti-Tank Guided Missile"
    },
    {
        " or ": null
    },
    {
        "rockets": "Rocket"
    },
    {
        ". They have heavy ": null
    },
    {
        "vehicle armour": "Vehicle Armour"
    },
    {
        " which provides protection for the crew, the vehicles weapons, and propulsion systems as well as provide ": null
    },
    {
        "operational mobility": "Operational Mobility"
    },
    {
        " due to its use of tracks rather than wheels which allows the tank to move over rugged terrain and adverse conditions such as mud . These features enable the tank to perform well in a variety of intense combat situations, simultaneously both ": null
    },
    {
        "offensively": "Offensive"
    },
    {
        "  and ": null
    },
    {
        "defensively": "Defence"
    },
    {
        " . ": null
    },
    {
        "von Senger and Etterlin ": "Tankciterefvon Senger Und Etterlin1960"
    },
    {
        ", The Worlds Armored Fighting Vehicles, p. 9. Fully integrating tanks into modern military forces spawned a new era of combat: ": null
    },
    {
        "armoured warfare": "Armoured Warfare"
    },
    {
        ".     There are classes of tanks: some being larger and very heavily armoured and with high calibre guns, while others are smaller, lightly armoured, and equipped with a smaller calibre and lighter gun. These smaller tanks move over terrain with speed and agility and can perform a reconnaissance role in addition to engaging enemy targets. The smaller faster tank would not normally engage in battle with a larger, heavily armoured tank, except during a surprise ": null
    },
    {
        "flanking manoeuvre": "Flanking Manoeuvre"
    },
    {
        ".       The modern tank is the result of a century of development from the first primitive armoured vehicles, due to improvements in technology such as the internal combustion engine, which allowed the rapid movement of heavy armoured vehicles. As a result of these advances, tanks underwent tremendous shifts in capability in the years since their first appearance. ": null
    },
    {
        "Tanks in World War I": "Tanks In World War I"
    },
    {
        " were developed separately and simultaneously by Great Britain and France as a means to break the deadlock of ": null
    },
    {
        "trench warfare": "Trench Warfare"
    },
    {
        " on the ": null
    },
    {
        "Western Front": "Western Front"
    },
    {
        ". The first British prototype, nicknamed ": null
    },
    {
        "Little Willie": "Little Willie"
    },
    {
        ", was constructed at ": null
    },
    {
        "William Foster & Co.": "William Foster  &  Co."
    },
    {
        " in ": null
    },
    {
        "Lincoln, England": "Lincoln, England"
    },
    {
        " in 1915, with leading roles played by Major ": null
    },
    {
        "Walter Gordon Wilson": "Walter Gordon Wilson"
    },
    {
        " who designed the gearbox and hull, and by ": null
    },
    {
        "William Tritton": "William Tritton"
    },
    {
        " of ": null
    },
    {
        "William Foster and Co.": "William Foster  &  Co."
    },
    {
        ", who designed the track plates.  This was a prototype of a new design that would become the British Armys ": null
    },
    {
        "Mark I tank": "Mark I Tank"
    },
    {
        ", the first tank used in combat in September 1916 during the ": null
    },
    {
        "Battle of the Somme": "Battle Of The Somme"
    },
    {
        ". The name tank was adopted by the British during the early stages of their development, as a security measure to conceal their purpose . While the British and French built thousands of tanks in World War I, Germany was unconvinced of the tanks potential, and built only twenty.     ": null
    },
    {
        "Tanks of the interwar period": "Tanks Of The Interwar Period"
    },
    {
        " evolved into the much larger and more powerful ": null
    },
    {
        "designs of World War II": "Tanks In World War Ii"
    },
    {
        ". Important new concepts of armoured warfare were developed; the Soviet Union launched ": null
    },
    {
        "the first mass tank/air attack at Khalkhin Gol": "Battles Of Khalkhin Gol"
    },
    {
        "  in August 1939, ": null
    },
    {
        "Coox ": "Tankciterefcoox1939"
    },
    {
        ", p. 579, 590, 663 and later developed the ": null
    },
    {
        "T-34": "T-34"
    },
    {
        ", one of the predecessors of the ": null
    },
    {
        "main battle tank": "Main Battle Tank"
    },
    {
        ". Less than two weeks later, Germany began their large-scale armoured campaigns that would become known as ": null
    },
    {
        "blitzkrieg": "Blitzkrieg"
    },
    {
        " – massed concentrations of tanks combined with ": null
    },
    {
        "motorised": "Motorized Infantry"
    },
    {
        " and ": null
    },
    {
        "mechanised infantry": "Mechanised Infantry"
    },
    {
        ", ": null
    },
    {
        "artillery": "Artillery"
    },
    {
        " and ": null
    },
    {
        "air power": "Air Power"
    },
    {
        " designed to break through the ": null
    },
    {
        "enemy front": "Front"
    },
    {
        " and collapse enemy resistance.     The widespread introduction of ": null
    },
    {
        "high-explosive anti-tank warheads": "High-Explosive Anti-Tank Warhead"
    },
    {
        " during the second half of World War II led to lightweight infantry-carried anti-tank weapons such as the ": null
    },
    {
        "Panzerfaust": "Panzerfaust"
    },
    {
        ", which could destroy some types of tanks. ": null
    },
    {
        "Tanks in the Cold War": "Tanks In The Cold War"
    },
    {
        " were designed with these weapons in mind, and led to greatly improved armour types during the 1960s, especially ": null
    },
    {
        "composite armour": "Composite Armour"
    },
    {
        ". Improved engines, transmissions and suspensions allowed tanks of this period to grow larger. Aspects of gun technology changed significantly as well, with advances in shell design and aiming technology.     During the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ", the ": null
    },
    {
        "main battle tank": "Main Battle Tank"
    },
    {
        " concept arose and became a key component of modern armies. In the 21st century, with the increasing role of ": null
    },
    {
        "asymmetrical warfare": "Asymmetrical Warfare"
    },
    {
        " and the end of the Cold War, that also contributed to the increase of cost-effective ": null
    },
    {
        "anti-tank rocket propelled grenades": "Rocket Propelled Grenade"
    },
    {
        " worldwide and its successors, the ability of tanks to operate independently has declined. Modern tanks are more frequently organized into ": null
    },
    {
        "combined arms": "Combined Arms"
    },
    {
        " units which involve the support of ": null
    },
    {
        "infantry": "Infantry"
    },
    {
        ", who may accompany the tanks in ": null
    },
    {
        "infantry fighting vehicles": "Infantry Fighting Vehicle"
    },
    {
        ", and supported by ": null
    },
    {
        "reconnaissance": "Reconnaissance Aircraft"
    },
    {
        " or ": null
    },
    {
        "ground-attack aircraft": "Ground-Attack Aircraft"
    },
    {
        ".                  The tank is the 20th century realization of an ancient concept: that of providing troops with mobile protection and firepower. The ": null
    },
    {
        "internal combustion engine": "Internal Combustion Engine"
    },
    {
        ", ": null
    },
    {
        "armour plate": "Armour Plate"
    },
    {
        ", and ": null
    },
    {
        "continuous track": "Continuous Track"
    },
    {
        " were key innovations leading to the invention of the modern tank.        Many sources imply that ": null
    },
    {
        "Leonardo da Vinci": "Leonardo Da Vinci"
    },
    {
        " and ": null
    },
    {
        "H.G. Wells": "H.G. Wells"
    },
    {
        " in some way foresaw or invented the tank. Leonardos late 15th century drawings of what some describe as a tank show a man-powered, wheeled vehicle with cannons all around it. However the human crew would not have enough power to move it over larger distance, and usage of animals was problematic in a space so confined. In the 15th century, ": null
    },
    {
        "Jan Žižka": "Jan Žižka"
    },
    {
        " built armoured wagons containing cannons and used them effectively in several battles. The continuous caterpillar track arose from attempts to improve the mobility of wheeled vehicles by spreading their weight, reducing ground pressure, and increasing their traction. Experiments can be traced back as far as the 17th century, and by the late nineteenth they existed in various recognizable and practical forms in several countries.     It is frequently claimed that Richard Lovell Edgeworth created a caterpillar track. It is true that in 1770 he patented a machine, that should carry and lay down its own road , but this was Edgeworths choice of words. His own account in his autobiography is of a horse-drawn wooden carriage on eight retractable legs, capable of lifting itself over high walls. The description bears no similarity to a caterpillar track. Edgeworth, R. & E. Memoirs of Richard Lovell Edgeworth, 1820, pp. 164–66 Armoured trains appeared in the mid-19th century, and various armoured steam and petrol-engined vehicles were also proposed.     The machines described in Wells 1903 short story  The Land Ironclads  are a step closer, insofar as they are armour-plated, have an internal power plant, and are able to cross trenches.  Some aspects of the story foresee the tactical use and impact of the tanks that later came into being. However, Wells vehicles were driven by steam and moved on ": null
    },
    {
        "pedrail wheel": "Pedrail Wheels"
    },
    {
        ", technologies that were already outdated at the time of writing. After seeing British tanks in 1916, Wells denied having invented them, writing, Yet let me state at once that I was not their prime originator. I took up an idea, manipulated it slightly, and handed it on.  It is, though, possible that one of the British tank pioneers, ": null
    },
    {
        "Ernest Swinton": "Ernest Dunlop Swinton"
    },
    {
        ", was subconsciously or otherwise influenced by Wells tale. Harris, J.P. Men, Ideas, and Tanks. Manchester University Press, 1995. p. 38 Gannon, Charles E. Rumors of War and Infernal Machines: Liverpool University Press, 2003. p. 67     The first combinations of the three principal components of the tank appeared in the decade before World War One. In 1903, ": null
    },
    {
        "Captain Léon René Levavasseur": "Levavasseur Project"
    },
    {
        " of the French Artillery proposed mounting a field gun in an armoured box on tracks. Major William E. Donohue, of the British Armys Mechanical Transport Committee, suggested fixing a gun and armoured shield on a British type of track-driven vehicle. The Devils Chariots: The Birth and Secret Battles of the First Tanks John Glanfield  The first ": null
    },
    {
        "armoured car": "Armored Car"
    },
    {
        " was produced in Austria in 1904. However, all were restricted to rails or reasonably passable terrain. It was the development of a practical ": null
    },
    {
        "caterpillar track": "Caterpillar Track"
    },
    {
        " that provided the necessary independent, all-terrain mobility.     In a memorandum of 1908, Antarctic explorer ": null
    },
    {
        "Robert Falcon Scott": "Robert Falcon Scott"
    },
    {
        " presented his view that man-hauling to the South Pole was impossible and that motor traction was needed. RF Scott The Sledging Problem in the Antarctic, Men versus Motors Snow vehicles did not yet exist however, and so his engineer ": null
    },
    {
        "Reginald Skelton": "Reginald Skelton"
    },
    {
        " developed the idea of a caterpillar track for snow surfaces. Roland Huntford Scott and Amundsen. Their Race to the South Pole. The Last Place on Earth. Abacus, London, p. 224 These tracked motors were built by the ": null
    },
    {
        "Wolseley Tool and Motor Car Company": "Wolseley Motors"
    },
    {
        " in Birmingham, tested in Switzerland and Norway, and can be seen in action in ": null
    },
    {
        "Herbert Pontings": "Herbert Ponting"
    },
    {
        " 1911 documentary film of Scotts Antarctic ": null
    },
    {
        "Terra Nova Expedition": "Terra Nova Expedition"
    },
    {
        " . Scott died during the expedition in 1912, but expedition member and biographer ": null
    },
    {
        "Apsley Cherry-Garrard": "Apsley Cherry-Garrard"
    },
    {
        " credited Scotts motors with the inspiration for the British World War I tanks, writing: Scott never knew their true possibilities; for they were the direct ancestors of the tanks in France .      In 1911, a Lieutenant Engineer in the Austrian Army, ": null
    },
    {
        "Günther Burstyn": "Günther Burstyn"
    },
    {
        ", presented to the Austrian and Prussian War Ministries plans for a light, three-man tank with a gun in a revolving turret, the so-called ": null
    },
    {
        "Burstyn-Motorgeschütz": "Burstyn-Motorgeschütz"
    },
    {
        ". Gunther Burstyn Angwetter, D. & E.  In the same year an Australian civil engineer named ": null
    },
    {
        "Lancelot de Mole": "Lancelot De Mole"
    },
    {
        " submitted a basic design for a tracked, armoured vehicle to the British War Office.  In Russia, ": null
    },
    {
        "Vasiliy Mendeleev": "Vasiliy Mendeleev"
    },
    {
        " designed a tracked vehicle containing a large naval gun. Russian tanks, 1900–1970 The Complete Illustrated History of Soviet Armoured Theory and Design John Milsom  All of these ideas were rejected and, by 1914, forgotten . Various individuals continued to contemplate the use of tracked vehicles for military applications, but by the outbreak of the War no one in a position of responsibility in any army gave much thought to tanks.                        From late 1914 a small number of middle-ranking ": null
    },
    {
        "British Army": "British Army"
    },
    {
        " officers tried to persuade the War Office and the Government to consider the creation of armoured vehicles. Amongst their suggestions was the use of caterpillar tractors, but although the Army used many such vehicles for towing heavy guns, it could not be persuaded that they could be adapted as armoured vehicles. The consequence was that early tank development in Great Britain was carried out by the ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        ".      As the result of an approach by Royal Naval Air Service officers who had been operating armoured cars on the Western Front, the ": null
    },
    {
        "First Lord of the Admiralty": "First Lord Of The Admiralty"
    },
    {
        ", ": null
    },
    {
        "Winston Churchill": "Winston Churchill"
    },
    {
        " formed the ": null
    },
    {
        "Landship Committee": "Landship Committee"
    },
    {
        ", on 20 February 1915. Churchill, p. 316 The ": null
    },
    {
        "Director of Naval Construction": "Director Of Naval Construction"
    },
    {
        " for the Royal Navy, ": null
    },
    {
        "Eustace Tennyson dEyncourt": "Eustace Tennyson Deyncourt"
    },
    {
        ", was appointed to head the Committee in view of his experience with the engineering methods it was felt might be required; the two other members were naval officers, and a number of industrialists were engaged as consultants. So many played a part in its long and complicated development that it is not possible to name any individual as the sole inventor of the tank. Churchill, p. 317     However leading roles were played by Lt ": null
    },
    {
        "Walter Gordon Wilson": "Walter Gordon Wilson"
    },
    {
        " R.N. who designed the gearbox and developed practical tracks and by ": null
    },
    {
        "William Tritton": "William Tritton"
    },
    {
        " whose agricultural machinery company, ": null
    },
    {
        "William Foster & Co.": "William Foster  &  Co."
    },
    {
        " in ": null
    },
    {
        "Lincoln, Lincolnshire": "Lincoln, Lincolnshire"
    },
    {
        ", England built the ": null
    },
    {
        "prototypes": "Prototype"
    },
    {
        ".  On 22 July 1915, a commission was placed to design a machine that could cross a trench 4  ft wide. Secrecy surrounded the project with the designers locking themselves in a room at the White Hart Hotel in Lincoln. The committees first design, ": null
    },
    {
        "Little Willie": "Little Willie"
    },
    {
        ", ran for the first time in September 1915 and served to develop the form of the track but an improved design, better able to cross trenches, swiftly followed and in January 1916 the prototype, nicknamed Mother , was adopted as the design for future tanks. The first order for tanks was placed on 12 February 1916, and a second on 21 April. Fosters built 37 , and Metropolitan Carriage, Wagon, and Finance Company, of Birmingham, 113 , a total of 150. Glanfield, Appendix 2. Production models of ": null
    },
    {
        " Male ": "Male Tank"
    },
    {
        " tanks and ": null
    },
    {
        " Females ": "Female Tank"
    },
    {
        " would go on to fight in historys first tank action at the Somme in September 1916. McMillan, N: Locomotive Apprentice at the North British Locomotive Company Ltd Glasgow Plateway Press 1992 Great Britain produced about 2,600 tanks of various types during the war. Glanfield, Devils Chariots The first tank to engage in battle was designated D1, a British ": null
    },
    {
        "Mark I": "Mark I Tank"
    },
    {
        " Male, during the ": null
    },
    {
        "Battle of Flers-Courcelette": "Battle Of Flers-Courcelette"
    },
    {
        " on 15 September 1916. ": null
    },
    {
        "Regan ": "Tankciterefregan1993"
    },
    {
        ", The Guinness Book of More Military Blunders, p. 12 Bert Chaney, a nineteen-year-old signaller with the 7th London Territorial Battalion, reported that three huge mechanical monsters such as had never seen before rumbled their way onto the battlefield, frightening the ": null
    },
    {
        "Jerries": "List Of Terms Used For Germansjerry"
    },
    {
        " out of their wits and making them scuttle like frightened rabbits. The Mammoth Book of How it Happened, Robinson Publishing, 2000, , pp. 337–38 When the news of the first use of the tanks emerged, Prime Minister ": null
    },
    {
        "David Lloyd George": "David Lloyd George"
    },
    {
        " commented,                   Whilst several experimental machines were investigated in France, it was a colonel of artillery, ": null
    },
    {
        "J.B.E. Estienne": "Jean Baptiste Eugène Estienne"
    },
    {
        ", who directly approached the Commander-in-Chief with detailed plans for a tank on caterpillar tracks, in late 1915. The result was two largely unsatisfactory types of tank, 400 each of the ": null
    },
    {
        "Schneider": "Schneider Ca1"
    },
    {
        " and ": null
    },
    {
        "Saint-Chamond": "Saint-Chamond"
    },
    {
        ", both based on the ": null
    },
    {
        "Holt Tractor": "Holt Tractor"
    },
    {
        ".     The following year, the French pioneered the use of a full 360° rotation ": null
    },
    {
        "turret": "Gun Turret"
    },
    {
        " in a tank for the first time, with the creation of the ": null
    },
    {
        "Renault FT": "Renault Ft"
    },
    {
        " light tank, with the turret containing the tanks main armament. In addition to the traversible turret, another innovative feature of the FT was its engine located at the rear. This pattern, with the gun located in a mounted turret and the engine at the back, has become the standard for most succeeding tanks across the world even to this day. Steven J. Zaloga, The Renault FT Light Tank, London 1988, p. 3 The FT was the most numerous tank of the war; over 3,000 were made by late 1918.         Germany fielded very few tanks during ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ", and started development only after encountering British tanks on the Somme. The ": null
    },
    {
        "A7V": "A7V"
    },
    {
        ", the only type made, was introduced in March 1918. with just 20 being produced during the war. ": null
    },
    {
        "Willmott ": "Willmott2003"
    },
    {
        ", First World War, p. 222 The first tank versus tank action took place on 24 April 1918 at the ": null
    },
    {
        "Second Battle of Villers-Bretonneux": "Second Battle Of Villers-Bretonneux"
    },
    {
        ", France, when three British ": null
    },
    {
        "Mark IVs": "Mark Iv Tank"
    },
    {
        " met three German ": null
    },
    {
        "A7Vs": "A7V"
    },
    {
        ". Captured British Mk IVs formed the bulk of Germanys tank forces during World War I; about 35 were in service at any one time. Plans to expand the tank programme were under way when the War ended.         The United States ": null
    },
    {
        "Tank Corps": "Tank Corps Of The American Expeditionary Force"
    },
    {
        " used tanks supplied by France and Great Britain during World War I. Production of American-built tanks had just begun when the War came to an end. Italy also manufactured two ": null
    },
    {
        "Fiat 2000s": "Fiat 2000"
    },
    {
        " towards the end of the war, too late to see service. Russia independently built and trialed two prototypes early in the War; the tracked, two-man ": null
    },
    {
        "Vezdekhod": "Vezdekhod"
    },
    {
        " and the huge ": null
    },
    {
        "Lebedenko": "Tsar Tank"
    },
    {
        ", but neither went into production. A tracked self-propelled gun was also designed but not produced.      Although tank tactics developed rapidly during the war, piecemeal deployments, mechanical problems, and poor mobility limited the military significance of the tank in World War I, and the tank did not fulfil its promise of rendering trench warfare obsolete. Nonetheless, it was clear to military thinkers on both sides that tanks in some way could have a significant role in future conflicts. ": null
    },
    {
        "Willmott ": "Willmott2003"
    },
    {
        ", First World War             In the ": null
    },
    {
        "interwar period": "History Of The Tankbetween The Wars"
    },
    {
        " tanks underwent further mechanical development. In terms of tactics, ": null
    },
    {
        "J.F.C. Fullers": "J.F.C. Fuller"
    },
    {
        " doctrine of spearhead attacks with massed tank formations was the basis for work by ": null
    },
    {
        "Heinz Guderian": "Heinz Guderian"
    },
    {
        " in Germany, ": null
    },
    {
        "Percy Hobart": "Percy Hobart"
    },
    {
        " in Britain, ": null
    },
    {
        "Adna R. Chaffee, Jr.": "Adna R. Chaffee, Jr."
    },
    {
        ", in the US, ": null
    },
    {
        "Charles de Gaulle": "Charles De Gaulle"
    },
    {
        " in France, and ": null
    },
    {
        "Mikhail Tukhachevsky": "Mikhail Tukhachevsky"
    },
    {
        " in the USSR. ": null
    },
    {
        "Liddell Hart": "B. H. Liddell Hart"
    },
    {
        " held a more moderate view that all arms – cavalry, infantry and artillery – should be mechanized and work together. The British formed the all-arms ": null
    },
    {
        "Experimental Mechanized Force": "Experimental Mechanized Force"
    },
    {
        " to test the use of tanks with supporting forces.     In the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        " only Germany would initially put the theory into practice on a large scale, and it was their superior tactics and French blunders, not superior weapons, that made the blitzkrieg so successful in May 1940. For information regarding tank development in this period, see ": null
    },
    {
        "tank development between the wars": "History Of The Tankbetween The Wars"
    },
    {
        ".     Germany, Italy and the Soviet Union all experimented heavily with tank warfare during their clandestine and “volunteer” involvement in the ": null
    },
    {
        "Spanish Civil War": "Spanish Civil War"
    },
    {
        ", which saw some of the earliest examples of successful mechanised combined arms  —such as when ": null
    },
    {
        "Republican": "Second Spanish Republic"
    },
    {
        " troops, equipped with Soviet-supplied tanks and supported by aircraft, eventually routed Italian troops fighting for the ": null
    },
    {
        "Nationalists": "Nationalists"
    },
    {
        " in the seven-day ": null
    },
    {
        "Battle of Guadalajara": "Battle Of Guadalajara"
    },
    {
        " in 1937. ": null
    },
    {
        "Time ": "Timeapril1937"
    },
    {
        ", Chewed up However, of the nearly 700 tanks deployed during this conflict, only about 64 tanks representing the Franco faction and 331 from the Republican side were equipped with cannon, and of those 64 nearly all were ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " vintage ": null
    },
    {
        "Renault FT": "Renault Ft"
    },
    {
        " tanks, while the 331 Soviet supplied machines had 45mm main guns and were of 1930s manufacture. Manrique p. 311, 321, 324 The balance of Nationalist tanks were machine gun armed. The primary lesson learned from this war was that machine gun armed tanks had to be equipped with cannon, with the associated armour inherent to modern tanks.     The five-month-long war between the Soviet Union and the Japanese 6th Army at Khalkhin Gol  in 1939 brought home some lessons. In this conflict, the Soviets fielded over two thousand tanks, to the around 73 cannon armed tanks deployed by the Japanese, Goldman p. 19 the major difference being that Japanese armour were equipped with ": null
    },
    {
        "diesel": "Diesel Engine"
    },
    {
        " engines as opposed to the Russian tanks equipped with ": null
    },
    {
        "petrol": "Petrol"
    },
    {
        " engines. Coox p. 300, 318, 437 After General ": null
    },
    {
        "Georgy Zhukov": "Georgy Zhukov"
    },
    {
        " inflicted a defeat on the Japanese 6th Army with his massed combined tank and air attack, the Soviets learned a lesson on the use of ": null
    },
    {
        "gasoline": "Gasoline"
    },
    {
        " engines, and quickly incorporated those newly found experiences into their new ": null
    },
    {
        "T-34": "T-34"
    },
    {
        " medium tank during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ". Coox 998     Prior to World War II, the tactics and strategy of deploying tank forces underwent a revolution. In August 1939, Soviet General ": null
    },
    {
        "Georgy Zhukov": "Georgy Zhukov"
    },
    {
        " used the combined force of tanks and airpower at ": null
    },
    {
        "Nomonhan": "Nomonhan"
    },
    {
        " against the Japanese 6th Army; Coox p. 579, 590, 663 ": null
    },
    {
        "Heinz Guderian": "Heinz Guderian"
    },
    {
        ", a tactical theoretician who was heavily involved in the formation of the first independent German tank force, said Where tanks are, the front is , and this concept became a reality in World War II. ": null
    },
    {
        "Cooper and Lucas ": "Cooper1979"
    },
    {
        ",  Panzer : The Armored Force of the Third Reich, p. 9 Guderians armoured warfare ideas, combined with Germanys existing doctrines of Bewegungskrieg  and ": null
    },
    {
        "infiltration tactics": "Infiltration Tactics"
    },
    {
        " from World War I, became the basis of ": null
    },
    {
        "blitzkrieg": "Blitzkrieg"
    },
    {
        " in the opening stages of World War II.             During ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", the first conflict in which armoured vehicles were critical to battlefield success, the tank and related tactics developed rapidly. Armoured forces proved capable of tactical victory in an unprecedentedly short amount of time, yet new ": null
    },
    {
        "anti-tank": "Anti-Tank"
    },
    {
        " weaponry showed that the tank was not invulnerable. During the Invasion of Poland, tanks performed in a more traditional role in close cooperation with infantry units, but in the ": null
    },
    {
        "Battle of France": "Battle Of France"
    },
    {
        " deep independent armoured penetrations were executed by the Germans, a technique later called blitzkrieg. Blitzkrieg used innovative ": null
    },
    {
        "combined arms": "Combined Arms"
    },
    {
        " tactics and radios in all of the tanks to provide a level of tactical flexibility and power that surpassed that of the Allied armour. The ": null
    },
    {
        "French Army": "French Army"
    },
    {
        ", with tanks equal or superior to the German tanks in both quality and quantity, employed a linear defensive strategy in which the armoured cavalry units were made subservient to the needs of the infantry armies to cover their entrenchment in Belgium. ": null
    },
    {
        "Deighton ": "Deighton1979"
    },
    {
        ", Blitzkrieg, From the rise of Hitler to the fall of Dunkirk. In addition, they lacked radios in many of their tanks and headquarters, ": null
    },
    {
        "Forty ": "Tankciterefforty2004"
    },
    {
        ", p. 251. which limited their ability to respond to German attacks.     In accordance with blitzkrieg methods, German tanks bypassed enemy strongpoints and could radio for ": null
    },
    {
        "close air support": "Close Air Support"
    },
    {
        " to destroy them, or leave them to the infantry. A related development, ": null
    },
    {
        "motorized infantry": "Motorized Infantry"
    },
    {
        ", allowed some of the troops to keep up with the tanks and create highly mobile combined arms forces. The defeat of a major military power within weeks shocked the rest of the world, spurring tank and anti-tank weapon development.        The ": null
    },
    {
        "North African Campaign": "North African Campaign"
    },
    {
        " also provided an important battleground for tanks, as the flat, desolate terrain with relatively few obstacles or urban environments was ideal for conducting mobile armoured warfare. However, this battlefield also showed the importance of ": null
    },
    {
        "logistics": "Logistics"
    },
    {
        ", especially in an armoured force, as the principal warring armies, the German ": null
    },
    {
        "Afrika Korps": "Afrika Korps"
    },
    {
        " and the ": null
    },
    {
        "British Eighth Army": "British Eighth Army"
    },
    {
        ", often outpaced their supply trains in repeated attacks and counter-attacks on each other, resulting in complete stalemate. This situation would not be resolved until 1942, when during the ": null
    },
    {
        "Second Battle of El Alamein": "Second Battle Of El Alamein"
    },
    {
        ", the Afrika Korps, crippled by disruptions in their supply lines, had 95% of its tanks destroyed  and was forced to retreat by a massively reinforced ": null
    },
    {
        "Eighth Army": "Eighth Army"
    },
    {
        ", the first in a series of defeats that would eventually lead to the surrender of the remaining Axis forces in ": null
    },
    {
        "Tunisia": "Tunisian Campaign"
    },
    {
        ".        When Germany launched its invasion of the Soviet Union, ": null
    },
    {
        "Operation Barbarossa": "Operation Barbarossa"
    },
    {
        ", the Soviets had a superior tank design, the ": null
    },
    {
        "T-34": "T-34"
    },
    {
        ". ": null
    },
    {
        "Zaloga et al. ": "Zaloga1997"
    },
    {
        " A lack of preparations for the ": null
    },
    {
        "Axis": "Axis Powers"
    },
    {
        " surprise attack, mechanical problems, poor training of the crews and incompetent leadership caused the Soviet machines to be surrounded and destroyed in large numbers. However, interference from ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        ", Stolfi, Hitlers Panzers East the geographic scale of the conflict, the dogged resistance of the Soviet combat troops, and the Soviets massive advantages in manpower and production capability prevented a repeat of the Blitzkrieg of 1940. ": null
    },
    {
        "Deighton ": "Deighton1979"
    },
    {
        ", Blitzkrieg, From the rise of Hitler to the fall of Dunkirk, p 307 Despite early successes against the Soviets, the Germans were forced to up-gun their Panzer IVs, and to design and build both the larger and more expensive ": null
    },
    {
        "Tiger": "Tiger I"
    },
    {
        " heavy tank in 1942, and the ": null
    },
    {
        "Panther": "Panther Tank"
    },
    {
        " medium tank the following year. In doing so, the Wehrmacht denied the infantry and other support arms the production priorities that they needed to remain equal partners with the increasingly sophisticated tanks, in turn violating the principle of combined arms they had pioneered. ": null
    },
    {
        "House ": "Tankciterefhouse1984"
    },
    {
        ", Toward Combined Arms Warfare:A Survey of 20th Century Tactics, Doctrine, and Organization  Soviet developments following the invasion included upgunning the T-34, development of self-propelled anti-tank guns such as the ": null
    },
    {
        "SU-152": "Su-152"
    },
    {
        ", and deployment of the ": null
    },
    {
        "IS-2": "Is-2"
    },
    {
        " in the closing stages of the war, with the T-34 being the most produced tank of World War II, totalling up to some 65,000 examples by May 1945.        Much like the Soviets, when entering World War II six months later , the United States ": null
    },
    {
        "mass production": "Mass Production"
    },
    {
        " capacity enabled it to rapidly construct thousands of relatively cheap ": null
    },
    {
        "M4 Sherman": "M4 Sherman"
    },
    {
        " medium tanks. A compromise all round, the Sherman was reliable and formed a large part of the Anglo-American ground forces, but in a tank-versus-tank battle was no match for the Panther or Tiger. ": null
    },
    {
        "Cawthorne ": "Tankciterefcawthorne2003"
    },
    {
        ", Steel Fist: Tank Warfare 1939–45, p. 211 Numerical and logistical superiority and the successful use of combined arms allowed the Allies to overrun the German forces during the ": null
    },
    {
        "Battle of Normandy": "Invasion Of Normandy"
    },
    {
        ". Upgunned versions with the ": null
    },
    {
        "76 mm gun M1": "76 Mm Gun M1"
    },
    {
        " and the ": null
    },
    {
        "17-pounder": "Sherman Firefly"
    },
    {
        " were introduced to improve the M4s firepower, but concerns about protection remained—despite the apparent armour deficiencies, a total of some 42,000 Shermans were built and delivered to the Allied nations using it during the war years, a total second only to the T-34.     Tank ": null
    },
    {
        "hulls": "Chassis"
    },
    {
        " Starry pp. 45, 79, 129, 143, 153, etc were modified to produce ": null
    },
    {
        "flame tanks": "Flame Tank"
    },
    {
        ", mobile ": null
    },
    {
        "rocket artillery": "Rocket Artillery"
    },
    {
        ", and ": null
    },
    {
        "combat engineering": "Combat Engineering"
    },
    {
        " vehicles for tasks including ": null
    },
    {
        "mine-clearing": "Demining"
    },
    {
        " and ": null
    },
    {
        "bridging": "Bridge"
    },
    {
        ". Specialised self-propelled guns, most of which could double as ": null
    },
    {
        "tank destroyers": "Tank Destroyer"
    },
    {
        ", were also both developed by the Germans—with their  Sturmgeschütz ,  Panzerjäger  and  Jagdpanzer  vehicles—and the  Samokhodnaya ustanovka  families of AFVs for the Soviets: such turretless, ": null
    },
    {
        "casemate": "Casematearmored Vehicles"
    },
    {
        "-style ": null
    },
    {
        "tank destroyers": "Tank Destroyer"
    },
    {
        " and ": null
    },
    {
        "assault guns": "Assault Gun"
    },
    {
        " were less complex, stripped down tanks carrying heavy guns, solely firing forward. The firepower and low cost of these vehicles made them attractive but as manufacturing techniques improved and larger turret rings made larger tank guns feasible, the ": null
    },
    {
        "gun turret": "Gun Turret"
    },
    {
        " was recognised as the most effective mounting for the main gun to allow movement in a different direction from firing, enhancing tactical flexibility.               During the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ", tension between the ": null
    },
    {
        "Warsaw Pact": "Warsaw Pact"
    },
    {
        " countries and North Atlantic Treaty Organisation  countries created an ": null
    },
    {
        "arms race": "Arms Race"
    },
    {
        " that ensured that tank development proceeded largely as it had during World War II. The essence of tank designs during the Cold War had been hammered out in the closing stages of World War II. Large turrets, capable suspension systems, greatly improved engines, ": null
    },
    {
        "sloped armour": "Sloped Armour"
    },
    {
        " and large-calibre guns were standard. Tank design during the Cold War built on this foundation and included improvements to ": null
    },
    {
        "fire control": "Fire-Control System"
    },
    {
        ", ": null
    },
    {
        "gyroscopic": "Gyroscopic"
    },
    {
        " gun stabilisation, communications and crew comfort and saw the introduction of ": null
    },
    {
        "laser": "Laser"
    },
    {
        " rangefinders and ": null
    },
    {
        "infrared": "Infrared"
    },
    {
        " night vision equipment. ": null
    },
    {
        "Armour technology": "Composite Armour"
    },
    {
        " progressed in an ongoing race against improvements in ": null
    },
    {
        "anti-tank weapons": "Anti-Tank Weapons"
    },
    {
        ", especially ": null
    },
    {
        "antitank guided missiles": "Guided Missiles"
    },
    {
        " like the ": null
    },
    {
        "TOW": "Bgm-71 Tow"
    },
    {
        ".        Medium tanks of World War II evolved into the  main battle tank  of the Cold War and took over the majority of tank roles on the battlefield. This gradual transition occurred in the 1950s and 1960s due to ": null
    },
    {
        "anti-tank": "Anti-Tank"
    },
    {
        " guided missiles": "Guided Missiles"
    },
    {
        ", ": null
    },
    {
        "sabot": "Armour-Piercing Discarding Sabot"
    },
    {
        " ammunition and ": null
    },
    {
        "high explosive anti-tank": "High Explosive Anti-Tank"
    },
    {
        " warheads. World War II had shown that the speed of a light tank was no substitute for armour & firepower and medium tanks were vulnerable to newer weapon technology, rendering them ": null
    },
    {
        "obsolete": "Obsolete"
    },
    {
        ".      In a trend started in World War II, ": null
    },
    {
        "economies of scale": "Economies Of Scale"
    },
    {
        " led to serial production of progressively upgraded models of all major tanks during the Cold War. For the same reason many upgraded post-World War II tanks and their derivatives  remain in active service around the world, and even an obsolete tank may be the most formidable weapon on battlefields in many parts of the world. Steven Zaloga and Hugh Johnson , T-54 and T-55 Main Battle Tanks 1944–2004, Osprey, 39–41, , p. 43 Among the tanks of the 1950s were the British ": null
    },
    {
        "Centurion": "Centurion Tank"
    },
    {
        " and Soviet T-54/55 in service from 1946, and the US ": null
    },
    {
        "M48": "M48 Patton"
    },
    {
        " from 1951. ": null
    },
    {
        "von Senger und Etterlin ": "Tankciterefvon Senger Und Etterlin1960"
    },
    {
        ", The Worlds Armoured Fighting Vehicles, pp. 61, 118, 183 These three vehicles formed the bulk of the armoured forces of NATO and the Warsaw Pact throughout much of the Cold War. Lessons learned from tanks such as the ": null
    },
    {
        "Leopard 1": "Leopard 1"
    },
    {
        ", ": null
    },
    {
        "M48 Patton series": "M48 Patton"
    },
    {
        ", ": null
    },
    {
        "Chieftain": "Chieftain Tank"
    },
    {
        ", and T-72 led to the contemporary ": null
    },
    {
        "Leopard 2": "Leopard 2"
    },
    {
        ", ": null
    },
    {
        "M1 Abrams": "M1 Abrams"
    },
    {
        ", ": null
    },
    {
        "Challenger 2": "Challenger 2 Tank"
    },
    {
        ", ": null
    },
    {
        "C1 Ariete": "C1 Ariete"
    },
    {
        ", ": null
    },
    {
        "T-90": "T-90"
    },
    {
        " and ": null
    },
    {
        "Merkava IV": "Merkava"
    },
    {
        ".     Tanks and anti-tank weapons of the Cold War era saw action in a number of ": null
    },
    {
        "proxy wars": "Proxy War"
    },
    {
        " like the ": null
    },
    {
        "Korean War": "Korean War"
    },
    {
        ", ": null
    },
    {
        "Vietnam War": "Vietnam War"
    },
    {
        ", ": null
    },
    {
        "Indo-Pakistani War of 1971": "Indo-Pakistani War Of 1971"
    },
    {
        ", ": null
    },
    {
        "Soviet–Afghan War": "Soviet–Afghan War"
    },
    {
        " and Arab-Israeli conflicts, culminating with the ": null
    },
    {
        "Yom Kippur War": "Yom Kippur War"
    },
    {
        ". The T-55, for example, has seen action in no fewer than ": null
    },
    {
        "32 conflicts": "T-54/55Other Conflicts"
    },
    {
        ". In these wars the U.S. or NATO countries and the Soviet Union or China consistently backed opposing forces. Proxy wars were studied by Western and Soviet ": null
    },
    {
        "military analysts": "Military Intelligence"
    },
    {
        " and provided a contribution to the Cold War tank development process.             The role of tank vs. tank combat is becoming diminished. Tanks work in concert with infantry in urban warfare by deploying them ahead of the platoon. When engaging enemy infantry, tanks can provide covering fire on the battlefield. Conversely, tanks can spearhead attacks when infantry are deployed in personnel carriers.      Tanks were used to spearhead the initial US invasion of Iraq in 2003. As of 2005, there were 1,100 ": null
    },
    {
        "M1 Abrams": "M1 Abrams"
    },
    {
        " used by the ": null
    },
    {
        "United States Army": "United States Army"
    },
    {
        " in the course of the ": null
    },
    {
        "Iraq War": "Iraq War"
    },
    {
        ", and they have proven to have an unexpectedly high level of vulnerability to ": null
    },
    {
        "roadside bombs": "Roadside Bomb"
    },
    {
        ". ": null
    },
    {
        "USA Today ": "Usatoday2005A"
    },
    {
        ", Tank takes a beating in Iraq A relatively new type of remotely detonated mine, the ": null
    },
    {
        "explosively formed penetrator": "Explosively Formed Penetrator"
    },
    {
        " has been used with some success against American armoured vehicles . However, with upgrades to their armour in the rear, M1s have proven invaluable in fighting insurgents in urban combat, particularly at the ": null
    },
    {
        "Battle of Fallujah": "Second Battle Of Fallujah"
    },
    {
        ", where the US Marines brought in two extra brigades. Britain deployed its ": null
    },
    {
        "Challenger 2": "Challenger 2"
    },
    {
        " tanks to support its operations in southern Iraq.     ": null
    },
    {
        "Israel": "Israel"
    },
    {
        "i ": null
    },
    {
        "Merkava": "Merkava"
    },
    {
        " tanks contain features that enable them to support ": null
    },
    {
        "infantry": "Infantry"
    },
    {
        " in ": null
    },
    {
        "low intensity conflicts": "Low Intensity Conflict"
    },
    {
        " and ": null
    },
    {
        "counter-terrorism": "Counter-Terrorism"
    },
    {
        " operations. Such features are the rear door and rear corridor, enabling the tank to carry infantry and embark safely; the ": null
    },
    {
        "IMI": "Israeli Military Industries"
    },
    {
        " APAM-MP-T": "Apam-Mp-T"
    },
    {
        " multi-purpose ammunition round, advanced ": null
    },
    {
        "C4IS": "C4Is"
    },
    {
        " systems and recently: ": null
    },
    {
        "TROPHY active protection system": "Trophy"
    },
    {
        " which protects the tank from shoulder-launched anti-tank weapons. During the ": null
    },
    {
        "Second Intifada": "Second Intifada"
    },
    {
        " further modifications were made, designated as Merkava Mk. 3d Baz LIC .            In terms of firepower, the focus of 2010s-era R & D is on increased detection capability such as ": null
    },
    {
        "thermal imagers": "Thermography"
    },
    {
        ", automated fire control systems for the guns and increased ": null
    },
    {
        "muzzle energy": "Muzzle Energy"
    },
    {
        " from the gun to improve range, accuracy and armour penetration. Pengelley, Rupert, A new era in tank main armament, pp. 1521–531 The most mature future gun technology is the ": null
    },
    {
        "electrothermal-chemical": "Electrothermal-Chemical Technology"
    },
    {
        " gun. Hilmes, Rolf , Aspects of future MBT conception . Military Technology 23 : 7. Moench Verlagsgesellschaft Mbh. The XM291 electrothermal-chemical tank gun has gone through successful multiple firing sequences on a modified ": null
    },
    {
        "M8 Armored Gun System": "M8 Armored Gun System"
    },
    {
        " chassis. Goodell, Brad , Electrothermal Chemical Armament Integration into a Combat Vehicle . IEEE Transactions on Magnetics, Volume 23, Number 1, pp. 456–59. To improve tank protection, one field of research involves making the tank invisible to radar by adapting ": null
    },
    {
        "stealth": "Stealth Technology"
    },
    {
        " technologies originally designed for aircraft. Improvements to ": null
    },
    {
        "camouflage": "Camouflage"
    },
    {
        " or and attempts to render it invisible through ": null
    },
    {
        "active camouflage": "Active Camouflage"
    },
    {
        ", which changes according to where the tank is located, are being pursued. Research is also ongoing in ": null
    },
    {
        "electromagnetic": "Electromagnetism"
    },
    {
        " armour systems to disperse or deflect incoming ": null
    },
    {
        "shaped charges": "Hollow Charge"
    },
    {
        ", Wickert, Matthias, Electric Armor Against Shaped Charges, pp. 426–29 Xiaopeng, Li, et al., Multiprojectile Active Electromagnetic Armor, pp. 460–62 as well as various forms of ": null
    },
    {
        "active protection systems": "Active Protection System"
    },
    {
        " to prevent incoming projectiles from striking the tank.     Mobility may be enhanced in future tanks by the use of ": null
    },
    {
        "diesel-electric": "Diesel-Electric Transmission"
    },
    {
        " or turbine-electric ": null
    },
    {
        "series hybrid": "Series Hybrid"
    },
    {
        " drives—first used in a primitive, gasoline-engined form with Porsches  Elefant  German tank destroyer of 1943—improving fuel efficiency while reducing the size and weight of the power plant. Electric/Hybrid Electric Drive Vehicles for Military Applications, pp. 132–44 Furthermore, advances in gas turbine technology, including the use of advanced ": null
    },
    {
        "recuperators": "Recuperator"
    },
    {
        ", McDonald, Colin F., Gas Turbine Recuperator Renaissance, pp. 1–30 have allowed for reduction in engine volume and mass to less than 1 m 3 and 1 metric ton, respectively, while maintaining fuel efficiency similar to that of a diesel engine. Koschier, Angelo V. and Mauch, Hagen R., Advantages of the LV100 as a Power Producer in a Hybrid Propulsion System for Future Fighting Vehicles, p. 697 In line with the new doctrine of ": null
    },
    {
        "network-centric warfare": "Network-Centric Warfare"
    },
    {
        ", the 2010s-era modern battle tank shows increasing sophistication in its electronics and communication systems.               The three traditional factors determining a tanks capability effectiveness are its firepower, protection, and mobility.   Firepower is the ability of a tanks crew to identify, engage, and destroy enemy tanks and other targets using its large-calibre cannon. Protection is the degree to which the tanks armour, profile and camouflage enables the tank crew to evade detection, protect themselves from enemy fire, and retain vehicle functionality during and after combat. Mobility includes how well the tank can be transported by rail, sea, or air to the operational staging area; from the staging area by road or over terrain towards the enemy; and tactical movement by the tank over the battlefield during combat, including traversing of obstacles and rough terrain. The variations of tank designs have been determined by the way these three fundamental features are blended. For instance, in 1937, the French doctrine focused on firepower and protection more than mobility because tanks worked in intimate liaison with the infantry.  There was also the case of the development of a heavy cruiser tank, which focused on armour and firepower to challenge Germanys Tiger and Panther tanks.              Tanks have been classified by weight, role, or other criteria, that has changed over time and place. Classification is determined by the prevailing theories of armoured warfare, which have been altered in turn by rapid advances in technology. No one classification system works across all periods or all nations; in particular, weight-based classification is inconsistent between countries and eras.     In World War I, the first tank designs focused on crossing wide trenches, requiring very long and large vehicles, such as the British Mark I; these became classified as ": null
    },
    {
        "heavy tanks": "Heavy Tank"
    },
    {
        ". Tanks that fulfilled other combat roles were smaller, like the French Renault FT; these were classified as ": null
    },
    {
        "light tanks": "Light Tank"
    },
    {
        " or ": null
    },
    {
        "tankettes": "Tankette"
    },
    {
        ". Many late-war and inter-war tank designs diverged from these according to new, though mostly untried, concepts for future tank roles and tactics. Tank classifications varied considerably according to each nations own tank development, such as cavalry tanks , fast tanks , and breakthrough tanks .     During World War II, many tank concepts were found unsatisfactory and discarded, mostly leaving the more multi-role tanks; these became easier to classify. Tank classes based on weight led to new definitions of heavy and light tank classes, with ": null
    },
    {
        "medium tanks": "Medium Tank"
    },
    {
        " covering the balance of those between. The British maintained ": null
    },
    {
        "cruiser tanks": "Cruiser Tank"
    },
    {
        ", focused on speed, and ": null
    },
    {
        "infantry tanks": "Infantry Tank"
    },
    {
        " that traded speed for more armour. ": null
    },
    {
        "Tank destroyers": "Tank Destroyer"
    },
    {
        " are tanks or other ": null
    },
    {
        "armoured fighting vehicles": "Armoured Fighting Vehicle"
    },
    {
        " specifically designed to defeat enemy tanks. ": null
    },
    {
        "Assault guns": "Assault Gun"
    },
    {
        " are armored fighting vehicles that could combine the roles of infantry tanks and ": null
    },
    {
        "tank destroyers": "Tank Destroyer"
    },
    {
        ". Some tanks were converted to ": null
    },
    {
        "flame tanks": "Flame Tank"
    },
    {
        ", specializing on close-in attacks on enemy strongholds with ": null
    },
    {
        "flamethrowers": "Flamethrower"
    },
    {
        ". As the war went on, tanks tended to become larger and more powerful, shifting some tank classifications and leading to ": null
    },
    {
        "super-heavy tanks": "Super-Heavy Tank"
    },
    {
        ".     Experience and technology advances during the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        " continued to consolidate tank roles. With the worldwide adoption of the modern ": null
    },
    {
        "main battle tank": "Main Battle Tank"
    },
    {
        " designs, which favour a modular universal design, most other classifications are dropped from modern terminology. All main battle tanks tend to have a good balance of speed, armour, and firepower, even while technology continues to improve all three. Being fairly large, main battle tanks can be complemented with light tanks, ": null
    },
    {
        "armoured personnel carriers": "Armoured Personnel Carrier"
    },
    {
        ", ": null
    },
    {
        "infantry fighting vehicles": "Infantry Fighting Vehicle"
    },
    {
        " or similar relatively lighter armoured fighting vehicles, typically in the roles of ": null
    },
    {
        "armoured reconnaissance": "Armoured Reconnaissance"
    },
    {
        ", ": null
    },
    {
        "amphibious": "Amphibious Warfare"
    },
    {
        " or ": null
    },
    {
        "air assault": "Air Assault"
    },
    {
        " operations, or against enemies lacking main battle tanks.                 The ": null
    },
    {
        "main weapon": "Tank Gun"
    },
    {
        " of modern tanks is typically a single, large-": null
    },
    {
        "calibre": "Caliber"
    },
    {
        " cannon": "Cannon"
    },
    {
        " mounted in a ": null
    },
    {
        "fully traversing": "Gun Laying"
    },
    {
        " gun turret": "Gun Turret"
    },
    {
        ". The typical modern tank gun is a ": null
    },
    {
        "smoothbore": "Smoothbore"
    },
    {
        " weapon capable of firing a variety of ammunition, including ": null
    },
    {
        "armour-piercing": "Armor-Piercing"
    },
    {
        "kinetic energy penetrators": "Kinetic Energy Penetrator"
    },
    {
        " , also known as ": null
    },
    {
        "armour-piercing discarding sabot": "Armour-Piercing Discarding Sabot"
    },
    {
        " , and/or ": null
    },
    {
        "armour piercing fin stabilised discarding sabot": "Apfsds"
    },
    {
        " and ": null
    },
    {
        "high explosive anti-tank": "High Explosive Anti-Tank"
    },
    {
        " shells": "Shell"
    },
    {
        ", and/or ": null
    },
    {
        "high explosive squash head": "High Explosive Squash Head"
    },
    {
        " and/or ": null
    },
    {
        "anti-tank guided missiles": "Anti-Tank Guided Missile"
    },
    {
        " to destroy armoured targets, as well as ": null
    },
    {
        "high explosive": "High-Explosive Fragmentation"
    },
    {
        " shells": "High-Explosive Fragmentation"
    },
    {
        " for shooting at soft targets or ": null
    },
    {
        "fortifications": "Fortifications"
    },
    {
        ". ": null
    },
    {
        "Canister shot": "Canister Shot"
    },
    {
        " may be used in close or urban combat situations where the risk of hitting friendly forces with ": null
    },
    {
        "shrapnel": "Shrapnel"
    },
    {
        " from HE rounds is unacceptably high. ": null
    },
    {
        "USA Today ": "Usatoday2005B"
    },
    {
        ", Tanks adapted for urban fights they once avoided     A ": null
    },
    {
        "gyroscope": "Gyroscope"
    },
    {
        " is used to stabilise the main gun, allowing it to be effectively aimed and fired at the short halt or on the move. Modern tank guns are also commonly fitted with ": null
    },
    {
        "insulating": "Thermal Insulation"
    },
    {
        " thermal jackets to reduce gun-barrel warping caused by uneven ": null
    },
    {
        "thermal expansion": "Thermal Expansion"
    },
    {
        ", ": null
    },
    {
        "bore evacuators": "Bore Evacuator"
    },
    {
        " to minimise gun firing fumes entering the crew compartment and sometimes ": null
    },
    {
        "muzzle brakes": "Muzzle Brake"
    },
    {
        " to minimise the effect of ": null
    },
    {
        "recoil": "Recoil"
    },
    {
        " on accuracy and ": null
    },
    {
        "rate of fire": "Rate Of Fire"
    },
    {
        ".           Traditionally, target detection relied on visual identification. This was accomplished from within the tank through ": null
    },
    {
        "telescopic": "Telescope"
    },
    {
        "periscopes": "Periscope"
    },
    {
        "; often, however, tank commanders would open up the hatch to view the outside surroundings, which improved situational awareness but incurred the penalty of vulnerability to sniper fire. Though several developments in target detection have taken place, these methods are still common practice. In the 2010s, more electronic target detection methods are available.     In some cases ": null
    },
    {
        "spotting rifles": "Spotting Rifle"
    },
    {
        " were used to confirm proper trajectory and range to a target. These spotting rifles were mounted co-axially to the main gun, and fired ": null
    },
    {
        "tracer ammunition": "Tracer Ammunition"
    },
    {
        " ballistically matched to the gun itself. The gunner would track the movement of the tracer round in flight, and upon impact with a hard surface, it would give off a flash and a puff of smoke, after which the main gun was immediately fired. However this slow method has been mostly superseded by ": null
    },
    {
        "laser rangefinding": "Laser Rangefinder"
    },
    {
        " equipment.     Modern tanks also use sophisticated ": null
    },
    {
        "light intensification": "Night Vision Device"
    },
    {
        " and ": null
    },
    {
        "thermal imaging": "Thermal Imaging"
    },
    {
        " equipment to improve fighting capability at night, in poor weather and in smoke. The accuracy of modern tank guns is pushed to the mechanical limit by computerised ": null
    },
    {
        "fire-control systems": "Fire-Control System"
    },
    {
        ". A fire-control system uses a laser rangefinder to determine the range to the target, a ": null
    },
    {
        "thermocouple": "Thermocouple"
    },
    {
        ", ": null
    },
    {
        "anemometer": "Anemometer"
    },
    {
        " and ": null
    },
    {
        "wind vane": "Wind Vane"
    },
    {
        " to correct for weather effects and a muzzle referencing system to correct for gun-barrel temperature, warping and wear. Two sightings of a target with the range-finder enable calculation of the target movement ": null
    },
    {
        "vector": "Vector"
    },
    {
        ". This information is combined with the known movement of the tank and the principles of ": null
    },
    {
        "ballistics": "External Ballistics"
    },
    {
        " to calculate the ": null
    },
    {
        "elevation": "Elevation"
    },
    {
        " and ": null
    },
    {
        "aim point": "Aiming Point"
    },
    {
        " that maximises the probability of hitting the target.     Usually, tanks carry smaller calibre armament for short-range defence where fire from the main weapon would be ineffective or wasteful, for example when engaging ": null
    },
    {
        "infantry": "Infantry"
    },
    {
        ", ": null
    },
    {
        "light vehicles": "Armoured Car"
    },
    {
        " or ": null
    },
    {
        "close air support aircraft": "Close Air Support"
    },
    {
        ". A typical complement of secondary weapons is a general-purpose machine gun mounted ": null
    },
    {
        "coaxially": "Coaxial Weapon"
    },
    {
        " with the main gun, and a heavier ": null
    },
    {
        "anti-aircraft": "Anti-Aircraft"
    },
    {
        "-capable machine gun on the turret roof. Some tanks also have a hull-mounted machine gun. These weapons are often modified variants of those used by infantry, and so utilise the same kinds of ammunition.               The measure of a tanks protection is the combination of its ability to avoid detection , to avoid being hit by enemy fire, its resistance to the effects of enemy fire, and its capacity to sustain damage whilst still completing its objective, or at least protecting its crew. This is done by a variety of countermeasures, such as armour plating and reactive defences, as well as more complex ones such as heat-emissions reduction.     In common with most unit types, tanks are subject to additional hazards in dense wooded and urban combat environments which largely negate the advantages of the tanks long-range firepower and mobility, limit the crews detection capabilities and can restrict turret traverse. Despite these disadvantages, tanks retain high ": null
    },
    {
        "survivability": "Survivability"
    },
    {
        " against previous-generation ": null
    },
    {
        "rocket-propelled grenades": "Rocket-Propelled Grenade"
    },
    {
        " aimed at the most-armoured sections.     However, as effective and advanced as armour plating has become, tank survivability against newer-generation ": null
    },
    {
        "tandem-warhead": "Tandem-Warhead"
    },
    {
        " anti-tank missiles is a concern for military planners. ": null
    },
    {
        "BBC News ": "Bbcnews2006"
    },
    {
        " Tough lessons for Israeli armour Tandem-warhead RPGs use two warheads to fool active protection systems; a first dummy warhead is fired first, to trigger the active defenses, with the real warhead following it. For example, the ": null
    },
    {
        "RPG-29": "Rpg-29"
    },
    {
        " from 1980s is able to penetrate the frontal hull armour of the Challenger II   and also managed to damage a M1 Abrams.  As well, even tanks with advanced armour plating can have their tracks or gear cogs damaged by RPGs, which may render them immobile or hinder their mobility. Despite all of the advances in armour plating, a tank with its hatches open remains vulnerable to ": null
    },
    {
        "Molotov cocktail": "Molotov Cocktail"
    },
    {
        " and grenades. Even a buttoned up tank may have components which are vulnerable to Molotov cocktails, such as optics, extra gas cans and extra ammunition stored on the outside of the tank.             A tank avoids detection using the doctrine of ": null
    },
    {
        "countermeasures": "Countermeasure"
    },
    {
        " known as CCD: ": null
    },
    {
        "camouflage": "Military Camouflage"
    },
    {
        " , concealment and deception .           Camouflage can include disruptive painted shapes on the tank to break up the distinctive appearance and silhouette of a tank. Netting or actual branches from the surrounding landscape are also used. Prior to development of     infrared technology, tanks were often given a coating of camouflage paint that, depending on environmental region or season, would allow it to blend in with the rest of its environment. A tank operating in wooded areas would typically get a green and brown paintjob; a tank in a winter environment would get white paint ; tanks in the desert often get khaki paintjobs.     The Russian ": null
    },
    {
        "Nakidka": "Nakidka"
    },
    {
        " camouflage kit was designed to reduce the ": null
    },
    {
        "optical": "Optical"
    },
    {
        ", ": null
    },
    {
        "thermal": "Thermal"
    },
    {
        ", ": null
    },
    {
        "infrared": "Infrared"
    },
    {
        ", and ": null
    },
    {
        "radar": "Radar"
    },
    {
        " signatures of a tank, so that acquisition of the tank would be difficult. According to Nii Stali, the designers of Nakidka, Nakidka would reduce the probabilities of detection via visual and near-IR bands by 30%, the thermal band by 2–3 fold, radar band by 6 fold, and radar-thermal band to near-background levels.            Concealment can include hiding the tank among trees or digging in the tank by having a combat bulldozer dig out part of a hill, so that much of the tank will be hidden. A tank commander can conceal the tank by using hull down approaches to going over upward-sloping hills, so that she or he can look out the commanders cupola without the distinctive-looking main cannon cresting over the hill. Adopting a turret-down or ": null
    },
    {
        "hull-down": "Hull-Down"
    },
    {
        " position reduces the visible silhouette of a tank as well as providing the added protection of a position in ": null
    },
    {
        "defilade": "Enfilade And Defiladedefilade"
    },
    {
        ".     Working against efforts to avoid detection is the fact that a tank is a large metallic object with a distinctive, angular ": null
    },
    {
        "silhouette": "Silhouette"
    },
    {
        " that emits copious ": null
    },
    {
        "heat": "Thermal Imaging"
    },
    {
        " and engine noise. A tank that is operating in cold weather or which needs to use its radio or other communications or target-detecting electronics will need to start its engine regularly to maintain its battery power, which will create engine noise. Consequently, it is difficult to effectively camouflage a tank in the absence of some form of cover or concealment it can ": null
    },
    {
        "hide": "Hull-Down"
    },
    {
        " its hull behind. The tank becomes easier to detect when moving due to the large, distinctive auditory, vibration and thermal signature of its engine and power plant. Tank tracks and dust clouds also betray past or present tank movement.     Switched-off tanks are vulnerable to infra-red ": null
    },
    {
        "detection": "Thermal Imaging"
    },
    {
        " due to differences between the ": null
    },
    {
        "thermal conductivity": "Thermal Conductivity"
    },
    {
        " and therefore ": null
    },
    {
        "heat dissipation": "Heatheat Dissipation"
    },
    {
        " of the metallic tank and its surroundings. At close range the tank can be detected even when powered down and fully concealed due to the ": null
    },
    {
        "column of warmer air": "Heat Haze"
    },
    {
        " above the tank and the smell of diesel or gasoline. Thermal blankets slow the rate of heat emission and some thermal camouflage nets use a mix of materials with differing thermal properties to operate in the infra-red as well as the ": null
    },
    {
        "visible spectrum": "Visible Spectrum"
    },
    {
        ".     ": null
    },
    {
        "Grenade launchers": "Grenade Launcher"
    },
    {
        " can rapidly deploy a ": null
    },
    {
        "smoke screen": "Smoke Screen"
    },
    {
        " that is opaque to ": null
    },
    {
        "infrared": "Infrared"
    },
    {
        " light, to hide it from the thermal viewer of another tank. In addition to using its own grenade launchers, a tank commander could call in an artillery unit to provide smoke cover. Some tanks can produce a smoke screen.     Sometimes camouflage and concealment are used at the same time. For example, a camouflage-painted and branch-covered tank may be hidden in a behind a hill or in a dug-in-emplacement .        Some ": null
    },
    {
        "armoured recovery vehicles": "Armoured Recovery Vehicle"
    },
    {
        " have dummy turrets and cannons. This makes it less likely that enemy tanks will fire on these vehicles. Some armies have fake dummy tanks made of wood which troops can carry into position and hide behind obstacles. These dummy tanks may cause the enemy to think that there are more tanks than are actually possessed.                  To effectively protect the tank and its crew, tank armour must counter a wide variety of antitank threats. Protection against ": null
    },
    {
        "kinetic energy penetrators": "Kinetic Energy Penetrator"
    },
    {
        " and ": null
    },
    {
        "high explosive anti-tank": "High Explosive Anti-Tank"
    },
    {
        " shells fired by other tanks is of primary importance, but tank armour also aims to protect against infantry ": null
    },
    {
        "mortars": "Mortar"
    },
    {
        ", ": null
    },
    {
        "grenades": "Grenades"
    },
    {
        ", ": null
    },
    {
        "rocket-propelled grenades": "Rocket-Propelled Grenade"
    },
    {
        ", ": null
    },
    {
        "anti-tank guided missiles": "Anti-Tank Guided Missile"
    },
    {
        ", ": null
    },
    {
        "anti-tank mines": "Land Mine"
    },
    {
        ", ": null
    },
    {
        "anti-tank rifles": "Anti-Tank Rifles"
    },
    {
        ", ": null
    },
    {
        "bombs": "Bomb"
    },
    {
        ", direct ": null
    },
    {
        "artillery": "Artillery"
    },
    {
        " hits, and ": null
    },
    {
        "nuclear, biological and chemical": "Weapon Of Mass Destruction"
    },
    {
        " threats, any of which could disable or destroy a tank or its crew.      ": null
    },
    {
        "Steel armour plate": "Rolled Homogeneous Armour"
    },
    {
        " was the earliest type of armour. The Germans pioneered the use of ": null
    },
    {
        "face hardened": "Carbon Steelcase Hardening"
    },
    {
        " steel during World War II and the Soviets also achieved improved protection with ": null
    },
    {
        "sloped armour": "Sloped Armour"
    },
    {
        " technology. World War II developments led to the obsolescence of homogeneous steel armour with the development of ": null
    },
    {
        "shaped-charge": "Shaped-Charge"
    },
    {
        " warheads, exemplified by the ": null
    },
    {
        "Panzerfaust": "Panzerfaust"
    },
    {
        " and ": null
    },
    {
        "bazooka": "Bazooka"
    },
    {
        " infantry-carried weapons which were effective, despite some early success with ": null
    },
    {
        "spaced armour": "Spaced Armour"
    },
    {
        ". Magnetic mines led to the development of ": null
    },
    {
        "anti-magnetic": "Diamagnetism"
    },
    {
        " paste and paint. From WWII to the modern era, troops have added improvised armour to tanks while in combat settings, such as sandbags or pieces of old armour plating.     ": null
    },
    {
        "British": "United Kingdom"
    },
    {
        " tank researchers took the next step with the development of ": null
    },
    {
        "Chobham armour": "Chobham Armour"
    },
    {
        ", or more generally ": null
    },
    {
        "composite armour": "Composite Armour"
    },
    {
        ", incorporating ": null
    },
    {
        "ceramics": "Ceramic"
    },
    {
        " and ": null
    },
    {
        "plastics": "Plastic"
    },
    {
        " in a ": null
    },
    {
        "resin": "Resin"
    },
    {
        " matrix between steel plates, which provided good protection against HEAT weapons. ": null
    },
    {
        "High explosive squash head": "High Explosive Squash Head"
    },
    {
        " warheads led to ": null
    },
    {
        "anti-spall": "Spall"
    },
    {
        " armour linings, and kinetic energy penetrators led to the inclusion of exotic materials like a matrix of ": null
    },
    {
        "depleted uranium": "Depleted Uranium"
    },
    {
        " into a composite armour configuration.        ": null
    },
    {
        "Reactive armour": "Reactive Armour"
    },
    {
        " consists of small explosive-filled metal boxes that detonate when hit by the metallic jet projected by an exploding HEAT warhead, causing their metal plates to disrupt it. ": null
    },
    {
        "Tandem warheads": "Tandem Warhead"
    },
    {
        " defeat reactive armour by causing the armour to detonate prematurely. Modern reactive armour protects itself from Tandem warheads by having a thicker front metal plate to prevent the precursor charge from detonating the explosive in the reactive armour. Reactive armours can also reduce the penetrative abilities of ": null
    },
    {
        "kinetic energy penetrators": "Kinetic Energy Penetrator"
    },
    {
        " by deforming the penetrator with the metal plates on the Reactive armour, thereby reducing its effectiveness against the main armour of the tank.            The latest generation of protective measures for tanks are ": null
    },
    {
        "active protection systems": "Active Protection System"
    },
    {
        ". The term active is used to contrast these approaches with the armour used as the primary protective approach in earlier tanks.   ": null
    },
    {
        "Soft kill": "Soft Kill"
    },
    {
        " measures, such as the Russian ": null
    },
    {
        "Shtora": "Shtora"
    },
    {
        " countermeasure system, provide protection by interfering with enemy targeting and fire-control systems, thus making it harder for the enemy threats to lock onto the targeted tank.   ": null
    },
    {
        "Hard kill": "Hard Kill"
    },
    {
        " systems intercept incoming threats with a projectile of its own, destroying the threat. For example, the Israeli ": null
    },
    {
        "Trophy": "Trophy"
    },
    {
        " destroys an incoming rocket or missile with shotgun-like projectiles. The Soviet ": null
    },
    {
        "Drozd": "Drozd"
    },
    {
        ", the Russian ": null
    },
    {
        "Arena": "Arena Active Protection System"
    },
    {
        ", the Israeli ": null
    },
    {
        "Trophy": "Trophy"
    },
    {
        " and ": null
    },
    {
        "Iron Fist": "Iron Fist"
    },
    {
        ", Polish ": null
    },
    {
        "ERAWA": "Erawa"
    },
    {
        ", and the American ": null
    },
    {
        "Quick Kill": "Quick Kill"
    },
    {
        " systems show the potential to dramatically improve protection for tanks against ": null
    },
    {
        "missiles": "Anti-Tank Missile"
    },
    {
        ", ": null
    },
    {
        "RPGs": "Rocket-Propelled Grenade"
    },
    {
        " and potentially kinetic energy penetrator attacks, but concerns regarding a ": null
    },
    {
        "danger zone for nearby troops": "Friendly Fire"
    },
    {
        " remain.            The mobility of a tank is described by its battlefield or tactical mobility, its operational mobility, and its strategic mobility.   Tactical mobility can be broken down firstly into agility, describing the tanks acceleration, braking, speed and rate of turn on various terrain, and secondly obstacle clearance: the tanks ability to travel over vertical obstacles like low walls or trenches or through water.   Operational mobility is a function of manoeuvre range; but also of size and weight, and the resulting limitations on options for manoeuvre.   Strategic mobility is the ability of the tanks of an armed force to arrive in a timely, cost effective, and synchronized fashion.            Tank agility is a function of the weight of the tank due to its inertia while manoeuvring and its ": null
    },
    {
        "ground pressure": "Ground Pressure"
    },
    {
        ", the power output of the installed power plant and the tank ": null
    },
    {
        "transmission": "Transmission"
    },
    {
        " and ": null
    },
    {
        "track": "Continuous Track"
    },
    {
        " design. In addition, rough terrain effectively limits the tanks speed through the stress it puts on the ": null
    },
    {
        "suspension": "Suspension Armoured Fighting Vehicle Suspension"
    },
    {
        " and the crew. A breakthrough in this area was achieved during World War II when improved suspension systems were developed that allowed better cross-country performance and limited firing on the move. Systems like the earlier ": null
    },
    {
        "Christie": "Christie Suspension"
    },
    {
        " or later ": null
    },
    {
        "torsion-bar": "Torsion-Bar"
    },
    {
        " suspension developed by ": null
    },
    {
        "Ferdinand Porsche": "Ferdinand Porsche"
    },
    {
        " dramatically improved the tanks cross-country performance and overall mobility. ": null
    },
    {
        "Deighton ": "Deighton1979"
    },
    {
        ", Blitzkrieg, From the rise of Hitler to the fall of Dunkirk, p. 154     Tanks are highly mobile and able to travel over most types of terrain due to their ": null
    },
    {
        "continuous tracks": "Continuous Track"
    },
    {
        " and advanced suspension. The tracks disperse the weight of the vehicle over a large area, resulting in less ": null
    },
    {
        "ground pressure": "Ground Pressure"
    },
    {
        ". A tank can travel at approximately  across flat terrain and up to  on roads, but due to the mechanical strain this places on the vehicle and the logistical strain on fuel delivery and tank maintenance, these must be considered burst speeds that invite mechanical failure of engine and transmission systems. Consequently, wheeled tank transporters and rail infrastructure is used wherever possible for long-distance tank transport. The limitations of long-range tank mobility can be viewed in sharp contrast to that of wheeled ": null
    },
    {
        "armoured fighting vehicles": "Armoured Fighting Vehicle"
    },
    {
        ". The majority of blitzkrieg operations were conducted at the pedestrian pace of , and that was only achieved on the roads of France. ": null
    },
    {
        "Deighton ": "Deighton1979"
    },
    {
        ", Blitzkrieg, From the rise of Hitler to the fall of Dunkirk, p. 180          The tanks power plant supplies ": null
    },
    {
        "kinetic energy": "Kinetic Energy"
    },
    {
        " to move the tank, and ": null
    },
    {
        "electric": "Electric Current"
    },
    {
        " power via a ": null
    },
    {
        "generator": "Electrical Generatorvehicle-Mounted Generators"
    },
    {
        " to components such as the ": null
    },
    {
        "turret": "Gun Turret"
    },
    {
        " rotation motors and the tanks electronic systems. The tank power plant has evolved from predominantly petrol and adapted large-displacement aeronautical or automotive ": null
    },
    {
        "engines": "Internal Combustion Engines"
    },
    {
        " during World Wars I and II, through ": null
    },
    {
        "diesel engines": "Diesel Engine"
    },
    {
        " to advanced ": null
    },
    {
        "multi-fuel": "Multi-Fuel"
    },
    {
        " diesel engines": "Diesel Enginequality And Variety Of Fuels"
    },
    {
        ", and powerful but fuel-hungry ": null
    },
    {
        "gas turbines": "Gas Turbinegas Turbines In Surface Vehicles"
    },
    {
        " in the ": null
    },
    {
        "T-80": "T-80"
    },
    {
        " and ": null
    },
    {
        "M1 Abrams": "M1 Abrams"
    },
    {
        ".                   Strategic mobility is the ability of the tanks of an armed force to arrive in a timely, cost effective, and synchronized fashion. For good strategic mobility transportability by air is important, which means that weight and volume must be kept within the designated transport aircraft capabilities. Nations often stockpile enough tanks to respond to any threat without having to make more tanks as many sophisticated designs can only be produced at a relatively low rate. The US for instance keeps 6,000 MBTs in storage.      In the absence of ": null
    },
    {
        "combat engineers": "Combat Engineer"
    },
    {
        ", most tanks are limited to ": null
    },
    {
        "fording": "Ford"
    },
    {
        " small rivers. The typical fording depth for MBTs is approximately , being limited by the height of the engine air intake and drivers position. Modern tanks such as the Russian ": null
    },
    {
        "T-90": "T-90"
    },
    {
        " and the German ": null
    },
    {
        "Leopard 1": "Leopard 1"
    },
    {
        " and ": null
    },
    {
        "Leopard 2": "Leopard 2"
    },
    {
        " tanks can ford to a depth of  when properly prepared and equipped with a ": null
    },
    {
        "snorkel": "Vehicle Snorkel"
    },
    {
        " to supply air for the crew and engine. Tank crews usually have a negative reaction towards deep fording but it adds considerable scope for ": null
    },
    {
        "surprise": "List Of Military Tactics"
    },
    {
        " and tactical flexibility in water crossing operations by opening new and unexpected avenues of attack.     ": null
    },
    {
        "Amphibious tanks": "Amphibious Tank"
    },
    {
        " are specially designed or adapted for water operations, such as by including snorkels and skirts, but they are rare in modern armies, being replaced by purpose-built ": null
    },
    {
        "amphibious assault vehicles": "Amphibious Assault Vehicle"
    },
    {
        " or ": null
    },
    {
        "armoured personnel carriers": "Armoured Personnel Carrier"
    },
    {
        " in ": null
    },
    {
        "amphibious assaults": "Amphibious Warfarepost–World War Ii"
    },
    {
        ". Advances such as the ": null
    },
    {
        "EFA": "Efa"
    },
    {
        " mobile bridge and ": null
    },
    {
        "armoured vehicle-launched scissors bridges": "Armoured Vehicle-Launched Bridge"
    },
    {
        " have also reduced the impediment to tank advance that rivers posed in World War II. ": null
    },
    {
        "Deighton ": "Deighton1979"
    },
    {
        ", Blitzkrieg, From the rise of Hitler to the fall of Dunkirk, pp. 234–52                      Most modern tanks most often have four crew members, or three if an ": null
    },
    {
        "auto-loader": "Auto-Loader"
    },
    {
        " is installed. These are the:   ": null
    },
    {
        "Commander": "Commander"
    },
    {
        " – The commander is responsible for commanding the tank, most often in conjunction with other tanks and supporting infantry. The commander is provided with all-round vision devices rather than the limited ones of the driver and gunner. Oftentimes the commander has access to a machine gun attached near or on the commanders cupola, usually in the .50 calibre range. Depending on the design of the cupola, the commander either has to operate the machine gun by physically grasping the guns controls with the cupola open, which exposes the commander to enemy fire, or operate the machine gun from the safety of inside the tank using a ": null
    },
    {
        "remote control": "Remote Weapon System"
    },
    {
        ".   ": null
    },
    {
        "Driver": "Driver"
    },
    {
        " – The driver drives the tank, and often also serves as the tanks day-to-day engine mechanic.   ": null
    },
    {
        "Gunner": "Gunner"
    },
    {
        " – The gunner is responsible for ": null
    },
    {
        "laying the gun": "Gun Laying"
    },
    {
        ", the process of aiming an artillery piece at targets. It may be laying for direct fire, where the gun is aimed similarly to a rifle, or indirect fire, where firing data is calculated and applied to the sights. The term includes automated aiming using, for example, radar-derived target data and computer-controlled guns. Gun laying means moving the axis of the bore of the barrel in two planes, horizontal and vertical. A gun is traversed to align it with the target, and elevated to range it to the target.   Loader – The loader loads the gun, with a round appropriate to the target as ordered by either the commander or the loader. The loader is usually the lowest ranked member of the crew. In tanks with auto-loaders this position is omitted.        Historically, crews have varied from just two members to a dozen. For example, pre-World War II French tanks were noted for having a two-man crew, in which the overworked commander had to load and fire the gun in addition to commanding the tank. First World War tanks were developed with immature technologies; in addition to the crew needed to man the multiple guns and machine guns, up to four crewmen were needed to drive the tank: the driver, acting as the vehicle commander and manning the brakes, drove via orders to his gears-men; a co-driver operated the gearbox and throttle; and two gears-men, one on each track, steered by setting one side or the other to idle, allowing the track on the other side to slew the tank to one side.     With World War II the multi-turreted tanks proved impracticable, and as the single turret on a low hull design became standard, crews became standardized around a crew of four or five. In those tanks with a fifth crew member, usually three were located in the turret while the fifth was most often seated in the hull next to the driver, and operated the hull machine gun in addition to acting as a co-driver or radio operator. Well-designed crew stations, giving proper considerations to comfort and ergonomics, are an important factor in the combat effectiveness of a tank, as it limits fatigue and speeds up individual actions.             A noted author on the subject of tank design engineering, Richard M Ogorkiewicz, Technology of Tanks, Richard M Ogorkiewicz, Janes Information Group, 1991 outlined the following basic engineering sub-systems that are commonly incorporated into tanks technological development:   Mobility of tanks   Tank ": null
    },
    {
        "engines": "Enginecombustion Engine"
    },
    {
        " transmissions": "Transmission"
    },
    {
        " Suspensions": "Suspension"
    },
    {
        " and ": null
    },
    {
        "running gear": "Running Gear"
    },
    {
        "Tank guns": "Tank Gun"
    },
    {
        " and ": null
    },
    {
        "ammunition": "Ammunitionordnance Ammunition"
    },
    {
        " Ballistics": "Ballistics"
    },
    {
        " and mechanics of tank guns   Vision and sighting systems   Illuminating and ": null
    },
    {
        "night vision": "Night Visionnight Vision Technologies"
    },
    {
        " systems   ": null
    },
    {
        "Fire control systems": "Fire-Control System"
    },
    {
        " for main and auxiliary weapons   ": null
    },
    {
        "Gun control systems": "Gun Data Computer"
    },
    {
        " Guided weapons": "Precision-Guided Munition"
    },
    {
        " Armour": "Vehicle Armourarmoured Fighting Vehicles"
    },
    {
        " protection   Configuration of tanks   To the above can be added unit communication systems and electronic anti-tank countermeasures, crew ergonomic and survival systems , and provision for technological upgrading.   Few tank designs have survived their entire service lives without some upgrading or modernisation, particularly during wartime, including some that have changed almost beyond recognition, such as the latest Israeli ": null
    },
    {
        "Magach": "Magachversions"
    },
    {
        " versions.     The characteristics of a tank are determined by the performance criteria required for the tank. The obstacles that must be traversed affect the vehicles front and rear profiles. The terrain that is expected to be traversed determines the track ground pressure that may be allowed to be exerted for that particular terrain.      Tank design is a compromise between its technological and budgetary constraints and its tactical capability requirements. It is not possible to maximise firepower, protection and mobility simultaneously while incorporating the latest technology and retain affordability for sufficient procurement quantity to enter production.   For example, in the case of tactical capability requirements, increasing protection by adding armour will result in an increase in weight and therefore decrease in mobility; increasing firepower by installing a larger gun will force the designer team to increase armour, the therefore weight of the tank by retaining same internal volume to ensure crew efficiency during combat. In the case of the Abrams MBT which has good firepower, speed and armour, these advantages are counterbalanced by its engines notably high fuel consumption, which ultimately reduces its range, and in a larger sense its mobility.     Since the Second World War, the economics of tank production governed by the complexity of manufacture and cost, and the impact of a given tank design on logistics and field maintenance capabilities, have also been accepted as important in determining how many tanks a nation can afford to field in its force structure.     Some tank designs that were fielded in significant numbers, such as ": null
    },
    {
        "Tiger I": "Tiger I"
    },
    {
        " and ": null
    },
    {
        "M60A2": "M60A2 Starship"
    },
    {
        " proved to be too complex or expensive to manufacture, and made unsustainable demands on the logistics services support of the armed forces. The affordability of the design therefore takes precedence over the combat capability requirements.   Nowhere was this principle illustrated better than during the Second World War when two Allied designs, the ": null
    },
    {
        "T-34": "T-34"
    },
    {
        " and the ": null
    },
    {
        "M4 Sherman": "M4 Sherman"
    },
    {
        ", although both simple designs which accepted engineering compromises, were used successfully against more sophisticated designs by Germany that were more complex and expensive to produce, and more demanding on overstretched logistics of the Wehrmacht. Given that a tank crew will spend most of its time occupied with maintenance of the vehicle, engineering simplicity has become the primary constraint on tank design since the Second World War despite advances in mechanical, electrical and electronics technologies.     Since the Second World War, tank development has incorporated experimenting with significant mechanical changes to the tank design while focusing on technological advances in the tanks many subsystems to improve its performance. However, a number of novel designs have appeared throughout this period with mixed success, including the Soviet ": null
    },
    {
        "IT-1": "It-1"
    },
    {
        " and ": null
    },
    {
        "T-64": "T-64"
    },
    {
        " in firepower, and the Israeli ": null
    },
    {
        "Merkava": "Merkava"
    },
    {
        " and Swedish ": null
    },
    {
        "S-tank": "S-Tank"
    },
    {
        " in protection, while for decades the USs ": null
    },
    {
        "M551": "M551"
    },
    {
        " remained the only light tank deployable by parachute.                 ": null
    },
    {
        "Commanding and coordinating": "C4Istar"
    },
    {
        " tanks in the field has always been subject to particular problems, particularly in the area of communications, but in modern armies these problems have been partially alleviated by ": null
    },
    {
        "networked": "Computer Network"
    },
    {
        ", ": null
    },
    {
        "integrated systems": "System Integration"
    },
    {
        " that enable communications and contribute to enhanced ": null
    },
    {
        "situational awareness": "Situational Awareness"
    },
    {
        ".         Armoured ": null
    },
    {
        "bulkheads": "Bulkhead"
    },
    {
        ", engine noise, intervening terrain, dust and smoke, and the need to operate buttoned up are severe detriments to communication and lead to a sense of isolation for small tank units, individual vehicles, and tank crew. Radios were not then portable or robust enough to be mounted in a tank, although ": null
    },
    {
        "Morse code": "Morse Code"
    },
    {
        " transmitters were installed in some Mark IVs at Cambrai as messaging vehicles. Macksey, K., Tank vs Tank, Grub Street, London, 1999, p. 32 Attaching a field telephone to the rear would become a practice only during the next war. During World War I when these failed or were unavailable, situation reports were sent back to headquarters by some crews releasing carrier pigeons through loopholes or hatches Fletcher, D., British Mark I Tank 1916, Osprey, p. 19 and communications between vehicles was accomplished using hand signals, handheld ": null
    },
    {
        "semaphore flags": "Flag Semaphore"
    },
    {
        " which continued in use in the ": null
    },
    {
        "Red Army": "Red Army"
    },
    {
        "/": null
    },
    {
        "Soviet Army": "Soviet Army"
    },
    {
        " through the Second and Cold wars, or by foot or horse-mounted messengers. ": null
    },
    {
        "Wright 2002": "Tankciterefwright2002"
    },
    {
        ", Tank: The Progress of a Monstrous War Machine, p. 48, To the extent that they communicated at all, the tank crews did so by squeezing carrier pigeons out through a hole in a gun sponson, by brandishing a shovel through the manhole, or by frantic coloured discs in the air.       From the beginning, the German military stressed wireless communications, equipping their combat vehicles with radios, and drilled all units to rely on disciplined radio use as a basic element of tactics. This allowed them to respond to developing threats and opportunities during battles, giving the Germans a notable tactical advantage early in the war; even where Allied tanks initially had better firepower and armour, they generally lacked individual radios.  By mid-war, Western Allied tanks adopted full use of radios, although Russian use of radios remained relatively limited.          On the modern battlefield an ": null
    },
    {
        "intercom": "Intercom"
    },
    {
        " mounted in the crew helmet provides internal communications and a link to the ": null
    },
    {
        "radio network": "Communications Network"
    },
    {
        ", and on some tanks an external intercom on the rear of the tank provides communication with co-operating infantry. Radio networks employ radio ": null
    },
    {
        "voice procedure": "Voice Procedure"
    },
    {
        " to minimize confusion and chatter .   A recent  development in AFV ": null
    },
    {
        "equipment": "Equipment Of The Italian Army"
    },
    {
        " and doctrine is integration of information from the ": null
    },
    {
        "fire control system": "Fire Control System"
    },
    {
        ", ": null
    },
    {
        "laser rangefinder": "Laser Rangefinder"
    },
    {
        ", ": null
    },
    {
        "Global Positioning System": "Global Positioning System"
    },
    {
        " and terrain information via ": null
    },
    {
        "hardened": "Electromagnetic Pulse"
    },
    {
        " military specification ": null
    },
    {
        "electronics": "Electronics"
    },
    {
        " and a ": null
    },
    {
        "battlefield network": "Computer Networks"
    },
    {
        " to display information on enemy targets and friendly units on a ": null
    },
    {
        "monitor": "Computer Monitor"
    },
    {
        " in the tank. The sensor data can be sourced from nearby tanks, planes, ": null
    },
    {
        "UAVs": "Unmanned Aerial Vehicles"
    },
    {
        " or, in the future infantry . This improves the tank commanders ": null
    },
    {
        "situational awareness": "Situational Awareness"
    },
    {
        " and ability to ": null
    },
    {
        "navigate": "Navigate"
    },
    {
        " the battlefield and select and engage targets. In addition to easing the reporting burden by automatically logging all orders and actions, orders are sent via the network with text and graphical overlays. This is known as ": null
    },
    {
        "Network-centric warfare": "Network-Centric Warfare"
    },
    {
        " by the US, ": null
    },
    {
        "Network Enabled Capability": "Network Enabled Capability"
    },
    {
        " or ": null
    },
    {
        "Digital Army Battle Management System": "Digital Army"
    },
    {
        " צי ד . Advanced battle tanks, including the ": null
    },
    {
        "K-2 Black Panther": "K2 Black Panther"
    },
    {
        ", have taken up the first major step forward in adopting a fully ": null
    },
    {
        "radar integrated Fire Control System": "Radar Integrated Fire Control System"
    },
    {
        " which allows it to detect tanks from a further distance and identify it as a friend-or-foe as well as increasing the tanks accuracy as well as its capability to lock onto tanks.                Performing situational awareness and communicating is the one of four primary MBT functions in 21st century.    For the better situational awareness of the crew on the board of tank use ": null
    },
    {
        "circular review system": "Circular Review System"
    },
    {
        " with combination of ": null
    },
    {
        "Augmented reality": "Augmented Reality"
    },
    {
        " and ": null
    },
    {
        "Artifical Intelligence": "Artifical Intelligence"
    },
    {
        " technologies.      Further advancements in tank defence systems has led to the development of ": null
    },
    {
        "active protection systems": "Active Protection System"
    },
    {
        ". These involve either one of two options: Soft-kill or Hard-kill protection systems. The Soft-kill protection system uses an integrated onboard ": null
    },
    {
        "radar warning receivers": "Radar Warning Receiver"
    },
    {
        " which can detect incoming anti-tank missiles and projectiles. Once detected, soft-kill measures will be deployed which involves deploying ": null
    },
    {
        "smoke screens": "Smoke Screen"
    },
    {
        " or ": null
    },
    {
        "smoke grenades": "Smoke Grenade"
    },
    {
        " which interfere with the incoming missiles ": null
    },
    {
        "infra-red": "Infrared Homing"
    },
    {
        " tracking system. This will cause the incoming missile to miss the tank or to deactivate entirely. The more advanced approach involves the ": null
    },
    {
        "Hard-kill": "Countermeasure"
    },
    {
        " measures. These involve directly destroying the incoming enemy missile or projectile by deploying the tanks own anti-missile projectile. This is seen as a more reliable approach due to its direct intervention measures rather than interference measures of the soft-kill measures. Both these active protection systems can be found on several ": null
    },
    {
        "main battle tanks": "Main Battle Tank"
    },
    {
        " including the ": null
    },
    {
        "K-2 Black Panther": "K2 Black Panther"
    },
    {
        ", the ": null
    },
    {
        "Merkerva": "Merkava"
    },
    {
        " and the ": null
    },
    {
        "Leopard 2": "Leopard 2"
    },
    {
        "A7.       The word tank was first applied to the British landships in 1915, before they entered service, to keep their nature secret.       On 24 December 1915, a meeting took place of the Inter-Departmental Conference . Its purpose was to discuss the progress of the plans for what were described as Caterpillar Machine Gun Destroyers or Land Cruisers. In his autobiography, ": null
    },
    {
        "Albert Gerald Stern": "Albert Gerald Stern"
    },
    {
        " says that at that meeting ": null
    },
    {
        "Mr. Macnamara": "Thomas James Macnamara"
    },
    {
        "  then suggested, for secrecys sake, to change the title of the Landships Committee. ": null
    },
    {
        "Mr. dEyncourt": "Sir Eustace Tennyson-Deyncourt, 1St Baronet"
    },
    {
        " agreed that it was very desirable to retain secrecy by all means, and proposed to refer to the vessel as a Water Carrier . In Government offices, committees and departments are always known by their initials. For this reason I, as Secretary, considered the proposed title totally unsuitable.August, 1916 assault vehicle  vehicle lit. armour after a type of ": null
    },
    {
        "siege engine": "Siege Engine"
    },
    {
        "lit. armed wagon lit. battle wagon , also used for chariots lit. fight wagonarmoured wagon to crawl combat wagon전차/戰車tankbattle vehicle ": null
    }
]