[
    {
        "                          A telephone , or phone, is a ": null
    },
    {
        "telecommunications": "Telecommunication"
    },
    {
        " device that permits two or more users to conduct a conversation when they are too far apart to be heard directly. A telephone converts sound, typically and most efficiently the ": null
    },
    {
        "human voice": "Human Voice"
    },
    {
        ", into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user.     In 1876, ": null
    },
    {
        "Alexander Graham Bell": "Alexander Graham Bell"
    },
    {
        " was the first to be granted a United States patent for a device that produced clearly intelligible replication of the human voice. This instrument was further developed by many others. The telephone was the first device in history that enabled people to talk directly with each other across large distances. Telephones rapidly became indispensable to businesses, government and households.     The essential elements of a telephone are a ": null
    },
    {
        "microphone": "Microphone"
    },
    {
        "  to speak into and an ": null
    },
    {
        "earphone": "Earphone"
    },
    {
        "  which reproduces the voice in a distant location.  In addition, most telephones contain a ringer to announce an incoming telephone call, and a dial or keypad to enter a ": null
    },
    {
        "telephone number": "Telephone Number"
    },
    {
        " when initiating a call to another telephone. The receiver and transmitter are usually built into a ": null
    },
    {
        "handset": "Handset"
    },
    {
        " which is held up to the ear and mouth during conversation. The dial may be located either on the handset or on a base unit to which the handset is connected. The transmitter converts the ": null
    },
    {
        "sound waves": "Sound Wave"
    },
    {
        " to ": null
    },
    {
        "electrical signals": "Signal"
    },
    {
        " which are sent through a telephone network to the receiving telephone, which converts the signals into audible sound in the receiver or sometimes a ": null
    },
    {
        "loudspeaker": "Loudspeaker"
    },
    {
        ". Telephones are ": null
    },
    {
        "duplex": "Duplex"
    },
    {
        " devices, meaning they permit transmission in both directions simultaneously.     The first telephones were directly connected to each other from one customers office or residence to another customers location. Being impractical beyond just a few customers, these systems were quickly replaced by manually operated centrally located ": null
    },
    {
        "switchboards": "Telephone Switchboard"
    },
    {
        ". These exchanges were soon connected together, eventually forming an automated, worldwide ": null
    },
    {
        "public switched telephone network": "Public Switched Telephone Network"
    },
    {
        ". For greater mobility, various radio systems were developed for transmission between mobile stations on ships and automobiles in the mid-20th century. Hand-held ": null
    },
    {
        "mobile phones": "Mobile Phone"
    },
    {
        " were introduced for personal service starting in 1973. In later decades their analog cellular system evolved into digital networks with greater capability and lower cost.     ": null
    },
    {
        "Convergence": "Technological Convergencecell Phone Convergence"
    },
    {
        " has given most modern cell phones capabilities far beyond simple voice conversation. Most are ": null
    },
    {
        "smartphones": "Smartphone"
    },
    {
        ", integrating all mobile communication and many computing needs.            A traditional ": null
    },
    {
        "landline": "Landline"
    },
    {
        " telephone system, also known as  plain old telephone service  , commonly carries both control and audio signals on the same ": null
    },
    {
        "twisted pair": "Twisted Pair"
    },
    {
        "  of insulated wires, the telephone line. The control and signaling equipment consists of three components, the ringer, the hookswitch, and a dial. The ringer, or beeper, light or other device , alerts the user to incoming calls. The hookswitch signals to the central office that the user has picked up the handset to either answer a call or initiate a call. A dial, if present, is used by the subscriber to transmit a telephone number to the central office when initiating a call. Until the 1960s dials used almost exclusively the ": null
    },
    {
        "rotary": "Rotary Dial"
    },
    {
        " technology, which was replaced by ": null
    },
    {
        "dual-tone multi-frequency signaling": "Dual-Tone Multi-Frequency Signaling"
    },
    {
        " with ": null
    },
    {
        "pushbutton telephones": "Push-Button Telephone"
    },
    {
        " .     A major expense of wire-line telephone service is the outside wire plant. Telephones transmit both the incoming and outgoing speech signals on a single pair of wires. A twisted pair line rejects ": null
    },
    {
        "electromagnetic interference": "Electromagnetic Interference"
    },
    {
        " and ": null
    },
    {
        "crosstalk": "Crosstalk"
    },
    {
        " better than a single wire or an untwisted pair. The strong outgoing speech signal from the microphone does not overpower the weaker incoming speaker signal with ": null
    },
    {
        "sidetone": "Sidetone"
    },
    {
        " because a ": null
    },
    {
        "hybrid coil": "Hybrid Coil"
    },
    {
        " and other components compensate the imbalance. The junction box arrests lightning and ": null
    },
    {
        "adjusts the lines resistance": "Impedance Matching"
    },
    {
        " to maximize the signal power for the line length. Telephones have similar adjustments for inside line lengths . The line voltages are negative compared to earth, to reduce ": null
    },
    {
        "galvanic corrosion": "Galvanic Corrosion"
    },
    {
        ". Negative voltage attracts positive metal ions toward the wires.          The landline telephone contains a switchhook and an alerting device, usually a ringer , that remains connected to the phone line whenever the phone is ": null
    },
    {
        "on hook": "On Hook"
    },
    {
        " , and other components which are connected when the phone is ": null
    },
    {
        "off hook": "Off Hook"
    },
    {
        " . The off-hook components include a transmitter , a receiver , and other circuits for dialing, filtering , and amplification.     The place a telephone call, the ": null
    },
    {
        "calling party": "Calling Party"
    },
    {
        " picks up the telephones handset, thereby operating a lever which closes the hook switch . This powers the telephone by connecting the transmission hybrid transformer, as well as the transmitter and receiver to the line. In this off-hook state, the telephone circuitry has a low resistance of typically than 300 ": null
    },
    {
        "ohms": "Ohm"
    },
    {
        ", which causes the flow of ": null
    },
    {
        "direct current": "Direct Current"
    },
    {
        " in the line from the telephone exchange. The exchange detects this current, attaches a digit receiver circuit to the line, and sends ": null
    },
    {
        "dial tone": "Dial Tone"
    },
    {
        " to indicate its readiness. On a modern ": null
    },
    {
        "push-button telephone": "Push-Button Telephone"
    },
    {
        ", the caller then presses the number keys to send the telephone number of the destination, the ": null
    },
    {
        "called party": "Called Party"
    },
    {
        ". The keys control a tone generator circuit that sends ": null
    },
    {
        "DTMF": "Dtmf"
    },
    {
        " tones to the exchange. A ": null
    },
    {
        "rotary-dial telephone": "Rotary Dial"
    },
    {
        " uses ": null
    },
    {
        "pulse dialing": "Pulse Dialing"
    },
    {
        ", sending electrical pulses, that the exchange counts to decode each digit of the telephone number. If the called partys line is available, the terminating exchange applies an intermittent alternating current ": null
    },
    {
        "ringing signal": "Ringing"
    },
    {
        " of 40 to 90 volts to alert the called party of the incoming call. If the called partys line is in use, however, the exchange returns a ": null
    },
    {
        "busy signal": "Busy Signal"
    },
    {
        " to the calling party. If the called partys line is in use but subscribes to ": null
    },
    {
        "call waiting": "Call Waiting"
    },
    {
        " service, the exchange sends an intermittent audible tone to the called party to indicate another call.     The electromechanical ringer of a telephone is connected to the line through a ": null
    },
    {
        "capacitor": "Capacitor"
    },
    {
        " , which blocks direct current and passes the alternating current of the ringing power. The telephone draws no current when it is on hook, while a DC voltage is continually applied to the line. Exchange circuitry can send an AC current down the line to activate the ringer and announce an incoming call. In manual service exchange areas, before dial service was installed, telephones had hand-cranked ": null
    },
    {
        "magneto generators": "Telephone Magneto"
    },
    {
        " to generate a ringing voltage back to the exchange or any other telephone on the same line. When a landline telephone is inactive , the circuitry at the telephone exchange detects the absence of direct current to indicate that the line is not in use.  When a party initiates a call to this line, the exchange sends the ringing signal. When the called party picks up the handset, they actuate a double-circuit switchhook which may simultaneously disconnects the alerting device and connects the audio circuitry to the line. This, in turn, draws direct current through the line, confirming that the called phone is now active. The exchange circuitry turns off the ring signal, and both telephones are now active and connected through the exchange. The parties may now converse as long as both phones remain off hook. When a party hangs up, placing the handset back on the cradle or hook, direct current ceases in that line, signaling the exchange to disconnect the call.     Calls to parties beyond the local exchange are carried over ": null
    },
    {
        "trunk": "Trunking"
    },
    {
        " lines which establish connections between exchanges. In modern telephone networks, ": null
    },
    {
        "fiber-optic cable": "Fiber-Optic Communication"
    },
    {
        " and ": null
    },
    {
        "digital technology": "Digital Multiplex System"
    },
    {
        " are often employed in such connections. ": null
    },
    {
        "Satellite technology": "Communications Satellite"
    },
    {
        " may be used for communication over very long distances.     In most landline telephones, the transmitter and receiver are located in the handset, although in a ": null
    },
    {
        "speakerphone": "Speakerphone"
    },
    {
        " these components may be located in the base or in a separate enclosure. Powered by the line, the microphone produces a modulated electric current which varies its ": null
    },
    {
        "frequency": "Frequency"
    },
    {
        " and ": null
    },
    {
        "amplitude": "Amplitude"
    },
    {
        " in response to the ": null
    },
    {
        "sound": "Sound"
    },
    {
        " waves arriving at its ": null
    },
    {
        "diaphragm": "Diaphragm"
    },
    {
        ". The resulting current is transmitted along the telephone line to the local exchange then on to the other phone , where it passes through the ": null
    },
    {
        "coil": "Voice Coil"
    },
    {
        " of the receiver . The varying current in the coil produces a corresponding movement of the receivers diaphragm, reproducing the original sound waves present at the transmitter.     Along with the microphone and speaker, additional circuitry is incorporated to prevent the incoming speaker signal and the outgoing microphone signal from interfering with each other. This is accomplished through a ": null
    },
    {
        "hybrid coil": "Hybrid Coil"
    },
    {
        " . The incoming audio signal passes through a resistor and the primary winding of the coil which passes it to the speaker . Since the current path A8 – A3 has a far lower impedance than the microphone , virtually all of the incoming signal passes through it and bypasses the microphone.     At the same time the DC voltage across the line causes a DC current which is split between the resistor-coil branch and the microphone-coil branch. The DC current through the resistor-coil branch has no effect on the incoming audio signal. But the DC current passing through the microphone is turned into AC current which then passes through only the upper branch of the coils primary winding, which has far fewer turns than the lower primary winding. This causes a small portion of the microphone output to be fed back to the speaker, while the rest of the AC current goes out through the phone line.     A ": null
    },
    {
        "linemans handset": "Linemans Handset"
    },
    {
        " is a telephone designed for testing the telephone network, and may be attached directly to aerial lines and other infrastructure components.                     Before the development of the electric telephone, the term telephone was applied to other inventions, and not all early researchers of the electrical device called it telephone . Perhaps the earliest use of the word for a communications system was the telephon of Gottfried Huth in 1796. Huth proposed an alternative to the ": null
    },
    {
        "optical telegraph": "Optical Telegraph"
    },
    {
        " of ": null
    },
    {
        "Claude Chappe": "Claude Chappe"
    },
    {
        " in which the operators in the signalling towers would shout to each other by means of what he called speaking tubes , but would now be called giant ": null
    },
    {
        "megaphones": "Megaphone"
    },
    {
        ". Holzmann, Gerard J.; Pehrson, Björn, The Early History of Data Networks, pp. 90-91, Wiley, 1995 . A communication device for sailing vessels called a telephone was invented by the captain John Taylor in 1844. This instrument used four ": null
    },
    {
        "air horns": "Air Horn"
    },
    {
        " to communicate with vessels in foggy weather.   by J. E. Kingsbury published in 1915.     ": null
    },
    {
        "Johann Philipp Reis": "Johann Philipp Reis"
    },
    {
        " used the term in reference to his invention, commonly known as the ": null
    },
    {
        "Reis telephone": "Reis Telephone"
    },
    {
        ", in c. 1860. His device appears to be the first device based on conversion of sound into electrical impulses. The term telephone was adopted into the vocabulary of many languages. It is derived from the , tēle, far and φωνή, phōnē, voice , together meaning distant voice .     Credit for the invention of the electric telephone is frequently disputed. As with other influential ": null
    },
    {
        "inventions": "Invention"
    },
    {
        " such as ": null
    },
    {
        "radio": "Invention Of Radio"
    },
    {
        ", ": null
    },
    {
        "television": "History Of Television"
    },
    {
        ", the ": null
    },
    {
        "light bulb": "Incandescent Light Bulbhistory"
    },
    {
        ", and the ": null
    },
    {
        "computer": "History Of Computing Hardware"
    },
    {
        ", several inventors pioneered experimental work on voice transmission over a wire and improved on each others ideas. New controversies over the issue still arise from time to time. ": null
    },
    {
        "Charles Bourseul": "Charles Bourseul"
    },
    {
        ", ": null
    },
    {
        "Antonio Meucci": "Antonio Meucci"
    },
    {
        ", ": null
    },
    {
        "Johann Philipp Reis": "Johann Philipp Reis"
    },
    {
        ", ": null
    },
    {
        "Alexander Graham Bell": "Alexander Graham Bell"
    },
    {
        ", and ": null
    },
    {
        "Elisha Gray": "Elisha Gray"
    },
    {
        ", amongst others, have all been credited with the invention of the telephone.      Alexander Graham Bell was the first to be awarded a patent for the electric telephone by the ": null
    },
    {
        "United States Patent and Trademark Office": "United States Patent And Trademark Office"
    },
    {
        " in March 1876.  The Bell patents were forensically victorious and commercially decisive. That first patent by Bell was the master patent of the telephone, from which other patents for electric telephone devices and features flowed.      In 1876, shortly after Bells patent application, Hungarian engineer ": null
    },
    {
        "Tivadar Puskás": "Tivadar Puskás"
    },
    {
        " proposed the telephone switch, which allowed for the formation of ": null
    },
    {
        "telephone exchanges": "Telephone Exchange"
    },
    {
        ", and eventually networks.      In the United Kingdom the blower is used as a slang term for a telephone. The term came from navy slang for a ": null
    },
    {
        "speaking tube": "Speaking Tube"
    },
    {
        ".                     ": null
    },
    {
        "Innocenzo Manzetti": "Innocenzo Manzetti"
    },
    {
        " first mooted the idea of a speaking telegraph or telephone. Use of the speaking telegraph and sound telegraph monikers would eventually be replaced by the newer, distinct name, telephone .   26 August 1854: ": null
    },
    {
        "Charles Bourseul": "Charles Bourseul"
    },
    {
        " published an article in the magazine  LIllustration  : Transmission électrique de la parole , describing a make-and-break type telephone transmitter later created by Johann Reis.   26 October 1861: ": null
    },
    {
        "Johann Philipp Reis": "Johann Philipp Reis"
    },
    {
        " publicly demonstrated the ": null
    },
    {
        "Reis telephone": "Reis Telephone"
    },
    {
        " before the Physical Society of Frankfurt. Reis telephone was not limited to musical sounds. Reis also used his telephone to transmit the phrase Das Pferd frisst keinen Gurkensalat .   22 August 1865, La Feuille dAoste reported It is rumored that English technicians to whom Mr. ": null
    },
    {
        "Manzetti": "Innocenzo Manzetti"
    },
    {
        " illustrated his method for transmitting spoken words on the telegraph wire intend to apply said invention in England on several private telegraph lines . However telephones would not be demonstrated there until 1876, with a set of telephones from Bell.   28 December 1871: ": null
    },
    {
        "Antonio Meucci": "Antonio Meucci"
    },
    {
        " files ": null
    },
    {
        "patent caveat": "Patent Caveat"
    },
    {
        " No. 3335": "Antonio Meuccipatent Caveat"
    },
    {
        " in the U.S. Patent Office titled Sound Telegraph , describing communication of voice between two people by wire. A patent caveat was not an invention ": null
    },
    {
        "patent": "Patent"
    },
    {
        " award, but only an unverified notice filed by an individual that he or she intends to file a regular patent application in the future.   1874: Meucci, after having renewed the caveat for two years does not renew it again, and the caveat lapses.   6 April 1875: Bells U.S. Patent 161,739 Transmitters and Receivers for Electric Telegraphs is granted. This uses multiple vibrating steel reeds in make-break circuits.   11 February 1876: Elisha Gray invents a liquid transmitter for use with a telephone but does not build one.   14 February 1876: Gray files a ": null
    },
    {
        "patent caveat": "Patent Caveat"
    },
    {
        " for transmitting the human voice through a telegraphic circuit.   14 February 1876: ": null
    },
    {
        "Alexander Graham Bell": "Alexander Graham Bell"
    },
    {
        " applies for the patent Improvements in Telegraphy , for electromagnetic telephones using what is now called amplitude modulation but which he referred to as undulating current .   19 February 1876: Gray is notified by the U.S. Patent Office of an interference between his caveat and Bells patent application. Gray decides to abandon his caveat.   7 March 1876: Bells U.S. patent 174,465 Improvement in Telegraphy is granted, covering the method of, and apparatus for, transmitting vocal or other sounds telegraphically…by causing electrical undulations, similar in form to the vibrations of the air accompanying the said vocal or other sound.   10 March 1876: The first successful telephone transmission of clear speech using a liquid transmitter when Bell spoke into his device, Mr. Watson, come here, I want to see you. and Watson heard each word distinctly.   30 January 1877: Bells U.S. patent 186,787 is granted for an electromagnetic telephone using permanent magnets, iron diaphragms, and a call bell.   27 April 1877: Edison files for a patent on a carbon transmitter. The patent 474,230 was granted 3 May 1892, after a 15-year delay because of litigation. Edison was granted patent 222,390 for a carbon granules transmitter in 1879.       Early telephones were technically diverse. Some used a ": null
    },
    {
        "water microphone": "Water Microphone"
    },
    {
        ", some had a metal diaphragm that induced current in an electromagnet wound around a permanent magnet, and some were ": null
    },
    {
        "dynamic": "Dynamic Microphone"
    },
    {
        " – their diaphragm vibrated a coil of wire in the field of a permanent magnet or the coil vibrated the diaphragm. The sound-powered dynamic variants survived in small numbers through the 20th century in military and maritime applications, where its ability to create its own electrical power was crucial. Most, however, used the Edison/Berliner ": null
    },
    {
        "carbon transmitter": "Carbon Transmitter"
    },
    {
        ", which was much louder than the other kinds, even though it required an ": null
    },
    {
        "induction coil": "Induction Coil"
    },
    {
        " which was an ": null
    },
    {
        "impedance matching": "Impedance Matching"
    },
    {
        " transformer to make it compatible with the impedance of the line. The Edison patents kept the Bell monopoly viable into the 20th century, by which time the network was more important than the instrument.     Early telephones were locally powered, using either a dynamic transmitter or by the powering of a transmitter with a local battery. One of the jobs of ": null
    },
    {
        "outside plant": "Outside Plant"
    },
    {
        " personnel was to visit each telephone periodically to inspect the battery. During the 20th century, telephones powered from the telephone exchange over the same wires that carried the voice signals became common.     Early telephones used a single wire for the subscribers line, with ": null
    },
    {
        "ground return": "Single Wire Earth Return"
    },
    {
        " used to complete the circuit . The earliest dynamic telephones also had only one port opening for sound, with the user alternately listening and speaking into the same hole. Sometimes the instruments were operated in pairs at each end, making conversation more convenient but also more expensive.     At first, the benefits of a telephone exchange were not exploited. Instead telephones were leased in pairs to a ": null
    },
    {
        "subscriber": "Subscriber"
    },
    {
        ", who had to arrange for a telegraph contractor to construct a line between them, for example between a home and a shop. Users who wanted the ability to speak to several different locations would need to obtain and set up three or four pairs of telephones. ": null
    },
    {
        "Western Union": "Western Union"
    },
    {
        ", already using telegraph exchanges, quickly extended the principle to its telephones in ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " and ": null
    },
    {
        "San Francisco": "San Francisco"
    },
    {
        ", and Bell was not slow in appreciating the potential.     ": null
    },
    {
        "Signalling": "Signaling"
    },
    {
        " began in an appropriately primitive manner. The user alerted the other end, or the exchange ": null
    },
    {
        "operator": "Switchboard Operator"
    },
    {
        ", by ": null
    },
    {
        "whistling": "Whistling"
    },
    {
        " into the transmitter. Exchange operation soon resulted in telephones being equipped with a bell in a ": null
    },
    {
        "ringer box": "Ringer Box"
    },
    {
        ", first operated over a second wire, and later over the same wire, but with a condenser  in series with the bell coil to allow the ": null
    },
    {
        "AC": "Alternating Current"
    },
    {
        " ringer signal through while still blocking ": null
    },
    {
        "DC": "Direct Current"
    },
    {
        " . Telephones connected to the earliest ": null
    },
    {
        "Strowger switch": "Strowger Switch"
    },
    {
        " automatic exchanges had seven wires, one for the ": null
    },
    {
        "knife switch": "Changeover Switch"
    },
    {
        ", one for each ": null
    },
    {
        "telegraph key": "Telegraph Key"
    },
    {
        ", one for the bell, one for the ": null
    },
    {
        "push-button": "Push-Button"
    },
    {
        " and two for speaking. Large wall telephones in the early 20th century usually incorporated the bell, and separate ": null
    },
    {
        "bell box": "Bell Box"
    },
    {
        "es for desk phones dwindled away in the middle of the century.     Rural and other telephones that were not on a common battery exchange had a ": null
    },
    {
        "magneto": "Telephone Magneto"
    },
    {
        " hand-cranked generator to produce a high voltage alternating signal to ring the bells of other telephones on the line and to alert the operator. Some local farming communities that were not connected to the main networks set up ": null
    },
    {
        "barbed wire telephone lines": "Barbed Wire Telephone Lines"
    },
    {
        " that exploited the existing system of field fences to transmit the signal.        In the 1890s a new smaller style of telephone was introduced, packaged in three parts. The transmitter stood on a stand, known as a ": null
    },
    {
        "candlestick": "Candlestick Telephone"
    },
    {
        " for its shape. When not in use, the receiver hung on a hook with a switch in it, known as a switchhook . Previous telephones required the user to operate a separate switch to connect either the voice or the bell. With the new kind, the user was less likely to leave the phone off the hook . In phones connected to magneto exchanges, the bell, induction coil, battery and magneto were in a separate bell box or ": null
    },
    {
        "ringer box": "Ringer Box"
    },
    {
        " .  In phones connected to common battery exchanges, the ringer box was installed under a desk, or other out of the way place, since it did not need a battery or magneto.     Cradle designs were also used at this time, having a handle with the receiver and transmitter attached, now called a ": null
    },
    {
        "handset": "Handset"
    },
    {
        ", separate from the cradle base that housed the magneto crank and other parts. They were larger than the candlestick and more popular.     Disadvantages of single wire operation such as crosstalk and ": null
    },
    {
        "hum from nearby AC power wires": "Mains Hum"
    },
    {
        " had already led to the use of twisted pairs and, for long distance telephones, ": null
    },
    {
        "four-wire circuits": "Four-Wire Circuit"
    },
    {
        ". Users at the beginning of the 20th century did not place ": null
    },
    {
        "long distance calls": "Long Distance Call"
    },
    {
        " from their own telephones but made an appointment to use a special soundproofed long distance ": null
    },
    {
        "telephone booth": "Telephone Booth"
    },
    {
        " furnished with the latest technology.     What turned out to be the most popular and longest lasting physical style of telephone was introduced in the early 20th century, including Bells ": null
    },
    {
        "202-type": "Model 202 Telephone"
    },
    {
        " desk set. A carbon granule transmitter and electromagnetic receiver were united in a single molded plastic handle, which when not in use sat in a cradle in the base unit. The circuit diagram of the model 202 shows the direct connection of the transmitter to the line, while the receiver was induction coupled. In local battery configurations, when the local loop was too long to provide sufficient current from the exchange, the transmitter was powered by a local battery and inductively coupled, while the receiver was included in the local loop. , Porticus Telephone website. The coupling transformer and the ringer were mounted in a separate enclosure, called the subscriber set. The dial switch in the base interrupted the line current by repeatedly but very briefly disconnecting the line 1 to 10 times for each digit, and the hook switch disconnected the line and the transmitter battery while the handset was on the cradle.     In the 1930s, telephone sets were developed that combined the bell and induction coil with the desk set, obviating a separate ringer box. The ": null
    },
    {
        "rotary dial": "Rotary Dial"
    },
    {
        " becoming commonplace in the 1930s in many areas enabled customer-dialed service, but some magneto systems remained even into the 1960s. After World War II, the telephone networks saw rapid expansion and more efficient telephone sets, such as the ": null
    },
    {
        "model 500 telephone": "Model 500 Telephone"
    },
    {
        " in the United States, were developed that permitted larger local networks centered around central offices. A breakthrough new technology was the introduction of Touch-Tone signaling using ": null
    },
    {
        "push-button telephones": "Push-Button Telephone"
    },
    {
        " by ": null
    },
    {
        "American Telephone & Telegraph Company": "American Telephone  &  Telegraph Company"
    },
    {
        " Ericsson DBH 1001": "Ericsson Dbh 1001 Telephone"
    },
    {
        "  Ericofon": "Ericofon"
    },
    {
        " sound-powered emergency telephone": "Sound-Powered Telephone"
    },
    {
        " mobile phone": "Mobile Phone"
    },
    {
        ", called a cell phone                    The invention of the ": null
    },
    {
        "transistor": "Transistor"
    },
    {
        " in 1947 dramatically changed the technology used in telephone systems and in the long-distance transmission networks, over the next several decades. With the development of ": null
    },
    {
        "electronic switching systems": "Electronic Switching System"
    },
    {
        " incorporating ": null
    },
    {
        "metal–oxide–semiconductor": "Metal–Oxide–Semiconductor"
    },
    {
        " and ": null
    },
    {
        "pulse-code modulation": "Pulse-Code Modulation"
    },
    {
        " technologies, ": null
    },
    {
        "telephony": "Telephony"
    },
    {
        " gradually evolved towards ": null
    },
    {
        "digital telephony": "Digital Telephony"
    },
    {
        ", which improved the capacity, quality, and cost of the network.      The development of digital data communications method, such as the protocols used for the ": null
    },
    {
        "Internet": "Internet"
    },
    {
        ", it became possible to digitize voice and transmit it as real-time data across ": null
    },
    {
        "computer networks": "Computer Network"
    },
    {
        ", giving rise to the field of Internet Protocol telephony, also known as ": null
    },
    {
        "voice over Internet Protocol": "Voice Over Internet Protocol"
    },
    {
        " , a term that reflects the methodology memorably. VoIP has proven to be a ": null
    },
    {
        "disruptive technology": "Disruptive Technology"
    },
    {
        " that is rapidly replacing traditional telephone network infrastructure.     As of January 2005, up to 10% of telephone subscribers in ": null
    },
    {
        "Japan": "Japan"
    },
    {
        " and ": null
    },
    {
        "South Korea": "South Korea"
    },
    {
        " have switched to this digital telephone service. A January 2005 ": null
    },
    {
        "Newsweek": "Newsweek"
    },
    {
        " article suggested that Internet telephony may be the next big thing.  As of 2006 many VoIP companies offer service to ": null
    },
    {
        "consumers": "Consumer"
    },
    {
        " and ": null
    },
    {
        "business": "Business"
    },
    {
        "es.     From a customer perspective, IP telephony uses a high-bandwidth Internet connection and specialized customer premises equipment to transmit telephone calls via the Internet, or any modern private data network. The customer equipment may be an ": null
    },
    {
        "analog telephone adapter": "Analog Telephone Adapter"
    },
    {
        " which interfaces a conventional analog telephone to the IP networking equipment, or it may be an ": null
    },
    {
        "IP Phone": "Ip Phone"
    },
    {
        " that has the networking and interface technology built into the desk-top set and provides the traditional, familiar parts of a telephone, the handset, the dial or keypad, and a ringer in a package that usually resembles a standard telephone set.     In addition, many computer software vendors and telephony operators provide ": null
    },
    {
        "softphone": "Softphone"
    },
    {
        " application software that emulates a telephone by use of an attached microphone and audio headset, or ": null
    },
    {
        "loud speaker": "Loud Speaker"
    },
    {
        ".     Despite the new features and conveniences of IP telephones, some may have notable disadvantages compared to traditional telephones. Unless the IP telephones components are backed up with an ": null
    },
    {
        "uninterruptible power supply": "Uninterruptible Power Supply"
    },
    {
        " or other emergency power source, the phone ceases to function during a ": null
    },
    {
        "power outage": "Power Outage"
    },
    {
        " as can occur during an emergency or disaster when the phone is most needed. Traditional phones connected to the older ": null
    },
    {
        "PSTN": "Pstn"
    },
    {
        " network do not experience that problem since they are powered by the telephone companys battery supply, which will continue to function even if there is a prolonged power outage. Another problem in Internet-based services is the lack of a fixed physical location, impacting the provisioning of emergency services such as police, fire or ambulance, should someone call for them. Unless the registered user updates the IP phones physical address location after moving to a new residence, emergency services can be, and have been, dispatched to the wrong location.       Graphic symbols used to designate telephone service or phone-related information in print, ": null
    },
    {
        "signage": "Signage"
    },
    {
        ", and other media include ℡ , ☎ , ☏ , ✆  and ⌕ .       In 2002, only 10% of the worlds population used cell phones and by 2005 that percentage had risen to 46%.  By the end of 2009, there were a total of nearly 6 billion mobile and fixed-line telephone subscribers worldwide. This included 1.26 billion fixed-line subscribers and 4.6 billion mobile subscribers. , International Telecommunications Union website, 4 September 2007. Retrieved 5 July 2009.       —Telegraphy —Alexander Graham Bell   —Electric Telegraphy —Alexander Graham Bell   —Speaking Telegraph —Thomas Edison   —Speaking Telephone —Thomas Edison   —Carbon Telephone —Thomas Edison   —Telephone —Anthony C. White This design was used until 1925 and installed phones were used until the 1940s.   —Duplex Radio Communication and Signalling Apparatus—G. H. Sweigert   —Cellular Mobile Communication System—Amos Edward Joel   —Radio Telephone System ": null
    }
]