[
    {
        "           Sir Terence David John Pratchett  was an English ": null
    },
    {
        "humorist": "Humorist"
    },
    {
        ", ": null
    },
    {
        "satirist": "Satirist"
    },
    {
        ", and author of ": null
    },
    {
        "fantasy novels": "Fantasy Novels"
    },
    {
        ", especially ": null
    },
    {
        "comical works": "Comic Fantasy"
    },
    {
        ".  He is best known for his  Discworld  series of 41 novels.     Pratchetts ": null
    },
    {
        "first novel": "Debut Novel"
    },
    {
        ",  The Carpet People , was published in 1971. The first Discworld novel,  The Colour of Magic , was published in 1983, after which Pratchett wrote an average of two books a year. His 2011 Discworld novel  Snuff  became the third-fastest-selling hardback adult-readership novel since records began in the UK, selling 55,000  copies in the first three days.  The final Discworld novel,  The Shepherds Crown , was published in August 2015, five months after his death.     Pratchett, with more than 85  million books sold worldwide in 37  languages,   was the UKs best-selling author of the 1990s.   He was appointed Officer of the Order of the British Empire in 1998 and was ": null
    },
    {
        "knighted": "Knight Bachelor"
    },
    {
        " for services to literature in the ": null
    },
    {
        "2009 New Year Honours": "2009 New Year Honours"
    },
    {
        ".     In 2001 he won the annual ": null
    },
    {
        "Carnegie Medal": "Carnegie Medal"
    },
    {
        " for  The Amazing Maurice and his Educated Rodents , the first Discworld book marketed for children. He received the ": null
    },
    {
        "World Fantasy Award for Life Achievement": "World Fantasy Award For Life Achievement"
    },
    {
        " in 2010.      In December 2007, Pratchett announced that he had been diagnosed with ": null
    },
    {
        "early-onset Alzheimers disease": "Early-Onset Alzheimers Disease"
    },
    {
        ".  He later made a substantial public donation to the ": null
    },
    {
        "Alzheimers Research Trust": "Alzheimers Research Trust"
    },
    {
        "  , filmed a television programme chronicling his experiences with the condition for the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        ", and became a patron for Alzheimers Research UK.  Pratchett died on 12 March 2015, aged 66.             Pratchett was born on 28 April 1948   in ": null
    },
    {
        "Beaconsfield": "Beaconsfield"
    },
    {
        " in ": null
    },
    {
        "Buckinghamshire": "Buckinghamshire"
    },
    {
        ", England , the only child of David and Eileen Pratchett , of ": null
    },
    {
        "Hay-on-Wye": "Hay-On-Wye"
    },
    {
        ". Bucks Free Press, p.  121 Sir Terry Pratchett Tribute. 20 March 2015. His family moved to ": null
    },
    {
        "Bridgwater": "Bridgwater"
    },
    {
        ", ": null
    },
    {
        "Somerset": "Somerset"
    },
    {
        ", briefly in 1957, following which he passed his ": null
    },
    {
        "eleven plus exam": "Eleven Plus Exam"
    },
    {
        " in 1959, earning a place in High Wycombe Technical High School   where he was a key member of the debating society J. R. Hughes U6A, The Senior Debating Society 1965 , in Cygnet, Wycombe Technical High School Magazine, May 1966, Vol. 2, no. 1, p. and wrote stories for the school magazine. Stories in the Technical Cygnet Whos Who  entry, credits his education to the Beaconsfield Public Library.  His maternal grandparents came from Ireland.      His early interests included ": null
    },
    {
        "astronomy": "Astronomy"
    },
    {
        ".  He collected ": null
    },
    {
        "Brooke Bond": "Brooke Bond"
    },
    {
        " tea cards about space, owned a telescope  and wanted to be an astronomer, but lacked the necessary mathematical skills. He developed an interest in reading ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        " and began attending ": null
    },
    {
        "science fiction conventions": "Science Fiction Convention"
    },
    {
        "from about 1963–1964, but stopped a few years later when he got his first job as a trainee journalist at the local paper. His early reading included the works of ": null
    },
    {
        "H. G. Wells": "H. G. Wells"
    },
    {
        ", ": null
    },
    {
        "Arthur Conan Doyle": "Arthur Conan Doyle"
    },
    {
        ", and every book you really ought to read , which he later regarded as getting an education .      Pratchett published his first short story entitled Business Rivals in the High Wycombe Technical School magazine in 1962. It is the tale of a man named Crucible who finds the Devil in his flat in a cloud of sulphurous smoke. The Hades Business , which was published in the school magazine when he was 13, was published commercially when he was 15.      Pratchett earned five ": null
    },
    {
        "O-levels": "O-Levels"
    },
    {
        " and started ": null
    },
    {
        "A-level": "Advanced Level"
    },
    {
        " courses in Art, English and History. His initial career choice was ": null
    },
    {
        "journalism": "Journalism"
    },
    {
        " and he left school at 17, in 1965, to start an apprenticeship with Arthur Church, the editor of the  Bucks Free Press . In this position he wrote, among other things, over eighty stories for the Childrens Circle section under the name Uncle Jim. Two of these episodic stories contain characters found in his novel  The Carpet People  . Bucks Free Press, issues of 8 October to 23 December 1965, and 20 January to 3 March 1967. While on ": null
    },
    {
        "day release": "Wikt:Day Releasenoun-Employment"
    },
    {
        " from his apprenticeship he finished his A-Level in English and took the ": null
    },
    {
        "National Council for the Training of Journalists": "National Council For The Training Of Journalists"
    },
    {
        " proficiency course where he received the highest marks of his group.        Pratchett had his writing breakthrough in 1968 when he interviewed ": null
    },
    {
        "Peter Bander van Duren": "Peter Bander Van Duren"
    },
    {
        ", co-director of a small publishing company, Colin Smythe Ltd. During the meeting, Pratchett mentioned he had written a manuscript,  The Carpet People .  Colin Smythe Ltd published the book in 1971, with illustrations by the author. The book received strong, although few, reviews Peter Grosvenor in the Daily Express, 9 December 1971; Rosemary Doyle in The Irish Times, 7 January 1972; Michael Pollard in Teachers World, 7 March 1972. and was followed by the ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        " novels  The Dark Side of the Sun  and  Strata  .     After various positions in journalism, in 1980 Pratchett became Press Officer for the ": null
    },
    {
        "Central Electricity Generating Board": "Cegb"
    },
    {
        " in an area that covered four ": null
    },
    {
        "nuclear power station": "Nuclear Power Station"
    },
    {
        "s. He later joked that he had demonstrated impeccable timing by making this career change so soon after the ": null
    },
    {
        "Three Mile Island": "Three Mile Island Accident"
    },
    {
        " nuclear accident in ": null
    },
    {
        "Pennsylvania": "Pennsylvania"
    },
    {
        ", US, and said he would write a book about my experiences, if I thought anyone would believe it .      The first Discworld novel,  The Colour of Magic , was published in ": null
    },
    {
        "hardback": "Hardback"
    },
    {
        " by Colin Smythe Ltd in 1983. The paperback edition was published by Corgi, an ": null
    },
    {
        "imprint": "Imprint"
    },
    {
        " of ": null
    },
    {
        "Transworld": "Transworld"
    },
    {
        ", in 1985. Pratchetts popularity increased when the BBCs  Womans Hour  broadcast The Colour of Magic as a serial in six parts, and later  Equal Rites . Subsequently, the hardback rights were taken by the publishing house ": null
    },
    {
        "Victor Gollancz Ltd": "Victor Gollancz Ltd"
    },
    {
        ", which remained Pratchetts publisher until 1997, Colin Smythe having become Pratchetts ": null
    },
    {
        "agent": "Literary Agent"
    },
    {
        ". Pratchett was the first fantasy author published by Gollancz.     Pratchett gave up working for the CEGB to make his living through writing in 1987, after finishing the fourth Discworld novel,  Mort . His sales increased quickly and many of his books occupied top places on the best-seller list; he was the UKs best-selling author of the 1990s. According to The Times, Pratchett was the top-selling and highest earning UK author in 1996. Some of his books have been published by ": null
    },
    {
        "Doubleday": "Doubleday"
    },
    {
        ", another Transworld imprint. In the US, Pratchett is published by ": null
    },
    {
        "HarperCollins": "Harpercollins"
    },
    {
        ".     According to the Booksellers Pocket Yearbook , in 2003 Pratchetts UK sales amounted to 3.4% of the fiction market by hardback sales and 3.8% by value, putting him in second place behind ": null
    },
    {
        "J. K. Rowling": "J. K. Rowling"
    },
    {
        " , while in the paperback sales list Pratchett came 5th with 1.2% and 1.3% by value .  His sales in the UK alone are more than 2.5  million copies a year.         Pratchett married Lyn Purves at the Congregational Church, ": null
    },
    {
        "Gerrards Cross": "Gerrards Cross"
    },
    {
        ", on 5 October 1968, and they moved to ": null
    },
    {
        "Rowberrow": "Rowberrow"
    },
    {
        ", ": null
    },
    {
        "Somerset": "Somerset"
    },
    {
        ", in 1970. Their daughter ": null
    },
    {
        "Rhianna Pratchett": "Rhianna Pratchett"
    },
    {
        ", who is also a writer, was born there in 1976. In 1993, the family moved to ": null
    },
    {
        "Broad Chalke": "Broad Chalke"
    },
    {
        ", a village west of ": null
    },
    {
        "Salisbury": "Salisbury"
    },
    {
        ", ": null
    },
    {
        "Wiltshire": "Wiltshire"
    },
    {
        ".  He listed his recreations as writing, walking, computers, life .  He described himself as a ": null
    },
    {
        "humanist": "Secular Humanism"
    },
    {
        " and was a Distinguished Supporter of ": null
    },
    {
        "Humanists UK": "Humanists Uk"
    },
    {
        "  and an Honorary Associate of the ": null
    },
    {
        "National Secular Society": "National Secular Society"
    },
    {
        ".  He was the patron of the Friends of ": null
    },
    {
        "High Wycombe": "High Wycombe"
    },
    {
        " Library.  In 2013 he gave a talk at Beaconsfield Library which he had visited as a child and donated the income from the event to it. On a number of occasions he also visited his former school to speak to the students and look around.     Pratchett was well known for his penchant for wearing large, black ": null
    },
    {
        "fedora": "Fedora"
    },
    {
        " hats,  as seen on the inside back covers of most of his books. His style has been described as more that of urban cowboy than city gent.      Concern for the future of civilisation prompted him to install five  kilowatts of ": null
    },
    {
        "photovoltaic cells": "Solar Cell"
    },
    {
        "  at his house.  Having been interested in astronomy since childhood, he had an observatory built in his garden. An asteroid  is named after him.      On 31 December 2008, it was announced that Pratchett would be ": null
    },
    {
        "knight": "Knight"
    },
    {
        "ed  in the Queens ": null
    },
    {
        "2009 New Year Honours": "2009 New Year Honours"
    },
    {
        ".  He formally received the ": null
    },
    {
        "accolade": "Accolade"
    },
    {
        " at Buckingham Palace on 18 February 2009.  Afterwards he said, You cant ask a fantasy writer not to want a knighthood. You know, for two pins Id get myself a horse and a sword.  In late 2009, he did make himself a sword, with the help of his friends. He told a  Times Higher Education  interviewer that At the end of last year I made my own sword. I dug out the iron ore from a field about 10  miles away – I was helped by interested friends. We lugged 80  kilos of iron ore, used clay from the garden and straw to make a kiln, and lit the kiln with wildfire by making it with a bow. ": null
    },
    {
        "Colin Smythe": "Colin Smythe"
    },
    {
        ", his longtime friend and agent, donated some pieces of ": null
    },
    {
        "meteoric iron": "Meteoric Iron"
    },
    {
        " – thunderbolt iron has a special place in magic and we put that in the smelt, and I remember when we sawed the iron apart it looked like silver. Everything about it I touched, handled and so forth ... And everything was as it should have been, it seemed to me.      In 2013, Pratchett was named Humanist of the Year by the ": null
    },
    {
        "British Humanist Association": "British Humanist Association"
    },
    {
        " for his campaign to fund research into Alzheimers, his contribution to the ": null
    },
    {
        "right to die": "Right To Die"
    },
    {
        " public debate and his Humanist values.        In August 2007, Pratchett was misdiagnosed as having had a minor ": null
    },
    {
        "stroke": "Stroke"
    },
    {
        " a few years before, which doctors believed had damaged the right side of his brain.   In December 2007, he announced that he had been newly diagnosed with early-onset ": null
    },
    {
        "Alzheimers disease": "Alzheimers Disease"
    },
    {
        ", which had been responsible for the stroke . He had a rare form of ": null
    },
    {
        "posterior cortical atrophy": "Posterior Cortical Atrophy"
    },
    {
        " , a disease in which areas at the back of the brain begin to shrink and shrivel.     Describing the diagnosis as an embuggerance in a radio interview, Pratchett appealed to people to keep things cheerful and proclaimed that we are taking it fairly philosophically down here and possibly with a mild optimism.  He stated he felt he had time for at least a few more books yet , and added that while he understood the impulse to ask is there anything I can do? , in this case he would only entertain such offers from very high-end experts in brain chemistry. Discussing his diagnosis at the ": null
    },
    {
        "Bath Literature Festival": "Bath Literature Festival"
    },
    {
        " in early 2008, Pratchett revealed that by then he found it too difficult to write dedications when signing books.  In his later years Pratchett wrote by dictating to his assistant, Rob Wilkins, or by using ": null
    },
    {
        "speech recognition": "Speech Recognition"
    },
    {
        " software.         In March 2008, Pratchett announced he would donate US$1,000,000 to the ": null
    },
    {
        "Alzheimers Research Trust": "Alzheimers Research Trust"
    },
    {
        ", and that he was shocked to find out that funding for Alzheimers research is just 3% of that to find cancer cures.  He said: I am, along with many others, scrabbling to stay ahead long enough to be there when the cure comes along.     In April 2008, Pratchett worked with the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " to make a two-part documentary series about his illness, Terry Pratchett: Living With Alzheimers.  The first part was broadcast on ": null
    },
    {
        "BBC Two": "Bbc Two"
    },
    {
        " on 4 February 2009, drawing 2.6  million viewers and a 10.4% audience share.  The second, broadcast on 11 February 2009, drew 1.72  million viewers and a 6.8% audience share.  The documentary won a ": null
    },
    {
        "BAFTA": "Bafta"
    },
    {
        " award in the Factual Series category.  Pratchett also made an appearance on  The One Show  on 15 May 2008, talking about his condition. He was the subject and interviewee of the 20 May 2008 edition of On the Ropes , discussing Alzheimers and how it had affected his life.     On 8 June 2008, news reports indicated that Pratchett had an experience which he described as: It is just possible that once you have got past all the gods that we have created with big beards and many human traits, just beyond all that, on the other side of physics, there just may be the ordered structure from which everything flows and I dont actually believe in anyone who could have put that in my head .   He went into further detail on  Front Row , in which he was asked if this was a shift in his beliefs: A shift in me in the sense I heard my father talk to me when I was in the garden one day. But Im absolutely certain that what I heard was my memories of my father. An ": null
    },
    {
        "engram": "Engram"
    },
    {
        ", or something in my head...This is not about God, but somewhere around there is where gods come from.      On 26 November 2008, Pratchett met the Prime Minister ": null
    },
    {
        "Gordon Brown": "Gordon Brown"
    },
    {
        " and asked for an increase in dementia research funding.  Pratchett tested a prototype device to address his condition.   The ability of the device to alter the course of the illness has been met with skepticism from Alzheimers researchers.      In an article published mid-2009, Pratchett stated that he wished to die by ": null
    },
    {
        "assisted suicide": "Assisted Suicide"
    },
    {
        " before his disease progressed to a critical point. Irvine, Chris. , Telegraph, 2 August 2009. He later said he felt it should be possible for someone stricken with a serious and ultimately fatal illness to choose to die peacefully with medical help, rather than suffer.  Pratchett was selected to give the 2010 ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " Richard Dimbleby Lecture": "Richard Dimbleby Lecture"
    },
    {
        ",  entitled Shaking Hands With Death, broadcast on 1 February 2010.  Pratchett introduced his lecture on the topic of assisted death, but the main text was read by his friend ": null
    },
    {
        "Tony Robinson": "Tony Robinson"
    },
    {
        " because Pratchetts condition made it difficult for him to read.    In June 2011 Pratchett presented a one-off BBC ": null
    },
    {
        "television documentary": "Television Documentary"
    },
    {
        ",  Terry Pratchett: Choosing to Die , about assisted suicide. It won the Best Documentary award at the Scottish ": null
    },
    {
        "BAFTAs": "Bafta"
    },
    {
        "in November 2011.      In September 2012, Pratchett stated: I have to tell you that I thought Id be a lot worse than this by now, and so did my specialist. In the same interview, he stated that the cognitive part of his mind was untouched and his symptoms were physical . Grice, Elizabeth . . The Telegraph. Retrieved 2 October 2013. However, in July 2014 he cancelled his appearance at the biennial ": null
    },
    {
        "International Discworld Convention": "International Discworld Convention"
    },
    {
        ", saying: the Embuggerance is finally catching up with me, along with other age-related ailments .        Pratchett died at his home on the morning of 12 March 2015 from Alzheimers.   The Telegraph  reported an unidentified source as saying that despite his previous discussion of assisted suicide, his death had been natural.  After Pratchetts death, his assistant, Rob Wilkins, wrote from the official Terry Pratchett ": null
    },
    {
        "Twitter": "Twitter"
    },
    {
        " account:     The use of ": null
    },
    {
        "small capitals": "Small Capitals"
    },
    {
        " is a reference to how the character of ": null
    },
    {
        "Death": "Death"
    },
    {
        " speaks in Pratchetts works.     Public figures who paid tribute include British Prime Minister ": null
    },
    {
        "David Cameron": "David Cameron"
    },
    {
        ", comedian ": null
    },
    {
        "Ricky Gervais": "Ricky Gervais"
    },
    {
        ",  and authors ": null
    },
    {
        "Ursula K. Le Guin": "Ursula K. Le Guin"
    },
    {
        ", ": null
    },
    {
        "Terry Brooks": "Terry Brooks"
    },
    {
        ", ": null
    },
    {
        "Margaret Atwood": "Margaret Atwood"
    },
    {
        ", ": null
    },
    {
        "George R. R. Martin": "George R. R. Martin"
    },
    {
        ", and ": null
    },
    {
        "Neil Gaiman": "Neil Gaiman"
    },
    {
        ".   Pratchett was memorialised in graffiti in East London.  The video game companies ": null
    },
    {
        "Frontier Developments": "Frontier Developments"
    },
    {
        "  and ": null
    },
    {
        "Valve Corporation": "Valve Corporation"
    },
    {
        " added elements to their games named after him.  Users of the social news site ": null
    },
    {
        "Reddit": "Reddit"
    },
    {
        " organised a tribute by which an ": null
    },
    {
        "HTTP header": "Http Header"
    },
    {
        ", X-Clacks-Overhead: GNU Terry Pratchett , was added to web sites responses, a reference to the Discworld novel  Going Postal .  A June 2015 web server survey reported that approximately 84,000 websites had been configured with the header.      Pratchetts humanist funeral service was held on 25 March 2015.            Pratchett started to use computers for writing as soon as they were available to him. His first computer was a ": null
    },
    {
        "Sinclair ZX81": "Sinclair Zx81"
    },
    {
        "; the first computer he used properly for writing was an ": null
    },
    {
        "Amstrad CPC 464": "Amstrad Cpc"
    },
    {
        ", later replaced by a ": null
    },
    {
        "PC": "Personal Computer"
    },
    {
        ". Pratchett was one of the first authors to routinely use the Internet to communicate with fans, and was a contributor to the ": null
    },
    {
        "Usenet": "Usenet"
    },
    {
        " newsgroup alt.fan.pratchett from 1992.  However, he did not consider the Internet a hobby, just another thing to use . He had many computers in his house, with a bank of six ": null
    },
    {
        "monitors": "Computer Monitor"
    },
    {
        " rigged up to ease writing.   When he travelled, he always took a portable computer with him to write.     His background as a journalist and press officer led him to be concerned by 1995 about the spread of ": null
    },
    {
        "fake news": "Fake News"
    },
    {
        " on the ": null
    },
    {
        "Internet": "Internet"
    },
    {
        ". In an interview with ": null
    },
    {
        "Bill Gates": "Bill Gates"
    },
    {
        ", founder of ": null
    },
    {
        "Microsoft": "Microsoft"
    },
    {
        ", he said Let’s say I call myself the Institute for Something-or-other and I decide to promote a spurious treatise saying the Jews were entirely responsible for the second world war and ": null
    },
    {
        "the Holocaust": "The Holocaust"
    },
    {
        " didn’t happen, and it goes out there on the Internet and is available on the same terms as any piece of historical research which has undergone ": null
    },
    {
        "peer review": "Peer Review"
    },
    {
        " and so on. There’s a kind of parity of esteem of information on the net. It’s all there: there’s no way of finding out whether this stuff has any bottom to it or whether someone has just made it up . Gates was optimistic and disagreed, saying that authorities on the Net would index and check facts and reputations in a much more sophisticated way than in print. But it was Pratchett who had accurately predicted how the Internet would propagate and legitimise fake news .      His experiments with computer upgrades are reflected in ": null
    },
    {
        "Hex": "Hex"
    },
    {
        ".      Pratchett was also an avid ": null
    },
    {
        "video game": "Video Game"
    },
    {
        " player, and collaborated in the creation of a number of game adaptations of his books. He favoured games that are intelligent and have some depth , citing  Half-Life 2  and fan missions from  Thief  as examples.  The red army in Interesting Times alludes to the game  Lemmings , and when asked about this connection, Pratchett stated Merely because the red army can fight, dig, march and climb and is controlled by little icons? Cant imagine how anyone thought that... Not only did I wipe Lemmings from my hard disk, I overwrote it so I couldnt get it back.  Additionally, he played  Oblivion , which he described as wonderful , and used many of its non-combat-oriented, fan-made mods.  Pratchett wrote dialogue for a mod for Oblivion which added a Nord companion named Vilja. He also worked on a similar ": null
    },
    {
        "mod": "Skyrim Mods"
    },
    {
        " for  Skyrim  which featured Viljas great-great-granddaughter .       He is said to have enjoyed playing the first  Tomb Raider  game.        Pratchett had a fascination with ": null
    },
    {
        "natural history": "Natural History"
    },
    {
        " that he referred to many times, and he owned a greenhouse full of ": null
    },
    {
        "carnivorous plant": "Carnivorous Plant"
    },
    {
        "s.  He described them in the biographical notes on the dust jackets of some of his books, and elsewhere Alt.Fan.Pratchett FAQ|  seen November 2019 , as not as interesting as people think .  . By Carpe Jugulum the account had become that he used to, but the plants had taken over the greenhouse, and he avoided going in. Biographical note, inside rear dustcover flap, Carpe jugulum       In 1995, a ": null
    },
    {
        "fossil": "Fossil"
    },
    {
        " sea-turtle": "Turtle"
    },
    {
        " from the ": null
    },
    {
        "Eocene": "Eocene"
    },
    {
        " epoch of ": null
    },
    {
        "New Zealand": "New Zealand"
    },
    {
        " was named  Psephophorus terrypratchetti  in his honour by the palaeontologist Richard Köhler.      In 2016, Pratchett fans petitioned the ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "International Union Of Pure And Applied Chemistry"
    },
    {
        " to name ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " 117, ": null
    },
    {
        "temporarily called": "Placeholder Name"
    },
    {
        " ununseptium, as octarine with the proposed symbol Oc .  The final name chosen for element 117 was  tennessine  with the symbol Ts.        Pratchett was a trustee for the ": null
    },
    {
        "Orangutan Foundation UK": "Orangutan Foundation International"
    },
    {
        "  but was pessimistic about the animals future. His activities included visiting ": null
    },
    {
        "Borneo": "Borneo"
    },
    {
        " with a ": null
    },
    {
        "Channel 4": "Channel 4"
    },
    {
        " film crew to make an episode of Jungle Quest in 1995, seeing orangutans in their natural habitat.  Following Pratchetts lead, fan events such as the Discworld Conventions have adopted the Orangutan Foundation as their nominated charity, which has been acknowledged by the foundation.  One of Pratchetts most popular fictional characters, ": null
    },
    {
        "the Librarian": "The Librarian"
    },
    {
        " of the ": null
    },
    {
        "Unseen Universitys": "Unseen University"
    },
    {
        "Library, is a wizard who was transformed into an orangutan in a magical accident and decides to remain in that condition as it is so convenient for his work.       Pratchett had an observatory in his back garden and was a keen astronomer from childhood. He made an appearance on the BBC programme  The Sky at Night .          Pratchett sponsored a ": null
    },
    {
        "biennial": "Wikt:Biennial"
    },
    {
        " award for unpublished science fiction novelists, the ": null
    },
    {
        "Terry Pratchett First Novel Award": "Terry Pratchett First Novel Award"
    },
    {
        ". The prize is a publishing contract with his publishers ": null
    },
    {
        "Transworld": "Transworld Publishers"
    },
    {
        ".  In 2011 the award was won jointly by David Logan for Half Sick of Shadows and Michael Logan for Apocalypse Cow.  In 2013 the award was won by Alexander Maskill for The Hive.        In 2015, Pratchetts estate announced an in-perpetuity endowment to the ": null
    },
    {
        "University of South Australia": "University Of South Australia"
    },
    {
        ".  The Sir Terry Pratchett Memorial Scholarship supports a Masters scholarship at the Universitys Hawke Research Institute.                 Pratchett received a ": null
    },
    {
        "knighthood": "Knight Bachelor"
    },
    {
        " for services to literature in the 2009 UK New Year Honours list.  He was previously appointed ": null
    },
    {
        "Officer of the Order of the British Empire": "Officer Of The Order Of The British Empire"
    },
    {
        ", also for services to literature , in 1998. Following this, Pratchett commented in the ": null
    },
    {
        "Ansible": "David Langford"
    },
    {
        " SF/fan newsletter, I suspect the services to literature consisted of refraining from trying to write any, but added, Still, I cannot help feeling mightily chuffed about it.      Pratchett was the ": null
    },
    {
        "British Book Awards": "British Book Awards"
    },
    {
        " Fantasy and Science Fiction Author of the Year for 1994.      Pratchett won the British Science Fiction Award in 1989 for his novel, Pyramids,  and a ": null
    },
    {
        "Locus Award": "Locus Award"
    },
    {
        " for Best Fantasy Novel in 2008 for Making Money.      Pratchett was awarded ten ": null
    },
    {
        "honorary doctorates": "Honorary Degree"
    },
    {
        "University of Warwick": "University Of Warwick"
    },
    {
        " in 1999,  the ": null
    },
    {
        "University of Portsmouth": "University Of Portsmouth"
    },
    {
        " in 2001,  the ": null
    },
    {
        "University of Bath": "University Of Bath"
    },
    {
        " in 2003,  the ": null
    },
    {
        "University of Bristol": "University Of Bristol"
    },
    {
        " in 2004,  ": null
    },
    {
        "Buckinghamshire New University": "Buckinghamshire New University"
    },
    {
        " in 2008,  the ": null
    },
    {
        "University of Dublin": "University Of Dublin"
    },
    {
        " in 2008,  ": null
    },
    {
        "Bradford University": "Bradford University"
    },
    {
        " in 2009,  ": null
    },
    {
        "University of Winchester": "University Of Winchester"
    },
    {
        " in 2009,  The ": null
    },
    {
        "Open University": "Open University"
    },
    {
        " in 2013  for his contribution to Public Service and his last, from the ": null
    },
    {
        "University of South Australia": "University Of South Australia"
    },
    {
        ", in May 2014.      Pratchett won the 2001 ": null
    },
    {
        "Carnegie Medal": "Carnegie Medal"
    },
    {
        " from the ": null
    },
    {
        "British librarians": "Cilip"
    },
    {
        ", recognising  The Amazing Maurice and His Educated Rodents  as the years best childrens book published in the UK.      Night Watch  won the 2003 ": null
    },
    {
        "Prometheus Award": "Prometheus Award"
    },
    {
        " for best libertarian novel.      In 2003, ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " conducted ": null
    },
    {
        "The Big Read": "The Big Read"
    },
    {
        " to identify the Nations Best-loved Novel and finally published a ranked list of the Top 200 . Pratchetts highest-ranking novel was Mort, number 65, but he and ": null
    },
    {
        "Charles Dickens": "Charles Dickens"
    },
    {
        " were the only authors with five in the Top 100 . He also led all authors with fifteen novels in the Top 200.      Three of the five Discworld novels that centre on the trainee witch ": null
    },
    {
        "Tiffany Aching": "Tiffany Aching"
    },
    {
        " won the annual ": null
    },
    {
        "Locus Award for Best Young Adult Book": "Locus Award For Best Young Adult Book"
    },
    {
        " in 2004, 2005 and 2007.      In 2005, Going Postal was shortlisted for the ": null
    },
    {
        "Hugo Award for Best Novel": "Hugo Award For Best Novel"
    },
    {
        "; however, Pratchett recused himself, stating that stress over the award would mar his enjoyment of ": null
    },
    {
        "Worldcon": "Worldcon"
    },
    {
        ".  by ": null
    },
    {
        "Dave Langford": "Dave Langford"
    },
    {
        "; published September 2005; retrieved 16 March 2014 , by Nicholas Whyte; at NicholasWhyte.info; published 5 June 2005     Pratchett received the ": null
    },
    {
        "NESFA": "New England Science Fiction Association"
    },
    {
        " Skylark Award": "Edward E. Smith Memorial Award"
    },
    {
        " in 2009  and the ": null
    },
    {
        "World Fantasy Award for Life Achievement": "World Fantasy Award For Life Achievement"
    },
    {
        " in 2010.  In 2011 he won ": null
    },
    {
        "Margaret A. Edwards Award": "Margaret A. Edwards Award"
    },
    {
        " from the ": null
    },
    {
        "American Library Association": "American Library Association"
    },
    {
        ", a lifetime honour for significant and lasting contribution to young adult literature .  The librarians cited nine Discworld novels published from 1983 to 2004 and observed that Pratchetts tales of Discworld have won over generations of teen readers with intelligence, heart, and undeniable wit. Comic adventures that fondly mock the fantasy genre, the Discworld novels expose the hypocrisies of contemporary society in an intricate, ever-expanding universe. With satisfyingly multilayered plots, Pratchetts humor honors the intelligence of the reader. Teens eagerly lose themselves in a universe with no maps.     He was made an adjunct Professor in the School of English at ": null
    },
    {
        "Trinity College Dublin": "Trinity College Dublin"
    },
    {
        " in 2010, with a role in postgraduate education in creative writing and popular literature.       I Shall Wear Midnight   won the 2010 ": null
    },
    {
        "Andre Norton Award": "Andre Norton Award"
    },
    {
        " for Young Adult Science Fiction and Fantasy presented by the ": null
    },
    {
        "Science Fiction and Fantasy Writers of America": "Science Fiction And Fantasy Writers Of America"
    },
    {
        " as a part of the ": null
    },
    {
        "Nebula Award": "Nebula Award"
    },
    {
        " ceremony. In 2016, SFWA announced that Sir Terry would be the recipient of the Kate Wilhelm Solstice Award, presented at the 2016 SFWA Nebula Conference.        Pratchetts Discworld novels have led to dedicated conventions, the first in Manchester in 1996,  then worldwide,  often with the author as guest of honour.  Publication of a new novel was sometimes accompanied by an international book signing tour;  queues were known to stretch outside the bookshop as the author continued to sign books well after the intended finishing time. His fans were not restricted by age or gender, and he received a large amount of fan mail from them. Pratchett enjoyed meeting fans and hearing what they think about his books, saying that since he was well paid for his novels, his fans were everything to him.        Pratchett said that to write, you must read extensively, both inside and outside your chosen genre  and to the point of overflow . He advised that writing is hard work, and that writers must make grammar, punctuation and spelling a part of your life. However, Pratchett enjoyed writing, regarding its monetary rewards as an unavoidable consequence , rather than the reason for writing.        Although during his early career he wrote for the sci-fi and horror genres, Pratchett later focused almost entirely on fantasy, and said: It is easier to bend the universe around the story.  In the acceptance speech for his Carnegie Medal he said: Fantasy isnt just about wizards and silly wands. Its about seeing the world from new directions , pointing to J. K. Rowlings  Harry Potter  novels and J. R. R. Tolkiens  The Lord of the Rings . In the same speech, he acknowledged benefits of these works for the genre.      Pratchett believed he owed a debt to the science fiction/fantasy genre which he grew up out of and disliked the term ": null
    },
    {
        "magical realism": "Magical Realism"
    },
    {
        " which, he said, is like a polite way of saying you write fantasy and is more acceptable to certain people ... who, on the whole, do not care that much.  He expressed annoyance that fantasy is unregarded as a literary form , arguing that it is the oldest form of fiction ; he described himself as infuriated when novels containing science fiction or fantasy ideas were not regarded as part of those genres. He debated this issue with novelist ": null
    },
    {
        "A. S. Byatt": "A. S. Byatt"
    },
    {
        " and critic ": null
    },
    {
        "Terry Eagleton": "Terry Eagleton"
    },
    {
        ", arguing that fantasy is fundamental to the way we understand the world and therefore an integral aspect of all fiction.      On 31 July 2005, Pratchett criticised media coverage of Harry Potter author ": null
    },
    {
        "J. K. Rowling": "J. K. Rowling"
    },
    {
        ", commenting that certain members of the media seemed to think that the continued elevation of J. K. Rowling can be achieved only at the expense of other writers .  Pratchett later denied claims that this was a swipe at Rowling, and said that he was not making claims of plagiarism, but was pointing out the shared heritage of the fantasy genre.  Pratchett also posted on the Harry Potter ": null
    },
    {
        "newsgroup": "Newsgroup"
    },
    {
        " about a media-covered exchange of views with her.        Pratchett is known for a distinctive writing style that included a number of characteristic hallmarks. One example is his use of ": null
    },
    {
        "footnote": "Footnote"
    },
    {
        "s, ": null
    }
]