[
    {
        "      The service sector is the third of the three ": null
    },
    {
        "economic sectors": "Economic Sector"
    },
    {
        " of the ": null
    },
    {
        "three-sector theory": "Three-Sector Theory"
    },
    {
        ". The others are the ": null
    },
    {
        "secondary sector": "Secondary Sector"
    },
    {
        " , and the ": null
    },
    {
        "primary sector": "Primary Sector"
    },
    {
        " .     The service sector consists of the production of ": null
    },
    {
        "services": "Service"
    },
    {
        " instead of ": null
    },
    {
        "end products": "Product"
    },
    {
        ". Services include attention, advice, access, experience, and ": null
    },
    {
        "affective labor": "Affective Labor"
    },
    {
        ". The ": null
    },
    {
        "production of information": "Information Economy"
    },
    {
        " has long been regarded as a service, but some economists now attribute it to a fourth sector, the ": null
    },
    {
        "quaternary sector": "Quaternary Sector"
    },
    {
        ".     The tertiary sector of industry involves the provision of services to other businesses as well as final consumers. Services may involve the ": null
    },
    {
        "transport": "Transport"
    },
    {
        ", ": null
    },
    {
        "distribution": "Distribution"
    },
    {
        " and sale of goods from producer to a consumer, as may happen in ": null
    },
    {
        "wholesaling": "Wholesaler"
    },
    {
        " and ": null
    },
    {
        "retailing": "Retailer"
    },
    {
        ", ": null
    },
    {
        "pest control": "Pest Control"
    },
    {
        " or ": null
    },
    {
        "entertainment": "Entertainment"
    },
    {
        ". The goods may be transformed in the process of providing the service, as happens in the ": null
    },
    {
        "restaurant": "Restaurant"
    },
    {
        " industry. However, the focus is on people interacting with people and serving the customer rather than transforming physical goods.                    It is sometimes hard to define whether a given company is part and parcel of the secondary or tertiary sector. And it is not only companies that have been classified as part of that sector in some schemes; government and its services such as police or military, and non-profit organizations such as charities or research associations can also be seen as part of that sector.      In order to classify a business as a service, one can use classification systems such as the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " International Standard Industrial Classification": "International Standard Industrial Classification"
    },
    {
        " standard, the ": null
    },
    {
        "United States": "United States"
    },
    {
        " Standard Industrial Classification": "Standard Industrial Classification"
    },
    {
        " code system and its new replacement, the ": null
    },
    {
        "North American Industrial Classification System": "North American Industrial Classification System"
    },
    {
        " , the ": null
    },
    {
        "Statistical Classification of Economic Activities in the European Community": "Statistical Classification Of Economic Activities In The European Community"
    },
    {
        " in the EU and similar systems elsewhere. These governmental classification systems have a first-level hierarchy that reflects whether the economic goods are tangible or intangible.     For purposes of ": null
    },
    {
        "finance": "Finance"
    },
    {
        " and ": null
    },
    {
        "market research": "Market Research"
    },
    {
        ", ": null
    },
    {
        "market": "Market"
    },
    {
        "-based classification systems such as the ": null
    },
    {
        "Global Industry Classification Standard": "Global Industry Classification Standard"
    },
    {
        " and the ": null
    },
    {
        "Industry Classification Benchmark": "Industry Classification Benchmark"
    },
    {
        " are used to classify businesses that participate in the service sector. Unlike governmental classification systems, the first level of market-based classification systems divides the economy into functionally related markets or industries. The second or third level of these hierarchies then reflects whether goods or services are produced.       For the last 100 years, there has been a substantial shift from the primary and secondary sectors to the tertiary sector in industrialized countries. This shift is called tertiarisation.   The tertiary sector is now the largest sector of the economy in the ": null
    },
    {
        "Western world": "Western World"
    },
    {
        ", and is also the fastest-growing sector.   In examining the growth of the service sector in the early Nineties, the ": null
    },
    {
        "globalist": "Globalism"
    },
    {
        " Kenichi Ohmae": "Kenichi Ohmae"
    },
    {
        " noted that:   : In the United States 70 percent of the workforce works in the service sector; in Japan, 60 percent, and in Taiwan, 50 percent. These are not necessarily busboys and live-in maids. Many of them are in the professional category. They are earning as much as manufacturing workers, and often more.” The Borderless World: Power and Strategy in the Interlinked Economy.     Economies tend to follow a developmental progression that takes them from a heavy reliance on agriculture and mining, toward the development of ": null
    },
    {
        "manufacturing": "Manufacturing"
    },
    {
        " and finally toward a more service-based structure. The first economy to follow this path in the modern world was the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        ". The speed at which other economies have made the transition to service-based  economies has increased over time.     Historically, manufacturing tended to be more open to ": null
    },
    {
        "international trade": "International Trade"
    },
    {
        " and competition than services. However, with dramatic cost reduction and speed and reliability improvements in the transportation of people and the communication of information, the service sector now includes some of the most intensive international competition, despite residual ": null
    },
    {
        "protectionism": "Protectionism"
    },
    {
        ".                Service providers face obstacles selling services that goods-sellers rarely face. Services are intangible, making it difficult for potential customers to understand what they will receive and what value it will hold for them. Indeed, some, such as ": null
    },
    {
        "consultants": "Consultants"
    },
    {
        " and providers of ": null
    },
    {
        "investment": "Investment"
    },
    {
        " services, offer no guarantees of the value for price paid.     Since the quality of most services depends largely on the quality of the individuals providing the services, people costs are usually a high fraction of service costs. Whereas a manufacturer may use technology, simplification, and other techniques to lower the cost of goods sold, the service provider often faces an unrelenting pattern of increasing costs.     ": null
    },
    {
        "Product differentiation": "Product Differentiation"
    },
    {
        " is often difficult. For example, how does one choose one ": null
    },
    {
        "investment adviser": "Investment Adviser"
    },
    {
        " over another, since they are often seen to provide identical services? Charging a premium for services is usually an option only for the most established firms, who charge extra based upon ": null
    },
    {
        "brand recognition": "Brand Recognition"
    },
    {
        ".          Examples of tertiary industries may include:     ": null
    },
    {
        "Telecommunication": "Telecommunication"
    },
    {
        " Hospitality industry": "Hospitality Industry"
    },
    {
        "/": null
    },
    {
        "tourism": "Tourism"
    },
    {
        " Mass media": "Mass Media"
    },
    {
        " Healthcare": "Healthcare"
    },
    {
        "/hospitals   ": null
    },
    {
        "Public health": "Public Health"
    },
    {
        " Pharmacy": "Pharmacy"
    },
    {
        " Information technology": "Information Technology"
    },
    {
        " Waste disposal": "Waste Disposal"
    },
    {
        " Consulting": "Consulting"
    },
    {
        " Gambling": "Gambling"
    },
    {
        " Retail": "Retail"
    },
    {
        " sales   ": null
    },
    {
        "Fast-moving consumer goods": "Fast-Moving Consumer Goods"
    },
    {
        "   Franchising": "Franchising"
    },
    {
        " Real estate": "Real Estate"
    },
    {
        " Education": "Education"
    },
    {
        " Financial services": "Financial Services"
    },
    {
        " Banking": "Banking"
    },
    {
        " Insurance": "Insurance"
    },
    {
        " Investment management": "Investment Management"
    },
    {
        " Professional services": "Professional Services"
    },
    {
        " Accounting": "Accounting"
    },
    {
        " Legal services": "Legal Services"
    },
    {
        " Management consulting": "Management Consulting"
    },
    {
        " Transportation": "Transportation"
    },
    {
        "               Below is a list of countries by service output at market exchange rates in 2016.   ": null
    }
]