[
    {
        "            The Doctor, an Emergency Medical Hologram Mark I , is a fictional character from the television series  Star Trek: Voyager , played by actor ": null
    },
    {
        "Robert Picardo": "Robert Picardo"
    },
    {
        ". In the show, he is an ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        " manifesting as a ": null
    },
    {
        "holographic projection": "Holography In Fiction"
    },
    {
        ", designed to act as a short-term supplement to the medical staff of a starship during emergency situations; however when the starship  Voyager  is stranded on the far side of the galaxy with no medical personnel, he is forced to act as the ships chief medical officer for a period of several years. In the style of the Star Trek franchises exploration of artificial intelligence, a simple software program becomes a major character for the television show, which aired on ": null
    },
    {
        "UPN": "Upn"
    },
    {
        " between 1995 and 2001.     The character also appeared in  Star Trek: First Contact , as well as the now-closed ": null
    },
    {
        "Star Trek: The Experience": "Star Trek: The Experience"
    },
    {
        " amusement exhibition at the ": null
    },
    {
        "Las Vegas Hilton": "Las Vegas Hilton"
    },
    {
        ".       The Doctor began his service on the ": null
    },
    {
        "USS Voyager": "Uss Voyager"
    },
    {
        " as the standard Emergency Medical ": null
    },
    {
        "Hologram": "Hologram"
    },
    {
        " built into almost every newer ": null
    },
    {
        "Starfleet": "Starfleet"
    },
    {
        " ships ": null
    },
    {
        "sickbay": "Sickbay"
    },
    {
        ". The EMH is for use should the ships doctor be incapacitated. In the series first episode, Voyagers chief medical officer, along with his nurse, are killed, necessitating extended use of the EMH. The EMH eventually developed his own personality, although he generally maintained his acerbic wit and irritating version one bedside manner. As he was originally intended as a temporary medical backup system, not as a ": null
    },
    {
        "digital life form": "Digital Life Form"
    },
    {
        ", Voyagers journey strains his programming to some limits. The Doctor becomes the chief medical officer, with ": null
    },
    {
        "Kes": "Kes"
    },
    {
        " and ": null
    },
    {
        "Tom Paris": "Tom Paris"
    },
    {
        " at various times acting as nurses.     Attempting to develop a realistic personality, the Doctor not only manufactured a holographic family,  he also had an increasing number of other human experiences. This resulted in the Doctors program evolving to become more lifelike, with emotions and ambitions. He developed meaningful and complex ": null
    },
    {
        "relationships": "Interpersonal Relationship"
    },
    {
        " with many members of the ships crew. The Doctor also developed talents as a ": null
    },
    {
        "playwright": "Playwright"
    },
    {
        ", artist, and photographer, and even became a ": null
    },
    {
        "connoisseur": "Connoisseur"
    },
    {
        " of ": null
    },
    {
        "opera": "Opera"
    },
    {
        ". He has had multiple other experiences with family , including having had a son with a roommate while trapped on a planet for three years. During the episode Blink of an Eye , he asked an associate to inquire further on his progeny.      A recurring theme was the ethical aspects of an artificial, yet apparently sentient, being. In the episode ": null
    },
    {
        "Latent Image": "Latent Image"
    },
    {
        " , treating two patients with an equal chance of survival, with only enough time to treat one, The Doctor chose Harry Kim, a friend. The other patient, Ensign Jetal, died. The Doctor was overwhelmed with guilt, believing that his friendship influenced his choice. When the stress nearly led to his program breaking down, Captain Janeway had his memories of these events deleted. When The Doctor later discovered clues as to what had happened, Captain Janeway was convinced by him and others that he had a right to learn to come to grips with the guilt in the manner of any other sentient being rather than be treated merely as a defective piece of equipment.      The Doctor submitted a holonovel titled Photons Be Free to a publisher on Earth, detailing the manner in which holograms were sometimes treated by Starfleet. His characters were closely based on Voyagers crew, but exaggerated to appear more intense and vicious, creating fears among the crew their reputations would be ruined. ": null
    },
    {
        "Tom Paris": "Tom Paris"
    },
    {
        " convinced The Doctor to make adjustments without sacrificing his theme. The Doctor lacked legal rights as ": null
    },
    {
        "Federation": "United Federation Of Planets"
    },
    {
        " law did not classify him as a sentient being . Thus he was forbidden to make any subsequent changes to the holonovel. ": null
    },
    {
        "Captain Janeways": "Kathryn Janeway"
    },
    {
        " efforts resulted in The Doctor being accorded the status of artist , . This permitted him to rewrite the novel. Four months later, it was known throughout the ": null
    },
    {
        "Alpha Quadrant": "Alpha Quadrant"
    },
    {
        " as a very thought-provoking piece of work. Several other EMHs, now relegated to mining duty, experienced the novel.        The Doctors standard greeting was Please state the nature of the medical emergency when activated, though later modified to say whatever he chose. He was later given the ability to activate and deactivate himself.      The Doctor later acquired a mobile holographic emitter from the 29th century.  Although he had previously been confined to ": null
    },
    {
        "Sickbay": "Sickbay"
    },
    {
        " or the ": null
    },
    {
        "Holodeck": "Holodeck"
    },
    {
        ", the mobile emitter allowed The Doctor to move about freely, making him ideal for missions where the environment would be harmful or otherwise fatal to the crew. In one notable incident, when an away team was trapped on a radioactive planet, The Doctor was able to infiltrate the people and almost single-handedly rescue the team because, as he pointed out, being a hologram renders him immune to the radiation, stating that being a hologram does have its advantages.     The Doctors programming evolved from his first romance, Dr. Denara Pel, to the point where he fell in love with ": null
    },
    {
        "Seven of Nine": "Seven Of Nine"
    },
    {
        ", though she did not reciprocate. In an alternate future episode, ": null
    },
    {
        "Endgame": "Endgame"
    },
    {
        " , The Doctor finally adopts a name and marries a human female named Lana.     In the final episode of Star Trek: Voyager, a future version of Janeway also informs him of his later invention of a device known as a synaptic transceiver, something that fascinates The Doctor; hes cut off by the present Janeway, who is abiding by the Temporal Prime Directive, before he can learn more.       The Emergency Command Hologram , aka ECH , is first coined by The Doctor in the episode ": null
    },
    {
        "Tinker, Tenor, Doctor, Spy": "Tinker, Tenor, Doctor, Spy"
    },
    {
        " , in which he creates a program which allows him to ": null
    },
    {
        "daydream": "Daydream"
    },
    {
        ".     In these grandiose daydreams, The Doctor adds routines which allow him to take command of Voyager in the event of the command crew being disabled.     A dramatic morph transformation occurs changing his uniform from medical blue to command red, his rank pips subsequently appearing. The daydreams are picked up by a ": null
    },
    {
        "Hierarchy": "Hierarchy"
    },
    {
        " vessel in a nearby ": null
    },
    {
        "nebula": "Nebula"
    },
    {
        " and believed to be real events.     Once the crew discover that The Doctor is daydreaming they use the holodeck to view his dreams, including the one expressing his desire to be an Emergency Command Hologram. ": null
    },
    {
        "Captain Janeway": "Kathryn Janeway"
    },
    {
        " promises to consider his proposal.     The Doctor soon gets the opportunity to live out his daydreams as, with the assistance of the crew, he pretends to be in charge to neutralize a war fleet.     The ECH made its debut the following season in ": null
    },
    {
        "Workforce": "Workforce"
    },
    {
        " , in which after an incident with a subspace mine that releases a great amount of ": null
    },
    {
        "tetryon": "Tetryon"
    },
    {
        " radiation, the crew is forced to abandon ship. To keep the ship moving The Doctor takes over the command functions.     In the episode ": null
    },
    {
        "Renaissance Man": "Renaissance Man"
    },
    {
        " , against the wishes of the crew, The Doctor uses his ECH program to eject the ": null
    },
    {
        "warp core": "Warp Core"
    },
    {
        ".       The Doctors program required a custom-built photonic processor, and Starfleet outfitted Voyager with only two. This hardware itself also could not be replicated, hence the Doctor could not be easily backed up, restored, or copied.     Voyagers computers could not help run his photonic program, and could not contain a usable backup of its image. The Doctors entire program used 50 million gigaquads - episodes Lifesigns and The Swarm mention these limitations. The episode Living Witness depicts a future Delta Quadrant civilization building a museum around Voyager artifacts, including its redundant EMH photonic processor.       A recurring theme in the Doctors life was his lack of a proper name. Starfleet did not assign a name to him, and initially the Doctor claimed that he did not want one until the episode “ Eye of the Needle ”, when he asks Kes to give him a name. He later adopted such names as Schweitzer , Shmullus , Van Gogh, Kenneth, Jones and several others. His friends suggest the famous historical Earth doctors Galen and Spock . The captioned dialog of early episodes, and early promotional material for the series premiere, referred to him as Dr. Zimmerman, after his creator Lewis Zimmerman . The Doctor is ultimately referred to as simply The Doctor and addressed as Doctor , which he answers to without concern, and the issue of the Doctors name virtually disappears over the course of the series. However, in the series finale , in an alternate future timeline the Doctor has finally chosen the name Joe after his new wifes grandfather .       Before the arrival of the mobile emitter, The Doctors holo-program was confined to sickbay, holodecks, and other areas equipped with holographic systems.     Depending on the availability of suitable holographic patterns and the capacity of his pattern buffers, The Doctor can alter his appearance.     The Doctor is also able to download his program and personality subroutines into a humanoid with Borg implants, indirectly possessing that individual and gaining control over its host ’s body. Such was the case when he was forced to hide within the body of Seven of Nine .       The EMH is a holographic computer program designed to treat patients during emergency situations, or when the regular medical staff is unavailable or incapacitated. EMHs are a standard feature onboard all Starfleet ships, but they are there only to supplement the living medical crew, not replace it. Programmed with all current Starfleet medical knowledge, The Doctor and all Mark I programs are equipped with the knowledge and mannerisms of historic Federation doctors, as well as the physical appearance of their programmer Dr. Lewis Zimmerman. Zimmerman, along with the EMH, appeared in the ": null
    },
    {
        "Star Trek: Deep Space Nine": "Star Trek: Deep Space Nine"
    },
    {
        " episode Doctor Bashir, I Presume? , in which the former was in the process of trying to upgrade Starfleets EMH programs to LMH, i.e. Long-term Medical Hologram, status.     There has been only one update to the Mark I seen on screen, the Mark II played by Andy Dick in the episode Message in a Bottle , which supposedly had a better bedside manner than the Mark I, as well as possibly some updated medical information. However, later episodes mention that further versions of the EMH exist.     Enterprise-E EMH": null
    },
    {
        "Star Trek: First Contact": "Star Trek: First Contact"
    },
    {
        ", where he played the emergency medical hologram of the USS Enterprise-E . Doctor Beverly Crusher activates him, albeit reluctantly, as a means of distracting the Borg while she and other crew members escape from the besieged sickbay. He replies, Im a doctor, not a doorstop , an homage to Doctor McCoy s catchphrase line Im a doctor, not a ...  Nevertheless, when the Borg do break in, he does attempt to distract them by noting that Borg implants can cause skin irritation and offering to prescribe an analgesic cream. Although the Borg would be unable to harm or assimilate him, he still appears intimidated as they advance upon him. Another EMH appeared in the ": null
    },
    {
        "Star Trek: Deep Space Nine": "Star Trek: Deep Space Nine"
    },
    {
        " episode Doctor Bashir I Presume .     His reference to an analgesic cream in this scene was reprised in the PC video game ": null
    },
    {
        "Star Trek Voyager: Elite Force": "Star Trek Voyager: Elite Force"
    },
    {
        ".       Picardo initially auditioned for Neelix . Despite Ethan Phillips getting the part, Picardo was asked by the producers to come back and audition for The Doctor — something that shocked him, because usually actors would be passed over completely. During his audition for the role of The Doctor, Picardo was asked only to say, Somebody forgot to terminate my program. However, he then ad lib bed, Im a doctor, not a nightlight!       In 2018, The Wrap ranked Voyagers EMH as the 22nd best character of Star Trek overall, noting the character as a sarcastic, overworked hologram , one that also had time for jokes and helping fellow crewmates. In 2016, ": null
    },
    {
        "Wired": "Wired"
    },
    {
        " magazine ranked the character as the 16th most important character in service to Starfleet within the Star Trek": null
    }
]