[
    {
        "     Transport in Thailand is varied and chaotic, with no one dominant means of transport. For long distance travel, bus transport dominates. Low-speed ": null
    },
    {
        "rail travel": "List Of Railway Lines In Thailand"
    },
    {
        " has long been a rural long-distance transport mechanism, though plans are underway to expand services with ": null
    },
    {
        "high-speed rail lines": "Rail Transport In Thailandproposed High Speed Routes"
    },
    {
        " extending to several major regions of Thailand. Road transportation is the primary form of freight transport across the country.     For short trips motorbikes are common. There are public ": null
    },
    {
        "motorcycle taxis": "Motorcycle Taxi"
    },
    {
        "in Bangkok, Pattaya, and other large cities. An overwhelming number of taxis can also be found in Bangkok. Since the countrys ": null
    },
    {
        "first rapid rail transit line": "Bts Skytrainstations And Lines"
    },
    {
        " opened in 1999 in Bangkok, daily ridership on Bangkoks various transit lines has risen to over 800,000, with multiple additional lines either under construction or being proposed.     Private automobiles, whose rapid growth contributed to Bangkoks notorious traffic congestion over the past two decades, have risen in popularity, especially among tourists, expats, the upper class, and the growing middle class. ": null
    },
    {
        "A motorway network across Thailand": "Thai Motorway Network"
    },
    {
        " has been gradually implemented, with motorways completed in Bangkok and most of central Thailand.     Domestic air transport, which had been dominated by a select few air carriers, saw a surge in popularity since 2010 due in large part to the expanding services of low-cost carriers such as ": null
    },
    {
        "Thai Air Asia": "Thai Airasia"
    },
    {
        " and ": null
    },
    {
        "Nok Air": "Nok Air"
    },
    {
        ".     Areas with navigable waterways often have boats or boat service, and many innovative means of transport exist such as ": null
    },
    {
        "tuk-tuk": "Tuk-Tuk"
    },
    {
        ", ": null
    },
    {
        "vanpool": "Vanpool"
    },
    {
        ", ": null
    },
    {
        "songthaew": "Songthaew"
    },
    {
        ", and even elephants in rural areas.                  The ": null
    },
    {
        "State Railway of Thailand": "State Railway Of Thailand"
    },
    {
        " operates all of Thailands national rail lines. ": null
    },
    {
        "Bangkok Railway Station": "Bangkok Railway Station"
    },
    {
        " is the main terminus of all routes. Phahonyothin and ICD ": null
    },
    {
        "Lat Krabang": "Lat Krabang"
    },
    {
        " are the main freight terminals.      SRT had  of track, all of it ": null
    },
    {
        "meter gauge": "Meter Gauge"
    },
    {
        " except the Airport Link. Nearly all is single-track , although some important sections around Bangkok are double  or triple-tracked  and there are plans to extend this.  By comparison, Thailand has 390,000  km of highways.      The SRT has long been perceived by the public as inefficient and resistant to change. Trains are usually late, and most of its equipment is old and poorly maintained. The worst financially performing state enterprise, the SRT consistently operates at a loss despite being endowed with large amounts of property and receiving large government budgets; it reported a preliminary loss of 7.58 billion baht in 2010.  Recurring government attempts at restructuring and/or privatization throughout the 2000s have always been strongly opposed by the union and have not made any progress.       There are two active rail links to adjacent countries. The line to ": null
    },
    {
        "Malaysia": "Rail Transport In Malaysia"
    },
    {
        " uses the same  gauge, as does the line to Laos across the ": null
    },
    {
        "Mekong": "Mekong"
    },
    {
        " River on the ": null
    },
    {
        "Thai-Lao Friendship Bridge": "Thai-Lao Friendship Bridge"
    },
    {
        ". The line to ": null
    },
    {
        "Cambodia": "Rail Transport In Cambodia"
    },
    {
        " is currently disused and is being rebuilt, while the line to ": null
    },
    {
        "Myanmar": "Rail Transport In Burma"
    },
    {
        " is defunct . A projected extension will rebuild the route  and in 2011 a link was also proposed from ": null
    },
    {
        "Kanchanaburi": "Kanchanaburi"
    },
    {
        " to Port ": null
    },
    {
        "Dawei": "Dawei"
    },
    {
        ".     ": null
    },
    {
        "Rail transport in Bangkok": "Rail Transport In Bangkok"
    },
    {
        " includes long-distance services, and some daily commuter trains running from and to the outskirts of the city during the rush hour, but passenger numbers have remained low. There are also three rapid transit rail systems in the capital.                      Bangkok is served by three rail rapid transit systems:   ": null
    },
    {
        "MRT": "Mrt"
    },
    {
        ", with two lines.   ": null
    },
    {
        "Bangkok Skytrain": "Bangkok Skytrain"
    },
    {
        " or BTS, with two lines.   ": null
    },
    {
        "Suvarnabhumi Airport Link": "Suvarnabhumi Airport Link"
    },
    {
        " or ARL, with one line.          In March 2016, the Thai government approved the first ": null
    },
    {
        "LRT": "Light Rail"
    },
    {
        " project in ": null
    },
    {
        "Khon Kaen": "Khon Kaen"
    },
    {
        " province, to be built by the private sector. The first phase of the project will be a 26  km North-South route. Previously, this corridor was intended to be served by a ": null
    },
    {
        "bus rapid transit": "Bus Rapid Transit"
    },
    {
        " route. The Office of Transport and Traffic Policy will fund an 8-month project study for ": null
    },
    {
        "Khon Kaen University": "Khon Kaen University"
    },
    {
        " with 38 million baht. The Khon-Kaenpattanmong or Khon Kaen Think Tank, a private company, will be the main investor in the project and responsible for the operation of the network. The project is expected to begin construction in 2017 for completion within 1–2 years. The Phase 1 budget is estimated at 1.5 billion baht.        Several other rapid transit systems have been proposed but have not been approved ": null
    },
    {
        "Chiang Mai monorail": "Chiang Mai Monorail"
    },
    {
        ", ": null
    },
    {
        "Pattaya LRT": "Pattaya Light Rail Transit"
    },
    {
        ", ": null
    },
    {
        "Phuket LRT": "Phuke Light Rail Transit"
    },
    {
        " and ": null
    },
    {
        "Hat Yai monorail": "Hat Yai Monorail"
    },
    {
        ".       Thailand has 390,000  km of highways. According to the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        ", Thailand has 462,133 roads and many multi-lane highways.  Thailand had 37 million registered vehicles, 20 million of them two or three-wheeled motorbikes, and millions more that are unregistered.  It also had one million heavy trucks , 158,000 buses, and 624,000 other vehicles.   By mid-2019 the number of registered vehicles in Thailand had risen to 40,190,328. The majority—21,051,977—are motorbikes. Private automobiles with up to seven seats numbered 9,713,980.             According to the ": null
    },
    {
        "World Health Organization": "World Health Organization"
    },
    {
        "s, Global Status Report on Road Safety 2018, Thailand had an estimated traffic fatality rate of 32.7 persons per 100,000 population in 2016. The only nations exceeding Thailands death toll were ": null
    },
    {
        "Liberia": "Liberia"
    },
    {
        "; ": null
    },
    {
        "Saint Lucia": "Saint Lucia"
    },
    {
        " ; ": null
    },
    {
        "Burundi": "Burundi"
    },
    {
        "; ": null
    },
    {
        "Zimbabwe": "Zimbabwe"
    },
    {
        "; ": null
    },
    {
        "Dominican Republic": "Dominican Republic"
    },
    {
        "; ": null
    },
    {
        "Democratic Republic of Congo": "Democratic Republic Of Congo"
    },
    {
        "; ": null
    },
    {
        "Venezuela": "Venezuela"
    },
    {
        "; and the ": null
    },
    {
        "Central African Republic": "Central African Republic"
    },
    {
        ".      Thailands death rate for operators and passengers of motorized two- and three-wheeled motorbikes was the worlds highest in 2016 at 74.4 fatalities per 100,000 population.      Sixty-six persons die every day on Thai roads, one every 22 minutes,  seven of them children.   In 2015, Thailands roads were the second deadliest in the world in 2015.   Among public transport options, ": null
    },
    {
        "passenger vans": "Minivan"
    },
    {
        ", with a monthly average of 19.5 accidents resulting in a monthly average of 9.4 deaths, rank as the most dangerous of all public transport services involved in road accidents. Regular tour buses on fixed routes were in second place with a total of 141 accidents, resulting in 56 deaths and 1,252 injuries. Third on the list were irregular tour buses, involved in 52 accidents, resulting in 47 deaths and 576 injuries. Taxis were fourth with 77 accidents, resulting in seven deaths and 84 injuries. Ordinary buses were involved in 48 accidents with 10 deaths and 75 injuries. , there were 156,089 legally registered public transport vehicles in Thailand, 42,202 of which were passenger vans, including 16,002 regular vans, 24,136 irregular vans, and 1,064 private vans.      From 2013–2017, an average of 17,634 children between the ages of 10–19 died on Thailands roads. Most of the fatalities involved motorbikes.      The two most dangerous travel periods in Thailand are at the New Year and at ": null
    },
    {
        "Songkran": "Songkran"
    },
    {
        ". Songkran 2016 saw 442 deaths and 3,656 injuries.  New Year 2017s death toll for the seven day period between 29 December 2016 and 4 January 2017 was 478 compared to the previous years record of 380. A total of 4,128 people were injured in road accidents during the period. The Centre for the Prevention and Reduction of Road Accidents said that the death toll in 2016 was the highest of the last ten years. Death toll records from road accidents for the last ten New Year periods are: 449 deaths in 2007, 401 in 2008, 357 in 2009, 347 in 2010, 358 in 2011, 321 in 2012, 365 in 2013, 366 in 2014, 341 in 2015, 380 in 2016.  Lax enforcement of traffic laws appears to be a major contributor to traffic accidents: the ": null
    },
    {
        "World Health Organizations": "World Health Organization"
    },
    {
        "Collaborating Centre for Injury Prevention and Safety Promotion found that only 20 percent of traffic violators on Thai roads are given tickets and only four percent of those cited pay their traffic fines.      Government attempts to reduce the toll of deaths and injuries have proven ineffectual. In 2011 the government declared the following ten years to be Thailands decade of action on road safety . It named 2012 as the year of 100 percent helmet use on motorbikes. In 2015, about 1.3 million school-age children in Thailand regularly traveled on the back of motorcycles each day but only seven percent wore helmets. In 2018, the WHO reported that motorcycle helmet use was 51 percent by operators and 20 percent by passengers.  In 2015 the ": null
    },
    {
        "Interior Ministrys": "Ministry Of Interior"
    },
    {
        " Department of Disaster Prevention and Mitigations  Road Safety Collaboration Centre  announced a target of reducing road deaths by 80 percent. According to the New York Times, in 2015, Thailand vowed at a ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " forum to halve traffic deaths by 2020.  But DDPMs published mandate makes no mention of road safety.  Road safety falls under the purview of the Ministry of Interiors DDPM. Responsibility for roads falls under the ": null
    },
    {
        "Ministry of Transport": "Ministry Of Transport"
    },
    {
        ".     Thailand has no laws requiring child safety features or a rear seating position in vehicles.        The maximum rural speed limit is 90 ": null
    },
    {
        "km/h": "Kilometres Per Hour"
    },
    {
        ". For motorways it is 120  km/h. The maximum urban speed limit is 80  km/h, far above the best practice limit of 50  km/h recommended by the WHO.        Buses are a major method of transportation for people, freight, and small parcels, and are the most popular means of long distance travel. Tour and VIP class long-distance buses tend to be luxurious, while city- and other-class buses are often very colorful with paint schemes and advertising.     There are fundamentally two types of long-distance buses in Thailand:     those run by The Transport Company, Ltd., , the state-owned bus company.  Known to Thais by the initials บขส , this 80-year-old company was formed by the government to ensure that citizens in even the most far-flung localities had access to the capital city, Bangkok. TCL buses are easily identified by the large golden coat of arms appliqued to each side of the bus.   those operated by private bus companies offer hundreds of routes in various service categories             In Bangkok, the ": null
    },
    {
        "Bangkok Mass Transit Authority": "Bangkok Mass Transit Authority"
    },
    {
        " or BMTA, is the main operator of public transit buses within the ": null
    },
    {
        "Greater Bangkok": "Greater Bangkok"
    },
    {
        " area. The Bangkok Mass Transit Authority offers bus and van routes throughout the city and its suburban provinces. Many bus routes in Bangkok are served by several private companies, sometimes duplicating those from BMTA. Examples include orange minibuses, and cream-blue buses. The buses have the BMTA symbol on them, mostly seen below the drivers side window. These often follow slightly different routings from the main big BMTA bus or do not run along the whole route.     BMTA currently operates bus routes in Bangkok and its metropolitan area namely ": null
    },
    {
        "Nonthaburi": "Nonthaburi Province"
    },
    {
        ", ": null
    },
    {
        "Pathum Thani": "Pathum Thani"
    },
    {
        ", ": null
    },
    {
        "Samut Prakan": "Samut Prakan"
    },
    {
        ", ": null
    },
    {
        "Samut Sakhon": "Samut Sakhon"
    },
    {
        " and ": null
    },
    {
        "Nakhon Pathom": "Nakhon Pathom"
    },
    {
        ".     Local buses and Bangkok city buses come in various sizes, types, and prices, from half size, full size, double length, open window, fan, and air conditioned.             The ": null
    },
    {
        "Bangkok BRT": "Bangkok Brt"
    },
    {
        " is a ": null
    },
    {
        "bus rapid transit": "Bus Rapid Transit"
    },
    {
        " system in Bangkok. Of five routes that were originally planned, only one line has been operating since 2010. The  route has twelve stations in the centre of the road that give at-grade access to the right-hand side of the buses. Both terminals connect to the Silom Line of the BTS Skytrain; at ": null
    },
    {
        "Chong Nonsi": "Chong Nonsi Bts Station"
    },
    {
        " and ": null
    },
    {
        "Talat Phlu": "Talat Phlu Bts Station"
    },
    {
        " . The buses used are all ": null
    },
    {
        "Sunlong": "Sunlong Bus"
    },
    {
        " SLK6125CNG buses. The flat fare is five baht.             The Thai highway network links every part of Thailand. Most highways are in good state of repair, greatly enhancing safety and speed. The four-lane highways often have overhead concrete pedestrian crossings interspersed about every 250 meters in populated areas. There are few on and off ramps on eight-lane highways, most highways are separated by medians with breakage for U-turns, except on major roads where ramp style U-turns predominate.     A number of undivided two-lane highways have been converted into divided four-lane highways. A Bangkok - ": null
    },
    {
        "Chon Buri": "Chonburi"
    },
    {
        " motorway now links to the new airport and ": null
    },
    {
        "Eastern Seaboard": "Eastern Seaboard Of Thailand"
    },
    {
        ".          The Thai motorway network is small. Coupled with Bangkoks extensive expressway network, the motorways provide a relief from regular traffic in Bangkok. The Thai Government is planning infrastructure investment in various megaprojects , including motorway expansion to approximately 4,500 kilometers.          Thailand uses the expressway term for the ": null
    },
    {
        "toll road": "Toll Road"
    },
    {
        " or highway network. Most expressways are elevated with some sections at ground level. The current expressway network covers major parts of Bangkok and suburban areas. Expressways are used to avoid heavy traffic jams in Bangkok and reduce traffic time but are sometimes congested in rush hour.       The Thai state has failed at promoting ": null
    },
    {
        "utility cycling": "Utility Cycling"
    },
    {
        " as a mode of transport.  Officials regard bicycles as toys, and cycling as a leisure activity, not as a means of transport that could help solve traffic and environmental problems. Their attitude was on display at Bangkoks celebration of ": null
    },
    {
        "World Car-Free Day": "World Car-Free Day"
    },
    {
        " 2018, celebrated on 22 September. Bangkoks Deputy Governor, Sakoltee Phattiyakul, who presided over the event, arrived in his official automobile, as did his entourage. He then mounted a bicycle for a ceremonial ride.  Prior to the event, which encouraged the non-use of cars, the ": null
    },
    {
        "BMA": "Bangkok Metropolitan Administration"
    },
    {
        " announced there would be extensive free automobile parking spaces available for participants who were to ride bicycles in the parade.      In his first year office, Prime Minister ": null
    },
    {
        "Prayut Chan-o-cha": "Prayut Chan-O-Cha"
    },
    {
        " launched a cycling initiative, encouraging members of the public to cycle. But state investment in cycling lanes ended up a being a waste as they quickly devolved into parking lanes for motorists.  All Thai rail companies, whether commuter or long distance, make on-board transport of bicycles difficult or impractical. Without state intervention, direction, and education, the public lacks the impetus to adopt a mode of transport that remains ignored by urban development projects.       Other forms of road transport includes ": null
    },
    {
        "tuk-tuks": "Auto Rickshaw"
    },
    {
        ", taxis—as of November 2018, Thailand has 80,647 registered taxis nationwide  —vans , motorbike taxis, and ": null
    },
    {
        "songthaew": "Songthaew"
    },
    {
        "s.     There are 4,125 public vans operating on 114 routes from Bangkok to the provinces alone. They are classed as Category 2 public transport vehicles . Until 2016, most operated from a Bangkok terminus at ": null
    },
    {
        "Victory Monument": "Victory Monument"
    },
    {
        ". They are being moved from there to the Department of Land Transports three Bangkok bus terminals.      Passenger vans have a disturbing safety record. The Safe Public Transport Travel Project of the Foundation for Consumers, reports that passenger vans in 2018 were involved in 75 accidents, causing 314 injuries and 41 deaths.  In 2017 the numbers were 113 dead and 906 injured, and in 2016, 105 people died and 1,102 others were injured in passenger van accidents. A government initiative to replace existing vans with larger ": null
    },
    {
        "minibus": "Minibus"
    },
    {
        "es in 2017, then delayed to 2019, was put on hold by the incoming ": null
    },
    {
        "Prayut": "Prayut Chan-O-Cha"
    },
    {
        " administration.                As of 2012, Thailand had 103 airports with 63 paved runways, in addition to 6 heliports. The busiest airport in the county is Bangkoks ": null
    },
    {
        "Suvarnabhumi Airport": "Suvarnabhumi Airport"
    },
    {
        ".        Major international airports ": null
    },
    {
        "Suvarnabhumi Airport": "Suvarnabhumi Airport"
    },
    {
        "   Don Mueang International Airport": "Don Mueang International Airport"
    },
    {
        "   Chiang Mai International Airport": "Chiang Mai International Airport"
    },
    {
        "   Mae Fah Luang International Airport": "Mae Fah Luang International Airport"
    },
    {
        "   Hat Yai International Airport": "Hat Yai International Airport"
    },
    {
        "   Phuket International Airport": "Phuket International Airport"
    },
    {
        "   Krabi International Airport": "Krabi Airport"
    },
    {
        "   Samui International Airport": "Samui Airport"
    },
    {
        "   Surat Thani International Airport": "Surat Thani Airport"
    },
    {
        "   Udon Thani International Airport": "Udon Thani Airport"
    },
    {
        "   U-Tapao International Airport": "U-Tapao International Airport"
    },
    {
        "          The national carrier of Thailand is ": null
    },
    {
        "Thai Airways International": "Thai Airways International"
    },
    {
        ", founded in 1959. ": null
    },
    {
        "Bangkok Airways": "Bangkok Airways"
    },
    {
        " has been operating since 1968 and now markets itself as Asias Boutique Airline . Low-cost carriers have become prevalent since 2003, including ": null
    },
    {
        "Thai Smile": "Thai Smile"
    },
    {
        ", ": null
    },
    {
        "Thai AirAsia": "Thai Airasia"
    },
    {
        ", ": null
    },
    {
        "Thai AirAsia X": "Thai Airasia X"
    },
    {
        ", ": null
    },
    {
        "Thai Lion Air": "Thai Lion Air"
    },
    {
        ", ": null
    },
    {
        "Thai Vietjet Air": "Thai Vietjet Air"
    },
    {
        " and ": null
    },
    {
        "Nok Air": "Nok Air"
    },
    {
        ".       As of 2011 there were 3,999  km of principal waterways, of which 3,701  km had navigable depths of 0.9 m or more throughout the year. There are numerous minor waterways navigable by shallow-draft native craft, such as ": null
    },
    {
        "long-tailed boat": "Long-Tailed Boat"
    },
    {
        "s.       In Bangkok, the ": null
    },
    {
        "Chao Phraya River": "Chao Phraya River"
    },
    {
        " is a major transportation artery, with ferries, water taxis  and long-tailed boats. There are local, semi-express, and express lines for commuters, though the winding river means trips can be much farther than by bus. There is also the ": null
    },
    {
        "Khlong Saen Saeb": "Khlong Saen Saeb"
    },
    {
        " boat service, which provides fast, inexpensive transport in central Bangkok.       Ferry service between hundreds of islands and the mainland is available, as well as across navigable rivers, such as Chao Phraya and Mae Khong . There are a number of international ferries. In November 2018, Hua Hin deputy chief Chareewat Phramanee confirmed the ferry service, suspended due to low tourist numbers during low season, would be up and running again for high season between Hua Hin and Pattaya, a 2.5-hour journey for 1,250 Thai Bhat on a catamaran with a maximum capacity of 340.        In Thailand, the ": null
    },
    {
        "Gulf of Thailand": "Gulf Of Thailand"
    },
    {
        " and ": null
    },
    {
        "Andaman Sea": "Andaman Sea"
    },
    {
        " is a transportation system:   Trat - Ko Chang boat service   Surat Thani - Ko Samui boat service   Phuket - Phi Phi Islands boat service   Phuket - Ao Nang boat service   Bang Pu - Hua Hin - Pranburi boat service   Bang Pu - Pattaya boat service   Pattaya - Hua Hin - Pranburi boat service       ": null
    },
    {
        "Bangkok": "Bangkok"
    },
    {
        " Laem Ngop": "Amphoe Laem Ngop"
    },
    {
        " Laem Chabang": "Laem Chabang"
    },
    {
        " near ": null
    },
    {
        "Si Racha": "Amphoe Si Racha"
    },
    {
        " Pattani": "Pattani"
    },
    {
        " Phuket": "Phuket Province"
    },
    {
        "    Sattahip": "Amphoe Sattahip"
    },
    {
        " Songkhla": "Songkhla"
    },
    {
        " Ranong": "Ranong"
    },
    {
        " Satun": "Satun"
    },
    {
        "       As of 2010 Thailands merchant marine fleet consisted of 363 ": null
    },
    {
        "ships": "Ship"
    },
    {
        "  totaling 1,834,809 GT/. By type this includes 31 ": null
    },
    {
        "bulk carrier": "Bulk Carrier"
    },
    {
        ", 99 ": null
    },
    {
        "cargo ship": "Cargo Ship"
    },
    {
        "s, 28 ": null
    },
    {
        "chemical tanker": "Chemical Tanker"
    },
    {
        "s, 18 ": null
    },
    {
        "container ship": "Container Ship"
    },
    {
        "s, 36 liquified gas vessels, 1 ": null
    },
    {
        "passenger ship": "Passenger Ship"
    },
    {
        ", 10 passenger/cargo ships, 114 ": null
    },
    {
        "petroleum tankers": "Oil Tanker"
    },
    {
        ", 24 ": null
    },
    {
        "refrigerated cargo ships": "Reefer Ship"
    },
    {
        ", 1 ": null
    },
    {
        "roll-on/roll-off": "Roll-On/Roll-Off"
    },
    {
        ", 1 other passenger vessel.       Pipelines are used for bulk transport of gas , liquid ": null
    },
    {
        "petroleum": "Petroleum"
    }
]