[
    {
        "   A trick-taking game is a ": null
    },
    {
        "card": "Card Game"
    },
    {
        " or ": null
    },
    {
        "tile-based game": "Tile-Based Game"
    },
    {
        " in which play of a  hand  centers on a series of finite rounds or units of play, called tricks, which are each evaluated to determine a winner or taker of that trick. The object of such games then may be closely tied to the number of tricks taken, as in plain-trick games such as ": null
    },
    {
        "Whist": "Whist"
    },
    {
        ", ": null
    },
    {
        "Contract bridge": "Contract Bridge"
    },
    {
        ", ": null
    },
    {
        "Spades": "Spades"
    },
    {
        ", ": null
    },
    {
        "Napoleon": "Napoleon"
    },
    {
        ", ": null
    },
    {
        "Euchre": "Euchre"
    },
    {
        ", Rowboat, Clubs and ": null
    },
    {
        "Spoil Five": "Spoil Five"
    },
    {
        ", or to the value of the cards contained in taken tricks, as in point-trick games such as ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        ", the ": null
    },
    {
        "Tarot": "Tarot Card Games"
    },
    {
        " family, ": null
    },
    {
        "Mariage": "Mariage"
    },
    {
        ", ": null
    },
    {
        "Rook": "Rook"
    },
    {
        ", ": null
    },
    {
        "All Fours": "All Fours"
    },
    {
        ", ": null
    },
    {
        "Manille": "Manille"
    },
    {
        ", ": null
    },
    {
        "Briscola": "Briscola"
    },
    {
        ", and most evasion games like ": null
    },
    {
        "Hearts": "Hearts"
    },
    {
        ". . The domino game ": null
    },
    {
        "Texas 42": "42"
    },
    {
        " is an example of a trick-taking game that is not a card game. Trick-and-draw games are trick-taking games in which the players can fill up their hands after each trick. In most variants, players are free to play any card into a trick in the first phase of the game, but must follow suit as soon as the stock is depleted. Trick-avoidance games like ": null
    },
    {
        "Reversis": "Reversis"
    },
    {
        " or ": null
    },
    {
        "Polignac": "Polignac"
    },
    {
        " are those in which the aim is to is avoid taking some or all tricks.       The earliest ": null
    },
    {
        "card games": "Card Game"
    },
    {
        "were trick-taking games  originating from China and spreading westwards during the early part of the second millennium. ": null
    },
    {
        "Michael Dummett": "Michael Dummett"
    },
    {
        " noted that these games share various features. They were played without ": null
    },
    {
        "trumps": "Trump"
    },
    {
        ", following suit was not required but only the highest card of the suit led wins, rotation was counter-clockwise, they were plain-trick games, and that the ": null
    },
    {
        "pip cards": "Pip Card"
    },
    {
        "of one or more suit are in reverse order so that the lower cards beat the higher ones.  Two revolutions occurred in European trick-taking games that would lead to the development of ever more sophisticated card games. The first is the invention of trumps in the 15th century. The second was ": null
    },
    {
        "bidding": "Bidding"
    },
    {
        " in the 17th century.     According to card game researcher ": null
    },
    {
        "David Parlett": "David Parlett"
    },
    {
        ", the oldest known European trick-taking game, ": null
    },
    {
        "Karnöffel": "Karnöffel"
    },
    {
        ", was mentioned in 1426 in the Bavarian town ": null
    },
    {
        "Nördlingen": "Nördlingen"
    },
    {
        " – roughly half a century after the introduction of playing cards to Europe, which were first mentioned in Spain in 1371. . The oldest known trumps appear in Karnöffel, where specific ranks of one suit were named Karnöffel, Devil, Pope etc. and subject to an elaborate system of trumping powers. Around 1440 in Italy, special cards called  trionfi  were introduced with a similar function. These special cards are now known as tarots, and a deck augmented by tarots as a ": null
    },
    {
        "tarot": "Tarot"
    },
    {
        " deck. The trionfi/tarots formed essentially a fifth suit without the ordinary ranks but consisting of trumps in a fixed hierarchy. But one can get a similar effect by declaring all cards of a fixed or randomly determined suit to be trumps. This method, originating with ": null
    },
    {
        "Triomphe": "Triomphe"
    },
    {
        ", is still followed by a number of modern trick-taking games that do not involve an auction. . Trumps were retroactively added to some games, such as ": null
    },
    {
        "Trappola": "Trappola"
    },
    {
        ". It is much rarer for trumps to be removed.  McLeod, John.  at ": null
    },
    {
        "pagat.com": "Pagat.Com"
    },
    {
        ". Retrieved 25 January 2016. The invention of trumps became so popular that very few European trick-taking games exist without them. This did not stop the two-handed ": null
    },
    {
        "Piquet": "Piquet"
    },
    {
        " from becoming the most popular card game in Europe during the 16th century. Parlett suggests the invention of trumps let players in games involving more than two a greater chance of heading a trick.      The invention of bidding for a trump suit is credited to ": null
    },
    {
        "Ombre": "Ombre"
    },
    {
        ", the most popular card game of the 17th century. Rather than having a randomly selected trump suit, players can now hold an auction for it. The most popular games of the 18th-century was tarot which experienced a great revival. . During this time, many tarot games borrowed bidding over the stock . In the 20th century, Whist developed into ": null
    },
    {
        "Contract bridge": "Contract Bridge"
    },
    {
        ", the last global trick-taking game.     It is possible that the origin of the practice of counting tricks was the counting of cards won in tricks. It was therefore a logical development to accord some cards a higher counting-value, and some cards no value at all, leading to point-trick games. Point-trick games are at least as old as tarot decks and may even predate the invention of trumps. ": null
    },
    {
        "Elfern": "Elfern"
    },
    {
        " and ": null
    },
    {
        "Fünfzehnern": "Fünfzehnern"
    },
    {
        " are possible candidates although the earliest references date to the 19th century. Nearly all point-trick games are played with tarot decks or ": null
    },
    {
        "stripped deck": "Stripped Deck"
    },
    {
        "s, which in many countries became standard before 1600, and neither point-trick games nor stripped decks have a tradition in England.     While there are a number of games with unusual card-point values, such as ": null
    },
    {
        "Trappola": "Trappola"
    },
    {
        " and ": null
    },
    {
        "All Fours": "All Fours"
    },
    {
        ", most point-trick games are in the huge family of ": null
    },
    {
        "Ace–Ten card games": "Ace–Ten Card Games"
    },
    {
        " beginning with ": null
    },
    {
        "Brusquembille": "Brusquembille"
    },
    {
        ". ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        " is a representative of this family that is popular in the United States. Other examples include ": null
    },
    {
        "Belote": "Belote"
    },
    {
        " and ": null
    },
    {
        "Skat": "Skat"
    },
    {
        ".     In contrast to Europe, Chinese trick-taking games did not develop trumps or bidding. They diverged into multi-trick games where melds can only be beaten by other melds provided they have the same number of cards. During the ": null
    },
    {
        "Qing dynasty": "Qing Dynasty"
    },
    {
        ", these multi-trick games evolved into the earliest draw-and-discard games where the players objective is to form melds and go out rather than capturing the opponents cards. ": null
    },
    {
        "Khanhoo": "Khanhoo"
    },
    {
        " is an example of a multi-trick game that became a draw-and-discard game.  Multi-trick games are also probably the source for climbing games like ": null
    },
    {
        "Winner": "Winner"
    },
    {
        " and  dou dizhu  which first appeared during the ": null
    },
    {
        "Cultural Revolution": "Cultural Revolution"
    },
    {
        ".       Certain actions in trick-taking games with three or more players always proceed in the same direction. In games originating in North and West Europe, including England, Russia, and the United States and Canada, the rotation is typically clockwise ; in South and East Europe, Latin America, and Asia it is typically counterclockwise, so that play proceeds to the right. When games move from one region to another, they tend to initially preserve their original sense of rotation, but a region with a dominant sense of rotation may adapt a migrated game to its own sensibilities. For two-player games the order of play is moot as either direction would result in exactly the same turn order.     In each hand or deal, one player is the  dealer . This function moves from deal to deal in the normal direction of play. The dealer usually ": null
    },
    {
        "shuffles": "Shuffling"
    },
    {
        " the deck , and after giving the player one seat from the dealer opposite the normal direction of play an opportunity to ": null
    },
    {
        "cut": "Cut"
    },
    {
        ", hands out the same number of cards to each player, usually in an order following the normal direction of play. Most games deal cards one at a time in rotation; a few games require dealing multiple cards at one time in a packet. The cards apportioned to each player are collectively known as that players hand and are only known to the player. Some games involve a set of cards that are not dealt to a players hand; these cards form the stock . It is generally good manners to leave ones cards on the table until the deal is complete.     The player sitting one seat after the declarer in normal rotation is known as the  eldest hand , also called the forehand in ": null
    },
    {
        "Skat": "Skat"
    },
    {
        " and other games of German origin. The eldest hand leads to the first trick, i.e. places the first card of the trick face up in the middle of all players. The other players each follow with a single card, in the direction of play. When every player has played a card to the trick, the trick is evaluated to determine the winner, who takes the cards, places them face down on a pile, and leads to the next trick. The winner or taker of a trick is usually the player who played the highest-value card of the suit that was led, unless the game uses one or more  trump  cards .     The player who leads to a trick is usually allowed to play an arbitrary card from their hand. Some games have restrictions on the first card played in the hand, or may disallow leading a card of a particular ": null
    },
    {
        "suit": "Suit"
    },
    {
        " until that suit has been played off-suit in a prior trick . Other games have special restrictions on the card that must be led to the first trick; usually this is a specific card  and the holder of that card is the eldest hand instead of the person one seat after the dealer.     In many games, the following players must  follow suit  if they can, i.e., they must play a card of the same suit if possible. A player who cannot follow suit may sluff a card, i.e., play a card of a different suit. A trick is won by the player who has played the highest-ranked card of the suit led, i.e., of the suit of the first card in the trick .     It can be an advantage to lead to a trick, because the player who leads controls the suit that is led and which others must follow; the leading player playing a suit of which he has many, decreases the chance that anyone else would be able to follow suit; while conversely playing a suit of which he has few, allows him to rid his hand of that suit , freeing him from the restriction to follow suit when that suit is led by another player. On the other hand, it can also be advantageous to be the final player who plays to the trick, because at that point one has full information about the other cards played to the trick; the last player to a trick can play a card just slightly higher or lower than the current winning card, guaranteeing they will win or lose it by the minimum amount necessary, saving more valuable high or low value cards for situations where they must guarantee that a card played early to a trick will win or lose.     When all cards have been played, the number or contents of the tricks won by each player is tallied and used to update the score. Scoring based on the play of tricks varies widely between games, but in most games either the number of tricks a player or partnership has won , or the value of certain cards that the player has won by taking tricks  is important.       In many games such as ": null
    },
    {
        "Hearts": "Hearts"
    },
    {
        " and ": null
    },
    {
        "Oh Hell": "Oh Hell"
    },
    {
        ", all players play individually against each other.   In many four-player games such as ": null
    },
    {
        "Bridge": "Contract Bridge"
    },
    {
        ", ": null
    },
    {
        "Euchre": "Euchre"
    },
    {
        " and ": null
    },
    {
        "Spades": "Spades"
    },
    {
        ", the players sitting opposite to each other form a fixed partnership.   Some games such as ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        " are commonly played with or without partnerships, depending on the number of players.   In some contract/auction games for three or more players, e.g. most Tarot variants, the contractor  plays alone against all opponents, who form an ad hoc partnership .   In some games the partnerships are decided by chance – the contractor forms a partnership with the winner of the first trick, or with the player who holds a certain card. This practice originated from Cinquillo and ": null
    },
    {
        "Quadrille": "Quadrille"
    },
    {
        ".   In ": null
    },
    {
        "Königrufen": "Königrufen"
    },
    {
        " and five-player ": null
    },
    {
        "French Tarot": "French Tarot"
    },
    {
        " the taker can call out a suit of which he does not possess the King, and is partnered with whomever does have it against the other three.   Standard ": null
    },
    {
        "Schafkopf": "Schafkopf"
    },
    {
        " is similar: A player can call a suit, and the person holding the ace of that suit becomes his partner for the hand. As this is not openly declared, it can be a challenge for the remaining players, to find out who is partnered with whom through cunning playing for several tricks. Aside from that, standard Schafkopf also has several solo options, where the player plays alone against the rest.   In ": null
    },
    {
        "Doppelkopf": "Doppelkopf"
    },
    {
        " the two players holding the black Queens are partners for that hand. Special rules are provided for the case where a single player holds both black Queens.       In some games not all cards are distributed to the players, and a stock remains. This stock can be referred to by different names, depending on the game; supply, talon, nest, skat, kitty, and dog are common game-specific and/or regional names.     In some games the stock remains untouched throughout play of the hand; it is simply a pile of extra cards that will never be played and whose values are unknown, which will reduce the effectiveness of ": null
    },
    {
        "counting cards": "Card Reading"
    },
    {
        " . In games without bidding, trumps may be decided by exposing a card in the stock as in ": null
    },
    {
        "Triomphe": "Triomphe"
    },
    {
        ". In other games, the winner of an auction-bidding process may get to exchange cards from his hand with the stock, either by integrating the stock into his hand and then discarding equal cards as in ": null
    },
    {
        "Skat": "Skat"
    },
    {
        ", ": null
    },
    {
        "Rook": "Rook"
    },
    {
        " and ": null
    },
    {
        "French tarot": "French Tarot"
    },
    {
        ", or in a blind fashion by discarding and drawing as in ": null
    },
    {
        "Ombre": "Ombre"
    },
    {
        ". The stock, either in its original or discarded form, may additionally form part of one or more players scoring piles of tricks taken; it may be kept by the declarer, may be won by the player of the first trick, or may go to an opposing player or partnership.     In some games, especially two-player games, after each trick every player draws a new card. This continues while the stock lasts. Since this drawing mechanism would normally make it difficult or impossible to detect a revoke , in the first phase of trick-play players generally need not follow suit. A widespread game of this type is the ": null
    },
    {
        "Marriage group": "Marriage Group"
    },
    {
        ".         In a contract game the winning and scoring conditions are not fixed but are chosen by one of the players after seeing their hand. In such games, players make bids depending on the number of tricks or card points they believe they can win during play of the hand. One or more of these bids stands as the contract, and the player who made that bid is rewarded for meeting it or penalized for not meeting it.     In auction games, bidding players are competing against each other for the right to attempt to make the contract. In a few games, the contract is fixed and players bids are a wager of game points to be won or lost. In others, the bid is a number of tricks or card points the bidder is confident that they or their partnership will take. Either of these can also include the suit to be used as trumps during the hand. Common bids include slam , ": null
    },
    {
        "misère": "Misère"
    },
    {
        " , ouvert , playing without using the stock or only part of it, and winning the last trick or other specific tricks. The highest bid becomes the contract and the highest bidder is the contractor, known in some games as the declarer or taker, who then plays either with or without a partner. The other players become opponents or defenders, whose main goal is to prevent the contract being met. They may announce a contra against the contractor which doubles the points for the hand. The contractor can declare a recontra which will double the points again.     Popular examples of games with auctions include ": null
    },
    {
        "Contract bridge": "Contract Bridge"
    },
    {
        ", ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        ", ": null
    },
    {
        "tarot games": "Tarot Card Games"
    },
    {
        ", ": null
    },
    {
        "Skat": "Skat"
    },
    {
        ", ": null
    },
    {
        "Belote": "Belote"
    },
    {
        " and ": null
    },
    {
        "Twenty-Eight": "Twenty-Eight"
    },
    {
        ". In many auction games the eldest hand leads to the first trick, regardless of who won the auction, but in some, such as ": null
    },
    {
        "Contract Bridge": "Contract Bridge"
    },
    {
        ", the first lead is made by the player next in rotation after the contractor, so that the contractor plays last to that trick.     In precision or exact-prediction games, all players choose their winning condition independently: to win precisely a predicted number of tricks  or card points . Each players bid stands , and each player or partnership then tries to take exactly the number of tricks or points they bid, and are rewarded or penalized for doing so independently of anyone elses success or failure in meeting their bid. This type of game began to mature in the 20th century. . Other games generally falling into the exact-prediction category are ": null
    },
    {
        "Spades": "Spades"
    },
    {
        " and ": null
    },
    {
        "Ninety-Nine": "Ninety-Nine"
    },
    {
        ".        Trump cards  are a set of one or more cards in the deck that, when played, are of higher value than the suit led. If a trick contains any trump cards, it is won by the highest-value trump card played, not the highest-value card of the suit led.     In most games with trumps, one of the four suits is identified as the trump suit. In the simplest case, there is a static trump suit such as the Spade suit in the game ": null
    },
    {
        "Spades": "Spades"
    },
    {
        ", or a dedicated trump suit in the ": null
    },
    {
        "Tarot": "Tarot Card Games"
    },
    {
        " family is featured. More often, a dynamic trump suit is determined by some means, either randomly by selection of a card as in ": null
    },
    {
        "Oh Hell": "Oh Hell"
    },
    {
        " and the original form of ": null
    },
    {
        "Whist": "Whist"
    },
    {
        ", or decided by the winner or winning bid of an auction as in ": null
    },
    {
        "contract bridge": "Contract Bridge"
    },
    {
        " and some forms of ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        ". In certain games, such as Rowboat and Rage, the trump suit may change during the course of the hand, even from trick to trick. Some psychological variety is added to the game and makes it more difficult to cheat if the trump suit is only chosen after dealing.     In some games, in addition to or separately from a trump suit, certain fixed cards are always the highest trumps, e.g. the Jacks in ": null
    },
    {
        "Skat": "Skat"
    },
    {
        ", the Jacks or Jokers in ": null
    },
    {
        "Euchre": "Euchre"
    },
    {
        ", and the Rook Bird card in ": null
    },
    {
        "Rook": "Rook"
    },
    {
        ". They are called matadors after the high trumps in ": null
    },
    {
        "Ombre": "Ombre"
    },
    {
        ". Matadors either have high point values or special abilities as in ": null
    },
    {
        "Spoil Five": "Spoil Five"
    },
    {
        " where they can revoke legally.     Some games have more than one trump suit, such as the quasi-trick game ": null
    },
    {
        "Stortok": "Stortok"
    },
    {
        ", in which there are two trumps, with one superseding the other. Other games have no trumps; ": null
    },
    {
        "Hearts": "Hearts"
    },
    {
        " for instance has no provision for a trump suit of any kind . Though trump is part of ": null
    },
    {
        "contract bridge": "Contract Bridge"
    },
    {
        ", teams can make bids that do not specify a trump suit, and if that is the winning bid then there is no trump suit for that hand .       In some games such as ": null
    },
    {
        "Piquet": "Piquet"
    },
    {
        ", ": null
    },
    {
        "Tarocchini": "Tarocchini"
    },
    {
        ", and ": null
    },
    {
        "Belote": "Belote"
    },
    {
        ", before the taking of tricks commences, players can expose certain cards or ": null
    },
    {
        "melds": "Meld"
    },
    {
        " that they possess for bonus points. While this phase may seem to award players for pure chance, those who do declare risk letting their opponents develop strategies to counter the cards that they have revealed.       In many games, following suit is the obligatory action of playing a card of the same suit as that of the leading suit. A player must follow suit if that player has cards of the leading suit in his hands. There is a large variation of strictness in following suit among games. McLeod, John.  at ": null
    },
    {
        "pagat.com": "Pagat.Com"
    },
    {
        ". Retrieved 18 February 2017.     In most modern games with trump suits, the rules for following suit do not distinguish between the trump suit and the plain suits. If a trick begins with a plain suit card and a later player cannot follow suit, the player may choose freely to either sluff , or ruff . Subsequent players to the trick must still follow the original suit, and may only discard or trump if they do not hold a card of the suit led. Certain games are play to beat or must-trump ; if a player cannot follow suit but can play trump, they must play trump, and additionally if they are able they must beat any trump card already played to the trick. ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        " and several of the ": null
    },
    {
        "Tarot card games": "Tarot Card Games"
    },
    {
        " have this rule.     Some games, notably ": null
    },
    {
        "French Tarot": "French Tarot"
    },
    {
        " and a variation of ": null
    },
    {
        "Rook": "Rook"
    },
    {
        ", use a special card  that can be played at any time. If not, he has the choice of playing a trump to possibly win the trick, or rough a different suit.     If unable to follow suit or trump, any card can be played. Each trick must contain one card per player, and hence a player unable to satisfy any other instruction is at liberty to play any card. Usually a low-ranking card or one from a short suit is sacrificed. The former is used to protect a higher ranking card while the latter is to help void a suit so as to allow trumping a future trick.     It is also possible that the specific deal has no trump . In that case, any card other than the leading suit played has no value, in most trick-taking games. In some games such as ": null
    },
    {
        "Oh, hell": "Oh, Hell"
    },
    {
        ", where the player may need to not get more tricks to win, playing cards other than the leading suit can be useful. McLeod, John.  at ": null
    },
    {
        "pagat.com": "Pagat.Com"
    },
    {
        ". Retrieved 18 February 2017.     For example, consider the following ": null
    },
    {
        "Whist": "Whist"
    },
    {
        " hand:   TRUMP: Diamond   North: A♠ K♠ 4♥ 9♦   East: Q♣ 10♣ 7♠ 5♦   South: A♣ 3♥ 2♦ J♦   West: 5♠ 5♣ 6♥ 2♠     North leads the deal with K♠. Now, all the other players must follow suit, i.e. play a spade card. East has a spade card, and thus must follow suit by playing 7♠. South, however, does not have any spade card, and thus is allowed to play any card he wants. If he desires to win the trick, he can override Norths K♠ by playing a diamond card , for example J♦. If he does not want to win the trick, he can sluff any other suit, such as 3♥. Let us assume that he plays J♦, overriding Norths card. Now, West still has to follow suit, since he has a spade card, and plays 2♠. Souths trump card, gives him an opportunity to escape following suit, and he wins the trick.     If a player who can follow suit does not do so, or in games with additional restrictions on card play, not following these restrictions is known as a ": null
    },
    {
        "revoke": "Revoke"
    },
    {
        ", or renege. A revoke typically cannot be discovered at the time when it is committed, but when a player plays off-suit to a trick, competent opponents will make a mental note that the player does not hold the suit led, and will notice later if the player later plays a card of the suit they were thought to be void in. The situation is similar for other types of revoke. Most game rules prescribe a severe penalty for a revoke and may also result in the hand being voided . Decks of cards have been marketed for trick-taking games with the traditional French suit symbols, but in four colors; these are often called ": null
    },
    {
        " no-revoke decks": "Four-Color Deck"
    },
    {
        ", as the color contrast between each suit makes a potential revoking play easier to spot and harder to do accidentally.     In some trick games--typically ones in which players are not penalized for winning tricks, and there is no requirement for trumping or following suit when possible--players may slough, or play a card face down. A card so played is incapable of winning the trick; but sloughing has the advantage that the other players cannot see what card is played. As this form of sloughing has the potential to be used to cheat in most games and is thus not allowed, sloughing in the vernacular more often refers to simply discarding an off-suit card on a trick, particularly one that could be dangerous to that player if kept. This form of sloughing is important in evasion games and in some contract games where overtricks are penalized; in ": null
    },
    {
        "Oh Hell": "Oh Hell"
    },
    {
        ", for instance, a player who cannot follow suit may elect to discard a card that would win if played to follow suit later, thus reducing the chance that the player will bag , or take more tricks than needed. This is common in ": null
    },
    {
        "Hearts": "Hearts"
    },
    {
        ", where high-value cards are dangerous as they increase the chance of winning a trick with penalty points.     Some games such as ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        " use several decks shuffled together. In these games, there may be several equal winning cards in a trick; such games then use other rules to break ties. Common rules include:   the first-played of the tying cards wins   the last-played of the tying cards wins   The tying cards cancel each other out, and the trick is taken by the next-highest card that was played.   The tying cards cancel each other out, but the trick is spoiled .     A common additional rule to reduce these occurrences is that a player cannot play a card tying the current high card unless they would renege or fail to overtrump by making any other play.       When all tricks have been played, the winner of the hand and the players scores can be determined. The determining factor in plain-trick games is simply how many tricks each player or partnership has taken. In point-trick games, certain card values are worth varying points, and the players sum the points from cards in their scoring piles that were accumulated by taking tricks. Points for cards, and the method of counting points, vary by game; in Rook, for example, the 5-card of each color is worth 5 points, the 10 and 14 is worth 10, and the Rook Bird is worth 20, while all other cards are worth nothing. Many Chinese card games like Finding Friends use a very similar system, in which each 5-card is worth 5 points, and the 10 and King are each worth 10 points. Rules for Chinese trick-taking card game . Retrieved on 7 September 2018. Pinochle has many popular scoring variants usually based on point values for face cards and Aces, while pip cards score no points. In French Tarot, all cards have a value including a half-point, and are traditionally scored in pairs of a high-value and a low-value card which results in a whole-point value for the pair.     In the most common positive or race games, players seek to win as many tricks or card points as possible. To win a hand, a player typically needs to win a minimal number of tricks or card points; this minimal threshold is usually called the contract , and may be defined by the games rules , or the result of an auction or bidding process. A player who wins more than the number of tricks or card points necessary for winning the hand may be rewarded with a higher score, or conversely they may be penalized.     There are also negative or evasion games, in which the object is to avoid tricks or card points. E.g. in Hearts each card point won in a trick contributes negatively to the score. A special type is misère games, which are usually variants of positive games which can only be won by not winning a single trick.     Other criteria also occur. Sometimes the last trick has special significance. In marriage games such as Pinochle the winner of the last trick receives 10 points in addition to the card points, while in final-trick games such as ": null
    },
    {
        "cắt tê": "Cắt Tê"
    },
    {
        " only the winner of the last trick can win a hand. There are also blends between positive and negative games, e.g. the aim may be to win a certain prescribed number of tricks. Many card games, regardless of their normal scoring mechanism, give bonuses to players or partnerships who win all tricks or possible points in a hand, or conversely lose all tricks or points.     Games usually end after every player has had an equal chance to be the dealer. The number of rotations varies widely among games. Some games have a cumulative score where all points from each hand add up. Others assign only a set number of game points for winning a hand. For example, a player or side that wins one hand may be awarded one game point, two if they achieve a slam. The player or side with the most game points or the first to reach a certain number of card or game points, is considered the winner.         Numerous further variations to the basic rules may occur, and only a few examples can be mentioned here:   Certain games require the holder of a certain card value to play it as the lead to the first trick of a hand; ": null
    },
    {
        "Hearts": "Hearts"
    },
    {
        ", as commonly played in North America, requires the player holding the 2 to play it as the lead-off card. Variants of ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        " sometimes require the first player to the left of the dealer that holds a dix  to lead off.   There may be restrictions on leading certain suits; a common Hearts rule is that a player may not lead a Heart until at least one trick has had a Heart played off-suit to another trick. Spades has a similar but less-common variation regarding its trump suit.   There are trick-taking games played with ": null
    },
    {
        "Domino": "Domino"
    },
    {
        " tiles instead of playing cards. These include the Chinese ": null
    },
    {
        "Tien Gow": "Tien Gow"
    },
    {
        " and ": null
    },
    {
        "Texas 42": "42"
    },
    {
        ". ": null
    },
    {
        "Giog": "Giog"
    },
    {
        " is played with ": null
    },
    {
        "Chinese chess": "Xiangqi"
    },
    {
        " tiles.   Many games are played with one or more  stripped deck s . The most common stripped deck is a ": null
    },
    {
        "piquet deck": "Piquet Deck"
    },
    {
        ", used for ": null
    },
    {
        "piquet": "Piquet"
    },
    {
        ", ": null
    },
    {
        "Belote": "Belote"
    },
    {
        ", ": null
    },
    {
        "Skat": "Skat"
    },
    {
        ", ": null
    },
    {
        "Euchre": "Euchre"
    },
    {
        ", ": null
    },
    {
        "Bezique": "Bezique"
    },
    {
        " and ": null
    },
    {
        "Pinochle": "Pinochle"
    },
    {
        ", among others. ": null
    },
    {
        "Rooks": "Rook"
    },
    {
        "main variant, Kentucky Discard, uses the equivalent of a 52-card deck with all card values 2–4 removed. Most regional ": null
    },
    {
        "Tarot": "Tarot"
    },
    {
        " variants, especially Central European and Italian variants like Tarock and Tarocco, use some subset of the full 78-card Tarot deck.   In Bridge the partner of the contractor or declarer is called dummy and does not actively participate in the play; dummys hand is instead laid on the table face-up after the opening lead, and declarer chooses the cards from dummys hand to play during dummys turns.   In ": null
    },
    {
        "Hachinin-meri": "Karutaunsun Karuta"
    },
    {
        " and Truf, trumps are played face down. When the trick is finished, the trumps are revealed to see who won the trick.  McLeod, John.  at ": null
    },
    {
        "pagat.com": "Pagat.Com"
    },
    {
        ". Retrieved 25 January 2016.   In many trumpless games that do not require following suit, sluffing is done face down. This is done in ": null
    },
    {
        "Madiao": "Madiao"
    },
    {
        ", ": null
    },
    {
        "Tien Gow": "Tien Gow"
    },
    {
        ", ": null
    },
    {
        "Tam cúc": "Tam Cúc"
    },
    {
        ", ": null
    },
    {
        "Six Tigers": ":Zh:六虎牌"
    },
    {
        ", ": null
    },
    {
        "Ganjifa": "Ganjifa"
    },
    {
        ", ": null
    },
    {
        "Kaiserspiel": "Kaiserspiel"
    },
    {
        ", and Brazilian ": null
    },
    {
        "Truco": "Truco"
    },
    {
        ".   Some cards lose their trick-taking power if they are not led or played in a specific trick as in ": null
    },
    {
        "Karnöffel": "Karnöffel"
    },
    {
        ", ": null
    },
    {
        "Tien Gow": "Tien Gow"
    },
    {
        ", and ": null
    },
    {
        "Ganjifa": "Ganjifa"
    },
    {
        ".   In ": null
    },
    {
        "tarot games": "Tarot Game"
    },
    {
        "played outside of Central Europe, ": null
    },
    {
        "the Fool": "The Fool"
    },
    {
        " is a special card that excuses the player from following suit. Except in rare circumstances in some games, it can neither capture nor be captured. Usually a non-counting card is given as compensation to the tricks winner by the Fools owner.       In games derived from Austria and Germany, trick-taking is governed by the rules called Zwänge. The three main ones are Farbzwang, Stichzwang and Trumpfzwang. Although they broadly equate to rules in English-speaking countries, there are no single-word equivalents. For many games of this type, applying these rules correctly is crucial to the type of contract being played.     Farbzwang Farbzwang  literally means suit compulsion and is the rule that players must follow the suit of the first card to be led to the trick, provided that they have a card of that suit. If a player does not have a card of the led suit, they may play a card of their choice. If a player has several cards of the led suit, they may choose which to play. In most cases it makes sense to play a higher ranking card.     Stichzwang Stichzwang means trick compulsion and is the rule that players must attempt to win the trick if they are able, either by playing a higher card of the led suit or by playing a trump card.     Farbzwang with Stichzwang Farbzwang and Stichzwang together, which means that a player, when it is his turn, must:   take the trick with a higher card of the led suit. If unable to do so, he must   discard a lower card of the led suit. If that is not possible, he must   take the trick with a trump card, but if that is also not feasible, he may   discard a card of his choice.     Farbzwang, the requirement to follow suit, always takes precedence over Stichzwang. A player is not allowed to take the trick with a trump if he can follow suit.     Trumpfzwang Trumpzwang means trump compulsion and requires that a player must play a trump if he cannot follow suit. In other words, he may not simply discard, if he cannot follow suit.     ExampleTarockzwang Tarockzwang is used in ": null
    },
    {
        "tarock games": "Tarock Game"
    },
    {
        "such as ": null
    },
    {
        "Königrufen": "Königrufen"
    },
    {
        " and ": null
    },
    {
        "Tapp-Tarock": "Tapp-Tarock"
    },
    {
        " and means Tarock compulsion or the requirement to play a Tarock card if one is led to the trick or if a player is unable to follow suit. It is a form of Trumpfzwang.       Trick-taking games may be divided into point-trick games and plain-trick games. Examples of each are as follows:       Point-trick game are those in which win or loss is determined by the total value of the counters in the tricks. . The counters are cards with a point value, sometimes referred to as card points to avoid confusion with game points awarded for winning the game and/or bonuses.     Examples include:      ": null
    },
    {
        "Bavarian Tarock": "Bavarian Tarock"
    },
    {
        " Bézique": "Bézique"
    },
    {
        " Binokel": "Binokel"
    },
    {
        " Doppelkopf": "Doppelkopf"
    },
    {
        " Jass": "Jass"
    },
    {
        " Zhao Pengyou": "Zhao Pengyou"
    },
    {
        " rd ga": "Rd Ga"
    },
    {
        " rd ga": "Rd Ga"
    },
    {
        " French Tarot": "French Tarot"
    },
    {
        ", ": null
    },
    {
        "Königrufen": "Königrufen"
    },
    {
        ", ": null
    },
    {
        "Zwanzigerrufen": "Zwanzigerrufen"
    },
    {
        ", etc.Bulka ": null
    },
    {
        "rd ga": "Rd Ga"
    },
    {
        " rd ga": "Rd Ga"
    },
    {
        "  rd ga": "Rd Ga"
    },
    {
        " rd ga": "Rd Ga"
    },
    {
        "     rd ga": "Rd Ga"
    },
    {
        " r": "R"
    },
    {
        "r": "R"
    },
    {
        "  rd ga": "Rd Ga"
    },
    {
        " rd ga": "Rd Ga"
    },
    {
        " ": null
    }
]