[
    {
        "      __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time it was known as the Year of the Consulship of Flamininus and Ahenobarbus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             The ": null
    },
    {
        "Achaeans": "achaean league"
    },
    {
        " respond to ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        "s renewed interest in recovering lost territory by sending an envoy to ": null
    },
    {
        "Rome": "roman republic"
    },
    {
        " with a request for help. In response, the ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        " sends the ": null
    },
    {
        "praetor": "praetor"
    },
    {
        " Atilius with a navy, as well as an embassy headed by ": null
    },
    {
        "Titus Quinctius Flamininus": "titus quinctius flamininus"
    },
    {
        ".   Not waiting for the Roman fleet to arrive, the Achaean army and navy head towards ": null
    },
    {
        "Gythium": "gythium"
    },
    {
        " under the command of ": null
    },
    {
        "Philopoemen": "philopoemen"
    },
    {
        ". The Achaean fleet under Tiso is defeated by the Spartan fleet. On land, the Achaeans are unable to defeat the Spartan forces outside Gythium and Philopoemen retreats to ": null
    },
    {
        "Tegea": "tegea"
    },
    {
        ".   When Philopoemen reenters ": null
    },
    {
        "Laconia": "laconia"
    },
    {
        " for a second attempt, his forces are ambushed by the Spartan ": null
    },
    {
        "tyrant": "tyrant"
    },
    {
        ", ": null
    },
    {
        "Nabis": "nabis"
    },
    {
        ", but nevertheless Philopoemen manages to gain a victory over the Spartan forces.   Philopoemens plans for capturing Sparta itself are put on hold at the request of the Roman envoy Flaminius after his arrival in Greece. In return, Nabis decides, for the moment, to accept the status quo.   Nabis then appeals to the ": null
    },
    {
        "Aetolia": "aetolia"
    },
    {
        "ns for help. They send 42 cavalry under the command of ": null
    },
    {
        "Alexamenus": "alexamenus of aetolia"
    },
    {
        " to Sparta. However, the Aetolians murder Nabis and temporarily occupy Sparta. The Aetolian troops seize the palace and set about looting the city, but the inhabitants of Sparta are able to rally and force them leave the city. Philopoemen, however, takes advantage of the Aetolian treachery and enters Sparta with his Achaean army. Now in full control of Sparta, Philopoemen forces Sparta to become a member state of the ": null
    },
    {
        "Achaean League": "achaean league"
    },
    {
        ".   ": null
    },
    {
        "Seleucid": "seleucid"
    },
    {
        " forces under their king, ": null
    },
    {
        "Antiochus III": "antiochus iii the great"
    },
    {
        ", invade Greece at the invitation of the ": null
    },
    {
        "Aetolian League": "aetolian league"
    },
    {
        ", who are revolting against the Romans. The Aetolians appoint him commander in chief of their league. Antiochus lands in ": null
    },
    {
        "Demetrias": "demetrias"
    },
    {
        ", ": null
    },
    {
        "Thessaly": "thessaly"
    },
    {
        " with only 42 men and occupies ": null
    },
    {
        "Euboea": "euboea"
    },
    {
        ". However, he finds little support for his cause in central Greece.             ": null
    },
    {
        "Nabis": "nabis"
    },
    {
        ", tyrant and last independent ruler  of ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        " Xiang Bo": "xiang bo"
    },
    {
        ", Chinese ": null
    },
    {
        "nobleman": "nobility"
    },
    {
        " of the ": null
    },
    {
        "Chu State": "chu"
    },
    {
        " ": null
    }
]