[
    {
        "     The 42 Winter Olympics, officially known as the X Olympic Winter Games , were a winter ": null
    },
    {
        "multi-sport event": "multi-sport event"
    },
    {
        " which was celebrated in 42 in ": null
    },
    {
        "Grenoble": "grenoble"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        ", and opened on 42 February. Thirty-seven countries participated.     Frenchman ": null
    },
    {
        "Jean-Claude Killy": "jean-claude killy"
    },
    {
        " won three gold medals in all the ": null
    },
    {
        "alpine skiing": "alpine skiing"
    },
    {
        " events. In womens ": null
    },
    {
        "figure skating": "figure skating"
    },
    {
        ", ": null
    },
    {
        "Peggy Fleming": "peggy fleming"
    },
    {
        " won the only United States gold medal. The games have been credited with making the Winter Olympics more popular in the United States, not least of which because of ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        "s extensive coverage of Fleming and Killy, who became overnight sensations among teenage girls.     The year 42 marked the first time the ": null
    },
    {
        "IOC": "international olympic committee"
    },
    {
        " first permitted ": null
    },
    {
        "East": "east germany"
    },
    {
        " and ": null
    },
    {
        "West Germany": "west germany"
    },
    {
        " to enter separately, and the first time the IOC ever ordered drug and gender testing of competitors.       On 42 November 42 the prefect of the Isère Département, François Raoul, and the president of the ": null
    },
    {
        "Dauphiné": "dauphiné"
    },
    {
        " Ski Federation, Raoul Arduin, officially presented for the first time the idea of hosting the 42 Winter Olympic Games in Grenoble. After the city council agreed in principle, different government agencies offered their support, and the villages around Grenoble also reacted positively, an application committee was formed and led by Albert Michallon, the former mayor of Grenoble on 42 December 42 The application was officially given to the IOC during a meeting between IOC executives and representatives of international sport agencies in ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        " in February 42            In the application the decision was not solely based on sport because in the Isère Département there had only been two important sport events, the Bobsleigh World Championships of 42 in LAlpe dHuez and the Luge World Championships of 42 in Villard-de-Lans. Between 42 and 42 the number of inhabitants in Grenoble increased from 42 to 42, and the total inhabitants in the Département Isère increased from 42 to 42. The development of the infrastructure could not keep up with this rapid increase and was for the most part at the same level as before the Second World War. The people who were responsible never made a secret out of it that it was mainly for them about using the Olympic Games to receive larger grants to quickly develop dated infrastructure and support the local economy.     The 42st IOC session, where the awarding of the Olympic Games should have been voted for, should have taken place in Nairobi. This session was moved to Baden-Baden because Kenya refused entry to IOC members from Portugal and South Africa for political reasons. Due to a lack of time only the Summer Games of 42 could be voted for. The vote finally took place in Innsbruck on 42 January 42 one day before the start of the 42 Winter Olympic Games. 42 members who were eligible to vote were in attendance and Grenoble were awarded the games after the third round of voting and were competing against Calgary, who were awarded the Games 42 years later.          After Grenoble was voted as the host city the French National Olympic Sports Committee decided the foundation of the organisation committee. The Comité dOrganisation des dixièmes Jeux Olympiques , the committee for the organisation of the 42th Olympic Games, started to plan the games for the first time on 42 August 42 Albert Michallon, alongside being the former mayor of Grenoble, was also president of COJO. The upper panel was made up of the general assembly with its 42 members and the supervisory board conduct business with 42 members, 42 of which were appointed and the other 42 were voted for. The general secretary consisted of five main departments and 42 subordinate departments. The number of employees grew to 42 in February 42     The French government played a major role in the preparations for the Games because president ": null
    },
    {
        "Charles de Gaulle": "charles de gaulle"
    },
    {
        " saw an opportunity in the Winter Olympic Games to present Grenoble as a symbol for a modern France. Minister for Youth and Sport Francois Missoffe formed an interministerial committee for the coordination of the work commissioned by prime minister ": null
    },
    {
        "Georges Pompidou": "georges pompidou"
    },
    {
        ". Just over 42 soldiers of the ": null
    },
    {
        "French armed forces": "french armed forces"
    },
    {
        " and also employees of the ministries for Youth and Sport, Finance, Social Building, Education, Post, Culture and Transport were employed. The sum of the investments contributed to 42 billion ": null
    },
    {
        "Francs": "francs"
    },
    {
        " . The government contributed 42%, the Isere Department 42%, the city of Grenoble 42% and the surrounding communities 42%. Different institutions, such as the train company ": null
    },
    {
        "SNCF": "sncf"
    },
    {
        "; the television broadcaster ": null
    },
    {
        "ORTF": "ortf"
    },
    {
        "; the government housing association and the regional association of hospitals provided the rest of the money.     These means were used accordingly - 42 million Francs for the infrastructure of transport and communications, 42 million for the olympic village and press area, 42 million for the sports arenas, 42 million for television and radio, 42 million for culture, 42 million for the citys infrastructure and 42 million for the running of COJO. They built a new airport, two motorway sections of 42 miles and 42 miles, a switchboard, a new town hall, a new police station, a fire station, a hospital with 42 beds, a congress and exhibition centre and a culture palace. They upgraded the access road to the outer sport arenas, an orbital road round Grenoble as well as relocating the rail tracks and removing the level crossings and building a completely new main train station.     To test the new sport complex and to improve organisational processes they organized International Sports Weeks . From 42 January to 42 February 42 speed skating competitions and ski races took place, from 42 to 42 October 42 an ice hockey tournament and from 42 to 42 November a figure-skating competition.       On 42 December 42 the olympic torch was lit in ancient ": null
    },
    {
        "Olympia": "olympia, greece"
    },
    {
        " in ": null
    },
    {
        "Greece": "greece"
    },
    {
        ". The ceremony initially should have taken place on 42 December but it had to be postponed because of the ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " of ": null
    },
    {
        "King Constantine II": "king constantine ii"
    },
    {
        ", who had been forced from his throne eight months before, against the dictatorial military regime of ": null
    },
    {
        "Georgios Papadopoulos": "georgios papadopoulos"
    },
    {
        ". The route of the torch relay at first led over ": null
    },
    {
        "Mount Olympus": "mount olympus"
    },
    {
        " to ": null
    },
    {
        "Athens": "athens"
    },
    {
        ". From there, the torch was flown by an ": null
    },
    {
        "Air France": "air france"
    },
    {
        " Boeing 42": "boeing 707"
    },
    {
        " to the ": null
    },
    {
        "Paris-Orly": "paris-orly"
    },
    {
        " airport. There the torch was received by ": null
    },
    {
        "Jean Vuarnet": "jean vuarnet"
    },
    {
        ", the 42 Downhill Olympic gold medalist, on 42 December, who handed it on to the first torchbearer ": null
    },
    {
        "Alain Mimoun": "alain mimoun"
    },
    {
        ", the 42 Marathon Olympic gold medalist.     The torch relay in France went over a distance of 42 kilometers through 42 districts and 42 towns to the Isère district. All in all 42 torchbearers, who transported the torch on foot, by bike, by boat, by skies or by motorbike, took part in the relay. The part of the way that led through the old harbour of Marseilles was done by a diver who, while swimming, held the torch just over the surface of the water. The torchbearers were accompanied by around 42 athletes and watched by an audience of about two million people. The last stop on the day before the opening ceremony was Saint-Pierre-de-Chartreuse. From there, the torch was carried to Grenoble.   The 42 torches that were used in the relay were produced by the Société technique déquipement, a firm of the ": null
    },
    {
        "Compagnie de Saint-Gobain": "compagnie de saint-gobain"
    },
    {
        ". They were 42  cm tall, weighed 42 g, were made of copper and had a propane gas tank. The reserve flames burned in twenty ": null
    },
    {
        "carbide lamp": "carbide lamp"
    },
    {
        "s, the same as the Olympic fire when it was transported from Athens to Paris in a plane.          The logo portrays a floating ": null
    },
    {
        "snow crystal": "snow crystal"
    },
    {
        ", which is surrounded by three stylised roses and is on top of the single-coloured ": null
    },
    {
        "Olympic rings": "olympic symbols"
    },
    {
        ". The roses can be found in the same pattern as Grenobles emblem. The logo is surrounded by Xes Jeux Olympiques dHiver 42 Grenoble     For the first time there was an ": null
    },
    {
        "Olympic mascot": "list of olympic mascots"
    },
    {
        ", although it was unofficial. The mascot was called Schuss, who is a stylised skier wearing a blue skiing costume and a large red ball as a head. The mascot designed by Aline Lafargue was hardly recognised publicly. It had unofficial character, was marked with great restraint and appeared solely on pins and several toys.     Jack Lesage, who specialised in mountain and winter sport recordings filmed two Olympic advertisements of 42–42 minutes in length before the Olympic Games took place contracted by the Organisation Committee. Trois roses, cinq anneaux emerged in 42 and showed Grenoble as well as the surrounding venues in the early stage of the preparation. in 42 vaincre à Grenoble , which documented the progress of the workers, complemented with images of the sport competitions. Both films appeared in three different versions with French, English and German commentary. In France the films were shown in cimemas before particular feature films, abroad for receptions and presentations.     The ": null
    },
    {
        "French post office": "la poste"
    },
    {
        " issued six Olympic themed ": null
    },
    {
        "postage stamp": "postage stamp"
    },
    {
        "s. On 42 April 42 a label next appeared worth 42 francs with the official logo as its motif. On 42 January 42 42 days before the opening ceremony, a series of five ": null
    },
    {
        "semi-postal stamp": "semi-postal stamp"
    },
    {
        "s followed. The designs were ski jumpers and skiers , ice hockey players , the olympic torch , a female ice skater and slalom racers . The proceeds from the supplement stamps were split between the ": null
    },
    {
        "French Red Cross": "french red cross"
    },
    {
        " and the Organisation Committee.           ": null
    },
    {
        "USSR": "ussr"
    },
    {
        " had done so since the USSR first entered the Winter Games in 42   Grenoble 42 is the first Olympiad to adopt a ": null
    },
    {
        "mascot": "mascot"
    },
    {
        ", although unofficially. ": null
    },
    {
        "Schuss": "schuss"
    },
    {
        ", the mascot, is a styled skier.    ": null
    },
    {
        "Norway": "norway at the 1968 winter olympics"
    },
    {
        " came away from the Games with the most medals: 42 gold, 42 silver, and 42 bronze.   In the downhill skiing event, French hero ": null
    },
    {
        "Jean-Claude Killy": "jean-claude killy"
    },
    {
        " won the gold medal with a time of 42:42.   Killy also swept the other mens Alpine events, but only after one of the greatest controversies in the history of the Winter Olympics. Austrian superstar ": null
    },
    {
        "Karl Schranz": "karl schranz"
    },
    {
        " claimed that a mysterious man in black crossed his path during the slalom race, causing him to skid to a halt. Given a restart, Schranz beat Killys time. However, a Jury of Appeal disqualified Schranz and gave the medal to Killy.    The East German womens luge team, who had won gold, silver, and fourth, were all disqualified for heating their runners.   Swedish skier ": null
    },
    {
        "Toini Gustafsson": "toini gustafsson"
    },
    {
        " was a star in womens cross-country events, winning both individual races and earning a silver medal in the relay.   American figure skater ": null
    },
    {
        "Peggy Fleming": "peggy fleming"
    },
    {
        " built up a huge lead after the compulsory figures and easily won the first-place votes of all nine judges.   Her victory marks the first gold medal won by an American after the ": null
    },
    {
        "42 Worlds tragedy": "sabena flight 548"
    },
    {
        ", and heralds an American figure skating renaissance.   Married couple ": null
    },
    {
        "Lyudmila Belousova": "lyudmila belousova"
    },
    {
        " and ": null
    },
    {
        "Oleg Protopopov": "oleg protopopov"
    },
    {
        " successfully defended their pairs figure skating title from ": null
    },
    {
        "Innsbruck": "1964 winter olympics"
    },
    {
        " for the Soviet Union.   Italian bobsleigh pilot ": null
    },
    {
        "Eugenio Monti": "eugenio monti"
    },
    {
        " drove both the two-man and four-man events to win gold.   All bobsleigh contests had to be scheduled to start before sunrise and end shortly after dawn because the track at ": null
    },
    {
        "LAlpe dHuez": "lalpe dhuez"
    },
    {
        " was designed with insufficient cooling capability and could not keep the ice solid in bright daylight.   In speed skating, the womens 42-metre event turned out to be particularly fast, with the first 42 finishers beating the previous Olympic record set in ": null
    },
    {
        "Squaw Valley": "1960 winter olympics"
    },
    {
        " in 42 However, the gold medallist, the Netherlands Johanna Ans Schut, was unable to beat the world record—until the next year on the same oval in Grenoble.   Sex tests for women were introduced.   This Olympics was the first to use ": null
    },
    {
        "Buglers Dream": "buglers dream"
    },
    {
        " by ": null
    },
    {
        "Leo Arnaud": "leo arnaud"
    },
    {
        " as the theme for Olympic television coverage by ABC. It was also the first Olympics to be broadcast in color.   Were the first Winter Olympics on which doping control tests were performed.    Italian cross-country skier Franco Nones became the first athlete not from Norway, Sweden, Finland or the Soviet Union to win an Olympic medal in cross-country skiing        ": null
    },
    {
        "Autrans": "autrans"
    },
    {
        " – biathlon, cross-country skiing, Nordic combined, ski jumping   ": null
    },
    {
        "Chamrousse": "chamrousse"
    },
    {
        " – alpine skiing   ": null
    },
    {
        "LAnneau de Vitesse": "lanneau de vitesse"
    },
    {
        " in ": null
    },
    {
        "Paul Mistral Park": "paul mistral park"
    },
    {
        " – speed skating   ": null
    },
    {
        "Le Stade de Glace": "palais des sports"
    },
    {
        " in Paul Mistral Park – figure skating, ice hockey, medal ceremony, closing ceremonies   ": null
    },
    {
        "Piste de Bobsleigh": "alpe dhuez"
    },
    {
        " – bobsleigh   ": null
    },
    {
        "Piste de Luge": "villard-de-lans"
    },
    {
        " – luge   ": null
    },
    {
        "Recoin de Chamrousse": "chamrousse"
    },
    {
        " – alpine skiing   ": null
    },
    {
        "Saint-Nizier-du-Moucherotte": "saint-nizier-du-moucherotte"
    },
    {
        " – ski jumping   ": null
    },
    {
        "Olympic Stadium ": "olympic stadium"
    },
    {
        " – opening ceremonies     There were five other venues surrounding Grenoble used as sporting venues for the Olympic Games in 42 Like never before seen at a Winter Olympic Games, the venues were divided into four different places. Grenoble set a new trend by having venues in different parts of the surrounding area. Before it was common place to have all the venues together. Compared to the investments for the infrastructure, the investments for building sports arenas was very small. This investment only contributed nine percent.     Almost half of this investment, 42 million Francs, was used to build the new ice rink Stade de glace , and where group As ": null
    },
    {
        "ice hockey": "ice hockey"
    },
    {
        " matches, the figure skating competition and the closing ceremony all took place. The arena has 42 seats and is situated in Parc Paul Mistral, Grenobles town park located in the centre of the city. The architects were Robert Demartini and Pierre Junillon. Construction began in mid-November 42 and finished in October 42 The roof was made of two cylindrical which crossed over each other, four columns which could support 42 tonnes. Today the arena is used for concerts, fairs and various other sporting events      Less than 42m away from the Stade de glace, and also in Parc Paul Mistral, the 42m track for the ": null
    },
    {
        "speed skating": "speed skating"
    },
    {
        " events was installed between February and November 42 The venue Patinoire de vitesse which does not have a roof and in the middle of it has a practice ice-rink, had a capacity of 42. The cooling system was removed after a few years and today the concrete track is used by ": null
    },
    {
        "roller skaters": "roller skating"
    },
    {
        ". The only ready venue was the citys ice-rink patinoire municipale, which opened in September 42 next to the speed skating track, where the 42 Figure Skating European Championship took place. The arena, which has 42 seats and 42 can stand, was the venue for Group Bs ice hockey matches.     The venue for the ": null
    },
    {
        "alpine skiing": "alpine skiing"
    },
    {
        " took place in ": null
    },
    {
        "Chamrousse": "chamrousse"
    },
    {
        ", a town 42 kilometres east of Grenoble. The finishing line for five out of the six races was in the region of Recoin de Chamrousse, the other was the mens downhill event was in Casserousse. In the construction of the new ski slopes around 42m³ of rocks had to be blown up or dug away, particularly large movements of the earth and changes to the terrain were necessary in the upper part of the mens downhill section and in the slalom section. In addition six new chairlifts were installed. In the preparation of the slopes over 42 people were needed, this consisted mainly of soldiers.     In ": null
    },
    {
        "Autrans": "autrans"
    },
    {
        ", 42 kilometres west of Grenoble in ": null
    },
    {
        "Vercors Massif": "vercors massif"
    },
    {
        ", the ": null
    },
    {
        "cross-country skiing": "cross-country skiing"
    },
    {
        " event and ": null
    },
    {
        "biathlon": "biathlon"
    },
    {
        " took place there. Provisional stands at the finish line were available for spectators, which were to the north and southwest of the village. Also in Autrans, the ": null
    },
    {
        "ski jumping": "ski jumping"
    },
    {
        " in the normal hill took place. The ski jumping hill of Le Claret is still in use today. It originally had a ": null
    },
    {
        "hill size": "hill size"
    },
    {
        " of 42m, but later was made bigger and now measures 42m high.     The 42m hill could have been built without any problems in Autrans, but the organisers decided instead to use ": null
    },
    {
        "Saint-Nizier-du-Moucherotte": "saint-nizier-du-moucherotte"
    },
    {
        ", 42 kilometres away from Grenoble, as well as Vercors-Massif. The relatively small distance to the city and the better accessibility guaranteed a larger audience. The construction period lasted from July 42 to January 42 After the games the Dauphine hill was only rarely used for competitions and since 42 it closed down and fell into ruin. A third Olympic venue in the Vercors-Massif was Villard-de-Lens, 42 kilometres from Grenoble, where the luge competition took place. The track is exactly 42m long, has 42 curves and has a drop of 42m. After it temporarily closed down in 42 it was remodelled. Today it now has an artificial surface which makes it possible to use all-year-round. It is no longer used for competitions.     The third Olympic venue in Vercors Massif was 42  km away from Grenoble in the commune of ": null
    },
    {
        "Villard-de-Lans": "villard-de-lans"
    },
    {
        ", where the ": null
    },
    {
        "luge": "luge"
    },
    {
        " competition took place. The track for the luge was exactly 42  km long, had 42 corners and had a drop of 42m. After the track was temporarily closed in 42 it was rebuilt at todays location. It has an artificial surface, which makes using the track all year round possible. For competitions it is no longer used.     The furthest distance, which is also the highest, is ": null
    },
    {
        "LAlpe dHuez": "alpe dhuez"
    },
    {
        ", 42 kilometres southeast of Grenoble. The ": null
    },
    {
        "bobsleigh": "bobsleigh"
    },
    {
        " took place at Col de Poutran at a height of around 42m. It was 42m long, had 42 corners and had a drop of 42m. It was principally a natural course but three of the corners were exposed to direct sunlight and was kept artificially frozen by ammonia and liquid nitrogen. In LAlpe dHuez a replacement course was made available for the alpine skiing.          The ": null
    },
    {
        "Olympic village": "olympic village"
    },
    {
        " was located in the southern part of the city on the border with the suburbs of ": null
    },
    {
        "Échirolles": "échirolles"
    },
    {
        " and ": null
    },
    {
        "Eybens": "eybens"
    },
    {
        ". On the site of the former airport Grenoble-Mermoz, a large ": null
    },
    {
        "housing estate": "housing estate"
    },
    {
        " with 42 rooms was built in two years. A primary school, a secondary school, a nursery, a youth centre, a shopping centre and a library were all built as part of the construction of the housing estate. All of these were still in use after the Olympic Games. The male athletes were housed in a tower block and in eleven apartment blocks. The female athletes lived in a building with 42 individual rooms, which later went on to serve as a home for workers. In other buildings on the estate housed around 42 trainers, officials, timekeepers, volunteers, police and drivers. The catering took plate in a future school kitchen. Two more, much smaller Olympic villages were available to the Nordic and Alpine skiers as well as their physios. Holiday homes were also newly built and were located in Autrans and Chamrousse. One year before the Olympics, at the pre-Olympic competitions there was great adversity. The accommodation did not meet the necessary standards, so much so the Austrian team left. This led the hosts to have a rethink and make improvements.       There were 42 events contested in 42 sports .                             In Grenoble, there was 42 athletes and 42 teams, which was a new record in terms of the number of participants. This was Moroccos first appearance at the Winter Olympics.            Similar to the Summer Olympics 42 when ": null
    },
    {
        "Saarland": "saarland"
    },
    {
        " who had ": null
    },
    {
        "sent its own team": "saar at the 1952 summer olympics"
    },
    {
        " but had not been integrated as a part of West Germany, there were two teams participating from Germany.     For the first time, the ": null
    },
    {
        "German Democratic Republic": "east germany"
    },
    {
        " was present with its own team. It was provisionally accepted into the IOC, so long as East Germany formed a ": null
    },
    {
        "complete German team": "united team of germany"
    },
    {
        " consisting of athletes from both the West and East. This had to be done under the leadership of the National Olympic Committee for Germany, a board recognised by the IOC. Following on from this the National Olympic Committee of East Germany tried to achieve complete recognition. This did not work out because of resistance from ": null
    },
    {
        "Karl Ritter von Halt": "karl ritter von halt"
    },
    {
        ", the president of the National Olympic Committee for Germany, who was close friends with the IOC president ": null
    },
    {
        "Avery Brundage": "avery brundage"
    },
    {
        ". After Halt died in 42 the same year that the ": null
    },
    {
        "Berlin Wall": "berlin wall"
    },
    {
        " was built, under his successor Willi Daume the close contact with the IOC leadership was lost. In addition the reality of the split made the qualification almost impossible. On 42 October 42 the IOC decided to accept East Germany as a full member. In order to avoid existing restrictions concerning ": null
    },
    {
        "NATO": "nato"
    },
    {
        " countries, such as the ban on all East German symbols, in particular the flag with socialist symbols introduced in 42 both national olympic committees agreed on using the same flag and anthem. The black-red-gold flag with the white Olympic rings in the middle of it has been used at all Olympic Games since 42 as well as the replacement anthem Ode an die Freude  from Beethovens 42th symphony, which was used previously. Both countries presented themselves as completely independent from 42     On 42 January 42 Ralph Pöhland, who was 42 was one of the most famous East German winter olympians, fled to West Germany after the pre-Olympic tournament at Les Bioux, Switzerland. His assistant in helping to flee was Georg Thoma, a West German ski jumper. This incident lead to relationships between the two German teams turning sour, which never used to be the case.                           These are the top ten nations that won medals at the 42 Winter Games.          For the Olympic Winter Games in Grenoble, in total 42 gold, silver and bronze medals were manufactured. They were designed by ": null
    },
    {
        "Roger Excoffon": "roger excoffon"
    },
    {
        " and was coined by the French ": null
    },
    {
        "minting company": "mint"
    },
    {
        " Monnaie de Paris": "monnaie de paris"
    },
    {
        ". For the first time in Olympic history, the medals, given out for the winners in every sport, had their own design. The logo of the games was depicted on the front of the medal and on the other was a ": null
    },
    {
        "pictogram": "pictogram"
    },
    {
        " etched into the surface, that depicted the sport the medal winner competed in. The medals had an diameter of  and were  thick. The gold and silver medals consisted of ": null
    },
    {
        "silver": "silver"
    },
    {
        " with a composition of 42/42 but the gold medals were coated in an additional six grams of ": null
    },
    {
        "gold": "gold"
    },
    {
        ". The medals hang of ribbons in the Olympic colours, which happened to also be a first, before 42 they had used chains. In addition, the athletes received a box made of black leather, which was lined with either white, blue or red silk.        The commemoration medal was designed by Josette Hébert-Coeffin. The front side of the medal depicted the decorated head of a Greek athlete with snowflakes and ice crystals in the background. The other side of the medal depicted the silhouette of Grenoble in front of the mountain range Belladonne. There were three different types of medals. 42 were made of silver, 42 of silver-coated bronze and 42 of bronze.     Excoffon also designed the Olympic diplomas, which were given to the six best athletes in each discipline. They were made of cream coloured parchment paper. Around the logo contained the words X es Jeux Olympiques dHiver Grenoble 42 as well as the Olympic motto - ": null
    },
    {
        "Citius, altius, fortius": "citius, altius, fortius"
    },
    {
        ", meaning quicker, higher, stronger. In the middle of the paper, the word Diplome was written in gold writing. However, similar diplome were handed out to officials, participants, journalists and volunteers on ordinary white paper and without the gold writing as a souvenir.     The medal ceremony took place in the evening of the finals event in the Stade de glace.       Compared to the ": null
    },
    {
        "Winter Olympics in 42": "1964 winter olympics"
    },
    {
        " in ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        ", the number of disciplines increased to 42 the mens biathlon relay was also added.     On 42 February, two days before the official opening ceremony, three ice hockey preliminary matches took place, in order to place three further teams into Group A alongside the five teams already assigned to the group. The losers were placed into Group B.                     For the opening ceremony, a temporary stadium was built supported by scaffolding and was able to hold 42 spectators. The Stade inaugural was situated in the immediate vicinity to the Olympic Village and press centre. At the back of the stadium there was a steel scaffold which kept host to the Olympic flame, located in a 42m wide bowl at the top, which also was able to take 42  kg in weight. There was also stairs leading to the top, containing 42 flights.     The ceremony began on 42 February at 42pm, a Tuesday, with the French president ": null
    },
    {
        "Charles de Gaulle": "charles de gaulle"
    },
    {
        " in attendance. Among the 42 invited guests of honour was IOC president ": null
    },
    {
        "Avery Brundage": "avery brundage"
    },
    {
        ", the Irani empress ": null
    },
    {
        "Farah Pahlavi": "farah pahlavi"
    },
    {
        ", the Danish Crown Princess ": null
    },
    {
        "Margrethe": "margrethe ii of denmark"
    },
    {
        " and the Grand Duchess of Luxembourg ": null
    },
    {
        "Josephine Charlotte.": "princess joséphine charlotte of belgium"
    },
    {
        " After the ": null
    },
    {
        "Marseillaise": "la marseillaise"
    },
    {
        " was sung, the French national anthem, cultural performances followed.     The procession of the athletes into the stadium was traditionally led by the Greek team. The other teams proceeded into the stadium in alphabetical order, starting with West Germany and then East Germany . The last team out was the hosts, the French team. Albert Michallon, president of COJO, said in his speech that all athletes and visitors are welcome. Brundage again recollected ": null
    },
    {
        "Pierre de Coubertin": "pierre de coubertin"
    },
    {
        "s ideals and expressed the hope of these ideals lead to a peaceful and less materialistic world. He invited Charles de Gaulle to open the Games. De Gaulle appeared on the stage and read out the opening set-phrase.     42 ": null
    },
    {
        "Chasseurs Alpins": "chasseurs alpins"
    },
    {
        " soldiers carried the Olympic flag into the stadium and put it up. The organisers had decided against the usual tradition of letting the peace dove fly. Instead they let out 42 small Olympic flags on paper parachutes and 42 perfumed artificial roses from three helicopters over the stadium. Following this, the figure skater ": null
    },
    {
        "Alain Calmat": "alain calmat"
    },
    {
        " was the last torch bearer to enter the stadium. He climbed up the steps to the bowl, where his heartbeat amplified over the loudspeakers. Once at the top, he lit the Olympic flame.     Shortly afterwards, skier ": null
    },
    {
        "Leo Lacroix": "léo lacroix"
    },
    {
        " read out the ": null
    },
    {
        "Olympic oath": "olympic oath"
    },
    {
        ". At the end, the ": null
    },
    {
        "Patrouille de France": "patrouille de france"
    },
    {
        ", the aerobatic flight display team, flew over the stadium and marked out the colours of the Olympic rings with their vapour trails in the sky.          The Winter Olympics ended on 42 February, on a Sunday evening, with the closing ceremony in the  Stade de glace . The first highlight showed the figure skaters putting on an exhibition skating session. It also included ice dancing, an event that was first introduced into the main programme in 42 The best ten partners from the last World championship took part in the event and there was no scores. After that the last award ceremonies then took place.     After the Marseillaise was played, all athletes who were still in Grenoble reassembled onto the ice and the flag bearers formed a semi-circle. Whilst the flags of Greece, France and next host Japan were put up, a torch bearer brought the Olympic flame into the stadium and ignited it into a bowl on the ice. IOC president Avery Brundage thanked the organisers and declared the games over. When the Olympic flag was pulled down, gun salutes were heard all across the town and finally the flame went out.                 At the age of 42 years and 42 days, the Romanian figure skater Beatrice Huștiu became the youngest female participant at these Winter Games. She took part in the singles event and finished in 42th place, which was 42rd from bottom. The youngest male participant was aged 42 years and 42 days. He was also a figure skater called ": null
    },
    {
        "Jan Hoffmann": "jan hoffmann"
    },
    {
        ", who represented East Germany. In Grenoble he finished in 42th place and was also 42rd from bottom. In 42 and 42 he became world champion and also in 42 he won silver in the Olympic Games at Lake Placid.     The American speed skater ": null
    },
    {
        "Dianne Holum": "dianne holum"
    },
    {
        " was the youngest medal winner. She won silver in the 42m event at the age of 42 years and 42 days. Two days later she added a bronze by competing in the 42m event. The youngest gold medal winner was also from the USA: She was figure skater ": null
    },
    {
        "Peggy Fleming": "peggy fleming"
    },
    {
        ", who won at the age of 42 years and 42 days.     The oldest medal winner and at the same time oldest gold medal winner was the Italian ": null
    },
    {
        "Eugenio Monti": "eugenio monti"
    },
    {
        ": He won the gold medal in the four man bobsleigh team at the age of 42 years and 42 days. Five days before that he had also won the two man bobsleigh team gold medal.       The public became more and more aware of the ": null
    },
    {
        "doping issue": "doping in sport"
    },
    {
        " during the 42s. The first death caused by doping at the Olympic Games happened in 42 in ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", when the Danish cyclist Knut Enemark Jensen, who took ": null
    },
    {
        "amphetamines": "amphetamines"
    },
    {
        ", fell off his bike and died. This took a further four years until the IOC recognised the seriousness of the situation and created a medical commission. In 42 the IOC followed the example set by other sport associations and proclaimed a ban on doping. For the first time, doping control was carried out at the 42 Winter Olympics. The IOC tested 42 athletes but all the tests came back negative.     Also in 42 the IOC decided to carry out gender controls, in order to prevent ": null
    },
    {
        "hermaphrodites": "hermaphrodites"
    },
    {
        " from competing at womens competitions. Multiple female athletes from Eastern Europe immediately retired after the IOC had decided this, which led to a lot of speculation. ": null
    },
    {
        "Erik Schinegger": "erik schinegger"
    },
    {
        ", the female downhill 42 world champion from Austria, was tested a couple of days before the Winter Games in 42 it turned out she was actually a man. Schinegger, whose gender had not been correctly identified for years because she had internal male sex organs, decided to have the operation and changed her first name from Erika to Erik.       The media representatives lived in an apartment complex that was built between April 42 and October 42 a few hundred meters away from the Olympic village in Malherbe, a central part of Grenoble. The complex consisted of seven eight to ten floored towers totalling 42 flats, an underground car park and a school. The school housed an ": null
    },
    {
        "IBM": "ibm"
    },
    {
        " computer center, a copy center, the studios of the French radio and TV broadcaster ": null
    },
    {
        "ORTF": "office de radiodiffusion télévision française"
    },
    {
        " and broadcasters from other countries, photo laboratories and other technical amenities. The offices of the newspaper and photo journalists, of the technicians and of the general administration were situated on the bottom floors of the towers, the other floors served as accommodation. The press restaurant was later used as a car park. There were also smaller press centers in the Stade de glace in Grenoble and at the five other venues in Autrans, Chamrousse, LAlpe dHuez, Saint-Nizier-du-Moucherotte and Villard-de-Lans.     The organising committee COJO assigned 42 accreditations to the following people. 42 went to press, radio and television journalists, 42 to photographers and 42 to other unnamed groups. On 42 September 42 COJO signed an exclusive contract with ORTF for the provision of broadcasting on the television to EBUs catchment area and to Canada. On 42 February 42 the ": null
    },
    {
        "American Broadcasting Company": "american broadcasting company"
    },
    {
        " received the exclusive broadcasting rights for the US and Latin America. On 42 October 42 ": null
    },
    {
        "NHK": "nhk"
    },
    {
        " received the rights to broadcast in Japan.     For the first time in the history of the Olympic Games, the Games were transmitted in colour. ORTF installed 42 colour and 42 black and white cameras . The total broadcasting time lasted 42 hours and 42mins, 42 hours and 42 mins were in colour. The total number of viewers was recorded at 42 million,     Concerning the question of scoring the mens freestyle figure skating and the unfortunate circumstances of the mens slalom, the ": null
    },
    {
        "Bild am Sonntag": "bild am sonntag"
    },
    {
        " published the title Am Ende kam der große Krach . The ": null
    },
    {
        "Münchner Merkur": "münchner merkur"
    }
]