[
    {
        "      The decade of the 42s in film involved many significant films.          Asian cinema of the 42s catered to the rising middle class fantasies and struggles. In the ": null
    },
    {
        "Bollywood": "bollywood"
    },
    {
        " cinema of India this was epitomized by the films of ": null
    },
    {
        "Amitabh Bachchan": "amitabh bachchan"
    },
    {
        ". These films portrayed adventurous plots with car chase trying to imitate Hollywood films like  The French Connection , presented music with Disco beats and also presented the young middle class man as an angry young man . The women on the other hand were shown as ones who have adopted western values and outfits especially by heroines like ": null
    },
    {
        "Parveen Babi": "parveen babi"
    },
    {
        "  and ": null
    },
    {
        "Zeenat Aman": "zeenat aman"
    },
    {
        ". However towards the very end of the 42s, especially after the steep rise in land prices in urban areas and the decline in employment security, the heroines were seen more often as ": null
    },
    {
        "saree": "saree"
    },
    {
        "-women striving to have a prosperous middle-class family especially heroines like ": null
    },
    {
        "Jaya Prada": "jaya prada"
    },
    {
        " and ": null
    },
    {
        "Hema Malini": "hema malini"
    },
    {
        ". In this way, the cinema of Asian region becomes a ": null
    },
    {
        "sociological": "sociological"
    },
    {
        " statement of the ": null
    },
    {
        "social-economic": "social-economic"
    },
    {
        " times of the region and its people. In ": null
    },
    {
        "Malayalam cinema": "malayalam cinema"
    },
    {
        ", ": null
    },
    {
        "Adoor Gopalakrishnan": "adoor gopalakrishnan"
    },
    {
        " made Swayamvaram in 42 which got wide critical acclaim. This was followed by the film Nirmalyam by ": null
    },
    {
        "M. T. Vasudevan Nair": "m. t. vasudevan nair"
    },
    {
        " in 42     Another Asian touchstone beginning in the early 42s was traditional ": null
    },
    {
        "Hong Kong martial arts film": "hong kong martial arts film"
    },
    {
        " which sparked a greater interest in Chinese martial arts to the West. ": null
    },
    {
        "Martial arts film": "martial arts film"
    },
    {
        " reached the peak of its popularity largely in part due to its greatest icon, ": null
    },
    {
        "Bruce Lee": "bruce lee"
    },
    {
        ". His films elevated the genre to a new level and sparked a greater interest in martial arts in the West. Lee became famous for playing ": null
    },
    {
        "Kato": "kato"
    },
    {
        " in the ": null
    },
    {
        "TV series The Green Hornet": "the green hornet"
    },
    {
        " during the 42s yet it was when he returned to Hong Kong and starred in three films that shot him to stardom all over Asia,  The Big Boss  ,  Fist of Fury  and  Way of the Dragon  . Yet he achieved global stardom in his last completed film and the first ": null
    },
    {
        "Kung fu": "kung fu"
    },
    {
        " film to be produced by a Hollywood studio,  Enter the Dragon  .          In ": null
    },
    {
        "European cinema": "european cinema"
    },
    {
        ", the failure of the ": null
    },
    {
        "Prague Spring": "prague spring"
    },
    {
        " brought about nostalgic motion pictures reminiscent of the ones that celebrate the 42s itself. These films expressed a yearning and as a premonition to the decade and its dreams. The ": null
    },
    {
        "Hungarian": "hungary"
    },
    {
        " director ": null
    },
    {
        "István Szabó": "istván szabó"
    },
    {
        " made the motion picture  Szerelmesfilm  , which is a nostalgic portrayal and a premonition of the fading of the young 42s ethos of change and a friendlier social structure. The Italian director ": null
    },
    {
        "Bernardo Bertolucci": "bernardo bertolucci"
    },
    {
        " made the motion picture  The Conformist  . German films after the war asked existential questions especially the works of ": null
    },
    {
        "Rainer Fassbinder": "rainer fassbinder"
    },
    {
        ". The films of the ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " director ": null
    },
    {
        "Ingmar Bergman": "ingmar bergman"
    },
    {
        " reached a new level of expression in motion pictures like  Cries and Whispers  . Young German directors made films that came to be known as the ": null
    },
    {
        "German new wave": "german new wave"
    },
    {
        ". It was the voice of a new generation that had grown up after the second world war. These included directors like ": null
    },
    {
        "Wim Wenders": "wim wenders"
    },
    {
        ", ": null
    },
    {
        "Hans-Jürgen Syberberg": "hans-jürgen syberberg"
    },
    {
        " and ": null
    },
    {
        "Werner Herzog": "werner herzog"
    },
    {
        ".          The decade opened with ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        " facing a financial slump, reflecting the monetary woes of the nation as a whole during the first half of the decade. Despite this, the 42s proved to be a benchmark decade in the development of cinema, both as an art form and as a business. With young filmmakers taking greater risks and restrictions regarding language and sexuality lifting, Hollywood produced some of its most critically acclaimed and financially successful films since its ": null
    },
    {
        "golden era": "cinema of the united statesgolden age of hollywood"
    },
    {
        ".     In the years previous to 42 Hollywood had begun to cater to the younger generation with films such as  The Graduate . This proved a folly when anti-war films like  R. P. M.  and  The Strawberry Statement  became major box-office flops. Even solid films with ": null
    },
    {
        "bankable star": "bankable star"
    },
    {
        "s, like the ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        " epic  Tora! Tora! Tora! , flopped, leaving studios in dire straits financially. Unable to repay financiers, studios began selling off land, furniture, clothing, and sets acquired over years of production. Nostalgic fans bid on merchandise and collectibles ranging from ": null
    },
    {
        "Judy Garland": "judy garland"
    },
    {
        "s ": null
    },
    {
        "sparkling red shoes": "ruby slippers"
    },
    {
        " to ": null
    },
    {
        "MGMs": "metro-goldwyn-mayer"
    },
    {
        " own back lots.     More of the successful films were those based in the harsh truths of war, rather than the excesses of the 42s. Films like the ": null
    },
    {
        "Francis Ford Coppola": "francis ford coppola"
    },
    {
        "-scripted  Patton , starring ": null
    },
    {
        "George C. Scott": "george c. scott"
    },
    {
        " as the World War II general, and ": null
    },
    {
        "Robert Altman": "robert altman"
    },
    {
        "s  MASH , about a ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        " field hospital, were major box-office draws in 42 Honest, old-fashioned films like  Summer of 42 , and the ": null
    },
    {
        "Erich Segal": "erich segal"
    },
    {
        " adaptation,  Love Story , were commercial and critical hits. .     One of the most insightful films of the decade came from the mind of a Hollywood outsider, Czechoslovakian director ": null
    },
    {
        "Miloš Forman": "miloš forman"
    },
    {
        ", whose  Taking Off  became a bold reflection of life at the beginning of the 42s. The 42 film satirized the American middle class, following a young girl who runs away from home, leaving her parents free to explore life for the first time in years. While the film was never given a wide release in America, it became a major critical achievement both in America and around the world .     ": null
    },
    {
        "Sean Connery": "sean connery"
    },
    {
        " returned to the role of ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        " in 42 in  Diamonds Are Forever  after ": null
    },
    {
        "George Lazenby": "george lazenby"
    },
    {
        " filled the role in 42 ": null
    },
    {
        "Roger Moore": "roger moore"
    },
    {
        " succeeded Connery in 42 with an adaptation of ": null
    },
    {
        "Ian Fleming": "ian fleming"
    },
    {
        "s  Live and Let Die  which was the most successful of his Bond films in terms of admissions.  Live and Let Die  was followed by an adaptation of  The Man with the Golden Gun  in 42 which at the time garnered the lowest box office taking of any Bond film before it. After its release ": null
    },
    {
        "Harry Saltzman": "harry saltzman"
    },
    {
        " co-owner of ": null
    },
    {
        "Danjaq": "danjaq"
    },
    {
        " with ": null
    },
    {
        "Albert R. Broccoli": "albert r. broccoli"
    },
    {
        " sold his half to ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        " causing a three-year gap until the next Bond film, the longest gap since the start of the franchise in 42 The series picked up again in 42 with  The Spy Who Loved Me  and ended the decade with  Moonraker  in 42 which was the highest grossing Bond film of all time until  GoldenEye  in 42     An adaptation of an ": null
    },
    {
        "Arthur Hailey": "arthur hailey"
    },
    {
        " novel would prove to be one of the most notable films of 42 and would set the stage for a major trend in 42s cinema. The film,  Airport , featured a complex plot, characters, and an all-star cast of Hollywood A-listers and legends. Airport followed an airport manager trying to keep a fictional ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " airport operational during a blizzard, as well as a bomb plot to blow up an airplane. The film was a major critical and financial success, helping pull ": null
    },
    {
        "Universal Studios": "universal studios"
    },
    {
        " into the black for the year. The film earned senior actress ": null
    },
    {
        "Helen Hayes": "helen hayes"
    },
    {
        " an Oscar for ": null
    },
    {
        "Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        " and garnered many other nominations in both technical and talent categories. The success of the film launched several other ": null
    },
    {
        "disaster film": "disaster film"
    },
    {
        "s, many of which following the same blueprint of major stars, a melodramatic script, and great suspense.     Three Airport sequels followed in 42 42 and 42 each successor making less money than the last. 42 brought  The Poseidon Adventure , which starred a young ": null
    },
    {
        "Gene Hackman": "gene hackman"
    },
    {
        " leading an all-star cast to safety in a capsized luxury liner. The film earned an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " for visual effects , as well as numerous nominations, including one for its notable supporting star, ": null
    },
    {
        "Shelley Winters": "shelley winters"
    },
    {
        ", but its sequel in 42 was far less successful.  The Towering Inferno  teamed ": null
    },
    {
        "Steve McQueen": "steve mcqueen"
    },
    {
        " and ": null
    },
    {
        "Paul Newman": "paul newman"
    },
    {
        " against a fire in a San Francisco skyscraper. The film cost a whopping $42 million to produce , and won Academy Awards for Cinematography, Film Editing, and Best Original Song. The same year, the epic  Earthquake  featured questionable effects to achieve a destructive 42 earthquake in Los Angeles. Despite this, the film was one of the most successful of its time, earning $42 million at box office. By the late 42s, the novelty had worn off and the disasters had become less exciting. 42 brought a terrorist targeting a  Rollercoaster , 42 a  Swarm  of bees, and a less-than-threatening  Meteor  in 42     The early 42s also brought a rebirth of gritty crime film, three years after the influential  Bullitt . ": null
    },
    {
        "William Friedkin": "william friedkin"
    },
    {
        "s  The French Connection , starring ": null
    },
    {
        "Gene Hackman": "gene hackman"
    },
    {
        " as a drug detective and ": null
    },
    {
        "Sidney Lumet": "sidney lumet"
    },
    {
        "s  Serpico , starring ": null
    },
    {
        "Al Pacino": "al pacino"
    },
    {
        " in the true-life story of an honest cop who fought corruption, were two of the most famous ones. Films like  Get Carter  featured gratuitous nudity, while ": null
    },
    {
        "Stanley Kubrick": "stanley kubrick"
    },
    {
        "s groundbreaking  A Clockwork Orange  featured much physical and sexual violence to complement its complex story. ": null
    },
    {
        "African American": "african american"
    },
    {
        " filmmakers also found success in the 42s with such hits as  Shaft  and  Sweet Sweetbacks Baadasssss Song . Like other sequels in the 42s, Shaft went on to have two more adventures, each less successful than the last.     An adaptation of a ": null
    },
    {
        "Mario Puzo": "mario puzo"
    },
    {
        " novel,  The Godfather , was a box-office and critical success in 42 The three-hour epic followed a Mafia boss, played by ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        ", through his life of crime. Beyond the violence and drama were themes of love, pride, and greed. The Godfather went on to earn $42 million at American box office, and $42 million throughout the world, becoming the highest-grossing film of all time. It won Academy Awards for Best Picture, Best Actor, and Best Screenplay. Its director ": null
    },
    {
        "Francis Ford Coppola": "francis ford coppola"
    },
    {
        " was passed over in favor of ": null
    },
    {
        "Bob Fosse": "bob fosse"
    },
    {
        " and his musical,  Cabaret , which also earned an Oscar for its star, ": null
    },
    {
        "Liza Minnelli": "liza minnelli"
    },
    {
        ".  The Godfather Part II  followed in 42 with roughly the same principal cast and crew, earning Oscars for star ": null
    },
    {
        "Robert De Niro": "robert de niro"
    },
    {
        ", its director, composer, screenwriters and art directors. The film also earned the Best Picture Oscar for that year.     Not all of the street smart urban related films were 42% live action. Director ": null
    },
    {
        "Ralph Bakshi": "ralph bakshi"
    },
    {
        " released the first animated full-length feature specifically oriented towards adults  then moved on to two other features that dealt with the mafia and other ethnic-related urban issues. Both  Heavy Traffic  and  Coonskin  would prove that this kind of material could be handled effectively in the animation genre. Bakshi would later produce fantasy oriented films  before the decade ended.     Inaugurated by the 42 ": null
    },
    {
        "release": "new andy warhol garrick theatre"
    },
    {
        " of ": null
    },
    {
        "Andy Warhol": "andy warhol"
    },
    {
        "  Blue Movie , the phenomenon of ": null
    },
    {
        "adult erotic films": "erotic art"
    },
    {
        " being publicly discussed by celebrities ,  and taken seriously by critics ,   a development referred to, by Ralph Blumenthal of  The New York Times , as ": null
    },
    {
        "porno chic": "golden age of porn  porno chic"
    },
    {
        " , and later known as the ": null
    },
    {
        "Golden Age of Porn": "golden age of porn"
    },
    {
        ", began, for the first time, in modern American culture.   According to award-winning author ": null
    },
    {
        "Toni Bentley": "toni bentley"
    },
    {
        ", ": null
    },
    {
        "Radley Metzger": "radley metzger"
    },
    {
        " 42 film  The Opening of Misty Beethoven , based on the play  Pygmalion  by ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        " , and due to attaining a mainstream level in storyline and sets,  is considered the crown jewel of this ": null
    },
    {
        "Golden Age": "golden age of porn"
    },
    {
        ".       In the middle 42s, films began to also reflect the disenfranchisement brought by the excesses of the past twenty years. A deeply unsettling look at alienation and city life, ": null
    },
    {
        "Martin Scorsese": "martin scorsese"
    },
    {
        "s  Taxi Driver  earned international praise, first at the ": null
    },
    {
        "Cannes Film Festival": "cannes film festival"
    },
    {
        " and then at the ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        ", where it was nominated for Best Leading Actor , Best Supporting Actress , Best Score , and Best Picture.  All the Presidents Men  dealt with the impeachment of ": null
    },
    {
        "Richard Nixon": "richard nixon"
    },
    {
        ", while Lumets  Network  portrayed greed and ": null
    },
    {
        "narcissism": "narcissism"
    },
    {
        " in both American society and television media. The film won Oscars for Best Actor , Best Actress , Best Supporting Actress , and Best Screenplay . Thanks to a stellar cast, experienced director, and a poignant story, Network became one of the largest critical successes of 42 Another film,  Rocky , about a clubhouse boxer  who is granted a world championship title fight won the Best Picture ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " that year. The film also became a major commercial success and spawned four sequels through the rest of the 42s and 42s.     Throughout the 42s, the horror film developed into a lucrative genre of film. It began in 42 with the terrifying  The Exorcist , directed by ": null
    },
    {
        "William Friedkin": "william friedkin"
    },
    {
        " and starring the young ": null
    },
    {
        "Linda Blair": "linda blair"
    },
    {
        ". The film saw massive success, and the first of several sequels was released in 42 42 brought the equally creepy suspense thriller,  Marathon Man , about a man who becomes the target of a former Nazi dentists torment after his brother dies. The same year, the ": null
    },
    {
        "Devil": "devil"
    },
    {
        " himself made an appearance in  The Omen , about the spawn of ": null
    },
    {
        "Satan": "satan"
    },
    {
        ". 42s  Halloween  was a precursor to the slasher films of the 42s and 42s with its psychopathic Michael Myers. Cult horror films were also popular in the 42s, such as ": null
    },
    {
        "Wes Craven": "wes craven"
    },
    {
        "s early gore films  Last House on the Left  and  The Hills Have Eyes , as well as ": null
    },
    {
        "Tobe Hooper": "tobe hooper"
    },
    {
        "s  The Texas Chain Saw Massacre .     The ": null
    },
    {
        "blockbuster": "blockbuster"
    },
    {
        " was born in 42 While The Exorcist was among the top five grossing films of the 42s, the first film given the blockbuster distinction was 42s  Jaws . Released on June 42 the film about a series of horrific deaths related to a massive great white shark was director ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        "s first big-budget Hollywood production, coming in at $42 million in cost. The film slowly grew in ticket sales and became one of the most profitable films of its time, ending with a $42 million gross in the United States alone. The film won Academy Awards for its skillful editing, chilling score, and sound recording. It was also nominated for Best Picture that year, though it lost to ": null
    },
    {
        "Miloš Forman": "miloš forman"
    },
    {
        "s  One Flew Over the Cuckoos Nest  . It spawned the successful sequel,  Jaws 42  in 42 which featured the same cast, but without ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        ". Another tailor-made blockbuster, ": null
    },
    {
        "Dino De Laurentiis": "dino de laurentiis"
    },
    {
        "  King Kong  was released, but to less than stellar success. King Kong did mark the first time a film was booked to theaters before a release date, a common practice today.     The massive success of Jaws was eclipsed just two years later by another legendary blockbuster and film franchise. The ": null
    },
    {
        "George Lucas": "george lucas"
    },
    {
        " science-fiction film  Star Wars  hit theater screens in May 42 and became a major hit, growing in ticket sales throughout the summer and the rest of the year. In time earning some $42 million, the good versus evil fantasy set in space was not soon surpassed. The films breathtaking visual effects won an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        ". The film also won for ": null
    },
    {
        "John Williams": "john williams"
    },
    {
        "s uplifting score, as well as art direction, costume design, film editing, and sound. Star Wars effectively removed any specter of studio bankruptcy that had haunted the studios since early in the decade. When a television film,  Star Wars Holiday Special , was released as a spin-off from Star Wars in 42; it failed to receive the status of the original film, and was deemed a flop. It would be two years until the Star Wars series would be revived with  The Empire Strikes Back . Another success in visual effects came the same year as Star Wars, with Spielbergs  Close Encounters of the Third Kind , another blockbuster and alien contact set in the wilderness. For the picture, Spielberg received his first Oscar nomination for directing. A year later the most iconic ": null
    },
    {
        "superhero": "superhero"
    },
    {
        " was brought to the screen in  Superman , who was portrayed by classically trained actor ": null
    },
    {
        "Christopher Reeve": "christopher reeve"
    },
    {
        ". It was met by resounding praise for strong performances and its epic scope which resulted in numerous sequels and is regarded as one of the greatest ": null
    },
    {
        "superhero film": "superhero film"
    },
    {
        "s ever made, beginning a new era of superhero films.     The success of ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        "s  Annie Hall  in 42 stirred a new trend in filmmaking. Annie Hall, a love story about a depressed comedian and a free-spirited woman, was followed with more sentimental films, including ": null
    },
    {
        "Neil Simon": "neil simon"
    },
    {
        "s  The Goodbye Girl ,  An Unmarried Woman  starring ": null
    },
    {
        "Jill Clayburgh": "jill clayburgh"
    },
    {
        ", the autobiographical ": null
    },
    {
        "Lillian Hellman": "lillian hellman"
    },
    {
        " story,  Julia , starring ": null
    },
    {
        "Jane Fonda": "jane fonda"
    },
    {
        " and ": null
    },
    {
        "Vanessa Redgrave": "vanessa redgrave"
    },
    {
        ", and 42s  Heaven Can Wait  and  International Velvet .     Younger audiences were also beginning to be the focus of cinema, after the huge blockbusters that had attracted them back to the theater. ": null
    },
    {
        "John Travolta": "john travolta"
    },
    {
        " became popular in the pop-culture landmark films,  Saturday Night Fever , which introduced Disco to middle America, and  Grease , which recalled the world of the 42s. Comedy was also given new life in the irreverent  Animal House , set on a college campus during the 42s.  Up in Smoke , starring ": null
    },
    {
        "Cheech & Chong": "cheech  &  chong"
    },
    {
        ", was another irreverent comedy about marijuana use became popular among teenagers. The new television comedy program, ": null
    },
    {
        "Saturday Night Live": "saturday night live"
    },
    {
        " , launched the careers of several of its comedians, such as ": null
    },
    {
        "Chevy Chase": "chevy chase"
    },
    {
        ", who co-starred in the 42 hit  Foul Play  with ": null
    },
    {
        "Goldie Hawn": "goldie hawn"
    },
    {
        ".     The decade closed with two films chronicling the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", ": null
    },
    {
        "Michael Cimino": "michael cimino"
    },
    {
        "s  The Deer Hunter  and ": null
    },
    {
        "Francis Ford Coppola": "francis ford coppola"
    },
    {
        "s  Apocalypse Now . Both films focused on the horrors of war and the psychological damage caused by such horrors. ": null
    },
    {
        "Christopher Walken": "christopher walken"
    },
    {
        " and director ": null
    },
    {
        "Michael Cimino": "michael cimino"
    },
    {
        " earned Oscars for their work on the film, which earned a Best Picture ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        ". ": null
    },
    {
        "Robert De Niro": "robert de niro"
    },
    {
        " and ": null
    },
    {
        "Meryl Streep": "meryl streep"
    },
    {
        " were also nominated for their work in  The Deer Hunter .  Apocalypse Now  won for cinematography and sound, and earned nominations for ": null
    },
    {
        "Robert Duvall": "robert duvall"
    },
    {
        " and Coppola. ": null
    },
    {
        "Hal Ashby": "hal ashby"
    },
    {
        "s  Coming Home  portrayed life for Vietnam veterans. Actor ": null
    },
    {
        "Jon Voight": "jon voight"
    },
    {
        " won an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " for his role in the film.     42 saw the poignant  Kramer vs. Kramer , the inspiring  Norma Rae , and the nuclear thriller,  The China Syndrome .  Alien  scared summer film-going audiences of 42 with its horrible monster from outer space, achieving similar success that Jaws had seen four years earlier. Meanwhile,  The Onion Field  and  ...And Justice for All  focused on the failures of the American judicial system. The year ended with Hal Ashbys subtle black comedy  Being There  and  The Muppet Movie , a family film based on the ": null
    },
    {
        "Jim Henson": "jim henson"
    },
    {
        " puppet characters.       The films in the 42s came in many different varieties, as the socially conscious directors that emerged in the late 42s grew in very different ways, influenced by music, literature, crime and war. The decade is most known for excelling in the crime-drama genre. The early part of the decade focused on increasingly realistic, gritty films, including ": null
    },
    {
        "Coppola": "francis ford coppola"
    },
    {
        "s first two  Godfather  pictures and ": null
    },
    {
        "Robert Altman": "robert altman"
    },
    {
        "s ": null
    },
    {
        "black comedy": "black comedy"
    },
    {
        "  MASH . A trend that lasted through the decade was the popularity of ": null
    },
    {
        "disaster film": "disaster film"
    },
    {
        "s, starting with  Airport  in 42 Another trend was the birth of the blockbuster horror film, initiated by ": null
    },
    {
        "William Friedkin": "william friedkin"
    },
    {
        "s  The Exorcist , which spawned numerous imitators. A pivotal moment in films was the release of ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        "s first blockbuster hit,  Jaws , which was considered to be the birth of the ": null
    },
    {
        "blockbuster": "blockbuster"
    },
    {
        " motion picture . The end of the decade saw two epic ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        " films, from directors ": null
    },
    {
        "Michael Cimino": "michael cimino"
    },
    {
        "  and Coppola .       ": null
    }
]