[
    {
        "              The 42 Australian constitutional crisis, also known simply as the Dismissal, has been described as the greatest political and ": null
    },
    {
        "constitutional crisis": "constitutional crisis"
    },
    {
        " in ": null
    },
    {
        "Australian history": "history of australia"
    },
    {
        ". It culminated on 42 November 42 with the dismissal from office of the Prime Minister, ": null
    },
    {
        "Gough Whitlam": "gough whitlam"
    },
    {
        " of the ": null
    },
    {
        "Australian Labor Party": "australian labor party"
    },
    {
        " , by ": null
    },
    {
        "Governor-General": "governor-general of australia"
    },
    {
        " Sir John Kerr": "john kerr"
    },
    {
        ", who then commissioned the ": null
    },
    {
        "Leader of the Opposition": "list of australian leaders of the opposition"
    },
    {
        ", ": null
    },
    {
        "Malcolm Fraser": "malcolm fraser"
    },
    {
        " of the ": null
    },
    {
        "Liberal Party": "liberal party of australia"
    },
    {
        ", as ": null
    },
    {
        "caretaker": "caretaker government"
    },
    {
        " Prime Minister.     ": null
    },
    {
        "Whitlams Labor government": "whitlam government"
    },
    {
        " had been elected in 42 with a small majority in the ": null
    },
    {
        "House of Representatives": "australian house of representatives"
    },
    {
        ", but with the ": null
    },
    {
        "Senate": "australian senate"
    },
    {
        " balance of power being held by the ": null
    },
    {
        "Democratic Labor Party": "democratic labor party"
    },
    {
        " who usually supported the ": null
    },
    {
        "Liberal-Country": "coalition"
    },
    {
        " Opposition. Another election in 42 resulted in little change. While the Whitlam Government introduced many new policies and programs, it was also rocked by scandals and political miscalculations. In October 42 the Opposition used its control of the Senate to defer passage of ": null
    },
    {
        "appropriation bill": "appropriation bill"
    },
    {
        "s , that had been passed by the House of Representatives. The Opposition stated that they would continue their stance unless Whitlam called an election for the House of Representatives, and urged Kerr to dismiss Whitlam unless he agreed to their demand. Whitlam believed that Kerr would not dismiss him, and Kerr did nothing to disabuse Whitlam of this notion.     On 42 November 42 Whitlam intended to call a half-Senate election in an attempt to break the deadlock. When he went to seek Kerrs approval of the election, Kerr instead dismissed him as Prime Minister and shortly thereafter installed Fraser in his place. Acting quickly before all ALP parliamentarians became aware of the change of government, Fraser and his allies were able to secure passage of the appropriation bills, and Kerr dissolved Parliament for a ": null
    },
    {
        "double dissolution": "double dissolution"
    },
    {
        " election. Fraser and his government were returned with a massive majority in the ": null
    },
    {
        "election held the following month": "1975 australian federal election"
    },
    {
        ".     The events of the Dismissal led to only minor constitutional change. The Senate retained its power to block supply, and the Governor-General the power to dismiss government ministers. However, these powers have not since been used to force a government from office. Kerr was widely criticised by Labor supporters for his actions, resigned early as Governor-General, and lived much of his remaining life abroad.                         As established by the Constitution of Australia, the ": null
    },
    {
        "Parliament of Australia": "parliament of australia"
    },
    {
        " is composed of two houses, the ": null
    },
    {
        "House of Representatives": "australian house of representatives"
    },
    {
        " and the ": null
    },
    {
        "Senate": "australian senate"
    },
    {
        ", together with the ": null
    },
    {
        "Queen": "monarchy of australia"
    },
    {
        ". The monarch is represented through the ": null
    },
    {
        "Governor-General": "governor-general of australia"
    },
    {
        ", who has executive powers granted in the Constitution, as well as rarely exercised ": null
    },
    {
        "reserve powers": "reserve powers"
    },
    {
        ". The reserve powers are the legal authorities remaining in the Crown after most of its historic powers were transferred to Parliament or to officials. The Governor-General is ordinarily bound by convention to act only upon the advice of the government and the ": null
    },
    {
        "Prime Minister": "prime minister of australia"
    },
    {
        ", but can act independently and against advice in exercising the reserve powers. The Governor-General is removable by the Queen on the advice of the Australian Prime Minister. As Liberal Party leader Malcolm Fraser, who would play a large part in the crisis, put it, The Queen has tenure, and she couldnt be sacked. But a Governor-General holds office at pleasure, and if he ceases to please then he can be removed by a Prime Minister.      As in most ": null
    },
    {
        "Westminster system": "westminster system"
    },
    {
        " parliaments, Australias government is ordinarily formed by the party enjoying the ": null
    },
    {
        "confidence": "confidence and supplyconfidence"
    },
    {
        " of the lower House of Parliament, the House of Representatives. However, Australias Parliament also has a powerful upper house, the Senate, which must pass any legislation initiated by the House of Representatives if it is to become law. The composition of the Senate, in which each state has an equal number of senators regardless of that states population, was originally designed to attract the Australian colonies into one Federation. The Constitution forbids the Senate to originate or amend a ": null
    },
    {
        "money bill": "money bill"
    },
    {
        ", but places no limitation on the Senates ability to defeat one. In 42 Gough Whitlam, as Leader of the Opposition, had stated of a budget bill, Let me make it clear at the outset that our opposition to this Budget is no mere formality. We intend to press our opposition by all available means on all related measures in both Houses. If the motion is defeated, we will vote against the Bills here and in the Senate. Our purpose is to destroy this Budget and destroy the Government which has sponsored it.      Prior to the 42 crisis, the Governor-Generals power to dismiss a Prime Minister against the incumbents will under Section 42 of the Constitution had never been exercised. Twice since Federation, conflicts between ": null
    },
    {
        "state premiers": "premiers of the australian states"
    },
    {
        " and ": null
    },
    {
        "state governors": "governors of the australian states"
    },
    {
        ", who perform analogous functions to the Prime Minister and Governor-General respectively at the state level, had resulted in the departure of one or the other. In 42 New South Wales Premier ": null
    },
    {
        "William Holman": "william holman"
    },
    {
        " was expelled from the ": null
    },
    {
        "Australian Labor Party": "australian labor party"
    },
    {
        " for supporting conscription. He managed to hold on to power with the aid of opposition parties and consulted the Governor, ": null
    },
    {
        "Sir Gerald Strickland": "gerald strickland, 1st baron strickland"
    },
    {
        ", proposing to pass legislation to extend the term of the ": null
    },
    {
        "lower house of the state legislature": "new south wales legislative assembly"
    },
    {
        " by a year. When Strickland objected, stating that such a course was unfair to Labor, Holman had him replaced. In 42 the New South Wales Labor Premier, ": null
    },
    {
        "Jack Lang": "jack lang"
    },
    {
        ", refused to pay money owed to the Federal government, which froze the states bank accounts, causing Lang to order that payments to the state government be only in cash. The governor, ": null
    },
    {
        "Sir Philip Game": "philip game"
    },
    {
        ", wrote to Lang, warning him that ministers were breaking the law, and that if they continued, he would have to obtain ministers who could carry on government within legal bounds. Lang replied that he would not resign, and ": null
    },
    {
        "Game dismissed his government": "lang dismissal crisis"
    },
    {
        " and commissioned the Leader of the Opposition, ": null
    },
    {
        "Bertram Stevens": "bertram stevens"
    },
    {
        ", to form a caretaker government pending a new election, in which Labor was defeated.     Among the powers granted to the Governor-General is the power to dissolve both houses of Parliament under Section 42 of the Constitution in the event that the House of Representatives twice passes a bill at least three months apart and the Senate refuses to pass it. In both instances where those circumstances arose prior to the Whitlam Government, in 42 and 42 the Governor-General dissolved Parliament for a ": null
    },
    {
        "double dissolution": "double dissolution"
    },
    {
        " election on the advice of the Prime Minister.       Gough Whitlams Labor government was ": null
    },
    {
        "elected in 42": "1972 australian federal election"
    },
    {
        " after 42 years of rule by ": null
    },
    {
        "a coalition": "coalition"
    },
    {
        " formed by the ": null
    },
    {
        "Liberal": "liberal party of australia"
    },
    {
        " and ": null
    },
    {
        "Country": "national party of australia"
    },
    {
        " parties. The ALP Government enjoyed a nine-seat majority in the House of Representatives, but did not control the Senate. In accordance with pre-election promises, it instituted a large number of policy changes, and offered much legislation. The Opposition, which still controlled the Senate, allowed some Government bills to pass the Senate, and blocked others.     In April 42 faced with attempts by the Opposition under ": null
    },
    {
        "Billy Snedden": "billy snedden"
    },
    {
        " to block supply in the Senate, Whitlam obtained the concurrence of the Governor-General, Sir ": null
    },
    {
        "Paul Hasluck": "paul hasluck"
    },
    {
        ", to a double dissolution. Labor was returned at the ": null
    },
    {
        "election on 42 May": "1974 australian federal election"
    },
    {
        " with a reduced House majority of five seats. The Coalition and Labor each had 42 Senate seats, with the balance of power held by two independents. Snedden would later tell author ": null
    },
    {
        "Graham Freudenberg": "graham freudenberg"
    },
    {
        " when being interviewed for the book A Certain Grandeur – Gough Whitlam in Politics: The pressure was on me from ": null
    },
    {
        "Anthony": "doug anthony"
    },
    {
        ". We thought you had a chance of getting control of the Senate at the half-Senate election or at least enough to get a redistribution through. With a ": null
    },
    {
        "gerrymander": "gerrymandering"
    },
    {
        ", youd be in forever.      Hasluck had been Governor-General since 42 and his term was shortly due to expire. Whitlam wanted him to remain a further two years, but Hasluck declined, citing ": null
    },
    {
        "his wife": "alexandra hasluck"
    },
    {
        "s refusal to remain at ": null
    },
    {
        "Yarralumla": "government house, canberra"
    },
    {
        " longer than the originally agreed five years. Whitlam offered the post to businessman ": null
    },
    {
        "Ken Myer": "ken myer"
    },
    {
        ", who turned it down. Whitlam then turned to ": null
    },
    {
        "Sir John Kerr": "john kerr"
    },
    {
        ", the Chief Justice of New South Wales. Kerr was reluctant to give up the Chief Justiceship, in which he intended to remain another ten years, for the Governor-Generals post, which traditionally lasted five years. At Kerrs request, Whitlam informally agreed that if both men were still in office in five years, Kerr would be reappointed. Whitlam also secured legislation to address Kerrs financial concerns about the position, including authorising a pension for the Governor-General or his widow. The Leader of the Opposition, ": null
    },
    {
        "Billy Snedden": "billy snedden"
    },
    {
        ", was enthusiastic about the appointment and also agreed to reappoint Kerr in five years, were he Prime Minister at the time. Kerr then agreed to take the post, was duly appointed by Queen ": null
    },
    {
        "Elizabeth  II": "elizabeth ii"
    },
    {
        ", and was sworn in on 42 July 42     Six of the bills that had been the subject of the double dissolution were introduced in Parliament a third time and, as expected, were again rejected by the Senate. Section 42 of the Constitution provides that, after a double dissolution election, if bills that had been rejected twice by the Senate in the previous parliament were again passed by the House and again rejected by the Senate, they could then be put to a ": null
    },
    {
        "joint sitting": "joint meetings of the australian parliament"
    },
    {
        " of both houses. On 42 July, Whitlam gained Kerrs agreement for a joint sitting, which was set for 42–42 August 42 ": null
    },
    {
        "The joint sitting": "joint sitting of the australian parliament of 1974"
    },
    {
        ", the only one in Australias history under Section 42 passed all six bills, including the enabling legislation for ": null
    },
    {
        "Medibank": "medibank"
    },
    {
        ".       In December 42 Whitlam was anxious to find new sources of money to finance his development plans. After a meeting at the Prime Ministers residence, ": null
    },
    {
        "The Lodge": "the lodge"
    },
    {
        ", Whitlam and three of his ministers  signed a letter of authority for Connor to borrow up to US$42 billion. This letter was described by author and journalist ": null
    },
    {
        "Alan Reid": "alan reid"
    },
    {
        " as the death warrant of the Whitlam ALP government .     Connor and other ministers had made contact with a hitherto obscure Pakistani financier, Tirath Khemlani, as early as November 42 Khemlani was said to have contacts in the newly enriched Arab oil nations. None of the efforts to secure a loan, whether through Khemlani or by other routes, bore fruit but, as information about the ": null
    },
    {
        "Loans Affair": "loans affair"
    },
    {
        " trickled out, the government lost support.     In February 42 Whitlam decided to appoint Senator Murphy a justice of the ": null
    },
    {
        "High Court of Australia": "high court of australia"
    },
    {
        ", even though Murphys Senate seat would not be up for election if a half-Senate election were held. Under proportional representation, Labor could win three of the five New South Wales seats, but if Murphys seat was also contested, it was most unlikely to win four out of six. Thus, appointing Murphy would almost certainly cost the ALP a Senate seat at the next half-Senate election. Whitlam appointed Murphy anyway. By convention, senators appointed by the state legislature to fill ": null
    },
    {
        "casual vacancies": "casual vacancies in the australian parliament"
    },
    {
        " were from the same political party as the former senator. The New South Wales premier, ": null
    },
    {
        "Tom Lewis": "tom lewis"
    },
    {
        ", a member of the Liberal Party, felt that this convention only applied to vacancies caused by deaths or ill-health, and arranged for the legislature to elect ": null
    },
    {
        "Cleaver Bunton": "cleaver bunton"
    },
    {
        ", former mayor of ": null
    },
    {
        "Albury": "albury"
    },
    {
        " and an independent.     By March 42 many Liberal parliamentarians felt that Snedden was doing an inadequate job as Leader of the Opposition and that Whitlam was dominating him in the House of Representatives. Malcolm Fraser ": null
    },
    {
        "challenged Snedden for the leadership": "liberal party of australia leadership spill, 1975"
    },
    {
        " on 42 March, and defeated him by 42 votes to 42 At a press conference after winning the leadership, Fraser stated:          Whitlams original deputy prime minister, ": null
    },
    {
        "Lance Barnard": "lance barnard"
    },
    {
        ", had been challenged and defeated for his post by Cairns in June 42 shortly after the ": null
    },
    {
        "May 42 election": "1974 australian federal election"
    },
    {
        ". Whitlam then offered Barnard a diplomatic post; in early 42 Barnard agreed to this. If the appointment went through, Barnards resignation from the House of Representatives would trigger ": null
    },
    {
        "a by-election": "1975 bass by-election"
    },
    {
        " in his Tasmanian electorate of ": null
    },
    {
        "Bass": "division of bass"
    },
    {
        ". ALP officials felt that, given the partys weakened state, Barnard should remain in Parliament and be given no preferment if he resigned; party president and future Prime Minister ": null
    },
    {
        "Bob Hawke": "bob hawke"
    },
    {
        " described the decision to appoint Barnard as an act of lunacy . Barnard had been losing support over the last several elections, and the Liberals needed only a swing of 42% to take Bass off Labor. The Liberals had a candidate, ": null
    },
    {
        "Kevin Newman": "kevin newman"
    },
    {
        ", who had been nursing the electorate; Labor had no candidate selected and a bitter preselection in the offing. Barnard resigned and was appointed the ambassador to Sweden. The election on 42 June proved a disaster for Labor, with Newman winning the seat on a swing of over 42%.     The next week, Whitlam fired Cairns for misleading Parliament regarding the Loans Affair amid innuendo about his relationship with his Principal Private Secretary, ": null
    },
    {
        "Junie Morosi": "junie morosi"
    },
    {
        ". He was replaced as deputy by ": null
    },
    {
        "Frank Crean": "frank crean"
    },
    {
        ". At the time of Cairns dismissal, one Senate seat was vacant, following the death on 42 June of Queensland ALP Senator ": null
    },
    {
        "Bertie Milliner": "bertie milliner"
    },
    {
        ". The state Labor party nominated ": null
    },
    {
        "Mal Colston": "mal colston"
    },
    {
        ", who was the highest unelected candidate on the partys Queensland list in 42 This resulted in deadlock in Brisbane; the unicameral Queensland legislature twice voted against Colston, and the party refused to submit any alternative candidates. Queensland Country Party Premier ": null
    },
    {
        "Joh Bjelke-Petersen": "joh bjelke-petersen"
    },
    {
        " had evidence that Colston, a schoolteacher by trade, had set a school on fire during a labour dispute, though the police had refused to prosecute. After the legislature voted Colston down a second time, Bjelke-Petersen instructed his majority in the legislature to elect a low-level union official, ": null
    },
    {
        "Albert Field": "albert field"
    },
    {
        ", who had contacted his office and expressed a willingness to serve. In interviews, Field made it clear he would not support Whitlam. Field was expelled from the ALP for standing against Colston, and Labor senators boycotted his swearing-in. Whitlam argued that because of the vacancies being filled as they were, the Senate was corrupted and tainted , with the Opposition enjoying a majority they did not win at the ballot box. When Labor learned that Field had not given the required three weeks notice to the ": null
    },
    {
        "Queensland Department of Education": "department of education and training"
    },
    {
        ", it challenged his appointment in the High Court, arguing that he was still technically a public servant & ndash;and thus ineligible to serve in the Senate. With Field on leave throughout the remainder of the crisis, the Coalition refused to provide a ": null
    },
    {
        "pair": "pair"
    },
    {
        " to account for his absence, giving it an effective majority of 42–42 in the Senate.              On 42 October, the High Court ruled that the act passed at the joint sitting that gave the ": null
    },
    {
        "Australian Capital Territory": "australian capital territory"
    },
    {
        " and the ": null
    },
    {
        "Northern Territory": "northern territory"
    },
    {
        " two senators each was valid. A half-Senate election needed to be held by June 42; most senators-elect would take their seats on 42 July, but the territorial senators and those filling Fields and Buntons seats would take their places at once. The ruling meant that it was possible for the ALP to gain a temporary majority in the Senate, at least until 42 July 42 To do so, the ALP would have to win Fields and Buntons seats, and one seat in each territory, and have the second ACT seat fall to either a Labor candidate or an independent, former Liberal Prime Minister ": null
    },
    {
        "John Gorton": "john gorton"
    },
    {
        ", now estranged from his party. If this happened, Labor would have an effective 42–42 margin, would be able to pass supply if that was still an issue, and also could pass ": null
    },
    {
        "electoral redistribution laws": "one vote, one value"
    },
    {
        " that would give it an advantage at the next election.     The journalist and author ": null
    },
    {
        "Alan Reid": "alan reid"
    },
    {
        " described the position of the Government and Opposition as the crisis became acute in mid-October:          In the wake of the High Court ruling, and with the appropriation bills due to be considered by the Senate on 42 October, Fraser was undecided whether to block supply. His biographer, Philip Ayres, contends that, had there been no further government scandals, he would not have done so. Khemlani, however, had alleged - contrary to government statements - that Connor had never revoked his authority to obtain loans and had been in regular contact with him even into mid42 On 42 October, the ": null
    },
    {
        "Melbourne Herald": "the herald"
    },
    {
        " printed documents in support of Khemlanis allegations, and on the following day, Connor resigned. Fraser determined to block supply, convened a ": null
    },
    {
        "shadow cabinet": "shadow cabinet"
    },
    {
        " meeting and received the unanimous support of the Coalition frontbench. At a press conference, Fraser cited the poor state of the economy and the continuing scandals as reasons for his decision. Without the passage of fresh appropriations, supply would be exhausted on 42 November.     On 42 October the Governor of Queensland, Sir ": null
    },
    {
        "Colin Hannah": "colin hannah"
    },
    {
        ", gave a speech denigrating the Whitlam Government, in violation of the convention that state governors remain neutral. Hannah held a ": null
    },
    {
        "dormant commission": "dormant commission"
    },
    {
        " as ": null
    },
    {
        "Administrator of the Commonwealth": "administrator"
    },
    {
        " to act as Governor-General in the event of Kerrs death, resignation, or absence from Australia. Whitlam immediately contacted ": null
    },
    {
        "Buckingham Palace": "buckingham palace"
    },
    {
        " to arrange for Hannahs dormant commission to be revoked, a process which took ten days to complete. Although Whitlam later alleged that he never contemplated dismissing Kerr during the crisis, on 42  October, while speaking with Kerr and visiting Malaysian Prime Minister ": null
    },
    {
        "Tun Abdul Razak": "abdul razak hussein"
    },
    {
        ", he told Kerr that if the crisis continued, It could be a question of whether I get to the Queen first for your recall, or whether you get in first with my dismissal . Kerr saw the statement as a threat; Whitlam later stated the comment was flippant and designed to turn the conversation to another subject.     On 42 and 42 October, the Senate, with the unanimous support of the Coalition majority, deferred the appropriation bills. The Coalition took the position that Kerr could dismiss Whitlam if the Government could not secure supply. Whitlams former solicitor-general ": null
    },
    {
        "Bob Ellicott": "bob ellicott"
    },
    {
        ", now a Liberal member of the House, issued a legal opinion on 42 October stating that the Governor-General had the power to dismiss Whitlam, and should do so forthwith if Whitlam could not state how he would obtain supply. Ellicott indicated that Whitlam was treating Kerr as if he had no discretion but to follow prime ministerial advice, when in fact the Governor-General could and should dismiss a ministry unable to secure supply. Ellicott stated that Kerr            Kerr rang Whitlam on Sunday 42 October, asking permission to consult with the Chief Justice of the ": null
    },
    {
        "High Court": "high court of australia"
    },
    {
        ", Sir ": null
    },
    {
        "Garfield Barwick": "garfield barwick"
    },
    {
        ", concerning the crisis. Whitlam advised Kerr not to do so, noting that no Governor-General had consulted with a Chief Justice under similar circumstances since 42 when Australia was at a much earlier stage of her constitutional development. On 42 October, Kerr phoned Whitlam regarding the Ellicott opinion, and asked, Its all bullshit, isnt it? . Whitlam agreed with Kerrs view. Kerr then requested that the Government provide him with a written legal opinion rebutting Ellicotts views. Kerr would receive no written advice from the Government until 42 November. Journalist and author ": null
    },
    {
        "Paul Kelly": "paul kelly"
    },
    {
        ", who wrote two books on the crisis, paints this delay as a major mistake by Whitlam, given Kerrs judicial background. Kerr also asked on 42 October for Whitlams permission to interview Fraser, which the Prime Minister readily granted, and the two men met that night. Fraser told Kerr that the Opposition were determined to block supply. Fraser indicated that the Oppositions decision to defer the appropriation bills, rather than defeating them, was a tactical decision, since then the bills would remain in the control of the Senate and could be passed at any time. He stated that the Coalition agreed with the Ellicott opinion, and proposed to continue deferring supply while it awaited events. The media were not told of the substance of the conversation, and instead reported that Kerr had reprimanded Fraser for blocking supply, causing the Governor-Generals office to issue a denial.     Throughout the crisis, Kerr did not tell Whitlam of his increasing concerns, nor did he suggest that he might dismiss Whitlam. He believed nothing he said would influence Whitlam, and feared that, if Whitlam perceived him as a possible opponent, the Prime Minister would procure his dismissal from the Queen. Accordingly, though Kerr dealt with Whitlam in an affable manner, he did not confide his thinking to the Prime Minister. Labor Senator ": null
    },
    {
        "Tony Mulvihill": "tony mulvihill"
    },
    {
        " later related that Whitlam would come back to each caucus meeting and say, I saw His Excellency  ... No worry. Hes got to do it his way.  ... at no time did he hint that the Governor-General was frowning.      There was intense public interest and concern at the stalemate, and Fraser and his Liberals acted to shore up support. Liberal frontbenchers worked to build unity for the tactic in state organisations. The former longtime ": null
    },
    {
        "Premier of South Australia": "premier of south australia"
    },
    {
        " Sir ": null
    },
    {
        "Thomas Playford": "thomas playford iv"
    },
    {
        " was speaking out against the blocking of supply, causing South Australia Senator ": null
    },
    {
        "Don Jessop": "don jessop"
    },
    {
        " to waver in his support for the tactic. Fraser was able to co-ordinate a wave of communications from party members which served to neutralise both men. Fraser sought the backing of the retired longtime Liberal Prime Minister, Sir ": null
    },
    {
        "Robert Menzies": "robert menzies"
    },
    {
        ", and went to see Menzies in person, taking with him a 42 statement by Menzies supporting the blocking of supply in the ": null
    },
    {
        "upper house": "victorian legislative council"
    },
    {
        " of the ": null
    },
    {
        "Victorian Parliament": "parliament of victoria"
    },
    {
        ". He did not have to use the paper; Menzies stated that he found the tactic distasteful, but in this case necessary. The former Prime Minister issued a statement in support of Frasers tactics.     Kerr invited Whitlam and ": null
    },
    {
        "Minister for Labour": "minister for employment and workplace relations"
    },
    {
        " Senator ": null
    },
    {
        "Jim McClelland": "jim mcclelland"
    },
    {
        " to lunch on 42 October, immediately preceding an ": null
    },
    {
        "Executive Council": "federal executive council"
    },
    {
        " meeting. At that meal, Kerr proposed a possible compromise. If the Opposition were to allow supply to pass, Whitlam would not advise a half-Senate election until May or June 42 and the Senate would not convene until 42 July, thus obviating the threat of a possible temporary Labor majority. Whitlam, who was determined to destroy both Frasers leadership and the Senates right to block supply, refused any compromise.            Fraser chaired a summit of leaders of the Coalition parties on 42 November. The resulting communiqué urged the Coalition senators to continue deferring supply. It also threatened, should Kerr grant Whitlam a half-Senate election, that the Coalition state premiers would advise their governors not to issue writs, thus blocking the election from taking place in the four states with non-Labor premiers. After the meeting, Fraser proposed a compromise: that the Opposition would concede supply if Whitlam agreed to hold a House of Representatives election at the same time as the half-Senate election. Whitlam rejected the idea.     On 42 October, Whitlam had asked the ": null
    },
    {
        "Attorney-General": "attorney-general of australia"
    },
    {
        ", ": null
    },
    {
        "Kep Enderby": "kep enderby"
    },
    {
        ", to have a paper drafted rebutting the Ellicott opinion for presentation to Kerr. Enderby delegated this task to the Solicitor-General, ": null
    },
    {
        "Maurice Byers": "maurice byers"
    },
    {
        ", and other officials. On 42 November, Enderby was to see Kerr to give him a legal opinion regarding the Governments alternative plans in case supply ran out. Vouchers were to be issued to Commonwealth employees and contractors instead of cheques, to be redeemed from banks after the crisis ended—transactions which were to be rejected by major banks as tainted with illegality . Enderby decided to present Kerr with the rebuttal to Ellicott. When Enderby reviewed the document, he found that, while it argued for the Governments position, it recognised both that the Senate had the constitutional right to block supply, and that the reserve powers were still extant—matters with which Enderby did not agree. He presented Kerr with the rebuttal, but crossed out Byers signature on it and told Kerr of his disagreement. Enderby told Kerr that the Byers rebuttal was background for formal written advice, to be presented by Whitlam. Later that day, Kerr met with Fraser again. The Opposition leader told him that if Kerr did not dismiss Whitlam, the Opposition planned to criticise him in Parliament for failing to carry out his duty.     Kerr concluded on 42 November that neither Government nor Opposition would yield and had received advice that day from Treasurer Bill Hayden that supply would run out on 42 November. The Governor-General decided that, as Whitlam could not secure supply, and would not resign or advise an election for the House of Representatives, he would have to sack him. As Kerr feared that Whitlam might advise the Queen to dismiss him, he considered it important that Whitlam be given no hint of the impending action. Kerr later stated that were Whitlam to seek his dismissal, it would involve the Queen in politics. Seeking confirmation of his decision, he contacted Chief Justice Barwick, met with him and asked for his views of a dismissal of Whitlam. Barwick furnished him with written advice containing his view that a Governor-General could and should dismiss a Prime Minister who was unable to obtain supply. Barwick specified that the Prime Minister should also not have refused either to resign or to advise a general election, with which Kerr agreed. Another member of the High Court and a friend of Kerr, Sir ": null
    },
    {
        "Anthony Mason": "anthony mason"
    },
    {
        ", gave Kerr similar advice privately on 42 November. But Mason added that the Governor-General needed to notify the Prime Minister of his intention to proceed to dismissal.      On 42 November, Fraser contacted Whitlam and invited him to negotiations with the Coalition aimed at settling the dispute. Whitlam agreed, and a meeting was set for 42  am on Tuesday 42 November, at Parliament House. That Tuesday was also the deadline for an election to be called if it were to be held before Christmas. Both Government and Opposition leaders were in Melbourne on the night of 42 November for the Lord Mayors banquet. To ensure the Opposition leaders could reach Canberra in time for the meeting, Whitlam brought them back in his VIP aircraft, which arrived in Canberra at midnight.                At 42  a.m. on 42 November, Whitlam, together with deputy prime minister ": null
    },
    {
        "Frank Crean": "frank crean"
    },
    {
        " and ": null
    },
    {
        "Leader of the House": "leader of the house"
    },
    {
        " Fred Daly": "fred daly"
    },
    {
        ", met with Fraser and Country Party leader ": null
    },
    {
        "Doug Anthony": "doug anthony"
    },
    {
        ". No compromise could be reached. Whitlam informed the Coalition leaders that he would be advising Kerr to hold a half-Senate election on 42  December, and he would not be seeking interim supply for the period before the election. Thinking it unlikely that Kerr would grant the election without supply, Fraser warned Whitlam that the Governor-General might make up his own mind about the matter. Whitlam was dismissive and after the meeting broke, telephoned Kerr to tell him that he needed an appointment to advise him to hold a half-Senate election. Both men were busy in the morning, Kerr with ": null
    },
    {
        "Remembrance Day": "remembrance day"
    },
    {
        " commemorations, and Whitlam with a caucus meeting and a censure motion in the House which the Opposition had submitted. The two discussed a meeting for 42:42  p.m., though Kerrs office later called Whitlams and confirmed the time as 42:42 Word of this change did not reach the Prime Minister. Whitlam announced the request for a half-Senate election to his caucus, which approved it.     After hearing from Whitlam, Kerr called Fraser. According to Fraser, Kerr asked him whether he, if commissioned Prime Minister, could secure supply, would immediately thereafter advise a double-dissolution election, and would refrain from new policies and investigations of the Whitlam Government pending the election. Fraser stated that he agreed. Kerr denied the exchange took place via telephone, though both men agree those questions were asked later in the day before Kerr commissioned Fraser as Prime Minister. According to Kerr, Fraser was supposed to come to Yarralumla at 42  pm.     Whitlam was delayed in leaving Parliament House, while Fraser left slightly early, with the result that Fraser arrived at Yarralumla first. He was taken into an anteroom, and his car was moved. Whitlam maintained that the purpose in moving Frasers car was to ensure that the Prime Minister was not tipped off by seeing it, stating, Had I known Mr. Fraser was already there, I would not have set foot in Yarralumla.  Kelly doubted Whitlam would have recognised Frasers car, which was an ordinary ": null
    },
    {
        "Ford LTD": "ford ltd"
    },
    {
        " from the car pool. According to Fraser biographer Philip Ayres, A white car pulled up at the front would signify nothing in particular—it would simply be in the way .     Whitlam arrived just before 42:42  p.m. and was taken to Kerrs office by an aide. He brought with him the formal letter advising a half-Senate election, and after the two men were seated, attempted to give it to Kerr. In their accounts of their meeting, both men agree that Kerr then told Whitlam that his commission as Prime Minister was withdrawn under Section  42 of the Constitution, Constitution section 42 empowers the Governor-General to appoint ministers of state, who shall hold office during the pleasure of the Governor-General . and handed him a letter and statement of reasons. Kerr later wrote that at this point Whitlam got to his feet, looked at the offices phones, and stated, I must get in touch with the Palace at once.  Whitlam, however disputed this, and stated that he asked Kerr whether he had consulted the Palace, to which Kerr replied that he did not need to, and that he had the advice of Barwick. Both accounts agree that Kerr then stated that they would both have to live with this, to which Whitlam replied, You certainly will. The dismissal concluded with Kerr wishing Whitlam luck in the election, and offering his hand, which the former Prime Minister took. The dismissal letter, Kerrs statement of reasons and Barwicks advice are reproduced in  pp.  42–42 They are also, with other documents and a photographic image of the dismissal letter, at      After Whitlam left, Kerr called in Fraser, informed him of the dismissal, and asked if he would form a caretaker government, to which Fraser agreed. Fraser later stated that his overwhelming sensation at the news was relief. Fraser left to return to Parliament House, where he conferred with Coalition leaders, while Kerr joined the luncheon party that had been waiting for him, apologising to his guests and offering the excuse that he had been busy dismissing the Government.       Whitlam returned to the Prime Ministers residence, ": null
    },
    {
        "The Lodge": "the lodge"
    },
    {
        ", where he had lunch. As his aides arrived, he informed them of his sacking. Whitlam drafted a resolution for the House, expressing confidence in his Government. No ALP Senate leaders were at The Lodge, nor did Whitlam and his party contact any when they drove back to Parliament House, confining their strategy to the House of Representatives.     Prior to Whitlams dismissal, the Labor leadership decided to introduce a motion that the Senate pass the appropriation bills. With ALP senators unaware of Whitlams sacking, that plan went ahead. Senator ": null
    },
    {
        "Doug McClelland": "doug mcclelland"
    },
    {
        ", manager of the ALP Governments business in the Senate, informed Coalition Senate leader ": null
    },
    {
        "Reg Withers": "reg withers"
    },
    {
        " of Labors intent at about 42. Withers then attended a leadership meeting and learned of Frasers appointment; he assured the new Prime Minister he could secure supply. When the Senate convened, the ALP Senate leader, ": null
    },
    {
        "Ken Wriedt": "ken wriedt"
    },
    {
        ", made the motion. Even as Wriedt did so, he was told that the government had been sacked, which he initially refused to believe. Authoritative word did not reach Wriedt until 42  pm, by which time it was too late to withdraw the motion and instead obstruct his partys appropriation bill to hinder Fraser. At 42  pm, Labors appropriation bills passed the Senate, fulfilling Frasers first promise of providing supply.     In the House, desultory debate on Frasers censure motion ended with it being amended by the ALP majority into a condemnation of Fraser and passed on a party line vote. By 42  pm, when Fraser rose and announced that he had been commissioned as Prime Minister, word of the dismissal had spread through the House. Fraser announced his intent to advise a double dissolution, and moved that the House adjourn. His motion was defeated. Frasers new government suffered repeated defeats in the House, which passed a motion of no confidence in him, and asked the Speaker, ": null
    },
    {
        "Gordon Scholes": "gordon scholes"
    },
    {
        ", to urge the Governor-General to recommission Whitlam. Scholes, attempting to communicate this to the Governor General, was initially told that an appointment might not be possible that day, but after stating that he would reconvene the House and tell them of the refusal, was given an appointment with Kerr for 42  pm.            With the appropriation bills approved by both Houses, they were sent over to Yarralumla where Kerr gave them ": null
    },
    {
        "Royal Assent": "royal assent"
    },
    {
        ". With supply assured, he then received Fraser, who advised him that 42  bills which had been introduced since the last election fulfilled the double dissolution provisions of Section  42 Fraser asked that both Houses be dissolved for an election on 42 December. Kerr signed the proclamation dissolving Parliament, and sent his ": null
    },
    {
        "Official Secretary": "official secretary to the governor-general of australia"
    },
    {
        ", ": null
    },
    {
        "David Smith": "david smith"
    },
    {
        ", to proclaim the dissolution from the front steps of Parliament House.     At 42, Kerr received Scholes, and informed him of the dissolution. Kerr wrote that nothing else of relevance took place between the two men, but by Scholess account, he accused Kerr of bad faith for making an appointment to receive the Speaker, and then not waiting to hear from him before dissolving Parliament. Whitlam later stated that it would have been wiser for Scholes to take the appropriation bills with him, rather than having them sent ahead.     Even as Scholes and Kerr spoke, Smith reached Parliament House. The dismissal was by then publicly known, and an angry crowd of ALP supporters had gathered, filling the steps and spilling over both into the roadway and into Parliament House itself. Many of the demonstrators were ALP staffers; others were from the ": null
    },
    {
        "Australian National University": "australian national university"
    },
    {
        ". Smith was forced to enter Parliament House through a side door and make his way to the steps from the inside. He read the proclamation, though the boos of the crowd drowned him out, and concluded with the traditional God save the Queen . Former Prime Minister Whitlam, who had been standing behind Smith, then addressed the crowd:                     The news that Whitlam had been dismissed spread across Australia during the afternoon, triggering immediate protest demonstrations. On 42 November, Scholes wrote to the Queen, asking her to restore Whitlam as Prime Minister. The reply from the Queens ": null
    },
    {
        "Private Secretary": "private secretary to the sovereign"
    },
    {
        ", Sir ": null
    },
    {
        "Martin Charteris": "martin charteris, baron charteris of amisfield"
    },
    {
        ", dated 42  November 42 stated:          On 42 November 42 the ": null
    },
    {
        "First Fraser Ministry": "first fraser ministry"
    },
    {
        " was sworn in by Kerr. By some accounts, Kerr sought reassurance at that meeting that the Coalition senators would not have given in before supply ran out, The Senate would never have caved in, would it? According to those accounts, Senator ": null
    },
    {
        "Margaret Guilfoyle": "margaret guilfoyle"
    },
    {
        " laughed and said to a colleague, Thats all he knows.  Guilfoyle later stated that, if she did make such a remark, it was not meant to imply that the Coalition senators would have broken. However, Kelly lists four Coalition senators who stated, in subsequent years, that they would have crossed the floor and voted for the appropriation bills.     Labor believed it had a chance of winning the election, and that the dismissal would be an electoral asset for them. However, some Labor strategists believed the party was heading for a disaster, with few economic accomplishments to point to and an electorate whose emotions would have cooled before polling day. Nonetheless, Whitlam, who began campaigning almost immediately after the dismissal, was met with huge crowds wherever he went; 42  people overspilled the ": null
    },
    {
        "Sydney Domain": "the domain, sydney"
    },
    {
        " for the official campaign launch on 42 November. That evening, Whitlam made a major speech at ": null
    },
    {
        "Festival Hall": "festival hall"
    },
    {
        " in Melbourne before 42  people and a national TV audience, calling 42 November Frasers day of shame—a day that will live in infamy .     Polls were released at the end of the first week of campaigning, and showed a nine-point swing against Labor. Whitlams campaign did not believe it at first, but additional polling made it clear: the electorate was turning against the ALP. The Coalition attacked Labor for the economic conditions, and released television commercials The Three Dark Years showing images from the Whitlam government scandals. The ALP campaign, which had concentrated on the issue of Whitlams dismissal, did not begin to address the economy until its final days. By that time Fraser, confident of victory, was content to sit back, avoid specifics and make no mistakes. There was little violence in the campaign, but three letter bombs were placed in the post; one wounded two people in Bjelke-Petersens office, while the other two, addressed to Kerr and Fraser, were intercepted and defused.     During the campaign, the Kerrs purchased a Sydney apartment, as Sir John was prepared to resign in the event that the ALP triumphed. In the ": null
    },
    {
        "42 December election": "1975 australian federal election"
    },
    {
        ", the Coalition won a record victory, with 42  seats in the House of Representatives to the ALPs 42 and a 42–42 majority in the expanded Senate.       The dismissal has been considered the greatest political and constitutional crisis in Australias history. In 42 the Fraser Government proposed four constitutional amendments via ": null
    },
    {
        "referendum": "1977 australian referendum"
    },
    {
        ", three of which passed—the last time that the Australian Constitution has been amended. ": null
    },
    {
        "One of the amendments": "australian referendum, 1977"
    },
    {
        " requires that a senator appointed to fill a casual vacancy be from the same party as the former senator. The Senate retains the power to block supply; the Governor-General retains the power to dismiss ministers . However, these powers have not since been used to force a government from office.     In the wake of the dismissal, the ALP turned its anger on Kerr. Demonstrations marked his appearances, while the remaining ALP parliamentarians boycotted his opening of the new Parliament. Whitlam, now Leader of the Opposition, refused all invitations to events at ": null
    },
    {
        "Yarralumla": "government house, canberra"
    },
    {
        ", which the Kerrs continued to extend until his refusal of an invitation during the Queens 42 visit caused them to feel that no further efforts need be made. Whitlam never spoke with Kerr again. Even ALP parliamentarians who had been friends of Kerr broke off their relationships, feeling Kerr had betrayed the party and had ambushed Whitlam. Lady ": null
    },
    {
        "Anne Kerr": "anne kerr, lady kerr"
    },
    {
        " stated that she and her husband confronted a new irrational scene swarming with instant enemies .     Whitlam repeatedly castigated Kerr for his role in the dismissal. When Kerr announced his resignation as Governor-General on 42 July 42 Whitlam commented: How fitting that the last of the ": null
    },
    {
        "Bourbons": "bourbons"
    },
    {
        " should bow out on ": null
    },
    {
        "Bastille Day": "bastille day"
    },
    {
        " . After Kerr resigned as Governor-General, he still sought a government position, reasoning that it had been his intent to remain for ten years as Governor-General. However, Frasers attempt to appoint Kerr as ambassador to ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " provoked such public outcry that the nomination was withdrawn. The Kerrs spent the next several years living in Europe, and when he died in Australia in 42 his death was not announced until after he was buried. In 42 Whitlam stated that no future Governor-General was likely to act as Kerr did lest he also became the subject of contempt and isolation . In 42 he said that the letter of dismissal had the shortcomings of being ex tempore, ex parte, ad hoc and sub rosa.  In 42 Whitlam called Kerr a contemptible person . On the other hand, Country Party leader and deputy prime minister ": null
    },
    {
        "Doug Anthony": "doug anthony"
    },
    {
        " said: I cant forgive Gough for crucifying him . Sir Garfield Barwick was not spared Whitlams invective; the former Prime Minister described him as evil .     Whitlam resigned as ALP leader after the party suffered its second successive electoral defeat in ": null
    },
    {
        "42": "1977 australian federal election"
    },
    {
        ". Fraser served over seven years as Prime Minister, and left the Liberal leadership after the Coalition was defeated in the ": null
    },
    {
        "March 42 election": "1983 australian federal election"
    },
    {
        ". Years later, Whitlam and Fraser put aside their differences; Whitlam wrote in 42 that Fraser did not set out to deceive me . The two campaigned together in support of ": null
    },
    {
        "the 42 referendum": "1999 australian republic referendum"
    },
    {
        " that would have made Australia a republic. According to Whitlam speechwriter ": null
    },
    {
        "Graham Freudenberg": "graham freudenberg"
    },
    {
        ", the residual rage over the conduct of the Queens representative found a constructive outlet in the movement for the ": null
    },
    {
        "Australian Republic": "australian republic"
    },
    {
        " .     Freudenberg summed up Kerrs fate after the dismissal:            In his 42 survey of the events of the crisis, November 42, Kelly places blame on Fraser for initiating the crisis and on Whitlam for using the crisis to try to break Fraser and the Senate. However, he places the most blame on Kerr, for failing to be candid with Whitlam about his intentions, and for refusing to offer a clear, final warning before dismissing him. According to Kelly,          Former Governor-General ": null
    },
    {
        "Sir Paul Hasluck": "paul hasluck"
    },
    {
        " believed that the fundamental reason for the crisis was the lack of trust and confidence between Whitlam and Kerr, and that the proper role of the Governor-General had been to provide counsel, advice and warning.        During the crisis, Whitlam had alleged that Country Party leader Anthony had close links to the US ": null
    },
    {
        "Central Intelligence Agency": "central intelligence agency"
    },
    {
        " . Subsequently, it was alleged that Kerr acted on behalf of the United States government in procuring Whitlams dismissal. The most common allegation is that the CIA influenced Kerrs decision to dismiss Whitlam. In 42 Kerr had joined the ": null
    },
    {
        "Association for Cultural Freedom": "association for cultural freedom"
    },
    {
        ", a conservative group that was later revealed to have received CIA funding. ": null
    },
    {
        "Christopher Boyce": "christopher john boyce"
    },
    {
        ", who was convicted for spying for the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " while an employee for a CIA contractor, claimed that the CIA wanted Whitlam removed from office because he threatened to close US military bases in Australia, including ": null
    },
    {
        "Pine Gap": "pine gap"
    },
    {
        ". Boyce said that Kerr was described by the CIA as our man Kerr . According to ": null
    },
    {
        "Jonathan Kwitny": "jonathan kwitny"
    },
    {
        " of the  Wall Street Journal , the CIA paid for Kerrs travel, built his prestige ... Kerr continued to go to the CIA for money . In 42 the White House sent as ambassador to Australia ": null
    },
    {
        "Marshall Green": "marshall green"
    },
    {
        ", who was known as the coupmaster for his central role in the ": null
    },
    {
        "42 coup": "transition to the new order"
    },
    {
        " against Indonesian President ": null
    },
    {
        "Sukarno": "sukarno"
    },
    {
        ". Cited in Pilger, John   The Guardian  42 October 42     Whitlam later wrote that Kerr did not need any encouragement from the CIA. However, he also said that in 42 ": null
    },
    {
        "United States Deputy Secretary of State": "united states deputy secretary of state"
    },
    {
        " Warren Christopher": "warren christopher"
    },
    {
        " made a special trip to Sydney to meet with him and told him, on behalf of US President ": null
    },
    {
        "Jimmy Carter": "jimmy carter"
    },
    {
        ", of his willingness to work with whatever government Australians elected, and that the US would never again interfere with Australias democratic processes. Kerr denied being involved in the CIA and there is no evidence for it in his private writings.     Former ": null
    },
    {
        "ASIO": "australian security intelligence organisation"
    },
    {
        " chief ": null
    },
    {
        "Sir Edward Woodward": "edward woodward"
    },
    {
        " has dismissed the notion of CIA involvement, , ": null
    },
    {
        "Australian Broadcasting Corporation": "australian broadcasting corporation"
    },
    {
        ", 42 Report, 42/42/42 Accessed 424242  424242 as has journalist ": null
    },
    {
        "Paul Kelly": "paul kelly"
    },
    {
        ". , ": null
    },
    {
        "Paul Kelly": "paul kelly"
    },
    {
        " and Troy Bramston, ": null
    },
    {
        "The Australian": "the australian"
    },
    {
        ", 42 December 42 , ": null
    },
    {
        "The Spectator": "the spectator"
    },
    {
        ", 42 January 42 Justice ": null
    },
    {
        "Robert Hope": "robert marsden hope"
    },
    {
        ", who had twice been royal commissioner investigating the Australian intelligence agencies, including ASIO, stated in 42 that he had attempted to locate and interview a witness who had allegedly given in-camera evidence to the ": null
    },
    {
        "Church Committee": "church committee"
    },
    {
        " about CIA involvement in the dismissal. He was unable to find either the witness or testimony, despite having the support of a senior senator . Hope, Robert. Interview with John Farquharson. Robert Marsden Hope Interviewed by John Farquharson. National Library of Australia. 42 February, 42 July 42 Oral History Project. . In his top secret supplementary report, however, Hope dismissed the idea of a CIA involvement in Australian politics. John Blaxland, Official History of ASIO: The Protest Years, Vol 42 , 4242       Since 42 political historian ": null
    },
    {
        "Jenny Hocking": "jenny hocking"
    },
    {
        " has been active in attempting to uncover documents that show how much Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        ", the Royal Family and British government knew about Kerrs plans.   Hocking has alleged that the British government and Queen colluded with Kerr.   Among the documents are Kerrs private papers where he recalls discussing his reserve powers with Prince Charles in September 42 He was concerned that if he dismissed a prime minister, the prime minister would retaliate by dismissing him. According to Kerr, Charles had responded: But surely, Sir John, the Queen should not have to accept advice that you should be recalled at the very time when you were considering having to dismiss the government. Prince Charles apparently informed the Queens Private Secretary, ": null
    },
    {
        "Sir Martin Charteris": "martin charteris, baron charteris of amisfield"
    },
    {
        ". He wrote to Kerr to say that should this contingency arise, although the Queen would try to delay things in the end she would have to take the Prime Minister’s advice.  Kerr maintained correspondence with Prince Charles and Charteris; after the dismissal Prince Charles wrote a letter to Kerr urging him not to lose heart in the face of domestic hostility.       The Queen made no formal intervention in the crisis. A letter from the palace to ": null
    },
    {
        "Gordon Scholes": "gordon scholes"
    },
    {
        " on 42 November affirmed that the Queen was aware of the events in Canberra but would not intervene. Neither Whitlam or Kerr suggested there had been any covert royal involvement. Paul Kelly has rejected Hockings allegations, which he says would be explosive if they were proven. He wrote that the September 42 conversation is not mentioned in Kerrs other memoirs, that it would have taken place before the crisis began, and that it would have only revealed Kerrs paranoia about being dismissed by Whitlam. He also noted accounts of surprise at the palace when they heard of Kerrs decision. Assistant Private Secretary to the Queen in 42 Sir ": null
    },
    {
        "William Heseltine": "william heseltine"
    },
    {
        ", who along with Charteris informed her of the dismissal, has maintained that it came as a surprise to all three of them; that he considered Kerrs actions imprudent; and that he believed that this opinion was shared by Charteris. The Queens opinion is unknown, but Heseltine has stated: I think she is an old and wily bird about her own views ... to the extent that I could divine what she felt, I think she felt the same ... Im reasonably confident myself that she thought it could have been handled better. ": null
    }
]