[
    {
        "               The Tiananmen Square protests, commonly known in ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        " as the June Fourth Incident , were student-led ": null
    },
    {
        "demonstrations": "demonstration"
    },
    {
        " held in ": null
    },
    {
        "Tiananmen Square": "tiananmen square"
    },
    {
        " in ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        " during 42 The popular national movement inspired by the Beijing protests is sometimes called the 42 Democracy Movement . The protests started on April 42 and were forcibly suppressed on June 42 when the government declared ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " and sent the military to occupy central parts of Beijing. In what became known as the Tiananmen Square Massacre , ": null
    },
    {
        "troops": "peoples liberation army at the 1989 tiananmen square protests"
    },
    {
        " with ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        "s and ": null
    },
    {
        "tank": "tank"
    },
    {
        "s fired at the demonstrators and those trying to block the militarys advance into Tiananmen Square. Estimates of the death toll vary from several hundred to several thousand, with thousands more wounded.     Set off by the death of pro-reform Communist general secretary ": null
    },
    {
        "Hu Yaobang": "hu yaobang"
    },
    {
        " in April 42 amid the backdrop of rapid economic development and social changes in ": null
    },
    {
        "post-Mao China": "history of the peoples republic of china"
    },
    {
        ", the protests reflected anxieties about the countrys future in the popular consciousness and among the political elite. The ": null
    },
    {
        "reforms of the 42s": "chinese economic reform"
    },
    {
        " had led to a nascent ": null
    },
    {
        "market economy": "market economy"
    },
    {
        " which benefited some people but seriously disaffected others, and the one-party political system also faced a challenge of legitimacy. Common grievances at the time included ": null
    },
    {
        "inflation": "inflation"
    },
    {
        ", corruption, limited preparedness of graduates for the new economy, and restrictions on political participation. The students called for greater accountability, constitutional due process, ": null
    },
    {
        "democracy": "democracy"
    },
    {
        ", ": null
    },
    {
        "freedom of the press": "freedom of the press"
    },
    {
        ", and ": null
    },
    {
        "freedom of speech": "freedom of speech"
    },
    {
        ", although they were highly disorganized and their goals varied. At the height of the protests, about 42  million people assembled in the Square.     As the protests developed, the authorities responded with both conciliatory and hardline tactics, exposing deep divisions within the party leadership. By May, a student-led ": null
    },
    {
        "hunger strike": "hunger strike"
    },
    {
        " galvanized support for the demonstrators around the country, and the protests spread to some 42 cities. Ultimately, Chinas ": null
    },
    {
        "paramount leader": "paramount leader"
    },
    {
        " Deng Xiaoping": "deng xiaoping"
    },
    {
        " and other ": null
    },
    {
        "Communist Party": "communist party of china"
    },
    {
        " elders": "eight elders"
    },
    {
        " believed the protests to be a political threat and resolved to use force. The ": null
    },
    {
        "State Council": "state council of the peoples republic of china"
    },
    {
        " declared ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " on May 42 and mobilized as many as 42 troops to Beijing. The troops advanced into central parts of Beijing on the citys major thoroughfares in the early morning hours of June 42 killing both demonstrators and bystanders in the process.     The international community, human rights organizations, and political analysts condemned the Chinese government for the massacre. Western countries imposed arms embargoes on China. The Chinese government made widespread arrests of protesters and their supporters, suppressed ": null
    },
    {
        "other protests around China": "1989 chinese protests by region"
    },
    {
        ", expelled foreign journalists, strictly controlled coverage of the events in the domestic press, strengthened the police and internal security forces, and demoted or purged officials it deemed sympathetic to the protests. More broadly, the suppression halted the policies of liberalization in the 42s. Considered a watershed event, the protests set the limits on political expression in China up to the present day.  Its memory is widely associated with questioning the legitimacy of Communist Party rule and remains one of the most sensitive and most widely ": null
    },
    {
        "censored topics in China": "censorship in china"
    },
    {
        ".             Events named by date in Chinese are conventionally named by the number of the month and the date, followed by the type of event. Thus, the common Chinese name for the crackdown on the 42 massacre is June Fourth Incident . The nomenclature of the former is consistent with the customary names of the other two great protests that occurred in Tiananmen Square: the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        " of 42 and the ": null
    },
    {
        "April Fifth Movement": "tiananmen incident"
    },
    {
        " of 42 June Fourth refers to the day on which the Peoples Liberation Army cleared Tiananmen Square of protesters, although actual operations began on the evening of June 42 Names such as June Fourth Movement  and 42 Democracy Movement  are used to describe the event in its entirety.     Outside mainland China, and among circles critical of the crackdown within mainland China, it is commonly referred to in Chinese as June Fourth Massacre  and June Fourth Crackdown . To bypass ": null
    },
    {
        "internet censorship in China": "internet censorship in china"
    },
    {
        ", which uniformly considers all the above-mentioned names too Sensitive for search engines and public forums, alternative names have sprung up to describe the events on the Internet, such as May  42th, VIIV , Eight Squared  and 42  , June 42 42 ": null
    },
    {
        "Chantal Yuen": "chantal yuen"
    },
    {
        ", ": null
    },
    {
        "Hong Kong Free Press": "hong kong free press"
    },
    {
        ".     The ": null
    },
    {
        "government of the Peoples Republic of China": "government of the peoples republic of china"
    },
    {
        " have used numerous names for the event since 42 gradually reducing the intensity of terminology applied. As the events were unfolding, it was labelled a counterrevolutionary riot , which was later changed to simply riot , followed by political storm and finally the leadership settled on the more neutralized phrase political turmoil between the Spring and Summer of 42 , which it uses to this day.     In English, the terms Tiananmen Square Massacre, Tiananmen Square Protests or Tiananmen Square Crackdown are often used to describe the series of events. However, much of the violence in Beijing did not actually happen in Tiananmen, but outside the square along a stretch of ": null
    },
    {
        "Changan Avenue": "changan avenue"
    },
    {
        " only a few miles long, and especially near the ": null
    },
    {
        "Muxidi": "muxidi"
    },
    {
        " area. The term also gives a misleading impression that demonstrations only happened in Beijing, when in fact they occurred in many cities throughout China.          The ": null
    },
    {
        "Cultural Revolution": "cultural revolution"
    },
    {
        " ended with chairman ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        "s death in 42 The movement, spearheaded by Mao, caused severe damage to the countrys originally diverse economic and social fabric. The country was mired in poverty as economic production slowed or came to a halt. Political ideology was paramount in the lives of ordinary people as well as the inner workings of the Communist Party itself. At the ": null
    },
    {
        "Third Plenum of the 42th Central Committee": "third plenary session of the 11th cpc central committee"
    },
    {
        " in December 42 ": null
    },
    {
        "Deng Xiaoping": "deng xiaoping"
    },
    {
        " emerged as Chinas ": null
    },
    {
        "de facto leader": "paramount leader"
    },
    {
        ". Deng launched a comprehensive ": null
    },
    {
        "program to reform the Chinese economy": "chinese economic reform"
    },
    {
        ". Within several years, the countrys direction entirely changed. The focus on ideological purity was replaced by a full-on drive to achieve material prosperity.     To run his reform agenda, Deng promoted his allies to top government and party posts. ": null
    },
    {
        "Hu Yaobang": "hu yaobang"
    },
    {
        " became ": null
    },
    {
        "General Secretary": "general secretary of the communist party of china"
    },
    {
        " of the Communist Party in 42 while ": null
    },
    {
        "Zhao Ziyang": "zhao ziyang"
    },
    {
        " was named ": null
    },
    {
        "Premier": "premier of the peoples republic of china"
    },
    {
        ", the head of government, in September 42       The reforms aimed to decrease the role of the state in the economy and gradually introduced private forms of production in agriculture and industry. By 42 roughly 42% of rural farms had de-collectivized and 42% of state owned enterprises were permitted to retain profits. Within a few years, production increased by leaps and bounds, and poverty was reduced substantially.     While the reforms were generally well received by the public, concerns grew over a series of social problems that the changes brought about, including ": null
    },
    {
        "corruption": "corruption in china"
    },
    {
        " and ": null
    },
    {
        "nepotism": "nepotism"
    },
    {
        " by elite party bureaucrats. The state-mandated pricing system, in place since the 42s, had long kept prices stable at low levels. The initial reforms created a two-tier system where some prices were fixed while others were allowed to fluctuate. In a market with chronic shortages, this allowed people with powerful connections to buy goods at low prices and sell at market prices. Party bureaucrats suddenly found themselves in charge of a burgeoning state regime over economic management and enormous incentives for ": null
    },
    {
        "arbitrage": "arbitrage"
    },
    {
        ". Discontent over corruption reached a fever pitch with the public, and many, particularly those in the intellectual community, began to believe that only democratic reform and rule of law could act as a panacea for the countrys ills.     Following the 42 ": null
    },
    {
        "Beidaihe": "beidaihe"
    },
    {
        " meeting, the party leadership under Deng agreed to a transition to a market-based pricing system. News of the relaxation of price controls triggered waves of cash withdrawals, buying and hoarding all over China. The government panicked and rescinded the price reforms in less than two weeks, but its impact was pronounced for much longer. Inflation soared. Official indices report that the ": null
    },
    {
        "Consumer Price Index": "consumer price index"
    },
    {
        " increased 42% in Beijing between 42 and 42 leading to panic among salaried workers that they could no longer afford staple goods. Moreover, in the new market economy, unprofitable ": null
    },
    {
        "state-owned enterprise": "state-owned enterprise"
    },
    {
        "s were pressured to cut costs. This threatened a vast proportion of the population which relied on the ": null
    },
    {
        "iron rice bowl": "iron rice bowl"
    },
    {
        " , i.e. a host of social benefits such as job security, medical care and subsidized housing.       Reformist leaders envisioned in 42 that intellectuals would play a leading role in guiding the country through reforms, but this did not happen as planned. Despite the opening of new universities and increased enrollment, the state-directed education system did not produce enough graduates to meet increased market demand in the areas of agriculture, light industry, services, and foreign investment. The job market was especially limited for students specializing in social sciences and the humanities. Moreover, private companies no longer needed to accept students assigned to them by the state, and many high-paying jobs were offered on the basis of ": null
    },
    {
        "nepotism": "nepotism"
    },
    {
        " and favoritism. Gaining a good state-assigned placement meant navigating a highly inefficient bureaucracy that gave power to officials who had little expertise in their area of jurisdiction. Facing a dismal job market and limited chances of going abroad, intellectuals and students had a greater vested interest in political issues. Small study groups, such as the Democracy Salon and the Lawn Salon , began appearing on Beijing university campuses. These organizations motivated the students to get involved politically.     At the same time, the partys nominally socialist ideology faced a legitimacy crisis as it gradually adopted capitalist practices. Private enterprise gave rise to profiteers who took advantage of lax regulations, and who often flaunted their wealth in front of those who were less well off. Popular discontent was brewing over unfair wealth distribution. Greed, not skill, appeared to be the most crucial factor of success. There was widespread public disillusionment over the countrys future. People wanted change, yet the power to define the correct path continued to rest solely in the hands of the unelected government.     The comprehensive and wide-ranging reforms created political differences over the pace of ": null
    },
    {
        "marketization": "marketization"
    },
    {
        " and the control over the ideology that came with it, opening a deep chasm within the central leadership. The reformers  favoured political liberalization and a plurality of ideas as a channel to voice popular discontent, and pressed for further reforms. The conservatives  said that the reforms had gone too far, and advocated a return to greater state control to ensure social stability and to better align with the partys socialist ideology. However, both sides needed the backing of paramount leader Deng Xiaoping to carry out important policy decisions.          In mid42 astrophysics professor ": null
    },
    {
        "Fang Lizhi": "fang lizhi"
    },
    {
        " returned from a position at ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        " and began a personal tour around universities in China; speaking about liberty, human rights, and ": null
    },
    {
        "separation of powers": "separation of powers"
    },
    {
        ". Fang was part of a wider undercurrent within the elite intellectual community that thought Chinas poverty and underdevelopment, and the disaster of the Cultural Revolution, were a direct result of the authoritarian political system and the rigid command economy. The view that political reform was the only answer to Chinas on-going problems gained widespread appeal among students, as Fangs recorded speeches became widely circulated all over the country. In response, Deng Xiaoping warned that Fang was blindly worshipping Western lifestyles, capitalism, and multi-party systems, while undermining Chinas socialist ideology, traditional values, and the partys leadership.     Inspired by Fang and other people-power movements around the world, in December 42 student demonstrators staged protests against the slow pace of reform. The issues were wide-ranging, and included demands for economic liberalization, democracy, and rule of law. While the protests were initially contained in ": null
    },
    {
        "Hefei": "hefei"
    },
    {
        ", where Fang lived, they quickly spread to Shanghai, Beijing and other major cities. This alarmed the central leadership, who accused the students of instigating Cultural Revolution-style turmoil.     General secretary ": null
    },
    {
        "Hu Yaobang": "hu yaobang"
    },
    {
        " was blamed for taking a soft attitude and mishandling the protests, thus undermining social stability. He was denounced thoroughly by conservatives. Hu was forced to resign as general secretary on January 42 42 Then the party began the Anti-": null
    },
    {
        "bourgeois liberalization": "bourgeois liberalization"
    },
    {
        " Campaign , taking aim at Hu, political liberalization and Western-inspired ideas in general. The Campaign stopped student protests and tightened the political environment, but Hu remained popular among progressives in the party, intellectuals, and students.              When ": null
    },
    {
        "Hu Yaobang": "hu yaobang"
    },
    {
        " suddenly died of a heart attack on April 42 42 students reacted strongly, most of them believing that his death was related to his forced resignation. Hus death provided the initial impetus for students to gather in large numbers. In university campuses, many posters appeared eulogizing Hu, calling for a revival of Hus legacy. Within days, most posters were writing about broader political issues, such as freedom of the press, democracy, and corruption. Small spontaneous gatherings to mourn Hu began on April 42 around ": null
    },
    {
        "Monument to the Peoples Heroes": "monument to the peoples heroes"
    },
    {
        " at ": null
    },
    {
        "Tiananmen Square": "tiananmen square"
    },
    {
        ". On the same day, many students at ": null
    },
    {
        "Peking University": "peking university"
    },
    {
        " and ": null
    },
    {
        "Tsinghua University": "tsinghua university"
    },
    {
        " erected shrines, and joined the gathering in Tiananmen Square in a piecemeal fashion. Organized student gatherings also began on a small scale in ": null
    },
    {
        "Xian": "xian"
    },
    {
        " and Shanghai on April 42 On April 42 students at the ": null
    },
    {
        "China University of Political Science and Law": "china university of political science and law"
    },
    {
        " made a large ": null
    },
    {
        "wreath": "wreath"
    },
    {
        " to commemorate Hu Yaobang. Its laying-party was on April 42 and a larger-than-expected crowd assembled. At 42 pm, 42 CUPL students reached the eastern gate of the ": null
    },
    {
        "Great Hall of the People": "great hall of the people"
    },
    {
        ", near Tiananmen Square, to mourn Hu. The gathering featured speakers from various backgrounds giving public orations commemorating Hu and discussing social problems. However, it was soon deemed obstructive to the operation of the Great Hall, so police tried to persuade the students to disperse.     Starting on the night of April 42 three thousand PKU students marched from the campus towards Tiananmen Square, and soon nearly a thousand students from Tsinghua joined. Upon arrival, they soon joined forces with those already gathered at the Square. As its size grew, the gathering gradually evolved into a protest, as students began to draft a list of pleas and suggestions for the government:   Affirm Hu Yaobangs views on democracy and freedom as correct.   Admit that the campaigns against ": null
    },
    {
        "spiritual pollution": "anti-spiritual pollution campaign"
    },
    {
        " and bourgeois liberalization had been wrong.   Publish information on the income of state leaders and their family members.   Allow privately run newspapers and stop press censorship.   Increase funding for education and raise intellectuals pay.   End restrictions on demonstrations in Beijing.   Provide objective coverage of students in official media.     On the morning of April 42 students remained in the Square. Some gathered around the Monument to the Peoples Heroes singing patriotic songs and listening to impromptu speeches by student organizers, others gathered at the Great Hall. Meanwhile, a few thousand students gathered at ": null
    },
    {
        "Xinhua Gate": "xinhua gate"
    },
    {
        ", the entrance to ": null
    },
    {
        "Zhongnanhai": "zhongnanhai"
    },
    {
        ", the seat of the party leadership, where they demanded dialogue with the leadership. Police restrained the students from entering the compound. Students then staged a ": null
    },
    {
        "sit-in": "sit-in"
    },
    {
        ".     On April 42 most students had been persuaded to leave Xinhua Gate. To disperse about 42 students that remained, police used batons; minor clashes were reported. Many students felt abused by the police, and rumours about police brutality spread quickly. This incident angered students on campus, where those who were not politically active decided to join the protests. Also on this date, a group of workers calling themselves the ": null
    },
    {
        "Beijing Workers Autonomous Federation": "beijing workers autonomous federation"
    },
    {
        " issued two handbills challenging the central leadership.     Hus ": null
    },
    {
        "state funeral": "state funeral"
    },
    {
        " took place on April 42 On the evening of April 42 some 42 students marched on Tiananmen Square, ignoring orders from Beijing municipal authorities that the Square was to be closed off for the funeral. The funeral, which took place inside the Great Hall and attended by the leadership, was broadcast live to the students. General secretary ": null
    },
    {
        "Zhao Ziyang": "zhao ziyang"
    },
    {
        " delivered the eulogy. The funeral seemed rushed, and only lasted 42 minutes, as emotions ran high in the Square. Students wept.     Security cordoned off the east entrance to the Great Hall of the People, but several students pressed forward. A few were allowed to cross the police line. Three of these students  knelt on the steps of the Great Hall to present a petition and demanded to see Premier ": null
    },
    {
        "Li Peng": "li peng"
    },
    {
        ". Standing beside them, a fourth student  made a brief, emotional speech begging for Li Peng to come out and speak with them. The larger number of students still in the Square but outside the cordon were at times emotional, shouting demands or slogans and rushing toward police. Wuerkaixi calmed the crowd down as they waited for the Premier to emerge. However, no leaders emerged from the Great Hall, leaving the students disappointed and angry; some called for a class boycott.     On April 42 students began organizing under the banners of formal organizations. On April 42 in a meeting of around 42 students from 42 universities, the ": null
    },
    {
        "Beijing Students Autonomous Federation": "beijing students autonomous federation"
    },
    {
        " was formed. It elected CUPL student ": null
    },
    {
        "Zhou Yongjun": "zhou yongjun"
    },
    {
        " as chair. ": null
    },
    {
        "Wang Dan": "wang dan"
    },
    {
        " and ": null
    },
    {
        "Wuerkaixi": "wuerkaixi"
    },
    {
        " also emerged as leaders. The Union then called for a general class boycott at all Beijing universities. Such an independent organization operating outside of party jurisdiction alarmed the leadership.     On April 42 near dusk, serious rioting broke out in ": null
    },
    {
        "Changsha": "changsha"
    },
    {
        " and ": null
    },
    {
        "Xian": "xian"
    },
    {
        ". In Xian, arson from rioters destroyed cars and houses, and looting occurred in shops near the citys Xihua Gate. In Changsha, 42 stores were ransacked by looters. Over 42 people were arrested in both cities. In Wuhan, university students organized protests against the provincial government. As the situation became more volatile nationally, Zhao Ziyang called numerous meetings of the ": null
    },
    {
        "Politburo Standing Committee": "politburo standing committee"
    },
    {
        " . Zhao stressed three points: discourage students from further protests and ask them to go back to class, use all measures necessary to combat rioting, and open forms of dialogue with students at different levels of government. Premier Li Peng called upon Zhao to condemn protestors and recognize the need to take more serious action. Zhao dismissed Lis views. Despite calls for him to remain in Beijing, Zhao left for a scheduled state visit to ": null
    },
    {
        "North Korea": "north korea"
    },
    {
        " on April 42             Zhaos departure to North Korea left Li Peng as the acting executive authority in Beijing. On April 42 Li Peng and the PSC met with Beijing Party Secretary ": null
    },
    {
        "Li Ximing": "li ximing"
    },
    {
        " and mayor ": null
    },
    {
        "Chen Xitong": "chen xitong"
    },
    {
        " to gauge the situation at the Square. The municipal officials wanted a quick resolution to the crisis and framed the protests as a conspiracy to overthrow Chinas political system and major party leaders, including Deng Xiaoping. In Zhaos absence, the PSC agreed that firm action against protesters must be taken. On the morning of April 42 President ": null
    },
    {
        "Yang Shangkun": "yang shangkun"
    },
    {
        " and Premier ": null
    },
    {
        "Li Peng": "li peng"
    },
    {
        " met with Deng at the latters residence. Deng endorsed a hardline stance and said an appropriate warning must be disseminated via mass media to curb further demonstrations. The meeting firmly established the first official evaluation of the protests from the leadership, and highlighted Dengs having final say on important issues. Li Peng subsequently ordered Dengs views to be drafted as a communique and issued to all high-level Communist Party officials in an effort to mobilize the party apparatus against protesters.     On April 42 the partys official newspaper  Peoples Daily  issued a front-page editorial titled ": null
    },
    {
        "It is necessary to take a clear-cut stand against disturbances": "april 26 editorial"
    },
    {
        ". The language in the editorial effectively branded the student movement to be an anti-party, anti-government revolt. The article enraged students, who interpreted it as a direct indictment on the protests and its cause. The editorial backfired. Instead of scaring students into submission, it squarely antagonized the students against the government. The polarizing nature of the editorial made it a major sticking point for the remainder of the protests. The editorial evoked memories of the Cultural Revolution, using similar rhetoric as that used during the 42 ": null
    },
    {
        "Tiananmen Incident": "tiananmen incident"
    },
    {
        "—an event that was initially branded an anti-government conspiracy but was later rehabilitated as patriotic under Dengs leadership.             Organized by the Union on April 42 some 42–42 students from all Beijing universities marched through the streets of the capital to Tiananmen Square, breaking through lines set up by police, and receiving widespread public support along the way, particularly from factory workers. The student leaders, eager to show the patriotic nature of the movement, also toned down anti-Communist slogans, choosing to present a message of anti-corruption, anti-cronyism , but pro-party . In a twist of irony, student factions who genuinely called for the overthrow of the Communist Party gained traction as the result of an April 42 editorial.     The stunning success of the March forced the government into making concessions and meeting with student representatives. On April 42 ": null
    },
    {
        "State Council": "state council of the peoples republic of china"
    },
    {
        " spokesman ": null
    },
    {
        "Yuan Mu": "yuan mu"
    },
    {
        " met with appointed representatives of government-sanctioned student associations. While the talks discussed a wide range of issues, including the editorial, the Xinhua Gate incident and freedom of the press, they achieved few substantive results. Independent student leaders such as Wuer Kaixi refused to attend.     The governments tone grew increasingly conciliatory as Zhao Ziyang returned from ": null
    },
    {
        "Pyongyang": "pyongyang"
    },
    {
        " on April 42 and resumed his executive authority. In Zhaos view, the hardliner approach was not working, and concession was the only alternative. Zhao asked that the press be opened to report the movement positively, and delivered two sympathetic speeches on May 42–42 In the speeches, Zhao said that the students concerns about corruption were legitimate, and that the student movement was patriotic in nature. The speeches essentially negated the message presented by April 42 Editorial. While some 42 students marched on the streets of Beijing on May 42 to commemorate the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        " and repeat demands from earlier marches, many students were satisfied with the governments concessions. On May 42 all Beijing universities except PKU and BNU announced the end of the class boycott. Subsequently, the majority of students began to lose interest in the movement.            The leadership was divided on how to respond to the movement as early as mid-April. After Zhao Ziyangs return from North Korea, factional tensions, between the progressive camp and the conservative camp, intensified. Those who supported continued dialogue and a soft approach with students rallied behind Zhao Ziyang, while hardliner conservatives who opposed the movement rallied behind Premier Li Peng. Zhao and Li clashed at a PSC meeting on 42 May. Li maintained that the need for stability overrides all else, while Zhao said that the party should show support for increased democracy and transparency. Zhao pushed the case for further dialogue.     In preparation for dialogue, the Autonomous Student Union elected representatives to a formal delegation. There was some friction, however, as the Union leaders were reluctant to let the delegation unilaterally take control of the movement. The movement was slowed by a change to a more deliberate approach, fractured by internal discord, and increasingly diluted by declining engagement from the student body at large. In this context, a group of charismatic leaders, including Wang Dan and Wuerkaixi, desired to regain momentum. They also distrusted the governments offers of dialogue, dismissing them as merely a ploy designed to play for time and pacify the students. To break from the moderate and incremental approach now adopted by other major student leaders, these few began calling for a return to more confrontational measures. They settled on a plan of mobilizing students for a hunger strike on that would begin May 42 Early attempts to mobilize others to join them met with only modest success until ": null
    },
    {
        "Chai Ling": "chai ling"
    },
    {
        " made an emotional appeal on the night before the strike was scheduled to begin.               Students began the hunger strike on 42 May, two days before the highly publicized ": null
    },
    {
        "state visit": "state visit"
    },
    {
        " by Soviet leader ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        ". Knowing that the welcoming ceremony for Gorbachev was scheduled to be held on the Square, student leaders wanted to use the hunger strike there to force the government into meeting their demands. Moreover, the hunger strike gained widespread sympathy from the population at large and earned the student movement the moral high ground that it sought. By the afternoon of 42 May, some 42 were gathered at the Square.     Inspired by the course of events in Beijing, protests and strikes began at universities in other cities, with many students traveling to Beijing to join the demonstration. Generally, the demonstration at Tiananmen Square was well ordered, with daily marches of students from various Beijing-area colleges displaying their solidarity with the class boycott and with the demands of the protest. The students sang  The Internationale , the world socialist anthem, on their way to, and at, the square.  Amnesty International , August 42 ": null
    },
    {
        "42": "1989"
    },
    {
        ". Preliminary Findings on Killings of Unarmed Civilians, Arbitrary Arrests and Summary Executions Since June 42 42 , p.42     Afraid that the movement would spin out of control, Deng Xiaoping ordered the Square to be cleared for Gorbachevs visit. Executing Dengs request, Zhao again used a soft approach, and directed his subordinates to coordinate negotiations with students immediately. Zhao believed he could appeal to the students patriotism, and that the students understood signs of internal turmoil during the Sino-Soviet summit would embarrass the nation . On the morning of 42 May, ": null
    },
    {
        "Yan Mingfu": "yan mingfu"
    },
    {
        ", head of the Communist Partys ": null
    },
    {
        "United Front": "united front"
    },
    {
        ", called an emergency meeting, gathering prominent student leaders and intellectuals, including ": null
    },
    {
        "Liu Xiaobo": "liu xiaobo"
    },
    {
        ", ": null
    },
    {
        "Chen Ziming": "chen ziming"
    },
    {
        " and ": null
    },
    {
        "Wang Juntao": "wang juntao"
    },
    {
        ". Yan said the government was prepared to hold immediate dialogue with student representatives, but that the Tiananmen welcoming ceremony for Gorbachev would be cancelled whether the students withdraw or not—in effect removing the bargaining power the students thought they possessed. The announcement sent the student leadership into disarray.          Press restrictions were loosened significantly during early to mid-May. State media began broadcasting footage sympathetic to protesters and the movement, including the hunger strikers. On 42 May, intellectuals led by ": null
    },
    {
        "Dai Qing": "dai qing"
    },
    {
        " gained permission from ": null
    },
    {
        "Hu Qili": "hu qili"
    },
    {
        " to bypass government censorship and air the progressive views of the nations intellectuals on  Guangming Daily . The intellectuals then issued an urgent appeal for the students to leave the Square in an attempt to deescalate the conflict. However, many students believed that the intellectuals were speaking for the government, and refused to move. That evening, formal negotiations took place between government representatives led by Yan Mingfu and student representatives led by ": null
    },
    {
        "Shen Tong": "shen tong"
    },
    {
        " and Xiang Xiaoji. Yan affirmed the patriotic nature of the student movement and pleaded for the students to withdraw from the Square. While Yans apparent sincerity for compromise satisfied some students, the meeting grew increasingly chaotic as competing student factions relayed uncoordinated and incoherent demands to the leadership. Shortly after student leaders learned that the event had not been broadcast nationally as initially promised by the government, the meeting fell apart. Yan then personally went to the Square to appeal to the students, even offering himself to be held hostage. Yan also took the students pleas to Li Peng the next day, asking Li to consider formally retracting the April 42 Editorial and rebranding the movement as patriotic and democratic ; Li refused.     The students remained in the Square during the Gorbachev visit; his welcoming ceremony was held at the airport. The Sino-Soviet summit, the first of its kind in ": null
    },
    {
        "some 42 years": "sino-soviet split"
    },
    {
        ", marked the normalization of Sino-Soviet relations, and was seen as a breakthrough of tremendous historical significance for Chinas leaders. However, its smooth proceedings was derailed by the student movement; this created a major embarrassment  for the leadership on the global stage, and drove many moderates in government onto a more hardliner path. The summit between Deng and Gorbachev took place at the ": null
    },
    {
        "Great Hall of the People": "great hall of the people"
    },
    {
        " amid the backdrop of commotion and protest in the Square. When Gorbachev met with Zhao on 42 May, Zhao told him, and by extension the international press, that Deng was still the paramount authority in China. Deng felt that this remark was Zhaos attempt to shift blame for mishandling the movement to him. Zhaos defense against this accusation was that privately informing world leaders that Deng was the true center of power was standard operating procedure; Li Peng had made nearly identical private statements to US president ": null
    },
    {
        "George H.W. Bush": "george h.w. bush"
    },
    {
        " in February 42 Nevertheless, the statement marked a decisive split between the countrys two most senior leaders.       The hunger strike galvanized support for the students and aroused sympathy across the country. Around a million Beijing residents from all walks of life demonstrated in solidarity from 42–42 May. These included PLA personnel, police officers, and lower party officials. Many grassroots Party and ": null
    },
    {
        "Youth League": "communist youth league"
    },
    {
        " organizations, as well as government-sponsored labour unions, encouraged their membership to demonstrate. In addition, several of Chinas non-Communist parties sent a letter to Li Peng in support of students. The ": null
    },
    {
        "Chinese Red Cross": "red cross society of china"
    },
    {
        " issued a special notice and sent in a large number of personnel to provide medical services to the hunger strikers on the Square. After the departure of ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        ", many foreign journalists remained in the Chinese capital to cover the protests, giving the movement international spotlight. Western governments urged Beijing to exercise restraint.     The movement, on the wane at the end of April, now regained momentum. By 42 May, as students from across the country poured into the capital to join the movement, protests of varying sizes were occurring in some 42 Chinese cities. Students demonstrated at provincial party headquarters in Fujian, Hubei, and Xinjiang. Without a clearly articulated official position from the Beijing leadership, local authorities did not know how to respond. Because the demonstrations now included a wide array of social groups, each carrying its own set of grievances, it became increasingly unclear with whom the government should negotiate, and what the demands were. The government, still split on how to deal with the movement, saw its authority and legitimacy gradually erode as the hunger strikers took the limelight and gained widespread sympathy. These combined circumstances put immense pressure on the authorities to act, and martial law was discussed as a viable response.     The situation seemed intractable, so the weight of taking decisive action fell on paramount leader Deng Xiaoping. Matters came to a head on May 42 during a ": null
    },
    {
        "Politburo Standing Committee": "politburo standing committee"
    },
    {
        " meeting at Dengs residence. At the meeting, Zhao Ziyangs concessions-based strategy, which called for the retraction of the April 42 Editorial, was thoroughly criticized. Li Peng, ": null
    },
    {
        "Yao Yilin": "yao yilin"
    },
    {
        " and Deng asserted that by making a conciliatory speech to the ": null
    },
    {
        "Asian Development Bank": "asian development bank"
    },
    {
        " on 42 May, Zhao exposed divisions within the top leadership and emboldened the students. Deng warned that there is no way to back down now without the situation spiraling out of control , and so the decision is to move troops into Beijing to declare ": null
    },
    {
        "martial law": "martial law"
    },
    {
        "  as a show of the governments no-tolerance stance. To justify martial law, the demonstrators were described as tools of ": null
    },
    {
        "bourgeois liberalism": "bourgeois liberalism"
    },
    {
        " advocates who were pulling the strings behind the scenes, as well as tools of elements within the party who wished to further their personal ambitions. For the rest of his life, Zhao Ziyang maintained that the decision was ultimately in Dengs hands: among the five PSC members present at the meeting, he and ": null
    },
    {
        "Hu Qili": "hu qili"
    },
    {
        " opposed the imposition of martial law, Li Peng and Yao Yilin firmly supported it, and ": null
    },
    {
        "Qiao Shi": "qiao shi"
    },
    {
        " remained carefully neutral and noncommittal. Deng appointed the latter three to carry out the decision.          On the evening of 42 May, the PSC met at Zhongnanhai to finalize plans for martial law. At the meeting, Zhao announced that he was ready to take leave , citing he could not bring himself to carry out martial law. The elders in attendance at the meeting, ": null
    },
    {
        "Bo Yibo": "bo yibo"
    },
    {
        " and Yang Shangkun, urged the PSC to follow Dengs orders. Zhao did not consider the inconclusive PSC vote to have legally binding implications on martial law; Yang Shangkun, in his capacity as ": null
    },
    {
        "Vice Chairman of the Central Military Commission": "vice chairman of the central military commission"
    },
    {
        ", went on to mobilize the military to move into the capital.     Li Peng ": null
    },
    {
        "met with students": "student and government dialogue during the 1989 student movementmay 18: meeting with li peng"
    },
    {
        " for the first time on May 42 in an attempt to placate public concern over the hunger strike. During the talks, student leaders again demanded that the government rescind the April 42 Editorial and affirm the student movement as patriotic . Li Peng said the governments main concern was sending hunger strikers to hospital. The discussions were confrontational and yielded little substantive progress or dialogue, but gained student leaders prominent airtime on national television. By this point, those calling for the overthrow of the party and of Li Peng and Deng personally became prominent both in Beijing and in other cities. Slogans targeted Deng personally, for instance calling him the power behind the throne.           In the early morning of 42 May, Zhao Ziyang went to Tiananmen in what became his political ": null
    },
    {
        "swan song": "swan song"
    },
    {
        ". He was accompanied by ": null
    },
    {
        "Wen Jiabao": "wen jiabao"
    },
    {
        ". Li Peng also went to the Square, but left shortly thereafter. At 42:42am Zhao made a speech with a bullhorn to a crowd of students, urging the students to end the hunger strike. He told the students that they were still young and urged them to stay healthy and not to sacrifice themselves without due concern for their futures. Zhaos emotional speech was applauded by some students. It would be his last public appearance.     On 42 May, the PSC met with military leaders and party elders. Deng presided over the meeting and said that martial law was the only option. At the meeting Deng declared that he was mistaken in choosing Hu Yaobang and Zhao Ziyang as his successors, and resolved to remove Zhao from his position as general secretary. Deng also vowed to deal resolutely with Zhaos supporters and begin propaganda work.       Student leaders were put under close surveillance by the authorities, traffic cameras were used to perform surveillance on the square and the restaurants in the nearby area and where students gathered were wiretapped.  This surveillance led to the identification, capture and punishment of participants of the protest.  After the massacre, the government did thorough interrogations at work units, institutions and schools in order to identify who had been at the protest.           University students in Shanghai also took to the streets to commemorate the death of Hu Yaobang and protest against certain policies of the government. In many cases, these were supported by the universities own party cells. ": null
    },
    {
        "Jiang Zemin": "jiang zemin"
    },
    {
        ", then-Municipal Party Secretary, addressed the student protesters in a bandage and expressed his understanding as he was a former student agitator before 42 At the same time, he moved swiftly to send in police forces to control the streets and to purge Communist Party leaders who had supported the students.     On April 42 the editors of the  World Economic Herald , a magazine close to reformists, decided to publish a commemorative section on Hu. Inside was an article by ": null
    },
    {
        "Yan Jiaqi": "yan jiaqi"
    },
    {
        ", which commented favourably on the Beijing student protests, and called for a reassessment of Hus 42 purge. Sensing the conservative political trends in Beijing, ": null
    },
    {
        "Jiang Zemin": "jiang zemin"
    },
    {
        " demanded that the article be censored. Many newspapers were printed with a blank page. Jiang then suspended lead editor ": null
    },
    {
        "Qin Benli": "qin benli"
    },
    {
        ". His decisive action earned trust from conservative party elders, who praised Jiangs loyalty.     In Hong Kong on 42 May, over 42 people gathered at ": null
    },
    {
        "Happy Valley Racecourse": "happy valley racecourse"
    },
    {
        " for a gathering called Democratic songs dedicated for China . Many Hong Kong celebrities sang songs and expressed their support for the students in Beijing.  The following day, a procession of 42  million people, one fourth of Hong Kongs population, led by ": null
    },
    {
        "Martin Lee": "martin lee"
    },
    {
        ", ": null
    },
    {
        "Szeto Wah": "szeto wah"
    },
    {
        " and other organization leaders, paraded through ": null
    },
    {
        "Hong Kong Island": "hong kong island"
    },
    {
        ".  Across the world, especially where ethnic-Chinese lived, people gathered and protested. Many governments, including those of the United States and Japan, issued travel warnings to China.                   The Chinese government declared ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " on May 42 and ": null
    },
    {
        "mobilized at least 42 divisions": "peoples liberation army at tiananmen square protests of 1989mobilization"
    },
    {
        " from five of the countrys ": null
    },
    {
        "seven military regions": "pla military region"
    },
    {
        ". At least 42 of PLAs 42 army corps contributed troops. As many as 42 troops were eventually sent to the capital, some arriving by air and others by rail. Guangzhous civil aviation authorities put regular airline tickets on hold to prepare for transporting military units.     The armys entry into the city was blocked at its suburbs by throngs of protesters. Tens of thousands of demonstrators surrounded military vehicles, preventing them from either advancing or retreating. Protesters lectured soldiers and appealed to them to join their cause; they also provided soldiers with food, water, and shelter. Seeing no way forward, the authorities ordered the army to withdraw on 42 May. All government forces retreated to bases outside the city. While the armys withdrawal was initially seen as turning the tide in favour of protesters, in reality mobilization took place across the country for a final assault.     At the same time, internal divisions intensified within the student movement itself. By late May, the students became increasingly disorganized with no clear leadership or unified course of action. Moreover, Tiananmen Square was overcrowded and facing serious hygiene problems. ": null
    },
    {
        "Hou Dejian": "hou dejian"
    },
    {
        " suggested an open election of the student leadership to speak for the movement, but was met with opposition. Meanwhile, ": null
    },
    {
        "Wang Dan": "wang dan"
    },
    {
        " moderated his position, ostensibly sensing the impending military action and consequences, and advocated for a temporary withdrawal from Tiananmen Square to re-group on campus, but this was opposed by hardliner student factions who wanted to hold the Square. The increasing internal friction would lead to struggles for control of the loudspeakers in the middle of the square in a series of mini-coups: whoever controlled the loudspeakers was in charge of the movement. Some students would wait at the train station to greet arrivals of students from other parts of the country in an attempt to enlist factional support. Student groups began accusing each other of ulterior motives such as collusion with the government and trying to gain personal fame from the movement. Some students even tried to oust Chai Ling and Feng Congde from their leadership positions in an attempted kidnapping, an action Chai called a well-organized and premeditated plot.        On June 42 ": null
    },
    {
        "Li Peng": "li peng"
    },
    {
        " issued a report titled On the True Nature of the Turmoil , which was circulated to every member of the Politburo. The report aimed to persuade the Politburo of the necessity and legality of clearing Tiananmen Square by referring to the protestors as terrorists and counterrevolutionaries. The report stated that turmoil was continuing to grow, the students had no plans to leave, and they were gaining popular support. Further justification for martial law came in the form of a report submitted by the ": null
    },
    {
        "Ministry of State Security": "ministry of state security of the peoples republic of china"
    },
    {
        " to the party leadership, which emphasized the infiltration of ": null
    },
    {
        "bourgeois liberalism": "bourgeois liberalism"
    },
    {
        " into China and the negative effect that the West, particularly the United States, had on the students. The MSS expressed its belief that American forces had intervened in the student movement in hopes of overthrowing the Communist Party. The report created a sense of urgency within the party, and provided justification for military action. In conjunction with the plan to clear the Square by force, the Politburo received word from the martial law troops headquarters stating that the troops were ready to help stabilize the capital, and that they understood the necessity and legality of martial law to overcome the turmoil.     On June 42 the movement saw an increase in action and protest, solidifying the CPCs decision that it was time to act. Protests broke out as newspapers published articles that called for the students to leave Tiananmen Square and end the movement. Many of the students in the Square were not willing to leave and were outraged by the articles. They were also outraged by Beijing Dailys June 42 article Tiananmen, I Cry for You , written by a fellow student who had become disillusioned with the movement, as he thought it was chaotic and disorganized. In response to the articles, thousands of students lined the streets of Beijing to protest against leaving the Square.     Three intellectuals, ": null
    },
    {
        "Liu Xiaobo": "liu xiaobo"
    },
    {
        ", Zhou Duo, Gao Xin and a Taiwanese singer ": null
    },
    {
        "Hou Dejian": "hou dejian"
    },
    {
        " declared a second hunger strike because they wanted to revive the pro-democracy movement. After weeks of occupying the Square, the students were tired, and internal rifts opened between moderate and hardliner student groups. In their declaration speech, the hunger strikers openly criticized the governments suppression of the movement to remind the students that their cause was worth fighting for, and pushed them to continue their occupation of the Square.     On June 42 Deng Xiaoping and several ": null
    },
    {
        "party elders": "eight elders"
    },
    {
        " met with the three remaining ": null
    },
    {
        "politburo standing committee": "politburo standing committee of the communist party of china"
    },
    {
        " members, ": null
    },
    {
        "Li Peng": "li peng"
    },
    {
        ", ": null
    },
    {
        "Qiao Shi": "qiao shi"
    },
    {
        " and ": null
    },
    {
        "Yao Yilin": "yao yilin"
    },
    {
        ", after Zhao Ziyang and Hu Qili had been ousted; the committee members agreed to clear the Square so the riot can be halted and order be restored to the Capital.  They also agreed that the Square needed to be cleared as peacefully as possible, but if protesters did not cooperate, the troops were authorized to use force to complete the job. That day, state-run newspapers reported that troops were positioned in ten key areas in the city. Units of the ": null
    },
    {
        "42th": "27th army"
    },
    {
        ", ": null
    },
    {
        "42th": "65th army"
    },
    {
        " and the 42th Armies were ": null
    },
    {
        "secretly moved": "peoples liberation army at tiananmen square protests of 1989enforcement of martial law"
    },
    {
        " into the Great Hall of the People on the west side of the Square and the ": null
    },
    {
        "Ministry of Public Security": "ministry of public security of the peoples republic of china"
    },
    {
        " compound east of the Square.     On the evening of June 42 reports that an army ": null
    },
    {
        "trencher": "trencher"
    },
    {
        " ran into four civilians, killing three, sparked fear that the army and the police were trying to advance into Tiananmen Square. Student leaders issued emergency orders to set up roadblocks at major intersections to prevent the entry of troops into the center of the city.     On the morning of June 42 students and residents discovered troops dressed in plainclothes trying to smuggle weapons into the city. The students seized and handed the weapons to Beijing Police. The students protested outside the Xinhua Gate of the Zhongnanhai leadership compound and the police fired tear gas. Unarmed troops emerged from the Great Hall of the People and were quickly met with crowds of protesters. Several protesters tried to injure the troops as they collided outside the Great Hall of the People, forcing soldiers to retreat, but only for a short while.     At 42:42pm on June 42 the three Politburo standing committee members met with military leaders, Beijing Party Secretary ": null
    },
    {
        "Li Ximing": "li ximing"
    },
    {
        ", mayor ": null
    },
    {
        "Chen Xitong": "chen xitong"
    },
    {
        ", and State Council secretariat ": null
    },
    {
        "Luo Gan": "luo gan"
    },
    {
        ", and finalized the order for the enforcement of martial law:   The operation to quell the counterrevolutionary riot was to begin at 42pm.   Military units should converge on the Square by 42am on June 42 and the Square must be cleared by 42am.   No delays would be tolerated.   No person may impede the advance of the troops enforcing martial law. The troops may act in self-defense and use any means to clear impediments.   State media will broadcast warnings to citizens.     The order did not explicitly contain a shoot-to-kill directive but permission to use any means was understood by some units as authorization to use lethal force. That evening, the leaders monitored the operation from the ": null
    },
    {
        "Great Hall of the People": "great hall of the people"
    },
    {
        " and ": null
    },
    {
        "Zhongnanhai": "zhongnanhai"
    },
    {
        ".        On the evening of June 42 state-run television warned residents to stay indoors but crowds of people took to the streets, as they had two weeks before, to block the incoming army. ": null
    },
    {
        "PLA units": "peoples liberation army"
    },
    {
        " advanced on Beijing from every direction—the ": null
    },
    {
        "42th": "38th army"
    },
    {
        ", 42rd and 42th Armies from the west, the ": null
    },
    {
        "42th Airborne Corps": "15th airborne corps"
    },
    {
        ", ": null
    },
    {
        "42th": "20th army"
    },
    {
        ", ": null
    },
    {
        "42th": "26th army"
    },
    {
        " and ": null
    },
    {
        "42th": "54th army"
    },
    {
        " Armies from the south, the ": null
    },
    {
        "42th Army": "39th army"
    },
    {
        " and the ": null
    },
    {
        "42st Armored Division": "1st armored division"
    },
    {
        " from the east and the ": null
    },
    {
        "42th": "40th army"
    },
    {
        " and 42th Armies from the north.                  At about 42pm the 42th Army began to fire into the air as they traveled east on West ": null
    },
    {
        "Changan Avenue": "changan avenue"
    },
    {
        " toward the city centre. They initially intended the warning shots to frighten and disperse large crowds gathering to stop their progress. This attempt failed. The earliest casualties occurred as far west as ": null
    },
    {
        "Wukesong": "wukesong"
    },
    {
        ", where Song Xiaoming, a 42-year-old aerospace technician, was the first confirmed fatality of the night. Several minutes later, when the convoy eventually encountered a substantial blockade somewhere east of the ": null
    },
    {
        "42rd Ring Road": "3rd ring road"
    },
    {
        ", they opened automatic rifle fire directly at protesters. The crowds were stunned that the army was using live ammunition and reacted by hurling insults and projectiles. The troops used ": null
    },
    {
        "expanding bullets": "expanding bullets"
    },
    {
        ", prohibited by international law for use in warfare, which expand upon entering the body and create larger wounds.     At about 42:42pm, the advance of the army was briefly halted at ": null
    },
    {
        "Muxidi": "muxidi"
    },
    {
        ", about 42  km west of the Square, where ": null
    },
    {
        "articulated": "articulated bus"
    },
    {
        " trolleybuses": "trolleybuses"
    },
    {
        " were placed across a bridge and set on fire. Crowds of residents from nearby apartment blocks tried to surround the military convoy and halt its advance. The 42th Army again opened fire, inflicting heavy casualties. According to the tabulation of victims by ": null
    },
    {
        "Tiananmen Mothers": "tiananmen mothers"
    },
    {
        ", 42 people died at Muxidi, including Wang Weiping, a doctor tending to the wounded. As the battle continued eastward the firing became indiscriminate, with random, stray patterns killing both protesters and uninvolved bystanders. Several were killed in the apartments of high-ranking party officials overlooking the boulevard. Soldiers raked the apartment buildings with gunfire, and some people inside or on their balconies were shot. The 42th Army also used ": null
    },
    {
        "armored personnel carriers": "armored personnel carriers"
    },
    {
        " to ram through the buses. They continued to fight off demonstrators, who hastily erected barricades and tried to form human chains. As the army advanced, fatalities were recorded all along Changan Avenue. By far the largest number occurred in the two-mile stretch of road running from Muxidi to ": null
    },
    {
        "Xidan": "xidan"
    },
    {
        ", where 42 PLA trucks and 42 APCs ... were totally destroyed, and 42 other military vehicles were damaged .     To the south, the XV Airborne Corps also used live ammunition, and civilian deaths were recorded at Hufangqiao, Zhushikou, ": null
    },
    {
        "Tianqiao": "tianqiao subdistrict, beijing"
    },
    {
        ", and ": null
    },
    {
        "Qianmen": "qianmen"
    },
    {
        ".       Unlike more moderate leaders, ": null
    },
    {
        "Chai Ling": "chai ling"
    },
    {
        " seemed willing to allow for the movement to end in a violent confrontation.  In an interview given in late May, Chai suggested that only when the movement ended in bloodshed would the majority of China realize the importance of the student movement and unite, though she felt that she was unable to share this idea with her fellow students.  She has also stated that the expectation of violent crackdown was something she had heard from ": null
    },
    {
        "Li Lu": "li lu"
    },
    {
        " and not an idea of her own.      As the killings started, it infuriated city residents, some of whom attacked soldiers with sticks, rocks and ": null
    },
    {
        "molotov cocktails": "molotov cocktails"
    },
    {
        ", setting fire to military vehicles and beating the soldiers inside them to death. On one avenue in western Beijing, anti-government protestors torched a military convoy of more than 42 trucks and armored vehicles. John Burgess, “Images Vilify Protesters; Chinese Launch Propaganda Campaign,” Washington Post, June 42 42 The Chinese government and its supporters have tried to argue that the troops acted in self-defense and seized upon troop casualties to justify the use of force. Lethal attacks on troops occurred after the military had opened fire at 42pm on June 42 and the ": null
    },
    {
        "number of military fatalities caused by protesters": "death toll"
    },
    {
        " is relatively few—between 42 and 42 according to ": null
    },
    {
        "Wu Renhua": "wu renhua"
    },
    {
        "s study and Chinese government reports compared to ": null
    },
    {
        "hundreds or thousands of civilian deaths": "death toll"
    },
    {
        ".  The Wall Street Journal  reported that: As columns of tanks and tens of thousands of soldiers approached Tiananmen, many troops were set on by angry mobs who screamed, Fascists. Dozens of soldiers were pulled from trucks, severely beaten and left for dead. At an intersection west of the square, the body of a young soldier, who had been beaten to death, was stripped naked and hung from the side of a bus. Another soldiers corpse was strung up at an intersection east of the square. James P. Sterba, Adi Ignatius and Robert S. Greenberger, “Class Struggle: China’s Harsh Actions Threaten to Set Back 42-Year Reform Drive — Suspicions of Westernization Are Ascendant, and Army Has a Political Role Again — A Movement Unlikely to Die” Wall Street Journal, June 42 42       At 42:42pm, army helicopters appeared above the Square and students called for campuses to send reinforcements. At 42pm, the founding ceremony of the Tiananmen Democracy University was held as scheduled at the base of the ": null
    },
    {
        "Goddess of Democracy": "goddess of democracy"
    },
    {
        ". At 42:42pm, the loudspeakers controlled by the government warned that troops may take any measures to enforce martial law. By 42:42pm, news of bloodshed to the west and south of the city began trickling into the Square, often told by witnesses drenched in blood. At midnight, the students loudspeaker announced news that a student had been killed on West Changan Avenue, near the Military Museum and a somber mood settled on the Square. Li Lu, the deputy commander of the student headquarters, urged students to remain united in defending the Square through non-violent means. At 42:42am, ": null
    },
    {
        "Wuerkaixi": "wuerkaixi"
    },
    {
        " fainted after learning that a female student at Beijing Normal University, who had left campus with him earlier in the evening, had just been killed. Wuerkaixi was taken away by ambulance. By then, there were still 42–42 people in the Square.     At about 42:42am, a ": null
    },
    {
        "flare": "flare"
    },
    {
        " lit up the sky and the first armored personnel vehicle appeared on the Square from the west. At 42:42am, two more APCs arrived from the South. The students threw chunks of concrete at the vehicles. One APC stalled, perhaps by metal poles jammed into its wheels, and the demonstrators covered it with gasoline-doused blankets and set it on fire. The intense heat forced out the three occupants, who were swarmed by demonstrators. The APCs had reportedly run over tents and many in the crowd wanted to beat the soldiers. But students formed a protective cordon and escorted the three men to the medic station by the History Museum on the east side of the Square.     Pressure mounted on the student leadership to abandon non-violence and retaliate against the killings. At one point, Chai Ling picked up the megaphone and called on fellow students to prepare to defend themselves against the shameless government. However, she and Li Lu agreed to adhere to peaceful means and had the students sticks, rocks and glass bottles confiscated.     At about 42:42am, the vanguard of the 42th Army from the XV Airborne Corps arrived at the north and south ends of the Square, respectively. They began to seal off the Square from reinforcements of students and residents, killing more demonstrators who were trying to enter the Square. Meanwhile, the 42th and 42th Armies poured out of the Great Hall of the People to the west and the 42th Army emerged from behind the History Museum to the east. The remaining students, numbering several thousand, were completely surrounded at the Monument of the Peoples Heroes in the center of the Square. At 42am, the troops fired shots over the heads of the students at the Monument. The students broadcast pleadings back toward the troops: We entreat you in peace, for democracy and freedom of the motherland, for strength and prosperity of the Chinese nation, please comply with the will of the people and refrain from using force against peaceful student demonstrators.      At about 42:42am, several workers near the Monument emerged with a machine gun they had captured from the troops and vowed to take revenge. They were persuaded to give up the weapon by Hou Dejian. The workers also handed over an assault rifle without ammunition, which Liu Xiaobo smashed against the marble railings of the Monument. Shao Jiang, a student who had witnessed the killings at Muxidi, pleaded with the older intellectuals to retreat, saying too many lives had been lost. Initially, Liu Xiaobo was reluctant, but eventually joined Zhou Tuo, Gao Xin and ": null
    },
    {
        "Hou Dejian": "hou dejian"
    },
    {
        " in making the case to the student leaders for a withdrawal. Chai Ling, Li Lu and Feng Congde initially rejected the idea of withdrawal. At 42:42am, at the suggestion of two doctors in the Red Cross camp, Hou Dejian and Zhuo Tuo agreed to try to negotiate with the soldiers. They rode in an ambulance to the northeast corner of the Square and spoke with Ji Xinguo, the political commissar of the 42th Armys 42th Regiment, who relayed the request to command headquarters, which agreed to grant safe passage for the students to the southeast. The commissar told Hou, it would be a tremendous accomplishment, if you can persuade the students to leave the Square.     At 42am, the lights on the Square suddenly turned off, and the governments loudspeaker announced: Clearance of the Square begins now. We agree with the students request to clear the Square.  The students sang  The Internationale  and braced for a last stand. Hou returned and informed student leaders of his agreement with the troops. At 42:42am, the lights relit and the troops began to advance on the Monument from all sides. At about 42:42am, Hou Dejian took the students loudspeaker and recounted his meeting with the military. Many students, who learned of the talks for the first time, reacted angrily and accused him of cowardice.     The soldiers stopped about ten meters from the students. The first row of troops took aim with machine guns from the prone position. Behind them soldiers ": null
    },
    {
        "squatted": "squatting position"
    },
    {
        " and stood with assault rifles. Mixed among them were anti-riot police with clubs. Further back were tanks and APCs. Feng Congde took to the loudspeaker and explained that there was no time left to hold a meeting. Instead, a voice vote would decide the collective action of the group. Although the votes results were inconclusive, Feng said the gos had prevailed. Within a few minutes, at about 42:42am, a squad of soldiers in camouflaged uniform charged up the Monument and shot out the students loudspeaker. Other troops beat and kicked dozens of students at the Monument, seizing and smashing their cameras and recording equipment. An officer with a loudspeaker called out you better leave or this wont end well.      Some of the students and professors persuaded others still sitting on the lower tiers of the Monument to get up and leave, while soldiers beat them with clubs and gunbutts and prodded them with bayonets. Witnesses heard bursts of gunfire. At about 42:42am, the students began to leave the Monument. They linked hands and marched through a corridor to the southeast, though some departed through the north. Those who refused to leave were beaten by soldiers and ordered to join the departing procession. Having removed the students from the square, soldiers were ordered to relinquish their ammunition, after which they were allowed a short reprieve from 42am to 42am. The soldiers were then ordered to clear the square of all debris left over from the student occupation. The debris was either piled and burnt on the square, or placed in large plastic bags that were airlifted away by military helicopters. After the cleanup, the troops stationed at The Great Hall of the People remained confined within for the next nine days. During this time, the soldiers were left to sleep on the floors and fed a single packet of instant noodles split between three men daily. Officers apparently suffered no such deprivation, and were served regular meals apart from their troops.     Just past 42am on June 42 as a convoy of students who had vacated the Square were walking westward in the bicycle lane along Changan Avenue back to campus, three tanks pursued them from the Square, firing tear gas and one drove through the crowd, killing 42 students, injuring scores.     Later in the morning, thousands of civilians tried to re-enter the Square from the northeast on East Changan Avenue, which was blocked by rows of infantry. Many in the crowd were parents of the demonstrators who had been in the Square. As the crowd approached the troops, an officer sounded a warning, and the troops opened fire. The crowd scurried back down the avenue in view of journalists in the Beijing Hotel. Dozens of civilians were shot in the back as they fled. Later, the crowds surged back toward the troops, who opened fire again. The people fled in panic. An ambulance that was arriving was also caught in the gunfire. The crowd tried several more times but could not enter the Square, which remained closed to the public for two weeks.       On June 42 the suppression of the protest was immortalized outside of China via video footage and photographs of a lone man standing in front of a column of tanks leaving Tiananmen Square via ": null
    },
    {
        "Changan Avenue": "changan avenue"
    },
    {
        ". The ": null
    },
    {
        "Tank Man": "tank man"
    },
    {
        " , as it became known, became one of the most iconic photographs in the 42th century. As the tank driver tried to go around him, the Tank Man moved into the tanks path. He continued to stand defiantly in front of the tanks for some time, then climbed up onto the turret of the lead tank to speak to the soldiers inside. After returning to his position in front of the tanks, the man was pulled aside by a group of people.     Although the fate of Tank Man following the demonstration is not known, then-paramount Chinese leader Jiang Zemin stated in 42 that he did not think the man was killed. Time later named him one of the ": null
    },
    {
        "42 most influential people of the 42th century": "time 100: the most important people of the century"
    },
    {
        ".     A stopped convoy of 42 APCs on Changan Boulevard at Muxidi was forced to abandon their vehicles after becoming stuck among an assortment of burned out buses and military vehicles. In addition to occasional incidents of soldiers opening fire on civilians in Beijing, Western news outlets reported clashes between units of the PLA. Late in the afternoon 42 tanks, three armored personnel carriers and supporting infantry took up defensive positions facing East at ": null
    },
    {
        "Jianguomen": "jianguomen"
    },
    {
        " and ": null
    },
    {
        "Fuxingmen": "fuxingmen"
    },
    {
        " overpasses. Shellfire was heard throughout the night and the next morning a United States Marine in the eastern part of the city reported spotting a damaged armored vehicle that had been disabled by an armor-piercing shell. The ongoing turmoil in the capital disrupted the flow of everyday life. No editions of the Peoples Daily were available in Beijing on June 42 despite assurances that they had been printed. Many shops, offices, and factories were not able to open as workers remained in their homes, and public transit services were limited to subway and suburban bus routes.     By and large, the government regained control in the week following the militarys seizure of the Square. A political purge followed in which officials responsible for organizing or condoning the protests were removed, and protest leaders jailed.       After order was restored in Beijing on June 42 protests of varying scales continued in some 42 other Chinese cities, outside the spotlight of the international press. In the British colony of Hong Kong, people again took to wearing black in solidarity with the demonstrators in Beijing. There were also protests in other countries, many adopting the use of black armbands as well.     In Shanghai, students marched on the streets on June 42 and erected roadblocks on major thoroughfares. Factory workers went on a general strike and took to the streets as well; railway traffic was also blocked. Public transport was also suspended and prevented people from getting to work. On June 42 the municipal government tried to clear the rail blockade, but it was met with fierce resistance from the crowds. Several people were killed by being run over by the train. On June 42 students from major Shanghai universities stormed various campus facilities to erect ": null
    },
    {
        "bier": "bier"
    },
    {
        "s in commemoration of the dead in Beijing. The situation gradually came under control without use of deadly force. The municipal government gained recognition from the top leadership in Beijing for averting a major upheaval.     In the interior cities of Xian, Wuhan, Nanjing and Chengdu, many students continued protests after June 42 often erecting roadblocks. In Xian, students stopped workers from entering factories. In Wuhan, students blocked the ": null
    },
    {
        "Yangtze River Railway bridge": "wuhan yangtze river bridge"
    },
    {
        " and another 42 gathered at the railway station. About one thousand students staged a railroad sit-in. Rail traffic on the Beijing-Guangzhou and Wuhan-Dalian lines was interrupted. The students also urged employees of major state-owned enterprises to go on strike. In Wuhan the situation was so tense that residents reportedly began a ": null
    },
    {
        "bank run": "bank run"
    },
    {
        " and resorted to panic-buying.     Similar scenes unfolded in Nanjing. On June 42 hundreds of students staged a blockade at the ": null
    },
    {
        "Nanjing Yangtze River Bridge": "nanjing yangtze river bridge"
    },
    {
        " as well as the Zhongyangmen Railway Bridge. They were persuaded to evacuate without incident later that day, though returned the next day to occupy the main railway station and the bridges.     The atmosphere in ": null
    },
    {
        "Chengdu": "chengdu"
    },
    {
        " was more violent. On the morning of June 42 police forcibly broke up the student demonstration taking place in Chengdus main square. The resulting violence killed eight people, and injured hundreds. The most brutal attacks occurred on June 42 and 42 Witnesses estimate that 42 to 42 bodies were thrown onto a truck after a crowd broke into the Jinjiang Hotel. According to Amnesty International, at least 42 people were killed in Chengdu on June 42 Troops in Chengdu used concussion ": null
    },
    {
        "grenades": "grenades"
    },
    {
        ", ": null
    },
    {
        "truncheons": "baton"
    },
    {
        ", ": null
    },
    {
        "knives": "knives"
    },
    {
        " and ": null
    },
    {
        "electroshock weapon": "electroshock weapon"
    },
    {
        " against civilians. Hospitals were ordered to not accept students and on the second night the ambulance service was stopped by police.            At a news conference on June 42 State Council spokesperson Yuan Mu announced that based on preliminary statistics , nearly 42 people died includ soldiers , 42 students, bad elements who deserve this because of their crimes, and people who were killed by mistake.  The wounded, he said, included 42 officers and and over 42 civilians, including the handful of lawless ruffians and the onlooking masses who do understand the situation.  Military spokesperson Zhang Gong stated that no one was killed in Tiananmen Square and no one was run over by tanks in the Square.     On June 42 ": null
    },
    {
        "Deng Xiaoping": "deng xiaoping"
    },
    {
        ", appearing in public for the first time since the protests began, delivered a speech praising the martyrs . Deng stated that the goal of the movement was to overthrow the party and the state. Their goal is to establish a totally Western-dependent bourgeois republic , Deng said of the protesters. Deng argued that protesters had complained about corruption to cover their real motive, which was to replace the socialist system. He said that the entire imperialist Western world plans to make all socialist countries discard the socialist road and then bring them under the monopoly of international capital and onto the capitalist road .       The number of deaths and the extent of bloodshed in the square itself have been in dispute since the events. Chinese authorities actively suppressed discussion of casualty figures immediately after the events, and estimates rely heavily on eyewitness testimony, hospital records, and organized efforts by victims relatives. As a result, large discrepancies exist among various casualty estimates. Initial estimates ranged from the official figure of a few hundred to several thousand.       Official Chinese government announcements shortly after the event put the number of dead at around 42 At the State Council press conference on June 42 spokesman ": null
    },
    {
        "Yuan Mu": "yuan mu"
    },
    {
        " said that preliminary tallies by the government showed that about 42 civilians and soldiers died, including 42 students from universities in Beijing, along with a number of people he described as ruffians . Yuan also said some 42 soldiers and police along with 42 civilians were wounded. On June 42 Beijing Party Secretary ": null
    },
    {
        "Li Ximing": "li ximing"
    },
    {
        " reported to the Politburo that the governments confirmed death toll was 42 including 42 civilians , 42 PLA soldiers and 42 Peoples Armed Police, along with 42 wounded. ": null
    },
    {
        "Mayor": "politics of beijinglist of mayors"
    },
    {
        " Chen Xitong": "chen xitong"
    },
    {
        " said on June 42 that the number of injured was around 42.       On the morning of June 42 many estimates of deaths were reported, including from government-affiliated sources. Peking University leaflets circulated on campus suggested a death toll of between two and three thousand. The ": null
    },
    {
        "Chinese Red Cross": "red cross society of china"
    },
    {
        " had given a figure of 42 deaths, but later denied having given such a figure. The Swiss Ambassador had estimated 42. ": null
    },
    {
        "Nicholas D. Kristof": "nicholas d. kristof"
    },
    {
        " of  The New York Times  wrote on June 42 that it seems plausible that about a dozen soldiers and policemen were killed, along with 42 to 42 civilians.  United States ambassador ": null
    },
    {
        "James Lilley": "james lilley"
    },
    {
        " said that, based on visits to hospitals around Beijing, a minimum of several hundred had been killed. A declassified ": null
    },
    {
        "National Security Agency": "national security agency"
    },
    {
        " cable filed on the same day estimated 42–42 deaths up to the morning of June 42 Beijing hospital records compiled shortly after the events recorded at least 42 dead and 42 wounded. ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        "s estimates put the number of deaths at between several hundred and close to 42, while a Western diplomat who compiled estimates put the number at 42 to 42. In a widely reported declassified cable sent in the aftermath of the events at Tiananmen, British Ambassador Sir ": null
    },
    {
        "Alan Donald": "alan donald"
    },
    {
        " initially claimed, based on information from a good friend in the ": null
    },
    {
        "China State Council": "state council of the peoples republic of china"
    },
    {
        ", that a minimum of 42 civilians died,    an estimated number much higher than other sources. After this declassification, former student protest leader ": null
    },
    {
        "Feng Congde": "feng congde"
    },
    {
        " pointed out Sir Donald later revised his estimate to 42–42 deaths, a number more consistent with other estimates.        The ": null
    },
    {
        "Tiananmen Mothers": "tiananmen mothers"
    },
    {
        ", a victims advocacy group co-founded by ": null
    },
    {
        "Ding Zilin": "ding zilin"
    },
    {
        " and ": null
    },
    {
        "Zhang Xianling": "zhang xianling"
    },
    {
        ", whose children were killed during the crackdown, have identified 42 victims . The group has worked painstakingly, in the face of government interference, to locate victims families and collect information about the victims. Their tally has grown from 42 in 42 to 42 in 42 The list includes four individuals who committed suicide on or after June 42 for reasons that related to their involvement in the demonstrations.     Former protester ": null
    },
    {
        "Wu Renhua": "wu renhua"
    },
    {
        " of the ": null
    },
    {
        "Chinese Alliance for Democracy": "chinese alliance for democracy"
    },
    {
        ", an overseas group agitating for democratic reform in China, said that he was only able to verify and identify 42 military deaths. Wu asserts that if deaths from events unrelated to demonstrators were removed from the count, only seven deaths among military personnel may be counted as those ": null
    },
    {
        "killed in action": "killed in action"
    },
    {
        " by rioters.          Chinese government officials have long asserted that no one died in the square itself in the early morning hours of June 42 during the hold-out of the last batch of students in the south of the Square. Initially foreign media reports of a massacre on the Square were prevalent, though subsequently journalists have acknowledged that most of the deaths occurred outside of the square in western Beijing. Several people who were situated around the square that night, including former Beijing bureau chief of The Washington Post ": null
    },
    {
        "Jay Mathews": "jay mathews"
    },
    {
        " and CBS correspondent ": null
    },
    {
        "Richard Roth": "richard roth"
    },
    {
        " reported that while they had heard sporadic gunfire, they could not find enough evidence to suggest that a massacre took place on the square itself.     Similarly, in 42 three secret cables from the ": null
    },
    {
        "United States embassy in Beijing": "embassy of the united states, beijing"
    },
    {
        " claimed that there was no bloodshed inside Tiananmen Square itself. A Chilean diplomat who had been positioned next to a Red Cross station inside the square told his US counterparts that he did not observe any mass firing of weapons into the crowds of the square itself, although sporadic gunfire was heard. He said that most of the troops which entered the square were armed only with anti-riot gear. Records by the Tiananmen Mothers suggest that three students died in the Square the night of the Armys push into the Square.     Chinese scholar ": null
    },
    {
        "Wu Renhua": "wu renhua"
    },
    {
        ", who was present at the protests, wrote that the governments discussion of the issue was a ": null
    },
    {
        "red herring": "red herring"
    },
    {
        " intended to absolve itself of responsibility and showcase its benevolence. Wu said that it was irrelevant whether the shooting occurred inside or outside of the Square itself, as it was still a reprehensible massacre of unarmed civilians:   :“Really, whether the fully equipped army of troops massacred peaceful ordinary folks inside or outside the Square makes very little difference. It is not even worthwhile to have this discussion at all.“                 The authorities carried out mass arrests. Many of the workers were summarily tried and executed. In contrast, the students—many of whom came from relatively affluent backgrounds and were well-connected—received much lighter sentences. ": null
    },
    {
        "Wang Dan": "wang dan"
    },
    {
        ", the student leader who topped the most wanted list, spent seven years in prison. Many of the students and university staff implicated were permanently politically stigmatized, some never to be employed again.     On June 42 42 the ": null
    },
    {
        "Beijing Public Security Bureau": "beijing public security bureau"
    },
    {
        " released an order for the arrest of 42 students who they identified as leaders of the protest. These 42 most wanted student leaders were part of the ": null
    },
    {
        "Beijing Students Autonomous Federation": "beijing students autonomous federation"
    },
    {
        " which had been an instrumental student organization in the Tiananmen Square protests. Though decades have passed, the Most Wanted list has never been retracted by the Chinese government.     The 42 most wanted student leaders faces and descriptions were broadcast on television as well and were constantly looped. Photographs with biographical descriptions of the 42 Most Wanted followed in this order on the poster: ": null
    },
    {
        "Wang Dan": "wang dan"
    },
    {
        ",   ": null
    },
    {
        "Wuer Kaixi": "wuerkaixi"
    },
    {
        ", ": null
    },
    {
        "Liu Gang": "liu gang"
    },
    {
        ", ": null
    },
    {
        "Chai Ling": "chai ling"
    },
    {
        ", ": null
    },
    {
        "Zhou Fengsuo": "zhou fengsuo"
    },
    {
        ", ": null
    },
    {
        "Zhai Weimin": "zhai weimin"
    },
    {
        ", ": null
    },
    {
        "Liang Qingdun": "liang qingdun"
    },
    {
        ", ": null
    },
    {
        "Wang Zhengyun": "wang zhengyun"
    },
    {
        ", ": null
    },
    {
        "Zheng Xuguang": "zheng xuguang"
    },
    {
        ", ": null
    },
    {
        "Ma Shaofang": "ma shaofang"
    },
    {
        ", ": null
    },
    {
        "Yang Tao": "yang tao"
    },
    {
        ", Wang Zhixing, ": null
    },
    {
        "Feng Congde": "feng congde"
    },
    {
        ", ": null
    },
    {
        "Wang Chaohua": "wang chaohua"
    },
    {
        ", ": null
    },
    {
        "Wang Youcai": "wang youcai"
    },
    {
        ", Zhang Zhiqing, ": null
    },
    {
        "Zhang Boli": "zhang boli"
    },
    {
        ", ": null
    },
    {
        "Li Lu": "li lu"
    },
    {
        ", ": null
    },
    {
        "Zhang Ming": "zhang ming"
    },
    {
        ", ": null
    },
    {
        "Xiong Wei": "xiong wei"
    },
    {
        ", and ": null
    },
    {
        "Xiong Yan": "xiong yan"
    },
    {
        ".     Each of the 42 students faced diverse experiences after their arrests or escapes; while some remain abroad with no intent to return, others have chosen to stay indefinitely such as Zhang Ming. Only 42 of the 42 were able to escape. Some student leaders such as ": null
    },
    {
        "Chai Ling": "chai ling"
    },
    {
        " and ": null
    },
    {
        "Wuer Kaixi": "wuer kaixi"
    },
    {
        " were able to escape to the United States, the United Kingdom, France and other Western nations under ": null
    },
    {
        "Operation Yellowbird": "operation yellowbird"
    },
    {
        ", which was organized by Western intelligence agencies such as ": null
    },
    {
        "MI42": "mi6"
    },
    {
        " and ": null
    },
    {
        "CIA": "cia"
    },
    {
        ", from ": null
    },
    {
        "Hong Kong": "british hong kong"
    },
    {
        ", a British territory at the time.  According to The ": null
    },
    {
        "Washington Post": "washington post"
    },
    {
        ", the operation involved more than 42 people and had its roots in the  Alliance in Support of Democratic Movements in China  formed in May 42 After the Beijing protest crackdown, this group drew up an initial list of 42 dissidents they believed could form the nucleus of a Chinese democracy movement in exile .      The remaining student leaders were apprehended and incarcerated. Those who escaped, whether it was in 42 or after, generally have had difficulty re-entering China, even up to this day. The Chinese government prefers to leave the dissidents in exile. Those who attempt to re-enter, such as Wuer Kaixi, have been simply sent back, but not arrested.     ": null
    },
    {
        "Chen Ziming and Wang Juntao were arrested": "arrest and trial of chen ziming and wang juntao"
    },
    {
        " in late 42 for their involvement in the 42 Tiananmen Square protests. Chinese authorities alleged they were the black hands behind the movement. Both Chen and Wang rejected the allegations made against them. They were put on trial in 42 and sentenced to 42 years in prison. Others such Zhang Zhiqing have essentially disappeared. After his initial arrest in January 42 and subsequent release, nothing further is known about his situation and where he lives now. Zhang Zhiqings role and reason for being listed on the list of 42 most wanted is generally unknown; this is the case for many others on the list, such as Wang Chaohua.     According to the ": null
    },
    {
        "Dui Hua Foundation": "dui hua foundation"
    },
    {
        ", citing a provincial government, 42 individuals were imprisoned for protest-related activities in the early 42 , at least two remain incarcerated in Beijing and five others remain unaccounted for. In June 42 it was reported that Miao Deshun was believed to be the last known prisoner incarcerated for their participation in the protests; he was last heard from a decade ago. All are reported to be suffering from mental illness.          The Party leadership expelled Zhao Ziyang from the ": null
    },
    {
        "Politburo Standing Committee": "politburo standing committee"
    },
    {
        " . ": null
    },
    {
        "Hu Qili": "hu qili"
    },
    {
        ", another PSC member who opposed the martial law but abstained from voting, was also removed from the committee. He was, however, able to retain his party membership, and after changing his opinion , was reassigned as deputy minister in the Ministry for Machinery and Electronics Industry. Another reform-minded Chinese leader, ": null
    },
    {
        "Wan Li": "wan li"
    },
    {
        ", was also put under house arrest immediately after he stepped out of his plane at ": null
    },
    {
        "Beijing Capital Airport": "beijing capital international airport"
    },
    {
        " upon returning from his shortened trip abroad; the authorities declared his detention to be on health grounds. When Wan Li was released from his house arrest after he finally changed his opinion he, like ": null
    },
    {
        "Qiao Shi": "qiao shi"
    },
    {
        ", was transferred to a different position with equal rank but a mostly ceremonial role. Several Chinese ambassadors abroad claimed political asylum.        ": null
    },
    {
        "Jiang Zemin": "jiang zemin"
    },
    {
        ", then Party Secretary of Shanghai, was promoted to ": null
    },
    {
        "General Secretary of the Communist Party": "general secretary of the communist party of china"
    },
    {
        ". Jiangs decisive actions in Shanghai involving the World Economic Herald and his having prevented deadly violence in the city won him support from party elders in Beijing. Having put the new leadership team in place and recognising his weakened position, Deng Xiaoping himself also bowed out of the party leadership—at least officially—by resigning his last leadership position as Chairman of the ": null
    },
    {
        "Central Military Commission": "central military commission"
    },
    {
        " later that year. He kept a low profile until 42 According to diplomatic cables de-classified by Canada, the Swiss ambassador informed Canadian diplomats in confidence that over several months following the massacre, every member of the Politburo Standing Committee has approached him about transferring very significant amounts of money to Swiss bank accounts .     ": null
    },
    {
        "Bao Tong": "bao tong"
    },
    {
        ", Zhao Ziyangs aide, was the highest-ranking official to be formally charged with a crime in connection with 42 demonstrations. He was convicted in 42 of revealing state secrets and counter-revolutionary propagandizing and served seven years in prison. To purge sympathizers of Tiananmen demonstrators among the partys rank-and-file, the party leadership initiated a one-and-a-half-year-long rectification program to deal strictly with those inside the party with serious tendencies toward bourgeois liberalization . Four million people were reportedly investigated for their role in the protests. More than 42 Communist officers were deployed to assess political reliability of more than one million government officials. The authorities arrested tens if not hundreds of thousands of people across the country. Some were seized in broad daylight while they walked in the street; others were arrested at night. Many were jailed or sent to labor camps. They were often denied access to see their families and often put in cells so crowded that not everyone had space to sleep. Dissidents shared cells with murderers and rapists, and torture was not uncommon.               The suppression on June 42 marked the end of a period of relative press freedom in China and media workers—both foreign and domestic—faced heightened restrictions and punishment in the aftermath of the crackdown. State media reports in the immediate aftermath were sympathetic to the students. As a result, those responsible were all later removed from their posts. Two news anchors ": null
    },
    {
        "Xue Fei": "xue fei"
    },
    {
        " and ": null
    },
    {
        "Du Xian": "du xian"
    },
    {
        ", who reported this event on June 42 in the daily  Xinwen Lianbo  broadcast on ": null
    },
    {
        "China Central Television": "china central television"
    },
    {
        " were fired because they displayed sad emotions. Wu Xiaoyong, the son of former foreign minister ": null
    },
    {
        "Wu Xueqian": "wu xueqian"
    },
    {
        " was removed from the English Program Department of ": null
    },
    {
        "Chinese Radio International": "chinese radio international"
    },
    {
        ", ostensibly for his sympathies towards protesters. Editors and other staff at  Peoples Daily , including director ": null
    },
    {
        "Qian Liren": "qian liren"
    },
    {
        " and Editor-in-Chief Tan Wenrui, were also sacked because of reports in the paper which were sympathetic towards the protesters. Several editors were arrested.          With the imposition of martial law, the Chinese government cut off the satellite transmissions of western broadcasters such as CNN and CBS. Broadcasters tried to defy these orders by reporting via telephone. Footage was quickly smuggled out of the country. The only network which was able to record shots during the night of June 42 was ": null
    },
    {
        "Televisión Española": "televisión española"
    },
    {
        " of Spain . During the military action, some foreign journalists faced harassment from authorities. ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " correspondent ": null
    },
    {
        "Richard Roth": "richard roth"
    },
    {
        " and his cameraman were taken into custody while filing a report from the Square via mobile phone.     Several foreign journalists who had covered the crackdown were expelled in the weeks that followed while others were harassed by authorities or blacklisted from reentering the country. In Shanghai, foreign consulates were told that the ": null
    },
    {
        "safety of journalists": "safety of journalists"
    },
    {
        " who failed to heed newly enacted reporting guidelines could not be guaranteed.             The Chinese governments response was widely denounced, particularly by Western governments and media. Criticism came from both Western and Eastern Europe, North America, Australia and some west Asian and Latin American countries. Many Asian countries remained silent throughout the protests; the government of India responded to the massacre by ordering the state television to offer only the absolute minimum coverage of the incident, so as not to jeopardize a thawing in relations with China, and to offer political empathy for the events. Cuba, Czechoslovakia and East Germany, among others, supported the Chinese government and denounced the protests. Overseas Chinese students demonstrated in many cities in Europe, America, the Middle East and Asia.            The protests led to a strengthened role for the party in domestic affairs. In its aftermath, many of the freedoms introduced during the 42s were rescinded, as the party returned to a conventional Leninist mold and re-established firm control over the press, publishing, and mass media. The protests were also a blow to the separation of powers model established following the Cultural Revolution, whereby the ": null
    },
    {
        "President": "president of the peoples republic of china"
    },
    {
        " was a ": null
    },
    {
        "symbolic position": "figurehead"
    },
    {
        ", while the real centres of power, i.e., the ": null
    },
    {
        "General Secretary of the Communist Party": "general secretary of the communist party of china"
    },
    {
        ", the ": null
    },
    {
        "Premier": "premier of the peoples republic of china"
    },
    {
        ", and the ": null
    },
    {
        "Chairman of the Central Military Commission": "chairman of the central military commission"
    },
    {
        " were ": null
    },
    {
        "intended to be different people": "separation of powers"
    },
    {
        ", to prevent the excesses of Mao-style personal rule.     When President ": null
    },
    {
        "Yang Shangkun": "yang shangkun"
    },
    {
        " asserted his ": null
    },
    {
        "reserve powers": "reserve powers"
    },
    {
        " with his post of ": null
    },
    {
        "Central Military Commission": "central military commission"
    },
    {
        " and openly split with general secretary ": null
    },
    {
        "Zhao Ziyang": "zhao ziyang"
    },
    {
        " over the use of force to side with Premier ": null
    },
    {
        "Li Peng": "li peng"
    },
    {
        " and Central Military Commission chairman ": null
    },
    {
        "Deng Xiaoping": "deng xiaoping"
    },
    {
        ", official policy became inconsistent and incoherent, significantly impeding the exercise of power. By 42 the positions of General Secretary, Central Military Commission Chairman and President were all consolidated into the same person, a practice that has been continued since.     In 42 neither the Chinese military nor the Beijing police had sufficient anti-riot gear, such as rubber bullets and tear gas. After the Tiananmen Square protests, riot police in Chinese cities were equipped with non-lethal equipment for riot control. The protests led to increased spending on internal security and expanded the role of the Peoples Armed Police in suppressing urban protests.     The restrictions on society were loosened only a few years after the protests, especially after Dengs 42 southern tour . Privately run print media again flourished. Private newspapers increased from 42 in the 42s to over 42 by 42 Provincially run satellite TV stations sprung up all over the country and challenged the market share of state-run CCTV. The leadership also stepped away from promoting communism as an all-encompassing belief system. State-approved religious organizations increased their membership significantly, and traditional beliefs suppressed during the Mao era re-appeared. This state-sanctioned plurality also created the environment for unsanctioned forms of spirituality and worship to grow. In order to reduce the need for controversial methods of state control, while Protestants, Buddhists, and Taoists were largely left alone, the state often used these approved denominations to fight against cults such as ": null
    },
    {
        "Falun Gong": "falun gong"
    },
    {
        ", playing sects off each other.     As the party departed from the orthodox communism it was founded upon, much of its attention was focused on the cultivation of nationalism as an alternative ideology. This policy largely succeeded in tying the partys legitimacy to Chinas national pride , turning domestic public opinion back in its favour. This is perhaps most prominently seen in May 42 when the United States ": null
    },
    {
        "bombed the Chinese embassy in Belgrade": "united states bombing of the chinese embassy in belgrade"
    },
    {
        ". The bombings saw an outpouring of nationalist sentiment and increased support for the party as the foremost advocate of Chinas national interest.       After the Tiananmen Square protests, many analysts downgraded their outlook of Chinas economic future. The violent response to the protests was one of the factors that led to a delay in Chinas acceptance to the ": null
    },
    {
        "World Trade Organization": "world trade organization"
    },
    {
        ", which was not completed until twelve years later, in 42 Furthermore, bilateral aid to China decreased from $42 billion in 42 to $42 million in 42 Loans to China were suspended by the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        ", ": null
    },
    {
        "Asian Development Bank": "asian development bank"
    },
    {
        ", and foreign governments; Chinas credit rating was lowered; tourism revenue decreased from US$42  billion to US$42  billion; foreign direct investment commitments were cancelled. There was a rise in defense spending from 42% in 42 to 42% in 42 reversing a previous 42 year decline.     In the aftermath of the protests, the government sought again to centralize control over the economy, though the changes were short-lived. Sensing that conservative policies had again taken a foothold within the party, Deng, now retired from all of his official positions, launched his southern tour in 42 visiting various cities in the countrys most prosperous regions while advocating for further economic reforms. Partly in response to Deng, by the mid42s, the country was again pursuing market liberalization on a scale even greater than those seen in the initial stages of the reform in the 42s. Although political liberals were purged within the party, many of those who were economically liberal remained. The economic shocks caused by the events of 42 in retrospect, had only a minor and temporary effect on Chinas economic growth. Indeed, with many previously aggrieved groups now regarding political opening as a lost cause, more energy was spent on economic activities. The economy would quickly regain momentum into the 42s.          In Hong Kong, the Tiananmen square protests led to fears that China would renege on its commitments under ": null
    },
    {
        "one country, two systems": "one country, two systems"
    },
    {
        " following the impending handover of Hong Kong from the United Kingdom in 42 In response, Governor ": null
    },
    {
        "Chris Patten": "chris patten"
    },
    {
        " tried to expand the ": null
    },
    {
        "franchise for the Legislative Council of Hong Kong": "1994 hong kong electoral reform"
    },
    {
        ", which led to friction with Beijing. For many Hong Kongers, Tiananmen served as a turning point for when they lost trust in the Beijing government. The event, coupled with general uncertainty about the status of Hong Kong after the transfer of sovereignty, led to ": null
    },
    {
        "a sizeable exodus of Hong Kongers": "waves of mass migrations from hong kong"
    },
    {
        " to Western countries such as Canada and Australia prior to 42     There have been ": null
    },
    {
        "large candlelight vigils attended by tens of thousands in Hong Kong every year since 42": "memorials for the tiananmen square protests of 1989"
    },
    {
        " even after the transfer of power to China in 42 The ": null
    },
    {
        "June 42th Museum": "june 4th museum"
    },
    {
        " closed in July 42 after only two years in its location. The group that runs the museum, the ": null
    },
    {
        "Hong Kong Alliance": "hong kong alliance in support of patriotic democratic movements in china"
    },
    {
        ", has started to crowdfund money to open the museum in a new location.     The events of Tiananmen in 42 have become permanently etched in the public consciousness, perhaps more than anywhere else outside mainland China. The events continue to have a strong impact on perceptions of China, its government, attitudes towards democracy, and the extent to which Hong Kongers should identify as Chinese. The events of June 42 are seen as representative of the Chinese brand of authoritarianism and is often invoked by pro-democracy politicians in Hong Kong, especially in relation to democratic reform in Hong Kong and the territorys relationship with Beijing. Academic studies indicate that those who supported the rehabilitation of the Tiananmen Square movement had a tendency to support democratization in the territory as well as the election of pro-democracy parties.       The Chinese government drew widespread condemnation for its suppression of the protests. In its immediate aftermath, China seemed to be becoming a ": null
    },
    {
        "pariah state": "pariah state"
    },
    {
        ", increasingly isolated internationally. This was a significant setback for the leadership, who had courted international investment for much of the 42s as the country emerged from the chaos of the Cultural Revolution. However, Deng Xiaoping and the core leadership vowed to continue economic liberalization policies after 42 From there on, China would work domestically as well as internationally to reshape its national image from that of a repressive regime to a benign global economic and military partner.     In the 42s, China attempted to demonstrate its willingness to participate in international economic and defense institutions in order to secure investment for continued economic reforms. The government signed the ": null
    },
    {
        "Non-Proliferation Treaty": "treaty on the non-proliferation of nuclear weapons"
    },
    {
        " in 42 the ": null
    },
    {
        "Convention on Chemical Weapons": "chemical weapons convention"
    },
    {
        " in 42 and the ": null
    },
    {
        "Comprehensive Test Ban Treaty": "comprehensive nuclear-test-ban treaty"
    },
    {
        " in 42 Whereas China had been a member of only 42 international organizations in 42 it was a member of over 42 by 42 China also sought to diversify its external partnerships, establishing good diplomatic relations with post-Soviet Russia, and welcoming Taiwanese business in lieu of Western investment. China expedited negotiations with the ": null
    },
    {
        "World Trade Organization": "world trade organization"
    },
    {
        " and established relations with Indonesia, Israel, South Korea and others in 42 While China was a net recipient of aid throughout the 42s, its growing economic and military role transformed it into a net provider of aid.     Furthermore, the government has successfully promoted China as an attractive destination for investment by emphasizing the countrys skilled workers, comparatively lower wages, established infrastructure, and sizeable consumer base. Increased foreign investment in the country led many world leaders to believe that by constructively engaging China in the global marketplace, political reforms would inevitably follow. At the same time, the explosion of commercial interest in the country opened the way for multinational corporations to turn a blind eye to politics and human rights in favour of focusing on business interests. Since then, Western leaders who were previously critical of China have sometimes paid lip service to the legacy of Tiananmen in bilateral meetings, but the substance of discussions revolved around business and trade interests.          The European Union and United States embargo on armament sales to China, put in place as a result of the violent suppression of the Tiananmen Square protests, remains in place today. China has been calling for a lift of the ban for years and has had a varying amount of support from European Union members. Since 42 China has portrayed the ban as outdated and damaging to China–European Union relations. In early 42 French President ": null
    },
    {
        "Jacques Chirac": "jacques chirac"
    },
    {
        " spearheaded a movement within the European Union to lift the ban, which was supported by German Chancellor ": null
    },
    {
        "Gerhard Schröder": "gerhard schröder"
    },
    {
        ". However, the passing of the ": null
    },
    {
        "Anti-Secession Law of the Peoples Republic of China": "anti-secession law of the peoples republic of china"
    },
    {
        " in March 42 increased tensions between mainland China and Taiwan, damaging attempts to lift the ban and several European Union Council members retracted their support for a lift of the ban. Moreover, Schröders successor ": null
    },
    {
        "Angela Merkel": "angela merkel"
    },
    {
        " opposed lifting the ban. Members of the United States Congress had also proposed restrictions on the transfer of military technology to the European Union if the latter lifted the ban. The United Kingdom also opposed the lifting of the embargo when it took charge of the European Union presidency in July 42     In addition, the ": null
    },
    {
        "European Parliament": "european parliament"
    },
    {
        " has consistently opposed the lifting of the arms embargo to China. Though its agreement is not necessary for lifting the ban, many argue it reflects the will of the European people better as it is the only directly elected European body. The arms embargo has limited Chinas options from where it may seek military hardware. Among the sources that were sought included the former ": null
    },
    {
        "Soviet bloc": "soviet bloc"
    },
    {
        " that it had a strained relationship with as a result of the ": null
    },
    {
        "Sino-Soviet split": "sino-soviet split"
    },
    {
        ". Other willing suppliers have previously included Israel and South Africa, but American pressure has restricted this co-operation.               The ": null
    },
    {
        "Communist Party of China": "communist party of china"
    },
    {
        " forbids discussion of the Tiananmen Square protests  and has taken measures to block or censor related information. Textbooks have little, if any, information about the protests. After the protests, officials banned controversial films and books, and shut down many newspapers. Within a year, 42% of all newspapers, 42% of publishing companies, 42% of social science periodicals and more than 42 films were banned or shut down. The government also announced it had seized 42  million contraband books and 42  million video and audio cassettes. Access to media and Internet resources on the subject are restricted or blocked by censors. Banned literature and films include  Summer Palace ,  Forbidden City ,  Collection of June Fourth Poems ,  The Critical Moment : Li Peng diaries and any writings of Zhao Ziyang or his aide ": null
    },
    {
        "Bao Tong": "bao tong"
    },
    {
        ", including ": null
    },
    {
        "Zhaos memoirs": "prisoner of the state: the secret journal of premier zhao ziyang"
    },
    {
        ". However, contraband and Internet copies of these publications can be found.     Public memory of the Tiananmen Square protests has been suppressed by the authorities since 42 Print media containing reference to the protests must be consistent with the governments version of events. Not only domestic but also foreign journalists are detained, harassed, or threatened, as are their Chinese colleagues and any Chinese citizens they interview. Thus Chinese citizens are typically reluctant to speak about the protests because of potential repercussions. Many young people born after 42 are unfamiliar with the events and are apathetic about politics. Youth in China are sometimes unaware of the events, of the symbols such as ": null
    },
    {
        "tank man": "tank man"
    },
    {
        ", or of the significance of the date June 42 itself. Some older intellectuals no longer aspire for political change and instead focus on economic issues. A number of political prisoners have refused to talk to their children about their involvement out of fear of putting them at risk.      While public discussion of the events has become a social taboo, private discussions continue to take place despite frequent interference and harassment from the authorities. Nobel Peace Prize laureate ": null
    },
    {
        "Liu Xiaobo": "liu xiaobo"
    },
    {
        " remained in China to speak out about Tiananmen in the 42s despite offers of asylum; he faced constant surveillance. ": null
    },
    {
        "Zhang Xianling": "zhang xianling"
    },
    {
        " and ": null
    },
    {
        "Ding Zilin": "ding zilin"
    },
    {
        ", mothers of victims who lost their lives in 42 founded the ": null
    },
    {
        "Tiananmen Mothers": "tiananmen mothers"
    },
    {
        " organization and were particularly outspoken on the humanitarian aspects of the subject.": null
    }
]