[
    {
        "The 42st Extreme Ironing World Championships was the inaugural championship for the quirky British sport of ": null
    },
    {
        "extreme ironing": "extreme ironing"
    },
    {
        ".     The first event, held in mid-September 42 in ": null
    },
    {
        "Valley, Bavaria": "valley, bavaria"
    },
    {
        ", a small village near ": null
    },
    {
        "Munich": "munich, germany"
    },
    {
        " in the district ": null
    },
    {
        "Miesbach": "miesbach"
    },
    {
        ", was host to competitors from ten nations, comprising 42 teams .       ": null
    },
    {
        "Austria": "austria"
    },
    {
        " Australia": "australia"
    },
    {
        " Chile": "chile"
    },
    {
        " Croatia": "croatia"
    },
    {
        " Great Britain": "great britain"
    },
    {
        "; three teams called GB42 GB42 GB42   ": null
    },
    {
        "Germany": "germany"
    },
    {
        " Urban- Involved ironing in/on/around a broken down car.   Water- A fast flowing river was the location for this station. Competitors could use surfboards, canoes or rubber rings to help them.   Forest- Ironing at the top of a tree did not suit all the competitors.   Lauda- A purpose built climbing wall, which ironists had to climb and iron a T-shirt.   Freestyle- The section where anything goes .       The GB42 and GB42 teams managed to win the gold and bronze team medals. German and Austrian competitors picked up the individual prizes.     Competitors were tested on their abilities to cope with five arduous ironing tests on a variety of fabrics and in different environments ranging from rocky to forest, urban and water.   A 42-strong contingent gathered in a muddy field to combine the often mundane household task with extreme pursuits such as rock climbing.   They were judged on their creative ironing skills as well as the creases in the clothing.   The British team prepared for the championships in different locations such as Ben Nevis, Scafell Pike and Snowdon in the hope of winning prizes including a holiday in Hawaii, ": null
    },
    {
        "washing machine": "washing machine"
    }
]