[
    {
        "         __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time it was known as the Year of the Consulship of Caudex and Flaccus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.                 ": null
    },
    {
        "Abantidas": "abantidas"
    },
    {
        ", the son of ": null
    },
    {
        "Paseas": "paseas"
    },
    {
        ", becomes ": null
    },
    {
        "tyrant": "tyrant"
    },
    {
        " of the Greek city-state of ": null
    },
    {
        "Sicyon": "sicyon"
    },
    {
        " after murdering Cleinias. He either banishes or puts to death Cleinias friends and relations. Cleinias young son, ": null
    },
    {
        "Aratus": "aratus of sicyon"
    },
    {
        ", narrowly escapes death.       The ": null
    },
    {
        "tyrant": "tyrant"
    },
    {
        " of ": null
    },
    {
        "Syracuse": "syracuse, sicily"
    },
    {
        ", ": null
    },
    {
        "Hiero II": "hiero ii of syracuse"
    },
    {
        ", once more attacks the ": null
    },
    {
        "Mamertines": "mamertines"
    },
    {
        ". They ally themselves with a nearby Carthaginian fleet and hold off the Syracusans. However, when the Carthaginians do not leave, the Mamertines appeal to Rome for an alliance, hoping for more reliable protection. Although initially reluctant to assist, lest it encourage other mercenary groups to mutiny, Rome is unwilling to see Carthaginian power spread further over ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " and encroach on ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". Rome therefore enters into an alliance with the Mamertines. By this action, the ": null
    },
    {
        "First Punic War": "first punic war"
    },
    {
        " begins and will embroil ": null
    },
    {
        "Rome": "roman republic"
    },
    {
        " in a conflict with ": null
    },
    {
        "Carthage": "carthage"
    },
    {
        " that will continue for 42 years.   The Roman ": null
    },
    {
        "consul": "consul"
    },
    {
        " Appius Claudius Caudex": "appius claudius caudex"
    },
    {
        " and his two legions are deployed to Sicily, the first time a Roman army has gone into action outside the Italian peninsula.   Appius Claudius Caudex leads his forces to ": null
    },
    {
        "Messina": "messina"
    },
    {
        ", and as the Mamertines have convinced the Carthaginians to withdraw, he meets with only minimal resistance. The Mamertines hand the city over to Appius Claudius, but the Carthaginians return to set up a blockade. The Syracusans, meanwhile, are also stationed outside the city.   Appius Claudius leads his troops outside the city of Messina to defeat the Syracusans in battle forcing Hiero to retreat back to Syracuse. The next day Claudius defeats the Carthaginians.   The temple to ": null
    },
    {
        "Vertumnus": "vertumnus"
    },
    {
        " is built on the ": null
    },
    {
        "Aventine Hill": "aventine hill"
    },
    {
        " in ": null
    },
    {
        "Rome": "rome"
    },
    {
        ".   Three pairs of ": null
    },
    {
        "gladiator": "gladiator"
    },
    {
        "s face off in the first recorded gladiatorial combat, held at the funeral games in honour of aristocrat Junius Brutus Pera in the Forum Boarium.       The Chinese ": null
    },
    {
        "Confucian": "confucianism"
    },
    {
        " philosopher ": null
    },
    {
        "Xunzi": "xun kuang"
    },
    {
        " visits the ": null
    },
    {
        "State of Qin": "qin"
    },
    {
        ". He writes of his and others admiration for the government officials of Qin, whom he says are serious and sincere, free from the tendency to form cliques. The Qin officials are disciplined by a ": null
    },
    {
        "meritocracy": "meritocracy"
    },
    {
        " of rather harsh methods imposed by the ": null
    },
    {
        "Legalist philosophy": "legalism"
    }
]