[
    {
        "      __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time it was known as the Year of the Consulship of Gurges and Clepsina . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             The ": null
    },
    {
        "Egyptian": "ancient egypt"
    },
    {
        " King ": null
    },
    {
        "Ptolemy IIs": "ptolemy ii philadelphus"
    },
    {
        " first wife, ": null
    },
    {
        "Arsinoe I": "arsinoe i of egypt"
    },
    {
        "  is accused, probably at instigation of Ptolemy IIs sister , of plotting his murder and is exiled by the King. Arsinoe then marries her own brother, a customary practice in Egypt, but scandalous to the Greeks. The suffix Philadelphoi consequently is added to the names of King Ptolemy II and Queen Arsinoe II. The former queen, Arsinoe I, is banished to ": null
    },
    {
        "Coptos": "coptos"
    },
    {
        ", a city of ": null
    },
    {
        "Upper Egypt": "upper egypt"
    },
    {
        " near the ": null
    },
    {
        "Wadi Hammamat": "stone quarries of ancient egypt"
    },
    {
        ", while her rival adopts her children.   The first of the ": null
    },
    {
        "Syrian Wars": "syrian wars"
    },
    {
        " starts between Egypts Ptolemy II and Seleucid emperor ": null
    },
    {
        "Antiochus I Soter": "antiochus i soter"
    },
    {
        ". The Egyptians invade northern ": null
    },
    {
        "Syria": "syria"
    },
    {
        ", but Antiochus defeats and repels his opponents army.       ": null
    },
    {
        "Pyrrhus": "pyrrhus of epirus"
    },
    {
        " negotiates with the ": null
    },
    {
        "Carthaginians": "carthage"
    },
    {
        " to end the fighting between them in ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". The Carthaginians are inclined to come to terms with Pyrrhus, but he demands that Carthage abandon all of Sicily and make the Libyan Sea the boundary between Carthage and the Greeks. Meanwhile, he begins to display despotic behaviour towards the Sicilian Greeks and soon Sicilian opinion moves against him. Therefore, fearing that his successes in Sicily may lead him to become the despot of their country, the ": null
    },
    {
        "Syracusans": "syracuse, sicily"
    },
    {
        " ask Pyrrhus to leave Sicily. He does so, and returns to the Italian mainland, noting that he expects Sicily to be a fair wrestling ring for Carthage and ": null
    },
    {
        "Rome": "roman republic"
    },
    {
        ".         ": null
    },
    {
        "Eratosthenes": "eratosthenes"
    },
    {
        ", Greek mathematician, geographer and astronomer ": null
    }
]