[
    {
        "The 42s decade ran from January 42 42 to December 42 42            In Yamato , the ": null
    },
    {
        "Kofun period": "kofun period"
    },
    {
        " dominated during this decade. It was an ": null
    },
    {
        "animistic": "animistic"
    },
    {
        " culture which existed prior the introduction of ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        ". A legend of the 42th century Prince ": null
    },
    {
        "Yamato Takeru": "yamato takeru"
    },
    {
        " alludes to the borders of the ": null
    },
    {
        "Yamato": "yamato province"
    },
    {
        " and battlegrounds in the area. A frontier was obviously somewhere close to the later ": null
    },
    {
        "Izumo province": "izumo province"
    },
    {
        " . Another frontier, in ": null
    },
    {
        "Kyūshū": "kyūshū"
    },
    {
        ", was apparently somewhere north of todays ": null
    },
    {
        "Kumamoto prefecture": "kumamoto prefecture"
    },
    {
        ". The legend specifically states that there was an eastern land in Honshū whose people disobeyed the imperial court , against whom ": null
    },
    {
        "Yamato Takeru": "yamato takeru"
    },
    {
        " was sent to fight. That rivalling country may have been located rather close to the Yamato nucleus area itself, or relatively far away. The today ": null
    },
    {
        "Kai province": "kai province"
    },
    {
        " is mentioned as one of the locations where prince Yamato Takeru sojourned in his said military expedition.     Northern frontier of this age was also explained in Kojiki as the legend of Shido Shōguns expedition. Out of four shōguns, Ōbiko set northward to Koshi and his son Take Nunakawawake set to eastern states. The father moved east from northern Koshi while the son moved north on his way, and they finally met at Aizu . Although the legend itself is not likely to be a historical fact, Aizu is rather close to southern Tōhoku, where the north end of keyhole kofun culture as of late 42th century is located.            ": null
    }
]