[
    {
        "      __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Year of the Dictatorship of Cursor . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.                 On returning to ": null
    },
    {
        "Susa": "susa"
    },
    {
        ", ": null
    },
    {
        "Persia": "achaemenid empire"
    },
    {
        ", ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " punishes those who he considers to have failed in their duties in his absence in ": null
    },
    {
        "India": "india"
    },
    {
        ", particularly those who have plundered tombs and temples. Alexander continues his policy of replacing senior officials and executing defaulting governors. Over a third of his ": null
    },
    {
        "satrap": "satrap"
    },
    {
        "s are replaced and six are put to death. Three generals in ": null
    },
    {
        "Media": "medes"
    },
    {
        ", including Cleander, the brother of ": null
    },
    {
        "Coenus": "coenus"
    },
    {
        " , are accused of extortion and are arrested, tried and executed.   While at Susa, Alexander holds a feast to celebrate his capture of the ": null
    },
    {
        "Persian Empire": "achaemenid empire"
    },
    {
        ".   To further his policy of integrating the ": null
    },
    {
        "Macedon": "macedon"
    },
    {
        "ians and Persians, Alexander and 42 of his officers take Persian wives. He and ": null
    },
    {
        "Hephaestion": "hephaestion"
    },
    {
        " marry ": null
    },
    {
        "Darius III": "darius iii"
    },
    {
        "s daughters ": null
    },
    {
        "Barsine": "barsine"
    },
    {
        "  and ": null
    },
    {
        "Drypteis": "drypteis"
    },
    {
        ", respectively, and 42 of his soldiers with native wives are given generous ": null
    },
    {
        "dowries": "dowry"
    },
    {
        ". His determination to incorporate Persians on equal terms into his army and into the administration of the provinces is bitterly resented by the Macedonians.   Alexander the Great spends the summer and autumn at the Median capital, ": null
    },
    {
        "Ecbatana": "ecbatana"
    },
    {
        ", where his best friend, ": null
    },
    {
        "Hephaistion": "hephaistion"
    },
    {
        ", dies during the autumn. Alexander indulges in extravagant mourning for his closest friend.   Winter & ndash; Alexander carries out a savage ": null
    },
    {
        "punitive expedition": "punitive expedition"
    },
    {
        " against the ": null
    },
    {
        "Cossaeans": "kassites"
    },
    {
        " in the hills of ": null
    },
    {
        "Luristan": "luristan"
    },
    {
        ".       ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        "s treasurer, ": null
    },
    {
        "Harpalus": "harpalus"
    },
    {
        ", fearing arrest, flees from ": null
    },
    {
        "Susa": "susa"
    },
    {
        " to ": null
    },
    {
        "Athens": "athens"
    },
    {
        ". On arriving in Athens, he is imprisoned by the Athenians after a proposal of ": null
    },
    {
        "Demosthenes": "demosthenes"
    },
    {
        " and ": null
    },
    {
        "Phocion": "phocion"
    },
    {
        ", despite ": null
    },
    {
        "Hypereides": "hypereides"
    },
    {
        " opposition, who wanted an immediate uprising against Alexander. Harpalus brings with him considerable wealth collected from the spoils of Alexanders conquest of Asia. This money is entrusted to a committee led by ": null
    },
    {
        "Demosthenes": "demosthenes"
    },
    {
        ".   ": null
    },
    {
        "Dinarchus": "dinarchus"
    },
    {
        ", a professional speech writer in Athens, comes to prominence in the scandal that follows the flight to Athens of Alexander the Greats treasurer, Harpalus. When Harpalus escapes and flees to ": null
    },
    {
        "Crete": "crete"
    },
    {
        ", Dinarchus writes the prosecution speeches against Demosthenes, ": null
    },
    {
        "Demades": "demades"
    },
    {
        ", Aristogiton, Philocles and other well-known politicians accused of misappropriating some of this money.   Demosthenes is convicted and imprisoned after being found guilty of misappropriating some of the funds that Alexanders treasurer, Harpalus, has brought with him. He escapes into exile, although his sentence is soon repealed. Although ": null
    },
    {
        "Hypereides": "hypereides"
    },
    {
        " has supported Demosthenes in his struggle against the Macedonians, that support is withdrawn after the Harpalus affair. After Demosthenes exile, Hypereides becomes the head of the patriotic party in Athens.   Greek colonists found the city of ": null
    },
    {
        "Akra Leuka": "alicante"
    },
    {
        "  on the Mediterranean coast of the ": null
    },
    {
        "Iberian peninsula": "iberian peninsula"
    },
    {
        ".         ": null
    },
    {
        "Antiochus I Soter": "antiochus i soter"
    },
    {
        ", King of the ": null
    },
    {
        "Seleucid dynasty": "seleucid dynasty"
    },
    {
        "        Hephaestion": "hephaestion"
    },
    {
        ", son of Amyntor, a Macedonian general, soldier, aristocrat, and possibly lover of Alexander the Great ": null
    }
]