[
    {
        "      __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Year of the Consulship of Proculus and Scapula or Decianus and Barbatus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.                 At ": null
    },
    {
        "Maracanda": "samarkand"
    },
    {
        ", Alexander murders ": null
    },
    {
        "Cleitus": "cleitus the black"
    },
    {
        ", one of his most trusted commanders, friend and foster-brother, in a drunken quarrel; but his excessive display of remorse leads the army to pass a decree convicting Cleitus posthumously of treason.   ": null
    },
    {
        "Spitamenes": "spitamenes"
    },
    {
        " raises all ": null
    },
    {
        "Sogdiana": "sogdiana"
    },
    {
        " in revolt behind him, bringing in the ": null
    },
    {
        "Massagetae": "massagetae"
    },
    {
        ", a people of the ": null
    },
    {
        "Scythian": "scythians"
    },
    {
        " confederacy. He besieges the Macedonian garrison in ": null
    },
    {
        "Maracanda": "maracanda"
    },
    {
        ". ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " sends an army under the command of ": null
    },
    {
        "Pharnuches of Lycia": "pharnuches of lycia"
    },
    {
        " which is promptly annihilated with a loss of more than 42 infantry and 42 cavalry.   Understanding now the danger represented by his enemy, Alexander moves personally to relieve Maracanda, only to learn that Spitamenes has left Sogdiana. Spitamenes then attacks ": null
    },
    {
        "Bactra": "balkh"
    },
    {
        ", from where he is repulsed with great difficulty by the ": null
    },
    {
        "satrap": "satrap"
    },
    {
        " of ": null
    },
    {
        "Bactria": "bactria"
    },
    {
        ", ": null
    },
    {
        "Artabazus of Phrygia": "artabazus of phrygia"
    },
    {
        ".   Alexander attacks ": null
    },
    {
        "Oxyartes": "oxyartes"
    },
    {
        " and the remaining Bactrian barons who are holding out in the hills of Paraetacene . The Macedonians seize the crag on which Oxyartes has his stronghold , and among the captives is his daughter, ": null
    },
    {
        "Roxana": "roxana"
    },
    {
        ". In the reconciliation that follows the battle, Alexander marries Roxana. The rest of Oxyartes opponents are either won over or crushed.   December & ndash; ": null
    },
    {
        "Spitamenes": "spitamenes"
    },
    {
        " is badly defeated by Alexanders general ": null
    },
    {
        "Coenus": "coenus"
    },
    {
        ". At this point Spitamenes allies, feeling the situation desperate, kill their leader and send his head as a gift to Alexander.               ": null
    },
    {
        "Cleitus": "cleitus the black"
    },
    {
        ", lieutenant and friend of Alexander the Great    ": null
    },
    {
        "Spitamenes": "spitamenes"
    },
    {
        ", Persian nobleman ": null
    }
]