[
    {
        "         __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time it was known as the Year of the Consulship of Poplicola and Rutilus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             After two initial efforts, ": null
    },
    {
        "Philip II of Macedon": "philip ii of macedon"
    },
    {
        " drives the ": null
    },
    {
        "Phocians": "phocians"
    },
    {
        " south after a major victory over them in the ": null
    },
    {
        "Battle of Crocus Field": "battle of crocus field"
    },
    {
        ". ": null
    },
    {
        "Athens": "athens"
    },
    {
        " and ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        " come to the assistance of the Phocians and Philip is checked at ": null
    },
    {
        "Thermopylae": "thermopylae"
    },
    {
        ". Philip does not attempt to advance into central Greece with the Athenians occupying this pass. With this victory, Philip accrues great glory as the righteous avenger of ": null
    },
    {
        "Apollo": "apollo"
    },
    {
        ", since the Phocian general Onomarchos has plundered the sacred treasury of ": null
    },
    {
        "Delphi": "delphi"
    },
    {
        " to pay his mercenaries. Onomarchos body is crucified, and the prisoners are drowned as ritual demanded for temple-robbers.   Philip then moves against ": null
    },
    {
        "Thrace": "thrace"
    },
    {
        ". He makes a successful expedition into Thrace, gaining a firm ascendancy in the country, and brings away a son of ": null
    },
    {
        "Cersobleptes": "cersobleptes"
    },
    {
        ", the King of Thrace, as a hostage. Philip IIs Thessalian victory earns him election as president  of the ": null
    },
    {
        "Thessalian League": "thessaly"
    },
    {
        ".       ": null
    },
    {
        "Antiochus Gelotopoios": "antiochus gelotopoios"
    },
    {
        ", Greek admiral serving in the fleet of ": null
    },
    {
        "Alexander the Great": "alexander the great"
    }
]