[
    {
        "         __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Year of the Tribunate of Cornelius, Praetextatus, Structus, Capitolinus, Crassus and Cicurinus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             While the previous years intervention by the ": null
    },
    {
        "Macedon": "macedon"
    },
    {
        "ians in ": null
    },
    {
        "Thessaly": "thessaly"
    },
    {
        " is successful, after the Macedonian troops withdraw, ": null
    },
    {
        "Alexander of Pherae": "alexander of pherae"
    },
    {
        " treats his subjects as cruelly as before. So the Thessalians seek ": null
    },
    {
        "Thebes": "thebes, greece"
    },
    {
        " support. ": null
    },
    {
        "Pelopidas": "pelopidas"
    },
    {
        " is sent to their assistance, but is treacherously seized and imprisoned.   In response, ": null
    },
    {
        "Epaminondas": "epaminondas"
    },
    {
        " is reinstated in command of Theban troops and leads the Theban army into Thessaly, where he outmanoeuvres the Thessalians and secures the release of Pelopidas without a fight.   At the instigation of Alexanders brother-in-law, Ptolemy of Aloros, ": null
    },
    {
        "Alexander II of Macedon": "alexander ii of macedon"
    },
    {
        " is assassinated during a festival. Although Alexanders brother, ": null
    },
    {
        "Perdiccas III": "perdiccas iii"
    },
    {
        " becomes the next king, he is under age, and Ptolemy is appointed ": null
    },
    {
        "regent": "regent"
    },
    {
        ".       ": null
    },
    {
        "Zhou Xian Wang": "zhou xian wang"
    },
    {
        " becomes King of the ": null
    },
    {
        "Zhou Dynasty": "zhou dynasty"
    },
    {
        " of ": null
    },
    {
        "China": "china"
    },
    {
        ".         ": null
    },
    {
        "Plato": "plato"
    },
    {
        "s  Republic  is completed. It lays down the rules for an ideal, righteous society and suggests that kings ought to be philosophers .               ": null
    },
    {
        "Alexander II": "alexander ii of macedon"
    }
]