[
    {
        "         __FORCETOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Year of the Tribunate of Capitolinus, Vulso, Iullus, Sextilius, Albinius, Antistius, Trebonius and Erenucius . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.               ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        " suppresses the ": null
    },
    {
        "Chalcidian League": "chalcidian league"
    },
    {
        " and imposes terms favourable to King ": null
    },
    {
        "Amyntas III of Macedon": "amyntas iii of macedon"
    },
    {
        "ia.   A small group of ": null
    },
    {
        "Theban": "thebes, greece"
    },
    {
        " exiles, led by ": null
    },
    {
        "Pelopidas": "pelopidas"
    },
    {
        ", infiltrate the city of ": null
    },
    {
        "Thebes": "thebes, greece"
    },
    {
        " and assassinate the leaders of the pro-Spartan government. ": null
    },
    {
        "Epaminondas": "epaminondas"
    },
    {
        " and ": null
    },
    {
        "Gorgidas": "gorgidas"
    },
    {
        " lead a group of young men who break into the citys armories, take weapons, and surround the Spartans on the ": null
    },
    {
        "Cadmea": "cadmea"
    },
    {
        ", assisted by a force of ": null
    },
    {
        "Athenian": "athens"
    },
    {
        " hoplites": "hoplites"
    },
    {
        ". In the Theban assembly the next day, Epaminondas and Gorgidas bring Pelopidas and his men before the audience and exhort the Thebans to fight for their freedom. The assembly respond by acclaiming Pelopidas and his men as liberators. Fearing for their lives, the Spartan garrison surrender and are evacuated. The Thebans of the pro-Spartan party are also allowed to surrender; they are subsequently executed.   The Thebans are able to reconstitute their old Boeotian confederacy in a new, democratic form. The cities of ": null
    },
    {
        "Boeotia": "boeotia"
    },
    {
        " unite as a federation with an executive body composed of seven generals, or ": null
    },
    {
        "Boeotarch": "boeotarch"
    },
    {
        "s, elected from seven districts throughout Boeotia.           ": null
    },
    {
        "Rome": "rome"
    }
]