[
    {
        "         __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Year of the Consulship of Mugillanus and Rutilus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             ": null
    },
    {
        "June 42": "june 9"
    },
    {
        " & ndash; The ": null
    },
    {
        "democracy": "democracy"
    },
    {
        " of ": null
    },
    {
        "Athens": "athens"
    },
    {
        " is overthrown by the ": null
    },
    {
        "oligarchic": "oligarchy"
    },
    {
        " extremists, ": null
    },
    {
        "Antiphon": "antiphon"
    },
    {
        ", ": null
    },
    {
        "Theramenes": "theramenes"
    },
    {
        ", Peisander and ": null
    },
    {
        "Phrynichus": "phrynichus"
    },
    {
        " in an effort by the oligarchists to exert more control over the conduct of ": null
    },
    {
        "the war": "peloponnesian war"
    },
    {
        " with ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        " and its allies. A ": null
    },
    {
        "Council of Four Hundred": "the four hundred"
    },
    {
        " is set up. The total defeat of the ": null
    },
    {
        "Athenian expedition": "sicilian expedition"
    },
    {
        " to ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " and the consequent revolts of many of the subject-allies has weakened Athenian finances severely; the acknowledged purpose of the revolutionary movement is to revise the constitution to better run Athens finances. However, its rule is high-handed and the Council of Four Hundred is only able to maintain itself for four months.   When a mutiny breaks out amongst the troops who are fortifying ": null
    },
    {
        "Piraeus": "piraeus"
    },
    {
        " , the Council sends ": null
    },
    {
        "Theramenes": "theramenes"
    },
    {
        " to quell it. Instead, he puts himself at the head of the mutineers. After Phrynichus, the leader of the extremists, is assassinated, an ensuing meeting of the Athenian Assembly deposes the Council and restores the traditional constitution, but restricts some of the privileges of citizenship to a body called the Five Thousand. The Assembly resumes its old form in being a committee of all citizens.   The Athenian navy under ": null
    },
    {
        "Thrasybulus": "thrasybulus"
    },
    {
        " recalls ": null
    },
    {
        "Alcibiades": "alcibiades"
    },
    {
        " from ": null
    },
    {
        "Sardis": "sardis"
    },
    {
        ". Alcibiades election is confirmed by the Athenians at the request of Theramenes. A Spartan fleet in the ": null
    },
    {
        "Hellespont": "hellespont"
    },
    {
        " at ": null
    },
    {
        "Cynossema": "battle of cynossema"
    },
    {
        " is then defeated by an Athenian fleet commanded by Thrasybulus and Alcibiades.   Antiphon defends himself in a speech ": null
    },
    {
        "Thucydides": "thucydides"
    },
    {
        " describes as the greatest ever made by a man on trial for his life. Nevertheless, Antiphon is unable to persuade his accusers and he is executed for ": null
    },
    {
        "treason": "treason"
    },
    {
        ".         ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        " play  Iphigenia in Tauris  is performed.   ": null
    },
    {
        "Aristophanes": "aristophanes"
    },
    {
        " plays  Lysistrata  and  Women Celebrating the Thesmophoria  are performed.         ": null
    },
    {
        "Timoleon": "timoleon"
    },
    {
        ", Greek statesman and general        ": null
    },
    {
        "Antiphon": "antiphon"
    },
    {
        ", Athenian politician and orator    ": null
    },
    {
        "Phrynichus": "phrynichus"
    }
]