[
    {
        "         __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Year of the Tribunate of Cossus, Vibulanus, Volusus and Cincinnatus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             ": null
    },
    {
        "Athenian": "athens"
    },
    {
        " orator": "orator"
    },
    {
        " and ": null
    },
    {
        "politician": "politician"
    },
    {
        ", ": null
    },
    {
        "Andocides": "andocides"
    },
    {
        " is imprisoned on suspicion of having taken part in the mutilation of the sacred busts called ": null
    },
    {
        "Hermae": "hermae"
    },
    {
        " shortly before the departure of Athens military expedition to ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". These mutilations cause a general panic, and Andocides is induced to turn informer. Andocides testimony is accepted, and those whom he implicates, including ": null
    },
    {
        "Alcibiades": "alcibiades"
    },
    {
        ", are condemned to death. Andocides is sent into exile.   The Athenian expedition to Sicily sets sail under ": null
    },
    {
        "Nicias": "nicias"
    },
    {
        ", ": null
    },
    {
        "Lamachus": "lamachus"
    },
    {
        " and Alcibiades. After his departure with the armada, Alcibiades is accused of ": null
    },
    {
        "profanity": "profanity"
    },
    {
        " and is recalled to Athens to stand trial.   After learning that he has been condemned to death ": null
    },
    {
        "in absentia": "trial in absentia"
    },
    {
        ", Alcibiades defects to ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        " and Nicias is placed in charge of the Sicilian expedition. The Athenian forces land at ": null
    },
    {
        "Dascon": "dascon"
    },
    {
        " near ": null
    },
    {
        "Syracuse": "syracuse, sicily"
    },
    {
        " but with little result. ": null
    },
    {
        "Hermocrates": "hermocrates"
    },
    {
        " heads the Syracusan defence.   Alcibiades openly joins with the Spartans and persuades them to send ": null
    },
    {
        "Gylippus": "gylippus"
    },
    {
        " to assist Syracuse and to fortify ": null
    },
    {
        "Decelea": "decelea"
    },
    {
        " in ": null
    },
    {
        "Attica": "attica"
    },
    {
        ". He also encourages ": null
    },
    {
        "Ionia": "ionia"
    },
    {
        " to revolt against Athens. As a result, a Spartan fleet soon arrives to reinforce their allies in Syracuse and a stalemate ensues.         ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        " play  The Trojan Women  is performed shortly after the massacre by Athenians of the male population of ": null
    },
    {
        "Melos": "melos"
    }
]