[
    {
        "         __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Second year of the Consulship of Iullus and Tricostus or the Year of the Consulship of Capitolinus and Praetextatus and the Year of the Tribunate of Cossus, Praetextatus and Capitolinus . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             Under the leadership of ": null
    },
    {
        "Pericles": "pericles"
    },
    {
        ", ": null
    },
    {
        "Athens": "athens"
    },
    {
        " introduces a series of measures  imposing an economic embargo on ": null
    },
    {
        "Megara": "megara"
    },
    {
        " for violations of land sacred to ": null
    },
    {
        "Demeter": "demeter"
    },
    {
        ". According to the provisions of the decree, Megarian merchants are to be excluded from the market of Athens and the ports in its empire. This ban strangles the Megarian economy and strains the fragile peace between Athens and ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        ", which is allied with Megara.   Philip, brother of ": null
    },
    {
        "Perdiccas II of Macedon": "perdiccas ii of macedon"
    },
    {
        " challenges Perdiccas for the throne, and enlists the support of ": null
    },
    {
        "Athens": "athens"
    },
    {
        " and King Derdas of Elimea. Perdiccas responds by stirring up rebellion in a number of Athenian ": null
    },
    {
        "tribute": "tribute"
    },
    {
        " cities, including ": null
    },
    {
        "Potidaea": "potidaea"
    },
    {
        ".   ": null
    },
    {
        "Anaxagoras": "anaxagoras"
    },
    {
        " is arrested by Pericles political opponents on a charge of contravening the established dogmas of Athenian religion. It needs Pericles power of ": null
    },
    {
        "oratory": "public speaking"
    },
    {
        " and persuasion to secure his release. Even so he is fined and forced to retire from Athens to ": null
    },
    {
        "Lampsacus": "lampsacus"
    },
    {
        " in ": null
    },
    {
        "Ionia": "ionia"
    },
    {
        ".         In Oxfords Hood & Bell Society the numbers 42 are said to bear significance.     While in prison, ": null
    },
    {
        "Anaxagoras": "anaxagoras"
    },
    {
        " tries to ": null
    },
    {
        "square the circle": "square the circle"
    },
    {
        " with ": null
    },
    {
        "straightedge": "straightedge"
    },
    {
        " and ": null
    },
    {
        "compasses": "compasses"
    },
    {
        ".               ": null
    },
    {
        "Duke Jing of Jin": "duke jing of jin"
    }
]