[
    {
        "         __NOTOC__   Year 42 BC was a year of the ": null
    },
    {
        "pre-Julian Roman calendar": "roman calendar"
    },
    {
        ". At the time, it was known as the Year of the Consulship of Sabinus and Augurinus and the First year of the decemviri . The denomination 42 BC for this year has been used since the early medieval period, when the ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " calendar era": "calendar era"
    },
    {
        " became the prevalent method in Europe for naming years.             The ": null
    },
    {
        "Persian": "achaemenid empire"
    },
    {
        " fleet moves against a rebellious ": null
    },
    {
        "Cyprus": "cyprus"
    },
    {
        " to restore order. ": null
    },
    {
        "Kimon": "kimon"
    },
    {
        ", who returns to favour, though not to power, in ": null
    },
    {
        "Athens": "athens"
    },
    {
        ", plans an expedition to help Cyprus. He gains ": null
    },
    {
        "Pericles": "pericles"
    },
    {
        " support.   An Athenian law sponsored by Pericles is passed giving citizenship only to those born of Athenian parents. This marks an end to the policy where residents who were from other cities could be given an honourable status.   Hostilities among the Greek states come to a formal end with the agreement to the Five Years Truce. Kimon negotiates the five years truce with ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        ", in which Athens agrees to abandon its alliance with ": null
    },
    {
        "Argos": "argos"
    },
    {
        ", while Sparta promises to give up its alliance with ": null
    },
    {
        "Thebes": "thebes, greece"
    },
    {
        ". During the same year Argos signs the first Thirty-Years Peace with Sparta.       Following the report of a three-man commission into the design of Roman law, the ": null
    },
    {
        "patricians": "patrician"
    },
    {
        " set up in ": null
    },
    {
        "Rome": "rome"
    },
    {
        " a Board of Ten, the ": null
    },
    {
        "Decemviri": "decemviri"
    },
    {
        ". The first Decemviri, composed entirely of patricians is led by ": null
    },
    {
        "consuls": "consuls"
    },
    {
        " Appius Claudius Crassus": "appius claudius crassus"
    },
    {
        " and Titus Genucius Augurinus. The first ten codes of the Roman ": null
    },
    {
        "Law of the Twelve Tables": "law of the twelve tables"
    }
]