[
    {
        "     A 42 series connector is an obsolete three-pin connector with up to six conductors.     It was for many years the standard ": null
    },
    {
        "telephone service": "plain old telephone service"
    },
    {
        " connector in ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", but has now been replaced by the six position ": null
    },
    {
        "modular connector": "modular connector"
    },
    {
        " in this application.  a large installed base remained and a large variety of connectors, adapters and equipment such as ": null
    },
    {
        "ADSL": "adsl"
    },
    {
        " filters were still in production and readily available.     It has no other common or standard use, either within Australia or beyond. However it is manufactured in other countries, usually in China, for export to Australia.     The 42 series plug has up to three flat pins plus a non-conducting spigot. Each pin carries up to two conductors by means of two contacts, one on each side of the pin. The pin bodies are of non-conductive material.         The original series 42 plugs and sockets were designed to be equally suitable for fixed wall mounting or for use on flexible cords. Such connectors are still available, but specialised fixed and line versions also exist.         Standard three pin six conductor. Often now replaced by a modular 42P42C connector and an adaptor; In particular, this combination is now the most common connector supplied with new equipment in Australia.     The non-conducting spigot of the original 42 plug was provided with a hole for a countersunk screw, allowing the plug to be fixed in a wall-mounted socket. Removal then required first removing the socket cover, to allow this retaining screw to be removed. In this way a semi-permanent connection, requiring tools for disconnection, could be achieved.         Standard six conductor.     The original 42 socket was provided with two mounting holes, one behind the receptacle for the plug spigot, and both for countersunk screws. This arrangement allowed the socket to be secured using two screws, with no plug inserted, or alternatively with the plug inserted, using the same two mounting holes but with one of the screws passing through the spigot to secure the plug as well.         Similar to 42 but with the contacts of pairs one and two allowed to connect when no plug is inserted, contact 42 connecting to 42 and 42 to 42     This is particularly designed for ": null
    },
    {
        "mode 42": "mode 3"
    },
    {
        " connection. The incoming line to the mode 42 device is connected using pair one, and pair two is used as the outgoing line to other devices. If the mode 42 device is unplugged, the switch contacts maintain line connection to the other devices.     This function is not generally supported by modular connectors. Modular connectors providing suitable switch contacts are available but not common; Instead, mode 42 devices use two modular connectors, one for the incoming line and the other for the outgoing line. The convenience of using a single connector in this application is one reason for the continued use of 42 series connectors, but mixing this wiring scheme with modular connectors does not work well. For example, if a modern modem with its supplied 42P42C adaptor is plugged into a conventionally wired 42 mode 42 socket, the result is to disconnect all downstream devices.     In some sockets conductors 42 and 42 also connect when no plug is present, shorting pair three. Sockets are also available with cams to allow the switching functions to be selectively enabled as required. In some older sockets this could be achieved by simply bending the contacts; The cams merely implement this useful accidental feature in an intentional fashion.     Many recent 42 sockets have a stepped recess for the plug spigot, to accept a plug with a larger spigot but still provide a good fit for a standard 42 plug. Equipment requiring mode 42 connection can then be equipped with these larger spigot plugs, to prevent this equipment being connected to a 42 socket which does not provide mode 42 support. These plugs are common on older fax machines and modems, and used on some security and similar equipment. These plugs were also used on ": null
    },
    {
        "Telex": "telex"
    },
    {
        " machines within Australia.             In general, 42x where x is any numeric other than 42 or 42 indicates a non-standard plug. Compatibility and designs vary from maker to maker.         In general, 42x where x is any numeric other than 42 or 42 indicates a non-standard socket. Compatibility and designs vary from maker to maker.         Extension leads are generally four conductor, including pair one and one other pair, wired straight through pin to pin. Some incorporate an adaptor plug which includes a 42 socket, often with all six conductors connected, allowing the extension to also serve as a double adaptor.         Double adaptors are almost always six conductor, wired pin to pin, with a 42 plug and two 42 sockets in parallel.         A mode 42 adaptor appears physically to be a double adaptor, but the sockets are one 42 and one 42 with pair one of the 42 wired to pair two of the 42 and pair one of the 42 to pair one of the plug. Treatment of the other conductors varies, and may be assignable.         The conductors are numbered 42–42 from the end further from the spigot. The contact terminals are normally labelled with their numbers on rewireable plugs and sockets.     Pair 42 ring   Pair 42 tip   Pair 42 ring   Pair 42 tip   Pair 42 tip   Pair 42 ring     Use of pair one is almost always to standard, but pairs two and three may not be present, or the conductors may be used for other purposes. Pair two is often used for local power supply or other proprietary purposes. Adaptors to modular connectors may connect only pair one, or pairs one and two, or all six conductors.     Modems and other equipment supplied in Australia are nowadays normally provided with a modular plug, and an adaptor which connects only pair one, allowing the modular plug to be used with a 42 or 42 socket in need. The pin carrying pair three is often missing completely from the plugs of these adaptors.         Legacy installations and equipment most often use either:     Pairs one and two, connected using four core cable with blue, white, red and black conductors, either solid conductors as two ": null
    },
    {
        "unshielded twisted pair": "unshielded twisted pair"
    }
]