[
    {
        "           A Canterbury Tale is a 42 ": null
    },
    {
        "British": "cinema of the united kingdom"
    },
    {
        " film by ": null
    },
    {
        "Michael Powell and Emeric Pressburger": "powell and pressburger"
    },
    {
        " starring ": null
    },
    {
        "Eric Portman": "eric portman"
    },
    {
        ", ": null
    },
    {
        "Sheila Sim": "sheila sim"
    },
    {
        ", ": null
    },
    {
        "Dennis Price": "dennis price"
    },
    {
        " and ": null
    },
    {
        "Sgt. John Sweet": "john sweet"
    },
    {
        "; ": null
    },
    {
        "Esmond Knight": "esmond knight"
    },
    {
        " provided narration and played several small roles. For the postwar American release, ": null
    },
    {
        "Raymond Massey": "raymond massey"
    },
    {
        " narrated and ": null
    },
    {
        "Kim Hunter": "kim hunter"
    },
    {
        " was added to the film. The film was made in black and white, and was the first of two collaborations between Powell and Pressburger and cinematographer ": null
    },
    {
        "Erwin Hillier": "erwin hillier"
    },
    {
        ".      Much of the films visual style is a mixture of British realism and Hilliers ": null
    },
    {
        "German Expressionist": "german expressionism"
    },
    {
        " style that is harnessed through a ": null
    },
    {
        "neo-romantic": "neo-romanticism"
    },
    {
        " sense of the English landscape. The concept that the past always haunts the present in the English landscape would became a notable trope for British novelists and film-makers from the 42s onwards. A Canterbury Tale takes its title from  The Canterbury Tales  of ": null
    },
    {
        "Geoffrey Chaucer": "geoffrey chaucer"
    },
    {
        ", and loosely uses Chaucers theme of eccentric characters on a religious pilgrimage to highlight the wartime experiences of the citizens of ": null
    },
    {
        "Kent": "kent"
    },
    {
        ", and encourage wartime Anglo-American friendship and understanding.   ": null
    },
    {
        "Anglo-American relations": "anglo-american relations"
    },
    {
        " were also explored in Powell and Pressburgers previous film  The Life and Death of Colonel Blimp  and in more detail in their subsequent film  A Matter of Life and Death .            The story concerns three young people: British Army Sergeant Peter Gibbs , U.S. Army Sergeant Bob Johnson , and a ": null
    },
    {
        "Land Girl": "womens land army"
    },
    {
        " , Miss Alison Smith . The group arrive at the railway station in the fictitious small ": null
    },
    {
        "Kent": "kent"
    },
    {
        " town of Chillingbourne , near ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        ", late on Friday night, 42 August 42 Peter has been stationed at a nearby Army camp, Alison is due to start working on a farm in the area, and Bob left the train by mistake, hearing the announcement next stop Canterbury and thinking he was in Canterbury.     As they leave the station together Alison is attacked by an assailant in uniform known as the glue man who pours glue on her hair, before escaping. It transpires that this has happened quite a few times before, to other women. Alison asks Bob if he could spend the weekend in Chillingbourne to help her solve the mystery. The next day, while riding a farm cart in the countryside, Alison meets Peter, who surrounds her cart with his platoon of three ": null
    },
    {
        "Bren Gun Carrier": "bren gun carrier"
    },
    {
        "s. Alison agrees to meet Peter again. The three decide to investigate the attack, enlisting the help of the locals, including several young boys who play large-scale ": null
    },
    {
        "war game": "military simulation"
    },
    {
        "s.     The three use their detective skills to identify the culprit as a local magistrate, Thomas Colpeper , a gentleman farmer and pillar of the community, who also gives local history lectures to soldiers stationed in the district. Alison interviews all the glue mans victims to identify the dates and times of their attacks. Gibbs visits Colpeper at his home and borrows the fire watch roster listing the nights Colpeper was on duty in the town hall, whilst a paper drive for salvage by Johnsons boy commandos lets Johnson discover receipts for gum used to make glue sold to Colpeper. The dates of the attacks correspond with Colpepers night watches where he wore a ": null
    },
    {
        "Home Guard": "home guard"
    },
    {
        " uniform kept in the town hall to carry out his attacks.     On a train journey to Canterbury on the Monday morning, Colpeper joins them in their compartment. They confront him with their suspicions, which he doesnt deny, and they discover that his motive is to prevent the soldiers from being distracted away from his lectures by female company and to help keep the local women faithful to their absent British boyfriends. In Colpepers words, Chaucers pilgrims travelled to Canterbury to receive a blessing, or to do penance . On arriving in the city of Canterbury, devastated by wartime bombing, all three young people receive blessings of their own. Alison discovers that her boyfriend, believed killed in the war, has survived after all; his father, who had blocked their marriage because he thought his son could do better than a shopgirl, finally relents. Bob receives long-delayed letters from his sweetheart, who is now a ": null
    },
    {
        "WAC": "womens army corps"
    },
    {
        " in Australia. Peter, a ": null
    },
    {
        "cinema organist": "theatre organ"
    },
    {
        " before the war, gets to play the music of ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " on the large organ at ": null
    },
    {
        "Canterbury Cathedral": "canterbury cathedral"
    },
    {
        ", before leaving with his unit. He decides not to report Colpeper to the ": null
    },
    {
        "Canterbury police": "kent police"
    },
    {
        ", as he had planned to do.        ": null
    },
    {
        "Eric Portman": "eric portman"
    },
    {
        " as Thomas Colpeper, a gentleman farmer and ": null
    },
    {
        "magistrate": "justice of the peace"
    },
    {
        " in Chillingbourne. He is a bachelor, living with his mother and, being very keen on the local history of the area, wants to share that knowledge with everyone around him, particularly with the soldiers from elsewhere in Britain who have been billeted nearby.   ": null
    },
    {
        "Sgt. John Sweet, U.S. Army": "john sweet"
    },
    {
        " as Bob Johnson, ASN 42 hails from ": null
    },
    {
        "Three Sisters Falls": "three sisters"
    },
    {
        ", ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ". On his way from ": null
    },
    {
        "Salisbury": "salisbury"
    },
    {
        " to ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        " to meet his friend and fulfil a promise to his mother to see ": null
    },
    {
        "Canterbury Cathedral": "canterbury cathedral"
    },
    {
        ", he gets off the train at Chillingbourne  by mistake and almost immediately gets caught up in the mystery of the glue man . He has come to Britain as a part of the ": null
    },
    {
        "American Army": "united states army"
    },
    {
        " preparing for the ": null
    },
    {
        "invasion of Europe": "d-day"
    },
    {
        ". He becomes more and more willing to learn something about England during his visit. The original script mentioned that Johnson was on his way to Canterbury as his ancestors had come from there. The producers had originally planned to use ": null
    },
    {
        "Burgess Meredith": "burgess meredith"
    },
    {
        " in the role but changed their mind in favour of an unknown. Meredith acted as a script editor for Johnsons character.   ": null
    },
    {
        "Dennis Price": "dennis price"
    },
    {
        " as Peter Gibbs, a ": null
    },
    {
        "cinema organist": "theatre organ"
    },
    {
        " from London. He has been conscripted into the ": null
    },
    {
        "British Army": "british army"
    },
    {
        " and has just been stationed at the military camp outside Chillingbourne, where his unit is engaged in training manoeuvres.   ": null
    },
    {
        "Sheila Sim": "sheila sim"
    },
    {
        " as Alison Smith, a shop assistant in a ": null
    },
    {
        "department store": "department store"
    },
    {
        " in London. She has joined the ": null
    },
    {
        "Womens Land Army": "womens land army"
    },
    {
        " to do her bit to help in the defence of her country. She has been assigned to the farm of Thomas Colpeper, the local ": null
    },
    {
        "JP": "justice of the peaceengland and wales"
    },
    {
        " in Chillingbourne. Alison had previously spent a happy summer just outside Chillingbourne, living in a ": null
    },
    {
        "caravan": "travel trailer"
    },
    {
        " with her fiancé, an archaeologist who has since joined the ": null
    },
    {
        "RAF": "royal air force"
    },
    {
        " and is missing in action at the outset of the film. Alison is determined to solve the mystery of the glue man and seeks the help of Bob Johnson to do so. Johnson replies You need about as much help as a ": null
    },
    {
        "Flying Fortress": "flying fortress"
    },
    {
        "   Charles Hawtrey": "charles hawtrey"
    },
    {
        " as Thomas Duckett, the towns stationmaster.   ": null
    },
    {
        "Esmond Knight": "esmond knight"
    },
    {
        " as Narrator / Seven-Sisters Soldier / Village Idiot. The Narrator reads the modernised extract from ": null
    },
    {
        "Chaucer": "geoffrey chaucer"
    },
    {
        "s  Canterbury Tales , followed by a piece in Chaucerian style on the changes to Kent since Chaucers time .   ": null
    },
    {
        "George Merritt": "george merritt"
    },
    {
        " as Ned Horton and ": null
    },
    {
        "Edward Rigby": "edward rigby"
    },
    {
        " as Jim Horton, play the blacksmith and the wheelwright. The real Horton brothers, Ben and Neville, are seen acting as assistants to the actors.   ": null
    },
    {
        "Freda Jackson": "freda jackson"
    },
    {
        " as Mrs. Honeywood, the farming woman who employs Alison.   ": null
    },
    {
        "Eliot Makeham": "eliot makeham"
    },
    {
        " as the Church organist in Canterbury.   Harvey Golden as Sgt. Roczinsky, Bob Johnsons friend in Canterbury.   Leonard Smith, James Tamsitt and David Todd, play among the group of boys enjoying an adventure and river battle in a bucolic setting. All of them were local to the Canterbury area. Smith, Tamsitt and Todd were selected for speaking roles.   ": null
    },
    {
        "Kim Hunter": "kim hunter"
    },
    {
        " as Johnsons Girl   ": null
    },
    {
        "Raymond Massey": "raymond massey"
    },
    {
        " as Narrator         Powell and Pressburger, who were known collectivity as The Archers , wrote the script together using the concept of light and time as a basis of identity.  Powell was said to have used the work of ": null
    },
    {
        "Chaucer": "chaucer"
    },
    {
        " as inspiration to create a film that showed the love of his birthplace and all that he felt about England .      All three leads were unknowns. Many local people, including a lot of young boys, were recruited as extras for the extensive scenes of childrens outdoor activities such as river battles and ": null
    },
    {
        "den": "childrens den"
    },
    {
        "s.       The film was shot throughout the county of ": null
    },
    {
        "Kent": "kent"
    },
    {
        " not long after the ": null
    },
    {
        "Baedeker raids": "baedeker raids"
    },
    {
        " of May/June 42 which had destroyed large areas of the city centre of ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        ".     Much of the film is shot on location in and around ": null
    },
    {
        "Canterbury Cathedral": "canterbury cathedral"
    },
    {
        " and the citys bombsites. However, the cathedral itself was not available for filming as the ": null
    },
    {
        "stained glass": "stained glass"
    },
    {
        " had been taken down, the windows boarded up and the organ, an important location for the story, removed to storage, all for protection against air raids. By the use of clever perspective, large portions of the cathedral were recreated within the studio by art director ": null
    },
    {
        "Alfred Junge": "alfred junge"
    },
    {
        ".  This included the High Street, Rose Lane and the Buttermarket. ": null
    },
    {
        "Chilham": "chilham"
    },
    {
        " Mill features in the film in the scene where GI Bob meets children playing in the river on a boat and later, with Peter, when they get the proof about Colpeper. The village was used for scenes showing Chillingbourne village. In the scene where soldiers gather for a lecture at the Colpepper institute they are actually in ": null
    },
    {
        "Fordwich": "fordwich"
    },
    {
        ". ": null
    },
    {
        "Selling Station": "selling, kent"
    },
    {
        " appears in the film as Chillingbourne Station at the beginning of the film. Bob and Alison ride on a cart through the village, the local Wickhambreaux Mill can be clearly seen. Colpepers house was the still extant Wickhambreaux Court. A local ": null
    },
    {
        "Wingham": "wingham, kent"
    },
    {
        " village pub The Red Lion was used for some exterior shots of The Hand of Glory inn where Bob stays whilst in the village.  Other exterior shots of The Hand of Glory were filmed at The George & Dragon , Fordwich.     Before the credits, the following acknowledgement appears over an image of the cathedral viewed from the Christ Church Gate:          Besides that composed by ": null
    },
    {
        "Allan Gray": "allan gray"
    },
    {
        " for the film, musical works featured include:    Angelus ad Virginem  mid42th century polyphony heard as a peal of bells in orchestral guise under the opening titles   Commando Patrol by Allan Gray, Stan Bowsher, ": null
    },
    {
        "Walter Ridley": "walter ridley"
    },
    {
        " – quickstep heard in the background during Johnson and Gibbss scene in the lobby of the Hand of Glory   I See You Everywhere by Allan Gray, Stan Bowsher, Walter Ridley – slow foxtrot heard in the background during Johnson and Gibbss scene in the lobby of the Hand of Glory   Turkey in the Straw – folksong heard as Agnes leaves Bobs bedroom   Come to the Church in the Wild Wood – Bob sings as he washes    Hear my prayer, O Lord  by ": null
    },
    {
        "Henry Purcell": "henry purcell"
    },
    {
        " – the ethereal choral music heard as Gibbs pauses on entering the cathedral   Bond of Friendship – Regimental March of the Kings Division. Played as the band nears the Cathedral   ": null
    },
    {
        "Toccata and Fugue in D minor, BWV 42": "toccata and fugue in d minor, bwv 565"
    },
    {
        " by ": null
    },
    {
        "J. S. Bach": "johann sebastian bach"
    },
    {
        "  and the hymn  Onward Christian Soldiers  – played on the organ by Gibbs       The world premiere was held on 42 May 42 at the Friars Cinema , ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        ", England, an event commemorated there by a plaque unveiled by stars ": null
    },
    {
        "Sheila Sim": "sheila sim"
    },
    {
        " and ": null
    },
    {
        "John Sweet": "john sweet"
    },
    {
        " in October 42  Although the film initially had very poor reviews in the UK press,  and only small audiences, the film became a moderate success at the British box office in 42 Murphy, Robert ": null
    }
]