[
    {
        "A Game of Pool is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on October 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ". According to ": null
    },
    {
        "Rod Serling": "rod serling"
    },
    {
        ", it is the story of the best pool player living and the best pool player dead.              It is after hours at Listers Pool Room in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ", and once more ": null
    },
    {
        "pool shark": "glossary of cue sports termssharks"
    },
    {
        " Jesse Cardiff  is alone, polishing his game. Jesse bitterly muses that he would be considered the greatest pool player of all time, if it were not for the memory of the late James Howard Fats Brown  overshadowing him. He says he would give anything to play one game against Fats, prompting Fats himself to wearily rise from a pool table in the afterlife to respond to Jesses implied challenge. Jesse is then stunned to find Fats himself standing in the corner of the room. Even though Fats has been dead for 42 years, he has returned from the afterlife to grant Jesses request and offer a bet. If Jesse wins, he will be acknowledged as the greatest pool player ever; if he loses, he forfeits his life.     Jesse accepts the bet and the two begin to play. Throughout the game, Fats laments that Jesse has done nothing with his life but play pool, explaining that he himself lived a full life in addition to becoming a great player. Jesse ignores Fats, convinced that he is just trying to distract him. With one ball left on the table and both men needing to sink it in order to win, Fats misses his shot, leaving Jesse with an easy approach to the pocket. Fats warns Jesse that he may get more than he bargained for if he wins the game, but Jesse disregards this advice and sinks the ball. He revels in his victory, now secure in his status as the best pool player of all time. Fats thanks Jesse for beating him, leading Jesse to angrily call him a sore loser. While he is ranting at Fats, the now-former champion disappears.     Some time later, long after his own death, Jesse is summoned from the afterlife, just as Fats was before him, to travel to Masons Pool Hall in ": null
    },
    {
        "Sandusky, Ohio": "sandusky, ohio"
    },
    {
        ", to play against a challenger. Known even in death as the greatest pool player ever, he must spend eternity defending his title against an endless series of opponents, unable to stop until a challenger beats him and relieves him of his title. Meanwhile, Fats has gone fishing, relieved of his obligation.              George Clayton Johnsons script originally featured an ending in which Jesse loses the game and yet finds himself still alive. Seeing this, Fats explains that he will die as all second raters die: youll be buried and forgotten without me touching you. If youd beaten me, youd have lived forever. With that, Fats disappears with Jesse vowing to keep practicing until he is good enough to face Fats once again.     The episode was remade in the 42s version of  The Twilight Zone . The ": null
    },
    {
        "remade version": "a game of pool"
    },
    {
        " featured ": null
    },
    {
        "Esai Morales": "esai morales"
    },
    {
        " as Jesse Cardiff and ": null
    },
    {
        "Maury Chaykin": "maury chaykin"
    }
]