[
    {
        "A Hundred Yards Over the Rim is episode 42 of the American television ": null
    },
    {
        "anthology series": "anthology series"
    },
    {
        "  The Twilight Zone . It originally aired on April 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              In the year 42 Chris Horn is the leader of a small ": null
    },
    {
        "wagon train": "wagon train"
    },
    {
        " from ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        " attempting to reach ": null
    },
    {
        "California": "california"
    },
    {
        ". Horns wife and young son Christian are riding in one of the groups ": null
    },
    {
        "covered wagon": "covered wagon"
    },
    {
        "s. Christian is dangerously ill, and the others advise Horn the group wishes to turn back, as theyre almost out of food and water, and they lack medicine for those who are sick, like young Christian. Determined not to turn back, Horn sets off alone in a desperate search for water and sustenance, which he tells himself hell find over the rim of a nearby hill.     Horn crosses the sandy rim and suddenly finds himself in 42 ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        ". He is perplexed to see power lines, a hard black road, and a large truck coming at him, horn blaring. As the loud, fast-moving monster with a face zooms past the unnerved Horn, he stumbles, accidentally firing his rifle and grazing his arm.     He comes to a small café and gas station, owned by Joe and Mary Lou. The friendly Joe gives Horn water and Mary Lou tends to his injury, offering him ": null
    },
    {
        "penicillin": "penicillin"
    },
    {
        ", which she explains will ward off infection. They ask where he is from, curious about his old-fashioned clothes and antique rifle; they dont believe his story of traveling by wagon from Ohio. When Horn says he was looking for water, Joe mentions the location of a nearby water source, which also attracts game for food. Horn is then shocked to see the year 42 on a wall calendar, and the couple is convinced the desert heat has made him mentally unstable.     Joe calls a local doctor to come check on Horn. The doctor finds Horn to be fit and seemingly rational, with only the implausibility of the mans biography giving him reason to think otherwise. He calls the sheriff as the appropriate authority to look after him. Meanwhile, Horn has found an encyclopedia containing a brief biographical entry for Horn, Christian Jr., M.D. , who did great work with childrens diseases in late 42th-century California. Horn proudly concludes this is his son, and believes that hes been brought to this place to save him. Taking the penicillin tablets with him, he bolts from the café and runs back toward where he came from.     The sheriff arrives, and he and Joe go after Horn, nearly catching up to him. Horn stumbles, dropping his rifle before scrambling back over the rim. There he sees the wagon train where he had left it, then looks back over the rim to find the territory unsettled, with no power lines or highway. After giving his son a dose of penicillin, Horn leads the party toward the water and game hed learned of, and onward to California.     Meanwhile, Joe and the sheriff have returned to the café. Joe tells Mary Lou that Horn simply vanished; all they found was Horns rifle on the ground where he dropped it. Looking at it, they see that it now shows the effects of more than 42 years of exposure to the sun, its metal corroded and its wooden parts falling to pieces at their touch.        ": null
    },
    {
        "Cliff Robertson": "cliff robertson"
    },
    {
        " as Chris Horn   ": null
    },
    {
        "John Crawford": "john crawford"
    },
    {
        " as Joe   Miranda Jones as Martha Horn   ": null
    },
    {
        "Evans Evans": "evans evans"
    },
    {
        " as Mary Lou   ": null
    },
    {
        "John Astin": "john astin"
    },
    {
        " as Charlie   ": null
    },
    {
        "Edward Platt": "edward platt"
    },
    {
        " as Doctor   ": null
    },
    {
        "Ken Drake": "ken drake"
    }
]