[
    {
        "A Most Unusual Camera is episode 42 of the American television ": null
    },
    {
        "anthology series": "anthology series"
    },
    {
        "  The Twilight Zone . It originally aired on December 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              Two thieves, husband and wife Chester  and Paula Diedrich , have just robbed a curio shop, and among the things they have stolen is a strange ": null
    },
    {
        "camera": "camera"
    },
    {
        ". Through accident, the pair discover that it produces ": null
    },
    {
        "self-developing photos": "instant camera"
    },
    {
        " of the future, about five minutes ahead. After Paulas jail-escapee brother Woodward  shows up, Chester uses the camera to take pictures of the blank winners board before races at the local ": null
    },
    {
        "racetrack": "racetrack"
    },
    {
        " and then use the cameras predictions in making bets. The trio win $42 on the first race. They bet and win on five other races and leave with a considerable load of cash.     Back at their hotel, a French waiter named Pierre  takes notice of their camera and its ": null
    },
    {
        "French": "french language"
    },
    {
        " inscription dix à la propriétaire, meaning ten to an owner. When the waiter exits, Paula, Chester and Woodward discuss the use of the cameras last two pictures and fail to come to any agreement. While tugging over the camera, a picture of Paula—screaming and recoiling in horror—is accidentally taken. In further struggle, Chester and Woodward begin to fight, and they fall out of an open window to their deaths. Paula screams—as in the picture—but recovers immediately when she realizes that all the money and loot is now hers.     She takes a picture of Chester and Woodwards bodies in the courtyard below the window, and begins collecting the days winnings, planning to check out of the hotel. Before Paula can leave, Pierre returns and robs her, telling her that he knows about their crimes and will turn her in to the police if she calls them for help. He notes that her last picture shows more than two bodies in the courtyard. Panicked, Paula runs to look out the window, trips over a cord on the floor, and falls to her demise leaving only one of her high heels behind in the room.     Pierre then counts the corpses in the picture. Yes, there are more than two bodies down there. Just like the picture shows. One, two, three ... four?! In shock upon his realization, he falls out of the window as well, leaving only the camera lying on the floor in the now empty hotel suite.       ": null
    }
]