[
    {
        "     A Night to Remember is a 42 non-fiction book by ": null
    },
    {
        "Walter Lord": "walter lord"
    },
    {
        " that depicts the ": null
    },
    {
        "sinking of the RMS Titanic": "sinking of the rms titanic"
    },
    {
        " on 42 April 42 The book was hugely successful, and is still considered a definitive resource about the ": null
    },
    {
        "Titanic": "rms titanic"
    },
    {
        ". Lord interviewed 42 survivors of the disaster as well as drawing on books, memoirs, and articles that they had written. In 42 Lord authored his follow-up book, The Night Lives On, following renewed interest in the story after the ": null
    },
    {
        "wreck of the Titanic": "wreck of the rms titanic"
    },
    {
        " was discovered by ": null
    },
    {
        "Robert Ballard": "robert ballard"
    },
    {
        ".     The ": null
    },
    {
        "film based on the book": "a night to remember"
    },
    {
        " and with advice from Lord, was released in 42 Lord also served as a consultant to Canadian film director ": null
    },
    {
        "James Cameron": "james cameron"
    },
    {
        " while he was making his film  Titanic  in 42       Lord traveled on the ": null
    },
    {
        "RMS Olympic": "rms olympic"
    },
    {
        ", Titanics sister ship, when he was a boy and the experience gave him a lifelong fascination with the lost liner. As he later put it, he spent his time on the Olympic prowling around and trying to imagine such a huge thing sinking. He started reading about and drawing Titanic at the age of ten and spent many years collecting Titanic memorabilia, causing people to take note of this oddity.  He majored in history at ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        " and graduated from ": null
    },
    {
        "Yale Law School": "yale law school"
    },
    {
        " before joining the New York-based advertising agency ": null
    },
    {
        "J. Walter Thompson": "j. walter thompson"
    },
    {
        ". Writing in his spare time, he interviewed 42 survivors of the disaster.     A Night to Remember was only Lords second book but was a huge success, thanks in no small part to the aggressive advertising campaign carried out by ": null
    },
    {
        "R & W Holt": "henry holt and company"
    },
    {
        " following its launch in November 42 The book also undoubtedly benefited from the popularity of the 42 film  Titanic  and other coverage of the disaster that was published around the same time. Within two months of its publication, the book had sold 42 copies and remained listed as a best-seller for six months. The  Ladies Home Journal  and  Readers Digest  both published condensed versions and it was selected in June 42 by the ": null
    },
    {
        "Book of the Month Club": "book of the month club"
    },
    {
        ". The first paperback edition was published by ": null
    },
    {
        "Bantam Books": "bantam books"
    },
    {
        " in October 42     Since then the book has never been out of print and has been translated into over a dozen languages. Its success enabled Lord to leave the world of advertising and become a full-time writer. After the discovery of the wreck of the Titanic in 42 sparked a new wave of public interest in the disaster he wrote a follow-up book, The Night Lives On . Daniel Allen Butler comments that although it was of immense interest to Titanic buffs the world over, it lacked the spark of the original,  which by 42 had reached its fiftieth printing.          The book received widespread praise from contemporary critics.  The New York Times  called it stunning ... one of the most exciting books of this or any other year . The  Atlantic Monthly  praised the book for doing a magnificent job of re-creative chronicling, enthralling from the first word to the last.   Entertainment Weekly  said that it was seamless and skillful... its clear why this is many a researchers Titanic bible , while  USA Today  described it as the most riveting narrative of the disaster.      The secret to Lords success, according to the  New York Herald Tribune s critic Stanley Walker, was that he used a kind of literary ": null
    },
    {
        "pointillism": "pointillism"
    },
    {
        ", the arrangement of contrasting bits of fact and emotion in such a fashion that a vividly real impression of an event is conveyed to the reader.  Walker highlighted the way that Lord had avoided telling the story through the prism of ": null
    },
    {
        "social class": "social class"
    },
    {
        ", which had been the usual style of previous narratives, and instead successfully depicted the human element of the story by showing how those aboard reacted to the disaster whatever their class.     Steven Biel, an American cultural historian, notes the novelistic way in which Lord tells the story. The book depicts events through the eyes of multiple individuals, violating simple chronology to present an overlapping series of narratives. ": null
    },
    {
        "Nathaniel Philbrick": "nathaniel philbrick"
    },
    {
        ", writing in the introduction to the fiftieth anniversary edition of A Night to Remember, notes that at the time of publication it was the first significant book about Titanic for nearly forty years. He argues that the books hallmarks are its restraint, brevity and readability, which downplays the extravagant and mythical aspects of the disaster and instead puts in the foreground the stories of the people on the ship. The narrative builds suspense, making the reader care about the characters and revisit the disaster from their perspective. It tells the story in a highly visual and aural way, describing the sights and sounds of the night of the disaster with the immediacy of a live broadcast or a television documentary , as Biel puts it.     A key to Lords method is his technique of adopting an unconventional approach to the chronology of the event, an imaginative approach to time and space in which hours and minutes prove extremely malleable, the ship itself seems almost infinitely complex, and the disaster assumes order and unity from far away.  In short it is a modernist narrative around a modernist event.  Reviewers highlighted the way in which Lord depicted the human side of the Titanic story, which The New York Times called the core of Mr. Lords account, and explains its fascination, a pull as powerful in its way as the last downward plunge of the ship itself.  While the legendary acts of gallantry stood out, the book invites readers to put themselves in the place of those aboard and implicitly asks how they would react in the same situation. As Newsweek put it, What would it be like to be aboard a sinking ocean liner?      The significance of Lords book, according to Biel, is that it gave the disaster its fullest retelling since 42 and made it speak to a modern mass audience and a new set of postwar concerns. In the creation of the Titanic myth there were two defining moments: 42 of course, and 42  Lord updates the popular interpretation of the Titanic disaster by portraying it in world-historical terms as the symbolic and actual end of an era, and as an event which marked the end of a general feeling of confidence. Uncertainty replaced orderliness, and the ships sinking marked the beginning of the twentieth centurys unending sequence of disillusionment. Before the Titanic, all was quiet. Afterward, all was tumult.  Biel notes that Lords underlying theme is a rather nostalgic reflection of the nobler instincts exhibited in the disaster and their subsequent eclipse. Such ideals were attractive for a post-war society that celebrated the role of the ": null
    },
    {
        "nuclear family": "nuclear family"
    },
    {
        " and the traditional roles of the male breadwinner and female homemaker.     Lords invocation of an era of confidence and certainty was also a relevant theme at the height of the Cold War. The University of California sociologist Fred Davis comments that nostalgia thrives ... on the rude transitions wrought by such phenomena as war, depression, civil disturbance, and cataclysmic natural disasters – in short, those events that cause masses of people to feel uneasy and to wonder whether the world and their being are quite what they always took them to be.  The turmoil and uncertainty of the early ": null
    },
    {
        "Atomic Age": "atomic age"
    },
    {
        " and the onset of profound social changes made the old concepts of the nuclear family and traditional gender roles, reflected in the behaviour of Titanics passengers, resonate with a mid42s audience.     The gradual nature of the disaster was also more comforting, in some respects, compared with the nature of modern technological failures such as air crashes.  Time s reviewer made this point explicitly: This air age, when death comes too swiftly for heroism or with no survivors to record it, can still turn with wonder to an age before yesterday when a thousand deaths at sea seemed the very worst the world must suffer.  It was, as Steven Biel comments, a quainter kind of disaster in which the victims had time to prepare and chose how to die.       The book has been adapted twice for the screen. The first production was staged as a live adaptation screened on 42 March 42 by ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " TV and sponsored by ": null
    },
    {
        "Kraft Foods": "kraft foods"
    },
    {
        " as part of the  Kraft Television Theatre  strand. It has been described as the biggest, most lavish, most expensive thing of its kind attempted up to that point, with 42 sets, 42 actors, 42 speaking parts, 42 gallons of water and costing $42 . ": null
    },
    {
        "George Roy Hill": "george roy hill"
    },
    {
        " directed and ": null
    },
    {
        "Claude Rains": "claude rains"
    },
    {
        " provided a narration – a practice borrowed from radio dramas which provided a template for many television dramas of the time. It took a similar approach to the book, lacking dominant characters and switching between a multiplicity of scenes. Rains narration was used to bridge the almost limitless number of sequences of life aboard the doomed liner , as a reviewer put it, and closed with his declaration that never again has Man been so confident. An age had come to an end.  The production was a major hit, attracting 42 million viewers, and greatly boosted the books sales. It was rerun on ": null
    },
    {
        "kinescope": "kinescope"
    },
    {
        " on 42 May 42 five weeks after its first broadcast.     The second adaptation was the 42 British ": null
    },
    {
        "drama film": "drama"
    },
    {
        "  A Night to Remember  starring ": null
    },
    {
        "Kenneth More": "kenneth more"
    },
    {
        ", which is still widely regarded as the definitive cinematic telling of the story.  The film came about after its eventual director, ": null
    },
    {
        "Roy Ward Baker": "roy ward baker"
    },
    {
        ", and its producer, Belfast-born ": null
    },
    {
        "William MacQuitty": "william macquitty"
    },
    {
        " both acquired copies of the book – Baker from his favorite bookshop and MacQuitty from his wife – and decided to obtain the film rights. MacQuitty had actually seen Titanic being launched on 42 May 42 and still remembered the occasion vividly. He met Lord and brought him on board the production as a consultant. The film diverges from both the book and the NBC TV adaptation in focusing on a central character, Second Officer ": null
    },
    {
        "Charles Lightoller": "charles lightoller"
    },
    {
        ", played by More. Its conclusion reflects Lords world-historical theme of a world changed for ever with a fictional conversation between two survivors, Lightoller and Colonel ": null
    },
    {
        "Archibald Gracie": "archibald gracie iv"
    },
    {
        ", sitting on an overturned lifeboat. Lightoller declares that the disaster is different ... Because we were so sure. Because even though its happened, its still unbelievable. I dont think Ill ever feel sure again. About anything.        After Lord died in 42 he bequeathed to the ": null
    },
    {
        "National Maritime Museum": "national maritime museum"
    },
    {
        " in ": null
    },
    {
        "Greenwich, England": "greenwich, england"
    },
    {
        " his huge collection of manuscripts, original letters and Titanic memorabilia, which he had gathered during his life and used to write A Night to Remember. MacQuitty also donated items from his own collection of material related to the film. Items from the collection are on display at the museum and can be accessed by researchers.": null
    }
]