[
    {
        "        A Penny for Your Thoughts is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone , written by ": null
    },
    {
        "George Clayton Johnson": "george clayton johnson"
    },
    {
        ". It originally aired on February 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              Hector B. Poole is a sensitive, insecure bank clerk. On the way to work he tosses a coin into a vendors open box to pay for a newspaper, and it miraculously lands on its edge. Suddenly he can hear other peoples thoughts, but at first does not understand that they are not speaking. Distracted, he is nearly hit by a car, and is confused when he hears the driver expressing concern while thinking angrily about Hectors carelessness.     At work, he hears his boss, Bagby, thinking about a weekend affair he is planning with his ": null
    },
    {
        "mistress": "mistress"
    },
    {
        ". Hector also hears the thoughts of Helen Turner, a co-worker who admires him from afar and wishes he would be more assertive. While finalizing the paperwork for a $42 loan to a businessman named Sykes, he hears Sykes thinking about using the money for a ": null
    },
    {
        "run": "gambling"
    },
    {
        " at the ": null
    },
    {
        "horse track": "horse racing"
    },
    {
        " to win back money he has ": null
    },
    {
        "embezzled": "embezzlement"
    },
    {
        " from his company. Hector challenges Sykes, who accuses him of lying and withdraws his business from the bank, to Bagbys annoyance. Despite this embarrassment, Hector finally summons the courage to talk to Helen. When one of Pooles coworkers thinks inappropriate thoughts about her, Hector pours water on his head.     Next Hector hears an old, trusted employee, Smithers, thinking about how he will steal cash from the bank and escape to ": null
    },
    {
        "Bermuda": "bermuda"
    },
    {
        ". He takes Helen fully into his confidence; she doesnt believe in his powers, but urges him to tell Bagby about Smithers. Hector does, saying he overheard Smithers talking about the theft; incredulous at first, Bagby decides the story is plausible enough to try catching Smithers in the act. Smithers proves to be innocent, and Bagby fires Hector. Smithers then privately admits to Poole that he has fantasized for years about just such a theft as an escape from his dead-end job, but is too set in his ways to go through with it.     Hector vents his unhappiness to Helen: being able to read minds has taught him more than he wanted to know about the disconnect between peoples thoughts and their actions. Bagby learns that Sykes has been arrested for gambling with company money, and offers to reinstate Hector. At Helens telepathic prompting, Hector says he deserves to become accounts manager instead, but Bagby resists. Hector then ": null
    },
    {
        "blackmail": "blackmail"
    },
    {
        "s Bagby using his knowledge of the mans adultery; he gets his promotion and also insists on a Bermuda vacation for Smithers at the banks expense.     After work, as Hector returns home with Helen , he returns to the newsstand, where his coin is still standing. Buying an afternoon paper, he knocks it over, and then finds his mind-reading ability gone. However, he doesnt need it anymore, as he is a man changed for the better, with a new job, a girlfriend, and a new-found confidence in himself.        ": null
    },
    {
        "Dick York": "dick york"
    },
    {
        " as Hector B. Poole   ": null
    },
    {
        "June Dayton": "june dayton"
    },
    {
        " as Helen Turner   ": null
    },
    {
        "Dan Tobin": "dan tobin"
    },
    {
        " as Mr. Bagby   ": null
    },
    {
        "Hayden Rorke": "hayden rorke"
    },
    {
        " as Mr. Sykes   ": null
    },
    {
        "Cyril Delevanti": "cyril delevanti"
    }
]