[
    {
        "      A Philosophical Investigation is a 42 ": null
    },
    {
        "techno-thriller": "techno-thriller"
    },
    {
        " by ": null
    },
    {
        "Philip Kerr": "philip kerr"
    },
    {
        ".       In a near-future, a British neuroscientist named Professor Burgess Phelan has discovered a portion of the brain, the VMN, that is typically twice the size in men as it is in women. In certain men, however , it is the same size as a womans, and that abnormality is an exceptionally accurate indicator of violent sociopathy. Professor Phelan developed an imaging device called L.O.M.B.R.O.S.O. used to help diagnose men with the VMN deficiency.     In the interests of public safety, the Lombroso institute is set up to test all the men in Britain. Males are enticed with ad campaigns to submit for testing; those who are VMN-negative are given confidential treatment, including counselling and drugs, and assigned a code name out of the Penguin book of Great Thinkers . The police arent given the names of the VMN-negative, but they are allowed to confirm whether or not a particular person is in the Lombroso Institutes system as VMN-negative.     ": null
    },
    {
        "Wittgenstein": "ludwig wittgenstein"
    },
    {
        " is the code name of a VMN-negative who, until he was made aware of his status, was living a well-adjusted, if solitary, life, venting his sociopathic tendencies harmlessly through ": null
    },
    {
        "virtual reality": "virtual reality"
    },
    {
        " entertainment systems. Upon discovering his ": null
    },
    {
        "pathology": "pathology"
    },
    {
        ", though, he undertakes a public service of his own: after hacking into the Lombroso Institutes systems and obtaining a list of all VMN-negative men in Britain, he undertakes to kill them all.     The narrative unfolds from a dual perspective: Wittgensteins, and the female police lieutenant, Isadora Jake Jakowicz, assigned to catch him. Wittgensteins portion is told from the first person as a diary of his assassinations and subsequent downfall; the detectives portion is told in a more traditional third-person perspective.       In the novels setting, the national government was elected partly on a platform of retributive justice , rather than rehabilitative, and punitive coma  has replaced the ": null
    },
    {
        "death penalty": "death penalty"
    },
    {
        " as punishment for extreme crimes. In its favour, punitive coma is safely reversed, should someone later prove innocent; as well, prison costs have plunged since the inmates are sentenced to years of sleep rather than restraint, and require much less guarding and care. Opponents of punitive coma argue that the state is now stealing years from peoples lives, and giving the guilty no opportunity to rehabilitate themselves; thus, punitive coma is inhumane. This position is defeated, however, by proponents who observe that any long-term space travel will necessarily involve long-term medically induced comas of the same kind, so the process itself is not inhumane; furthermore, criminals are not subject to the dangerous criminal environment of prison, so punitive coma may be considered a more, rather than less, humane punishment.     A portion of the narrative involves the use of a Cambridge philosophy professor to engage Wittgenstein in a debate on the morality of his actions. Since the killer comes to see his whole act through the lens of the real Wittgensteins philosophy ": null
    }
]