[
    {
        "     A Song to Remember is a 42 ": null
    },
    {
        "Columbia Pictures": "columbia pictures"
    },
    {
        " Technicolor": "technicolor"
    },
    {
        " biographical film": "biographical film"
    },
    {
        " which tells a fictionalised life story of Polish pianist and composer ": null
    },
    {
        "Frédéric Chopin": "frédéric chopin"
    },
    {
        ". Directed by ": null
    },
    {
        "Charles Vidor": "charles vidor"
    },
    {
        " and starring ": null
    },
    {
        "Paul Muni": "paul muni"
    },
    {
        ", ": null
    },
    {
        "Merle Oberon": "merle oberon"
    },
    {
        " and ": null
    },
    {
        "Cornel Wilde": "cornel wilde"
    },
    {
        ".       ": null
    },
    {
        "Frederic Chopin": "frédéric chopin"
    },
    {
        "  first appears as an 42-year-old child prodigy, playing a piece by ": null
    },
    {
        "Mozart": "wolfgang amadeus mozart"
    },
    {
        " for his teacher Professor Elsner . Elsner has received an invitation from the influential music publisher and impresario Louis Pleyel to bring the brilliant boy pianist to Paris, expecting to repeat the recent success of 42-year-old ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        ". Unfortunately, Chopin’s father, a teacher of French, cannot afford to pay the Professor his fees, much less finance a trip to Paris. Elsner says there will be time to wait. Chopin suddenly starts to bang on the piano keys when he notices out the window that Polish people are being taken prisoners by the Russian authorities. He and other boys are planning to fight back when they grow up, and Elsner, though German, also embraces the cause of freedom for ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and all people. Chopin tentatively plays a waltz that Elsner does not recognize; it is his own work. Elsner realizes that he has a gifted composer as well as a performer on his hands. Elsner muses about the future: Chopin in Paris, where all the great artists and musicians and writers go, playing music that speaks of Poland to the world.     Grown, Chopin takes part in secret meetings to work on saving Poland with his friends, Titus , Jan and Constantia Despite his familys apprehension, Chopin is aided in his clandestine political activities by the professor, whose primary goal is still to get Chopin to Paris. He has saved enough money for the journey himself.     Chopin has been invited to play at Count Wyszynka’s. The family calls it a concert, but the professor knows he will be providing background music for the banquet, while the guests clatter their cutlery and stuff their stomachs. Chopin attends a secret meeting with the professor—at which they learn that the Tsar has appointed a new governor, a man with a vicious record—and they show up at the last minute. Chopin plays—the ": null
    },
    {
        "Fantaisie Impromptu": "fantaisie-impromptu"
    },
    {
        "—and it is as the professor predicted. However, the Count does ask for an encore. A guest arrives late and is announced: the ": null
    },
    {
        "Russian Governor of Poland": "namiestnik of the kingdom of poland"
    },
    {
        ". Chopin stands up and announces, I do not play for Czarist butchers. He storms out of the room as his famous ": null
    },
    {
        "Revolutionary Étude": "étude op. 10, no. 12"
    },
    {
        " starts in the background. His friends rush to his home to tell him to flee or he will be arrested in the morning. Paris is the obvious solution. Constantia gives him a handful of Polish earth to take with him.     The excited professor takes Chopin to a bewildered Pleyel  assuming they will be welcomed even though it has been 42 years since their correspondence. While Pleyel is trying to get rid of them, Chopin’s Polonaise echoes through the room. Franz Liszt  has found the music and loves it. Pleyel immediately changes his mind and promises a concert.     The professor takes Chopin to the famous Café de la Bohème, haunt of celebrities such as Liszt Victor Hugo, Alexandre Dumas, Balzac. He embarasses Chopin by noisily claiming a table and manages to alienate an important critic, Kalkbrenner. . Liszt enters the cafe with ": null
    },
    {
        "Alfred de Musset": "alfred de musset"
    },
    {
        " and ": null
    },
    {
        "Georges Sand": "george sand"
    },
    {
        " , wearing her masculine garb, and introduces them all to Chopin.     Just before the night of his crucial debut, a letter arrives for the professor, who makes the mistake of reading it aloud. It is from Constantia, bearing news that the night of Chopin’s flight Jan and another man were arrested and beaten to death. At the concert, Chopin is playing ": null
    },
    {
        "Beethoven’s Moonlight Sonata": "piano sonata no. 14"
    },
    {
        " when he slows to a stop and bursts into the first bars of ": null
    },
    {
        " Heroic Polonaise": "polonaise in a flat, op. 53"
    },
    {
        ", a song for Poland, before slamming the keyboard and leaving. The reviews are devastating, all but one, written by Georges Sand, who acclaims Chopin as a genius. Chopin receives a note from Sand inviting both of them to a reception that night being held by the Duchess of Orléans. Liszt welcomes them and takes Chopin aside to a room where Sand is waiting, gowned in white satin. Meanwhile Liszt tells Kalkbrenner that he will play, and the Count and his guests eagerly repair to the music room. Liszt asks that the room be darkened, and all the candelabras are removed. Chopin’s music echoes through the chamber until at last George Sand enters with a single candelabra and walks to the piano, revealing Chopin. His virtuoso performance of his own music is received by calls of “bravo.” Liszt introduces him as one of the greatest artists of all time. Pleyel is eager to arrange concerts and to publish Chopin’s music. He makes an appointment with the professor for 42 the next morning. Liszt, Sand and Chopin have gone off together to enjoy a glass of wine, and toast Chopin’s future, savoring the success of their deception. Sand asks what his plans are, and he says to give concerts, as soon as possible. I’m thinking of my people back home. You see, there was a purpose in coming to Paris. Sand thinks he is looking tired and invites him to ": null
    },
    {
        "her house in the country, at Nohant": "house of george sand"
    },
    {
        ", for the weekend. He goes back to the apartment to pack, and will not be persuaded to stay to do business with Pleyel.     At the end of three days, Sand persuades Chopin, who is now deeply in love with her, to go with her to Majorca, where she writes and he composes. She alters Chopins life. An important and influential writer as well as a minor aristocrat, she has the money and connections to promote his fame. But instead of promoting Chopin as a concert pianist, Sand wants Chopin to remain alone with her, coddled at her estate and devoting himself solely to composition. During this period, Chopin writes some of his most famous works. The film portrays Sand as a selfish, manipulative and domineering figure in Chopins life, who seduces him and distracts him from his desire to serve the cause of Poland. Sand insists that Chopin embrace the way of life she has chosen, which she believes all artists should choose: total dedication to realizing ones gifts, not caring what anyone else thinks, spurning ordinary people and any concerns that distract one from the work and from enjoying the beauty of life. While under her influence, Chopin refuses to see his old friend Elsner, who patiently waits for him to remember his duty to his people.      Pleyel is thrilled with the music Chopin sends for publication and says he will be able to book concerts anywhere—If Chopin ever returns. Meanwhile the neglected professor must move to humble quarters and go back to teaching to survive. Pleyel comes to tell him that Chopin has returned to Nohant from Majorca. The professor goes there, and Chopin refuses to see or speak to him. Chopin’s music pours off the presses. At a chance meeting Liszt tells the professor that Chopin plays occasionally at salons, and promises to send him invitations.     An uprising in Poland is crushed. Constantia arrives in Paris and finds the professor. She sees through his defense of Chopin. She knows all about Georges Sand but hopes a spark of the past lives in her friend’s heart. The freedom of their imprisoned comrades could be bought with enough money. Chopin could rally his rich friends or “bludgeon” them into helping. For the first time, the professor comes to a salon. He sees that Chopin is more ill than he imagined. Chopin refuses to respond to the news from Poland. The professor accuses him of becoming an isolated fop.     He leaves the tiny blue bag that Constantia brought on a table. The bag contains Polish earth, which awakens Chopin’s sense of patriotism. He sends for Pleyel and asks him to book concerts wherever he can. Sand tries to convince him to change his mind: This is literally suicide. He says nothing, and plays the first bars of the Polonaise. She pours out her own bitterness and rage at life and the human “ jungle,” but Chopin just plays louder.     Chopin has finally reunited with Elsner and broken away from Sand so that he can embark on an international tour to raise money for the Polish cause, even though he knows that it will kill him. His illness worsens, and during one passionate performance, blood spatters the keys. Finally, the strain of the tour destroys his already fragile health. Chopin begs on his deathbed to see Sand once more. She is sitting for ": null
    },
    {
        "Delacroix": "eugène delacroix"
    },
    {
        ", and maintains her pose while she asks the professor if it was worth it. She says she was a mistake and does not belong there, now. The professor lies to Chopin and says she is too ill to come. Chopin dies with Kalkbrenner, Pleyel, the Professor and Constantia in attendance, and Liszt playing the piano for him in the next room.       ": null
    },
    {
        "Paul Muni": "paul muni"
    },
    {
        " as ": null
    },
    {
        "Prof. Joseph Elsner": "józef elsner"
    },
    {
        " Merle Oberon": "merle oberon"
    },
    {
        " as ": null
    },
    {
        "George Sand": "george sand"
    },
    {
        " Cornel Wilde": "cornel wilde"
    },
    {
        " as ": null
    },
    {
        "Frédéric Chopin": "frédéric chopin"
    },
    {
        " Nina Foch": "nina foch"
    },
    {
        " as Constantia   ": null
    },
    {
        "George Coulouris": "george coulouris"
    },
    {
        " as Louis Pleyel   ": null
    },
    {
        "Howard Freeman": "howard freeman"
    },
    {
        " as ": null
    },
    {
        "Kalkbrenner": "friedrich kalkbrenner"
    },
    {
        " Stephen Bekassy": "stephen bekassy"
    },
    {
        " as ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        "       A Song to Remember was nominated for ": null
    },
    {
        "Best Actor in a Leading Role": "academy award for best actor"
    },
    {
        " , ": null
    },
    {
        "Best Cinematography, Color": "academy award for best cinematography"
    },
    {
        ", ": null
    },
    {
        "Best Film Editing": "academy award for best film editing"
    },
    {
        ", ": null
    },
    {
        "Best Music, Scoring of a Dramatic or Comedy Picture": "academy award for best original score"
    },
    {
        ", ": null
    },
    {
        "Best Sound, Recording": "academy award for best sound mixing"
    },
    {
        "  and ": null
    },
    {
        "Best Writing, Original Story": "academy award for best story"
    },
    {
        ".      Though Chopin was a true Polish patriot, Vidor highly romanticizes Chopins patriotism in the film, which was produced during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". He fictionalizes Chopins relationship with Elsner and greatly distorts Chopins relationship with Sand to produce a good vs. evil struggle for Chopins soul between Eisner and Sand. The script occasionally sounds more like propaganda for wartime self-sacrifice over individualism than like the real story of Chopins life.     ": null
    },
    {
        "Ayn Rand": "ayn rand"
    },
    {
        " was sharply critical of the film, strongly taking the side of the George Sand character as against the Polish nationalist ones – a value judgment diametrically opposite to that taken by the film makers: George Sand, according to the film, is evil because she provides a beautiful, private retreat where Chopin can live in peace and luxury, because she takes care of his every need, attends to his health, and urges him to forget the world and devote himself exclusively to the work of writing music, which he is desperately eager to do. The young Polish girl, according to the film, is good because she urges Chopin to drop the work that he loves and go out on a concert tour to collect money for the people, for a cause that is identified as national or revolutionary or both, and this is supposed to justify everything – so she demands that Chopin renounce his genius, sacrifice his composing and go out to entertain paying audiences – even though he hates concert playing, is ill with tuberculosis and has been warned by the doctors that the strain of a tour will kill him . The highly critical review of A Song to Remember appears in Journals of Ayn Rand , edited by David Harriman, Plume Books , 42 Ch.42 P.4242     Victor Brown noted that The breakup of George Sands relationship with Chopin was for personal reasons completely different from those shown in the film - mainly Chopins siding with Sands estranged daughter against her mother. In fact, George Sand was an outspoken supporter of the Polish national cause in her own right, an allegiance which lasted long past the end of the relationship with Chopin. During the ": null
    },
    {
        "Revolution of 42 in France": "revolution of 1848 in france"
    },
    {
        " George Sand took part in a Polish solidarity demonstration held in Paris on May 42 42 calling for the French Army to be sent to liberate Poland . ": null
    },
    {
        "Andre Maurois": "andre maurois"
    },
    {
        ", Lelia - the Life of George Sand quoted in Victor Brown, Holywood Films as a Highly Unreliable History Book in Hilary Kagan Retrospective Essays on Twentieth Century Popular Culture .     The pianist ": null
    },
    {
        "José Iturbi": "josé iturbi"
    },
    {
        " played the piano music, and also orchestrated part of the ": null
    },
    {
        "B minor Sonata": "piano sonata no. 3"
    },
    {
        " for the scene when Chopin and George Sand arrive in ": null
    },
    {
        "Majorca": "majorca"
    },
    {
        ". The hands of pianist ": null
    },
    {
        "Ervin Nyiregyházi": "ervin nyiregyházi"
    },
    {
        " are shown playing the piano.       ": null
    },
    {
        "Liberace": "liberace"
    },
    {
        "s trademark electric candelabrum was inspired by a similar prop in A Song to Remember. ": null
    }
]