[
    {
        "     A Thing About Machines is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on October 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              A repairman has paid a house call to Bartlett Finchley, who is having trouble with the TV, and notes that he should not damage his appliances . It turns out he is an ill-tempered gourmet magazine critic who reviles humanity , though he seems to be simultaneously lonely. Hes as inept with machines as he is with people. Frustrated, he constantly abuses machines and starts to think machines are conspiring against him. The people he tells about this write him off as ": null
    },
    {
        "paranoid": "paranoid"
    },
    {
        ", but eventually every machine in his house turns on him. Before this happens, he mentions the radio doesnt work, then his clock chimes more than the hour. His typewriter types the message, GET OUT OF HERE FINCHLEY. A woman on the TV speaks the same message, and upstairs his ": null
    },
    {
        "electric razor": "electric razor"
    },
    {
        " rises menacingly into the air, lunging at him like a cobra. He rips the telephone cord out of the wall, but a voice on the phone speaks the same words.     He hears a siren and goes outside to find that his car has rolled down the driveway and had almost hit a small boy. After rudely dismissing the neighbors who have collected to gawk, Finchley returns to the house, drinks a full bottle of hard liquor, and passes out. When he wakes up, the television and other machines start telling him to get out, and his razor slithers down the stairs in pursuit of him. Finchley runs from the house and is chased by his car . It chases him to his pool and pushes him in. He sinks to the bottom and drowns. When the police pull him out of the water, they cannot explain how he could sink to the bottom when he was not weighted down , nor could they explain the car near the pool. They theorize he may have had a ": null
    },
    {
        "heart attack": "myocardial infarction"
    },
    {
        ".        ": null
    },
    {
        "Richard Haydn": "richard haydn"
    },
    {
        " as Bartlett Finchley   ": null
    },
    {
        "Barbara Stuart": "barbara stuart"
    },
    {
        " as Edith Rogers   ": null
    },
    {
        "Barney Phillips": "barney phillips"
    },
    {
        " as TV repairman   Jay Overholts as Intern   ": null
    },
    {
        "Henry Beckman": "henry beckman"
    }
]