[
    {
        "     A World of Difference is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone .              Arthur Curtis is a businessman planning a vacation to ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " with his wife Marian. After arriving at his office and talking with his secretary Sally, after finding that his ": null
    },
    {
        "telephone": "telephone"
    },
    {
        " is not functional and hearing someone yell cut, he discovers his office to be a ": null
    },
    {
        "movie set": "movie set"
    },
    {
        " on a ": null
    },
    {
        "sound stage": "sound stage"
    },
    {
        ". He is told that Arthur Curtis is merely a role he is playing, and that his real identity is Gerald Raigan, a movie star who is caught in the middle of a brutal divorce from a hostile wife Nora, his own alcoholism, and a declining career. He leaves the studio with Nora, as she wants money.     He tries in vain to locate Arthur Curtiss house, and mistakes a little girl for his daughter, scaring her. Nora drives him to their actual home. Inside, he meets his agent, who tells him that if he fails to continue work that day, he will drop him as a client. Curtis still protests that he is not Raigan, and tries to call his workplace, but the operator cannot find any listing of it. His agent believes that he is having a nervous breakdown, and shows him the shooting script of a movie called The Private World of Arthur Curtis. He then tells him that the movie is being canceled due to his outburst in the studio.     Raigan/Curtis rushes back to the set, which is being dismantled, and pleads not to be left in the uncaring world of Gerald Raigan. Curtis reappears in his office as it was before, just as Marian arrives. Sally gives Arthur his plane tickets. As Arthur hears echoes of the studio sounds, he tells Marian that he never wants to lose her, and that they should leave for their vacation immediately. Meanwhile, in the other world, Raigans agent shows up on the set to find that Raigan has vanished. As the set is being dismantled, a teaser shows the Arthur Curtis script left on a table, waiting to be thrown into the rubbish bin. In the last scene, Curtis and Marian board a plane, which takes flight and fades away into the sky.        Trivia from The Twilight Zone. Albany, GA: Bear Manor Media.  The Twilight Zone: Unlocking the Door to a Television Classic. Churchville, MD: OTR Publishing.                             ": null
    }
]