[
    {
        "            Aalen  is a former ": null
    },
    {
        "Free Imperial City": "free imperial city"
    },
    {
        " located in the eastern part of the German state of ": null
    },
    {
        "Baden-Württemberg": "baden-württemberg"
    },
    {
        ", about  east of ": null
    },
    {
        "Stuttgart": "stuttgart"
    },
    {
        " and  north of ": null
    },
    {
        "Ulm": "ulm"
    },
    {
        ". It is the seat of the ": null
    },
    {
        "Ostalbkreis": "ostalbkreis"
    },
    {
        " district and is its largest town. It is also the largest town in the ": null
    },
    {
        "Ostwürttemberg": "ostwürttemberg"
    },
    {
        " region. Since 1956, Aalen has had the status of ": null
    },
    {
        "Große Kreisstadt": "große kreisstadt"
    },
    {
        " . It is noted for its many ": null
    },
    {
        "half-timbered": "half-timbered"
    },
    {
        " houses constructed from the 16th century through the 18th century.     With an area of 146.63  km 2 , Aalen is ranked 7th in Baden-Württemberg and 2nd within the ": null
    },
    {
        "Government Region of Stuttgart": "stuttgart"
    },
    {
        ", after Stuttgart. With a population of about 66,000, Aalen is the 15th most-populated settlement in Baden-Württemberg.               Aalen is situated on the upper reaches of the river ": null
    },
    {
        "Kocher": "kocher"
    },
    {
        ", at the foot of the ": null
    },
    {
        "Swabian Jura": "swabian jura"
    },
    {
        " which lies to the south and south-east, and close to the hilly landscapes of the ": null
    },
    {
        "Ellwangen Hills": "ellwangen hills"
    },
    {
        " to the north and the Welland to the north-west.     The west of Aalens territory is on the foreland of the eastern Swabian Jura, and the north and north-west is on the ": null
    },
    {
        "Swabian-Franconian Forest": "swabian-franconian forest"
    },
    {
        ", both being part of the ": null
    },
    {
        "Swabian Keuper-Lias Plains": "swabian keuper-lias plains"
    },
    {
        ". The south-west is part of the ": null
    },
    {
        "Albuch": "albuch"
    },
    {
        ", the east is part of the ": null
    },
    {
        "Härtsfeld": "härtsfeld"
    },
    {
        ", these two both being parts of the Swabian Jura.      The Kocher enters the towns territory from ": null
    },
    {
        "Oberkochen": "oberkochen"
    },
    {
        " to the south, crosses the district of Unterkochen, then enters the town centre, where the Aal flows into it. The Aal is a small river located only within the towns territory. Next, the Kocher crosses the district of Wasseralfingen, then leaves the town for ": null
    },
    {
        "Hüttlingen": "hüttlingen, baden-württemberg"
    },
    {
        ". Rivers originating near Aalen are the ": null
    },
    {
        "Rems": "rems"
    },
    {
        "  and the ": null
    },
    {
        "Jagst": "jagst"
    },
    {
        " , both being tributaries of the ": null
    },
    {
        "Neckar": "neckar"
    },
    {
        ", just like the Kocher.     The elevation in the centre of the market square is  relative to ": null
    },
    {
        "Normalhöhennull": "normalhöhennull"
    },
    {
        ". The territorys lowest point is at the ": null
    },
    {
        "Lein": "lein"
    },
    {
        " river near Rodamsdörfle, the highest point is the Grünbergs peak near Unterkochen at .        Aalens territory ranges over all ": null
    },
    {
        "lithostratigraphic groups": "group"
    },
    {
        " of the ": null
    },
    {
        "South German Jurassic": "south german jurassic"
    },
    {
        ": Aalens south and the Flexner massif are on top of the ": null
    },
    {
        "White Jurassic": "white jurassic"
    },
    {
        ", the town centre is on the ": null
    },
    {
        "Brown Jurassic": "brown jurassic"
    },
    {
        ", and a part of Wasseralfingen is on the ": null
    },
    {
        "Black Jurassic": "black jurassic"
    },
    {
        ". As a result, the town advertises itself as a Geologists Mecca .      Most parts of the territory are on the Opalinuston-Formation  of the ": null
    },
    {
        "Aalenian": "aalenian"
    },
    {
        " subdivision of the ": null
    },
    {
        "Jurassic": "jurassic"
    },
    {
        " Period, which is named after Aalen. On the Sandberg, the Schnaitberg and the Schradenberg hills, all in the west of Aalen, the Eisensandstein formation emerges to the surface. On the other hills of the city, ": null
    },
    {
        "sands": "sand"
    },
    {
        " , ": null
    },
    {
        "gravel": "gravel"
    },
    {
        " and residual ": null
    },
    {
        "rubble": "rubble"
    },
    {
        " prevail.   The historic centre of Aalen and the other areas in the Kocher valley are founded completely on ": null
    },
    {
        "holocenic": "holocene"
    },
    {
        " floodplain": "floodplain"
    },
    {
        " loam": "loam"
    },
    {
        "  and riverbed gravel that have filled in the valley.     Most parts of Dewangen and Fachsenfeld are founded on formations of Jurensismergel , Posidonienschiefer , Amaltheenton , Numismalismergel and Obtususton  moving from south to north, all belonging to the Jurassic and being rich in fossils. They are at last followed by the Trossingen Formation already belonging to the ": null
    },
    {
        "Late Triassic": "late triassic"
    },
    {
        ".     Until 1939 iron ore was mined on the Braunenberg hill. .       The maximum extent of the towns territory amounts to  in a north-south dimension and  in an east-west dimension. The area is , which includes 42.2%  agriculturally used area and 37.7%  of forest. 11.5%  are built up or vacant, 6.4%  is used by traffic infrastructure. Sporting and recreation grounds and parks comprise 1% , other areas 1.1% .        The following municipalities border on Aalen. They are listed clockwise, beginning south, with their respective linear distances to Aalen town centre given in brackets:     ": null
    },
    {
        "Oberkochen": "oberkochen"
    },
    {
        " , ": null
    },
    {
        "Essingen": "essingen"
    },
    {
        " , ": null
    },
    {
        "Heuchlingen": "heuchlingen"
    },
    {
        " , ": null
    },
    {
        "Abtsgmünd": "abtsgmünd"
    },
    {
        " , ": null
    },
    {
        "Neuler": "neuler"
    },
    {
        " , ": null
    },
    {
        "Hüttlingen": "hüttlingen"
    },
    {
        " , ": null
    },
    {
        "Rainau": "rainau"
    },
    {
        " , ": null
    },
    {
        "Westhausen": "westhausen"
    },
    {
        " , ": null
    },
    {
        "Lauchheim": "lauchheim"
    },
    {
        " , ": null
    },
    {
        "Bopfingen": "bopfingen"
    },
    {
        "  and ": null
    },
    {
        "Neresheim": "neresheim"
    },
    {
        " , all in the ": null
    },
    {
        "Ostalbkreis": "ostalbkreis"
    },
    {
        " district, furthermore ": null
    },
    {
        "Heidenheim an der Brenz": "heidenheim an der brenz"
    },
    {
        "  and ": null
    },
    {
        "Königsbronn": "königsbronn"
    },
    {
        " , both in ": null
    },
    {
        "Heidenheim district": "heidenheim"
    },
    {
        ".          Aalens territory consists of the town centre  and the municipalities   ": null
    },
    {
        "merged": "merger"
    },
    {
        " from between 1938 and 1975 .   The municipalities merged in the course of the latest municipal reform of the 1970s are also called  Stadtbezirk e , and are Ortschaften in terms of Baden-Württembergs  Gemeindeordnung  , which means, each of them has its own council elected by its respective residents  and is presided by a spokesperson .     The town centre itself and the merged former municipalities consist of numerous villages , mostly separated by open ground from each other and having their own independent and long-standing history. Some however have been created as ": null
    },
    {
        "planned communities": "planned community"
    },
    {
        ", which were given proper names, but no well-defined borders.     List of villages:             Aalen forms a Mittelzentrum within the ": null
    },
    {
        "Ostwürttemberg": "ostwürttemberg"
    },
    {
        " region. Its designated ": null
    },
    {
        "catchment area": "catchment area"
    },
    {
        " includes the following municipalities of the central and eastern Ostalbkreis district: ": null
    },
    {
        "Abtsgmünd": "abtsgmünd"
    },
    {
        ", ": null
    },
    {
        "Bopfingen": "bopfingen"
    },
    {
        ", ": null
    },
    {
        "Essingen": "essingen"
    },
    {
        ", ": null
    },
    {
        "Hüttlingen": "hüttlingen"
    },
    {
        ", ": null
    },
    {
        "Kirchheim am Ries": "kirchheim am ries"
    },
    {
        ", ": null
    },
    {
        "Lauchheim": "lauchheim"
    },
    {
        ", ": null
    },
    {
        "Neresheim": "neresheim"
    },
    {
        ", ": null
    },
    {
        "Oberkochen": "oberkochen"
    },
    {
        ", ": null
    },
    {
        "Riesbürg": "riesbürg"
    },
    {
        " and ": null
    },
    {
        "Westhausen": "westhausen"
    },
    {
        ", and is interwoven with the catchment area of ": null
    },
    {
        "Nördlingen": "nördlingen"
    },
    {
        ", situated in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ",  east of Aalen.       As Aalens territory sprawls on escarpments of the Swabian Jura, on the Albuch and the Härtsfeld landscapes, and its elevation has a range of , the climate varies from district to district.     The ": null
    },
    {
        "weather station": "weather station"
    },
    {
        " the following data originate from is located between the town centre and Wasseralfingen at about  and has been in operation since 1991.     The sunshine duration is about 1800 hours per year, which averages 4.93 hours per day. So Aalen is above the German average of 1550 hours per year. However, with 167 days of ": null
    },
    {
        "precipitation": "precipitation"
    },
    {
        ", Aalens region also ranks above the German average of 138. The annual rainfall is , which places Aalen in the middle within Baden-Württemberg.    The annual mean temperature is . Here Aalen ranks above the German average of  and the Baden-Württemberg average of .                  Numerous remains of early civilization have been found in the area. Tools made of ": null
    },
    {
        "flint": "flint"
    },
    {
        " and traces of ": null
    },
    {
        "Mesolithic": "mesolithic"
    },
    {
        " human settlement dated between the 8th and 5th millennium BC were found on several sites on the margins of the Kocher and Jagst valleys. On the Schloßbaufeld plateau , situated behind Kocherburg castle near Unterkochen, a hill-top settlement was found, with the core being dated to the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        ". In the Appenwang forest near Wasseralfingen, in Goldshöfe, and in Ebnat, ": null
    },
    {
        "tumuli": "tumulus"
    },
    {
        " of the ": null
    },
    {
        "Hallstatt culture": "hallstatt culture"
    },
    {
        " were found. In Aalen and Wasseralfingen, gold and silver coins left by the ": null
    },
    {
        "Celts": "celts"
    },
    {
        " were found. The Celts were responsible for the fortifications in the Schloßbaufeld settlement consisting of sectional embankments and a stone wall. Also, Near Heisenberg , a Celtic ": null
    },
    {
        "nemeton": "nemeton"
    },
    {
        " has been identified; however it is no longer readily apparent.           After abandoning the ": null
    },
    {
        "Alb Limes": "alb limes"
    },
    {
        "  around 150 ": null
    },
    {
        "AD": "anno domini"
    },
    {
        ", Aalens territory became part of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", in direct vicinity of the then newly erected ": null
    },
    {
        "Rhaetian Limes": "rhaetian limes"
    },
    {
        ". The Romans erected a ": null
    },
    {
        "castrum": "castrum"
    },
    {
        " to house the ": null
    },
    {
        "cavalry": "cavalry"
    },
    {
        " unit  Ala II Flavia milliaria; its remains are known today as Kastell Aalen . The site is west of todays town centre at the bottom of the Schillerhöhe hill. With about 1,000 horsemen and nearly as many ": null
    },
    {
        "groom": "groom"
    },
    {
        "s, it was the greatest fort of ": null
    },
    {
        "auxiliaries": "auxiliaries"
    },
    {
        " along the Rhaetian Limes. There were Civilian settlements adjacent along the south and the east. Around 260 AD, the Romans gave up the fort as they withdrew their presence in unoccupied ": null
    },
    {
        "Germania": "germania"
    },
    {
        " back to the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " and ": null
    },
    {
        "Danube": "danube"
    },
    {
        " rivers, and the ": null
    },
    {
        "Alamanni": "alamanni"
    },
    {
        " took over the region.   Based on 3rd- and 4th-century coins found, the civilian settlement continued to exist for the time being. However, there is no evidence of continued civilization between the Roman era and the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ".       Based on discovery of alamannic graves, archaeologists have established the 7th century as the origination of Aalen. In the northern and western walls of St. Johns church, which is located directly adjacent to the eastern gate of the Roman fort, Roman stones were incorporated. The building that exists today probably dates to the 9th century.     The first mention of Aalen was in 839, when emperor ": null
    },
    {
        "Louis the Pious": "louis the pious"
    },
    {
        " reportedly permitted the ": null
    },
    {
        "Fulda monastery": "fulda monastery"
    },
    {
        " to exchange land with the Hammerstadt village, then known as Hamarstat.    Aalen itself was first mentioned in an inventory list of ": null
    },
    {
        "Ellwangen Abbey": "ellwangen abbey"
    },
    {
        ", dated ca. 1136, as the village Alon, along with a lower nobleman named Conrad of Aalen. This nobleman probably had his ancestral castle at a site south of todays town centre and was subject first to Ellwangen abbey, later to the ": null
    },
    {
        "House of Hohenstaufen": "house of hohenstaufen"
    },
    {
        ", and eventually to the ": null
    },
    {
        "House of Oettingen": "house of oettingen"
    },
    {
        ". 1426 was the last time a member of that house was mentioned in connection with Aalen.   Documents, from the Middle Ages, indicate that the town of Aalen was founded by the Hohenstaufen some time between 1241 and 1246, but at a different location than the earlier village, which was supposedly destroyed in 1388 during the war between the Alliance of Swabian Cities and the Dukes of Bavaria.   Later, it is documented that the counts of Oettingen ruled the town in 1340. They are reported to have pawned the town to Count ": null
    },
    {
        "Eberhard II": "eberhard ii, count of württemberg"
    },
    {
        " and subsequently to the ": null
    },
    {
        "House of Württemberg": "house of württemberg"
    },
    {
        " in 1358 or 1359 in exchange for an amount of money.             ": null
    },
    {
        "Charles IV": "charles iv, holy roman emperor"
    },
    {
        " took the town without a fight after a siege. On 3 December 1360, he declared Aalen an ": null
    },
    {
        "Imperial City": "free imperial city"
    },
    {
        ", that is, a city or town responsible only to the emperor, a status that made it a quasi-sovereign city-state and that it kept until 1803.  In 1377, Aalen joined the Alliance of Swabian Cities, and in 1385, the term civitas appears in the towns seal for the first time. In 1398, Aalen was granted the right to hold markets, and in 1401 Aalen obtained proper jurisdiction.        The oldest artistic representation of Aalen was made in 1528. It was made as the basis of a lawsuit between the town and the Counts of Oettingen at the ": null
    },
    {
        "Reichskammergericht": "reichskammergericht"
    },
    {
        " in Speyer. It shows Aalen surrounded by walls, towers, and double moats. The layout of the moats, which had an embankment built between them, is recognizable by the present streets named Nördlicher, Östlicher, Südlicher and Westlicher Stadtgraben . The wall was about  tall, 1518 ": null
    },
    {
        "single paces": "pace"
    },
    {
        "  long and enclosed an area of . During its early years, the town had two ": null
    },
    {
        "town gate": "town gate"
    },
    {
        "s: The Upper or  Ellwangen Gate in the east, and St. Martins gate in the south; however due to frequent floods, St. Martins gate was bricked up in the 14th century and replaced by the Lower or  Gmünd Gate built in the west before 1400. Later, several minor side gates were added. The central street market took place on the Wettegasse  and the Reichsstädter Straße. So the market district stretched from one gate to the other, however in Aalen it was not straight, but with a 90-degree curve between southern gate and eastern gate.     Around 1500, the civic graveyard was relocated from the town church to St. Johns Church, and in 1514, the Vierundzwanziger was the first assembly constituted by the citizens.     ": null
    },
    {
        "Louis III": "louis iii, duke of württemberg"
    },
    {
        ", on 28 June 1575, nearly 30 years after ": null
    },
    {
        "Martin Luthers": "martin luther"
    },
    {
        "death, ": null
    },
    {
        "Jakob Andreae": "jakob andreae"
    },
    {
        ", professor and chancellor of the ": null
    },
    {
        "University of Tübingen": "university of tübingen"
    },
    {
        ", arrived in Aalen. The sermon he gave the following day convinced the mayor, the council, and the citizens to adopt the ": null
    },
    {
        "Reformation": "protestant reformation"
    },
    {
        " in the town. Andreae stayed in Aalen for four weeks to help with the change. This brought along enormous changes, as the council forbade the Roman Catholic priests to celebrate masses and give sermons. However, after victories of the imperial armies at the beginning of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ", the ": null
    },
    {
        "Prince-Provost": "prince-provost"
    },
    {
        "ry of Ellwangen, which still held the ": null
    },
    {
        "right of patronage": "jus patronatus"
    },
    {
        " in Aalen, were able to temporarily bring Catholicism back to Aalen; however after the military successes of the ": null
    },
    {
        "Protestant Union": "protestant union"
    },
    {
        ", Protestant church practices were instituted again.      two ensigns of the army of ": null
    },
    {
        "Bernard of Saxe-Weimar": "bernard of saxe-weimar"
    },
    {
        " who were fighting with the Swedes and retreating after the ": null
    },
    {
        "Battle of Nördlingen": "battle of nördlingen"
    },
    {
        " set fire to two powder carriages, to prevent the war material to fall into Croatian hands and to prevent their advance. The result was a conflagration, that some say destroyed portions of the town. There are differing stories regarding this fire. According to 17th-century accounts, the church and all the buildings, except of the Schwörturm tower, were casualties of the fire, and only nine families survived. 19th century research by Hermann Bauer, Lutheran pastor and local historian, discovered that the 17th-century account is exaggerated, but he does agree that the town church and buildings in a rather large semicircle around it were destroyed. The fire also destroyed the town archive housed in an addition to the church, with all of its documents. After the fire, soldiers of both armies went through the town looting.  It took nearly 100 years for the town to reach its population of 2,000.          French troops marched through Aalen in 1688 during the ": null
    },
    {
        "Nine Years War": "nine years war"
    },
    {
        "; however, unlike other places, they left without leaving severe damages. The French came through again in 1702 during the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        " and in 1741 during the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        ", the latter also caused imperial troops to move through in 1743.      The town churchs tower collapsed in 1765, presumably because proper building techniques were not utilized during the reconstruction after the fire of 1634. The collapsing tower struck two children of the tower watchman who died of their injuries, and destroyed the nave, leaving only the altar cross intact. The remaining walls had to be knocked down due to the damage. Reconstruction began the same year, creating the building that exists today.     On 22 November 1749, the so-called Aalen protocol regulating the cohabitation of Lutherans and Roman Catholics in the jointly ruled territory of Oberkochen was signed in Aalen by the Duchy of Württemberg and the Prince-Provostry of Ellwangen. Aalen had been chosen because of its neutral status as a Free Imperial City.        During the ": null
    },
    {
        "War of the First Coalition": "war of the first coalition"
    },
    {
        " , Aalen was looted. The War of the Second Coalition concluded in 1801 with the signing of the ": null
    },
    {
        "Treaty of Lunéville": "treaty of lunéville"
    },
    {
        ", which led to the ": null
    },
    {
        "German Mediatisation": "german mediatisation"
    },
    {
        " of 1803 that assigned most Imperial Cities to the neighbouring principalities. Aalen was assigned to the ": null
    },
    {
        "electorate": "prince-elector"
    },
    {
        " of Württemberg, which later became the Kingdom of Württemberg, and became seat of the District of Aalen. During the ": null
    },
    {
        "War of the Third Coalition": "war of the third coalition"
    },
    {
        ", on 6 October 1805, ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        " arrived in Aalen, with an army of 40,000. This event, along with Bavarian and Austrian troops moving in some days later, caused miseries that according to the town clerk no feather could describe .      In 1811, the municipality of Unterrombach was formed out of some villages previously belonging to Aalen, some to the Barons of Wöllwarth, and the eastern villages were assigned to the municipality of Unterkochen.     In the age of the Napoleonic wars, the ": null
    },
    {
        "town walls": "town wall"
    },
    {
        "were no longer of use, and in the 18th century, with the maintenance of walls, gates and towers becoming more neglected Finally, due to the fact that the funds were lacking, starting in 1800, most towers were demolished, the other buildings followed soon.          Before the ": null
    },
    {
        "industrial revolution": "industrial revolution"
    },
    {
        ", Aalens economy was shaped by its rural setting. Many citizens were pursuing farming besides their craft, such as ": null
    },
    {
        "tanning": "tanning"
    },
    {
        ". In the mid 19th century, there were twelve tanneries in Aalen, due to the proximity of ": null
    },
    {
        "Ulm": "ulm"
    },
    {
        ", an important sales market. Other crafts that added to the economy were ": null
    },
    {
        "weaving mills": "weaving"
    },
    {
        ", which produced linen and woolen goods, and baking of sweet pastry and gingerbread.       In Aalen, industrialisation was a slow process. The first major increase was in the 1840s, when three factories for ": null
    },
    {
        "nails": "nail"
    },
    {
        " and some other factories emerged. It was the link with the railway network, by the opening of the ": null
    },
    {
        "Rems Railway": "rems railway"
    },
    {
        " from ": null
    },
    {
        "Cannstatt": "cannstatt"
    },
    {
        " to Wasseralfingen in 1861, that brought more industry to Aalen, along with the royal ": null
    },
    {
        "steel mill": "steel mill"
    },
    {
        "  in Wasseralfingen. The Rems Railways extension to Nördlingen in 1863, the opening of the ": null
    },
    {
        "Brenz Railway": "brenz railway"
    },
    {
        " in 1864 and of the ": null
    },
    {
        "Upper Jagst Railway": "upper jagst railway"
    },
    {
        " in 1866 turned Aalen into a ": null
    },
    {
        "railway hub": "railway hub"
    },
    {
        ". Furthermore, between 1901 and its shutdown in 1972, the ": null
    },
    {
        "Härtsfeld Railway": "härtsfeld railway"
    },
    {
        " connected Aalen with ": null
    },
    {
        "Dillingen an der Donau": "dillingen an der donau"
    },
    {
        " via ": null
    },
    {
        "Neresheim": "neresheim"
    },
    {
        ". Part of becoming a rail hub entailed more jobs based on the rail industry. These included, a maintenance facility, a ": null
    },
    {
        "roundhouse": "railway roundhouse"
    },
    {
        ", an administrative office, two track maintenance shops, and a freight station with an industrial ": null
    },
    {
        "branch line": "branch line"
    },
    {
        ". This helped shape Aalen into what todays historians call a railwaymans town .  Starting in 1866, the utilities in town all began to be upgraded. Starting with the Aalen ": null
    },
    {
        "gasworks": "gasworks"
    },
    {
        " which were opened and ": null
    },
    {
        "gas lighting": "gas lighting"
    },
    {
        " was introduced. Then in 1870, a modern ": null
    },
    {
        "water supply": "water supply"
    },
    {
        " system was started and in 1912 the ": null
    },
    {
        "mains electricity": "mains electricity"
    },
    {
        ". Finally, in 1935, the first electrically powered ": null
    },
    {
        "street lights": "street light"
    },
    {
        "were installed.        To fight housing shortage during and immediately after ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the town set up barracks settlement areas at the Schlauch and Alter Turnplatz grounds. In spite of the industry being crippled by the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " of 1929, the public baths at the Hirschbach creek where modernized, extended and re-opened in 1931.       In the ": null
    },
    {
        "federal election of 1932": "german federal election, november 1932"
    },
    {
        ", the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " performed below average in Aalen with 25.8% of votes compared to 33.1% on the national level, thus finishing second to the ": null
    },
    {
        "Centre Party": "centre party"
    },
    {
        " which had 26.6% of the votes, and ahead of the ": null
    },
    {
        "Social Democratic Party of Germany": "social democratic party of germany"
    },
    {
        " with 19.8% . However, the ": null
    },
    {
        "March 1933 federal elections": "german federal election, march 1933"
    },
    {
        " showed that the sentiment had changed as the Nazi Party received 34.1% , but by far the leading vote-getter in Aalen, followed by the Centre party at 26.6% and the Social Democrats 18.6% .      The democratically elected mayor Friedrich Schwarz remained in office until the Nazis removed him from office, in 1934, and replaced him by chairman of the Nazi Party town council head and brewery owner Karl Barth. Karl Barth was a provisional mayor until the more permanent solution of Karl Schübel. In August 1934, the Nazi consumer fair ": null
    },
    {
        "Braune Messe": "braune messe"
    },
    {
        " was held in Aalen.      During ": null
    },
    {
        "Nazi rule in Germany": "nazi germany"
    },
    {
        ", there were many military offices constructed in Aalen, starting with, in 1936, a ": null
    },
    {
        "military district": "military district"
    },
    {
        " riding and driving school. The Nazis also built an army replenishment office , a branch arsenal office  and a branch army ammunitions institute .     Starting in 1935, ": null
    },
    {
        "mergers": "merger"
    },
    {
        " of neighbouring towns began. In 1938, the Oberamt was transformed into the ": null
    },
    {
        "Landkreis": "districts of germany"
    },
    {
        " of Aalen and the municipality of Unterrombach was disbanded. Its territory was mostly added to Aalen, with the exception of Hammerstadt, which was added to the municipality of Dewangen. Forst, Rauental and Vogelsang were added to Essingen .     In September 1944, the Wiesendorf ": null
    },
    {
        "concentration camp": "nazi concentration camps"
    },
    {
        ", a ": null
    },
    {
        "subcamp": "list of subcamps of natzweiler-struthof"
    },
    {
        " of ": null
    },
    {
        "Natzweiler-Struthof": "natzweiler-struthof"
    },
    {
        ", was constructed nearby. It was designated for between 200 and 300 prisoners who were utilized for ": null
    },
    {
        "forced labor in industrial businesses": "forced labour under german rule during world war ii"
    },
    {
        " nearby. Until the camps dissolution in February 1945, 60 prisoners died.  Between 1946 and 1957, the camp buildings were torn down; however, its foundations are still in place in house Moltkestraße 44/46. Also, there were several other labour camps which existed where prisoners of war along with women and men from occupied countries occupied by Germany were pooled. The prisoners at these other camps had to work for the arms industry in major businesses like Schwäbische Hüttenwerke and the Alfing Keßler machine factory.      In the civic hospital, the ": null
    },
    {
        "deaconess": "deaconess"
    },
    {
        "es on duty were gradually replaced by ": null
    },
    {
        "National Socialist Peoples Welfare": "national socialist peoples welfare"
    },
    {
        " nurses. ": null
    },
    {
        "Nazi eugenics": "nazi eugenics"
    },
    {
        " led to ": null
    },
    {
        "compulsory sterilization": "compulsory sterilization"
    },
    {
        " of some 200 persons there.      Fortunately, Aalen avoided most of the combat activity during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". It was only during the last weeks of the war that Aalen became a target of ": null
    },
    {
        "air warfare": "air warfare of world war ii"
    },
    {
        ", which led to the destruction and severe damage of parts of the town, the train station, and other railway installations. A series of air attacks lasting for more than three weeks reached its peak on 17 April 1945, when ": null
    },
    {
        "United States Army Air Forces": "united states army air forces"
    },
    {
        " planes bombed the branch arsenal office and the train station. During this raid, 59 people were killed, more than half of them buried by debris, and more than 500 lost their homes.  Also, 33  residential buildings, 12  other buildings and 2  bridges were destroyed, and 163  buildings, including 2  churches, were damaged. Five days later, the Nazi rulers of Aalen were unseated by the US forces.       Aalen became part of the State of ": null
    },
    {
        "Baden-Württemberg": "baden-württemberg"
    },
    {
        ", upon its creation in 1952. Then, with the Baden-Württemberg territorial reform of 1973, the District of Aalen was merged into the ": null
    },
    {
        "Ostalbkreis": "ostalbkreis"
    },
    {
        " district. Subsequently, Aalen became seat of that district, and in 1975, the towns borough attained its present size .     The population of Aalen exceeded the limit of 20,000, which was the requirement for to gain the status of ": null
    },
    {
        "Große Kreisstadt": "große kreisstadt"
    },
    {
        " in 1946. On 1 August 1947, Aalen was declared Unmittelbare Kreisstadt , and with the creation of the ": null
    },
    {
        "Gemeindeordnung": "gemeindeordnung"
    },
    {
        " of Baden-Württemberg on 1 April 1956, it was declared Große Kreisstadt.       On 31 December 2008, 51.1  percent of Aalen were members of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", 23.9  percent were members of the ": null
    },
    {
        "Evangelical-Lutheran Church": "evangelical-lutheran church in württemberg"
    },
    {
        ". About 25  percent belong to other or no religious community or gave no information.  The district of Waldhausen was the district with the highest percentage of Roman Catholic inhabitants at 75.6  percent, and the central district was the one with the highest percentage of Evangelical-Lutheran inhabitants at 25.6  percent, as well as those claiming no religious preference at 32.5  percent.       Aalens population originally was subject to the ": null
    },
    {
        "jus patronatus": "jus patronatus"
    },
    {
        " of Ellwangen Abbey, and thus subject to the ": null
    },
    {
        "Roman Catholic Diocese of Augsburg": "roman catholic diocese of augsburg"
    },
    {
        ".     With the assistance of the Duke of Württemberg, in 1575, the ": null
    },
    {
        "reformation": "reformation"
    },
    {
        " was implemented in Aalen. Subsequently, Aalen has been a predominantly Protestant town for centuries, with the exception of the years from 1628 until 1632 . Being an Imperial City, Aalen could govern its clerical matters on its own, so Clerics, organists and choir masters were direct subjects to the council, which thus exerted bishop-like power. There was even a proper hymn book for Aalen. After the transition to Württemberg, in 1803, Aalen became seat of a ": null
    },
    {
        "deanery": "deanery"
    },
    {
        ", with the dean church being the Town Church . Another popular church is ": null
    },
    {
        "St. Johns": "john the baptist"
    },
    {
        " Church, located on the cemetery and refurbished in 1561.     As Aalens population grew in the 20th century, more parishes were founded: ": null
    },
    {
        "St. Marks": "mark the evangelist"
    },
    {
        " parish with its church building of 1967 and ": null
    },
    {
        "St. Martins": "martin of tours"
    },
    {
        " parish with its church of 1974. In the borough of Unterrombach, Aalen had implemented the ": null
    },
    {
        "reformation": "reformation"
    },
    {
        " as well, but the community remained a ": null
    },
    {
        "chapel-of-ease": "chapel of ease"
    },
    {
        " of Aalen. A proper church, the Christ Church, was erected in 1912 and a proper parish was established in 1947. In Fachsenfeld, the ruling family of Woellwarth resp. of Leinroden implemented the reformation. A parish church was built in 1591, however with an influx of Catholics in the 18th century, a Catholic majority was established. The other districts of present-day Aalen remained mostly catholic after the reformation, however Wasseralfingen established a Lutheran parish in 1891 and a church, St. Magdalenes Church, in 1893. In Unterkochen, after World War II, a parish was established and a church was built in 1960. All four parishes belong to the deanery of Aalen within the ": null
    },
    {
        "Evangelical-Lutheran Church in Württemberg": "evangelical-lutheran church in württemberg"
    },
    {
        ". Furthermore, in Aalen there are ": null
    },
    {
        "Old Pietistic": "pietism"
    },
    {
        " communities.          The few Catholics of todays central district were covered by the parish of Unterkochen until the 19th century, a situation which continued for some years even after completion of ": null
    },
    {
        "St. Marys": "mary"
    },
    {
        " Church in 1868, which was constructed by ": null
    },
    {
        "Georg Morlok": "georg morlok"
    },
    {
        ". However, in 1872 Aalen got its proper parish again, and in 1913, a second Catholic church, Salvators Church, was completed, and in 1969 the Holy Cross Church was also finished. In 1963, a second parish was set up, and in 1972 it got a new Church, the new St. Marys Church, which has been erected in place of the old St. Marys church, which had been torn down in 1968. Another church of the second parish was St. Augustines Church, which was completed in 1970. Finally, in 1976 and 1988, St. Elizabeths Church and St. Thomas Church were completed. Furthermore, in 1963, the St. Michael pastoral care office was built.     Hofherrnweiler has its own Catholic church, ": null
    },
    {
        "St. Bonifaces": "saint boniface"
    },
    {
        ", since 1904. The villages of Dewangen, Ebnat, Hofen, Waldhausen and Wasseralfingen had remained Catholic after reformation, so old parishes and churches persist there. The Assumption of Mary Church in Dewangen has an ": null
    },
    {
        "early Gothic": "gothic art"
    },
    {
        " tower and a newly built nave . ": null
    },
    {
        "Marys Immaculate Conception": "immaculate conception"
    },
    {
        " Church in Ebnat was constructed in 1723; however the church was first mentioned in 1298.        Hofens ": null
    },
    {
        "Saint Georges": "saint george"
    },
    {
        "Church is a ": null
    },
    {
        "fortified church": "fortified church"
    },
    {
        ", whose current nave was built between 1762 and 1775.  Alongside the church, the Late Gothic ": null
    },
    {
        "St. Odiles": "odile of alsace"
    },
    {
        " Chapel is standing, whose entrance has the year 1462 engraved upon it. Foundations of prior buildings have been dated to the 11th and 13th century.      St. Marys Church of Unterkochen was first mentioned in 1248, and has served the Catholics of Aalen for a long time. Waldhausens parish church of ": null
    },
    {
        "St. Nicholas": "saint nicholas"
    },
    {
        " was built between 1699 and 1716. Wasseralfingen at first was a ": null
    },
    {
        "chapel of ease": "chapel of ease"
    },
    {
        " for Hofen, but has since had its own chapel, ": null
    },
    {
        "St. Stephen": "saint stephen"
    },
    {
        ", built. It was presumably built in 1353 and remodeled in 1832. In 1834, a proper parish was established, which built a new St. Stephens Church. This new building utilized the ": null
    },
    {
        "Romanesque Revival architecture": "romanesque revival architecture"
    },
    {
        " style and was built between 1881 and 1883, and has since remained the parishs landmark. Also, Fachsenfeld received its own church, named ": null
    },
    {
        "Sacred Heart": "sacred heart"
    },
    {
        " in 1895. All Catholic parishes within Aalen are today incorporated into four pastoral care units within the Ostalb Deanery of the ": null
    },
    {
        "Diocese of Rottenburg-Stuttgart": "roman catholic diocese of rottenburg-stuttgart"
    },
    {
        "; however these units also comprise some parishes outside of Aalen. Pastoral Care Unit two comprises the parishes of Essingen, Dewangen and Fachsenfeld, unit four comprises Hofen and Wasseralfingen, unit five comprises both parishes of Aalens centre and Hofherrnweiler, unit five comprises Waldhausen, Ebnat, Oberkochen and Unterkochen.       In addition to the two major religions within Aalen, there are also ": null
    },
    {
        "free church": "free church"
    },
    {
        "es and other communities, including the ": null
    },
    {
        "United Methodist Church": "united methodist church"
    },
    {
        ", the ": null
    },
    {
        "Baptists": "baptists"
    },
    {
        ", the ": null
    },
    {
        "Seventh-day Adventist Church": "seventh-day adventist church"
    },
    {
        " and the ": null
    },
    {
        "New Apostolic Church": "new apostolic church"
    },
    {
        ".       Until the late 19th century, no ": null
    },
    {
        "Jews": "jew"
    },
    {
        "were documented within Aalen. In 1886 there were four Jews were living in Aalen, a number that rose to ten in 1900, fell to seven in 1905, and remained so until 1925. Upon the Nazis rise to power in 1933, seven Jews, including two children, lived in Aalen.  During the ": null
    },
    {
        "Kristallnacht": "kristallnacht"
    },
    {
        " in 1938, the vitrines of the three Jewish shops in the town were smashed and their proprietors imprisoned for several weeks. After their release, most Aalen Jews emigrated. The last Jews of Aalen, Fanny Kahn, was forcibly resettled to ": null
    },
    {
        "Oberdorf am Ipf": "oberdorf am ipf"
    },
    {
        ", which had a large Jewish community. Today, a street of Aalen is named after her. The Jew Max Pfeffer returned from Brussels to Aalen in 1948 to continue his shop, but emigrated to Italy in 1967.     In Aalen, there is an Islamic ": null
    },
    {
        "Ditib": "turkish-islamic union for religious affairs"
    },
    {
        " community, which maintains the D.I.T.I.B. Mosque of Aalen  located at Ulmer Straße.  The mosques construction started on 30 August 2008. The ": null
    },
    {
        "Millî Görüş": "millî görüş"
    },
    {
        " organisation maintains the ": null
    },
    {
        "Fatih": "mehmed ii"
    },
    {
        " Mosque, as well at Ulmer Straße.        The present-day make up of Aalen was created on 21 June 1975 by the unification of the cities of Aalen and Wasseralfingen,  with the initial name of Aalen-Wasseralfingen. This annexation made Aalens territory one third larger than its prior size. On 1 July 1975, the name Aalen was revived. Prior to this merger, the town of Aalen had already annexed the following municipalities:   1938: Unterrombach   1 January 1970: Waldhausen   1 July 1972: Ebnat   1 January 1973: Dewangen, Fachsenfeld and Unterkochen. The merging of Dewangen nearly doubled the territory of Aalen.          During the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " and the ": null
    },
    {
        "early modern period": "early modern period"
    },
    {
        ", Aalen was just a small town with a few hundred inhabitants. The population grew slowly due to numerous wars, famines and epidemics. It was the beginning of the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " in the 19th century where Aalens growth accelerated. Whereas in 1803, only 1,932 people inhabited the town, in 1905 it had already increased to 10,442. The number continued to rise and reached 15,890 in 1939.     The influx of refugees and ": null
    },
    {
        "ethnic Germans": "heimatvertriebene"
    },
    {
        " from Germanys former eastern territories after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " pushed the population to 31,814 in 1961. The merger with Wasseralfingen on 21 June 1975 added 14,597 persons and resulted in a total population of 65,165 people. On 30 June 2005, the population, which was officially determined by the ": null
    },
    {
        "Statistical Office of Baden-Württemberg": "list of statistical offices in germany"
    },
    {
        ", was 67,125.     The following overview shows how the population figures of the borough were ascertained. Until 1823, the figures are mostly estimates, thereafter census results or official updates by the state statistical office. Starting in 1871, the figures were determined by non-uniform method of tabulation using extrapolation.        ¹ Census result     On 31 December 2008, Aalen had precisely 66,058 inhabitants, of which 33,579 were female and 32,479 were male. The average age of Aalens inhabitants rose from 40.5 years in 2000 to 42.4 in 2008. Within the borough, 6,312 foreigners resided, which is 9.56  percent. Of them, the largest percentage are from ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        " , the second largest group are from Italy , followed by ": null
    },
    {
        "Croatians": "croats"
    },
    {
        " and ": null
    },
    {
        "Serb": "serb"
    },
    {
        " municipal association": "municipal association"
    },
    {
        " with ": null
    },
    {
        "Essingen": "essingen"
    },
    {
        " and ": null
    },
    {
        "Hüttlingen": "hüttlingen, baden-württemberg"
    },
    {
        ".       Since the ": null
    },
    {
        "local election": "local election"
    },
    {
        " of 25 May 2014, the ": null
    },
    {
        "town council": "municipal council"
    },
    {
        " consists of 51  representatives having a term of five years. The seats are distributed as follows on parties and groups :               Since 1374, the mayor and the council maintain the government of the town. In the 16th century, the town had two, sometimes three mayors, and in 1552, the council had 13 members. Later, the head of the administration was reorganized several times. In the Württemberg era, the mayors title was initially called Bürgermeister, then from 1819 it was ": null
    },
    {
        "Schultheiß": "schultheiß"
    },
    {
        ", and since 1947 it is Oberbürgermeister. The mayor is elected for a term of eight years, and he is chairman and a voting member of the council. He has one deputy with the official title of Erster Bürgermeister and one with the official title of Bürgermeister .      Heads of town in Aalen since 1802 : Theodor Betzler   1812–1819: Ludwig Hölder   1819–1829: Theodor Betzler   1829: Palm   1829–1848: Philipp Ehmann   1848–1873: Gustav Oesterlein   1873–1900: Julius Bausch   1900–1902: Paul Maier   1903–1934: Friedrich Schwarz   1935–1945: ": null
    },
    {
        "Karl Schübel": "karl schübel"
    },
    {
        " Otto Balluff": "otto balluff"
    },
    {
        " Ulrich Pfeifle": "ulrich pfeifle"
    },
    {
        "    2005–2013: ": null
    },
    {
        "Martin Gerlach": "martin gerlach"
    },
    {
        "   2013-: ": null
    },
    {
        "Thilo Rentschler": "thilo rentschler"
    },
    {
        "           Aalens ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " depicts a black eagle with a red tongue on golden background, having a red shield on its breast with a bent silver ": null
    },
    {
        "eel": "eel"
    },
    {
        " on it. Eagle and eel were first acknowledged as Aalens heraldic animals in the seal of 1385, with the eagle representing the towns ": null
    },
    {
        "imperial immediacy": "imperial immediacy"
    },
    {
        ". After the territorial reform, it was bestowed again by the ": null
    },
    {
        "Administrative District of Stuttgart": "stuttgart"
    },
    {
        " on 16 November 1976.     The coat of arms ": null
    },
    {
        "blazon": "blazon"
    },
    {
        " reads: “In gold, the black imperial eagle, with a red breast shield applied to it, therein a bent silver eel” .     Aalens flag is striped in red and white and contains the coat of arms.     The origin of the towns name is uncertain. ": null
    },
    {
        "Matthäus Merian": "matthäus merian"
    },
    {
        " presumed the name to originate from its location at the Kocher river, where frequently eels are caught , while Aal is German for eel . Other explanations point to Aalen as the garrison of an ": null
    },
    {
        "ala": "ala"
    },
    {
        " during the Roman empire, respectively to an abridgement of the Roman name Aquileia as a potential name of the Roman fort, a name that nearby ": null
    },
    {
        "Heidenheim an der Brenz": "heidenheim an der brenz"
    },
    {
        " bore as well. Another interpretation points to a Celtic word aa meaning water .             The Twin Cities Society of Aalen  promotes friendly relations between Aalen and its ": null
    },
    {
        "twin cities": "twin towns and sister cities"
    },
    {
        ",  which comprises mutual exchanges of sports and cultural clubs, schools and other civic institutions. On the occasion of the ": null
    },
    {
        "Reichsstädter Tage": "reichsstädter tage"
    },
    {
        ", from 11 until 13 September 2009 the first conference of twinned cities was held.     Aalen has five twin cities:    ": null
    },
    {
        "Saint-Lô": "saint-lô"
    },
    {
        ", France, since 1978    ": null
    },
    {
        "Christchurch": "christchurch, dorset"
    },
    {
        ", United Kingdom, since 1981    ": null
    },
    {
        "Tatabánya": "tatabánya"
    },
    {
        ", Hungary, since 1987    ": null
    },
    {
        "Antakya": "antakya"
    },
    {
        ", Turkey, since 1995. This twinning arrangement was initiated by Ismail Demirtas, who emigrated in 1962 from Turkey to Aalen and was social adviser for foreign employees.     ": null
    },
    {
        "Cervia": "cervia"
    },
    {
        ", Italy, since 2011       On the occasion of the 1980 Reichsstädter Tage, Aalen took over godparenthood for the more than 3000 ethnic Germans displaced from the ": null
    },
    {
        "Wischau": "vyškov"
    },
    {
        " linguistic enclave. 972 of them settled in Aalen in 1946. The Wischau Linguistic Enclave Society  regularly organises commemorative meetings in Aalen. Their traditional costumes are stored in the ": null
    },
    {
        "Old Town Hall": "old town hall"
    },
    {
        ".       According to the 2007 municipal poll by the Baden-Württemberg chapter of the ": null
    },
    {
        "German Taxpayers Federation": "german taxpayers federation"
    },
    {
        ", municipal tax revenues totalling to 54,755 million Euros resp. 62,148 million Euros face the following debts:    Theater der Stadt Aalen  theatre was founded in 1991 and stages 400 to 500 performances a year.        The town endowed the Schubart Literary Award  in 1955 in tribute to ": null
    },
    {
        "Christian Friedrich Daniel Schubart": "christian friedrich daniel schubart"
    },
    {
        ", who spent his childhood and youth in Aalen. It is one of the earliest literary awards in Baden-Württemberg and is awarded biennially to German-language writers whose work coincide with Schubarts liberal and enlightened reasoning .  It is compensated with 12,000  Euros.       Founded in 1958, the ": null
    },
    {
        "Music School": "music school"
    },
    {
        " of the Town of Aalen today has about 1,500 students taught by 27 music instructors in 30 subjects.  In 1977, a ": null
    },
    {
        "symphony orchestra": "symphony orchestra"
    },
    {
        " was founded in Aalen, which today is called Aalener Sinfonieorchester, and consists mostly of instructors and students of the music school. It performs three public concerts annually: The “New Year’s Concert” in January, the “Symphony Concert” in July and a “Christmas Concert” in December.  Beyond that, music festivals regularly take place in Aalen, like the ": null
    },
    {
        "Aalen Jazzfest": "aalen jazzfest"
    },
    {
        ".     The Aalen volunteer fire department has had a ": null
    },
    {
        "marching band": "marching band"
    },
    {
        " since 1952, whose roots date back to 1883. In 1959, the band received its first ": null
    },
    {
        "glockenspiel": "glockenspiel"
    },
    {
        " from TV host ": null
    },
    {
        "Peter Frankenfeld": "peter frankenfeld"
    },
    {
        " on the occasion of a TV appearance.      A famous German rapper, designer and singer, that goes under the name of Cro, was born in Aalen and lived his early years here.            In the central district of Aalen, there are two museums: The “Aalen ": null
    },
    {
        "Limes": "limes germanicus"
    },
    {
        " Museum  is located at the place of the largest ": null
    },
    {
        "Roman cavalry fort": "castra"
    },
    {
        " north of the Alps until about 200 AD. It opened in 1964.  The museum exhibits numerous objects from the Roman era. The ruins of the cavalry fort located beside the museum is open to museum visitors. Every other year, a Roman festival is held in the area of the museum .     In the Geological-Paleontological Museum located in the historic town hall, there are more than 1500 fossils from the Swabian Jura, including ": null
    },
    {
        "ammonite": "ammonite"
    },
    {
        "s, ": null
    },
    {
        "ichthyosaurs": "ichthyosaur"
    },
    {
        "and ": null
    },
    {
        "coral": "coral"
    },
    {
        "s, displayed.     In the Waldhausen district the Heimatstüble museum of local history has an exhibition on agriculture and rural living.     In the Wasseralfingen district, there are two more museums: The Museum Wasseralfingen comprises a local history exhibition and an art gallery including works of ": null
    },
    {
        "Hermann Plock": "hermann plock"
    },
    {
        ", ": null
    },
    {
        "Helmut Schuster": "helmut schuster"
    },
    {
        " and ": null
    },
    {
        "Sieger Köder": "sieger köder"
    },
    {
        ". Also, the ": null
    },
    {
        "stove": "stove"
    },
    {
        " plate collection of the Schwäbische Hüttenwerke steel mill is exhibited, with artists, modellers and the production sequence of a cast plate from design to final product being presented.          There is memorial stone at the Schillerlinde tree above Wasseralfingens ore pit dedicated to four prisoners of the subcamp of Natzweiler-Struthof concentration camp killed there. Also in Wasseralfingen, in the cemetery a memorial with the Polish inscription To the victims of Hitler which commemorates the deceased forced labourers buried there.     In 1954, on the Schillerhöhe hill the town erected a bell tower as a memorial to Aalens victims of both world wars and to the ": null
    },
    {
        "displacement of ethnic Germans": "heimatvertriebene"
    },
    {
        ". The tower was planned by ": null
    },
    {
        "Emil Leo": "emil leo"
    },
    {
        ", the bell was endowed by Carl Schneider. The tower is open on request. Every evening at 18:45 , the memorials bell rings.                The town centre is dominated by the Evangelical-Lutheran ": null
    },
    {
        "St. Nicholas": "saint nicholas"
    },
    {
        " Church in the heart of the pedestrian area. The church, in its present shape being built between 1765 and 1767, is the only major ": null
    },
    {
        "Late Baroque": "late baroque"
    },
    {
        " building in Aalen and is the main church of the Evangelical-Lutheran parish of Aalen.     St. Johns Church is located inside of St. Johns cemetery in the western centre. The building presumably is from the 9th century and thus is one of Württembergs oldest existing churches. The interior features ": null
    },
    {
        "frescos": "fresco"
    },
    {
        "from the early 13th century.     For other churches in Aalen, see the ": null
    },
    {
        "Religions": "religions"
    },
    {
        " section.          The Historic Town Hall was originally built in the 14th century. After the fire of 1634, it was re-constructed in 1636. This building received a clock from Lauterburg, and the Imperial City of ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " donated a ": null
    },
    {
        "Carillon": "carillon"
    },
    {
        ". It features a figurine of the Spy of Aalen and historically displayed other figurines, however the latter ones were lost by a fire in 1884. Since then, the Spy resides inside the reconstructed tower and has become a symbol of the town. The building was used as the town hall until 1907. Since 1977, the Geological-Paleontological Museum resides in the Historic Town Hall.      According to legend, the citizens of Aalen owe the Spy of Aalen  their town having been spared from destruction by the emperors army:     The Imperial City of Aalen once was were in quarrel with the emperor, and his army was shortly before the gates to take the town. The people of Aalen got scared and thus dispatched their “most cunning” one out into the enemy’s camp to spy out the strength of their troops. Without any digression, he went straight into the middle of the enemy camp, which inescapably led to him being seized and presented to the emperor. When the emperor asked him what he had lost here, he answered in ": null
    },
    {
        "Swabian German": "swabian german"
    },
    {
        ": Dont frighten, high lords, I just want to peek how many cannons and other war things youve got, since I am the spy of Aalen . The emperor laughed upon such a blatancy and acted naïvety, steered him all through the camp and then sent him back home. Soon the emperor withdrew with his army as he thought a town such wise guys reside in deserved being spared.        The earliest record of the Old Town Hall was in 1575. Its outside wall features the oldest known coat of arms, which is of 1664. Until 1851, the building also housed the Krone-Post hotel, which coincided with being a station of the ": null
    },
    {
        "Thurn und Taxis postal company": "thurn-und-taxis-post"
    },
    {
        ". It has housed many notable persons. Thus the so-called Napoleon Window with its N painted on reminds of the stay of French emperor ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        " in 1805. According to legend, he rammed his head so hard it bled on this window, when he was startled by the noise of his soldiers ridiculing the Spy of Aalen . The building was used as Aalens town hall from 1907 until 1975. Today it houses a cabaret café and the stage of the Theatre of the Town of Aalen. The town has adopted the Wischau Linguistic Enclave Society due to their godparenthood and stores their traditional costumes in the building.       The Bürgerspital is a ": null
    },
    {
        "timber-frame": "timber framing"
    },
    {
        " house erected on Spritzenhausplatz in 1702. Until 1873, it was used as civic hospital, then, later as a retirement home. After a comprehensive renovation in 1980 it was turned into a senior citizens community centre.       On a slope of the Langert mountain, south of the town, the Limes-Thermen  ": null
    },
    {
        "hot springs": "hot spring"
    },
    {
        "are located. They were built in ancient Roman style and opened in 1985. The health spa is supplied with water about .       The market square is the historic hub of Aalen and runs along about  from the town hall in the south to the Historic Town Hall and the Old Town Hall in the north, where it empties into Radgasse alley. Since 1809, it is site of the weekly market on Wednesday and Saturday. About  in front of the Reichsstädter Brunnen fountain at the town hall, the coats of arms of Aalen, its twinned cities and of the Wischau linguistic enclave are paved into the street as mosaic.        In 1705, for the water supply of Aalen a well casing was erected at the northern point of the market square, in front of the Historic Town Hall. It was a present of duke ": null
    },
    {
        "Eberhard Louis": "eberhard louis, duke of württemberg"
    },
    {
        ". The fountain bore a statue of emperor ": null
    },
    {
        "Joseph  I.": "joseph i, holy roman emperor"
    },
    {
        ", who was enthroned in 1705 and in 1707 renewed Aalens Imperial City privileges. The fountain was supplied via a wooden pipe. Excessive water was dissipated through ditches branched from Kocher river. When in the early 1870s Aalens water network was constructed, the fountain was replaced by a smaller fountain about  distant. In 1975, the old market fountain was re-erected in baroque style. It bears a replica of the emperors statue, with the original statue exhibited in the new town halls lobby. The ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        " casing plates depict the 1718 coat of arms of the Duchy of Württemberg and the coats of arms of Aalen and of the merged municipalities.     Reichsstädter Brunnen fountain is located in front of the town hall at the southern point of the market square. It was created by sculptor ": null
    },
    {
        "Fritz Nuss": "fritz nuss"
    },
    {
        " in 1977 to commemorate Aalens time as an Imperial City . On its circumference is a ": null
    },
    {
        "frieze": "frieze"
    },
    {
        " showing bronze figurines illustrating the towns history.       The Radgasse features Aalens oldest façade. Originally a small pond was on its side. The buildings were erected between 1659 and 1662 for peasants with citizenry privileges and renovated in the mid-1980s. The namesake for the alley was the Wheel tavern, which was to be found at the site of todays address Radgasse 15.          The former iron ore pit Wilhelm at Braunenberg hill was converted into the Tiefer Stollen tourist mine in order to remind of the old-day miners efforts and to maintain it as a memorial of early industrialisation in the Aalen area. It has a mining museum open for visitors, and a ": null
    },
    {
        "mine railway": "mine railway"
    },
    {
        " takes visitors deep into the mountain. The Town of Aalen, a sponsorship association, and many citizens volunteered several thousand hours of labour to put the mine into its current state. As far as possible, things were left in the original state. In 1989, a sanitary gallery was established where respiratory diseases are treated within rest cures. Thus the Aalen village of Röthard, where the gallery is located, was awarded the title of Place with sanitary gallery service in 2004.        The Aalen Observatory was built in 1969 as school observatory for the Schubart ": null
    },
    {
        "Gymnasium": "gymnasium"
    },
    {
        ". In 2001, it was converted to a public observatory. Since then, it has been managed by the Astronomische Arbeitsgemeinschaft Aalen . It is located on Schillerhöhe hill and features two ": null
    },
    {
        "refractive telescope": "refractive telescope"
    },
    {
        "s. They were manufactured by ": null
    },
    {
        "Carl Zeiss AG": "carl zeiss ag"
    },
    {
        " which has its headquarters in nearby Oberkochen and operates a manufacturing works in Aalen . In the observatory, guided tours and lectures are held regularly.          The Windpark Waldhausen ": null
    },
    {
        "wind farm": "wind farm"
    },
    {
        " began operations in early 2007. It consists of seven ": null
    },
    {
        "REpower": "repower"
    },
    {
        " MM92 wind turbines with a ": null
    },
    {
        "nameplate capacity": "nameplate capacity"
    },
    {
        " of 2 MW each.  The hub height of each wind turbine is , with a rotor diameter of .          The  tall Aalbäumle observation tower is built atop Langert mountain. This popular hiking destination was built in 1898 and was remodelled in 1992. It features a good view over Aalen and the Welland region, up to the Rosenstein mountain and Ellwangen. Beneath the tower, an adventure playground and a cabin is located. A flag on the tower signals whether the cabins restaurant is open.       The Baden-Württemberg State Institute for Environment, Measurements and Natural Conservation has laid out six protected landscapes in Aalen , two sanctuary forests , 65 extensive ": null
    },
    {
        "natural monument": "natural monument"
    },
    {
        "s, 30 individual natural monuments and the following two ": null
    },
    {
        "protected areas": "protected areas"
    },
    {
        ":      The  large Dellenhäule protected area between Aalens Waldhausen district and Neresheims Elchingen district, created in 1969, is a sheep pasture with ": null
    },
    {
        "juniper": "juniper"
    },
    {
        " and ": null
    },
    {
        "wood pasture": "wood pasture"
    },
    {
        " of old willow oaks.      The  large Goldshöfer Sande protected area was established in 2000 and is situated between Aalens Hofen district and Hüttlingen. The sands on the hill originated from the ": null
    },
    {
        "Early Pleistocene": "early pleistocene"
    },
    {
        " are of geological importance, and the various grove structures offer habitat to severely endangered bird species.           The football team, ": null
    },
    {
        "VfR Aalen": "vfr aalen"
    },
    {
        ", was founded in 1921 and played in the ": null
    },
    {
        "2nd German League": "2. fußball-bundesliga"
    },
    {
        " between 2012 and 2015, after which they were relegated to ": null
    },
    {
        "3. Liga": "3. liga"
    },
    {
        ". Its playing venue is the ": null
    },
    {
        "Scholz-Arena": "scholz-arena"
    },
    {
        " situated in the west of the town, which bore the name Städtisches Waldstadion Aalen until 2008. From 1939 until 1945, the VfR played in the ": null
    },
    {
        "Gauliga Württemberg": "gauliga württemberg"
    },
    {
        ", then one of several parallel top-ranking soccer leagues of Germany.     The ": null
    },
    {
        "KSV Aalen": "ksv aalen"
    },
    {
        " wrestles in the ": null
    },
    {
        "Wrestling Federal League": "bundesliga"
    },
    {
        ". It was German champion in team wrestling in 2010. Its predecessor, the KSV Germania Aalen disbanded in 2005, was German champion eight times and runner-up five times since 1976. Another Aalen club, the ": null
    },
    {
        "TSV Dewangen": "tsv dewangen"
    },
    {
        ", wrestled in the Federal League until 2009.     Two American sports, ": null
    },
    {
        "American Football": "american football"
    },
    {
        " and ": null
    },
    {
        "Baseball": "baseball"
    },
    {
        ", are pursued by the MTV Aalen. ": null
    },
    {
        "Volleyball": "volleyball"
    },
    {
        " has been gaining in popularity in Aalen for years. The first mens team of DJK Aalen accomplished qualification for regional league in the season of 2008/09.     The Ostalb ski lifts are located south of the town centre, at the northern slope of the Swabian Jura. The skiing area comprises two ": null
    },
    {
        "platter lifts": "platter lift"
    },
    {
        "that have a vertical rise of , with two runs with lengths of  and a beginners run.          Since 1975, Reichsstädter Tage festival is held annually in the town centre on the second weekend in September. It is deemed the largest festival of the ": null
    },
    {
        "Ostwürttemberg": "ostwürttemberg"
    },
    {
        " region,  and is associated with a shopping Sunday in accordance with the ": null
    },
    {
        "Ladenschlussgesetz": "ladenschlussgesetz"
    },
    {
        " code. The festival is also attended by delegations from the twinned cities. On the town hall square, on Sunday an ": null
    },
    {
        "ecumenical service": "ecumenism"
    },
    {
        " is held.       The international Roman Festival  are held biannially on the site of the former Roman fort and the modern Limes museum. The festivals ninth event in 2008 was attended by around 11,000 people.        Annually during the second week of November, the ": null
    },
    {
        "Aalen Jazz Festival": "aalen jazz festival"
    },
    {
        " brings known and unknown artists to Aalen. It has already featured musicians like ": null
    },
    {
        "Miles Davis": "miles davis"
    },
    {
        ", ": null
    },
    {
        "B. B. King": "b. b. king"
    },
    {
        ", ": null
    },
    {
        "Ray Charles": "ray charles"
    },
    {
        ", ": null
    },
    {
        "David Murray": "david murray"
    },
    {
        ", ": null
    },
    {
        "McCoy Tyner": "mccoy tyner"
    },
    {
        ", ": null
    },
    {
        "Al Jarreau": "al jarreau"
    },
    {
        ", ": null
    },
    {
        "Esbjörn Svensson": "esbjörn svensson"
    },
    {
        " and ": null
    },
    {
        "Albert Mangelsdorff": "albert mangelsdorff"
    },
    {
        ". The festival is complemented by individual concerts in spring and summer, and, including the individual concerts, comprises around 25 concerts with a total of about 13,000 visitors.       In 2008 there were 30,008 employees liable to ": null
    },
    {
        "social insurance": "social insurance"
    },
    {
        " living in Aalen. 13,946 were employed in the ": null
    },
    {
        "manufacturing sector": "secondary sector of the economy"
    },
    {
        ", 4,715 in commerce, catering, hotels and transport, and 11,306 in other services.  Annually 16,000 employees commute to work, with about 9,000 living in the town and commuting out.      Altogether in Aalen there are about 4,700 business enterprises, 1,100 of them being registered in the ": null
    },
    {
        "trade register": "german trade register"
    },
    {
        ". The others comprise 2,865 ": null
    },
    {
        "small enterprises": "kleingewerbe"
    },
    {
        " and 701 craft enterprises.      In Aalen, ": null
    },
    {
        "metalworking": "metalworking"
    },
    {
        " is the predominant industry, along with machine-building. Other industries include ": null
    },
    {
        "optics": "optics"
    },
    {
        ", paper, information technology, ": null
    },
    {
        "chemicals": "chemicals"
    },
    {
        ", textiles, medical instruments, pharmaceuticals, and food.     Notable enterprises include SHW Automotive , the Alfing Kessler engineering works, the precision tools manufacturer MAPAL Dr.  Kress, the snow chain manufacturer RUD  Ketten  Rieger   &  Dietz and its subsidiary Erlau, the Gesenkschmiede Schneider forging die smithery, the SDZ Druck und Medien media company, the Papierfabrik Palm paper mill, the alarm system manufacturer Telenot, the laser show provider LOBO electronic and the ": null
    },
    {
        "textile finisher": "finishing"
    },
    {
        " Lindenfarb, which all have their seat in Aalen. A branch in Aalen is maintained by optical systems manufacturer ": null
    },
    {
        "Carl Zeiss": "carl zeiss ag"
    },
    {
        " headquartered in nearby Oberkochen.              ": null
    },
    {
        "Aalen station": "aalen station"
    },
    {
        " is a regional railway hub on the ": null
    },
    {
        "Rems Railway": "rems railway"
    },
    {
        " from ": null
    },
    {
        "Stuttgart": "stuttgart hauptbahnhof"
    },
    {
        ", the ": null
    },
    {
        "Brenz Railway": "brenz railway"
    },
    {
        " from ": null
    },
    {
        "Ulm": "ulm hauptbahnhof"
    },
    {
        ", the ": null
    },
    {
        "Upper Jagst Railway": "upper jagst railway"
    },
    {
        " to ": null
    },
    {
        "Crailsheim": "crailsheim"
    },
    {
        " and the ": null
    },
    {
        "Ries Railway": "ries railway"
    },
    {
        " to ": null
    },
    {
        "Donauwörth": "donauwörth station"
    },
    {
        ". Until 1972, the ": null
    },
    {
        "Härtsfeld Railway": "härtsfeld railway"
    },
    {
        " connected Aalen with ": null
    },
    {
        "Dillingen an der Donau": "dillingen an der donau"
    },
    {
        " via ": null
    },
    {
        "Neresheim": "neresheim"
    },
    {
        ". Other railway stations within the town limits are Hofen , Unterkochen, Wasseralfingen and ": null
    },
    {
        "Goldshöfe station": "goldshöfe station"
    },
    {
        ". The Aalen-Erlau stop situated in the south is no longer operational.     Aalen station is served at two-hour intervals by trains of ": null
    },
    {
        "Intercity": "intercity"
    },
    {
        " line 61 ": null
    },
    {
        "Karlsruhe": "karlsruhe hauptbahnhof"
    },
    {
        "–Stuttgart–Aalen–": null
    },
    {
        "Nuremberg": "nürnberg hauptbahnhof"
    },
    {
        ". For regional rail travel, Aalen is served by various lines of the ": null
    },
    {
        "Interregio-Express": "interregio-express"
    },
    {
        ", ": null
    },
    {
        "Regional-Express": "regional-express"
    },
    {
        " and ": null
    },
    {
        "Regionalbahn": "regionalbahn"
    },
    {
        " categories. Since the beginning of 2019, the british company ": null
    },
    {
        "Go-Ahead": "go-ahead verkehrsgesellschaft deutschland"
    },
    {
        " took over the regional railway business of ": null
    },
    {
        "DB Regio": "db regio"
    },
    {
        " in the region surrounding Aalen. The town also operates the Aalen ": null
    },
    {
        "industrial railway": "industrial railway"
    },
    {
        " , which carries about 250 carloads per year.        Aalen also is a regional hub in the bus network of OstalbMobil, the transport network of the district Aalen is in. The bus lines are operated and serviced by regional companies like OVA and RBS RegioBus Stuttgart.       The junctions of Aalen/ Westhausen  and Aalen/Oberkochen connect Aalen with the ": null
    },
    {
        "Autobahn": "autobahn"
    },
    {
        " A7": "bundesautobahn 7"
    },
    {
        " . Federal roads  connecting with Aalen are ": null
    },
    {
        "B  19": "bundesstraße 19"
    },
    {
        " , ": null
    },
    {
        "B  29": "bundesstraße 29"
    },
    {
        "  and ": null
    },
    {
        "B  290": "bundesstraße 290"
    },
    {
        " . The ": null
    },
    {
        "Schwäbische Dichterstraße": "schwäbische dichterstraße"
    },
    {
        " tourist route established in 1977/78 leads through Aalen.     Several bus lines operate within the borough. The Omnibus-Verkehr Aalen company is one of the few in Germany that use ": null
    },
    {
        "double-decker bus": "double-decker bus"
    },
    {
        "es, it has done so since 1966.  A district-wide fare system, OstalbMobil, has been in effect since 2007.       Stuttgart Airport, offering international connections, is about  away, the travel time by train is about 100  Minutes. At ": null
    },
    {
        "Aalen-Heidenheim Airport": "aalen-heidenheim airport"
    },
    {
        ", located  south-east of Aalen, small aircraft are permitted. ": null
    },
    {
        "Gliding": "gliding"
    },
    {
        " airfields nearby are in ": null
    },
    {
        "Heubach": "heubach"
    },
    {
        " and ": null
    },
    {
        "Bartholomä": "bartholomä"
    },
    {
        ".       Bicycle routes stretching through Aalen are the Deutscher Limes-Radweg  and the Kocher-Jagst Bicycle Route.       Aalen houses an ": null
    },
    {
        "Amtsgericht": "amtsgericht"
    },
    {
        " , chambers of the Stuttgart ": null
    },
    {
        "Labour Court": "labor court"
    },
    {
        ", a ": null
    },
    {
        "notarys office": "civil law notary"
    },
    {
        ", a tax office and an ": null
    },
    {
        "employment agency": "employment agency"
    },
    {
        ". It is the seat of the Ostalbkreis district office, of the Aalen Deanery of the Evangelical-Lutheran Church and of the Ostalb deanery of the ": null
    },
    {
        "Roman Catholic Diocese of Rottenburg-Stuttgart": "roman catholic diocese of rottenburg-stuttgart"
    },
    {
        ".     The Stuttgart ": null
    },
    {
        "administrative court": "administrative court"
    },
    {
        ", the Stuttgart Labour Court and the Ulm Social Welfare Court are in charge for Aalen.     Aalen had a civic hospital, which resided in the Bürgerspital building until 1873, then in a building at Alte Heidenheimer Straße. In 1942, the hospital was taken over by the district. The district hospital at the present site of Kälblesrain, known today as Ostalb-Klinikum, was opened in 1955.       The first local newspaper, Der Bote von Aalen , has been published on Wednesdays and Saturdays since 1837.     Currently, local newspapers published in Aalen are the  Schwäbische Post , which obtains its supra-regional pages from the Ulm-based ": null
    },
    {
        "Südwestpresse": "südwestpresse"
    },
    {
        ", and the Aalener Nachrichten , a local edition of ": null
    },
    {
        "Schwäbische Zeitung": "schwäbische zeitung"
    },
    {
        " in ": null
    },
    {
        "Leutkirch im Allgäu": "leutkirch im allgäu"
    },
    {
        ".     Two of Germanys biggest ": null
    },
    {
        "Lesezirkels": "lesezirkel"
    },
    {
        " are headquartered in Aalen: Brabandt LZ Plus Media and Lesezirkel Portal.     Regional event magazines are Xaver, åla, ålakultur.     The commercial broadcasters Radio Ton and Radio 7 have studios in Aalen.       A ": null
    },
    {
        "Latin school": "latin school"
    },
    {
        " was first recorded in Aalen in 1447; it was remodeled in 1616 and also later in various buildings that were all situated near the town church, and continued up through the 19th century. In the course of the reformation, a German school was established in tandem, being a predecessor of the latter ": null
    },
    {
        "Volksschule": "volksschule"
    },
    {
        " school type. In 1860, the Ritterschule was built as a Volksschule for girls; the building today houses the Pestalozzischule. In 1866, a new building was erected for the Latin school and for the ": null
    },
    {
        "Realschule": "realschule"
    },
    {
        " established in 1840. This building, later known as the Alte Gewerbeschule, was torn down in 1975 to free up land for the new town hall. In 1912, the Parkschule building was opened. It was designed by ": null
    },
    {
        "Paul Bonatz": "paul bonatz"
    },
    {
        " and today houses the Schubart- Gymnasium      The biggest educational institution in the town is the  Hochschule Aalen , which was founded in 1962 and focuses on engineering and economics. It is attended by 5000 students on five campuses and employs 129 professors and 130 other lecturers.     The town provides three ": null
    },
    {
        "Gymnasium": "gymnasium"
    },
    {
        "s, four ": null
    },
    {
        "Realschule": "realschule"
    },
    {
        "n, two Förderschulen , six combined ": null
    },
    {
        "Grundschule": "grundschule"
    },
    {
        "n and ": null
    },
    {
        "Hauptschule": "hauptschule"
    },
    {
        "n and eight standalone Grundschulen. The Ostalbkreis district provides three vocational schools and three additional special schools. Finally, six non-state schools of various types exist.     The German ": null
    },
    {
        "Esperanto": "esperanto"
    },
    {
        " Library  has been located in the building of the town library since 1989.       The ": null
    },
    {
        "Südwestrundfunk": "südwestrundfunk"
    },
    {
        " broadcasting company operates the Aalen ": null
    },
    {
        "transmission tower": "transmitter"
    },
    {
        " on the Braunenberg hill. The tower was erected in 1956, it is  tall and made of ": null
    },
    {
        "reinforced concrete": "reinforced concrete"
    },
    {
        ".       The following vehicles are named Aalen :   The ": null
    },
    {
        "Lufthansa": "lufthansa"
    },
    {
        " Boeing 737-500": "boeing 737-500"
    },
    {
        " D-ABJF ": null
    },
    {
        "Deutsche Bahn": "deutsche bahn"
    },
    {
        " ICE 3": "ice 3"
    },
    {
        " Tz309  ": null
    },
    {
        "Erwin Rommel": "erwin rommel"
    },
    {
        " , Field Marshal of World War II, grew up in Aalen   Paul Edel    Wilhelm Jakob Schweiker , founder of the Aalen Historical Society  and name giver of the Wilhelm Jakob Schweiker Award   ": null
    },
    {
        "Ulrich Pfeifle": "ulrich pfeifle"
    },
    {
        ", Mayor of Aalen from 1976 until 2005        ": null
    },
    {
        "Johann Christoph von Westerstetten": "johann christoph von westerstetten"
    },
    {
        " , Bishop of ": null
    },
    {
        "Eichstätt": "eichstätt"
    },
    {
        " and counter-reformer   ": null
    },
    {
        "Karl Joseph von Hefele": "karl joseph von hefele"
    },
    {
        " , Roman Catholic theologian, clerical historian and bishop   ": null
    },
    {
        "Karl Wahl": "karl wahl"
    },
    {
        " , Gauleiter of Swabia, ": null
    },
    {
        "Obergruppenführer": "obergruppenführer"
    },
    {
        "    Kurt Jooss": "kurt jooss"
    },
    {
        " , born in Wasseralfingen; dancer, choreographer and dance educator   ": null
    },
    {
        "August Zehender": "august zehender"
    },
    {
        " , SS Brigade Commander and Major General of the Waffen-SS   Paul Buck , piano teacher   ": null
    },
    {
        "Bruno Heck": "bruno heck"
    },
    {
        " , politician of the CDU, former minister of the federal government and CDU secretary general   Alfred Bachofer , former Lord Mayor of ": null
    },
    {
        "Nürtingen": "nürtingen"
    },
    {
        " Walter Adams": "walter adams"
    },
    {
        " , middle distance runner   Ivo Holzinger , politician , Lord Mayor of ": null
    },
    {
        "Memmingen": "memmingen"
    },
    {
        "   Werner Sobek": "werner sobek"
    },
    {
        " , architect and structural engineer   Ludwig Leinhos , major general of the Bundesluftwaffe   Bernd Hitzler , politician, , Member of Landtag   ": null
    },
    {
        "Martin Gerlach": "martin gerlach"
    },
    {
        " , independent politician, mayor of Aalen   ": null
    },
    {
        "Thomas Zander": "thomas zander"
    },
    {
        " , wrestler, winner of Olympic silver medal and world champion   ": null
    },
    {
        "Carl-Uwe Steeb": "carl-uwe steeb"
    },
    {
        " , retired tennis player   Katrin Bauerfeind , radio and TV-presenter   ": null
    },
    {
        "Manuel Fischer": "manuel fischer"
    },
    {
        " , footballer   ": null
    },
    {
        "Patrick Funk": "patrick funk"
    },
    {
        " , footballer   ": null
    },
    {
        "Cro": "cro"
    },
    {
        " , Carlo Waibel 1739–17911873–19141903–1945born 1939born 1953 in Heidenheim": null
    },
    {
        "otball": "otball"
    },
    {
        "born 1987 in Kemerovo/Soviet Union": null
    }
]