[
    {
        "            Ab urbe condita , or Anno urbis conditae , often abbreviated as AUC in either case, is a convention that was used in antiquity and by ": null
    },
    {
        "classical historians": "classicist"
    },
    {
        " to refer to a given year in ": null
    },
    {
        "Ancient Rome": "ancient rome"
    },
    {
        ". Ab urbe condita literally means from the ": null
    },
    {
        "founded city": "founding of rome"
    },
    {
        " , while anno urbis conditæ means in the year of the founded city . Therefore, the traditional year of the foundation of Rome, ": null
    },
    {
        "753 BC": "753 bc"
    },
    {
        ", would be written AUC 1, while ": null
    },
    {
        "AD 1": "ad 1"
    },
    {
        " would be AUC 754. The foundation of the ": null
    },
    {
        "Empire": "roman empire"
    },
    {
        " in 27 BC would be AUC 727.     Usage of the term was more common during the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ", when editors sometimes added AUC to Roman manuscripts they published, giving the false impression that the convention was commonly used in antiquity. In reality, the dominant method of identifying years in Roman times was to name the two ": null
    },
    {
        "consuls": "roman consul"
    },
    {
        "who held office that year. In late antiquity, ": null
    },
    {
        "regnal years": "regnal years"
    },
    {
        " were also in use, as was the ": null
    },
    {
        "Diocletian era": "diocletian era"
    },
    {
        " in Roman Egypt after AD 293, and in the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " after AD 537, following a decree by ": null
    },
    {
        "Justinian": "justinian"
    },
    {
        ".       The traditional date for the founding of Rome, 21 April 753 BC, is due to ": null
    },
    {
        "Marcus Terentius Varro": "marcus terentius varro"
    },
    {
        " . Varro may have used the consular list and called the year of the first consuls ab urbe condita 245, accepting the 244-year interval from ": null
    },
    {
        "Dionysius of Halicarnassus": "dionysius of halicarnassus"
    },
    {
        " for the kings after the foundation of Rome. The correctness of this calculation has not been confirmed, but it is still used worldwide.     From the time of ": null
    },
    {
        "Claudius": "claudius"
    },
    {
        " onward, this calculation superseded other contemporary calculations. Celebrating the anniversary of the city became part of imperial ": null
    },
    {
        "propaganda": "propaganda"
    },
    {
        ". Claudius was the first to hold magnificent celebrations in honor of the anniversary of the city, in AD 48, the eight hundredth year from the founding of the city. ": null
    },
    {
        "Hadrian": "hadrian"
    },
    {
        " and ": null
    },
    {
        "Antoninus Pius": "antoninus pius"
    },
    {
        " held similar celebrations, in AD 121, and in AD 147 and AD 148, respectively.     In AD 248, ": null
    },
    {
        "Philip the Arab": "philip the arab"
    },
    {
        " celebrated Romes first ": null
    },
    {
        "millennium": "millennium"
    },
    {
        ", together with ": null
    },
    {
        "Ludi saeculares": "ludi saeculares"
    },
    {
        " for Romes alleged tenth ": null
    },
    {
        "saeculum": "saeculum"
    },
    {
        ". ": null
    },
    {
        "Coins": "coin"
    },
    {
        "from his reign commemorate the celebrations. A coin by a contender for the imperial throne, ": null
    },
    {
        "Pacatianus": "pacatianus"
    },
    {
        ", explicitly states ar one thousand and first , which is an indication that the citizens of the empire had a sense of the beginning of a new era, a Sæculum Novum.          The ": null
    },
    {
        "Anno Domini": "anno domini"
    },
    {
        " year numbering was developed by a monk named ": null
    },
    {
        "Dionysius Exiguus": "dionysius exiguus"
    },
    {
        " in Rome in AD 525, as a result of his work on calculating the date of Easter.   Dionysius did not use the AUC convention, but instead based his calculations on the   ": null
    },
    {
        "Diocletian era": "diocletian era"
    },
    {
        ".   This convention had been in use since AD 293, the year of the ": null
    },
    {
        "tetrarchy": "tetrarchy"
    },
    {
        ", as it became impractical to use regnal years of the current emperor.   J. David Thomas, On Dating by Regnal Years of Diocletian, Maximian and the Caesars ,   Chronique dEgypte 46.91 , 173 & ndash;179, .   In his Easter table, the year AD 532 was equated with the 248th regnal year of Diocletian. The table counted the years starting from the presumed birth of Christ, rather than the accession of the emperor ": null
    },
    {
        "Diocletian": "diocletian"
    },
    {
        " on 20 November AD 284, or as stated by Dionysius:  sed magis elegimus ab incarnatione Domini nostri Jesu Christi annorum tempora praenotare  . Liber de Paschate, ": null
    },
    {
        "Migne": "jacques paul migne"
    },
    {
        ",  Patrologia Latina ,  Blackburn and Holford-Strevens review interpretations of Dionysius which place the ": null
    },
    {
        "Incarnation": "incarnation"
    },
    {
        " in 2 BC, 1 BC, or AD 1. Blackburn, B. & Holford-Strevens, L, The Oxford Companion to the Year 778 & ndash;780.     The year AD 1 corresponds to AUC 754, based on the epoch of Varro.     Thus,     AUC 1 753 BC   AUC 753 1 BC   AUC 754 AD 1   AUC 1000 AD 247   AUC 1229 ": null
    },
    {
        "AD 476": "fall of the western roman empire"
    },
    {
        " AD 1453": "fall of constantinople"
    },
    {
        "  AD   AD ": null
    }
]