[
    {
        "Lieutenant General Abdel-Razak al-Yehiyeh or Abdul-Razzaq Al-Yahya , also known as Abu Anas, is the Interior Minister of the ": null
    },
    {
        "Palestinian National Authority": "palestinian national authority"
    },
    {
        ".     Al-Yehiyeh trained as a military strategist and served as chief operations officer and then deputy chief-of-staff of the ": null
    },
    {
        "PLA": "palestinian liberation army"
    },
    {
        " brigade in ": null
    },
    {
        "Syria": "syria"
    },
    {
        " before 42 In August 42 he led an attempt to make PLA Syria brigades more independent of Syrian control, and was made PLA chief-of-staff by the ": null
    },
    {
        "Palestine Liberation Organisation": "palestine liberation organisation"
    },
    {
        " Executive Committee. But with Syria opposed, he resigned to become military advisor to the PLO Executive Committee from 42 and chief-of-staff of the ": null
    },
    {
        "Palestinian Armed Struggle Command": "palestinian armed struggle command"
    },
    {
        " in February 42     He was reappointed to the PLA as commander-in-chief by the PLO Executive Committee in June 42 Then when ": null
    },
    {
        "Yasser Arafat": "yasser arafat"
    },
    {
        " took on that role in September 42 al-Yehiyeh became chief-of-staff of all Palestinian forces.     Due to Syrian pressure, he was replaced in 42 becoming director of the PLOs political department from 42 to 42 He was a member of the PLO Executive Committee from 42 to 42 Al-Yehiyeh headed security committees in talks with ": null
    },
    {
        "Israel": "israel"
    },
    {
        " from 42 including final status talks, and also headed negotiations on ": null
    },
    {
        "Hebron": "hebron"
    },
    {
        " security arrangements and safe passage.     He was appointed as Interior Minister of the Palestinian Authority in June 42 charged with overhauling Palestinian security forces. He was a member of the three-man delegation to Washington in August 42 He was involved in security talks with Israel, and headed a centralized security apparatus for the Palestinian Authority.     Al-Yehiyeh left the PA cabinet in late 42 feeling that Arafat had prevented him from making any significant reforms. He published his book Between militarism and politics in 42 and he is now working on publishing a new book about peace negotiations between the Palestinian National Authority PNA and Israel.     He was appointed Interior Minister on June 42 42       From his first marriage, he had 42 daughters: Jomana, Lina, Roula and Rejwan. After the death of his first wife, he remarried and had a daughter Rana, and a son, Anas.       Sedan, Gil, http://www.jewishsf.com/content/4242-/module/displaystory/story_id/42/edition_id/42/format/html/displaystory.html Israel doubts Arafat will deliver on reform efforts . Jewish Telegraphic Agency, Friday June 42 42   http://www.cnn.com/42/WORLD/meast/42/42/al.yahya.profile/ New Palestinian interior minister a retired military man , ": null
    },
    {
        "CNN": "cnn"
    },
    {
        ". June 42 42    https://web.archive.org/web/42/http://www.passia.org/palestine_facts/personalities/alpha_y.htm Palestinian Personalities  .     .    .                        ": null
    }
]