[
    {
        "The term abdominal surgery broadly covers surgical procedures that involve opening the ": null
    },
    {
        "abdomen": "Abdomen"
    },
    {
        " . Surgery of each abdominal organ is dealt with separately in connection with the description of that organ  Diseases affecting the abdominal cavity are dealt with generally under their own names .       The most common abdominal surgeries are described below.     ": null
    },
    {
        "Appendectomy": "Appendectomy"
    },
    {
        "—Surgical opening of the abdominal cavity and removal of the ": null
    },
    {
        "appendix": "Vermiform Appendix"
    },
    {
        ". Typically performed as definitive treatment for appendicitis, although sometimes the appendix is prophylactically removed incidental to another abdominal procedure.   ": null
    },
    {
        "Caesarean section": "Caesarean Section"
    },
    {
        " is a surgical procedure in which one or more incisions are made through a mothers abdomen and uterus to deliver one or more babies, or, rarely, to remove a dead fetus.   ": null
    },
    {
        "Inguinal hernia surgery": "Inguinal Hernia Surgery"
    },
    {
        "—This refers to the repair of an ": null
    },
    {
        "inguinal hernia": "Inguinal Hernia"
    },
    {
        ".   Exploratory ": null
    },
    {
        "laparotomy": "Laparotomy"
    },
    {
        "—This refers to the opening of the ": null
    },
    {
        "abdominal cavity": "Abdominal Cavity"
    },
    {
        " for direct examination of its contents, for example, to locate a source of bleeding or ": null
    },
    {
        "trauma": "Physical Trauma"
    },
    {
        ". It may or may not be followed by repair or removal of the primary problem.   ": null
    },
    {
        "Laparoscopy": "Laparoscopy"
    },
    {
        "—A ": null
    },
    {
        "minimally invasive": "Minimally Invasive"
    },
    {
        " approach to abdominal surgery where rigid tubes are inserted through small incisions into the abdominal cavity. The tubes allow introduction of a small camera, surgical instruments, and gases into the cavity for direct or indirect visualization and treatment of the abdomen. The abdomen is inflated with carbon dioxide gas to facilitate visualization and, often, a small video camera is used to show the procedure on a monitor in the operating room. The surgeon manipulates instruments within the abdominal cavity to perform procedures such as cholecystectomy , the most common laparoscopic procedure. The laparoscopic method speeds recovery time and reduces blood loss and infection as compared to the traditional open method.       Complications of abdominal surgery include, but are not limited to:   ": null
    },
    {
        "Adhesions": "Adhesion"
    },
    {
        " : Complications of postoperative adhesion formation are frequent, they have a large negative effect on patients’ health, and increase workload in clinical practice    ": null
    },
    {
        "Bleeding": "Hemorrhage"
    },
    {
        " Infection": "Infection"
    },
    {
        " Paralytic ileus": "Paralytic Ileus"
    },
    {
        " : short-term paralysis of the bowel   ": null
    },
    {
        "Perioperative mortality": "Perioperative Mortality"
    },
    {
        "   Shock": "Shock"
    },
    {
        "     Sterile technique, ": null
    },
    {
        "aseptic": "Aseptic"
    },
    {
        " post-operative care, ": null
    },
    {
        "antibiotics": "Antibiotics"
    },
    {
        ", use of the ": null
    },
    {
        "WHO Surgical Safety Checklist": "Who Surgical Safety Checklist"
    },
    {
        ", and vigilant post-operative monitoring greatly reduce the risk of these complications. Planned surgery performed under sterile conditions is much less risky than that performed under emergency or unsterile conditions. The contents of the bowel are unsterile, and thus leakage of bowel contents, as from trauma, substantially increases the risk of infection.     Globally, there are few studies comparing ": null
    },
    {
        "perioperative mortality": "Perioperative Mortality"
    },
    {
        " following abdominal surgery across different health systems. One major prospective study of 10,745 adult patients undergoing emergency ": null
    },
    {
        "laparotomy": "Laparotomy"
    },
    {
        " from 357 centres in 58 high-, middle-, and low-income countries found that mortality is three times higher in low- compared with high-HDI countries even when adjusted for prognostic factors.  In this study the overall global mortality rate was 1·6 per cent at 24 hours ": null
    }
]