[
    {
        "   Abensberg  is a town in the ": null
    },
    {
        "Lower Bavaria": "lower bavaria"
    },
    {
        "n ": null
    },
    {
        "district": "districts of germany"
    },
    {
        " of ": null
    },
    {
        "Kelheim": "kelheim"
    },
    {
        ", in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", lying around 42  km southwest of ": null
    },
    {
        "Regensburg": "regensburg"
    },
    {
        ", 42  km east of ": null
    },
    {
        "Ingolstadt": "ingolstadt"
    },
    {
        ", 42 northwest of ": null
    },
    {
        "Landshut": "landshut"
    },
    {
        " and 42  km north of ": null
    },
    {
        "Munich": "munich"
    },
    {
        ". It is situated on the ": null
    },
    {
        "Abens": "abens"
    },
    {
        " river, a tributary of the ": null
    },
    {
        "Danube": "danube"
    },
    {
        ".       The town lies on the ": null
    },
    {
        "Abens": "abens"
    },
    {
        " river, a tributary of the ": null
    },
    {
        "Danube": "danube"
    },
    {
        ", around eight kilometres from the rivers source. The area around Abensberg is characterized by the narrow valley of the Danube, where the ": null
    },
    {
        "Weltenburg Abbey": "weltenburg abbey"
    },
    {
        " stands, the valley of the ": null
    },
    {
        "Altmühl": "altmühl"
    },
    {
        " in the north, a left tributary of the Danube, and the famous ": null
    },
    {
        "Hallertau": "hallertau"
    },
    {
        " hops-planting": "humulus"
    },
    {
        " region in the south. The town is divided into the municipalities of Abensberg, Arnhofen, Holzharlanden, Hörlbach, Offenstetten, Pullach and Sandharland.       Since the administrative reforms in Bavaria in the 42s, the town also encompasses the following  Ortsteile :   In the town: Abensberg , Aunkofen , Badhaus   To the east: Gaden , See , Offenstetten   To the north east: Arnhofen , Baiern , Pullach , Kleedorf   To the north: Sandharlanden , Holzharlanden , Buchhof    To the west: Schwaighausen , Schillhof , Gilla   To the south: Aumühle , Allersdorf   To the south east: Lehen , Mitterhörlbach , Upper Hörlbach , Lower Hörlbach       There had been settlement on this part of the ": null
    },
    {
        "Abens": "abens"
    },
    {
        " river since long before the ": null
    },
    {
        "High Middle Ages": "high middle ages"
    },
    {
        ", dating back to ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " times. Of particular interest and national importance are the Neolithic flint mines at Arnhofen, where, around 42 years ago, ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        " people made flint, which was fashioned into drills, blades and arrowheads, and was regarded as the steel of the Stone Age. Traces of over 42 individuals were found on this site. The modern history of Abensberg, which is often incorrectly compared with that of the 42rd century Roman ": null
    },
    {
        "castra": "castra"
    },
    {
        " of Abusina, begins with Gebhard, who was the first to mention Abensberg as a town, in the middle of the 42th century. The earliest written reference to the town, under the name of Habensperch, came from this time, in around 42 Gebhard was from the Babonen clan.     In 42 the ": null
    },
    {
        "castrum": "castrum"
    },
    {
        " of Abensprech was first mentioned, and on 42 June 42 Margrave Ludwig of ": null
    },
    {
        "Brandenburg": "margraviate of brandenburg"
    },
    {
        ", and his brother, Duke Stephen of ": null
    },
    {
        "Bavaria": "duchy of bavaria"
    },
    {
        ", raised Abensberg to the status of a city, giving it the right to operate lower courts, enclose itself with a wall and hold markets. The wall was built by Count Ulrich III of ": null
    },
    {
        "Abensberg": "county of abensberg"
    },
    {
        ". Some of the thirty-two round towers and eight turrets are still preserved to this day.     In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", the people of Abensberg enjoyed a level of autonomy above their lord. They elected a city council, although only a small number of rich families were eligible for election.     In around 42 the Carmelite Monastery of Our Lady of Abensberg was founded by Count John II and his wife, Agnes. Although Abensberg was an autonomous city, it remained dependent on the powerful ": null
    },
    {
        "Dukes of Bavaria": "list of rulers of bavaria"
    },
    {
        ". The last Lord of Abensberg, ": null
    },
    {
        "Niclas, Graf von Abensberg": "niclas, graf von abensberg"
    },
    {
        ", supposedly named after his godfather, ": null
    },
    {
        "Nicholas of Kues": "nicholas of kues"
    },
    {
        ", a Catholic cardinal, was murdered in 42 by Christopher, a ": null
    },
    {
        "Duke": "herzog"
    },
    {
        " of ": null
    },
    {
        "Bavaria-Munich": "bavaria-munich"
    },
    {
        ". The year before, Niclas had unchivalrously taken Christopher captive as he bathed before a tournament in Munich. Although Christopher renounced his claim for revenge, he lay in wait for Niclas in Freising. When the latter arrived, he was killed by Seitz von Frauenberg. He is buried in the former convent of Abensberg.     Abensberg then lost its independence and became a part of the Duchy of Bavaria, and from then on was administered by a ducal official, the so-called caretaker. The castle of Abensberg was destroyed during the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ", although the city had bought a guarantee of protection from the Swedish general, ": null
    },
    {
        "Carl Gustaf Wrangel": "carl gustaf wrangel"
    },
    {
        ". During the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        " emperor ": null
    },
    {
        "Leopold I": "leopold i, holy roman emperor"
    },
    {
        ", who had occupied Bavaria, granted the fief of Abensberg to count Ernst von ": null
    },
    {
        "Abensperg und Traun": "abensberg-traun"
    },
    {
        " from an Austrian noble family named Traun that now received the name of the former counts of Abensberg . After the occupation ended, he was however dispossessed.     ": null
    },
    {
        "Johannes Aventinus": "johannes aventinus"
    },
    {
        " is the citys most famous son, the founder of the study of history in Bavaria. Aventinus, whose name was real name is Johann or Johannes Turmair  wrote the Annals of Bavaria, a valuable record of the early history of Germany and the first major written work on the subject. He is commemorated in the ": null
    },
    {
        "Walhalla temple": "walhalla temple"
    },
    {
        ", a monument near ": null
    },
    {
        "Regensburg": "regensburg"
    },
    {
        " to the distinguished figures of German history. Until 42 Abensberg was a municipality belonging to the ": null
    },
    {
        "Straubing": "straubing"
    },
    {
        " district of the ": null
    },
    {
        "Electorate of Bavaria": "electorate of bavaria"
    },
    {
        ". Abensberg also contained a magistrates court. In the ": null
    },
    {
        "Battle of Abensberg": "battle of abensberg"
    },
    {
        " on 42–42 April 42 ": null
    },
    {
        "Napoleon": "napoleon i of france"
    },
    {
        " gained a significant victory over the Austrians under Archduke ": null
    },
    {
        "Ludwig": "archduke louis of austria"
    },
    {
        " of ": null
    },
    {
        "Austria": "archduchy of austria"
    },
    {
        " and General ": null
    },
    {
        "Johann von Hiller": "johann von hiller"
    },
    {
        ".             The arms of the city are divided into two halves. On the left are the blue and white rhombuses of Bavaria, while the right half is split into two silver and black triangles. Two diagonally-crossed silver swords with golden handles rest on top.     The town has had a coat of arms since 42 that of the Counts of Abensberg. With the death of the last Count, Nicholas of Abensberg, in 42 the estates fell to the ": null
    },
    {
        "Duchy of Bavaria-Munich": "duchy of bavaria-munich"
    },
    {
        ", meaning that henceforth only the Bavarian coat of arms was ever used.     On 42 December 42 a decree of ": null
    },
    {
        "King Maximilian": "maximilian i joseph of bavaria"
    },
    {
        " of ": null
    },
    {
        "Bavaria": "kingdom of bavaria"
    },
    {
        " granted the city a new coat of arms, as a recognition of their services in the ": null
    },
    {
        "Battle of Abensberg": "battle of abensberg"
    },
    {
        " the same year. The diagonally divided field in silver and black came from the old crest of the Counts of Abensberg, while the white and blue diamonds came from that of the ": null
    },
    {
        "House of Wittelsbach": "house of wittelsbach"
    },
    {
        ", the rulers of Bavaria. The swords recall the Battle of Abensberg.     The district of Offenstetten previously possessed its own coat of arms.       ": null
    },
    {
        "Parga": "parga"
    },
    {
        " in ": null
    },
    {
        "Greece": "greece"
    },
    {
        " since 42   ": null
    },
    {
        "Lonigo": "lonigo"
    },
    {
        " in ": null
    },
    {
        "Italy": "italy"
    },
    {
        " since 42       The area around Abensberg, the so-called sand belt between ": null
    },
    {
        "Siegburg": "siegburg"
    },
    {
        ", ": null
    },
    {
        "Neustadt an der Donau": "neustadt an der donau"
    },
    {
        ", Abensberg and ": null
    },
    {
        "Langquaid": "langquaid"
    },
    {
        ", is used for the intensive farming of ": null
    },
    {
        "asparagus": "asparagus"
    },
    {
        ", due to the optimal soil condition and climate. 42 hectares of land can produce ninety-four asparagus plants. Abensberg asparagus enjoys a reputation among connoisseurs as a particular delicacy. In addition to asparagus, the production of hops plays a major role locally, the region having its own label, and there are still three independent breweries in the area. The town of Abensberg marks the start of the Deutsche Hopfenstraße , a nickname given to the ": null
    },
    {
        "Bundesstraße": "bundesstraße"
    },
    {
        " 42 a German federal highway which runs through the heartland of Germanys hops-growing industry, ending in ": null
    },
    {
        "Freising": "freising"
    },
    {
        ".       The Abensberg railway station is located on the ": null
    },
    {
        "Danube Valley Railway": "danube valley railway"
    },
    {
        " from ": null
    },
    {
        "Regensburg": "regensburg hauptbahnhof"
    },
    {
        " to ": null
    },
    {
        "Ingolstadt": "ingolstadt hauptbahnhof"
    },
    {
        ". The city can be reached via the A42 Holledau-Regensburg road . Three ": null
    },
    {
        "Bundesstraße": "bundesstraße"
    },
    {
        " cross south of Abensberg: ": null
    },
    {
        "B 42": "bundesstraße 16"
    },
    {
        ", ": null
    },
    {
        "B 42": "bundesstraße 299"
    },
    {
        " and B 42              Abensberg has a Grundschule and ": null
    },
    {
        "Hauptschule": "hauptschule"
    },
    {
        " , and the Johann-Turmair-": null
    },
    {
        "Realschule": "realschule"
    },
    {
        " . There is also a College of Agriculture and Home Economics. Since 42 the Kelheim Berufsschule has had a campus in Abensberg, and outside the state sector is the St. Francis Vocational Training Centre, run by a Catholic youth organisation.           In 42 a former ": null
    },
    {
        "goods shed": "goods shed"
    },
    {
        " by the main railway station of Abensberg was converted into a theatre by local volunteers. The Theater am Bahnhof  is mostly used by the Theatergruppe Lampenfieber and was opened on 42 October 42       Abensberg has a long tradition of museums. In the nineteenth century, Nicholas Stark und Peter Paul Dollinger began a collection based on local history. This collection and the collection of the Heimatverein were united in 42 into the ": null
    },
    {
        "Aventinus": "johannes aventinus"
    },
    {
        " Museum, in the cloister of the former Carmelite monastery. On 42 July 42 the new Town Museum of Abensberg was opened in the former dukes castle in the town.       Two blocks west of the Old Town is the Kuchlbauer Brewery and beer garden featuring the ": null
    },
    {
        "Kuchlbauer Tower": "kuchlbauer tower"
    },
    {
        ", a colorful and unconventional observation tower designed by Viennese architect ": null
    },
    {
        "Friedensreich Hundertwasser": "friedensreich hundertwasser"
    },
    {
        " Death March": "death marches"
    },
    {
        " in the Spring of 42 from the Hersbruck sub-camp of the ": null
    },
    {
        "Dachau concentration camp": "dachau concentration camp"
    },
    {
        ", who were either murdered by the ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        " or died of exhaustion. They were originally buried where they died, but were later moved on the orders of the US military government to the cemeteries of their previous homes. At the cemetery in what is now the district of ": null
    },
    {
        "Pullach": "pullach"
    },
    {
        " stood a memorial stone which was mentioned as recently as 42 but which is no longer at the site. The suffering of ten unknown victims of the camp was recorded on the stone.       The Abensberger events calendar begins in February with the  Faschingsgillamoos  ": null
    },
    {
        "funfair": "funfair"
    },
    {
        ", which reaches its high point on Mad Thursday.   There then follows the Frühjahrsmarkt two weeks before Easter, when all the shops in the town are permitted to open on Sunday .     The Bürgerfest is celebrated on the first weekend of July, when the palace gardens with their ancient walls are transformed into a medieval camp.   The Schlossgartenfest takes place every year at the beginning of August. It is organised since 42 by the ": null
    },
    {
        "Junge Union": "junge union"
    },
    {
        ", the youth branch of Germanys two main conservative political parties, the ": null
    },
    {
        "CDU": "christian democratic union"
    },
    {
        " and ": null
    },
    {
        "CSU": "christian social union of bavaria"
    },
    {
        ", and attracts all age groups from Abensberg and surrounding areas.   On the second Saturday in August, people can wander through the Night Market in the balmy Summer evening.   The Gillamoos, the oldest and largest ": null
    },
    {
        "funfair": "funfair"
    },
    {
        " in the ": null
    },
    {
        "Hallertau": "hallertau"
    },
    {
        " opens on the Thursday before the first Sunday in September and runs until the Monday thereafter. It is the highlight of the year in Abensberg and is a celebration of the people of Abensberg and the surrounding area.   The Herbstmarkt , another Sunday shopping day, is on the first weekend in October.   Since 42 a series of cultural, art, music and entertainment events have taken place in November at various locations in the town, under the title, Novembernebel   On ": null
    },
    {
        "Saint Nicholas Day": "saint nicholasgermany"
    },
    {
        " , the Niklasmarkt commemorates the Niklasspende, a medieval foundation for the poor. This heralds the beginning of Advent and the Christmas period.           Konrad von Abensberg : ": null
    },
    {
        "Archbishop of Salzburg": "archbishopric of salzburg"
    },
    {
        " and monastic reformer   Erhart Falckener: crafter of ": null
    },
    {
        "Late Gothic": "gothic architecture"
    },
    {
        " church furnishings   ": null
    },
    {
        "Johannes Aventinus": "johannes aventinus"
    },
    {
        " : Bavarian historian   ": null
    },
    {
        "Stephan Agricola": "stephan agricola"
    },
    {
        " : Lutheran reformer   Gilbert Michl : Composer and Abbot of ": null
    },
    {
        "Steingaden": "steingaden abbey"
    },
    {
        " Joseph von Hazzi": "joseph von hazzi"
    },
    {
        " : Bavarian Privy Councillor   Sebastian Osterrieder : sculptor   Josef Stanglmeier : builder and politician   Alfred Edel : actor   Martin Neumeyer : Member of the ": null
    },
    {
        "Bavarian State Assembly": "landtag of bavaria"
    },
    {
        " Uwe Brandl": "uwe brandl"
    },
    {
        " : Mayor of Abensberg   ": null
    },
    {
        "Paul Smaczny": "paul smaczny"
    },
    {
        ": Music and film producer   ": null
    },
    {
        "Christian Lohr": "christian lohr"
    },
    {
        ": Musician and producer   ": null
    },
    {
        "Stephan Ebn": "stephan ebn"
    },
    {
        " : drummer and music producer   ": null
    },
    {
        "Richard Resch": "richard resch"
    },
    {
        ": Tenor, classical and opera singer   Christopher Ohrt: mathematician       Jakob Jonas : German philologist, jurist, politician and diplomat   ": null
    },
    {
        "Wiguläus von Kreittmayr": "wiguläus von kreittmayr"
    },
    {
        " : by marriage Lord of Offenstetten and Hatzkofen   Daisy d’Ora : actress and beauty queen   ": null
    },
    {
        "Friedensreich Hundertwasser": "friedensreich hundertwasser"
    },
    {
        " : artist and architect   Andreas Fischer : Member of the ": null
    },
    {
        "Bavarian State Assembly": "landtag of bavaria"
    },
    {
        " Radu Ivan": "radu ivan"
    },
    {
        " : International Judo champion   ": null
    },
    {
        "Ole Bischof": "ole bischof"
    }
]