[
    {
        "In ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", abessive , caritive and privative  is the ": null
    },
    {
        "grammatical case": "grammatical case"
    },
    {
        " expressing the lack or absence of the marked noun. In ": null
    },
    {
        "English": "english language"
    },
    {
        ", the corresponding function is expressed by the ": null
    },
    {
        "preposition": "preposition"
    },
    {
        "  without  or by the ": null
    },
    {
        "suffix": "affix"
    },
    {
        "  -less .     The name abessive is derived from ": null
    },
    {
        "Latin": "latin language"
    },
    {
        " abesse to be away/absent , and is especially used in reference to ": null
    },
    {
        "Uralic languages": "uralic languages"
    },
    {
        ". The name caritive is derived from Latin carere to lack , and is especially used in reference to ": null
    },
    {
        "Caucasian languages": "caucasian languages"
    },
    {
        ". The name privative is derived from Latin privare to deprive .           In the ": null
    },
    {
        "Somali language": "somali language"
    },
    {
        ", the abessive case is marked by -laa or -la and dropping all but the first ": null
    },
    {
        "syllable": "syllable"
    },
    {
        " on certain words. For example:   :jeceylaa love   :jeelaa loveless   :dar clothes   :dharlaaan clothesless, i.e., ": null
    },
    {
        "naked": "naked"
    },
    {
        "           In ": null
    },
    {
        "Martuthunira": "martuthunira language"
    },
    {
        ", the privative case is formed with two suffixes, -wirriwa and -wirraa. What determines which suffix is used in a given situation is unclear.              In the ": null
    },
    {
        "Finnish language": "finnish language"
    },
    {
        ", the abessive case is marked by -tta for back vowels and -ttä for front vowels according to ": null
    },
    {
        "vowel harmony": "vowel harmony"
    },
    {
        ". For example:   :raha money   :rahatta without money   An equivalent construction exists using the word ilman and the ": null
    },
    {
        "partitive": "partitive"
    },
    {
        ":   :ilman rahaa without money   or, less commonly:   :rahaa ilman without money   The abessive case of ": null
    },
    {
        "nouns": "nouns"
    },
    {
        " is rarely used in writing and even less in speech, although some abessive forms are more common than their equivalent ilman forms:   :tuloksetta unsuccessfully, fruitlessly   :Itkin syyttä. I cried for no reason.   The abessive is, however, commonly used in ": null
    },
    {
        "nominal forms of verbs": "verbal noun"
    },
    {
        " , such as puhu-ma-tta without speaking , osta-ma-tta without buying, välittä-mä-ttä without caring:   :Juna jäi tulematta. The train didnt show up.   This form can often be replaced by using the negative form of the verb:   :Juna ei tullut.     It is possible to occasionally hear what is considered wrong usage of the abessive in Finnish, where the abessive and ilman forms are combined:   :ilman rahatta   There is debate as to whether this is interference from ": null
    },
    {
        "Estonian": "estonian language"
    },
    {
        ".         ": null
    },
    {
        "Estonian": "estonian language"
    },
    {
        " also uses the abessive, which is marked by -ta in both the singular and the plural:   : autota without a car    Unlike in Finnish, the abessive is commonly used in both written and spoken Estonian.     The ": null
    },
    {
        "nominal forms of verbs": "verbal noun"
    },
    {
        " are marked with the affix -ma- and the abessive marker -ta:   :Rong jäi tulemata. The train didnt show up.     ": null
    },
    {
        "Tallinn": "tallinn"
    },
    {
        " has a pair of ": null
    },
    {
        "bars": "bar"
    },
    {
        " that play on the use of the ": null
    },
    {
        "comitative": "comitative"
    },
    {
        " and ": null
    },
    {
        "abessive": "abessive"
    },
    {
        ", the Nimeta baar  Nimeta baar, English page and the Nimega baar  Nimega baar  .         The ": null
    },
    {
        "abessive": "abessive"
    },
    {
        " marker for nouns in ": null
    },
    {
        "Skolt Sámi": "skolt sami language"
    },
    {
        " is -tää or -taa in both the singular and the plural:   :Riâkkum veäʹrtää. I cried for no reason.   The ": null
    },
    {
        "abessive": "abessive"
    },
    {
        "-like non-finite verb form  is -ǩâni or -kani:   :Son vuõʹlji domoi mainsteǩâni mõʹnt leäi puättam. He/she went home without saying why he/she had come.   Unlike Finnish, the Skolt Sámi abessive has no competing expression for lack of an item.         The ": null
    },
    {
        "abessive": "abessive"
    },
    {
        " marker for nouns in ": null
    },
    {
        "Inari Sámi": "inari sami language"
    },
    {
        " is -táá. The corresponding non-finite verb form is -hánnáá, -hinnáá or -hennáá.       The abessive is not used productively in the Western Sámi languages, although it may occur as a ": null
    },
    {
        "cranberry morpheme": "cranberry morpheme"
    },
    {
        ".       In ": null
    },
    {
        "Hungarian": "hungarian language"
    },
    {
        ", the abessive case is marked by -talan for back vowels and -telen for front vowels according to ": null
    },
    {
        "vowel harmony": "vowel harmony"
    },
    {
        ". Sometimes, with certain roots, the suffix becomes -tlan or -tlen. For example:   :pénz money   :pénztelen without money   :haza home   :hazátlan without a homeland   There is also the postposition nélkül, which also means without, but is not meant for physical locations. ": null
    }
]