[
    {
        "                 Abraham  is the common patriarch of ": null
    },
    {
        "Christianity, Islam, Judaism, and other religions": "Abrahamic Religions"
    },
    {
        ". In ": null
    },
    {
        "Judaism": "Judaism"
    },
    {
        ", he is the founding father of the ": null
    },
    {
        "covenant of the pieces": "Covenant Of The Pieces"
    },
    {
        ", the special relationship between the ": null
    },
    {
        "Hebrews": "Hebrews"
    },
    {
        " and ": null
    },
    {
        "God": "God In Judaism"
    },
    {
        "; in ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", he is the prototype of all believers, Jewish or ": null
    },
    {
        "Gentile": "Gentile"
    },
    {
        "; and in ": null
    },
    {
        "Islam": "Islam"
    },
    {
        " he is seen as a link in the ": null
    },
    {
        "chain of prophets": "Prophets And Messengers In Islam"
    },
    {
        " that begins with ": null
    },
    {
        "Adam": "Adam"
    },
    {
        " and culminates in ": null
    },
    {
        "Muhammad": "Muhammad"
    },
    {
        ".     The narrative in the ": null
    },
    {
        "Book of Genesis": "Book Of Genesis"
    },
    {
        " revolves around the themes of posterity and land. Abraham is called by ": null
    },
    {
        "God": "El Shaddai"
    },
    {
        " to leave the house of his father ": null
    },
    {
        "Terah": "Terah"
    },
    {
        " and settle in the land originally given to ": null
    },
    {
        "Canaan": "Canaan"
    },
    {
        " but which God now promises to Abraham and ": null
    },
    {
        "his progeny": "Abrahams Family Tree"
    },
    {
        ". Various candidates are put forward who might inherit the land after Abraham; and, while promises are made to ": null
    },
    {
        "Ishmael": "Ishmael"
    },
    {
        " about founding a great nation, ": null
    },
    {
        "Isaac": "Isaac"
    },
    {
        ", Abrahams son by his half-sister ": null
    },
    {
        "Sarah": "Sarah"
    },
    {
        ", inherits Gods promises to Abraham. Abraham purchases a tomb  at ": null
    },
    {
        "Hebron": "Hebron"
    },
    {
        " to be Sarahs grave, thus establishing his right to the land; and, in the second generation, his heir Isaac is married to a woman from his own kin, thus ruling the ": null
    },
    {
        "Canaan": "Canaan"
    },
    {
        "ites out of any inheritance. Abraham later marries ": null
    },
    {
        "Keturah": "Keturah"
    },
    {
        " and has six more sons; but, on his death, when he is buried beside Sarah, it is Isaac who receives all Abrahams goods , while the other sons receive only gifts .     The Abraham story cannot be definitively related to any specific time, and it is widely agreed that the ": null
    },
    {
        "patriarchal age": "Patriarchal Age"
    },
    {
        ", along with the ": null
    },
    {
        "exodus": "The Exodus"
    },
    {
        " and the period of the ": null
    },
    {
        "judges": "Biblical Judges"
    },
    {
        ", is a late literary construct that does not relate to any period in actual history. A common hypothesis among scholars is that it was composed in the early Persian period as a result of tensions between Jewish landowners who had stayed in ": null
    },
    {
        "Judah": "Yehud Medinata"
    },
    {
        " during the ": null
    },
    {
        "Babylonian captivity": "Babylonian Captivity"
    },
    {
        " and traced their right to the land through their father Abraham , and the returning exiles who based their counter-claim on ": null
    },
    {
        "Moses": "Moses"
    },
    {
        " and ": null
    },
    {
        "the Exodus": "The Exodus"
    },
    {
        " tradition.              ": null
    },
    {
        "Terah": "Terah"
    },
    {
        ", the ninth in descent from ": null
    },
    {
        "Noah": "Noah"
    },
    {
        ", was the father of three sons: Abram, ": null
    },
    {
        "Nahor": "Nahor, Son Of Terah"
    },
    {
        ", and ": null
    },
    {
        "Haran": "Haran"
    },
    {
        ". The ": null
    },
    {
        "entire family": "Abrahams Family Tree"
    },
    {
        ", including grandchildren, lived in ": null
    },
    {
        "Ur of the Chaldees": "Ur Of The Chaldees"
    },
    {
        ". According to a ": null
    },
    {
        "midrash": "Midrash"
    },
    {
        ", Abram worked in ": null
    },
    {
        "Terahs idol shop": "Abraham And The Idol Shop"
    },
    {
        " in his youth. Haran was the father of ": null
    },
    {
        "Lot": "Lot"
    },
    {
        ", and thus Lot was Abrams nephew. Haran died in his native city, Ur of the Chaldees.     Abram married ": null
    },
    {
        "Sarah ": "Sarah"
    },
    {
        ", who was barren. Terah, with Abram, Sarai, and Lot, then departed for Canaan, but settled in a place named ": null
    },
    {
        "Haran": "Haran"
    },
    {
        ", where Terah died at the age of 205. God had told Abram to leave his country and kindred and go to a land that he would show him, and promised to make of him a great nation, bless him, make his name great, bless them that bless him, and curse them who may curse him. Abram was 75 years old when he left Haran with his wife Sarai, his nephew Lot, and the substance and souls that they had acquired, and traveled to ": null
    },
    {
        "Shechem": "Shechem"
    },
    {
        " in ": null
    },
    {
        "Canaan": "Canaan"
    },
    {
        ".            There was a severe famine in the land of Canaan, so that Abram and Lot and their households, traveled to ": null
    },
    {
        "Egypt": "Ancient Egypt"
    },
    {
        ". On the way Abram told Sarai to say that she was his sister, so that the Egyptians would not kill him. When they entered Egypt, the Pharaohs officials praised Sarais beauty to ": null
    },
    {
        "Pharaoh": "Pharaoh"
    },
    {
        ", and they took her into the palace and gave Abram goods in exchange. God afflicted Pharaoh and his household with plagues, which led Pharaoh to try to find out what was wrong. Upon discovering that Sarai was a married woman, Pharaoh demanded that Abram and Sarai leave.               When they came back to the Bethel and Hai area, Abrams and Lots sizable herds occupied the same pastures. This became a problem for the herdsmen who were assigned to each familys cattle. The conflicts between herdsmen had become so troublesome that Abram suggested that Lot choose a separate area, either on the left hand or on the right hand, that there be no conflict amongst brethren. Lot chose to go eastward to the plain of ": null
    },
    {
        "Jordan": "Jordan River"
    },
    {
        " where the land was well watered everywhere as far as Zoar, and he dwelled in the cities of the plain toward ": null
    },
    {
        "Sodom": "Sodom And Gomorrah"
    },
    {
        ". Abram went south to ": null
    },
    {
        "Hebron": "Hebron"
    },
    {
        " and settled in the plain of ": null
    },
    {
        "Mamre": "Mamre"
    },
    {
        ", where he built another altar to worship ": null
    },
    {
        "God": "God In Abrahamic Religions"
    },
    {
        ".                During the rebellion of the ": null
    },
    {
        "Jordan River cities": "Sodom And Gomorrah"
    },
    {
        " against ": null
    },
    {
        "Elam": "Elam"
    },
    {
        ", Abrams nephew, Lot, was taken prisoner along with his entire household by the invading ": null
    },
    {
        "Elam": "Elam"
    },
    {
        "ite forces. The Elamite army came to collect the spoils of war, after having just defeated the king of Sodoms armies. Lot and his family, at the time, were settled on the outskirts of the ": null
    },
    {
        "Kingdom of Sodom": "Sodom And Gomorrah"
    },
    {
        " which made them a visible target.     One person who escaped capture came and told Abram what happened. Once Abram received this news, he immediately assembled 318 trained servants. Abrams force headed north in pursuit of the Elamite army, who were already worn down from the ": null
    },
    {
        "Battle of Siddim": "Battle Of The Vale Of Siddim"
    },
    {
        ". When they caught up with them at ": null
    },
    {
        "Dan": "Dan"
    },
    {
        ", Abram devised a battle plan by splitting his group into more than one unit, and launched a night raid. Not only were they able to free the captives, Abrams unit chased and slaughtered the Elamite King ": null
    },
    {
        "Chedorlaomer": "Chedorlaomer"
    },
    {
        " at Hobah, just north of ": null
    },
    {
        "Damascus": "Damascus"
    },
    {
        ". They freed Lot, as well as his household and possessions, and recovered all of the goods from Sodom that had been taken.     Upon Abrams return, Sodoms king came out to meet with him in the ": null
    },
    {
        "Valley of Shaveh": "Kings Dale"
    },
    {
        ", the kings dale . Also, ": null
    },
    {
        "Melchizedek": "Melchizedek"
    },
    {
        " king of Salem , a priest of ": null
    },
    {
        "God Most High": "Elyon"
    },
    {
        ", brought out bread and wine and blessed Abram and God. Abram then gave Melchizedek a ": null
    },
    {
        "tenth": "Tithe"
    },
    {
        " of everything. The king of Sodom then offered to let Abram keep all the possessions if he would merely return his people. Abram refused any deal from the king of Sodom, other than the share to which his allies were entitled.                 The voice of the Lord came to Abram in a vision and repeated the promise of the land and descendants as numerous as the stars. Abram and God made a covenant ceremony, and God told of the future bondage of Israel in Egypt. God described to Abram the land that his offspring would claim: the land of the Kenites, Kenizzites, Kadmonites, Hittites, Perizzites, Rephaims, Amorites, Canaanites, Girgashites, and Jebusites.               Abram and Sarai tried to make sense of how he would become a progenitor of nations, because after 10 years of living in Canaan, no child had been born. Sarai then offered her Egyptian handmaiden, ": null
    },
    {
        "Hagar": "Hagar"
    },
    {
        ", to Abram with the intention that she would bear him a son.     After Hagar found she was pregnant, she began to despise her mistress, Sarai. Sarai responded by mistreating Hagar, and Hagar fled into the wilderness. An angel spoke with Hagar at the fountain on the way to ": null
    },
    {
        "Shur": "Shur"
    },
    {
        ". He instructed her to return to the camp of Abram, and that her son would be a wild ass of a man; his hand shall be against every man, and every mans hand against him; and he shall dwell in the face of all his brethren. She was told to call her son ": null
    },
    {
        "Ishmael": "Ishmael"
    },
    {
        ". Hagar then called God who spoke to her ": null
    },
    {
        "El-roi": "El Roi"
    },
    {
        " , . From that day onward, the well was called Beer-lahai-roi, . She then did as she was instructed by returning to her mistress in order to have her child. Abram was 86 years of age when Ishmael was born.       Thirteen years later, when Abram was 99 years of age, God declared Abrams new name: Abraham  – a father of many nations . Abraham then received the instructions for the ": null
    },
    {
        "covenant": "Covenant"
    },
    {
        ", of which ": null
    },
    {
        "circumcision": "Religious Male Circumcision"
    },
    {
        " was to be the sign.     God declared Sarais new name: ": null
    },
    {
        "Sarah": "Sarah"
    },
    {
        " , blessed her, and told Abraham, I will give thee a son also of her . Abraham laughed, and said in his heart, Shall a child be born unto him that is a hundred years old? and shall Sarah, that is ninety years old, bear?  Immediately after Abrahams encounter with God, he had his entire household of men, including himself and Ishmael , circumcised.            Not long afterward, during the heat of the day, Abraham had been sitting at the entrance of his tent by the ": null
    },
    {
        "terebinths": "Pistacia Palaestina"
    },
    {
        " of ": null
    },
    {
        "Mamre": "Mamre"
    },
    {
        ". He looked up and saw three men in the presence of God. Then he ran and ": null
    },
    {
        "bowed": "Bowing"
    },
    {
        " to the ground to welcome them. Abraham then offered to wash their feet and fetch them a morsel of bread, to which they assented. Abraham rushed to ": null
    },
    {
        "Sarahs": "Sarah"
    },
    {
        "tent to order cakes made from choice flour, then he ordered a servant-boy to prepare a choice calf. When all was prepared, he set curds, milk and the calf before them, waiting on them, under a tree, as they ate.     One of the visitors told Abraham that upon his return next year, Sarah would have a son. While at the tent entrance, Sarah overheard what was said and she laughed to herself about the prospect of having a child at their ages. The visitor inquired of Abraham why Sarah laughed at bearing a child at her age, as nothing is too hard for God. Frightened, Sarah denied laughing.               After eating, Abraham and the three visitors got up. They walked over to the peak that overlooked the cities of the plain to discuss the fate of ": null
    },
    {
        "Sodom and Gomorrah": "Sodom And Gomorrah"
    },
    {
        " for their detestable sins that were so great, it moved God to action. Because Abrahams nephew was living in Sodom, God revealed plans to confirm and judge these cities. At this point, the two other visitors left for Sodom. Then Abraham turned to God and pleaded decrementally with Him that if there were at least ten righteous men found in the city, would not God spare the city? For the sake of ten righteous people, God declared that he would not destroy the city.     When the two visitors got to Sodom to conduct their report, they planned on staying in the city square. However, Abrahams nephew, Lot, met with them and strongly insisted that these two men stay at his house for the night. A rally of men stood outside of Lots home and demanded that Lot bring out his guests so that they may know them. However, Lot objected and offered his virgin daughters who had not known man to the rally of men instead. They rejected that notion and sought to break down Lots door to get to his male guests, thus confirming the wickedness of the city and portending their imminent destruction.     Early the next morning, Abraham went to the place where he stood before God. He looked out toward Sodom and Gomorrah and saw what became of the cities of the plain, where not even ten righteous had been found, as the smoke of the land went up as the smoke of a furnace.                Abraham settled between ": null
    },
    {
        "Kadesh": "Kadesh"
    },
    {
        " and ": null
    },
    {
        "Shur": "Shur"
    },
    {
        " in the land of the ": null
    },
    {
        "Philistine": "Philistine"
    },
    {
        "s. While he was living in ": null
    },
    {
        "Gerar": "Gerar"
    },
    {
        ", Abraham openly claimed that Sarah was his sister. Upon discovering this news, King ": null
    },
    {
        "Abimelech": "Abimelech"
    },
    {
        " had her brought to him. God then came to Abimelech in a dream and declared that taking her would result in death because she was a mans wife. Abimelech had not laid hands on her, so he inquired if he would also slay a righteous nation, especially since Abraham had claimed that he and Sarah were siblings. In response, God told Abimelech that he did indeed have a blameless heart and that is why he continued to exist. However, should he not return the wife of Abraham back to him, God would surely destroy Abimelech and his entire household. Abimelech was informed that Abraham was a prophet who would pray for him.     Early next morning, Abimelech informed his servants of his dream and approached Abraham inquiring as to why he had brought such great guilt upon his kingdom. Abraham stated that he thought there was no fear of God in that place, and that they might kill him for his wife. Then Abraham defended what he had said as not being a lie at all: And yet indeed she is my sister; she is the daughter of my father, but not the daughter of my mother; and she became my wife.  Abimelech returned Sarah to Abraham, and gave him gifts of sheep, oxen, and servants; and invited him to settle wherever he pleased in Abimelechs lands. Further, Abimelech gave Abraham a thousand pieces of silver to serve as Sarahs vindication before all. Abraham then prayed for Abimelech and his household, since God had stricken the women with infertility because of the taking of Sarah.     After living for some time in the land of the Philistines, ": null
    },
    {
        "Abimelech": "Abimelech"
    },
    {
        " and ": null
    },
    {
        "Phicol": "Phicol"
    },
    {
        ", the chief of his troops, approached Abraham because of a dispute that resulted in a violent confrontation at a well. Abraham then reproached Abimelech due to his Philistine servants aggressive attacks and the seizing of ": null
    },
    {
        "Abrahams well": "Abrahams Well"
    },
    {
        ". Abimelech claimed ignorance of the incident. Then Abraham offered a pact by providing sheep and oxen to Abimelech. Further, to attest that Abraham was the one who dug the well, he also gave Abimelech seven ewes for proof. Because of this sworn oath, they called the place of this well: ": null
    },
    {
        "Beersheba": "Beersheba"
    },
    {
        ". After Abimelech and Phicol headed back to ": null
    },
    {
        "Philistia": "Philistia"
    },
    {
        ", Abraham planted a grove in Beersheba and called upon the name of the , the everlasting God.                As had been prophesied in Mamre the previous year, Sarah became pregnant and bore a son to Abraham, on the first anniversary of the covenant of circumcision. Abraham was an hundred years old , when his son whom he named Isaac was born; and he circumcised him when he was eight days old. For Sarah, the thought of giving birth and nursing a child, at such an old age, also brought her much laughter, as she declared, God hath made me to laugh, so that all who hear will laugh with me.  Isaac continued to grow and on the day he was weaned, Abraham held a great feast to honor the occasion. During the celebration, however, Sarah found Ishmael mocking; an observation that would begin to clarify the birthright of Isaac.          ": null
    },
    {
        "Ishmael": "Ishmael"
    },
    {
        " was fourteen years old when Abrahams son ": null
    },
    {
        "Isaac": "Isaac"
    },
    {
        " was born to Sarah. When she found Ishmael teasing Isaac, Sarah told Abraham to send both Ishmael and Hagar away. She declared that Ishmael would not share in Isaacs inheritance. Abraham was greatly distressed by his wifes words and sought the advice of his God. God told Abraham not to be distressed but to do as his wife commanded. God reassured Abraham that in Isaac shall seed be called to thee.  He also said that Ishmael would make a nation, because he is thy seed .     Early the next morning, Abraham brought Hagar and Ishmael out together. He gave her bread and water and sent them away. The two wandered in the wilderness of ": null
    },
    {
        "Beersheba": "Beersheba"
    },
    {
        " until her bottle of water was completely consumed. In a moment of despair, she burst into tears. After God heard the boys voice, an ": null
    },
    {
        "angel of the Lord": "Angel Of The Lord"
    },
    {
        " confirmed to Hagar that he would become a great nation, and will be living on his sword . A well of water then appeared so that it saved their lives. As the boy grew, he became a skilled ": null
    },
    {
        "archer": "Archery"
    },
    {
        " living in the wilderness of ": null
    },
    {
        "Paran": "Desert Of Paran"
    },
    {
        ". Eventually his mother found a wife for Ishmael from her home country, the land of Egypt.               At some point in ": null
    },
    {
        "Isaacs": "Isaac"
    },
    {
        "youth, Abraham was commanded by God to offer his son up as a sacrifice in the land of ": null
    },
    {
        "Moriah": "Moriah"
    },
    {
        ". The patriarch traveled three days until he came to the mount that God told him of. He then commanded the servants to remain while he and Isaac proceeded alone into the mount. Isaac carried the wood upon which he would be sacrificed. Along the way, Isaac asked his father where the animal for the burnt offering was, to which Abraham replied God will provide himself a lamb for a burnt offering . Just as Abraham was about to sacrifice his son, he was interrupted by the angel of the Lord, and he saw behind him a ram caught in a thicket by his horns , which he sacrificed instead of his son. For his obedience he received another promise of numerous descendants and abundant prosperity. After this event, Abraham went to ": null
    },
    {
        "Beersheba": "Beersheba"
    },
    {
        ".          Sarah died, and Abraham buried her in the ": null
    },
    {
        "Cave of the Patriarchs": "Cave Of The Patriarchs"
    },
    {
        " , near ": null
    },
    {
        "Hebron": "Hebron"
    },
    {
        " which he had purchased along with the adjoining field from Ephron the ": null
    },
    {
        "Hittite": "Biblical Hittites"
    },
    {
        ". After the death of Sarah, Abraham took another wife, a ": null
    },
    {
        "concubine": "Concubine"
    },
    {
        " named ": null
    },
    {
        "Keturah": "Keturah"
    },
    {
        ", by whom he had six sons: ": null
    },
    {
        "Zimran": "Zimran"
    },
    {
        ", ": null
    },
    {
        "Jokshan": "Jokshan"
    },
    {
        ", ": null
    },
    {
        "Medan": "Medan"
    },
    {
        ", ": null
    },
    {
        "Midian": "Midian"
    },
    {
        ", ": null
    },
    {
        "Ishbak": "Ishbak"
    },
    {
        ", and ": null
    },
    {
        "Shuah": "Shuah"
    },
    {
        ". According to the Bible, reflecting the change of his name to Abraham meaning a father of many nations , Abraham is considered to be the progenitor of many nations mentioned in the Bible, among others the ": null
    },
    {
        "Israelites": "Israelites"
    },
    {
        ", ": null
    },
    {
        "Ishmaelites": "Ishmaelites"
    },
    {
        ", ": null
    },
    {
        "Edom": "Edom"
    },
    {
        "ites,and to see the birth of his twin grandsons ": null
    },
    {
        "Jacob and Esau": "Jacob And Esau"
    },
    {
        "19741975 Abraham and the Angels, by ": null
    },
    {
        "Aert de Gelder": "Aert De Gelder"
    },
    {
        ",   sfn|Ginzberg|1909sfn|Ginzberg|1909|locVol. I: The Covenant with Abimelechsfn|Ginzberg|1909|locVol. I: Joy and Sorrow in the House of Jacobsfn|Ginzberg|1909|locVol. I: The Birth of Esau and Jacobsfn|Peters|2010|p171cite web|lastCaxton|firstWilliam|titleAbraham|urlhttp://www.fordham.edu/halsall/basis/goldenlegend/GoldenLegend-Volume1.aspAbraham|websiteThe Golden Legend|publisherInternet Medieval Source Book|accessdate3 April 2014sfn|Holweck|1924|ppage needed|dateMay 2017main|Abraham in Islamsfn|Levenson|2012|p fn|Peters|2003|phttps://books.google.com/books?idHYJ2c9E9IM8C & pgPA9vonepage & qthirty-five%20chapters PA9sfn|Levenson|2012|p fn|Lings|2004|psfn|Maulana|2006|p104sfn|Exum|2007|p135sfn|Exum|2007|p135sfn|Rutgers|1993|psndcite web |urlhttp://www.christianiconography.info/abraham.html |titleAbraham the Patriarch in Art – Iconography and Literature | publisherChristian Iconography – a project of Georgia Regents University . |accessdate2014-04-18cite web|lastBoguslawski|firstAlexander|titleThe Holy Trinity|urlhttp://myweb.rollins.edu/aboguslawski/Ruspaint/trinity.html|publisherRollins.edu|accessdate3 April 2014sfn|Kierkegaard|1980|pp155–156": null
    }
]