[
    {
        "The absolutive case  is the ": null
    },
    {
        "grammatical case": "grammatical case"
    },
    {
        " of a ": null
    },
    {
        "core argument": "core argument"
    },
    {
        " of a verb  that is used as the ": null
    },
    {
        "citation form": "citation form"
    },
    {
        " of a noun.       In ": null
    },
    {
        "ergative–absolutive language": "ergative–absolutive language"
    },
    {
        "s, the absolutive is the case used to mark both the subject of an ": null
    },
    {
        "intransitive verb": "intransitive verb"
    },
    {
        " and the object of a ": null
    },
    {
        "transitive verb": "transitive verb"
    },
    {
        " in addition to being used for the citation form of a noun. It contrasts with the marked ": null
    },
    {
        "ergative case": "ergative case"
    },
    {
        ", which marks the subject of a transitive verb.     For example, in ": null
    },
    {
        "Basque": "basque language"
    },
    {
        " the noun mutil takes the bare singular ": null
    },
    {
        "article": "article"
    },
    {
        " -a both as the subject of the intransitive clause mutila etorri da and as the object of the transitive clause Irakasleak mutila ikusi du in which the subject bears the ergative ending -a-k.     In a very few cases, a marked absolutive has been reported, including in ": null
    },
    {
        "Nias": "nias language"
    },
    {
        " and ": null
    },
    {
        "Sochiapam Chinantec": "sochiapam chinantec"
    },
    {
        ".       In ": null
    },
    {
        "nominative–absolutive language": "nominative–absolutive language"
    },
    {
        "s, also called marked-nominative languages, the nominative has a case inflection, and it is the accusative and citation form that are unmarked. The unmarked accusative/citation form may be called absolutive to clarify that the citation form is used for the accusative case role rather than for the nominative, as it is in most nominative–accusative languages.       In ": null
    },
    {
        "tripartite language": "tripartite language"
    },
    {
        "s, both the agent and object of a transitive clause have case forms, ergative and accusative, and the agent of an intransitive clause is the unmarked citation form. It is occasionally called the ": null
    },
    {
        "intransitive case": "intransitive case"
    },
    {
        ", but absolutive is also used and is perhaps more accurate since it is not limited to core agents of intransitive verbs.       In ": null
    },
    {
        "nominative–accusative language": "nominative–accusative language"
    }
]