[
    {
        "                        An abugida  , or alphasyllabary, is a segmental ": null
    },
    {
        "writing system": "Writing Systemssegmental Writing System"
    },
    {
        " in which consonant–vowel sequences are written as a unit: each unit is based on a ": null
    },
    {
        "consonant": "Consonant"
    },
    {
        " letter, and ": null
    },
    {
        "vowel": "Vowel"
    },
    {
        " notation is secondary. This contrasts with a full ": null
    },
    {
        "alphabet": "Alphabet"
    },
    {
        ", in which vowels have status equal to consonants, and with an ": null
    },
    {
        "abjad": "Abjad"
    },
    {
        ", in which vowel marking is absent, ": null
    },
    {
        "partial": "Abjadimpure Abjads"
    },
    {
        ", or optional . The terms also contrast them with a ": null
    },
    {
        "syllabary": "Syllabary"
    },
    {
        ", in which the symbols cannot be split into separate consonants and vowels. Abugidas include the extensive ": null
    },
    {
        "Brahmic family of scripts": "Brahmic Family Of Scripts"
    },
    {
        " of Tibet, South and Southeast Asia, ": null
    },
    {
        "Semitic": "Semitic Languages"
    },
    {
        " Ethiopic script": "Ethiopic Script"
    },
    {
        "s, and ": null
    },
    {
        "Canadian Aboriginal syllabics": "Canadian Aboriginal Syllabics"
    },
    {
        " .     As is the case for syllabaries, the units of the writing system may consist of the representations both of syllables and of consonants. For scripts of the Brahmic family, the term  akshara  is used for the units.     Abugida as a term in linguistics was proposed by ": null
    },
    {
        "Peter T. Daniels": "Peter T. Daniels"
    },
    {
        " in his 1990 ": null
    },
    {
        "typology": "Linguistic Typology"
    },
    {
        " of ": null
    },
    {
        "writing system": "Writing System"
    },
    {
        "s.  ’Äbugida is an Ethiopian name for the ": null
    },
    {
        "Ge‘ez script": "Geez Alphabet"
    },
    {
        ", taken from four letters of that script, ä bu gi da, in much the same way that  abecedary  is derived from Latin a be ce de,  abjad  is derived from the ": null
    },
    {
        "Arabic": "Arabic"
    },
    {
        " a b j d, and  alphabet  is derived from the names of the two first letters in the ": null
    },
    {
        "Greek alphabet": "Greek Alphabet"
    },
    {
        ", alpha and beta. As Daniels used the word, an abugida is in contrast with a ": null
    },
    {
        "syllabary": "Syllabary"
    },
    {
        ", where letters with shared consonants or vowels show no particular resemblance to one another, and also with an ": null
    },
    {
        "alphabet": "Alphabet"
    },
    {
        " proper, where independent letters are used to denote both consonants and vowels. The term alphasyllabary was suggested for the Indic scripts in 1997 by ": null
    },
    {
        "William Bright": "William Bright"
    },
    {
        ", following South Asian linguistic usage, to convey the idea that they share features of both alphabet and syllabary. He describes this term as formal , i.e., more concerned with graphic arrangement of symbols, whereas abugida was functional , putting the focus on sound–symbol correspondence. However, this is not a distinction made in the literature.     Abugidas were long considered to be syllabaries, or intermediate between syllabaries and alphabets, and the term syllabics is retained in the name of ": null
    },
    {
        "Canadian Aboriginal Syllabics": "Canadian Aboriginal Syllabics"
    },
    {
        ". Other terms that have been used include neosyllabary , pseudo-alphabet , semisyllabary  and syllabic alphabet .       The formal definitions given by Daniels and Bright for abugida and alphasyllabary differ; some writing systems are abugidas but not alphasyllabaries, and some are alphasyllabaries but not abugidas. An abugida is defined as a type of writing system whose basic characters denote consonants followed by a particular vowel, and in which diacritics denote other vowels .  An alphasyllabary is defined as a type of writing system in which the vowels are denoted by subsidiary symbols not all of which occur in a linear order that is congruent with their temporal order in speech . Bright did not require that an alphabet explicitly represent all vowels. ": null
    },
    {
        "ʼPhags-pa": "ʼPhags-Pa Script"
    },
    {
        " is an example of an abugida that is not an alphasyllabary, and modern ": null
    },
    {
        "Lao": "Lao Alphabet"
    },
    {
        " is an example of an alphasyllabary that is not an abugida, for its vowels are always explicit.     This description is expressed in terms of an abugida. Formally, an alphasyllabary that is not an abugida can be converted to an abugida by adding a purely formal vowel sound that is never used and declaring that to be the inherent vowel of the letters representing consonants. This may formally make the system ambiguous, but in practice this is not a problem, for then the interpretation with the never used inherent vowel sound will always be a wrong interpretation. Note that the actual pronunciation may be complicated by interactions between the sounds apparently written just as the sounds of the letters in the English words wan, gem and war are affected by neighbouring letters.     The fundamental principles of an abugida apply to words made up of consonant-vowel syllables. The syllables are written as a linear sequences of the units of the script. Each syllable is either a letter that represents the sound of a consonant and the inherent vowel, or a letter with a modification to indicate the vowel, either by means of ": null
    },
    {
        "diacritic": "Diacritic"
    },
    {
        "s, or by changes in the form of the letter itself. If all modifications are by diacritics and all diacritics follow the direction of the writing of the letters, then the abugida is not an alphasyllabary.     However, most languages have words that are more complicated than a sequence of CV syllables, even ignoring tone.     The first complication is syllables that consist of just a vowel . This issue does not arise in some languages because every syllable starts with a consonant. This is common in Semitic languages and in languages of mainland SE Asia, and for such languages this issue need not arise. For some languages, a ": null
    },
    {
        "zero consonant": "Zero Consonant"
    },
    {
        " letter is used as though every syllable began with a consonant. For other languages, each vowel has a separate letter that is used for each syllable consisting of just the vowel. These letters are known as independent vowels, and are found in most Indic scripts. These letters may be quite different from the corresponding diacritics, which by contrast are known as dependent vowels. As a result of the spread of writing systems, independent vowels may be used to represent syllables beginning with a ": null
    },
    {
        "glottal stop": "Glottal Stop"
    },
    {
        ", even for non-initial syllables.     The next two complications are sequences of consonants before a vowel and syllables ending in a consonant . The simplest solution, which is not always available, is to break with the principle of writing words as a sequence of syllables and use a unit representing just a consonant . This unit may be represented with:   a modification that explicitly indicates the lack of a vowel ,   a lack of vowel marking ,   vowel marking for a short or neutral vowel such as  schwa  , or   a visually unrelated letter.     In a true abugida, the lack of distinctive marking may result from the diachronic loss of the inherent vowel, e.g. by ": null
    },
    {
        "syncope": "Syncope"
    },
    {
        " and ": null
    },
    {
        "apocope": "Apocope"
    },
    {
        " in Hindi": "Schwa Deletion In Indo-Aryan Languages"
    },
    {
        ".     When not handled by decomposition into C + CV, CCV syllables are handled by combining the two consonants. In the Indic scripts, the earliest method was simply to arrange them vertically, but the two consonants may merge as a ": null
    },
    {
        "conjunct consonant": "Typographic Ligature"
    },
    {
        " letters, where two or more letters are graphically joined in a ": null
    },
    {
        "ligature": "Typographic Ligature"
    },
    {
        ", or otherwise change their shapes. Rarely, one of the consonants may be replaced by a gemination mark, e.g. the ": null
    },
    {
        "Gurmukhi": "Gurmukhi"
    },
    {
        "  addak . When they are arranged vertically, as in ": null
    },
    {
        "Burmese": "Burmese Alphabet"
    },
    {
        " or ": null
    },
    {
        "Khmer": "Khmer Alphabet"
    },
    {
        ", they are said to be stacked. Often there has been a change to writing the two consonants side by side. In the latter case, the fact of combination may be indicated by a diacritic on one of the consonants or a change in the form of one of the consonants, e.g. the ": null
    },
    {
        "half forms": "Devanagariconjuncts"
    },
    {
        " of Devanagari. Generally, the reading order is top to bottom or the general reading order of the script, but sometimes the order is reversed.     The division of a word into syllables for the purposes of writing does not always accord with the natural phonetics of the language. For example, Brahmic scripts commonly handle a phonetic sequence CVC-CV as CV-CCV or CV-C-CV. However, sometimes phonetic CVC syllables are handled as single units, and the final consonant may be represented:     in much the same way as the second consonant in CCV, e.g. in the ": null
    },
    {
        "Tibetan": "Tibetan Alphabet"
    },
    {
        ", ": null
    },
    {
        "Khmer": "Khmer Alphabet"
    },
    {
        " and ": null
    },
    {
        "Tai Tham": "Tai Tham Alphabet"
    },
    {
        " scripts. The positioning of the components may be slightly different, as in Khmer and Tai Tham.   by a special dependent consonant sign, which may be a smaller or differently placed version of the full consonant letter, or may be a distinct sign altogether.   not at all. For example, repeated consonants need not be represented, homorganic nasals may be ignored, and in ": null
    },
    {
        "Philippine scripts": "Philippine Scripts"
    },
    {
        ", the syllable-final consonant was traditionally never represented.     More complicated unit structures are handled by combining the various techniques above.       There are three principal families of abugidas, depending on whether vowels are indicated by modifying consonants by diacritics, distortion, or orientation. John D. Berry Language Culture Type   The oldest and largest is the ": null
    },
    {
        "Brahmic": "Brahmic Scripts"
    },
    {
        " family of India and Southeast Asia, in which vowels are marked with ": null
    },
    {
        "diacritics": "Diacritic"
    },
    {
        "and syllable-final consonants, when they occur, are indicated with ": null
    },
    {
        "ligatures": "Typographic Ligature"
    },
    {
        ", diacritics, or with a special ": null
    },
    {
        "vowel-canceling mark": "Virama"
    },
    {
        ".   In the ": null
    },
    {
        "Ethiopic family": "Geez Alphabet"
    },
    {
        ", vowels are marked by modifying the shapes of the consonants, and one of the vowel-forms serves additionally to indicate final consonants.   In the ": null
    },
    {
        "Cree family": "Canadian Aboriginal Syllabics"
    },
    {
        ", vowels are marked by rotating or flipping the consonants, and final consonants are indicated with either special diacritics or superscript forms of the main initial consonants.     ": null
    },
    {
        "Tāna": "Tāna"
    },
    {
        " of the ": null
    },
    {
        "Maldives": "Maldives"
    },
    {
        " has dependent vowels and a zero vowel sign, but no inherent vowel.                 Indic scripts originated in ": null
    },
    {
        "India": "India"
    },
    {
        " and spread to ": null
    },
    {
        "Southeast Asia": "Southeast Asia"
    },
    {
        ". All surviving Indic scripts are descendants of the ": null
    },
    {
        "Brahmi alphabet": "Brahmi Alphabet"
    },
    {
        ". Today they are used in most languages of ": null
    },
    {
        "South Asia": "South Asia"
    },
    {
        " , mainland ": null
    },
    {
        "Southeast Asia": "Southeast Asia"
    },
    {
        " , and ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        "n archipelago . The primary division is into North Indic scripts used in Northern India, Nepal, Tibet and Bhutan, and Southern Indic scripts used in ": null
    },
    {
        "South India": "South India"
    },
    {
        ", ": null
    },
    {
        "Sri Lanka": "Sri Lanka"
    },
    {
        " and ": null
    },
    {
        "Southeast Asia": "Southeast Asia"
    },
    {
        ".   South Indic letter forms are very rounded; North Indic less so, though ": null
    },
    {
        "Odia": "Odia Script"
    },
    {
        ", ": null
    },
    {
        "Golmol": "Golmol Script"
    },
    {
        " and ": null
    },
    {
        "Litumol": "Litumol"
    },
    {
        " of Nepal script are rounded.   Most North Indic scripts full letters incorporate a horizontal line at the top, with ": null
    },
    {
        "Gujarati": "Gujarati Script"
    },
    {
        " and ": null
    },
    {
        "Odia": "Odia Script"
    },
    {
        " as exceptions; South Indic scripts do not.     Indic scripts indicate vowels through dependent vowel signs around the consonants, often including a sign that explicitly indicates the lack of a vowel. If a consonant has no vowel sign, this indicates a default vowel. Vowel diacritics may appear above, below, to the left, to the right, or around the consonant.     The most widely used Indic script is ": null
    },
    {
        "Devanagari": "Devanagari"
    },
    {
        ", shared by ": null
    },
    {
        "Hindi": "Hindi"
    },
    {
        ", ": null
    },
    {
        "Bhojpuri": "Bhojpuri"
    },
    {
        ", ": null
    },
    {
        "Marathi": "Marathi Language"
    },
    {
        ", ": null
    },
    {
        "Konkani": "Konkani Language"
    },
    {
        ", ": null
    },
    {
        "Nepali": "Nepali Language"
    },
    {
        ", and often ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        ". A basic letter such as ": null
    },
    {
        "क": "Devanagari Ka"
    },
    {
        " in Hindi represents a syllable with the default vowel, in this case ka . In some languages, including Hindi, it becomes a final closing consonant at the end of a word, in this case k. The inherent vowel may be changed by adding vowel mark , producing syllables such as कि ki, कु ku, के ke, को ko.             In many of the Brahmic scripts, a syllable beginning with a cluster is treated as a single character for purposes of vowel marking, so a vowel marker like ि -i, falling before the character it modifies, may appear several positions before the place where it is pronounced. For example, the game ": null
    },
    {
        "cricket": "Cricket"
    },
    {
        " in ": null
    },
    {
        "Hindi": "Hindi"
    },
    {
        " is क्रिकेट cricket; the diacritic for  appears before the ": null
    },
    {
        "consonant cluster": "Consonant Cluster"
    },
    {
        " , not before the . A more unusual example is seen in the ": null
    },
    {
        "Batak alphabet": "Batak Alphabet"
    },
    {
        ": Here the syllable bim is written ba-ma-i-. That is, the vowel diacritic and virama are both written after the consonants for the whole syllable.     In many abugidas, there is also a diacritic to suppress the inherent vowel, yielding the bare consonant. In ": null
    },
    {
        "Devanagari": "Devanagari"
    },
    {
        ", क् is k, and ल् is l. This is called the  virāma  or halantam in ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        ". It may be used to form ": null
    },
    {
        "consonant cluster": "Consonant Cluster"
    },
    {
        "s, or to indicate that a consonant occurs at the end of a word. Thus in Sanskrit, a default vowel consonant such as क does not take on a final consonant sound. Instead, it keeps its vowel. For writing two consonants without a vowel in between, instead of using diacritics on the first consonant to remove its vowel, another popular method of special ": null
    },
    {
        "conjunct": "Conjunct"
    },
    {
        " forms is used in which two or more consonant characters are merged to express a cluster, such as Devanagari: क्ल kla.  Thus a closed syllable such as kal requires two aksharas to write.     The ": null
    },
    {
        "Róng": "Róng"
    },
    {
        " script used for the ": null
    },
    {
        "Lepcha language": "Lepcha Language"
    },
    {
        " goes further than other Indic abugidas, in that a single akshara can represent a closed syllable: Not only the vowel, but any final consonant is indicated by a diacritic. For example, the syllable would be written as something like s̥̽, here with an underring representing  and an overcross representing the diacritic for final . Most other Indic abugidas can only indicate a very limited set of final consonants with diacritics, such as  or , if they can indicate any at all.          In ": null
    },
    {
        "Ethiopic": "Ethiopic Script"
    },
    {
        "  the diacritics have been fused to the consonants to the point that they must be considered modifications of the form of the letters. Children learn each modification separately, as in a syllabary; nonetheless, the graphic similarities between syllables with the same consonant is readily apparent, unlike the case in a true syllabary.     Though now an abugida, the ": null
    },
    {
        "Geez script": "Geez Script"
    },
    {
        ", until the advent of Christianity , had originally been what would now be termed an  abjad . In the Geez abugida , the base form of the letter  may be altered. For example, ሀ hä  , ሁ hu , ሂ hi , ህ hə  or  .            In the family known as ": null
    },
    {
        "Canadian Aboriginal syllabics": "Canadian Aboriginal Syllabics"
    },
    {
        ", which was inspired by the ": null
    },
    {
        "Devanagari script": "Devanagari Script"
    },
    {
        " of India, vowels are indicated by changing the orientation of the ": null
    },
    {
        "syllabogram": "Syllabogram"
    },
    {
        ". Each vowel has a consistent orientation; for example, ": null
    },
    {
        "Inuktitut": "Inuktitut"
    },
    {
        " ᐱ pi, ᐳ pu, ᐸ pa; ᑎ ti, ᑐ tu, ᑕ ta. Although there is a vowel inherent in each, all rotations have equal status and none can be identified as basic. Bare consonants are indicated either by separate diacritics, or by superscript versions of the aksharas; there is no vowel-killer mark.           Consonantal scripts  are normally written without indication of many vowels. However, in some contexts like teaching materials or ": null
    },
    {
        "scripture": "Scripture"
    },
    {
        "s, ": null
    },
    {
        "Arabic": "Arabic"
    },
    {
        " and ": null
    },
    {
        "Hebrew": "Hebrew"
    },
    {
        " are written with full indication of vowels via diacritic marks  making them effectively alphasyllabaries. The Brahmic and Ethiopic families are thought to have originated from the Semitic abjads by the addition of vowel marks.        The Arabic scripts used for ": null
    },
    {
        "Kurdish": "Sorani Kurdish"
    },
    {
        " in Iraq and for ": null
    },
    {
        "Uyghur": "Uyghur Language"
    },
    {
        " in ": null
    },
    {
        "Xinjiang": "Xinjiang"
    },
    {
        ", ": null
    },
    {
        "China": "China"
    },
    {
        ", as well as the Hebrew script of ": null
    },
    {
        "Yiddish": "Yiddish Language"
    },
    {
        ", are fully vowelled, but because the vowels are written with full letters rather than diacritics and there are no inherent vowels, these are considered alphabets, not abugidas.       The imperial Mongol script called ": null
    },
    {
        "Phagspa": "Phags-Pa Script"
    },
    {
        " was derived from the Tibetan abugida, but all vowels are written in-line rather than as diacritics. However, it retains the features of having an inherent vowel /a/ and having distinct initial vowel letters.       ": null
    },
    {
        "Pahawh Hmong": "Pahawh Hmong"
    },
    {
        " is a non-segmental script that indicates ": null
    },
    {
        "syllable onsets": "Syllable Onset"
    },
    {
        "and ": null
    },
    {
        "rime": "Syllable Rime"
    },
    {
        "s, such as consonant clusters and vowels with final consonants. Thus it is not segmental and cannot be considered an abugida. However, it superficially resembles an abugida with the roles of consonant and vowel reversed. Most syllables are written with two letters in the order rime–onset , even though they are pronounced as onset-rime , rather like the position of the  vowel in Devanagari, which is written before the consonant. Pahawh is also unusual in that, while an inherent rime  is unwritten, it also has an inherent onset . For the syllable , which requires one or the other of the inherent sounds to be overt, it is  that is written. Thus it is the rime that is basic to the system.       It is difficult to draw a dividing line between abugidas and other ": null
    },
    {
        "segmental": "Segment"
    },
    {
        " scripts. For example, the ": null
    },
    {
        "Meroitic script": "Meroitic Script"
    },
    {
        " of ancient ": null
    },
    {
        "Sudan": "Sudan"
    },
    {
        " did not indicate an inherent a , and is thus similar to Brahmic family of abugidas. However, the other vowels were indicated with full letters, not diacritics or modification, so the system was essentially an alphabet that did not bother to write the most common vowel.       Several systems of ": null
    },
    {
        "shorthand": "Shorthand"
    },
    {
        " use diacritics for vowels, but they do not have an inherent vowel, and are thus more similar to ": null
    },
    {
        "Thaana": "Thaana"
    },
    {
        " and ": null
    },
    {
        "Kurdish script": "Kurdish Alphabet"
    },
    {
        " than to the Brahmic scripts. The ": null
    },
    {
        "Gabelsberger shorthand": "Gabelsberger Shorthand"
    },
    {
        " system and its derivatives modify the following consonant to represent vowels. The ": null
    },
    {
        "Pollard script": "Pollard Script"
    },
    {
        ", which was based on shorthand, also uses diacritics for vowels; the placements of the vowel relative to the consonant indicates ": null
    },
    {
        "tone": "Tone"
    },
    {
        ". ": null
    },
    {
        "Pitman shorthand": "Pitman Shorthand"
    },
    {
        " uses straight strokes and quarter-circle marks in different orientations as the principal alphabet of consonants; vowels are shown as light and heavy dots, dashes and other marks in one of 3 possible positions to indicate the various vowel-sounds. However, to increase writing speed, Pitman has rules for vowel indication  using the positioning or choice of consonant signs so that writing vowel-marks can be dispensed with.       As the term alphasyllabary suggests, abugidas have been considered an intermediate step between ": null
    },
    {
        "alphabets": "Alphabet"
    },
    {
        "and ": null
    },
    {
        "syllabaries": "Syllabary"
    },
    {
        ". Historically, abugidas appear to have evolved from ": null
    },
    {
        "abjads": "Abjad"
    },
    {
        ". They contrast with syllabaries, where there is a distinct symbol for each syllable or consonant-vowel combination, and where these have no systematic similarity to each other, and typically develop directly from ": null
    },
    {
        "logographic scripts": "Logogram"
    },
    {
        ". Compare the examples above to sets of syllables in the Japanese ": null
    },
    {
        "hiragana": "Hiragana"
    },
    {
        " syllabary: か ka, き ki, く ku, け ke, こ ko have nothing in common to indicate k; while ら ra, り ri, る ru, れ re, ろ ro have neither anything in common for r, nor anything to indicate that they have the same vowels as the k set.     Most Indian and Indochinese abugidas appear to have first been developed from abjads with the ": null
    },
    {
        "Kharoṣṭhī": "Kharoṣṭhī"
    },
    {
        " and ": null
    },
    {
        "Brāhmī script": "Brāhmī Script"
    },
    {
        "s; the abjad in question is usually considered to be the ": null
    },
    {
        "Aramaic": "Aramaic Alphabet"
    },
    {
        " one, but while the link between Aramaic and Kharosthi is more or less undisputed, this is not the case with Brahmi. The Kharosthi family does not survive today, but Brahmis descendants include most of the modern scripts of ": null
    },
    {
        "South": "South Asia"
    },
    {
        " and ": null
    },
    {
        "Southeast Asia": "Southeast Asia"
    },
    {
        ". Geez derived from a different abjad, the ": null
    },
    {
        "Sabean script": "Sabaean Languagescript"
    },
    {
        " of ": null
    },
    {
        "Yemen": "Yemen"
    },
    {
        "; the advent of vowels coincided with the introduction of Christianity about AD 350.     The Ethiopic script is the elaboration of an abjad.     The ": null
    },
    {
        "Cree syllabary": "Canadian Aboriginal Syllabicshistory"
    },
    {
        " was invented with full knowledge of the Devanagari system.     The ": null
    },
    {
        "Meroitic script": "Meroitic Script"
    },
    {
        " was developed from ": null
    },
    {
        "Egyptian hieroglyphs": "Egyptian Hieroglyphs"
    },
    {
        ", within which various schemes of group writing had been used for showing vowels.       ": null
    },
    {
        "Featural alphabet": "Featural Alphabet"
    },
    {
        " Abjad": "Abjad"
    },
    {
        " Alphabet": "Alphabet"
    },
    {
        " Logogram": "Logogram"
    },
    {
        " Syllabary": "Syllabary"
    },
    {
        "        Brahmic family": "Brahmic Family"
    },
    {
        ", descended from ": null
    },
    {
        "Brāhmī": "Brāhmī Script"
    },
    {
        "   Ahom": "Ahom Alphabet"
    },
    {
        " Assamese": "Assamese Alphabet"
    },
    {
        " Brahmi": "Brāhmī Script"
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        ", ": null
    },
    {
        "Prakrit": "Prakrit"
    },
    {
        " Balinese": "Balinese Alphabet"
    },
    {
        " Batak": "Batak Script"
    },
    {
        "Toba": "Toba Batak Language"
    },
    {
        " and other ": null
    },
    {
        "Batak": "Batak"
    },
    {
        " languages   ": null
    },
    {
        "Baybayin": "Baybayin"
    },
    {
        "Ilocano": "Ilocano Language"
    },
    {
        ", ": null
    },
    {
        "Kapampangan": "Kapampangan Language"
    },
    {
        ", ": null
    },
    {
        "Pangasinan": "Pangasinan Language"
    },
    {
        ", ": null
    },
    {
        "Tagalog": "Tagalog Language"
    },
    {
        ", ": null
    },
    {
        "Bikol languages": "Bikol Languages"
    },
    {
        ", ": null
    },
    {
        "Visayan languages": "Visayan Languages"
    },
    {
        ", and possibly other ": null
    },
    {
        "Philippine languages": "Philippine Languages"
    },
    {
        " Bengali script": "Bengali Alphabet"
    },
    {
        "  Bengali": "Bengali Language"
    },
    {
        ", ": null
    },
    {
        "Assamese": "Assamese Language"
    },
    {
        ", ": null
    },
    {
        "Meithei": "Meithei Language"
    },
    {
        ", ": null
    },
    {
        "Bishnupriya Manipuri": "Bishnupriya Manipuri Language"
    },
    {
        ", ": null
    },
    {
        "Kokborok": "Kokborok"
    },
    {
        ", ": null
    },
    {
        "Khasi language": "Khasi Language"
    },
    {
        ", ": null
    },
    {
        "Bodo language": "Bodo Language"
    },
    {
        " Bhaiksuki": "Bhaiksuki Alphabet"
    },
    {
        " Buhid": "Buhid Alphabet"
    },
    {
        " Burmese": "Burmese Alphabet"
    },
    {
        "Burmese": "Burmese Language"
    },
    {
        ", ": null
    },
    {
        "Karen languages": "Karen Languages"
    },
    {
        ", ": null
    },
    {
        "Mon": "Mon Language"
    },
    {
        ", and ": null
    },
    {
        "Shan": "Shan Language"
    },
    {
        " Cham": "Cham Alphabet"
    },
    {
        " Chakma": "Chakma Alphabet"
    },
    {
        " Dehong": "Tai Nüa Language"
    },
    {
        "Dehong Dai   ": null
    },
    {
        "Devanagari": "Devanagari"
    },
    {
        "Hindi": "Hindi"
    },
    {
        ", ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        ", ": null
    },
    {
        "Marathi": "Marathi Language"
    },
    {
        ", ": null
    },
    {
        "Nepali": "Nepali Language"
    },
    {
        ", and many other languages of northern India   ": null
    },
    {
        "Dhives Akuru": "Maldivian Writing Systems"
    },
    {
        " Grantha": "Grantha Alphabet"
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " Gujarati": "Gujarati Script"
    },
    {
        "Gujarāti": "Gujarati Language"
    },
    {
        ", ": null
    },
    {
        "Kachchi": "Kachchi Language"
    },
    {
        " Gurmukhi script": "Gurmukhi Script"
    },
    {
        "Punjabi": "Punjabi Language"
    },
    {
        " Hanunó’o": "Hanunóo Alphabet"
    },
    {
        " Javanese": "Javanese Alphabet"
    },
    {
        " Kaithi": "Kaithi"
    },
    {
        " Kannada": "Kannada Script"
    },
    {
        "Kannada": "Kannada Language"
    },
    {
        ", ": null
    },
    {
        "Tulu": "Tulu Language"
    },
    {
        ", ": null
    },
    {
        "Konkani": "Konkani Language"
    },
    {
        ", ": null
    },
    {
        "Kodava": "Kodava Language"
    },
    {
        " Kawi": "Kawi Script"
    },
    {
        " Khojki": "Khojki"
    },
    {
        " Khotanese": "Saka Language"
    },
    {
        " Khudawadi": "Khudabadi Script"
    },
    {
        " Khmer": "Khmer Alphabet"
    },
    {
        " Kolezhuthu": "Kolezhuthu"
    },
    {
        "Tamil": "Tamil Language"
    },
    {
        ", ": null
    },
    {
        "Malayalam": "Malayalam"
    },
    {
        " Lao": "Lao Alphabet"
    },
    {
        " Lepcha": "Lepcha Alphabet"
    },
    {
        " Leke": "Leke Script"
    },
    {
        " Limbu": "Limbu Alphabet"
    },
    {
        " Lontara’": "Lontara Alphabet"
    },
    {
        "Buginese": "Buginese Language"
    },
    {
        ", ": null
    },
    {
        "Makassar": "Makassar Language"
    },
    {
        ", and ": null
    },
    {
        "Mandar": "Mandar Language"
    },
    {
        " Mahajani": "Mahajani"
    },
    {
        " Malayalam": "Malayalam Script"
    },
    {
        "Malayalam": "Malayalam"
    },
    {
        " Malayanma": "Malayanma"
    },
    {
        "Malayalam": "Malayalam"
    },
    {
        " Marchen": "Zhang-Zhung Language"
    },
    {
        "Zhang-Zhung": "Zhang-Zhung Language"
    },
    {
        " Meetei Mayek": "Meithei Script"
    },
    {
        " Meroitic": "Meroitic Alphabet"
    },
    {
        " Modi": "Modi Alphabet"
    },
    {
        "Marathi": "Marathi Language"
    },
    {
        " Multani": "Multani Alphabet"
    },
    {
        "Saraiki": "Saraiki Language"
    },
    {
        " Nandinagari": "Nandinagari"
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " Newar": "Nepal Script"
    },
    {
        "Nepal Bhasa": "Nepal Bhasa"
    },
    {
        ", ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " New Tai Lue": "New Tai Lue Alphabet"
    },
    {
        " Odia": "Odia Script"
    },
    {
        " Pallava script": "Pallava Script"
    },
    {
        "Tamil": "Tamil Language"
    },
    {
        ", ": null
    },
    {
        "Prakrit": "Prakrit"
    },
    {
        ", ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " Phags-pa": "Phagspa Script"
    },
    {
        "Mongolian": "Mongolian Language"
    },
    {
        ", ": null
    },
    {
        "Chinese": "Chinese Language"
    },
    {
        ", and other languages of the ": null
    },
    {
        "Yuan dynasty": "Yuan Dynasty"
    },
    {
        " Mongol Empire": "Mongol Empire"
    },
    {
        " Ranjana": "Ranjana Script"
    },
    {
        "Nepal Bhasa": "Nepal Bhasa"
    },
    {
        ", ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " Rejang": "Rejang Alphabet"
    },
    {
        " Sharada": "Śāradā Script"
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " Siddham": "Siddham Script"
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " Sinhala": "Sinhala Script"
    },
    {
        " Sourashtra": "Saurashtra Alphabet"
    },
    {
        " Soyombo": "Soyombo Script"
    },
    {
        " Sundanese": "Sundanese Script"
    },
    {
        " Syloti Nagri": "Syloti Nagri"
    },
    {
        "Sylheti": "Sylheti Language"
    },
    {
        " Tagbanwa": "Tagbanwa Script"
    },
    {
        "Palawan languages": "Palawan Languages"
    },
    {
        " Tai Le": "Tai Le Alphabet"
    },
    {
        " Tai Dam": "Tai Dam Language"
    },
    {
        " Tai Tham": "Tai Tham Script"
    },
    {
        "Khün": "Khün Language"
    },
    {
        ", and ": null
    },
    {
        "Northern Thai": "Northern Thai Language"
    },
    {
        " Takri": "Takri Alphabet"
    },
    {
        " Tamil": "Tamil Script"
    },
    {
        " Telugu": "Telugu Script"
    },
    {
        " Thai": "Thai Alphabet"
    },
    {
        " Tibetan": "Tibetan Alphabet"
    },
    {
        " Tigalari": "Tigalari Alphabet"
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " Tirhuta": "Tirhuta"
    },
    {
        "Maithili": "Maithili Language"
    },
    {
        " Tocharian": "Tocharian Script"
    },
    {
        " Vatteluttu": "Vatteluttu"
    },
    {
        "Tamil": "Tamil Language"
    },
    {
        ", ": null
    },
    {
        "Malayalam": "Malayalam"
    },
    {
        " Zanabazar Square": "Mongolian Alphabets"
    },
    {
        " Zhang zhung": "Zhang-Zhung Language"
    },
    {
        " scripts   ": null
    },
    {
        "Kharoṣṭhī": "Kharoṣṭhī"
    },
    {
        " , from the 3rd century BC   ": null
    },
    {
        "Geez": "Geez Script"
    },
    {
        " , from the 4th century AD   ": null
    },
    {
        "Canadian Aboriginal syllabics": "Canadian Aboriginal Syllabics"
    },
    {
        " Cree": "Cree Syllabics"
    },
    {
        "Ojibwe syllabics": "Ojibwe Writing Systemsojibwe Syllabics"
    },
    {
        " Inuktitut syllabics": "Inuktitut Syllabics"
    },
    {
        " Blackfoot syllabics": "Blackfoot Languagewriting System"
    },
    {
        " Carrier syllabics": "Carrier Syllabics"
    },
    {
        " Thaana": "Thaana"
    },
    {
        " Pollard script": "Pollard Script"
    },
    {
        " Pitman shorthand": "Pitman Shorthand"
    },
    {
        " Tengwar": "Tengwar"
    },
    {
        "   Ihathvé Sabethired        ": null
    },
    {
        "Meroitic": "Meroitic Script"
    }
]