[
    {
        "   Angiotensin-converting-enzyme inhibitors  are a class of ": null
    },
    {
        "medication": "medication"
    },
    {
        " used primarily for the treatment of ": null
    },
    {
        "high blood pressure": "hypertension"
    },
    {
        " and ": null
    },
    {
        "heart failure": "heart failure"
    },
    {
        ".     They work by causing relaxation of blood vessels as well as a decrease in ": null
    },
    {
        "blood volume": "blood volume"
    },
    {
        ", which leads to lower ": null
    },
    {
        "blood pressure": "blood pressure"
    },
    {
        " and decreased oxygen demand from the ": null
    },
    {
        "heart": "heart"
    },
    {
        ". They ": null
    },
    {
        "inhibit": "enzyme inhibitor"
    },
    {
        " the ": null
    },
    {
        "angiotensin-converting enzyme": "angiotensin-converting enzyme"
    },
    {
        ", an important component of the ": null
    },
    {
        "renin–angiotensin system": "renin–angiotensin system"
    },
    {
        ".     Frequently prescribed ACE inhibitors include ": null
    },
    {
        "benazepril": "benazepril"
    },
    {
        ", ": null
    },
    {
        "zofenopril": "zofenopril"
    },
    {
        ", ": null
    },
    {
        "perindopril": "perindopril"
    },
    {
        ", ": null
    },
    {
        "trandolapril": "trandolapril"
    },
    {
        ", ": null
    },
    {
        "captopril": "captopril"
    },
    {
        ", ": null
    },
    {
        "enalapril": "enalapril"
    },
    {
        ", ": null
    },
    {
        "lisinopril": "lisinopril"
    },
    {
        ", and ": null
    },
    {
        "ramipril": "ramipril"
    },
    {
        ".        ACE inhibitors were initially approved for the treatment of hypertension and can be used alone or in combination with other anti-hypertensive medications. Later, they were found useful for other cardiovascular and kidney diseases  including:   Acute ": null
    },
    {
        "myocardial infarction": "myocardial infarction"
    },
    {
        "   Heart failure": "heart failure"
    },
    {
        "   Kidney complications of ": null
    },
    {
        "diabetes mellitus": "diabetes mellitus"
    },
    {
        "      In treating high blood pressure, ACE inhibitors are often the first drug choice, particularly when diabetes is present,  but age can lead to different choices and it is common to need more than one drug to obtain the desired improvement. There are fixed-dose ": null
    },
    {
        "combination drugs": "combination drugs"
    },
    {
        ", such as ": null
    },
    {
        "ACE inhibitor and thiazide combination": "ace inhibitor and thiazide combination"
    },
    {
        "s. ACE inhibitors have also been used in ": null
    },
    {
        "chronic kidney failure": "chronic kidney failure"
    },
    {
        " and kidney involvement in ": null
    },
    {
        "systemic sclerosis": "systemic sclerosis"
    },
    {
        " . In those with stable coronary artery disease, but no heart failure, benefits are similar to other usual treatments.      In 2012, there was a ": null
    },
    {
        "meta-analysis": "meta-analysis"
    },
    {
        " published in the ": null
    },
    {
        "BMJ": "the bmj"
    },
    {
        " that described the protective role of ACE inhibitors in reducing the risk of pneumonia when compared to ": null
    },
    {
        "ARBs": "angiotensin ii receptor blocker"
    },
    {
        ". The authors found a decreased risk in patients with previous stroke , with heart failure , and of Asian descent . However, no reduced pneumonia related mortality was observed.        ACE inhibitors may also be used to help decrease excessive water consumption in people with ": null
    },
    {
        "schizophrenia": "schizophrenia"
    },
    {
        " resulting in ": null
    },
    {
        "psychogenic polydipsia": "psychogenic polydipsia"
    },
    {
        ".   A double-blind, placebo-controlled trial showed that when used for this purpose, ": null
    },
    {
        "enalapril": "enalapril"
    },
    {
        " led to decreased consumption in 60% of people;  the same effect has been demonstrated in other ACE inhibitors.        Common side effects include: low blood pressure, ": null
    },
    {
        "cough": "cough"
    },
    {
        ", ": null
    },
    {
        "hyperkalemia": "hyperkalemia"
    },
    {
        ", ": null
    },
    {
        "headache": "headache"
    },
    {
        ", ": null
    },
    {
        "dizziness": "vertigo"
    },
    {
        ", ": null
    },
    {
        "fatigue": "fatigue"
    },
    {
        ", ": null
    },
    {
        "nausea": "nausea"
    },
    {
        ", and ": null
    },
    {
        "kidney": "kidney"
    },
    {
        " impairment. Rossi S, editor. ": null
    },
    {
        "Australian Medicines Handbook": "australian medicines handbook"
    },
    {
        " 2006. Adelaide: Australian Medicines Handbook; 2006. .      The main adverse effects of ACE inhibition can be understood from their pharmacological action. The other reported adverse effects are liver problems and effect on the fetus.   Kidney problems may occur with all ACE inhibitors that directly follows from their mechanism of action. Patients starting on an ACE inhibitor usually have a modest reduction in ": null
    },
    {
        "glomerular filtration rate": "glomerular filtration rate"
    },
    {
        " that stabilizes after several days. However, the decrease may be significant in conditions of decreased renal perfusion, such as renal artery stenosis, heart failure, polycystic kidney disease, or volume depletion. In these patients, maintenance of GFR depends on angiotensin-II-dependent efferent vasomotor tone. Therefore, ": null
    },
    {
        "renal function": "renal function"
    },
    {
        " should be closely monitored over the first few days after initiation of treatment with ACE inhibitor in patients with decreased renal perfusion. A moderate reduction in renal function, no greater than 30% rise in serum creatinine, that is stabilized after a week of treatment is deemed acceptable as part of the therapeutic effect, providing the residual renal function is sufficient. This is especially a problem if the patient is concomitantly taking an ": null
    },
    {
        "NSAID": "non-steroidal anti-inflammatory drug"
    },
    {
        " and a ": null
    },
    {
        "diuretic": "diuretic"
    },
    {
        ". When the three drugs are taken together, the risk of developing renal failure is significantly increased.      ": null
    },
    {
        "High blood potassium": "hyperkalemia"
    },
    {
        " is another possible complication of treatment with an ACE inhibitor due to its effect on aldosterone. Suppression of angiotensin II leads to a decrease in aldosterone levels. Since aldosterone is responsible for increasing the excretion of potassium, ACE inhibitors can cause retention of potassium. Some people, however, can continue to lose potassium while on an ACE inhibitor.  Hyperkalemia may decrease the velocity of impulse conduction in the nerves and muscles, including cardiac tissues. This leads to cardiac dysfunction and neuromuscular consequences, such as muscle weakness, paresthesia, nausea, diarrhea, and others. Close monitoring of potassium levels is required in patients receiving treatment with ACE inhibitors who are at risk of hyperkalemia.     Another possible adverse effect specific for ACE inhibitors, but not for other RAAS blockers, is an increase in ": null
    },
    {
        "bradykinin": "bradykinin"
    },
    {
        " level.     A persistent dry cough is a relatively common adverse effect believed to be associated with the increases in bradykinin levels produced by ACE inhibitors, although the role of bradykinin in producing these symptoms has been disputed.  Many cases of cough in people on ACE inhibitors may not be from the medication itself, however.  People who experience this cough are often switched to ": null
    },
    {
        "angiotensin II receptor antagonist": "angiotensin ii receptor antagonist"
    },
    {
        "s.     Some develop ": null
    },
    {
        "angioedema": "angioedema"
    },
    {
        " due to increased bradykinin levels.  A genetic predisposition may exist.      A severe rare allergic reaction can affect the bowel wall and secondarily cause abdominal pain.        Hematologic effects, such as neutropenia, agranulocytosis and other blood dyscrasias, have occurred during therapy with ACE inhibitors, especially in people with additional risk factors. FDA Prescribing information,        In pregnant women, ACE inhibitors taken during all the trimesters have been reported to cause ": null
    },
    {
        "congenital malformations": "congenital malformations"
    },
    {
        ", ": null
    },
    {
        "stillbirth": "stillbirth"
    },
    {
        "s, and ": null
    },
    {
        "neonatal death": "neonatal death"
    },
    {
        "s. Commonly reported fetal abnormalities include ": null
    },
    {
        "hypotension": "hypotension"
    },
    {
        ", ": null
    },
    {
        "renal dysplasia": "renal dysplasia"
    },
    {
        ", anuria/oliguria, ": null
    },
    {
        "oligohydramnios": "oligohydramnios"
    },
    {
        ", ": null
    },
    {
        "intrauterine growth retardation": "intrauterine growth retardation"
    },
    {
        ", ": null
    },
    {
        "pulmonary hypoplasia": "pulmonary hypoplasia"
    },
    {
        ", ": null
    },
    {
        "patent ductus arteriosus": "patent ductus arteriosus"
    },
    {
        ", and incomplete ossification of the skull.  Overall, about half of newborns exposed to ACE inhibitors are adversely affected.      ACE inhibitors are ": null
    },
    {
        "ADEC": "australian drug evaluation committee"
    },
    {
        " pregnancy category": "pregnancy category"
    },
    {
        " D, and should be avoided in women who are likely to become pregnant. In the U.S., ACE inhibitors must be labeled with a ": null
    },
    {
        "boxed warning": "boxed warning"
    },
    {
        " concerning the risk of birth defects when taken during the second and third trimester. Their use in the first trimester is also associated with a risk of major ": null
    },
    {
        "congenital malformation": "congenital malformation"
    },
    {
        "s, particularly affecting the ": null
    },
    {
        "cardiovascular": "circulatory system"
    },
    {
        " and ": null
    },
    {
        "central nervous system": "central nervous system"
    },
    {
        "s.        Symptoms and Treatment: There are few reports of ACE inhibitor overdose in the literature. The most likely manifestations are hypotension, which may be severe, hyperkalemia, hyponatremia and renal impairment with metabolic acidosis. Treatment should be mainly symptomatic and supportive, with volume expansion using normal saline to correct hypotension and improve renal function, and gastric lavage followed by activated charcoal and a cathartic to prevent further absorption of the drug. Captopril, enalapril, lisinopril and perindopril are known to be removable by hemodialysis.        The ACE inhibitors are contraindicated in people with:   Previous ": null
    },
    {
        "angioedema": "angioedema"
    },
    {
        " associated with ACE inhibitor therapy   Bilateral renal artery stenosis     Hypersensitivity to ACE inhibitors     ACE inhibitors should be used with caution in people with:   Impaired renal function   ": null
    },
    {
        "Aortic valve stenosis": "aortic valve stenosis"
    },
    {
        " or cardiac outflow obstruction   ": null
    },
    {
        "Hypovolemia": "hypovolemia"
    },
    {
        " or ": null
    },
    {
        "dehydration": "dehydration"
    },
    {
        " Hemodialysis": "hemodialysis"
    },
    {
        " with high-flux polyacrylonitrile membranes     A combination of ACE inhibitor with other drugs may increase effects of these drugs, but also the risk of adverse effects. The commonly reported adverse effects of drug combination with ACE are acute renal failure, hypotension, and hyperkalemia. The drugs interacting with ACE inhibitor should be prescribed with caution. Special attention should be given to combinations of ACE inhibitor with other RAAS blockers, ": null
    },
    {
        "diuretics": "diuretics"
    },
    {
        " , NSAIDs, ": null
    },
    {
        "anticoagulants": "anticoagulants"
    },
    {
        ", ": null
    },
    {
        "cyclosporine": "cyclosporine"
    },
    {
        ", ": null
    },
    {
        "DPP-4 inhibitors": "dpp-4 inhibitors"
    },
    {
        ", and ": null
    },
    {
        "potassium supplements": "potassium supplements"
    },
    {
        ".     Potassium supplementation should be used with caution and under medical supervision owing to the ": null
    },
    {
        "hyperkalemic": "hyperkalemia"
    },
    {
        " effect of ACE inhibitors.        ACE inhibitors reduce the activity of the renin–angiotensin–aldosterone system as the primary etiologic event in the development of hypertension in people with diabetes mellitus, as part of the insulin-resistance syndrome or as a manifestation of renal disease.               Renin–angiotensin–aldosterone system is a major blood pressure regulating mechanism. Markers of electrolyte and water imbalance in the body such as ": null
    },
    {
        "hypotension": "hypotension"
    },
    {
        ", low ": null
    },
    {
        "distal tubule": "distal convoluted tubule"
    },
    {
        " sodium": "sodium in biology"
    },
    {
        " concentration, decreased blood volume and high ": null
    },
    {
        "sympathetic": "sympathetic nervous system"
    },
    {
        " tone trigger the release of the enzyme ": null
    },
    {
        "renin": "renin"
    },
    {
        " from the cells of ": null
    },
    {
        "juxtaglomerular apparatus": "juxtaglomerular apparatus"
    },
    {
        " in the kidney. Renin activates a circulating liver derived prohormone ": null
    },
    {
        "angiotensin": "angiotensin"
    },
    {
        "ogen by proteolytic cleavage of all but its first ten ": null
    },
    {
        "amino acid": "amino acid"
    },
    {
        " residues known as ": null
    },
    {
        "angiotensin I": "angiotensin i"
    },
    {
        ". ": null
    },
    {
        "ACE": "angiotensin converting enzyme"
    },
    {
        " then removes a further two residues, converting angiotensin I into ": null
    },
    {
        "angiotensin II": "angiotensin ii"
    },
    {
        ". ": null
    },
    {
        "ACE": "angiotensin converting enzyme"
    },
    {
        " is found in the ": null
    },
    {
        "pulmonary circulation": "pulmonary circulation"
    },
    {
        " and in the ": null
    },
    {
        "endothelium": "endothelium"
    },
    {
        " of many blood vessels. Human Physiology, Silverthorn  The system increases blood pressure by increasing the amount of salt and water the body retains, although angiotensin is also very good at causing the blood vessels to tighten .       ACE inhibitors block the conversion of Angiotensin I to Angiotensin II .  They thereby lower ": null
    },
    {
        "arteriolar": "arteriole"
    },
    {
        " resistance and increase venous capacity; decrease ": null
    },
    {
        "cardiac output": "cardiac output"
    },
    {
        ", ": null
    },
    {
        "cardiac index": "cardiac index"
    },
    {
        ", stroke work, and ": null
    },
    {
        "volume": "stroke volume"
    },
    {
        "; lower resistance in blood vessels in the kidneys; and lead to increased ": null
    },
    {
        "natriuresis": "natriuresis"
    },
    {
        " .   Renin increases in concentration in the blood as a result of negative feedback of conversion of ATI to ATII. ATI increases for the same reason; ATII and aldosterone decrease. ": null
    },
    {
        "Bradykinin": "bradykinin"
    },
    {
        " increases because of less inactivation by ACE.     Under normal conditions, angiotensin II has these effects:   Vasoconstriction and vascular smooth muscle hypertrophy induced by ATII may lead to increased blood pressure and hypertension. Further, constriction of the ": null
    },
    {
        "efferent arterioles": "efferent arteriole"
    },
    {
        "of the kidney leads to increased perfusion pressure in the ": null
    },
    {
        "glomeruli": "glomerulus"
    },
    {
        ".   It contributes to ": null
    },
    {
        "ventricular remodeling": "ventricular remodeling"
    },
    {
        " and ": null
    },
    {
        "ventricular hypertrophy": "ventricular hypertrophy"
    },
    {
        " of the heart through stimulation of the ": null
    },
    {
        "proto-oncogenes": "proto-oncogene"
    },
    {
        " c-fos": "c-fos"
    },
    {
        ", ": null
    },
    {
        "c-jun": "c-jun"
    },
    {
        ", ": null
    },
    {
        "c-myc": "c-myc"
    },
    {
        ", ": null
    },
    {
        "transforming growth factor beta": "transforming growth factor beta"
    },
    {
        " , through fibrogenesis and apoptosis .   Stimulation by ATII of the ": null
    },
    {
        "adrenal cortex": "adrenal cortex"
    },
    {
        " to release ": null
    },
    {
        "aldosterone": "aldosterone"
    },
    {
        ", a hormone that acts on kidney tubules, causes sodium and chloride ions retention and potassium excretion. Sodium is a water-holding ion, so water is also retained, which leads to increased blood volume, hence an increase in blood pressure.   Stimulation of the posterior pituitary to release ": null
    },
    {
        "vasopressin": "vasopressin"
    },
    {
        " also acts on the kidneys to increase water retention. If ADH production is excessive in heart failure, Na + level in the plasma may fall , and this is a sign of increased risk of death in heart failure patients.   A decrease renal protein kinase C     With ACE inhibitor use, the production of ATII is decreased, which prevents aldosterone release from the adrenal cortex. This allows the kidney to excrete sodium ions along with obligate water, and retain potassium ions. This decreases blood volume, leading to decreased blood pressure.     ": null
    },
    {
        "Epidemiological": "epidemiology"
    },
    {
        " and clinical studies have shown ACE inhibitors reduce the progress of ": null
    },
    {
        "diabetic nephropathy": "diabetic nephropathy"
    },
    {
        " independently from their blood pressure-lowering effect.  This action of ACE inhibitors is used in the prevention of diabetic ": null
    },
    {
        "renal failure": "renal failure"
    },
    {
        ".     ACE inhibitors have been shown to be effective for indications other than hypertension  even in patients with normal blood pressure. The use of a maximum dose of ACE inhibitors in such patients is justified,  because it improves clinical outcomes independently of the blood pressure-lowering effect of ACE inhibitors. Such therapy, of course, requires careful and gradual titration of the dose to prevent the effects of rapidly decreasing blood pressure .     ACE inhibitors have also been shown to cause a central enhancement of ": null
    },
    {
        "parasympathetic nervous system": "parasympathetic nervous system"
    },
    {
        " activity in healthy volunteers and patients with heart failure.   This action may reduce the prevalence of malignant cardiac arrhythmias, and the reduction in sudden death reported in large clinical trials.    ACE Inhibitors also reduce plasma ": null
    },
    {
        "norepinephrine": "norepinephrine"
    },
    {
        " levels, and its resulting vasoconstriction effects, in heart failure patients, thus breaking the vicious circles of ": null
    },
    {
        "sympathetic": "sympathetic nervous system"
    },
    {
        " and renin angiotensin system activation, which sustains the downward spiral in cardiac function in congestive heart failure     The ACE inhibitor ": null
    },
    {
        "enalapril": "enalapril"
    },
    {
        " has also been shown to reduce cardiac ": null
    },
    {
        "cachexia": "cachexia"
    },
    {
        " in patients with chronic heart failure.  Cachexia is a poor prognostic sign in patients with chronic heart failure.    ACE inhibitors are under early investigation for the treatment of frailty and muscle wasting in elderly patients without heart failure.        ACE inhibitors are easily identifiable by their common suffix, -pril. ACE inhibitors can be divided into three groups based on their molecular structure:       ": null
    },
    {
        "Captopril": "captopril"
    },
    {
        " , the first ACE inhibitor   ": null
    },
    {
        "Zefnopril": "zefnopril"
    },
    {
        "       This is the largest group, including:   ": null
    },
    {
        "Enalapril": "enalapril"
    },
    {
        "   Ramipril": "ramipril"
    },
    {
        "   Quinapril": "quinapril"
    },
    {
        "   Perindopril": "perindopril"
    },
    {
        "   Lisinopril": "lisinopril"
    },
    {
        "   Benazepril": "benazepril"
    },
    {
        "   Imidapril": "imidapril"
    },
    {
        "   Trandolapril": "trandolapril"
    },
    {
        "   Cilazapril": "cilazapril"
    },
    {
        "       Fosinopril": "fosinopril"
    },
    {
        " is the only member of this group         A comprehensive resource on anti-hypertensive peptides is available in form of a database. It contains around 1700 unique antihypertensive peptides    ": null
    },
    {
        "Arfalasin": "arfalasin"
    },
    {
        " is angiotensin antagonist.        Caso": null
    },
    {
        "kinins": "kinin"
    },
    {
        "and lactokinins, breakdown products of ": null
    },
    {
        "casein": "casein"
    },
    {
        " and ": null
    },
    {
        "whey": "whey"
    },
    {
        ", occur naturally after ingestion of ": null
    },
    {
        "milk": "milk"
    },
    {
        " products, especially ": null
    },
    {
        "cultured milk": "cultured milk"
    },
    {
        ". Their role in blood pressure control is uncertain.    The ": null
    },
    {
        "lactotripeptides": "lactotripeptides"
    },
    {
        " Val-Pro-Pro and Ile-Pro-Pro produced by the ": null
    },
    {
        "probiotic": "probiotic"
    },
    {
        "  Lactobacillus helveticus  or derived from ": null
    },
    {
        "casein": "casein"
    },
    {
        " have been shown to have ACE-inhibiting and antihypertensive functions.  In one study, L. helveticus PR4 was isolated from Italian cheeses.        All ACE inhibitors have similar antihypertensive efficacy when equivalent doses are administered. The main differences lie with ": null
    },
    {
        "captopril": "captopril"
    },
    {
        ", the first ACE inhibitor. Captopril has a shorter duration of action and an increased incidence of adverse effects. It is also the only ACE inhibitor capable of passing through the ": null
    },
    {
        "blood–brain barrier": "blood–brain barrier"
    },
    {
        ", although the significance of this characteristic has not been shown to have any positive clinical effects.     In a large clinical study, one of the agents in the ACE inhibitor class, ": null
    },
    {
        "ramipril": "ramipril"
    },
    {
        " , demonstrated an ability to reduce the mortality rates of patients suffering from a ": null
    },
    {
        "myocardial infarction": "myocardial infarction"
    },
    {
        ", and to slow the subsequent development of heart failure. This finding was made after it was discovered that regular use of ramipril reduced mortality rates even in test subjects not having suffered from hypertension.      Some believe ramiprils additional benefits may be shared by some or all drugs in the ACE-inhibitor class. However, ramipril currently remains the only ACE inhibitor for which such effects are actually evidence-based.      A meta-analysis confirmed that ACE inhibitors are effective and certainly the first-line choice in hypertension treatment. This meta-analysis was based on 20 trials and a cohort of 158,998 patients, of whom 91% were hypertensive. ACE inhibitors were used as the active treatment in seven trials and angiotensin receptor blocker in 13 trials .   ACE inhibitors were associated with a statistically significant 10% mortality reduction: . In contrast, no significant mortality reduction was observed with ARB treatment . Analysis of mortality reduction by different ACE inhibitors showed that perindopril-based regimens are associated with a statistically significant 13% all-cause mortality reduction.   Taking into account the broad spectrum of the hypertensive population, one might expect that an effective treatment with ACE inhibitors, in particular with ": null
    },
    {
        "perindopril": "perindopril"
    },
    {
        ", would result in an important gain of lives saved.        The ACE inhibitors have different strengths with different starting dosages. Dosage should be adjusted according to the clinical response.   TripAnswers, ": null
    },
    {
        "Trip": "trip"
    },
    {
        ", May 25, 2007. Accessed 2009-11-21 Common Medication Conversions :  . GlobalRPh.com. Accessed 2009-11-22. . Consumer Reports Health Best Buy Drugs. June 2009.          ACE inhibitors possess many common characteristics with another class of cardiovascular drugs, ": null
    },
    {
        "angiotensin II receptor antagonist": "angiotensin ii receptor antagonist"
    },
    {
        "s, which are often used when patients are intolerant of the adverse effects produced by ACE inhibitors. ACE inhibitors do not completely prevent the formation of angiotensin II, as blockage is dose-dependent, so angiotensin II receptor antagonists may be useful because they act to prevent the action of angiotensin II at the AT 1 receptor, leaving AT 2 receptor unblocked; the latter may have consequences needing further study.       The combination therapy of angiotensin II receptor antagonists with ACE inhibitors may be superior to either agent alone. This combination may increase levels of bradykinin while blocking the generation of angiotensin II and its activity at the AT 1 receptor. This dual blockade may be more effective than using an ACE inhibitor alone, because angiotensin II can be generated via non-ACE-dependent pathways. Preliminary studies suggest this combination of pharmacologic agents may be advantageous in the treatment of ": null
    },
    {
        "essential hypertension": "essential hypertension"
    },
    {
        ", chronic ": null
    },
    {
        "heart failure": "heart failure"
    },
    {
        ",  and ": null
    },
    {
        "nephropathy": "nephropathy"
    },
    {
        ".   However, the more recent ONTARGET study showed no benefit of combining the agents and more adverse events.  While statistically significant results have been obtained for its role in treating hypertension, clinical significance may be lacking.  There are warnings about the combination of ACE inhibitors with ARBs.      Patients with heart failure may benefit from the combination in terms of reducing ": null
    },
    {
        "morbidity": "morbidity"
    },
    {
        " and ": null
    },
    {
        "ventricular remodeling": "ventricular remodeling"
    },
    {
        ".       The most compelling evidence for the treatment of nephropathy has been found: This combination therapy partially reversed the ": null
    },
    {
        "proteinuria": "proteinuria"
    },
    {
        " and also exhibited a renoprotective effect in patients afflicted with ": null
    },
    {
        "diabetic nephropathy": "diabetic nephropathy"
    },
    {
        ", and pediatric ": null
    },
    {
        "IgA nephropathy": "iga nephropathy"
    },
    {
        ".             The first step in the development of ACE inhibitors was the discovery of ACE in ": null
    },
    {
        "plasma": "blood plasma"
    },
    {
        " by ": null
    },
    {
        "Leonard T. Skeggs": "leonard t. skeggs"
    },
    {
        " and his colleagues in 1956. Brazilian scientist ": null
    },
    {
        "Sérgio Henrique Ferreira": "sérgio henrique ferreira"
    },
    {
        " reported a bradykinin-potentiating factor present in the venom of  Bothrops jararaca , a South American pit viper, in 1965.  Ferreira then went to ": null
    },
    {
        "John Vanes": "john vane"
    },
    {
        "laboratory as a postdoctoral fellow with his already-isolated BPF. The conversion of the inactive angiotensin I to the potent angiotensin II was thought to take place in the plasma. However, in 1967, ": null
    },
    {
        "Kevin K. F. Ng": "kevin k. f. ng"
    },
    {
        " and ": null
    },
    {
        "John R. Vane": "john r. vane"
    },
    {
        " showed plasma ACE is too slow to account for the conversion of angiotensin I to angiotensin II in vivo. Subsequent investigation showed rapid conversion occurs during its passage through the pulmonary circulation.      Bradykinin is rapidly inactivated in the circulating blood, and it disappears completely in a single pass through the pulmonary circulation. Angiotensin I also disappears in the pulmonary circulation because of its conversion to angiotensin II. Furthermore, angiotensin II passes through the lungs without any loss. The inactivation of bradykinin and the conversion of angiotensin I to angiotensin II in the lungs was thought to be caused by the same enzyme.  In 1970, Ng and Vane, using BPF provided by Ferreira, showed the conversion is inhibited during its passage through the pulmonary circulation.      BPFs are members of a family of peptides whose potentiating action is linked to inhibition of bradykinin by ACE. Molecular analysis of BPF yielded a nonapeptide BPF ": null
    },
    {
        "teprotide": "teprotide"
    },
    {
        " , which showed the greatest ACE inhibition potency and hypotensive effect in vivo. Teprotide had limited clinical value as a result of its peptide nature and lack of activity when given orally. In the early 1970s, knowledge of the structure-activity relationship required for inhibition of ACE was growing. ": null
    },
    {
        "David Cushman": "david cushman"
    },
    {
        ", ": null
    },
    {
        "Miguel Ondetti": "miguel ondetti"
    },
    {
        " and colleagues used peptide analogues to study the structure of ACE, using carboxypeptidase A as a model. Their discoveries led to the development of captopril, the first orally-active ACE inhibitor, in 1975.     Captopril was approved by the United States ": null
    },
    {
        "Food and Drug Administration": "food and drug administration"
    },
    {
        " in 1981. The first nonsulfhydryl-containing ACE inhibitor, enalapril, was marketed two years later. At least 12 other ACE inhibitors have since been marketed.     In 1991, Japanese scientists created the first milk-based ACE inhibitor, in the form of a fermented milk drink, using specific cultures to liberate the ": null
    },
    {
        "tripeptide": "tripeptide"
    },
    {
        " isoleucine": "isoleucine"
    },
    {
        "-": null
    },
    {
        "proline": "proline"
    },
    {
        "-proline from the dairy protein. ": null
    },
    {
        "Valine": "valine"
    },
    {
        "-proline-proline is also liberated in this process—another milk tripeptide with a very similar chemical structure to IPP. Together, these peptides are now often referred to as ": null
    },
    {
        "lactotripeptides": "lactotripeptides"
    },
    {
        ". In 1996, the first human study confirmed the blood pressure-lowering effect of IPP in fermented milk.  Although twice the amount of VPP is needed to achieve the same ACE-inhibiting activity as the originally discovered IPP, VPP also is assumed to add to the total blood pressure lowering effect.    Since the first lactotripeptides discovery, more than 20 human clinical trials have been conducted in many different countries. ": null
    }
]