[
    {
        "      Ad libitum  is ": null
    },
    {
        "Latin": "latin"
    },
    {
        " for at ones pleasure or as you desire ; it is often shortened to ad lib  or ad-lib . The roughly synonymous phrase a bene placito is less common but, in its Italian form  a piacere , entered the musical  lingua franca  .     The phrase at liberty is often associated ": null
    },
    {
        "mnemonic": "mnemonic"
    },
    {
        "ally , although it is not the translation . ": null
    },
    {
        "Libido": "wikt:libidolatin"
    },
    {
        " is the etymologically closer cognate known in English.      Music or rhythm": null
    },
    {
        "sheet music": "sheet music"
    },
    {
        ", ad libitum indicates that the performer or conductor has one of a variety of types of discretion with respect to a given passage:   to play the passage in ": null
    },
    {
        "free time": "free time"
    },
    {
        " rather than in strict or ": null
    },
    {
        "metronomic": "metronome"
    },
    {
        " tempo": "tempo"
    },
    {
        " ;   to improvise a melodic line fitting the general structure prescribed by the passages written notes or chords;   to omit an instrument part, such as a nonessential ": null
    },
    {
        "accompaniment": "accompaniment"
    },
    {
        ", for the duration of the passage; or   in the phrase repeat ad libitum, to play the passage an arbitrary number of times .     Note that the direction a piacere has a more restricted meaning, generally referring to only the first two types of discretion. ": null
    },
    {
        "Baroque music": "baroque music"
    },
    {
        ", especially, has a written or implied ad libitum, with most composers intimating the freedom the performer and conductor have.     For post-Baroque classical music and jazz, see ": null
    },
    {
        "cadenza": "cadenza"
    },
    {
        ".     The Reverend Samuel Danforth Jr. published a poem titled Ad Librum in the 42 edition of the New England Almanac.       Ad libitum is also used in ": null
    },
    {
        "psychology": "psychology"
    },
    {
        " and ": null
    },
    {
        "biology": "biology"
    },
    {
        " to refer to the free-feeding weight of an animal, as opposed, for example, to the weight after a restricted diet or pair feeding. For example, The rats ad libitum weight was about 42 g. In nutritional studies, this phrase denotes providing an animal free access to feed or water, thereby allowing the animal to self-regulate intake according to its biological needs. For example, Rats were given ad libitum access to food and water.     In biological field studies, it can also mean that information or data were obtained spontaneously without a specific method.     ": null
    },
    {
        "Medical prescription": "medical prescription"
    },
    {
        "s may use the abbreviation ad lib. to indicate freely or that as much as one desires should be used. More common is  pro re nata  dosing, in which a drug is used only if needed and only up to some maximum amount.       Ad-lib is used to describe individual moments during live theatre when an actor speaks through their character using words not found in the plays text. When the entire performance is predicated on spontaneous creation, the process is called ": null
    },
    {
        "improvisational theatre": "improvisational theatre"
    },
    {
        ".     In ": null
    },
    {
        "film": "film"
    },
    {
        ", the term ad-lib usually refers to the interpolation of unscripted material in an otherwise scripted performance. For example, in interviews, ": null
    },
    {
        "Dustin Hoffman": "dustin hoffman"
    },
    {
        " says he ad-libbed the now famous line, Im walking here! Im walking here! as Ratso Rizzo in  Midnight Cowboy .     Live performers such as ": null
    },
    {
        "television": "television"
    },
    {
        " talk-show": "talk-show"
    },
    {
        " hosts sometimes deliver material that sounds ad-libbed but is actually scripted. They may employ ad-lib writers to prepare such material.  Some actors are also known for their ability or tendency to ad-lib, such as ": null
    },
    {
        "Peter Falk": "peter falk"
    },
    {
        " , who would ad-lib such mannerisms as absent-mindedness while in character.     The HBO sitcom  Curb Your Enthusiasm  by Seinfeld co-creator ": null
    },
    {
        "Larry David": "larry david"
    },
    {
        " primarily uses ": null
    },
    {
        "retroscripting": "retroscripting"
    }
]