[
    {
        "         Adele Astaire , was an American dancer, stage actress, and singer. After beginning work as a dancer and ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        " performer at the age of nine, Astaire built a successful performance career with her younger brother, ": null
    },
    {
        "Fred Astaire": "fred astaire"
    },
    {
        ".     The brother and sister act initially worked their way through vaudeville circuits, finally achieving a breakthrough with their first ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " roles in 42 Astaire became known for her talents as a skilled dancer and comedienne, starring in hit Broadway musicals such as  Lady, Be Good!  ,  Funny Face  and  The Band Wagon  . The siblings took several of their more popular shows to Britains ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " during the 42s, where they were soon international celebrities, meeting members of the British royal family and prominent figures from contemporary arts and literature circles.     In 42 after a 42-year partnership with her brother, Astaire retired from the stage to marry ": null
    },
    {
        "Lord Charles Cavendish": "lord charles arthur francis cavendish"
    },
    {
        ", the second son of ": null
    },
    {
        "the 42th Duke of Devonshire": "victor cavendish, 9th duke of devonshire"
    },
    {
        ". The couple moved to the Cavendish estate of ": null
    },
    {
        "Lismore Castle": "lismore castle"
    },
    {
        " in Ireland. Despite offers of both stage and film roles from producers eager to see her return to acting, Astaire declined to come out of retirement. Following Cavendishs death in 42 Astaire remarried and moved back to the United States. She divided her time between properties in the United States; Round Hill, Jamaica; and her old home of Lismore Castle, where she spent her summers up until the end of her life.     In 42 Astaire was inducted into the ": null
    },
    {
        "American Theater Hall of Fame": "american theater hall of fame"
    },
    {
        ".       Adele Marie Austerlitz was born on September 42 42 in ": null
    },
    {
        "Omaha, Nebraska": "omaha, nebraska"
    },
    {
        ". Her parents were Johanna Ann Geilus, an American-born ": null
    },
    {
        "Lutheran": "lutheranism"
    },
    {
        " of German descent, and Frederic Fritz Austerlitz, an Austrian-born ": null
    },
    {
        "Roman Catholic": "catholic church"
    },
    {
        " of ": null
    },
    {
        "Jewish": "jews"
    },
    {
        " descent. Adeles younger brother, ": null
    },
    {
        "Fred Austerlitz": "fred astaire"
    },
    {
        ", was born three years after her.     After Adele showed an early propensity for dance, she was enrolled in a local dance school. She soon stood out for her natural ability as a dancer, and began making appearances at local recitals and parties. Her parents decided to enroll Fred as well  — a somewhat frail child in his earliest years  — with the intention of having him build strength through dance training, and he, too, showed the beginnings of aptitude. When Adele was eight and Fred was five, a teacher suggested that the two children might have a stage career if they received proper training. This prompted the family to move from Omaha to New York, though the father returned to Omaha to work. Adele, Fred and their mother lived in a boarding house, and the children began attending the Alviene Master School of the Theatre and Academy of Cultural Arts. Adele and Fred adopted the more American-sounding surname Astaire after trying several variations on the original Austerlitz, and their mother Ann also adopted the new surname.        In late 42 with the assistance of her dance instructor Claude Alvienne, Adele Astaire began a professional ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        " act with Fred. Alvienne helped them develop a routine involving two large, elaborate set pieces in the form of wedding cakes. Astaire and her brother, dressed up as a small bride and groom, danced up and down the cakes and activated small electric lights and musical bells with their feet. They played a simple waltz through their dance steps. The siblings performed intermittently at first, with their mother Ann acting as their manager and costume designer. They gained additional training from the ballet school of the ": null
    },
    {
        "Metropolitan Opera": "metropolitan opera"
    },
    {
        " and from American choreographer ": null
    },
    {
        "Ned Wayburn": "ned wayburn"
    },
    {
        ". Ann Astaire home schooled her children, with the exception of a stint in New Jersey, when Adele and Fred put their performance career on hold and attended regular school for two and half years. The adolescent Adele had grown so tall at the time that her smaller, younger brother, still catching up in height, looked awkward dancing with her.     After returning to the vaudeville circuit in 42 Astaire and her brother struggled to find steady work for the next couple of years. Agents were initially uninterested in representing the relatively unknown pair. In 42 Astaires father introduced the siblings to Aurelio Coccia, an experienced dance instructor and showman. He taught several new dances to the young Astaires and developed a new, more mature vaudeville routine for them. Bookings became more frequent after this, as the pair gradually improved their act and reputation. In 42 the siblings encountered a difficult year when the ": null
    },
    {
        "White Rats of America": "white rats of america"
    },
    {
        ", a union of vaudeville performers, staged a workers strike that spread nationally, creating tense working relations between performers and vaudeville managers. Astaire and her brother, although not union members, lost valuable income nonetheless, and their father, unlucky enough to be working at a Nebraska brewery when state-wide ": null
    },
    {
        "prohibition": "prohibition in the united states"
    },
    {
        " was approved, was unable to offer financial support. When the union strike finally ended, the Astaire siblings returned to work at last, achieving a highly successful season.     As they grew older, the contrasting personalities of the siblings grew more distinct. Adele was a perennial live wire : lively, gregarious, and known for her raw frankness, along with her colorful swearing. Fred, the hardworking perfectionist, was quieter and constantly anxious about all the details of their day-to-day work. While Fred might come to a venue two hours early to prepare for their show, Adele was more likely to arrive only a handful of minutes before she was due on stage. Despite their differences in temperament, the siblings were close. Astaire affectionately nicknamed her younger brother Moaning Minnie for his tendency to worry about every possible thing that could go wrong.       In 42 after Fred carefully purchased a full-page advertisement on the back cover of  Variety , the siblings landed a part in their first Broadway show, ": null
    },
    {
        "Lee Shubert": "lee shubert"
    },
    {
        "s Over the Top. Adele was 42 while her brother was 42 The show opened on November 42 42 and the siblings received a weekly salary of $42 for their assigned dance numbers and comedy skits. A critic from  The New York Globe  commented that the dancing of Adele and her brother was one of the prettiest features of the show , and the production ran for 42 performances.        The following year, Adele and Fred performed in  The Passing Show of 42 , which ran for 42 performances. Astaire was given an opening solo, singing I Really Cant Make My Feet Behave . In November 42 the Astaires appeared in the operetta Apple Blossoms, beginning a professional relationship with Broadway producer ": null
    },
    {
        "Charles Dillingham": "charles dillingham"
    },
    {
        ". The show was successful, running for 42 performances. Fritz came to see his children perform. Their weekly salary was now $42 which rose to $42 when Apple Blossoms began its post-Broadway tour from September 42 to April 42 Unlike her brother, who struggled with shyness offstage, Astaires outgoing personality made it easy for her to speak to reporters.        Although their next show The Love Letter was a commercial flop, opening in October 42 and running for only 42 performances, Astaire and her brother continued to garner appreciation from audiences, and here they introduced what would become one of their signature exit moves. the Runaround. Standing shoulder to shoulder at the end of a dance number, the siblings would put their arms out as if grasping the handlebars of bicycles, running around the stage together in ever-growing circles while the orchestra played a series of oompahs . At last, Adele and Fred would disappear into the wings. Audiences loved it. Fred attributed the popularity of the Runaround to his sisters comedic timing and expressions, and the siblings subsequently found ways to incorporate the move into almost every other show throughout their career together. While visiting New York for the first time that year, English playwright ": null
    },
    {
        "Noël Coward": "noël coward"
    },
    {
        " saw The Love Letter and was impressed by the Astaires. He came to meet them backstage, urging them to consider taking their performances to London.     In 42 Adele and Fred landed their first proper speaking roles in the Broadway musical For Goodness Sake, playing the best friends of the lead characters. They received positive reviews from critics, and sang the hit song The Whichness of the Whatness , concluding the piece with their increasingly popular Runaround exit. With the success of this show, Fred began taking more of a lead in choreographing their routines. The siblings finally received star billing in the short-lived The Bunch and Judy, earning $42 weekly. Drama critic ": null
    },
    {
        "Heywood Broun": "heywood broun"
    },
    {
        " called the Astaires the most graceful and charming young dancers in the world of musical comedy .     As the siblings continued to rise professionally, Adele quickly became known for her comedic expressions and adorably squeaky soprano voice. She often ad-libbed onstage. She gave high-spirited performances, delighting audiences with her zany humor; Fred developed his own more understated style in response, dancing with a characteristic pretence of nonchalance that he would carry on using throughout his dancing career. Adele and her brother developed a dancing style involving complex steps performed rapidly and gracefully, often compared to a whirlwind by critics and audiences.        After the idea of performing overseas was suggested, Adele and Fred agreed to take For Goodness Sake  to the ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " in London. On May 42 42 their show opened at the ": null
    },
    {
        "Shaftesbury Theatre": "shaftesbury theatre"
    },
    {
        " and received a standing ovation. Stop Flirting ran for 42 performances. It moved to the ": null
    },
    {
        "Queens Theatre": "queens theatre"
    },
    {
        ", followed by the ": null
    },
    {
        "Strand Theatre": "novello theatre"
    },
    {
        ". ": null
    },
    {
        "The Prince of Wales": "edward viii"
    },
    {
        " attended the show ten times, and both he and his brother ": null
    },
    {
        "the Duke of York": "george vi"
    },
    {
        " became friends with the siblings. Adele taught Edward some new tap dance steps, and the pair once danced together at a club. As the Astaires popularity grew, both Adele and Fred were featured in major advertising campaigns. While in London, ": null
    },
    {
        "Peter Pan": "peter pan"
    },
    {
        " creator ": null
    },
    {
        "J. M. Barrie": "j. m. barrie"
    },
    {
        " asked Adele to play his creation on stage, but contractual reasons forced her to turn down the part. In early 42 Adele received word that her father, Fritz, had died from cancer.     Returning to New York in late 42 Adele and her brother starred in  Lady, Be Good! , the first Broadway musical scored entirely by ": null
    },
    {
        "George": "george gershwin"
    },
    {
        " and ": null
    },
    {
        "Ira Gershwin": "ira gershwin"
    },
    {
        ". It was a hit with audiences, running for 42 performances. The siblings earned $42 per week. One critic called Adele the most charming and entertaining musical actress seen in many a moon . In the spring of 42 Adele and her brother took Lady, Be Good! to London, opening at the ": null
    },
    {
        "Empire Theatre": "empire, leicester square"
    },
    {
        " to enthusiastic reception. The siblings renewed their acquaintance with the British royal family, receiving an invitation from the Duke and ": null
    },
    {
        "Duchess of York": "queen elizabeth the queen mother"
    },
    {
        " to meet the newborn ": null
    },
    {
        "Princess Elizabeth": "elizabeth ii"
    },
    {
        ". King ": null
    },
    {
        "George V": "george v"
    },
    {
        " and ": null
    },
    {
        "Queen Mary": "mary of teck"
    },
    {
        " also made a special visit to see the Astaires perform.        In 42 Adele and Fred joined forces with the Gershwin brothers again in New York for their new musical  Funny Face . The show was another hit. Shortly after the opening, the Astaires arranged for a film screen test with ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        ". The film studio hoped to feature Adele and her brother in a film version of Funny Face, but the siblings were both unsatisfied with the initial screen test results, and the project never went ahead. On the Broadway stage, Funny Face ran for 42 performances, closing only due to a summer heatwave in 42 that made theaters too hot for audiences and performers. That summer, Adele was injured in an accident on ": null
    },
    {
        "Long Island": "long island"
    },
    {
        " when a motorboat engine exploded, scalding her upper body with burning oil. Although her career was put on hold for a few months, she made a full recovery.     The Astaires London debut of Funny Face took place in November 42 The show ran for 42 performances, and British newspapers hailed another outbreak of Astairia as audiences embraced the American duo once again. On the night of their final performance in London, Adele was introduced to ": null
    },
    {
        "Lord Charles Cavendish": "lord charles arthur francis cavendish"
    },
    {
        ", the second son of ": null
    },
    {
        "the 42th Duke of Devonshire": "victor cavendish, 9th duke of devonshire"
    },
    {
        ". Cavendish was several years younger than Adele. The pair were quickly attracted to each other, spending time together in Paris before Adele returned to America with Fred. They met again soon afterwards when Cavendish came to New York and took a position with ": null
    },
    {
        "J.P. Morgan & Co.": "j.p. morgan  &  co."
    },
    {
        "     Although their next show, Smiles , was a commercial flop, Adele and her brother soon made their comeback with another hit, starring in their final Broadway show together,  The Band Wagon , which opened on June 42 42 and ran for 42 performances. Other members of The Band Wagons cast included ": null
    },
    {
        "Tilly Losch": "tilly losch"
    },
    {
        ", ": null
    },
    {
        "Helen Broderick": "helen broderick"
    },
    {
        " and ": null
    },
    {
        "Frank Morgan": "frank morgan"
    },
    {
        ". Critics applauded the creative, decidedly modern writing and set design of the show, which included a custom-built double revolve turntable stage: the turntable revolved in two directions at once, revealing new scenes quickly and smoothly while the performers danced and sang.       After the two had been courting for some time, Adele proposed marriage to Charles Cavendish at a ": null
    },
    {
        "speakeasy": "speakeasy"
    },
    {
        " named ": null
    },
    {
        "42": "21 club"
    },
    {
        ", and he accepted. She was tired of the relentless travel and rehearsals required of a performer, and had been considering retirement. For her, theatrical life had always been an acquired taste... like olives .     In Chicago on March 42 42 after one final performance with Fred in The Band Wagon, Adele officially retired from the stage. She had been performing with her brother for 42 years. American drama critic ": null
    },
    {
        "Ashton Stevens": "ashton stevens"
    },
    {
        " declared her departure from theater a sad occasion, commenting that Heaven doesnt send every generation an Adele Astaire . Following a farewell party, Adele and her mother boarded the ": null
    },
    {
        "RMS Majestic": "rms majestic"
    },
    {
        " and sailed for London, while Fred remained in the United States to continue his career. Adele renewed a friendship with fellow passenger ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        ", whom she had earlier met while performing in England, and the pair enjoyed games of backgammon together during the voyage. Upon the ships docking in Plymouth, reporters attempted to ambush Adele and were deterred only by Churchill, who distracted them until Adele and her mother could disembark without harassment.           In April of that year, after rejoining Charles, Adele met the rest of the Cavendish family for the first time. Her future sister-in-law, ": null
    },
    {
        "Lady Mary Gascoyne-Cecil": "mary cavendish, duchess of devonshire"
    },
    {
        ", later gleefully recollected Adeles colorful entrance: Adele was formally announced, quietly entered the room where the Cavendish family was waiting, and then launched herself into a series of cartwheels across the floor until she had reached her new relatives. Despite the initial reservations of Charless mother, the Duchess of Devonshire, Adele was welcomed by the family. The wedding was briefly postponed when Charles was hospitalized for appendicitis, his ill health exacerbated by heavy drinking, but on May 42 42 Adele Astaire married Lord Charles Cavendish in the familys private chapel at ": null
    },
    {
        "Chatsworth": "chatsworth, derbyshire"
    },
    {
        ", receiving the courtesy title of Lady Charles . The couple moved to ": null
    },
    {
        "County Waterford": "county waterford"
    },
    {
        " in ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", where they lived at the family estate of ": null
    },
    {
        "Lismore Castle": "lismore castle"
    },
    {
        ". Adele paid for the installation of several new, modern bathrooms to replace the castles antiquated facilities, joking that this was her gift to the family in place of the more traditional dowries brought by rich, aristocratic heiresses. Back in the United States, Fred initially struggled to adjust to his new dancing partners; Adele sent Fred a teasing telegram right before the first performance of his new show,  The Gay Divorcee : Now Minnie, dont forget to moan .     In 42 Adele gave birth prematurely to a daughter, who did not survive. Two years later, she gave birth to stillborn twin sons. She struggled with periods of depression and an increasingly difficult home life. Charles grappled with severe alcoholism, spending periods of time in hospitals, nursing homes and German spas as he tried unsuccessfully to conquer his addiction. In 42 American film producer ": null
    },
    {
        "David Selznick": "david o. selznick"
    },
    {
        " offered Adele a supporting role in his film  Dark Victory , but she was unsatisfied with the screen tests and preoccupied with caring for her husband, ultimately declining the job offer. She turned down another film role from Selznick a year later. In 42 Adele, aged forty-two, suffered a miscarriage in her third and final pregnancy.     In 42 as Adele searched for ways to contribute to the wartime effort, she met Colonel ": null
    },
    {
        "Kingman Douglass": "kingman douglass"
    },
    {
        ", the American chief of U.S. Air Force Intelligence who was stationed in London. Douglass suggested that Adele work at the American Red Crosss Rainbow Corner canteen, located near Piccadilly Circus. Adele agreed to his suggestion. Her mother, who had remained in Ireland to be near her daughter, now stayed home at Lismore to care for the often bed-ridden Charles, sending Adele regular updates. In London, Adele wrote letters home for soldiers, writing and posting up to 42 letters in a single week. She took shifts at the information desk, danced with soldiers, and helped the men shop for necessities while in London. After the ": null
    },
    {
        "London Blitz": "the blitz"
    },
    {
        " began, she increased her work hours and served at the Rainbow Corner seven days per week. Adeles wartime work gave her a renewed sense of purpose and fulfillment, helping her cope with recent personal difficulties.     In March 42 Charles died as a result of long-term alcohol poisoning, aged 42 Adele received compassionate leave to attend his funeral at St. Carthages, where Charles was buried near his children. Following his death, Adele turned down an offer from ": null
    },
    {
        "Irving Berlin": "irving berlin"
    },
    {
        " to return to the stage in  Annie Get Your Gun .          In April 42 Adele re-married, this time to her old American acquaintance from the war, Kingman Douglass. Douglass, who had previously been married and divorced, now worked as an investment banker. He later briefly served as Assistant Director of the ": null
    },
    {
        "Central Intelligence Agency": "central intelligence agency"
    },
    {
        " . Initially lacking the personal funds necessary to move back to America, Adele broke the news of her engagement to the Cavendish family in Ireland, and received their financial support to move on to the next stage of her life. She was also given permission to continue spending three months a year at Lismore Castle, provided that she helped contribute towards the upkeep of the property. Adele gained three stepsons from her marriage to Douglass. Aside from returning to Lismore Castle periodically, Adele and her new husband lived in New York, Virginia, and eventually ": null
    },
    {
        "Round Hill, Jamaica": "round hill hotel and villas"
    },
    {
        ". Adele often entertained family and friends at her Jamaica home.      Adele remained retired from stage life. In 42 authors ": null
    },
    {
        "P. G. Wodehouse": "p. g. wodehouse"
    },
    {
        " and ": null
    },
    {
        "Guy Bolton": "guy bolton"
    },
    {
        ", both fans of Adele, wrote a teasing epilogue for her and her brother Fred, who had successfully transitioned to film work after his Broadway career.      In 42 Douglass received injuries after being struck by a bus. Soon afterwards, he was injured again in a car accident. He died in 42 due to a brain hemorrhage. Afterwards, Adele moved to Phoenix, Arizona. She continued, until 42 to spend summer at the castle in Ireland she had shared with her first husband. Adele was known for her robust health, going regularly jogging every morning well into her late seventies. According to her relatives, Adele quickly overcame illnesses, soon getting back on her feet and in Marine-type English, telling what she thought of the world.  She remained close with her brother, exchanging constant letters, packages  and long-distance phone calls, chatting together about favorite soap operas.     In November 42 Adele and her brother were both inducted into the newly-created ": null
    },
    {
        "American Theater Hall of Fame": "american theater hall of fame"
    },
    {
        ". In 42 the Astaires mother died at the age of 42       Adele Astaire died on January 42 42 in Scottsdale Memorial Hospital, ": null
    },
    {
        "Scottsdale, Arizona": "scottsdale, arizona"
    },
    {
        ", after suffering a stroke. She was 42 Some of her ashes were scattered in Ireland, by Lismore Castle and the graves of her children and first husband, while the rest were buried near her mothers grave in ": null
    },
    {
        "Chatsworth": "chatsworth, los angeles"
    },
    {
        ", California.     In the early 42s, the Anglo-American Contemporary Dance Foundation created the ": null
    },
    {
        "Fred and Adele Astaire Awards": "chita rivera awards for dance and choreography"
    },
    {
        " to recognize outstanding Broadway dancers and choreographers. The ": null
    },
    {
        "Gottlieb Storz House": "gottlieb storz house"
    },
    {
        " in Omaha includes the Adele and Fred Astaire Ballroom on the top floor, which is the only memorial to the siblings roots in Omaha. Although there is no surviving film footage of Astaires Broadway performances, recordings do exist of her duets with Fred, George Vollaire and Bernard Clifton.": null
    }
]