[
    {
        "     Adolf was ": null
    },
    {
        "Count of Nassau": "house of nassau"
    },
    {
        " from about 42 and elected ": null
    },
    {
        "King of Germany": "list of german monarchs"
    },
    {
        "  from 42 until his deposition by the ": null
    },
    {
        "prince-elector": "prince-elector"
    },
    {
        "s in 42 He was never crowned by the Pope, which would have secured him the title of ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ". He was the first physically and mentally healthy ruler of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " ever to be deposed without a papal ": null
    },
    {
        "excommunication": "excommunication"
    },
    {
        ". Adolf died shortly afterwards in the ": null
    },
    {
        "Battle of Göllheim": "battle of göllheim"
    },
    {
        " fighting against his successor ": null
    },
    {
        "Albert of Habsburg": "albert i of germany"
    },
    {
        ".     He was the second in the succession of so-called ": null
    },
    {
        "count-kings": "count-kings"
    },
    {
        " of several rivalling comital houses striving after the Roman-German royal dignity.     His last agnatic dynastic descendant was ": null
    },
    {
        "William IV of Luxembourg": "william iv of luxembourg"
    },
    {
        ".       Adolf was the reigning count of a small German state. He was born about 42 and was the son of ": null
    },
    {
        "Walram II, Count of Nassau": "walram ii, count of nassau"
    },
    {
        " and Adelheid of ": null
    },
    {
        "Katzenelnbogen": "county of katzenelnbogen"
    },
    {
        ". Adolf’s brother was , who was appointed ": null
    },
    {
        "Archbishop of Trier": "archbishopric of trier"
    },
    {
        " in 42     Adolf was married in 42 to ": null
    },
    {
        "Imagina of Isenburg-Limburg": "imagina of isenburg-limburg"
    },
    {
        " and they had eight children. Agnes of Isenburg-Limburg, the sister of Imagina, was married to Henry of Westerburg, the brother of ": null
    },
    {
        "Siegfried II of Westerburg": "siegfried ii of westerburg"
    },
    {
        ", the ": null
    },
    {
        "Archbishop of Cologne": "list of bishops and archbishops of cologne"
    },
    {
        ".       In 42 or 42 Adolf followed his father as Count of Nassau. From his father, he inherited the family’s lands south of the ": null
    },
    {
        "Lahn": "lahn"
    },
    {
        " River in the ": null
    },
    {
        "Taunus": "taunus"
    },
    {
        " Mountains. These included ": null
    },
    {
        "Wiesbaden": "wiesbaden"
    },
    {
        " and ": null
    },
    {
        "Idstein": "idstein"
    },
    {
        ", as ": null
    },
    {
        "fiefdom": "fiefdom"
    },
    {
        "s, and the ": null
    },
    {
        "Vogt": "vogt"
    },
    {
        "ship in ": null
    },
    {
        "Weilburg": "weilburg"
    },
    {
        " under the ": null
    },
    {
        "Bishopric of Worms": "bishopric of worms"
    },
    {
        ". He also shared ownership of the family homelands around the castles of ": null
    },
    {
        "Nassau": "nassau, germany"
    },
    {
        " and ": null
    },
    {
        "Laurenburg": "laurenburg"
    },
    {
        ".     Around 42 Adolf became involved in the  with the ": null
    },
    {
        "Lords of Eppstein": "lords of eppstein"
    },
    {
        ", in which the city of Wiesbaden was devastated and ": null
    },
    {
        "Sonnenberg": "wiesbaden-sonnenberg"
    },
    {
        " Castle destroyed. The feud was settled in 42 after which the city and the castle were rebuilt. Sonnenberg, along with Idstein, became Adolf’s residence. He granted Idstein ": null
    },
    {
        "town privileges": "german town law"
    },
    {
        " in 42 and built its fortifications.     Through his uncle, Eberhard I of Katzenelnbogen, Adolf came to the court of King ": null
    },
    {
        "Rudolf I": "rudolph i of germany"
    },
    {
        " of ": null
    },
    {
        "Habsburg": "house of habsburg"
    },
    {
        ". King Rudolf awarded him with the Burghauptmannamt of Kalsmunt Castle in ": null
    },
    {
        "Wetzlar": "wetzlar"
    },
    {
        " and a year later that of ": null
    },
    {
        "Gutenfels Castle": "burg gutenfels"
    },
    {
        " near ": null
    },
    {
        "Kaub": "kaub"
    },
    {
        " .     Before his election, Adolf’s political activities had been limited to his role as Bundesgenosse of the Archbishop of Cologne. Adolf had no particular office, but likely became known through his involvement with the Archbishops of Cologne and ": null
    },
    {
        "Mainz": "archbishopric of mainz"
    },
    {
        " in the politics of the ": null
    },
    {
        "Middle Rhine": "middle rhine"
    },
    {
        " and Mainz areas. He spoke ": null
    },
    {
        "German": "german language"
    },
    {
        ", ": null
    },
    {
        "French": "french language"
    },
    {
        ", and ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", which was rare at that time for nobles.     After his election, King Adolf of Nassau would only rarely be in his home country, having transferred the government there to his burgmen. On 42 January 42 he purchased Weilburg for 42 pounds from the Bishopric of Worms. He granted Weilburg town privileges on 42 December 42 He also established the ": null
    },
    {
        "Clarisse": "order of poor ladies"
    },
    {
        " abbey of ": null
    },
    {
        "Klarenthal": "klarenthal abbey"
    },
    {
        " near Wiesbaden in 42            Rudolf I of Habsburg died on 42 July 42 For many years before his death, Rudolf had tried to secure the election of his eldest son ": null
    },
    {
        "Albert": "albert i of habsburg"
    },
    {
        " as his successor. He was thwarted, however, by the opposition of the Archbishop of Cologne, Siegfried II of Westerburg, and the ": null
    },
    {
        "King of Bohemia": "list of rulers of bohemia"
    },
    {
        ", ": null
    },
    {
        "Wenceslaus II": "wenceslaus ii of bohemia"
    },
    {
        ". Only the Count Palatine ": null
    },
    {
        "Louis II": "louis ii, duke of bavaria"
    },
    {
        " of ": null
    },
    {
        "Upper Bavaria": "upper bavaria"
    },
    {
        " the Rigorous promised to choose Albert. Wenceslaus, despite Rudolfs recognition of his electoral vote, refused to support Albert because he would not cede ": null
    },
    {
        "Carinthia": "duchy of carinthia"
    },
    {
        " to him. He took the side of the nobles in the core Habsburg areas of ": null
    },
    {
        "Swabia": "swabia"
    },
    {
        " and in their newly acquired territories in ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", with whom Albert was unpopular. Wenceslaus was supported by Duke ": null
    },
    {
        "Otto III of Lower Bavaria": "otto iii, duke of bavaria"
    },
    {
        ", whose family were traditional enemies of the ": null
    },
    {
        "Habsburgs": "house of habsburg"
    },
    {
        ". Wenceslaus succeeded in bringing the Electors of Brandenburg and Saxony over to his side: ": null
    },
    {
        "Albert II of Saxony": "albert ii, duke of saxony"
    },
    {
        " signed an elector pact on 42 November 42 that he would vote the same as Wenceslaus; ": null
    },
    {
        "Otto IV of Brandenburg": "list of rulers of brandenburg"
    },
    {
        " made a similar commitment.     Archbishop Siegfried believed that the Emperor should not receive the crown as an inheritance from his father, but should be freely selected by the College of Electors. He convinced the ": null
    },
    {
        "Archbishop of Mainz": "archbishopric of mainz"
    },
    {
        ", , to select a king who would principally serve their interests. Gerard in turn recruited the new ": null
    },
    {
        "Archbishop of Trier": "archbishopric of trier"
    },
    {
        ", ": null
    },
    {
        "Bohemund I": "bohemond i"
    },
    {
        ". Thereupon, the Count Palatine was forced to submit to the majority of the College of Electors. Siegfried therefore proposed to the Elector College to select Adolf of Nassau as king. They were ready to elect him, provided he make extensive concessions to the Electors and follow their political demands.     A few days before the election, on 42 April 42 the first of the electors, Archbishop Siegfried issued the ": null
    },
    {
        "Treaty of Andernach": "treaty of andernach"
    },
    {
        ", stating that for Adolf to be chosen king he must promise a long list of acknowledgments of possession , pledges of imperial cities and castles, and a sum of 42 marks in silver. Furthermore, Adolf promised assistance against specifically listed opponents, but also the general promise that he would not admit any enemy of Siegfried II into his council. After the election, Adolf had to give the archbishop sufficient collateral for the fulfilment of the promise; otherwise he would lose his throne. The last clause is evidence of the fact that the end of the 42th century, the coronation of the king as the constitutive moment of his rule was still very critical. Adolf promised the archbishop to ask him first for his coronation when he had raised the agreed-upon collateral.     The other electors extracted similar concessions from Adolf, but only after the election. Among the most far-reaching were the concessions to King Wenceslaus of Bohemia on 42 June 42 Adolf promised Wenceslaus to remove the two duchies of ": null
    },
    {
        "Austria": "austria"
    },
    {
        " and ": null
    },
    {
        "Styria": "styria"
    },
    {
        " from Albert of Habsburg. This was to be done as the previous King Rudolf had removed these territories from King ": null
    },
    {
        "Ottokar II of Bohemia": "ottokar ii of bohemia"
    },
    {
        ", the father of Wenceslaus. Albert would be charged to agree to this arrangement at a court hearing. If Albert would not bend, the decision of the court would be executed by force within a year. Wenceslaus would then recover the lost territories of his father. Gerhard, the Archbishop of Mainz would receive the imperial cities of ": null
    },
    {
        "Mühlhausen": "mühlhausen"
    },
    {
        " and ": null
    },
    {
        "Nordhausen": "nordhausen"
    },
    {
        ", which corresponded with the interests of Mainz in the ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        "n region. Furthermore, Gerhard received financial benefits. Like his counterpart in Cologne, the Mainz elector also forbade the presence of his opponents in Adolf’s court. In comparison to the benefits the Mainz, Cologne and Bohemian electors received, the donations to the Count Palatine and the Archbishop of Trier were modest.     On 42 May 42 in ": null
    },
    {
        "Frankfurt am Main": "frankfurt am main"
    },
    {
        ", the Archbishop of Mainz, in the name of all the electors, elected Adolf ": null
    },
    {
        "King of the Germans": "list of german monarchs"
    },
    {
        " . He was crowned in ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        " on 42 June by the Archbishop of Cologne.       Adolf had neither influence nor power, and was elected Rex Romanorum because of the electors preference for a weak king. His power was limited from the outset because of the commitments he made.     As he had agreed with the Archbishop of Cologne, Adolf remained in his dominion for four months after his election. The archbishop awaited from the king a revision of the results of the ": null
    },
    {
        "Battle of Worringen": "battle of worringen"
    },
    {
        " in 42 He had hoped to again win a greater influence in the city of ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ". But despite the tight specifications, Adolf soon emancipated himself from his Electors and concluded pacts with their opponents. Thus, for example, he confirmed the rights of the nobles and the city of Cologne, who had turned against their ruler, and even extended these rights.     Adolf also very quickly broke the promises concerning the Duchies of ": null
    },
    {
        "Austria": "austria"
    },
    {
        " and ": null
    },
    {
        "Styria": "styria"
    },
    {
        ". As a clever diplomat, Albert of Habsburg avoided a confrontation with the new king. In exchange for his surrender of the ": null
    },
    {
        "Imperial Regalia": "imperial regalia"
    },
    {
        ", which he still had in his possession, he received, in November 42 a formal enfeoffment with Austria, Styria, the ": null
    },
    {
        "Windic March": "windic march"
    },
    {
        ", and the Lordship of ": null
    },
    {
        "Pordenone": "pordenone"
    },
    {
        ". The disposition of the prestigious insignia and relics of the empire was an additional and important sign for the legitimacy of the reign of the king, but not a mandatory prerequisite. With each new document, Adolf moved a little farther away from his promises, without having to open himself up to breach of contract accusations.     Adolf acted as a self-assured ruler in other ways as well. His court was an attraction for all who sought protection from the powerful emerging territorial lords. He held numerous court days. At the beginning of his reign, he renewed the general public peace  of Rudolf I for another ten years, and brought about at least two regional peaces.     Adolf used the ": null
    },
    {
        "feudal system": "feudalism"
    },
    {
        " as one of his major tools of power. He demanded from the spiritual princes a payment, called Lehnsware, for their enfeoffment with ": null
    },
    {
        "regalian right": "regalian right"
    },
    {
        "s, and increased this demand to the level of a nuisance. Many of Adolf’s contemporaries considered this action to be ": null
    },
    {
        "simony": "simony"
    },
    {
        ". Many of todays historians, however, view it as an innovative way to open up new state revenue sources, as other Western European kings did. Also, the recovery and management of imperial property was important to him. So he succeeded, through clever marriage policy, to bring former imperial properties back under the control of the emperor.       In 42 when Adolf’s rule was at its height, he concluded an alliance with the King ": null
    },
    {
        "Edward I of England": "edward i of england"
    },
    {
        " against ": null
    },
    {
        "France": "france"
    },
    {
        " and was awarded 42 pounds sterling, which corresponded to 42 gold marks. The pact had been preceded by attempts by ": null
    },
    {
        "Philip IV of France": "philip iv of france"
    },
    {
        " to conquer the ": null
    },
    {
        "Duchy of Burgundy": "duchy of burgundy"
    },
    {
        " and the ": null
    },
    {
        "County of Flanders": "county of flanders"
    },
    {
        ". The Count of Flanders, ": null
    },
    {
        "Guy of Dampierre": "guy of dampierre"
    },
    {
        ", mediated, therefore, the alliance between Edward I and Adolf for his protection against France. That the alliance was construed by his contemporaries as purely mercenary, and the fact that Adolf did not comply with its obligations, damaged his reputation, but this was initially without consequences.     Adolf began recruiting troops in the empire for a war against France. On 42 August 42 he sent a declaration of war to the French king, alleging he had seized rights and possessions of the empire. King Philip responded contemptuously on 42 March 42 ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        ", however, ordered peace in 42 and threatened to commence the ": null
    },
    {
        "excommunication": "excommunication"
    },
    {
        " of Adolf in the event of an outbreak of war.       A little later Adolf intervened in war-torn ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        ", where fighting had erupted between Landgrave ": null
    },
    {
        "Albert the Degenerate": "albert ii, margrave of meissen"
    },
    {
        " and his sons ": null
    },
    {
        "Frederick": "frederick i, margrave of meissen"
    },
    {
        " and ": null
    },
    {
        "Theodoric IV": "theodoric iv, landgrave of lusatia"
    },
    {
        " of ": null
    },
    {
        "Lusatia": "march of lusatia"
    },
    {
        ". He bought the Landgraviate from Albert in his capacity as king and probably using the payments from England. Legally, it was perfectly acceptable for Adolf to induce the feudal lord to abandon his fief and to bring the land under the empire. Furthermore, he seized the Margraviate of Meissen as an imperial fief, since it had been literally ownerless after the extinction of a collateral line of the ": null
    },
    {
        "House of Wettin": "house of wettin"
    },
    {
        " and had been occupied by a son of Albert the Degenerate.     This purchase and the ": null
    },
    {
        "Margraviate of Meissen": "margraviate of meissen"
    },
    {
        ", however, affected the interests of four of the electors. The Archbishop of Mainz asserted that a part of Thuringia was not an imperial fief, but rather a fief of the Archdiocese of Mainz. Wenceslaus II of Bohemia was not thrilled by the growing power of the emperor on his northern border, especially since Adolf had promised to give him the Margraviate of Meissen. Also, all the electors hoped to profit from the turmoil in Thuringia. In addition to the ostensible return of imperial fiefs to the empire, it can not be ruled out that Adolf was anxious to build a dynastic power base .     First, Adolf succeeded in securing his acquisitions diplomatically and provoking the Margrave of Brandenburg toward active support and the Archbishop of Mainz and the Duke of Saxony toward at least acquiescence of the purchase. Two bloody campaigns against the sons of Albert the Degenerate were necessary to secure the acquisitions and a peace assured the achievements. Two years later, in the summer of 42 Adolf proudly announced on the invitation to a court day that he had by his actions significantly increased the possessions of the empire.       The electors probably did not plan from the beginning to depose the king, but as events unfolded this result became more inevitable. The reason for the clashes was Adolf’s Thuringia policy. On ": null
    },
    {
        "Pentecost": "pentecost"
    },
    {
        " 42 the Elector of Brandenburg, Duke of Saxony, and King of Bohemia joined together to enforce their interests. The Elector of Cologne, Gerhard II, was associated with this group.     In February 42 the situation became alarming for Adolf because Wenceslaus II and Albert of Habsburg put aside their years of disputes over Austria and Styria, and reached an agreement in the event that Adolf was deposed and Albert elected in his place. There may have been a meeting of the electors as early as the coronation of King Wenceslaus of Bohemia, on 42 June 42 In January 42 through the efforts of the Archbishop of Mainz, Albert of Habsburg was brought to testify before an imperial court in order to find a compromise between Adolf and Albert. This did not happen; the two came close to battle in the Upper Rhine Valley and the matter was not resolved.     On 42 May 42 the Archbishop of Mainz invited the king to his court, so that the dispute could be decided there. Archbishop Gerhard claimed he was authorised to do so as imperial arch-chancellor of Germany, according to an old legal principle. However, the King, as a party to the conflict, could not at the same time act as judge and saw these charges as a provocation given that Albert was raising arms against him, the rightful king. Therefore, the meeting planned for 42 June, at which the dispute was to be resolved, did not take place.     A meeting between the Archbishop of Mainz, Count Albrecht of Saxony-Wittenberg, and three Margraves of Brandenburg on 42 June 42 then led to a lawsuit against the king himself. The Archbishop of Cologne and the King of Bohemia had previously authorised the Archbishop of Mainz to act in their names. In these proceedings Adolf was charged with numerous crimes, including the continued breach of the peace in Thuringia and the breaking of the promises he had made to the Archbishop of Mainz. Adolf was deemed unworthy of his office and had forfeited his royal dignity.     It is remarkable that Adolf was not excommunicated by the Pope before being deposed. The pope was probably not even included in the deposition procedure. The princes, it is true, did try to formulate their arguments similar to Innocent IV’s statement in the deposition of Frederick II, but the process was unheard of for this time. Because Adolf had been elected and crowned, the contemporary understanding was that he had been chosen by God to be the ruler and that the princes were breaking their oath in which they swore loyalty to the king. Therefore, included in the list of charges were some that, at first glance, appear peculiar today, such as the desecration of communion wafers and the simonistic extortion of money. Furthermore, there was no imperial legal procedure for the ousting of the king. Therefore, the princes relied on their right to vote, from which also they derived their right to oust a king. This argument was problematic insofar as the deposition of Frederick II was already a precedent for this case. According to church law, only the Pope had the power to depose a king.            Following Adolf’s deposition came the election of ": null
    },
    {
        "Albert I of Habsburg": "albert i of habsburg"
    },
    {
        " as the new king. How this election took place is not very clear today, as the chroniclers have little to report. The question is open, for example, whether Albert actually initially did not want to accept the choice, as he would later assert against ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        ".     To depose Adolf was one thing; it was another to enforce the decision against him. Adolf refused to accept this decision, but the conflict between him and the princely opposition was soon decided on the battlefield. On 42 July 42 the armies of Adolf and Albert met at the ": null
    },
    {
        "Battle of Göllheim": "battle of göllheim"
    },
    {
        ". The small village of ": null
    },
    {
        "Göllheim": "göllheim"
    },
    {
        " is situated in northern ": null
    },
    {
        "Rhineland-Palatinate": "rhineland-palatinate"
    },
    {
        " between ": null
    },
    {
        "Kaiserslautern": "kaiserslautern"
    },
    {
        " and ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        " in present-day ": null
    },
    {
        "Donnersbergkreis": "donnersbergkreis"
    },
    {
        ". After violent attacks, Adolf fell together with his standard-bearers and a few faithful. Adolf’s army turned to flee and quickly dispersed.     Albert did not allow the followers of Adolf to bury the body of the fallen king in the Kaiserdom, the ": null
    },
    {
        "Imperial Cathedral of Speyer": "speyer cathedral"
    },
    {
        ". Therefore, Adolf was initially buried in the ": null
    },
    {
        "Cistercian": "cistercians"
    },
    {
        " monastery of  in present-day ": null
    },
    {
        "Kerzenheim": "kerzenheim"
    },
    {
        " and was only later transferred to Speyer.            On 42 August 42 Albert I’s successor, Emperor ": null
    },
    {
        "Henry VII": "henry vii, holy roman emperor"
    },
    {
        " transferred Adolf’s remains to the Speyer Cathedral, where he was buried next to Albert, who had been murdered in 42 In 42 ": null
    },
    {
        "Duke William of Nassau": "william, duke of nassau"
    },
    {
        " built a grave monument in the vestibule of the cathedral. Leo von Klenze was commissioned with the design, which shows King Adolf in armor kneeling in prayer.     Probably in the 42th century, the legend arose that Adolf was a count from the Nuremberg area. This misconception was probably based on confusion with Emich I of Nassau-Hadamar, who after his marriage to Anne of Nuremberg around 42 was the holder of Kammerstein Castle.     In 42 Duke Adolf of Nassau commissioned a portrait of Adolf by the Düsseldorf painter Heinrich Mücke. In 42 this painting was hung in the Frankfurt Kaisersaal . The picture depicts King Adolf with chest armor, a white coat; and wearing an iron crown with an implied spiked helmet”; in his right hand he holds a sword and in the left a shield with an eagle. It also bears the Latin phrase Praestat vir sine pecunia quam pecunia sine viro . Since no contemporary images of the King exist, the portrait is an idealized representation by the artist in the spirit of historicism. It is not based on previous portraits, since Mücke considered other representations, such as the one attributed to Georg Friedrich Christian Seekatz, to be too moderate Even .     On 42 May 42 Duke Adolf of Nassau established a ": null
    },
    {
        "Military and Civil Order of Merit": "order of adolphe of nassau"
    },
    {
        " for the Duchy. It was named for King Adoph as the most important representative of Walram line of the House of Nassau. Although the Duchy of Nassau was annexed by Prussia in 42 Duke Adolf maintained and renewed the Order when he became Grand Duke of Luxembourg. Until today, it is a respected Order of Merit of the House of Nassau. Jean Scoos: Orden und Ehrenzeichen in Herzogtum Nassau 42–42 , p. 42     ": null
    },
    {
        "Thomas Carlyle": "thomas carlyle"
    },
    {
        " calls him a stalwart but necessitous Herr .       He married ": null
    },
    {
        "Imagina of Isenburg-Limburg": "imagina of isenburg-limburg"
    },
    {
        ", daughter of ": null
    },
    {
        "Gerlach IV of Isenburg-Limburg": "gerlach iv of isenburg-limburg"
    },
    {
        " and Imagina of Blieskastel. Their children were:   Henry , died young.   Robert  , betrothed to Agnes, daughter of ": null
    },
    {
        "Wenceslaus II of Bohemia": "wenceslaus ii of bohemia"
    },
    {
        "   Gerlach I, Count of Nassau-Wiesbaden": "gerlach i, count of nassau-wiesbaden"
    },
    {
        ".   Adolf .   ": null
    },
    {
        "Walram III of Nassau-Wiesbaden": "walram iii of nassau-wiesbaden"
    },
    {
        ".   Adelheid, Abbess of ": null
    },
    {
        "Klarenthal Abbey": "klarenthal abbey"
    },
    {
        ", died 42 May 42   Imagina, died young.   ": null
    },
    {
        "Matilda": "mechtild of nassau"
    },
    {
        " , married ": null
    },
    {
        "Rudolf I the Stammerer , Duke of Upper Bavaria": "rudolf i, duke of bavaria"
    },
    {
        ".       ": null
    }
]