[
    {
        "           Adrastea , also known as , is the second by distance, and the smallest of the four ": null
    },
    {
        "inner moons of Jupiter": "inner satellites of jupiter"
    },
    {
        ". It was discovered in photographs taken by  Voyager  2  in 1979, making it the first ": null
    },
    {
        "natural satellite": "natural satellite"
    },
    {
        " to be discovered from images taken by an interplanetary ": null
    },
    {
        "spacecraft": "spacecraft"
    },
    {
        ", rather than through a telescope. It was officially named after the mythological ": null
    },
    {
        "Adrasteia": "adrasteia"
    },
    {
        ", foster mother of the ": null
    },
    {
        "Greek god": "greek god"
    },
    {
        " Zeus": "zeus"
    },
    {
        "—the equivalent of the ": null
    },
    {
        "Roman god": "roman god"
    },
    {
        " Jupiter": "jupiter"
    },
    {
        ".     Adrastea is one of the few moons in the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        " known to orbit its planet in less than the length of that planets day. It orbits at the edge of ": null
    },
    {
        "Jupiters Main Ring": "rings of jupitermain ring"
    },
    {
        " and is thought to be the main contributor of material to the ": null
    },
    {
        "Rings of Jupiter": "rings of jupiter"
    },
    {
        ". Despite observations made in the 1990s by the ": null
    },
    {
        "Galileo spacecraft": "galileo"
    },
    {
        ", very little is known about the moons physical characteristics other than its size and the fact that it is ": null
    },
    {
        "tidally locked": "tidally locked"
    },
    {
        " to ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        ".            Adrastea was discovered by ": null
    },
    {
        "David C. Jewitt": "david jewitt"
    },
    {
        " and ": null
    },
    {
        "G. Edward Danielson": "g. edward danielson"
    },
    {
        " in  Voyager  2  probe photographs taken on July 8, 1979, and received the designation . Although it appeared only as a dot, it was the first moon to be discovered by an interplanetary spacecraft. Soon after its discovery, two other of the inner ": null
    },
    {
        "moons of Jupiter": "moons of jupiter"
    },
    {
        "  were observed in the images taken a few months earlier by  Voyager  1 . The ": null
    },
    {
        "Galileo spacecraft": "galileo spacecraft"
    },
    {
        " was able to determine the moons shape in 1998, but the images remain poor. In 1983, Adrastea was officially named after the Greek nymph ": null
    },
    {
        "Adrastea": "adrastea"
    },
    {
        ", the daughter of ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " and his lover ": null
    },
    {
        "Ananke": "ananke"
    },
    {
        ".     Although the  Juno  orbiter, which arrived at Jupiter in 2016, has a camera called ": null
    },
    {
        "JunoCam": "junocam"
    },
    {
        ", it is almost entirely focused on observations of Jupiter itself. However, if all goes well should be able to capture some limited images of the Jupiter moons ": null
    },
    {
        "Metis": "metis"
    },
    {
        " and Adrastea.  Hansen, C. J.; Orton, G. S. American Geophysical Union 12/2015               Adrastea has an irregular shape and measures 20×16×14  km across. A surface area estimate would be between 840 and 1,600 km 2 . This makes it the smallest of the four inner moons. The bulk, composition and mass of Adrastea are not known, but assuming that its mean density is like that of ": null
    },
    {
        "Amalthea": "amalthea"
    },
    {
        ", around 0.86  g/cm 3 , its mass can be estimated at about 2  kg. Amaltheas density implies that the moon is composed of water ": null
    },
    {
        "ice": "ice"
    },
    {
        " with a ": null
    },
    {
        "porosity": "porosity"
    },
    {
        " of 10–15%, and Adrastea may be similar.     No surface details of Adrastea are known, due to the low resolution of available images.       Adrastea is the smallest and second-closest member of the ": null
    },
    {
        "inner Jovian satellite family": "inner satellites of jupiter"
    },
    {
        ". It orbits ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " at a radius of about 129,000  km at the exterior edge of the planets ": null
    },
    {
        "Main Ring": "rings of jupitermain ring"
    },
    {
        ". Adrastea is one of only three moons in the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        " known to orbit its planet in less than the length of that planets day—the other two being Jupiters innermost moon ": null
    },
    {
        "Metis": "metis"
    },
    {
        ", and ": null
    },
    {
        "Mars": "mars"
    },
    {
        " moon ": null
    },
    {
        "Phobos": "phobos"
    },
    {
        ". The orbit has very small ": null
    },
    {
        "eccentricity": "orbital eccentricity"
    },
    {
        " and ": null
    },
    {
        "inclination": "inclination"
    },
    {
        "—around 0.0015 and 0.03°, respectively. Inclination is relative to the equator of Jupiter.     Due to ": null
    },
    {
        "tidal locking": "tidal locking"
    },
    {
        ", Adrastea rotates synchronously with its orbital period, keeping one face always looking toward the planet. Its long axis is aligned towards Jupiter, this being the lowest energy configuration.     The orbit of Adrastea lies inside ": null
    },
    {
        "Jupiters": "jupiter"
    },
    {
        " synchronous orbit": "synchronous orbit"
    },
    {
        " radius , and as a result, ": null
    },
    {
        "tidal forces": "tidal deceleration"
    },
    {
        "are slowly causing its orbit to decay so that it will one day impact Jupiter. If its density is similar to Amaltheas then its orbit would actually lie within the fluid ": null
    },
    {
        "Roche limit": "roche limit"
    },
    {
        ". However, since it is not breaking up, it must still lie outside its rigid Roche limit.     Adrastea is the second-fastest-moving of Jupiters moons, with an orbital speed of 31.378  km/s.       Adrastea is the largest contributor to material in ": null
    },
    {
        "Jupiters rings": "rings of jupiter"
    },
    {
        ". This appears to consist primarily of material that is ejected from the surfaces of ": null
    },
    {
        "Jupiters four small inner satellites": "inner satellites of jupiter"
    },
    {
        " by meteorite impacts. It is easy for the impact ejecta to be lost from these satellites into space. This is due to the satellites low density and their surfaces lying close to the edge of their ": null
    },
    {
        "Roche sphere": "roche sphere"
    },
    {
        "s.     It seems that Adrastea is the most copious source of this ring material, as evidenced by the densest ring  being located at and within Adrasteas orbit. More precisely, the orbit of Adrastea lies near the outer edge of Jupiters Main Ring. The exact extent of visible ring material depends on the phase angle of the images: in ": null
    },
    {
        "forward-scattered light": "light scattering"
    },
    {
        " Adrastea is firmly outside the Main Ring, but in ": null
    },
    {
        "back-scattered light": "backscatter"
    },
    {
        " there appears to also be a narrow ringlet outside Adrasteas orbit.       ": null
    }
]