[
    {
        "Adûnaic  is one of ": null
    },
    {
        "the fictional languages": "languages constructed by j. r. r. tolkien"
    },
    {
        " devised by ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        " for his fantasy works.     One of the ": null
    },
    {
        "languages of Arda": "languages of arda"
    },
    {
        " in Tolkiens ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        " legendarium": "tolkiens legendarium"
    },
    {
        ", Adûnaic was spoken by the ": null
    },
    {
        "Men": "man"
    },
    {
        " of ": null
    },
    {
        "Númenor": "númenor"
    },
    {
        " during the ": null
    },
    {
        "Second Age": "second age"
    },
    {
        ".          Adûnaic derived from the closely related Bëorian and Hadorian dialects of ": null
    },
    {
        "Taliska": "taliska"
    },
    {
        ", the language spoken by the first and third houses of the ": null
    },
    {
        "Edain": "edain"
    },
    {
        " when they first entered ": null
    },
    {
        "Beleriand": "beleriand"
    },
    {
        " during the ": null
    },
    {
        "First Age": "first age"
    },
    {
        " . This language seems to have primarily been a ": null
    },
    {
        "creole": "creole language"
    },
    {
        " of the ": null
    },
    {
        "Dwarvish": "dwarf"
    },
    {
        " Khuzdul": "khuzdul"
    },
    {
        " and some ": null
    },
    {
        "Avarin": "avarin"
    },
    {
        " dialects, and it is almost wholly unclear which parts of its vocabulary and structure were purely Mannish in origin, though the answer is probably very little. It is stated that ": null
    },
    {
        "Finrod Felagund": "finrod felagund"
    },
    {
        " was able to quickly master Taliska purely by determining the various changes undergone by its Avarin component from ": null
    },
    {
        "Primitive Quendian": "primitive quendian"
    },
    {
        ", and ": null
    },
    {
        "Faramir": "faramir"
    },
    {
        " stated that all languages of Men are of Elvish descent, suggesting that Taliska and Adûnaic are in fact Quendian/Avarin with some Khuzdul influence . Once the Edain settled in Beleriand, they eagerly learned ": null
    },
    {
        "Sindarin": "sindarin"
    },
    {
        " from its ": null
    },
    {
        "Grey Elven": "sindar"
    },
    {
        " inhabitants, but retained their own tongue, probably whilst borrowing and adapting many Sindarin words to it. By the end of the First Age, Taliska had developed into a language that served as the basis for Adûnaic, the vernacular tongue of the Númenóreans, as well as the languages of the ": null
    },
    {
        "Rohirrim": "rohan people"
    },
    {
        " and the Men of ": null
    },
    {
        "Dale": "dale"
    },
    {
        ".     In Númenor, Adûnaic was the language used in day-to-day affairs by the majority of the population . Its corpus, already a varied mixture of Khuzdul, Avarin, and Sindarin, was probably now exposed more heavily to the influence of ": null
    },
    {
        "Quenya": "quenya"
    },
    {
        "  and possibly even ": null
    },
    {
        "Valarin": "valarin"
    },
    {
        ", both due to regular contact with ": null
    },
    {
        "Aman": "aman"
    },
    {
        ". When the Númenóreans began to establish trading ports on the western shores of Middle-earth, Adûnaic mingled with the languages of various groups of Edain who had not travelled to Númenor, and the resulting trade language quickly spread throughout ": null
    },
    {
        "Eriador": "eriador"
    },
    {
        " and its neighbours, laying the foundation for the later Common Speech.     Following the ": null
    },
    {
        "Akallabêth": "akallabêth"
    },
    {
        ", the surviving ": null
    },
    {
        "Elendili": "elendili"
    },
    {
        " who established the kingdoms of ": null
    },
    {
        "Arnor": "arnor"
    },
    {
        " and ": null
    },
    {
        "Gondor": "gondor"
    },
    {
        " shunned Adûnaic in favour of Sindarin due to the associations of the former with the tyrannical Ar-Pharazôn and his followers the ": null
    },
    {
        "Kings Men": "kings men"
    },
    {
        ". Neglected by the Faithful, Adûnaic remained the language of the common people throughout most of the west of Middle-earth, and by the time of the ": null
    },
    {
        "War of the Ring": "war of the ring"
    },
    {
        " at the end of the ": null
    },
    {
        "Third Age": "third age"
    },
    {
        ", it had developed into the various dialects of ": null
    },
    {
        "Westron": "westron"
    },
    {
        ".     Although classical Adûnaic was not spoken after the Akallabêth, surviving groups of the Kings Men  who served and worshipped ": null
    },
    {
        "Sauron": "sauron"
    },
    {
        "  continued to speak a debased form of the language as recently as the War of the Ring at the end of the Third Age.     Very few words of Adûnaic are known, though those that are borrow heavily from various Elven languages. Adûnaic also seems to conform to a variant of the consonantal root system used in ": null
    },
    {
        "Khuzdul": "khuzdul"
    },
    {
        " . It is also one of perhaps only two or three of Tolkiens languages known to possess ": null
    },
    {
        "noun classes": "noun classes"
    },
    {
        ", which roughly correspond to four grammatical genders.       Although Tolkien created very few original words in Adûnaic, mostly names, the language serves his concept of a ": null
    },
    {
        "lingua franca": "lingua franca"
    },
    {
        " for ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        ", a shared language for many different people. This lingua franca is ": null
    },
    {
        "Westron": "westron"
    },
    {
        ", which developed out of Adûnaic, the language of the culturally and politically influential Númenóreans.      Tolkien devised Adûnaic , the language spoken in ": null
    },
    {
        "Númenor": "númenor"
    },
    {
        ", shortly after World War II, and thus at about the time he completed  The Lord of the Rings , but before he wrote the linguistic   background information of the Appendices.   Adûnaic is intended as the language from which ": null
    },
    {
        "Westron": "westron"
    },
    {
        "  is derived.   This added a depth of historical development to the Mannish languages.   Adûnaic was intended to have a faintly Semitic flavour .     Its development began with  The Notion Club Papers  . It is there that the most extensive sample of the language is found, revealed to one of the protagonists, Lowdham, of that story in a visionary dream of ": null
    },
    {
        "Atlantis": "atlantis"
    },
    {
        ". Its grammar is sketched in the unfinished Lowdhams Report on the Adunaic Language .     Tolkien remained undecided whether the language of the Men of Númenor should be derived from the original Mannish language , or if it should be derived from the Elvish Noldorin  instead.  The Peoples of Middle-earth , p. 42   In  The Lost Road and Other Writings  it is implied that   the Númenóreans spoke Quenya, and that ": null
    },
    {
        "Sauron": "sauron"
    },
    {
        ", hating all things Elvish, taught the Númenóreans the old Mannish tongue they themselves had forgotten. The Lost Road and Other Writings , p. 42 and note p. 42       :     :   Adûnaic is fundamentally a three-vowel language, with a length distinction; the long and are derived from diphthongs and , as is the case in Hebrew and in most Arabic dialects , in line with the Semitic flavour that Tolkien intended for both Adûnaic and Khuzdul, which influenced it.       Most information about Adûnaic grammar comes from an incomplete typescript Lowdhams Report on the Adûnaic Language, written by Tolkien to accompany the The Notion Club Papers. The report discusses phonology and morphological processes in some detail, and starts to discuss nouns, but breaks off before saying much about verbs, other parts of speech or the grammar as a whole. It appears that Tolkien abandoned work on the language after writing this portion of the Report, and never returned to it.       Most nouns are triconsonantal, but there are a number of biconsontantal nouns as well. Nouns can be divided into three declensions, called Strong I, Strong II and Weak. The two strong declensions form their various cases by modifying the last vowel, similarly to English man/men. The weak declension forms its cases by appending a suffix.     There are three numbers, singular, plural and dual. Dual is used mainly for natural pairs , like eyes and shoes. There are three cases, Normal, Subjective and Objective. The Subjective case is used as the subject of a verb. The Objective case is used only in compound expressions and appears only in the singular. The Normal case is used in all other circumstances, such as the object of a verb.     Example declensions:         This Adûnaic text, part of the tale of the Fall of Numenor, appears in The Notion Club Papers. It is fragmentary because it appeared in a dream to the character Lowdham, and is only partially translated by him because he did not know the language. Words in bold are not translated at the point in the text where the translation is first given, but their translation is given later in the story.     Kadō zigūrun zabathān unakkha ... ēruhīnim   and so Sauron humbled he-came ... Children of God     dubdam ugru-dalad ... ar-pharazōnun azaggara   fell shadow-under ... Ar-Pharazon was warring     avalōiyada ... bārim an-adūn yurahtam dāira   against Powers ... Lords of-West broke Earth     sāibēth-mā ēruvō ... azrīya du-phursā akhāsada   assent-with God-from ... seas so-as-to-gush into chasm     ... anadūnē zīrān hikallaba ... bawība dulgī   ... Numenor beloved she-fell down ... winds black     ... balīk hazad an-nimruzīr azūlada   ... ships seven of-Elendil eastward     Agannālō burōda nēnud ... zāira nēnud   Death-shadow heavy on-us ... longing on-us     ... adūn izindi batān tāidō ayadda: īdō kātha batīna lōkhī   ... west straight road once went now all roads crooked     Ēphalak īdōn Yōzāyan   far away now Land-of-Gift     ": null
    }
]