[
    {
        "         Afonso III , or Affonso , Alfonso or Alphonso  or Alphonsus , the Boulonnais , ": null
    },
    {
        "King of Portugal": "list of portuguese monarchs"
    },
    {
        "  was the first to use the title King of Portugal and the Algarve , from 1249. He was the second son of King ": null
    },
    {
        "Afonso II of Portugal": "afonso ii of portugal"
    },
    {
        " and his wife, ": null
    },
    {
        "Urraca of Castile": "urraca of castile, queen of portugal"
    },
    {
        "; he succeeded his brother, King ": null
    },
    {
        "Sancho II of Portugal": "sancho ii of portugal"
    },
    {
        ", who died on 4 January 1248.        Afonso was born in ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        ". As the second son of King ": null
    },
    {
        "Afonso II of Portugal": "afonso ii of portugal"
    },
    {
        ", he was not expected to inherit the throne, which was destined to go to his elder brother Sancho.      He lived mostly in France, where he married Matilda, the heiress of ": null
    },
    {
        "Boulogne": "boulogne-sur-mer"
    },
    {
        ", in 1238, thereby becoming ": null
    },
    {
        "Count of Boulogne": "count of boulogne"
    },
    {
        ", ": null
    },
    {
        "Mortain": "mortain"
    },
    {
        ", ": null
    },
    {
        "Aumale": "aumale"
    },
    {
        " and ": null
    },
    {
        "Dammartin-en-Goële": "dammartin-en-goële"
    },
    {
        "  jure uxoris .              In 1246, conflicts between his brother, the king, and the church became unbearable. In 1247, ": null
    },
    {
        "Pope Innocent IV": "pope innocent iv"
    },
    {
        " ordered Sancho II to be removed from the throne and to be replaced by the Count of Boulogne. Afonso, of course, did not refuse the papal order and consequently marched to Portugal. Since Sancho was not a popular king the order was not hard to enforce, and he fled in exile to Toledo, Castile, where he died on 4 January 1248. Until his brothers death and his own eventual coronation, Afonso retained and used the title of Visitador, Curador e Defensor do Reino .      In order to ascend the throne Afonso abdicated his rights to the county of Boulogne in 1248. In 1253, he divorced Matilde in order to marry ": null
    },
    {
        "Beatrice of Castile": "beatrice of castile"
    },
    {
        ", illegitimate daughter of ": null
    },
    {
        "Alfonso X, King of Castile": "alfonso x of castile"
    },
    {
        ", and ": null
    },
    {
        "Mayor Guillén de Guzmán": "mayor guillén de guzmán"
    },
    {
        ".      Determined not to make the same mistakes as his brother, Afonso III paid special attention to what the middle class, composed of merchants and small land owners, had to say. In 1254, in the city of ": null
    },
    {
        "Leiria": "leiria"
    },
    {
        ", he held the first session of the  Cortes , a general assembly comprising the nobility, the middle class and representatives of all ": null
    },
    {
        "municipalities": "municipalities"
    },
    {
        ". He also made laws intended to restrain the upper classes from abusing the least favored part of the population. Remembered as a notable administrator, Afonso III founded several towns, granted the title of city to many others and reorganized public administration.      Afonso showed extraordinary vision for the time. Progressive measures taken during his kingship include: representatives of the commons, besides the nobility and clergy, were involved in governance; the end of preventive arrests such that henceforward all arrests had to be first presented to a judge to determine the detention measure; and fiscal innovation, such as negotiating extraordinary taxes with the mercantile classes and direct taxation of the Church, rather than debasement of the coinage. These may have led to his excommunication by the holy see and possibly precipitated his death, and his son ": null
    },
    {
        "Deniss": "denis of portugal"
    },
    {
        "premature rise to the throne at only 18 years old.      Secure on the throne, Afonso III then proceeded to make war with the Muslim communities that still thrived in the south. In his reign the ": null
    },
    {
        "Algarve": "algarve"
    },
    {
        " became part of the kingdom, following the capture of ": null
    },
    {
        "Faro": "faro, portugal"
    },
    {
        ".        Following his success against the Moors, Afonso III had to deal with a political situation concerning the countrys borders with Castile. The neighbouring kingdom considered that the newly acquired lands of the Algarve should be Castilian, not Portuguese, which led to a series of wars between the two kingdoms. Finally, in 1267, the ": null
    },
    {
        "Treaty of Badajoz ": "treaty of badajoz"
    },
    {
        " was signed in ": null
    },
    {
        "Badajoz": "badajoz"
    },
    {
        ", determining that the southern border between Castile and Portugal should be the River ": null
    },
    {
        "Guadiana": "guadiana"
    },
    {
        ", as it is today.      Afonso died in ": null
    },
    {
        "Alcobaça": "alcobaça"
    },
    {
        ", ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        " or ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ", aged 68.       Afonsos first wife was ": null
    },
    {
        "Matilda II, Countess of Boulogne": "matilda ii, countess of boulogne"
    },
    {
        ", daughter of ": null
    },
    {
        "Renaud, Count of Dammartin": "renaud, count of dammartin"
    },
    {
        ", and ": null
    },
    {
        "Ida, Countess of Boulogne": "ida, countess of boulogne"
    },
    {
        ". They had no surviving children. He divorced Matilda in 1253 and, in the same year, married ": null
    },
    {
        "Beatrice of Castile": "beatrice of castile"
    },
    {
        ", illegitimate daughter of ": null
    },
    {
        "Alfonso X, King of Castile": "alfonso x of castile"
    },
    {
        ", and ": null
    },
    {
        "Mayor Guillén de Guzmán": "mayor guillén de guzmán"
    },
    {
        ".            ": null
    }
]