[
    {
        "            Afonso II , or Affonso , Alfonso or Alphonso  or Alphonsus , nicknamed the Fat , ": null
    },
    {
        "King of Portugal": "list of portuguese monarchs"
    },
    {
        ", was born in ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        " on 23 April 1185 and died on 25 March 1223 in the same city. He was the second but eldest surviving son of ": null
    },
    {
        "Sancho I of Portugal": "sancho i of portugal"
    },
    {
        " by his wife, ": null
    },
    {
        "Dulce": "dulce of aragon"
    },
    {
        ",  Infanta  of ": null
    },
    {
        "Aragon": "crown of aragon"
    },
    {
        ". Afonso succeeded his father on 27 March 1211.          As a king, Afonso II set a different approach of government. Hitherto, his father Sancho I and his grandfather ": null
    },
    {
        "Afonso I": "afonso i of portugal"
    },
    {
        " were mostly concerned with military issues either against the neighbouring ": null
    },
    {
        "Kingdom of Castile": "kingdom of castile"
    },
    {
        " or against the ": null
    },
    {
        "Moorish": "moors"
    },
    {
        " lands in the south. Afonso did not pursue territory enlargement policies and managed to ensure peace with Castile during his reign. Despite this, some towns, like ": null
    },
    {
        "Alcácer do Sal": "alcácer do sal"
    },
    {
        " in 1217, were conquered from the Moors by the private initiative of noblemen. This does not mean that he was a weak or somehow cowardly man. The first years of his reign were marked instead by internal disturbances between Afonso and his brothers and sisters. The king managed to keep security within Portuguese borders only by outlawing and exiling his kin.     Since military issues were not a government priority, Afonso established the states administration and centralized power on himself. He designed the first set of Portuguese written laws. These were mainly concerned with ": null
    },
    {
        "private property": "private property"
    },
    {
        ", civil justice, and ": null
    },
    {
        "minting": "mint"
    },
    {
        ". Afonso also sent ambassadors to European kingdoms outside the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " and began amicable commercial relations with most of them.     Other reforms included the always delicate matters with the pope. In order to get the independence of Portugal recognized by Rome, his grandfather, Afonso I, had to legislate an enormous number of privileges to the Church. These eventually created a state within the state. With Portugals position as a country firmly established, Afonso II endeavoured to weaken the power of the clergy and to apply a portion of the enormous revenues of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " to purposes of national utility. These actions led to a serious diplomatic conflict between the pope and Portugal. After being ": null
    },
    {
        "excommunicated": "excommunicated"
    },
    {
        " for his audacities by ": null
    },
    {
        "Pope Honorius III": "pope honorius iii"
    },
    {
        ", Afonso II promised to make amends to the church, but he died in Coimbra on 25 March 1223 before making any serious attempts to do so.           King Afonso was buried originally at the ": null
    },
    {
        "Monastery of Santa Cruz": "monastery of santa cruz"
    },
    {
        " in Coimbra where his body remained for nearly ten years. His remains were transferred subsequently to ": null
    },
    {
        "Alcobaça Monastery": "alcobaça monastery"
    },
    {
        ", as he had stipulated in his will. He and his wife, Queen Urraca, were buried at its Royal Pantheon.               In 1206, he married his fourth cousin Infanta ": null
    },
    {
        "Urraca of Castile": "urraca of castile, queen of portugal"
    },
    {
        ", daughter of ": null
    },
    {
        "Alfonso VIII of Castile": "alfonso viii of castile"
    },
    {
        " and ": null
    },
    {
        "Eleanor of England": "eleanor of england, queen of castile"
    },
    {
        ", both being descendants of King ": null
    },
    {
        "Alfonso VI of León": "alfonso vi of león"
    },
    {
        ". The offspring of this marriage were:     ": null
    },
    {
        "Infante Sancho": "sancho ii of portugal"
    },
    {
        " , succeeded his father as Sancho II, 4th ": null
    },
    {
        "King of Portugal": "king of portugal"
    },
    {
        "; ": null
    },
    {
        "Infante Afonso": "afonso iii of portugal"
    },
    {
        " , succeeded his brother Sancho as Afonso III, 5th ": null
    },
    {
        "King of Portugal": "king of portugal"
    },
    {
        "; ": null
    },
    {
        "Infanta Leonor": "leonor of portugal, queen of denmark"
    },
    {
        " . Married ": null
    },
    {
        "Valdemar the Young": "valdemar the young"
    },
    {
        ", son of ": null
    },
    {
        "Valdemar II of Denmark": "valdemar ii of denmark"
    },
    {
        " and Margaret of Bohemia, daughter of ": null
    },
    {
        "Ottokar I of Bohemia": "ottokar i of bohemia"
    },
    {
        ";   ": null
    },
    {
        "Infante Fernando": "fernando, lord of serpa"
    },
    {
        " , Lord of ": null
    },
    {
        "Serpa": "serpa"
    },
    {
        " and married to Sancha Fernández de Lara with whom he had no issue. He was the father of an illegitimate son, Sancho Fernandes, prior of Santo Estêvão of Alfama.     Out of wedlock, he had two illegitimate sons:   João Afonso , buried in the Alcobaça monastery; ": null
    },
    {
        "Faro": "faro, portugal"
    },
    {
        " in 1249. He had an illegitimate daughter named Constança Peres. ": null
    }
]