[
    {
        "         Afrikaner Calvinism is a cultural and religious development among ": null
    },
    {
        "Afrikaner": "afrikaner"
    },
    {
        "s that combined elements of seventeenth-century ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " doctrine with a chosen people ideology based in the Bible. It had origins in ideas espoused in the Old Testament of the ": null
    },
    {
        "Jews as the chosen people": "jews as the chosen people"
    },
    {
        ".     A number of modern studies have argued that Boers gathered for the ": null
    },
    {
        "Great Trek": "great trek"
    },
    {
        " inspired by this concept, and they used it to legitimise their subordination of other South African ethnic groups. It is thought to have contributed the religious basis for modern ": null
    },
    {
        "Afrikaner nationalism": "afrikaner nationalism"
    },
    {
        " and  apartheid . Dissenting scholars have asserted that Calvinism did not play a significant role in Afrikaner society until after they suffered the trauma of the ": null
    },
    {
        "Second Boer War": "second boer war"
    },
    {
        ". Early settlers dwelt in isolated frontier conditions and lived much closer to pseudo-Christian ": null
    },
    {
        "animist": "animist"
    },
    {
        " beliefs than organised religion.         White settlement in ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        " is traced to the 42 arrival of the ": null
    },
    {
        "Dutch East India Company": "dutch east india company"
    },
    {
        " at the ": null
    },
    {
        "Cape of Good Hope": "cape of good hope"
    },
    {
        ", seeking to establish a supply and refreshment station for its ships and crews bound to and from India. From its headquarters in ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", the Company recruited crew and equipped voyages for the Orient. Most of its Dutch employees were Protestant Calvinists, who were the majority of the population in the region, supplemented by other Protestants: Lutheran Germans, Scandinavians, and numerous French ": null
    },
    {
        "Huguenot": "huguenot"
    },
    {
        " refugees who had fled religious persecution in France. Among their Afrikaner descendants, individual religious communities such as the Doppers became known for establishing their own doctrine in rifts with the ": null
    },
    {
        "Nederduitse Gereformeerde Kerk": "dutch reformed church in south africa"
    },
    {
        " . By the late nineteenth century, the separatist churches of ": null
    },
    {
        "Gereformeerde Kerk": "reformed churches in south africa"
    },
    {
        " had developed in South Africa.       The Dutch settlement of the ": null
    },
    {
        "Cape of Good Hope": "cape of good hope"
    },
    {
        " was the first colonial success in South Africa. The Company established strict rules for trade between the settlement and the native population. Only a Company administrator could authorize trade or ": null
    },
    {
        "Christian missionary": "christian missionary"
    },
    {
        " ventures among the Africans. Settlers were forbidden from stealing or shooting ": null
    },
    {
        "cattle": "cow"
    },
    {
        ", which were a form of wealth and sustainability for the Africans. The early Europeans were shocked by the differences in the customs, clothing and appearance of the Africans. False rumours that the natives were cannibals reinforced the motive to avoid unnecessary contact. The Cape was a walled garden, with Africa on the outside and Europe within. This strict order minimised conflicts with the Africans during the early settlement period.     But many settlers believed they had a had arrived with a missionary motive, which included spreading the superiority of European culture. These factors contributed to the settler practice of indenturing the native Khoisan population to serve as workers and servants. Within that master/servant relationship, the Europeans would teach to teach the Bible to them in hope that the message would filter back through the servants family and thus bring about conversion.     The farmers who lived outside the physical walls of the towns had a different arrangement with natives than did than the townspeople. To them, occupation meant ownership, and ownership implied the right to protect their property. As they settled into the seemingly unoccupied territories surrounding the Cape, they enforced their assumptions about ownership and its rights against the wandering hunters or herding tribes who crossed the ": null
    },
    {
        "Fish River": "fish river, eastern cape"
    },
    {
        " into farm territories. The settlers considered the farms to be an extension beyond the towns of the separation between the white and the black occupants of the land. As in the towns, ": null
    },
    {
        "plantation": "plantation"
    },
    {
        " slavery": "slavery"
    },
    {
        " was used as a vehicle of ": null
    },
    {
        "evangelism": "evangelism"
    },
    {
        " to the enslaved.     Separation and rules of exchange were opposed very early in the Afrikaner mind to invasion and conquest. And, this ": null
    },
    {
        "anti-imperialism": "anti-imperialism"
    },
    {
        " extended also to the theory of missionary obligation that developed within the ": null
    },
    {
        "Dutch Reformed Church": "dutch reformed church"
    },
    {
        ": the ": null
    },
    {
        "kingdom of God": "kingdom of god"
    },
    {
        " will grow within the sphere of influence assigned to the church by divine providence, as children are taught the Gospel by their parents and family. If God deems it fitting for the Gospel to be received by the natives, and taught to their children, then this is his glory. Toward that end, Christians have a defining role given them from God, a calling, or covenantal responsibility as Gods people, to keep themselves pure in the faith and just in their dealings with the heathen, and to be absolutely unyielding in their protection of what has been legitimately claimed in the name of the ": null
    },
    {
        "Triune God": "trinity"
    },
    {
        ".       This history is essential to understanding the distinctive concept of calling that developed among the Afrikaners. These attitudes, very early adopted, went with them through later conflicts, formed in a way that seemed to them obviously crafted by the hand of God Himself. They believed themselves preserved by Gods own wisdom and ": null
    },
    {
        "Providence": "divine providence"
    },
    {
        ". The things they suffered, and the strong bonds between them that were formed through it all, seemed to confirm this idea at every turn. Their history as a people has a central place in forming the Boer religion. In this way, a distinctive folk character became attached to their Calvinistic beliefs.     This ": null
    },
    {
        "folk religion": "folk religion"
    },
    {
        " was not articulated in a formal way. It was the experience of the Afrikaners, which they interpreted through their assurance that their absolutely sovereign Creator and Lord had shown special grace to them as a particular people.       However, the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " brought these habits of thought more self-consciously to the surface. France invaded the Republic of the United Provinces in January 42 the Stadtholder fled to England and asked the British Government to send the Navy to take care of the possessions of the United East Indies Company that was in dire financial straits and in which he had a huge stake. The British took care of the ": null
    },
    {
        "Cape of Good Hope": "cape of good hope"
    },
    {
        " in 42 and handed it back to the Batavian Republic after the Peace of Amiens. For about a year and a half, Enlightenment ideas were promoted by Janssens and De Mist, including changes in church government. In 42 the British Navy invaded the Cape of Good Hope on its own, and appointed British land administrators there, who were zealous propagators of the Enlightenment. They loosened the trade and labour regulations, speaking of the blacks as noble savages whose untainted natural souls they professed to admire. The British Government outlawed slavery in the British Empire in 42 They called the blacks equals, and gave them access to the courts in suit against white landowners. And, they professed to believe in their own autonomous ": null
    },
    {
        "Reason": "reason"
    },
    {
        " above all else.     A more antithetical message could hardly be imagined, as the English Enlightenment found itself with the Afrikaners for the first time. From the Boer point of view, the Enlightenment invaded their shores, seized their properties, annexed their farms, imposed alien laws, liberated their slaves without compensation, justified these actions by appeal to Reason alone, and claimed in all of this to be more virtuous than their God. They were exposed to the Enlightenment, and it appeared to them to be a revolution against their God and way of life.         During the Great Trek, many people, mostly from the eastern part of the Cape Colony, went north, to areas not under control of the government of the British Crown Colony. Because the Cape Dutch Reformed Church was seen by the trekkers as being an agent of the Cape government, they also did not trust its ministers and emissaries, seeing them as attempts by the Cape government to regain political control. There were also religious divisions among the trekkers themselves. A minister from the Netherlands, ": null
    },
    {
        "Dirk Van der Hoff": "dirk van der hoff"
    },
    {
        " went to the Transvaal in 42 and became a minister in the ": null
    },
    {
        "Nederduitsch Hervormde Kerk": "nederduitsch hervormde kerk"
    },
    {
        ", which was constituted in 42 and in 42 recognised as the State Church of the ": null
    },
    {
        "South African Republic": "south african republic"
    },
    {
        ", separate from the Cape Church.     Meanwhile, back in the Netherlands, the Dutch State church had also been transformed by the Enlightenment, a change represented in the minds of those opposed it, by the loss of any meaningful profession of faith as requisite for adult church members, and the singing of hymns and other innovations in worship and doctrine. In the Netherlands a movement grew in reaction to this perceived dismantlement of Biblical faith. It was called the Afscheiding, in which the Rev. Hendrik de Cock separated himself from the State Church in 42 in Ulrum, Groningen. There was also a movement called the ": null
    },
    {
        "Reveil": "reveil"
    },
    {
        " , supported by those who did not separate from the State Church, like ": null
    },
    {
        "Guillaume Groen van Prinsterer": "guillaume groen van prinsterer"
    },
    {
        ", whose writings became known in South Africa. And much later the leader of another schism called the ": null
    },
    {
        "Doleantie": "doleantie"
    },
    {
        ", ": null
    },
    {
        "Abraham Kuyper": "abraham kuyper"
    },
    {
        ", began to become known to the Afrikaners. Highly critical of the Enlightenment, the revolution as they called it, the Doleantie in the church had counterparts in education and in politics. The timing of this influence was significant, coming on the crest of a wave of evangelical revival, the Reveil in the Dutch Reformed Church which had been led in South Africa by the Scottish preacher, ": null
    },
    {
        "Andrew Murray": "andrew murray"
    },
    {
        ". The slogan of the Doleantie, which eventually rang with unintended nationalist nuance for the Afrikaners was, Separation is Strength .       In the South African Dutch Reformed Church in Transvaal, the more conservative party  were opposed to singing some hymns in church. They asked the Afgescheiden Gereformeerde Kerk in the Netherlands to provide them with a minister. The Rev. ": null
    },
    {
        "Dirk Postma": "dirk postma"
    },
    {
        " came from Zwolle to the South African Republic in 42 and was accepted as a minister of the Hervormde Kerk, but on learning that he and his congregation could be required to sing hymns , he and the Doppers, numbering about 42 adults, among whom was the ": null
    },
    {
        "South African Republic": "south african republic"
    },
    {
        "s President ": null
    },
    {
        "Paul Kruger": "paul kruger"
    },
    {
        ", broke away from the state church to form the ": null
    },
    {
        "Gereformeerde Kerk": "gereformeerde kerk"
    },
    {
        " in Rustenburg in February 42 There were thus now three Dutch Reformed Churches in South Africa – the Afrikaner Nederduits Gereformeerde Kerk , the Boer ": null
    },
    {
        "Nederduitsch Hervormde Kerk": "nederduitsch hervormde kerk"
    },
    {
        ", which was the State Church of the South African Republic, and the Boer ": null
    },
    {
        "Gereformeerde Kerk": "gereformeerde kerk"
    },
    {
        ", the smallest of the three, led by Rev. Postma.     The originally contemptuous name, Dopper, may come from the Dutch domp  for their opposition to candles and other innovations in worship, perhaps representing their contempt for the Enlightenment; or, Dopper may originate from Dutch dop , perhaps on account of their strong opposition to small, individual communion cups.     The ": null
    },
    {
        "separatism": "separatism"
    },
    {
        " of the Doppers, expressed in the severity of their doctrine, the austere ": null
    },
    {
        "puritanism": "religious fanaticism"
    },
    {
        " of their worship, and even in their distinctive dress and speech, set them in stark contrast to European influence. Nevertheless, the Doppers were symbolic of resistance to all things English in South Africa, and despite their small size and distinctiveness they were culturally sophisticated and disproportionately influential during and after the Great Trek. It was the Dopper church that established ": null
    },
    {
        "Potchefstroom University": "potchefstroom university"
    },
    {
        ".     ": null
    },
    {
        "Boer Republic": "boer republic"
    },
    {
        "s which arose after the Great Trek needed a comprehensive philosophy upon which to organise a puritanical Boer society. ": null
    },
    {
        "Paul Kruger": "paul kruger"
    },
    {
        ", first president of the ": null
    },
    {
        "South African Republic": "south african republic"
    },
    {
        " upon its reacquired independence after the brief British annexation, adopted the Calvinstic principles in its political form, and formulated a cultural mandate based on the Voortrekkers conviction that they had a special calling from God, not unlike the people of Israel in the Bible. The Doppers waged an intellectual war against the perceived influx of ": null
    },
    {
        "uitlander": "uitlander"
    },
    {
        " culture which was flooding into the Transvaal through the mass settlements of foreign immigrants lured by gold and diamonds.       The ": null
    },
    {
        "Boer War": "boer war"
    },
    {
        "s had left many of the Afrikaners utterly destitute. The ruined farmers were seen in the hundreds, following the war, lining the highways selling produce by the basket. After the four South African colonies united politically into the ": null
    },
    {
        "Union of South Africa": "union of south africa"
    },
    {
        " and relinquished control to democratic elections, a small, anonymous group of young intellectuals called the ": null
    },
    {
        "Afrikaner Broederbond": "afrikaner broederbond"
    },
    {
        ", formed in the years following the ": null
    },
    {
        "Second Anglo-Boer War": "second anglo-boer war"
    },
    {
        " to discuss strategies for addressing the overwhelming social problem of poor whites and other Afrikaner interests. By the account of ": null
    },
    {
        "Irving Hexham": "irving hexham"
    },
    {
        ", according to ": null
    },
    {
        "Klaus Venter": "klaus venter"
    },
    {
        " and ": null
    },
    {
        "Hendrick Stoker": "hendrik g. stoker"
    },
    {
        " who were themselves disgruntled members of the secret organisation, in 42 the Broederbond moved to Potchefstroom University, asking that the school would take over leadership of the then-struggling group. That year, the Broederbond formally adopted the Calvinist philosophy based on the work of Abraham Kuyper. The Broederbond believed, with deep-rooted conviction, that what their past had provided them through the interpretation of faith was a model of anti-imperialism, self-discipline and responsibility, which in the end would preserve justice for all – blacks, coloured, and whites – against Communist deceit. These strategies that arose from the Broederbond were directly responsible for the establishment of ": null
    },
    {
        "apartheid": "apartheid"
    },
    {
        ", in 42     After the ": null
    },
    {
        "Sharpeville massacre": "sharpeville massacre"
    },
    {
        " in 42 under enormous international pressure, the Broederbond began a slow and quiet re-examination of their policy proposals. And yet no significant changes took place to reform the apartheid system until the ": null
    },
    {
        "Soweto": "soweto"
    },
    {
        " riots in 42 Some time after this, the Broederbond declared apartheid an irreformable failure and began work to dismantle it. The conviction had finally become established, although not universally that, if the Afrikaner people, language and religion were to survive, they must take the initiative to emerge from the laager, and invite South Africa in. The Broederbond  began proposing initiatives for land reform and the reversal of apartheid.       The reversal of apartheid has cast the ": null
    },
    {
        "Nederduits Gereformeerde Kerk": "nederduits gereformeerde kerk"
    },
    {
        " into a period of change. While remaining confessionally Calvinist, the religious character of the church is now less cohesive and more difficult to assess. Having been thoroughly conflated with apartheid, historic Calvinism appears to have fallen out of favour. ": null
    },
    {
        "Liberation theology": "liberation theology"
    },
    {
        ", which embraces the Enlightenment idea of Revolution, has gained a foothold in some quarters, and appears to have advocates both the left and right ends of the political spectrum. American-style evangelicalism and ": null
    },
    {
        "Arminianism": "arminianism"
    },
    {
        " also appear to have made inroads, which with its more individualistic emphasis has less potential for a full-scale civil religion. Certainly the old synthesis of revealed and ": null
    },
    {
        "natural theology": "natural theology"
    },
    {
        " is largely repudiated; officially at least. But, the folk religion of the Afrikaners is not dead. Some scholars and revisionist historians are attempting to draw lines of distinction between Calvinism per se, the history of the Afrikaners, and the civil religion of the apartheid regime in particular.     In 42 42% of ": null
    },
    {
        "Afrikaners": "afrikaners"
    },
    {
        " were members of Reformed Churches. By late 42 this figure had dropped to 42%, while actual weekly church attendance of Reformed Churches is estimated to be around 42%.": null
    }
]