[
    {
        "           Afro Celt Sound System is a musical group who fuse ": null
    },
    {
        "electronic music": "Electronic Music"
    },
    {
        " with traditional ": null
    },
    {
        "Irish": "Irish Traditional Music"
    },
    {
        " and ": null
    },
    {
        "West African": "Music Of West Africa"
    },
    {
        " music. Afro Celt Sound System was formed in 1995 by producer-guitarist ": null
    },
    {
        "Simon Emmerson": "Simon Emmerson"
    },
    {
        ", and feature a wide range of guest artists.  In 2003 they temporarily changed their name to Afrocelts before reverting to their original name.     Their albums have been released through ": null
    },
    {
        "Peter Gabriels": "Peter Gabriel"
    },
    {
        " Real World Records": "Real World Records"
    },
    {
        ",  and they have frequently performed at ": null
    },
    {
        "WOMAD": "Womad"
    },
    {
        " festivals worldwide. Their sales on the label are exceeded only by Gabriel himself. Their recording contract with Real World was for five albums, of which Volume 5: Anatomic was the last.      After a number of festival dates in 2007, the band went on hiatus. In 2010, they regrouped to play a number of shows , releasing a re-mastered retrospective titled Capture.      On 20 May 2014 Afro Celt Sound System announced the upcoming release of a new album, Born.  In January 2016, a posting to that website revealed that due to a dispute with Emmerson, who announced his departure from the band in 2015, there were two active versions of the band, a version led by Emmerson and a separate line-up headed by ": null
    },
    {
        "James McNally": "James Mcnally"
    },
    {
        " and ": null
    },
    {
        "Martin Russell": "Martin Russell"
    },
    {
        ". Emmersons version of the band released the album The Source in 2016.  The dispute ended on 21 December 2016, with an announcement on social media.       The inspiration behind the project dates back to 1991, when Simon Emmerson, a ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        "-nominated British ": null
    },
    {
        "producer": "Record Producer"
    },
    {
        " and guitarist, collaborated with Afro-pop star ": null
    },
    {
        "Baaba Maal": "Baaba Maal"
    },
    {
        ". While making an album with Maal in Senegal, Emmerson was struck by the similarity between one African melody and a traditional Irish air. Back in London, Irish musician ": null
    },
    {
        "Davy Spillane": "Davy Spillane"
    },
    {
        " told Emmerson about a belief that nomadic Celts lived in Africa or India before they migrated to Western Europe. Whether or not the theory was true, Emmerson was intrigued by the two countries musical affinities.     In an experiment that would prove successful, Emmerson brought two members of Baaba Maals band together with traditional Irish musicians to see what kind of music the two groups would create. Adding a dash of modern sound, Emmerson also brought in English dance mixers for an electronic beat. People thought I was mad when I touted the idea, Emmerson told Jim Carroll of  The Irish Times . At the time, I was out of favour with the London club scene. I was broke and on income support but the success was extraordinary .      Jamming in the studios at Real World, musician Peter Gabriels recording facilities in ": null
    },
    {
        "Wiltshire, England": "Wiltshire, England"
    },
    {
        ", the diverse group of musicians recorded the basis of their first album in one week. This album,  Volume 1: Sound Magic , was released by Real World Records in 1996, and marked the debut of the Afro Celt Sound System.     Prior to that first album being made, none of us knew if it would work, musician James McNally told Larry Katz of the Boston Herald. We were strangers who didnt even speak the same language. But we were bowled over by this communication that took place beyond language.  McNally, who grew up second-generation Irish in London, played whistles, keyboards, piano, ": null
    },
    {
        "bodhran": "Bodhran"
    },
    {
        ", and bamboo flute.     Sound Magic has now sold over 300,000 copies. The band performed at festivals, raves, and dance clubs and regularly included two African musicians, Moussa Sissokho on talking drum and djembe and ": null
    },
    {
        "NFaly Kouyate": "Nfaly Kouyate"
    },
    {
        " on vocals, ": null
    },
    {
        "kora": "Kora"
    },
    {
        " and ": null
    },
    {
        "balafon": "Balafon"
    },
    {
        ".     Just as the second album was getting off the ground, one of the groups core musicians, 27-year-old ": null
    },
    {
        "keyboardist": "Keyboardist"
    },
    {
        " Jo Bruce": "Jo Bruce"
    },
    {
        " , died suddenly of an ": null
    },
    {
        "asthma": "Asthma"
    },
    {
        " attack. The band was devastated, and the album was put on hold. Then Irish pop star ": null
    },
    {
        "Sinéad OConnor": "Sinéad Oconnor"
    },
    {
        " came to the rescue, collaborating with the band and helping them cope with their loss. blew into the studio on a windy November night and blew away again leaving us something incredibly emotional and powerful, McNally told Katz. We had this track we didnt know what to do with. Sinéad scribbled a few lyrics and bang! She left us completely choked up.  So taken was the band with OConnors song, Release, that they used the name for the title of their album.  Volume 2: Release  hit the music stores in 1999, and by the spring of 2000 it had sold more than half a million copies worldwide.     In 2000 the group was nominated for a ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        " in the Best World Music category. The band, composed at the time of eight members from six countries , took pride in its ability to bring people together through music. We can communicate anywhere at any corner of the planet and feel that were at home, McNally told Patrick MacDonald of ": null
    },
    {
        "The Seattle Times": "The Seattle Times"
    },
    {
        ". Were breaking down categories of world music and rock music and black music. We leave a door open to communicate with each others traditions. And its changed our lives .     In 2001 the group released ": null
    },
    {
        "Volume 3: Further in Time": "Volume 3: Further In Time"
    },
    {
        ", which climbed to number one on Billboards Top World Music Albums chart. Featuring guest spots by Peter Gabriel and Robert Plant , the album also incorporated a heightened African sound. On the first two records, the pendulum swung more toward the Celtic, London club side of the equation, Emmerson told the Irish Timess Carroll. For this one, we wanted to have more African vocals and input than wed done before. Again the Afro Celt Sound System met with success. Chuck Taylor of Billboard magazine praised the album as a cultural phenomenon that bursts past the traditional boundaries of contemporary music. The single When Youre Falling , with vocals by Gabriel, became a radio hit in the United States.     In 2003, for the ": null
    },
    {
        "Seed": "Seed"
    },
    {
        " album, they changed their name to Afrocelts. They reverted to the longer band name for their subsequent albums, ": null
    },
    {
        "Pod": "Pod"
    },
    {
        ", a compilation of new mixes of songs from the first four albums, ": null
    },
    {
        "Volume 5: Anatomic": "Volume 5: Anatomic"
    },
    {
        " , and ": null
    },
    {
        "Capture - Afro Celt Sound System 1995-2010": "Capture - Afro Celt Sound System 1995-2010"
    },
    {
        " .     They played a number of shows to promote Volume 5: Anatomic in 2006 and summer 2007, ending with a gig in Korea,  before taking an extended break to work on side projects, amongst them  The Imagined Village  featuring Simon Emmerson and Johnny Kalsi. Starting in the summer of 2010, the band performed a series of live shows to promote a new 2-CD album,  Capture - Afro Celt Sound System 1995-2010 , released on 6 September 2010 on Real World Records. Further performances continue to the present day, and a new album-in-progress titled Born was announced on their website in 2014. Following the split , Emmersons version of the band released the album The Source in 2016.         During 2015, the band had split into two formations, one of them including ": null
    },
    {
        "Simon Emmerson": "Simon Emmerson"
    },
    {
        ", ": null
    },
    {
        "NFaly Kouyate": "Nfaly Kouyate"
    },
    {
        " and ": null
    },
    {
        "Johnny Kalsi": "Johnny Kalsi"
    },
    {
        ", the other one ": null
    },
    {
        "James McNally": "James Mcnally"
    },
    {
        " and ": null
    },
    {
        "Martin Russell": "Martin Russell"
    },
    {
        ". The split was announced on the bands website in January 2016.  The dispute officially ended with an announcement on social media on 21 December 2016. Simon Emmerson, James McNally and Martin Russell are pleased to announce that they have been able to set aside their differences and come to an amicable agreement to bring their dispute to an end. Going forward, McNally, Russell and Emmerson have agreed that Emmerson will continue to perform as Afro Celt Sound System and McNally and Russell will work under a new name to be announced in due course.   While McNally, Russell and Emmerson will no longer be performing or working together they recognise, and are grateful for each others contribution to Afro Celt Sound System over the past two decades and will be working with the extensive community of musicians that make up the long standing Afro Celt Sound System family.        When Afro Celt Sound System formed in the mid-1990s during the ": null
    },
    {
        "Real World": "Real World Records"
    },
    {
        " Recording Week, the difference between a guest artist and a band member was virtually non-existent. However, over time, a combination of people became most often associated with the name Afro Celt Sound System . The divided grouping of the band into two versions, both operating under the name Afro Celt Sound System, began in January 2016 and was resolved in December 2016 after McNally and Russell agreed to work under a different name from Emmerson.     ": null
    },
    {
        "Simon Emmerson": "Simon Emmerson"
    },
    {
        " NFaly Kouyate": "Nfaly Kouyate"
    },
    {
        " Johnny Kalsi": "Johnny Kalsi"
    },
    {
        " Griogair Labhruidh": "Griogair Labhruidh"
    },
    {
        " Ronan Browne": "Ronan Browne"
    },
    {
        " Davy Spillane": "Davy Spillane"
    },
    {
        "     Russell/McNally version ": null
    },
    {
        "Martin Russell": "Martin Russell"
    },
    {
        " James McNally": "James Mcnally"
    },
    {
        " Dav Daheley": "Dav Daheley"
    },
    {
        "     Other musicians who have performed or recorded with Afro Celt Sound System include: ": null
    },
    {
        "Jimmy Mahon": "Jimmy Mahon"
    },
    {
        ", Demba Barry, ": null
    },
    {
        "Babara Bangoura": "Babara Bangoura"
    },
    {
        ", ": null
    },
    {
        "Iarla Ó Lionáird": "Iarla Ó Lionáird"
    },
    {
        ", ": null
    },
    {
        "Peter Gabriel": "Peter Gabriel"
    },
    {
        ", ": null
    },
    {
        "Robert Plant": "Robert Plant"
    },
    {
        ", ": null
    },
    {
        "Pete Lockett": "Pete Lockett"
    },
    {
        ", ": null
    },
    {
        "Sinéad OConnor": "Sinéad Oconnor"
    },
    {
        ", ": null
    },
    {
        "Pina Kollar": "Pina Kollar"
    },
    {
        ", ": null
    },
    {
        "Dorothee Munyaneza": "Dorothee Munyaneza"
    },
    {
        ", ": null
    },
    {
        "Sevara Nazarkhan": "Sevara Nazarkhan"
    },
    {
        ", ": null
    },
    {
        "Simon Massey": "Simon Massey"
    },
    {
        ", ": null
    },
    {
        "Jesse Cook": "Jesse Cook"
    },
    {
        ", ": null
    },
    {
        "Martin Hayes": "Martin Hayes"
    },
    {
        ", ": null
    },
    {
        "Eileen Ivers": "Eileen Ivers"
    },
    {
        ", ": null
    },
    {
        "Mundy": "Mundy"
    },
    {
        ", ": null
    },
    {
        "Mairéad Ní Mhaonaigh": "Mairéad Ní Mhaonaigh"
    },
    {
        " and ": null
    },
    {
        "Ciarán Tourish": "Ciarán Tourish"
    },
    {
        " of ": null
    },
    {
        "Altan": "Altan"
    },
    {
        ", ": null
    },
    {
        "Ronan Browne": "Ronan Browne"
    },
    {
        ", ": null
    },
    {
        "Michael McGoldrick": "Michael Mcgoldrick"
    },
    {
        ", ": null
    },
    {
        "Myrdhin": "Myrdhin"
    },
    {
        ", ": null
    },
    {
        "Shooglenifty": "Shooglenifty"
    },
    {
        ", ": null
    },
    {
        "Mairead Nesbitt": "Mairead Nesbitt"
    },
    {
        ", ": null
    },
    {
        "Nigel Eaton": "Nigel Eaton"
    },
    {
        ", ": null
    },
    {
        "Davy Spillane": "Davy Spillane"
    },
    {
        ", ": null
    },
    {
        "Jonas Bruce": "Jonas Bruce"
    },
    {
        ", ": null
    },
    {
        "Heather Nova": "Heather Nova"
    },
    {
        ", ": null
    },
    {
        "Julie Murphy": "Julie Murphy"
    },
    {
        " and ": null
    },
    {
        "Ayub Ogada": "Ayub Ogada"
    },
    {
        ", Ross Ainslie.           Volume 1: Sound Magic     Volume 2: Release     Volume 3: Further in Time     Seed     Pod     Volume 5: Anatomic    Capture    The Source   Flight     They also recorded the soundtrack for the PC game  Magic and Mayhem ": null
    }
]