[
    {
        "        In ": null
    },
    {
        "Greek mythology": "Greek Mythology"
    },
    {
        ", Agamemnon  was a king of ": null
    },
    {
        "Mycenae": "Mycenae"
    },
    {
        ", the son of King ": null
    },
    {
        "Atreus": "Atreus"
    },
    {
        " and Queen ": null
    },
    {
        "Aerope": "Aerope"
    },
    {
        " of ": null
    },
    {
        "Mycenae": "Mycenae"
    },
    {
        ", the brother of ": null
    },
    {
        "Menelaus": "Menelaus"
    },
    {
        ", the husband of ": null
    },
    {
        "Clytemnestra": "Clytemnestra"
    },
    {
        " and the father of ": null
    },
    {
        "Iphigenia": "Iphigenia"
    },
    {
        ", ": null
    },
    {
        "Electra": "Electra"
    },
    {
        " or ": null
    },
    {
        "Laodike": "Laodice"
    },
    {
        " , ": null
    },
    {
        "Orestes": "Orestes"
    },
    {
        " and ": null
    },
    {
        "Chrysothemis": "Chrysothemis"
    },
    {
        ". ": null
    },
    {
        "Homer": "Homer"
    },
    {
        ", Iliad 9:145. Legends make him the king of Mycenae or ": null
    },
    {
        "Argos": "Argos"
    },
    {
        ", thought to be different names for the same area.  When ": null
    },
    {
        "Helen": "Helen Of Troy"
    },
    {
        ", the wife of Menelaus, was taken to ": null
    },
    {
        "Troy": "Troy"
    },
    {
        " by ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", Agamemnon commanded the united Greek armed forces in the ensuing ": null
    },
    {
        "Trojan War": "Trojan War"
    },
    {
        ".     Upon Agamemnons return from Troy, he was killed  by ": null
    },
    {
        "Aegisthus": "Aegisthus"
    },
    {
        ", the lover of his wife Clytemnestra. In old versions of the story, the scene of the murder, when it is specified, is usually the house of Aegisthus, who has not taken up residence in Agamemnons palace, and it involves an ambush and the deaths of Agamemnons followers as well. Aeschylus , Choephori; introduction by A. F. Garvie, Oxford University Press, p. x In some later versions, Clytemnestra herself does the killing, or they act together as accomplices, killing Agamemnon in his own home.       His name in Greek, Ἀγαμέμνων, means very steadfast , unbowed . The word comes from Ἀγαμέδμων from ἄγαν, very much and ": null
    },
    {
        "μέδομαι": "Wikt:Μέδομαι"
    },
    {
        ", think on . ": null
    },
    {
        "R. S. P. Beekes": "Robert S. P. Beekes"
    },
    {
        ", Etymological Dictionary of Greek, Brill, 2009, p. 8.       ": null
    },
    {
        "Atreus": "Atreus"
    },
    {
        ", Agamemnons father, murdered the sons of his twin brother ": null
    },
    {
        "Thyestes": "Thyestes"
    },
    {
        " and fed them to Thyestes after discovering Thyestes ": null
    },
    {
        "adultery": "Adultery"
    },
    {
        " with his wife Aerope. Thyestes fathered ": null
    },
    {
        "Aegisthus": "Aegisthus"
    },
    {
        " with his own daughter, ": null
    },
    {
        "Pelopia": "Pelopia"
    },
    {
        ", and this son vowed gruesome revenge on Atreus children. Aegisthus successfully murdered Atreus and restored his father to the throne. Aegisthus took possession of the throne of Mycenae and jointly ruled with Thyestes. During this period, Agamemnon and his brother, ": null
    },
    {
        "Menelaus": "Menelaus"
    },
    {
        ", took refuge with ": null
    },
    {
        "Tyndareus": "Tyndareus"
    },
    {
        ", King of ": null
    },
    {
        "Sparta": "Sparta"
    },
    {
        ". There they respectively married Tyndareus daughters ": null
    },
    {
        "Clytemnestra": "Clytemnestra"
    },
    {
        " and Helen. Agamemnon and Clytemnestra had four children: one son, ": null
    },
    {
        "Orestes": "Orestes"
    },
    {
        ", and three daughters, ": null
    },
    {
        "Iphigenia": "Iphigenia"
    },
    {
        ", ": null
    },
    {
        "Electra": "Electra"
    },
    {
        " and ": null
    },
    {
        "Chrysothemis": "Chrysothemis"
    },
    {
        ". Menelaus succeeded Tyndareus in Sparta, while Agamemnon, with his brothers assistance, drove out Aegisthus and Thyestes to recover his fathers kingdom. He extended his dominion by conquest and became the most powerful prince in Greece.     Agamemnons family history had been tarnished by ": null
    },
    {
        "murder": "Murder"
    },
    {
        ", ": null
    },
    {
        "incest": "Incest"
    },
    {
        ", and ": null
    },
    {
        "treachery": "Betrayal"
    },
    {
        ", consequences of the heinous crime perpetrated by his ancestor, ": null
    },
    {
        "Tantalus": "Tantalus"
    },
    {
        ", and then of a curse placed upon ": null
    },
    {
        "Pelops": "Pelops"
    },
    {
        ", son of ": null
    },
    {
        "Tantalus": "Tantalus"
    },
    {
        ", by ": null
    },
    {
        "Myrtilus": "Myrtilus"
    },
    {
        ", whom he had murdered. Thus misfortune hounded successive generations of the ": null
    },
    {
        "House of Atreus": "House Of Atreus"
    },
    {
        ", until atoned by ": null
    },
    {
        "Orestes": "Orestes"
    },
    {
        " in a court of justice held jointly by humans and gods.          Agamemnon gathered the reluctant Greek forces to sail for Troy. Preparing to depart from ": null
    },
    {
        "Aulis": "Aulis"
    },
    {
        ", a port in ": null
    },
    {
        "Boeotia": "Boeotia"
    },
    {
        ", Agamemnons army incurred the wrath of the goddess ": null
    },
    {
        "Artemis": "Artemis"
    },
    {
        ". There are several reasons throughout myth for such wrath: in ": null
    },
    {
        "Aeschylus": "Aeschylus"
    },
    {
        " play  Agamemnon , Artemis is angry for the young men who will die at Troy, whereas in ": null
    },
    {
        "Sophocles": "Sophocles"
    },
    {
        "  Electra , Agamemnon has slain an animal sacred to Artemis, and subsequently boasted that he was Artemis equal in hunting. Misfortunes, including a ": null
    },
    {
        "plague": "Plague"
    },
    {
        " and a lack of wind, prevented the army from sailing. Finally, the prophet ": null
    },
    {
        "Calchas": "Calchas"
    },
    {
        " announced that the wrath of the goddess could only be propitiated by the sacrifice of Agamemnons daughter ": null
    },
    {
        "Iphigenia": "Iphigenia"
    },
    {
        ".          Classical dramatizations differ on how willing either father or daughter was to this fate; some include such trickery as claiming she was to be married to ": null
    },
    {
        "Achilles": "Achilles"
    },
    {
        ", but Agamemnon did eventually sacrifice Iphigenia. Her death appeased Artemis, and the Greek army set out for Troy. Several alternatives to the ": null
    },
    {
        "human sacrifice": "Human Sacrifice"
    },
    {
        " have been presented in Greek mythology. Other sources, such as  Iphigenia at Aulis , say that Agamemnon was prepared to kill his daughter, but that Artemis accepted a deer in her place, and whisked her away to Tauris in the ": null
    },
    {
        "Crimean Peninsula": "Crimean Peninsula"
    },
    {
        ". ": null
    },
    {
        "Hesiod": "Hesiod"
    },
    {
        " said she became the goddess ": null
    },
    {
        "Hecate": "Hecate"
    },
    {
        ".     Agamemnon was the ": null
    },
    {
        "commander-in-chief": "Commander-In-Chief"
    },
    {
        " of the Greeks during the Trojan War. During the fighting, Agamemnon killed ": null
    },
    {
        "Antiphus": "Antiphus"
    },
    {
        " and fifteen other Trojan soldiers, according to one source. ": null
    },
    {
        "Hyginus": "Hyginus"
    },
    {
        ",  Fabulae  114. But in the ": null
    },
    {
        "Iliad": "Iliad"
    },
    {
        " itself, hes shown to slaughter hundreds more in Book 11 during his aristea loosely translated to day of glory which is the most similar to Achilles aristea in Book 21 . Even before his aristea, Agamemnon was considered to be one of the three best warriors on the Greek side as proven when Hector challenges any champion of the Greek side to fight him in Book 7, and Agamemnon is one of the three most wished for to face him out of the nine strongest Greek warriors who volunteered. And after they reconciled, even Achilles admits in Book 23 that Agamemnon is the best in strength and in throwing the spear. That claim is further proven by the fact that Agamemnon was the only major warrior on either side never   to need the gods direct intervention to increase his strength or give him any unfair advantages in battle and yet he still caused incredible destruction almost on the scale of Achilles.     The  Iliad  tells the story about the quarrel between Agamemnon and ": null
    },
    {
        "Achilles": "Achilles"
    },
    {
        " in the final year of the war. Following one of the Achaean Armys raids, ": null
    },
    {
        "Chryseis": "Chryseis"
    },
    {
        ", daughter of ": null
    },
    {
        "Chryses": "Chryses"
    },
    {
        ", one of Apollos priests, was taken as a war prize by Agamemnon. Chryses pleaded with Agamemnon to free his daughter but was met with little success. Chryses then prayed to Apollo for the safe return of his daughter, which Apollo responded to by unleashing a plague over the Achaean Army. After learning from the Prophet Calchas that the plague could be dispelled by returning Chryseis to her father, Agamemnon reluctantly agreed  and released his prize. However, as compensation for his lost prize, Agamemnon demanded a new prize. As a result, Agamemnon stole an attractive slave called ": null
    },
    {
        "Briseis": "Briseis"
    },
    {
        ", one of the spoils of war, from Achilles. Homer, Iliad Translated by Robert Fagles, Penguin Classics, 1998     Achilles, the greatest warrior of the age, withdrew from battle in response to Agamemnons action and put the Greek armies at risk of losing the war. Agamemnon, having realized Achilless importance in winning the war against the Trojan Army, sent ambassadors begging for Achilles to return, offering him riches and the hand of his daughter in marriage, but Achilles refused, only being spurred back into action when his closest friend, Patroclus, was killed in battle.     Although not the equal of Achilles in bravery, Agamemnon was a representative of kingly authority . As commander-in-chief, he summoned the princes to the council and led the army in battle. His chief fault was his overwhelming haughtiness; an over-exalted opinion of his position that led him to insult ": null
    },
    {
        "Chryses": "Chryses"
    },
    {
        " and Achilles, thereby bringing great disaster upon the Greeks.     After the capture of Troy, ": null
    },
    {
        "Cassandra": "Cassandra"
    },
    {
        ", the doomed prophetess and daughter of ": null
    },
    {
        "Priam": "Priam"
    },
    {
        ", fell to Agamemnons lot in the distribution of the prizes of war.          After a stormy voyage, Agamemnon and Cassandra either landed in ": null
    },
    {
        "Argolis": "Argolis"
    },
    {
        ", or were blown off course and landed in Aegisthus country. ": null
    },
    {
        "Clytemnestra": "Clytemnestra"
    },
    {
        ", Agamemnons wife, had taken ": null
    },
    {
        "Aegisthus": "Aegisthus"
    },
    {
        ", son of ": null
    },
    {
        "Thyestes": "Thyestes"
    },
    {
        ", as a lover. When Agamemnon came home he was slain by either Aegisthus Homer,  Odyssey  3:266 or Clytemnestra. According to the accounts given by ": null
    },
    {
        "Pindar": "Pindar"
    },
    {
        " and the tragedians, Agamemnon was slain in a bath by his wife alone, a blanket of cloth or a net having first been thrown over him to prevent resistance. Aeschylus, Agamemnon, 1389 Clytemnestra also killed Cassandra. Her jealousy of Cassandra, and her wrath at the sacrifice of Iphigenia and at Agamemnons having gone to war over Helen of Troy, are said to have been the motives for her crime.      Aegisthus and Clytemnestra then ruled Agamemnons kingdom for a time, Aegisthus claiming his right of revenge for Agamemnons father Atreus having fed Thyestes his own children . Agamemnons son ": null
    },
    {
        "Orestes": "Orestes"
    },
    {
        " later avenged his fathers murder, with the help or encouragement of his sister ": null
    },
    {
        "Electra": "Electra"
    },
    {
        ", by murdering Aegisthus and Clytemnestra , thereby inciting the wrath of the ": null
    },
    {
        "Erinyes": "Erinyes"
    },
    {
        " , winged goddesses who tracked down wrongdoers with their hounds noses and drove them to insanity.       ": null
    },
    {
        "Athenaeus": "Athenaeus"
    },
    {
        " tells a tale of how Agamemnon mourned the loss of his friend or lover ": null
    },
    {
        "Argynnus": "Argynnus"
    },
    {
        ", when he drowned in the ": null
    },
    {
        "Cephisus": "Cephissus"
    },
    {
        " river.  He buried him, honored with a tomb and a shrine to ": null
    },
    {
        "Aphrodite": "Aphrodite"
    },
    {
        " Argynnis. The Deipnosophists of Athenaeus of Naucratis , Book XIII Concerning Women, 80D This episode is also found in ": null
    },
    {
        "Clement of Alexandria": "Clement Of Alexandria"
    },
    {
        ", Clement of Alexandria,  Protrepticus  II.38.2 in ": null
    },
    {
        "Stephen of Byzantium": "Stephen Of Byzantium"
    },
    {
        " , and in ": null
    },
    {
        "Propertius": "Propertius"
    },
    {
        ", III with minor variations. Butler, Harold Edgeworth & Barber, Eric Arthur, eds. The Elegies of Propertius. Oxford: Clarendon Press; p. 277     The fortunes of Agamemnon have formed the subject of numerous ": null
    },
    {
        "tragedies": "Tragedy"
    },
    {
        ", ancient and modern, the most famous being the  Oresteia  of ": null
    },
    {
        "Aeschylus": "Aeschylus"
    },
    {
        ". In the legends of the ": null
    },
    {
        "Peloponnesus": "Peloponnesus"
    },
    {
        ", Agamemnon was regarded as the highest type of a powerful monarch, and in ": null
    },
    {
        "Sparta": "Sparta"
    },
    {
        " he was worshipped under the title of  Zeus Agamemnon . His tomb was pointed out among the ruins of Mycenae and at ": null
    },
    {
        "Amyclae": "Amyclae"
    },
    {
        ".     Another account makes him the son of ": null
    },
    {
        "Pleisthenes": "Pleisthenes"
    },
    {
        " , who is said to have been Aeropes first husband.     In works of art, there is considerable resemblance between the representations of ": null
    },
    {
        "Zeus": "Zeus"
    },
    {
        ", king of the gods, and Agamemnon, king of men. He is generally depicted with a ": null
    },
    {
        "sceptre": "Sceptre"
    },
    {
        " and ": null
    },
    {
        "diadem": "Diadem"
    },
    {
        ", conventional attributes of kings.     Agamemnons mare was named Aetha. She was also one of two horses driven by ": null
    },
    {
        "Menelaus": "Menelaus"
    },
    {
        " at the funeral games of ": null
    },
    {
        "Patroclus": "Patroclus"
    },
    {
        ". ": null
    },
    {
        "Pausanias": "Pausanias"
    },
    {
        ". Description of Greece; 5.8.3 ": null
    },
    {
        "Plutarch": "Plutarch"
    },
    {
        ", Amores, 21     Following his death at the hands of Aegisthus, Agamemnon made an appearance in ": null
    },
    {
        "Homers": "Homer"
    },
    {
        " Odyssey within the kingdom of Hades. There, the former king met Odysseus and explained just how he was murdered before he offered Odysseus a warning about the dangers of trusting a woman. Homer, Odyssey": null
    }
]