[
    {
        "   Agatharchides or Agatharchus  of ": null
    },
    {
        "Cnidus": "cnidus"
    },
    {
        " was a ": null
    },
    {
        "Greek": "ancient greece"
    },
    {
        " historian": "historian"
    },
    {
        " and ": null
    },
    {
        "geographer": "geographer"
    },
    {
        " .       Agatharchides is believed to have been born at ": null
    },
    {
        "Cnidus": "cnidus"
    },
    {
        ", hence his appellation. As ": null
    },
    {
        "Stanley M. Burstein": "stanley m. burstein"
    },
    {
        " notes, the evidence for Agatharchides life is meagre. ": null
    },
    {
        "Photius": "photios i of constantinople"
    },
    {
        " describes him as a threptos, a kind of assistant of servile origin, to ": null
    },
    {
        "Cinnaeus": "cinnaeus"
    },
    {
        " and states that he was later a secretary to ": null
    },
    {
        "Heraclides Lembus": "heraclides lembus"
    },
    {
        ". Cinnaeus served as a counselor to ": null
    },
    {
        "Ptolemy VI": "ptolemy vi"
    },
    {
        "; Heraclides is best known for negotiating the treaty that ended ": null
    },
    {
        "Antiochus IV": "antiochus iv"
    },
    {
        "s invasion of ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " in 42 BC.     Agatharchides furnishes few clues about his own life. At the conclusion of his On the Erythraean Sea, he apologizes for being unable to complete his work since our age is unable to similarly bear the toil and as a result of the disturbances in Egypt he could no longer access the official records . There are two possible occasions when this could have happened: the first was in 42 BC, when ": null
    },
    {
        "Ptolemy VIII": "ptolemy viii"
    },
    {
        " purged ": null
    },
    {
        "Alexandria": "alexandria, egypt"
    },
    {
        " of the intellectuals who supported his rivals for the throne; and in 42 BC after Ptolemy, who had been driven from his kingdom by a rebellion in Alexandria, returned and exacted reprisals on that city. While most scholars have favored the later date, Burstein argues for the earlier one.     Extracts from the first book of his Erythraean Sea, written in the first person and advocating a military campaign into the lands south of Egypt, led early scholars to deduce that Agatharchides was an important political figure of his time, and served as a guardian to one of the sons of Ptolemy VIII. ": null
    },
    {
        "Dodwell": "edward dodwell"
    },
    {
        " endeavored to show that it the younger son, Alexander, and objects to ": null
    },
    {
        "Soter": "ptolemy ix lathyros"
    },
    {
        ", that he reigned conjointly with his mother. This, however, was the case with ": null
    },
    {
        "Alexander": "alexander the great"
    },
    {
        " likewise. ": null
    },
    {
        "Wesseling": "henk wesseling"
    },
    {
        " and ": null
    },
    {
        "Henry Fynes Clinton": "henry fynes clinton"
    },
    {
        " think the elder brother to be the one meant, for Soter was more likely to have been a minor on his accession in 42 BC than Alexander in 42 BC, ten years after their fathers death; the second edition of the  Oxford Classical Dictionary  article on Agatharchides agrees that the son was Soter. Moreover, Dodwells date would leave too short an interval between the publication of Agatharchidess work on the ": null
    },
    {
        "Erythraean Sea": "erythraean sea"
    },
    {
        " , and the work of ": null
    },
    {
        "Artemidorus": "artemidorus ephesius"
    },
    {
        ". However at least as early as 42 when ": null
    },
    {
        "B. G. Niebuhr": "b. g. niebuhr"
    },
    {
        " pointed out that these excerpts were from a speech, and not part of the narrative of his book, this theory has been recognized as conflicting with other known historical facts.       Agatharchides was not well known in ancient times. Of his two major works, Affairs in Asia  in ten books, and Affairs in Europe  in forty-nine books, only a few fragments survive, too few to provide us with any sense of the contents of either work. However, for his On the Erythraean Sea  in five books, almost the entire fifth book, a geographical treatise on the ": null
    },
    {
        "Horn of Africa": "horn of africa"
    },
    {
        " and the lands around the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        ", has survived almost intact. According to Burstein, the comparative soberness of Agatharchides treatment compared to previous accounts and the wealth of information contained in it led to a quick recognition . . . a valuable summary of the results of Ptolemaic exploration.     In the first book of On the Erythraean Sea was a discussion respecting the origin of the name. In the fifth Agatharchides described the mode of life amongst the ": null
    },
    {
        "Sabaeans": "sabaeans"
    },
    {
        " in Arabia, and the ": null
    },
    {
        "Ichthyophagi": "ichthyophagi"
    },
    {
        ", or fish-eaters, the way in which ": null
    },
    {
        "elephant": "elephant"
    },
    {
        "s were caught by the elephant-eaters, and the mode of working the gold mines in the mountains of Egypt, near the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        ". His account of the Ichthyophagi and of the mode of working the gold mines, has been copied by ": null
    },
    {
        "Diodorus": "diodorus siculus"
    },
    {
        " . Amongst other extraordinary animals he mentions the ": null
    },
    {
        "camelopard": "camelopard"
    },
    {
        ", which was found in the country of the ": null
    },
    {
        "Troglodytae": "troglodytae"
    },
    {
        ", and the ": null
    },
    {
        "rhinoceros": "rhinoceros"
    },
    {
        ".     Material from this book is quoted directly or indirectly by ": null
    },
    {
        "Diodorus Siculus": "diodorus siculus"
    },
    {
        ", ": null
    },
    {
        "Strabo": "strabo"
    },
    {
        ", ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        ", ": null
    },
    {
        "Aelian": "claudius aelianus"
    },
    {
        " , ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        " Josephus,  Antiquities of the Jews , Book XII, Chapter 42 4242;  Against Apion , Book I, Chapter 42 and other authors. Although Agatharchides work was superseded by more detailed accounts in the 42nd century AD, Photius found a copy of Erythraean Sea in the 42th century, from which he preserved extensive extracts in his Bibliotheca. Photius states that Agatharchides wrote in the ": null
    },
    {
        "Attic dialect": "attic greek"
    },
    {
        ", with a style that was dignified and perspicuous, and abounded in sententious passages—inspiring a favorable opinion from Photius. In the composition of his speeches Agatharchides was an imitator of ": null
    },
    {
        "Thucydides": "thucydides"
    },
    {
        ", whom he equalled in dignity and excelled in clearness. He was acquainted with the language of the Aethiopians , and appears to have been the first who discovered the true cause of the yearly inundations of the ": null
    },
    {
        "Nile": "nile"
    },
    {
        ".     An Agatharchides, of ": null
    },
    {
        "Samos": "samos island"
    },
    {
        ", is mentioned by ": null
    },
    {
        "Plutarch": "plutarch"
    },
    {
        ", as the author of a work on ": null
    },
    {
        "Persia": "persia"
    },
    {
        ", and one περὶ λίθων. ": null
    },
    {
        "J.A. Fabricius": "johann albert fabricius"
    },
    {
        ", however, conjectures that the true reading is ": null
    },
    {
        "Agathyrsides": "agathyrsides"
    },
    {
        ", not Agatharchides.        The crater ": null
    },
    {
        "Agatharchides": "agatharchides"
    },
    {
        " on the ": null
    },
    {
        "Moon": "moon"
    }
]