[
    {
        "     Agnostida is an ": null
    },
    {
        "order": "order"
    },
    {
        " of ": null
    },
    {
        "arthropod": "arthropod"
    },
    {
        " which first developed near the end of the ": null
    },
    {
        "Early Cambrian": "cambrian"
    },
    {
        " period and thrived during the Middle Cambrian. They are present in the ": null
    },
    {
        "Lower Cambrian": "lower cambrian"
    },
    {
        " fossil record along with ": null
    },
    {
        "trilobites": "trilobites"
    },
    {
        " from the ": null
    },
    {
        "Redlichiida": "redlichiida"
    },
    {
        ", ": null
    },
    {
        "Corynexochida": "corynexochida"
    },
    {
        ", and ": null
    },
    {
        "Ptychopariida": "ptychopariida"
    },
    {
        " orders. The last agnostids went ": null
    },
    {
        "extinct": "extinct"
    },
    {
        " in the Late ": null
    },
    {
        "Ordovician": "ordovician"
    },
    {
        ".       The Agnostida are divided into two suborders  — ": null
    },
    {
        "Agnostina": "agnostina"
    },
    {
        " and ": null
    },
    {
        "Eodiscina": "eodiscina"
    },
    {
        "  — which are then subdivided into a number of ": null
    },
    {
        "families": "family"
    },
    {
        ". As a group, agnostids are isopygous, meaning their ": null
    },
    {
        "pygidium": "pygidium"
    },
    {
        " is similar in size and shape to their ": null
    },
    {
        "cephalon": "cephalon"
    },
    {
        ". Most agnostid species were eyeless.     The systematic position of the order Agnostida within the class Trilobita remains uncertain, and there has been continuing debate whether they are trilobites or a ": null
    },
    {
        "stem group": "stem group"
    },
    {
        ". The challenge to the status has focused on Agnostina partly due to the ": null
    },
    {
        "juveniles": "juvenile"
    },
    {
        " of one genus have been found with legs differing dramatically from those of adult trilobites, Müller, K. J. & Walossek, D. : Morphology, ontogeny, and life habit of Agnostus pisiformis from the Upper Cambrian of Sweden . Fossils and Strata, 19, 1-124. suggesting they are not members of the ": null
    },
    {
        "lamellipedia": "lamellipedia"
    },
    {
        "n ": null
    },
    {
        "clade": "clade"
    },
    {
        ", of which trilobites are a part. Instead, the limbs of agnostids closely resemble those of stem group crustaceans, although they lack the ": null
    },
    {
        "proximal endite": "proximal endite"
    },
    {
        ", which defines that group. They are likely the ": null
    },
    {
        "sister taxon": "sister taxon"
    },
    {
        " to the crustacean stem lineage, and, as such, part of the clade, ": null
    },
    {
        "Crustaceomorpha": "crustaceomorpha"
    },
    {
        ". Bergström, J. & Hou, X.G. . Early Palaeozoic non-lamellipedian arthropods . In S. Koenemann & A. J. Ronald , Crustacea and Arthropod Relationships . Taylor and Francis Group. Other researchers have suggested, based on a ": null
    },
    {
        "cladistic": "cladistic"
    },
    {
        " analyses of ": null
    },
    {
        "dorsal": "dorsum"
    },
    {
        " exoskeletal": "exoskeleton"
    },
    {
        " features, that Eodiscina and Agnostida are closely united, and the Eodiscina descended from the trilobite order ": null
    },
    {
        "Ptychopariida": "ptychopariida"
    },
    {
        ". Cotton, T. J. & ": null
    },
    {
        "Fortey, R.A.": "fortey, r.a."
    },
    {
        " . Comparative morphology and relationships of the Agnostida . In S. Koenemann & R. A. Jenner , Crustacea and Arthropod Relationships . Taylor and Francis Group.       Scientists have long debated whether the agnostids lived a ": null
    },
    {
        "pelagic": "pelagic"
    },
    {
        " or a ": null
    },
    {
        "benthic": "benthic"
    },
    {
        " lifestyle. Their lack of eyes, a morphology not well-suited for swimming, and their fossils found in association with other benthic trilobites suggest a benthic mode of life. They are likely to have lived on areas of the ocean floor which received little or no light and fed on ": null
    },
    {
        "detritus": "detritus"
    },
    {
        " which descended from upper layers of the sea to the bottom. Their wide geographic dispersion in the ": null
    },
    {
        "fossil record": "fossil record"
    },
    {
        " is uncharacteristic of benthic animals, suggesting a pelagic existence. The thoracic segment appears to form a hinge between the head and pygidium allowing for a bivalved ": null
    },
    {
        "ostracod": "ostracod"
    },
    {
        "an-type lifestyle. The orientation of the thoracic appendages appears ill-suited for benthic living. Recent work suggests that some agnostids were benthic predators, engaging in cannibalism and possibly pack-hunting behavior. McMenamin, M. A. S. . Cambrian cannibals: agnostid trilobite ethology and the earliest known case of arthropod cannibalism . Geological Society of America Abstracts with Programs, v. 42, no. 5, p. 320.     They are sometimes preserved within the voids of other organisms, for instance within empty ": null
    },
    {
        "hyolith": "hyolith"
    },
    {
        " conchs,  within ": null
    },
    {
        "sponge": "sponge"
    },
    {
        "s, ": null
    },
    {
        "worm tubes": "selkirkia"
    },
    {
        " and under the carapaces of ": null
    },
    {
        "bivalved arthropods": "sidneyia"
    },
    {
        ",  presumably in order to hide from predators or strong storm currents; or maybe whilst scavenging for food. In the case of the tapering worm tubes  Selkirkia ": null
    }
]