[
    {
        "           In ": null
    },
    {
        "Hindu": "hinduism"
    },
    {
        " mythology": "hindu mythology"
    },
    {
        ", Ahalya  also known as  Ahilya, is the wife of the sage ": null
    },
    {
        "Gautama Maharishi": "gautama maharishi"
    },
    {
        ". Many ": null
    },
    {
        "Hindu scriptures": "hindu scriptures"
    },
    {
        " say that she was seduced by ": null
    },
    {
        "Indra": "indra"
    },
    {
        " , cursed by her husband for infidelity, and liberated from the curse by ": null
    },
    {
        "Rama": "rama"
    },
    {
        " .     Created by the god ": null
    },
    {
        "Brahma": "brahma"
    },
    {
        " as the most beautiful of all women, Ahalya was married to the much older Gautama. In the earliest full narrative, when Indra comes disguised as her husband, Ahalya sees through his disguise but nevertheless accepts his advances. Later sources often absolve her of all guilt, describing how she falls prey to Indras trickery. In all narratives, Ahalya and Indra are cursed by Gautama. The curse varies from text to text, but almost all versions describe Rama as the eventual agent of her liberation and ": null
    },
    {
        "redemption": "salvationredemption"
    },
    {
        ". Although early texts describe how Ahalya must atone by undergoing severe ": null
    },
    {
        "penance": "prāyaścitta"
    },
    {
        " while remaining invisible to the world and how she is purified by offering Rama ": null
    },
    {
        "hospitality": "hospitality"
    },
    {
        ", in the popular retelling developed over time, Ahalya is cursed to become a stone and regains her human form after she is brushed by Ramas foot.     Ahalyas seduction by Indra and its repercussions form the central narrative of her story in all scriptural sources for her life. Although the  Brahmana s are the earliest scriptures to hint at her relationship with Indra, the 42th- to 42th-century BCE ": null
    },
    {
        "Hindu epic": "hindu epic"
    },
    {
        "  Ramayana   – whose hero is Rama  – is the first to explicitly mention her extra-marital affair in detail. Medieval story-tellers often focus on Ahalyas deliverance by Rama, which is seen as proof of the saving grace of God. Her story has been retold numerous times in the scriptures and lives on in modern-age poetry and short stories, as well as in dance and drama. While ancient narratives are Rama-centric, contemporary ones focus on Ahalya, telling the story from her perspective. Other traditions deal with her children.     In traditional Hinduism, Ahalya is extolled as the first of the  panchakanya  , ": null
    },
    {
        "archetype": "archetype"
    },
    {
        "s of female ": null
    },
    {
        "chastity": "chastity"
    },
    {
        " whose names are believed to dispel sin when recited. While some praise her loyalty to her husband and her undaunted acceptance of the curse and gender norms, others condemn her ": null
    },
    {
        "adultery": "adultery"
    },
    {
        ".       The word Ahalya can be divided into two parts: a and halya, which ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        " dictionaries define as being related to the plough, ploughing, or deformity. In the Uttar Kanda book of the Ramayana, the god ": null
    },
    {
        "Brahma": "brahma"
    },
    {
        " explains the meaning of the Sanskrit word Ahalya as one without the reprehension of ugliness , or one with an impeccable beauty while telling Indra how he created Ahalya by taking the special beauty of all creation and expressing it in every part of her body. Because some Sanskrit dictionaries translate Ahalya as unploughed,  some recent authors view this as an implicit reference to sexual intercourse and argue that the name refers to a virgin or a motherly figure. This fits the context of the character Ahalya, who is viewed as being in one way or another beyond Indras reach. However, ": null
    },
    {
        "Nobel laureate": "list of nobel laureates"
    },
    {
        " Rabindranath Tagore": "rabindranath tagore"
    },
    {
        " , focusing on the literal meaning of unploughed, interpreted Ahalya as a symbol of stone-like, infertile land that was made cultivable by Rama. ": null
    },
    {
        "Delhi University": "delhi university"
    },
    {
        " professor Bharati Jhaveri concurs with Tagore, interpreting Ahalya as unploughed land, on the basis of the tribal ": null
    },
    {
        "Bhil": "bhil"
    },
    {
        " Ramayana of ": null
    },
    {
        "Gujarat": "gujarat"
    },
    {
        ", an undated oral tradition.       Ahalya is often described as an ayonijasambhava, one not born of a woman. The  Bala Kanda  of the Ramayana mentions that Brahma moulds her with great effort out of pure creative energy . The  Brahma Purana  and the  Vishnudharmottara Purana  also record her creation by Brahma. According to the ": null
    },
    {
        "Mahari": "odissi dancemahari tradition"
    },
    {
        " dance tradition, Brahma created Ahalya out of water as the most beautiful woman in order to break the pride of ": null
    },
    {
        "Urvashi": "urvashi"
    },
    {
        ", the foremost ": null
    },
    {
        "celestial nymph": "apsara"
    },
    {
        ". The tribal Bhil Ramayana begins with the tale of Ahalya, Gautama and Indra. In the tale, Ahalya is created from the ashes of the ": null
    },
    {
        "sacrificial fire": "yajna"
    },
    {
        " by the ": null
    },
    {
        "Saptarishi": "saptarishi"
    },
    {
        " and gifted to Gautama. In contrast, the  Bhagavata Purana  and the  Harivamsa  regard Ahalya as a princess of the ": null
    },
    {
        "Puru Dynasty": "lunar dynasty"
    },
    {
        ", the daughter of King Mudgala and sister of King Divodasa.     In the  Uttara Kanda  book of the Ramayana , Brahma crafts Ahalya as the most beautiful woman and places her in the care of Gautama until she reaches puberty. When that time arrives, the sage returns Ahalya to Brahma, who, impressed by Gautamas sexual restraint and asceticism, bestows her upon him. Indra, who believes that the best women are meant for him, resents Ahalyas marriage to the forest-dwelling ": null
    },
    {
        "ascetic": "tapas"
    },
    {
        ".     The Brahma Purana gives a similar account of Ahalyas birth and initial custody, recording that her marriage was determined through an open contest. Brahma declares that the first being to go around the three worlds  will win Ahalya. Indra uses his magical powers to complete the challenge, finally reaching Brahma and demanding the hand of Ahalya. However, the divine sage ": null
    },
    {
        "Narada": "narada"
    },
    {
        " tells Brahma that Gautama went around the three worlds before Indra. Narada explains that Gautama ": null
    },
    {
        "circumambulated": "parikrama"
    },
    {
        " the wish-bearing cow ": null
    },
    {
        "Surabhi": "kamadhenu"
    },
    {
        " while she gave birth, as part of his daily  puja  , making the cow equal to three worlds according to the  Vedas . Brahma agrees and Ahalya marries Gautama, leaving Indra envious and infuriated. A similar, but shorter, version of Ahalyas early life appears in the  Padma Purana  .     In all versions of the tale, after marrying Gautama, Ahalya settles into his ": null
    },
    {
        "ashram": "ashram"
    },
    {
        " , which generally becomes the site of her epic curse. The Ramayana records that Gautamas ashram is in a forest  near ": null
    },
    {
        "Mithila": "mithila"
    },
    {
        ", where the couple practices asceticism together for several years. In other scriptures, the ashram is usually near the river bank. The Brahma Purana says that it is near the river ": null
    },
    {
        "Godavari": "godavari river"
    },
    {
        " and the  Skanda Purana  places it near the river ": null
    },
    {
        "Narmada": "narmada river"
    },
    {
        ". The Padma Purana and the  Brahma Vaivarta Purana  describe the ashram as near the holy city of ": null
    },
    {
        "Pushkar": "pushkar"
    },
    {
        ".     The 42nd Century CE Tamil epic ": null
    },
    {
        "Manimekalai": "manimekalai"
    },
    {
        " makes a reference to the illicit love of Indra for Ahalya, in the context of Chitrapati advising Udayakumaran the ": null
    },
    {
        "Chola": "chola"
    },
    {
        " prince who is in love with Manimekalai .        The Brahmanas are the oldest scriptures to mention a relationship between Ahalya and Indra in the subrahmanya formula , a chant used by ": null
    },
    {
        "Vedic": "historical vedic religion"
    },
    {
        " priests at the beginning of a ": null
    },
    {
        "sacrifice": "yajnayajnas in the vedas"
    },
    {
        " to invite the main participants: Indra, the gods and the ": null
    },
    {
        "Brahmin": "brahmin"
    },
    {
        "s . The  Jaiminiya Brahmana  and the  Sadvimsha Brahmana  from the ": null
    },
    {
        "Samaveda": "samaveda"
    },
    {
        " tradition, the  Shatapatha Brahmana  and the  Taittiriya Brahmana  from the ": null
    },
    {
        "Yajurveda": "yajurveda"
    },
    {
        " tradition and two  Shrautasutra s  invoke Indra, the lover of Ahalya ... O Kaushika who calls himself Gautama . The Samaveda tradition identifies her as Maitreyi, who the commentator ": null
    },
    {
        "Sayana": "sayana"
    },
    {
        " explains is the daughter of ": null
    },
    {
        "Mitra": "mitra"
    },
    {
        " .     In the subrahmanya formula, Ahalya does not have a husband. The Sadvimsha Brahmana does not explicitly state that Ahalya has a husband, although Kaushika  is present in the story and his relationship to her can be inferred through Indras adoption of the Brahmins form to visit Ahalya. Renate Söhnen-Thieme, research associate at the ": null
    },
    {
        "School of Oriental and African Studies": "school of oriental and african studies"
    },
    {
        ", feels that the Kaushika of the Sadvismha Brahmana is the same individual described as cursing Indra in the 42th- to 42th-century BCE epic  Mahabharata  .     The Shatapatha Brahmanas commentator, Kumarila Bhatta , reasons that the Ahalya–Indra narrative is an allegory for the Sun or the light taking away the shade of night . Edward Washburn Hopkins , an American indologist , interpreted the Ahalya of the subrahmanya formula not as a woman, but literally as yet unploughed land , which Indra makes fertile.         thu   The Bala Kanda of the Ramayana is the earliest text to describe Ahalyas seduction in detail. It states that Indra becomes enamoured by Ahalyas beauty, learns of her husbands absence and comes to the ashram disguised as Gautama to request sexual intercourse with her, praising her as a shapely and slim-waisted woman. She sees through his disguise, but consents owing to her curiosity . According to another interpretation, Ahalyas pride in her beauty compels her. Having satiated his lust, Ahalya requests that Indra, her lover and the best of gods , flee and protect them from Gautamas wrath. The ": null
    },
    {
        "Kathasaritsagara": "kathasaritsagara"
    },
    {
        " is one of the few texts that mirror the Bala Kanda ": null
    }
]