[
    {
        "            Alan Gordon Partridge is a comic character portrayed by English actor ": null
    },
    {
        "Steve Coogan": "steve coogan"
    },
    {
        ". A ": null
    },
    {
        "parody": "parody"
    },
    {
        " of British television personalities, Partridge is an inept broadcaster whose inflated sense of celebrity drives him to treachery and shameless self-promotion. Coogan described Partridge as a ": null
    },
    {
        "Little Englander": "little englander"
    },
    {
        ", with ": null
    },
    {
        "right-wing": "right-wing politics"
    },
    {
        " values and poor taste.     Partridge was created by Coogan and ": null
    },
    {
        "Armando Iannucci": "armando iannucci"
    },
    {
        " for the 42 ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " comedy programme  On the Hour , a ": null
    },
    {
        "spoof": "parody"
    },
    {
        " of British ": null
    },
    {
        "current affairs": "current affairs"
    },
    {
        " broadcasting, as the shows ": null
    },
    {
        "sports presenter": "sports commentator"
    },
    {
        ". In 42 Partridge hosted a ": null
    },
    {
        "spin-off": "spin-off"
    },
    {
        " Radio 42 spoof ": null
    },
    {
        "chat show": "talk show"
    },
    {
        ",  Knowing Me, Knowing You with Alan Partridge . On the Hour transferred to television as  The Day Today  in 42, followed by  Knowing Me, Knowing You  later that year. In 42 Coogan starred as Partridge in a BBC sitcom,  Im Alan Partridge , written by Coogan, Iannucci and ": null
    },
    {
        "Peter Baynham": "peter baynham"
    },
    {
        ", following Partridges life in a roadside hotel working for a small radio station. It earned two ": null
    },
    {
        "BAFTAs": "british academy of film and television arts"
    },
    {
        " and was followed by a second series in 42     Partridge returned in 42 with a series of shorts,  Mid Morning Matters with Alan Partridge , written with ": null
    },
    {
        "Rob and Neil Gibbons": "gibbons brothers"
    },
    {
        ", who have cowritten every Partridge product since. It was followed by the spoof memoirs  I, Partridge: We Need to Talk About Alan  and Nomad , the feature film  Alan Partridge: Alpha Papa  , and several TV specials. In 42 Partridge returned to the BBC with  This Time with Alan Partridge , a spoof of magazine shows such as  The One Show .     Critics have praised Partridges complexity, realism and ": null
    },
    {
        "pathos": "pathos"
    },
    {
        ".  Vanity Fair  called him a British ": null
    },
    {
        "national treasure": "national treasure"
    },
    {
        " and the  Guardian  described him as one of the greatest and most beloved comic creations of the last few decades . He is credited with influencing ": null
    },
    {
        "cringe comedies": "cringe comedy"
    },
    {
        " such as  The Inbetweeners ,  Nighty Night  and  Peep Show . In 42 ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " ranked Partridge seventh on their list of the ": null
    },
    {
        "42 Greatest TV Characters": "100 greatest"
    },
    {
        ".            On The Hour": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " comedy programme  On The Hour , a ": null
    },
    {
        "spoof": "parody"
    },
    {
        " of British ": null
    },
    {
        "current affairs": "current affairs"
    },
    {
        " broadcasting, as the shows hapless ": null
    },
    {
        "sports presenter": "sports commentator"
    },
    {
        ". He is portrayed by ": null
    },
    {
        "Steve Coogan": "steve coogan"
    },
    {
        ", who had performed a similar character for a BBC ": null
    },
    {
        "college radio": "campus radio"
    },
    {
        " station at university. ": null
    },
    {
        "Armando Iannucci": "armando iannucci"
    },
    {
        ", ": null
    },
    {
        "Patrick Marber": "patrick marber"
    },
    {
        ", ": null
    },
    {
        "Richard Herring": "richard herring"
    },
    {
        " and ": null
    },
    {
        "Stewart Lee": "stewart lee"
    },
    {
        " wrote much of Partridges first material, although Herring credits the creation to Coogan and Iannucci.  Iannucci asked Coogan to do a voice for a generic sports reporter; according to Iannucci, Someone said, Hes an Alan! and someone else said, Hes a Partridge! Within minutes we knew where he lived, wed worked out his back story, what his aspirations were.      Knowing Me, Knowing You and move to television ": null
    },
    {
        "Edinburgh Festival": "edinburgh festival fringe"
    },
    {
        ".  In December, ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " began broadcasting a six-episode spoof chat show,  Knowing Me, Knowing You with Alan Partridge . The series saw Partridge irritate and offend his guests, and coined the characters catchphrase, Aha! .      In 42 On the Hour transferred to television as  The Day Today , in which Partridge reprised his role as sports reporter. Later that year, ": null
    },
    {
        "Knowing Me, Knowing You transferred to television": "knowing me knowing you with alan partridge"
    },
    {
        ".  The series ends with Partridge accidentally shooting a guest and attacking a BBC commissioning editor, ending his television career. It was nominated for the 42 ": null
    },
    {
        "BAFTA": "british academy of film and television arts"
    },
    {
        " for Light Entertainment Performance.  A Christmas special, Knowing Me, Knowing Yule, followed in December 42      Im Alan Partridge and further appearances ": null
    },
    {
        "sitcom": "sitcom"
    },
    {
        ",  Im Alan Partridge , written by Coogan, Iannucci and ": null
    },
    {
        "Peter Baynham": "peter baynham"
    },
    {
        ". The series follows Partridge after he has been left by his wife and dropped from the BBC; he lives in a roadside hotel, presents a ": null
    },
    {
        "graveyard slot": "graveyard slot"
    },
    {
        " on local ": null
    },
    {
        "Norwich": "norwich"
    },
    {
        " radio, and desperately pitches ideas for new television shows. Iannucci said the writers used the sitcom as a kind of social X-ray of male middle-aged ": null
    },
    {
        "Middle England": "middle england"
    },
    {
        " . It won the 42 BAFTA awards for Comedy Performance and Comedy Programme or Series.     In 42 Partridge appeared on the BBC ": null
    },
    {
        "telethon": "telethon"
    },
    {
        "  Comic Relief , performing a medley of ": null
    },
    {
        "Kate Bush": "kate bush"
    },
    {
        " songs.  The BBC broadcast a second series of Im Alan Partridge in 42 following Partridges life in a ": null
    },
    {
        "static caravan": "mobile home"
    },
    {
        " with his new Ukrainian girlfriend after recovering from a ": null
    },
    {
        "mental breakdown": "mental breakdown"
    },
    {
        ".  In March 42 the BBC broadcast a ": null
    },
    {
        "mockumentary": "mockumentary"
    },
    {
        ", Anglian Lives: Alan Partridge, about Partridges life and career. In 42 Coogan performed a tour, Steve Coogan as Alan Partridge and other Less Successful Characters , featuring Partridge as a ": null
    },
    {
        "life coach": "coaching"
    },
    {
        ".        After a hiatus, Partridge returned in 42 in a series of ": null
    },
    {
        "YouTube": "youtube"
    },
    {
        " shorts,  Mid Morning Matters with Alan Partridge , as the host of a digital radio show with co-presenter Sidekick Simon .  Coogan wrote the shorts with brothers ": null
    },
    {
        "Neil and Rob Gibbons": "gibbons brothers"
    },
    {
        ", who submitted scripts to his company ": null
    },
    {
        "Baby Cow Productions": "baby cow productions"
    },
    {
        ". The Gibbons have co-written every Partridge project since. According to Neil, Coogan invited us in, our sensibilities chimed, and before we knew it, Mid Morning Matters was up and running. We wrote it as if it was our baby, and though there was a sense that we were standing on the shoulders of giants, I think we were like two pairs of fresh eyes, and Steve seemed to fall in love with the character all over again.  Coogan said they chose the web format because it was a bit underground, a low-key environment in which to test the character out again. And the response was so good, we realised there was more fuel in the tank. The shorts were later broadcast by ": null
    },
    {
        "Sky Atlantic": "sky atlantic"
    },
    {
        ".     In 42 a spoof autobiography,  I, Partridge: We Need to Talk About Alan , written by Coogan, Iannucci and the Gibbons brothers, was published. An ": null
    },
    {
        "audiobook": "audiobook"
    },
    {
        " version recorded by Coogan as Partridge was released on CD and downloadable audio formats. In the book, Partridge recounts his childhood and career, attempts to settle scores with people he feels have wronged him, and dispenses wisdom such as his assertion that ": null
    },
    {
        "Wikipedia": "wikipedia"
    },
    {
        " has made university education all but pointless .  Coogan appeared as Partridge to promote I, Partridge on  The Jonathan Ross Show   and ": null
    },
    {
        "BBC Radio 42 Live": "bbc radio 5 live"
    },
    {
        ".  It received positive reviews  and became a bestseller.     On 42 June 42 Partridge presented a one-hour Sky special,  Alan Partridge: Welcome to the Places of My Life , taking the viewer on a tour of Partridges home county ": null
    },
    {
        "Norfolk": "norfolk"
    },
    {
        ".  The programme earned Coogan the 42 BAFTA for Best Male Performance in a Comedy Programme. It was followed the next week by Open Books with Martin Bryce, a mock literary programme discussing Partridges autobiography.     On 42 August 42 a feature film,  Alan Partridge: Alpha Papa , written by Coogan, Iannucci, Baynham and the Gibbons brothers, was released in the UK. It was directed by ": null
    },
    {
        "Declan Lowney": "declan lowney"
    },
    {
        "  and co-produced by ": null
    },
    {
        "StudioCanal": "studiocanal"
    },
    {
        " and Baby Cow Productions, with support from ": null
    },
    {
        "BBC Films": "bbc films"
    },
    {
        " and the ": null
    },
    {
        "BFI Film Fund": "british film institute"
    },
    {
        ".  The film sees Partridge enlisted as a ": null
    },
    {
        "crisis negotiator": "crisis negotiation"
    },
    {
        " during a siege at his radio station. It received mostly positive reviews  and opened at number one at the box office in the UK and Ireland.      Scissored Isle and Nomad ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " chat show  TFI Friday  as Partridge.  In February 42 Sky Atlantic broadcast a second series of Mid Morning Matters, in which Partridge continues his relationship with divorcee Angela.  Alan Partridges Scissored Isle, a mockumentary in which Partridge examines the British ": null
    },
    {
        "class divide": "class stratification"
    },
    {
        ", followed in May.  A second Alan Partridge book, Alan Partridge: Nomad, a ": null
    },
    {
        "travelogue": "travel literature"
    },
    {
        " in which Partridge recounts a journey across the UK, was published on 42 October 42      In July 42 Partridge appeared in an episode of the ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " programme Inheritance Tracks in which guests choose music they would pass to future generations; he selected ": null
    },
    {
        "Who Put the Bomp ": "who put the bomp"
    },
    {
        " by ": null
    },
    {
        "Barry Mann": "barry mann"
    },
    {
        " and the theme from ": null
    },
    {
        "Grandstand": "grandstand"
    },
    {
        ".  Iannucci guest-edited an October 42 issue of  The Big Issue , featuring a debate on ": null
    },
    {
        "Brexit": "brexit"
    },
    {
        " between Partridge and ": null
    },
    {
        "Malcolm Tucker": "malcolm tucker"
    },
    {
        ", a character from ": null
    },
    {
        "The Thick Of It": "the thick of it"
    },
    {
        ", another sitcom created by Iannucci.  On 42 December, BBC Two broadcast a documentary about the history of Partridge, Alan Partridge: Why, When, Where, How and Whom?.     This Time  This Time with Alan Partridge , a spoof ": null
    },
    {
        "current affairs": "current affairs"
    },
    {
        " programme in the style of  The One Show .  In the series, Partridge becomes the stand-in presenter after the host falls ill. Coogan felt it was the right time for Partridge to return, and that he might represent the views of ": null
    },
    {
        "Brexit": "brexit"
    },
    {
        " voters. Neil Gibbons said the world of live television presenting had changed since Partridges creation: If someone fluffed a line or got someone’s name wrong or said something stupid, it was mortifying. But nowadays, those are the sort of people who are given jobs on TV.       Alan Partridge is an incompetent and tactless television and radio presenter from ": null
    },
    {
        "Norwich": "norwich"
    },
    {
        ", England.  He is socially inept, often offending his guests,  and has an inflated sense of importance and celebrity.  According to the  Telegraph , Partridge is utterly convinced of his own superiority, and bewildered by the worlds inability to recognise it – qualities that place him in the line of comedy lineage that runs directly from ": null
    },
    {
        "Hancock": "hancocks half hour"
    },
    {
        ", ": null
    },
    {
        "Captain Mainwaring": "captain mainwaring"
    },
    {
        ", and ": null
    },
    {
        "Basil Fawlty": "basil fawlty"
    },
    {
        " . His need for public attention drives him to deceit, treachery and shameless self-promotion, and sometimes violence; for example, in the Knowing Me, Knowing Yule Christmas special, he assaults a BBC boss and a paralysed former golfer.        Partridge holds ": null
    },
    {
        "right-wing": "right-wing politics"
    },
    {
        " views. Coogan described him as a ": null
    },
    {
        "Little Englander": "little englander"
    },
    {
        ", with a myopic, slightly philistine mentality .  He is a reader of the right-wing ": null
    },
    {
        "tabloid": "tabloid"
    },
    {
        " newspaper the  Daily Mail , and supports ": null
    },
    {
        "Brexit": "brexit"
    },
    {
        " because, according to Coogan, the Daily Mail told him to .  Earlier versions of the character were more bigoted, but the writers found there was more humour in having him attempt to be liberal. In I, Partridge, for example, Partridge stresses his friendship with gay television presenter ": null
    },
    {
        "Dale Winton": "dale winton"
    },
    {
        ". Coogan said: Hes aware of ": null
    },
    {
        "political correctness": "political correctness"
    },
    {
        " but hes playing catch-up. In the same way that the Daily Mail is a bit PC – it wouldnt be openly homophobic now – Alan is the same. He tries to be modern.     According to  Forbes , Partridge has parochial bad taste ,  and Coogan described him as on the wrong side of cool .  He is a fan of ": null
    },
    {
        "James Bond films": "james bond in film"
    },
    {
        " and ": null
    },
    {
        "Lexus": "lexus"
    },
    {
        " cars  and his music taste includes ": null
    },
    {
        "Wings": "paul mccartney and wings"
    },
    {
        " and ": null
    },
    {
        "Abba": "abba"
    },
    {
        "; Partridge named his son Fernando and his talk show Knowing Me, Knowing You after Abba songs, and his talk show catchphrase, Aha! , also comes from Abba. In earlier incarnations, Partridges wardrobe included a ": null
    },
    {
        "blazer": "blazer"
    },
    {
        ", badge and tie, ": null
    },
    {
        "driving glove": "driving glove"
    },
    {
        "s, and too-short shorts, styles he describes as sports casual and imperial leisure .  According to Iannucci, by the time of Alpha Papa his wardrobe had evolved to the  Top Gear  Presenter Circa 42 stage , with ": null
    },
    {
        "sports jackets": "sport coat"
    },
    {
        " and a borderline-": null
    },
    {
        "fop": "fop"
    },
    {
        "pish fringe. As Coogan aged, the ageing make-up he wore in earlier performances became unnecessary.     According to Coogan, Partridge was originally a one-note, sketchy character  and freak show , but slowly became refined as a dysfunctional alter ego. Baynham told the Guardian that despite the fact that people say hes awful, a lot of the time we were trying to build empathy: youre watching a man suffer but also at some level identifying with his pain.  According to Marber, Partridges fundamental characteristic is desperation. ": null
    },
    {
        "Felicity Montagu": "felicity montagu"
    },
    {
        ", who plays Partridges assistant Lynn, felt he was a good person deep down and actually vulnerable and lovable . Iannucci said that Partridge stays optimistic because he never sees himself as others see him, and that despite his failings was the perfect broadcaster for these times, when there are 42 hours to fill and dead time is a crime – he has a unique capacity to fill any vacuum with his own verbal vacuum . Rob and Neil Gibbons felt that by the time of Mid Morning Matters, when Partridge is working for an even smaller radio station, he was more at peace with himself and that his lack of self-awareness saved him from misery.        Vanity Fair  described Alan Partridge as a national treasure ... as cherished a part of British comedy heritage as John Cleeses Basil Fawlty and Rowan Atkinsons ": null
    },
    {
        "Mr. Bean": "mr. bean"
    },
    {
        ".  According to  Variety , in Britain Alan Partridge is a full-on phenomenon, a multiplatform fictional celebrity whose catchphrases, mangled metaphors and social ineptitude are the stuff of legend and good ratings.  The character is less well known outside the UK, but according to ": null
    },
    {
        "Anchorman": "anchorman: the legend of ron burgundy"
    },
    {
        " director ": null
    },
    {
        "Adam McKay": "adam mckay"
    },
    {
        ", every American comic knows who Steve is, whether its ": null
    },
    {
        "Stiller": "ben stiller"
    },
    {
        " or ": null
    },
    {
        "Ferrell": "will ferrell"
    },
    {
        " or ": null
    },
    {
        "Jack Black": "jack black"
    },
    {
        " or me ... and everyone watching those DVDs had the same reaction. How did I not know about this guy? ": null
    },
    {
        "Indiewire": "indiewire"
    },
    {
        " wrote that few Americans may know, but Partridge is a something of a comic icon across the pond ... Before there was Ron Burgundy for the Yanks, there was Alan Partridge for the Brits.      Brian Logan wrote in the Guardian that though Partridge was created as a satire of the asinine fluency of broadcaster-speak of the time, his study of character traits gave the character a timeless quality.  Guardian journalist ": null
    },
    {
        "John Crace": "john crace"
    },
    {
        " wrote: By rights, Alan Partridge should have been dead as a character years ago, the last drops of humour long since wrung out ... but Steve Coogan keeps finding ways to make him feel fresh.  The Independent wrote that Partridge is a disarming creation and that despite his flaws we always root for him .  In the Guardian, critic ": null
    },
    {
        "Alexis Petridis": "alexis petridis"
    },
    {
        " wrote that audiences find Partridge funny partly because they recognise themselves in him,  and Edmund Gordon called Partridge a magnificent comic creation: a monster of egotism and tastelessness . According to Gordon, Partridge allows liberal audiences to laugh at ": null
    },
    {
        "politically incorrect": "political correctness"
    },
    {
        " humour as every loathsome comment is sold to us not as a gag, but as a gaffe . Writing that Partridge channels the worst excesses of the privileged white man who considers himself nonetheless a victim ,  New Statesman  journalist Daniel Curtis saw Partridge as a precursor to ": null
    },
    {
        "post-truth politicians": "post-truth politics"
    },
    {
        " such as ": null
    },
    {
        "Nigel Farage": "nigel farage"
    },
    {
        " and ": null
    },
    {
        "Donald Trump": "donald trump"
    },
    {
        " .      ": null
    },
    {
        "Mandatory.com": "mandatory.com"
    },
    {
        " wrote that Partridge was a fascinatingly layered and fully realised creation of years of storytelling and a fundamentally contemptible prick — he feels like a living, breathing person, but a living, breathing person that you want to strangle . The Telegraph wrote: Never has one actor so completely inhabited a sitcom character. We believe Partridge is real, from his side-parted hair down to his tasseled sports-casual loafers.  In 42 Guardian writer Stuart Heritage described Partridge as one of the greatest and most beloved comic creations of the last few decades . He was ranked seventh on ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        "s 42 list of the ": null
    },
    {
        "42 Greatest TV Characters": "100 greatest"
    },
    {
        ".  In a 42 poll of over 42 comedians, Partridge was voted best TV comedy character and Coogan best male comedy actor, and a scene from Im Alan Partridge in which Partridge goes to the home of an obsessive fan was voted best comedy scene.        The Telegraph credited Partridge with influencing ": null
    },
    {
        "cringe comedies": "cringe comedy"
    },
    {
        " such as  The Inbetweeners ,  Nighty Night  and  Peep Show . According to ": null
    },
    {
        "Den of Geek": "den of geek"
    },
    {
        ", he has so influenced British culture that Partridgisms have become everyday vernacular. Monkey Tennis , one of Partridges desperate television proposals, has become shorthand for absurd television concepts.    Another, Youth Hostelling with Chris Eubank , was used by the hostel booking site Hostelworld as the basis of a 42 television advert with boxer ": null
    },
    {
        "Chris Eubank": "chris eubank"
    },
    {
        ".  Accidental Partridge , an unofficial ": null
    },
    {
        "Twitter": "twitter"
    },
    {
        " account which collects quotes reminiscent of Partridges speech from real media figures, had attracted 42 followers by May 42  In July 42 an art exhibition inspired by Partridge opened in Norwich.                                             ": null
    }
]