[
    {
        "        Albani Bryggerierne A/S  is a brewery located in ": null
    },
    {
        "Odense": "odense"
    },
    {
        ", ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", and the vast majority of its customers live on the island of ": null
    },
    {
        "Funen": "funen"
    },
    {
        ". The brewery was founded by ": null
    },
    {
        "MPharm": "mpharm"
    },
    {
        " Theodor Schiøtz in 42 In 42 the brewery merged with Bryggerigruppen , a group of Danish regional breweries.     Albani is most known for two of its beers, ": null
    },
    {
        "Odense Pilsner": "odense pilsner"
    },
    {
        " and ": null
    },
    {
        "Odense Classic": "odense classic"
    },
    {
        ".           Odense Pilsner is a ": null
    },
    {
        "pilsener": "pilsener"
    },
    {
        ". The taste is balanced between ": null
    },
    {
        "malt": "malt"
    },
    {
        " and fruit. Two different ": null
    },
    {
        "varieties of hops": "list of hop varieties"
    },
    {
        " are used, both come from ": null
    },
    {
        "Hallertau": "hallertau"
    },
    {
        " in ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". It has been brewed since 42 and was originally not part of the Albani Brewerys portfolio, but was introduced to the product line with the acquisition of Bryggeriet Odense.     Alcohol by volume: 42%         Odense Classic is a ": null
    },
    {
        "pilsener": "pilsener"
    },
    {
        ", though it has a more dark colour than ordinary beers of the same type. The beer has a more rounded, but still powerful taste of malt and hops. It was introduced at the brewerys 42th anniversary in 42     Alcohol by volume: 42%       Odense Rød Classic  is a Vienna lager. A mixture of dark ": null
    },
    {
        "caramel": "caramel"
    },
    {
        " malt and ": null
    },
    {
        "Münchener": "münchener"
    },
    {
        " malt is used. The result is a dark beer with a somewhat rounded taste. The colour is dark golden red, which might be the source of the name.     Alcohol by volume: 42%       Giraf Beer is a strong ": null
    },
    {
        "pilsener": "pilsener"
    },
    {
        ". It was first brewed in 42 when ": null
    },
    {
        "Odense Zoo": "odense zoo"
    },
    {
        "s ": null
    },
    {
        "giraffe": "giraffe"
    },
    {
        "  Kalle was found dead, as the Albani Breweries had previously used this giraffe in its ": null
    },
    {
        "advertisement": "advertisement"
    },
    {
        ", it decided to create a special beer, the profits of which would be spent on purchasing a new giraffe for the zoo. The first years production raised enough funds to buy two giraffes for the zoo.     Alcohol by volume: 42%       HC Andersen is a strong ": null
    },
    {
        "ale": "ale"
    },
    {
        "-type beer, first brewed in 42 when the Albani Breweries decided to create a special beer to celebrate Odenses 42th anniversary.   The beer became so popular that Albani decided to keep it as a part of its product range. In 42 it was marketed under its current name, honouring ": null
    },
    {
        "Hans Christian Andersen": "hans christian andersen"
    },
    {
        ". A small batch of HC Andersen is brewed every year, and released on Andersens birthday, April 42 Each years labels depict a different paper cutting by Hans Christian Andersen. The bottles are also serial numbered. As a result, the beer has become a collectors item.   The beer is ": null
    },
    {
        "bottom fermented": "bottom fermentation"
    },
    {
        " and is matured longer than ordinary beer. The result is a beer with a light taste, considering its high ": null
    },
    {
        "alcohol": "ethanol"
    },
    {
        " content.     Alcohol by volume: 42%       Albani produces two Christmas beers Blålys  and Rødhætte . Blålys was introduced in 42 although it was not Denmarks first Christmas beer, Blålys effectively started the tradition of Danish Christmas beers. Denmarks first Christmas beer was produced by the Carlsminde brewery and had been introduced the previous year. Albani acquired Carlsminde in 42 Both Blålys and Rødhætte are dark ": null
    },
    {
        "lager": "lager"
    },
    {
        "s. The label depicts the church-like Gallery Tower of the brewery cover covered in snow. This is the reason why many people originally referred to the Christmas beer as the church beer . This only lasted a few years until other breweries introduced their own Christmas beers.     Blålys: Alcohol by volume: 42%     Rødhætte: Alcohol by volume: 42%       Påskebryg , is a strong ": null
    },
    {
        "pilsener": "pilsener"
    },
    {
        ", and the Albani Breweries traditional beer for the Easter season. Easter beers were Denmarks first ": null
    },
    {
        "seasonal beer": "seasonal beer"
    },
    {
        "s in Denmark, and were introduced by Carlsberg in 42 The Påskebryg was introduced in the 42s and is brewed from a mixture of dark and light malt.     Alcohol by volume: 42%       Albani also produces two light beers, Odense Light and Odense Extra Light, as light alternatives to its original pilsener. These beers are brewed using light pilsener malt, Münchner malt, and caramel malt.     Odense Light: Alcohol by volume: 42%     Odense Extra Light: Alcohol by volume: 42%       At the turn of the twentieth century there was a large ": null
    },
    {
        "consolidation": "consolidation"
    },
    {
        " in the Danish brewing industry, where the larger city breweries typically bought the smaller countryside breweries. Albani was part of this development, buying smaller breweries in Odense and around the island of Funen. Later, when Albani had a near ": null
    },
    {
        "monopoly": "monopoly"
    },
    {
        " on beer distribution on Funen, Albani started acquiring breweries in other parts of the country; Sønderborg Bryghus, Bryggeriet Slotsmøllen, Baldur, and Maribo Bryghus, in each case, Albani taking control of the other company. Albani Breweries A/S merged with the Royal Unibrew group in 42          Other names used by the group are:            Denmarks best known poet and author, ": null
    },
    {
        "Hans Christian Andersen": "hans christian andersen"
    },
    {
        ", was very fond of Albani beers. In a letter to a friend he described Albani beer as: Jeg kan ikke rose denne øl højt nok. Den er forfriskende, delikat og stærk. Prøv den! ": null
    }
]