[
    {
        "   Albert Leroy David was an officer in the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and a recipient of two ": null
    },
    {
        "Navy Cross": "navy cross"
    },
    {
        "es as well as the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        ". He was awarded the Medal of Honor for his role in helping to capture , off the coast of French West Africa in June 42       Born in ": null
    },
    {
        "Maryville": "maryville, missouri"
    },
    {
        ", ": null
    },
    {
        "Missouri": "missouri"
    },
    {
        ", David enlisted in the Navy at ": null
    },
    {
        "Kansas City, Missouri": "kansas city, missouri"
    },
    {
        ", on September 42 42 After undergoing his training at the Naval Training Station, San Francisco, he served on the battleship  for the rest of his first enlistment.     Reenlisting at ": null
    },
    {
        "Omaha, Nebraska": "omaha, nebraska"
    },
    {
        ", on July 42 42 David served his second enlistment in a succession of ships: , , , , and , reenlisting on board Texas on May 42 42 He then served in , , and , reenlisting at ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ", ": null
    },
    {
        "Pennsylvania": "pennsylvania"
    },
    {
        ", on June 42 42 He reported on board  on July 42 42 and served in that destroyer tender until his transfer to the Fleet Reserve on August 42 42       David was recalled to active duty, though, on September 42 42 less than a month after World War II broke out in ": null
    },
    {
        "Europe": "europe"
    },
    {
        " with ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        "s invasion of ": null
    },
    {
        "Poland": "poland"
    },
    {
        ".     Appointed machinist on May 42 42 David was assigned to the ": null
    },
    {
        "Submarine": "submarine"
    },
    {
        " Repair Unit, San Diego on May 42 and served in that unit for five months. While there, he received his promotion to ensign on June 42 Reporting thence to the Naval Training School for diesel engineers at the Madison campus of the University of Wisconsin, for instruction, David ultimately reported for duty at the Naval Training Station, Naval Operating Base, ": null
    },
    {
        "Norfolk": "norfolk, virginia"
    },
    {
        ", before he traveled to Orange, Texas, to assist in fitting out the destroyer escort , which was commissioned at the ": null
    },
    {
        "Consolidated Steel Corporation": "consolidated steel corporation"
    },
    {
        " yard on June 42 42     Promoted to lieutenant while Pillsbury was fitting out, David served in that ship as she operated in the Atlantic, escorting convoys into ": null
    },
    {
        "Casablanca": "casablanca"
    },
    {
        " and ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ", and serving with a hunter-killer unit formed around . He was serving as Pillsburys assistant engineering and electrical officer when Guadalcanals task group located a ": null
    },
    {
        "German submarine": "u-boat"
    },
    {
        " off Cape Blanco, French West Africa, on June 42 42 and forced it to the surface.     Pillsbury lowered a boat and sent a party of nine men, led by David, to board the U-boat, soon identified as U42, which was still underway and running in a circle on the surface. Although he had every reason to believe that Germans were still below decks setting demolition charges and scuttling the ship, David led Pillsburys men on board and down the conning tower hatch, and took possession of the ship. Although he found the sea flooding into the U-boat, David remained below directing the initial salvage operations—aware that at any moment the submersible could blow up or sink. Men from Guadalcanal arrived soon thereafter to aid in the battle to keep U42 afloat, and David remained on board directing the salvage operations. As a result of his vigorous and heroic efforts, the valuable prize was eventually taken to Bermuda.     Promoted to lieutenant soon thereafter, David received the Medal of Honor for his part in the first successful boarding and capture of an enemy ": null
    },
    {
        "man-of-war": "man-of-war"
    },
    {
        " on the high seas by the United States Navy since 42 His was the only Medal of Honor awarded to a member of the Navy in the Atlantic theater of World War II.     He died of a heart attack at Norfolk, Virginia, however, before the medal could be presented to him; it was presented by ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " Harry S. Truman": "harry s. truman"
    },
    {
        " to Davids widow, Lynda Mae David, on October 42 42 in a ceremony at the ": null
    },
    {
        "White House": "white house"
    },
    {
        ".       ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " Navy Cross": "navy cross"
    },
    {
        " with gold star   ": null
    },
    {
        "Good Conduct Medal": "good conduct medal"
    },
    {
        " American Defense Service Medal": "american defense service medal"
    },
    {
        " European-African-Middle Eastern Campaign Medal": "european-african-middle eastern campaign medal"
    },
    {
        " World War II Victory Medal": "world war ii victory medal"
    },
    {
        "       His Medal of Honor citation reads:   For conspicuous gallantry and intrepidity at the risk of his life above and beyond the call of duty while attached to the U.S.S. Pillsbury during the capture of an enemy German submarine off French West Africa , June 42 42 Taking a vigorous part in the skillfully coordinated attack on the U42 at the end of a prolonged search by the Task Group, Lt. David boldly led a party from the Pillsbury in boarding the hostile submarine as it circled erratically at 42 or 42 knots on the surface. Fully aware that the U-boat might at any moment sink or be blown up by exploding demolition and scuttling charges, he braved the added danger of enemy gunfire to plunge through the conning tower hatch and, with his small party, exerted every effort to keep the ship afloat and to assist the succeeding and more fully equipped salvage parties in making the U42 seaworthy for the long tow across the Atlantic to a U.S. port. By his valiant service during the first successful boarding and capture of an enemy man-of-war on the high seas by the United States Navy since 42 Lt. David contributed materially to the effectiveness of the Battle of the Atlantic and upheld the highest traditions of the U.S. Naval Service.": null
    }
]