[
    {
        "      Albert Sidney Johnston served as a ": null
    },
    {
        "general": "general officer"
    },
    {
        " in three different armies: the ": null
    },
    {
        "Texian Army": "texian army"
    },
    {
        ", the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        ", and the ": null
    },
    {
        "Confederate States Army": "confederate states army"
    },
    {
        ". He saw extensive combat during his 34-year military career, fighting actions in the ": null
    },
    {
        "Black Hawk War": "black hawk war"
    },
    {
        ", the ": null
    },
    {
        "Texas War of Independence": "texas war of independence"
    },
    {
        ", the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        ", the ": null
    },
    {
        "Utah War": "utah war"
    },
    {
        ", and the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ".     Considered by Confederate States President ": null
    },
    {
        "Jefferson Davis": "jefferson davis"
    },
    {
        " to be the finest general officer in the Confederacy before the later emergence of ": null
    },
    {
        "Robert E. Lee": "robert e. lee"
    },
    {
        ", he was killed early in the Civil War at the ": null
    },
    {
        "Battle of Shiloh": "battle of shiloh"
    },
    {
        " on April 6, 1862. Johnston was the highest-ranking officer, Union or Confederate, killed during the entire war. Davis believed the loss of General Johnston was the turning point of our fate.     Johnston was unrelated to Confederate general ": null
    },
    {
        "Joseph E. Johnston": "joseph e. johnston"
    },
    {
        ".       Johnston was born in ": null
    },
    {
        "Washington, Kentucky": "washington, kentucky"
    },
    {
        ", the youngest son of Dr. John and Abigail Johnston. His father was a native of ": null
    },
    {
        "Salisbury, Connecticut": "salisbury, connecticut"
    },
    {
        ". Although Albert Johnston was born in Kentucky, he lived much of his life in ": null
    },
    {
        "Texas": "texas"
    },
    {
        ", which he considered his home. He was first educated at ": null
    },
    {
        "Transylvania University": "transylvania university"
    },
    {
        " in ": null
    },
    {
        "Lexington, Kentucky": "lexington, kentucky"
    },
    {
        ", where he met fellow student ": null
    },
    {
        "Jefferson Davis": "jefferson davis"
    },
    {
        ". Both were appointed to the ": null
    },
    {
        "United States Military Academy": "united states military academy"
    },
    {
        " at ": null
    },
    {
        "West Point, New York": "west point, new york"
    },
    {
        ", Davis two years behind Johnston. Woodworth, p. 46. In 1826, Johnston graduated eighth of 41 cadets in his class from West Point with a commission as a ": null
    },
    {
        "brevet": "brevet"
    },
    {
        " second lieutenant": "second lieutenantunited states"
    },
    {
        " in the ": null
    },
    {
        "2nd U.S. Infantry": "2nd infantry regiment"
    },
    {
        ". Eicher, p. 322.     Johnston was assigned to posts in ": null
    },
    {
        "New York": "new york"
    },
    {
        " and ": null
    },
    {
        "Missouri": "missouri"
    },
    {
        " and served in the brief ": null
    },
    {
        "Black Hawk War": "black hawk war"
    },
    {
        " in 1832 as chief of staff to Bvt. Brig. Gen. ": null
    },
    {
        "Henry Atkinson": "henry atkinson"
    },
    {
        ".          In 1829 he married Henrietta Preston, sister of Kentucky politician and future Civil War general ": null
    },
    {
        "William Preston": "william preston"
    },
    {
        ". They had one son, ": null
    },
    {
        "William Preston Johnston": "william preston johnston"
    },
    {
        ", who became a colonel in the Confederate States Army.   The senior Johnston resigned his commission in 1834 in order to care for his dying wife in Kentucky, who succumbed two years later to ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        ".     After serving as Secretary of War for the Republic of Texas from 1838 to 1840, Johnston resigned and returned to Kentucky. In 1843, he married Eliza Griffin, his late wifes first cousin. The couple moved to Texas, where they settled on a large ": null
    },
    {
        "plantation": "plantations in the american south"
    },
    {
        " in ": null
    },
    {
        "Brazoria County": "brazoria county, texas"
    },
    {
        ". Johnston named the property China Grove . Here they raised Johnstons two children from his first marriage and the first three children born to Eliza and him. .       In 1836 Johnston moved to Texas. He enlisted as a ": null
    },
    {
        "private": "private"
    },
    {
        " in the Texian Army during the ": null
    },
    {
        "Texas War of Independence": "texas war of independence"
    },
    {
        " against the Republic of Mexico. He was named ": null
    },
    {
        "Adjutant General": "adjutant general of texas"
    },
    {
        " as a ": null
    },
    {
        "colonel": "colonel"
    },
    {
        " in the Republic of Texas Army on August 5, 1836. On January 31, 1837, he became senior ": null
    },
    {
        "brigadier general": "brigadier general"
    },
    {
        " in command of the Texas Army.     On February 5, 1837, he fought in a duel with Texas Brig. Gen. ": null
    },
    {
        "Felix Huston": "felix huston"
    },
    {
        ", as they challenged each other for the command of the Texas Army; Johnston refused to fire on Huston and lost the position after he was wounded in the pelvis.     On December 22, 1838, ": null
    },
    {
        "Mirabeau B. Lamar": "mirabeau b. lamar"
    },
    {
        ", the second president of the ": null
    },
    {
        "Republic of Texas": "republic of texas"
    },
    {
        ", appointed Johnston as Secretary of War. He provided for the defense of the Texas border against Mexican invasion, and in 1839 conducted a campaign against ": null
    },
    {
        "Indians": "native americans in the united states"
    },
    {
        " in northern Texas. In February 1840, he resigned and returned to Kentucky.             Johnston returned to Texas during the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        " , under General ": null
    },
    {
        "Zachary Taylor": "zachary taylor"
    },
    {
        " as a ": null
    },
    {
        "colonel": "colonel"
    },
    {
        " of the 1st Texas Rifle Volunteers. The enlistments of his volunteers ran out just before the ": null
    },
    {
        "Battle of Monterrey": "battle of monterrey"
    },
    {
        ". Johnston convinced a few volunteers to stay and fight as he served as the inspector general of volunteers and fought at the battles of Monterrey and ": null
    },
    {
        "Buena Vista": "battle of buena vista"
    },
    {
        ".     He remained on his plantation after the war until he was appointed by later 12th president ": null
    },
    {
        "Zachary Taylor": "zachary taylor"
    },
    {
        " to the ": null
    },
    {
        "U.S. Army": "united states army"
    },
    {
        " as a ": null
    },
    {
        "major": "major"
    },
    {
        " and was made a paymaster in December 1849. He served in that role for more than five years, making six tours, and traveling more than  annually on the Indian frontier of Texas. He served on the Texas frontier at ": null
    },
    {
        "Fort Mason": "fort mason"
    },
    {
        " and elsewhere in the West.     In 1855, 14th president ": null
    },
    {
        "Franklin Pierce": "franklin pierce"
    },
    {
        " appointed him colonel of the new 2nd U.S. Cavalry , a new regiment, which he organized. On August 19, 1856, Gen. ": null
    },
    {
        "Persifor Smith": "persifor smith"
    },
    {
        ", at the request of Kansas Territorial Governor Wilson Shannon, sent Col. Johnston with 1300 men composed of the 2d Cavalry Dragoons from ": null
    },
    {
        "Fort Riley": "fort riley"
    },
    {
        ", a battalion of the 6th Infantry and ": null
    },
    {
        "Capt. Howes": "albion p. howe"
    },
    {
        " artillery company from ": null
    },
    {
        "Jefferson Barracks": "jefferson barracks military post"
    },
    {
        ", near ": null
    },
    {
        "St. Louis": "st. louis, missouri"
    },
    {
        " to protect the ": null
    },
    {
        "territorial": "kansas territory"
    },
    {
        " capital at ": null
    },
    {
        "Lecompton": "lecompton, kansas"
    },
    {
        " from an imminent attack by ": null
    },
    {
        "James Henry Lane": "james henry lane"
    },
    {
        " and his abolitionist Army of the North.       As a key figure in the ": null
    },
    {
        "Utah War": "utah war"
    },
    {
        ", Johnston took command of the U.S forces in November 1857. This army was sent to install Alfred Cummings as governor of the Utah territory, in place of Brigham Young. After the army wintered at Fort Bridger, Wyoming, a peaceful resolution was reached and in late June 1858 Johnston led the army through Salt Lake city without incident to establish Camp Floyd some 50 miles distant. He received a ": null
    },
    {
        "brevet": "brevet"
    },
    {
        " promotion to ": null
    },
    {
        "brigadier general": "brigadier general"
    },
    {
        " in 1857 for his service in Utah. He spent 1860 in Kentucky until December 21, when he sailed for California to take command of the Department of the Pacific.          At the outbreak of the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ", Johnston was the commander of the U.S. Army ": null
    },
    {
        "Department of the Pacific": "department of the pacific"
    },
    {
        " in ": null
    },
    {
        "California": "california and the civil war"
    },
    {
        ". Like many regular army officers from the South, he was opposed to secession. But he resigned his commission soon after he heard of the secession of his adopted state of Texas. It was accepted by the War Department on May 6, 1861, effective May 3. Johnston, p. 273. On April 28 he moved to Los Angeles, the home of his wifes brother John Griffin. Considering staying in California with his wife and five children, Johnston remained there until May.     Soon, under suspicion by local Union officials, he evaded arrest and joined the ": null
    },
    {
        "Los Angeles Mounted Rifles": "los angeles mounted rifles"
    },
    {
        " as a private, leaving ": null
    },
    {
        "Warners Ranch": "warners ranch"
    },
    {
        " May 27. Johnston, pp. 268, 275–91. He participated in their trek across the southwestern deserts to Texas, crossing the ": null
    },
    {
        "Colorado River": "colorado river"
    },
    {
        " into the ": null
    },
    {
        "Confederate Territory of Arizona": "confederate territory of arizona"
    },
    {
        " on July 4, 1861.     Early in the Civil War, Confederate President ": null
    },
    {
        "Jefferson Davis": "jefferson davis"
    },
    {
        " decided that the Confederacy would attempt to hold as much of its territory as possible, and therefore distributed military forces around its borders and coasts. Woodworth, pp. 18–19. In the summer of 1861, Davis appointed several generals to defend Confederate lines from the Mississippi River east to the Allegheny Mountains. Woodworth, pp. 17–33.     The most sensitive, and in many ways the most crucial areas, along the Mississippi River and in western Tennessee along the ": null
    },
    {
        "Tennessee": "tennessee river"
    },
    {
        " and the ": null
    },
    {
        "Cumberland": "cumberland river"
    },
    {
        " rivers Woodworth, pp. 20–22 were placed under the command of ": null
    },
    {
        "Maj. Gen.": "major general"
    },
    {
        " Leonidas Polk": "leonidas polk"
    },
    {
        " and ": null
    },
    {
        "Brig. Gen.": "brigadier general"
    },
    {
        " Gideon J. Pillow": "gideon j. pillow"
    },
    {
        ". The latter had initially been in command in Tennessee as that States top general. Woodworth, pp. 30–32. Their impolitic occupation of ": null
    },
    {
        "Columbus, Kentucky": "columbus, kentucky"
    },
    {
        ", on September 3, 1861, two days before Johnston arrived in the Confederacys capital of ": null
    },
    {
        "Richmond, Virginia": "richmond in the american civil war"
    },
    {
        ", after his cross-country journey, drove Kentucky from its stated neutrality. Woodworth, pp. 35, 45. Long, p. 114. The majority of Kentuckians allied with the Union camp. Woodworth, pp. 39, 50. Polk and Pillows action gave Union ": null
    },
    {
        "Brig. Gen.": "brigadier general"
    },
    {
        " Ulysses S. Grant": "ulysses s. grant"
    },
    {
        " an excuse to take control of the strategically located town of ": null
    },
    {
        "Paducah, Kentucky": "paducah, kentucky"
    },
    {
        ", without raising the ire of most Kentuckians and the pro-Union majority in the State legislature. Woodworth, p. 39. Long, p. 115.       On September 10, 1861, Johnston was assigned to command the huge area of the Confederacy west of the Allegheny Mountains, except for coastal areas. He became commander of the Confederacys western armies in the area often called the ": null
    },
    {
        "Western Department": "western theater of the american civil war"
    },
    {
        " or Western Military Department. Woodworth, p. 51. Long, p. 116. Johnstons appointment as a ": null
    },
    {
        "full general": "general"
    },
    {
        " by his friend and admirer Jefferson Davis already had been confirmed by the Confederate Senate on August 31, 1861. The appointment had been backdated to rank from May 30, 1861, making him the second highest ranking general in the Confederate States Army. Only Adjutant General and Inspector General ": null
    },
    {
        "Samuel Cooper": "samuel cooper"
    },
    {
        " ranked ahead of him. Eicher, Civil War High Commands. p.  807. From General Command Line List. Weigley, p.  110. McPherson, p.  394. After his appointment, Johnston immediately headed for his new territory. Woodworth, p. 52. He was permitted to call on governors of Arkansas, Tennessee and Mississippi for new troops, although this authority was largely stifled by politics, especially with respect to Mississippi. On September 13, 1861, Johnston ordered Brig. Gen. ": null
    },
    {
        "Felix Zollicoffer": "felix zollicoffer"
    },
    {
        " with 4,000 men to occupy ": null
    },
    {
        "Cumberland Gap": "cumberland gap"
    },
    {
        " in Kentucky in order to block Union troops from coming into eastern Tennessee. The Kentucky legislature had voted to side with the Union after the occupation of Columbus by Polk. By September 18, Johnston had Brig. Gen. ": null
    },
    {
        "Simon Bolivar Buckner": "simon bolivar buckner"
    },
    {
        " with another 4,000 men blocking the railroad route to Tennessee at ": null
    },
    {
        "Bowling Green, Kentucky": "bowling green, kentucky"
    },
    {
        ". Long, p. 119.     Johnston had fewer than 40,000 men spread throughout Kentucky, Tennessee, Arkansas and Missouri. Woodworth, p. 53. Of these, 10,000 were in Missouri under ": null
    },
    {
        "Missouri State Guard": "missouri state guard"
    },
    {
        " Maj. Gen. ": null
    },
    {
        "Sterling Price": "sterling price"
    },
    {
        ". Johnston did not quickly gain many recruits when he first requested them from the governors, but his more serious problem was lacking sufficient arms and ammunition for the troops he already had. As the Confederate government concentrated efforts on the units in the East, they gave Johnston small numbers of reinforcements and minimal amounts of arms and material. Woodworth, p. 55. Johnston maintained his defense by conducting raids and other measures to make it appear he had larger forces than he did, a strategy that worked for several months. Johnstons tactics had so annoyed and confused Union Brig. Gen. ": null
    },
    {
        "William Tecumseh Sherman": "william tecumseh sherman"
    },
    {
        " in Kentucky that he became paranoid and mentally unstable. Sherman overestimated Johnstons forces, and had to be relieved by Brig. Gen. ": null
    },
    {
        "Don Carlos Buell": "don carlos buell"
    },
    {
        " on November 9, 1861. Woodworth, pp. 55–56 Long, p. 138. McPherson, p. 394 says Johnston had 70,000 troops to defend his territory between the Appalachians and the Ozarks by the end of 1861.       ": null
    },
    {
        "East Tennessee": "east tennessee"
    },
    {
        "  was held for the Confederacy by two unimpressive brigadier generals appointed by Jefferson Davis: Felix Zollicoffer, a brave but untrained and inexperienced officer, and soon-to-be Maj. Gen. ": null
    },
    {
        "George B. Crittenden": "george b. crittenden"
    },
    {
        ", a former U.S. Army officer with apparent alcohol problems. Woodworth, p. 61 While Crittenden was away in Richmond, Zollicoffer moved his forces to the north bank of the upper Cumberland River near Mill Springs , putting the river to his back and his forces into a trap. Woodworth, p. 65. Long, pp. 161–162. Zollicoffer decided it was impossible to obey orders to return to the other side of the river because of scarcity of transport and proximity of Union troops. Woodworth, p. 66. When Union Brig. Gen. ": null
    },
    {
        "George H. Thomas": "george h. thomas"
    },
    {
        " moved against the Confederates, Crittenden decided to attack one of the two parts of Thomass command at Logans Cross Roads near Mill Springs before the Union forces could unite. At the ": null
    },
    {
        "Battle of Mill Springs": "battle of mill springs"
    },
    {
        " on January 19, 1862, the ill-prepared Confederates, after a night march in the rain, attacked the Union force with some initial success. Woodworth, pp. 66–67. As the battle progressed, Zollicoffer was killed, Crittenden was unable to lead the Confederate force , and the Confederates were turned back and routed by a Union bayonet charge, suffering 533 casualties from their force of 4,000. Woodworth, p. 67. Long, p. 162. The Confederate troops who escaped were assigned to other units as General Crittenden faced an investigation of his conduct. Woodworth, p. 69.     After the Confederate defeat at the Mill Springs, Davis sent Johnston a brigade and a few other scattered reinforcements. He also assigned him Gen. ": null
    },
    {
        "P. G. T. Beauregard": "p. g. t. beauregard"
    },
    {
        ", who was supposed to attract recruits because of his victories early in the war, and act as a competent subordinate for Johnston. Woodworth, pp. 71–72. The brigade was led by Brig. Gen. ": null
    },
    {
        "John B. Floyd": "john b. floyd"
    },
    {
        ", considered incompetent. He took command at ": null
    },
    {
        "Fort Donelson": "fort donelson"
    },
    {
        " as the senior general present just before Union Brig. Gen. ": null
    },
    {
        "Ulysses S. Grant": "ulysses s. grant"
    },
    {
        " attacked the fort. Woodworth, pp. 80, 84. Historians believe the assignment of Beauregard to the west stimulated Union commanders to attack the forts before Beauregard could make a difference in the theater. Union officers heard that he was bringing 15 regiments with him, but this was an exaggeration of his forces. Woodworth, pp. 72, 78.       Based on the assumption that Kentucky neutrality would act as a shield against a direct invasion from the north, circumstances that no longer applied in September 1861, Tennessee initially had sent men to Virginia and concentrated defenses in the Mississippi Valley. Woodworth, p. 54. Eicher, The Longest Night. pp. 111–113. Even before Johnston arrived in Tennessee, construction of two forts had been started to defend the ": null
    },
    {
        "Tennessee": "tennessee river"
    },
    {
        " and the ": null
    },
    {
        "Cumberland": "cumberland river"
    },
    {
        " rivers, which provided avenues into the State from the north. Woodworth, p. 56. Both forts were located in Tennessee in order to respect Kentucky neutrality, but these were not in ideal locations. Long, p. 142 Weigley, p. 108 McPherson, p. 393. ": null
    },
    {
        "Fort Henry": "battle of fort henry"
    },
    {
        " on the Tennessee River was in an unfavorable low-lying location, commanded by hills on the Kentucky side of the river. ": null
    },
    {
        "Fort Donelson": "fort donelson"
    },
    {
        " on the Cumberland River, although in a better location, had a vulnerable land side and did not have enough heavy artillery to defend against gunboats.     Maj. Gen. Polk ignored the problems of the forts when he took command. After Johnston took command, Polk at first refused to comply with Johnstons order to send an engineer, Lt. Joseph K. Dixon, to inspect the forts. Woodworth, p. 57. After Johnston asserted his authority, Polk had to allow Dixon to proceed. Dixon recommended that the forts be maintained and strengthened, although they were not in ideal locations, because much work had been done on them and the Confederates might not have time to build new ones. Johnston accepted his recommendations. Johnston wanted Major ": null
    },
    {
        "Alexander P. Stewart": "alexander p. stewart"
    },
    {
        " to command the forts but President Davis appointed Brig. Gen. ": null
    },
    {
        "Lloyd Tilghman": "lloyd tilghman"
    },
    {
        " as commander.     To prevent Polk from dissipating his forces by allowing some men to join a partisan group, Johnston ordered him to send Brig. Gen. Gideon Pillow and 5,000 men to Fort Donelson. Woodworth, p. 58. Pillow took up a position at nearby ": null
    },
    {
        "Clarksville, Tennessee": "clarksville, tennessee"
    },
    {
        " and did not move into the fort until February 7, 1862. Long, pp. 167–168. Eicher, The Longest Night, p. 171 says the garrison at Fort Donelson numbered 1,956 men before the Fort Henry garrison and the men under Floyd and Pillow joined them in early February 1862. Alerted by a Union reconnaissance on January 14, 1862, Johnston ordered Tilghman to fortify the high ground opposite Fort Henry, which Polk had failed to do despite Johnstons orders. Woodworth, p. 71. Tilghman failed to act decisively on these orders, which in any event were too late to be adequately carried out. McPherson, p. 396. A Confederate battery and the beginning of some fortifications were sited across the river at ": null
    },
    {
        "Fort Heiman": "fort heiman"
    },
    {
        " but these were of little value when the Union flotilla appeared.     Gen. Beauregard arrived at Johnstons headquarters at Bowling Green on February 4, 1862, and was given overall command of Polks force at the western end of Johnstons line at Columbus, Kentucky. Woodworth, p. 78. After some preliminary work with Johnston, Beauregard assumed command of this force, which he named the Army of the Mississippi, on March 5, 1862, while at Jackson, Tennessee. Like the other Confederate commander, he had to withdraw to the south after the fall of the forts or be surrounded by the advancing Union forces. Long, p. 178. On February 6, 1862, ": null
    },
    {
        "Union Navy": "union navy"
    },
    {
        " gunboats quickly reduced the defenses of ill-sited Fort Henry, inflicting 21 casualties on the small remaining Confederate force. Woodworth, pp. 78–79. Long, p. 167. Brig. Gen. Lloyd Tilghman surrendered the 94 remaining officers and men of his approximately 3,000-man force which had not been sent to Fort Donelson before U.S. Grants force could even take up their positions. Long, pp. 166–167 Weigley, p. 109. Johnston knew he could be trapped at Bowling Green if Fort Donelson fell, so he moved his force to ": null
    },
    {
        "Nashville": "nashville, tennessee"
    },
    {
        ", the capital of Tennessee and an increasingly important Confederate industrial center, beginning on February 11, 1862. Woodworth, p. 79. Loing, pp. 169–170.     Johnston also reinforced Fort Donelson with 12,000 more men, including those under Floyd and Pillow, a curious decision in view of his thought that the Union gunboats alone might be able to take the fort. He did order the commanders of the fort to evacuate the troops if the fort could not be held. Woodworth, p. 80. The senior generals sent to the fort to command the enlarged garrison, Gideon J. Pillow and John B. Floyd, squandered their chance to avoid having to surrender most of the garrison McPherson, pp. 400–401. and on February 16, 1862, Brig. Gen. Simon Buckner, having been abandoned by Floyd Floyd was able to ferry his four Virginia regiments out of the fort with him but left his Mississippi regiment behind to surrender with the rest of the garrison. Pillow escaped only with his chief of staff. Woodworth, p. 83. Long, p. 171. and Pillow, surrendered Fort Donelson. Woodworth, pp. 82–84. Colonel ": null
    },
    {
        "Nathan Bedford Forrest": "nathan bedford forrest"
    },
    {
        " escaped with his cavalry force of about 700 men before the surrender. Woodworth, p. 84. McPherson, pp. 401–402. This included about 200 men not in Forrests immediate command. Weigley, p. 111 The Confederates suffered about 1,500 casualties with an estimated 12,000 to 14,000 taken prisoner. Long, p. 172. Weigley, p. 111. Union casualties were 500 killed, 2,108 wounded, 224 missing.     Johnston, who had little choice in allowing Floyd and Pillow to take charge at Fort Donelson on the basis of seniority after he ordered them to add their forces to the garrison, took the blame and suffered calls for his removal because a full explanation to the press and public would have exposed the weakness of the Confederate position. Woodworth, pp. 84–85. His passive defensive performance while positioning himself in a forward position at Bowling Green, spreading his forces too thinly, not concentrating his forces in the face of Union advances, and appointing or relying upon inadequate or incompetent subordinates subjected him to criticism at the time and by later historians. Weigley, p. 112. McPherson, pp. 405–406. Davis defended Johnston, saying: If Sidney Johnston is not a general, we had better give up the war, for we have no general. McPherson, p. 495. The fall of the forts exposed Nashville to imminent attack, and it fell without resistance to Union forces under Brig. Gen. Buell on February 25, 1862, two days after Johnston had to pull his forces out in order to avoid having them captured as well. Woodworth, p. 86. Long, p. 175. McPherson, p. 402.       Johnston had various remaining military units scattered throughout his territory and retreating to the south to avoid being cut off. Woodworth, pp. 85–86. Johnston himself retreated with the force under his personal command, the ": null
    },
    {
        "Army of Central Kentucky": "army of central kentucky"
    },
    {
        ", from the vicinity of Nashville. With Beauregards help, McPherson, p. 406. Johnston decided to concentrate forces with those formerly under Polk and now already under Beauregards command at the strategically located railroad crossroads of ": null
    },
    {
        "Corinth, Mississippi": "corinth, mississippi"
    },
    {
        ", which he reached by a circuitous route. Woodworth, pp. 86–88. Johnston kept the Union forces, now under the overall command of the ponderous Maj. Gen. ": null
    },
    {
        "Henry Halleck": "henry halleck"
    },
    {
        ", confused and hesitant to move, allowing Johnston to reach his objective undetected. Woodworth, p. 88. This delay allowed Jefferson Davis finally to send reinforcements from the garrisons of coastal cities and another highly rated but prickly general, ": null
    },
    {
        "Braxton Bragg": "braxton bragg"
    },
    {
        ", to help organize the western forces. Woodworth, pp. 90, 94. Bragg at least calmed the nerves of Beauregard and Polk, who had become agitated by their apparent dire situation in the face of numerically superior forces, before Johnstons arrival on March 24, 1862. Woodworth, p. 95. Long, p. 188.     Johnstons army of 17,000 men gave the Confederates a combined force of about 40,000 to 44,669 men at Corinth. Eicher, The Longest Night, p. 223. On March 29, 1862, Johnston officially took command of this combined force, which continued to use the Army of the Mississippi name under which it had been organized by Beauregard on March 5. Long, 190. Eicher, Civil War High Commands p. 887 and Eicher, The Longest Night p. 219 are nearly alone in referring to this army as the Army of Mississippi. Muir, p. 85, in discussing the first Army of Mississippi includes this army as one of three in the article with that title but states: Historians have pointed out that the Army of Mississippi is frequently mentioned in the Official Records as the Army of the Mississippi. Contemporaries, including Johnston and Beauregard, and modern historians call this Confederate army the Army of the Mississippi. , Volume X, Part 1, index, pp. 96–99; 385 and Part 2, p. 297 ; p. 370 ; pp. 405–409. Beauregard, p. 579. Boritt, p. 53. Connelly, Army of the Heartland: The Army of Tennessee, 1861–1862. p. 151. Connelly, Civil War Tennessee: Battles And Leaders. p. 35. Cunningham, pp. 98, 122, 397. Engle, p. 123. Hattaway, p. 163. Hess, pp. 47, 49, 112 . Isbell, p. 102. McDonough, pp. 60, 66, 78. Kennedy, p. 48. Noe, p. 19. Williams, p. 122.     Johnston now planned to defeat the Union forces piecemeal before the various Union units in Kentucky and Tennessee under Grant with 40,000 men at nearby ": null
    },
    {
        "Pittsburg Landing, Tennessee": "pittsburg landing, tennessee"
    },
    {
        ", and the now Maj. Gen. Don Carlos Buell on his way from Nashville with 35,000 men, could unite against him. Johnston started his army in motion on April 3, 1862, intent on surprising Grants force as soon as the next day, but they moved slowly due to their inexperience, bad roads, and lack of adequate staff planning. Woodworth, pp. 96–97. Long, p. 192 Due to the delays, as well as several contacts with the enemy, Johnstons second in command, ": null
    },
    {
        "P. G. T. Beauregard": "p. g. t. beauregard"
    },
    {
        ", felt the element of surprise had been lost and recommended calling off the attack. Johnston decided to proceed as planned, stating I would fight them if they were a million. McWhiney; Jamieson, p. 162. His army was finally in position within a mile or two of Grants force, and undetected, by the evening of April 5, 1862. Woodworth, p. 97. Long, pp. 193–194. Weigley, p. 113. McPherson, pp. 406–407. Johnston did not achieve total surprise as some Union pickets were alerted to the Confederate presence and provided warning to some Union units before the attack began.          Johnston launched a massive surprise attack with his concentrated forces against Grant at the ": null
    },
    {
        "Battle of Shiloh": "battle of shiloh"
    },
    {
        " on April 6, 1862. As the Confederate forces overran the Union camps, Johnston seemed to be everywhere, personally leading and rallying troops up and down the line on his horse. One of his most famous moments in the battle occurred when he witnessed some of his soldiers breaking from the ranks to pillage and loot the Union camps, and was outraged to see a young lieutenant among them. None of that, sir, Johnston roared at the officer, we are not here for plunder. Then, realizing he had embarrassed the man,  /ref  ref  /ref  ref name civilwarlandscapes.org  /ref  ref name civilwarlandscapes.org /  ref /ref  ref /ref  ref  /ref ref name Eicher322 / ref /ref ref /ref  ref  /ref  ref  /ref  ref  /ref  ref name Monthly  /ref  ref name TSC  /ref  ref  /ref  ref  /ref ref ": null
    }
]