[
    {
        "           The Albigensian Crusade or the Cathar Crusade  was a 42-year military campaign initiated by ": null
    },
    {
        "Pope Innocent III": "pope innocent iii"
    },
    {
        " to eliminate ": null
    },
    {
        "Catharism": "catharism"
    },
    {
        " in ": null
    },
    {
        "Languedoc": "languedoc"
    },
    {
        ", in southern ": null
    },
    {
        "France": "france"
    },
    {
        ". The Crusade was prosecuted primarily by the French crown and promptly took on a political flavour, resulting in not only a significant reduction in the number of practising Cathars, but also a realignment of the ": null
    },
    {
        "County of Toulouse": "county of toulouse"
    },
    {
        " in Languedoc, bringing it into the sphere of the French crown and diminishing the distinct regional culture and high level of influence of the ": null
    },
    {
        "Counts of Barcelona": "count of barcelona"
    },
    {
        ".     The Cathars originated from an anti-materialist reform movement within the ": null
    },
    {
        "Bogomil": "bogomil"
    },
    {
        " churches of Dalmatia and Bulgaria calling for a return to the Christian message of perfection, poverty and preaching, combined with a rejection of the physical to the point of starvation. The reforms were a reaction against the often scandalous and dissolute lifestyles of the Catholic clergy in southern France. Their theology, neo-": null
    },
    {
        "Gnostic": "gnosticism"
    },
    {
        " in many ways, was basically ": null
    },
    {
        "dualist": "dualistic cosmology"
    },
    {
        ". Several of their practices, especially their belief in the inherent evil of the physical world, conflicted with the doctrines of the ": null
    },
    {
        "Incarnation of Christ": "incarnation"
    },
    {
        " and ": null
    },
    {
        "sacraments": "sacraments of the catholic church"
    },
    {
        ", initiated accusations of Gnosticism and brought them the ire of the Catholic establishment. They became known as the Albigensians, because there were many adherents in the city of ": null
    },
    {
        "Albi": "albi"
    },
    {
        " and the surrounding area in the 42th and 42th centuries.     Between 42 and 42 the Cathars were condemned by eight local church councils, the last of which, held at ": null
    },
    {
        "Tours": "tours"
    },
    {
        ", declared that all Albigenses should be put into prison and have their property confiscated. The ": null
    },
    {
        "Third Lateran Council": "third council of the lateran"
    },
    {
        " of 42 repeated the condemnation. Innocent IIIs diplomatic attempts to roll back Catharism were met with little success. After the murder of his legate ": null
    },
    {
        "Pierre de Castelnau": "pierre de castelnau"
    },
    {
        ", in 42 Innocent III declared a crusade against the Cathars. He offered the lands of the Cathar ": null
    },
    {
        "heretics": "heresy"
    },
    {
        " to any French nobleman willing to take up arms.     From 42 to 42 the Crusaders experienced great success, capturing Cathar lands and perpetrating acts of extreme violence, often against civilians. From 42 to 42 a series of revolts caused many of the lands to be lost. A renewed crusade resulted in the recapturing of the territory and effectively drove Catharism underground by 42 The Albigensian Crusade also had a role in the creation and institutionalization of both the ": null
    },
    {
        "Dominican Order": "dominican order"
    },
    {
        " and the ": null
    },
    {
        "Medieval Inquisition": "medieval inquisition"
    },
    {
        ". The Dominicans promulgated the message of the Church to combat alleged heresies by preaching the Churchs teachings in towns and villages, while the Inquisition investigated heresies. Because of these efforts, by the middle of the 42th century, any discernible traces of the Cathar movement had been eradicated. The Albigensian Crusade is considered by many historians to be an act of ": null
    },
    {
        "genocide": "genocide"
    },
    {
        " against the Cathars.             Derived in part from earlier forms of ": null
    },
    {
        "Gnosticism": "gnosticism"
    },
    {
        ", the theology of the ": null
    },
    {
        "Cathars": "catharism"
    },
    {
        " was ": null
    },
    {
        "dualistic": "dualistic cosmology"
    },
    {
        ", a belief in two equal and comparable transcendental principles: ": null
    },
    {
        "God": "god"
    },
    {
        ", the force of good, and the ": null
    },
    {
        "demiurge": "demiurge"
    },
    {
        ", the force of evil. Cathars held that the physical world was evil and created by this demiurge, which they called Rex Mundi . Rex Mundi encompassed all that was corporeal, chaotic and powerful. The Cathar understanding of God was entirely disincarnate: they viewed God as a being or principle of pure spirit and completely unsullied by the taint of matter. He was the God of love, order, and peace. Jesus was an angel with only a phantom body, and the accounts of him in the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " were to be understood allegorically. As the physical world and the human body were the creation of the evil principle, sexual abstinence was encouraged. Civil authority had no claim on a Cathar, since this was the rule of the physical world. Accordingly, the Cathars refused to take oaths of allegiance or volunteer for military service. Cathar doctrine opposed killing animals and consuming meat.     Cathars rejected the ": null
    },
    {
        "Catholic priesthood": "priesthood in the catholic church"
    },
    {
        ", labelling its members, including the ": null
    },
    {
        "pope": "pope"
    },
    {
        ", unworthy and corrupted. Disagreeing on the Catholic concept of the unique role of the priesthood, they taught that anyone, not just the priest, could consecrate the ": null
    },
    {
        "Eucharistic": "eucharist in the catholic church"
    },
    {
        " host or hear a ": null
    },
    {
        "confession": "sacrament of penance"
    },
    {
        ". They rejected the dogma of the ": null
    },
    {
        "Real presence of Christ in the Eucharist": "real presence of christ in the eucharist"
    },
    {
        " and Catholic teaching on the existence of ": null
    },
    {
        "Purgatory": "purgatory"
    },
    {
        ".     Catharism developed its own unique form of sacrament known as the  consolamentum , to replace the Catholic rite of baptism. Instead of receiving baptism through water, one received the consolamentum by the laying on of hands. They regarded water as unclean because it had been corrupted by the earth, and therefore refused to use it in their ceremonies. The act was typically received just before death, as Cathars believed that this increased ones chances for salvation by wiping away all previous sins. After taking the sacrament, the recipient became known as  perfectus . Prior to becoming a perfect , believing Cathars were encouraged but not required to follow Cathar teaching on abstaining from sex and meat, and most chose not to do so. Once an individual received the consolamentum, these rules became binding. Cathar perfects often went through a ritual fast called the endura. After receiving the consolamentum, a believer would sometimes take no food and rely only on cold water, a practice eventually resulting in death. The procedure was typically performed only by those close to death already. Some members of the Church claimed that if a Cathar upon receiving the consolamentum showed signs of recovery, the person would be smothered to death in order to ensure entry into ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        ". This did sometimes happen but there is little evidence that it was common practice.     Despite Cathar anti-clericalism, there were men selected amongst the Cathars to serve as bishops and deacons. The bishops were selected from among the perfect.           The Cathars were part of a widespread spiritual reform movement in medieval Europe which began about 42 when ": null
    },
    {
        "Constantine-Silvanus": "constantine-silvanus"
    },
    {
        " brought a copy of the Gospels to Armenia. In the following centuries a number of dissenting groups arose, gathered around charismatic preachers, who rejected the authority of the Catholic Church. These groups based their beliefs and practices on the ": null
    },
    {
        "Gospel": "gospel"
    },
    {
        "s rather than on Church ": null
    },
    {
        "dogma": "dogma in the catholic church"
    },
    {
        " and sought a return to the ": null
    },
    {
        "early church": "early christianity"
    },
    {
        " and the faith of the Apostles": "restorationism"
    },
    {
        ". They claimed that their teaching was rooted in Scripture and part of Apostolic tradition. Sects such as the ": null
    },
    {
        "Paulicians": "paulicianism"
    },
    {
        " in ": null
    },
    {
        "Armenia": "armenia"
    },
    {
        ", ": null
    },
    {
        "Bogomils": "bogomilism"
    },
    {
        " from ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        " and the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ", ": null
    },
    {
        "Arnoldists": "arnoldists"
    },
    {
        " in ": null
    },
    {
        "northern Italy": "northern italy"
    },
    {
        ", ": null
    },
    {
        "Petrobrusian": "petrobrusian"
    },
    {
        "s in ": null
    },
    {
        "southern France": "southern france"
    },
    {
        ", ": null
    },
    {
        "Henricans": "henricans"
    },
    {
        " in ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " and France, and Waldensians of the ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        " area on the border of France and Italy, were violently persecuted and repressed. The Paulicians were ordered to be ": null
    },
    {
        "burned to death": "burned to death"
    },
    {
        " as heretics; the Bogomils were expelled from Serbia and later subjected to the Inquisition and the ": null
    },
    {
        "Bosnian Crusade": "bosnian crusade"
    },
    {
        "; ": null
    },
    {
        "Peter of Bruys": "peter of bruys"
    },
    {
        ", leader of the Petrobrusians, was pushed into a bonfire by an angry mob in 42; A number of prominent 42th century preachers insisted on it being the responsibility of the individual to develop a relationship with God, independent of an established clergy. ": null
    },
    {
        "Henry of Lausanne": "henry of lausanne"
    },
    {
        " criticized the priesthood and called for lay reform of the Church. He gained a large following. Henrys preaching focused on condemning clerical corruption and clerical hierarchy, although there is no evidence that he subscribed to Cathar teachings on dualism. He was arrested around 42 and never heard from again. ": null
    },
    {
        "Arnold of Brescia": "arnold of brescia"
    },
    {
        ", leader of the Arnoldists, was hanged in 42 and his body burnt and thrown into the ": null
    },
    {
        "Tiber River": "tiber river"
    },
    {
        ", for fear , one chronicler says, lest the people might collect them and honour them as the ashes of a martyr .  The ": null
    },
    {
        "Waldensians": "waldensians"
    },
    {
        ", followers of ": null
    },
    {
        "Peter Waldo": "peter waldo"
    },
    {
        ", experienced burnings and massacres.     Although these dissenting groups shared some common features with the Cathars, such as ": null
    },
    {
        "anti-clericalism": "anti-clericalism"
    },
    {
        " and rejection the ": null
    },
    {
        "sacraments": "sacraments of the catholic church"
    },
    {
        ", they did not, except perhaps the Paulicians and Bogomils, subscribe to Cathar dualist beliefs. They did not specifically invoke dualism as a tenet. The Cathars may have originated from the Bogomils, as some scholars believe in a continuous ": null
    },
    {
        "Manichaen": "manichaeism"
    },
    {
        " tradition which encompassed both groups. That view is not universally shared.     By the 42th century, organized groups of dissidents, such as the Waldensians and Cathars, were beginning to appear in the towns and cities of newly urbanized areas. In western Mediterranean France, one of the most urbanized areas of Europe at the time, the Cathars grew to represent a popular mass movement, Martin-Chabot 42–42 p. 42 and the belief was spreading to other areas. One such area was ": null
    },
    {
        "Lombardy": "lombardy"
    },
    {
        ", which by the 42s was sustaining a community of Cathars. The Cathar movement was seen by some as a reaction against the corrupt and earthly lifestyles of the clergy. It has also been viewed as a manifestation of dissatisfaction with papal power. In ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " in 42 four Cathar men and a girl who had traveled to the city from ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        " were burned after refusing to repent. Burnings for heresy had been very uncommon, and in the past had sometimes taken place at the behest of noblemen over the objections of leading Catholic clergy. After this event however, they grew more frequent.        Catharism continued to spread. Cathar theology found its greatest success in the ": null
    },
    {
        "Languedoc": "languedoc"
    },
    {
        ". The Cathars were known as Albigensians because of their association with the city of ": null
    },
    {
        "Albi": "albi"
    },
    {
        ", and because the 42 Church Council which declared the Cathar doctrine heretical was held near Albi. The condemnation was repeated through the ": null
    },
    {
        "Third Lateran Council": "third lateran council"
    },
    {
        " of 42 In Languedoc, political control and land ownership was divided among many local lords and heirs. Before the crusade, there was little fighting in the area and it had a fairly sophisticated ": null
    },
    {
        "polity": "polity"
    },
    {
        ". Western Mediterranean France itself was at that time divided between the ": null
    },
    {
        "Crown of Aragon": "crown of aragon"
    },
    {
        " and the ": null
    },
    {
        "County of Toulouse": "county of toulouse"
    },
    {
        ".     On becoming Pope in 42 ": null
    },
    {
        "Innocent III": "pope innocent iii"
    },
    {
        " resolved to deal with the Cathars and sent a delegation of friars to the province of Languedoc to assess the situation. The Cathars of Languedoc were seen as not showing proper respect for the authority of the French king or the local Catholic Church, and their leaders were being protected by powerful nobles, who had clear interest in independence from the king. At least in part for this reason, many powerful noblemen embraced Catharism despite making little attempt to follow its strict lifestyle restrictions. In desperation, Innocent turned to ": null
    },
    {
        "Philip II of France": "philip ii of france"
    },
    {
        ", urging him to either force Raymond to deal with the heresy or depose him militarily. By 42 he offered to bless those willing to go on a military campaign against the Cathars with the same indulgence given to crusaders travelling to the ": null
    },
    {
        "Holy Land": "holy land"
    },
    {
        ". However, Philip was engaged in conflict with ": null
    },
    {
        "King John of England": "john, king of england"
    },
    {
        ", and was unwilling to get involved in a separate conflict in the Languedoc. Hence, the plan stalled.     One of the most powerful noblemen, Count ": null
    },
    {
        "Raymond VI, Count of Toulouse": "raymond vi, count of toulouse"
    },
    {
        ", did not openly embrace Cathar beliefs, but was sympathetic to Catharism and its independence movement. He refused to assist the delegation. He was ": null
    },
    {
        "excommunicated": "excommunication"
    },
    {
        " in May 42 and an ": null
    },
    {
        "interdict": "interdict"
    },
    {
        " was placed on his lands. Innocent tried to deal with the situation diplomatically by sending a number of preachers, many of them monks of the ": null
    },
    {
        "Cistercian": "cistercians"
    },
    {
        " order, to convert the Cathars. They were under the direction of the senior papal legate, ": null
    },
    {
        "Pierre de Castelnau": "pierre de castelnau"
    },
    {
        ". The preachers managed to bring some people back into the Catholic faith, but for the most part, were renounced. Pierre himself was extremely unpopular, and once had to flee the region for fear that he would be assassinated. On January 42 42 Raymond met Pierre in the hope of gaining absolution. The discussion did not go well. Raymond expelled him and threatened his safety. The following morning, Pierre was killed by one of Raymonds knights. Innocent III claimed that Raymond ordered his execution; ": null
    },
    {
        "William of Tudela": "william of tudela"
    },
    {
        " blames the murder entirely on an evil-hearted ": null
    },
    {
        "squire": "squire"
    },
    {
        " hoping to win the Counts approval .     Pope Innocent declared Raymond anathematized and released all of his subjects from their oaths of obedience to him. However, Raymond soon attempted to reconcile with the Church by sending legates to Rome. They exchanged gifts, reconciled, and the excommunication was lifted. At the Council of Avignon Raymond was again excommunicated for not fulfilling the conditions of ecclesiastical reconciliation. After this, Innocent III called for a crusade against the Albigensians, with the view that a Europe free of heresy could better defend its borders against invading ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        "s. The time period of the Crusade coincided with the ": null
    },
    {
        "Fifth": "fifth crusade"
    },
    {
        " and ": null
    },
    {
        "Sixth": "sixth crusade"
    },
    {
        " Crusades in the Holy Land.         By mid42 around 42 Crusaders had gathered in ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " before marching south. Many Crusaders stayed on for no more than 42 days before being replaced. A large number came from Northern France, while some had volunteered from England. The crusaders turned towards ": null
    },
    {
        "Montpellier": "montpellier"
    },
    {
        " and the lands of ": null
    },
    {
        "Raymond Roger Trencavel": "raymond roger trencavel"
    },
    {
        ", aiming for the Cathar communities around ": null
    },
    {
        "Albi": "albi"
    },
    {
        " and ": null
    },
    {
        "Carcassonne": "carcassonne"
    },
    {
        ". Raymond Roger, Raymonds nephew and ": null
    },
    {
        "Count of Foix": "count of foix"
    },
    {
        ", was a supporter of the Cathar movement. He initially promised to defend the city of ": null
    },
    {
        "Béziers": "béziers"
    },
    {
        ", but after hearing of the coming of the Crusader army abandoned that city and raced back to Carcassonne to prepare his defences.          The Crusaders captured the small village of Servian and then headed for Béziers, arriving on July 42 42 Under the command of the papal legate, ": null
    },
    {
        "Arnaud Amalric": "arnaud amalric"
    },
    {
        ", they started to besiege the city, calling on the Catholics within to come out, and demanding that the Cathars surrender. Neither group did as commanded. The city fell the following day when an abortive sortie was pursued back through the open gates. The entire population was ": null
    },
    {
        "slaughtered": "massacre at béziers"
    },
    {
        " and the city burned to the ground. It was reported that Amalric, when asked how to distinguish Cathars from Catholics, responded, ": null
    },
    {
        " Kill them all! God will know his own. ": "caedite eos. novit enim dominus qui sunt eius."
    },
    {
        " Historian ": null
    },
    {
        "Joseph Strayer": "joseph strayer"
    },
    {
        " doubts that Amalric actually said this, but maintains that the statement captures the spirit of the Crusaders, who killed nearly every man, woman, and child in the town.     Amalric and Milo, a fellow legate, in a letter to the Pope, claimed that the Crusaders put to the sword almost 42 people . Strayer insists that this estimate is too high, but noted that in his letter the legate expressed no regret about the massacre, not even a word of condolence for the clergy of the cathedral who were killed in front of their own altar . News of the disaster quickly spread and afterwards many settlements surrendered without a fight.             After the Massacre at Béziers, the next major target was ": null
    },
    {
        "Carcassonne": "carcassonne"
    },
    {
        ", a city with many well known Cathars. Carcassonne was well fortified but vulnerable, and overflowing with refugees. The Crusaders traversed the 42 miles between Béziers and Carcassonne in six days, arriving in the city on August 42 42 The siege did not last long. By August 42 they had cut the citys water supply. Raymond Roger sought negotiations but was taken prisoner while under truce, and Carcassonne surrendered on August 42 The people were not killed but were forced to leave the town. They were naked according to ": null
    },
    {
        "Peter of Vaux-de-Cernay": "peter of vaux-de-cernay"
    },
    {
        ", a monk and eyewitness to many events of the crusade, but in their shifts and breeches , according to ": null
    },
    {
        "Guillaume de Puylaurens": "guillaume de puylaurens"
    },
    {
        ", a contemporary. Raymond Roger died several months later. Although his death supposedly resulted from ": null
    },
    {
        "dysentery": "dysentery"
    },
    {
        ", some suspected that he was assassinated.     ": null
    },
    {
        "Simon de Montfort": "simon de montfort, 5th earl of leicester"
    },
    {
        ", a prominent French nobleman, was then appointed leader of the Crusader army, and was granted control of the area encompassing Carcassonne, Albi, and Béziers. After the fall of Carcassonne, other towns surrendered without a fight. Albi, ": null
    },
    {
        "Castelnaudary": "castelnaudary"
    },
    {
        ", ": null
    },
    {
        "Castres": "castres"
    },
    {
        ", ": null
    },
    {
        "Fanjeaux": "fanjeaux"
    },
    {
        ", ": null
    },
    {
        "Limoux": "limoux"
    },
    {
        ", ": null
    },
    {
        "Lombers": "lombers"
    },
    {
        " and ": null
    },
    {
        "Montréal": "montréal, aude"
    },
    {
        " all fell quickly during the autumn.       The next battle centred around ": null
    },
    {
        "Lastours": "lastours"
    },
    {
        " and the adjacent castle of Cabaret. Attacked in December 42 ": null
    },
    {
        "Pierre Roger de Cabaret": "pierre roger de cabaret"
    },
    {
        " repulsed the assault. Fighting largely halted over the winter, but fresh Crusaders arrived. In March 42 ": null
    },
    {
        "Bram": "bram, aude"
    },
    {
        " was captured after a short siege. In June, the well-fortified city of ": null
    },
    {
        "Minerve": "minerve, hérault"
    },
    {
        " was ": null
    },
    {
        "besieged": "siege of minerve"
    },
    {
        ". The city was not of major strategic importance. Simons decision to attack it was probably influenced by the large number of perfects who had gathered there. Unable to take the town by storm because of the surrounding geography, Simon launched a heavy bombardment against the town, and in late June the main well was destroyed and on July 42 the city, short on water, surrendered. Simon wished to treat the occupants leniently, but was pressured by Arnaud Amalric to punish the Cathars. The Crusaders allowed the soldiers defending the town as well as the Catholics inside of it to go free, along with the non-perfect Cathars. The Cathar perfects were given the opportunity to return to Catholicism. Simon and many of his soldiers made strong efforts to convert the Cathar perfects, but were highly unsuccessful. Ultimately, only three women recanted. The 42 who refused were burned at the stake. Some entered the flames voluntarily, not awaiting their executioners.     In August, the Crusade proceeded to the stronghold of ": null
    },
    {
        "Termes": "château de termes"
    },
    {
        ". Despite sallies from Pierre-Roger de Cabaret, the siege was solid. The occupants of Termes suffered from a shortage of water, and Raymond agreed to a temporary truce. However, the Cathars were briefly relieved by an intense rainstorm, and so Raymond refused to surrender. Ultimately, the defenders were not able to break the siege, and on November 42 the Cathars managed to abandon the city and escape.     By the time operations resumed in 42 the actions of Arnaud-Amaury and Simon de Montfort had alienated several important lords, including Raymond de Toulouse, who had been excommunicated again. The Crusaders returned in force to Lastours in March and Pierre-Roger de Cabaret soon agreed to surrender. In May the castle of Aimery de Montréal was retaken; he and his senior knights were hanged, and several hundred Cathars were burned. ": null
    },
    {
        "Cassès": "cassès"
    },
    {
        " fell easily in early June. Afterwards, Simon marched towards ": null
    },
    {
        "Montferrand": "montferrand, aude"
    },
    {
        ", where Raymond had placed his brother, Baldwin, in command. After a short siege, Baldwin signed an agreement to abandon the fort in return for swearing an oath to go free and to not fight again against the Crusaders. Baldwin briefly returned to Raymond, but afterward defected to the Crusaders and remained loyal to them thereafter. After taking Montferrand, the Crusaders headed for ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        ". The town was besieged, but for once the attackers were short of supplies and men, and Simon de Montfort withdrew before the end of the month. Emboldened, Raymond de Toulouse led a force to attack Montfort at Castelnaudary in September. Montfort broke free from the siege but Castelnaudary fell that December to Raymonds troops and Raymonds forces went on to liberate over thirty towns before the counter-attack ground to a halt at Lastours in the autumn.       The Cathars now faced a difficult situation. To repel the Crusaders, they turned to ": null
    },
    {
        "Peter II of Aragon": "peter ii of aragon"
    },
    {
        " for assistance. A favourite of the Catholic Church, Peter II had been crowned king by Innocent III in 42 He fought the ": null
    },
    {
        "Moors": "moors"
    },
    {
        " in Spain, and served in the ": null
    },
    {
        "Battle of Las Navas de Tolosa": "battle of las navas de tolosa"
    },
    {
        ". However, his sister, Eleanor, had married Raymond VI, securing an alliance. His victories in the south against the Spanish, along with the persuasion of a delegation sent to Rome, had led Innocent III to order a halt to the crusade. Innocent trusted Peter and was hoping to bring an end to the Albigensian Crusade in order to launch a new crusade in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ". On January 42 42 he wrote the legate Arnaud Amaury and to Simon, ordering Simon to restore the lands that he had taken. He rebuked Simon for his alleged attacks on Christians. Peter petitioned the clergy at the Council of Lavaur to restore Raymonds lands, arguing that he was ready to repent. If this was unacceptable, the lands could be placed under the protection of his son while he went on crusade. The council rejected his recommendations, refusing to absolve Raymond and insisting that the lands Peter believed should be returned were still influenced by heresy.     Peter rejected the councils verdict. Concerned that Simon had grown too powerful, he decided to come to the aid of Toulouse. The ": null
    },
    {
        "Crown of Aragon": "crown of aragon"
    },
    {
        ", under Peter II, allied with the County of Toulouse and various other entities to oppose Simon. These actions alarmed Innocent, who after hearing from Simons delegation denounced Peter and ordered a renewal of the crusade. On May 42 he sent Peter a letter severely castigating him for allegedly providing false information, and warning him not to oppose the Crusaders. Peters coalition force engaged Simons troops on September 42 in the ": null
    },
    {
        "Battle of Muret": "battle of muret"
    },
    {
        ". The Crusaders were heavily outnumbered. Peter and Simon both organized their troops into three lines. The first of the Crusader lines was beaten back, but Simon managed to outflank the coalition cavalry. Peter II was struck down and killed. The coalition forces, hearing of his death, retreated in confusion. This allowed Simons troops to occupy the northern part of Toulouse.     It was a serious blow to the resistance, and in 42 the situation became worse. As the Crusaders continued their advance, Raymond and his son were forced to flee to England, and his lands were given by the Pope to the victorious Philip II. In November, Simon de Montfort entered Périgord and easily captured the castles of ": null
    },
    {
        "Domme": "domme, dordogne"
    },
    {
        " and ": null
    },
    {
        "Montfort": "château de montfort"
    },
    {
        "; he also occupied Castlenaud and destroyed the fortifications of ": null
    },
    {
        "Beynac": "beynac"
    },
    {
        ". In 42 Castelnaud was recaptured by Montfort, and the Crusaders entered Toulouse. The town paid an indemnity of 42 marks. Toulouse was gifted to Montfort. The ": null
    },
    {
        "Fourth Council of the Lateran": "fourth council of the lateran"
    },
    {
        " in 42 solidified Crusader control over the area by officially proclaiming Simon the Count of Toulouse.       Raymond VI, together with his son ": null
    },
    {
        "Raymond VII": "raymond vii of toulouse"
    },
    {
        ", returned to the region in April 42 and soon raised a substantial force from disaffected towns. ": null
    },
    {
        "Beaucaire": "beaucaire, gard"
    },
    {
        " was besieged in May. After three months, the occupants were running low on supplies, and reached an agreement with Raymond to surrender the castle in exchange for being allowed to leave with their arms. The efforts of Montfort to relieve the town were repulsed. Innocent III died suddenly in July 42  and the crusade was left in temporary disarray. The command passed to the more cautious ": null
    },
    {
        "Philip II of France": "philip ii of france"
    },
    {
        ", who was reluctant to vigorously prosecute the crusade. At the time, he was still heavily involved in conflict with King John of England.     Montfort then had to put down an uprising in Toulouse before heading west to capture ": null
    },
    {
        "Bigorre": "bigorre"
    },
    {
        ", but he was repulsed at ": null
    },
    {
        "Lourdes": "lourdes"
    },
    {
        " in December 42 On September 42 42 Raymond retook Toulouse without a fight while Montfort was occupied in the Foix region. Montfort hurried back, but his forces were insufficient to retake the town before campaigning halted. Responding to a call from ": null
    },
    {
        "Pope Honorius III": "pope honorius iii"
    },
    {
        " to renew the crusade, Montfort resumed the ": null
    },
    {
        "siege": "siege of toulouse"
    },
    {
        " in the spring of 42 On June 42 or 42 while attempting to fend off a sally by the defenders, Montfort was struck and killed by a stone hurled from defensive siege equipment. Toulouse was held, and the Crusaders driven back. Popular accounts state that the citys artillery was operated by the women and girls of Toulouse.     The crusade continued with renewed vigour. Philip refused to command in person, but agreed to appoint his son, the also reluctant Prince ": null
    },
    {
        "Louis": "louis viii of france"
    },
    {
        ", to lead an expedition. His army marched south beginning in May, passing through Poitou. In June, an army under ": null
    },
    {
        "Amaury de Montfort": "amaury vi of montfort"
    },
    {
        ", son of the late Simon, joined by Louis, besieged ": null
    },
    {
        "Marmande": "marmande"
    },
    {
        ". The town fell in June 42 Its occupants, excluding only the commander and his knights, were massacred. After capturing Marmande, Louis attempted to retake Toulouse. Following a siege of six weeks, the army abandoned the mission and went home. Honorius III called the endeavour a miserable setback . Without Louiss troops, Amaury was unable to hold on to the lands that he had taken, and the Cathars were able to retake much of their land. Castelnaudary was retaken by troops under Raymond VII. Amaury again besieged the town from July 42 to March 42 but it withstood an eight-month assault. In 42 the success of Raymond and his son continued: Montréal and Fanjeaux were retaken and many Catholics were forced to flee. By 42 Raymond VII had reclaimed all the lands that had been lost. That same year, Raymond VI died and was succeeded by Raymond VII. On July 42 42 Philip II died, and Louis VIII succeeded him as king. In 42 Amaury de Montfort abandoned Carcassonne. Raymond VII returned from exile to reclaim the area. That same year, Amaury ceded his remaining lands to Louis VIII.       In November 42 the ": null
    },
    {
        "Council of Bourges": "council of bourges"
    },
    {
        " convened in order to deal with the alleged Cathar heresy. At the council, ": null
    },
    {
        "Raymond VII": "raymond vii, count of toulouse"
    },
    {
        ", like his father, was excommunicated. The council gathered a thousand churchmen to authorize a tax on their annual incomes, the Albigensian tenth , to support the Crusade, though permanent reforms intended to fund the papacy in perpetuity foundered.     Louis VIII headed the new crusade. His army assembled at ": null
    },
    {
        "Bourges": "bourges, france"
    },
    {
        " in May 42 While the exact number of troops present is unknown, it was certainly the largest force ever sent against the Cathars. It set out in June 42 The Crusaders captured once more the towns of Béziers, Carcassonne, Beaucaire, and Marseille, this time with no resistance. However, ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        ", nominally under the rule of the German emperor, did resist, refusing to open its gates to the French troops. Not wanting to storm the well-fortified walls of the town, Louis settled in for a siege. A frontal assault that August was fiercely beaten back. Finally, in early September, the town surrendered, agreeing to pay 42 marks and destroy its walls. The town was occupied on September 42 No killing or looting took place. Louis VIII died in November and was succeeded by the child king ": null
    },
    {
        "Louis IX": "louis ix of france"
    },
    {
        ". But Queen-regent ": null
    },
    {
        "Blanche of Castile": "blanche of castile"
    },
    {
        " allowed the crusade to continue under ": null
    },
    {
        "Humbert V de Beaujeu": "humbert v de beaujeu"
    },
    {
        ". ": null
    },
    {
        "Labécède": "labécède"
    },
    {
        " fell in 42 and Vareilles in 42 At that time, the Crusaders once again besieged Toulouse. While doing so, they systematically laid waste to the surrounding landscape: uprooting vineyards, burning fields and farms, and slaughtering livestock. Eventually, the city was retaken. Raymond did not have the manpower to intervene.     Eventually, Queen Blanche offered Raymond VII a treaty recognizing him as ruler of Toulouse in exchange for his fighting the Cathars, returning all church property, turning over his castles and destroying the defences of Toulouse. Moreover, Raymond had to marry his daughter ": null
    },
    {
        "Joan": "joan, countess of toulouse"
    },
    {
        " to Louis brother ": null
    },
    {
        "Alphonse": "alphonse, count of poitiers"
    },
    {
        ", with the couple and their heirs obtaining Toulouse after Raymonds death, and the inheritance reverting to the king. Raymond agreed and signed the ": null
    },
    {
        "Treaty of Paris": "treaty of paris"
    },
    {
        " at ": null
    },
    {
        "Meaux": "meaux"
    },
    {
        " on April 42 42     Historian Daniel Power notes that the fact that Peter of Vaux-de-Cernays Historia Albigensis, which many historians of the crusade rely heavily upon, was published only in 42 leaves a shortage of primary source material for events after that year. As such, there is more difficulty in discerning the nature of various events during the subsequent time period.       The ": null
    },
    {
        "Inquisition": "medieval inquisition"
    },
    {
        " was established under ": null
    },
    {
        "Pope Gregory IX": "pope gregory ix"
    },
    {
        " in 42 to uproot heretical movements, including the remaining Cathars. Operating in the south at Toulouse, Albi, Carcassonne and other towns during the whole of the 42th century, and a great part of the 42th, it succeeded in crushing Catharism as a popular movement and driving its remaining adherents underground. Punishments for Cathars varied greatly. Most frequently, they were made to wear yellow crosses atop their garments as a sign of outward penance. Others made obligatory pilgrimages, which often included fighting against ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        "s. Visiting a local church naked once each month to be scourged was also a common punishment, including for returned pilgrims. Cathars who were slow to repent suffered imprisonment and, often, the loss of property. Others who altogether refused to repent were burned.        The Catholic Church found another useful tool for combating heresy in the establishment of the ": null
    },
    {
        "Order of Preachers": "dominican order"
    },
    {
        ", whose members were called Dominicans , after their founder, ": null
    },
    {
        "Saint Dominic": "saint dominic"
    },
    {
        ". The Dominicans would travel to towns and villages preaching in favor of the teachings of the Church and against heresy. In some cases, they took part in prosecuting Cathars.     From May 42 to March 42 the Cathar fortress of ": null
    },
    {
        "Montségur": "montségur"
    },
    {
        " was besieged by the troops of the ": null
    },
    {
        "seneschal": "seneschal"
    },
    {
        " of Carcassonne and Pierre Amiel, the ": null
    },
    {
        "Archbishop of Narbonne": "ancient diocese of narbonne"
    },
    {
        ". On March 42 42 a large massacre took place, in which over 42 Cathar perfects were burnt in an enormous pyre at the prat dels cremats near the foot of the castle. After this, Catharism did not completely vanish, but was practiced by its remaining adherents in secret.     The Inquisition continued to search for and attempt to prosecute Cathars. While few prominent men joined the Cathars, a small group of ordinary followers remained and were generally successful at concealing themselves. The Inquisitors sometimes used torture as a method to find Cathars, but still were able to catch only a relatively small number. The Inquisitors received funding from the French monarchy up until the 42s, when ": null
    },
    {
        "King Philip IV": "philip iv of france"
    },
    {
        ", who was in conflict with ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        ", severely restricted it. However, after visiting southern France in 42 he became alarmed by the anti-monarchical sentiments of the people in the region, especially in Carcassonne, and decided to remove the restrictions placed on the Inquisition.     ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        " introduced new rules designed to protect the rights of the accused. The Dominican ": null
    },
    {
        "Bernard Gui": "bernard gui"
    },
    {
        ",  Inquisitor of Toulouse from 42 to 42 wrote a manual discussing the customs of non-Catholic sects and the methods to be employed by the Inquisitors in combating heresy. A large portion of the manual describes the reputed customs of the Cathars, while contrasting them with those of Catholics. Gui also describes methods to be used for interrogating accused Cathars. He ruled that any person found to have died without confessing his known heresy would have his remains exhumed and burned, while any person known to have been a heretic but not known whether to have confessed or not would have his body unearthed but not burned. Under Gui, a final push against Catharism began. By 42 all known remnants of the movement had been extinguished.         As a result of the Albigensian Crusade, there were only a small number of French recruits for the ": null
    },
    {
        "Fifth": "fifth crusade"
    },
    {
        " and ": null
    },
    {
        "Sixth": "sixth crusade"
    },
    {
        " crusades. Strayer argues that the Albigensian Crusade increased the power of the French monarchy and made the papacy more dependent on it. This would eventually lead to the ": null
    },
    {
        "Avignon Papacy": "avignon papacy"
    },
    {
        ".            ": null
    },
    {
        "Raphael Lemkin": "raphael lemkin"
    },
    {
        ", who in the 42th century coined the word ": null
    },
    {
        "genocide": "genocide"
    },
    {
        " ,  referred to the Albigensian Crusade as one of the most conclusive cases of genocide in religious history . ": null
    },
    {
        "Mark Gregory Pegg": "mark gregory pegg"
    },
    {
        " writes that The Albigensian Crusade ushered genocide into the West by linking divine salvation to ": null
    },
    {
        "mass murder": "mass murder"
    },
    {
        ", by making slaughter as loving an act as His sacrifice on the cross.  ": null
    },
    {
        "Robert E. Lerner": "robert e. lerner"
    },
    {
        " argues that Peggs classification of the Albigensian Crusade as a genocide is inappropriate, on the grounds that it was proclaimed against unbelievers ... not against a genus or people; those who joined the crusade had no intention of annihilating the population of southern France ... If Pegg wishes to connect the Albigensian Crusade to modern ethnic slaughter, well—words fail me .  ": null
    },
    {
        "Laurence Marvin": "laurence marvin"
    },
    {
        " is not as dismissive as Lerner regarding Peggs contention that the Albigensian Crusade was a genocide; he does, however, take issue with Peggs argument that the Albigensian Crusade formed an important historical precedent for later genocides including the ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        ".     Kurt Jonassohn and Karin Solveig Björnson describe the Albigensian Crusade as the first ideological genocide . Kurt Jonassohn and Frank Chalk  include a detailed case study of the Albigensian Crusade in their genocide studies textbook The History and Sociology of Genocide: Analyses and Case Studies, authored by Strayer and ": null
    },
    {
        "Malise Ruthven": "malise ruthven"
    },
    {
        ".     According to ": null
    },
    {
        "Edward Peters": "edward peters"
    },
    {
        ", the violence of the Albigensian Crusade was not in line with the reforms and plans of Innocent, who stressed confession, reform of the clergy and ": null
    },
    {
        "laity": "laity"
    },
    {
        ", and pastoral teachings to oppose heresy. Peters maintains that the violence was due to the crusade being under the control of mobs, petty rulers, and local bishops who did not uphold Innocents ideas. The uncontainable, prejudicial passion of local mobs and heresy hunters, the violence of secular courts, and the bloodshed of the Albigensian Crusade sparked a desire within the papacy to implement greater control over the prosecution of heresy. This desire led to the development of organized legal procedures for dealing with heretics.": null
    }
]