[
    {
        "         Alboin was king of the ": null
    },
    {
        "Lombards": "lombards"
    },
    {
        " from about 560 until 572. During his reign the Lombards ended their ": null
    },
    {
        "migrations": "migration period"
    },
    {
        " by settling in Italy, the northern part of which Alboin conquered between 569 and 572. He had a lasting effect on Italy and the ": null
    },
    {
        "Pannonian Basin": "pannonian basin"
    },
    {
        "; in the former his invasion marked the beginning of centuries of Lombard rule, and in the latter his defeat of the ": null
    },
    {
        "Gepids": "gepids"
    },
    {
        " and his departure from ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        " ended the dominance there of the ": null
    },
    {
        "Germanic peoples": "germanic peoples"
    },
    {
        ".     The period of Alboins reign as king in Pannonia following the death of his father, ": null
    },
    {
        "Audoin": "audoin"
    },
    {
        ", was one of confrontation and conflict between the Lombards and their main neighbors, the Gepids. The Gepids initially gained the upper hand, but in 567, thanks to his alliance with the ": null
    },
    {
        "Avars": "avars"
    },
    {
        ", Alboin inflicted a decisive defeat on his enemies, whose lands the Avars subsequently occupied. The increasing power of his new neighbours caused Alboin some unease however, and he therefore decided to leave Pannonia for Italy, hoping to take advantage of the ": null
    },
    {
        "Byzantine Empires": "byzantine empire"
    },
    {
        "reduced ability to defend its territory in the wake of the ": null
    },
    {
        "Gothic War": "gothic war"
    },
    {
        ".     After gathering a large coalition of peoples, Alboin crossed the ": null
    },
    {
        "Julian Alps": "julian alps"
    },
    {
        " in 568, entering an almost undefended Italy. He rapidly took control of most of ": null
    },
    {
        "Venetia": "venetia"
    },
    {
        " and ": null
    },
    {
        "Liguria": "liguria"
    },
    {
        ". In 569, unopposed, he took northern Italys main city, ": null
    },
    {
        "Milan": "milan"
    },
    {
        ". ": null
    },
    {
        "Pavia": "pavia"
    },
    {
        " offered stiff resistance however, and was taken only after a siege lasting three years. During that time Alboin turned his attention to ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        ", but signs of factionalism among his supporters and Alboins diminishing control over his army increasingly began to manifest themselves.     Alboin was assassinated on 28 June 572, in a ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " instigated by the Byzantines. It was organized by the kings foster brother, ": null
    },
    {
        "Helmichis": "helmichis"
    },
    {
        ", with the support of Alboins wife, ": null
    },
    {
        "Rosamund": "rosamund"
    },
    {
        ", daughter of the Gepid king whom Alboin had killed some years earlier. The coup failed in the face of opposition from a majority of the Lombards, who elected ": null
    },
    {
        "Cleph": "cleph"
    },
    {
        " as Alboins successor, forcing Helmichis and Rosamund to flee to ": null
    },
    {
        "Ravenna": "ravenna"
    },
    {
        " under imperial protection. Alboins death deprived the Lombards of the only leader who could have kept the newborn Germanic entity together, the last in the line of hero-kings who had led the Lombards through their migrations from the vale of the ": null
    },
    {
        "Elbe": "elbe"
    },
    {
        " to Italy. For many centuries following his death Alboins heroism and his success in battle were celebrated in Saxon and Bavarian epic poetry.         The name Alboin derives from the ": null
    },
    {
        "Proto-Germanic": "proto-germanic"
    },
    {
        " roots ": null
    },
    {
        "albiz": "wikt:reconstruction:proto-germanic/albiz"
    },
    {
        "  and ": null
    },
    {
        "winiz": "wikt:reconstruction:proto-germanic/winiz"
    },
    {
        " ; it is thus cognate with the ": null
    },
    {
        "Old English": "old english language"
    },
    {
        " name  Ælfwine .  He was known in ": null
    },
    {
        "Latin": "latin"
    },
    {
        " as Alboinus and in ": null
    },
    {
        "Greek": "koine greek"
    },
    {
        " as Αλβοΐνος . In modern ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " he is Alboino and in modern ": null
    },
    {
        "Lombard": "lombard language"
    },
    {
        " Albuì.        The Lombards under King ": null
    },
    {
        "Wacho": "wacho"
    },
    {
        " had migrated towards the east into Pannonia, taking advantage of the difficulties facing the ": null
    },
    {
        "Ostrogothic Kingdom": "ostrogothic kingdom"
    },
    {
        " in Italy following the death of its founder, ": null
    },
    {
        "Theodoric": "theodoric the great"
    },
    {
        ", in 526. Wachos death in about 540 brought his son ": null
    },
    {
        "Walthari": "walthari"
    },
    {
        " to the throne, but, as the latter was still a minor, the kingdom was governed in his stead by Alboins father, Audoin, of the ": null
    },
    {
        "Gausian": "gausian dynasty"
    },
    {
        " clan. Seven years later Walthari died, giving Audoin the opportunity to crown himself and overthrow the reigning ": null
    },
    {
        "Lethings": "lethings"
    },
    {
        ". Jarnut 1995, pp. 16–18     Alboin was probably born in the 530s in ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        ", Martindale 1992, s.v. Alboin, pp. 38–40 the son of Audoin and his wife, ": null
    },
    {
        "Rodelinda": "rodelinda"
    },
    {
        ". She may have been the niece of King Theodoric and betrothed to Audoin through the mediation of Emperor ": null
    },
    {
        "Justinian": "justinian i"
    },
    {
        ". Rovagnati 2003, pp. 28–29 Amory 2003, p. 462 Like his father, Alboin was raised a pagan, although Audoin had at one point attempted to gain Byzantine support against his neighbours by professing himself a Christian. Wickham 1989, pp. 29–30 Alboin took as his first wife the Christian ": null
    },
    {
        "Chlothsind": "chlothsind"
    },
    {
        ", daughter of the ": null
    },
    {
        "Frankish": "franks"
    },
    {
        " King ": null
    },
    {
        "Chlothar": "chlothar i"
    },
    {
        ". This marriage, which took place soon after the death of the Frankish ruler ": null
    },
    {
        "Theudebald": "theudebald"
    },
    {
        " in 555, is thought to reflect Audoins decision to distance himself from the Byzantines, traditional allies of the Lombards, who had been lukewarm when it came to supporting Audoin against the Gepids. The new Frankish alliance was important because of the Franks known hostility to the Byzantine empire, providing the Lombards with more than one option. Jarnut 1995, p. 21 Bertolini 1960, pp. 34–38. However, the  Prosopography of the Later Roman Empire  interprets events and sources differently, believing that Alboin married Chlothsind when already a king in or shortly before 561, the year of Chlothars death.     Alboin first distinguished himself on the battlefield in a clash with the Gepids. At the ": null
    },
    {
        "Battle of Asfeld": "battle of asfeld"
    },
    {
        " , he killed ": null
    },
    {
        "Turismod": "turismod"
    },
    {
        ", son of the Gepid king ": null
    },
    {
        "Thurisind": "thurisind"
    },
    {
        ", in a victory that resulted in the Emperor Justinians intervention to maintain equilibrium between the rival regional powers. Rovagnati 2003, p. 28 After the battle, according to a tradition reported by ": null
    },
    {
        "Paul the Deacon": "paul the deacon"
    },
    {
        ", to be granted the right to sit at his fathers table, Alboin had to ask for the hospitality of a foreign king and have him donate his weapons, as was customary. For this initiation, he went to the court of Thurisind, where the Gepid king gave him Turismods arms. Ausenda 1999, p. 433 ": null
    },
    {
        "Walter Goffart": "walter goffart"
    },
    {
        " believes it is probable that in this narrative Paul was making use of an oral tradition, and is sceptical that it can be dismissed as merely a typical  topos  of an ": null
    },
    {
        "epic poem": "epic poetry"
    },
    {
        ". Goffart 1988, p. 387         Alboin came to the throne after the death of his father, sometime between 560 and 565. As was customary among the Lombards, Alboin took the crown after an election by the tribes freemen, who traditionally selected the king from the dead sovereigns clan. Jarnut 1995, p. 25 Wolfram 1997, p. 284 Shortly afterwards, in 565, a new war erupted with the Gepids, now led by ": null
    },
    {
        "Cunimund": "cunimund"
    },
    {
        ", Thurisinds son. The cause of the conflict is uncertain, as the sources are divided; the Lombard Paul the Deacon accuses the Gepids, while the Byzantine historian ": null
    },
    {
        "Menander Protector": "menander protector"
    },
    {
        " places the blame on Alboin, an interpretation favoured by historian ": null
    },
    {
        "Walter Pohl": "walter pohl"
    },
    {
        ". Pohl 1997, p. 96     An account of the war by the Byzantine ": null
    },
    {
        "Theophylact Simocatta": "theophylact simocatta"
    },
    {
        " sentimentalises the reasons behind the conflict, claiming it originated with Alboins vain courting and subsequent kidnapping of Cunimunds daughter ": null
    },
    {
        "Rosamund": "rosamund"
    },
    {
        ", that Alboin proceeded then to marry. The tale is treated with scepticism by Walter Goffart, who observes that it conflicts with the  Origo Gentis Langobardorum , where she was captured only after the death of her father. Martindale 1992, s.v. Cunimundus, p. 364 The Gepids obtained the support of the Emperor in exchange for a promise to cede him the region of ": null
    },
    {
        "Sirmium": "sirmium"
    },
    {
        ", the seat of the Gepid kings. Thus in 565 or 566 Justinians successor ": null
    },
    {
        "Justin II": "justin ii"
    },
    {
        " sent his son-in-law ": null
    },
    {
        "Baduarius": "baduarius"
    },
    {
        " as  magister militum  to lead a Byzantine army against Alboin in support of Cunimund, ending in the Lombards complete defeat. Rovagnati 2003, p. 30 Jarnut 1995, p. 22 Martindale 1992, s.v. Baduarius , pp. 64–65     Faced with the possibility of annihilation, Alboin made an alliance in 566 with the ": null
    },
    {
        "Avars": "avars"
    },
    {
        " under ": null
    },
    {
        "Bayan I": "bayan i"
    },
    {
        ", at the expense of some tough conditions: the Avars demanded a tenth of the Lombards cattle, half of the war booty, and on the wars conclusion all of the lands held by the Gepids. The Lombards played on the pre-existing hostility between the Avars and the Byzantines, claiming that the latter were allied with the Gepids. Cunimund, on the other hand, encountered hostility when he once again asked the Emperor for military assistance, as the Byzantines had been angered by the Gepids failure to cede Sirmium to them, as had been agreed. Moreover, Justin II was moving away from the foreign policy of Justinian, and believed in dealing more strictly with bordering states and peoples. Attempts to mollify Justin II with tributes failed, and as a result the Byzantines kept themselves neutral if not outright supportive of the Avars. Pohl 1997, pp. 96–97     In 567 the allies made their final move against Cunimund, with Alboin invading the Gepids lands from the northwest while Bayan attacked from the northeast. Cunimund attempted to prevent the two armies joining up by moving against the Lombards and clashing with Alboin somewhere between the ": null
    },
    {
        "Tibiscus": "timiş river"
    },
    {
        " and ": null
    },
    {
        "Danube": "danube river"
    },
    {
        " rivers. The Gepids were defeated in the ensuing battle, their king slain by Alboin, and Cunimunds daughter Rosamund taken captive, according to references in the Origo. The full destruction of the Gepid kingdom was completed by the Avars, who overcame the Gepids in the east. As a result, the Gepids ceased to exist as an independent people, and were partly absorbed by the Lombards and the Avars. Rovagnati 2003, pp. 30–31 Some time before 568, Alboins first wife Chlothsind died, and after his victory against Cunimund Alboin married Rosamund, to establish a bond with the remaining Gepids. Gasparri 1990, p. 20 The war also marked a watershed in the geo-political history of the region, as together with the Lombard migration the following year, it signalled the end of six centuries of Germanic dominance in the Pannonian Basin. Curta 2001, p. 204         Despite his success against the Gepids, Alboin had failed to greatly increase his power, and was now faced with a much stronger threat from the Avars. Jarnut 1995, p. 29 Historians consider this the decisive factor in convincing Alboin to undertake a migration, even though there are indications that before the war with the Gepids a decision was maturing to leave for Italy, a country thousands of Lombards had seen in the 550s when hired by the Byzantines to fight in the Gothic War. Moorhead 2005, p. 152 Additionally, the Lombards would have known of the weakness of Byzantine Italy, which had endured a number of problems after being retaken from the Goths. In particular the so-called ": null
    },
    {
        "Plague of Justinian": "plague of justinian"
    },
    {
        " had ravaged the region and conflict remained endemic, with the ": null
    },
    {
        "Three-Chapter Controversy": "three-chapter controversy"
    },
    {
        " sparking religious opposition and administration at a standstill after the able governor of the peninsula, ": null
    },
    {
        "Narses": "narses"
    },
    {
        ", was recalled. Christie 1998, p. 60 Nevertheless, the Lombards viewed Italy as a rich land which promised great booty, Gasparri 1990, p. 25 assets Alboin used to gather together a horde which included not only Lombards but many other peoples of the region, including ": null
    },
    {
        "Heruli": "heruli"
    },
    {
        ", ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        ", ": null
    },
    {
        "Gepids": "gepids"
    },
    {
        ", ": null
    },
    {
        "Thuringii": "thuringii"
    },
    {
        ", ": null
    },
    {
        "Bulgars": "bulgars"
    },
    {
        ", ": null
    },
    {
        "Sarmatians": "sarmatians"
    },
    {
        ", the remaining Romans and a few Ostrogoths. But the most important group, other than the Lombards, were the ": null
    },
    {
        "Saxons": "saxons"
    },
    {
        ", of whom 20,000 male warriors with their families participated in the trek. These Saxons were tributaries to the Frankish King ": null
    },
    {
        "Sigebert": "sigebert i"
    },
    {
        ", and their participation indicates that Alboin had the support of the Franks for his venture. Schutz 2002, p. 82     The precise size of the heterogeneous group gathered by Alboin is impossible to know, and many different estimates have been made. ": null
    },
    {
        "Neil Christie": "neil christie"
    },
    {
        " considers 150,000 to be a realistic size, a number which would make the Lombards a more numerous force than the Ostrogoths on the eve of their invasion of Italy. Jörg Jarnut proposes 100,000–150,000 as an approximation; Wilfried Menghen in Die Langobarden estimates 150,000 to 200,000; while Stefano Gasparri cautiously judges the peoples united by Alboin to be somewhere between 100,000 and 300,000. Christie 1998, pp. 63–64 Jarnut 1995, p. 30     As a precautionary move Alboin strengthened his alliance with the Avars, signing what Paul calls a foedus perpetuum and what is referred to in the 9th-century  Historia Langobardorum codicis Gothani  as a pactum et foedus amicitiae , adding that the treaty was put down on paper. By the conditions accepted in the treaty, the Avars were to take possession of Pannonia and the Lombards were promised military support in Italy should the need arise; also, for a period of 200  years the Lombards were to maintain the right to reclaim their former territories if the plan to conquer Italy failed, thus leaving Alboin with an alternative open. The accord also had the advantage of protecting Alboins rear, as an Avar-occupied Pannonia would make it difficult for the Byzantines to bring forces to Italy by land. The agreement proved immensely successful, and relations with the Avars were almost uninterruptedly friendly during the lifetime of the Lombard Kingdom. Pohl 1997, p. 98 Wolfram 1997, p. 286 Jarnut 1995, pp. 29–30     A further cause of the Lombard migration into Italy may have been an invitation from Narses. According to a controversial tradition reported by several medieval sources, Narses, out of spite for having been removed by Justinians successor Justin II, called the Lombards to Italy. Often dismissed as an unreliable tradition, Whitby 2001, p. 91 it has been studied with attention by modern scholars, in particular Neil Christie, who see in it a possible record of a formal invitation by the Byzantine state to settle in northern Italy as  foederati , to help protect the region against the Franks, an arrangement that may have been disowned by Justin II after Narses removal. Christie 1998, pp. 60–63 Pohl 1997, pp. 98–99 Collins 1991, p. 186              The Lombard migration started on Easter Monday, April 2, 568. The decision to combine the departure with a Christian celebration can be understood in the context of Alboins recent conversion to ": null
    },
    {
        "Arian Christianity": "arianism"
    },
    {
        ", as attested by the presence of Arian Gothic missionaries at his court. Palmieri 1996, pp. 43–44 The conversion is likely to have been motivated mostly by political considerations, and intended to consolidate the migrations cohesion, distinguishing the migrants from the Catholic Romans. It also connected Alboin and his people to the Gothic heritage, and in this way obtain the support of the Ostrogoths serving in the Byzantine army as foederati. Gasparri 1990, pp. 24–25 It has been speculated that Alboins migration could have been partly the result of a call from surviving Ostrogoths in Italy.     The season chosen for leaving Pannonia was unusually early; the Germanic peoples generally waited until autumn before beginning a migration, giving themselves time to do the harvesting and replenish their granaries for the march. The reason behind the spring departure could be the anxiety induced by the neighboring Avars, despite the friendship treaty. Nomadic peoples like the Avars also waited for autumn to begin their military campaigns, as they needed enough forage for their horses. A sign of this anxiety can also be seen in the decision taken by Alboin to ravage Pannonia, which created a safety zone between the Lombards and the Avars.     The road followed by Alboin to reach Italy has been the subject of controversy, as is the length of the trek. According to Neil Christie the Lombards divided themselves into migrational groups, with a vanguard scouting the road, probably following the ": null
    },
    {
        "Poetovio": "ptuj"
    },
    {
        " – ": null
    },
    {
        "Celeia": "celje"
    },
    {
        " – ": null
    },
    {
        "Emona": "emona"
    },
    {
        " – ": null
    },
    {
        "Forum Iulii": "cividale del friuli"
    },
    {
        " route, while the wagons and most of the people proceeded slowly behind because of the goods and chattels they brought with them, and possibly also because they were waiting for the Saxons to join them on the road. By September raiding parties were looting ": null
    },
    {
        "Venetia": "venetia"
    },
    {
        ", but it was probably only in 569 that the ": null
    },
    {
        "Julian Alps": "julian alps"
    },
    {
        " were crossed at the ": null
    },
    {
        "Vipava Valley": "vipava valley"
    },
    {
        "; the eyewitness ": null
    },
    {
        "Secundus of Non": "secundus of non"
    },
    {
        " gives the date as May 20 or 21. The 569 date for the entry into Italy is not void of difficulties however, and Jörg Jarnut believes the conquest of most of Venetia had already been completed in 568. According to Carlo Guido Mor, a major difficulty remains in explaining how Alboin could have reached Milan on September 3 assuming he had passed the border only in the May of the same year.                  The Lombards penetrated into Italy without meeting any resistance from the border troops . The Byzantine military resources available on the spot were scant and of dubious loyalty, and the border forts may well have been left unmanned. What seems certain is that archaeological excavations have found no sign of violent confrontation in the sites that have been excavated. This agrees with Paul the Deacons narrative, who speaks of a Lombard takeover in ": null
    },
    {
        "Friuli": "friuli"
    },
    {
        " without any hindrance . Christie 1998, pp. 73, 76     The first town to fall into the Lombards hands was ": null
    },
    {
        "Forum Iulii": "cividale del friuli"
    },
    {
        " , the seat of the local magister militum. Alboin chose this walled town close to the frontier to be capital of the ": null
    },
    {
        "Duchy of Friuli": "duchy of friuli"
    },
    {
        " and made his nephew and ": null
    },
    {
        "shield bearer": "shield bearer"
    },
    {
        ", ": null
    },
    {
        "Gisulf": "gisulf i of friuli"
    },
    {
        ", ": null
    },
    {
        "duke": "duke"
    },
    {
        " of the region, with the specific duty of defending the borders from Byzantine or Avar attacks from the east. Gisulf obtained from his uncle the right to choose for his duchy those  farae , or clans, that he preferred. Christie 1998, pp. 93–94 Wolfram 1997, pp. 287–288     Alboins decision to create a duchy and designate a duke were both important innovations; until then, the Lombards had never had dukes or duchies based on a walled town. The innovation adopted was part of Alboins borrowing of Roman and Ostrogothic administrative models, as in Late Antiquity the  comes civitatis  was the main local authority, with full administrative powers in his region. But the shift from count  to duke  and from county  to duchy  also signalled the progressive militarization of Italy. The selection of a fortified town as the centre for the new duchy was also an important change from the time in Pannonia, for while urbanized settlements had previously been ignored by the Lombards, now a considerable part of the nobility settled itself in Forum Iulii, a pattern that was repeated regularly by the Lombards in their other duchies. Christie 1998, p. 77       From Forum Iulii, Alboin next reached ": null
    },
    {
        "Aquileia": "aquileia"
    },
    {
        ", the most important road junction in the northeast, Wolfram 1997, p. 288 and the administrative capital of Venetia. The imminent arrival of the Lombards had a considerable impact on the citys population; the ": null
    },
    {
        "Patriarch of Aquileia": "list of bishops and patriarchs of aquileia"
    },
    {
        " Paulinus": "paulinus i of aquileia"
    },
    {
        " fled with his clergy and flock to the island of ": null
    },
    {
        "Grado": "grado, italy"
    },
    {
        " in Byzantine-controlled territory. Madden 2004, p. 44     From Aquileia, Alboin took the ": null
    },
    {
        "Via Postumia": "via postumia"
    },
    {
        " and swept through Venetia, taking in rapid succession ": null
    },
    {
        "Tarvisium": "treviso"
    },
    {
        " , ": null
    },
    {
        "Vicentia": "vicenza"
    },
    {
        " , ": null
    },
    {
        "Verona": "verona"
    },
    {
        ", ": null
    },
    {
        "Brixia": "brescia"
    },
    {
        "  and ": null
    },
    {
        "Bergomum": "bergamo"
    },
    {
        " . The Lombards faced difficulties only in taking ": null
    },
    {
        "Opitergium": "oderzo"
    },
    {
        " , which Alboin decided to avoid, as he similarly avoided tackling the main Venetian towns closer to the coast on the ": null
    },
    {
        "Via Annia": "via annia"
    },
    {
        ", such as ": null
    },
    {
        "Altinum": "altinum"
    },
    {
        ", ": null
    },
    {
        "Patavium": "padua"
    },
    {
        " , ": null
    },
    {
        "Mons Silicis": "monselice"
    },
    {
        " , ": null
    },
    {
        "Mantua": "mantua"
    },
    {
        " and ": null
    },
    {
        "Cremona": "cremona"
    },
    {
        ". The invasion of Venetia generated a considerable level of turmoil, spurring waves of refugees from the Lombard-controlled interior to the Byzantine-held coast, often led by their bishops, and resulting in new settlements such as ": null
    },
    {
        "Torcello": "torcello"
    },
    {
        " and ": null
    },
    {
        "Heraclia": "eraclea"
    },
    {
        ". Lane 1991, p. 7 Humphries 2001, pp. 535–536 Richards 1979, p. 34     Alboin moved west in his march, invading the region of ": null
    },
    {
        "Liguria": "liguria"
    },
    {
        " and reaching its capital ": null
    },
    {
        "Mediolanum": "mediolanum"
    },
    {
        "  on September 3, 569, only to find it already abandoned by the  vicarius Italiae , the authority entrusted with the administration of the ": null
    },
    {
        "diocese of Annonarian Italy": "diocese of annonarian italy"
    },
    {
        ". Archbishop ": null
    },
    {
        "Honoratus": "honoratus of mediolanum"
    },
    {
        ", his clergy, and part of the laity accompanied the vicarius Italiae to find a safe haven in the Byzantine port of ": null
    },
    {
        "Genua": "genoa"
    },
    {
        " . Alboin counted the years of his reign from the capture of Milan, when he assumed the title of dominus Italiae . His success also meant the collapse of Byzantine defences in the northern part of the ": null
    },
    {
        "Po plain": "po plain"
    },
    {
        ", and large movements of refugees to Byzantine areas. Christie 1998, p. 78 Gasparri 1990, pp. 25–26     Several explanations have been advanced to explain the swiftness and ease of the initial Lombard advance in northern Italy. It has been suggested that the towns doors may have been opened by the betrayal of the Gothic auxiliaries in the Byzantine army, but historians generally hold that Lombard success occurred because Italy was not considered by Byzantium as a vital part of the empire, especially at a time when the empire was imperilled by the attacks of Avars and ": null
    },
    {
        "Slavs": "slavic peoples"
    },
    {
        " in the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and ": null
    },
    {
        "Sassanids": "sassanid empire"
    },
    {
        " in the east. The Byzantine decision not to contest the Lombard invasion reflects the desire of Justinians successors to reorient the core of the Empires policies eastward. Ostrogorsky 1993, p. 68       The impact of the Lombard migration on the Late Roman aristocracy was disruptive, especially in combination with the Gothic War; the latter conflict had finished in the north only in 562, when the last Gothic stronghold, Verona, was taken. Collins 1991, p. 187 Many men of means  either lost their lives or their goods, but the exact extent of the despoliation of the Roman aristocracy is a subject of heated debate. Jarnut 1995, p. 31 Wickham 2005, pp. 203, 210 Moorhead 2005, pp. 156–157 The clergy was also greatly affected. The Lombards were mostly pagans, and displayed little respect for the clergy and Church property. Many churchmen left their ": null
    },
    {
        "sees": "episcopal see"
    },
    {
        " to escape from the Lombards, like the two most senior bishops in the north, Honoratus and Paulinus. However, most of the ": null
    },
    {
        "suffragan bishops": "suffragan bishop"
    },
    {
        "in the north sought an accommodation with the Lombards, as did in 569 the bishop of Tarvisium, Felix, when he journeyed to the ": null
    },
    {
        "Piave river": "piave"
    },
    {
        " to parley with Alboin, obtaining respect for the Church and its goods in return for this act of homage. It seems certain that many sees maintained an uninterrupted episcopal succession through the turmoil of the invasion and the following years. The transition was eased by the hostility existing among the northern Italian bishops towards the papacy and the empire due to the religious dispute involving the ": null
    },
    {
        "Three-Chapter Controversy": "schism of the three chapters"
    },
    {
        " . In Lombard territory, churchmen were at least sure to avoid imperial religious persecution. Wolfram 1997, pp. 288–289 Richards 1979, pp. 37–38     In the view of Pierre Riché, the disappearance of 220 bishops seats indicates that the Lombard migration was a crippling catastrophe for the Church. Schutz 2001, p. 84 Yet according to Walter Pohl the regions directly occupied by Alboin suffered less devastation and had a relatively robust survival rate for towns, whereas the occupation of territory by autonomous military bands interested mainly in raiding and looting had a more severe impact, with the bishoprics in such places rarely surviving. Pohl 1997, pp. 124–125               The first attested instance of strong resistance to Alboins migration took place at the town of ": null
    },
    {
        "Ticinum": "ticinum"
    },
    {
        " , which he started to besiege in 569 and captured only after three years. The town was of strategic importance, sitting at the confluence of the rivers ": null
    },
    {
        "Po": "po"
    },
    {
        " and ": null
    },
    {
        "Ticino": "ticino"
    },
    {
        " and connected by waterways to Ravenna, the capital of Byzantine Italy and the seat of the ": null
    },
    {
        "Praetorian prefecture of Italy": "praetorian prefecture of italy"
    },
    {
        ". Its fall cut direct communications between the garrisons stationed on the ": null
    },
    {
        "Alpes Maritimae": "alpes maritimae"
    },
    {
        " and the ": null
    },
    {
        "Adriatic coast": "adriatic sea"
    },
    {
        ". Christie 1998, p. 79 Gasparri 1990, p. 26 Wolfram 1997, p. 290     Careful to maintain the initiative against the Byzantines, by 570 Alboin had taken their last defences in northern Italy except for the coastal areas of Liguria and Venetia and a few isolated inland centres such as ": null
    },
    {
        "Augusta Praetoria": "aosta"
    },
    {
        " , ": null
    },
    {
        "Segusio": "susa"
    },
    {
        " , and the island of ": null
    },
    {
        "Amacina": "comacina"
    },
    {
        " in the ": null
    },
    {
        "Larius Lucus": "lake como"
    },
    {
        " . Rovagnati 2003, p. 36 During Alboins kingship the Lombards crossed the ": null
    },
    {
        "Apennines": "apennine mountains"
    },
    {
        " and plundered ": null
    },
    {
        "Tuscia": "tuscia"
    },
    {
        ", but historians are not in full agreement as to whether this took place under his guidance and if this constituted anything more than raiding. According to ": null
    },
    {
        "Herwig Wolfram": "herwig wolfram"
    },
    {
        ", it was probably only in 578–579 that ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        " was conquered, but Jörg Jarnut and others believe this began in some form under Alboin, although it was not completed by the time of his death.     Alboins problems in maintaining control over his people worsened during the siege of Ticinum. The nature of the Lombard monarchy made it difficult for a ruler to exert the same degree of authority over his subjects as had been exercised by Theodoric over his Goths, and the structure of the army gave great authority to the military commanders or duces, who led each band  of warriors. Additionally, the difficulties encountered by Alboin in building a solid political entity resulted from a lack of imperial legitimacy, as unlike the Ostrogoths, they had not entered Italy as foederati but as enemies of the Empire. Azzara 2009, pp. 95–96 Pohl 1997, p. 99     The kings disintegrating authority over his army was also manifested in the invasion of Frankish ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        " which from 569 or 570 was subject to yearly raids on a major scale. The Lombard attacks were ultimately repelled following ": null
    },
    {
        "Mummolus": "mummolus"
    },
    {
        " victory at ": null
    },
    {
        "Embrun": "embrun, hautes-alpes"
    },
    {
        ". These attacks had lasting political consequences, souring the previously cordial Lombard-Frankish relations and opening the door to an alliance between the Empire and the Franks against the Lombards, a coalition agreed to by ": null
    },
    {
        "Guntram": "guntram"
    },
    {
        " in about 571. Jarnut 1995, p. 35 Alboin is generally thought not to have been behind this invasion, but an alternative interpretation of the transalpine raids presented by Gian Piero Bognetti is that Alboin may actually have been involved in the offensive on Guntram as part of an alliance with the Frankish king of ": null
    },
    {
        "Austrasia": "austrasia"
    },
    {
        ", ": null
    },
    {
        "Sigebert I": "sigebert i"
    },
    {
        ". This view is met with scepticism by scholars such as ": null
    },
    {
        "Chris Wickham": "christopher wickham"
    },
    {
        ". Wickham 1989, pp. 30–31     The weakening of royal authority may also have resulted in the conquest of much of southern Italy by the Lombards, in which modern scholars believe Alboin played no role at all, probably taking place in 570 or 571 under the auspices of individual warlords. However it is far from certain that the Lombard takeover occurred during those years, as very little is known of ": null
    },
    {
        "Faroald": "faroald i of spoleto"
    },
    {
        " and ": null
    },
    {
        "Zottos": "zotto"
    },
    {
        "respective rises to power in ": null
    },
    {
        "Spoletium": "duchy of spoleto"
    },
    {
        "  and ": null
    },
    {
        "Beneventum": "duchy of benevento"
    },
    {
        " . Palmieri 1996, pp. 52–53 Moorhead 2005, p. 153 Christie 1998, pp. 80–82                Ticinum eventually fell to the Lombards in either May or June 572. Alboin had in the meantime chosen Verona as his seat, establishing himself and his treasure in a royal palace built there by Theodoric. This choice may have been another attempt to link himself with the Gothic king.     It was in this palace that Alboin was killed on June 28, 572. In the account given by Paul the Deacon, the most detailed narrative on Alboins death, history and saga intermingle almost inextricably. Much earlier and shorter is the story told by ": null
    },
    {
        "Marius of Aventicum": "marius aventicensis"
    },
    {
        " in his Chronica, written about a decade after Alboins murder. According to his version the king was killed in a conspiracy by a man close to him, called ": null
    },
    {
        "Hilmegis": "helmichis"
    },
    {
        " , Martindale 1992, s.v. Hilmegis, p. 599 with the connivance of the queen. Helmichis then married the widow, but the two were forced to escape to Byzantine Ravenna, taking with them the royal treasure and part of the army, which hints at the cooperation of Byzantium. ": null
    },
    {
        "Roger Collins": "roger collins"
    },
    {
        " describes Marius as an especially reliable source because of his early date and his having lived close to Lombard Italy. Collins 1991, pp. 187–188 Jarnut 1995, pp. 31–32     Also contemporary is ": null
    },
    {
        "Gregory of Tours": "gregory of tours"
    },
    {
        " account presented in the Historia Francorum, and echoed by the later ": null
    },
    {
        "Fredegar": "chronicle of fredegar"
    },
    {
        ". Gregorys account diverges in several respects from most other sources. In his tale it is told how Alboin married the daughter of a man he had slain, and how she waited for a suitable occasion for revenge, eventually poisoning him. She had previously fallen in love with one of her husbands servants, and after the assassination tried to escape with him, but they were captured and killed. However, historians including Walter Goffart place little trust in this narrative. Goffart notes other similar doubtful stories in the Historia and calls its account of Alboins demise a suitably ironic tale of the doings of depraved humanity . Goffart 1988, p. 392       Elements present in Marius account are echoed in Pauls  Historia Langobardorum , which also contains distinctive features. One of the best known aspects unavailable in any other source is that of the ": null
    },
    {
        "skull cup": "skull cup"
    },
    {
        ". In Paul, the events that led to Alboins downfall unfold in Verona. During a great feast, Alboin gets drunk and orders his wife Rosamund to drink from his cup, made from the skull of his father-in-law Cunimund after he had slain him in 567 and married Rosamund. Alboin invited her to drink merrily with her father . This reignited the queens determination to avenge her father. Gasparri 1990, pp. 19–21 Wolfram 1997, p. 291 Goffart 1988, pp. 391–392        The tale has been often dismissed as a fable and Paul was conscious of the risk of disbelief. For this reason, he insists that he saw the skull cup personally during the 740s in the royal palace of Ticinum in the hands of king ": null
    },
    {
        "Ratchis": "ratchis"
    },
    {
        ". The use of skull cups has been noticed among nomadic peoples and, in particular, among the Lombards neighbors, the Avars. Skull cups are believed to be part of a ": null
    },
    {
        "shamanistic": "shamanism"
    },
    {
        " ritual, where drinking from the cup was considered a way to assume the dead mans powers. In this context, Stefano Gasparri and Wilfried Menghen see in Cunimunds skull cup the sign of nomadic cultural influences on the Lombards: by drinking from his enemys skull Alboin was taking his vital strength. As for the offering of the skull to Rosamund, that may have been a ritual request of complete submission of the queen and her people to the Lombards, and thus a cause of shame or humiliation. Alternatively, it may have been a rite to appease the dead through the offering of a libation. In the latter interpretation, the queens answer reveals her determination not to let the wound opened by the killing of her father be healed through a ritual act, thus openly displaying her thirst for revenge.     The episode is read in a radically different way by Walter Goffart. According to him, the whole story assumes an allegorical meaning, with Paul intent on telling an edifying story of the downfall of the hero and his expulsion from the promised land, because of his human weakness. In this story, the skull cup plays a key role as it unites ": null
    },
    {
        "original sin": "original sin"
    },
    {
        " and barbarism. Goffart does not exclude the possibility that Paul had really seen the skull, but believes that by the 740s the connection between sin and barbarism as exemplified by the skull cup had already been established.            In her plan to kill her husband Rosamund found an ally in Helmichis, the kings foster brother and  spatharius  . According to Paul the queen then recruited the kings  cubicularius  , Peredeo, into the plot, after having seduced him. When Alboin retired for his midday rest on ": null
    },
    {
        "June 28": "june 28"
    },
    {
        ", care was taken to leave the door open and unguarded. Alboins sword was also removed, leaving him defenceless when Peredeo entered his room and killed him. Jarnut 1995, p. 32 Alboins remains were allegedly buried beneath the palace steps.     Peredeos figure and role is mostly introduced by Paul; the Origo had for the first time mentioned his name as Peritheus , but there his role had been different, as he was not the assassin, but the instigator of the assassination. In the vein of his reading of the skull cup, Goffart sees Peredeo not as a historical figure but as an allegorical character: he notes a similarity between Peredeos name and the ": null
    },
    {
        "Latin": "latin language"
    },
    {
        " word peritus, meaning lost , a representation of those Lombards who entered into the service of the Empire. Goffart 1988, p. 393     Alboins death had a lasting impact, as it deprived the Lombards of the only leader they had that could have kept together the newborn Germanic entity. His end also represents the death of the last of the line of hero-kings that had led the Lombards through their migrations from the Elbe to Italy. His fame survived him for many centuries in epic poetry, with Saxons and ": null
    },
    {
        "Bavarians": "history of bavaria"
    },
    {
        "celebrating his prowess in battle, his heroism, and the magical properties of his weapons. Wolfram 1997, p. 285            To complete the ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " and legitimize his claim to the throne, Helmichis married the queen, whose high standing arose not only from being the kings widow but also from being the most prominent member of the remaining Gepid nation, and as such her support was a guarantee of the Gepids loyalty to Helmichis. The latter could also count on the support of the Lombard garrison of Verona, where many may have opposed Alboins aggressive policy and could have cultivated the hope of reaching an entente with the Empire. The Byzantines were almost certainly deeply involved in the plot. It was in their interest to stem the Lombard tide by bringing a pro-Byzantine regime into power in Verona, and possibly in the long run break the unity of the Lombards kingdom, winning over the dukes with honors and emoluments. Christie 1998, p. 82 Wolfram 1997, p. 292 Azzara 2009, p. 96     The coup ultimately failed, as it met with the resistance of most of the warriors, who were opposed to the kings assassination. As a result, the Lombard garrison in Ticinum proclaimed Duke ": null
    },
    {
        "Cleph": "cleph"
    },
    {
        " the new king, and Helmichis, rather than going to war against overwhelming odds, escaped to Ravenna with Longinus assistance, taking with him his wife, his troops, the royal treasure and Alboins daughter ": null
    },
    {
        "Albsuinda": "albsuinda"
    },
    {
        ". In Ravenna the two lovers became estranged and killed each other. Subsequently, Longinus sent Albsuinda and the treasure to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ".          Cleph kept the throne for only 18 months before being assassinated by a ": null
    },
    {
        "slave": "slavery in medieval europe"
    },
    {
        ". Possibly he too was killed at the instigation of the Byzantines, who had every interest in avoiding a hostile and solid leadership among the Lombards. An important success for the Byzantines was that no king was proclaimed to succeed Cleph, opening a ": null
    },
    {
        "decade of interregnum": "rule of the dukes"
    },
    {
        ", thus making them more vulnerable to attacks from Franks and Byzantines. It was only when faced with the danger of annihilation by the Franks in 584 that the dukes elected a new king in the person of ": null
    },
    {
        "Authari": "authari"
    },
    {
        ", son of Cleph, who began the definitive consolidation and centralization of the Lombard kingdom while the remaining imperial territories were reorganized under the control of an ": null
    },
    {
        "exarch": "exarchate of ravenna"
    },
    {
        " in Ravenna with the capacity to defend the country without the Emperors assistance. Schutz 2001, p. 85 Gasparri 1990, pp. 26–28 Wickham 1989, pp. 31–32 Ostrogorsky 1993, p. 69.     The consolidation of Byzantine and Lombard dominions had long-lasting consequences for Italy, as the region was from that moment on fragmented among multiple rulers until ": null
    },
    {
        "Italian unification": "italian unification"
    },
    {
        " in 1871. Wickham 2005, p. 35       :See also Rosamund § in later culture   Alboin, together with other tribal leaders is mentioned in the 10th century Old English poem called ": null
    },
    {
        "Widsith": "widsith"
    },
    {
        " :       The historical period also formed the basis of the 1961 Italian adventure film ": null
    },
    {
        "Sword of the Conqueror": "sword of the conqueror"
    },
    {
        " , with Jack Palance as Alboin.     There have been several artistic depictions of events from Alboins life including Peter Paul Rubens Alboin and Rosamunde ; Charles Landseer s Assassination of Alboin, King of the Lombards ; and Fortunino Matania s illustration Rosamund captive before King Alboin of the Lombards": null
    }
]