[
    {
        "     Aldus Pius Manutius  was a ": null
    },
    {
        "humanist": "renaissance humanism"
    },
    {
        ", scholar, educator, and the founder of the ": null
    },
    {
        "Aldine Press": "aldine press"
    },
    {
        ". Manutius devoted the later part of his life to publishing and disseminating rare texts. His interest in and preservation of Greek manuscripts mark him as an innovative publisher of his age dedicated to the editions he produced. His ": null
    },
    {
        "enchiridia": "enchiridion"
    },
    {
        ", small portable books, revolutionized personal reading and are the predecessor of the modern paperback.     Manutius wanted to produce ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " texts for his readers because he believed that works by ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        " or ": null
    },
    {
        "Aristophanes": "aristophanes"
    },
    {
        " in their original Greek form were pure and unadulterated by translation. Before Manutius, publishers rarely printed volumes in Greek, mainly due to the complexity of providing a standardized Greek typeface. Manutius published rare manuscripts in their original Greek and ": null
    },
    {
        "Latin": "latin"
    },
    {
        " forms. He commissioned the creation of typefaces in Greek and Latin resembling humanist handwriting of his time; typefaces that are the first known precursor of ": null
    },
    {
        "italic type": "italic type"
    },
    {
        ". As the Aldine Press grew in popularity, Manutiuss innovations were quickly copied across Italy despite his efforts to prevent piracy of Aldine editions.     Because of the Aldine Presss growing reputation of meticulous, accurate publications, ": null
    },
    {
        "Erasmus": "erasmus"
    },
    {
        " sought out Manutius to publish his translations of  Iphigenia in Aulis .     In his youth, Manutius studied in ": null
    },
    {
        "Rome": "rome"
    },
    {
        " to become a humanist scholar. He was friends with ": null
    },
    {
        "Giovanni Pico": "giovanni pico"
    },
    {
        " and tutored Picos nephews, the princes of Carpi, Alberto and Leonello Pio. While a tutor, Manutius published two works for his pupils and their mother. In his late thirties or early forties Manutius settled in ": null
    },
    {
        "Venice": "venice"
    },
    {
        " to become a print publisher. He met Andrea Torresani in Venice and the two cofounded the ": null
    },
    {
        "Aldine Press": "aldine press"
    },
    {
        ".     Manutius is also known as Aldus Manutius the Elder to distinguish him from his grandson, ": null
    },
    {
        "Aldus Manutius the Younger": "aldus manutius the younger"
    },
    {
        ".            Aldus Manutius was born close to Rome in ": null
    },
    {
        "Bassiano": "bassiano"
    },
    {
        " between 42 and 42 He grew up in a wealthy family during the ": null
    },
    {
        "Italian Renaissance": "italian renaissance"
    },
    {
        " and in his youth was sent to Rome to become a ": null
    },
    {
        "humanist scholar": "italian humanism"
    },
    {
        ". In ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", he studied ": null
    },
    {
        "Latin": "latin"
    },
    {
        " under ": null
    },
    {
        "Gaspare da Verona": "gaspare da verona"
    },
    {
        " and attended lectures by ": null
    },
    {
        "Domizio Calderini": "domizio calderini"
    },
    {
        " in the early 42s. From 42 to 42 Manutius studied ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " in ": null
    },
    {
        "Ferrara": "ferrara"
    },
    {
        " with ": null
    },
    {
        "Guarino da Verona": "guarino da verona"
    },
    {
        " as his teacher.     Most of Manutiuss early life is rather unknown. According to the 42 Encyclopædia Britannica, Volume 42, Manutius was granted citizenship of the town of Carpi on 42 March 42 where he owned local property, and in 42 he traveled to ": null
    },
    {
        "Mirandola": "mirandola"
    },
    {
        " for a time with his longtime friend and fellow student, ": null
    },
    {
        "Giovanni Pico della Mirandola": "giovanni pico della mirandola"
    },
    {
        ", where he stayed two years to study ": null
    },
    {
        "Greek literature": "greek literature"
    },
    {
        ". Pico recommended Manutius to become the tutor of his nephews, ": null
    },
    {
        "Alberto": "alberto iii pio, prince of carpi"
    },
    {
        " and Leonello Pio, princes of the town of ": null
    },
    {
        "Carpi": "carpi, emilia-romagna"
    },
    {
        ". In Carpi, Manutius shared a close bond with his student, Alberto Pio. At the end of the 42s, Manutius published two works addressed to his two pupils and their mother, ": null
    },
    {
        "Caterina Pico": "caterina pico"
    },
    {
        " — both works were published in Venice by Baptista de Tortis: Musarum Panagyris with its Epistola Catherinae Piae and the Paraenesis .     Giovanni Pico and Alberto Pios families funded the starting costs of Manutiuss ": null
    },
    {
        "printing press": "printing press"
    },
    {
        " and gave him lands in Carpi. Manutius determined that Venice was the best location for his work, settling there in 42 In Venice, Manutius began gathering publishing contracts, at which point he met ": null
    },
    {
        "Andrea Torresani": "andrea torresani"
    },
    {
        ", who was also engaged in print publishing. Torresani and Manutius became lifelong business partners, and for their first contract together Manutius hired Torresani to print the first edition of his Latin grammar book the Institutiones grammaticae, published on 42 March 42            The ": null
    },
    {
        "Aldine Press": "aldine press"
    },
    {
        ", established in 42 had its first publication in March 42: Erotemata cum interpretatione Latina by ": null
    },
    {
        "Constantine Lascaris": "constantine lascaris"
    },
    {
        ". Andrea Torresani and ": null
    },
    {
        "Pier Francesco Barbarigo": "pier francesco barbarigo"
    },
    {
        ", nephew of the ": null
    },
    {
        "Doge": "doge of venice"
    },
    {
        ", ": null
    },
    {
        "Agostino Barbarigo": "agostino barbarigo"
    },
    {
        ", each held fifty percent of the press. Of Torresanis fifty percent, Manutius was given one-fifth, but accounts are unclear as to whether Manutiuss one-fifth refers to ten percent of the Aldine Press or ownership exclusively to one-fifth of Torresanis share.          The presss first great achievement was a five-volume folio edition of ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        ". Manutius started the first volume of his Aristotle edition in 42 Four more volumes were published together in 42 and 42 The Aldine Press produced nine comedies of ": null
    },
    {
        "Aristophanes": "aristophanes"
    },
    {
        " in 42 and ": null
    },
    {
        "Pietro Bembo": "pietro bembo"
    },
    {
        " edited ": null
    },
    {
        "Petrarchs": "petrarch"
    },
    {
        " poems that Manutius published in July 42 In addition to editing Greek manuscripts, Manutius corrected and improved texts originally published in ": null
    },
    {
        "Florence": "florence"
    },
    {
        ", Rome, and ": null
    },
    {
        "Milan": "milan"
    },
    {
        ".     The ": null
    },
    {
        "Second Italian War": "second italian war"
    },
    {
        " suspended the press for a time. During that time, ": null
    },
    {
        "Desiderius Erasmus": "desiderius erasmus"
    },
    {
        " asked Manutius to publish his translations of  Hecuba  and  Iphigenia in Aulis  through the Aldine Press. Erasmuss original letter to Manutius inquires about the printers proposed plans: a Greek ": null
    },
    {
        "Plato": "plato"
    },
    {
        " and a ": null
    },
    {
        "polyglot": "polyglot"
    },
    {
        " bible. Through correspondence, the two came to an agreement. In December 42 the Aldine Press published Iphigenia in Audlis in an 42-page ": null
    },
    {
        "octavo": "octavo"
    },
    {
        " with Erasmuss translation from Greek into Latin. With the success and accuracy of their first collaboration, Manutius agreed to publish the expanded version of the Adagiorum collectanea Erasmus was working on. Erasmus traveled to Venice, where he spent his first ten months working at the Aldine Press. He lived in Manutius and Torresanis home, where he shared a room with ": null
    },
    {
        "Girolamo Aleandro": "girolamo aleandro"
    },
    {
        ". His research using Manutiuss resources and Greek scholars enabled him to expand his collection of proverbs from 42 entries to 42 entries. The Aldine press published this newly expanded collection of proverbs,  Adagiorum Chiliades , in 42 After the publication of Adagiorum Chiliades, Erasmus helped Manutius proofread a Greek edition of Plutarchs Moralia along with many other Aldine Press publications.     Manutius relied on ": null
    },
    {
        "Marcus Musurus": "marcus musurus"
    },
    {
        ", ": null
    },
    {
        "Ioannis Grigoropoulos": "ioannis grigoropoulos"
    },
    {
        ", and other Greek collaborators to translate for the Aldine Press. He published an edition of minor Greek ": null
    },
    {
        "orator": "orator"
    },
    {
        "s and the lesser works of ": null
    },
    {
        "Plutarch": "plutarch"
    },
    {
        " . Printing work halted again while the ": null
    },
    {
        "League of Cambrai": "league of cambrai"
    },
    {
        " tried to lessen Venices influence. Manutius reappeared in 42 with an edition of Plato that he dedicated to ": null
    },
    {
        "Pope Leo X": "pope leo x"
    },
    {
        " in a preface that compares the miseries of warfare and the woes of ": null
    },
    {
        "Italy": "italy"
    },
    {
        " with the sublime and tranquil objects of the students life.     With the Aldine Presss increasing popularity, people would come to visit the shop, interrupting Manutiuss work. Manutius put up a sign that read, Whoever you are, Aldus asks you again and again what it is you want from him. State your business briefly and then immediately go away.      Manutius strove for excellence in ": null
    },
    {
        "typography": "typography"
    },
    {
        " and book design while publishing lower-cost editions. This was carried out under continual difficulties, including problems arising from strikes among his workmen, unauthorized use of Manutiuss materials by rivals, and frequent interruptions by war.     Before Manutius, there were fewer than ten Greek titles in print, most of which had to be imported from the Accursius Press of Milan. Only four Italian towns were authorized to produce Greek publications: Milan, ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", ": null
    },
    {
        "Vicenza": "vicenza"
    },
    {
        ", and ": null
    },
    {
        "Florence": "florence, italy"
    },
    {
        ", and they only published works by ": null
    },
    {
        "Theocritus": "theocritus"
    },
    {
        ", ": null
    },
    {
        "Isocrates": "isocrates"
    },
    {
        ", and ": null
    },
    {
        "Homer": "homer"
    },
    {
        ". Venice printer ": null
    },
    {
        "John Speyer": "johann and wendelin of speyer"
    },
    {
        " produced Greek passages but required the minimal Greek letters to be left blank and later filled in by hand.     Manutius desired to “inspire and refine his readers by inundating them with Greek.  He originally came to Venice because of its many Greek resources; Venice held Greek manuscripts from the time of ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " and was home to a large cluster of Greek scholars who traveled there from ": null
    },
    {
        "Crete": "crete"
    },
    {
        ". Venice was also where ": null
    },
    {
        "Cardinal Bessarion": "cardinal bessarion"
    },
    {
        ", in 42 donated his large Greek manuscript collection. To preserve ": null
    },
    {
        "ancient Greek literature": "ancient greek literature"
    },
    {
        ", the Aldine Press commissioned a typeface based on classical Greek manuscripts so that readers could experience the original Greek text more authentically.     While publishing Greek manuscripts, Manutius founded the New Academy, a group of Hellenist scholars, in 42 to promote Greek studies. The Encyclopædia Britannica Eleventh Edition writes that the New Academys rules were written in Greek, its members spoke Greek, their names were Hellenized, and their official titles were Greek.  Members of the New Academy included Desiderius Erasmus, Pietro Bembo, and ": null
    },
    {
        "Scipio Fortiguerra": "scipio fortiguerra"
    },
    {
        ". M.J.C. Lowry, a lecturer in history at the University of Warwick, has a different view, regarding the New Academy as a hopeful dream rather than an organized institute.     Manutius spoke Greek in his household, and employed thirty Greek speakers at the Aldine Press. Greek speakers from ": null
    },
    {
        "Crete": "crete"
    },
    {
        " prepared and proofed ": null
    },
    {
        "manuscripts": "manuscript"
    },
    {
        " and their calligraphy was a model for the casts used for Greek type. Instructions for ": null
    },
    {
        "typesetter": "typesetter"
    },
    {
        "s and ": null
    },
    {
        "binder": "bookbinding"
    },
    {
        "s were written in Greek, and the prefaces to Manutiuss editions were also in Greek. Manutius printed editions of Hero and Leander by ": null
    },
    {
        "Musaeus Grammaticus": "musaeus grammaticus"
    },
    {
        ", the Galeomyomachia, and the Greek Psalter. He called these Precursors of the Greek Library because they served as guides to the Greek language. Under Manutiuss supervision, the Aldine Press published 42 texts by Classical Greek and Byzantine authors.       Along with Greek classics, the Aldine Press published Latin and ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " authors. Manutius launched Pietro Bembos career as a writer by publishing  De Aetna  in 42 which was the Aldine Presss first Latin publication by a contemporary author. The Bembo family hired the Aldine Press to produce accurate texts of ": null
    },
    {
        "Dante": "dante"
    },
    {
        " and Petrarch using Bernardo Bembos personal manuscript collection. Pietro Bembo worked with Manutius from 42 to 42 to provide an accurate edition of Dante and Petrarch and also introduced punctuation. Bembo later made a diagram of sins to illustrate the 42 Aldine edition of Dante.     Manutius did not hold the same power of innovation over Latin classics as with Greek classics because publication of these works started 42 years before his time. To promote the Aldine editions in Latin, Manutius promoted the quality of his publications through his prefaces. Manutius was on the lookout for rare manuscripts, but often found instead missing parts of previously published works. ": null
    },
    {
        "Cuspinianus": "johannes cuspinian"
    },
    {
        " let Manutius publish the missing parts of Valerius Maximuss work, which Cuspinianus had found in a manuscript in Vienna.  Francesco Negri let Manutius publish the missing text of Julius Firmicus, which Negri found in Romania, and a manuscript from Britain made an improved edition of Prudentius possible.      The press printed first editions of ": null
    },
    {
        "Polizianos": "poliziano"
    },
    {
        " collected works, ": null
    },
    {
        "Pietro Bembos": "pietro bembo"
    },
    {
        " Asolani, ": null
    },
    {
        "Francesco Colonna": "francesco colonna"
    },
    {
        "s  Hypnerotomachia Poliphili , and Dantes  Divine Comedy . The 42 publication of ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        " introduced the use of ": null
    },
    {
        "italic print": "italic type"
    },
    {
        " and was produced in higher-than-normal print runs .            Manutius adopted the image of a dolphin wrapped around an anchor as his ": null
    },
    {
        "publishers device": "publishing"
    },
    {
        " in June 42 The dolphin-and-anchor symbol is associated with the phrase  festina lente , meaning make haste slowly, indicating quickness combined with firmness in the execution of a great scheme. The symbol and phrase were taken from a Roman coin minted during Emperor ": null
    },
    {
        "Vespasian": "vespasian"
    },
    {
        "s reign that was given to Manutius by Pietro Bembo.     Manutiuss editions of the classics were so highly respected that the dolphin-and-anchor device was almost immediately pirated by French and Italian publishers. Many modern organizations use the image of a dolphin wrapped around an anchor. The device has been used by the nineteenth-century London firm of ": null
    },
    {
        "William Pickering": "william pickering"
    },
    {
        ", and by ": null
    },
    {
        "Doubleday": "doubleday"
    },
    {
        ". The international honor society for library and information science, ": null
    },
    {
        "Beta Phi Mu": "beta phi mu"
    },
    {
        ", uses the dolphin and anchor as its insignia.       Manutius described his new format of books as libelli portatiles in formam enchiridii . ": null
    },
    {
        "Enchiridion": "enchiridion"
    },
    {
        ", described in A Legacy More Lasting than Bronze, also refers to a handheld weapon, a hint that Aldus intended the books in his Portable Library to be the weapons of scholars. It was for these pocket-sized classics Aldus designed the italic font. Lyons, Martyn. 42 Books: a living history. Los Angeles: J. Paul Getty Museum.     Manutius converted to the smaller format in 42 with the publication of Virgil. As time went on, Manutius self-advertised his portable format through the dedication pages he published.     Many scholars consider the development of the portable book as Manutiuss most celebrated contribution to printing and publishing. These mobile books were the first known appearance of an ": null
    },
    {
        "editio minor": "editio minor"
    },
    {
        ", a straightforward text. During the 42th century, books were often chained to a reading platform to protect valuable property, requiring the reader to stay stationary. Publishers often added commentary to their published classics. Thus, pages became overloaded with scholarship and serious material which produced a large book that was difficult to transport. The Aldine Press removed these inconveniences; Manutius’s books were published without commentary and in smaller sizes, usually octavos of five by eight or four by six inches.  His famous octavo editions are often regarded as the first prototype of the mass-market paperback.     The octavos were moderately priced considering the known average salaries of the time, but they were not cheap. Manutiuss priced his Latin octavos at 42 ": null
    },
    {
        "soldi": "soldo"
    },
    {
        ", which was a fourth of a ": null
    },
    {
        "ducat": "ducat"
    },
    {
        ". His Greek octavos were double the price at 42 soldi. For context, a master mason would earn about 42 soldi a day to make between 42–42 ducats a year.               Everyday handwriting in Venice was in ": null
    },
    {
        "cursive": "cursive"
    },
    {
        ", but at the time, printed works imitated formal manuscript hands, either ": null
    },
    {
        "blackletter": "blackletter"
    },
    {
        " or the humanistic ": null
    },
    {
        "littera antica": "littera antica"
    },
    {
        ". Manutius commissioned typefaces designed to look like the handwriting of humanists both in Latin and Greek in order to uphold the manuscript tradition. In the New Aldine Studies, Harry George Fletcher III, ": null
    },
    {
        "Pierpont Morgan Library": "pierpont morgan library"
    },
    {
        "s curator for printed books and bindings, writes that Manutius intended to make available in type a face comfortable for its readers with the cursive typeface.     Manutius commissioned the ": null
    },
    {
        "punchcutter": "punchcutter"
    },
    {
        " Francesco Griffo": "francesco griffo"
    },
    {
        " of ": null
    },
    {
        "Bologna": "bologna, italy"
    },
    {
        " to create the new typeface. The handwriting reproduced for the many Aldine Press typefaces is a topic of conflicting opinions by scholars; the 42 Encyclopædia Britannica suggests Petrarchs handwriting, while the New Aldine Studies presumes the handwriting of scribes Pomponio Leto and Bartolomeo Sanvito was the inspiration for the typeface. Other scholars believe the first Greek typeface was derived from the handwriting of Immanuel Rhusotas, another scribe during the time of Manutius. The Aldine Press commissioned the first Greek script designed with accents and letters cast separately and combined by the compositor.  The typeface was first used in publishing Erotemata by Constantine Lascaris in 42 The Roman typeface was finished later the same year and Pietro Bembos De Aetna was the first book published in the new Roman script.     Manutius and Griffos original typeface is the first known model of ": null
    },
    {
        "italic type": "italic type"
    },
    {
        " and was used by Manutius until 42 Five italic words were printed in St. Catherine of Siena in 42 and in 42 an Opera by Virgil was the first completed book in italic type.  A falling out between Manutius and Griffo brought Griffo to leave and supply other publishers with the italic type originally commissioned by the Aldine Press. Griffo only made one set of punches for the Aldine Press, which were used until 42 Griffos original italic type did not include capital letters, so many of the Aldine Press publications forewent capital letters.     The 42 publication of the Metamorphoses included Manutiuss privilege from the Doge of Venice indicating that any use or imitation of Manutiuss Greek and Italic typefaces was forbidden. Despite trying to have the typeface protected legally, Manutius could not stop printers outside of Venice from using his work, which led to the typefaces popularity outside of Italy.       As the Aldine Press grew in popularity, Aldine counterfeits also increased. Manutius acquired privileges for his printing press from the Venetian Senate, specifically, for his types, his pioneering octavo format, and even individual texts.  Pope Alexander VI in 42 and Pope Julius II in 42 granted Manutius printing privileges from the papacy. This did not stop Aldine Press counterfeits, as there was little penalty for piracy at the time.     Manutius attempted to discourage piracy with blunt warnings at the end of his publications, as in Sylvarum libri quinque, by Publius Papinius Statius, where he warned no one is allowed to print this without penalty.  In the Bibliothèque du Roi on 42 March 42 Manutius tried to warn off those who plagiarized his content, it happens that in the city of Lyon our books appeared under my name, but full of errors... and deceived unwary buyers due to the similarity of typography and format....Furthermore, the paper is of poor quality and has a heavy odor, and the typography, if you examine it closely, exudes a sort of Frenchiness.  He described the counterfeits typographical errors in detail so that readers might distinguish a real Aldine from a fake. In spite of his efforts, the Lyonese printers were quick to use Manutiuss critique to improve their counterfeits.     \t   Before the printing press and during the Italian Renaissance, illuminated manuscripts were individually created by a credited artist. When print publishing became popular, woodcuts were used to mass-illuminate works. The woodcuts were often reused in several editions, thereby decreasing their value. These woodcuts soon came to Venice and were viewed as part of the new humanist manuscript.  The woodcut images included aspects of both continuity and discontinuity that involved the activity of Manutius, who was called upon to wholly explicate the new potential of the printed book and deal with the crisis of the illumination.  Many of the Aldine Presss publications contained illumination, but Manutius let patrons decide the illumination details while he worked to translate and publish.     Prefatory letters, popular in first editions of Latin works years before, were also common for Aldine editions. Manutius used the Aldine editions to ask scholarly questions and provide information for his readers. In the preface of ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " , he argues that Heroides 42 42 and 42 were the work of the poet ": null
    },
    {
        "Sabinus": "sabinus"
    },
    {
        ", whom Ovid refers to as Amores. In another preface Manutius explains how a sundial works.          In 42 Manutius married Maria, the daughter of Andrea Torresani of ": null
    },
    {
        "Asola": "asola, lombardy"
    },
    {
        ". Torresani and Manutius were already business partners, but the marriage combined the two partners shares in the publishing business. After the marriage, Manutius lived at Torresanis house. Shrinking in popularity, in 42 the Aldine Press was moved to a house now covered by a bank building in the Venice square, Campo Manin.     In March 42 Manutius decided to travel for six months in search of new and reliable manuscripts. While traveling with a guide, Manutius was stopped by border guards of the ": null
    },
    {
        "Marquisate of Mantua": "marquisate of mantua"
    },
    {
        " who were looking for two criminals. Manutiuss guide ran in fear, taking with him all of Manutiuss personal effects. This suspicious activity led the guards to arrest Manutius. Manutius knew the Marquis of Mantua, ": null
    },
    {
        "Francesco Gonzaga": "francesco ii gonzaga, marquess of mantua"
    },
    {
        ", and wrote letters to him to explain the situation, but it took six days until Manutiuss imprisonment was brought to Gonzagas attention. While waiting, Manutius spent five days in jail in ": null
    },
    {
        "Casal Romano": "villa romana del casale"
    },
    {
        " and another night in Canneto. He was eventually released by ": null
    },
    {
        "Geoffroy Carles": "geoffroy carles"
    },
    {
        ", president of the Milanese Senate. A new, improved edition of ": null
    },
    {
        "Horace": "horace"
    },
    {
        "  with an accompanying work by Manutius on Horatian metrics dedicated to Carles was contingent on this experience and Manutiuss connection with Carles.     Manutius wrote his will on 42 January 42 instructing ": null
    },
    {
        "Giulio Campagnola": "giulio campagnola"
    },
    {
        " to provide capital letters for the Aldine Presss italic type. He died the next month, 42 February, and with his death the importance of Italy as a seminal and dynamic force in printing came to an end.  Torresani and his two sons carried on the business during the youth of Manutiuss children, and eventually Paulus, Manutiuss son, took over the business. The publishing symbol and motto were never wholly abandoned by the ": null
    },
    {
        "Aldine Press": "aldine press"
    },
    {
        " until the expiration of their firm in its third generation of operation by ": null
    },
    {
        "Aldus Manutius the Younger": "aldus manutius the younger"
    },
    {
        ".     Manutius dreamed of a ": null
    },
    {
        "trilingual": "trilingual"
    },
    {
        " Bible but never saw it come to fruition. However, before his death Manutius had begun an edition of the ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        ", also known as the Greek ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " translated from ": null
    },
    {
        "Hebrew": "hebrew"
    },
    {
        ", the first ever to be published; it appeared posthumously in 42       42 marked the 42th anniversary of Aldus Manutiuss first publication. On Manutius, Paul F. Grendler wrote, Aldus ensured the survival of a large number of ancient texts and greatly facilitated the diffusion of the values, enthusiasms, and scholarship of Italian Renaissance Humanism to the rest of Europe . He jettisoned commentary because he felt that it prevented the dialogue between author and reader that the Renaissance prized.        The Aldine Press produced more than 42 editions from 42 to 42 The majority were Greek classics, but many notable Latin and Italian works were published as well.     Erasmus was impressed by Manutius; in a long passage he extols the tireless efforts of Manutius in restoring ancient learning, truly a Herculean task, and he announces that Aldus is building up a library which has no other limits than the world itself.      The Palazzo dei Pio chapel in Carpi has a painted mural that includes Aldus Manutius along with Alberto and Leonello Pio. In Bassiano, Manutiuss birthplace, a monument was erected to commemorate the 42th year since Manutiuss death. The inscription is Manutiuss own words: for the abundance of good books which, we hope, will finally put to flight all ignorance.      The quality and popularity of Manutiuss work made it more expensive in the 42th century than others published around the same time. In 42 Martin Lowry found that an auction in New York took place where initial prices of $42 – $42 and $42 – $42 were quotes on copies of Decor Puellarum and Aulus Gellius in Jenson’s editions: Aldus Hypnerotomachia Polifili started at $42 – $42. ": null
    }
]