[
    {
        "In the ": null
    },
    {
        "mathematical": "mathematics"
    },
    {
        " field of ": null
    },
    {
        "topology": "topology"
    },
    {
        ", the Alexandroff extension is a way to extend a noncompact ": null
    },
    {
        "topological space": "topological space"
    },
    {
        " by adjoining a single point in such a way that the resulting space is ": null
    },
    {
        "compact": "compact space"
    },
    {
        ". It is named for the Russian mathematician Pawel Alexandroff.   More precisely, let X be a topological space. Then the Alexandroff extension of X is a certain compact space X ": null
    },
    {
        "open": "open mapping"
    },
    {
        " embedding": "embedding"
    },
    {
        " c  :  X  →  X X in X c is a Hausdorff ": null
    },
    {
        "compactification": "compactification"
    },
    {
        " if and only if X is a locally compact, noncompact ": null
    },
    {
        "Hausdorff space": "hausdorff space"
    },
    {
        ". For such spaces the Alexandroff extension is called the one-point compactification or Alexandroff compactification. The advantages of the Alexandroff compactification lie in its simple, often geometrically meaningful structure and the fact that it is in a precise sense minimal among all compactifications; the disadvantage lies in the fact that it only gives a Hausdorff compactification on the class of locally compact, noncompact Hausdorff spaces, unlike the ": null
    },
    {
        "Stone–Čech compactification": "stone–čech compactification"
    },
    {
        " which exists for any ": null
    },
    {
        "topological space": "topological space"
    },
    {
        ", a much larger class of spaces.       A geometrically appealing example of one-point compactification is given by the inverse ": null
    },
    {
        "stereographic projection": "stereographic projection"
    },
    {
        ". Recall that the stereographic projection S gives an explicit homeomorphism from the unit sphere minus the north pole to the Euclidean plane. The inverse stereographic projection S^: \\mathbb^42 \\hookrightarrow S^42 is an open, dense embedding into a compact Hausdorff space obtained by adjoining the additional point \\infty . Under the stereographic projection latitudinal circles z c get mapped to planar circles r \\sqrt . It follows that the deleted neighborhood basis of given by the punctured spherical caps c \\leq z ": null
    }
]