[
    {
        "Alexander III  was ": null
    },
    {
        "King of Scots": "king of scots"
    },
    {
        " from 1249 until his death. He concluded the ": null
    },
    {
        "Treaty of Perth": "treaty of perth"
    },
    {
        ", by which Scotland acquired sovereignty over the Western Isles and the Isle of Man. His heir, ": null
    },
    {
        "Margaret, Maid of Norway": "margaret, maid of norway"
    },
    {
        ", died before she could be crowned.       Alexander was born at ": null
    },
    {
        "Roxburgh": "roxburgh"
    },
    {
        ", the only son of ": null
    },
    {
        "Alexander II": "alexander ii of scotland"
    },
    {
        " by his second wife ": null
    },
    {
        "Marie de Coucy": "marie de coucy"
    },
    {
        ". Alexander III was also the grandson of ": null
    },
    {
        "William the Lion": "william the lion"
    },
    {
        ". Alexanders father died on 8 July 1249 and he became king at the age of seven, inaugurated at ": null
    },
    {
        "Scone": "scone, perth and kinross"
    },
    {
        " on 13 July 1249.     The years of his minority featured an embittered struggle for the control of affairs between two rival parties, the one led by ": null
    },
    {
        "Walter Comyn": "walter comyn"
    },
    {
        ", ": null
    },
    {
        "Earl of Menteith": "earl of menteith"
    },
    {
        ", the other by ": null
    },
    {
        "Alan Durward": "alan durward"
    },
    {
        ", ": null
    },
    {
        "Justiciar of Scotia": "justiciar of scotia"
    },
    {
        ". The former dominated the early years of Alexanders reign. At the marriage of Alexander to ": null
    },
    {
        "Margaret of England": "margaret of england"
    },
    {
        " in 1251, ": null
    },
    {
        "Henry III of England": "henry iii of england"
    },
    {
        " seized the opportunity to demand from his son-in-law homage for the Scottish kingdom, but Alexander did not comply. In 1255 an interview between the English and Scottish kings at ": null
    },
    {
        "Kelso": "kelso, scottish borders"
    },
    {
        " led to Menteith and his party losing to Durwards party. But though disgraced, they still retained great influence, and two years later, seizing the person of the king, they compelled their rivals to consent to the erection of a regency representative of both parties.      On attaining his majority at the age of 21 in 1262, Alexander declared his intention of resuming the projects on the ": null
    },
    {
        "Western Isles": "western isles"
    },
    {
        " which the death of his father thirteen years before had cut short. He laid a formal claim before the ": null
    },
    {
        "Norwegian": "norway"
    },
    {
        " king ": null
    },
    {
        "Haakon": "haakon iv of norway"
    },
    {
        ". Haakon rejected the claim, and in the following year responded with a formidable invasion. Sailing around the west coast of Scotland he halted off the ": null
    },
    {
        "Isle of Arran": "isle of arran"
    },
    {
        ", and negotiations commenced. Alexander artfully prolonged the talks until the autumn storms should begin. At length Haakon, weary of delay, attacked, only to encounter a terrific ": null
    },
    {
        "storm": "extreme weather"
    },
    {
        " which greatly damaged his ships. The ": null
    },
    {
        "Battle of Largs": "battle of largs"
    },
    {
        " proved indecisive, but even so, Haakons position was hopeless. Baffled, he turned homewards, but died in Orkney on 15 December 1263. The Isles now lay at Alexanders feet, and in 1266 Haakons successor concluded the ": null
    },
    {
        "Treaty of Perth": "treaty of perth"
    },
    {
        " by which he ceded the ": null
    },
    {
        "Isle of Man": "isle of man"
    },
    {
        " and the ": null
    },
    {
        "Western Isles": "western isles"
    },
    {
        " to Scotland in return for a monetary payment. Norway retained ": null
    },
    {
        "Orkney": "orkney"
    },
    {
        " and ": null
    },
    {
        "Shetland": "shetland"
    },
    {
        " until 1469 when they became a dowry for ": null
    },
    {
        "James IIIs": "james iii of scotland"
    },
    {
        "bride, ": null
    },
    {
        "Margaret of Denmark": "margaret of denmark, queen of scotland"
    },
    {
        ".         Alexander had married ": null
    },
    {
        "Margaret": "margaret of england"
    },
    {
        " , daughter of King ": null
    },
    {
        "Henry III of England": "henry iii of england"
    },
    {
        " and ": null
    },
    {
        "Eleanor of Provence": "eleanor of provence"
    },
    {
        ", on 25 December 1251, when he was ten years old and she was eleven.  She died in 1275, after they had had three children.   :   ": null
    },
    {
        "Margaret": "margaret of scotland"
    },
    {
        " , who married King ": null
    },
    {
        "Eric II of Norway": "eric ii of norway"
    },
    {
        "   Alexander, Prince of Scotland": "alexander, prince of scotland"
    },
    {
        " ; buried in ": null
    },
    {
        "Dunfermline Abbey": "dunfermline abbey"
    },
    {
        "   David ; buried in ": null
    },
    {
        "Dunfermline Abbey": "dunfermline abbey"
    },
    {
        "     According to the ": null
    },
    {
        "Lanercost Chronicle": "lanercost chronicle"
    },
    {
        ", Alexander did not spend his decade as a widower alone: he used never to forbear on account of season nor storm, nor for perils of flood or rocky cliffs, but would visit none too creditably nuns or matrons, virgins or widows as the fancy seized him, sometimes in disguise.      Towards the end of Alexanders reign, the death of all three of his children within a few years made the question of the succession one of pressing importance. In 1284 he induced the ": null
    },
    {
        "Estates": "parliament of scotland"
    },
    {
        " to recognize as his heir-presumptive his granddaughter ": null
    },
    {
        "Margaret, the Maid of Norway ": "margaret of scotland"
    },
    {
        ". The need for a male heir led him to contract a second marriage to ": null
    },
    {
        "Yolande de Dreux": "yolande de dreux"
    },
    {
        "  on 1 November 1285.     Alexander died in a fall from his horse while riding in the dark to visit the queen at ": null
    },
    {
        "Kinghorn": "kinghorn"
    },
    {
        " in ": null
    },
    {
        "Fife": "fife"
    },
    {
        " on 18 March 1286 because it was her birthday the next day.   He had spent the evening at Edinburgh Castle celebrating his second marriage and overseeing a meeting with royal advisors. He was advised by them not to make the journey to Fife because of weather conditions, but he travelled anyway. Alexander became separated from his guides and it is assumed that in the dark his horse lost its footing. The 44-year-old king was found dead on the shore the following morning with a broken neck. Some texts have said that he fell off a cliff.  Although there is no cliff at the site where his body was found, there is a very steep rocky embankment, which would have been fatal in the dark.  After Alexanders death, his strong realm was plunged into a period of darkness that would eventually lead to war with England. He was buried in ": null
    },
    {
        "Dunfermline Abbey": "dunfermline abbey"
    },
    {
        ".     As Alexander left no surviving children, the heir to the throne was his unborn child by Queen Yolande. When Yolandes pregnancy ended, probably with a miscarriage, Alexanders seven-year-old granddaughter ": null
    },
    {
        "Margaret, Maid of Norway": "margaret, maid of norway"
    },
    {
        ", became the heir. Margaret died, still uncrowned, on her way to Scotland in 1290. The inauguration of ": null
    },
    {
        "John Balliol": "john balliol"
    },
    {
        " as king on 30 November 1292 ended the six years of the ": null
    },
    {
        "Guardians of Scotland": "guardians of scotland"
    },
    {
        " governing the land.     The death of Alexander and the subsequent period of instability in Scotland was lamented in an early ": null
    },
    {
        "Scots": "scots language"
    },
    {
        " poem recorded by ": null
    },
    {
        "Andrew of Wyntoun": "andrew of wyntoun"
    },
    {
        " in his ": null
    },
    {
        "Orygynale Cronykil of Scotland": "orygynale cronykil of scotland"
    },
    {
        ".          In 1886, a monument to Alexander III was erected at the approximate location of his death in ": null
    },
    {
        "Kinghorn": "kinghorn"
    },
    {
        ".             Alexander III has been depicted in historical novels. They include: Nield , p. 37     The Thirsty Sword by Robert Leighton. The novel depicts the Norse invasion of Scotland  and the ": null
    },
    {
        "Battle of Largs": "battle of largs"
    },
    {
        ". It includes depictions of Alexander III and his opponent ": null
    },
    {
        "Haakon IV of Norway": "haakon iv of norway"
    },
    {
        ". Nield , p. 37   Alexander the Glorious by Jane Oliver. The novel covers the entire reign of Alexander III , almost entirely from Alexanders viewpoint .     The Crown in Darkness by ": null
    },
    {
        "Paul C. Doherty": "paul c. doherty"
    },
    {
        ". A ": null
    },
    {
        "crime fiction": "crime fiction"
    },
    {
        " novel where Hugh Corbett investigates the mysterious death of Alexander III . Alexander supposedly suffered a fatal fall from his horse. But there are suspicions of murder. The novel concludes that Alexander was indeed murdered by a fanatical servant of ": null
    },
    {
        "Edward I of England": "edward i of england"
    },
    {
        ". The killer acting according to Edwards secret desire to overwhelm and control Scotland . Doherty suggests that the personal relations of the two kings were strained by constant arguments, though this is not confirmed by historical sources. Browne, Kreiser , p. 78, 80-81   Quest For A Maid by ": null
    },
    {
        "Frances Mary Hendry": "frances mary hendry"
    },
    {
        ". The novel depicts the life of Meg, her power-hungry older sister Inge, Lady ": null
    },
    {
        "Marjorie, Countess of Carrick": "marjorie, countess of carrick"
    },
    {
        " and their part in securing the succession of Lady Marjories son ": null
    },
    {
        "Robert the Bruce": "robert the bruce"
    },
    {
        " to the Scottish throne. It includes depictions of Alexander IIIs death as falling off a cliff with sorcery as the cause.   Insurrection by ": null
    },
    {
        "Robyn Young": "robyn young"
    },
    {
        ". This novel is the first of a series of novels primarily about the life and times of Robert the Bruce. However, it covers Alexander III and the circumstances surrounding his death in some detail.    ": null
    },
    {
        "Raphael Holinshed": "raphael holinshed"
    },
    {
        ", in his oft-fanciful history of England in his ": null
    },
    {
        "Chronicles": "holinsheds chronicles"
    },
    {
        ", stated that at Alexander IIIs wedding, a horrible monster, mostly skeleton but with raw flesh, appeared at the end of the procession and caused the wedding to be hurriedly concluded. This was, in tradition, an omen of death.   Crusader by ": null
    },
    {
        "Nigel Tranter": "nigel tranter"
    },
    {
        ". This novel follows the minority of Alexander III and his relationship with David de Lindsay. Tranter, who has written scores of historical novels spanning the range of Scotlands history, also wrote Envoy Extraordinary and True Thomas , both of which take place during the reign of Alexander III, and in which Alexander is a featured character.               ": null
    },
    {
        "Anderson, Alan Orr": "alan orr anderson"
    },
    {
        " , Early Sources of Scottish History: AD 500–1286, 2 Vols, , republished, ": null
    },
    {
        "Marjorie Anderson": "marjorie ogilvie anderson"
    },
    {
        "   idem , Scottish Annals from English Chroniclers: AD 500–1286, , republished, ": null
    },
    {
        "Marjorie Anderson": "marjorie ogilvie anderson"
    },
    {
        "   .       .     Robert the Bruce: King of Scots, 1996                                                                            ": null
    }
]