[
    {
        "        Alexander II Theos Epiphanes Nikephoros  was a ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " Seleucid": "seleucid empire"
    },
    {
        " monarch who reigned as the ": null
    },
    {
        "King of Syria": "list of syrian monarchs"
    },
    {
        " between 42 BC and 42 BC. His true parentage is debated; most ancient historians and the modern academic consensus maintain he was a pretender who claimed to be a Seleucid, either a son of ": null
    },
    {
        "Alexander I": "alexander balas"
    },
    {
        " or an adopted son of ": null
    },
    {
        "Antiochus VII": "antiochus vii sidetes"
    },
    {
        ". His surname Zabinas is a Semitic name that is usually translated as the bought one . It is possible, however, that Alexander II was a natural son of Alexander I, as the surname can also mean bought from the god . The iconography of Alexander IIs coinage indicates he based his claims to the throne on his descent from ": null
    },
    {
        "Antiochus IV": "antiochus iv epiphanes"
    },
    {
        ", the father of Alexander I.     Alexander IIs rise is connected to the dynastic feuds of the Seleucid Empire. Both King Seleucus IV and his brother Antiochus IV had descendants contending for the throne, leading the country to experience many civil wars. The situation was complicated by ": null
    },
    {
        "Ptolemaic": "ptolemaic dynasty"
    },
    {
        " Egyptian": "ptolemaic kingdom"
    },
    {
        " interference, which was facilitated by the dynastic marriages between the two royal houses. In 42 BC, King ": null
    },
    {
        "Demetrius II": "demetrius ii nicator"
    },
    {
        " of Syria, the representative of Seleucus IVs line, invaded Egypt to help his mother-in-law ": null
    },
    {
        "Cleopatra II": "cleopatra ii of egypt"
    },
    {
        " who was engaged in a civil war against her brother and husband King ": null
    },
    {
        "Ptolemy VIII": "ptolemy viii physcon"
    },
    {
        ". Angered by the Syrian invasion, the Egyptian king instigated revolts in the cities of Syria against Demetrius II and chose Alexander II, a supposed representative of Antiochus IVs line, as an ": null
    },
    {
        "anti-king": "anti-king"
    },
    {
        ". With Egyptian troops, Alexander II captured the Syrian capital ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " in 42 BC and warred against Demetrius II, defeating him decisively in 42 BC. The beaten king escaped to his wife ": null
    },
    {
        "Cleopatra Thea": "cleopatra thea"
    },
    {
        " in the city of ": null
    },
    {
        "Ptolemais": "ptolemais in phoenicia"
    },
    {
        ", but she expelled him. He was killed while trying to find refuge in the city of ": null
    },
    {
        "Tyre": "tyre, lebanon"
    },
    {
        ".     With the death of Demetrius II, Alexander II became the master of the kingdom, controlling the realm except for a small pocket around Ptolemais where Cleopatra Thea ruled. Alexander II was a beloved king, known for his kindness and forgiving nature. He maintained friendly relations with ": null
    },
    {
        "John I Hyrcanus": "john hyrcanus"
    },
    {
        " of Judea, who acknowledged the Syrian king as his ": null
    },
    {
        "suzerain": "suzerainty"
    },
    {
        ". Alexander IIs successes were not welcomed by Egypts Ptolemy VIII, who did not want a strong king on the Syrian throne. Thus, in 42 BC an alliance was established between Egypt and Cleopatra Thea, now ruling jointly with ": null
    },
    {
        "Antiochus VIII": "antiochus viii grypus"
    },
    {
        ", her son by Demetrius II. Alexander II was defeated, and he escaped to Antioch, where he pillaged the temple of ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " to pay his soldiers; the population turned against him, and he fled and was eventually captured. Alexander II was probably executed by Antiochus VIII in 42 BC, ending the line of Antiochus IV.                   The death of the Seleucid king ": null
    },
    {
        "Seleucus IV": "seleucus iv philopator"
    },
    {
        " in 42 BC created a dynastic crisis because of the illegal succession of his brother ": null
    },
    {
        "Antiochus IV": "antiochus iv epiphanes"
    },
    {
        ". Seleucus IVs legitimate heir, ": null
    },
    {
        "Demetrius I": "demetrius i soter"
    },
    {
        ", was a hostage in Rome, and his ": null
    },
    {
        "younger son Antiochus": "antiochus, son of seleucus iv"
    },
    {
        " was declared king. Shortly after the succession of young Antiochus, however, Antiochus IV assumed the throne as a co-ruler. He may have had his nephew killed in 42/42 BC . After Antiochus IVs death in 42 BC, his son ": null
    },
    {
        "Antiochus V": "antiochus v eupator"
    },
    {
        " succeeded him. Three years later Demetrius I managed to escape Rome and take the throne, killing Antiochus V in 42 BC. The Seleucid dynasty was torn apart by the civil war between the lines of Seleucus IV and Antiochus IV.     In 42 BC ": null
    },
    {
        "Alexander I": "alexander i balas"
    },
    {
        ", an illegitimate son of Antiochus IV, managed to dethrone and kill Demetrius I. He married ": null
    },
    {
        "Cleopatra Thea": "cleopatra thea"
    },
    {
        ", the daughter of ": null
    },
    {
        "Ptolemy VI": "ptolemy vi philometor"
    },
    {
        " of ": null
    },
    {
        "Ptolemaic": "ptolemaic dynasty"
    },
    {
        " Egypt": "ptolemaic kingdom"
    },
    {
        ", who became his ally and supporter. The Egyptian king changed his policy and supported Demetrius Is son ": null
    },
    {
        "Demetrius II": "demetrius ii nicator"
    },
    {
        ", marrying him to Cleopatra Thea after divorcing her from Alexander I, who was defeated by his former father in law and eventually killed in 42 BC. The Egyptian king was wounded during the battle and died shortly after Alexander I. His sister-wife and co-ruler, the mother of Cleopatra Thea, ": null
    },
    {
        "Cleopatra II": "cleopatra ii of egypt"
    },
    {
        ", then married her other brother, ": null
    },
    {
        "Ptolemy VIII": "ptolemy viii physcon"
    },
    {
        " who became her new co-ruler.     ": null
    },
    {
        "Diodotus Tryphon": "diodotus tryphon"
    },
    {
        ", Alexander Is official, declared the latters son ": null
    },
    {
        "Antiochus VI": "antiochus vi dionysus"
    },
    {
        " king in 42 BC. Tryphon then had him killed and assumed the throne himself in 42 BC. The usurper controlled lands in the western parts of the Seleucid empire, including Antioch, but Demetrius II retained large parts of the realm, including ": null
    },
    {
        "Babylonia": "babylonia"
    },
    {
        ", which was invaded by the ": null
    },
    {
        "Parthian Empire": "parthian empire"
    },
    {
        " in 42 BC. This led Demetrius II to launch a campaign against Parthia which ended in his defeat and capture in 42 BC. His younger brother ": null
    },
    {
        "Antiochus VII": "antiochus vii sidetes"
    },
    {
        " took the throne and married Demetrius IIs wife. He was able to defeat Tryphon and the Parthians, restoring the lost Seleucid provinces.     In Egypt, without divorcing Cleopatra II, Ptolemy VIII married her daughter by Ptolemy VI, ": null
    },
    {
        "Cleopatra III": "cleopatra iii of egypt"
    },
    {
        ", and declared her co-ruler. Cleopatra II revolted and took control over the countryside. By September 42 BC, Ptolemy VIII lost recognition in the capital ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " and fled to ": null
    },
    {
        "Cyprus": "cyprus"
    },
    {
        ". The Parthians freed Demetrius II to put pressure on Antiochus VII, who was killed in 42 BC during a battle in ": null
    },
    {
        "Media": "media"
    },
    {
        ". This opened the way for Demetrius II to regain his throne and wife Cleopatra Thea the same year. Ptolemy VIII returned to Egypt two years after his expulsion; he warred against his sister Cleopatra II, eventually besieging her in Alexandria; she then asked her son-in-law Demetrius II for help, offering him the throne of Egypt. The Syrian king marched against Egypt and by spring 42 BC, he reached ": null
    },
    {
        "Pelusium": "pelusium"
    },
    {
        ".     In response to Demetrius IIs campaign, Ptolemy VIII incited a rebellion in Syria. The Syrian capital ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " proclaimed a young son of Antiochus VII named Antiochus Epiphanes king, but the city was willing to change hands in such unstable political circumstances. Ptolemy VIII sent Alexander II as an ": null
    },
    {
        "anti-king": "anti-king"
    },
    {
        " for Syria, forcing Demetrius II to withdraw from Egypt. According to the third century historian ": null
    },
    {
        "Porphyry": "porphyry"
    },
    {
        ", in his history preserved in the work of his contemporary ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        ", and also to the third century historian ": null
    },
    {
        "Justin": "justin"
    },
    {
        ", in his ": null
    },
    {
        "epitome": "epitome"
    },
    {
        " of the Philippic Histories, a work written by the first century BC historian ": null
    },
    {
        "Trogus": "gnaeus pompeius trogus"
    },
    {
        ", Alexander II was a protégé of Ptolemy VIII. The first century historian ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        " wrote the Syrians themselves asked Ptolemy VIII to send them a Seleucid prince as their king, and he chose Alexander II. According to the Prologues of the Philippic Histories, the Egyptian king bribed Alexander II to oppose Demetrius II.                Alexander II was probably born in c. 42 BC. His name is Greek, meaning protector of men . According to Justin, Alexander II was the son of an Egyptian trader named Protarchus. Justin also added that Alexander was a regnal name bestowed upon the king by the Syrians. Justin further stated that Alexander II produced a fabricated story claiming he was an adopted son of Antiochus VII. Porphyry presented a different account in which Alexander II was claimed to be the son of Alexander I.     Modern historic research prefers the detailed account of Justin regarding Alexander IIs claims of paternity and his connection to Antiochus VII. However, a 42 BC series of gold ": null
    },
    {
        "stater": "stater"
    },
    {
        "s minted by Alexander II had his ": null
    },
    {
        "epithets": "epithets"
    },
    {
        ", the same ones used by King Antiochus IV, father of Alexander I, and arranged in the same order they had on Antiochus IVs coins. ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " carrying a ": null
    },
    {
        "Nike": "nike"
    },
    {
        " is depicted on the reverse of the stater; the Nike is carrying a ": null
    },
    {
        "wreath": "laurel wreath"
    },
    {
        " which crowns the epithet Epiphanes, an element featured in Antiochus IVs coinage. Many themes of Antiochus IVs line appeared on Alexander IIs coinage, such as the god ": null
    },
    {
        "Dionysus": "dionysus"
    },
    {
        " which was used by Alexander I in 42 BC, in addition to the lion scalp, another theme in Alexander Is coinage. Furthermore, Alexander II was depicted wearing the ": null
    },
    {
        "radiate crown": "radiant crown"
    },
    {
        "; six rays protrude from the head and are not attached to the diadem, which is a theme that characterised all portraits of Antiochus VI when depicted wearing the radiate crown. Based on those arguments, the account of Porphyry regarding Alexander IIs claim of descent from Alexander I should be preferred to the account of Justin.       Popular surnames of Seleucid kings are never found on coins, but are handed down only through ancient literature. The surname of Alexander II has different spellings; it is Zabinaeus in the prologue of the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " language Philippic Histories, book XXXIX. Zebinas was used by Josephus. The Greek rendition, Zabinas, was used by many historians such as ": null
    },
    {
        "Diodorus Siculus": "diodorus siculus"
    },
    {
        " and Porphyry. Zabinas is a ": null
    },
    {
        "Semitic": "semitic languages"
    },
    {
        " proper name, derived from the ": null
    },
    {
        "Aramaic": "aramaic language"
    },
    {
        " verb  זבן  , which means buy or gain . The meaning of Zabinas as a surname of Alexander II is a slave sold in the market according to philologist ": null
    },
    {
        "Pierre Jouguet": "pierre jouguet"
    },
    {
        ". This is based on a statement by Porphyry. He wrote that Alexander II was named Zabinas by the Syrians because he was a bought slave . In the view of archaeologist ": null
    },
    {
        "Jean-Antoine Letronne": "jean-antoine letronne"
    },
    {
        ", who agreed that Alexander II was an imposter, a coin meant for the public could not have had Zabinas inscribed on it as it is derisory. On the other hand, historian ": null
    },
    {
        "Philip Khuri Hitti": "philip khuri hitti"
    },
    {
        " noted that Zebina , another rendering of Zabinas, occurs in ": null
    },
    {
        "Ezra": "ezra–nehemiah"
    },
    {
        " , indicating it originally meant bought from god . The ": null
    },
    {
        "numismatist": "numismatics"
    },
    {
        " Nicholas L. Wright also considered that Zabinas meant purchased from the god .     Though academic consensus considers Alexander II an imposter of non-Seleucid birth, Josephus accepted the king as a Seleucid dynast but did not specify his connection to earlier kings. Historian  ascribed Josephuss acceptance to Alexander IIs successful propaganda. Wright, however, contends that Alexander II should be considered a legitimate Seleucid and a descendant of Antiochus IV using the following arguments:  Justin called Antiochus VI a step-son of Demetrius II. In Wrights view, this association between Antiochus VI and his fathers enemy might be an indication that Demetrius II adopted Antiochus VI in an attempt to close the rift in the royal family. Likewise, it is possible Alexander II was indeed a son of Alexander I adopted by Antiochus VII. The second century historian ": null
    },
    {
        "Arrian": "arrian"
    },
    {
        " spoke of an Alexander, the son of Alexander I, who was elevated to kingship by Tryphon in 42 BC; this passage is puzzling as it is numismatically proven that it was Antiochus VI whom Tryphon raised to the throne. According to Wright, the language of Arrian indicates he probably had access to sources mentioning Alexander II as a son of Alexander I.  Wright suggested Alexander II was an illegitimate son of Alexander I; it is probable Alexander II might have been a younger son of Alexander I destined to become a priest, hence he was called Zabinas—purchased from the god. It is dubious Alexander II was a low-born Egyptian man, whose claims to the throne were based on publicly known falsifications, yet he was accepted by the Syrians as their king. The story about Alexander IIs Egyptian origin was probably invented by the court of Demetrius II, maintained by the court of his son Antiochus VIII, and kept alive by ancient historians due to its scandalous nature.         The young Antiochus Epiphanes probably died of an illness. Alexander II, whose earliest coins from the capital are dated to 42 SE , probably landed in northern Syria with Ptolemaic support and declared himself king, taking Antioch in the process; the fall of the capital probably took place in spring 42 BC. According to Justins epitome, the Syrians were ready to accept any king other than Demetrius II. Probably soon after capturing Antioch, Alexander II incorporated ": null
    },
    {
        "Laodicea ad mare": "laodicea in syria"
    },
    {
        " and ": null
    },
    {
        "Tarsus": "tarsus, mersin"
    },
    {
        " into his domains. Other cities, such as ": null
    },
    {
        "Apamea": "apamea, syria"
    },
    {
        ", had already freed themselves from Demetrius II during his Egyptian campaign and did not come immediately under Alexander IIs authority.       ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " kings did not use ": null
    },
    {
        "regnal number": "regnal number"
    },
    {
        "s, which is a modern practise; instead, they used epithets to distinguish themselves from similarly named monarchs. The majority of Alexander IIs coins did not feature an epithet, but the 42 BC series of gold staters bore the epithets Theos Epiphanes and Nikephoros . Three bronze issues, one of them minted in ": null
    },
    {
        "Seleucia Pieria": "seleucia pieria"
    },
    {
        ", are missing the epithet Theos but retain Epiphanes and Nikephoros. Those epithets, an echo of those of Antiochus IVs, served to emphasise the legitimacy of Alexander II as a Seleucid king.     ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " , founder of the ": null
    },
    {
        "Macedonian Empire": "macedonia empire"
    },
    {
        ", was an important figure in the Hellenistic world; his successors used his legacy to establish their legitimacy. Alexander the Great never had his image minted on his own coins, but his successors, such as the Ptolemaics, sought to associate themselves with him; cities were named after him, and his image appeared on coins. In contrast, the memory of Alexander the Great was not important for Seleucid royal ideology. However, Alexander I and Alexander II, both having Egyptian support, were the only Seleucid kings who paid particular attention to Alexander the Great by depicting themselves wearing the lion scalp, a motif closely connected to the Macedonian king. By associating himself with Alexander the Great, Alexander II was continuing the practice of Alexander I, who used the theme of Alexander the Great to strengthen his legitimacy.      The native Syro-Phoenician religious complex was based on triads that included a supreme god, a supreme goddess, and their son; the deities taking those roles were diverse. It is possible that by 42 BC Dionysus took the role of the son. The ": null
    },
    {
        "Levant": "levant"
    },
    {
        " was a multi-ethnic, multi-cultural region, but the religious complex was a unifying force. The Seleucid monarchs understood the possibility of using this complex to expand their support base amongst the locals by integrating themselves into the triads. Usage of the radiate crown, a sign of divinity, by the Seleucid kings, probably carried a message: that the king was the consort of ": null
    },
    {
        "Atargatis": "atargatis"
    },
    {
        ", Syrias supreme goddess. The radiate crown was utilised for the first time at an unknown date by Antiochus IV, who chose ": null
    },
    {
        "Hierapolis-Bambyce": "manbij"
    },
    {
        ", the most important sanctuary of Atargatis, to ritually marry ": null
    },
    {
        "Diana": "diana"
    },
    {
        ", considered a manifestation of the Syrian goddess in the Levant. Alexander Is nickname, Balas, was probably used by the king himself. It is the Greek rendering of ": null
    },
    {
        "Baal": "baal"
    },
    {
        ", the Levants supreme god. By using such an epithet, Alexander I was declaring himself the embodiment of Baal. Alexander I also used the radiate crown to indicate his ritual marriage to the supreme goddess. Alexander II made heavy use of the motifs of Dionysus in his coins. It is possible that, by utilising Dionysus, the son of the supreme god, Alexander II presented himself as the spiritual successor of his god-father, in addition to being his political heir.       One of Alexander IIs first acts was the burial of Antiochus VIIs remains which were returned by the Parthians. Burying the fallen king earned Alexander II the acclaim of Antiochs citizens; it was probably a calculated move aiming at gaining the support of Antiochus VIIs loyal men. The seventh century chronicler ": null
    },
    {
        "John of Antioch": "john of antioch"
    },
    {
        " wrote that following Antiochus VIIs death, his son Seleucus ascended the throne and was quickly deposed by Demetrius II and fled to Parthia. Historian ": null
    },
    {
        "Auguste Bouché-Leclercq": "auguste bouché-leclercq"
    },
    {
        " criticised this account, which is problematic and could be a version of Demetrius IIs Parthian captivity corrupted by John of Antioch. However, it is possible that a son of Antiochus VII named Seleucus was captured by the Parthians along with his father and was later sent with Antiochus VIIs remains to take the throne of Syria as a Parthian protégé. If this scenario happened, then Seleucus was faced by Alexander II and had to return to Parthia.        Since he ascended the throne with Egyptian help, Alexander II was under Ptolemaic influence, which was manifested in the appearance of the Egyptian style double ": null
    },
    {
        "filleted": "fillet"
    },
    {
        " cornucopia": "cornucopia"
    },
    {
        "e on the Syrian coinage. In Egypt, the double cornucopiae on coins might have been a reference to the union between the king and his consort. If the appearance of cornucopiae on Alexander IIs coinage was connected to Ptolemaic practices, then it can be understood that Alexander II might have married a Ptolemaic princess, though such a marriage is not recorded by ancient literature.     According to Diodorus Siculus, Alexander II was kindly and of a forgiving nature, and moreover was gentle in speech and in manners, wherefore he was deeply beloved by the common people . Diodorus Siculus wrote that three of Alexander IIs officers, Antipater, Klonios, and Aeropos, rebelled and entrenched themselves in Laodicea. Alexander II defeated the rebels and recaptured the city; he pardoned the culprits. Bouché-Leclercq suggested that this rebellion took place in 42 BC and that the officers either defected to Demetrius IIs side, were working for the son of Antiochus VII, or were instigated in their rebellion by Cleopatra Thea.             Between August 42 BC and August 42 BC, Ptolemy VIII regained Alexandria; Cleopatra II fled to Demetrius II with the treasury of Egypt. Despite Alexander IIs success in taking the capital, Demetrius II retained ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        ", and Seleucia Pieria remained loyal to him, so did many cities in ": null
    },
    {
        "Coele-Syria": "coele-syria"
    },
    {
        "; this led Alexander II to launch a campaign in the region. The armies of the two kings passed through Judea causing a plight for the inhabitants. This led the Jews to send an embassy to Rome demanding the prohibition of the marching of royal soldiers through the Jewish territory and that of their subjects ; the embassy was between c. 4242 BC. By October 42 BC, ": null
    },
    {
        "Ashkelon": "ashkelon"
    },
    {
        " fell into Alexander IIs hands. Numismatic evidence indicates that ": null
    },
    {
        "Samaria": "samaria"
    },
    {
        " came under Alexander IIs control. In the beginning of 42 BC, Demetrius II was defeated near ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        " and fled to ": null
    },
    {
        "Ptolemais": "ptolemais in phoenicia"
    },
    {
        ". Cleopatra Thea refused to allow her husband to stay in the city, so he headed to ": null
    },
    {
        "Tyre": "tyre, lebanon"
    },
    {
        " on board a ship. Demetrius II asked for ": null
    },
    {
        "temple asylum": "asylum"
    },
    {
        " in Tyre, but was killed by the citys commander  in the spring or summer of 42 BC.     Alexander II minted bronze coins depicting him with an elephant scalp headdress on the obverse, and an ": null
    },
    {
        "aphlaston": "beakhead"
    },
    {
        " appears on the reverse; this can mean that Alexander II claimed a naval victory. The sea battle between Alexander II and Demetrius II, which is not documented in ancient literature, may have occurred only during the voyage of Demetrius II from Ptolemais to Tyre. The elephant scalp headdress was a theme in Alexander the Greats posthumous coinage minted by his successors. According to Ehling, by appearing with the elephant scalp, Alexander II alluded to Alexander the Greats conquest of Tyre which took place in 42 BC after seven months of siege. The 42 BC gold staters containing Alexander IIs epithets were probably struck to celebrate his victory over Demetrius II.       Under Antiochus VII, the Judean high-priest and ruler ": null
    },
    {
        "John Hyrcanus I": "john hyrcanus"
    },
    {
        " acquired the status of a ": null
    },
    {
        "vassal": "vassal"
    },
    {
        " prince, paying tribute and minting his coinage in the name of the Syrian monarch. Following Antiochus VIIs death, John Hyrcanus I ceased paying the tribute and minted coinage bearing his own name, but ties were kept with the Seleucid kingdom through ": null
    },
    {
        "monogram": "monogram"
    },
    {
        "s, representing Seleucid kings, that appeared on the early coins. The dating of this event is conjectural, with the earliest date possible 42 BC but more likely 42 BC. Demetrius II apparently planned an invasion of Judea, which was halted due to the kings failed invasion of Egypt and the uprising that erupted in Syria. According to Josephus, John Hyrcanus I flourished greatly under Alexander IIs rule; apparently, the Judean leader sought an alliance with Alexander II to defend himself against Demetrius II.      The 42 BC embassy sent by Judea to Rome asked the senate to force the Syrian abandonment of: ": null
    },
    {
        "Jaffa": "jaffa"
    },
    {
        ", the ": null
    },
    {
        "Mediterranean": "mediterranean sea"
    },
    {
        " harbours which included ": null
    },
    {
        "Iamnia": "yavne"
    },
    {
        " and ": null
    },
    {
        "Gaza": "gaza city"
    },
    {
        ", the cities of ": null
    },
    {
        "Gazara": "gezer"
    },
    {
        " and Pegae , in addition to other territories taken by King Antiochus VII. A Roman  senatus consultum  , preserved in Josephuss work  Antiquities of the Jews  , granted the Jews their request regarding the cities, but did not mention the city of Gazara. The senatorial decree mentions the reigning Syrian king as Antiochus son of Antiochus, which can mean only ": null
    },
    {
        "Antiochus IX": "antiochus ix cyzicenus"
    },
    {
        ", who assumed the throne in 42 SE . The decree might indicate the Syrians had already abandoned Gazara in c. 42 SE . This supports the notion that an agreement between Alexander II and John Hyrcanus I was signed early in the Syrian kings reign. Such a treaty would have established the alliance between Alexander II and Judea, and stipulated a territorial agreement where John Hyrcanus I received the lands south of Gazara including that city, while Alexander II maintained control over the region north of Gazara including Samaria.     John Hyrcanus I recognised Alexander II as his sovereign. The earliest series of coins minted by the high priest showed the Greek letter Α positioned prominently above John Hyrcanus Is name. The alpha must have been the first letter of a Seleucid kings name, and many scholars, such as Dan Barag, suggested that it represents Alexander II. Another clue indicating the relationship between Alexander II and John Hyrcanus I is the latters use of the double cornucopiae motif on his coins; a pomegranate motif appeared in the centre of the cornucopiae to highlight the authority of the Jewish leader. This imagery was apparently a cautious policy by John Hyrcanus I. In case Alexander II was defeated, the Judean coins motifs were neutral enough to appease an eventual successor, while if Alexander II emerged victorious and decided to interfere in Judea, the cornucopiae coins could be used to show the king that John Hyrcanus I already accepted Alexander IIs suzerainty. The high priest eventually won the independence of Judea later in Alexander IIs reign; once John Hyrcanus I severed his ties with the Seleucids, the alpha was removed.             Following Demetrius IIs death, Alexander II, commanding a force of forty thousand soldiers, brought Seleucia Pieria under his control. Cilicia was also conquered in 42 BC along with other regions. The coinage of Alexander II was minted in: Antioch, Seleucia Pieria, Apamea, Damascus, ": null
    },
    {
        "Beirut": "beirut"
    },
    {
        ", Ashkelon and Tarsus, in addition to unknown minting centers in northern Syria, southern Coele-Syria and Cilicia . In Ptolemais, Cleopatra Thea refused to recognise Alexander II as king; already in 42 SE , the year of her husbands defeat, she struck tetradrachms in her own name as the sole monarch of Syria. Her son with Demetrius II, ": null
    },
    {
        "Seleucus V": "seleucus v philometor"
    },
    {
        ", declared himself king, but she had him assassinated. The people of Syria did not accept a woman as the sole monarch. This led Cleopatra Thea to choose her younger son by Demetrius II, Antiochus VIII, as a co-ruler in 42 SE .     According to Justin, Ptolemy VIII abandoned Alexander II after the death of Demetrius II and reconciled with Cleopatra II who went back to Egypt as a co-ruler. Justin stated that Ptolemy VIIIs reason for abandoning Alexander II was the latters increased arrogance swelled by his successes that led him to treat his benefactor with insolence. The change of Ptolemaic policy probably had less to do with Ptolemy VIIIs pride than with Alexander IIs victories; a strong neighbour in Syria was not a desired situation for Egypt. It is also probable that Cleopatra Thea negotiated an alliance with her uncle. Soon after Cleopatra IIs return, Ptolemy VIIIs daughter by Cleopatra III, ": null
    },
    {
        "Tryphaena": "tryphaena"
    },
    {
        ", was married to Antiochus VIII. An Egyptian army was sent to support the faction of Antiochus VIII against AlexanderII. The return of Cleopatra II and the marriage of Antiochus VIII both took place in 42 BC.          Supported by the Egyptian troops, Antiochus VIII waged war against Alexander II, who lost most of his lands. He lost Ashkelon in 42 SE . The final battle took place at an unknown location in the first half of 42 BC, ending with Alexander IIs defeat. Different ancient historians presented varying accounts of Alexander IIs end. Josephus merely stated that the king was defeated and killed, while Eusebius mentioned that Alexander II committed suicide with poison because he could not live with his defeat. Most details are found in the accounts of Diodorus Siculus and Justin:  aspirations for political change or their tolerance for the hardships that warfare would bring. Instead of fighting, Alexander II decided to take the royal treasuries, steal the valuables of the temples, and sail to Greece at night. While pillaging the temple of Zeus with some of his foreign subordinates, he was discovered by the populace and barely escaped with his life. Accompanied by a few men he went to Seleucia Pieria, but the news of his sacrilege arrived before him. The city closed its gates, forcing him to seek shelter in ": null
    },
    {
        "Posidium": "ras al-bassit"
    },
    {
        ". Two days after pillaging the temple, Alexander II was caught and brought in chains to Antiochus VIII in his camp, suffering the insults and humiliation at the hands of his enemies. People who witnessed the indignation of Alexander II were shocked at the scene they thought could never happen. After accepting what had occurred in front of them was reality, they looked away with astonishment. ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " , joking that victory was lent to him by Jupiter . A few days later, Alexander II himself ordered the golden statue of Jupiter to be taken out under the cover of night. The citys populace revolted against the king, and he was forced to flee. He was later deserted by his men and caught by bandits; they delivered him to Antiochus VIII, who ordered him executed.      Alexander II issued two series of gold staters. One bears his epithets and dates to 42 BC according to many numismatists, such as Oliver Hoover and Arthur Houghton, and another bearing only the title of king . Earlier numismatists, such as ": null
    },
    {
        "Edward Theodore Newell": "edward theodore newell"
    },
    {
        " and ": null
    },
    {
        "Ernest Babelon": "ernest babelon"
    },
    {
        ", who only knew about the 42 BC stater, suggested that it was minted with the gold pillaged from the temple. However, the iconography of that stater does not match that used for Alexander IIs late coinage, as the diadem ties fall in a straight fashion on the neck. On the other hand, the arrangement of the diadem ties on the stater that lacks the royal epithets is more consistent with Alexander IIs late tetradrachm, making it more reasonable to associate that stater with the Nike theft.     Though his last coins were issued in 42 SE , ancient historians do not provide the explicit date of Alexander IIs death. He probably died by October 42 BC since the first Antiochene coins of Antiochus VIII were issued in 42 SE . Damascus kept striking coinage in the name of Alexander II until 42 SE , when the forces of Antiochus VIII took it. According to Diodorus Siculus, many who witnessed the kings end remarked in various ways on the fickleness of fate, the reversals in human fortunes, the sudden turns of tide, and how changeable life could be, far beyond what anyone would expect . No wife or children of Alexander II, if he had any, are known; with his death, the line of Antiochus IV became extinct.": null
    }
]