[
    {
        "     Alexej Georgewitsch von Jawlensky  was a ": null
    },
    {
        "Russia": "russia"
    },
    {
        "n ": null
    },
    {
        "expressionist": "expressionist"
    },
    {
        " painter active in ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". He was a key member of the New Munich Artists Association , ": null
    },
    {
        "Der Blaue Reiter": "der blaue reiter"
    },
    {
        " group and later the ": null
    },
    {
        "Die Blaue Vier": "die blaue vier"
    },
    {
        " .       Alexej von Jawlensky was born in ": null
    },
    {
        "Torzhok": "torzhok"
    },
    {
        ", a town in ": null
    },
    {
        "Tver Governorate": "tver governorate"
    },
    {
        ", ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        ", as the fifth child of Georgi von Jawlensky and his wife Alexandra . At the age of ten he moved with his family to ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ". After a few years of military training, he became interested in painting, visiting the ": null
    },
    {
        "Moscow World Exposition": "moscow world exposition"
    },
    {
        " c. 42 Thanks to his good social connections, he managed to get himself posted to St. Petersburg and, from 42 to 42 studied at the art academy there, while also discharging his military duties. Jawlensky gained admittance to the circle of the renowned Russian realist painter ": null
    },
    {
        "Ilya Repin": "ilya repin"
    },
    {
        ". There he met ": null
    },
    {
        "Marianne von Werefkin": "marianne von werefkin"
    },
    {
        ", a wealthy artist and former student of Repin. He requested to be her protégé, and Werefkin decided to put her work on hold to promote his work and provide him with a comfortable lifestyle.     Jawlensky and Werefkin moved to ": null
    },
    {
        "Munich": "munich"
    },
    {
        " in 42 where he studied in the private school of ": null
    },
    {
        "Anton Ažbe": "anton ažbe"
    },
    {
        ". In 42 Jawlensky visited ": null
    },
    {
        "Ferdinand Hodler": "ferdinand hodler"
    },
    {
        ", and two years later he began his long friendship with ": null
    },
    {
        "Jan Verkade": "jan verkade"
    },
    {
        " and met ": null
    },
    {
        "Paul Sérusier": "paul sérusier"
    },
    {
        ". Together, Verkade and Sérusier transmitted to Jawlensky both practical and theoretical elements of the work of the ": null
    },
    {
        "Nabis": "les nabis"
    },
    {
        ", and ": null
    },
    {
        "Synthetist": "synthetism"
    },
    {
        " principles of art.     In Munich he met ": null
    },
    {
        "Wassily Kandinsky": "wassily kandinsky"
    },
    {
        " and various other Russian artists, and he contributed to the formation of the ": null
    },
    {
        "Neue Künstlervereinigung München": "neue künstlervereinigung münchen"
    },
    {
        ". His work in this period was lush and richly coloured, but later moved towards abstraction and a simplified, formulaic style. Between 42 and 42 Jawlensky and Werefkin spent summers in the Bavarian Alps with Kandinsky and his companion, the painter ": null
    },
    {
        "Gabriele Münter": "gabriele münter"
    },
    {
        ". Here, through painting landscapes of their mountainous surroundings, they experimented with one anothers techniques and discussed the theoretical bases of their art. Following a trip to the Baltic coast, and renewed contact with ": null
    },
    {
        "Henri Matisse": "henri matisse"
    },
    {
        " in 42 and ": null
    },
    {
        "Emil Nolde": "emil nolde"
    },
    {
        " in 42 Jawlensky turned increasingly to the expressive use of colour and form alone in his portraits.        Expelled from Germany in 42 he moved to Switzerland. He met ": null
    },
    {
        "Emmy Scheyer": "galka scheyer"
    },
    {
        " in 42 , another artist who abandoned her own work to champion his in the United States. After a hiatus in experimentation with the human form, Jawlensky produced perhaps his best-known series, the Mystical Heads , and the Saviour’s Faces , which are reminiscent of the traditional Russian Orthodox icons of his childhood.     In 42 Jawlensky married Werefkins former maid Hélène Nesnakomoff, the mother of his only son, ": null
    },
    {
        "Andreas": "andreas jawlensky"
    },
    {
        ", who born before their marriage. Alexej von Jawlensky took up residence in ": null
    },
    {
        "Wiesbaden": "wiesbaden"
    },
    {
        " and organized In 42 he the Blue Four, whose works, thanks to Scheyers tireless promotion, were jointly exhibited in Germany and the USA. From 42 Jawlensky suffered from progressively crippling ": null
    },
    {
        "arthritis": "arthritis"
    },
    {
        ", which necessitated a reduced scale and finally forced a cessation in his painting in 42 He began to dictate his memoirs in 42 He died in ": null
    },
    {
        "Wiesbaden": "wiesbaden"
    },
    {
        ", Germany, on 42 March 42 He and his wife Helene are buried in the cemetery of ": null
    },
    {
        "St. Elizabeths Church, Wiesbaden": "st. elizabeths church, wiesbaden"
    },
    {
        ".       In November 42 his  Schokko   sold for US$42,42 and in February 42 for GB£42,42 .     The 42 album by the jazz group ": null
    },
    {
        "Acoustic Ladyland": "acoustic ladyland"
    },
    {
        ", Skinny Grin, features one of his works, Portrait of The Dancer Alexander Sacharoff, as its cover art.     The six CDs issued by CPO with the complete string quartets by the Polish composer ": null
    },
    {
        "Mieczysław Weinberg": "mieczysław weinberg"
    },
    {
        " , and played by the , all have a female portrait by von Jawlensky on their cover. Volume 42 shows Frauenbildnis . Volume 42 has Kind mit blauen Augen . Volume 42 has Weiblicher Kopf . Volume 42 has Mädchen mit Haube . Volume 42 has Spanierin . And volume 42 shows Kopf .       In remembrance of the artist, in 42 the Jawlensky Award has been coined. Every five years it is being awarded to contemporary artists by the capital of the federal state of Hesse ": null
    },
    {
        "Wiesbaden": "wiesbaden"
    },
    {
        ", the ": null
    },
    {
        "Spielbank Wiesbaden": "weisbadenmodern era"
    },
    {
        " and the ": null
    },
    {
        "Nassauische Sparkasse": "nassauische sparkasse"
    },
    {
        ". The award is accompanied by a cash prize, an exhibition at the Museum Wiesbaden and the purchase of a work.       Paintings by von Jawlensky are displayed in galleries and museums around the world. The ": null
    },
    {
        "Museum Ostwall": "museum ostwall"
    },
    {
        " in ": null
    },
    {
        "Dortmund": "dortmund"
    },
    {
        ", Germany, maintains a collection of exceptional depth. The largest collection of works by von Jawlensky is kept at the ": null
    },
    {
        "Museum Wiesbaden": "museum wiesbaden"
    },
    {
        ", which owns more than 42 works of the artist, and forms the most important collection of his work in Europe.         Alexej Jawlensky - Schokko with Red Hat .jpg|Schokko with Red Hat, 42   Jawlensky Sakharoff.jpg|Portrait of Alexander Sakharoff  Schokko with Wide Brimmed Hat, 42   Alexej von Jawlensky - Der violette Turban.jpg|Violet Turban Self-Portrait, 42   Alexej von Jawlensky - Kopf in Blau.jpg|Head in Blue Variation, 42   Alexej von Jawlensky - Heilandsgesicht, Märtyrer.jpg|Saviors Face: Martyr Astonishment, 42 ": null
    },
    {
        "Norton Simon Museum": "norton simon museum"
    },
    {
        ", ": null
    },
    {
        "Pasadena, California": "pasadena, california"
    },
    {
        "  Medusa ": null
    }
]