[
    {
        "             Alfonso II of ": null
    },
    {
        "Asturias": "kingdom of asturias"
    },
    {
        " , nicknamed the Chaste , was the ": null
    },
    {
        "king of Asturias": "king of asturias"
    },
    {
        " during two different periods: first in the year 783 and later from 791 until his death in 842. Upon his death, Nepociano, a family member of undetermined relation, attempted to usurp the crown in place of the future Ramiro I.     During his reign, which covered a span of 51 years, Alfonso discovered the supposed tomb of ": null
    },
    {
        "apostle Santiago": "james, son of zebedee"
    },
    {
        " in the town of Compostela, which later became known as the city of ": null
    },
    {
        "Santiago de Compostela": "santiago de compostela"
    },
    {
        ". He was the son of ": null
    },
    {
        "Fruela I": "fruela i of asturias"
    },
    {
        " and Munia, a ": null
    },
    {
        "Basque": "basque people"
    },
    {
        " woman captured and brought back to Asturias by the former following a military campaign.       He was born in ": null
    },
    {
        "Oviedo": "oviedo"
    },
    {
        " in 759 or 760. He was put under the guardianship of his aunt ": null
    },
    {
        "Adosinda": "adosinda"
    },
    {
        " after his fathers death, but one tradition relates his being put in the monastery of ": null
    },
    {
        "Samos": "samos"
    },
    {
        ". He was the governor of the palace during the reign of Adosindas husband ": null
    },
    {
        "Silo": "silo of asturias"
    },
    {
        ". On Silos death, he was elected king by Adosindas allies, but the magnates raised his uncle ": null
    },
    {
        "Mauregatus": "mauregatus of asturias"
    },
    {
        " to the throne instead. Alfonso fled to ": null
    },
    {
        "Álava": "álava"
    },
    {
        " where he found shelter with his maternal relatives. Mauregatus was succeeded by ": null
    },
    {
        "Bermudo": "bermudo i of asturias"
    },
    {
        ", Alfonsos cousin, who abdicated after his defeat at the ": null
    },
    {
        "Battle of the Burbia River": "battle of the burbia river"
    },
    {
        ".       Alfonso was subsequently elected king on September 14, 791. Poets of a later generation invented the story of the secret marriage between his sister Ximena and Sancho, count of Saldana, and the feats of their son ": null
    },
    {
        "Bernardo del Carpio": "bernardo del carpio"
    },
    {
        ". Bernardo is the hero of a  cantar de gesta   written to please the anarchical spirit of the nobles.        On accession to the throne, ": null
    },
    {
        "Hisham I": "hisham i of córdoba"
    },
    {
        ", son of ": null
    },
    {
        "Abd al-Rahman I": "abd al-rahman i"
    },
    {
        ", commenced a string of military campaigns in the eastern Pyrenees and to the north-west. In 794, a raid spearheaded by Abd al-Karim dealt a major military blow to Alfonso II on the eastern fringes of the Kingdom of Asturias . The Asturian king asked for the assistance of the ": null
    },
    {
        "Basque": "basque people"
    },
    {
        " Frankish": "franks"
    },
    {
        " vassal Belasco, master of ": null
    },
    {
        "Álava": "álava"
    },
    {
        " and bordering regions at the time. Abd al-Karim advanced deeper west into Asturias and pillaged the region, while his brother Abd al-Malik ventured into the western Asturian lands.       Confronted with heavy fire, Alfonso II reached out to ": null
    },
    {
        "Charlemagnes": "charlemagne"
    },
    {
        "Franks. He sent delegations to ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        " and ": null
    },
    {
        "Aix-la-Chapelle": "aix-la-chapelle"
    },
    {
        " in 796, 797, and 798. These diplomacy efforts may have aimed to strengthen his legitimacy and the government structures of Asturias against ongoing internal unrest——troubles in Galicia——and external attacks of the Ibn Mugait brothers, i.e. generals Abd al-Karim and Abd al-Malik.     Alfonso was acknowledged as a king by Charlemagne and the ": null
    },
    {
        "Pope": "pope"
    },
    {
        ", and Asturias as a kingdom for the first time. The king showed an interest in the Frankish cult of Saint ": null
    },
    {
        "Martin of Tours": "martin of tours"
    },
    {
        ", and most notably he encouraged ": null
    },
    {
        "Carolingian": "carolingian dynasty"
    },
    {
        " Church influence into Asturias. Also during Alfonsos reign was the alleged resting-place of St. James revealed. Alfonsos envoys to Charlemagnes courts may have also dealt with the ": null
    },
    {
        "adoptionist controversy": "spanish adoptionism"
    },
    {
        ", which had brought Bermudos kingdom into Charlemagnes view. It seems that Carolingian support did much to spur his military raid into Andalusian territory up to ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ". The Andalusian city in turn was captured and sacked by his troops in 798.       In 825 he defeated Cordovan forces at ": null
    },
    {
        "Narón": "narón"
    },
    {
        " and ": null
    },
    {
        "Anceo": "anceo"
    },
    {
        " and, thanks to these victories, the repopulation of parts of ": null
    },
    {
        "Galicia": "gallaecia"
    },
    {
        ", ": null
    },
    {
        "León": "león"
    },
    {
        ", and ": null
    },
    {
        "Castile": "castile"
    },
    {
        " was started—charter granting that confirmed the possession of the territories.     Alfonso also moved the capital from ": null
    },
    {
        "Pravia": "pravia"
    },
    {
        ", where Silo had located it, to ": null
    },
    {
        "Oviedo": "oviedo"
    },
    {
        ", the city of his fathers founding and his birth. There he constructed churches and a palace. He built ": null
    },
    {
        "San Tirso": "san tirso, oviedo"
    },
    {
        ", where he is buried, and ": null
    },
    {
        "Santullano": "san julián de los prados"
    },
    {
        ", on the outskirts. The Crónica Sebastianense records his death in 842, saying:     :tras haber llevado por 52 años casta, sobria, inmaculada, piadosa y gloriosamente el gobierno del reino     :     Tradition relates that in 814, the body of ": null
    },
    {
        "Saint James the Greater": "saint james the greater"
    },
    {
        " was discovered in ": null
    },
    {
        "Compostela": "santiago de compostela"
    },
    {
        " and that Alfonso was the first ": null
    },
    {
        "pilgrim": "christian pilgrimage"
    }
]