[
    {
        "Alredus, or Alfred of Beverley, , ": null
    },
    {
        "English chronicler": "english historians in the middle ages"
    },
    {
        ", was ": null
    },
    {
        "sacristan": "sacristan"
    },
    {
        " of the church of ": null
    },
    {
        "Beverley": "beverley"
    },
    {
        " in the first half of the twelfth century.     He wrote, apparently about the year 1143, a ": null
    },
    {
        "chronicle": "chronicle"
    },
    {
        " entitled Annales sive Historia de gestis regum Britanniae, which begins with ": null
    },
    {
        "Brutus": "brutus of britain"
    },
    {
        " and carries the history of England down to 1129. ": null
    },
    {
        "Geoffrey of Monmouth": "geoffrey of monmouth"
    },
    {
        " and ": null
    },
    {
        "Simeon of Durham": "simeon of durham"
    },
    {
        " are Alfreds chief sources.       Alfred of Beverley, was a priest of Beverley, and is described in the preface to his book as treasurer of the church of Beverley and Master Alfred, sacrist of the church of Beverley .     Alfred of Beverley speaks of himself as contemporary with the removal of the Flemings from the north of England to Ross in Herefordshire in 1112, and writes that he compiled his chronicle when the church was silent, owing to the number of persons excommunicated under the decree of the council of London , an apparent reference to the council held at Mid-Lent, 1143. His attention, by his own account, was first drawn to history by the publication of ": null
    },
    {
        "Geoffrey of Monmouths": "geoffrey of monmouth"
    },
    {
        " Historia Regum Britanniae": "historia regum britanniae"
    },
    {
        ", and he looked forward to following up the chronicle which bears his name, and which largely depends on Geoffreys work, with a collection of excerpts from the credible portions of the ": null
    },
    {
        "Historia Regum Britanniae": "historia regum britanniae"
    },
    {
        ", but no trace of such a work is extant.     Alfred of Beverleys chronicle is entitled Aluredi Beverlacensis Annales sive Historia de gestis Regum Britanniæ libris ix. ad annum 1129. It is largely devoted to the fabulous history of Britain, and is mainly borrowed from ": null
    },
    {
        "Bede": "venerable bede"
    },
    {
        ", ": null
    },
    {
        "Henry of Huntingdon": "henry of huntingdon"
    },
    {
        ", and ": null
    },
    {
        "Symeon of Durham": "symeon of durham"
    },
    {
        ", when Geoffrey of Monmouth is not laid under contribution. Alfred quotes occasionally from ": null
    },
    {
        "Suetonius": "suetonius"
    },
    {
        ", ": null
    },
    {
        "Orosius": "orosius"
    },
    {
        ", and ": null
    },
    {
        "Nennius": "nennius"
    },
    {
        ", and names many Roman authors whom he had consulted in vain for references to Britain. The chronicle is of no real use to the historical student, since it adds no new fact to the information to be found in well-known earlier authorities.     According to Sidney Lee the best manuscript of Alfreds Annales was among the Hengwrt MSS. belonging to W. W. E. Wynne, Esq., of Peniarth, Merionethshire, and had not been printed. Hearne printed the ‘Annales’ in 1716 from an inferior Bodleian MS. .        ": null
    }
]