[
    {
        "Algorithms for calculating variance play a major role in ": null
    },
    {
        "computational statistics": "computational statistics"
    },
    {
        ". A key difficulty in the design of good ": null
    },
    {
        "algorithms": "algorithm"
    },
    {
        "for this problem is that formulas for the ": null
    },
    {
        "variance": "variance"
    },
    {
        " may involve sums of squares, which can lead to ": null
    },
    {
        "numerical instability": "numerical instability"
    },
    {
        " as well as to ": null
    },
    {
        "arithmetic overflow": "arithmetic overflow"
    },
    {
        " when dealing with large values.       A formula for calculating the variance of an entire ": null
    },
    {
        "population": "statistical population"
    },
    {
        " of size N is:     : \\sigma^2 \\overline - \\bar x^2 \\displaystyle\\frac . \\!     Using ": null
    },
    {
        "Bessels correction": "bessels correction"
    },
    {
        " to calculate an ": null
    },
    {
        "unbiased": "estimator bias"
    },
    {
        " estimate of the population variance from a finite ": null
    },
    {
        "sample": "statistical sample"
    },
    {
        " of n observations, the formula is:     : s^2 \\left \\cdot \\frac . \\!     Therefore, a naive algorithm to calculate the estimated variance is given by the following:         :                This algorithm can easily be adapted to compute the variance of a finite population: simply divide by N instead of n  −  1 on the last line.     Because  and  can be very similar numbers, ": null
    },
    {
        "cancellation": "loss of significance"
    },
    {
        " can lead to the ": null
    },
    {
        "precision": "precision"
    },
    {
        " of the result to be much less than the inherent precision of the ": null
    },
    {
        "floating-point arithmetic": "floating-point arithmetic"
    },
    {
        " used to perform the computation. Thus this algorithm should not be used in practice,   and several alternate, numerically stable, algorithms have been proposed.  This is particularly bad if the standard deviation is small relative to the mean. However, the algorithm can be improved by adopting the method of the ": null
    },
    {
        "assumed mean": "assumed mean"
    },
    {
        ".         The variance is ": null
    },
    {
        "invariant": "invariant"
    },
    {
        " with respect to changes in a ": null
    },
    {
        "location parameter": "location parameter"
    },
    {
        ", a property which can be used to avoid the catastrophic cancellation in this formula.     : \\operatorname\\operatorname.     with K any constant, which leads to the new formula     : s^2 \\displaystyle\\frac . \\!     the closer K is to the mean value the more accurate the result will be, but just choosing a value inside the   samples range will guarantee the desired stability. If the values are small then there are no problems with the sum of its squares, on the contrary, if they are large it necessarily means that the variance is large as well. In any case the second term in the formula is always smaller than the first one therefore no cancellation may occur.     If just the first sample is taken as K the algorithm can be written in ": null
    },
    {
        "Python programming language": "python"
    },
    {
        " as        def shifted_data_variance:   if len ": null
    }
]