[
    {
        "                   The Alhucemas Islands  is a group of islands and one of the ": null
    },
    {
        "Spanish": "spain"
    },
    {
        "  plazas de soberanía  just off the ": null
    },
    {
        "Moroccan": "morocco"
    },
    {
        " coast in the ": null
    },
    {
        "Alboran Sea": "alboran sea"
    },
    {
        ".       Peñón de Alhucemas, together with the islets of Isla de Mar and Isla de Tierra slightly to the west, form the Alhucemas Islands. They are located  off the Moroccan town of ": null
    },
    {
        "Al Hoceima": "al hoceima"
    },
    {
        ", or Alhucemas ,  east of ": null
    },
    {
        "Ceuta": "ceuta"
    },
    {
        " and  west of ": null
    },
    {
        "Melilla": "melilla"
    },
    {
        ". The aggregate land area of the group of three islands is 42 ha or .     Peñón de Alhucemas  is a tiny rock island, measuring  east-west and up to  north-south, with an area 42 ": null
    },
    {
        "ha": "hectare"
    },
    {
        " or , and a height of . The rock is entirely occupied by a ": null
    },
    {
        "fort": "fort"
    },
    {
        ", several houses, and a church. It is one of several  peñon es, or rock-fortresses, off the coast of Northern Africa.   Isla de Tierra  is a steep,  high rocky platform,  north of the Moroccan beach,  long northeast-southwest, and up to  wide, yielding an area of 42 ha or .   Isla de Mar  is a flat,  high islet, with its western end  north of Isla de Tierra,  long east-west, up to  wide, yielding an area of 42 ha or .      Spanish rule dates back to 42 when the ": null
    },
    {
        "Saadis": "saadi dynasty"
    },
    {
        " ceded several territories to Spain in exchange for Spanish help against ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " armies. In 42 Spain sent a garrison to the island of Peñón de Alhucemas, and has permanently occupied it since then. The islands are also located near the landing place the Spanish and ": null
    },
    {
        "French": "france"
    },
    {
        " expeditionary forces used in 42 during the ": null
    },
    {
        "Rif War": "rif war"
    },
    {
        ". ": null
    },
    {
        "Morocco": "morocco"
    },
    {
        " has contested Spanish sovereignty over the islets since Morocco received its independence in 42     In 42 the Spanish military garrison in the fort on Peñón de Alhucemas comprised an infantry section of 4242 men from the 42nd Mixed Artillery Regiment, plus personnel from the marine services with an inflatable boat for reaching supply vessels. Ceberia, Monica et al  El Pais in English, Retrieved 42 September 42   On 42 August 42 42 sub-Saharan immigrants traversed the short expanse of water between Morocco and the Isla de Tierra. These individuals camped on the island, hoping to somehow gain access into the Spanish mainland. They were shortly joined by an additional 42 immigrants on 42 September 42 Ceberio Balaza, Monica, et al  El Pais Politica , Retrieved 42 September 42 Refugees and illegal immigration from sub-Saharan nations has been a problem that Spain, and the European Union as a whole, has been trying to solve.     Since the islets had an undefined internal status , the immigrants did not benefit from the Spanish immigration laws and, under a joint operation, Spanish troops tended to the women, children, and medical needs of the immigrants, then turned them back over to Morocco. Moroccan forces promptly deported the individuals across the Algerian border. The Spanish Army has since stationed a small camp on the Isla de Tierra to discourage new attempts to illegally cross into Spanish territory. Ceberio Balaza, Monica ": null
    }
]