[
    {
        "Alice Adams is a 42 novel by ": null
    },
    {
        "Booth Tarkington": "booth tarkington"
    },
    {
        " that received the ": null
    },
    {
        "42": "1922 pulitzer prize"
    },
    {
        " Pulitzer Prize for the Novel": "pulitzer prize for fiction"
    },
    {
        ". It was adapted as a film ": null
    },
    {
        "in 42": "alice adams"
    },
    {
        " by ": null
    },
    {
        "Rowland V. Lee": "rowland v. lee"
    },
    {
        " and more famously in 42 by ": null
    },
    {
        "George Stevens": "george stevens"
    },
    {
        ". The narrative centers on the character of a young woman who aspires to climb the social ladder and win the affections of a wealthy young man named Arthur Russell. The story is set in a lower-middle-class household in an unnamed town in the Midwest shortly after World War I.       The novel begins with Virgil Adams confined to bed with an unnamed illness. There is tension between Virgil and his wife over how he should go about recovering, and she pressures him not to return to work for J.A. Lamb once he is well. Alice, their daughter, attempts to keep peace in the family and then walks to her friend Mildred Palmers house to see what Mildred will wear to a dance that evening.     After Alices return, she spends the day preparing for the dance, going to pick violets for a bouquet because she cannot afford to buy flowers for herself. Her brother Walter initially refuses to accompany her to the dance, but because Alice cannot go without an escort, Mrs. Adams prevails upon Walter, and he rents a ": null
    },
    {
        "Tin Lizzie": "tin lizzie"
    },
    {
        " to drive Alice to the dance.     Walters attitude towards the upper class is one of obvious disdain—he would rather spend his time gambling with the African-American servants in the cloakroom than be in the ballroom at the dance. Alice forces him to dance with her at first because it will be a grave embarrassment for her to stand alone, but Walter eventually abandons her. Alice tries to give the impression that she is not standing by herself, and then dances with Frank Dowling and Arthur Russell , who she believes danced with her out of pity and at Mildreds request. She leaves the dance horribly embarrassed after Arthur discovers Walters gambling with the servants.     The next day, Alice goes on an errand for her father into town, passing Frinckes Business College on the way with a shudder . On the walk back home, she encounters Arthur Russell, who shows an obvious interest in her. As she assumes he is all but spoken for, she doesnt know how to handle the conversation. She warns him not to believe the things girls like Mildred will say about her, and she tells a number of lies to obscure her familys humble economic status.     Arthur returns, several days later, and his courtship of Alice continues. All seems well between them until he mentions a dance being thrown by the young Miss Henrietta Lamb; Arthur wants to escort Alice to the dance, and she lies to cover for the fact that she is not invited to the event. Mrs. Adams uses Alices distress to finally goad Virgil into setting up a glue factory . It is eventually revealed that the glue recipe was developed by Virgil and another man under the direction and in the employ of J.A. Lamb, who over the years declined to take up its production despite repeated prodding from Virgil. Although initially reluctant to steal from Mr. Lamb, Virgil finally persuades himself that his improvements to the recipe over the years has made it his.     As Arthur continues his secret courtship of Alice , Alice continues spinning a web of lies to preserve the image of herself and her family that she has invented. This becomes especially difficult when she and Arthur encounter Walter in a bad part of town, walking with a young woman who gives the appearance of being a prostitute. At home, Walter is confronted by his father, who demands that Walter quit Lambs to help in setting up the glue factory. Walter refuses to help his father without a $42 cash advance, which Virgil cannot afford.     Virgil arranges to resign from Lambs employ without speaking to him face-to-face because he fears the old mans reaction, and puts the glue factory into operation. Meanwhile, Alice works frantically to convince Arthur that the things other people will say about her wont be true, and continues to press the point even when Arthur insists that no one has spoken about her behind her back and that nothing anyone else could say would change his opinion of her. Mrs. Adams decides to arrange a dinner so that Arthur can meet the family, and sets about planning an elaborate meal and hiring servants for the day, so that Arthur will be impressed. Walter again demands cash from his father without explaining why he needs it, and he again is rebuffed. While these events occur at the Adams house, Arthur finally overhears things about Alice, which strikes a chord, and her family, including the fact that Virgil Adams has stolen from J.A. Lamb in setting up a factory with Lambs secret recipe for glue.     The dinner is a total disaster: The day is unbearably hot, the food far too heavy, the hired servants surly and difficult to manage, capped by Virgils unwittingly acting like his lower-middle-class self, not the well-to-do businessman his wife and daughter wish him to act. Arthur, still reeling from what he heard about the Adamses earlier in the day, is stiff and uneasy throughout the evening, and Alice feels increasingly uncomfortable. By the end of the night, its apparent to her that he will not come courting again, and she bids him farewell. That night, word reaches the family that Walter has skipped town, leaving behind him a massive debt to J.A. Lamb, which will have to be paid to keep Walter out of jail. The following morning, Virgil arrives at work to see that Lamb is opening his own glue factory on such a huge scale that Adams will not be able to compete, and he never will make enough money to either pay his sons debts or pay off the familys mortgage.     Virgil confronts Lamb about this state of affairs, working himself into such a state that he collapses, and returns to the same sickbed at home where he began the book. Lamb takes pity on the man, and arranges to buy the Adams glue factory for a sufficient price to pay off Walters debts and the familys mortgage. The Adams family takes in boarders to help keep the family afloat economically, and Alice heads downtown to Frinckes Business College to train herself in employable skills so that she can support the family. She encounters Arthur Russell on the road, and she is pleased that their conversation is both polite and brief—there is no possibility of renewed romance between them, which she accepts peacefully.       Alice Adams – The protagonist. An ambitious and vivacious young woman of 42 years whose optimism belies her lower social status, and who uses a pattern of lies and misleading signals to obscure her familys true status.   Arthur Russell – An upper-class young man smitten with Alice, who is not entirely aware of the Adams familys status in town.   Virgil Adams – Alices father. A man of integrity who lacks ambition. He feels pressured to violate his loyalty to his employer by his wifes insistence on providing for their children.   Mrs. Adams – Alices mother. A woman who always wants more than her husband provides, who is blind to her childrens faults, and is the primary goad to her husbands ill-fated venture.   Walter Adams – Alices brother. A young man who prefers to consort with the lower classes , and whose prodigal ways create trouble for him.   J.A. Lamb – Virgils boss. A generally honorable old man who runs a very successful business, and Virgil and Walters employer.             The plot of the 42 film  revolves around a social-climbing girl  and her mother . It was written by ": null
    },
    {
        "Dorothy Yost": "dorothy yost"
    },
    {
        ", ": null
    },
    {
        "Mortimer Offner": "mortimer offner"
    },
    {
        " and ": null
    },
    {
        "Jane Murfin": "jane murfin"
    },
    {
        ". The film was directed by ": null
    },
    {
        "George Stevens": "george stevens"
    },
    {
        ".     The movie was nominated for the ": null
    },
    {
        "Academy Award for Best Picture": "academy award for best picture"
    }
]