[
    {
        "           Ally McBeal is an American ": null
    },
    {
        "legal": "Legal Drama"
    },
    {
        " comedy-drama": "Comedy-Drama"
    },
    {
        " television series": "Television Series"
    },
    {
        ", originally aired on ": null
    },
    {
        "Fox": "Fox Broadcasting Company"
    },
    {
        " from September 8, 1997, to May 20, 2002. Created by ": null
    },
    {
        "David E. Kelley": "David E. Kelley"
    },
    {
        ", the series stars ": null
    },
    {
        "Calista Flockhart": "Calista Flockhart"
    },
    {
        " in the ": null
    },
    {
        "title role": "Ally Mcbeal"
    },
    {
        " as a lawyer working in the fictional ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " law firm": "List Of Fictional Law Firms"
    },
    {
        " Cage and Fish, with other lawyers whose lives and loves were eccentric, humorous, and dramatic. The series received critical acclaim in its early seasons, winning the ": null
    },
    {
        "Golden Globe Award for Best Television Series  – Musical or Comedy": "Golden Globe Award For Best Television Series & Nbsp;– Musical Or Comedy"
    },
    {
        " in 1997 and 1998, and also winning the ": null
    },
    {
        "Emmy Award for Outstanding Comedy Series": "Primetime Emmy Award For Outstanding Comedy Series"
    },
    {
        " in 1999.       The series, set in the fictional ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " law firm": "List Of Fictional Law Firms"
    },
    {
        " Cage and Fish, begins with main character ": null
    },
    {
        "Allison Marie Ally McBeal": "Ally Mcbeal"
    },
    {
        " joining the firm co-owned by her law school classmate Richard Fish  after leaving her previous job due to sexual harassment. On her first day, Ally is horrified to find that she will be working alongside her ex-boyfriend Billy Thomas  & mdash;whom she has never gotten over. To make things worse, Billy is now married to fellow lawyer Georgia , who later joins Cage and Fish. The triangle among the three forms the basis for the main plot for the shows first three seasons.     Although ostensibly a legal drama, the main focus of the series was the romantic and personal lives of the main characters, often using legal proceedings as ": null
    },
    {
        "plot devices": "Plot Device"
    },
    {
        "to contrast or reinforce a characters drama. For example, bitter divorce litigation of a client might provide a backdrop for Allys decision to break up with a boyfriend. Legal arguments were also frequently used to explore multiple sides of various social issues.     Cage and Fish , the fictional law firm where most of the characters work, is depicted as a highly sexualized environment symbolized by its unisex restroom. Lawyers and secretaries in the firm routinely date, flirt with, or have a romantic history with each other and frequently run into former or potential romantic interests in the courtroom or on the street outside.     The series had many offbeat and frequently surreal running gags and themes, such as Allys tendency to immediately fall over whenever she met somebody she found attractive, Richard Fishs ": null
    },
    {
        "wattle": "Wattle"
    },
    {
        " fetish and humorous mottos , Johns gymnastic dismounts out of the offices unisex bathroom stalls, or the dancing twins at the bar, that ran through the series. The show also used vivid, dramatic ": null
    },
    {
        "fantasy": "Fantasy"
    },
    {
        " sequences for Allys and other characters wishful thinking; of particular note is the early internet sensation the ": null
    },
    {
        "dancing baby": "Dancing Baby"
    },
    {
        ".     The series also featured regular visits to a local bar where singer ": null
    },
    {
        "Vonda Shepard": "Vonda Shepard"
    },
    {
        " regularly performed . Star contemporary singers also performed in the bar at the end of the shows, including acts such as ": null
    },
    {
        "Barry White": "Barry White"
    },
    {
        " and ": null
    },
    {
        "Anastacia": "Anastacia"
    },
    {
        ". The series also took place in the same ": null
    },
    {
        "continuity": "Continuity"
    },
    {
        " as David E. Kelleys legal drama  The Practice  , as the two shows crossed over with one another on occasion, a very rare occurrence for two shows that aired on different networks.     Ultimately, in the last installment of the fifth and final season, Bygones , Ally decided to resign from Cage & Fish, leave Boston, and return to New York City.       Fox canceled Ally McBeal after five seasons. In addition to being the lowest-rated season of Ally McBeal and the grounds for the shows cancelation, the fifth season was also the only season of the show that failed to win any Emmy or Golden Globe awards.                            In Australia, Ally McBeal was aired by the ": null
    },
    {
        "Seven Network": "Seven Network"
    },
    {
        " from 1997 to 2002. In 2010, it was aired repeatedly by ": null
    },
    {
        "Network 10": "Network 10"
    },
    {
        ".     The Practice   Seymore Walsh, a stern judge often exasperated by the eccentricities of the Cage & Fish lawyers and played by actor Albert Hall, was also a recurring character on The Practice. In addition, Judge Jennifer Cone appears on The Practice episode Line of Duty , while Judge Roberta Kittelson, a recurring character on The Practice, has a featured guest role in the Ally McBeal episode Do you Wanna Dance?     Most of the primary Practice cast members guest starred in the Ally McBeal episode The Inmates , in a storyline that concluded with the Practice episode Axe Murderer , featuring Calista Flockhart and Gil Bellows reprising their Ally characters. What is unusual about this continuing storyline is that Ally McBeal and The Practice aired on different networks. Bobby Donnell, the main character of The Practice played by ": null
    },
    {
        "Dylan McDermott": "Dylan Mcdermott"
    },
    {
        ", was featured heavily in both this crossover and another Ally McBeal episode, These are the Days .     Regular Practice cast members ": null
    },
    {
        "Lara Flynn Boyle": "Lara Flynn Boyle"
    },
    {
        " and ": null
    },
    {
        "Michael Badalucco": "Michael Badalucco"
    },
    {
        " each had a cameo in Ally McBeal but it is unclear whether they were playing the same characters they play on The Practice.         Upon premiering in 1997, the show was an instant hit, averaging around 11 million viewers per episode. The shows second season saw an increase in ratings and soon became a top 20 show, averaging around 13 million viewers per episode. The shows ratings began to decline in the third season, but stabilized in the fourth season after ": null
    },
    {
        "Robert Downey Jr.": "Robert Downey Jr."
    },
    {
        " joined the regular cast as Allys boyfriend Larry Paul, and a fresher aesthetic was created by new art director Matthew DeCoste. However, Downeys character was written out after the end of the season due to the actors troubles with drug addiction.      The first two seasons, as well as the fourth, remain the most critically acclaimed and saw the most awards success at the Emmys, SAG Awards and the Golden Globes. In 2007, Ally McBeal placed 48 on  Entertainment Weekly  2007 New TV Classics list.               Ally McBeal received some criticism from TV critics and feminists who found the title character annoying and demeaning to women  because of her perceived flightiness, lack of demonstrated legal knowledge, short skirts,  and emotional instability. Perhaps the most notorious example of the debate sparked by the show was the June 29, 1998, cover story of Time magazine, which juxtaposed McBeal with three pioneering feminists  and asked Is Feminism Dead?  In episode 12 of the second season of the show, Ally talks to her co-worker John Cage about a dream she had, saying You know, I had a dream that they put my face on the cover of Time magazine as the face of feminism.             Ally McBeal was a heavily music-oriented show. ": null
    },
    {
        "Vonda Shepard": "Vonda Shepard"
    },
    {
        ", a virtually unknown musician at the time, was featured continually on the show. Her song Searchin My Soul became the shows theme song. Many of the songs Shepard performed were established hits with lyrics that paralleled the events of the episode, including ": null
    },
    {
        "Both Sides Now": "Both Sides Now"
    },
    {
        " , ": null
    },
    {
        "Hooked on a Feeling": "Hooked On A Feeling"
    },
    {
        " and ": null
    },
    {
        "Tell Him": "Tell Him"
    },
    {
        " . Besides recording background music for the show, Shepard frequently appeared at the ends of episodes as a musician performing at a local ": null
    },
    {
        "piano bar": "Piano Bar"
    },
    {
        " frequented by the main characters. On rare occasions, her character would have conventional dialogue. A portion of Searchin My Soul was played at the beginning of each episode, but the song was never played in its entirety.     Several of the characters had a musical ": null
    },
    {
        "leitmotif": "Leitmotif"
    },
    {
        " that played when they appeared. John Cages was ": null
    },
    {
        "Youre the First, the Last, My Everything": "Youre The First, The Last, My Everything"
    },
    {
        " , Ling Woos was the ": null
    },
    {
        "Wicked Witch of the West": "Wicked Witch Of The West"
    },
    {
        " theme from  The Wizard of Oz , and Ally McBeal herself picked ": null
    },
    {
        "Tell Him": "Tell Him"
    },
    {
        " , when told by a psychiatrist that she needed a theme.     Due to the popularity of the show and Shepards music, a soundtrack titled  Songs from Ally McBeal  was released in 1998, as well as a successor soundtrack titled  Heart and Soul: New Songs from Ally McBeal  in 1999. Two compilation albums from the show featuring Shepard were also released in 2000 and 2001. A Christmas album was also released under the title Ally McBeal: A Very Ally Christmas.  The album received positive reviews, and Shephards version of ": null
    },
    {
        "Kay Starrs": "Kay Starr"
    },
    {
        "Christmas song ": null
    },
    {
        " The Man with the Bag": "The Man With The Bag"
    },
    {
        " , received considerable airplay during the holiday season. Atkinson, Terry TV Shows Breed Christmas Albums The Post-Tribune , page D-5.     Other artists featured on the show include ": null
    },
    {
        "Michael Jackson": "Michael Jackson"
    },
    {
        ", ": null
    },
    {
        "Barry White": "Barry White"
    },
    {
        ", ": null
    },
    {
        "Al Green": "Al Green"
    },
    {
        ", ": null
    },
    {
        "Tina Turner": "Tina Turner"
    },
    {
        ", ": null
    },
    {
        "Macy Gray": "Macy Gray"
    },
    {
        ", ": null
    },
    {
        "Gloria Gaynor": "Gloria Gaynor"
    },
    {
        ", ": null
    },
    {
        "Chayanne": "Chayanne"
    },
    {
        ", ": null
    },
    {
        "Barry Manilow": "Barry Manilow"
    },
    {
        ", ": null
    },
    {
        "Anastacia": "Anastacia"
    },
    {
        ", ": null
    },
    {
        "Elton John": "Elton John"
    },
    {
        ", ": null
    },
    {
        "Sting": "Sting"
    },
    {
        " and ": null
    },
    {
        "Mariah Carey": "Mariah Carey"
    },
    {
        ". ": null
    },
    {
        "Josh Groban": "Josh Groban"
    },
    {
        " played the role of Malcolm Wyatt in the May 2001 season finale, performing Youre Still You . The series creator, David E. Kelley, was impressed with Grobans performance at The Family Celebration event and based on the audience reaction to Grobans singing, Kelley created a character for him in that finale. The background score for the show was composed by ": null
    },
    {
        "Danny Lux": "Danny Lux"
    },
    {
        ".            Due to ": null
    },
    {
        "music licensing": "Music Licensing"
    },
    {
        " issues, none of the seasons of Ally McBeal were available on ": null
    },
    {
        "DVD": "Dvd-Video"
    },
    {
        " in the United States until 2009, though the show had been available in Italy, Belgium, the Netherlands, Japan, Hong Kong, Portugal, Spain, France, Germany, the United Kingdom, Mexico, Taiwan, Australia, Brazil, and the Czech Republic with all the shows music intact since 2005. In the UK, Ireland, and Spain all seasons are available in a complete box set.     ": null
    },
    {
        "20th Century Fox": "20Th Century Fox Home Entertainment"
    },
    {
        " released the complete first season on DVD in Region 1 on October 6, 2009. They also released a special complete series edition on the same day.  Season 1 does not contain any special features, but the complete series set contains several bonus features, including featurettes, an all-new retrospective, the ": null
    },
    {
        "episode": "List Of The Practice Episodesseason 2"
    },
    {
        " of  The Practice  in which Calista Flockhart guest-starred, and a bonus disc entitled The Best of Ally McBeal Soundtrack. In addition, both releases contain all of the original music.  Season 2 was released on April 6, 2010. Seasons 3, 4, and 5 were all released on October 5, 2010.           Ally Ally  began airing in parallel with the main program. This version, designed in a sitcom format, used re-edited scenes from the main program, along with previously unseen footage. The intention was to further develop the plots in the comedy-drama in a sitcom style. It also focused only on Allys personal life, cutting all the courtroom plots. The repackaged show was cancelled partway through its initial run. While 13 episodes of Ally were produced, only ten aired.       McBeal and 1990s ": null
    },
    {
        "young affluent professional": "Yuppie"
    },
    {
        " women were parodied in the song Ally McBeal  by ": null
    },
    {
        "a cappella": "A Cappella"
    },
    {
        " group ": null
    },
    {
        "Da Vincis Notebook": "Da Vincis Notebook"
    },
    {
        " on their album The Life and Times of Mike Fanning, released in 2000.       In episode 2, season 3 of the British comedy  The Adam and Joe Show , the show was parodied as Ally McSqueal using soft toys. . YouTube. Retrieved on 2012-04-23.      Episode 2, season 2 of the show  Futurama , ": null
    },
    {
        "When Aliens Attack": "When Aliens Attack"
    },
    {
        " , centers on an invasion of Earth by the Omicronians precipitated by a signal loss during the climax of an episode of Single Female Lawyer, whose main character is Jenny McNeal.       ": null
    }
]