[
    {
        "The alpha helix  is a common ": null
    },
    {
        "motif": "Structural Motif"
    },
    {
        " in the ": null
    },
    {
        "secondary structure": "Protein Secondary Structure"
    },
    {
        " of ": null
    },
    {
        "proteins": "Protein"
    },
    {
        "and is a ": null
    },
    {
        "right hand": "Screw Threadhandedness"
    },
    {
        "-": null
    },
    {
        "helix": "Helix"
    },
    {
        " conformation in which every backbone ": null
    },
    {
        "N−H": "Amino"
    },
    {
        " group ": null
    },
    {
        "hydrogen bonds": "Hydrogen Bonds"
    },
    {
        " to the backbone ": null
    },
    {
        "CO": "Carbonyl"
    },
    {
        " group of the ": null
    },
    {
        "amino acid": "Amino Acid"
    },
    {
        " located three or four ": null
    },
    {
        "residues": "Residue"
    },
    {
        " earlier along the protein sequence.     The alpha helix is also called a classic Pauling–Corey–Branson α-helix. The name 3.6 13 -helix is also used for this type of helix, denoting the average number of residues per helical turn, with 13 atoms being involved in the ring formed by the hydrogen bond.     Among types of local structure in proteins, the α-helix is the most extreme and the most predictable from sequence, as well as the most prevalent.               In the early 1930s, ": null
    },
    {
        "William Astbury": "William Astbury"
    },
    {
        " showed that there were drastic changes in the ": null
    },
    {
        "X-ray": "X-Ray"
    },
    {
        " fiber diffraction": "Fiber Diffraction"
    },
    {
        " of moist wool or hair fibers upon significant stretching. The data suggested that the unstretched fibers had a coiled molecular structure with a characteristic repeat of ≈.     Astbury initially proposed a kinked-chain structure for the fibers. He later joined other researchers  in proposing that:     the unstretched protein molecules formed a helix   the stretching caused the helix to uncoil, forming an extended state .     Although incorrect in their details, Astburys models of these forms were correct in essence and correspond to modern elements of ": null
    },
    {
        "secondary structure": "Secondary Structure"
    },
    {
        ", the α-helix and the ": null
    },
    {
        "β-strand": "Beta Sheet"
    },
    {
        " , which were developed by ": null
    },
    {
        "Linus Pauling": "Linus Pauling"
    },
    {
        ", ": null
    },
    {
        "Robert Corey": "Robert Corey"
    },
    {
        " and ": null
    },
    {
        "Herman Branson": "Herman Branson"
    },
    {
        " in 1951 ; that paper showed both right- and left-handed helices, although in 1960 the crystal structure of myoglobin  showed that the right-handed form is the common one. ": null
    },
    {
        "Hans Neurath": "Hans Neurath"
    },
    {
        " was the first to show that Astburys models could not be correct in detail, because they involved clashes of atoms.  Neuraths paper and Astburys data inspired ": null
    },
    {
        "H. S. Taylor": "Hugh Stott Taylor"
    },
    {
        ",  ": null
    },
    {
        "Maurice Huggins": "Maurice Loyal Huggins"
    },
    {
        "  and ": null
    },
    {
        "Bragg": "William Lawrence Bragg"
    },
    {
        " and collaborators  to propose models of ": null
    },
    {
        "keratin": "Keratin"
    },
    {
        " that somewhat resemble the modern α-helix.     Two key developments in the modeling of the modern α-helix were: the correct bond geometry, thanks to the ": null
    },
    {
        "crystal structure determinations": "Crystallography"
    },
    {
        " of ": null
    },
    {
        "amino acids": "Amino Acid"
    },
    {
        "and ": null
    },
    {
        "peptides": "Peptide"
    },
    {
        "and Paulings prediction of planar ": null
    },
    {
        "peptide bond": "Peptide Bond"
    },
    {
        "s; and his relinquishing of the assumption of an integral number of residues per turn of the helix. The pivotal moment came in the early spring of 1948, when Pauling caught a cold and went to bed. Being bored, he drew a polypeptide chain of roughly correct dimensions on a strip of paper and folded it into a helix, being careful to maintain the planar peptide bonds. After a few attempts, he produced a model with physically plausible hydrogen bonds. Pauling then worked with Corey and Branson to confirm his model before publication.  In 1954, Pauling was awarded his first Nobel Prize for his research into the nature of the chemical bond and its application to the elucidation of the structure of complex substances  , prominently including the structure of the α-helix.           The amino acids in an α-helix are arranged in a right-handed ": null
    },
    {
        "helical": "Helix"
    },
    {
        " structure where each amino acid residue corresponds to a 100° turn in the helix , and a translation of  along the helical axis. Dunitz  describes how Paulings first article on the theme in fact shows a left-handed helix, the enantiomer of the true structure. Short pieces of left-handed helix sometimes occur with a large content of achiral ": null
    },
    {
        "glycine": "Glycine"
    },
    {
        " amino acids, but are unfavorable for the other normal, biological ": null
    },
    {
        "-amino acids": "Amino Acids"
    },
    {
        ". The pitch of the alpha-helix is , which is the product of 1.5 and 3.6. What is most important is that the ": null
    },
    {
        "N-H": "Amine"
    },
    {
        " group of an amino acid forms a ": null
    },
    {
        "hydrogen bond": "Hydrogen Bond"
    },
    {
        " with the ": null
    },
    {
        "CO": "Carbonyl"
    },
    {
        " group of the amino acid four residues earlier; this repeated i  +  4 → i hydrogen bonding is the most prominent characteristic of an α-helix. Official international nomenclature   specifies two ways of defining α-helices, rule 6.2 in terms of repeating φ, ψ torsion angles and rule 6.3 in terms of the combined pattern of pitch and hydrogen bonding. The α-helices can be identified in protein structure using several computational methods, one of which is ": null
    },
    {
        "DSSP": "Dssp"
    },
    {
        " .         Similar structures include the ": null
    },
    {
        "3 10 helix": "310 Helix"
    },
    {
        "  and the ": null
    },
    {
        "π-helix": "Pi Helix"
    },
    {
        " . The α-helix can be described as a 3.6 13 helix, since the i  +  4 spacing adds three more atoms to the H-bonded loop compared to the tighter 3 10 helix, and on average, 3.6 amino acids are involved in one ring of α-helix. The subscripts refer to the number of atoms in the closed loop formed by the hydrogen bond.         Residues in α-helices typically adopt backbone  ": null
    },
    {
        "dihedral angles": "Dihedral Angle"
    },
    {
        "around , as shown in the image at right. In more general terms, they adopt dihedral angles such that the ψ dihedral angle of one residue and the φ dihedral angle of the next residue sum to roughly −105°. As a consequence, α-helical dihedral angles, in general, fall on a diagonal stripe on the ": null
    },
    {
        "Ramachandran diagram": "Ramachandran Diagram"
    },
    {
        " , ranging from to . For comparison, the sum of the dihedral angles for a 3 10 helix is roughly −75°, whereas that for the π-helix is roughly −130°. The general formula for the rotation angle Ω per residue of any polypeptide helix with trans isomers is given by the equation       :     The α-helix is tightly packed; there is almost no free space within the helix. The amino-acid side-chains are on the outside of the helix, and point roughly downward , like the branches of an evergreen tree . This directionality is sometimes used in preliminary, low-resolution electron-density maps to determine the direction of the protein backbone.             Three differently arranged styles of 2D diagrams are used to represent different aspects of the sequence and structure relationships that confer specific physical and interaction properties on individual α-helices. Two of these emphasize circular placement around the cylindrical cross-section: The first-developed such diagram is called the ": null
    },
    {
        "helical wheel": "Helical Wheel"
    },
    {
        " ,  and a more recent version is called the ": null
    },
    {
        "wenxiang diagram": "Wenxiang Diagram"
    },
    {
        " .  The latter name came from the fact that it resembles a ": null
    },
    {
        "coil-like incense": "Mosquito Coil"
    },
    {
        " used in China to repel mosquitos .     The helical wheel represents a helix by a projection of the C α backbone structure down the helix axis, while the wenxiang diagram represents it more abstractly as a smooth spiral coiled on the plane of the page. Both label the sequence with one-letter amino-acid code  at each C α position, using different colors or symbols to code the amino-acid properties. ": null
    },
    {
        "Hydrophobic": "Hydrophobic"
    },
    {
        " vs ": null
    },
    {
        "hydrophilic": "Hydrophilic"
    },
    {
        " amino acids are always distinguished, as the most important property governing helix interactions. Sometimes positively vs negatively charged hydrophilics are distinguished, and sometimes ambiguous amino acids such as glycine are distinguished. Color-coding conventions are various. The helical wheel does not change representation along the helix, while the wenxiang diagram is able to show the relative locations of the amino acids in an α-helix regardless of how long it is.     Either circular style of diagram can provide an intuitive and easily visualizable 2D picture that characterizes the disposition of hydrophobic and hydrophilic residues in α-helices, and can be used to study helix–helix interactions,  helix-membrane interactions as quantified by the helical hydrophobic moment,  or protein-protein interactions.       Various utilities and web sites are available to generate helical wheels, such as the page by Kael Fischer.  .     The third style of 2D diagram is called a helical net . It is generated by opening the cylindrical surface of each helix along a line parallel to the axis and laying the result out vertically. The helix net is not suitable for studying helix–helix packing interactions, but it has become the dominant means of representing the sequence arrangement for ": null
    },
    {
        "integral membrane proteins": "Integral Membrane Protein"
    },
    {
        "because it shows important relationships of the helical sequence to vertical positioning within the membrane even without knowledge of how the helices are arranged in 3D.          Helices observed in proteins can range from four to over forty residues long, but a typical helix contains about ten amino acids . In general, short ": null
    },
    {
        "polypeptides": "Polypeptide"
    },
    {
        "do not exhibit much α-helical structure in solution, since the ": null
    },
    {
        "entropic": "Entropy"
    },
    {
        " cost associated with the folding of the polypeptide chain is not compensated for by a sufficient amount of stabilizing interactions. In general, the backbone ": null
    },
    {
        "hydrogen bonds": "Hydrogen Bond"
    },
    {
        "of α-helices are considered slightly weaker than those found in ": null
    },
    {
        "β-sheets": "Beta Sheet"
    },
    {
        ", and are readily attacked by the ambient water molecules. However, in more hydrophobic environments such as the ": null
    },
    {
        "plasma membrane": "Cellular Membrane"
    },
    {
        ", or in the presence of co-solvents such as ": null
    },
    {
        "trifluoroethanol": "Trifluoroethanol"
    },
    {
        " , or isolated from solvent in the gas phase,  oligopeptides readily adopt stable α-helical structure. Furthermore, crosslinks can be incorporated into peptides to conformationally stabilize helical folds. Crosslinks stabilize the helical state by entropically destabilizing the unfolded state and by removing enthalpically stabilized decoy folds that compete with the fully helical state.  It has been shown that α-helices are more stable, robust to mutations and designable than β-strands in natural proteins,  and also in artificial designed proteins.             Since the α-helix is defined by its hydrogen bonds and backbone conformation, the most detailed experimental evidence for α-helical structure comes from atomic-resolution ": null
    },
    {
        "X-ray crystallography": "X-Ray Crystallography"
    },
    {
        " such as the example shown at right. It is clear that all the backbone carbonyl oxygens point downward but splay out slightly, and the H-bonds are approximately parallel to the helix axis. Protein structures from ": null
    },
    {
        "NMR spectroscopy": "Protein Nmr"
    },
    {
        " also show helices well, with characteristic observations of ": null
    },
    {
        "nuclear Overhauser effect": "Nuclear Overhauser Effect"
    },
    {
        " couplings between atoms on adjacent helical turns. In some cases, the individual hydrogen bonds can be observed directly as a small scalar coupling in NMR.     There are several lower-resolution methods for assigning general helical structure. The ": null
    },
    {
        "NMR": "Protein Nmr"
    },
    {
        "chemical shifts": "Chemical Shift"
    },
    {
        " and ": null
    },
    {
        "residual dipolar couplings": "Residual Dipolar Coupling"
    },
    {
        "are often characteristic of helices. The far-UV ": null
    },
    {
        "circular dichroism": "Circular Dichroism"
    },
    {
        " spectrum of helices is also idiosyncratic, exhibiting a pronounced double minimum at around 208 and 222  nm. ": null
    },
    {
        "Infrared": "Infrared"
    },
    {
        " spectroscopy is rarely used, since the α-helical spectrum resembles that of a ": null
    },
    {
        "random coil": "Random Coil"
    },
    {
        " . Finally, cryo ": null
    },
    {
        "electron microscopy": "Electron Microscopy"
    },
    {
        " is now capable of discerning individual α-helices within a protein, although their assignment to residues is still an active area of research.     Long homopolymers of amino acids often form helices if soluble. Such long, isolated helices can also be detected by other methods, such as ": null
    },
    {
        "dielectric relaxation": "Dielectric Relaxation"
    },
    {
        ", ": null
    },
    {
        "flow birefringence": "Flow Birefringence"
    },
    {
        ", and measurements of the ": null
    },
    {
        "diffusion constant": "Diffusion Constant"
    },
    {
        ". In stricter terms, these methods detect only the characteristic ": null
    },
    {
        "prolate": "Prolate Spheroid"
    },
    {
        " hydrodynamic shape of a helix, or its large ": null
    },
    {
        "dipole moment": "Molecular Dipole Moment"
    },
    {
        ".       Different amino-acid sequences have different propensities for forming α-helical structure. ": null
    },
    {
        "Methionine": "Methionine"
    },
    {
        ", ": null
    },
    {
        "alanine": "Alanine"
    },
    {
        ", ": null
    },
    {
        "leucine": "Leucine"
    },
    {
        ", ": null
    },
    {
        "glutamate": "Glutamate"
    },
    {
        ", and ": null
    },
    {
        "lysine": "Lysine"
    },
    {
        " uncharged  all have especially high helix-forming propensities, whereas ": null
    },
    {
        "proline": "Proline"
    },
    {
        " and ": null
    },
    {
        "glycine": "Glycine"
    },
    {
        " have poor helix-forming propensities.  ": null
    },
    {
        "Proline": "Proline"
    },
    {
        " either breaks or kinks a helix, both because it cannot donate an amide ": null
    },
    {
        "hydrogen bond": "Hydrogen Bond"
    },
    {
        " , and also because its sidechain interferes sterically with the backbone of the preceding turn inside a helix, this forces a bend of about 30° in the helixs axis. However, proline is often seen as the first residue of a helix, it is presumed due to its structural rigidity. At the other extreme, ": null
    },
    {
        "glycine": "Glycine"
    },
    {
        " also tends to disrupt helices because its high conformational flexibility makes it entropically expensive to adopt the relatively constrained α-helical structure.       Estimated differences in ": null
    },
    {
        "free energy": "Gibbs Free Energy"
    },
    {
        ", Δ, estimated in ": null
    },
    {
        "kcal/mol": "Kcal/Mol"
    },
    {
        " per residue in an α-helical configuration, relative to alanine arbitrarily set as zero. Higher numbers are less favoured. Significant deviations from these average numbers are possible, depending on the identities of the neighbouring residues.     :       A helix has an overall ": null
    },
    {
        "dipole moment": "Molecular Dipole Moment"
    },
    {
        " due to the aggregate effect of the individual microdipoles from the ": null
    },
    {
        "carbonyl": "Carbonyl"
    },
    {
        " groups of the peptide bond pointing along the helix axis.  The effects of this macrodipole are a matter of some controversy. α-helices often occur with the N-terminal end bound by a negatively charged group, sometimes an ": null
    },
    {
        "amino acid": "Amino Acid"
    },
    {
        " side chain such as ": null
    },
    {
        "glutamate": "Glutamate"
    },
    {
        " or ": null
    },
    {
        "aspartate": "Aspartate"
    },
    {
        ", or sometimes a phosphate ion. Some regard the helix macrodipole as interacting electrostatically with such groups. Others feel that this is misleading and it is more realistic to say that the hydrogen bond potential of the free NH groups at the N-terminus of an α-helix can be satisfied by hydrogen bonding; this can also be regarded as set of interactions between local microdipoles such as .         Coiled-coil α helices are highly stable forms in which two or more helices wrap around each other in a supercoil structure. ": null
    },
    {
        "Coiled coils": "Coiled Coil"
    },
    {
        "contain a highly characteristic ": null
    },
    {
        "sequence motif": "Sequence Motif"
    },
    {
        " known as a  heptad repeat , in which the motif repeats itself every seven residues along the sequence . The first and especially the fourth residues  are almost always ": null
    },
    {
        "hydrophobic": "Hydrophobic"
    },
    {
        "; the fourth residue is typically ": null
    },
    {
        "leucine": "Leucine"
    },
    {
        " this gives rise to the name of the ": null
    },
    {
        "structural motif": "Structural Motif"
    },
    {
        " called a  leucine zipper , which is a type of coiled-coil. These hydrophobic residues pack together in the interior of the helix bundle. In general, the fifth and seventh residues  have opposing charges and form a salt bridge stabilized by ": null
    },
    {
        "electrostatic": "Electrostatic"
    },
    {
        " interactions. ": null
    },
    {
        "Fibrous proteins": "Fibrous Protein"
    },
    {
        "such as ": null
    },
    {
        "keratin": "Keratin"
    },
    {
        " or the stalks of ": null
    },
    {
        "myosin": "Myosin"
    },
    {
        " or ": null
    },
    {
        "kinesin": "Kinesin"
    },
    {
        " often adopt coiled-coil structures, as do several ": null
    },
    {
        "dimerizing": "Protein Dimer"
    },
    {
        " proteins. A pair of coiled-coils a four-": null
    },
    {
        "helix bundle": "Helix Bundle"
    },
    {
        " is a very common structural motif in proteins. For example, it occurs in human ": null
    },
    {
        "growth hormone": "Growth Hormone"
    },
    {
        " and several varieties of ": null
    },
    {
        "cytochrome": "Cytochrome"
    },
    {
        ". The ": null
    },
    {
        "Rop protein": "Rop Protein"
    },
    {
        ", which promotes plasmid replication in bacteria, is an interesting case in which a single polypeptide forms a coiled-coil and two monomers assemble to form a four-helix bundle.       The amino acids that make up a particular helix can be plotted on a ": null
    },
    {
        "helical wheel": "Helical Wheel"
    },
    {
        ", a representation that illustrates the orientations of the constituent amino acids . Often in ": null
    },
    {
        "globular protein": "Globular Protein"
    },
    {
        "s, as well as in specialized structures such as coiled-coils and ": null
    },
    {
        "leucine zipper": "Leucine Zipper"
    },
    {
        "s, an α-helix will exhibit two faces  one containing predominantly ": null
    },
    {
        "hydrophobic": "Hydrophobic"
    },
    {
        " amino acids oriented toward the interior of the protein, in the ": null
    },
    {
        "hydrophobic core": "Hydrophobic Core"
    },
    {
        ", and one containing predominantly ": null
    },
    {
        "polar": "Polarity"
    },
    {
        " amino acids oriented toward the ": null
    },
    {
        "solvent": "Solvent"
    },
    {
        "-exposed surface of the protein.     Changes in binding orientation also occur for facially-organized oligopeptides. This pattern is especially common in ": null
    },
    {
        "antimicrobial peptides": "Antimicrobial Peptides"
    },
    {
        ", and many models have been devised to describe how this relates to their function. Common to many of them is that the hydrophobic face of the antimicrobial peptide forms pores in the plasma membrane after associating with the fatty chains at the membrane core.            ": null
    },
    {
        "Myoglobin": "Myoglobin"
    },
    {
        " and ": null
    },
    {
        "hemoglobin": "Hemoglobin"
    },
    {
        ", the first two proteins whose structures were solved by X-ray ": null
    },
    {
        "crystallography": "Crystallography"
    },
    {
        ", have very similar folds made up of about 70% α-helix, with the rest being non-repetitive regions, or loops that connect the helices. In classifying proteins by their dominant fold, the  database maintains a large category specifically for all-α proteins.     Hemoglobin then has an even larger-scale ": null
    },
    {
        "quaternary structure": "Quaternary Structure"
    },
    {
        ", in which the functional oxygen-binding molecule is made up of four subunits.                 α-Helices have particular significance in ": null
    },
    {
        "DNA": "Dna"
    },
    {
        " binding motifs, including ": null
    },
    {
        "helix-turn-helix": "Helix-Turn-Helix"
    },
    {
        " motifs, ": null
    },
    {
        "leucine zipper": "Leucine Zipper"
    },
    {
        " motifs and ": null
    },
    {
        "zinc finger": "Zinc Finger"
    },
    {
        " motifs. This is because of the convenient structural fact that the diameter of an α-helix is about  including an average set of sidechains, about the same as the width of the major groove in B-form ": null
    },
    {
        "DNA": "Dna"
    },
    {
        ", and also because ": null
    },
    {
        "coiled-coil": "Coiled-Coil"
    },
    {
        " dimers of helices can readily position a pair of interaction surfaces to contact the sort of symmetrical repeat common in double-helical DNA. Branden & Tooze, chapter 10 An example of both aspects is the ": null
    },
    {
        "transcription factor": "Transcription Factor"
    },
    {
        " Max , which uses a helical coiled coil to dimerize, positioning another pair of helices for interaction in two successive turns of the DNA major groove.       α-Helices are also the most common protein structure element that crosses biological membranes , Branden & Tooze, chapter 12. it is presumed because the helical structure can satisfy all backbone hydrogen-bonds internally, leaving no polar groups exposed to the membrane if the sidechains are hydrophobic. Proteins are sometimes anchored by a single membrane-spanning helix, sometimes by a pair, and sometimes by a helix bundle, most classically consisting of seven helices arranged up-and-down in a ring such as for ": null
    },
    {
        "rhodopsins": "Rhodopsin"
    },
    {
        " or for ": null
    },
    {
        "G protein–coupled receptors": "G Protein–Coupled Receptor"
    },
    {
        ".       α-Helices under axial tensile deformation, a characteristic loading condition that appears in many alpha-helix-rich filaments and tissues, results in a characteristic three-phase behavior of stiff-soft-stiff tangent modulus.  Phase I corresponds to the small-deformation regime during which the helix is stretched homogeneously, followed by phase II, in which alpha-helical turns break mediated by the rupture of groups of H-bonds. Phase III is typically associated with large-deformation covalent bond stretching.       Alpha-helices in proteins may have ": null
    },
    {
        "low-frequency": "Low-Frequency Collective Motion In Proteins And Dna"
    },
    {
        " accordion-like motion as observed by the ": null
    },
    {
        "Raman spectroscopy": "Raman Spectroscopy"
    },
    {
        "  and analyzed via the quasi-continuum model.   Helices not stabilized by tertiary interactions show dynamic behavior, which can be mainly attributed to helix fraying from the ends.             Homopolymers of amino acids  can adopt α-helical structure at low temperature that is melted out at high temperatures. This helix–coil transition was once thought to be analogous to protein ": null
    },
    {
        "denaturation": "Denaturation"
    },
    {
        ". The ": null
    },
    {
        "statistical mechanics": "Statistical Mechanics"
    },
    {
        " of this transition can be modeled using an elegant ": null
    },
    {
        "transfer matrix": "Transfer Matrix"
    },
    {
        " method, characterized by two parameters: the propensity to initiate a helix and the propensity to extend a helix.            At least five artists have made explicit reference to the α-helix in their work: Julie Newdoll in painting and ": null
    },
    {
        "Julian Voss-Andreae": "Julian Voss-Andreae"
    },
    {
        ", ": null
    },
    {
        "Bathsheba Grossman": "Bathsheba Grossman"
    },
    {
        ", Byron Rubin, and Mike Tyka in sculpture.     San Francisco area artist Julie Newdoll,  who holds a degree in Microbiology with a minor in art, has specialized in paintings inspired by microscopic images and molecules since 1990. Her painting Rise of the Alpha Helix features human figures arranged in an α helical arrangement. According to the artist, the flowers reflect the various types of sidechains that each amino acid holds out to the world . This same metaphor is also echoed from the scientists side: β sheets do not show a stiff repetitious regularity but flow in graceful, twisting curves, and even the α-helix is regular more in the manner of a flower stem, whose branching nodes show the influence of environment, developmental history, and the evolution of each part to match its own idiosyncratic function.     ": null
    },
    {
        "Julian Voss-Andreae": "Julian Voss-Andreae"
    },
    {
        " is a German-born sculptor with degrees in experimental physics and sculpture. Since 2001 Voss-Andreae creates protein sculptures  based on protein structure with the α-helix being one of his preferred objects. Voss-Andreae has made α-helix sculptures from diverse materials including bamboo and whole trees. A monument Voss-Andreae created in 2004 to celebrate the memory of ": null
    },
    {
        "Linus Pauling": "Linus Pauling"
    },
    {
        ", the discoverer of the α-helix, is fashioned from a large steel beam rearranged in the structure of the α-helix. The , bright-red sculpture stands in front of Paulings childhood home in ": null
    },
    {
        "Portland, Oregon": "Portland, Oregon"
    },
    {
        ".     ": null
    },
    {
        "Ribbon diagrams": "Ribbon Diagrams"
    },
    {
        " of α-helices are a prominent element in the laser-etched crystal sculptures of protein structures created by artist ": null
    },
    {
        "Bathsheba Grossman": "Bathsheba Grossman"
    },
    {
        ", such as those of ": null
    },
    {
        "insulin": "Insulin"
    },
    {
        ", ": null
    },
    {
        "hemoglobin": "Hemoglobin"
    },
    {
        ", and ": null
    },
    {
        "DNA polymerase": "Dna Polymerase"
    },
    {
        ".  Byron Rubin is a former protein crystallographer now professional sculptor in metal of proteins, nucleic acids, and drug molecules many of which featuring α-helices, such as ": null
    },
    {
        "subtilisin": "Subtilisin"
    },
    {
        ", ": null
    },
    {
        "human growth hormone": "Human Growth Hormone"
    },
    {
        ", and ": null
    },
    {
        "phospholipase A2": "Phospholipase A2"
    },
    {
        ".      Mike Tyka is a computational biochemist at the ": null
    },
    {
        "University of Washington": "University Of Washington"
    },
    {
        " working with ": null
    },
    {
        "David Baker": "David Baker"
    },
    {
        ". Tyka has been making sculptures of protein molecules since 2010 from copper and steel, including ": null
    },
    {
        "ubiquitin": "Ubiquitin"
    },
    {
        " and a ": null
    },
    {
        "potassium channel": "Potassium Channel"
    },
    {
        " tetramer. ": null
    }
]