[
    {
        "In ": null
    },
    {
        "jazz": "jazz"
    },
    {
        ", the altered scale or altered dominant scale is a ": null
    },
    {
        "seven-note": "heptatonic scale"
    },
    {
        " scale": "musical scale"
    },
    {
        " that is a ": null
    },
    {
        "dominant scale": "mixolydian modemodern mixolydian"
    },
    {
        " where all non-essential tones have been altered. This means that it comprises the three irreducibly essential tones that define a ": null
    },
    {
        "dominant seventh chord": "dominant seventh chord"
    },
    {
        ", which are root, major third, and minor seventh and that all other ": null
    },
    {
        "chord tones have been altered": "altered chordjazz"
    },
    {
        ". These are:   the fifth is altered to a 42 and a 42   the ninth is altered to a 42 and a 42   the eleventh is altered to a 42    the thirteenth is altered to a 42      The altered forms of some of the non-essential tones coincide meaning those scale degrees are ": null
    },
    {
        "enharmonically": "enharmonic"
    },
    {
        " identical and have multiple potential spellings. The natural forms of the non-essential tones are not present in the scale. This means it contains no major ninth, no perfect eleventh, no perfect fifth, and no major thirteenth.     This is written below in musical notation with the essential chord tones coloured black and the non-essential altered chord tones coloured red.     :       The altered scale is made by the sequence:     :Half, Whole, Half, Whole, Whole, Whole, Whole     The abbreviation alt used in chord symbols enhances readability by reducing the number of characters otherwise needed to define the chord and avoids the confusion of multiple equivalent complex names. For example, C 42alt supplants C 4242424242 , C 42−4242−4242 , Caug 42−424242 , etc.         The C altered scale is also ": null
    },
    {
        "enharmonically equivalent": "enharmonically equivalent"
    },
    {
        " to the C ": null
    },
    {
        "Locrian mode": "locrian mode"
    },
    {
        " with F changed to F. For this reason, the altered scale is sometimes called the super-Locrian scale or the Locrian flat four scale .     It is also enharmonically the seventh ": null
    },
    {
        "mode": "mode"
    },
    {
        " of the ": null
    },
    {
        "ascending melodic minor scale": "minor scale"
    },
    {
        ". The altered scale is also known as the Pomeroy scale after ": null
    },
    {
        "Herb Pomeroy": "herb pomeroy"
    },
    {
        " , the Ravel scale after ": null
    },
    {
        "Maurice Ravel": "maurice ravel"
    },
    {
        ", and the diminished whole tone scale due to its resemblance to the lower part of the ": null
    },
    {
        "diminished scale": "octatonic scale"
    },
    {
        " and the upper part of the ": null
    },
    {
        "whole tone scale": "whole tone scale"
    },
    {
        " .     The super-Locrian scale is obtained by flattening the fourth note of the diatonic Locrian mode:     :       Another way to obtain the altered scale is by raising the tonic of a ": null
    },
    {
        "major scale": "major scale"
    }
]