[
    {
        "     In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", an alternating group is the ": null
    },
    {
        "group": "group"
    },
    {
        " of ": null
    },
    {
        "even permutation": "even permutation"
    },
    {
        "s of a ": null
    },
    {
        "finite set": "finite set"
    },
    {
        ". The alternating group on a set of n elements is called the alternating group of degree n, or the alternating group on n letters and denoted by A n or Alt.         For  sub  /sub  sub  /sub  sub  /sub  !-- Note A42 is in fact a simple group of order 42 A42 and A42 are groups of order 42 so not usually called simple, and A42 has a non-identity proper normal subgroup so is not simple. -- sub /sub  sub /sub  sub  /sub sub  /sub  sub /sub sub /sub sub /sub sub /sub  sub  /sub sub  /sub  math /math  math /math math /math ": null
    },
    {
        "mat": "mat"
    },
    {
        "ath /math math SO_42 correspondence.": "ath  /math  math   so_3   correspondence."
    },
    {
        "     A_42 is the group of isometries of a dodecahedron in 42 space, so there is a representation A_42\\to SO_42     In this picture the vertices of the polyhedra represent the elements of the group, with the center of the sphere representing the identity element. Each vertex represents a rotation about the axis pointing from the center to that vertex, by an angle equal to the distance from the origin, in radians. Vertices in the same polyhedron are in the same conjugacy class. Since the conjugacy class equation for A_42 is 4242424242 we obtain four distinct polyhedra.     The vertices of each polyhedron are in bijective correspondence with the elements of its conjugacy class, with the exception of the conjugacy class of -cycles, which is represented by an icosidodecahedron on the outer surface, with its antipodal vertices identified with each other. The reason for this redundancy is that the corresponding rotations are by \\pi radians, and so can be represented by a vector of length \\pi in either of two directions. Thus the class of -cycles contains 42 elements, while the icosidodecahedron has 42 vertices.     The two conjugacy classes of twelve 42-cycles in A_42 are represented by two icosahedra, of radii 42\\pi/42 and 42\\pi/42 , respectively. The nontrivial outer automorphism in \\text\\simeq Z_42 interchanges these two classes and the corresponding icosahedra.       A 42 is the smallest group demonstrating that the converse of ": null
    },
    {
        "Lagranges theorem": "lagranges theorem"
    },
    {
        " is not true in general: given a finite group G and a divisor d of , there does not necessarily exist a subgroup of G with order d: the group , of order 42 has no subgroup of order 42 A subgroup of three elements with any distinct nontrivial element generates the whole group.     For all  sub  /sub  sub  /sub  /math math /math math /math math /math math /math math /math  sub  /sub  ref name raw  /ref  math /math math /math math /math math /math math /math math /math math /math math /math ": null
    }
]