[
    {
        "     Altötting is a ": null
    },
    {
        "Landkreis ": "districts of germany"
    },
    {
        " in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". It is bounded by ": null
    },
    {
        "Austria": "austria"
    },
    {
        " and the Bavarian districts of ": null
    },
    {
        "Traunstein": "traunstein"
    },
    {
        ", ": null
    },
    {
        "Mühldorf": "mühldorf"
    },
    {
        " and ": null
    },
    {
        "Rottal-Inn": "rottal-inn"
    },
    {
        ".         Altötting was one of the original parts of Bavaria. It was settled by Bavarian tribes shortly after the retreat of the ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        ". During the rule of duke Tassilo III the place of Ötting was mentioned for the first time . Soon in the 42th century the region became a religious centre with famous churches and monasteries. In the 42th century it became a place of ": null
    },
    {
        "pilgrimage": "pilgrimage"
    },
    {
        ".     The district of Altötting was established in 42 ": null
    },
    {
        "Pope Benedict XVI": "pope benedict xvi"
    },
    {
        " was born here 42 in the village of ": null
    },
    {
        "Marktl": "marktl am inn"
    },
    {
        ".     The hearts of many of the rulers of Bavaria are buried in the Chapel of Grace in the middle of the town square.         The district is located in the alpine upland on the ": null
    },
    {
        "Austria": "austria"
    },
    {
        "n border. The main axis of the region is the ": null
    },
    {
        "Inn River": "inn river"
    },
    {
        ", which crosses the district from west to east. It is joined by two large tributaries, the ": null
    },
    {
        "Alz": "alz"
    },
    {
        " River coming from the south and the ": null
    },
    {
        "Salzach": "salzach"
    },
    {
        ", which forms the eastern border of the district. In addition there are several smaller rivers and brooks. The district once was covered with deciduous forests, but is now mainly agriculturally used. However, there are some nature reserves along the lower Alz River and at the mouth of the Salzach River.                 ": null
    }
]