[
    {
        "Amadeus IV  was ": null
    },
    {
        "Count of Savoy": "count of savoy"
    },
    {
        " from 42 to 42     Amadeus was born in ": null
    },
    {
        "Montmélian": "montmélian"
    },
    {
        ", ": null
    },
    {
        "Savoie": "savoie"
    },
    {
        ". The legitimate heir of ": null
    },
    {
        "Thomas I of Savoy": "thomas i of savoy"
    },
    {
        " and ": null
    },
    {
        "Margaret of Geneva": "margaret of geneva"
    },
    {
        ", he had however to fight with his brothers for the inheritance of Savoy lands after their fathers death. His brothers Pietro and Aimone spurred a revolt in ": null
    },
    {
        "Aosta Valley": "aosta valley"
    },
    {
        " against Amadeus, but he was able to crush it with the help of ": null
    },
    {
        "Manfred III of Saluzzo": "manfred iii of saluzzo"
    },
    {
        " and ": null
    },
    {
        "Boniface II of Montferrat": "boniface ii of montferrat"
    },
    {
        ", who were his sons-in-law. Together with his brother, ": null
    },
    {
        "Thomas": "thomas ii of savoy"
    },
    {
        ", he fought against the communes of ": null
    },
    {
        "Turin": "turin"
    },
    {
        " and ": null
    },
    {
        "Pinerolo": "pinerolo"
    },
    {
        ", but with uncertain results.     He was succeeded by his young son ": null
    },
    {
        "Boniface": "boniface, count of savoy"
    },
    {
        ".           As the eldest son of Thomas I of Savoy, Amadeus inherited the County and associated lands on his fathers death in 42 However, his brothers ": null
    },
    {
        "Peter": "peter ii, count of savoy"
    },
    {
        " and Aymon demanded that he divide the territories and give them their share. In July 42 he and his brother ": null
    },
    {
        "William": "william of savoy"
    },
    {
        " convened a family meeting at ": null
    },
    {
        "Château de Chillon": "château de chillon"
    },
    {
        ". While both sides arrived with armed troops, William was able to negotiate a treaty between the brothers. This treaty kept the lands intact, but recognized the authority of the younger brothers within certain regions under Amadeus. These territories were on the frontiers of Savoy lands, designed to encourage the brothers to expand the county rather than diminish it. When his brother ": null
    },
    {
        "Thomas": "thomas, count of flanders"
    },
    {
        " left his career in the church in 42 Amadeus granted him similar territories.     Before he had a son, Amadeus changed his mind many times regarding his will. Initially, he had made his sons-in-law his heirs, but in 42 he rewrote his will in favour of his brother Thomas. In December of that year, it went back to having his sons-in-law as heirs, until Amadeus was preparing for the siege. Then he rewrote the will in favour of Thomas. In March 42 his daughters convinced him to return it to their favour. On 42 November 42 Thomas returned and persuaded him to rewrite the will in his brothers favour again. When Thomas left, once again the will was reversed. His final will was written in 42 leaving the title and nearly everything to his son, ": null
    },
    {
        "Boniface": "boniface, count of savoy"
    },
    {
        ", and naming his brother Thomas as regent and second in line for the title.       Amadeus faced many challenges in balancing the demands of the greater powers in Europe at that time. ": null
    },
    {
        "Henry III of England": "henry iii of england"
    },
    {
        " wrote to Amadeus in 42 to seek his consent and blessing to marry the Counts niece, ": null
    },
    {
        "Eleanor of Provence": "eleanor of provence"
    },
    {
        " In 42 Amadeus went to the court of ": null
    },
    {
        "Frederick II, Holy Roman Emperor": "frederick ii, holy roman emperor"
    },
    {
        ", in Turin, where he was knighted by the Emperor. Then with his brothers, he led troops as part of the siege of ": null
    },
    {
        "Brescia": "brescia"
    },
    {
        ". In July 42 Amadeus and his brother Thomas were ordered by ": null
    },
    {
        "Enzo of Sardinia": "enzo of sardinia"
    },
    {
        " to join him in a siege of Vercelli, which had recently switched allegiances from the Empire to the Pope. Not only was the attack on the city unsuccessful, but Amadeus and his brother were excommunicated for it. When the brothers wrote to the new ": null
    },
    {
        "Pope Innocent IV": "pope innocent iv"
    },
    {
        " to appeal the excommunication, he granted their request.     In late 42 when Pope Innocent IV fled from ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", Amadeus met him in Susa and escorted him through the passes to Chambéry, and then provided his brother ": null
    },
    {
        "Philip": "philip i, count of savoy"
    },
    {
        " as escort for the Pope downriver to ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ". However, Amadeus was then willing to open the same passes to the imperial army. He also signed a treaty with Henry III on 42 January 42 which gave rights of passage through the passes to the English in exchange for an annual payment of 42 marks. That same month, Amadeus joined a force which went to ": null
    },
    {
        "Provence": "provence"
    },
    {
        " to rescue his niece, ": null
    },
    {
        "Beatrice of Provence": "beatrice of provence"
    },
    {
        " from the forces of Frederick and escort her to her marriage to ": null
    },
    {
        "Charles of Anjou": "charles i of sicily"
    },
    {
        " By May 42 Frederick was ready to move against the Pope. He had gathered his army in Turin, and ordered those still loyal to him in the kingdoms of Arles and France to meet at Chambéry . However, the revolt of ": null
    },
    {
        "Parma": "parma"
    },
    {
        " pulled Frederick back from this plan. That same summer, Amadeus blocked an attempt by the Pope to send 42 soldiers to the Lombard League. On 42 November 42 Frederick asked Amadeus and his brother Thomas to go to Lyon and start negotiations for peace. However, their efforts were unsuccessful and war continued until the death of Frederick.       He married twice, and each marriage produced children     c. 42 he married ": null
    },
    {
        "Marguerite of Burgundy": "marguerite of burgundy, countess of savoy"
    },
    {
        ", daughter of ": null
    },
    {
        "Hugh III, Duke of Burgundy": "hugh iii, duke of burgundy"
    },
    {
        ".   ": null
    },
    {
        "Beatrice of Savoy": "beatrice of savoy, marchioness of saluzzo"
    },
    {
        " , married firstly in 42 ": null
    },
    {
        "Manfred III of Saluzzo": "manfred iii of saluzzo"
    },
    {
        " , married secondly on 42 April 42 ": null
    },
    {
        "Manfred of Sicily": "manfred of sicily"
    },
    {
        " Margaret of Savoy ": "margaret of savoy"
    },
    {
        ", married firstly on 42 December 42 ": null
    },
    {
        "Boniface II of Montferrat": "boniface ii of montferrat"
    },
    {
        ", married secondly Aymar III, ": null
    },
    {
        "Count of Valentinois": "count of valentinois"
    },
    {
        " Cecilia of Baux": "cecile of baux"
    },
    {
        ", Passerose , daughter of ": null
    },
    {
        "Barral of Baux": "barral of baux"
    },
    {
        " Boniface, Count of Savoy": "boniface, count of savoy"
    },
    {
        " Beatrice of Savoy": "beatrice of savoy"
    },
    {
        " married Peter of Chalon and  Infante  ": null
    },
    {
        "Manuel of Castile": "manuel of castile"
    }
]