[
    {
        "Amalric of Bena  was a ": null
    },
    {
        "French": "france"
    },
    {
        " theologian": "theology"
    },
    {
        " and ": null
    },
    {
        "sect": "sect"
    },
    {
        " leader, after whom the ": null
    },
    {
        "Amalricians": "amalricians"
    },
    {
        " are named.       Amalric was born in the latter part of the 12th century at Bennes, a village between ": null
    },
    {
        "Ollé": "ollé"
    },
    {
        " and ": null
    },
    {
        "Chauffours": "chauffours"
    },
    {
        " in the ": null
    },
    {
        "diocese of Chartres": "diocese of chartres"
    },
    {
        ".     Amalric taught philosophy and theology at the ": null
    },
    {
        "University of Paris": "university of paris"
    },
    {
        " and enjoyed a great reputation as a subtle ": null
    },
    {
        "dialectic": "dialectic"
    },
    {
        "ian; his lectures developing the ": null
    },
    {
        "philosophy of Aristotle": "philosophy of aristotle"
    },
    {
        " attracted a large circle of hearers. In 1204 his doctrines were condemned by the university and, on a personal appeal to ": null
    },
    {
        "Pope Innocent III": "pope innocent iii"
    },
    {
        ", the sentence was ratified, Amalric being ordered to return to Paris and recant his errors.     His death was caused, it is said, by grief at the humiliation to which he had been subjected.   In 1209, ten of his followers were burnt before the gates of Paris and Amalrics own body was exhumed and burnt and the ashes given to the winds. The doctrines of his followers, known as the ": null
    },
    {
        "Amalrician": "amalrician"
    },
    {
        "s, were formally condemned by the ": null
    },
    {
        "fourth Lateran Council": "fourth council of the lateran"
    },
    {
        " in 1215.       Amalric appears to have derived his philosophical system from ": null
    },
    {
        "Eriugena": "johannes scotus eriugena"
    },
    {
        ", whose principles he developed in a one-sided and strongly ": null
    },
    {
        "pantheist": "pantheist"
    },
    {
        "ic form.     Three propositions only can with certainty be attributed to him:   that God is all  and thus all things are one because whatever is, is God ;   that every Christian is bound to believe that he is a member of the body of Christ, and that this belief is necessary for salvation;   that he who remains in love of God can commit no sin.     Because of the first proposition, God himself is thought as invisible and only recognizable in his creation.     These three propositions were further developed by his followers, who maintained that God revealed Himself in a threefold revelation, the first in the Biblical patriarch ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        ", marking the epoch of the Father; the second in ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        ", who began the epoch of the Son; and the third in Amalric and his disciples, who inaugurated the era of the Holy Ghost .     Amalricians taught:   Hell is ignorance, therefore Hell is within all men, like a bad tooth in a mouth ;   God is identical with all that is, even evil belongs to God and proves Gods omnipotence;   A man who knows that God works through everything cannot sin, because every human act is then the act of God;   A man who recognizes the truth that God works through everything is already in Heaven and this is the only resurrection. There is no other life; mans fulfilment is in this life alone.     Due to persecutions, this sect does not appear to have long survived the death of its founder. Not long after the burning of ten of their members , the sect itself lost its importance, while some of the surviving Amalricians became ": null
    },
    {
        "Brethren of the Free Spirit": "brethren of the free spirit"
    },
    {
        ".      According to ": null
    },
    {
        "Hosea Ballou": "hosea ballou"
    },
    {
        ", then ": null
    },
    {
        "Pierre Batiffol": "pierre batiffol"
    },
    {
        "  and ": null
    },
    {
        "George T. Knight": "george t. knight"
    },
    {
        "  . New Schaff-Herzog Encyclopedia of Religious Knowledge, Vol. I. Amalric was a believer that all people would eventually be saved and this was one of the counts upon which he was declared a heretic by ": null
    },
    {
        "Pope Innocent III": "pope innocent iii"
    }
]