[
    {
        "                     Amazing Grace is a Christian ": null
    },
    {
        "hymn": "hymn"
    },
    {
        " published in 1779, with words written in 1772 by the English poet and Anglican clergyman ": null
    },
    {
        "John Newton": "john newton"
    },
    {
        " .     Newton wrote the words from personal experience. He grew up without any particular religious conviction, but his lifes path was formed by a variety of twists and coincidences that were often put into motion by others reactions to what they took as his recalcitrant insubordination.     He was ": null
    },
    {
        "pressed": "impressment"
    },
    {
        " into service in the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ". After leaving the service, he became involved in the ": null
    },
    {
        "Atlantic slave trade": "atlantic slave trade"
    },
    {
        ". In 1748, a violent storm battered his vessel off the coast of ": null
    },
    {
        "County Donegal": "county donegal"
    },
    {
        ", ": null
    },
    {
        "Ireland": "kingdom of ireland"
    },
    {
        ", so severely that he called out to God for mercy. This moment marked ": null
    },
    {
        "his spiritual conversion": "john newtonspiritual conversion"
    },
    {
        " but he continued slave trading until 1754 or 1755, when he ended his seafaring altogether. He began studying ": null
    },
    {
        "Christian theology": "christian theology"
    },
    {
        ".     Ordained in the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " in 1764, Newton became ": null
    },
    {
        "curate": "curate"
    },
    {
        " of ": null
    },
    {
        "Olney, Buckinghamshire": "olney, buckinghamshire"
    },
    {
        ", where he began to write hymns with poet ": null
    },
    {
        "William Cowper": "william cowper"
    },
    {
        ". Amazing Grace was written to illustrate a sermon on New Years Day of 1773. It is unknown if there was any music accompanying the verses; it may have been chanted by the congregation. It debuted in print in 1779 in Newton and Cowpers  Olney Hymns  but settled into relative obscurity in England. In the United States, Amazing Grace became a popular song used by Baptist and Methodist preachers as part of their evangelizing, especially in the South, during the ": null
    },
    {
        "Second Great Awakening": "second great awakening"
    },
    {
        " of the early 19th century. It has been associated with more than 20 melodies. In 1835, American composer ": null
    },
    {
        "William Walker": "william walker"
    },
    {
        " set it to the tune known as New Britain in a shape-note format. This is the version most frequently sung today.     With the message that forgiveness and redemption are possible regardless of sins committed and that the soul can be delivered from despair through the mercy of God, Amazing Grace is one of the most recognisable songs in the English-speaking world. Author ": null
    },
    {
        "Gilbert Chase": "gilbert chase"
    },
    {
        " writes that it is without a doubt the most famous of all the folk hymns. Chase, p. 181. Jonathan Aitken, a Newton biographer, estimates that the song is performed about 10  million times annually. It has had particular influence in ": null
    },
    {
        "folk music": "folk music"
    },
    {
        ", and has become an emblematic black ": null
    },
    {
        "spiritual": "spiritual"
    },
    {
        ". Its universal message has been a significant factor in its crossover into secular music. Amazing Grace became newly popular during a revival of folk music in the US during the 1960s, and it has been recorded thousands of times during and since the 20th century, in versions that have occasionally ranked on popular music charts.            According to the Dictionary of American Hymnology, Amazing Grace is ": null
    },
    {
        "John Newtons": "john newton"
    },
    {
        "spiritual autobiography in verse. , Dictionary of American Hymnology. Retrieved 31 October 2009.     In 1725, Newton was born in ": null
    },
    {
        "Wapping": "wapping"
    },
    {
        ", a district in London near the ": null
    },
    {
        "Thames": "thames"
    },
    {
        ". His father was a shipping merchant who was brought up as a ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " but had ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " sympathies, and his mother was a devout Independent, unaffiliated with the ": null
    },
    {
        "Anglican Church": "anglican church"
    },
    {
        ". She had intended Newton to become a clergyman, but she died of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " when he was six years old. Martin , pp. 8–9. For the next few years, while his father was at sea Newton was raised by his emotionally distant stepmother. He was also sent to boarding school, where he was mistreated. Newton , p. 12. At the age of eleven, he joined his father on a ship as an apprentice; his seagoing career would be marked by headstrong disobedience.     As a youth, Newton began a pattern of coming very close to death, examining his relationship with God, then relapsing into bad habits. As a sailor, he denounced his faith after being influenced by a shipmate who discussed with him Characteristics of Men, Manners, Opinions, Times, a book by the ": null
    },
    {
        "Third Earl of Shaftesbury": "anthony ashley-cooper, 3rd earl of shaftesbury"
    },
    {
        ". In a series of letters Newton later wrote, Like an unwary sailor who quits his port just before a rising storm, I renounced the hopes and comforts of the ": null
    },
    {
        "Gospel": "gospel"
    },
    {
        " at the very time when every other comfort was about to fail me. Newton , pp. 21–22. His disobedience caused him to be ": null
    },
    {
        "pressed": "impressment"
    },
    {
        " into the Royal Navy, and he took advantage of opportunities to overstay his leave.     He deserted the navy to visit Mary Polly Catlett, a family friend with whom he had fallen in love. Martin , p. 23. After enduring humiliation for deserting, he was traded as crew to a slave ship.     He began a career in slave trading.          Newton often openly mocked the captain by creating obscene poems and songs about him, which became so popular that the crew began to join in. Martin , pp. 51–52. His disagreements with several colleagues resulted in his being starved almost to death, imprisoned while at sea, and chained like the slaves they carried. He was himself enslaved and forced to work on a plantation in the British colony ": null
    },
    {
        "Sierra Leone": "sierra leone"
    },
    {
        " near the ": null
    },
    {
        "Sherbro River": "sherbro river"
    },
    {
        ". After several months he came to think of Sierra Leone as his home, but his father intervened after Newton sent him a letter describing his circumstances, and crew from another ship happened to find him. Newton claimed the only reason he left the colony was because of Polly. Martin , p. 63.     While aboard the ship Greyhound, Newton gained notoriety as being one of the most profane men the captain had ever met. In a culture where sailors habitually swore, Newton was admonished several times for not only using the worst words the captain had ever heard, but creating new ones to exceed the limits of verbal debauchery. Martin , pp. 67–68. In March 1748, while the Greyhound was in the North Atlantic, a violent storm came upon the ship that was so rough it swept overboard a crew member who was standing where Newton had been moments before. After hours of the crew emptying water from the ship and expecting to be capsized, Newton and another mate tied themselves to the ships pump to keep from being washed overboard, working for several hours. After proposing the measure to the captain, Newton had turned and said, If this will not do, then Lord have mercy upon us! Newton , p. 41. Martin , pp. 70–71. Newton rested briefly before returning to the deck to steer for the next eleven hours. During his time at the wheel, he pondered his divine challenge. Martin , p. 73.     About two weeks later, the battered ship and starving crew landed in ": null
    },
    {
        "Lough Swilly": "lough swilly"
    },
    {
        ", Ireland. For several weeks before the storm, Newton had been reading The Christians Pattern, a summary of the 15th-century  The Imitation of Christ  by ": null
    },
    {
        "Thomas à Kempis": "thomas à kempis"
    },
    {
        ". The memory of his own Lord have mercy upon us! uttered during a moment of desperation in the storm did not leave him; he began to ask if he was worthy of Gods mercy or in any way redeemable. Not only had he neglected his faith but directly opposed it, mocking others who showed theirs, deriding and denouncing God as a myth. He came to believe that God had sent him a profound message and had begun to work through him. Aitken, pp. 81–84.     Newtons conversion was not immediate, but he contacted Pollys family and announced his intention to marry her. Her parents were hesitant as he was known to be unreliable and impetuous. They knew he was profane too but allowed him to write to Polly, and he set to begin to submit to authority for her sake. Martin , pp. 82–85. He sought a place on a slave ship bound for Africa, and Newton and his crewmates participated in most of the same activities he had written about before; the only immorality from which he was able to free himself was profanity. After a severe illness his resolve was renewed, yet he retained the same attitude towards slavery as was held by his contemporaries. Newton continued in the slave trade through several voyages where he sailed the coasts of Africa, now as a captain, and procured slaves being offered for sale in larger ports, transporting them to North America.     In between voyages, he married Polly in 1750, and he found it more difficult to leave her at the beginning of each trip. After three shipping voyages in the slave trade, Newton was promised a position as ships captain with cargo unrelated to slavery. But at the age of thirty, he collapsed and never sailed again. Aitken, p. 125.             Working as a customs agent in ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        " starting in 1756, Newton began to teach himself Latin, Greek, and theology. He and Polly immersed themselves in the church community, and Newtons passion was so impressive that his friends suggested he become a priest in the Church of England. He was turned down by ": null
    },
    {
        "John Gilbert": "john gilbert"
    },
    {
        ", ": null
    },
    {
        "Archbishop of York": "archbishop of york"
    },
    {
        ", in 1758, ostensibly for having no university degree, Martin , pp. 166–188. although the more likely reasons were his leanings toward ": null
    },
    {
        "evangelism": "evangelism"
    },
    {
        " and tendency to socialise with ": null
    },
    {
        "Methodist": "methodist"
    },
    {
        "s. Aitken, pp. 153–154. Newton continued his devotions, and after being encouraged by a friend, he wrote about his experiences in the slave trade and his conversion. ": null
    },
    {
        "William Legge, 2nd Earl of Dartmouth": "william legge, 2nd earl of dartmouth"
    },
    {
        ", impressed with his story, sponsored Newton for ordination by ": null
    },
    {
        "John Green": "john green"
    },
    {
        ", ": null
    },
    {
        "Bishop of Lincoln": "bishop of lincoln"
    },
    {
        ", and offered him the ": null
    },
    {
        "curacy": "curate"
    },
    {
        " of ": null
    },
    {
        "Olney, Buckinghamshire": "olney, buckinghamshire"
    },
    {
        ", in 1764. Martin , pp. 198–200.     Olney Hymns         Olney was a village of about 2,500 residents whose main industry was making lace by hand. The people were mostly illiterate and many of them were poor. Aitken, p. 224. Newtons preaching was unique in that he shared many of his own experiences from the pulpit; many clergy preached from a distance, not admitting any intimacy with temptation or sin. He was involved in his parishioners lives and was much loved, although his writing and delivery were sometimes unpolished. Martin , pp. 208–217. But his devotion and conviction were apparent and forceful, and he often said his mission was to break a hard heart and to heal a broken heart . He struck a friendship with ": null
    },
    {
        "William Cowper": "william cowper"
    },
    {
        ", a gifted writer who had failed at a career in law and suffered bouts of insanity, attempting suicide several times. Cowper enjoyed Olney and Newtons company; he was also new to Olney and had gone through a spiritual conversion similar to Newtons. Together, their effect on the local congregation was impressive. In 1768, they found it necessary to start a weekly prayer meeting to meet the needs of an increasing number of parishioners. They also began writing lessons for children. Turner, p. 76.     Partly from Cowpers literary influence, and partly because learned vicars were expected to write verses, Newton began to try his hand at hymns, which had become popular through the language, made plain for common people to understand. Several prolific hymn writers were at their most productive in the 18th century, including ": null
    },
    {
        "Isaac Watts": "isaac watts"
    },
    {
        " whose hymns Newton had grown up hearing Aitken, p. 28.  and ": null
    },
    {
        "Charles Wesley": "charles wesley"
    },
    {
        ", with whom Newton was familiar. Wesleys brother ": null
    },
    {
        "John": "john wesley"
    },
    {
        ", the eventual founder of the Methodist Church, had encouraged Newton to go into the clergy. Watts was a pioneer in English hymn writing, basing his work after the ": null
    },
    {
        "Psalms": "psalms"
    },
    {
        ". The most prevalent hymns by Watts and others were written in the ": null
    },
    {
        "common meter": "common meter"
    },
    {
        " in 8.6.8.6: the first line is eight syllables and the second is six. Turner, pp. 77–79.     Newton and Cowper attempted to present a poem or hymn for each prayer meeting. The lyrics to Amazing Grace were written in late 1772 and probably used in a prayer meeting for the first time on 1 January 1773. A collection of the poems Newton and Cowper had written for use in services at Olney was bound and published anonymously in 1779 under the title  Olney Hymns . Newton contributed 280 of the 348 texts in Olney Hymns; 1 Chronicles 17:16–17, Faiths Review and Expectation was the title of the poem with the first line Amazing grace! .       The general impact of Olney Hymns was immediate and it became a widely popular tool for evangelicals in Britain for many years. Scholars appreciated Cowpers poetry somewhat more than Newtons plaintive and plain language, expressing his forceful personality. The most prevalent themes in the verses written by Newton in Olney Hymns are faith in salvation, wonder at ": null
    },
    {
        "Gods grace": "grace"
    },
    {
        ", his love for Jesus, and his cheerful exclamations of the joy he found in his faith. Benson, p. 339. As a reflection of Newtons connection to his parishioners, he wrote many of the hymns in ": null
    },
    {
        "first person": "first-person narrative"
    },
    {
        ", admitting his own experience with sin. Bruce Hindmarsh in Sing Them Over Again To Me: Hymns and Hymnbooks in America considers Amazing Grace an excellent example of Newtons testimonial style afforded by the use of this perspective. Noll and Blumhofer, p. 6. Several of Newtons hymns were recognised as great work , while others seem to have been included to fill in when Cowper was unable to write. Benson, p. 338. Jonathan Aitken calls Newton, specifically referring to Amazing Grace , an unashamedly middlebrow lyricist writing for a lowbrow congregation , noting that only twenty-one of the nearly 150 words used in all six verses have more than one syllable. Aitken, p. 226.     William Phipps in the  Anglican Theological Review  and author James Basker have interpreted the first stanza of Amazing Grace as evidence of Newtons realisation that his participation in the slave trade was his wretchedness, perhaps representing a wider common understanding of Newtons motivations. Phipps, William . Amazing Grace in the hymnwriters life ,  Anglican Theological Review , 72 , pp. 306–313. Newton joined forces with a young man named ": null
    },
    {
        "William Wilberforce": "william wilberforce"
    },
    {
        ", the British Member of Parliament who led the Parliamentarian campaign to abolish the slave trade in the British Empire, culminating in the ": null
    },
    {
        "Slave Trade Act 1807": "slave trade act 1807"
    },
    {
        ". But Newton did not become an ardent and outspoken ": null
    },
    {
        "abolitionist": "abolitionist"
    },
    {
        " until after he left Olney in the 1780s; he is not known to have connected writing the hymn known as Amazing Grace to anti-slavery sentiments. Aitken, p. 231.     The lyrics in Olney Hymns were arranged by their association to the Biblical verses that would be used by Newton and Cowper in their prayer meetings, and did not address any political objective. For Newton, the beginning of the year was a time to reflect on ones spiritual progress. At the same time he completed a diary which has since been lost that he had begun 17 years before, two years after he quit sailing. The last entry of 1772 was a recounting of how much he had changed since then. Aitken, p. 227.          The title ascribed to the hymn, ": null
    },
    {
        "1 Chronicles": "1 chronicles"
    },
    {
        " 17:16–17 , refers to ": null
    },
    {
        "Davids": "david"
    },
    {
        "reaction to the prophet ": null
    },
    {
        "Nathan": "nathan"
    },
    {
        " telling him that God intends to maintain his family line forever. Some Christians interpret this as a prediction that Jesus Christ, as a descendant of David, was promised by God as the salvation for all people. Noll and Blumhofer, p. 8. Newtons sermon on that January day in 1773 focused on the necessity to express ones gratitude for Gods guidance, that God is involved in the daily lives of Christians though they may not be aware of it, and that patience for deliverance from the daily trials of life is warranted when the glories of eternity await. Turner, p. 81. Newton saw himself a sinner like David who had been chosen, perhaps undeservedly, and was humbled by it. According to Newton, unconverted sinners were blinded by the god of this world until mercy came to us not only undeserved but undesired  ... our hearts endeavored to shut him out till he overcame us by the power of his grace.     The ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " served as the basis for many of the lyrics of Amazing Grace . The first verse, for example, can be traced to the story of the ": null
    },
    {
        "Prodigal Son": "prodigal son"
    },
    {
        ". In the ": null
    },
    {
        "Gospel of Luke": "gospel of luke"
    },
    {
        " the father says, For this son of mine was dead and is alive again; he was lost, and is found . The story of Jesus ": null
    },
    {
        "healing a blind man": "miracles of jesusthe blind"
    },
    {
        " who tells the ": null
    },
    {
        "Pharisees": "pharisees"
    },
    {
        " that he can now see is told in the ": null
    },
    {
        "Gospel of John": "gospel of john"
    },
    {
        ". Newton used the words I was blind but now I see and declared Oh to grace how great a debtor! in his letters and diary entries as early as 1752. Aitken, p. 228. The effect of the lyrical arrangement, according to Bruce Hindmarsh, allows an instant release of energy in the exclamation Amazing grace! , to be followed by a qualifying reply in how sweet the sound . In An Annotated Anthology of Hymns, Newtons use of an exclamation at the beginning of his verse is called crude but effective in an overall composition that suggest a forceful, if simple, statement of faith . Watson, p. 215. Grace is recalled three times in the following verse, culminating in Newtons most personal story of his conversion, underscoring the use of his personal testimony with his parishioners.     The sermon preached by Newton was his last of those that William Cowper heard in Olney, since Cowpers mental instability returned shortly thereafter. Steve Turner, author of Amazing Grace: The Story of Americas Most Beloved Song, suggests Newton may have had his friend in mind, employing the themes of assurance and deliverance from despair for Cowpers benefit. Turner, p. 86.            Although it had its roots in England, Amazing Grace became an integral part of the Christian tapestry in the United States. More than 60 of Newton and Cowpers hymns were republished in other British hymnals and magazines, but Amazing Grace was not, appearing only once in a 1780 hymnal sponsored by the ": null
    },
    {
        "Countess of Huntingdon": "selina hastings, countess of huntingdon"
    },
    {
        ". Scholar ": null
    },
    {
        "John Julian": "john d. julian"
    },
    {
        " commented in his 1892  A Dictionary of Hymnology  that outside of the United States, the song was unknown and it was far from being a good example of Newtons finest work . Julian, p. 55.  Between 1789 and 1799, four variations of Newtons hymn were published in the US in ": null
    },
    {
        "Baptist": "baptist"
    },
    {
        ", ": null
    },
    {
        "Dutch Reformed": "dutch reformed"
    },
    {
        ", and ": null
    },
    {
        "Congregationalist": "congregationalist"
    },
    {
        " hymnodies; by 1830 ": null
    },
    {
        "Presbyterians": "presbyterian"
    },
    {
        "and ": null
    },
    {
        "Methodists": "methodist"
    },
    {
        "also included Newtons verses in their hymnals. Noll and Blumhofer, p. 10. Aitken, pp. 232–233.      The greatest influences in the 19th century that propelled Amazing Grace to spread across the US and become a staple of religious services in many denominations and regions were the ": null
    },
    {
        "Second Great Awakening": "second great awakening"
    },
    {
        " and the development of ": null
    },
    {
        "shape note": "shape note"
    },
    {
        " singing communities. A tremendous religious movement swept the US in the early 19th century, marked by the growth and popularity of churches and religious revivals that got their start on the frontier in Kentucky and Tennessee. Unprecedented gatherings of thousands of people attended ": null
    },
    {
        "camp meetings": "camp meeting"
    },
    {
        "where they came to experience salvation; preaching was fiery and focused on saving the sinner from temptation and backsliding. Turner, pp. 115–116. Religion was stripped of ornament and ceremony, and made as plain and simple as possible; sermons and songs often used repetition to get across to a rural population of poor and mostly uneducated people the necessity of turning away from sin. Witnessing and testifying became an integral component to these meetings, where a congregation member or stranger would rise and recount his turn from a sinful life to one of piety and peace. Amazing Grace was one of many hymns that punctuated fervent sermons, although the contemporary style used a refrain, borrowed from other hymns, that employed simplicity and repetition such as:          Simultaneously, an unrelated movement of communal singing was established throughout the South and Western states. A format of teaching music to illiterate people appeared in 1800. It used four sounds to symbolise the basic scale: fa-sol-la-fa-sol-la-mi-fa. Each sound was accompanied by a specifically shaped note and thus became known as shape note singing. The method was simple to learn and teach, so schools were established throughout the South and West. Communities would come together for an entire day of singing in a large building where they sat in four distinct areas surrounding an open space, one member directing the group as a whole. Other groups would sing outside, on benches set up in a square. Preachers used ": null
    },
    {
        "shape note": "shape note"
    },
    {
        " hymns to teach people on the frontier and to raise the emotion of camp meetings. Most of the music was Christian, but the purpose of communal singing was not primarily spiritual. Communities either could not afford music accompaniment or rejected it out of a ": null
    },
    {
        "Calvinistic": "calvinism"
    },
    {
        " sense of simplicity, so the songs were sung ": null
    },
    {
        "a cappella": "a cappella"
    },
    {
        ". Turner, p. 117.            When originally used in Olney, it is unknown what music, if any, accompanied the verses written by John Newton. Contemporary hymnbooks did not contain music and were simply small books of religious poetry. The first known instance of Newtons lines joined to music was in A Companion to the Countess of Huntingdons Hymns , where it is set to the tune Hephzibah by English composer ": null
    },
    {
        "John Husband": "john jenkins husband"
    },
    {
        ". , Search Hephzibah . University of Illinois at Champaign-Urbana Library website. Retrieved 31 December 2010. Common meter hymns were interchangeable with a variety of tunes; more than twenty musical settings of Amazing Grace circulated with varying popularity until 1835, when American composer ": null
    },
    {
        "William Walker": "william walker"
    },
    {
        " assigned Newtons words to a traditional song named New Britain . This was an amalgamation of two melodies , first published in the Columbian Harmony by Charles H. Spilman and Benjamin Shaw . Spilman and Shaw, both students at Kentuckys ": null
    },
    {
        "Centre College": "centre college"
    },
    {
        ", compiled their tunebook both for public worship and revivals, to satisfy the wants of the Church in her triumphal march . Most of the tunes had been previously published, but Gallaher and St. Mary had not. Turner, pp. 120–122. As neither tune is attributed and both show elements of oral transmission, scholars can only speculate that they are possibly of British origin. Turner, p. 123. A manuscript from 1828 by ": null
    },
    {
        "Lucius Chapin": "lucius chapin"
    },
    {
        ", a famous hymn writer of that time, contains a tune very close to St. Mary , but that does not mean that he wrote it.      Amazing Grace , with the words written by Newton and joined with New Britain , the melody most currently associated with it, appeared for the first time in Walkers shape note tunebook  Southern Harmony  in 1847. Noll and Blumhofer, p. 11. It was, according to author Steve Turner, a marriage made in heaven  ... The music behind amazing had a sense of awe to it. The music behind grace sounded graceful. There was a rise at the point of confession, as though the author was stepping out into the open and making a bold declaration, but a corresponding fall when admitting his blindness. Turner, p. 124. Walkers collection was enormously popular, selling about 600,000 copies all over the US when the total population was just over 20  million. Another shape note tunebook named  The Sacred Harp  by Georgia residents ": null
    },
    {
        "Benjamin Franklin White": "benjamin franklin white"
    },
    {
        " and Elisha J. King became widely influential and continues to be used. Turner, p. 126.     Another verse was first recorded in ": null
    },
    {
        "Harriet Beecher Stowes": "harriet beecher stowe"
    },
    {
        "immensely influential 1852 anti-slavery novel  Uncle Toms Cabin . Three verses were emblematically sung by Tom in his hour of deepest crisis. Stowe, p. 417. He sings the sixth and fifth verses in that order, and Stowe included another verse, not written by Newton, that had been passed down orally in African-American communities for at least 50 years. It was one of between 50 and 70 verses of a song titled Jerusalem, My Happy Home , which was first published in a 1790 book called A Collection of Sacred Ballads:               Amazing Grace came to be an emblem of a Christian movement and a symbol of the US itself as the country was involved in a great political experiment, attempting to employ democracy as a means of government. Shape-note singing communities, with all the members sitting around an open center, each song employing a different song leader, illustrated this in practice. Simultaneously, the US began to expand westward into previously unexplored territory that was often wilderness. The dangers, toils, and snares of Newtons lyrics had both literal and figurative meanings for Americans. This became poignantly true during the most serious test of American cohesion in the ": null
    },
    {
        "U.S. Civil War": "u.s. civil war"
    },
    {
        " . Amazing Grace , set to New Britain , was included in two hymnals distributed to soldiers. With death so real and imminent, religious services in the military became commonplace. Turner, pp. 127–128. The hymn was translated into other languages as well: while on the ": null
    },
    {
        "Trail of Tears": "trail of tears"
    },
    {
        ", the ": null
    },
    {
        "Cherokee": "cherokee"
    },
    {
        " sang Christian hymns as a way of coping with the ongoing tragedy, and a version of the song by ": null
    },
    {
        "Samuel Worcester": "samuel worcester"
    },
    {
        " that had been translated into the ": null
    },
    {
        "Cherokee language": "cherokee language"
    },
    {
        " became very popular. Duvall, p. 35. Swiderski, p. 91.       Although Amazing Grace set to New Britain was popular, other versions existed regionally. ": null
    },
    {
        "Primitive Baptists": "primitive baptist"
    },
    {
        "in the Appalachian region often used New Britain with other hymns, and sometimes sing the words of Amazing Grace to other folk songs, including titles such as ": null
    },
    {
        "In the Pines": "in the pines"
    },
    {
        " , Pisgah , Primrose , and Evan , as all are able to be sung in common meter, of which the majority of their repertoire consists. Patterson, p. 137. Sutton, Brett . Shape-Note Tune Books and Primitive Hymns , Ethnomusicology, 26 , pp. 11–26. In the late 19th century, Newtons verses were sung to a tune named Arlington as frequently as to New Britain for a time.     Two musical arrangers named ": null
    },
    {
        "Dwight Moody": "dwight moody"
    },
    {
        " and ": null
    },
    {
        "Ira Sankey": "ira sankey"
    },
    {
        " heralded another religious revival in the cities of the US and Europe, giving the song international exposure. Moodys preaching and Sankeys musical gifts were significant; their arrangements were the forerunners of ": null
    },
    {
        "gospel music": "gospel music"
    },
    {
        ", and churches all over the US were eager to acquire them. Turner, pp. 133–135. Moody and Sankey began publishing their compositions in 1875, and Amazing Grace appeared three times with three different melodies, but they were the first to give it its title; hymns were typically published using the first line of the lyrics, or the name of the tune such as New Britain . Publisher ": null
    },
    {
        "Edwin Othello Excell": "edwin othello excell"
    },
    {
        " gave the version of Amazing Grace set to New Britain immense popularity by publishing it in a series of hymnals that were used in urban churches. Excell altered some of Walkers music, making it more contemporary and European, giving New Britain some distance from its rural folk-music origins. Excells version was more palatable for a growing urban middle class and arranged for larger church choirs. Several editions featuring Newtons first three stanzas and the verse previously included by Harriet Beecher Stowe in Uncle Toms Cabin were published by Excell between 1900 and 1910. His version of Amazing Grace became the standard form of the song in American churches. Noll and Blumhofer, p. 13. Turner, pp. 137–138, 140–145.            With the advent of recorded music and radio, Amazing Grace began to cross over from primarily a gospel standard to secular audiences. The ability to record combined with the marketing of records to specific audiences allowed Amazing Grace to take on thousands of different forms in the 20th century. Where Edwin Othello Excell sought to make the singing of Amazing Grace uniform throughout thousands of churches, records allowed artists to improvise with the words and music specific to each audience. ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        " lists over 1,000 recordings – including re-releases and compilations – as of 2019. , AllMusic. Retrieved 12 January 2019. Its first recording is an ": null
    },
    {
        "a cappella": "a cappella"
    },
    {
        " version from 1922 by the Sacred Harp Choir. It was included from 1926 to 1930 in ": null
    },
    {
        "Okeh Records": "okeh records"
    },
    {
        " catalogue, which typically concentrated strongly on blues and jazz. Demand was high for black gospel recordings of the song by H. R. Tomlin and ": null
    },
    {
        "J. M. Gates": "j. m. gates"
    },
    {
        ". A poignant sense of nostalgia accompanied the recordings of several gospel and blues singers in the 1940s and 1950s who used the song to remember their grandparents, traditions, and family roots. Turner, pp. 154–155. It was recorded with musical accompaniment for the first time in 1930 by ": null
    },
    {
        "Fiddlin John Carson": "fiddlin john carson"
    },
    {
        ", although to another folk hymn named At the Cross , not to New Britain . Amazing Grace is emblematic of several kinds of folk music styles, often used as the standard example to illustrate such musical techniques as ": null
    },
    {
        "lining out": "lining out"
    },
    {
        " and ": null
    },
    {
        "call and response": "call and response"
    },
    {
        ", that have been practised in both black and white folk music. Tallmadge, William . Dr. Watts and Mahalia Jackson: The Development, Decline, and Survival of a Folk Style in America , Ethnomusicology, 5 , pp. 95–99.          ": null
    },
    {
        "Mahalia Jacksons": "mahalia jackson"
    },
    {
        "1947 version received significant radio airplay, and as her popularity grew throughout the 1950s and 1960s, she often sang it at public events such as concerts at ": null
    },
    {
        "Carnegie Hall": "carnegie hall"
    },
    {
        ". Mahalia Jackson . Dictionary of American Biography, Supplement 9: 1971–1975. Charles Scribners Sons, 1994. Author James Basker states that the song has been employed by African Americans as the paradigmatic Negro spiritual because it expresses the joy felt at being delivered from slavery and worldly miseries. Basker, p. 281. Anthony Heilbut, author of The Gospel Sound, states that the dangers, toils, and snares of Newtons words are a universal testimony of the African American experience. Turner, p. 148. During the ": null
    },
    {
        "civil rights movement": "civil rights movement"
    },
    {
        " and ": null
    },
    {
        "opposition to the Vietnam War": "opposition to the vietnam war"
    },
    {
        ", the song took on a political tone. Mahalia Jackson employed Amazing Grace for Civil Rights marchers, writing that she used it to give magical protection a charm to ward off danger, an incantation to the angels of heaven to descend  ... I was not sure the magic worked outside the church walls  ... in the open air of Mississippi. But I wasnt taking any chances. Aitken, p. 236. Folk singer ": null
    },
    {
        "Judy Collins": "judy collins"
    },
    {
        ", who knew the song before she could remember learning it, witnessed ": null
    },
    {
        "Fannie Lou Hamer": "fannie lou hamer"
    },
    {
        " leading marchers in ": null
    },
    {
        "Mississippi in 1964": "freedom summer"
    },
    {
        ", singing Amazing Grace . Collins also considered it a ": null
    },
    {
        "talisman": "wikt:talisman"
    },
    {
        " of sorts, and saw its equal emotional impact on the marchers, witnesses, and law enforcement who opposed the civil rights demonstrators. According to fellow folk singer ": null
    },
    {
        "Joan Baez": "joan baez"
    },
    {
        ", it was one of the most requested songs from her audiences, but she never realised its origin as a hymn; by the time she was singing it in the 1960s she said it had developed a life of its own . Turner, p. 162. It even made an appearance at the ": null
    },
    {
        "Woodstock Music Festival": "woodstock music festival"
    },
    {
        " in 1969 during ": null
    },
    {
        "Arlo Guthries": "arlo guthrie"
    },
    {
        "performance. Turner, p. 175.          Collins decided to record it in the late 1960s amid an atmosphere of counterculture introspection; she was part of an ": null
    },
    {
        "encounter group": "encounter group"
    },
    {
        " that ended a contentious meeting by singing Amazing Grace as it was the only song to which all the members knew the words. Her producer was present and suggested she include a version of it on her 1970 album  Whales & Nightingales . Collins, who had a history of alcohol abuse, claimed that the song was able to pull her through to recovery. It was recorded in ": null
    },
    {
        "St. Pauls": "st. pauls chapel"
    },
    {
        ", the chapel at ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        ", chosen for the acoustics. She chose an a cappella arrangement that was close to Edwin Othello Excells, accompanied by a chorus of amateur singers who were friends of hers. Collins connected it to the Vietnam War, to which she objected: I didnt know what else to do about the war in Vietnam. I had marched, I had voted, I had gone to jail on political actions and worked for the candidates I believed in. The war was still raging. There was nothing left to do, I thought  ... but sing Amazing Grace. Collins, p. 165. Gradually and unexpectedly, the song began to be played on the radio, and then be requested. It rose to number 15 on the ": null
    },
    {
        "Billboard Hot 100": "billboard hot 100"
    },
    {
        ", remaining on the charts for 15 weeks, Whitburn, p. 144. as if, she wrote, her fans had been waiting to embrace it . Collins, p. 166. In the UK, it charted 8 times between 1970 and 1972, peaking at number 5 and spending a total of 75 weeks on popular music charts. Brown, Kutner, and Warwick p. 179. Her rendition also reached number 5 in New Zealand  and number 12 in Ireland in 1971.      Although Collins used it as a catharsis for her opposition to the Vietnam War, two years after her rendition, the ": null
    },
    {
        "Royal Scots Dragoon Guards": "royal scots dragoon guards"
    },
    {
        ", senior ": null
    },
    {
        "Scottish regiment": "scottish regiment"
    },
    {
        " of the ": null
    },
    {
        "British Army": "british army"
    },
    {
        ", recorded an instrumental version featuring a ": null
    },
    {
        "bagpipe": "bagpipe"
    },
    {
        " soloist accompanied by a ": null
    },
    {
        "pipe and drum": "pipe and drum"
    },
    {
        " band. The tempo of their arrangement was slowed to allow for the bagpipes, but it was based on Collins: it began with a bagpipe solo introduction similar to her lone voice, then it was accompanied by the band of bagpipes and horns, whereas in her version she is backed up by a chorus. It topped the  RPM  national singles chart in Canada for three weeks,  RPM Magazine . Retrieved 4 November 2011. and rose as high as number 11 in the US Brown, Kutner, and Warwick p. 757. Whitburn, p. 610. It is also a controversial instrumental, as it combined pipes with a military band. The ": null
    },
    {
        "Pipe Major": "pipe major"
    },
    {
        " of the Royal Scots Dragoon Guards was summoned to ": null
    },
    {
        "Edinburgh Castle": "edinburgh castle"
    },
    {
        " and chastised for demeaning the bagpipes. Turner, p. 188.     ": null
    },
    {
        "Aretha Franklin": "aretha franklin"
    },
    {
        " and ": null
    },
    {
        "Rod Stewart": "rod stewart"
    },
    {
        " also recorded Amazing Grace around the same time, and both of their renditions were popular. All four versions were marketed to distinct types of audiences thereby assuring its place as a pop song. Turner, p. 192. ": null
    },
    {
        "Johnny Cash": "johnny cash"
    },
    {
        " recorded it on his 1975 album  Sings Precious Memories , dedicating it to his older brother Jack, who had been killed in a mill accident when they were boys in ": null
    },
    {
        "Dyess, Arkansas": "dyess, arkansas"
    },
    {
        ". Cash and his family sang it to themselves while they worked in the cotton fields following Jacks death. Cash often included the song when he toured prisons, saying For the three minutes that song is going on, everybody is free. It just frees the spirit and frees the person.     The ": null
    },
    {
        "U.S. Library of Congress": "u.s. library of congress"
    },
    {
        " has a collection of 3,000 versions of and songs inspired by Amazing Grace , some of which were first-time recordings by folklorists ": null
    },
    {
        "Alan and John Lomax": "alan lomax"
    },
    {
        ", a father and son team who in 1932 travelled thousands of miles across the South to capture the different regional styles of the song. More contemporary renditions include samples from such popular artists as ": null
    },
    {
        "Sam Cooke": "sam cooke"
    },
    {
        " and ": null
    },
    {
        "the Soul Stirrers": "the soul stirrers"
    },
    {
        " , ": null
    },
    {
        "the Byrds": "the byrds"
    },
    {
        " , ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        " , ": null
    },
    {
        "Skeeter Davis": "skeeter davis"
    },
    {
        " , ": null
    },
    {
        "Mighty Clouds of Joy": "mighty clouds of joy"
    },
    {
        " , ": null
    },
    {
        "Amazing Rhythm Aces": "amazing rhythm aces"
    },
    {
        " , ": null
    },
    {
        "Willie Nelson": "willie nelson"
    },
    {
        " , ": null
    },
    {
        "the Lemonheads": "the lemonheads"
    },
    {
        " and ": null
    },
    {
        "MNL48": "mnl48"
    },
    {
        " .  United States Library of Congress Performing Arts Encyclopedia. Retrieved 1 November 2008.            Following the appropriation of the hymn in secular music, Amazing Grace became such an icon in American culture that it has been used for a variety of secular purposes and marketing campaigns, placing it in danger of becoming a ": null
    },
    {
        "cliché": "cliché"
    },
    {
        ". It has been mass-produced on souvenirs, lent its name to a ": null
    },
    {
        "Superman villain": "amazing grace"
    },
    {
        ", appeared on  The Simpsons  to demonstrate the redemption of a murderous character named ": null
    },
    {
        "Sideshow Bob": "sideshow bob"
    },
    {
        ", incorporated into ": null
    },
    {
        "Hare Krishna": "international society for krishna consciousness"
    },
    {
        " chants and adapted for ": null
    },
    {
        "Wicca": "wicca"
    },
    {
        " ceremonies. Turner, pp. 195–205. It can also be sung to the theme from  The Mickey Mouse Club , as ": null
    },
    {
        "Garrison Keillor": "garrison keillor"
    },
    {
        " has observed.  The hymn has been employed in several films, including  Alices Restaurant ,  Invasion of the Body Snatchers ,  Coal Miners Daughter , and  Silkwood . It is referenced in the 2006 film  Amazing Grace , which highlights Newtons influence on the leading British abolitionist ": null
    },
    {
        "William Wilberforce": "william wilberforce"
    },
    {
        ", Noll and Blumhofer, p. 15. and in the film biography of Newton, ": null
    },
    {
        "Newtons Grace": "newtons grace"
    },
    {
        ". Young, Wesley , . Winston-Salem Journal. The 1982 science fiction film  Star Trek II: The Wrath of Khan  used Amazing Grace amid a context of Christian symbolism, to memorialise ": null
    },
    {
        "Mr. Spock": "spock"
    },
    {
        " following his death, but more practically, because the song has become instantly recognizable to many in the audience as music that sounds appropriate for a funeral according to a Star Trek scholar. Porter and McLaren, p. 157. Since 1954, when an organ instrumental of New Britain became a best-seller, Amazing Grace has been associated with funerals and memorial services. Turner, p. 159. It has become a song that inspires hope in the wake of tragedy, becoming a sort of spiritual national anthem according to authors Mary Rourke and Emily Gwathmey. Rourke and Gwathmey, p. 108. For example, President ": null
    },
    {
        "Barack Obama": "barack obama"
    },
    {
        " recited and then sang the hymn at the memorial service for ": null
    },
    {
        "Clementa Pinckney": "clementa c. pinckney"
    },
    {
        ", one of the victims of the ": null
    },
    {
        "2015 Charleston church shooting": "charleston church shooting"
    },
    {
        ".                In recent years, the words of the hymn have been changed in some religious publications to downplay a sense of imposed self-loathing by its singers. The second line, That saved a wretch like me! has been rewritten as That saved and strengthened me , save a soul like me , or that saved and set me free . Saunders, William .  Arlington Catholic Herald. Retrieved 7 February 2010. ": null
    },
    {
        "Kathleen Norris": "kathleen norris"
    },
    {
        " in her book Amazing Grace: A Vocabulary of Faith characterises this transformation of the original words as wretched English making the line that replaces the original laughably bland . Norris, p. 66. Part of the reason for this change has been the altered interpretations of what wretchedness and grace means. Newtons ": null
    },
    {
        "Calvinistic": "calvinism"
    },
    {
        " view of ": null
    },
    {
        "redemption": "redemption"
    },
    {
        " and ": null
    },
    {
        "divine grace": "grace"
    },
    {
        " formed his perspective that he considered himself a sinner so vile that he was ": null
    },
    {
        "unable to change his life": "total depravity"
    },
    {
        " or be redeemed without Gods help. Yet his lyrical subtlety, in Steve Turners opinion, leaves the hymns meaning open to a variety of Christian and non-Christian interpretations. Turner, pp. 213–214. Wretch also represents a period in Newtons life when he saw himself outcast and miserable, as he was when he was enslaved in Sierra Leone; his own arrogance was matched by how far he had fallen in his life. Bruner and Ware, pp. 31–32.          Due to its immense popularity and iconic nature, the meaning behind the words of Amazing Grace has become as individual as the singer or listener. Turner, pp. 218–220. Bruce Hindmarsh suggests that the secular popularity of Amazing Grace is due to the absence of any mention of God in the lyrics until the fourth verse , and that the song represents the ability of humanity to transform itself instead of a transformation taking place at the hands of God. Grace , however, had a clearer meaning to John Newton, as he used the word to represent God or the ": null
    },
    {
        "power of God": "grace"
    },
    {
        ". Noll and Blumhofer, p. 16.     The transformative power of the song was investigated by journalist ": null
    },
    {
        "Bill Moyers": "bill moyers"
    },
    {
        " in a documentary released in 1990. Moyers was inspired to focus on the songs power after watching a performance at ": null
    },
    {
        "Lincoln Center": "lincoln center"
    },
    {
        ", where the audience consisted of Christians and non-Christians, and he noticed that it had an equal impact on everybody in attendance, unifying them. Pollock, John . Amazing Grace: The great Sea Change in the Life of John Newton , The Trinity Forum Reading, The Trinity Forum. James Basker also acknowledged this force when he explained why he chose Amazing Grace to represent a collection of anti-slavery poetry: there is a transformative power that is applicable  ... : the transformation of sin and sorrow into grace, of suffering into beauty, of alienation into empathy and connection, of the unspeakable into imaginative literature. Basker, p. xxxiv.     Moyers interviewed Collins, Cash, opera singer ": null
    },
    {
        "Jessye Norman": "jessye norman"
    },
    {
        ", Appalachian folk musician ": null
    },
    {
        "Jean Ritchie": "jean ritchie"
    },
    {
        " and her family, white Sacred Harp singers in Georgia, black Sacred Harp singers in Alabama, and a prison choir at the ": null
    },
    {
        "Texas State Penitentiary at Huntsville": "huntsville unit"
    },
    {
        ". Collins, Cash, and Norman were unable to discern if the power of the song came from the music or the lyrics. Norman, who once notably sang it at the end of a large outdoor ": null
    },
    {
        "rock concert for Nelson Mandelas 70th birthday": "nelson mandela 70th birthday tribute"
    },
    {
        ", stated, I dont know whether its the text I dont know whether were talking about the lyrics when we say that it touches so many people or whether its that tune that everybody knows. A prisoner interviewed by Moyers explained his literal interpretation of the second verse: Twas grace that taught my heart to fear, and grace my fears relieved by saying that the fear became immediately real to him when he realised he may never get his life in order, compounded by the loneliness and restriction in prison. Gospel singer ": null
    },
    {
        "Marion Williams": "marion williams"
    },
    {
        " summed up its effect: Thats a song that gets to everybody .     The Dictionary of American Hymnology claims it is included in more than a thousand published hymnals, and recommends its use for occasions of worship when we need to confess with joy that we are saved by Gods grace alone; as a hymn of response to forgiveness of sin or as an assurance of pardon; as a confession of faith or after the sermon .       ": null
    }
]