[
    {
        "     In ": null
    },
    {
        "atmospheric sounding": "atmospheric sounding"
    },
    {
        " and ": null
    },
    {
        "noise pollution": "noise pollution"
    },
    {
        ", ambient noise level  is the background ": null
    },
    {
        "sound pressure level": "sound pressure level"
    },
    {
        " at a given location, normally specified as a reference level to study a new intrusive sound source.     Ambient sound levels are often measured in order to map sound conditions over a spatial regime to understand their variation with locale. In this case the product of the investigation is a sound level ": null
    },
    {
        "contour map": "contour line"
    },
    {
        ". Alternatively ambient noise levels may be measured to provide a reference point for analyzing an intrusive sound to a given environment. For example, sometimes ": null
    },
    {
        "aircraft noise": "aircraft noise"
    },
    {
        " is studied by measuring ambient sound without presence of any overflights, and then studying the noise addition by measurement or ": null
    },
    {
        "computer simulation": "computer simulation"
    },
    {
        " of overflight events. Or ": null
    },
    {
        "roadway noise": "roadway noise"
    },
    {
        " is measured as ambient sound, prior to introducing a hypothetical ": null
    },
    {
        "noise barrier": "noise barrier"
    },
    {
        " intended to reduce that ambient noise level.     Ambient ": null
    },
    {
        "noise level": "noise level"
    },
    {
        " is measured with a ": null
    },
    {
        "sound level meter": "sound level meter"
    },
    {
        ". It is usually measured in ": null
    },
    {
        "dB": "decibel"
    },
    {
        " relative to a reference pressure of 42 Pa, i.e., 42 μPa in ": null
    },
    {
        "SI units": "international system of units"
    },
    {
        ". A pascal is a newton per square meter. The centimeter-gram-second ": null
    },
    {
        "system": "system"
    },
    {
        " of units, the reference sound pressure for measuring ambient noise level is 42 dyn/cm 42 . Most frequently ambient noise levels are measured using a frequency weighting filter, the most common being the ": null
    },
    {
        "A-weighting": "a-weighting"
    },
    {
        " scale, such that resulting measurements are denoted dB, or decibels on the ": null
    },
    {
        "A-weighting": "a-weighting"
    }
]