[
    {
        "        The K6 microprocessor was launched by ": null
    },
    {
        "AMD": "amd"
    },
    {
        " in 1997. The main advantage of this particular microprocessor is that it was designed to fit into existing desktop designs for ": null
    },
    {
        "Pentium": "pentium"
    },
    {
        "-branded ": null
    },
    {
        "CPU": "cpu"
    },
    {
        "s. It was marketed as a product that could perform as well as its ": null
    },
    {
        "Intel": "intel"
    },
    {
        " Pentium II equivalent but at a significantly lower price. The K6 had a considerable impact on the PC market and presented Intel with serious competition.            The AMD K6 is a ": null
    },
    {
        "superscalar": "superscalar"
    },
    {
        " P5": "p5"
    },
    {
        " Pentium": "pentium"
    },
    {
        "-class ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        ", manufactured by ": null
    },
    {
        "AMD": "amd"
    },
    {
        ", which superseded the ": null
    },
    {
        "K5": "amd k5"
    },
    {
        ".   The AMD K6 is based on the Nx686 microprocessor that ": null
    },
    {
        "NexGen": "nexgen"
    },
    {
        " was designing when it was acquired by AMD. Despite the name implying a design evolving from the ": null
    },
    {
        "K5": "amd k5"
    },
    {
        ", it is in fact a totally different design that was created by the NexGen team, including chief processor architect Greg Favor, p. 48, , S. Oberman, G. Favor, and F. Weber, IEEE Micro 19, 2 , pp. 37–48, . , Mark Smotherman, Clemson University, updated June 9, 2010. and adapted after the AMD purchase. The K6 processor included a feedback dynamic instruction reordering mechanism, ": null
    },
    {
        "MMX": "mmx"
    },
    {
        " instructions, and a floating-point unit . It was also made ": null
    },
    {
        "pin-compatible": "pin-compatibility"
    },
    {
        " with Intels Pentium, enabling it to be used in the widely available ": null
    },
    {
        "Socket 7": "socket 7"
    },
    {
        " -based motherboards. Like the ": null
    },
    {
        "AMD K5": "amd k5"
    },
    {
        ", Nx586, and Nx686 before it, the K6 translated x86 instructions on the fly into dynamic buffered sequences of ": null
    },
    {
        "micro-operation": "micro-operation"
    },
    {
        "s. A later variation of the K6 CPU, ": null
    },
    {
        "K6-2": "amd k6-2"
    },
    {
        ", added ": null
    },
    {
        "floating-point": "floating-point"
    },
    {
        "-based SIMD instructions, called ": null
    },
    {
        "3DNow!": "3dnow!"
    },
    {
        ".     The K6 was originally launched in April 1997, running at speeds of 166 and 200  MHz. It was followed by a 233  MHz version later in 1997. Initially, the AMD K6 processors used a Pentium II-based performance rating to designate their speed. The PR2 rating was dropped because the rated frequency of the processor was the same as the real frequency. The release of the 266  MHz version of this chip was not until the second quarter of 1998, when AMD was able to move to the 0.25-micrometre manufacturing process. The lower voltage and higher multiplier of the K6-266 meant that it was not fully compatible with some Socket 7 motherboards, similar to the later ": null
    },
    {
        "K6-2": "amd k6-2"
    },
    {
        " processors. The final iteration of the K6 design was released in May 1998, running at 300  MHz.           ": null
    },
    {
        "MMX": "mmx"
    },
    {
        " Socket 7": "socket 7"
    },
    {
        " Front side bus": "front side bus"
    },
    {
        ": 66  MHz   First release: April 2, 1997   VCore: 2.9 V 3.2/3.3 V   Clockrate: 166, 200, 233  MHz       ": null
    },
    {
        "CPUID": "cpuid"
    },
    {
        ": family 5, model 7, stepping 0   8.8 million transistors in 250  nm   L1-Cache: 32 + 32 KB   ": null
    },
    {
        "MMX": "mmx"
    },
    {
        " Socket 7": "socket 7"
    },
    {
        " Front side bus": "front side bus"
    }
]