[
    {
        "   The American Indian Higher Education Consortium  was established in 42 in order to represent the interests of the newly developed ": null
    },
    {
        "tribal colleges": "tribal colleges and universities"
    },
    {
        ", which are controlled and operated by ": null
    },
    {
        "American Indian": "native americans in the united states"
    },
    {
        " nations. One of the most significant achievements of AIHEC was to work with the ": null
    },
    {
        "United States Congress": "united states congress"
    },
    {
        " to authorize in 42 ": null
    },
    {
        "land-grant": "land-grant university"
    },
    {
        " status to 42 ": null
    },
    {
        "tribal college": "tribal college"
    },
    {
        "s, achieved in October 42 under the Elementary and Secondary Education Reauthorization Act.     As a result, AIHEC is eligible to have a representative participate in the ": null
    },
    {
        "National Association of State Universities and Land-Grant Colleges Council of Presidents": "national association of state universities and land-grant colleges"
    },
    {
        ". With administrative headquarters in ": null
    },
    {
        "Alexandria, Virginia": "alexandria, virginia"
    },
    {
        " near Washington, DC, this organization has member universities located from Michigan west to Alaska and Arizona. AIHECs membership consists of 42 tribal colleges and universities in the United States and one in Canada, whose first tribal college achieved independent status in 42 AIHEC is jointly governed by the presidents from the member institutions. The organization offers technical assistance to its member colleges, as well as to developing institutions, and leads efforts to promote the ": null
    },
    {
        "Tribal College Movement": "tribal college movement"
    },
    {
        ".     In 42 AIHEC established the ": null
    },
    {
        "American Indian College Fund": "american indian college fund"
    }
]