[
    {
        "         The American League Championship Series  is a ": null
    },
    {
        "best-of-seven playoff": "Playoff Formatbest-Of-Seven Playoff"
    },
    {
        " and one of two ": null
    },
    {
        "League Championship Series": "League Championship Series"
    },
    {
        " comprising the penultimate round of ": null
    },
    {
        "Major League Baseballs": "Major League Baseball"
    },
    {
        " postseason": "Major League Baseball Postseason"
    },
    {
        ". It is contested by the winners of the two ": null
    },
    {
        "American League": "American League"
    },
    {
        " Division Series": "American League Division Series"
    },
    {
        ". The winner of the ALCS wins the AL ": null
    },
    {
        "pennant": "Pennant"
    },
    {
        " and advances to the ": null
    },
    {
        "World Series": "World Series"
    },
    {
        ", MLBs championship series, to play the winner of the ": null
    },
    {
        "National Leagues": "National League"
    },
    {
        " Championship Series": "National League Championship Series"
    },
    {
        ". The ALCS began in 1969 as a best-of-five playoff and used this format until 1985, when it changed to its current best-of-seven format.       Prior to 1969, the American League champion  was determined by the best win-loss record at the end of the regular season. There was one ad hoc ": null
    },
    {
        "single-game playoff": "List Of Major League Baseball Tie-Breakers"
    },
    {
        " held, in , due to a tie under this formulation.      The ALCS started in 1969, when the AL reorganized into two divisions, ": null
    },
    {
        "East": "American League East"
    },
    {
        " and ": null
    },
    {
        "West": "American League West"
    },
    {
        ". The winners of each division played each other in a best-of-five series to determine who would advance to the World Series. In 1985, the format changed to best-of-seven.     In 1981, a ": null
    },
    {
        "division series": "1981 National League Division Series"
    },
    {
        " was held due to a split season caused by a ": null
    },
    {
        "players strike": "1981 Major League Baseball Strike"
    },
    {
        ".     In 1994, the league was restructured into three divisions, with the three division winners and a wild-card team advancing to a best-of-five postseason round, known as the ": null
    },
    {
        "American League Division Series": "American League Division Series"
    },
    {
        " . The winners of that round then advanced to the best-of-seven ALCS. In 2012, the ": null
    },
    {
        "playoffs": "Playoff"
    },
    {
        " were expanded again so that two wild card teams face off in a one-game wild card round to determine which team advances to the division series, with the playoffs then continuing as it had before 2012 after the end of the wild card round. This is the system currently in use.     The ALCS and NLCS, since the expansion to best-of-seven, are always played in a 2–3–2 format: Games 1, 2, 6, and 7 are played in the stadium of the team that has ": null
    },
    {
        "home field advantage": "Home Field Advantage"
    },
    {
        ", and Games 3, 4, and 5 are played in the stadium of the team that does not. The series concludes when one team records its fourth win. Since 1998, home field advantage has been given to the team that has the better regular season record, unless that team happens to be the Wild Card team. In that case, the other team gets home field advantage, because by rule the Wild Card team is never allowed home field advantage in a Division Series or LCS. In the event that both teams have identical records in the regular season, home field advantage goes to the team that has the winning head-to-head record. From 1969 to 1993, home field advantage alternated between the two divisions, and from 1995 to 1997 home field advantage was determined before the season.     The ": null
    },
    {
        "Milwaukee Brewers": "Milwaukee Brewers"
    },
    {
        ", an American League team between 1969 and 1997, and the ": null
    },
    {
        "Houston Astros": "Houston Astros"
    },
    {
        ", a National League team between 1962 and 2012, are the only franchises to play in both the ALCS and NLCS. The Astros are the only team to have won both an NLCS  and an ALCS . Every current American League franchise has appeared in the ALCS.       The ": null
    },
    {
        "William Harridge Trophy": "List Of Major League Baseball Awardswilliam Harridge Trophy"
    },
    {
        " is awarded to the ALCS champion. The trophys namesake comes from the ": null
    },
    {
        "American League president": "Will Harridge"
    },
    {
        " from 1931 to 1959.  Dave , Overjoyed! , Fielders Choice Baseball Card Blog, April 10, 2009. Retrieved August 17, 2009 .       :See: League Championship Series Most Valuable Player AwardAmerican League winners    The ": null
    },
    {
        "Lee MacPhail": "Lee Macphaillee Macphail Mvp Award"
    },
    {
        " Most Valuable Player award is given to the outstanding player in the ALCS. No MVP award is given for Division Series play.     Although the National League began its LCS MVP award in 1977, the American League did not begin its LCS MVP award till 1980. The winners are listed in several locations:   in the below ALCS results table, in the Series MVP column   in the article ": null
    },
    {
        "League Championship Series Most Valuable Player Award": "League Championship Series Most Valuable Player Award"
    },
    {
        "  . MLB Advanced Media, L.P. Retrieved August 31, 2009.            Click the link on the far left for detailed information on that series.     ;Key                        In the sortable table below, teams are ordered first by number of appearances, then by number of wins, and finally by year of first appearance. In the Season column, bold years indicate winning ALCS appearances.          ": null
    }
]