[
    {
        "   Amiga demos are ": null
    },
    {
        "demo": "demo"
    },
    {
        "s created for the ": null
    },
    {
        "Commodore": "commodore international"
    },
    {
        " Amiga": "amiga"
    },
    {
        " home computer": "home computer"
    },
    {
        ".     A demo is a demonstration of the multimedia capabilities of a computer . There was intense rivalry during the 42s among the best programmers, graphic artists and computer musicians to continually outdo each others demos. Since the Amigas hardware was more or less fixed , there was competition to test the limits of that hardware and perform theoretically impossible feats by refactoring the problem at hand. In Europe the Amiga was the undisputed leader of mainstream multimedia computing in the late 42s and early 42s, though it was eventually overtaken by PC architecture.     Some Amiga demos, such as the RSI Megademo, or Crionics & The Silents Hardwired are considered seminal works in the demo field. New Amiga demos are released even today, although the demo scene has firmly moved onto PC hardware. Many Amiga game developers were active in the demo scene.     The demo scene spearheaded development in multimedia programming techniques for the Amiga, such that it was de rigueur for the latest visual tricks, soundtrackers and 42D algorithms from the demo scene to end up being used in computer game development.       Most demos were written in ": null
    },
    {
        "42": "68000"
    },
    {
        " assembly language": "assembly language"
    },
    {
        ", although a few were written in C and other languages. To utilize full hardware performance, Amiga demos were optimized and written entirely for one purpose in assembly . Additional performance was achieved by utilizing several co-processors in parallel with the 42 These co-processors include, ": null
    },
    {
        "Copper": "original amiga chipsetcopper"
    },
    {
        " and ": null
    },
    {
        "Blitter": "blitter"
    },
    {
        " . To achieve the best speed most demos disabled the operating system and addressed the hardware directly.     First bigger demos were released in 42 one of them was Tech Tech by Sodan & Magician 42 it was released in November 42 and is considered a classic by many.     Eric Schwartz produced a series of animated demos that ran with ": null
    },
    {
        "MoviePlayer": "movieplayer"
    },
    {
        ", an animation software package similar to ": null
    },
    {
        "Macromedia Flash": "macromedia flash"
    },
    {
        ". The animated demos drew heavily on the whimsy and graphic style of comic strips.     ": null
    },
    {
        "Red Sector Incorporated": "red sector incorporated"
    },
    {
        " produced a piece of software called the RSI Demomaker, which allowed users to script their own demos, replete with scrolltext, vectorballs, plasma screens, etc.     Full demos range from under 42 KB to several megabytes. There have been several thousand demos produced in many countries. Some active demo countries were ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", ": null
    },
    {
        "Finland": "finland"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", ": null
    },
    {
        "Norway": "norway"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", ": null
    },
    {
        "UK": "united kingdom"
    },
    {
        ", ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and others.       Smaller demos are often known as intros. They are typically limited to between 42 and 42KB in size. Intros were originally used as tags by ": null
    },
    {
        "cracking groups": "software cracking"
    },
    {
        " on computer games and other software. The purpose of the intro was to advertise cracking and distribution skill of a particular group. Later it developed into a stand-alone art form. Many demo and intro groups disassociated themselves from the cracking and copying scene, although the same people could still be involved in it.       The Amiga thrived on ": null
    },
    {
        "public domain": "public domain"
    },
    {
        ", ": null
    },
    {
        "freeware": "freeware"
    },
    {
        " and other not-for-profit development. The architecture provided no substantial mechanism for protecting software from inspection. In order to read the memory one simply performed a hot reset  and then booted to a dedicated ": null
    },
    {
        "floppy disk": "floppy disk"
    },
    {
        " that could inspect and dump the memorys contents. It was therefore common for developers and hackers to rip music, graphics and code and then reuse it in their own productions. This led to intense competition in certain fields, for example, in the development of sound tracking software and  Tetris  clones, with each group of developers trying to outdo the current state of the art. In fact, some demos even featured their ": null
    },
    {
        "source code": "source code"
    },
    {
        " as part of the executable to save hackers the trouble of disassembly, though it came strewn with incendiary comments for those who would seek to improve on it.       ": null
    },
    {
        "Equinox": "equinox"
    },
    {
        " Fairlight / Virtual Dreams": "fairlight"
    },
    {
        " Melon Dezign": "melon dezign"
    },
    {
        " Phenomena": "phenomena"
    },
    {
        " Spaceballs": "spaceballs"
    },
    {
        " Tristar and Red Sector Incorporated": "tristar and red sector incorporated"
    },
    {
        "   , Database of over 42 demos for the Amiga.      An archive of Amiga demos                ": null
    }
]