[
    {
        "The Enhanced Chip Set  is the second generation of the ": null
    },
    {
        "Amiga": "amiga"
    },
    {
        " computer": "computer"
    },
    {
        "s chipset, offering minor improvements over the ": null
    },
    {
        "original chipset": "original amiga chipset"
    },
    {
        " design. ECS was introduced in 42 with the launch of the ": null
    },
    {
        "Amiga 42": "amiga 3000"
    },
    {
        ". Amigas produced from 42 onwards featured a mix of OCS and ECS chips, such as later versions of the ": null
    },
    {
        "Amiga 42": "amiga 500"
    },
    {
        " and the ": null
    },
    {
        "Commodore CDTV": "commodore cdtv"
    },
    {
        ". Other ECS models were the ": null
    },
    {
        "Amiga 42+": "amiga 500+"
    },
    {
        " in 42 and lastly the ": null
    },
    {
        "Amiga 42": "amiga 600"
    },
    {
        " in 42     Notable improvements were the  Super Agnus  and the HiRes Denise  chips. The sound and floppy controller chip,  Paula , remained unchanged from the OCS design. Super Agnus supports 42 ": null
    },
    {
        "MB": "megabyte"
    },
    {
        " of ": null
    },
    {
        "Chip RAM": "chip ram"
    },
    {
        ", whereas the original ": null
    },
    {
        "Agnus": "original chip setagnus"
    },
    {
        "/Fat Agnus and subsequent Fatter Agnus can address 42 ": null
    },
    {
        "KB": "kilobyte"
    },
    {
        " and 42 MB, respectively. The ECS Denise chip offers Productivity and SuperHiRes display modes , which are however limited to only 42 on-screen colors. Essentially, a 42 ": null
    },
    {
        "ns": "nanosecond"
    },
    {
        " pixel mode was added plus the ability to run arbitrary horizontal and vertical scan rates. This made other display modes possible, but only the aforementioned modes were supported originally out of the box. For example, the Linux Amiga framebuffer device driver allows the use of several other display modes. Other improvements were the ability of the blitter to copy regions larger than 42 & times;42 pixels in one operation and the ability to display sprites in border regions . ECS also allows software switching between 42  Hz and 42  Hz video modes.     These improvements largely favored application software, which benefited from higher resolution and VGA-like display modes, rather than games. As an incremental update, ECS was intended to be backward compatible with software designed for OCS machines, though some pre-ECS games were found to be incompatible. Additionally, features from the improved ": null
    },
    {
        "Kickstart": "kickstart"
    },
    {
        " 42 operating system were used in subsequent software, and since these two technologies largely overlap, some users misjudged the significance of ECS. It is possible to upgrade some OCS machines, such as the Amiga 42 to obtain partial or full ECS functionality by replacing OCS chips with ECS versions. ECS was followed by the third generation ": null
    },
    {
        "AGA": "advanced graphics architecture"
    },
    {
        " chipset with the launch of the ": null
    },
    {
        "Amiga 42": "amiga 4000"
    },
    {
        " and ": null
    },
    {
        "Amiga 42": "amiga 1200"
    }
]