[
    {
        "     Ammianus Marcellinus  was a ": null
    },
    {
        "Roman soldier": "Roman Soldier"
    },
    {
        " and ": null
    },
    {
        "historian": "Historian"
    },
    {
        " who wrote the penultimate major historical account surviving from ": null
    },
    {
        "antiquity": "Ancient History"
    },
    {
        " . His work, known as the Res Gestae, chronicled in Latin the ": null
    },
    {
        "history of Rome": "History Of Rome"
    },
    {
        " from the accession of the Emperor ": null
    },
    {
        "Nerva": "Nerva"
    },
    {
        " in 96 to the death of ": null
    },
    {
        "Valens": "Valens"
    },
    {
        " at the ": null
    },
    {
        "Battle of Adrianople": "Battle Of Adrianople"
    },
    {
        " in 378, although only the sections covering the period 353–378 survive.          Ammianus was born in the ": null
    },
    {
        "Greek": "Koine Greek"
    },
    {
        "-speaking East, possibly in ": null
    },
    {
        "Syria": "Syria Palaestina"
    },
    {
        " or ": null
    },
    {
        "Phoenicia": "Phoenice"
    },
    {
        " in 330. His native language was most likely Greek; he learned ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " as a second language, and was probably familiar with ": null
    },
    {
        "Syriac": "Syriac Language"
    },
    {
        " as well. The surviving books of his history cover the years 353 to 378.     Ammianus served as a soldier in the army of ": null
    },
    {
        "Constantius II": "Constantius Ii"
    },
    {
        " and ": null
    },
    {
        "Julian": "Julian"
    },
    {
        " in Gaul and in the ": null
    },
    {
        "Roman–Persian Wars": "Roman–Persian Wars"
    },
    {
        ". He professes to have been a former soldier and a ": null
    },
    {
        "Greek": "Greek People"
    },
    {
        " , and his enrollment among the elite  protectores domestici  shows that he was of middle class or higher birth. Consensus is that Ammianus probably came from a curial family, but it is also possible that he was the son of a  comes Orientis  of the same family name. He entered the army at an early age, when Constantius II was emperor of the East, and was sent to serve under ": null
    },
    {
        "Ursicinus": "Ursicinus"
    },
    {
        ", governor of ": null
    },
    {
        "Nisibis": "Nisibis"
    },
    {
        " in ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    },
    {
        ", and  magister militum .        He returned with Ursicinus to Italy when Ursicinus was recalled by Constantius to begin an expedition against ": null
    },
    {
        "Claudius Silvanus": "Claudius Silvanus"
    },
    {
        ". Silvanus had been forced by the allegedly false accusations of his enemies into proclaiming himself emperor in ": null
    },
    {
        "Gaul": "Gaul"
    },
    {
        ". Ammianus campaigned in the East twice under Ursicinus. On one occasion, he became separated from the officers entourage and took refuge in ": null
    },
    {
        "Amida": "Amida"
    },
    {
        " during the ": null
    },
    {
        "siege of the city": "Siege Of Amida"
    },
    {
        " by the Sassanids under King ": null
    },
    {
        "Shapur II": "Shapur Ii"
    },
    {
        "; he barely escaped with his life.     When Ursicinus was dismissed from his military post by Constantius, Ammianus too seems to have retired from the military; however, reevaluation of his participation in ": null
    },
    {
        "Julians": "Julian"
    },
    {
        " Persian campaigns has led modern scholarship to suggest that he continued his service but did not for some reason include the period in his history.   He accompanied Julian, for whom he expresses enthusiastic admiration, in his campaigns against the ": null
    },
    {
        "Alamanni": "Alamanni"
    },
    {
        " and the ": null
    },
    {
        "Sassanids": "Sassanid Empire"
    },
    {
        ".   After Julians death, Ammianus accompanied the retreat of the new emperor, ": null
    },
    {
        "Jovian": "Jovian"
    },
    {
        ", as far as Antioch.   He was residing in Antioch in 372 when a certain ": null
    },
    {
        "Theodorus": "Theodorus"
    },
    {
        " was thought to have been identified the successor to the emperor ": null
    },
    {
        "Valens": "Valens"
    },
    {
        " by divination.   Speaking as an alleged eyewitness, Marcellinus recounts how Theodorus and several others were made to confess their deceit through the use of torture, and cruelly punished.        He eventually settled in Rome and began the Res Gestae. The precise year of his death is unknown, but scholarly consensus places it somewhere between 392 and 400 at the latest.     Modern scholarship generally describes Ammianus as a pagan who was tolerant of Christianity. Marcellinus writes of Christianity as being a pure and simple religion that demands only what is just and mild, and when he condemns the actions of Christians, he does not do so on the basis of their Christianity as such. His lifetime was marked by lengthy outbreaks of sectarian and dogmatic strife within the new state-backed faith, often with violent consequences  and these conflicts sometimes appeared unworthy to him, though it was territory where he could not risk going very far in criticism, due to the growing and volatile political connections between the church and imperial power.     He was not blind to the faults of Christians or of pagans; he observed in his Res Gestae that no wild beasts are so deadly to humans as most Christians are to each other.  and he condemns his hero Julian for excessive attachment to sacrifice, and for his edict effectively barring Christians from teaching posts.       While living in Rome in the 380s, Ammianus wrote a Latin history of the Roman empire from the accession of ": null
    },
    {
        "Nerva": "Nerva"
    },
    {
        " to the death of Valens at the ": null
    },
    {
        "Battle of Adrianople": "Battle Of Adrianople"
    },
    {
        " , in effect writing a continuation of the history of ": null
    },
    {
        "Tacitus": "Gaius Cornelius Tacitus"
    },
    {
        ". He presumably completed the work before 391, as at 22.16.12 he praises the ": null
    },
    {
        "Serapeum": "Serapeum"
    },
    {
        " in Egypt as the glory of the empire; it was in that same year the Emperor granted the temple grounds to a Christian bishop, provoking pagans into barricading themselves in the temple, plundering its contents, and torturing Christians, ultimately destroying the temple. The Res Gestae  was originally composed of thirty-one books, but the first thirteen have been lost. The surviving eighteen books cover the period from 353 to 378. It constitutes the foundation of modern understanding of the history of the fourth century Roman Empire. It is lauded as a clear, comprehensive, and generally impartial account of events by a contemporary; like many ancient historians, however, Ammianus was in fact not impartial, although he expresses an intention to be so, and had strong moral and religious prejudices. Although criticised as lacking literary merit by his early biographers, he was in fact quite skilled in rhetoric, which significantly has brought the veracity of some of the Res Gestae into question.     His work has suffered substantially from manuscript transmission. Aside from the loss of the first thirteen books, the remaining eighteen are in many places corrupt and ": null
    },
    {
        "lacunose": "Lacuna"
    },
    {
        ". The sole surviving manuscript from which almost every other is derived is a ninth-century ": null
    },
    {
        "Carolingian": "Charlemagne"
    },
    {
        " text, Vatican lat. 1873 , produced in ": null
    },
    {
        "Fulda": "Fulda"
    },
    {
        " from an insular exemplar. The only independent textual source for Ammianus lies in Fragmenta Marbugensia , another ninth-century ": null
    },
    {
        "Frankish": "Franks"
    },
    {
        " codex": "Codex"
    },
    {
        " which was taken apart to provide covers for account-books during the fifteenth century. Only six leaves of M survive; however, before this manuscript was dismantled the Abbot of Hersfeld lent the manuscript to ": null
    },
    {
        "Sigismund Gelenius": "Sigismund Gelenius"
    },
    {
        ", who used it in preparing the text of the second Froben edition . The dates and relationship of V and M were long disputed until 1936 when R. P. Robinson demonstrated persuasively that V was copied from M. As L. D. Reynolds summarizes, M is thus a fragment of the archetype; symptoms of an insular pre-archetype are evident.      His handling from his earliest printers was little better. The  editio princeps  was printed in 1474 in Rome by Georg Sachsel and Bartholomaeus Golsch, which broke off at the end of Book 26. The next edition suffered from its editors conjectures upon the poor text of the 1474 edition; the 1474 edition was pirated for the first Froben edition . It was not until 1533 that the last five books of Ammianus history were put into print by Silvanus Otmar and edited by Mariangelus Accursius. The first modern edition was produced by C.U. Clark . The first English translations were by ": null
    },
    {
        "Philemon Holland": "Philemon Holland"
    },
    {
        " in 1609, and later by ": null
    },
    {
        "C.D. Yonge": "Charles Duke Yonge"
    },
    {
        " in 1862.          ": null
    },
    {
        "Edward Gibbon": "Edward Gibbon"
    },
    {
        " judged Ammianus an accurate and faithful guide, who composed the history of his own times without indulging the prejudices and passions which usually affect the mind of a contemporary.  But he also condemned Ammianus for lack of literary flair: The coarse and undistinguishing pencil of Ammianus has delineated his bloody figures with tedious and disgusting accuracy.  Austrian historian ": null
    },
    {
        "Ernst Stein": ":De:Ernst Stein"
    },
    {
        " praised Ammianus as the greatest literary genius that the world produced between Tacitus and Dante .     According to ": null
    },
    {
        "Kimberly Kagan": "Kimberly Kagan"
    },
    {
        ", his accounts of battles emphasize the experience of the soldiers but at the cost of ignoring the bigger picture. As a result, it is difficult for the reader to understand why the battles he describes had the outcome they did.     Ammianus work contains a detailed description of the ": null
    },
    {
        "tsunami": "365 Crete Earthquake"
    },
    {
        " in Alexandria which devastated the metropolis and the shores of the eastern Mediterranean on 21 July 365. His report describes accurately the characteristic sequence of earthquake, retreat of the sea and sudden giant wave.       ": null
    }
]