[
    {
        "Amos Bronson Alcott  was an American ": null
    },
    {
        "teacher": "teacher"
    },
    {
        ", writer, ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        ", and ": null
    },
    {
        "reformer": "reform movement"
    },
    {
        ". As an educator, Alcott pioneered new ways of interacting with young students, focusing on a conversational style, and avoided traditional punishment. He hoped to perfect the human spirit and, to that end, advocated a ": null
    },
    {
        "vegan": "veganism"
    },
    {
        " diet before the term was coined. He was also an ": null
    },
    {
        "abolitionist": "abolitionism in the united states"
    },
    {
        " and an advocate for ": null
    },
    {
        "womens rights": "womens rights"
    },
    {
        ".     Born in ": null
    },
    {
        "Wolcott, Connecticut": "wolcott, connecticut"
    },
    {
        " in 1799, Alcott had only minimal formal schooling before attempting a career as a traveling salesman. Worried about how the itinerant life might have a negative impact on his soul, he turned to teaching. His innovative methods, however, were controversial, and he rarely stayed in one place very long. His most well-known teaching position was at the ": null
    },
    {
        "Temple School": "temple school, boston"
    },
    {
        " in Boston. His experience there was turned into two books: Records of a School and Conversations with Children on the Gospels. Alcott became friends with ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        " and became a major figure in ": null
    },
    {
        "transcendentalism": "transcendentalism"
    },
    {
        ". His writings on behalf of that movement, however, are heavily criticized for being incoherent. Based on his ideas for human perfection, Alcott founded ": null
    },
    {
        "Fruitlands": "fruitlands"
    },
    {
        ", a transcendentalist experiment in community living. The project was short-lived and failed after seven months. Alcott continued to struggle financially for most of his life. Nevertheless, he continued focusing on educational projects and opened a new school at the end of his life in 1879. He died in 1888.     Alcott married ": null
    },
    {
        "Abby May": "abby may"
    },
    {
        " in 1830 and they eventually had four surviving children, all daughters. Their second was ": null
    },
    {
        "Louisa May": "louisa may alcott"
    },
    {
        ", who fictionalized her experience with the family in her novel  Little Women  in 1868.           A native ": null
    },
    {
        "New England": "new england"
    },
    {
        "er, Amos Bronson Alcott was born in ": null
    },
    {
        "Wolcott, Connecticut": "wolcott, connecticut"
    },
    {
        " on November 29, 1799.  His parents were Joseph Chatfield Alcott and Anna Bronson Alcott. The family home was in an area known as Spindle Hill, and his father, Joseph Alcox, traced his ancestry to colonial-era settlers in eastern ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ". The family originally spelled their name Alcock , later changed to Alcocke then Alcox . Amos Bronson, the oldest of eight children, later changed the spelling to Alcott and dropped his first name.    At age six, young Bronson began his formal education in a one-room schoolhouse in the center of town but learned how to read at home with the help of his mother.  The school taught only reading, writing, and spelling and he left this school at the age of 10.  At age 13, his uncle, Reverend Tillotson Bronson, invited Alcott into his home in ": null
    },
    {
        "Cheshire, Connecticut": "cheshire, connecticut"
    },
    {
        ", to be educated and prepared for college. Bronson gave it up after only a month  and was self-educated from then on.  He was not particularly social and his only close friend was his neighbor and second cousin ": null
    },
    {
        "William Alcott": "william alcott"
    },
    {
        ", with whom he shared books and ideas.  Bronson Alcott later reflected on his childhood at Spindle Hill: It kept me pure... I dwelt amidst the hills... God spoke to me while I walked the fields.  Starting at age 15, he took a job working for clockmaker ": null
    },
    {
        "Seth Thomas": "seth thomas"
    },
    {
        "  in the nearby town of ": null
    },
    {
        "Plymouth": "plymouth, connecticut"
    },
    {
        ".      At age 17, Alcott passed the exam for a teaching certificate but had trouble finding work as a teacher. Instead, he left home and became a traveling salesman in the ": null
    },
    {
        "American South": "southern united states"
    },
    {
        ", peddling books and merchandise. He hoped the job would earn him enough money to support his parents, to make their cares, and burdens less... and get them free from debt , though he soon spent most of his earnings on a new suit.  At first, he thought it an acceptable occupation but soon worried about his spiritual well-being. In March 1823, Alcott wrote to his brother: Peddling is a hard place to serve God, but a capital one to serve ": null
    },
    {
        "Mammon": "mammon"
    },
    {
        ".  Near the end of his life, he fictionalized this experience in his book, New Connecticut, originally circulated only among friends before its publication in 1881.           By the summer of 1823, Alcott returned to Connecticut in debt to his father, who bailed him out after his last two unsuccessful sales trips.  He took a job as a schoolteacher in Cheshire with the help of his Uncle Tillotson.  He quickly set about reforming the school. He added backs to the benches on which students sat, improved lighting and heating, de-emphasized ": null
    },
    {
        "rote learning": "rote learning"
    },
    {
        ", and provided individual ": null
    },
    {
        "slates": "slate"
    },
    {
        " to each student—paid for by himself.  Alcott had been influenced by ": null
    },
    {
        "educational philosophy": "educational philosophy"
    },
    {
        " of the ": null
    },
    {
        "Swiss": "swiss"
    },
    {
        " pedagogue": "pedagogue"
    },
    {
        " Johann Heinrich Pestalozzi": "johann heinrich pestalozzi"
    },
    {
        " and even renamed his school The Cheshire Pestalozzi School . His style attracted the attention of ": null
    },
    {
        "Samuel Joseph May": "samuel joseph may"
    },
    {
        ", who introduced Alcott to his sister ": null
    },
    {
        "Abby May": "abby may"
    },
    {
        ". She called him, an intelligent, philosophic, modest man and found his views on education very attractive . Locals in Cheshire were less supportive and became suspicious of his methods. Many students left and were enrolled in the local common school or a recently re-opened private school for boys.  On November 6, 1827, Alcott started teaching in ": null
    },
    {
        "Bristol, Connecticut": "bristol, connecticut"
    },
    {
        ", still using the same methods he used in Cheshire, but opposition from the community surfaced quickly;  he was unemployed by March 1828.  He moved to Boston on April 24, 1828, and was immediately impressed, referring to the city as a place where the light of the sun of righteousness has risen .  He opened the Salem Street Infant School two months later on June 23.  Abby May applied as his teaching assistant; instead, the couple were engaged, without consent of the family.  They were married at ": null
    },
    {
        "Kings Chapel": "kings chapel"
    },
    {
        " on May 22, 1830; he was 30 years old and she was 29.  Her brother conducted the ceremony and a modest reception followed at her fathers house.  After their marriage the Alcotts moved to 12 Franklin Street in Boston, a ": null
    },
    {
        "boarding house": "boarding house"
    },
    {
        " run by a Mrs. Newall.  Around this time, Alcott also first expressed his public disdain for ": null
    },
    {
        "slavery": "slavery"
    },
    {
        ". In November 1830, he and ": null
    },
    {
        "William Lloyd Garrison": "william lloyd garrison"
    },
    {
        " founded what he later called a preliminary Anti-Slavery Society , though he differed from Garrison as a ": null
    },
    {
        "nonresistant": "nonresistance"
    },
    {
        ". Perry, Lewis. Radical Abolitionism: Anarchy and the Government of God in Antislavery Thought. University of Tennessee Press, 1995: 81. Alcott became a member of the ": null
    },
    {
        "Boston Vigilance Committee": "boston vigilance committee"
    },
    {
        ".     Attendance at Alcotts school was falling. A wealthy ": null
    },
    {
        "Quaker": "religious society of friends"
    },
    {
        " named Reuben Haines proposed he and educator William Russell start a new school in Pennsylvania associated with the ": null
    },
    {
        "Germantown Academy": "germantown academy"
    },
    {
        ". Alcott accepted and he and his newly pregnant wife set forth on December 14.  The school was established in ": null
    },
    {
        "Germantown": "germantown, philadelphia, pennsylvania"
    },
    {
        "  and the Alcotts were offered a rent-free home by Haines. Alcott and Russell were initially concerned that the area would not be conducive to their progressive approach to education and considered establishing the school in nearby ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        " instead. Unsuccessful, they went back to Germantown, though the rent-free home was no longer available and the Alcotts instead had to rent rooms in a boarding-house.  It was there that their first child, a daughter they named ": null
    },
    {
        "Anna Bronson Alcott": "anna alcott pratt"
    },
    {
        ", was born on March 16, 1831, after 36 hours of labor. By the fall of that year, their benefactor Haines died suddenly and the Alcotts again suffered financial difficulty. We hardly earn the bread , wrote Abby May to her brother, the butter we have to think about.      The couples only son was born on April 6, 1839, but lived only a few minutes. The mother recorded: Gave birth to a fine boy full grown perfectly formed but not living .  It was in Germantown that the couples second daughter was born. ": null
    },
    {
        "Louisa May Alcott": "louisa may alcott"
    },
    {
        " was born on her fathers birthday, November 29, 1832, at a half-hour past midnight.  Bronson described her as a very fine healthful child, much more so than Anna was at birth .  The Germantown school, however, was faltering; soon only eight pupils remained.  Their benefactor Haines died before Louisas birth. He had helped recruit students and even paid tuition for some of them. As Abby wrote, his death has prostrated all our hopes here .  On April 10, 1833, the family moved to Philadelphia, where Alcott ran a day school. As usual, Alcotts methods were controversial; a former student later referred to him as the most eccentric man who ever took on himself to train and form the youthful mind.  Alcott began to believe Boston was the best place for his ideas to flourish. He contacted theologian ": null
    },
    {
        "William Ellery Channing": "william ellery channing"
    },
    {
        " for support. Channing approved of Alcotts methods and promised to help find students to enroll, including his daughter Mary. Channing also secured aid from Justice ": null
    },
    {
        "Lemuel Shaw": "lemuel shaw"
    },
    {
        " and Boston mayor ": null
    },
    {
        "Josiah Quincy, Jr.": "josiah quincy, jr."
    },
    {
        "        On September 22, 1834, Alcott opened a school of about 30 students, mostly from wealthy families.  It was named the ": null
    },
    {
        "Temple School": "temple school, boston"
    },
    {
        " because classes were held at the ": null
    },
    {
        "Masonic Temple": "masonic temple"
    },
    {
        " on Tremont Street in Boston.  His assistant was ": null
    },
    {
        "Elizabeth Palmer Peabody": "elizabeth palmer peabody"
    },
    {
        ", later replaced by ": null
    },
    {
        "Margaret Fuller": "margaret fuller"
    },
    {
        ". ": null
    },
    {
        "Mary Peabody Mann": "mary peabody mann"
    },
    {
        " served as a French instructor for a time.  The school was briefly famous, and then infamous, because of his original methods. Before 1830, writing equated to rote drills in the rules of grammar, spelling, vocabulary, penmanship and transcription of adult texts. However, in that decade, progressive reformers such as Alcott, influenced by Pestalozzi as well as ": null
    },
    {
        "Friedrich Fröbel": "friedrich fröbel"
    },
    {
        " and ": null
    },
    {
        "Johann Friedrich Herbart": "johann friedrich herbart"
    },
    {
        ", began to advocate writing about subjects from students personal experiences. Reformers debated against beginning instruction with rules and were in favor of helping students learn to write by expressing the personal meaning of events within their own lives. Alcotts plan was to develop self-instruction on the basis of self-analysis, with an emphasis on conversation and questioning rather than lecturing and drill, which were prevalent in the U.S. classrooms of the time. Alongside writing and reading, he gave lessons in spiritual culture , which included interpretation of the ": null
    },
    {
        "Gospel": "gospel"
    },
    {
        "s, and advocated object teaching in writing instruction.  He even went so far as to decorate his schoolroom with visual elements he thought would inspire learning: paintings, books, comfortable furniture, and busts or portraits of ": null
    },
    {
        "Plato": "plato"
    },
    {
        ", ": null
    },
    {
        "Socrates": "socrates"
    },
    {
        ", ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        ", and William Ellery Channing.     During this time, the Alcotts had another child. Born on June 24, 1835, she was named ": null
    },
    {
        "Elizabeth Peabody Alcott": "elizabeth sewall alcott"
    },
    {
        " in honor of the teaching assistant at the Temple School.  By age three, however, her mother changed her name to Elizabeth Sewall Alcott, after her own mother.         In July 1835, Peabody published her account as an assistant to the Temple School as Record of a School: Exemplifying the General Principles of Spiritual Culture. While working on a second book, Alcott and Peabody had a falling out and Conversations with Children on the Gospels was prepared with help from Peabodys sister ": null
    },
    {
        "Sophia": "sophia peabody"
    },
    {
        ",  published at the end of December 1836. Alcotts methods were not well received; many found his conversations on the Gospels close to blasphemous. For example, he asked students to question if Biblical miracles were literal and suggested that all people are part of God.  In the  Boston Daily Advertiser , ": null
    },
    {
        "Nathan Hale": "nathan hale"
    },
    {
        " criticized Alcotts flippant and off hand conversation about serious topics from the ": null
    },
    {
        "Virgin birth of Jesus": "virgin birth of jesus"
    },
    {
        " to ": null
    },
    {
        "circumcision": "circumcision"
    },
    {
        ".  ": null
    },
    {
        "Joseph T. Buckingham": "joseph t. buckingham"
    },
    {
        " called Alcott either insane or half-witted and an ignorant and presuming ": null
    },
    {
        "charlatan": "charlatan"
    },
    {
        " .  The book did not sell well; a Boston lawyer bought 750 copies to use as waste paper.      The temple school was widely denounced in the press. Reverend ": null
    },
    {
        "James Freeman Clarke": "james freeman clarke"
    },
    {
        " was one of Alcotts few supporters and defended him against the harsh response from Boston periodicals.  Alcott was rejected by most public opinion and, by the summer of 1837, he had only 11 students left and no assistant after Margaret Fuller moved to ": null
    },
    {
        "Providence, Rhode Island": "providence, rhode island"
    },
    {
        ".  The controversy had caused many parents to remove their children and, as the school closed, Alcott became increasingly financially desperate. Remaining steadfast to his pedagogy, a forerunner of ": null
    },
    {
        "progressive": "progressive education"
    },
    {
        " and ": null
    },
    {
        "democratic school": "democratic school"
    },
    {
        "ing, he alienated parents in a later parlor school by admitting an ": null
    },
    {
        "African American": "african american"
    },
    {
        " child to the class, whom he then refused to expel in the face of protests.       Beginning in 1836, Alcotts membership in the ": null
    },
    {
        "Transcendental Club": "transcendental club"
    },
    {
        " put him in such company as ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        ", ": null
    },
    {
        "Orestes Brownson": "orestes brownson"
    },
    {
        " and ": null
    },
    {
        "Theodore Parker": "theodore parker"
    },
    {
        ". Buell, Lawrence. Emerson. Cambridge, Massachusetts: The Belknap Press of Harvard University Press, 2003: 32–33.  He became a member with the Clubs second meeting and hosted their third. A biographer of Emerson described the group as the occasional meetings of a changing body of liberal thinkers, agreeing in nothing but their liberality .  ": null
    },
    {
        "Frederic Henry Hedge": "frederic henry hedge"
    },
    {
        " wrote of the groups nature: There was no club in the strict sense... only occasional meetings of like-minded men and women . Alcott preferred the term Symposium for their group.      In late April 1840, Alcott moved to the town of ": null
    },
    {
        "Concord": "concord, massachusetts"
    },
    {
        "  urged by Emerson. He rented a home for $50 a year within walking distance of ": null
    },
    {
        "Emersons house": "ralph waldo emerson house"
    },
    {
        "; he named it Dove Cottage,  though they also called it Concordia Cottage.  A supporter of Alcotts philosophies, Emerson offered to help with his writing, which proved a difficult task. After several revisions, for example, he deemed the essay Psyche unpublishable.  Alcott also wrote a series patterned after the work of German writer ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        " which were eventually published in the Transcendentalists journal,  The Dial . Emerson wrote to Margaret Fuller, then editor, that they might pass muster & even pass for just & great . He was wrong. Alcotts so-called ": null
    },
    {
        "Orphic": "orphism"
    },
    {
        " Sayings were widely mocked for being silly and unintelligible; Fuller herself disliked them, but did not want to hurt Alcotts feelings.  In the first issue, for example, he wrote:        On July 26, 1840, Abby May gave birth again. Originally referred to as Baby for several months, she was eventually named ": null
    },
    {
        "Abby May": "may alcott"
    },
    {
        " after her mother.  As a teenager, she changed the spelling of her name to Abbie before choosing to use only May .      With financial support from Emerson,  Alcott left Concord on May 8, 1842, to a visit to England, leaving his brother Junius with his family.  He met two admirers, ": null
    },
    {
        "Charles Lane": "charles lane"
    },
    {
        " and Henry C. Wright.  The two men were leaders of ": null
    },
    {
        "Alcott House": "alcott house"
    },
    {
        ", an experimental school based on Alcotts methods from the Temple School located about ten miles outside London. The schools founder, James Pierpont Greaves, had only recently died but Alcott was invited to stay there for a week.  Alcott persuaded them to come to the United States with him; Lane and his son moved into the Alcott house and helped with family chores.  Persuaded in part by Lanes ": null
    },
    {
        "abolitionist views": "abolitionism in the united states"
    },
    {
        ", Alcott took a stand against the ": null
    },
    {
        "John Tyler": "john tyler"
    },
    {
        " administrations plan to annex ": null
    },
    {
        "Texas": "texas"
    },
    {
        " as a slave territory and ": null
    },
    {
        "refused to pay": "tax resistance"
    },
    {
        " his ": null
    },
    {
        "poll tax": "tax per head"
    },
    {
        ". Abby May wrote in her journal on January 17, 1843, A day of some excitement, as Mr. Alcott refused to pay his town tax... After waiting some time to be committed he was told it was paid by a friend. Thus we were spared the affliction of his absence and the triumph of suffering for his principles.  The annual poll tax was only $1.50.  The incident inspired ": null
    },
    {
        "Henry David Thoreau": "henry david thoreau"
    },
    {
        ", whose similar protest led to a night in jail and his essay ": null
    },
    {
        "Civil Disobedience": "civil disobedience"
    },
    {
        " .  Around this time, the Alcott family set up a sort of domestic post office to curb potential domestic tension. Abby May described her idea: I thought it would afford a daily opportunity for the children, indeed all of us, to interchange thought and sentiment .              Lane and Alcott collaborated on a major expansion of their educational theories into a ": null
    },
    {
        "Utopia": "utopia"
    },
    {
        "n society. Alcott, however, was still in debt and could not purchase the land needed for their planned community. In a letter, Lane wrote, I do not see anyone to act the money part but myself.  In May 1843, he purchased a  farm in ": null
    },
    {
        "Harvard, Massachusetts": "harvard, massachusetts"
    },
    {
        ".  Up front, he paid $1,500 of the total $1,800 value of the property; the rest was meant to be paid by the Alcotts over a two-year period.  They moved to the farm on June 1 and optimistically named it Fruitlands despite only ten old apple trees on the property. In July, Alcott announced their plans in The Dial: We have made an arrangement with the proprietor of an estate of about a hundred acres, which liberates this tract from human ownership .     Their goal was to regain access to ": null
    },
    {
        "Eden": "garden of eden"
    },
    {
        " by finding the correct formula for perfect living, following specific rules governing agriculture, diet, and reproduction.  In order to achieve this, they removed themselves from the economy as much as possible and lived independently;  unlike a similar project named ": null
    },
    {
        "Brook Farm": "brook farm"
    },
    {
        ", the participants at Fruitlands avoided interaction with local communities.  Calling themselves a consociate family , they agreed to follow a strict vegetarian diet and to till the land without the use of animal labor. After some difficulty, they relented and allowed some cattle to be enslaved .  They also banned coffee, tea, alcoholic drinks, milk, and warm bathwater.  They only ate aspiring vegetables —those which grew upward—and refused those that grew downward like potatoes. As Alcott had published earlier, Our wine is water,—flesh, bread;—drugs, fruits.  For clothing, they prohibited leather because animals were killed for it, as well as cotton, silk, and wool, because they were products of slave labor. Alcott had high expectations but was often away when the community most needed him as he attempted to recruit more members.      The experimental community was never successful, partly because most of the land was not ": null
    },
    {
        "arable": "arable land"
    },
    {
        ". Delano, Sterling F. Brook Farm: The Dark Side of Utopia. Cambridge, Massachusetts: The Belknap Press of Harvard University Press, 2004: 118.  Alcott lamented, None of us were prepared to actualize practically the ideal life of which we dreamed. So we fell apart .  Its founders were often away as well; in the middle of harvesting, they left for a lecture tour through ": null
    },
    {
        "Providence, Rhode Island": "providence, rhode island"
    },
    {
        ", New York City, and ": null
    },
    {
        "New Haven, Connecticut": "new haven, connecticut"
    },
    {
        ".  In its seven months, only 13 people joined, included the Alcotts and Lanes.  Other than Abby May and her daughters, only one other woman joined, Ann Page. One rumor is that Page was asked to leave after eating a fish tail with a neighbor.  Lane believed Alcott had misled him into thinking enough people would join the enterprise and developed a strong dislike for the ": null
    },
    {
        "nuclear family": "nuclear family"
    },
    {
        ". He quit the project and moved to a nearby ": null
    },
    {
        "Shaker": "shakers"
    },
    {
        " family with his son.  After Lanes departure, Alcott fell into a depression and could not speak or eat for three days.  Abby May thought Lane purposely sabotaged her family. She wrote to her brother, All Mr. Lanes efforts have been to disunite us. But Mr. Alcotts ... paternal instincts were too strong for him.  When the final payment on the farm was owed, Sam May refused to cover his brother-in-laws debts, as he often did, possibly at Abby Mays suggestion.  The experiment failed, the Alcotts had to leave Fruitlands.     The members of the Alcott family were not happy with their Fruitlands experience. At one point, Abby May threatened that she and their daughters would move elsewhere, leaving Bronson behind.  Louisa May Alcott, who was ten years old at the time, later wrote of the experience in Transcendental Wild Oats : The band of brothers began by spading garden and field; but a few days of it lessened their ardor amazingly.           In January 1844, Alcott moved his family to Still River, a village within Harvard Ehrlich, Eugene and Carruth, Gorton. The Oxford Illustrated Literary Guide to the United States. New York: Oxford University Press, 1982: 62.  but, on March 1, 1845, the family returned to Concord to live in a home they named The Hillside .  Both Emerson and Sam May assisted in securing the home for the Alcotts.  While living in the home, Louisa began writing in earnest and was given her own room.  She later said her years at the home were the happiest years of her life; many of the incidents in her novel  Little Women  are based on this period.  Alcott renovated the property, moving a barn and painting the home a rusty olive color, as well as tending to over six acres of land.  On May 23, 1845, Abby May was granted a sum from her fathers estate which was put into a trust fund, granting minor financial security. That summer, Bronson Alcott let ": null
    },
    {
        "Henry David Thoreau": "henry david thoreau"
    },
    {
        " borrow his ax to prepare his home at ": null
    },
    {
        "Walden Pond": "walden pond"
    },
    {
        ".      The Alcotts hosted a steady stream of visitors at The Hillside,  including fugitive slaves, which they hosted in secret as a station of the ": null
    },
    {
        "Underground Railroad": "underground railroad"
    },
    {
        ".  Alcotts opposition to slavery also fueled his opposition to the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        " which began in 1846. He considered the war a blatant attempt to extend slavery and asked if the country was made up of a people bent on conquest, on getting the golden treasures of Mexico into our hands, and of subjugating foreign peoples?      In 1848, Abby May insisted they leave Concord, which she called cold, heartless, brainless, soulless . The Alcott family put The Hillside up for rent and moved to Boston.  There, next door to Peabodys book store on West Street, Bronson Alcott hosted a series based on the Conversations model by Margaret Fuller called A Course on the Conversations on Man—his History, Resources, and Expectations . Participants, both men and women, were charged three dollars to attend or five dollars for all seven lectures.  In March 1853, Alcott was invited to teach fifteen students at ": null
    },
    {
        "Harvard Divinity School": "harvard divinity school"
    },
    {
        " in an extracurricular, non-credit course.      Alcott and his family moved back to Concord after 1857, where he and his family lived in the ": null
    },
    {
        "Orchard House": "orchard house"
    },
    {
        " until 1877. In 1860, Alcott was named superintendent of Concord Schools.           Alcott voted in a presidential election for the first time in 1860. In his journal for November 6, 1860, he wrote: At Town House, and cast my vote for ": null
    },
    {
        "Lincoln": "abraham lincoln"
    },
    {
        " and the Republican candidates generally—the first vote I ever cast for a President and State officers.  Alcott was an abolitionist and a friend of the more radical William Lloyd Garrison.  He had attended a rally led by ": null
    },
    {
        "Wendell Phillips": "wendell phillips"
    },
    {
        " on behalf of 17-year-old ": null
    },
    {
        "Thomas Sims": "thomas sims"
    },
    {
        ", a fugitive slave on trial in Boston. Alcott was one of several who attempted to storm the courthouse; when gunshots were heard, he was the only one who stood his ground, though the effort was unsuccessful.  He had also stood his ground in a protest against the trial of ": null
    },
    {
        "Anthony Burns": "anthony burns"
    },
    {
        ". A group had broken down the door of the Boston courthouse but guards beat them back. Alcott stood forward and asked the leader of the group, ": null
    },
    {
        "Thomas Wentworth Higginson": "thomas wentworth higginson"
    },
    {
        ", Why are we not within? He then walked calmly into the courthouse, was threatened with a gun, and turned back, but without hastening a step , according to Higginson.      In 1862, Louisa moved to ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        " to volunteer as a nurse. On January 14, 1863, the Alcotts received a telegram that Louisa was sick; Bronson immediately went to bring her home, briefly meeting Abraham Lincoln while there.  Louisa turned her experience into the book  Hospital Sketches . Her father wrote of it, I see nothing in the way of a good appreciation of Louisas merits as a woman and a writer.      Henry David Thoreau died on May 6, 1862,  likely from an illness he caught from Alcott two years earlier.    At Emersons request, Alcott helped arrange Thoreaus funeral, which was held at First Parish Sanctuary in Concord,  despite Thoreau having disavowed membership in the church when he was in his early twenties.  Emerson wrote a eulogy,  and Alcott helped plan the preparations. Only two years later, neighbor Nathaniel Hawthorne died as well. Alcott served as a pallbearer along with ": null
    },
    {
        "Louis Agassiz": "louis agassiz"
    },
    {
        ", ": null
    },
    {
        "James Thomas Fields": "james thomas fields"
    },
    {
        ", ": null
    },
    {
        "Oliver Wendell Holmes, Sr.": "oliver wendell holmes, sr."
    },
    {
        ", ": null
    },
    {
        "Henry Wadsworth Longfellow": "henry wadsworth longfellow"
    },
    {
        ", and others.  With Hawthornes death, Alcott worried that few of the Concord notables remained. He recorded in his journal: Fair figures one by one are fading from sight.  The next year, Lincoln was assassinated, which Alcott called appalling news .      In 1868, Alcott met with publisher Thomas Niles, an admirer of Hospital Sketches. Alcott asked Niles if he would publish a book of short stories by his daughter; instead, he suggested she write a book about girls. Louisa May was not interested initially but agreed to try. Madison, Charles A. Irving to Irving: Author-Publisher Relations 1800–1974. New York: R. R. Bowker Company, 1974: 36. . They want a book of 200 pages or more , Alcott told his daughter.  The result was Little Women, published later that year. The book, which fictionalized the Alcott family during the girls coming-of-age years, recast the father figure as a chaplain, away from home at the front in the ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        ".     Alcott spoke, as opportunity arose, before the ": null
    },
    {
        "lyceums": "lyceum"
    },
    {
        " then common in various parts of the United States, or addressed groups of hearers as they invited him. These conversations as he called them, were more or less informal talks on a great range of topics, spiritual, aesthetic and practical, in which he emphasized the ideas of the school of American Transcendentalists led by Emerson, who was always his supporter and discreet admirer. He often discussed Platonic philosophy, the illumination of the mind and soul by direct communion with Spirit; upon the spiritual and poetic monitions of external nature; and upon the benefit to man of a serene mood and a simple way of life.           Alcotts published books, all from late in his life, include Tablets , Concord Days , New Connecticut , and Sonnets and Canzonets . Louisa May attended to her fathers needs in his final years. She purchased a house for her sister Anna which had been the last home of Henry David Thoreau, now known as the ": null
    },
    {
        "Thoreau-Alcott House": "thoreau-alcott house"
    },
    {
        ". Ehrlich, Eugene and Gorton Carruth. The Oxford Illustrated Literary Guide to the United States. New York: Oxford University Press, 1982: 45.  Louisa and her parents moved in with Anna as well.      After the death of his wife Abby May on November 25, 1877, Alcott never returned to Orchard House, too heartbroken to live there. He and Louisa May collaborated on a memoir and went over her papers, letters, and journals. My heart bleeds with the memories of those days , he wrote, and even long years, of cheerless anxiety and hopeless dependence.  Louisa noted her father had become restless with his anchor gone .  They gave up on the memoir project and Louisa burned many of her mothers papers.      On January 19, 1879, Alcott and ": null
    },
    {
        "Franklin Benjamin Sanborn": "franklin benjamin sanborn"
    },
    {
        " wrote a prospectus for a new school which they distributed to potentially interested people throughout the country.  The result was the ": null
    },
    {
        "Concord School of Philosophy": "concord school of philosophy"
    },
    {
        " and Literature, which held its first session in 1879 in Alcotts study in the ": null
    },
    {
        "Orchard House": "orchard house"
    },
    {
        ". In 1880 the school moved to the Hillside Chapel, a building next to the house, where he held conversations and, over the course of successive summers, as he entered his eighties, invited others to give lectures on themes in philosophy, religion and letters. The school, considered one of the first formal adult education centers in America, was also attended by foreign scholars. It continued for nine years.     In April 1882, Alcotts friend and benefactor Ralph Waldo Emerson was sick and bedridden. After visiting him, Alcott wrote, Concord will be shorn of its human splendor when he withdraws behind the cloud. Emerson died the next day.  Alcott himself moved out of Concord for his final years, settling at 10 Louisburg Square in Boston beginning in 1885. Wilson, Susan. The Literary Trail of Greater Boston. Beverly, Massachusetts: Commonwealth Editions, 2005: 57.      As he was bedridden at the end of his life, Alcotts daughter Louisa May came to visit him at Louisburg on March 1, 1888. He said to her, I am going up. Come with me. She responded, I wish I could.  He died three days later on March 4; Louisa May died only two days after her father.       Alcott was fundamentally and philosophically opposed to ": null
    },
    {
        "corporal punishment": "school corporal punishment"
    },
    {
        " as a means of disciplining his students. Instead, beginning at the Temple School, he would appoint a daily student superintendent. When that student observed an infraction, he or she reported it to the rest of the class and, as a whole, they deliberated on punishment.  At times, Alcott offered his own hand for an offending student to strike, saying that any failing was the teachers responsibility. The shame and guilt this method induced, he believed, was far superior to the fear instilled by corporal punishment; when he used physical correction he required that the students be unanimously in support of its application, even including the student to be punished.     The most detailed discussion of his theories on education is in an essay, Observations on the Principles and Methods of Infant Instruction . Alcott believed that early education must draw out unpremeditated thoughts and feelings of the child and emphasized that infancy should primarily focus on enjoyment.  He noted that learning was not about the acquisition of facts but the development of a reflective state of mind.      Alcotts ideas as an educator were controversial. Writer ": null
    },
    {
        "Harriet Martineau": "harriet martineau"
    },
    {
        ", for example, wrote dubiously that, the master presupposes his little pupils possessed of all truth; and that his business is to bring it out into expression .  Even so, his ideas helped to found one of the first adult education centers in America, and provided the foundation for future generations of liberal education. Many of Alcotts educational principles are still used in classrooms today, including teach by encouragement , art education, music education, acting exercises, learning through experience, risk-taking in the classroom, tolerance in schools, physical education/recess, and early childhood education. The teachings of William Ellery Channing a few years earlier had also laid the groundwork for the work of most of the Concord Transcendentalists.     The Concord School of Philosophy, which closed following Alcotts death in 1888, was reopened almost 90 years later in the 1970s. It has continued functioning with a Summer Conversational Series in its original building at Orchard House, now run by the Louisa May Alcott Memorial Association.     While many of Alcotts ideas continue to be perceived as being on the liberal/radical edge, they are still common themes in society, including vegetarian/": null
    },
    {
        "veganism": "veganism"
    },
    {
        ", sustainable living, and temperance/self-control. Alcott described his sustenance as a Pythagorean diet : meat, eggs, butter, cheese, and milk were excluded and drinking was confined to well water.  Alcott believed that diet held the key to human perfection and connected physical well-being to mental improvement. He further viewed a perfection of nature to the spirit and, in a sense, predicted modern ": null
    },
    {
        "environmentalism": "environmentalism"
    },
    {
        " by condemning ": null
    },
    {
        "pollution": "pollution"
    },
    {
        " and encouraging humankinds role in sustaining ecology.           Alcotts philosophical teachings have been criticized as inconsistent, hazy or abrupt. He formulated no system of philosophy, and shows the influence of ": null
    },
    {
        "Plato": "plato"
    },
    {
        ", German ": null
    },
    {
        "mysticism": "mysticism"
    },
    {
        ", and ": null
    },
    {
        "Immanuel Kant": "immanuel kant"
    },
    {
        " as filtered through the writings of ": null
    },
    {
        "Samuel Taylor Coleridge": "samuel taylor coleridge"
    },
    {
        ".  Margaret Fuller referred to Alcott as a philosopher of the balmy times of ": null
    },
    {
        "ancient Greece": "ancient greece"
    },
    {
        "—a man whom the worldlings of Boston hold in as much horror as the worldlings of Athens held ": null
    },
    {
        "Socrates": "socrates"
    },
    {
        ". Nelson, Randy F. . The Almanac of American Letters. Los Altos, California: William Kaufmann, Inc., 1981: 152.  In his later years, Alcott related a story from his boyhood: during a total ": null
    },
    {
        "solar eclipse": "solar eclipse"
    },
    {
        ", he threw rocks at the sky until he fell and dislocated his shoulder. He reflected that the event was a prophecy that he would be tilting at the sun and always catching the fall .      Like Emerson, Alcott was always optimistic, idealistic, and individualistic in thinking. Writer ": null
    },
    {
        "James Russell Lowell": "james russell lowell"
    },
    {
        " referred to Alcott in his poem Studies for Two Heads as an angel with clipped wings . Even so, Emerson noted that Alcotts brilliant conversational ability did not translate into good writing. When he sits down to write, Emerson wrote, all his genius leaves him; he gives you the shells and throws away the kernel of his thought. His Orphic Sayings , published in The Dial, became famous for their hilarity as dense, pretentious, and meaningless. In New York, for example,  The Knickerbocker  published a parody titled Gastric Sayings in November 1840. A writer for the Boston Post referred to Alcotts Orphic Sayings as a train of fifteen railroad cars with one passenger .     Modern critics often fault Alcott for not being able to financially support his family. Alcott himself worried about his own prospects as a young man, once writing to his mother that he was still at my old trade—hoping.  Alcott held his principles above his well-being. Shortly before his marriage, for example, his future father-in-law Colonel Joseph May helped him find a job teaching at a school in Boston run by the Society of Free Enquirers, followers of ": null
    },
    {
        "Robert Owen": "robert owen"
    },
    {
        ", for a lucrative $1,000 to $1,200 annual salary. He refused it because he did not agree with their beliefs, writing, I shall have nothing to do with them.      From the other perspective, Alcotts unique teaching ideas created an environment which produced two famous daughters in different fields in a time when women were not commonly encouraged to have independent careers.       Observations on the Principles and Methods of Infant Instruction      Conversations with Children on the Gospels   Conversations with Children on the Gospels      Concord Days   Table-Talk      Sonnets and Canzonets      The Journals of Bronson Alcott": null
    }
]