[
    {
        "      The amphisbaena  is a ": null
    },
    {
        "mythological": "mythological"
    },
    {
        ", ": null
    },
    {
        "ant": "ant"
    },
    {
        "-eating ": null
    },
    {
        "serpent": "serpent"
    },
    {
        " with a head at each end. The creature is alternatively called the amphisbaina, amphisbene, amphisboena, amphisbona, amphista, amfivena, amphivena, or anphivena , and is also known as the Mother of Ants . Its name comes from the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " words amphis, meaning both ways , and bainein, meaning to go . According to ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", the amphisbaena was spawned from the blood that dripped from the ": null
    },
    {
        "Gorgon": "gorgon"
    },
    {
        "Medusas": "medusa"
    },
    {
        "head as ": null
    },
    {
        "Perseus": "perseus"
    },
    {
        " flew over the ": null
    },
    {
        "Libyan Desert": "libyan desert"
    },
    {
        " with her in his hand, after which ": null
    },
    {
        "Catos": "cato the younger"
    },
    {
        "army then encountered it along with other serpents on the march.  Amphisbaena fed off of the corpses left behind. The amphisbaena has been referred to by various ": null
    },
    {
        "poets": "poet"
    },
    {
        "such as ": null
    },
    {
        "Nicander": "nicander"
    },
    {
        ", ": null
    },
    {
        "John Milton": "john milton"
    },
    {
        ", ": null
    },
    {
        "Alexander Pope": "alexander pope"
    },
    {
        ", ": null
    },
    {
        "Percy Bysshe Shelley": "percy bysshe shelley"
    },
    {
        ", ": null
    },
    {
        "Alfred, Lord Tennyson": "alfred tennyson"
    },
    {
        ", ": null
    },
    {
        "Aimé Césaire": "aimé césaire"
    },
    {
        ", ": null
    },
    {
        "A. E. Housman": "a. e. housman"
    },
    {
        " and ": null
    },
    {
        "Allen Mandelbaum": "allen mandelbaum"
    },
    {
        "; as a mythological and legendary creature, it has been referenced by ": null
    },
    {
        "Lucan": "lucan"
    },
    {
        ", ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        ", ": null
    },
    {
        "Isidore of Seville": "isidore of seville"
    },
    {
        ", and ": null
    },
    {
        "Thomas Browne": "thomas browne"
    },
    {
        ", the last of whom debunked its existence.               This early description of the amphisbaena depicts a venomous, dual-headed snakelike creature. However, ": null
    },
    {
        "Medieval": "medieval"
    },
    {
        " and later drawings often show it with two or more scaled feet, particularly chicken feet, and feathered wings. Some even depict it as a horned, dragon-like creature with a serpent-headed tail and small, round ears, while others have both necks of equal size so that it cannot be determined which is the rear head. Many descriptions of the amphisbaena say its eyes glow like candles or lightning, but the poet ": null
    },
    {
        "Nicander": "nicander"
    },
    {
        " seems to contradict this by describing it as always dull of eye . He also says: From either end protrudes a blunt chin; each is far from each other. ": null
    },
    {
        "Nicanders": "nicander"
    },
    {
        "account seems to be referring to what is indeed called the ": null
    },
    {
        "Amphisbaenia": "amphisbaenia"
    },
    {
        ".          The amphisbaena is said to make its home in the ": null
    },
    {
        "desert": "desert"
    },
    {
        ".       In ancient times, the supposedly dangerous amphisbaena had many uses in the art of ": null
    },
    {
        "folk medicine": "folk medicine"
    },
    {
        " and other such remedies. Pliny notes that expecting women wearing a live amphisbaena around their necks would have safe pregnancies; however, if ones goal was to cure ailments such as ": null
    },
    {
        "arthritis": "arthritis"
    },
    {
        " or the ": null
    },
    {
        "common cold": "common cold"
    },
    {
        ", one should wear only its skin.  By eating the meat of the amphisbaena, one could supposedly attract many lovers of the opposite sex, and slaying one during the ": null
    },
    {
        "full moon": "full moon"
    },
    {
        " could give power to one who is pure of heart and mind  . ": null
    },
    {
        "Lumberjacks": "lumberjacks"
    },
    {
        " suffering from cold weather on the job could nail its carcass or skin to a tree to keep warm, while in the process allowing the tree to be felled more easily  .       In The Book of Beasts, ": null
    },
    {
        "T.H. White": "t.h. white"
    },
    {
        " suggests that the creature derives from sightings of the ": null
    },
    {
        "worm lizards": "amphisbaenia"
    },
    {
        " of the same name.  These creatures are found in the Mediterranean countries where many of these legends originated.       In ": null
    },
    {
        "John Miltons": "john milton"
    },
    {
        "  Paradise Lost , after the Fall and the return of Satan to Hell, some of the fallen angelic host are transformed into the amphisbaena, to represent the animal by which the Fall was caused, i.e. a snake. Paradise Lost, 10.524   The amphisbaena is mentioned in the first book of ": null
    },
    {
        "Andrzej Sapkowskis": "andrzej sapkowski"
    },
    {
        "  The Witcher  series, i.e. ": null
    },
    {
        " The Last Wish": "the last wish"
    },
    {
        ", when The Witchers protagonist, Geralt of Rivia, is recalling past events when he meets an old acquaintance named Irion. The amphisbaena was endangering the region of Kovir until the beast was slain by Geralts hand.   Brandon Sandersons novel Skyward has a character whose name is Arturo Mendez. His call sign is amphisbaena.     In the 1984 Scandinavian animated film ": null
    },
    {
        "Gallavants": "gallavants"
    },
    {
        ", an amphisbaena appears as a minor antagonist. The two heads, a red one named Edil and a blue one called Fice, frequently disagree and argue, and sing a song about their miserable plight.     Amphisbaena appears in some editions of the tabletop roleplaying game ": null
    },
    {
        "Dungeons & Dragons": "dungeons  &  dragons"
    }
]