[
    {
        "Amplitude distortion is ": null
    },
    {
        "distortion": "distortion"
    },
    {
        " occurring in a ": null
    },
    {
        "system": "system"
    },
    {
        ", subsystem, or device when the output amplitude is not a linear function of the input amplitude under specified conditions.     Generally, output is a ": null
    },
    {
        "linear": "linear"
    },
    {
        " function of input only for a fixed portion of the transfer characteristics. In this region, I c βI b where Ic is collector current and Ib is base current, following ": null
    },
    {
        "linear": "linear"
    },
    {
        " relation ymx.     When output is not in this portion, two forms of amplitude distortion might arise   ": null
    },
    {
        "Harmonic distortion": "harmonic distortion"
    },
    {
        " : The creation of ": null
    },
    {
        "harmonics": "harmonics"
    },
    {
        " of the ": null
    },
    {
        "fundamental frequency": "fundamental frequency"
    },
    {
        " of a ": null
    },
    {
        "sine wave": "sine wave"
    },
    {
        " input to a system.   ": null
    },
    {
        "Intermodulation distortion": "intermodulation distortion"
    },
    {
        " : This form of distortion occurs when two sine waves of frequencies X and Y are present at the input, resulting in the creation of several other frequency components, whose frequencies include , , , , and generally for integer m and n. Generally the size of the unwanted output falls rapidly as m and n increase.     Due to the additional outputs, this form of distortion is definitely unwanted in audio, radio and telecommunication amplifiers, and it occurs for more than two waves as well.     In a narrowband system such as a radio communication system, unwanted outputs such as X-Y and 42X+Y will be remote from the wanted band and so be ignored by the system. In contrast, 42X-Y and 42Y-X will be close to the wanted signals. These so-called third order distortion products tend to dominante the non-linear distortion of narrowband systems.     Amplitude distortion is measured with the system operating under steady-state conditions with a sinusoidal input ": null
    },
    {
        "signal": "signal"
    },
    {
        ". When other frequencies are present, the term  amplitude ": null
    }
]