[
    {
        "      In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Amymone  was a daughter of ": null
    },
    {
        "Danaus": "danaus"
    },
    {
        ", king of ": null
    },
    {
        "Libya": "libya"
    },
    {
        " and ": null
    },
    {
        "Europe": "europa"
    },
    {
        ", a queen. As the blameless Danaid, her name identifies her as, perhaps, identical to ": null
    },
    {
        "Hypermnestra": "hypermnestra"
    },
    {
        " , also the one Danaid who did not assassinate her Egyptian husband on their wedding night, as her 42 sisters did.  The author of the  Bibliotheca , in his list of names for the Danaids, does mention both Hypermnestra and Amymone, however .     ": null
    },
    {
        "Poseidon": "poseidon"
    },
    {
        ", in archaic times the consort of the two goddesses ": null
    },
    {
        "Demeter": "demeter"
    },
    {
        " and ": null
    },
    {
        "Persephone": "persephone"
    },
    {
        " in Argos, had dried up all the regions springs after the ": null
    },
    {
        "Argolid": "argos"
    },
    {
        " was awarded to the protection of ": null
    },
    {
        "Hera": "hera"
    },
    {
        ". It would appear from the myth that Poseidon preceded Hera in the heartland of her cult. But he rescued Amymone from a ": null
    },
    {
        "chthonic": "chthonic"
    },
    {
        " satyr": "satyr"
    },
    {
        " that was about to rape her. To possess her himself, the god revealed the springs of ": null
    },
    {
        "Lerna": "lerna"
    },
    {
        ", a cult site of great antiquity near the shores of the Argolid. To Poseidon she bore ": null
    },
    {
        "Nauplius": "nauplius"
    },
    {
        ", the navigator , who gave his name to the port city of Argos.     Amymone, the blameless, was eventually reconciled with her father, and given in marriage to ": null
    },
    {
        "Lynceus": "lynceus"
    },
    {
        ", with whom she founded a race of kings that led to Danae, the mother of Perseus, founder of ": null
    },
    {
        "Mycenae": "mycenae"
    },
    {
        ". Thus this ": null
    },
    {
        "founding myth": "founding myth"
    },
    {
        " of Argos also asserts that Argos was the metropolis of Mycenae.     Amymone/Hypermnestra is represented with a water pitcher, a reminder of the sacred springs and lake of Lerna and of the copious wells that made Argos the well-watered and, by contrast, a reminder that her sisters were forever punished in ": null
    },
    {
        "Tartarus": "tartarus"
    },
    {
        " for their murderous crimes by fruitlessly drawing water in pitchers with open bases.     ": null
    },
    {
        "Aeschylus": "aeschylus"
    },
    {
        " wrote a now lost ": null
    },
    {
        "satyr play": "satyr play"
    },
    {
        " called Amymone about the seduction of Amymone by ": null
    },
    {
        "Poseidon": "poseidon"
    },
    {
        ", which followed the trilogy that included  The Suppliants ": null
    }
]