[
    {
        "An Invitation to Lubberland was a ": null
    },
    {
        "broadside": "broadside"
    },
    {
        " ballad": "ballad"
    },
    {
        " first printed in 42 Many believe  that it inspired the ": null
    },
    {
        "hobo": "hobo"
    },
    {
        " ballad which formed the basis of the song  Big Rock Candy Mountain  recorded in 42 by ": null
    },
    {
        "Harry McClintock": "harry mcclintock"
    },
    {
        ".       Sung to the tune of Billy and Molly or The Journey-man Shoemaker by Daniel Cooper.     There is all sorts of Fowl and Fish, With Wine and store of Brandy; Ye have there what your hearts can wish: The Hills are Sugar-Candy     There is a ship, we understand, Now riding in the river; Tis newly come from Lubberland, The like I think was never; You that a lazy life do love. Id have you now go over, They say the land is not above Two thousand leagues from Dover.     The captain and the master too, Dos give us this relation, And so dos all the whole ships crew, Concerning this strange nation: The streets are pavd with pudding-pies, nay, powderd-beef and bacon, They say they scorn to tell you lies: Who thinks it is mistaken.     The king of Knaves, and Queen of Sluts Reign there in peace and quiet; You need not fear to starve your guts, There is such store of dyet: There may you live free from all care, Like hogs set up a fatning; The garments which the people wear Is silver, silk and satin.     The lofty buildings of this place For many years have lasted; With nutmegs, pepper, cloves, and mace, The walls are there rough-cast, In curious hasty-pudding boild, And most ingenious carving; Likewise they are with pancakes tyd, Sure, heres no fear of starving.     The captain says, In every town, Hot roasted pigs will meet ye, They in the streets run up and down, Still crying out, Come eat me Likewise, he says, At every feast, The very fowls and fishes, Nay from the biggest to the least, Comes tumbling to the dishes.      The rivers run with claret fine, The brooks with rich canary, The ponds with other sorts of wine, To make your hearts full merry: Nay, more than this, you may behold, The fountains flow with brandy, The rocks are like refined gold, The hills are sugar candy.      Rose-water is the rain they have, Which comes in pleasant showers, All places are adorned brave, With sweet and fragrant flowers. Hot custards grows on evry tree, Each ditch affords rich jellies; Now if you will be ruled by me, Go there and fill your bellies.      Theres nothing there but holy-days With music out of measure; Who can forbear to speak the praise Of such a land of pleasure? There may you lead a lazy life Free from all kind of labours: And he that is without a wife, May borrow of his neighbour.      There is no law nor lawyers fees All men are free from fury, For evry one dos what he please, Without a judge or jury: The summer-time is warm they say, The winters neer the colder, They have no landlords rent to pay Each man is a free-holder.      You that are free to cross the seas Make no more disputation: In Lubber-land youll live at ease, With pleasant recreation: The Captain waits but for a gale Of prosperous wind and weather, And then they soon will hoist up sail, Make haste away together.": null
    }
]