[
    {
        "      In classical mathematics, analytic geometry, also known as coordinate geometry or Cartesian geometry, is the study of ": null
    },
    {
        "geometry": "geometry"
    },
    {
        " using a ": null
    },
    {
        "coordinate system": "coordinate system"
    },
    {
        ". This contrasts with ": null
    },
    {
        "synthetic geometry": "synthetic geometry"
    },
    {
        ".     Analytic geometry is widely used in ": null
    },
    {
        "physics": "physics"
    },
    {
        " and ": null
    },
    {
        "engineering": "engineering"
    },
    {
        ", and also in ": null
    },
    {
        "aviation": "aviation"
    },
    {
        ", ": null
    },
    {
        "rocket": "rocket"
    },
    {
        "ry, ": null
    },
    {
        "space science": "space science"
    },
    {
        ", and ": null
    },
    {
        "spaceflight": "spaceflight"
    },
    {
        ". It is the foundation of most modern fields of geometry, including ": null
    },
    {
        "algebraic": "algebraic geometry"
    },
    {
        ", ": null
    },
    {
        "differential": "differential geometry"
    },
    {
        ", ": null
    },
    {
        "discrete": "discrete geometry"
    },
    {
        " and ": null
    },
    {
        "computational geometry": "computational geometry"
    },
    {
        ".     Usually the ": null
    },
    {
        "Cartesian coordinate system": "cartesian coordinate system"
    },
    {
        " is applied to manipulate ": null
    },
    {
        "equations": "equation"
    },
    {
        "for ": null
    },
    {
        "plane": "plane"
    },
    {
        "s, ": null
    },
    {
        "straight line": "line"
    },
    {
        "s, and ": null
    },
    {
        "square": "square"
    },
    {
        "s, often in two and sometimes in three dimensions. Geometrically, one studies the ": null
    },
    {
        "Euclidean plane": "euclidean plane"
    },
    {
        "  and ": null
    },
    {
        "Euclidean space": "euclidean space"
    },
    {
        " . As taught in school books, analytic geometry can be explained more simply: it is concerned with defining and representing geometrical shapes in a numerical way and extracting numerical information from shapes numerical definitions and representations. That the algebra of the ": null
    },
    {
        "real numbers": "real numbers"
    },
    {
        " can be employed to yield results about the linear continuum of geometry relies on the ": null
    },
    {
        "Cantor–Dedekind axiom": "cantor–dedekind axiom"
    },
    {
        ".           The ": null
    },
    {
        "Greek": "ancient greece"
    },
    {
        " mathematician ": null
    },
    {
        "Menaechmus": "menaechmus"
    },
    {
        " solved problems and proved theorems by using a method that had a strong resemblance to the use of coordinates and it has sometimes been maintained that he had introduced analytic geometry.      ": null
    },
    {
        "Apollonius of Perga": "apollonius of perga"
    },
    {
        ", in  On Determinate Section , dealt with problems in a manner that may be called an analytic geometry of one dimension; with the question of finding points on a line that were in a ratio to the others.  Apollonius in the Conics further developed a method that is so similar to analytic geometry that his work is sometimes thought to have anticipated the work of ": null
    },
    {
        "Descartes": "descartes"
    },
    {
        " by some 1800 years. His application of reference lines, a diameter and a tangent is essentially no different from our modern use of a coordinate frame, where the distances measured along the diameter from the point of tangency are the abscissas, and the segments parallel to the tangent and intercepted between the axis and the curve are the ordinates. He further developed relations between the abscissas and the corresponding ordinates that are equivalent to rhetorical equations of curves. However, although Apollonius came close to developing analytic geometry, he did not manage to do so since he did not take into account negative magnitudes and in every case the coordinate system was superimposed upon a given curve a posteriori instead of a priori. That is, equations were determined by curves, but curves were not determined by equations. Coordinates, variables, and equations were subsidiary notions applied to a specific geometric situation.        The 11th century ": null
    },
    {
        "Persian": "persian people"
    },
    {
        " mathematician ": null
    },
    {
        "Omar Khayyám": "omar khayyám"
    },
    {
        " saw a strong relationship between geometry and algebra, and was moving in the right direction when he helped to close the gap between numerical and geometric algebra with his geometric solution of the general ": null
    },
    {
        "cubic equation": "cubic equation"
    },
    {
        "s, Glen M. Cooper . Omar Khayyam, the Mathematician , The Journal of the American Oriental Society 123. but the decisive step came later with Descartes.  ": null
    },
    {
        "Omar Khayyam": "omar khayyam"
    },
    {
        " is credited with identifying the foundations of ": null
    },
    {
        "algebraic geometry": "algebraic geometry"
    },
    {
        " and his book Treatise on Demonstrations of Problems of Algebra , which laid down the principles of algebra, is part of the body of Persian mathematics that was eventually transmitted to Europe. ": null
    },
    {
        "Mathematical Masterpieces: Further Chronicles by the Explorers": "refmathmaster"
    },
    {
        ", p. 92 Because of his thoroughgoing geometrical approach to algebraic equations, Khayyam can be considered a precursor of Descartes in the invention of analytic geometry. Cooper, G. . Journal of the American Oriental Society,123, 248-249.        Analytic geometry was independently invented by ": null
    },
    {
        "René Descartes": "rené descartes"
    },
    {
        " and ": null
    },
    {
        "Pierre de Fermat": "pierre de fermat"
    },
    {
        ",   although Descartes is sometimes given sole credit.   Cartesian geometry, the alternative term used for analytic geometry, is named after Descartes.     Descartes made significant progress with the methods in an essay titled  La Geometrie , one of the three accompanying essays published in 1637 together with his Discourse on the Method for Rightly Directing Ones Reason and Searching for Truth in the Sciences, commonly referred to as  Discourse on Method .      This work, written in his native ": null
    },
    {
        "French": "french language"
    },
    {
        " tongue, and its philosophical principles, provided a foundation for ": null
    },
    {
        "calculus": "calculus"
    },
    {
        " in Europe. Initially the work was not well received, due, in part, to the many gaps in arguments and complicated equations. Only after the translation into ": null
    },
    {
        "Latin": "latin"
    },
    {
        " and the addition of commentary by ": null
    },
    {
        "van Schooten": "frans van schooten"
    },
    {
        " in 1649 did Descartess masterpiece receive due recognition.      ": null
    },
    {
        "Pierre de Fermat": "pierre de fermat"
    },
    {
        " also pioneered the development of analytic geometry. Although not published in his lifetime, a manuscript form of Ad locos planos et solidos isagoge was circulating in Paris in 1637, just prior to the publication of Descartes Discourse.  Pierre de Fermat, Varia Opera Mathematica d. Petri de Fermat, Senatoris Tolosani , Ad locos planos et solidos isagoge,   , Le Journal des Scavans, 9 February 1665, pp.  69–72. From p. 70:  Une introduction aux lieux, plans & solides; qui est un traité analytique concernant la solution des problemes plans & solides, qui avoit esté veu devant que M. des Cartes eut rien publié sur ce sujet.  Clearly written and well received, the Introduction also laid the groundwork for analytical geometry. The key difference between Fermats and Descartes treatments is a matter of viewpoint: Fermat always started with an algebraic equation and then described the geometric curve which satisfied it, whereas Descartes started with geometric curves and produced their equations as one of several properties of the curves. As a consequence of this approach, Descartes had to deal with more complicated equations and he had to develop the methods to work with polynomial equations of higher degree. It was Leonhard Euler who first applied the coordinate method in a systematic study of space curves and surfaces.               In analytic geometry, the ": null
    },
    {
        "plane": "euclidean plane"
    },
    {
        " is given a coordinate system, by which every ": null
    },
    {
        "point": "point"
    },
    {
        " has a pair of ": null
    },
    {
        "real number": "real number"
    },
    {
        " coordinates. Similarly, ": null
    },
    {
        "Euclidean space": "euclidean space"
    },
    {
        " is given coordinates where every point has three coordinates. The value of the coordinates depends on the choice of the initial point of origin. There are a variety of coordinate systems used, but the most common are the following: ": null
    },
    {
        "Stewart, James": "james stewart"
    },
    {
        " . Calculus: Early Transcendentals, 6th ed., Brooks Cole Cengage Learning.           The most common coordinate system to use is the ": null
    },
    {
        "Cartesian coordinate system": "cartesian coordinate system"
    },
    {
        ", where each point has an x-coordinate representing its horizontal position, and a y-coordinate representing its vertical position. These are typically written as an ": null
    },
    {
        "ordered pair": "ordered pair"
    },
    {
        " . This system can also be used for three-dimensional geometry, where every point in ": null
    },
    {
        "Euclidean space": "euclidean space"
    },
    {
        " is represented by an ": null
    },
    {
        "ordered triple": "tuple"
    },
    {
        " of coordinates .          In ": null
    },
    {
        "polar coordinates": "polar coordinates"
    },
    {
        ", every point of the plane is represented by its distance r from the origin and its ": null
    },
    {
        "angle": "angle"
    },
    {
        " θ, with θ normally measured counterclockwise from the positive x-axis. Using this notation, points are typically written as an ordered pair . One may transform back and forth between two-dimensional Cartesian and polar coordinates by using these formulae: x r\\, cos\\theta,\\, y r\\, sin\\theta; \\, r \\sqrt,\\, \\theta \\arctan . This system may be generalized to three-dimensional space through the use of ": null
    },
    {
        "cylindrical": "cylindrical coordinates"
    },
    {
        " or ": null
    },
    {
        "spherical": "spherical coordinates"
    },
    {
        " coordinates.          In ": null
    },
    {
        "cylindrical coordinates": "cylindrical coordinates"
    },
    {
        ", every point of space is represented by its height z, its ": null
    },
    {
        "radius": "radius"
    },
    {
        " r from the z-axis and the ": null
    },
    {
        "angle": "angle"
    },
    {
        " θ its projection on the xy-plane makes with respect to the horizontal axis.          In ": null
    },
    {
        "spherical coordinates": "spherical coordinates"
    },
    {
        ", every point in space is represented by its distance ρ from the origin, the ": null
    },
    {
        "angle": "angle"
    },
    {
        " θ its projection on the xy-plane makes with respect to the horizontal axis, and the angle φ that it makes with respect to the z-axis. The names of the angles are often reversed in physics.          In analytic geometry, any ": null
    },
    {
        "equation": "equation"
    },
    {
        " involving the coordinates specifies a ": null
    },
    {
        "subset": "subset"
    },
    {
        " of the plane, namely the ": null
    },
    {
        "solution set": "solution set"
    },
    {
        " for the equation, or ": null
    },
    {
        "locus": "locus"
    },
    {
        ". For example, the equation y    x corresponds to the set of all the points on the plane whose x-coordinate and y-coordinate are equal. These points form a ": null
    },
    {
        "line": "line"
    },
    {
        ", and y    x is said to be the equation for this line. In general, linear equations involving x and y specify lines, ": null
    },
    {
        "quadratic equations": "quadratic equation"
    },
    {
        "specify ": null
    },
    {
        "conic section": "conic section"
    },
    {
        "s, and more complicated equations describe more complicated figures. Percey Franklyn Smith, Arthur Sullivan Gale Introduction to Analytic Geometry, Athaeneum Press       Usually, a single equation corresponds to a ": null
    },
    {
        "curve": "curve"
    },
    {
        " on the plane. This is not always the case: the trivial equation x    x specifies the entire plane, and the equation x 2  +  y 2    0 specifies only the single point . In three dimensions, a single equation usually gives a ": null
    },
    {
        "surface": "surface"
    },
    {
        ", and a curve must be specified as the ": null
    },
    {
        "intersection": "intersection"
    },
    {
        " of two surfaces , or as a system of ": null
    },
    {
        "parametric equation": "parametric equation"
    },
    {
        "s. William H. McCrea, Analytic Geometry of Three Dimensions   Courier Dover Publications, Jan 27, 2012 The equation x 2  +  y 2    r 2 is the equation for any circle centered at the origin with a radius of r.          Lines in a ": null
    },
    {
        "Cartesian plane": "cartesian plane"
    },
    {
        " or, more generally, in ": null
    },
    {
        "affine coordinates": "affine coordinates"
    },
    {
        ", can be described algebraically by linear equations. In two dimensions, the equation for non-vertical lines is often given in the  slope-intercept form :   : y mx + b \\,   where:   : m is the ": null
    },
    {
        "slope": "slope"
    },
    {
        " or ": null
    },
    {
        "gradient": "slope"
    },
    {
        " of the line.   : b is the ": null
    },
    {
        "y-intercept": "y-intercept"
    },
    {
        " of the line.   : x is the ": null
    },
    {
        "independent variable": "independent variable"
    },
    {
        " of the function y f.     In a manner analogous to the way lines in a two-dimensional space are described using a point-slope form for their equations, planes in a three dimensional space have a natural description using a point in the plane and a vector orthogonal to it  to indicate its inclination .     Specifically, let \\mathbf_0 be the position vector of some point P_0 , and let \\mathbf be a nonzero vector. The plane determined by this point and vector consists of those points P , with position vector \\mathbf , such that the vector drawn from P_0 to P is perpendicular to \\mathbf . Recalling that two vectors are perpendicular if and only if their dot product is zero, it follows that the desired plane can be described as the set of all points \\mathbf such that   : \\mathbf \\cdot 0.      Expanded this becomes   : a + b+ c0,   which is the point-normal form of the equation of a plane.  This is just a ": null
    },
    {
        "linear equation": "linear equation"
    },
    {
        ":   : ax + by + cz + d 0, \\text d -.   Conversely, it is easily shown that if a, b, c and d are constants and a, b, and c are not all zero, then the graph of the equation   :: ax + by + cz + d 0,   is a plane having the vector \\mathbf as a normal.  This familiar equation for a plane is called the general form of the equation of the plane.      In three dimensions, lines can not be described by a single linear equation, so they are frequently described by ": null
    },
    {
        "parametric equation": "parametric equation"
    },
    {
        "s:   : x x_0 + at \\,   : y y_0 + bt \\,   : z z_0 + ct \\,   where:   : x, y, and z are all functions of the independent variable t which ranges over the real numbers.   :  is any point on the line.   : a, b, and c are related to the slope of the line, such that the ": null
    },
    {
        "vector": "vector"
    },
    {
        "  is parallel to the line.          In the ": null
    },
    {
        "Cartesian coordinate system": "cartesian coordinate system"
    },
    {
        ", the ": null
    },
    {
        "graph": "graph of a function"
    },
    {
        " of a ": null
    },
    {
        "quadratic equation": "quadratic equation"
    },
    {
        " in two variables is always a conic section – though it may be degenerate, and all conic sections arise in this way. The equation will be of the form     : Ax^2 + Bxy + Cy^2 +Dx + Ey + F 0\\textA, B, C\\text \\,   As scaling all six constants yields the same locus of zeros, one can consider conics as points in the five-dimensional ": null
    },
    {
        "projective space": "projective space"
    },
    {
        " \\mathbf^5.     The conic sections described by this equation can be classified using the ": null
    },
    {
        "discriminant": "discriminant"
    },
    {
        " ,        : B^2 - 4AC .\\,   If the conic is non-degenerate, then:   if B^2 - 4AC  0 , the equation represents a ": null
    },
    {
        "hyperbola": "hyperbola"
    },
    {
        ";   if we also have A + C 0 , the equation represents a ": null
    },
    {
        "rectangular hyperbola": "hyperbola"
    },
    {
        ".          A quadric, or quadric surface, is a 2-dimensional ": null
    },
    {
        "surface": "surface"
    },
    {
        " in 3-dimensional space defined as the ": null
    },
    {
        "locus": "locus"
    },
    {
        " of ": null
    },
    {
        "zeros": "root of a function"
    },
    {
        " of a ": null
    },
    {
        "quadratic polynomial": "quadratic polynomial"
    },
    {
        ". In coordinates , the general quadric is defined by the ": null
    },
    {
        "algebraic equation": "algebraic equation"
    },
    {
        " Silvio Levy  in Geometry Formulas and Facts , excerpted from 30th Edition of CRC Standard Mathematical Tables and Formulas, ": null
    },
    {
        "CRC Press": "crc press"
    },
    {
        ", from ": null
    },
    {
        "The Geometry Center": "the geometry center"
    },
    {
        " at ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        "     :   \\sum_^ x_i Q_ x_j + \\sum_^ P_i x_i + R 0.       Quadric surfaces include ": null
    },
    {
        "ellipsoids": "ellipsoid"
    },
    {
        " , ": null
    },
    {
        "paraboloid": "paraboloid"
    },
    {
        "s, ": null
    },
    {
        "hyperboloid": "hyperboloid"
    },
    {
        "s, ": null
    },
    {
        "cylinder": "cylinder"
    },
    {
        "s, ": null
    },
    {
        "cones": "cones"
    },
    {
        ", and ": null
    },
    {
        "planes": "plane"
    },
    {
        ".               In analytic geometry, geometric notions such as ": null
    },
    {
        "distance": "distance"
    },
    {
        " and ": null
    },
    {
        "angle": "angle"
    },
    {
        " measure are defined using ": null
    },
    {
        "formula": "formula"
    },
    {
        "s. These definitions are designed to be consistent with the underlying ": null
    },
    {
        "Euclidean geometry": "euclidean geometry"
    },
    {
        ". For example, using ": null
    },
    {
        "Cartesian coordinates": "cartesian coordinates"
    },
    {
        " on the plane, the distance between two points  and  is defined by the formula   : d \\sqrt,\\!   which can be viewed as a version of the ": null
    },
    {
        "Pythagorean theorem": "pythagorean theorem"
    },
    {
        ". Similarly, the angle that a line makes with the horizontal can be defined by the formula   : \\theta \\arctan,   where m is the ": null
    },
    {
        "slope": "slope"
    },
    {
        " of the line.     In three dimensions, distance is given by the generalization of the Pythagorean theorem:   : d \\sqrt,\\! ,     while the angle between two vectors is given by the ": null
    },
    {
        "dot product": "dot product"
    },
    {
        ". The dot product of two Euclidean vectors A and B is defined by    : \\mathbf A\\cdot\\mathbf B \\stackrel\\|\\mathbf A\\|\\,\\|\\mathbf B\\|\\cos\\theta,   where θ is the ": null
    },
    {
        "angle": "angle"
    },
    {
        " between A and B.       ": null
    }
]