[
    {
        "      An analgesic or painkiller is any member of the group of ": null
    },
    {
        "drugs": "pharmaceutical drug"
    },
    {
        " used to achieve analgesia, relief from ": null
    },
    {
        "pain": "pain"
    },
    {
        ".     Analgesic drugs act in various ways on the ": null
    },
    {
        "peripheral": "peripheral nervous system"
    },
    {
        " and ": null
    },
    {
        "central": "central nervous system"
    },
    {
        " nervous systems. They are distinct from ": null
    },
    {
        "anesthetic": "anesthetic"
    },
    {
        "s, which temporarily affect, and in some instances completely eliminate, ": null
    },
    {
        "sensation": "sense"
    },
    {
        ". Analgesics include ": null
    },
    {
        "paracetamol": "paracetamol"
    },
    {
        " , the ": null
    },
    {
        "nonsteroidal anti-inflammatory drugs": "nonsteroidal anti-inflammatory drug"
    },
    {
        " such as the ": null
    },
    {
        "salicylate": "salicylate"
    },
    {
        "s, and ": null
    },
    {
        "opioid": "opioid"
    },
    {
        " drugs such as ": null
    },
    {
        "morphine": "morphine"
    },
    {
        " and ": null
    },
    {
        "oxycodone": "oxycodone"
    },
    {
        ".     When choosing analgesics, the severity and response to other medication determines the choice of agent; the ": null
    },
    {
        "World Health Organization": "world health organization"
    },
    {
        " pain ladder": "pain ladder"
    },
    {
        "  specifies mild analgesics as its first step.     Analgesic choice is also determined by the type of pain: For ": null
    },
    {
        "neuropathic pain": "neuropathic pain"
    },
    {
        ", traditional analgesics are less effective, and there is often benefit from classes of drugs that are not normally considered analgesics, such as ": null
    },
    {
        "tricyclic antidepressants": "tricyclic antidepressants"
    },
    {
        " and ": null
    },
    {
        "anticonvulsant": "anticonvulsant"
    },
    {
        "s.        Topical ": null
    },
    {
        "nonsteroidal anti-inflammatory drugs": "nonsteroidal anti-inflammatory drugs"
    },
    {
        " provide pain relief in common conditions such as muscle sprains and overuse injuries. Since the side effects are also lesser, topical preparations could be preferred over oral medications in these conditions.           Each different type of analgesic has its own associated side effects.       Analgesics are typically classified based on their mechanism of action.           Paracetamol, also known as acetaminophen or APAP, is a medication used to treat ": null
    },
    {
        "pain": "pain"
    },
    {
        " and ": null
    },
    {
        "fever": "fever"
    },
    {
        ".  It is typically used for mild to moderate pain. In combination with ": null
    },
    {
        "opioid pain medication": "opioid analgesic"
    },
    {
        ", paracetamol is now used for more severe pain such as ": null
    },
    {
        "cancer pain": "cancer pain"
    },
    {
        " and after surgery.  It is typically used either by mouth or ": null
    },
    {
        "rectally": "rectally"
    },
    {
        " but is also available ": null
    },
    {
        "intravenously": "intravenously"
    },
    {
        ". Effects last between two and four hours. Paracetamol is classified as a mild analgesic.  Paracetamol is generally safe at recommended doses.           Nonsteroidal anti-inflammatory drugs , are a ": null
    },
    {
        "drug class": "drug class"
    },
    {
        " that groups together ": null
    },
    {
        "drugs": "drug"
    },
    {
        "that decrease pain  and ": null
    },
    {
        "lower fever": "antipyretic"
    },
    {
        ", and, in higher doses decrease ": null
    },
    {
        "inflammation": "inflammation"
    },
    {
        ".  The most prominent members of this group of drugs, ": null
    },
    {
        "aspirin": "aspirin"
    },
    {
        ", ": null
    },
    {
        "ibuprofen": "ibuprofen"
    },
    {
        " and ": null
    },
    {
        "naproxen": "naproxen"
    },
    {
        ", are all available ": null
    },
    {
        "over the counter": "over-the-counter drug"
    },
    {
        " in most countries.             These drugs have been derived from NSAIDs. The ": null
    },
    {
        "cyclooxygenase": "cyclooxygenase"
    },
    {
        " enzyme inhibited by NSAIDs was discovered to have at least 2 different versions: COX1 and COX2. Research suggested most of the adverse effects of NSAIDs to be mediated by blocking the COX1  enzyme, with the analgesic effects being mediated by the COX2  enzyme. Thus, the COX2 inhibitors were developed to inhibit only the COX2 enzyme . These drugs  are equally effective analgesics when compared with NSAIDs, but cause less gastrointestinal hemorrhage in particular.      After widespread adoption of the COX-2 inhibitors, it was discovered that most of the drugs in this class increase the risk of cardiovascular events by 40% on average. This led to the withdrawal of rofecoxib and valdecoxib, and warnings on others. Etoricoxib seems relatively safe, with the risk of thrombotic events similar to that of non-coxib NSAID diclofenac.            ": null
    },
    {
        "Morphine": "morphine"
    },
    {
        ", the archetypal ": null
    },
    {
        "opioid": "opioid"
    },
    {
        ", and other opioids  all exert a similar influence on the ": null
    },
    {
        "cerebral": "cerebrum"
    },
    {
        " opioid receptor": "opioid receptor"
    },
    {
        " system. ": null
    },
    {
        "Buprenorphine": "buprenorphine"
    },
    {
        " is a ": null
    },
    {
        "partial agonist": "partial agonist"
    },
    {
        " of the μ-opioid receptor, and ": null
    },
    {
        "tramadol": "tramadol"
    },
    {
        " is a serotonin norepinephrine reuptake inhibitor with weak μ-opioid receptor agonist properties.  ": null
    },
    {
        "Tramadol": "tramadol"
    },
    {
        " is structurally closer to ": null
    },
    {
        "venlafaxine": "venlafaxine"
    },
    {
        " than to ": null
    },
    {
        "codeine": "codeine"
    },
    {
        " and delivers analgesia by not only delivering opioid-like effects  but also by acting as a weak but fast-acting ": null
    },
    {
        "serotonin releasing agent": "serotonin releasing agent"
    },
    {
        " and ": null
    },
    {
        "norepinephrine reuptake inhibitor": "norepinephrine reuptake inhibitor"
    },
    {
        ".     ": null
    },
    {
        "Tapentadol": "tapentadol"
    },
    {
        ", with some structural similarities to tramadol, presents what is believed to be a novel drug working through two different modes of action in the fashion of both a traditional opioid and as an SNRI. The effects of serotonin and ": null
    },
    {
        "norepinephrine": "norepinephrine reuptake inhibitor"
    },
    {
        " on pain, while not completely understood, have had causal links established and drugs in the SNRI class are commonly used in conjunction with opioids with greater success in pain relief.     Dosing of all opioids may be limited by opioid toxicity , seizures , but opioid-tolerant individuals usually have higher dose ceilings than patients without tolerance.    Opioids, while very effective analgesics, may have some unpleasant side-effects. Patients starting morphine may experience ": null
    },
    {
        "nausea": "nausea"
    },
    {
        " and ": null
    },
    {
        "vomiting": "vomiting"
    },
    {
        " . ": null
    },
    {
        "Pruritus": "pruritus"
    },
    {
        " may require switching to a different opioid. ": null
    },
    {
        "Constipation": "constipation"
    },
    {
        " occurs in almost all patients on opioids, and ": null
    },
    {
        "laxatives": "laxative"
    },
    {
        "  are typically co-prescribed. Oxford Textbook of Palliative Medicine, 3rd ed. .     When used appropriately, opioids and other central analgesics are safe and effective; however, risks such as addiction and the bodys becoming used to the drug can occur. The effect of tolerance means that frequent use of the drug may result in its diminished effect. When safe to do so, the dosage may need to be increased to maintain effectiveness against tolerance, which may be of particular concern regarding patients suffering with chronic pain and requiring an analgesic over long periods. Opioid tolerance is often addressed with ": null
    },
    {
        "opioid rotation therapy": "opioid rotation"
    },
    {
        " in which a patient is routinely switched between two or more non-cross-tolerant opioid medications in order to prevent exceeding safe dosages in the attempt to achieve an adequate analgesic effect.     Opioid tolerance should not be confused with ": null
    },
    {
        "opioid-induced hyperalgesia": "opioid-induced hyperalgesia"
    },
    {
        ". The symptoms of these two conditions can appear very similar but the mechanism of action is different. Opioid-induced hyperalgesia is when exposure to opioids increases the sensation of pain  and can even make non-painful stimuli painful .           Alcohol has biological, mental, and social effects which influence the consequences of using alcohol for pain.  Moderate use of alcohol can lessen certain types of pain in certain circumstances.     The majority of its analgesic effects come from antagonizing NMDA receptors, similarly to ketamine, thus decreasing the activity of the primary excitatory neurotransmitter, glutamate. It also functions as an analgesic to a lesser degree by increasing the activity of the primary inhibitory neurotransmitter, GABA.      Attempting to use alcohol to treat pain has also been observed to lead to negative outcomes including excessive drinking and ": null
    },
    {
        "alcohol use disorder": "alcohol use disorder"
    },
    {
        ".          Medical cannabis, or medical marijuana, refers to ": null
    },
    {
        "cannabis": "cannabis"
    },
    {
        " or its ": null
    },
    {
        "cannabinoids": "cannabinoids"
    },
    {
        " used to treat disease or improve symptoms.   There is evidence suggesting that cannabis can be used to treat ": null
    },
    {
        "chronic pain": "chronic pain"
    },
    {
        " and ": null
    },
    {
        "muscle spasms": "muscle spasms"
    },
    {
        ", with some trials indicating improved relief of neuropathic pain over opioids.            Analgesics are frequently used in combination, such as the ": null
    },
    {
        "paracetamol": "paracetamol"
    },
    {
        " and ": null
    },
    {
        "codeine": "codeine"
    },
    {
        " preparations found in many non-prescription pain relievers. They can also be found in combination with vasoconstrictor drugs such as ": null
    },
    {
        "pseudoephedrine": "pseudoephedrine"
    },
    {
        " for ": null
    },
    {
        "sinus": "paranasal sinus"
    },
    {
        "-related preparations, or with ": null
    },
    {
        "antihistamine": "antihistamine"
    },
    {
        " drugs for allergy sufferers.     While the use of paracetamol, aspirin, ": null
    },
    {
        "ibuprofen": "ibuprofen"
    },
    {
        ", ": null
    },
    {
        "naproxen": "naproxen"
    },
    {
        ", and other ": null
    },
    {
        "NSAIDS": "nsaids"
    },
    {
        " concurrently with weak to mid-range opiates has been said to show beneficial synergistic effects by combatting pain at multiple sites of action,  several combination analgesic products have been shown to have few efficacy benefits when compared to similar doses of their individual components. Moreover, these combination analgesics can often result in significant adverse events, including accidental overdoses, most often due to confusion that arises from the multiple components of these combinations.        Many people use ": null
    },
    {
        "alternative medicine": "alternative medicine"
    },
    {
        " treatments including drugs for pain relief.  There is some evidence that some treatments using alternative medicine can relieve some types of pain more effectively than ": null
    },
    {
        "placebo": "placebo"
    },
    {
        ".      The available research concludes that more research would be necessary to better understand the use of alternative medicine.       Other psychotropic analgesic agents include ": null
    },
    {
        "ketamine": "ketamine"
    },
    {
        " , ": null
    },
    {
        "clonidine": "clonidine"
    },
    {
        " and other α 2 -adrenoreceptor agonists, and ": null
    },
    {
        "mexiletine": "mexiletine"
    },
    {
        " and other local anaesthetic analogues.          Drugs that have been introduced for uses other than analgesics are also used in pain management. Both first-generation  and newer anti-depressants  are used alongside NSAIDs and opioids for pain involving nerve damage and similar problems. Other agents directly potentiate the effects of analgesics, such as using ": null
    },
    {
        "hydroxyzine": "hydroxyzine"
    },
    {
        ", ": null
    },
    {
        "promethazine": "promethazine"
    },
    {
        ", ": null
    },
    {
        "carisoprodol": "carisoprodol"
    },
    {
        ", or ": null
    },
    {
        "tripelennamine": "tripelennamine"
    },
    {
        " to increase the pain-killing ability of a given dose of opioid analgesic.     Adjuvant analgesics, also called atypical analgesics, include ": null
    },
    {
        "nefopam": "nefopam"
    },
    {
        ", ": null
    },
    {
        "orphenadrine": "orphenadrine"
    },
    {
        ", ": null
    },
    {
        "pregabalin": "pregabalin"
    },
    {
        ", ": null
    },
    {
        "gabapentin": "gabapentin"
    },
    {
        ", ": null
    },
    {
        "cyclobenzaprine": "cyclobenzaprine"
    },
    {
        ", ": null
    },
    {
        "hyoscine": "hyoscine"
    },
    {
        " , and other drugs possessing anticonvulsant, anticholinergic, and/or antispasmodic properties, as well as many other drugs with CNS actions. These drugs are used along with analgesics to modulate and/or modify the action of opioids when used against pain, especially of neuropathic origin.     ": null
    },
    {
        "Dextromethorphan": "dextromethorphan"
    },
    {
        " has been noted to slow the development of and reverse tolerance to opioids, as well as to exert additional analgesia by acting upon ": null
    },
    {
        "NMDA": "nmda"
    },
    {
        " receptors, similarly to ketamine.  Some analgesics such as ": null
    },
    {
        "methadone": "methadone"
    },
    {
        " and ": null
    },
    {
        "ketobemidone": "ketobemidone"
    },
    {
        " and perhaps ": null
    },
    {
        "piritramide": "piritramide"
    },
    {
        " have intrinsic NMDA action.      High-alcohol ": null
    },
    {
        "liquor": "liquor"
    },
    {
        ", two forms of which were found in the US Pharmacopoeia up until 1916 and in common use by physicians well into the 1930s, has been used in the past as an agent for dulling pain, due to the ": null
    },
    {
        "CNS": "central nervous system"
    },
    {
        " depressant effects of ": null
    },
    {
        "ethyl alcohol": "ethanol"
    },
    {
        ", a notable example being the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ".  However, the ability of alcohol to relieve severe pain is likely inferior to many analgesics used today . As such, in general, the idea of alcohol for analgesia is considered a primitive practice in virtually all industrialized countries today.     The use of ": null
    },
    {
        "adjuvant": "adjuvant"
    },
    {
        " analgesics is an important and growing part of the pain-control field and new discoveries are made practically every year. Many of these drugs combat the side-effects of opioid analgesics, an added bonus. For example, ": null
    },
    {
        "antihistamines": "antihistamines"
    },
    {
        " including orphenadrine combat the release of histamine caused by many opioids. Stimulants such as ": null
    },
    {
        "methylphenidate": "methylphenidate"
    },
    {
        ", ": null
    },
    {
        "caffeine": "caffeine"
    },
    {
        ", ": null
    },
    {
        "ephedrine": "ephedrine"
    },
    {
        ", ": null
    },
    {
        "dextroamphetamine": "dextroamphetamine"
    },
    {
        ", ": null
    },
    {
        "methamphetamine": "methamphetamine"
    },
    {
        ", and ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        " work against heavy sedation and may elevate mood in distressed patients as do the antidepressants. The use of medicinal ": null
    },
    {
        "cannabis": "cannabis"
    },
    {
        " remains a debated issue.     In patients with chronic or ": null
    },
    {
        "neuropathic pain": "neuropathic pain"
    },
    {
        ", various other substances may have analgesic properties. ": null
    },
    {
        "Tricyclic antidepressant": "tricyclic antidepressant"
    },
    {
        "s, especially ": null
    },
    {
        "clomipramine": "clomipramine"
    },
    {
        " and ": null
    },
    {
        "amitriptyline": "amitriptyline"
    },
    {
        ", have been shown to improve pain in what appears to be a central manner. Nefopam is used in Europe for pain relief with concurrent opioids.     The ": null
    },
    {
        "anticonvulsant": "anticonvulsant"
    },
    {
        " carbamazepine": "carbamazepine"
    },
    {
        " is used to treat neuropathic pain. Similarly, the ": null
    },
    {
        "gabapentinoids": "gabapentinoid"
    },
    {
        " gabapentin": "gabapentin"
    },
    {
        " and ": null
    },
    {
        "pregabalin": "pregabalin"
    },
    {
        " are prescribed for neuropathic pain, and phenibut is available without prescription. Gabapentinoids work as α2δ-subunit blockers of ": null
    },
    {
        "Voltage-Gated Calcium Channels": "voltage-gated calcium channel"
    },
    {
        ", and tend to have other mechanisms of action as well. Gabapentinoids are all ": null
    },
    {
        "anticonvulsants": "anticonvulsant"
    },
    {
        ", which are most commonly used for neuropathic pain, as their mechanism of action tends to inhibit pain sensation originating from the nervous system.      ": null
    },
    {
        "Flupirtine": "flupirtine"
    },
    {
        " is a centrally acting K+ channel opener with weak ": null
    },
    {
        "NMDA antagonist": "nmda antagonist"
    },
    {
        " properties.  It is used in Europe for moderate to strong pain, as well as its ": null
    },
    {
        "migraine": "migraine"
    },
    {
        "-treating and muscle-relaxant properties. It has no significant ": null
    },
    {
        "anticholinergic": "anticholinergic"
    },
    {
        " properties, and is believed to be devoid of any activity on dopamine, serotonin, or histamine receptors. It is not addictive, and tolerance usually does not develop.  However, tolerance may develop in some cases.          Topical analgesia is generally recommended to avoid systemic side-effects. Painful joints, for example, may be treated with an ": null
    },
    {
        "ibuprofen": "ibuprofen"
    },
    {
        "- or ": null
    },
    {
        "diclofenac": "diclofenac"
    },
    {
        "-containing gel ; ": null
    },
    {
        "capsaicin": "capsaicin"
    },
    {
        " also is used ": null
    },
    {
        "topical": "topical cream"
    },
    {
        "ly. ": null
    },
    {
        "Lidocaine": "lidocaine"
    },
    {
        ", an ": null
    },
    {
        "anesthetic": "anesthetic"
    },
    {
        ", and ": null
    },
    {
        "steroids": "glucocorticoid"
    },
    {
        " may be injected into joints for longer-term pain relief. Lidocaine is also used for painful ": null
    },
    {
        "mouth sores": "mouth sore"
    },
    {
        "and to numb areas for ": null
    },
    {
        "dental": "dentistry"
    },
    {
        " work and minor medical procedures. In February 2007 the FDA notified consumers and healthcare professionals of the potential hazards of topical anesthetics entering the bloodstream when applied in large doses to the skin without medical supervision. These topical anesthetics contain anesthetic drugs such as lidocaine, tetracaine, benzocaine, and prilocaine in a cream, ointment, or gel.           ": null
    }
]