[
    {
        "      Ancient Egyptian religion was a complex system of ": null
    },
    {
        "polytheistic": "Polytheism"
    },
    {
        " beliefs and rituals that formed an integral part of ": null
    },
    {
        "ancient Egypt": "Ancient Egypt"
    },
    {
        "ian society. It centered on the Egyptians interaction with many ": null
    },
    {
        "deities": "Deity"
    },
    {
        " believed to be present in, and in control of, the world. Rituals such as prayer and offerings were provided to the gods to gain their favor. Formal religious practice centered on the ": null
    },
    {
        "pharaoh": "Pharaoh"
    },
    {
        "s, the rulers of Egypt, believed to possess a divine power by virtue of their position. They acted as intermediaries between their people and the gods, and were obligated to sustain the gods through rituals and offerings so that they could maintain  Maat , the order of the cosmos. The state dedicated enormous resources to religious rituals and to the construction of ": null
    },
    {
        "temples": "Egyptian Temple"
    },
    {
        ".     Individuals could interact with the gods for their own purposes, appealing for help through prayer or compelling the gods to act through magic. These practices were distinct from, but closely linked with, the formal rituals and institutions. The popular religious tradition grew more prominent over the course of Egyptian history as the status of the pharaoh declined. Egyptian belief in the afterlife and the importance of ": null
    },
    {
        "funerary practices": "Ancient Egyptian Funerary Practices"
    },
    {
        " is evident in the great efforts made to ensure the survival of their ": null
    },
    {
        "souls": "Ancient Egyptian Concept Of The Soul"
    },
    {
        " after death - via the provision of tombs, grave goods, and offerings to preserve the bodies and spirits of the deceased.     The religion had its roots and branches in Egypts prehistory and lasted for more than 3,000 years. The details of religious belief changed over time as the importance of particular gods rose and declined, and their intricate relationships shifted. At various times, certain gods became preeminent over the others, including the sun god ": null
    },
    {
        "Ra": "Ra"
    },
    {
        ", the creator god ": null
    },
    {
        "Amun": "Amun"
    },
    {
        ", and the mother goddess ": null
    },
    {
        "Isis": "Isis"
    },
    {
        ". For a brief period, in the ": null
    },
    {
        "theology": "Atenism"
    },
    {
        " promulgated by the pharaoh ": null
    },
    {
        "Akhenaten": "Akhenaten"
    },
    {
        ", a single god, the ": null
    },
    {
        "Aten": "Aten"
    },
    {
        ", replaced the traditional pantheon. Ancient Egyptian religion and mythology left behind many writings and monuments, along with significant influences on ancient and modern cultures.       The beliefs and rituals now referred to as ancient Egyptian religion were integral within every aspect of Egyptian culture. ": null
    },
    {
        "The Egyptian language": "Egyptian Language"
    },
    {
        " possessed no single term corresponding to the modern European concept of religion. Ancient Egyptian religion consisted of a vast and varying set of beliefs and practices, linked by their common focus on the interaction between the world of humans and the world of the divine. The characteristics of the gods who populated the divine realm were inextricably linked to the Egyptians understanding of the properties of the world in which they lived.             The Egyptians believed that the phenomena of nature were divine forces in and of themselves. These deified forces included the elements, animal characteristics, or abstract forces. The Egyptians believed in a pantheon of gods, which were involved in all aspects of nature and human society. Their religious practices were efforts to sustain and placate these phenomena and turn them to human advantage. . This ": null
    },
    {
        "polytheistic": "Polytheism"
    },
    {
        " system was very complex, as some deities were believed to exist in many different manifestations, and some had multiple mythological roles. Conversely, many natural forces, such as the sun, were associated with multiple deities. The diverse pantheon ranged from gods with vital roles in the universe to minor deities or demons with very limited or localized functions. It could include gods adopted from foreign cultures, and sometimes humans: deceased pharaohs were believed to be divine, and occasionally, distinguished commoners such as ": null
    },
    {
        "Imhotep": "Imhotep"
    },
    {
        " also became deified.     The depictions of the gods in ": null
    },
    {
        "art": "Art Of Ancient Egypt"
    },
    {
        " were not meant as literal representations of how the gods might appear if they were visible, as the gods true natures were believed to be mysterious. Instead, these depictions gave recognizable forms to the abstract deities by using symbolic imagery to indicate each gods role in nature. This iconography was not fixed, and many of the gods could be depicted in more than one form.     Many gods were associated with particular regions in Egypt where their cults were most important. However, these associations changed over time, and they did not mean that the god associated with a place had originated there. For instance, the god ": null
    },
    {
        "Montu": "Montu"
    },
    {
        " was the original patron of the city of Thebes. Over the course of the ": null
    },
    {
        "Middle Kingdom": "Middle Kingdom Of Egypt"
    },
    {
        ", however, he was displaced in that role by Amun, who may have arisen elsewhere. The national popularity and importance of individual gods fluctuated in a similar way.     Deities had complex interrelationships, which partly reflected the interaction of the forces they represented. The Egyptians often grouped gods together to reflect these relationships. One of the more common combinations was a family triad consisting of a father, mother, and child, who were worshipped together. Some groups had wide-ranging importance. One such group, the ": null
    },
    {
        "Ennead": "Ennead"
    },
    {
        ", assembled nine deities into a theological system that was involved in the mythological areas of creation, kingship, and the afterlife.     The relationships between deities could also be expressed in the process of ": null
    },
    {
        "syncretism": "Syncretism"
    },
    {
        ", in which two or more different gods were linked to form a composite deity. This process was a recognition of the presence of one god in another when the second god took on a role belonging to the first. These links between deities were fluid, and did not represent the permanent merging of two gods into one; therefore, some gods could develop multiple syncretic connections. Sometimes, syncretism combined deities with very similar characteristics. At other times it joined gods with very different natures, as when Amun, the god of hidden power, was linked with ": null
    },
    {
        "Ra": "Ra"
    },
    {
        ", the god of the sun. The resulting god, Amun-Ra, thus united the power that lay behind all things with the greatest and most visible force in nature.     Many deities could be given epithets that seem to indicate that they were greater than any other god, suggesting some kind of unity beyond the multitude of natural forces. This is particularly true of a few gods who, at various points, rose to supreme importance in Egyptian religion. These included the royal patron ": null
    },
    {
        "Horus": "Horus"
    },
    {
        ", the sun god ": null
    },
    {
        "Ra": "Ra"
    },
    {
        ", and the mother goddess ": null
    },
    {
        "Isis": "Isis"
    },
    {
        ". During the ": null
    },
    {
        "New Kingdom": "New Kingdom Of Egypt"
    },
    {
        " Amun held this position. The theology of the period described in particular detail Amuns presence in and rule over all things, so that he, more than any other deity, embodied the all-encompassing power of the divine.          The Egyptian conception of the universe centered on  Maat , a word that encompasses several concepts in English, including truth , justice , and order. It was the fixed, eternal order of the universe, both in the cosmos and in human society, and it was often personified as a goddess. It had existed since the creation of the world, and without it the world would lose its cohesion. In Egyptian belief, maat was constantly under threat from the forces of disorder, so all of society was required to maintain it. On the human level this meant that all members of society should cooperate and coexist; on the cosmic level it meant that all of the forces of nature—the gods—should continue to function in balance. . This latter goal was central to Egyptian religion. The Egyptians sought to maintain maat in the cosmos by sustaining the gods through offerings and by performing rituals which staved off disorder and perpetuated the cycles of nature. .     The most important part of the Egyptian view of the cosmos was the conception of time, which was greatly concerned with the maintenance of Maat. Throughout the linear passage of time, a cyclical pattern recurred, in which Maat was renewed by periodic events which echoed the original creation. Among these events were the annual Nile flood and the succession from one king to another, but the most important was the daily journey of the sun god Ra.     When thinking of the shape of the cosmos, the Egyptians saw the earth as a flat expanse of land, personified by the god ": null
    },
    {
        "Geb": "Geb"
    },
    {
        ", over which arched the sky goddess ": null
    },
    {
        "Nut": "Nut"
    },
    {
        ". The two were separated by Shu, the god of air. Beneath the earth lay a parallel ": null
    },
    {
        "underworld": "Underworld"
    },
    {
        " and undersky, and beyond the skies lay the infinite expanse of ": null
    },
    {
        "Nu": "Nu"
    },
    {
        ", the chaos that had existed before creation. The Egyptians also believed in a place called the ": null
    },
    {
        "Duat": "Duat"
    },
    {
        ", a mysterious region associated with death and rebirth, that may have lain in the underworld or in the sky. Each day, Ra traveled over the earth across the underside of the sky, and at night he passed through the Duat to be reborn at dawn. Allen, James P., The Cosmology of the Pyramid Texts , in .     In Egyptian belief, this cosmos was inhabited by three types of sentient beings. One was the gods; another was the spirits of deceased humans, who existed in the divine realm and possessed many of the gods abilities. Living humans were the third category, and the most important among them was the pharaoh, who bridged the human and divine realms.               Egyptologists have long debated the degree to which the pharaoh was considered a god. It seems most likely that the Egyptians viewed royal authority itself as a divine force. Therefore, although the Egyptians recognized that the pharaoh was human and subject to human weakness, they simultaneously viewed him as a god, because the divine power of kingship was incarnated in him. He therefore acted as intermediary between Egypts people and the gods. He was key to upholding Maat, both by maintaining justice and harmony in human society and by sustaining the gods with temples and offerings. For these reasons, he oversaw all state religious activity. However, the pharaohs real-life influence and prestige could differ from his portrayal in official writings and depictions, and beginning in the late New Kingdom his religious importance declined drastically. Van Dijk, Jacobus, The Amarna Period and the Later New Kingdom , in .     The king was also associated with many specific deities. He was identified directly with Horus, who represented kingship itself, and he was seen as the son of Ra, who ruled and regulated nature as the pharaoh ruled and regulated society. By the New Kingdom he was also associated with Amun, the supreme force in the cosmos. Upon his death, the king became fully deified. In this state, he was directly identified with Ra, and was also associated with ": null
    },
    {
        "Osiris": "Osiris"
    },
    {
        ", god of death and rebirth and the mythological father of Horus. Many mortuary temples were dedicated to the worship of deceased pharaohs as gods.          The Egyptians had elaborate beliefs about death and the afterlife. They believed that humans possessed a  ka , or life-force, which left the body at the point of death. In life, the ka received its sustenance from food and drink, so it was believed that, to endure after death, the ka must continue to receive offerings of food, whose spiritual essence it could still consume. Each person also had a  ba , the set of spiritual characteristics unique to each individual. Unlike the ka, the ba remained attached to the body after death. Egyptian funeral rituals were intended to release the ba from the body so that it could move freely, and to rejoin it with the ka so that it could live on as an  akh . However, it was also important that the body of the deceased be preserved, as the Egyptians believed that the ba returned to its body each night to receive new life, before emerging in the morning as an akh.     In early times the deceased pharaoh was believed to ": null
    },
    {
        "ascend to the sky and dwell among the stars": "The Indestructiblescosmogony"
    },
    {
        ". Over the course of the ": null
    },
    {
        "Old Kingdom": "Old Kingdom Of Egypt"
    },
    {
        " , however, he came to be more closely associated with the daily rebirth of the sun god ": null
    },
    {
        "Ra": "Ra"
    },
    {
        " and with the underworld ruler ": null
    },
    {
        "Osiris": "Osiris"
    },
    {
        " as those deities grew more important.     In the fully developed afterlife beliefs of the New Kingdom, the soul had to avoid a variety of supernatural dangers in the ": null
    },
    {
        "Duat": "Duat"
    },
    {
        ", before undergoing a final judgment, known as the Weighing of the Heart , carried out by Osiris and by the ": null
    },
    {
        "Assessors of Maat": "Assessors Of Maat"
    },
    {
        ". In this judgment, the gods compared the actions of the deceased while alive to Maat, to determine whether he or she had behaved in accordance with Maat. If the deceased was judged worthy, his or her ka and ba were united into an akh. Several beliefs coexisted about the akh s destination. Often the dead were said to dwell in the realm of Osiris, a lush and pleasant land in the ": null
    },
    {
        "underworld": "Underworld"
    },
    {
        ". The solar vision of the afterlife, in which the deceased soul traveled with Ra on his daily journey, was still primarily associated with royalty, but could extend to other people as well. Over the course of the Middle and New Kingdoms, the notion that the akh could also travel in the world of the living, and to some degree magically affect events there, became increasingly prevalent.          During the New Kingdom the pharaoh ": null
    },
    {
        "Akhenaten": "Akhenaten"
    },
    {
        " abolished the official worship of other gods in favor of the sun-disk ": null
    },
    {
        "Aten": "Aten"
    },
    {
        ". This is often seen as the first instance of true monotheism in history, although the details of Atenist theology are still unclear and the suggestion that it was monotheistic is disputed. The exclusion of all but one god from worship was a radical departure from Egyptian tradition and some see Akhenaten as a practitioner of ": null
    },
    {
        "monolatry": "Monolatry"
    },
    {
        " rather than monotheism, .  as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Under Akhenatens successors Egypt reverted to its traditional religion, and Akhenaten himself came to be reviled as a heretic.          While the Egyptians had no unified religious scripture, they produced many religious writings of various types. Together the disparate texts provide an extensive, but still incomplete, understanding of Egyptian religious practices and beliefs.              Egyptian myths were metaphorical stories intended to illustrate and explain the gods actions and roles in nature. The details of the events they recounted could change to convey different symbolic perspectives on the mysterious divine events they described, so many myths exist in different and conflicting versions. Mythical narratives were rarely written in full, and more often texts only contain episodes from or allusions to a larger myth. Knowledge of Egyptian mythology, therefore, is derived mostly from hymns that detail the roles of specific deities, from ritual and magical texts which describe actions related to mythic events, and from funerary texts which mention the roles of many deities in the afterlife. Some information is also provided by allusions in secular texts. Finally, Greeks and Romans such as ": null
    },
    {
        "Plutarch": "Plutarch"
    },
    {
        " recorded some of the extant myths late in Egyptian history.     Among the significant Egyptian myths were the ": null
    },
    {
        "creation myths": "Ancient Egyptian Creation Myths"
    },
    {
        ". According to these stories, the world emerged as a dry space in the primordial ocean of chaos. Because the sun is essential to life on earth, the first rising of Ra marked the moment of this emergence. Different forms of the myth describe the process of creation in various ways: a transformation of the primordial god ": null
    },
    {
        "Atum": "Atum"
    },
    {
        " into the elements that form the world, as the creative speech of the intellectual god ": null
    },
    {
        "Ptah": "Ptah"
    },
    {
        ", and as an act of the hidden power of Amun. Regardless of these variations, the act of creation represented the initial establishment of maat and the pattern for the subsequent cycles of time.     The most important of all Egyptian myths was the ": null
    },
    {
        "Osiris myth": "Osiris Myth"
    },
    {
        ". It tells of the divine ruler Osiris, who was murdered by his jealous brother ": null
    },
    {
        "Set": "Set"
    },
    {
        ", a god often associated with chaos. Osiriss sister and wife ": null
    },
    {
        "Isis": "Isis"
    },
    {
        " resurrected him so that he could conceive an heir, Horus. Osiris then entered the underworld and became the ruler of the dead. Once grown, Horus fought and defeated Set to become king himself. Sets association with chaos, and the identification of Osiris and Horus as the rightful rulers, provided a rationale for Pharaonic succession and portrayed the Pharaohs as the upholders of order. At the same time, Osiriss death and rebirth were related to the Egyptian agricultural cycle, in which crops grew in the wake of the Nile inundation, and provided a template for the resurrection of human souls after death.     Another important mythic motif was the journey of Ra through the Duat each night. In the course of this journey, Ra met with Osiris, who again acted as an agent of regeneration, so that his life was renewed. He also fought each night with ": null
    },
    {
        "Apep": "Apep"
    },
    {
        ", a serpentine god representing chaos. The defeat of Apep and the meeting with Osiris ensured the rising of the sun the next morning, an event that represented rebirth and the victory of order over chaos.       The procedures for religious rituals were frequently written on papyri, which were used as instructions for those performing the ritual. These ritual texts were kept mainly in the temple libraries. Temples themselves are also inscribed with such texts, often accompanied by illustrations. Unlike the ritual papyri, these inscriptions were not intended as instructions, but were meant to symbolically perpetuate the rituals even if, in reality, people ceased to perform them. Magical texts likewise describe rituals, although these rituals were part of the spells used for specific goals in everyday life. Despite their mundane purpose, many of these texts also originated in temple libraries and later became disseminated among the general populace.       The Egyptians produced numerous prayers and hymns, written in the form of poetry. Hymns and prayers follow a similar structure and are distinguished mainly by the purposes they serve. Hymns were written to praise particular deities. . Like ritual texts, they were written on papyri and on temple walls, and they were probably recited as part of the rituals they accompany in temple inscriptions. Most are structured according to a set literary formula, designed to expound on the nature, aspects, and mythological functions of a given deity. They tend to speak more explicitly about fundamental theology than other Egyptian religious writings, and became particularly important in the New Kingdom, a period of particularly active theological discourse. Prayers follow the same general pattern as hymns, but address the relevant god in a more personal way, asking for blessings, help, or forgiveness for wrongdoing. Such prayers are rare before the New Kingdom, indicating that in earlier periods such direct personal interaction with a deity was not believed possible, or at least was less likely to be expressed in writing. They are known mainly from inscriptions on statues and ": null
    },
    {
        "stelae": "Stele"
    },
    {
        " left in sacred sites as ": null
    },
    {
        "votive offering": "Votive Offering"
    },
    {
        "s. Ockinga, Boyo, Piety , in .             Among the most significant and extensively preserved Egyptian writings are ": null
    },
    {
        "funerary texts": "Ancient Egyptian Funerary Texts"
    },
    {
        " designed to ensure that deceased souls reached a pleasant afterlife. The earliest of these are the ": null
    },
    {
        "Pyramid Texts": "Pyramid Texts"
    },
    {
        ". They are a loose collection of hundreds of spells inscribed on the walls of royal pyramids during the Old Kingdom, intended to magically provide pharaohs with the means to join the company of the gods in the afterlife. The spells appear in differing arrangements and combinations, and few of them appear in all of the pyramids.     At the end of the Old Kingdom a new body of funerary spells, which included material from the Pyramid Texts, began appearing in tombs, inscribed primarily on coffins. This collection of writings is known as the ": null
    },
    {
        "Coffin Texts": "Coffin Texts"
    },
    {
        ", and was not reserved for royalty, but appeared in the tombs of non-royal officials. In the New Kingdom, several new funerary texts emerged, of which the best-known is the ": null
    },
    {
        "Book of the Dead": "Book Of The Dead"
    },
    {
        ". Unlike the earlier books, it often contains extensive illustrations, or vignettes. The book was copied on papyrus and sold to commoners to be placed in their tombs.     The Coffin Texts included sections with detailed descriptions of the underworld and instructions on how to overcome its hazards. In the New Kingdom, this material gave rise to several books of the netherworld , including the ": null
    },
    {
        "Book of Gates": "Book Of Gates"
    },
    {
        ", the ": null
    },
    {
        "Book of Caverns": "Book Of Caverns"
    },
    {
        ", and the ": null
    },
    {
        "Amduat": "Amduat"
    },
    {
        ". Unlike the loose collections of spells, these netherworld books are structured depictions of Ras passage through the Duat, and by analogy, the journey of the deceased persons soul through the realm of the dead. They were originally restricted to pharaonic tombs, but in the Third Intermediate Period they came to be used more widely.                 Temples existed from the beginning of Egyptian history, and at the height of the civilization they were present in most of its towns. They included both mortuary temples to serve the spirits of deceased pharaohs and temples dedicated to patron gods, although the distinction was blurred because divinity and kingship were so closely intertwined. The temples were not primarily intended as places for worship by the general populace, and the common people had a complex set of religious practices of their own. Instead, the state-run temples served as houses for the gods, in which physical images which served as their intermediaries were cared for and provided with offerings. This service was believed to be necessary to sustain the gods, so that they could in turn maintain the universe itself. . Thus, temples were central to Egyptian society, and vast resources were devoted to their upkeep, including both donations from the monarchy and large estates of their own. Pharaohs often expanded them as part of their obligation to honor the gods, so that many temples grew to enormous size. However, not all gods had temples dedicated to them, as many gods who were important in official theology received only minimal worship, and many household gods were the focus of popular veneration rather than temple ritual.     The earliest Egyptian temples were small, impermanent structures, but through the Old and Middle Kingdoms their designs grew more elaborate, and they were increasingly built out of stone. In the New Kingdom, a basic temple layout emerged, which had evolved from common elements in Old and Middle Kingdom temples. With variations, this plan was used for most of the temples built from then on, and most of those that survive today adhere to it. In this standard plan, the temple was built along a central processional way that led through a series of courts and halls to the sanctuary, which held a statue of the temples god. Access to this most sacred part of the temple was restricted to the pharaoh and the highest-ranking priests. The journey from the temple entrance to the sanctuary was seen as a journey from the human world to the divine realm, a point emphasized by the complex mythological symbolism present in temple architecture. Well beyond the temple building proper was the outermost wall. Between the two lay many subsidiary buildings, including workshops and storage areas to supply the temples needs, and the library where the temples sacred writings and mundane records were kept, and which also served as a center of learning on a multitude of subjects.     Theoretically it was the duty of the pharaoh to carry out temple rituals, as he was Egypts official representative to the gods. In reality, ritual duties were almost always carried out by priests. During the Old and Middle Kingdoms, there was no separate class of priests; instead, many government officials served in this capacity for several months out of the year before returning to their secular duties. Only in the New Kingdom did professional priesthood become widespread, although most lower-ranking priests were still part-time. All were still employed by the state, and the pharaoh had final say in their appointments. However, as the wealth of the temples grew, the influence of their priesthoods increased, until it rivaled that of the pharaoh. In the political fragmentation of the ": null
    },
    {
        "Third Intermediate Period": "Third Intermediate Period Of Egypt"
    },
    {
        " , the high priests of Amun at Karnak even became the effective rulers of ": null
    },
    {
        "Upper Egypt": "Upper Egypt"
    },
    {
        ". The temple staff also included many people other than priests, such as musicians and chanters in temple ceremonies. Outside the temple were artisans and other laborers who helped supply the temples needs, as well as farmers who worked on temple estates. All were paid with portions of the temples income. Large temples were therefore very important centers of economic activity, sometimes employing thousands of people.       State religious practice included both temple rituals involved in the cult of a deity, and ceremonies related to divine kingship. Among the latter were ": null
    },
    {
        "coronation ceremonies": "Coronation Of The Pharaoh"
    },
    {
        " and the ": null
    },
    {
        "sed festival": "Sed Festival"
    },
    {
        ", a ritual renewal of the pharaohs strength that took place periodically during his reign. Thompson, Stephen E., Cults: Overview , in Redford 2001, vol. I, 326–332 There were numerous temple rituals, including rites that took place across the country and rites limited to single temples or to the temples of a single god. Some were performed daily, while others took place annually or on rarer occasions.  The most common temple ritual was the morning offering ceremony, performed daily in temples across Egypt. In it, a high-ranking priest, or occasionally the pharaoh, washed, anointed, and elaborately dressed the gods statue before presenting it with offerings. Afterward, when the god had consumed the spiritual essence of the offerings, the items themselves were taken to be distributed among the priests.     The less frequent temple rituals, or festivals, were still numerous, with dozens occurring every year. These festivals often entailed actions beyond simple offerings to the gods, such as reenactments of particular myths or the symbolic destruction of the forces of disorder. ;  Most of these events were probably celebrated only by the priests and took place only inside the temple. However, the most important temple festivals, like the ": null
    },
    {
        "Opet Festival": "Opet Festival"
    },
    {
        " celebrated at Karnak, usually involved a procession carrying the gods image out of the sanctuary in a model barque to visit other significant sites, such as the temple of a related deity. Commoners gathered to watch the procession and sometimes received portions of the unusually large offerings given to the gods on these occasions.          At many sacred sites, the Egyptians worshipped individual animals which they believed to be manifestations of particular deities. These animals were selected based on specific sacred markings which were believed to indicate their fitness for the role. Some of these cult animals retained their positions for the rest of their lives, as with the ": null
    },
    {
        "Apis bull": "Apis"
    },
    {
        " worshipped in Memphis as a manifestation of Ptah. Other animals were selected for much shorter periods. These cults grew more popular in later times, and many temples began raising stocks of such animals from which to choose a new divine manifestation. A separate practice developed in the ": null
    },
    {
        "Twenty-sixth Dynasty": "Twenty-Sixth Dynasty"
    },
    {
        ", when people began mummifying any member of a particular animal species as an offering to the god whom the species represented. Millions of mummified ": null
    },
    {
        "cat": "Cat"
    },
    {
        "s, birds, and other creatures were buried at temples honoring Egyptian deities.  Worshippers paid the priests of a particular deity to obtain and mummify an animal associated with that deity, and the mummy was placed in a cemetery near the gods cult center.       The Egyptians used ": null
    },
    {
        "oracles": "Oracle"
    },
    {
        "to ask the gods for knowledge or guidance. Egyptian oracles are known mainly from the New Kingdom and afterward, though they probably appeared much earlier. People of all classes, including the king, asked questions of oracles, and, especially in the late New Kingdom their answers could be used to settle legal disputes or inform royal decisions. Kruchten, Jean-Marie, Oracles , in  The most common means of consulting an oracle was to pose a question to the divine image while it was being carried in a festival procession, and interpret an answer from the barques movements. Other methods included interpreting the behavior of cult animals, drawing lots, or consulting statues through which a priest apparently spoke. The means of discerning the gods will gave great influence to the priests who spoke and interpreted the gods message.       While the state cults were meant to preserve the stability of the Egyptian world, lay individuals had their own religious practices that related more directly to daily life. This popular religion left less evidence than the official cults, and because this evidence was mostly produced by the wealthiest portion of the Egyptian population, it is uncertain to what degree it reflects the practices of the populace as a whole.      Popular religious practice included ceremonies marking important transitions in life. These included birth, because of the danger involved in the process, and ": null
    },
    {
        "naming": "Naming Ceremony"
    },
    {
        ", because the name was held to be a crucial part of a persons identity. The most important of these ceremonies were those surrounding death, because they ensured the souls survival beyond it. Other religious practices sought to discern the gods will or seek their knowledge. These included the interpretation of dreams, which could be seen as messages from the divine realm, and the consultation of oracles. People also sought to affect the gods behavior to their own benefit through magical rituals. Baines, in      Individual Egyptians also prayed to gods and gave them private offerings. Evidence of this type of personal piety is sparse before the New Kingdom. This is probably due to cultural restrictions on depiction of nonroyal religious activity, which relaxed during the Middle and New Kingdoms. Personal piety became still more prominent in the late New Kingdom, when it was believed that the gods intervened directly in individual lives, punishing wrongdoers and saving the pious from disaster. Official temples were important venues for private prayer and offering, even though their central activities were closed to laypeople. Egyptians frequently donated goods to be offered to the temple deity and objects inscribed with prayers to be placed in temple courts. Often they prayed in person before temple statues or in shrines set aside for their use. Yet in addition to temples, the populace also used separate local chapels, smaller but more accessible than the formal temples. These chapels were very numerous and probably staffed by members of the community. Lesko, Barbara S. Cults: Private Cults , in Redford 2001, vol. I, pp. 336–339 Households, too, often had their own small shrines for offering to gods or deceased relatives.     The deities invoked in these situations differed somewhat from those at the center of state cults. Many of the important popular deities, such as the fertility goddess ": null
    },
    {
        "Taweret": "Taweret"
    },
    {
        " and the household protector ": null
    },
    {
        "Bes": "Bes"
    },
    {
        ", had no temples of their own. However, many other gods, including Amun and Osiris, were very important in both popular and official religion. Some individuals might be particularly devoted to a single god. Often they favored deities affiliated with their own region, or with their role in life. The god ": null
    },
    {
        "Ptah": "Ptah"
    },
    {
        ", for instance, was particularly important in his cult center of ": null
    },
    {
        "Memphis": "Memphis, Egypt"
    },
    {
        ", but as the patron of craftsmen he received the nationwide veneration of many in that occupation.             The word magic could be used to translate the Egyptian term heka, which meant, as ": null
    },
    {
        "James P. Allen": "James P. Allen"
    },
    {
        " puts it, the ability to make things happen by indirect means . Heka was believed to be a natural phenomenon, the force which was used to create the universe and which the gods employed to work their will. Humans could also use it, however, and magical practices were closely intertwined with religion. In fact, even the regular rituals performed in temples were counted as magic. Individuals also frequently employed magical techniques for personal purposes. Although these ends could be harmful to other people, no form of magic was considered inimical in itself. Instead, magic was seen primarily as a way for humans to prevent or overcome negative events. Baines, in .     Magic was closely associated with the priesthood. Because temple libraries contained numerous magical texts, great magical knowledge was ascribed to the lector priests who studied these texts. These priests often worked outside their temples, hiring out their magical services to laymen. Other professions also commonly employed magic as part of their work, including doctors, scorpion-charmers, and makers of magical amulets. It is also possible that the peasantry used simple magic for their own purposes, but because this magical knowledge would have been passed down orally, there is limited evidence of it.     Language was closely linked with heka, to such a degree that ": null
    },
    {
        "Thoth": "Thoth"
    },
    {
        ", the god of writing, was sometimes said to be the inventor of heka. Therefore, magic frequently involved written or spoken incantations, although these were usually accompanied by ritual actions. Often these rituals invoked the power of an appropriate deity to perform the desired action, using the power of heka to compel it to act. Sometimes this entailed casting the practitioner or subject of a ritual in the role of a character in mythology, thus inducing the god to act toward that person as it had in the myth. Rituals also employed ": null
    },
    {
        "sympathetic magic": "Sympathetic Magic"
    },
    {
        ", using objects believed to have a magically significant resemblance to the subject of the rite. The Egyptians also commonly used objects believed to be imbued with heka of their own, such as the magically protective ": null
    },
    {
        "amulets": "Amulet"
    },
    {
        "worn in great numbers by ordinary Egyptians.          Because it was considered necessary for the survival of the soul, preservation of the body was a central part of Egyptian funerary practices. Originally the Egyptians buried their dead in the desert, where the arid conditions ": null
    },
    {
        "mummified": "Mummy"
    },
    {
        " the body naturally. In the Early Dynastic Period, however, they began using tombs for greater protection, and the body was insulated from the ": null
    },
    {
        "desiccating": "Desiccation"
    },
    {
        " effect of the sand and was subject to natural decay. Thus the Egyptians developed their elaborate ": null
    },
    {
        "embalming": "Embalming"
    },
    {
        " practices, in which the corpse was artificially desiccated and wrapped to be placed in its coffin. The quality of the process varied according to cost, however, and those who could not afford it were still buried in desert graves.        Once the mummification process was complete, the mummy was carried from the deceased persons house to the tomb in a funeral procession that included his or her friends and relatives, along with a variety of priests. Before the burial, these priests performed several rituals, including the ": null
    },
    {
        "Opening of the mouth ceremony": "Opening Of The Mouth Ceremony"
    },
    {
        " intended to restore the dead persons senses and give him or her the ability to receive offerings. Then the mummy was buried and the tomb sealed. Afterward, relatives or hired priests gave food offerings to the deceased in a nearby mortuary chapel at regular intervals. Over time, families inevitably neglected offerings to long-dead relatives, so most mortuary cults only lasted one or two generations. However, while the cult lasted, the living sometimes wrote letters asking deceased relatives for help, in the belief that the dead could affect the world of the living as the gods did.     The first Egyptian tombs were ": null
    },
    {
        "mastaba": "Mastaba"
    },
    {
        "s, rectangular brick structures where kings and nobles were entombed. Each of them contained a subterranean burial chamber and a separate, above ground chapel for mortuary rituals. In the Old Kingdom the mastaba developed into the ": null
    },
    {
        "pyramid": "Pyramid"
    },
    {
        ", which symbolized the primeval mound of Egyptian myth. Pyramids were reserved for royalty, and were accompanied by large mortuary temples sitting at their base. Middle Kingdom pharaohs continued to build pyramids, but the popularity of mastabas waned. Increasingly, commoners with sufficient means were buried in rock-cut tombs with separate mortuary chapels nearby, an approach which was less vulnerable to tomb robbery. By the beginning of the New Kingdom even the pharaohs were buried in such tombs, and they continued to be used until the decline of the religion itself.     Tombs could contain a great variety of other items, including statues of the deceased to serve as substitutes for the body in case it was damaged. Because it was believed that the deceased would have to do work in the afterlife, just as in life, burials often included small models of humans to do work in place of the deceased. The tombs of wealthier individuals could also contain furniture, clothing, and other everyday objects intended for use in the afterlife, along with amulets and other items intended to provide magical protection against the hazards of the spirit world. Further protection was provided by funerary texts included in the burial. The tomb walls also bore artwork, such as images of the deceased eating food that were believed to allow him or her to magically receive sustenance even after the mortuary offerings had ceased.              The beginnings of Egyptian religion extend into prehistory, though evidence for them comes only from the sparse and ambiguous archaeological record. Careful burials during the ": null
    },
    {
        "Predynastic period": "Prehistoric Egypt"
    },
    {
        " imply that the people of this time believed in some form of an afterlife. At the same time, animals were ritually buried, a practice which may reflect the development of ": null
    },
    {
        "zoomorphic": "Zoomorphism"
    },
    {
        " deities like those found in the later religion. The evidence is less clear for gods in human form, and this type of deity may have emerged more slowly than those in animal shape. Each region of Egypt originally had its own patron deity, but it is likely that as these small communities conquered or absorbed each other, the god of the defeated area was either incorporated into the other gods mythology or entirely subsumed by it. This resulted in a complex pantheon in which some deities remained only locally important while others developed more universal significance.     The ": null
    },
    {
        "Early Dynastic Period": "Early Dynastic Period"
    },
    {
        " began with the unification of Egypt around 3000  BC. This event transformed Egyptian religion, as some deities rose to national importance and the cult of the divine pharaoh became the central focus of religious activity. Horus was identified with the king, and his cult center in the Upper Egyptian city of ": null
    },
    {
        "Nekhen": "Nekhen"
    },
    {
        " was among the most important religious sites of the period. Another important center was ": null
    },
    {
        "Abydos": "Abydos, Egypt"
    },
    {
        ", where the early rulers built large funerary complexes.       During the Old Kingdom, the priesthoods of the major deities attempted to organize the complicated national pantheon into groups linked by their mythology and worshipped in a single cult center, such as the ": null
    },
    {
        "Ennead": "Ennead"
    },
    {
        " of ": null
    },
    {
        "Heliopolis": "Heliopolis"
    },
    {
        " which linked important deities such as ": null
    },
    {
        "Atum": "Atum"
    },
    {
        ", Ra, Osiris, and ": null
    },
    {
        "Set": "Set"
    },
    {
        " in a single creation myth. Meanwhile, pyramids, accompanied by large mortuary temple complexes, replaced ": null
    },
    {
        "mastabas": "Mastaba"
    },
    {
        " as the tombs of pharaohs. In contrast with the great size of the pyramid complexes, temples to gods remained comparatively small, suggesting that official religion in this period emphasized the cult of the divine king more than the direct worship of deities. The funerary rituals and architecture of this time greatly influenced the more elaborate temples and rituals used in worshipping the gods in later periods.        Early in the Old Kingdom, Ra grew in influence, and his cult center at Heliopolis became the nations most important religious site. . By the Fifth Dynasty, Ra was the most prominent god in Egypt, and had developed the close links with kingship and the afterlife that he retained for the rest of Egyptian history. Around the same time, ": null
    },
    {
        "Osiris": "Osiris"
    },
    {
        " became an important afterlife deity. The Pyramid Texts, first written at this time, reflect the prominence of the solar and Osirian concepts of the afterlife, although they also contain remnants of much older traditions. . The texts are an extremely important source for understanding early Egyptian theology.     In the 22nd century BC, the Old Kingdom collapsed into the disorder of the First Intermediate Period. Eventually rulers from Thebes reunified the Egyptian nation in the ": null
    },
    {
        "Middle Kingdom": "Middle Kingdom Of Egypt"
    },
    {
        " . These Theban pharaohs initially promoted their patron god ": null
    },
    {
        "Montu": "Montu"
    },
    {
        " to national importance, but during the Middle Kingdom, he was eclipsed by the rising popularity of ": null
    },
    {
        "Amun": "Amun"
    },
    {
        ". In this new Egyptian state, personal piety grew more important and was expressed more freely in writing, a trend that continued in the New Kingdom. Callender, Gae, The Middle Kingdom , in .       The Middle Kingdom crumbled in the ": null
    },
    {
        "Second Intermediate Period": "Second Intermediate Period Of Egypt"
    },
    {
        " , but the country was again reunited by Theban rulers, who became the first pharaohs of the ": null
    },
    {
        "New Kingdom": "New Kingdom Of Egypt"
    },
    {
        ". Under the new regime, ": null
    },
    {
        "Amun": "Amun"
    },
    {
        " became the supreme state god. He was syncretized with Ra, the long-established patron of kingship and his ": null
    },
    {
        "temple at Karnak": "Precinct Of Amun-Re"
    },
    {
        " in Thebes became Egypts most important religious center. Amuns elevation was partly due to the great importance of Thebes, but it was also due to the increasingly professional priesthood. Their sophisticated theological discussion produced detailed descriptions of Amuns universal power.     Increased contact with outside peoples in this period led to the adoption of many Near Eastern deities into the pantheon. At the same time, the subjugated ": null
    },
    {
        "Nubia": "Nubia"
    },
    {
        "ns absorbed Egyptian religious beliefs, and in particular, adopted Amun as their own.        The New Kingdom religious order was disrupted when ": null
    },
    {
        "Akhenaten": "Akhenaten"
    },
    {
        " acceded, and replaced Amun with the ": null
    },
    {
        "Aten": "Aten"
    },
    {
        " as the state god. Eventually, he eliminated the official worship of most other gods and moved Egypts capital to a new city at ": null
    },
    {
        "Amarna": "Amarna"
    },
    {
        ". This part of Egyptian history, the ": null
    },
    {
        "Amarna Period": "Amarna Period"
    },
    {
        ", is named after this. In doing so, Akhenaten claimed unprecedented status: only he could worship the Aten, and the populace directed their worship toward him. The Atenist system lacked well-developed mythology and afterlife beliefs, and the Aten seemed distant and impersonal, so the new order did not appeal to ordinary Egyptians. Thus, many probably continued to worship the traditional gods in private. Nevertheless, the withdrawal of state support for the other deities severely disrupted Egyptian society. Akhenatens successors restored the traditional religious system, and eventually, they dismantled all Atenist monuments.     Before the Amarna period, popular religion had trended toward more personal relationships between worshippers and their gods. Akhenatens changes had reversed this trend, but once the traditional religion was restored, there was a backlash. The populace began to believe that the gods were much more directly involved in daily life. Amun, the supreme god, was increasingly seen as the final arbiter of human destiny, the true ruler of Egypt. The pharaoh was correspondingly more human and less divine. The importance of oracles as a means of decision-making grew, as did the wealth and influence of the oracles interpreters, the priesthood. These trends undermined the traditional structure of society and contributed to the breakdown of the New Kingdom. , in .          In the 1st millennium BC, Egypt was significantly weaker than in earlier times, and in several periods foreigners seized the country and assumed the position of pharaoh. The importance of the pharaoh continued to decline, and the emphasis on popular piety continued to increase. Animal cults, a characteristically Egyptian form of worship, became increasingly popular in this period, possibly as a response to the uncertainty and foreign influence of the time. Isis grew more popular as a goddess of protection, magic, and personal salvation, and became the most important goddess in Egypt.        In the 4th century BC, Egypt became a ": null
    },
    {
        "Hellenistic": "Hellenistic Period"
    },
    {
        " kingdom under the ": null
    },
    {
        "Ptolemaic dynasty": "Ptolemaic Dynasty"
    },
    {
        " , which assumed the pharaonic role, maintaining the traditional religion and building or rebuilding many temples. The kingdoms Greek ruling class identified the Egyptian deities with their own. From this cross-cultural syncretism emerged ": null
    },
    {
        "Serapis": "Serapis"
    },
    {
        ", a god who combined Osiris and Apis with characteristics of Greek deities, and who became very popular among the Greek population. Nevertheless, for the most part the two belief systems remained separate, and the Egyptian deities remained Egyptian.     Ptolemaic-era beliefs changed little after Egypt became a ": null
    },
    {
        "province": "Egypt"
    },
    {
        " of the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        " in 30 BC, with the Ptolemaic kings replaced by distant emperors. The cult of Isis appealed even to Greeks and Romans outside Egypt, and in Hellenized form it spread across the empire. In Egypt itself, as the empire weakened, official temples fell into decay, and without their centralizing influence religious practice became fragmented and localized. Meanwhile, ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        " spread across Egypt, and in the third and fourth centuries AD, edicts by Christian emperors and ": null
    },
    {
        "iconoclasm": "Iconoclasm"
    },
    {
        " by local Christians eroded traditional beliefs. While it persisted among the populace for some time, Egyptian religion slowly faded away.          Egyptian religion produced the temples and tombs which are ancient Egypts most enduring monuments, but it also influenced other cultures. In pharaonic times many of its symbols, such as the ": null
    },
    {
        "sphinx": "Sphinx"
    },
    {
        " and ": null
    },
    {
        "winged solar disk": "Winged Sun"
    },
    {
        ", were adopted by other cultures across the Mediterranean and Near East, as were some of its deities, such as ": null
    },
    {
        "Bes": "Bes"
    },
    {
        ". Some of these connections are difficult to trace. The Greek concept of ": null
    },
    {
        "Elysium": "Elysium"
    },
    {
        " may have derived from the Egyptian vision of the afterlife. In late antiquity, the Christian conception of ": null
    },
    {
        "Hell": "Hell"
    },
    {
        " was most likely influenced by some of the imagery of the Duat. Egyptian beliefs also influenced or gave rise to several ": null
    },
    {
        "esoteric": "Western Esotericism"
    },
    {
        " belief systems developed by Greeks and Romans, who considered Egypt as a source of mystic wisdom. ": null
    },
    {
        "Hermeticism": "Hermeticism"
    },
    {
        ", for instance, derived from the tradition of secret magical knowledge associated with ": null
    },
    {
        "Thoth": "Thoth"
    },
    {
        ".       Traces of ancient beliefs remained in Egyptian folk traditions into modern times, but its influence on modern societies greatly increased with the ": null
    },
    {
        "French Campaign in Egypt and Syria": "French Campaign In Egypt And Syria"
    },
    {
        " in 1798 and their seeing the monuments and images. As a result of it, Westerners began to study Egyptian beliefs firsthand, and Egyptian religious motifs were adopted into Western art. Egyptian religion has since had a significant ": null
    },
    {
        "influence in popular culture": "Egyptian Influence In Popular Culture"
    },
    {
        ". Due to continued interest in Egyptian beliefs, in the late 20th century, several new religious groups going under the blanket term of ": null
    },
    {
        "Kemetism": "Kemetism"
    },
    {
        " have formed based on different reconstructions of ancient Egyptian religion.": null
    }
]