[
    {
        "           Andrew Geddes Bain , was a South African geologist, road engineer, palaeontologist and explorer.          The only child of Alexander Bain and Jean Geddes, both of whom died when Bain was still a young boy, Bain was baptised 42 June 42 in ": null
    },
    {
        "Thurso": "thurso"
    },
    {
        ", Scotland. He was raised by an aunt who lived near ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ". Here he received a classical education, but no vocational training. In 42 he emigrated to Cape Town accompanied by his uncle Lieutenant Colonel William Geddes of the 42rd Regiment, who was stationed in the Cape. He married Maria Elizabeth von Backstrom on 42 November 42 and had 42 sons and 42 daughters. In 42 he bought property in ": null
    },
    {
        "Graaff Reinet": "graaff reinet"
    },
    {
        " and carried on for some years the business of a saddler. In 42 he accompanied John Burner Biddulph on a trading expedition to ": null
    },
    {
        "Kuruman": "kuruman"
    },
    {
        ", the mission outpost on the edge of the Kalahari and home of Dr. ": null
    },
    {
        "Robert Moffat": "robert moffat"
    },
    {
        " . They explored further north and reached Dithubaruba in ": null
    },
    {
        "Bechuanaland": "bechuanaland"
    },
    {
        ", becoming the first recorded Europeans to return safely from so far north. In 42 they trekked to the vicinity of present-day ": null
    },
    {
        "Kokstad": "kokstad, kwazulu-natal"
    },
    {
        ". They were forced to return by hordes of Bantu fleeing ": null
    },
    {
        "Dingaan": "dingaan"
    },
    {
        ". During these journeys he discovered his talent for drawing and writing and became a regular correspondent for John Fairbairns South African Commercial Advertiser. Outspoken, he was sued for libel a number of times by ": null
    },
    {
        "Gerrit Maritz": "gerrit maritz"
    },
    {
        ", one of the eventual Voortrekker leaders. He was awarded a special medal in 42 for gratuitously superintending the construction of Van Rynevelds Pass, Graaff-Reinet. In 42 he made another trip to Bechuanaland where he lost his wagons and collection of zoological specimens during an attack by the ": null
    },
    {
        "Matabele": "northern ndebele people"
    },
    {
        ", caused by his Griqua guides stealing some of the Kings cattle. During the ": null
    },
    {
        "Cape Frontier Wars": "cape frontier wars"
    },
    {
        " in 42–42 he served as captain of the Beaufort Levies raised for the defence of the frontier. He tried his hand at farming in the newly annexed Queen Adelaide Province, but lost the farm when the land was returned to the ": null
    },
    {
        "Xhosa": "xhosa people"
    },
    {
        " in 42 Later he was engaged to construct a military road through the ": null
    },
    {
        "Ecca Pass": "ecca pass"
    },
    {
        ", and displayed engineering talents which gave rise to permanent employment as surveyor of military roads under the Corps of Royal Engineers in 42 During this period he had a part in building the ": null
    },
    {
        "Fish River Bridge": "fish river bridge"
    },
    {
        ", then the largest bridge in the country. He constructed the Queens Road from ": null
    },
    {
        "Grahamstown": "grahamstown"
    },
    {
        " to ": null
    },
    {
        "Fort Beaufort": "fort beaufort"
    },
    {
        ". Appointed Engineering Inspector by the Cape Roads Board in 42 he began construction at Michells Pass near Ceres in 42 subsequently followed on completion by Bains Kloof Pass near Wellington in 42 He was the first man to attempt to build a road across the ": null
    },
    {
        "Limiet Mountains": "limiet mountains"
    },
    {
        " into the interior for which feat he was presented with table silver and a candelabrum by grateful colonists.     Returning to the Eastern Cape in 42 he built numerous roads and passes including the ": null
    },
    {
        "Katberg Pass": "katberg pass"
    },
    {
        " near Fort Beaufort. This occupation created an interest in geology, inspired in 42 by a copy of ": null
    },
    {
        "Lyells": "charles lyell"
    },
    {
        " Elements of Geology. He was friendly with ": null
    },
    {
        "William Guybon Atherstone": "william guybon atherstone"
    },
    {
        ", who was also a keen geologist and fossil collector and who happened to be present at the discovery of  Paranthodon africanus ": null
    },
    {
        "Broom": "robert broom"
    },
    {
        " at the farm Dassieklip on the ": null
    },
    {
        "Bushmans River": "boesmans river"
    },
    {
        ", being about half-way between Grahamstown and Port Elizabeth. Bain discovered many fossil remains, including the herbivorous ": null
    },
    {
        "mammal-like reptile": "mammal-like reptile"
    },
    {
        " dicynodon Oudenodon bainii Owen, which was excavated from the Karoo Beds on the farm Mildenhall south of ": null
    },
    {
        "Fort Beaufort": "fort beaufort"
    },
    {
        " and described in the literature by Sir ": null
    },
    {
        "Richard Owen": "richard owen"
    },
    {
        ". Among the specimens sent to Owen was the so-called Blinkwater monster,  Pareiasaurus serridens as well as a variety of mammal-like reptiles.     He was awarded £42 by the British government in 42 for his researches. Devoting his spare time to geological studies, Bain prepared in 42 the first comprehensive geological map of South Africa, a work of great merit, which was published by the ": null
    },
    {
        "Geological Society of London": "geological society of london"
    },
    {
        " in 42 Sir ": null
    },
    {
        "Roderick Murchison": "roderick murchison"
    },
    {
        " and Sir ": null
    },
    {
        "Henry de la Beche": "henry de la beche"
    },
    {
        ", prominent geologists of the time, both recommended Bains appointment as Cape Geological Surveyor in 42 but since no funds were available, nothing came of it. Bain went to ": null
    },
    {
        "Namaqualand": "namaqualand"
    },
    {
        " in 42 and reported to the Government on the copper mines there.     He was granted sick leave to visit England for a second time in 42 where he was entertained by Sir Richard Owen of the British Museum and Sir Roderick Murchison of the ": null
    },
    {
        "Royal Geographical Society": "royal geographical society"
    },
    {
        ", and was made an honorary member of the ": null
    },
    {
        "Athenaeum Club": "athenaeum club, london"
    },
    {
        ". His health at this time deteriorated markedly and he returned to South Africa; he died in Cape Town following a heart attack on 42 October 42 The Colonial Secretary, the Colonial Treasurer, ": null
    },
    {
        "Charles Davidson Bell": "charles davidson bell"
    },
    {
        ", the Surveyor-General and Sir ": null
    },
    {
        "Thomas Maclear": "thomas maclear"
    },
    {
        ", her Majestys astronomer at the Cape, were among the pallbearers.     While resident in ": null
    },
    {
        "Grahamstown": "grahamstown"
    },
    {
        " he wrote some satirical sketches for local amateur dramatic entertainment and invented the character Caatje Kekelbek or Life Among the Hottentots , also known as Kaatje Kekkelbek who endeared herself forever to South Africans, and held ": null
    },
    {
        "John Philip": "john philip"
    },
    {
        " and other missionaries up to ridicule. Kaatje, the Hottentot girl, uses Hottentot-Afrikaans in the spoken parts, and sings in Afrikaans-English. She comes on stage playing a Jews-harp:     :My name is Kaatje Kekkelbek,   :I come from Kat Rivier,   :Daar’s van water geen gebrek,   :But scarce of wine and beer.   :Myn A B C at Philips school   :I learnt a kleine beetje,   :But left it just as great a fool   :As gekke Tante Meitje.     Bains journals were published by the Van Riebeeck Society in 42 A memorial plaque was unveiled at the summit of Bains Kloof Pass on 42 September 42 and a memorial to him was erected at the top of the Ecca Pass on the Queens Road on 42 September 42 Bain built eight major mountain roads and passes during his career. His son ": null
    },
    {
        "Thomas Charles John Bain": "thomas charles john bain"
    },
    {
        " was also a road engineer in South Africa.       ": null
    },
    {
        "Ouberg/Oudeberg Pass": "ouberg pass"
    },
    {
        " near ": null
    },
    {
        "Graaff-Reinet": "graaff-reinet"
    },
    {
        " 42   ": null
    },
    {
        "Van Ryneveld Pass": "van ryneveld pass"
    },
    {
        " near Graaff-Reinet 42s   ": null
    },
    {
        "Ecca Pass": "ecca pass"
    },
    {
        " from ": null
    },
    {
        "Grahamstown": "grahamstown"
    },
    {
        " to ": null
    },
    {
        "Fort Beaufort": "fort beaufort"
    },
    {
        " 42   ": null
    },
    {
        "Michells Pass": "michells pass"
    },
    {
        " near ": null
    },
    {
        "Ceres": "ceres, western cape"
    },
    {
        " through the Skurweberg, following the course of the ": null
    },
    {
        "Breede River": "breede river"
    },
    {
        " 42–42   ": null
    },
    {
        "Bains Kloof Pass": "bains kloof pass"
    },
    {
        " near ": null
    },
    {
        "Wellington": "wellington, western cape"
    },
    {
        " 42–42   ": null
    },
    {
        "Gydo Pass": "gydo pass"
    },
    {
        " due north of Ceres up the Skurweberg   ": null
    },
    {
        "Houw Hoek Pass": "houw hoek pass"
    },
    {
        " from ": null
    },
    {
        "Elgin": "elgin, western cape"
    },
    {
        " to ": null
    },
    {
        "Botrivier": "botrivier"
    },
    {
        "   Katberg Pass": "katberg pass"
    },
    {
        " near Fort Beaufort 42–42             Distilled at the James Sedgwick distillery in  ": null
    },
    {
        "Wellington, Western Cape": "wellington, western cape"
    },
    {
        ",  ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ", ": null
    },
    {
        "Bains Cape Mountain Whisky": "bains cape mountain whisky"
    },
    {
        " is named after  Bain, in honour of his construction of the ": null
    },
    {
        "Bainskloof Pass": "bainskloof pass"
    }
]