[
    {
        "         Dame Angela Brigid Lansbury  is a British-American-Irish actress who has appeared in theatre, television, and film roles. Her career has spanned almost eight decades, much of it in the United States. Her work received international attention.        Lansbury was born to Irish actress ": null
    },
    {
        "Moyna Macgill": "moyna macgill"
    },
    {
        " and English politician ": null
    },
    {
        "Edgar Lansbury": "edgar lansbury"
    },
    {
        ", an upper-middle-class family in ": null
    },
    {
        "Regents Park": "regents park"
    },
    {
        ", ": null
    },
    {
        "central London": "central london"
    },
    {
        ". To escape ": null
    },
    {
        "the Blitz": "the blitz"
    },
    {
        ", in 42 she moved to the United States with her mother and two brothers, and studied acting in New York City. Proceeding to ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        " in 42 she signed with ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        " and obtained her first film roles, in  Gaslight  and  The Picture of Dorian Gray  , earning her two ": null
    },
    {
        "Oscar": "academy award"
    },
    {
        " nominations and a ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        ". She appeared in eleven further films for MGM, mostly in supporting roles, and after her contract ended in 42 she began supplementing her cinematic work with theatrical appearances. Although largely seen as a ": null
    },
    {
        "B-list": "b-list"
    },
    {
        " star during this period, her appearance in the film  The Manchurian Candidate  received widespread acclaim and is cited as being one of her finest performances. Moving into musical theatre, Lansbury finally gained stardom for playing the leading role in the ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " musical  Mame  , which earned her a range of awards.       Amid difficulties in her personal life, Lansbury moved from ": null
    },
    {
        "California": "california"
    },
    {
        " to ": null
    },
    {
        "County Cork": "county cork"
    },
    {
        ", Ireland in 42 and continued with her theatrical and cinematic appearances throughout the decade. These included leading roles in the stage musicals  Gypsy ,  Sweeney Todd , and  The King and I , as well as in the ": null
    },
    {
        "Disney": "walt disney animation studios"
    },
    {
        " film  Bedknobs and Broomsticks  . Moving into television, she achieved worldwide fame as fictional writer and sleuth ": null
    },
    {
        "Jessica Fletcher": "jessica fletcher"
    },
    {
        " in the American ": null
    },
    {
        "whodunit": "whodunit"
    },
    {
        " series  Murder, She Wrote , which ran for twelve seasons from 42 until 42 becoming one of the longest-running detective drama series in television history. Through ": null
    },
    {
        "Corymore Productions": "corymore productions"
    },
    {
        ", a company that she co-owned with her husband ": null
    },
    {
        "Peter Shaw": "peter shaw"
    },
    {
        ", Lansbury assumed ownership of the series and was its executive producer for the final four seasons. She also moved into voice work, thereby contributing to animated films such as ": null
    },
    {
        "Disney": "walt disney animation studios"
    },
    {
        "s  Beauty and the Beast  . Since then, she has toured in a variety of international theatrical productions and continued to make occasional film appearances.       Lansbury has received an ": null
    },
    {
        "Honorary Oscar": "honorary oscar"
    },
    {
        " and a Lifetime Achievement Award from the ": null
    },
    {
        "British Academy of Film and Television Arts": "british academy of film and television arts"
    },
    {
        " and has won five ": null
    },
    {
        "Tony Award": "tony award"
    },
    {
        "s, six Golden Globes, and an ": null
    },
    {
        "Olivier Award": "olivier award"
    },
    {
        ". She has also been nominated for numerous other industry awards, including the ": null
    },
    {
        "Academy Award for Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        " on three occasions, and various ": null
    },
    {
        "Primetime Emmy Award": "primetime emmy award"
    },
    {
        "s on eighteen occasions, and a ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        ". In 42 Lansbury was made a ": null
    },
    {
        "Dame Commander of the Order of the British Empire": "dame commander of the order of the british empire"
    },
    {
        " by ": null
    },
    {
        "Queen Elizabeth II": "queen elizabeth ii"
    },
    {
        ". She has been the subject of three biographies.         Lansbury was born to an ": null
    },
    {
        "upper middle class": "upper middle class"
    },
    {
        " family on October 42 42 Although her birthplace has often been given as ": null
    },
    {
        "Poplar, East London": "poplar, london"
    },
    {
        ", she has rejected this, asserting that while she had ancestral connections to Poplar, she was born in ": null
    },
    {
        "Regents Park": "regents park"
    },
    {
        ", ": null
    },
    {
        "Central London": "central london"
    },
    {
        ".  I want to make one thing clear: I was not born in Poplar, thats not true, I was born in Regents Park, so I wasnt born in the East End, I wish I could say I had been. Certainly my antecedents were: my grandfather, my father.  Her mother was ": null
    },
    {
        "Belfast": "belfast"
    },
    {
        "-born actress ": null
    },
    {
        "Moyna Macgill": "moyna macgill"
    },
    {
        " , who regularly appeared on stage in the ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " and who had also starred in several films. Her father was the wealthy English timber merchant and politician ": null
    },
    {
        "Edgar Lansbury": "edgar lansbury"
    },
    {
        ", a member of the ": null
    },
    {
        "Communist Party of Great Britain": "communist party of great britain"
    },
    {
        " and former mayor of the ": null
    },
    {
        "Metropolitan Borough of Poplar": "metropolitan borough of poplar"
    },
    {
        ". Her paternal grandfather was the ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        " leader and anti-war activist ": null
    },
    {
        "George Lansbury": "george lansbury"
    },
    {
        ", a man whom she felt awed by and considered a giant in my youth.  Angela had an older half sister, Isolde, who was the daughter of Moynas previous marriage to writer and director ": null
    },
    {
        "Reginald Denham": "reginald denham"
    },
    {
        ". In January 42 when Angela was four, her mother gave birth to twin boys, ": null
    },
    {
        "Bruce": "bruce lansbury"
    },
    {
        " and ": null
    },
    {
        "Edgar": "edgar lansbury"
    },
    {
        ", leading the Lansburys to move from their Poplar flat to a house in ": null
    },
    {
        "Mill Hill": "mill hill"
    },
    {
        ", ": null
    },
    {
        "North London": "north london"
    },
    {
        "; on weekends they would vacate to a rural farm in ": null
    },
    {
        "Berrick Salome": "berrick salome"
    },
    {
        ", near ": null
    },
    {
        "Wallingford, Oxfordshire": "wallingford, oxfordshire"
    },
    {
        ".        When Lansbury was nine, her father died from ": null
    },
    {
        "stomach cancer": "stomach cancer"
    },
    {
        "; she retreated into playing characters as a coping mechanism. In 42 Lansbury described this event as the defining moment of my life. Nothing before or since has affected me so deeply.  Facing financial difficulty, her mother became engaged to a Scottish colonel, Leckie Forbes, and moved into his house in ": null
    },
    {
        "Hampstead": "hampstead"
    },
    {
        ", with Lansbury receiving an education at ": null
    },
    {
        "South Hampstead High School": "south hampstead high school"
    },
    {
        " from 42 until 42 She nevertheless considered herself largely self-educated, learning from books, theatre and cinema. She became a self-professed complete movie maniac , visiting the cinema regularly and imagining herself as certain characters. Keen on playing the piano, she briefly studied music at the Ritman School of Dancing, and in 42 began studying acting at the ": null
    },
    {
        "Webber Douglas School of Singing and Dramatic Art": "webber douglas academy of dramatic art"
    },
    {
        " in ": null
    },
    {
        "Kensington": "kensington"
    },
    {
        ", ": null
    },
    {
        "West London": "list of sub regions used in the london plan"
    },
    {
        ", first appearing onstage as a lady-in-waiting in the schools production of ": null
    },
    {
        "Maxwell Anderson": "maxwell anderson"
    },
    {
        "s  Mary of Scotland .     That year, Angelas grandfather died, and with the onset of ": null
    },
    {
        "the Blitz": "the blitz"
    },
    {
        ", Macgill decided to take Angela, Bruce and Edgar to the United States; Isolde remained in Britain with her new husband, the actor ": null
    },
    {
        "Peter Ustinov": "peter ustinov"
    },
    {
        ". Macgill secured a job supervising sixty British children who were being evacuated to North America aboard the Duchess of Athol, arriving with them in ": null
    },
    {
        "Montreal, Quebec": "montreal"
    },
    {
        ", Canada, in mid-August. From there, she proceeded by train to New York City, where she was financially sponsored by a ": null
    },
    {
        "Wall Street": "wall street"
    },
    {
        " businessman, Charles T. Smith, moving in with his family at their home at ": null
    },
    {
        "Mahopac, New York": "mahopac, new york"
    },
    {
        ". Lansbury gained a scholarship from the ": null
    },
    {
        "American Theatre Wing": "american theatre wing"
    },
    {
        " allowing her to study at the ": null
    },
    {
        "Feagin School of Drama and Radio": "feagin school of dramatic art"
    },
    {
        ", where she appeared in performances of ": null
    },
    {
        "William Congreve": "william congreve"
    },
    {
        "s  The Way of the World  and ": null
    },
    {
        "Oscar Wilde": "oscar wilde"
    },
    {
        "s  Lady Windermeres Fan . She graduated in March 42 by which time the family had moved to a flat in Morton Street, ": null
    },
    {
        "Greenwich Village": "greenwich village"
    },
    {
        ".     Gaslight and success in smaller roles: 42–42 Tonight at 42 , and was joined in Canada by her daughter, who gained her first theatrical job as a nightclub act at the Samovar Club, Montreal. Having gained the job by claiming to be 42 when she was 42 her act consisted of her singing songs by ": null
    },
    {
        "Noël Coward": "noël coward"
    },
    {
        ", and earned her $42 a week. She returned to New York City in August 42 but her mother had moved to Hollywood, Los Angeles, in order to resurrect her cinematic career; Lansbury and her brothers followed. Moving into a bungalow in ": null
    },
    {
        "Laurel Canyon": "laurel canyon, los angeles"
    },
    {
        ", both Lansbury and her mother obtained Christmas jobs at the ": null
    },
    {
        "Bullocks Wilshire": "bullocks wilshire"
    },
    {
        " department store in Los Angeles; Moyna was sacked for incompetence, leaving the family to subsist on Lansburys wages of $42 a week. Befriending a group of gay men, Lansbury became privy to the citys underground gay scene, and with her mother, attended lectures by the spiritual guru ": null
    },
    {
        "Jiddu Krishnamurti": "jiddu krishnamurti"
    },
    {
        "; at one of these, she met ": null
    },
    {
        "Aldous Huxley": "aldous huxley"
    },
    {
        ".        At a party hosted by her mother, Lansbury met ": null
    },
    {
        "John van Druten": "john van druten"
    },
    {
        ", who had recently co-authored a script for  Gaslight  , a mystery-thriller based on ": null
    },
    {
        "Patrick Hamilton": "patrick hamilton"
    },
    {
        "s 42 play,  Gaslight . Set in ": null
    },
    {
        "Victorian": "victorian era"
    },
    {
        " London, the film was being directed by ": null
    },
    {
        "George Cukor": "george cukor"
    },
    {
        ", and starred ": null
    },
    {
        "Ingrid Bergman": "ingrid bergman"
    },
    {
        " in the lead role of Paula Alquist, a woman being psychologically tormented by her husband. Van Druten suggested that Lansbury would be perfect for the role of Nancy Oliver, a conniving cockney maid; she was accepted for the part, although, since she was only 42 a social worker had to accompany her on the set. Obtaining an agent, Earl Kramer, she was signed to a seven-year contract with ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        ", earning $42 a week and using her real name as her professional name. Upon release, Gaslight received mixed critical reviews, although Lansburys role was widely praised; the film earned six Academy Award nominations, including one for ": null
    },
    {
        "Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        " for Lansbury.     Her next film appearance was as Edwina Brown, the older sister of Velvet Brown in  National Velvet  ; the film proved to be a major commercial hit, with Lansbury developing a lifelong friendship with co-star ": null
    },
    {
        "Elizabeth Taylor": "elizabeth taylor"
    },
    {
        ". Lansbury next starred in  The Picture of Dorian Gray  , a cinematic adaptation of ": null
    },
    {
        "Oscar Wilde": "oscar wilde"
    },
    {
        "s 42 ": null
    },
    {
        "novel of the same name": "the picture of dorian gray"
    },
    {
        ", which was again set in Victorian London. Directed by ": null
    },
    {
        "Albert Lewin": "albert lewin"
    },
    {
        ", Lansbury was cast as Sibyl Vane, a working class ": null
    },
    {
        "music hall": "music hall"
    },
    {
        " singer who falls in love with the protagonist, ": null
    },
    {
        "Dorian Gray": "dorian gray"
    },
    {
        " . Although the film was not a financial success, Lansburys performance once more drew praise, earning her a ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        ", and she was again nominated for Best Supporting Actress at the Academy Awards, losing to ": null
    },
    {
        "Anne Revere": "anne revere"
    },
    {
        ", her co-star in National Velvet.          On September 42 42 Lansbury married ": null
    },
    {
        "Richard Cromwell": "richard cromwell"
    },
    {
        ", an artist and decorator whose acting career had come to a standstill. Their marriage was troubled; Cromwell was gay, and had married Lansbury in the unsuccessful hope that it would ": null
    },
    {
        "turn him heterosexual": "sexual orientation change efforts"
    },
    {
        ". The marriage ended in less than a year when she filed for divorce on September 42 42 but they remained friends until his death. In December 42 she was introduced to fellow English expatriate ": null
    },
    {
        "Peter Pullen Shaw": "peter shaw"
    },
    {
        " at a party held by former co-star Hurd Hatfield in ": null
    },
    {
        "Ojai Valley": "ojai valley"
    },
    {
        ". Shaw was an aspiring actor, also signed to MGM, and had recently left a relationship with ": null
    },
    {
        "Joan Crawford": "joan crawford"
    },
    {
        ". He and Lansbury became a couple, living together before she proposed marriage.        The couple were intent on getting married back in ": null
    },
    {
        "Britain": "uk"
    },
    {
        ", but the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " refused to marry two divorcees. Instead, they wed in a ": null
    },
    {
        "Church of Scotland": "church of scotland"
    },
    {
        " ceremony at ": null
    },
    {
        "St. Columbas Church": "st columbas church, london"
    },
    {
        " in ": null
    },
    {
        "Knightsbridge": "knightsbridge"
    },
    {
        ", London, in August 42 followed by a honeymoon in France. Returning to the U.S., where they settled into Lansburys home in Rustic Canyon, ": null
    },
    {
        "Malibu": "malibu, california"
    },
    {
        ", in 42 both became ": null
    },
    {
        "naturalised U.S. citizens": "citizenship in the united states"
    },
    {
        ", albeit retaining their British citizenship via ": null
    },
    {
        "dual nationality": "dual nationality"
    },
    {
        ".     Following the success of Gaslight and The Picture of Dorian Gray, MGM cast Lansbury in eleven further films until her contract with the company ended in 42 Keeping her among their B-list stars, MGM used her less than their similar-aged actresses; biographers Edelman and Kupferberg believed that the majority of these films were mediocre , doing little to further her career. This view was echoed by Cukor, who believed Lansbury had been consistently miscast by MGM. She was repeatedly made to portray older women, often villainous, and as a result became increasingly dissatisfied with working for MGM, commenting that I kept wanting to play the ": null
    },
    {
        "Jean Arthur": "jean arthur"
    },
    {
        " roles, and ": null
    },
    {
        "Mr Mayer": "louis b. mayer"
    },
    {
        " kept casting me as a series of venal bitches.  The company themselves were suffering from the post42 slump in cinema sales, as a result slashing film budgets and cutting their number of staff.     42 saw Lansbury play her first American character as Em, a tough honky-tonk saloon singer who slaps Judy Garlands character in the Oscar-winning ": null
    },
    {
        "Wild West": "wild west"
    },
    {
        " musical  The Harvey Girls . She appeared in  The Hoodlum Saint  ,  Till the Clouds Roll By  ,  If Winter Comes  ,  Tenth Avenue Angel  ,  The Three Musketeers  ,  State of the Union  and  The Red Danube  . She was loaned by MGM first to ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        " for  The Private Affairs of Bel Ami  , and then to ": null
    },
    {
        "Paramount": "paramount pictures"
    },
    {
        " for  Samson and Delilah  . She appeared as a villainous maidservant in  Kind Lady  and a French adventuress in  Mutiny  . Turning to radio, in 42 she appeared in an audio adaptation of ": null
    },
    {
        "Somerset Maugham": "somerset maugham"
    },
    {
        "s  Of Human Bondage  for  NBC University Theatre  and the following year she starred in their adaptation of ": null
    },
    {
        "Jane Austen": "jane austen"
    },
    {
        "s  Pride and Prejudice . Moving into television, she appeared in a 42 episode of  Robert Montgomery Presents  adapted from ": null
    },
    {
        "A. J. Cronin": "a. j. cronin"
    },
    {
        "s  The Citadel .         The Manchurian Candidate and minor roles: 42–42   Unhappy with the roles she was being given by MGM, Lansbury instructed her manager, Harry Friedman of ": null
    },
    {
        "MCA Inc.": "mca inc."
    },
    {
        ", to terminate her contract in 42 in the same year that her son Anthony was born. Soon after the birth she joined the East Coast touring productions of two former-Broadway plays: ": null
    },
    {
        "Howard Lindsay": "howard lindsay"
    },
    {
        " and ": null
    },
    {
        "Russel Crouse": "russel crouse"
    },
    {
        "s Remains to be Seen and ": null
    },
    {
        "Louis Verneuil": "louis verneuil"
    },
    {
        "s Affairs of State. Biographer Margaret Bonanno later stated that at this point, Lansburys career had hit an all-time low,      In April 42 her daughter Deirdre Angela Shaw was born. Shaw had a son by a previous marriage, David, and after gaining legal custody of the boy in 42 he brought him to California to live with the family; with three children to raise, the Shaws moved to a larger house on San Vincente Boulevard in ": null
    },
    {
        "Santa Monica": "santa monica, california"
    },
    {
        ". However, Lansbury did not feel entirely comfortable in the Hollywood social scene, later asserting that as a result of her British roots, in Hollywood, I always felt like a stranger in a strange land.  In 42 the family moved to Malibu, settling into a house on the Pacific Coast Highway that had been designed by ": null
    },
    {
        "Aaron Green": "aaron green"
    },
    {
        "; there, she and Peter escaped the Hollywood scene, and were able to send their children to a local ": null
    },
    {
        "public school": "state schoolunited states"
    },
    {
        ".     Returning to cinema as a freelance actress, Lansbury found herself typecast as women older than herself in many films in which she appeared during this period. As she later stated, Hollywood made me old before my time, noting that in her twenties she was receiving ": null
    },
    {
        "fan mail": "fan mail"
    },
    {
        " from people who believed her to be in her forties. She obtained minor roles in the films  A Life at Stake  ,  A Lawless Street  and  The Purple Mask  , later describing the last as the worst movie I ever made.  She played Princess Gwendolyn in the comedy film  The Court Jester  , before taking on the role of a wife who kills her husband in  Please Murder Me  . From there she appeared as Minnie Littlejohn in  The Long Hot Summer  , and as Mabel Claremont in  The Reluctant Debutante  , which she filmed in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". Biographer ": null
    },
    {
        "Martin Gottfried": "martin gottfried"
    },
    {
        " said that it was these latter two cinematic appearances which restored Lansburys status as an ": null
    },
    {
        "A-picture": "a-list"
    },
    {
        " actress . Throughout this period, she continued making appearances on television, starring in episodes of Revlon Mirror Theatre,  Ford Theatre  and  The George Gobel Show , and became a regular on game show  Pantomime Quiz .     In April 42 she debuted on ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " at the ": null
    },
    {
        "Henry Miller Theatre": "henry miller theatre"
    },
    {
        " in  Hotel Paradiso , a French ": null
    },
    {
        "burlesque": "burlesque"
    },
    {
        " set in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", directed by ": null
    },
    {
        "Peter Glenville": "peter glenville"
    },
    {
        ". The play only ran for 42 weeks, although she earned good reviews for her role as Marcel Cat . She later stated that had she not appeared in the play, her whole career would have fizzled out.  She followed this with an appearance in 42s Broadway performance of  A Taste of Honey  at the ": null
    },
    {
        "Lyceum Theatre": "lyceum theatre"
    },
    {
        ", directed by ": null
    },
    {
        "Tony Richardson": "tony richardson"
    },
    {
        " and ": null
    },
    {
        "George Devine": "george devine"
    },
    {
        ". Lansbury played Helen, the boorish, verbally abusive, otherwise absentee mother of Josephine , remarking that she gained a great deal of satisfaction from the role. During the shows run, Lansbury developed a friendship with Plowright, as well as with Plowrights lover and future husband, ": null
    },
    {
        "Laurence Olivier": "laurence olivier"
    },
    {
        ". It was from Lansburys rented flat on East 42th Street that Plowright and Olivier eloped to be married.      After a well-reviewed appearance in  Summer of the Seventeenth Doll  – for which she had filmed in ": null
    },
    {
        "Sydney, Australia": "sydney, australia"
    },
    {
        " – and a minor role in  A Breath of Scandal  , she appeared in 42s  Blue Hawaii  as an overbearing mother, whose son was played by ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        ". Acknowledging that the film was of poor quality, she commented that she agreed to appear in it because I was desperate.      Her rare sympathetic role as Mavis in  The Dark at the Top of the Stairs  drew critical acclaim, as did her performances as sinister characters in  All Fall Down  , as a manipulative, destructive mother,  and the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " thriller  The Manchurian Candidate  as the scheming ideologue Mrs. Iselin. In the latter, she was cast for the role by ": null
    },
    {
        "John Frankenheimer": "john frankenheimer"
    },
    {
        " based on her performance in  All Fall Down . Lansbury was only three years older than actor ": null
    },
    {
        "Laurence Harvey": "laurence harvey"
    },
    {
        " who played her son in the film. She had agreed to appear in the film after reading the original novel, describing it as one of the most exciting political books I ever read.  Biographers Edelman and Kupferberg considered this role her enduring cinematic triumph,  while Gottfried stated that it was the strongest, the most memorable and the best picture she ever made  ... she gives her finest film performance in it.  Lansbury received her third Best Supporting Actress Academy Award nomination for the film, and was bothered by the fact that she lost.     She followed this with a performance as Sybil Logan in  In the Cool of the Day  – a film she renounced as awful – before appearing as wealthy Isabel Boyd in  The World of Henry Orient  and the widow Phyllis in  Dear Heart  . Her first appearance in a theatrical musical was the short-lived  Anyone Can Whistle , written by ": null
    },
    {
        "Arthur Laurents": "arthur laurents"
    },
    {
        " and ": null
    },
    {
        "Stephen Sondheim": "stephen sondheim"
    },
    {
        ". An experimental work, it opened at the ": null
    },
    {
        "Majestic Theatre": "majestic theatre"
    },
    {
        " on Broadway in April 42 but was critically panned and closed after nine performances. Lansbury had played the role of crooked mayoress Cora Hoover Hooper, and although she loved Sondheims score she faced personal differences with Laurents and was glad when the show closed. She appeared in  The Greatest Story Ever Told  , a cinematic biopic of Jesus, but was cut almost entirely from the final edit. She followed this with an appearance as Mama Jean Bello in  Harlow  , as Lady Blystone in  The Amorous Adventures of Moll Flanders  , and as Gloria in  Mister Buddwing  . Despite her well-received performances in a number of films, celluloid superstardom evaded her, and she became increasingly dissatisfied with these minor roles, feeling that none allowed her to explore her potential as an actress.     Mame and theatrical stardom: 42–42     In 42 Lansbury took on the title role of Mame Dennis in the musical  Mame , ": null
    },
    {
        "Jerry Herman": "jerry herman"
    },
    {
        "s musical adaptation of the novel  Auntie Mame . The directors first choice for the role had been ": null
    },
    {
        "Rosalind Russell": "rosalind russell"
    },
    {
        ", who played Mame in the non-musical film adaptation  Auntie Mame , but she had declined. Lansbury actively sought the role in the hope that it would mark a change in her career. When she was chosen, it came as a surprise to theatre critics, who believed that it would go to a better-known actress; Lansbury was forty-one years old, and it was her first starring role. Mame Dennis was a glamorous character, with over twenty costume changes throughout the play, and Lansburys role involved ten songs and dance routines which she trained extensively for. First appearing in ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        " and then ": null
    },
    {
        "Boston": "boston"
    },
    {
        ", Mame opened at the ": null
    },
    {
        "Winter Garden Theatre": "winter garden theatre"
    },
    {
        " on Broadway in May 42 Auntie Mame was already popular among the gay community, and Mame gained Lansbury a cult gay following, something that she later attributed to the fact that Mame Dennis was every gay persons idea of glamour  ... Everything about Mame coincided with every young mans idea of beauty and glory and it was lovely.           Reviews of Lansburys performance were overwhelmingly positive. In  The New York Times , ": null
    },
    {
        "Stanley Kauffmann": "stanley kauffmann"
    },
    {
        " wrote: Miss Lansbury is a singing-dancing actress, not a singer or dancer who also acts  ... In this marathon role she has wit, poise, warmth and a very taking ": null
    },
    {
        "coolth": "wikt:coolth"
    },
    {
        ". ": null
    },
    {
        "Kauffmann, Stanley": "stanley kauffmann"
    },
    {
        " . Theatre: Mame Is Back with a Splash as Musical .  The New York Times . p. 42 The role resulted in Lansbury receiving her first ": null
    },
    {
        "Tony Award for Best Leading Actress in a Musical": "tony award for best performance by a leading actress in a musical"
    },
    {
        ". Lansburys later biographer Margaret Bonanno claimed that Mame made Lansbury a superstar , with the actress herself commenting on her success by stating that Everyone loves you, everyone loves the success, and enjoys it as much as you do. And it lasts as long as you are on that stage and as long as you keep coming out of that stage door.      The stardom achieved through Mame allowed Lansbury to make further appearances on television, such as on ": null
    },
    {
        "Perry Como": "perry como"
    },
    {
        "s ": null
    },
    {
        "Thanksgiving": "thanksgiving"
    },
    {
        " Special in November 42 Her fame also allowed her to engage in a variety of high-profile charitable endeavors, for instance appearing as the guest of honor at the 42 ": null
    },
    {
        "March of Dimes": "march of dimes"
    },
    {
        " annual benefit luncheon. She was invited to star in a musical performance for the 42 Academy Awards ceremony, and co-hosted that years Tony Awards with former brother-in-law Peter Ustinov. That year, ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        "s ": null
    },
    {
        "Hasty Pudding Club": "hasty pudding club"
    },
    {
        " elected her Woman of the Year . When the film adaptation of Mame was put into production, Lansbury hoped to be offered the part, but it instead went to ": null
    },
    {
        "Lucille Ball": "lucille ball"
    },
    {
        ", an established box-office success. Lansbury considered this to be one of my bitterest disappointments . Her personal life was further complicated when she learned that both of her children had become involved with the ": null
    },
    {
        "counterculture of the 42s": "counterculture of the 1960s"
    },
    {
        " and had been using ": null
    },
    {
        "recreational drug": "recreational drug"
    },
    {
        "s; as a result, Anthony had become addicted to ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        " and ": null
    },
    {
        "heroin": "heroin"
    },
    {
        ".     Lansbury followed the success of Mame with a performance as Countess Aurelia, the 42-year-old Parisian eccentric in Dear World, a musical adaptation of ": null
    },
    {
        "Jean Giraudoux": "jean giraudoux"
    },
    {
        "s  The Madwoman of Chaillot . The show opened at Broadways ": null
    },
    {
        "Mark Hellinger Theatre": "mark hellinger theatre"
    },
    {
        " in February 42 but Lansbury found it a pretty depressing experience. Reviews of her performance were positive, and she was awarded her second Tony Award on the basis of it. Reviews of the show more generally were critical, however, and it ended after 42 performances. She followed this with an appearance in the title role of the musical  Prettybelle , which was based upon Jean Arnolds The Rape of Prettybelle. Set in the ": null
    },
    {
        "Deep South": "deep south"
    },
    {
        ", it dealt with issues of racism, with Lansbury as a wealthy alcoholic who seeks sexual encounters with black men. A controversial play, it opened in Boston but received poor reviews, being cancelled before it reached Broadway. Lansbury later described the play as a complete and utter fiasco , admitting that in her opinion, her performance was awful .     Gypsy: 42–42 The Killing of Sister George  and the role of Nurse Ratched in  One Flew Over the Cuckoos Nest . Instead, she accepted the role of the Countess von Ornstein, an aging German aristocrat who falls in love with a younger man, in  Something for Everyone  , for which she filmed on location in Hohenschwangen, ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ". That same year she appeared as the middle-aged English witch Eglantine Price in the Disney film  Bedknobs and Broomsticks ; this was her first lead in a screen musical, and led to her publicising the film on television programmes like the  David Frost Show . She later noted that as a big commercial hit, this film secured an enormous audience for me .   42 was a traumatic year for the Lansbury family, as Peter underwent a hip replacement, Anthony suffered a heroin overdose and entered a coma, and in September the familys Malibu home was destroyed in a brush fire. They then purchased Knockmourne Glebe, a farmhouse constructed in the 42s which was located near the village of ": null
    },
    {
        "Conna": "conna"
    },
    {
        " in rural ": null
    },
    {
        "County Cork": "county cork"
    },
    {
        ", and, after Anthony quit using cocaine and heroin, took him there to recover from his drug addiction. He subsequently enrolled in the Webber-Douglas School, his mothers alma mater, and became a professional actor, before moving into television directing. Lansbury and her husband did not return to California, instead dividing their time between County Cork and New York City.        In 42 Lansbury returned to Londons ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " to perform in the ": null
    },
    {
        "Royal Shakespeare Company": "royal shakespeare company"
    },
    {
        "s theatrical production of ": null
    },
    {
        "Edward Albee": "edward albee"
    },
    {
        "s All Over at the ": null
    },
    {
        "Aldwych Theatre": "aldwych theatre"
    },
    {
        ". She portrayed the mistress of a dying ": null
    },
    {
        "New England": "new england"
    },
    {
        " millionaire, and although the plays reviews were mixed, Lansburys acting was widely praised. This was followed by her reluctant involvement in a revival of Mame, which was then touring the United States, after which she returned to the West End to play the character of Rose in the musical  Gypsy . She had initially turned down the role, not wishing to be in the shadow of ": null
    },
    {
        "Ethel Merman": "ethel merman"
    },
    {
        ", who had portrayed the character in the original Broadway production, but eventually accepted it; when the show started in May 42 she earned a standing ovation and rave reviews. Settling into a ": null
    },
    {
        "Belgravia": "belgravia"
    },
    {
        " flat, she was soon in demand among London society, having dinners held in her honour. Following the culmination of the London run, in 42 Gypsy went on a tour of the U.S., and in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " Lansbury was awarded the ": null
    },
    {
        "Sarah Siddons Award": "sarah siddons award"
    },
    {
        " for her performance. The show eventually reached Broadway, where it ran until January 42; a critical success, it earned Lansbury her third Tony Award. After several months break, Gypsy then toured throughout the country again in the summer of 42     Desiring to move on from musicals, Lansbury decided that she wanted to appear in a production of one of ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s plays. She obtained the role of Gertrude in the ": null
    },
    {
        "National Theatre Company": "national theatre company"
    },
    {
        "s production of  Hamlet , staged at the ": null
    },
    {
        "Old Vic": "old vic"
    },
    {
        ". Directed by ": null
    },
    {
        "Peter Hall": "peter hall"
    },
    {
        ", the production ran from December 42 to May 42 receiving mixed reviews; Lansbury later commented that she hated the role, believing it too restrained. Her mood was worsened by the news that in November 42 her mother had died in California; Lansbury had her mothers body cremated and the ashes scattered near her own County Cork home. Her next theatrical appearance was in two one-act plays by ": null
    },
    {
        "Edward Albee": "edward albee"
    },
    {
        ", Counting the Ways and Listening, performed side by side at the Hartford Stage Company in ": null
    },
    {
        "Connecticut": "connecticut"
    },
    {
        ". Reviews of the production were mixed, although Lansbury was again singled out for praise. This was followed by another revival tour of Gypsy.     In April 42 Lansbury appeared in 42 performances of a revival of  The King and I  musical staged at Broadways ": null
    },
    {
        "Uris Theatre": "uris theatre"
    },
    {
        "; Lansbury played the role of Mrs Anna, replacing ": null
    },
    {
        "Constance Towers": "constance towers"
    },
    {
        ", who was on a short break. Her first cinematic role in seven years was as novelist and murder victim Salome Otterbourne in  Death on the Nile  , an adaptation of ": null
    },
    {
        "Agatha Christie": "agatha christie"
    },
    {
        "s ": null
    },
    {
        "42 novel of the same name": "death on the nile"
    },
    {
        " that was filmed in both London and Egypt. In the film Lansbury starred alongside ": null
    },
    {
        "Peter Ustinov": "peter ustinov"
    },
    {
        " and ": null
    },
    {
        "Bette Davis": "bette davis"
    },
    {
        ", who became a close friend. The role earned Lansbury the ": null
    },
    {
        "National Board of Review": "national board of review"
    },
    {
        " award for Best Supporting Actress of 42     Sweeney Todd and continued cinematic work: 42–42": null
    },
    {
        "Nellie Lovett": "mrs. lovett"
    },
    {
        " in  Sweeney Todd: The Demon Barber of Fleet Street , a ": null
    },
    {
        "Stephen Sondheim": "stephen sondheim"
    },
    {
        " musical directed by ": null
    },
    {
        "Harold Prince": "harold prince"
    },
    {
        ". Opening at the Uris Theatre, she starred alongside ": null
    },
    {
        "Len Cariou": "len cariou"
    },
    {
        " as Sweeney Todd, the murderous barber in 42th century London. After being offered the role, she jumped on the opportunity due to the involvement of Sondheim in the project; she commented that she loved the extraordinary wit and intelligence of his lyrics.  She remained in the role for fourteen months before being replaced by ": null
    },
    {
        "Dorothy Loudon": "dorothy loudon"
    },
    {
        "; the musical received mixed critical reviews, although it earned Lansbury her fourth Tony Award and  After Dark  magazines Ruby Award for Broadway Performer of the Year. She returned to the role in October 42 for a ten-month tour of six U.S. cities, with ": null
    },
    {
        "George Hearn": "george hearn"
    },
    {
        " playing the title character; the production was also filmed and broadcast on the Entertainment Channel.     In 42 she took on the role of an upper middle class housewife who champions workers rights in A Little Family Business, a farce set in ": null
    },
    {
        "Baltimore": "baltimore"
    },
    {
        " in which her son Anthony also starred. It debuted at Los Angeles ": null
    },
    {
        "Ahmanson Theatre": "ahmanson theatre"
    },
    {
        " before heading on to Broadways ": null
    },
    {
        "Martin Beck Theatre": "martin beck theatre"
    },
    {
        ". It was critically panned and induced accusations of racism from the ": null
    },
    {
        "Japanese-American": "japanese-americans"
    },
    {
        " community. That year, Lansbury was inducted into the ": null
    },
    {
        "American Theatre Hall of Fame": "american theatre hall of fame"
    },
    {
        ", and the following year appeared in a Mame revival at Broadways ": null
    },
    {
        "Gershwin Theatre": "gershwin theatre"
    },
    {
        ". Although Lansbury was praised, the show was a commercial flop, with Lansbury noting that I realised that its not a show of today. Its a ": null
    },
    {
        "period piece": "period piece"
    },
    {
        ".         Working prolifically in cinema, in 42 Lansbury appeared as Miss Froy in  The Lady Vanishes , a remake of ": null
    },
    {
        "Alfred Hitchcock": "alfred hitchcock"
    },
    {
        "s famous ": null
    },
    {
        "42 film": "the lady vanishes"
    },
    {
        ". The following year she appeared in  The Mirror Crackd , another film based on ": null
    },
    {
        "an Agatha Christie novel": "the mirror crackd from side to side"
    },
    {
        ", this time as ": null
    },
    {
        "Miss Marple": "miss marple"
    },
    {
        ", a sleuth in 42s ": null
    },
    {
        "Kent": "kent"
    },
    {
        ". Lansbury hoped to get away from the depiction of the role made famous by ": null
    },
    {
        "Margaret Rutherford": "margaret rutherford"
    },
    {
        ", instead returning to Christies description of the character; in this she created a precursor to her later role of Jessica Fletcher. She was signed to appear in two sequels as Miss Marple, but these were never made. Lansburys next film was the animated  The Last Unicorn  , for which she provided the voice of the witch Mommy Fortuna.     Returning to musical cinema, she starred as Ruth in  The Pirates of Penzance  , a film based on ": null
    },
    {
        "Gilbert and Sullivan": "gilbert and sullivan"
    },
    {
        "s ": null
    },
    {
        "comic opera of the same name": "the pirates of penzance"
    },
    {
        ", and while filming it in London sang on a recording of  The Beggars Opera . This was followed by an appearance as the grandmother in Gothic fantasy film  The Company of Wolves  . Lansbury had also begun work for television, appearing in a 42 television film with Bette Davis titled  Little Gloria... Happy at Last . She followed this with an appearance in ": null
    },
    {
        "CBS": "cbs"
    },
    {
        "s  The Gift of Love: A Christmas Story  , later describing it as the most unsophisticated thing you can imagine . A ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " television film followed, A Talent for Murder , in which she played a wheelchair-bound mystery writer; although describing it as a rush job , she agreed to do it in order to work with co-star ": null
    },
    {
        "Laurence Olivier": "laurence olivier"
    },
    {
        ". Two further miniseries featuring Lansbury appeared in 42:  Lace  and  The First Olympics: Athens 42 .         Murder, She Wrote: 42–42     In 42 Lansbury was offered 42 main television roles, one in a sitcom and the other in a detective series. Unable to do both, she chose to do the detective series despite the fact her agents had advised her to accept the sitcom.  The series,  Murder, She Wrote , centered on the character of ": null
    },
    {
        "Jessica Fletcher": "jessica fletcher"
    },
    {
        ", a retired school teacher from the fictional town of Cabot Cove, ": null
    },
    {
        "Maine": "maine"
    },
    {
        ", who became a successful detective novelist after her husbands death, also solving murders encountered during her travels. Lansbury described the character as an American ": null
    },
    {
        "Miss Marple": "miss marple"
    },
    {
        " . The series was created by ": null
    },
    {
        "Peter S. Fischer": "peter s. fischer"
    },
    {
        ", ": null
    },
    {
        "Richard Levinson": "richard levinson"
    },
    {
        ", and ": null
    },
    {
        "William Link": "william link"
    },
    {
        ", who had earlier had success with  Columbo , and the role of Jessica Fletcher had been first offered to ": null
    },
    {
        "Jean Stapleton": "jean stapleton"
    },
    {
        ", who declined the role, as did ": null
    },
    {
        "Doris Day": "doris day"
    },
    {
        ". The pilot episode, The Murder of Sherlock Holmes, premiered on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " on September 42 42 with the rest of the first season airing on Sundays from 42 to 42 p.m. Although critical reviews were mixed, it proved highly popular, with the pilot having a ": null
    },
    {
        "Nielsen rating": "nielsen ratings"
    },
    {
        " of 42 and the first season being rated top in its time slot. Designed as inoffensive family viewing, despite its topic the show eschewed depicting violence or gore, following the ": null
    },
    {
        "whodunit": "whodunit"
    },
    {
        " format rather than those of most contemporary U.S. crime shows; Lansbury herself commented that best of all, theres no violence. I hate violence.      Lansbury was defensive about Jessica Fletcher, having creative input over the characters costumes, makeup and hair, and rejecting pressure from network executives to put her in a relationship, believing that the character should remain a strong single female. When she believed that a scriptwriter had made Jessica do or say things that did not fit with the characters personality, Lansbury ensured that the script was changed. She saw Jessica as a role model for older female viewers, praising her enormous, universal appeal – that was an accomplishment I never expected in my entire life.  Lansbury biographers Rob Edelman and Audrey E. Kupferberg described the series as a television landmark in the U.S. for having an older female character as the protagonist, thereby paving the way for later series like  The Golden Girls . Lansbury herself noted that I think its the first time a show has really been aimed at the middle aged audience,  and although it was most popular among ": null
    },
    {
        "senior citizens": "senior citizens"
    },
    {
        ", it gradually gained a younger audience. By 42 one third of viewers were under age 42 It gained continually high ratings throughout most of its run, outdoing rivals in its time slot such as ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        "s  Amazing Stories  on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        ". In February 42 a spin-off was produced,  The Law & Harry McGraw , although it was short-lived.        As the show went on, Lansbury assumed a larger role behind the scenes. In 42 her own company, ": null
    },
    {
        "Corymore Productions": "corymore productions"
    },
    {
        ", began co-producing the show with Universal. Nevertheless, she began to tire of the series, and in particular the long working hours, stating that the 42–42 season would be the shows last. She changed her mind after being appointed executive producer for the 42–42 season, something that she felt made it far more interesting to me.  For the 42th season, the shows setting moved to New York City, where Jessica had taken a job teaching criminology at Manhattan University. The move was an attempt to attract younger viewers and was encouraged by Lansbury. Having become a Sunday-night institution in the U.S., the shows ratings improved during the early 42s, becoming a Top Five programme. However, CBS executives, hoping to gain a larger audience, moved it to Thursdays at 42pm, opposite NBCs new sitcom,  Friends . Lansbury was angry at the move, believing that it ignored the shows core audience. The final episode of the series aired in May 42 and ended with Lansbury voicing a Goodbye from Jessica message at the end. Tom Shales wrote in The Washington Post, The title of the shows last episode, Death by Demographics, is in itself something of a protest. Murder, She Wrote is partly a victim of commercial televisions mad youth mania.  At the time it tied the original  Hawaii Five-O  as the longest-running ": null
    },
    {
        "detective drama": "detective fiction"
    },
    {
        " series in television history,  and the role would prove to be the most successful and prominent of Lansburys career. Lansbury initially had plans for a Murder She Wrote television film that would be a musical with a score composed by Jerry Herman. While this project didnt materialise, it was transformed into  Mrs Santa Claus  – in which Lansbury played ": null
    },
    {
        "Santa Claus": "santa claus"
    },
    {
        " wife – which proved to be a ratings hit.     Throughout the run of Murder, She Wrote, Lansbury had continued making appearances in other television films, miniseries and cinema. In 42 she co-hosted the ": null
    },
    {
        "New York Philharmonic": "new york philharmonic"
    },
    {
        "s televised tribute to the centenary of the ": null
    },
    {
        "Statue of Liberty": "statue of liberty"
    },
    {
        " with ": null
    },
    {
        "Kirk Douglas": "kirk douglas"
    },
    {
        ".  In 42 she appeared as the protagonists mother in Rage of Angels: The Story Continues, and in 42 portrayed Nan Moore – the mother of a victim of the real-life ": null
    },
    {
        "Korean Air Lines Flight 42": "korean air lines flight 007"
    },
    {
        " plane crash – in  Shootdown ; being a mother herself, she had been enormously touched by the incident.  42 saw her featured in  The Shell Seekers  as an Englishwoman recuperating from a heart attack, and in 42 she starred in The Love She Sought as an American school teacher who falls in love with a Catholic priest while visiting Ireland; Lansbury thought it a marvelous womans story.  She next starred as the ": null
    },
    {
        "Cockney": "cockney"
    },
    {
        " Mrs Harris in a film adaptation of the novel  Mrs Arris Goes to Paris , which was directed by her son and executive produced by her stepson. Her highest profile cinematic role since The Manchurian Candidate was as the voice of the singing teapot ": null
    },
    {
        "Mrs. Potts": "mrs. potts"
    },
    {
        " in the 42 ": null
    },
    {
        "Disney": "disney"
    },
    {
        " animation  Beauty and the Beast , an appearance that she considered to be a gift to her 42 grandchildren. Lansbury performed the ": null
    },
    {
        "title song": "beauty and the beast"
    },
    {
        " to the film, which won the ": null
    },
    {
        "Academy Award for Best Original Song": "academy award for best original song"
    },
    {
        ", ": null
    },
    {
        "Golden Globe Award for Best Original Song": "golden globe award for best original song"
    },
    {
        " and ": null
    },
    {
        "Grammy Award for Best Song Written for a Motion Picture, Television or Other Visual Media": "grammy award for best song written for a motion picture, television or other visual media"
    },
    {
        ".     Lansburys Murder, She Wrote fame resulted in her being employed to appear in advertisements and infomercials for ": null
    },
    {
        "Bufferin": "bufferin"
    },
    {
        ", ": null
    },
    {
        "MasterCard": "mastercard"
    },
    {
        " and the ": null
    },
    {
        "Beatrix Potter": "beatrix potter"
    },
    {
        " Company. In 42 she released a ": null
    },
    {
        "video": "vhs"
    },
    {
        " titled Angela Lansburys Positive Moves: My Personal Plan for Fitness and Well-Being, in which she outlined her personal exercise routine, and in 42 published a book with the same title co-written with Mimi Avins, which she dedicated to her mother. As a result of her work she was appointed a ": null
    },
    {
        "CBE": "commander of the order of the british empire"
    },
    {
        " by the British government, given to her in a ceremony by the ": null
    },
    {
        "Prince of Wales": "charles, prince of wales"
    },
    {
        " at the British consulate in Los Angeles. While living most of the year in California, Lansbury spent Christmases and summers at Corymore House, her farmhouse overlooking the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        " at ": null
    },
    {
        "Ballywilliam": "ballywilliam"
    },
    {
        ", near Churchtown South, County Cork, which she had had specially built as a family home in 42       Following the end of Murder, She Wrote, Lansbury returned to the theatre. Although cast in the lead role in the 42 ": null
    },
    {
        "Kander and Ebb": "kander and ebb"
    },
    {
        " musical  The Visit , she withdrew before it opened due to her husbands deteriorating health.  Peter died in January 42 of congestive heart failure at the couples ": null
    },
    {
        "Brentwood, California": "brentwood, california"
    },
    {
        " home. Lansbury felt that after this event she would not take on any more major acting roles, and that instead might make a few ": null
    },
    {
        "cameo appearance": "cameo appearance"
    },
    {
        "s but nothing more.  Wanting to spend more time in New York City, in 42 she purchased a $42 million ": null
    },
    {
        "condominium": "condominium"
    },
    {
        " in ": null
    },
    {
        "Manhattan": "manhattan"
    },
    {
        ", and in a 42 interview noted that she also had homes in Ireland and Los Angeles.        She made an appearance in a Season 42 episode of the television show  Law & Order: Special Victims Unit , for which she was nominated for an Emmy Award in 42  She starred in the 42 film  Nanny McPhee  as Aunt Adelaide, commenting that it was such fun to play a baddie!  and later informing an interviewer that working on Nanny McPhee pulled me out of the abyss after the loss of her husband.  She then appeared in the 42 film  Mr. Poppers Penguins , opposite ": null
    },
    {
        "Jim Carrey": "jim carrey"
    },
    {
        ".  Lansbury returned to Broadway after a 42-year absence in  Deuce , a play by ": null
    },
    {
        "Terrence McNally": "terrence mcnally"
    },
    {
        " that opened at the ": null
    },
    {
        "Music Box Theatre": "music box theatre"
    },
    {
        " in May 42 for a limited run of eighteen weeks.  Lansbury received a Tony Award nomination for ": null
    },
    {
        "Best Leading Actress in a Play": "tony award for best performance by a leading actress in a play"
    },
    {
        " for her role.      In March 42 she returned to Broadway for a revival of  Blithe Spirit  at the ": null
    },
    {
        "Shubert Theatre": "shubert theatre"
    },
    {
        ", where she took on the role of Madame Arcati.  Discussing the character, she stated: I love her. Shes completely off-the-wall but utterly secure in her own convictions.  This appearance earned her the ": null
    },
    {
        "Tony Award for Best Featured Actress in a Play": "tony award for best performance by a featured actress in a play"
    },
    {
        "; this was her fifth Tony Award, tying her with the previous record holder for the number of Tony Awards, ": null
    },
    {
        "Julie Harris": "julie harris"
    },
    {
        ", albeit all of Harris Tonys were for Best Leading Actress.  From December 42 to June 42 Lansbury then starred as Madame Armfeldt alongside ": null
    },
    {
        "Catherine Zeta-Jones": "catherine zeta-jones"
    },
    {
        " in the first Broadway revival of  A Little Night Music , held at the ": null
    },
    {
        "Walter Kerr Theatre": "walter kerr theatre"
    },
    {
        ".  The role earned her a seventh Tony Award nomination,  while in May 42 she was awarded an honorary doctoral degree from ": null
    },
    {
        "Manhattan School of Music": "manhattan school of music"
    },
    {
        ".      From April to July 42 Lansbury starred as womens rights advocate Sue-Ellen Gamadge in the Broadway revival of ": null
    },
    {
        "Gore Vidal": "gore vidal"
    },
    {
        "s  The Best Man  at the ": null
    },
    {
        "Gerald Schoenfeld Theatre": "gerald schoenfeld theatre"
    },
    {
        ".  From February to June 42 Lansbury starred alongside ": null
    },
    {
        "James Earl Jones": "james earl jones"
    },
    {
        " in an Australian tour of  Driving Miss Daisy .  In November 42 she received an ": null
    },
    {
        "Academy Honorary Award": "academy honorary award"
    },
    {
        " for her lifetime achievement at the ": null
    },
    {
        "Governors Awards": "governors awards"
    },
    {
        ".  From March to June 42 Lansbury reprised her performance as Madame Arcati in Blithe Spirit at the ": null
    },
    {
        "Gielgud Theatre": "gielgud theatre"
    },
    {
        " in Londons West End, her first London stage appearance in nearly 42 years.  While in London, she made an appearance at the Angela Lansbury Film Festival in Poplar, a screening of some of her most popular films organised by Poplar Film.  From December 42 to March 42 she joined the tour of Blithe Spirit across North America.      In April 42 aged 42 she received her first ": null
    },
    {
        "Olivier Award": "olivier award"
    },
    {
        " as Best Supporting Actress for her performance as Arcati,  and in November 42 was awarded the Oscar Hammerstein Award for Lifetime Achievement in Musical Theatre.      On June 42 42 it was officially announced that Lansbury would return to Broadway in the 42–42 season in a revival of ": null
    },
    {
        "Enid Bagnold": "enid bagnold"
    },
    {
        "s 42 play  The Chalk Garden . The play was produced by ": null
    },
    {
        "Scott Rudin": "scott rudin"
    },
    {
        " at a theatre to-be-announced. Viagas, Robert.  , Playbill.com, June 42 42 However, in an interview published on September 42 42 Lansbury stated that she will not be performing in The Chalk Garden, stating, in part: At my time of life, Ive decided that I want to be with family more and being alone in New York doing a play requires an extraordinary amount of time left alone.   broadwayworld.com, September 42 42     In December 42 Lansbury took on the role of Aunt March in the ": null
    },
    {
        "BBC television": "bbc television"
    },
    {
        " miniseries  Little Women .  She also co-starred in  Mary Poppins Returns , a sequel to the Academy Award-winning ": null
    },
    {
        "42 original film": "mary poppins"
    },
    {
        ", set 42 years later in ": null
    },
    {
        "Depression": "great depression"
    },
    {
        "-era London. Filming began at ": null
    },
    {
        "Shepperton Studios": "shepperton studios"
    },
    {
        " in February 42 and the film was released in December 42   independent.co.uk, February 42 42          Lansbury describes herself as an amalgam of British, Irish and American although throughout her life she has spoken with an English accent. She holds Irish citizenship.  Biographer ": null
    },
    {
        "Martin Gottfried": "martin gottfried"
    },
    {
        " characterized her as Meticulous. Cautious. Self-editing. Deliberate. It is what the British call reserved,  adding that she was as concerned, as sensitive, and as sympathetic as anyone might want in a friend.  Also noting that she had a profound sense of privacy,  he added that she disliked attempts at ": null
    },
    {
        "flattery": "flattery"
    },
    {
        ".     Lansbury has been married twice, first to the actor ": null
    },
    {
        "Richard Cromwell": "richard cromwell"
    },
    {
        ", when she was 42 and Cromwell was 42 Cromwell and Lansbury eloped and were married in a small civil ceremony on September 42 42 The marriage ended in divorce in 42 but they remained friends until his death in 42 In 42 she married actor ": null
    },
    {
        "Peter Shaw": "peter shaw"
    },
    {
        ", and they remained together for 42 years until his death in 42; she asserted that We had the perfect relationship. Not many people can say that.   She acquired a step-son, David, from Shaws first marriage. They had two children of their own, Anthony Peter and Deirdre Ann . While Lansbury repeatedly stated that she wanted to put her children before her career, she admitted that she often had to leave them in California for long periods when she was working elsewhere. She brought up her children to be ": null
    },
    {
        "Episcopalian": "episcopal church"
    },
    {
        ", although they were not members of a congregation. She has stated that I believe that God is within all of us, that we are perfect, precious beings, and that we have to put our faith and trust in that.         In the latter part of the 42s, Anthony and Deirdre became involved in ": null
    },
    {
        "the growing counterculture movement": "counterculture of the 1960s"
    },
    {
        " and started using recreational drugs. Deirdre developed an acquaintance with the ": null
    },
    {
        "Manson family": "manson family"
    },
    {
        ", while Anthony became addicted to cocaine and heroin, giving it up in 42 After recovering, Anthony became a television director, and directed 42 episodes of Murder, She Wrote, also marrying and having 42 children. Deirdre married a chef, and together they opened a restaurant in ": null
    },
    {
        "West Los Angeles": "west los angeles"
    },
    {
        ". Lansbury is a cousin of the ": null
    },
    {
        "Postgate family": "postgate family"
    },
    {
        ", including the animator, writer and social activist ": null
    },
    {
        "Oliver Postgate": "oliver postgate"
    },
    {
        ",  as well as the academic and novelist ": null
    },
    {
        "Coral Lansbury": "coral lansbury"
    },
    {
        ", whose son is former Prime Minister of Australia ": null
    },
    {
        "Malcolm Turnbull": "malcolm turnbull"
    },
    {
        ".      As a young actress, Lansbury was a self-professed homebody, commenting that I love the world of housekeeping.  She preferred spending quiet evenings inside with friends to the Hollywood night life. Her hobbies at the time included reading, horse riding, playing tennis, cooking and playing the piano, also having a keen interest in gardening. In 42 it was reported that she continued to enjoy gardening, and also enjoyed doing ": null
    },
    {
        "crossword": "crossword"
    },
    {
        "s. She has cited ": null
    },
    {
        "F. Scott Fitzgerald": "f. scott fitzgerald"
    },
    {
        " as her favorite author, and cited  Roseanne  and  Seinfeld  as being among her favorite television shows. Lansbury was an avid letter writer, doing so by hand and making copies of all her correspondences. At Howard Gotliebs request, Lansburys papers are housed at the ": null
    },
    {
        "Howard Gotlieb Archival Research Center": "howard gotlieb archival research center"
    },
    {
        " at ": null
    },
    {
        "Boston University": "boston university"
    },
    {
        ".      She is a supporter of the United States ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        ", describing herself as Democrat from the ground up,  and the British ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        ". Throughout her career, Lansbury supported a variety of charities, particularly those such as Abused Wives in Crisis that combated ": null
    },
    {
        "domestic abuse": "domestic abuse"
    },
    {
        " and those who worked toward rehabilitating drug users. In the 42s, she began to support a number of charities engaged in the fight against ": null
    },
    {
        "HIV/AIDS": "hiv/aids"
    },
    {
        ". In early life she had been a chain smoker, giving up the addiction ": null
    },
    {
        "cold turkey": "cold turkey"
    },
    {
        " in the mid42s. In 42 and 42 she had ": null
    },
    {
        "cosmetic surgery": "cosmetic surgery"
    },
    {
        " on her neck to prevent it from broadening with age, but has stated that she has not had surgery to make her face look younger. During the 42s, she began to suffer from ": null
    },
    {
        "arthritis": "arthritis"
    },
    {
        ", in May 42 had ": null
    },
    {
        "hip replacement": "hip replacement"
    },
    {
        " surgery, and in 42 had ": null
    },
    {
        "knee replacement": "knee replacement"
    },
    {
        " surgery.           In the 42s,  The New York Times  referred to Lansbury as the First Lady of Musical Theatre.    Lansbury described herself as an actress who could also ": null
    },
    {
        "sing": "singing"
    },
    {
        ", with Sondheim stating that she had a strong voice, albeit with a limited range.   Lansburys authorised biographer ": null
    },
    {
        "Martin Gottfried": "martin gottfried"
    },
    {
        " described her as an American icon,  with a practically saintly public image.     A 42 interviewer for The New York Times described her as one of the few actors it makes sense to call beloved, noting that a 42 article in People magazine awarded her a perfect score on its lovability index. The  New Statesman  noted that she has the kind of pulling power many younger and more ubiquitous actors can only dream of, while an article in  The Independent  has suggested that she could be considered Britains most successful actress.  She is a gay icon,  and has asserted that she is very proud of the fact, attributing her popularity among the LGBT community to her performance in Mame.        She has been recognized for her achievements in Britain on multiple occasions. In 42 the ": null
    },
    {
        "British Academy of Film and Television Arts": "british academy of film and television arts"
    },
    {
        " gave Lansbury a Lifetime Achievement Award. Lansbury was appointed a ": null
    },
    {
        "Commander of the Order of the British Empire": "commander of the order of the british empire"
    },
    {
        " in the ": null
    },
    {
        "42 Birthday Honours": "1994 birthday honours"
    },
    {
        ", and promoted to a ": null
    },
    {
        "Dame Commander": "dame commander"
    },
    {
        " of the Order of the British Empire in the ": null
    },
    {
        "42 New Year Honours": "2014 new year honours"
    },
    {
        " for services to drama, charitable work, and philanthropy.  On being made a dame by Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        " at ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", Lansbury stated: Im joining a marvellous group of women I greatly admire like ": null
    },
    {
        "Judi Dench": "judi dench"
    },
    {
        " and ": null
    },
    {
        "Maggie Smith": "maggie smith"
    },
    {
        ". Its a lovely thing to be given that nod of approval by your own country and I really cherish it.     Lansbury has never won an ": null
    },
    {
        "Emmy Award": "emmy award"
    },
    {
        " despite 42 nominations  for which she was nominated over a 42-year period. As of 42 she held the record for the most Emmy losses by a performer.  She has 42 Primetime Emmy Award nominations per  She has been nominated three times for the ": null
    },
    {
        "Academy Award for Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        " but has never won; reflecting on this in 42 she stated that she was at first terribly disappointed, but subsequently very glad that did not win, because she believes that she would have otherwise had a less successful career.  However, she has received ": null
    },
    {
        "Golden Globe": "golden globe awards"
    },
    {
        "  , goldenglobes.org; retrieved April 42 42 and ": null
    },
    {
        "Peoples Choice Awards": "peoples choice awards"
    },
    {
        " for her television and film work.  , ": null
    },
    {
        "Internet Movie Database": "internet movie database"
    },
    {
        "; retrieved April 42 42     In 42 the ": null
    },
    {
        "Academy of Motion Picture Arts and Sciences": "academy of motion picture arts and sciences"
    },
    {
        " Board of Governors voted to bestow upon her an ": null
    },
    {
        "Honorary Academy Award": "honorary academy award"
    },
    {
        " for her lifetime achievements in the industry. ": null
    },
    {
        "Emma Thompson": "emma thompson"
    },
    {
        " and ": null
    },
    {
        "Geoffrey Rush": "geoffrey rush"
    },
    {
        " offered up tributes at the ": null
    },
    {
        "Governors Awards": "governors awards"
    },
    {
        " where the ceremony was held, and ": null
    },
    {
        "Robert Osborne": "robert osborne"
    },
    {
        " of ": null
    },
    {
        "TCM": "turner classic movies"
    },
    {
        " presented her with the Oscar.                Angela Lansburys Positive Moves: My Personal Plan for Fitness and Well-Being. New York: ": null
    },
    {
        "Delacorte Press": "delacorte press"
    },
    {
        ". ": null
    }
]