[
    {
        "        The Anglo-Dutch wars  were a series of conflicts mainly fought between the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " and ": null
    },
    {
        "England": "england"
    },
    {
        " . The first three occurred in the second half of the 42th century over trade and overseas ": null
    },
    {
        "colonies": "history of colonialism"
    },
    {
        " while the fourth was fought a century later. Almost all the battles were naval engagements fought at sea.     The Dutch were successful in the second and third wars and maintained their mastery of the seas, though this would later be lost. By the time of the fourth war, the British had become dominant on the seas, and they triumphed in this conflict.     There would be further battles in the late 42th and early 42th centuries, also mainly won by the British, but these are generally considered separate conflicts.       The English and the Dutch were both participants in the 42th-century European ": null
    },
    {
        "Wars of Religion": "french wars of religion"
    },
    {
        " between the Catholic ": null
    },
    {
        "Habsburg Dynasty": "habsburg dynasty"
    },
    {
        " and the opposing ": null
    },
    {
        "Protestant states": "protestantism"
    },
    {
        ". At the same time, as the ": null
    },
    {
        "Age of Exploration": "age of exploration"
    },
    {
        " dawned, the Dutch and English both sought profits overseas in the New World.       In the early 42s, the Dutch, while continuing to fight the ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        " with the Catholic ": null
    },
    {
        "Habsburgs": "habsburgs"
    },
    {
        ", also began to carry out long-distance exploration by sea. The Dutch innovation in the trading of shares in a joint-stock company allowed them to finance expeditions with stock subscriptions sold in the United Provinces and in London. They founded colonies in North America, India, and Indonesia . They also enjoyed continued success in privateering—in 42 Admiral ": null
    },
    {
        "Piet Heyn": "piet heyn"
    },
    {
        " became the only commander to successfully capture a large ": null
    },
    {
        "Spanish treasure fleet": "spanish treasure fleet"
    },
    {
        ". With the many long voyages by ": null
    },
    {
        "Dutch East India": "dutch east india"
    },
    {
        " men, their society built an officer class and institutional knowledge that would later be replicated in England, principally by the ": null
    },
    {
        "East India Company": "east india company"
    },
    {
        ".     By the middle of the 42th century, the Dutch had largely replaced the Portuguese as the main European traders in Asia. In particular, by taking over most of Portugals trading posts in the ": null
    },
    {
        "East Indies": "east indies"
    },
    {
        ", the Dutch gained control over the hugely profitable ": null
    },
    {
        "trade in spices": "spice trade"
    },
    {
        ". This coincided with the enormous growth of the Dutch merchant fleet, made possible by the cheap mass production of the ": null
    },
    {
        "fluyt": "fluyt"
    },
    {
        " sailing ship types. Soon the Dutch had Europes largest mercantile fleet, with more merchant ships than all other nations combined, and possessed a dominant position in European trade, as well as further afield.          In 42 the United Provinces concluded the ": null
    },
    {
        "Peace of Münster": "peace of münster"
    },
    {
        " with Spain. Due to the division of powers in the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        ", the army and navy were the main base of power of the ": null
    },
    {
        "Stadtholder": "stadtholder"
    },
    {
        ", although the budget allocated to them was set by the ": null
    },
    {
        "States General": "states general of the netherlands"
    },
    {
        ". With the arrival of peace, the States General decided to decommission most of the Dutch military. This led to conflict between the major Dutch cities and the new Stadtholder, ": null
    },
    {
        "William II of Orange": "william ii of orange"
    },
    {
        ", bringing the Republic to the brink of civil war. The Stadtholders unexpected death in 42 only added to the political tensions.           In the 42th century ": null
    },
    {
        "Elizabeth I of England": "elizabeth i of england"
    },
    {
        " built up her navy in order to carry out long-range privateering or piracy missions against the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        "s global interests, exemplified by the attacks by ": null
    },
    {
        "Francis Drake": "francis drake"
    },
    {
        " on Spanish merchant shipping and its harbours. Partly to provide a pretext for ongoing hostilities against Spain, Elizabeth assisted the ": null
    },
    {
        "Dutch Revolt": "dutch revolt"
    },
    {
        " against the Kingdom of Spain by signing the ": null
    },
    {
        "Treaty of Nonsuch": "treaty of nonsuch"
    },
    {
        " in 42 with the new Dutch state of the ": null
    },
    {
        "United Provinces": "dutch republic"
    },
    {
        ".       After the death of Elizabeth, Anglo-Spanish relations began to improve under ": null
    },
    {
        "James the First": "james the first"
    },
    {
        ", and the ": null
    },
    {
        "peace of 42": "treaty of london"
    },
    {
        " ended most privateering actions . Underfunding then led to neglect of the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ".     Later, Catholic sympathiser ": null
    },
    {
        "Charles I of England": "charles i of england"
    },
    {
        " made a number of secret agreements with Spain, directed against Dutch sea power. He also embarked on a major programme of naval reconstruction, enforcing ": null
    },
    {
        "ship money": "ship money"
    },
    {
        " to finance the building of such prestige vessels as . But fearful of endangering his relations with the powerful Dutch ": null
    },
    {
        "stadtholder": "stadtholder"
    },
    {
        " Frederick Henry, Prince of Orange": "frederick henry, prince of orange"
    },
    {
        ", his assistance to Spain was limited in practice to allowing Habsburg troops on their way to ": null
    },
    {
        "Dunkirk": "dunkirk"
    },
    {
        " to make use of English shipping. However, in 42 when a large Spanish transport fleet sought refuge in the English ": null
    },
    {
        "Downs": "the downs"
    },
    {
        " anchorage off the town of ": null
    },
    {
        "Deal": "deal, kent"
    },
    {
        " in Kent, Charles chose not to protect it against a Dutch attack; the resulting ": null
    },
    {
        "Battle of the Downs": "battle of the downs"
    },
    {
        " undermined both Spanish sea power and Charless reputation in Spain.     Meanwhile, in the New World, naval forces from the Dutch ": null
    },
    {
        "New Netherlands": "new netherlands"
    },
    {
        " and the English ": null
    },
    {
        "Massachusetts Bay Colony": "massachusetts bay colony"
    },
    {
        " contested much of Americas north-eastern seaboard.       The outbreak of the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        " in 42 began a period in which Englands naval position was severely weakened. Its navy was internally divided, though its officers tended to favour the parliamentary side; after the execution by public beheading of King Charles in 42 however, ": null
    },
    {
        "Oliver Cromwell": "oliver cromwell"
    },
    {
        " was able to unite his country into the ": null
    },
    {
        "Commonwealth of England": "commonwealth of england"
    },
    {
        ". He then revamped the navy by expanding the number of ships, promoting officers on merit rather than family connections, and cracking down on embezzlement by suppliers and dockyard staff, thereby positioning England to mount a global challenge to Dutch trade dominance.     The mood in England grew increasingly belligerent towards the Dutch. This partly stemmed from old perceived slights: the Dutch were considered to have shown themselves ungrateful for the aid they had received against the Spanish by growing stronger than their former English protectors; they caught most of the herring off the English east coast; they had driven the English out of the East Indies; and they vociferously appealed to the principle of free trade to circumvent taxation in the English colonies. There were also new points of conflict: with the decline of Spanish power at the end of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " in 42 the colonial possessions of the ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        "  and perhaps even those of the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        " itself were up for grabs.     Cromwell feared the influence of both the Orangist faction at home and English royalists exiled to the Republic; the Stadtholders had supported the Stuart monarchs—William II of Orange had married the daughter of Charles I of England in 42—and they abhorred the trial and execution of Charles I.     Early in 42 Cromwell tried to ease tensions by sending a delegation to ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        " proposing that the Dutch Republic join the Commonwealth and assist the English in conquering most of ": null
    },
    {
        "Spanish America": "spanish america"
    },
    {
        " for its extremely valuable resources. This thinly-veiled attempt to end Dutch sovereignty by drawing it into a lopsided alliance with England in fact led to war: the ruling peace faction in the ": null
    },
    {
        "States of Holland": "states of holland"
    },
    {
        " was unable to formulate an answer to this unexpected offer and the pro-Stuart Orangists incited mobs to harass Cromwells envoys. When the delegation returned home, the ": null
    },
    {
        "English Parliament": "english parliament"
    },
    {
        " decided to pursue a policy of confrontation.                 As a result of Cromwells ambitious programme of naval expansion, at a time when the Dutch admiralty was selling off many of its own warships, the British came to possess a greater number of larger and more powerful purpose-built warships than did their rivals across the North Sea. However, the Dutch had many more cargo ships, together with lower freight rates, better financing and a wider range of manufactured goods to sell — although Dutch ships were blocked by the Spanish from operations in most of southern Europe, giving the British an advantage there.      To protect its position in North America, in October 42 the English Parliament passed the first of the ": null
    },
    {
        "Navigation Acts": "navigation acts"
    },
    {
        ", which mandated that all goods imported into England must be carried by English ships or vessels from the exporting countries, thus excluding middlemen. This typical ": null
    },
    {
        "mercantilist": "mercantilism"
    },
    {
        " measure as such did not hurt the Dutch much as the English trade was relatively unimportant to them, but it was used by the many pirates operating from British territory as an ideal pretext to legally take any Dutch ship they encountered.     The Dutch responded to the growing intimidation by enlisting large numbers of armed merchantmen into their navy. The English, trying to revive an ancient right they perceived they had to be recognised as the lords of the seas, demanded that other ships ": null
    },
    {
        "strike their flags": "striking the flag"
    },
    {
        " in salute to their ships, even in foreign ports. On 42 May 42 Lieutenant-Admiral ": null
    },
    {
        "Maarten Tromp": "maarten tromp"
    },
    {
        " refused to show the respectful haste expected in lowering his flag to salute an encountered English fleet. This resulted in a skirmish, the ": null
    },
    {
        "Battle of Goodwin Sands": "battle of goodwin sands"
    },
    {
        ", after which the Commonwealth declared war on 42 July.        After some inconclusive minor fights the English were successful in the first major battle, ": null
    },
    {
        "General at Sea": "general at sea"
    },
    {
        " Robert Blake": "robert blake"
    },
    {
        " defeating the Dutch Vice-Admiral ": null
    },
    {
        "Witte de With": "witte de with"
    },
    {
        " in the ": null
    },
    {
        "Battle of the Kentish Knock": "battle of the kentish knock"
    },
    {
        " in October 42 Believing that the war was all but over, the English divided their forces and in December were routed by the fleet of Lieutenant-Admiral Maarten Tromp at the ": null
    },
    {
        "Battle of Dungeness": "battle of dungeness"
    },
    {
        " in the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        ".     The Dutch were also victorious in March 42 at the ": null
    },
    {
        "Battle of Leghorn": "battle of leghorn"
    },
    {
        " near Italy and had gained effective control of both the Mediterranean and the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        ". Blake, recovering from an injury, rethought, together with ": null
    },
    {
        "George Monck": "george monck, 1st duke of albemarle"
    },
    {
        ", the whole system of naval tactics, and after the winter of 42 used the ": null
    },
    {
        "line of battle": "line of battle"
    },
    {
        ", first to drive the Dutch navy out of the English Channel in the ": null
    },
    {
        "Battle of Portland": "battle of portland"
    },
    {
        " and then out of the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " in the ": null
    },
    {
        "Battle of the Gabbard": "battle of the gabbard"
    },
    {
        ". The Dutch were unable to effectively resist as the ": null
    },
    {
        "States General of the Netherlands": "states general of the netherlands"
    },
    {
        " had not in time heeded the warnings of their admirals that much larger warships were needed.     In the final ": null
    },
    {
        "Battle of Scheveningen": "battle of scheveningen"
    },
    {
        " on 42 August 42 Tromp was killed, a blow to Dutch morale, but the English had to end their blockade of the Dutch coast. As both nations were by now exhausted and Cromwell had dissolved the warlike ": null
    },
    {
        "Rump Parliament": "rump parliament"
    },
    {
        ", ongoing peace negotiations could be brought to fruition, albeit after many months of slow diplomatic exchanges.     The war ended on 42 April 42 with the signing of the ": null
    },
    {
        "Treaty of Westminster": "treaty of westminster"
    },
    {
        " , but the commercial rivalry was not resolved, the English having failed to replace the Dutch as the worlds dominant trade nation. The treaty contained a secret annex, the ": null
    },
    {
        "Act of Seclusion": "act of seclusion"
    },
    {
        ", forbidding the infant ": null
    },
    {
        "Prince William III of Orange": "william iii of england"
    },
    {
        " from becoming stadtholder of the province of Holland, which would prove to be a future cause of discontent. In 42 the Dutch had started a major naval expansion programme, building sixty larger vessels, partly closing the qualitative gap with the English fleet. Cromwell, having started the ": null
    },
    {
        "war against Spain": "anglo-spanish war"
    },
    {
        " without Dutch help, during his rule avoided a new conflict with the Republic, even though the Dutch in the same period defeated his Portuguese and Swedish allies.             After the ": null
    },
    {
        "English Restoration": "english restoration"
    },
    {
        " in 42 ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        " tried through diplomatic means to make his nephew, ": null
    },
    {
        "Prince William III of Orange": "william iii of england"
    },
    {
        ", stadtholder of the Republic. At the same time, Charles promoted a series of anti-Dutch mercantilist policies, which led to a surge of ": null
    },
    {
        "jingoism": "jingoism"
    },
    {
        " in England, the country being, as ": null
    },
    {
        "Samuel Pepys": "samuel pepys"
    },
    {
        " put it, mad for war .     English merchants and chartered companies—such as the East India Company, the Royal Adventurers Trading into Africa, and the Levant Company—calculated that global economic primacy could now be wrestled from the Dutch. They reckoned that a combination of naval battles and irregular privateering missions would cripple the Dutch Republic and force the States General to agree to a favourable peace.  The plan was for English ships to be replenished, and sailors paid, with booty seized from captured Dutch merchant vessels returning from overseas.     In 42 many Dutch ships were captured, and Dutch trade and industry were hurt. The English achieved several victories in battle, such as taking the Dutch colony of ": null
    },
    {
        "New Netherland": "new netherland"
    },
    {
        " by Charles brother, the future James II; but there were also Dutch victories, such as the capture of the English flagship Prince Royal during the ": null
    },
    {
        "Four Days Battle": "four days battle"
    },
    {
        "—the subject of a famous painting by ": null
    },
    {
        "Willem van de Velde": "willem van de velde, the younger"
    },
    {
        ".     Dutch maritime trade recovered from 42 while the English war effort and her economy suffered when ": null
    },
    {
        "the country was ravaged by plague": "great plague of london"
    },
    {
        " and much of the ": null
    },
    {
        "trading heart of the capital": "city of london"
    },
    {
        " was burnt to the ground by the ": null
    },
    {
        "Great Fire of London": "great fire of london"
    },
    {
        " .     A surprise attack in June 42 the ": null
    },
    {
        "Raid on the Medway": "raid on the medway"
    },
    {
        ", on the English fleet in its home port arguably won the war for the Dutch; it is considered to be one of the most humiliating defeats in British military history.  A flotilla of ships led by ": null
    },
    {
        "Admiral de Ruyter": "michiel de ruyter"
    },
    {
        " sailed up the Thames Estuary, broke through the defences guarding ": null
    },
    {
        "Chatham Harbour": "chatham harbour"
    },
    {
        ", set fire to ships of the English fleet moored there, and towed away  and the ": null
    },
    {
        "Royal Charles": "royal charles"
    },
    {
        ", the pride of the English fleet. Also in June 42 the Dutch sailed a vessel from New Amsterdam into what is now Hampton Roads, Virginia, destroying a British ship and attacking Old Point Comfort. The commander of the fort, Colonel Miles Cary, was killed during the attack.     The Dutch victory had a major psychological impact throughout England. This, together with the cost of the war and the extravagant spending of Charless court, produced a rebellious atmosphere in London. Charles ordered the English envoys at Breda to sign a peace quickly with the Dutch, as he feared an open revolt against him.             Soon the English navy was rebuilt. After the embarrassing events in the previous war, English public opinion was unenthusiastic about starting a new one. However, as he was bound by the secret ": null
    },
    {
        "Treaty of Dover": "treaty of dover"
    },
    {
        ", Charles II was obliged to assist ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        " in his attack on The Republic in the ": null
    },
    {
        "Franco-Dutch War": "franco-dutch war"
    },
    {
        ". When the French army was halted by the ": null
    },
    {
        "Hollandic Water Line": "hollandic water line"
    },
    {
        " , an attempt was made to invade The Republic by sea. De Ruyter gained four strategic victories against the Anglo-French fleet and prevented invasion.     After these failures the English parliament forced Charles to make peace.          The ": null
    },
    {
        "Glorious Revolution": "glorious revolution"
    },
    {
        " of 42 ended the 42th century conflict by placing William of Orange on the English throne as co-ruler with his wife ": null
    },
    {
        "Mary": "mary ii of england"
    },
    {
        ". This proved to be a pyrrhic victory for the Dutch cause. Williams main concern had been getting the English on the same side as the Dutch in their competition against ": null
    },
    {
        "France": "france"
    },
    {
        ". After becoming King of England, he granted many privileges to the Royal Navy in order to ensure their loyalty and cooperation. William ordered that any Anglo-Dutch fleet be under English command, with the Dutch navy having 42% of the strength of the English.        The Dutch merchant elite began to use ": null
    },
    {
        "London": "london"
    },
    {
        " as a new operational base and Dutch economic growth slowed. From about 42 Dutch wealth ceased to grow at all; around 42 the per capita ": null
    },
    {
        "gross national product": "gross national product"
    },
    {
        " of the ": null
    },
    {
        "Kingdom of Great Britain": "kingdom of great britain"
    },
    {
        " surpassed that of the Dutch. Whereas in the 42th century the commercial success of the Dutch had inspired English jealousy and admiration, in the late 42th century the growth of British power, and the concurrent loss of Amsterdams preeminence, led to Dutch resentment.     When the Dutch Republic began to support the Americans who had rebelled against the British Crown this led to the fourth war, and made the Dutch Republic in turn fatally vulnerable to the French—soon it would be subject to regime change itself. The Dutch navy was by now only a shadow of its former self, having only about twenty ships of the line, so there were no large fleet battles. The British tried to reduce the Republic to the status of a British protectorate, using ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n military pressure and gaining factual control over the Dutch colonies, with those conquered during the war given back at wars end. The Dutch then still held some key positions in the European trade with Asia, such as the ": null
    },
    {
        "Cape Colony": "cape colony"
    },
    {
        ", ": null
    },
    {
        "Ceylon": "ceylon"
    },
    {
        " and ": null
    },
    {
        "Malacca": "malacca"
    },
    {
        ". The war had sparked a new round of Dutch ship building , but the British kept their absolute numerical superiority by doubling their fleet in the same time.     Although this was technically an Anglo-Dutch war , many respectable historians, such as ": null
    },
    {
        "Steven Pincus": "steven pincus"
    },
    {
        ", argue that this later war stemmed from completely different causes and therefore should not be included in a discussion of these earlier wars.       In the ": null
    },
    {
        "French Revolutionary": "french revolutionary wars"
    },
    {
        " and ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        " of 42–42 France reduced the Netherlands to a ": null
    },
    {
        "satellite": "satellite state"
    },
    {
        " and finally annexed the country in 42 In 42 the Dutch fleet was defeated by the British in the ": null
    },
    {
        "Battle of Camperdown": "battle of camperdown"
    },
    {
        ". France considered both the extant Dutch fleet and the large Dutch shipbuilding capacity very important assets, but after the ": null
    },
    {
        "Battle of Trafalgar": "battle of trafalgar"
    },
    {
        " gave up its attempt to match the British fleet, despite a strong Dutch lobby to this effect. After the incorporation of the Netherlands in the ": null
    },
    {
        "French Empire": "first french empire"
    },
    {
        ", Britain took over most of the Dutch colonies, with the exception of ": null
    },
    {
        "Dutch East Indies": "dutch east indies"
    },
    {
        " , ": null
    },
    {
        "Suriname": "suriname"
    },
    {
        " , the ": null
    },
    {
        "Dutch Antilles": "dutch antilles"
    },
    {
        " and the trading post at ": null
    },
    {
        "Dejima": "dejima"
    },
    {
        " in ": null
    },
    {
        "Japan": "japan"
    },
    {
        ".     Some historians count the wars between Britain and the ": null
    },
    {
        "Batavian Republic": "batavian republic"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of Holland": "kingdom of holland"
    },
    {
        " during the ": null
    },
    {
        "Napoleonic era": "napoleonic era"
    },
    {
        " as the Fifth and Sixth Anglo-Dutch wars.     Additionally, the ": null
    },
    {
        "Boer Wars": "boer wars"
    },
    {
        " are sometimes considered Anglo-Dutch wars;": null
    }
]