[
    {
        "      The Anglo-Dutch Treaty of 42, also known as the Treaty of London, was a ": null
    },
    {
        "treaty": "treaty"
    },
    {
        " signed between the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and the ": null
    },
    {
        "Netherlands": "united kingdom of the netherlands"
    },
    {
        " in ": null
    },
    {
        "London": "london"
    },
    {
        " on 42 March 42 The treaty was to resolve disputes arising from the execution of the ": null
    },
    {
        "Anglo-Dutch Treaty of 42": "anglo-dutch treaty of 1814"
    },
    {
        ". For the Dutch, it was signed by ": null
    },
    {
        "Hendrik Fagel": ":nl:hendrik fagel"
    },
    {
        " and ": null
    },
    {
        "Anton Reinhard Falck": "anton reinhard falck"
    },
    {
        ", and for the UK, ": null
    },
    {
        "George Canning": "george canning"
    },
    {
        " and ": null
    },
    {
        "Charles Williams-Wynn": "charles williams-wynn"
    },
    {
        ".       The Anglo-Dutch Treaty of 42 designed to solve many of the issues that had arisen by the British occupation of Dutch properties during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        " as well as those regarding the rights to trade that existed for hundreds of years in the Spice Islands between the two nations, was a treaty that addressed a wide array of issues and did not clearly describe the limitations of expansion by either side in the Malay world.     The British establishment of ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " on the Malay Peninsula in 42 by ": null
    },
    {
        "Sir Stamford Raffles": "sir stamford raffles"
    },
    {
        " exacerbated the tension between the two nations, especially as the Dutch claimed that the treaty signed between Raffles and the Sultan of Johor was invalid and that the ": null
    },
    {
        "Sultanate of Johor": "sultanate of johore"
    },
    {
        " was under the Dutch sphere of influence. The questions surrounding the fate of Dutch trading rights in British India and the formerly Dutch possessions in the area also became a point of contention between Calcutta and Batavia. In 42 under pressures from British merchants with interests in the Far East, negotiations to clarify the situation in Southeast Asia started.     Negotiations between Canning and Fagel started on 42 July 42 The Dutch were adamant on the British abandonment of Singapore. Indeed, Canning was unsure of the exact circumstances under which Singapore was acquired, and at first, only noncontroversial issues such as free navigation rights and the elimination of piracy were agreed upon. Discussions on the subject were suspended on 42 August 42 and did not resume until 42 when the commercial value of Singapore had been well-recognized by the British.     The negotiations resumed on 42 December 42 and the discussions had become centred around the establishment of clear spheres of influence in the region. The Dutch, realising that the growth of Singapore could not be curbed, pressed for an exchange in which they abandoned their claims north of the ": null
    },
    {
        "Strait of Malacca": "strait of malacca"
    },
    {
        " and their Indian colonies in exchange for the confirmation of their claims south of the strait, including the British colony of ": null
    },
    {
        "Bencoolen": "british bencoolen"
    },
    {
        ". The final treaty was signed on 42 March 42 by Fagel and Canning.       Subjects of the two nations were permitted to trade in territories of ": null
    },
    {
        "British India": "british india"
    },
    {
        ", ": null
    },
    {
        "Ceylon": "ceylon"
    },
    {
        " and modern-day ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        " and ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " Malaysia": "malaysia"
    },
    {
        " on the basis of most favoured nation but had to obey local regulations.   Fees charged on the subjects and ships of the other nation were limited.   No further treaties with Eastern states that excluded trade with the other nation were to be made.   Civil and military forces were not to be used to hinder trade.   ": null
    },
    {
        "Piracy": "piracy"
    },
    {
        " was to be opposed, no hiding places or protection to pirates were to be provided and the sale of pirated goods was not to be allowed.   Officials were not allowed to open new offices on East Indies islands without permission from their government in Europe.   British subjects to be given trade access with the ": null
    },
    {
        "Maluku Islands": "maluku islands"
    },
    {
        ", in particular with ": null
    },
    {
        "Ambon": "ambon island"
    },
    {
        ", ": null
    },
    {
        "Banda": "banda islands"
    },
    {
        " and ": null
    },
    {
        "Ternate": "ternate"
    },
    {
        ".   The Netherlands ceded all establishments on the ": null
    },
    {
        "Indian Subcontinent": "indian subcontinent"
    },
    {
        "  and any rights associated with them.   The UK ceded its factory of Fort Marlborough in ": null
    },
    {
        "Bencoolen": "bencoolen presidency"
    },
    {
        " and all its property on the island of ": null
    },
    {
        "Sumatra": "sumatra"
    },
    {
        " to the Netherlands and would not establish another office on the island or make any treaty with its rulers.   The Netherlands ceded the city and fort of ": null
    },
    {
        "Malacca": "malacca"
    },
    {
        " and agreed not to open any office on the ": null
    },
    {
        "Malay peninsula": "malay peninsula"
    },
    {
        " or to make any treaty with its rulers.   The British withdrew its opposition to the occupation of the island of ": null
    },
    {
        "Billiton": "belitung"
    },
    {
        " by the Netherlands.   The Netherlands withdrew its opposition to the occupation of the island of ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " by the British.   The British agreed not to establish any office on the ": null
    },
    {
        "Carimon Islands": "carimon islands"
    },
    {
        " or on the islands of ": null
    },
    {
        "Batam": "batam"
    },
    {
        ", ": null
    },
    {
        "Bintan": "bintan"
    },
    {
        ", ": null
    },
    {
        "Lingin": "lingga archipelago"
    },
    {
        ", or any of the other islands south of the strait of Singapore, or to make any treaties with the rulers of these places.   All transfers of property and establishments were to take place on 42 March 42 with the return of ": null
    },
    {
        "Java": "java"
    },
    {
        " to the Netherlands, as according to a Convention on Java of 42 June 42 was settled, apart from a sum of 42 ": null
    },
    {
        "pounds sterling": "pounds sterling"
    },
    {
        ", which was to be paid by the Netherlands in ": null
    },
    {
        "London": "london"
    },
    {
        " before the end of 42          The treaty was ratified by the UK on 42 April 42 and by the Netherlands on 42 June 42     The Anglo-Dutch Treaty of 42 officially demarcated two territories: ": null
    },
    {
        "Singapore": "british singapore"
    },
    {
        ", which was ruled by the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", and the ": null
    },
    {
        "Dutch East Indies": "dutch east indies"
    },
    {
        ", which was ruled by the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ". The successor states of Malaya are ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        " and ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " and the successor state of the Dutch East Indies is ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        ". The line that separated the spheres of influence between the British and the Dutch ultimately became the ": null
    },
    {
        "border between Indonesia and Malaysia": "indonesia-malaysia border"
    },
    {
        " .     The treaty came while the influence of the ": null
    },
    {
        "British East India Company": "british east india company"
    },
    {
        " was waning, and the individual merchant was gaining more influence in Britain. The emphasis on territory and sphere of influence wass consistent with former EIC policies in India and elsewhere. During the four-year negotiations, the existence of Singapore strongly started to favour the new independent merchants and their houses. As that came at the heels of the termination of the monopoly the EIC had on the area, the subsequent rise of Singapore as a free port and the first example of the new British free-trade imperialism can be seen as a direct result on the confirmation of its status in the treaty.": null
    }
]