[
    {
        "                   The Angles  were one of the main ": null
    },
    {
        "Germanic peoples": "Germanic Peoples"
    },
    {
        " who settled in ": null
    },
    {
        "Great Britain": "Great Britain"
    },
    {
        " in the ": null
    },
    {
        "post-Roman": "Fall Of The Western Roman Empire"
    },
    {
        " period. They founded a number of ": null
    },
    {
        "kingdoms": "Heptarchy"
    },
    {
        " of ": null
    },
    {
        "Anglo-Saxon England": "Anglo-Saxon England"
    },
    {
        ", and their name is the root of the name England . According to Tacitus, before their move to Britain, Angles lived alongside ": null
    },
    {
        "Langobardi": "Langobardi"
    },
    {
        " and ": null
    },
    {
        "Semnones": "Semnones"
    },
    {
        " in ": null
    },
    {
        "historical regions": "Historical Region"
    },
    {
        "of ": null
    },
    {
        "Schleswig": "Schleswig"
    },
    {
        " and ": null
    },
    {
        "Holstein": "Holstein"
    },
    {
        ", which are today part of northern Germany . .       The name of the Angles may have been first recorded in Latinised form, as Anglii, in the  Germania  of ": null
    },
    {
        "Tacitus": "Tacitus"
    },
    {
        ". It is thought to derive from the name of the area they originally inhabited, the ": null
    },
    {
        "Anglia": "Anglia"
    },
    {
        " Peninsula . This name has been hypothesised to originate from the ": null
    },
    {
        "Germanic": "Germanic Languages"
    },
    {
        " root for narrow , meaning the Narrow , i.e., the ": null
    },
    {
        "Schlei": "Schlei"
    },
    {
        " estuary": "Estuary"
    },
    {
        "; the root would be h₂enǵʰ, tight . Another theory is that the name meant hook , in reference to the shape of the peninsula; Indo-European linguist ": null
    },
    {
        "Julius Pokorny": "Julius Pokorny"
    },
    {
        " derives it from ": null
    },
    {
        "Proto-Indo-European": "Proto-Indo-European Language"
    },
    {
        " h₂enk-, bend . Pyles, Thomas and John Algeo 1993. Origins and development of the English language. 4th edition. .     During the fifth century, all Germanic tribes who invaded Britain were referred to as either Englisc, Ængle or Engle, who were all speakers of ": null
    },
    {
        "Old English": "Old English"
    },
    {
        " . Englisc and its descendant, English, also goes back to ": null
    },
    {
        "Proto-Indo-European": "Proto-Indo-European Language"
    },
    {
        " h₂enǵʰ-, meaning narrow. Barber, Charles, Joan C. Beal and Philip A. Shaw 2009. Other Indo-European languages have derivities of the PIE Sten or Lepto or Dol-əkho as root words for narrow. The English language. A historical introduction. Second edition of Barber . Cambridge: University Press. In any case, the Angles may have been called such because they were a ": null
    },
    {
        "fishing": "Fishing"
    },
    {
        " people or were originally descended from such, so ": null
    },
    {
        "England": "England"
    },
    {
        " would mean land of the ": null
    },
    {
        "fishermen": "Fisherman"
    },
    {
        " , and ": null
    },
    {
        "English": "English Language"
    },
    {
        " would be the fishermens language . Baugh, Albert C. and Thomas Cable 1993 A history of the English language. 4th edition. .     ": null
    },
    {
        "Gregory the Great": "Gregory The Great"
    },
    {
        ", in an ": null
    },
    {
        "epistle": "Epistle"
    },
    {
        ", simplified the Latinised name Anglii to Angli, the latter form developing into the preferred form of the word. Gregory said Non Angli, sed angeli, si forent Christiani They are not Angles, but ": null
    },
    {
        "angel": "Angel"
    },
    {
        "s, if they were Christian after a response to his query regarding the identity of a group of fair-haired Angles, slave children whom he had observed in the marketplace. See p. 117 of ": null
    },
    {
        "Zuckermann, Ghilad": "Ghilad Zuckermann"
    },
    {
        " , ": null
    },
    {
        "Language Contact and Lexical Enrichment in Israeli Hebrew": "Language Contact And Lexical Enrichment In Israeli Hebrew"
    },
    {
        ". ": null
    },
    {
        "Palgrave Macmillan": "Palgrave Macmillan"
    },
    {
        ".  /   The country remained Anglia in Latin. ": null
    },
    {
        "Alfred the Greats": "Alfred The Great"
    },
    {
        "translation of ": null
    },
    {
        "Orosiuss": "Paulus Orosius"
    },
    {
        "history of the world uses Angelcynn to describe the English people; ": null
    },
    {
        "Bede": "Bede"
    },
    {
        " used Angelfolc ; also such forms as Engel, Englan , Englaland, and Englisc occur, all showing ": null
    },
    {
        "i-mutation": "I-Mutation"
    },
    {
        ". Fennell, Barbara 1998. A history of English. A sociolinguistic approach. Oxford: Blackwell.                   The earliest known mention of the Angles may be in chapter 40 of Tacituss Germania written around AD 98. Tacitus describes the Anglii as one of the more remote ": null
    },
    {
        "Suebi": "Suebi"
    },
    {
        "c tribes compared to the ": null
    },
    {
        "Semnones": "Semnones"
    },
    {
        " and ": null
    },
    {
        "Langobardi": "Langobardi"
    },
    {
        ", who lived on the ": null
    },
    {
        "Elbe": "Elbe"
    },
    {
        " and were better known to the Romans. He grouped the Angles with several other tribes in that region, the ": null
    },
    {
        "Reudigni": "Reudigni"
    },
    {
        ", ": null
    },
    {
        "Aviones": "Aviones"
    },
    {
        ", ": null
    },
    {
        "Varini": "Varini"
    },
    {
        ", ": null
    },
    {
        "Eudoses": "Eudoses"
    },
    {
        ", ": null
    },
    {
        "Suarini": "Suarini"
    },
    {
        ", and ": null
    },
    {
        "Nuitones": "Nuitones"
    },
    {
        ". These were all living behind ramparts of rivers and woods, and therefore inaccessible to attack.     He gives no precise indication of their geographical situation, but states that, together with the six other tribes, they worshiped ": null
    },
    {
        "Nerthus": "Nerthus"
    },
    {
        ", or Mother Earth, whose sanctuary was located on an island in the Ocean . The Eudoses are the ": null
    },
    {
        "Jutes": "Jutes"
    },
    {
        "; these names probably refer to localities in ": null
    },
    {
        "Jutland": "Jutland"
    },
    {
        " or on the Baltic coast. The coast contains sufficient estuaries, inlets, rivers, islands, swamps, and marshes to have been then inaccessible to those not familiar with the terrain, such as the Romans, who considered it unknown, inaccessible, with a small population and of little economic interest.     The majority of scholars believe that the Anglii lived on the coasts of the Baltic Sea, probably in the southern part of the Jutish peninsula. This view is based partly on Old English and Danish traditions regarding persons and events of the fourth century, and partly because striking affinities to the cult of Nerthus as described by Tacitus are to be found in pre-Christian ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        "n religion.       ": null
    },
    {
        "Ptolemy": "Ptolemy"
    },
    {
        ", writing in around 150 AD, in his atlas  Geography  , describes the Sueboi Angeilloi, Latinised to Suevi Angili, further south, living in a stretch of land between the northern Rhine and central Elbe, but apparently not touching either river, with the Suebic ": null
    },
    {
        "Langobardi": "Langobardi"
    },
    {
        " on the Rhine to their west, and the Suebic ": null
    },
    {
        "Semnones": "Semnones"
    },
    {
        " on the Elbe stretching to their east.     These Suevi Angili would have been in ": null
    },
    {
        "Lower Saxony": "Lower Saxony"
    },
    {
        " or near it, but they are not coastal. The three Suebic peoples are separated from the coastal ": null
    },
    {
        "Chauci": "Chauci"
    },
    {
        " , and ": null
    },
    {
        "Saxones": "Saxones"
    },
    {
        " , by a series of tribes including, between the ": null
    },
    {
        "Weser": "Weser"
    },
    {
        " and Elbe, the ": null
    },
    {
        "Angrivarii": "Angrivarii"
    },
    {
        ", Laccobardi , and the ": null
    },
    {
        "Dulgubnii": "Dulgubnii"
    },
    {
        ". South of the Saxons, and east of the Elbe, Ptolemy lists the Ouirounoi and Teutonoari, which either denotes the Teuton men , or else it denotes people living in the area where the Teutons had previously lived . Ptolemy describes the coast to the east of the Saxons as inhabited by the ": null
    },
    {
        "Farodini": "Farodini"
    },
    {
        ", a name not known from any other sources.     Owing to the uncertainty of this passage, much speculation existed regarding the original home of the Anglii. One theory is that they or part of them dwelt or moved among other coastal people, perhaps confederated up to the basin of the ": null
    },
    {
        "Saale": "Saale"
    },
    {
        "  on the ": null
    },
    {
        "Unstrut": "Unstrut"
    },
    {
        " valleys below the ": null
    },
    {
        "Kyffhäuserkreis": "Kyffhäuserkreis"
    },
    {
        ", from which region the Lex Anglorum et Werinorum hoc est Thuringorum is believed by many to have come.  The ethnic names of ": null
    },
    {
        "Frisians": "Frisii"
    },
    {
        " and ": null
    },
    {
        "Warines": "Warini"
    },
    {
        " are also attested in these ": null
    },
    {
        "Saxon": "Saxon"
    },
    {
        " districts.     A second possible solution is that these Angles of Ptolemy are not those of Schleswig at all. According to ": null
    },
    {
        "Julius Pokorny": "Julius Pokorny"
    },
    {
        ", the Angri- in ": null
    },
    {
        "Angrivarii": "Angrivarii"
    },
    {
        ", the -angr in ": null
    },
    {
        "Hardanger": "Hardanger"
    },
    {
        " and the Angl- in Anglii all come from the same root meaning bend , but in different senses. In other words, the similarity of the names is strictly coincidental and does not reflect any ethnic unity beyond Germanic.     However, Gudmund Schütte, in his analysis of Ptolemy, believes that the Angles have simply been moved by an error coming from Ptolemys use of imperfect sources. He points out that Angles are placed correctly just to the northeast of the Langobardi, but that these have been duplicated, so that they appear once, correctly, on the lower Elbe, and a second time, incorrectly, at the northern Rhine.             ": null
    },
    {
        "Bede": "Bede"
    },
    {
        " states that the Anglii, before coming to Great Britain, dwelt in a land called Angulus, which lies between the province of the Jutes and the Saxons, and remains unpopulated to this day. Similar evidence is given by the  Historia Brittonum . King ": null
    },
    {
        "Alfred the Great": "Alfred The Great"
    },
    {
        " and the chronicler ": null
    },
    {
        "Æthelweard": "Æthelweard"
    },
    {
        " identified this place with ": null
    },
    {
        "Anglia": "Anglia"
    },
    {
        ", in the province of ": null
    },
    {
        "Schleswig": "Schleswig"
    },
    {
        " , and this identification agrees with the indications given by Bede.     In the Norwegian seafarer ": null
    },
    {
        "Ohthere of Hålogalands": "Ohthere Of Hålogaland"
    },
    {
        "account of a two-day voyage from the Oslo fjord to Schleswig, he reported the lands on his starboard bow, and Alfred appended the note on these islands dwelt the Engle before they came hither . Confirmation is afforded by English and Danish traditions relating to two kings named ": null
    },
    {
        "Wermund": "Wermund"
    },
    {
        " and ": null
    },
    {
        "Offa of Angel": "Offa Of Angel"
    },
    {
        ", from whom the ": null
    },
    {
        "Mercia": "Mercia"
    },
    {
        "n royal family claimed descent and whose exploits are connected with Anglia, Schleswig, and ": null
    },
    {
        "Rendsburg": "Rendsburg"
    },
    {
        ". Danish tradition has preserved record of two governors of Schleswig, father and son, in their service, ": null
    },
    {
        "Frowinus": "Frowinus"
    },
    {
        "  and ": null
    },
    {
        "Wigo": "Ket And Wig"
    },
    {
        " , from whom the royal family of ": null
    },
    {
        "Wessex": "Wessex"
    },
    {
        " claimed descent. During the fifth century, the Anglii invaded Great Britain, after which time their name does not recur on the continent except in the title of the legal code issued to the ": null
    },
    {
        "Thuringians": "Thuringii"
    },
    {
        ": Lex Anglorum et Werinorum hoc est Thuringorum.     The Angles are the subject of a legend about ": null
    },
    {
        "Pope Gregory I": "Pope Gregory I"
    },
    {
        ", who happened to see a group of Angle children from ": null
    },
    {
        "Deira": "Deira"
    },
    {
        " for sale as slaves in the Roman market. As the story would later be told by the Anglo-Saxon monk and historian ": null
    },
    {
        "Bede": "Bede"
    },
    {
        ", Gregory was struck by the unusual appearance of the slaves and asked about their background. When told they were called Anglii , he replied with a Latin pun that translates well into English: “Bene, nam et angelicam habent faciem, et tales angelorum in caelis decet esse coheredes” . Supposedly, this encounter inspired the pope to launch a mission to bring Christianity to their countrymen.       The province of Schleswig has proved rich in prehistoric antiquities that date apparently from the fourth and fifth centuries. A large cremation cemetery has been found at ": null
    },
    {
        "Borgstedt": "Borgstedt"
    },
    {
        ", between Rendsburg and ": null
    },
    {
        "Eckernförde": "Eckernförde"
    },
    {
        ", and it has yielded many urns and brooches closely resembling those found in pagan graves in England. Of still greater importance are the great deposits at ": null
    },
    {
        "Thorsberg moor": "Thorsberg Moor"
    },
    {
        " and ": null
    },
    {
        "Nydam": "Nydam Mose"
    },
    {
        ", which contained large quantities of arms, ornaments, articles of clothing, agricultural implements, etc., and in Nydam, even ships. By the help of these discoveries, Angle culture in the age preceding the invasion of Britannia can be pieced together.             According to sources such as the History of Bede, after the invasion of Britannia, the Angles split up and founded the kingdoms of ": null
    },
    {
        "Northumbria": "Northumbria"
    },
    {
        ", ": null
    },
    {
        "East Anglia": "East Anglia"
    },
    {
        ", and ": null
    },
    {
        "Mercia": "Mercia"
    },
    {
        ". H.R. Loyn has observed in this context that a sea voyage is perilous to tribal institutions , and the apparently tribe-based kingdoms were formed in England. Early times had two northern kingdoms and two midland ones , which had by the seventh century resolved themselves into two Angle kingdoms, viz., Northumbria and Mercia. Northumbria held suzerainty amidst the ": null
    },
    {
        "Teutonic": "Germanic Peoples"
    },
    {
        " presence in the British Isles in the seventh century, but was eclipsed by the rise of Mercia in the eighth century. Both kingdoms fell in the great assaults of the Danish ": null
    },
    {
        "Viking": "Viking"
    },
    {
        " armies in the 9th century. Their royal houses were effectively destroyed in the fighting, and their Angle populations came under the ": null
    },
    {
        "Danelaw": "Danelaw"
    },
    {
        ". Further south, the Saxon kings of ": null
    },
    {
        "Wessex": "Wessex"
    },
    {
        " withstood the Danish assaults. Then in the late 9th and early 10th centuries, the kings of Wessex defeated the Danes and liberated the Angles from the Danelaw. They united their house in marriage with the surviving Angle royalty, and were accepted by the Angles as their kings. This marked the passing of the old ": null
    },
    {
        "Anglo-Saxon": "Anglo-Saxon"
    },
    {
        " world and the dawn of the ": null
    },
    {
        "English": "English People"
    },
    {
        " as a new people. The regions of East Anglia and Northumbria are still known by their original titles. Northumbria once stretched as far north as what is now southeast ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ", including ": null
    },
    {
        "Edinburgh": "Edinburgh"
    },
    {
        ", and as far south as the ": null
    },
    {
        "Humber Estuary": "Humber Estuary"
    },
    {
        ".     The rest of that people stayed at the centre of the Angle homeland in the northeastern portion of the modern German Bundesland of Schleswig-Holstein, on the Jutland Peninsula. There, a small peninsular area is still called ": null
    },
    {
        "Anglia": "Anglia"
    },
    {
        " today and is formed as a triangle drawn roughly from modern ": null
    },
    {
        "Flensburg": "Flensburg"
    },
    {
        " on the Flensburger Fjord to the ": null
    },
    {
        "City of Schleswig": "City Of Schleswig"
    },
    {
        " and then to Maasholm, on the ": null
    },
    {
        "Schlei": "Schlei"
    }
]