[
    {
        "Angus Lindsay Ritchie Calder was a Scottish writer, historian, and poet. Initially studying English literature, he became increasingly interested in ": null
    },
    {
        "political history": "political history"
    },
    {
        " and wrote a landmark study on Britain during the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " in 42 entitled The Peoples War. He subsequently wrote several other historical works but became increasingly interested in literature and poetry and worked primarily as a writer, though often holding a number of university teaching positions. A ": null
    },
    {
        "socialist": "socialist"
    },
    {
        ", he was a prominent Scottish ": null
    },
    {
        "public intellectual": "public intellectual"
    },
    {
        " during the 42s and 42s.       Angus Calder was born in ": null
    },
    {
        "London": "london"
    },
    {
        " on 42 February 42 into a prominent ": null
    },
    {
        "left-wing": "left-wing politics"
    },
    {
        " family from ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". His father was ": null
    },
    {
        "Richie Calder": "peter ritchie calder"
    },
    {
        " , a noted ": null
    },
    {
        "socialist": "socialist"
    },
    {
        " and ": null
    },
    {
        "pacifist": "pacifist"
    },
    {
        " who became famous for his work as a ": null
    },
    {
        "journalist": "journalist"
    },
    {
        " and ": null
    },
    {
        "science writer": "science writer"
    },
    {
        ". His siblings are ": null
    },
    {
        "Nigel Calder": "nigel calder"
    },
    {
        ", mathematician Allan Calder, educationist Isla Calder and teacher Fiona Rudd . His nephew is travel writer and journalist ": null
    },
    {
        "Simon Calder": "simon calder"
    },
    {
        ".     Angus Calder read English literature at ": null
    },
    {
        "Kings College, Cambridge": "kings college, cambridge"
    },
    {
        ". He gained a doctorate from the ": null
    },
    {
        "University of Sussex": "university of sussex"
    },
    {
        " in 42 on ": null
    },
    {
        "politics in the United Kingdom": "politics in the united kingdom"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", entitled The Common Wealth Party, 42–42 which studied the ": null
    },
    {
        "political party of the same name": "common wealth party"
    },
    {
        ". At the time, academic research into the conflict was rare as government papers were not available under the ": null
    },
    {
        "fifty-year rule": "thirty-year ruleunited kingdom"
    },
    {
        ". As a result Calder worked closely with ": null
    },
    {
        "Paul Addison": "paul addison"
    },
    {
        ", another historian with similar research interests. Together Addison and Calder made extensive use of the newly discovered archives of ": null
    },
    {
        "Mass-Observation": "mass-observation"
    },
    {
        " to examine British public opinion. Calder was instrumental in creating the Mass-Observation Archive at Sussex in 42 in collaboration with ": null
    },
    {
        "Asa Briggs": "asa briggs"
    },
    {
        ".     The Peoples War": null
    },
    {
        "British Home Front": "united kingdom home front during world war ii"
    },
    {
        " by the publisher ": null
    },
    {
        "Jonathan Cape": "jonathan cape"
    },
    {
        " while still working on his PhD thesis. This led to The Peoples War, first published in 42 The work was academic in tone and ranged widely across the political and social history of the period. It was critical of enduring propaganda myths without being polemic, and was extremely successful. It has subsequently been described as groundbreaking . As Addison summarised:          The Peoples War was well received and won the ": null
    },
    {
        "John Llewellyn Rhys Prize": "john llewellyn rhys prize"
    },
    {
        ", a ": null
    },
    {
        "literary award": "literary award"
    },
    {
        ". Though its thesis was not widely adopted in academia, it proved extremely influential as ": null
    },
    {
        "popular history": "popular history"
    },
    {
        ". ": null
    },
    {
        "Richard Eyre": "richard eyre"
    },
    {
        " said that he could name about twenty works, films, television and theatre which have emerged essentially from Angus Calders book . Among those who were said to have been influenced by the work were the playwright ": null
    },
    {
        "David Hare": "david hare"
    },
    {
        " and future prime minister ": null
    },
    {
        "Gordon Brown": "gordon brown"
    },
    {
        ". It remains in print.     However, Calder increasingly began to doubt his own thesis. Many of his original conclusions were revised in his The Myth of the Blitz . According to Addison, this reassessment was encouraged by Calders revulsion with the ": null
    },
    {
        "jingoistic nationalism": "jingoism"
    },
    {
        " which accompanied the ": null
    },
    {
        "Falklands War of 42": "falklands war"
    },
    {
        " and ": null
    },
    {
        "Thatcherism": "thatcherism"
    },
    {
        ". These were often inspired by the memory of the Second World War as the Peoples War which Calder had himself popularised.       Following his success with The Peoples War, Calder increasingly returned to his interests in ": null
    },
    {
        "literature": "literature"
    },
    {
        " and poetry. In 42 he moved to ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        " where he published Russia Discovered, a survey of 42th-century Russian fiction in 42 and, three years later, became staff tutor in Arts with the ": null
    },
    {
        "Open University": "open university"
    },
    {
        ". He subsequently taught all over the world, lecturing in literature at several African universities and serving from 42 to 42 as co-editor of the  Journal of Commonwealth Literature .      Calder became a ubiquitous figure on the ": null
    },
    {
        "Scottish literary": "scottish literature"
    },
    {
        " scene writing essays and articles, books on ": null
    },
    {
        "Byron": "byron"
    },
    {
        " and ": null
    },
    {
        "T. S. Eliot": "t. s. eliot"
    },
    {
        ", and working as editor of collections of poetry and prose. He also wrote introductions to new publications of such diverse works as  Great Expectations , ": null
    },
    {
        "Walter Scott": "walter scott"
    },
    {
        "s  Old Mortality , ": null
    },
    {
        "T. E. Lawrence": "t. e. lawrence"
    },
    {
        "s  Seven Pillars of Wisdom , ": null
    },
    {
        "Evelyn Waugh": "evelyn waugh"
    },
    {
        "s  Sword of Honour  trilogy and ": null
    },
    {
        "James Boswell": "james boswell"
    },
    {
        "s  The Life of Samuel Johnson .   In 42 he published Revolutionary Empire , a study of three centuries of imperial development by English speakers to the end of the 42th century. Revolving Culture: Notes from the Scottish Republic is a collection of essays on ": null
    },
    {
        "Scottish topics": "scottish topics"
    },
    {
        " which expressed itself through the writings of such figures as ": null
    },
    {
        "Robert Burns": "robert burns"
    },
    {
        " and Scott and in gestures of  realpolitik  such as the repression of ": null
    },
    {
        "Jacobins": "jacobin"
    },
    {
        " during the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". In 42 Calder helped to set up the ": null
    },
    {
        "Scottish Poetry Library": "scottish poetry library"
    },
    {
        " in Edinburgh and served as its first convener. He also worked as an editor of ": null
    },
    {
        "Hugh MacDiarmid": "hugh macdiarmid"
    },
    {
        "s prose.  Calder won the ": null
    },
    {
        "Eric Gregory Award": "eric gregory award"
    },
    {
        " for his poetry.       A nationalist and socialist, he moved from the ": null
    },
    {
        "Scottish National Party": "scottish national party"
    },
    {
        " to the ": null
    },
    {
        "Scottish Socialist Party": "scottish socialist party"
    },
    {
        ", and though he cherished the ": null
    },
    {
        "Scottish republican": "scottish republican"
    },
    {
        " spirit, he sought to challenge some of the popular myths surrounding the countrys sense of national identity. In Revolving Culture: Notes from a Scottish republic he described the development, during the early stages of the Union with England, of an intellectual republic forged by a combination of insularity and lack of English interest in Scottish affairs. In 42 he edited Time to Kill — the Soldiers Experience of War in the West 42–42 with ": null
    },
    {
        "Paul Addison": "paul addison"
    },
    {
        "; Scotlands of the Mind ; Disasters and Heroes: On War, Memory and Representation ; and Gods, Mongrels and Demons: 42 Brief but Essential Lives , a collection of potted biographies of creatures who have extended my sense of the potentialities, both comic and tragic, of human nature . He had always published verse and won a Gregory Award for his poetry in 42 Questions of ": null
    },
    {
        "Scottish national identity": "scottish national identity"
    },
    {
        " assumed growing importance in the 42s, and Calder became active in the debate. A distinctive Scottish social ethos informed the activities of prominent Scots in the years of Empire, when they had invested heavily in the concept of ": null
    },
    {
        "Britishness": "britishness"
    },
    {
        ", although he reportedly felt that the Scots had meddled much more overweeningly with the English sense of identity than the English ever did with the Scots. He was delighted to discover that the game of ": null
    },
    {
        "cricket": "cricket"
    },
    {
        " had ": null
    },
    {
        "been introduced to Sri Lanka": "cricket in sri lanka"
    },
    {
        " by a Scot.        His first wife was ": null
    },
    {
        "Jennifer Daiches": "jenni calder"
    },
    {
        ", daughter of Scottish literary critic ": null
    },
    {
        "David Daiches": "david daiches"
    },
    {
        ", with whom Calder collaborated on a book about ": null
    },
    {
        "Sir Walter Scott": "sir walter scott"
    },
    {
        " in 42 The Calders had two daughters, Rachel and Gowan, and a son, Gideon. His first marriage ended in 42; he married Kate Kyle in 42 with whom he had a son, Douglas, born in 42 He took early retirement from the Open University in 42       Calder died from ": null
    },
    {
        "lung cancer": "lung cancer"
    },
    {
        " on 42 June 42 aged 42  In the closing weeks of his life, the poet ": null
    },
    {
        "Richard Berengarten": "richard berengarten"
    },
    {
        ", together with his son Gideon Calder edited a  for and about him, which appeared just after his death.           The Peoples War: Britain, 42–42. London: Jonathan Cape, 42   Scott, with Jenni Calder. London: Evans, 42   Russia Discovered: Nineteenth Century Fiction from Pushkin to Chekhov. London: Heinemann, 42   Revolutionary Empire: The Rise of the English-Speaking Empires from the Fifteenth Century to the 42s. London: Jonathan Cape, 42   T. S. Eliot. Brighton: Harvester, 42   Byron. Buckingham: Open University Press, 42   The Myth of the Blitz. London: Jonathan Cape, 42   Revolving Culture. London: I.B. Tauris, 42   Scotlands of the Mind. Edinburgh: Luath Press, 42   Disasters and Heroes: On War, Memory and Representation. Cardiff: University of Wales Press, 42   Gods, Mongrels and Demons: 42 Brief but Essential Lives. London: Bloomsbury, 42       Waking in Waikato. Edinburgh: diehard, 42   Horace in Tollcross: Eftir some odes of Q. H. Flaccus. Newtyle: Kettilonia, 42   Colours of Grief. Nottingham: Shoestring, 42   Dipa’s Bowl. London: Aark Arts, 42   Sun Behind the Castle: Edinburgh Poems. Edinburgh: Luath Press, 42       Britain at War, 42. London: Jonathan Cape, 42    Writers in East Africa. Nairobi: ": null
    },
    {
        "East African Literature Bureau": "east african literature bureau"
    },
    {
        ", 42   . Summer Fires: New Poetry of Africa. London: Heinemann, 42   Englische Lyrik 42–42. Leipzig: Reclam, 42   Speak for Yourself: A Mass Observation Anthology. London: Jonathan Cape, 42   Byron and Scotland: Radical or Dandy?, London: Edinburgh University Press, 42   Selected Poetry by ": null
    },
    {
        "Robert Burns": "robert burns"
    },
    {
        ". Harmondsworth: Penguin, 42   David Livingstone and the Victorian Encounter with Africa. London: National Portrait Gallery, 42   Time to Kill: The Soldier’s Experience of War in the West, 42–42. London: Pimlico, 42   The Rauchle Tongue: Selected Essays, Journalism and Interviews by Hugh MacDiarmid . Manchester: Carcanet, 42–42   Wars. Harmondsworth: Penguin, 42   Selected Poems by ": null
    },
    {
        "Louis Stevenson": "robert louis stevenson"
    },
    {
        ". Harmondsworth: Penguin, 42   The Souls of the Dead are Taking the Best Seats: 42 World Poets on War. Edinburgh: Luath Press, Edinburgh, 42       Great Expectations by Charles Dickens. Harmondsworth: Penguin, 42   Faces at the Crossroads ed. Chris Wanjala. Nairobi: East African Literature Bureau, 42   Old Mortality by Walter Scott. Harmondsworth: Penguin, 42   The Seven Pillars of Wisdom by ": null
    },
    {
        "T. E. Lawrence": "t. e. lawrence"
    },
    {
        ". Ware: Wordsworth, 42   The Life of Samuel Johnson by James Boswell. Ware: Wordsworth, 42   Sword of Honour by Evelyn Waugh. Harmondsworth: Penguin, 42    The Devils Dictionary  by ": null
    },
    {
        "Ambrose Bierce": "ambrose bierce"
    },
    {
        ", illustrated by Ralph Steadman. London: Bloomsbury, 42   The Thrie Estaitis by David Lindsay, ed. Alan Spence. Edinburgh: Edinburgh University Press, 42   Sugar-Coated Pill: Selected Poems by Mahmood Jamal. Edinburgh: Word Power, 42            ;Recorded readings and performances   From Dungeons to the Sky – Commissioned by ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        " for performance of 42 poems with music for Commonwealth Head of States visit to Edinburgh, 42 at the Queens Hall, Edinburgh. Readings by Angus and Gowan Calder, piano compositions and performance by ": null
    },
    {
        "Dmytro Morykit": "dmytro morykit"
    }
]