[
    {
        "                    Animal Farm is an ": null
    },
    {
        "allegorical": "allegory"
    },
    {
        " novella by ": null
    },
    {
        "George Orwell": "george orwell"
    },
    {
        ", first published in England on 42 August 42 The book tells the story of a group of farm animals who rebel against their human farmer, hoping to create a society where the animals can be equal, free, and happy. Ultimately, however, the rebellion is betrayed and the farm ends up in a state as bad as it was before, under the dictatorship of a pig named ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ".     According to Orwell, the ": null
    },
    {
        "fable": "fable"
    },
    {
        " reflects events leading up to the ": null
    },
    {
        "Russian Revolution of 42": "russian revolution of 1917"
    },
    {
        " and then on into the ": null
    },
    {
        "Stalinist era": "history of the soviet union"
    },
    {
        " of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". Orwell, a ": null
    },
    {
        "democratic socialist": "democratic socialism"
    },
    {
        ", was a critic of ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        " and hostile to Moscow-directed ": null
    },
    {
        "Stalinism": "stalinism"
    },
    {
        ", an attitude that was critically shaped by his experiences during the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        ". The Soviet Union, he believed, had become a brutal ": null
    },
    {
        "dictatorship": "dictatorship"
    },
    {
        ", built upon a ": null
    },
    {
        "cult of personality": "cult of personality"
    },
    {
        " and enforced by ": null
    },
    {
        "a reign of terror": "great purge"
    },
    {
        ". In a letter to Yvonne Davet, Orwell described Animal Farm as a ": null
    },
    {
        "satirical": "satire"
    },
    {
        " tale against Stalin , and in his essay ": null
    },
    {
        "Why I Write": "why i write"
    },
    {
        " , wrote that Animal Farm was the first book in which he tried, with full consciousness of what he was doing, to fuse political purpose and artistic purpose into one whole .     The original title was Animal Farm: A Fairy Story, but U.S. publishers dropped the subtitle when it was published in 42 and only one of the translations during Orwells lifetime kept it. Other titular variations include subtitles like A Satire and A Contemporary Satire . Orwell suggested the title  for the French translation, which abbreviates to URSA, the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word for bear , a ": null
    },
    {
        "symbol of Russia": "russian bear"
    },
    {
        ". It also played on the French name of the Soviet Union, .     Orwell wrote the book between November 42 and February 42 when the UK was in its ": null
    },
    {
        "wartime alliance": "allies of world war ii"
    },
    {
        " with the Soviet Union against ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " and the British people and intelligentsia held Stalin in high esteem, a phenomenon Orwell hated. The manuscript was initially rejected by a number of British and American publishers, including one of Orwells own, ": null
    },
    {
        "Victor Gollancz": "victor gollancz"
    },
    {
        ", which delayed its publication. It became a great commercial success when it did appear partly because international relations were transformed as the wartime alliance gave way to the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ".     Time magazine chose the book as one of the 42 best English-language novels ; it also featured at number 42 on the ": null
    },
    {
        "Modern Library List of Best 42th-Century Novels": "modern library list of best 20th-century novels"
    },
    {
        ". It won a ": null
    },
    {
        "Retrospective Hugo Award": "retro-hugo"
    },
    {
        " in 42 and is included in the ": null
    },
    {
        "Great Books of the Western World": "great books of the western world"
    },
    {
        " selection.        The poorly-run Manor Farm near ": null
    },
    {
        "Willingdon": "willingdon and jevington"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ", is ripened for rebellion from its animal populace by neglect at the hands of the irresponsible and alcoholic farmer ": null
    },
    {
        "Mr. Jones": "jones"
    },
    {
        ". One night, the exalted boar ": null
    },
    {
        "Old Major": "old major"
    },
    {
        " organizes a meeting, at which he calls for the overthrow of humans and teaches the animals a revolutionary song called ": null
    },
    {
        "Beasts of England": "beasts of england"
    },
    {
        " . When Old Major dies, two young pigs, ": null
    },
    {
        "Snowball": "snowball"
    },
    {
        " and ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ", assume command and stage a revolt, driving Mr. Jones off the farm and renaming the property Animal Farm . They adopt the Seven Commandments of Animalism, the most important of which is, All animals are equal . The decree is painted in large letters on one side of the barn. Snowball teaches the animals to read and write, while Napoleon educates young puppies on the principles of ": null
    },
    {
        "Animalism": "animalism"
    },
    {
        ". Food is plentiful, and the farm runs smoothly. The pigs elevate themselves to positions of leadership and set aside special food items, ostensibly for their personal health. Following an unsuccessful attempt by Mr. Jones and his associates to retake the farm , Snowball announces his plans to modernize the farm by building a ": null
    },
    {
        "windmill": "windmill"
    },
    {
        ". Napoleon has his dogs chase Snowball away and he declares himself leader.     Napoleon enacts changes to the governance structure of the farm, replacing meetings with a committee of pigs who will run the farm. Through a young pig named ": null
    },
    {
        "Squealer": "squealer"
    },
    {
        ", Napoleon claims credit for the windmill idea. The animals work harder with the promise of easier lives with the windmill. When the animals find the windmill collapsed after a violent storm, Napoleon and Squealer convince the animals that Snowball is trying to sabotage their project, and begin to ": null
    },
    {
        "purge": "purge"
    },
    {
        " the farm of animals Napoleon accuses of consorting with his old rival. When some animals recall the Battle of the Cowshed, Napoleon frequently smears Snowball as a collaborator of Mr. Jones, while falsely representing himself as the hero of the battle. Beasts of England is replaced with an anthem glorifying Napoleon, who appears to be adopting the lifestyle of a man. The animals remain convinced that they are better off than they were under Mr. Jones.     Mr. Frederick, a neighbouring farmer, attacks the farm, using ": null
    },
    {
        "blasting powder": "explosive material"
    },
    {
        " to blow up the restored windmill. Although the animals win the battle, they do so ": null
    },
    {
        "at great cost": "pyrrhic victory"
    },
    {
        ", as many, including ": null
    },
    {
        "Boxer the workhorse": "boxer"
    },
    {
        ", are wounded. Although he recovers from this, Boxer eventually collapses while working on the windmill . Boxer is taken away in a ": null
    },
    {
        "knacker": "knacker"
    },
    {
        "s van, but Squealer quickly assures the animals that the van had been purchased from the knacker by an animal hospital and that the previous owners signboard had not been repainted. Squealer subsequently reports Boxers death and martyrizes him with a festival the following day. However, the truth is that Napoleon had engineered the sale of Boxer to the knacker, allowing Napoleon and his inner circle to acquire money to buy ": null
    },
    {
        "whisky": "whisky"
    },
    {
        " for themselves.        Years pass, the windmill is rebuilt, and another windmill is constructed, which makes the farm a good amount of income. However, the ideals which Snowball discussed, including stalls with electric lighting, heating, and running water, are forgotten, with Napoleon advocating that the happiest animals live simple lives. In addition to Boxer, many of the animals who participated in the rebellion are dead or old. Mr. Jones, having moved away after giving up on reclaiming his farm, has also died. The pigs start to resemble humans, as they walk upright, carry whips, drink alcohol and wear clothes. The Seven Commandments are abridged to just one phrase:  All animals are equal, but some animals are more equal than others.  and the maxim  Four legs good, two legs bad.  is changed to  Four legs good, two legs better.  Napoleon holds a dinner party for the pigs and local farmers, with whom he celebrates a new alliance. He abolishes the practice of the revolutionary traditions and restores the name The Manor Farm . The men and pigs start playing cards, flattering and praising each other while cheating at the game. Both Napoleon and Mr. Pilkington, one of the farmers, play the Ace of Spades at the same time and both sides begin fighting loudly over who cheated first. When the animals outside look at the pigs and men, they can no longer distinguish between the two.             ": null
    },
    {
        "Old Major": "old major"
    },
    {
        " – An aged prize ": null
    },
    {
        "Middle White boar": "middle white"
    },
    {
        " provides the inspiration that fuels the rebellion. He is an allegorical combination of ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ", one of the creators of communism, and ": null
    },
    {
        "Vladimir Lenin": "vladimir lenin"
    },
    {
        ", the communist leader of the ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        " and the early Soviet nation, in that he draws up the principles of the revolution. His skull being put on revered public display recalls Lenin, whose ": null
    },
    {
        "embalmed body was put on display": "lenins mausoleum"
    },
    {
        ". ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " – A large, rather fierce-looking ": null
    },
    {
        "Berkshire": "berkshire pig"
    },
    {
        " boar, the only Berkshire on the farm, not much of a talker, but with a reputation for getting his own way . An allegory of ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        ", Napoleon is the main villain of Animal Farm.   ": null
    },
    {
        "Snowball": "snowball"
    },
    {
        " – Napoleons rival and original head of the farm after Jones overthrow. His life parallels that of ": null
    },
    {
        "Leon Trotsky": "leon trotsky"
    },
    {
        ", but may also combine elements from Lenin. ": null
    },
    {
        "Squealer": "squealer"
    },
    {
        " – A small, white, fat porker who serves as Napoleons second-in-command and minister of propaganda, holding a position similar to that of ": null
    },
    {
        "Vyacheslav Molotov": "vyacheslav molotov"
    },
    {
        ". ": null
    },
    {
        "Vladimir Mayakovsky": "vladimir mayakovsky"
    },
    {
        ". ": null
    },
    {
        "Great Purge": "great purge"
    },
    {
        " of ": null
    },
    {
        "Grigori Zinoviev": "grigori zinoviev"
    },
    {
        ", ": null
    },
    {
        "Lev Kamenev": "lev kamenev"
    },
    {
        ", ": null
    },
    {
        "Nikolai Bukharin": "nikolai bukharin"
    },
    {
        ", and ": null
    },
    {
        "Alexei Rykov": "alexei rykov"
    },
    {
        ".   Pinkeye – A minor pig who is mentioned only once; he is the pig that tastes Napoleons food to make sure it is not poisoned, in response to rumours about an assassination attempt on Napoleon.         ": null
    },
    {
        "Mr. Jones": "jones"
    },
    {
        " – A heavy drinker who is the original owner of Manor Farm, a farm in disrepair with farmhands who often loaf on the job. He is an allegory of Russian ": null
    },
    {
        "Tsar Nicholas II": "tsar nicholas ii"
    },
    {
        ", who abdicated following the ": null
    },
    {
        "February Revolution": "february revolution"
    },
    {
        " of 42 and was murdered, along with the rest of his family, by the ": null
    },
    {
        "Bolsheviks": "bolsheviks"
    },
    {
        " on 42 July 42 The animals revolt after Jones drinks so much he does not care for them.   Mr. Frederick – The tough owner of Pinchfield, a small but well-kept neighbouring farm, who briefly enters into an alliance with Napoleon. Animal Farm shares land boundaries with Pinchfield on one side and Foxwood on another, making Animal Farm a buffer zone between the two bickering farmers. The animals of Animal Farm are terrified of Frederick, as rumours abound of him abusing his animals and entertaining himself with ": null
    },
    {
        "cockfighting": "cockfighting"
    },
    {
        " . Napoleon enters into an alliance with Frederick in order to sell surplus timber that Pilkington also sought, but is enraged to learn Frederick paid him in counterfeit money. Shortly after the swindling, Frederick and his men invade Animal Farm, killing many animals and destroying the windmill. The brief alliance and subsequent invasion may allude to the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        " and ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ". ": null
    },
    {
        "Mr. Pilkington": "pilkington"
    },
    {
        " – The easy-going but crafty and well-to-do owner of Foxwood, a large neighbouring farm overgrown with weeds. Unlike Frederick, Pilkington is wealthier and owns more land, but his farm is in need of care as opposed to Fredericks smaller but more efficiently-run farm. Although on bad terms with Frederick, Pilkington is also concerned about the animal revolution that deposed Jones and worried that this could also happen to him.   Mr. Whymper – A man hired by Napoleon to act as the liaison between Animal Farm and human society. At first, he is used to acquire necessities that cannot be produced on the farm, such as dog biscuits and ": null
    },
    {
        "paraffin wax": "paraffin wax"
    },
    {
        ", but later he procures luxuries like alcohol for the pigs.         ": null
    },
    {
        "Boxer": "boxer"
    },
    {
        " – A loyal, kind, dedicated, extremely strong, hard-working, and respectable cart-horse, although quite naive and gullible. Boxer does a large share of the physical labour on the farm. He is shown to hold the belief that Napoleon is always right. At one point, he had challenged Squealers statement that Snowball was always against the welfare of the farm, earning him an attack from Napoleons dogs. But Boxers immense strength repels the attack, worrying the pigs that their authority can be challenged. Boxer has been compared to ": null
    },
    {
        "Alexey Stakhanov": "alexey stakhanov"
    },
    {
        ", a diligent and enthusiastic role model of the ": null
    },
    {
        "Stakhanovite movement": "stakhanovite movement"
    },
    {
        ". He has been described as faithful and strong ; he believes any problem can be solved if he works harder. When Boxer is injured, Napoleon sells him to a local ": null
    },
    {
        "knacker": "knacker"
    },
    {
        " to buy himself whisky, and Squealer gives a moving account, falsifying Boxers death.   Mollie – A self-centred, self-indulgent and vain young white mare who quickly leaves for another farm after the revolution, in a manner similar to those who left Russia after the fall of the Tsar. She is only once mentioned again.   Clover – A gentle, caring female horse, who shows concern especially for Boxer, who often pushes himself too hard. Clover can read all the letters of the alphabet, but cannot put words together . She seems to catch on to the sly tricks and schemes set up by Napoleon and Squealer.   ": null
    },
    {
        "Benjamin": "benjamin"
    },
    {
        " – A donkey, one of the oldest, wisest animals on the farm, and one of the few who can read properly. He is sceptical, temperamental and cynical: his most frequent remark is, Life will go on as it has always gone on—that is, badly. The academic Morris Dickstein has suggested there is a touch of Orwell himself in this creatures timeless scepticism  and indeed, friends called Orwell Donkey George , after his grumbling donkey Benjamin, in Animal Farm.  ": null
    },
    {
        "established religion": "religion and politics"
    },
    {
        " as the black raven of priestcraft—promising pie in the sky when you die, and faithfully serving whoever happens to be in power. Napoleon brings the Raven back , as Stalin brought back the ": null
    },
    {
        "Russian Orthodox Church": "russian orthodox church"
    },
    {
        ".  as they bleat their support Napoleons ideals with jingles during his speeches and meetings with Snowball. Their constant bleating of four legs good, two legs bad was used as a device to drown out any opposition or alternate views from Snowball, much as Stalin used hysterical crowds to drown out Trotsky. Towards the latter section of the book, Squealer trains the sheep to alter their slogan to four legs good, two legs better , which they dutifully do.   The hens – The hens are promised at the start of the revolution that they will get to keep their eggs, which are stolen from them under Mr. Jones. However, their eggs are soon taken from them under the premise of buying goods from outside Animal Farm. The hens are among the first to rebel, albeit unsuccessfully, against Napoleon.   The cows – The cows are enticed into the revolution by promises that their milk will not be stolen, but can be used to raise their own calves. Their milk is then stolen by the pigs, who learn to milk them. The milk is stirred into the pigs mash every day, while the other animals are denied such luxuries.   The cat – Never seen to carry out any work, the cat is absent for long periods and is forgiven because her excuses are so convincing and she purred so affectionately that it was impossible not to believe in her good intentions.  She has no interest in the politics of the farm, and the only time she is recorded as having participated in an election, she is found to have actually voted on both sides.            George Orwell wrote the manuscript in 42 and 42 after his experiences during the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        ", which he described in  Homage to Catalonia  . In the preface of a 42 Ukrainian edition of Animal Farm, he explained how escaping the communist purges in Spain taught him how easily totalitarian propaganda can control the opinion of enlightened people in democratic countries . This motivated Orwell to expose and strongly condemn what he saw as the ": null
    },
    {
        "Stalinist": "stalinist"
    },
    {
        " corruption of the original socialist ideals. Homage at Catalonia sold poorly; after seeing ": null
    },
    {
        "Arthur Koestler": "arthur koestler"
    },
    {
        "s best-selling  Darkness at Noon  about the same war, Orwell decided that fiction was the best way to describe totalitarianism.     Immediately prior to writing the book, Orwell had quit the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ". He was also upset about a booklet for propagandists the Ministry of Information had put out. The booklet included instructions on how to quell ideological fears of the Soviet Union, such as directions to claim that the Red Terror was a figment of Nazi imagination.     In the preface, Orwell described the source of the idea of setting the book on a farm:          Orwell initially encountered difficulty getting the manuscript published, largely due to fears that the book might upset the alliance between Britain, the United States, and the Soviet Union. Four publishers refused; one had initially accepted the work but declined it after consulting the ": null
    },
    {
        "Ministry of Information": "ministry of information"
    },
    {
        ". Eventually, ": null
    },
    {
        "Secker and Warburg": "secker and warburg"
    },
    {
        " published the first edition in 42     During the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        ", it became clear to Orwell that anti-Soviet literature was not something which most major publishing houses would touch—including his regular publisher ": null
    },
    {
        "Gollancz": "victor gollancz ltd"
    },
    {
        ". He also submitted the manuscript to ": null
    },
    {
        "Faber and Faber": "faber and faber"
    },
    {
        ", where the poet ": null
    },
    {
        "T. S. Eliot": "t. s. eliot"
    },
    {
        " rejected it; Eliot wrote back to Orwell praising the books good writing and fundamental integrity , but declared that they would only accept it for publication if they had some sympathy for the viewpoint which I take to be generally ": null
    },
    {
        "Trotskyite": "deformed workers state"
    },
    {
        " . Eliot said he found the view not convincing , and contended that the pigs were made out to be the best to run the farm; he posited that someone might argue what was needed... was not more communism but more public-spirited pigs . Orwell let ": null
    },
    {
        "André Deutsch": "andré deutsch"
    },
    {
        ", who was working for Nicholson & Watson in 42 read the typescript, and Deutsch was convinced that Nicholson & Watson would want to publish it; however, they did not, and lectured Orwell on what they perceived to be errors in Animal Farm.  In his London Letter on 42 April 42 for  Partisan Review , Orwell wrote that it was now next door to impossible to get anything overtly anti-Russian printed. Anti-Russian books do appear, but mostly from Catholic publishing firms and always from a religious or frankly reactionary angle.     The publisher ": null
    },
    {
        "Jonathan Cape": "jonathan cape"
    },
    {
        ", who had initially accepted Animal Farm, subsequently rejected the book after an official at the British Ministry of Information warned him off—although the civil servant who it is assumed gave the order was later found to be a ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " spy. Writing to ": null
    },
    {
        "Leonard Moore": "leonard moore"
    },
    {
        ", a partner in the literary agency of Christy & Moore, publisher Jonathan Cape explained that the decision had been taken on the advice of a senior official in the Ministry of Information. Such flagrant anti-Soviet bias was unacceptable, and the choice of pigs as the dominant class was thought to be especially offensive. It may reasonably be assumed that the important official was a man named ": null
    },
    {
        "Peter Smollett": "peter smollett"
    },
    {
        ", who was later unmasked as a Soviet agent. Orwell was suspicious of Smollett/Smolka, and he would be one of the names Orwell ": null
    },
    {
        "included in his list": "orwells list"
    },
    {
        " of Crypto-Communists and Fellow-Travellers sent to the ": null
    },
    {
        "Information Research Department": "information research department"
    },
    {
        " in 42 The publisher wrote to Orwell, saying:        ": null
    },
    {
        "Frederic Warburg": "frederic warburg"
    },
    {
        " also faced pressures against publication, even from people in his own office and from his wife Pamela, who felt that it was not the moment for ingratitude towards Stalin and the heroic ": null
    },
    {
        "Red Army": "red army"
    },
    {
        ", which had ": null
    },
    {
        "played a major part": "world war ii casualties of the soviet union"
    },
    {
        " in defeating ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ". A Russian translation was printed in the paper Posev, and in giving permission for a Russian translation of Animal Farm, Orwell refused in advance all royalties. A translation in Ukrainian, which was produced in Germany, was confiscated in large part by the American wartime authorities and handed over to the Soviet repatriation commission.     In October 42 Orwell wrote to Frederic Warburg expressing interest in pursuing the possibility that the political cartoonist ": null
    },
    {
        "David Low": "david low"
    },
    {
        " might illustrate Animal Farm. Low had written a letter saying that he had had a good time with ANIMAL FARM—an excellent bit of satire—it would illustrate perfectly. Nothing came of this, and a trial issue produced by Secker & Warburg in 42 illustrated by John Driver was abandoned, but the ": null
    },
    {
        "Folio Society": "folio society"
    },
    {
        " published an edition in 42 illustrated by ": null
    },
    {
        "Quentin Blake": "quentin blake"
    },
    {
        " and an edition illustrated by the cartoonist ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        " was published by Secker & Warburg in 42 to celebrate the fiftieth anniversary of the first edition of Animal Farm.       Orwell originally wrote a preface complaining about British ": null
    },
    {
        "self-censorship": "self-censorship"
    },
    {
        " and how the British people were suppressing criticism of the USSR, their World War II ally:      Although the first edition allowed space for the preface, it was not included, and as of June 42 most editions of the book have not included it.     Secker and Warburg published the first edition of Animal Farm in 42 without an introduction. However, the publisher had provided space for a preface in the authors proof composited from the manuscript. For reasons unknown, no preface was supplied, and the page numbers had to be renumbered at the last minute.     In 42 ": null
    },
    {
        "Ian Angus": "ian angus"
    },
    {
        " found the original typescript titled The Freedom of the Press , and ": null
    },
    {
        "Bernard Crick": "bernard crick"
    },
    {
        " published it, together with his own introduction, in  The Times Literary Supplement  on 42 September 42 as How the essay came to be written . Orwells essay criticised British self-censorship by the press, specifically the suppression of unflattering descriptions of Stalin and the Soviet government. The same essay also appeared in the Italian 42 edition of Animal Farm with another introduction by Crick, claiming to be the first edition with the preface. Other publishers were still declining to publish it.       Contemporary reviews of the work were not universally positive. Writing in the American  New Republic  magazine, George Soule expressed his disappointment in the book, writing that it puzzled and saddened me. It seemed on the whole dull. The allegory turned out to be a creaking machine for saying in a clumsy way things that have been said better directly. Soule believed that the animals were not consistent enough with their real-world inspirations, and said, It seems to me that the failure of this book arises from the fact that the satire deals not with something the author has experienced, but rather with stereotyped ideas about a country which he probably does not know very well .      The Guardian  on 42 August 42 called Animal Farm a delightfully humorous and caustic satire on the rule of the many by the few . ": null
    },
    {
        "Tosco Fyvel": "tosco fyvel"
    },
    {
        ", writing in  Tribune  on the same day, called the book a gentle satire on a certain State and on the illusions of an age which may already be behind us. ": null
    },
    {
        "Julian Symons": "julian symons"
    },
    {
        " responded, on 42 September, Should we not expect, in Tribune at least, acknowledgement of the fact that it is a satire not at all gentle upon a particular State—Soviet Russia? It seems to me that a reviewer should have the courage to identify Napoleon with Stalin, and Snowball with Trotsky, and express an opinion favourable or unfavourable to the author, upon a political ground. In a hundred years time perhaps, Animal Farm may be simply a fairy story, today it is a political satire with a good deal of point.     Animal Farm has been subject to much comment in the decades since these early remarks.     The ": null
    },
    {
        "CIA": "cia"
    },
    {
        " from 42 to 42 in Operation Aedinosaur sent millions of balloons carrying copies of the novel into Poland, Hungary, and Czechoslovakia, whose air forces tried to shoot the balloons down.                 The pigs Snowball, Napoleon, and Squealer adapt Old Majors ideas into a complete system of thought , which they formally name Animalism, an allegoric reference to ": null
    },
    {
        "Communism": "communism"
    },
    {
        ", not to be confused with ": null
    },
    {
        "the philosophy Animalism": "animalism"
    },
    {
        ". Soon after, Napoleon and Squealer partake in activities associated with the humans , which were explicitly prohibited by the Seven Commandments. Squealer is employed to alter the Seven Commandments to account for this humanisation, an ": null
    },
    {
        "allusion": "allusion"
    },
    {
        " to the Soviet governments revising of history in order to exercise control of the peoples beliefs about themselves and their society.        The original commandments are:   Whatever goes upon two legs is an enemy.   Whatever goes upon four legs, or has wings, is a friend.   No animal shall wear clothes.   No animal shall sleep in a bed.   No animal shall drink alcohol.   No animal shall kill any other animal.   All animals are equal.     These commandments are also distilled into the maxim Four legs good, two legs bad! which is primarily used by the sheep on the farm, often to disrupt discussions and disagreements between animals on the nature of Animalism.     Later, Napoleon and his pigs secretly revise some commandments to clear themselves of accusations of law-breaking. The changed commandments are as follows, with the changes bolded:     No animal shall sleep in a bed with sheets.   No animal shall drink alcohol to excess.   No animal shall kill any other animal without cause.     Eventually, these are replaced with the maxims, All animals are equal, but some animals are more equal than others , and Four legs good, two legs better! as the pigs become more human. This is an ": null
    },
    {
        "ironic": "irony"
    },
    {
        " twist to the original purpose of the Seven Commandments, which were supposed to keep order within Animal Farm by uniting the animals together against the humans and preventing animals from following the humans evil habits. Through the revision of the commandments, Orwell demonstrates how simply political ": null
    },
    {
        "dogma": "dogma"
    },
    {
        " can be turned into malleable ": null
    },
    {
        "propaganda": "propaganda"
    },
    {
        ".          Orwell biographer Jeffrey Meyers has written, virtually every detail has political significance in this allegory.  Orwell himself wrote in 42 Of course I intended it primarily as a satire on the Russian revolution... that kind of revolution can only lead to a change of masters revolutions only effect a radical improvement when the masses are alert.  In a preface for a 42 Ukrainian edition, he stated, ...  for the past ten years I have been convinced that the destruction of the Soviet myth was essential if we wanted a revival of the socialist movement. On my return from Spain I thought of exposing the Soviet myth in a story that could be easily understood by almost anyone and which could be easily translated into other languages.      The revolt of the animals against Farmer Jones is Orwells analogy with the ": null
    },
    {
        "October 42 Bolshevik Revolution": "october revolution"
    },
    {
        ". The Battle of the Cowshed has been said to represent the ": null
    },
    {
        "allied invasion": "allied intervention in the russian civil war"
    },
    {
        " of ": null
    },
    {
        "Soviet Russia": "russian sfsr"
    },
    {
        " in 42 and the defeat of the ": null
    },
    {
        "White Russians": "white movement"
    },
    {
        " in the ": null
    },
    {
        "Russian Civil War": "russian civil war"
    },
    {
        ". The pigs rise to pre-eminence mirrors the rise of a Stalinist bureaucracy in the USSR, just as Napoleons emergence as the farms sole leader reflects Stalins emergence. The pigs appropriation of milk and apples for their own use, the turning point of the story as Orwell termed it in a letter to ": null
    },
    {
        "Dwight Macdonald": "dwight macdonald"
    },
    {
        ", stands as an analogy for the crushing of the left-wing 42 ": null
    },
    {
        "Kronstadt revolt": "kronstadt rebellion"
    },
    {
        " against the Bolsheviks, and the difficult efforts of the animals to build the windmill suggest the various ": null
    },
    {
        "Five Year Plans": "five-year plans for the national economy of the soviet union"
    },
    {
        ". The puppies controlled by Napoleon parallel the nurture of the secret police in the Stalinist structure, and the pigs treatment of the other animals on the farm recalls the internal terror faced by the populace in the 42s. In chapter seven, when the animals confess their nonexistent crimes and are killed, Orwell directly alludes to the purges, confessions and ": null
    },
    {
        "show trials": "moscow show trials"
    },
    {
        " of the late 42s. These contributed to Orwells conviction that the Bolshevik revolution had been corrupted and the Soviet system become rotten.     ": null
    },
    {
        "Peter Edgerly Firchow": "peter edgerly firchow"
    },
    {
        " and ": null
    },
    {
        "Peter Davison": "peter davison"
    },
    {
        " consider that the Battle of the Windmill represents ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", especially the ": null
    },
    {
        "Battle of Stalingrad": "battle of stalingrad"
    },
    {
        " and the ": null
    },
    {
        "Battle of Moscow": "battle of moscow"
    },
    {
        ". During the battle, Orwell first wrote, All the animals, including Napoleon took cover. Orwell had the publisher alter this to All the animals except Napoleon in recognition of Stalins decision to remain in Moscow during the German advance. Orwell requested the change after he met Joseph Czapski in Paris in March 42 Czapski, a survivor of the ": null
    },
    {
        "Katyn Massacre": "katyn massacre"
    },
    {
        " and an opponent of the Soviet regime, told Orwell, as Orwell wrote to ": null
    },
    {
        "Arthur Koestler": "arthur koestler"
    },
    {
        ", that it had been the character greatness of Stalin that saved Russia from the German invasion.          Other connections that writers have suggested illustrate Orwells telescoping of Russian history from 42 to 42 include the wave of rebelliousness that ran through the countryside after the Rebellion, which stands for the abortive revolutions ": null
    },
    {
        "in Hungary": "hungarian revolution of 1919"
    },
    {
        " and ": null
    },
    {
        "in Germany": "german revolution of 1918–19"
    },
    {
        " ; the conflict between Napoleon and Snowball , paralleling the two rival and quasi-Messianic beliefs that seemed pitted against one another: ": null
    },
    {
        "Trotskyism": "trotskyism"
    },
    {
        ", with its faith in the ": null
    },
    {
        "revolutionary vocation": "permanent revolution"
    },
    {
        " of the proletariat of the West; and Stalinism with its glorification of ": null
    },
    {
        "Russias socialist destiny": "socialism in one country"
    },
    {
        " ; Napoleons dealings with Whymper and the Willingdon markets , paralleling the ": null
    },
    {
        "Treaty of Rapallo": "treaty of rapallo"
    },
    {
        "; and Fredericks forged bank notes, paralleling the ": null
    },
    {
        "Hitler-Stalin pact of August 42": "treaty of non-aggression between germany and the soviet union"
    },
    {
        ", after which Frederick attacks Animal Farm without warning and destroys the windmill.     The books close, with the pigs and men in a kind of ": null
    },
    {
        "rapprochement": "rapprochement"
    },
    {
        ", reflected Orwells view of the 42 ": null
    },
    {
        "Teheran Conference": "teheran conference"
    },
    {
        " that seemed to display the establishment of the best possible relations between the USSR and the West —but in reality were destined, as Orwell presciently predicted, to continue to unravel. The disagreement between the allies and the start of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " is suggested when Napoleon and Pilkington, both suspicious, played an ace of spades simultaneously .     Similarly, the music in the novel, starting with Beasts of England and the later anthems, parallels ": null
    },
    {
        "The Internationale": "the internationale"
    },
    {
        " and its adoption and repudiation by the Soviet authorities as to the Anthem of the USSR in the 42s and 42s.         Animal Farm has been adapted to film twice. Both differ from the novel and have been accused of taking significant liberties, including sanitising some aspects.   ": null
    },
    {
        "Animal Farm": "animal farm"
    },
    {
        " is an animated feature in which Napoleon is apparently overthrown in a second revolution. In 42 ": null
    },
    {
        "E. Howard Hunt": "e. howard hunt"
    },
    {
        " revealed that he had been sent by the ": null
    },
    {
        "CIA": "cia"
    },
    {
        "s ": null
    },
    {
        "Psychological Warfare": "psychological warfare"
    },
    {
        " department to obtain the film rights from Orwells widow, and the resulting 42 animation was funded by the agency. ": null
    },
    {
        "Animal Farm": "animal farm"
    },
    {
        " is a TV live-action version that shows Napoleons regime collapsing in on itself, with the farm having new human owners, reflecting the collapse of Soviet communism.     In 42 an HFR42D version of Animal Farm, potentially directed by ": null
    },
    {
        "Andy Serkis": "andy serkis"
    },
    {
        ", was announced.       A BBC radio version, produced by ": null
    },
    {
        "Rayner Heppenstall": "rayner heppenstall"
    },
    {
        ", was broadcast in January 42 Orwell listened to the production at his home in Canonbury Square, London, with ": null
    },
    {
        "Hugh Gordon Porteous": "hugh gordon porteus"
    },
    {
        ", amongst others. Orwell later wrote to Heppenstall that Porteous, who had not read the book, grasped what was happening after a few minutes.      A further radio production, again using Orwells own dramatisation of the book, was broadcast in January 42 on BBC ": null
    },
    {
        "Radio 42": "radio four"
    },
    {
        ". ": null
    },
    {
        "Tamsin Greig": "tamsin greig"
    },
    {
        " narrated, and the cast included ": null
    },
    {
        "Nicky Henson": "nicky henson"
    },
    {
        " as Napoleon, ": null
    },
    {
        "Toby Jones": "toby jones"
    },
    {
        " as the propagandist Squealer, and ": null
    },
    {
        "Ralph Ineson": "ralph ineson"
    },
    {
        " as Boxer.       A theatrical version, with music by ": null
    },
    {
        "Richard Peaslee": "richard peaslee"
    },
    {
        " and lyrics by ": null
    },
    {
        "Adrian Mitchell": "adrian mitchell"
    },
    {
        ", was staged at the ": null
    },
    {
        "National Theatre": "royal national theatre"
    },
    {
        " London on 42 April 42 directed by ": null
    },
    {
        "Peter Hall": "peter hall"
    },
    {
        ". It toured nine cities in 42     A solo version, adapted and performed by Guy Masterson, premièred at the ": null
    },
    {
        "Traverse Theatre": "traverse theatre"
    },
    {
        " Edinburgh in January 42 and has toured worldwide since.       thu   In 42 Norman Pett and his writing partner Don Freeman were secretly hired by the British Foreign Office to adapt Animal Farm": null
    }
]