[
    {
        "     In ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        ", animus nocendi  is the subjective state of mind of the author of a ": null
    },
    {
        "crime": "crime"
    },
    {
        ", with reference to the exact knowledge of illegal content of his behaviour, and of its possible consequences.     In most modern legal systems, the animus nocendi is required as an essential condition to give a penal condemnation.     The animus nocendi is usually demonstrated by the verified presence of these elements:   knowledge of a law that prohibited the discussed action or conduct ;   knowledge of the most likely consequences of his action;   precise intention of breaking the law or of causing the verified effects of the action.     When the author of the crime had no animus nocendi, it is usually considered that the crime still exists, but the author is innocent, unless a responsibility for ": null
    },
    {
        "guilt": "guilt"
    },
    {
        " can be found in his conduct: the typical case of a car accident in which a wrong or even hazardous manoeuvre causes personal injuries to another car driver, is then managed as a crime for the presence of injuries, yet the author will not be prosecuted as the author of the injuries , but simply as the author of a dangerous conduct that indirectly caused said effects, and would be held responsible at a guilt title.     The animus nocendi is often absent in people with ": null
    },
    {
        "mental illness": "mental illness"
    },
    {
        ", and in front of such people, a psychiatric expertise is usually required to verify the eventual animus. Minors too are in many systems considered little capable of a correct knowledge about the meaning or the consequences of their actions, and this is the reason for the common reduction of the passive capability of punishment they usually can receive.     A particular case of animus nocendi is the  voluntas necandi ": null
    }
]