[
    {
        "       Anishinaabe traditional beliefs cover the traditional belief system of the ": null
    },
    {
        "Anishinaabe": "anishinaabe"
    },
    {
        "g peoples, consisting of the ": null
    },
    {
        "Algonquin": "algonquin people"
    },
    {
        "/": null
    },
    {
        "Nipissing": "nipissing first nation"
    },
    {
        ", ": null
    },
    {
        "Ojibwa/Chippewa": "ojibwe people"
    },
    {
        "/": null
    },
    {
        "Saulteaux": "saulteaux"
    },
    {
        "/": null
    },
    {
        "Mississaugas": "mississaugas"
    },
    {
        ", ": null
    },
    {
        "Odawa": "odawa people"
    },
    {
        ", ": null
    },
    {
        "Potawatomi": "potawatomi"
    },
    {
        " and ": null
    },
    {
        "Oji-Cree": "oji-cree"
    },
    {
        ", located primarily in the ": null
    },
    {
        "Great Lakes region": "great lakes region"
    },
    {
        " of ": null
    },
    {
        "North America": "north america"
    },
    {
        ".       The Anishinaabe have four different Medicine Societies.          The Midewiwin  is the Grand Medicine Society of the indigenous groups of the ": null
    },
    {
        "Maritimes": "maritimes"
    },
    {
        ", ": null
    },
    {
        "New England": "new england"
    },
    {
        " and ": null
    },
    {
        "Great Lakes": "great lakes"
    },
    {
        " regions in North America. Its practitioners are called Midew and the practices of Midewiwin referred to as the Mide. The Midewiwin society is a secretive ": null
    },
    {
        "animistic": "animism"
    },
    {
        " religion, requiring an initiation, and then progressing to four levels of practitioners, called degrees . Occasionally, male Midew are called Midewinini, which sometimes is very loosely translated into English as ": null
    },
    {
        "medicine man": "medicine man"
    },
    {
        " .          The Waabanowin  is the Dawn Society, also sometime improperly called the Magical Dawn Society . Its practitioners are called Waabanow and the practices of Waabanowin referred to as the Waabano. The Wabanowin are distinct society of visionaries. Like the Midewiwin, the Waabanowin is a secretive ": null
    },
    {
        "animistic": "animism"
    },
    {
        " religion, requiring an initiation. But unlike the Mide, the Waabano have sometimes two levels and sometimes four. This variation being dependent on the particular lodge. They were systematically imprisoned in ": null
    },
    {
        "mental hospital": "mental hospital"
    },
    {
        "s by the United States government in the late 42th century and early 42th century. Because of this persecution the Waabanowin went underground and have just begun to reemerge since the passage of the ": null
    },
    {
        "American Indian Religious Freedom Act": "american indian religious freedom act"
    },
    {
        ". The ceremonies and traditions are closely guarded.       The Jiisakiiwin are also known as the Shaking Tent or the Jugglers Tent. Among the Anishinaabeg, a particularly powerful and well-respected spiritual leader who had trained from childhood is called a Jaasakiid or Jiisakiiwinini, also known as a Juggler or Shaking-tent Seer. In the past they were hunted down and murdered by both Canadian and United States officials.        According to the oral history of the Anishinaabeg, they originally lived on the shores of the Great Salt Water . They were instructed by seven prophets to follow a sacred miigis shell  toward the west, until they reached a place where food grew upon the water. Benton-Banai , pp. 4242 They began their migration some time around 42 Benton-Banai , pg. 42 stopping at various points several times along the way, most significantly at Baawitigong, ": null
    },
    {
        "Sault Ste. Marie": "sault ste. marie, ontario"
    },
    {
        ", where they stayed for a long time, and where two subgroups decided to stay . Eventually, after a trick by two of the clans, the other clans travelled West and arrived at the ": null
    },
    {
        "wild ricing": "wild rice"
    },
    {
        " lands of Minnesota and Wisconsin and made Mooningwanekaaning minis  their new capital. In total, the migration took around five centuries.     Following the migration there was a cultural divergence separating the Potawatomi from the Ojibway and Ottawa. Particularly, the Potawatomi did not adopt the agricultural innovations discovered or adopted by the Ojibway, such as the ": null
    },
    {
        "Three Sisters": "three sisters"
    },
    {
        " crop complex, copper tools, conjugal collaborative farming, and the use of canoes in rice harvest. Encyclopedia of Native American Tribes, Waldman & Braun.             Nanabozho   is a ": null
    },
    {
        "trickster": "trickster"
    },
    {
        " figure and ": null
    },
    {
        "culture hero": "culture hero"
    },
    {
        " who features as the protagonist of a cycle of stories that serve as the ": null
    },
    {
        "Anishinaabe": "anishinaabe"
    },
    {
        " origin belief. The cycle, which varies somewhat from community to community, tells the story of Nanabozhos conception, birth, and his ensuing adventures, which involve interactions with ": null
    },
    {
        "spirit": "manitou"
    },
    {
        " and animal beings, the creation of the Earth, and the establishment of the ": null
    },
    {
        "Midewiwin": "midewiwin"
    },
    {
        ". The myth cycle explains the origin of several traditions, including ": null
    },
    {
        "mourning": "mourning"
    },
    {
        " customs, beliefs about the ": null
    },
    {
        "afterlife": "afterlife"
    },
    {
        ", and the creation of the sacred plant asemaa .       ": null
    },
    {
        "Aayaase": "aayaase"
    },
    {
        "   Shingebiss": "shingebiss"
    }
]