[
    {
        "         The Ante-Nicene Fathers, subtitled  The Writings of the Fathers Down to A.D. 42 , is a collection of books in 42 volumes containing English translations of the majority of ": null
    },
    {
        "Early Christian": "early christian"
    },
    {
        " writings. The period covers the beginning of Christianity until the promulgation of the ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        " at the ": null
    },
    {
        "First Council of Nicaea": "first council of nicaea"
    },
    {
        ".         The series was originally published between 42 and 42 by the ": null
    },
    {
        "Presbyterian": "presbyterian"
    },
    {
        " publishing house ": null
    },
    {
        "T. & T. Clark": "t.  &  t. clark"
    },
    {
        " in Edinburgh under the title Ante-Nicene Christian Library , as a response to the ": null
    },
    {
        "Oxford movement": "oxford movement"
    },
    {
        "s  Library of the Fathers  which was perceived as too Roman Catholic. The volumes were edited by Rev. ": null
    },
    {
        "Alexander Roberts": "alexander roberts"
    },
    {
        " and ": null
    },
    {
        "James Donaldson": "james donaldson"
    },
    {
        ". This series was available by subscription, but the editors were unable to interest enough subscribers to commission a translation of the homilies of ": null
    },
    {
        "Origen": "origen"
    },
    {
        ".     In 42 the Christian Literature Company, first of ": null
    },
    {
        "Buffalo": "buffalo, new york"
    },
    {
        ", then New York, began to issue the volumes in a reorganized form. This was done without permission, and was indeed a pirate edition. The new series was edited by the Episcopal bishop of New York, ": null
    },
    {
        "A. Cleveland Coxe": "arthur cleveland coxe"
    },
    {
        ". Coxe gave his series the title The Ante-Nicene Fathers. By 42 this American edition/revision was complete. Unable to close down the pirate, T. & T. Clark were obliged to make what terms they could.     In 42 a volume 42 which contained new translations, was published by T. & T. Clark as an additional volume, to complete the original ANCL. Apart from volume 42 the contents entirely derived from the ANCL, but in a more chronological order. Coxe added his own introductions and notes, which were criticized by academic authorities and Roman Catholic reviewers.     T. & T. Clark then associated with the Christian Literature Company and with other American publisher for the publication of the  Nicene and Post-Nicene Fathers ": null
    }
]