[
    {
        "        Antiochus XII Dionysus Epiphanes Philopator Callinicus  was a ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " Seleucid": "seleucid empire"
    },
    {
        " monarch who reigned as ": null
    },
    {
        "King of Syria": "list of syrian monarchs"
    },
    {
        " between 42 and 42 BC. The youngest son of ": null
    },
    {
        "Antiochus VIII": "antiochus viii grypus"
    },
    {
        " and, most likely, his Egyptian wife ": null
    },
    {
        "Tryphaena": "tryphaena"
    },
    {
        ", Antiochus XII lived during a period of civil war between his father and his uncle ": null
    },
    {
        "Antiochus IX": "antiochus ix cyzicenus"
    },
    {
        ", which ended with the assassination of Antiochus VIII in 42 BC. Antiochus XIIs four brothers laid claim to the throne, eliminated Antiochus IX as a claimant, and waged war against his heir ": null
    },
    {
        "Antiochus X": "antiochus x eusebes"
    },
    {
        ".     By 42 BC, only two claimants remained, both brothers of Antiochus XII: ": null
    },
    {
        "Demetrius III": "demetrius iii eucaerus"
    },
    {
        " and ": null
    },
    {
        "Philip I": "philip i philadelphus"
    },
    {
        ". The realm of Demetrius III was initially centered in Damascus but later extended over most of Syria. Demetrius III was defeated by Philip I and went into exile in ": null
    },
    {
        "Parthia": "parthian empire"
    },
    {
        ", allowing Antiochus XII to gain control of Damascus while Philip I remained in the Syrian capital ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        ". Antiochus XII consolidated his territory within inner Syria and did not seek to expand into the territories of Philip I, who attempted to annex Damascus but was repulsed. Antiochus XII focused his attention on Syrias southern reaches into which the ": null
    },
    {
        "Judaeans": "hasmonean dynasty"
    },
    {
        " and ": null
    },
    {
        "Nabataeans": "nabataeans"
    },
    {
        " sought to expand.     Antiochus XII reinforced his southern frontier and warred with his neighbors, conducting two campaigns against Nabataea that included engagements with Judea. After several victories in his first campaign, Antiochus XII was killed towards the end of his second campaign against the Nabateans at the ": null
    },
    {
        "Battle of Cana": "battle of cana"
    },
    {
        " in 42 BC. Damascus was captured by the forces of the Nabatean King ": null
    },
    {
        "Aretas III": "aretas iii"
    },
    {
        ", and the Syrian throne was claimed by Antiochus Xs widow ": null
    },
    {
        "Cleopatra Selene": "cleopatra selene of syria"
    },
    {
        " and her son ": null
    },
    {
        "Antiochus XIII": "antiochus xiii asiaticus"
    },
    {
        ".          Antiochus, Greek for resolute in contention , was a dynastic name borne by many ": null
    },
    {
        "Seleucid": "seleucid empire"
    },
    {
        " monarchs. The Seleucid dynastys founder ": null
    },
    {
        "Seleucus I": "seleucus i nicator"
    },
    {
        " named the capital of Syria, ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        ", in honor of his father ": null
    },
    {
        "Antiochus": "antiochus"
    },
    {
        ". Antiochus XII was the fifth and youngest son of ": null
    },
    {
        "Antiochus VIII": "antiochus viii grypus"
    },
    {
        " and his ": null
    },
    {
        "Ptolemaic": "ptolemaic dynasty"
    },
    {
        " Egyptian wife ": null
    },
    {
        "Tryphaena": "tryphaena"
    },
    {
        ", who married in 42 BC. In 42 BC, Tryphaena was killed by Antiochus VIIIs half-brother ": null
    },
    {
        "Antiochus IX": "antiochus ix cyzicenus"
    },
    {
        ", who fought with Antiochus VIII from 42 BC for the throne of Syria. Antiochus XIIs brothers were ": null
    },
    {
        "Seleucus VI": "seleucus vi epiphanes"
    },
    {
        ", ": null
    },
    {
        "Antiochus XI": "antiochus xi epiphanes"
    },
    {
        ", ": null
    },
    {
        "Philip I": "philip i philadelphus"
    },
    {
        " and ": null
    },
    {
        "Demetrius III": "demetrius iii eucaerus"
    },
    {
        ".     Following Antiochus VIIIs assassination in 42 BC, his second wife, Tryphaenas sister ": null
    },
    {
        "Cleopatra Selene": "cleopatra selene of syria"
    },
    {
        ", married Antiochus IX and then his son ": null
    },
    {
        "Antiochus X": "antiochus x eusebes"
    },
    {
        ", who fought with Antiochus XIIs four brothers for the throne. By 42 BC, only Demetrius III and Philip I remained; Demetrius III was originally based in ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        " before extending his authority to most of Syria. He was defeated by Philip I and his ": null
    },
    {
        "Parthia": "parthia"
    },
    {
        "n allies in 42 BC and exiled to ": null
    },
    {
        "Parthia": "parthian empire"
    },
    {
        ", where he died of an unknown illness. Philip I took control of the capital, while Cleopatra Selene, now a widow, took shelter in ": null
    },
    {
        "Ptolemais": "ptolemais in phoenicia"
    },
    {
        " with her sons by Antiochus X.       The departure of Demetrius III left a power vacuum in Damascus that was filled by Antiochus XII. Coins minted during the reign of Demetrius III are dated to the ": null
    },
    {
        "Seleucid year ": "seleucid era"
    },
    {
        " 42 , while the earliest coins minted during the reign of Antiochus XII have the date 42 SE , suggesting there was a rapid assumption of power by Antiochus XII. Monarchs of the ": null
    },
    {
        "Hellenistic period": "hellenistic period"
    },
    {
        " did not use ": null
    },
    {
        "regnal number": "regnal number"
    },
    {
        "s, which is a more modern practice, but instead used epithets to distinguish themselves from similarly named monarchs; Three of Antiochus XIIs four epithets, Epiphanes –previously used by his father, Philopator and Callinicus , served to emphasize the ancestry of his grandfather ": null
    },
    {
        "Demetrius II": "demetrius ii nicator"
    },
    {
        " in contrast to the line of the latters brother ": null
    },
    {
        "Antiochus VII": "antiochus vii sidetes"
    },
    {
        ", which was represented by Antiochus IX and his descendants; Callinicus may have been an echo of Demetrius IIs epithet Nikator . He likely used his other epithet Dionysus to associate himself with the ": null
    },
    {
        "Greek god of wine": "dionysus"
    },
    {
        " in his role as conqueror of the East. Antiochus XII was depicted on coinage with an exaggerated hawked nose in the likeness of his father, as a means of strengthening the legitimacy of his succession.          According to historian ": null
    },
    {
        "Alfred Bellinger": "alfred bellinger"
    },
    {
        ", Antiochus XII may have received assistance from ": null
    },
    {
        "Ptolemaic Egypt": "ptolemaic dynasty"
    },
    {
        " to gain his throne. This view is reflected in Antiochus XIIs policies, which were targeted at the south in Nabataea and Judaea, but not towards expansion within the kingdom of Syria. His dominion was limited to inner Syria, centered on Damascus, which served as his capital and primary ": null
    },
    {
        "mint": "mint"
    },
    {
        ". Antiochus XII also ruled over the town of ": null
    },
    {
        "Gadara": "umm qais"
    },
    {
        ", governed by an official named Philotas. In 42 BC, Gadara had been conquered by the ": null
    },
    {
        "Hasmonean": "hasmonean dynasty"
    },
    {
        " king of ": null
    },
    {
        "Judea": "judea"
    },
    {
        " Alexander Jannaeus": "alexander jannaeus"
    },
    {
        ", who partially destroyed its walls, but it was recaptured by the Seleucids in 42 BC. Gadara held great strategic importance for Syria as it served as a major military hub for operations in the south. Controlling it was vital to the war effort against the Judaeans, which led Antiochus to rebuild the citys defenses in 42 SE . Historian ": null
    },
    {
        "Aryeh Kasher": "aryeh kasher"
    },
    {
        " suggested that Antiochus XII dug what the first-century historian ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        " called the trench of Antiochus to protect Damascus from the ": null
    },
    {
        "Nabataeans": "nabataeans"
    },
    {
        "; the trench was probably located in the ": null
    },
    {
        "Hula Valley": "hula valley"
    },
    {
        ".     Seleucid coins often had depictions of their Greek deities, but the silver coinage of Antiochus XII depicted the supreme Semitic god ": null
    },
    {
        "Hadad": "hadad"
    },
    {
        " on the reverse, possibly in recognition of the shrinking borders of the kingdom, which convinced the monarch of the importance of the local cults. By promoting indigenous deities, Seleucid kings hoped to gain the support of their non-Greek subjects. According to Bellinger, the use of Hadad indicated that Antiochus XII placed focus on his intention of being first and foremost king of Damascus . During his reign, Demetrius III had also depicted a Semitic deity, ": null
    },
    {
        "Atargatis": "atargatis"
    },
    {
        ", on his currency. In the view of historian , The change of coin imagery from Atargatis to Hadad probably served two goals: to imply that Antiochus XII had a different policy focus than his predecessor, and to demonstrate his intention of maintaining a good relationship with the Semitic population of Damascus, who comprised the majority of the inhabitants, to avoid tension with Greek settlers. Seleucid kings presented themselves as protectors of ": null
    },
    {
        "Hellenism": "hellenistic periodculture"
    },
    {
        " and patronized intellectuals and philosophers, but Antiochus XII may have adopted a different attitude; he ordered the expulsion of such scholars.          Early in his reign, Antiochus XII attacked the Nabataeans and the Judaeans, whose territories both lay south of his own. This conflict was recorded by Josephus, although he made no mention of the name of the Nabataean king. Josephus mentioned two campaigns against the Nabataeans, but did not explain the motives leading the Syrian King to attack them. Modern scholars presented several theories. In the view of Israel Shatzman, Antiochus XII may have feared the growing power of the Nabataeans, who were expanding into southern Syria. Zayn Bilkadi suggested that Antiochus XII wanted to take control over the Nabataeans ": null
    },
    {
        "crude oil": "petroleum"
    },
    {
        " industry, while Alexander Fantalkin and Oren Tal suggested that the Nabataeans actively supported Philip I in his attempts to take control over Antiochus XIIs realm.       Antiochus XIIs first Nabataean campaign was launched in 42 BC, and might have included a battle near Motho, modern ": null
    },
    {
        "Imtan": "imtan"
    },
    {
        " in the region of Hauran, as proposed by the historian Hans Peter Roschinski, who drew on the writings of ": null
    },
    {
        "Stephanus of Byzantium": "stephanus of byzantium"
    },
    {
        ". The Byzantine historian preserved in his book, Ethica, fragments from a lost work by the historian Uranius of Apamea, who wrote a book titled Arabica, which has been dated to 42 AD. In the account of Uranius, King ": null
    },
    {
        "Antigonus I": "antigonus i monophthalmus"
    },
    {
        "  is killed at Motho by a king of the Arabs named Rabbel. The name Motho could refer to a northern city in ": null
    },
    {
        "Hauran": "hauran"
    },
    {
        " or a southern city in ": null
    },
    {
        "Moab": "moab"
    },
    {
        ". The name of Antigonus was regularly corrected to Antiochus by different scholars who believed that Uranius was referring to Antiochus XII. Roschinski considered it conceivable that Stephanus was conflating two events taking place during the reign of the Nabataean King Rabbel I: a battle of Antiochus XIIs first Nabataean campaign at Motho in the north, and the battle from the second Nabataean campaign in which Antiochus XII was killed. Shatzman, on the other hand, noted that nowhere in his work did Stephanus indicate that the battle of Motho took place in the north.     Taking advantage of his brothers absence, Philip I seized Damascus, aided by the governor of the citys citadel, Milesius, who opened the gates to him. According to Josephus, Milesius received no reward from Philip I, who attributed the betrayal to the generals fear, leading Milesius to betray Philip I, who had left the city to attend an event in the nearby ": null
    },
    {
        "hippodrome": "hippodrome"
    },
    {
        ". The general closed the gates, locking Philip I out, and awaited the return of Antiochus XII, who had hastily ended his campaign when he heard of his brothers occupation of the city. Modern scholars noted that Seleucid currency, struck during campaigns against a rival , portrayed the King sporting a beard. During his first two years, Antiochus XIIs visage appeared beardless, but this changed in 42 SE . This is possibly related to Philip Is attack on Damascus, but this supposition has little support, as Antiochus XII failed to take any action against his brother. No coins were minted during the period that Philip I held Damascus, indicating only a brief occupation of the city.       Although his territory directly abutted Nabataean territory, for his second Nabataean campaign Antiochus XII instead chose to march his forces through Judaea along the coast, probably to attack the Nabataean-dominated ": null
    },
    {
        "Negev": "negev"
    },
    {
        ", which would have cut off the port city of ": null
    },
    {
        "Gaza": "gaza city"
    },
    {
        ", threatened Nabataean Mediterranean trade, and curbed Nabataean ambitions in the ": null
    },
    {
        "Transjordan": "transjordan"
    },
    {
        ". This route would have allowed Antiochus XII to keep Alexander Jannaeus at bay. According to Josephus, the Judaean King feared Antiochus XIIs intentions and ordered the Yannai Line to be built, which consisted of a trench that fronted a defensive wall dotted with wooden towers. The trench stretched  from ": null
    },
    {
        "Caphersaba": "kfar saba"
    },
    {
        " to the sea near ": null
    },
    {
        "Joppa": "jaffa"
    },
    {
        ". Antiochus XII leveled the trench, burned the fortifications, and continued his march into Nabataean territory.     The account of the campaign, written by Josephus, is subject to some debate; the historian wrote that Antiochus XIIs forces defeated those of Alexander Jannaeus, but the eighth-century historian ": null
    },
    {
        "George Syncellus": "george syncellus"
    },
    {
        " mentioned a defeat suffered by Antiochus XII at the hands of the Judaean king. The existence of the Yannai Line has been questioned by several historians, and Josephus explanation of Alexander Jannaeus attempt to stop the march of Antiochus XII, because of his fears of the latters intentions, is unsatisfactory. Both the Nabataeans and Syrians were enemies of Judea and it would have been to Alexander Jannaeus benefit if those two powers were in conflict. Syncellus may have been referring to an earlier confrontation between the Syrian king and Alexander Jannaeus. Thus the statement of Syncellus supports the notion that Antiochus XIIs second Nabataean campaign was also aimed at Judea; perhaps Antiochus XII sought to annex the coastal cities of Alexander Jannaeus as a retribution for the defeat mentioned by Syncellus. Another objective would be subduing the Judaeans to keep them from attacking Syria while Antiochus XII was busy in Nabataea.     The final engagement between the forces of Antiochus XII and the Nabataeans occurred near the village of ": null
    },
    {
        "Cana": "battle of cana"
    },
    {
        ", the location of which is unknown, but is generally assumed by modern scholars to be southwest of the ": null
    },
    {
        "Dead Sea": "dead sea"
    },
    {
        ". Historian Siegfried Mittmann considered it to be synonymous with Qina, modern-day ": null
    },
    {
        "Horvat Uza": "horvat uza"
    },
    {
        ", as mentioned by Josephus in Book 42 of his Antiquities. Details of the battle, as written by Josephus, spoke of the Nabataeans employing a ": null
    },
    {
        "feigned retreat": "feigned retreat"
    },
    {
        ", then counterattacking the Syrian forces before their ranks could be ordered. Antiochus XII managed to rally his troops and weathered the attack, but he fought in the front lines, jeopardizing his life, and he eventually fell. The year of Antiochus XIIs death is debated, but his last coins struck in Damascus are dated to 42 SE .          According to Josephus, the death of the King resulted in a rout of the Syrian forces, with many being killed in the field or during the retreat. Survivors of the rout sheltered in Cana, where most died of starvation. Antiochus XII was the last energetic Seleucid king. Little is recorded of Philip I after his attempt at annexing Damascus, which was left without a protector after the death of Antiochus XII. Fearing the ": null
    },
    {
        "Ituraean": "iturea"
    },
    {
        " ruler, ": null
    },
    {
        "Ptolemy": "ptolemy"
    },
    {
        " of ": null
    },
    {
        "Chalcis": "kingdom of chalcis"
    },
    {
        ", the people of Damascus invited ": null
    },
    {
        "Aretas III": "aretas iii"
    },
    {
        " of Nabataea to take the city. The numismatist Oliver D. Hoover suggested that Aretas III did not hold Damascus for long before the city returned to Seleucid possession.     The identity of Antiochus XIIs wife remains unknown, but according to the sixth-century historian ": null
    },
    {
        "John Malalas": "john malalas"
    },
    {
        ", whose work is considered generally unreliable by scholars, the King had two daughters, Cleopatra and Antiochis. Cleopatra Selene, who went into hiding after the death of Antiochus X in 42 SE , took advantage of Antiochus XIIs death and declared her son ": null
    },
    {
        "Antiochus XIII": "antiochus xiii asiaticus"
    },
    {
        " king with herself as queen regent and regnant. Coins struck during her regency show the marks of the Damascus mint. Archeologist Nicholas L. Wright suggested that Cleopatra Selenes takeover of Damascus took place after 42 BC. Josephus called Antiochus XII the last Seleucid king, and Malalas, according to the translation of the historian Glanville Downey, followed suit; the last Seleucid king was in fact Antiochus XIII, who was dethroned in 42 BC after Antioch was annexed by the ": null
    },
    {
        "Romans": "roman republic"
    },
    {
        ".                                         Citations:     ": null
    }
]