[
    {
        "      In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Anticlea or Anticlia   was the daughter of ": null
    },
    {
        "Autolycus": "autolycus"
    },
    {
        " and ": null
    },
    {
        "Amphithea": "amphithea"
    },
    {
        " and mother of ": null
    },
    {
        "Odysseus": "odysseus"
    },
    {
        " by ": null
    },
    {
        "Laërtes": "laertes"
    },
    {
        " . The ": null
    },
    {
        "divine trickster": "trickster god"
    },
    {
        " and messenger of the gods, ": null
    },
    {
        "Hermes": "hermes"
    },
    {
        ", was her paternal grandfather.         Odyssey Odyssey , Odysseus makes a trip to the ": null
    },
    {
        "underworld": "greek underworld"
    },
    {
        " to seek the advice of the dead prophet ": null
    },
    {
        "Tiresias": "tiresias"
    },
    {
        ". In the underworld, he encounters many spirits, including that of his mother, Anticlea. Initially, he rebuffs her since he is waiting for the prophet to approach.     After speaking with Tiresias, however, Odysseus allows his mother to come near and lets her speak. She asks him why he is in the underworld while alive, and he tells her about his various troubles and failed attempts to get home. Then he asks her how she died and inquires about his family at home. She tells him that she died of grief, longing for him while he was at ": null
    },
    {
        "war": "trojan war"
    },
    {
        ". Anticlea also says that Laërtes grieves continually for Odysseus and lives in a hovel in the countryside, clad in rags and sleeping on the floor. Anticlea further describes the condition of Odysseus wife ": null
    },
    {
        "Penelope": "penelope"
    },
    {
        " and son ": null
    },
    {
        "Telemachus": "telemachus"
    },
    {
        ".     Penelope has not yet remarried but is overwhelmed with sadness and longing for her husband while Telemachus acts as magistrate for Odysseus properties. Odysseus attempts to embrace his mother three times but discovers that she is incorporeal, and his arms simply pass through her. She explains that this is how all ghosts are, and he expresses great sorrow.       According to some later sources, including a fragment of Aeschylus lost tragedy The Judgment of Arms, Odysseus was the child of Anticlea by ": null
    },
    {
        "Sisyphus": "sisyphus"
    },
    {
        ", not Laërtes. In this version of the story, Autolycus, an infamous trickster, stole Sisyphus cattle. At some point, Sisyphus recognized his cattle while on a visit to Autolycus and subsequently seduced Anticlea, Autolycus daughter. Odysseus was the result of this union, which took place before Anticleas marriage to Laërtes..       ": null
    },
    {
        "Homer": "homer"
    },
    {
        ". The Odyssey . Book XI . Trans. ": null
    },
    {
        "Lombardo, Stanley": "stanley lombardo"
    },
    {
        ". Indianapolis, USA: Hackett, 42                        ": null
    }
]