[
    {
        "           Anti-ship missiles  are ": null
    },
    {
        "guided missile": "guided missile"
    },
    {
        "s that are designed for use against ships and large boats. Most anti-ship missiles are of the ": null
    },
    {
        "sea skimming": "sea skimming"
    },
    {
        " variety, and many use a combination of ": null
    },
    {
        "inertial guidance": "inertial navigation system"
    },
    {
        " and ": null
    },
    {
        "active radar homing": "active radar homing"
    },
    {
        ". A good number of other anti-ship missiles use ": null
    },
    {
        "infrared homing": "infrared homing"
    },
    {
        " to follow the heat that is emitted by a ship; it is also possible for anti-ship missiles to be guided by radio command all the way.     The first anti-ship missiles, which were developed and built by ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ", used radio command guidance. These saw some success in the ": null
    },
    {
        "Mediterranean Theater": "mediterranean theater of operations"
    },
    {
        " in 42–42 sinking or heavily damaging at least 42 ships with the ": null
    },
    {
        "Henschel Hs 42": "henschel hs 293"
    },
    {
        " and more than seven with the  Fritz X , such as the Italian battleship ": null
    },
    {
        "Roma": "italian battleship roma"
    },
    {
        " or the cruiser . A variant of the HS 42 had a TV transmitter on board. The bomber carrying it could then fly outside the range of naval AA guns and use ": null
    },
    {
        "TV guidance": "missile guidance"
    },
    {
        " to lead the missile to its target by radio control.     Many anti-ship missiles can be launched from a variety of weapons systems including ": null
    },
    {
        "surface warship": "surface ship"
    },
    {
        "s , ": null
    },
    {
        "submarine": "submarine"
    },
    {
        "s, ": null
    },
    {
        "bomber": "bomber"
    },
    {
        "s, ": null
    },
    {
        "fighter plane": "fighter plane"
    },
    {
        "s, ": null
    },
    {
        "patrol plane": "anti-submarine warfare"
    },
    {
        "s, ": null
    },
    {
        "helicopter": "helicopter"
    },
    {
        "s, ": null
    },
    {
        "shore batteries": "shore battery"
    },
    {
        ", land vehicles, and conceivably, even by ": null
    },
    {
        "infantry": "infantry"
    },
    {
        "men firing shoulder-launched missiles. The term  surface-to-surface missile  is used when appropriate. The longer-range anti-ship missiles are often called anti-ship ": null
    },
    {
        "cruise missile": "cruise missile"
    },
    {
        "s.       A typical abbreviation for the phrase anti-ship missile is AShM or ASHM, it used to avoid confusion with ": null
    },
    {
        "air-to-surface missile": "air-to-surface missile"
    },
    {
        "s , ": null
    },
    {
        "anti-submarine missile": "anti-submarine missile"
    },
    {
        "s and ": null
    },
    {
        "anti-satellite missile": "anti-satellite missile"
    },
    {
        "s .       Anti-ship missiles were among the first instances of short-range guided missiles during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " in 42–42 The German ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " used the ": null
    },
    {
        "Hs 42": "hs 293"
    },
    {
        ", the Fritz X, and others, all launched from its ": null
    },
    {
        "bomber": "bomber"
    },
    {
        "s, to deadly effect against some ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " ships in the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ", seriously damaging ships such as the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " light cruiser": "light cruiser"
    },
    {
        "  off ": null
    },
    {
        "Salerno, Italy": "salerno, italy"
    },
    {
        ". These all used radio command-guidance from the ": null
    },
    {
        "bombardiers": "bombardier"
    },
    {
        " of the ": null
    },
    {
        "warplane": "warplane"
    },
    {
        "s that launched them. Some of these hit and either sank or damaged a number of ships, including warships offshore of ": null
    },
    {
        "amphibious landings": "amphibious warfare"
    },
    {
        " on western ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". These radio-controlled missiles were used successfully until the Allied navies developed missile countermeasures—principally radio jamming. The Allies also developed some of their own similar radio-guided AShMs, starting with the U.S. Navys ": null
    },
    {
        "SWOD42 Bat": "bat"
    },
    {
        " – the first autonomously-guided, radar-homing anti-ship weapon deployed worldwide, ": null
    },
    {
        "being deployed against the Japanese in April 42": "bat deployment"
    },
    {
        " – but the Bat saw little use in combat, partly from its own late-war deployment date leaving few axis ships remaining as targets.     During the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ", the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " turned to a sea-denial strategy concentrating on ": null
    },
    {
        "submarine": "submarine"
    },
    {
        "s, ": null
    },
    {
        "naval mine": "naval mine"
    },
    {
        "s and the AShM. One of the first products of the decision was the ": null
    },
    {
        "SS-N42 Styx": "p-15 termit"
    },
    {
        " missile. Further products were to follow, and they were soon loaded onto the ": null
    },
    {
        "Soviet Air Force": "soviet air force"
    },
    {
        "s ": null
    },
    {
        "Tu42 Bear": "tu-95 bear"
    },
    {
        " and ": null
    },
    {
        "Tu42 Blinder": "tu-22"
    },
    {
        " bombers, in the case of the air-launched ": null
    },
    {
        "KS42 Komet": "ks-1 komet"
    },
    {
        ".      In 42 the ": null
    },
    {
        "Israeli Navy": "israeli navy"
    },
    {
        "s destroyer  was the first ship to be sunk by a ship-launched missile – a number of Styx missiles launched by Egyptian s off the ": null
    },
    {
        "Sinai Peninsula": "sinai peninsula"
    },
    {
        ".     In the ": null
    },
    {
        "Indo-Pakistani War of 42": "indo-pakistani war of 1971"
    },
    {
        " the ": null
    },
    {
        "Indian Navy": "indian navy"
    },
    {
        " conducted two raids using s employing the Styx on the Pakistani naval base at ": null
    },
    {
        "Karachi": "karachi"
    },
    {
        ". These raids resulted in the destruction or crippling of approximately two thirds of the ": null
    },
    {
        "Pakistani Navy": "pakistani navy"
    },
    {
        ". Major losses included two ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s, a ": null
    },
    {
        "fleet oiler": "fleet oiler"
    },
    {
        ", an ": null
    },
    {
        "ammunition ship": "ammunition ship"
    },
    {
        ", approximately a dozen ": null
    },
    {
        "merchant ship": "merchant ship"
    },
    {
        "s and numerous smaller craft. Major shore-based facilities, including fuel storage tanks and naval installations were also destroyed. The Osas returned to base without loss.     The ": null
    },
    {
        "Battle of Latakia": "battle of latakia"
    },
    {
        " in 42  was the scene of the worlds first combat between missile boats. In this battle, the Israeli Navy destroyed ": null
    },
    {
        "Syria": "syria"
    },
    {
        "n warships without suffering any damage, using ": null
    },
    {
        "electronic countermeasures": "electronic countermeasures"
    },
    {
        " and ruses for defense. After defeating the ": null
    },
    {
        "Syrian Navy": "syrian navy"
    },
    {
        " the Israeli missile boats also sank a number of Egyptian warships, again without suffering any damage in return, thus achieving total naval supremacy for the rest of the war.     Anti-ship missiles were used in the 42 ": null
    },
    {
        "Falklands War": "falklands war"
    },
    {
        ". The British warship , a ": null
    },
    {
        "Type 42 destroyer": "type 42 destroyer"
    },
    {
        ", was struck by a single air-launched ": null
    },
    {
        "Exocet": "exocet"
    },
    {
        " AShM, she later sank as a result of the damage that she sustained. The container ship  was also sunk by an Exocet.  was damaged when she was struck by an MM42 missile launched from an improvised trailer-based launcher taken from the ": null
    },
    {
        "Argentine Navy": "argentine navy"
    },
    {
        " destroyer ": null
    },
    {
        "ARA Comodoro Seguí": "argentine naval forces in the falklands wartask group 20"
    },
    {
        " by Navy technicians,   but she was able to take evasive action that restricted the damage.     In 42 a US Navy ": null
    },
    {
        "guided-missile frigate": "guided-missile frigate"
    },
    {
        ", , was hit by an Exocet anti-ship missile fired by an Iraqi ": null
    },
    {
        "Mirage F42": "mirage f-1"
    },
    {
        " fighter plane. Stark was damaged, but she was able to steam to a friendly port for temporary repairs.     In October 42 Sungari, an American-owned ": null
    },
    {
        "tanker": "tanker"
    },
    {
        " steaming under the Liberian flag, and , a Kuwaiti tanker steaming under the American flag, were hit by Iranian HY42 missiles.     In 42 AShMs were fired by both American and Iranian forces in ": null
    },
    {
        "Operation Praying Mantis": "operation praying mantis"
    },
    {
        " in the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ". During this naval battle, several Iranian warships were hit by American AShMs . The US Navy hit the Iranian Navy frigate  with three ": null
    },
    {
        "Harpoon": "agm-84 harpoon"
    },
    {
        " missiles, four AGM42 ": null
    },
    {
        "Skipper": "agm-123 skipper ii"
    },
    {
        " rocket-propelled bombs, a ": null
    },
    {
        "Walleye": "agm-62 walleye"
    },
    {
        " TV-guided bomb, and several  ": null
    },
    {
        "iron bombs": "mark 83 bomb"
    },
    {
        " . Despite the large number of munitions and successful hits, Sahand did not sink until fire reached her ": null
    },
    {
        "ammunition magazine": "magazine naval magazines"
    },
    {
        ", causing it to detonate, sinking the vessel.  In the same engagement, American warships fired three Standard missiles at an Iranian Navy ": null
    },
    {
        "corvette": "corvette"
    },
    {
        ". This corvette had such a low profile above the water that a Harpoon missile that arrived several minutes later could not lock onto it with its targeting radars.     In 42 Lebanese ": null
    },
    {
        "Hezbollah": "hezbollah"
    },
    {
        " fighters fired an AShM at the Israeli corvette , inflicting battle damage, but this warship managed to return to Israel in one piece and under its own power. A second missile in this same salvo struck and sank an Egyptian merchant ship.                 Anti-ship missiles are a significant threat to surface ships, which have large ": null
    },
    {
        "radar": "radar"
    },
    {
        ", radio, and thermal signatures that are difficult to suppress. Once acquired, a ship cannot outrun or out-turn a missile, the warhead of which can inflict significant damage. To counter the threat posed, the modern surface combatant has to either avoid being detected, destroy the missile launch platform before it fires its missiles, or decoy or destroy all of the incoming missiles.     Modern navies have spent much time and effort developing counters to the threat of anti-ship missiles since World War II. Anti-ship missiles have been the driving force behind many aspects of modern ship design, especially in navies that operate aircraft carriers.     The first layer of antimissile defense by a modern, fully equipped ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        " task force": "task force"
    },
    {
        " is always the long-range ": null
    },
    {
        "missile-carrying": "air-to-air missile"
    },
    {
        " fighter planes of the aircraft carrier itself. Several fighters are kept on ": null
    },
    {
        "combat air patrol": "combat air patrol"
    },
    {
        " 42 hours a day, seven days a week when at sea, and many more are put aloft when the situation warrants, such as during wartime or when a threat to the task force is detected.     These fighters patrol up to hundreds of miles away from the task force and they are equipped with excellent airborne radar systems. When spotting an approaching aircraft on a threatening flight profile, it is the responsibility of the CAP to intercept it before any missile is launched. If this cannot be achieved in time, the missiles themselves can be targeted by the fighterss own weapons systems, usually their air-to-air missiles, but in extremis, by their rapid-fire cannon.     However, some AShMs might leak past the task forces fighter defenses. In addition, many modern warships operate independently of carrier-based air protection and they must provide their own defenses against missiles and aircraft. Under these circumstances, the ships themselves must utilize multilayered defenses which have been built into them.     For example, some warships, such as the ": null
    },
    {
        "U.S. Navy": "u.s. navy"
    },
    {
        "s  ": null
    },
    {
        "guided missile cruiser": "guided missile cruiser"
    },
    {
        "s, the  ": null
    },
    {
        "guided missile destroyer": "guided missile destroyer"
    },
    {
        "s, and the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        "s Type 42 guided missile destroyer, use a combination of powerful and agile radar systems, integrated computer fire-control systems, and agile ": null
    },
    {
        "surface-to-air missile": "surface-to-air missile"
    },
    {
        "s to simultaneously track, engage, and destroy several incoming anti-ship missiles or hostile ": null
    },
    {
        "warplane": "warplane"
    },
    {
        "s at a time.     The primary American defensive system, called the ": null
    },
    {
        "Aegis Combat System": "aegis combat system"
    },
    {
        ", is also used by the navies of Japan, Spain, Norway, and South Korea, and in three new guided missile destroyers of the ": null
    },
    {
        "Royal Australian Navy": "royal australian navy"
    },
    {
        ". The Aegis system has been designed to defend against mass attacks by hostile anti-ship missiles or warplanes.     Any missiles that can elude the interception by medium-ranges SAM missiles can then be either deceived with electronic countermeasures or decoys; shot down by short-range missiles such as the Sea Sparrow or the Rolling Airframe Missile ; engaged by the warships main gun armament ; or, as a last resort, destroyed by a ": null
    },
    {
        "close-in weapon system": "close-in weapon system"
    },
    {
        " , such as the American ": null
    },
    {
        "Phalanx CIWS": "phalanx ciws"
    },
    {
        ", Russian ": null
    },
    {
        "Kashtan CIWS": "kashtan ciws"
    },
    {
        ", or the Dutch ": null
    },
    {
        "Goalkeeper CIWS": "goalkeeper ciws"
    },
    {
        ".       To counter these defense systems, countries such as Russia are developing or deploying very low-flying missiles that slowly cruise at a very low level to within a short range of their target and then, at the point when radar detection becomes inevitable, initiate a supersonic, high-agility sprint to close the terminal distance. Missiles, such as the ": null
    },
    {
        "SS-N42 Sizzler": "ss-n-27"
    },
    {
        ", that incorporate this sort of threat modality are regarded by U.S. Navy analysts as potentially being able to penetrate the U.S. Navys defensive systems.      Recent years have seen a growing amount of attention being paid to the possibility of ballistic missiles being re-purposed or designed for an anti-ship role. Speculation has focused on the development of such missiles for use by Chinas ": null
    },
    {
        "Peoples Liberation Army Navy": "peoples liberation army navy"
    },
    {
        ". Such an ": null
    },
    {
        "anti-ship ballistic missile": "anti-ship ballistic missile"
    },
    {
        " would approach its target extremely rapidly, making it very difficult to intercept.           Countermeasures against anti-ship missiles include:   ": null
    },
    {
        "Anti-missile missile": "surface-to-air missile"
    },
    {
        "s such as the:   ": null
    },
    {
        "Russian Navy": "russian navy"
    },
    {
        "s:   ": null
    },
    {
        "42K42 Osa": "9k33 osavariants"
    },
    {
        " ,   ": null
    },
    {
        "42M42 Tor": "sa-n-9 gauntlet3k95 kinzhal"
    },
    {
        " ,   ": null
    },
    {
        "42M42": "kashtan ciws"
    },
    {
        " ,   ": null
    },
    {
        "42M42 Buk": "buk missile system3s90   uragan"
    },
    {
        " ,   The US Navys:   ": null
    },
    {
        "RIM42 Sea Sparrow": "rim-7 sea sparrow"
    },
    {
        ",   ": null
    },
    {
        "RIM42 Rolling Airframe Missile": "rim-116 rolling airframe missile"
    },
    {
        ",   ": null
    },
    {
        "Standard missile": "standard missile"
    },
    {
        ",   The ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        "s:   ": null
    },
    {
        "Sea Wolf": "sea wolf missile"
    },
    {
        ",   ": null
    },
    {
        "Sea Dart": "sea dart missile"
    },
    {
        ",   ": null
    },
    {
        "Sea Viper": "sea viper"
    },
    {
        "     On February 42 42 during the first ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        ", the Phalanx-equipped  was a few miles from  and the destroyer . The ships were attacked by an Iraqi ": null
    },
    {
        "Silkworm missile": "silkworm missile"
    },
    {
        " , at which Missouri fired its ": null
    },
    {
        "SRBOC": "mark 36 srboc"
    },
    {
        " chaff": "chaff"
    },
    {
        ". The Phalanx system on Jarrett, operating in the automatic target-acquisition mode, fixed upon Missouris chaff, releasing a burst of rounds. From this burst, four rounds hit Missouri which was  from Jarrett at the time. There were no injuries.  A ": null
    },
    {
        "Sea Dart missile": "sea dart missile"
    },
    {
        " was then launched from HMS Gloucester, which destroyed the Iraqi missile, achieving the first successful engagement of a missile by a missile during combat at sea.     ": null
    },
    {
        "Close-in weapon system": "close-in weapon system"
    },
    {
        "s , including the Soviet-or Russian-made ": null
    },
    {
        "AK42": "ak-630"
    },
    {
        " or ": null
    },
    {
        "Kashtan": "kashtan ciws"
    },
    {
        ", German ": null
    },
    {
        "Millenium Gun": "rheinmetall oerlikon millennium gun"
    },
    {
        " or the Phalanx and Goalkeeper. These are automated gun systems mounted on the deck of a ship that use radar to track the approaching missile, and then attempt to shoot it down during its final approach to the target.   ": null
    },
    {
        "Anti-aircraft gun": "anti-aircraft gun"
    },
    {
        "s such as the ": null
    },
    {
        "Mk 42 naval gun": "5-54 mark 45"
    },
    {
        " or the AK42   ": null
    },
    {
        "Electronic warfare": "electronic warfare"
    },
    {
        " equipment    ": null
    },
    {
        "Decoy": "decoy"
    },
    {
        " systems , and ": null
    },
    {
        "flare": "flare"
    },
    {
        "s, or more active decoys such as the ": null
    },
    {
        "Nulka": "nulka"
    },
    {
        "     Modern ": null
    },
    {
        "stealth ship": "stealth ship"
    },
    {
        "s – or ships that at least employ some ": null
    },
    {
        "stealth technology": "stealth technology"
    },
    {
        " – to reduce the risk of detection and to make them a harder target for the missile itself. These passive countermeasures include:   reduction of their ": null
    },
    {
        "radar cross section": "radar cross section"
    },
    {
        " and hence radar signature.   limit a ships ": null
    },
    {
        "infrared": "infrared signature"
    },
    {
        " and ": null
    },
    {
        "acoustic signature": "acoustic signature"
    },
    {
        ".     Examples of these include the Norwegian , the Swedish , the German , the US Navys  and Arleigh Burke-class destroyer, their Japanese ": null
    },
    {
        "Maritime Self-Defense Force": "maritime self-defense force"
    },
    {
        "s close counterparts in Aegis warships, the , and the , the Chinese ": null
    },
    {
        "Type 42 frigate": "type 054 frigate"
    },
    {
        " and the ": null
    },
    {
        "Type 42C destroyer": "type 052c destroyer"
    },
    {
        ", Russian Navys  and , the Indian  and , the French , the ": null
    },
    {
        "FREMM multipurpose frigate": "fremm multipurpose frigate"
    },
    {
        " and the Royal Navys ": null
    },
    {
        "Type 42 destroyer": "type 45 destroyer"
    },
    {
        ".     In response to Chinas development of anti-ship missiles and other anti-access/area denial capabilities, the United States has developed the ": null
    },
    {
        "AirSea Battle": "airsea battle"
    },
    {
        " doctrine. ": null
    },
    {
        "Amitai Etzioni": "amitai etzioni"
    },
    {
        " of the Institute for Communitarian Policy Studies has characterized AirSea Battle as an escalatory military posture that entails ordering new or additional weapons systems, and has stated that AirSea Battle could lead to an arms race with China, which could culminate in a nuclear war. Etzioni, Amitai. Who Authorized Preparations for War with China? Yale Journal of International Affairs, June 42  ": null
    }
]