[
    {
        "           Antioxidants are ": null
    },
    {
        "compounds": "Chemical Compound"
    },
    {
        " that inhibit ": null
    },
    {
        "oxidation": "Redox"
    },
    {
        ". ": null
    },
    {
        "Oxidation": "Oxidation"
    },
    {
        " is a ": null
    },
    {
        "chemical reaction": "Chemical Reaction"
    },
    {
        " that can produce ": null
    },
    {
        "free radicals": "Radical"
    },
    {
        ", thereby leading to ": null
    },
    {
        "chain reactions": "Chain Reaction"
    },
    {
        "that may damage the ": null
    },
    {
        "cells": "Cell"
    },
    {
        " of organisms. Antioxidants such as ": null
    },
    {
        "thiols": "Thiol"
    },
    {
        "or ": null
    },
    {
        "ascorbic acid": "Ascorbic Acid"
    },
    {
        " terminate these chain reactions. To balance the ": null
    },
    {
        "oxidative stress": "Oxidative Stress"
    },
    {
        ", plants and animals maintain complex systems of overlapping antioxidants, such as ": null
    },
    {
        "glutathione": "Glutathione"
    },
    {
        " and ": null
    },
    {
        "enzymes": "Enzyme"
    },
    {
        " , produced internally, or the ": null
    },
    {
        "dietary": "Dietary"
    },
    {
        " antioxidants vitamin C and ": null
    },
    {
        "vitamin E": "Vitamin E"
    },
    {
        ".     The term antioxidant is mostly used for two entirely different groups of substances: ": null
    },
    {
        "industrial chemicals": "Industrial Chemicals"
    },
    {
        " that are added to products to prevent oxidation, and naturally occurring compounds that are present in foods and ": null
    },
    {
        "tissue": "Tissue"
    },
    {
        ". The former, industrial antioxidants, have diverse uses: acting as ": null
    },
    {
        "preservatives": "Preservative"
    },
    {
        "in food and cosmetics, and being ": null
    },
    {
        "oxidation": "Redox"
    },
    {
        "-inhibitors in fuels.      Antioxidant ": null
    },
    {
        "dietary supplements": "Dietary Supplement"
    },
    {
        "have not been shown to improve health in humans, or to be effective at preventing disease.  Supplements of ": null
    },
    {
        "beta-carotene": "Beta-Carotene"
    },
    {
        ", ": null
    },
    {
        "vitamin A": "Vitamin A"
    },
    {
        ", and vitamin E have no positive effect on ": null
    },
    {
        "mortality rate": "Mortality Rate"
    },
    {
        "   or ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        " risk.   Additionally, supplementation with ": null
    },
    {
        "selenium": "Selenium"
    },
    {
        " or vitamin E does not reduce the risk of ": null
    },
    {
        "cardiovascular disease": "Cardiovascular Disease"
    },
    {
        ".               Although certain levels of antioxidant ": null
    },
    {
        "vitamins": "Vitamins"
    },
    {
        " in the diet are required for good health, there is still considerable debate on whether antioxidant-rich foods or supplements have anti-disease activity. Moreover, if they are actually beneficial, it is unknown which antioxidants are health-promoting in the diet and in what amounts beyond typical dietary intake.   Some authors dispute the hypothesis that antioxidant vitamins could prevent chronic diseases,  http://www.dietandcancerreport.org/?pER Food, Nutrition, Physical Activity, and the Prevention of Cancer: a Global Perspective. ": null
    },
    {
        "World Cancer Research Fund": "World Cancer Research Fund"
    },
    {
        " . . and others declare that the hypothesis is unproven and misguided.  ": null
    },
    {
        "Polyphenol": "Polyphenol"
    },
    {
        "s, which have antioxidant properties ": null
    },
    {
        "in vitro": "In Vitro"
    },
    {
        ", have unknown antioxidant activity ": null
    },
    {
        "in vivo": "In Vivo"
    },
    {
        " due to extensive ": null
    },
    {
        "metabolism": "Metabolism"
    },
    {
        " following digestion and little ": null
    },
    {
        "clinical evidence": "Clinical Research"
    },
    {
        " of efficacy.          Common pharmaceuticals with antioxidant properties may interfere with the efficacy of certain ": null
    },
    {
        "anticancer": "Anticancer"
    },
    {
        " medication and radiation.  A 2016 ": null
    },
    {
        "systematic review": "Systematic Review"
    },
    {
        " examined ": null
    },
    {
        "allopurinol": "Allopurinol"
    },
    {
        " and ": null
    },
    {
        "acetylcysteine": "Acetylcysteine"
    },
    {
        " as possible add-on treatments for ": null
    },
    {
        "schizophrenia": "Schizophrenia"
    },
    {
        ".  ": null
    },
    {
        "Tirilazad": "Tirilazad"
    },
    {
        ", a steroid derivative that inhibits lipid peroxidation, was shown in human trials to have no effect on mortality or other outcomes in ": null
    },
    {
        "subarachnoid haemorrhage": "Subarachnoid Haemorrhage"
    },
    {
        "  and worsened results in ischemic stroke.                Relatively strong reducing acids can have ": null
    },
    {
        "antinutrient": "Antinutrient"
    },
    {
        " effects by binding to ": null
    },
    {
        "dietary minerals": "Dietary Mineral"
    },
    {
        "such as ": null
    },
    {
        "iron": "Iron"
    },
    {
        " and ": null
    },
    {
        "zinc": "Zinc"
    },
    {
        " in the ": null
    },
    {
        "gastrointestinal tract": "Human Gastrointestinal Tract"
    },
    {
        " and preventing them from being absorbed.  Examples are ": null
    },
    {
        "oxalic acid": "Oxalic Acid"
    },
    {
        ", ": null
    },
    {
        "tannins": "Tannin"
    },
    {
        "and ": null
    },
    {
        "phytic acid": "Phytic Acid"
    },
    {
        ", which are high in plant-based diets.  ": null
    },
    {
        "Calcium": "Calcium"
    },
    {
        " and iron deficiencies are not uncommon in diets in ": null
    },
    {
        "developing countries": "Developing Country"
    },
    {
        " where less meat is eaten and there is high consumption of phytic acid from beans and unleavened ": null
    },
    {
        "whole grain": "Whole Grain"
    },
    {
        " bread.           High doses of some antioxidants may have harmful long-term effects. The beta-Carotene and Retinol Efficacy Trial study of lung cancer patients found that smokers given supplements containing beta-carotene and vitamin A had increased rates of lung cancer.  Subsequent studies confirmed these adverse effects.  These harmful effects may also be seen in non-smokers, as one ": null
    },
    {
        "meta-analysis": "Meta-Analysis"
    },
    {
        " including data from approximately 230,000 patients showed that β-carotene, vitamin A or vitamin E supplementation is associated with increased mortality, but saw no significant effect from vitamin C.  No health risk was seen when all the randomized controlled studies were examined together, but an increase in mortality was detected when only high-quality and low-bias risk trials were examined separately. As the majority of these low-bias trials dealt with either ": null
    },
    {
        "elderly people": "Old Age"
    },
    {
        ", or people with disease, these results may not apply to the general population.  News release from ": null
    },
    {
        "Oregon State University": "Oregon State University"
    },
    {
        " published on ScienceDaily. Retrieved 19 April 2007 This meta-analysis was later repeated and extended by the same authors, confirming the previous results.  These two publications are consistent with some previous meta-analyses that also suggested that vitamin E supplementation increased mortality,  and that antioxidant supplements increased the risk of ": null
    },
    {
        "colon cancer": "Colorectal Cancer"
    },
    {
        ".  ": null
    },
    {
        "Beta-carotene": "Beta-Carotene"
    },
    {
        " may also increase lung cancer.  Overall, the large number of clinical trials carried out on antioxidant supplements suggest that either these products have no effect on health, or that they cause a small increase in mortality in elderly or vulnerable populations.                 A ": null
    },
    {
        "paradox": "Paradox"
    },
    {
        " in ": null
    },
    {
        "metabolism": "Metabolism"
    },
    {
        " is that, while the vast majority of complex ": null
    },
    {
        "life on Earth": "Life"
    },
    {
        " requires ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        " for its existence, oxygen is a highly reactive molecule that damages living organisms by producing ": null
    },
    {
        "reactive oxygen species": "Reactive Oxygen Species"
    },
    {
        ".  Consequently, organisms contain a complex network of antioxidant ": null
    },
    {
        "metabolites": "Metabolite"
    },
    {
        "and ": null
    },
    {
        "enzymes": "Enzyme"
    },
    {
        "that work together to prevent oxidative damage to cellular components such as ": null
    },
    {
        "DNA": "Dna"
    },
    {
        ", ": null
    },
    {
        "proteins": "Protein"
    },
    {
        "and ": null
    },
    {
        "lipid": "Lipid"
    },
    {
        "s.   In general, antioxidant systems either prevent these reactive species from being formed, or remove them before they can damage vital components of the cell. However, reactive oxygen species also have useful cellular functions, such as ": null
    },
    {
        "redox signaling": "Redox Signaling"
    },
    {
        ". Thus, the function of antioxidant systems is not to remove oxidants entirely, but instead to keep them at an optimum level.      The reactive oxygen species produced in cells include ": null
    },
    {
        "hydrogen peroxide": "Hydrogen Peroxide"
    },
    {
        " , ": null
    },
    {
        "hypochlorous acid": "Hypochlorous Acid"
    },
    {
        " , and ": null
    },
    {
        "free radicals": "Free Radical"
    },
    {
        "such as the ": null
    },
    {
        "hydroxyl radical": "Hydroxyl Radical"
    },
    {
        " and the ": null
    },
    {
        "superoxide anion": "Superoxide"
    },
    {
        " .  The hydroxyl radical is particularly unstable and will react rapidly and non-specifically with most biological molecules. This species is produced from hydrogen peroxide in ": null
    },
    {
        "metal-catalyzed": "Catalysis"
    },
    {
        " redox reactions such as the ": null
    },
    {
        "Fenton reaction": "Fenton Reaction"
    },
    {
        ".  These oxidants can damage cells by starting chemical chain reactions such as ": null
    },
    {
        "lipid peroxidation": "Lipid Peroxidation"
    },
    {
        ", or by oxidizing DNA or proteins. Damage to DNA can cause ": null
    },
    {
        "mutations": "Mutation"
    },
    {
        "and possibly cancer, if not reversed by ": null
    },
    {
        "DNA repair": "Dna Repair"
    },
    {
        " mechanisms,   while damage to ": null
    },
    {
        "proteins": "Protein"
    },
    {
        "causes enzyme inhibition, ": null
    },
    {
        "denaturation": "Denaturation"
    },
    {
        " and ": null
    },
    {
        "protein degradation": "Proteasome"
    },
    {
        ".      The use of oxygen as part of the process for generating metabolic energy produces reactive oxygen species.  In this process, the superoxide anion is produced as a ": null
    },
    {
        "by-product": "By-Product"
    },
    {
        " of several steps in the ": null
    },
    {
        "electron transport chain": "Electron Transport Chain"
    },
    {
        ".  Particularly important is the reduction of ": null
    },
    {
        "coenzyme Q": "Coenzyme Q"
    },
    {
        " in ": null
    },
    {
        "complex III": "Complex Iii"
    },
    {
        ", since a highly reactive free radical is formed as an intermediate . This unstable intermediate can lead to electron leakage , when electrons jump directly to oxygen and form the superoxide anion, instead of moving through the normal series of well-controlled reactions of the electron transport chain.  Peroxide is also produced from the oxidation of reduced ": null
    },
    {
        "flavoprotein": "Flavoprotein"
    },
    {
        "s, such as ": null
    },
    {
        "complex I": "Complex I"
    },
    {
        ".  However, although these enzymes can produce oxidants, the relative importance of the electron transfer chain to other processes that generate peroxide is unclear.   In plants, ": null
    },
    {
        "algae": "Algae"
    },
    {
        ", and ": null
    },
    {
        "cyanobacteria": "Cyanobacteria"
    },
    {
        ", reactive oxygen species are also produced during ": null
    },
    {
        "photosynthesis": "Photosynthesis"
    },
    {
        ",  particularly under conditions of high ": null
    },
    {
        "light intensity": "Irradiance"
    },
    {
        ".  This effect is partly offset by the involvement of ": null
    },
    {
        "carotenoids": "Carotenoid"
    },
    {
        "in ": null
    },
    {
        "photoinhibition": "Photoinhibition"
    },
    {
        ", and in algae and cyanobacteria, by large amount of ": null
    },
    {
        "iodide": "Iodide"
    },
    {
        " and ": null
    },
    {
        "selenium": "Selenium"
    },
    {
        ",  which involves these antioxidants reacting with over-reduced forms of the ": null
    },
    {
        "photosynthetic reaction centres": "Photosynthetic Reaction Centre"
    },
    {
        "to prevent the production of reactive oxygen species.         Antioxidants are classified into two broad divisions, depending on whether they are soluble in water  or in lipids . In general, water-soluble antioxidants react with oxidants in the cell ": null
    },
    {
        "cytosol": "Cytosol"
    },
    {
        " and the ": null
    },
    {
        "blood plasma": "Blood Plasma"
    },
    {
        ", while lipid-soluble antioxidants protect ": null
    },
    {
        "cell membranes": "Cell Membrane"
    },
    {
        "from lipid peroxidation. These compounds may be synthesized in the body or obtained from the diet. The different antioxidants are present at a wide range of concentrations in ": null
    },
    {
        "body fluids": "Bodily Fluid"
    },
    {
        " and tissues, with some such as glutathione or ": null
    },
    {
        "ubiquinone": "Ubiquinone"
    },
    {
        " mostly present within cells, while others such as ": null
    },
    {
        "uric acid": "Uric Acid"
    },
    {
        " are more evenly distributed . Some antioxidants are only found in a few organisms and these compounds can be important in ": null
    },
    {
        "pathogens": "Pathogen"
    },
    {
        "and can be ": null
    },
    {
        "virulence factor": "Virulence Factor"
    },
    {
        "s.      The relative importance and interactions between these different antioxidants is a very complex question, with the various antioxidant compounds and antioxidant enzyme systems having ": null
    },
    {
        "synergistic": "Synergy"
    },
    {
        " and interdependent effects on one another.   The action of one antioxidant may therefore depend on the proper function of other members of the antioxidant system. The amount of protection provided by any one antioxidant will also depend on its concentration, its reactivity towards the particular reactive oxygen species being considered, and the status of the antioxidants with which it interacts.     Some compounds contribute to antioxidant defense by ": null
    },
    {
        "chelating": "Chelation"
    },
    {
        "transition metals": "Transition Metal"
    },
    {
        "and preventing them from catalyzing the production of free radicals in the cell. Particularly important is the ability to sequester iron, which is the function of ": null
    },
    {
        "iron-binding proteins": "Iron-Binding Proteins"
    },
    {
        " such as ": null
    },
    {
        "transferrin": "Transferrin"
    },
    {
        " and ": null
    },
    {
        "ferritin": "Ferritin"
    },
    {
        ". ": null
    },
    {
        "Selenium": "Selenium"
    },
    {
        " and zinc are commonly referred to as antioxidant nutrients, but these ": null
    },
    {
        "chemical elements": "Chemical Element"
    },
    {
        "have no antioxidant action themselves and are instead required for the activity of some antioxidant enzymes, as is discussed below.            Uric acid is by far the highest concentration antioxidant in human blood. Uric acid is an antioxidant oxypurine produced from ": null
    },
    {
        "xanthine": "Xanthine"
    },
    {
        " by the enzyme ": null
    },
    {
        "xanthine oxidase": "Xanthine Oxidase"
    },
    {
        ", and is an intermediate product of ": null
    },
    {
        "purine": "Purine"
    },
    {
        " metabolism.  In almost all land animals, ": null
    },
    {
        "urate oxidase": "Urate Oxidase"
    },
    {
        " further catalyzes the oxidation of uric acid to ": null
    },
    {
        "allantoin": "Allantoin"
    },
    {
        ",  but in humans and most higher primates, the urate oxidase gene is nonfunctional, so that UA is not further broken down.  The evolutionary reasons for this loss of urate conversion to allantoin remain the topic of active speculation.   The antioxidant effects of uric acid have led researchers to suggest this mutation was beneficial to early primates and humans.  Studies of high altitude acclimatization support the hypothesis that urate acts as an antioxidant by mitigating the oxidative stress caused by high-altitude hypoxia.      Uric acid has the highest concentration of any blood antioxidant and provides over half of the total antioxidant capacity of human serum.  Uric acids antioxidant activities are also complex, given that it does not react with some oxidants, such as ": null
    },
    {
        "superoxide": "Superoxide"
    },
    {
        ", but does act against ": null
    },
    {
        "peroxynitrite": "Peroxynitrite"
    },
    {
        ",  ": null
    },
    {
        "peroxide": "Peroxide"
    },
    {
        "s, and ": null
    },
    {
        "hypochlorous acid": "Hypochlorous Acid"
    },
    {
        ". Concerns over elevated UAs contribution to ": null
    },
    {
        "gout": "Gout"
    },
    {
        " must be considered as one of many risk factors.  By itself, UA-related risk of gout at high levels is only 0.5% per year with an increase to 4.5% per year at UA ": null
    },
    {
        "supersaturation levels": "Supersaturation"
    },
    {
        " .  Many of these aforementioned studies determined UAs antioxidant actions within normal physiological levels, and some found antioxidant activity at levels as high as 285 μmol/L.        ": null
    },
    {
        "Ascorbic acid": "Ascorbic Acid"
    },
    {
        " or ": null
    },
    {
        "vitamin C": "Vitamin C"
    },
    {
        " is a ": null
    },
    {
        "monosaccharide": "Monosaccharide"
    },
    {
        " oxidation-reduction  ": null
    },
    {
        "catalyst": "Catalyst"
    },
    {
        " found in both animals and plants.  As one of the enzymes needed to make ascorbic acid has been lost by ": null
    },
    {
        "mutation": "Mutation"
    },
    {
        " during ": null
    },
    {
        "primate": "Primate"
    },
    {
        " evolution": "Evolution"
    },
    {
        ", humans must obtain it from their diet; it is therefore a dietary vitamin.  Most other animals are able to produce this compound in their bodies and do not require it in their diets.  Ascorbic acid is required for the conversion of the ": null
    },
    {
        "procollagen": "Collagencollagen I Formation"
    },
    {
        " to ": null
    },
    {
        "collagen": "Collagen"
    },
    {
        " by oxidizing ": null
    },
    {
        "proline": "Proline"
    },
    {
        " residues to ": null
    },
    {
        "hydroxyproline": "Hydroxyproline"
    },
    {
        ". In other cells, it is maintained in its reduced form by reaction with glutathione, which can be catalysed by ": null
    },
    {
        "protein disulfide isomerase": "Protein Disulfide Isomerase"
    },
    {
        " and ": null
    },
    {
        "glutaredoxin": "Glutaredoxin"
    },
    {
        "s.   Ascorbic acid is a redox catalyst which can reduce, and thereby neutralize, reactive oxygen species such as hydrogen peroxide.  In addition to its direct antioxidant effects, ascorbic acid is also a ": null
    },
    {
        "substrate": "Substrate"
    },
    {
        " for the redox enzyme ": null
    },
    {
        "ascorbate peroxidase": "Ascorbate Peroxidase"
    },
    {
        ", a function that is used in stress resistance in plants.  Ascorbic acid is present at high levels in all parts of plants and can reach concentrations of 20  ": null
    },
    {
        "millimolar": "Millimolar"
    },
    {
        " in ": null
    },
    {
        "chloroplast": "Chloroplast"
    },
    {
        "s.             ": null
    },
    {
        "Glutathione": "Glutathione"
    },
    {
        " is a ": null
    },
    {
        "cysteine": "Cysteine"
    },
    {
        "-containing ": null
    },
    {
        "peptide": "Peptide"
    },
    {
        " found in most forms of aerobic life.  It is not required in the diet and is instead synthesized in cells from its constituent ": null
    },
    {
        "amino acid": "Amino Acid"
    },
    {
        "s.  Glutathione has antioxidant properties since the ": null
    },
    {
        "thiol": "Thiol"
    },
    {
        " group in its ": null
    },
    {
        "cysteine": "Cysteine"
    },
    {
        " moiety": "Wikt:Moiety"
    },
    {
        " is a reducing agent and can be reversibly oxidized and reduced. In cells, glutathione is maintained in the reduced form by the enzyme ": null
    },
    {
        "glutathione reductase": "Glutathione Reductase"
    },
    {
        " and in turn reduces other metabolites and enzyme systems, such as ascorbate in the ": null
    },
    {
        "glutathione-ascorbate cycle": "Glutathione-Ascorbate Cycle"
    },
    {
        ", ": null
    },
    {
        "glutathione peroxidases": "Glutathione Peroxidase"
    },
    {
        "and ": null
    },
    {
        "glutaredoxin": "Glutaredoxin"
    },
    {
        "s, as well as reacting directly with oxidants. Due to its high concentration and its central role in maintaining the cells redox state, glutathione is one of the most important cellular antioxidants. In some organisms glutathione is replaced by other thiols, such as by ": null
    },
    {
        "mycothiol": "Mycothiol"
    },
    {
        " in the ": null
    },
    {
        "Actinomycete": "Actinomycete"
    },
    {
        "s, ": null
    },
    {
        "bacillithiol": "Bacillithiol"
    },
    {
        " in some ": null
    },
    {
        "Gram-positive bacteria": "Gram-Positive Bacteria"
    },
    {
        ",   or by ": null
    },
    {
        "trypanothione": "Trypanothione"
    },
    {
        " in the ": null
    },
    {
        "Kinetoplastids": "Kinetoplastida"
    },
    {
        ".         ": null
    },
    {
        "Vitamin E": "Vitamin E"
    },
    {
        " is the collective name for a set of eight related ": null
    },
    {
        "tocopherols": "Tocopherol"
    },
    {
        "and ": null
    },
    {
        "tocotrienol": "Tocotrienol"
    },
    {
        "s, which are ": null
    },
    {
        "fat-soluble": "Fat-Soluble"
    },
    {
        " vitamins with antioxidant properties.   Of these, α-tocopherol has been most studied as it has the highest ": null
    },
    {
        "bioavailability": "Bioavailability"
    },
    {
        ", with the body preferentially absorbing and metabolising this form.      It has been claimed that the α-tocopherol form is the most important lipid-soluble antioxidant, and that it protects membranes from oxidation by reacting with lipid radicals produced in the lipid peroxidation chain reaction.  This removes the free radical intermediates and prevents the propagation reaction from continuing. This reaction produces oxidised α-tocopheroxyl radicals that can be recycled back to the active reduced form through reduction by other antioxidants, such as ascorbate, retinol or ubiquinol.  This is in line with findings showing that α-tocopherol, but not water-soluble antioxidants, efficiently protects glutathione peroxidase 4 -deficient cells from cell death.  GPx4 is the only known enzyme that efficiently reduces lipid-hydroperoxides within biological membranes.     However, the roles and importance of the various forms of vitamin E are presently unclear,   and it has even been suggested that the most important function of α-tocopherol is as a ": null
    },
    {
        "signaling molecule": "Cell Signaling"
    },
    {
        ", with this molecule having no significant role in antioxidant metabolism.   The functions of the other forms of vitamin E are even less well understood, although γ-tocopherol is a ": null
    },
    {
        "nucleophile": "Nucleophile"
    },
    {
        " that may react with ": null
    },
    {
        "electrophilic": "Electrophile"
    },
    {
        " mutagens, and tocotrienols may be important in protecting ": null
    },
    {
        "neurons": "Neuron"
    },
    {
        "from damage.             Antioxidants that are reducing agents can also act as pro-oxidants. For example, vitamin C has antioxidant activity when it reduces oxidizing substances such as hydrogen peroxide;  however, it will also reduce metal ions that generate free radicals through the ": null
    },
    {
        "Fenton reaction": "Fentons Reagent"
    },
    {
        ".      : 2 Fe 3+ + Ascorbate → 2 Fe 2+ + Dehydroascorbate   :: 2 Fe 2+ + 2 H 2 O 2 → 2 Fe 3+ + 2 OH· + 2 OH −     The relative importance of the antioxidant and pro-oxidant activities of antioxidants is an area of current research, but vitamin C, which exerts its effects as a vitamin by oxidizing polypeptides, appears to have a mostly antioxidant action in the human body. However, less data is available for other dietary antioxidants, such as vitamin E,  or the ": null
    },
    {
        "polyphenols": "Polyphenol Antioxidant"
    },
    {
        ".   Likewise, the pathogenesis of diseases involving hyperuricemia likely involve uric acids direct and indirect pro-oxidant properties.     That is, paradoxically, agents which are normally considered antioxidants can act as conditional ": null
    },
    {
        "pro-oxidants": "Pro-Oxidant"
    },
    {
        "and actually increase oxidative stress. Besides ascorbate, medically important conditional pro-oxidants include uric acid and sulfhydryl amino acids such as ": null
    },
    {
        "homocysteine": "Homocysteine"
    },
    {
        ". Typically, this involves some transition-series metal such as copper or iron as catalyst. The potential role of the pro-oxidant role of uric acid in atherosclerosis and ischemic stroke is considered above. Another example is the postulated role of ": null
    },
    {
        "homocysteine": "Homocysteine"
    },
    {
        " in atherosclerosis.       ": null
    }
]