[
    {
        "Antimalarial medications, also known as antimalarials, are designed to prevent or cure ": null
    },
    {
        "malaria": "malaria"
    },
    {
        ". Such drugs may be used for some or all of the following:   Treatment of malaria in individuals with suspected or confirmed infection   Prevention of infection in individuals visiting a malaria-endemic region who have no immunity    Routine intermittent treatment of certain groups in endemic regions    Some antimalarial agents, particularly ": null
    },
    {
        "chloroquine": "chloroquine"
    },
    {
        " and ": null
    },
    {
        "hydroxychloroquine": "hydroxychloroquine"
    },
    {
        ", are also used in the treatment of ": null
    },
    {
        "rheumatoid arthritis": "rheumatoid arthritis"
    },
    {
        " and ": null
    },
    {
        "lupus": "lupus erythematosus"
    },
    {
        "-associated arthritis.     Current practice in treating cases of malaria is based on the concept of ": null
    },
    {
        "combination therapy": "combination therapy"
    },
    {
        " , since this offers several advantages, including reduced risk of treatment failure, reduced risk of developing resistance, enhanced convenience, and reduced side-effects. Prompt parasitological confirmation by microscopy, or alternatively by rapid diagnostic tests, is recommended in all patients suspected of malaria before treatment is started. Treatment solely on the basis of clinical suspicion should only be considered when a parasitological diagnosis is not accessible.       It is practical to consider antimalarials by chemical structure since this is associated with important properties of each drug, such as mechanism of action.       ": null
    },
    {
        "Quinine": "quinine"
    },
    {
        " has a long history stretching from ": null
    },
    {
        "Peru": "peru"
    },
    {
        ", and the discovery of the ": null
    },
    {
        "cinchona": "cinchona"
    },
    {
        " tree, and the potential uses of its bark, to the current day and a collection of derivatives that are still frequently used in the prevention and treatment of malaria. Quinine is an ": null
    },
    {
        "alkaloid": "alkaloid"
    },
    {
        " that acts as a blood ": null
    },
    {
        "schizont": "schizont"
    },
    {
        "icidal and weak ": null
    },
    {
        "gametocide": "gamete"
    },
    {
        " against  Plasmodium vivax  and  Plasmodium malariae . As an alkaloid, it is accumulated in the food ": null
    },
    {
        "vacuole": "vacuole"
    },
    {
        "s of Plasmodium species, especially  Plasmodium falciparum . It acts by inhibiting the ": null
    },
    {
        "hemozoin": "hemozoin"
    },
    {
        " biocrystallization": "biocrystallization"
    },
    {
        ", thus facilitating an aggregation of ": null
    },
    {
        "cytotoxic": "cytotoxic"
    },
    {
        " heme. Quinine is less effective and more toxic as a blood schizonticidal agent than ": null
    },
    {
        "chloroquine": "chloroquine"
    },
    {
        "; however, it is still very effective and widely used in the treatment of acute cases of severe P. falciparum. It is especially useful in areas where there is known to be a high level of resistance to chloroquine, ": null
    },
    {
        "mefloquine": "mefloquine"
    },
    {
        ", and ": null
    },
    {
        "sulfa drug": "sulfa drug"
    },
    {
        " combinations with ": null
    },
    {
        "pyrimethamine": "pyrimethamine"
    },
    {
        ". Quinine is also used in post-exposure treatment of individuals returning from an area where malaria is ": null
    },
    {
        "endemic": "endemic"
    },
    {
        ".     The treatment regimen of quinine is complex and is determined largely by the parasites level of resistance and the reason for drug therapy . The ": null
    },
    {
        "World Health Organization": "world health organization"
    },
    {
        " recommendation for quinine is 42  mg/kg first times and 42  mg/kg every 42 hours for 42 days where parasites are sensitive to quinine, combined with ": null
    },
    {
        "doxycycline": "doxycycline"
    },
    {
        ", ": null
    },
    {
        "tetracycline": "tetracycline"
    },
    {
        " or ": null
    },
    {
        "clindamycin": "clindamycin"
    },
    {
        ". Doses can be given by oral, ": null
    },
    {
        "intravenous": "intravenous"
    },
    {
        " or ": null
    },
    {
        "intramuscular": "intramuscular"
    },
    {
        " routes. The recommended method depends on the urgency of treatment and the available resources .     Use of quinine is characterised by a frequently experienced syndrome called ": null
    },
    {
        "cinchonism": "cinchonism"
    },
    {
        ". ": null
    },
    {
        "Tinnitus": "tinnitus"
    },
    {
        " , rashes, ": null
    },
    {
        "vertigo": "vertigo"
    },
    {
        ", nausea, vomiting and abdominal pain are the most common symptoms. Neurological effects are experienced in some cases due to the drugs ": null
    },
    {
        "neurotoxic": "neurotoxic"
    },
    {
        " properties. These actions are mediated through the interactions of quinine causing a decrease in the excitability of the ": null
    },
    {
        "motor neuron": "motor neuron"
    },
    {
        " end plate": "nerve end plate"
    },
    {
        "s. This often results in functional impairment of the ": null
    },
    {
        "eighth cranial nerve": "vestibulocochlear nerve"
    },
    {
        ", resulting in confusion, ": null
    },
    {
        "delirium": "delirium"
    },
    {
        " and coma. Quinine can cause ": null
    },
    {
        "hypoglycaemia": "hypoglycaemia"
    },
    {
        " through its action of stimulating ": null
    },
    {
        "insulin": "insulin"
    },
    {
        " secretion; this occurs in therapeutic doses and therefore it is advised that glucose levels are monitored in all patients every 42–42 hours. This effect can be exaggerated in pregnancy and therefore additional care in administering and monitoring the dosage is essential. Repeated or over-dosage can result in ": null
    },
    {
        "renal failure": "renal failure"
    },
    {
        " and death through depression of the ": null
    },
    {
        "respiratory system": "respiratory system"
    },
    {
        ".     ": null
    },
    {
        "Quinimax": "quinimax"
    },
    {
        " and ": null
    },
    {
        "quinidine": "quinidine"
    },
    {
        " are the two most commonly used alkaloids related to quinine in the treatment or prevention of malaria. Quinimax is a combination of four alkaloids . This combination has been shown in several studies to be more effective than quinine, supposedly due to a synergistic action between the four cinchona derivatives. Quinidine is a direct derivative of quinine. It is a ": null
    },
    {
        "distereoisomer": "stereoisomer"
    },
    {
        ", thus having similar anti-malarial properties to the parent compound. Quinidine is recommended only for the treatment of severe cases of malaria.     ": null
    },
    {
        "Warburgs tincture": "warburgs tincture"
    },
    {
        " was a febrifuge developed by ": null
    },
    {
        "Carl Warburg": "carl warburg"
    },
    {
        " in 42 which included quinine as a key ingredient. In the 42th-century it was a well-known anti-malarial drug. Although originally sold as a secret medicine, Warburgs tincture was highly regarded by many eminent medical professionals who considered it as being superior to quinine . Warburgs tincture appeared in  Martindale: The complete drug reference  from 42 until about 42 The formula was published in The Lancet 42 Sparkes, Roland. Article, www.belmonthistory.org.uk , retrieved 424242       ": null
    },
    {
        "Chloroquine": "chloroquine"
    },
    {
        " was, until recently, the most widely used anti-malarial. It was the original prototype from which most methods of treatment are derived. It is also the least expensive, best tested and safest of all available drugs. The emergence of drug-resistant parasitic strains is rapidly decreasing its effectiveness; however, it is still the first-line drug of choice in most ": null
    },
    {
        "sub-Saharan Africa": "sub-saharan africa"
    },
    {
        "n countries. It is now suggested that it is used in combination with other antimalarial drugs to extend its effective usage. Popular drugs based on chloroquine phosphate are Chloroquine FNA, Resochin and Dawaquin.     Chloroquine is a ": null
    },
    {
        "42-aminoquinolone": "4-aminoquinolone"
    },
    {
        " compound with a complicated and still unclear mechanism of action. It is believed to reach high concentrations in the vacuoles of the parasite, which, due to its alkaline nature, raises the internal ": null
    },
    {
        "pH": "ph"
    },
    {
        ". It controls the conversion of toxic ": null
    },
    {
        "heme": "heme"
    },
    {
        " to ": null
    },
    {
        "hemozoin": "hemozoin"
    },
    {
        " by inhibiting the ": null
    },
    {
        "biocrystallization": "biocrystallization"
    },
    {
        " of ": null
    },
    {
        "hemozoin": "hemozoin"
    },
    {
        ", thus poisoning the parasite through excess levels of toxicity. Other potential mechanisms through which it may act include interfering with the biosynthesis of parasitic ": null
    },
    {
        "nucleic acid": "nucleic acid"
    },
    {
        "s and the formation of a chloroquine-haem or chloroquine-": null
    },
    {
        "DNA": "dna"
    },
    {
        " complex. The most significant level of activity found is against all forms of the schizonts  and the ": null
    },
    {
        "gametocyte": "gametocyte"
    },
    {
        "s of P. vivax, P. malariae,  P. ovale  as well as the immature gametocytes of P. falciparum. Chloroquine also has a significant ": null
    },
    {
        "anti-pyretic": "anti-pyretic"
    },
    {
        " and ": null
    },
    {
        "anti-inflammatory": "anti-inflammatory"
    },
    {
        " effect when used to treat P. vivax infections, and thus it may still remain useful even when resistance is more widespread. According to a report on the Science and Development Network websites sub-Saharan Africa section, there is very little drug resistance among children infected with malaria on the island of Madagascar, but what drug resistance there is exists against chloroquinine.     Children and adults should receive 42  mg of chloroquine per kg given over 42 days. A ": null
    },
    {
        "pharmacokinetic": "pharmacokinetic"
    },
    {
        "ally superior regime, recommended by the WHO, involves giving an initial dose of 42  mg/kg followed 42–42 hours later by 42  mg/kg, then 42  mg/kg on the following 42 days. For ": null
    },
    {
        "chemoprophylaxis": "chemoprophylaxis"
    },
    {
        ": 42  mg/kg/week or 42  mg/kg/week divided into 42 daily doses is advised. Chloroquine is only recommended as a ": null
    },
    {
        "prophylactic drug": "malaria prophylaxis"
    },
    {
        " in regions only affected by P. vivax and sensitive P. falciparum strains. Chloroquine has been used in the treatment of malaria for many years and no ": null
    },
    {
        "abortifacient": "abortifacient"
    },
    {
        " or ": null
    },
    {
        "teratogenic": "teratogenic"
    },
    {
        " effects have been reported during this time; therefore, it is considered very safe to use during pregnancy. However, ": null
    },
    {
        "itch": "itch"
    },
    {
        "ing can occur at intolerable level and Chloroquinine can be a provocation factor of ": null
    },
    {
        "psoriasis": "psoriasis"
    },
    {
        ".       ": null
    },
    {
        "Amodiaquine": "amodiaquine"
    },
    {
        " is a 42-aminoquinolone anti-malarial drug similar in structure and mechanism of action to chloroquine. Amodiaquine has tended to be administered in areas of chloroquine resistance while some patients prefer its tendency to cause less itching than chloroquine. Amodiaquine is now available in a combined formulation with artesunate  and is among the artemisinin-combination therapies recommended by the World Health Organisation. Combination with sulfadoxinepyrimethamine is no longer recommended .     The drug should be given in doses between 42  mg/kg and 42  mg/kg over 42 days in a similar method to that used in chloroquine administration. Adverse reactions are generally similar in severity and type to that seen in chloroquine treatment. In addition, ": null
    },
    {
        "bradycardia": "bradycardia"
    },
    {
        ", itching, nausea, vomiting and some abdominal pain have been recorded. Some blood and ": null
    },
    {
        "hepatic": "hepatic"
    },
    {
        " disorders have also been seen in a small number of patients.       ": null
    },
    {
        "Pyrimethamine": "pyrimethamine"
    },
    {
        " is used in the treatment of uncomplicated malaria. It is particularly useful in cases of chloroquine-resistant P. falciparum strains when combined with ": null
    },
    {
        "sulfadoxine": "sulfadoxine"
    },
    {
        ". It acts by inhibiting ": null
    },
    {
        "dihydrofolate reductase": "dihydrofolate reductase"
    },
    {
        " in the parasite thus preventing the biosynthesis of ": null
    },
    {
        "purine": "purine"
    },
    {
        "s and ": null
    },
    {
        "pyrimidine": "pyrimidine"
    },
    {
        "s, thereby halting the processes of ": null
    },
    {
        "DNA replication": "dna replication"
    },
    {
        ", ": null
    },
    {
        "cell division": "cell division"
    },
    {
        " and reproduction. It acts primarily on the schizonts during the erythrocytic phase, and nowadays is only used in concert with a ": null
    },
    {
        "sulfonamide": "sulfonamide"
    },
    {
        ".       ": null
    },
    {
        "Proguanil": "proguanil"
    },
    {
        " is a ": null
    },
    {
        "biguanide": "biguanide"
    },
    {
        "; a synthetic derivative of pyrimidine. It was developed in 42 by a British Antimalarial research group. It has many mechanisms of action but primarily is mediated through conversion to the active ": null
    },
    {
        "metabolite": "metabolite"
    },
    {
        " cycloguanil": "cycloguanil"
    },
    {
        ". This inhibits the malarial dihydrofolate reductase enzyme. Its most prominent effect is on the primary tissue stages of P. falciparum, P. vivax and P. ovale. It has no known effect against ": null
    },
    {
        "hypnozoite": "hypnozoite"
    },
    {
        "s therefore is not used in the prevention of relapse. It has a weak blood schizonticidal activity and is not recommended for therapy of acute infection. However it is useful in ": null
    },
    {
        "prophylaxis": "malaria prophylaxis"
    },
    {
        " when combined with ": null
    },
    {
        "atovaquone": "atovaquone"
    },
    {
        " or ": null
    },
    {
        "chloroquine": "chloroquine"
    },
    {
        " . 42  mg/kg is the advised dosage per day, . The pharmacokinetic profile of the drugs indicates that a half dose, twice daily maintains the ": null
    },
    {
        "plasma": "blood plasma"
    },
    {
        " levels with a greater level of consistency, thus giving a greater level of protection. The proguanil- chloroquine combination does not provide effective protection against resistant strains of P. falciparum. There are very few side effects to proguanil, with slight hair loss and mouth ulcers being occasionally reported following prophylactic use. Proguanil hydrochloride is marketed as Paludrine by ": null
    },
    {
        "AstraZeneca": "astrazeneca"
    },
    {
        ".       ": null
    },
    {
        "Sulfadoxine": "sulfadoxine"
    },
    {
        " and ": null
    },
    {
        "sulfamethoxypyridazine": "sulfamethoxypyridazine"
    },
    {
        " are specific inhibitors of the enzyme ": null
    },
    {
        "dihydropteroate synthetase": "dihydropteroate synthetase"
    },
    {
        " in the tetrahydrofolate synthesis pathway of malaria parasites. They are structural analogs of ": null
    },
    {
        "p-aminobenzoic acid": "4-aminobenzoic acid"
    },
    {
        " and compete with PABA to block its conversion to dihydrofolic acid. Sulfonamides act on the schizont stages of the erythrocytic cycle. When administered alone sulfonamides are not efficacious in treating malaria but co-administration with the antifolate ": null
    },
    {
        "pyrimethamine": "pyrimethamine"
    },
    {
        ", most commonly as fixed-dose sulfadoxine-pyrimethamine , produces ": null
    },
    {
        "synergistic": "drug synergy"
    },
    {
        " effects sufficient to cure sensitive strains of malaria.     Sulfonamides are not recommended for chemoprophylaxis because of rare but severe skin reactions experienced. However it is used frequently for clinical episodes of the disease.       ": null
    },
    {
        "Mefloquine": "mefloquine"
    },
    {
        " was developed during the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        " and is chemically related to quinine. It was developed to protect American troops against ": null
    },
    {
        "multi-drug resistant": "multi-drug resistant"
    },
    {
        " P. falciparum. It is a very potent blood schizonticide with a long ": null
    },
    {
        "half-life": "half-life"
    },
    {
        ". It is thought to act by forming toxic heme complexes that damage parasitic food vacuoles. Mefloquine is effective in ": null
    },
    {
        "prophylaxis": "malaria prophylaxis"
    },
    {
        " and for acute therapy. It is now used solely for the prevention of resistant strains of P. falciparum  despite being effective against P. vivax, P. ovale and P. marlariae. Chloroquine/proguanil or sulfa drug-pyrimethamine combinations should be used in all other plasmodia infections.     The major commercial manufacturer of mefloquine-based malaria treatment is Roche Pharmaceuticals, which markets the drug under the trade name ": null
    },
    {
        "Lariam": "lariam"
    },
    {
        " . Lariam is fairly expensive at around 42 € per tablet .     A dose of 42–42  mg/kg is recommended, depending on the prevalence of mefloquine resistance. The increased dosage is associated with a much greater level of intolerance, most noticeably in young children; with the drug inducing vomiting and ": null
    },
    {
        "esophagitis": "esophagitis"
    },
    {
        ". It was not recommended for use during the first trimester, although considered safe during the second and third trimesters; nevertheless, in October 42 the Centers for Disease Control and Prevention changed its recommendation and approved use of Mefloquine for both prophylaxis and treatment of malaria in all trimesters, after the Food and Drug Administration changed its categorization from C to B. Mefloquine frequently produces side effects, including nausea, vomiting, diarrhea, abdominal pain and dizziness. Several associations with neurological events have been made, namely ": null
    },
    {
        "affective": "affective disorders"
    },
    {
        " and ": null
    },
    {
        "anxiety disorder": "anxiety disorder"
    },
    {
        "s, hallucinations, sleep disturbances, ": null
    },
    {
        "psychosis": "psychosis"
    },
    {
        ", ": null
    },
    {
        "toxic encephalopathy": "toxic encephalopathy"
    },
    {
        ", convulsions and ": null
    },
    {
        "delirium": "delirium"
    },
    {
        ". ": null
    },
    {
        "Cardiovascular": "cardiovascular"
    },
    {
        " effects have been recorded with bradycardia and ": null
    },
    {
        "sinus arrhythmia": "sinus arrhythmia"
    },
    {
        " being consistently recorded in 42% of patients treated with mefloquine .     Mefloquine can only be taken for a period up to 42 months due to side effects. After this, other drugs again need to be taken.         ": null
    },
    {
        "Atovaquone": "atovaquone"
    },
    {
        " is available in combination with proguanil under the name ": null
    },
    {
        "Malarone": "malarone"
    },
    {
        ", albeit at a price higher than ": null
    },
    {
        "Lariam": "lariam"
    },
    {
        ". It is commonly used in ": null
    },
    {
        "prophylaxis": "malaria prophylaxis"
    },
    {
        " by travellers and used to treat falciparum malaria in developed countries.   A liquid oral suspension of Atovaquone is available under the name Mepron.       ": null
    },
    {
        "Primaquine": "primaquine"
    },
    {
        " is a highly active 42-aminoquinolone that is effective against P. falcipaum gametocytes but also acts on merozoites in the bloodstream and on hypnozoites, the dormant hepatic forms of P. vivax and P. ovale.  It is the only known drug to cure both relapsing malaria infections and acute cases. The mechanism of action is not fully understood but it is thought to block oxidative metabolism in Plasmodia. It can also be combined with methylene blue.      For the prevention of relapse in P. vivax and P. ovale 42  mg/kg should be given for 42 days. As a gametocytocidal drug in P. falciparum infections a single dose of 42  mg/kg repeated 42 days later is sufficient. This treatment method is only used in conjunction with another effective blood schizonticidal drug. There are few significant side effects although it has been shown that primaquine may cause ": null
    },
    {
        "anorexia": "anorexia"
    },
    {
        ", nausea, vomiting, cramps, chest weakness, ": null
    },
    {
        "anaemia": "anaemia"
    },
    {
        ", some suppression of ": null
    },
    {
        "myeloid": "myeloid"
    },
    {
        " activity and abdominal pains. In cases of over-dosage ": null
    },
    {
        "granulocytopenia": "granulocytopenia"
    },
    {
        " may occur.       ": null
    },
    {
        "Artemisinin": "artemisinin"
    },
    {
        " is a Chinese herb  that has been used in the treatment of fevers for over 42 years,  thus predating the use of Quinine in the western world. It is derived from the plant  Artemisia annua , with the first documentation as a successful therapeutic agent in the treatment of malaria is in 42 AD by ": null
    },
    {
        "Ge Hong": "ge hong"
    },
    {
        " in his book Zhou Hou Bei Ji Fang .  Ge Hong extracted the artemesinin using a simple ": null
    },
    {
        "macerate": "maceration"
    },
    {
        ", and this method is still in use today.  The active compound was isolated first in 42 and named artemisinin. It is a ": null
    },
    {
        "sesquiterpene lactone": "sesquiterpene lactone"
    },
    {
        " with a chemically rare peroxide bridge linkage. It is thought to be responsible for the majority of its anti-malarial action, although the target within the parasite remains controversial. At present it is strictly controlled under WHO guidelines as it has proven to be effective against all forms of multi-drug resistant P. falciparum, thus every care is taken to ensure compliance and adherence together with other behaviors associated with the development of resistance. It is also only given in combination with other anti-malarials.     ": null
    },
    {
        "Artemisinin": "artemisinin"
    },
    {
        " has a very rapid action and the vast majority of acute patients treated show significant improvement within 42–42 days of receiving treatment. It has demonstrated the fastest clearance of all anti-malarials currently used and acts primarily on the trophozite phase, thus preventing progression of the disease. Semi-synthetic artemisinin derivatives are easier to use than the parent compound and are converted rapidly once in the body to the active compound dihydroartemesinin. On the first day of treatment 42  mg/kg should be given, this dose is then reduced to 42  mg/kg per day for the 42 following days. Few side effects are associated with artemesinin use. However, headaches, nausea, vomiting, abnormal bleeding, dark urine, itching and some ": null
    },
    {
        "drug fever": "drug-induced fever"
    },
    {
        " have been reported by a small number of patients. Some cardiac changes were reported during a clinical trial, notably non specific ST changes and a first degree ": null
    },
    {
        "atrioventricular block": "atrioventricular block"
    },
    {
        " .   ": null
    },
    {
        "Artemether": "artemether"
    },
    {
        " is a ": null
    },
    {
        "methyl": "methyl group"
    },
    {
        " ether": "ether"
    },
    {
        " derivative of dihydroartemesinin. It is similar to artemesinin in mode of action but demonstrates a reduced ability as a hypnozoiticidal compound, instead acting more significantly to decrease gametocyte carriage. Similar restrictions are in place, as with artemesinin, to prevent the development of resistance, therefore it is only used in combination therapy for severe acute cases of drug-resistant P. falciparum. It should be administered in a 42-day course with 42  mg/kg given per day for 42 days, followed by 42  mg/kg for 42 days. Side effects of the drug are few but include potential neurotoxicity developing if high doses are given.   ": null
    },
    {
        "Artesunate": "artesunate"
    },
    {
        " is a ": null
    },
    {
        "hemisuccinate": "hemisuccinate"
    },
    {
        " derivative of the active metabolite dihydroartemisin. Currently it is the most frequently used of all the artemesinin-type drugs. Its only effect is mediated through a reduction in the gametocyte transmission. It is used in combination therapy and is effective in cases of uncomplicated P. falciparum. The dosage recommended by the WHO is a 42 or 42 day course of 42  mg/kg for 42 days followed by 42  mg/kg for the remaining 42 or 42 days. In large studies carried out on over 42 patients in Thailand no adverse effects have been shown.   ": null
    },
    {
        "Dihydroartemisinin": "dihydroartemisinin"
    },
    {
        " is the active metabolite to which artemesinin is reduced. It is the most effective artemesinin compound and the least stable. It has a strong blood schizonticidal action and reduces gametocyte transmission. It is used for therapeutic treatment of cases of resistant and uncomplicated P. falciparum. 42  mg/kg doses are recommended on the first day of therapy followed by 42  mg/kg for 42 days. As with artesunate, no side effects to treatment have thus far been recorded.   ": null
    },
    {
        "Arteether": "arteether"
    },
    {
        " is an ": null
    },
    {
        "ethyl ether": "ethyl ether"
    },
    {
        " derivative of dihydroartemisinin. It is used in combination therapy for cases of uncomplicated resistant P. falciparum. The recommended dosage is 42  mg/kg per day for 42 days given by IM injections. With the exception of a small number of cases demonstrating neurotoxicity following ": null
    },
    {
        "parenteral": "wikt:parenteral"
    },
    {
        " administration no side effects have been recorded.       ": null
    },
    {
        "Halofantrine": "halofantrine"
    },
    {
        " is a relatively new drug developed by the ": null
    },
    {
        "Walter Reed Army Institute of Research": "walter reed army institute of research"
    },
    {
        " in the 42s. It is a ": null
    },
    {
        "phenanthrene methanol": "phenanthrene methanol"
    },
    {
        ", chemically related to Quinine and acts acting as a blood schizonticide effective against all Plasmodium parasites. Its mechanism of action is similar to other anti-malarials. Cytotoxic complexes are formed with ": null
    },
    {
        "ferritoporphyrin XI": "ferritoporphyrin xi"
    },
    {
        " that cause plasmodial membrane damage. Despite being effective against drug resistant parasites, halofantrine is not commonly used in the treatment of malaria due to its high cost. It has very variable bioavailability and has been shown to have potentially high levels of ": null
    },
    {
        "cardiotoxic": "cardiotoxic"
    },
    {
        "ity. It is still a useful drug and can be used in patients that are known to be free of heart disease and are suffering from severe and resistant forms of acute malaria. A popular drug based on halofantrine is Halfan. The level of governmental control and the prescription-only basis on which it can be used contributes to the cost, thus halofantrine is not frequently used.     A dose of 42  mg/kg of halofantrine is advised to be given in three doses at six-hour intervals for the duration of the clinical episode. It is not recommended for children under 42  kg despite data supporting the use and demonstrating that it is well tolerated. The most frequently experienced side-effects include nausea, abdominal pain, diarrhea, and itch. Severe ": null
    },
    {
        "ventricular dysrhythmias": "cardiac arrhythmia"
    },
    {
        ", occasionally causing death are seen when high doses are administered. This is due to ": null
    },
    {
        "prolongation of the QTc interval": "long qt syndrome"
    },
    {
        ". Halofantrine is not recommended for use in pregnancy and lactation, in small children, or in patients that have taken mefloquine previously. ": null
    },
    {
        "Lumefantrine": "lumefantrine"
    },
    {
        " is a relative of halofantrine that is used in some combination antimalarial regimens.        Probably one of the more prevalent antimalarial drugs prescribed, due to its relative effectiveness and cheapness, ": null
    },
    {
        "doxycycline": "doxycycline"
    },
    {
        " is a ": null
    },
    {
        "tetracycline": "tetracycline"
    },
    {
        " compound derived from ": null
    },
    {
        "oxytetracycline": "oxytetracycline"
    },
    {
        ". The tetracyclines were one of the earliest groups of antibiotics to be developed and are still used widely in many types of infection. It is a ": null
    },
    {
        "bacteriostatic": "bacteriostatic"
    },
    {
        " agent that acts to inhibit the process of ": null
    },
    {
        "protein synthesis": "protein synthesis"
    },
    {
        " by binding to the ": null
    },
    {
        "42S": "30s"
    },
    {
        " ribosomal": "ribosome"
    },
    {
        " subunit thus preventing the 42s and 42s units from bonding. Doxycycline is used primarily for ": null
    },
    {
        "chemoprophylaxis": "malaria prophylaxis"
    },
    {
        " in areas where chloroquine resistance exists. It can also be used in combination with quinine to treat resistant cases of P. falciparum but has a very slow action in acute malaria, and should not be used as monotherapy.     When treating acute cases and given in combination with quinine; 42  mg of doxycycline should be given per day for 42 days. In prophylactic therapy, 42  mg of doxycycline should be given every day during exposure to malaria.     The most commonly experienced side effects are permanent ": null
    },
    {
        "enamel hypoplasia": "tooth enamelsystemic conditions affecting enamel"
    },
    {
        ", transient depression of bone growth, gastrointestinal disturbances and some increased levels of ": null
    },
    {
        "photosensitivity": "photosensitivity"
    },
    {
        ". Due to its effect of bone and tooth growth it is not used in children under 42 pregnant or lactating women and those with a known hepatic dysfunction.     Tetracycline is only used in combination for the treatment of acute cases of P. falciparum infections. This is due to its slow onset. Unlike doxycycline it is not used in chemoprophylaxis. For tetracycline, 42  mg is the recommended adult dosage for 42 or 42 days depending on the level of adherence and compliance expected. Oesophageal ulceration, gastrointestinal upset and interferences with the process of ": null
    },
    {
        "ossification": "ossification"
    },
    {
        " and depression of bone growth are known to occur. The majority of side effects associated with doxycycline are also experienced.         ": null
    },
    {
        "Clindamycin": "clindamycin"
    },
    {
        " is a derivative of ": null
    },
    {
        "lincomycin": "lincomycin"
    },
    {
        ", with a slow action against blood schizonticides. It is only used in combination with quinine in the treatment of acute cases of resistant P. falciparum infections and not as a prophylactic. Being more toxic than the other antibiotic alternatives, it is used only in cases where the Tetracyclines are contraindicated .     Clindamycin should be given in conjunction with quinine as a 42  mg dose four times a day for 42 days. The only side effects recorded in patients taking clindamycin are nausea, vomiting and abdominal pains and cramps. However these can be alleviated by consuming large quantities of water and food when taking the drug. ": null
    },
    {
        "Pseudomembranous colitis": "pseudomembranous colitis"
    },
    {
        "  has also developed in some patients; this condition may be fatal in a small number of cases.       Antimalarial resistance is common.      Anti-malarial ": null
    },
    {
        "drug resistance": "drug resistance"
    },
    {
        " has been defined as: the ability of a parasite to survive and/or multiply despite the administration and absorption of a drug given in doses equal to or higher than those usually recommended but within tolerance of the subject. The drug in question must gain access to the parasite or the infected red blood cell for the duration of the time necessary for its normal action. In most instances this refers to parasites that remain following on from an observed treatment. Thus it excludes all cases where anti-malarial prophylaxis has failed. In order for a case to be defined as resistant, the patient in question must have received a known and observed anti-malarial therapy while the blood drug and metabolite concentrations are monitored concurrently. The techniques used to demonstrate this are: in vivo, in vitro, ": null
    },
    {
        "animal model": "animal model"
    },
    {
        " testing and the most recently developed molecular techniques.     Drug resistant parasites are often used to explain malaria treatment failure. However, they are two potentially very different clinical scenarios. The failure to clear ": null
    },
    {
        "parasitemia": "parasitemia"
    },
    {
        " and recover from an acute clinical episode when a suitable treatment has been given is anti-malarial resistance in its true form. Drug resistance may lead to treatment failure, but treatment failure is not necessarily caused by drug resistance despite assisting with its development. A multitude of factors can be involved in the processes including problems with non-compliance and adherence, poor drug quality, interactions with other pharmaceuticals, poor absorption, misdiagnosis and incorrect doses being given. The majority of these factors also contribute to the development of drug resistance.     The generation of resistance can be complicated and varies between Plasmodium species. It is generally accepted to be initiated primarily through a ": null
    },
    {
        "spontaneous mutation": "spontaneous mutation"
    },
    {
        " that provides some ": null
    },
    {
        "evolution": "evolution"
    },
    {
        "ary benefit, thus giving the anti-malarial used a reduced level of sensitivity. This can be caused by a single ": null
    },
    {
        "point mutation": "point mutation"
    },
    {
        " or multiple mutations. In most instances a mutation will be fatal for the parasite or the drug pressure will remove parasites that remain susceptible, however some resistant parasites will survive. Resistance can become firmly established within a parasite population, existing for long periods of time.     The first type of resistance to be acknowledged was to chloroquine in Thailand in 42 The biological mechanism behind this resistance was subsequently discovered to be related to the development of an efflux mechanism that expels chloroquine from the parasite before the level required to effectively inhibit the process of haem polymerization . This theory has been supported by evidence showing that resistance can be effectively reversed on the addition of substances which halt the efflux. The resistance of other quinolone anti-malarials such as amiodiaquine, mefloquine, halofantrine and quinine are thought to have occurred by similar mechanisms.     Plasmodium have developed resistance against ": null
    },
    {
        "antifolate": "antifolate"
    },
    {
        " combination drugs, the most commonly used being sulfadoxine and pyrimethamine. Two gene mutations are thought to be responsible, allowing synergistic blockages of two enzymes involved in ": null
    },
    {
        "folate": "folate"
    },
    {
        " synthesis. Regional variations of specific mutations give differing levels of resistance.     ": null
    },
    {
        "Atovaquone": "atovaquone"
    },
    {
        " is recommended to be used only in combination with another anti-malarial compound as the selection of resistant parasites occurs very quickly when used in mono-therapy. Resistance is thought to originate from a single-point mutation in the gene coding for cytochrome-b.         There is no single factor that confers the greatest degree of influence on the spread of drug resistance, but a number of plausible causes associated with an increase have been acknowledged. These include aspects of economics, human behaviour, pharmacokinetics, and the biology of ": null
    },
    {
        "vector": "vector"
    },
    {
        "s and parasites.     The most influential causes are examined below:   The biological influences are based on the parasites ability to survive the presence of an anti-malarial thus enabling the persistence of resistance and the potential for further transmission despite treatment. In normal circumstances any parasites that persist after treatment are destroyed by the hosts immune system, therefore any factors that act to reduce the elimination of parasites could facilitate the development of resistance. This attempts to explain the poorer response associated with ": null
    },
    {
        "immunocompromised": "immunocompromised"
    },
    {
        " individuals, pregnant women and young children.   There has been evidence to suggest that certain parasite-vector combinations can alternatively enhance or inhibit the transmission of resistant parasites, causing pocket-like areas of resistance.   The use of anti-malarials developed from similar basic chemical compounds can increase the rate of resistance development, for example cross-resistance to chloroquine and amiodiaquine, two 42-aminoquinolones and mefloquine conferring resistance to quinine and halofantrine. This phenomenon may reduce the usefulness of newly developed therapies prior to large-scale usage.   The resistance to anti-malarials may be increased by a process found in some species of Plasmodium, where a degree of ": null
    },
    {
        "phenotypic plasticity": "phenotypic plasticity"
    },
    {
        " was exhibited, allowing the rapid development of resistance to a new drug, even if the drug has not been previously experienced.   The pharmacokinetics of the chosen anti-malarial are key; the decision of choosing a long half-life over a drug that is metabolised quickly is complex and still remains unclear. Drugs with shorter half-lifes require more frequent administration to maintain the correct plasma concentrations, therefore potentially presenting more problems if levels of adherence and compliance are unreliable, but longer-lasting drugs can increase the development of resistance due to prolonged periods of low drug concentration.   The pharmacokinetics of anti-malarials is important when using combination therapy. Mismatched drug combinations, for example having an unprotected period where one drug dominates can seriously increase the likelihood of selection for resistant parasites.   Ecologically there is a linkage between the level of transmission and the development of resistance, however at present this still remains unclear.   The treatment regime prescribed can have a substantial influence on the development of resistance. This can involve the drug intake, combination and interactions as well as the drugs pharmacokinetic and dynamic properties.         The prevention of anti-malarial drug resistance is of enormous ": null
    },
    {
        "public health": "public health"
    },
    {
        " importance. It can be assumed that no therapy currently under development or to be developed in the foreseeable future will be totally protective against malaria. In accordance with this, there is the possibility of resistance developing to any given therapy that is developed. This is a serious concern, as the rate at which new drugs are produced by no means matches the rate of the development of resistance. In addition, the most newly developed therapeutics tend to be the most expensive and are required in the largest quantities by some of the poorest areas of the world. Therefore, it is apparent that the degree to which malaria can be controlled depends on the careful use of the current drugs to limit, insofar as it is possible, any further development of resistance.     Provisions essential to this process include the delivery of fast primary care where staff are well trained and supported with the necessary supplies for efficient treatment. This in itself is inadequate in large areas where malaria is endemic thus presenting an initial problem. One method proposed that aims to avoid the fundamental lack in certain countries health care ": null
    },
    {
        "infrastructure": "infrastructure"
    },
    {
        " is the privatisation of some areas, thus enabling drugs to be purchased on the open market from sources that are not officially related to the health care industry. Although this is now gaining some support there are many problems related to limited access and improper drug use, which could potentially increase the rate of resistance development to an even greater extent.     There are two general approaches to preventing the spread of resistance: ": null
    },
    {
        "preventing malaria infections": "malaria prophylaxis"
    },
    {
        ", and preventing the transmission of resistant parasites.     Preventing malaria infections developing has a substantial effect on the potential rate of development of resistance, by directly reducing the number of cases of malaria thus decreasing the need for anti-malarial therapy.   Preventing the transmission of resistant parasites limits the risk of resistant malarial infections becoming endemic and can be controlled by a variety of non-medical methods including ": null
    },
    {
        "insecticide": "insecticide"
    },
    {
        "-treated ": null
    },
    {
        "bed net": "bed net"
    },
    {
        "s, ": null
    },
    {
        "indoor residual spraying": "indoor residual spraying"
    },
    {
        ", environmental controls and personal protective methods such as using ": null
    },
    {
        "mosquito repellent": "mosquito repellent"
    },
    {
        ". Chemoprophylaxis is also important in the transmission of malaria infection and resistance in defined populations .     A hope for future of anti-malarial therapy is the development of an effective ": null
    },
    {
        "malaria vaccine": "malaria vaccine"
    },
    {
        ". This could have enormous public health benefits, providing a cost-effective and easily applicable approach to preventing not only the onset of malaria but the transmission of gametocytes, thus reducing the risk of resistance developing. Anti-malarial therapy also could be diversified by combining a potentially effective vaccine with current chemotherapy, thereby reducing the chance of vaccine resistance developing.         The problem of the development of malaria resistance must be weighed against the essential goal of anti-malarial care; that is to reduce ": null
    },
    {
        "morbidity": "morbidity"
    },
    {
        " and mortality. Thus a balance must be reached that attempts to achieve both goals while not compromising either too much by doing so. The most successful attempts so far have been in the administration of combination therapy. This can be defined as, the simultaneous use of two or more blood schizonticidal drugs with independent modes of action and different biochemical targets in the parasite.  There is much evidence to support the use of combination therapies, some of which has been discussed previously, however several problems prevent the wide use in the areas where its use is most advisable. These include: problems identifying the most suitable drug for different epidemiological situations, the expense of combined therapy , how soon the programmes should be introduced and problems linked with policy implementation and issues of compliance.     The combinations of drugs currently prescribed can be divided into two categories: non-artemesinin-based combinations and artemesinin based combinations. It is also important to distinguish fixed-dose combination therapies from combinations achieved by taking two separate antimalarials.              According to WHO guidelines 42 artemisinin-based combination therapies should be used in preference to amodiaquine plus sulfadoxine-pyrimethamine for the treatment of uncomplicated P. falciparum malaria.       Artemesinin has a very different mode of action than conventional anti-malarials , which makes it particularly useful in the treatment of resistant infections. However, to prevent the development of resistance to this drug it is only recommended in combination with another non-artemesinin based therapy. It produces a very rapid reduction in the parasite biomass with an associated reduction in clinical symptoms and is known to cause a reduction in the transmission of gametocytes thus decreasing the potential for the spread of resistant alleles. At present there is no known resistance to Artemesinin  and very few reported side-effects to drug usage, however this data is limited.              Several other anti-malarial combinations have been used or are in development. For example, ": null
    },
    {
        "Chlorproguanil": "chlorproguanil"
    },
    {
        "-": null
    },
    {
        "dapsone": "dapsone"
    },
    {
        " and artesunate  appears efficacious but the problem of haemolysis in patients with ": null
    },
    {
        "glucose42-phosphate dehydrogenase": "glucose-6-phosphate dehydrogenase"
    },
    {
        " deficiency is likely to prevent widespread use.        Antimalarial drugs and combinations may also be sorted according to the type of malaria in which they are used.     Falciparum malaria   According to WHO guidelines 42 artemisinin-based combination therapies are the recommended antimalarial treatments for uncomplicated malaria caused by ": null
    },
    {
        "P. falciparum": "p. falciparum"
    },
    {
        ". The choice of ACT in a country or region will be based on the level of resistance to the constituents in the combination. For pregnant women, the recommended first-line treatment during the ": null
    },
    {
        "first trimester": "first trimester"
    },
    {
        " is quinine plus clindamycin to be given for 42 days. In second and third trimesters, it is recommended to give ACTs known to be effective in the country/region or artesunate plus clindamycin for 42 days, or quinine plus clindamycin to be given for 42 days. Lactating women should receive standard antimalarial treatment except for ": null
    },
    {
        "dapsone": "dapsone"
    },
    {
        ", ": null
    },
    {
        "primaquine": "primaquine"
    },
    {
        " and ": null
    },
    {
        "tetracycline": "tetracycline"
    },
    {
        "s. In infants and young children, it is recommended to give ACTs for first-line treatment, with attention to accurate dosing and ensuring the administered dose is retained.     In severe falciparum malaria, it is recommended that rapid clinical assessment and confirmation of the diagnosis is made, followed by administration of full doses of parenteral antimalarial treatment without delay with whichever effective antimalarial is first available. For adults, ": null
    },
    {
        "intravenous": "intravenous"
    },
    {
        " or ": null
    },
    {
        "intramuscular": "intramuscular"
    },
    {
        " artesunate is recommended. Quinine is an acceptable alternative if parenteral artesunate is not available. Parenteral antimalarials should be administered for a minimum of 42 h in the treatment of severe malaria, irrespective of the patients ability to tolerate oral medication earlier. Thereafter, it is recommended to complete treatment by giving a complete course of any of the following:   an ACT   artesunate plus clindamycin or doxycycline;   quinine plus clindamycin or doxycycline.     Vivax malaria   ": null
    },
    {
        "Chloroquine": "chloroquine"
    },
    {
        " remains the treatment of choice for vivax malaria, except in Indonesias Irian Jaya  region and the geographically contiguous ": null
    },
    {
        "Papua New Guinea": "independent state of papua new guinea"
    }
]