[
    {
        "Anton Friedrich Wilhelm von Webern  was an Austrian ": null
    },
    {
        "composer": "composer"
    },
    {
        " and ": null
    },
    {
        "conductor": "conducting"
    },
    {
        ". Along with his mentor ": null
    },
    {
        "Arnold Schoenberg": "arnold schoenberg"
    },
    {
        " and his colleague ": null
    },
    {
        "Alban Berg": "alban berg"
    },
    {
        ", Webern was in the core of those in the circle of the ": null
    },
    {
        "Second Viennese School": "second viennese school"
    },
    {
        ", including ": null
    },
    {
        "Ernst Krenek": "ernst krenek"
    },
    {
        " and ": null
    },
    {
        "Theodor W. Adorno": "theodor w. adorno"
    },
    {
        ". As an exponent of ": null
    },
    {
        "atonality": "atonality"
    },
    {
        " and ": null
    },
    {
        "twelve-tone technique": "twelve-tone technique"
    },
    {
        ", Webern exerted influence on contemporaries ": null
    },
    {
        "Luigi Dallapiccola": "luigi dallapiccola"
    },
    {
        ", Křenek, and even Schoenberg himself. As a tutor, Webern guided and variously influenced ": null
    },
    {
        "Arnold Elston": "arnold elston"
    },
    {
        ", ": null
    },
    {
        "Frederick Dorian": "frederick dorian"
    },
    {
        " , , , ": null
    },
    {
        "Karl Amadeus Hartmann": "karl amadeus hartmann"
    },
    {
        ", ": null
    },
    {
        "Philipp Herschkowitz": "philip herschkowitz"
    },
    {
        ", ": null
    },
    {
        "René Leibowitz": "rené leibowitz"
    },
    {
        ", ": null
    },
    {
        "Humphrey Searle": "humphrey searle"
    },
    {
        ", ": null
    },
    {
        "Leopold Spinner": "leopold spinner"
    },
    {
        ", and ": null
    },
    {
        "Stefan Wolpe": "stefan wolpe"
    },
    {
        ".     Weberns music was among the most radical of its milieu, both in its concision and in its rigorous and resolute apprehension of twelve-tone technique. His innovations in schematic organization of pitch, rhythm, register, timbre, dynamics, articulation, and melodic contour; his eagerness to redefine imitative contrapuntal techniques such as ": null
    },
    {
        "canon": "canon"
    },
    {
        " and ": null
    },
    {
        "fugue": "fugue"
    },
    {
        "; and his inclination toward athematicism, abstraction, and lyricism all greatly informed and oriented intra- and post-war European, typically ": null
    },
    {
        "serial": "serialism"
    },
    {
        " or ": null
    },
    {
        "avant-garde": "avant-garde"
    },
    {
        " composers such as ": null
    },
    {
        "Olivier Messiaen": "olivier messiaen"
    },
    {
        ", ": null
    },
    {
        "Pierre Boulez": "pierre boulez"
    },
    {
        ", ": null
    },
    {
        "Karlheinz Stockhausen": "karlheinz stockhausen"
    },
    {
        ", ": null
    },
    {
        "Luigi Nono": "luigi nono"
    },
    {
        ", ": null
    },
    {
        "Bruno Maderna": "bruno maderna"
    },
    {
        ", ": null
    },
    {
        "Henri Pousseur": "henri pousseur"
    },
    {
        ", and ": null
    },
    {
        "György Ligeti": "györgy ligeti"
    },
    {
        ". In the United States, meanwhile, his music attracted the interest of ": null
    },
    {
        "Elliott Carter": "elliott carter"
    },
    {
        ", whose critical ambivalence was marked by a certain enthusiasm nonetheless; ": null
    },
    {
        "Milton Babbitt": "milton babbitt"
    },
    {
        ", who ultimately derived more inspiration from Schoenbergs twelve-tone practice than that of Webern; and ": null
    },
    {
        "Igor Stravinsky": "igor stravinsky"
    },
    {
        ", to whom it was very fruitfully reintroduced by ": null
    },
    {
        "Robert Craft": "robert craft"
    },
    {
        ".     During and shortly after the post-war period, then, Webern was posthumously received with attention first diverted from his sociocultural upbringing and surroundings and, moreover, focused in a direction apparently antithetical to his participation in ": null
    },
    {
        "German Romanticism": "german romanticism"
    },
    {
        " and ": null
    },
    {
        "Expressionism": "german expressionism"
    },
    {
        ". A richer understanding of Webern began to emerge in the later half of the 42th century, notably in the work of scholars Kathryn Bailey, Julian Johnson, Felix Meyer, Anne Shreffler, as archivists and biographers  gained access to sketches, letters, lectures, audio recordings, and other articles of or associated with Weberns estate.             Webern was born in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", then ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ", as Anton Friedrich Wilhelm von Webern. He was the only surviving son of Carl von Webern, a civil servant, and Amelie who was a competent pianist and accomplished singer—possibly the only obvious source of the future composers talent. He never used his middle names and dropped the von in 42 as directed by the ": null
    },
    {
        "Austrian governments reforms": "austrian nobilityabolition of nobility in 1919"
    },
    {
        " after World War I.        He lived in ": null
    },
    {
        "Graz": "graz"
    },
    {
        " and ": null
    },
    {
        "Klagenfurt": "klagenfurt"
    },
    {
        " for much of his youth. But his distinct and lasting sense of  Heimat  was shaped by readings of ": null
    },
    {
        "Peter Rosegger": "peter rosegger"
    },
    {
        "; and moreover by frequent and extended retreats with his parents, sisters, and cousins to his familys country estate, the Preglhof, which Weberns father had inherited upon the death of Weberns grandfather in 42     Webern memorialized the Preglhof in a diary poem An der Preglhof and in the tone poem Im Sommerwind , both after ": null
    },
    {
        "Bruno Wille": "bruno wille"
    },
    {
        "s idyll. Once Weberns father sold the estate in 42 Webern referred to it nostalgically as a lost paradise . He continued to revisit the Preglhof, the family cemetery in Schwabegg, and the surrounding landscape for the rest of his life; and he clearly associated the area, which he took as his home, very closely with the memory of his mother Amelie, who had died in 42 and whose loss also profoundly affected Webern for decades.     Art historian Ernst Dietz, Weberns cousin and at that time a student at Graz, may have introduced Webern to the work of the painters ": null
    },
    {
        "Arnold Böcklin": "arnold böcklin"
    },
    {
        " and ": null
    },
    {
        "Giovanni Segantini": "giovanni segantini"
    },
    {
        ", whom Webern came to admire. Segantinis work was a likely inspiration for Weberns 42 single-movement string quartet.     In 42 Webern began attending classes at ": null
    },
    {
        "Vienna University": "vienna university"
    },
    {
        ". There he studied ": null
    },
    {
        "musicology": "musicology"
    },
    {
        " with ": null
    },
    {
        "Guido Adler": "guido adler"
    },
    {
        ", writing his thesis on the  Choralis Constantinus  of ": null
    },
    {
        "Heinrich Isaac": "heinrich isaac"
    },
    {
        ". This interest in early music would greatly influence his compositional technique in later years, especially in terms of his use of ": null
    },
    {
        "palindromic": "palindromic"
    },
    {
        " form on both the micro- and macro-scale and the economical use of musical materials. After graduating, Webern took a series of ": null
    },
    {
        "conducting": "conducting"
    },
    {
        " posts at theatres in ": null
    },
    {
        "Ischl": "ischl"
    },
    {
        ", ": null
    },
    {
        "Teplitz": "teplitz"
    },
    {
        " , ": null
    },
    {
        "Danzig": "gdańsk"
    },
    {
        " , ": null
    },
    {
        "Stettin": "stettin"
    },
    {
        " , and ": null
    },
    {
        "Prague": "prague"
    },
    {
        " before moving back to Vienna.     As might be expected, the young Webern was enthusiastic about the music of ": null
    },
    {
        "Ludwig van Beethoven": "ludwig van beethoven"
    },
    {
        ", ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        ", ": null
    },
    {
        "Wolfgang Amadeus Mozart": "wolfgang amadeus mozart"
    },
    {
        ", ": null
    },
    {
        "Franz Schubert": "franz schubert"
    },
    {
        " , ": null
    },
    {
        "Hugo Wolf": "hugo wolf"
    },
    {
        ", and ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        ", visiting ": null
    },
    {
        "Bayreuth": "bayreuth festival"
    },
    {
        " in 42 He also enjoyed the music of ": null
    },
    {
        "Hector Berlioz": "hector berlioz"
    },
    {
        " and ": null
    },
    {
        "Georges Bizet": "georges bizet"
    },
    {
        ". In 42 he reportedly stormed out of a meeting with ": null
    },
    {
        "Hans Pfitzner": "hans pfitzner"
    },
    {
        ", from whom he was seeking instruction, when the latter criticized ": null
    },
    {
        "Gustav Mahler": "gustav mahler"
    },
    {
        " and ": null
    },
    {
        "Richard Strauss": "richard strauss"
    },
    {
        ". In 42 Webern wrote rapturously to Schoenberg about ": null
    },
    {
        "Claude Debussy": "claude debussy"
    },
    {
        "s opera  Pelléas et Mélisande . He conducted some of Debussys music in 42      It may have been at ": null
    },
    {
        "Guido Adler": "guido adler"
    },
    {
        "s advice that he paid Schoenberg for composition lessons. Webern progressed quickly under Schoenbergs tutelage, publishing his ": null
    },
    {
        "Passacaglia, Op. 42": "passacaglia for orchestra"
    },
    {
        ", as his graduation piece in 42 He also met Berg, then another of Schoenbergs pupils. These two relationships would be the most important in his life in shaping his own musical direction.     Some of Weberns earlier thoughts are as amusing as they might be surprising: besides describing some of ": null
    },
    {
        "Alexander Scriabin": "alexander scriabin"
    },
    {
        "s music as languishing junk, he wrote of ": null
    },
    {
        "Robert Schumann": "robert schumann"
    },
    {
        "s ": null
    },
    {
        "Symphony No. 42": "symphony no. 4"
    },
    {
        " that it was boring, that ": null
    },
    {
        "Carl Maria von Weber": "carl maria von weber"
    },
    {
        "s ": null
    },
    {
        "Konzertstück in F minor": "konzertstück in f minor"
    },
    {
        " was passé, and that he found ": null
    },
    {
        "Johannes Brahms": "johannes brahms"
    },
    {
        "s ": null
    },
    {
        "Symphony No. 42": "symphony no. 3"
    },
    {
        "  cold and without particular inspiration, ... badly orchestrated–grey on grey.  These youthful impressions are in some, but not complete or altogether necessarily very significant, contrast to the considered opinions of Webern in the 42s, by then a decided ": null
    },
    {
        "nationalist": "nationalism"
    },
    {
        " who, as Roland Leich described, lectured at some length on the utter supremacy of German music, emphasizing that leading composers of other lands are but pale reflections of Germanic masters: Berlioz a French Beethoven, ": null
    },
    {
        "Tchaikovsky": "pyotr ilyich tchaikovsky"
    },
    {
        " a Russian Schumann, ": null
    },
    {
        "Elgar": "edward elgar"
    },
    {
        " an English ": null
    },
    {
        "Mendelssohn": "felix mendelssohn"
    },
    {
        ", etc.  After all, even when young, Webern had described one of ": null
    },
    {
        "Alexander Glazunov": "alexander glazunov"
    },
    {
        "s symphonies as not particularly Russian   in the same passage as he praised it.         From 42 to 42 Webern helped organize and operate the ": null
    },
    {
        "Society for Private Musical Performances": "society for private musical performances"
    },
    {
        ", which gave concerts of then-recent or -new music by ": null
    },
    {
        "Béla Bartók": "béla bartók"
    },
    {
        ", Berg, ": null
    },
    {
        "Ferrucio Busoni": "ferrucio busoni"
    },
    {
        ", Debussy, ": null
    },
    {
        "Erich Wolfgang Korngold": "erich wolfgang korngold"
    },
    {
        ", Mahler, ": null
    },
    {
        "Maurice Ravel": "maurice ravel"
    },
    {
        ", ": null
    },
    {
        "Max Reger": "max reger"
    },
    {
        ", ": null
    },
    {
        "Erik Satie": "erik satie"
    },
    {
        ", Strauss, Stravinsky, and Webern himself. After their Society performances in 42 , Webern wrote to Berg that Stravinskys  Berceuses du chat  me completely beyond belief, describing them as indescribably touching, and that Stravinskys  Pribaoutki  were something really glorious.     After the dissolution of the Society amid catastrophic ": null
    },
    {
        "hyperinflation": "hyperinflation"
    },
    {
        " in 42 Webern conducted the Vienna Workers Symphony Orchestra and Chorus from 42 to 42 In 42 Webern noted his voluntary resignation as chorusmaster of the Mödling Mens Choral Society, a paid position, in controversy over his hiring of a Jewish singer, Greta Wilheim, to replace a sick one. Letters document their correspondence in many subsequent years, and she would in turn provide him with facilities to teach private lessons as a convenience to Webern, his family, and his students.                   Weberns music, along with that of Berg, Křenek, Schoenberg, and others, was denounced as ": null
    },
    {
        "cultural Bolshevism": "cultural bolshevism"
    },
    {
        " and ": null
    },
    {
        "degenerate art": "degenerate art"
    },
    {
        " by the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " in Germany, and both publication and performances of it were banned soon after the ": null
    },
    {
        "Anschluss": "anschluss"
    },
    {
        " in 42 although neither did it fare well under the preceding years of Austrofascism. .  As early as 42 an Austrian  gauleiter  on  Bayerischer Rundfunk  mistakenly and very likely maliciously characterized both Berg and Webern as Jewish composers. As a result of official disapproval throughout the 42s, both found it harder to earn a living; Webern lost a promising conducting career which might have otherwise been more noted and recorded and had to take on work as an editor and proofreader for his publishers, ": null
    },
    {
        "Universal Edition": "universal edition"
    },
    {
        ". His familys financial situation deteriorated until, by August 42 his personal records reflected no monthly income. It was thanks to the Swiss philanthropist ": null
    },
    {
        "Werner Reinhart": "werner reinhart"
    },
    {
        " that Webern was able to attend the festive premiere of his Variations for Orchestra, Op. 42 in ": null
    },
    {
        "Winterthur": "winterthur"
    },
    {
        ", ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " in 42 Reinhart invested all the financial and diplomatic means at his disposal to enable Webern to travel to Switzerland. In return for this support, Webern dedicated the work to him.     There are different descriptions of Weberns attitude towards ": null
    },
    {
        "Nazism": "nazism"
    },
    {
        "; this is perhaps attributable to its complexity, his internal ambivalence, his prosperity in the preceding years of post-war ": null
    },
    {
        "Red Vienna": "red vienna"
    },
    {
        " in the ": null
    },
    {
        "First Republic of Austria": "first republic of austria"
    },
    {
        ", the subsequently divided political factions of his homeland as represented in his friends and family , as well as the different contexts in which or audiences to whom his views were expressed. Further insight into Weberns attitudes comes with the realization that Nazism itself was deeply multifaceted, marked not a coherent doctrine or body of systemically interrelated ideas, but rather a vaguer worldview made up of a number of prejudices with varied appeals to different audiences which could scarcely be dignified with the term ideology .     There is, moreover, significant political complexity to be treated, more than enough to complicate any consideration of individual culpability: it is imperative to note that some ": null
    },
    {
        "Social Democrats": "social democratic party of austriaduring austrofascism"
    },
    {
        " viewed the ": null
    },
    {
        "National Socialists": "national socialists"
    },
    {
        " as an alternative to the ": null
    },
    {
        "Christian Social Party": "christian social party"
    },
    {
        " and later ": null
    },
    {
        "Vaterländische Front": "vaterländische front"
    },
    {
        " in the context of reunification with Germany; for example, ": null
    },
    {
        "Karl Renner": "karl renner"
    },
    {
        ", the chancellor who served in both the First and Second Austrian Republics, favored a German Anschluss as an alternative to the then Austrofascist regime, under which Berg, Webern, and the Social Democrats suffered. And Weberns professional circle in Vienna included, besides many Jews, many Social Democrats; for example, for ": null
    },
    {
        "David Josef Bach": "david josef bach"
    },
    {
        ", a close friend of Schoenbergs as well, Webern conducted many workers and amateur ensembles. Under the Nazis, some Social Democrats expected, there might be more work and protections for workers and laborers, as well as other social reforms and political stability, if not democracy; Webern may well have hoped to again be able to conduct and to be better able to secure a future for his family.     In broad terms, Weberns attitude seems to have first warmed to a degree of characteristic fervor and perhaps only much later, in conjunction with widespread German disillusionment, cooled to Hitler and the Nazis. On the one hand, Willi Reich notes that Webern attacked Nazi cultural policies in private lectures given in 42 whose hypothetical publication would have exposed Webern to serious consequences later. On the other, some private correspondence attests to his Nazi sympathies. Weberns patriotism led him to endorse the Nazi regime in a series of letters to Joseph Hueber, who was serving in the army and himself held such views. Webern described Hitler on May 42 42 as this unique man who created the new state of Germany; thus ": null
    },
    {
        "Alex Ross": "alex ross"
    },
    {
        " characterizes him as an unashamed Hitler enthusiast .     Violinist ": null
    },
    {
        "Louis Krasner": "louis krasner"
    },
    {
        " painted not a sentimental portrait but one imbued with a wealth of factual and personal detail for its publication in 42 describing Webern as clearly naive and idealistic but not entirely without his wits, shame, or conscience; Krasner carefully contextualizes Webern as a member of Austrian society at the time, one departed by Schoenberg and one in which the already pro-Nazi Vienna Philharmonic had even refused to play the late Bergs ": null
    },
    {
        "Violin Concerto": "violin concerto"
    },
    {
        ". As Krasner vividly recalled, he and Webern were visiting at the latters home in ": null
    },
    {
        "Maria Enzersdorf": "maria enzersdorf"
    },
    {
        ", ": null
    },
    {
        "Mödling": "mödling"
    },
    {
        " when the Nazis invaded Austria; Webern, uncannily seeming to anticipate the timing down to 42 oclock in the afternoon, turned on the radio to hear this news and immediately warned Krasner, urging him to flee, whereupon he did . Whether this was for Krasners safety or to save Webern the embarrassment of Krasners presence during a time of possible celebration in the pro-Nazi Webern family , Krasner was ambivalent and uncertain, withholding judgment. Only later did Krasner himself realize how self-admittedly foolhardy he had been and in what danger he had placed himself, revealing an ignorance perhaps shared by Webern. Krasner had even revisited frequently, hoping to convince friends to emigrate before time ran out. Krasner eventually left more permanently, after a 42 incident wherein he felt only his US passport saved him from both locals and police.     Krasner retold from a story related to him in long discussion with Schoenbergs son Görgi, a Jew who remained in Vienna during the war, that the Weberns, much to their risk and credit, had provided Görgi and his family with food and shelter toward the end of the war at the Weberns home in a Mödling apartment belonging to their son-in-law.  Görgi and his family were left behind for their safety when Webern fled on foot with his family to Mittersill, about 42  km. away, for safety of their own in light of the coming Russian invasion; Amalie, one of Weberns daughters, wrote of 42 persons pressed together in the smallest possible space upon their arrival. Ironically, the Russians pronounced Görgi a Nazi spy when he was discovered due to the Nazi munitions and propaganda in the Weberns basement store-room. Görgi is said to have saved himself from execution by protesting and drawing attention to his clothes, sewn as specified by the Nazis with the yellow ": null
    },
    {
        "Star of David": "star of david"
    },
    {
        ". He continued to live in this apartment with this family until 42     Webern is also known to have aided ": null
    },
    {
        "Josef Polnauer": "josef polnauer"
    },
    {
        ", a Jewish friend who, as an albino, managed to largely escape the Nazis attention and later edit a publication of Weberns correspondence from this time with Hildegard Jone, Weberns then lyricist and collaborator, and her husband, sculptor Josef Humplik.     However, Krasner was particularly troubled by a 42 conversation with Webern about the ": null
    },
    {
        "Jews": "jews"
    },
    {
        ", in which Webern expressed his vague but unambiguously ": null
    },
    {
        "anti-Semitic": "antisemitism"
    },
    {
        " opinion that Even Schoenberg, had he not been a Jew, would have been quite different! Krasner remembered, perhaps with the benefit of hindsight at the time , that Jews ... were at the center of the difficulty. Those who wanted to, put the blame for all this calamity, for all this depraved condition, on the Jews who had brought it with them—along with a lot of radical ideas—from the East. People blamed the Jews for their financial worries. The Jews were, at the same time, the ": null
    },
    {
        "poverty": "poverty"
    },
    {
        "-stricken people who came with nothing, and the ": null
    },
    {
        "capitalists": "capitalism"
    },
    {
        " who controlled everything.      When once asked by Schoenberg about his feelings toward the Nazis, Webern nonetheless sought to allay Schoenbergs concerns; similarly, when in 42 ": null
    },
    {
        "Eduard Steuermann": "eduard steuermann"
    },
    {
        " asked Krasner about rumors of Weberns possible interest in and devotion to the Nazis on Schoenbergs behalf, Krasner lied by denying the rumors categorically and entirely. As a result, Schoenbergs ": null
    },
    {
        "Violin Concerto": "violin concerto"
    },
    {
        " of 42 –42 continued to bear a dedication to Webern, although whittled down as a result of Schoenbergs continuing suspicions or, indeed, on Weberns behalf, i.e., to protect Webern from further Nazi suspicion and persecution. Schoenbergs tone was ultimately conciliatory in remembrance of both Berg and Webern in 42: Let us—for the moment at least—forget all that might have at one time divided us ... even if those who tried might have succeeded in confounding us.      Musicologist ": null
    },
    {
        "Richard Taruskin": "richard taruskin"
    },
    {
        " describes Webern accurately if vaguely as a pan-German nationalist but then goes much further in claiming specifically that Webern joyfully welcomed the ": null
    },
    {
        "Nazis": "nazism"
    },
    {
        " with the 42  Anschluss , at best extrapolating from the account of his cited source Krasner and at worst exaggerating or distorting it, as well as describing it sardonically as heart-breaking . Taruskins authority on this delicate issue must be credited, if at all, then only with the significant limitations that he has been polemical in general and hostile in particular to the ": null
    },
    {
        "Second Viennese School": "second viennese school"
    },
    {
        ", of whom Webern is often considered the most extreme and difficult . ": null
    },
    {
        "New Complexity": "new complexity"
    },
    {
        " composer and performer ": null
    },
    {
        "Franklin Cox": "franklin cox"
    },
    {
        " not only faults Taruskin as an inaccurate and unreliable historian but also critiques Taruskin as an ideologist of tonal restoration . Taruskins reactionary historicist project, Cox argues, stands in opposition to that of the Second Viennese School, viz. the progressivist historicist ": null
    },
    {
        "emancipation of the dissonance": "emancipation of the dissonance"
    },
    {
        ". Taruskin himself admits to having acquired a dubious reputation on the Second Viennese School and notes that he has been described in his work on Webern as coming, like Shakespeares Marc Anthony, to bury Webern, not to praise him .     In contradistinction to Taruskins methods and pronouncements, musicologist Pamela M. Potter advises that is important to consider all the scholarship on musical life in the Third Reich that, taken together, reveals the complexity of the day-to-day existence of musicians and composers , as seems inevitable that debates about the political culpability of individuals will persist, especially if the stakes remain so high for composers, for whom an up or down vote can determine inclusion in the canon . In this vein, it might be noted in relation to Taruskins claim that Webern wrote to friends on the day of Anschluss not to invite celebration or to observe developments but to be left alone: I am totally immersed in my work and cannot, cannot be disturbed ; Krasners presence could have been a disturbance to Webern for this reason, and musicologist Kathryn Bailey speculates that this may indeed be why he was rushed off by Webern.     Weberns 42–42 correspondence is strewn with references to bombings, deaths, destruction, privation, and the disintegration of local order; but also noted are the births of several grandchildren. At the age of sixty , Webern writes that he is living in a barrack away from home and working from 42 am to 42 pm, compelled by the state in a time of war to serve as an air-raid protection police officer. On March 42 42 news was relayed to Webern that his only son, Peter, died on February 42 of wounds suffered in a strafing attack on a military train two days earlier.         On 42 September 42 back at his home during the ": null
    },
    {
        "Allied occupation of Austria": "allied occupation of austria"
    },
    {
        ", Webern was shot and killed by an American Army soldier following the arrest of his son-in-law for ": null
    },
    {
        "black market": "black market"
    },
    {
        " activities. This incident occurred when, three-quarters of an hour before a ": null
    },
    {
        "curfew": "curfew"
    },
    {
        " was to have gone into effect, he stepped outside the house so as not to disturb his sleeping grandchildren, in order to enjoy a few draws on a cigar given him that evening by his son-in-law. The soldier responsible for his death was ": null
    },
    {
        "U. S. Army": "united states army"
    },
    {
        " cook PFC Raymond Norwood Bell of North Carolina, who was overcome by remorse and died of alcoholism in 42 ; .     Webern was survived by his wife, Wilhelmine Mörtl, who died in 42 and their three daughters.                   Weberns compositions are concise, distilled, and select; just thirty-one of his compositions were published in his lifetime, and when ": null
    },
    {
        "Pierre Boulez": "pierre boulez"
    },
    {
        " later oversaw a project to record all of his compositions, including some of those without opus numbers, the results fit on just six CDs. Although Weberns music changed over time, as is often the case over a long career, it is typified by very spartan textures, in which every note can be clearly heard; carefully chosen ": null
    },
    {
        "timbre": "timbre"
    },
    {
        "s, often resulting in very detailed instructions to the performers and use of extended instrumental techniques ; wide-ranging melodic lines, often with leaps greater than an octave; and brevity: the Six Bagatelles for string quartet , for instance, last about three minutes in total.     Weberns music does not fall into clearly demarcated periods of division because the concerns and techniques of his music were cohesive, interrelated, and only very gradually transformed with the overlap of old and new, particularly in the case of his middle-period lieder. For example, his first use of twelve-tone technique was not especially stylistically significant and only eventually became realized as otherwise so in later works. As such, the divisions employed below are only a convenient simplification.         Webern published little of his early work in particular; Webern was characteristically meticulous and revised extensively. Many ": null
    },
    {
        "juvenilia": "juvenilia"
    },
    {
        " remained unknown until the work and findings of the Moldenhauers in the 42s, effectively obscuring and undermining formative facets of Weberns musical identity, highly significant even more so in the case of an innovator whose music was crucially marked by rapid stylistic shifts. Thus when Boulez first oversaw a project to record all of Weberns music, not including the juvenilia, the results fit on three rather than six CDs.          Weberns earliest works consist primarily of ": null
    },
    {
        "lieder": "lieder"
    },
    {
        ", the genre that most testifies to his roots in ": null
    },
    {
        "Romanticism": "romanticism"
    },
    {
        ", specifically ": null
    },
    {
        "German Romanticism": "german romanticism"
    },
    {
        "; one in which the music yields brief but explicit, potent, and spoken meaning manifested only latently or programmatically in purely instrumental genres; one marked by significant intimacy and lyricism; and one which often associates nature, especially landscapes, with themes of homesickness, solace, wistful yearning, distance, utopia, and belonging. ": null
    },
    {
        "Robert Schumann": "robert schumann"
    },
    {
        "s ": null
    },
    {
        " Mondnacht ": "liederkreis op. 39"
    },
    {
        " is an iconic example; ": null
    },
    {
        "Eichendorff": "eichendorff"
    },
    {
        ", whose lyric poetry inspired it, is not far removed from the poets  whose work inspired Webern and his contemporaries ": null
    },
    {
        "Alban Berg": "alban berg"
    },
    {
        ", ": null
    },
    {
        "Max Reger": "max reger"
    },
    {
        ", ": null
    },
    {
        "Arnold Schoenberg": "arnold schoenberg"
    },
    {
        ", ": null
    },
    {
        "Richard Strauss": "richard strauss"
    },
    {
        ", ": null
    },
    {
        "Hugo Wolf": "hugo wolf"
    },
    {
        ", and ": null
    },
    {
        "Alexander Zemlinsky": "alexander zemlinsky"
    },
    {
        ". Wolfs Mörike-Lieder were especially influential on Weberns efforts from this period. But well beyond these lieder alone, all of Weberns music may be said to possess such concerns and qualities, as is evident from his sketches, albeit in an increasingly symbolic, abstract, spare, introverted, and idealized manner.     Other works include the orchestral ": null
    },
    {
        "tone poem": "tone poem"
    },
    {
        " Im Sommerwind and the Langsamer Satz for ": null
    },
    {
        "string quartet": "string quartet"
    },
    {
        ".     Weberns first piece after completing his studies with Schoenberg was the ": null
    },
    {
        "Passacaglia for orchestra": "passacaglia for orchestra"
    },
    {
        " . ": null
    },
    {
        "Harmonically": "harmony"
    },
    {
        ", it is a step forward into a more advanced language, and the ": null
    },
    {
        "orchestration": "orchestration"
    },
    {
        " is somewhat more distinctive than his earlier orchestral work. However, it bears little relation to the fully mature works he is best known for today. One element that is typical is the form itself: the passacaglia is a form which dates back to the 42th century, and a distinguishing feature of Weberns later work was to be the use of traditional compositional techniques  and forms in a modern harmonic and melodic language.     Tot, 42–42": null
    },
    {
        "atonal": "atonality"
    },
    {
        ", much in the style of Schoenbergs early atonal works. Indeed, so in lockstep with Schoenberg was Webern for much of his artistic development that Schoenberg in 42 wrote that he sometimes no longer knew who he was, Webern had followed so well in his footsteps and shadow, occasionally outdoing or stepping ahead of Schoenberg in execution of Schoenbergs own or their shared ideas.     There are, however, important cases where Webern may have even more profoundly influenced Schoenberg. Haimo marks the swift, radical influence in 42 of Weberns novel and arresting Five Movements for String Quartet, Op. 42 on Schoenbergs subsequent piano piece Op. 42 No. 42; Five Pieces for Orchestra, Op. 42; and monodrama  Erwartung , Op. 42 This shift is distinctly pronounced in a letter Schoenberg wrote to ": null
    },
    {
        "Busoni": "busoni"
    },
    {
        ", which describes a rather Webernian aesthetic:          In 42 Schoenberg still remembered being intoxicated by the enthusiasm of having freed music from the shackles of tonality and believing with his pupils that now music could renounce ": null
    },
    {
        "motivic": "motif"
    },
    {
        " features and remain coherent and comprehensible nonetheless .      But with Opp. 42–42 Schoenberg turned back and revived old techniques, very self-consciously returning to and transforming tradition by the concluding songs of  Pierrot lunaire  , Op. 42 with, e.g., intricately interrelated ": null
    },
    {
        "canons": "canon"
    },
    {
        " in Der Mondfleck , clear ": null
    },
    {
        "waltz": "waltz"
    },
    {
        " rhythms in Serenade , a ": null
    },
    {
        "barcarolle": "barcarolle"
    },
    {
        " , triadic harmony throughout O alter Duft . Pierrot was received by Webern as a direction for the composition of his own Opp. 42–42 most of all with respect to ": null
    },
    {
        "contrapuntal": "counterpoint"
    },
    {
        " procedures . How much I owe to your Pierrot , he wrote Schoenberg upon completing a setting of ": null
    },
    {
        "Georg Trakl": "georg trakl"
    },
    {
        "s Abendland III , Op. 42 No. 42 in which, rather unusually for Webern, there is no silence or rest until a pause at the concluding gesture.     Indeed, a recurring theme of Weberns ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " settings is that of the wanderer, estranged or lost and seeking return to or at least retrieval from an earlier time and place; and of some fifty-six songs on which Webern worked 42–42 he ultimately finished and later published only thirty-two set in order as Opp. 42–42 This wartime theme of wandering in search of home ties in with two intricately involved concerns more broadly evident in Weberns work: first, the death and memory of members of Weberns family, especially his mother but also including his father and a nephew; and second, Weberns broad and complex sense of rural and spiritual  Heimat . Their importance is marked by Weberns stage play, Tot , which, over the course of six alpine scenes of reflection and self-consolation, draws on ": null
    },
    {
        "Emanuel Swedenborg": "emanuel swedenborg"
    },
    {
        "s notion of correspondence to relate and to unite the two concerns, the first embodied but otherworldly and the second concrete if increasingly abstracted and idealized.     The similarities between Tot and Weberns music are striking. In an often programmatic or cinematic fashion, Webern ordered his published movements, themselves dramatic or visual tableaux with melodies that frequently begin and end on weak beats or else settle into ": null
    },
    {
        "ostinati": "ostinato"
    },
    {
        " or the background. In them, tonality — useful for communicating direction and narrative in programmatic pieces — becomes more tenuous, fragmented, static, symbolic, and visual or spatial in function, thus mirroring the concerns and topics, explicit or implicit, of Weberns music and his selections for it from the poetry of ": null
    },
    {
        "Stefan George": "stefan george"
    },
    {
        " and later Georg Trakl.     Weberns ": null
    },
    {
        "dynamics": "dynamics"
    },
    {
        ", ": null
    },
    {
        "orchestration": "orchestration"
    },
    {
        ", and ": null
    },
    {
        "timbre": "timbre"
    },
    {
        " are given so as to produce a fragile, intimate, and often novel sound, despite distinctly recalling ": null
    },
    {
        "Mahler": "gustav mahler"
    },
    {
        ", not infrequently bordering on silence at a typical . In some cases, Weberns choice of instrument in particular functions to represent or to allude to a female voice , to inward or outward luminosity or darkness , or to angels and heaven .                   With the Drei Volkstexte , Op. 42 Webern used Schoenbergs ": null
    },
    {
        "twelve-tone technique": "twelve-tone technique"
    },
    {
        " for the first time, and all his subsequent works used this technique. The String Trio , Op. 42 was both the first purely instrumental work using the twelve-tone technique  and the first cast in a traditional musical form.     Weberns music, like that of both Brahms and Schoenberg, is marked by its emphasis on counterpoint and formal considerations; and Weberns commitment to systematic pitch organization in the twelve-tone method is inseparable from this prior commitment. Weberns ": null
    },
    {
        "tone row": "tone row"
    },
    {
        "s are often arranged to take advantage of internal symmetries; for example, a twelve-tone row may be divisible into four groups of three pitches which are variations, such as ": null
    },
    {
        "inversions": "melodic inversion"
    },
    {
        " and ": null
    },
    {
        "retrogrades": "retrograde"
    },
    {
        ", of each other, thus creating ": null
    },
    {
        "invariance": "invariance"
    },
    {
        ". This gives Weberns work considerable motivic unity, although this is often obscured by the fragmentation of the melodic lines. This fragmentation occurs through octave displacement and by moving the line rapidly from instrument to instrument in a technique referred to as  Klangfarbenmelodie .     Weberns last pieces seem to indicate another development in style. The two late Cantatas, for example, use larger ": null
    },
    {
        "ensembles": "musical ensemble"
    },
    {
        " than earlier pieces, last longer , and are texturally somewhat denser.         In his youth , Webern orchestrated at least five of ": null
    },
    {
        "Franz Schubert": "franz schubert"
    },
    {
        "s various ": null
    },
    {
        "lieder": "lieder"
    },
    {
        ", giving the piano accompaniment to an appropriately Schubertian orchestra of strings and pairs of flutes, oboes, clarinets, bassoons, and horns: Der Vollmond Strahlt auf Bergeshöhn , Tränenregen , Der Wegweiser , Du bist die Ruh , and Ihr Bild ; in 42 he did the same for Schuberts six Deutsche Tänze  of 42     For Schoenbergs ": null
    },
    {
        "Society for Private Musical Performances": "society for private musical performances"
    },
    {
        " in 42 Webern arranged, among other things, the 42  Schatz-Walzer   of ": null
    },
    {
        "Johann Strauss II": "johann strauss ii"
    },
    {
        "s  Der Zigeunerbaron   for string quartet, ": null
    },
    {
        "harmonium": "harmonium"
    },
    {
        ", and piano.     In 42 Webern arranged ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        "s Arbeiterchor  for bass solo, mixed chorus, and large orchestra; it was premièred for the first time in any form on March 42 and 42 42 with Webern conducting the first full-length concert of the Austrian Association of Workers Choir. A review in the Amtliche Wiener Zeitung read neu in jedem Sinne, frisch, unverbraucht, durch ihn zieht die Jugend, die Freude . The text, in English translation, reads in part: Let us have the adorned spades and scoops,/ Come along all, who wield a sword or pen,/ Come here ye, industrious, brave and strong/ All who create things great or small. Liszt, initially inspired by his ": null
    },
    {
        "revolutionary countrymen": "hungarian revolution of 1848"
    },
    {
        ", had left it in manuscript at publisher s discretion.              Webern insisted on lyricism, nuance, ": null
    },
    {
        "rubato": "rubato"
    },
    {
        ", sensitivity, and both emotional and intellectual understanding in performance of music; this is evidenced by anecdotes, correspondence, extant recordings of Schuberts Deutsche Tänze and ": null
    },
    {
        "Berg": "alban berg"
    },
    {
        "s ": null
    },
    {
        "Violin Concerto": "violin concerto"
    },
    {
        " under his direction, many such detailed markings in his scores, and finally by his compositional process as both publicly stated and later revealed in the musical and extramusical metaphors and associations everywhere throughout his sketches. As both a composer and conductor, he was one of many  in a contemporaneous tradition of conscientiously and non-literally handling notated musical figures, phrases, and even entire scores so as to maximize expressivity in performance and to cultivate audience engagement and understanding.     This aspect of Weberns work had been typically missed in his immediate post-war reception, however, even as it may radically affect the musics reception. For example, Boulezs complete recording of Weberns music yielded more to this aesthetic the second time after largely missing it the first; but Eliahu Inbals rendition of Weberns symphony with the ": null
    },
    {
        "hr-Sinfonieorchester": "hr-sinfonieorchester"
    },
    {
        " is still far more within the spirit of the late Romantic performance tradition , nearly slowing to half-tempo for the whole of first movement and taking care to delineate and shape each melodic strand and expressive gesture throughout the entirety of the work.     ": null
    },
    {
        "Günter Wand": "günter wand"
    },
    {
        "s 42 recording of the ": null
    },
    {
        "Cantata": "cantata"
    },
    {
        " No. 42 , Op. 42 with the ": null
    },
    {
        "Symphonieorchester des Bayerischen Rundfunks": "symphonieorchester des bayerischen rundfunks"
    },
    {
        " et al., may likewise be contrasted with both of Boulezs renditions.                 Weberns music began to be performed more widely in the 42s; by the mid42s, its effect was decisive on many composers, even as far-flung as ": null
    },
    {
        "John Cage": "john cage"
    },
    {
        ". In part because Webern had largely remained the most obscure and arcane composer of the ": null
    },
    {
        "Second Viennese School": "second viennese school"
    },
    {
        " during his own lifetime, interest in Weberns music increased after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " as it came to represent a universally or generally valid, systematic, and compellingly logical model of new composition, with his œuvre acquiring what Alex Ross calls a saintly, visionary aura . When Weberns Piano Variations were performed at Darmstadt in 42 young composers listened in a quasi-religious trance. In 42 the second issue of ": null
    },
    {
        "Eimert": "herbert eimert"
    },
    {
        " and ": null
    },
    {
        "Stockhausen": "karlheinz stockhausen"
    },
    {
        "s journal  Die Reihe  was devoted to Weberns œuvre, and in 42 his lectures were published by ": null
    },
    {
        "Universal Edition": "universal edition"
    },
    {
        ".     Meanwhile, Weberns characteristically passionate pan-German nationalism and censurable, sordid political sympathies were not widely known or went unmentioned; perhaps in some part due to his personal and political associations before the German Reich, his degradation and mistreatment under it, and his fate immediately after the war. Significantly as relates to his reception, Webern never compromised his artistic identity and values, as Stravinsky was later to note.     It has been suggested that the early 42s ": null
    },
    {
        "serialists": "serialism"
    },
    {
        " fascination with Webern was concerned not with his music as such so much as enabled by its concision and some its apparent plainness in the score, thereby facilitating musical analysis; indeed, composer ": null
    },
    {
        "Gottfried Michael Koenig": "gottfried michael koenig"
    },
    {
        " speculates on the basis of his personal experience that since Weberns scores represented such a highly concentrated source, they may have been considered the better for didactic purposes than those of other composers. Composer  thus criticized the approach of early serialists to Weberns music as ": null
    },
    {
        "reductive": "reductionism"
    },
    {
        " and narrowly focused on some of Weberns apparent methods rather than on his music more generally, especially neglecting timbre in their typical selection of Opp. 42–42 Composer ": null
    },
    {
        "Karel Goeyvaerts": "karel goeyvaerts"
    },
    {
        " recalled that at least on first impression, the sound of Weberns music reminded him of a ": null
    },
    {
        "Mondrian": "piet mondrian"
    },
    {
        " canvas, explaining that things of which I had acquired an extremely intimate knowledge, came across as crude and unfinished when seen in reality.  Expressing a related opinion, noted contemporaneous German music critic and contributor to  Die Reihe   wrote in the Darmstädter Tagblatt that some of the later and more radical music at Darmstadt was acoustically absurd visually amusing ; several days later, one of his articles in the Der Kurier was similarly headlined Meager modern music—only interesting to look at.      To composers in the then ": null
    },
    {
        "Communist Bloc": "communist bloc"
    },
    {
        " in ": null
    },
    {
        "Central": "central europe"
    },
    {
        " and ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        ", Weberns music and its techniques promised an exciting, unique, and challenging alternative to ": null
    },
    {
        "socialist realism": "socialist realism"
    },
    {
        ", with its perceived tendency to ": null
    },
    {
        "kitsch": "kitsch"
    },
    {
        " and its ": null
    },
    {
        "nationalist": "nationalism"
    },
    {
        " and traditionalist overtones. Whereas Bergs  Lyric Suite  may have influenced the third and fourth string quartets of Bartók in 42 via an ": null
    },
    {
        "ISCM": "iscm"
    },
    {
        " concert , Weberns influence on later composers from what became the ": null
    },
    {
        "Hungarian Peoples Republic": "hungarian peoples republic"
    },
    {
        " and from other countries behind the ": null
    },
    {
        "Iron Curtain": "iron curtain"
    },
    {
        " was sometimes mediated or obstructed by politics. As ": null
    },
    {
        "Ligeti": "györgy ligeti"
    },
    {
        " explained to a student in 42 In countries where there exists a certain isolation, in Eastern Europe, one cannot obtain correct information. One is cut off from the circulation of blood.  Nonetheless, Weberns work was a seminal influence on that of both ": null
    },
    {
        "Endre Szervánszky": "endre szervánszky"
    },
    {
        " and ": null
    },
    {
        "György Kurtág": "györgy kurtág"
    },
    {
        " following the ": null
    },
    {
        "Hungarian Uprising of 42": "hungarian revolution of 1956"
    },
    {
        ", as well as on Ligeti himself. Later still and farther east, ": null
    },
    {
        "Sofia Gubaidulina": "sofia gubaidulina"
    },
    {
        ", for whom music was an escape from the socio-political atmosphere of ": null
    },
    {
        "post-Stalinist": "stalinism"
    },
    {
        " Soviet Russia": "soviet russia"
    },
    {
        ", cited the influence of both ": null
    },
    {
        "J.S. Bach": "j.s. bach"
    },
    {
        " and Webern in particular.  ": null
    }
]