[
    {
        "                  An aperture grille is one of two major technologies used to manufacture color ": null
    },
    {
        "cathode ray tube": "cathode ray tube"
    },
    {
        " television": "television"
    },
    {
        "s and ": null
    },
    {
        "computer display": "computer display"
    },
    {
        "s; the other is the ": null
    },
    {
        "shadow mask": "shadow mask"
    },
    {
        ".     Fine vertical wires behind the front glass of the display screen separate the different colors of ": null
    },
    {
        "phosphor": "phosphor"
    },
    {
        "s into strips. These wires are positioned such that an electron beam from one of three guns at the rear of the tube is only able to strike phosphors of the appropriate color. That is, the blue electron gun will strike blue phosphors, but will find a wire blocks the path to red and green phosphors.     The fine wires allow for a finer dot pitch as they can be spaced much closer together than the perforations of a shadow mask, and there need be no gap between adjacent horizontal pixels.     During the display of bright images, a shadow mask warms, and expands outward in all directions . Aperture grilles do not exhibit this behavior; when the wires heat up, they expand vertically. Because there are no defined holes, this expansion does not affect the image, and the wires do not move horizontally.     The vertical wires of the aperture grille have a resonant frequency and will vibrate in ": null
    },
    {
        "sympathetic resonance": "acoustic resonance"
    },
    {
        " with loud sounds near the display, resulting in fluttering and shimmering of colors on the display. To reduce these resonant effects, one or two horizontal stabilizing wires, called damping wires , are welded across the grille wires, and may be visible as fine dark lines across the face of the screen. These stabilizing wires provide the easiest way to distinguish aperture grille and shadow mask displays at a glance. The stabilized grille can still vibrate but the sounds need to be  the display.     Additionally, aperture grille displays tend to be vertically flat and are often horizontally flat as well, while shadow mask displays usually have a ": null
    },
    {
        "spherical": "spherical"
    },
    {
        " curvature": "curvature"
    },
    {
        ".     The first ": null
    },
    {
        "patent": "patent"
    },
    {
        "ed aperture grille televisions were manufactured by ": null
    },
    {
        "Sony": "sony"
    },
    {
        " in the late 42s under the ": null
    },
    {
        "Trinitron": "trinitron"
    },
    {
        " brand name, which the company carried over to its line of CRT computer monitors. Subsequent designs, whether licensed from Sony or manufactured after the patents expiration, tend to use the -tron suffix, such as ": null
    },
    {
        "Mitsubishi": "mitsubishi"
    },
    {
        "s DiamondTron and ": null
    },
    {
        "ViewSonic": "viewsonic"
    },
    {
        "s SonicTron.     ": null
    },
    {
        "Cromaclear": "cromaclear"
    },
    {
        " is an improvement of the aperture grille technology, pioneered by the ": null
    },
    {
        "NEC Corporation": "nec corporation"
    }
]