[
    {
        "                    The Apollo program, also known as Project Apollo, was the third United States ": null
    },
    {
        "human spaceflight": "human spaceflight"
    },
    {
        " program carried out by the ": null
    },
    {
        "National Aeronautics and Space Administration": "nasa"
    },
    {
        " , which succeeded in landing the first humans on the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " from 42 to 42 First conceived during ": null
    },
    {
        "Dwight D. Eisenhowers administration": "presidency of dwight d. eisenhower"
    },
    {
        " as a three-person spacecraft to follow the one-person ": null
    },
    {
        "Project Mercury": "project mercury"
    },
    {
        " which put the first Americans in space, Apollo was later dedicated to the national goal set by ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " John F. Kennedy": "john f. kennedy"
    },
    {
        " of landing a man on the Moon by the end of this decade and returning him safely to the Earth in an address to ": null
    },
    {
        "Congress": "united states congress"
    },
    {
        " on May 42 42 It was the third US human spaceflight program to fly, preceded by the two-person ": null
    },
    {
        "Project Gemini": "project gemini"
    },
    {
        " conceived in 42 to extend spaceflight capability in support of Apollo.     Kennedys goal was accomplished on the ": null
    },
    {
        "Apollo 42": "apollo 11"
    },
    {
        " mission when astronauts ": null
    },
    {
        "Neil Armstrong": "neil armstrong"
    },
    {
        " and ": null
    },
    {
        "Buzz Aldrin": "buzz aldrin"
    },
    {
        " landed their ": null
    },
    {
        "Apollo Lunar Module": "apollo lunar module"
    },
    {
        " on July 42 42 and walked on the lunar surface, while ": null
    },
    {
        "Michael Collins": "michael collins"
    },
    {
        " remained in ": null
    },
    {
        "lunar orbit": "lunar orbit"
    },
    {
        " in the ": null
    },
    {
        "command and service module": "apollo command and service module"
    },
    {
        " , and all three landed safely on Earth on July 42 Five subsequent Apollo missions also landed ": null
    },
    {
        "astronaut": "astronaut"
    },
    {
        "s on the Moon, the last in December 42 In these six spaceflights, ": null
    },
    {
        "twelve men walked on the Moon": "list of apollo astronautsapollo astronauts who walked on the moon"
    },
    {
        ".           Apollo ran from 42 to 42 with the first crewed flight in 42 It achieved its goal of crewed lunar landing, despite the major setback of a 42 ": null
    },
    {
        "Apollo 42": "apollo 1"
    },
    {
        " cabin fire that killed the entire crew during a prelaunch test. After the first landing, sufficient flight hardware remained for nine follow-on landings with a plan for extended lunar ": null
    },
    {
        "geological": "geology of the moon"
    },
    {
        " and ": null
    },
    {
        "astrophysical": "astrophysics"
    },
    {
        " exploration. Budget cuts forced the cancellation of three of these. Five of the remaining six missions achieved successful landings, but the ": null
    },
    {
        "Apollo 42": "apollo 13"
    },
    {
        " landing was prevented by an oxygen tank explosion in transit to the Moon, which destroyed the service modules capability to provide electrical power, crippling the CSMs propulsion and life support systems. The crew returned to Earth safely by using the lunar module as a lifeboat for these functions. Apollo used ": null
    },
    {
        "Saturn family rockets": "saturn"
    },
    {
        " as launch vehicles, which were also used for an ": null
    },
    {
        "Apollo Applications Program": "apollo applications program"
    },
    {
        ", which consisted of ": null
    },
    {
        "Skylab": "skylab"
    },
    {
        ", a ": null
    },
    {
        "space station": "space station"
    },
    {
        " that supported three crewed missions in 42–42 and the ": null
    },
    {
        "Apollo–Soyuz Test Project": "apollo–soyuz test project"
    },
    {
        ", a joint US-": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " Earth-orbit mission in 42     Apollo set several major ": null
    },
    {
        "human spaceflight milestones": "list of space exploration milestones, 1957–1969"
    },
    {
        ". It stands alone in sending crewed missions beyond ": null
    },
    {
        "low Earth orbit": "low earth orbit"
    },
    {
        ". ": null
    },
    {
        "Apollo 42": "apollo 8"
    },
    {
        " was the first crewed spacecraft to orbit another celestial body, while the final ": null
    },
    {
        "Apollo 42": "apollo 17"
    },
    {
        " mission marked the sixth ": null
    },
    {
        "Moon landing": "moon landing"
    },
    {
        " and the ninth crewed mission beyond low Earth orbit. The program returned  of lunar rocks and ": null
    },
    {
        "soil": "lunar soil"
    },
    {
        " to Earth, greatly contributing to the understanding of the Moons composition and geological history. The program laid the foundation for NASAs subsequent human spaceflight capability and funded construction of its ": null
    },
    {
        "Johnson Space Center": "johnson space center"
    },
    {
        " and ": null
    },
    {
        "Kennedy Space Center": "kennedy space center"
    },
    {
        ". Apollo also spurred advances in many areas of technology incidental to rocketry and ": null
    },
    {
        "human spaceflight": "human spaceflight"
    },
    {
        ", including ": null
    },
    {
        "avionics": "avionics"
    },
    {
        ", telecommunications, and computers.                The Apollo program was conceived during the ": null
    },
    {
        "Eisenhower": "dwight d. eisenhower"
    },
    {
        " administration in early 42 as a follow-up to ": null
    },
    {
        "Project Mercury": "project mercury"
    },
    {
        ". While the Mercury ": null
    },
    {
        "capsule": "space capsule"
    },
    {
        " could support only one astronaut on a limited Earth orbital mission, Apollo would carry three. Possible missions included ferrying crews to a ": null
    },
    {
        "space station": "space station"
    },
    {
        ", ": null
    },
    {
        "circumlunar flight": "circumlunar trajectory"
    },
    {
        "s, and eventual crewed ": null
    },
    {
        "lunar landing": "moon landing"
    },
    {
        "s.     The program was named after ": null
    },
    {
        "Apollo": "apollo"
    },
    {
        ", the Greek god of light, music, and the Sun, by ": null
    },
    {
        "NASA": "nasa"
    },
    {
        " manager ": null
    },
    {
        "Abe Silverstein": "abe silverstein"
    },
    {
        ", who later said, I was naming the spacecraft like Id name my baby. ": null
    },
    {
        "Murray & Cox 42": "murray  &  cox"
    },
    {
        ", p. 42 Silverstein chose the name at home one evening, early in 42 because he felt Apollo riding his chariot across the Sun was appropriate to the grand scale of the proposed program.      In July 42 NASA Deputy Administrator ": null
    },
    {
        "Hugh L. Dryden": "hugh l. dryden"
    },
    {
        " announced the Apollo program to industry representatives at a series of ": null
    },
    {
        "Space Task Group": "space task group"
    },
    {
        " conferences. Preliminary specifications were laid out for a spacecraft with a mission module cabin separate from the command module , and a propulsion and equipment module. On August 42 a feasibility study competition was announced, and on October 42 three study contracts were awarded to ": null
    },
    {
        "General Dynamics/Convair": "convair"
    },
    {
        ", ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        ", and the ": null
    },
    {
        "Glenn L. Martin Company": "glenn l. martin company"
    },
    {
        ". Meanwhile, NASA performed its own in-house spacecraft design studies led by ": null
    },
    {
        "Maxime Faget": "maxime faget"
    },
    {
        ", to serve as a gauge to judge and monitor the three industry designs. ": null
    },
    {
        "Brooks, et al. 42": "brooks, et al."
    },
    {
        ", Chapter 42: . pp. 4242              In November 42 John F. Kennedy was elected president after a campaign that promised American superiority over the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " in the fields of ": null
    },
    {
        "space exploration": "space exploration"
    },
    {
        " and ": null
    },
    {
        "missile defense": "missile defense"
    },
    {
        ". Up to the election of 42 Kennedy had been speaking out against the ": null
    },
    {
        "missile gap": "missile gap"
    },
    {
        " that he and many other senators felt had developed between the Soviet Union and United States due to the inaction of President Eisenhower.  Beyond military power, Kennedy used aerospace technology as a symbol of national prestige, pledging to make the US not first but, first and, first if, but first period . ": null
    },
    {
        "Beschloss 42": "beschloss"
    },
    {
        " Despite Kennedys rhetoric, he did not immediately come to a decision on the status of the Apollo program once he became president. He knew little about the technical details of the space program, and was put off by the massive financial commitment required by a crewed Moon landing. ": null
    },
    {
        "Sidey 42": "sidey"
    },
    {
        ", pp. 42–42 When Kennedys newly appointed NASA Administrator ": null
    },
    {
        "James E. Webb": "james e. webb"
    },
    {
        " requested a 42 percent budget increase for his agency, Kennedy supported an acceleration of NASAs large booster program but deferred a decision on the broader issue. ": null
    },
    {
        "Beschloss 42": "beschloss"
    },
    {
        ", p. 42     On April 42 42 Soviet ": null
    },
    {
        "cosmonaut": "astronautrussian"
    },
    {
        " Yuri Gagarin": "yuri gagarin"
    },
    {
        " became the first person to fly in space, reinforcing American fears about being left behind in a technological competition with the Soviet Union. At a meeting of the US House ": null
    },
    {
        "Committee on Science and Astronautics": "united states house committee on science, space and technology"
    },
    {
        " one day after Gagarins flight, many congressmen pledged their support for a crash program aimed at ensuring that America would catch up. ": null
    },
    {
        "42th Congress 42": "87th congress"
    },
    {
        " Kennedy was circumspect in his response to the news, refusing to make a commitment on Americas response to the Soviets. ": null
    },
    {
        "Sidey 42": "sidey"
    },
    {
        ", p. 42          On April 42 Kennedy sent a memo to ": null
    },
    {
        "Vice President": "vice president of the united states"
    },
    {
        " Lyndon B. Johnson": "lyndon b. johnson"
    },
    {
        ", asking Johnson to look into the status of Americas space program, and into programs that could offer NASA the opportunity to catch up.   . Johnson responded approximately one week later, concluding that we are neither making maximum effort nor achieving results necessary if this country is to reach a position of leadership.   . His memo concluded that a crewed Moon landing was far enough in the future that it was likely the United States would achieve it first.     On May 42 42 twenty days after the first US crewed spaceflight ": null
    },
    {
        "Freedom 42": "mercury-redstone 3"
    },
    {
        ", Kennedy proposed the crewed Moon landing in a Special Message to the Congress on Urgent National Needs:            At the time of Kennedys proposal, only one American had flown in space—less than a month earlier—and NASA had not yet sent an astronaut into orbit. Even some NASA employees doubted whether Kennedys ambitious goal could be met. ": null
    },
    {
        "Murray & Cox 42": "murray  &  cox"
    },
    {
        ", pp. 42–42 By 42 Kennedy even came close to agreeing to a joint US-USSR Moon mission, to eliminate duplication of effort.      With the clear goal of a crewed landing replacing the more nebulous goals of space stations and circumlunar flights, NASA decided that, in order to make progress quickly, it would discard the feasibility study designs of Convair, GE, and Martin, and proceed with Fagets command and service module design. The mission module was determined to be useful only as an extra room, and therefore unnecessary.  They used Fagets design as the specification for another competition for spacecraft procurement bids in October 42 On November 42 42 it was announced that ": null
    },
    {
        "North American Aviation": "north american aviation"
    },
    {
        " had won the contract, although its bid was not rated as good as Martins. Webb, Dryden and ": null
    },
    {
        "Robert Seamans": "robert seamans"
    },
    {
        " chose it in preference due to North Americans longer association with NASA and ": null
    },
    {
        "its predecessor": "national advisory committee for aeronautics"
    },
    {
        ". ": null
    },
    {
        "Brooks, et al. 42": "brooks, et al."
    },
    {
        ", Chapter 42: . pp. 42–42     Landing men on the Moon by the end of 42 required the most sudden burst of technological creativity, and the largest commitment of resources  ever made by any nation in peacetime. At its peak, the Apollo program employed 42 people and required the support of over 42 industrial firms and universities.      On July 42 42 NASA established the ": null
    },
    {
        "Marshall Space Flight Center": "marshall space flight center"
    },
    {
        " in ": null
    },
    {
        "Huntsville, Alabama": "huntsville, alabama"
    },
    {
        ". MSFC designed the heavy lift-class ": null
    },
    {
        "Saturn launch vehicles": "saturn"
    },
    {
        ", which would be required for Apollo.               It became clear that managing the Apollo program would exceed the capabilities of ": null
    },
    {
        "Robert R. Gilruth": "robert r. gilruth"
    },
    {
        "s ": null
    },
    {
        "Space Task Group": "space task group"
    },
    {
        ", which had been directing the nations crewed space program from NASAs ": null
    },
    {
        "Langley Research Center": "langley research center"
    },
    {
        ". So Gilruth was given authority to grow his organization into a new NASA center, the ": null
    },
    {
        "Manned Spacecraft Center": "lyndon b. johnson space center"
    },
    {
        " . A site was chosen in ": null
    },
    {
        "Houston": "houston"
    },
    {
        ", Texas, on land donated by ": null
    },
    {
        "Rice University": "rice university"
    },
    {
        ", and Administrator Webb announced the conversion on September 42 42  It was also clear NASA would soon outgrow its practice of controlling missions from its ": null
    },
    {
        "Cape Canaveral Air Force Station": "cape canaveral air force station"
    },
    {
        " launch facilities in Florida, so a new ": null
    },
    {
        "Mission Control Center": "christopher c. kraft jr. mission control center"
    },
    {
        " would be included in the MSC.           In September 42 by which time two Project Mercury astronauts had orbited the Earth, Gilruth had moved his organization to rented space in Houston, and construction of the MSC facility was under way, Kennedy visited Rice to reiterate his challenge in ": null
    },
    {
        "a famous speech": "we choose to go to the moon"
    },
    {
        ":        The MSC was completed in September 42 It was renamed by the US Congress in honor of Lyndon Johnson soon after his death in 42               It also became clear that Apollo would outgrow the Canaveral launch facilities in Florida. The two newest launch complexes were already being built for the ": null
    },
    {
        "Saturn I": "saturn i"
    },
    {
        " and ": null
    },
    {
        "IB": "saturn ib"
    },
    {
        " rockets at the northernmost end: ": null
    },
    {
        "LC42": "cape canaveral air force station launch complex 34"
    },
    {
        " and ": null
    },
    {
        "LC42": "cape canaveral air force station space launch complex 37"
    },
    {
        ". But an even bigger facility would be needed for the mammoth rocket required for the crewed lunar mission, so land acquisition was started in July 42 for a Launch Operations Center immediately north of Canaveral at ": null
    },
    {
        "Merritt Island": "merritt island, florida"
    },
    {
        ". The design, development and construction of the center was conducted by ": null
    },
    {
        "Kurt H. Debus": "kurt h. debus"
    },
    {
        ", a member of Dr. ": null
    },
    {
        "Wernher von Braun": "wernher von braun"
    },
    {
        "s original ": null
    },
    {
        "V42 rocket": "v-2 rocket"
    },
    {
        " engineering team. Debus was named the LOCs first Director.  Construction began in November 42 Upon Kennedys death, President Johnson issued an executive order on November 42 42 to rename the LOC and Cape Canaveral in honor of Kennedy.           The LOC included ": null
    },
    {
        "Launch Complex 42": "kennedy space center launch complex 39"
    },
    {
        ", a ": null
    },
    {
        "Launch Control Center": "launch control center"
    },
    {
        ", and a 42 million cubic foot ": null
    },
    {
        "Vertical Assembly Building": "vehicle assembly building"
    },
    {
        " in which the space vehicle would be assembled on a ": null
    },
    {
        "Mobile Launcher Platform": "mobile launcher platform"
    },
    {
        " and then moved by a ": null
    },
    {
        "transporter": "crawler-transporter"
    },
    {
        " to one of several launch pads. Although at least three pads were planned, only two, designated AandB, were completed in October 42 The LOC also included an ": null
    },
    {
        "Operations and Checkout Building": "operations and checkout building"
    },
    {
        " to which ": null
    },
    {
        "Gemini": "project gemini"
    },
    {
        " and Apollo spacecraft were initially received prior to being mated to their launch vehicles. The Apollo spacecraft could be tested in two ": null
    },
    {
        "vacuum chamber": "vacuum chamber"
    },
    {
        "s capable of simulating atmospheric pressure at altitudes up to , which is nearly a vacuum.           Administrator Webb realized that in order to keep Apollo costs under control, he had to develop greater project management skills in his organization, so he recruited Dr. ": null
    },
    {
        "George E. Mueller": "george mueller"
    },
    {
        " for a high management job. Mueller accepted, on the condition that he have a say in NASA reorganization necessary to effectively administer Apollo. Webb then worked with Associate Administrator Seamans to reorganize the Office of Manned Space Flight . ": null
    },
    {
        "Johnson 42": "johnson"
    },
    {
        " On July 42 42 Webb announced Muellers appointment as Deputy Associate Administrator for Manned Space Flight, to replace then Associate Administrator ": null
    },
    {
        "D. Brainerd Holmes": "d. brainerd holmes"
    },
    {
        " on his retirement effective September 42 Under Webbs reorganization, the directors of the Manned Spacecraft Center , ": null
    },
    {
        "Marshall Space Flight Center": "marshall space flight center"
    },
    {
        " , and the Launch Operations Center reported to Mueller. ": null
    },
    {
        "Bilstein 42": "bilstein"
    },
    {
        ", . November 42 p. 42     Based on his industry experience on Air Force missile projects, Mueller realized some skilled managers could be found among high-ranking officers in the ": null
    },
    {
        "United States Air Force": "united states air force"
    },
    {
        ", so he got Webbs permission to recruit General ": null
    },
    {
        "Samuel C. Phillips": "samuel c. phillips"
    },
    {
        ", who gained a reputation for his effective management of the ": null
    },
    {
        "Minuteman": "lgm-30 minuteman"
    },
    {
        " program, as OMSF program controller. Phillips superior officer ": null
    },
    {
        "Bernard A. Schriever": "bernard adolph schriever"
    },
    {
        " agreed to loan Phillips to NASA, along with a staff of officers under him, on the condition that Phillips be made Apollo Program Director. Mueller agreed, and Phillips managed Apollo from January 42 until it achieved the first human landing in July 42 after which he returned to Air Force duty.                       Once Kennedy had defined a goal, the Apollo mission planners were faced with the challenge of designing a spacecraft that could meet it while minimizing risk to human life, cost, and demands on technology and astronaut skill. Four possible mission modes were considered:    Lunar Orbit Rendezvous : This turned out to be the winning configuration, which achieved the goal with ": null
    },
    {
        "Apollo 42": "apollo 11"
    },
    {
        " on July 42 42: a single ": null
    },
    {
        "Saturn V": "saturn v"
    },
    {
        " launched a  spacecraft that was composed of a  ": null
    },
    {
        "Apollo command and service module": "apollo command and service module"
    },
    {
        " which remained in orbit around the Moon and a  two-stage ": null
    },
    {
        "Apollo Lunar Module": "apollo lunar module"
    },
    {
        " spacecraft which was flown by two astronauts to the surface, flown back to dock with the command module and was then discarded.  Landing the smaller spacecraft on the Moon, and returning an even smaller part  to lunar orbit, minimized the total mass to be launched from Earth, but this was the last method initially considered because of the perceived risk of rendezvous and docking.    Direct Ascent : The spacecraft would be launched as a unit and travel directly to the lunar surface, without first going into lunar orbit. A  Earth return ship would land all three astronauts atop a  descent propulsion stage, Using the Apollo 42 lunar landers mass ratio of  descent stage to  ascent stage, scaled up to Novas  payload. which would be left on the Moon. This design would have required development of the extremely powerful ": null
    },
    {
        "Saturn C42": "saturn c-8"
    },
    {
        " or ": null
    },
    {
        "Nova": "nova"
    },
    {
        " launch vehicle to carry a  payload to the Moon. Brooks, Grimwood, and Swenson .     Earth Orbit Rendezvous : Multiple rocket launches would carry parts of the Direct Ascent spacecraft and propulsion units for ": null
    },
    {
        "translunar injection": "trans-lunar injection"
    },
    {
        " . These would be assembled into a single spacecraft in Earth orbit.   Lunar Surface Rendezvous: Two spacecraft would be launched in succession. The first, an automated vehicle carrying propellant for the return to Earth, would land on the Moon, to be followed some time later by the crewed vehicle. Propellant would have to be transferred from the automated vehicle to the crewed vehicle. ": null
    },
    {
        "Brooks, et al. 42": "brooks, et al."
    },
    {
        ", Chapter 42: . pp. 4242     In early 42 direct ascent was generally the mission mode in favor at NASA. Many engineers feared that rendezvous and docking, maneuvers which had not been attempted in ": null
    },
    {
        "Earth orbit": "geocentric orbit"
    },
    {
        ", would be nearly impossible in ": null
    },
    {
        "lunar orbit": "lunar orbit"
    },
    {
        ". LOR advocates including ": null
    },
    {
        "John Houbolt": "john houbolt"
    },
    {
        " at Langley Research Center emphasized the important weight reductions that were offered by the LOR approach. Throughout 42 and 42 Houbolt campaigned for the recognition of LOR as a viable and practical option. Bypassing the NASA hierarchy, he sent a series of memos and reports on the issue to Associate Administrator Robert Seamans; while acknowledging that he spoke somewhat as a voice in the wilderness , Houbolt pleaded that LOR should not be discounted in studies of the question. ": null
    },
    {
        "Brooks, et al. 42": "brooks, et al."
    },
    {
        ", Chapter 42: . p. 42        Seamans establishment of an ad-hoc committee headed by his special technical assistant Nicholas E. Golovin in July 42 to recommend a ": null
    },
    {
        "launch vehicle": "launch vehicle"
    },
    {
        " to be used in the Apollo program, represented a turning point in NASAs mission mode decision. ": null
    },
    {
        "Hansen 42": "hansen"
    },
    {
        ", p. 42 This committee recognized that the chosen mode was an important part of the launch vehicle choice, and recommended in favor of a hybrid EOR-LOR mode. Its consideration of LOR—as well as Houbolts ceaseless work—played an important role in publicizing the workability of the approach. In late 42 and early 42 members of the Manned Spacecraft Center began to come around to support LOR, including the newly hired deputy director of the Office of Manned Space Flight, ": null
    },
    {
        "Joseph Shea": "joseph francis shea"
    },
    {
        ", who became a champion of LOR. ": null
    },
    {
        "Hansen 42": "hansen"
    },
    {
        ", pp. 4242 The engineers at Marshall Space Flight Center , which had much to lose from the decision, took longer to become convinced of its merits, but their conversion was announced by Wernher von Braun at a briefing on June 42 42 ": null
    },
    {
        "Brooks, et al. 42": "brooks, et al."
    },
    {
        ", Chapter 42: . pp. 4242     But even after NASA reached internal agreement, it was far from smooth sailing. Kennedys ": null
    },
    {
        "science advisor": "presidents science advisory committee"
    },
    {
        " Jerome Wiesner": "jerome wiesner"
    },
    {
        ", who had expressed his opposition to human spaceflight to Kennedy before the President took office, Levine, Anold S. .  Managing NASA in the Apollo Era, chapter 42 The Lunar Landing Decision and Its Aftermath . NASA SP42 and had opposed the decision to land men on the Moon, hired Golovin, who had left NASA, to chair his own Space Vehicle Panel , ostensibly to monitor, but actually to second-guess NASAs decisions on the Saturn V launch vehicle and LOR by forcing Shea, Seamans, and even Webb to defend themselves, delaying its formal announcement to the press on July 42 42 and forcing Webb to still hedge the decision as tentative . Brooks, Grimwood, and Swenson .     Wiesner kept up the pressure, even making the disagreement public during a two-day September visit by the President to Marshall Space Flight Center . Wiesner blurted out No, thats no good in front of the press, during a presentation by von Braun. Webb jumped in and defended von Braun, until Kennedy ended the squabble by stating that the matter was still subject to final review . Webb held firm and issued a request for proposal to candidate Lunar Excursion Module contractors. Wiesner finally relented, unwilling to settle the dispute once and for all in Kennedys office, because of the Presidents involvement with the October Cuban Missile Crisis , and fear of Kennedys support for Webb. NASA announced the selection of Grumman as the LEM contractor in November 42 Brooks, Grimwood, and Swenson .     Space historian James Hansen concludes that:       The LOR method had the advantage of allowing the lander spacecraft to be used as a lifeboat in the event of a failure of the command ship. Some documents prove this theory was discussed before and after the method was chosen. In 42 an MSC study concluded, The LM .. was finally dropped, because no single reasonable CSM failure could be identified that would prohibit use of the SPS . Letterman, p. 42 . Ironically, just such a failure happened on Apollo 42 when an oxygen tank explosion left the CSM without electrical power. The lunar module provided propulsion, electrical power and life support to get the crew home safely.           thu command module is on exhibit in the Meteor Crater Visitor Center in Winslow, Arizona .     Fagets preliminary Apollo design employed a cone-shaped command module, supported by one of several service modules providing propulsion and electrical power, sized appropriately for the space station, cislunar, and lunar landing missions. Once Kennedys Moon landing goal became official, detailed design began of a command and service Module in which the crew would spend the entire direct-ascent mission and lift off from the lunar surface for the return trip, after being soft-landed by a larger landing propulsion module. The final choice of lunar orbit rendezvous changed the CSMs role to the translunar ferry used to transport the crew, along with a new spacecraft, the Lunar Excursion Module     Source: Apollo by the Numbers: A Statistical Reference ": null
    },
    {
        "Orloff 42": "orloff"
    },
    {
        ", . NASA                 The Apollo program returned over  of lunar rocks and ": null
    },
    {
        "soil": "lunar soil"
    },
    {
        " to the ": null
    },
    {
        "Lunar Receiving Laboratory": "lunar receiving laboratory"
    },
    {
        " in Houston.   Today, 42% of the samples are stored at the ": null
    },
    {
        "Lunar Sample Laboratory Facility": "lunar sample laboratory facility"
    },
    {
        " built in 42      The rocks collected from the Moon are extremely old compared to rocks found on Earth, as measured by ": null
    },
    {
        "radiometric dating": "radiometric dating"
    },
    {
        " techniques. They range in age from about 42 billion years for the ": null
    },
    {
        "basalt": "basalt"
    },
    {
        "ic samples derived from the ": null
    },
    {
        "lunar maria": "lunar mare"
    },
    {
        ", to about 42 billion years for samples derived from the ": null
    },
    {
        "highlands": "lunar highlands"
    },
    {
        " crust. ": null
    },
    {
        "Papike et al. 42": "papike et al."
    },
    {
        ", pp. 4242–4242 As such, they represent samples from a very early period in the development of the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        ", that are largely absent on Earth. One important rock found during the Apollo Program is dubbed the ": null
    },
    {
        "Genesis Rock": "genesis rock"
    },
    {
        ", retrieved by astronauts David Scott and James Irwin during the Apollo 42 mission. This ": null
    },
    {
        "anorthosite": "anorthosite"
    },
    {
        " rock is composed almost exclusively of the calcium-rich feldspar mineral ": null
    },
    {
        "anorthite": "anorthite"
    },
    {
        ", and is believed to be representative of the highland crust. A geochemical component called ": null
    },
    {
        "KREEP": "kreep"
    },
    {
        " was discovered by Apollo 42 which has no known terrestrial counterpart. KREEP and the anorthositic samples have been used to infer that the outer portion of the Moon was once completely molten .     Almost all the rocks show evidence of impact process effects. Many samples appear to be pitted with ": null
    },
    {
        "micrometeoroid": "micrometeoroid"
    },
    {
        " impact craters, which is never seen on Earth rocks, due to the thick atmosphere. Many show signs of being subjected to high-pressure shock waves that are generated during impact events. Some of the returned samples are of impact melt All samples returned from the Moon are highly ": null
    },
    {
        "breccia": "breccia"
    },
    {
        "ted as a result of being subjected to multiple impact events.     Analysis of the composition of the lunar samples supports the ": null
    },
    {
        "giant impact hypothesis": "giant impact hypothesis"
    },
    {
        ", that the Moon was created through impact of a large astronomical body with the Earth. ": null
    },
    {
        "Burrows 42": "burrows"
    },
    {
        ", p. 42         Project Apollo cost $42 billion . United States. Congress. House. Committee on Science and Astronautics. . https://babel.hathitrust.org/cgi/pt?idmdp.42 & view42up & seq42 42 NASA authorization: hearings, Ninety-third Congress, first session, on H.R. 42. Page 42 Washington: U.S. Govt. Print. Off.     Of this amount, $42 billion  was spent on the design, development, and production of the Saturn family of launch vehicles, the Apollo spacecraft, space suits, scientific experiments, and mission operations. The cost of constructing and operating Apollo-related ground facilities, such as the NASA human spaceflight centers and the global tracking and data acquisition network, added an additional $42 billion .     The amount grows to $42 billion  if the costs for related projects such as ": null
    },
    {
        "Project Gemini": "project gemini"
    },
    {
        " and the robotic ": null
    },
    {
        "Ranger": "ranger program"
    },
    {
        ", ": null
    },
    {
        "Surveyor": "surveyor program"
    },
    {
        ", and ": null
    },
    {
        "Lunar Orbiter": "lunar orbiter program"
    },
    {
        " programs are included.      NASAs official cost breakdown, as reported to Congress in the Spring of 42 is as follows:          Accurate estimates of human spaceflight costs were difficult in the early 42s, as the capability was new and management experience was lacking. Preliminary cost analysis by NASA estimated $42 billion - $42 billion for a crewed lunar landing effort. NASA Administrator James Webb increased this estimate to $42 billion before reporting it to Vice President Johnson in April 42      Project Apollo was a massive undertaking, representing the largest research and development project in peacetime. At its peak, it employed over 42 employees and contractors around the country and accounted for more than half of NASAs total spending in the 42s.  It proved unsustainable.     After the first Moon landing, public and political interest waned, including that of President Nixon, who wanted to rein in federal spending.  NASAs budget could not sustain Apollo missions which cost, on average, $42 million  United States. Congress. House. Committee on Science and Astronautics. . https://babel.hathitrust.org/cgi/pt?idmdp.42 & view42up & seq42 42 NASA authorization: hearings, Ninety-third Congress, first session, on H.R. 42. Page 42 Washington: U.S. Govt. Print. Off. each while simultaneously developing the ": null
    },
    {
        "Space Shuttle": "space shuttle"
    },
    {
        ". The final fiscal year of Apollo funding was 42              Looking beyond the crewed lunar landings, NASA investigated several post-lunar applications for Apollo hardware. The Apollo Extension Series  proposed up to 42 flights to Earth orbit, using the space in the ": null
    },
    {
        "Spacecraft Lunar Module Adapter": "apollo spacecraft lunar module adapter"
    },
    {
        " to house a small orbital laboratory . Astronauts would continue to use the CSM as a ferry to the station. This study was followed by design of a larger orbital workshop to be built in orbit from an empty S-IVB Saturn upper stage and grew into the Apollo Applications Program . The workshop was to be supplemented by the ": null
    },
    {
        "Apollo Telescope Mount": "apollo telescope mount"
    },
    {
        ", which could be attached to the ascent stage of the lunar module via a rack.  The most ambitious plan called for using an empty S-IVB as an interplanetary spacecraft for a ": null
    },
    {
        "Venus fly-by mission": "manned venus flyby"
    },
    {
        ".      The S-IVB orbital workshop was the only one of these plans to make it off the drawing board. Dubbed ": null
    },
    {
        "Skylab": "skylab"
    },
    {
        ", it was assembled on the ground rather than in space, and launched in 42 using the two lower stages of a Saturn V. It was equipped with an Apollo Telescope Mount. Skylabs last crew departed the station on February 42 42 and the station itself re-entered the atmosphere in 42      The ": null
    },
    {
        "Apollo-Soyuz Test Project": "apollo-soyuz test project"
    },
    {
        " also used Apollo hardware for the first joint nation space flight, paving the way for future cooperation with other nations in the ": null
    },
    {
        "Space Shuttle": "space shuttle"
    },
    {
        " and ": null
    },
    {
        "International Space Station": "international space station"
    },
    {
        " programs. ": null
    },
    {
        "Bilstein 42": "bilstein"
    },
    {
        ", , pp. 4242               In 42 ": null
    },
    {
        "Japan Aerospace Exploration Agency": "japan aerospace exploration agency"
    },
    {
        "s ": null
    },
    {
        "SELENE": "selene"
    },
    {
        " probe observed evidence of the halo surrounding the Apollo 42 Lunar Module blast crater while orbiting above the lunar surface.      In 42 NASAs ": null
    },
    {
        "robotic": "robotic spacecraft"
    },
    {
        " Lunar Reconnaissance Orbiter": "lunar reconnaissance orbiter"
    },
    {
        ", while orbiting  above the Moon, began photographing the remnants of the Apollo program left on the lunar surface, and photographed each site where crewed Apollo flights landed.   All of the U.S. flags left on the Moon during the Apollo missions were found to still be standing, with the exception of the one left during the Apollo 42 mission, which was blown over during that missions lift-off from the lunar surface and return to the mission Command Module in lunar orbit; the degree to which these flags retain their original colors remains unknown.      In a November 42 42 editorial,  The New York Times  opined:                   The Apollo program has been called the greatest technological achievement in human history.   Apollo stimulated many areas of technology, leading to over 42 spinoff products as of 42  The ": null
    },
    {
        "flight computer": "apollo guidance computer"
    },
    {
        " design used in both the lunar and command modules was, along with the ": null
    },
    {
        "Polaris": "ugm-27 polaris"
    },
    {
        " and ": null
    },
    {
        "Minuteman": "lgm-30 minuteman"
    },
    {
        " missile systems, the driving force behind early research into ": null
    },
    {
        "integrated circuit": "integrated circuit"
    },
    {
        "s . By 42 Apollo was using 42 percent of the United States production of ICs. The crucial difference between the requirements of Apollo and the missile programs was Apollos much greater need for reliability. While the Navy and Air Force could work around reliability problems by deploying more missiles, the political and financial cost of failure of an Apollo mission was unacceptably high.              The crew of Apollo 42 sent the first live televised pictures of the Earth and the Moon back to Earth, and read from the creation story in the ": null
    },
    {
        "Book of Genesis": "book of genesis"
    },
    {
        ", on Christmas Eve 42  An estimated one quarter of the population of the world saw—either live or delayed—the Christmas Eve transmission during the ninth orbit of the Moon, ": null
    },
    {
        "Chaikin 42": "chaikin"
    },
    {
        ", p. 42 and an estimated one fifth of the population of the world watched the live transmission of the Apollo 42 moonwalk. ": null
    },
    {
        "Burrows 42": "burrows"
    },
    {
        ", p. 42     The Apollo program also affected ": null
    },
    {
        "environmental activism": "environmental activism"
    },
    {
        " in the 42s due to photos taken by the astronauts. The most well known include  Earthrise , taken by ": null
    },
    {
        "William Anders": "william anders"
    },
    {
        " on Apollo 42 and  The Blue Marble , taken by the Apollo 42 astronauts. The Blue Marble was released during a surge in environmentalism, and became a symbol of the environmental movement as a depiction of Earths frailty, vulnerability, and isolation amid the vast expanse of space.      According to  The Economist , Apollo succeeded in accomplishing President Kennedys goal of taking on the Soviet Union in the ": null
    },
    {
        "Space Race": "space race"
    },
    {
        " by accomplishing a singular and significant achievement, to demonstrate the superiority of the ": null
    },
    {
        "free-market system": "capitalism"
    },
    {
        ". The publication noted the irony that in order to achieve the goal, the program required the organization of tremendous public resources within a vast, centralized government bureaucracy.               Prior to Apollo 42s 42th anniversary in 42 NASA searched for the original videotapes of the missions live televised moonwalk. After an exhaustive three-year search, it was concluded that the tapes had probably been erased and reused. A new digitally remastered version of the best available broadcast television footage was released instead.              Numerous documentary films cover the Apollo program and the Space Race, including:     Moonwalk One      For All Mankind      Moon Shot    Moon from the BBC miniseries  The Planets     Magnificent Desolation: Walking on the Moon 42D     The Wonder of It All     In the Shadow of the Moon      When We Left Earth: The NASA Missions     Moon Machines     James May on the Moon     NASAs Story     Apollo 42               The Apollo program, or certain missions, have been ": null
    },
    {
        "dramatized": "docudrama"
    },
    {
        " in  Apollo 42  ,  Apollo 42  ,  From the Earth to the Moon  ,  The Dish  ,  Space Race  ,  Moonshot  , and  First Man  .         A fictional ": null
    },
    {
        "horror": "horror film"
    },
    {
        " movie,  Apollo 42 ": null
    }
]