[
    {
        "Arabic names have historically been based on a long naming system. Most ": null
    },
    {
        "Arab": "arab"
    },
    {
        "s have not had ": null
    },
    {
        "given": "given name"
    },
    {
        "/": null
    },
    {
        "middle": "middle name"
    },
    {
        "/": null
    },
    {
        "family name": "family name"
    },
    {
        "s but rather a chain of names. This system remains in use throughout the ": null
    },
    {
        "Arab world": "arab world"
    },
    {
        ".          , is the given name, first name, or personal name; e.g. ": null
    },
    {
        "Ahmad": "ahmad"
    },
    {
        " or ": null
    },
    {
        "Fatimah": "fatimah"
    },
    {
        " . Most Arabic names have meaning as ordinary ": null
    },
    {
        "adjectives": "adjectives"
    },
    {
        " and ": null
    },
    {
        "nouns": "nouns"
    },
    {
        ", and are often aspirational of character. For example,  Muhammad  means Praiseworthy and  Ali  means Exalted or High.     The syntactic context will generally differentiate the name from the noun/adjective. However Arabic newspapers will occasionally place names in brackets, or quotation marks, to avoid confusion.     Indeed such is the popularity of the name Muhammad throughout parts of ": null
    },
    {
        "Africa": "africa"
    },
    {
        ", ": null
    },
    {
        "Arabia": "arabia"
    },
    {
        ", the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ", ": null
    },
    {
        "South Asia": "south asia"
    },
    {
        " and ": null
    },
    {
        "Southeast Asia": "southeast asia"
    },
    {
        ", it is often represented by the abbreviation Md. , Mohd. , Muhd. , or just M. . In India, Pakistan, ": null
    },
    {
        "Bangladesh": "bangladeshi name"
    },
    {
        ", ": null
    },
    {
        "Malaysia": "malaysian names"
    },
    {
        ", Indonesia and the Philippines, due to its almost ubiquitous use as a first name, a person will often be referred to by their second name:   Md. Dinar ibn Raihan   Mohd. Umair Tanvir   Md. Osman             The nasab  is a ": null
    },
    {
        "patronymic": "patronymic"
    },
    {
        " or series of patronymics. It indicates the persons heritage by the word ibn  or ibnat .     ": null
    },
    {
        "Ibn Khaldun": "ibn khaldun"
    },
    {
        "  means son of Khaldun . Khaldun is the fathers personal name or, in this particular case, the name of a remote ancestor.     Several nasab names can follow in a chain to trace a persons ancestry backwards in time, as was important in the ": null
    },
    {
        "tribally": "tribe"
    },
    {
        " based society of the ancient Arabs, both for purposes of identification and for socio-political interactions. Today, however, ibn or bint is no longer used . The plural is  for males and  for females. However,  or  is tribal and encompasses both sexes.        The  laqab  ,  pl. alqāb ; ": null
    },
    {
        "agnomen": "agnomen"
    },
    {
        "; ": null
    },
    {
        "cognomen": "cognomen"
    },
    {
        "; nickname; title, honorific; last name, ": null
    },
    {
        "surname": "surname"
    },
    {
        ", family name. dnsi.co.za/wp-content/uploads/42/42/Hans-Wehr-English-Arabic-Dctionary-Searchable-Format-.pdf The laqab is typically descriptive of the person.     An example is the ": null
    },
    {
        "Abbasid caliph": "abbasid caliphate"
    },
    {
        " Harun al-Rashid": "harun al-rashid"
    },
    {
        " .  is the Arabic version of the name  Aaron  and  means the Rightly-Guided .     In ancient Arab societies, use of a laqab was common, but today is restricted to the surname, or family name, of birth.        The  Nisba   surname could be an everyday name, but is mostly the name of the ancestral tribe, city, country, or any other term used to show relevance. It follows a family through several generations. It most often appears as a demonym .     The laqab and nisbah are similar in use, thus, a name rarely contains both.        A  kunya   Shahpurshah Hormasji Hodivala, Historical Studies in Mug̲h̲al Numismatics, Numismatic Society of India, 42 is a ": null
    },
    {
        "teknonym": "teknonym"
    },
    {
        " in Arabic names. It is a component of an Arabic name, a type of ": null
    },
    {
        "epithet": "epithet"
    },
    {
        ", in theory referring to the bearers first-born son or daughter. By extension, it may also have hypothetical or metaphorical references, e.g. in a  nom de guerre  or a nickname, without literally referring to a son or a daughter. ": null
    },
    {
        "Pedzisai Mashiri": "pedzisai mashiri"
    },
    {
        ", ,  Zambezia , XXVI , pp. 42–42 42 For example, Sabri Khalil al-Banna was known as ": null
    },
    {
        "Abu Nidal": "abu nidal"
    },
    {
        ", father of struggle .     Use of a kunya implies a familiar but respectful setting.     A kunya is expressed by the use of  abū  or  umm  in a ": null
    },
    {
        "genitive construction": "idafah"
    },
    {
        ", i.e. father of or mother of as an ": null
    },
    {
        "honorific": "honorific"
    },
    {
        " in place of or alongside ": null
    },
    {
        "given name": "given name"
    },
    {
        "s in the ": null
    },
    {
        "Arab world": "arab world"
    },
    {
        " and the ": null
    },
    {
        "Islamic world": "islamic world"
    },
    {
        " more generally. Annemarie Schimmel, Islamic Names: An Introduction, Edinburgh University Press, 42 ,      A kunya may also be a nickname expressing the attachment of an individual to a certain thing, as in ": null
    },
    {
        "Abu Bakr": "abu bakr"
    },
    {
        ", father of the camel foal , given because of this persons kindness towards camels.            A common name-form among Arab Muslims is the prefix   combined with the name of ": null
    },
    {
        "Allah": "allah"
    },
    {
        " ,  , or with one of the ": null
    },
    {
        "epithets of Allah": "names of god in islam"
    },
    {
        ".     As a mark of deference,  is usually not conjoined with the prophets names.  Nonetheless such names are accepted in some areas. Its use is not exclusive to Muslims and throughout all Arab countries, the name Abdel-Massih, Servant of Christ , is a common Christian last name.     During the Persian ": null
    },
    {
        "Ghurid dynasty": "ghurid dynasty"
    },
    {
        ", ": null
    },
    {
        "Amir Suri": "amir suri"
    },
    {
        " and his son ": null
    },
    {
        "Muhammad ibn Suri": "muhammad ibn suri"
    },
    {
        " adopted Muslim names despite being non-Muslims. Other non-Muslim peoples, such as the ": null
    },
    {
        "Kalash": "kalash people"
    },
    {
        ", also take names such as Muhammad.       Converts to Islam may often continue using the native non-Arabic non-Islamic names that are without any polytheistic connotation, or association.       To an extent ": null
    },
    {
        "Arab Christians": "arab christians"
    },
    {
        " have names indistinguishable from Muslims, excepting some explicitly Islamic names, e.g. Muhammad. Some common Christian names are:   Arabic versions of Christian names .   Names of ": null
    },
    {
        "Greek": "greek language"
    },
    {
        ", ": null
    },
    {
        "Armenian": "armenian language"
    },
    {
        ", and ": null
    },
    {
        "Aramaic": "aramaic language"
    },
    {
        " or ": null
    },
    {
        "Neo-Aramaic": "neo-aramaic languages"
    },
    {
        " origin.   Use of ": null
    },
    {
        "Europe": "europe"
    },
    {
        "an names, especially ": null
    },
    {
        "French": "french language"
    },
    {
        ", Greek and, to a lesser extent, ": null
    },
    {
        "Spanish": "spanish language"
    },
    {
        " ones . This has been a relatively recent centuries-long convention for Christian Arabs, especially in the ": null
    },
    {
        "Levant": "levant"
    },
    {
        ". For example: ": null
    },
    {
        "Émile Eddé": "émile eddé"
    },
    {
        ", ": null
    },
    {
        "George Habash": "george habash"
    },
    {
        ", ": null
    },
    {
        "Charles Helou": "charles helou"
    },
    {
        ", ": null
    },
    {
        "Camille Chamoun": "camille chamoun"
    },
    {
        ".   Names in honor of Jesus Christ:   :   /     :  /     : Derivations of  :  ,  ,  Anointed and  Infant Christ . The ": null
    },
    {
        "root": "semitic root"
    },
    {
        ", , means to anoint  and is cognate to the ": null
    },
    {
        "Hebrew ": "messiah in judaism"
    },
    {
        ".    is a Christian equivalent to the common Muslim name Abdullah.       Some people, especially in the Arabian Peninsula, when descendant of a famous ancestor, start their last name with Āl family, clan , like the ": null
    },
    {
        "House of Saud": "house of saud"
    },
    {
        "  Āl Ṣaʻūd or ": null
    },
    {
        "Al ash-Sheikh": "al ash-sheikh"
    },
    {
        " . Āl is distinct from the ": null
    },
    {
        "definite article": "al-"
    },
    {
        " . If a reliably-sourced version of the Arabic spelling includes  , then this is  a case of the definite article, so  should be used. Ahl, which has a similar meaning, is sometimes used and should be used if the Arabic spelling is .     Dynasty membership alone does  necessarily imply that the dynastic  is used – e.g. ": null
    },
    {
        "Bashar al-Assad": "bashar al-assad"
    },
    {
        ".             Muḥammad ibn Salmān ibn Amīn al-Farsī     :Ism - Muḥammad    :Nasab - Salmān   :Nasab - Amīn   :Nisbah - al-Farsī .     Muḥammad, son of Salmān, son of Amīn, the Persian     This person would simply be referred to as Muḥammad or by his ": null
    },
    {
        "kunya": "kunya"
    },
    {
        ", which relates him to his first-born son, e.g. Abū Karīm father of Karīm . To signify respect or to specify which Muḥammad one is speaking about, the name could be lengthened to the extent necessary or desired.            Non-Arabic speakers often make these mistakes:   Separating the X of Y word combinations :   With Abdul : Arabic names may be written Abdul , but Abdul means servant of the and is not, by itself, a name. Thus for example, to address Abdul Rahman bin Omar al-Ahmad by his given name, one says Abdul Rahman , not merely Abdul . If he introduces himself as Abdul Rahman , one does not say Mr. Rahman ; instead it would be Mr. al-Ahmad, the latter being the family name.   People not familiar with Arabic ": null
    },
    {
        "sandhi": "sandhi"
    },
    {
        " in iḍāfah: Habībullāh beloved  of  God  ; here a person may in error report the mans name as forename Habib, surname Ullah . Likewise, people may confuse a name such as Jalālu-d-dīn as being Jalal Uddin , or Mr. Uddin , when Uddin is not a surname, but the second half of a two-word name . To add to the confusion, some immigrants to Western countries have adopted Uddin as a surname, although it is grammatically incorrect in Arabic outside the context of the associated first name . Even ": null
    },
    {
        "Indian Muslims": "indian muslims"
    },
    {
        " commit the same error. If a persons name is Abd-ul-Rahim , others may call him Mr. Abdul which would sound quite odd to a native speaker of Arabic.   Not distinguishing  from : Some Muslim names include the Arabic word  . Here, ⟨ʻ⟩ represents the  ayin , a ": null
    },
    {
        "voiced pharyngeal fricative": "voiced pharyngeal fricative"
    },
    {
        ", ⟨ʾ⟩ represents the ": null
    },
    {
        "hamza": "hamza"
    },
    {
        ", a ": null
    },
    {
        "glottal stop": "glottal stop"
    },
    {
        ", and ⟨l⟩ is spelled and pronounced at ordinary length, /l/. In , the l is written twice and pronounced twice as long , as /l/ or /ll/. In Arabic pronunciation,  and  are clearly different. But ": null
    },
    {
        "Europeans": "ethnic groups in europe"
    },
    {
        ", ": null
    },
    {
        "Iranians": "iranian people"
    },
    {
        ", and ": null
    },
    {
        "India": "india"
    },
    {
        "ns may not pronounce some Arabic sounds as a native Arabic speaker would, and thus tend to pronounce them identically. For example, the name   is sometimes misspelled as . There is another name  , which uses both distinctly.   Taking  or  for a middle name: As stated above, these words indicate the order of the family chain. Westerners often confuse them with middle names, especially when theyre written as Ben , as it is the case in some countries. For example, Sami Ben Ahmed would be mistakenly addressed as Mr. Ben Ahmed. To correctly address the person, one should use Mr. Sami Ahmed or Mr. Ahmed.   Grammar: As between all languages, there are differences between Arabic grammar and the grammar of other languages. Arabic forms noun compounds in the opposite order from Indo-Iranian languages, for example. During the war in ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        " in 42 a ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " team found in ": null
    },
    {
        "Kabul": "kabul"
    },
    {
        " an ": null
    },
    {
        "internally displaced person": "internally displaced person"
    },
    {
        " whose name they stated as Allah Muhammad . This may be a misspelling for , for if not, by the rules of Arabic grammar, this name means the Allah who belongs to Muhammad , which would be unacceptable religiously. However, by the rules of ": null
    },
    {
        "Iranian languages": "iranian languages"
    },
    {
        " and most ": null
    },
    {
        "languages of India": "languages of india"
    },
    {
        ", this name does mean Muhammad who belongs to Allah , being the equivalent of the Arabic Muhammadullah . ": null
    },
    {
        "Most Afghans": "demographics of afghanistan"
    },
    {
        " speak Iranian languages. Such Arabo-Iranian or Arabo-Indian mixed-language compound names are not uncommon in Afghanistan, Iran, Pakistan and Tajikistan. There is, for example, the Pakistani/Indian name Allah-Ditta which joins the Arabic Allah with the Punjabi Ditta given .        In Arabic culture, as in many parts of the world, a persons ancestry and family name are very important. An example is explained below.     Assume a man is called Saleh ibn Tariq ibn Khalid al-Fulan.   Saleh is his personal name, and the one that his family and friends would call him by.   ibn translates as son of , so Tariq is Salehs fathers name.   ibn Khalid means that Tariq is the son of Khalid, making Khalid the grandfather of Saleh.   al-Fulan would be Salehs family name.   Hence, Saleh ibn Tariq ibn Khalid al-Fulan translates as Saleh, son of Tariq, son of Khalid; of the family al-Fulan.     The Arabic for daughter of is bint. A woman with the name Fatimah bint Tariq ibn Khalid al-Goswami translates as Fatimah, daughter of Tariq, son of Khalid; of the family al-Goswami.     In this case, ibn and bint are included in the official naming. Most Arab countries today, however, do not use ibn and bint in their naming system. If Saleh were an Egyptian, he would be called Saleh Tariq Khalid al-Fulan and Fatimah would be Fatimah Tariq Khalid al-Goswami.     If Saleh marries a wife , their children will take Salehs family name. Therefore, their son Mohammed would be called Mohammed ibn Saleh ibn Tariq al-Fulan.     However, not all Arab countries use the name in its full length, but conventionally use two- and three-word names, and sometimes four-word names in official or legal matters. Thus the first name is the personal name, the middle name is the fathers name and the last name is the family name.       The Arabic names listed below are used in the Arab world, as well as some other Muslim regions, with correspondent Hebrew, English, ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " and Greek equivalents in many cases. They are not necessarily of Arabic origin, although some are. Most are derived from Syriac transliterations of the Hebrew Bible. For more information, see also Iranian, Malay, Pakistani, and Turkish names.       ? grace  Life ": null
    }
]