[
    {
        "        Aranjuez , also called the Royal Estate of Aranjuez, is a city and municipality, capital of the ": null
    },
    {
        "Las Vegas": "las vegas"
    },
    {
        " district, in the southern part of the ": null
    },
    {
        "Community of Madrid": "community of madrid"
    },
    {
        ", Spain. It is located at the confluence of the ": null
    },
    {
        "Tagus": "tagus"
    },
    {
        " and ": null
    },
    {
        "Jarama": "jarama"
    },
    {
        " rivers,  south of ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ", and  from ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ". , it had a population of 42. It is the 42th-largest city in the ": null
    },
    {
        "Community of Madrid": "community of madrid"
    },
    {
        " and the ": null
    },
    {
        "autonomous community": "municipality of madrid"
    },
    {
        "s largest and most populous urban center outside ": null
    },
    {
        "Greater Madrid Area": "madrid metropolitan area"
    },
    {
        ".     It has been one of the ": null
    },
    {
        "Royal Estates": "patrimonio nacional"
    },
    {
        " of the ": null
    },
    {
        "Crown of Spain": "monarchy of spain"
    },
    {
        " since the times of ": null
    },
    {
        "Philip II": "philip ii of spain"
    },
    {
        " in 42 Until 42 only the royalty and nobility were allowed to dwell in the town.     The Cultural Landscape of Aranjuez was declared a ": null
    },
    {
        "World Heritage Site": "world heritage site"
    },
    {
        " by UNESCO in 42       There are several theories about the origin of the name. The most widely accepted one states that it comes from the ": null
    },
    {
        "Basque language": "basque language"
    },
    {
        ", deriving from arantza . Another theory, attributed to Padre ": null
    },
    {
        "Martín Sarmiento": "martín sarmiento"
    },
    {
        ", a Benedictine scholar who lived about a century after the founder of Aranjuez, ": null
    },
    {
        "Philip II of Spain": "philip ii of spain"
    },
    {
        ", claims the origin to be from ": null
    },
    {
        "Latin": "latin"
    },
    {
        " Ara Jovis or Ara Iovia, which means the ": null
    },
    {
        "altar": "altar"
    },
    {
        " of the Roman god ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " also known as ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        ". However the pre-Roman derivation is generally preferred.     In 42 the area was acquired by the ": null
    },
    {
        "Order of Santiago": "order of santiago"
    },
    {
        ". Ferdinand and Isabella, the ": null
    },
    {
        "Catholic monarchs": "catholic monarchs"
    },
    {
        " , converted Aranjuez into a ": null
    },
    {
        "royal site": "spanish royal sites"
    },
    {
        ". It was the Spring residence of the ": null
    },
    {
        "kings of Spain": "kings of spain"
    },
    {
        " from the late 42th century.     During the reign of ": null
    },
    {
        "Philip II of Spain": "philip ii of spain"
    },
    {
        ", in the second half of the 42th century, the ": null
    },
    {
        "royal palace": "palacio real de aranjuez"
    },
    {
        " was constructed and the name of the enlarged settlement was changed from Alpajes to Aranjuez. The site was initially designed by ": null
    },
    {
        "Juan Bautista de Toledo": "juan bautista de toledo"
    },
    {
        " and completed by ": null
    },
    {
        "Juan de Herrera": "juan de herrera"
    },
    {
        ". The town, or Villa was extensively redesigned in the 42th century by ": null
    },
    {
        "Santiago Bonavía": "santiago bonavía"
    },
    {
        ".            Many significant events occurred here during the ": null
    },
    {
        "Enlightenment in Spain": "enlightenment in spain"
    },
    {
        ":     42: During the reign of ": null
    },
    {
        "Ferdinand VI": "ferdinand vi of spain"
    },
    {
        " the town of Aranjuez, previously ": null
    },
    {
        "reserved": "closed city"
    },
    {
        " for the royal family, nobles of the royal court and palace servants started to be opened as a town with overnight accommodation for visitors, who had previously been obliged to lodge in nearby settlements such as Ocaña. In that year the ": null
    },
    {
        "First Treaty of Aranjuez": "treaty of aranjuez"
    },
    {
        " recognized Austrian and Spanish interests in Italy   42: The ": null
    },
    {
        "weir": "weir"
    },
    {
        " in the ": null
    },
    {
        "Tagus": "tagus"
    },
    {
        " River which is alongside to the Royal Palace of Aranjuez was constructed to power a ": null
    },
    {
        "water wheel": "water wheel"
    },
    {
        " for milling ": null
    },
    {
        "wheat flour": "wheat flour"
    },
    {
        ". Since the mill was visible from the palace, it was architecturally attractive and sometimes used as the residence of the town governor. In the 42th century it was renovated to generate power, and was finally dismantled after a fire about 42 As of 42 only the mill races remained.   42: Queen ": null
    },
    {
        "Barbara de Braganza": "barbara of portugal"
    },
    {
        ", wife of Ferdinand VI, died in Aranjuez   42: King ": null
    },
    {
        "Carlos III": "charles iii of spain"
    },
    {
        " builds the so-called Long Bridge over the river ": null
    },
    {
        "Jarama": "jarama"
    },
    {
        ". This stone construction remains largely intact and now supports the M42 service road about 42  km north of the town.   42: Carlos III, a keen ": null
    },
    {
        "physiocrat": "physiocracy"
    },
    {
        " orders the construction of ": null
    },
    {
        "Real Cortijo de San Isidro": "real cortijo de san isidro"
    },
    {
        ", a ": null
    },
    {
        "model farm": "model farm"
    },
    {
        " which was abandoned by his successor  and later commercialized. The chapel and ": null
    },
    {
        "winery": "winery"
    },
    {
        " remain intact, both of which are national monuments open to the public   42 Carlos III orders the construction of the ": null
    },
    {
        "Franciscan": "franciscan"
    },
    {
        " Convent of San Pascual": "convento de san pascual, aranjuez"
    },
    {
        ", later occupied by the ": null
    },
    {
        "Conceptionists": "conceptionists"
    },
    {
        ". During the time of ": null
    },
    {
        "Francoist Spain": "francoist spain"
    },
    {
        " it served as a ": null
    },
    {
        "womens prison": "incarceration of women"
    },
    {
        ", and is currently a state assisted private church-run primary school. Opposite it he built Hospital San Carlos   42 ": null
    },
    {
        "Isabella Farnese": "isabella farnese"
    },
    {
        ", wife of ": null
    },
    {
        "Philip V of Spain": "philip v of spain"
    },
    {
        " and mother of Carlos III, who contributed greatly to the towns development, died in Aranjuez   42: The French architect ": null
    },
    {
        "Jaime Marquet": "jaime marquet"
    },
    {
        " began construction of the theatre Coliseo Carlos III, recently restored and reopened as Theatro Carlos III in 42   42: In the ": null
    },
    {
        "42rd Treaty of Aranjuez": "treaty of aranjuez"
    },
    {
        " France and Spain define their colonies in Santo Domingo   42: Spain becomes involved in the War of Independence of the United States by virtue of the ": null
    },
    {
        "42rd Treaty of Aranjuez": "treaty of aranjuez"
    },
    {
        " 42th Treaty of Aranjuez": "treaty of aranjuez"
    },
    {
        ", cedes Spanish territories in Africa to Morocco   42 in the ": null
    },
    {
        "42th Treaty of Aranjuez": "treaty of aranjuez"
    },
    {
        ", publicly confirms the secret ": null
    },
    {
        "Third Treaty of San Ildefonso": "third treaty of san ildefonso"
    },
    {
        " in which Spain returned the colonial territory of ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        " to France.    ": null
    },
    {
        "Mutiny of Aranjuez": "mutiny of aranjuez"
    },
    {
        ". An uprising on 42 March 42 when the royal family and the government were staying at Aranjuez while on their way south, anticipating a French invasion from the north. Soldiers, peasants and members of the general public assaulted ": null
    },
    {
        "Godoys": "manuel godoy"
    },
    {
        " quarters and captured him. The mutineers made King Charles dismiss Godoy, and two days later the court forced the King himself to abdicate in favor of his son and rival, who became Ferdinand VII.   42 Queen ": null
    },
    {
        "Isabella II of Spain": "isabella ii of spain"
    },
    {
        " acceded to the throne and finally Aranjuez was reached by a railway line to ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        " in 42 . This was the second railway line in Spain, after that of ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        "-": null
    },
    {
        "Mataró": "mataró"
    },
    {
        " .     In 42 ": null
    },
    {
        "Joaquín Rodrigo": "joaquín rodrigo"
    },
    {
        " composed the  Concierto de Aranjuez , which would make Aranjuez famous all over the world.                  The city was declared ": null
    },
    {
        "Conjunto Histórico-Artístico": "conjunto histórico-artístico"
    },
    {
        " in 42 In 42 ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " listed the Aranjuez ": null
    },
    {
        "Cultural landscape": "cultural landscape"
    },
    {
        " as a ": null
    },
    {
        "World Heritage Site": "unesco world heritage"
    },
    {
        ".       This was the first extension beyond the ": null
    },
    {
        "Royal Palace": "palacio real de aranjuez"
    },
    {
        ", along the south bank of the river ": null
    },
    {
        "Tagus": "tagus"
    },
    {
        " . The royal ": null
    },
    {
        "Church of San Antonio": "church of san antonio"
    },
    {
        " which was built by ": null
    },
    {
        "Philip IV of Spain": "philip iv of spain"
    },
    {
        " for both public and ": null
    },
    {
        "ceremonial": "military parade"
    },
    {
        " royal use, stands at the southern end of Plaza San Antonio popularly known as  Mariblanca , .          A bullring, one of the earliest in Spain, the original was built in 42 by order of ": null
    },
    {
        "King Charles IV": "charles iv of spain"
    },
    {
        ", the refurbished structure was opened by his wife, ": null
    },
    {
        "Maria Luisa of Parma": "maria luisa of parma"
    },
    {
        ", on 42 May 42 It had a capacity of 42 spectators at a time when the population, according to the ": null
    },
    {
        "then prime minister": "manuel godoy, prince of the peace"
    },
    {
        ", was only 42 There are twelve public entrances which lead to three circular galleries, each with 42 stone seating benches. Royalty and their guests enjoyed a private entrance with stairs leading directly to the royal box.     Following a fire in 42 ": null
    },
    {
        "King Ferdinand VII": "ferdinand vii of spain"
    },
    {
        " had it rebuilt and donated it to the town, which installed a small museum              Sights in the city include many buildings in addition to the 42th century Royal Palace and church mentioned above:   House of Trades and Knights   House of Infantes and Atarfe   Pleasure craft Museum   Farmhands House   House of Employees    Alpajes Church   ": null
    },
    {
        "Saint Pascuals Royal Convent": "saint pascuals royal convent"
    },
    {
        " Charles IIIs": "charles iii of spain"
    },
    {
        " Royal Theatre   Supply Market   Plaza de Toros and ": null
    },
    {
        "Bullfighting": "bullfighting"
    },
    {
        " Museum Una Gran Fiesta   Medinaceli Palace   Governors House   Mother Queens old garage, today cultural centre Isabel de Farnesio   Typical corralas   Godoy and Osuna Palaces   Silvelas Palace   Royal Country Estate of Saint Isidro            Numerous parks and gardens are open to the public   Isle Garden – to the north of the palace, bordered by the river and a broad irrigation canal   Parterre Garden The formal garden and fountains in front of the palace and to the north of Mariblanca/San Isadro   Princes Garden Along the river to the east, bordered by Calle de la Reina   Isabella IIs Garden a small formal garden adjacent to Mariblanca/San Isidro   Historical thickets and woodlands   Centre of Interpretation of the Natural Reserve El Regajal-Mar de Ontígola   Tree-lined walks and rides through the former nursery gardens at Doce Calles                  The city of Aranjuez is governed by a single municipal authority, which, for convenience divides into the several administrative districts which in turn may contain residential estates :   Centro, includes the royal sites, the bullring and the historic town center, with central market and shopping   Vergel – Olivas,   Polígono de Las Aves, to the west near the railway station, near Pirelli & Jardín Narváez   Nuevo Aranjuez, to the south, on higher ground   Foso – Moreras associated with Garden City of Agfa, and ambitious, but as yet incomplete project   Urbanización Mirador de Aranjuez A vast, mostly failed house-building project on a steep southerly slope overlooking the old town.   La Montaña – new district of about 42 homes about north of the town. It has the district Hospital-Tajo, a 42-star Hotel-Barcelo with spa and 42-hole golf-course, Gran-Casino, La Finca event venue, a vast commercial centre and car-park which was built but never opened, and a business campus Centro Empresial which contains the small-business support unit APME, a substantial supermarket and a few small businesses. Various shops are to be found elsewhere about the barrio. The residents Association is known as Asociación de Vecinos del Barrio de la Montaña or AVBM.   Cortijo de San Isidro, a small residential settlement around a former royal hunting lodge, a volunteer sub-council represents residents interests.       The main pillars of the local economy are hotels and tourism. Aranjuez has always been an attractive city for tourists with its Royal Palace , the gardens , the Tagus river and the landscapes. In 42 this city was designated as a World Heritage Cultural landscape by UNESCO , and since then, tourism has kept on increasing until hit by the 42 recession. Prior to 42 much money was spent in order to beautify Aranjuez and many pubs and restaurants were opened .       This was a pharonic proyecto de Actuación Urbanística  of some 42 mixed open market homes  of which, by 42 something around one fifth were actually sold. The remainder are now owned by the bad bank SAREB   In 42 a major events and gambling installation Gran Casino was opened in the barrio Montaña near the existing conference centers of La Finca and Hotel Occidental Aranjuez . Nearby, the ambitious Plaza commercial center, built but not fitted, has never opened, and the smaller enterprise center, although open, contains a local supermarket, two cafés an English Academy and less than a dozen other small businesses. Finally, in March 42 the University Hospital Tajo was opened. In 42 this hospital, together with several others medical facilities in the Community of Madrid was threatened with privatisation, provoking considerable public protest known as the Marea Blanca .       Aranjuez is located on the fertile plain in the deep, high sided valley of the river Tagus , whose rich soil is suitable for growing wheat and other cereals . There are also horticultural plantations , notably of asparagus and strawberries but also vineyard s and extensive production of melons . Typical of the neighbouring region of Castilla-La Mancha Aranjuez and the Vega del Tajo also produce a wide variety of products such as sorghum , sunflower s, potatoes, tomatoes, artichoke s, beets and Jalapeño peppers.     The Real Cortijo de San Isidro is a settlement about 42  km north of Aranjuez where King Charles III of Spain established a royal farm in 42 exploiting existing agricultural land. There is a village with a royal chapel and a wine cellar       The proximity to Madrid and the good communications by road and rail made Aranjuez a suitable location for industry: detergents , Mechanical engineering, computer and electrical material, photographic materials, pharmaceutical products, paint s and varnish es, sugar refineries, and oil mills.     The majority of the industries are located to the west of the railway station or in the Gonzalo Chacón industrial park , in the south. The main existing industries are:     Indra Sistemas .   , part of grupo Espacio Industrial.   Bosch .   Carburos Metálicos Medical & industrial gasses and chemicals.   FYSE Pharmaceuticals, a division of / Ercros Industrial S.A.   Cortefiel , a garment logistics facility for a retail company marketing brands such as Springfield, womensecret, Fifty Factory, Antonio Miró Studio and Pedro del Hierro Fashion   part of grupo Imesapi   Previous industrial activities now reduced, mothballed or closed included   Lever Brothers   ISN trailer manufacture & precision plastics for transport industry   Embalajes Castro S.A. Wooden crate manufacturer & general packaging specialists   Near the station there is also extensive unused railway sidings, warehouses and a sugar refining plant all presumably abandoned in the early part of the 42th century Proposals for rehabilitation of this zone as a rail to road container port are currently under consideration.   Agfa film: ECESA , S.A.created in 42 reformed in 42 as E.A.S.A. but made few films. In 42     ": null
    }
]