[
    {
        "               Archibald Campbell Tait  was an ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        " in the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ".            Born in ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", Scotland, the son of Craufurd Tait and Susan née Campbell Tait was educated at the ": null
    },
    {
        "Royal High School": "royal high school"
    },
    {
        " and at the ": null
    },
    {
        "Edinburgh Academy": "edinburgh academy"
    },
    {
        ", where he was twice elected dux. His parents were ": null
    },
    {
        "Presbyterian": "presbyterian"
    },
    {
        "s but he early turned towards the ": null
    },
    {
        "Scottish Episcopal Church": "scottish episcopal church"
    },
    {
        ". He was confirmed in his first year at Oxford, having entered ": null
    },
    {
        "Balliol College": "balliol college, oxford"
    },
    {
        " in October 42 as a ": null
    },
    {
        "Snell Exhibitioner": "snell exhibitioner"
    },
    {
        " from the ": null
    },
    {
        "University of Glasgow": "university of glasgow"
    },
    {
        ". He won an open scholarship, took his degree with a first-class in  literis humanioribus  in 42 and became a fellow and tutor of Balliol. He was ordained deacon in 42 and priest in 42 and served a curacy at Baldon.     Rapid changes among the fellows found him, at age 42 the senior and most responsible of the four Balliol tutors.  The experience gained during this period stood him in good stead afterwards as a member of the first Oxford University Commission . He never sympathised with the principles of the ": null
    },
    {
        "Oxford Movement": "oxford movement"
    },
    {
        " and, on the appearance of ": null
    },
    {
        "Tract XC": "tract xc"
    },
    {
        " in 42 he drafted the famous protest of the Four Tutors against it; but this was his only important contribution to the controversy. On the other hand, although his sympathies were on the whole with the liberal movement in the university, he never took a lead in the matter.     In 42 he became an undistinguished but useful successor to Arnold as headmaster of ": null
    },
    {
        "Rugby School": "rugby school"
    },
    {
        " ; and a serious illness in 42 the first of many, led him to welcome the comparative leisure that followed upon his appointment to the deanery of ": null
    },
    {
        "Carlisle": "carlisle, cumbria"
    },
    {
        " in 42 His life there, however, was one of no little activity; he served on the University Commission, he restored his cathedral, and he did much excellent pastoral work. There, too, he suffered the great sorrow of his life. He had married Catharine Spooner at Rugby in 42 In 42 within five weeks, five of their children died due to virulent scarlet fever.     Not long afterwards, he was consecrated ": null
    },
    {
        "Bishop of London": "bishop of london"
    },
    {
        " on 42 November 42 at the ": null
    },
    {
        "Chapel Royal": "chapel royal"
    },
    {
        ", ": null
    },
    {
        "Whitehall": "whitehall"
    },
    {
        ", by ": null
    },
    {
        "John Bird Sumner": "john bird sumner"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        ", as successor to ": null
    },
    {
        "Charles James Blomfield": "charles james blomfield"
    },
    {
        ". His translation to Canterbury in 42 constituted a recognition of his work but made no break in it. His last years were interrupted by illness and saddened by the death in 42 of his only son, Craufurd , and of his wife, Catharine née Spooner .          If Blomfield had almost remodelled the idea of a bishops work, his successor surpassed him. Tait had all Blomfields earnestness and his powers of work, with far wider interests. Blomfield had given himself zealously to the work of church-building; Tait followed in his steps by inaugurating the Bishop of Londons Fund. He devoted a very large part of his time at London in actual evangelistic work; and, to the end, his interest in the pastoral side of the work of the clergy was greater than anything else. With his wife, he was instrumental in organising womens work upon a sound basis, and he did not a little for the healthful regulation of Anglican sisterhoods during the formative period in which this was particularly necessary. Nor was he less successful in the larger matters of administration and organisation, which brought into play his sound practical judgment and strong common-sense. He was constant in his attendance in parliament and spared no pains in pressing on measures of practical utility. The modification of the terms of clerical subscription , the new ": null
    },
    {
        "lectionary": "lectionary"
    },
    {
        " , the Burials Act were largely owing to him; for all of them, and especially the last, he incurred much obloquy at the time.       With regard to the liberal trend in modern thought, he was in sympathy with it. His object in dealing with questions of faith, as in dealing with the ritual question, was primarily a practical one: he wished to secure peace and obedience to the law as he saw it. Consequently, after his sympathies had led him to express himself favourably towards some movement, he frequently found himself compelled to draw back.     He expressed a qualified sympathy with some of the writers of  Essays and Reviews  and then joined in the censure of it by the bishops . The same kind of apparent vacillation was found in his action in other cases; e.g., in the case of ": null
    },
    {
        "John William Colenso": "john william colenso"
    },
    {
        " and in the controversy as to the use or disuse of the ": null
    },
    {
        "Athanasian symbol": "athanasian creed"
    },
    {
        " . It was naturally and widely misunderstood. Some who did not know him thought, or pretended to think, that he was a ": null
    },
    {
        "Socinian": "socinian"
    },
    {
        " or a free-thinker. The world at large knew better; but even ": null
    },
    {
        "Frederick Temple": "frederick temple"
    },
    {
        " warned him, in the case of Essays and Reviews, You will not keep friends if you compel them to feel that in every crisis of life they must be on their guard against trusting you.             As regards ": null
    },
    {
        "the Catholic revival": "oxford movement"
    },
    {
        ", Tait was concerned with it during the whole of his episcopate and, above all, on the issue of ": null
    },
    {
        "ritualism": "ritualism in the church of england"
    },
    {
        ", on which it naturally came into most direct conflict with the recognised ecclesiastical practice of the day. He had to deal with the St Georges-in-the-East riots, in 42 and the troubles at ": null
    },
    {
        "St Albans, Holborn": "st albans, holborn"
    },
    {
        ", in their earlier stages ; he took part as assessor in the ": null
    },
    {
        "Privy Council": "privy council of the united kingdom"
    },
    {
        " judgment in the Ridsdale case ; he was more closely concerned than any other bishop with the agitation against confession in 42 and again in 42     His method throughout was the same: he endeavoured to obtain a compliance to the law as declared by the courts; failing this, he made the most earnest efforts to secure obedience to the ruling of the Ordinary for the sake of the peace of the Church; after this, he could do nothing. He did not perceive how much of reason the ": null
    },
    {
        "ritualist": "ritualist"
    },
    {
        "s had on their side: that they were fighting for practices which, they contended, were covered by the letter of the rubric; and that, where rubrics were notoriously disregarded on all hands, it was not fair to proceed against one class of delinquent only. In fact, if others were inclined to ignore it altogether, Tait could hardly realise anything but the connection between the English Church and the State. From such a position there seemed to be no escape but in legislation for the deprivation of the recalcitrant clergy; and the ": null
    },
    {
        "Public Worship Regulation Act 42": "public worship regulation act 1874"
    },
    {
        " was the result.        For this Tait was by no means responsible as a whole: some of the provisions which proved most irksome were the result of amendments by ": null
    },
    {
        "Lord Shaftesbury": "anthony ashley cooper, 7th earl of shaftesbury"
    },
    {
        " which the bishops were unable to resist; and it must be borne in mind that the most disastrous results of the measure were not contemplated by those who were instrumental in passing it. The results followed inevitably: clergy were cited before a new tribunal, and not only deprived but imprisoned. A widespread feeling of indignation spread not only among ": null
    },
    {
        "High Church": "high church"
    },
    {
        "men, but among many who cared little or nothing for the ritual practices involved; and it seemed impossible to foretell what the outcome would be. But the aged archbishop was moved as much as anybody, and tried hard to mitigate such a state of things.     At length, when the Rev. ": null
    },
    {
        "AH Mackonochie": "alexander heriot mackonochie"
    },
    {
        " was on the point of being deprived of his benefice of St. Albans, ": null
    },
    {
        "Holborn": "holborn"
    },
    {
        ", for ": null
    },
    {
        "contumacy": "contumacy"
    },
    {
        ", the archbishop, then on his deathbed at ": null
    },
    {
        "Addington Palace": "addington palace"
    },
    {
        ", took steps which resulted in the carrying out of an exchange of benefices , which removed him from the jurisdiction of the court. This proved to be the turning-point; and although the ritual difficulty by no means ceased, it was afterwards dealt with from a different point of view, and the ": null
    },
    {
        "Public Worship Regulation Act": "public worship regulation act"
    },
    {
        " became practically obsolete.       Archbishop Tait died on the first day of ": null
    },
    {
        "Advent": "advent"
    },
    {
        " in 42 at ": null
    },
    {
        "Addington, London": "addington, london"
    },
    {
        ".   Tait was a Churchman by conviction; but, although the work of his life was all done in England, he remained a Scotsman to the end. It was the opinion of some that he never really understood the historical position of the English Church and took no pains to learn. ": null
    },
    {
        "John Tillotson": "john tillotson"
    },
    {
        ", one of his predecessors in the archbishopric, was a favourie hero of his, and in some ways the two men resembled one another. Tait had none of Tillotsons gentleness, and he rode roughshod over the obstacles in his way. He cannot be called a great ecclesiastical statesman, but he administered his office well and was undoubtedly one of the foremost public men of his day.       After his death, a stone monument and bronze bust were erected in Edinburgh, on the site of the house in which he was born, between the University of Edinburghs McEwan Hall and Reid Concert Hall.          ": null
    }
]