[
    {
        "   Ardashir II , was the eleventh king  of the ": null
    },
    {
        "Sasanian Empire": "sasanian empire"
    },
    {
        ", ruling from 42 to 42 He was the brother of his predecessor, ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        " , under whom he had served as governor-king of ": null
    },
    {
        "Nodardashiragan": "adiabene"
    },
    {
        ", where he fought alongside his brother against the ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        ". Ardashir II was appointed as his brothers successor to rule interimly till the latters son ": null
    },
    {
        "Shapur III": "shapur iii"
    },
    {
        " reached adulthood. Ardashir IIs short reign was largely uneventful, with the Sasanians trying to defuse instability in ": null
    },
    {
        "Armenia": "kingdom of armenia"
    },
    {
        ".     Ardashir II was seemingly a strong-willed character, and is known in some sources by the epithet of nihoukar .       Ardashir is the ": null
    },
    {
        "New Persian": "new persian"
    },
    {
        " form of the ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " name Ardašīr/Ardašēr , which is ultimately from ": null
    },
    {
        "Old Iranian": "old iranian"
    },
    {
        " Artaxšaθra- , equivalent to ": null
    },
    {
        "Greek": "ancient greek"
    },
    {
        " Artaxérxēs , and ": null
    },
    {
        "Armenian": "old armenian language"
    },
    {
        " Artašēs . The name means whose rule is through truth .       Ardashir was the son of shah ": null
    },
    {
        "Hormizd II": "hormizd ii"
    },
    {
        " , who was killed by the Iranian nobility whilst hunting. He was succeeded by ": null
    },
    {
        "Adur Narseh": "adur narseh"
    },
    {
        ", who, after a brief reign which only lasted a few months, was too killed by the nobles, who then proceeded to blind the second, and imprison the third . Ardashirs infant half-brother ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        ", who was only slightly older than him, was crowned as king by the nobles so that they could gain greater control of the empire, which they were able to do until Shapur II reached his majority at the age of 42     Ardashir, before becoming king of the Sasanian Empire, was governor-king of ": null
    },
    {
        "Nodardashiragan": "adiabene"
    },
    {
        " from 42 to 42 It is believed that during his tenure he took part in the defense of the Sasanian Empire with Shapur when it was ": null
    },
    {
        "invaded": "julians persian war"
    },
    {
        " by the Roman Emperor ": null
    },
    {
        "Julian": "julian"
    },
    {
        " . In 42 Shapur II designated Ardashir as his successor, and made him vow to abdicate when Shapurs son, ": null
    },
    {
        "Shapur III": "shapur iii"
    },
    {
        " reached adulthood. This led to some Armenian writers to wrongly state that Ardashir was Shapurs son.       During his reign as shah of the Sasanian Empire, events in ": null
    },
    {
        "Armenia": "kingdom of armenia"
    },
    {
        " seemed to occupy Ardashirs attention. The son of ": null
    },
    {
        "Arshak II": "arshak ii"
    },
    {
        ", ": null
    },
    {
        "Pap": "pap of armenia"
    },
    {
        ", had been murdered during Shapurs reign and the Romans had replaced him with a certain ": null
    },
    {
        "Varazdat": "varazdat"
    },
    {
        " who was a member of the ": null
    },
    {
        "Arsacid": "arsacid dynasty of armenia"
    },
    {
        " family. However, real power was in the hands of ": null
    },
    {
        "Mushegh I Mamikonian": "mushegh i mamikonian"
    },
    {
        ", a noble in the Armenian court. Mushegh was suspected of having conspired with the Emperor of Rome and was murdered by Varasdates. This act roused the indignation of Musheghs brother ": null
    },
    {
        "Manuel": "manuel mamikonian"
    },
    {
        " who rebelled against Varasdates and with the support of Iran deposed him and placed upon the Armenian throne ": null
    },
    {
        "Zarmandukht": "zarmandukht"
    },
    {
        ", the widow of Papas who was the mother of ": null
    },
    {
        "Arshak III": "arshak iii"
    },
    {
        " and Papas son, who made Manuel the  sparapet  . In return for their services, Manuel allowed the Iranians to maintain a garrison in Armenia.     But this arrangement did not work for long. A nobleman named Merujan wrongly informed Manuel that the ": null
    },
    {
        "commandant": "commandant"
    },
    {
        " of the Iranian garrison desired to capture him. Enraged, Manuel fell upon the ten thousand Iranian soldiers stationed in Armenia and murdered them. But Manuel died soon afterwards and confusion followed. Desirous of maintaining peace in the borderlands, the Roman Emperor ": null
    },
    {
        "Theodosius I": "theodosius i"
    },
    {
        " and Ardashir decided upon a treaty. But Ardashir was killed in 42 by the Iranian nobility before the treaty could be signed. The reason behind his murder was due to his continuation of Shapurs policy of restricting the authority of power-hungry nobles. Nevertheless, the treaty was the eventually signed and ": null
    },
    {
        "ratified": "ratified"
    },
    {
        " by his nephew and successor ": null
    },
    {
        "Shapur III": "shapur iii"
    },
    {
        " in 42 Ardashir was survived by his daughter ": null
    },
    {
        "Zruanduxt": "zruanduxt"
    },
    {
        ", who married the King ": null
    },
    {
        "Khosrov IV of Armenia": "khosrov iv of armenia"
    },
    {
        ". Faustus of Byzantium, .          The ": null
    },
    {
        "coins": "sasanian coinage"
    },
    {
        " minted under Ardashir imitates him wearing the same dome-shaped crown worn by the first Sasanian shah, ": null
    },
    {
        "Ardashir I": "ardashir i"
    },
    {
        " . The reverse shows the traditional ": null
    },
    {
        "fire altar": "fire altar"
    },
    {
        " flanked by two attendants, but in some cases also shows the shahs head appearing from the fire, which may symbolize the royal ": null
    },
    {
        "xwarra": "khvarenah"
    },
    {
        " . The inscription of his coins are usually Ardashir, king of kings of the ": null
    },
    {
        "Iranians": "iran"
    },
    {
        " whilst rare instances of and of ": null
    },
    {
        "non-Iranians": "aniran"
    },
    {
        " also being part of the inscription.          Ardashir, like his forefathers, also had himself memorialized on reliefs. However, instead of using the sites of ": null
    },
    {
        "Pars": "pars"
    },
    {
        "  as a place for his relief, he instead had a relief carved in ": null
    },
    {
        "Taq-e Bostan": "taq-e bostan"
    },
    {
        " in the province of ": null
    },
    {
        "Media": "media"
    },
    {
        " . The relief shows three standing figures wearing ": null
    },
    {
        "regalia": "regalia"
    },
    {
        "; Ardashir being in the middle, flanked by two male figures. The figure to the right, who is giving the ": null
    },
    {
        "diadem": "diadem"
    },
    {
        " to Ardashir originally used to recognized as the ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " supreme god ": null
    },
    {
        "Ahura Mazda": "ahura mazda"
    },
    {
        ", but is now agreed to be Shapur II due to the style of his crown, and which also fits well due to Shapur being the one designating Ardashir as shah to begin with.     The two shahs are standing on the body of a fallen enemy, unmistakably a Roman, whose crown indicates that he is an emperor. The fallen figure is most likely supposed to represent the Roman emperor ": null
    },
    {
        "Julian": "julian"
    },
    {
        ", who invaded Iran in 42 and was ": null
    },
    {
        "killed": "battle of samarra"
    },
    {
        " west of the Sasanian capital of ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ". The figure standing to the far left, perceived by some to be the Zoroastrian prophet ": null
    },
    {
        "Zoroaster": "zoroaster"
    },
    {
        ", is most likely the angelic ": null
    },
    {
        "divinity": "divinity"
    },
    {
        " Mithra": "mithra"
    },
    {
        ". He is wearing a crown embellished with twelve rays of the sun, whilst holding a raised ": null
    },
    {
        "barsom": "barsom"
    },
    {
        ", thus sanctifying the investiture.": null
    }
]