[
    {
        "In ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        "s ": null
    },
    {
        "legendarium": "tolkiens legendarium"
    },
    {
        ", Arda is the name given to the ": null
    },
    {
        "Earth": "earth"
    },
    {
        " in an imaginary period of prehistory, wherein the places mentioned in  The Lord of the Rings  and related material once existed. It included several seas and oceans, and the continents of ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        ", the ": null
    },
    {
        "Dark Land": "dark land"
    },
    {
        "s, ": null
    },
    {
        "Aman": "aman"
    },
    {
        " , the island of ": null
    },
    {
        "Númenor": "númenor"
    },
    {
        ", and other unknown lands left largely unnamed by Tolkien.          Arda was part of ": null
    },
    {
        "Eä": "eä"
    },
    {
        ", the universe of all which exists. Arda was created, together with the rest of Eä, through the ": null
    },
    {
        "Music of the Ainur": "ainulindalë"
    },
    {
        " for the ": null
    },
    {
        "Children of Ilúvatar": "children of ilúvatar"
    },
    {
        " . Arda was considered Earth itself.     Because the Sun, Moon, stars, and other objects orbited the planet in the ": null
    },
    {
        "cosmology": "middle-earth cosmology"
    },
    {
        " of Middle-earth they were considered part of Arda, leading to Arda sometimes being called the Solar System of Middle-earth. The term for the Earth itself, excluding these celestial bodies, was Ambar or Imbar.     Originally the Earth was flat, the continents were surrounded by a mighty ": null
    },
    {
        "ocean": "ocean"
    },
    {
        " , ": null
    },
    {
        "Ekkaia": "ekkaia"
    },
    {
        " or Vaiya, the Encircling Sea. The central and western continents - respectively ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        " and ": null
    },
    {
        "Aman": "aman"
    },
    {
        " - were separated by ": null
    },
    {
        "Belegaer": "belegaer"
    },
    {
        ", also called the Great Sea and the Sundering Seas. In the ": null
    },
    {
        "First Age": "first age"
    },
    {
        ", the area in the northwest of Middle-earth was occupied by the large region of ": null
    },
    {
        "Beleriand": "beleriand"
    },
    {
        ", but this was mostly destroyed and submerged in the ": null
    },
    {
        "War of Wrath": "war of wrath"
    },
    {
        " at the end of that Age.     There was also a separate continent south and east of Middle-earth called the ": null
    },
    {
        "Dark Land": "dark land"
    },
    {
        ". Another separate continent to the east of Middle-earth was the relatively small ": null
    },
    {
        "Land of the Sun": "land of the sun"
    },
    {
        ", so called because when the world was flat the ": null
    },
    {
        "Gates of the Sun": "minor places in ardag"
    },
    {
        " were near there, and it would be scorched. Information regarding both was vague.     Most of Tolkiens stories take place in the north-west region of the continent of Middle-earth, also called the Hither Lands. Other regions included ": null
    },
    {
        "Harad": "harad"
    },
    {
        ", though Harad means South and while properly used for the region immediately south of ": null
    },
    {
        "Gondor": "gondor"
    },
    {
        " and ": null
    },
    {
        "Mordor": "mordor"
    },
    {
        " was often loosely used to refer to every land to the south. There were many stretches of sun-scorched desert in Near Harad, but there was supposedly a jungle beyond it which few had ever ventured to, from which the great ": null
    },
    {
        "Oliphaunt": "oliphaunt"
    },
    {
        "s were found. Men of Far Harad are also described as being black skinned. The vast lands of the East were collectively referred to as ": null
    },
    {
        "Rhûn": "rhûn"
    },
    {
        ", though this may have only referred to those immediately east of the ": null
    },
    {
        "Sea of Rhûn": "sea of rhûn"
    },
    {
        " and ": null
    },
    {
        "River Running": "river running"
    },
    {
        ". The ": null
    },
    {
        "Easterlings": "easterlings"
    },
    {
        ", like the Haradrim, were a diverse collection of many races. There was even less knowledge of the extreme eastern end of Middle-earth, where the land was supposed to stop at another sea. It is known that in ancient times the great chain of the ": null
    },
    {
        "Red Mountains": "orocarni"
    },
    {
        " ran north to south near here, and was roughly analogous to the ": null
    },
    {
        "Blue Mountains": "ered luin"
    },
    {
        " of the west . The race of Elves originated near here, though their original home of ": null
    },
    {
        "Cuiviénen": "cuiviénen"
    },
    {
        " no longer existed by the ": null
    },
    {
        "Third Age": "third age"
    },
    {
        ". It is not known if the Red Mountains survived into the Third Age, either intact or in some reduced form . It is said that the ": null
    },
    {
        "Blue Wizards": "blue wizards"
    },
    {
        " went far into the east of Rhûn and beyond to stir up rebellions against ": null
    },
    {
        "Sauron": "sauron"
    },
    {
        " in the lands he held sway over, though the tales of these struggles never reached the west in detail.     In the ": null
    },
    {
        "Second Age": "second age"
    },
    {
        ", Númenor was raised in the Great Sea for the ": null
    },
    {
        "Edain": "edain"
    },
    {
        ". This island existed through most of the Second Age, but was destroyed as a result of the ": null
    },
    {
        "pride": "pride"
    },
    {
        " of the Númenórean people in defying the Ban of the ": null
    },
    {
        "Valar": "vala"
    },
    {
        " and sailing to Aman in the west.     After the ": null
    },
    {
        "destruction of Númenor": "akallabêth"
    },
    {
        ", Arda was made round. Aman was taken out of the world, and could only be reached by the ": null
    },
    {
        "Elves": "elf"
    },
    {
        ", following the straight road that was granted to them. As Aman was taken away from Arda, new lands and continents were created east and west of Middle-earth.       Tolkien derived the ": null
    },
    {
        "Quenya": "quenya"
    },
    {
        " word Arda from prehistoric ": null
    },
    {
        "Elvish": "elvish languages"
    },
    {
        " gardā, Quenya regularly losing initial G and shortening long final vowels. The term basically meant any more or less bounded or defined place, a region . Its use as a proper name for the World was due to ": null
    },
    {
        "Valarin": "valarin"
    },
    {
        " Aþāraphelūn .  This word from ": null
    },
    {
        "Valarin": "valarin"
    },
    {
        " was said to mean appointed dwelling, referring to the Earth as the abode of the Valar and/or Elves and Men.  A common noun arda realm turns up in Tolkiens writings on Elvish from the 42s,  but there is not yet any hint that he conceived it as a Quenya name of the world. This seems to be a later usage in the real and the imaginary timeline alike.          In Tolkiens conception, Arda , was created specifically as the Habitation  for the ": null
    },
    {
        "Children of Ilúvatar": "children of ilúvatar"
    },
    {
        " . It is envisaged in a ": null
    },
    {
        "flat Earth": "flat earth"
    },
    {
        " cosmology, with the sun, moon and stars revolving around it. Tolkiens sketches show a disc-like face for the world which looked up to the stars.   However, Tolkiens legendarium addresses the ": null
    },
    {
        "spherical Earth": "spherical earth"
    },
    {
        " paradigm by depicting a catastrophic transition from a flat to a spherical world, in which Aman was removed from the circles of the world .     The  Akallabêth  says that the Númenóreans who survived the catastrophe sailed as far west as they could in search of their ancient home, but their travels only brought them around the world back to their starting points. Hence, before the end of the Second Age, the transition from flat Earth to round Earth had been completed. New lands were also created in the west, analogous to the ": null
    },
    {
        "New World": "new world"
    },
    {
        ".     Tolkien wrote that Middle-earth or Endor originally conformed to a largely symmetrical scheme that was marred by ": null
    },
    {
        "Melkor": "morgoth"
    },
    {
        ". The various conflicts with Melkor resulted in the shapes of the lands being distorted.     Originally, Arda began as a single flat world and the Valar created ": null
    },
    {
        "two lamps": "two lamps"
    },
    {
        " to illuminate it, Illuin and Ormal. The Vala ": null
    },
    {
        "Aulë": "aulë"
    },
    {
        " forged great towers, Helcar in the furthest north, and Ringil in the deepest south. Illuin was set upon Helcar and Ormal upon Ringil. In the middle, where the light of the lamps mingled, the Valar dwelt at the island of ": null
    },
    {
        "Almaren": "almaren"
    },
    {
        " in the midst of a Great Lake.   When Melkor destroyed the Lamps of the Valar, two vast inland seas and two major seas were created, but Almaren and its lake were destroyed.     The Valar left Middle-earth and went to the newly formed continent of Aman in the west, where they created their home called ": null
    },
    {
        "Valinor": "valinor"
    },
    {
        ". To discourage Melkor from assailing Aman, they thrust the continent of Middle-earth to the east, thus widening Belegaer at its middle and raising five major mountain ranges in Middle-earth which adopted a relatively symmetrical distribution, namely the Blue, Red, Grey, Yellow Mountains and the Mountains of the Wind. This act, however, ruined the symmetry of the shape of the continents and their intervening seas.     A few years after publishing The Lord of the Rings, in a note associated with the unique narrative story ": null
    },
    {
        "Athrabeth Finrod ah Andreth": "athrabeth finrod ah andreth"
    },
    {
        " , Tolkien equated Arda with the Solar System; because Arda by this point consisted of more than one heavenly body .           The original world as built by the ": null
    },
    {
        "Valar": "vala"
    },
    {
        " is called Arda Unmarred . This world was effectively destroyed by the wars of the Valar and ": null
    },
    {
        "Melkor": "morgoth"
    },
    {
        ", and only ": null
    },
    {
        "Valinor": "valinor"
    },
    {
        " still resembled it in part. Arda Unmarred was a flat symmetrical world with everlasting light.       Arda Marred  is the name given to the world as it is: the world after the wars of the Valar and Melkor, and the dispersing of Melkors fëa in the entire world. It is this world from which are formed the hröa of the ": null
    },
    {
        "Children of Ilúvatar": "children of ilúvatar"
    },
    {
        ", and therefore it is at times a cruel and evil world with plagues, extreme colds, heat, and other concepts which do not exist in Arda Unmarred.     Arda Marred also broke the design of Elvish immortality: in Arda Marred, Elves slowly fade, until at last they are naught but wraiths. Only in Valinor was this fading delayed, which is one reason all Elves had no choice but to go to Valinor in the end. One of the special abilities of the ": null
    },
    {
        "Rings of Power": "rings of power"
    },
    {
        " was that they could delay time, and as such were used by ": null
    },
    {
        "Elrond": "elrond"
    },
    {
        " and ": null
    },
    {
        "Galadriel": "galadriel"
    },
    {
        " to preserve their realms. After the loss of the ": null
    },
    {
        "One Ring": "one ring"
    },
    {
        ", the Elves had no choice left, and therefore in the ": null
    },
    {
        "Fourth Age": "fourth age"
    },
    {
        ", the last Eldar either left for Valinor or faded to shadows of their former selves.       After the ": null
    },
    {
        "Dagor Dagorath": "dagor dagorath"
    },
    {
        ", a new world will then be created, which will be Arda Healed . This world will resemble Arda Unmarred, except superior, since it will also incorporate all the good aspects of Arda Marred.     ": null
    },
    {
        "Galadriel": "galadriel"
    },
    {
        "s words while parting with ": null
    },
    {
        "Treebeard": "treebeard"
    },
    {
        " at ": null
    },
    {
        "Isengard": "isengard"
    },
    {
        " in  The Return of the King  are Not in ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        ", nor until the lands that lie under ": null
    },
    {
        "the wave": "belegaer"
    },
    {
        " are lifted up again. Then in the willow-meads of ": null
    },
    {
        "Tasarinan": "tasarinan"
    },
    {
        " we may meet in the spring. Farewell! . This might imply that ": null
    },
    {
        "Beleriand": "beleriand"
    },
    {
        " will be recovered after the Dagor Dagorath. It is however unknown, since Arda Healed will contain all the good things of Arda Marred, whether ": null
    },
    {
        "Númenor": "númenor"
    }
]