[
    {
        "                    Ares  is the ": null
    },
    {
        "Greek god": "list of greek mythological figures"
    },
    {
        " of war": "war god"
    },
    {
        ". He is one of the ": null
    },
    {
        "Twelve Olympians": "twelve olympians"
    },
    {
        ", the son of ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " and ": null
    },
    {
        "Hera": "hera"
    },
    {
        ". ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        ", Theogony 921 ;  Iliad , 5.890–896. By contrast, Aress Roman counterpart ": null
    },
    {
        "Mars": "mars"
    },
    {
        " was born from ": null
    },
    {
        "Juno": "juno"
    },
    {
        " alone, according to ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " . In ": null
    },
    {
        "Greek literature": "ancient greek literature"
    },
    {
        ", he often represents the physical or violent and untamed aspect of war, in contrast to his sister, the armored ": null
    },
    {
        "Athena": "athena"
    },
    {
        ", whose functions as a ": null
    },
    {
        "goddess of intelligence": "knowledge deity"
    },
    {
        " include ": null
    },
    {
        "military strategy": "military strategy"
    },
    {
        " and ": null
    },
    {
        "generalship": "general officer"
    },
    {
        ". ": null
    },
    {
        "Walter Burkert": "walter burkert"
    },
    {
        ", Greek Religion , pp. 141; William Hansen, Classical Mythology: A Guide to the Mythical World of the Greeks and Romans , p. 113.     The Greeks were ": null
    },
    {
        "ambivalent": "wiktionary:ambivalentenglish"
    },
    {
        " toward Ares: although he embodied the physical valor necessary for success in war, he was a dangerous force, overwhelming, insatiable in battle, destructive, and man-slaughtering. Burkert, Greek Religion, p. 169. His sons ": null
    },
    {
        "Phobos": "phobos"
    },
    {
        " and ": null
    },
    {
        "Deimos": "deimos"
    },
    {
        " and his lover, or sister, ": null
    },
    {
        "Enyo": "enyo"
    },
    {
        " accompanied him on his war ": null
    },
    {
        "chariot": "chariot"
    },
    {
        ". Burkert, Greek Religion, p.169. In the  Iliad , his father Zeus tells him that he is the god most hateful to him.  Iliad  5.890–891. An association with Ares endows places and objects with a savage, dangerous, or militarized quality. Hansen, Classical Mythology, pp. 114–115. His value as a war god is placed in doubt: during the ": null
    },
    {
        "Trojan War": "trojan war"
    },
    {
        ", Ares was on the losing side, while Athena, often depicted in ": null
    },
    {
        "Greek art": "ancient greek art"
    },
    {
        " as holding ": null
    },
    {
        "Nike ": "nike"
    },
    {
        " in her hand, favoured the triumphant Greeks.     Ares plays a relatively limited role in ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        " as represented in literary narratives, though his numerous love affairs and abundant offspring are often ": null
    },
    {
        "alluded": "allusion"
    },
    {
        " to. Hansen, Classical Mythology, pp. 113–114; Burkert, Greek Religion, p. 169. When Ares does appear in myths, he typically faces humiliation. Hansen, Classical Mythology, pp. 113–114. See for instance ": null
    },
    {
        "Ares and the giants": "aresares and the giants"
    },
    {
        " below. He is well known as the lover of ": null
    },
    {
        "Aphrodite": "aphrodite"
    },
    {
        ", the goddess of love, who was married to ": null
    },
    {
        "Hephaestus": "hephaestus"
    },
    {
        ", god of craftsmanship. In the Iliad, however, the wife of Hephaestus is Charis, Grace, as noted by Burkert, Greek Religion, p. 168. The most famous story related to Ares and Aphrodite shows them exposed to ridicule through the wronged husbands device.  Odyssey  8.266–366; Hansen, Classical Mythology, pp. 113–114.     The counterpart of Ares among the ": null
    },
    {
        "Roman gods": "list of roman deities"
    },
    {
        " is ": null
    },
    {
        "Mars": "mars"
    },
    {
        ", Larousse Desk Reference Encyclopedia, ": null
    },
    {
        "The Book People": "the book people"
    },
    {
        ", Haydock, 1995, p. 215. who as a father of the Roman people was given a more important and dignified place in ": null
    },
    {
        "ancient Roman religion": "religion in ancient rome"
    },
    {
        " as a ": null
    },
    {
        "guardian deity": "tutelary deity"
    },
    {
        ". During the ": null
    },
    {
        "Hellenization": "hellenization"
    },
    {
        " of ": null
    },
    {
        "Latin literature": "latin literature"
    },
    {
        ", the myths of Ares were ": null
    },
    {
        "reinterpreted": "interpretatio graeca"
    },
    {
        " by Roman writers under the name of Mars. Greek writers under ": null
    },
    {
        "Roman rule": "roman empire"
    },
    {
        " also recorded ": null
    },
    {
        "cult practices": "cult"
    },
    {
        " and beliefs pertaining to Mars under the name of Ares. Thus in the ": null
    },
    {
        "classical tradition": "classical mythology"
    },
    {
        " of later ": null
    },
    {
        "Western art and literature": "western culture"
    },
    {
        ", the mythology of the two figures later became virtually indistinguishable.       The etymology of the name Ares is traditionally connected with the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " word  , the ": null
    },
    {
        "Ionic": "ionic greek"
    },
    {
        " form of the ": null
    },
    {
        "Doric": "doric greek"
    },
    {
        "  , bane, ruin, curse, imprecation .  , Georg Autenrieth, A Homeric Dictionary.  marnamaiHarvardsee ": null
    },
    {
        "Pelopponesian War": "pelopponesian war"
    },
    {
        "or which one1985Ed.191111th ed.1994Ornithes Areioiii.382ff and 1031ff; ": null
    },
    {
        "Hyginus": "gaius julius hyginus"
    },
    {
        ", Fabulae 30.       Although Ares received occasional sacrifice from armies going to war, the god had a formal temple and cult at only a few sites. Burkert, Greek Religion, p. 170. At ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        ", however, each company of youths sacrificed a puppy to ": null
    },
    {
        "Enyalios": "enyalios"
    },
    {
        " before engaging in ritual fighting at the Phoebaeum. The ": null
    },
    {
        "chthonic": "chthonic"
    },
    {
        " night-time sacrifice of a dog to Enyalios became assimilated to the cult of Ares.      Just east of Sparta stood an archaic statue of Ares in chains, to show that the spirit of war and victory was to be kept in the city.     The ": null
    },
    {
        "Temple of Ares": "temple of ares"
    },
    {
        " in the ": null
    },
    {
        "agora": "ancient agora of athens"
    },
    {
        " of ": null
    },
    {
        "Athens": "athens"
    },
    {
        ", which ": null
    },
    {
        "Pausanias": "pausanias"
    },
    {
        " saw in the second century AD, had been moved and rededicated there during the time of ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        ". Essentially, it was a ": null
    },
    {
        "Roman temple": "roman temple"
    },
    {
        " to the Augustan ": null
    },
    {
        "Mars Ultor": "mars ultor"
    },
    {
        ". From archaic times, the ": null
    },
    {
        "Areopagus": "areopagus"
    },
    {
        ", the mount of Ares at some distance from the Acropolis, was a site of trials. ": null
    },
    {
        "Paul the Apostle": "paul the apostle"
    },
    {
        " later preached about Christianity there. Its connection with Ares, perhaps based on a false etymology, is ": null
    },
    {
        "etiological myth": "etiology"
    },
    {
        ". A second temple to Ares has been located at the archaeological site of ": null
    },
    {
        "Metropolis": "metropolis"
    },
    {
        " in what is now Western ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ".        ": null
    },
    {
        "Deimos": "deimos"
    },
    {
        " , and ": null
    },
    {
        "Phobos": "phobos"
    },
    {
        " , are his companions in war. Iliad 4.436f, and 13.299f ": null
    },
    {
        "Hesiods": "hesiod"
    },
    {
        "  Shield of Heracles 191, 460; Quintus Smyrnaeus , 10.51, etc. According to Hesiod , they were also his children, born to him by Aphrodite . Hesiod, ": null
    },
    {
        "Theogony": "theogony"
    },
    {
        " 934f. Eris , the goddess of discord, or Enyo , the goddess of war, bloodshed, and violence, was considered the sister and companion of the violent Ares. In at least one tradition, Enyalius, rather than another name for Ares, was his son by Enyo. Eustathius on Homer, 944     Ares may also be accompanied by Kydoimos , the demon of the din of battle; the Makhai ; the Hysminai ; Polemos , a minor spirit of war, or only an epithet of Ares, since it has no specific dominion; and Polemoss daughter, Alala , the goddess or personification of the Greek war-cry, whose name Ares uses as his own war-cry. Aress sister Hebe also draws baths for him.     According to Pausanias , local inhabitants of Therapne , Sparta , recognized Thero , feral, savage, as a nurse of Ares. Pausanias , Description of Greece, 3. 19. 7  – 8       thu as viewed from the Acropolis .     The union of Ares and Aphrodite created the gods Eros , Anteros , Phobos , Deimos , Harmonia , and Adrestia . While Eross and Anteross godly stations favored their mother, Adrestia preferred to emulate her father, often accompanying him to war. Other versions include Alcippe as one of his daughters.     Upon one occasion, Ares incurred the anger of Poseidon by slaying his son, Halirrhothius , because he had raped Alcippe, a daughter of the war-god. For this deed, Poseidon summoned Ares to appear before the tribunal of the Olympic gods, which was held upon a hill in Athens. Ares was acquitted. This event is supposed to have given rise to the name Areopagus , which afterward became famous as the site of a court of justice. Berens, E.M.: Myths and Legends of Ancient Greece and Rome, page 113. Project Gutenberg, 2007.     Accounts tell of Cycnus of Macedonia , a son of Ares who was so murderous that he tried to build a temple with the skulls and the bones of travellers. Heracles slaughtered this abominable monstrosity, engendering the wrath of Ares, whom the hero wounded in conflict. ": null
    },
    {
        "Bibliotheca": "bibliotheca"
    },
    {
        " 2. 5. 11 & 2. 7. 7               ;Homeric Hymn 8 to Ares     : Ares, exceeding in strength, chariot-rider, golden-helmed, doughty in heart, shield-bearer, Saviour of cities, harnessed in bronze, strong of arm, unwearying, mighty with the spear, O defence of Olympus, father of warlike Victory, ally of Themis, stern governor of the rebellious, leader of righteous men, sceptred King of manliness, who whirl your fiery sphere among the planets in their sevenfold courses through the aether wherein your blazing steeds ever bear you above the third firmament of heaven; hear me, helper of men, giver of dauntless youth! Shed down a kindly ray from above upon my life, and strength of war, that I may be able to drive away bitter cowardice from my head and crush down the deceitful impulses of my soul. Restrain also the keen fury of my heart which provokes me to tread the ways of blood-curdling strife. Rather, O blessed one, give you me boldness to abide within the harmless laws of peace, avoiding strife and hatred and the violent fiends of death.     ;Orphic Hymn 65 to Ares     : To Ares, Fumigation from Frankincense . Magnanimous, unconquered, boisterous Ares, in darts rejoicing, and in bloody wars; fierce and untamed, whose mighty power can make the strongest walls from their foundations shake: mortal-destroying king, defiled with gore, pleased with wars dreadful and tumultuous roar. Thee human blood, and swords, and spears delight, and the dire ruin of mad savage fight. Stay furious contests, and avenging strife, whose works with woe embitter human life; to lovely Kyrpis and to Lyaios yield, for arms exchange the labours of the field; encourage peace, to gentle works inclined, and give abundance, with benignant mind.           One of the roles of Ares was expressed in mainland Greece as the founding myth of Thebes: Ares was the progenitor of the water-dragon slain by Cadmus , for the dragons teeth were sown into the ground as if a crop and sprang up as the fully armored autochthon ic Spartoi . Cadmus placed himself in the gods service for eight years atoning for the crime of killing Ares’ dragon. Roman, L., & Roman, M. . To propitiate Ares, Cadmus took as a bride Harmonia , a daughter of Aress union with Aphrodite. In this way, Cadmus harmonized all strife and founded the city of Thebes. Burkert, Greek Religion, p.169.     thu , Roman version of a Greek original c. 320 BC, with 17th-century restorations by Bernini       thu   In the tale sung by the bard in the hall of Alcinous , ": null
    },
    {
        "Odyssey": "odyssey"
    },
    {
        " 8.300 the Sun-god Helios once spied Ares and Aphrodite enjoying each other secretly in the hall of Hephaestus , her husband. He reported the incident to Hephaestus. Contriving to catch the illicit couple in the act, Hephaestus fashioned a finely-knitted and nearly invisible net with which to snare them. At the appropriate time, this net was sprung, and trapped Ares and Aphrodite locked in very private embrace.     But Hephaestus was not satisfied with his revenge, so he invited the Olympian gods and goddesses to view the unfortunate pair. For the sake of modesty, the goddesses demurred, but the male gods went to witness the sight. Some commented on the beauty of Aphrodite, others remarked that they would eagerly trade places with Ares, but all who were present mocked the two. Once the couple was released, the embarrassed Ares returned to his homeland, Thrace, and Aphrodite went to Paphos.     In a much later interpolated detail, Ares put the young soldier Alectryon by his door to warn them of Helioss arrival as Helios would tell Hephaestus of Aphrodites infidelity if the two were discovered, but Alectryon fell asleep on guard duty. Helios discovered the two and alerted Hephaestus. The furious Ares turned the sleepy Alectryon into a rooster which now always announces the arrival of the sun in the morning.       In one archaic myth, related only in the Iliad by the goddess Dione to her daughter Aphrodite, two chthonic giants, the Aloadae , named Otus and Ephialtes, threw Ares into chains and put him in a bronze urn, where he remained for thirteen months, a lunar year . And that would have been the end of Ares and his appetite for war, if the beautiful Eriboea, the young giants stepmother, had not told Hermes what they had done, she related. Iliad 5.385–391. In this one suspects a festival of licence which is unleashed in the thirteenth month.     Ares was held screaming and howling in the urn until Hermes rescued him, and Artemis tricked the Aloadae into slaying each other. In Nonnus s ": null
    },
    {
        "Dionysiaca": "dionysiaca"
    },
    {
        " Nonnus, Dionysiaca 18. 274 ff; Ares also killed Ekhidnades, the giant son of Echidna , and a great enemy of the gods. Scholars have not concluded whether the nameless Ekhidnades was entirely Nonnuss invention or not.     Iliad": null
    },
    {
        "Iliad": "iliad"
    }
]