[
    {
        "                 Aristotle  was a Greek ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        " and ": null
    },
    {
        "polymath": "polymath"
    },
    {
        " during the ": null
    },
    {
        "Classical period": "classical greece"
    },
    {
        " in ": null
    },
    {
        "Ancient Greece": "ancient greece"
    },
    {
        ". He was the founder of the ": null
    },
    {
        "Lyceum": "lyceum"
    },
    {
        " and the ": null
    },
    {
        "Peripatetic school": "peripatetic school"
    },
    {
        " of philosophy and ": null
    },
    {
        "Aristotelian": "aristotelianism"
    },
    {
        " tradition. Along with his teacher ": null
    },
    {
        "Plato": "plato"
    },
    {
        ", he has been called the Father of ": null
    },
    {
        "Western Philosophy": "western philosophy"
    },
    {
        " . His writings cover many subjects – including ": null
    },
    {
        "physics": "physics"
    },
    {
        ", ": null
    },
    {
        "biology": "biology"
    },
    {
        ", ": null
    },
    {
        "zoology": "zoology"
    },
    {
        ", ": null
    },
    {
        "metaphysics": "metaphysics"
    },
    {
        ", ": null
    },
    {
        "logic": "logic"
    },
    {
        ", ethics, ": null
    },
    {
        "aesthetics": "aesthetics"
    },
    {
        ", ": null
    },
    {
        "poetry": "poetics"
    },
    {
        ", theatre, music, ": null
    },
    {
        "rhetoric": "rhetoric"
    },
    {
        ", ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", ": null
    },
    {
        "economics": "economics"
    },
    {
        ", ": null
    },
    {
        "politics": "politics"
    },
    {
        " and government. Aristotle provided a complex synthesis of the various philosophies existing prior to him, and it was above all from his teachings that the West inherited its intellectual ": null
    },
    {
        "lexicon": "lexicon"
    },
    {
        ", as well as problems and methods of inquiry. As a result, his philosophy has exerted a unique influence on almost every form of knowledge in the West and it continues to be a subject of contemporary philosophical discussion.     Little is known about his life. Aristotle was born in the city of ": null
    },
    {
        "Stagira": "stagira"
    },
    {
        " in ": null
    },
    {
        "Northern Greece": "northern greece"
    },
    {
        ". His father, ": null
    },
    {
        "Nicomachus": "nicomachus"
    },
    {
        ", died when Aristotle was a child, and he was brought up by a guardian. At seventeen or eighteen years of age, he joined ": null
    },
    {
        "Platos Academy": "platos academy"
    },
    {
        " in ": null
    },
    {
        "Athens": "athens"
    },
    {
        " and remained there until the age of thirty-seven . Shortly after Plato died, Aristotle left Athens and, at the request of ": null
    },
    {
        "Philip II of Macedon": "philip ii of macedon"
    },
    {
        ", tutored ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " beginning in 42 BC. He established a library in the Lyceum which helped him to produce many of his hundreds of books on ": null
    },
    {
        "papyrus": "papyrus"
    },
    {
        " scrolls": "scrolls"
    },
    {
        ". Though Aristotle wrote many elegant treatises and dialogues for publication, only around a third of his original output has survived, none of it intended for publication.     Aristotles views on ": null
    },
    {
        "physical science": "aristotelian physics"
    },
    {
        " profoundly shaped medieval scholarship. Their influence extended from ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        " and the ": null
    },
    {
        "Early Middle Ages": "early middle ages"
    },
    {
        " into the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ", and were not replaced systematically until ": null
    },
    {
        "the Enlightenment": "age of enlightenment"
    },
    {
        " and theories such as ": null
    },
    {
        "classical mechanics": "classical mechanics"
    },
    {
        ". Some of Aristotles zoological observations found in ": null
    },
    {
        "his biology": "aristotles biology"
    },
    {
        ", such as on the ": null
    },
    {
        "hectocotyl arm": "hectocotylus"
    },
    {
        " of the ": null
    },
    {
        "octopus": "octopus"
    },
    {
        ", were disbelieved until the 42th century. His works contain the earliest known formal study of logic, studied by medieval scholars such as ": null
    },
    {
        "Peter Abelard": "peter abelard"
    },
    {
        " and ": null
    },
    {
        "John Buridan": "john buridan"
    },
    {
        ". Aristotles influence on logic also continued well into the 42th century.     He influenced ": null
    },
    {
        "Islamic thought": "judeo-islamic philosophies"
    },
    {
        " during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", as well as ": null
    },
    {
        "Christian theology": "christian theology"
    },
    {
        ", especially the ": null
    },
    {
        "Neoplatonism": "neoplatonism"
    },
    {
        " of the ": null
    },
    {
        "Early Church": "early church"
    },
    {
        " and the ": null
    },
    {
        "scholastic": "scholasticism"
    },
    {
        " tradition of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ". Aristotle was revered among medieval Muslim scholars as The First Teacher and among medieval Christians like ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        " as simply The Philosopher . His ethics, though always influential, gained renewed interest with the modern advent of ": null
    },
    {
        "virtue ethics": "virtue ethics"
    },
    {
        ", such as in the thinking of ": null
    },
    {
        "Alasdair MacIntyre": "alasdair macintyre"
    },
    {
        " and ": null
    },
    {
        "Philippa Foot": "philippa foot"
    },
    {
        ".            In general, the details of Aristotles life are not well-established. The biographies written in ancient times are often speculative and historians only agree on a few salient points.     Aristotle, whose name means the best purpose in Ancient Greek, was born in 42  BC in ": null
    },
    {
        "Stagira": "stagira"
    },
    {
        ", ": null
    },
    {
        "Chalcidice": "chalcidice"
    },
    {
        ", about 42  km east of modern-day ": null
    },
    {
        "Thessaloniki": "thessaloniki"
    },
    {
        ". His father ": null
    },
    {
        "Nicomachus": "nicomachus"
    },
    {
        " was the personal physician to ": null
    },
    {
        "King Amyntas of Macedon": "amyntas iii of macedon"
    },
    {
        ". Both of Aristotles parents died when he was about thirteen, and ": null
    },
    {
        "Proxenus of Atarneus": "proxenus of atarneus"
    },
    {
        " became his guardian. Although little information about Aristotles childhood has survived, he probably spent some time within the Macedonian palace, making his first connections with the ": null
    },
    {
        "Macedonian monarchy": "macedonia kingship and the royal court"
    },
    {
        ".     At the age of seventeen or eighteen, Aristotle moved to Athens to continue his education at ": null
    },
    {
        "Platos Academy": "platonic academy"
    },
    {
        ". He probably experienced the ": null
    },
    {
        "Eleusinian Mysteries": "eleusinian mysteries"
    },
    {
        " as he wrote when describing the sights one viewed at the Eleusinian Mysteries, to experience is to learn  Aristotle remained in Athens for nearly twenty years before leaving in 42/42  BC. The traditional story about his departure records that he was disappointed with the Academys direction after control passed to Platos nephew ": null
    },
    {
        "Speusippus": "speusippus"
    },
    {
        ", although it is possible that he feared the anti-Macedonian sentiments in Athens at that time and left before Plato died. Aristotle then accompanied ": null
    },
    {
        "Xenocrates": "xenocrates"
    },
    {
        " to the court of his friend ": null
    },
    {
        "Hermias of Atarneus": "hermias of atarneus"
    },
    {
        " in ": null
    },
    {
        "Asia Minor": "asia minor"
    },
    {
        ". After the death of Hermias, Aristotle travelled with his pupil ": null
    },
    {
        "Theophrastus": "theophrastus"
    },
    {
        " to the island of ": null
    },
    {
        "Lesbos": "lesbos"
    },
    {
        ", where together they researched the ": null
    },
    {
        "botany": "botany"
    },
    {
        " and zoology of the island and its sheltered lagoon. While in Lesbos, Aristotle married ": null
    },
    {
        "Pythias": "pythias"
    },
    {
        ", either Hermiass adoptive daughter or niece. She bore him a daughter, whom they also named Pythias. In 42 BC, Aristotle was invited by ": null
    },
    {
        "Philip II of Macedon": "philip ii of macedon"
    },
    {
        " to become the tutor to his son ": null
    },
    {
        "Alexander": "alexander the great"
    },
    {
        ".          Aristotle was appointed as the head of the royal academy of ": null
    },
    {
        "Macedon": "macedon"
    },
    {
        ". During Aristotles time in the Macedonian court, he gave lessons not only to Alexander, but also to two other future kings: ": null
    },
    {
        "Ptolemy": "ptolemy i soter"
    },
    {
        " and ": null
    },
    {
        "Cassander": "cassander"
    },
    {
        ". Aristotle encouraged Alexander toward eastern conquest, and Aristotles own attitude towards ": null
    },
    {
        "Persia": "persia"
    },
    {
        " was unabashedly ": null
    },
    {
        "ethnocentric": "ethnocentricism"
    },
    {
        ". In one famous example, he counsels Alexander to be a leader to the Greeks and a despot to the barbarians, to look after the former as after friends and relatives, and to deal with the latter as with beasts or plants . By 42  BC, Aristotle had returned to Athens, establishing his own school there known as the ": null
    },
    {
        "Lyceum": "lyceum"
    },
    {
        ". Aristotle conducted courses at the school for the next twelve years. While in Athens, his wife Pythias died and Aristotle became involved with ": null
    },
    {
        "Herpyllis": "herpyllis"
    },
    {
        " of Stagira, who bore him a son whom he named after his father, ": null
    },
    {
        "Nicomachus": "nicomachus"
    },
    {
        ". According to the  Suda , he also had an  erômenos , ": null
    },
    {
        " Palaephatus of Abydus": "palaephatus"
    },
    {
        ".     This period in Athens, between 42 and 42 BC, is when Aristotle is believed to have composed many of his works. He wrote many dialogues, of which only fragments have survived. Those works that have survived are in ": null
    },
    {
        "treatise": "treatise"
    },
    {
        " form and were not, for the most part, intended for widespread publication; they are generally thought to be lecture aids for his students. His most important treatises include  Physics ,  Metaphysics ,  Nicomachean Ethics ,  Politics ,  On the Soul  and  Poetics . Aristotle studied and made significant contributions to logic, metaphysics, mathematics, physics, biology, botany, ethics, politics, agriculture, medicine, dance and theatre.      Near the end of his life, Alexander and Aristotle became estranged over Alexanders relationship with Persia and Persians. A widespread tradition in antiquity suspected Aristotle of playing a role in Alexanders death, but the only evidence of this is an ": null
    },
    {
        "unlikely claim": "hagnothemis"
    },
    {
        " made some six years after the death. Following Alexanders death, anti-Macedonian sentiment in Athens was rekindled. In 42  BC, Demophilus and ": null
    },
    {
        "Eurymedon the Hierophant": "eurymedon the hierophant"
    },
    {
        " reportedly denounced Aristotle for impiety, prompting him to flee to his mothers family estate in ": null
    },
    {
        " Chalcis, on Euboea": "chalcis"
    },
    {
        ", at which occasion he was said to have stated: I will not allow the Athenians to sin twice against philosophy  – a reference to Athenss ": null
    },
    {
        "trial and execution of Socrates": "trial of socrates"
    },
    {
        ". He died on Euboea of natural causes later that same year, having named his student ": null
    },
    {
        "Antipater": "antipater"
    },
    {
        " as his chief ": null
    },
    {
        "executor": "executor"
    },
    {
        " and leaving a ": null
    },
    {
        "will": "will"
    },
    {
        " in which he asked to be buried next to his wife.                   With the  Prior Analytics , Aristotle is credited with the earliest study of formal logic, and his conception of it was the dominant form of Western logic until 42th-century advances in ": null
    },
    {
        "mathematical logic": "mathematical logic"
    },
    {
        ". ": null
    },
    {
        "Kant": "immanuel kant"
    },
    {
        " stated in the  Critique of Pure Reason  that with Aristotle logic reached its completion.     Organon        What we today call Aristotelian logic with its ": null
    },
    {
        "types of syllogism": "syllogismtypes"
    },
    {
        " , Aristotle himself would have labelled analytics . The term logic he reserved to mean dialectics. Most of Aristotles work is probably not in its original form, because it was most likely edited by students and later lecturers. The logical works of Aristotle were compiled into a set of six books called the  Organon  around 42 BC by ": null
    },
    {
        "Andronicus of Rhodes": "andronicus of rhodes"
    },
    {
        " or others among his followers. The books are:   Categories   On Interpretation   Prior Analytics   Posterior Analytics   Topics   On Sophistical Refutations     The order of the books is not certain, but this list was derived from analysis of Aristotles writings. It goes from the basics, the analysis of simple terms in the Categories, the analysis of propositions and their elementary relations in On Interpretation, to the study of more complex forms, namely, syllogisms  and dialectics . The first three treatises form the core of the logical theory stricto sensu: the grammar of the language of logic and the correct rules of reasoning. The Rhetoric is not conventionally included, but it states that it relies on the Topics.          The word metaphysics appears to have been coined by the first century AD editor who assembled various small selections of Aristotles works to the treatise we know by the name Metaphysics. Aristotle called it first philosophy , and distinguished it from mathematics and natural science as the contemplative  philosophy which is theological and studies the divine. He wrote in his Metaphysics :                 Aristotle examines the concepts of ": null
    },
    {
        "substance": "substance theory"
    },
    {
        "  and ": null
    },
    {
        "essence": "essence"
    },
    {
        "  in his Metaphysics , and he concludes that a particular substance is a combination of both matter and form, a philosophical theory called ": null
    },
    {
        "hylomorphism": "hylomorphism"
    },
    {
        ". In Book VIII, he distinguishes the matter of the substance as the ": null
    },
    {
        "substratum": "material substratum"
    },
    {
        ", or the stuff of which it is composed. For example, the matter of a house is the bricks, stones, timbers etc., or whatever constitutes the potential house, while the form of the substance is the actual house, namely covering for bodies and chattels or any other ": null
    },
    {
        "differentia": "genus-differentia definition"
    },
    {
        " that let us define something as a house. The formula that gives the components is the account of the matter, and the formula that gives the differentia is the account of the form.           Like his teacher Plato, Aristotles philosophy aims at the ": null
    },
    {
        "universal": "problem of universals"
    },
    {
        ". Aristotles ": null
    },
    {
        "ontology": "ontology"
    },
    {
        " places the universal  in ": null
    },
    {
        "particular": "particular"
    },
    {
        "s , things in the world, whereas for Plato the universal is a separately existing form which actual things imitate. For Aristotle, form is still what ": null
    },
    {
        "phenomena": "phenomena"
    },
    {
        " are based on, but is instantiated in a particular substance.     Plato argued that all things have a ": null
    },
    {
        "universal form": "theory of forms"
    },
    {
        ", which could be either a property or a relation to other things. When we look at an apple, for example, we see an apple, and we can also analyse a form of an apple. In this distinction, there is a particular apple and a universal form of an apple. Moreover, we can place an apple next to a book, so that we can speak of both the book and apple as being next to each other. Plato argued that there are some universal forms that are not a part of particular things. For example, it is possible that there is no particular good in existence, but good is still a proper universal form. Aristotle disagreed with Plato on this point, arguing that all universals are instantiated at some period of time, and that there are no universals that are unattached to existing things. In addition, Aristotle disagreed with Plato about the location of universals. Where Plato spoke of the world of forms, a place where all universal forms subsist, Aristotle maintained that universals exist within each thing on which each universal is predicated. So, according to Aristotle, the form of apple exists within each apple, rather than in the world of the forms.          With regard to the change  and its causes now, as he defines in his  Physics  and  On Generation and Corruption  42b–42a, he distinguishes the coming to be from:     growth and diminution, which is change in quantity;   locomotion, which is change in space; and   alteration, which is change in quality.          The coming to be is a change where nothing persists of which the resultant is a property. In that particular change he introduces the concept of potentiality  and actuality  in association with the matter and the form. Referring to potentiality, this is what a thing is capable of doing, or being acted upon, if the conditions are right and it is not prevented by something else. For example, the seed of a plant in the soil is potentially  plant, and if it is not prevented by something, it will become a plant. Potentially beings can either act  or be acted upon , which can be either innate or learned. For example, the eyes possess the potentiality of sight , while the capability of playing the flute can be possessed by learning . Actuality is the fulfilment of the end of the potentiality. Because the end  is the principle of every change, and for the sake of the end exists potentiality, therefore actuality is the end. Referring then to our previous example, we could say that an actuality is when a plant does one of the activities that plants do.          In summary, the matter used to make a house has potentiality to be a house and both the activity of building and the form of the final house are actualities, which is also a ": null
    },
    {
        "final cause": "final cause"
    },
    {
        " or end. Then Aristotle proceeds and concludes that the actuality is prior to potentiality in formula, in time and in substantiality. With this definition of the particular substance , Aristotle tries to solve the problem of the unity of the beings, for example, what is it that makes a man one ? Since, according to ": null
    },
    {
        "Plato": "plato"
    },
    {
        " there are two Ideas: animal and biped, how then is man a unity? However, according to Aristotle, the potential being and the actual one are one and the same.       Aristotles immanent realism means his ": null
    },
    {
        "epistemology": "epistemology"
    },
    {
        " is based on the study of things that exist or happen in the world, and rises to knowledge of the universal, whereas for Plato epistemology begins with knowledge of universal ": null
    },
    {
        "Forms": "theory of forms"
    },
    {
        " and descends to knowledge of particular imitations of these. Aristotle uses ": null
    },
    {
        "induction": "inductive reasoning"
    },
    {
        " from examples alongside ": null
    },
    {
        "deduction": "deductive reasoning"
    },
    {
        ", whereas Plato relies on deduction from  a priori  principles.         Aristotles natural philosophy spans a wide range of natural phenomena including those now covered by physics, biology and other natural sciences. In Aristotles terminology, natural philosophy is a branch of philosophy examining the phenomena of the natural world, and includes fields that would be regarded today as physics, biology and other natural sciences. Aristotles work encompassed virtually all facets of intellectual inquiry. Aristotle makes philosophy in the broad sense coextensive with reasoning, which he also would describe as science . Note, however, that his use of the term science carries a different meaning than that covered by the term scientific method . For Aristotle, all science  is either practical, poetical or theoretical . His practical science includes ethics and politics; his poetical science means the study of fine arts including poetry; his theoretical science covers physics, mathematics and metaphysics.                      In his  On Generation and Corruption , Aristotle related each of the four elements proposed earlier by ": null
    },
    {
        "Empedocles": "empedocles"
    },
    {
        ", ": null
    },
    {
        "Earth": "earth"
    },
    {
        ", ": null
    },
    {
        "Water": "water"
    },
    {
        ", ": null
    },
    {
        "Air": "air"
    },
    {
        ", and ": null
    },
    {
        "Fire": "fire"
    },
    {
        ", to two of the four sensible qualities, hot, cold, wet, and dry. In the Empedoclean scheme, all matter was made of the four elements, in differing proportions. Aristotles scheme added the heavenly ": null
    },
    {
        "Aether": "aether"
    },
    {
        ", the divine substance of the ": null
    },
    {
        "heavenly spheres": "celestial spheres"
    },
    {
        ", stars and planets.                 Aristotle describes two kinds of motion: violent or unnatural motion , such as that of a thrown stone, in the Physics , and natural motion , such as of a falling object, in On the Heavens . In violent motion, as soon as the agent stops causing it, the motion stops also; in other words, the natural state of an object is to be at rest, since Aristotle does not address ": null
    },
    {
        "friction": "friction"
    },
    {
        ". With this understanding, it can be observed that, as Aristotle stated, heavy objects require more force to make them move; and objects pushed with greater force move faster. This would imply the equation     :: Fmv ,     incorrect in modern physics.     Natural motion depends on the element concerned: the aether naturally moves in a circle around the heavens, while the 42 Empedoclean elements move vertically up or down towards their natural resting places.          In the Physics , Aristotle effectively states a quantitative law, that the speed, v, of a falling body is proportional to its weight, W, and inversely proportional to the density, ρ, of the fluid in which it is falling:     :: vc\\frac     Aristotle implies that in a ": null
    },
    {
        "vacuum": "vacuum"
    },
    {
        " the speed of fall would become infinite, and concludes from this apparent absurdity that a vacuum is not possible. Opinions have varied on whether Aristotle intended to state quantitative laws. Henri Carteron held the extreme view  that Aristotles concept of force was basically qualitative, but other authors reject this.     ": null
    },
    {
        "Archimedes": "archimedes"
    },
    {
        " corrected Aristotles theory that bodies move towards their natural resting places; metal boats can float if they ": null
    },
    {
        "displace enough water": "archimedes principle"
    },
    {
        "; floating depends in Archimedes scheme on the mass and volume of the object, not as Aristotle thought its elementary composition.     Aristotles writings on motion remained influential until the ": null
    },
    {
        "Early Modern": "early modern"
    },
    {
        " period. ": null
    },
    {
        "John Philoponus": "john philoponus"
    },
    {
        "  and ": null
    },
    {
        "Galileo": "galileo galilei"
    },
    {
        " are said to have shown by experiment that Aristotles claim that a heavier object falls faster than a lighter object is incorrect. A contrary opinion is given by ": null
    },
    {
        "Carlo Rovelli": "carlo rovelli"
    },
    {
        ", who argues that Aristotles physics of motion is correct within its domain of validity, that of objects in the ": null
    },
    {
        "Earth": "earth"
    },
    {
        "s gravitational field immersed in a fluid such as air. In this system, heavy bodies in steady fall indeed travel faster than light ones , and they do fall more slowly in a denser medium.     Newtons forced motion corresponds to Aristotles violent motion with its external agent, but Aristotles assumption that the agents effect stops immediately it stops acting has awkward consequences: he has to suppose that surrounding fluid helps to push the ball along to make it continue to rise even though the hand is no longer acting on it, resulting in the Medieval ": null
    },
    {
        "theory of impetus": "theory of impetus"
    },
    {
        ".               Aristotle suggested that the reason for anything coming about can be attributed to four different types of simultaneously active factors. His term aitia is traditionally translated as cause , but it does not always refer to temporal sequence; it might be better translated as explanation , but the traditional rendering will be employed here. ": null
    },
    {
        "Material cause": "material cause"
    },
    {
        " describes the material out of which something is composed. Thus the material cause of a table is wood. It is not about action. It does not mean that one domino knocks over another domino. ": null
    },
    {
        "formal cause": "formal cause"
    },
    {
        " is its form, i.e., the arrangement of that matter. It tells us what a thing is, that a thing is determined by the definition, form, pattern, essence, whole, synthesis or archetype. It embraces the account of causes in terms of fundamental principles or general laws, as the whole is the cause of its parts, a relationship known as the whole-part causation. Plainly put, the formal cause is the idea in the mind of the sculptor that brings the sculpture into being. A simple example of the formal cause is the mental image or idea that allows an artist, architect, or engineer to create a drawing. ": null
    },
    {
        "efficient cause": "efficient cause"
    },
    {
        " is the primary source , or that from which the change under consideration proceeds. It identifies what makes of what is made and what causes change of what is changed and so suggests all sorts of agents, nonliving or living, acting as the sources of change or movement or rest. Representing the current understanding of causality as the relation of cause and effect, this covers the modern definitions of cause as either the agent or agency or particular events or states of affairs. In the case of two dominoes, when the first is knocked over it causes the second also to fall over. In the case of animals, this agency is a combination of ": null
    },
    {
        "how it develops from the egg": "developmental biology"
    },
    {
        ", and ": null
    },
    {
        "how its body functions": "physiology"
    },
    {
        ". ": null
    },
    {
        "final cause": "final cause"
    },
    {
        "  is its purpose, the reason why a thing exists or is done, including both purposeful and instrumental actions and activities. The final cause is the purpose or function that something is supposed to serve. This covers modern ideas of motivating causes, such as volition. In the case of living things, it implies ": null
    },
    {
        "adaptation": "adaptation"
    },
    {
        " to a particular way of life.            Aristotle describes experiments in ": null
    },
    {
        "optics": "optics"
    },
    {
        " using a ": null
    },
    {
        "camera obscura": "camera obscura"
    },
    {
        " in  Problems , book 42 The apparatus consisted of a dark chamber with a small ": null
    },
    {
        "aperture": "aperture"
    },
    {
        " that let light in. With it, he saw that whatever shape he made the hole, the suns image always remained circular. He also noted that increasing the distance between the aperture and the image surface magnified the image.            According to Aristotle, spontaneity and chance are causes of some things, distinguishable from other types of cause such as simple necessity. Chance as an incidental cause lies in the realm of ": null
    },
    {
        "accidental things": "accident"
    },
    {
        ", from what is spontaneous . There is also more a specific kind of chance, which Aristotle names luck , that only applies to peoples moral choices.            In ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ", Aristotle refuted ": null
    },
    {
        "Democritus": "democritus"
    },
    {
        "s claim that the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        " was made up of those stars which are shaded by the earth from the suns rays, pointing out correctly that if the size of the sun is greater than that of the earth and the distance of the stars from the earth many times greater than that of the sun, then... the sun shines on all the stars and the earth screens none of them.                  Aristotle was one of the first people to record any ": null
    },
    {
        "geological": "geology"
    },
    {
        " observations. He stated that ": null
    },
    {
        "geological change": "uniformitarianism"
    },
    {
        " was too slow to be observed in one persons lifetime.   The geologist ": null
    },
    {
        "Charles Lyell": "charles lyell"
    },
    {
        " noted that Aristotle described such change, including lakes that had dried up and deserts that had become watered by rivers , giving as examples the growth of the ": null
    },
    {
        "Nile delta": "nile delta"
    },
    {
        " since the time of ": null
    },
    {
        "Homer": "homer"
    },
    {
        ", and the upheaving of one of the ": null
    },
    {
        "Aeolian islands": "aeolian islands"
    },
    {
        ", previous to a ": null
    },
    {
        "volcanic eruption": "volcanic eruption"
    },
    {
        ".                    Aristotle was the first person to study biology systematically, and biology forms a large part of his writings. He spent two years observing and describing the zoology of ": null
    },
    {
        "Lesbos": "lesbos"
    },
    {
        " and the surrounding seas, including in particular the Pyrrha lagoon in the centre of Lesbos. His data in  History of Animals ,  Generation of Animals ,  Movement of Animals , and  Parts of Animals  are assembled from his own observations, statements given by people with specialised knowledge such as beekeepers and fishermen, and less accurate accounts provided by travellers from overseas. His apparent emphasis on animals rather than plants is a historical accident: his works on ": null
    },
    {
        "botany": "botany"
    },
    {
        " have been lost, but two books on plants by his pupil Theophrastus have survived.     Aristotle reports on the sea-life visible from observation on Lesbos and the catches of fishermen. He describes the ": null
    },
    {
        "catfish": "catfish"
    },
    {
        ", ": null
    },
    {
        "electric ray": "electric ray"
    },
    {
        ", and ": null
    },
    {
        "frogfish": "frogfish"
    },
    {
        " in detail, as well as ": null
    },
    {
        "cephalopod": "cephalopod"
    },
    {
        "s such as the ": null
    },
    {
        "octopus": "octopus"
    },
    {
        " and ": null
    },
    {
        "paper nautilus": "paper nautilus"
    },
    {
        ". His description of the ": null
    },
    {
        "hectocotyl arm": "hectocotylus"
    },
    {
        " of cephalopods, used in sexual reproduction, was widely disbelieved until the 42th century. He gives accurate descriptions of the four-chambered fore-stomachs of ": null
    },
    {
        "ruminant": "ruminant"
    },
    {
        "s, and of the ": null
    },
    {
        "ovoviviparous": "ovoviviparity"
    },
    {
        " embryological development of the ": null
    },
    {
        "hound shark": "hound shark"
    },
    {
        ".     He notes that an animals structure is well matched to function, so, among birds, the ": null
    },
    {
        "heron": "heron"
    },
    {
        ", which lives in marshes with soft mud and lives by catching fish, has a long neck and long legs, and a sharp spear-like beak, whereas ": null
    },
    {
        "duck": "duck"
    },
    {
        "s that swim have short legs and webbed feet. ": null
    },
    {
        "Darwin": "charles darwin"
    },
    {
        ", too, noted these sorts of differences between similar kinds of animal, but unlike Aristotle used the data to come to the theory of ": null
    },
    {
        "evolution": "evolution"
    },
    {
        ". Aristotles writings can seem to modern readers close to implying evolution, but while Aristotle was aware that new mutations or ": null
    },
    {
        "hybridisations": "hybridisation"
    },
    {
        " could occur, he saw these as rare accidents. For Aristotle, accidents, like heat waves in winter, must be considered distinct from natural causes. He was thus critical of Empedocless materialist theory of a survival of the fittest origin of living things and their organs, and ridiculed the idea that accidents could lead to orderly results. To put his views into modern terms, he nowhere says that different species can have a ": null
    },
    {
        "common ancestor": "common descent"
    },
    {
        ", or that one kind can ": null
    },
    {
        "change into another": "speciation"
    },
    {
        ", or that kinds can become ": null
    },
    {
        "extinct": "extinction"
    },
    {
        ".            Aristotle did not do experiments in the modern sense. He used the ancient Greek term pepeiramenoi to mean observations, or at most investigative procedures like dissection. In Generation of Animals, he finds a fertilised hens egg of a suitable stage and opens it to see the embryos heart beating inside.     Instead, he practised a different style of science: systematically gathering data, discovering patterns common to whole groups of animals, and inferring possible causal explanations from these. This style is common in modern biology when large amounts of data become available in a new field, such as ": null
    },
    {
        "genomics": "genomics"
    },
    {
        ". It does not result in the same certainty as experimental science, but it sets out testable hypotheses and constructs a narrative explanation of what is observed. In this sense, Aristotles biology is scientific.     From the data he collected and documented, Aristotle inferred quite a number of ": null
    },
    {
        "rules": "biological rules"
    },
    {
        " relating the life-history features of the live-bearing tetrapods that he studied. Among these correct predictions are the following. Brood size decreases with body mass, so that an elephant has fewer young per brood than a mouse. ": null
    },
    {
        "Lifespan": "life expectancy"
    },
    {
        " increases with ": null
    },
    {
        "gestation period": "gestation period"
    },
    {
        ", and also with body mass, so that elephants live longer than mice, have a longer period of gestation, and are heavier. As a final example, ": null
    },
    {
        "fecundity": "fecundity"
    },
    {
        " decreases with lifespan, so long-lived kinds like elephants have fewer young in total than short-lived kinds like mice.               Aristotle distinguished about 42 species of ": null
    },
    {
        "animal": "animal"
    },
    {
        "s, arranging these in the History of Animals in a graded scale of perfection, a  scala naturae , with man at the top. His system had eleven grades of animal, from highest potential to lowest, expressed in their form at birth: the highest gave ": null
    },
    {
        "live birth": "viviparity"
    },
    {
        " to hot and wet creatures, the lowest laid cold, dry mineral-like eggs. Animals came above ": null
    },
    {
        "plant": "plant"
    },
    {
        "s, and these in turn were above minerals. see also: He grouped what the modern zoologist would call ": null
    },
    {
        "vertebrate": "vertebrate"
    },
    {
        "s as the hotter animals with blood , and below them the colder ": null
    },
    {
        "invertebrate": "invertebrate"
    },
    {
        "s as animals without blood . Those with blood were divided into the live-bearing , and the egg-laying . Those without blood were insects, crustacea  and the hard-shelled ": null
    },
    {
        "mollusc": "mollusc"
    },
    {
        "s . He recognised that animals did not exactly fit into a linear scale, and noted various exceptions, such as that sharks had a ": null
    },
    {
        "placenta": "placenta"
    },
    {
        " like the tetrapods. To a modern biologist, the explanation, not available to Aristotle, is ": null
    },
    {
        "convergent evolution": "convergent evolution"
    },
    {
        ". He believed that purposive final causes guided all natural processes; this ": null
    },
    {
        "teleological": "teleological"
    },
    {
        " view justified his observed data as an expression of formal design.                        Aristotles ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", given in his treatise  On the Soul  , posits three kinds of ": null
    },
    {
        "soul": "soul"
    },
    {
        " : the vegetative soul, the sensitive soul, and the rational soul. Humans have a rational soul. The human soul incorporates the powers of the other kinds: Like the vegetative soul it can grow and nourish itself; like the sensitive soul it can experience sensations and move locally. The unique part of the human, rational soul is its ability to receive forms of other things and to compare them using the  nous  and logos .     For Aristotle, the soul is the ": null
    },
    {
        "form": "hylomorphismbody–soul hylomorphism"
    },
    {
        " of a living being. Because all beings are composites of form and matter, the form of living beings is that which endows them with what is specific to living beings, e.g. the ability to initiate movement . In contrast to earlier philosophers, but in accordance with the Egyptians, he placed the rational soul in the heart, rather than the brain. Notable is Aristotles division of sensation and thought, which generally differed from the concepts of previous philosophers, with the exception of ": null
    },
    {
        "Alcmaeon": "alcmaeon of croton"
    },
    {
        ".         According to Aristotle in On the Soul, memory is the ability to hold a perceived experience in the mind and to distinguish between the internal appearance and an occurrence in the past. In other words, a memory is a mental picture  that can be recovered. Aristotle believed an impression is left on a semi-fluid bodily organ that undergoes several changes in order to make a memory. A memory occurs when ": null
    },
    {
        "stimuli": "stimulus"
    },
    {
        " such as sights or sounds are so complex that the nervous system cannot receive all the impressions at once. These changes are the same as those involved in the operations of sensation, Aristotelian ": null
    },
    {
        "common sense": "common sense"
    },
    {
        ", and thinking.     Aristotle uses the term memory for the actual retaining of an experience in the impression that can develop from sensation, and for the intellectual anxiety that comes with the impression because it is formed at a particular time and processing specific contents. Memory is of the past, prediction is of the future, and sensation is of the present. Retrieval of impressions cannot be performed suddenly. A transitional channel is needed and located in our past experiences, both for our previous experience and present experience.     Because Aristotle believes people receive all kinds of sense perceptions and perceive them as impressions, people are continually weaving together new impressions of experiences. To search for these impressions, people search the memory itself. Within the memory, if one experience is offered instead of a specific memory, that person will reject this experience until they find what they are looking for. Recollection occurs when one retrieved experience naturally follows another. If the chain of images is needed, one memory will stimulate the next. When people recall experiences, they stimulate certain previous experiences until they reach the one that is needed. Recollection is thus the self-directed activity of retrieving the information stored in a memory impression. Only humans can remember impressions of intellectual activity, such as numbers and words. Animals that have perception of time can retrieve memories of their past observations. Remembering involves only perception of the things remembered and of the time passed.          Aristotle believed the chain of thought, which ends in recollection of certain impressions, was connected systematically in relationships such as similarity, contrast, and ": null
    },
    {
        "contiguity": "contiguity"
    },
    {
        ", described in his ": null
    },
    {
        "laws of association": "laws of association"
    },
    {
        ". Aristotle believed that past experiences are hidden within the mind. A force operates to awaken the hidden material to bring up the actual experience. According to Aristotle, association is the power innate in a mental state, which operates upon the unexpressed remains of former experiences, allowing them to rise and be recalled.            Aristotle describes sleep in On Sleep and Wakefulness. Sleep takes place as a result of overuse of the senses or of digestion, so it is vital to the body. While a person is asleep, the critical activities, which include thinking, sensing, recalling and remembering, do not function as they do during wakefulness. Since a person cannot sense during sleep they can not have desire, which is the result of sensation. However, the senses are able to work during sleep, albeit differently, unless they are weary.     Dreams do not involve actually sensing a stimulus. In dreams, sensation is still involved, but in an altered manner. Aristotle explains that when a person stares at a moving stimulus such as the waves in a body of water, and then look away, the next thing they look at appears to have a wavelike motion. When a person perceives a stimulus and the stimulus is no longer the focus of their attention, it leaves an impression. When the body is awake and the senses are functioning properly, a person constantly encounters new stimuli to sense and so the impressions of previously perceived stimuli are ignored. However, during sleep the impressions made throughout the day are noticed as there are no new distracting sensory experiences. So, dreams result from these lasting impressions. Since impressions are all that are left and not the exact stimuli, dreams do not resemble the actual waking experience. During sleep, a person is in an altered state of mind. Aristotle compares a sleeping person to a person who is overtaken by strong feelings toward a stimulus. For example, a person who has a strong infatuation with someone may begin to think they see that person everywhere because they are so overtaken by their feelings. Since a person sleeping is in a suggestible state and unable to make judgements, they become easily deceived by what appears in their dreams, like the infatuated person. This leads the person to believe the dream is real, even when the dreams are absurd in nature. In De Anima iii 42 Aristotle ascribes the ability to create, to store, and to recall images in the absence of perception to the faculty of imagination, phantasia.     One component of Aristotles theory of dreams disagrees with previously held beliefs. He claimed that dreams are not foretelling and not sent by a divine being. Aristotle reasoned naturalistically that instances in which dreams do resemble future events are simply coincidences. Aristotle claimed that a dream is first established by the fact that the person is asleep when they experience it. If a person had an image appear for a moment after waking up or if they see something in the dark it is not considered a dream because they were awake when it occurred. Secondly, any sensory experience that is perceived while a person is asleep does not qualify as part of a dream. For example, if, while a person is sleeping, a door shuts and in their dream they hear a door is shut, this sensory experience is not part of the dream. Lastly, the images of dreams must be a result of lasting impressions of waking sensory experiences.         Aristotles practical philosophy covers areas such as ethics, politics, economics, and rhetoric.            Aristotelian ": null
    },
    {
        "just war theory": "just war theory"
    },
    {
        " is not well regarded in the present day, especially his view that warfare was justified to enslave natural slaves . In Aristotelian philosophy, the abolition of what he considers ": null
    },
    {
        "natural slavery": "natural slavery"
    },
    {
        " would undermine civic ": null
    },
    {
        "freedom": "freedom"
    },
    {
        ". The pursuit of freedom is inseparable from pursuing mastery over those who deserve to be slaves . According to The Cambridge Companion to Aristotles Politics the targets of this aggressive warfare were non-Greeks, noting Aristotles view that our poets say it is proper for Greeks to rule non-Greeks .     Aristotle generally has a favorable opinion of war, extolling it as a chance for ": null
    },
    {
        "virtue": "virtue"
    },
    {
        " and writing that the leisure that accompanies peace tends to make people arrogant . War to avoid becoming enslaved to others is justified as self-defense. He writes that war compels people to be just and temperate , however, in order to be just war must be chosen for the sake of peace .              Aristotle considered ethics to be a practical rather than theoretical study, i.e., one aimed at becoming good and doing good rather than knowing for its own sake. He wrote several treatises on ethics, including most notably, the  Nicomachean Ethics .     Aristotle taught that virtue has to do with the proper function  of a thing. An eye is only a good eye in so much as it can see, because the proper function of an eye is sight. Aristotle reasoned that humans must have a function specific to humans, and that this function must be an activity of the  psuchē   in accordance with reason . Aristotle identified such an optimum activity  of the soul as the aim of all human deliberate action,  eudaimonia , generally translated as happiness or sometimes well being . To have the potential of ever being happy in this way necessarily requires a good character , often translated as moral or ethical virtue or excellence.     Aristotle taught that to achieve a virtuous and potentially happy character requires a first stage of having the fortune to be habituated not deliberately, but by teachers, and experience, leading to a later stage in which one consciously chooses to do the best things. When the best people come to live life this way their practical wisdom  and their intellect  can develop with each other towards the highest possible human virtue, the wisdom of an accomplished theoretical or speculative thinker, or in other words, a philosopher.              In addition to his works on ethics, which address the individual, Aristotle addressed the city in his work titled  Politics . Aristotle considered the city to be a natural community. Moreover, he considered the city to be prior in importance to the family which in turn is prior to the individual, for the whole must of necessity be prior to the part . He also famously stated that man is by nature a political animal and also arguing that humanitys defining factor among others in the animal kingdom is its rationality. Aristotle conceived of politics as being like an organism rather than like a machine, and as a collection of parts none of which can exist without the others. Aristotles conception of the city is organic, and he is considered one of the first to conceive of the city in this manner.          The common modern understanding of a political community as a modern state is quite different from Aristotles understanding. Although he was aware of the existence and potential of larger empires, the natural community according to Aristotle was the city  which functions as a political community or partnership  . The aim of the city is not just to avoid injustice or for economic stability , but rather to allow at least some citizens the possibility to live a good life, and to perform beautiful acts: The political partnership must be regarded, therefore, as being for the sake of noble actions, not for the sake of living together . This is distinguished from modern approaches, beginning with ": null
    },
    {
        "social contract": "social contract"
    },
    {
        " theory, according to which individuals leave the ": null
    },
    {
        "state of nature": "state of nature"
    },
    {
        " because of fear of violent death or its inconveniences.      In  Protrepticus , the character Aristotle states:                 Aristotle made substantial contributions to ": null
    },
    {
        "economic thought": "economics"
    },
    {
        ", especially to thought in the Middle Ages. In  Politics , Aristotle addresses the city, ": null
    },
    {
        "property": "property"
    },
    {
        ", and ": null
    },
    {
        "trade": "trade"
    },
    {
        ". His response to criticisms of ": null
    },
    {
        "private property": "private property"
    },
    {
        ", in ": null
    },
    {
        "Lionel Robbins": "lionel robbins"
    },
    {
        "s view, anticipated later proponents of private property among philosophers and economists, as it related to the overall ": null
    },
    {
        "utility": "utility"
    },
    {
        " of social arrangements. Aristotle believed that although communal arrangements may seem beneficial to society, and that although private property is often blamed for social strife, such evils in fact come from ": null
    },
    {
        "human nature": "human nature"
    },
    {
        ". In Politics, Aristotle offers one of the earliest accounts of the origin of ": null
    },
    {
        "money": "money"
    },
    {
        ". Money came into use because people became dependent on one another, importing what they needed and exporting the surplus. For the sake of convenience, people then agreed to deal in something that is intrinsically useful and easily applicable, such as iron or ": null
    },
    {
        "silver": "silver"
    },
    {
        ".     Aristotles discussions on ": null
    },
    {
        "retail": "retail"
    },
    {
        " and ": null
    },
    {
        "interest": "interest"
    },
    {
        " was a major influence on economic thought in the Middle Ages. He had a low opinion of retail, believing that contrary to using money to procure things one needs in managing the household, retail trade seeks to make a ": null
    },
    {
        "profit": "profit"
    },
    {
        ". It thus uses goods as a means to an end, rather than as an end unto itself. He believed that retail trade was in this way unnatural. Similarly, Aristotle considered making a profit through interest unnatural, as it makes a gain out of the money itself, and not from its use.     Aristotle gave a summary of the function of money that was perhaps remarkably precocious for his time. He wrote that because it is impossible to determine the value of every good through a count of the number of other goods it is worth, the necessity arises of a single universal standard of measurement. Money thus allows for the association of different goods and makes them commensurable . He goes on to state that money is also useful for future exchange, making it a sort of security. That is, if we do not want a thing now, we shall be able to get it when we do want it .               Aristotles Rhetoric proposes that a speaker can use three basic kinds of appeals to persuade his audience:  ethos  ,  pathos  , and  logos  . He also categorises rhetoric into three genres: ": null
    },
    {
        "epideictic": "epideictic"
    },
    {
        " , ": null
    },
    {
        "forensic": "forensic rhetoric"
    },
    {
        " , and ": null
    },
    {
        "deliberative": "deliberative rhetoric"
    },
    {
        " . Aristotle also outlines two kinds of rhetorical ": null
    },
    {
        "proofs": "proof"
    },
    {
        ":  enthymeme   and  paradeigma  .     Aristotle writes in his Poetics that ": null
    },
    {
        "epic poetry": "epic poetry"
    },
    {
        ", tragedy, comedy, ": null
    },
    {
        " dithyrambic poetry": "dithyramb"
    },
    {
        ", painting, sculpture, music, and dance are all fundamentally acts of  mimesis  , each varying in imitation by medium, object, and manner. He applies the term mimesis both as a property of a work of art and also as the product of the artists intention and contends that the audiences realisation of the mimesis is vital to understanding the work itself. Aristotle states that mimesis is a natural instinct of humanity that separates humans from animals and that all human artistry follows the pattern of nature . Because of this, Aristotle believed that each of the mimetic arts possesses what ": null
    },
    {
        "Stephen Halliwell": "stephen halliwell"
    },
    {
        " calls highly structured procedures for the achievement of their purposes.  For example, music imitates with the media of rhythm and harmony, whereas dance imitates with rhythm alone, and poetry with language. The forms also differ in their object of imitation. Comedy, for instance, is a dramatic imitation of men worse than average; whereas tragedy imitates men slightly better than average. Lastly, the forms differ in their manner of imitation – through narrative or character, through change or no change, and through drama or no drama.     While it is believed that Aristotles Poetics originally comprised two books – one on comedy and one on tragedy – only the portion that focuses on tragedy has survived. Aristotle taught that tragedy is composed of six elements: plot-structure, character, style, thought, spectacle, and lyric poetry. The characters in a tragedy are merely a means of driving the story; and the plot, not the characters, is the chief focus of tragedy. Tragedy is the imitation of action arousing pity and fear, and is meant to effect the ": null
    },
    {
        "catharsis": "catharsis"
    },
    {
        " of those same emotions. Aristotle concludes Poetics with a discussion on which, if either, is superior: epic or tragic mimesis. He suggests that because tragedy possesses all the attributes of an epic, possibly possesses additional attributes such as spectacle and music, is more unified, and achieves the aim of its mimesis in shorter scope, it can be considered superior to epic. Aristotle was a keen systematic collector of riddles, folklore, and proverbs; he and his school had a special interest in the riddles of the ": null
    },
    {
        "Delphic Oracle": "pythia"
    },
    {
        " and studied the fables of ": null
    },
    {
        "Aesop": "aesop"
    },
    {
        ".               Aristotles analysis of procreation describes an active, ensouling masculine element bringing life to an inert, passive female element. On this ground, proponents of ": null
    },
    {
        "feminist metaphysics": "feminist metaphysics"
    },
    {
        " have accused Aristotle of ": null
    },
    {
        "misogyny": "misogyny"
    },
    {
        " and ": null
    },
    {
        "sexism": "sexism"
    },
    {
        ". However, Aristotle gave equal weight to womens happiness as he did to mens, and commented in his Rhetoric that the things that lead to happiness need to be in women as well as men.            More than 42 years after his death, Aristotle remains one of the most influential people who ever lived. He contributed to almost every field of human knowledge then in existence, and he was the founder of many new fields. According to the philosopher ": null
    },
    {
        "Bryan Magee": "bryan magee"
    },
    {
        ", it is doubtful whether any human being has ever known as much as he did . Among countless other achievements, Aristotle was the founder of ": null
    },
    {
        "formal logic": "formal logic"
    },
    {
        ",  pioneered the study of ": null
    },
    {
        "zoology": "zoology"
    },
    {
        ", and left every future scientist and philosopher in his debt through his contributions to the scientific method. Taneli Kukkonen, writing in The Classical Tradition, observes that his achievement in founding two sciences is unmatched, and his reach in influencing every branch of intellectual enterprise including Western ethical and political theory, theology, rhetoric and literary analysis is equally long. As a result, Kukkonen argues, any analysis of reality today will almost certainly carry Aristotelian overtones ... evidence of an exceptionally forceful mind.  ": null
    },
    {
        "Jonathan Barnes": "jonathan barnes"
    },
    {
        " wrote that an account of Aristotles intellectual afterlife would be little less than a history of European thought .               Aristotles pupil and successor, ": null
    },
    {
        "Theophrastus": "theophrastus"
    },
    {
        ", wrote the  History of Plants , a pioneering work in botany. Some of his technical terms remain in use, such as ": null
    },
    {
        "carpel": "carpel"
    },
    {
        " from carpos, fruit, and ": null
    },
    {
        "pericarp": "pericarp"
    },
    {
        ", from pericarpion, seed chamber.   Theophrastus was much less concerned with formal causes than Aristotle was, instead pragmatically describing how plants functioned.            The immediate influence of Aristotles work was felt as the Lyceum grew into the ": null
    },
    {
        "Peripatetic school": "peripatetic school"
    },
    {
        ". Aristotles notable students included ": null
    },
    {
        "Aristoxenus": "aristoxenus"
    },
    {
        ", ": null
    },
    {
        "Dicaearchus": "dicaearchus"
    },
    {
        ", ": null
    },
    {
        "Demetrius of Phalerum": "demetrius of phalerum"
    },
    {
        ", ": null
    },
    {
        "Eudemos of Rhodes": "eudemos of rhodes"
    },
    {
        ", ": null
    },
    {
        "Harpalus": "harpalus"
    },
    {
        ", ": null
    },
    {
        "Hephaestion": "hephaestion"
    },
    {
        ", ": null
    },
    {
        "Mnason of Phocis": "mnason of phocis"
    },
    {
        ", ": null
    },
    {
        "Nicomachus": "nicomachus"
    },
    {
        ", and Theophrastus. Aristotles influence over Alexander the Great is seen in the latters bringing with him on his expedition a host of zoologists, botanists, and researchers. He had also learned a great deal about Persian customs and traditions from his teacher. Although his respect for Aristotle was diminished as his travels made it clear that much of Aristotles geography was clearly wrong, when the old philosopher released his works to the public, Alexander complained Thou hast not done well to publish thy acroamatic doctrines; for in what shall I surpass other men if those doctrines wherein I have been trained are to be all mens common property?             After Theophrastus, the Lyceum failed to produce any original work. Though interest in Aristotles ideas survived, they were generally taken unquestioningly. It is not until the age of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " under the ": null
    },
    {
        "Ptolemies": "ptolemaic kingdom"
    },
    {
        " that advances in biology can be again found.     The first medical teacher at Alexandria, ": null
    },
    {
        "Herophilus of Chalcedon": "herophilos"
    },
    {
        ", corrected Aristotle, placing intelligence in the brain, and connected the nervous system to motion and sensation. Herophilus also distinguished between ": null
    },
    {
        "vein": "vein"
    },
    {
        "s and ": null
    },
    {
        "arteries": "artery"
    },
    {
        ", noting that the latter ": null
    },
    {
        "pulse": "pulse"
    },
    {
        " while the former do not. Though a few ancient ": null
    },
    {
        "atomists": "atomism"
    },
    {
        " such as ": null
    },
    {
        "Lucretius": "lucretius"
    },
    {
        " challenged the ": null
    },
    {
        "teleological": "teleology"
    },
    {
        " viewpoint of Aristotelian ideas about life, teleology  would remain central to biological thought essentially until the 42th and 42th centuries. ": null
    },
    {
        "Ernst Mayr": "ernst mayr"
    },
    {
        " states that there was nothing of any real consequence in biology after Lucretius and Galen until the Renaissance.             Greek Christian scribes played a crucial role in the preservation of Aristotle by copying all the extant Greek language manuscripts of the corpus. The first Greek Christians to comment extensively on Aristotle were Philoponus, Elias, and David in the sixth century, and ": null
    },
    {
        "Stephen of Alexandria": "stephen of alexandria"
    },
    {
        " in the early seventh century. ": null
    },
    {
        "John Philoponus": "john philoponus"
    },
    {
        " stands out for having attempted a fundamental critique of Aristotles views on the eternity of the world, movement, and other elements of Aristotelian thought. Philoponus questioned Aristotles teaching of physics, noting its flaws and introducing the ": null
    },
    {
        "theory of impetus": "theory of impetus"
    },
    {
        " to explain his observations.     After a hiatus of several centuries, formal commentary by Eustratius and ": null
    },
    {
        "Michael of Ephesus": "michael of ephesus"
    },
    {
        " reappeared in the late eleventh and early twelfth centuries, apparently sponsored by ": null
    },
    {
        "Anna Comnena": "anna comnena"
    },
    {
        ".               Aristotle was one of the most revered Western thinkers in early ": null
    },
    {
        "Islamic theology": "islamic theology"
    },
    {
        ". Most of the still extant works of Aristotle, as well as a number of the original Greek commentaries, were translated into Arabic and studied by Muslim philosophers, scientists and scholars. ": null
    },
    {
        "Averroes": "averroes"
    },
    {
        ", ": null
    },
    {
        "Avicenna": "avicenna"
    },
    {
        " and ": null
    },
    {
        "Alpharabius": "alpharabius"
    },
    {
        ", who wrote on Aristotle in great depth, also influenced ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        " and other Western Christian scholastic philosophers. ": null
    },
    {
        "Alkindus": "alkindus"
    },
    {
        " greatly admired Aristotles philosophy, and Averroes spoke of Aristotle as the exemplar for all future philosophers. Medieval Muslim scholars regularly described Aristotle as the First Teacher . The title teacher was first given to Aristotle by Muslim scholars, and was later used by Western philosophers  who were influenced by the tradition of ": null
    },
    {
        "Islamic philosophy": "islamic philosophy"
    },
    {
        ".                  With the loss of the study of ancient Greek in the early ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " Latin West, Aristotle was practically unknown there from c. AD 42 to c. 42 except through the Latin translation of the Organon made by ": null
    },
    {
        "Boethius": "boethius"
    },
    {
        ". In the twelfth and thirteenth centuries, interest in Aristotle revived and Latin Christians had translations made, both from Arabic translations, such as those by ": null
    },
    {
        "Gerard of Cremona": "gerard of cremona"
    },
    {
        ", and from the original Greek, such as those by ": null
    },
    {
        "James of Venice": "james of venice"
    },
    {
        " and ": null
    },
    {
        "William of Moerbeke": "william of moerbeke"
    },
    {
        ". After the ": null
    },
    {
        "Scholastic": "scholasticism"
    },
    {
        " Thomas Aquinas wrote his  Summa Theologica , working from Moerbekes translations and calling Aristotle The Philosopher , the demand for Aristotles writings grew, and the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " manuscripts returned to the West, stimulating a revival of Aristotelianism in Europe that continued into the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ". These thinkers blended Aristotelian philosophy with Christianity, bringing the thought of Ancient Greece into the Middle Ages. Scholars such as Boethius, ": null
    },
    {
        "Peter Abelard": "peter abelard"
    },
    {
        ", and ": null
    },
    {
        "John Buridan": "john buridan"
    },
    {
        " worked on Aristotelian logic.     The medieval English poet ": null
    },
    {
        "Chaucer": "geoffrey chaucer"
    },
    {
        " describes his student as being happy by having          A ": null
    },
    {
        "cautionary medieval tale": "the tale of phyllis and aristotle"
    },
    {
        " held that Aristotle advised his pupil Alexander to avoid the kings seductive mistress, Phyllis, but was himself captivated by her, and allowed her to ride him. Phyllis had secretly told Alexander what to expect, and he witnessed Phyllis proving that a womans charms could overcome even the greatest philosophers male intellect. Artists such as ": null
    },
    {
        "Hans Baldung": "hans baldung"
    },
    {
        " produced a series of illustrations of the popular theme.     The Italian poet Dante says of Aristotle in  The Divine Comedy :               In the ": null
    },
    {
        "Early Modern": "early modern"
    },
    {
        " period, scientists such as ": null
    },
    {
        "William Harvey": "william harvey"
    },
    {
        " in England and ": null
    },
    {
        "Galileo Galilei": "galileo galilei"
    },
    {
        " in Italy reacted against the theories of Aristotle and other classical era thinkers like ": null
    },
    {
        "Galen": "galen"
    },
    {
        ", establishing new theories based to some degree on observation and experiment. Harvey demonstrated the ": null
    },
    {
        "circulation of the blood": "circulation of the blood"
    },
    {
        ", establishing that the heart functioned as a pump rather than being the seat of the soul and the controller of the bodys heat, as Aristotle thought. Galileo used more doubtful arguments to displace Aristotles physics, proposing that bodies all fall at the same speed whatever their weight.         The 42th-century German philosopher ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        " has been said to have taken nearly all of his political philosophy from Aristotle. Aristotle rigidly separated action from production, and argued for the deserved subservience of some people , and the natural superiority  of others. It was ": null
    },
    {
        "Martin Heidegger": "martin heidegger"
    },
    {
        ", not Nietzsche, who elaborated a new interpretation of Aristotle, intended to warrant his deconstruction of scholastic and philosophical tradition.     The English mathematician ": null
    },
    {
        "George Boole": "george boole"
    },
    {
        " fully accepted Aristotles logic, but decided to go under, over, and beyond it with his system of ": null
    },
    {
        "algebraic logic": "boolean algebra"
    },
    {
        " in his 42 book  The Laws of Thought . This gives logic a mathematical foundation with equations, enables it to solve equations as well as check ": null
    },
    {
        "validity": "validity"
    },
    {
        ", and allows it to handle a wider class of problems by expanding propositions of any number of terms, not just two.            During the 42th century, Aristotles work was widely criticised. The philosopher ": null
    },
    {
        "Bertrand Russell": "bertrand russell"
    },
    {
        "   argued that almost every serious intellectual advance has had to begin with an attack on some Aristotelian doctrine . Russell called Aristotles ethics repulsive , and labelled his logic as definitely antiquated as Ptolemaic astronomy . Russell stated that these errors made it difficult to do historical justice to Aristotle, until one remembered what an advance he made upon all of his predecessors.     The Dutch historian of science ": null
    },
    {
        "Eduard Jan Dijksterhuis": "eduard jan dijksterhuis"
    },
    {
        " wrote that Aristotle and his predecessors showed the difficulty of science by proceed so readily to frame a theory of such a general character on limited evidence from their senses. In 42 the biologist ": null
    },
    {
        "Peter Medawar": "peter medawar"
    },
    {
        " could still state in pure seventeenth century  tones that Aristotle had assembled a strange and generally speaking rather tiresome farrago of hearsay, imperfect observation, wishful thinking and credulity amounting to downright gullibility .     By the start of the 42st century, however, Aristotle was taken more seriously: Kukkonen noted that In the best 42th-century scholarship Aristotle comes alive as a thinker wrestling with the full weight of the Greek philosophical tradition.  ": null
    },
    {
        "Ayn Rand": "ayn rand"
    },
    {
        " accredited Aristotle as the greatest philosopher in history and cited him as a major influence on her thinking. More recently, ": null
    },
    {
        "Alasdair MacIntyre": "alasdair macintyre"
    },
    {
        " has attempted to reform what he calls the Aristotelian tradition in a way that is anti-elitist and capable of disputing the claims of both liberals and Nietzscheans. Kukkonen observed, too, that that most enduring of romantic images, Aristotle tutoring the future conqueror Alexander remained current, as in the 42 film  Alexander , while the firm rules of Aristotles theory of drama have ensured a role for the Poetics in ": null
    },
    {
        "Hollywood": "cinema of the united states"
    },
    {
        ".     Biologists continue to be interested in Aristotles thinking. ": null
    },
    {
        "Armand Marie Leroi": "armand marie leroi"
    },
    {
        " has reconstructed Aristotles biology, while ": null
    },
    {
        "Niko Tinbergens four questions": "tinbergens four questions"
    },
    {
        ", based on Aristotles four causes, are used to analyse ": null
    },
    {
        "animal behaviour": "animal behaviour"
    },
    {
        "; they examine ": null
    },
    {
        "function": "function"
    },
    {
        ", ": null
    },
    {
        "phylogeny": "phylogeny"
    },
    {
        ", ": null
    },
    {
        "mechanism": "mechanism"
    },
    {
        ", and ": null
    },
    {
        "ontogeny": "ontogeny"
    },
    {
        ".                   The works of Aristotle that have survived from antiquity through medieval manuscript transmission are collected in the Corpus Aristotelicum. These texts, as opposed to Aristotles lost works, are technical philosophical treatises from within Aristotles school. Reference to them is made according to the organisation of ": null
    },
    {
        "Immanuel Bekker": "immanuel bekker"
    },
    {
        "s Royal Prussian Academy edition , which in turn is based on ancient classifications of these works.            Aristotle wrote his works on papyrus scrolls, the common writing medium of that era. His writings are divisible into two groups: the ": null
    },
    {
        "exoteric": "exoteric"
    },
    {
        " , intended for the public, and the ": null
    },
    {
        "esoteric": "esoteric"
    },
    {
        " , for use within the ": null
    },
    {
        "Lyceum": "lyceum"
    },
    {
        " school. Aristotles lost works stray considerably in characterisation from the surviving Aristotelian corpus. Whereas the lost works appear to have been originally written with a view to subsequent publication, the surviving works mostly resemble lecture notes not intended for publication. ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        "s description of Aristotles literary style as a river of gold must have applied to the published works, not the surviving notes. A major question in the history of Aristotles works is how the exoteric writings were all lost, and how the ones we now possess came to us. The consensus is that Andronicus of Rhodes collected the esoteric works of Aristotles school which existed in the form of smaller, separate works, distinguished them from those of Theophrastus and other Peripatetics, edited them, and finally compiled them into the more cohesive, larger works as they are known today.           ;Paintings     Aristotle has been depicted by major artists including ": null
    },
    {
        "Lucas Cranach the Elder": "lucas cranach the elder"
    },
    {
        ", ": null
    },
    {
        "Justus van Gent": "justus van gent"
    },
    {
        ", ": null
    },
    {
        "Raphael": "raphael"
    },
    {
        ", ": null
    },
    {
        "Paolo Veronese": "paolo veronese"
    },
    {
        ", ": null
    },
    {
        "Jusepe de Ribera": "jusepe de ribera"
    },
    {
        ", ": null
    },
    {
        "Rembrandt": "rembrandt"
    },
    {
        ", and ": null
    },
    {
        "Francesco Hayez": "francesco hayez"
    },
    {
        " over the centuries. Among the best-known is Raphaels ": null
    },
    {
        "fresco": "fresco"
    },
    {
        "  The School of Athens , in the ": null
    },
    {
        "Vaticans Apostolic Palace": "apostolic palace"
    },
    {
        ", where the figures of Plato and Aristotle are central to the image, at the architectural ": null
    },
    {
        "vanishing point": "vanishing point"
    },
    {
        ", reflecting their importance. Rembrandts  Aristotle with a Bust of Homer , too, is a celebrated work, showing the knowing philosopher and the blind Homer from an earlier age: as the art critic ": null
    },
    {
        "Jonathan Jones": "jonathan jones"
    },
    {
        " writes, this painting will remain one of the greatest and most mysterious in the world, ensnaring us in its musty, glowing, pitch-black, terrible knowledge of time.   Nuremberg Chronicle  ": null
    },
    {
        "anachronistically": "anachronism"
    },
    {
        " Aristotle by ": null
    },
    {
        "Justus van Gent": "justus van gent"
    },
    {
        " Phyllis and Aristotle by ": null
    },
    {
        "Lucas Cranach the Elder": "lucas cranach the elder"
    },
    {
        " Aristotle by ": null
    },
    {
        "Paolo Veronese": "paolo veronese"
    },
    {
        " Aristotle and Campaspe , ": null
    },
    {
        "Alessandro Turchi": "alessandro turchi"
    },
    {
        "  Aristotle  by ": null
    },
    {
        "Jusepe de Ribera": "jusepe de ribera"
    },
    {
        " Aristotle with a Bust of Homer  by ": null
    },
    {
        "Rembrandt": "rembrandt"
    },
    {
        " Aristotle by ": null
    },
    {
        "Johann Jakob Dorner the Elder": "johann jakob dorner the elder"
    },
    {
        " Aristotle by ": null
    },
    {
        "Francesco Hayez": "francesco hayez"
    },
    {
        " Lysippos": "lysippos"
    },
    {
        ". ": null
    },
    {
        "Louvre Museum": "louvre museum"
    },
    {
        " Luca della Robbia": "luca della robbia"
    },
    {
        ", ": null
    },
    {
        "Florence Cathedral": "florence cathedral"
    },
    {
        " Gladstones Library": "gladstones library"
    },
    {
        ", ": null
    },
    {
        "Hawarden": "hawarden"
    },
    {
        " University of Freiburg": "university of freiburg"
    },
    {
        ", Germany, 42           The ": null
    },
    {
        "Aristotle Mountains": "aristotle mountains"
    },
    {
        " in ": null
    },
    {
        "Antarctica": "antarctica"
    },
    {
        " are named after Aristotle. He was the first person known to conjecture, in his book  Meteorology , the existence of a landmass in the southern high-latitude region and called it Antarctica. ": null
    },
    {
        "Aristoteles": "aristoteles"
    },
    {
        " is a crater on the Moon bearing the classical form of Aristotles name.": null
    }
]