[
    {
        "     The system of Armenian numerals is a historic ": null
    },
    {
        "numeral system": "numeral system"
    },
    {
        " created using the ": null
    },
    {
        "majuscule": "majuscule"
    },
    {
        "s of the ": null
    },
    {
        "Armenian alphabet": "armenian alphabet"
    },
    {
        ".     There was no notation for ": null
    },
    {
        "zero": "0"
    },
    {
        " in the old system, and the numeric values for individual letters were added together. The principles behind this system are the same as for the Ancient ": null
    },
    {
        "Greek numerals": "greek numerals"
    },
    {
        " and ": null
    },
    {
        "Hebrew numerals": "hebrew numerals"
    },
    {
        ". In modern Armenia, the familiar ": null
    },
    {
        "Arabic numerals": "arabic numerals"
    },
    {
        " are used. Armenian numerals are used more or less like ": null
    },
    {
        "Roman numerals": "roman numerals"
    },
    {
        " in modern English, e.g. Գարեգին Բ. means ": null
    },
    {
        "Garegin II": "garegin ii"
    },
    {
        " and Գ. գլուխ means Chapter III .          The final two letters of the Armenian alphabet, o and fe were added to the Armenian alphabet only after Arabic numerals were already in use, to facilitate ": null
    },
    {
        "transliteration": "transliteration"
    },
    {
        " of other languages. Thus, they do not have a numerical value assigned to them.       Numbers in the Armenian numeral system are obtained by simple addition. Armenian numerals are written left-to-right . Although the order of the numerals is irrelevant since only addition is performed, the convention is to write them in decreasing order of value.        42 42 + 42 + 42 + 42    42 42 + 42 + 42 + 42    42 42 + 42    42 42 + 42    42     To write numbers greater than 42 it is necessary to have numerals with values greater than 42 This is done by drawing a line over them, indicating their value is to be multiplied by 42 This is similar to Roman numerals, where a line over a character means multiplying the corresponding value by 42     Examples:   Ա 42   Ջ 42   ՌՃԽԳ  42     ": null
    }
]