[
    {
        "      Armour  or armor  is a protective covering that is used to prevent damage from being inflicted to an object, individual or vehicle by direct contact ": null
    },
    {
        "weapons": "weapon"
    },
    {
        "or ": null
    },
    {
        "projectile": "projectile"
    },
    {
        "s, usually during combat, or from damage caused by a potentially dangerous environment or activity . ": null
    },
    {
        "Personal armour": "personal armour"
    },
    {
        " is used to protect soldiers and ": null
    },
    {
        "war animal": "war animal"
    },
    {
        "s. ": null
    },
    {
        "Vehicle armour": "vehicle armour"
    },
    {
        " is used on ": null
    },
    {
        "warships": "warship"
    },
    {
        "and ": null
    },
    {
        "armoured fighting vehicle": "armoured fighting vehicle"
    },
    {
        "s.     A second use of the term armour describes ": null
    },
    {
        "armoured forces": "division armoured division"
    },
    {
        ", ": null
    },
    {
        "armoured weapons": "armourarmoured fighting vehicles"
    },
    {
        ", and their role in combat. After the evolution of ": null
    },
    {
        "armoured warfare": "armoured warfare"
    },
    {
        ", ": null
    },
    {
        "mechanised infantry": "mechanised infantry"
    },
    {
        " and their weapons came to be referred to collectively as armour .          The word armour began to appear in the Middle Ages as a derivative of ": null
    },
    {
        "Old French": "old french language"
    },
    {
        ". It is dated from 1297 as a mail, defensive covering worn in combat . The word originates from the Old French , itself derived from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        "  meaning arms and/or equipment , with the root  meaning arms or gear .             Armour has been used throughout ": null
    },
    {
        "recorded history": "recorded history"
    },
    {
        ". It has been made from a variety of materials, beginning with the use of leathers or fabrics as protection  and evolving through ": null
    },
    {
        "mail": "mail"
    },
    {
        " and metal plate into todays modern ": null
    },
    {
        "composites": "composite armour"
    },
    {
        ". For much of ": null
    },
    {
        "military history": "military history"
    },
    {
        " the manufacture of metal personal armour has dominated the technology and employment of armour. Armour drove the development of many important technologies of the Ancient World, including wood ": null
    },
    {
        "lamination": "laminate"
    },
    {
        ", mining, ": null
    },
    {
        "metal refining": "refining"
    },
    {
        ", vehicle manufacture, leather processing, and later decorative metal working. Its production was influential in the ": null
    },
    {
        "industrial revolution": "industrial revolution"
    },
    {
        ", and furthered commercial development of metallurgy and engineering. Armour was the single most influential factor in the development of ": null
    },
    {
        "firearm": "firearm"
    },
    {
        "s, which in turn revolutionised warfare.            Significant factors in the development of armour include the economic and technological necessities of its production. For instance, ": null
    },
    {
        "plate armour": "plate armour"
    },
    {
        " first appeared in ": null
    },
    {
        "Medieval Europe": "middle ages"
    },
    {
        " when water-powered trip hammers made the formation of plates faster and cheaper. Also, modern militaries usually do not equip their forces with the best armour available because it would be prohibitively expensive. At times the development of armour has paralleled the development of increasingly effective weaponry on the battlefield, with armourers seeking to create better protection without sacrificing mobility.     Well-known armour types in ": null
    },
    {
        "European history": "european history"
    },
    {
        " include the ": null
    },
    {
        "lorica hamata": "lorica hamata"
    },
    {
        ", ": null
    },
    {
        "lorica squamata": "lorica squamata"
    },
    {
        ", and the ": null
    },
    {
        "lorica segmentata": "lorica segmentata"
    },
    {
        " of the ": null
    },
    {
        "Roman legions": "roman legions"
    },
    {
        ", the ": null
    },
    {
        "mail": "mail"
    },
    {
        " hauberk": "hauberk"
    },
    {
        " of the early medieval age, and the full steel plate harness worn by later ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " and ": null
    },
    {
        "renaissance": "renaissance"
    },
    {
        " knight": "knight"
    },
    {
        "s, and breast and back plates worn by heavy cavalry in several European countries until the first year of World War I . The ": null
    },
    {
        "samurai": "samurai"
    },
    {
        " warriors of feudal Japan utilised ": null
    },
    {
        "many types of armour": "japanese armour"
    },
    {
        " for hundreds of years up to the 19th century.       ": null
    },
    {
        "Cuirass": "cuirass"
    },
    {
        "es and helmets were manufactured in Japan as early as the 4th century. Farris 1998,  Tankō, worn by foot soldiers and keikō, worn by horsemen were both pre-samurai types of early ": null
    },
    {
        "Japanese armour": "japanese armour"
    },
    {
        " constructed from iron plates connected together by leather thongs. Japanese lamellar armour  passed through Korea and reached Japan around the 5th century. Robinson 2002, p. 10 These early Japanese lamellar armours took the form of a sleeveless jacket, leggings and a helmet. Robinson 2002, pp. 169–170     Armour did not always cover all of the body; sometimes no more than a helmet and leg plates were worn. The rest of the body was generally protected by means of a large shield. Examples of armies equipping their troops in this fashion were the Aztecs . Fagan 2004,      In East Asia many types of armour were commonly used at different times by various cultures, including ": null
    },
    {
        "scale armour": "scale armour"
    },
    {
        ", ": null
    },
    {
        "lamellar armour": "lamellar armour"
    },
    {
        ", ": null
    },
    {
        "laminar armour": "laminar armour"
    },
    {
        ", ": null
    },
    {
        "plated mail": "plated mail"
    },
    {
        ", ": null
    },
    {
        "mail": "chainmail"
    },
    {
        ", ": null
    },
    {
        "plate armour": "plate armour"
    },
    {
        " and ": null
    },
    {
        "brigandine": "brigandine"
    },
    {
        ". Around the dynastic Tang, Song, and early Ming Period, cuirasses and plates were also used, with more elaborate versions for officers in war. The Chinese, during that time used partial plates for important body parts instead of covering their whole body since too much plate armour hinders their martial arts movement. The other body parts were covered in cloth, leather, lamellar, or Mountain pattern. In pre-Qin dynasty times, leather armour was made out of various animals, with more exotic ones such as the rhinoceros.     ": null
    },
    {
        "Mail": "mail"
    },
    {
        ", sometimes called chainmail , made of interlocking iron rings is believed to have first appeared some time after 300 BC. Its invention is credited to the ": null
    },
    {
        "Celts": "celts"
    },
    {
        "; the ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " are thought to have adopted their design. Gabriel 2007,      Gradually, small additional plates or discs of iron were added to the mail to protect vulnerable areas. Hardened leather and ": null
    },
    {
        "splinted": "splint armour"
    },
    {
        " construction were used for arm and leg pieces. The ": null
    },
    {
        "coat of plates": "coat of plates"
    },
    {
        " was developed, an armour made of large plates sewn inside a textile or leather coat.             Early plate in Italy, and elsewhere in the 13th–15th century, were made of iron. Iron armour could be ": null
    },
    {
        "carburised": "carburising"
    },
    {
        " or ": null
    },
    {
        "case hardened": "case hardening"
    },
    {
        " to give a surface of harder steel. Williams 2003, pp. 740–41. Plate armour became cheaper than mail by the 15th century as it required much less labour and labour had become much more expensive after the ": null
    },
    {
        "Black Death": "black death"
    },
    {
        ", though it did require larger furnaces to produce larger ": null
    },
    {
        "blooms": "bloomery"
    },
    {
        ". Mail continued to be used to protect those joints which could not be adequately protected by plate, such as the armpit, crook of the elbow and groin. Another advantage of plate was that a lance rest could be fitted to the breast plate. Williams 2003, p. 55     The small skull cap evolved into a bigger true helmet, the ": null
    },
    {
        "bascinet": "bascinet"
    },
    {
        ", as it was lengthened downward to protect the back of the neck and the sides of the head. Additionally, several new forms of fully enclosed helmets were introduced in the late 14th century.        Probably the most recognised style of armour in the world became the ": null
    },
    {
        "plate armour": "plate armour"
    },
    {
        " associated with the ": null
    },
    {
        "knights": "knight"
    },
    {
        "of the European ": null
    },
    {
        "Late Middle Ages": "late middle ages"
    },
    {
        ", but continuing to the early 17th century ": null
    },
    {
        "Age of Enlightenment": "age of enlightenment"
    },
    {
        " in all European countries.     By about 1400 the full harness of plate armour had been developed in armouries of Lombardy. Williams 2003, p. 53. Heavy cavalry dominated the battlefield for centuries in part because of their armour.     In the early 15th century, advances in weaponry allowed infantry to defeat armoured knights on the battlefield. The quality of the metal used in armour deteriorated as armies became bigger and armour was made thicker, necessitating breeding of larger cavalry horses. If during the 14–15th centuries armour seldom weighed more than 15  kg, then by the late 16th century it weighed 25  kg. Williams 2003, p. 916 The increasing weight and thickness of late 16th century armour therefore gave substantial resistance.     In the early years of low velocity firearms, full suits of armour, or breast plates actually stopped bullets fired from a modest distance. Crossbow bolts, if still used, would seldom penetrate good plate, nor would any bullet unless fired from close range. In effect, rather than making plate armour obsolete, the use of firearms stimulated the development of plate armour into its later stages. For most of that period, it allowed horsemen to fight while being the targets of defending arquebusiers without being easily killed. Full suits of armour were actually worn by generals and princely commanders right up to the second decade of the 18th century. It was the only way they could be mounted and survey the overall battlefield with safety from distant musket fire.     The horse was afforded protection from lances and infantry weapons by steel plate ": null
    },
    {
        "barding": "barding"
    },
    {
        ". This gave the horse protection and enhanced the visual impression of a mounted knight. Late in the era, elaborate barding was used in parade armour.          Gradually, starting in the mid-16th century, one plate element after another was discarded to save weight for foot soldiers.     Back and breast plates continued to be used throughout the entire period of the 18th century and through Napoleonic times, in many European cavalry units, until the early 20th century. From their introduction, ": null
    },
    {
        "muskets": "musket"
    },
    {
        "could pierce plate armour, so cavalry had to be far more mindful of the fire. In Japan armour continued to be used until the end of the samurai era, with the last major fighting in which armour was used happening in 1868. Robinson 1951,  ": null
    },
    {
        "Samurai armour": "japanese armour"
    },
    {
        " had one last short lived use in 1877 during the ": null
    },
    {
        "Satsuma Rebellion": "satsuma rebellion"
    },
    {
        ". Robinson 2002,      Though the age of the knight was over, armour continued to be used in many capacities. Soldiers in the American Civil War bought iron and steel vests from peddlers . The effectiveness of the vests varied widely—some successfully deflected bullets and saved lives, but others were poorly made and resulted in tragedy for the soldiers. In any case the vests were abandoned by many soldiers due to their weight on long marches as well as the stigma they got for being cowards from their fellow troops. Stewart, pp. 74–75     At the start of World War I, thousands of the French ": null
    },
    {
        "Cuirassiers": "cuirassier"
    },
    {
        "rode out to engage the German Cavalry. By that period, the shiny armour plate was covered in dark paint and a canvas wrap covered their elaborate Napoleonic style helmets. Their armour was meant to protect only against ": null
    },
    {
        "sabres": "sabre"
    },
    {
        "and light ": null
    },
    {
        "lance": "lance"
    },
    {
        "s. The cavalry had to beware of high velocity ": null
    },
    {
        "rifles": "rifle"
    },
    {
        "and ": null
    },
    {
        "machine gun": "machine gun"
    },
    {
        "s, unlike the foot soldiers, who at least had a ": null
    },
    {
        "trench": "trench"
    },
    {
        " to protect them.       Today, ": null
    },
    {
        "ballistic vest": "ballistic vest"
    },
    {
        "s, also known as ": null
    },
    {
        "flak jacket": "flak jacket"
    },
    {
        "s, made of ballistic cloth  and ceramic or metal plates are common among police forces, ": null
    },
    {
        "security staff": "security guard"
    },
    {
        ", ": null
    },
    {
        "corrections officers": "prison officer"
    },
    {
        " and some branches of the military.     The US Army has adopted ": null
    },
    {
        "Interceptor body armour": "interceptor body armour"
    },
    {
        ", which uses Enhanced Small Arms Protective Inserts in the chest, sides, and back of the armour. Each plate is rated to stop a range of ammunition including 3 hits from a ": null
    },
    {
        "7.62×51 NATO": "7.62×51 nato"
    },
    {
        " AP round at a range of . ArmorUP ": null
    },
    {
        "Dragon Skin": "dragon skin"
    },
    {
        " Museum of Islamic Art, Doha": "museum of islamic art, doha"
    },
    {
        " in ": null
    },
    {
        "Qatar": "qatar"
    },
    {
        "      The first modern production technology for armour plating was used by navies in the construction of the ": null
    },
    {
        "Ironclad warship": "ironclad warship"
    },
    {
        ", reaching its pinnacle of development with the ": null
    },
    {
        "battleship": "battleship"
    },
    {
        ". The first ": null
    },
    {
        "tanks": "tank"
    },
    {
        "were produced during World War I. Aerial armour has been used to protect pilots and aircraft systems since the First World War.     In modern ground forces usage, the meaning of armour has expanded to include the role of troops in combat. After the evolution of ": null
    },
    {
        "armoured warfare": "armoured warfare"
    },
    {
        ", ": null
    },
    {
        "mechanised infantry": "mechanised infantry"
    },
    {
        " were mounted in armoured fighting vehicles and replaced ": null
    },
    {
        "light infantry": "light infantry"
    },
    {
        " in many situations. In modern armoured warfare, armoured units equipped with tanks and ": null
    },
    {
        "infantry fighting vehicles": "infantry fighting vehicle"
    },
    {
        "serve the historic role of both the ": null
    },
    {
        "battle cavalry": "heavy cavalry"
    },
    {
        ", ": null
    },
    {
        "light cavalry": "light cavalry"
    },
    {
        " and ": null
    },
    {
        "dragoon": "dragoon"
    },
    {
        "s, and belong to the armoured branch.                   The first ": null
    },
    {
        "ironclad": "ironclad"
    },
    {
        " battleship, with iron armour over a wooden hull,  La Gloire , was launched by the ": null
    },
    {
        "French Navy": "french navy"
    },
    {
        " in 1859 Sondhaus, pp. 73–74 prompting the British ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " to build a counter. The following year they launched ": null
    },
    {
        "HMS Warrior": "hms warrior"
    },
    {
        ", which was twice the size and had iron armour over an iron hull. After the ": null
    },
    {
        "first battle between two ironclads": "battle of hampton roads"
    },
    {
        " took place in 1862 during the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ", it became clear that the ironclad had replaced the ": null
    },
    {
        "unarmoured line-of-battle ship": "ship of the line"
    },
    {
        " as the most powerful warship afloat. Sondhaus, p. 86.     Ironclads were designed for several roles, including as high seas ": null
    },
    {
        "battleship": "battleship"
    },
    {
        "s, coastal defence ships, and long-range ": null
    },
    {
        "cruiser": "cruiser"
    },
    {
        "s. The rapid evolution of warship design in the late 19th century transformed the ironclad from a wooden-hulled vessel which carried sails to supplement its steam engines into the steel-built, turreted battleships and cruisers familiar in the 20th century. This change was pushed forward by the development of heavier naval guns , more sophisticated steam engines, and advances in metallurgy which made steel shipbuilding possible.     The rapid pace of change in the ironclad period meant that many ships were obsolete as soon as they were complete, and that naval tactics were in a state of flux. Many ironclads were built to make use of the ": null
    },
    {
        "ram": "naval ram"
    },
    {
        " or the ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        ", which a number of naval designers considered the crucial weapons of naval combat. There is no clear end to the ironclad period, but towards the end of the 1890s the term ironclad dropped out of use. New ships were increasingly constructed to a standard pattern and designated battleships or ": null
    },
    {
        "armoured cruiser": "armoured cruiser"
    },
    {
        "s.            ": null
    },
    {
        "Armoured trains": "armoured train"
    },
    {
        "saw use during the 19th century in the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " , the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        " , the ": null
    },
    {
        "First": "first boer war"
    },
    {
        " and ": null
    },
    {
        "Second": "second boer war"
    },
    {
        " Boer Wars ,the ": null
    },
    {
        "Polish–Soviet War": "polish–soviet war"
    },
    {
        " ; the ": null
    },
    {
        "First": "world war i"
    },
    {
        " and ": null
    },
    {
        "Second World Wars": "world war ii"
    },
    {
        " and the ": null
    },
    {
        "First Indochina War": "first indochina war"
    },
    {
        " . The most intensive use of armoured trains was during the ": null
    },
    {
        "Russian Civil War": "russian civil war"
    },
    {
        " .     ": null
    },
    {
        "Armoured cars": "armored car"
    },
    {
        " saw use during World wars 1 and 2.     During the ": null
    },
    {
        "Second Boer War": "second boer war"
    },
    {
        " on 15 November 1899, ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        ", then a war-correspondent, was travelling on board an armoured train when it was ambushed by Boer commandos. Churchill and many of the trains garrison were captured, though many others escaped, including wounded placed on the trains engine.            Ancient ": null
    },
    {
        "siege engines": "siege engines"
    },
    {
        " were usually protected by wooden armour, often covered with wet hides or thin metal to prevent being easily burned.     Medieval ": null
    },
    {
        "war wagons": "war wagon"
    },
    {
        "were horse-drawn wagons that were similarly armoured. These contained guns or crossbowmen that could fire through gun-slits.     The first modern ": null
    },
    {
        "AFVs": "armoured fighting vehicle"
    },
    {
        " were ": null
    },
    {
        "armoured cars": "armored car"
    },
    {
        ", developed circa 1900. These started as ordinary wheeled motor-cars protected by iron shields, typically mounting a ": null
    },
    {
        "machine gun": "machine gun"
    },
    {
        ". Macksey, Kenneth . The Guinness Book of Tank Facts and Feats. Guinness Superlatives Limited, .     During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the stalemate of ": null
    },
    {
        "trench warfare": "trench warfare"
    },
    {
        " during on the ": null
    },
    {
        "Western Front": "western front"
    },
    {
        " spurred the development of the ": null
    },
    {
        "tank": "tank"
    },
    {
        ". It was envisioned as an armoured machine that could advance under fire from enemy rifles and machine guns, and respond with its own heavy guns. It utilized ": null
    },
    {
        "caterpillar tracks": "caterpillar track"
    },
    {
        "to cross ground broken up by shellfire and trenches.       With the development of effective ": null
    },
    {
        "anti-aircraft artillery": "anti-aircraft artillery"
    },
    {
        " in the period before the Second World War, military pilots, once the knights of the air during the First World War, became far more vulnerable to ground fire. As a response armour plating was added to aircraft to protect aircrew and vulnerable areas such as fuel tanks and engine.               Tank armour has progressed from the Second World War armour forms, now incorporating not only harder ": null
    },
    {
        "composites": "composite armour"
    },
    {
        ", but also ": null
    },
    {
        "reactive armour": "reactive armour"
    },
    {
        " designed to defeat ": null
    },
    {
        "shaped charge": "shaped charge"
    },
    {
        "s. As a result of this, the ": null
    },
    {
        "main battle tank": "main battle tank"
    },
    {
        " conceived in the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " era can survive multiple ": null
    },
    {
        "RPG": "rocket-propelled grenade"
    },
    {
        " strikes with minimal effect on the crew or the operation of the vehicle. The ": null
    },
    {
        "light tanks": "light tank"
    },
    {
        "that were the last descendants of the ": null
    },
    {
        "light cavalry": "light cavalry"
    },
    {
        " during the Second World War have almost completely disappeared from the worlds militaries due to increased lethality of the weapons available to the vehicle-mounted infantry.     The ": null
    },
    {
        "armoured personnel carrier": "armoured personnel carrier"
    },
    {
        " was devised during World War I. It allows the safe and rapid movement of infantry in a combat zone, minimising casualties and maximising mobility. APCs are fundamentally different from the previously used armoured ": null
    },
    {
        "half-tracks": "half-track"
    },
    {
        "in that they offer a higher level of protection from artillery ": null
    },
    {
        "burst": "air burst"
    },
    {
        " fragments, and greater mobility in more terrain types. The basic APC design was substantially expanded to an ": null
    },
    {
        "Infantry fighting vehicle": "infantry fighting vehicle"
    },
    {
        " when properties of an armoured personnel carrier and a ": null
    },
    {
        "light tank": "light tank"
    },
    {
        " were combined in one vehicle.     Naval armour has fundamentally changed from the Second World War doctrine of thicker plating to defend against ": null
    },
    {
        "shells": "shell"
    },
    {
        ", ": null
    },
    {
        "bombs": "bomb"
    },
    {
        "and ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        "es. Passive defence naval armour is limited to ": null
    },
    {
        "kevlar": "kevlar"
    },
    {
        " or steel  protecting particularly vital areas from the effects of nearby impacts. Since ships cannot carry enough armour to completely prevent penetration by ": null
    },
    {
        "anti-ship missile": "anti-ship missile"
    },
    {
        "s, they depend more on destroying an incoming missile before it hits, or causing it to miss its target.     Although the role of the ground attack aircraft significantly diminished after the ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        ", it re-emerged during the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", and in the recognition of this, the US Air Force authorised the design and production of what became the ": null
    },
    {
        "A-10": "a-10 thunderbolt ii"
    },
    {
        " dedicated anti-armour and ": null
    },
    {
        "ground-attack aircraft": "ground-attack aircraft"
    },
    {
        " that first saw action in the ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        ".     ": null
    },
    {
        "High-voltage transformer fire barriers": "high-voltage transformer fire barriers"
    },
    {
        " are often required to defeat ": null
    },
    {
        "ballistics": "ballistics"
    },
    {
        " from small arms as well as projectiles from ": null
    },
    {
        "transformer bushings": "bushing"
    },
    {
        " and ": null
    },
    {
        "lightning arrester": "lightning arrester"
    },
    {
        "s, which form part of large electrical ": null
    },
    {
        "transformer": "transformer"
    },
    {
        "s, per . Such fire barriers may be designed to inherently function as armour, or may be ": null
    },
    {
        "passive fire protection": "passive fire protection"
    },
    {
        " materials augmented by armour, where care must be taken to ensure that the armours reaction to fire does not cause issues with regards to the fire barrier being armoured to defeat explosions and projectiles in addition to fire, especially since both functions must be provided simultaneously, meaning they must be fire-tested together to provide realistic evidence of fitness for purpose.     ": null
    },
    {
        "Combat drones": "unmanned combat aerial vehicle"
    },
    {
        " use little to no vehicular armour as they are not manned vessels, this results in them being lightweight and small in size.                   Barding  is ": null
    },
    {
        "body armour": "body armour"
    },
    {
        " for ": null
    },
    {
        "war horses": "horses in warfare"
    },
    {
        ", especially as used by European ": null
    },
    {
        "knight": "knight"
    },
    {
        "s.     During the late ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " as armour protection for knights became more effective, their mounts became targets. This vulnerability was exploited by the ": null
    },
    {
        "Scots": "scotland"
    },
    {
        " at the ": null
    },
    {
        "Battle of Bannockburn": "battle of bannockburn"
    },
    {
        " in the 14th century, when horses were killed by the infantry, and for the ": null
    },
    {
        "English": "england"
    },
    {
        " at the ": null
    },
    {
        "Battle of Crécy": "battle of crécy"
    },
    {
        " in the same century where ": null
    },
    {
        "longbowmen": "english longbow"
    },
    {
        " shot horses and the then dismounted ": null
    },
    {
        "French": "france"
    },
    {
        " knights were killed by ": null
    },
    {
        "heavy infantry": "heavy infantry"
    },
    {
        ". Barding developed as a response to such events.     Examples of armour for horses could be found as far back as ": null
    },
    {
        "classical antiquity": "classical antiquity"
    },
    {
        ". ": null
    },
    {
        "Cataphracts": "cataphracts"
    },
    {
        ", with ": null
    },
    {
        "scale armour": "scale armour"
    },
    {
        " for both rider and horse, are believed by many historians to have influenced the later European knights, via contact with the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ". Nell, Grant S. The Savaran: The Original Knights. University of Oklahoma Press.     Surviving period examples of barding are rare; however, complete sets are on display at the ": null
    },
    {
        "Philadelphia Museum of Art": "philadelphia museum of art"
    },
    {
        ",  at the ": null
    },
    {
        "Philadelphia Museum of Art": "philadelphia museum of art"
    },
    {
        " the ": null
    },
    {
        "Wallace Collection": "wallace collection"
    },
    {
        " in ": null
    },
    {
        "London": "london"
    },
    {
        ", the ": null
    },
    {
        "Royal Armouries": "royal armouries"
    },
    {
        " in ": null
    },
    {
        "Leeds": "leeds"
    },
    {
        ", and the ": null
    },
    {
        "Metropolitan Museum of Art": "metropolitan museum of art"
    },
    {
        " in ": null
    },
    {
        "New York": "new york city"
    },
    {
        ". Horse armour could be made in whole or in part of ": null
    },
    {
        "cuir bouilli": "cuir bouilli"
    }
]