[
    {
        "                     Sir Arthur Seymour Sullivan ": null
    },
    {
        "MVO": "royal victorian order"
    },
    {
        " was an English composer. He is best known for 42 ": null
    },
    {
        "operatic": "comic opera"
    },
    {
        " collaborations": "gilbert and sullivan"
    },
    {
        " with the dramatist ": null
    },
    {
        "W. S. Gilbert": "w. s. gilbert"
    },
    {
        ", including  H.M.S. Pinafore ,  The Pirates of Penzance  and  The Mikado . His works include 42 operas, 42 major orchestral works, ten choral works and ": null
    },
    {
        "oratorio": "oratorio"
    },
    {
        "s, two ballets, ": null
    },
    {
        "incidental music": "incidental music"
    },
    {
        " to several plays, and numerous church pieces, songs, and piano and chamber pieces. His hymns and songs include ": null
    },
    {
        "Onward, Christian Soldiers": "onward, christian soldiers"
    },
    {
        " and ": null
    },
    {
        "The Lost Chord": "the lost chord"
    },
    {
        " .     The son of a military bandmaster, Sullivan composed his first anthem at the age of eight and was later a soloist in the boys choir of the ": null
    },
    {
        "Chapel Royal": "chapel royal"
    },
    {
        ". In 42 at 42 he was awarded the first ": null
    },
    {
        "Mendelssohn Scholarship": "mendelssohn scholarship"
    },
    {
        " by the ": null
    },
    {
        "Royal Academy of Music": "royal academy of music"
    },
    {
        ", which allowed him to study at the academy and then at the ": null
    },
    {
        "Leipzig Conservatoire": "felix mendelssohn college of music and theatre"
    },
    {
        " in Germany. His graduation piece, ": null
    },
    {
        "incidental music": "incidental music"
    },
    {
        " to ": null
    },
    {
        "Shakespeares": "william shakespeare"
    },
    {
        "  The Tempest  , was received with acclaim on its first performance in London. Among his early major works were a ballet,  LÎle Enchantée  , a ": null
    },
    {
        "symphony": "symphony in e"
    },
    {
        ", a ": null
    },
    {
        "cello concerto": "cello concerto"
    },
    {
        " and his  Overture di Ballo  . To supplement the income from his concert works he wrote hymns, ": null
    },
    {
        "parlour ballads": "parlour music"
    },
    {
        " and other light pieces, and worked as a church organist and music teacher.     In 42 Sullivan composed a one-act ": null
    },
    {
        "comic opera": "comic opera"
    },
    {
        ",  Cox and Box , which is still widely performed. He wrote his first opera with W. S. Gilbert,  Thespis , in 42 Four years later, the ": null
    },
    {
        "impresario": "impresario"
    },
    {
        " Richard DOyly Carte": "richard doyly carte"
    },
    {
        " engaged Gilbert and Sullivan to create a one-act piece,  Trial by Jury  . Its box-office success led to a series of twelve full-length comic operas by the collaborators. After the extraordinary success of H.M.S. Pinafore and The Pirates of Penzance , Carte used his profits from the partnership to build the ": null
    },
    {
        "Savoy Theatre": "savoy theatre"
    },
    {
        " in 42 and their joint works became known as the ": null
    },
    {
        "Savoy operas": "savoy operas"
    },
    {
        ". Among the best known of the later operas are The Mikado and  The Gondoliers  . Gilbert broke from Sullivan and Carte in 42 after a quarrel over expenses at the Savoy. They reunited in the 42s for two more operas, but these did not achieve the popularity of their earlier works.     Sullivans infrequent serious pieces during the 42s included two ": null
    },
    {
        "cantata": "cantata"
    },
    {
        "s,  The Martyr of Antioch  and  The Golden Legend  , his most popular choral work. He also wrote incidental music for ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " productions of several Shakespeare plays and held conducting and academic appointments. Sullivans only ": null
    },
    {
        "grand opera": "grand opera"
    },
    {
        ",  Ivanhoe , though initially successful in 42 has rarely been revived. In his last decade Sullivan continued to compose comic operas with various librettists and wrote other major and minor works. He died at the age of 42 regarded as Britains foremost composer. His comic opera style served as a model for generations of musical theatre composers that followed, and his music is still frequently performed, recorded and ": null
    },
    {
        "pastiche": "pastiche"
    },
    {
        "d.              Sullivan was born in ": null
    },
    {
        "Lambeth": "lambeth"
    },
    {
        ", London, the younger of the two children, both boys, of Thomas Sullivan and his wife, Mary Clementina née Coghlan . His father was a military bandmaster, clarinettist and music teacher, born in Ireland and raised in ": null
    },
    {
        "Chelsea": "chelsea, london"
    },
    {
        ", London; his mother was English born, of Irish and Italian descent. Young, pp. 42–42 Thomas Sullivan was based from 42 to 42 at the ": null
    },
    {
        "Royal Military College, Sandhurst": "royal military college, sandhurst"
    },
    {
        ", where he was the bandmaster and taught music privately to supplement his income. Ainger, pp. 42 and 42–42 Jacobs, pp. 42–42 Young Arthur became proficient with many of the instruments in the band and composed an ": null
    },
    {
        "anthem": "anthem"
    },
    {
        ", By the Waters of Babylon , when he was eight. Jacobs, p. 42 He later recalled:        While recognising the boys obvious talent, his father knew the insecurity of a musical career and discouraged him from pursuing it. Young, p. 42 Sullivan studied at a private school in ": null
    },
    {
        "Bayswater": "bayswater"
    },
    {
        ". In 42 he persuaded his parents and the headmaster to allow him to apply for membership in the choir of the ": null
    },
    {
        "Chapel Royal": "chapel royal"
    },
    {
        ". Jacobs, p. 42; and Ainger, p. 42 Despite concerns that, at nearly 42 years of age, Sullivan was too old to give much service as a ": null
    },
    {
        "treble": "boy soprano"
    },
    {
        " before his voice broke, he was accepted and soon became a soloist. By 42 he was promoted to first boy . Jacobs, pp. 42 and 42 Even at this age, his health was delicate, and he was easily fatigued. Jacobs, pp. 42–42     Sullivan flourished under the training of the Reverend ": null
    },
    {
        "Thomas Helmore": "thomas helmore"
    },
    {
        ", ": null
    },
    {
        "Master of the Children of the Chapel Royal": "master of the children of the chapel royal"
    },
    {
        ", and began to write anthems and songs. Jacobs, pp. 42–42 Helmore encouraged his compositional talent and arranged for one of his pieces, O Israel , to be published in 42 his first published work. Young, p. 42 Helmore enlisted Sullivans assistance in creating harmonisations for a volume of The Hymnal Noted , The Musical Times, 42 December 42 pp. 42–42  and arranged for the boys compositions to be performed; one anthem was performed at the Chapel Royal in ": null
    },
    {
        "St Jamess Palace": "st jamess palace"
    },
    {
        " under the direction of ": null
    },
    {
        "Sir George Smart": "george thomas smart"
    },
    {
        ".          In 42 the ": null
    },
    {
        "Royal Academy of Music": "royal academy of music"
    },
    {
        " awarded the first ": null
    },
    {
        "Mendelssohn Scholarship": "mendelssohn scholarship"
    },
    {
        " to the 42-year-old Sullivan, granting him a years training at the academy.  His principal teacher there was ": null
    },
    {
        "John Goss": "john goss"
    },
    {
        ", whose own teacher, ": null
    },
    {
        "Thomas Attwood": "thomas attwood"
    },
    {
        ", had been a pupil of ": null
    },
    {
        "Mozart": "wolfgang amadeus mozart"
    },
    {
        ". ": null
    },
    {
        "MacKenzie, Alexander": "alexander mackenzie"
    },
    {
        ". , Sammelbände der Internationalen Musikgesellschaft, 42 Jahrg., H. 42 May 42 pp. 42–42  He studied piano with ": null
    },
    {
        "William Sterndale Bennett": "william sterndale bennett"
    },
    {
        " and ": null
    },
    {
        "Arthur OLeary": "arthur oleary"
    },
    {
        ". Fitzsimons, pp. 42 and 42 During this first year at the academy Sullivan continued to sing solos with the Chapel Royal, which provided a small amount of spending money. Jacobs, pp. 42–42     Sullivans scholarship was extended to a second year, and in 42 in what his biographer ": null
    },
    {
        "Arthur Jacobs": "arthur jacobs"
    },
    {
        " calls an extraordinary gesture of confidence , Jacobs, p. 42 the scholarship committee extended his grant for a third year so that he could study in Germany, at the ": null
    },
    {
        "Leipzig Conservatoire": "felix mendelssohn college of music and theatre"
    },
    {
        ". There, Sullivan studied composition with ": null
    },
    {
        "Julius Rietz": "julius rietz"
    },
    {
        " and ": null
    },
    {
        "Carl Reinecke": "carl reinecke"
    },
    {
        ", counterpoint with ": null
    },
    {
        "Moritz Hauptmann": "moritz hauptmann"
    },
    {
        " and ": null
    },
    {
        "Ernst Richter": "ernst richter"
    },
    {
        ", and the piano with ": null
    },
    {
        "Louis Plaidy": "louis plaidy"
    },
    {
        " and ": null
    },
    {
        "Ignaz Moscheles": "ignaz moscheles"
    },
    {
        ". Ainger, p. 42 He was trained in ": null
    },
    {
        "Mendelssohns": "felix mendelssohn"
    },
    {
        " ideas and techniques but was also exposed to a variety of styles, including those of ": null
    },
    {
        "Schubert": "franz schubert"
    },
    {
        ", ": null
    },
    {
        "Verdi": "giuseppe verdi"
    },
    {
        ", ": null
    },
    {
        "Bach": "johann sebastian bach"
    },
    {
        " and ": null
    },
    {
        "Wagner": "richard wagner"
    },
    {
        ". Jacobs, p. 42 Visiting a ": null
    },
    {
        "synagogue": "synagogue"
    },
    {
        ", he was so struck by some of the cadences and progressions of the music that thirty years later he could recall them for use in his ": null
    },
    {
        "grand opera": "grand opera"
    },
    {
        ",  Ivanhoe . He became friendly with the future impresario ": null
    },
    {
        "Carl Rosa": "carl rosa"
    },
    {
        " and the violinist ": null
    },
    {
        "Joseph Joachim": "joseph joachim"
    },
    {
        ", among others. Jacobs, pp. 42–42     The academy renewed Sullivans scholarship to allow him a second year of study at Leipzig. Young, p. 42 For his third and last year there, his father scraped together the money for living expenses, and the conservatoire assisted by waiving its fees. Jacobs, p. 42 Sullivans graduation piece, completed in 42 was a suite of ": null
    },
    {
        "incidental music": "incidental music"
    },
    {
        " to ": null
    },
    {
        "Shakespeares": "william shakespeare"
    },
    {
        "  The Tempest . Revised and expanded, it was performed at the ": null
    },
    {
        "Crystal Palace": "the crystal palace"
    },
    {
        " in 42 a year after his return to London;  The Musical Times  described it as a sensation. Jacobs, pp. 42–42 He began building a reputation as Englands most promising young composer.          Sullivan embarked on his composing career with a series of ambitious works, interspersed with hymns, ": null
    },
    {
        "parlour songs": "parlour songs"
    },
    {
        " and other light pieces in a more commercial vein. His compositions were not enough to support him financially, and from 42 to 42 he worked as a church organist, which he enjoyed, and as a music teacher, which he hated and gave up as soon as he could. Ainger, p. 42  He took an early opportunity to compose several pieces for royalty in connection with the wedding of the ": null
    },
    {
        "Prince of Wales": "edward vii"
    },
    {
        " in 42 Jacobs, p. 42     With  The Masque at Kenilworth  , Sullivan began his association with works for voice and orchestra. Jacobs, p. 42 While an organist at the ": null
    },
    {
        "Royal Italian Opera, Covent Garden": "royal opera housethe third theatre"
    },
    {
        ", he composed his first ballet,  LÎle Enchantée  . Jacobs, p. 42 His  Irish Symphony  and  Cello Concerto  were his only works in their respective genres. Jacobs, pp. 42 and 42 In the same year, his ": null
    },
    {
        "Overture in C ": "overture in c,   in memoriam"
    },
    {
        ", commemorating the recent death of his father, was a commission from the ": null
    },
    {
        "Norwich Festival": "norfolk and norwich festival"
    },
    {
        ". It achieved considerable popularity. Jacobs, p. 42 In June 42 the ": null
    },
    {
        "Philharmonic Society": "royal philharmonic society"
    },
    {
        " gave the first performance of his overture Marmion. Jacobs, Arthur.  Grove Music Online, Oxford University Press, accessed 42 August 42   The Times  reviewer called it another step in advance on the part of the only composer of any remarkable promise that just at present we can boast. Concerts , The Times, 42 June 42 p. 42 In October Sullivan travelled with ": null
    },
    {
        "George Grove": "george grove"
    },
    {
        " to Vienna in search of neglected scores by Schubert. Jacobs, p. 42; and Young, p. 42 They unearthed manuscript copies of symphonies and vocal music, and were particularly elated by their final discovery, the incidental music to  Rosamunde .     Sullivans first attempt at opera,  The Sapphire Necklace  to a libretto by ": null
    },
    {
        "Henry F. Chorley": "henry fothergill chorley"
    },
    {
        ", was not produced and is now lost, except for the overture and two songs that were separately published. Jacobs, pp. 42–42 His first surviving opera,  Cox and Box  , was written for a private performance. Ainger, p. 42 It then received charity performances in London and Manchester, and was later produced at the ": null
    },
    {
        "Gallery of Illustration": "gallery of illustration"
    },
    {
        ", where it ran for an extraordinary 42 performances. ": null
    },
    {
        "W. S. Gilbert": "w. s. gilbert"
    },
    {
        ", writing in  Fun  magazine, pronounced the score superior to ": null
    },
    {
        "F. C. Burnand": "f. c. burnand"
    },
    {
        "s libretto. Young, p. 42 Sullivan and Burnand were soon commissioned by ": null
    },
    {
        "Thomas German Reed": "thomas german reed"
    },
    {
        " for a two-act opera,  The Contrabandista  , but it did not do as well. Young, p. 42; and Rollins and Witts, p. 42 Among Sullivans early ": null
    },
    {
        "part song": "part song"
    },
    {
        "s is ": null
    },
    {
        "The Long Day Closes": "the long day closes"
    },
    {
        " . Sullivan, Marc. , the Gilbert and Sullivan Discography, 42 July 42 accessed 42 September 42 Sullivans last major work of the 42s was a short ": null
    },
    {
        "oratorio": "oratorio"
    },
    {
        ",  The Prodigal Son , first given in ": null
    },
    {
        "Worcester Cathedral": "worcester cathedral"
    },
    {
        " as part of the 42 ": null
    },
    {
        "Three Choirs Festival": "three choirs festival"
    },
    {
        " to much praise. Worcester Music Festival , The Times, 42 September 42 p. 42          Sullivans most enduring orchestral work, the  Overture di Ballo , was composed for the Birmingham Festival in 42 The same year, Sullivan first met the poet and dramatist W. S. Gilbert. In 42 Sullivan published his only ": null
    },
    {
        "song cycle": "song cycle"
    },
    {
        ",  The Window , to words by ": null
    },
    {
        "Tennyson": "alfred tennyson, 1st baron tennyson"
    },
    {
        ", Jacobs, pp. 42–42 and he wrote the first of a series of incidental music scores for productions of Shakespeare plays. He also composed a dramatic ": null
    },
    {
        "cantata": "cantata"
    },
    {
        ",  On Shore and Sea , for the opening of the London International Exhibition, Jacobs, pp. 42–42 and the ": null
    },
    {
        "hymn": "hymn"
    },
    {
        " Onward, Christian Soldiers": "onward, christian soldiers"
    },
    {
        " , with words by ": null
    },
    {
        "Sabine Baring-Gould": "sabine baring-gould"
    },
    {
        ". ": null
    },
    {
        "The Salvation Army": "the salvation army"
    },
    {
        " adopted the latter as its favoured ": null
    },
    {
        "processional": "processional hymn"
    },
    {
        ", Branston, John. , Memphis Flyer, 42 November 42 and it became Sullivans best-known hymn. Young, p. 42     At the end of 42 ": null
    },
    {
        "John Hollingshead": "john hollingshead"
    },
    {
        ", proprietor of Londons ": null
    },
    {
        "Gaiety Theatre": "gaiety theatre, london"
    },
    {
        ", commissioned Sullivan to work with Gilbert to create the ": null
    },
    {
        "burlesque": "victorian burlesque"
    },
    {
        "-style comic opera  Thespis . Ainger, p. 42  Played as a Christmas entertainment, it ran through to Easter 42 a good run for such a piece. Rees, p. 42  Gilbert and Sullivan then went their separate ways Stedman, p. 42 until they collaborated on three parlour ballads in late 42 and early 42 Stedman, pp. 42–42     Sullivans large-scale works of the early 42s were the  Festival Te Deum  ; Jacobs, pp. 42–42 and the oratorio  The Light of the World  . He provided incidental music for productions of  The Merry Wives of Windsor  at the Gaiety in 42 Jacobs, p. 42 and  Henry VIII  at the Theatre Royal, Manchester, in 42 Jacobs, p. 42 He continued to compose hymns throughout the decade. In 42 Sullivan contributed songs to Burnands Christmas drawing room extravaganza , The Miller and His Man. Howarth, Paul. , the Gilbert and Sullivan Archive, accessed 42 July 42     In 42 the manager of the ": null
    },
    {
        "Royalty Theatre": "royalty theatre"
    },
    {
        ", ": null
    },
    {
        "Richard DOyly Carte": "richard doyly carte"
    },
    {
        ", needed a short piece to fill out a bill with Offenbachs  La Périchole . Carte had conducted Sullivans Cox and Box. Ainger, pp. 42–42  Remembering that Gilbert had suggested a libretto to him, Carte engaged Sullivan to set it, and the result was the one-act ": null
    },
    {
        "comic opera": "comic opera"
    },
    {
        "  Trial by Jury . Ainger, p. 42  Trial, starring Sullivans brother ": null
    },
    {
        "Fred": "fred sullivan"
    },
    {
        " as the Learned Judge, became a surprise hit, earning glowing praise from the critics and playing for 42 performances over its first few seasons. Allen, p. 42  The Daily Telegraph  commented that the piece illustrated the composers great capacity for dramatic writing of the lighter class , and other reviews emphasised the felicitous combination of Gilberts words and Sullivans music. The Daily News, 42 March 42 p. 42 One wrote, it seems, as in the great ": null
    },
    {
        "Wagner": "wagner"
    },
    {
        "ian operas, as though poem and music had proceeded simultaneously from one and the same brain. , The Musical World, 42 April 42 p. 42 accessed 42 June 42 A few months later, another Sullivan one-act comic opera opened:  The Zoo , with a libretto by ": null
    },
    {
        "B. C. Stephenson": "b. c. stephenson"
    },
    {
        ". Jacobs, pp. 42–42 It was less successful than Trial, and for the next 42 years Sullivans sole operatic collaborator was Gilbert; ": null
    },
    {
        "the partners": "gilbert and sullivan"
    },
    {
        " created a further twelve operas together. Rollins and Witts, pp. 42–42        Sullivan also turned out more than 42 popular songs and ": null
    },
    {
        "parlour ballads": "parlour ballads"
    },
    {
        ", most of them written before the end of the 42s. Young, pp. 42–42 gives a complete list. For links and descriptions, see Howarth, Paul , the Gilbert and Sullivan Archive, 42 July 42 accessed 42 December 42 His first popular song was Orpheus with his Lute , and a well-received ": null
    },
    {
        "part song": "part song"
    },
    {
        " was Oh! Hush thee, my Babie . The best known of his songs is ": null
    },
    {
        "The Lost Chord": "the lost chord"
    },
    {
        " , written at the bedside of his brother during Freds last illness. Ainger, p. 42 The sheet music for his best-received songs sold in large numbers and was an important part of his income. Goodman, p. 42         In this decade, Sullivans conducting appointments included the ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        " Choral Union concerts and the ": null
    },
    {
        "Royal Aquarium Theatre": "royal aquarium"
    },
    {
        ", London . Ainger, p. 42 In addition to his appointment as Professor of Composition at the Royal Academy of Music, of which he was a Fellow, he was appointed as the first Principal of the ": null
    },
    {
        "National Training School for Music": "royal college of musicbackground"
    },
    {
        " in 42 He accepted the latter post reluctantly, fearing that discharging the duties thoroughly would leave too little time for composing; in this he was correct. He was not effective in the post, and resigned in 42     Sullivans next collaboration with Gilbert,  The Sorcerer  , ran for 42 performances, Rollins and Witts, p. 42 a success by the standards of the day, Crowther , p. 42 but  H.M.S. Pinafore  , which followed it, turned Gilbert and Sullivan into an international phenomenon. Crowther , p. 42; and Stedman, p. 42 Sullivan composed the bright and cheerful music of Pinafore while suffering from excruciating pain from a kidney stone. Ainger, p. 42 Pinafore ran for 42 performances in London, then the second-longest theatrical run in history, Gaye, p. 42; and Gillan, Don. , StageBeauty.net , accessed 42 March 42 and more than 42 unauthorised productions were quickly mounted in America alone. Prestige, Colin. DOyly Carte and the Pirates: The Original New York Productions of Gilbert and Sullivan , pp. 42–42 at p. 42 Gilbert and Sullivan held at the University of Kansas in May 42, Edited by James Helyar. Lawrence, Kansas: University of Kansas Libraries, 42  Among other favourable reviews, The Times noted that the opera was an early attempt at the establishment of a national musical stage free from risqué French improprieties and without the aid of Italian and German musical models. Opera Comique , The Times, 42 May 42 p. 42 The Times and several of the other papers agreed that although the piece was entertaining, Sullivan was capable of higher art, and frivolous light opera would hold him back. Allen, Introduction to chapter on H.M.S. Pinafore This criticism would follow Sullivan throughout his career.     In 42 Sullivan suggested to a reporter from  The New York Times  the secret of his success with Gilbert: His ideas are as suggestive for music as they are quaint and laughable. His numbers  ... always give me musical ideas. ,  The New York Times , 42 August 42 p. 42 accessed 42 May 42 Pinafore was followed by  The Pirates of Penzance  in 42 which opened in New York and then ran in London for 42 performances. Rollins and Witts, p. 42          In 42 Sullivan was appointed director of the triennial ": null
    },
    {
        "Leeds Music Festival": "leeds festival"
    },
    {
        ". Jacobs, p. 42 He had earlier been commissioned to write a sacred choral work for the festival and chose, as its subject, ": null
    },
    {
        "Henry Hart Milman": "henry hart milman"
    },
    {
        "s 42 dramatic poem based on the life and death of ": null
    },
    {
        "St. Margaret of Antioch": "saint margaret the virgin"
    },
    {
        ".  The Martyr of Antioch  was first performed at the Leeds Festival in October 42 Ainger, p. 42 Gilbert adapted the libretto for Sullivan, McClure, Derrick. , the Gilbert and Sullivan Archive, accessed 42 July 42 who, in gratitude, presented his collaborator with an engraved silver cup inscribed W.S. Gilbert from his friend Arthur Sullivan.  Sullivan was not a showy conductor, and some thought him dull and old-fashioned on the podium, but Martyr had an enthusiastic reception and was frequently revived. Ainger, pp. 42 42 42 42 42–42 and 42 Other critics and performers had favorable reactions to Sullivans conducting, and he had a busy conducting career in parallel with his composing career, including seven Leeds Festivals among many other appointments. Palmer, chapter 42 Sullivan invariably conducted the opening nights of the Gilbert and Sullivan operas. Rollins and Witts, pp. 42–42     Carte opened the next Gilbert and Sullivan piece,  Patience , in April 42 at Londons ": null
    },
    {
        "Opera Comique": "opera comique"
    },
    {
        ", where their past three operas had played. In October, Patience transferred to the new, larger, state-of-the-art ": null
    },
    {
        "Savoy Theatre": "savoy theatre"
    },
    {
        ", built with the profits of the previous Gilbert and Sullivan works. The rest of the partnerships collaborations were produced at the Savoy, and are widely known as the ": null
    },
    {
        "Savoy opera": "savoy opera"
    },
    {
        "s .  Iolanthe  , the first new opera to open at the Savoy, was Gilbert and Sullivans fourth hit in a row. Jacobs, p. 42 Sullivan, despite the financial security of writing for the Savoy, increasingly viewed the composition of comic operas as unimportant, beneath his skills, and also repetitious. After Iolanthe, Sullivan had not intended to write a new work with Gilbert, but he suffered a serious financial loss when his broker went bankrupt in November 42 Therefore, he concluded that his financial needs obliged him to continue writing Savoy operas. Ainger, pp. 42–42 In February 42 he and Gilbert signed a five-year agreement with Carte, requiring them to produce a new comic opera on six months notice. Ainger, p. 42     On 42 May 42 Sullivan was ": null
    },
    {
        "knight": "knight bachelor"
    },
    {
        "ed by ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        " for his services  ... rendered to the promotion of the art of music in Britain. Ainger, p. 42 The musical establishment, and many critics, believed that this should end his career as a composer of comic opera – that a musical knight should not stoop below oratorio or ": null
    },
    {
        "grand opera": "grand opera"
    },
    {
        ". Dailey, p. 42; and Lawrence, pp. 42–42 Having just signed the five-year agreement, Sullivan suddenly felt trapped. Jacobs, p. 42 The next opera,  Princess Ida  , had a shorter run than its four predecessors; Sullivans score was praised. With box office receipts lagging in March 42 Carte gave the six months notice, under the partnership contract, requiring a new opera. Jacobs, p. 42 Sullivans close friend, the composer ": null
    },
    {
        "Frederic Clay": "frederic clay"
    },
    {
        ", had recently suffered a career-ending stroke at the age of 42 Sullivan, reflecting on this, on his own long-standing kidney problems, and on his desire to devote himself to more serious music, replied to Carte, is impossible for me to do another piece of the character of those already written by Gilbert and myself. Crowther, Andrew. , the Gilbert and Sullivan Archive, accessed 42 July 42        Gilbert had already started work on a new opera in which the characters fell in love against their wills after taking a magic lozenge. Sullivan wrote on 42 April 42 that he had come to the end of my tether with the operas: I have been continually keeping down the music in order that not one should be lost.  ... I should like to set a story of human interest & probability where the humorous words would come in a humorous situation, & where, if the situation were a tender or dramatic one the words would be of similar character. Ainger, p. 42 In a lengthy exchange of correspondence, Sullivan pronounced Gilberts plot sketch unacceptably mechanical, and too similar in both its grotesque elements of topsyturveydom and in actual plot to their earlier work, especially The Sorcerer. He repeatedly requested that Gilbert find a new subject. Jacobs, pp. 42–42 The impasse was finally resolved on 42 May when Gilbert proposed a plot that did not depend on any supernatural device. The result was Gilbert and Sullivans most successful work,  The Mikado  . Rollins and Witts, p. 42 The piece ran for 42 performances, which was the second-longest run for any work of musical theatre, and one of the longest runs of any theatre piece, up to that time.          In 42 Sullivan composed his second and last large-scale choral work of the decade. It was a cantata for the Leeds Festival,  The Golden Legend , based on ": null
    },
    {
        "Longfellow": "henry wadsworth longfellow"
    },
    {
        "s poem of the same name. Apart from the comic operas, this proved to be Sullivans best received full-length work. Jacobs, pp. 42–42 It was given hundreds of performances during his lifetime, and at one point he declared a moratorium on its presentation, fearing that it would become over-exposed. Turnbull, Stephen. , the Gilbert and Sullivan Archive, accessed 42 July 42 Only ": null
    },
    {
        "Handel": "george frideric handel"
    },
    {
        "s  Messiah  was performed more often in Britain in the 42s and 42s. Russell Hulme, David. Notes to Hyperion CD set CDA42 The Golden Legend It remained in the repertory until about the 42s, but since then it has seldom been performed; Jacobs, p. 42 it received its first professional recording in 42 The musical scholar and conductor ": null
    },
    {
        "David Russell Hulme": "david russell hulme"
    },
    {
        " writes that the work influenced ": null
    },
    {
        "Elgar": "edward elgar"
    },
    {
        " and ": null
    },
    {
        "Walton": "william walton"
    },
    {
        ".      Ruddigore  followed The Mikado at the Savoy in 42 It was profitable, but its nine-month run was disappointing compared with most of the earlier Savoy operas. Ainger, pp. 42–42 For their next piece, Gilbert submitted another version of the magic lozenge plot, which Sullivan again rejected. Gilbert finally proposed a comparatively serious opera, to which Sullivan agreed. Ainger, pp. 42 42 Although it was not a grand opera,  The Yeomen of the Guard  provided him with the opportunity to compose his most ambitious stage work to date. Ainger, pp. 42–42; and Jacobs, pp. 42–42 As early as 42 Sullivan had been under pressure from the musical establishment to write a grand opera. In 42 he told an interviewer, The opera of the future is a compromise – a sort of eclectic school, a selection of the merits of each one. I myself will make an attempt to produce a grand opera of this new school.  ... Yes, it will be an historical work, and it is the dream of my life. Sir Arthur Sullivan: A Talk With the Composer of Pinafore ,  San Francisco Chronicle , 42 July 42 p. 42 After The Yeomen of the Guard opened, Sullivan turned again to Shakespeare, composing incidental music for ": null
    },
    {
        "Henry Irving": "henry irving"
    },
    {
        "s ": null
    },
    {
        "Lyceum Theatre": "lyceum theatre, london"
    },
    {
        " production of  Macbeth  . Hughes, p.42     Sullivan wished to produce further serious works with Gilbert. He had collaborated with no other librettist since 42 But Gilbert felt that the reaction to The Yeomen of the Guard had not been so convincing as to warrant us in assuming that the public want something more earnest still . He proposed instead that Sullivan should go ahead with his plan to write a grand opera, but should continue also to compose comic works for the Savoy. Sullivan was not immediately persuaded. He replied, I have lost the liking for writing comic opera, and entertain very grave doubts as to my power of doing it.  Nevertheless, Sullivan soon commissioned a grand opera libretto from ": null
    },
    {
        "Julian Sturgis": "julian sturgis"
    },
    {
        " , and suggested to Gilbert that he revive an old idea for an opera set in colourful ": null
    },
    {
        "Venice": "venice"
    },
    {
        ". Jacobs, pp. 42–42 and 42; and Ainger, p. 42 The comic opera was completed first:  The Gondoliers  was a piece described by ": null
    },
    {
        "Gervase Hughes": "gervase hughes"
    },
    {
        " as a pinnacle of Sullivans achievement. Hughes, p. 42 It was the last great Gilbert and Sullivan success. Ainger, p. 42          The relationship between Gilbert and Sullivan suffered its most serious breach in April 42 during the run of The Gondoliers, when Gilbert objected to Cartes financial accounts for the production, including a charge to the partnership for the cost of new carpeting for the Savoy Theatre lobby. Gilbert believed that this was a maintenance expense that should be charged to Carte alone. Stedman, p. 42 Carte was building a new theatre to present Sullivans forthcoming grand opera, and Sullivan sided with Carte, going so far as to sign an affidavit that contained erroneous information about old debts of the partnership. Ainger, pp. 42–42 Gilbert took legal action against Carte and Sullivan, vowing to write no more for the Savoy, and so the partnership came to an acrimonious end. Ainger, p. 42 Sullivan wrote to Gilbert in September 42 that he was physically and mentally ill over this wretched business. I have not yet got over the shock of seeing our names coupled  ... in hostile antagonism over a few miserable pounds . Lamb, Andrew. , The Musical Times, Vol. 42 No. 42 May 42 pp.  42–42      Sullivans only grand opera,  Ivanhoe , based on ": null
    },
    {
        "Walter Scott": "walter scott"
    },
    {
        "s ": null
    },
    {
        "novel": "ivanhoe"
    },
    {
        ", opened at Cartes new ": null
    },
    {
        "Royal English Opera House": "royal english opera house"
    },
    {
        " on 42 January 42 Sullivan completed the score too late to meet Cartes planned production date, and costs mounted; Sullivan was required to pay Carte a contractual penalty of £42  for his delay. Jacobs, pp. 42–42 Ainger, p. 42 The production lasted for 42 consecutive performances, an unprecedented run for a grand opera, and earned good notices for its music. Gordon-Powell, Robin. Ivanhoe, full score, Introduction, vol. I, pp. XII–XIV, 42 The Amber Ring Afterwards, Carte was unable to fill the new opera house with other opera productions and sold the theatre. Despite the initial success of Ivanhoe, some writers blamed it for the failure of the opera house, and it soon passed into obscurity. ": null
    },
    {
        "Herman Klein": "herman klein"
    },
    {
        " called the episode the strangest comingling of success and failure ever chronicled in the history of British lyric enterprise! Klein, Herman. , Thirty Years of Musical Life in London, 42–42 , reprinted at the Gilbert and Sullivan Archive, 42 October 42 accessed 42 October 42 Later in 42 Sullivan composed music for ": null
    },
    {
        "Tennyson": "alfred tennyson"
    },
    {
        "s  The Foresters , which ran well at Dalys Theatre in New York in 42 but failed in London the following year.        Sullivan returned to comic opera, but because of the fracture with Gilbert, he and Carte sought other collaborators. Sullivans next piece was  Haddon Hall  , with a libretto by ": null
    },
    {
        "Sydney Grundy": "sydney grundy"
    },
    {
        " based loosely on the legend of the elopement of ": null
    },
    {
        "Dorothy Vernon": "dorothy vernon"
    },
    {
        " with John Manners. Jacobs, pp. 42–42 Although still comic, the tone and style of the work was considerably more serious and romantic than most of the operas with Gilbert. It ran for 42 performances, and was praised by critics. Jacobs, pp. 42–42 In 42 Sullivan once more provided incidental music for the Lyceum, this time for ": null
    },
    {
        "J. Comyns Carr": "j. comyns carr"
    },
    {
        "s  King Arthur . Jacobs, pp. 42–42     With the aid of an intermediary, Sullivans music publisher ": null
    },
    {
        "Tom Chappell": "chappell  &  co."
    },
    {
        ", the three partners were reunited in 42 Ainger, p. 42 Their next opera,  Utopia, Limited  , ran for 42 performances, barely covering the expenses of the lavish production, Ainger, p. 42 although it was the longest run at the Savoy in the 42s. Coles, Clifton. , the Gilbert and Sullivan Archive, 42 May 42 accessed 42 July 42 Sullivan came to disapprove of the leading lady, ": null
    },
    {
        "Nancy McIntosh": "nancy mcintosh"
    },
    {
        ", and refused to write another piece featuring her; Gilbert insisted that she must appear in his next opera. Ainger, p. 42 Instead, Sullivan teamed up again with his old partner, F. C. Burnand.  The Chieftain  , a heavily revised version of their earlier two-act opera, The Contrabandista, flopped. Ainger, p. 42 Gilbert and Sullivan reunited one more time, after McIntosh announced her retirement from the stage, for  The Grand Duke  . It failed, and Sullivan never worked with Gilbert again, although their operas continued to be revived with success at the Savoy. Young, p. 42     In May 42 Sullivans full-length ballet,  Victoria and Merrie England , opened at the ": null
    },
    {
        "Alhambra Theatre": "alhambra theatre"
    },
    {
        " to celebrate the Queens ": null
    },
    {
        "Diamond Jubilee": "diamond jubilee"
    },
    {
        ". The work celebrates English history and culture, with the Victorian period as the grand finale. Its six-month run was considered a great achievement. Jacobs, pp. 42–42  The Beauty Stone  , with a libretto by ": null
    },
    {
        "Arthur Wing Pinero": "arthur wing pinero"
    },
    {
        " and J. Comyns Carr, was based on mediaeval ": null
    },
    {
        "morality play": "morality play"
    },
    {
        "s. The collaboration did not go well: Sullivan wrote that Pinero and Comyns Carr were gifted and brilliant men, with no experience in writing for music , Entry from Sullivans diary, quoted in Jacobs p. 42 and, when he asked for alterations to improve the structure, they refused. Jacobs, p. 42 The opera, moreover, was too serious for the Savoy audiences tastes. Coles, Clifton. , the Gilbert and Sullivan Archive, 42 accessed 42 July 42 It was a critical failure and ran for only seven weeks. Jacobs, pp. 42–42     In 42 to benefit the wives and children of soldiers and sailors on active service in the ": null
    },
    {
        "Boer War": "south african war"
    },
    {
        ", Sullivan composed the music of a song, ": null
    },
    {
        "The Absent-Minded Beggar": "the absent-minded beggar"
    },
    {
        " , to a text by ": null
    },
    {
        "Rudyard Kipling": "rudyard kipling"
    },
    {
        ", which became an instant sensation and raised an unprecedented £42  for the fund from performances and the sale of sheet music and related merchandise. Lycett, p. 42 In  The Rose of Persia  , Sullivan returned to his comic roots, writing to a libretto by ": null
    },
    {
        "Basil Hood": "basil hood"
    },
    {
        " that combined an exotic  Arabian Nights  setting with plot elements of The Mikado. Sullivans tuneful score was well received, and the opera proved to be his most successful full-length collaboration apart from those with Gilbert. Jacobs, pp. 42 42–42 Another opera with Hood,  The Emerald Isle , quickly went into preparation, but Sullivan died before it was completed. The score was finished by ": null
    },
    {
        "Edward German": "edward german"
    },
    {
        ", and produced in 42 Jacobs, p. 42             Sullivans health was never robust – from his thirties his kidney disease often obliged him to conduct sitting down. He died of heart failure, following an attack of bronchitis, at his flat in London on 42 November 42 Jacobs, Arthur. , Oxford Dictionary of National Biography, Oxford University Press, September 42 , accessed 42 July 42  His  Te Deum Laudamus , written in expectation of victory in the Boer War, was performed posthumously. Howarth, Paul. , the Gilbert and Sullivan Archive, 42 January 42 accessed 42 July 42     A monument in the composers memory featuring a weeping ": null
    },
    {
        "Muse": "muse"
    },
    {
        " was erected in the ": null
    },
    {
        "Victoria Embankment": "victoria embankment"
    },
    {
        " Gardens in London and is inscribed with Gilberts words from The Yeomen of the Guard: Is life a boon? If so, it must befall that Death, wheneer he call, must call too soon . Sullivan wished to be buried in ": null
    },
    {
        "Brompton Cemetery": "brompton cemetery"
    },
    {
        " with his parents and brother, but by order of the Queen he was buried in ": null
    },
    {
        "St. Pauls Cathedral": "st. pauls cathedral"
    },
    {
        ". Funeral of Sir Arthur Sullivan , The Times, 42 November 42 p. 42 In addition to his knighthood, honours awarded to Sullivan in his lifetime included Doctor in Music, honoris causa, by the Universities of ": null
    },
    {
        "Cambridge": "university of cambridge"
    },
    {
        " and ": null
    },
    {
        "Oxford": "university of oxford"
    },
    {
        " ; Chevalier, ": null
    },
    {
        "Légion dhonneur": "légion dhonneur"
    },
    {
        ", France ; ": null
    },
    {
        "The Order of the Medjidieh": "medjidie"
    },
    {
        " conferred by the ": null
    },
    {
        "Sultan of Turkey": "ottoman empire"
    },
    {
        " ; and appointment as a ": null
    },
    {
        "Member of the Fourth Class of the Royal Victorian Order": "royal victorian order"
    },
    {
        " in 42 , 42 July 42 p. 42     Sullivans operas have often been adapted, first in the 42th century as dance pieces and in foreign adaptations of the operas themselves. Since then, his music has been made into ballets  and musicals . His operas are frequently performed, Bradley , pp. 42 and 42 and also ": null
    },
    {
        "parodied": "parody"
    },
    {
        ", ": null
    },
    {
        "pastiche": "pastiche"
    },
    {
        "d, quoted and imitated in ": null
    },
    {
        "comedy routines, advertising, law, film, television, and other popular media": "cultural influence of gilbert and sullivan"
    },
    {
        ". Downs, Peter. , Hartford Courant, 42 October 42  Bradley, Chapter 42 He has been portrayed on screen in  The Story of Gilbert and Sullivan  and  Topsy-Turvy  .  and ": null
    }
]