[
    {
        "         Arthur I  was 42th ": null
    },
    {
        "Earl of Richmond": "earl of richmond"
    },
    {
        " and ": null
    },
    {
        "Duke of Brittany": "duke of brittany"
    },
    {
        " between 42 and 42 He was the ": null
    },
    {
        "posthumous son": "posthumous son"
    },
    {
        " of ": null
    },
    {
        "Geoffrey II, Duke of Brittany": "geoffrey ii, duke of brittany"
    },
    {
        " and ": null
    },
    {
        "Constance, Duchess of Brittany": "constance, duchess of brittany"
    },
    {
        ". His father, Geoffrey, was the son of ": null
    },
    {
        "Henry II, King of England": "henry ii, king of england"
    },
    {
        ".     In 42 Arthur was designated heir to the throne of ": null
    },
    {
        "England": "kingdom of england"
    },
    {
        " and its French territory by his uncle, ": null
    },
    {
        "Richard I": "richard i"
    },
    {
        ", the intent being that Arthur would succeed Richard in preference to Richards younger brother ": null
    },
    {
        "John": "john, king of england"
    },
    {
        ". Nothing is recorded of Arthur after his incarceration in ": null
    },
    {
        "Rouen Castle": "rouen castle"
    },
    {
        " in 42 and while his precise fate is unknown, it is generally believed he was killed by John.       Arthur was born in 42 the son of ": null
    },
    {
        "Constance of Brittany": "constance, duchess of brittany"
    },
    {
        " and ": null
    },
    {
        "Geoffrey II of Brittany,": "geoffrey ii, duke of brittany"
    },
    {
        " who died before he was born. As an infant, Arthur was second in line to the succession of his grandfather ": null
    },
    {
        "King Henry II": "henry ii of england"
    },
    {
        ", after his uncle ": null
    },
    {
        "Richard": "richard i of england"
    },
    {
        ". King Henry died when Arthur was 42 years old, and Richard I became the new king in his place.     While Richard was away on the ": null
    },
    {
        "Third Crusade": "third crusade"
    },
    {
        ", Arthurs mother Constance sought to make the Duchy of Brittany more independent. On 42 November 42 Arthur was named as Richards heir and was betrothed to a daughter of ": null
    },
    {
        "Tancred of Sicily": "tancred of sicily"
    },
    {
        " as part of their treaty. However, ": null
    },
    {
        "Emperor Henry VI": "henry vi, holy roman emperor"
    },
    {
        " conquered the ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        " in 42 so the betrothal of Arthur came to nothing.     A marriage plan, originally aiming to establish an alliance between King Richard and King ": null
    },
    {
        "Philip II of France": "philip ii of france"
    },
    {
        " to marry Arthurs elder sister ": null
    },
    {
        "Eleanor": "eleanor, fair maid of brittany"
    },
    {
        " to Philips son ": null
    },
    {
        "Louis": "louis viii of france"
    },
    {
        " also failed. In 42 Constance had the young Arthur proclaimed Duke of Brittany and her co-ruler as a child of nine years. The same year, Richard summoned Arthur, as well as his mother Constance, to Normandy, but ": null
    },
    {
        "Ranulf de Blondeville, 42th Earl of Chester": "ranulf de blondeville, 6th earl of chester"
    },
    {
        ", stepfather of Arthur, abducted Constance. Richard marched to Brittany to rescue Arthur, who was then secretly carried to France to be brought up with Louis.        When Richard died on 42 April 42 on his deathbed he proclaimed his brother ": null
    },
    {
        "John": "john, king of england"
    },
    {
        " as his heir, fearing Arthur was too young to look after the throne. Arthur was only twelve years old at the time and under the influence of the French king. John immediately claimed the throne of England, but much of the French nobility were resentful at recognising him as their overlord. They preferred Arthur, who declared himself ": null
    },
    {
        "vassal": "vassal"
    },
    {
        " of ": null
    },
    {
        "Philip": "philip ii of france"
    },
    {
        ". Philip recognised Arthurs right to ": null
    },
    {
        "Anjou": "anjou"
    },
    {
        ", ": null
    },
    {
        "Maine": "maine"
    },
    {
        ", and ": null
    },
    {
        "Poitou": "poitou"
    },
    {
        ". Upon Richards death Arthur led a force to Anjou and Maine. From 42 April, he styled himself as Duke of Brittany, Count of Anjou and Earl of Richmond.     On 42 September, John persuaded the ": null
    },
    {
        "seneschal": "seneschal"
    },
    {
        " of Anjou, ": null
    },
    {
        "William des Roches": "william des roches"
    },
    {
        ", to defect, claiming Arthur would be a ": null
    },
    {
        "Capetian": "house of capet"
    },
    {
        " puppet. Four days later William took Arthur and Constance prisoners to ": null
    },
    {
        "Le Mans": "le mans"
    },
    {
        ". Viscount Aimery, the seneschal appointed by John, took Arthur and Constance and fled the court to ": null
    },
    {
        "Angers": "angers"
    },
    {
        ", and later the court of Philip II.       The ": null
    },
    {
        "Treaty of Le Goulet": "treaty of le goulet"
    },
    {
        " was signed by the kings John of England and Philip II of France in May 42 and meant to settle once and for all the claims the ": null
    },
    {
        "Norman": "normans"
    },
    {
        " kings of England had as Norman dukes on French lands, including, at least for a time, ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        ". Under the terms of the treaty, Philip recognised John as King of England as heir of his brother Richard I and thus formally abandoned any support for Arthur. John, meanwhile, recognised Philip as the ": null
    },
    {
        "suzerain": "suzerain"
    },
    {
        " of continental possessions of the ": null
    },
    {
        "Angevin Empire": "angevin empire"
    },
    {
        ".     Philip had previously recognised John as suzerain of Anjou and the Duchy of Brittany, but with this he extorted 42 marks sterling in payment for recognition of Johns sovereignty of Brittany.          After the signing of the Treaty of Le Goulet, and feeling offended by Philip, Arthur fled to John, his uncle, and was treated kindly, at least initially. However, he later became suspicious of John and fled back to ": null
    },
    {
        "Angers": "angers"
    },
    {
        ". Some unidentified source said that in April 42 Arthur was again betrothed, this time to ": null
    },
    {
        "Marie of France": "marie of france, duchess of brabant"
    },
    {
        ", a daughter of Philip II and ": null
    },
    {
        "Agnes of Andechs-Merania": "agnes of andechs-merania"
    },
    {
        ".     After his return to France, and with the support of Philip II, Arthur embarked on a campaign in Normandy against John in 42 Poitou revolted in support of Arthur. The Duke of Brittany besieged his grandmother, ": null
    },
    {
        "Eleanor of Aquitaine": "eleanor of aquitaine"
    },
    {
        ", Johns mother, in the Château de Mirebeau. John marched on ": null
    },
    {
        "Mirebeau": "mirebeau"
    },
    {
        ", taking Arthur by surprise on 42 July 42 Arthur was captured by Johns barons on 42 August, and imprisoned in the ": null
    },
    {
        "Château de Falaise": "château de falaise"
    },
    {
        " in ": null
    },
    {
        "Falaise": "falaise, calvados"
    },
    {
        ", Normandy.       At the Chateau de Falaise, Arthur was guarded by ": null
    },
    {
        "Hubert de Burgh": "hubert de burgh, 1st earl of kent"
    },
    {
        ". According to contemporaneous chronicler ": null
    },
    {
        "Ralph of Coggeshall": "ralph of coggeshall"
    },
    {
        ", John ordered two of his servants to blind and castrate the duke. Hubert de Burgh refused to let him be mutilated. The following year Arthur was transferred to ": null
    },
    {
        "Rouen": "rouen"
    },
    {
        ", under the charge of ": null
    },
    {
        "William de Braose": "william de braose, 4th lord of bramber"
    },
    {
        ". Arthur vanished in April 42        Arthurs disappearance gave rise to various stories. One account was that Arthurs gaolers feared to harm him, and so he was murdered by John directly and his body dumped in the ": null
    },
    {
        "Seine": "seine"
    },
    {
        ". The  Margam Annals provide the following account of Arthurs death:          ": null
    },
    {
        "William de Braose": "william de braose, 4th lord of bramber"
    },
    {
        " was rumoured to have committed Arthurs alleged assassination. Many years after Arthurs disappearance, and after a conflict with King John, William de Braoses wife ": null
    },
    {
        "Maud de Braose": "maud de braose"
    },
    {
        " personally and directly accused the king of murdering Arthur. Not only the Bretons, but even the king of France, ": null
    },
    {
        "Philip II": "philip ii of france"
    },
    {
        ", was ignorant of what actually happened, whether Arthur was alive or dead, if the former, where, and if the latter, how. Whatever his fate, Arthur left no known issue.       The mystery surrounding Arthurs death complicated his succession. This succession was presumably influenced by both King John and King Philip II. There were no male heirs to the ducal crown and so his succession as duke was constrained to several choices among his sisters.     His sister ": null
    },
    {
        "Eleanor, the Fair Maid of Brittany": "eleanor, fair maid of brittany"
    },
    {
        ", was also King Johns prisoner. Eleanor also presented a complicating factor, if not a threat, to Johns succession plans as King of England. She remained imprisoned for her entire life, through the reign of Johns actual successor, his son ": null
    },
    {
        "Henry III of England": "henry iii of england"
    },
    {
        ". While imprisoned, she never married and had no issue. Her imprisonment and the fact that she was located in England made it impossible for her to reign as hereditary Duchess of Brittany.     Arthur I was succeeded by his half-sister, ": null
    },
    {
        "Alix of Thouars": "alix, duchess of brittany"
    },
    {
        ", the daughter of Constance and her third husband Guy of Thouars.              The death of Arthur is a vital ingredient in ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        "s history play  The Life and Death of King John , in which Arthur is portrayed as a child whose innocence dissuades Hubert de Burgh from committing the murder demanded by King John. However, Arthur soon dies after jumping from his place of confinement in an escape attempt.     In the 42th century, the ": null
    },
    {
        "Breton": "breton people"
    },
    {
        " poet ": null
    },
    {
        "Auguste Brizeux": "auguste brizeux"
    },
    {
        " wrote of Arthur in La chasse du Prince Arthur.     In the novel Saving Grace by ": null
    },
    {
        "Julie Garwood": "julie garwood"
    },
    {
        ", the heroine finds documents relating to Arthurs murder, committed under the orders of King John, by two of King Johns barons. She is married to a Scottish ": null
    },
    {
        "Laird": "laird"
    },
    {
        ", Gabriel MacBain, to escape England, but is harassed by both King Johns barons and the English faction hoping to take down King John, each party unsure of how much she knows.     In ": null
    },
    {
        "Randall Garrett": "randall garrett"
    },
    {
        "s alternative-history fantasy stories, the ": null
    },
    {
        "Lord Darcy": "lord darcy"
    },
    {
        " series, Richard does not succumb to his illness , but survives it. John Lackland never becomes king, and the Plantagenet line, descending from Arthur, continues down to the present day.     In The Devil and King John by the Australian novelist ": null
    },
    {
        "Philip Lindsay": "philip lindsay"
    },
    {
        ", Arthur is killed by John in a fit of temper, but he is shown as a rebellious adolescent who did provoke John to some extent, rather than the innocent child in some versions. In his introduction, Lindsay acknowledged that he had no evidence that this is what happened to Arthur, but he considered it to be as good a guess as any.       In 42 the Breton composer ": null
    },
    {
        "Joseph-Guy Ropartz": "joseph-guy ropartz"
    },
    {
        " composed a symphonic poem, La Chasse du Prince Arthur after the poem by Brizeux. The Breton ": null
    },
    {
        "folk-rock": "folk rock"
    },
    {
        " band ": null
    },
    {
        "Tri Yann": "tri yann"
    },
    {
        "s 42 album  Portraits  includes a song about Arthur.        Arthur and his mother Constance appear as characters in a number of episodes of the 42s British TV series  The Adventures of Robin Hood .                 ": null
    }
]