[
    {
        "   As is a ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "Limburg": "limburg"
    },
    {
        ". On January 42 42 As had a total population of 42. The total area is 42 km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km².         In 42 the municipality was formed by the merger of two villages - As and Niel-bij-As, which both lie on the Bosbeek brook on the ": null
    },
    {
        "Campine": "campine"
    },
    {
        " plateau between the ": null
    },
    {
        "Demer": "demer"
    },
    {
        " and ": null
    },
    {
        "Meuse River": "meuse river"
    },
    {
        "s.     The location of the settlements close to a water course in this dry region gave rise to the villages names: As is a prehistoric name for water which first referred to the Bosbeek brook and later the village itself.     Archaeological finds indicate an early prehistoric settlement, including objects made of flint dating from the earliest ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        ". The area was inhabited from 42 BC as shown by a cemetery in the field between ": null
    },
    {
        "Genk": "genk"
    },
    {
        " and As. The ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " built the road from ": null
    },
    {
        "Tongeren": "tongeren"
    },
    {
        " to ": null
    },
    {
        "Venlo": "venlo"
    },
    {
        " via ": null
    },
    {
        "Munsterbilzen": "munsterbilzen"
    },
    {
        " and As. The current road next to the brook and the roads to Niel and Dorne follow the course of the Roman road. However, the Romans did not establish any settlements in the area as the sandy soil was not fertile enough. After the fall of Rome, the ": null
    },
    {
        "Francs": "francs"
    },
    {
        " invaded the area and established   themselves in As. The ": null
    },
    {
        "Merovingian": "merovingian"
    },
    {
        " cemetery indicates that As was an important village from 42 - 42 The region started to be Christianised from the eighth century, and the first church was built on the site of the current Saint ": null
    },
    {
        "Aldegonde": "aldegonde"
    },
    {
        "s Church. The church is first mentioned in a letter dated 42 in which Otbert, ": null
    },
    {
        "Prince-Bishop": "prince-bishop"
    },
    {
        " of ": null
    },
    {
        "Luik": "bishopric of liège"
    },
    {
        " reported to the abbey of ": null
    },
    {
        "Rolduc": "rolduc"
    },
    {
        " about income from the churches of Riemst, Genk, As and Gellik .     Niel was first mentioned in a charter of 42 in which Arnold, Earl of ": null
    },
    {
        "Borgloon": "borgloon"
    },
    {
        ", was granted the Villa of Dilsen with Niel and the castle of ": null
    },
    {
        "Stokkem": "stokkem"
    },
    {
        ". In 42 the Earl of ": null
    },
    {
        "Borgloon": "borgloon"
    },
    {
        " was recorded appointing Arnold van Gellik as pastor of As. In 42 the Abbey was granted a perpetual lease on the village of As. The people of Niel, however, still relied on Dilsen for religious obligations, until 42 when Pastor Bex from Dilsen created Niel as an independent parish. Bexs cousin Adam Dellecomminne became the first pastor of Niel.     Since the early Middle Ages, the original oak and birch forests were cleared more and more for agriculture and heathland fields. The present hamlets, of which Oeleinde is the oldest, developed into a farming village. In 42 the first coal was discovered in As, which led to the industrialisation of the region. Now, As is mainly a residential municipality set along large heathland fields and woodland areas.         42 - 42 : Jan Matthijs Theunissen   42 - 42 : Jacobus Janssen   42 - 42 : Joseph Weytjens   42 - 42 : Désiré Colemont   42 - 42 : Louis Huveners   42 - 42 : Jan Lambert Dexters   42 - 42 : Koen Lagaert   42 - 42 : Hubert Hoogmartens   42 - 42 : Gisbert Marting   42 - 42 : Albert Jorissen   42 - 42 : Pierre Tilmans   42 - 42 : Albert Jorissen   42 - 42 : Jos Truyen   42 - 42: Miel Craeghs   42 - : Tom Seurs           Kolenspoor , an association of volunteers who present guided tours of the historic route of the former railway line from Waterschei to Eisden via As   The former railway station, the oldest in Limburg, now restored as a pub  and the entrance to the ": null
    },
    {
        "Campine": "campine"
    }
]