[
    {
        "        Aschaffenburg  is a town in northwest ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". The town of Aschaffenburg is not considered part of the ": null
    },
    {
        "district of Aschaffenburg": "aschaffenburg"
    },
    {
        ", but is the administrative seat.     Aschaffenburg belonged to the ": null
    },
    {
        "Archbishopric of Mainz": "archbishopric of mainz"
    },
    {
        " for more than 42 years. The town is located at the westernmost border of ": null
    },
    {
        "Lower Franconia": "lower franconia"
    },
    {
        " and separated from the central and eastern part of the  Regierungsbezirk  by the ": null
    },
    {
        "Spessart": "spessart"
    },
    {
        " hills, whereas it opens towards the ": null
    },
    {
        "Rhine-Main plain": "frankfurt/rhine-main"
    },
    {
        " in the west and north-west. Therefore, the inhabitants speak neither ": null
    },
    {
        "Bavarian": "bavarian language"
    },
    {
        " nor ": null
    },
    {
        "East Franconian": "east franconian german"
    },
    {
        " but rather a local version of ": null
    },
    {
        "Rhine Franconian": "rhine franconian"
    },
    {
        ".           The town is located on both sides of the ": null
    },
    {
        "Main": "main"
    },
    {
        " in the southwest part of ": null
    },
    {
        "Germany": "germany"
    },
    {
        ",  southeast of ": null
    },
    {
        "Frankfurt am Main": "frankfurt am main"
    },
    {
        ". In the western part of the municipal territory, the smaller ": null
    },
    {
        "Aschaff": "aschaff"
    },
    {
        " flows into the Main. The region is also known as Bayerischer Untermain . Aschaffenburg lies in the far northwest of the state of Bavaria, close to the border to the state of ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        ".       The climate is continental, typically with warm, dry summers and cold, damp winters. Aschaffenburg usually receives less snowfall during the winter than the nearby ": null
    },
    {
        "Spessart": "spessart"
    },
    {
        ".            Aschaffenburg comprises 42  Stadtteile :     Damm   Gailbach   Leider   Nilkheim   Obernau   Obernauer Kolonie   Österreicher Kolonie   Schweinheim   Stadtmitte   Strietwald     Nilkheim and Leider are the only Stadtteile which are located on the left bank of the river Main.       The following municipalities border Aschaffenburg : ": null
    },
    {
        "Johannesberg": "johannesberg, bavaria"
    },
    {
        ", ": null
    },
    {
        "Glattbach": "glattbach"
    },
    {
        ", ": null
    },
    {
        "Goldbach": "goldbach, bavaria"
    },
    {
        ", ": null
    },
    {
        "Haibach": "haibach, lower franconia"
    },
    {
        ", ": null
    },
    {
        "Bessenbach": "bessenbach"
    },
    {
        ", ": null
    },
    {
        "Sulzbach am Main": "sulzbach am main"
    },
    {
        ", ": null
    },
    {
        "Niedernberg": "niedernberg"
    },
    {
        ", ": null
    },
    {
        "Großostheim": "großostheim"
    },
    {
        ", ": null
    },
    {
        "Stockstadt am Main": "stockstadt am main"
    },
    {
        " and ": null
    },
    {
        "Mainaschaff": "mainaschaff"
    },
    {
        ".           The name Aschaffenburg  originally meant castle at the ash tree river deriving from the river Aschaff that runs through parts of the town.            The earliest remains of settlements in the area of Aschaffenburg date from the ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        ".     Aschaffenburg was originally a settlement of the ": null
    },
    {
        "Alamanni": "alamanni"
    },
    {
        ". ": null
    },
    {
        "Roman legion": "roman legion"
    },
    {
        "s were stationed here. In c. 42 AD, the  Ravenna Cosmography  names two settlements in region: Uburzis  and Ascapha .       Around 42 the area had been conquered by the ": null
    },
    {
        "Franks": "franks"
    },
    {
        ", and their ": null
    },
    {
        "Hausmeier": "mayor of the palace"
    },
    {
        " built a castle here. In the 42th century, a ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " monastery was founded, dedicated to St. Michael, reportedly by ": null
    },
    {
        "Saint Boniface": "saint boniface"
    },
    {
        ". This became the  Kollegiatstift St. Peter und Alexander  in the second half of the 42th century . In 42 King ": null
    },
    {
        "Louis the Younger": "louis the younger"
    },
    {
        " married ": null
    },
    {
        "Liutgard of Saxony": "liutgard of saxony"
    },
    {
        " at Aschaffenburg. She also died here in 42 and was later laid to rest with her daughter Hildegard in the Stiftskirche. Ascaffinburg is mentioned first in 42 in a gift document by ": null
    },
    {
        "Otto II": "otto ii, holy roman emperor"
    },
    {
        ", in which he gave several villages including ": null
    },
    {
        "Wertheim am Main": "wertheim am main"
    },
    {
        " and a stretch of forest in the Spessart to the collegiate church.        In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " the town was known as Ascaffaburc, Ascapha or Ascaphaburg. A stone bridge over the Main was reportedly built by Archbishop ": null
    },
    {
        "Willigis": "willigis"
    },
    {
        " in 42 who also made the town his second residence. The town  was part of the ": null
    },
    {
        "Archbishopric of Mainz": "archbishopric of mainz"
    },
    {
        " from 42 when ": null
    },
    {
        "Duke Otto": "otto i, duke of swabia and bavaria"
    },
    {
        " died. A Vizedom is mentioned for the first time in 42 as the top local representative of the Archbishop. In 42 a synod was held here, and in 42 an ": null
    },
    {
        "imperial diet": "reichstag"
    },
    {
        ", preliminary to that of ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", approved a concordat . In the ": null
    },
    {
        "German Peasants War": "german peasants war"
    },
    {
        " , the town backed the losing side. Aschaffenburg in  The New Encyclopædia Britannica . Chicago: ": null
    },
    {
        "Encyclopædia Britannica Inc.": "encyclopædia britannica inc."
    },
    {
        ", 42th edn., 42 Vol. 42 p. 42        In 42 the late-": null
    },
    {
        "Gothic": "gothic architecture"
    },
    {
        " castle of Johannisburg was destroyed. It was replaced in 4242 by the ": null
    },
    {
        "Renaissance": "renaissance architecture"
    },
    {
        " Schloss Johannisburg.  The town suffered greatly during the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ", being held in turn by the various belligerents. During the ": null
    },
    {
        "Battle of Dettingen": "battle of dettingen"
    },
    {
        " , which took place to the north, the town was occupied by French troops. It formed part of the electorate of the ": null
    },
    {
        "Archbishop of Mainz": "archbishop of mainz"
    },
    {
        ", and in 42 was made over to Archbishop ": null
    },
    {
        "Karl Theodor von Dalberg": "karl theodor anton maria von dalberg"
    },
    {
        " as the ": null
    },
    {
        "Principality of Aschaffenburg": "principality of aschaffenburg"
    },
    {
        ".     Aschaffenburg was the site of the  , established in 42 made famous by the researches of Professor Dr ": null
    },
    {
        "Ernst Ebermayer": "ernst ebermayer"
    },
    {
        ". The Academy was dissolved in 42 but re-organized under the Ministry of Finance in 42 ; and, as of 42th March, 42 united to the ": null
    },
    {
        "University of Munich": "university of munich"
    },
    {
        ".  Accessed: May 42 42     In 42 the Principality of Aschaffenburg was merged into the new ": null
    },
    {
        "Grand Duchy of Frankfurt": "grand duchy of frankfurt"
    },
    {
        ", although Dalberg retained Aschaffenburg as his residence. In 42 the town was transferred to the ": null
    },
    {
        "Kingdom of Bavaria": "kingdom of bavaria"
    },
    {
        " by an Austrian-Bavarian treaty. In 42 it was included within Bavarian ": null
    },
    {
        "Lower Franconia": "lower franconia"
    },
    {
        ". From 42–42 King ": null
    },
    {
        "Ludwig I of Bavaria": "ludwig i of bavaria"
    },
    {
        " had a Roman villa built to the west of town. It was named  Pompejanum  after its model, the house of ": null
    },
    {
        "Castor and Pollux": "castor and polydeuces"
    },
    {
        " at ": null
    },
    {
        "Pompeii": "pompeii"
    },
    {
        ".       In 42 the ": null
    },
    {
        "Prussian Army": "prussian army"
    },
    {
        " inflicted a severe defeat on the ": null
    },
    {
        "Austrians": "austrian empire"
    },
    {
        " in the vicinity during the ": null
    },
    {
        "Austro-Prussian War": "austro-prussian war"
    },
    {
        ".       In ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Aschaffenburg was heavily damaged by Allied ": null
    },
    {
        "area bombing": "strategic bombing during world war ii"
    },
    {
        ", including ": null
    },
    {
        "Schloss Johannisburg": "schloss johannisburg"
    },
    {
        " which was completely restored several years later. The Germans chose to defend Aschaffenburg with particular steadfastness, which resulted in the Battle of Aschaffenburg fought 42 March – 42 April 42 The U.S. ": null
    },
    {
        "42th Infantry Division": "45th infantry division"
    },
    {
        " was forced to take the fortified town against stiff German resistance in a series of frontal assaults that involved house-to-house fighting and vicious close combat. The resulting widespread urban destruction was quite severe, as cannon fire was used point-blank to blast through structures. Stanton, Shelby, World War II Order of Battle: An Encyclopedic Reference to U.S. Army Ground Forces from Battalion through Division, 4242 , Stackpole Books, p. 4242       At the end of World War II the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " occupied military facilities formerly used and controlled by the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        ". These were converted for use by U.S. military personnel as processing centres for ": null
    },
    {
        "displaced person": "displaced person"
    },
    {
        "s at the end of the war.  From 42 42 ": null
    },
    {
        "Ukrainians": "ukrainians"
    },
    {
        " were accommodated in four ": null
    },
    {
        "displaced persons camp": "displaced persons camp"
    },
    {
        "s: Ашаффенбурґ, Енциклопедія українознавства  Vol. І, p. 42     Artillerie Kaserne  — approx. 42 people Artillerie Kaserne, Sälzerweg, Aschaffenburg    Bois Brulé Kaserne  — 42 people Bois Brulé Kaserne, Würzburger Strasse, Aschaffenburg    LaGarde Kaserne  — 42 people LaGarde Kaserne, Würzburger Strasse, Aschaffenburg    Pionier Kaserne  — 42 people Pionier Kaserne, Schweinheimer Strasse, Aschaffenburg      Two other camps, Alte Kaserne and Jäger Kaserne housed mainly ": null
    },
    {
        "Poles": "poles"
    },
    {
        " and ": null
    },
    {
        "Lithuanians": "lithuanians"
    },
    {
        ".         In the decades following the war, Aschaffenburg and the surrounding region experienced robust economic prosperity, partially due to its close proximity to ": null
    },
    {
        "Frankfurt am Main": "frankfurt am main"
    },
    {
        ".        According to an online 42 survey in  Stern  magazine, 42 percent of residents living in the Bayerischer Untermain region where Aschaffenburg is located were satisfied with the place where they lived. This was the highest level recorded in the survey, making the region the 42 place to live in Germany, based on several factors including employment opportunities in the region, educational facilities, public services, transportation, recreational options, shopping, cultural facilities/events, climate, etc.     Another survey taken in 42 by McKinsey, Stern magazine, ": null
    },
    {
        "ZDF": "zdf"
    },
    {
        ", and web.de again showed that Aschaffenburg has one of the highest ratings for quality of life in Germany.       Aschaffenburg was the location of several United States Army installations throughout the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ". After initially taking over the administration of the ex-Wehrmacht installations, which were then used as displaced persons camps, the American presence in the Aschaffenburg military community began after general renovations in 42 The installation sites were known as Ready Kaserne , Smith Kaserne , Graves Kaserne , Fiori Kaserne , and Jaeger Kaserne . These housed armour, infantry, engineer, maintenance and artillery elements of the U.S. Army 42rd Brigade, 42rd Infantry Division and various VII Corps elements including the 42th Engineer Battalion, the 42rd Bn 42st Field Artillery , and the 42st Bn 42th Field Artillery . Much of the U.S. Army presence in Aschaffenburg ended in 42 with the ending of the Cold War. The last buildings, which were primarily used for housing, were handed back to the local government in 42                      ": null
    },
    {
        "GDP": "gross domestic product"
    },
    {
        " per inhabitant was €42. This places the district 42th out of 42 districts in Bavaria .      Well-known companies in Aschaffenburg are : Linde Material Handling, ": null
    },
    {
        "Linde Hydraulics": "linde hydraulics"
    },
    {
        ", Joyson Safety Systems and DPD.        The City Galerie, opened in 42 and located in the town center , is the largest shopping mall in northern Bavaria. It was one of the first indoor shopping malls to open in Germany. Aschaffenburg also has a pedestrian shopping zone  closed to motor vehicles, except for deliveries. It is located in the town center.         Aschaffenburg hosts numerous festivals, fairs, exhibitions, markets and concerts throughout the year including the annual Stadtfest, held on the last weekend in August.       Colos-Saal, a live-music club   Erthaltheater f.a.n. Frankenstolz Arena    Kabarett im Hofgarten Ludwigstheater Stadttheater   Zimmertheater.       Stiftsmuseum  Naturwissenschaftliches Museum Aschaffenburg  Gentilhaus Städtische Galerie Kunsthalle Jesuitenkirche  Neuer Kunstverein Aschaffenburg Künstlerhaus Walter Helm Christian Schad Museum  Stadtbibliothek Aschaffenburg       Kinopolis, a modern multiplex cinema   Casino       A large recreational complex is located in the Stadtteil of Leider. It includes an indoor and outdoor swimming pool complex as well as an indoor ice rink and tennis courts, which are open to the general public. Theres also a marina on the ": null
    },
    {
        "Main": "main"
    },
    {
        " between the Willigis and Adenauer bridges.              The main sights of Aschaffenburg are the ": null
    },
    {
        "Schloss Johannisburg": "schloss johannisburg"
    },
    {
        ", built 42–42 by Archbishop ": null
    },
    {
        "Johann Schweikhard von Kronberg": "johann schweikhard von kronberg"
    },
    {
        ", which contains a library with a number of ": null
    },
    {
        "incunabula": "incunabulum"
    },
    {
        ", a collection of engravings and paintings; the ": null
    },
    {
        "Pompejanum": "pompejanum"
    },
    {
        ", a replica of a Roman town house discovered in ": null
    },
    {
        "Pompeii": "pompeii"
    },
    {
        " commissioned by King Ludwig I. and opened in 42; the ": null
    },
    {
        "St. Peter und Alexander": "st. peter und alexander"
    },
    {
        " collegiate church": "collegiate church"
    },
    {
        ", founded in the second half of the 42th century, but dating in the main from the early 42th century on, in which are preserved various monuments by the ": null
    },
    {
        "Vischers": "vischer family of nuremberg"
    },
    {
        ", a sarcophagus with the relics of ": null
    },
    {
        "Saint Margaret": "margaret the virgin"
    },
    {
        ", and a painting by ": null
    },
    {
        "Matthias Grünewald": "matthias grünewald"
    },
    {
        "; the ": null
    },
    {
        "Capuchin": "order of friars minor capuchin"
    },
    {
        " hospital; a theatre, which was formerly a house of the ": null
    },
    {
        "Teutonic Order": "teutonic knights"
    },
    {
        "; several mansions of the nobility; and the historical old town. Across the river are the Park and Schloss ": null
    },
    {
        "Schönbusch": "schönbusch"
    },
    {
        ".     The graves of ": null
    },
    {
        "Clemens Brentano": "clemens brentano"
    },
    {
        " and his brother ": null
    },
    {
        "Christian Brentano": "christian brentano"
    },
    {
        " and that of ": null
    },
    {
        "Wilhelm Heinse": "wilhelm heinse"
    },
    {
        " can be found in the Altstadtfriedhof .        Aschaffenburg has numerous parks including the following:     Schönbusch Park, located in Nilkheim   Schöntal Park, located in the town center   Aschaffenburger Schlossgarten, around Schloss Johannisburg Kleine Schönbuschallee         ": null
    },
    {
        "Viktoria Aschaffenburg": "viktoria aschaffenburg"
    },
    {
        " is the primary football club. The club was formed on 42 June 42 out of the merger of FC Aschaffenburg and FC Viktoria Aschaffenburg . It was renamed Sportverein Viktoria 42 Aschaffenburg on 42 June 42 Their homefield is Stadion am Schönbusch , a modern stadium located in Nilkheim .       In 42 the Aschaffenburg Stallions began playing ": null
    },
    {
        "American football": "american football"
    },
    {
        " at Schönbusch stadium. A ": null
    },
    {
        "cheerleader": "cheerleader"
    },
    {
        " squad also exists.       Aschaffenburg is also home to the Aschaffenburg Mohawks Baseball and Softball team. The softball team won the 42 German Championship. The adult baseball team won the 42 Landesliga South Championship and will play in the highest league of the state Hessen in 42             Aschaffenburg is located on ": null
    },
    {
        "Bundesautobahn 42": "bundesautobahn 3"
    },
    {
        " between ": null
    },
    {
        "Frankfurt am Main": "frankfurt am main"
    },
    {
        " and ": null
    },
    {
        "Würzburg": "würzburg"
    },
    {
        ". The southern terminus of ": null
    },
    {
        "Bundesautobahn 42": "bundesautobahn 45"
    },
    {
        " is located just west of the town. Bundesstrasse B 42 passes through the town. Bundestrasse B 42 used to pass through Aschaffenburg, but has now been rerouted along the ": null
    },
    {
        "Bundesautobahn 42": "bundesautobahn 3"
    },
    {
        ". Three road bridges cross the river ": null
    },
    {
        "Main": "main"
    },
    {
        " at Aschaffenburg: ": null
    },
    {
        "Friedrich Ebert": "friedrich ebert"
    },
    {
        " Bridge , Willigis Bridge and ": null
    },
    {
        "Konrad Adenauer": "konrad adenauer"
    },
    {
        " Bridge. In the 42s, a road tunnel was constructed under the Schlossplatz to improve traffic flow through the Stadtmitte .     After 42 years of planning and construction, the limited-access Innenstadtring or inner-town-ring road was completed in July 42 It allows motorists to bypass the Stadtmitte and reduces traffic congestion in Aschaffenburg, which has been a problem in recent years. Another road project called Bahnparallele is currently under construction, with a small section already opened. It is located in the Stadtteil of Damm and runs parallel to the railway tracks.       There are approximately 42 parking spaces in the ten Stadtteile of Aschaffenburg and eight public parking garages.     Stadtteile of Aschaffenburg are run by  Stadtwerke Aschaffenburg . There are several other bus lines which link Aschaffenburg with the surrounding region. Those lines are run by other companies, including the ": null
    },
    {
        "Deutsche Bahn": "deutsche bahn"
    },
    {
        ". A new regional bus terminal opened in 42 adjacent to the ": null
    },
    {
        "Aschaffenburg Hauptbahnhof": "aschaffenburg hauptbahnhof"
    },
    {
        " . The Regionale Omnibusbahnhof Aschaffenburg  was built to consolidate all of the scattered bus stops in the area around the main railway station into one central location and reduce traffic congestion in the area.        Aschaffenburg Hauptbahnhof /Aschaffenburg Central Station - The station has long-distance ": null
    },
    {
        "InterCityExpress": "intercityexpress"
    },
    {
        " and ": null
    },
    {
        "InterCity": "intercity"
    },
    {
        " services as well as regional connections to neighboring towns and cities. A new, larger station building opened in 42 replacing a smaller structure built in the 42s.   Aschaffenburg-Hochschule/University of Applied Sciences - The stop, located near Würzburger Straße, opened in 42 to accommodate students attending nearby schools. It is positioned between Aschaffenburg Hauptbahnhof and Aschaffenburg-Süd/South. There is only a single track platform.   Aschaffenburg-Süd/South Obernau Schönbusch-Nilkheim - The station closed when passenger service on the Bachgaubahn railway line ended in 42   Leider - Freight railway terminal close to Aschaffenburgs port on the ": null
    },
    {
        "Main": "main"
    },
    {
        ". There is no passenger service.   All passenger train service is provided by the ": null
    },
    {
        "Deutsche Bahn": "deutsche bahn"
    },
    {
        ".       Aschaffenburg has an active port along the Main in the Stadtteil of Leider. There is railway access to the port. In 42 42 million tons of cargo passed through the port.       A small ": null
    },
    {
        "general aviation": "general aviation"
    },
    {
        " airport  is located in nearby ": null
    },
    {
        "Großostheim": "großostheim"
    },
    {
        ". ": null
    },
    {
        "Frankfurt Airport": "frankfurt airport"
    },
    {
        " is located  from Aschaffenburg and offers flights to destinations all over the world. The trip to and from the airport takes about 42 minutes by car or approximately 42 minutes by ": null
    },
    {
        "InterCityExpress": "intercityexpress"
    },
    {
        " train.       The three primary medical centers in Aschaffenburg are:   Klinikum Aschaffenburg, the main hospital   Hofgartenklinik Frauenklinik am Ziegelberg     There are approximately 42 hospital beds, 42 doctors, 42 dentists and 42 pharmacies in the Stadtteile of Aschaffenburg.       There are various types of schools in Aschaffenburg serving approximately 42 students from the town and surrounding region.        is a university of applied sciences .         Main-Echo, Aschaffenburg-based newspaper published daily except Sunday. This is the main newspaper for Aschaffenburg and the surrounding region. It was first published on 42 November 42 replacing Aschaffenburger Zeitung . It has a daily circulation of approximately 42 readers.   Prima Sonntag, newspaper published only on Sunday   FRIZZ Das Magazin, culture/scene magazine   Brot & Spiele, culture magazine   Szene Magazin     ": null
    },
    {
        "Daniel Brendel von Homburg": "daniel brendel von homburg"
    },
    {
        ", 42–42 Archbishop of Mainz from 42 to 42   ": null
    },
    {
        "Martin Baldwin Kittel": "martin baldwin kittel"
    },
    {
        ", 4242 Professor of Aschaffenburg Hochschule from 42 to 42   ": null
    },
    {
        "Johann Joseph Scherer": "johann joseph scherer"
    },
    {
        ", 42–42 German chemist   ": null
    },
    {
        "Joseph von Lindwurm": "joseph von lindwurm"
    },
    {
        ", 42–42 German physician and dermatologist   ": null
    },
    {
        "Lujo Brentano": "lujo brentano"
    },
    {
        ", 42–42 German economist and social reformer   ": null
    },
    {
        "Friedrich von Hefner-Alteneck": "friedrich von hefner-alteneck"
    },
    {
        ", 42–42 German electrical engineer and one of the closest aides of Werner von Siemens   ": null
    },
    {
        "Joseph Anton Schneiderfranken": "joseph anton schneiderfranken"
    },
    {
        ", 42–42 German painter and author   ": null
    },
    {
        "Ernst Ludwig Kirchner": "ernst ludwig kirchner"
    },
    {
        ", 42–42 German expressionist painter and printmaker   ": null
    },
    {
        "Friedrich Dessauer": "friedrich dessauer"
    },
    {
        ", 42–42 German physicist, philosopher, socially engaged entrepreneur and journalist   ": null
    },
    {
        "Hans Schmidt": "hans schmidt"
    },
    {
        ", 42–42 German priest executed for murder in the United States   ": null
    },
    {
        "Alfons Maria Jakob": "alfons maria jakob"
    },
    {
        ", 42–42 German neurologist with important contributions on neuropathology   ": null
    },
    {
        "Otto Gentil": "otto gentil"
    },
    {
        ", 4242 painter and sculptor        ": null
    },
    {
        "Hanns Seidel": "hanns seidel"
    },
    {
        ", 42–42 German politician and Bavarian prime minister from 42 to 42   ": null
    },
    {
        "Inge Viermetz": "inge viermetz"
    },
    {
        ", 42–??, German official and defendant at the Nuremberg Trials   ": null
    },
    {
        "Guido Dessauer": "guido dessauer"
    },
    {
        ", 42–42 German physicist, business executive of the Aschaffenburger Buntpapierfabrik, art collector, patron of arts, and academic   ": null
    },
    {
        "Peter Gingold": "peter gingold"
    },
    {
        ", 42–42 figure in the German Resistance and the National Committee for a Free Germany   ": null
    },
    {
        "Wilfried Hofmann": "wilfried hofmann"
    },
    {
        ", born in 42 German diplomat and author   ": null
    },
    {
        "Adalbert Kraus": "adalbert kraus"
    },
    {
        ", born in 42 German tenor   ": null
    },
    {
        "Felix Magath": "felix magath"
    },
    {
        ", born in 42 German footballer and football manager   ": null
    },
    {
        "Rudi Bommer": "rudi bommer"
    },
    {
        ", born 42 German footballer and football manager       ": null
    },
    {
        "Urban Priol": "urban priol"
    },
    {
        ", born in 42 German cabaret artist and comedian   ": null
    },
    {
        "Winfried Bausback": "winfried bausback"
    },
    {
        ", born in 42 German politician   ": null
    },
    {
        "Burkard Schliessmann": "burkard schliessmann"
    },
    {
        ", international classical pianist and concert artist   ": null
    },
    {
        "Christian Hock": "christian hock"
    },
    {
        ", born in 42 German football player and a football manager   ": null
    },
    {
        "Carlos Boozer": "carlos boozer"
    },
    {
        ", born in 42 American basketball player   ": null
    },
    {
        "Sabine Englert": "sabine englert"
    },
    {
        ", born in 42 German team handball goalkeeper   ": null
    },
    {
        "Marcel Schäfer": "marcel schäfer"
    },
    {
        ", born in 42 German footballer   ": null
    },
    {
        "José Holebas": "josé holebas"
    },
    {
        ", born in 42 German-born Greek footballer   ": null
    },
    {
        "Markus Neumayr": "markus neumayr"
    },
    {
        ", born in 42German footballer   ": null
    },
    {
        "Ivo Iličević": "ivo iličević"
    },
    {
        ", born in 42 German-born Croatian football player   ": null
    },
    {
        "Daria Kinzer": "daria kinzer"
    },
    {
        ", born in 42 Austrian-Croatian singer who represented ": null
    },
    {
        "Croatia": "croatia in the eurovision song contest 2011"
    },
    {
        " in the ": null
    },
    {
        "Eurovision Song Contest 42": "eurovision song contest 2011"
    },
    {
        " Patrick Amrhein": "patrick amrhein"
    },
    {
        ", born in 42 German footballer   ": null
    },
    {
        "Paul Hill ": "paul hill"
    },
    {
        ", born in 42 English Rugby union player           ": null
    },
    {
        "Willigis": "willigis"
    },
    {
        ", 42–42 Archbishop of Mainz   ": null
    },
    {
        "Diether von Isenburg": "diether von isenburg"
    },
    {
        ", 42–42 Elector and Archbishop of Mainz   ": null
    },
    {
        "Dietrich Schenk von Erbach": "dietrich schenk von erbach"
    },
    {
        ", ????–42 Archbishop of Mainz   ": null
    },
    {
        "Mathis Gothart-Nithart": "mathis gothart-nithart"
    },
    {
        ", c. 42–42 German Renaissance painter of religious works   ": null
    },
    {
        "Wolfgang von Dalberg": "wolfgang von dalberg"
    },
    {
        ", 42–42 Archbishop of Mainz   ": null
    },
    {
        "Johann Adam von Bicken": "johann adam von bicken"
    },
    {
        ", 42–42 Archbishop of Mainz   ": null
    },
    {
        "Johann Schweikard von Kronberg": "johann schweikhard von kronberg"
    },
    {
        " , Archbishop of Mainz, commissioned the ": null
    },
    {
        "Schloss Johannisburg": "schloss johannisburg"
    },
    {
        " Friedrich Karl Joseph von Erthal": "friedrich karl joseph von erthal"
    },
    {
        ", 42–42 prince-elector and archbishop of Mainz   ": null
    },
    {
        "Carl Theodor Anton Maria Reichsfreiherr von Dalberg": "karl theodor von dalberg"
    },
    {
        ", 42–42 Archbishop-Elector of Mainz, Arch-Chancellor of the Holy Roman Empire, Prince of ": null
    },
    {
        "Regensburg": "principality of regensburg"
    },
    {
        " Johann Jakob Wilhelm Heinse": "johann jakob wilhelm heinse"
    },
    {
        ", 42–42 German author   ": null
    },
    {
        "Clemens Brentano": "clemens brentano"
    },
    {
        ", 42–42 German poet and novelist   ": null
    },
    {
        "Franz Bopp": "franz bopp"
    },
    {
        ", 42–42 German linguist   ": null
    },
    {
        "Emil Erlenmeyer": "emil erlenmeyer"
    },
    {
        ", 4242 German chemist   ": null
    },
    {
        "Alois Alzheimer": "alois alzheimer"
    },
    {
        ", 42–42 German psychiatrist and neuropathologist   ": null
    },
    {
        "Ludwig Thoma": "ludwig thoma"
    },
    {
        ", 42–42 German author, publisher and editor, studied forestry in Aschaffenburg   ": null
    },
    {
        "Christian Schad": "christian schad"
    },
    {
        ", 42–42 German painter   ": null
    },
    {
        "Hugo Karpf": "hugo karpf"
    },
    {
        ", 42–42 German politician of the CSU party, unionist, member of ": null
    },
    {
        "Reichstag": "reichstag"
    },
    {
        " and ": null
    },
    {
        "Bundestag": "bundestag"
    },
    {
        ".   ": null
    },
    {
        "Alfons Goppel": "alfons goppel"
    },
    {
        ", 42–42 German politician of the CSU party and Prime Minister of Bavaria   ": null
    },
    {
        "Ernst Lehner": "ernst lehner"
    },
    {
        ", 42–42 German footballer   ": null
    },
    {
        "Guido Knopp": "guido knopp"
    },
    {
        ", born in 42 German journalist and author   ": null
    },
    {
        "Otto Becker": "otto becker"
    },
    {
        ", born in 42 German show jumping champion       Aschaffenburg is twinned with:      ": null
    },
    {
        "Perth": "perth, scotland"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        "    St. Germain-en-Laye": "saint-germain-en-laye"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        "    Miskolc": "miskolc"
    },
    {
        ", ": null
    },
    {
        "Hungary": "hungary"
    }
]