[
    {
        "        An astronomer is a ": null
    },
    {
        "scientist": "scientist"
    },
    {
        " in the field of ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        " who focuses their studies on a specific question or field outside the scope of ": null
    },
    {
        "Earth": "earth"
    },
    {
        ". They observe ": null
    },
    {
        "astronomical objects": "astronomical object"
    },
    {
        "such as ": null
    },
    {
        "star": "star"
    },
    {
        "s, ": null
    },
    {
        "planet": "planet"
    },
    {
        "s, ": null
    },
    {
        "moons": "natural satellite"
    },
    {
        ", ": null
    },
    {
        "comet": "comet"
    },
    {
        "s, and ": null
    },
    {
        "galaxies": "galaxy"
    },
    {
        " – in either ": null
    },
    {
        "observational": "observational astronomy"
    },
    {
        " or ": null
    },
    {
        "theoretical astronomy": "theoretical astronomy"
    },
    {
        ". Examples of topics or fields astronomers study include ": null
    },
    {
        "planetary science": "planetary science"
    },
    {
        ", solar astronomy, the origin or ": null
    },
    {
        "evolution of stars": "stellar evolution"
    },
    {
        ", or the ": null
    },
    {
        "formation of galaxies": "galaxy formation and evolution"
    },
    {
        ". Related but distinct subjects like ": null
    },
    {
        "physical cosmology": "physical cosmology"
    },
    {
        ", which studies the ": null
    },
    {
        "Universe": "universe"
    },
    {
        " as a whole.     Astronomers usually fall under either of two main types: observational and ": null
    },
    {
        "theoretical": "scientific theory"
    },
    {
        ". Observational astronomers make direct ": null
    },
    {
        "observations": "observation"
    },
    {
        "of celestial objects and analyze the data. In contrast, theoretical astronomers create and investigate ": null
    },
    {
        "models": "conceptual model"
    },
    {
        "of things that cannot be observed. Because it takes millions to billions of years for a system of stars or a galaxy to complete a life cycle, astronomers must observe snapshots of different systems at unique points in their evolution to determine how they form, evolve, and die. They use these data to create models or ": null
    },
    {
        "simulations": "simulation"
    },
    {
        "to theorize how different celestial objects work.     Further subcategories under these two main ": null
    },
    {
        "branches": "branches of science"
    },
    {
        " of astronomy include planetary astronomy, ": null
    },
    {
        "galactic astronomy": "galactic astronomy"
    },
    {
        ", or physical cosmology.                ": null
    },
    {
        "Historically": "history of astronomy"
    },
    {
        ", astronomy was more concerned with the classification and description of ": null
    },
    {
        "phenomena": "phenomena"
    },
    {
        " in the sky, while ": null
    },
    {
        "astrophysics": "astrophysics"
    },
    {
        " attempted to explain these phenomena and the differences between them using physical laws. Today, that distinction has mostly disappeared and the terms astronomer and astrophysicist are interchangeable. Professional astronomers are highly educated individuals who typically have a ": null
    },
    {
        "PhD": "doctor of philosophy"
    },
    {
        " in ": null
    },
    {
        "physics": "physics"
    },
    {
        " or astronomy and are employed by research institutions or universities.  They spend the majority of their time working on research, although they quite often have other duties such as teaching, building instruments, or aiding in the operation of an observatory.     The number of professional astronomers in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " is actually quite small. The ": null
    },
    {
        "American Astronomical Society": "american astronomical society"
    },
    {
        ", which is the major organization of professional astronomers in ": null
    },
    {
        "North America": "north america"
    },
    {
        ", has approximately 7,000 members. This number includes scientists from other fields such as physics, ": null
    },
    {
        "geology": "geology"
    },
    {
        ", and ": null
    },
    {
        "engineering": "engineering"
    },
    {
        ", whose research interests are closely related to astronomy.  The ": null
    },
    {
        "International Astronomical Union": "international astronomical union"
    },
    {
        " comprises almost 10,145 members from 70 different countries who are involved in astronomical research at the PhD level and beyond.         Contrary to the classical image of an old astronomer peering through a ": null
    },
    {
        "telescope": "telescope"
    },
    {
        " through the dark hours of the night, it is far more common to use a ": null
    },
    {
        "charge-coupled device": "charge-coupled device"
    },
    {
        " camera to record a long, deep exposure, allowing a more sensitive image to be created because the ": null
    },
    {
        "light": "light"
    },
    {
        " is added over time. Before CCDs, ": null
    },
    {
        "photographic plates": "photographic plates"
    },
    {
        " were a common method of observation. Modern astronomers spend relatively little time at telescopes usually just a few weeks per year. Analysis of observed phenomena, along with making predictions as to the causes of what they observe, takes the majority of observational astronomers time.     Astronomers who serve as faculty spend much of their time teaching undergraduate and graduate classes. Most universities also have outreach programs including public telescope time and sometimes ": null
    },
    {
        "planetariums": "planetarium"
    },
    {
        "as a public service to encourage interest in the field.     Those who become astronomers usually have a broad background in maths, sciences and computing in high school. Taking courses that teach how to research, write and present papers are also invaluable. In college/university most astronomers get a PhD in astronomy or physics.          While there is a relatively low number of professional astronomers, the field is popular among ": null
    },
    {
        "amateurs": "amateurs"
    },
    {
        ". Most cities have ": null
    },
    {
        "amateur astronomy": "amateur astronomy"
    },
    {
        " clubs that meet on a regular basis and often host ": null
    },
    {
        "star parties": "star party"
    },
    {
        ". The ": null
    },
    {
        "Astronomical Society of the Pacific": "astronomical society of the pacific"
    },
    {
        " is the largest general astronomical society in the world, comprising both professional and amateur astronomers as well as educators from 70 different nations.  Like any ": null
    },
    {
        "hobby": "hobby"
    },
    {
        ", most people who think of themselves as amateur astronomers may devote a few hours a month to ": null
    },
    {
        "stargazing": "stargazing"
    }
]