[
    {
        "The Athanasian Creed, also known as Pseudo-Athanasian Creed or Quicunque Vult , is a ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " statement of belief": "creed"
    },
    {
        " focused on ": null
    },
    {
        "Trinitarian": "trinity"
    },
    {
        " doctrine and ": null
    },
    {
        "Christology": "christology"
    },
    {
        ". The ": null
    },
    {
        "Latin": "latin"
    },
    {
        " name of the creed, Quicunque vult, is taken from the ": null
    },
    {
        "opening words": "incipit"
    },
    {
        ", Whosoever wishes . The creed has been used by Christian churches since the sixth century. It is the first creed in which the equality of the three persons of the Trinity is explicitly stated. It differs from the ": null
    },
    {
        "Nicene-Constantinopolitan": "nicene creed"
    },
    {
        " and ": null
    },
    {
        "Apostles Creeds": "apostles creed"
    },
    {
        "in the inclusion of ": null
    },
    {
        "anathema": "anathema"
    },
    {
        "s, or condemnations of those who disagree with the creed .     Widely accepted among ": null
    },
    {
        "Western Christians": "western christianity"
    },
    {
        ", including the ": null
    },
    {
        "Roman Catholic Church": "catholic church"
    },
    {
        " and some ": null
    },
    {
        "Anglican churches": "anglican communion"
    },
    {
        ", ": null
    },
    {
        "Lutheran church": "lutheran church"
    },
    {
        "es , and ancient, ": null
    },
    {
        "liturgical": "liturgical"
    },
    {
        " churches generally, the Athanasian Creed has been used in public worship less and less frequently, but part of it can be found as an Authorized Affirmation of Faith in the recent Common Worship liturgy of the Church of England, in the Main Volume, on page 145.       It was designed to distinguish ": null
    },
    {
        "Nicene Christianity": "nicene christianity"
    },
    {
        " from the heresy of ": null
    },
    {
        "Arianism": "arianism"
    },
    {
        ". Liturgically, this Creed was recited at the Sunday Office of ": null
    },
    {
        "Prime": "prime"
    },
    {
        " in the Western Church; it is not in common use in the Eastern Church. The creed has never gained acceptance in liturgy among ": null
    },
    {
        "Eastern Christians": "eastern christianity"
    },
    {
        " since it was considered as one of many unorthodox fabrications that contained the ": null
    },
    {
        "Filioque": "filioque"
    },
    {
        " clause. Today, the Athanasian Creed is rarely used even in the Western Church. When used, one common practice is to use it once a year on ": null
    },
    {
        "Trinity Sunday": "trinity sunday"
    },
    {
        ".               A medieval account credited ": null
    },
    {
        "Athanasius of Alexandria": "athanasius of alexandria"
    },
    {
        ", the famous defender of ": null
    },
    {
        "Nicene theology": "first council of nicaea"
    },
    {
        ", as the author of the Creed. According to this account, Athanasius composed it during his exile in ": null
    },
    {
        "Rome": "ancient rome"
    },
    {
        " and presented it to ": null
    },
    {
        "Pope Julius I": "pope julius i"
    },
    {
        " as a witness to his orthodoxy. This traditional attribution of the Creed to Athanasius was first called into question in 1642 by Dutch Protestant theologian ": null
    },
    {
        "G. J. Voss": "gerhard johann vossius"
    },
    {
        ".      It has since been widely accepted by modern scholars that the creed was not authored by Athanasius,  that it was not originally called a creed at all,  nor was Athanasius name originally attached to it.  Athanasius name seems to have become attached to the creed as a sign of its strong declaration of Trinitarian faith. The reasoning for rejecting Athanasius as the author usually relies on a combination of the following:     The creed originally was most likely written in Latin, while Athanasius composed in Greek.   Neither Athanasius nor his contemporaries ever mention the Creed.   It is not mentioned in any records of the ": null
    },
    {
        "ecumenical councils": "ecumenical councils"
    },
    {
        ".   It appears to address theological concerns that developed after Athanasius died .   It was most widely circulated among ": null
    },
    {
        "Western Christians": "western christianity"
    },
    {
        ".      The use of the creed in a sermon by ": null
    },
    {
        "Caesarius of Arles": "caesarius of arles"
    },
    {
        ", as well as a theological resemblance to works by ": null
    },
    {
        "Vincent of Lérins": "vincent of lérins"
    },
    {
        ", point to Southern ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        " as its origin. The most likely time frame is in the late fifth or early sixth century AD – at least 100 years after Athanasius. The ": null
    },
    {
        "theology": "christian theology"
    },
    {
        " of the creed is firmly rooted in the ": null
    },
    {
        "Augustinian tradition": "augustine of hippo"
    },
    {
        ", using exact terminology of Augustines On the Trinity .   In the late 19th century, there was a great deal of speculation about who might have authored the creed, with suggestions including ": null
    },
    {
        "Ambrose of Milan": "ambrose of milan"
    },
    {
        ", ": null
    },
    {
        "Venantius Fortunatus": "venantius fortunatus"
    },
    {
        ", and ": null
    },
    {
        "Hilary of Poitiers": "hilary of poitiers"
    },
    {
        ", among others. See  for examples of various theories of authorship.     The 1940 discovery of a lost work by ": null
    },
    {
        "Vincent of Lérins": "vincent of lérins"
    },
    {
        ", which bears a striking similarity to much of the language of the Athanasian Creed, have led many to conclude that the creed originated either with Vincent or with his students.  For example, in the authoritative modern monograph about the creed, ": null
    },
    {
        "J. N. D. Kelly": "j. n. d. kelly"
    },
    {
        " asserts that Vincent of Lérins was not its author, but that it may have come from the same milieu, namely the area of Lérins in southern Gaul.  The oldest surviving manuscripts of the Athanasian Creed date from the late 8th century.           The Athanasian Creed is usually divided into two sections: lines 1–28 addressing the doctrine of the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        ", and lines 29–44 addressing the doctrine of ": null
    },
    {
        "Christology": "christology"
    },
    {
        ". See  for an example of this division. Enumerating the three persons of the Trinity , the first section of the creed ascribes the ": null
    },
    {
        "divine attributes": "divine attribute"
    },
    {
        "to each individually. Thus, each person of the Trinity is described as uncreated , limitless , eternal , and omnipotent . Athanasian Creed, lines 8,9,10, and 13, respectively. See the side by side English and Latin in      While ascribing the divine attributes and divinity to each person of the Trinity, thus avoiding ": null
    },
    {
        "subordinationism": "subordinationism"
    },
    {
        ", the first half of the Athanasian Creed also stresses the unity of the three persons in the one Godhead, thus avoiding a theology of ": null
    },
    {
        "tritheism": "tritheism"
    },
    {
        ". Furthermore, although one God, the Father, Son, and Holy Spirit are distinct from each other. For the Father is neither made nor begotten; the Son is not made but is begotten from the Father; the Holy Spirit is neither made nor begotten but proceeds from the Father – Western churches include and the Son , a concept which Eastern and Oriental Orthodox reject.     The text of the Athanasian Creed is as follows:          The Christology of the second section is more detailed than that of the Nicene Creed, and reflects the teaching of the ": null
    },
    {
        "First Council of Ephesus": "first council of ephesus"
    },
    {
        " and the definition of the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        " . The Athanasian Creed uses the term substantia  not only with respect to the relation of the Son to the Father according to his divine nature, but also says the Son is substantia of his mother Mary according to his human nature.     The Creeds wording thus excludes not only ": null
    },
    {
        "Sabellianism": "sabellianism"
    },
    {
        " and ": null
    },
    {
        "Arianism": "arianism"
    },
    {
        ", but the Christological heresies of ": null
    },
    {
        "Nestorianism": "nestorianism"
    },
    {
        " and ": null
    },
    {
        "Eutychianism": "eutychianism"
    },
    {
        ". A need for a clear confession against Arianism arose in western Europe when the ": null
    },
    {
        "Ostrogoths": "ostrogoths"
    },
    {
        " and ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        ", who had Arian beliefs, invaded at the beginning of the 5th century.     The final section of this Creed also moved beyond the Nicene Creeds in making negative statements about the peoples fate: They that have done good shall go into life everlasting: and they that have done evil into everlasting fire. This caused considerable debate in England in the mid-nineteenth century, centred on the teaching of ": null
    },
    {
        "Frederick Denison Maurice": "frederick denison maurice"
    },
    {
        ".              Composed of 44 rhythmic lines, the Athanasian Creed appears to have been intended as a liturgical document – that is, the original purpose of the creed was to be spoken or sung as a part of worship. The creed itself uses the language of public worship, speaking of the worship of God rather than the language of belief . In the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " in medieval times, this creed was recited following the Sunday sermon or at the Sunday Office of ": null
    },
    {
        "Prime": "prime"
    },
    {
        ".  The creed was often set to music and used in the place of a Psalm.     Early ": null
    },
    {
        "Protestants": "protestantism"
    },
    {
        " inherited the late medieval devotion to the Athanasian Creed, and it was considered to be authoritative in many Protestant churches. The statements of Protestant belief of various Reformers commend the Athanasian Creed to their followers, including the ": null
    },
    {
        "Augsburg Confession": "augsburg confession"
    },
    {
        ", the ": null
    },
    {
        "Formula of Concord": "formula of concord"
    },
    {
        ", the ": null
    },
    {
        "Second Helvetic Confession": "second helvetic confession"
    },
    {
        ", the ": null
    },
    {
        "Belgic Confession": "belgic confession"
    },
    {
        ", the Bohemian Confession and the ": null
    },
    {
        "Thirty-nine Articles": "thirty-nine articles"
    },
    {
        ". See , , , ,  A ": null
    },
    {
        "metric": "meter"
    },
    {
        " version titled Quicumque vult , with a musical setting, was published in The Whole Booke of Psalmes printed by ": null
    },
    {
        "John Day": "john day"
    },
    {
        " in 1562. Among modern Lutheran and Reformed churches adherence to the Athanasian Creed is prescribed by the earlier confessional documents, but the creed does not receive much attention outside of occasional use – especially on ": null
    },
    {
        "Trinity Sunday": "trinity sunday"
    },
    {
        ".     In Reformed circles, it is included in the Christian Reformed Churches of Australias Book of Forms . However, it is rarely recited in public worship.     In the successive Books of Common Prayer of the reformed Church of England, from 1549 to 1662, its recitation was provided for on 19 occasions each year, a practice which continued until the nineteenth century, when vigorous controversy regarding its statement about eternal damnation saw its use gradually decline. It remains one of the three Creeds approved in the Thirty-Nine Articles, and is printed in several current Anglican prayer books . As with Roman Catholic practice, its use is now generally only on Trinity Sunday or its octave. The Episcopal Church based in the United States has never provided for its use in worship, but added it to its Book of Common Prayer for the first time in 1979, where it is included in small print in a reference section entitled Historical Documents of the Church. Hatchett 1980, p. 584     In ": null
    },
    {
        "Roman Catholic": "catholic church"
    },
    {
        " churches, it was traditionally said at ": null
    },
    {
        "Prime": "prime"
    },
    {
        " on Sundays when the ": null
    },
    {
        "Office": "liturgy of the hours"
    },
    {
        " was of the Sunday. The 1911 reforms reduced this to Sundays after Epiphany and Pentecost, and on ": null
    },
    {
        "Trinity Sunday": "trinity sunday"
    },
    {
        ", except when a commemoration of a Double feast or a day within an Octave occurred. The 1960 reforms further reduced its use to once a year, on Trinity Sunday. It has been effectively dropped from the Catholic liturgy since the ": null
    },
    {
        "Second Vatican Council": "second vatican council"
    },
    {
        ". It is however maintained in the Forma Extraordinaria, per the decree ": null
    },
    {
        "Summorum Pontificum": "summorum pontificum"
    },
    {
        ", and also in the rite of exorcism, both in the Forma Ordinaria and the Forma Extraordinaria of the Roman Rite.     In ": null
    },
    {
        "Lutheranism": "lutheranism"
    },
    {
        ", the Athanasian Creed is—along with the ": null
    },
    {
        "Apostles": "apostles creed"
    },
    {
        " and ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        "s—one of the three ": null
    },
    {
        "ecumenical creeds": "ecumenical creeds"
    },
    {
        " placed at the beginning of the 1580 ": null
    },
    {
        "Book of Concord": "book of concord"
    },
    {
        ", the historic collection of authoritative doctrinal statements of the Lutheran Church. It is still used in the liturgy on ": null
    },
    {
        "Trinity Sunday": "trinity sunday"
    },
    {
        ".     A common visualisation of the first half of the Creed is the ": null
    },
    {
        "Shield of the Trinity": "shield of the trinity"
    },
    {
        ".       ": null
    }
]