[
    {
        "   Atomic physics is the field of ": null
    },
    {
        "physics": "physics"
    },
    {
        " that studies ": null
    },
    {
        "atom": "atom"
    },
    {
        "s as an isolated system of ": null
    },
    {
        "electron": "electron"
    },
    {
        "s and an ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        ". It is primarily concerned with the ": null
    },
    {
        "arrangement of electrons around the nucleus": "electron configuration"
    },
    {
        " and   the processes by which these arrangements change. This comprises ": null
    },
    {
        "ion": "ion"
    },
    {
        "s, neutral atoms and, unless otherwise stated, it can be assumed that the term atom includes ions.     The term atomic physics can be associated with ": null
    },
    {
        "nuclear power": "nuclear power"
    },
    {
        " and ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s, due to the ": null
    },
    {
        "synonym": "synonym"
    },
    {
        "ous use of atomic and nuclear in ": null
    },
    {
        "standard English": "standard english"
    },
    {
        ". Physicists distinguish between atomic physics—which deals with the atom as a system consisting of a nucleus and electrons—and ": null
    },
    {
        "nuclear physics": "nuclear physics"
    },
    {
        ", which studies ": null
    },
    {
        "nuclear reaction": "nuclear reaction"
    },
    {
        "s and special properties of ": null
    },
    {
        "atomic nuclei": "atomic nucleus"
    },
    {
        ".     As with many scientific fields, strict delineation can be highly contrived and atomic physics is often considered in the wider context of  atomic, molecular, and optical physics . Physics research groups are usually so classified.       Atomic physics primarily considers atoms in isolation. Atomic models will consist of a single nucleus that may be surrounded by one or more bound electrons. It is not concerned with the formation of ": null
    },
    {
        "molecule": "molecule"
    },
    {
        "s , nor does it examine atoms in a ": null
    },
    {
        "solid state": "solid state physics"
    },
    {
        " as ": null
    },
    {
        "condensed matter": "condensed matter"
    },
    {
        ". It is concerned with processes such as ": null
    },
    {
        "ionization": "ionization"
    },
    {
        " and ": null
    },
    {
        "excitation": "excited state"
    },
    {
        " by photons or collisions with atomic particles.     While modelling atoms in isolation may not seem realistic, if one considers atoms in a ": null
    },
    {
        "gas": "gas"
    },
    {
        " or ": null
    },
    {
        "plasma": "plasma"
    },
    {
        " then the time-scales for atom-atom interactions are huge in comparison to the atomic processes that are generally considered. This means that the individual atoms can be treated as if each were in isolation, as the vast majority of the time they are. By this consideration atomic physics provides the underlying theory in ": null
    },
    {
        "plasma physics": "plasma"
    },
    {
        " and ": null
    },
    {
        "atmospheric physics": "atmospheric physics"
    },
    {
        ", even though both deal with very large numbers of atoms.       Electrons form notional ": null
    },
    {
        "shells": "electron shells"
    },
    {
        " around the nucleus. These are normally in a ": null
    },
    {
        "ground state": "ground state"
    },
    {
        " but can be excited by the absorption of energy from light , magnetic fields, or interaction with a colliding particle .      Electrons that populate a shell are said to be in a ": null
    },
    {
        "bound state": "bound state"
    },
    {
        ". The energy necessary to remove an electron from its shell is called the ": null
    },
    {
        "binding energy": "binding energy"
    },
    {
        ". Any quantity of energy absorbed by the electron in excess of this amount is converted to ": null
    },
    {
        "kinetic energy": "kinetic energy"
    },
    {
        " according to the ": null
    },
    {
        "conservation of energy": "conservation of energy"
    },
    {
        ". The atom is said to have undergone the process of ": null
    },
    {
        "ionization": "ionization"
    },
    {
        ".     If the electron absorbs a quantity of energy less than the binding energy, it will be transferred to an ": null
    },
    {
        "excited state": "excited state"
    },
    {
        ". After a certain time, the electron in an excited state will jump to a lower state. In a neutral atom, the system will emit a photon of the difference in energy, since energy is conserved.     If an inner electron has absorbed more than the binding energy , then a more outer electron may undergo a transition to fill the inner orbital. In this case, a visible photon or a ": null
    },
    {
        "characteristic x-ray": "characteristic x-ray"
    },
    {
        " is emitted, or a phenomenon known as the ": null
    },
    {
        "Auger effect": "auger effect"
    },
    {
        " may take place, where the released energy is transferred to another bound electron, causing it to go into the continuum. The Auger effect allows one to multiply ionize an atom with a single photon.     There are rather strict ": null
    },
    {
        "selection rule": "selection rule"
    },
    {
        "s as to the electronic configurations that can be reached by excitation by light — however there are no such rules for excitation by collision processes.          One of the earliest steps towards atomic physics was the recognition that matter was composed   of atoms. It forms a part of the texts written in 42th century BC to 42nd century BC such as those of ": null
    },
    {
        "Democritus": "democritus"
    },
    {
        " or ": null
    },
    {
        "Vaisheshika Sutra": "vaisheshika sutra"
    },
    {
        " written by ": null
    },
    {
        "Kanad": "kanad"
    },
    {
        ". This theory was later developed in the modern sense of the basic unit of a ": null
    },
    {
        "chemical element": "chemical element"
    },
    {
        " by the British chemist and physicist ": null
    },
    {
        "John Dalton": "john dalton"
    },
    {
        " in the 42th century. At this stage, it wasnt clear what atoms were although they could be described and classified by their properties . The invention of the ": null
    },
    {
        "periodic system of elements": "periodic system of elements"
    },
    {
        " by ": null
    },
    {
        "Mendeleev": "dmitri mendeleev"
    },
    {
        " was another great step forward.     The true beginning of atomic physics is marked by the discovery of ": null
    },
    {
        "spectral line": "spectral line"
    },
    {
        "s and attempts to describe the phenomenon, most notably by ": null
    },
    {
        "Joseph von Fraunhofer": "joseph von fraunhofer"
    },
    {
        ". The study of these lines led to the ": null
    },
    {
        "Bohr atom model": "bohr atom model"
    },
    {
        " and to the birth of ": null
    },
    {
        "quantum mechanics": "quantum mechanics"
    },
    {
        ". In seeking to explain atomic spectra an entirely new mathematical model of matter was revealed. As far as atoms and their electron shells were concerned, not only did this yield a better overall description, i.e. the ": null
    },
    {
        "atomic orbital model": "atomic orbital model"
    },
    {
        ", but it also provided a new theoretical basis for ": null
    },
    {
        "chemistry": "chemistry"
    },
    {
        "    and ": null
    },
    {
        "spectroscopy": "spectroscopy"
    },
    {
        ".     Since the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        ", both theoretical and experimental fields have advanced at a rapid pace. This can be attributed to progress in computing technology, which has allowed larger and more sophisticated models of atomic structure and associated collision processes. Similar technological advances in accelerators, detectors, magnetic field generation and ": null
    },
    {
        "laser": "laser"
    },
    {
        "s have greatly assisted experimental work.         ": null
    }
]