[
    {
        "In ": null
    },
    {
        "telecommunications": "telecommunications"
    },
    {
        ", an audit is one of:     The act of conducting a review, examination and reconciliation of Telecom, Wireless and Network customer service records, invoicing and contract agreements in order to ensure the accuracy of budgetary forecasting.   Independent review and examination of records and activities to assess the adequacy of system controls, to ensure compliance with established policies and operational procedures, and to recommend necessary changes in controls, policies, or procedures.   Analysis of invoices, lines, rates, tariffs, taxes, plans, usage, call volume, systems, and contracts resulting in cost reduction, proper invoicing and optimization of telecommunication systems often conducted by an independent telecommunications consultant or firm.     The simplest audits consist of comparing current ": null
    },
    {
        "telecommunications billing": "telecommunications billing"
    },
    {
        " and usage to the underlying rate structure whether that is dictated by contract, tariff, or price list. Complex audits utilize software applications, direct bargaining with service providers and activity reports that include detail down to an individual employees usage.       In ": null
    },
    {
        "business": "business"
    },
    {
        ", companies with significant telecommunications costs or a telecommunications focus normally either conduct audits internally or hire a ": null
    },
    {
        "consultant": "consultant"
    },
    {
        ". No matter the method, typical audits encompass one or more of the following:     Telecom Expense Management : An ongoing analysis and adjustment of internal telecommunications procedures and billing designed to maximize savings. See also ": null
    },
    {
        "Wireless Expense Management": "wireless expense management"
    },
    {
        " analytics": "analytics"
    },
    {
        ". Internal auditors and consultants both use ": null
    },
    {
        "software": "software"
    },
    {
        " as part of the process: either a generalized ": null
    },
    {
        "database": "database"
    },
    {
        " application or specialized applications designed for auditing.     Telecom audits can encompass every communications service that a business expends its ": null
    },
    {
        "budget": "budget"
    },
    {
        " on. Audits may focus on ": null
    },
    {
        "mobile phones": "mobile phones"
    },
    {
        " and devices, ": null
    },
    {
        "Internet": "internet"
    },
    {
        " service or ": null
    },
    {
        "land line": "land line"
    }
]