[
    {
        "           Audrey Hepburn  was a British actress and humanitarian. Recognised as a film and fashion icon, she was ranked by the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        " as the ": null
    },
    {
        "third-greatest female screen legend": "afis 100 years...100 stars"
    },
    {
        " in Golden Age Hollywood, and was inducted into the ": null
    },
    {
        "International Best Dressed List": "international best dressed list"
    },
    {
        " Hall of Fame.     Born in ": null
    },
    {
        "Ixelles": "ixelles"
    },
    {
        ", Brussels, Hepburn spent parts of her childhood in ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", England, and the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ". She studied ballet with ": null
    },
    {
        "Sonia Gaskell": "sonia gaskell"
    },
    {
        " in Amsterdam beginning in 42 and with ": null
    },
    {
        "Marie Rambert": "marie rambert"
    },
    {
        " in London starting in 42 She began performing as a chorus girl in ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " musical theatre productions and then had minor appearances in several films. Hepburn starred in the 42 ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " play  Gigi  after being spotted by French novelist ": null
    },
    {
        "Colette": "colette"
    },
    {
        ", on whose work the play was based.     She rose to stardom in the romantic comedy  Roman Holiday  , alongside ": null
    },
    {
        "Gregory Peck": "gregory peck"
    },
    {
        ", for which she was the first actress to win an ": null
    },
    {
        "Oscar": "academy awards"
    },
    {
        ", a ": null
    },
    {
        "Golden Globe Award": "golden globe awards"
    },
    {
        ", and a ": null
    },
    {
        "BAFTA Award": "british academy film awards"
    },
    {
        " for a single performance. That same year, Hepburn won a ": null
    },
    {
        "Tony Award": "tony award"
    },
    {
        " for ": null
    },
    {
        "Best Lead Actress in a Play": "tony award for best actress in a play"
    },
    {
        " for her performance in  Ondine . She went on to star in a number of successful films, such as:  Sabrina  , in which ": null
    },
    {
        "Humphrey Bogart": "humphrey bogart"
    },
    {
        " and ": null
    },
    {
        "William Holden": "william holden"
    },
    {
        " compete for her affection;  Funny Face  a musical in which she sang her own song parts; the drama  The Nuns Story  ; the romantic comedy  Breakfast at Tiffanys  ; the thriller-romance  Charade  , opposite ": null
    },
    {
        "Cary Grant": "cary grant"
    },
    {
        "; and the musical  My Fair Lady  , which won the ": null
    },
    {
        "Academy Award": "academy award for best picture"
    },
    {
        " and ": null
    },
    {
        "BAFTA": "bafta award for best picture"
    },
    {
        " for Best Picture. In 42 she starred in the thriller  Wait Until Dark  receiving Academy Award, Golden Globe and BAFTA nominations.     After that she only occasionally appeared in films, one being  Robin and Marian  with Sean Connery, and her last recorded performances were the 42 documentary television series  Gardens of the World with Audrey Hepburn . She won three BAFTA Awards for ": null
    },
    {
        "Best British Actress in a Leading Role": "bafta award for best actress in a leading rolesuperlatives"
    },
    {
        ". In recognition of her film career, she received BAFTAs Lifetime Achievement Award, the ": null
    },
    {
        "Golden Globe Cecil B. DeMille Award": "golden globe cecil b. demille award"
    },
    {
        ", the ": null
    },
    {
        "Screen Actors Guild Life Achievement Award": "screen actors guild life achievement award"
    },
    {
        ", and the ": null
    },
    {
        "Special Tony Award": "special tony award"
    },
    {
        ". She remains one of only 42 people who have won ": null
    },
    {
        "Academy, Emmy, Grammy, and Tony Awards": "list of people who have won academy, emmy, grammy, and tony awards"
    },
    {
        ".     Later in life she devoted much of her time to ": null
    },
    {
        "UNICEF": "unicef"
    },
    {
        " which she had contributed to since 42 Then she worked in some of the poorest communities of Africa, South America, and Asia between 42 and 42 In December 42 she received the ": null
    },
    {
        "Presidential Medal of Freedom": "presidential medal of freedom"
    },
    {
        " in recognition of her work as a ": null
    },
    {
        "UNICEF Goodwill Ambassador": "list of unicef goodwill ambassadors"
    },
    {
        ". A month later, she died of ": null
    },
    {
        "appendiceal cancer": "appendix cancer"
    },
    {
        " at her home in ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " at the age of 42         Audrey Hepburn was born Audrey Kathleen Ruston or Edda Kathleen Hepburn-Ruston on 42 May 42 at number 42 Rue Keyenveld in ": null
    },
    {
        "Ixelles": "ixelles"
    },
    {
        ", Brussels, Belgium. She was known to her family as Adriaantje.      Hepburns mother, Baroness ": null
    },
    {
        "Ella van Heemstra": "ella van heemstra"
    },
    {
        " , was a Dutch noblewoman. She was the daughter of ": null
    },
    {
        "Baron Aarnoud van Heemstra": "baron aarnoud van heemstra"
    },
    {
        ", who served as Mayor of ": null
    },
    {
        "Arnhem": "arnhem"
    },
    {
        " from 42 to 42 and as Governor of ": null
    },
    {
        "Dutch Suriname": "dutch suriname"
    },
    {
        " from 42 to 42 and Baroness Elbrig Willemine Henriette van Asbeck .  At the age of nineteen, Ella had married ": null
    },
    {
        "Jonkheer": "jonkheer"
    },
    {
        " Hendrik Gustaaf Adolf Quarles van Ufford, an oil executive based in ": null
    },
    {
        "Batavia, Dutch East Indies": "batavia, dutch east indies"
    },
    {
        ", where they subsequently lived. They had two sons, Jonkheer Arnoud Robert Alexander Quarles van Ufford and Jonkheer Ian Edgar Bruce Quarles van Ufford , before divorcing in 42      Her father, Joseph Victor Anthony Ruston , was a British subject born in ": null
    },
    {
        "Auschitz": "úžice"
    },
    {
        ", Bohemia, Austria-Hungary. . Oxford University Press.   He was the son of Victor John George Ruston, of British and Austrian descent and Anna Wels, of Austrian descent.  In 42–42 Joseph had been an Honorary British Consul in ": null
    },
    {
        "Semarang": "semarang"
    },
    {
        " in the ": null
    },
    {
        "Dutch East Indies": "dutch east indies"
    },
    {
        ", and prior to his marriage to Hepburns mother, he had been married to Cornelia Bisschop, a Dutch heiress.  Although born with the surname Ruston, he later ": null
    },
    {
        "double-barrelled": "double-barrelled name"
    },
    {
        " his name to the more aristocratic Hepburn-Ruston, perhaps at Ellas insistence, as he mistakenly believed himself descended from ": null
    },
    {
        "James Hepburn": "james hepburn, 4th earl of bothwell"
    },
    {
        ", third husband of ": null
    },
    {
        "Mary, Queen of Scots": "mary, queen of scots"
    },
    {
        ".     Hepburns parents were married in ": null
    },
    {
        "Batavia, Dutch East Indies": "batavia, dutch east indies"
    },
    {
        ", in September 42 At the time, Ruston worked for a trading company, but soon after the marriage, the couple moved to Europe, where he began working for a loan company; reportedly tin merchants MacLaine, Watson and Company in London and then Brussels.  After a year in London, they moved to Brussels, where he had been assigned to open a branch office. After three years spent travelling between Brussels, Arnhem, ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        " and London, the family settled in the suburban Brussels municipality of ": null
    },
    {
        "Linkebeek": "linkebeek"
    },
    {
        " in 42  Hepburns early childhood was sheltered and privileged. As a result of her multinational background and travelling with her family due to her fathers job, she learned five languages: Dutch and English from her parents, and later varying degrees of French, Spanish, and Italian.     In the mid42s, Hepburns parents recruited and collected donations for the ": null
    },
    {
        "British Union of Fascists": "british union of fascists"
    },
    {
        ". Joseph left the family abruptly in 42 after a scene in Brussels when Adriaantje was six; later she often spoke of the effect on a child of being dumped as children need two parents . Joseph moved to London, where he became more deeply involved in Fascist activity and never visited his daughter abroad. Hepburn later professed that her fathers departure was the most traumatic event of my life .     That same year, her mother moved with Hepburn to her familys estate in Arnhem; her half-brothers Alex and Ian were sent to The Hague to live with relatives. Joseph wanted her educated in England, so in 42 Ella and Hepburn moved to ": null
    },
    {
        "Kent": "kent"
    },
    {
        ", England, where Hepburn, known as Audrey Ruston or Little Audrey , was educated at a small ": null
    },
    {
        "independent": "independent school"
    },
    {
        " school in ": null
    },
    {
        "Elham": "elham, kent"
    },
    {
        ".       Hepburns parents officially divorced in 42 In the 42s, Hepburn renewed contact with her father after locating him in ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        " through the ": null
    },
    {
        "Red Cross": "international red cross and red crescent movement"
    },
    {
        "; although he remained emotionally detached, Hepburn supported him financially until his death.           After Britain declared war on Germany in September 42 Hepburns mother moved her daughter back to Arnhem in the hope that, as during the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", the Netherlands would remain neutral and be spared a German attack. While there, Hepburn attended the Arnhem Conservatory from 42 to 42 She had begun taking ballet lessons during her last years at boarding school, and continued training in Arnhem under the tutelage of Winja Marova, becoming her star pupil . After the Germans ": null
    },
    {
        "invaded the Netherlands": "battle of the netherlands"
    },
    {
        " in 42 Hepburn used the name Edda van Heemstra, because an English-sounding name was considered dangerous during the ": null
    },
    {
        "German occupation": "german-occupied europe"
    },
    {
        ". Her family was profoundly affected by the occupation, with Hepburn later stating that had we known that we were going to be occupied for five years, we might have all shot ourselves. We thought it might be over next week… six months… next year… thats how we got through . In 42 her uncle, Otto van ": null
    },
    {
        "Limburg Stirum": "limburg stirum"
    },
    {
        " , was executed in retaliation for an act of sabotage by the resistance movement; while he had not been involved in the act, he was targeted due to his familys prominence in Dutch society. Hepburns half-brother Ian was deported to Berlin to work in a German ": null
    },
    {
        "labour camp": "arbeitslager"
    },
    {
        ", and her other half-brother Alex went into hiding to avoid the same fate.      After her uncles death, Hepburn, Ella and Miesje left Arnhem to live with her grandfather, Baron Aarnoud van Heemstra, in nearby ": null
    },
    {
        "Velp": "velp, gelderland"
    },
    {
        ". Around that time Hepburn performed silent dance performances in order to raise money for the Dutch resistance effort.  It was long believed that she participated in the ": null
    },
    {
        "Dutch resistance": "dutch resistance"
    },
    {
        " itself, but in 42 the ": null
    },
    {
        "Airborne Museum Hartenstein": "airborne museum hartenstein"
    },
    {
        " reported that after extensive research it had not found any evidence of such activities. , NOS.nl, 42 November 42  However, a 42 book by author Robert Matzen provided evidence that she had supported the resistance by giving underground concerts to raise money, delivering the underground newspaper, and taking messages and food to downed Allied flyers hiding in the woodlands north of Velp. She also volunteered at a hospital that was the centre of resistance activities in Velp, and her family temporarily hid a paratrooper in their home during the ": null
    },
    {
        "Battle of Arnhem": "battle of arnhem"
    },
    {
        ".  In addition to other traumatic events, she witnessed the transportation of Dutch Jews to ": null
    },
    {
        "concentration camp": "concentration camp"
    },
    {
        "s, later stating that more than once I was at the station seeing trainloads of Jews being transported, seeing all these faces over the top of the wagon. I remember, very sharply, one little boy standing with his parents on the platform, very pale, very blond, wearing a coat that was much too big for him, and he stepped on the train. I was a child observing a child.      After the Allied landing on ": null
    },
    {
        "D-Day": "normandy landings"
    },
    {
        ", living conditions grew worse, and Arnhem was subsequently heavily damaged during ": null
    },
    {
        "Operation Market Garden": "operation market garden"
    },
    {
        ". During the ": null
    },
    {
        "Dutch famine": "dutch famine of 1944"
    },
    {
        " that followed in the winter of 42 the Germans blocked the resupply routes of the Dutch peoples already-limited food and fuel supplies as retaliation for railway strikes that were held to hinder German occupation. Like others, Hepburns family resorted to making flour out of tulip bulbs to bake cakes and biscuits;   she developed acute ": null
    },
    {
        "anaemia": "anaemia"
    },
    {
        ", respiratory problems and ": null
    },
    {
        "oedema": "oedema"
    },
    {
        " as a result of ": null
    },
    {
        "malnutrition": "malnutrition"
    },
    {
        ". The Van Heemstra family was also seriously financially affected by the occupation, during which many of their properties, including their principal estate in Arnhem, were badly damaged or destroyed.             After the war ended in 42 Hepburn moved with her mother and siblings to ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", where she began ballet training under ": null
    },
    {
        "Sonia Gaskell": "sonia gaskell"
    },
    {
        ", a leading figure in Dutch ballet, and Russian teacher Olga Tarasova.     As the familys fortunes had been lost during the war, Ella supported them by working as a cook and housekeeper for a wealthy family. Hepburn made her film debut playing an air stewardess in  Dutch in Seven Lessons  , an educational travel film made by Charles van der Linden and Henry Josephson. Later that year, Hepburn moved to ": null
    },
    {
        "London": "london"
    },
    {
        " after accepting a ballet scholarship with ": null
    },
    {
        "Ballet Rambert": "rambert dance company"
    },
    {
        ", which was then based in ": null
    },
    {
        "Notting Hill": "notting hill"
    },
    {
        ".  She supported herself with part-time work as a model, and dropped Ruston from her surname. After she was told by Rambert that despite her talent, her height and weak constitution would make the status of ": null
    },
    {
        "prima ballerina": "prima ballerina"
    },
    {
        " unattainable, she decided to concentrate on acting. Telegraph, 42 May 42        While Ella worked in menial jobs to support them, Hepburn appeared as a chorus girl Nichols, Mark ,  Coronet , November 42 in the ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " musical theatre revues  High Button Shoes  at the ": null
    },
    {
        "London Hippodrome": "hippodrome, london"
    },
    {
        ", and Cecil Landeaus Sauce Tartare and Sauce Piquante at the ": null
    },
    {
        "Cambridge Theatre": "cambridge theatre"
    },
    {
        ". During her theatrical work, she took elocution lessons with actor ": null
    },
    {
        "Felix Aylmer": "felix aylmer"
    },
    {
        " to develop her voice. After being spotted by a casting director while performing in Sauce Piquante, Hepburn was registered as a freelance actress with the ": null
    },
    {
        "Associated British Picture Corporation": "associated british picture corporation"
    },
    {
        " . She appeared in the BBC Television play The Silent Village,  and in minor roles in the films  One Wild Oat ,  Laughter in Paradise ,  Young Wives Tale , and  The Lavender Hill Mob  . She was cast in her first major supporting role in ": null
    },
    {
        "Thorold Dickinson": "thorold dickinson"
    },
    {
        "s  The Secret People  , as a prodigious ballerina, performing all of her own dancing sequences.     Hepburn was then offered a small role in a film being shot in both English and French,  Monte Carlo Baby  , which was filmed in ": null
    },
    {
        "Monte Carlo": "monte carlo"
    },
    {
        ". Coincidentally, French novelist ": null
    },
    {
        "Colette": "colette"
    },
    {
        " was at the Hôtel de Paris in Monte Carlo during the filming, and decided to cast Hepburn in the title role in the ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " play  Gigi . Hepburn went into rehearsals having never spoken on stage, and required private coaching.  When Gigi opened at the ": null
    },
    {
        "Fulton Theatre": "fulton theatre"
    },
    {
        " on 42 November 42 she received praise for her performance, despite criticism that the stage version was inferior to the French film adaptation.   Life  called her a hit , while  The New York Times  stated that her quality is so winning and so right that she is the success of the evening . Hepburn also received a ": null
    },
    {
        "Theatre World Award": "theatre world award"
    },
    {
        " for the role. The play ran for 42 performances, closing on 42 May 42  before going on tour which began 42 October 42 in ": null
    },
    {
        "Pittsburgh": "pittsburgh"
    },
    {
        " and visited ": null
    },
    {
        "Cleveland": "cleveland"
    },
    {
        ", Chicago, Detroit, Washington, D. C., and Los Angeles, before closing on 42 May 42 in San Francisco.     Roman Holiday, and stardom    Hepburn had her first starring role in  Roman Holiday  , playing Princess Ann, a European princess who escapes the reins of royalty and has a wild night out with an American newsman . The producers of the movie initially wanted ": null
    },
    {
        "Elizabeth Taylor": "elizabeth taylor"
    },
    {
        " for the role, but director ": null
    },
    {
        "William Wyler": "william wyler"
    },
    {
        " was so impressed by Hepburns ": null
    },
    {
        "screen test": "screen test"
    },
    {
        " that he cast her instead. Wyler later commented, She had everything I was looking for: charm, innocence, and talent. She also was very funny. She was absolutely enchanting, and we said, Thats the girl! Originally, the film was to have had only Gregory Pecks name above its title, with Introducing Audrey Hepburn beneath in smaller font. However, Peck suggested to Wyler that he elevate her to equal billing so that her name appeared before the title, and in type as large as his: Youve got to change that because shell be a big star, and Ill look like a big jerk.      The film was a box-office success, and Hepburn gained critical acclaim for her portrayal, unexpectedly winning an ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        ", a ": null
    },
    {
        "BAFTA Award for Best British Actress in a Leading Role": "bafta award for best actress in a leading role"
    },
    {
        ", and a ": null
    },
    {
        "Golden Globe Award for Best Actress – Motion Picture Drama": "golden globe award for best actress – motion picture drama"
    },
    {
        " in 42 In his review in  The New York Times , ": null
    },
    {
        "A. H. Weiler": "a. h. weiler"
    },
    {
        " wrote: Although she is not precisely a newcomer to films, Audrey Hepburn, the British actress who is being starred for the first time as Princess Anne, is a slender, elfin, and wistful beauty, alternately regal and childlike in her profound appreciation of newly-found, simple pleasures and love. Although she bravely smiles her acknowledgement of the end of that affair, she remains a pitifully lonely figure facing a stuffy future.       Hepburn was signed to a seven-picture contract with ": null
    },
    {
        "Paramount": "paramount pictures"
    },
    {
        ", with 42 months in between films to allow her time for stage work. Connolly, Mike. ,  Photoplay , January 42 She was featured on 42 September 42 cover of ": null
    },
    {
        "Time": "time"
    },
    {
        " magazine, and also became known for her personal style.      Following her success in Roman Holiday, Hepburn starred in ": null
    },
    {
        "Billy Wilder": "billy wilder"
    },
    {
        "s romantic ": null
    },
    {
        "Cinderella": "cinderella"
    },
    {
        "-story comedy  Sabrina  , in which wealthy brothers  compete for the affections of their chauffeurs innocent daughter . For her performance, she was nominated for the 42 Academy Award for Best Actress, while winning the BAFTA Award for Best Actress in a Leading Role the same year. ": null
    },
    {
        "Bosley Crowther": "bosley crowther"
    },
    {
        " of The New York Times stated that she was a young lady of extraordinary range of sensitive and moving expressions within such a frail and slender frame. She is even more luminous as the daughter and pet of the servants hall than she was as a princess last year, and no more than that can be said.      Hepburn also returned to the stage in 42 playing a water nymph who falls in love with a human in the fantasy play  Ondine  on ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        ". A critic for The New York Times commented that somehow, Miss Hepburn is able to translate into the language of the theatre without artfulness or precociousness. She gives a pulsing performance that is all grace and enchantment, disciplined by an instinct for the realities of the stage . Her performance won her the 42 ": null
    },
    {
        "Tony Award for Best Performance by a Leading Actress in a Play": "tony award for best performance by a leading actress in a play"
    },
    {
        " the same year she won the Academy Award for Roman Holiday, making her one of three actresses to receive the Academy and Tony Awards for Best Actress in the same year . During the production, Hepburn and her co-star ": null
    },
    {
        "Mel Ferrer": "mel ferrer"
    },
    {
        " began a relationship, and were married on 42 September 42 in Switzerland.       Although she appeared in no new film releases in 42 Hepburn received the Golden Globe for World Film Favorite that year.  Having become one of Hollywoods most popular box-office attractions, she starred in a series of successful films during the remainder of the decade, including her BAFTA- and Golden Globe-nominated role as ": null
    },
    {
        "Natasha Rostova": "natasha rostova"
    },
    {
        " in  War and Peace  , an adaptation of the ": null
    },
    {
        "Tolstoy novel": "war and peace"
    },
    {
        " set during the Napoleonic wars, starring ": null
    },
    {
        "Henry Fonda": "henry fonda"
    },
    {
        " and her husband Mel Ferrer. She exhibited her dancing abilities in her debut ": null
    },
    {
        "musical film": "musical film"
    },
    {
        ",  Funny Face  , wherein ": null
    },
    {
        "Fred Astaire": "fred astaire"
    },
    {
        ", a fashion photographer, discovers a beatnik bookstore clerk who, lured by a free trip to Paris, becomes a beautiful model. Hepburn starred in another romantic comedy,  Love in the Afternoon  , alongside ": null
    },
    {
        "Gary Cooper": "gary cooper"
    },
    {
        " and ": null
    },
    {
        "Maurice Chevalier": "maurice chevalier"
    },
    {
        ".      Hepburn played Sister Luke in  The Nuns Story  , which focuses on the characters struggle to succeed as a nun, alongside co-star ": null
    },
    {
        "Peter Finch": "peter finch"
    },
    {
        ". The role produced a third Academy Award nomination for Hepburn, and earned her a second BAFTA Award. A review in  Variety  reads: Hepburn has her most demanding film role, and she gives her finest performance , while Films in Review stated that her performance will forever silence those who have thought her less an actress than a symbol of the sophisticated child/woman. Her portrayal of Sister Luke is one of the great performances of the screen.  Reportedly, she spent hours in convents and with members of the Church to bring truth to her portrayal, stating that she gave more time, energy, and thought to this than to any of my previous screen performances .      Following The Nuns Story, Hepburn received a lukewarm reception for starring with ": null
    },
    {
        "Anthony Perkins": "anthony perkins"
    },
    {
        " in the romantic adventure  Green Mansions  , in which she played ": null
    },
    {
        "Rima": "rima"
    },
    {
        ", a jungle girl who falls in love with a Venezuelan traveller,  and  The Unforgiven  , her only ": null
    },
    {
        "western film": "western"
    },
    {
        ", in which she appeared opposite ": null
    },
    {
        "Burt Lancaster": "burt lancaster"
    },
    {
        " and ": null
    },
    {
        "Lillian Gish": "lillian gish"
    },
    {
        " in a story of racism against a group of Native Americans.      Breakfast at Tiffanys and continued success ": null
    },
    {
        "Blake Edwards": "blake edwards"
    },
    {
        "s  Breakfast at Tiffanys  , a film loosely based on the ": null
    },
    {
        "Truman Capote": "truman capote"
    },
    {
        " novella": "breakfast at tiffanys"
    },
    {
        " of the same name. Capote disapproved of many changes that were made to sanitise the story for the film adaptation, and would have preferred ": null
    },
    {
        "Marilyn Monroe": "marilyn monroe"
    },
    {
        " to have been cast in the role, although he also stated that Hepburn did a terrific job . The character is considered one of the best-known in ": null
    },
    {
        "American cinema": "cinema of the united states"
    },
    {
        ", and a defining role for Hepburn.  The ": null
    },
    {
        "dress she wears during the opening credits": "little black givenchy dress of audrey hepburn"
    },
    {
        " has been considered an icon of the twentieth century, and perhaps the most famous little black dress of all time.     Hepburn stated that the role was the jazziest of my career Kane, Chris. , Screen Stories, December 42 yet admitted: Im an introvert. Playing the extroverted girl was the hardest thing I ever did. Archer, Eugene. , The New York Times, 42 November 42 She was nominated for an Academy Award for Best Actress for her performance.      The same year, Hepburn also starred in William Wylers drama  The Childrens Hour  , in which she and ": null
    },
    {
        "Shirley MacLaine": "shirley maclaine"
    },
    {
        " played teachers whose lives become troubled after two pupils accuse them of being lesbians.   Bosley Crowther of The New York Times was of the opinion that the film is not too well acted , with the exception of Hepburn, who gives the impression of being sensitive and pure of its muted theme . Variety magazine also complimented Hepburns soft sensitivity, marvelous projection and emotional understatement , adding that Hepburn and MacLaine beautifully complement each other .        Hepburn next appeared opposite ": null
    },
    {
        "Cary Grant": "cary grant"
    },
    {
        " in the comic thriller  Charade  , playing a young widow pursued by several men who chase the fortune stolen by her murdered husband. The 42-year-old Grant, who had previously withdrawn from the starring male lead roles in Roman Holiday and Sabrina, was sensitive about his age difference with 42-year-old Hepburn, and was uncomfortable about the romantic interplay. To satisfy his concerns, the filmmakers agreed to alter the screenplay so that Hepburns character was pursuing him. The film turned out to be a positive experience for him; he said, All I want for Christmas is another picture with Audrey Hepburn. , Motion Picture, May 42 The role earned Hepburn her third, and final, competitive BAFTA Award, and another Golden Globe nomination. Critic Bosley Crowther was less kind to her performance, stating that, Hepburn is cheerfully committed to a mood of how-nuts-can-you-be in an obviously comforting assortment of expensive ": null
    },
    {
        "Givenchy": "givenchy"
    },
    {
        " costumes.      Hepburn reunited with her Sabrina co-star ": null
    },
    {
        "William Holden": "william holden"
    },
    {
        " in  Paris When It Sizzles  , a ": null
    },
    {
        "screwball comedy": "screwball comedy film"
    },
    {
        " in which she played the young assistant of a Hollywood screenwriter, who aids his ": null
    },
    {
        "writers block": "writers block"
    },
    {
        " by acting out his fantasies of possible plots. Its production was troubled by several problems. Holden unsuccessfully tried to rekindle a romance with the now-married Hepburn, and his alcoholism was beginning to affect his work. After ": null
    },
    {
        "principal photography": "principal photography"
    },
    {
        " began, she demanded the dismissal of cinematographer ": null
    },
    {
        "Claude Renoir": "claude renoir"
    },
    {
        " after seeing what she felt were unflattering ": null
    },
    {
        "dailies": "dailies"
    },
    {
        ". Superstitious, she also insisted on dressing room 42 because that was her lucky number and required that ": null
    },
    {
        "Hubert de Givenchy": "hubert de givenchy"
    },
    {
        ", her long-time designer, be given a credit in the film for her perfume. Dubbed ": null
    },
    {
        "marshmallow": "marshmallow"
    },
    {
        "-weight hokum by Variety upon its release in April,  the film was uniformly panned  but critics were kinder to Hepburns performance, describing her as a refreshingly individual creature in an era of the exaggerated curve .      Hepburns second film released in 42 was ": null
    },
    {
        "George Cukor": "george cukor"
    },
    {
        "s ": null
    },
    {
        "film adaptation of the stage musical My Fair Lady": "my fair lady"
    },
    {
        ", which premiered in October.  Soundstage wrote that not since  Gone with the Wind  has a motion picture created such universal excitement as My Fair Lady , Ringgold, Gene. ,  Soundstage , December 42 although Hepburns casting in the role of ": null
    },
    {
        "Cockney": "cockney"
    },
    {
        " flower girl ": null
    },
    {
        "Eliza Doolittle": "eliza doolittle"
    },
    {
        " was a source of dispute. ": null
    },
    {
        "Julie Andrews": "julie andrews"
    },
    {
        ", who had originated the role on stage, was not offered the part because producer ": null
    },
    {
        "Jack L. Warner": "jack l. warner"
    },
    {
        " thought Hepburn was a more bankable proposition. Hepburn initially asked Warner to give the role to Andrews but was eventually cast. Further friction was created when, although non-singer Hepburn had sung in Funny Face and had lengthy vocal preparation for the role in My Fair Lady, her vocals were dubbed by ": null
    },
    {
        "Marni Nixon": "marni nixon"
    },
    {
        ", whose voice was considered more suitable to the role.   Hepburn was initially upset and walked off the set when informed.     Critics applauded Hepburns performance. Crowther wrote that, The happiest thing about My Fair Lady is that Audrey Hepburn superbly justifies the decision of Jack Warner to get her to play the title role. Gene Ringgold of Soundstage also commented that, Audrey Hepburn is magnificent. She is Eliza for the ages , while adding, Everyone agreed that if Julie Andrews was not to be in the film, Audrey Hepburn was the perfect choice. The reviewer in  Time  magazine said her graceful, glamorous performance was the best of her career . ": null
    }
]