[
    {
        "   Friedrich August Gottreu Tholuck , known as August Tholuck, was a ": null
    },
    {
        "German": "germany"
    },
    {
        " Protestant": "protestant"
    },
    {
        " theologian and church leader.       Tholuck was born at ": null
    },
    {
        "Breslau": "breslau"
    },
    {
        ", and educated at the ": null
    },
    {
        "gymnasium": "gymnasium"
    },
    {
        " and university there. He distinguished himself by his ability to learn languages. A love of Oriental languages and literature led him to exchange the ": null
    },
    {
        "University of Breslau": "university of breslau"
    },
    {
        " for that of ": null
    },
    {
        "Berlin": "university of berlin"
    },
    {
        ", in order to study to greater advantage, and there he was received into the house of the Orientalist ": null
    },
    {
        "Heinrich Friedrich von Diez": "heinrich friedrich von diez"
    },
    {
        " . He was introduced to ": null
    },
    {
        "pietist": "pietist"
    },
    {
        "ic circles in Berlin, and came under the influence of Baron ": null
    },
    {
        "Hans Ernst von Kottwitz": "hans ernst von kottwitz"
    },
    {
        ", who became his spiritual father, and of the historian ": null
    },
    {
        "Neander": "johann august wilhelm neander"
    },
    {
        ". Before deciding on the career of theological professor, he had in view that of a ": null
    },
    {
        "missionary": "missionary"
    },
    {
        " in the East. Meanwhile, he was feeling the influence to a certain degree of the romantic school, and of ": null
    },
    {
        "Schleiermacher": "friedrich daniel ernst schleiermacher"
    },
    {
        " and ": null
    },
    {
        "G. W. F. Hegel": "georg wilhelm friedrich hegel"
    },
    {
        " too, though he never sounded the depths of their systems.     At length, in his twenty-first year, he finally decided to adopt the academical calling. In 42 he was  Privatdozent  and in 42 became professor extraordinarius of ": null
    },
    {
        "theology": "theology"
    },
    {
        " in Berlin, though he was at the same time active in the work of home and foreign missions. He lectured on the ": null
    },
    {
        "Old": "old testament"
    },
    {
        " and ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        "s, theology, ": null
    },
    {
        "apologetics": "apologetics"
    },
    {
        " and the history of the church in the 42th century. In 42 appeared his first work, Sufismus, sive theosophia Persarum pantheistica; following the same line of study he published Blütensammlung aus der morgenlandischen Mystik and Speculative Trinitätslehre des späteren Orients . His well-known essay on the nature and moral influence of heathenism was published by Neander, with high commendation, in his Denkwürdigkeiten; and his Commentary on the Epistle to the Romans secured him a foremost place amongst the most suggestive, if not the most accurate, Biblical interpreters of that time.     Another work, soon translated into all the principal European languages, Die wahre Weihe des Zweiflers , the outcome of his own religious history, obtained for him the permanent position of the modern ": null
    },
    {
        "Pietistic": "pietistic"
    },
    {
        " apologist of ": null
    },
    {
        "Evangelical Christianity": "evangelical christianity"
    },
    {
        ". In 42 with the aid of the ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n government, he visited the libraries of England and the Netherlands, and on his return was appointed professor ordinarius of theology at the ": null
    },
    {
        "University of Halle": "university of halle"
    },
    {
        ", the centre of German ": null
    },
    {
        "rationalism": "rationalism"
    },
    {
        ", where he afterwards became preacher and member of the supreme ": null
    },
    {
        "consistorial": "consistory"
    },
    {
        " council of the ": null
    },
    {
        "Evangelical State Church in Prussia": "evangelical state church in prussia"
    },
    {
        ". Here he made it his aim to combine in a higher unity the learning and to some extent the rationalism of ": null
    },
    {
        "Johann Salomo Semler": "johann salomo semler"
    },
    {
        " with the devout and active pietism of ": null
    },
    {
        "A H Francke": "august hermann francke"
    },
    {
        "; and, in spite of the opposition of the theological faculty of the university, he succeeded in changing the character of its theology.     This he achieved partly by his lectures, but above all by his personal influence on the students, and, after 42 by his preaching. His theological position was ": null
    },
    {
        "orthodox": "orthodoxy"
    },
    {
        ", but laid more stress upon Christian experience than upon rigid ": null
    },
    {
        "dogma": "dogma"
    },
    {
        "tic belief. On the two great questions of miracles and inspiration he made great concessions to modern criticism and philosophy. His lifelong battle was on behalf of personal religious experience, in opposition to the externality of rationalism, orthodoxy or ": null
    },
    {
        "sacramentarianism": "sacramentarianism"
    },
    {
        ". ": null
    },
    {
        "Karl Schwarz": "karl schwarz"
    },
    {
        " happily remarks that, as the English apologists of the 42th century were themselves infected with the poison of the deists whom they endeavoured to refute, so Tholuck absorbed some of the heresies of the rationalists whom he tried to overthrow. He was also one of the prominent members of the ": null
    },
    {
        "Evangelical Alliance": "evangelische allianz"
    },
    {
        ", and few men were more widely known or more beloved throughout the Protestant churches of Europe and America than him. He died at ": null
    },
    {
        "Halle": "halle"
    },
    {
        ". As a preacher, Tholuck ranked among the foremost of his time. As a teacher, he showed remarkable sympathy and won great success. As a thinker he can hardly be said to have been endowed with great creative power.     After his commentaries  and several volumes of sermons, his best-known books are Stunden christlicher Andacht , intended to take the place of ": null
    },
    {
        "J H D Zschokke": "heinrich zschokke"
    },
    {
        "s standard rationalistic work with the same title, and his reply to ": null
    },
    {
        "David Strauss": "david strauss"
    },
    {
        "s Life of Jesus .     He published at various times valuable contributions towards a history of rationalism--Vorgeschichte des Rationalismus , Geschichte des Rationalismus , and a number of essays connected with the history of theology and especially of apologetics. His views on inspiration were indicated in his work Die Propheten und ihre Weissagungen , in his essay on the Alte Inspirationslehre, in Deutsche Zeitschrift für christliche Wissenschaft , and in his Gespräche über die vornehmsten Glaubensfragen der Zeit .     He also contributed many articles to ": null
    },
    {
        "Herzog": "johann jakob herzog"
    },
    {
        "s  Realencyklopädie , and for several years edited a journal , Literarischer Anzeiger.": null
    }
]