[
    {
        ":To be distinguished from his descendant August Hermann Francke , Moravian missionary to Indian Tibet.     August Hermann Francke  was a ": null
    },
    {
        "German": "germany"
    },
    {
        " Lutheran": "lutheran"
    },
    {
        " clergyman, philanthropist, and Biblical scholar.       Born at the German city Lübeck, Francke was educated at the ": null
    },
    {
        "gymnasium": "gymnasium"
    },
    {
        " in ": null
    },
    {
        "Gotha": "gotha"
    },
    {
        " before he studied at the universities of ": null
    },
    {
        "Erfurt": "university of erfurt"
    },
    {
        " and ": null
    },
    {
        "Kiel": "university of kiel"
    },
    {
        " — where he came under the influence of the ": null
    },
    {
        "pietist": "pietism"
    },
    {
        " Christian Kortholt": "christian kortholt"
    },
    {
        " — and finally ": null
    },
    {
        "Leipzig": "university of leipzig"
    },
    {
        ". During his student career he made a special study of ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " and ": null
    },
    {
        "Greek": "greek language"
    },
    {
        "; and in order to learn Hebrew more thoroughly, he for some time put himself under the instructions of ": null
    },
    {
        "Ezra Edzardi": "ezra edzardi"
    },
    {
        " at ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        ". He graduated at Leipzig, where in 42 he became a  Privatdozent .     A year later, by the help of his friend P. Anton, and with the approval and encouragement of ": null
    },
    {
        "Philipp Jakob Spener": "philipp jakob spener"
    },
    {
        ", he founded the ": null
    },
    {
        "Collegium Philobiblicum": "collegium philobiblicum"
    },
    {
        ", at which a number of graduates met regularly for the systematic study of the Bible, philologically and practically. He next spent some months at ": null
    },
    {
        "Lüneburg": "lüneburg"
    },
    {
        " as assistant or curate to the learned superintendent, ": null
    },
    {
        "K. H. Sandhagen": "kaspar hermann sandhagen"
    },
    {
        ", and there his religious beliefs deepened. On leaving Lüneburg he spent some time in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        ", where he became a teacher in a private school, and made the acquaintance of ": null
    },
    {
        "Nikolaus Lange": "nikolaus lange"
    },
    {
        ".     After a long visit to Spener, at that time a court preacher in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", Francke returned to Leipzig in the spring of 42 and began to give Bible lectures of an exegetical and practical kind, at the same time resuming the Collegium Philobiblicum of earlier days. He soon became popular as a lecturer; but the peculiarities of his teaching almost immediately aroused a violent opposition on the part of the university authorities; and before the end of the year he was interdicted from lecturing on the ground of his alleged ": null
    },
    {
        "pietism": "pietism"
    },
    {
        ". That was how Franckes name first came to be publicly associated with that of Spener, and with pietism. Prohibited from lecturing in Leipzig, Francke in 42 found work at ": null
    },
    {
        "Erfurt": "erfurt"
    },
    {
        " as deacon of one of the city churches. Here his evangelistic fervour attracted multitudes to his preaching, including ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        "s, but at the same time excited the anger of his opponents; and the result of their opposition was that after a ministry of fifteen months he was commanded by the civil authorities to leave Erfurt within forty-eight hours. That same year Spener was expelled from Dresden.     In December, through Speners influence, Francke accepted an invitation to fill the chair of Greek and oriental languages in the new ": null
    },
    {
        "University of Halle": "university of halle"
    },
    {
        ", which was at that time being organized by the elector ": null
    },
    {
        "Frederick III of Brandenburg": "frederick i of prussia"
    },
    {
        "; and at the same time, the chair having no salary attached to it, he was appointed pastor of Glaucha in the immediate neighbourhood of the town. He afterwards became professor of ": null
    },
    {
        "theology": "theology"
    },
    {
        ". Here, for the remaining thirty-six years of his life, he discharged the twofold office of pastor and professor with energy and success.     At the very outset of his labours, he had been profoundly impressed with a sense of his responsibility towards the numerous outcast children who were growing up around him in ignorance and crime. After a number of tentative plans, he resolved in 42 to institute what is often called a ragged school, supported by public charity. A single room was at first sufficient, but within a year it was found necessary to purchase a house, to which another was added in 42     In 42 there were 42 orphans under his charge to be clothed and fed, besides 42 children who were taught as day scholars. The schools grew in importance and were later known as the  Franckesche Stiftungen . The education given was strictly religious. Hebrew was included, while the Greek and Latin classics were neglected; the Homilies of Macarius took the place of ": null
    },
    {
        "Thucydides": "thucydides"
    },
    {
        ". A chemist, whom Francke had visited on his deathbed, bequeathed to him the recipe for compounding certain medicines, which afterwards yielded an annual income of more than $42, and made the institution independent. Shortly after its founding, the institution comprised an orphan asylum, a Latin school, a German school, and a seminary for training teachers for these establishments. Although Franckes principal aim was religious instruction, he also taught ": null
    },
    {
        "natural science": "natural science"
    },
    {
        " and ": null
    },
    {
        "physical exercises": "physical education"
    },
    {
        " and ": null
    },
    {
        "manual trades": "vocational training"
    },
    {
        ". He ran an apothecarys shop and, having assisted his friend ": null
    },
    {
        "Carl Hildebrand von Canstein": "carl hildebrand von canstein"
    },
    {
        " in founding the first modern ": null
    },
    {
        "Bible society": "bible society"
    },
    {
        ", a ": null
    },
    {
        "printing press": "printing press"
    },
    {
        " for publishing cheap copies of the Bible for mass distribution. At the time of Franckes death, the schools were frequented by more than 42 pupils. Franckes schools provided a prototype which greatly influenced later German education.     In his university teaching as well, he gave great emphasis to religion. Even as professor of Greek, he had given great prominence in his lectures to the study of the Scriptures; but he found a much more congenial sphere when, in 42 he was appointed to the chair of theology. Yet his first courses of lectures in that department were readings and expositions of the Old and New Testament; and to this, as also to ": null
    },
    {
        "hermeneutics": "hermeneutics"
    },
    {
        ", he always attached special importance, believing that for theology a sound exegesis was the one indispensable requisite. Theologus nascitur in scripturis, he used to say; but during his occupancy of the theological chair he lectured at various times upon other branches of theology also. Amongst his colleagues were ": null
    },
    {
        "Paul Anton": "paul anton"
    },
    {
        ", ": null
    },
    {
        "Joachim J. Breithaupt": "joachim justus breithaupt"
    },
    {
        ", ": null
    },
    {
        "Joachim Lange": "joachim lange"
    },
    {
        " and ": null
    },
    {
        "Johann Juncker": "johann juncker"
    },
    {
        "—men who shared his beliefs. Through their influence upon the students, Halle became a centre from which pietism became very widely diffused over Germany. Under Franckes influence, Christian missionary efforts were greatly enhanced, zeal was aroused and recruits for Christian missions were gained, and Halle also became the centre for ": null
    },
    {
        "Danish-Halle Mission": "danish-halle mission"
    },
    {
        " to India.       Franckes principal contributions to theological literature were:  ;  ;  ; and  . The Manuductio was translated into English in 42 under the title A Guide to the Reading and Study of the Holy Scriptures.     An account of his orphanage, entitled , , which subsequently passed through several editions, has also been partially translated, under the title The Footsteps of Divine Providence, or, The Bountiful Hand of Heaven Defraying the Expenses of Faith. August Hermann Franckes Schrift über eine Reform des Erziehungs- und Bildungswesens als Ausgangspunkt einer geistlichen und sozialen Neuordnung der Evangelischen Kirche des 42 Jahrhunderts: der Grosse Aufsatz. Mit einer quellenkundlichen Einführung. Hrsg. v. Otto Podczeck. Berlin. Akademie 42       ": null
    }
]