[
    {
        "Autosegmental phonology is a framework of phonological analysis proposed by ": null
    },
    {
        "John Goldsmith": "john goldsmith"
    },
    {
        " in his ": null
    },
    {
        "PhD thesis": "phd thesis"
    },
    {
        " in 42 at the ": null
    },
    {
        "Massachusetts Institute of Technology": "massachusetts institute of technology"
    },
    {
        "   .     As a theory of phonological representation, autosegmental ": null
    },
    {
        "phonology": "phonology"
    },
    {
        " developed a formal account of ideas that had been sketched in earlier work by several linguists, notably ": null
    },
    {
        "Bernard Bloch": "bernard bloch"
    },
    {
        " , ": null
    },
    {
        "Charles Hockett": "charles hockett"
    },
    {
        " and ": null
    },
    {
        "J. R. Firth": "j. r. firth"
    },
    {
        " . On such a view, phonological representations consist of more than one ": null
    },
    {
        "linear sequence of segments": "distinctive feature"
    },
    {
        "; each linear sequence constitutes a separate tier. The co-registration of elements  on one tier with those on another is represented by association lines. There is a close relationship between analysis of segments into ": null
    },
    {
        "distinctive features": "distinctive features"
    },
    {
        " and an autosegmental analysis; each feature in a language appears on exactly one tier.     The working hypothesis of autosegmental analysis is that a large part of phonological generalizations can be interpreted as a restructuring or reorganization of the autosegments in a representation. Clear examples of the usefulness of autosegmental analysis came in early work from the detailed study of African ": null
    },
    {
        "tone languages": "tone languages"
    },
    {
        ", as well as the study of vowel and nasal harmony systems. A few years later, ": null
    },
    {
        "John McCarthy": "john mccarthy"
    },
    {
        " proposed an important development by showing that the derivation of words from ": null
    },
    {
        "consonantal roots": "semitic root"
    },
    {
        " in ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        " could be analyzed autosegmentally.     In the first decade of the development of the theory, ": null
    },
    {
        "G. N. Clements": "nick clements"
    },
    {
        " developed a number of influential aspects of the theory involving harmonic processes, especially ": null
    },
    {
        "vowel harmony": "vowel harmony"
    },
    {
        " and nasal harmony, and John McCarthy generalized the theory to deal with the conjugational system of ": null
    },
    {
        "classical Arabic": "classical arabic"
    },
    {
        ", on the basis of an autosegmental account of vowel and consonant slots on a central timing tier .       The autosegmental formalism departs from the depiction of segments as matrices of features in order to show segments as connected groups of individual features. Segments are depicted through vertical listings of features connected by lines. These sets can also underspecify in order to indicate a class rather than a single segment. Environments can be shown by placing other connected sets of features around that which is the focus of the rule. Feature changes are shown by striking through the lines that connect a feature that is lost to the rest of the segment and drawing dotted lines to features that are gained.               Rather than classify segments using the categories given in the ": null
    },
    {
        "International Phonetic Alphabet": "international phonetic alphabet"
    },
    {
        ", the autosegmental formalism makes use of distinctive features, which provide greater granularity and make identification of ": null
    },
    {
        "natural classes": "natural classes"
    },
    {
        " easier. A segment is identified by a +/− dichotomy of a series of binary features, some of which are subfeatures of unary features . For example, the voiceless bilabial stop, is indicated and the set of voiced coronal stops can be indicated          For unary features to be fully specified, it is necessary to include binary subfeatures that correspond to them. In the autosegmental formalism, this is depicted by placing the binary subfeature at a horizontal offset from the unary feature and connecting them with a line. The next top-level feature in the segment would then be connected to the unary feature as well as opposed to the tone.       There are situations in which the rule applies not to a particular value of a feature, but to whatever value the feature has. In these situations, it is necessary to include the presence of the feature, but not to specify its value. This can be done by including a placeholder feature composed of ellipses, with an indication of the type of feature. For example, a generic place feature can be indicated P .       The autosegmental formalism deals with several separate linear sequences; because of this, a phonological representation is depicted on several distinct tiers. Each of these tiers shows a different language feature.       The autosegmental tier contains the features that define the ": null
    },
    {
        "segments": "segment"
    },
    {
        " articulated in the phonological representation. The descriptions given in the previous section deal with the segmental tier. In the segmental tier, features are assigned to segments.       The timing tier contains timing units that define the ": null
    },
    {
        "lengths": "length"
    },
    {
        " of segments in the phonological representation. These timing units are commonly depicted as Xs, and are assigned to segments.       The stress tier contains the features that show the distribution of ": null
    },
    {
        "stress": "stress"
    },
    {
        " in the phonological representation. The features in the stress tier are and and they are assigned to the stress-bearing units of the language .       The tone tier contains the features that show the distribution of ": null
    },
    {
        "tones": "tone"
    },
    {
        " in the phonological representation. The features in the tone tier are and and they are assigned to the tone-bearing units of the language .       As a theory of the dynamic of phonological representations, autosegmental phonology includes a Well-formedness Condition on association lines plus an instruction as to what to do in case of a violation of the Well-formedness Condition: add or delete the minimum number of association lines in order to maximally satisfy it. Many of the most interesting predictions of the autosegmental model derive from the automatic effects of the Well-formedness Condition and their independence of language-particular rules.              The autosegmental formalism can be especially useful in describing assimilation rules. Using it for such rules makes the relationship between the result of the rule and the environment obvious. It also makes it possible to concisely describe rules that apply to different environments in different ways.     The phenomenon whereby /ɪn/ goes to in such words as and , in such words as and , and in such words as and can be represented in the autosegmental formalism. The rule is that a coronal nasal will assimilate to the place of the following consonant. The nasal is depicted by connected to a P , and the consonant is depicted to the nasals right as P . No more specification is necessary because place is the only feature of the following segment that factors into the rule. The assimilation is shown by striking through the line to P on the left and drawing a dotted line to the P on the right.       ": null
    },
    {
        "Bloch, Bernard": "bernard bloch"
    },
    {
        ", 42 A set of postulates for phonemic analysis. Language 42   ": null
    },
    {
        "Clements, G. N": "nick clements"
    },
    {
        ". 42 Vowel harmony in nonlinear generative phonology: an autosegmental model. Indiana University Linguistics Club.   ": null
    },
    {
        "Firth, J.R.": "john rupert firth"
    },
    {
        " 42 Sounds and Prosodies Transactions of the Philological Society, pp 42–42   ": null
    },
    {
        "Goldsmith, John": "john goldsmith"
    },
    {
        ". 42 Autosegmental and metrical phonology. Basil Blackwell.   ": null
    },
    {
        "Hayes, B.": "bruce hayes"
    },
    {
        " 42 Introductory Phonology. Malden: Blackwell, ch. 4242   ": null
    },
    {
        "Hockett, Charles": "charles f. hockett"
    },
    {
        ". 42 A manual of phonology. Indiana University Publications in Anthropology and Linguistics 42   ": null
    },
    {
        "McCarthy, John": "john mccarthy"
    },
    {
        ". 42 A prosodic theory of non-concatenative morphology. Linguistic Inquiry 42: 4242  Disentangling Autosegments from Prosodies: A Note on the Misrepresentation of a Research Tradition in Phonology.  & _ & ERICExtSearch_SearchValue_42EJ42 & ERICExtSearch_SearchType_42no & accnoEJ42   Roca, I. and Johnson, W. 42 A course in phonology. Wiley-Blackwell, pp.  42–42        by John Goldsmith              ": null
    }
]