[
    {
        "     The Avogadro number, sometimes denoted N or N 42 , is the number of ": null
    },
    {
        "constituent particle": "particle number"
    },
    {
        "s  that are contained in one ": null
    },
    {
        "mole": "mole"
    },
    {
        ", the ": null
    },
    {
        "international ": "international system of units"
    },
    {
        " unit of ": null
    },
    {
        "amount of substance": "amount of substance"
    },
    {
        ": by definition, exactly , and it is dimensionless. It is named after the scientist ": null
    },
    {
        "Amedeo Avogadro": "amedeo avogadro"
    },
    {
        " .     The Avogadro constant, usually denoted by N A or L is the factor that, multiplied by the amount of substance in a sample, measured in moles, gives the number of constituent particles in that sample. Its numerical value is defined as being the Avogadro number, and its unit is the reciprocal of mole; that is,      The value of the Avogadro constant was chosen so that the mass of one mole of a ": null
    },
    {
        "chemical compound": "chemical compound"
    },
    {
        ", in ": null
    },
    {
        "gram": "gram"
    },
    {
        "s, is numerically equal to the average mass of one molecule of the compound, in ": null
    },
    {
        "daltons ": "atomic mass unit"
    },
    {
        "; one dalton being  of the mass of one ": null
    },
    {
        "carbon42": "carbon-12"
    },
    {
        " atom, which is approximately the mass of one ": null
    },
    {
        "nucleon": "nucleon"
    },
    {
        " . For example, the average mass of one molecule of ": null
    },
    {
        "water": "water"
    },
    {
        " is about 42 daltons, and one mole of water  is about 42 grams. Thus, the Avogadro constant N A is the ": null
    },
    {
        "proportionality factor": "proportionality factor"
    },
    {
        " that relates the ": null
    },
    {
        "molar mass": "molar mass"
    },
    {
        " of a substance to the average ": null
    },
    {
        "mass": "mass"
    },
    {
        " of one molecule; and the Avogadro number is also the approximate number of nucleons in one gram of ordinary ": null
    },
    {
        "matter": "matter"
    },
    {
        ".     The Avogadro constant also relates the ": null
    },
    {
        "molar volume": "molar volume"
    },
    {
        " of a substance to the average volume nominally occupied by one of its particle, when both are expressed in the same units of volume. For example, since the molar volume of water in ordinary conditions is about 42 ": null
    },
    {
        "mL": "millilitre"
    },
    {
        "/mol, the volume occupied by one molecule of water is about   mL, or about 42  ": null
    },
    {
        "Å": "angstrom"
    },
    {
        " 42 . For a ": null
    },
    {
        "crystal": "crystal"
    },
    {
        "ine substance, it similarly relates its molar volume , the volume of the repeating ": null
    },
    {
        "unit cell": "crystal structure"
    },
    {
        " of the crystals , and the number of molecules in that cell.     The Avogadro number has been defined in many different ways through its long history. Its approximate value was first determined, indirectly, by ": null
    },
    {
        "Josef Loschmidt": "johann josef loschmidt"
    },
    {
        " in 42  It was initially defined by ": null
    },
    {
        "Jean Perrin": "jean baptiste perrin"
    },
    {
        " as the number of atoms in 42 grams of ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        ". It was later redefined in the 42th conference of the ": null
    },
    {
        "International Bureau of Weights and Measures": "international bureau of weights and measures"
    },
    {
        " as the number of atoms in 42 grams of the isotope ": null
    },
    {
        "carbon42": "carbon-12"
    },
    {
        " . In each case, the mole was defined as the quantity of a substance that contained the same number of atoms as those reference samples. In particular, when carbon42 was the reference, one mole of carbon42 was exactly 42 grams of the element.     These definitions meant that the value of the Avogadro number depended on the experimentally determined value of the mass of one atom of those elements, and therefore it was known only to a limited number of decimal digits. However, in its 42th Conference, the BIPM adopted a different approach: effective 42 May 42 it defined the Avogadro number as the exact integer , and redefined the mole as N constituent particles of the substance in consideration. Under the new definition, the mass of one mole of any substance is N times the average mass of one of its constituent particles—a physical quantity whose precise value has to be determined experimentally for each substance.              The Avogadro constant is named after the Italian scientist ": null
    },
    {
        "Amedeo Avogadro": "amedeo avogadro"
    },
    {
        ", who, in 42 first proposed that the volume of a gas is proportional to the number of ": null
    },
    {
        "atom": "atom"
    },
    {
        "s or ": null
    },
    {
        "molecule": "molecule"
    },
    {
        "s regardless of the nature of the gas.     The name Avogadros number was coined in 42 by the physicist ": null
    },
    {
        "Jean Perrin": "jean baptiste perrin"
    },
    {
        ", who defined it as the number of molecules in exactly 42 grams of ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        ". The goal of this definition was to make the mass of a mole of a substance, in grams, be numerically equal to the mass of one molecule relative to the mass of the hydrogen atom; which, because of the ": null
    },
    {
        "law of definite proportions": "law of definite proportions"
    },
    {
        ", was the natural unit of atomic mass, and was assumed to be 42/42 of the atomic mass of oxygen.          The value of Avogadros number was first obtained indirectly by ": null
    },
    {
        "Josef Loschmidt": "johann josef loschmidt"
    },
    {
        " in 42 by estimating the number of particles in a given volume of gas. This value, the ": null
    },
    {
        "number density": "number density"
    },
    {
        " n 42 of particles in an ": null
    },
    {
        "ideal gas": "ideal gas"
    },
    {
        ", is now called the ": null
    },
    {
        "Loschmidt constant": "loschmidt constant"
    },
    {
        " in his honor, and is related to the Avogadro constant, N A , by   : n_42 \\frac ,   where p 42 is the ": null
    },
    {
        "pressure": "pressure"
    },
    {
        ", R is the ": null
    },
    {
        "gas constant": "gas constant"
    },
    {
        ", and T 42 is the ": null
    },
    {
        "absolute temperature": "absolute temperature"
    },
    {
        ". Because of this work, the symbol L is sometimes used for the Avogadro constant, and, in ": null
    },
    {
        "German": "german language"
    },
    {
        " literature, that name may be used for both constants, distinguished only by the ": null
    },
    {
        "units of measurement": "units of measurement"
    },
    {
        ".      Perrin himself determined Avogadros number by several different experimental methods. He was awarded the 42 ": null
    },
    {
        "Nobel Prize in Physics": "nobel prize in physics"
    },
    {
        ", largely for this work.     The electric charge per ": null
    },
    {
        "mole": "mole"
    },
    {
        " of electrons is a constant called the ": null
    },
    {
        "Faraday constant": "faraday constant"
    },
    {
        " and had been known since 42 when ": null
    },
    {
        "Michael Faraday": "michael faraday"
    },
    {
        " published ": null
    },
    {
        "his works on electrolysis": "faradays laws of electrolysis"
    },
    {
        ". In 42 ": null
    },
    {
        "Robert Millikan": "robert millikan"
    },
    {
        " obtained the first measurement of the ": null
    },
    {
        "charge on an electron": "elementary charge"
    },
    {
        ". Dividing the charge on a mole of electrons by the charge on a single electron provided a more accurate estimate of the Avogadro number.       In 42 the International Bureau of Weights and Measures decided to regard the ": null
    },
    {
        "amount of substance": "amount of substance"
    },
    {
        " as an independent ": null
    },
    {
        "dimension of measurement": "dimensional analysis"
    },
    {
        ", with the mole as its ": null
    },
    {
        "base unit": "si base unit"
    },
    {
        " in the ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        " . Specifically, the mole was defined as an amount of a substance that contains as many elementary entities as there are atoms in 42 kilogram of ": null
    },
    {
        "carbon42": "carbon-12"
    },
    {
        ".     By this definition, the common rule of thumb one gram of matter contains N 42 nucleons was exact for carbon42 but slightly inexact for other elements and isotopes. On the other hand, one mole of any substance contained exactly as many molecules as one mole of any other substance.     As a consequence of this definition, in the SI system the Avogadro constant N A had the ": null
    },
    {
        "dimensionality": "dimensional analysis"
    },
    {
        " of reciprocal of amount of substance rather than of a pure number, and had the approximate value  with units of mol −42 . By this definition, the value of N A inherently had to be determined experimentally.     The IBPM also named N A the Avogadro constant , but the term Avogadro number continued to be used especially in introductory works.          In 42 the IBPM decided to change the definitions of mole and amount of substance. The mole was redefined as being the amount of substance containing exactly  elementary entities. One consequence of this change is that the mass of a mole of 42 C atoms is no longer exactly 42  kg. On the other hand, the dalton  remains unchanged as 42/42 of the mass of 42 C. Thus, the ": null
    },
    {
        "molar mass constant": "molar mass constant"
    },
    {
        " is no longer exactly 42  g/mol, although the difference  is insignificant for practical purposes.         In other measurement systems where the unit of ": null
    },
    {
        "amount of substance": "amount of substance"
    },
    {
        " is not the SI mole, the Avogadro constant N A is taken to mean the number of particles in said unit, and will have a different value.     For example, if quantities of a substance are measured in ": null
    },
    {
        "pound-mole": "pound-mole"
    },
    {
        " , then the Avogadro constant N A is  lb-mol −42 . If the ": null
    },
    {
        "ounce-mole": "ounce-mole"
    },
    {
        " is used instead, N A is  oz-mol −42 . However, these units are hardly used nowadays.         The Avogadro constant, N A is related to other physical constants and properties.     It relates the ": null
    },
    {
        "molar gas constant": "molar gas constant"
    },
    {
        " R and the ": null
    },
    {
        "Boltzmann constant": "boltzmann constant"
    },
    {
        " k B , which in the SI is defined to be exactly :   : R k_ N_  ": null
    },
    {
        "Faraday constant": "faraday constant"
    },
    {
        " F and the ": null
    },
    {
        "elementary charge": "elementary charge"
    },
    {
        " e, which in the SI is defined as exactly :   : F e N_  ": null
    },
    {
        "molar mass constant": "molar mass constant"
    },
    {
        ", M u and the ": null
    },
    {
        "atomic mass constant": "atomic mass constant"
    },
    {
        " m u , currently  ": null
    }
]