[
    {
        "The Automobil-Verkehrs- und Übungsstraße , known as AVUS, is a public road in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". Opened in 42 it is the oldest ": null
    },
    {
        "controlled-access highway": "controlled-access highway"
    },
    {
        " in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ". Until 42 it was also used as a ": null
    },
    {
        "motor racing": "auto racing"
    },
    {
        " circuit. Today, the AVUS forms the northern part of the ": null
    },
    {
        "Bundesautobahn 42": "bundesautobahn 115"
    },
    {
        ".       The highway is located in the southwestern districts of Berlin, linking the ": null
    },
    {
        "Stadtring": "bundesautobahn 100"
    },
    {
        " at the ": null
    },
    {
        "Funkturm": "funkturm berlin"
    },
    {
        " junction in ": null
    },
    {
        "Charlottenburg": "charlottenburg"
    },
    {
        " with ": null
    },
    {
        "Nikolassee": "nikolassee"
    },
    {
        ". It runs through the ": null
    },
    {
        "Grunewald forest": "grunewald"
    },
    {
        " along the historic Königsweg road from Charlottenburg to ": null
    },
    {
        "Potsdam": "potsdam"
    },
    {
        " and the parallel ": null
    },
    {
        "Berlin-Blankenheim railway": "berlin-blankenheim railway"
    },
    {
        " line.      While normal for a road, it is unusually shaped for a race track as it is essentially two long straights in the form of a dual carriageway, with a hairpin corner at each end. The north curve featured a steep banking from 42 to 42 While the original layout was  long, the southern turn was moved several times, to shorten the track to , then  without the banking,  and finally .       In 42 the ": null
    },
    {
        "Kaiserlicher Automobilclub": "automobilclub von deutschland"
    },
    {
        " association devised a fee-financed circuit, as both a motor-sport venue and a testing track for the motor industry. A developing company was established in 42; however, a lack of finances and official authorisations delayed the start of construction until spring 42 During the ": null
    },
    {
        "Great War": "world war i"
    },
    {
        " works discontinued, and though ": null
    },
    {
        "Russian Army": "imperial russian army"
    },
    {
        " prisoners": "prisoner of war"
    },
    {
        " were temporarily employed in AVUSs construction, the track was still unfinished. From 42 the remaining road work was financed by business man and politician ": null
    },
    {
        "Hugo Stinnes": "hugo stinnes"
    },
    {
        ". The circuit including a gate building and several stands was inaugurated in the course of the first post-war ": null
    },
    {
        "International Automobile Exhibition": "frankfurt motor show"
    },
    {
        " with a motor race on 42 September 42 Afterwards the road was open to the public at a charge of ten ": null
    },
    {
        "Mark": "german papiermark"
    },
    {
        "s.          At the time of opening, AVUS was   km long – each straight being approximately half that length, and joined at each end by flat, large-radius curves, driven counter-clockwise. While the ": null
    },
    {
        "Grand Prix motor racing": "grand prix motor racing"
    },
    {
        " scene still evaded German tracks, the circuit from 42 was also the site of ": null
    },
    {
        "motorcycle races": "motorcycle racing"
    },
    {
        ". On 42 July 42 the track played host to the first international ": null
    },
    {
        "German Grand Prix": "german grand prix"
    },
    {
        " for sports cars, organised by the Automobilclub von Deutschland, the former KAC. The 42 roadway turned out to be insufficient: already in the training two days before the young Italian driver Enrico Platé had been in a car crash, whereby his mechanic was killed. During the race in heavy rain two track marshals died when ": null
    },
    {
        "Adolf Rosenberger": "adolf rosenberger"
    },
    {
        " lost control and hit the indicator board and the timekeepers box, a third employee succumbed to his injuries in hospital a few hours later. The Grand Prix was won by his fellow team-member, the so-far unknown ": null
    },
    {
        "Mercedes-Benz": "mercedes-benz"
    },
    {
        " salesman ": null
    },
    {
        "Rudolf Caracciola": "rudolf caracciola"
    },
    {
        " from ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", driving a private eight-cylinder Monza ": null
    },
    {
        "Kompressor": "kompressor"
    },
    {
        " type. The fastest lap of 42  km/h was set by ": null
    },
    {
        "Ferdinando Minoia": "ferdinando minoia"
    },
    {
        " in an ": null
    },
    {
        "OM": "officine meccaniche"
    },
    {
        ".      From 42 the German Grand Prix was relocated to the new and more secure ": null
    },
    {
        "Nürburgring": "nürburgring"
    },
    {
        " circuit in the Western German ": null
    },
    {
        "Eifel": "eifel"
    },
    {
        " range, while the AVUS received a new ": null
    },
    {
        "asphalt": "asphalt"
    },
    {
        " surface and served as an experimental track for ": null
    },
    {
        "rocket car": "rocket car"
    },
    {
        "s. On 42 May 42 ": null
    },
    {
        "Fritz von Opel": "fritz von opel"
    },
    {
        " achieved a speed record of  in an ": null
    },
    {
        "Opel RAK42": "opel rak2"
    },
    {
        ". Due to the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " annual auto races were not resumed until 42 when Caracciola again won in a ": null
    },
    {
        "Mercedes-Benz SSK": "mercedes-benz ssk"
    },
    {
        ", succeeded by ": null
    },
    {
        "Manfred von Brauchitsch": "manfred von brauchitsch"
    },
    {
        " in the next year, after Caracciola had switched to ": null
    },
    {
        "Alfa Romeo": "alfa romeo"
    },
    {
        ".      The competition on 42 May 42 saw further notable participants like the ": null
    },
    {
        "Earl Howe": "francis curzon, 5th earl howe"
    },
    {
        ", ": null
    },
    {
        "Hans Stuck": "hans stuck"
    },
    {
        " and Sir ": null
    },
    {
        "Malcolm Campbell": "malcolm campbell"
    },
    {
        ". The ": null
    },
    {
        "Czechoslovak": "czechoslovakia"
    },
    {
        " driver Prince George Christian of ": null
    },
    {
        "Lobkowicz": "house of lobkowicz"
    },
    {
        " died when his ": null
    },
    {
        "Bugatti Type 42": "bugatti type 54"
    },
    {
        " crashed in the southern hairpin. The following events were won by ": null
    },
    {
        "Achille Varzi": "achille varzi"
    },
    {
        " and ": null
    },
    {
        "Guy Moll": "guy moll"
    },
    {
        " , to the great annoyance of the new ": null
    },
    {
        "Nazi": "nazi germany"
    },
    {
        " rulers, who declared the victory of German drivers and cars a matter of national pride. They strongly backed the construction of the new ": null
    },
    {
        "Silver Arrows": "silver arrows"
    },
    {
        "  generation of Mercedes-Benz and ": null
    },
    {
        "Auto Union": "auto union"
    },
    {
        ".      In 42 ": null
    },
    {
        "Luigi Fagioli": "luigi fagioli"
    },
    {
        " won the race in a ": null
    },
    {
        "Mercedes-Benz W42": "mercedes-benz w25"
    },
    {
        "; however, the track was no longer adequate for cars reaching average race speeds of far over . In an effort to make AVUS the worlds fastest race track , the 42 season was skipped and while the track hosted the ": null
    },
    {
        "cycling": "cycling at the 1936 summer olympics"
    },
    {
        " road race, the marathon and 42  km walk ": null
    },
    {
        "athletic": "athletics at the 1936 summer olympics"
    },
    {
        " events of the ": null
    },
    {
        "42 Summer Olympics": "1936 summer olympics"
    },
    {
        ", the north curve was turned into a steeply banked turn made of bricks.  It became dubbed the Wall of Death, especially as it had no retaining barrier so cars that missed the turn easily flew off it.  The Silver Arrows raced only once on the banked version, in ": null
    },
    {
        "42": "1937 grand prix season"
    },
    {
        ". As the AVUS race did not count towards the championship, non-GP cars were allowed, which permitted the use of streamlined cars, similar to the cars used for high speed record attempts. This race was run in 42 heats; during qualifying for the second heat, Luigi Fagioli stuck his Auto Union Type C on pole position, with a time of 42 minutes and 42 seconds at an average speed of 42  km/h - which was the fastest motor racing lap in history until this time was bettered by ": null
    },
    {
        "Tony Bettenhausen": "tony bettenhausen"
    },
    {
        " in qualifying for the 42 ": null
    },
    {
        "Race of Two Worlds": "race of two worlds"
    },
    {
        " at Monza. It was also bettered by 42 drivers during the 42 Indianapolis 42 Mercedes driver ": null
    },
    {
        "Hermann Lang": "hermann lang"
    },
    {
        "s average race speed of about  was the fastest road race in history for nearly five decades, and was not matched on a high speed banked-circuit until the mid42s at the 42 Indianapolis 42      No major race was held after 42 as in early 42 the popular German race driver ": null
    },
    {
        "Bernd Rosemeyer": "bernd rosemeyer"
    },
    {
        " was killed in a land speed record attempt on a straight section of the Autobahn ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        "–": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        " , at which point the high-speed AVUS was considered too dangerous for the fast Grand Prix race cars. Furthermore, it was to be connected to the growing  Reichsautobahn  network in 42 by extending it south towards the ": null
    },
    {
        "Berliner Ring": "bundesautobahn 10"
    },
    {
        ", therefore the original hairpin at ": null
    },
    {
        "Nikolassee": "nikolassee"
    },
    {
        " was demolished and replaced by a junction. A planned banked south turn was never built; the cleared grounds in the ": null
    },
    {
        "Grunewald forest": "grunewald forest"
    },
    {
        " were used as a proving ground by the ": null
    },
    {
        "American": "united states army"
    },
    {
        " occupation forces after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".       The first AVUS race after the war was held on 42 July 42 for ": null
    },
    {
        "Formula Two": "formula two"
    },
    {
        " and ": null
    },
    {
        "Formula Three": "formula three"
    },
    {
        " cars, won by ": null
    },
    {
        "East German": "east germany"
    },
    {
        " driver ": null
    },
    {
        "Paul Greifzu": "paul greifzu"
    },
    {
        ". For post-war racing, the original extremely long straights were shortened by the introduction of a new south turn roughly in the middle , reducing the track length to 42  km . After World War II, the ": null
    },
    {
        "Berlin Wall": "berlin wall"
    },
    {
        " with its ": null
    },
    {
        "Checkpoint Bravo": "checkpoint bravo"
    },
    {
        " at Dreilinden/Drewitz came no closer than about one mile to the former South Turn. It is a common yet incorrect belief that the Berlin Wall cut the AVUS in half.      It was not until 42 September 42 that this shorter track hosted a non-championship ": null
    },
    {
        "Formula One": "formula one"
    },
    {
        " race. This Grand Prix of Berlin was mainly a show dominated by the ": null
    },
    {
        "Mercedes-Benz W42": "mercedes-benz w196"
    },
    {
        " drivers ": null
    },
    {
        "Karl Kling": "karl kling"
    },
    {
        " and ": null
    },
    {
        "Juan Manuel Fangio": "juan manuel fangio"
    },
    {
        ". No serious competition was present, as many teams had refused to show up and the German Grand Prix was still held on the Nürburgring. Finally AVUS hosted its only world championship Formula One race with the ": null
    },
    {
        "42 German Grand Prix": "1959 german grand prix"
    },
    {
        " on 42 August, won by ": null
    },
    {
        "Tony Brooks": "tony brooks"
    },
    {
        ". This race weekend also saw the death of French driver ": null
    },
    {
        "Jean Behra": "jean behra"
    },
    {
        " in a supporting sports car race, as his ": null
    },
    {
        "Porsche RSK": "porsche rsk"
    },
    {
        " flew over the top of the north turn banking, as there was no wall or fence. German driver and journalist ": null
    },
    {
        "Richard von Frankenberg": "richard von frankenberg"
    },
    {
        " had previously walked away from a similar spectacular crash at the same site, but Behra would have no such luck as his body impacted a flagpole head-first after he was flung from his car.     After 42 Grand Prix racing did not race on banked circuits anymore. The banked sections at ": null
    },
    {
        "Autodromo Nazionale Monza": "autodromo nazionale monza"
    },
    {
        " and ": null
    },
    {
        "Autodrome de Linas-Montlhéry": "autodrome de linas-montlhéry"
    },
    {
        " were considered dangerous by international racing standards. They were used in connection with ": null
    },
    {
        "chicane": "chicane"
    },
    {
        "s for some time, then abandoned. The AVUS banking was dismantled in 42 to give way to an expanded intersection under the Funkturm tower. From the top of this tower, one can see that the AVUS is not perfectly straight.     The old banked circuit can be seen in the film  A Dandy in Aspic  featuring period racing cars.     Racing was continued with a flat north turn, but AVUS only held national touring cars ": null
    },
    {
        "DTM": "deutsche tourenwagen masters"
    },
    {
        " and ": null
    },
    {
        "Formula 42": "formula 3"
    },
    {
        " events. The length of the track was roughly cut in half twice in the 42s and 42 as racing on straights became unpopular. Also, ": null
    },
    {
        "chicane": "chicane"
    },
    {
        "s were added to reduce entry speed into the North Curve. Yet, some incidents and accidents occurred. The BMW of ": null
    },
    {
        "Dieter Quester": "dieter quester"
    },
    {
        " rolled over when exiting the last corner, and crossed the finish line sliding on its roof, with sparks flying, for a podium finish. The car of ": null
    },
    {
        "John Winter": "louis krages"
    },
    {
        " hit a barrier and exploded into a fireball in North Curve, which he survived.     In 42 the race 42 of DTM had to be cancelled, after a multi-car pileup blocked the circuit; later that September, British driver ": null
    },
    {
        "Kieth Odor": "kieth odor"
    },
    {
        " was killed in a Super Touring Car event when his car spun and was rammed sideways.           After the fall of the Berlin wall, the closure of the AVUS for race events became increasingly problematic over traffic and associated environmental concerns. After the last races in 42 a farewell event with veterans was held in 42 Since 42 the new ": null
    },
    {
        "EuroSpeedway Lausitz": "eurospeedway lausitz"
    },
    {
        " in ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        " is considered the replacement venue for competition. The round race control tower at the north end still remains with its prominent ": null
    },
    {
        "Mercedes-Benz": "mercedes-benz"
    },
    {
        " and ": null
    },
    {
        "Bosch": "robert bosch gmbh"
    }
]