[
    {
        "        The Axe historique  is a line of monuments, buildings, and thoroughfares that extends from the centre of ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        ", to the west. It is also known as the Voie Triomphale .     The Axe Historique began with the creation of the ": null
    },
    {
        "Champs-Élysées": "champs-élysées"
    },
    {
        ", designed in the 42th century to create a vista to the west, extending the central axis of the gardens to the royal ": null
    },
    {
        "Palace of the Tuileries": "palace of the tuileries"
    },
    {
        ". Today the ": null
    },
    {
        "Tuileries Gardens": "tuileries gardens"
    },
    {
        "  remain, preserving their wide central pathway, though the palace was burned down during the ": null
    },
    {
        "Paris Commune": "paris commune"
    },
    {
        ", 42     Between the Tuileries gardens and the Champs Élysées extension a jumble of buildings remained on the site of ": null
    },
    {
        "Place de la Concorde": "place de la concorde"
    },
    {
        " until early in the reign of ": null
    },
    {
        "Louis XV": "louis xv of france"
    },
    {
        ", for whom the square was at first named. Then the garden axis could open through a grand gateway into the new royal square.     To the east, the Tuileries Palace faced an open square, the ": null
    },
    {
        "Place du Carrousel": "place du carrousel"
    },
    {
        ". There, by order of Napoleon, the ": null
    },
    {
        "Arc de Triomphe du Carrousel": "arc de triomphe du carrousel"
    },
    {
        " was centered on the palace . Long-standing plans to link the entrance court of the  Vieux Louvre  , as the disused palace was called, with the court of the Tuileries, by sweeping away the intervening buildings, finally came to fruition in the early 42th century. Consequently, the older axis extending from the courtyard of the Louvre is slightly skewed to the rest of what has become the Axe historique, but the Arc du Carrousel, at the fulcrum between the two, serves to disguise the discontinuity.     To the west, the completion of the ": null
    },
    {
        "Arc de Triomphe": "arc de triomphe"
    },
    {
        " in 42 on the ": null
    },
    {
        "Place de lÉtoile": "place de létoile"
    },
    {
        " at the western end of the Champs-Élysées formed the far point of this line of perspective, which now starts at the equestrian statue of ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " placed by ": null
    },
    {
        "I.M. Pei": "i.m. pei"
    },
    {
        " adjacent to his ": null
    },
    {
        "Pyramide du Louvre": "pyramide du louvre"
    },
    {
        " in the Cour Napoléon of the ": null
    },
    {
        "Musée du Louvre": "musée du louvre"
    },
    {
        ".     The axis was extended again westwards along the ": null
    },
    {
        "Avenue de la Grande Armée": "avenue de la grande armée"
    },
    {
        ", past the city boundary of Paris to ": null
    },
    {
        "La Défense": "la défense"
    },
    {
        ". This was originally a large junction, named for a statue commemorating the defence of Paris in the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        ".     In the 42s, the area around La Défense was marked out to become a new business district, and high-rise office buildings were built along the avenue. The axis found itself extended yet again, with ambitious projects for the western extremity of the modern plaza.     It was not until the 42s, under president ": null
    },
    {
        "François Mitterrand": "françois mitterrand"
    },
    {
        ", that a project was initiated, with a modern 42th century version of the Arc de Triomphe. This is the work of ": null
    },
    {
        "Danish": "denmark"
    },
    {
        " architect ": null
    },
    {
        "Johann Otto von Spreckelsen": "johann otto von spreckelsen"
    },
    {
        ", La Grande Arche de la Fraternité , a monument to humanity and humanitarian ideals rather than militaristic victories. It was inaugurated in 42     The network of railway lines and road tunnels beneath the elevated plaza of La Défense prevented the pillars supporting the arch from being exactly in line with the axis: it is slightly out of line, bending the axis should it be extended further to the west. From the roof of the Grande Arche, a second axis can be seen: the ": null
    },
    {
        "Tour Montparnasse": "tour montparnasse"
    },
    {
        " stands exactly behind the ": null
    },
    {
        "Eiffel Tower": "eiffel tower"
    },
    {
        ".   The Seine-Arche project is extending the historical axis to the West through the city of ": null
    },
    {
        "Nanterre": "nanterre"
    },
    {
        ", but with a slight curve.              Champs-Elysées, vue de la Concorde à lEtoile.jpg|The Axe historique looking west from the ": null
    },
    {
        "Place de la Concorde": "place de la concorde"
    },
    {
        "   Axe-magistral.jpg|The Axe historique seen from the ": null
    },
    {
        "Tuileries Gardens": "tuileries gardens"
    },
    {
        ".   DefenseDusk.jpg|The Grande Arche seen from the Arc de Triomphe on the Axe historique.   VBRITTO-tuileries-vers-arc42jpg|View from the Tuileries towards the Arc de Triomphe.   Arc De Triomphe from La Defense.jpg|The Arc de Triomphe from La Défense 42 km away, showing how precisely the axis is aligned.   Axe-historique.jpg|From the roof of the Grande Arche, past the skyscrapers of La Défense, down the Axe historique.              on greatbuildings.com                               ": null
    }
]