[
    {
        "In ": null
    },
    {
        "axiomatic set theory": "axiomatic set theory"
    },
    {
        " and the branches of ": null
    },
    {
        "logic": "logic"
    },
    {
        ", ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", and ": null
    },
    {
        "computer science": "computer science"
    },
    {
        " that use it, the axiom of extensionality, or axiom of extension, is one of the ": null
    },
    {
        "axiom": "axiom"
    },
    {
        "s of ": null
    },
    {
        "Zermelo–Fraenkel set theory": "zermelo–fraenkel set theory"
    },
    {
        ".       In the ": null
    },
    {
        "formal language": "formal language"
    },
    {
        " of the Zermelo–Fraenkel axioms, the axiom reads:     : \\forall A \\, \\forall B \\,     or in words:   :": null
    },
    {
        "Given any": "given any"
    },
    {
        " set": "set"
    },
    {
        " A and any set B, if for every set X, X is a member of A ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        " X is a member of B, then A is ": null
    },
    {
        "equal": "equal"
    },
    {
        " to B.   :     The converse, \\forall A \\, \\forall B \\, , of this axiom follows from the substitution property of ": null
    },
    {
        "equality": "equality"
    },
    {
        ".       To understand this axiom, note that the clause in parentheses in the symbolic statement above simply states that A and B have precisely the same members.   Thus, what the axiom is really saying is that two sets are equal ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        " they have precisely the same members.   The essence of this is:   :A set is determined uniquely by its members.     The axiom of extensionality can be used with any statement of the form   \\exists A \\, \\forall X \\, ,   where P is any unary ": null
    },
    {
        "predicate": "predicate"
    },
    {
        " that does not mention A, to define a unique set A whose members are precisely the sets satisfying the predicate P .   We can then introduce a new symbol for A ; its in this way that ": null
    },
    {
        "definition": "definition"
    },
    {
        "s in ordinary mathematics ultimately work when their statements are reduced to purely set-theoretic terms.     The axiom of extensionality is generally uncontroversial in set-theoretical foundations of mathematics, and it or an equivalent appears in just about any alternative axiomatisation of set theory.   However, it may require modifications for some purposes, as below.       The axiom given above assumes that equality is a primitive symbol in ": null
    },
    {
        "predicate logic": "predicate logic"
    },
    {
        ".   Some treatments of axiomatic set theory prefer to do without this, and instead treat the above statement not as an axiom but as a definition of equality.   Then it is necessary to include the usual axioms of equality from predicate logic as axioms about this defined symbol. Most of the axioms of equality still follow from the definition; the remaining one is the substitution property,   : \\forall A \\, \\forall B \\, ,   and it becomes this axiom that is referred to as the axiom of extensionality in this context.       An ": null
    },
    {
        "ur-element": "ur-element"
    },
    {
        " is a member of a set that is not itself a set.   In the Zermelo–Fraenkel axioms, there are no ur-elements, but they are included in some alternative axiomatisations of set theory.   Ur-elements can be treated as a different ": null
    },
    {
        "logical type": "logical type"
    },
    {
        " from sets; in this case, B \\in A makes no sense if A is an ur-element, so the axiom of extensionality simply applies only to sets.     Alternatively, in untyped logic, we can require B \\in A to be false whenever A is an ur-element.   In this case, the usual axiom of extensionality would then imply that every ur-element is equal to the ": null
    },
    {
        "empty set": "empty set"
    },
    {
        ".   To avoid this consequence, we can modify the axiom of extensionality to apply only to nonempty sets, so that it reads:     : \\forall A \\, \\forall B \\, .     That is:   :Given any set A and any set B, if A is a nonempty set , then if A and B have precisely the same members, then they are equal.     Yet another alternative in untyped logic is to define A itself to be the only element of A   whenever A is an ur-element. While this approach can serve to preserve the axiom of extensionality, the ": null
    },
    {
        "axiom of regularity": "axiom of regularity"
    }
]