[
    {
        "        An axon , or nerve fiber, is a long, slender projection of a nerve cell, or ": null
    },
    {
        "neuron": "neuron"
    },
    {
        ", in vertebrates, that typically conducts electrical impulses known as ": null
    },
    {
        "action potentials": "action potential"
    },
    {
        "away from the ": null
    },
    {
        "nerve cell body": "soma"
    },
    {
        ". The function of the axon is to transmit information to different neurons, muscles, and glands. In certain ": null
    },
    {
        "sensory neurons": "sensory neuron"
    },
    {
        " , such as those for touch and warmth, the axons are called ": null
    },
    {
        "afferent nerve fibers": "afferent nerve fiber"
    },
    {
        "and the electrical impulse travels along these from the ": null
    },
    {
        "periphery": "peripheral nervous system"
    },
    {
        " to the cell body, and from the cell body to the spinal cord along another branch of the same axon. Axon dysfunction has caused many inherited and acquired neurological disorders which can affect both the peripheral and central neurons. Nerve fibers are ": null
    },
    {
        "classed": "axonclassification"
    },
    {
        " into three types – ": null
    },
    {
        "group A nerve fiber": "group a nerve fiber"
    },
    {
        "s, ": null
    },
    {
        "group B nerve fiber": "group b nerve fiber"
    },
    {
        "s, and ": null
    },
    {
        "group C nerve fiber": "group c nerve fiber"
    },
    {
        "s. Groups A and B are ": null
    },
    {
        "myelin": "myelin"
    },
    {
        "ated, and group C are unmyelinated. These groups include both sensory fibers and motor fibers. Another classification groups only the sensory fibers as Type I, Type II, Type III, and Type IV.     An axon is one of two types of ": null
    },
    {
        "cytoplasm": "cytoplasm"
    },
    {
        "ic protrusions from the cell body of a neuron; the other type is a ": null
    },
    {
        "dendrite": "dendrite"
    },
    {
        ". Axons are distinguished from dendrites by several features, including shape , length , and function . Some types of neurons have no axon and transmit signals from their dendrites. In some species, axons can emanate from dendrites and these are known as axon-carrying dendrites.  No neuron ever has more than one axon; however in invertebrates such as insects or leeches the axon sometimes consists of several regions that function more or less independently of each other.      Axons are covered by a membrane known as an ": null
    },
    {
        "axolemma": "axolemma"
    },
    {
        "; the cytoplasm of an axon is called ": null
    },
    {
        "axoplasm": "axoplasm"
    },
    {
        ". Most axons branch, in some cases very profusely. The end branches of an axon are called ": null
    },
    {
        "telodendria": "axonaxon terminals"
    },
    {
        ". The swollen end of a telodendron is known as the ": null
    },
    {
        "axon terminal": "axon terminal"
    },
    {
        " which joins the dendron or cell body of another neuron forming a synaptic connection. Axons make contact with other cells—usually other neurons but sometimes muscle or gland cells—at junctions called ": null
    },
    {
        "synapse": "synapse"
    },
    {
        "s. In some circumstances, the axon of one neuron may form a synapse with the dendrites of the same neuron, resulting in an ": null
    },
    {
        "autapse": "autapse"
    },
    {
        ". At a synapse, the ": null
    },
    {
        "membrane": "cell membrane"
    },
    {
        " of the axon closely adjoins the membrane of the target cell, and special molecular structures serve to transmit electrical or electrochemical signals across the gap. Some synaptic junctions appear along the length of an axon as it extends—these are called en passant synapses and can be in the hundreds or even the thousands along one axon.  Other synapses appear as terminals at the ends of axonal branches.     A single axon, with all its branches taken together, can ": null
    },
    {
        "innervate": "innervate"
    },
    {
        " multiple parts of the brain and generate thousands of synaptic terminals. A bundle of axons make a ": null
    },
    {
        "nerve tract": "nerve tract"
    },
    {
        " in the ": null
    },
    {
        "central nervous system": "central nervous system"
    },
    {
        ",  and a ": null
    },
    {
        "fascicle": "nerve fascicle"
    },
    {
        " in the ": null
    },
    {
        "peripheral nervous system": "peripheral nervous system"
    },
    {
        ". In ": null
    },
    {
        "placental mammals": "placentalia"
    },
    {
        " the largest ": null
    },
    {
        "white matter": "white matter"
    },
    {
        " tract in the brain is the ": null
    },
    {
        "corpus callosum": "corpus callosum"
    },
    {
        ", formed of some 20 million axons in the ": null
    },
    {
        "human brain": "human brain"
    },
    {
        ".             Axons are the primary transmission lines of the ": null
    },
    {
        "nervous system": "nervous system"
    },
    {
        ", and as bundles they form ": null
    },
    {
        "nerve": "nerve"
    },
    {
        "s. Some axons can extend up to one meter or more while others extend as little as one millimeter. The longest axons in the human body are those of the ": null
    },
    {
        "sciatic nerve": "sciatic nerve"
    },
    {
        ", which run from the base of the ": null
    },
    {
        "spinal cord": "spinal cord"
    },
    {
        " to the big toe of each foot. The diameter of axons is also variable. Most individual axons are microscopic in diameter . The largest mammalian axons can reach a diameter of up to 20  µm. The ": null
    },
    {
        "squid giant axon": "squid giant axon"
    },
    {
        ", which is specialized to conduct signals very rapidly, is close to 1 ": null
    },
    {
        "millimetre": "millimetre"
    },
    {
        " in diameter, the size of a small pencil lead. The numbers of axonal telodendria can also differ from one nerve fiber to the next. Axons in the ": null
    },
    {
        "central nervous system": "central nervous system"
    },
    {
        " typically show multiple telodendria, with many synaptic end points. In comparison, the ": null
    },
    {
        "cerebellar granule cell": "cerebellar granule cell"
    },
    {
        " axon is characterized by a single T-shaped branch node from which two ": null
    },
    {
        "parallel fibers": "parallel fiber"
    },
    {
        "extend. Elaborate branching allows for the simultaneous transmission of messages to a large number of target neurons within a single region of the brain.     There are two types of axons in the ": null
    },
    {
        "nervous system": "nervous system"
    },
    {
        ": ": null
    },
    {
        "myelin": "myelin"
    },
    {
        "ated and ": null
    },
    {
        "unmyelinated": "unmyelinated"
    },
    {
        " axons.  ": null
    },
    {
        "Myelin": "myelin"
    },
    {
        " is a layer of a fatty insulating substance, which is formed by two types of ": null
    },
    {
        "glial cells": "neuroglia"
    },
    {
        "Schwann cells": "schwann cell"
    },
    {
        "and ": null
    },
    {
        "oligodendrocyte": "oligodendrocyte"
    },
    {
        "s. In the ": null
    },
    {
        "peripheral nervous system": "peripheral nervous system"
    },
    {
        " Schwann cells form the myelin sheath of a myelinated axon. In the ": null
    },
    {
        "central nervous system": "central nervous system"
    },
    {
        " oligodendrocytes form the insulating myelin. Along myelinated nerve fibers, gaps in the myelin sheath known as ": null
    },
    {
        "nodes of Ranvier": "myelin sheath gap"
    },
    {
        " occur at evenly spaced intervals. The myelination enables an especially rapid mode of electrical impulse propagation called ": null
    },
    {
        "saltatory conduction": "saltatory conduction"
    },
    {
        ".     The myelinated axons from the ": null
    },
    {
        "cortical neurons": "cerebral cortex"
    },
    {
        " form the bulk of the neural tissue called ": null
    },
    {
        "white matter": "white matter"
    },
    {
        " in the brain. The myelin gives the white appearance to the ": null
    },
    {
        "tissue": "neural tissue"
    },
    {
        " in contrast to the ": null
    },
    {
        "grey matter": "grey matter"
    },
    {
        " of the cerebral cortex which contains the neuronal cell bodies. A similar arrangement is seen in the ": null
    },
    {
        "cerebellum": "cerebellum"
    },
    {
        ". Bundles of myelinated axons make up the ": null
    },
    {
        "nerve tracts": "nerve tract"
    },
    {
        "in the CNS. Where these tracts cross the midline of the brain to connect opposite regions they are called commissures. The largest of these is the ": null
    },
    {
        "corpus callosum": "corpus callosum"
    },
    {
        " that connects the two ": null
    },
    {
        "cerebral hemisphere": "cerebral hemisphere"
    },
    {
        "s, and this has around 20 million axons.     The structure of a neuron is seen to consist of two separate functional regions, or compartments – the cell body together with the dendrites as one region, and the axonal region as the other.       The axonal region or compartment, includes the axon hillock, the initial segment, the rest of the axon, and the axon telodendria, and axon terminals. It also includes the myelin sheath. The ": null
    },
    {
        "Nissl bodies": "nissl bodies"
    },
    {
        " that produce the neuronal proteins are absent in the axonal region. Proteins needed for the growth of the axon, and the removal of waste materials, need a framework for transport. This ": null
    },
    {
        "axonal transport": "axonal transport"
    },
    {
        " is provided for in the axoplasm.          The ": null
    },
    {
        "axon hillock": "axon hillock"
    },
    {
        " is the area formed from the cell body of the neuron as it extends to become the axon. It precedes the initial segment. The received action potentials that are ": null
    },
    {
        "summed": "summation"
    },
    {
        " in the neuron are transmitted to the axon hillock for the generation of an action potential from the initial segment.       The axonal initial segment is a structurally and functionally separate microdomain of the axon.   One function of the initial segment is to separate the main part of an axon from the rest of the neuron; another function is to help initiate action potentials.  Both of these functions support neuron ": null
    },
    {
        "cell polarity": "cell polarity"
    },
    {
        ", in which dendrites  of a neuron receive input signals and the neurons axon provides output signals.      The axon initial segment is unmyelinated and contains a specialized complex of proteins. It is between approximately 20 and 60  µm in length and functions as the site of action potential initiation.   Both the position on the axon and the length of the AIS can change showing a degree of plasticity that can fine-tune the neuronal output.  A longer AIS is associated with a greater excitability. Plasticity is also seen in the ability of the AIS to change its distribution and to maintain the activity of neural circuitry at a constant level.     The AIS is highly specialized for the fast conduction of nerve impulses. This is achieved by a high concentration of ": null
    },
    {
        "voltage-gated sodium channels": "sodium channelvoltage-gated sodium channel"
    },
    {
        " in the initial segment where the action potential is initiated.  The ion channels are accompanied by a high number of ": null
    },
    {
        "cell adhesion molecules": "cell adhesion molecule"
    },
    {
        "and scaffolding proteins that anchor them to the cytoskeleton. Interactions with ": null
    },
    {
        "ankyrin G": "ankyrin-g binding motif of kcnq2-3"
    },
    {
        " are important as it is the major organizer in the AIS.          The ": null
    },
    {
        "axoplasm": "axoplasm"
    },
    {
        " is the equivalent of ": null
    },
    {
        "cytoplasm": "cytoplasm"
    },
    {
        " in the ": null
    },
    {
        "cell": "cell"
    },
    {
        ". ": null
    },
    {
        "Microtubules": "microtubule"
    },
    {
        "form in the axoplasm at the axon hillock. They are arranged along the length of the axon, in overlapping sections, and all point in the same direction – towards the axon terminals.  This is noted by the positive endings of the microtubules. This overlapping arrangement provides the routes for the transport of different materials from the cell body. Studies on the axoplasm has shown the movement of numerous vesicles of all sizes to be seen along cytoskeletal filaments – the microtubules, and ": null
    },
    {
        "neurofilament": "neurofilament"
    },
    {
        "s, in both directions between the axon and its terminals and the cell body.     Outgoing ": null
    },
    {
        "anterograde transport": "axonal transportanterograde transport"
    },
    {
        " from the cell body along the axon, carries mitochondria and membrane proteins needed for growth to the axon terminal. Ingoing ": null
    },
    {
        "retrograde transport": "axonal transportretrograde transport"
    },
    {
        " carries cell waste materials from the axon terminal to the cell body.  Outgoing and ingoing tracks use different sets of ": null
    },
    {
        "motor protein": "motor protein"
    },
    {
        "s. Outgoing transport is provided by ": null
    },
    {
        "kinesin": "kinesin"
    },
    {
        ", and ingoing return traffic is provided by ": null
    },
    {
        "dynein": "dynein"
    },
    {
        ". Dynein is minus-end directed. There are many forms of kinesin and dynein motor proteins, and each is thought to carry a different cargo. The studies on transport in the axon led to the naming of kinesin.             In the nervous system, axons may be ": null
    },
    {
        "myelin": "myelin"
    },
    {
        "ated, or unmyelinated. This is the provision of an insulating layer, called a myelin sheath. The myelin membrane is unique in its relatively high lipid to protein ratio.      In the peripheral nervous system axons are myelinated by ": null
    },
    {
        "glial cells": "neuroglia"
    },
    {
        " known as ": null
    },
    {
        "Schwann cell": "schwann cell"
    },
    {
        "s. In the central nervous system the myelin sheath is provided by another type of glial cell, the ": null
    },
    {
        "oligodendrocyte": "oligodendrocyte"
    },
    {
        ". Schwann cells myelinate a single axon. An oligodendrocyte can myelinate up to 50 axons.      The composition of myelin is different in the two types. In the CNS the major myelin protein is ": null
    },
    {
        "proteolipid protein": "proteolipid protein"
    },
    {
        ", and in the PNS it is ": null
    },
    {
        "myelin basic protein": "myelin basic protein"
    },
    {
        ".          ": null
    },
    {
        "Nodes of Ranvier": "node of ranvier"
    },
    {
        "  are short unmyelinated segments of a ": null
    },
    {
        "myelinated axon": "myelin"
    },
    {
        ", which are found periodically interspersed between segments of the myelin sheath. Therefore, at the point of the node of Ranvier, the axon is reduced in diameter.  These nodes are areas where action potentials can be generated. In ": null
    },
    {
        "saltatory conduction": "saltatory conduction"
    },
    {
        ", electrical currents produced at each node of Ranvier are conducted with little attenuation to the next node in line, where they remain strong enough to generate another action potential. Thus in a myelinated axon, action potentials effectively jump from node to node, bypassing the myelinated stretches in between, resulting in a propagation speed much faster than even the fastest unmyelinated axon can sustain.       An axon can divide into many branches called telodendria . At the end of each telodendron is an ": null
    },
    {
        "axon terminal": "axon terminal"
    },
    {
        " . Axon terminals contain ": null
    },
    {
        "synaptic vesicles": "synaptic vesicle"
    },
    {
        "that store the ": null
    },
    {
        "neurotransmitter": "neurotransmitter"
    },
    {
        " for release at the ": null
    },
    {
        "synapse": "chemical synapse"
    },
    {
        ". This makes multiple synaptic connections with other neurons possible. Sometimes the axon of a neuron may synapse onto dendrites of the same neuron, when it is known as an ": null
    },
    {
        "autapse": "autapse"
    },
    {
        ".                Most axons carry signals in the form of ": null
    },
    {
        "action potential": "action potential"
    },
    {
        "s, which are discrete electrochemical impulses that travel rapidly along an axon, starting at the cell body and terminating at points where the axon makes ": null
    },
    {
        "synaptic": "chemical synapse"
    },
    {
        " contact with target cells. The defining characteristic of an action potential is that it is all-or-nothing  — every action potential that an axon generates has essentially the same size and shape. This all-or-nothing characteristic allows action potentials to be transmitted from one end of a long axon to the other without any reduction in size. There are, however, some types of neurons with short axons that carry graded electrochemical signals, of variable amplitude.     When an action potential reaches a presynaptic terminal, it activates the synaptic transmission process. The first step is rapid opening of calcium ion channels in the membrane of the axon, allowing calcium ions to flow inward across the membrane. The resulting increase in intracellular calcium concentration causes ": null
    },
    {
        "synaptic vesicles": "synaptic vesicle"
    },
    {
        " filled with a ": null
    },
    {
        "neurotransmitter": "neurotransmitter"
    },
    {
        " chemical to fuse with the axons membrane and empty their contents into the extracellular space. The neurotransmitter is released from the presynaptic nerve through ": null
    },
    {
        "exocytosis": "exocytosis"
    },
    {
        ". The neurotransmitter chemical then diffuses across to receptors located on the membrane of the target cell. The neurotransmitter binds to these receptors and activates them. Depending on the type of receptors that are activated, the effect on the target cell can be to excite the target cell, inhibit it, or alter its metabolism in some way. This entire sequence of events often takes place in less than a thousandth of a second. Afterward, inside the presynaptic terminal, a new set of vesicles is moved into position next to the membrane, ready to be released when the next action potential arrives. The action potential is the final electrical step in the integration of synaptic messages at the scale of the neuron.          Extracellular recordings of ": null
    },
    {
        "action potential": "action potential"
    },
    {
        " propagation in axons has been demonstrated in freely moving animals. While extracellular somatic action potentials have been used to study cellular activity in freely moving animals such as ": null
    },
    {
        "place cells": "place cells"
    },
    {
        ", axonal activity in both ": null
    },
    {
        "white": "white matter"
    },
    {
        " and ": null
    },
    {
        "gray matter": "gray matter"
    },
    {
        " can also be recorded. Extracellular recordings of axon action potential propagation is distinct from somatic action potentials in three ways: 1. The signal has a shorter peak-trough duration than of pyramidal cells or interneurons . 2. The voltage change is triphasic. 3. Activity recorded on a tetrode is seen on only one of the four recording wires. In recordings from freely moving rats, axonal signals have been isolated in white matter tracts including the alveus and the corpus callosum as well hippocampal gray matter.      In fact, the generation of ": null
    },
    {
        "action potentials": "action potential"
    },
    {
        "in vivo is sequential in nature, and these sequential spikes constitute the ": null
    },
    {
        "digital codes": "neural coding"
    },
    {
        " in the ": null
    },
    {
        "neuron": "neuron"
    },
    {
        "s. Although previous studies indicate an axonal origin of a single spike evoked by short-term pulses, physiological signals in vivo trigger the initiation of sequential spikes at the cell bodies of the neurons. Rongjing Ge, Hao Qian and Jin-Hui Wang Molecular Brain 4, 1~11 Rongjing Ge, Hao Qian, Na Chen and Jin-Hui Wang Molecular Brain 7:1-16     In addition to propagating action potentials to axonal terminals, the axon is able to amplify the action potentials, which makes sure a secure propagation of sequential action potentials toward the axonal terminal. In terms of molecular mechanisms, ": null
    },
    {
        "voltage-gated sodium channels": "voltage-gated sodium channel"
    },
    {
        "in the axons possess lower ": null
    },
    {
        "threshold": "threshold potential"
    },
    {
        " and shorter ": null
    },
    {
        "refractory period": "refractory period"
    },
    {
        " in response to short-term pulses.          The development of the axon to its target, is one of the six major stages in the overall ": null
    },
    {
        "development of the nervous system": "development of the nervous system"
    },
    {
        ".  Studies done on cultured ": null
    },
    {
        "hippocampal": "hippocampus"
    },
    {
        " neurons suggest that neurons initially produce multiple ": null
    },
    {
        "neurites": "neurite"
    },
    {
        "that are equivalent, yet only one of these neurites is destined to become the axon.  It is unclear whether axon specification precedes axon elongation or vice versa,  although recent evidence points to the latter. If an axon that is not fully developed is cut, the polarity can change and other neurites can potentially become the axon. This alteration of polarity only occurs when the axon is cut at least 10 μm shorter than the other neurites. After the incision is made, the longest neurite will become the future axon and all the other neurites, including the original axon, will turn into dendrites.  Imposing an external force on a neurite, causing it to elongate, will make it become an axon.  Nonetheless, axonal development is achieved through a complex interplay between extracellular signaling, intracellular signaling and ": null
    },
    {
        "cytoskeletal": "cytoskeleton"
    },
    {
        " dynamics.       The extracellular signals that propagate through the ": null
    },
    {
        "extracellular matrix": "extracellular matrix"
    },
    {
        " surrounding neurons play a prominent role in axonal development.  These signaling molecules include proteins, ": null
    },
    {
        "neurotrophic factors": "neurotrophic factors"
    },
    {
        ", and extracellular matrix and adhesion molecules.   ": null
    },
    {
        "Netrin": "netrin"
    },
    {
        " a secreted protein, functions in axon formation. When the ": null
    },
    {
        "UNC-5": "unc-5"
    },
    {
        " netrin receptor is mutated, several neurites are irregularly projected out of neurons and finally a single axon is extended anteriorly. ": null
    },
    {
        "Neuroglia": "neuroglia"
    },
    {
        " and ": null
    },
    {
        "pioneer neurons": "pioneer neuron"
    },
    {
        "express UNC-6 to provide global and local netrin cues for guiding migrations in ": null
    },
    {
        "C. elegans": "caenorhabditis elegans"
    },
    {
        "    The neurotrophic factors – ": null
    },
    {
        "nerve growth factor": "nerve growth factor"
    },
    {
        " , ": null
    },
    {
        "brain-derived neurotrophic factor": "brain-derived neurotrophic factor"
    },
    {
        " and ": null
    },
    {
        "neurotrophin-3": "neurotrophin-3"
    },
    {
        " are also involved in axon development and bind to ": null
    },
    {
        "Trk receptor": "trk receptor"
    },
    {
        "s.      The ": null
    },
    {
        "ganglioside": "ganglioside"
    },
    {
        "-converting enzyme plasma membrane ganglioside ": null
    },
    {
        "sialidase": "sialidase"
    },
    {
        " , which is involved in the activation of ": null
    },
    {
        "TrkA": "trka"
    },
    {
        " at the tip of neutrites, is required for the elongation of axons. PMGS asymmetrically distributes to the tip of the neurite that is destined to become the future axon.        During axonal development, the activity of ": null
    },
    {
        "PI3K": "pi3k"
    },
    {
        " is increased at the tip of destined axon. Disrupting the activity of PI3K inhibits axonal development. Activation of PI3K results in the production of ": null
    },
    {
        "phosphatidylinositol -trisphosphate": "phosphatidylinositol -trisphosphate"
    },
    {
        " which can cause significant elongation of a neurite, converting it into an axon. As such, the overexpression of ": null
    },
    {
        "phosphatases": "phosphatase"
    },
    {
        "that dephosphorylate PtdIns leads into the failure of polarization.       The neurite with the lowest ": null
    },
    {
        "actin": "actin"
    },
    {
        " filament content will become the axon. PGMS concentration and ": null
    },
    {
        "f-actin": "actinf-actin"
    },
    {
        " content are inversely correlated; when PGMS becomes enriched at the tip of a neurite, its f-actin content is substantially decreased. In addition, exposure to actin-depolimerizing drugs and toxin B  causes the formation of multiple axons. Consequently, the interruption of the actin network in a growth cone will promote its neurite to become the axon.              Growing axons move through their environment via the ": null
    },
    {
        "growth cone": "growth cone"
    },
    {
        ", which is at the tip of the axon. The growth cone has a broad sheet-like extension called a ": null
    },
    {
        "lamellipodium": "lamellipodium"
    },
    {
        " which contain protrusions called ": null
    },
    {
        "filopodia": "filopodia"
    },
    {
        ". The filopodia are the mechanism by which the entire process adheres to surfaces and explores the surrounding environment. ": null
    },
    {
        "Actin": "actin"
    },
    {
        " plays a major role in the mobility of this system. Environments with high levels of ": null
    },
    {
        "cell adhesion molecules": "cell adhesion molecule"
    },
    {
        " create an ideal environment for axonal growth. This seems to provide a sticky surface for axons to grow along. Examples of CAMs specific to neural systems include ": null
    },
    {
        "N-CAM": "neural cell adhesion molecule"
    },
    {
        ", ": null
    },
    {
        "TAG-1": "contactin 2"
    },
    {
        "—an axonal ": null
    },
    {
        "glycoprotein": "glycoprotein"
    },
    {
        "—  —and ": null
    },
    {
        "MAG": "myelin-associated glycoprotein"
    },
    {
        ", all of which are part of the ": null
    },
    {
        "immunoglobulin": "immunoglobulin"
    },
    {
        " superfamily. Another set of molecules called ": null
    },
    {
        "extracellular matrix": "extracellular matrix"
    },
    {
        "-": null
    },
    {
        "adhesion molecules": "cell adhesion molecule"
    },
    {
        "also provide a sticky substrate for axons to grow along. Examples of these molecules include ": null
    },
    {
        "laminin": "laminin"
    },
    {
        ", ": null
    },
    {
        "fibronectin": "fibronectin"
    },
    {
        ", ": null
    },
    {
        "tenascin": "tenascin"
    },
    {
        ", and ": null
    },
    {
        "perlecan": "perlecan"
    },
    {
        ". Some of these are surface bound to cells and thus act as short range attractants or repellents. Others are difusible ligands and thus can have long range effects.     Cells called ": null
    },
    {
        "guidepost cells": "guidepost cells"
    },
    {
        " assist in the ": null
    },
    {
        "guidance": "axon guidance"
    },
    {
        " of neuronal axon growth. These cells that help ": null
    },
    {
        "axon guidance": "axon guidance"
    },
    {
        ", are typically other neurons that are sometimes immature.     It has also been discovered through research that if the axons of a neuron were damaged, as long as the soma  is not damaged, the axons would regenerate and remake the synaptic connections with neurons with the help of ": null
    },
    {
        "guidepost cells": "guidepost cells"
    },
    {
        ". This is also referred to as ": null
    },
    {
        "neuroregeneration": "neuroregeneration"
    },
    {
        ".      ": null
    },
    {
        "Nogo-A": "reticulon 4"
    },
    {
        " is a type of neurite outgrowth inhibitory component that is present in the central nervous system myelin membranes . It has a crucial role in restricting axonal regeneration in adult mammalian central nervous system. In recent studies, if Nogo-A is blocked and neutralized, it is possible to induce long-distance axonal regeneration which leads to enhancement of functional recovery in rats and mouse spinal cord. This has yet to be done on humans.  A recent study has also found that ": null
    },
    {
        "macrophages": "macrophage"
    },
    {
        "activated through a specific inflammatory pathway activated by the ": null
    },
    {
        "Dectin-1": "clec7a"
    },
    {
        " receptor are capable of promoting axon recovery, also however causing neurotoxicity in the neuron.        Axons vary largely in length from a few micrometers up to meters in some animals. This emphasizes that there must be a cellular length regulation mechanism allowing the neurons both to sense the length of their axons and to control their growth accordingly. It was discovered that ": null
    },
    {
        "motor proteins": "motor proteins"
    },
    {
        " play an important role in regulating the length of axons.  Based on this observation, researchers developed an explicit model for axonal growth describing how motor proteins could affect the axon length on the molecular level.     These studies suggest that motor proteins carry signaling molecules from the soma to the growth cone and vice versa whose concentration oscillates in time with a length-dependent frequency.          The axons of neurons in the human ": null
    },
    {
        "peripheral nervous system": "peripheral nervous system"
    },
    {
        " can be classified based on their physical features and signal conduction properties. Axons were known to have different thicknesses and these differences were thought to relate to the speed at which an action potential could travel along the axon – its conductance velocity. ": null
    },
    {
        "Erlanger": "joseph erlanger"
    },
    {
        " and ": null
    },
    {
        "Gasser": "herbert spencer gasser"
    },
    {
        " proved this hypothesis, and identified several types of nerve fiber, establishing a relationship between the diameter of an axon and its ": null
    },
    {
        "nerve conduction velocity": "nerve conduction velocity"
    },
    {
        ". They published their findings in 1941 giving the first classification of axons.     Axons are classified in two systems. The first one introduced by Erlanger and Gasser, grouped the fibers into three main groups using the letters A, B, and C. These groups, ": null
    },
    {
        "group A": "group a nerve fiber"
    },
    {
        ", ": null
    },
    {
        "group B": "group b nerve fibres"
    },
    {
        ", and ": null
    },
    {
        "group C": "group c nerve fiber"
    },
    {
        " include both the sensory fibers  and the motor fibres . The first group A, was subdivided into alpha, beta, gamma, and delta fibers  — Aα, Aβ, Aγ, and Aδ. The motor neurons of the different motor fibers, were the ": null
    },
    {
        "lower motor neurons": "lower motor neuron"
    },
    {
        "– ": null
    },
    {
        "alpha motor neuron": "alpha motor neuron"
    },
    {
        ", ": null
    },
    {
        "beta motor neuron": "beta motor neuron"
    },
    {
        ", and ": null
    },
    {
        "gamma motor neuron": "gamma motor neuron"
    },
    {
        " having the Aα, Aβ, and Aγ nerve fibers respectively.     Later findings by other researchers identified two groups of Aa fibers that were sensory fibers. These were then introduced into a system that only included sensory fibers . This system refers to the sensory groups as Types and uses Roman numerals: Type Ia, Type Ib, Type II, Type III, and Type IV.      ": null
    },
    {
        "Lower motor neurons": "lower motor neurons"
    },
    {
        " have two kind of fibers:           ": null
    },
    {
        "sensory receptors": "sensory receptors"
    },
    {
        " innervate different types of nerve fibers. ": null
    },
    {
        "Proprioceptors": "proprioceptor"
    },
    {
        "are innervated by type Ia, Ib and II sensory fibers, ": null
    },
    {
        "mechanoreceptors": "mechanoreceptor"
    },
    {
        "by type II and III sensory fibers and ": null
    },
    {
        "nociceptors": "nociceptor"
    },
    {
        "and ": null
    },
    {
        "thermoreceptors": "thermoreceptors"
    },
    {
        " by type III and IV sensory fibers.            The ": null
    },
    {
        "autonomic nervous system": "autonomic nervous system"
    },
    {
        " has two kinds of peripheral fibers:               In order of degree of severity, injury to a nerve can be described as ": null
    },
    {
        "neurapraxia": "neurapraxia"
    },
    {
        ", ": null
    },
    {
        "axonotmesis": "axonotmesis"
    },
    {
        ", or ": null
    },
    {
        "neurotmesis": "neurotmesis"
    },
    {
        ".   ": null
    },
    {
        "Concussion": "concussion"
    },
    {
        " is considered a mild form of ": null
    },
    {
        "diffuse axonal injury": "diffuse axonal injury"
    },
    {
        ".  Axonal injury can also cause ": null
    },
    {
        "central chromatolysis": "central chromatolysis"
    },
    {
        ". The dysfunction of axons in the nervous system is one of the major causes of many inherited ": null
    },
    {
        "neurological disorders": "neurological disorder"
    },
    {
        "that affect both peripheral and central neurons.     When an axon is crushed, an active process of ": null
    },
    {
        "axonal degeneration": "wallerian degenerationaxonal degeneration"
    },
    {
        " takes place at the part of the axon furthest from the cell body. This degeneration takes place quickly following the injury, with the part of the axon being sealed off at the membranes and broken down by macrophages. This is known as ": null
    },
    {
        "Wallerian degeneration": "wallerian degeneration"
    },
    {
        ". , ": null
    },
    {
        "University of California, San Francisco": "university of california, san francisco"
    },
    {
        " Dying back of an axon can also take place in many neurodegenerative diseases, particularly when axonal transport is impaired, this is known as Wallerian-like degeneration.  Studies suggest that the degeneration happens as   a result of the axonal protein ": null
    },
    {
        "NMNAT2": "nmnat2"
    },
    {
        ", being prevented from reaching all of the axon.      ": null
    },
    {
        "Demyelination of axons": "demyelinating disease"
    },
    {
        " causes the multitude of neurological symptoms found in the disease ": null
    },
    {
        "multiple sclerosis": "multiple sclerosis"
    },
    {
        ".     ": null
    },
    {
        "Dysmyelination": "myelindysmyelination"
    },
    {
        " is the abnormal formation of the myelin sheath. This is implicated in several ": null
    },
    {
        "leukodystrophies": "leukodystrophy"
    },
    {
        ", and also in ": null
    },
    {
        "schizophrenia": "schizophrenia"
    },
    {
        ".        A severe ": null
    },
    {
        "traumatic brain injury": "traumatic brain injury"
    },
    {
        " can result in widespread lesions to nerve tracts damaging the axons in a condition known as ": null
    },
    {
        "diffuse axonal injury": "diffuse axonal injury"
    },
    {
        ". This can lead to a ": null
    },
    {
        "persistent vegetative state": "persistent vegetative state"
    },
    {
        ".  It has been shown in studies on the ": null
    },
    {
        "rat": "rat"
    },
    {
        " that axonal damage from a single mild traumatic brain injury, can leave a susceptibility to further damage, after repeated mild traumatic brain injuries.      A ": null
    },
    {
        "nerve guidance conduit": "nerve guidance conduit"
    },
    {
        " is an artificial means of guiding axon growth to enable ": null
    },
    {
        "neuroregeneration": "neuroregeneration"
    },
    {
        ", and is one of the many treatments used for different kinds of ": null
    },
    {
        "nerve injury": "nerve injury"
    },
    {
        ".       German anatomist ": null
    },
    {
        "Otto Friedrich Karl Deiters": "otto friedrich karl deiters"
    },
    {
        " is generally credited with the discovery of the axon by distinguishing it from the dendrites. Swiss ": null
    },
    {
        "Rüdolf Albert von Kölliker": "albert von kölliker"
    },
    {
        " and German ": null
    },
    {
        "Robert Remak": "robert remak"
    },
    {
        " were the first to identify and characterize the axon initial segment. Kölliker named the axon in 1896.  ": null
    },
    {
        "Louis-Antoine Ranvier": "louis-antoine ranvier"
    },
    {
        " was the first to describe the gaps or nodes found on axons and for this contribution these axonal features are now commonly referred to as the ": null
    },
    {
        "nodes of Ranvier": "node of ranvier"
    },
    {
        ". ": null
    },
    {
        "Santiago Ramón y Cajal": "santiago ramón y cajal"
    },
    {
        ", a Spanish anatomist, proposed that axons were the output components of neurons, describing their functionality. ": null
    },
    {
        "Joseph Erlanger": "joseph erlanger"
    },
    {
        " and ": null
    },
    {
        "Herbert Gasser": "herbert gasser"
    },
    {
        " earlier developed the classification system for peripheral nerve fibers,  based on axonal conduction velocity, ": null
    },
    {
        "myelin": "myelin"
    },
    {
        "ation, fiber size etc. ": null
    },
    {
        "Alan Hodgkin": "alan hodgkin"
    },
    {
        " and ": null
    },
    {
        "Andrew Huxley": "andrew huxley"
    },
    {
        " also employed the ": null
    },
    {
        "squid giant axon": "squid giant axon"
    },
    {
        " and by 1952 they had obtained a full quantitative description of the ionic basis of the ": null
    },
    {
        "action potential": "action potential"
    },
    {
        ", leading to the formulation of the ": null
    },
    {
        "Hodgkin–Huxley model": "hodgkin–huxley model"
    },
    {
        ". Hodgkin and Huxley were awarded jointly the ": null
    },
    {
        "Nobel Prize": "nobel prize in physiology or medicine"
    },
    {
        " for this work in 1963. The formulae detailing axonal conductance were extended to vertebrates in the Frankenhaeuser–Huxley equations. The understanding of the biochemical basis for action potential propagation has advanced further, and includes many details about individual ": null
    },
    {
        "ion channel": "ion channel"
    },
    {
        "s.       The axons in ": null
    },
    {
        "invertebrates": "invertebrate"
    },
    {
        "have been extensively studied. The ": null
    },
    {
        "longfin inshore squid": "longfin inshore squid"
    },
    {
        ", often used as a ": null
    },
    {
        "model organism": "model organism"
    },
    {
        " has the longest known axon.  The ": null
    },
    {
        "giant squid": "giant squid"
    },
    {
        " has the ": null
    },
    {
        "largest axon": "squid giant axon"
    },
    {
        " known. Its size ranges from a half to one millimetre in diameter and is used in the control of its ": null
    },
    {
        "jet propulsion": "jet propulsion"
    },
    {
        " system. The fastest recorded conduction speed of 210  m/s, is found in the ensheathed axons of some pelagic ": null
    },
    {
        "Penaeid shrimps": "penaeidae"
    },
    {
        "  and the usual range is between 90 and 200  m/s       In other cases as seen in rat studies an axon originates from a dendrite; such axons are said to have dendritic origin . Some axons with dendritic origin similarly have a proximal initial segment that starts directly at the axon origin, while others have a distal initial segment, discernibly separated from the axon origin. In many species some of the neurons have axons that emanate from the dendrite and not from the cell body, and these are known as axon-carrying dendrites. In many cases, an axon originates at an axon hillock on the soma; such axons are said to have somatic origin . Some axons with somatic origin have a proximal initial segment adjacent the axon hillock, while others have a distal initial segment, separated from the soma by an extended axon hillock. ": null
    }
]