[
    {
        "        Alkmaar Zaanstreek , better known as AZ Alkmaar or simply AZ , is a Dutch professional ": null
    },
    {
        "football": "Association Football"
    },
    {
        " club from ": null
    },
    {
        "Alkmaar": "Alkmaar"
    },
    {
        " and the ": null
    },
    {
        "Zaanstreek": "Zaanstreek"
    },
    {
        ". The club plays in the ": null
    },
    {
        "Eredivisie": "Eredivisie"
    },
    {
        ", the highest professional football league in the Netherlands, and hosts home matches at the ": null
    },
    {
        "AFAS Stadion": "Afas Stadion"
    },
    {
        ".     AZ has won the Eredivisie twice, in ": null
    },
    {
        "1980–81": "1980–81 Eredivisie"
    },
    {
        " and ": null
    },
    {
        "2008–09": "2008–09 Eredivisie"
    },
    {
        ". In the same season as their first league title, they also reached the ": null
    },
    {
        "UEFA Cup Final": "1981 Uefa Cup Final"
    },
    {
        ", which they lost to ": null
    },
    {
        "Ipswich Town": "Ipswich Town F.C."
    },
    {
        ". In addition, the team has won the ": null
    },
    {
        "KNVB Cup": "Knvb Cup"
    },
    {
        " on four occasions.           AZ was founded on 10 May 1967 as AZ 67, the result of a merger of Alkmaar 54 and FC Zaanstreek.      Alkmaar 54 was founded as a professional team in April 1954 to play in the 10-team ": null
    },
    {
        "NBVB": ":Nl:Nbvb"
    },
    {
        " league, created because the ": null
    },
    {
        "KNVB": "Knvb"
    },
    {
        " refused to organize a professional league . Alkmaar 54, and by extension AZ, played the very first professional match in the Netherlands: on August 14, 1954, they won 3-0 at home against Venlo 54, with ": null
    },
    {
        "Klaas Smit": "Klaas Smit"
    },
    {
        " scoring the first goal. , ": null
    },
    {
        "Algemeen Dagblad": "Algemeen Dagblad"
    },
    {
        ", 25-06-2008 After winning the Eerste Divisie in 1960/61, it played one year in the Eredivisie.     FC Zaanstreek had been playing since 1910 as the ": null
    },
    {
        "Kooger": "Koog Aan De Zaan"
    },
    {
        " Football Club . KFC had nearly become National Champion in 1934 through a narrow loss to ": null
    },
    {
        "Ajax": "Afc Ajax"
    },
    {
        " in the finals. The team became professional in 1955. In 1964 the professional part of KFC was renamed FC Zaanstreek, while the amateurs played on as KFC.     Also in 1964, the brothers Cees and ": null
    },
    {
        "Klaas Molenaar": ":Nl:Klaas Molenaar"
    },
    {
        ", former players and trainers for KFC and owners of a growing appliance store chain, sought to create a powerful football team in Zaanstreek by merging the two local professional teams: KFC and ": null
    },
    {
        "Zaanlandsche Football Club": ":Nl:Zfc"
    },
    {
        ". After the ZFC leadership thwarted this attempt, the Molenaars successfully merged FC Zaanstreek with Alkmaar 54 in 1967. FC Zaanstreek had finished 7th and Alkmaar 54 12th in ": null
    },
    {
        "1966–67 Eerste Divisie": "1966–67 Eerste Divisie"
    },
    {
        ". The team would be based in Alkmaar, though the second team originally trained and played in ": null
    },
    {
        "Koog aan de Zaan": "Koog Aan De Zaan"
    },
    {
        ". Martin Rep, , De Orkaan, 10 August 2018       Partially through the hiring of expensive foreign players, the new club soon acquired large debts. In 1972, the Molenaar brothers bailed it out and invested heavily in the club, to the point that AZ 67 were successful in the late 1970s and early 80s, regularly playing European football from 1977 to 1982 while also winning three ": null
    },
    {
        "KNVB Cups": "Knvb Cup"
    },
    {
        "over that period.     After four close league campaigns, AZ finally became ": null
    },
    {
        "Dutch champions": "Eredivisie"
    },
    {
        " in ": null
    },
    {
        "1981": "1980–81 Eredivisie"
    },
    {
        ", becoming the only team other than the big three of Ajax, ": null
    },
    {
        "Feyenoord": "Feyenoord"
    },
    {
        " and ": null
    },
    {
        "PSV": "Psv Eindhoven"
    },
    {
        " to do so in a 44-year period spanning from 1965 to 2009 . They won the title with overwhelming power, winning 27 of 34 matches and only losing once while scoring a club record 101 goals and conceding just 30. That same season, AZ reached the ": null
    },
    {
        "final of the UEFA Cup": "1981 Uefa Cup Final"
    },
    {
        ", losing 5–4 on aggregate to ": null
    },
    {
        "Ipswich Town": "Ipswich Town F.C."
    },
    {
        ". The next year, in the ": null
    },
    {
        "European Cup": "1981–82 European Cup"
    },
    {
        ", they lost in the second round 3–2 on aggregate to ": null
    },
    {
        "Liverpool": "Liverpool F.C."
    },
    {
        ".     ": null
    },
    {
        "Georg Keßler": "Georg Keßler"
    },
    {
        " was AZs manager over most of these years , while star players included: ": null
    },
    {
        "Kees Kist": "Kees Kist"
    },
    {
        ", the clubs highest ever goalscorer with 212 goals and the first ever Dutchman to win the ": null
    },
    {
        "European Golden Boot": "European Golden Shoe"
    },
    {
        " in 1979 when he scored 34 goals in a season; ": null
    },
    {
        "Jan Peters": "Jan Peters"
    },
    {
        ", who played 120 matches for AZ during this period scoring 30 goals from midfield; and ": null
    },
    {
        "Hugo Hovenkamp": "Hugo Hovenkamp"
    },
    {
        ", who played 239 matches in defence for AZ from 1975–83, as well as receiving 31 caps for the ": null
    },
    {
        "Netherlands national team": "Netherlands National Football Team"
    },
    {
        " from 1977–1983 and playing each match in ": null
    },
    {
        "UEFA Euro 1980": "Uefa Euro 1980"
    },
    {
        " while an AZ player. Additional stars included ": null
    },
    {
        "John Metgod": "John Metgod"
    },
    {
        ", who spent six years at AZ playing 195 matches as a defender, scoring 26 goals including a goal against Ipswich Town in the final of the UEFA Cup. Like Hovenkamp, Metgod was also included in the Dutch squad for Euro 1980. Meanwhile, Danish forward ": null
    },
    {
        "Kristen Nygaard": "Kristen Nygaard"
    },
    {
        " spent ten years at AZ, scoring 104 goals in 363 matches between 1972 and 1982.         Co-owner Cees Molenaar died in 1979. AZs fortunes deteriorated after his brother, Klaas Molenaar, left the club in 1985. After several mid-table finishes in previous seasons, AZ was relegated in 1988 from the ": null
    },
    {
        "Eredivisie": "Eredivisie"
    },
    {
        ", ending the season on 28 points from 34 matches and falling to the ": null
    },
    {
        "Eerste Divisie": "Eerste Divisie"
    },
    {
        " due to the superior goal difference of ": null
    },
    {
        "Roda JC": "Roda Jc"
    },
    {
        ". This relegation was significant since it occurred just seven years after the clubs historic domestic double and marked the end of AZs first period of success in Dutch football. Following this, AZ spent much of the next decade in the second tier, struggling to find a return to the top flight.       The involvement of businessman Dirk Scheringa in the mid-1990s marked the revival of the club as AZ returned to the Eredivisie, winning the ": null
    },
    {
        "1997-98 Eerste Divisie": "1997-98 Eerste Divisie"
    },
    {
        " title. The club achieved consecutive finishes around the middle positions in the league until ending up in third place in the ": null
    },
    {
        "2004-05 Eredivisie": "2004-05 Eredivisie"
    },
    {
        " season, AZs highest position for 23 years. In the summer of 2006, the club moved to a new 17,000 capacity stadium, ": null
    },
    {
        "AZ Stadion": "Az Stadion"
    },
    {
        ".     Despite playing strongly for the majority of the 2006–07 season, AZs season ended in disappointment. First, entering the last matchday of the ": null
    },
    {
        "2006–07 Eredivisie": "2006–07 Eredivisie"
    },
    {
        " season, AZ led PSV and Ajax on goal difference at the top of the league table, but ended up third after losing their last match against the eventually-relegated, bottom-of-the-table ": null
    },
    {
        "Excelsior": "S.B.V. Excelsior"
    },
    {
        ", who played with ten men for 80 minutes. Additionally, AZ then lost the ": null
    },
    {
        "KNVB Cup final": "2006–07 Knvb Cupfinal"
    },
    {
        " to Ajax 8–7 after a penalty shoot-out, while also falling to Ajax over two play-off matches for participation in the ": null
    },
    {
        "Champions League": "2007–08 Uefa Champions League"
    },
    {
        ". After the season, key players like ": null
    },
    {
        "Tim de Cler": "Tim De Cler"
    },
    {
        ", ": null
    },
    {
        "Danny Koevermans": "Danny Koevermans"
    },
    {
        " and ": null
    },
    {
        "Shota Arveladze": "Shota Arveladze"
    },
    {
        " left the team.        A remarkable run ended in the 2007–08 season: after AZ lost a group stage match against ": null
    },
    {
        "Everton": "Everton F.C."
    },
    {
        " in the ": null
    },
    {
        "UEFA Cup": "2007–08 Uefa Cup"
    },
    {
        ", the clubs unbeaten run of 32 home matches in European competitions – lasting from 1977 to 2007 – ended. AZ had a poor season, suffering elimination in the first round of the KNVB Cup and the group stage of the UEFA Cup, as well as finishing the ": null
    },
    {
        "2007–08 Eredivisie": "2007–08 Eredivisie"
    },
    {
        " in a disappointing 11th place. Towards the latter stages of the season, in March 2008, AZ manager ": null
    },
    {
        "Louis van Gaal": "Louis Van Gaal"
    },
    {
        " had initially tendered his resignation, but after protests the players and directors, he rescinded his resignation.     The ": null
    },
    {
        "2008–09 season": "2008–09 Eredivisie"
    },
    {
        " had an unpromising start after two opening defeats against ": null
    },
    {
        "NAC Breda": "Nac Breda"
    },
    {
        " and ": null
    },
    {
        "ADO Den Haag": "Ado Den Haag"
    },
    {
        ". However, starting with a 1–0 victory over defending league champions PSV, AZ did not lose a match in its next 28 matches, including a run of 11-straight matches where AZ did not concede an opposition goal. Three weeks before the end of the season, AZ became Eredivisie champions, edging nearest title rivals ": null
    },
    {
        "Twente": "Fc Twente"
    },
    {
        " and Ajax comfortably. This was a historic achievement for the club as this was the first title-winning season for 28 years, and it also meant a return to the ": null
    },
    {
        "UEFA Champions League": "Uefa Champions League"
    },
    {
        ".     Being league champions, AZ qualified for the ": null
    },
    {
        "Champions League": "2009–10 Uefa Champions League"
    },
    {
        " for only the second time. It was drawn into a group alongside ": null
    },
    {
        "Arsenal FC": "Arsenal Fc"
    },
    {
        ", ": null
    },
    {
        "Standard Liège": "Standard Liège"
    },
    {
        " and ": null
    },
    {
        "Olympiacos": "Olympiacos"
    },
    {
        " but only took four points from six matches and finished bottom of their group.       For the 2009–10 season, ": null
    },
    {
        "Ronald Koeman": "Ronald Koeman"
    },
    {
        " succeeded Louis van Gaal, who had departed to manage ": null
    },
    {
        "Bayern Munich": "Fc Bayern Munich"
    },
    {
        " after leading AZ to the championship. Koeman was officially hired on 17 May 2009, but on 5 December, AZ announced he was no longer in charge of the club after losing 7 of his first 16 matches. Former ": null
    },
    {
        "Rangers": "Rangers F.C."
    },
    {
        " and ": null
    },
    {
        "Zenit Saint Petersburg": "Fc Zenit Saint Petersburg"
    },
    {
        " manager ": null
    },
    {
        "Dick Advocaat": "Dick Advocaat"
    },
    {
        " took over for the remainder of the season. Under Advocaat, AZ achieved solid results and secured European football for the next season.     For the 2010–11 season, AZ appointed ": null
    },
    {
        "Gertjan Verbeek": "Gertjan Verbeek"
    },
    {
        " as its new manager. They finished the ": null
    },
    {
        "2010–11 Eredivisie": "2010–11 Eredivisie"
    },
    {
        " in fourth place, thus securing ": null
    },
    {
        "Europa League football": "2011–12 Uefa Europa League"
    },
    {
        " for the next season, while in the ": null
    },
    {
        "KNVB Cup": "2010–11 Knvb Cup"
    },
    {
        ", AZ reached the last eight, where they were beaten by rivals Ajax by a 1–0 scoreline. AZ also finished third in their ": null
    },
    {
        "Europa League": "2010–11 Uefa Europa League"
    },
    {
        " group, thus failing to qualifying for the competitions knockout round.     In the 2011–12 season, AZ finished fourth in the ": null
    },
    {
        "Eredivisie": "2011–12 Eredivisie"
    },
    {
        ", though performed significantly better in cup competitions, reaching the semi-finals in the ": null
    },
    {
        "KNVB Cup": "2011–12 Knvb Cup"
    },
    {
        "  and the quarter-finals in the Europa League. In the latter, the club ultimately lost to ": null
    },
    {
        "Valencia": "Valencia Cf"
    },
    {
        " after having defeated ": null
    },
    {
        "Udinese": "Udinese Calcio"
    },
    {
        ", ": null
    },
    {
        "Anderlecht": "R.S.C. Anderlecht"
    },
    {
        ", ": null
    },
    {
        "Malmö FF": "Malmö Ff"
    },
    {
        ", ": null
    },
    {
        "Austria Wien": "Fk Austria Wien"
    },
    {
        ", ": null
    },
    {
        "Metalist Kharkiv": "Fc Metalist Kharkiv"
    },
    {
        ", ": null
    },
    {
        "Aalesund": "Aalesunds Fk"
    },
    {
        " and ": null
    },
    {
        "Baumit Jablonec": "Fk Baumit Jablonec"
    },
    {
        " to reach that stage.     On 21 December 2011, during the quarter-finals of the ": null
    },
    {
        "2011–12 KNVB Cup": "2011–12 Knvb Cup"
    },
    {
        ", a 19-year-old Ajax fan invaded the ": null
    },
    {
        "Amsterdam Arena": "Amsterdam Arena"
    },
    {
        " pitch in the 36th minute with Ajax winning 1–0, attacking AZ goalkeeper ": null
    },
    {
        "Esteban Alvarado": "Esteban Alvarado"
    },
    {
        ". The fan slipped and Alvarado kicked the fan twice, prompting the referee to issue the goalkeeper a red card. Following this, AZ manager Gertjan Verbeek ordered his players to leave the pitch for the dressing room in protest. The match was later played on 19 January 2012, with Alvarados red card rescinded; AZ won 3–2.     The 2012–13 season started in the ": null
    },
    {
        "Europa League": "2012–13 Uefa Europa League Qualifying Phase And Play-Off Round"
    },
    {
        " with a qualifying play-off round against ": null
    },
    {
        "Guus Hiddinks": "Guus Hiddink"
    },
    {
        " Anzhi Makhachkala": "Fc Anzhi Makhachkala"
    },
    {
        ". AZ was hammered 6–0 on aggregate. Disappointingly, AZ finished tenth in the ": null
    },
    {
        "2012–13 Eredivisie": "2012–13 Eredivisie"
    },
    {
        ", although the club won the ": null
    },
    {
        "2012–13 KNVB Cup": "2012–13 Knvb Cup"
    },
    {
        " after defeating PSV 2–1 in the ": null
    },
    {
        "final": "2012–13 Knvb Cupfinal"
    },
    {
        ". As cup winners, AZ automatically qualified for the ": null
    },
    {
        "2013–14 Europa League": "2013–14 Uefa Europa League"
    },
    {
        ".     In September 2013, just one day after emphatically beating PSV, at the time the ": null
    },
    {
        "league leaders": "2013–14 Eredivisie"
    },
    {
        ", Verbeek was dismissed as first team manager by the club due to a lack of chemistry between management and players.  He was replaced by Dick Advocaat for the remainder of the season until a permanent replacement could be found. Advocaat took AZ to the semi-finals of the ": null
    },
    {
        "KNVB Cup": "2013–14 Knvb Cup"
    },
    {
        ", the quarter-finals of the ": null
    },
    {
        "Europa League": "2013–14 Uefa Europa League"
    },
    {
        " and eighth in the league, ultimately losing to ": null
    },
    {
        "Groningen": "Fc Groningen"
    },
    {
        " in the Europa League play-off final round .       The ": null
    },
    {
        "2014–15 season": "2014–15 Eredivisie"
    },
    {
        " began with a new manager, former ": null
    },
    {
        "Heerenveen": "Sc Heerenveen"
    },
    {
        " manager and Ajax great ": null
    },
    {
        "Marco van Basten": "Marco Van Basten"
    },
    {
        ". However, after just three matches into the season, Van Basten resigned as manager to become assistant manager under ": null
    },
    {
        "Alex Pastoor": "Alex Pastoor"
    },
    {
        ", citing heavy stress as the main reason.  Pastoor was the interim manager during two matches under Van Bastens absence and received the official title on 16 September, but contract negotiations failed and he left the club just two days later. A week later, ": null
    },
    {
        "John van den Brom": "John Van Den Brom"
    },
    {
        " was appointed manager. Under Van den Brom, AZ quickly rose up to the sub-top, eventually finished the season in third place, surpassing Feyenoord on the final seasons matchday and qualifying for the ": null
    },
    {
        "2015–16 Europa League": "2015–16 Uefa Europa League"
    },
    {
        ".     The ": null
    },
    {
        "2015–16 Eredivisie": "2015–16 Eredivisie"
    },
    {
        " started with AZ selling most of its first-team players from the previous season during the summer transfer period. As a response, AZ bought players from other Dutch clubs, notably ": null
    },
    {
        "Vincent Janssen": "Vincent Janssen"
    },
    {
        " from ": null
    },
    {
        "Almere City": "Almere City Fc"
    },
    {
        ", ": null
    },
    {
        "Alireza Jahanbakhsh": "Alireza Jahanbakhsh"
    },
    {
        " from ": null
    },
    {
        "NEC": "N.E.C."
    },
    {
        " and ": null
    },
    {
        "Ben Rienstra": "Ben Rienstra"
    },
    {
        " from ": null
    },
    {
        "PEC Zwolle": "Pec Zwolle"
    },
    {
        ". In December, it was announced free agent ": null
    },
    {
        "Ron Vlaar": "Ron Vlaar"
    },
    {
        " signed a contract until the end of the season after training with the club for a few weeks prior.  Vlaar quickly became team captain and helped lift AZ from tenth place to a fourth-place finish in the league. Along this rise, new signing Vincent Janssen scored 27 goals for the club, earning him the Eredivisie top goalscorer title. In the ": null
    },
    {
        "2015–16 KNVB Cup": "2015–16 Knvb Cup"
    },
    {
        ", AZ made it to the semi-finals, losing 3–1 to Feyenoord. AZ won the first two qualification rounds to qualify for the 2015–16 Europa League group stage, but finished last in their group.     At the start of the ": null
    },
    {
        "2016–17 Eredivisie": "2016–17 Eredivisie"
    },
    {
        ", AZ sold last seasons performer Vincent Janssen to ": null
    },
    {
        "Tottenham Hotspur": "Tottenham Hotspur F.C."
    },
    {
        " and long-time midfielder ": null
    },
    {
        "Markus Henriksen": "Markus Henriksen"
    },
    {
        " to ": null
    },
    {
        "Hull City": "Hull City A.F.C."
    },
    {
        ". In the ": null
    },
    {
        "2016–17 Europa League": "2016–17 Uefa Europa League"
    },
    {
        ", AZ finished second in Group D, surviving the group stage for the third time in five seasons.                                                                                                                             :": null
    }
]