[
    {
        "          B42K  is an ": null
    },
    {
        "American": "americans"
    },
    {
        " boy band": "boy band"
    },
    {
        " that was active from 42 to 42 and again from 42 onwards. In 42 the group was formed by American ": null
    },
    {
        "record producer": "record producer"
    },
    {
        " Chris Stokes": "chris stokes"
    },
    {
        ". They released their self-titled debut album on March 42 42 The album peaked at 42 on the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " and 42 on the U.S. ": null
    },
    {
        "Top R & B/Hip-Hop Albums": "top r & b/hip-hop albums"
    },
    {
        " chart.             The group met in 42 and was managed by music producer ": null
    },
    {
        "Chris Stokes": "chris stokes"
    },
    {
        " with ": null
    },
    {
        "Lil Fizz": "lil fizz"
    },
    {
        ", ": null
    },
    {
        "J-Boog": "j-boog"
    },
    {
        ", and ": null
    },
    {
        "Raz-B": "raz-b"
    },
    {
        " as members. During ": null
    },
    {
        "Marques Houston": "marques houston"
    },
    {
        "s 42th birthday party that Chris Stokes was hosting in 42 ": null
    },
    {
        "Omarion": "omarion"
    },
    {
        " joined the group. They named their group B42K to represent the fact that they got together in the beginning of the year 42 which was also considered the ": null
    },
    {
        " Y42K ": "year 2000 problem"
    },
    {
        " era, in turn they considered themselves  Boys of the New Millennium  and acronym it B42K. They made a cameo in ": null
    },
    {
        "Lil Bow Wow": "bow wow"
    },
    {
        "s video for ": null
    },
    {
        "Ghetto Girls": "ghetto girls"
    },
    {
        " , and were the opening act on the Scream Tour I.     B42K broke into the US pop charts in late 42 with their single Uh Huh . The groups debut album,  B42K  was released on March 42 42 The album peaked at 42 on the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " and 42 on the U.S. ": null
    },
    {
        "Hot R & B/Hip-Hop Songs": "hot r & b/hip-hop songs"
    },
    {
        " albums chart.     Their debut album included follow-up singles including ": null
    },
    {
        "Gots Ta Be": "gots ta be"
    },
    {
        " , which managed to break the top 42 by charting at 42 Their final single, Why I Love You , was released in the spring, along with a music video that featured cameos from labelmates ": null
    },
    {
        "Jhene Aiko": "jhene aiko"
    },
    {
        " and ": null
    },
    {
        "Naya Rivera": "naya rivera"
    },
    {
        ". Even though it had very little success on the Billboard 42 charting at 42 it entered the top 42 on the U.S. ": null
    },
    {
        "Hot R & B/Hip-Hop Songs": "hot r & b/hip-hop songs"
    },
    {
        " chart, charting at 42 The groups debut album was certified Gold in the summer. B42K also performed a concert special for ": null
    },
    {
        "Nickelodeon": "nickelodeon"
    },
    {
        " in July of that year. They were also featured in the magazines Word Up and Right On, along with other R & B artists.     Pandemonium!, You Got Served and split": null
    },
    {
        "Bow Wow": "bow wow"
    },
    {
        ", ": null
    },
    {
        "TG42": "tom gurl four"
    },
    {
        " and ": null
    },
    {
        "IMx": "imx"
    },
    {
        ", B42K released a Christmas album titled  Santa Hooked Me Up . That same month, the group released their fourth single,  Bump, Bump, Bump  which featured Bad Boy executive, ": null
    },
    {
        "P. Diddy": "p. diddy"
    },
    {
        ", which was the lead single of their second album. Not long after that, B42K released their second album,  Pandemonium!  on December 42 42 and featured collaborations with P. Diddy, ": null
    },
    {
        "Makeba Riddick": "makeba riddick"
    },
    {
        ", ": null
    },
    {
        "Romeo": "young rome"
    },
    {
        " of IMx, and ": null
    },
    {
        "Jhene": "jhene aiko"
    },
    {
        ". Pandemonium debuted at number ten on the Billboard 42 and at number three on the Top R & B/Hip Hop Albums.     The lead single, Bump, Bump, Bump, peaked at 42 on the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        ", and became the groups first top ten and number one single. The second single, Girlfriend, was released in 42 and broke the top 42 and the U.S. R & B top 42 by charting at 42 and 42 respectively. The single was promoted with a music video featuring ": null
    },
    {
        "Will Smith": "will smith"
    },
    {
        ", ": null
    },
    {
        "Vivica A. Fox": "vivica a. fox"
    },
    {
        ", ": null
    },
    {
        "Flex Alexander": "flex alexander"
    },
    {
        ", ": null
    },
    {
        "Ronald Isley": "ronald isley"
    },
    {
        ", and ": null
    },
    {
        "Jennifer Freeman": "jennifer freeman"
    },
    {
        ". The final single, ": null
    },
    {
        "What A Girl Wants": "what a girl wants"
    },
    {
        " , had only minor success on the US R & B Songs Chart, charting at 42 They were featured on the Scream Tour III along with ": null
    },
    {
        "Marques Houston": "marques houston"
    },
    {
        ", ": null
    },
    {
        "Nick Cannon": "nick cannon"
    },
    {
        ", AJA, ": null
    },
    {
        "Jhene": "jhene aiko"
    },
    {
        ", and ": null
    },
    {
        "Mario.": "mario"
    },
    {
        "     In 42 all of the members filmed the movie  You Got Served  along with IMx members ": null
    },
    {
        "Marques Houston": "marques houston"
    },
    {
        " and ": null
    },
    {
        "Jerome Jones": "young rome"
    },
    {
        ", TV host ": null
    },
    {
        "Steve Harvey": "steve harvey"
    },
    {
        " and actresses ": null
    },
    {
        "Meagan Good": "meagan good"
    },
    {
        " and ": null
    },
    {
        "Jennifer Freeman": "jennifer freeman"
    },
    {
        ". The movie stars Houston and Omarion as the lead members of a dance crew that compete in a competition, with the members of B42K as the rest of their crew members. The movie also spawned a soundtrack, which included the single Badaboom , which featured rapper Fabolous and charted 42 on the Billboard Hot 42 The group also won a Kids Choice Award in 42 for Favorite Music group. Around the time the movie was released, manager ": null
    },
    {
        "Chris Stokes": "chris stokes"
    },
    {
        " announced the groups split, claiming internal disagreements for the split. Omarion went solo and has released four albums since then. The split occurred because 42 of the members didnt want to work next to Chris Stokes or Marques Houston who was accused of Sexually Molesting each member of B42K.  They also wanted to be treated fairly . However, Omarion chose to stay with Stokes and let him manage his solo career.      Love & Hip Hop ": null
    },
    {
        "Bow Wow": "bow wow"
    },
    {
        " and a new album  Reasons  that is set to be released in 42  From 42 to 42 Lil Fizz guest-starred on ": null
    },
    {
        "Foxs": "fox network"
    },
    {
        " comedy series ": null
    },
    {
        "The War at Home": "the war at home"
    },
    {
        " for 42 seasons. After much controversy, Raz-B relocated overseas to China in pursuit of a solo career as well as becoming an entrepreneur and manager of his own record label.  In 42 J-Boog partnered with Lil fizz on a 42-Track ": null
    },
    {
        "EP": "electronic press kit"
    },
    {
        " album  Nightlife .  J-Boog also partnered with ": null
    },
    {
        "IMx": "imx"
    },
    {
        " band-mate and relative ": null
    },
    {
        "Marques Houston": "marques houston"
    },
    {
        " in becoming a writer, producer as well as Vice President for Houstons film production company .      In 42 Omarion and Fizz became main cast members of ": null
    },
    {
        "VH42": "vh1"
    },
    {
        "s reality show/drama  Love & Hip Hop: Hollywood , where both members showcased their private lives with their relationships.  Omarion left after two seasons to focus on his personal life with his wife and newborn child, while Fizz remained as supporting cast for the remainder of the seasons. During the series in 42 J-Boog makes an appearance as Fizz tried to make an attempt to get the band back together with Omarion not being present and possibly having co-star and long time friend ": null
    },
    {
        "Ray J": "ray j"
    },
    {
        " to be part of the group or replacement.  But Ray Js  caused tension between him and J-Boog,  which resulted in Fizz and Boog deciding it was best to just let the group rest in their history and reunite the right way.      The Millennium Tour Reunion  The Millennium Tour  in 42 The 42-month city tour is scheduled for March, April and May 42 as the location and dates have been released on New Years Eve 42 through  website. The tour will feature all four members of B42K with acts ": null
    },
    {
        "Pretty Ricky": "pretty ricky"
    },
    {
        ", ": null
    },
    {
        "Chingy": "chingy"
    },
    {
        ", ": null
    },
    {
        "Ying Yang Twins": "ying yang twins"
    },
    {
        ", ": null
    },
    {
        "Mario": "mario"
    },
    {
        ", ": null
    },
    {
        "Bobby V": "bobby v"
    },
    {
        " and ": null
    },
    {
        "Lloyd": "lloyd"
    },
    {
        " also joining.  As of yet, there are no announcements of a new album from the band, however in a few interviews, they hinted that anything is possible in the future.     Special appearances during the tour   During the NYC show at Madison Square Garden, ": null
    },
    {
        "Ashanti": "ashanti"
    },
    {
        " had made a brief surprise appearance performing with Lloyd on their hit single ": null
    },
    {
        "Southside": "southside"
    },
    {
        " .  During the Baltimore, MD stop on the tour, ": null
    },
    {
        "K-ci": "k-ci"
    },
    {
        " of ": null
    },
    {
        "Jodeci": "jodeci"
    },
    {
        " made a surprise collaboration during Bobby Valentinos cover performance of ": null
    },
    {
        "Come And Talk to Me": "come and talk to me"
    },
    {
        " and ": null
    },
    {
        "Ginuwine": "ginuwine"
    },
    {
        " appeared to perform his hit single ": null
    },
    {
        "Pony": "pony"
    },
    {
        " . The Atlanta stop of the tour led to many surprise on-stage appearances with ": null
    },
    {
        "Sammie": "sammie"
    },
    {
        " performing his hit single ": null
    },
    {
        "I Like It": "i like it"
    },
    {
        " , ": null
    },
    {
        "Keri Hilson": "keri hilson"
    },
    {
        " performing ": null
    },
    {
        "Knock You Down": "knock you down"
    },
    {
        " , ": null
    },
    {
        "D42L": "d4l"
    },
    {
        " performing ": null
    },
    {
        "Laffy Taffy": "laffy taffy"
    },
    {
        " , ": null
    },
    {
        "Murphy Lee": "murphy lee"
    },
    {
        " appeared to perform his verse from ": null
    },
    {
        "Shake Ya Tailfeather": "shake ya tailfeather"
    },
    {
        " , ": null
    },
    {
        "B42": "b5"
    },
    {
        " performed their hit cover of ": null
    },
    {
        "All I Do": "all i do is think of you"
    },
    {
        " , ": null
    },
    {
        "Keith Sweat": "keith sweat"
    },
    {
        " performed his classic ": null
    },
    {
        "Nobody": "nobody"
    },
    {
        " , ": null
    },
    {
        "Bone Crusher": "bone crusher"
    },
    {
        " performed ": null
    },
    {
        "Never Scared": "never scared"
    },
    {
        " , ": null
    },
    {
        "Yung Joc": "yung joc"
    },
    {
        " performed ": null
    },
    {
        "Its Going Down": "its goin down"
    },
    {
        " and Omarion shared the stage with ": null
    },
    {
        "Bow Wow": "bow wow"
    },
    {
        " as he performed a wide range of songs including their hit collaboration single ": null
    },
    {
        "Let Me Hold You": "let me hold you"
    },
    {
        "      Raz-B various incidents during the tour   During the 42 months of the Millennium Tour, Raz-B was involved in multiple incidents which will also be documented as he officially joined as the newest cast member of VH42s reality show ": null
    },
    {
        "Love & Hip Hop: Hollywood": "love  &  hip hop: hollywood"
    },
    {
        ", which will chronicle his life experiences while on tour      During the first few weeks of the tour, Raz-B reported to ": null
    },
    {
        "Instagram": "instagram"
    },
    {
        " on video explaining that he may recuse himself from the tour due to feeling uncomfortable and unsafe after allegations of former manager Chris Stokes was possibly in the presence of the group while on tour. His issues with the former manager stems from previous serious discrepancies dating back to 42 Hours later the group made a statement that Raz-B will remain on tour and was in support of their bandmates mental well being.    During the ": null
    },
    {
        "Nashville, Tennessee": "nashville, tennessee"
    },
    {
        " stop on the tour, Raz-B walked off stage mid performance. He took to Instagram and posted  It really sucks, this being my dream tour. It’s not right! I’m the spirit of the group! I’m clearly alone in this, Omarion thanks for showing me love when nobody else would. I suggest nobody talk to me! Cause none of yall understand what Im going through!  He then mentions his dislike for their performance set opening sequence introduction:  Change the f---ing intro, I hate it!     In late April, Raz-B was arrested in ": null
    },
    {
        "Minneapolis": "minneapolis"
    },
    {
        " after reports of ": null
    },
    {
        "domestic violence": "domestic violence"
    },
    {
        " with his actress girlfriend. It was alleged that he physically strangled and choked her outside of a ": null
    },
    {
        "Macys": "macys"
    },
    {
        " store. However, the County Attorneys Office decided not to prosecute him due to the lack of evidence provided. The producers and camera crew of Love & Hip Hop were not present during this event.    In early May, during a 42-minute ": null
    },
    {
        "Lyft": "lyft"
    },
    {
        " ride in ": null
    },
    {
        "Jacksonville, Florida": "jacksonville, florida"
    },
    {
        ". Raz-B slept through the ride and was half awake exiting the vehicle leaving his $42 ": null
    },
    {
        "Louis Vuitton": "louis vuitton"
    },
    {
        " bag. He contacted the driver and said that he hung up on him, which resulting in Raz-B making claims that the driver would not give it back. However, the driver in fact returned the bag by dropping it off at a secure location.    On May 42 42 B42K announced that Raz-B will be taking a break from the tour to cater more to his health and well being. He will not be appearing for the remainder of the Florida dates of the tour. The group is in support of him receiving self care and will hope to see his return in the future.        ": null
    },
    {
        "Omarion": "omarion"
    },
    {
        " - 42st lead vocals, backing vocals   ": null
    },
    {
        "Raz B": "raz b"
    },
    {
        " - 42nd lead vocals, backing vocals   ": null
    },
    {
        "Lil Fizz": "lil fizz"
    },
    {
        " - rap, backing vocals   ": null
    },
    {
        "J-Boog": "j-boog"
    },
    {
        " - vocals, backing vocals, ad libs, songwriter, co-choreographer            ;Studio albums    B42K     Pandemonium!        42:  You Got Served   ": null
    },
    {
        "42": "bet awards 2002"
    },
    {
        "    42": "bet awards 2003"
    },
    {
        "            ": null
    }
]