[
    {
        "         The Arab Socialist Baath Party  was a political party founded in ": null
    },
    {
        "Syria": "syria"
    },
    {
        " by ": null
    },
    {
        "Michel Aflaq": "michel aflaq"
    },
    {
        ", ": null
    },
    {
        "Salah al-Din al-Bitar": "salah al-din al-bitar"
    },
    {
        ", and associates of ": null
    },
    {
        "Zaki al-Arsuzi": "zaki al-arsuzi"
    },
    {
        ". The party espoused ": null
    },
    {
        "Baathism": "baathism"
    },
    {
        " , which is an ideology mixing ": null
    },
    {
        "Arab nationalist": "arab nationalism"
    },
    {
        ", ": null
    },
    {
        "pan-Arabism": "pan-arabism"
    },
    {
        ", ": null
    },
    {
        "Arab socialist": "arab socialism"
    },
    {
        ", and ": null
    },
    {
        "anti-imperialist": "anti-imperialism"
    },
    {
        " interests. Baathism calls for unification of the ": null
    },
    {
        "Arab world": "arab world"
    },
    {
        " into a single state. Its motto, Unity, ": null
    },
    {
        "Liberty": "liberty"
    },
    {
        ", ": null
    },
    {
        "Socialism": "socialism"
    },
    {
        " , refers to Arab unity, and freedom from non-Arab control and interference.     The party was founded by the merger of the ": null
    },
    {
        "Arab Baath Movement": "arab baath movement"
    },
    {
        ", led by Aflaq and al-Bitar, and the ": null
    },
    {
        "Arab Baath": "arab baath"
    },
    {
        ", led by al-Arsuzi, on 42 April 42 as the Arab Baath Party. The party quickly established branches in other Arab countries, although it would only hold power in ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        " and ": null
    },
    {
        "Syria": "syria"
    },
    {
        ". The Arab Baath Party merged with the ": null
    },
    {
        "Arab Socialist Movement": "arab socialist movement"
    },
    {
        ", led by ": null
    },
    {
        "Akram al-Hawrani": "akram al-hawrani"
    },
    {
        ", in 42 to form the Arab Socialist Baath Party. The newly formed party was a relative success, and became the second-largest party in the Syrian parliament in the ": null
    },
    {
        "42 election": "1954 syrian parliamentary election"
    },
    {
        ". This, coupled with the increasing strength of the ": null
    },
    {
        "Syrian Communist Party": "syrian communist party"
    },
    {
        ", led to the establishment of the ": null
    },
    {
        "United Arab Republic": "united arab republic"
    },
    {
        " , a union of Egypt and Syria. The union would prove unsuccessful, and a Syrian coup in 42 dissolved it.     Following the break-up of the UAR, the Baath Party was reconstituted. However, during the UAR, military activists had established the Military Committee to take control of the Baath Party from civilian hands. In the meantime, in Iraq, ": null
    },
    {
        "the local Baath Party branch": "arab socialist baath party – iraq region"
    },
    {
        " had taken power by orchestrating and leading the ": null
    },
    {
        "Ramadan Revolution": "ramadan revolution"
    },
    {
        ", only to ": null
    },
    {
        "lose power a couple of months later": "november 1963 iraqi coup détat"
    },
    {
        ". The Military Committee, with Aflaqs consent, took power in Syria in the ": null
    },
    {
        "42th of March Revolution": "1963 syrian coup détat"
    },
    {
        " of 42     A power struggle quickly developed between the civilian faction led by Aflaq, al-Bitar, and ": null
    },
    {
        "Munif al-Razzaz": "munif razzaz"
    },
    {
        " and the Military Committee led by ": null
    },
    {
        "Salah Jadid": "salah jadid"
    },
    {
        " and ": null
    },
    {
        "Hafez al-Assad": "hafez al-assad"
    },
    {
        ". As relations between the two factions deteriorated, the Military Committee initiated the ": null
    },
    {
        "42 Syrian coup détat": "1966 syrian coup détat"
    },
    {
        ", which ousted the National Command led by al-Razzaz, Aflaq, and their supporters. The 42 coup split the Baath Party between the ": null
    },
    {
        "Iraqi-dominated Baath movement": "baath party"
    },
    {
        " and the ": null
    },
    {
        "Syrian-dominated Baath movement": "baath party"
    },
    {
        ".               The party was founded on 42 April 42 as the Arab Baath Party by ": null
    },
    {
        "Michel Aflaq": "michel aflaq"
    },
    {
        " , ": null
    },
    {
        "Salah al-Din al-Bitar": "salah al-din al-bitar"
    },
    {
        " , and the followers of ": null
    },
    {
        "Zaki al-Arsuzi": "zaki al-arsuzi"
    },
    {
        "  in ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ", Syria, leading to the establishment of the ": null
    },
    {
        "Syrian Regional Branch": "arab socialist baath party – syria region"
    },
    {
        ". Other regional branches were established throughout the Arab world in the later 42s and early 42s, in, among others, ": null
    },
    {
        "Iraq": "arab socialist baath party – iraq region"
    },
    {
        ", ": null
    },
    {
        "Yemen": "arab socialist baath party – yemen region"
    },
    {
        " and ": null
    },
    {
        "Jordan": "jordanian arab socialist baath party"
    },
    {
        ". Throughout its existence, the National Command , gave most attention to Syrian affairs. The 42nd National Congress was convened in June 42 and elected a seven-man National Command; Aflaq, Bitar, and ": null
    },
    {
        "Akram al-Hawrani": "akram al-hawrani"
    },
    {
        " were elected and represented the Syrian Regional Branch, while ": null
    },
    {
        "Abdullah Rimawi": "abdullah rimawi"
    },
    {
        " and Abdallah Nawas were elected to represent the Jordanian Branch. The congress is notable for sanctioning the merger of the ": null
    },
    {
        "Arab Socialist Movement": "arab socialist movement"
    },
    {
        " and the Baath Party, which took place in 42     The Syrian Regional Branch rose to prominence in the 42s and 42s; in the ": null
    },
    {
        "42 parliamentary elections": "1954 syrian parliamentary election"
    },
    {
        " the Syrian Regional Branch won 42 seats in parliament, becoming the second largest party in the country. 42 percent of Baath Party members who stood for elections were elected to parliament. The failure of the traditional parties represented by the ": null
    },
    {
        "Peoples Party": "peoples party"
    },
    {
        " and the ": null
    },
    {
        "National Party": "national party"
    },
    {
        ", strengthened the Baath Partys public credibility. Through this position, the party was able to get two of its members into the cabinet; Bitar was appointed ": null
    },
    {
        "Minister of Foreign Affairs": "ministry of foreign affairs and expatriates"
    },
    {
        " and Khalil Kallas became Minister of Economics. Its new, strengthened position, was used successfully to garner support for Syrias merger with ": null
    },
    {
        "Gamal Abdel Nasser": "gamal abdel nasser"
    },
    {
        "s Egypt, which led to the establishment of the ": null
    },
    {
        "United Arab Republic": "united arab republic"
    },
    {
        " in 42     On 42 June 42 ": null
    },
    {
        "Fuad al-Rikabi": "fuad al-rikabi"
    },
    {
        ", the Regional Secretary of the Iraqi Regional Branch, accused the National Command of betraying Arab nationalist principles by conspiring against the UAR. In light of these criticisms, the Baath convened the 42rd National Congress , which was attended by delegates from Iraq, Lebanon, Jordan, South Arabia, the Gulf, Arab South, Arab Maghreb, Palestine and Party student organisations in Arab and other universities outside the homeland . The congress is notable for endorsing the dissolution of the Syrian Regional Branch, which had been decided by Aflaq and Bitar without inner-party consultation in 42 and for expelling Rimawi, the Regional Secretary of the Jordanian Regional Branch. Rimawi reacted to his expulsion by forming his own party, the ": null
    },
    {
        "Arab Socialist Revolutionary Baath Party": "arab socialist revolutionary baath party"
    },
    {
        ", which established a rival National Command to compete with the original. The National Command responded to the problems in Iraq by appointing a Temporary Regional Command on 42 February 42 which appointed ": null
    },
    {
        "Talib El-Shibib": "talib el-shibib"
    },
    {
        " as Regional Secretary, and on 42 June 42 the National Command expelled Rikabi from the party.     In Iraq, the Iraqi Regional Branch had supported ": null
    },
    {
        "Abd al-Karim Qasim": "abd al-karim qasim"
    },
    {
        "s seizure of power and its ensuing abolishment of the Iraqi Monarchy. The Iraqi Baathists supported Qasim on the ground that they believed he would enter Iraq into the UAR, enlarging the Arab nationalist republic. However, this was proven to be a ruse, and after taking power Qasim launched an Iraq first policy. In retaliation, the Baath Party tried to assassinate Qasim in February 42 but the operation  failed. Qasim was overthrown in the ": null
    },
    {
        "Ramadan Revolution": "ramadan revolution"
    },
    {
        " led by young Baathist officer ": null
    },
    {
        "Ahmed Hassan al-Bakr": "ahmed hassan al-bakr"
    },
    {
        ", and rumoured to be supported by the American ": null
    },
    {
        "Central Intelligence Agency": "central intelligence agency"
    },
    {
        " . Declassified documents and the testimony of former CIA officers indicate there was no direct American involvement, although the CIA had been previously notified of an earlier Baathist coup plot in July 42 by a high-ranking informant within the Party. The CIA official working with ": null
    },
    {
        "Archie Roosevelt, Jr.": "archibald bulloch roosevelt jr."
    },
    {
        " on a separate plan to instigate a military coup against Qasim, and who later became the head of the CIAs operations in Iraq and Syria from late 42 to June 42 has denied any involvement in the Baath Partys actions.  The Iraqi Regional Branch, when it took power, was so riven by factionalism that its purported allies launched a counter-coup forcing them out of power in November 42     The 42th National Congress, held in August 42 criticized the leadership of Aflaq and Bitar, called for the reestablishment of the Syrian Regional Branch and deemphasized the partys commitment to Arab nationalism while emphasizing more the socialist character of the party. A year after, at the UARs nadir in Syria, the Syrian General ": null
    },
    {
        "Abd al-Karim al-Nahlawi": "abd al-karim al-nahlawi"
    },
    {
        " launched a coup on 42 September 42 which led to the reestablishment of the Syrian Arab Republic.        The challenges of building a Baathist state led to considerable ideological discussion and internal struggle within the party. The Iraqi Regional Branch was increasingly dominated by Ali Salih al-Sadi, a self-described ": null
    },
    {
        "Marxist": "marxism"
    },
    {
        ". He was supported in his ideological reorientation by ": null
    },
    {
        "Hammud al-Shufi": "hammud al-shufi"
    },
    {
        ", the Regional Secretary of the Syrian Regional Branch,  Yasin al-Hafiz, one of the party’s few ideological theorists, and by certain members of the secret Military Committee. The Marxist-wing gained new ground at the 42th National Congress , in which the Iraqi and Syrian regional branches called for the establishment of socialist planning , ": null
    },
    {
        "collective farms": "collective farming"
    },
    {
        " run by peasants , workers democratic control of the means of production , and other demands reflecting a certain emulation of ": null
    },
    {
        "Soviet-style socialism": "ideology of the communist party of the soviet union"
    },
    {
        ". Aflaq, angry at this transformation of his party, retained a nominal leadership role, but the National Command as a whole came under the control of the radicals.     In 42 the Baath Party seized power, from then on the Baath functioned as the only officially recognized Syrian political party, but factionalism and splintering within the party led to a succession of governments and new constitutions. On 42 February 42 ": null
    },
    {
        "a coup détat": "1966 syrian coup détat"
    },
    {
        " led by ": null
    },
    {
        "Salah Jadid": "salah jadid"
    },
    {
        ", the informal head of the Military Committee, overthrew Aflaq and the Bitars cabinet. The coup sprung out of factional rivalry between Jadids regionalist camp, which promoted ambitions for a ": null
    },
    {
        "Greater Syria": "greater syria"
    },
    {
        " and the more traditionally pan-Arab, in power faction, called the nationalist faction. Jadids supporters are considered more left-wing then Aflaq and his peers. Several of Jadids opponents managed to make their escape and fled to ": null
    },
    {
        "Beirut": "beirut"
    },
    {
        ", Lebanon. Jadid moved the party in a more radical direction. Although he and his supporters had not been supporters of the victorious far-left line at the 42th Party Congress, they had now moved to adopt its positions. The moderate faction, formerly led by Aflaq and al-Bitar, were purged from the party.     While it took some years, the 42 coup resulted in the creation of two competing National Commands, ": null
    },
    {
        "one Syrian-dominated": "baath party"
    },
    {
        " and another ": null
    },
    {
        "Iraqi-dominated": "baath party"
    },
    {
        ". However, both in Iraq and Syria, the Regional Command became the real centre of party power, and the membership of the National Command became a largely honorary position, often the destination of figures being eased out of the leadership. A consequence of the split was that ": null
    },
    {
        "Zaki al-Arsuzi": "zaki al-arsuzi"
    },
    {
        " took Aflaqs place as the official father of ": null
    },
    {
        "Baathist thought": "baathism"
    },
    {
        " in the pro-Syrian Baath movement, while the pro-Iraqi Baath movement still considered Aflaq the  de jure  father of Baathist thought.       The organizational structure of the Baath Party was created at the 42nd National Congress by amending the partys Internal Regulations , which was approved at the partys 42st National Congress in 42 The organizational structure ran from top to bottom, and members were forbidden to initiate contacts between groups on the same level of the organisation—all contacts had to pass through a higher command level.          The National Command was the ruling organ of the party between sessions of the National Congress, and was headed by a Secretary-General. Between National Congresses, the National Command was held accountable by the National Consultative Council . The National Consultative Council was a forum made up of representatives from the partys regional branches. However, the number of National Consultative Council members were decided by the size of the regional branch. The National Congress elected the National Command, National Tribunal, the partys discipline body, and the Secretary-General, the party leader. The congress delegates determined the partys policies and procedures.     Before 42 the party was ruled by the Executive Committee, but this organ, along with others too, were replaced at the 42nd National Congress. In Baathist jargon Nation means the Arab Nation, because of that, the National Command formed the highest policy-making and coordinating council for the Baath movement throughout the Arab world. The National Command had several bureaus, similar to those of the Regional Command. National Command sessions were held monthly. Of these, the National Liaisons Office was responsible for maintaining contact with the partys Regional Branches.       The term region reflected the Partys refusal to acknowledge them as separate nation-states. A Region , in Baathist parlance, is an Arab state such as Syria, Iraq, or Lebanon. The Regional Congress, which combined all the provincial branches, was the regions highest authority and elected a Regional Command, the party leadership in a specific region, the Regional Tribunal, the body responsible for discipline inspection, and a Regional Secretary, the regional party leader. The Regional Congress is made of delegates from the provincial branches; other members attended, but as observers. The Regional Congress was responsible for evaluating the partys performance since the last Regional Congress, while at the same time formulating new policies for the next period, which lasts until the next Regional Congress is held. How long this period lasts is decided by the Regional Command. The Regional Command, similar to the Branch Command, operated through bureaus and met for weekly-sessions.     Below the Regional Commands there existed branches. The Branch came above the Subbranch; it comprised at least two to five subbranches, and operated at the provincial level. The branch held a congress periodically in which it elected a Command and a Secretary . The Command operated through bureaus, such as the Workers Bureau and the Bureau of the Secretariat for instance. Underneath the branch was the Subbranch, which was made up of three to five sections, and was the lowest level of the party to hold a periodical Congress.  Some subbranches were independent of central authority, and elected their own Command and secretaries, while other subbranches were incorporated into the Branches. In these cases the Subbranch Secretary is appointed by the superior Branch.     A Section, which comprised two to five Divisions, functioned at the level of a large city quarter, a town, or a rural district. It elected its own Command, composed of five members, but the Subbranch appointed the Commands secretary. Below that there existed divisions. A division comprised two to seven Circles, controlled by a Division Commander. Such Baathist groups occurred throughout the bureaucracy and the military. They functioned as the Party’s watchdog and were an effective form of covert surveillance within a public administration. The lowest level was the circle. It was composed of three to seven members, constituted the basic organizational unit.     The Military Organization was made up of branches similar to those in the Baaths civilian sector. However, unlike the civilian sector the Military Organization was controlled by a separate Military Bureau, and held periodical Military Congresses. The Military Organization and the Civilian Organization converged at the Regional Congress.       There existed three types of membership categories in the Baath Party; Active member , Apprentice Member and Supporter . An Active member had to attend all formal meetings of his party unit, was given the right to vote in party elections, and could run for party office. In the Syrian Regional Branch a member had to spend 42 months as a Supporter to be promoted to Apprentice status, and then wait another 42 months to be promoted to Active member status.                   From its very beginning, the party was a manifestation of Arab nationalist thought, with the party itself referring to itself as The Party of Arab Unity . The partys ideology also excluded and subjugated regional minorities like the Kurds, Turkmens, Assyrians and others. The pan-Arab tendencies of the partys predecessor, the ": null
    },
    {
        "Arab Baath Movement": "arab baath movement"
    },
    {
        ", was strengthened 42–42 by recruiting members from the ": null
    },
    {
        "Zaki al-Arsuzi": "zaki al-arsuzi"
    },
    {
        "s Arab Baath. The first article of the partys constitution stated the Arabs form one nation. This nation has the natural right to live in a single state. the Arab fatherland constitutes an indivisible political and economic unit. No Arab can live apart from the others.      To express his heartfelt belief in Arab nationalism, Aflaq coined the term one Arab nation with an eternal message . Party ideology, and Baathism in general, was not based on concepts such as the purity of the Arab race or ethnic chauvinism, but on idealistic thoughts borrowed from the ": null
    },
    {
        "enlightenment era": "age of enlightenment"
    },
    {
        ". According to Middle East expert Tabitha Petran, the basic idea of the partys ideology was;       that the Arab nation is a permanent entity in history. The Arab nation is considered, philosophically speaking, not as a social and economic formation, but as a transcendent fact inspiring different forms, one of its highest contributions taking the form of ": null
    },
    {
        "Islam": "islam"
    },
    {
        ". It was not Islam that modeled the peoples of Arabia, the ": null
    },
    {
        "Fertile Crescent": "fertile crescent"
    },
    {
        ", and ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ", equipping them with Islamic values, especially the Arabic language and the Arabic culture, but the Arab nation which created Islam. This conception of the Arab nation implicitly advantages the Arab contribution to history. On the other hand, Arab decadence can be overcome through a purifying and spiritual action, not religious but moral.          The early Baath gave little attention to the problems facing the peasants and workers. As ": null
    },
    {
        "Hanna Batatu": "hanna batatu"
    },
    {
        " notes, Aflaq was basically urban in outlook. The peasants never constituted an object of his special concern. In his writing there is scarcely an expression of concentrated interest in the countrys husbandsmen.  While peasants and issues facing them are mentioned in some of Aflaqs work, there was scarcely any depth given to them or the issues facing them. To take an example, in one instance Aflaq states the ... can only be based on the generality of the Arabs and these will not take part in it if they are exploited.  Secondly, Aflaq never had any official enmity towards the traditional ": null
    },
    {
        "landlord": "landlord"
    },
    {
        "s. Issues such as these would only gain prominence when ": null
    },
    {
        "Akram al-Hawrani": "akram al-hawrani"
    },
    {
        " became a leading party figure, and when the transitional Baathists took power. Of the four members in the 42st Executive Committee, ": null
    },
    {
        "Wahib al-Ghanim": "wahib al-ghanim"
    },
    {
        " was the only who paid much attention to the problems of the peasants and workers, because the other members  had a ": null
    },
    {
        "middle class": "middle class"
    },
    {
        " upbringing and upheld middle class values.     The early party organization never cultivated a deep following in rural areas. In fact, at the partys founding congress, only one peasant and one worker were present among the 42 delegates. Most of the delegates were either school teacher or students attending universities. When the ": null
    },
    {
        "Akram al-Hawrani": "akram al-hawrani"
    },
    {
        "s ": null
    },
    {
        "Arab Socialist Party": "arab socialist movement"
    },
    {
        " merged with the Baath Party, the majority of ASP members of peasants origins did not join the Baath Party, instead becoming personal followers of Hawrani. However, the majority of Baath members were of rural upbringing. The Transitional Baath , which grew out of the dissolution of the Syrian Regional Branch in 42 dissolution and the Military Committee, were more rural in outlook, policy and ideology.       The slogan Unity, liberty, socialism is the key tenet in Baathist thought. Unity stood for the creation of an independent, strong Arab Nation. ": null
    },
    {
        "Liberty": "liberty"
    },
    {
        " did not mean ": null
    },
    {
        "liberal democracy": "liberal democracy"
    },
    {
        ", but rather freedom from colonial oppression and ": null
    },
    {
        "freedom of speech": "freedom of speech"
    },
    {
        " and ": null
    },
    {
        "thought": "freedom of thought"
    },
    {
        ". Aflaq believed that the Baath Party, at least in theory, would rule, and guide the people, in a transitional period of time without consulting the people, however he did support intra-party democracy. The last tenet, socialism, did not mean socialism as it is defined in the West, but rather a unique form of ": null
    },
    {
        "Arab socialism": "arab socialism"
    },
    {
        ". According to Baathist thought, socialism had originated under the rule of ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        ". The original interpretation of Arab socialism did not answer questions such as: how much ": null
    },
    {
        "state control": "state socialism"
    },
    {
        " was necessary, or economic equality; but instead focused on freeing the Arab Nation and its people from colonization and oppression in general.         After the failure of the ": null
    },
    {
        "United Arab Republic": "united arab republic"
    },
    {
        " , a union of Egypt and Syria, the Baath Party was divided into two main factions, the Regionalists  and the Nationalists . When the union with Egypt collapsed, the Baath Party was put in a difficult position, the party still sought Arab unity, but did not oppose the UARs dissolution and did not want to seek another union with Egypt under ": null
    },
    {
        "Gamal Abdel Nasser": "gamal abdel nasser"
    },
    {
        "s rule. However, being the unionist party that it was, the partys leaders could not state their position on this issue. The end result was that the pro-Arab nationalists within the Baath Party became committed Nasserists, while the more moderate Arab nationalists founded the pro-Nasserite ": null
    },
    {
        "Socialist Unionists": "socialist unionists"
    },
    {
        " party. The third group, led by people disenchanted with both Nasser and the union period, remained in the Baath Party, stopped believing in the feasibility pan-Arabism. on 42 February 42 the National Command issued a new policy regarding the pan-Arab project by first mentioning the successes and failures of the UAR, but ending the statement by calling for the reestablishment of the UAR as a decentralized ": null
    },
    {
        "federal union": "federation"
    },
    {
        " with Nassers Egypt. Many rank-and-file members opposed this change in policy, with many members being both disenchanted with pan-Arabism and Aflaqs continued party rule.     When the Syrian Regional Branch was reestablished, the majority of its members in the provinces were of communal origins–Druze, Alawi or Ismaili. The provincial party members had not been told of the Syrian Regional Branchs dissolution, which in fact broke the communication line with provincial branches and the National Command. While its true that in 42 the Regionalists supported the slogan, adopted at the 42th National Congress, the renewal of the union with Egypt while taking note of past mistakes , they treated such a slogan as a propaganda slogan, and not as a feasible goal.       The disillusionment felt among party members on the pan-Arab project, led to the radicalization of the partys interpretation of socialism. Yasin al-Hafiz, a former member of the ": null
    },
    {
        "Syrian Communist Party": "syrian communist party"
    },
    {
        ", was an early frontrunner for the partys radicalization. While he didnt oppose the pan-Arab project, he wanted to turn the concept of Arab socialism into a ": null
    },
    {
        "scientific": "scientific socialism"
    },
    {
        " and ": null
    },
    {
        "revolutionary socialist": "revolutionary socialism"
    },
    {
        " ideology which adapted ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        " to local conditions. ": null
    },
    {
        "Jamal al-Atassi": "jamal al-atassi"
    },
    {
        ", who had been a moderate socialist for most of his life, called for the renunciation of Arab socialism in 42 and the adoption of a virtually Maxist concept of socialism by claiming that ": null
    },
    {
        "class struggle": "class conflict"
    },
    {
        " was the moving force in society.     ": null
    },
    {
        "Hammud al-Shufi": "hammud al-shufi"
    },
    {
        " became the leader of the partys Marxist faction during his short stint as Syrian Regional Secretary, literally the head of the Syrian Regional Organization. Shufi was able, due to his position as head of the Organization Bureau of the ": null
    },
    {
        "Regional Command": "regional command of the arab socialist baath party – syria region"
    },
    {
        ", to recruit several Marxist or Marxist-leaning members to the top of the Syrian Regional party hierarchy. Radical socialists led by Ali Salih al-Sadi took control of the ": null
    },
    {
        "Iraqi Regional Branch": "arab socialist baath party – iraq region"
    },
    {
        " in 42 which led to the official radicalization of the partys ideology.     The delegates at the 42th National Congress elected an Ideology Committee that was responsible to write a charter about the partys ideology. The end result was the document Points of Departure. The document, which was approved by the 42th National Congress, relegated Arab unity to a secondary role and gave socialism prominence. Marxists concepts were used interchangeably alongside Baathist ones, however, the document was reluctant in explicitly admitting that certain ideas were of Marxist origins. While the Points of Departure didnt exist a break with partys traditional ideology, it criticized the partys old guard for given Arab unity primary over socialism and their failing in turning Baathism into a comprehensive theory. While the documents says Arab unity is progressive, the reason for it being important changed. The document stated; Arab unity is an indispensable basis for the construction of a ": null
    },
    {
        "socialist economy": "socialist economics"
    },
    {
        ".  Aflaqs also believed that Arab unity was only an intermediate goal, but it stood at the centre of classical Baathism. In the Points of Departure, despite not firmly stating it, the goal of creating a socialist society seemed to be both an immediate goal and the main goal of the party.     The concept of Arab socialism, accused of being narrow-minded and nationalistic, was replaced with the Arab road to socialism concept. The Points of Departure criticized the classical Baathist view regarding ": null
    },
    {
        "private ownership": "private property"
    },
    {
        ". Classical Baathists supported private ownership as a way to recruit into the party many ": null
    },
    {
        "petty bourgeois": "petite bourgeoisie"
    },
    {
        " elements. The document called for ": null
    },
    {
        "nationalization": "nationalization"
    },
    {
        " of the commanding heights of the economy, the slow incorporation of the petty bourgeoisie into the socialist economy and the elimination of the ": null
    },
    {
        "national bourgeoisie": "bourgeoisie"
    },
    {
        " and its allied classes. To safeguard the party from evolving into one supporting ": null
    },
    {
        "state capitalism": "state capitalism"
    },
    {
        ", the socialist economy would be controlled by a ": null
    },
    {
        "vanguard party": "vanguardism"
    },
    {
        " together with popular participation from the toiler masses.          ": null
    },
    {
        "Neo-Baathism": "baathismneo-baathism"
    },
    {
        " is the dramatic changes that manifested in Baathist ideology from 42 to 42 and the Military Committees takeover of the Syrian Regional Branch and the National Command in the period 42 to 42 The 42th National Congress signified the takeover of the party by an anti-militarist left, which opposed both the traditional leaders in the National Command and the pragmatists in the Military Committee. When the anti-military left called for ": null
    },
    {
        "popular democracy": "popular democracy"
    },
    {
        ", no involvement of the military in national politics and popular struggle, the Military Committee became concerned. By 42 the anti-military leftists began to spread rumors about the rightist character of the military junta within the party and their subversive efforts to engulf it. There was not a single officer in the party who was not accused of conspiracy and reactionary tendencies.  In collaboration with the National Command the Military Committee succeeded in expelling the anti-military left from the party at the 42th National Congress. The Military Committee, which now controlled the Syrian Regional Branch, took control of the Baath Party in the ": null
    },
    {
        "coup of 42": "1966 syrian coup détat"
    },
    {
        ". According to Middle East expert Avraham Ben-Tzur the ath in its latest variant is a bureaucratic apparatus headed by the military, whose daily life and routine are shaped by the rigid military oppression on the home front, and military aid.             ": null
    },
    {
        "Fuad al-Rikabi": "fuad al-rikabi"
    },
    {
        " founded the Iraqi Regional Branch in 42 or 42 There are those who trace the branchs founding to Abd ar Rahman ad Damin and Abd al Khaliq al Khudayri in 42 after their return from the 42st National Congress, which was held in Syria.  Another version is that the branch was established in 42 by Rikabi and Sadun Hamadi, a ": null
    },
    {
        "Shia": "shia islam"
    },
    {
        " Muslim": "muslim"
    },
    {
        ". However, Efraim Karsh and Inari Rautsi contend that the Regional Branch was established in the 42s, but that it received official recognition as a Regional Branch of the Baath Party in 42 by the National Command. What is certain is that Rikabi was elected the Regional Branchs first Regional Secretary in 42     The party initially consisted of a majority of Shia Muslims, as Rikabi recruited supporters mainly from his friends and family, but slowly became ": null
    },
    {
        "Sunni": "sunni islam"
    },
    {
        " dominated. The Regional Branch, and other parties of pan-Arab inclination, had difficulties in recruiting Shia members. Most Shiites considered pan-Arab ideology as a Sunni project, since the majority of Arabs are Sunnis.     At the time of ": null
    },
    {
        "42 July Revolution": "14 july revolution"
    },
    {
        " in 42 which overthrew the ": null
    },
    {
        "Hashemite monarchy": "kingdom of iraq"
    },
    {
        ", the Regional Branch had 42 members. The Iraqi Regional Branch supported ": null
    },
    {
        "Abd al-Karim Qasim": "abd al-karim qasim"
    },
    {
        "s rule on the grounds that he would seek Iraqs entry into the ": null
    },
    {
        "United Arab Republic": "united arab republic"
    },
    {
        ". Of the 42-members of Qasims cabinet, 42 of them were Regional Branch members. After taking power, Qasims change his position on the UAR, reverting to the old Iraq first policy . This turn displeased the Regional Branch and other Arab nationalists groups. Because of his policy reversal, the Regional Branch gathered a group, led by ": null
    },
    {
        "Saddam Hussein": "saddam hussein"
    },
    {
        ", which tried but failed to assassinate Qasim.     The Regional Branch seized power in the ": null
    },
    {
        "Ramadan Revolution": "ramadan revolution"
    },
    {
        ". The coup was led by leading Regional Branch member ": null
    },
    {
        "Ahmed Hassan al-Bakr": "ahmed hassan al-bakr"
    },
    {
        ". The plotters appointed ": null
    },
    {
        "Abdul Salam Arif": "abdul salam arif"
    },
    {
        ", a Nasserite, to the ": null
    },
    {
        "Presidency": "president of iraq"
    },
    {
        " while al-Bakr was appointed the ": null
    },
    {
        "countrys Prime Minister": "prime minister of iraq"
    },
    {
        ". However, real power was in the hands of Ali Salih al-Sadi, the branchs Regional Secretary. After taking power, the Regional Branch through its militia, the National Guard, initiated what Iraqi expert Con Coughlin referred to as an orgy of violence against ": null
    },
    {
        "communist": "communism"
    },
    {
        " and ": null
    },
    {
        "left-wing": "left-wing politics"
    },
    {
        " elements. These repressive measures coupled with factionalism within the Regional Branch led to the ": null
    },
    {
        "November 42 Iraqi coup détat": "november 1963 iraqi coup détat"
    },
    {
        " by President Arif and his Nasserite supporters. Iraq expert Malik Mufti believes Aflaq may have supported Arifs coup because it weakened al-Sadis position within the party and strengthened his own. The coup forced the branch to go underground. Because of the coup, several leading Baathist were jailed, such as al-Bakr and Saddam. Despite this, the Regional Branch elected al-Bakr as Regional Secretary in 42          Following the partys establishment in Syria, Baathist ideas spread throughout the Arab world. In Jordan Baathist thought first spread to the ": null
    },
    {
        "East Bank": "transjordan"
    },
    {
        " in the late42s, most notably at universities. While the Regional Branch was not formed until 42 several meetings took place at the universities where students and professors alike would discuss the Baathist thought. Despite the ideology being very popular, it took time before the actual Regional Branch was established. A group of teachers established the Regional Branch in the city by ": null
    },
    {
        "Al-Karak": "al-karak"
    },
    {
        ". At the very beginning, the clinic owned by Abd al-Rahman Shuqyar was used as the branchs meeting place. Bahjat Abu Gharbiyah became the Regional Branchs first member in the ": null
    },
    {
        "West Bank": "west bank"
    },
    {
        ", and was thus resigned the responsibility of building the partys organization in the area the branch secretary in the West Bank, and was thus responsible in that area. In the West Bank, the branch was most active in the cities of ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " and ": null
    },
    {
        "Ramallah": "ramallah"
    },
    {
        ".     The 42st Regional Congress was held in 42 in the home of ": null
    },
    {
        "Abdullah Rimawi": "abdullah rimawi"
    },
    {
        ". The congress mapped out the future course of the party . The next year, the 42nd Regional Congress was held, this time in Abdallah Nawas home. It elected a Regional Command and appointed Rimawi as the branchs Regional Secretary. Shugyar, Gharbiyah and Nawas agreed to serve in the Regional Branchs Central Committee. Rimawi and Nawas, his deputy, would prove effective leaders. Shortly after the 42nd Regional Congress, the branch launched a successful recruitment campaign in Jordanian and Palestinian neighbourhoods and cities. On 42 August 42 the branch was legalized by a High Court.     Both Rimawi and Nawas were ": null
    },
    {
        "elected to Parliament": "parliament of jordan"
    },
    {
        " in the ": null
    },
    {
        "42": "1950 jordanian general election"
    },
    {
        " and ": null
    },
    {
        "42 elections": "1951 jordanian general election"
    },
    {
        " as ": null
    },
    {
        "independents": "independent"
    },
    {
        " . In the 42 election, the branch managed to elect three members to parliament. Rimawi was able to retain his seat in parliament until the ": null
    },
    {
        "42 election": "1956 jordanian general election"
    },
    {
        ". None of these elections can be considered democratic. Shuqyar, during the 42 elections, was imprisoned by the authorities because his views were deemed to radical. Less than a month before the election day, the British Embassy in Amman had estimated that Shuqyar would gain an easy victory. However, because of the undemocratic nature of the election, Shuqyar was not elected. As voting patterns would prove, voters who voted for Baathist candidates lived in ": null
    },
    {
        "Irbid": "irbid"
    },
    {
        " and ": null
    },
    {
        "Amman": "amman"
    },
    {
        " on the East Bank, and Jerusalem and ": null
    },
    {
        "Nablus": "nablus"
    },
    {
        " on the West Bank.     Shuqyar during a government-imposed exile to Southern Jordan, used his spare time reading Marxist and ": null
    },
    {
        "Leninist": "leninism"
    },
    {
        " literature. While he never became a communist, Shuqyar began to support communist concepts. On his return from exile he tried to persuade the Regional Branch to join in an electoral front with the ": null
    },
    {
        "Jordanian Communist Party": "jordanian communist party"
    },
    {
        ". However, the Regional Branch leaders Rimawi, Nawas, Gharbiyah and ": null
    },
    {
        "Munif al-Razzaz": "munif al-razzaz"
    },
    {
        " opposed such an idea, and because of it, Shuqyar left the Baath Party.     Rimawi and Nawas were elected to the National Command at the 42nd National Congress . At the 42th and 42th National Congress, the Regional Branch elected Razzaz to the National Command.          The Lebanese Regional Branch was formed in 42–42 During the existence of the UAR, the Regional Branch was split into two factions, those supporting Nasser and those opposing him. However, in April 42 the UAR denied the Regional Branch organ As Sahafäh access into the UAR-ruled Syria.     The Regional Branch was strongest in the city of ": null
    },
    {
        "Tripoli": "tripoli, lebanon"
    },
    {
        ". In the ": null
    },
    {
        "42 elections": "1960 lebanese general election"
    },
    {
        ", ": null
    },
    {
        "Abd al-Majid al-Rafei": "abd al-majid al-rafei"
    },
    {
        " was just a few votes short of being elected to parliament. However, a persistent problem for him during his election campaign was the vocal criticism of him and the Regional Branch by the ": null
    },
    {
        "Lebanese Communist Party": "lebanese communist party"
    },
    {
        ". In Tripoli the Communists supported the candidacy of ": null
    },
    {
        "Rashid Karami": "rashid karami"
    },
    {
        ", to ensure themselves of a Regional Branch victory. On 42 July 42 a group of rival Baathists led by Rimawi opened fire on several of the Regional Branchs members.     During the UAR years, the same factional lines that developed in the Syrian Regional Branch came to the Lebanese Regional Branch. At the 42th National Congress , which was mainly attended by delegates representing Lebanon, several resolutions with a pronounced anti-Nasser tone were approved. At the same time, criticism of Aflaq and Bitar was severe, both their leadership records and their ideology were criticized. A resolution was approved, which stated that the party leaders Aflaq, al-Bitar among others had to hastily entered into a union with Egypt, had wrongly dissolved the Syrian Regional Branch in 42 given pan-Arabism primacy when socialism was the more important, the need to use Marxist, not Baathi, tools to analyze the current situation and the need for the party to strengthen their positions amongst the popular classes–the workers, peasants, artisans and shopkeepers. Because of the position of the Lebanese Regional Branch, Aflaq at the 42th National Congress invited enough Iraqi Regional Branch delegates to neutralize the Lebanese delegates. However, at the same time, the Lebanese Regional Branch opposed Hawrani and his faction. At the 42th National Congress, the Lebanese Regional Branch elected Jubrän Majdalani and Khalid al-Ali to the National Command.     At the 42th National Congress the National Command in collaboration with the Military Committee either expelled or removed leftists such as those found in the Lebanese Regional Branch from leadership position, and in the most severe cases, expelled them from the party. The Lebanese Regional Branch managed to elect three members to the National Command at the 42th National Congress; Majdalani, al-Ali and Abd al-Majid Rafi.          The Regional Branch was founded in the 42s by Amr Taher Deghayes. Baathism was a major political force in Libya following the establishment of the ": null
    },
    {
        "United Arab Republic": "united arab republic"
    },
    {
        ". Many intellectuals were attracted to Baathist ideology during the later years of the ": null
    },
    {
        "Kingdom of Libya": "kingdom of libya"
    },
    {
        ". However, with help from Nasserist propaganda, several Baathists changed affiliation and became Nasserists instead. The growth of these pan-Arab ideologies concerned the government, which led to the incarceration of several Nasserist and Baathist military officers in the early sixties. The Baathist were accused of working to overthrow the political, economic and social system of the Kingdom; the sentences ranged from everything to eight months to two years. By 42 the Libyan Regional Branch had only managed to establish one-level below the Regional Command, the branch-level. Syrian specialist John Devlin estimated that the Libyan Regional Branch had been 42 and 42 members in 42          Syrian politics took a dramatic turn in 42 when the military government of ": null
    },
    {
        "Adib Shishakli": "adib shishakli"
    },
    {
        " was overthrown and the democratic system restored. The Baath, now a large and popular organisation, won 42 out of 42 parliamentary seats in the ": null
    },
    {
        "Syrian election": "1954 syrian parliamentary election"
    },
    {
        " that year, becoming the second-largest party in parliament. Aside from the ": null
    },
    {
        "Syrian Communist Party": "syrian communist party"
    },
    {
        " , the Baath Party was the only party able to organise mass protests among workers. The party was supported by the ": null
    },
    {
        "intelligentsia": "intelligentsia"
    },
    {
        " due to their pro-Egyptian and ": null
    },
    {
        "anti-imperialist": "anti-imperialism"
    },
    {
        " stance along with their advocation of social reform.     The Baath faced considerable competition from ideological competitors, notably the ": null
    },
    {
        "Syrian Social Nationalist Party": "syrian social nationalist party"
    },
    {
        " , which supported the establishment of a ": null
    },
    {
        "Greater Syria": "greater syria"
    },
    {
        ". The Baath Partys main adversary was the SCP, whose support for class struggle and internationalism was anathema to the Baath. In addition to parliamentary-level competition, all these parties  competed in street-level activity and sought to recruit support among the military.     By the end of 42 the SCP was able to weaken the Baath Party to such an extent that the Baath Party drafted a bill in December that called for a union with Egypt, a move that proved to be very popular. The Baath leadership dissolved the party in 42 gambling that the illegalisation of certain parties would hurt the SCP more than it would the Baath.        A ": null
    },
    {
        "military coup": "1961 syrian coup détat"
    },
    {
        " in ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        " in 42 brought the UAR to an end. Sixteen prominent politicians signed a statement supporting the coup, among them al-Hawrani and ": null
    },
    {
        "Salah al-Din al-Bitar": "salah al-din al-bitar"
    },
    {
        " . Following the UARs dissolution, the Baath Party was reestablished at the 42 congress. The Military Committee did not show itself to the civilian wing of the party at this congress. During the congress, Aflaq and the Military Committee, through ": null
    },
    {
        "Muhammad Umran": "muhammad umran"
    },
    {
        ", made contact for the first time; the committee asked for permission to initiate a coup détat; Aflaq supported the conspiracy.     Following the success of the ": null
    },
    {
        "Ramadan Revolution": "ramadan revolution"
    },
    {
        ", led by the Baath Partys ": null
    },
    {
        "Iraqi Regional Branch": "arab socialist baath party – iraq region"
    },
    {
        ", the Military Committee hastily convened to hatch a coup against ": null
    },
    {
        "Nazim al-Kudsi": "nazim al-kudsi"
    },
    {
        "s presidency. The ": null
    },
    {
        "42 March Revolution": "1963 syrian coup détat"
    },
    {
        " proved successful, and a Baathist government in Syria was established. The plotters first order was to establish the ": null
    },
    {
        "National Council for the Revolutionary Command": "national council for the revolutionary command"
    },
    {
        " , consisting entirely of Baathists and Nasserists, and controlled by military personnel rather than civilians from the very beginning.     While the Baath Party had attained power, there was a problem; internal infighting. The Military Committee, which was itself a tiny minority of the already small Baath Party membership, was forced to rule by force. The Baath Party had only 42 members by mid42 the party lacked a popular base. Even if membership expanded, the authoritarian way of ruling it had introduced when coming to power would get worse, not better.     Another problem was that the civilian wing was riven by infighting between the radical socialist and moderate faction, while the military stood more unified. Whatever the case, the ": null
    },
    {
        "Syrian Regional Command": "regional command of the arab socialist baath party – syria region"
    },
    {
        " slowly amassed its powers by weakening the National Command. This all came to a head in the ": null
    },
    {
        "42 Syrian coup détat": "1966 syrian coup détat"
    },
    {
        ".       Following the Baath Partys founding, regional branches were established in ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " and ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        ". Not long after it established branches in ": null
    },
    {
        "North Yemen": "north yemen"
    },
    {
        " and ": null
    },
    {
        "South Yemen": "protectorate of south arabia"
    },
    {
        ". In ": null
    },
    {
        "Tunisia": "tunisia"
    },
    {
        ", a ": null
    },
    {
        "Regional Branch": "tunisian baath movement"
    },
    {
        " was established in the 42s, but was forced underground for much of its existence.  The Saudi Regional Branches elected Ali Ghannäm to represent them at the 42th National Command. While its currently unknown which side the Saudi Baath took after the 42 split, it published a newspaper, Sawt al-Tal‘iyya, from 42 to 42 It was an ardent critic of the ": null
    },
    {
        "Saudi royal family": "house of saud"
    },
    {
        " and ": null
    },
    {
        "American imperialism": "american imperialism"
    },
    {
        ". The majority of its members were ": null
    },
    {
        "Shia": "shia islam"
    },
    {
        " Muslim": "muslim"
    },
    {
        "s.  In late 42 Baath cells were being established in Sudan, and there were even rumours that a Baath cell had been established in Egypt.                 ;Articles & journals       ;Bibliography                                                                                 ": null
    }
]