[
    {
        "      Babrak Karmal  was an Afghan ": null
    },
    {
        "politician": "politician"
    },
    {
        " who was installed as President of Afghanistan by the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " when ": null
    },
    {
        "they intervened in 1979": "soviet–afghan war"
    },
    {
        ". Karmal was born in ": null
    },
    {
        "Kamari": "kamari"
    },
    {
        " and educated at ": null
    },
    {
        "Kabul University": "kabul university"
    },
    {
        ". When the ": null
    },
    {
        "Peoples Democratic Party of Afghanistan": "peoples democratic party of afghanistan"
    },
    {
        " was formed, Karmal became one of its leading members, having been introduced to ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        " by ": null
    },
    {
        "Mir Akbar Khyber": "mir akbar khyber"
    },
    {
        " during his imprisonment for activities deemed too radical by the government. He eventually became the leader of the ": null
    },
    {
        "Parcham": "parcham"
    },
    {
        " faction when the PDPA split in 1967, with their ideological nemesis being the ": null
    },
    {
        "Khalq": "khalq"
    },
    {
        " faction. Under Karmals leadership, the Parchamite PDPA participated in ": null
    },
    {
        "Mohammad Daoud Khans": "mohammad daoud khan"
    },
    {
        "rise to power ": null
    },
    {
        "in 1973": "1973 afghan coup"
    },
    {
        ", and his subsequent regime. While relations were good at the beginning, Daoud began a major purge of leftist influence in the mid-1970s. This in turn led to the reformation of the PDPA in 1977, and Karmal played a major role in the 1978 ": null
    },
    {
        "Saur Revolution": "saur revolution"
    },
    {
        " when the PDPA took power, though in later years he denounced it.     Karmal was appointed Deputy Chairman of the ": null
    },
    {
        "Revolutionary Council": "revolutionary council"
    },
    {
        ", synonymous with vice head of state, in the communist government. The Parchamite faction found itself under significant pressure by the Khalqists soon after taking power. In June 1978, a ": null
    },
    {
        "PDPA Central Committee": "central committee of the peoples democratic party of afghanistan"
    },
    {
        " meeting voted in favor of giving the Khalqist faction exclusive control over PDPA policy. This decision was followed by a failed Parchamite coup, after which ": null
    },
    {
        "Hafizullah Amin": "hafizullah amin"
    },
    {
        ", a Khalqist, initiated a purge against the Parchamites. Karmal survived this purge but was exiled to ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". Karmal remained in exile until December 1979, when the Soviet Union intervened in Afghanistan to stabilize the country. The Soviet troops staged a ": null
    },
    {
        "coup": "operation storm-333"
    },
    {
        " and assassinated Amin. Karmal had always been highly critical of his Khalqist predecessors ": null
    },
    {
        "Nur Muhammad Taraki": "nur muhammad taraki"
    },
    {
        " and Amins ultra-left radicalism.     Karmal was promoted to Chairman of the Revolutionary Council and ": null
    },
    {
        "Chairman": "prime minister of afghanistan"
    },
    {
        " of the ": null
    },
    {
        "Council of Ministers": "council of ministers"
    },
    {
        " on 27 December 1979. He remained in office until 1981, when he was succeeded by ": null
    },
    {
        "Sultan Ali Keshtmand": "sultan ali keshtmand"
    },
    {
        ". Throughout his term, Karmal worked to establish a support base for the PDPA by introducing several reforms. Among these were the ": null
    },
    {
        "Fundamental Principles of the Democratic Republic of Afghanistan": "fundamental principles of the democratic republic of afghanistan"
    },
    {
        ", introducing a general amnesty for those people imprisoned during ": null
    },
    {
        "Nur Mohammad Tarakis": "nur mohammad taraki"
    },
    {
        "and Amins rule. He also replaced the red Khalqist flag with a more traditional one. These policies failed to increase the PDPAs legitimacy in the eyes of the Afghan people and the ": null
    },
    {
        "mujahideen": "mujahideen"
    },
    {
        " rebels.     These policy failures, and the stalemate that ensued after the Soviet intervention, led the Soviet leadership to become highly critical of Karmals leadership. Under ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        ", the Soviet Union deposed Karmal in 1986 and replaced him with ": null
    },
    {
        "Mohammad Najibullah": "mohammad najibullah"
    },
    {
        ". Following his loss of power, he was again exiled, this time to ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ". It was ": null
    },
    {
        "Anahita Ratebzad": "anahita ratebzad"
    },
    {
        " who persuaded Najibullah to allow Babrak Karmal to return to Afghanistan in 1991, where Karmal became an associate of ": null
    },
    {
        "Abdul Rashid Dostum": "abdul rashid dostum"
    },
    {
        " and possibly helped remove the Najibullah government from power in 1992. He eventually left Afghanistan again for Moscow. Not long after, in 1996, Karmal died from ": null
    },
    {
        "liver cancer": "liver cancer"
    },
    {
        ".       Karmal was born Sultan Hussein on 6 January 1929, was the son of Muhammad Hussein Hashem, a ": null
    },
    {
        "Major General": "major general"
    },
    {
        " in the ": null
    },
    {
        "Afghan Army": "afghan national army"
    },
    {
        " and former governor of the province of Paktia, and was the second of five siblings. His family was one of the wealthier families in Kabul. His ethnic background was Tajik from his father’s side and ": null
    },
    {
        "Ghilzai": "ghilzai"
    },
    {
        " Pashtun": "pashtun people"
    },
    {
        " from his mother’s side.     Karmal was born in ": null
    },
    {
        "Kamari": "kamari"
    },
    {
        ", a village close to ": null
    },
    {
        "Kabul": "kabul"
    },
    {
        ". He attended ": null
    },
    {
        "Nejat High School": "nejat high school"
    },
    {
        ", a German-speaking school, and graduated from it in 1948, and applied to enter the Faculty of Law and Political Science of ": null
    },
    {
        "Kabul University": "kabul university"
    },
    {
        ". Karmals application was initially denied admission to Kabul University because of his student political activist and his openly leftist views. He was always a charismatic speaker and became involved in the student union and the ": null
    },
    {
        "Wikh-i-Zalmayan": "weekh zalmian"
    },
    {
        " , a progressive and leftist organization. He studied at the College of Law and Political Science at Kabul University from 1951 to 1953. In 1953 Karmal was arrested because of his student union activities, but was released three years later in 1956 in an amnesty by ": null
    },
    {
        "Muhammad Daoud Khan": "muhammad daoud khan"
    },
    {
        ". Shortly after, in 1957, Karmal found work as an English and German translator, before quitting and leaving for military training. Karmal graduated from the College of Law and Political Science in 1960, and in 1961, he found work as an employee in the Compilation and Translation Department of the ": null
    },
    {
        "Ministry of Education": "ministry of education"
    },
    {
        ". From 1961 to 1963 he worked in the ": null
    },
    {
        "Ministry of Planning": "ministry of planning"
    },
    {
        ". When his mother died, Karmal left with his maternal aunt to live somewhere else. His father disowned him because of his leftist views. Karmal was involved in much ": null
    },
    {
        "debauchery": ":wikt:debauchery"
    },
    {
        ", which was controversial in the mostly conservative Afghan society.       Imprisoned from 1953 to 1956, Karmal befriended fellow inmate ": null
    },
    {
        "Mir Akbar Khyber": "mir akbar khyber"
    },
    {
        ", who introduced Karmal to ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        ". Karmal changed his name from Sultan Hussein to Babrak Karmal, which means Comrade of the Workers in ": null
    },
    {
        "Pashtun": "pashtun language"
    },
    {
        ", to disassociate himself from his ": null
    },
    {
        "bourgeois": "bourgeois"
    },
    {
        " background. When he was released from prison, he continued his activities in the student union, and began to promote Marxism. Karmal spent the rest of the 1950s and the early 1960s becoming involved with Marxist organizations, of which there were at least four in Afghanistan at the time; two of the four were established by Karmal. When the ": null
    },
    {
        "1964 Afghan Provisional Constitution": "1964 afghan provisional constitution"
    },
    {
        ", which legalised the establishment of new political entities, was introduced several prominent Marxists agreed to establish a communist political party. The ": null
    },
    {
        "Peoples Democratic Party of Afghanistan": "peoples democratic party of afghanistan"
    },
    {
        " was established in January 1965 in ": null
    },
    {
        "Nur Muhammad Tarakis": "nur muhammad taraki"
    },
    {
        "home. Factionalism within the PDPA quickly became a problem; the party split into the ": null
    },
    {
        "Khalq": "khalq"
    },
    {
        " led by Taraki alongside ": null
    },
    {
        "Hafizullah Amin": "hafizullah amin"
    },
    {
        ", and the ": null
    },
    {
        "Parcham": "parcham"
    },
    {
        " led by Karmal.      During the ": null
    },
    {
        "1965 parliamentary election": "1965 afghan parliamentary election"
    },
    {
        " Karmal was one of four PDPA members elected to the lower house of parliament; the three others were ": null
    },
    {
        "Anahita Ratebzad": "anahita ratebzad"
    },
    {
        ", ": null
    },
    {
        "Nur Ahmed Nur": "nur ahmed nur"
    },
    {
        " and ": null
    },
    {
        "Fezanul Haq Fezan": "fezanul haq fezan"
    },
    {
        ". No Khalqists were elected; however, Amin was 50 votes short of being elected. The Parchamite victory may be explained by the simple fact that Karmal could contribute financially to the PDPA electoral campaign. Karmal became a leading figure within the student movement in the 1960s, electing ": null
    },
    {
        "Mohammad Hashim Maiwandwal": "mohammad hashim maiwandwal"
    },
    {
        " as Prime Minister after a student demonstration concluded with three deaths under the former leadership.     In 1967, the PDPA unofficially split into two formal parties, one Khalqist and one Parchamist. The dissolution of the PDPA was initiated by the closing down of the Khalqist newspaper,  Khalq . Karmal criticised the Khalq for being too ": null
    },
    {
        "communist": "communism"
    },
    {
        ", and believed that its leadership should have hidden its Marxist orientation instead of promoting it. According to the official version of events, the majority of the ": null
    },
    {
        "PDPA Central Committee": "central committee of the peoples democratic party of afghanistan"
    },
    {
        " rejected Karmals criticism. The vote was a close one, and it is reported that Taraki expanded the Central Committee to win the vote; this plan resulted in eight of the new members becoming politically unaligned with and one switching to the Parchamite side. Karmal and half the PDPA Central Committee left the PDPA to establish a Parchamite-led PDPA. Officially the split was caused by ideological differences, but the party may have divided between the different leadership styles and plans of Taraki versus Karmal. Taraki wanted to model the party after ": null
    },
    {
        "Leninist norms": "leninism"
    },
    {
        " while Karmal wanted to establish a democratic front. Other differences were socioeconomic. The majority of Khalqists came from rural areas; hence they were poorer, and were of Pashtun origin. The Parchamites were urban, richer, and spoke ": null
    },
    {
        "Dari": "dari"
    },
    {
        " more often than not. The Khalqists accused the Parchamites of having a connection with the monarchy, and because of it, referred to the Parchamite PDPA as the Royal Communist Party . Both Karmal and Amin retained their seats in the lower house of parliament in the ": null
    },
    {
        "1969 parliamentary election": "1969 afghan parliamentary election"
    },
    {
        ".          ": null
    },
    {
        "Mohammed Daoud Khan": "mohammed daoud khan"
    },
    {
        ", in collaboration with the Parchamite PDPA and radical military officers, overthrew the ": null
    },
    {
        "monarchy": "monarchy"
    },
    {
        " and instituted the Afghan ": null
    },
    {
        "Republic in 1973": "republic of afghanistan"
    },
    {
        ". After Daouds seizure of power, an American embassy cable stated that the new government had established a Soviet-style Central Committee, in which Karmal and ": null
    },
    {
        "Mir Akbar Khyber": "mir akbar khyber"
    },
    {
        " were given leading positions. Most ministries were given to Parchamites; ": null
    },
    {
        "Hassan Sharq": "hassan sharq"
    },
    {
        " became Deputy Prime Minister, Major ": null
    },
    {
        "Faiz Mohammad": "faiz mohammad"
    },
    {
        " became ": null
    },
    {
        "Minister of Internal Affairs": "ministry of the interior"
    },
    {
        " and ": null
    },
    {
        "Nematullah Pazhwak": "nematullah pazhwak"
    },
    {
        " became ": null
    },
    {
        "Minister of Education": "ministry of education"
    },
    {
        ". The Parchamites took control over the ministries of finance, agriculture, communications and border affairs. The new government quickly suppressed the opposition, and secured their power base. At first, the National Front government between Daoud and the Parchamites seemed to work. By 1975, Daoud had strengthened his position by enhancing the executive, legislative and judicial powers of the Presidency. To the dismay of the Parchamites, all parties other than the ": null
    },
    {
        "National Revolutionary Party": "national revolutionary party"
    },
    {
        " were made illegal.     Shortly after the ban on opposition to the NRP, Daoud began a massive purge of Parchamites in government. Mohammad lost his position as interior minister, ": null
    },
    {
        "Abdul Qadir": "abdul qadir"
    },
    {
        " was demoted, and Karmal was put under government surveillance. To mitigate Daouds suddenly anti-communist directives, the Soviet Union reestablished the PDPA; Taraki was elected its General Secretary and Karmal, Second Secretary. While the ": null
    },
    {
        "Saur Revolution": "saur revolution"
    },
    {
        " was planned for August, the assassination of Khyber led to a chain of events which ended with the communists seizing power. Karmal, when taking power in 1979, accused Amin of ordering the assassination of Khyber.       Taraki was appointed Chairman of the Presidium of the ": null
    },
    {
        "Revolutionary Council": "revolutionary council"
    },
    {
        " and ": null
    },
    {
        "Chairman": "prime minister of afghanistan"
    },
    {
        " of the ": null
    },
    {
        "Council of Ministers": "council of ministers"
    },
    {
        ", retaining his post as PDPA general secretary. Taraki initially formed a government which consisted of both Khalqists and Parchamites; Karmal became Deputy Chairman of the Revolutionary Council, while Amin became ": null
    },
    {
        "Minister of Foreign Affairs": "ministry of foreign affairs"
    },
    {
        " and Deputy Chairman of the Council of Ministers.": null
    },
    {
        "Mohammad Aslam Watanjar": "mohammad aslam watanjar"
    },
    {
        " became Deputy Chairman of the Council of Ministers. The two Parchamites Abdul Qadir and ": null
    },
    {
        "Mohammad Rafi": "mohammad rafi"
    },
    {
        ", became ": null
    },
    {
        "Minister of Defence": "ministry of defence"
    },
    {
        " and ": null
    },
    {
        "Minister of Public Works": "ministry of public works"
    },
    {
        ", respectively. The appointment of Amin, Karmal and Watanjar led to splits within the Council of Ministers: the Khalqists answered to Amin; Karmal led the civilian Parchamites; and the military officers were answerable to Watanjar . The first conflict arose when the Khalqists wanted to give PDPA Central Committee membership to military officers who had participated in the ": null
    },
    {
        "Saur Revolution": "saur revolution"
    },
    {
        "; Karmal opposed such a move but was overruled. A PDPA Politburo meeting voted in favour of giving Central Committee membership to the officers.     On 27 June, three months after the ": null
    },
    {
        "Saur Revolution": "saur revolution"
    },
    {
        ", Amin outmaneuvered the Parchamites at a Central Committee meeting, giving the Khalqists exclusive right over formulating and deciding policy. A purge against the Parchamites was initiated by Amin and supported by Taraki on 1 July 1979. Karmal, fearing for his safety, went into hiding in one of his Soviet friends homes. Karmal tried to contact ": null
    },
    {
        "Alexander Puzanov": "alexander puzanov"
    },
    {
        ", the ": null
    },
    {
        "Soviet ambassador to Afghanistan": "soviet ambassador to afghanistan"
    },
    {
        ", to talk about the situation. Puzanov refused, and revealed Karmals location to Amin. The Soviets probably saved Karmals life by sending him to the ": null
    },
    {
        "Socialist Republic of Czechoslovakia": "socialist republic of czechoslovakia"
    },
    {
        ".  In exile, Karmal established a network with the remaining Parchamites in government. A coup to overthrow Amin was planned for 4 September 1979. Its leading members in Afghanistan were Qadir and the Army Chief of Staff General ": null
    },
    {
        "Shahpur Ahmedzai": "shahpur ahmedzai"
    },
    {
        ". The coup was planned for the Festival of Eid, in anticipation of relaxed military vigilance. The conspiracy failed when the Afghan ambassador to India told the Afghan leadership about the plan. Another purge was initiated, and Parchamite ambassadors were recalled. Few returned to Afghanistan; Karmal and ": null
    },
    {
        "Mohammad Najibullah": "mohammad najibullah"
    },
    {
        " stayed in their respective countries. The Soviets decided that Amin should be removed to make way for a Karmal-Taraki coalition government. However Amin managed to order the arrest and later the murder of Taraki.     Amin was informed of the Soviet decision to ": null
    },
    {
        "intervene in Afghanistan": "soviet–afghan war"
    },
    {
        " and was initially supportive, but was ": null
    },
    {
        "assassinated": "operation storm-333"
    },
    {
        ". Under the command of the Soviets, Karmal ascended to power. On 27 December 1979, Karmals pre-recorded speech to the Afghan people was broadcast via ": null
    },
    {
        "Radio Kabul": "radio kabul"
    },
    {
        " from ": null
    },
    {
        "Tashkent": "tashkent"
    },
    {
        " in the ": null
    },
    {
        "Uzbek SSR": "uzbek ssr"
    },
    {
        " , saying: Today the torture machine of Amin has been smashed, his accomplices – the primitive executioners, usurpers and murderers of tens of thousand of our fellow countrymen – fathers, mothers, sisters, brothers, sons and daughters, children and old people  ...  Karmal was not in Kabul when the speech was broadcast; he was in ": null
    },
    {
        "Bagram": "bagram"
    },
    {
        ", protected by the ": null
    },
    {
        "KGB": "kgb"
    },
    {
        ".     That evening ": null
    },
    {
        "Yuri Andropov": "yuri andropov"
    },
    {
        ", the ": null
    },
    {
        "Chairman of the KGB": "chairman of the kgb"
    },
    {
        ", congratulated Karmal on his rise to the Chairmanship of the Presidium of the ": null
    },
    {
        "Revolutionary Council": "revolutionary council"
    },
    {
        ", some time before Karmal received an official appointment. Karmal returned to Kabul on 28 December. He travelled alongside a Soviet military column. For the next few days Karmal lived in a villa on the outskirts of Kabul under the protection of the KGB. On 1 January 1980 ": null
    },
    {
        "Leonid Brezhnev": "leonid brezhnev"
    },
    {
        ", the ": null
    },
    {
        "General Secretary": "general secretary of the communist party of the soviet union"
    },
    {
        " of the ": null
    },
    {
        "Central Committee of the Communist Party of the Soviet Union": "central committee of the communist party of the soviet union"
    },
    {
        ", and ": null
    },
    {
        "Alexei Kosygin": "alexei kosygin"
    },
    {
        ", the Soviet ": null
    },
    {
        "Chairman": "premier of the soviet union"
    },
    {
        " of the ": null
    },
    {
        "Council of Ministers": "council of ministers"
    },
    {
        ", congratulated Karmal on his election as leader.               When he came to power, Karmal promised an end to executions, the establishment of democratic institutions and free elections, the creation of a constitution, and legalization of alternative political parties. Prisoners incarcerated under the two previous governments would be freed in a general ": null
    },
    {
        "amnesty": "amnesty"
    },
    {
        " . He promised the creation of a coalition government which would not espouse ": null
    },
    {
        "socialism": "socialism"
    },
    {
        ". At the same time, he told the Afghan people that he had negotiated with the Soviet Union to give economic, military and political assistance. The mistrust most Afghans felt towards the government was a problem for Karmal. Many still remembered he had said he would protect private capital in 1978—a promise later proven to be a lie.      Karmals three most important promises were the general amnesty of prisoners, the promulgation of the ": null
    },
    {
        "Fundamental Principles of the Democratic Republic of Afghanistan": "fundamental principles of the democratic republic of afghanistan"
    },
    {
        " and the adoption of a new flag containing the traditional black, red and green . His government granted concessions to religious leaders and the restoration of confiscated property. Some property, which was confiscated during earlier land reforms, was also partially restored. All these measures, with the exception of the general amnesty of prisoners, were introduced gradually. Of 2,700 prisoners, 2,600 were released from prison; 600 of these were Parchamites. The general amnesty was greatly publicized by the government. While the event was hailed with enthusiasm by some, many others greeted the event with disdain, since their loved ones or associates had died during earlier purges. Amin had planned to introduce a general amnesty on 1 January 1980, to coincide with the PDPAs sixteenth anniversary.     Work on the Fundamental Principles had started under Amin: it guaranteed democratic rights such as ": null
    },
    {
        "freedom of speech": "freedom of speech"
    },
    {
        ", the right to security and life, the right to peaceful association, the right to demonstrate and the right that no one would be accused of crime but in accord with the provisions of law and that the accused had the right to a ": null
    },
    {
        "fair trial": "fair trial"
    },
    {
        ". The Fundamental Principles envisaged a democratic state led by the PDPA, the only party then permitted by law. The Revolutionary Council, the organ of supreme power, would convene twice every year. The Revolutionary Council in turn elected a Presidium which would take decisions on behalf of the Revolutionary Council when it was not in session. The Presidium consisted mostly of ": null
    },
    {
        "PDPA Politburo": "politburo of the peoples democratic party of afghanistan"
    },
    {
        " members. The state would safeguard three kinds of property: state, cooperative and private property. The Fundamental Principles said that the state had the right to change the Afghan economy from an economy where man was exploited to an economy were man was free. Another clause stated that the state had the right to take families, both parents and children, under its supervision.  While it looked democratic at the outset, the Fundamental Principles was based on contradictions.     The Fundamental Principles led to the establishment of two important state organs: the Special Revolutionary Court, a specialized court for crimes against ": null
    },
    {
        "national security": "national security"
    },
    {
        " and territorial integrity, and the Institute for Legal and Scientific Research and Legislative Affairs, the supreme legislative organ of state, This body could amend and draft laws, and introduce regulations and decrees on behalf of the government. The introduction of more Soviet-style institutions led the Afghan people to distrust the communist government even more.     The Fundamental Principles constitution came into power on April 22, 1980.       With Karmals ascension to power, Parchamites began to settle old scores . ": null
    },
    {
        "Revolutionary Troikas": "revolutionary troika"
    },
    {
        "were created to arrest, sentence and execute people. Amins guard were the first victims of the terror which ensued. Those commanders who had stayed loyal to Amin were arrested, filling the prisons. The Soviets protested, and Karmal replied, As long as you keep my hands bound and do not let me deal with the Khalq faction there will be no unity in the PDPA and the government cannot become strong  ... They tortured and killed us. They still hate us! They are the enemies of the party  ...  Amins daughter, along with her baby, was imprisoned for twelve years, until ": null
    },
    {
        "Mohammad Najibullah": "mohammad najibullah"
    },
    {
        ", then leader of the PDPA, released her. When Karmal took power, leading posts in the Party and Government bureaucracy were taken over by Parchamites. The Khalq faction was removed from power, and only ": null
    },
    {
        "technocrat": "technocrat"
    },
    {
        "s, ": null
    },
    {
        "opportunists": "opportunism"
    },
    {
        " and individuals which the Soviets trusted would be appointed to the higher echelons of government. Khalqists remained in control of the ": null
    },
    {
        "Ministry of Interior": "ministry of the interior"
    },
    {
        ", but Parchamites were given control over ": null
    },
    {
        "KHAD": "khad"
    },
    {
        " and the secret police. The Parchamites and the Khalqists controlled an equal share of the military. Two out of Karmals three Council of Ministers deputy chairmen were Khalqists. Khalqists controlled the ": null
    },
    {
        "Ministry of Communications": "ministry of communications"
    },
    {
        " and the interior ministry. Parchamites, on the other hand, controlled the ": null
    },
    {
        "Ministry of Foreign Affairs": "ministry of foreign affairs"
    },
    {
        " and the ": null
    },
    {
        "Ministry of Defence": "ministry of defence"
    },
    {
        ". In addition to the changes in government, the Parchamites held clear majority in the ": null
    },
    {
        "PDPA Central Committee": "central committee of the peoples democratic party of afghanistan"
    },
    {
        ". Only one Khalqi, ": null
    },
    {
        "Saleh Mohammad Zeary": "saleh mohammad zeary"
    },
    {
        ", was a member of the ": null
    },
    {
        "PDPA Secretariat": "secretariat of the peoples democratic party of afghanistan"
    },
    {
        " during Karmals rule.     Over 14 and 15 March 1982 the PDPA held a party conference at the Kabul Polytechnic Institute instead of a party congress, since a party congress would have given the Khalq faction a majority and could have led to a Khalqist takeover of the PDPA. The rules of holding a party conference were different, and the Parchamites had a three-fifths majority. This infuriated several Khalqists; the threat of expulsion did not lessen their anger. The conference was not successful, but it was portrayed as such by the official media. The conference broke up after one and a half days of a 3-day long program, because of the inter-party struggle for power between the Khalqists and the Parchamites. A program of action was introduced, and party rules were given minor changes. As an explanation of the low party membership, the official media also made it seem hard to become a member of the party.          When Karmal took power, he began expanding the support base of the PDPA. Karmal tried to persuade certain groups, which had been referred to ": null
    },
    {
        "class enemies": "class enemy"
    },
    {
        " of the revolution during Taraki and Amins rule, to support the PDPA. Karmal appointed several non-communists to top positions. Between March and May 1980, 78 out of the 191 people appointed to government posts were not members of the PDPA. Karmal reintroduced the old Afghan custom of having an Islamic invocation every time the government issued a proclamation. In his first live speech to the Afghan people, Karmal called for the establishment of the ": null
    },
    {
        "National Fatherland Front": "national front"
    },
    {
        " ; the NFFs founding congress was held in June 1981. Unfortunately for Karmal, his policies did not lead to a notable increase in support for his regime, and it did not help Karmal that most Afghans saw the Soviet intervention as an invasion.     By 1981, the government gave up on political solutions to the conflict. At the fifth PDPA Central Committee plenum in June, Karmal resigned from his Council of Ministers chairmanship and was replaced by ": null
    },
    {
        "Sultan Ali Keshtmand": "sultan ali keshtmand"
    },
    {
        ", while ": null
    },
    {
        "Nur Ahmad Nur": "nur ahmad nur"
    },
    {
        " was given a bigger role in the Revolutionary Council. This was seen as base broadening . The previous weight given to non-PDPA members in top positions ceased to be an important matter in the media by June 1981. This was significant, considering that up to five members of the Revolutionary Council were non-PDPA members. By the end of 1981, the previous contenders, who had been heavily presented in the media, were all gone; two were given ambassadorships, two ceased to be active in politics, and one continued as an advisor to the government. The other three changed sides, and began to work for the opposition.     The national policy of reconciliation continued: in January 1984 the land reform introduced by Taraki and Amin was drastically modified, the limits of landholdings were increased to win the support of middle class peasants, the literacy programme was continued, and concessions to women were made. In 1985 the ": null
    },
    {
        "Loya Jirga": "loya jirga"
    },
    {
        " was reconvened. The 1985 Loya Jirga was followed by a tribal jirga in September. In 1986 ": null
    },
    {
        "Abdul Rahim Hatef": "abdul rahim hatef"
    },
    {
        ", a non-PDPA member, was elected to the NFF chairmanship. During the 1985–86 elections it was said that 60 percent of the elected officials were non-PDPA members. By the end of Karmals rule, several non-PDPA members had high-level government positions.             In March 1979, the military budget was 6.4 million US$, which was 8.3 percent of the government budget, but only 2.2 of ": null
    },
    {
        "gross national product": "gross national product"
    },
    {
        ". After the Soviet intervention, the defence budget increased to 208 million US$ in 1980, and 325 million US$ by 1981. In 1982 it was reported that the government spent around 22 percent of total expenditure.     When the political solution failed , the Afghan government and the Soviet military decided to solve the conflict militarily. The change from a political to a military solution did not come suddenly. It began in January 1981, as Karmal doubled wages for military personnel, issued several promotions, and decorated one general and thirteen colonels. The draft age was lowered, the obligatory length of arms duty was extended and the age for reservists was increased to thirty-five years of age. In June 1981, ": null
    },
    {
        "Assadullah Sarwari": "assadullah sarwari"
    },
    {
        " lost his seat in the PDPA Politburo, replaced by ": null
    },
    {
        "Mohammad Aslam Watanjar": "mohammad aslam watanjar"
    },
    {
        ", a former tank commander and ": null
    },
    {
        "Minister of Communications": "ministry of communications"
    },
    {
        ", ": null
    },
    {
        "Major General": "major general"
    },
    {
        " Mohammad Rafi": "mohammad rafi"
    },
    {
        " was made": null
    },
    {
        "Minister of Defence": "ministry of defence"
    },
    {
        " and ": null
    },
    {
        "Mohammad Najibullah": "mohammad najibullah"
    },
    {
        " appointed ": null
    },
    {
        "KHAD": "khad"
    },
    {
        " Chairman.     These measures were introduced due to the collapse of the army during the Soviet intervention. Before the invasion the army could field 100,000 troops, after the invasion only 25,000. Desertions were pandemic, and the recruitment campaigns for young people often drove them to the opposition. To better organize the military, seven military zones were established, each with its own Defence Council. The Defence Councils were established at the national, provincial and district level to empower the local PDPA. It is estimated that the Afghan government spent as much as 40 percent of government revenue on defense.          During the civil war and the ensuing ": null
    },
    {
        "Soviet–Afghan War": "soviet–afghan war"
    },
    {
        ", most of the countrys infrastructure was destroyed. Normal patterns of economic activity were disrupted.  The ": null
    },
    {
        "Gross national product": "gross national product"
    },
    {
        " fell substantially during Karmals rule because of the conflict; trade and transport was disrupted with loss of labor and capital. In 1981 the Afghan GDP stood at 154.3 billion ": null
    },
    {
        "Afghan afghani": "afghan afghani"
    },
    {
        "s, a drop from 159.7 billion in 1978. ": null
    },
    {
        "GNP per capita": "gnp per capita"
    },
    {
        " decreased from 7,370 in 1978 to 6,852 in 1981. The dominant form of economic activity was in the ": null
    },
    {
        "agricultural sector": "agriculture in afghanistan"
    },
    {
        ". Agriculture accounted for 63 percent of ": null
    },
    {
        "gross domestic product": "gross domestic product"
    },
    {
        " in 1981; 56 percent of the labor force was working in agriculture in 1982. Industry accounted for 21 percent of GDP in 1982, and employed 10 percent of the labor force. All industrial enterprises were government-owned. The service sector, the smallest of the three, accounted for 10 percent of GDP in 1981, and employed an estimated one-third of the labour force. The ": null
    },
    {
        "balance of payments": "balance of payments"
    },
    {
        ", which had grown in the pre-communist administration of ": null
    },
    {
        "Muhammad Daoud Khan": "muhammad daoud khan"
    },
    {
        ", decreased, turning negative by 1982 at 70.3 million $US. The only economic activity which grew substantially during Karmals rule was ": null
    },
    {
        "export": "export"
    },
    {
        " and ": null
    },
    {
        "import": "import"
    },
    {
        ".        Karmal observed in early 1983 that without Soviet intervention, It is unknown what the destiny of the Afghan Revolution would be  ... We are realists and we clearly realize that in store for us yet lie trials and deprivations, losses and difficulties.  Two weeks before this statement ": null
    },
    {
        "Sultan Ali Keshtmand": "sultan ali keshtmand"
    },
    {
        ", the Chairman of the Council of Ministers, lamented the fact that half the schools and three-quarters of communications had been destroyed since 1979. The Soviet Union rejected several Western-made peace plans, such as the Carrington Plan, since they did not take into consideration the PDPA government. Most Western peace plans had been made in collaboration with the Afghan opposition forces. At the ": null
    },
    {
        "26th Congress of the Communist Party of the Soviet Union": "26th congress of the communist party of the soviet union"
    },
    {
        " Leonid Brezhnev": "leonid brezhnev"
    },
    {
        ", the ": null
    },
    {
        "General Secretary": "general secretary of the communist party of the soviet union"
    },
    {
        " of the CPSU ": null
    },
    {
        "Central Committee": "central committee of the communist party of the soviet union"
    },
    {
        ", stated;        The stance of the Pakistani government was clear, demanding complete Soviet withdrawal from Afghanistan and the establishment of a non-PDPA government. Karmal, summarizing his discussions with Iran and Pakistan, said Iran and Pakistan have so far not opted for concrete and constructive positions.  During Karmals rule ": null
    },
    {
        "Afghan–Pakistani relations": "afghanistan–pakistan relations"
    },
    {
        " remained hostile; the Soviet intervention in Afghanistan was the catalyst for the hostile relationship. The increasing numbers of ": null
    },
    {
        "Afghan refugees in Pakistan": "afghans in pakistan"
    },
    {
        " challenged the PDPAs legitimacy to rule.     The Soviet Union threatened in 1985 that it would support the ": null
    },
    {
        "Baloch separatist movement": "baloch nationalist"
    },
    {
        " in Pakistan if the Pakistani government continued to aid the ": null
    },
    {
        "mujahideen": "mujahideen"
    },
    {
        " in Afghanistan. Karmal, problematically for the Soviets, did not want a Soviet withdrawal, and he hampered attempts to improve relations with Pakistan since the Pakistani government had refused to recognise the PDPA government.       ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        ", then ": null
    },
    {
        "General Secretary": "general secretary of the communist party of the soviet union"
    },
    {
        " of the ": null
    },
    {
        "Central Committee of the Communist Party of the Soviet Union": "central committee of the communist party of the soviet union"
    },
    {
        ", said, The main reason that there has been no national consolidation so far is that Comrade Karmal is hoping to continue sitting in Kabul with our help.  Karmals position became less secure when the Soviet leadership began blaming him for the failures in Afghanistan. Gorbachev, worried over the situation, told the Soviet Politburo If we dont change approaches we will be fighting there for another 20 or 30 years.  It is not clear when the Soviet leadership began to campaign for Karmals dismissal, but ": null
    },
    {
        "Andrei Gromyko": "andrei gromyko"
    },
    {
        " discussed the possibility of Karmals resignation with ": null
    },
    {
        "Javier Pérez de Cuéllar": "javier pérez de cuéllar"
    },
    {
        ", the ": null
    },
    {
        "Secretary-General of the United Nations": "secretary-general of the united nations"
    },
    {
        " in 1982. While it was Gorbachev who would dismiss Karmal, there may have been a consensus within the Soviet leadership in 1983 that Karmal should resign. Gorbachevs own plan was to replace Karmal with ": null
    },
    {
        "Mohammad Najibullah": "mohammad najibullah"
    },
    {
        ", who had joined the PDPA at its creation. Najibullah was thought highly of by ": null
    },
    {
        "Yuri Andropov": "yuri andropov"
    },
    {
        ", ": null
    },
    {
        "Boris Ponomarev": "boris ponomarev"
    },
    {
        " and ": null
    },
    {
        "Dmitriy Ustinov": "dmitriy ustinov"
    },
    {
        ", and negotiations for his succession may have started in 1983. Najibullah was not the Soviet leaderships only choice for Karmals succession; a ": null
    },
    {
        "GRU": "glavnoye razvedyvatelnoye upravleniye"
    },
    {
        " report noted that the majority of the PDPA leadership would support ": null
    },
    {
        "Assadullah Sarwaris": "assadullah sarwari"
    },
    {
        "ascension to leadership. According to the GRU, Sarwari was a better candidate as he could balance between the Pashtuns, Tajiks and Uzbeks; Najibullah was a Pashtun nationalist. Another viable candidate was ": null
    },
    {
        "Abdul Qadir": "abdul qadir"
    },
    {
        ", who had been a participant in the ": null
    },
    {
        "Saur Revolution": "saur revolution"
    },
    {
        ".     Najibullah was appointed to the ": null
    },
    {
        "PDPA Secretariat": "secretariat of the peoples democratic party of afghanistan"
    },
    {
        " in November 1985. During Karmals March 1986 visit to the Soviet Union, the Soviets tried to persuade Karmal that he was too ill to govern, and that he should resign. This backfired, as a Soviet doctor attending to Karmal told him he was in good health. Karmal asked to return home to Kabul, and said that he understood and would listen to the Soviet recommendations. Before leaving, Karmal promised he would step down as PDPA General Secretary. The Soviets did not trust him and sent ": null
    },
    {
        "Vladimir Kryuchkov": "vladimir kryuchkov"
    },
    {
        ", the head of intelligence  in the ": null
    },
    {
        "KGB": "kgb"
    },
    {
        ", into Afghanistan. At a meeting in Kabul, Karmal confessed his undying love for the Soviet Union, comparing his ardor to his Muslim faith. Kryuchkov, concluding that he could not persuade Karmal to resign, left the meeting. After Kryuchkov left the room, the Afghan defence minister and the state security minister visited Karmals office, telling him that he had to resign from one of his posts. Understanding that his Soviet support had been eliminated, Karmal resigned from the office of the General Secretary at the 18th PDPA Central Committee plenum. He was succeeded in his post by Najibullah.     Karmal still had support within the party, and used his base to curb Najibullahs powers. He began spreading rumors that he would be reappointed General Secretary. Najibullahs power base was in the ": null
    },
    {
        "KHAD": "khad"
    },
    {
        ", the Afghan equivalent to the KGB, and not the party. Considering the fact that the Soviet Union had supported Karmal for over six years, the Soviet leadership wanted to ease him out of power gradually. ": null
    },
    {
        "Yuli Vorontsov": "yuli mikhailovich vorontsov"
    },
    {
        ", the ": null
    },
    {
        "Soviet ambassador to Afghanistan": "soviet ambassador to afghanistan"
    },
    {
        ", told Najibullah to begin undermining Karmals power slowly. Najibullah complained to the Soviet leadership that Karmal used most of his spare time looking for errors and speaking against the ": null
    },
    {
        "National Reconciliation": "national reconciliation"
    },
    {
        " . At a meeting of the Soviet Politburo on 13 November 1986 it was decided that Najibullah should remove Karmal; this motion was supported by Gromyko, Vorontsov, ": null
    },
    {
        "Eduard Shevardnadze": "eduard shevardnadze"
    },
    {
        ", ": null
    },
    {
        "Anatoly Dobrynin": "anatoly dobrynin"
    },
    {
        " and ": null
    },
    {
        "Viktor Chebrikov": "viktor chebrikov"
    },
    {
        ". A PDPA meeting in November relieved Karmal of his Revolutionary Council chairmanship, and exiled him to Moscow where he was given a state-owned apartment and a ": null
    },
    {
        "dacha": "dacha"
    },
    {
        ". Karmal was succeeded as Revolutionary Council chairman by ": null
    },
    {
        "Haji Mohammad Chamkani": "haji mohammad chamkani"
    },
    {
        ", who was not a member of the PDPA.       Many years after the end of his Presidency, he denounced the ": null
    },
    {
        "Saur Revolution": "saur revolution"
    },
    {
        " of 1978 in which he took part, taking aim at the Khalq governments of Taraki and Amin. He told a Russian reporter:     It was the greatest crime against the people of Afghanistan. Parchams leaders were against armed actions because the country was not ready for a revolution... I knew that people would not support us if we decided to keep power without such support. Ghosts of Afghanistan: Hard Truths and Foreign Myths by Jonathan Steele     For unknown reasons, Karmal was invited back to Kabul by Najibullah, and for equally obscure reasons Karmal accepted , returning on June 20, 1991. If Najibullahs plan was to strengthen his position within the ": null
    },
    {
        "Watan Party": "watan party of afghanistan"
    },
    {
        " by appeasing the pro-Karmal Parchamites, he failed - Karmals apartment became a center for opposition to Najibullahs government. When Najibullah was toppled in 1992, Karmal became the most powerful politician in Kabul through leadership of the Parcham. However, his negotiations with the rebels collapsed quickly, and on 16 April 1992 the rebels, led by ": null
    },
    {
        "Gulbuddin Hekmatyar": "gulbuddin hekmatyar"
    },
    {
        ", took Kabul. After the fall of Najibullahs government, Karmal was based in ": null
    },
    {
        "Hairatan": "hairatan"
    },
    {
        ". There, it is alleged, Karmal used most of his time either trying to establish a new party, or advising people to join the ": null
    },
    {
        "National Islamic Movement": "national islamic movement of afghanistan"
    },
    {
        " . ": null
    },
    {
        "Abdul Rashid Dostum": "abdul rashid dostum"
    },
    {
        ", the leader of Junbish-i-Milli, was a supporter of Karmal during his rule. It is unknown how much control Karmal had over Dostum, but there is little evidence that Karmal was in any commanding position. Karmals influence over Dostum appeared indirect – some of his former associates supported Dostum. Those who spoke with Karmal during this period noted his lack of interest in politics. In June 1992 it was reported that he had died in a plane crash along with Dostum, although these reports later proved to be false.      In early December 1996, Karmal died in Moscows ": null
    },
    {
        "Central Clinical Hospital": "central clinical hospital"
    },
    {
        " from ": null
    },
    {
        "liver cancer": "hepatocellular carcinoma"
    },
    {
        ". The date of his death was reported by some sources as 1 December  and by others as 3 December.   The ": null
    },
    {
        "Taliban": "taliban"
    },
    {
        " summed up his rule as follows:   committed all kinds of crimes during his illegitimate rule  ... God inflicted on him various kinds of hardship and pain. Eventually he died of cancer in a hospital belonging to his paymasters, the Russians.        ": null
    }
]