[
    {
        "   Back There is episode 42 of the American television ": null
    },
    {
        "anthology series": "anthology series"
    },
    {
        "  The Twilight Zone . It originally aired on January 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ". It involves time travel, and stars ": null
    },
    {
        "Russell Johnson": "russell johnson"
    },
    {
        ", who had appeared in ": null
    },
    {
        "another time-travel episode": "execution"
    },
    {
        " the previous season.              On April 42 42 young engineer Peter Corrigan is involved in a discussion with colleagues at the elite Potomac Club on the question of whether events in history could be changed if time travel were possible. After bumping into William, a familiar attendant, on the way out, Peter feels faint. Confused by the gas lamps and horse-drawn carriages on the street, he notices that hes wearing clothes of a much older style and walks home. He finds that his home is now a boarding house. In discussion with the strangers he meets there, he discovers that he has been transmitted back in time to April 42 42 the date of the ": null
    },
    {
        "assassination of Abraham Lincoln": "assassination of abraham lincoln"
    },
    {
        " by ": null
    },
    {
        "John Wilkes Booth": "john wilkes booth"
    },
    {
        ".     Corrigan rushes to ": null
    },
    {
        "Fords Theatre": "fords theatre"
    },
    {
        " to warn everyone but is arrested for ": null
    },
    {
        "disturbing the peace": "breach of the peace"
    },
    {
        ". The police presume him to be a Union soldier under emotional distress or drunk. One officer tends to believe Corrigan, but is overruled by his superior. After he has been held in the ": null
    },
    {
        "police station": "police station"
    },
    {
        " a short time, a John Wellington arrives and persuades the police to release Corrigan into his custody. Corrigan implores Wellington to do something to warn and protect the president.     In Wellingtons room, he gives Corrigan a drink, but it is drugged and he collapses. Wellington then leaves and locks the door. Later the policeman who believed him arrives and rouses him, relating that he had tried unsuccessfully to convince anyone to take additional precautions. The landlady identifies the tenant of the room as John Wilkes Booth, and indeed the handkerchief left behind by Wellington bears the initials JWB. Booth himself had drugged Corrigan to prevent any interference in his mission. And now it is too late: the crowd outside is spreading the news that the president has just been shot.     Corrigan pounds his fist on a window sill and finds he is back in 42 pounding on the door of the Potomac Club. It seems the same, but there is no longer an attendant named William. Back at the table with his colleagues, he finds that the scholarly discussion has moved from time travel to money, and William is also at the table participating. He says that his money was inherited from his great-grandfather, a policeman who had had made a name for himself by somehow predicting the assassination of Lincoln and trying to warn about it, becoming Chief of Police, then a councilman, and eventually become a millionaire through real estate. Overwhelmed by all that has happened, Peter steps aside to wipe his brow with the handkerchief in his pocket and notices the initials: JWB. It turns out that Corrigan was able to change the past, but not in the way he had intended.        ": null
    },
    {
        "Russell Johnson": "russell johnson"
    },
    {
        " as Peter Corrigan   ": null
    },
    {
        "Paul Hartman": "paul hartman"
    },
    {
        " as Police Sergeant   ": null
    },
    {
        "John Lasell": "john lasell"
    },
    {
        " as ": null
    },
    {
        "Jonathan Wellington": "john wilkes booth"
    },
    {
        " Bartlett Robinson": "bartlett robinson"
    },
    {
        " as William   ": null
    },
    {
        "Nora Marlowe": "nora marlowe"
    },
    {
        " as Chambermaid   ": null
    },
    {
        "Raymond Bailey": "raymond bailey"
    },
    {
        " as Millard   ": null
    },
    {
        "Raymond Greenleaf": "raymond greenleaf"
    },
    {
        " as Jackson   John Eldredge as Whittaker   James Gavin as Policeman 42   ": null
    },
    {
        "Jean Inness": "jean inness"
    },
    {
        " as Mrs. Landers   ": null
    },
    {
        "Pat OMalley": "patrick h. omalley jr."
    },
    {
        " as Waiter/Policeman 42   ": null
    },
    {
        "James Lydon": "jimmy lydon"
    },
    {
        " as Patrolman   Lew Brown as ": null
    },
    {
        "Lieutenant": "henry rathbone"
    },
    {
        " Carol Rossen": "carol rossen"
    },
    {
        " as ": null
    },
    {
        "Lieutenants Girl": "clara harris"
    }
]