[
    {
        "           A bacteriophage , also known informally as a phage , is a ": null
    },
    {
        "virus": "virus"
    },
    {
        " that infects and replicates within ": null
    },
    {
        "bacteria": "bacteria"
    },
    {
        " and ": null
    },
    {
        "archaea": "archaea"
    },
    {
        ". The term was derived from bacteria and the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " φαγεῖν , to devour . Bacteriophages are composed of ": null
    },
    {
        "proteins": "protein"
    },
    {
        "that ": null
    },
    {
        "encapsulate": "capsid"
    },
    {
        " a ": null
    },
    {
        "DNA": "dna"
    },
    {
        " or ": null
    },
    {
        "RNA": "rna"
    },
    {
        " genome": "genome"
    },
    {
        ", and may have structures that are either simple or elaborate. Their genomes may encode as few as four genes  and as many as hundreds of ": null
    },
    {
        "genes": "genes"
    },
    {
        ". Phages replicate within the bacterium following the injection of their genome into its ": null
    },
    {
        "cytoplasm": "cytoplasm"
    },
    {
        ".     Bacteriophages are among the most common and diverse entities in the ": null
    },
    {
        "biosphere": "biosphere"
    },
    {
        ".  Bacteriophages are ubiquitous viruses, found wherever bacteria exist. It is estimated there are more than 10 31 bacteriophages on the planet, more than every other organism on Earth, including bacteria, combined.  One of the densest natural sources for phages and other viruses is seawater, where up to 9x10 8 ": null
    },
    {
        "virions": "virus"
    },
    {
        " per millilitre have been found in ": null
    },
    {
        "microbial mats": "microbial mats"
    },
    {
        " at the surface,  and up to 70% of marine bacteria may be infected by phages. Prescott, L. . Microbiology, Wm. C. Brown Publishers,      Phages have been used since the late 19th century as an alternative to ": null
    },
    {
        "antibiotics": "antibiotics"
    },
    {
        " in the former ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and Central Europe, as well as in France. BBC Horizon : The Virus that Cures – Documentary about the history of phage medicine in Russia and the West  They are seen as a possible therapy against ": null
    },
    {
        "multi-drug-resistant": "multi-drug-resistant"
    },
    {
        " strains of many bacteria .  Phages of  Inoviridae  have been shown to complicate ": null
    },
    {
        "biofilms": "biofilms"
    },
    {
        " involved in ": null
    },
    {
        "pneumonia": "pneumonia"
    },
    {
        " and ": null
    },
    {
        "cystic fibrosis": "cystic fibrosis"
    },
    {
        " and to shelter the bacteria from drugs meant to eradicate disease, thus promoting persistent infection.        Bacteriophages occur abundantly in the biosphere, with different genomes, and lifestyles. Phages are classified by the ": null
    },
    {
        "International Committee on Taxonomy of Viruses": "international committee on taxonomy of viruses"
    },
    {
        " according to ": null
    },
    {
        "morphology": "morphology"
    },
    {
        " and nucleic acid.     Nineteen families are currently recognized by the ICTV that infect ": null
    },
    {
        "bacteria": "bacteria"
    },
    {
        " and ": null
    },
    {
        "archaea": "archaea"
    },
    {
        ". Of these, only two families have RNA genomes, and only five families are surrounded by an envelope. Of the viral families with DNA genomes, only two have single-stranded genomes. Eight of the viral families with DNA genomes have circular genomes, while nine have linear genomes. Nine families infect bacteria only, nine infect archaea only, and one  infects both bacteria and archaea.             It has been suggested that members of  Picobirnaviridae  infect bacteria, but not mammals.          In 1896, ": null
    },
    {
        "Ernest Hanbury Hankin": "ernest hanbury hankin"
    },
    {
        " reported that something in the waters of the ": null
    },
    {
        "Ganges": "ganges"
    },
    {
        " and ": null
    },
    {
        "Yamuna": "yamuna"
    },
    {
        " rivers in ": null
    },
    {
        "India": "india"
    },
    {
        " had a marked ": null
    },
    {
        "antibacterial": "antibacterial"
    },
    {
        " action against ": null
    },
    {
        "cholera": "cholera"
    },
    {
        " and it could pass through a very fine porcelain filter.  In 1915, ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " bacteriologist": "bacteriologist"
    },
    {
        " Frederick Twort": "frederick twort"
    },
    {
        ", superintendent of the Brown Institution of London, discovered a small agent that infected and killed bacteria. He believed the agent must be one of the following:   a stage in the ": null
    },
    {
        "life cycle": "biological life cycle"
    },
    {
        " of the bacteria   an ": null
    },
    {
        "enzyme": "enzyme"
    },
    {
        " produced by the bacteria themselves, or   a virus that grew on and destroyed the bacteria      Tworts research was interrupted by the onset of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " and a shortage of funding.        Independently, ": null
    },
    {
        "French-Canadian": "french-canadian"
    },
    {
        " microbiologist": "microbiology"
    },
    {
        " Félix dHérelle": "félix dhérelle"
    },
    {
        ", working at the ": null
    },
    {
        "Pasteur Institute": "pasteur institute"
    },
    {
        " in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", announced on 3 September 1917, that he had discovered an invisible, antagonistic microbe of the ": null
    },
    {
        "dysentery": "dysentery"
    },
    {
        " bacillus . For d’Hérelle, there was no question as to the nature of his discovery: In a flash I had understood: what caused my clear spots was in fact an invisible microbe … a virus parasitic on bacteria.  DHérelle called the virus a bacteriophage, a bacteria-eater . He also recorded a dramatic account of a man suffering from dysentery who was restored to good health by the bacteriophages.  It was DHerelle who conducted much research into bacteriophages and introduced the concept of ": null
    },
    {
        "phage therapy": "phage therapy"
    },
    {
        ".      More than a half a century later, in 1969, ": null
    },
    {
        "Max Delbrück": "max delbrück"
    },
    {
        ", ": null
    },
    {
        "Alfred Hershey": "alfred hershey"
    },
    {
        ", and ": null
    },
    {
        "Salvador Luria": "salvador luria"
    },
    {
        " were awarded the ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "nobel prize in physiology or medicine"
    },
    {
        " for their discoveries of the replication of viruses and their genetic structure.               Phages were discovered to be antibacterial agents and were used in the former ": null
    },
    {
        "Soviet": "soviet"
    },
    {
        " Republic of ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        "  during the 1920s and 1930s for treating bacterial infections. They had widespread use, including treatment of soldiers in the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        ". However, they were abandoned for general use in the West for several reasons:     Antibiotics were discovered and marketed widely. They were easier to make, store, and to prescribe.   Medical trials of phages were carried out, but a basic lack of understanding raised questions about the validity of these trials.    Publication of research in the Soviet Union was mainly in the ": null
    },
    {
        "Russian": "russian language"
    },
    {
        " or ": null
    },
    {
        "Georgian languages": "georgian language"
    },
    {
        "and for many years, was not followed internationally.     The use of phages has continued since the end of the Cold War in Russia Сергей Головин  // ": null
    },
    {
        "Наука и жизнь": "наука и жизнь"
    },
    {
        ". — 2017. — № 6. — С. 26-33 , Georgia and elsewhere in Central and Eastern Europe. The first regulated, randomized, double-blind ": null
    },
    {
        "clinical trial": "clinical trial"
    },
    {
        " was reported in the Journal of Wound Care in June 2009, which evaluated the safety and efficacy of a bacteriophage cocktail to treat infected venous ulcers of the leg in human patients.  The FDA approved the study as a Phase I clinical trial. The studys results demonstrated the safety of therapeutic application of bacteriophages, but did not show efficacy. The authors explained that the use of certain chemicals that are part of standard wound care  may have interfered with bacteriophage viability. Shortly after that, another controlled clinical trial in Western Europe  was reported in the journal, Clinical Otolaryngology in August 2009.  The study concludes that bacteriophage preparations were safe and effective for treatment of chronic ear infections in humans. Additionally, there have been numerous animal and other experimental clinical trials evaluating the efficacy of bacteriophages for various diseases, such as infected burns and wounds, and cystic fibrosis associated lung infections, among others.     Meanwhile, bacteriophage researchers have been developing engineered viruses to overcome ": null
    },
    {
        "antibiotic resistance": "antimicrobial resistance"
    },
    {
        ", and engineering the phage genes responsible for coding enzymes that degrade the biofilm matrix, phage structural proteins, and the enzymes responsible for ": null
    },
    {
        "lysis": "lysis"
    },
    {
        " of the bacterial cell wall. There have been results showing that T4 phages that are small in size and short-tailed, can be helpful in detecting E.coli in the human body.      Therapeutic efficacy of a phage cocktail was evaluated in a mice model with nasal infection of multidrug-resistant A. baumannii. Mice treated with the phage cocktail showed a 2.3-fold higher survival rate than those untreated in seven days post infection.  In 2017 a patient with a pancreas compromised by MDR A. baumannii was put on several antibiotics, despite this the patient’s health continued to deteriorate during a four-month period. Without effective antibiotics the patient was subjected to phage therapy using a phage cocktail containing nine different phages that had been demonstrated to be effective against MDR A. baumannii. Once on this therapy the patient’s downward clinical trajectory reversed, and returned to health.      DHerelle quickly learned that bacteriophages are found wherever bacteria thrive: in sewers, in rivers that catch waste runoff from pipes, and in the stools of convalescent patients.  This includes rivers traditionally thought to have healing powers, including Indias ": null
    },
    {
        "Ganges": "ganges"
    },
    {
        " River.        Food industry - Since 2006, the ": null
    },
    {
        "United States Food and Drug Administration": "united states food and drug administration"
    },
    {
        " and ": null
    },
    {
        "United States Department of Agriculture": "united states department of agriculture"
    },
    {
        " have approved several bacteriophage products. LMP-102 was approved for treating ready-to-eat poultry and meat products. In that same year, the FDA approved LISTEX  using bacteriophages on cheese to kill  Listeria monocytogenes  bacteria, in order to give them ": null
    },
    {
        "generally recognized as safe": "generally recognized as safe"
    },
    {
        " status. U.S. FDA/CFSAN: Agency Response Letter, GRAS Notice No. 000198 In July 2007, the same bacteriophage were approved for use on all food products. In 2011 USDA confirmed that LISTEX is a clean label processing aid and is included in USDA.   Research in the field of food safety is continuing to see if lytic phages are a viable option to control other food-borne pathogens in various food products.     Dairy industry - Bacteriophages present in the environment can cause fermentation failures of cheese starter cultures. In order to avoid this, mixed-strain starter cultures and culture rotation regimes can be used.      Diagnostics - In 2011, the FDA cleared the first bacteriophage-based product for in vitro diagnostic use.  The KeyPath MRSA/MSSA Blood Culture Test uses a cocktail of bacteriophage to detect  Staphylococcus aureus  in positive blood cultures and determine ": null
    },
    {
        "methicillin": "methicillin"
    },
    {
        " resistance or susceptibility. The test returns results in about five hours, compared to two to three days for standard microbial identification and susceptibility test methods. It was the first accelerated antibiotic-susceptibility test approved by the FDA. . FDA     Counteracting bioweapons and toxins - Government agencies in the West have for several years been looking to ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        " and the former ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " for help with exploiting phages for counteracting bioweapons and toxins, such as ": null
    },
    {
        "anthrax": "anthrax"
    },
    {
        " and ": null
    },
    {
        "botulism": "botulism"
    },
    {
        ". Vaisman, Daria . The New York Times Developments are continuing among research groups in the U.S. Other uses include spray application in horticulture for protecting plants and vegetable produce from decay and the spread of bacterial disease. Other applications for bacteriophages are as biocides for environmental surfaces, e.g., in hospitals, and as preventative treatments for catheters and medical devices before use in clinical settings. The technology for phages to be applied to dry surfaces, e.g., uniforms, curtains, or even sutures for surgery now exists. Clinical trials reported in Clinical Otolaryngology show success in veterinary treatment of pet dogs with ": null
    },
    {
        "otitis": "otitis"
    },
    {
        ".     The ": null
    },
    {
        "SEPTIC": "sensing of phage-triggered ion cascades"
    },
    {
        " bacterium sensing and identification method uses the ion emission and its dynamics during phage infection and offers high specificity and speed for detection.       Phage display  is a different use of phages involving a library of phages with a variable peptide linked to a surface protein. Each phage genome encodes the variant of the protein displayed on its surface , providing a link between the peptide variant and its encoding gene. Variant phages from the library may be selected through their binding affinity to an immobilized molecule to neutralize it. The bound, selected phages can be multiplied by reinfecting a susceptible bacterial strain, thus allowing them to retrieve the peptides encoded in them for further study.      Antimicrobial drug discovery - Phage proteins often have antimicrobial activity and may serve as leads for ": null
    },
    {
        "peptidomimetic": "peptidomimetic"
    },
    {
        "s, i.e. drugs that mimic peptides.  ": null
    },
    {
        "Phage-ligand technology": "phage-ligand technology"
    },
    {
        " makes use of phage proteins for various applications, such as binding of bacteria and bacterial components  and lysis of bacteria.      Basic research - Bacteriophages are important ": null
    },
    {
        "model organisms": "model organisms"
    },
    {
        " for studying principles of ": null
    },
    {
        "evolution": "evolution"
    },
    {
        " and ": null
    },
    {
        "ecology": "ecology"
    },
    {
        ".           Bacteriophages may have a ": null
    },
    {
        "lytic cycle": "lytic cycle"
    },
    {
        " or a ": null
    },
    {
        "lysogenic cycle": "lysogenic cycle"
    },
    {
        ", and a few viruses are capable of carrying out both. With lytic phages such as the ": null
    },
    {
        "T4 phage": "t4 phage"
    },
    {
        ", bacterial cells are broken open and destroyed after immediate replication of the virion. As soon as the cell is destroyed, the phage progeny can find new hosts to infect. Lytic phages are more suitable for ": null
    },
    {
        "phage therapy": "phage therapy"
    },
    {
        ". Some lytic phages undergo a phenomenon known as lysis inhibition, where completed phage progeny will not immediately lyse out of the cell if extracellular phage concentrations are high. This mechanism is not identical to that of ": null
    },
    {
        "temperate phage": "temperateness"
    },
    {
        " going dormant and usually, is temporary.     In contrast, the  lysogenic cycle  does not result in immediate lysing of the host cell. Those phages able to undergo lysogeny are known as ": null
    },
    {
        "temperate phage": "temperate phage"
    },
    {
        "s. Their viral genome will integrate with host DNA and replicate along with it, relatively harmlessly, or may even become established as a ": null
    },
    {
        "plasmid": "plasmid"
    },
    {
        ". The virus remains dormant until host conditions deteriorate, perhaps due to depletion of nutrients, then, the ": null
    },
    {
        "endogenous": "endogenous"
    },
    {
        " phages  become active. At this point they initiate the reproductive cycle, resulting in lysis of the host cell. As the lysogenic cycle allows the host cell to continue to survive and reproduce, the virus is replicated in all offspring of the cell. An example of a bacteriophage known to follow the lysogenic cycle and the lytic cycle is the ": null
    },
    {
        "phage lambda": "phage lambda"
    },
    {
        " of E. coli. Mason, Kenneth A., Jonathan B. Losos, Susan R. Singer, Peter H Raven, and George B. Johnson. . Biology, p. 533. McGraw-Hill, New York. .     Sometimes prophages may provide benefits to the host bacterium while they are dormant by adding new functions to the bacterial ": null
    },
    {
        "genome": "genome"
    },
    {
        ", in a phenomenon called ": null
    },
    {
        "lysogenic conversion": "lysogenic conversion"
    },
    {
        ". Examples are the conversion of harmless strains of  Corynebacterium diphtheriae  or  Vibrio cholerae  by bacteriophages, to highly virulent ones that cause ": null
    },
    {
        "diphtheria": "diphtheria"
    },
    {
        " or ": null
    },
    {
        "cholera": "cholera"
    },
    {
        ", respectively.   Strategies to combat certain bacterial infections by targeting these toxin-encoding prophages have been proposed.                Bacterial cells are protected by a cell wall of ": null
    },
    {
        "polysaccharides": "polysaccharides"
    },
    {
        ", which are important virulence factors protecting bacterial cells against both immune host defenses and ": null
    },
    {
        "antibiotics": "antibiotics"
    },
    {
        ".  To enter a host cell, bacteriophages attach to specific receptors on the surface of bacteria, including ": null
    },
    {
        "lipopolysaccharide": "lipopolysaccharide"
    },
    {
        "s, ": null
    },
    {
        "teichoic acid": "teichoic acid"
    },
    {
        "s, ": null
    },
    {
        "protein": "protein"
    },
    {
        "s, or even ": null
    },
    {
        "flagella": "flagella"
    },
    {
        ". This specificity means a bacteriophage can infect only certain bacteria bearing receptors to which they can bind, which in turn, determines the phages host range. Polysaccharide-degrading enzymes, like endolysins are virion-associated proteins to enzymatically degrade the capsular outer layer of their hosts, at the initial step of a tightly programmed phage infection process.   Host growth conditions also influence the ability of the phage to attach and invade them.  As phage virions do not move independently, they must rely on random encounters with the correct receptors when in solution, such as blood, lymphatic circulation, irrigation, soil water, etc.     Myovirus bacteriophages use a ": null
    },
    {
        "hypodermic syringe": "hypodermic syringe"
    },
    {
        "-like motion to inject their genetic material into the cell. After contacting the appropriate receptor, the tail fibers flex to bring the base plate closer to the surface of the cell. This is known as reversible binding. Once attached completely, irreversible binding is initiated and the tail contracts, possibly with the help of ": null
    },
    {
        "ATP": "adenosine triphosphate"
    },
    {
        ", present in the tail, injecting genetic material through the bacterial membrane. The injection is accomplished through a sort of bending motion in the shaft by going to the side, contracting closer to the cell and pushing back up. Podoviruses lack an elongated tail sheath like that of a myovirus, so instead, they use their small, tooth-like tail fibers enzymatically to degrade a portion of the cell membrane before inserting their genetic material.       Within minutes, bacterial ": null
    },
    {
        "ribosomes": "ribosome"
    },
    {
        "start translating viral mRNA into protein. For RNA-based phages, ": null
    },
    {
        "RNA replicase": "rna replicase"
    },
    {
        " is synthesized early in the process. Proteins modify the bacterial ": null
    },
    {
        "RNA polymerase": "rna polymerase"
    },
    {
        " so it preferentially transcribes viral mRNA. The host’s normal synthesis of proteins and nucleic acids is disrupted, and it is forced to manufacture viral products instead. These products go on to become part of new virions within the cell, helper proteins that contribute to the assemblage of new virions, or proteins involved in cell ": null
    },
    {
        "lysis": "lysis"
    },
    {
        ". In 1972, ": null
    },
    {
        "Walter Fiers": "walter fiers"
    },
    {
        "  was the first to establish the complete nucleotide sequence of a gene and in 1976, of the viral genome of ": null
    },
    {
        "bacteriophage MS2": "bacteriophage ms2"
    },
    {
        ".  Some dsDNA bacteriophages encode ribosomal proteins, which are thought to modulate protein translation during phage infection.        In the case of the ": null
    },
    {
        "T4 phage": "t4 phage"
    },
    {
        ", the construction of new virus particles involves the assistance of helper proteins. The base plates are assembled first, with the tails being built upon them afterward. The head capsids, constructed separately, will spontaneously assemble with the tails. The DNA is packed efficiently within the heads. The whole process takes about 15 minutes.          Phages may be released via cell lysis, by extrusion, or, in a few cases, by budding. Lysis, by tailed phages, is achieved by an enzyme called ": null
    },
    {
        "endolysin": "endolysin"
    },
    {
        ", which attacks and breaks down the cell wall ": null
    },
    {
        "peptidoglycan": "peptidoglycan"
    },
    {
        ". An altogether different phage type, the ": null
    },
    {
        "filamentous phage": "filamentous phage"
    },
    {
        ", make the host cell continually secrete new virus particles. Released virions are described as free, and, unless defective, are capable of infecting a new bacterium. Budding is associated with certain  Mycoplasma  phages. In contrast to virion release, phages displaying a ": null
    },
    {
        "lysogenic": "lysogenic"
    },
    {
        " cycle do not kill the host but, rather, become long-term residents as ": null
    },
    {
        "prophage": "prophage"
    },
    {
        ".       Research in 2019 revealed that the bacteriophage Φ3T makes a short viral protein that signals other bacteriophages to lie dormant instead of killing the host bacterium. ": null
    },
    {
        "Arbitrium": "arbitrium"
    },
    {
        " is the name given to this protein by the researchers who discovered it.         Given the millions of different phages in the environment, phage genomes come in a variety of forms and sizes. RNA phage such as ": null
    },
    {
        "MS2": "bacteriophage ms2"
    },
    {
        " have the smallest genomes, of only a few kilobases. However, some DNA phage such as ": null
    },
    {
        "T4": "enterobacteria phage t4"
    },
    {
        " may have large genomes with hundreds of genes; the size and shape of the ": null
    },
    {
        "capsid": "capsid"
    },
    {
        " varies along with the size of the genome.      Bacteriophage genomes can be highly ": null
    },
    {
        "mosaic": "mosaic"
    },
    {
        ", i.e. the genome of many phage species appear to be composed of numerous individual modules. These modules may be found in other phage species in different arrangements. ": null
    },
    {
        "Mycobacteriophage": "mycobacteriophage"
    },
    {
        "s, bacteriophages with ": null
    },
    {
        "mycobacteria": "mycobacteria"
    },
    {
        "l hosts, have provided excellent examples of this mosaicism. In these mycobacteriophages, genetic assortment may be the result of repeated instances of ": null
    },
    {
        "site-specific recombination": "site-specific recombination"
    },
    {
        " and ": null
    },
    {
        "illegitimate recombination": "illegitimate recombination"
    },
    {
        " .  Evolutionary mechanisms shaping the genomes of bacterial viruses vary between different families and depend upon the type of the nucleic acid, characteristics of the virion structure, as well as the mode of the viral life cycle.        Phage often have dramatic effects on their hosts. As a consequence, the transcription pattern of the infected bacterium may change considerably. For instance, infection of  Pseudomonas aeruginosa  by the temperate phage PaP3 changed the expression of 38% of its hosts genes. Many of these effects are probably indirect, hence the challenge becomes to identify the direct interactions among bacteria and phage.      Several attempts have been made to map ": null
    },
    {
        "protein–protein interactions": "protein–protein interaction"
    },
    {
        "among phage and their host. For instance, bacteriophage lambda was found to interact with its host, ": null
    },
    {
        "E. coli": "escherichia coli"
    },
    {
        ", by 31 interactions. However, a large-scale study revealed 62 interactions, most of which were new. Again, the significance of many of these interactions remains unclear, but these studies suggest that there most likely are several key interactions and many indirect interactions whose role remains uncharacterized.           ": null
    },
    {
        "Metagenomics": "metagenomics"
    },
    {
        " has allowed the in-water detection of bacteriophages that was not possible previously.      Also, bacteriophages have been used in ": null
    },
    {
        "hydrological": "hydrology"
    },
    {
        " tracing and modelling in ": null
    },
    {
        "river": "river"
    },
    {
        " systems, especially where surface water and ": null
    },
    {
        "groundwater": "groundwater"
    },
    {
        " interactions occur. The use of phages is preferred to the more conventional ": null
    },
    {
        "dye": "dye"
    },
    {
        " marker because they are significantly less absorbed when passing through ground waters and they are readily detected at very low concentrations.  Non-polluted water may contain approximately 2×10 8 bacteriophages per mL.      Bacteriophages are thought to contribute extensively to ": null
    },
    {
        "horizontal gene transfer": "horizontal gene transfer"
    },
    {
        " in natural environments, principally via ": null
    },
    {
        "transduction": "transduction"
    },
    {
        ", but also via ": null
    },
    {
        "transformation": "transformation"
    },
    {
        ".  ": null
    },
    {
        "Metagenomics": "metagenomics"
    },
    {
        "-based studies also have revealed that ": null
    },
    {
        "viromes": "virome"
    },
    {
        "from a variety of environments harbor antibiotic-resistance genes, including those that could confer ": null
    },
    {
        "multidrug resistance": "multidrug resistance"
    },
    {
        ".        The following bacteriophages are extensively studied:    ": null
    },
    {
        "186 phage": "186 phage"
    },
    {
        " λ phage": "lambda phage"
    },
    {
        " Φ6 phage": "pseudomonas phage φ6"
    },
    {
        " Φ29 phage": "φ29 phage"
    },
    {
        " ΦX174": "phi x 174"
    },
    {
        " G4 phage": "g4 phage"
    },
    {
        " M13 phage": "m13 phage"
    },
    {
        " MS2 phage": "ms2 phage"
    },
    {
        "     N4 phage": "n4 phage"
    },
    {
        " P1 phage": "p1 phage"
    },
    {
        " P2 phage": "enterobacteria phage p2"
    },
    {
        " P4 phage": "p4 phage"
    },
    {
        " R17 phage": "r17 phage"
    },
    {
        " T2 phage": "t2 phage"
    },
    {
        " T4 phage": "t4 phage"
    },
    {
        "    T7 phage": "t7 phage"
    },
    {
        " T12 phage": "t12 phage"
    },
    {
        "   ": null
    }
]