[
    {
        "Bahram II  was the fifth ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " King of Kings": "king of kings"
    },
    {
        " of ": null
    },
    {
        "Iran": "iran"
    },
    {
        " from 42 to 42 He was the son and successor of ": null
    },
    {
        "Bahram I": "bahram i"
    },
    {
        " . Bahram II, while still in his teens, ascended the throne with the aid of the powerful ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " priest ": null
    },
    {
        "Kartir": "kartir"
    },
    {
        " just like his father had done.     He was met with considerable challenges during his reign, facing a rebellion in the east led by his brother, the ": null
    },
    {
        "Kushano-Sasanian": "kushano-sasanian"
    },
    {
        " dynast ": null
    },
    {
        "Hormizd I Kushanshah": "hormizd i kushanshah"
    },
    {
        ", who assumed the title of King of Kings, possibly laying claims to the Sasanian throne. Another rebellion, led by Bahram IIs cousin ": null
    },
    {
        "Hormizd of Sakastan": "hormizd of sakastan"
    },
    {
        " in ": null
    },
    {
        "Sakastan": "sakastan"
    },
    {
        ", also occurred around this period. In ": null
    },
    {
        "Khuzestan": "khuzestan"
    },
    {
        ", a ": null
    },
    {
        "Zoroastrian": "zoroastrianism"
    },
    {
        " factional revolt led by high-priest  occurred. The ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " emperor ": null
    },
    {
        "Carus": "carus"
    },
    {
        " exploited the turbulent situation of Iran by making a campaign into its holdings in ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " in 42 Bahram II, who was in the east, was unable mount an effective coordinated defense at the time, possibly losing his capital of ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        " to the Roman emperor. However, Carus shortly died afterwards, reportedly being struck by lightning. The Roman army as a result withdrew, and Mesopotamia was reclaimed by the Sasanians. By the end of his reign, Bahram II had made peace with the Roman emperor ": null
    },
    {
        "Diocletian": "diocletian"
    },
    {
        " and put an end to the disturbances in Khuzestan and the east.     Bahram II was the first Sasanian ruler to have ": null
    },
    {
        "coins": "sasanian coinage"
    },
    {
        " minted of his family. He also ordered the carving of several rock reliefs that unambiguously emphasizes distinguished representations of his family and members of the high nobility. He was succeeded by his son ": null
    },
    {
        "Bahram III": "bahram iii"
    },
    {
        ", who after only four months of reigning, was overthrown by ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        ", a son of the second Sasanian ruler ": null
    },
    {
        "Shapur I": "shapur i"
    },
    {
        " .       His ": null
    },
    {
        "theophoric name": "theophoric name"
    },
    {
        " Bahram is the ": null
    },
    {
        "New Persian": "new persian"
    },
    {
        " form of the ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " Warahrān , which is derived from the ": null
    },
    {
        "Old Iranian": "old iranian languages"
    },
    {
        " Vṛθragna. The ": null
    },
    {
        "Avestan": "avestan"
    },
    {
        " equivalent was ": null
    },
    {
        "Verethragna": "verethragna"
    },
    {
        ", the name of the old Iranian god of victory, whilst the ": null
    },
    {
        "Parthian": "parthian language"
    },
    {
        " version was Warθagn. The name is transliterated in ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " as Baranes, whilst the ": null
    },
    {
        "Armenian": "armenian language"
    },
    {
        " transliteration is Vahagn/Vrām.       Bahram II was the eldest son of Bahram I, and the grandson of the prominent Sasanian king  ": null
    },
    {
        "Shapur I": "shapur i"
    },
    {
        " . He had not yet been born when ": null
    },
    {
        "Shapur Is inscription at the Kaba-ye Zartosht": "shapur is inscription at the kaba-ye zartosht"
    },
    {
        " was created in c. 42 due to not being mentioned in it. Bahram IIs father, Bahram I, although being the eldest son of Shapur I, was not considered a candidate for succession, probably due to his mothers lowly origin, who was either a minor queen or perhaps even a ": null
    },
    {
        "concubine": "concubine"
    },
    {
        ". Shapur I died in 42 and was succeeded by his son ": null
    },
    {
        "Hormizd I": "hormizd i"
    },
    {
        ", who only reigned for a year before he died. Bahram I, with the aid of the powerful ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " priest ": null
    },
    {
        "Kartir": "kartir"
    },
    {
        ", ascended the throne. He then made a settlement with his brother ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        " to give up his entitlement to the throne in return for the governorship of the important frontier province of ": null
    },
    {
        "Armenia": "sasanian armenia"
    },
    {
        ", which was constantly the source of war between the ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " and Sasanian Empires. Nevertheless, Narseh still most likely viewed Bahram I as a usurper.       Bahram was shortly given the governorship of ": null
    },
    {
        "Sakastan": "sakastan"
    },
    {
        ", ": null
    },
    {
        "Sindh": "sindh"
    },
    {
        " and ": null
    },
    {
        "Turgistan": "turgistan"
    },
    {
        ", which Narseh had previously governed. The provinces were far away from the imperial court in ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ", and had since its conquest by the Sasanians served as a difficult area for them to maintain control over. As a result, the province had since its early days functioned as a form of vassal kingdom, ruled by princes from the Sasanian family, who held the title of  sakanshah  . Bahram Is reign, however, lasted shortly, ending on September 42 with his death. Bahram II, still in his teens, succeeded him as shah; he was probably aided by Kartir to ascend the throne instead of Narseh. This most likely frustrated Narseh, who held the title of Vazurg Šāh Arminān , which was used by the heir to the throne.     Bahram IIs accession is mentioned in the narratives included in the history of the medieval Iranian historian ": null
    },
    {
        "al-Tabari": "al-tabari"
    },
    {
        ";                 Bahram II was met with considerable challenges during his reign. His brother ": null
    },
    {
        "Hormizd I Kushanshah": "hormizd i kushanshah"
    },
    {
        ", who governed the eastern portion of the empire , rebelled against him. Hormizd I Kushanshah was the first Kushano-Sasanian ruler to mint coins with the inscription of Hormizd, the Great Kushan King of Kings instead of the traditional Great Kushan King title. The Kushano-Sasanian king, now laying claims to the title of King of Kings, which had originally also been used by the ": null
    },
    {
        "Kushan Empire": "kushan empire"
    },
    {
        ", displays a noteworthy transition in Kushano-Sasanian ideology and self-perception and possibly a direct dispute with the ruling branch of the Sasanian family. Hormizd I Kushanshah was supported in his efforts by the Sakastanis, ": null
    },
    {
        "Gilaks": "gilan province"
    },
    {
        ", and Kushans. Another revolt also occurred in Sakastan, led by Bahram IIs cousin ": null
    },
    {
        "Hormizd of Sakastan": "hormizd of sakastan"
    },
    {
        ", who has been suggested to be the same person as Hormizd I Kushanshah. However, according to ": null
    },
    {
        "Rezakhani": "khodadad rezakhani"
    },
    {
        ", this proposal must now be disregarded. At the same time, a revolt led by a high-priest  occurred in the province of ": null
    },
    {
        "Khuzestan": "khuzestan"
    },
    {
        ", which was seized by the latter for a period.     Meanwhile, the Roman emperor ": null
    },
    {
        "Carus": "carus"
    },
    {
        ", hearing of the civil war occurring in the Sasanian Empire, chose to take advantage of the situation by making a campaign into the empire in 42 He invaded ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " while Bahram II was in the east, and even besieged the Sasanian capital of Ctesiphon without facing much fighting. The Sasanians, due to facing severe internal problems, were unable to mount an effective coordinated defense at the time; Carus and his army may have captured Ctesiphon. However, Carus shortly died afterwards, reportedly being struck by lightning. The Roman army as a result withdrew, and Mesopotamia was re-conquered by the Sasanians.          The following year, Bahram II made peace with the Romans, now ruled by ": null
    },
    {
        "Diocletian": "diocletian"
    },
    {
        ", who was faced with internal issues of his own. The terms of the peace was reportedly that Armenia was to be divided between the two empires, with ": null
    },
    {
        "Western Armenia": "byzantine armenia"
    },
    {
        " being ruled by the pro-Roman ": null
    },
    {
        "Arsacid": "arsacid dynasty of armenia"
    },
    {
        " prince ": null
    },
    {
        "Tiridates III": "tiridates iii of armenia"
    },
    {
        ", and the remaining greater portion being kept by Narseh. However, this division is dismissed by Weber, who argues that it conflicts with other sources, and that the Sasanians most likely kept control over Armenia until the later ": null
    },
    {
        "Roman-Iranian treaty of 42": "peace of nisibis"
    },
    {
        ". In the same year, Bahram II secured the ": null
    },
    {
        "Iberian": "kingdom of iberia"
    },
    {
        " throne for ": null
    },
    {
        "Mirian III": "mirian iii of iberia"
    },
    {
        ", an Iranian nobleman from the ": null
    },
    {
        "House of Mihran": "house of mihran"
    },
    {
        ", one of the ": null
    },
    {
        "Seven Great Houses of Iran": "seven great houses of iran"
    },
    {
        ". The motive behind was to strengthen Sasanian authority in the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " and utilize the position of the Iberian capital ": null
    },
    {
        "Mtskheta": "mtskheta"
    },
    {
        " as an entrance to the important passes through the ": null
    },
    {
        "Caucasus Mountains": "caucasus mountains"
    },
    {
        ". This was of so high importance to Bahram II, that he allegedly himself went to Mtskheta in order to secure Mirian IIIs position. He also sent one of his grandees named Mirvanoz to the country in order to act as the guardian of Mirian III, who was then merely aged seven.     By the time of Bahram IIs death in 42 the revolts in the east had been suppressed, with his son and heir ": null
    },
    {
        "Bahram III": "bahram iii"
    },
    {
        " being appointed the governor of Sakastan, receiving the title of  sakanshah  . Following Bahram IIs death, Bahram III was unwillingly proclaimed shah in ": null
    },
    {
        "Pars": "pars"
    },
    {
        " by a group of nobles led by ": null
    },
    {
        "Wahnam": "wahnam"
    },
    {
        " and supported by Adurfarrobay, governor of ": null
    },
    {
        "Meshan": "meshan"
    },
    {
        ". After four months of reigning, however, he was overthrown by Narseh, who had Wahnam executed. The line was thus shifted to Narseh, whose descendants continued to rule the empire until its fall in 42       Before Bahram II, all the previous Sasanian shahs had been lukewarm Zoroastrians.  He displayed a particular fondness to his name-deity by giving his son the name of Bahram, and selecting the wings of the gods bird, ": null
    },
    {
        "Verethragna": "verethragna"
    },
    {
        ", as the central component of his crown. Bahram II, like his father, received the influential Zoroastrian priest ": null
    },
    {
        "Kartir": "kartir"
    },
    {
        " well. He saw him as his mentor, and handed out several honors to him, giving him the rank of grandee , and appointing him as the supreme judge  of the whole empire, which indicates that thenceforth priests were given the office of judge. Kartir was also appointed the steward of the ": null
    },
    {
        "Anahid fire-temple": "anahid fire-temple"
    },
    {
        " at ": null
    },
    {
        "Istakhr": "istakhr"
    },
    {
        ", which had originally been under the care of the Sasanian family. The Sasanian kings thus lost much of their religious authority in the empire. The clergy from now on served as judges all over the country, with court cases most likely being based on Zoroastrian jurisprudence, with the expection of when representatives of other religions had conflicts with each other.     It is thus under Bahram II that Kartir unquestionably becomes a powerful figure in the empire; the latter claimed on his inscription that he struck down the non-Zoroastrian minorities, such as the ": null
    },
    {
        "Christians": "christianity"
    },
    {
        ", ": null
    },
    {
        "Jews": "jews"
    },
    {
        ", ": null
    },
    {
        "Mandaeans": "mandaeans"
    },
    {
        ", ": null
    },
    {
        "Manichaeans": "manichaeism"
    },
    {
        ", and ": null
    },
    {
        "Buddhists": "buddhism"
    },
    {
        ". According to the modern historian Parvaneh Pourshariati: it is not clear, however, to what extent Kartirs declarations reflect the actual implementation, or for that matter, success, of the measures he is supposed to have promoted.  Indeed, Jewish and Christian sources, for example, makes no mention of persecutions during this period.          Starting with Bahram II, all the Sasanian shahs are portrayed with earrings on their ": null
    },
    {
        "coins": "sasanian coinage"
    },
    {
        ". He is the first shah to have wings on his crown, which refers to the wings of the gods bird, Verethragna. Like his predecessors , Bahram IIs legend on his coinage was the Mazda-worshiping, divine Bahram, King of Kings of Iran and non-Iran, whose image/brilliance is from the gods.      Bahram II was the first shah to have coins minted of his family. According to the ": null
    },
    {
        "Iranologist": "iranologist"
    },
    {
        " Touraj Daryaee": "touraj daryaee"
    },
    {
        ", this is an interesting feature of Bahram II in that he was very much concerned to leave a portrait of his family which incidentally gives us information about the court and the ": null
    },
    {
        "Persian": "persian people"
    },
    {
        " concept of the royal banquet .  Several coin types were minted during Bahram IIs reign; one type imitates him alone; another with him and a female figure; a third one with Bahram II and an unbearded youngster wearing a high ": null
    },
    {
        "tiara": "tiara"
    },
    {
        " ; and a fourth one shows Bahram II with the female figure and the unbearded youngster all together. The female figure is wearing different headdress on some of the coins, sometimes with a boar, griffin, horse or eagle. The precise meaning of this, however, is unclear.     Due to there being no information in the legends regarding the status of these characters, it is difficult to analyze them. The unbearded youngster is usually understood as being the crown prince Bahram III, while the female figure is usually labelled as Bahram IIs queen Shapurdukhtak, who was his cousin. The modern historian ": null
    },
    {
        "Jamsheed Choksy": "jamsheed choksy"
    },
    {
        " has attempted to establish that the female figure in reality illustrates the goddess ": null
    },
    {
        "Anahita": "anahita"
    },
    {
        ", whilst the unbearded youngster illustrates Verethragna. The reverse shows the traditional ": null
    },
    {
        "fire altar": "fire altar"
    },
    {
        " flanked by two attendants. ": null
    },
    {
        "Shapurdukhtak": "shapurdukhtak"
    },
    {
        " Bahram III": "bahram iii"
    },
    {
        "    Various rock reliefs were carved under Bahram II; one of them being at ": null
    },
    {
        "Guyom": "guyim, shiraz"
    },
    {
        ", 42  km northwest of ": null
    },
    {
        "Shiraz": "shiraz"
    },
    {
        ", where Bahram is portrayed standing alone. An additional relief is situated at ": null
    },
    {
        "Sar Mashhad": "sar mashhad"
    },
    {
        " south of ": null
    },
    {
        "Kazerun": "kazerun"
    },
    {
        ", which portrays Bahram as a hunter who has slayed a lion whilst throwing his sword at another. His queen Shapurdukhtak is holding his right hand in a signal of safeguard, whilst Kartir and another figure, most likely a prince, are watching. The scenery has been the subject of several symbolic and metaphorical meanings, thought it is most likely supposed to portray a simple royal display of braveness during a real-life hunt. An inscription of Kartir is underneath the relief. A third relief at ": null
    },
    {
        "Sarab-e Bahram": "sarab-e bahram"
    },
    {
        ", close to ": null
    },
    {
        "Nurabad": "nurabad, fars"
    },
    {
        ", and 42  km north of ": null
    },
    {
        "Bishapur": "bishapur"
    },
    {
        ", portrays Bahram II facing, with Kartir and Papak, the governor of Iberia, to his left, and two other grandees to his right.     A fourth relief at Bishapur, portrays Bahram mounted on a horse, whilst facing an Iranian grandee who is escorting a group of six men resembling ": null
    },
    {
        "Arabs": "arabs"
    },
    {
        " in their clothing, arriving with horses and ": null
    },
    {
        "dromedaries": "dromedary"
    },
    {
        ", presumably as tribute. The historical circumstance of the scene, however, remains unsure. A fifth relief at ": null
    },
    {
        "Naqsh-e Rostam": "naqsh-e rostam"
    },
    {
        ", portrays Bahram II standing whilst being surrounded by his family members and attendants; to his left are the sculptures of Shapurdukhtak, a prince, the crown prince Bahram III, Kartir, and Narseh. To his right are the sculptures of Papak, and two other grandees. ": null
    },
    {
        "Naqsh-e Rostam": "naqsh-e rostam"
    },
    {
        " Sarab-e Bahram": "sarab-e bahram"
    },
    {
        " relief of Bahram II surrounded by grandees, ": null
    },
    {
        "Kartir": "kartir"
    },
    {
        " Barm-e Delak": "barm-e delak"
    },
    {
        " relief of a princess and an unidentified grandee, possibly Bahram II.         During the reign of Bahram II, art in Sasanian Iran flourished, notably in the portrayals of the shah and his courtiers. He is the first and penultimate shah to have a woman illustrated on his coins, the other one being the 42th-century Sasanian queen ": null
    },
    {
        "Boran": "boran"
    },
    {
        " . The modern historian Matthew P. Canepa calls Bahram II a relatively weak shah, whose shortscomings allowed Kartir to take over some of the royal privileges. Military wise, however, Bahram II was more successful, putting an end to the disturbances in Khuzestan and the east, and repelling the Romans from Mesopotamia.       ": null
    }
]