[
    {
        "   Bahram I  was the fourth ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " King of Kings": "king of kings"
    },
    {
        " of ": null
    },
    {
        "Iran": "iran"
    },
    {
        " from 42 to 42 He was the eldest son of ": null
    },
    {
        "Shapur I": "shapur i"
    },
    {
        "  and succeeded his brother ": null
    },
    {
        "Hormizd I": "hormizd i"
    },
    {
        " , who had reigned for a year.     Bahram Is reign marked the end of the Sasanian tolerance towards ": null
    },
    {
        "Manichaeism": "manichaeism"
    },
    {
        ", and in 42 with the support of the influential Zoroastrian priest ": null
    },
    {
        "Kartir": "kartir"
    },
    {
        ", he had ": null
    },
    {
        "Mani": "mani"
    },
    {
        " imprisoned and executed. Bahram Is reign was largely uneventful. He was succeeded by his son ": null
    },
    {
        "Bahram II": "bahram ii"
    },
    {
        ".       The ": null
    },
    {
        "theophoric name": "theophoric name"
    },
    {
        " Bahram is the ": null
    },
    {
        "New Persian": "new persian"
    },
    {
        " form of the ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " Warahrān , which is derived from the ": null
    },
    {
        "Old Iranian": "old iranian languages"
    },
    {
        " Vṛθragna. The ": null
    },
    {
        "Avestan": "avestan"
    },
    {
        " equivalent was ": null
    },
    {
        "Verethragna": "verethragna"
    },
    {
        ", the name of the old Iranian god of victory, whilst the ": null
    },
    {
        "Parthian": "parthian language"
    },
    {
        " version was Warθagn. The name is transliterated in ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " as Baranes, whilst the ": null
    },
    {
        "Armenian": "armenian language"
    },
    {
        " transliteration is Vahagn/Vrām.          Bahram I was the oldest son of ": null
    },
    {
        "Shapur I": "shapur i"
    },
    {
        ", the second shah of the Sasanian Empire. He had three younger brothers: ": null
    },
    {
        "Hormizd-Ardashir": "hormizd i"
    },
    {
        ", ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        ", and ": null
    },
    {
        "Shapur Meshanshah": "shapur meshanshah"
    },
    {
        ". Although the oldest of Shapurs sons, Bahram I was ranked below his brothers, probably due to his mothers lowly origin: she was either a minor queen or a ": null
    },
    {
        "concubine": "concubine"
    },
    {
        ". During Shapurs reign, Bahram I served as the governor of the newly conquered region of ": null
    },
    {
        "Gilan": "gilan"
    },
    {
        ", situated on the southwest shore of the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        ". He held the title of Gelan Shah . He is mentioned in an inscription on the wall of the ": null
    },
    {
        "Kaba-ye Zartosht": "kaba-ye zartosht"
    },
    {
        " at ": null
    },
    {
        "Naqsh-e Rostam": "naqsh-e rostam"
    },
    {
        " near ": null
    },
    {
        "Persepolis": "persepolis"
    },
    {
        " in southern Iran, which Shapur I had created in order to praise his sons by citing their names and titles.     Shapur I died in 42 and was succeeded by Hormizd-Ardashir , who ruled from May 42 until his death in June 42 Bahram I, who was never considered a candidate for succession of the throne by his father, ascended with the aid of the powerful ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " priest ": null
    },
    {
        "Kartir": "kartir"
    },
    {
        ". He then made a settlement with Narseh, who agreed to give up his entitlement to the throne in return for the governorship of the important frontier province of ": null
    },
    {
        "Armenia": "sasanian armenia"
    },
    {
        ", which was constantly the source of war between the ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " and Sasanian Empires. It is nevertheless likely that despite this settlement, Narseh still viewed Bahram as a ": null
    },
    {
        "usurper": "usurper"
    },
    {
        ".          The previous Sasanian shahs, including Shapur I, had pursued a policy of religious tolerance towards the non-Zoroastrian minorities in the empire. Although admiring the teachings of his own religion and encouraging the Zoroastrian clergy, Shapur I allowed the ": null
    },
    {
        "Jews": "judaism"
    },
    {
        ", ": null
    },
    {
        "Christians": "christianity"
    },
    {
        ", ": null
    },
    {
        "Buddhists": "buddhism"
    },
    {
        ", and ": null
    },
    {
        "Hindus": "hinduism"
    },
    {
        " to freely practice their own religions. He was also friendly towards ": null
    },
    {
        "Mani": "mani"
    },
    {
        ", the founder of ": null
    },
    {
        "Manichaeism": "manichaeism"
    },
    {
        ", who was allowed to preach freely and even act as an escort in Shapurs military expeditions. Following Bahram Is accession to the throne, the rise of the authority of the Zoroastrian priesthood, and the increasing influence of Kartir, this changed. When Mani arrived at the city of ": null
    },
    {
        "Gundishapur": "gundishapur"
    },
    {
        " there was uproar, in the same fashion as ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " entry into ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ". After protests from Kartir and the other Zoroastrian priests, Bahram I was persuaded to imprison Mani, who was sentenced to death in 42     Manis death was followed by the persecution of his followers by Kartir and the Zoroastrian clergy, who moved against the kingdoms religious minorities as a way to increase and spread their influence. To the Zoroastrian clergy, Mani had been seen as a heterogeneous ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        " and a threatening pagan, who presented an obscure perception of Zoroastrianism that was tainted by Jewish, Buddhist, and Christian ideas. With the backing of Bahram I, Kartir laid the foundations for a Zoroastrian state church, which led to Bahram becoming applauded in Sasanian-based sources as a benevolent and worthy king . Bahram I was nevertheless, like his predecessors, a lukewarm Zoroastrian .     Bahram I died in September 42 and was succeeded by his son ": null
    },
    {
        "Bahram II": "bahram ii"
    },
    {
        ". Another son of Bahram I, ": null
    },
    {
        "Hormizd I Kushanshah": "hormizd i kushanshah"
    },
    {
        ", ruled over the ": null
    },
    {
        "Kushano-Sasanian kingdom": "kushano-sasanian kingdom"
    },
    {
        " in the east, and would later lead a rebellion against Bahram II, which failed. The line of Bahram I continued to rule the Sasanian Empire until 42 when ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        " overthrew the latters grandson ": null
    },
    {
        "Bahram III": "bahram iii"
    },
    {
        " and proclaimed himself the new shah. The line was thus shifted to Narseh and his descendants, who continued to rule the empire until its fall in 42       Under Bahram I, the reverse of ": null
    },
    {
        "coins": "sasanian coinage"
    },
    {
        " were changed back to the version minted during the reign of Shapur I, with two attendants turning their backs to the ": null
    },
    {
        "fire altar": "fire altar"
    },
    {
        ", instead of facing it. The front of Bahram Is coins shows him wearing the distinctive crown of the angelic divinity ": null
    },
    {
        "Mithra": "mithra"
    },
    {
        "; a headgear decorated with ray-shaped spikes. A coin of Bahram was seemingly minted at ": null
    },
    {
        "Balkh": "balkh"
    },
    {
        " in ": null
    },
    {
        "Tukharistan": "tukharistan"
    },
    {
        ", which makes it the first imperial Sasanian coin  minted in the former domains of the ": null
    },
    {
        "Kushan Empire": "kushan empire"
    },
    {
        ", and confirms direct Sasanian rule in the region under Bahram I. The lost Book of the Portraits of Sasanian Kings portrayed Bahram I as standing, holding a lance in the right hand and leaning upon a sword held in the left, and wearing red gown and trousers and a gold crown topped with a sky-blue globe .     Bahram I was keen on combat, hunting, and feasting, which he regarded as righteousness.          Following the precedent of Ardashir I and Shapur I, Bahram I had an image of his accession carved in a ": null
    },
    {
        "rock relief": "rock relief"
    },
    {
        ". It displayed him on horseback, accepting the ": null
    },
    {
        "diadem": "diadem"
    },
    {
        " of kingship from the Zoroastrian supreme god ": null
    },
    {
        "Ahura Mazda": "ahura mazda"
    },
    {
        ", who is also depicted sitting on a horse. A ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " inscription is written on the relief. According to the archaeologist ": null
    },
    {
        "Erich Schmidt": "erich schmidt"
    },
    {
        ", the relief is artistically the most appealing example of Sasanian rock sculpture . When Narseh ascended the throne in 42 he had the rock relief altered, replacing Bahrams name with his own.": null
    }
]