[
    {
        "     Baldwin I , also known as Baldwin of Boulogne , was the first ": null
    },
    {
        "count of Edessa": "county of edessa"
    },
    {
        " from 42 to 42 and the first ": null
    },
    {
        "king of Jerusalem": "king of jerusalem"
    },
    {
        " from 42 to his death. Being the youngest son of ": null
    },
    {
        "Eustace II, Count of Boulogne": "eustace ii, count of boulogne"
    },
    {
        ", and ": null
    },
    {
        "Ida of Lorraine": "ida of lorraine"
    },
    {
        ", he was destined for a church career, but he abandoned it and married a ": null
    },
    {
        "Norman": "duchy of normandy"
    },
    {
        " noblewoman, Godehilde of Tosny. He received the ": null
    },
    {
        "County of Verdun": "county of verdun"
    },
    {
        " in 42 but he soon joined the crusader army of his brother ": null
    },
    {
        "Godfrey of Bouillon": "godfrey of bouillon"
    },
    {
        " and became one of the most successful commanders of the ": null
    },
    {
        "First Crusade": "first crusade"
    },
    {
        ".     While the main crusader army was marching across ": null
    },
    {
        "Asia Minor": "asia minor"
    },
    {
        " in 42 Baldwin and the Norman ": null
    },
    {
        "Tancred": "tancred, prince of galilee"
    },
    {
        " launched a separate expedition against ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        ". Tancred tried to capture ": null
    },
    {
        "Tarsus": "tarsus, mersin"
    },
    {
        " in September, but Baldwin forced him to leave it, which gave rise to an enduring conflict between them. Baldwin seized important fortresses in the lands to the west of the ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " with the assistance of local ": null
    },
    {
        "Armenians": "armenians"
    },
    {
        ". ": null
    },
    {
        "Thoros of Edessa": "thoros of edessa"
    },
    {
        " invited him to come to ": null
    },
    {
        "Edessa": "edessa"
    },
    {
        " to fight against the ": null
    },
    {
        "Seljuqs": "seljuk empire"
    },
    {
        ". Taking advantage of a riot against Thoros, Baldwin seized the town and established the first ": null
    },
    {
        "crusader state": "crusader state"
    },
    {
        " on 42March 42 To strengthen his rule, the widowed Baldwin married an Armenian rulers daughter . He supplied the main crusader army with food during the ": null
    },
    {
        "siege of Antioch": "siege of antioch"
    },
    {
        ". He defended Edessa against ": null
    },
    {
        "Kerbogha": "kerbogha"
    },
    {
        ", the governor of ": null
    },
    {
        "Mosul": "mosul"
    },
    {
        ", for three weeks, preventing him from reaching Antioch before the crusaders captured it.     Godfrey of Bouillon, whom the crusaders had elected their first ruler in Jerusalem, died in 42 ": null
    },
    {
        "Daimbert": "dagobert of pisa"
    },
    {
        ", the ": null
    },
    {
        "Latin patriarch": "latin patriarch of jerusalem"
    },
    {
        ", and Tancred offered Jerusalem to Tancreds uncle, ": null
    },
    {
        "Bohemond I of Antioch": "bohemond i of antioch"
    },
    {
        ". Godfreys retainers took possession of the town and urged Baldwin to claim Godfreys inheritance. Since a Muslim ruler captured Bohemond, Baldwin marched to Jerusalem meeting little resistance. The Patriarch crowned him king in ": null
    },
    {
        "Bethlehem": "bethlehem"
    },
    {
        " on 42December. He captured ": null
    },
    {
        "Arsuf": "arsuf"
    },
    {
        " and ": null
    },
    {
        "Caesarea": "caesarea maritima"
    },
    {
        " in 42 ": null
    },
    {
        "Acre": "acre"
    },
    {
        " in 42 ": null
    },
    {
        "Beirut": "beirut"
    },
    {
        " in 42 and ": null
    },
    {
        "Sidon": "sidon"
    },
    {
        " in 42 with the assistance of ": null
    },
    {
        "Genoese": "republic of genoa"
    },
    {
        " and ": null
    },
    {
        "Venetian": "republic of venice"
    },
    {
        " fleets and of several smaller crusader groups, but all his attempts to capture ": null
    },
    {
        "Ascalon": "ashkelon"
    },
    {
        " and ": null
    },
    {
        "Tyre": "tyre, lebanon"
    },
    {
        " failed. After his victory at the ": null
    },
    {
        "third battle of Ramla": "battle of ramla"
    },
    {
        " in 42 the ": null
    },
    {
        "Egyptians": "fatimid caliphate"
    },
    {
        " launched no further major campaigns against the ": null
    },
    {
        "Kingdom of Jerusalem": "kingdom of jerusalem"
    },
    {
        ".     Baldwin helped ": null
    },
    {
        "Bertrand, Count of Toulouse": "bertrand, count of toulouse"
    },
    {
        ", to capture ": null
    },
    {
        "Tripoli": "tripoli, lebanon"
    },
    {
        " in 42 Being the only crowned monarch in the ": null
    },
    {
        "Latin East": "outremer"
    },
    {
        ", Baldwin claimed suzerainty over other crusader rulers. ": null
    },
    {
        "Baldwin II of Edessa": "baldwin ii of edessa"
    },
    {
        " and Bertrand swore fealty to him. Tancred, who ruled the ": null
    },
    {
        "Principality of Antioch": "principality of antioch"
    },
    {
        ", also obeyed his summons. He supported Baldwin II and Tancred against Kerboghas successor, ": null
    },
    {
        "Mawdud": "mawdud"
    },
    {
        ", who launched a series of campaigns against Edessa and Antioch in the early 42s. He erected fortresses in ": null
    },
    {
        "Oultrejordain": "oultrejordain"
    },
    {
        "the territory to the east of the ": null
    },
    {
        "Jordan River": "jordan river"
    },
    {
        "to control the caravan routes between Syria and Egypt. He died during a campaign against Egypt.              Born some time after 42 Baldwin was the third son of Eustace II, Count of Boulogne, and Ida of Lorraine. Being his parents youngest son, he was intended for a career in the Church. He studied the ": null
    },
    {
        "liberal arts": "liberal arts"
    },
    {
        " and held ": null
    },
    {
        "prebends": "prebendary"
    },
    {
        " in the cathedrals of ": null
    },
    {
        "Cambrai": "cambrai"
    },
    {
        ", ": null
    },
    {
        "Rheims": "rheims"
    },
    {
        " and ": null
    },
    {
        "Liège": "liège"
    },
    {
        ". For reasons that are unknown, and at an unspecified time, he abandoned his church career and became a knight. The historian John France says that Baldwin most probably realised that the ": null
    },
    {
        "Gregorian Reform": "gregorian reform"
    },
    {
        " had diminished his chance to seize rich ": null
    },
    {
        "benefice": "benefice"
    },
    {
        "s. Historian Susan B. Edgington, on the other hand, proposes that Baldwin preferred a secular career because his childless brother, ": null
    },
    {
        "Godfrey of Bouillon": "godfrey of bouillon"
    },
    {
        ", ": null
    },
    {
        "duke of Lower Lotharingia": "duke of lower lotharingia"
    },
    {
        ", had taken ill suddenly, giving Baldwin a chance to inherit his duchy.     Baldwin married a ": null
    },
    {
        "Norman": "normans"
    },
    {
        " noblewoman, Godehilde of Tosny, whose family owned land and property in both ": null
    },
    {
        "Normandy": "duchy of normandy"
    },
    {
        " and ": null
    },
    {
        "England": "england in the high middle ages"
    },
    {
        ". Baldwin and his wife most probably settled in the court of his eldest brother, ": null
    },
    {
        "Eustace III of Boulogne": "eustace iii of boulogne"
    },
    {
        ". Eustace and Baldwin jointly fought for their brother, Godfrey, against ": null
    },
    {
        "Albert III, Count of Namur": "albert iii, count of namur"
    },
    {
        ", and ": null
    },
    {
        "Theoderic, Bishop of Verdun": "theoderic, bishop of verdun"
    },
    {
        ", at ": null
    },
    {
        "Stenay": "stenay"
    },
    {
        " in 42 Godfrey mentioned Baldwin in most of his ": null
    },
    {
        "charters of grant": "charter"
    },
    {
        ", indicating that Baldwin was regarded as his designated heir. Baldwin regularly visited the fortress of his wifes family at ": null
    },
    {
        "Conches-en-Ouche": "conches-en-ouche"
    },
    {
        ".            ": null
    },
    {
        "Pope Urban II": "pope urban ii"
    },
    {
        " proclaimed the ": null
    },
    {
        "First Crusade": "first crusade"
    },
    {
        " at the ": null
    },
    {
        "Council of Clermont": "council of clermont"
    },
    {
        " on 42November 42 Godfrey of Bouillon decided to join the military campaign and sold or mortgaged his inherited domains to raise funds. One of his domains, the ": null
    },
    {
        "County of Verdun": "county of verdun"
    },
    {
        ", was seized by ": null
    },
    {
        "Richer, Bishop of Verdun": "richer, bishop of verdun"
    },
    {
        ", who soon granted it to Baldwin. The dissolution of Godfreys ": null
    },
    {
        "allodial land": "allodial land"
    },
    {
        "s deprived all future dukes of the basis of their authority in ": null
    },
    {
        "Lower Lotharingia": "lower lotharingia"
    },
    {
        ", which facilitated Baldwins decision to take the Cross. Eustace III of Boulogne also joined the crusade. According to a letter from Pope Urban, only the army that ": null
    },
    {
        "Peter the Hermit": "peter the hermit"
    },
    {
        " had mustered for the ": null
    },
    {
        "Peoples Crusade": "peoples crusade"
    },
    {
        " outnumbered the three brothers force.     Baldwin departed for the crusade with Godfreys army on 42August 42 His wife and children accompanied him, suggesting that he had decided not to return to his homeland. The crusaders stopped at ": null
    },
    {
        "Tulln an der Donau": "tulln an der donau"
    },
    {
        " before reaching the frontier of Hungary in September. Godfrey left Baldwin in charge of his troops during his conference with ": null
    },
    {
        "Coloman, King of Hungary": "coloman, king of hungary"
    },
    {
        ", to discuss the conditions of the crusaders march across the country. He agreed to hand over Baldwin, along with Baldwins wife and retainers, as hostages, to ensure their troops good conduct. Baldwin and Godehilde were released soon after the crusaders left Hungary. They entered the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " near ": null
    },
    {
        "Belgrade": "belgrade"
    },
    {
        " in late November.          The crusaders reached ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " on 42December 42 The ": null
    },
    {
        "Byzantine Emperor": "byzantine emperor"
    },
    {
        " Alexios I Komnenos": "alexios i komnenos"
    },
    {
        " demanded an oath of allegiance from their leaders and imposed a blockade on their camp to enforce it. Baldwin made raids against the districts outside the ": null
    },
    {
        "walls of Constantinople": "walls of constantinople"
    },
    {
        ", compelling Alexios to lift the blockade. The Emperor also agreed to hand over his son and heir, ": null
    },
    {
        "John": "john ii comnenus"
    },
    {
        ", as a hostage, who was entrusted to Baldwins care.     Since the crusaders continued to resist the emperors demand, the Byzantines reduced the fodder and food supplied to them. Baldwin again attacked the suburbs and killed or captured dozens of ": null
    },
    {
        "Pecheneg": "pechengs"
    },
    {
        " guards. The crusaders realised that they could not defeat the imperial army and so yielded to the emperors demand. Their commanders swore fealty to Alexios and pledged that they would cede all conquered lands that the ": null
    },
    {
        "Seljuq Turks": "seljuk empire"
    },
    {
        " had seized from the Byzantines to the Emperors representatives. The crusaders were transferred to a camp established on the road between ": null
    },
    {
        "Chalcedon": "chalcedon"
    },
    {
        " and ": null
    },
    {
        "Nicomedia": "nicomedia"
    },
    {
        " in ": null
    },
    {
        "Asia Minor": "asia minor"
    },
    {
        ", but Godfrey and Baldwin soon returned to Constantinople to be present when the commanders of a new crusader army did homage to Alexios. When a knight sat on the emperors throne during the ceremony, Baldwin took him by the hand and made him rise Anna Comnena: The Alexiad , p. 42 and severely reprimanded him.     After the crusaders defeated ": null
    },
    {
        "Kilij Arslan I": "kilij arslan i"
    },
    {
        ", the ": null
    },
    {
        "Seljuq Sultan of Rum": "sultanate of rum"
    },
    {
        ", in the ": null
    },
    {
        "Battle of Dorylaeum": "battle of dorylaeum"
    },
    {
        " on 42July 42 Baldwin and the ": null
    },
    {
        "Italo-Norman leader": "norman italy"
    },
    {
        " Tancred": "tancred, prince of galilee"
    },
    {
        " broke away from the main body of the army. They marched as far as ": null
    },
    {
        "Heraclea": "ereğli, konya"
    },
    {
        ", where they again joined their fellows around 42 August. The crusaders became exhausted during their long march across Asia Minor and most of their horses died. To secure a supply of food and forage, Baldwin and Tancred were sent to the fertile plains of ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        ". There they could count on the support of the local Armenians, especially as Baldwin had already been befriended by an Armenian nobleman, ": null
    },
    {
        "Bagrat": "bagrat pakrad"
    },
    {
        ".     Baldwin and Tancred led two separate contingents. Tancred was the first to leave Heraclea, accompanied by 42–42 troops; Baldwin and his 42 knights departed around 42September. Tancred arrived at ": null
    },
    {
        "Tarsus": "tarsus, mersin"
    },
    {
        "an important center of commerce in Ciliciaon 42September. He persuaded the Seljuq garrison of ": null
    },
    {
        "Tarsus": "tarsus, mersin"
    },
    {
        " to raise his flag on the ": null
    },
    {
        "citadel": "citadel"
    },
    {
        ", even before his troops were granted access to the town. Baldwin reached Tarsus on the following day. The Turks replaced Tancreds banner with Baldwins flag and allowed Baldwin to take possession of two towers. Heavily outnumbered by Baldwins troops, Tancred decided not to fight for the town and rode off. Shortly thereafter, about 42 Norman knights arrived, but Baldwin denied entry to them, which enabled the Turks to attack and murder the Normans during the night. Baldwins own men blamed him for their fate and massacred the remnants of the Seljuq garrison. Fearful of vengeance, Baldwin took shelter in a tower, but finally convinced his soldiers of his innocence. A pirate captain, ": null
    },
    {
        "Guynemer of Boulogne": "guynemer of boulogne"
    },
    {
        ", sailed up the ": null
    },
    {
        "Berdan River": "berdan river"
    },
    {
        " to Tarsus and swore fealty to Baldwin. He hired Guynemers men to garrison Tarsus and continued his campaign.     Tancred had meanwhile seized the prosperous town of ": null
    },
    {
        "Mamistra": "mamistra"
    },
    {
        ". Baldwin reached the town on around 42September. Tancreds cousin, ": null
    },
    {
        "Roger of Salerno": "roger of salerno"
    },
    {
        ", wanted to take revenge for the Normans who had perished at Tarsus, which caused a skirmish between the soldiers of Baldwin and Tancred. This was the first occasion when crusaders fought against each other. After one or two men were killed and many more were injured or captured on both sides, Baldwin and Tancred made peace and Baldwin left Mamistra. He joined the main army at ": null
    },
    {
        "Marash": "marash"
    },
    {
        ", but Bagrat persuaded him to launch a campaign towards the River ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " across a region densely populated by Armenians. About 42–42 knights accompanied him when he again left the main army on 42October.         The Armenians regarded Baldwin as a liberator. Two Armenian chiefs, Fer and Nicusus, joined him soon after he started his campaign. The local population massacred the Seljuq garrisons and officials, or forced them to flee. The Seljuqs fear of the crusaders contributed to Baldwins success. He seized two important fortresses, ": null
    },
    {
        "Ravendel": "ravendel"
    },
    {
        " and ": null
    },
    {
        "Turbessel": "turbessel"
    },
    {
        ", without a fight before the end of 42 He made Bagrat the governor of Ravendel, and appointed Fer to administer Turbessel.     The Armenian lord of Edessa, ": null
    },
    {
        "Thoros": "thoros of edessa"
    },
    {
        ", sent envoysthe ": null
    },
    {
        "Armenian bishop of Edessa": "bishopric of edessaarmenian bishops"
    },
    {
        " and twelve leading citizensto Baldwin in early 42 seeking his assistance against the nearby Seljuq rulers. Being the first town to convert to Christianity, Edessa had played an important role in Christian history. Before departing for Edessa, Baldwin ordered the arrest of Bagrat, whom Fer had accused of secret correspondence with the Seljuqs. Bagrat was tortured and forced to surrender Ravendel. Baldwin left for Edessa in early February, but troops sent by ": null
    },
    {
        "Balduk": "balduk"
    },
    {
        ", the emir of ": null
    },
    {
        "Samosata": "samosata"
    },
    {
        ", or Bagrat prevented him from crossing the Euphrates. His second attempt was successful and he reached Edessa on 42 February. Baldwin did not want to serve Thoros as a mercenary. The Armenian townspeople feared that he was planning to leave the town, so they persuaded Thoros to adopt him. Alone among the contemporary historians of the First Crusade, ": null
    },
    {
        "Albert of Aix": "albert of aix"
    },
    {
        " claims that the local customs of adoption required Thoros to take Baldwin under his shirt. Strengthened by troops from Edessa, Baldwin raided Balduks territory and placed a garrison in a small fortress near Samosata.             Unlike the majority of the Armenians, Thoros adhered to the ": null
    },
    {
        "Orthodox Church": "eastern orthodox church in the byzantine empire"
    },
    {
        ", which made him unpopular among his ": null
    },
    {
        "Monophysite": "monophysitism"
    },
    {
        " subjects. Shortly after Baldwins return from campaign, the local nobles started plotting against Thoros, possibly with Baldwins consent . A riot broke out in the town, forcing Thoros to take refuge in the citadel. Baldwin pledged to save his adoptive father, but when the rioters broke into the citadel on 42March and murdered both Thoros and his wife, he did nothing to help them. On the following day, after the townspeople acknowledged Baldwin as their ruler , he assumed the title of Count of Edessa, and so established the first ": null
    },
    {
        "crusader state": "crusader state"
    },
    {
        ".     The Seljuqs had captured Edessa from the Byzantines in 42 but Alexios I Komnenos did not demand that Baldwin hand over the town. Historian Christopher MacEvitt argues that the local population did not regard Baldwins ascension as a change in regime, but the replacement of one strongman with vague Byzantine ties with another of the same ilk . The acquisition of Ravendel, Turbessel and Edessa strengthened the position of the main crusader army during the ": null
    },
    {
        "siege to Antioch": "siege of antioch"
    },
    {
        ", which was taking place at the same time. The fertile lands along the Euphrates secured a supply of food for the crusaders. The three fortresses also hindered the movement of the Seljuq troops towards Syria and Palestine.       Baldwin had to use his diplomatic skills to secure his rule in Edessa, because his retinue was small. He married the daughter of an Armenian lord named Taftoc, according to William of Tyre, and encouraged his retainers to marry local women. Thoros rich treasury enabled him to employ mercenaries and to buy Samosata from Balduk. Baldwin and Balduks treaty about the transfer of Samosata was the first friendly arrangement between a crusader leader and a Muslim ruler. Balduk settled in Edessa.     An ": null
    },
    {
        "Artuqid": "artuqids"
    },
    {
        " emir, Balak ibn Bahram, hired Baldwin to suppress a revolt in ": null
    },
    {
        "Saruj": "saruj"
    },
    {
        ". When the Muslim ": null
    },
    {
        "burghers": "burgher"
    },
    {
        " of the town approached Balduk to come to their rescue, Balduk hurried to Saruj, but it soon became apparent that his retinue was too small to resist a siege and both he and the townspeople yielded to Baldwin. Baldwin demanded Balduks wife and children as hostages, but Balduk refused to hand over them to him, for which Baldwin had him captured and executed.          Baldwin granted the ": null
    },
    {
        "usufruct": "usufruct"
    },
    {
        " of Turbessel and Ravendel to his brother Godfrey, to secure his and his retainers accommodation during the siege of ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        ". ": null
    },
    {
        "Kerbogha": "kerbogha"
    },
    {
        ", the governor of ": null
    },
    {
        "Mosul": "mosul"
    },
    {
        ", gathered a large army to relieve the town. During his march towards Antioch, Kerbogha did not wish to risk allowing the crusaders to hold Edessa. He besieged Edessa for three weeks in May, but could not capture it. His delay enabled the crusaders to capture Antioch on 42June 42 Antioch became the capital of a ": null
    },
    {
        "new crusader state": "principality of antioch"
    },
    {
        ", with Tancreds uncle, ": null
    },
    {
        "Bohemond of Hauteville": "bohemond i of antioch"
    },
    {
        ", as its first prince.     Baldwin levied high taxes, which made him unpopular among his native subjects. He also ignored the local nobles advice and granted property to his retainers and other crusaders who moved to Edessa. A dozen Armenian chiefs plotted against Baldwin in December, and approached the nearby Seljuq ": null
    },
    {
        "emir": "emir"
    },
    {
        "s for assistance, but Baldwin learnt of the conspiracy and ordered the arrest of the conspirators. The two ringleaders were ": null
    },
    {
        "mutilated": "political mutilation in byzantine culture"
    },
    {
        " in accordance with Byzantine laws, but the others were allowed to redeem themselves for large fees. Nevertheless, Baldwin continued to appoint Armenian noblemen to important offices. He made the Armenian ": null
    },
    {
        "Abul-Garib": "abul-garib"
    },
    {
        " the commander of Bijerik, an important fort controlling the road between Edessa and Turbessel.     The main crusader army captured Jerusalem on 42July 42 A week later, Godfrey of Bouillon was elected ruler of the city, but chose not to be crowned king. Baldwin decided to complete his pilgrimage and left Edessa for Jerusalem in November. At ": null
    },
    {
        "Buluniyas": "buluniyas"
    },
    {
        ", he joined the pilgrims who had departed Antioch with Bohemond I and the papal legate, ": null
    },
    {
        "Daimbert of Pisa": "dagobert of pisa"
    },
    {
        ". Attacks by Muslim troops, fatigue and diseases caused heavy casualties during the journey, but most of the pilgrims reached Jerusalem on 42December. Four days later, Daimbert was elected and installed as the new ": null
    },
    {
        "Latin Patriarch of Jerusalem": "latin patriarch of jerusalem"
    },
    {
        ". The new patriarch confirmed Godfrey and Bohemond in the possession of their lands, but no similar ceremony was recorded in connection with Baldwin. Baldwin and Bohemond left Jerusalem on 42January 42 ": null
    },
    {
        "Duqaq": "duqaq"
    },
    {
        ", the Seljuq ruler of ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ", sent forces to attack them, but the crusaders routed the Seljuq troops near ": null
    },
    {
        "Baalbek": "baalbek"
    },
    {
        ". Baldwin arrived back in Edessa in February.     Godfrey died unexpectedly on 42July 42 He had extracted oaths from Daimbert and other leading crusaders that they would not confer the throne on anyone except his brothers or one of his blood , Albert of Aachen: Historia IerosolimitanaHistory of the Journey to Jerusalem , p. 42 according to Albert of Aix. ": null
    },
    {
        "Warner of Grez": "warner of grez"
    },
    {
        " Godfreys most influential retainer took possession the ": null
    },
    {
        "Tower of David": "tower of david"
    },
    {
        " in Jerusalem to secure control of the city. Although Warner soon died, two other members of Godfreys court, ": null
    },
    {
        "Geldemar Carpenel": "geldemar carpenel"
    },
    {
        " and ": null
    },
    {
        "Arnulf of Chocques": "arnulf of chocques"
    },
    {
        ", sent a delegation to Baldwin, urging him to come to Jerusalem.     To prevent Baldwin from seizing Godfreys realm, Daimbert and Tancred sought assistance from Bohemond I of Antioch. Daimbert sent a letter to him, stating that Baldwins rule would bring about the downfall of the church and the destruction of Christianity itself , according to later ": null
    },
    {
        "chronicle": "chronicle"
    },
    {
        "r William of Tyre. Bohemond, however, was captured by ": null
    },
    {
        "Danishmend Gazi": "danishmend gazi"
    },
    {
        " in the hills near ": null
    },
    {
        "Melitene": "melitene"
    },
    {
        " around 42August. Baldwin hurried to Melitene and pursued Danishmend for three days, but he was unable to rescue Bohemond. After his return, the Armenian lord of Melitene, ": null
    },
    {
        "Gabriel": "gabriel of melitene"
    },
    {
        ", swore fealty to him. Baldwin appointed fifty knights to defend the town.            News of Godfreys death reached Edessa shortly after Baldwins return from Melitene. His chaplain, ": null
    },
    {
        "Fulcher of Chartres": "fulcher of chartres"
    },
    {
        ", noticed that Baldwin grieved somewhat over the death of his brother, but rejoiced more over his inheritance . To finance his journey to Jerusalem, Baldwin seized gold and silver from his subjects. He appointed his relative, ": null
    },
    {
        "Baldwin of Le Bourcq": "baldwin ii of jerusalem"
    },
    {
        ", his successor in the county and Le Bourcq swore fealty to him.     About 42 knights and 42–42 foot-soldiers accompanied Baldwin when he left Edessa on 42October 42 He spent four days in Antioch, but did not accept the local inhabitants plea for him to administer the principality during Bohemonds captivity. Duqaq of Damascus wanted to ambush him on the narrow road near the mouth of the ": null
    },
    {
        "Nahr al-Kalb River": "nahr al-kalb"
    },
    {
        ". The ": null
    },
    {
        "qadi": "qadi"
    },
    {
        " of ": null
    },
    {
        "Tripoli": "tripoli, lebanon"
    },
    {
        " secretly warned Baldwin, which enabled him to defeat the attack and ": null
    },
    {
        "rout": "rout"
    },
    {
        " the Damascene troops. Tancred hurried to Jerusalem to persuade the garrison to surrender the town to him, but he was barred from the town.     Baldwin reached Jerusalem around 42November. Daimbert withdrew to a ": null
    },
    {
        "monastery": "monastery"
    },
    {
        " on ": null
    },
    {
        "Mount Zion": "mount zion"
    },
    {
        ", and the townspeople stopped Baldwin outside the walls and ceremoniously accompanied him to the ": null
    },
    {
        "Holy Sepulchre": "holy sepulchre"
    },
    {
        ". Albert of Aixs sporadic references suggest that Baldwin adopted the title of prince. Baldwin first raided the environs of ": null
    },
    {
        "Ascalon": "ashkelon"
    },
    {
        ", which was still held by the ": null
    },
    {
        "Egyptians": "fatimid caliphate"
    },
    {
        ", then launched a punishing expedition against the bandits who had their headquarters in the caves near Jerusalem. He made an incursion across the river ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " before returning to Jerusalem on 42 December.     Baldwin was reconciled with Daimbert who agreed to ": null
    },
    {
        "anoint": "anoint"
    },
    {
        " and crown him king. The ceremony took place in the ": null
    },
    {
        "Church of the Nativity": "church of the nativity"
    },
    {
        " in ": null
    },
    {
        "Bethlehem": "bethlehem"
    },
    {
        " on Christmas Day. Thereafter Baldwin was most frequently styled king. For instance, a charter of grant in 42 referred to him as Baldwin, king of Judea and Jerusalem, and defensor of the Holiest Sepulchre of our Lord, Jesus Christ . In most of his charters, he also emphasised that he was Godfreys lawful heir.         When Geldemar Carpenel laid claim to ": null
    },
    {
        "Haifa": "haifa"
    },
    {
        ", stating that Tancred had arbitrarily seized it, Baldwin summoned Tancred to Jerusalem, but Tancred did not recognise him as the lawful monarch. They agreed to meet at a river near Jaffa, but their meeting did not result in compromise. The conflict was resolved when Tancred was invited to Antioch to administer the principality on Bohemonds behalf. Before leaving for Antioch in March, Tancred renounced his domains in Palestine, but also stipulated that the same domains should be granted in fief to him if he were to leave Antioch within fifteen months. Baldwin gave Haifa to Geldemar and the ": null
    },
    {
        "Galilee": "principality of galilee"
    },
    {
        " to ": null
    },
    {
        "Hugh of Fauquembergues": "hugh of fauquembergues"
    },
    {
        ".     A new papal legate, ": null
    },
    {
        "Maurice of Porto": "maurice of porto"
    },
    {
        ", came to Jerusalem in early March 42 After Baldwin accused Daimbert of treachery and convinced Maurice to suspend him on 42April, Daimbert had to bribe Baldwin with 42 ": null
    },
    {
        "bezant": "bezant"
    },
    {
        "s to persuade the legate to restore him to his office. The towns along the coast which were still under Egyptian rule": null
    },
    {
        "Arsuf": "arsuf"
    },
    {
        ", ": null
    },
    {
        "Caesarea": "caesarea"
    },
    {
        ", ": null
    },
    {
        "Acre": "acre"
    },
    {
        " and ": null
    },
    {
        "Tyre": "tyre, lebanon"
    },
    {
        "sent gifts to Baldwin to secure his benevolence.     Always in need of funds, Baldwin concluded an alliance with the commanders of a ": null
    },
    {
        "Genoese": "republic of genoa"
    },
    {
        " fleet, offering commercial privileges and booty to them in the towns that he would capture with their support. They first attacked Arsuf, which surrendered without resistance on 42 April, securing a safe passage for the townspeople to Ascalon. The Egyptian garrison at Caesarea resisted, but the town fell on 42May. Baldwins soldiers pillaged Caesarea and massacred the majority of the adult local population. The Genoese received one third of the booty, but Baldwin did not grant areas in the captured towns to them.            While Baldwin and the Genoese were besieging Caesarea, the Egyptian ": null
    },
    {
        "vizier": "vizier"
    },
    {
        ", ": null
    },
    {
        "Al-Afdal Shahanshah": "al-afdal shahanshah"
    },
    {
        ", started mustering troops at Ascalon. Baldwin moved his headquarters to nearby Jaffa and fortified ": null
    },
    {
        "Ramla": "ramla"
    },
    {
        " to hinder any attempt at a surprise attack against Jerusalem. He demanded more funds from Daimbert to cover the costs of this defense, but the patriarch refused. During a passionate debate in the presence of the papal legate, Daimbert stated that Baldwin should not presume to make tributary and servant the holy Church . Albert of Aachen: Historia IerosolimitanaHistory of the Journey to Jerusalem  The legate persuaded Daimbert to promise that he would maintain thirty soldiers by a money agreement , Albert of Aachen: Historia IerosolimitanaHistory of the Journey to Jerusalem but the patriarch failed to raise the promised amount.     The lightly armed and undisciplined Egyptian army approached Ramla in early September. The much smaller, but experienced and well-equipped crusader forces were the first to attack, at dawn on 42September. At least two of the five or six crusader corps were almost annihilated during the first phase of the battle, but Baldwin persuaded the remnants of his army to launch a fresh attack, surprising the Egyptians. After a short resistance, they fled in panic, pursued by the crusaders as far as Ascalon.     ": null
    },
    {
        "Roger Borsa": "roger borsa"
    },
    {
        ", ": null
    },
    {
        "Duke of Apulia": "duke of apulia"
    },
    {
        ", sent money to Daimbert, partially for the recruitment of soldiers, but Daimbert retained the whole sum. After learning of this embezzlement, Baldwin convinced the papal legate to dismiss Daimbert in late 42 Daimbert fled first Jaffa, then to Tanced in Antioch. The vacancy enabled Baldwin to freely use the patriarchs rich treasury.     ": null
    },
    {
        "Stephen, Count of Blois": "stephen, count of blois"
    },
    {
        ", ": null
    },
    {
        "Hugh of Lusignan": "hugh vi of lusignan"
    },
    {
        " and other survivors of the ": null
    },
    {
        "catastrophic crusade of the previous year": "crusade of 1101"
    },
    {
        " came to celebrate Easter in Jerusalem in 42 Shortly thereafter, a strong Egyptian army invaded the kingdom. On 42 May, and against all advice, Baldwin and a force of about 42 horsemen that included dozens of new crusaders, rode out to meet the Egyptians. In this ": null
    },
    {
        "second battle fought at Ramla": "battle of ramla"
    },
    {
        ", the Egyptians were the victors, and they forced Baldwin and his men to take refuge in Ramla. Baldwin escaped from the fortress before the Egyptians laid siege to it, leaving his troops to be killed or captured. He fled to Arsuf, after which an English pirate, ": null
    },
    {
        "Godric": "godric of finchale"
    },
    {
        ", took him to Jaffa, although the Egyptian army had blockaded it from the land. He went to Jerusalem to gather new troops and returned to Jaffa with more than 42 horsemen. However, only the arrival of a fleet filled with hundreds of English, French and German pilgrims forced the Egyptians to lift the siege on 42May. Baldwin wrote to Alexios I Komnenos, urging him not to obstruct their journey.          During the siege of Jaffa, Baldwin had sent envoys to Antioch and Edessa, seeking assistance from Tancred and Baldwin II. They arrived only after the Egyptians withdrawal. Tancred tried to persuade the new papal legate, Robert of St Eusebio, to restore Daimbert, but Baldwin convinced Robert to discuss the issue with the local bishops and abbots. After the prelates unanimously stated that Daimbert had almost provoked a civil war and had abused his ecclesiastic authority, the legate allowed them to elect a pious priest, ": null
    },
    {
        "Evremar": "evremar"
    },
    {
        ", as patriarch.     Baldwin laid siege to Acre in April 42 but an Egyptian fleet relieved the town. He launched a raid against the bandits who had settled on ": null
    },
    {
        "Mount Carmel": "mount carmel"
    },
    {
        ", but he was wounded in the kidneys and did not recover until the end of the year. After a fleet of Genoese and Pisan ships arrived at Haifa in April 42 Baldwin made an alliance with their commanders and again besieged Acre. The town surrendered on 42May after Baldwin promised a free passage to those who wanted to move to Ascalon, but the Italian sailors plundered the wealthy emigrants and killed many of them. Baldwin wanted to punish the Genoese, but the patriarch mediated a reconciliation and Baldwin had to grant one-third of the town to them. Acre had always been the most important port of trade between Syria and Europe, and the harbour dues generated significant revenues for him.     Duqaqs death on 42June led to internal conflict in Damascus. The ": null
    },
    {
        "atabeg": "atabeg"
    },
    {
        "  Toghtekin": "toghtekin"
    },
    {
        " emerged as the ruler, but faced strong opposition. Baldwin promised to support Duqaqs young brother ": null
    },
    {
        "Irtash": "irtash"
    },
    {
        " against Toghtekin. His intervention brought about a rapprochement between the ": null
    },
    {
        "Sunnite": "sunnite"
    },
    {
        " Toghtekin and the ": null
    },
    {
        "Shiite": "shiite"
    },
    {
        " Al-Afdal. After Egyptian horsemen and foot soldiers invaded the kingdom from the south, and Syrian mounted archers from the west in August 42 Baldwin assembled the largest crusader army since the beginning of his reign. At his request, Patriarch Evremar displayed the ": null
    },
    {
        "True Cross": "true cross"
    },
    {
        " before the army to strengthen the crusaders self-confidence. They inflicted a decisive defeat on the Egyptian and Syrian armies at ": null
    },
    {
        "Ramla": "battle of ramla"
    },
    {
        " on 42August.       The Egyptians failed to launch any major military campaigns against the Kingdom of Jerusalem, but they continually raided Baldwins southern frontier. They massacred hundreds of pilgrims near Jaffa and defeated the governor of the town while Baldwin was fighting against Damascene troops in Galilee in October 42 In 42 the Egyptians attacked ": null
    },
    {
        "Hebron": "hebron"
    },
    {
        ", but Baldwin forced them to lift the siege. The Egyptian raids did not prevent Baldwin from pursuing an expansionist policy. He compelled the governor of Sidon to pay a large tribute for a two-year truce in early 42 Early the following year, he made a raid into ": null
    },
    {
        "Oultrejordain": "oultrejordain"
    },
    {
        " and forced the enemy to destroy a fortress recently built by Damascene troops to control the caravan routes. In August 42 Baldwin and a band of Italian adventurers laid siege to Sidon, but the arrival of an Egyptian fleet and Turkish horsemen from Damascus forced him to abandon the siege. In late 42 he concluded a ten-year truce with Toghtekin in exchange for one-third of state revenues from the northern regions of Oultrejordain.          ": null
    },
    {
        "Bertrand, Count of Toulouse": "bertrand, count of toulouse"
    },
    {
        " came to Syria to claim the lands that his father, ": null
    },
    {
        "Raymond of Saint Gilles": "raymond iv, count of toulouse"
    },
    {
        ", had conquered around Tripoli. Bertrands cousin, ": null
    },
    {
        "William Jordan": "william ii jordan"
    },
    {
        ", who had ruled these lands since Raymonds death, refused to cede them to him. Bertrand sought Baldwins assistance, while William Jordan secured Tancreds support. Tancred had already outraged Baldwin II of Edessa through refusing to abandon Turbessel. Baldwin convoked an assembly to put an end to the crusader leaders conflicts. Since neither Tancred nor Jordan were his vassals, he summoned them in the name of the whole church of Jerusalem to the castle of ": null
    },
    {
        "Mount Pilgrim": "mount pilgrim"
    },
    {
        " near Tripoli. At the assembly in June 42 Tancred agreed to abandon Turbessel in return for his restoration to his old domains in the Kingdom of Jerusalem . Tancred did not take possession of his old domain, which remained under Baldwins control. Raymonds inheritance was distributed between Bertrand and Jordan, with Bertrand swearing fealty to Baldwin, and Jordan to Tancred.     The crusader leaders united their forces to complete the ": null
    },
    {
        "conquest of Tripoli": "siege of tripoli"
    },
    {
        " begun by Raymond. On 42June, the Egyptian governor, Sharaf ad-Daulah, offered to surrender the town if a safe passage for those who wanted to leave the town was guaranteed. Baldwin accepted the offer, but he could not prevent the Genoese from killing all those inhabitants whom they could capture. Two thirds of the town was granted to Bertrand of Toulouse who again took an oath of fealty to Baldwin. Baldwin captured Beirut on 42May 42 with the assistance of Bertrand and a Genoese fleet. He was again unable to prevent a general massacre of the townspeople.     ": null
    },
    {
        "Mawdud": "mawdud"
    },
    {
        ", the atabeg of Mosul, and his allies invaded the County of Edessa during the siege of Beirut. After the fall of Beirut, Baldwin and Bertrand hurried to Edessa to fight against the invaders. Baldwin II of Edessa accused Tancred of having incited the Muslim rulers to take actions against him. Regarding himself as the leader of all the Crusaders, Baldwin ordered Tancred to join the campaign and make peace with Baldwin II, otherwise he would declare Tancred the enemy of Christianity. Since most crusaders supported the king, Tancred had no choice but to obey. The incident strengthened Baldwins suzerainty over Edessa. After the new reconciliation, the crusaders pursued Mawdud, but rumours about Muslim attacks against Antioch and Jerusalem forced them to stop the campaign. Before leaving the county, Baldwin suggested that the Christian peasants should be transferred to the lands west of the Euphrates, because the Seljuq rulers had frequently raided the eastern regions. While the peasants were gathering at a ferry on the river, Mawdud made a sudden raid and massacred most of them.     ": null
    },
    {
        "Sigurd I of Norway": "sigurd the crusader"
    },
    {
        "the first king to visit the Kingdom of Jerusalemhad meanwhile landed at Acre. Baldwin made an alliance with him and they laid ": null
    },
    {
        "siege to Sidon": "siege of sidon"
    },
    {
        " in October 42 An Egyptian fleet routed the Norwegians, but the ": null
    },
    {
        "Doge of Venice": "doge of venice"
    },
    {
        " Doge of Venice": "doge of venice"
    },
    {
        ", ": null
    },
    {
        "Ordelafo Faliero": "ordelafo faliero"
    },
    {
        ", and his fleet soon joined the crusaders and the town capitulated on 42December. Baldwin spared the lives of the townspeople and many of them moved to Tyre and Damascus. The following year Baldwin marched to Ascalon: to prevent a siege the Egyptian governor of the town, Shams al-Khalīfa, promised to pay 42 ": null
    },
    {
        "dinar": "dinar"
    },
    {
        "s as a tribute and allowed crusader troops into the citadel. However, the townspeople rose up against al-Khalīfa in July and his ": null
    },
    {
        "Berber": "berbers"
    },
    {
        " guards joined the rioters, murdering him and the crusader troops.     Mawdud launched a new expedition against the northern crusader states in August. At Tancreds request, Baldwin mustered his troops and hurried to the North. Bertrand of Tripoli, Baldwin II of Edessa and the Armenian rulers also came to fight against Mawdud, who ": null
    },
    {
        "was compelled to return": "battle of shaizar"
    },
    {
        " to Mosul in the autumn. Shortly thereafter, Baldwin attacked a caravan that was travelling from Tyre to Damascus, carrying with it the citys most precious possessions, and was able to carry off the rich cargo. In late November, he laid siege to Tyre, although he had no supporting fleet. He was still besieging the town when a Byzantine embassy arrived. The Byzantines tried to persuade him to join a coalition against Tancred, while he wanted to secure their assistance against Tyre. They could not reach a compromise, but Izz al-Mulk, the Egyptian governor of Tyre, persuaded Toghtekin to come to the rescue of the besieged town. Toghtekin compelled Baldwin to lift the siege and withdraw to Acre in April 42          Baldwin made an incursion against Damascene territory in 42 Mawdud and an Artuqid emir, Ayaz, who came to assist Toghtekin against the crusaders, routed Baldwin in the ": null
    },
    {
        "Battle of Al-Sannabra": "battle of al-sannabra"
    },
    {
        " in late June, forcing him to seek assistance from the new rulers of Tripoli and Antioch, ": null
    },
    {
        "Pons": "pons of tripoli"
    },
    {
        " and ": null
    },
    {
        "Roger": "roger of salerno"
    },
    {
        ". Toghtekin, Mawdud and Ayaz invaded Galilee, but they did not risk attacking ": null
    },
    {
        "Tiberias": "tiberias"
    },
    {
        " after the arrival of the troops from Tripoli and Antioch. Toghtekin and Mawdud returned to Damascus where an ": null
    },
    {
        "Assassin": "order of assassins"
    },
    {
        " murdered Mawdud in late September. The Seljuq sultan, ": null
    },
    {
        "Muhammad I Tapar": "muhammad i tapar"
    },
    {
        ", sent a large army to northern Syria in spring 42 In an attempt to maintain the equilibrium in the region, Toghtekin soon sought reconciliation with the crusaders. He made an alliance with the crusader rulers, and their coalition forced the Seljuq troops to withdraw without a fight.     With the pressure on the northern regions diminished, Baldwin was able to again deal with the Egyptians, who had already approached Jerusalem in 42 and made a fresh attempt to capture Jaffa in 42 Baldwin led an expedition across the Jordan and ordered the construction of the castle of ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        " in the autumn 42 The following year, he returned to the region and marched as far as ": null
    },
    {
        "Akaba": "aqaba"
    },
    {
        " on the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        ". After the local inhabitants fled from the town, Baldwin constructed castles in the town and on a nearby island and left a garrison in both fortresses. The three strongholdsMontreal, Eilat and ": null
    },
    {
        "Graye": "pharaohs island"
    },
    {
        "secured the control of the caravan routes between Syria and Egypt. They also enabled Baldwin to continuously survey the movements of the Egyptian troops. From the Red Sea coast, Baldwin hastened to Tyre and began the construction of a new fortress, known as ": null
    },
    {
        "Scandelion Castle": "scandelion castle"
    },
    {
        ", at the ": null
    },
    {
        "Ladder of Tyre": "ladder of tyre"
    },
    {
        ", which completed the blockade of the town from the mainland.          Baldwin fell seriously ill in late 42 Thinking that he was dying, he ordered that all his debts be paid off and he started to distribute his money and goods, but he recovered at the start of the following year. To strengthen the defence of the southern frontier, he launched an expedition against Egypt in March 42 He seized ": null
    },
    {
        "Farama": "farama"
    },
    {
        " on the ": null
    },
    {
        "Nile Delta": "nile delta"
    },
    {
        " without a fight as the townspeople had fled in panic before he reached the town. The late 42th-century Muslim historian ": null
    },
    {
        "Ibn Zafar al Siqilli": "ibn zafar al siqilli"
    },
    {
        " wrote that Baldwin ordered the mosques in the town to be levelled. Baldwins retainers urged him to attack ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        ", but the old wound that he had received in 42 suddenly re-opened.     Dying, Baldwin was carried back as far as ": null
    },
    {
        "Al-Arish": "al-arish"
    },
    {
        " on the frontier of the Fatimid Empire. On his deathbed, he named Eustace III of Boulogne as his successor, but also authorised the barons to offer the throne to Baldwin of Edessa or someone else who would rule the Christian people and defend the churches , if his brother did not accept the crown. Baldwin died on 42April 42 In accordance with his last wishes, his cook, Addo, removed his intestines and preserved his body in salt, so as to secure a burial in Jerusalem. He was buried in the Calvary Chapel of the ": null
    },
    {
        "Holy Sepulchre": "holy sepulchre"
    },
    {
        " next to Godfrey of Bouillon five days later, on ": null
    },
    {
        "Palm Sunday": "palm sunday"
    },
    {
        ".       Fulcher of Chartres described Baldwin as his subjects shield, strength and support; their right arm; the terror of his enemies.  The Muslim historian, ": null
    },
    {
        "Ali ibn al-Athir": "ali ibn al-athir"
    },
    {
        ", who completed his chronicle a century after Baldwins death, thought that al-Bardawil had started the First Crusade. Presenting a fictional correspondence between Baldwin and ": null
    },
    {
        "Roger I of Sicily": "roger i of sicily"
    },
    {
        ", al-Athir claimed that Baldwin had initially wanted to conquer ": null
    },
    {
        "Ifriqiya": "ifriqiya"
    },
    {
        ", but Roger, who wanted to secure the territory for himself, talked him into attacking Jerusalem.     Among modern historians, ": null
    },
    {
        "Thomas Asbridge": "thomas asbridge"
    },
    {
        " states that Baldwin was one of the commanders of the First Crusade whose skill, ambition and devotion drove the enterprise, and by turns threatened to rip it apart . ": null
    },
    {
        "Christopher Tyerman": "christopher tyerman"
    },
    {
        " emphasises that Baldwin was a talented military commander and a clever politician, who established a stable kingdom with defined and defensible borders . ": null
    },
    {
        "Amin Maalouf": "amin maalouf"
    },
    {
        " also concludes that Baldwin was the principal architect of the occupation of the ": null
    },
    {
        "Holy Land": "holy land"
    },
    {
        " by the crusaders. Maalouf attributes Baldwins success primarily to the incorrigible fragmentation of the Arab world , which made the crusaders a genuine regional power . Historian Christopher MacEvitt proposes that Baldwin was adept at navigating the complexities of a world of competing local warlords , because the political landscape of his homeland, with its castellans dominating the countryside, was not so different .     Baldwins earliest extant charters were issued in the early 42s, but the establishment of a ": null
    },
    {
        "chancery": "chancery in the crusader states"
    },
    {
        " took years. Initially, clerics from Baldwins homeland compiled the royal documents. The first chancellor, ": null
    },
    {
        "Pagan": "pagan"
    },
    {
        ", was appointed only in 42 Pagan had came to the Holy Land in the entourage of Baldwins third wife, ": null
    },
    {
        "Adelaide del Vasto": "adelaide del vasto"
    },
    {
        ".     The ": null
    },
    {
        "Bardawil lagoons": "lake bardawil"
    },
    {
        " are named after Baldwin, who died in nearby El-Arish.             Baldwins wife Godehilde, the daughter of ": null
    },
    {
        "Raoul II of Tosny": "raoul ii of tosny"
    },
    {
        " and Isabella of Montfort-lAmaury, died during the First Crusade around 42October 42 Historian ": null
    },
    {
        "Malcolm Barber": "malcolm barber"
    },
    {
        " argues that her death may have been the decisive event that persuaded Baldwin to seek out a lordship in the East . According to the historians ": null
    },
    {
        "Steven Runciman": "steven runciman"
    },
    {
        " and Christopher MacEvitt, Baldwin and Godehilde had children who did not long survive her, but historian Alan V. Murray emphasises that no primary source states that Baldwin fathered children. According to Murray, Runciman was wrong when he translated William of Tyres words about Baldwins  familia  as a reference to his family, because William of Tyre was referring to Baldwins household.     Uncertainty surrounds the name and family of his second wife, whom he married in the summer of 42 Modern historians call her ": null
    },
    {
        "Arda": "arda of armenia"
    },
    {
        " and associate her father with Tathoul of Marash. Her father promised a dowry of 42 bezants and also pledged that she would inherit his lands, but he actually paid off only 42 bezants to Baldwin. The marriage was childless. Baldwin banished her to the ": null
    },
    {
        "convent of St Anne": "church of saint anne, jerusalem"
    },
    {
        " in Jerusalem before 42 but she was soon allowed to move to Constantinople. Although they were separated, the marriage was never ": null
    },
    {
        "annulled": "declaration of nullity"
    },
    {
        ".     Baldwins third wife, Adelaide, was the wealthy widow of Roger I of Sicily. Her first husband died in 42 and she acted as regent for their minor sons until the end of 42 She was more than forty years old when the marriage was proposed in 42 According to William of Tyre, Baldwin wanted to marry her because he had learnt of her wealth, and even agreed to make her son, ": null
    },
    {
        "Roger II of Sicily": "roger ii of sicily"
    },
    {
        ", his heir in Jerusalem. She landed at Palestine in August 42 accompanied by hundreds of soldiers and bringing her rich dowry. Their marriage was ": null
    },
    {
        "bigamous": "bigamous"
    },
    {
        ", because Baldwins second wife was still alive. After recovering from a serious illness in late 42 Baldwin accepted clerical advice and sent an indignant Adelaide home. She sailed for Sicily on 42 April 42 Her humiliation outraged Roger II so much that he denied all support to the Kingdom of Jerusalem during his lifetime.     Summarising Baldwins marriages, historian Jonathan Phillips concludes that Baldwin regarded women as useful sources of financial and political advancement but little else . Decades after Baldwins death, William of Tyre wrote that Baldwin was said to have struggled with weakness of the ": null
    },
    {
        "flesh": "flesh"
    },
    {
        " , but only a few of his body-servants were aware of this. Historians ": null
    },
    {
        "Hans Eberhard Mayer": "hans eberhard mayer"
    },
    {
        ", Christopher Tyerman and Malcolm Barber agree that William of Tyre most probably referred to Baldwins ": null
    },
    {
        "homosexuality": "homosexuality"
    },
    {
        ". Tyerman adds that a converted Muslim was one of Baldwins lovers, but he betrayed Baldwin during the siege of Sidon. He proposed that the defenders of the town kill the king, but Baldwin was warned in advance. On the other hand, Susan B. Edgington states that there is little evidence to support the theories about Baldwins homosexuality, emphasizing that his contemporaries made no reference to it.       ": null
    }
]