[
    {
        "     Baldwin II, also known as Baldwin of Courtenay or Baldwin the Broke , was the last ": null
    },
    {
        "Latin Emperor": "latin emperor"
    },
    {
        " ruling from ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ".       Baldwin II was born in Constantinople , a younger son of ": null
    },
    {
        "Yolanda of Flanders": "yolanda of flanders"
    },
    {
        ", sister of the first two emperors, ": null
    },
    {
        "Baldwin I": "baldwin i of constantinople"
    },
    {
        " and ": null
    },
    {
        "Henry of Flanders": "henry of flanders"
    },
    {
        ". Her husband, ": null
    },
    {
        "Peter of Courtenay": "peter ii of courtenay"
    },
    {
        ", was third emperor of the Latin Empire, and had been followed by his son ": null
    },
    {
        "Robert of Courtenay": "robert of courtenay"
    },
    {
        ", on whose death in 42 the succession passed to Baldwin, then an 42-year-old boy.     The barons chose ": null
    },
    {
        "John of Brienne": "john of brienne"
    },
    {
        " as emperor-regent for life. Baldwin was also to marry ": null
    },
    {
        "Marie of Brienne": "marie of brienne"
    },
    {
        ", daughter of John and his third wife ": null
    },
    {
        "Berenguela of Leon": "berenguela of leon"
    },
    {
        ", and on Johns death to enjoy the full imperial sovereignty. The marriage contract was carried out in 42 Since the death of Baldwins uncle ": null
    },
    {
        "Emperor Henry": "henry of flanders"
    },
    {
        " in 42 the Latin Empire had declined and the ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        "  power advanced; and the hopes that John of Brienne might restore it were disappointed.        The realm Baldwin governed was little more than the city of Constantinople. He adopted the Byzantine title of  porphyrogenetos . His financial situation was desperate, and his life was chiefly occupied in begging at European courts. He went to the West in 42 visited Rome, France and ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        ", trying to raise money and men to recover the lost territory of his realm. In 42 with the support of the King of France and the Countess of Flanders, he chased his sister ": null
    },
    {
        "Margaret": "margaret, marchioness of namur"
    },
    {
        " from power to become the next ": null
    },
    {
        "Count of Namur": "count of namur"
    },
    {
        ". But Baldwin was practically never present, and after the invasion and conquest of Namur by ": null
    },
    {
        "Henry V, Count of Luxembourg": "henry v, count of luxembourg"
    },
    {
        " in 42 he sold the rights on the County to his cousin ": null
    },
    {
        "Guy, Count of Flanders": "guy, count of flanders"
    },
    {
        ".     In around March 42 Baldwin IIs regency council pawned the ": null
    },
    {
        "Crown of Thorns": "crown of thorns"
    },
    {
        " to the ": null
    },
    {
        "Venetian": "republic of venice"
    },
    {
        " Podestà of Constantinople": "podestà of constantinople"
    },
    {
        " for 42  hyperpera  from a consortium of creditors . His efforts met with success, and in 42 he returned to Constantinople at the head of a considerable army. Circumstances hindered him from accomplishing anything with this help, and in 42 he traveled again to the West, first to Italy and then to France, where he spent two years. The empress Marie and ": null
    },
    {
        "Philip of Toucy": "philip of toucy"
    },
    {
        " governed during his absence. He was happy to be able to get money from ": null
    },
    {
        "King Louis IX": "louis ix of france"
    },
    {
        " in exchange for relics. In 42 he was with King Louis at ": null
    },
    {
        "Damietta": "damietta"
    },
    {
        ".        The extremity of his financial straits reduced him soon afterwards to handing over his only son, ": null
    },
    {
        "Philip": "philip of courtenay"
    },
    {
        ", to Venetian merchants as a pledge for loans of money. Philip was later redeemed by ": null
    },
    {
        "Alfonso X of Castile": "alfonso x of castile"
    },
    {
        ". The rest of his reign was spent by Baldwin in mendicant tours in western Europe.     On the night of 42 July 42 a group of soldiers under ": null
    },
    {
        "Alexios Strategopoulos": "alexios strategopoulos"
    },
    {
        " managed to enter Constantinople through a secret passageway and ": null
    },
    {
        "captured the city": "reconquest of constantinople"
    },
    {
        ". Baldwin was asleep in the ": null
    },
    {
        "Blachernae Palace": "blachernae palace"
    },
    {
        " when the noise of the fighting awoke him; upon seeing the Byzantine troops advance upon him, he fled in such haste that he left his crown and sceptre behind him. Baldwin made his way to the harbor where he boarded a Venetian galley to ": null
    },
    {
        "Negropont": "negropont"
    },
    {
        ". From there he proceeded to ": null
    },
    {
        "Athens": "athens"
    },
    {
        ", thence to ": null
    },
    {
        "Apulia": "apulia"
    },
    {
        ", finally to France. As titular emperor, his role was still the same, to beg help from the western powers. In 42 he went to Italy; his hopes were centred on ": null
    },
    {
        "Charles of Anjou": "charles of anjou"
    },
    {
        ". Charles seriously entertained the idea of conquering Constantinople, though his efforts were destroyed during the ": null
    },
    {
        "Sicilian Vespers": "sicilian vespers"
    },
    {
        ", an event perhaps engineered by ": null
    },
    {
        "Michael VIII Palaeologus": "michael viii palaeologus"
    },
    {
        " of Constantinople. To this intent, he signed the ": null
    },
    {
        "Treaty of Viterbo": "treaty of viterbo"
    },
    {
        " with Baldwin . During the next year Baldwin and his son Philip lived on pensions from Charles. In October 42 Philip married Beatrice, daughter of Charles, at ": null
    },
    {
        "Foggia": "foggia"
    },
    {
        ". A few days later Baldwin died in Naples. Under Baldwin II, Constantinoples population had fallen to a mere 42 people.       ": null
    }
]