[
    {
        "        Baldwin V  was crowned co-": null
    },
    {
        "King of Jerusalem": "kingdom of jerusalem"
    },
    {
        " with his uncle, ": null
    },
    {
        "Baldwin IV": "baldwin iv of jerusalem"
    },
    {
        " in 42 and once his uncle died, reigned alone from 42 to 42 under the regency of Count ": null
    },
    {
        "Raymond III of Tripoli": "raymond iii of tripoli"
    },
    {
        ". He was succeeded by his mother ": null
    },
    {
        "Sibylla": "sibylla of jerusalem"
    },
    {
        " and stepfather ": null
    },
    {
        "Guy": "guy of lusignan"
    },
    {
        ".       Baldwin was little more than a pawn in the politics of the Kingdom. By the time he was born, the political situation had developed into two factions. Baldwin IV was dying slowly of ": null
    },
    {
        "leprosy": "leprosy"
    },
    {
        ", and the succession was likely to be contested between ": null
    },
    {
        "Baldwin IV": "baldwin iv of jerusalem"
    },
    {
        "s sister and their younger half-sister ": null
    },
    {
        "Isabella": "isabella of jerusalem"
    },
    {
        ". Their extended family and leading nobles were divided in support for the two heiresses.     Raymond III of Tripoli, first cousin of their father ": null
    },
    {
        "Amalric I of Jerusalem": "amalric i of jerusalem"
    },
    {
        ", had been  bailli  or regent for Baldwin IV while the latter was a child, but once the king came of age in 42 his power began to recede. He had a claim to the throne in his own right, but his childlessness hindered him advancing it. Instead, he acted as a power-broker, and aided the interests of the ": null
    },
    {
        "Ibelin family": "ibelin family"
    },
    {
        ". Amalrics widow ": null
    },
    {
        "Maria Comnena": "maria comnena, queen consort of jerusalem"
    },
    {
        " had married ": null
    },
    {
        "Balian of Ibelin": "balian of ibelin"
    },
    {
        ", and Raymond attempted to regain influence with a project to marry Sibylla to Balians older brother ": null
    },
    {
        "Baldwin of Ibelin": "baldwin of ibelin"
    },
    {
        ". The king countered this by marrying her to ": null
    },
    {
        "Guy of Lusignan": "guy of lusignan"
    },
    {
        " instead in 42 Guy, as a vassal of the ": null
    },
    {
        "Angevins": "house of châteaudun"
    },
    {
        ", from ": null
    },
    {
        "Poitou": "poitou"
    },
    {
        ", had the potential to attract aid from Baldwin IVs cousin ": null
    },
    {
        "Henry II of England": "henry ii of england"
    },
    {
        " to the kingdom.     The other faction, more supportive of Sibylla, centred on her maternal uncle ": null
    },
    {
        "Joscelin III of Edessa": "joscelin iii of edessa"
    },
    {
        " and mother ": null
    },
    {
        "Agnes of Courtenay": "agnes of courtenay"
    },
    {
        ", now the wife of ": null
    },
    {
        "Reginald of Sidon": "reginald of sidon"
    },
    {
        ". Allied to them was ": null
    },
    {
        "Raynald of Châtillon": "raynald of châtillon"
    },
    {
        ", who had been in the country since the ": null
    },
    {
        "Second Crusade": "second crusade"
    },
    {
        " and was the widower of ": null
    },
    {
        "Amalric I": "amalric i of jerusalem"
    },
    {
        "s cousin ": null
    },
    {
        "Constance of Antioch": "constance of antioch"
    },
    {
        ". ": null
    },
    {
        "Amalric of Lusignan": "amalric ii of jerusalem"
    },
    {
        ", although a son-in-law of Baldwin of Ibelin, had been won over by the patronage of Agnes and the king, and had brought his younger brother Guy to prominence. ": null
    },
    {
        "Eraclius": "eraclius of jerusalem"
    },
    {
        ", appointed ": null
    },
    {
        "Latin Patriarch of Jerusalem": "latin patriarch of jerusalem"
    },
    {
        " in 42 has sometimes been associated with this group, but also attempted to make peace between the shifting factions.       As Baldwin IV became more incapacitated by his leprosy, Guy was appointed bailli of the kingdom. Along with Raynald of Châtillon, he provoked ": null
    },
    {
        "Saladin": "saladin"
    },
    {
        ", sultan of ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " and ": null
    },
    {
        "Syria": "syria"
    },
    {
        ", with raids on Muslim ": null
    },
    {
        "caravan": "caravan"
    },
    {
        "s. In 42 when Saladin invaded the kingdom, Guy hesitated to respond and was considered a weak commander.     Baldwin IV deposed Guy and took back power to himself, although he was by now blind and bed-ridden. For the next few months he attempted unsuccessfully to have Sibyllas marriage to Guy annulled. Raymond III was invited back, and the  Haute Cour  was summoned to decide on Baldwin IVs successor. His legal heir was his sister, Sibylla, but it was decided that her son Baldwin of Montferrat would inherit the kingdom, preceding Sibyllas claim. Baldwin V, aged 42 was crowned co-king.     The succession crisis also prompted a mission to the west to seek assistance: in 42 Patriarch Eraclius, along with ": null
    },
    {
        "Roger de Moulins": "roger de moulins"
    },
    {
        ", ": null
    },
    {
        "Grand Master": "grand master"
    },
    {
        " of the ": null
    },
    {
        "Knights Hospitaller": "knights hospitaller"
    },
    {
        ", and ": null
    },
    {
        "Arnaud de Toroge": "arnaud de toroge"
    },
    {
        ", Grand Master of the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        ", travelled throughout the courts of Europe. Eraclius offered the kingship to both ": null
    },
    {
        "Philip II of France": "philip ii of france"
    },
    {
        " and ": null
    },
    {
        "Henry II of England": "henry ii of england"
    },
    {
        ": the former was the son of ": null
    },
    {
        "Louis VII": "louis vii of france"
    },
    {
        ", a first cousin of Baldwin Vs father; the latter was a first cousin of Baldwin IV and Sibylla, and had promised to go on crusade after the murder of ": null
    },
    {
        "Thomas Becket": "thomas becket"
    },
    {
        ". Neither helped him. Some family support arrived in the form of Baldwin Vs paternal grandfather, ": null
    },
    {
        "William V": "william v of montferrat"
    },
    {
        " , ": null
    },
    {
        "Marquess of Montferrat": "marquess of montferrat"
    },
    {
        ", who established himself in the castle of St Elias. At around the same time, in the latter part of 42 Baldwins maternal grandmother, Agnes of Courtenay, died at ": null
    },
    {
        "Acre": "akka, palestine"
    },
    {
        ".       Baldwin IV finally succumbed to his leprosy in spring 42 Shortly before his death, he ordered an official public crown-wearing for his nephew at the ": null
    },
    {
        "Church of the Holy Sepulchre": "church of the holy sepulchre"
    },
    {
        " . Baldwin V was carried on the shoulders of ": null
    },
    {
        "Balian of Ibelin": "balian of ibelin"
    },
    {
        ", not only because Balian was particularly tall, but also to demonstrate that his aunt Isabellas family supported his accession. Baldwin V was now sole king, but being still a minor, Raymond III was his bailli, and his great-uncle Joscelin III of Edessa his personal guardian.            Baldwins solo reign lasted just over a year, and he died in the autumn of 42 at Acre. He had been so weak and ill throughout his childhood that his death was anticipated. His death reinforced the long-held assumption that he would have never lived to maturity or long enough to produce an heir.     Following his death, his grandfather William and great-uncle Joscelin accompanied his coffin to ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ". He was buried in the Church of the Holy Sepulchre in an elaborately carved tomb-chest, which was mostly destroyed in the early nineteenth century. Fragments of it have been identified by Zehava Jacoby in the possession of the ": null
    },
    {
        "Orthodox Patriarchate of Jerusalem": "orthodox patriarch of jerusalem"
    },
    {
        ".       Due to the frail state of Baldwin V, plans had already been made for deciding the kingdoms next ruler. The throne would be claimed by either his mother, Sibylla, or his aunt ": null
    },
    {
        "Isabella": "isabella of jerusalem"
    },
    {
        " because they were the only surviving children of his grandfather ": null
    },
    {
        "Amalric I": "amalric i of jerusalem"
    },
    {
        ". The succession would be determined by a council consisting of Baldwins kinsmen, the Kings of England and France, the ": null
    },
    {
        "Holy Roman Emperor": "frederick i, holy roman emperor"
    },
    {
        ", and the ": null
    },
    {
        "Pope": "pope"
    },
    {
        ": in the meantime, his most rightful heir would act as bailli. However, this agreement was completely ignored once Baldwin was dead, although it was later invoked by his paternal uncle ": null
    },
    {
        "Conrad": "conrad of montferrat"
    },
    {
        " in his challenge to Guys kingship after the ": null
    },
    {
        "Battle of Hattin": "battle of hattin"
    },
    {
        ".     Instead of attending the funeral, the bailli Raymond of Tripoli called an assembly of his supporters at ": null
    },
    {
        "Nablus": "nablus"
    },
    {
        ", the headquarters of the Ibelin family. This suggests that he was already aiming to advance the claim of Isabella and challenge Sibylla.     Sibyllas succession was made conditional on the annulment of her marriage to Guy. She was to be given a free choice of a new husband. She refused. At her coronation, when Patriarch Eraclius asked her to summon her new consort, she brought Guy forward to be crowned.     Raymond III and the nobles then attempted to stage a ": null
    },
    {
        "coup": "coup"
    },
    {
        " in order to place Isabella on the throne with her husband ": null
    },
    {
        "Humphrey IV of Toron": "humphrey iv of toron"
    },
    {
        ". Humphrey backed down , and swore fealty to Sibylla and Guy. Raymond III, disgusted, returned home to Tripoli, and Baldwin of Ibelin went into self-imposed exile from the kingdom.     Sibylla and Guys rule proved to be disastrous, and the kingdom was nearly wiped out by ": null
    },
    {
        "Saladin": "saladin"
    },
    {
        " after the ": null
    },
    {
        "Battle of Hattin": "battle of hattin"
    },
    {
        " in 42 Baldwin Vs paternal uncle, Conrad of Montferrat, saved ": null
    },
    {
        "Tyre": "tyre"
    },
    {
        " and carried forward the Montferrat claim to the throne, reinforced by his marriage to Isabella.       Baldwin appears as a minor character in several novels, notably ": null
    },
    {
        "Zofia Kossak-Szczucka": "zofia kossak-szczucka"
    },
    {
        "s Król trędowaty , ": null
    },
    {
        "Graham Shelby": "graham shelby"
    },
    {
        "s The Knights of Dark Renown, and ": null
    },
    {
        "Cecelia Holland": "cecelia holland"
    },
    {
        "s Jerusalem, as a sickly small child.   Depending on the authors depictions of Sibylla, he is variously shown as spoiled or neglected.     He features in the directors cut of the ": null
    },
    {
        "42 film": "2005 in film"
    },
    {
        "  Kingdom of Heaven , but was edited out of the theatrical release. In the directors cut, the young Baldwin is depicted as having leprosy, like his uncle Baldwin IV. His death in the film is attributed to poisoning by his mother; it is depicted as ": null
    },
    {
        "euthanasia": "euthanasia"
    },
    {
        " to spare him from the ravages of the disease.                     De Expugnatione Terrae Sanctae per Saladinum, translated by James A. Brundage, in The Crusades: A Documentary Survey .   M. R. Morgan , La Continuation de Guillaume de Tyr , , trans. by Peter W. Edbury as The Conquest of Jerusalem and the Third Crusade: Sources in Translation .   Helen J. Nicholson , Chronicle of the Third Crusade, a Translation of Itinerarium Peregrinorum et Gesta Regis Ricardi  .   ": null
    },
    {
        "William of Tyre": "william of tyre"
    },
    {
        ", A History of Deeds Done Beyond the Sea. E. A. Babcock and A. C. Krey, trans. .   Bernard Hamilton, Women in the Crusader States: The Queens of Jerusalem , in Medieval Women, edited by Derek Baker. Ecclesiastical History Society, 42   Bernard Hamilton, The Leper King and his Heirs: Baldwin IV and the Crusader Kingdom of Jerusalem .   Zehava Jacoby, The Tomb of Baldwin V, King of Jerusalem and the Workshop of the Temple Area , in Gesta, 42 , pp.  42–42   ": null
    },
    {
        "Steven Runciman": "steven runciman"
    },
    {
        ", A History of the Crusades, vol. II: The Kingdom of Jerusalem .   Leopoldo Usseglio, I Marchesi di Monferrato in Italia ed in Oriente durante i secoli XII e XIII                                              ": null
    }
]