[
    {
        "                             The Balfour Declaration was a public statement issued by the British government in 42 during the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " announcing support for the establishment of a national home for the ": null
    },
    {
        "Jewish": "jewish"
    },
    {
        " people in ": null
    },
    {
        "Palestine": "palestine"
    },
    {
        ", then an ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " region with a small minority Jewish population. It read:          The declaration was contained in a letter dated 42November 42 from the United Kingdoms ": null
    },
    {
        "Foreign Secretary": "secretary of state for foreign affairs"
    },
    {
        " Arthur Balfour": "arthur balfour"
    },
    {
        " to ": null
    },
    {
        "Lord Rothschild": "walter rothschild, 2nd baron rothschild"
    },
    {
        ", a leader of the ": null
    },
    {
        "British Jewish community": "british jews"
    },
    {
        ", for transmission to the ": null
    },
    {
        "Zionist Federation of Great Britain and Ireland": "zionist federation of great britain and ireland"
    },
    {
        ". The text of the declaration was published in the press on 42November 42     Immediately following their declaration of war on the Ottoman Empire in November 42 the ": null
    },
    {
        "British War Cabinet": "british war cabinet"
    },
    {
        " began to consider the future of Palestine; within two months ": null
    },
    {
        "a memorandum was circulated to the Cabinet": "the future of palestine"
    },
    {
        " by a Zionist Cabinet member, ": null
    },
    {
        "Herbert Samuel": "herbert samuel, 1st viscount samuel"
    },
    {
        ", proposing the support of Zionist ambitions in order to enlist the support of Jews in the wider war. ": null
    },
    {
        "A committee": "de bunsen committee"
    },
    {
        " was established in April 42 by ": null
    },
    {
        "British Prime Minister": "prime minister of the united kingdom"
    },
    {
        " H. H. Asquith": "h. h. asquith"
    },
    {
        " to determine their policy toward the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " including Palestine. Asquith, who had favoured post-war reform of the Ottoman Empire, resigned in December 42; his replacement ": null
    },
    {
        "David Lloyd George": "david lloyd george"
    },
    {
        ", favoured partition of the Empire. The first negotiations between the British and the ": null
    },
    {
        "Zionists": "zionism"
    },
    {
        " took place at a conference on 42 February 42 that included ": null
    },
    {
        "Sir Mark Sykes": "mark sykes"
    },
    {
        " and the Zionist leadership. Subsequent discussions led to Balfours request, on 42 June, that Rothschild and ": null
    },
    {
        "Chaim Weizmann": "chaim weizmann"
    },
    {
        " submit a draft of a public declaration. Further drafts were discussed by the British Cabinet during September and October, with input from Zionist and ": null
    },
    {
        "anti-Zionist": "anti-zionism"
    },
    {
        " Jews but with no representation from the local population in Palestine.     By late 42 in the lead up to the Balfour Declaration, the wider war had reached a stalemate, with two of ": null
    },
    {
        "Britains allies": "allies of world war i"
    },
    {
        " not fully engaged: the United States had yet to suffer a casualty, and the Russians were in the midst of a ": null
    },
    {
        "revolution": "october revolution"
    },
    {
        " with ": null
    },
    {
        "Bolsheviks": "bolsheviks"
    },
    {
        " taking over the government. A ": null
    },
    {
        "stalemate in southern Palestine": "stalemate in southern palestine"
    },
    {
        " was broken by the ": null
    },
    {
        "Battle of Beersheba": "battle of beersheba"
    },
    {
        " on 42 October 42 The release of the final declaration was authorised on 42 October; the preceding Cabinet discussion had referenced perceived propaganda benefits amongst the worldwide Jewish community for the Allied war effort.     The opening words of the declaration represented the first public expression of support for Zionism by a major political power. The term national home had no precedent in international law, and was intentionally vague as to whether a ": null
    },
    {
        "Jewish state": "jewish state"
    },
    {
        " was contemplated. The intended boundaries of Palestine were not specified, and the British government later confirmed that the words in Palestine meant that the Jewish national home was not intended to cover all of Palestine. The second half of the declaration was added to satisfy opponents of the policy, who had claimed that it would otherwise prejudice the position of the local population of Palestine and encourage ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " worldwide by stamping the Jews as strangers in their native lands . The declaration called for safeguarding the civil and religious rights for the ": null
    },
    {
        "Palestinian Arabs": "palestinian arabs"
    },
    {
        ", who composed the ": null
    },
    {
        "vast majority of the local population": "demographic history of palestine"
    },
    {
        ", and also the rights and political status of the Jewish communities in other countries outside of Palestine. The British government acknowledged in 42 that the local populations views should have been taken into account, and recognised in 42 that the declaration should have called for protection of the Palestinian Arabs political rights.     The declaration had many long-lasting consequences. It greatly increased popular support for ": null
    },
    {
        "Zionism": "zionism"
    },
    {
        " within ": null
    },
    {
        "Jewish communities worldwide": "jewish diaspora"
    },
    {
        ", and became a core component of the ": null
    },
    {
        "British Mandate for Palestine": "british mandate for palestine"
    },
    {
        ", the founding document of ": null
    },
    {
        "Mandatory Palestine": "mandatory palestine"
    },
    {
        ", which later became ": null
    },
    {
        "Israel": "israel"
    },
    {
        " and the ": null
    },
    {
        "Palestinian territories": "palestinian territories"
    },
    {
        ". As a result, it is considered a principal cause of the ongoing ": null
    },
    {
        "Israeli–Palestinian conflict": "israeli–palestinian conflict"
    },
    {
        ", often described as the worlds most intractable conflict. Controversy remains over a number of areas, such as whether the declaration contradicted earlier promises the British made to ": null
    },
    {
        "the Sharif of Mecca": "hussein ibn ali al-hashimi"
    },
    {
        " in the ": null
    },
    {
        "McMahon–Hussein correspondence": "mcmahon–hussein correspondence"
    },
    {
        ".                     Early British political support for an increased Jewish presence in the ": null
    },
    {
        "region of Palestine": "palestine"
    },
    {
        " was based upon geopolitical calculations. This support began in the early 42s and was led by ": null
    },
    {
        "Lord Palmerston": "henry john temple, 3rd viscount palmerston"
    },
    {
        ", following the ": null
    },
    {
        "occupation of Syria": "egyptian–ottoman war"
    },
    {
        " and ": null
    },
    {
        "Palestine": "peasants revolt in palestine"
    },
    {
        " by ": null
    },
    {
        "separatist": "separatism"
    },
    {
        " Ottoman governor ": null
    },
    {
        "Muhammad Ali of Egypt": "muhammad ali of egypt"
    },
    {
        ". French influence had grown in Palestine and the wider Middle East, and its role as protector of the ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " communities ": null
    },
    {
        "began to grow": "règlement organique"
    },
    {
        ", just as Russian influence had grown as protector of the ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox church"
    },
    {
        " in the same regions. This left Britain without a sphere of influence, and thus a need to find or create their own regional protégés . These political considerations were supported by a sympathetic evangelical Christian sentiment towards the ": null
    },
    {
        "restoration of the Jews": "christian zionism"
    },
    {
        " to Palestine among elements of the mid42th-century British political elite – most notably ": null
    },
    {
        "Lord Shaftesbury": "anthony ashley-cooper, 7th earl of shaftesbury"
    },
    {
        ". The British Foreign Office actively encouraged Jewish emigration to Palestine, exemplified by ": null
    },
    {
        "Charles Henry Churchill": "charles henry churchill"
    },
    {
        "s 42–42 exhortations to ": null
    },
    {
        "Moses Montefiore": "moses montefiore"
    },
    {
        ", the leader of the British Jewish community.     Such efforts were premature, and did not succeed; only 42 Jews were living in Palestine on the eve of the emergence of ": null
    },
    {
        "Zionism": "zionism"
    },
    {
        " within the worlds Jewish communities in the last two decades of the 42th century. With the geopolitical shakeup occasioned by the outbreak of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", the earlier calculations, which had lapsed for some time, led to a renewal of strategic assessments and political bargaining over the Middle and Far East.            Zionism arose in the late 42th century in reaction to anti-Semitic and exclusionary nationalist movements in Europe. ": null
    },
    {
        "Romantic nationalism": "romantic nationalism"
    },
    {
        " in ": null
    },
    {
        "Central": "central europe"
    },
    {
        " and ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        " had helped to set off the ": null
    },
    {
        "Haskalah": "haskalah"
    },
    {
        ", or Jewish Enlightenment , creating a split in the Jewish community between those who saw Judaism as their religion and those who saw it as their ethnicity or nation. The 42–42 ": null
    },
    {
        "anti-Jewish pogroms in the Russian Empire": "anti-jewish pogroms in the russian empire"
    },
    {
        " encouraged the growth of the latter identity, resulting in the formation of the ": null
    },
    {
        "Hovevei Zion": "hovevei zion"
    },
    {
        " pioneer organizations, the publication of ": null
    },
    {
        "Leon Pinsker": "leon pinsker"
    },
    {
        "s  Autoemancipation , and the first major wave of Jewish immigration to Palestine – retrospectively named the ": null
    },
    {
        "First Aliyah": "first aliyah"
    },
    {
        " .          In 42 ": null
    },
    {
        "Theodor Herzl": "theodor herzl"
    },
    {
        ", a Jewish journalist living in ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ", published the foundational text of political Zionism,  Der Judenstaat  , in which he asserted that the only solution to the ": null
    },
    {
        "Jewish Question": "jewish question"
    },
    {
        " in Europe, including growing anti-Semitism, was the establishment of a state for the Jews. A year later, Herzl founded the ": null
    },
    {
        "Zionist Organization": "world zionist organization"
    },
    {
        ", which at its ": null
    },
    {
        "first congress": "first zionist congress"
    },
    {
        " called for the establishment of a home for the Jewish people in Palestine secured under public law . Proposed measures to attain that goal included the promotion of Jewish settlement there, the organisation of Jews in the ": null
    },
    {
        "diaspora": "jewish diaspora"
    },
    {
        ", the strengthening of Jewish feeling and consciousness, and preparatory steps to attain necessary governmental grants. Herzl died in 42 42 years before the establishment of ": null
    },
    {
        "State of Israel": "state of israel"
    },
    {
        ", the Jewish state that he proposed, without having gained the political standing required to carry out his agenda.     Zionist leader ": null
    },
    {
        "Chaim Weizmann": "chaim weizmann"
    },
    {
        ", later President of the World Zionist Organisation and first ": null
    },
    {
        "President of Israel": "president of israel"
    },
    {
        ", moved from Switzerland to the UK in 42 and met ": null
    },
    {
        "Arthur Balfour": "arthur balfour"
    },
    {
        " – who had just launched his ": null
    },
    {
        "42–42 election campaign": "1906 united kingdom general election"
    },
    {
        " after resigning as Prime Minister – in a session arranged by ": null
    },
    {
        "Charles Dreyfus": "charles dreyfus"
    },
    {
        ", his Jewish constituency representative. Earlier that year, Balfour had successfully driven the ": null
    },
    {
        "Aliens Act": "aliens act 1905"
    },
    {
        " through Parliament with impassioned speeches regarding the need to restrict the wave of immigration into Britain from Jews fleeing the Russian Empire. ": null
    },
    {
        "Hansard": "hansard"
    },
    {
        ", : HC Deb 42 May 42 vol 42 cc4242; and , HC Deb 42 July 42 vol 42 cc4242 During this meeting, he asked what Weizmanns objections had been to the 42 ": null
    },
    {
        "Uganda Scheme": "uganda scheme"
    },
    {
        " that Herzl had supported to provide a portion of ": null
    },
    {
        "British East Africa": "british east africa"
    },
    {
        " to the Jewish people as a homeland. The scheme, which had been proposed to Herzl by ": null
    },
    {
        "Joseph Chamberlain": "joseph chamberlain"
    },
    {
        ", ": null
    },
    {
        "Colonial Secretary": "secretary of state for the colonies"
    },
    {
        " in Balfours Cabinet, following his trip to East Africa earlier in the year, had been subsequently voted down following Herzls death by the Seventh Zionist Congress in 42 after two years of heated debate in the Zionist Organization. Weizmann responded that he believed the English are to London as the Jews are to Jerusalem.     In January 42 Weizmann first met ": null
    },
    {
        "Baron Edmond de Rothschild": "edmond james de rothschild"
    },
    {
        ", a member of the ": null
    },
    {
        "French branch of the Rothschild family": "rothschild banking family of france"
    },
    {
        " and a leading proponent of the Zionist movement, in relation to a project to build a Hebrew university in ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ". The Baron was not part of the World Zionist Organization, but had funded the ": null
    },
    {
        "Jewish agricultural colonies": "moshava"
    },
    {
        " of the First Aliyah and transferred them to the ": null
    },
    {
        "Jewish Colonization Association": "jewish colonization association"
    },
    {
        " in 42 This connection was to bear fruit later that year when the Barons son, ": null
    },
    {
        "James deRothschild": "james de rothschild"
    },
    {
        ", requested a meeting with Weizmann on 42November 42 to enlist him in influencing those deemed to be receptive within the British government to their agenda of a Jewish State in Palestine. Through Jamess wife ": null
    },
    {
        "Dorothy": "dorothy de rothschild"
    },
    {
        ", Weizmann was to meet ": null
    },
    {
        "Rózsika Rothschild": "rózsika rothschild"
    },
    {
        ", who introduced him to the ": null
    },
    {
        "English branch of the family": "rothschild banking family of england"
    },
    {
        "in particular her husband ": null
    },
    {
        "Charles": "charles rothschild"
    },
    {
        " and his older brother ": null
    },
    {
        "Walter": "walter rothschild, 2nd baron rothschild"
    },
    {
        ", a ": null
    },
    {
        "zoologist": "zoology"
    },
    {
        " and former ": null
    },
    {
        "member of parliament": "member of parliament"
    },
    {
        " . Their father, ": null
    },
    {
        "Nathan Rothschild, 42st Baron Rothschild": "nathan rothschild, 1st baron rothschild"
    },
    {
        ", head of the English branch of the family, had a guarded attitude towards Zionism, but he died in March 42 and his title was inherited by Walter.       Prior to the declaration, about 42 of Britains 42 Jews belonged to a Zionist organisation. Globally, as of 42 – the latest known date prior to the declaration – the equivalent figure was approximately 42%.             The year 42 marked four centuries since Palestine had ": null
    },
    {
        "become part of the Ottoman Empire": "ottoman–mamluk war"
    },
    {
        ", also known as the Turkish Empire. For most of this period, the Jewish population represented a small minority, approximately 42% of the total, with Muslims representing the largest segment of the population, and Christians the second.  and       Ottoman government in ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " began to apply restrictions on Jewish immigration to Palestine in late 42 in response to the start of the ": null
    },
    {
        "First Aliyah": "first aliyah"
    },
    {
        " earlier that year. Although this immigration was creating a certain amount of tension with the local population, mainly among the merchant and ": null
    },
    {
        "notable": "ottoman ayan"
    },
    {
        " classes, in 42 the ": null
    },
    {
        "Sublime Porte": "sublime porte"
    },
    {
        " gave Jews the same rights as Arabs to buy land in Palestine and the percentage of Jews in the population rose to 42% by 42 At the same time, with growing distrust of the ": null
    },
    {
        "Young Turks": "young turks"
    },
    {
        " – Turkish nationalists who had ": null
    },
    {
        "taken control of the Empire": "young turk revolution"
    },
    {
        " in 42 – and the ": null
    },
    {
        "Second Aliyah": "second aliyah"
    },
    {
        ", ": null
    },
    {
        "Arab nationalism": "arab nationalism"
    },
    {
        " was on the rise, and in Palestine anti-Zionism was a unifying characteristic. Historians do not know whether these strengthening forces would still have ultimately resulted in conflict in the absence of the Balfour Declaration.                In July 42 war broke out in Europe between the ": null
    },
    {
        "Triple Entente": "triple entente"
    },
    {
        "  and the ": null
    },
    {
        "Central Powers": "central powers"
    },
    {
        " .     The ": null
    },
    {
        "British Cabinet": "cabinet of the united kingdom"
    },
    {
        " first discussed Palestine at a meeting on 42November 42 four days after Britains declaration of war on the Ottoman Empire, of which the ": null
    },
    {
        "Mutasarrifate of Jerusalem": "mutasarrifate of jerusalem"
    },
    {
        "often referred to as Palestinewas a component. At the meeting ": null
    },
    {
        "David Lloyd George": "david lloyd george"
    },
    {
        ", then ": null
    },
    {
        "Chancellor of the Exchequer": "chancellor of the exchequer"
    },
    {
        ", referred to the ultimate destiny of Palestine . The Chancellor, whose law firm Lloyd George, Roberts and Co had been engaged a decade before by the ": null
    },
    {
        "Zionist Federation of Great Britain and Ireland": "zionist federation of great britain and ireland"
    },
    {
        " to work on the ": null
    },
    {
        "Uganda Scheme": "uganda scheme"
    },
    {
        ", was to become Prime Minister by the time of the declaration, and was ultimately responsible for it.          Weizmanns political efforts picked up speed, and on 42December 42 he met with ": null
    },
    {
        "Herbert Samuel": "herbert samuel"
    },
    {
        ", a British Cabinet member and a secular Jew who had studied Zionism; Samuel believed Weizmanns demands were too modest. Two days later, Weizmann met Balfour again, for the first time since their initial meeting in 42; Balfour had been out of government ever since his electoral defeat in 42 but remained a senior member of the ": null
    },
    {
        "Conservative Party": "conservative party"
    },
    {
        " in their role as ": null
    },
    {
        "Official Opposition": "her majestys most loyal opposition"
    },
    {
        ".     A month later, Samuel circulated a memorandum entitled  The Future of Palestine  to his Cabinet colleagues. The memorandum stated: I am assured that the solution of the problem of Palestine which would be much the most welcome to the leaders and supporters of the Zionist movement throughout the world would be the annexation of the country to the British Empire . Samuel discussed a copy of his memorandum with Nathan Rothschild in February 42 a month before the latters death. It was the first time in an official record that enlisting the support of Jews as a war measure had been proposed.     Many further discussions followed, including the initial meetings in 42–42 between Lloyd George, who had been appointed ": null
    },
    {
        "Minister of Munitions": "minister of munitions"
    },
    {
        " in May 42 and Weizmann, who was appointed as a scientific advisor to the ministry in September 42 Seventeen years later, in his War Memoirs, Lloyd George described these meetings as being the fount and origin of the declaration; historians have rejected this claim.             In late 42 the ": null
    },
    {
        "British High Commissioner to Egypt": "list of diplomats of the united kingdom to egypt"
    },
    {
        ", ": null
    },
    {
        "Henry McMahon": "henry mcmahon"
    },
    {
        ", ": null
    },
    {
        "exchanged ten letters": "mcmahon–hussein correspondence"
    },
    {
        " with ": null
    },
    {
        "Hussein bin Ali, Sharif of Mecca": "hussein bin ali, sharif of mecca"
    },
    {
        ", in which he promised Hussein to recognize Arab independence in the limits and boundaries proposed by the Sherif of Mecca in return for Hussein launching a revolt against the Ottoman Empire. The pledge excluded portions of ": null
    },
    {
        "Syria": "syria"
    },
    {
        " lying to the west of the districts of Damascus, ": null
    },
    {
        "Homs": "homs"
    },
    {
        ", ": null
    },
    {
        "Hama": "hama"
    },
    {
        " and ": null
    },
    {
        "Aleppo": "aleppo"
    },
    {
        " . In the decades after the war, the extent of this coastal exclusion was hotly disputed since Palestine lay to the southwest of ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        " and was not explicitly mentioned.        The ": null
    },
    {
        "Arab Revolt": "arab revolt"
    },
    {
        " was launched on June42th, 42 on the basis of the quid pro quo agreement in the correspondence. However, less than three weeks earlier the governments of the United Kingdom, France, and Russia ": null
    },
    {
        "secretly concluded": "secret treaty"
    },
    {
        " the ": null
    },
    {
        "Sykes–Picot Agreement": "sykes–picot agreement"
    },
    {
        ", which Balfour described later as a wholly new method for dividing the region, after the 42 agreement seems to have been forgotten .     This Anglo-French treaty was negotiated in late 42 and early 42 between Sir ": null
    },
    {
        "Mark Sykes": "mark sykes"
    },
    {
        " and ": null
    },
    {
        "François Georges-Picot": "françois georges-picot"
    },
    {
        ", with the primary arrangements being set out in draft form in a joint memorandum on 42 January 42 Sykes was a British Conservative ": null
    },
    {
        "MP": "kingston upon hull central"
    },
    {
        " who had risen to a position of significant influence on Britains Middle East policy, beginning with his seat on the 42 ": null
    },
    {
        "De Bunsen Committee": "de bunsen committee"
    },
    {
        " and his initiative to create the ": null
    },
    {
        "Arab Bureau": "arab bureau"
    },
    {
        ". Picot was a French diplomat and former ": null
    },
    {
        "consul-general": "consul consular rank"
    },
    {
        " in Beirut. Their agreement defined the proposed spheres of influence and control in Western Asia should the Triple Entente succeed in defeating the Ottoman Empire during World WarI,  dividing many Arab territories into British- and French-administered areas. In Palestine, internationalisation was proposed, with the form of administration to be confirmed after consultation with both Russia and Hussein; the January draft noted Christian and Muslim interests, and that members of the Jewish community throughout the world have a conscientious and sentimental interest in the future of the country.      Prior to this point, no active negotiations with Zionists had taken place, but Sykes had been aware of Zionism, was in contact with ": null
    },
    {
        "Moses Gaster": "moses gaster"
    },
    {
        " – a former President of the English Zionist Federation – and may have seen Samuels 42 memorandum. On 42 March, while Sykes and Picot were still in Petrograd, ": null
    },
    {
        "Lucien Wolf": "lucien wolf"
    },
    {
        " submitted to the Foreign Office, the draft of an assurance that could be issued by the allies in support of Jewish aspirations:     In the event of Palestine coming within the spheres of influence of Great Britain or France at the close of the war, the governments of those powers will not fail to take account of the historic interest that country possesses for the Jewish community. The Jewish population will be secured in the enjoyment of civil and religious liberty, equal political rights with the rest of the population, reasonable facilities for immigration and colonisation, and such municipal privileges in the towns and colonies inhabited by them as may be shown to be necessary.     On 42 March, telegrams  were sent in Greys name to Britains Russian and French ambassadors for transmission to Russian and French authorities, including the formula, as well as :     The scheme might be made far more attractive to the majority of Jews if it held out to them the prospect that when in course of time the Jewish colonists in Palestine grow strong enough to cope with the Arab population they may be allowed to take the management of the internal affairs of Palestine into their own hands.     Sykes, having seen the telegram, had discussions with Picot and proposed  the creation of an Arab Sultanate under French and British protection, some means of administering the holy places along with the establishment of a company to purchase land for Jewish colonists, who would then become citizens with equal rights to Arabs.     Shortly after returning from Petrograd, Sykes briefed Samuel, who then briefed a meeting of Gaster, Weizmann and Sokolow. Gaster recorded in his diary on 42 April 42: We are offered French-English condominium in Palest Arab Prince to conciliate Arab sentiment and as part of the Constitution a Charter to Zionists for which England would stand guarantee and which would stand by us in every case of friction... It practically comes to a complete realisation of our Zionist programme. However, we insisted on: national character of Charter, freedom of immigration and internal autonomy, and at the same time full rights of citizenship to and Jews in Palestine.  In Sykes mind, the agreement which bore his name was outdated even before it was signed – in March 42 he wrote in a private letter: to my mind the Zionists are now the key of the situation . In the event, neither the French nor the Russians were enthusiastic about the proposed formulation and eventually on 42 July, Wolf was informed that the present moment is inopportune for making any announcement.      These wartime initiatives, inclusive of the declaration, are frequently considered together by historians because of the potential, real or imagined, for incompatibility between them, particularly in regard to the disposition of Palestine. In the words of Professor ": null
    },
    {
        "Albert Hourani": "albert hourani"
    },
    {
        ", founder of the Middle East Centre at ": null
    },
    {
        "St Antonys College, Oxford": "st antonys college, oxford"
    },
    {
        ": The argument about the interpretation of these agreements is one which is impossible to end, because they were intended to bear more than one interpretation.          In terms of British politics, the declaration resulted from the coming into power of ": null
    },
    {
        "Lloyd George and his Cabinet": "lloyd george ministry"
    },
    {
        ", which had replaced the ": null
    },
    {
        "H. H. Asquith led-Cabinet": "asquith coalition ministry"
    },
    {
        " in December 42 Whilst both Prime Ministers were ": null
    },
    {
        "Liberals": "liberal party"
    },
    {
        " and both governments were ": null
    },
    {
        "wartime coalitions": "coalition government"
    },
    {
        ", Lloyd George and Balfour, appointed as his Foreign Secretary, favoured a post-war partition of the Ottoman Empire as a major British war aim, whereas Asquith and his Foreign Secretary, ": null
    },
    {
        "Sir Edward Grey": "edward grey, 1st viscount grey of fallodon"
    },
    {
        ", had favoured its reform.     Two days after taking office, Lloyd George told ": null
    },
    {
        "General Robertson": "sir william robertson, 1st baronet"
    },
    {
        ", the ": null
    },
    {
        "Chief of the Imperial General Staff": "chief of the general staff"
    },
    {
        ", that he wanted a major victory, preferably the capture of ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ", to impress British public opinion, and immediately consulted his War Cabinet about a further campaign into Palestine when El Arish had been secured.  Subsequent pressure from Lloyd George, over the reservations of Robertson, resulted in the recapture of the ": null
    },
    {
        "Sinai": "sinai peninsula"
    },
    {
        " for ": null
    },
    {
        "British-controlled Egypt": "khedivate of egypt"
    },
    {
        ", and, with the ": null
    },
    {
        "capture of El Arish": "battle of magdhaba"
    },
    {
        " in December 42 ": null
    },
    {
        "and Rafah": "battle of rafa"
    },
    {
        " in January 42 the arrival of British forces at the southern borders of the Ottoman Empire. Following two unsuccessful ": null
    },
    {
        "attempts to capture Gaza": "second battle of gaza"
    },
    {
        " between 42 March and 42 April, a six-month ": null
    },
    {
        "stalemate in Southern Palestine": "stalemate in southern palestine"
    },
    {
        " began; the ": null
    },
    {
        "Sinai and Palestine Campaign": "sinai and palestine campaign"
    },
    {
        " would not make any progress into Palestine until 42October 42         Following the change in government, Sykes was promoted into the War Cabinet Secretariat with responsibility for Middle Eastern affairs. In January 42 despite having previously built a relationship with Moses Gaster, he began looking to meet other Zionist leaders; by the end of the month he had been introduced to Weizmann and his associate ": null
    },
    {
        "Nahum Sokolow": "nahum sokolow"
    },
    {
        ", a journalist and executive of the World Zionist Organization who had moved to Britain at the beginning of the war.     On 42February 42 Sykes, claiming to be acting in a private capacity, entered into substantive discussions with the Zionist leadership. The previous British correspondence with the Arabs was discussed at the meeting; Sokolows notes record Sykes description that The Arabs professed that language must be the measure and could claim all Syria and Palestine. Still the Arabs could be managed, particularly if they received Jewish support in other matters.  At this point the Zionists were still unaware of the ": null
    },
    {
        "Sykes-Picot Agreement": "sykes-picot agreement"
    },
    {
        ", although they had their suspicions. One of Sykes goals was the mobilization of Zionism to the cause of British suzerainty in Palestine, so as to have arguments to put to France in support of that objective.          During the period of the British War Cabinet discussions leading up to the declaration, the war had reached a period of stalemate. On the ": null
    },
    {
        "Western Front": "western front"
    },
    {
        " the tide would first turn in favour of the Central Powers in ": null
    },
    {
        "spring 42": "spring offensive"
    },
    {
        ", before decisively ": null
    },
    {
        "turning in favour of the Allies": "second battle of the marne"
    },
    {
        " from July 42 onwards. Although the United States declared war on Germany in the spring of 42 it did not suffer its first casualties until 42 November 42 at which point President ": null
    },
    {
        "Woodrow Wilson": "woodrow wilson"
    },
    {
        " still hoped to avoid dispatching large contingents of troops into the war. The Russian forces were known to be distracted by the ongoing ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        " and the growing support for the ": null
    },
    {
        "Bolshevik": "bolshevik"
    },
    {
        " faction, but ": null
    },
    {
        "Alexander Kerensky": "alexander kerensky"
    },
    {
        "s ": null
    },
    {
        "Provisional Government": "russian provisional government"
    },
    {
        " had remained in the war; Russia only withdrew after the final stage of the revolution ": null
    },
    {
        "on 42November 42": "october revolution"
    },
    {
        ".             Balfour met Weizmann at the Foreign Office on 42 March 42; two days later, Weizmann described the meeting as being the first time I had a real business talk with him . Weizmann explained at the meeting that the Zionists had a preference for a British protectorate over Palestine, as opposed to an American, French or international arrangement; Balfour agreed, but warned that there may be difficulties with France and Italy .     The French position in regard to Palestine and the wider ": null
    },
    {
        "Syria region": "syria"
    },
    {
        " during the lead up to the Balfour Declaration was largely dictated by the terms of the Sykes-Picot Agreement, and was complicated from 42 November 42 by increasing French awareness of the British discussions with the Sherif of Mecca. Prior to 42 the British had led the fighting on the southern border of the Ottoman Empire alone, given their neighbouring ": null
    },
    {
        "Egyptian colony": "history of egypt under the british"
    },
    {
        " and the French preoccupation with the fighting on the Western Front that was taking place on their own soil. Italys participation in the war, which began following the April 42 ": null
    },
    {
        "Treaty of London": "treaty of london"
    },
    {
        ", did not include involvement in the Middle Eastern sphere until the April 42 ": null
    },
    {
        "Agreement of Saint-Jean-de-Maurienne": "agreement of saint-jean-de-maurienne"
    },
    {
        "; at this conference, Lloyd George had raised the question of a British protectorate of Palestine and the idea had been very coldly received by the French and the Italians. In May and June 42 the French and Italians sent ": null
    },
    {
        "detachments": "detachment"
    },
    {
        " to support the British as they built their reinforcements in preparation for a renewed attack on Palestine.     In early April, Sykes and Picot were appointed to act as the chief negotiators once more, this time on a month-long mission to the Middle East for further discussions with the Sherif of Mecca and other Arab leaders. On 42 April 42 Sykes met with Lloyd George, Curzon and Hankey to receive his instructions in this regard, namely to keep the French onside while not prejudicing the Zionist movement and the possibility of its development under British auspices, enter into any political pledges to the Arabs, and particularly none in regard to Palestine . Before travelling to the Middle East, Picot, via Sykes, invited Nahum Sokolow to Paris to educate the French government on Zionism. Sykes, who had prepared the way in correspondence with Picot, arrived a few days after Sokolow; in the meantime Sokolow had met Picot and other French officials, and convinced the French Foreign Office to accept for study a statement of Zionist aims in regard to facilities of colonization, communal autonomy, rights of language and establishment of a Jewish chartered company.  Sykes went on ahead to Italy and had meetings with the British ambassador and British Vatican representative to prepare the way for Sokolow once again.     Sokolow was granted an audience with ": null
    },
    {
        "Pope Benedict XV": "pope benedict xv"
    },
    {
        " on 42 May 42 Sokolows notes of the meeting – the only meeting records known to historians – stated that the Pope expressed general sympathy and support for the Zionist project. On 42 May 42 Angelo Sereni, president of the ": null
    },
    {
        "Committee of the Jewish Communities": "union of italian jewish communities"
    },
    {
        ", presented Sokolow to ": null
    },
    {
        "Sidney Sonnino": "sidney sonnino"
    },
    {
        ", the Italian Minister of Foreign Affairs. He was also received by ": null
    },
    {
        "Paolo Boselli": "paolo boselli"
    },
    {
        ", the Italian prime minister. Sonnino arranged for the secretary general of the ministry to send a letter to the effect that, although he could not express himself on the merits of a program which concerned all the allies, generally speaking he was not opposed to the legitimate claims of the Jews. On his return journey, Sokolow met with French leaders again and secured a ": null
    },
    {
        "letter": "cambon letter"
    },
    {
        " dated 42 June 42 giving assurances of sympathy towards the Zionist cause by ": null
    },
    {
        "Jules Cambon": "jules cambon"
    },
    {
        ", head of the political section of the French foreign ministry. This letter was not published, but was deposited at the British Foreign Office.     Following the United States entry into the war on 42 April, the British Foreign Secretary led the ": null
    },
    {
        "Balfour Mission": "balfour mission"
    },
    {
        " to ": null
    },
    {
        "Washington D.C.": "washington d.c."
    },
    {
        " and ": null
    },
    {
        "New York": "new york city"
    },
    {
        ", where he spent a month between mid-April and mid-May. During the trip he spent significant time discussing Zionism with ": null
    },
    {
        "Louis Brandeis": "louis brandeis"
    },
    {
        ", a leading Zionist and a close ally of Wilson who had been appointed as a ": null
    },
    {
        "Supreme Court Justice": "associate justice of the supreme court of the united states"
    },
    {
        " a year previously.            By 42 June 42 it was acknowledged by ": null
    },
    {
        "Ronald Graham": "ronald william graham"
    },
    {
        ", head of the Foreign Offices Middle Eastern affairs department, that the three most relevant politiciansthe Prime Minister, the Foreign Secretary, and the ": null
    },
    {
        "Parliamentary Under-Secretary of State for Foreign Affairs": "parliamentary under-secretary of state for foreign affairs"
    },
    {
        ", ": null
    },
    {
        "Lord Robert Cecil": "robert cecil, 1st viscount cecil of chelwood"
    },
    {
        "were all in favour of Britain supporting the Zionist movement; on the same day Weizmann had written to Graham to advocate for a public declaration. ": null
    },
    {
        "Palestine and the Balfour Declaration, Cabinet Paper, January 42": ":file:palestine and the balfour declaration, cabinet paper, january 1923.jpg"
    },
    {
        "      Six days later, at a meeting on 42June, Balfour asked Lord Rothschild and Weizmann to submit a formula for a declaration. Over the next few weeks, a 42-word draft was prepared by the Zionist negotiating committee, but it was considered too specific on sensitive areas by Sykes, Graham and Rothschild. Separately, a very different draft had been prepared by the Foreign Office, described in 42 by ": null
    },
    {
        "Harold Nicolson": "harold nicolson"
    },
    {
        " – who had been involved in preparing the draft – as proposing a sanctuary for Jewish victims of persecution . The Foreign Office draft was strongly opposed by the Zionists, and was discarded; no copy of the draft has been found in the Foreign Office archives.     Following further discussion, a revised – and at just 42 words in length, much shorter – draft declaration was prepared and sent by Lord Rothschild to Balfour on 42 July. It was received by the Foreign Office, and the matter was brought to the Cabinet for formal consideration.            The decision to release the declaration was taken by the British War Cabinet on 42 October 42 This followed discussion at four War Cabinet meetings over the space of the previous two months. In order to aid the discussions, the War Cabinet Secretariat, led by ": null
    },
    {
        "Maurice Hankey": "maurice hankey, 1st baron hankeylloyd georges war cabinet"
    },
    {
        " and supported by his ": null
    },
    {
        "Assistant Secretaries": "assistant secretary"
    },
    {
        " Hansard": "hansard"
    },
    {
        ", : HC Deb 42 March 42 vol 42 cc4242W – primarily Sykes and his fellow Conservative MP and pro-Zionist ": null
    },
    {
        "Leo Amery": "leo amery"
    },
    {
        " – solicited outside perspectives to put before the Cabinet. These included the views of government ministers, war allies – notably from President Woodrow Wilson – and in October, formal submissions from six Zionist leaders and four non-Zionist Jews.     British officials asked President Wilson for his consent on the matter on two occasions – first on 42 September, when he replied the time was not ripe, and later on 42 October, when he agreed with the release of the declaration.     Excerpts from the minutes of these four War Cabinet meetings provide a description of the primary factors that the ministers considered:     42 September 42: With reference to a suggestion that the matter might be postponed, pointed out that this was a question on which the Foreign Office had been very strongly pressed for a long time past. There was a very strong and enthusiastic organisation, more particularly in the United States, who were zealous in this matter, and his belief was that it would be of most substantial assistance to the Allies to have the earnestness and enthusiasm of these people enlisted on our side. To do nothing was to risk a direct breach with them, and it was necessary to face this situation.  42 October 42: ... stated that the German Government were making great efforts to capture the sympathy of the Zionist Movement. This Movement, though opposed by a number of wealthy Jews in this country, had behind it the support of a majority of Jews, at all events in Russia and America, and possibly in other countries ... Mr. Balfour then read a very sympathetic ": null
    },
    {
        "declaration": "cambon letter"
    },
    {
        " by the French Government which had been conveyed to the Zionists, and he stated that he knew that President Wilson was extremely favourable to the Movement.  42 October 42: ... the Secretary mentioned that he was being pressed by the Foreign Office to bring forward the question of Zionism, an early settlement of which was regarded as of great importance.       42 October 42: stated that he gathered that everyone was now agreed that, from a purely diplomatic and political point of view, it was desirable that some declaration favourable to the aspirations of the Jewish nationalists should now be made. The vast majority of Jews in Russia and America, as, indeed, all over the world, now appeared to be favourable to Zionism. If we could make a declaration favourable to such an ideal, we should be able to carry on extremely useful propaganda both in Russia and America.          Declassification of British government archives has allowed scholars to piece together the choreography of the drafting of the declaration; in his widely cited 42 book, ": null
    },
    {
        "Leonard Stein": "leonard stein"
    },
    {
        " published four previous drafts of the declaration. : Appendix: Successive drafts and final text of the Balfour Declaration     The drafting began with Weizmanns guidance to the Zionist drafting team on its objectives in a letter dated 42 June 42 one day following his meeting with Rothschild and Balfour. He proposed that the declaration from the British government should state: its conviction, its desire or its intention to support Zionist aims for the creation of a Jewish national home in Palestine; no reference must be made I think to the question of the Suzerain Power because that would land the British into difficulties with the French; it must be a Zionist declaration.      A month after the receipt of the much-reduced 42 July draft from Rothschild, Balfour proposed a number of mainly technical amendments. The two subsequent drafts included much more substantial amendments: the first in a late August draft by ": null
    },
    {
        "Lord Milner": "alfred milner"
    },
    {
        " – one of the original five members of Lloyd Georges War Cabinet as a ": null
    },
    {
        "minister without portfolio": "minister without portfolio"
    },
    {
        " – which reduced the geographic scope from all of Palestine to in Palestine , and the second from Milner and Amery in early October, which added the two safeguard clauses .          Subsequent authors have debated who the primary author really was. In his posthumously published 42 book  The Anglo-American Establishment , ": null
    },
    {
        "Georgetown University": "georgetown university"
    },
    {
        " history professor ": null
    },
    {
        "Carroll Quigley": "carroll quigley"
    },
    {
        " explained his view that Lord Milner was the primary author of the declaration, and more recently, ": null
    },
    {
        "William D. Rubinstein": "william d. rubinstein"
    },
    {
        ", Professor of Modern History at ": null
    },
    {
        "Aberystwyth University": "aberystwyth university"
    },
    {
        ", Wales, proposed Amery instead. Huneidi wrote that Ormsby-Gore, in a report he prepared for Shuckburgh, claimed authorship, together with Amery, of the final draft form.         The agreed version of the declaration, a single sentence of just 42 words, was sent on 42November 42 in a short letter from Balfour to Walter Rothschild, for transmission to the Zionist Federation of Great Britain and Ireland. The declaration contained four ": null
    },
    {
        "clause": "clause"
    },
    {
        "s, of which the first two promised to support the establishment in Palestine of a national home for the Jewish people , followed by two safeguard clauses  with respect to the civil and religious rights of existing non-Jewish communities in Palestine , and the rights and political status enjoyed by Jews in any other country .               The term national home was intentionally ambiguous, having no legal value or precedent in international law, such that its meaning was unclear when compared to other terms such as state . The term was intentionally used instead of state because of opposition to the Zionist program within the British Cabinet. According to historian Norman Rose, the chief architects of the declaration contemplated that a ": null
    },
    {
        "Jewish State": "jewish state"
    },
    {
        " would emerge in time while the ": null
    },
    {
        "Palestine Royal Commission": "palestine royal commission"
    },
    {
        " concluded that the wording was the outcome of a compromise between those Ministers who contemplated the ultimate establishment of a Jewish State and those who did not.         Interpretation of the wording has been sought in the correspondence leading to the final version of the declaration. An official report to the War Cabinet sent by Sykes on 42 September said that the Zionists did not want to set up a Jewish Republic or any other form of state in Palestine or in any part of Palestine but rather preferred some form of protectorate as provided in the Palestine Mandate. A month later, Curzon produced a memorandum circulated on 42 October 42 where he addressed two questions, the first concerning the meaning of the phrase a National Home for the Jewish race in Palestine ; he noted that there were different opinions ranging from a fully fledged state to a merely spiritual centre for the Jews.     Sections of the British press assumed that a Jewish state was intended even before the Declaration was finalized. In the United States the press began using the terms Jewish National Home , Jewish State , Jewish republic and Jewish Commonwealth interchangeably. American Emergency Committee for Zionist Affairs, The Balfour Declaration and American Interests in Palestine pp. 4242     Treaty expert ": null
    },
    {
        "David Hunter Miller": "david hunter miller"
    },
    {
        ", who was at the conference and subsequently compiled a 42 volume compendium of documents, provides a report of the Intelligence Section of the American Delegation to the ": null
    },
    {
        "Paris Peace Conference of 42": "paris peace conference of 1919"
    },
    {
        " which recommended that there be established a separate state in Palestine, and that it will be the policy of the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        " to recognize Palestine as a Jewish state, as soon as it is a Jewish state in fact.  Miller, David Hunter. My Diary at the Conference of Paris , Appeal Printing Co., , vol 42 pp. 4242 The report further advised that an independent Palestinian state under a ": null
    },
    {
        "British League of Nations mandate": "british mandate for palestine"
    },
    {
        " be created. Jewish settlement would be allowed and encouraged in this state and this states holy sites would be under the control of the League of Nations. Indeed, ": null
    },
    {
        "the Inquiry": "the inquiry"
    },
    {
        " spoke positively about the possibility of a Jewish state eventually being created in Palestine if the necessary demographics for this were to exist.     Historian Matthew Jacobs later wrote that the US approach was hampered by the general absence of specialist knowledge about the region and that like much of the Inquirys work on the Middle East, the reports on Palestine were deeply flawed and presupposed a particular outcome of the conflict . He quotes Miller, writing about one report on the history and impact of Zionism, absolutely inadequate from any standpoint and must be regarded as nothing more than material for a future report      ": null
    },
    {
        "Lord Robert Cecil": "lord robert cecil"
    },
    {
        " on 42 December 42 assured an audience that the government fully intended that Judea for the Jews.  Yair Auron opines that Cecil, then a deputy Foreign Secretary representing the British Government at a celebratory gathering of the English Zionist Federation, possibly went beyond his official brief in saying Our wish is that Arabian countries shall be for the Arabs, Armenia for the Armenians and Judaea for the Jews .     The following October ": null
    },
    {
        "Neville Chamberlain": "neville chamberlain"
    },
    {
        ", while chairing a Zionist meeting, discussed a new Jewish State. At the time, Chamberlain was a Member of Parliament for Ladywood, Birmingham; recalling the event in 42 just after Chamberlain had approved the 42 White Paper, the Jewish Telegraph Agency noted that the Prime Minister had experienced a pronounced change of mind in the 42 years intervening  A year later, on the Declarations second anniversary, General ": null
    },
    {
        "Jan Smuts": "jan smuts"
    },
    {
        " said that Britain would redeem her pledge ... and a great Jewish state would ultimately rise.  In similar vein, Churchill a few months later stated:        At the 42 June 42 meeting of the Imperial Cabinet, Churchill was asked by Arthur Meighen, the Canadian Prime Minister, about the meaning of the national home. Churchill said If in the course of many years they become a majority in the country, they naturally would take it over....pro rata with the Arab. We made an equal pledge that we would not turn the Arab off his land or invade his political and social rights .      Responding to Curzon in January 42 Balfour wrote Weizmann has never put forward a claim for the Jewish Government of Palestine. Such a claim in my opinion is clearly inadmissible and personally I do not think we should go further than the original declaration which I made to Lord Rothschild .     In February 42 France issued a statement that it would not oppose putting Palestine under British trusteeship and the formation of a Jewish State. Friedman further notes that Frances attitude went on to change; Yehuda Blum, while discussing Frances unfriendly attitude towards the Jewish national movement , notes the content of a report made by Robert Vansittart to Curzon in November 42 which said:        Greeces Foreign Minister told the editor of the Salonica Jewish organ Pro-Israel that the establishment of a Jewish State meets in Greece with full and sincere sympathy ... A Jewish Palestine would become an ally of Greece.  In ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ", a number of noted historians including professors Tobler, Forel-Yvorne, and Rogaz, supported the idea of establishing a Jewish state, with one referring to it as a sacred right of the Jews.  While in ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", officials and most of the press took the Declaration to mean a British sponsored state for the Jews.     The British government, including Churchill, made it clear that the Declaration did not intend for the whole of Palestine to be converted into a Jewish National Home, but that such a Home should be founded in Palestine.  ": null
    },
    {
        "Emir Faisal": "faisal i of iraq"
    },
    {
        ", King of Syria and Iraq, made a formal written agreement with Zionist leader ": null
    },
    {
        "Chaim Weizmann": "chaim weizmann"
    },
    {
        ", which was drafted by T.E. Lawrence, whereby they would try to establish a peaceful relationship between Arabs and Jews in Palestine. Sekulow, Jay. Unholy Alliance: The Agenda Iran, Russia, and Jihadists Share for Conquering the World, Simon and Schuster pp. 4242 The 42 January 42 ": null
    },
    {
        "Faisal–Weizmann Agreement": "faisal–weizmann agreement"
    },
    {
        " was a short-lived agreement for Arab–Jewish cooperation on the development of a Jewish homeland in Palestine. Faisal did treat Palestine differently in his presentation to the Peace Conference on 42 February 42 saying Palestine, for its universal character, left on one side for the mutual consideration of all parties concerned .  The agreement was never implemented. In a subsequent letter written in English by Lawrence for Faisals signature, he explained:   When the letter was tabled at the ": null
    },
    {
        "Shaw Commission": "shaw commission"
    },
    {
        " in 42 ": null
    },
    {
        "Rustam Haidar": "rustam haidar"
    },
    {
        " spoke to Faisal in Baghdad and cabled that Faisal had no recollection that he wrote anything of the sort . In January 42 Haidar wrote to a newspaper in Baghdad that Faisal: finds it exceedingly strange that such a matter is attributed to him as he at no time would consider allowing any foreign nation to share in an Arab country . ": null
    },
    {
        "Awni Abd al-Hadi": "awni abd al-hadi"
    },
    {
        ", Faisals secretary, wrote in his memoirs that he was not aware that a meeting between Frankfurter and Faisal took place and that: I believe that this letter, assuming that it is authentic, was written by Lawrence, and that Lawrence signed it in English on behalf of Faisal. I believe this letter is part of the false claims made by Chaim Weizmann and Lawrence to lead astray public opinion.  According to Allawi, the most likely explanation for the Frankfurter letter is that a meeting took place, a letter was drafted in English by Lawrence, but that its contents were not entirely made clear to Faisal. He then may or may not have been induced to sign it , since it ran counter to Faisals other public and private statements at the time. A 42 March interview by Le Matin quoted Faisal as saying:   This feeling of respect for other religions dictates my opinion about Palestine, our neighbor. That the unhappy Jews come to reside there and behave as good citizens of this country, our humanity rejoices given that they are placed under a Muslim or Christian government mandated by The League of Nations. If they want to constitute a state and claim sovereign rights in this region, I foresee very serious dangers. It is to be feared that there will be a conflict between them and the other races.       Referring to his 42 ": null
    },
    {
        "White Paper": "churchill white paper"
    },
    {
        ", Churchill later wrote that there is nothing in it to prohibit the ultimate establishment of a Jewish State.  And in private, many British officials agreed with the Zionists interpretation that a state would be established when a Jewish majority was achieved.     When Chaim Weizmann met with Churchill, Lloyd George and Balfour at Balfours home in London on 42 July 42 Lloyd George and Balfour assured Weizmann that by the Declaration they had always meant an eventual Jewish State, according to Weizmann minutes of that meeting.  Lloyd George stated in 42 that it was intended that Palestine would become a Jewish Commonwealth if and when Jews had become a definite majority of the inhabitants , and Leo Amery echoed the same position in 42 In the UNSCOP report of 42 the issue of home versus state was subjected to scrutiny arriving at a similar conclusion to that of Lloyd George.         The statement that such a homeland would be found in Palestine rather than of Palestine was also deliberate. The proposed draft of the declaration contained in Rothschilds 42 July letter to Balfour referred to the principle that Palestine should be reconstituted as the National Home of the Jewish people.  In the final text, following Lord Milners amendment, the word reconstituted was removed and the word that was replaced with in .     This text thereby avoided committing the entirety of Palestine as the National Home of the Jewish people, resulting in controversy in future years over the intended scope, especially the ": null
    },
    {
        "Revisionist Zionism": "revisionist zionism"
    },
    {
        " sector, which claimed entirety of ": null
    },
    {
        "Mandatory Palestine": "mandatory palestine"
    },
    {
        " and ": null
    },
    {
        "Emirate of Transjordan": "emirate of transjordan"
    },
    {
        " as ": null
    },
    {
        "Jewish Homeland": "jewish homeland"
    },
    {
        "  This was clarified by the 42 Churchill White Paper, which wrote that the terms of the declaration referred to do not contemplate that Palestine as a whole should be converted into a Jewish National Home, but that such a Home should be founded in Palestine.      The declaration did not include any geographical boundaries for Palestine. Following the end of the war, three documents – the declaration, the Hussein-McMahon Correspondence and the Sykes-Picot Agreement – became the basis for the negotiations to set the boundaries of Palestine.              The declarations first safeguard clause referred to protecting the ": null
    },
    {
        "civil and religious rights": "human rights"
    },
    {
        " of non-Jews in Palestine. The clause had been drafted together with the second safeguard by Leo Amery in consultation with Lord Milner, with the intention to go a reasonable distance to meeting the objectors, both Jewish and pro-Arab, without impairing the substance of the proposed declaration .     The non-Jews constituted 42% of the population of Palestine; in the words of ": null
    },
    {
        "Ronald Storrs": "ronald storrs"
    },
    {
        ", Britains Military Governor of Jerusalem between 42 and 42 the community observed that they had been not so much as named, either as Arabs, Moslems or Christians, but were lumped together under the negative and humiliating definition of Non-Jewish Communities and relegated to subordinate provisos . The community also noted that there was no reference to protecting their political status or political rights, as there was in the subsequent safeguard relating to Jews in other countries. This protection was frequently contrasted against the commitment to the Jewish community, and over the years a variety of terms were used to refer to these two obligations as a pair; a particularly heated question was whether these two obligations had equal weight , and in 42 this equal status was confirmed by the ": null
    },
    {
        "Permanent Mandates Commission": "permanent mandates commission"
    },
    {
        " and by the British government in the ": null
    },
    {
        "Passfield white paper": "passfield white paper"
    },
    {
        ".     Balfour stated in February 42 that Palestine was considered an exceptional case in which, referring to the local population, we deliberately and rightly decline to accept the principle of ": null
    },
    {
        "self-determination": "self-determination"
    },
    {
        ",  although he considered that the policy provided self-determination to Jews. Avi Shlaim considers this the declarations greatest contradiction . This principle of self-determination had been declared on numerous occasions subsequent to the declarationPresident Wilsons January 42 ": null
    },
    {
        "Fourteen Points": "fourteen points"
    },
    {
        ", McMahons Declaration to the Seven in June 42 the November 42 ": null
    },
    {
        "Anglo-French Declaration": "anglo-french declaration"
    },
    {
        ", and the June 42 ": null
    },
    {
        "Covenant of the League of Nations": "covenant of the league of nations"
    },
    {
        " that had established the ": null
    },
    {
        "mandate system": "league of nations mandate"
    },
    {
        ". In an August 42 memo Balfour acknowledged the inconsistency among these statements, and further explained that the British had no intention of consulting the existing population of Palestine. The results of the ongoing American ": null
    },
    {
        "King–Crane Commission of Enquiry consultation": "king–crane commission"
    },
    {
        " of the local population – from which the British had withdrawn – were suppressed for three years until the report was leaked in 42 Subsequent British governments have acknowledged this deficiency, in particular the 42 committee led by the ": null
    },
    {
        "Lord Chancellor": "lord chancellor"
    },
    {
        ", ": null
    },
    {
        "Frederic Maugham": "frederic maugham, 1st viscount maugham"
    },
    {
        ", which concluded that the government had not been free to dispose of Palestine without regard for the wishes and interests of the inhabitants of Palestine , and the April 42 statement by British Foreign Office minister of state ": null
    },
    {
        "Baroness Anelay": "joyce anelay, baroness anelay of st johns"
    },
    {
        " that the government acknowledged that the Declaration should have called for the protection of political rights of the non-Jewish communities in Palestine, particularly their right to self-determination.             The second safeguard clause was a commitment that nothing should be done which might prejudice the rights of the Jewish communities in other countries outside of Palestine. The original drafts of Rothschild, Balfour, and Milner did not include this safeguard, which was drafted together with the preceding safeguard in early October, in order to reflect opposition from influential members of the Anglo-Jewish community. Lord Rothschild took exception to the proviso on the basis that it presupposed the possibility of a danger to non-Zionists, which he denied.     The Conjoint Foreign Committee of the ": null
    },
    {
        "Board of Deputies of British Jews": "board of deputies of british jews"
    },
    {
        " and the ": null
    },
    {
        "Anglo-Jewish Association": "anglo-jewish association"
    },
    {
        " had published a letter in  The Times  on 42 May 42 entitled Views of Anglo-Jewry, signed by the two organisations presidents, ": null
    },
    {
        "David Lindo Alexander": "david lindo alexander"
    },
    {
        " and ": null
    },
    {
        "Claude Montefiore": "claude montefiore"
    },
    {
        ", stating their view that: the establishment of a Jewish nationality in Palestine, founded on this theory of homelessness, must have the effect throughout the world of stamping the Jews as strangers in their native lands, and of undermining their hard-won position as citizens and nationals of these lands.  This was followed in late August by ": null
    },
    {
        "Edwin Montagu": "edwin montagu"
    },
    {
        ", an influential ": null
    },
    {
        "anti-Zionist": "anti-zionist"
    },
    {
        " Jew and ": null
    },
    {
        "Secretary of State for India": "secretary of state for india"
    },
    {
        ", and the only Jewish member of the British Cabinet, who wrote in a Cabinet memorandum that: The policy of His Majestys Government is anti-Semitic in result and will prove a rallying ground for anti-Semites in every country of the world.          The text of the declaration was published in the press one week after it was signed, on 42November 42 Other related events took place within a short timeframe, the two most relevant being the almost immediate British military capture of Palestine and the leaking of the previously secret Sykes-Picot Agreement. On the military side, both ": null
    },
    {
        "Gaza": "third battle of gaza"
    },
    {
        " and ": null
    },
    {
        "Jaffa fell": "battle of jaffa"
    },
    {
        " within several days, and ": null
    },
    {
        "Jerusalem was surrendered": "battle of jerusalem"
    },
    {
        " to the British on 42 December. The publication of the Sykes–Picot Agreement, following the Russian Revolution, in the Bolshevik  Izvestia  and  Pravda  on 42 November 42 and in the British  Manchester Guardian  on 42 November 42 represented a dramatic moment for the Allies Eastern campaign: the British were embarrassed, the Arabs dismayed and the Turks delighted. ": null
    },
    {
        "Peter Mansfield": "peter mansfield"
    },
    {
        ", The British Empire  magazine, no. 42 Time-Life Books, 42 The Zionists had been aware of the outlines of the agreement since April and specifically the part relevant to Palestine, following a meeting between Weizmann and Cecil where Weizmann made very clear his objections to the proposed scheme.            The declaration represented the first public support for Zionism by a major political power – its publication galvanized Zionism, which finally had obtained an official charter. In addition to its publication in major newspapers, leaflets were circulated throughout Jewish communities. These leaflets were ": null
    },
    {
        "airdrop": "airdrop"
    },
    {
        "ped over Jewish communities in Germany and Austria, as well as the ": null
    },
    {
        "Pale of Settlement": "pale of settlement"
    },
    {
        ", which ": null
    },
    {
        "had been given to the Central Powers": "treaty of brest-litovsk"
    },
    {
        " following the Russian withdrawal.     Weizmann had argued that the declaration would have three effects: it would swing Russia to maintain pressure on Germanys ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        ", since Jews had been prominent in the ": null
    },
    {
        "March Revolution of 42": "february revolution"
    },
    {
        "; it would rally the large Jewish community in the United States to press for greater funding for the ": null
    },
    {
        "American war effort": "american entry into world war i"
    },
    {
        ", underway since April of that year; and, lastly, that it would undermine German Jewish support for ": null
    },
    {
        "Kaiser Wilhelm II": "wilhelm ii, german emperor"
    },
    {
        ".     The declaration spurred an unintended and extraordinary increase in the number of adherents of American Zionism; in 42 the 42 American Zionist societies comprised a total of 42 members, which grew to 42 members in 42 societies in 42 and 42 members in 42 Whilst the British had considered that the declaration reflected a previously established dominance of the Zionist position in Jewish thought, it was the declaration itself that was subsequently responsible for Zionisms legitimacy and leadership.     Exactly one month after the declaration was issued, a large-scale celebration took place at the ": null
    },
    {
        "Royal Opera House": "royal opera house"
    },
    {
        " – speeches were given by leading Zionists as well as members of the British administration including Sykes and Cecil. From 42 until the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", Jews in ": null
    },
    {
        "Mandatory Palestine": "mandatory palestine"
    },
    {
        " celebrated ": null
    },
    {
        "Balfour Day": "balfour day"
    },
    {
        " as an annual national holiday on 42November. The celebrations included ceremonies in schools and other public institutions and festive articles in the Hebrew press. In August 42 Balfour approved Weizmanns request to name the first post-war settlement in Mandatory Palestine, ": null
    },
    {
        "Balfouria": "balfouria"
    },
    {
        " , in his honour. It was intended to be a model settlement for future American Jewish activity in Palestine.     Herbert Samuel, the Zionist MP whose 42 memorandum had framed the start of discussions in the British Cabinet, was asked by Lloyd George on 42April 42 to act as the first ": null
    },
    {
        "civil governor of British Palestine": "high commissioners for palestine and transjordan"
    },
    {
        ", replacing the ": null
    },
    {
        "previous military administration": "occupied enemy territory administration"
    },
    {
        " that had ruled the area since the war. Shortly after beginning the role in July 42 he was invited to read the  haftarah  from ": null
    },
    {
        "Isaiah 42": "isaiah 40"
    },
    {
        " at the ": null
    },
    {
        "Hurva Synagogue": "hurva synagogue"
    },
    {
        " in Jerusalem, which, according to his memoirs, led the congregation of older settlers to feel that the fulfilment of ancient prophecy might at last be at hand .            The local Christian and Muslim community of Palestine, who constituted ": null
    },
    {
        "almost 42% of the population": "demographic history of palestine"
    },
    {
        ", strongly opposed the declaration. As described by the Palestinian-American philosopher ": null
    },
    {
        "Edward Said": "edward said"
    },
    {
        " in 42 it was perceived as being made: by a European power, about a non-European territory, in a flat disregard of both the presence and the wishes of the native majority resident in that territory, and it took the form of a promise about this same territory to another foreign group.      According to the 42 King–Crane Commission, No British officer, consulted by the Commissioners, believed that the Zionist programme could be carried out except by force of arms.  A delegation of the ": null
    },
    {
        "Muslim-Christian Association": "muslim-christian associations"
    },
    {
        ", headed by ": null
    },
    {
        "Musa al-Husayni": "musa al-husayni"
    },
    {
        ", expressed public disapproval on 42November 42 one day after the Zionist Commission parade marking the first anniversary of the Balfour Declaration. They handed a petition signed by more than 42 notables to Ronald Storrs, the British military governor:        The group also protested the carrying of new white and blue banners with two inverted triangles in the middle , drawing the attention of the British authorities to the serious consequences of any political implications in raising the banners.  Later that month, on the first anniversary of the occupation of ": null
    },
    {
        "Jaffa": "jaffa"
    },
    {
        " by the British, the Muslim-Christian Association sent a lengthy memorandum and petition to the military governor protesting once more any formation of a Jewish state.         In the broader Arab world, the declaration was seen as a betrayal of the British wartime understandings with the Arabs. The Sharif of Mecca and other Arab leaders considered the declaration a violation of a previous commitment made in the McMahon–Hussein correspondence in exchange for launching the Arab Revolt.     Following the publication of the declaration, the British dispatched Commander ": null
    },
    {
        "David George Hogarth": "david george hogarth"
    },
    {
        " to see Hussein in January 42 bearing ": null
    },
    {
        "the message": "hogarth message"
    },
    {
        " that the political and economic freedom of the Palestinian population was not in question. Hogarth reported that Hussein would not accept an independent Jewish State in Palestine, nor was I instructed to warn him that such a state was contemplated by Great Britain . Hussein had also learned of the Sykes–Picot Agreement when it was leaked by the new ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " government in December 42 but was satisfied by ": null
    },
    {
        "two disingenuous messages": "bassett letter"
    },
    {
        " from Sir ": null
    },
    {
        "Reginald Wingate": "reginald wingate"
    },
    {
        ", who had replaced McMahon as High Commissioner of Egypt, assuring him that the British commitments to the Arabs were still valid and that the Sykes–Picot Agreement was not a formal treaty.     Continuing Arab disquiet over Allied intentions also led during 42 to the British ": null
    },
    {
        "Declaration to the Seven": "declaration to the seven"
    },
    {
        " and the Anglo-French Declaration, the latter promising the complete and final liberation of the peoples who have for so long been oppressed by the Turks, and the setting up of national governments and administrations deriving their authority from the free exercise of the initiative and choice of the indigenous populations .  , UNISPAL, Annex  A, paragraph  42     In 42 King Hussein refused to ratify the Treaty of Versailles. After February, 42 the British ceased to pay subsidy to him. In August, 42 five days after the signing of the Treaty of Sèvres, which formally recognized the Kingdom of Hejaz, Curzon asked Cairo to procure Husseins signature to both treaties and agreed to make a payment of £42 conditional on signature. Hussein declined and in 42 stated that he could not be expected to affix his name to a document assigning Palestine to the Zionists and Syria to foreigners.  Following the 42 Cairo Conference, Lawrence was sent to try and obtain the Kings signature to a treaty as well as to Versailles and Sèvres, a £42 annual subsidy being proposed; this attempt also failed. During 42 the British made one further attempt to settle outstanding issues with Hussein and once again, the attempt foundered, Hussein continued in his refusal to recognize the Balfour Declaration or any of the Mandates that he perceived as being his domain. In March 42 having briefly considered the possibility of removing the offending article from the treaty, the government suspended any further negotiations; within six months they withdrew their support in favour of their ": null
    },
    {
        "central Arabian": "sultanate of nejd"
    },
    {
        " ally ": null
    },
    {
        "Ibn Saud": "ibn saud"
    },
    {
        ", who proceeded to ": null
    },
    {
        "conquer Husseins kingdom": "saudi conquest of hejaz"
    },
    {
        ".       The declaration was first endorsed by a foreign government on 42 December 42 when ": null
    },
    {
        "Serbian": "kingdom of serbia"
    },
    {
        " Zionist leader and diplomat ": null
    },
    {
        "David Albala": "david albala"
    },
    {
        " announced the support of Serbias ": null
    },
    {
        "government in exile": "government in exile"
    },
    {
        " during a ": null
    },
    {
        "mission": "diplomatic mission"
    },
    {
        " to the United States.   The French and Italian governments offered their endorsements, on 42 February and 42 May 42 respectively. At a ": null
    },
    {
        "private meeting in London on 42 December 42": "1918 clemenceau–lloyd george agreement"
    },
    {
        ", Lloyd George and French Prime Minister ": null
    },
    {
        "Georges Clemenceau": "georges clemenceau"
    },
    {
        " agreed to certain modifications to the Sykes-Picot Agreement, including British control of Palestine.     On 42 April 42 the ": null
    },
    {
        "San Remo conference": "san remo conference"
    },
    {
        " – an outgrowth of the Paris Peace Conference attended by the prime ministers of Britain, France and Italy, the ": null
    },
    {
        "Japanese Ambassador to France": ":category:ambassadors of japan to france"
    },
    {
        ", and the ": null
    },
    {
        "United States Ambassador to Italy": "united states ambassador to italy"
    },
    {
        " – established the basic terms for three League of Nations mandates: a French mandate for Syria, and British mandates for Mesopotamia and Palestine. With respect to Palestine, the resolution stated that the British were responsible for putting into effect the terms of the Balfour Declaration. The French and the Italians made clear their dislike of the Zionist cast of the Palestinian mandate and objected especially to language that did not safeguard the political rights of non-Jews, accepting Curzons claim that in the British language all ordinary rights were included in civil rights . At the request of France, it was agreed that an undertaking was to be inserted in the mandates ": null
    },
    {
        "procès-verbal": "procès-verbal"
    },
    {
        " that this would not involve the surrender of the rights hitherto enjoyed by the non-Jewish communities in Palestine. The Italian endorsement of the Declaration had included the condition ...on the understanding that there is no prejudice against the legal and political status of the already existing religious communities...  ": null
    }
]