[
    {
        "                             The Balts or Baltic people  are an ": null
    },
    {
        "Indo-European": "Proto-Indo-Europeans"
    },
    {
        " ethno-linguistic": "Ethnolinguistics"
    },
    {
        " group who speak the ": null
    },
    {
        "Baltic languages": "Baltic Languages"
    },
    {
        ", a branch of the ": null
    },
    {
        "Indo-European language": "Indo-European Languages"
    },
    {
        " family, originally spoken by tribes of central ": null
    },
    {
        "Eastern Europe": "Eastern Europe"
    },
    {
        " in the west to the ": null
    },
    {
        "Moscow": "Moscow River"
    },
    {
        ", ": null
    },
    {
        "Oka": "Oka River"
    },
    {
        " and ": null
    },
    {
        "Volga": "Volga"
    },
    {
        " river basins in the east. The ": null
    },
    {
        "Baltic languages": "Baltic Languages"
    },
    {
        " form a part of the wider group of ": null
    },
    {
        "Balto-Slavic": "Balto-Slavic"
    },
    {
        " languages.     One of the features of Baltic languages is the number of conservative or archaic features retained. Bojtár page 18. Among the Baltic peoples are modern ": null
    },
    {
        "Lithuanians": "Lithuanians"
    },
    {
        ", ": null
    },
    {
        "Latvians": "Latvians"
    },
    {
        "  — all Eastern Balts — as well as the ": null
    },
    {
        "Old Prussians": "Old Prussians"
    },
    {
        ", ": null
    },
    {
        "Yotvingians": "Yotvingians"
    },
    {
        " and ": null
    },
    {
        "Galindians": "Galindians"
    },
    {
        " — the Western Balts — whose languages and cultures are now extinct.       Medieval German chronicler ": null
    },
    {
        "Adam of Bremen": "Adam Of Bremen"
    },
    {
        " in the latter part of the 11th century AD was the first writer to use the term Baltic in its modern sense to mean the sea of that name. Bojtár page 9. Adam of Bremen reports that he followed the local use of balticus from baelt because the sea stretches to the east in modum baltei . This is the first reference to the Baltic or Barbarian Sea, a days journey from ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        ". Bojtár cites Bremensis I,60 and IV,10. Before him were various ancient places names, such as Balcia, Balcia, Abalcia, Abalus, Basilia, Balisia. However, apart from poor transcription, there is known linguistic rule whereby these words, including Balcia, might become “Baltia.” meaning a supposed island in the Baltic Sea.     It should not be surprising that Adam, a speaker of German, might connect Balt- with Belt , a word he was familiar with. However, linguistics has since established that Balt means white. Common are Baltic words containing the stem balt-, white , ; ; ": null
    },
    {
        "Latgalian": "Latgalian Language"
    },
    {
        ": bolti, lit.  white . which may also refer to shallow bodies of water including marshes.     In Germanic languages there was some form of East Sea until after about 1600, when maps in English labeled it the Baltic Sea . By 1840, the German nobles of the ": null
    },
    {
        "Governorate of Livonia": "Governorate Of Livonia"
    },
    {
        " adopted the term Balts to distinguish themselves from Germans of Germany. They spoke an exclusive dialect, Baltic German. For many, that was the “Baltic language” until 1919. Bojtár page 10.      In 1845, ": null
    },
    {
        "Georg Heinrich Ferdinand Nesselmann": "Georg Heinrich Ferdinand Nesselmann"
    },
    {
        " proposed a distinct ": null
    },
    {
        "language group": "Language Group"
    },
    {
        " for ": null
    },
    {
        "Latvian": "Latvian Language"
    },
    {
        ", ": null
    },
    {
        "Lithuanian": "Lithuanian Language"
    },
    {
        " and ": null
    },
    {
        "Old Prussian": "Old Prussian"
    },
    {
        "—Baltic.  Book review. The term became prevalent after Latvia and Lithuania gained independence in 1918. Up until the early 20th century, either “Latvian” or “Lithuanian” could be used to mean the entire language family. Bojtár page 11.           The Balts or Baltic peoples, defined as speakers of one of the ": null
    },
    {
        "Baltic languages": "Baltic Languages"
    },
    {
        ", a branch of the Indo-European language family, are descended from a group of Indo-European tribes who settled the area between the lower ": null
    },
    {
        "Vistula": "Vistula"
    },
    {
        " and southeast shore of the ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        " and upper ": null
    },
    {
        "Daugava": "Daugava"
    },
    {
        " and ": null
    },
    {
        "Dnieper": "Dnieper"
    },
    {
        " rivers. Because the thousands of lakes and swamps in this area contributed to the Balts geographical isolation, the Baltic languages retain a number of conservative or archaic features.     Some of the major authorities on Balts, such as ": null
    },
    {
        "Kazimieras Būga": "Kazimieras Būga"
    },
    {
        ", ": null
    },
    {
        "Max Vasmer": "Max Vasmer"
    },
    {
        ", ": null
    },
    {
        "Vladimir Toporov": "Vladimir Toporov"
    },
    {
        " and ": null
    },
    {
        "Oleg Trubachyov": "Oleg Trubachyov"
    },
    {
        ", in conducting etymological studies of eastern European river names, were able to identify in certain regions names of specifically Baltic provenance, which most likely indicate where the Balts lived in prehistoric times. This information is summarized and synthesized by ": null
    },
    {
        "Marija Gimbutas": "Marija Gimbutas"
    },
    {
        " in The Balts to obtain a likely proto-Baltic homeland. Its borders are approximately: from a line on the ": null
    },
    {
        "Pomerania": "Pomerania"
    },
    {
        "n coast eastward to include or nearly include the present-day sites of ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        ", ": null
    },
    {
        "Warsaw": "Warsaw"
    },
    {
        ", ": null
    },
    {
        "Kiev": "Kiev"
    },
    {
        ", and ": null
    },
    {
        "Kursk": "Kursk"
    },
    {
        ", northward through ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        " to the River Berzha, westward in an irregular line to the coast of the ": null
    },
    {
        "Gulf of Riga": "Gulf Of Riga"
    },
    {
        ", north of ": null
    },
    {
        "Riga": "Riga"
    },
    {
        ".       The area of Baltic habitation shrank due to assimilation by other groups, and invasions. According to one of the theories which has gained considerable traction over the years, one of the western Baltic tribes, the ": null
    },
    {
        "Galindians": "Galindians"
    },
    {
        ", ": null
    },
    {
        "Galindae": "Galindae"
    },
    {
        ", or Goliad, migrated to the area around modern day Moscow, Russia around the 4th century AD.      Over time the Balts became differentiated into Western and Eastern Balts. In the 5th century AD parts of the eastern Baltic coast began to be settled by the ancestors of the Western Balts: ": null
    },
    {
        "Brus/Prūsa": "Old Prussians"
    },
    {
        " , ": null
    },
    {
        "Sudovians": "Sudovians"
    },
    {
        "/": null
    },
    {
        "Jotvingians": "Jotvingians"
    },
    {
        ", ": null
    },
    {
        "Scalvians": "Scalvians"
    },
    {
        ", ": null
    },
    {
        "Nadruvians": "Nadruvians"
    },
    {
        ", and ": null
    },
    {
        "Curonians": "Curonians"
    },
    {
        ". The Eastern Balts, including the hypothesised ": null
    },
    {
        "Dniepr Balts": "Dniepr Balts"
    },
    {
        ", were living in modern-day Belarus, Ukraine and Russia.     ": null
    },
    {
        "Germanic peoples": "Germanic Peoples"
    },
    {
        " lived to the west of the Baltic homelands; by the first century AD, the ": null
    },
    {
        "Goths": "Goths"
    },
    {
        " had stabilized their kingdom from the mouth of the Vistula, south to ": null
    },
    {
        "Dacia": "Dacia"
    },
    {
        ". As Roman domination collapsed in the first half of the first millennium CE in Northern and Eastern Europe, large migrations of the Balts occurred — first, the ": null
    },
    {
        "Galindae": "Galindae"
    },
    {
        " or ": null
    },
    {
        "Galindians": "Galindians"
    },
    {
        " towards the east, and later, Eastern Balts towards the west. In the seventh century, Slavic tribes from the Volga regions appeared. By the 13th and 14th centuries, they reached the general area that the present-day Balts and Belarusians inhabit. Many other Eastern and Southern Balts either assimilated with other Balts, or Slavs in the 4th–7th centuries and were gradually slavicized.       In the 12th and the 13th centuries, internal struggles, as well as invasions by ": null
    },
    {
        "Ruthenians": "Ruthenians"
    },
    {
        " and ": null
    },
    {
        "Poles": "Poles"
    },
    {
        " and later the expansion of the ": null
    },
    {
        "Teutonic Order": "Teutonic Order"
    },
    {
        " resulted in an almost complete annihilation of the Galindians, Curonians, and Yotvingians. Gradually Old Prussians became ": null
    },
    {
        "Germanized": "Germanization"
    },
    {
        " or some Lithuanized during period from the 15th to the 17th centuries, especially after the ": null
    },
    {
        "Reformation": "Protestant Reformation"
    },
    {
        " in ": null
    },
    {
        "Prussia": "Prussia"
    },
    {
        ". The cultures of the Lithuanians and Latgalians/Latvians survived and became the ancestors of the populations of the modern countries of ": null
    },
    {
        "Latvia": "Latvia"
    },
    {
        " and ": null
    },
    {
        "Lithuania": "Lithuania"
    },
    {
        ".     Old Prussian was closely related to the other extinct Western ": null
    },
    {
        "Baltic language": "Baltic Language"
    },
    {
        "s, ": null
    },
    {
        "Curonian": "Curonian Language"
    },
    {
        ", ": null
    },
    {
        "Galindian": "Galindian Language"
    },
    {
        " and ": null
    },
    {
        "Sudovian": "Sudovian Language"
    },
    {
        ". It is more distantly related to the surviving Eastern ": null
    },
    {
        "Baltic language": "Baltic Language"
    },
    {
        "s, ": null
    },
    {
        "Lithuanian": "Lithuanian Language"
    },
    {
        " and ": null
    },
    {
        "Latvian": "Latvian Language"
    },
    {
        ". Compare the Prussian word seme , Mikkels Klussis. Bāziscas prûsiskai-laîtawiskas wirdeîns per tālaisin laksikis rekreaciônin . the Latvian zeme, the Lithuanian žemė ": null
    }
]