[
    {
        "        The Bank of Italy, known in Italian as Banca dItalia , also known as Bankitalia, is the ": null
    },
    {
        "central bank": "Central Bank"
    },
    {
        " of ": null
    },
    {
        "Italy": "Italy"
    },
    {
        " and part of the ": null
    },
    {
        "European System of Central Banks": "European System Of Central Banks"
    },
    {
        ". It is located in ": null
    },
    {
        "Palazzo Koch": "Palazzo Koch"
    },
    {
        ", ": null
    },
    {
        "via Nazionale": "Via Nazionale"
    },
    {
        ", ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ". The banks current governor is ": null
    },
    {
        "Ignazio Visco": "Ignazio Visco"
    },
    {
        ", who took the office on 1 November 2011.       After the charge of monetary and exchange rate policies was shifted in 1998 to the ": null
    },
    {
        "European Central Bank": "European Central Bank"
    },
    {
        ", within the European institutional framework, the bank implements the decisions, issues ": null
    },
    {
        "euro": "Euro"
    },
    {
        " banknotes and withdraws and destroys worn pieces.     The main function has thus become banking and financial supervision. The objective is to ensure the stability and efficiency of the system and compliance to rules and regulations; the bank pursues it through secondary legislation, controls and cooperation with governmental authorities.     Following reform in 2005, which was prompted by takeover scandals, the bank has lost exclusive antitrust authority in the credit sector, which is now shared with the ": null
    },
    {
        "Italian Competition Authority": "Italian Competition Authority"
    },
    {
        " .     Other functions include, market supervision, oversight of the payment system and provision of settlement services, State treasury service, Central Credit Register, economic analysis and institutional consultancy.     As of 2017 the Bank of Italy owned 2,451.8 ": null
    },
    {
        "tonnes": "Tonnes"
    },
    {
        " of ": null
    },
    {
        "gold": "Gold"
    },
    {
        ", the third-largest ": null
    },
    {
        "gold reserve": "Gold Reserve"
    },
    {
        " in the world.        The institution was established in 1893 from the combination of three major banks in Italy . Alfredo Gigliobianco and Claire Giordano, , Quaderni di Storia Economica , No. 5, November 2010 , Banca DItalia. The new central bank first issued bank-notes during 1926. , Banca DItalia. Until 1928, it was directed by a general manager, after this time instead by a governor elected by an internal commission of managers, with a decree from the ": null
    },
    {
        "President of the Italian Republic": "President Of The Italian Republic"
    },
    {
        ", for a term of seven years.       ": null
    },
    {
        "Giacomo Grillo": "Giacomo Grillo"
    },
    {
        "   Giuseppe Marchiori": "Giuseppe Marchiori"
    },
    {
        "   Bonaldo Stringher": "Bonaldo Stringher"
    },
    {
        "       Bonaldo Stringher": "Bonaldo Stringher"
    },
    {
        "   Vincenzo Azzolini": "Vincenzo Azzolini"
    },
    {
        "   Luigi Einaudi": "Luigi Einaudi"
    },
    {
        "   Donato Menichella": "Donato Menichella"
    },
    {
        "   Guido Carli": "Guido Carli"
    },
    {
        "   Paolo Baffi": "Paolo Baffi"
    },
    {
        "   Carlo Azeglio Ciampi": "Carlo Azeglio Ciampi"
    },
    {
        "   Antonio Fazio": "Antonio Fazio"
    },
    {
        "   Mario Draghi": "Mario Draghi"
    },
    {
        "   Ignazio Visco": "Ignazio Visco"
    },
    {
        "         The banks governing bodies are the ": null
    },
    {
        "General Meeting of Shareholders": "Annual General Meeting"
    },
    {
        ", the ": null
    },
    {
        "board of directors": "Board Of Directors"
    },
    {
        ", the governor, the ": null
    },
    {
        "director general": "Director General"
    },
    {
        " and three deputy directors general; the last five constitute the directorate.     The general meeting takes place yearly and with the purpose of approving accounts and appointing the ": null
    },
    {
        "auditor": "Auditor"
    },
    {
        "s. The board of directors has administrative powers and is chaired by the governor . Following reform in 2005, the governor lost exclusive responsibility regarding decisions of external relevance , which has been transferred to the directorate . The director general is responsible for the day-to-day administration of the bank, and acts as governor when absent.     The ": null
    },
    {
        "board of auditors": "Board Of Auditors"
    },
    {
        " assesses the banks administration and compliance with the law, regulations and the statute.       The directorates ": null
    },
    {
        "term of office": "Term Of Office"
    },
    {
        " lasts six years and is renewable once. The appointment of the governor is the responsibility of the government, head of the board of directors, with the approval of the ": null
    },
    {
        "president": "President Of Italy"
    },
    {
        " . The board of directors is elected by the shareholders according to the bank ": null
    },
    {
        "statute": "Statute"
    },
    {
        ".     On 25 October 2011, ": null
    },
    {
        "Silvio Berlusconi": "Silvio Berlusconi"
    },
    {
        " nominated ": null
    },
    {
        "Ignazio Visco": "Ignazio Visco"
    },
    {
        " to be the banks new governor to replace ": null
    },
    {
        "Mario Draghi": "Mario Draghi"
    },
    {
        " when he left to become president of the ": null
    },
    {
        "European Central Bank": "European Central Bank"
    },
    {
        " in November.        Banca dItalia had 300,000 shares with a nominal value of €25,000. Originally scattered around the banks of whole Italy, the shares now accumulated due to the merger of the banks since 1990s. The status of the bank states that a minimum of 54% of profits would go to the Italian government, and only a maximum of 6% of profits would distributed as dividends according to shares ratio. , Banca dItalia.        ": null
    }
]