[
    {
        "   A banner can be a ": null
    },
    {
        "flag": "flag"
    },
    {
        " or other piece of cloth bearing a symbol, logo, slogan or other message. A flag whose design is the same as the shield in a ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " is called a ": null
    },
    {
        "banner of arms": "banner of arms"
    },
    {
        ". Also, a bar-shaped piece of non-cloth advertising material sporting a name, slogan, or other marketing message.     ": null
    },
    {
        "Banner-making": "banner-making"
    },
    {
        " is an ancient craft. Church banners commonly portray the saint to whom the church is dedicated.     The word derives from the French word bannière and ": null
    },
    {
        "late Latin": "vulgar latin"
    },
    {
        " bandum, a cloth out of which a flag is made . The ": null
    },
    {
        "German language": "german language"
    },
    {
        " developed the word to mean an official ": null
    },
    {
        "edict": "edict"
    },
    {
        " or proclamation and since such written orders often prohibited some form of human activity, bandum assumed the meaning of a ": null
    },
    {
        "ban": "ban"
    },
    {
        ", control, interdict or excommunication.  Banns  has the same origin meaning an official proclamation, and abandon means to change loyalty or disobey orders, semantically to leave the cloth or flag .          The vexillum was a flag-like object used as a ": null
    },
    {
        "military": "military"
    },
    {
        " standard by units in the ": null
    },
    {
        "Ancient Roman": "ancient roman"
    },
    {
        " army.     The word vexillum itself is a diminutive of the Latin word, velum, meaning a sail, which confirms the historical evidence that vexilla were literally little sails i.e. flag-like standards. In the vexillum the cloth was draped from a horizontal crossbar suspended from the staff; this is unlike most modern flags in which the hoist of the cloth is attached directly to the vertical ": null
    },
    {
        "staff": "staff"
    },
    {
        ".             A heraldic banner, also called a ": null
    },
    {
        "banner of arms": "banner of arms"
    },
    {
        ", displays the basic ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " only: i.e. it shows the design usually displayed on the ": null
    },
    {
        "shield": "escutcheon"
    },
    {
        " and omits the crest, helmet or coronet, mantling, supporters, motto or any other elements associated with the full ": null
    },
    {
        "armorial achievement": "achievement"
    },
    {
        " . A heraldic banner is usually square or rectangular.     A distinction exists between the heraldic banner and the ": null
    },
    {
        "heraldic standard": "heraldic standard"
    },
    {
        ". The distinction, however, is often misunderstood or ignored. For example, the ": null
    },
    {
        "Royal Standard of the United Kingdom": "royal standard of the united kingdom"
    },
    {
        " arms": "royal coat of arms of scotland"
    },
    {
        " of the ": null
    },
    {
        "Kingdom of Scotland": "kingdom of scotland"
    },
    {
        "  escutcheon": "escutcheon"
    },
    {
        " The Lion Rampant": "royal banner of scotland"
    },
    {
        " : the banner of the ": null
    },
    {
        "King of Scots": "king of scots"
    },
    {
        " Cardinal Wolsey": "cardinal wolsey"
    },
    {
        "                 In the ": null
    },
    {
        "old testament": "old testament"
    },
    {
        ", the ": null
    },
    {
        "prophet": "prophet"
    },
    {
        " Isaiah": "isaiah"
    },
    {
        " was commanded to raise a banner and exalt his voice . ": null
    },
    {
        "Habakkuk": "habakkuk"
    },
    {
        " received a similar order to write a vision upon tables that could be read by one who runs past it .          Banners in churches have, in the past, been used mainly for ": null
    },
    {
        "procession": "procession"
    },
    {
        "s, both inside and outside of the church building. However, the emphasis has, in recent years, shifted markedly towards the permanent or transient display of banners on walls or pillars of churches and other places of worship. A famous example of large banners on display is ": null
    },
    {
        "Liverpool R.C. Cathedral": "liverpool metropolitan cathedral"
    },
    {
        ", where the banners are designed by a resident artist.     Banners are also used to communicate the ": null
    },
    {
        "testimony": "religious testimony"
    },
    {
        " of Jesus Christ by ": null
    },
    {
        "evangelist": "evangelism"
    },
    {
        "s and public ministers engaged in ": null
    },
    {
        "Open Air Preaching": "open air preaching"
    },
    {
        ".            The ": null
    },
    {
        "iconography": "iconography"
    },
    {
        " of these banners included mines, mills, factories, but also visions of the future, showing a land where children and adults were well-fed and living in tidy brick-built houses, where the old and sick were cared for, where the burden of work was lessened by new technology, and where leisure time was increasing. The same kind of banners are also used in many other countries. Many, but not all of them, have ": null
    },
    {
        "red": "red"
    },
    {
        " as a dominant colour.          In ": null
    },
    {
        "Australia": "australia"
    },
    {
        " in the late nineteenth and early twentieth centuries, trade union banners were unfurled with pride in annual Eight Hour Day marches which advocated ‘Eight Hours Labour, Eight Hours Recreation and Eight Hours Rest’. These marches were one of the most prominent annual celebrations staged in Australia by any group. In Sydney alone, by the early twentieth century, thousands of unionists representing up to seventy different unions would take part in such parades, marching behind the banner emblematic of their trade. Most of these banners have not survived; the Labour Council of NSW has the largest surviving collection at ": null
    },
    {
        "Sydney Trades Hall": "sydney trades hall"
    },
    {
        " Sydney Trades Hall in Sussex Street, Sydney.     The ": null
    },
    {
        "State Library of NSW": "state library of nsw"
    },
    {
        " in ": null
    },
    {
        "Sydney": "sydney, australia"
    },
    {
        " has a small collection of trade union banners that were donated to the Library in the early 42s such that of a Federated Society of Boilermakers, Iron & Steel Shipbuilders of Australia banner thought to have been made c. 4242 The Federated Society of Boilermakers, Iron & Steel Shipbuilders of Australia was formed in 42 and joined the Amalgamated Metal Workers Union in 42     The banner features a kneeling figure in the centre surrounded by scroll work and is decorated with Australian native flowers and images representative of the work of the Unions members such as a New South Wales Government Railways 42 class steam locomotive, the Hawkesbury River rail bridge built in 42 and a furnace. The reverse of the banner shows the warship Australia at sea. The banner is canvas and was painted by Sydney firm Althouse & Geiger, master painters and decorators. Founded in 42 the company is still in operation. The banner is a powerful interpretive tool in communicating the experience and the history of the Australian labour movement.     For more on the ": null
    },
    {
        "design": "design"
    },
    {
        " and making of these banners, see ": null
    },
    {
        "Banner-making": "banner-making"
    },
    {
        ".            Sports fans often buy or make banners to display in the grandstands. Team banners typically contain the logo, name or nickname, motto and the team colors. Banners on individual competitors can contain a picture or drawing of the player. Sports banners may also honor notable players or hall-of-fame athletes and commemorate past championships won. These types of sports banners are typically hung from ": null
    },
    {
        "rafter": "rafter"
    },
    {
        "s in stadiums. The ": null
    },
    {
        "Miami Heat": "miami heat"
    },
    {
        ", an ": null
    },
    {
        "NBA": "nba"
    },
    {
        " Team, hangs division titles and ": null
    },
    {
        "championship": "championship"
    },
    {
        " banners at the top of the rafters in their home stadium, ": null
    },
    {
        "American Airlines Arena": "american airlines arena"
    },
    {
        ". Similar to other sports banners, they feature the color palette of the teams logo, the logo, names of players, and championship winning years. In North American indoor professional sports, the previous seasons champion traditionally does not install their awarded championship banner until moments prior to their first home game of the season that follows, in a procedure that is chiefly referred to as raising the banner .     Uruguays ": null
    },
    {
        "Club Nacional de Football": "club nacional de football"
    },
    {
        " supporters made a 42 x 42 metre banner that weighs over 42 tonnes; they claim it is the largest in the world.  - Diario Ovción, August 42 42 It was unveiled in April 42 in a ": null
    },
    {
        "Copa Libertadores": "copa libertadores"
    },
    {
        " football match at the ": null
    },
    {
        "Estadio Centenario": "estadio centenario"
    },
    {
        ".       Often fabricated commercially on a plastic background, the banner industry has developed from the traditional cut-vinyl banners to banners printed within large, ultra-wide format ": null
    },
    {
        "inkjet printer": "inkjet printer"
    },
    {
        "s on various vinyl and fabric materials using ": null
    },
    {
        "solvent ink": "solvent ink"
    },
    {
        "s and ": null
    },
    {
        "ultraviolet-curable ink": "ultraviolet-curable ink"
    },
    {
        "s.     Banners are used in many business ventures, marketing to their potential audience. A number of British towns and cities have whole series of banners decorating their city centers, effectively advertising the town or its special features and attractions. Pre-printed banners, albeit commonly used, are simple and accessible. Banners can be printed in enormous formats, with a full range of rich colors. They can also be used in many different physical situations whether it be hanging from an existing fixture, fixed to a wall or even free standing. When an advertising banner is hung or suspended between posts, grommets or another method of attachment are necessary to prevent the banner from tearing or flying away. Aluminum grommets can be punched into the banner and used as secure entry points to tie the banner down. This installation method allows for more durable advertisements. Some vendors offer pre-installed ": null
    },
    {
        "grommets": "grommets"
    },
    {
        ". Another common form of free standing banners are retractable displays.     Banners can be found plastered behind a window screen, as billboards, atop skyscrapers, or ": null
    },
    {
        "towed by airplanes or blimps": "aerial advertising"
    },
    {
        ". As with variable of size and quantity, the number of sides and quality of ink are as much of a crucial factor. In an instance of retail stores which purchase pre-printed clearance banners, or a variety of sale banner. A banner facing underneath or against glass is absorbing exposure from the sun. A banner printed on UV outdoor ink will last several years to a decade where cheaper ink fades, requiring frequent replacement. Being behind glass, a two-sided banner can be displayed from the inside and out, often building recognition between shoppers and caretakers. Three-sided banners are often appealing as there is dimension and can be embellished differently. The more sides that exist, the more angles the banner covers, which is a possibility where a two-sided banner doesnt face the viewer from center of the room or streets.     Another manifestation of advertising banners, unique to the 42st century, are ": null
    },
    {
        "banner ad": "banner ad"
    },
    {
        "s ,  which are advertisements on websites. The banner ads contain hyperlinks to other websites. Also, on free music streaming services such as Spotify and Pandora, audio advertisements will play in between songs. One of the common tag lines is Click the banner to learn more.       In China, it is common to find large red coloured banners, especially in schools, factories, government institutions and construction sites. Also called da zi bao , these tend to be big and long, usually with red backgrounds and large Chinese characters. They tend to have motivational messages or industrial milestones on them. Historically, these ": null
    },
    {
        "big character posters": "big-character poster"
    },
    {
        " were used to convey messages during the ": null
    },
    {
        "cultural revolution": "cultural revolution"
    },
    {
        ", but their use changed after the countrys liberalization since 42 ": null
    }
]