[
    {
        "                 Lord Banquo , the ": null
    },
    {
        "Thane": "thane"
    },
    {
        " of ": null
    },
    {
        "Lochaber": "lochaber"
    },
    {
        ", is a character in ": null
    },
    {
        "William Shakespeares": "william shakespeare"
    },
    {
        "1606 play  Macbeth . In the play, he is at first an ally to ": null
    },
    {
        "Macbeth": "macbeth"
    },
    {
        " and they meet the ": null
    },
    {
        "Three Witches": "three witches"
    },
    {
        " together. After prophesying that Macbeth will become king, the witches tell Banquo that he will not be king himself, but that his descendants will be. Later, Macbeth in his lust for power sees Banquo as a threat and has him murdered by two hired assassins; Banquos son, ": null
    },
    {
        "Fleance": "fleance"
    },
    {
        ", escapes. Banquos ghost returns in a later scene, causing Macbeth to react with alarm during a public feast.     Shakespeare borrowed the character Banquo from  Holinsheds Chronicles , a history of Britain published by ": null
    },
    {
        "Raphael Holinshed": "raphael holinshed"
    },
    {
        " in 1587. In Chronicles Banquo is an accomplice to Macbeth in the murder of the king, rather than a loyal subject of the king who is seen as an enemy by Macbeth. Shakespeare may have changed this aspect of his character to please ": null
    },
    {
        "King James": "james i of england"
    },
    {
        ", who was thought at the time to be a descendant of the real Banquo. Critics often interpret Banquos role in the play as being a ": null
    },
    {
        "foil": "foil"
    },
    {
        " to Macbeth, resisting evil whereas Macbeth embraces it. Sometimes, however, his motives are unclear, and some critics question his purity. He does nothing to accuse Macbeth of murdering the king, even though he has reason to believe Macbeth is responsible.             Shakespeare often used ": null
    },
    {
        "Raphael Holinsheds": "raphael holinshed"
    },
    {
        " Chronicles of England, Scotland, and Ireland—commonly known as  Holinsheds Chronicles —as a source for his plays, and in  Macbeth  he borrows from several of the tales in that work.  Holinshed portrays Banquo as an historical figure: he is an accomplice in ": null
    },
    {
        "Mac Bethad mac Findlaíchs": "macbeth of scotland"
    },
    {
        " murder of ": null
    },
    {
        "Donnchad mac Crínáin": "duncan i of scotland"
    },
    {
        " and plays an important part in ensuring that Macbeth, not ": null
    },
    {
        "Máel Coluim mac Donnchada": "malcolm iii of scotland"
    },
    {
        " , takes the throne in the coup that follows.  Holinshed in turn used an earlier work, the Scotorum Historiae by ": null
    },
    {
        "Hector Boece": "hector boece"
    },
    {
        ", as his source. Boeces work is the first known record of Banquo and his son ": null
    },
    {
        "Fleance": "fleance"
    },
    {
        "; and scholars such as ": null
    },
    {
        "David Bevington": "david bevington"
    },
    {
        " generally consider them fictional characters invented by Boece. In Shakespeares day, however, they were considered historical figures of great repute, and the king, ": null
    },
    {
        "James I": "james i of england"
    },
    {
        ", based his claim to the throne in part on a descent from Banquo.  The ": null
    },
    {
        "House of Stuart": "house of stuart"
    },
    {
        " was descended from ": null
    },
    {
        "Walter fitz Alan, Steward of Scotland": "walter fitz alan, steward of scotland"
    },
    {
        ", and he was believed to have been the grandson of Fleance and ": null
    },
    {
        "Gruffydd ap Llywelyns": "gruffydd ap llywelyn"
    },
    {
        "daughter, ": null
    },
    {
        "Nesta ferch Gruffydd": "nesta ferch gruffydd"
    },
    {
        ". In reality, Walter fitz Alan was the son of ": null
    },
    {
        "Alan fitz Flaad": "alan fitz flaad"
    },
    {
        ", a Breton knight.      Unlike his sources, Shakespeare gives Banquo no role in the Kings murder, making it a deed committed solely by Macbeth and his wife, ": null
    },
    {
        "Lady Macbeth": "lady macbeth"
    },
    {
        ". Why Shakespeares Banquo is so different from the character described by Holinshed and Boece is not known, though critics have proposed several possible explanations. First among them is the risk associated with portraying the kings ancestor as a murderer and conspirator in the plot to overthrow a rightful king, as well as the authors desire to flatter a powerful patron. But Shakespeare may also simply have altered Banquos character because there was no dramatic need for another accomplice to the murder. There was, however, a need to provide a dramatic contrast to Macbeth; a role that many scholars argue is filled by Banquo. Similarly, when ": null
    },
    {
        "Jean de Schelandre": "jean de schelandre"
    },
    {
        " wrote about Banquo in his  Stuartide  in 1611, he also changed the character by portraying him as a noble and honourable man—the critic D.W. Maskell describes him as ...Schelandres paragon of valour and virtue —probably for reasons similar to Shakespeares.      Banquos role in the coup that follows the murder is harder to explain. Banquos loyalty to Macbeth, rather than ": null
    },
    {
        "Malcolm": "malcolm"
    },
    {
        ", after Duncans death makes him a passive accomplice in the coup: Malcolm, as Prince of Cumberland, is the rightful heir to the throne and Macbeth a usurper. Daniel Amneus argued that Macbeth as it survives is a revision of an earlier play, in which Duncan granted Macbeth not only the title of Thane of Cawdor, but the greater honor  of Prince of Cumberland . Banquos silence may be a survival from the posited earlier play, in which Macbeth was the legitimate successor to Duncan.            Banquo is in a third of the plays scenes, as both a human and a ghost. As significant as he is to the plot, he has fewer lines than the relatively insignificant Ross, a Scottish nobleman who survives the play.  In the second scene of the play, a wounded soldier describes the manner in which Macbeth, Thane of Glamis, and Banquo, Thane of Lochaber, resisted invading forces, fighting side by side. In the next scene, Banquo and Macbeth, returning from the battle together, encounter the ": null
    },
    {
        "Three Witches": "three witches"
    },
    {
        ", who predict that Macbeth will become Thane of Cawdor, and then king. Banquo, sceptical of the witches, challenges them to predict his own future, and they foretell that Banquo will never himself take the throne, but will beget a line of kings. Banquo remains sceptical after the encounter, wondering aloud if evil can ever speak the truth. He warns Macbeth that evil will offer men a small, hopeful truth only to catch them in a deadly trap.      When Macbeth kills the king and takes the throne, Banquo—the only one aware of this encounter with the witches—reserves judgment for God. He is unsure whether Macbeth committed regicide to gain the throne, but muses in a ": null
    },
    {
        "soliloquy": "soliloquy"
    },
    {
        " that I fear / Thou playdst most foully for t .  He offers his respects to the new King Macbeth and pledges loyalty.  Later, worried that Banquos descendants and not his own will rule ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", Macbeth sends two men, and then a ": null
    },
    {
        "Third Murderer": "third murderer"
    },
    {
        ", to kill Banquo and his son ": null
    },
    {
        "Fleance": "fleance"
    },
    {
        ". During the melee, Banquo holds off the assailants so that Fleance can escape, but is himself killed.  The ": null
    },
    {
        "ghost": "ghosts in european culture"
    },
    {
        " of Banquo later returns to haunt Macbeth at the banquet in Act Three, Scene Four. A terrified Macbeth sees him, while the apparition is invisible to his guests. He appears again to Macbeth in a vision granted by the Three Witches, wherein Macbeth sees a long line of kings descended from Banquo.               Many scholars see Banquo as a ": null
    },
    {
        "foil": "foil"
    },
    {
        " and a contrast to Macbeth. Macbeth, for example, eagerly accepts the Three Witches prophecy as true and seeks to help it along. Banquo, on the other hand, doubts the prophecies and the intentions of these seemingly evil creatures. Whereas Macbeth places his hope in the prediction that he will be king, Banquo argues that evil only offers gifts that lead to destruction. Banquo steadily resists the temptations of evil within the play, praying to heaven for help, while Macbeth seeks darkness, and prays that evil powers will aid him. This is visible in act two; after Banquo sees Duncan to bed, he says: Theres husbandry in heaven, / Their candles are all out .  This premonition of the coming darkness in association with Macbeths murders is repeated just before Banquo is killed: it will be rain to-night ,  Banquo tells his son Fleance.      Banquos status as a contrast to Macbeth makes for some tense moments in the play. In act two, scene one, Banquo meets his son Fleance and asks him to take both his sword and his dagger . He also explains that he has been having trouble sleeping due to cursed thoughts that nature / gives way to in repose!  On Macbeths approach, he demands the sword returned to him quickly. Scholars have interpreted this to mean that Banquo has been dreaming of murdering the king as Macbeths accomplice to take the throne for his own family, as the Three Witches prophesied to him. In this reading, his good nature is so revolted by these thoughts that he gives his sword and dagger to Fleance to be sure they do not come true, but is so nervous at Macbeths approach that he demands them back.  Other scholars have responded that Banquos dreams have less to do with killing the king and more to do with Macbeth. They argue that Banquo is merely setting aside his sword for the night. Then, when Macbeth approaches, Banquo, having had dreams about Macbeths deeds, takes back his sword as a precaution in this case.      Macbeth eventually sees that Banquo can no longer be trusted to aid him in his evil, and considers his friend a threat to his newly acquired throne; thus, he has him murdered. Banquos ability to live on in different ways is another oppositional force, in this case to Macbeths impending death. His spirit lives on in Fleance, his son, and in his ghostly presence at the banquet.        When Macbeth returns to the witches later in the play, they show him an apparition of the murdered Banquo, along with eight of his descendants. The scene carries deep significance: King James, on the throne when Macbeth was written, was believed to be separated from Banquo by nine generations. What Shakespeare writes here thus amounts to a strong support of James right to the throne by lineage, and for audiences of Shakespeares day, a very real fulfilment of the witches prophecy to Banquo that his sons would take the throne.  This apparition is also deeply unsettling to Macbeth, who not only wants the throne for himself, but also desires to father a line of kings.      Banquos other appearance as a ghost during the banquet scene serves as an indicator of Macbeths conscience returning to plague his thoughts. Banquos triumph over death appears symbolically, insofar as he literally takes Macbeths seat during the feast. Shocked, Macbeth uses words appropriate to the metaphor of usurpation, describing Banquo as crowned with wounds. The spirit drains Macbeths manhood along with the blood from his cheeks; as soon as Banquos form vanishes, Macbeth announces: Why, so; being gone, / I am a man again.        Like the vision of Banquos lineage, the banquet scene has also been the subject of criticism. Critics have questioned whether not one, but perhaps two ghosts appear in this scene: Banquo and Duncan. Scholars arguing that Duncan attends the banquet state that Macbeths lines to the Ghost could apply equally well to the slain king. Thou canst not say I did it , for example, can mean that Macbeth is not the man who actually killed Banquo, or it can mean that Duncan, who was asleep when Macbeth killed him, cannot claim to have seen his killer. To add to the confusion, some lines Macbeth directs to the ghost, such as Thy bones are marrowless ,   cannot rightly be said of Banquo, who has only recently died.      Scholars debate whether Macbeths vision of Banquo is real or a hallucination. Macbeth had already seen a hallucination before murdering Duncan: a knife hovering in the air. Several performances of the play have even ignored the stage direction to have the Ghost of Banquo enter at all, heightening the sense that Macbeth is growing mad, since the audience cannot see what he claims to see. Scholars opposing this view claim that while the dagger is unusual, ghosts of murdered victims are more believable, having a basis in the audiences superstitions. Spirits in other Shakespeare plays—notably  Hamlet  and  Midsummer Nights Dream —exist in ambiguous forms, occasionally even calling into question their own presence.      The concept of a character being confronted at a triumphant feast with a reminder of their downfall is not unique to Shakespeare and may originate from ": null
    },
    {
        "Belshazzars feast": "belshazzars feast"
    },
    {
        ", as portrayed in the ": null
    },
    {
        "Bible": "bible"
    },
    {
        ". The term ghost at the feast has entered popular culture, and is often used as a metaphor for a subject a person would rather avoid considering, or  a reminder of a persons unpleasant past or likely future.          Banquos role, especially in the banquet ghost scene, has been subject to a variety of interpretations and mediums. Shakespeares text states: Enter Ghost of Banquo, and sits in Macbeths place.  Several television versions have altered this slightly, having Banquo appear suddenly in the chair, rather than walking onstage and into it. Special effects and camera tricks also allow producers to make the ghost disappear and reappear, highlighting the fact that only Macbeth can see it.      Stage directors, unaided by post-production effects and camera tricks, have used other methods to depict the ghost. In the late 19th century, elaborate productions of the play staged by ": null
    },
    {
        "Henry Irving": "henry irving"
    },
    {
        " employed a wide variety of approaches for this task. In 1877 a green silhouette was used to create a ghostlike image; ten years later a trick chair was used to allow an actor to appear in the middle of the scene, and then again from the midst of the audience. In 1895 a shaft of blue light served to indicate the presence of Banquos spirit. In 1933 a Russian director named Theodore Komisarjevsky staged a modern retelling of the play ; he used Macbeths shadow as the ghost.  In 1936, ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        " directed the ": null
    },
    {
        "Federal Theatre Project": "federal theatre project"
    },
    {
        " production of the play": "voodoo macbeth"
    },
    {
        ", with an African-American cast that included ": null
    },
    {
        "Canada Lee": "canada lee"
    },
    {
        " in the role of Banquo.     Film adaptations have approached Banquos character in a variety of ways. ": null
    },
    {
        "Akira Kurosawas": "akira kurosawa"
    },
    {
        "1957 adaptation  Throne of Blood  makes the character into Capitan Miki , slain by Macbeths equivalent when his wife explains that she is with child. News of Mikis death does not reach Washizu until after he has seen the ghost in the banquet scene. In ": null
    },
    {
        "Roman Polanskis": "roman polanski"
    },
    {
        "1971 ": null
    },
    {
        "adaptation": "macbeth"
    },
    {
        ", Banquo is played by acclaimed stage actor ": null
    },
    {
        "Martin Shaw": "martin shaw"
    },
    {
        ", in a style reminiscent of earlier stage performances.  Polanskis version also emphasises Banquos objection to Macbeths ascendency by showing him remaining silent as the other thanes around him hail Macbeth as king.  In the 1990 film  Men of Respect , a reimagining of Macbeth as taking place among a New York Mafia crime family, the character of Banquo is named Bankie Como and played by American actor ": null
    },
    {
        "Dennis Farina": "dennis farina"
    }
]