[
    {
        "      Barbara Gowdy, ": null
    },
    {
        "CM": "order of canada"
    },
    {
        " is a Canadian ": null
    },
    {
        "novelist": "novelist"
    },
    {
        " and ": null
    },
    {
        "short story": "short story"
    },
    {
        " writer. Born in ": null
    },
    {
        "Windsor": "windsor, ontario"
    },
    {
        ", ": null
    },
    {
        "Ontario": "ontario"
    },
    {
        ", she is the long-time partner of poet ": null
    },
    {
        "Christopher Dewdney": "christopher dewdney"
    },
    {
        " and resides in ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        ".       Gowdys novel  Falling Angels  was made into a ": null
    },
    {
        "film of the same name": "falling angels"
    },
    {
        " by director Scott Smith, from an adaptation written by ": null
    },
    {
        "Esta Spalding": "esta spalding"
    },
    {
        ", in 42 The comically dark novel focuses on a nuclear family in a 42s Ontario suburb. The main characters are three sisters who come of age in a house run by their abusive and womanizing father and must constantly find ways to take care of their ": null
    },
    {
        "depressed": "clinical depression"
    },
    {
        " and ": null
    },
    {
        "alcoholic": "alcoholism"
    },
    {
        " mother. Gowdy says her inspiration for the book was the idea of a Canadian family living during the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " and practicing using their bomb shelter in the back yard. In the novel and movie, the family spend two weeks trapped in the bomb shelter as an exercise rather than going on a family trip to ": null
    },
    {
        "Disneyland": "disneyland"
    },
    {
        ".     Authors such as ": null
    },
    {
        "Alice Munro": "alice munro"
    },
    {
        " and ": null
    },
    {
        "Carol Shields": "carol shields"
    },
    {
        " look at the everyday, but the bulk of Gowdys work reflects upon the opposite. Gowdys stories look at the extreme, the strange and the abnormal, but she manages to make her characters both human and poignant. She often draws on ": null
    },
    {
        "magic realism": "magic realism"
    },
    {
        " as a writing style, combining the fantastic or unusual with realistic and believable descriptions, placing her within the tradition of ": null
    },
    {
        "Southern Ontario Gothic": "southern ontario gothic"
    },
    {
        ".     The narrator and main character of the title short story of her 42 collection, We So Seldom Look On Love, for instance, is an assistant embalmer at a funeral home who makes love to the bodies of attractive young men before they are buried. The story was the inspiration for the 42 Canadian ": null
    },
    {
        "independent film": "independent film"
    },
    {
        "  Kissed , directed by ": null
    },
    {
        "Lynne Stopkewich": "lynne stopkewich"
    },
    {
        " and starring ": null
    },
    {
        "Molly Parker": "molly parker"
    },
    {
        ". The storys name is taken from a line in the Frank OHaras poem Ode on ": null
    },
    {
        "Necrophilia": "necrophilia"
    },
    {
        " , and was inspired by a newspaper article Gowdy read about ": null
    },
    {
        "Karen Greenlee": "karen greenlee"
    },
    {
        ", a young ": null
    },
    {
        "California": "california"
    },
    {
        " woman who hijacked a hearse on its way to a funeral, took the corpse of the young man inside the coffin to a motel room and had sex with it for several days before being caught by the police. The entire story collection deals with outsiders trying to find their place in the world and doing whatever they have to do achieve this end. The Two-Headed Man, for instance, features a man who removes his conjoined head and, therefore, either commits murder or suicide. A third story, 42 Million Miles Away involves a woman who, in a desperate need to be seen and known, exposes herself through the window of her apartment to the doctor in an apartment across the lane. This story was made into the film Arousal.     Similarly, Gowdys novel Mister Sandman revolves around the family of Joan, a young ": null
    },
    {
        "autistic": "autistic"
    },
    {
        " girl with a ": null
    },
    {
        "savant": "savant syndrome"
    },
    {
        " talent for playing ": null
    },
    {
        "classical music": "european classical music"
    },
    {
        " on the piano. Gowdys novel  The White Bone  is written from the perspective of ": null
    },
    {
        "African elephants": "african elephants"
    },
    {
        ". Subsequent novels  The Romantic  and Helpless deal with characters driven to extreme action by the force of their desires.         Gowdy has been nominated, repeatedly, for every major Canadian book prize, including the ": null
    },
    {
        "Giller Prize": "giller prize"
    },
    {
        " ; the ": null
    },
    {
        "Governor Generals Award": "governor generals award"
    },
    {
        " ; and the ": null
    },
    {
        "Rogers Writers Trust Fiction Prize": "rogers writers trust fiction prize"
    },
    {
        " .  The Romantic  was nominated for the ": null
    },
    {
        "Man Booker Prize": "man booker prize"
    },
    {
        ". Helpless won the ": null
    },
    {
        "Trillium Book Award": "trillium book award"
    },
    {
        ". All her books are bestsellers in Canada and Germany. ": null
    },
    {
        "Carol Shields": "carol shields"
    },
    {
        " claimed in  The Boston Globe  that Gowdy writes like an angel.  The Chicago Tribune  has called her a miraculous writer. And  The Globe and Mail  says, Gowdys is a peacemaking genius, unique in its talent for the translation of strangeness to second nature....     She was appointed a member of the ": null
    },
    {
        "Order of Canada": "order of canada"
    },
    {
        " effective 42 October 42  In 42 she won a ": null
    },
    {
        "John Simon Guggenheim Memorial Foundation": "john simon guggenheim memorial foundation"
    },
    {
        " Fellowship for her work.        In June 42 Gowdys 42 novel Helpless, which follows the stalking and kidnap of a nine-year-old girl, was abridged and adapted for ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        "s  Book at Bedtime . This resulted in several listeners complaining that the novel was dark, disturbing and had the life out of them. Commissioning editor Caroline Raphael defended the BBCs choice stating It is about a very difficult subject ... Unfortunately, writers do want to write about disturbing things she also added unhappy listeners could simply turn off .         Through the Green Valley    Falling Angels    We So Seldom Look On Love    Mister Sandman    The White Bone    The Romantic    Helpless    Little Sister ": null
    }
]