[
    {
        "Barcellona Pozzo di Gotto  is a town and  comune  of about 42  inhabitants in the north coast of ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ",  from ": null
    },
    {
        "Messina": "messina, italy"
    },
    {
        " towards ": null
    },
    {
        "Palermo": "palermo"
    },
    {
        ". It belongs to the ": null
    },
    {
        "Metropolitan City of Messina": "metropolitan city of messina"
    },
    {
        ".             In the area corresponding to the current municipal area were the following ancient settlements were identified:     Settlement and necropolis of the Bronze Age and Iron Age, in Maloto locality.   Settlement and necropolis, from around the 42th century BC, in Pizzo Lando.   Settlement and necropolis of ancient Greek or Hellenistic times, assigned to 42th century BC, in Oliveto locality.   Settlement and necropolis of ": null
    },
    {
        "Sicani": "sicani"
    },
    {
        "/Greek origins, dating from around the 42th and 42ht centuries BC, in SantOnofrio locality.     In 42 BC, the Battle of Longano between the army of ": null
    },
    {
        "Hiero II of Syracuse": "hiero ii of syracuse"
    },
    {
        " and the ": null
    },
    {
        "Mamertines": "mamertines"
    },
    {
        " under the command of the leader ": null
    },
    {
        "Cione": "cione"
    },
    {
        " took place in this area. The exact assignment of the place in the absence of identifiable cause remains earthquakes or floods or diversion of water courses, there are several hypotheses that place the event along the courses of the rivers bordering the Mela or Patrì , and other in the vicinity of the mythical city: Longane  or Abacena , however settlements related to the same conflict.               Barcellona Pozzo di Gotto lies in the plain that slopes to the north close to the lush hills and the chain of ": null
    },
    {
        "Peloritani": "peloritani"
    },
    {
        " mountains, overlooking the Gulf of ": null
    },
    {
        "Patti": "patti, sicily"
    },
    {
        " in the ": null
    },
    {
        "Tyrrhenian Sea": "tyrrhenian sea"
    },
    {
        " on the part near the ": null
    },
    {
        "Aeolian Islands": "aeolian islands"
    },
    {
        " in a portion of coast between the Milazzo peninsula to the east and to the west promontory of Tindari.     The most creditable hypothesis for the roots to its name lies in the domination of the ": null
    },
    {
        "Crown of Aragon": "crown of aragon"
    },
    {
        " and then in the five hundred year ": null
    },
    {
        "history of Spanish Sicily": "history of spanish sicily"
    },
    {
        " , flowing together with the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        " under the jurisdiction of the ": null
    },
    {
        "Crown of Spain": "crown of spain"
    },
    {
        ". The same analogy have identified the first conquerors from ": null
    },
    {
        "County of Aragon": "county of aragon"
    },
    {
        " and ": null
    },
    {
        "County of Barcelona": "county of barcelona"
    },
    {
        ".     The oldest part of the town, Pozzo di Gotto, owes its name to the digging of a well for irrigation in cultivated lands located between the rivers Idria and Longano, belonging to Nicholas Goto as described in ": null
    },
    {
        "Vulgar Latin": "vulgar latin"
    },
    {
        " in a document dated 42:  ... Nicolao de Gotho, ..., in quo Puzzo de Gotho ... . In 42 Pozzogottesi obtained from the Grand Court of the Archbishop of Messina permission to elect their chaplain stationed in ": null
    },
    {
        "Saint Vitus": "saint vitus"
    },
    {
        " no longer depend from Archpriest of Milazzo. Gained recognition, has advanced the redemption request to the Court of Madrid against the oppressive power of Milazzo under whose jurisdiction Pozzo di Gotto depended politically and physically by providing a distant hamlet, a bond that will be permanently discontinued 42 May 42 and ratified by royal decree Viceroy under the reign of ": null
    },
    {
        "Philip IV of Spain": "philip iv of spain"
    },
    {
        ", assumes the title Libera et Realis Civitas Putei de Gotho . The village in the west of the river Longano in turn under the jurisdiction of ": null
    },
    {
        "Castroreale": "castroreale"
    },
    {
        " and had already followed the example of the neighboring community, rebelling against the jurors ": null
    },
    {
        "castrensian": "castrensian"
    },
    {
        " doing in the Church to recognize its independence. Notarial deeds dating back to 42 in Castroreale report the name of the district or hamlet of Barsalona , a name likely to be attributed to the presence in the baptismal books of Pozzo di Gotto the name of Graziosa Barsalona , on the other hand is supported the thesis that the name of the location has been given by Iberian sailors having recognizing the remarkable similarity of the two territories.     The autonomy of the village of Barcellona was accepted by the ": null
    },
    {
        "Sicilian Parliament": "sicilian parliament"
    },
    {
        ", recognized by the King on 42 May 42 and ratified in ": null
    },
    {
        "Wien": "wien"
    },
    {
        " 42 February 42 by King ": null
    },
    {
        "Ferdinand I of the Two Sicilies": "ferdinand i of the two sicilies"
    },
    {
        ". The administrative union decreed 42 January 42 comes into force on 42 June 42 at the behest of King ": null
    },
    {
        "Ferdinand II of the Two Sicilies": "ferdinand ii of the two sicilies"
    },
    {
        ", deciding that the new municipality formed by the merger of the two ancient districts bore the full name of Barcellona Pozzo di Gotto. Are discarded by the King all the advanced options of names derived from the word Longano , receiving the unanimous appreciation, on the other hand the initial goodwill will turn into hatred and resentment towards the monarch as a result of criminal actions undertaken throughout the province, especially in Milazzo and Messina, which earned him the nickname of King Bomb . The city soon established covered a certain role with significant contributions to the definitive expulsion of the ": null
    },
    {
        "House of Bourbon": "house of bourbon"
    },
    {
        " from the province and the whole of Sicily and increasingly effective input in all the events included in the process of unification of constituting ": null
    },
    {
        "Kingdom of Italy": "kingdom of italy"
    },
    {
        ".         The procession of Varette which takes place on Friday, when for parade through the streets of the city at the same time two processions consist of twenty-six Vare depicting the mysteries of the Passion, Easter Rites included in the ": null
    },
    {
        "Santa Sumana": "santa sumana"
    },
    {
        " .       The thirteenth-century village of ": null
    },
    {
        "Castroreale": "castroreale"
    },
    {
        ", home to a tower from a medieval castle built by King ": null
    },
    {
        "Frederick II of Aragon": "frederick ii of aragon"
    },
    {
        ", is located nearby.       ": null
    },
    {
        "Giuseppa Bolognara Calcagno": "giuseppa bolognara calcagno"
    },
    {
        " , freedom fighter of the Risorgimento   ": null
    },
    {
        "Emilio Fede": "emilio fede"
    },
    {
        " , journalist   ": null
    },
    {
        "Carmelo Freni": "carmelo freni"
    },
    {
        " journalist, writer, director   ": null
    },
    {
        "Emilio Isgrò": "emilio isgrò"
    },
    {
        " , artist   ": null
    },
    {
        "Leonardo Vitale": "leonardo vitale"
    },
    {
        " , Mafia pentito ": null
    },
    {
        "Francesca Chillemi": "francesca chillemi"
    }
]