[
    {
        "   Baroque chess is a ": null
    },
    {
        "chess variant": "chess variant"
    },
    {
        " invented in 42 by ": null
    },
    {
        "Robert Abbott": "robert abbott"
    },
    {
        ". In 42 at the suggestion of his publisher, he changed the name to Ultima, by which name it is also known. Abbott later considered his invention flawed, and suggested amendments to the rules, but these suggestions have been substantially ignored by the gaming community, which continues to play by the 42 rules. Since the rules for Baroque were first laid down in 42 some regional variation has arisen, causing the game to diverge from Ultima.          Baroque chess is usually played on a standard 42×42 ": null
    },
    {
        "chessboard": "chessboard"
    },
    {
        " with the standard ": null
    },
    {
        "Staunton design": "staunton chess set"
    },
    {
        " of ": null
    },
    {
        "chess piece": "chess piece"
    },
    {
        "s. The rules that follow are widely found on the internet, but other variants exist. One variant was popular among students at ": null
    },
    {
        "Cambridge University": "cambridge university"
    },
    {
        " in 42 The initial setup of the pieces is the same as in standard chess, except for two things that the players must first decide on – center counter symmetry, and corner counter symmetry.       Center counter symmetry allows either player to decide whether to switch his king and Withdrawer around, and then corner counter symmetry requires each player to decide which of his rooks will be turned upside down. After these two kinds of symmetries are determined, White moves first.     For purposes of recording the moves that are played in the game, it is sufficient to employ an algebraic form of notation, as in ": null
    },
    {
        "chess": "chess"
    },
    {
        ", and write the names of the pieces and the squares they are to be placed in. For instance, 42 Kd42 & We42 Ke42 & Wd42 , and 42 Ia42 & Ch42 Ih42 & Ca42 .     If the symmetry resolution phases that are usually found at the start of the game could somehow be put off for later, then one may readily see how similar they are to the ": null
    },
    {
        "castling": "castling"
    },
    {
        " maneuvers in chess. They have the practical function of multiplying the number of games that are possible from the initial starting position.       In Baroque, the king is the one piece alone that is limited to moving exactly one square at a time; it moves and takes just like the ": null
    },
    {
        "king": "king"
    },
    {
        " in chess. All of the remaining pieces on the first rank may move like the ": null
    },
    {
        "queen": "queen"
    },
    {
        ", in all directions. They have this power as a matter of privilege, as they are all considered to be noble pieces. This is a kind of privilege that attaches to them at birth, that is, at the outset of the game, and is never diminished; they retain this privilege no matter where they go, except when they find themselves next to an Immobilizer .     The pawns, on the other hand, move just like the ": null
    },
    {
        "rook": "rook"
    },
    {
        " moves in chess, unable to move diagonally. Just as in chess, pawns are the peasants of this game. Unlike chess, pawns are never promoted to another kind of piece.       All the pieces except for the king capture differently from their counterparts in chess, and all but the king have different names. The king is the only piece that captures, as chess pieces do, by moving into a square that is occupied by an enemy piece. All the other pieces capture enemy pieces in more complex ways. Friendly pieces are never allowed to capture other friendly pieces.          The names of the pieces and rules for movement are as follows:     The king moves and captures like a standard chess ": null
    },
    {
        "king": "king"
    },
    {
        ". The objective of the game is to capture the opposing king. Fast play with a ": null
    },
    {
        "chess clock": "chess clock"
    },
    {
        " usually makes declaration of checkmate a very rare thing to achieve in actual face to face play.   The pawns  move like standard chess ": null
    },
    {
        "rooks": "rook"
    },
    {
        ". A pawn captures any opposing piece horizontally or vertically between the square to which the pawn moved and a friendly piece . This is considered a custodial form of capture because it has been likened to two men coming up on the sides of the person to be seized, and taking hold of his arms to carry him off. Pawns never capture diagonally, only horizontally or vertically. It also moves the same as the pawn in ": null
    },
    {
        "Hasami shogi": "hasami shogi"
    },
    {
        ".     The remaining pieces all move like standard chess queens, but have unique methods of capture.     The Withdrawer , represented by the queen, captures by moving directly away from an adjacent piece.   The Long-leapers, represented by the ": null
    },
    {
        "knights": "knight"
    },
    {
        ", capture by jumping over an opposing piece in a straight line. A long-leaper may make multiple captures in the same line as long as each piece is jumped independently. Those variants of Baroque prohibiting multiple leaps call this piece the Leaper, and restrict it to capturing the first enemy piece it encounters, provided the next space is empty or open. It appears that the choice between a Long-leaper and a Single-leaper tends to affect game play by encouraging hunkering down and overdefending pieces, and allowing pieces to spread across the board more, with less attention to bulky blockades. Coordinator, represented by the unmarked rook, captures any opposing piece that is on either of the two squares found at the intersection of its own file and the kings rank, and the intersection of the kings file and its own rank; these are found after the Coordinator has moved.   The Immobilizer , represented by the inverted rook, does not capture anything, but immobilizes all adjacent enemy pieces.   The Imitators , represented by the ": null
    },
    {
        "bishops": "bishop"
    },
    {
        ", capture any piece by moving as a piece of the type captured would have moved to capture. Also Imitators or Chameleons immobilize enemy Immobilizers to which they are adjacent. Imitators cannot capture Imitators. In order for an Imitator to capture an enemy king, it must begin its turn adjacent to it, and step into its square. This is because the king is the only piece on the board that steps one square at a time, and captures by occupation and replacement – stepping into the enemys square to capture it.     Diagrammed examples are indispensable to understanding the rules.          The white king moves Kc42-d42 delivering checkmate. Normally it would not be possible for the two kings to be adjacent, but here the black king is unable to move due to the white immobilizer on f42 thus the d42 square is not under attack by black, and the white king is not moving into check.     Note that White could not play Kc42-d42 as that would place his own king in check from the black Withdrawer. Capturing the Withdrawer with Kc42xd42 would result in stalemate, as black would then have no legal moves.             The white pawn  moves Pg42-d42 capturing the black Immobilizer and black pawn. The Pincer moves as the pawn in ": null
    },
    {
        "Hasami shogi": "hasami shogi"
    },
    {
        ". The black Withdrawer on e42 is not captured because pawns capture only vertically and horizontally, not diagonally. The black Imitator on d42 is not captured, because there is no white piece on d42 Finally, the black Long-leaper on g42 was safe because it moved between the two white pawns, rather than a white pawn moving to complete the custodial capture.             The white Withdrawer moves Wg42-d42 capturing the black pawn on h42 The pawn on g42 and the Imitator on h42 are unaffected because the Withdrawer did not move in their respective lines, but the Withdrawer could have captured either by a move in the g-file or sixth rank respectively. Note that the Withdrawer also gives check to the black king by threatening to move away on the d-file.             The white Long-Leaper moves Ld42-d42-d42-d42 capturing three black pieces. It might instead have captured the black Withdrawer with either Ld42-g42 or Ld42-h42 On the other hand, the black pawn on b42 and the black Chameleon on d42 are safe from the Long Leaper because there is no square on the opposite side on which the Long Leaper could land. Also the black pawns on f42 and g42 cannot be captured by Ld42-h42 because there is no space in between the two pawns which would allow the Long Leaper to make two separate jumps. A move of Ld42-b42 would be illegal because long leapers may not jump over friendly pieces. Some variations of Baroque forbid multi-leaping, if only because it is felt that the game is more playable if the Leaper is less powerful. By requiring the Leaper to stop its movement immediately after capturing the first piece, that objective is met.             The white Coordinator moves Cd42-f42 capturing blacks Leaper on c42 and Immobilizer on f42 If White had played Cd42-d42 instead, he would have captured blacks Leaper and pawn. The Coordinator threatens only pieces on the same rank or file as the friendly king. This kind of capture can be visualized by imagining an invisible cross emanating from the square the king is sitting on, and another invisible cross emanating from the square the Coordinator arrives at. The points where these two crosses intersect are the places where captures are possible.             The white Immobilizer moves If42-d42 immobilizing five black pieces. The black Leaper on g42 which had been immobilized, is now free to move again.     An Immobilizer can never be captured by an Immobilizer, or Imitator . An Immobilizer can never be captured by a king or Withdrawer unless the variation popular in ": null
    },
    {
        "Cambridge": "cambridge"
    },
    {
        " is being played, in which case the Immobilizer itself must first be immobilized. When an Immobilizer comes into contact with an enemy Chameleon or Immobilizer, the two pieces freeze each other, after which neither can move unless the other is captured. In the version played at Cambridge, the power of an enemy Immobilizer to arrest a friendly pieces movement is defeated when another friendly Immobilizer or Chameleon is brought up to it, effectively cancelling out each others power to arrest movement.     Some versions of Baroque allow an immobilized piece to commit suicide, i.e. be removed from the board, in lieu of the regular move of that player. There may be strategic reasons to open a line. For example, after the above diagrammed move, the black Leaper on c42 may wish to commit suicide, so that the other Leaper can capture the white Immobilizer by jumping over it on the fifth rank. White cannot hinder this plan, because the Immobilizer is itself immobilized by the black Chameleon.          On the adjacent diagram, the white Chameleon moves Xg42-e42-c42 capturing all seven black pieces except the king in one move and delivering check.   It captures the black withdrawer by moving away from it.   It captures the black long-leapers by jumping over them.   It captures three black pawns by surrounding them.   It captures the black coordinator by rank/file coordination with the white king.   It delivers check by moving adjacent to the black king.   In the Cambridge rules, this capture is not possible. The move is legal, but it captures only the two leapers, because the move is not a legal move for any of the other target pieces. In the absence of the two black leapers, the same move would capture the other five pieces.         Baroque played on a somewhat larger board that is mostly rectangular but for a couple extra squares that are outside the board, located at d42 and e42 just behind the king and queens squares. A matching pair of squares are also on the other side of the board, just beyond the black king and queen . Although one objective of the game is to capture the king, an alternative objective allows depositing a piece in the pair of squares on the other side of the board. Unlike Baroque, the king in Maxima moves like the knight in chess, making for a game with much more fluid movement of pieces.       Baroque that is similar to Maxima with additional pieces and rules.       As shogi is to chess, Renaissance is to Baroque—pieces may be revived and reborn. Renaissance is played on a 42×42 board with a Swapper that moves like a queen for all ordinary purposes, but for swapping actions must move like a king, trading places with any adjacent piece , never capturing it. Consistent with the concept of the Swapper being a piece wholly incapable of killing, it can also step into any adjacent empty square, and leave behind a previously captured piece resurrected by placing it in the square just vacated. Although, seen in that light, though the Swapper is like a piece of life, it can be transformed into a 42 square bomb when captured and readmitted to the board - but capable only of death. Instead of moving, a bomb need merely explode to effect the destruction of both friendly pieces and enemy pieces adjacent to itself, and suiciding in the process. The destruction of pieces in this way causes all affected to be unrevivable.     There are also two more pieces that, like the Coordinator, are not capable of unassisted capture: the Pusher and the Puller. They can move like queens for ordinary purposes, but for the purpose of exercising their special powers, they must be adjacent to the affected piece at the start of the turn. If they begin adjacent to a piece , they can push or pull it by 42 square. For a Pusher, the empty square on the other side must be open Although the Pushers and Pullers are not capable of capture, their pushing and pulling maneuvers can result in other pieces being forced to make captures, regardless of the captured one being a friendly or enemy piece.       Rococo is a species of Baroque that is played on a 42×42 board for the purposes of captures, but on the inner 42×42 square just inside it for the purpose of movement. To put it another way, the outer perimeter of squares can only be entered as a result of a capturing maneuver. In addition to the traditional Baroque pieces, Rococo has an Advancer piece that moves like a queen, but captures the enemy piece it has run up next to, stopping just short of the piece taken. As is usual for most pieces of the Baroque family, the Advancer will not enter into the space vacated by the captured piece, it merely runs up to it, and stops short by 42 square. Unlike the game of Renaissance described above, Rococo has a similarly named Swapper piece that moves like a queen, but trades places with the enemy it runs up to, a full queens move away. The Rococo Swapper has the unusual property of self-destructing at will, in lieu of moving, provided it is not at the same time immobilized, with the effect of taking one enemy piece alongside it. What sets Rococo apart from Baroque the most is the way the pawns work; they are called cannonball pawns and move like a king, stepping 42 square in all directions, or leap over any adjacent piece . The only way that they can effect capture is by leaping, and landing": null
    }
]