[
    {
        "                 Basketball is a ": null
    },
    {
        "team sport": "team sport"
    },
    {
        " in which two teams, most commonly of five players each, opposing one another on a rectangular ": null
    },
    {
        "court": "basketball court"
    },
    {
        ", compete with the primary objective of ": null
    },
    {
        "shoot": "shooting"
    },
    {
        "ing a ": null
    },
    {
        "basketball": "basketball"
    },
    {
        "  through the defenders hoop  while preventing the opposing team from shooting through their own hoop. A ": null
    },
    {
        "field goal": "field goal"
    },
    {
        " is worth two points, unless made from behind the ": null
    },
    {
        "three-point line": "3 point line"
    },
    {
        ", when it is worth three. After a foul, timed play stops and the player fouled or designated to shoot a technical foul is given one or more one-point ": null
    },
    {
        "free throw": "free throw"
    },
    {
        "s. The team with the most points at the end of the game wins, but if regulation play expires with the score tied, an additional period of play is mandated.     Players advance the ball by bouncing it while walking or running or by passing it to a teammate, both of which require considerable skill. On offense, players may use a variety of shots—the ": null
    },
    {
        "lay-up": "lay-up"
    },
    {
        ", the ": null
    },
    {
        "jump shot": "jump shot"
    },
    {
        ", or a ": null
    },
    {
        "dunk": "slam dunk"
    },
    {
        "; on defense, they may steal the ball from a dribbler, intercept passes, or ": null
    },
    {
        "block": "block"
    },
    {
        " shots; either offense or defense may collect a ": null
    },
    {
        "rebound": "rebound"
    },
    {
        ", that is, a missed shot that bounces from rim or backboard. It is a violation to ": null
    },
    {
        "lift or drag ones pivot foot without dribbling the ball": "traveling"
    },
    {
        ", to ": null
    },
    {
        "carry": "carrying"
    },
    {
        " it, or to ": null
    },
    {
        "hold the ball with both hands then resume dribbling": "double dribble"
    },
    {
        ".     The five players on each side at a time fall into five ": null
    },
    {
        "playing positions": "basketball position"
    },
    {
        ": the tallest player is usually the ": null
    },
    {
        "center": "center"
    },
    {
        ", the tallest and strongest is the ": null
    },
    {
        "power forward": "power forward"
    },
    {
        ", a slightly shorter but more agile big man is the ": null
    },
    {
        "small forward": "small forward"
    },
    {
        ", and the shortest players or the best ball handlers are the ": null
    },
    {
        "shooting guard": "shooting guard"
    },
    {
        " and the ": null
    },
    {
        "point guard": "point guard"
    },
    {
        ", who implements the coachs game plan by managing the execution of offensive and defensive plays . Informally, players may play three-on-three, two-on-two, and one-on-one.     Invented in 1891 by Canadian-American gym teacher ": null
    },
    {
        "James Naismith": "james naismith"
    },
    {
        " in ": null
    },
    {
        "Springfield, Massachusetts": "springfield, massachusetts"
    },
    {
        ", ": null
    },
    {
        "United States": "united states"
    },
    {
        ", basketball has evolved to become one of the worlds most popular and widely viewed sports.  The ": null
    },
    {
        "National Basketball Association": "national basketball association"
    },
    {
        " is the most significant ": null
    },
    {
        "professional basketball": "professional basketball"
    },
    {
        " league in the world in terms of popularity, salaries, talent, and level of competition.   Outside North America, the top clubs from national leagues qualify to continental championships such as the ": null
    },
    {
        "EuroLeague": "euroleague"
    },
    {
        " and the ": null
    },
    {
        "Basketball Champions League Americas": "basketball champions league americas"
    },
    {
        ". The ": null
    },
    {
        "FIBA Basketball World Cup": "fiba basketball world cup"
    },
    {
        " and ": null
    },
    {
        "Mens Olympic Basketball Tournament": "basketball at the summer olympicsmens tournaments"
    },
    {
        " are the major international events of the sport and attract top national teams from around the world. Each continent hosts regional competitions for national teams, like ": null
    },
    {
        "EuroBasket": "eurobasket"
    },
    {
        " and ": null
    },
    {
        "FIBA AmeriCup": "fiba americup"
    },
    {
        ".     The ": null
    },
    {
        "FIBA Womens Basketball World Cup": "fiba womens basketball world cup"
    },
    {
        " and ": null
    },
    {
        "Womens Olympic Basketball Tournament": "basketball at the summer olympicswomens tournaments"
    },
    {
        " feature top national teams from continental championships. The main North American league is the ": null
    },
    {
        "WNBA": "wnba"
    },
    {
        " , whereas strongest European clubs participate in the ": null
    },
    {
        "EuroLeague Women": "euroleague women"
    },
    {
        ".                    In early December 1891, ": null
    },
    {
        "Canadian": "canadians"
    },
    {
        " James Naismith": "james naismith"
    },
    {
        ",  a physical education professor and instructor at the International Young Mens Christian Association Training School    in ": null
    },
    {
        "Springfield": "springfield, massachusetts"
    },
    {
        ", ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ", was trying to keep his gym class active on a rainy day. He sought a vigorous indoor game to keep his students occupied and at proper levels of fitness during the long ": null
    },
    {
        "New England": "new england"
    },
    {
        " winters. After rejecting other ideas as either too rough or poorly suited to walled-in ": null
    },
    {
        "gymnasiums": "gymnasiums"
    },
    {
        ", he wrote the basic ": null
    },
    {
        "rules": "rules of basketball"
    },
    {
        " and nailed a ": null
    },
    {
        "peach": "peach"
    },
    {
        " basket onto a  elevated track. In contrast with modern basketball nets, this peach basket retained its bottom, and balls had to be retrieved manually after each basket or point scored; this proved inefficient, however, so the bottom of the basket was removed, allowing the balls to be poked out with a long ": null
    },
    {
        "dowel": "dowel"
    },
    {
        " each time.        Basketball was originally played with a ": null
    },
    {
        "soccer ball": "football"
    },
    {
        ". These round balls from ": null
    },
    {
        "association football": "association football"
    },
    {
        " were made, at the time, with a set of laces to close off the hole needed for inserting the inflatable bladder after the other sewn-together segments of the balls cover had been flipped outside-in.   These laces could cause bounce passes and dribbling to be unpredictable.  The description in this patent explains problems caused by lacing on the cover of basketballs. Eventually a lace-free ball construction method was invented, and this change to the game was endorsed by Naismith.  The first balls made specifically for basketball were brown, and it was only in the late 1950s that ": null
    },
    {
        "Tony Hinkle": "paul d.   tony   hinkle"
    },
    {
        ", searching for a ball that would be more visible to players and spectators alike, introduced the orange ball that is now in common use. Dribbling was not part of the original game except for the bounce pass to teammates. Passing the ball was the primary means of ball movement. Dribbling was eventually introduced but limited by the asymmetric shape of early balls. Dribbling was common by 1896, with a rule against the double dribble by 1898.      The peach baskets were used until 1906 when they were finally replaced by metal hoops with backboards. A further change was soon made, so the ball merely passed through. Whenever a person got the ball in the basket, his team would gain a point. Whichever team got the most points won the game.  The baskets were originally nailed to the mezzanine balcony of the playing court, but this proved impractical when spectators in the balcony began to interfere with shots. The backboard was introduced to prevent this interference; it had the additional effect of allowing rebound shots. Thinkquest, . Retrieved January 20, 2009. Naismiths handwritten diaries, discovered by his granddaughter in early 2006, indicate that he was nervous about the new game he had invented, which incorporated rules from a childrens game called ": null
    },
    {
        "duck on a rock": "duck on a rock"
    },
    {
        ", as many had failed before it.     Frank Mahan, one of the players from the original first game, approached Naismith after the Christmas break, in early 1892, asking him what he intended to call his new game. Naismith replied that he hadnt thought of it because he had been focused on just getting the game started. Mahan suggested that it be called Naismith ball , at which he laughed, saying that a name like that would kill any game. Mahan then said, Why not call it basketball? Naismith replied, We have a basket and a ball, and it seems to me that would be a good name for it.   The first official game was played in the ": null
    },
    {
        "YMCA gymnasium in Albany": "young mens christian association building"
    },
    {
        ", New York, on January 20, 1892, with nine players. The game ended at 1–0; the shot was made from , on a court just half the size of a present-day ": null
    },
    {
        "Streetball": "streetball"
    },
    {
        " or ": null
    },
    {
        "National Basketball Association": "national basketball association"
    },
    {
        " court.     At the time, football was being played with 10 to a team . When winter weather got too icy to play football, teams were taken indoors, and it was convenient to have them split in half and play basketball with five on each side. By 1897–1898 teams of five became standard.             Basketballs early adherents were dispatched to YMCAs throughout the United States, and it quickly spread through the United States and Canada. By 1895, it was well established at several womens high schools. While the YMCA was responsible for initially developing and spreading the game, within a decade it discouraged the new sport, as rough play and rowdy crowds began to detract from the YMCAs primary mission. However, other amateur sports clubs, colleges, and professional clubs quickly filled the void. In the years before ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the ": null
    },
    {
        "Amateur Athletic Union": "amateur athletic union"
    },
    {
        " and the ": null
    },
    {
        "Intercollegiate Athletic Association of the United States": "intercollegiate athletic association of the united states"
    },
    {
        "  vied for control over the rules for the game. The first pro league, the National Basketball League, was formed in 1898 to protect players from exploitation and to promote a less rough game. This league only lasted five years.     James Naismith was instrumental in establishing ": null
    },
    {
        "college basketball": "college basketball"
    },
    {
        ". His colleague C.O. Beamis fielded the first college basketball team just a year after the Springfield YMCA game at the suburban ": null
    },
    {
        "Pittsburgh": "pittsburgh"
    },
    {
        " Geneva College": "geneva college"
    },
    {
        ".  Naismith himself later coached at the ": null
    },
    {
        "University of Kansas": "kansas jayhawks mens basketball"
    },
    {
        " for six years, before handing the reins to renowned coach ": null
    },
    {
        "Forrest Phog Allen": "phog allen"
    },
    {
        ". Naismiths disciple ": null
    },
    {
        "Amos Alonzo Stagg": "amos alonzo stagg"
    },
    {
        " brought basketball to the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ", while ": null
    },
    {
        "Adolph Rupp": "adolph rupp"
    },
    {
        ", a student of Naismiths at Kansas, enjoyed great success as coach at the ": null
    },
    {
        "University of Kentucky": "kentucky wildcats mens basketball"
    },
    {
        ". On February 9, 1895, the first intercollegiate 5-on-5 game was played at ": null
    },
    {
        "Hamline University": "hamline university"
    },
    {
        " between Hamline and the School of Agriculture, which was affiliated with the ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        ".    The School of Agriculture won in a 9–3 game.     In 1901, colleges, including the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ", ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        ", ": null
    },
    {
        "Cornell University": "cornell university"
    },
    {
        ", ": null
    },
    {
        "Dartmouth College": "dartmouth college"
    },
    {
        ", the ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        ", the ": null
    },
    {
        "U.S. Naval Academy": "united states naval academy"
    },
    {
        ", the ": null
    },
    {
        "University of Colorado": "university of colorado boulder"
    },
    {
        " and ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        " began sponsoring mens games. In 1905, frequent injuries on the ": null
    },
    {
        "football": "college football"
    },
    {
        " field prompted ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " Theodore Roosevelt": "theodore roosevelt"
    },
    {
        " to suggest that colleges form a governing body, resulting in the creation of the Intercollegiate Athletic Association of the United States . In 1910, that body would change its name to the ": null
    },
    {
        "National Collegiate Athletic Association": "national collegiate athletic association"
    },
    {
        " . The first Canadian interuniversity basketball game was played at the ": null
    },
    {
        "YMCA": "ymca"
    },
    {
        " in ": null
    },
    {
        "Kingston": "kingston, ontario"
    },
    {
        ", Ontario on February 6, 1904, when ": null
    },
    {
        "McGill University": "mcgill university"
    },
    {
        "—Naismiths alma mater—visited ": null
    },
    {
        "Queens University": "queens university"
    },
    {
        ". McGill won 9–7 in overtime; the score was 7–7 at the end of regulation play, and a ten-minute overtime period settled the outcome. A good turnout of spectators watched the game.  Queens Journal , vol. 31, no. 7, February 16, 1904; 105 years of Canadian university basketball, by Earl Zukerman,      The first mens national championship tournament, the National Association of Intercollegiate Basketball tournament, which still exists as the ": null
    },
    {
        "National Association of Intercollegiate Athletics": "national association of intercollegiate athletics"
    },
    {
        " tournament": "naia national mens basketball championship"
    },
    {
        ", was organized in 1937. The first national championship for NCAA teams, the ": null
    },
    {
        "National Invitation Tournament": "national invitation tournament"
    },
    {
        " in New York, was organized in 1938; the ": null
    },
    {
        "NCAA national tournament": "ncaa division i mens basketball tournament"
    },
    {
        " would begin one year later. College basketball was rocked by gambling scandals from 1948 to ": null
    },
    {
        "1951": "ccny point shaving scandal"
    },
    {
        ", when dozens of players from top teams were implicated in ": null
    },
    {
        "match fixing": "match fixing"
    },
    {
        " and ": null
    },
    {
        "point shaving": "point shaving"
    },
    {
        ". Partially spurred by an association with cheating, the NIT lost support to the NCAA tournament.             Before widespread ": null
    },
    {
        "school district": "school district"
    },
    {
        " consolidation, most American high schools were far smaller than their present-day counterparts. During the first decades of the 20th century, basketball quickly became the ideal interscholastic sport due to its modest equipment and personnel requirements. In the days before widespread television coverage of professional and college sports, the popularity of high school basketball was unrivaled in many parts of America. Perhaps the most legendary of high school teams was Indianas ": null
    },
    {
        "Franklin Wonder Five": "franklin wonder five"
    },
    {
        ", which took the nation by storm during the 1920s, dominating Indiana basketball and earning national recognition.     Today virtually every high school in the United States fields a basketball team in ": null
    },
    {
        "varsity": "varsity team"
    },
    {
        " competition.  NFHS. Basketballs popularity remains high, both in rural areas where they carry the identification of the entire community, as well as at some larger schools known for their basketball teams where many players go on to participate at higher levels of competition after graduation. In the 2016–17 season, 980,673 boys and girls represented their schools in interscholastic basketball competition, according to the ": null
    },
    {
        "National Federation of State High School Associations": "national federation of state high school associations"
    },
    {
        ".  The states of ": null
    },
    {
        "Illinois": "illinois"
    },
    {
        ", ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        " and ": null
    },
    {
        "Kentucky": "kentucky"
    },
    {
        " are particularly well known for their residents devotion to high school basketball, commonly called ": null
    },
    {
        "Hoosier Hysteria": "hoosier hysteria"
    },
    {
        " in Indiana; the critically acclaimed film  Hoosiers  shows high school basketballs depth of meaning to these communities.     There is currently no tournament to determine a national high school champion. The most serious effort was the National Interscholastic Basketball Tournament at the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        " from 1917 to 1930. The event was organized by ": null
    },
    {
        "Amos Alonzo Stagg": "amos alonzo stagg"
    },
    {
        " and sent invitations to state champion teams. The tournament started out as a mostly Midwest affair but grew. In 1929 it had 29 state champions. Faced with opposition from the ": null
    },
    {
        "National Federation of State High School Associations": "national federation of state high school associations"
    },
    {
        " and ": null
    },
    {
        "North Central Association of Colleges and Schools": "north central association of colleges and schools"
    },
    {
        " that bore a threat of the schools losing their accreditation the last tournament was in 1930. The organizations said they were concerned that the tournament was being used to recruit professional players from the prep ranks.  The tournament did not invite minority schools or private/parochial schools.     The National Catholic Interscholastic Basketball Tournament ran from 1924 to 1941 at ": null
    },
    {
        "Loyola University": "loyola university chicago"
    },
    {
        ".  The National Catholic Invitational Basketball Tournament from 1954 to 1978 played at a series of venues, including ": null
    },
    {
        "Catholic University": "the catholic university of america"
    },
    {
        ", ": null
    },
    {
        "Georgetown": "georgetown university"
    },
    {
        " and ": null
    },
    {
        "George Mason": "george mason university"
    },
    {
        ".  The National Interscholastic Basketball Tournament for Black High Schools was held from 1929 to 1942 at ": null
    },
    {
        "Hampton Institute": "hampton university"
    },
    {
        ".  The National Invitational Interscholastic Basketball Tournament was held from 1941 to 1967 starting out at ": null
    },
    {
        "Tuskegee Institute": "tuskegee university"
    },
    {
        ". Following a pause during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " it resumed at ": null
    },
    {
        "Tennessee State College": "tennessee state university"
    },
    {
        " in Nashville. The basis for the champion dwindled after 1954 when  Brown v. Board of Education  began an integration of schools. The last tournaments were held at ": null
    },
    {
        "Alabama State College": "alabama state university"
    },
    {
        " from 1964 to 1967.           Teams abounded throughout the 1920s. There were hundreds of mens ": null
    },
    {
        "professional basketball": "professional basketball"
    },
    {
        " teams in towns and cities all over the United States, and little organization of the professional game. Players jumped from team to team and teams played in armories and smoky dance halls. Leagues came and went. ": null
    },
    {
        "Barnstorming": "barnstorm"
    },
    {
        " squads such as the ": null
    },
    {
        "Original Celtics": "original celtics"
    },
    {
        " and two all-African American teams, the ": null
    },
    {
        "New York Renaissance Five": "new york renaissance"
    },
    {
        " and the ": null
    },
    {
        "Harlem Globetrotters": "harlem globetrotters"
    },
    {
        " played up to two hundred games a year on their national tours.     In 1946, the ": null
    },
    {
        "Basketball Association of America": "basketball association of america"
    },
    {
        " was formed. The first game was played in ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        ", Ontario, Canada between the ": null
    },
    {
        "Toronto Huskies": "toronto huskies"
    },
    {
        " and ": null
    },
    {
        "New York Knickerbockers": "new york knicks"
    },
    {
        " on November 1, 1946. Three seasons later, in 1949, the BAA merged with the ": null
    },
    {
        "National Basketball League": "national basketball league"
    },
    {
        " to form the ": null
    },
    {
        "National Basketball Association": "national basketball association"
    },
    {
        " . By the 1950s, basketball had become a major college sport, thus paving the way for a growth of interest in professional basketball. In 1959, a ": null
    },
    {
        "basketball hall of fame": "naismith memorial basketball hall of fame"
    },
    {
        " was founded in ": null
    },
    {
        "Springfield": "springfield, massachusetts"
    },
    {
        ", Massachusetts, site of the first game. Its rosters include the names of great players, coaches, referees and people who have contributed significantly to the development of the game. The hall of fame has people who have accomplished many goals in their career in basketball. An upstart organization, the ": null
    },
    {
        "American Basketball Association": "american basketball association"
    },
    {
        ", emerged in 1967 and briefly threatened the NBAs dominance until the ": null
    },
    {
        "ABA-NBA merger": "aba-nba merger"
    },
    {
        " in 1976. Today the NBA is the top professional basketball league in the world in terms of popularity, salaries, talent, and level of competition.     The NBA has featured many famous players, including ": null
    },
    {
        "George Mikan": "george mikan"
    },
    {
        ", the first dominating big man ; ball-handling wizard ": null
    },
    {
        "Bob Cousy": "bob cousy"
    },
    {
        " and defensive genius ": null
    },
    {
        "Bill Russell": "bill russell"
    },
    {
        " of the ": null
    },
    {
        "Boston Celtics": "boston celtics"
    },
    {
        "; charismatic center ": null
    },
    {
        "Wilt Chamberlain": "wilt chamberlain"
    },
    {
        ", who originally played for the barnstorming ": null
    },
    {
        "Harlem Globetrotters": "harlem globetrotters"
    },
    {
        "; all-around stars ": null
    },
    {
        "Oscar Robertson": "oscar robertson"
    },
    {
        " and ": null
    },
    {
        "Jerry West": "jerry west"
    },
    {
        "; more recent big men ": null
    },
    {
        "Kareem Abdul-Jabbar": "kareem abdul-jabbar"
    },
    {
        ", ": null
    },
    {
        "Shaquille ONeal": "shaquille oneal"
    },
    {
        ", ": null
    },
    {
        "Hakeem Olajuwon": "hakeem olajuwon"
    },
    {
        " and ": null
    },
    {
        "Karl Malone": "karl malone"
    },
    {
        "; playmakers ": null
    },
    {
        "John Stockton": "john stockton"
    },
    {
        ", ": null
    },
    {
        "Isiah Thomas": "isiah thomas"
    },
    {
        " and ": null
    },
    {
        "Steve Nash": "steve nash"
    },
    {
        "; crowd-pleasing forwards ": null
    },
    {
        "Julius Erving": "julius erving"
    },
    {
        " and ": null
    },
    {
        "Charles Barkley": "charles barkley"
    },
    {
        "; European stars ": null
    },
    {
        "Dirk Nowitzki": "dirk nowitzki"
    },
    {
        ", ": null
    },
    {
        "Pau Gasol": "pau gasol"
    },
    {
        " and ": null
    },
    {
        "Tony Parker": "tony parker"
    },
    {
        "; more recent superstars ": null
    },
    {
        "LeBron James": "lebron james"
    },
    {
        ", ": null
    },
    {
        "Allen Iverson": "allen iverson"
    },
    {
        " and ": null
    },
    {
        "Kobe Bryant": "kobe bryant"
    },
    {
        "; and the three players who many credit with ushering the professional game to its highest level of popularity during the 1980s and 1990s: ": null
    },
    {
        "Larry Bird": "larry bird"
    },
    {
        ", ": null
    },
    {
        "Earvin Magic Johnson": "magic johnson"
    },
    {
        ", and ": null
    },
    {
        "Michael Jordan": "michael jordan"
    },
    {
        ".     In 2001, the NBA formed a developmental league, the ": null
    },
    {
        "National Basketball Development League": "national basketball development league"
    },
    {
        " . As of the 2018–19 season, the G League has 27 teams.             ": null
    },
    {
        "FIBA": "fiba"
    },
    {
        " was formed in 1932 by eight founding nations: Argentina, ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ", Greece, Italy, Latvia, Portugal, Romania and Switzerland. At this time, the organization only oversaw amateur players. Its acronym, derived from the French Fédération Internationale de Basket-ball Amateur, was thus FIBA . Mens basketball was first ": null
    },
    {
        "included": "basketball at the summer olympics"
    },
    {
        " at the Berlin ": null
    },
    {
        "1936 Summer Olympics": "1936 summer olympics"
    },
    {
        ", although a demonstration tournament was held in 1904. The United States defeated Canada in the first final, played outdoors. This competition has usually been dominated by the United States, whose team has won all but three titles. The first of these came in a controversial final game in ": null
    },
    {
        "Munich": "munich"
    },
    {
        " in ": null
    },
    {
        "1972": "basketball at the 1972 summer olympics"
    },
    {
        " against the Soviet Union, in which the ending of the game was replayed three times until the Soviet Union finally came out on top.  In 1950 the first FIBA World Championship for men, now known as the ": null
    },
    {
        "FIBA Basketball World Cup": "fiba basketball world cup"
    },
    {
        ", was held in Argentina. Three years later, the first FIBA World Championship for women, now known as the ": null
    },
    {
        "FIBA Womens Basketball World Cup": "fiba womens basketball world cup"
    },
    {
        ", was held in Chile. Womens basketball was added to the Olympics in 1976, which were held in ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        ", Quebec, Canada with teams such as the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", ": null
    },
    {
        "Brazil": "brazil womens national basketball team"
    },
    {
        " and ": null
    },
    {
        "Australia": "australia womens national basketball team"
    },
    {
        " rivaling the ": null
    },
    {
        "American": "united states womens national basketball team"
    },
    {
        " squads.     In 1989, ": null
    },
    {
        "FIBA": "fiba"
    },
    {
        " allowed professional NBA players to participate in the Olympics for the first time. Prior to the ": null
    },
    {
        "1992 Summer Olympics": "1992 summer olympics"
    },
    {
        ", only European and South American teams were allowed to field professionals in the Olympics. The United States dominance continued with the introduction of the original ": null
    },
    {
        "Dream Team": "1992 united states mens olympic basketball team"
    },
    {
        ". In the ": null
    },
    {
        "2004 Athens Olympics": "2004 summer olympics"
    },
    {
        ", the United States suffered its first Olympic loss while using professional players, falling to ": null
    },
    {
        "Puerto Rico": "puerto rico national basketball team"
    },
    {
        " and ": null
    },
    {
        "Lithuania": "lithuania mens national basketball team"
    },
    {
        " in group games, and being eliminated in the semifinals by ": null
    },
    {
        "Argentina": "argentina national basketball team"
    },
    {
        ". It eventually won the bronze medal defeating Lithuania, finishing behind Argentina and ": null
    },
    {
        "Italy": "italy national basketball team"
    },
    {
        ". The ": null
    },
    {
        "Redeem Team": "2008 united states mens olympic basketball team"
    },
    {
        ", won gold at the ": null
    },
    {
        "2008 Olympics": "basketball at the 2008 summer olympics"
    },
    {
        ", and the B-Team, won gold at the ": null
    },
    {
        "2010 FIBA World Championship": "2010 fiba world championship"
    },
    {
        " in Turkey despite featuring no players from the 2008 squad. The United States continued its dominance as they won gold at the ": null
    },
    {
        "2012 Olympics": "basketball at the 2012 summer olympics"
    },
    {
        ", ": null
    },
    {
        "2014 FIBA World Cup": "2014 fiba basketball world cup"
    },
    {
        " and the ": null
    },
    {
        "2016 Olympics": "basketball at the 2016 summer olympics"
    },
    {
        ".        Worldwide, basketball tournaments are held for boys and girls of all age levels. The global popularity of the sport is reflected in the nationalities represented in the NBA. Players from all six inhabited continents currently play in the NBA. Top international players began coming into the NBA in the mid-1990s, including Croatians ": null
    },
    {
        "Dražen Petrović": "dražen petrović"
    },
    {
        " and ": null
    },
    {
        "Toni Kukoč": "toni kukoč"
    },
    {
        ", Serbian ": null
    },
    {
        "Vlade Divac": "vlade divac"
    },
    {
        ", Lithuanians ": null
    },
    {
        "Arvydas Sabonis": "arvydas sabonis"
    },
    {
        " and ": null
    },
    {
        "Šarūnas Marčiulionis": "šarūnas marčiulionis"
    },
    {
        ", Dutchman ": null
    },
    {
        "Rik Smits": "rik smits"
    },
    {
        " and German ": null
    },
    {
        "Detlef Schrempf": "detlef schrempf"
    },
    {
        ".     In the Philippines, the ": null
    },
    {
        "Philippine Basketball Associations": "philippine basketball association"
    },
    {
        "first game was played on April 9, 1975 at the ": null
    },
    {
        "Araneta Coliseum": "araneta coliseum"
    },
    {
        " in ": null
    },
    {
        "Cubao": "cubao"
    },
    {
        ", ": null
    },
    {
        "Quezon City": "quezon city"
    },
    {
        ". Philippines. It was founded as a rebellion of several teams from the now-defunct Manila Industrial and Commercial Athletic Association, which was tightly controlled by the Basketball Association of the Philippines , the then-FIBA recognized national association. Nine teams from the MICAA participated in the leagues first season that opened on April 9, 1975. The ": null
    },
    {
        "NBL": "national basketball league australia"
    },
    {
        " is Australias pre-eminent mens professional basketball league. The league commenced in ": null
    },
    {
        "1979": "1979 nbl season"
    },
    {
        ", playing a winter season and did so until the completion of the 20th season in ": null
    },
    {
        "1998": "1998 nbl season"
    },
    {
        ". The ": null
    },
    {
        "1998–99": "1998–99 nbl season"
    },
    {
        " season, which commenced only months later, was the first season after the shift to the current summer season format . This shift was an attempt to avoid competing directly against ": null
    },
    {
        "Australias various football codes": "football in australia"
    },
    {
        ". It features 8 teams from around Australia and one in New Zealand. A few players including ": null
    },
    {
        "Luc Longley": "luc longley"
    },
    {
        ", ": null
    },
    {
        "Andrew Gaze": "andrew gaze"
    },
    {
        ", ": null
    },
    {
        "Shane Heal": "shane heal"
    },
    {
        ", ": null
    },
    {
        "Chris Anstey": "chris anstey"
    },
    {
        " and ": null
    },
    {
        "Andrew Bogut": "andrew bogut"
    },
    {
        " made it big internationally, becoming poster figures for the sport in Australia. The ": null
    },
    {
        "Womens National Basketball League": "womens national basketball league"
    },
    {
        " began in 1981.               Womens basketball began in 1892 at ": null
    },
    {
        "Smith College": "smith college"
    },
    {
        " when ": null
    },
    {
        "Senda Berenson": "senda berenson"
    },
    {
        ", a physical education teacher, modified Naismiths rules for women. Shortly after she was hired at Smith, she went to Naismith to learn more about the game.  Fascinated by the new sport and the values it could teach, she organized the first womens collegiate basketball game on March 21, 1893, when her Smith freshmen and sophomores played against one another.  However, the first womens interinstitutional game was played in 1892 between the ": null
    },
    {
        "University of California": "university of california, berkeley"
    },
    {
        " and Miss Heads School.  Berensons rules were first published in 1899, and two years later she became the editor of ": null
    },
    {
        "A. G. Spaldings": "spalding"
    },
    {
        "first Womens Basketball Guide. Berensons freshmen played the sophomore class in the first womens intercollegiate basketball game at ": null
    },
    {
        "Smith College": "smith college"
    },
    {
        ", March 21, 1893.  The same year, ": null
    },
    {
        "Mount Holyoke": "mount holyoke"
    },
    {
        " and ": null
    },
    {
        "Sophie Newcomb College": "sophie newcomb college"
    },
    {
        "  women began playing basketball. By 1895, the game had spread to colleges across the country, including ": null
    },
    {
        "Wellesley": "wellesley college"
    },
    {
        ", ": null
    },
    {
        "Vassar": "vassar college"
    },
    {
        ", and ": null
    },
    {
        "Bryn Mawr": "bryn mawr college"
    },
    {
        ". The first intercollegiate womens game was on April 4, 1896. ": null
    },
    {
        "Stanford": "stanford cardinal womens basketball"
    },
    {
        " women played ": null
    },
    {
        "Berkeley": "california golden bears womens basketball"
    },
    {
        ", 9-on-9, ending in a 2–1 Stanford victory.     Womens basketball development was more structured than that for men in the early years. In 1905, the Executive Committee on Basket Ball Rules was created by the ": null
    },
    {
        "American Physical Education Association": "american physical education association"
    },
    {
        ".  These rules called for six to nine players per team and 11 officials. The ": null
    },
    {
        "International Womens Sports Federation": "international womens sports federation"
    },
    {
        " included a womens basketball competition. 37 womens high school varsity basketball or state tournaments were held by 1925. And in 1926, the Amateur Athletic Union backed the first ": null
    },
    {
        "national womens basketball championship": "naia national womens basketball championship"
    },
    {
        ", complete with mens rules. The ": null
    },
    {
        "Edmonton Grads": "edmonton grads"
    },
    {
        ", a touring Canadian womens team based in ": null
    },
    {
        "Edmonton": "edmonton, alberta"
    },
    {
        ", Alberta, operated between 1915 and 1940. The Grads toured all over North America, and were exceptionally successful. They posted a record of 522 wins and only 20 losses over that span, as they met any team that wanted to challenge them, funding their tours from gate receipts.  The Grads also shone on several exhibition trips to Europe, and won four consecutive exhibition Olympics tournaments, in 1924, 1928, 1932, and 1936; however, womens basketball was not an official Olympic sport until 1976. The Grads players were unpaid, and had to remain single. The Grads style focused on team play, without overly emphasizing skills of individual players. The first womens ": null
    },
    {
        "AAU": "amateur athletic union"
    },
    {
        " All-America team was chosen in 1929. Womens industrial leagues sprang up throughout the United States, producing famous athletes, including ": null
    },
    {
        "Babe Didrikson": "babe zaharias"
    },
    {
        " of the ": null
    },
    {
        "Golden Cyclones": "golden cyclones"
    },
    {
        ", and the ": null
    },
    {
        "All American Red Heads Team": "all american red heads team"
    },
    {
        ", which competed against mens teams, using mens rules. By 1938, the womens national championship changed from a three-court game to ": null
    },
    {
        "two-court game with six players per team": "6 on 6 basketball"
    },
    {
        ".      The NBA-backed ": null
    },
    {
        "Womens National Basketball Association": "womens national basketball association"
    },
    {
        " began in 1997. Though it had shaky attendance figures, several marquee players  have helped the leagues popularity and level of competition. Other ": null
    },
    {
        "professional womens basketball": "womens professional sports"
    },
    {
        " leagues in the United States, such as the ": null
    },
    {
        "American Basketball League ": "american basketball league"
    },
    {
        ", have folded in part because of the popularity of the WNBA. The WNBA has been looked at by many as a niche league. However, the league has recently taken steps forward. In June 2007, the WNBA signed a contract extension with ": null
    },
    {
        "ESPN": "espn"
    },
    {
        ". The new television deal ran from 2009 to 2016. Along with this deal, came the first ever rights fees to be paid to a womens professional sports league. Over the eight years of the contract, millions and millions of dollars were dispersed to the leagues teams. In a March 12, 2009 article, ": null
    },
    {
        "NBA": "nba"
    },
    {
        " commissioner ": null
    },
    {
        "David Stern": "david stern"
    },
    {
        " said that in the bad economy, the NBA is far less profitable than the WNBA. Were losing a lot of money among a large number of teams. Were budgeting the WNBA to break even this year.  Television New Zealand ,                      Measurements and time limits discussed in this section often vary among tournaments and organizations; international and NBA rules are used in this section.     The object of the game is to outscore ones opponents by throwing the ball through the opponents basket from above while preventing the opponents from doing so on their own. An attempt to score in this way is called a shot. A successful shot is worth two points, or ": null
    },
    {
        "three points": "three-point field goal"
    },
    {
        " if it is taken from beyond the three-point arc  from the basket in international games and  in NBA games.  A one-point shot can be earned when shooting from the foul line after a foul is made.         Games are played in four quarters of 10   Rule 4, Section 8.1 Retrieved July 26, 2010 or 12 minutes .  Rule 5, Section II, a. Retrieved July 26, 2010. College mens games use two 20-minute halves,   Rule 5, Section 6, Article 1. Retrieved July 26, 2010. college womens games use 10-minute quarters,  and most United States high school varsity games use 8-minute quarters; however, this varies from state to state.  Rule 5, Section 5, Article 1  15 minutes are allowed for a half-time break under FIBA, NBA, and NCAA rules  Rule 5, Section II, c. Retrieved July 26, 2010.  Rule 4, Section 8.4 Retrieved July 26, 2010 and 10 minutes in United States high schools. ": null
    },
    {
        "Overtime": "overtime basketball"
    },
    {
        " periods are five minutes in length  Rule 5, Section II, b. Retrieved July 26, 2010.  Rule 4, Section 8.7 Retrieved July 26, 2010 except for high school, which is four minutes in length. Teams exchange baskets for the second half. The time allowed is actual playing time; the clock is stopped while the play is not active. Therefore, games generally take much longer to complete than the allotted game time, typically about two hours.     Five players from each team may be on the court at one time.  Rule 3, Section 4.2.2 Retrieved July 26, 2010  Rule 3, Section I, a. Retrieved July 26, 2010.   Rule 10, Section 2, Article 6. Retrieved July 26, 2010.  Rule 10, Section 1, Article 6 ": null
    },
    {
        "Substitutions": "substitution"
    },
    {
        " are unlimited but can only be done when play is stopped. Teams also have a coach, who oversees the development and strategies of the team, and other team personnel such as assistant coaches, managers, statisticians, doctors and trainers.     For both mens and womens teams, a standard uniform consists of a pair of shorts and a ": null
    },
    {
        "jersey": "jersey"
    },
    {
        " with a clearly visible number, unique within the team, printed on both the front and back. Players wear ": null
    },
    {
        "high-top": "high-top"
    },
    {
        " sneakers that provide extra ankle support. Typically, team names, players names and, outside of North America, sponsors are printed on the uniforms.     A limited number of time-outs, clock stoppages requested by a coach for a short meeting with the players, are allowed. They generally last no longer than one minute unless, for televised games, a commercial break is needed.     The game is controlled by the ": null
    },
    {
        "officials": "official"
    },
    {
        " consisting of the referee , one or two umpires and the table officials. For college, the NBA, and many high schools, there are a total of three referees on the court. The table officials are responsible for keeping track of each teams scoring, timekeeping, individual and team ": null
    },
    {
        "fouls": "personal foul"
    },
    {
        ", player substitutions, team ": null
    },
    {
        "possession arrow": "possession arrow"
    },
    {
        ", and the ": null
    },
    {
        "shot clock": "shot clock"
    },
    {
        ".                 The only essential equipment in a basketball game is the ball and the court: a flat, rectangular surface with baskets at opposite ends. Competitive levels require the use of more equipment such as clocks, score sheets, scoreboard, alternating possession arrows, and whistle-operated stop-clock systems.        A regulation ": null
    },
    {
        "basketball court": "basketball court"
    },
    {
        " in international games is  long and 49.2 feet wide. In the ": null
    },
    {
        "NBA": "nba"
    },
    {
        " and ": null
    },
    {
        "NCAA": "ncaa"
    },
    {
        " the court is . Most courts have ": null
    },
    {
        "wood flooring": "wood flooring"
    },
    {
        ", usually constructed from ": null
    },
    {
        "maple": "maple"
    },
    {
        " planks running in the same direction as the longer court dimension.   The name and logo of the home team is usually painted on or around the center circle.     The basket is a steel rim  diameter with an attached net affixed to a backboard that measures  and one basket is at each end of the court. The white outlined box on the backboard is  high and  wide. At almost all levels of competition, the top of the rim is exactly  above the court and  inside the baseline. While variation is possible in the dimensions of the court and backboard, it is considered important for the basket to be of the correct height – a rim that is off by just a few inches can have an adverse effect on shooting.     The size of the basketball is also regulated. For men, the official ball is  in circumference and weighs 22 oz . If women are playing, the official basketball size is  in circumference with a weight of 20 oz . In ": null
    },
    {
        "3x3": "3x3"
    },
    {
        ", a formalized version of the halfcourt 3-on-3 game, a dedicated ball with the circumference of a size 6 ball but the weight of a size 7 ball is used in all competitions .          The ball may be advanced toward the basket by being shot, passed between players, thrown, tapped, rolled or dribbled .     The ball must stay within the court; the last team to touch the ball before it travels out of bounds forfeits possession. The ball is out of bounds if it touches a boundary line, or touches any player or object that is out of bounds.     There are limits placed on the steps a player may take without dribbling, which commonly results in an infraction known as ": null
    },
    {
        "traveling": "traveling"
    },
    {
        ". Nor may a player stop his dribble and then resume dribbling. A dribble that touches both hands is considered stopping the dribble, giving this infraction the name ": null
    },
    {
        "double dribble": "double dribble"
    },
    {
        ". Within a dribble, the player cannot carry the ball by placing his hand on the bottom of the ball; doing so is known as ": null
    },
    {
        "carrying the ball": "carrying"
    },
    {
        ". A team, once having established ball control in the front half of their court, may not return the ball to the backcourt and be the first to touch it. A violation of these rules results in loss of possession.     The ball may not be kicked, nor be struck with the fist. For the offense, a violation of these rules results in loss of possession; for the defense, most leagues reset the shot clock and the offensive team is given possession of the ball out of bounds.     There are limits imposed on the time taken before progressing the ball past halfway , before attempting a shot , holding the ball while closely guarded , and remaining in the restricted area known as the free-throw lane,  . These rules are designed to promote more offense.     Basket interference, or goaltending is a violation charged when a player illegally interferes with a shot. This violation is incurred when a player touches the ball on its downward trajectory to the basket, unless it is obvious that the ball has no chance of entering the basket, if a player touches the ball while it is in the rim, or in the area extended upwards from the basket, or if a player reaches through the basket to interfere with the shot. When a defensive player is charged with goaltending, the basket is awarded. If an offensive player commits the infraction, the basket is cancelled. In either case possession of the ball is turned over to the defensive team.               An attempt to unfairly disadvantage an opponent through certain types of physical contact is illegal and is called a personal foul. These are most commonly committed by defensive players; however, they can be committed by offensive players as well. Players who are fouled either receive the ball to pass inbounds again, or receive one or more ": null
    },
    {
        "free throws": "free throw"
    },
    {
        "if they are fouled in the act of shooting, depending on whether the shot was successful. One point is awarded for making a free throw, which is attempted from a line  from the basket.     The referee is responsible for judging whether contact is illegal, sometimes resulting in controversy. The calling of fouls can vary between games, leagues and referees.     There is a second category of fouls called ": null
    },
    {
        "technical foul": "technical foul"
    },
    {
        "s, which may be charged for various rules violations including failure to properly record a player in the scorebook, or for unsportsmanlike conduct. These infractions result in one or two free throws, which may be taken by any of the five players on the court at the time. Repeated incidents can result in ": null
    },
    {
        "disqualification": "ejection"
    },
    {
        ". A blatant foul involving physical contact that is either excessive or unnecessary is called an intentional foul . In FIBA and NCAA womens basketball, a foul resulting in ejection is called a disqualifying foul, while in leagues other than the NBA, such a foul is referred to as flagrant.     If a team exceeds a certain limit of team fouls in a given period – four for NBA, NCAA womens, and international games – the opposing team is awarded one or two free throws on all subsequent non-shooting fouls for that period, the number depending on the league. In the US college mens game and high school games for both sexes, if a team reaches 7 fouls in a half, the opposing team is awarded one free throw, along with a second shot if the first is made. This is called shooting one-and-one . If a team exceeds 10 fouls in the half, the opposing team is awarded two free throws on all subsequent fouls for the half.     When a team shoots foul shots, the opponents may not interfere with the shooter, nor may they try to regain possession until the last or potentially last free throw is in the air.     After a team has committed a specified number of fouls, the other team is said to be in the bonus . On scoreboards, this is usually signified with an indicator light reading Bonus or Penalty with an illuminated directional arrow or dot indicating that team is to receive free throws when fouled by the opposing team.     If a team misses the first shot of a two-shot situation, the opposing team must wait for the completion of the second shot before attempting to reclaim possession of the ball and continuing play.     If a player is fouled while attempting a shot and the shot is unsuccessful, the player is awarded a number of free throws equal to the value of the attempted shot. A player fouled while attempting a regular two-point shot thus receives two shots, and a player fouled while attempting a three-point shot receives three shots.     If a player is fouled while attempting a shot and the shot is successful, typically the player will be awarded one additional free throw for one point. In combination with a regular shot, this is called a three-point play or four-point play because of the basket made at the time of the foul and the additional free throw .               Although the rules do not specify any positions whatsoever, they have evolved as part of basketball. During the early years of basketballs evolution, two guards, two forwards, and one center were used. In more recent times specific positions evolved, but the current trend, advocated by many top coaches including ": null
    },
    {
        "Mike Krzyzewski": "mike krzyzewski"
    },
    {
        " is towards positionless basketball, where big guys are free to shoot from outside and dribble if their skill allows it.  Popular descriptions of positions include:     ": null
    },
    {
        "Point guard": "point guard"
    },
    {
        "  : usually the fastest player on the team, organizes the teams offense by controlling the ball and making sure that it gets to the right player at the right time.     ": null
    },
    {
        "Shooting guard": "shooting guard"
    },
    {
        "  : creates a high volume of shots on offense, mainly long-ranged; and guards the opponents best perimeter player on defense.     ": null
    },
    {
        "Small forward": "small forward"
    },
    {
        "  : often primarily responsible for scoring points via cuts to the basket and dribble penetration; on defense seeks rebounds and steals, but sometimes plays more actively.     ": null
    },
    {
        "Power forward": "power forward"
    },
    {
        " : plays offensively often with their back to the basket; on defense, plays under the basket or against the opposing power forward .     ": null
    },
    {
        "Center": "center"
    },
    {
        " : uses height and size to score , to protect the basket closely , or to rebound.     The above descriptions are flexible. For most teams today, the shooting guard and small forward have very similar responsibilities and are often called the wings, as do the power forward and center, who are often called post players. While most teams describe two players as guards, two as forwards, and one as a center, on some occasions teams choose to call them by different designations.            There are two main defensive strategies: zone defense and man-to-man defense. In a ": null
    },
    {
        "zone defense": "zone defense"
    },
    {
        ", each player is assigned to guard a specific area of the court. Zone defenses often allow the defense to double team the ball, a manoeuver known as a trap. In a ": null
    },
    {
        "man-to-man defense": "man-to-man defense"
    },
    {
        ", each defensive player guards a specific opponent.     Offensive plays are more varied, normally involving planned passes and movement by players without the ball. A quick movement by an offensive player without the ball to gain an advantageous position is known as a cut. A legal attempt by an offensive player to stop an opponent from guarding a teammate, by standing in the defenders way such that the teammate cuts next to him, is a  screen  or pick. The two plays are combined in the  pick and roll , in which a player sets a pick and then rolls away from the pick towards the basket. Screens and cuts are very important in offensive plays; these allow the quick passes and teamwork, which can lead to a successful basket. Teams almost always have several offensive plays planned to ensure their movement is not predictable. On court, the point guard is usually responsible for indicating which play will occur.            Shooting is the act of attempting to score points by throwing the ball through the basket, methods varying with players and situations.     Typically, a player faces the basket with both feet facing the basket. A player will rest the ball on the fingertips of the dominant hand slightly above the head, with the other hand supporting the side of the ball. The ball is usually shot by jumping and extending the shooting arm. The shooting arm, fully extended with the wrist fully bent, is held stationary for a moment following the release of the ball, known as a follow-through. Players often try to put a steady backspin on the ball to absorb its impact with the rim. The ideal trajectory of the shot is somewhat controversial, but generally a proper arc is recommended. Players may shoot directly into the basket or may use the backboard to redirect the ball into the basket.          The two most common shots that use the above described setup are the  set shot  and the  jump shot . The set shot is taken from a standing position, with neither foot leaving the floor, typically used for free throws, and in other circumstances while the jump shot is taken in mid-air, the ball released near the top of the jump. This provides much greater power and range, and it also allows the player to elevate over the defender. Failure to release the ball before the feet return to the floor is considered a traveling violation.     Another common shot is called the  lay-up . This shot requires the player to be in motion toward the basket, and to lay the ball up and into the basket, typically off the backboard . The most crowd-pleasing and typically highest-percentage accuracy shot is the  slam dunk , in which the player jumps very high and throws the ball downward, through the basket while touching it.          Another shot that is becoming common is the circus shot . The circus shot is a low-percentage shot that is flipped, heaved, scooped, or flung toward the hoop while the shooter is off-balance, airborne, falling down, and/or facing away from the basket. A back-shot is a shot taken when the player is facing away from the basket, and may be shot with the dominant hand, or both; but there is a very low chance that the shot will be successful.     A shot that misses both the rim and the backboard completely is referred to as an  air ball . A particularly bad shot, or one that only hits the backboard, is jocularly called a ": null
    },
    {
        "brick": "brick"
    },
    {
        ". The hang time is the length of time a player stays in the air after jumping, either to make a slam dunk, lay-up or jump shot.               The objective of rebounding is to successfully gain possession of the basketball after a missed field goal or free throw, as it rebounds from the hoop or backboard. This plays a major role in the game, as most possessions end when a team misses a shot. There are two categories of rebounds: offensive rebounds, in which the ball is recovered by the offensive side and does not change possession, and defensive rebounds, in which the defending team gains possession of the loose ball. The majority of rebounds are defensive, as the team on defense tends to be in better position to recover missed shots.             A pass is a method of moving the ball between players. Most passes are accompanied by a step forward to increase power and are followed through with the hands to ensure accuracy.     A staple pass is the chest pass. The ball is passed directly from the passers chest to the receivers chest. A proper chest pass involves an outward snap of the thumbs to add velocity and leaves the defence little time to react.     Another type of pass is the bounce pass. Here, the passer bounces the ball crisply about two-thirds of the way from his own chest to the receiver. The ball strikes the court and bounces up toward the receiver. The bounce pass takes longer to complete than the chest pass, but it is also harder for the opposing team to intercept . Thus, players often use the bounce pass in crowded moments, or to pass around a defender.     The overhead pass is used to pass the ball over a defender. The ball is released while over the passers head.     The outlet pass occurs after a team gets a defensive rebound. The next pass after the rebound is the outlet pass.     The crucial aspect of any good pass is it being difficult to intercept. Good passers can pass the ball with great accuracy and they know exactly where each of their other teammates prefers to receive the ball. A special way of doing this is passing the ball without looking at the receiving teammate. This is called a no-look pass.     Another advanced style of passing is the behind-the-back pass, which, as the description implies, involves throwing the ball behind the passers back to a teammate. Although some players can perform such a pass effectively, many coaches discourage no-look or behind-the-back passes, believing them to be difficult to control and more likely to result in turnovers or violations.                Dribbling is the act of bouncing the ball continuously with one hand and is a requirement for a player to take steps with the ball. To dribble, a player pushes the ball down towards the ground with the fingertips rather than patting it; this ensures greater control.     When dribbling past an opponent, the dribbler should dribble with the hand farthest from the opponent, making it more difficult for the defensive player to get to the ball. It is therefore important for a player to be able to dribble competently with both hands.     Good dribblers tend to bounce the ball low to the ground, reducing the distance of travel of the ball from the floor to the hand, making it more difficult for the defender to steal the ball. Good ball handlers frequently dribble behind their backs, between their legs, and switch directions suddenly, making a less predictable dribbling pattern that is more difficult to defend against. This is called a crossover, which is the most effective way to move past defenders while dribbling.     A skilled player can dribble without watching the ball, using the dribbling motion or ": null
    },
    {
        "peripheral vision": "peripheral vision"
    },
    {
        " to keep track of the balls location. By not having to focus on the ball, a player can look for teammates or scoring opportunities, as well as avoid the danger of having someone steal the ball away from him/her.          A block is performed when, after a shot is attempted, a defender succeeds in altering the shot by touching the ball. In almost all variants of play, it is illegal to touch the ball after it is in the downward path of its arc; this is known as  goaltending . It is also illegal under NBA and Mens NCAA basketball to block a shot after it has touched the backboard, or when any part of the ball is directly above the rim. Under international rules it is illegal to block a shot that is in the downward path of its arc or one that has touched the backboard until the ball has hit the rim. After the ball hits the rim, it is again legal to touch it even though it is no longer considered as a block performed.     To block a shot, a player has to be able to reach a point higher than where the shot is released. Thus, height can be an advantage in blocking. Players who are taller and playing the power forward or center positions generally record more blocks than players who are shorter and playing the guard positions. However, with good timing and a sufficiently high vertical leap, even shorter players can be effective shot blockers.       At the professional level, most male players are above  and most women above . Guards, for whom physical coordination and ball-handling skills are crucial, tend to be the smallest players. Almost all forwards in the top mens pro leagues are  or taller. Most centers are over  tall. According to a survey given to all NBA teams, the average height of all NBA players is just under , with the average weight being close to . The tallest players ever in the NBA were ": null
    },
    {
        "Manute Bol": "manute bol"
    },
    {
        " and ": null
    },
    {
        "Gheorghe Mureșan": "gheorghe mureșan"
    },
    {
        ", who were both  tall. At , ": null
    },
    {
        "Margo Dydek": "margo dydek"
    },
    {
        " was the tallest player in the history of the WNBA.     The shortest player ever to play in the NBA is ": null
    },
    {
        "Muggsy Bogues": "muggsy bogues"
    },
    {
        " at .  Other short players have thrived at the pro level. ": null
    },
    {
        "Anthony Spud Webb": "spud webb"
    },
    {
        " was just  tall, but had a  vertical leap, giving him significant height when jumping. While shorter players are often at a disadvantage in certain aspects of the game, their ability to navigate quickly through crowded areas of the court and steal the ball by reaching low are strengths.     Players regularly inflate their height. Many prospects exaggerate their height while in high school or college to make themselves more appealing to coaches and scouts, who prefer taller players. Charles Barkley stated; Ive been measured at 6-5, 6-4 . But I started in college at 6-6. Sam Smith, a former writer from  The Chicago Tribune , said: We sort of know the heights, because after camp, the sheet comes out. But you use that height, and the player gets mad. And then you hear from his agent. Or you file your story with the right height, and the copy desk changes it because they have the official N.B.A. media guide, which is wrong. So you sort of go along with the joke.  In the NBA, there is no standard on whether a players listed height uses their measurement with shoes on or without. The ": null
    },
    {
        "NBA Draft Combine": "nba draft combine"
    },
    {
        ", which most players attend before the draft, provides both measurements. Thereafter, a players team is solely responsible for their listed height, which can vary depending on the process selected.       Notable players who overstated their height include:   ": null
    },
    {
        "Kobe Bryant": "kobe bryant"
    },
    {
        " whose listed height is , while his actual height is     ": null
    },
    {
        "Charles Barkley": "charles barkley"
    },
    {
        " whose listed height is , while his actual height is just under    ": null
    },
    {
        "Kevin Love": "kevin love"
    },
    {
        " whose listed height is , while his actual height is just under     ": null
    },
    {
        "Jason Collins": "jason collins"
    },
    {
        " whose listed height is , while his actual height is     ": null
    },
    {
        "Dwight Howard": "dwight howard"
    },
    {
        " whose listed height is , while his actual height is     On rare occasions, some players will understate their actual heights, not to be repositioned. One example is ": null
    },
    {
        "Kevin Durant": "kevin durant"
    },
    {
        ", whose listed height is , while his actual height is . Durants reasoning was, Really, thats the prototypical size for a ": null
    },
    {
        "small forward": "small forward"
    },
    {
        ". Anything taller than that, and theyll start saying, Ah, hes a ": null
    },
    {
        "power forward": "power forward"
    },
    {
        ".                 Variations of basketball are activities based on the game of basketball, using common basketball skills and equipment . Some variations are only superficial rules changes, while others are distinct games with varying degrees of basketball influences. Other variations include childrens games, contests or activities meant to help players reinforce skills.     There are principal basketball sports with variations on basketball including ": null
    },
    {
        "Wheelchair basketball": "wheelchair basketball"
    },
    {
        ", ": null
    },
    {
        "Water basketball": "water basketball"
    },
    {
        ", ": null
    },
    {
        "Beach basketball": "beach basketball"
    },
    {
        ", ": null
    },
    {
        "Slamball": "slamball"
    },
    {
        ", ": null
    },
    {
        "Streetball": "streetball"
    },
    {
        " and ": null
    },
    {
        "Unicycle": "unicycle"
    },
    {
        " basketball. An earlier version of basketball, played primarily by women and girls, was ": null
    },
    {
        "Six-on-six basketball": "six-on-six basketball"
    },
    {
        ". ": null
    },
    {
        "Horseball": "horseball"
    },
    {
        " is a game played on horseback where a ball is handled and points are scored by shooting it through a high net . The sport is like a combination of ": null
    },
    {
        "polo": "polo"
    },
    {
        ", ": null
    },
    {
        "rugby": "rugby football"
    },
    {
        ", and basketball. There is even a form played on donkeys known as ": null
    },
    {
        "Donkey basketball": "donkey basketball"
    },
    {
        ", but that version has come under attack from animal rights groups.            Perhaps the single most common variation of basketball is the half-court game, played in informal settings without referees or strict rules. Only one basket is used, and the ball must be taken back or cleared – passed or dribbled outside the three-point line each time possession of the ball changes from one team to the other. Half-court games require less ": null
    },
    {
        "cardiovascular": "cardiovascular"
    },
    {
        " stamina, since players need not run back and forth a full court. Half-court raises the number of players that can use a court or, conversely, can be played if there is an insufficient number to form full 5-on-5 teams.     Half-court basketball is usually played 1-on-1, 2-on-2 or 3-on-3. The latter variation is gradually gaining official recognition as ": null
    },
    {
        "3x3": "3x3"
    },
    {
        ", originally known as FIBA 33. It was first tested at the ": null
    },
    {
        "2007 Asian Indoor Games": "2007 asian indoor games"
    },
    {
        " in ": null
    },
    {
        "Macau": "macau"
    },
    {
        " and the first official tournaments were held at the ": null
    },
    {
        "2009 Asian Youth Games": "2009 asian youth games"
    },
    {
        " and the ": null
    },
    {
        "2010 Youth Olympics": "2010 youth olympics"
    },
    {
        ", both in Singapore. The first FIBA 3x3 Youth World Championships  were held in ": null
    },
    {
        "Rimini": "rimini"
    },
    {
        ", Italy in ": null
    },
    {
        "2011": "2011 fiba 3x3 youth world championships"
    },
    {
        ", with the first ": null
    },
    {
        "FIBA 3x3 World Championships": "fiba 3x3 world championships"
    },
    {
        " for senior teams following ": null
    },
    {
        "a year later": "2012 fiba 3x3 world championships"
    },
    {
        " in ": null
    },
    {
        "Athens": "athens"
    },
    {
        ". The sport is highly tipped to become an ": null
    },
    {
        "Olympic sport": "olympic sport"
    },
    {
        " as early as ": null
    },
    {
        "2016": "2016 summer olympics"
    },
    {
        ".  In the summer of 2017, the ": null
    },
    {
        "BIG3": "big3"
    },
    {
        " basketball league, a professional 3x3 half court basketball league that features former NBA players, began. The BIG3 features several rule variants including a ": null
    },
    {
        "four-point field goal": "four-point field goal"
    },
    {
        ".          There are also other basketball sports, such as:       21         42   Around the world   Bounce   Firing Squad   Fives   H-O-R-S-E  Hotshot |Hotshot    Knockout   One-shot conquer   Steal The Bacon   Tip-it   Tips   The One   Basketball War .    One-on-One - It is a variation in which two players will use only a small section of the court and compete to play the ball into a single hoop. Such games tend to emphasize individual dribbling and ball stealing skills over shooting and team play.    Water basketball  - Water basketball, played in a swimming pool, merges basketball and ": null
    },
    {
        "water polo": "water polo"
    },
    {
        " rules.    Beach basketball  - A modified version of basketball, played on beaches, was invented by Philip Bryant.  Beach basketball is played in a circular court with no backboard on the goal, no out-of-bounds rule with the ball movement to be done via passes or 2 steps, as dribbling is next to impossible on a soft surface.  Beachbasketball.com web site Beach basketball has grown to a very popular, widespread competitive sport. 15 Annual World Championships have been organized.   Dunk Hoops - Dunk Hoops is a variation of the game of basketball, played on basketball hoops with lowered rims. It originated when the popularity of the slam dunk grew and was developed to create better chances for dunks with lowered rims and using altered ": null
    },
    {
        "goaltending": "goaltending"
    },
    {
        " rules.    Slamball  - Slamball is full-contact basketball, with ": null
    },
    {
        "trampolines": "trampolines"
    },
    {
        ". Points are scored by playing the ball through the net, as in basketball, though the point-scoring rules are modified. The main differences from the parent sport is the court; below the padded basketball rim and ": null
    },
    {
        "backboard": "backboard"
    },
    {
        " are four trampolines set into the floor, which serve to propel players to great heights for ": null
    },
    {
        "slam dunk": "slam dunk"
    },
    {
        "s. The rules also permit some physical contact between the members of the four-player teams.    Streetball  - Streetball is a less formal variant of basketball, played on ": null
    },
    {
        "playgrounds": "playground"
    },
    {
        "and in gymnasiums across the world. Often only one half of the court is used, but otherwise, the rules of the game are very similar to those of basketball. The number of participants in a game, or a run, may range from one defender and one person on offense  to two full teams of five each. Streetball is a very popular game worldwide, and some cities in the United States have organized streetball programs, such as ": null
    },
    {
        "midnight basketball": "midnight basketball"
    },
    {
        ". Many cities also host their own weekend-long streetball tournaments.   Unicycle basketball - Unicycle basketball is played using a regulation basketball on a regular basketball court with the same rules, for example, one must dribble the ball while riding. There are a number of rules that are particular to unicycle basketball as well, for example, a player must have at least one foot on a pedal when in-bounding the ball. Unicycle basketball is usually played using 24 or smaller unicycles, and using plastic pedals, both to preserve the court and the players shins. In North America, popular unicycle basketball games are organized.      ": null
    },
    {
        "Spin-offs from basketball": "variations of basketballmore distantly related games"
    },
    {
        " that are now separate sports include:    Ringball , a traditional South African sport that stems from basketball, has been played since 1907. The sport is now promoted in South Africa, Namibia, Botswana, Lesotho, India, and Mauritius to establish Ringball as an international sport.    Korfball   started in the Netherlands and is now played worldwide as a mixed gender team ball game, similar to mixed netball and basketball    Netball  , a limited-contact team sport in which two teams of seven try to score points against one another by placing a ball through a high hoop. Australia New Zealand champions is very famous in Australia and New Zealand as the premier netball league.          Basketball has been adopted by various social groups, which have established their own environments and sometimes their own rules. Such socialized forms of basketball include the following.       Basketball is played widely casually in schools and colleges where fun, entertainment and camaraderie rule rather than winning a game.     Basketball Schools and Academies, where students are trained in developing basketball fundamentals, undergo fitness and endurance exercises and learn various basketball skills. Basketball students learn proper ways of passing, ball handling, dribbling, shooting from various distances, rebounding, offensive moves, defense, ": null
    },
    {
        "layup": "layup"
    },
    {
        "s, screens, basketball rules and basketball ethics. Also popular are the basketball camps organized for various occasions, often to get prepared for basketball events, and basketball clinics for improving skills.   College and University basketball played in educational institutions of higher learning. This includes ": null
    },
    {
        "National Collegiate Athletic Association": "national collegiate athletic association"
    },
    {
        " intercollegiate basketball.       Disabled basketball is played by various disabled groups, such as the deaf and physically crippled people.      Deaf basketball - One of several deaf sports, deaf basketball relies on signing for communication. Any deaf sporting event that happens, its purpose is to serve as a catalyst for the socialization of a low-incidence and geographically dispersed population.     Wheelchair basketball - A sport based on basketball but designed for ": null
    },
    {
        "disabled": "disability"
    },
    {
        " people in ": null
    },
    {
        "wheelchairs": "wheelchair"
    },
    {
        "and considered one of the major ": null
    },
    {
        "disabled sports": "disabled sports"
    },
    {
        " practiced.There is a functional classification system that is used to help determine if the wheelchair basketball player classification system reflects the existing differences in the performance of elite female players. what this system does is it gives an analysis of the players functional resources through field-testing and game observation. During this systems process, players are assigned a score of 1 to 4.5.        Examples of ethnic basketball include Indo-Pak or Russian or Armenian leagues in the United States or Canada, for example, or Filipino expatriate basketball leagues in the Gulf or the United States. Religion-based basketball includes, most notably, church-related Christian basketball leagues, Jewish, Muslim and Hindu basketball leagues, and so on. or denominational leagues like Coptic, Syriac/Assyrian basketball leagues in the United States or Canada.       Prison basketball is practiced in prisons and penitentiary institutions. Active religious basketball missionary groups also play basketball with prisoners. Some prisons have developed their own prison basketball leagues. At times, non-prisoners may play in such leagues, provided all home and away games are played within prison courts. Film director Jason Moriarty has released a documentary relating to the sport, entitled  Prison Ball . Prison systems in the United States makes about $74 billion a year. The reason why prisons make so much money in a year is the fact that over 2.3 million Americans are currently incarcerated. It all started in 1972, the number of people in the United States prison has increased over 700% and now charges the taxpayer $39 billion to maintain every year. US population is only a little smaller than countries like Iceland, Estonia and Cyprus combined, so it was not a surprise that the US penal system has developed its own type of subculture. There is a lot of people that when they hear correctional facility think about men behind bars and playing card and lifting weights in the yard. Thats almost correct but most people dont know that there is a wide range of athletic opportunities available in todays penitentiaries. Prison leagues are becoming the best way and most popular way inmates spend their time. For younger offenders, basketball is a good way to get their lives back on track, but for long term prisoners, these basketball leagues are a great way for them to get away from all their daily problems. Some prison leagues sometimes get blessed with their own celebrities. Pee Wee Kirkland who was drafted by the Chicago Bulls, but turned it down because he was making way more money in the drug world. Eventually caught up and arrested, he then found himself playing in the Anthracite Basketball League, representing Lewis-burgh penitentiary. Also, another celebrity Michael Vick used the football prison league to stay in shape. Some other big names that played in prison basketball leagues are Allen Iverson, JR Smith and Plaxico Burress, for some prison leagues can be a valuable training ground.        Show basketball is performed by entertainment basketball show teams, the prime example being the ": null
    },
    {
        "Harlem Globetrotters": "harlem globetrotters"
    },
    {
        ". There are even specialized entertainment teams, such as teams of celebrities, people with short heights and others.     Celebrity basketball teams made of celebrities playing in their own leagues or in public, often for entertainment and charity events;   Midget basketball teams made up of athletes of ": null
    },
    {
        "short stature": "short stature"
    },
    {
        " offering shows using basketball;   Slamball offered as entertainment events. Slamball is a very intense form of basketball game actually it is an elevated game of basketball that is infused with football tactics and involves bouncing of a trampolines.  This game is very popular in places like Europe and Australia, this intense game is full of contact just like football the trampolines are embedded in the floor around the baskets. The objective of the game is just like any sport you have to score points by getting the ball into the basket, this is mostly done by the player using the trampoline to go fly high in the air to come down with slam dunk. Not only do they use tactics from football but they also do the same style of substitution as hockey well you can say its very similar. The potions of slamball are stopper, gunner and handler. The stopper is the defender and is in control of the whole defensive plan. The handler is basically the point guard of the game, their in control of setting plays on the offensive end and helps a little on defensive end as well. The last position the gunner is the one that does most of the scoring and all also helps out on the defensive end.          Gay basketball played in ": null
    },
    {
        "LGBTQIA+": "lgbt"
    },
    {
        " communities in gay basketball leagues. The sport of basketball is a major part of events during the ": null
    },
    {
        "Gay Games": "gay games"
    },
    {
        ", ": null
    },
    {
        "World Outgames": "world outgames"
    },
    {
        " and ": null
    },
    {
        "EuroGames": "eurogames"
    },
    {
        ".    Midnight basketball , a basketball initiative to curb inner-city crime in the United States and elsewhere by keeping urban youth off the streets and engaging them with sports alternatives to drugs and crime.   Mini basketball played by underage children.   Maxi Basketball played by more elderly individuals.    Rezball , short for reservation ball, is the avid ": null
    },
    {
        "Native American": "native americans in the united states"
    },
    {
        " following of basketball, particularly a style of play particular to Native American teams of some areas.   School or High school basketball, the sport of basketball being one of the most frequently exercised and popular sports in all school systems.          Fantasy basketball was popularized during the 1990s after the advent of the Internet. Those who play this game are sometimes referred to as General Managers, who draft actual ": null
    },
    {
        "NBA": "national basketball association"
    },
    {
        " players and compute their ": null
    },
    {
        "basketball statistics": "basketball statistics"
    },
    {
        ". The game was popularized by ": null
    },
    {
        "ESPN": "espn"
    },
    {
        " Fantasy Sports, ": null
    },
    {
        "NBA.com": "nba.com"
    },
    {
        ", and ": null
    },
    {
        "Yahoo!": "yahoo!"
    }
]