[
    {
        "           Bassas da India  is an uninhabited, roughly circular French ": null
    },
    {
        "atoll": "atoll"
    },
    {
        " that is part of the ": null
    },
    {
        "French Southern and Antarctic Lands": "french southern and antarctic lands"
    },
    {
        ". Located in the southern ": null
    },
    {
        "Mozambique Channel": "mozambique channel"
    },
    {
        ", about halfway between ": null
    },
    {
        "Mozambique": "mozambique"
    },
    {
        " and ": null
    },
    {
        "Madagascar": "madagascar"
    },
    {
        "  and around  northwest of ": null
    },
    {
        "Europa Island": "europa island"
    },
    {
        ", the rim of the atoll averages around 100  m in width and encloses a shallow lagoon of depth no greater than 15  m. Overall, the atoll is about  in diameter, rising steeply from the ": null
    },
    {
        "seabed": "seabed"
    },
    {
        " 3000  m below to encircle an area of . Its ": null
    },
    {
        "exclusive economic zone": "exclusive economic zone"
    },
    {
        " ,  in size, is ": null
    },
    {
        "contiguous": "contiguous zone"
    },
    {
        " with that of Europa Island.     The atoll consists of ten barren rocky islets, with no vegetation, totalling 0.2  km² in area. Those on the north and east sides are 2.1 to 3  m high, while those on the west and south sides are 1.2  m high. The reef, whose coastline measures , is completely covered by the sea from three hours before ": null
    },
    {
        "high tide": "tide"
    },
    {
        " to three hours afterward. The region is also subject to ": null
    },
    {
        "cyclone": "cyclone"
    },
    {
        "s, making the atoll a long-time maritime hazard and the site of numerous shipwrecks.     ": null
    },
    {
        "Jaguar Seamount": "jaguar seamount"
    },
    {
        " and ": null
    },
    {
        "Hall Tablemount": "hall tablemount"
    },
    {
        " ISS": "international space station"
    },
    {
        " Landsat 7": "landsat program"
    },
    {
        " CIA WFB": "the world factbook"
    },
    {
        " CIA": "central intelligence agency"
    },
    {
        " Portuguese explorers": "portuguese explorers"
    },
    {
        " in the early sixteenth century as the Baixo da Judia . The Judia  was the Portuguese ship that discovered the feature by running aground on it in 1506. Natal Museum. Natal Museum journal of humanities, Vol. 12. The Museum Council , 2000. The name became Bassas da India due to transcription errors by cartographers. The Santiago broke up on the shoal in 1585.     It was rediscovered by the Europa in 1774, whence the name Europa Rocks . ...Europa cks, was  discovered by the ship Europa in 1774. In Africa pilot, Part 3 Hydrographic Office of Great Britain. The Malay was lost 27 July 1842 on the Europa Rocks. Historical Sketch of Salem, 1626–1879.     In 1897, the shoal became a ": null
    },
    {
        "French": "third french republic"
    },
    {
        " possession, later being placed under the administration of a commissioner residing in ": null
    },
    {
        "Réunion": "réunion"
    },
    {
        " in 1968. ": null
    },
    {
        "Madagascar": "madagascar"
    },
    {
        " became independent in 1960 and claims sovereignty over the shoal since 1972.         ": null
    },
    {
        "Mooring": "mooring"
    },
    {
        " at Bassas da India requires a permit from the French Government.    Fishing without such a permit may result in the boat being expelled or even confiscated.       Several illegal tourism charters departing from Mozambique or South Africa have been seized since 2013 by the ": null
    },
    {
        "French navy": "french navy"
    },
    {
        ".    ": null
    }
]