[
    {
        "   Batman & Robin is a 1997 American ": null
    },
    {
        "superhero film": "superhero film"
    },
    {
        " based on the ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " characters ": null
    },
    {
        "Batman": "batman"
    },
    {
        " and ": null
    },
    {
        "Robin": "dick grayson"
    },
    {
        ". It is the fourth and final installment of ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " initial ": null
    },
    {
        "Batman film series": "batman"
    },
    {
        ", a sequel to  Batman Forever  and the only film in the series made without the involvement of ": null
    },
    {
        "Tim Burton": "tim burton"
    },
    {
        ". Directed by ": null
    },
    {
        "Joel Schumacher": "joel schumacher"
    },
    {
        " and written by ": null
    },
    {
        "Akiva Goldsman": "akiva goldsman"
    },
    {
        ", it stars ": null
    },
    {
        "Arnold Schwarzenegger": "arnold schwarzenegger"
    },
    {
        " as ": null
    },
    {
        "Victor Fries / Mr. Freeze": "mr. freeze"
    },
    {
        ", ": null
    },
    {
        "George Clooney": "george clooney"
    },
    {
        " as Bruce Wayne / Batman, and ": null
    },
    {
        "Chris ODonnell": "chris odonnell"
    },
    {
        " as Dick Grayson / Robin, alongside ": null
    },
    {
        "Uma Thurman": "uma thurman"
    },
    {
        ", ": null
    },
    {
        "Alicia Silverstone": "alicia silverstone"
    },
    {
        ", ": null
    },
    {
        "Michael Gough": "michael gough"
    },
    {
        ", ": null
    },
    {
        "Pat Hingle": "pat hingle"
    },
    {
        ", and ": null
    },
    {
        "Elle Macpherson": "elle macpherson"
    },
    {
        ". The film follows the titular characters as they attempt to prevent Mr. Freeze and ": null
    },
    {
        "Poison Ivy": "poison ivy"
    },
    {
        " from freezing all mankind to death and repopulating the earth with mutant plants, while at the same time struggling to keep their partnership together. It is also to date the only live-action film appearance of ": null
    },
    {
        "Batgirl": "batgirl"
    },
    {
        ", portrayed by Silverstone, who helps the titular characters fight the villains.     Warner Bros. fast-tracked development for Batman & Robin following the box office success of Batman Forever. Schumacher and Goldsman conceived the storyline during pre-production on  A Time to Kill , while ": null
    },
    {
        "Val Kilmer": "val kilmer"
    },
    {
        " decided not to reprise the role over scheduling conflicts with  The Saint . Schumacher had a strong interest in casting ": null
    },
    {
        "William Baldwin": "william baldwin"
    },
    {
        " in Kilmers place before George Clooney won the role. ": null
    },
    {
        "Principal photography": "principal photography"
    },
    {
        " began in September 1996 and finished in January 1997, two weeks ahead of the ": null
    },
    {
        "shooting schedule": "shooting schedule"
    },
    {
        ".     Batman & Robin premiered in Los Angeles on June 12, 1997, and went into general release on June 20. Making $238.2 million worldwide against a production budget of $160 million,  the film was critically panned and often ranks among the ": null
    },
    {
        "worst films of all time": "list of films considered the worst"
    },
    {
        ".   It is also the lowest-grossing live-action Batman film to date.  Due to the films poor reception, Warner Bros. cancelled a sequel,  Batman Unchained ,  and ": null
    },
    {
        "reboot": "reboot"
    },
    {
        "ed the film series with  Batman Begins  in 2005. One of the songs recorded for the film, ": null
    },
    {
        "The End Is the Beginning Is the End": "the end is the beginning is the end"
    },
    {
        " by ": null
    },
    {
        "The Smashing Pumpkins": "the smashing pumpkins"
    },
    {
        ", won a ": null
    },
    {
        "Grammy Award for Best Hard Rock Performance": "grammy award for best hard rock performance"
    },
    {
        " at the ": null
    },
    {
        "40th Annual Grammy Awards": "40th annual grammy awards"
    },
    {
        ".            Set ": null
    },
    {
        "two years": "batman forever"
    },
    {
        " after the defeat of ": null
    },
    {
        "Two-Face": "two-face"
    },
    {
        " and the ": null
    },
    {
        "Riddler": "riddler"
    },
    {
        ", ": null
    },
    {
        "Batman": "batman"
    },
    {
        " and his new partner, ": null
    },
    {
        "Robin": "robin"
    },
    {
        ", become defenders of Gotham. They attempt to thwart the villainous ": null
    },
    {
        "Mr. Freeze": "mr. freeze"
    },
    {
        " from robbing diamonds from the natural history museum, but he steals one and flees. Mr. Freeze was originally Dr. Victor Fries, a doctor working to develop a cure for MacGregors syndrome to heal his terminally ill ": null
    },
    {
        "wife": "nora fries"
    },
    {
        ". Fries was forced to wear a cryogenic suit powered by diamonds after becoming unable to live at normal temperatures following a lab accident.     At a ": null
    },
    {
        "Wayne Enterprises": "wayne enterprises"
    },
    {
        " lab in Brazil, the botanist ": null
    },
    {
        "Dr. Pamela Isley": "poison ivy"
    },
    {
        " is working under the deranged ": null
    },
    {
        "Dr. Jason Woodrue": "floronic man"
    },
    {
        ", experimenting with the Venom drug. She witnesses Woodrue use the formula to turn the violent, but diminutive, convicted serial murderer Antonio Diego into a hulking monstrosity dubbed ": null
    },
    {
        "Bane": "bane"
    },
    {
        " . When Isley threatens to expose Woodrues experiments, he attempts to kill her by overturning a shelf of various toxins. Despite Woodrues efforts, Isley is resurrected, transforming into the beautiful and seductive ": null
    },
    {
        "Poison Ivy": "poison ivy"
    },
    {
        " before exacting revenge; she kills Woodrue with her poisonous kiss, and sets fire to the lab, leaving it to burn down while she escapes with Bane. She finds that ": null
    },
    {
        "Wayne Enterprises": "wayne enterprises"
    },
    {
        " funded Woodrue, thus she appropriates Bane as a muscle-bound thug, taking him with her to ": null
    },
    {
        "Gotham City": "gotham city"
    },
    {
        ". Meanwhile, ": null
    },
    {
        "Alfred Pennyworths": "alfred pennyworth"
    },
    {
        "niece, Barbara Wilson, makes a surprise visit and is invited by Bruce Wayne to stay at ": null
    },
    {
        "Wayne Manor": "wayne manor"
    },
    {
        " until she goes back to school.     Wayne Enterprises presents a new telescope for Gotham Observatory at a press conference interrupted by Isley. She proposes a project that could help the environment, but Bruce declines her offer, which would kill millions of people. Batman says that this project is in conflict with the main goals of the Wayne Corporation. That night, a charity event is held by ": null
    },
    {
        "Wayne Enterprises": "wayne enterprises"
    },
    {
        " with special guests, Batman and Robin, and she decides to use her abilities to seduce them. Mr. Freeze crashes the party and steals a diamond from the event. Although he is captured by Batman and detained in ": null
    },
    {
        "Arkham Asylum": "arkham asylum"
    },
    {
        ", he eventually ": null
    },
    {
        "escapes": "prison escape"
    },
    {
        "with the help of Poison Ivy and Bane. Meanwhile, Dick discovers that Barbara has participated in drag races to raise money for Alfred, who is dying of MacGregors syndrome.     Batman and Robin begin to have crime fighting relationship problems because of Ivys seductive ability with Robin, but Bruce eventually convinces Dick to trust him. Poison Ivy is then able to contact Robin once more; she kisses him but fails to kill him due to Robin wearing rubber lips. Robin says that the rubber lips are immune to her charms. Meanwhile, Barbara discovers the ": null
    },
    {
        "Batcave": "batcave"
    },
    {
        ", where an AI version of Alfred reveals he has made Barbara her own suit. Barbara dons the suit and becomes ": null
    },
    {
        "Batgirl": "batgirl"
    },
    {
        ". Ivy captures Robin, but he gets rescued by Batman, and Batgirl arrives and subdues Ivy to get eaten by her throne plant, before revealing her identity to the pair.     Batman, Robin and Batgirl decide to go after Mr. Freeze together. By the time they get to the observatory where Mr. Freeze and Bane are, Gotham is completely frozen. Batgirl and Robin are attacked by Bane, but they eventually defeat him by kicking apart his venom tubes, stopping the flow of venom to his body. Bane collapses before transforming back to his original diminutive size of Antonio Diego and is left helpless on the ground.     Meanwhile Batman and Mr. Freeze begin to fight each other, with Batman defeating Mr. Freeze. Batgirl and Robin manage to thaw the city, and Batman shows Freeze a recording of Poison Ivy during her fight with Batgirl, who had informed the latter that she killed Mr. Freezes wife. However, Batman informs Mr. Freeze that she is still alive, in cryogenic slumber before being moved to ": null
    },
    {
        "Arkham Asylum": "arkham asylum"
    },
    {
        ", waiting for Mr. Freeze to finish his research. Batman proceeds to ask Mr. Freeze for the cure Mr. Freeze has created for the first stage of MacGregors Syndrome to administer to Alfred, and Mr. Freeze atones for his misunderstanding by giving him the medicine he had developed.     Mr. Freeze is then detained in Arkham Asylum. Poison Ivy is also imprisoned in Arkham Asylum with a vengeful Mr. Freeze as her cellmate and he plans to make Poison Ivys life a living hell while staying for the attempted murder of his wife. After Alfred is cured, everyone agrees to let Barbara stay at Wayne Manor and fight crime with them.       ": null
    },
    {
        "Arnold Schwarzenegger": "arnold schwarzenegger"
    },
    {
        " as ": null
    },
    {
        "Dr. Victor Fries / Mr. Freeze": "mr. freeze"
    },
    {
        ": A ": null
    },
    {
        "molecular biologist": "molecular biology"
    },
    {
        " who suffers a terrible accident while trying to cryogenically preserve his terminally ill wife. As a result, he is transformed into a criminal forced to live in a sub-zero suit powered by diamonds. ": null
    },
    {
        "Patrick Stewart": "patrick stewart"
    },
    {
        " was considered for the role,  before the script was rewritten to accommodate Schwarzeneggers casting.  Schumacher decided that Mr. Freeze must be big and strong like he was chiseled out of a glacier . Schwarzenegger was paid a $25 million salary for the role,   while his ": null
    },
    {
        "prosthetic makeup": "prosthetic makeup"
    },
    {
        " and wardrobe took six hours to apply each day.    ": null
    },
    {
        "George Clooney": "george clooney"
    },
    {
        " as ": null
    },
    {
        "Bruce Wayne / Batman": "batman"
    },
    {
        ": A billionaire industrialist who witnessed his parents murder as a young boy. At night, Bruce becomes Batman, Gotham Citys vigilante protector. ": null
    },
    {
        "Val Kilmer": "val kilmer"
    },
    {
        " decided not to reprise the role from  Batman Forever . Director Joel Schumacher admitted he had difficulty working with Kilmer on Forever. He sort of quit, Schumacher said, and we sort of fired him. Kilmer said he was not aware of the fast track production and was already committed to  The Saint  . Schumacher cast Clooney in the role because he felt the actor could provide a lighter interpretation of the character than ": null
    },
    {
        "Michael Keaton": "michael keaton"
    },
    {
        "  and Kilmer. The ": null
    },
    {
        "shooting schedule": "shooting schedule"
    },
    {
        " allowed Clooney to simultaneously work on  ER  without any scheduling conflicts.   ": null
    },
    {
        "Eric Lloyd": "eric lloyd"
    },
    {
        " as Young Bruce Wayne   ": null
    },
    {
        "Chris ODonnell": "chris odonnell"
    },
    {
        " as ": null
    },
    {
        "Dick Grayson / Robin": "dick grayson"
    },
    {
        ": The crime-fighting partner to Batman and ": null
    },
    {
        "legal ward": "ward"
    },
    {
        " to Bruce Wayne. He has begun to chafe against Batmans authority.   ": null
    },
    {
        "Uma Thurman": "uma thurman"
    },
    {
        " as ": null
    },
    {
        "Dr. Pamela Isley / Poison Ivy": "poison ivy"
    },
    {
        ": A crazed botanist who becomes an ": null
    },
    {
        "ecoterrorist": "eco-terrorism"
    },
    {
        " after being pushed into vials of chemicals, poisons, and toxins. ": null
    },
    {
        "Demi Moore": "demi moore"
    },
    {
        " was considered for the role. Thurman took the role because she liked the ": null
    },
    {
        "femme fatale": "femme fatale"
    },
    {
        " characterization of Poison Ivy.   ": null
    },
    {
        "Alicia Silverstone": "alicia silverstone"
    },
    {
        " as ": null
    },
    {
        "Barbara Gordon / Batgirl": "barbara gordon"
    },
    {
        ": Her parents died in a car accident and Alfred, her uncle, was very close to her mother, Margaret. Silverstone was the first and only choice for the role. Unlike the comics, this Batgirl does not share the same surname as Commissioner Gordon.    ": null
    },
    {
        "Michael Gough": "michael gough"
    },
    {
        " as ": null
    },
    {
        "Alfred Pennyworth": "alfred pennyworth"
    },
    {
        ": The trusted butler for Bruce Wayne and Dick Grayson. Alfred is dying of a rare disease from which Mr. Freezes wife also suffers.   ": null
    },
    {
        "Pat Hingle": "pat hingle"
    },
    {
        " as ": null
    },
    {
        "Commissioner James Gordon": "james gordon"
    },
    {
        ": The police commissioner of Gotham City. He is close to Batman and informs him of numerous crimes.   ": null
    },
    {
        "John Glover": "john glover"
    },
    {
        " as ": null
    },
    {
        "Dr. Jason Woodrue": "floronic man"
    },
    {
        ": A deranged scientist with a desire for world domination via his Venom-powered ": null
    },
    {
        "supersoldiers": "supersoldier"
    },
    {
        " . He is responsible for the creation of both Bane and Poison Ivy, the latter of whom kills him with a kiss from her toxic lips.   ": null
    },
    {
        "Elle Macpherson": "elle macpherson"
    },
    {
        " as ": null
    },
    {
        "Julie Madison": "julie madison"
    },
    {
        ": Bruce Waynes girlfriend. She proposes to Bruce, but he does not respond, fearing for her safety.   ": null
    },
    {
        "Vivica A. Fox": "vivica a. fox"
    },
    {
        " as Ms. B. Haven: Mr. Freezes sexy assistant who flirts with him constantly. He is unresponsive, as he is still in love with his wife.   ": null
    },
    {
        "Vendela Kirsebom": "vendela kirsebom"
    },
    {
        " as ": null
    },
    {
        "Nora Fries": "nora fries"
    },
    {
        ": Mr. Freezes cryogenically frozen wife.   Elizabeth Sanders as Gossip Gerty: Gothams top gossip columnist. Sanders was Batmans creator ": null
    },
    {
        "Bob Kanes": "bob kane"
    },
    {
        "wife.   ": null
    },
    {
        "Robert Swenson": "robert swenson"
    },
    {
        " as ": null
    },
    {
        "Bane": "bane"
    },
    {
        ": Poison Ivys bodyguard and muscle, who was originally a diminutive criminal named Antonio Diego. Transformed into a hugely powerful Super-soldier by the strength-enhancing drug Venom , he was seen assisting the main villains in several ways, including getting Mr. Freezes suit back from Arkham Asylum, and fighting against the main heroes several times, eventually being defeated by Robin and Batgirl after they found a way to stop the venom flow to his brain.   ": null
    },
    {
        "Michael Paul Chan": "michael paul chan"
    },
    {
        " as Dr. Lee: The research scientist who Mr. Freeze kidnaps.   ": null
    },
    {
        "Kimberly Scott": "kimberly scott"
    },
    {
        " as Observatory Associate     ": null
    },
    {
        "Coolio": "coolio"
    },
    {
        " appeared in a cameo at the start of the motorcycle race. He later said he was courted to play ": null
    },
    {
        "Scarecrow": "scarecrow"
    },
    {
        " in the ultimately cancelled sequel, Batman Unchained.               With the box office success of  Batman Forever  in June 1995, ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " immediately commissioned a sequel. They hired director ": null
    },
    {
        "Joel Schumacher": "joel schumacher"
    },
    {
        " and writer ": null
    },
    {
        "Akiva Goldsman": "akiva goldsman"
    },
    {
        " to reprise their duties the following August, ": null
    },
    {
        "Joel Schumacher": "joel schumacher"
    },
    {
        ", Peter MacGregor-Scott, ": null
    },
    {
        "Chris ODonnell": "chris odonnell"
    },
    {
        ", ": null
    },
    {
        "Val Kilmer": "val kilmer"
    },
    {
        ", ": null
    },
    {
        "Uma Thurman": "uma thurman"
    },
    {
        ", ": null
    },
    {
        "John Glover": "john glover"
    },
    {
        ", Shadows of the Bat: The Cinematic Saga of the Dark Knight Part 6-Batman Unbound, 2005, ": null
    },
    {
        "Warner Home Video": "warner home video"
    },
    {
        " and decided it was best to fast-track production for a June 1997 target release date, which is a break from the usual 3-year gap between films.  Schumacher wanted to ": null
    },
    {
        "homage": "homage"
    },
    {
        " both the broad ": null
    },
    {
        "camp style": "camp"
    },
    {
        " of the ": null
    },
    {
        "1960s television series": "batman"
    },
    {
        " and the work of ": null
    },
    {
        "Dick Sprang": "dick sprang"
    },
    {
        ".  The storyline of Batman & Robin was conceived by Schumacher and Goldsman during ": null
    },
    {
        "pre-production": "pre-production"
    },
    {
        " on  A Time to Kill .  Portions of Mr. Freezes ": null
    },
    {
        "backstory": "backstory"
    },
    {
        " were based on the  Batman: The Animated Series  episode ": null
    },
    {
        "Heart of Ice": "heart of ice"
    },
    {
        " , written by ": null
    },
    {
        "Paul Dini": "paul dini"
    },
    {
        ". ": null
    },
    {
        "Paul Dini": "paul dini"
    },
    {
        ", Batman & Robin: The Heroes, 2005, ": null
    },
    {
        "Warner Home Video": "warner home video"
    },
    {
        " Goldsman, however, expressed concerns about the script during pre-production discussions with Schumacher.     While ": null
    },
    {
        "Chris ODonnell": "chris odonnell"
    },
    {
        " reprises the role of ": null
    },
    {
        "Robin": "dick grayson"
    },
    {
        ", ": null
    },
    {
        "Val Kilmer": "val kilmer"
    },
    {
        " decided not to reprise the role of Batman from Batman Forever. Schumacher admitted he had difficulty working with Kilmer on Forever. He sort of quit, Schumacher said, and we sort of fired him.  Schumacher would later go on to say that Kilmer wanted to work on Island of Doctor Moreau because ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        " was cast in the film. Kilmer said he was not aware of the fast-track production and was already committed to  The Saint  . Schumacher originally had a strong interest in casting ": null
    },
    {
        "William Baldwin": "william baldwin"
    },
    {
        " in Kilmers place, but ": null
    },
    {
        "George Clooney": "george clooney"
    },
    {
        " was cast instead.  Schumacher believed Clooney could provide a lighter interpretation of the character than ": null
    },
    {
        "Michael Keaton": "michael keaton"
    },
    {
        "  and Kilmer.  The ": null
    },
    {
        "shooting schedule": "shooting schedule"
    },
    {
        " allowed Clooney to simultaneously work on  ER  without any scheduling conflicts.     ": null
    },
    {
        "Patrick Stewart": "patrick stewart"
    },
    {
        " was considered for the role of ": null
    },
    {
        "Mr. Freeze": "mr. freeze"
    },
    {
        ", before the script was rewritten to accommodate ": null
    },
    {
        "Arnold Schwarzeneggers": "arnold schwarzenegger"
    },
    {
        "casting.  Schumacher decided that Mr. Freeze must be big and strong like he was chiseled out of a glacier . Schwarzenegger was paid a $25 million salary for the role.  To prepare for the role, Schwarzenegger wore a bald cap after declining to shave his head and wore a blue ": null
    },
    {
        "LED": "light-emitting diode"
    },
    {
        " in his mouth.  His ": null
    },
    {
        "prosthetic makeup": "prosthetic makeup"
    },
    {
        " and wardrobe took six hours to apply each day.  Thurman took the role of ": null
    },
    {
        "Poison Ivy": "poison ivy"
    },
    {
        " because she liked the ": null
    },
    {
        "femme fatale": "femme fatale"
    },
    {
        " characterization of the character. ": null
    },
    {
        "Alicia Silverstone": "alicia silverstone"
    },
    {
        " was the only choice for the role of ": null
    },
    {
        "Batgirl": "batgirl"
    },
    {
        ".     According to Schumacher, during the scene in which the costumes of the ": null
    },
    {
        "Riddler": "riddler"
    },
    {
        " and ": null
    },
    {
        "Two-Face": "two-face"
    },
    {
        " are seen, he originally planned to put Poison Ivy and Mr. Freeze escaping from ": null
    },
    {
        "Arkham Asylum": "arkham asylum"
    },
    {
        " while many other villains saw them from their cells. The scene, however, didnt make it in the final film.       The original start date was August 1996, but ": null
    },
    {
        "principal photography": "principal photography"
    },
    {
        " did not begin until September 12, 1996.  Batman & Robin finished filming in late January 1997,  two weeks ahead of the ": null
    },
    {
        "shooting schedule": "shooting schedule"
    },
    {
        ". The film was mostly shot at Warner Bros. Studios in ": null
    },
    {
        "Burbank, California": "burbank, california"
    },
    {
        ".     When comparing work on Batman Forever, ODonnell explained, It just felt like everything got a little soft the second time. On Batman Forever, I felt like I was making a movie. The second time, I felt like I was making a kids toy commercial. He also complained of the Robin costume, saying it was more involved and uncomfortable than the one he wore in Batman Forever, with a glued-on mask which caused sweat to pool on his face.  According to ": null
    },
    {
        "John Glover": "john glover"
    },
    {
        ", who played Dr. Jason Woodrue, Joel would sit on a crane with a ": null
    },
    {
        "megaphone": "megaphone"
    },
    {
        " and yell before each ": null
    },
    {
        "take": "takefilm"
    },
    {
        ", Remember, everyone, this is a cartoon. It was hard to act because that kind of set the tone for the film. ": null
    },
    {
        "Production designer": "production designer"
    },
    {
        " Barbara Ling admitted her influences for the ": null
    },
    {
        "Gotham City": "gotham city"
    },
    {
        " design came from ": null
    },
    {
        "neon-ridden": "neon sign"
    },
    {
        " Tokyo and the ": null
    },
    {
        "Machine Age": "machine age"
    },
    {
        ". Gotham is like a ": null
    },
    {
        "Worlds Fair": "worlds fair"
    },
    {
        " on ": null
    },
    {
        "ecstasy": "mdma"
    },
    {
        ". Barbara Ling, Bigger, Bolder, Brighter: The Production Design of Batman & Robin, 2005, ": null
    },
    {
        "Warner Home Video": "warner home video"
    },
    {
        " Rhythm and Hues": "rhythm and hues studios"
    },
    {
        " and ": null
    },
    {
        "Pacific Data Images": "pacific data images"
    },
    {
        " created the visual effects sequences, with ": null
    },
    {
        "John Dykstra": "john dykstra"
    },
    {
        " and ": null
    },
    {
        "Andrew Adamson": "andrew adamson"
    },
    {
        " credited as the ": null
    },
    {
        "visual effects supervisor": "visual effects supervisor"
    },
    {
        "s. ": null
    },
    {
        "John Dykstra": "john dykstra"
    },
    {
        ", ": null
    },
    {
        "Andrew Adamson": "andrew adamson"
    },
    {
        ", Freeze Frame: The Visual Effects of Batman & Robin, 2005, ": null
    },
    {
        "Warner Home Video": "warner home video"
    },
    {
        "     ODonnell said that despite hanging out with Schwarzenegger a lot off set and during promotion for the film, they never worked a single day together; this was achieved with stand-ins when one of the actors was not available. Stunt coordinator Alex Field taught Silverstone to ride a motorcycle so that she could play Batgirl.            Like Batman Forever, the original score for the film was written by ": null
    },
    {
        "Elliot Goldenthal": "elliot goldenthal"
    },
    {
        ".  The soundtrack featured a variety of genres by various bands and performers, showcasing ": null
    },
    {
        "alternative rock": "alternative rock"
    },
    {
        " on the lead single ": null
    },
    {
        "The End Is the Beginning Is the End": "the end is the beginning is the end"
    },
    {
        " by ": null
    },
    {
        "The Smashing Pumpkins": "the smashing pumpkins"
    },
    {
        ", on the ": null
    },
    {
        "Goo Goo Dolls": "goo goo dolls"
    },
    {
        " contribution, ": null
    },
    {
        "Lazy Eye": "lazy eye"
    },
    {
        " and with ": null
    },
    {
        "R.E.M.s": "r.e.m."
    },
    {
        "song Revolution . R & B singer ": null
    },
    {
        "R. Kelly": "r. kelly"
    },
    {
        " also wrote ": null
    },
    {
        "Gotham City": "gotham city"
    },
    {
        " for the soundtrack, which became the other song featured in the end credits, as well as one of the singles, reaching the top 10 in the United States and in the UK. ": null
    },
    {
        "Eric Benét": "eric benét"
    },
    {
        " and ": null
    },
    {
        "Meshell Ndegeocello": "meshell ndegeocello"
    },
    {
        " also contributed R & B songs. Also included was the top 5 second single, ": null
    },
    {
        "Look into My Eyes": "look into my eyes"
    },
    {
        " by the ": null
    },
    {
        "hip hop": "hip hop"
    },
    {
        " group ": null
    },
    {
        "Bone Thugs-n-Harmony": "bone thugs-n-harmony"
    },
    {
        ". Other songs featured included ": null
    },
    {
        "electronic dance": "electronic dance music"
    },
    {
        " elements, including those by ": null
    },
    {
        "Moloko": "moloko"
    },
    {
        " and ": null
    },
    {
        "Arkarna": "arkarna"
    },
    {
        ". The soundtrack was released on May 27, 1997, a month before the film.     ": null
    },
    {
        "The End Is the Beginning Is the End": "the end is the beginning is the end"
    },
    {
        " by ": null
    },
    {
        "The Smashing Pumpkins": "the smashing pumpkins"
    },
    {
        ", won a ": null
    },
    {
        "Grammy Award for Best Hard Rock Performance": "grammy award for best hard rock performance"
    },
    {
        " at the ": null
    },
    {
        "40th Annual Grammy Awards": "40th annual grammy awards"
    },
    {
        ".       The Batman & Robin ": null
    },
    {
        "film trailer": "trailer"
    },
    {
        " debuted on the February 19, 1997 episode of  Entertainment Tonight .  ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " spent $125 million to market and promote the film,  in addition to its $160 million production budget. The studio also reportedly included toy companies in ": null
    },
    {
        "pre-production": "pre-production"
    },
    {
        " meetings, including the design of ": null
    },
    {
        "concept art": "concept art"
    },
    {
        " and character illustrations. Director Joel Schumacher criticized Warner Bros. strategy for Batman & Robin as being overtly ": null
    },
    {
        "toyetic": "toyetic"
    },
    {
        ".     Various ": null
    },
    {
        "Six Flags": "six flags"
    },
    {
        " parks  all debuted coasters themed to the film. Six Flags Great Adventure opened ": null
    },
    {
        "Batman & Robin: The Chiller": "batman  &  robin: the chiller"
    },
    {
        " in 1997, and both Six Flags Over Texas and Six Flags St. Louis received ": null
    },
    {
        "Mr. Freeze": "mr. freeze"
    },
    {
        " in 1998. ": null
    },
    {
        "Taco Bell": "taco bell"
    },
    {
        " featured a promotional campaign including collectible cups and a contest with a replica of the films ": null
    },
    {
        "Batmobile": "batmobile"
    },
    {
        " as a grand prize. A junior novelization of the screenplay, written by ": null
    },
    {
        "Alan Grant": "alan grant"
    },
    {
        ", was published along with the release of the film in 1997.            Batman & Robin was released on June 20, 1997 in North America, earning $42,872,605 in its opening weekend,  making it the third-highest opening weekend of 1997.  The film declined by 63% in its second week.  Batman & Robin faced early competition with  Face/Off ,  Hercules , and  Men in Black .  Schumacher blamed it on ": null
    },
    {
        "yellow journalism": "yellow journalism"
    },
    {
        " started by ": null
    },
    {
        "Harry Knowles": "harry knowles"
    },
    {
        " of ": null
    },
    {
        "Aint It Cool News": "aint it cool news"
    },
    {
        " and other film websites such as ": null
    },
    {
        "Dark Horizons": "dark horizons"
    },
    {
        ".  The film went on to gross $107.3 million in North America and $130.9 million internationally, coming to a worldwide total of $238.2 million. Warner Bros. acknowledged Batman & Robins shortcomings in the domestic market but pointed out success overseas.            On review aggregation website ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        " the film has an approval rating of 11%, based on 89 reviews, with an average rating of 3.69/10. The sites critical consensus reads, Joel Schumachers tongue-in-cheek attitude hits an unbearable limit in Batman & Robin, resulting in a frantic and mindless movie thats too jokey to care much for.  On ": null
    },
    {
        "Metacritic": "metacritic"
    },
    {
        ", the film has an average score of 28 out of 100, based on reviews from 21 critics, indicating generally unfavorable reviews .  Audiences polled by ": null
    },
    {
        "CinemaScore": "cinemascore"
    },
    {
        " gave the film an average grade of C+ on an A+ to F scale.      Schumacher and producer Peter MacGregor-Scott blamed the negative reception of Batman & Robin on Warner Bros. decision to fast track production. There was a lot of pressure from Warner Bros. to make Batman & Robin more ": null
    },
    {
        "family-friendly": "family-friendly"
    },
    {
        ", Schumacher explained. We decided to do a less depressing Batman movie, and less torture and more heroic. I know I have been criticized a lot for this, but I didnt see the harm in that approach at all. ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " of the  Chicago Sun-Times  criticized the ": null
    },
    {
        "toyetic": "toyetic"
    },
    {
        " approach and Mr. Freezes ": null
    },
    {
        "one-liner jokes": "one-line joke"
    },
    {
        " in his two-star review of the film.  ": null
    },
    {
        "Kenneth Turan": "kenneth turan"
    },
    {
        " of the  Los Angeles Times  believed the film killed the ": null
    },
    {
        "Batman film series": "batman in film"
    },
    {
        ", and felt Batman & Robin depended too much on visual effects.  ": null
    },
    {
        "Desson Howe": "desson thomson"
    },
    {
        " of  The Washington Post  largely disapproved of Schumachers direction and Akiva Goldsmans script.  ": null
    },
    {
        "Mick LaSalle": "mick lasalle"
    },
    {
        ", writing in the  San Francisco Chronicle , said, George Clooney is the big zero of the film, and should go down in history as the ": null
    },
    {
        "George Lazenby": "george lazenby"
    },
    {
        " of the series.  However, ": null
    },
    {
        "Janet Maslin": "janet maslin"
    },
    {
        " of  The New York Times  gave a positive review, and praised Uma Thurmans acting, as well as the production and costume design.  ": null
    },
    {
        "Andrew Johnston": "andrew johnston"
    },
    {
        ", writing in ": null
    },
    {
        "Time Out New York": "time out"
    },
    {
        ", remarked, Its hard to tell who B & R is intended for. Anyone who knows the character from the comics or the superb animated show on Fox will be alienated. And though Schumacher treats the ": null
    },
    {
        "Adam West version": "batman"
    },
    {
        " as gospel, that shows campy humor is completely incompatible with these production values. As Mr. Freeze would say, its sure to leave audiences cold.         Batman & Robin was nominated for the ": null
    },
    {
        "Saturn Award for Best Fantasy Film": "saturn award for best fantasy film"
    },
    {
        ", as well as ": null
    },
    {
        "Best Make-up": "saturn award for best make-up"
    },
    {
        " and ": null
    },
    {
        "Best Costume": "saturn award for best costume design"
    },
    {
        ", but won none. ": null
    },
    {
        "Alicia Silverstone": "alicia silverstone"
    },
    {
        " won the ": null
    },
    {
        "Razzie Award": "golden raspberry awards"
    },
    {
        " for Worst Supporting Actress. Other nominations at the Razzie Awards included Schumacher , George Clooney and Chris ODonnell , Akiva Goldsman , both Chris ODonnell and Arnold Schwarzenegger , Uma Thurman , as well as ": null
    },
    {
        "Billy Corgan": "billy corgan"
    },
    {
        " . Batman & Robin also received nominations for ": null
    },
    {
        "Worst Picture": "golden raspberry award for worst picture"
    },
    {
        ", Worst Remake or Sequel and Worst Reckless Disregard for Human Life and Public Property. Ultimately, out of 11 nominations, Batman & Robin garnered only one Razzie Award. At the ": null
    },
    {
        "Stinkers Bad Movie Awards": "stinkers bad movie awards"
    },
    {
        ", the film garnered five nominations, of which it won four: Worst Picture, Worst Director , Worst Supporting Actress , and Worst Screenplay for a Film Grossing More Than $100M Worldwide Using Hollywood Math. However, it lost Worst Sequel to  Speed 2: Cruise Control .  Later, the Stinkers Bad Movie Awards unveiled their 100 Years, 100 Stinkers list which honoured the 100 worst films of the 20th century. Batman and Robin managed to rank as the 3 worst film of the century, behind  Wild Wild West  at 2 and  Battlefield Earth  at 1.          Some observers thought Schumacher, a gay man, added possible ": null
    },
    {
        "homoerotic": "homoeroticism"
    },
    {
        " innuendo": "innuendo"
    },
    {
        " in the storyline. ": null
    },
    {
        "James Berardinelli": "james berardinelli"
    },
    {
        " questioned the random  of rubber nipples and camera angle ": null
    },
    {
        "close-ups": "close-up"
    },
    {
        "of the Dynamic Duos butts and Bat-crotches.  Los Angeles Times wrote that The addition of nipples and a ": null
    },
    {
        "codpiece": "codpiece"
    },
    {
        " to Batman’s costume may be the film’s lasting legacy .  Schumacher stated, I had no idea that putting nipples on the Batsuit and Robin suit were going to spark international headlines. The bodies of the suits come from ": null
    },
    {
        "Ancient Greek statue": "ancient greek art"
    },
    {
        "s, which display perfect bodies. They are anatomically correct. ODonnell felt it wasnt so much the nipples that bothered me. It was the codpiece. The press obviously played it up and made it a big deal, especially with Joel directing. I didnt think twice about the controversy, but going back and looking and seeing some of the pictures, it was very unusual. Clooney, who admitted to purposely taking a subtle gay approach to his portrayal, later said Joel Schumacher told me Batman was gay .  Clooney himself has spoken critically of the film, saying in 2005, I think we might have killed the franchise ,  and called it a waste of money .           During the filming of Batman & Robin, ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " was impressed with the ": null
    },
    {
        "dailies": "dailies"
    },
    {
        ", prompting them to immediately hire Joel Schumacher to return as director for a fifth film. However, writer ": null
    },
    {
        "Akiva Goldsman": "akiva goldsman"
    },
    {
        " turned down an offer to write the script. In late 1996, Warner Bros. and Schumacher hired ": null
    },
    {
        "Mark Protosevich": "mark protosevich"
    },
    {
        " to write the script for a fifth Batman film. A projected mid-1999 release date was announced.  Los Angeles Times described their film as continuing in the same vein with multiple villains and more silliness . Titled Batman Unchained, Protosevichs script had the ": null
    },
    {
        "Scarecrow": "scarecrow"
    },
    {
        " as the main villain. Through the use of his fear ": null
    },
    {
        "toxin": "toxin"
    },
    {
        ", he resurrects the ": null
    },
    {
        "Joker": "joker"
    },
    {
        " as a hallucination in Batmans mind. ": null
    },
    {
        "Harley Quinn": "harley quinn"
    },
    {
        " appeared as a supporting character, written as the Jokers daughter.  Clooney, ODonnell, Silverstone, and Coolio were set to reprise the roles of Batman, Robin, Batgirl, and Scarecrow. It was also hoped that ": null
    },
    {
        "Jack Nicholson": "jack nicholson"
    },
    {
        " would reprise the role of the Joker. However, following the poor critical reception of Batman & Robin, Clooney vowed never to reprise his role.      Warner Bros. decided to consider a live-action  Batman Beyond  film and an adaptation of ": null
    },
    {
        "Frank Millers": "frank miller"
    },
    {
        "  Batman: Year One . Warner would then produce whichever idea suited them the most. Schumacher felt he owe the Batman culture a real Batman movie. I would go back to the basics and make a dark portrayal of the Dark Knight. He approached Warner Bros. about doing Batman: Year One in mid-1998,  but they were more interested in hiring ": null
    },
    {
        "Darren Aronofsky": "darren aronofsky"
    },
    {
        ". Aronofsky and Miller developed a Year One script with Aronofsky to direct, but it was ultimately canceled. ": null
    },
    {
        "Christopher Nolan": "christopher nolan"
    },
    {
        " was eventually hired to helm the next Batman film in January 2003, resulting in the ": null
    },
    {
        "reboot": "reboot"
    },
    {
        "ed  Batman Begins  .        In Legends of the Dark Knight , an episode of  The New Batman Adventures , three teenagers discuss their ideas about what Batman is really like. They briefly meet a youth called Joel whose idea of Batman reflects characterizations and costumes portrayed within Schumachers Batman & Robin. The teens treat Joels ideas with utter disdain. Legends of the Dark Knight . ": null
    },
    {
        "Dan Riba": "dan riba"
    },
    {
        " , ": null
    },
    {
        "Bruce Timm": "bruce timm"
    },
    {
        "; Robert Goodman .  Batman: The Animated Series . October 10, 1998. No. 19, season 2. In  Watchmen , director ": null
    },
    {
        "Zack Snyder": "zack snyder"
    },
    {
        " and comic book artist ": null
    },
    {
        "Dave Gibbons": "dave gibbons"
    },
    {
        " chose to parody the molded muscle and nipple ": null
    },
    {
        "Batsuit": "batsuit"
    },
    {
        " design from Batman & Robin for the ": null
    },
    {
        "Ozymandias": "ozymandias"
    },
    {
        " costume.   The film is referenced in the  Batman: The Brave and the Bold  episode Legends of the Dark Mite! , when ": null
    },
    {
        "Bat-Mite": "bat-mite"
    },
    {
        " briefly uses his powers to transform Batmans costume into the same suit shown in the Schumacher Batman films, before declaring it Too icky . Legends of the Dark Mite! . ": null
    },
    {
        "Ben Jones": "ben jones"
    },
    {
        " , ": null
    },
    {
        "Paul Dini": "paul dini"
    },
    {
        " .  Batman: The Brave and the Bold . May 29, 2009. No. 19, season 1. The Batman from Batman & Robin later appeared as part of an army of Batmen gathered from across the ": null
    },
    {
        "Multiverse": "multiverse"
    },
    {
        " in Night of the Batmen! , complete with the blue rubber Batsuit.     Additionally, there were worries within Warner Bros. surrounding the negative critical reception of Batman & Robin and how it could come to harm the success of the subsequent direct-to-video animated film  Batman & Mr. Freeze: SubZero , which was originally planned for release at around the same time as Batman & Robin but was subsequently delayed.  However, SubZero received a far stronger positive response from critics than Batman & Robin, with Mr. Freezes role within it being seen in a much more positive light, returning his popularity as a Batman villain to a level comparable to that reached by him within the two Emmy-winning episodes the character featured in of  Batman: The Animated Series ": null
    }
]