[
    {
        "   Year One , later referred to as Batman: Year One , is an ": null
    },
    {
        "American comic book": "american comic book"
    },
    {
        " story arc": "story arc"
    },
    {
        " published by ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " which recounts the superhero ": null
    },
    {
        "Batmans": "batman"
    },
    {
        "first year as a crime-fighter. It was written by ": null
    },
    {
        "Frank Miller": "frank miller"
    },
    {
        ", illustrated by ": null
    },
    {
        "David Mazzucchelli": "david mazzucchelli"
    },
    {
        ", colored by ": null
    },
    {
        "Richmond Lewis": "richmond lewis"
    },
    {
        ", and lettered by ": null
    },
    {
        "Todd Klein": "todd klein"
    },
    {
        ". Batman: Year One originally appeared in issues 404–407 of the comic book title  Batman  in 1987. As well as recounting ": null
    },
    {
        "Batmans": "batman"
    },
    {
        "early crime-fighting career, the story simultaneously examines the life of recently transferred officer ": null
    },
    {
        "James Gordon": "james gordon"
    },
    {
        " – eventually building towards their partnership.     There have been several reprints of the story: a ": null
    },
    {
        "hardcover": "hardcover"
    },
    {
        ", multiple ": null
    },
    {
        "trade paperback": "trade paperback"
    },
    {
        " editions  and it has been included in The Complete Frank Miller Batman hardcover. The ": null
    },
    {
        "story arc": "story arc"
    },
    {
        " was adapted into an ": null
    },
    {
        "animated feature": "batman: year one"
    },
    {
        " in 2011.         ": null
    },
    {
        "Batman": "batman"
    },
    {
        " is a superhero appearing in ": null
    },
    {
        "American comic books": "american comic book"
    },
    {
        "published by ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " who debuted in ": null
    },
    {
        "The Case of the Chemical Syndicate": "the case of the chemical syndicate"
    },
    {
        " , a story published in  Detective Comics  27 . He was created by artist ": null
    },
    {
        "Bob Kane": "bob kane"
    },
    {
        " and writer ": null
    },
    {
        "Bill Finger": "bill finger"
    },
    {
        " to capitalize on the success of DCs other superhero ": null
    },
    {
        "Superman": "superman"
    },
    {
        " and was inspired by characters from ": null
    },
    {
        "pulp fiction": "pulp magazine"
    },
    {
        " stories, such as ": null
    },
    {
        "the Shadow": "the shadow"
    },
    {
        ".  Boichel, Bill. Batman: Commodity as Myth. The Many Lives of the Batman: Critical Approaches to a Superhero and His Media. Routledge: London, 1991. , pp. 6–7. Batmans origin story was introduced in a two-page, 12-panel story by Kane and Finger from Detective Comics 33 . In the story, a young Bruce witnesses the murder of his parents ": null
    },
    {
        "Thomas": "thomas wayne"
    },
    {
        " and ": null
    },
    {
        "Martha": "martha wayne"
    },
    {
        " at the hands of a mugger. Bruce vows to avenge his parents deaths by fighting crime; he takes the persona of Batman after a ": null
    },
    {
        "bat": "bat"
    },
    {
        " flies through his window one night. For the story, Finger lifted elements from tales published in  Popular Detective  and  The Phantom , while Kane traced artwork of ": null
    },
    {
        "Tarzan": "tarzan"
    },
    {
        " and from  Junior G-Men .      In the years afterward, much of DCs continuity became convoluted and contradictory. Examples of this were present in Batmans origin: in a 1948 story, Finger gave the mugger a name , and in 1956 wrote that he killed Bruces parents on behalf of the mob. Finger also went on to suggest that the Batman persona was inspired by a bat costume Thomas wore to a ": null
    },
    {
        "masquerade ball": "masquerade ball"
    },
    {
        ". Other stories depicted Bruce traveling across the world to learn the skills he would need as Batman. In an effort to resolve continuity errors like these in the ": null
    },
    {
        "DC Universe": "dc universe"
    },
    {
        ", ": null
    },
    {
        "Marv Wolfman": "marv wolfman"
    },
    {
        " and ": null
    },
    {
        "George Pérez": "george pérez"
    },
    {
        " produced the 12-issue ": null
    },
    {
        "limited series": "limited series"
    },
    {
        "  Crisis on Infinite Earths .  Wolfmans plans for the DC Universe after Crisis on Infinite Earths included relaunching every DC comic with a new first issue.      During the production of Crisis on Infinite Earths, ": null
    },
    {
        "Frank Miller": "frank miller"
    },
    {
        " became the writer of ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        "  Daredevil . Miller had originally been the series ": null
    },
    {
        "penciller": "penciller"
    },
    {
        ",  but editor ": null
    },
    {
        "Dennis ONeil": "dennis oneil"
    },
    {
        " soon made him the series writer.  Sales rose dramatically after Miller began to write. For one ": null
    },
    {
        "critically acclaimed Daredevil story": "born again"
    },
    {
        ", Miller collaborated with artist ": null
    },
    {
        "David Mazzucchelli": "david mazzucchelli"
    },
    {
        ". Miller went to work for DC as well, and produced the influential four-issue limited series  The Dark Knight Returns  . ONeil also made the move to DC.          The contract Miller signed to produce The Dark Knight Returns also required him to write a revamped Batman origin story. While Miller handled the writing and artwork of The Dark Knight Returns, he simply wrote Year One , while Mazzucchelli joined to pencil. In the past, Miller had been overwhelmed by having to handle both writing and illustration duties.  ": null
    },
    {
        "Todd Klein": "todd klein"
    },
    {
        " was the storys ": null
    },
    {
        "letterer": "letterer"
    },
    {
        ", while Mazzucchellis wife ": null
    },
    {
        "Richmond Lewis": "richmond lewis"
    },
    {
        " handled coloring. ONeil edited the issues. According to ONeil, the contract Miller and Mazzucchelli signed to produce Year One in the ": null
    },
    {
        "ongoing": "ongoing series"
    },
    {
        "  Batman  series guaranteed publication within 6 months.        Year One was originally conceived as a ": null
    },
    {
        "graphic novel": "graphic novel"
    },
    {
        ". ONeil, who had been asked to edit several issues of Batman, was friends with Miller and was able to learn of the story. Reflecting on poor sales of Batman, ONeil caught Miller one day while on a walk in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " and convinced him and Mazzucchelli to serialize the story in the ongoing series.  Miller was initially reluctant; he felt this would be hard because he had to ensure the story stayed canonical to the DC Universe, something he did not have to worry about when writing The Dark Knight Returns. In addition, Millers pacing would have to be altered because of ongoing series relatively small page counts. ONeil reasoned that Crisis on Infinite Earths had completely remade the DC Universe, so Miller would be able to have the same creative freedom that The Dark Knight Returns provided. He also reassured Miller that he and Mazzucchelli weren’t going to lose anything by serializing it.     Miller has said he kept Kane and Fingers basic story for Year One but expanded it.  In writing the story, Miller looked for parts of Batmans origin that were never explored. He left the core elements, such as the murder of Bruces parents, intact, but reduced them to brief ": null
    },
    {
        "flashbacks": "flashback"
    },
    {
        ". Bruces globe-trotting adventures was something Miller removed, as he found uninteresting. Rather than portraying Batman as a larger-than-life icon as he had in The Dark Knight Returns, Miller chose to characterize Year Ones Batman as an average, inexperienced man trying to make a change in society because Miller believed a superhero is least interesting when most effective. Examples of this include Batman underestimating his opponents, getting shot by police, and his costume being too big. The storys violence was kept street-level and gritty, emphasizing ": null
    },
    {
        "noir": "noir fiction"
    },
    {
        " and realism.     In illustrating, Mazzucchelli sought to make Year One look grimy, dark, and muted. His interpretation of ": null
    },
    {
        "Gotham City": "gotham city"
    },
    {
        " was designed to symbolize corruption, featuring muddy colors that gave the impression of the city being dirty and needing a hero. The newsprint paper used in Batman was unable to reproduce the bright coloring and visual effects of The Dark Knight Returns, so Mazzucchelli took on Year One with a more grounded and darker approach.       In accordance with Wolfmans plans, ONeil initially saw Year One as the start of the second volume of Batman and expected the first part to be its first issue. However, Miller rejected this idea. He explained: I dont need to slash through continuity with as sharp a blade as I thought. Doing the Dark Knight has shown me theres been enough good material  ... I didnt feel that fleshing out an unknown part of Batmans history justified wiping out 50 years of Thus, the four Year One issues bear no continuity to past issues of Batman.             One of the earliest collections of Year One was released in The Complete Frank Miller Batman, published by ": null
    },
    {
        "Longmeadow Press": "longmeadow press"
    },
    {
        " in 1989. A dedicated collected edition, Batman: Year One, was published as a ": null
    },
    {
        "trade paperback": "trade paperback"
    },
    {
        " in October 1997 . It is 96 pages long and contains the four Year One issues.     DC released a hardcover deluxe edition of Batman: Year One  to coincide with the release of  Batman Begins  in April 2005. This release includes introductions by Miller and Mazzucchelli, the original penciled artwork, promotional and unseen Batman art, Lewiss color samples, and some pages of the original script, for a total of 144 pages. This edition was rereleased as a 136-page trade paperback in January 2007, with an introduction by ONeil . New versions of this edition were released in 2012  and 2017 .     To celebrate Batmans 75th anniversary in November 2014, DC released a sample of Year One as a part of its DC Comics Essentials line of promotional comics.  In 2015, a special package was released that contained the story and its ": null
    },
    {
        "film adaptation": "batman: year one"
    },
    {
        " .     In November 2016, DC released a 288-page ": null
    },
    {
        "DC Comics Absolute Edition": "dc comics absolute edition"
    },
    {
        " of Batman: Year One. It comes in a slipcase with two hardcover books: one that reprints a remastered version of the story, with refined coloring; and another that reprints the original, unaltered story from 1987. Both books contain over 60 pages of bonus materials, including Millers complete scripts.        The story recounts the beginning of Bruce Waynes career as ": null
    },
    {
        "Batman": "batman"
    },
    {
        " and ": null
    },
    {
        "Jim Gordons": "james gordon"
    },
    {
        "with the ": null
    },
    {
        "Gotham City Police Department": "gotham city police department"
    },
    {
        ". Bruce Wayne returns home to ": null
    },
    {
        "Gotham City": "gotham city"
    },
    {
        " at the age of twenty-five from training abroad in martial arts, man-hunting, and science for the past 12 years, and James Gordon moves to Gotham City with his wife, Barbara, after a transfer from ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ". Both are swiftly acquainted with the corruption and violence of Gotham City, with Gordon witnessing his partner ": null
    },
    {
        "Detective Arnold John Flass": "arnold john flass"
    },
    {
        " assaulting an African-American teen for fun.     After refusing a proposition from a teenage prostitute ": null
    },
    {
        "Holly Robinson": "holly robinson"
    },
    {
        ", Bruce is reluctantly drawn into a brawl with her violent pimp and is attacked by several prostitutes, including ": null
    },
    {
        "dominatrix": "dominatrix"
    },
    {
        " Selina Kyle": "catwoman"
    },
    {
        ". Two police officers shoot and take him in their squad car, but a dazed and bleeding Bruce breaks his handcuffs and causes a crash, dragging the police to a safe distance before fleeing. He reaches ": null
    },
    {
        "Wayne Manor": "wayne manor"
    },
    {
        " barely alive and sits before his fathers bust, requesting guidance in his war on crime. A bat crashes through a window and settles on the bust, giving him the inspiration to become the Batman.     Gordon soon works to rid corruption from the force, but, on orders from ": null
    },
    {
        "Commissioner Gillian Loeb": "gillian b. loeb"
    },
    {
        ", several officers attack him, including Flass, who personally threatens Gordons pregnant wife. In revenge, the recovering Gordon tracks Flass down, beats him, and leaves him naked and handcuffed in the snow.     As Gordon becomes a minor celebrity for several brave acts, Batman strikes for the first time, attacking a group of thieves. Batman soon works up the ladder, even attacking Flass while the latter was accepting a drug dealers bribe. After Batman interrupts a dinner party attended by many of Gothams corrupt politicians and crime bosses to announce his intention to bring them to justice, including ": null
    },
    {
        "Carmine The Roman Falcone": "carmine falcone"
    },
    {
        ", Loeb orders Gordon to bring him in by any means necessary.     As Gordon tries in vain to catch him, Batman attacks Falcone, stripping him naked and tying him up in his bed and dumping his car in the river, infuriating the mob boss. Assistant ": null
    },
    {
        "District Attorney": "district attorney"
    },
    {
        " Harvey Dent": "two-face"
    },
    {
        " becomes Batmans first ally, while ": null
    },
    {
        "Detective Sarah Essen": "sarah essen gordon"
    },
    {
        " and Gordon witness Batman save an old woman from a runaway truck, after Essen suggested Bruce Wayne as a Batman suspect. Essen holds Batman at gunpoint while Gordon is momentarily dazed, but Batman disarms her and flees to an abandoned building.     Claiming the building has been scheduled for demolition, Loeb orders a bomb to be dropped on it, forcing Batman into the fortified basement, where he abandons his ": null
    },
    {
        "utility belt": "utility belt"
    },
    {
        " as it catches fire. A ": null
    },
    {
        "SWAT": "swat"
    },
    {
        " team led by trigger-happy officer Branden is sent in and attempts to trap Batman in the basement. After tranquilizing Branden, Batman dodges bullets as Brandens team opens fire on him, barely managing to survive after two bullet wounds. Enraged as the teams carelessly fired bullets injure several people outside, Batman beats the team into submission and, after using a device to attract the bats of his cave to him, he flees amid the chaos. After witnessing him in action, Selina Kyle dons a costume of her own to begin a life of crime.     Gordon has a brief affair with Essen, while Batman intimidates a mob drug dealer for information. The dealer comes to Gordon to testify against Flass, who is brought up on charges. Upset with Gordons exploits, Loeb blackmails Gordon against pressing charges with proof of his affair. After bringing Barbara with him to interview Bruce Wayne, investigating his connection to Batman, Gordon confesses the affair to her.     Batman sneaks into Falcones manor, overhearing a plan against Gordon, but is interrupted when Selina Kyle, hoping to build a reputation after her robberies were pinned on Batman, attacks Falcone and his bodyguards, aided from afar by Batman. Identifying Falcones plan as the morning comes, the uncostumed Bruce leaves to help.     While leaving home, Gordon spots a motorcyclist enter his garage. Suspicious, Gordon enters to see Johnny Vitti, Falcones nephew, and his thugs holding his family hostage. Gordon decisively shoots the thugs and chases Vitti, who has fled with the baby. The mysterious motorcyclist, now revealed to the reader as Bruce Wayne, rushes out to chase Vitti. Gordon blows out Vittis car tire on a bridge and the two fight hand-to-hand, with Gordon losing his glasses, before Vitti and James Gordon Jr. fall over the side. Bruce leaps over the railing and saves the baby. Gordon realizes that he is standing before an unmasked Batman, but says that he is practically blind without glasses , and lets Bruce go.     In the final scenes of the comic, Flass turns on Loeb, supplying Dent with evidence and testimony, and Loeb resigns. Gordon is promoted to captain and stands on the rooftop waiting to meet Batman to discuss somebody called ": null
    },
    {
        "the Joker": "joker"
    },
    {
        ", who is plotting to poison the reservoir.       DCs post-Crisis on Infinite Earths revamp was a major success, raising sales 22% in the first year, and DC beat Marvel in ": null
    },
    {
        "direct market": "direct market"
    },
    {
        " sales for the first time in August and September 1987.  The four Year One issues were no exception to this. Two years before the relaunch, Batman had all-time low sales of 75,000 copies per month; Year One sold an average of 193,000 copies an issue, numbers not seen since the early 1970s. Despite this, it did not outsell other books like  Uncanny X-Men , and the collected edition sold well but never matched the sales of The Dark Knight Returns. The story, with its noir-inspired narrative and dirty violence, quickly caught the attention of readers. The  Los Angeles Times  wrote that Year One offered an interesting and entertaining update to the origin of Batman.      Year Ones characterization, particularly that of Batman and Gordon, has been praised. Hilary Goldstein  compared their journey to friendship to the plot of the film  Serpico ; they found that the two characters respective story arcs—with Gordons illustrat the corruption in Gotham and Batmans detailing the transformation from man to myth —offered an exploration of Batmans world like no other.  Glenn Matchett  wrote that, unlike The Dark Knight Returns, Year Ones Batman is more vulnerable and inexperienced, which made the story more memorable.  Nick Roberts  thought the characters seemed believable,  and comics historian Matthew K. Manning called the characterization realistic.     The storys depiction of Gotham and dark tone has also been acclaimed. Journalist James Lovegrove described Year One as a noir-inflected pulp tale of vigilantism and integrity, focused on a good man doing the right thing in a dirty world and noted the brutality of its fight sequences.  Jason Serafino  wrote that by ignoring many of Batmans trademark gadgets and villains, Miller managed to present Batman in a relatable and thrilling way.  Goldstein found every moment memorable, writing Miller does not waste a single panel in presenting a gritty and dark story. Matchett agreed; he offered particular praise for the scenes depicting Batman clashing with the police, calling them the moment Batman began to become a legend.     Mazzucchellis art was noted as a standout.       Before ": null
    },
    {
        "the New 52": "the new 52"
    },
    {
        " in 2011, Batman: Year One existed in the mainstream DC continuity, and in the same continuity as the other storylines in Millers Dark Knight Universe , consisting of  The Dark Knight Returns , its sequel  The Dark Knight Strikes Again ,  The Dark Knight III: The Master Race , The Dark Knight Returns: The Last Crusade,  Spawn/Batman , and  All Star Batman and Robin the Boy Wonder .  However, following the New 52 reboot,  Batman: Zero Year  replaced Year One as the official origin for Batman and Year One was relegated to the continuity of the other Frank Miller storylines.      Following  Crisis on Infinite Earths , DC ": null
    },
    {
        "rebooted": "reboot"
    },
    {
        " many of its titles. Year One was followed by  Batman: Year Two , but the 1994  Zero Hour: Crisis in Time  crossover erased Year Two from continuity. In another continuity re-arrangement, Catwoman: Year One  posited that Selina Kyle had not actually been a prostitute, but, rather, a thief posing as one in order to commit crimes.     Launched in 1989, following the success of the film  Batman , the title  Batman: Legends of the Dark Knight  examines crime-fighting exploits primarily, not exclusively, from the first four to five years of Batmans career. This title rotated in creative teams and time placement, but several stories directly relate to the events of Year One, especially the first arc Batman: Shaman . In 1996 and 99, ": null
    },
    {
        "Jeph Loeb": "jeph loeb"
    },
    {
        " and ": null
    },
    {
        "Tim Sale": "tim sale"
    },
    {
        " created  Batman: The Long Halloween  and  Batman: Dark Victory , two 13-issue maxiseries that recounted Batmans early years as a crime-fighter following the events of Millers original story and retold the origins of ": null
    },
    {
        "Two-Face": "two-face"
    },
    {
        " and ": null
    },
    {
        "Dick Grayson": "dick grayson"
    },
    {
        ". The Year One story was continued in the 2005 graphic novel  Batman: The Man Who Laughs , following up on Gordon informing Batman about the Joker, and thus recounting their first official encounter. Two other stories,  Batman and the Monster Men  and  Batman and the Mad Monk  tie into the same time period of Batmans career, filling in the gap between Year One and the Man Who Laughs. The comics  Robin: Year One  and  Batgirl: Year One  describe his sidekicks origin stories.       Two sequels titled  Batman: Year Two  and  Batman: Year Three  were released in 1987 and 1989.       After the critical failure of  Batman & Robin , several attempts were made to ": null
    },
    {
        "reboot": "reboot"
    },
    {
        " the ": null
    },
    {
        "Batman film franchise": "batman in film"
    },
    {
        " with an adaptation of Year One . ": null
    },
    {
        "Joss Whedon": "joss whedon"
    },
    {
        " and ": null
    },
    {
        "Joel Schumacher": "joel schumacher"
    },
    {
        " both pitched their own takes. In 2000, ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " hired ": null
    },
    {
        "Darren Aronofsky": "darren aronofsky"
    },
    {
        " to write and direct Batman: Year One. The film was to be written by Miller, who finished an early draft of the script.   The script, however, was a loose adaptation, as it kept most of the themes and elements from the graphic novel but shunned other conventions that were otherwise integral to the character.  It was shelved by the studio in 2001,  after an individual who claimed to have read Millers script published a negative review on  Aint It Cool News . In 2016, Miller stated the film was canceled because of creative differences between him and Aronofsky: It was the first time I worked on a Batman project with somebody whose vision of Batman was darker than mine. My Batman was too nice for him. We would argue about it, and Id say, Batman wouldnt do that, he wouldnt torture anybody .      In 2005, ": null
    },
    {
        "Christopher Nolan": "christopher nolan"
    },
    {
        " began his series, with the reboot film  Batman Begins , which draws inspiration from Year One and other stories. Batman Begins and its sequel  The Dark Knight  are set during the same timespan and adopt several elements directly from the graphic novel. Major characters like ": null
    },
    {
        "Commissioner Loeb": "gillian b. loeb"
    },
    {
        ", ": null
    },
    {
        "Detective Flass": "arnold john flass"
    },
    {
        " and ": null
    },
    {
        "Carmine The Roman Falcone": "carmine falcone"
    },
    {
        " are featured prominently in Batman Begins. Film critic ": null
    },
    {
        "Michael Dodd": "michael dodd"
    },
    {
        " argued that with each major motion picture focused on the Dark Knights origins, the odes and references to the Year One comic increased. Comparing  Mask of the Phantasm  with  Batman Begins  he noted that ...Phantasm was a Batman story with Year One elements, while Batman Begins was a Year One story with added features . Dodd, Michael,  , The Missing Slate.     In 2011, an ": null
    },
    {
        "animated adaptation": "batman: year one"
    },
    {
        " was released as a ": null
    },
    {
        "DC Universe Animated Original Movie": "dc universe animated original movies"
    },
    {
        ". It was produced by ": null
    },
    {
        "Bruce Timm": "bruce timm"
    },
    {
        ", co-directed by ": null
    },
    {
        "Lauren Montgomery": "lauren montgomery"
    },
    {
        " and ": null
    },
    {
        "Sam Liu": "sam liu"
    },
    {
        ".  It features the voices of ": null
    },
    {
        "Benjamin McKenzie": "benjamin mckenzie"
    },
    {
        " as Bruce Wayne/Batman, ": null
    },
    {
        "Bryan Cranston": "bryan cranston"
    },
    {
        " as ": null
    },
    {
        "James Gordon": "james gordon"
    },
    {
        ", ": null
    },
    {
        "Eliza Dushku": "eliza dushku"
    },
    {
        " as Selina Kyle/Catwoman, ": null
    },
    {
        "Katee Sackhoff": "katee sackhoff"
    },
    {
        " as ": null
    },
    {
        "Sarah Essen": "sarah essen gordon"
    },
    {
        ", ": null
    },
    {
        "Grey DeLisle": "grey delisle"
    },
    {
        " as Barbara Gordon, ": null
    },
    {
        "Jon Polito": "jon polito"
    },
    {
        " as Commissioner Loeb, ": null
    },
    {
        "Alex Rocco": "alex rocco"
    },
    {
        " as Carmine The Roman Falcone, and ": null
    },
    {
        "Jeff Bennett": "jeff bennett"
    },
    {
        " as Alfred Pennyworth.  The movie premiered at ": null
    },
    {
        "Comic-Con": "san diego comic-con international"
    },
    {
        ", with a Catwoman short shown in October.      The second half of the ": null
    },
    {
        "fourth season": "gotham"
    },
    {
        " of the Batman-based television series  Gotham  is inspired by Batman: Year One. ": null
    }
]