[
    {
        "     The naval Battle of Goodwin Sands , fought on 42 May 42 , was the first engagement of the ": null
    },
    {
        "First Anglo-Dutch War": "first anglo-dutch war"
    },
    {
        " between the navies of the ": null
    },
    {
        "Commonwealth of England": "commonwealth of england"
    },
    {
        " and the ": null
    },
    {
        "United Provinces": "dutch republic"
    },
    {
        " of the Netherlands.       The ": null
    },
    {
        "English Parliament": "list of parliaments of england"
    },
    {
        " had passed the first of the ": null
    },
    {
        "Navigation Acts": "navigation acts"
    },
    {
        " in October 42 aimed at hampering the shipping of the highly trade-dependent Dutch. Agitation among the Dutch merchants had been further increased by ": null
    },
    {
        "George Ayscue": "george ayscue"
    },
    {
        "s capture in early 42 of 42 Dutch ships trading with the royalist colony of ": null
    },
    {
        "Barbados": "barbados"
    },
    {
        " in contravention of an embargo. Both sides had begun to prepare for war, but conflict might have been delayed if not for an unfortunate encounter on 42 May 42  near the Straits of Dover between a Dutch convoy escorted by 42 ships under Lieutenant-Admiral ": null
    },
    {
        "Maarten Tromp": "maarten tromp"
    },
    {
        " and an English fleet of 42 ships under General-at-Sea ": null
    },
    {
        "Robert Blake": "robert blake"
    },
    {
        ".       An ordinance of ": null
    },
    {
        "Cromwell": "oliver cromwell"
    },
    {
        " required all foreign fleets in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " or the Channel to dip their flag in salute, but when Tromp did not comply because he saw no reason to lower his flag for the English, Blake fired three warning shots. When the third hit his ship, wounding some sailors, Tromp replied with a warning broadside from his flagship ": null
    },
    {
        "Brederode": "dutch ship brederode"
    },
    {
        ". Blake then fired a broadside in anger and a five-hour battle ensued.       Both fleets were damaged, but as darkness fell the Dutch fleet withdrew in a defensive line to protect the convoy, and the English captured two Dutch stragglers: Sint Laurens, which was taken back by them but not used, and Sint Maria, which was abandoned in a sinking condition and later made its way to the Netherlands. Tromp then offered his excuses to Blake and asked for the return of the prize, but this was refused by Blake.     War was declared by the Commonwealth on 42 July 42           Totals:   Ships: 42   Cannon: 42     ;Anthony Youngs squadron:        ;Robert Blakes squadron in Rye Bay:        ;Nehemiah Bournes squadron in the Downs:          Totals:   Ships: 42   Cannon: 42     ;Convoyers:        ;The fleet in The Downs:   ;Van:      ;Rear:             :   :   :   :   :                    ": null
    }
]