[
    {
        "            The Battle of Agincourt  was one of the English victories in the ": null
    },
    {
        "Hundred Years War": "Hundred Years War"
    },
    {
        ". It took place on 25 October 1415  near ": null
    },
    {
        "Azincourt": "Azincourt"
    },
    {
        ", in northern France. Englands unexpected victory against the numerically superior French army boosted English morale and prestige, crippled France, and started a new period of English dominance in the war.     After several decades of relative peace, the English had ": null
    },
    {
        "renewed their war effort": "Hundred Years War"
    },
    {
        " in 1415 amid the failure of negotiations with the French. In the ensuing campaign, many soldiers died from disease, and the English numbers dwindled; they tried to withdraw to ": null
    },
    {
        "English-held Calais": "Pale Of Calais"
    },
    {
        " but found their path blocked by a considerably larger French army. Despite the disadvantage, the following battle ended in an overwhelming tactical victory for the English.     King ": null
    },
    {
        "Henry V of England": "Henry V Of England"
    },
    {
        " led his troops into battle and participated in hand-to-hand fighting. King ": null
    },
    {
        "Charles VI of France": "Charles Vi Of France"
    },
    {
        " did not command the French army himself, as he suffered from psychotic illnesses and associated mental incapacity. Instead, the French were commanded by ": null
    },
    {
        "Constable": "Grand Constable Of France"
    },
    {
        " Charles dAlbret": "Charles I Of Albret"
    },
    {
        " and various prominent French noblemen of the ": null
    },
    {
        "Armagnac party": "Armagnac"
    },
    {
        ".     This battle is notable for the use of the ": null
    },
    {
        "English longbow": "English Longbow"
    },
    {
        " in very large numbers, with the English and ": null
    },
    {
        "Welsh": "Wales In The Late Middle Ages"
    },
    {
        " archers comprising nearly 80 percent of Henrys army.     Agincourt is one of Englands most celebrated victories and was one of the most important English triumphs in the Hundred Years War, along with the ": null
    },
    {
        "Battle of Crécy": "Battle Of Crécy"
    },
    {
        " and ": null
    },
    {
        "Battle of Poitiers": "Battle Of Poitiers"
    },
    {
        " . It forms the centrepiece of ": null
    },
    {
        "William Shakespeares": "William Shakespeare"
    },
    {
        "play  Henry V , written in 1599.       The Battle of Agincourt is well documented by at least seven contemporary accounts, three from eyewitnesses. The approximate location of the battle has never been disputed, and the site remains relatively unaltered after 600 years.     Immediately after the battle, Henry summoned the ": null
    },
    {
        "heralds": "Herald"
    },
    {
        "of the two armies who had watched the battle together with principal French herald Montjoie, and they settled on the name of the battle as Azincourt, after the nearest fortified place. Two of the most frequently cited accounts come from ": null
    },
    {
        "Burgundian": "Kingdom Of Burgundy"
    },
    {
        " sources, one from ": null
    },
    {
        "Jean Le Fèvre de Saint-Remy": "Jean Le Fèvre De Saint-Remy"
    },
    {
        " who was present at the battle, and the other from ": null
    },
    {
        "Enguerrand de Monstrelet": "Enguerrand De Monstrelet"
    },
    {
        ". The English eyewitness account comes from the anonymous Gesta Henrici Quinti, believed to have been written by a ": null
    },
    {
        "chaplain": "Chaplain"
    },
    {
        " in the Kings household who would have been in the ": null
    },
    {
        "baggage train": "Wagon Train"
    },
    {
        " at the battle. A recent re-appraisal of Henrys strategy of the Agincourt campaign incorporates these three accounts and argues that war was seen as a legal ": null
    },
    {
        "due process": "Due Process"
    },
    {
        " for solving the disagreement over claims to the French throne.              ": null
    },
    {
        "Henry V": "Henry V Of England"
    },
    {
        " invaded France following the failure of negotiations with the French. He claimed the title of King of France through his great-grandfather ": null
    },
    {
        "Edward III of England": "Edward Iii Of England"
    },
    {
        ", although in practice the English kings were generally prepared to renounce this claim if the French would acknowledge the English claim on ": null
    },
    {
        "Aquitaine": "Aquitaine"
    },
    {
        " and other French lands . He initially called a ": null
    },
    {
        "Great Council": "Magnum Concilium"
    },
    {
        " in the spring of 1414 to discuss going to war with France, but the lords insisted that he should negotiate further and moderate his claims. In the ensuing negotiations Henry said that he would give up his claim to the French throne if the French would pay the 1.6 million crowns outstanding from the ransom of ": null
    },
    {
        "John II": "John Ii Of France"
    },
    {
        " , and concede English ownership of the lands of ": null
    },
    {
        "Anjou": "Anjou"
    },
    {
        ", ": null
    },
    {
        "Brittany": "Duchy Of Brittany"
    },
    {
        ", ": null
    },
    {
        "Flanders": "County Of Flanders"
    },
    {
        ", ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        ", and ": null
    },
    {
        "Touraine": "Touraine"
    },
    {
        ", as well as ": null
    },
    {
        "Aquitaine": "Duchy Of Aquitaine"
    },
    {
        ". Henry would marry ": null
    },
    {
        "Catherine": "Catherine Of Valois"
    },
    {
        ", ": null
    },
    {
        "Charles VIs": "Charles Vi Of France"
    },
    {
        "young daughter, and receive a dowry of 2 million crowns.     The French responded with what they considered the generous terms of marriage with Catherine, a dowry of 600,000 crowns, and an enlarged Aquitaine. By 1415, negotiations had ground to a halt, with the English claiming that the French had mocked their claims and ridiculed Henry himself. In December 1414, the English ": null
    },
    {
        "parliament": "Parliament Of England"
    },
    {
        " was persuaded to grant Henry a double subsidy , a tax at twice the traditional rate, to recover his inheritance from the French. On 19 April 1415, Henry again asked the Great Council to sanction war with France, and this time they agreed.        Henrys army landed in northern France on 13 August 1415, carried by a fleet described by Shakespeare as a city on the inconstant billows dancing / For so appears this fleet majestical . It was often reported to comprise 1,500 ships, but was probably far smaller. ": null
    },
    {
        "Theodore Beck": "Theodore Beck"
    },
    {
        " also suggests that among Henrys army was the kings physician and a little band of surgeons .  ": null
    },
    {
        "Thomas Morstede": "Thomas Morstede"
    },
    {
        ", Henry Vs royal surgeon,  had previously been contracted by the king to supply a team of surgeons and makers of surgical instruments to take part in the Agincourt campaign. The army of about 12,000 men and up to 20,000 horses besieged the port of ": null
    },
    {
        "Harfleur": "Harfleur"
    },
    {
        ".  The ": null
    },
    {
        "siege": "Siege Of Harfleur"
    },
    {
        " took longer than expected. The town surrendered on 22 September, and the English army did not leave until 8 October. The campaign season was coming to an end, and the English army had suffered many casualties through disease. Rather than retire directly to England for the winter, with his costly expedition resulting in the capture of only one town, Henry decided to march most of his army through ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        " to the port of ": null
    },
    {
        "Calais": "Calais"
    },
    {
        ", the English stronghold in northern France, to demonstrate by his presence in the territory at the head of an army that his right to rule in the duchy was more than a mere abstract legal and historical claim. He also intended the manoeuvre as a deliberate provocation to battle aimed at ": null
    },
    {
        "the dauphin": "Louis, Dauphin Of France, Duke Of Guyenne"
    },
    {
        ", who had failed to respond to Henrys personal challenge to combat at Harfleur.     During the siege, the French had raised an army which assembled around ": null
    },
    {
        "Rouen": "Rouen"
    },
    {
        ". This was not strictly a ": null
    },
    {
        "feudal": "Feudal"
    },
    {
        " army, but an army paid through a system similar to that of the English. The French hoped to raise 9,000 troops, but the army was not ready in time to relieve Harfleur.     After Henry V marched to the north, the French moved to block them along the ": null
    },
    {
        "River Somme": "Somme River"
    },
    {
        ". They were successful for a time, forcing Henry to move south, away from Calais, to find a ": null
    },
    {
        "ford": "Ford"
    },
    {
        ". The English finally crossed the Somme south of ": null
    },
    {
        "Péronne": "Péronne, Somme"
    },
    {
        ", at ": null
    },
    {
        "Béthencourt": "Béthencourt-Sur-Somme"
    },
    {
        " and ": null
    },
    {
        "Voyennes": "Voyennes"
    },
    {
        " and resumed marching north.     Without a river obstacle to defend, the French were hesitant to force a battle. They shadowed Henrys army while calling a semonce des nobles,   calling on local nobles to join the army. By 24 October, both armies faced each other for battle, but the French declined, hoping for the arrival of more troops. The two armies spent the night of 24 October on open ground. The next day the French initiated negotiations as a delaying tactic, but Henry ordered his army to advance and to start a battle that, given the state of his army, he would have preferred to avoid, or to fight defensively: that was how ": null
    },
    {
        "Crécy": "Battle Of Crécy"
    },
    {
        " and the other famous longbow victories had been won. The English had very little food, had marched  in two and a half weeks, were suffering from sickness such as ": null
    },
    {
        "dysentery": "Dysentery"
    },
    {
        ", and were greatly outnumbered by well-equipped French men-at-arms. The French army blocked Henrys way to the safety of Calais, and delaying battle would only further weaken his tired army and allow more French troops to arrive.         The precise location of the battle is not known. It may be in the narrow strip of open land formed between the woods of ": null
    },
    {
        "Tramecourt": "Tramecourt"
    },
    {
        " and Azincourt . However, the lack of archaeological evidence at this traditional site has led to suggestions it was fought to the west of Azincourt. Sutherland In 2019, the historian ": null
    },
    {
        "Michael Livingston": "Michael Livingston"
    },
    {
        " also made the case for a site west of Azincourt, based on a review of sources and early maps.           Early on the 25th, Henry deployed his army  across a  part of the ": null
    },
    {
        "defile": "Defile"
    },
    {
        ". The army was organised into three  battles  or divisions, with the right wing led by ": null
    },
    {
        "Edward, Duke of York": "Edward, Duke Of York"
    },
    {
        ", the centre led by the king himself, and the left wing under Baron ": null
    },
    {
        "Thomas Camoys": "Thomas Camoys, Baron Camoys"
    },
    {
        ". The archers were commanded by Sir ": null
    },
    {
        "Thomas Erpingham": "Thomas Erpingham"
    },
    {
        ", one of Henrys most experienced household knights. It is likely that the English adopted their usual battle line of longbowmen on either flank, with men-at-arms and knights in the centre. They might also have deployed some archers in the centre of the line. The English men-at-arms in plate and mail were placed shoulder to shoulder four deep. The English and Welsh archers on the flanks drove pointed wooden ": null
    },
    {
        "stakes": "Archers Stake"
    },
    {
        ", or palings, into the ground at an angle to force ": null
    },
    {
        "cavalry": "Cavalry"
    },
    {
        " to veer off. This use of stakes could have been inspired by the ": null
    },
    {
        "Battle of Nicopolis": "Battle Of Nicopolis"
    },
    {
        " of 1396, where forces of the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " used the tactic against French cavalry.     The English made their ": null
    },
    {
        "confessions": "Sacrament Of Penance"
    },
    {
        " before the battle, as was customary. Henry, worried about the enemy launching surprise raids, and wanting his troops to remain focused, ordered all his men to spend the night before the battle in silence, on pain of having an ear cut off. He told his men that he would rather die in the coming battle than be captured and ": null
    },
    {
        "ransom": "Ransom"
    },
    {
        "ed.     Henry made a speech emphasising the justness of his cause, and reminding his army of previous great defeats the kings of England had inflicted on the French. The ": null
    },
    {
        "Burgundian": "Duchy Of Burgundy"
    },
    {
        " sources have him concluding the speech by telling his men that the French had boasted that they would cut off two fingers from the right hand of every archer, so that he could never draw a longbow again. Whether this was true is open to question; death was the normal fate of any soldier who could not be ransomed.       The French force was not only larger than that of the English, but their noble men-at-arms would have considered themselves superior to the large number of archers in the English army, whom the French considered relatively insignificant. For example, the ": null
    },
    {
        "chronicle": "Chronicle"
    },
    {
        "r Edmond de Dyntner stated that there were ten French nobles against one English , ignoring the archers completely. Several French accounts emphasise that the French leaders were so eager to defeat the English that they insisted on being in the first line; as one of the contemporary accounts put it: All the lords wanted to be in the ": null
    },
    {
        "vanguard": "Vanguard"
    },
    {
        ", against the opinion of the constable and the experienced knights.      The French were arrayed in three lines or battles. The first line was led by Constable dAlbret, ": null
    },
    {
        "Marshal": "Marshal Of France"
    },
    {
        " Boucicault": "Jean Le Maingre"
    },
    {
        ", and the ": null
    },
    {
        "Dukes of Orléans": "Charles, Duke Of Orléans"
    },
    {
        " and ": null
    },
    {
        "Bourbon": "John I, Duke Of Bourbon"
    },
    {
        ", with attached cavalry wings under the ": null
    },
    {
        "Count of Vendôme": "Louis, Count Of Vendôme"
    },
    {
        " and Sir Clignet de Brebant. The second line was commanded by the ": null
    },
    {
        "Dukes of Bar": "Edward Iii Of Bar"
    },
    {
        " and ": null
    },
    {
        "Alençon": "John I, Duke Of Alençon"
    },
    {
        " and the ": null
    },
    {
        "Count of Nevers": "Philip Ii, Count Of Nevers"
    },
    {
        ". The third line was under the ": null
    },
    {
        "Counts of Dammartin": "Counts Of Dammartin"
    },
    {
        " and Fauconberg. The Burgundian chronicler ": null
    },
    {
        "Jean de Wavrin": "Jean De Wavrin"
    },
    {
        " said there were 8,000 men-at-arms, 4,000 archers and 1,500 crossbowmen in the vanguard, with two wings of 600 and 800 mounted men-at-arms, and a main battle comprising as many knights, esquires and archers as in the vanguard , with the rearguard containing all of the rest of the men-at-arms .  The Herald of Berry gave figures of 4,800 men-at-arms in the first line, 3,000 men in the second line, with two wings containing 600 mounted men-at-arms each, and a total of 10,000 men-at-arms , Quoted in . but does not mention a third line.     Wavrin gives the total French army size as 50,000: They had plenty of archers and crossbowmen but nobody wanted to let them fire . The reason for this was that the site was so narrow that there was only enough room for the men-at-arms. Quoted in . A different source says that the French did not even deploy 4,000 of the best crossbowmen on the pretext they had no need of their help . Quoted in .       The field of battle was arguably the most significant factor in deciding the outcome. The recently ploughed land hemmed in by dense woodland favoured the English, both because of its narrowness, and because of the thick mud through which the French knights had to walk.     Accounts of the battle describe the French engaging the English men-at-arms before being rushed from the sides by the longbowmen as the ": null
    },
    {
        "mêlée": "Mêlée"
    },
    {
        " developed. The English account in the Gesta Henrici says: For when some of them, killed when battle was first joined, fall at the front, so great was the undisciplined violence and pressure of the mass of men behind them that the living fell on top of the dead, and others falling on top of the living were killed as well.      Although the French initially pushed the English back, they became so closely packed that they were described as having trouble using their weapons properly. The French monk of St. Denis says: Their vanguard, composed of about 5,000 men, found itself at first so tightly packed that those who were in the third rank could scarcely use their swords, Quoted in . and the Burgundian sources have a similar passage.     Recent heavy rain made the battle field very muddy, proving very tiring to walk through in full ": null
    },
    {
        "plate armour": "Plate Armour"
    },
    {
        ". The French monk of St. Denis describes the French troops as marching through the middle of the mud where they sank up to their knees. So they were already overcome with fatigue even before they advanced against the enemy . The deep, soft mud particularly favoured the English force because, once knocked to the ground, the heavily armoured French knights had a hard time getting back up to fight in the mêlée. Barker states that some knights, encumbered by their armour, actually drowned in their helmets.            On the morning of 25 October, the French were still waiting for additional troops to arrive. The ": null
    },
    {
        "Duke of Brabant": "Anthony, Duke Of Brabant"
    },
    {
        " , the ": null
    },
    {
        "Duke of Anjou": "Louis Ii Of Anjou"
    },
    {
        " , and the ": null
    },
    {
        "Duke of Brittany": "John Vi, Duke Of Brittany"
    },
    {
        " , were all marching to join the army.     For three hours after sunrise there was no fighting. Military textbooks of the time stated: Everywhere and on all occasions that foot soldiers march against their enemy face to face, those who march lose and those who remain standing still and holding firm win.  On top of this, the French were expecting thousands of men to join them if they waited. They were blocking Henrys retreat, and were perfectly happy to wait for as long as it took. There had even been a suggestion that the English would run away rather than give battle when they saw that they would be fighting so many French princes.     Henrys men were already very weary from hunger, illness and retreat. Apparently Henry believed his fleeing army would perform better on the defensive, but had to halt the retreat and somehow engage the French   before a defensive battle was possible.    This entailed abandoning his chosen position and pulling out, advancing, and then re-installing the long sharpened wooden stakes pointed outwards toward the enemy, which helped protect the longbowmen from cavalry charges.      The tightness of the terrain also seems to have restricted the planned deployment of the French forces. The French had originally drawn up a battle plan that had archers and crossbowmen in front of their men-at-arms, with a cavalry force at the rear specifically designed to fall upon the archers, and use their force to break them,  but in the event, the French archers and crossbowmen were deployed behind and to the sides of the men-at-arms . The cavalry force, which could have devastated the English line if it had attacked while they moved their stakes, charged only after the initial volley of arrows from the English. It is unclear whether the delay occurred because the French were hoping the English would launch a frontal assault , or whether the French mounted knights instead did not react quickly enough to the English advance. French chroniclers agree that when the mounted charge did come, it did not contain as many men as it should have; Gilles le Bouvier states that some had wandered off to warm themselves and others were walking or feeding their horses.       The French cavalry, despite being disorganised and not at full numbers, charged towards the longbowmen, but it was a disaster, with the French knights unable to outflank the longbowmen and unable to charge through the forest of sharpened stakes that protected the archers. ": null
    },
    {
        "John Keegan": "John Keegan"
    },
    {
        " argues that the longbows main influence on the battle at this point was injuries to horses: armoured only on the head, many horses would have become dangerously out of control when struck in the back or flank from the high-elevation, long-range shots used as the charge started. The mounted charge and subsequent retreat churned up the already muddy terrain between the French and the English. Juliet Barker quotes a contemporary account by a monk of ": null
    },
    {
        "St. Denis": "Saint Denis Basilica"
    },
    {
        " who reports how the wounded and panicking horses galloped through the advancing infantry, scattering them and trampling them down in their headlong flight from the battlefield.          The plate armour of the French men-at-arms allowed them to close the 1,000 yards or so to the English lines while being under what the French monk of Saint Denis described as a terrifying hail of arrow shot . A complete coat of plate was considered such good protection that shields were generally not used, although the Burgundian contemporary sources distinguish between Frenchmen who used shields and those who did not, and Rogers has suggested that the front elements of the French force used axes and shields. Modern historians are divided on how effective the longbows would have been against plate armour of the time. Modern test and contemporary accounts conclude that arrows could not penetrate the better quality steel armour, which became available to knights and men-at-arms of fairly modest means by the middle of the 14th century, but could penetrate the poorer quality ": null
    },
    {
        "wrought iron": "Wrought Iron"
    },
    {
        " armour Nicolle, D. . Poitiers 1356: The capture of a king . Osprey Publishing. Loades, M. . The longbow. Bloomsbury Publishing. Jones, P. N. . The metallography and relative effectiveness of arrowheads and armor during the Middle Ages. Materials characterization, 29, 111–117. Military History Monthly February 2016 Tobias Capwell on Agincourt, armour & arrows . Part 2  . Rogers suggested that the longbow could penetrate a wrought iron breastplate at short range and penetrate the thinner armour on the limbs even at . He considered a knight in the best-quality steel armour invulnerable to an arrow on the breastplate or top of the helmet, but vulnerable to shots hitting the limbs, particularly at close range. In any case, to protect themselves as much as possible from the arrows, the French had to lower their visors and bend their helmeted heads to avoid being shot in the face, as the eye- and air-holes in their helmets were among the weakest points in the armour. This head-lowered position restricted their breathing and their vision. Then they had to walk a few hundred yards through thick mud and a press of comrades while wearing armour weighing , gathering sticky clay all the way. Increasingly, they had to walk around or over fallen comrades.      The surviving French men-at-arms reached the front of the English line and pushed it back, with the longbowmen on the flanks continuing to shoot at point-blank range. When the archers ran out of arrows, they dropped their bows and using ": null
    },
    {
        "hatchet": "Hatchet"
    },
    {
        "s, ": null
    },
    {
        "swords": "Sword"
    },
    {
        "and the ": null
    },
    {
        "mallets": "Mallet"
    },
    {
        "they had used to drive their stakes in, attacked the now disordered, fatigued and wounded French men-at-arms massed in front of them. The French could not cope with the thousands of lightly armoured longbowmen assailants combined with the English men-at-arms. The impact of thousands of arrows, combined with the slog in heavy armour through the mud, the heat and difficulty breathing in plate armour with the visor down  , and the crush of their numbers meant the French men-at-arms could scarcely lift their weapons when they finally engaged the English line. The exhausted French men-at-arms were unable to get up after being knocked to the ground by the English. As the ": null
    },
    {
        "mêlée": "Melee"
    },
    {
        " developed, the French second line also joined the attack, but they too were swallowed up, with the narrow terrain meaning the extra numbers could not be used effectively. Rogers suggested that the French at the back of their deep formation would have been attempting to literally add their weight to the advance, without realising that they were hindering the ability of those at the front to manoeuvre and fight by pushing them into the English formation of lancepoints. After the initial wave, the French would have had to fight over and on the bodies of those who had fallen before them. In such a press of thousands of men, Rogers suggested that many could have suffocated in their armour, as was described by several sources, and which was also known to have happened in other battles.     The French men-at-arms were taken prisoner or killed in the thousands. The fighting lasted about three hours, but eventually the leaders of the second line were killed or captured, as those of the first line had been. The English Gesta Henrici described three great heaps of the slain around the three main English standards.   According to contemporary English accounts, Henry fought hand to hand. Upon hearing that his youngest brother ": null
    },
    {
        "Humphrey, Duke of Gloucester": "Humphrey, Duke Of Gloucester"
    },
    {
        " had been wounded in the groin, Henry took his household guard and stood over his brother, in the front rank of the fighting, until Humphrey could be dragged to safety. The king received an axe blow to the head, which knocked off a piece of the crown that formed part of his helmet.          The only French success was an attack on the lightly protected English baggage train, with Ysembart dAzincourt  seizing some of Henrys personal treasures, including a crown. Whether this was part of a deliberate French plan or an act of local ": null
    },
    {
        "brigandage": "Brigandage"
    },
    {
        " is unclear from the sources. Certainly, dAzincourt was a local knight but he might have been chosen to lead the attack because of his local knowledge and the lack of availability of a more senior soldier. In some accounts the attack happened towards the end of the battle, and led the English to think they were being attacked from the rear. Barker, following the Gesta Henrici, believed to have been written by an English chaplain who was actually in the baggage train, concluded that the attack happened at the start of the battle.       Regardless of when the baggage assault happened, at some point after the initial English victory, Henry became alarmed that the French were regrouping for another attack. The Gesta Henrici places this after the English had overcome the onslaught of the French men-at-arms and the weary English troops were eyeing the French rearguard . Le Fèvre and Wavrin similarly say that it was signs of the French rearguard regrouping and marching forward in battle order which made the English think they were still in danger. A slaughter of the French prisoners ensued. It seems it was purely a decision of Henry, since the English knights found it contrary to ": null
    },
    {
        "chivalry": "Chivalry"
    },
    {
        ", and contrary to their interests to kill valuable hostages for whom it was commonplace to ask ": null
    },
    {
        "ransom": "Ransom"
    },
    {
        ". Henry threatened to hang whoever did not obey his orders.     In any event, Henry ordered the slaughter of what were perhaps several thousand French prisoners, sparing only the highest ranked . According to most chroniclers, Henrys fear was that the prisoners would realise their advantage in numbers, rearm themselves with the weapons strewn about the field and overwhelm the exhausted English forces. Contemporary chroniclers did not criticise him for it. In his study of the battle ": null
    },
    {
        "John Keegan": "John Keegan"
    },
    {
        " argued that the main aim was not to actually kill the French knights but rather to terrorise them into submission and quell any possibility they might resume the fight, which would probably have caused the uncommitted French reserve forces to join the fray, as well. Such an event would have posed a risk to the still-outnumbered English and could have easily turned a stunning victory into a mutually destructive defeat, as the English forces were now largely intermingled with the French and would have suffered grievously from the arrows of their own longbowmen had they needed to resume shooting. Keegan also speculated that due to the relatively low number of archers actually involved in killing the French knights , together with the refusal of the English knights to assist in a duty they saw as distastefully unchivalrous, and combined with the sheer difficulty of killing such a large number of prisoners in such a short space of time, the actual number of French prisoners put to death may not have been substantial before the French reserves fled the field and Henry rescinded the order.       The lack of reliable sources makes it impossible to give a precise figure for the French and English ": null
    },
    {
        "casualties": "Casualty"
    },
    {
        " . The French sources all give 4,000–10,000 French dead, with up to 1,600 English dead. The lowest ratio in these French sources has the French losing six times more men than the English. It has been possible to name at least 500 individuals from the French army killed in the battle and over 300 prisoners. Curry & Mercer , p. 165     English claims range from 1,500 to 11,000 for the French dead, with English dead put at no more than 100. All figures on number of dead from table in . Barker identifies from the available records at least 112 Englishmen killed in the fighting, including ": null
    },
    {
        "Edward of Norwich, 2nd Duke of York": "Edward Of Norwich, 2Nd Duke Of York"
    },
    {
        ", a grandson of ": null
    },
    {
        "Edward III": "Edward Iii Of England"
    },
    {
        ". One widely used estimate puts the English casualties at around 450, a significant number in an army of about 8,500, but far fewer than the thousands the French lost, nearly all of whom were killed or captured. Using the lowest French estimate of their own dead of 4,000 would imply a ratio of nearly 9 to 1 in favour of the English, or over 10 to 1 if the prisoners are included. Casualty estimates from the Religeux of St Denis and Jean Juvenal des Ursins given in . Modern historians ": null
    },
    {
        "Anne Curry": "Anne Curry"
    },
    {
        " and ": null
    },
    {
        "Jonathan Sumption": "Jonathan Sumption"
    },
    {
        " estimate the total French deaths at about 6,000.     The French suffered heavily. Three ": null
    },
    {
        "duke": "Duke"
    },
    {
        "s, at least eight ": null
    },
    {
        "count": "Count"
    },
    {
        "s, a ": null
    },
    {
        "viscount": "Viscount"
    },
    {
        ", and an ": null
    },
    {
        "archbishop": "Archbishop"
    },
    {
        " died, along with numerous other nobles. Of the great royal office holders, France lost her Constable, Admiral, Master of the Crossbowmen and prévôt of the marshals. The  bailli s of nine major northern towns were killed, often along with their sons, relatives and supporters. In the words of Juliet Barker, the battle cut a great swath through the natural leaders of French society in ": null
    },
    {
        "Artois": "County Of Artois"
    },
    {
        ", ": null
    },
    {
        "Ponthieu": "Ponthieu"
    },
    {
        ", ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        ", ": null
    },
    {
        "Picardy": "Picardy"
    },
    {
        ".  Estimates of the number of prisoners vary between 700 and 2,200, amongst them the ": null
    },
    {
        "Duke of Orléans": "Charles, Duc Dorléans"
    },
    {
        " and ": null
    },
    {
        "Jean Le Maingre": "Jean Le Maingre"
    },
    {
        " , ": null
    },
    {
        "Marshal of France": "Marshal Of France"
    },
    {
        ".     Although the victory had been militarily decisive, its impact was complex. It did not lead to further English conquests immediately as Henrys priority was to return to England, which he did on 16 November, to be received in ": null
    },
    {
        "triumph": "Roman Triumph"
    },
    {
        " in London on the 23rd. Henry returned a conquering hero, seen as blessed by God in the eyes of his subjects and European powers outside France. It established the legitimacy of the ": null
    },
    {
        "Lancastrian monarchy": "House Of Lancaster"
    },
    {
        " and the future campaigns of Henry to pursue his rights and privileges in France. Other benefits to the English were longer term. Very quickly after the battle, the fragile truce between the ": null
    },
    {
        "Armagnac": "Armagnac"
    },
    {
        " and ": null
    },
    {
        "Burgundian": "Burgundian"
    },
    {
        " factions broke down. The brunt of the battle had fallen on the Armagnacs and it was they who suffered the majority of senior casualties and carried the blame for the defeat. The Burgundians seized on the opportunity and within 10 days of the battle had mustered their armies and marched on Paris. This lack of unity in France allowed Henry eighteen months to prepare militarily and politically for a renewed campaign. When that campaign took place, it was made easier by the damage done to the political and military structures of Normandy by the battle.         Notable casualties  include:      Leading officers:   ": null
    },
    {
        "Charles I dAlbret": "Charles Dalbret"
    },
    {
        ", ": null
    },
    {
        "Count of Dreux": "Count Of Dreux"
    },
    {
        ", the ": null
    },
    {
        "Constable of France": "Constable Of France"
    },
    {
        " Jacques de Châtillon de Dampière": "Jacques De Châtillon De Dampière"
    },
    {
        ", Lord of Dampierre, the ": null
    },
    {
        "Admiral of France": "Admiral Of France"
    },
    {
        " David de Rambures": "David De Rambures"
    },
    {
        ", the Grand ": null
    },
    {
        "Master of Crossbowmen": "Master Of Crossbowmen"
    },
    {
        "   Guichard Dauphin, Master of the Royal Household     Three dukes:   ": null
    },
    {
        "Antoine of Burgundy": "Antoine, Duke Of Brabant"
    },
    {
        ", ": null
    },
    {
        "Duke of Brabant and Limburg": "Duke Of Brabant"
    },
    {
        ", and ": null
    },
    {
        "consort": "Elisabeth, Duchess Of Luxembourg"
    },
    {
        " Duke of Luxembourg": "Duke Of Luxembourg"
    },
    {
        "    John I": "John I Of Alençon"
    },
    {
        ", ": null
    },
    {
        "Duke of Alençon": "Duke Of Alençon"
    },
    {
        "-": null
    },
    {
        "Perche": "Count Of Perche"
    },
    {
        ", the second-in-command after dAlbret.   ": null
    },
    {
        "Edward III": "Edward Iii Of Bar"
    },
    {
        ", ": null
    },
    {
        "Duke of Bar": "Duke Of Bar"
    },
    {
        "     Six counts :   ": null
    },
    {
        "Philip of Burgundy": "Philip Ii, Count Of Nevers"
    },
    {
        ", ": null
    },
    {
        "Count of Nevers": "Count Of Nevers"
    },
    {
        " and ": null
    },
    {
        "Rethel": "Counts And Dukes Of Rethel"
    },
    {
        "   Frederick of Lorraine": "Frederick Of Lorraine, Count Of Vaudemont"
    },
    {
        ", ": null
    },
    {
        "Count of Vaudémont": "Count Of Vaudémont"
    },
    {
        "    Robert of Bar": "Robert Of Bar, Count Of Marle And Soissons"
    },
    {
        ", Count of Marle and ": null
    },
    {
        "Soissons": "Count Of Soissons"
    },
    {
        " .   John VI, ": null
    },
    {
        "Count of Roucy": "Count Of Roucy"
    },
    {
        ",   Edward II, Count of Grandpré   Henry II, Count of Blâmont     and some 90 bannerets and others, including:   Jean de Montaigu, ": null
    },
    {
        "Archbishop of Sens": "Archbishop Of Sens"
    },
    {
        " John of Bar": "John Of Bar"
    },
    {
        ", Lord of Puisaye   ": null
    },
    {
        "Jean I de Croÿ": "Jean I De Croÿ"
    },
    {
        ", Lord of Croÿ-dAraines   Jean de Béthune, Lord of Marueil   Gallois de Fougières, ": null
    },
    {
        "Provost Marshal": "Provost Marshal"
    },
    {
        ", commemorated as the first French ": null
    },
    {
        "gendarme": "Gendarme"
    },
    {
        " to lose his life in battle. Gilliot   ": null
    },
    {
        "Jean V de Hangest": "Jean V De Hangest"
    },
    {
        " – Consular to the ": null
    },
    {
        "Grand Chamberlain of France": "Grand Chamberlain Of France"
    },
    {
        " Jean IV de Noyelles": "Jean Iv De Noyelles"
    },
    {
        ", Seigneur de Calonne, de Sailly, de Ricouart, Vicomte de Langle, Chambellan du Duc   ": null
    },
    {
        "Jan I van Brederode": "Jan I Van Brederode"
    },
    {
        "       Notable casualties included:   ": null
    },
    {
        "Edward of Norwich, 2nd Duke of York": "Edward Of Norwich, 2Nd Duke Of York"
    },
    {
        " Rosemary Horrox, ‘Edward, second duke of York ’, Oxford Dictionary of National Biography, Oxford University Press, 2004    ": null
    },
    {
        "Michael de la Pole, 3rd Earl of Suffolk": "Michael De La Pole, 3Rd Earl Of Suffolk"
    },
    {
        " Simon Walker, ‘Pole, Michael de la, second earl of Suffolk ’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2008    ": null
    },
    {
        "Dafydd Gam": "Dafydd Gam"
    },
    {
        " Welsh hero who reputedly saved Henry Vs life at Agincourt T. F. Tout, ‘Dafydd Gam ’, rev. R. R. Davies, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2008        Among the circa 1,500 prisoners taken by the English, were the following French notables: ": null
    },
    {
        "Jean Le Maingre ": "Jean Le Maingre"
    },
    {
        ", the ": null
    },
    {
        "Marshal of France": "Marshal Of France"
    },
    {
        ".   ": null
    },
    {
        "Charles of Artois": "Charles Of Artois, Count Of Eu"
    },
    {
        " , the French Lieutenant of Normandy and Guyenne.   ": null
    },
    {
        "John of Bourbon": "John I, Duke Of Bourbon"
    },
    {
        " , probably the greatest lord of southern France   ": null
    },
    {
        "Charles of Orleans": "Charles, Duke Of Orleans"
    },
    {
        " , a great lord of central France, titular head of the Armagnac party. .   ": null
    },
    {
        "Louis de Bourbon": "Louis, Count Of Vendôme"
    },
    {
        "    Arthur de Richemont": "Arthur De Richemont"
    },
    {
        ", brother of ": null
    },
    {
        "John VI, Duke of Brittany": "John Vi, Duke Of Brittany"
    },
    {
        ", step-brother of Henry V .   ": null
    },
    {
        "John VII, Count of Harcourt": "John Vii, Count Of Harcourt"
    },
    {
        ", holder of the largest fiefs in Normandy, close relative of the Capetians through his mother and wife       ": null
    },
    {
        "Anne Curry": "Anne Curry"
    },
    {
        " in her 2005 book Agincourt: A New History, argues that the French army was about 12,000 strong, and the English army about 9,000, giving proportions of four to three. By contrast, ": null
    },
    {
        "Juliet Barker": "Juliet Barker"
    },
    {
        " in her book Agincourt: The King, the Campaign, the Battle argues the English and Welsh were outnumbered at least four to one and possibly as much as six to one . She suggests figures of about 6,000 for the English and 36,000 for the French, based on the Gesta Henricis figures of 5,000 archers and 900 men-at-arms for the English, and ": null
    },
    {
        "Jean de Wavrins": "Jean De Wavrin"
    },
    {
        "statement that the French were six times more numerous than the English . The 2009 Encyclopædia Britannica uses the figures of about 6,000 for the English and 20,000 to 30,000 for the French. The 1911 Britannica use somewhat different figures of 6,000 archers, 1,000 men-at-arms and a few thousands of other foot for the English, with the French outnumbering them by at least four times .     While not necessarily agreeing with the exact numbers Curry uses, Bertrand Schnerb, a professor of medieval history at the University of Lille, states the French probably had 12,000–15,000 troops. Ian Mortimer, in his 2009 book 1415: Henry Vs Year of Glory, notes how Curry minimises French numbers and maximises English numbers , but agrees that previous estimates have exaggerated the odds, and suggests that the most extreme imbalance which is credible is fifteen thousand French troops against 8,100 English: a ratio of about two-to-one .     However, Clifford J. Rogers, professor of history at the United States Military Academy at West Point, has recently argued that archival records are too incomplete to substantially change his view that the English were outnumbered about 4–1. Juliet Barker also disagrees with Currys arguments in the acknowledgements section of her 2005 book on Agincourt, saying: Surviving administrative records on both sides, but especially the French, are simply too incomplete to support assertion that nine thousand English were pitted against an army only twelve thousand strong. And if the differential really was as low as three to four then this makes a nonsense of the course of the battle as described by eyewitnesses and contemporaries.      Those supporting a greater imbalance have generally put more store by contemporary accounts. The Gesta Henrici gives plausible figures for the English of 5,000 archers and 900 men-at-arms, but Mortimer notes it is wildly inaccurate in stating the English were outnumbered 30–1, and there have also been doubts as to how much it was written as propaganda for Henry V. The proportions also seem incorrect, as from surviving records we know that Henry set out with about four times as many archers as men-at-arms, not five and a half times as many. Those who have supported the Gesta figures for the English army have generally thought that although the English army may have left Harfleur with eight or nine thousand men, it is plausible that after weeks of campaigning and disease in hostile territory they would have lost two or three thousand fighting men; however Mortimer states: Despite the trials of the march, Henry had lost very few men to illness or death; and we have independent testimony that no more than 160 had been captured on the way.      As Mortimer notes, the Burgundian numbers for the size of the French vanguard of 8,000 men-at-arms in the vanguard with 1,400 men-at-arms in the wings correspond roughly with the figures of ten thousand men-at-arms recorded by the duke of Berrys herald. The Burgundians also recorded 4,000 archers and 1,500 crossbowmen in the vanguard , which would suggest fourteen or fifteen thousand fighting men . The Burgundians actually give the total size of the French army as an implausible 50,000, and the numbers they use do not correspond closely to the odds they describe. Using very similar numbers, Jean Le Fevre states that the English were outnumbered 3–1, whereas Wavrin states that the English were outnumbered 6–1.     One particular cause of confusion may have been the number of servants on both sides. Mortimer suggests that because there were a much higher proportion of men-at-arms on the French side, the number of non-combatants was much higher. Each man-at-arms could be expected to have a page, who would have ridden one of his spare horses. If the French army had an extra 10,000 mounted men , then the English probably did see an army about three times the size of their own fighting force .     It is open to debate whether these should all be counted as non-combatants; Rogers accepts that the French probably had about 10,000 men-at-arms, but explicitly includes one gros valet per French man-at-arms in his calculation of the odds.          The battle remains an important symbol in popular culture. Some notable examples are listed below.     Soon after the English victory at Agincourt, a number of popular folk songs were created about the battle, the most famous being the ": null
    },
    {
        "Agincourt Carol": "Agincourt Carol"
    },
    {
        " , produced in the first half of the 15th century. Other ballads followed, including ": null
    },
    {
        "King Henry Fifths Conquest of France": "King Henry Fifths Conquest Of France"
    },
    {
        " , raising the popular prominence of particular events mentioned only in passing by the original chroniclers, such as the gift of tennis balls before the campaign.       The most famous cultural depiction of the battle today is ": null
    },
    {
        "William Shakespeares": "William Shakespeare"
    },
    {
        "  Henry V , written in 1599. The play focuses on the pressures of kingship, the tensions between how a king should appear – chivalric, honest, and just – and how a king must sometimes act – ": null
    },
    {
        "Machiavelli": "Machiavelli"
    },
    {
        "an and ruthless. Shakespeare illustrates these tensions by depicting Henrys decision to kill some of the French prisoners, whilst attempting to justify it and distance himself from the event. This moment of the battle is portrayed both as a break with the traditions of chivalry and as key example of the paradox of kingship.     Shakespeares depiction of the battle also plays on the theme of modernity. He contrasts the modern, English king and his army with the medieval, chivalric, older model of the French.     Shakespeares play presented Henry as leading a truly English force into battle, playing on the importance of the link between the monarch and the common soldiers in the fight. The original play does not, however, feature any scenes of the actual battle itself, leading critic Rose Zimbardo to characterise it as full of warfare, yet empty of conflict.      The play introduced the famous ": null
    },
    {
        "St Crispins Day Speech": "St Crispins Day Speech"
    },
    {
        ", considered one of Shakespeares most heroic speeches, which Henry delivers movingly to his soldiers just before the battle, urging his band of brothers to stand together in the forthcoming fight. Critic David Margolies describes how it oozes honour, military glory, love of country and self-sacrifice , and forms one of the first instances of English literature linking solidarity and comradeship to success in battle. Partially as a result, the battle was used as a metaphor at the beginning of the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ", when the ": null
    },
    {
        "British Expeditionary Forces": "British Expeditionary Force"
    },
    {
        "attempts to stop the German advances were widely likened to it.       Shakespeares version of the battle of Agincourt has been turned into several minor and two major films. The latter, each titled Henry V, star ": null
    },
    {
        "Laurence Olivier": "Laurence Olivier"
    },
    {
        " in ": null
    },
    {
        "1944": "Henry V"
    },
    {
        " and ": null
    },
    {
        "Kenneth Branagh": "Kenneth Branagh"
    },
    {
        " in ": null
    },
    {
        "1989": "Henry V"
    },
    {
        ". Made just prior to the invasion of Normandy, Oliviers rendition gives the battle what Sarah Hatchuel has termed an exhilarating and heroic tone, with an artificial, cinematic look to the battle scenes. Branaghs version gives a longer, more ": null
    },
    {
        "realist": "Realism"
    },
    {
        " portrayal of the battle itself, drawing on both historical sources and images from the ": null
    },
    {
        "Vietnam": "Vietnam War"
    },
    {
        " and ": null
    },
    {
        "Falkland War": "Falkland War"
    },
    {
        "s.     In his 2007 film adaptation, director Peter Babakitis uses digital effects to exaggerate realist features during the battle scenes, producing a more  avant-garde  interpretation of the fighting at Agincourt. The battle also forms a central component of the 2019 Netflix film ": null
    },
    {
        "The King": "The King"
    },
    {
        " .       In March 2010, a mock trial of Henry V for the crimes associated with the slaughter of the prisoners was held in Washington, D.C., drawing from both the historical record and Shakespeares play. Participating as judges were Justices ": null
    },
    {
        "Samuel Alito": "Samuel Alito"
    },
    {
        " and ": null
    },
    {
        "Ruth Bader Ginsburg": "Ruth Bader Ginsburg"
    },
    {
        ". The trial ranged widely over whether there was just cause for war and not simply the prisoner issue. Although an audience vote was too close to call , Henry was unanimously found guilty by the court on the basis of evolving standards of civil society .  link to video                    There is a modern museum in Azincourt village dedicated to the battle. ": null
    }
]