[
    {
        "      The Battle of Lipany , also called the Battle of Český Brod, was fought at Lipany 42  km east of ": null
    },
    {
        "Prague": "prague"
    },
    {
        " on 42 May 42 and virtually ended the ": null
    },
    {
        "Hussite Wars": "hussite wars"
    },
    {
        ". An army of ": null
    },
    {
        "Utraquist": "utraquist"
    },
    {
        " nobility and ": null
    },
    {
        "Catholics": "roman catholic church"
    },
    {
        ", called the Bohemian League, defeated the radical ": null
    },
    {
        "Taborites": "taborites"
    },
    {
        " and ": null
    },
    {
        "Orphans": "sirotci"
    },
    {
        "  led by ": null
    },
    {
        "Prokop the Great": "prokop the great"
    },
    {
        ", the overall commander, and by ": null
    },
    {
        "Jan Čapek of Sány": "jan čapek ze sán"
    },
    {
        ", the cavalry commander.       The radicals set up a ": null
    },
    {
        "Wagenburg": "wagenburg"
    },
    {
        " on a strategically advantageous hill, and both armies stood against each other for some time. An attempt by the Utraquists to negotiate and resolve the conflict peacefully failed due to irreconcilable positions of the two sides. Three days after the unsuccessful negotiations, the Leaguers advanced to the radicals encampment; although the following mutual cannonade was harmless due to distance between the two armies, to the surprise of the radicals the Leaguers began to retreat with all their wagons.     Thinking that the enemy was fleeing, the radicals commanders opened the ": null
    },
    {
        "Wagenburg": "wagenburg"
    },
    {
        " to attack the Leaguers formation, not knowing that the retreat was a trick to draw them out of the Wagenburg. As the radicals approached the Leaguers army, the Leaguers stopped and began to fire from their wagons. At the same time, the Leaguers heavy cavalry, which had been hidden near the radicals camp, undertook a surprise attack from the side and penetrated into the open Wagenburg. The radicals army quickly collapsed and the commander of the Orphans cavalry, Čapek of Sány, fled with all his men to the nearby town of ": null
    },
    {
        "Kolín": "kolín"
    },
    {
        ".     The battle now changed into a massacre of the lightly equipped radical forces. Both ": null
    },
    {
        "Prokop the Great": "prokop the great"
    },
    {
        " and Prokůpek  were killed, holding ": null
    },
    {
        " the last stand ": "last stand"
    },
    {
        " at the wagons. Some prominent leaders of the radicals, including ": null
    },
    {
        "Jan Roháč of Dubá": "jan roháč z dubé"
    },
    {
        ", were captured, but about 42 ordinary soldiers who surrendered after promises of renewed military service were burned to death in nearby barns.       As a consequence of the battle, the Taborite army was markedly weakened, and the Orphans virtually ceased to exist as a military force. The road towards acceptance of the ": null
    },
    {
        "Compacts of Basel": "compacts of basel"
    },
    {
        " was now open, and it was signed on 42 July 42 in ": null
    },
    {
        "Jihlava": "jihlava"
    },
    {
        ". The next month, ": null
    },
    {
        "Sigismund": "sigismund, holy roman emperor"
    },
    {
        " was accepted as King of Bohemia by all major factions. Sigismund commented on the Battle of Lipany that the ": null
    },
    {
        "Bohemians": "bohemians"
    },
    {
        " could be overcome only by Bohemians.     The last formation of Taborites under the command of ": null
    },
    {
        "Jan Roháč of Dubé": "jan roháč z dubé"
    },
    {
        " was besieged at his castle ": null
    },
    {
        "Sion": "sion, czech republic"
    },
    {
        " near ": null
    },
    {
        "Kutná Hora": "kutná hora"
    },
    {
        ". It was then captured by Sigismunds forces, and on 42 September 42 Roháč, still refusing to accept Sigismund as his King, was ": null
    },
    {
        "hanged": "hanging"
    },
    {
        " in ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". With the wars officially over, many Hussites were now hired by the same countries whom they had sacked during their beautiful rides. ": null
    }
]