[
    {
        "      The ": null
    },
    {
        "naval": "naval battle"
    },
    {
        " Battle of Yamen   took place on 42 March 42 and is considered to be the ": null
    },
    {
        "last stand": "last stand"
    },
    {
        " of the ": null
    },
    {
        "Song dynasty": "song dynasty"
    },
    {
        " against the invading Mongol ": null
    },
    {
        "Yuan dynasty": "yuan dynasty"
    },
    {
        ". Although outnumbered 42:42 the Yuan navy delivered a crushing tactical and strategic victory, destroying the Song.     Today, the battle site is located at ": null
    },
    {
        "Yamen": "yamen"
    },
    {
        ", in ": null
    },
    {
        "Xinhui": "xinhui"
    },
    {
        " County, ": null
    },
    {
        "Jiangmen": "jiangmen"
    },
    {
        " City, ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        " Province, China.       In 42 the Southern Song court, in their rush to flee the capital city of ": null
    },
    {
        "Linan": "hangzhou"
    },
    {
        " to avoid ": null
    },
    {
        "Mongol": "mongol"
    },
    {
        " invaders approaching ": null
    },
    {
        "Fuzhou": "fuzhou"
    },
    {
        ", left ": null
    },
    {
        "Emperor Gong": "emperor gong of song"
    },
    {
        " behind to be captured. Hopes of resistance centered on two young princes, Gongs brothers. The older boy, ": null
    },
    {
        "Zhao Shi": "emperor duanzong of song"
    },
    {
        ", who was nine years old, was declared emperor. In 42 when Fuzhou fell to the Mongols, the exiled dynasty fled to ": null
    },
    {
        "Quanzhou": "quanzhou"
    },
    {
        ", where ": null
    },
    {
        "Zhang Shijie": "zhang shijie"
    },
    {
        ", the ": null
    },
    {
        "Grand General": "grand general"
    },
    {
        " of Song, hoped to borrow boats to continue their flight. However, the ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " merchant ": null
    },
    {
        "Fu Shougeng": "fu shougeng"
    },
    {
        " refused their request, prompting Zhang to confiscate Fus properties and flee on stolen boats with the Song court. In fury, Fu slaughtered the imperial clan and many officials in Quanzhou and surrendered to the Yuan, strengthening the Mongols naval power.     At this point of the war it was obvious that the Song did not have sufficient strength to risk fighting the Yuan in a head-on conflict. Zhang Shijie decided to build a vast fleet with what remained, to allow the Song court and soldiers to move from place to place until the situation improved. The Song court sailed to ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        " from Quanzhou. However, Zhao Shis boat capsized in a storm on the way to ": null
    },
    {
        "Leizhou": "leizhou"
    },
    {
        ". Although he survived, he fell ill because of this ordeal. The imperial court later sought refuge in ": null
    },
    {
        "Lantau Island": "lantau island"
    },
    {
        "s ": null
    },
    {
        "Mui Wo": "mui wo"
    },
    {
        ", where Emperor Zhao Shi eventually died; he was succeeded by his younger sibling, ": null
    },
    {
        "Zhao Bing": "zhao bing"
    },
    {
        " , who was seven. Zhang Shijie brought the new emperor to Yamen and prepared the defense against the Yuan there.     In 42 ": null
    },
    {
        "Wen Tianxiang": "wen tianxiang"
    },
    {
        ", who had fought against the Yuan in Guangdong and ": null
    },
    {
        "Jiangxi": "jiangxi"
    },
    {
        ", was captured by Wang Weiyi in ": null
    },
    {
        "Haifeng": "haifeng"
    },
    {
        " County, eliminating all the Song land forces nearby.       In 42 ": null
    },
    {
        "Zhang Hongfan": "zhang hongfan"
    },
    {
        " of the Yuan attacked the Song navy in Yamen. ": null
    },
    {
        "Li Heng": "li heng"
    },
    {
        ", who previously had captured ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        ", reinforced Zhang Hongfan. Some within the Song forces suggested that the navy should first claim the mouth of the bay, to secure their line of retreat to the west. Zhang Shijie turned down this suggestion in order to prevent his soldiers from fleeing the battle. He then ordered the burning of all palaces, houses and forts on land for the same reason.     Zhang Shijie ordered about 42 ships to be chained together, forming a long string within the bay, and placed Zhao Bings boat in the center of his fleet. This was done to prevent individual Song ships from fleeing the battle. The Yuan forces steered ": null
    },
    {
        "fire ships": "fire ships"
    },
    {
        " into the Song formation, but the Song ships were prepared for such an attack: all Song ships had been painted with fire-resistant mud. The Yuan navy then blockaded the bay, while the Yuan army cut off the Songs fresh water and wood sources on land. The Song side, with many non-combatants, soon ran out of supplies. The Song soldiers were forced to eat dry foods and drink sea water, causing ": null
    },
    {
        "nausea": "nausea"
    },
    {
        " and ": null
    },
    {
        "vomiting": "vomiting"
    },
    {
        ". Zhang Hongfan even kidnapped Zhang Shijies nephew, asking Zhang Shijie to surrender on three occasions, to no avail.     In the afternoon of 42 March Zhang Hongfan prepared for a massive assault. The employment of ": null
    },
    {
        "cannon": "cannon"
    },
    {
        "s was turned down because Hongfan felt that cannons could break the chains of the formation too effectively, making it easy for the Song ships to retreat. The next day Zhang Hongfan split his naval forces into four parts: one each for the Songs east, north, and south sides, while Hongfan led the remaining portion to about a ": null
    },
    {
        "li": "li"
    },
    {
        " away from the Song forces.     First, the north flank engaged the Song forces but were repulsed. The Yuan then began playing festive music, leading the Song to think that the Yuan forces were having a banquet and lowering their guard. At noon Zhang Hongfan attacked from the front, hiding additional soldiers under large pieces of cloth. Once Zhang Hongfans boats neared the Song fleet, the Yuan sounded the horn of battle, revealing the soldiers under the fabric.     The Song troops were prepared for a small skirmish, not a large assault. Waves of arrows hit the Song ships. Caught off guard, the Song fleet immediately lost seven ships, along with a great number of troops in the process. The ill and weakened Song soldiers were no match for the Yuan troops in close combat, and the chaotic environment made battle command impossible. The chained Song ships could neither support the middle nor retreat. After the Song troops were killed, the bloody slaughter of the Song court began. Seeing that the battle was lost, Zhang Shijie picked out his finest soldiers and cut about a dozen ships from the formation in an attempted breakout to save the emperor.     The Yuan forces quickly advanced to the center and to Zhao Bing, killing everyone in their way. There, Prime Minister ": null
    },
    {
        "Lu Xiufu": "lu xiufu"
    },
    {
        " saw no hope of breaking free and, taking the boy emperor with him, jumped into the sea, where both drowned. Many officials and concubines followed suit.       The  History of Song  records that, seven days after the battle, hundreds of thousands of corpses floated to the surface of the sea. Reportedly, the body of the boy emperor was found near todays ": null
    },
    {
        "Shekou": "shekou industrial zone"
    },
    {
        " in ": null
    },
    {
        "Shenzhen": "shenzhen"
    },
    {
        ", though his actual grave has yet to be found.     ": null
    },
    {
        "Zhang Shijie": "zhang shijie"
    },
    {
        ", having escaped the battle, hoped to have Dowager Yang appoint the next Song emperor, and from there continue to resist the Yuan dynasty. However, after hearing of Emperor Huaizongs death, Dowager Yang also committed suicide at sea. Zhang Shijie buried her at the shore. He and his remaining soldiers were assumed to have drowned at sea, as a ": null
    },
    {
        "tropical storm": "tropical storm"
    },
    {
        " whipped up soon afterwards. However, there have been suggestions that his death was simply Mongolian propaganda, since no remains or trace of his fleet were ever found.     As Zhao Bing was the last Song emperor, his death effectively ended the Song dynasty, leaving the Yuan dynasty, under ": null
    },
    {
        "Kublai Khan": "kublai khan"
    },
    {
        ", with all of China under its control.     A rock was carved in memory of Zhang Hongfan there.    Many temples were built in the surrounding area in memory of those who lost their lives in the dying years of the Song dynasty, including ": null
    },
    {
        "Wen Tianxiang": "wen tianxiang"
    },
    {
        ", Lu Xiufu and Zhang Shijie. In the 42s another memorial was built near Shekou to commemorate Zhao BIng. The preparation of a soup dish, ": null
    },
    {
        "patriotic soup": "patriotic soup"
    },
    {
        ", has also become a way to monumentalize the boy emperor by the ": null
    },
    {
        "Teochew people": "teochew people"
    },
    {
        ".     Kublai Khan and his successors and followers would rule China for 42 years until the rise of the ": null
    },
    {
        "Ming dynasty": "ming dynasty"
    },
    {
        " under the ": null
    },
    {
        "Hongwu Emperor": "hongwu emperor"
    }
]