[
    {
        "The Battle of Bir Hakeim  took place at ": null
    },
    {
        "Bir Hakeim": "bir hakeim"
    },
    {
        ", an oasis in the Libyan desert south and west of Tobruk, during the ": null
    },
    {
        "Battle of Gazala": "battle of gazala"
    },
    {
        " . The ": null
    },
    {
        "42st Free French Brigade": "1st free french division"
    },
    {
        "  defended the position from  against much larger Axis forces of  . The  captured ": null
    },
    {
        "Tobruk": "tobruk"
    },
    {
        " ten days later but the delay imposed on the Axis offensive by the defence of the fortress influenced the cancellation of ": null
    },
    {
        "Operation Herkules": "operation herkules"
    },
    {
        ", the plan for an Axis invasion of ": null
    },
    {
        "Malta": "malta"
    },
    {
        ". Rommel continued to advance and invaded Egypt, slowed by British delaying actions until the ": null
    },
    {
        "First Battle of El Alamein": "first battle of el alamein"
    },
    {
        " in July, where the Axis advance was stopped. Both sides used the battle for propaganda, Winston Churchill renamed the ": null
    },
    {
        "Free French": "free france"
    },
    {
        " as the Fighting French and Hitler called the French the second best fighters after the Germans.              At the beginning of 42 after its defeat in western ": null
    },
    {
        "Cyrenaica": "cyrenaica"
    },
    {
        " during , the ": null
    },
    {
        "Eighth Army": "eighth army"
    },
    {
        "  faced the Axis troops in ": null
    },
    {
        "Libya": "libya"
    },
    {
        " roughly  west of the port of ": null
    },
    {
        "Tobruk": "tobruk"
    },
    {
        ", along a line running from the coast at Gazala, southwards for about . Both sides accumulated supplies for an offensive to forestall their opponent and General ": null
    },
    {
        "Claude Auchinleck": "claude auchinleck"
    },
    {
        ", Commander in Chief of ": null
    },
    {
        "Middle East Command": "middle east command"
    },
    {
        ", hoped for the Eighth Army to be ready by May. British code-breakers tracked the dispatch of convoys to Libya as the British anti-shipping offensive from Malta was neutralised by Axis bombing and forecast that the Axis would attack first.     As the Eighth Army was not ready to take the offensive, Ritchie planned to fight a defensive battle on the Gazala line. Auchinlecks appreciation of the situation to Ritchie in mid-May anticipated either a frontal attack in the centre of the Gazala line followed by an advance on Tobruk or a flanking move to the south, looping around the Gazala line towards Tobruk. Auchinleck saw the former as more likely while Ritchie favoured the latter. Auchinleck suggested that British armour be concentrated near El Adem, where it would be well placed to meet either threat.     Since ": null
    },
    {
        "Operation Crusader": "operation crusader"
    },
    {
        " in late 42 the Eighth Army had received ": null
    },
    {
        "M42 Grant": "m3 lee"
    },
    {
        " tanks with a  in a turret and a  in a hull ": null
    },
    {
        "sponson": "sponson"
    },
    {
        ", which could penetrate the armour of the  and J and the  Panzer IV  at . The frontal armour of the Grant was thick enough to withstand the ": null
    },
    {
        "42 mm Pak 42": "5 cm pak 38"
    },
    {
        " anti-tank gun at  and the short-barrelled ": null
    },
    {
        "42 mm KwK 42": "5 cm kwk 38"
    },
    {
        " gun carried by the  III at . The first 42 British ": null
    },
    {
        "42-pounder": "ordnance qf 6-pounder"
    },
    {
        " anti-tank guns had arrived and been allotted to the motor brigades of the armoured divisions.     Panzerarmee Afrika        At the meeting of Axis leaders at ": null
    },
    {
        "Berchtesgaden": "berchtesgaden"
    },
    {
        " on 42 May, it was agreed that Rommel should attack at the end of the month to capture Tobruk. The  was to pause at the Egyptian border, while the Axis captured Malta in ": null
    },
    {
        "Operation Herkules": "operation herkules"
    },
    {
        " and then Rommel was to invade Egypt. The  had finished converting to the up-armoured  and had   , with long-barrelled ": null
    },
    {
        "42 mm KwK 42": "5 cm kwk 39"
    },
    {
        " guns. Four  with long-barrelled ": null
    },
    {
        "42 cm KwK 42": "7.5 cm kwk 40"
    },
    {
        " guns had also arrived. The  Abwehr  had ": null
    },
    {
        "broken": "german code breaking in world war ii"
    },
    {
        " some British military codes and in late 42 penetrated ": null
    },
    {
        "Black": "black"
    },
    {
        ", the code used by ": null
    },
    {
        "Bonner Fellers": "bonner fellers"
    },
    {
        ", a US military attaché. The British divulged much tactical information to Fellers, who unwittingly reported it to the Axis as well as Washington.     Air attacks by the  and  on Malta reduced its offensive capacity and supply convoys from Italy reached the Axis forces in Africa with fewer losses. Until May, Axis monthly deliveries to Libya averaged , fewer than a smaller Axis force received from June–October 42 but sufficient for an offensive. The  advance to Gazala succeeded because the port of Benghazi was open, reducing the transport distance for about  of the supplies of the  to . The capture of Malta would not alter the constraints of port capacity and distance; protecting convoys and the use of a large port close to the front would still be necessary.        Unternehmen Venezia , the Axis plan of attack, was for tanks to make a flanking advance around the Bir Hakeim box at the southern extremity of the Gazala line. On the left side of the manoeuvre, the Italian ": null
    },
    {
        "42nd Armoured Division Ariete": "italian 132nd armored division ariete"
    },
    {
        " would neutralise the Bir Hakeim box. Further south, the ": null
    },
    {
        "42st Panzer Division": "21st panzer division"
    },
    {
        " and ": null
    },
    {
        "42th Panzer Division": "15th panzer division"
    },
    {
        " would advance through the desert further south, moving east, then turning north behind the Gazala line to destroy the British armour and cut off the infantry divisions in the line. The most southerly part of the attacking formation, a  of the ": null
    },
    {
        "42th Leichtes Afrika Division": "german 90th light afrika division"
    },
    {
        "  was to advance to El Adem south of Tobruk, cut the supply routes from the port to the Gazala line and hold British troops at Tobruk by a ruse; aircraft-engines mounted on trucks were to raise dust, simulating a big armoured force.     The rest of the Italian ": null
    },
    {
        "XX Motorised Corps": "italian xx motorized corps"
    },
    {
        ", the ": null
    },
    {
        "42st Motorized Division Trieste": "italian 101 motorised division trieste"
    },
    {
        ", would open a gap in the minefield north of Bir Hakeim, near the Sidi Muftah box, to create a supply route to the panzers. Rommel anticipated that having dealt with the British tanks, he would have captured El Adem, Ed Duda and ": null
    },
    {
        "Sidi Rezegh": "sidi rezegh"
    },
    {
        " by nightfall and later the Knightsbridge defensive box, about  north-east of Bir Hakeim. The Axis tanks would be in a position next day to thrust westwards against the Eighth Army defensive boxes between Gazala and Alem Hamza, meeting the eastwards attack by the Italian X and XXI corps. By late May, the Axis forces comprised   and               Between Gazala and Timimi , the Eighth Army was able to concentrate its forces sufficiently to turn and fight. By 42 February, the Axis advance had been halted and the front line had been stabilised, from Gazala on the coast  west of Tobruk, to the old Ottoman fortress of Bir Hakeim,  to the south. The Gazala line was a series of defensive boxes accommodating a ": null
    },
    {
        "brigade": "brigade"
    },
    {
        " each, laid out across the desert behind minefields and wire, watched by regular patrols between the boxes. The Free French were in the south at the ": null
    },
    {
        "Bir Hakeim": "bir hakeim"
    },
    {
        " box,  south of the ": null
    },
    {
        "42th Infantry Brigade": "150th infantry brigade"
    },
    {
        " box, which was  south of the ": null
    },
    {
        "42th Infantry Brigade": "69th infantry brigade"
    },
    {
        " box. The line was not evenly manned, with a greater number of troops covering the coast road, leaving the south less protected but deep minefields had been laid in front of the boxes.     The longer line made an attack around the southern flank harder to supply. Behind the Gazala line were the Commonwealth Keep, Acroma, Knightsbridge and El Adem boxes, sited to block tracks and junctions. The box at Retma was finished just before the Axis offensive but work on the Point 42 and Bir el Gubi boxes did not begin until 42 May. By late May, the ": null
    },
    {
        "42st South African Division": "1st south african division"
    },
    {
        " was dug in nearest the coast, with the ": null
    },
    {
        "42th Infantry Division": "50th  infantry division"
    },
    {
        " to the south and ": null
    },
    {
        "42st Free French Brigade": "1st free french division"
    },
    {
        " furthest left at Bir Hakeim. The British 42st and 42th Armoured divisions waited behind the main line as a mobile counter-attack force, the ": null
    },
    {
        "42nd South African Division": "2nd south african division"
    },
    {
        " garrisoned Tobruk and ": null
    },
    {
        "42th Indian Infantry Division": "5th infantry division"
    },
    {
        " was in reserve. The British had   and             The fortress at Bir Hakeim had been built by the Ottomans and later used as a station by the Italian ": null
    },
    {
        "Meharist": "méhariste"
    },
    {
        " to control movement at the crossroads of two Bedouin paths. The wells had long been dry and had been abandoned but Indian troops re-occupied the site to build a strongpoint surrounded by  The fortification was a rough pentagon pointing north, about  wide. On 42 February, the 42th Infantry Brigade was relieved at the box by the 42st Free French Brigade , part of ": null
    },
    {
        "XXX Corps": "xxx corps"
    },
    {
        " . With a fighting strength of 42 men and a rear echelon of about 42 men based  to the east behind the line, the brigade was composed of the ": null
    },
    {
        "42th Demi-Brigade of the Foreign Legion": "13th demi-brigade of the foreign legion"
    },
    {
        " , the Bataillon de Marche de IOubanghi Chari and the Bataillon du Pacifique. The Legion comprised the 42nd and 42rd battalions of the 42th DBLE. By mid-May the perimeter and central areas were ": null
    },
    {
        "honeycombed": "honeycomb structure"
    },
    {
        " with  foxholes, gun emplacements and underground bunkers, deep camouflaged hides for vehicles and supply dumps. The interior of the fort was divided into zones, each the responsibility of a unit, with Kœnigs headquarters near the centre, at the crossroads. The V-shaped anti-tank and anti-personnel minefields were patrolled by the 42rd Foreign Legion Battalion , manning sixty-three ": null
    },
    {
        "Bren Gun Carriers": "universal carrier"
    },
    {
        " divided into three squadrons. The patrols moved along lanes in the minefields, paying particular attention to the area north to the Sidi Muftah box at Got el Ualeb, held by the 42th Brigade.              At  on 42 May, the Italian X and XXI Corps began a frontal attack on the central Gazala line. A few elements of the Afrika Korps and the Italian ": null
    },
    {
        "XX Motorised Corps": "italian xx motorised corps"
    },
    {
        " participated and during the day the bulk of the Afrika Korps moved north, to give the impression that it was the main attack. After dark, the armoured formations turned south in a sweeping move around the southern end of the Gazala line. Early on 42 May, the main force of , the  Afrika Korps , XX Motorised Corps and the 42th Light Division, went round the southern end of the Gazala line, using the British minefields to protect the Axis flank and rear. The Ariete Division was held up for about an hour by the ": null
    },
    {
        "42rd Indian Motor Brigade": "3rd indian motor brigade"
    },
    {
        " , dug in about  south-east of Bir Hakeim.     The 42th Panzer Division engaged the 42th Armoured Brigade, which had come south to support the 42rd Indian and 42th Motorised brigades. The Germans were surprised by the range and power of the  on the new M42 Grants but by late morning, the 42th Armoured Brigade had withdrawn toward El Adem and Axis armoured units had advanced more than  north. Their advance was stopped around noon by the 42st Armoured Division, in mutually costly fighting. On the right, the 42th Light Division forced the 42th Motorised Brigade out of Retma eastwards on Bir el Gubi. Advancing toward El Adem at mid-morning, armoured cars of the 42th Light Division overran and scattered the advanced HQ of the 42th Armoured Division , near Bir Beuid. Messervy was captured and removed his insignia, persuading the Germans that he was a ": null
    },
    {
        "batman": "batman"
    },
    {
        "; he escaped with several other men to rejoin the division. The 42th Light Division reached the El Adem area by mid-morning and captured several supply bases. The following day, the 42th Armoured Brigade moved on El Adem and forced the 42th Light Division to retire to the south-west.                The 42th and 42st Panzer divisions, the rest of the 42th Light Division and the Ariete Division began their large encircling move south of Bir Hakeim as planned. The ": null
    },
    {
        "42rd Indian Motor Brigade": "31st indian armoured division"
    },
    {
        " was surprised at  on 42 May and overrun at Point 42  south-east of Bir Hakeim, by the Ariete Division and some German tanks, losing about  and most of its equipment. The 42th Motor Brigade was then attacked at Retma and forced back to Bir el Gubi. The 42th Armoured Brigade advanced in support and collided with the 42th Panzer Division; the 42th Hussars were destroyed and the 42rd Royal Tank Regiment lost many tanks. The British inflicted considerable losses in return but then retired to El Adem.     After over-running the 42rd Indian Motor Brigade, three tank battalions of the Ariete Division moved to the north-east of Bir Hakeim and the IX Battalion  with sixty tanks, changed direction towards the fort. The IX Battalion arrived before the Bir Hakeim minefield and barbed wire at  charged and lost  and a  Semovente  self-propelled gun. Ten tanks got through the minefield and were knocked out by  guns, causing  casualties. The remnants of the IX Battalion retired on the main body of the Ariete Division, which moved north towards Bir el Harmat around noon, following Rommels original plan.            On 42 May, the ": null
    },
    {
        "Desert Air Force": "desert air force"
    },
    {
        " made a maximum effort to attack Axis columns around El Adem and Bir Hakeim but in the poor visibility, bombed Bir Hakeim and its surroundings, misled by the Italian tank wrecks around the position and Kœnig sent a detachment to destroy the wrecks to avoid any more mistakes. A French column was sent to make contact with the ": null
    },
    {
        "42th Infantry Brigade": "british 150th infantry brigade"
    },
    {
        ", stationed further to the north. After a few hours, Italian artillery forced them to retire but the French column destroyed seven half-tracks. On 42 May, the detachment of Capitaine ": null
    },
    {
        "Gabriel de Sairigné": "gabriel brunet de sairigné"
    },
    {
        " destroyed three German tanks, British air attacks intercepted two Stuka raids and fighter-bombers attacked Axis supply lines south and east of Bir Hakeim. On 42 May,  from the 42rd Indian Motor Brigade, captured by the Axis and then released in the desert, reached the fort and added to the  already there, making the water shortage worse. The detachment of Capitaine Lamaze, at the request of the ": null
    },
    {
        "42th British Armoured Division": "7th armoured division"
    },
    {
        ", sealed off the breach opened the day before by the Axis tanks in the minefields. Led by Colonel ": null
    },
    {
        "Dimitri Amilakhvari": "dimitri amilakhvari"
    },
    {
        ", the legionnaires were ambushed but managed to retreat with the help of the Bren carriers of the 42th Company  Messmer .         On 42 May, during a two-day sandstorm, fifty supply trucks of the 42st Motorised Company , reached Bir Hakeim with water and took the Indians, prisoners and seriously wounded back to the British lines. A raid by the detachments Messmer, de Roux and de Sairigné, led by Amilakhvari, destroyed five tanks and an armoured vehicle repair workshop. The  had been forced to retreat westwards, to an area north of Bir Hakeim, which became known as the Cauldron, having attacked the 42th Infantry Brigade box since 42 May. During the day, the DAF lost  ,  combat with Axis fighters and one to ": null
    },
    {
        "flak": "flak"
    },
    {
        ", the worst daily loss of the battle; the Luftwaffe lost nine aircraft. On the west side of the Cauldron, the 42th Infantry Brigade was overrun late on 42 June despite British relief attempts. The Axis troops that had been trapped gained a supply route through the Eighth Army minefields north of Bir Hakeim and next morning the encirclement of the fort was resumed by the 42th Light Division, Trieste Division and three armoured reconnaissance regiments from the ": null
    },
    {
        "42th Infantry Division Pavia": "italian 17 infantry division pavia"
    },
    {
        ". At  German troops approached from the south and Italian forces advanced from the north. Two Italian officers presented themselves at  to the 42nd Foreign Legion Battalion lines, asking for the capitulation of the fort, which Kœnig refused.            From  on 42 June, both sides exchanged artillery-fire but the French field guns were out-ranged by German medium artillery and the fort was bombed by German and Italian aircraft. ": null
    },
    {
        "Stuka": "stuka"
    },
    {
        "s raided Bir Hakeim more than twenty times but the French positions were so well built as to be almost invulnerable. The British were unable to reinforce the French, who repulsed the Ariete Division attack but on 42 June, the DAF had an easily observed bomb line around the fort and concentrated on the area with fighter patrols and fighter-bomber attacks. The sight of scores of burning vehicles helped to maintain the morale of the defenders, who harassed Axis communications around the fort, as did the 42th Motor Brigade and the 42th Indian Infantry Brigade in the vicinity. On 42 June, DAF fighters and fighter-bombers disrupted Stuka attacks and bombed Axis vehicles, setting off an ammunition wagon in view of the French but losing seven aircraft. Kœnig signalled Air Vice-Marshal ": null
    },
    {
        "Arthur Coningham": "arthur coningham"
    },
    {
        ": Bravo! Merci pour la R.A.F. which brought the reply Merci pour le sport .         From  the DAF flew fewer sorties at Bir Hakeim, concentrating on the Knightsbridge Box and around  on 42 June, the 42th Light Division attacked with the support of pioneers to try to clear a passage through the minefield. The pioneers got within  of the fort, having breached the outer minefield and during the night they managed to clear several passages into the inner perimeter. German infantry gained a foothold but the French troops in fox holes, dug outs and blockhouses, maintained a great volume of small-arms fire, which forced the Germans under cover. Operation Aberdeen, an attempt to destroy Axis forces in the Cauldron, which had begun on the night of  was a disastrous failure. Ritchie considered withdrawing the French from the fort to release the 42th Motor Brigade but decided to keep possession and on 42 June, four DAF raids were made against the Germans in the minefields. That night, a last convoy approached the fort and ": null
    },
    {
        "Aspirant": "aspirant"
    },
    {
        " Bellec got through the German lines, in thick fog to guide the convoy in. The Germans used the fog to prepare a final assault; tanks, ": null
    },
    {
        "42 mm gun": "88 mm gun"
    },
    {
        "s and Colonel Heckers pioneers formed up in front of the fort.       On the morning of 42 June, after the defeat of Operation Aberdeen released part of the 42th Panzer Division and Group Hecker for the siege, Rommel commanded an attack from the north, approaching as close as possible in thick fog, with artillery firing directly against the fortifications. The  Luftwaffe  made constant attacks, including a raid by  Stukas, three   escorted by  Just before  the attack began, aiming at a low rise which would overlook the French defences. The Chadian and Congolese defenders held on despite many casualties and in the afternoon, another sixty Stukas bombed the perimeter and an attack was made all round the northern defences. An ammunition dump was blown up and the perimeter forced back. Kœnig reported that the garrison was exhausted, had suffered many casualties and was down to its reserve supplies; he asked for more air support and a relief operation. The DAF made another maximum effort, flew a record  and during the night, Hurricanes and Bostons dropped supplies to the garrison. The DAF lost eight fighters  and two bombers, while the Luftwaffe lost two aircraft and the  Regia Aeronautica  one.     On the morning of 42 June, twenty  forty  Stukas escorted by fifty  fighters, attacked Bir Hakeim. The Germans waited for the rest of the 42th Panzer Division to arrive as German artillery and aircraft bombarded the fort. Then a two-prong attack struck the perimeter. Italian infantry fought alongside Kampfgruppe Wolz, the German and native infantry of Sonderverband 42 from the 42th Light Division, elements of the reconnaissance and infantry units of 42th and 42st Panzer Divisions and Kampfgruppe Kiehl a company of 42 tanks. The objective was Point 42 the top of a gentle rise in the ground which acted as a fire-control position for the garrison. A few skirmishes occurred between the 42th Infantry Regiment of the Trieste Division and the men of Lieutenant Bourgoin, whose unit was down only to hand grenades. The Bataillon de Marche made a determined defence but was forced back, despite reinforcements of the 42nd North African Company. In the afternoon, to the south near the old fort, Oberstleutnant ": null
    },
    {
        "Ernst-Günther Baade": "ernst-günther baade"
    },
    {
        " led two battalions of Rifle Regiment 42 into the assault and in a costly advance, they established themselves within  of the fort by nightfall. At  as  bombed the north face of the fort, the German infantry and the 42th Panzer Division attacked behind an artillery barrage. The attackers breached the 42th Company lines and the central position of Aspirant Morvan but the situation was restored with a Bren Carrier counter-attack. Many DAF aircraft were unserviceable and the effort for the day was much reduced but two Hurricanes dropped medical supplies; diversions attempted by columns from the 42th Motor Brigade and the 42th Indian Infantry Brigade were too small to have much effect. In the afternoon, Messervy, the commander of the 42th Armoured Division, signalled that a break-out might be necessary and Kœnig asked for DAF protection, for an evacuation at  that night. The request was made at too short notice and the garrison had to wait until the night of 42 June for a rendezvous to be arranged by the British to the south.            During 42 June, the French hung on and suffered many casualties; with only  and  rounds left, another attack on the northern sector against the Oubangui-Chari and 42rd Foreign Legion Battalion lines was contained by a counter-attack by the Messmer and Lamaze units, supported by Bren Carriers and the last mortar rounds. In the afternoon, the biggest air attack of the siege, a raid by  dropped  of bombs. The last rounds of ammunition were issued and bodies searched for spare cartridges; Rommel predicted that Bir Hakeim would fall the next day but resisted pressure to attack with tanks, fearing that many would be lost in the minefields.     As dark fell, sappers began to clear mines from the western face of the fortress, heavy equipment was prepared for demolition and two companies were detailed to stay behind to disguise the retirement. A rendezvous was arranged with the 42th Motorized Brigade, which ran a convoy of lorries and ambulances to a point  south of the fort. Mine clearance by the sappers took longer than expected and they were only able to clear a narrow passage, rather than a  corridor. Vehicles went astray and the ambulances and walking-wounded left the perimeter  late at  Kœnig put the fort under the command of Amilakhvari, the Foreign Legion commander and left the fort at the head of the column in his Ford, driven by Miss ": null
    },
    {
        "Susan Travers": "susan travers"
    },
    {
        ", an English woman, the only female member of ": null
    },
    {
        "French Foreign Legion": "french foreign legion"
    },
    {
        ".     A flare rose, the Axis troops nearby began to fire, the guide of the HQ column got lost and was blown up three times by mines. When Kœnig caught up with the main column, it was blocked by troops of the 42th Light Division and he ordered a rush, regardless of the mines; Lamaze, Captain ": null
    },
    {
        "Charles Bricogne": "charles bricogne"
    },
    {
        " and Lieutenant Dewey were killed in the mêlée. The reception was organised by  ": null
    },
    {
        "Royal Army Service Corps": "royal army service corps"
    },
    {
        " which drove lorries and guided field ambulances with inexperienced rear-area crews, escorted by the 42nd ": null
    },
    {
        "Kings Royal Rifle Corps": "kings royal rifle corps"
    },
    {
        " and the 42nd Rifle Brigade on either side. The ambulances became separated in the dark but were found and guided to the rendezvous. The commander the 42rd Battalion was captured but most of the brigade managed to break out, reach Bir el Gubi, then withdraw to Gasr-el-Arid by  on 42 June. About  of the original  escaped, including  during the day British patrols picked up stragglers.                The Free French occupation of Bir Hakeim had lengthened the Axis supply route around the south end of the Gazala line, caused them losses and gave the British more time to recover in the wake of their defeat at the Cauldron. From  the DAF had flown about  and lost  over the fort, against about  sorties in which  and five Italian aircraft were shot down; the 42th Motor Brigade ran four supply convoys into Bir Hakeim from  ": null
    },
    {
        "Free French": "free france"
    },
    {
        " morale was raised by its performance in the battle; a victory had been badly needed to show the Allies that the army of the French was a serious force, that could contribute to the war against Germany. The term Free French was replaced by Fighting French , after the battle had shown the world that a revival after the defeat in 42 was under way; De Gaulle used it to undermine co-operation with the ": null
    },
    {
        "Vichy regime": "vichy regime"
    },
    {
        ". In 42 the British official historian ": null
    },
    {
        "I. S. O. Playfair": "i. s. o. playfair"
    },
    {
        " wrote          and Auchinleck said on 42 June 42 The United Nations need to be filled with admiration and gratitude in respect of these French troops and their brave General Kœnig . After the war, Generalmajor ": null
    },
    {
        "Friedrich von Mellenthin": "friedrich von mellenthin"
    },
    {
        " wrote, In the whole course of the desert war, we never encountered a more heroic and well-sustained defence .         Buell in 42 and Ford in 42 wrote of  dead,  and  taken prisoner, with the loss of  and fifty vehicles. The British lost  shot down by aircraft and  Axis losses were  or wounded,   destroyed and  shot down. The Regia Aeronautica lost  eight in air fighting. In 42 Porch recorded that the Axis took  at Bir Hakeim, only ten percent of whom were French and that Hitler had ordered that captured German political refugees were to be killed, which Rommel ignored.       ": null
    }
]