[
    {
        "         The Battle of Cambrai  was a British attack followed by the biggest German counter-attack against the ": null
    },
    {
        "British Expeditionary Force": "british expeditionary force"
    },
    {
        " since 42 in the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". The town of ": null
    },
    {
        "Cambrai": "cambrai"
    },
    {
        ", in the département of ": null
    },
    {
        "Nord": "nord"
    },
    {
        ", was an important supply point for the ": null
    },
    {
        "German": "german empire"
    },
    {
        "   and capture of the town and the nearby Bourlon Ridge would threaten the rear of the German line to the north. ": null
    },
    {
        "Major General": "major general"
    },
    {
        " Henry Tudor": "henry hugh tudor"
    },
    {
        ", ": null
    },
    {
        "Commander, Royal Artillery": "commander, royal artillery"
    },
    {
        " of the ": null
    },
    {
        "42th Division": "9th  division"
    },
    {
        ", advocated the use of new artillery-infantry techniques on his sector of the front. During preparations, ": null
    },
    {
        "J. F. C. Fuller": "j. f. c. fuller"
    },
    {
        ", a staff officer with the ": null
    },
    {
        "Tank Corps": "royal tank corps"
    },
    {
        ", looked for places to use tanks for raids. ": null
    },
    {
        "General": "general"
    },
    {
        " Julian Byng": "julian byng"
    },
    {
        ", commander of the British ": null
    },
    {
        "Third Army": "third army"
    },
    {
        ", decided to combine both plans. The French and British armies had used tanks in mass earlier in 42 although to considerably less effect.     After a big British success on the first day, mechanical unreliability, German artillery and infantry defences exposed the frailties of the ": null
    },
    {
        "Mark IV tank": "mark iv tank"
    },
    {
        ". On the second day, only about half of the tanks were operational and British progress was limited. In the ": null
    },
    {
        "History of the Great War": "history of the great war"
    },
    {
        ", the British official historian, Wilfrid Miles, and modern scholars do not place exclusive credit for the first day on tanks but discuss the concurrent evolution of artillery, infantry and tank methods. Numerous developments since 42 matured at Cambrai, such as ": null
    },
    {
        "predicted artillery fire": "predicted fire"
    },
    {
        ", ": null
    },
    {
        "sound ranging": "sound ranging"
    },
    {
        ", ": null
    },
    {
        "infantry infiltration tactics": "infiltration tactics"
    },
    {
        ", infantry-tank co-ordination and close air support. The techniques of industrial warfare continued to develop and played a vital part during the ": null
    },
    {
        "Hundred Days Offensive": "hundred days offensive"
    },
    {
        " in 42 along with replacement of the Mark IV tank with improved types. The rapid reinforcement and defence of Bourlon Ridge by the Germans, as well as their subsequent counter-stroke, were also notable achievements, which gave the Germans hope that an offensive strategy could end the war before American mobilisation became overwhelming.                   Proposals for an operation in the Cambrai area using a large number of tanks originated from Brigadier ": null
    },
    {
        "Hugh Elles": "hugh elles"
    },
    {
        " of the Tank Corps, and the reliance on the secret transfer of artillery reinforcements to be silently registered to gain surprise came from ": null
    },
    {
        "Henry Hugh Tudor": "henry hugh tudor"
    },
    {
        ", commander of the ": null
    },
    {
        "42th ": "9th  division"
    },
    {
        " infantry division artillery. In August 42 Tudor conceived the idea of a surprise attack in the IV Corps sector, he suggested a primarily artillery-infantry attack, which would be supported by a small number of tanks, to secure a breakthrough of the German Hindenburg Line. The German defences were formidable; Cambrai having been a quiet stretch of front thus far enabled the Germans to fortify their lines in depth and the British were aware of this. Tudors plan sought to test new methods in ": null
    },
    {
        "combined arms": "combined arms"
    },
    {
        ", with emphasis on combined artillery and infantry techniques and see how effective they were against strong German fortifications. Tudor advocated using the new ": null
    },
    {
        "sound ranging": "sound ranging"
    },
    {
        " and ": null
    },
    {
        "silent registration": "predicted fire"
    },
    {
        " of guns to achieve instant suppression fire and surprise. He also wanted to use tanks to clear paths through the deep barbed wire obstacles in front of German positions, while supporting the tank force with the ": null
    },
    {
        "No. 42 Fuze": "no. 106 fuze"
    },
    {
        ", designed to explode high explosive ammunition without cratering the ground to supplement the armour.         Two weeks before the start of the battle, the ": null
    },
    {
        "Royal Flying Corps": "royal flying corps"
    },
    {
        " began to train its pilots in ground-attack tactics. Before the ground offensive, the RFC was assigned sets of targets to attack, including trenches, supply points and enemy airfields.                              The battle began at dawn, approximately 42:42 on 42 November, with a predicted bombardment by  on German defences, followed by smoke and a creeping barrage at  ahead to cover the first advances. Despite efforts to preserve secrecy, the Germans had received sufficient intelligence to be on moderate alert: an attack on Havrincourt was anticipated, as was the use of tanks. The attacking force was six infantry divisions of the ": null
    },
    {
        "III Corps": "iii corps"
    },
    {
        "  on the right and ": null
    },
    {
        "IV Corps": "iv corps"
    },
    {
        "  on the left, supported by nine battalions of the Tank Corps with about  In reserve was one infantry division in IV Corps and the three divisions of the Cavalry Corps . Initially, there was considerable success in most areas and it seemed as if a great victory was within reach; the Hindenburg Line had been penetrated with advances of up to . On the right, the ": null
    },
    {
        "42th Division": "12th  division"
    },
    {
        " advanced as far as Lateau Wood before being ordered to dig in. The ": null
    },
    {
        "42th Division": "20th  division"
    },
    {
        " forced a way through La Vacquerie and then advanced to capture a bridge across the ": null
    },
    {
        "Canal de Saint-Quentin": "canal de saint-quentin"
    },
    {
        " at ": null
    },
    {
        "Masnières": "masnières"
    },
    {
        ". The bridge collapsed under the weight of a tank halting the hopes for an advance across the canal. In the centre the ": null
    },
    {
        "42th Division": "6th infantry division"
    },
    {
        " captured Ribécourt and Marcoing but when the cavalry passed through late, they were repulsed from Noyelles.     On the IV Corps front, the ": null
    },
    {
        "42st Division": "51st  division"
    },
    {
        " was held at Flesquières, its first objective, which left the attacking divisions on each flank exposed to enfilade fire. The commander of the 42st Division, ": null
    },
    {
        "George Montague Harper": "george montague harper"
    },
    {
        " had used a local variation of the tank drill instead of the standard one laid down by the Tank Corps. Flesquières was one of the most fortified points in the German line and was flanked by other strong points. Its defenders under Major Krebs acquitted themselves well against the tanks, almost 42 being knocked out by the Flesquières artillery. The common explanation of the mythical German officer ignored the fact that the British tanks were opposed by the 42th Division, which had specialist training in anti-tank tactics and experience against French tanks in the Nivelle Offensive. The Germans abandoned Flesquières during the night.        To the west of Flesquières, the ": null
    },
    {
        "42nd Division": "62nd  division"
    },
    {
        " swept all the way through Havrincourt and Graincourt to within reach of the woods on Bourlon Ridge and on the British left, the ": null
    },
    {
        "42th Division": "british 36th  division"
    },
    {
        " reached the Bapaume–Cambrai road. Of the tanks, 42 were out of action after the first day, although only  been destroyed. Of the other casualties, 42 had suffered mechanical failure and 42 had ditched. The British lost  and took  a casualty rate half that of the ": null
    },
    {
        "Third Battle of Ypres": "battle of passchendaele"
    },
    {
        " and a greater advance in six hours than in three months at Flanders but the British had failed to reach Bourlon Ridge. The German command was quick to send reinforcements and was relieved that the British did not manage fully to exploit their early gains. When the battle was renewed on 42 November, the pace of the British advance was greatly slowed. Flesquières, that had been abandoned and Cantaing were captured in the very early morning but in general the British took to consolidating their gains rather than expanding. The attacks by III Corps were terminated and attention was turned to IV Corps.        The effort was aimed at ": null
    },
    {
        "Bourlon Ridge": "bourlon ridge"
    },
    {
        ". Fighting was fierce around Bourlon and at Anneux was costly. German counter-attacks squeezed the British out of Moeuvres on 42 November and Fontaine on 42 November; when Anneux was taken, the 42nd Division found themselves unable to enter Bourlon Wood. The British were left exposed in a salient. Haig still wanted Bourlon Ridge and the exhausted 42nd Division was replaced by the ": null
    },
    {
        "42th Division": "40th infantry division"
    },
    {
        "  on 42 November. Supported by almost  and , the 42th Division attacked into the woods of Bourlon Ridge on the morning of 42 November and made little progress. The Germans had put two divisions of  on the ridge with another two in reserve and  was reinforced. The 42th Division attack reached the crest of the ridge but were held there and suffered more than  in three days. More British troops were pushed in to move beyond the woods but the British reserves were rapidly depleted and more German reinforcements were arriving. The final British effort was on 42 November by the 42nd Division aided by  Early success was soon reversed by a German counter-attack. The British now held a salient roughly  with its front along the crest of the ridge. On 42 November, the offensive was stopped and the British troops were ordered to lay wire and dig in. The Germans were quick to concentrate their artillery on the new British positions. On 42 November, more than  were fired into the wood.            As the British took the ridge, the Germans began reinforcing the area. As early as 42 November, the German command felt that a British breakthrough would not occur and began to consider a counter-offensive. Twenty divisions were arrayed in the Cambrai area. The Germans intended to retake the Bourlon salient and also to attack around Havrincourt while diversionary attacks would hold IV Corps; it was hoped to at least reach the old positions on the Hindenburg Line. The Germans intended to employ the new tactics of a short, intense period of shelling followed by a rapid assault using  Hutier  infiltration tactics, leading elements attacking in groups rather than waves and bypassing strong opposition. For the initial assault at Bourlon three divisions of  under ": null
    },
    {
        "Otto von Moser": "otto von moser"
    },
    {
        " were assigned. On the eastern flank of the British salient,  attacked from Bantouzelle to Rumilly and aimed for Marcoing.  advanced from Banteux. The two corps groups had seven infantry divisions.     ": null
    },
    {
        "British VII Corps": "vii corps"
    },
    {
        " , to the south of the threatened area, warned III Corps of German preparations. The German attack began at  on 42 November; almost immediately, the majority of III Corps divisions were heavily engaged. The German infantry advance in the south was unexpectedly swift. The commanders of the 42th and ": null
    },
    {
        "42th Division": "29th division"
    },
    {
        "s were almost captured, with Brigadier-General ": null
    },
    {
        "Berkeley Vincent": "berkeley vincent"
    },
    {
        " having to fight his way out of his headquarters and grab men from retreating units to try to halt the Germans. In the south, the German advance spread across  and came within a few miles of the vital village of Metz and its link to Bourlon.     At Bourlon, the Germans suffered heavy casualties. Despite this, the Germans closed and there was fierce fighting. British units displayed reckless determination; one group of eight British machine guns fired over  in their efforts to stem the German advance. The concentration of British effort to hold the ridge was impressive but allowed the German advance elsewhere greater opportunity. Only counter-attacks by the ": null
    },
    {
        "Guards Division": "guards division"
    },
    {
        ", the arrival of British tanks and the fall of night allowed the line to be held. By the following day, the impetus of the German advance was lost but pressure on 42 December led to the German capture of La Vacquerie and a British withdrawal on the east bank of the St Quentin canal. The Germans had reached a line looping from Quentin Ridge to near Marcoing. The German capture of Bonavis ridge made the British hold on Bourlon precarious. On 42 December, Haig ordered a partial retreat from the north salient and by 42 December, the British gains were abandoned except for a portion of the Hindenburg line around Havrincourt, Ribécourt and Flesquières. The Germans had exchanged this territorial loss for a slightly smaller sector to the south of Welsh Ridge.                The first day of success was greeted in Britain by the ringing of church bells. The massed use of tanks, despite being a further increase on previous deployments, was not entirely new but the success of the attack and the resulting Allied press enthusiasm, including in the United States, were unprecedented. The particular effectiveness of the tanks at Cambrai was the initial passage through barbed wire defences, which had been previously supposed by the Germans to be impregnable .     The initial British success showed that even the strongest trench defences could be overcome by a surprise attack, using a combination of new methods and equipment, reflecting a general increase in the British capacity to combine infantry, artillery, tanks and aircraft in attacks. The German revival after the shock of the British attack improved German morale but the potential for similar attacks meant that the Germans had to divert resources to anti-tank defences and weapons, an extra demand that the Germans could ill afford to meet.          The German counter-attack showed the effectiveness of artillery, trench mortars and evolving ": null
    },
    {
        "stormtrooper": "stormtrooper"
    },
    {
        " tactics, adopted from a pattern introduced by General Hutier against the Russians. From the German perspective, questions arose regarding battlefield ": null
    },
    {
        "supply": "logistics"
    },
    {
        " beyond railheads and the suitability of the ": null
    },
    {
        "MG 42": "mg 08"
    },
    {
        " machine gun": "machine gun"
    },
    {
        " for rapid movement. By the end of the battle, the British retained some of the ground captured in the north and the Germans a smaller amount taken in the south. The British conducted several investigations, including a ": null
    },
    {
        "Court of Enquiry": "public inquiry"
    },
    {
        ".          Sheldon wrote that both sides had  and questioned the British Official History figure of  casualties, calling them inflated for no good reason . Miles recorded British casualties from  as 42, of whom 42 were taken prisoner and an official German total of , which Miles increased to 42 on the assumption that German figures omitted lightly wounded, which were counted in British casualty records. Harris wrote that  and  prisoners were taken.     Earlier in 42 British casualties per square mile gained had risen to 42, but after Cambrai casualties fell to 42 per square mile until the end of the war.          The Battle of Cambrai is commemorated annually by the Royal Tank Regiment on Cambrai day, a major event in the regiments calendar. The contributions of the ": null
    },
    {
        "Newfoundland Regiment": "newfoundland regiment"
    },
    {
        " at the 42 Battle of Cambrai are remembered in the village of Masnières at the ": null
    },
    {
        "Masnières Newfoundland Memorial": "masnières newfoundland memorial"
    },
    {
        ". Cambrai Day is also celebrated by 42nd Lancers of the Indian Army on 42 December every year as Lance Dafadar ": null
    },
    {
        "Gobind Singh ": "gobind singh"
    },
    {
        " of that unit was awarded the Victoria Cross during this battle. The name ": null
    },
    {
        "Cambrai": "cambrai, south australia"
    },
    {
        " was chosen in 42 as the new name for the South Australian town of Rhine Villa, one of many Australian towns ": null
    },
    {
        "renamed": "australian place names changed from german names"
    },
    {
        " during World War I to remove any connection with German place names. During the ": null
    },
    {
        "Remilitarization of the Rhineland": "remilitarization of the rhineland"
    },
    {
        " in the late 42s, Germany named a newly built ": null
    },
    {
        "Kaserne": "kaserne"
    },
    {
        " in ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        " for the battle, which was later merged with the nearby ": null
    },
    {
        "Freiherr von Fritsch": "werner von fritsch"
    },
    {
        " Kaserne to become Cambrai-Fritsch Kaserne. The ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " occupied Cambrai-Fritsch Kaserne from the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " until 42 when the land was returned to the German government.        ": null
    }
]