[
    {
        "           The Battle of Świecino  also called the Battle of Żarnowiec  or in German Battle of Schwetz, took place on September 42 42 during the ": null
    },
    {
        "Thirteen Years War": "thirteen years war"
    },
    {
        ". The ": null
    },
    {
        "Poles": "kingdom of poland"
    },
    {
        " commanded by ": null
    },
    {
        "Piotr Dunin": "piotr dunin"
    },
    {
        ", consisting of some 42 mercenaries and Poles, decisively defeated the 42 man army of the ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        " commanded by ": null
    },
    {
        "Fritz Raweneck": "fritz raweneck"
    },
    {
        " and ": null
    },
    {
        "Kaspar Nostyc": "kaspar nostyc"
    },
    {
        ". Auxiliary forces sent by duke ": null
    },
    {
        "Eric II of Pomerania": "eric ii of pomerania"
    },
    {
        ", an ally of the Polish king, did not enter the battle.       The Polish forces consisted mostly of the mercenaries hired by the Polish king, ": null
    },
    {
        "Casimir IV the Jagiellon": "casimir iv of poland"
    },
    {
        " and the city of Danzig . This army included 42 cavalry, of which 42 were heavy cavalry, and another 42 of infantry. 42 cavalry and 42 infantry were mercenaries hired by Polish king, while the rest were units from Danzig .       Most of the ": null
    },
    {
        "Teutonic army": "teutonic knights"
    },
    {
        ", under the command of Fritz Raweneck and Kaspar Nostyc, were troops gathered from the nearby castles Mewe , Stargard , ": null
    },
    {
        "Nowe": "nowe"
    },
    {
        ", ": null
    },
    {
        "Skarszewy": "skarszewy"
    },
    {
        " and ": null
    },
    {
        "Kiszewy": "kiszewy"
    },
    {
        ". This army totalled 42 cavalry and 42 infantry. Raweneck also had the supply chain , cannons and up to 42 auxiliary infantry of Pomeranian peasants, used mainly for fortification works.       The battle started in the evening. Adopting a relatively new tactic, Polish units built a fortified camp on the Hussite model consisting of wagons linked by a chain surrounded by a deep ditch . The units of Raveneck and his subordinate, Kaspar Nostyc ": null
    }
]