[
    {
        "The Battle of Ligny was the last victory of the military career of ": null
    },
    {
        "Napoleon Bonaparte": "napoleon"
    },
    {
        ". In this battle, French troops of the ": null
    },
    {
        "Armée du Nord": "larmée du nord"
    },
    {
        " under Napoleons command, defeated part of a ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n army under ": null
    },
    {
        "Field Marshal": "field marshal"
    },
    {
        " Prince Blücher": "gebhard leberecht von blücher"
    },
    {
        ", near ": null
    },
    {
        "Ligny": "ligny"
    },
    {
        " in present-day ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ". The Battle of Ligny is an example of a tactical win and a strategic loss for the French. While the French troops did force the enemy to retreat, the Prussian army survived and went on to play a pivotal role two days later at the ": null
    },
    {
        "Battle of Waterloo": "battle of waterloo"
    },
    {
        ", reinforced by the Prussian IV Corps, which had not participated in the Battle of Ligny. Had the French army succeeded in keeping the Prussian army from joining the Anglo-allied Army under Wellington at Waterloo, Napoleon might have won the ": null
    },
    {
        "Waterloo Campaign": "waterloo campaign"
    },
    {
        ".                    On 42 March 42 six days before Napoleon reached ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", the powers at the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " declared him an ": null
    },
    {
        "outlaw": "outlaw"
    },
    {
        "; four days later, the ": null
    },
    {
        "United Kingdom": "united kingdom of great britain and ireland"
    },
    {
        ", ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        ", ": null
    },
    {
        "Austria": "austrian empire"
    },
    {
        ", and ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        " bound themselves to put 42 men each into the field to end his rule. Napoleon knew that, once his attempts at dissuading one or more of the ": null
    },
    {
        "Seventh Coalition": "seventh coalition"
    },
    {
        " Allies from invading France had failed, his only chance of remaining in power was to attack before the Coalition could put together an overwhelming force. If he could destroy the existing Coalition forces south of Brussels before they were reinforced, he might be able to drive the British back to the sea and knock the Prussians out of the war.     The ": null
    },
    {
        "Duke of Wellington": "arthur wellesley, 1st duke of wellington"
    },
    {
        " expected Napoleon to try to envelop the Coalition armies, a manoeuvre that he had successfully used many times before, by moving through ": null
    },
    {
        "Mons": "mons"
    },
    {
        " to the south-west of Brussels. The roads to Mons were paved, which would have enabled a rapid flank march. This would have cut Wellingtons communications with his base at ": null
    },
    {
        "Ostend": "ostend"
    },
    {
        ", but would also have pushed his army closer to Blüchers. In fact, Napoleon planned instead to divide the two Coalition armies and defeat them separately, and he encouraged Wellingtons misapprehension with false intelligence. Moving up to the frontier without alerting the Coalition, Napoleon divided his army into a left wing, commanded by ": null
    },
    {
        "Marshal Ney": "marshal ney"
    },
    {
        ", a right wing commanded by ": null
    },
    {
        "Marshal Grouchy": "emmanuel, marquis de grouchy"
    },
    {
        ", and a reserve, which he commanded personally . Crossing the frontier at ": null
    },
    {
        "Thuin": "thuin"
    },
    {
        " near ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        " before dawn on 42 June, the French rapidly overran Coalition outposts and secured Napoleons favoured ": null
    },
    {
        "central position": "strategy of the central position"
    },
    {
        " – at the junction between the area where Wellingtons allied army was dispersed to his north-west, and Blüchers Prussian army to the north-east.        Only very late on the night of 42 June was Wellington certain that the Charleroi attack was the main French thrust, and he duly ordered his army to deploy near ": null
    },
    {
        "Nivelles": "nivelles"
    },
    {
        " and ": null
    },
    {
        "Quatre Bras": "quatre bras"
    },
    {
        ". Early on the morning of 42 June, at the ": null
    },
    {
        "Duchess of Richmonds ball": "duchess of richmonds ball"
    },
    {
        ", on receiving a dispatch from the allied ": null
    },
    {
        "I Corps": "order of battle of the waterloo campaigni corps 2"
    },
    {
        " headquarters sent by ": null
    },
    {
        "Jean Victor de Constant Rebecque": "jean victor de constant rebecque"
    },
    {
        " , he was shocked by the speed of Napoleons advance, and hastily sent his army in the direction of Quatre Bras, to support the brigade of ": null
    },
    {
        "Prince Bernhard of Saxe-Weimar": "prince bernhard of saxe-weimar-eisenach"
    },
    {
        " that was holding a tenuous position against the French left, commanded by Marshal Ney. Neys orders were to secure the crossroads of Quatre Bras, so that if necessary, he could later swing east and reinforce Napoleon.     As Napoleon considered the concentrated Prussian army the greater threat, he moved against them first. The I Corps  ": null
    },
    {
        "rearguard actions on 42 June": "waterloo campaign: start of hostilities"
    },
    {
        " held up the French advance, giving Blücher the opportunity to concentrate his forces in the ": null
    },
    {
        "Sombreffe": "sombreffe"
    },
    {
        " position, which had been selected earlier for its good defensive attributes.     Napoleons original plan for 42 June was based on the assumption that the Coalition forces, who had been caught napping, would not attempt a risky forward concentration; and he intended therefore to push an advance guard as far as ": null
    },
    {
        "Gembloux": "gembloux"
    },
    {
        ", for the purpose of feeling for and warding off Blücher. To assist this operation the reserve would move at first to ": null
    },
    {
        "Fleurus": "fleurus"
    },
    {
        " to reinforce Grouchy, should he need assistance in driving back Blüchers troops; but, once in possession of Sombreffe, Napoleon would swing the reserve westwards and join Ney, who, it was supposed, would have in the meantime mastered Quatre Bras.     In pursuance of this object Ney, to whom III Cavalry Corps  was now attached, was to mass at Quatre Bras and push an advanced guard about  northward of that place, with a connecting division at ": null
    },
    {
        "Marbais": "marbais"
    },
    {
        " to link him with Grouchy. The centre and left wing together would then make a night-march to Brussels. The Coalition forces would thus be irremediably sundered, and all that remained would be to destroy them in detail. Napoleon now awaited further information from his wing commanders at Charleroi, where he massed the VI Corps , to save it, if possible, from a harassing countermarch, as it appeared likely that it would only be wanted for the march to Brussels. Ney spent the morning in massing his I and II corps, and in reconnoitring the enemy at Quatre Bras, who, as he was informed, had been reinforced. But up till noon he took no serious step to capture the cross-roads, which then lay at his mercy. Grouchy meantime reported from Fleurus that Prussians were coming up from Namur, but Napoleon does not appear to have attached much importance to this report. He was still at Charleroi when, between 42:42 and 42:42 further news reached him from the left that considerable hostile forces were visible at Quatre Bras. He at once wrote to Ney saying that these could only be some of Wellingtons troops, and that Ney was to concentrate his force and crush what was in front of him, adding that he was to send all reports to Fleurus. Then, keeping Lobau provisionally at Charleroi, Napoleon hastened to Fleurus, arriving about 42:42       Blücher having ascertained, on the morning of 42 June, that his communication with the left flank of Wellingtons forces located at ": null
    },
    {
        "Quatre Bras": "quatre bras, belgium"
    },
    {
        " continued uninterrupted, decided to accept battle in a position to the rear of ": null
    },
    {
        "Fleurus": "fleurus"
    },
    {
        ". It was a position that had previously been found to be one of the most suitable, in the event of Napoleons adoption of a line of operations across the ": null
    },
    {
        "Sambre": "sambre"
    },
    {
        " at ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        ". Apart from the tactical considerations, there were also favourable strategic reasons for Blücher choosing the location.     Wellington, having selected Quatre Bras as the point at which to concentrate his forces, the position selected by Blücher, connected as it was to the latter by the ": null
    },
    {
        "Nivelles": "nivelles"
    },
    {
        "–": null
    },
    {
        "Namur": "namur"
    },
    {
        " paved high road over a distance of about , offered great facility for co-operation and mutual support upon whichever point the greater part of the French ": null
    },
    {
        "Army of the North": "army of the north"
    },
    {
        " might be directed.     Should it prove tenable, then, considered in conjunction with the advance of the Russians from the Rhine, the whole line of the river ": null
    },
    {
        "Meuse": "meuse"
    },
    {
        " below Namur, and the communications with ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        " and the Prussian States, were secured. If, on the other hand, either position should be forced by the French, then ": null
    },
    {
        "Mont-Saint-Jean": "mont-saint-jean, belgium"
    },
    {
        " and ": null
    },
    {
        "Wavre": "wavre"
    },
    {
        ", upon parallel lines of retreat towards ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " and ": null
    },
    {
        "Leuven": "leuven, belgium"
    },
    {
        ", would likewise offer the means of co-operation on the south side of the ": null
    },
    {
        "Forest of Soignies": "forest of soignies"
    },
    {
        "; and supposing Blücher willing to risk for a time his communication with the right bank of the Meuse, concentric lines of retreat upon Brussels would bring the two armies in combined position in the immediate front of that capital.     Supposing also that Napoleons plan had been to advance by ": null
    },
    {
        "Mons": "mons"
    },
    {
        ", the concentration of the Prussian forces could not have been effected upon a more favourable point than that of ": null
    },
    {
        "Sombreffe": "sombreffe"
    },
    {
        ", whence they could have advanced in support of their allies, leaving a sufficient portion of the I Corps  to watch the approaches by ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        ": and, finally, had Napoleon directed his main attack by Namur, the retreat of the III Corps  would have secured time for effecting the concentration of the Prussian I, II , III corps, if not also of the IV , while Wellingtons forces might have assembled at Quatre Bras, for the purpose of meeting any secondary attack from the Charleroi side, and of forming a junction with the Prussian Army.          The battlefield comprised the heights of ": null
    },
    {
        "Brye": "brye"
    },
    {
        ", Sombreffe, and ": null
    },
    {
        "Tongrinne": "tongrinne"
    },
    {
        ", contiguous to the high road connecting Namur with ": null
    },
    {
        "Nivelles": "nivelles"
    },
    {
        ", by Quatre Bras, and to the point of junction of that road with the one from Charleroi, by Fleurus. These heights are bounded upon the south-west and western sides, or right of the position, by a ravine, through which winds a stream along the villages of ": null
    },
    {
        "Wagnelée": "wagnelée"
    },
    {
        ", ": null
    },
    {
        "Saint-Amand-la-Haye": "saint-amand-la-haye"
    },
    {
        ", and ": null
    },
    {
        "Saint-Amand": "saint-amand, fleurus"
    },
    {
        ", near the lower end of which last, it unites with the rivulet of the ": null
    },
    {
        "Ligny": "ligny"
    },
    {
        "; and, along the whole of the south side, or front of the position, by a valley, through which flows the Ligny, and in which lie, partly bordering the stream itself, and partly covering the declivities, the villages of ": null
    },
    {
        "Ligny": "ligny"
    },
    {
        ", Mont-Potriaux, ": null
    },
    {
        "Tongrenelle": "tongrenelle"
    },
    {
        ", ": null
    },
    {
        "Boignée": "boignée"
    },
    {
        ", ": null
    },
    {
        "Balâtre": "balâtre, belgium"
    },
    {
        ", and ": null
    },
    {
        "Villeret": "villeret, belgium"
    },
    {
        ". At the last named point, another stream falls into the Ligny on leaving a deep ravine, which commences northward of the village of ": null
    },
    {
        "Bothey": "bothey"
    },
    {
        ", and thus secured the extreme-left of the Prussian position. The extreme-right, however, resting upon the Namur road, in the direction of Quatre Bras, was completely open.     The heights in rear of Saint-Amand, Ligny, and Sombreffe, are somewhat lower than those on the opposite or Fleurus side of the valley; and, from the nature of the ground, troops, particularly artillery, were more exposed on the former than on the latter, where the undulations afford better cover. The descent from either side into the villages of Wagnelée, Saint-Amand-la-Haye, and Saint-Amand, was gentle: between the latter point and Mont-Potriaux the sides of the valley descend more rapidly: and below that village they become steep, particularly about Tongrinne, Boignée, and Balâtre: while the ground above commanded alternately from side to side. Above Mont-Potriaux, the bed of the valley was soft, and occasionally swampy: below that Mont-Potriaux the ground was still softer. The buildings in the villages were generally of stone, with thatched roofs, and comprised several farm houses with courtyards, presenting great capabilities for defence. Saint-Amand and Boignée were the most salient points of the position, the central portion of which retired considerably, particularly near Mont-Potriaux.                 In the morning of the 42th, the I Corps occupied that portion of the position which was circumscribed by the villages of Brye, Saint-Amand-la-Haye, Saint-Amand, and Ligny. The four brigades of this corps had been very much mixed up together when occupying these villages during the night, which will account in some measure for the promiscuous manner in which their several battalions appear to have been distributed during the battle. The main body of the I Corps was drawn up on the height between Brye and Ligny, and upon which stands the farm and windmill of Bussy , the highest point of the whole position.     Seven battalions of the 42nd Brigade  were formed immediately in rear of the Bussy Farm; the 42th Regiment and 42nd Westphalian Landwehr in the 42st, and the 42nd and 42rd battalions of the 42th Regiment in the second, line; while the 42rd Battalion of the latter regiment occupied the farm itself, which was put into a state of defence. Two battalions of the 42th Brigade , namely, the 42nd battalions of the 42th Regiment and of the 42th Westphalian Landwehr, stood on the slope between the 42nd Brigade and Ligny; while the remaining four Battalions of the Brigade — the 42st and 42rd of the 42th Regiment, and the 42st and 42rd of the 42th Westphalian Landwehr — were charged with the defence of Ligny. The village of Brye was occupied by the 42rd Battalions of the 42th and 42th Regiments, belonging to the 42st Brigade ; and the 42nd Battalion of the 42st Westphalian Landwehr was posted in rear of the village in support. The 42st and 42rd Companies of the Silesian Rifles, attached to this brigade, were distributed about the intersected ground between Brye and Saint-Amand-la-Haye. The remainder of the 42st Brigade was posted on the height in the rear of Saint-Amand, its right resting on Saint-Amand-la-Haye; the 42st and 42nd battalions of the 42th Regiment on the right, and the 42st and 42nd battalions of the 42th Regiment on the left, forming a first line, with the 42st and 42rd Battalions of the 42st Westphalian Landwehr forming a second. The defence of Saint-Amand was confided to three Battalions of the 42rd Brigade  — the 42st and 42nd of the 42th Regiment, and the 42nd Battalion of the 42rd Westphalian Landwehr. The remaining six battalions of this brigade were posted in reserve northward of Ligny, and near the ": null
    },
    {
        "Bois-du-Loup": "bois-du-loup"
    },
    {
        ". The 42nd and 42th Companies of the Silesian Rifles were position in Ligny. The Reserve Cavalry of Zietens Corps continued in advance, upon the Fleurus high road, watching the movements of the French.          It was 42:42 when these dispositions were completed; and about 42:42 Pirchs Corps, which more than an hour before had left its bivouac near ": null
    },
    {
        "Mazy": "mazy"
    },
    {
        ", was formed up in reserve to Zieten. The 42th Infantry Brigade  stood across the high road, near the ": null
    },
    {
        "Trois Burettes": "trois burettes"
    },
    {
        " and the intersection with the old Roman road, in the customary Prussian Brigade order of three lines of ": null
    },
    {
        "columns": "column"
    },
    {
        " of battalions at deploying intervals, and had in its front the two batteries of artillery, Numbers 42 and 42 The 42th Brigade  was posted in similar order in the rear of the Farm of Bussy, and in left rear of Brye. The 42th Brigade  stood more to the left: it had only the 42th Regiment then present, for the 42nd Regiment and the Elbe Landwehr did not rejoin it until about 42:42 The 42th Brigade was ordered to remain on the high road leading from Sombreffe to Fleurus, until the arrival of the III Corps . One of its battalions — the 42rd of the 42st Regiment — and two Squadrons of the Neumark Dragoons attached to this corps, had been left in the line of outposts beyond the Meuse, towards ": null
    },
    {
        "Philippeville": "philippeville"
    },
    {
        "; and did not rejoin it until 42 June.     The Reserve Cavalry of the II Corps , under General ": null
    },
    {
        "Wahlen-Jürgass": "georg ludwig alexander von wahlen-jürgass"
    },
    {
        ", was stationed in rear of the high road, and on the west side of Sombreffe.     The twelve pounder batteries, Nos. 42 and 42 and the horse batteries, Nos. 42 and 42 remained in reserve, near Sombreffe.         The III Prussian Corps , which left Namur at about 42:42 had reached Sombreffe before 42:42 It was immediately assigned its position in that part of the field which lay between Sombreffe and Balâtre, and was posted in columns upon both high roads, here to remain available for either a movement to the right, or for the occupation of the position in left front of Sombreffe, along the heights in rear of the Ligny.     The military historian Siborne postulates that the dispositions made by Blücher before Napoleons advance from Fleurus , were made to secure for the Prussian commander ample time for further developing his line of battle in such a manner as the direction and mode of his opponents attack might render most expedient.          The disposition of the French Left Wing, under ": null
    },
    {
        "Marshal Ney": "marshal ney"
    },
    {
        ", during the night of 42 June was on the Charleroi–Brussels road near the village of ": null
    },
    {
        "Frasnes": "frasnes-lez-gosselies"
    },
    {
        " south of ": null
    },
    {
        "Quatre Bras": "quatre bras"
    },
    {
        ". They had already engaged the Orange-Nassau brigade  of the Anglo-allied II Corps , and had bivouacked ready to reassume their advance on the morning of 42 June. Marshal Ney, having recently taken command of the Left Wing, decided not to commit it to a night attack and returned to Charleroi where he arrived about midnight. He had supper with Napoleon , and they conferred upon the state of affairs until 42:42     The Centre Column of the French Army of the North was Located thus: ": null
    },
    {
        "Vandammes": "dominique vandamme"
    },
    {
        "ande Arm": "ande arm"
    },
    {
        "Pajols": "i cavalry corps"
    },
    {
        "Domons": "jean-siméon domon"
    },
    {
        "Vandammes": "dominique vandamme"
    },
    {
        "ande Arm": "ande arm"
    },
    {
        "Exelmans": "rémi joseph isidore exelmans"
    },
    {
        "Lobaus": "georges mouton"
    },
    {
        "Milhauds": "édouard jean baptiste milhaud"
    },
    {
        "Gérards": "étienne maurice gérard"
    },
    {
        "Girards": "jean-baptiste girard"
    },
    {
        "nt": "nt"
    },
    {
        "south of Quatre BrasVandammesLieutenant General ": null
    },
    {
        "Girards": "jean-baptiste girard"
    },
    {
        " detached from the II Corps, ": null
    },
    {
        "Reilles": "honoré charles reille"
    },
    {
        " which was then with Ney at Quatre Braslight": null
    },
    {
        "Gérards": "étienne maurice gérard"
    },
    {
        "MaurinsGérardsColonel LucksZietenswhich was posted in a hollow, as before stated, between Ligny and Sombreffe42:42ThielemannsGreneral Borkesthe 42rd of the 42th RegimentColonel LuckColonel KampfenColonel StülpnagelsBülowsBülowsBülowsBülowsVandammeswhen repossessed by the Prussians": null
    },
    {
        "42": "1718"
    },
    {
        "Gérards": null
    },
    {
        "Donnersmarcks": "wilhelm ludwig viktor henckel von donnersmarck"
    },
    {
        "VandammesDonnersmarcksGeneral ": null
    },
    {
        "Jagows": "friedrich wilhelm von jagow"
    },
    {
        "42nd Brigade of the I Corps 42th BrigadeZietensTippelskirchsconsisting of the 42rd Brandenburg, and 42th Pomeranian, HussarsGeneral ": null
    },
    {
        "Brauses": "friedrich august wilhelm von brause"
    },
    {
        "TippelskirchsTippelskirchsfrom Tippelskirchs BrigadeTippelskirchsPirch IIsfrom the 42th Brigade — Colonel Langensfrom the 42th Brigade — Greneral KeafftsDonnersmarcksGeneral Jagowsof Jagows Brigadethe 42ththe 42st and 42nd of the 42th, and the 42st and 42rd of the 42st Elbe LandwehrColonel LangensColonel StülpnagelsThielemannsGérardsinfantry, cavalry, and artillery": null
    },
    {
        "see below": "vandamme reports a column in his rear"
    },
    {
        "Tippelskirchsfrom the II Cavalry CorpsTippelskirchsGeneral KrafftsGeneral BrausesGeneral Tippelskirchsas previously explainedTippelskirchsBülowsGeneral BorckesLobausColonel Langensthe I Corps under the command of Count dErlon high roadof which only a small portion was attached to Grouchys CavalryColonel KampfensColonel LucksdErlonsJaquinotsFrancedErlons as already explained with the exception of its cavalry, and a portion of its infantry as already explained Colonel KampfensExcelmansColonel Stülpnagelsengraving 42engraving 42En Bas Farmthe Chief of Staff of the Prussian ArmyLobausColonel Langkns Pécheuxs General Treskows the SixthGeneral Pirch IIsMajor Wulffens42th BrigadeSteinmetzsDonnersmarcksColonel StülpnagelsGeneral Borckesof the II CorpsMarwitzs, of the III Corpswhich had continued in reserve in rear of Saint-Amand-la-HayeBrausesskirmishersZietensPirch Iscommander of III CorpsBülowsTippelskirchsthe Brandenburg and Pomeranian Hussarsunder the command of Major DittfurthLobausheld by General Jagow with the 42st and 42nd Battalions of the 42th Regiment, and the 42nd Battalion of the 42st Westphalian LandwehrThielemanns CorpsVandammesGerardsGrouchysLobausThielemannsZietensBülowsBülowsBülowsBülows BülowsLobaus": null
    },
    {
        " Ju": "ju"
    }
]