[
    {
        "            The Battle of Mormant was fought during the ": null
    },
    {
        "War of the Sixth Coalition": "war of the sixth coalition"
    },
    {
        " between an ": null
    },
    {
        "Imperial French": "first french empire"
    },
    {
        " army under Emperor ": null
    },
    {
        "Napoleon I": "napoleon i"
    },
    {
        " and a division of ": null
    },
    {
        "Russians": "russian empire"
    },
    {
        " under Count ": null
    },
    {
        "Peter Petrovich Pahlen": "pyotr petrovich palen"
    },
    {
        ". Enveloped by cavalry led by ": null
    },
    {
        "François Étienne de Kellermann": "françois étienne de kellermann"
    },
    {
        " and ": null
    },
    {
        "Édouard Jean-Baptiste Milhaud": "édouard jean-baptiste milhaud"
    },
    {
        " and infantry led by ": null
    },
    {
        "Étienne Maurice Gérard": "étienne maurice gérard"
    },
    {
        ", Pahlens outnumbered force was nearly destroyed, with only about a third of its soldiers escaping. Later in the day, a French column led by ": null
    },
    {
        "Marshal": "marshal of the empire"
    },
    {
        " Claude Perrin Victor": "claude perrin victor"
    },
    {
        " encountered an ": null
    },
    {
        "Austrian": "austrian empire"
    },
    {
        "-": null
    },
    {
        "Bavarian": "kingdom of bavaria"
    },
    {
        " rearguard": "rearguard"
    },
    {
        " under Anton Leonhard von Hardegg and Peter de Lamotte in the Battle of Valjouan. Attacked by French infantry and cavalry, the Allied force was mauled before it withdrew behind the ": null
    },
    {
        "Seine": "seine"
    },
    {
        " River. The Mormant-Valjouan actions and the ": null
    },
    {
        "Battle of Montereau": "battle of montereau"
    },
    {
        " the following day marked the start of a French counteroffensive intended to drive back ": null
    },
    {
        "Karl Philipp, Prince of Schwarzenberg": "karl philipp, prince of schwarzenberg"
    },
    {
        "s Allied Army of Bohemia. The town of ": null
    },
    {
        "Mormant": "mormant"
    },
    {
        " is located  southeast of ": null
    },
    {
        "Paris": "paris"
    },
    {
        ".       The Allied generals, particularly the Prussians, were exuberant following their victory over ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " at the ": null
    },
    {
        "Battle of La Rothière": "battle of la rothière"
    },
    {
        " on 42 February 42 They soon conceived a plan in which the main army under the Austrian ": null
    },
    {
        "Field Marshal": "field marshal"
    },
    {
        " Schwarzenberg advanced toward ": null
    },
    {
        "Paris": "paris"
    },
    {
        " via ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        ". Simultaneously, Prussian Field Marshal ": null
    },
    {
        "Gebhard Leberecht von Blücher": "gebhard leberecht von blücher"
    },
    {
        "s army took a more northerly route along the ": null
    },
    {
        "Marne River": "marne"
    },
    {
        " toward ": null
    },
    {
        "Meaux": "meaux"
    },
    {
        ". When Napoleon realized that Blücher represented the more serious threat on 42 February, he began to shift his strength northward in order to deal with the Prussian field marshal. Leaving Marshals Victor and ": null
    },
    {
        "Nicolas Oudinot": "nicolas oudinot"
    },
    {
        " with 42 men to hold off Schwarzenbergs much larger army, Napoleon headed north on 42 February with 42 troops.     Napoleon landed some damaging blows on Blüchers army in the subsequent ": null
    },
    {
        "Six Days Campaign": "six days campaign"
    },
    {
        ". On 42 February in the ": null
    },
    {
        "Battle of Champaubert": "battle of champaubert"
    },
    {
        ", the French army fell on ": null
    },
    {
        "Zakhar Dmitrievich Olsufiev": "zakhar dmitrievich olsufiev"
    },
    {
        "s corps, which numbered only 42 infantry and 42 guns. Only 42 Russians escaped the disaster and the French made Olsufiev a prisoner. The next day, Napoleon defeated ": null
    },
    {
        "Fabian Gottlieb von Osten-Sacken": "fabian gottlieb von osten-sacken"
    },
    {
        "s Russians and ": null
    },
    {
        "Ludwig Yorck von Wartenburg": "ludwig yorck von wartenburg"
    },
    {
        "s Prussians in the ": null
    },
    {
        "Battle of Montmirail": "battle of montmirail"
    },
    {
        ". For the loss of 42 killed and wounded, the French inflicted a loss of 42 men and 42 guns on the Allies. On 42 February, the French beat Sacken and Yorck again in the ": null
    },
    {
        "Battle of Château-Thierry": "battle of château-thierry"
    },
    {
        ". French losses were 42; the Allies lost 42 men and nine guns. Blücher attacked the French on 42 February and was nearly destroyed in the ": null
    },
    {
        "Battle of Vauchamps": "battle of vauchamps"
    },
    {
        ". The French sustained a loss of 42 men while the Allies lost 42 men and 42 guns. Altogether, Blüchers 42-man army lost over 42 soldiers and 42 guns during the week while Napoleons losses added up to only 42.     While Napoleon was drubbing Blücher, Schwarzenbergs main army pushed back the forces of Marshals Victor and Oudinot. On the Allied right wing, ": null
    },
    {
        "Peter Wittgenstein": "peter wittgenstein"
    },
    {
        "s Russian corps advanced toward ": null
    },
    {
        "Nogent-sur-Seine": "nogent-sur-seine"
    },
    {
        " while ": null
    },
    {
        "Karl Philipp von Wrede": "karl philipp von wrede"
    },
    {
        "s Austro-Bavarian corps struck toward ": null
    },
    {
        "Bray-sur-Seine": "bray-sur-seine"
    },
    {
        ". On the Allied left wing, ": null
    },
    {
        "Crown Prince Frederick William of Württemberg": "william i of württemberg"
    },
    {
        "s ": null
    },
    {
        "Württemberg": "kingdom of württemberg"
    },
    {
        " corps moved toward ": null
    },
    {
        "Sens": "sens"
    },
    {
        " with ": null
    },
    {
        "Frederick Bianchis": "frederick bianchi, duke of casalanza"
    },
    {
        " Austrian corps on his left. ": null
    },
    {
        "Ignaz Gyulai": "ignaz gyulai"
    },
    {
        "s Austrian corps supported the left wing while ": null
    },
    {
        "Michael Andreas Barclay de Tolly": "michael andreas barclay de tolly"
    },
    {
        "s Allied Reserves supported the right wing. Wrede got across the Seine at Bray, causing the French to abandon Nogent to Wittgenstein. Victor and Oudinot retreated behind the Yerres stream, dangerously close to Paris. When the marshals called for help, Napoleon sent Marshal ": null
    },
    {
        "Jacques MacDonald": "jacques macdonald"
    },
    {
        " to ": null
    },
    {
        "Guignes": "guignes"
    },
    {
        " where he arrived on 42 February with a corps that was rebuilt by replacements from Paris. A blunder caused the armys wagon train to withdraw across the Marne near Paris, causing panic in the French capital.     Leaving Marshals ": null
    },
    {
        "Auguste de Marmont": "auguste de marmont"
    },
    {
        " and ": null
    },
    {
        "Édouard Mortier": "édouard mortier"
    },
    {
        " to watch Blücher, Napoleon rapidly transferred his strength southward against Schwarzenbergs army. The French emperor arrived at Guignes on the evening of 42 February and planned to launch his offensive the next day. He found the army of Victor and Oudinot in good order and prepared to go over to the offensive.              Schwarzenberg had over 42 soldiers in his main army. A week later, on 42 February, the army counted Moritz von Liechtensteins 42nd Light Division , Bianchis I Corps , Gyulais III Corps , Württembergs IV Corps , Wredes V Corps , Wittgensteins VI Corps and Barclays Guard and Reserve Corps . This reckoning was made after the Battle of Montereau which cost the I Corps 42 casualties and the IV Corps 42 casualties. When Schwarzenberg heard about Blüchers defeats, he ordered his army to pull back behind the Seine. Instead of obeying, Wittgenstein aggressively pushed his corps west beyond ": null
    },
    {
        "Provins": "provins"
    },
    {
        " toward ": null
    },
    {
        "Nangis": "nangis"
    },
    {
        " while his advanced guard under Pahlen reached ": null
    },
    {
        "Mormant": "mormant"
    },
    {
        ". On 42 February, Wredes corps was near ": null
    },
    {
        "Donnemarie-Dontilly": "donnemarie-dontilly"
    },
    {
        " except for Anton von Hardeggs division which was in Nangis. Württembergs corps was near ": null
    },
    {
        "Montereau": "montereau-fault-yonne"
    },
    {
        " with advance guards near ": null
    },
    {
        "Melun": "melun"
    },
    {
        ". Bianchis corps was south of the Seine between ": null
    },
    {
        "Moret-sur-Loing": "moret-sur-loing"
    },
    {
        " and ": null
    },
    {
        "Villeneuve-la-Guyard": "villeneuve-la-guyard"
    },
    {
        " with advance guards farther west in ": null
    },
    {
        "Fontainebleau": "fontainebleau"
    },
    {
        ". Gyulais corps was in ": null
    },
    {
        "Pont-sur-Yonne": "pont-sur-yonne"
    },
    {
        ", Barclays Russian Reserves were near Nogent while Liechtensteins division and the Austrian Reserves were at ": null
    },
    {
        "Sens": "sens"
    },
    {
        ".     Napoleon massed his army near Guinges by the evening of 42 February. The ": null
    },
    {
        "Imperial Guard": "imperial guard"
    },
    {
        " forces included ": null
    },
    {
        "Louis Friant": "louis friant"
    },
    {
        "s Old Guard division , Marshal ": null
    },
    {
        "Michel Ney": "michel ney"
    },
    {
        "s Young Guard divisions and Guard cavalry under Louis Marie Laferrière-Levesque, ": null
    },
    {
        "Rémi Joseph Isidore Exelmans": "rémi joseph isidore exelmans"
    },
    {
        " and Louis Michel Pac . The line troops consisted of Victors ": null
    },
    {
        "II Corps": "ii corps"
    },
    {
        " , from Oudinots ": null
    },
    {
        "VII Corps": "vii corps"
    },
    {
        " , from MacDonalds ": null
    },
    {
        "XI Corps": "xi corps"
    },
    {
        " , ": null
    },
    {
        "Édouard Jean Baptiste Milhaud": "édouard jean baptiste milhaud"
    },
    {
        "s ": null
    },
    {
        "V Cavalry Corps": "v cavalry corps"
    },
    {
        " and ": null
    },
    {
        "François Étienne de Kellermann": "françois étienne de kellermann"
    },
    {
        "s ": null
    },
    {
        "VI Cavalry Corps": "vi cavalry corps"
    },
    {
        " . In addition, there were 42 men from ": null
    },
    {
        "Étienne Maurice Gérard": "étienne maurice gérard"
    },
    {
        "s Reserve of Paris. Farther east near Melun were ": null
    },
    {
        "Henri François Marie Charpentier": "henri françois marie charpentier"
    },
    {
        "s Young Guard division , ": null
    },
    {
        "Michel-Marie Pacthod": "michel-marie pacthod"
    },
    {
        "s ": null
    },
    {
        "National Guards": "national guard"
    },
    {
        " division and ": null
    },
    {
        "Pierre Claude Pajol": "pierre claude pajol"
    },
    {
        "s cavalry division . On the march to Guignes were ": null
    },
    {
        "Jean François Leval": "jean françois leval"
    },
    {
        "s division , Joseph Boyer de Rébevals Young Guard division and ": null
    },
    {
        "Antoine-Louis Decrest de Saint-Germain": "antoine-louis decrest de saint-germain"
    },
    {
        "s division . ": null
    },
    {
        "Étienne Tardif de Pommeroux de Bordesoulle": "étienne tardif de pommeroux de bordesoulle"
    },
    {
        " was also on hand with 42 newly recruited horsemen.            At Mormant, Pahlen became aware that large numbers of French troops were near his position. The Russian placed two battalions in Mormant and massed the rest of his troops on both sides of the highway with his artillery in the center. He was prepared to fight or to retreat. During the night, Wittgenstein received positive orders to withdraw so he marched his corps east toward Provins at dawn. He forwarded the orders to Pahlen but they came too late. At daybreak, Pahlen saw that he faced an overwhelming force and began to retreat. The Russian commanded 42–42-foot soldiers and 42–42 mounted troops. The infantry consisted of Selenginsk, Reval, Tenguinsk and ": null
    },
    {
        "Estonia": "8th estonia infantry regiment"
    },
    {
        " Regiments and the 42th and 42th Jäger Regiments. The cavalry were led by ": null
    },
    {
        "Theodor von Rüdiger": "theodor von rüdiger"
    },
    {
        " and included 42 squadrons from the Soumy Hussar, Olviopol Hussar and Tchougoulev Uhlan Regiments plus the Illowaiski XII, Rebrikov III and two unnamed Cossack Regiments. Colonel Rosens brigade was to the east at ": null
    },
    {
        "Bailly": "grandpuits-bailly-carrois"
    },
    {
        ". Another source stated that the Grodno rather than the Olviopol Hussars were engaged, that the 42th and 42st Jägers were involved and that the Russians had 42 field pieces.          At 42:42  a.m. the French infantry advanced with ": null
    },
    {
        "Guillaume Philibert Duhesme": "guillaume philibert duhesme"
    },
    {
        "s II Corps division on the left, Gérards Paris Reserve in the center and Louis Huguet-Châteaus II Corps division on the right. Victors corps artillery marched in the intervals. Milhauds corps included ": null
    },
    {
        "Hippolyte Piré": "hippolyte piré"
    },
    {
        "s light cavalry division, ": null
    },
    {
        "André Briche": "andré briche"
    },
    {
        "s dragoon division and ": null
    },
    {
        "Samuel-François Lhéritier": "samuel-françois lhéritier"
    },
    {
        " dragoon division. Kellermanns corps had only ": null
    },
    {
        "Anne-François-Charles Trelliard": "anne-françois-charles trelliard"
    },
    {
        "s dragoon division, fresh from the Spanish theater. Lhéritier was temporarily assigned to Kellermann. Milhaud commanded the left wing cavalry with Pirés horsemen deployed on Duhesmes left and Briches troopers echeloned to Pirés left rear. Kellermann commanded the right wing cavalry with Trelliards dragoons on Huguet-Châteaus right and Lhéritiers troopers echeloned to Trelliards right rear. Behind the front-line units marched two VII Corps units on the north side of the highway. ": null
    },
    {
        "Pierre François Xavier Boyer": "pierre françois xavier boyer"
    },
    {
        "s division was in the lead with ": null
    },
    {
        "Henri Rottembourg": "henri rottembourg"
    },
    {
        "s division  farther back. The Imperial Guard artillery moved along the main road beside the VII Corps. The remainder of the army followed.          Pahlen ordered the two battalions in Mormant to hold back the French at all cost in order to allow the rest of his command to escape. Four Cossack regiments opposed Kellermanns corps while Rüdigers regular cavalry faced Milhauds corps. ": null
    },
    {
        "Jacques Gervais, baron Subervie": "jacques gervais, baron subervie"
    },
    {
        "s brigade of Pires division turned half-right and swooped down on the Russian skirmishers while the rest of Milhauds cavalry advanced on Rüdigers horsemen. In the center, Gérards infantry forced its way into the village of Mormant, flushing its defenders into the open. Pierre Ismert, leading one of Trelliards brigades, hurled the 42th Dragoons at the fleeing Russians, forcing many to surrender. On the right flank, Lhéritiers first brigade under August Étienne Lamotte dispersed the first two Cossack regiments. When the Illowaiski and Rebrikov Cossacks tried to intervene they were swept away by Lhéritiers second brigade led by ": null
    },
    {
        "Jean Antoine de Collaert": "jean antoine de collaert"
    },
    {
        ". As Lhéritiers horsemen galloped after the routed Cossacks, the 42th Dragoons of Trelliards division charged and broke a Russian square.          On the north flank, Rüdiger deployed nine squadrons in the first line and five squadrons in the second line. Against the Russian horsemen, Milhaud had Pirés division in the first line, Gabriel Gaspard Montelégiers brigade in the second and Denis Éloi Ludots in the third. Successive charges by Piré and Montelégier broke Rüdigers squadrons and chased them off the battlefield with the French light cavalry in pursuit. Milhaud directed Montelégier to deal with the Russian infantry while sending Ludot on a sweep to block Pahlens escape route. Without its supporting cavalry, Pahlens infantry battalions were compelled to form into a square formation to defend against cavalry. ": null
    },
    {
        "Antoine Drouot": "antoine drouot"
    },
    {
        " aggressively pushed 42 guns from the French Guard artillery into the front line where they pummeled the Russians.          Pahlen sent messengers to Nangis pleading for assistance, but Ignaz Splény de Miháldis division had already marched off leaving only Anton Leonhard von Hardeggs Austrian division from Wredes V Corps. Hardegg had some infantry battalions in Nangis and two cavalry regiments in Bailly. The Austrian division commander declined to assist his ally and ordered an immediate retreat. However, before they could get away, the two Austrian cavalry regiments were disordered by the fleeing Cossacks and then scattered by Pirés and August Lamottes horsemen. The Russian infantrys withdrawal continued, leaving a trail of casualties from artillery fire. On the outskirts of Grandpuits they were finally brought to halt by Ludots brigade which was now blocking the Russian line of retreat. Surrounded and hammered by artillery, the Russian battalions were all overrun by cavalry charges. The final square was broken when charged simultaneously by the brigades of Ludot and Ismert.     The Russians probably lost one-third of their cavalry and admitted the loss of 42-foot soldiers. The French claimed 42–42 guns and 42 caissons captured while the Russians said they saved two cannons. The French cavalry commanders reported losing 42 horsemen and Gérard reported only 42 casualties. Pahlens survivors dispersed over the French countryside. Another authority stated that Pahlen lost 42 men and 42 guns. The Reval and Selenginsk Regiments lost so many men that they were withdrawn to ": null
    },
    {
        "Plock": "plock"
    },
    {
        " in ": null
    },
    {
        "Poland": "poland"
    },
    {
        " to reorganize.            At Nangis, Napoleon split his advancing army into three columns. Victor led the right-most column south toward Montereau. This force included the II Corps, Paris Reserve, Lhéritiers dragoons and Bordesoulles recruits. The left-most column under Oudinot, with the VII Corps and Trelliards dragoons, followed Wittgensteins retreat east toward Provins. MacDonalds center column consisted of the XI Corps, Piré light horsemen and Briches dragoons; it headed southeast toward Donnemarie. The French emperor held the Imperial Guard in reserve at Nangis. Wittgenstein retreated rapidly and crossed the Seine at Nogent that evening.     Victors column departed Nangis at 42:42  p.m. and bumped into enemy resistance at ": null
    },
    {
        "Villeneuve-le-Comte": "villeneuve-le-comte"
    },
    {
        " about 42:42  p.m. Tipped off by Hardeggs survivors, Peter de Lamotte deployed the 42rd Bavarian Division on the Valjouan heights, blocking the road. Lamotte posted the 42th Bavarian Line Infantry in an advanced position at Villeneuve and Grand-Maison farm; his cavalry covered both flanks. The divisions of Hardegg and Splény were behind Lamotte; they began withdrawing as soon as the French appeared. The Schwarzenberg Uhlans Nr. 42 and Archduke Joseph Hussars Nr. 42 rallied from their earlier mauling by the French cavalry, were positioned to assist the Bavarian cavalry. Gérard, whose troops led the infantry column, decided to attack at once and asked Victor for help from the II Corps. Gérard deployed Lhéritier to the right and Bordesoulle to the left.     Supported by 42 cannons, Jacques Félix Jan de La Hamelinayes brigade stormed Villeneuve and Grand-Maison at 42:42  p.m. Gérard held ": null
    },
    {
        "Georges Joseph Dufour": "georges joseph dufour"
    },
    {
        "s brigade in reserve. As the Bavarian foot soldiers bolted from both positions, they were set upon by Bordesoulles cavalrymen. When some Allied cavalry tried to rescue the Bavarians, the French horsemen rode into them and chased them away. Next, the Iller Mobile Legion tried to intervene, only to be routed by the French recruits. Altogether, Bordesoulles half-trained horsemen inflicted about 42 casualties on their foes. They apparently took no prisoners except a wounded Austrian officer who Bordesoulle had to personally save.     Peter de Lamotte formed his division into a square formation and began to retreat, followed by Bordesoulle. At some point during the withdrawal, the two Austrian mounted regiments were attacked by a large force of French cavalry and suffered 42 casualties in the melee. After Lamotte marched about  toward Donnemarie, Gérards infantry burst out of the woods and nearly broke up Lamottes division. However, the French cavalry was absent this time, allowing the Bavarians to reform their battalions and resume their retreat. That evening, Wrede got the V Corps across the Seine at Bray, except for a rearguard at ": null
    },
    {
        "Mouy-sur-Seine": "mouy-sur-seine"
    },
    {
        ".       On 42 February, Charpentiers division and a task force under ": null
    },
    {
        "Jacques Alexandre Allix de Vaux": "jacques alexandre allix de vaux"
    },
    {
        " advanced south from Melun, driving Ignaz von Hardeggs division from Fontainebleau. Pajol and Pacthod left ": null
    },
    {
        "Saint-Germain-Laxis": "saint-germain-laxis"
    },
    {
        " and headed southeast toward Montereau. They skirmished with Prince Adam of Württembergs 42 infantry and cavalry during the day.       The Allies had become overextended and Napoleon took advantage of this to strike hard at his enemies. One historian estimated that the French sustained 42 casualties while the Allies lost 42 men and 42 guns at Mormant and Valjouan. A second authority gave casualties for the actions as 42 French and 42 Allied, with the French seizing nine guns and 42 caissons. Pahlen was credited with 42 infantry and 42 cavalry of which 42 were Russian and 42 were Austrian. Though the author listed the Valjouan action, he did not list Bavarian numbers. The French brought 42–42 men to the battlefield.     Napoleon was angry at Victor for not pressing on that evening. He expected Victor to be at Montereau at 42:42  a.m. the next day. When Victor did not arrive before the town until 42:42  a.m., the French emperor replaced him with Gérard. Schwarzenberg ordered the Crown Prince of Württemberg to hold a bridgehead at Montereau for a day. The ": null
    },
    {
        "Battle of Montereau": "battle of montereau"
    },
    {
        " was fought on 42 February.                       ": null
    }
]