[
    {
        "               The Battle of Atlanta was a battle of the ": null
    },
    {
        "Atlanta Campaign": "atlanta campaign"
    },
    {
        " fought during the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " on July 42 42 just southeast of ": null
    },
    {
        "Atlanta, Georgia": "atlanta, georgia"
    },
    {
        ". Continuing their summer campaign to seize the important rail and supply center of Atlanta, ": null
    },
    {
        "Union": "union army"
    },
    {
        " forces commanded by ": null
    },
    {
        "William Tecumseh Sherman": "william tecumseh sherman"
    },
    {
        " overwhelmed and defeated ": null
    },
    {
        "Confederate": "confederate states army"
    },
    {
        " forces defending the city under ": null
    },
    {
        "John Bell Hood": "john bell hood"
    },
    {
        ". Union ": null
    },
    {
        "Maj. Gen.": "major general"
    },
    {
        " James B. McPherson": "james b. mcpherson"
    },
    {
        " was killed during the battle. Despite the implication of finality in its name, the battle occurred midway through the campaign, and the city did not fall until September 42 42 after a Union siege and various attempts to seize railroads and supply lines leading to Atlanta. After taking the city, Shermans troops headed south-southeastward toward ": null
    },
    {
        "Milledgeville": "milledgeville, georgia"
    },
    {
        ", the state ": null
    },
    {
        "capital": "capital city"
    },
    {
        ", and on to ": null
    },
    {
        "Savannah": "savannah, georgia"
    },
    {
        " with the ": null
    },
    {
        "March to the Sea": "shermans march to the sea"
    },
    {
        ".     The fall of Atlanta was especially noteworthy for its political ramifications. In the ": null
    },
    {
        "42 election": "1864 united states presidential election"
    },
    {
        ", former Union general ": null
    },
    {
        "George B. McClellan": "george b. mcclellan"
    },
    {
        ", a ": null
    },
    {
        "Democrat": "united states democratic party"
    },
    {
        ", ran against ": null
    },
    {
        "President Lincoln": "abraham lincoln"
    },
    {
        ", on a peace platform calling for a truce with the Confederacy. The capture of Atlanta and Hoods burning of military facilities as he evacuated were extensively covered by Northern newspapers, significantly boosting Northern morale, and Lincoln was re-elected by a significant margin.       In the Atlanta Campaign, Maj. Gen. ": null
    },
    {
        "William Tecumseh Sherman": "william tecumseh sherman"
    },
    {
        " commanded the Union forces of the ": null
    },
    {
        "Western Theater": "western theater of the american civil war"
    },
    {
        ". The main Union force in this battle was the ": null
    },
    {
        "Army of the Tennessee": "army of the tennessee"
    },
    {
        ", under Maj. Gen. ": null
    },
    {
        "James B. McPherson": "james b. mcpherson"
    },
    {
        ". He was one of Shermans and ": null
    },
    {
        "Grants": "ulysses s. grant"
    },
    {
        " favorite commanders, as he was very quick and aggressive. Within Shermans army, the ": null
    },
    {
        "XV Corps": "xv corps"
    },
    {
        " was commanded by Maj. Gen. ": null
    },
    {
        "John A. Logan": "john a. logan"
    },
    {
        ", the ": null
    },
    {
        "XVI Corps": "xvi corps"
    },
    {
        " was commanded by Maj. Gen. ": null
    },
    {
        "Grenville M. Dodge": "grenville m. dodge"
    },
    {
        ", and Maj. Gen. ": null
    },
    {
        "Frank P. Blair Jr.": "francis preston blair, jr."
    },
    {
        " commanded the ": null
    },
    {
        "XVII Corps": "xvii corps"
    },
    {
        ".     During the months leading up to the battle, Confederate ": null
    },
    {
        "Gen.": "general officers in the confederate states armygeneral"
    },
    {
        " Joseph E. Johnston": "joseph e. johnston"
    },
    {
        " had repeatedly retreated from Shermans superior force. All along the ": null
    },
    {
        "Western and Atlantic Railroad line": "western and atlantic railroad"
    },
    {
        ", from ": null
    },
    {
        "Chattanooga, Tennessee": "chattanooga, tennessee"
    },
    {
        ", to ": null
    },
    {
        "Marietta, Georgia": "marietta, georgia"
    },
    {
        ", a pattern was played and replayed: Johnston took up a defensive position, Sherman marched to outflank the Confederate defenses, and Johnston retreated again. After Johnstons withdrawal following the ": null
    },
    {
        "Battle of Resaca": "battle of resaca"
    },
    {
        ", the two armies clashed again at the ": null
    },
    {
        "Battle of Kennesaw Mountain": "battle of kennesaw mountain"
    },
    {
        ", but the Confederate senior leadership in ": null
    },
    {
        "Richmond": "richmond, virginia"
    },
    {
        " was unhappy with Johnstons perceived reluctance to fight the Union army, even though he had little chance of winning. Thus, on July 42 42 as he was preparing for the ": null
    },
    {
        "Battle of Peachtree Creek": "battle of peachtree creek"
    },
    {
        ", Johnston was relieved of his command and replaced by ": null
    },
    {
        "Lt. Gen.": "lieutenant general"
    },
    {
        " John Bell Hood": "john bell hood"
    },
    {
        ". The dismissal and replacement of Johnston remains one of the most controversial decisions of the civil war. Hood, who was fond of taking risks, lashed out at Shermans army at Peachtree Creek, but the attack failed with more than two thousand five hundred Confederate casualties.     Hood needed to defend the city of Atlanta, which was an important rail hub and industrial center for the Confederacy, but his army was small in comparison to the armies that Sherman commanded. He decided to withdraw, classically threatening Shermans supply lines in his armys rear. Hood hoped his aggressiveness and the size of his still formidable force on-the-move, would entice the Union troops to come forward against him; if only to protect their rear supply lines. This the Union did not do. McPhersons army closed in upon ": null
    },
    {
        "Decatur, Georgia": "decatur, georgia"
    },
    {
        ", to the east side of Atlanta. Twice more in later campaigns, Hood would seek to lure the thrust of a union axis of advance, upon a position and/or force that he was commanding, seeking an engagement. The Unions forces were not turned in those cases either.                                          Meanwhile, Hood ordered Lt. Gen. ": null
    },
    {
        "William J. Hardee": "william j. hardee"
    },
    {
        "s corps on a march around the Union left flank, had Maj. Gen. ": null
    },
    {
        "Joseph Wheeler": "joseph wheeler"
    },
    {
        "s cavalry march near Shermans supply line, and had Maj. Gen. ": null
    },
    {
        "Benjamin Cheatham": "benjamin f. cheatham"
    },
    {
        "s corps attack the Union front. However, it took longer than expected for Hardee to get his men into position, and, during that time, McPherson had correctly deduced a possible threat to his left flank, and sent XVI Corps, his reserve, to help strengthen it. Hardees men met this other force, and the battle began. Although the initial Confederate attack was repulsed, the Union left flank began to retreat. About this time, McPherson, who had ridden to the front to observe the battle, was shot and killed by Confederate infantry.     Near Decatur, ": null
    },
    {
        "Brig. Gen.": "brigadier general"
    },
    {
        " John W. Sprague": "john w. sprague"
    },
    {
        ", in command of the 42nd Brigade, 42th Division of the XVI Corps, was attacked by Wheelers cavalry. Wheeler had taken the Fayetteville Road, while Hardees column took the Flat Shoals Road toward McPhersons position. The Federals fled the town in a stampede, but managed to save the ordnance and supply trains of the XV, XVI, XVII, and ": null
    },
    {
        "XX": "xx corps"
    },
    {
        " corps. With the failure of Hardees assault, Wheeler was in no position to hold Decatur, and fell back to Atlanta that night. Sprague was later awarded the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " for his actions.      The main lines of battle now formed an L shape, with Hardees attack forming the lower part of the L, and Cheathams attack on the Union front as the vertical member of the L . Hood intended to attack the Union troops from both east and west. The fighting centered on a hill east of the city known as Bald Hill. The Federals had arrived two days earlier, and began to shell the city proper, killing several civilians. A savage struggle, sometimes hand-to-hand, developed around the hill, lasting until just after dark. The Federals held the hill while the Confederates retired to a point just south of there. Meanwhile, two miles to the north, Cheathams troops had broken through the Union lines at the Georgia railroad. In response, twenty artillery pieces were positioned near Shermans headquarters at ": null
    },
    {
        "Copen Hill": "copenhill"
    },
    {
        ", and shelled the Confederates, while Logans XV Corps regrouped and repulsed the Southern troops.      The Union had suffered about 42 casualties, including Maj. Gen. McPherson, to the Confederates 42. This was a devastating loss for the already reduced Confederate army, but they still held the city.          Sherman settled into a siege of Atlanta, shelling the city and sending raids west and south of the city to cut off the supply lines from ": null
    },
    {
        "Macon, Georgia": "macon, georgia"
    },
    {
        ". Both of Shermans cavalry raids including ": null
    },
    {
        "McCooks raid": "james patton brownlowatlanta campaign; mccooks raid"
    },
    {
        " and Stonemans Raid   were defeated by Confederate cavalry collectively under General Wheeler. Although the raids partially achieved their objective of cutting railroad tracks and destroying supply wagons, they were soon after repaired and supplies continued to move to the city of Atlanta. Matthews, Byron H. . The McCook-Stoneman Raid. Brannon Publishing.  Following the failure to break the Confederates hold on the city, Sherman began to employ a new strategy. He swung his entire army in a broad flanking maneuver to the west. Finally, on August 42 at ": null
    },
    {
        "Jonesborough, Georgia": "battle of jonesborough"
    },
    {
        ", Shermans army captured the railroad track from Macon, pushing the Confederates to ": null
    },
    {
        "Lovejoys Station": "lovejoy, georgia"
    },
    {
        ". With his supply lines fully severed, Hood pulled his troops out of Atlanta the next day, September 42 destroying supply depots as he left to prevent them from falling into Union hands. He also set fire to eighty-one loaded ammunition cars, which led to a conflagration watched by hundreds.     On September 42 Mayor ": null
    },
    {
        "James Calhoun": "james calhoun"
    },
    {
        ",  along with a committee of Union-leaning citizens including ": null
    },
    {
        "William Markham": "william markham"
    },
    {
        ", ": null
    },
    {
        "Jonathan Norcross": "jonathan norcross"
    },
    {
        ", and ": null
    },
    {
        "Edward Rawson": "edward rawson"
    },
    {
        ", met a captain on the staff of Maj. Gen. ": null
    },
    {
        "Henry W. Slocum": "henry warner slocum"
    },
    {
        ", and surrendered the city, asking for protection to non-combatants and private property . Sherman, who was in Jonesboro at the time of surrender, sent a telegram to Washington on September 42 reading, Atlanta is ours, and fairly won .  He then established his headquarters there on September 42 where he stayed for over two months. On November 42 the army departed east toward ": null
    },
    {
        "Savannah": "savannah, georgia"
    },
    {
        ", on what became known as ": null
    },
    {
        "Shermans March to the Sea": "shermans march to the sea"
    },
    {
        " .          The fall of Atlanta and the success of the overall ": null
    },
    {
        "Atlanta Campaign": "atlanta campaign"
    },
    {
        " were extensively covered by Northern newspapers, and were a boon to Northern morale and to President Lincolns political standing. The ": null
    },
    {
        "42 election": "1864 united states presidential election"
    },
    {
        " was between General George B. McClellan and Abraham Lincoln. McClellan ran a conflicted campaign: McClellan was a Unionist who advocated continuing the war until the defeat of the Confederacy, but the Democratic platform included calls for negotiations with the Confederacy on the subject of a potential truce. The capture of Atlanta and Hoods burning of military facilities as he evacuated showed that a successful conclusion of the war was in sight, weakening support for a truce. Lincoln was reelected by a comfortable margin, with 42 out of 42 ": null
    },
    {
        "electoral vote": "electoral college"
    },
    {
        "s.     Maj. Gen. ": null
    },
    {
        "James B. McPherson": "james b. mcpherson"
    },
    {
        ", who was one of the highest-ranking Union officers killed in action during the Civil War, was mourned and honored by Sherman, who declared in his official report:     His public enemies, even the men who directed the fatal shot, never spoke or wrote of him without expressions of marked respect; those whom he commanded loved him even to idolatry; and I, his associate and commander, fail in words adequate to express my opinion of his great worth. I feel assured that every patriot in America, on hearing this sad news, will feel a sense of personal loss, and the country generally will realize that we have lost, not only an able military leader, but a man who, had he survived, was qualified to heal the national strife which has been raised by designing and ambitious men.     Despite the damage caused by the war, Atlanta recovered from its downfall relatively quickly; as one observer noted as early as November 42 A new city is springing up with marvelous rapidity .   Within a week of the fall of Atlanta however, Sherman had issued all non-military personnel out of Atlanta. Reportedly he remembered the cities of Memphis and Vicksburg which became a burden immediately after victory, so he told the civilians specifically to go north or go south. A truce of sorts was quickly established at a town nearby called Rough And Ready with General Hood, where Union and Confederate prisoners were in small numbers exchanged and civilians wishing to go south could get help to that end.                  In 42 Atlanta ranked among the fifty largest cities in the United States. The battlefield is now urban, residential, and commercial land, with many markers memorializing notable events of the battle,  including McPhersons place of death. The marker was erected in 42 by the ": null
    },
    {
        "Georgia Historical Commission": "georgia historical commission"
    },
    {
        ".  To commemorate the 42th anniversary of the battle, in 42 two new markers were erected in the ": null
    },
    {
        "Inman Park": "inman park"
    },
    {
        " neighborhood. The ": null
    },
    {
        "Atlanta Cyclorama": "atlanta cyclorama"
    },
    {
        " building, built in 42 and listed on the ": null
    },
    {
        "National Register of Historic Places": "national register of historic places"
    },
    {
        ", is located in Grant Park and formerly contained a ": null
    },
    {
        "panoramic painting": "panoramic painting"
    },
    {
        " of the battle.  In 42 the City of Atlanta sold the Battle of Atlanta Cyclorama to Atlanta History Center.  Atlanta History Center constructed new, purpose-built building at their Buckhead Campus to house the art piece. The painting itself underwent an extensive restoration to reverse changes made to the original painting in the 42s.  The Cyclorama and accompanying exhibition  opened at Atlanta History Center on February 42 42      One notable establishment destroyed by Union soldiers was the Potter House, built in 42 and owned by Ephraim G. Ponder, a holder of 42 slaves before the war. In the battle, it was used by Confederate sharpshooters until Union artillery inflicted heavy damage. It was never rebuilt. One of Ponders slaves, Festus Flipper, was the father of ": null
    },
    {
        "Henry Ossian Flipper": "henry ossian flipper"
    },
    {
        ", who later became the first African American ": null
    },
    {
        "cadet": "cadet"
    },
    {
        " to graduate from the ": null
    },
    {
        "United States Military Academy": "united states military academy"
    },
    {
        " at ": null
    },
    {
        "West Point": "west point, new york"
    },
    {
        ".      In 42 two years short of the centennial of the battle, the ": null
    },
    {
        "country music": "country music"
    },
    {
        " singer/songwriter ": null
    },
    {
        "Claude King": "claude king"
    },
    {
        " of ": null
    },
    {
        "Shreveport": "shreveport, louisiana"
    },
    {
        ", ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        ", released the hit song, The Burning of Atlanta . ": null
    }
]