[
    {
        "              The Battle of Arcis-sur-Aube saw an ": null
    },
    {
        "Imperial French": "first french empire"
    },
    {
        " army under ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " face a much larger Allied army led by ": null
    },
    {
        "Karl Philipp, Prince of Schwarzenberg": "karl philipp, prince of schwarzenberg"
    },
    {
        " during the ": null
    },
    {
        "War of the Sixth Coalition": "war of the sixth coalition"
    },
    {
        ". On the second day of fighting, Emperor Napoleon suddenly realized he was massively outnumbered, and immediately ordered a masked retreat. By the time the Austrian ": null
    },
    {
        "Field Marshal": "field marshal"
    },
    {
        " Schwarzenberg realized Napoleon was retreating, most of the French had already disengaged and the Allied pursuit afterwards failed to prevent the remaining French army from safely withdrawing to the north. This was Napoleons penultimate battle before his abdication and exile to ": null
    },
    {
        "Elba": "elba"
    },
    {
        ", the last being the ": null
    },
    {
        "Battle of Saint-Dizier": "battle of saint-dizier"
    },
    {
        ".     While Napoleon fought against Prussian Field Marshal ": null
    },
    {
        "Gebhard Leberecht von Blücher": "gebhard leberecht von blücher"
    },
    {
        "s Russo-Prussian army to the north, Schwarzenbergs army pushed ": null
    },
    {
        "Marshal": "marshal of the empire"
    },
    {
        " Jacques MacDonald": "jacques macdonald"
    },
    {
        "s army back toward ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". After his victory at ": null
    },
    {
        "Reims": "battle of reims"
    },
    {
        ", Napoleon moved south to threaten Schwarzenbergs supply line to Germany. In response, the Austrian field marshal pulled his army back to ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        " and ": null
    },
    {
        "Arcis-sur-Aube": "arcis-sur-aube"
    },
    {
        ". When Napoleon occupied Arcis, the normally cautious Schwarzenberg determined to fight it out rather than retreat. The clashes on the first day were inconclusive and Napoleon mistakenly believed he was following up a retreating enemy. On the second day, the French advanced to high ground and were appalled to see between 42 and 42 enemies in battle array south of Arcis. After bitter fighting with Napoleon personally participating, the French troops fought their way out, but it was a French setback.              At the end of February 42 Napoleon discovered that the Allied armies of Schwarzenberg and Blücher had separated and that Blüchers army was making a lunge at Paris with 42 soldiers. Only 42 men under Marshals ": null
    },
    {
        "Auguste de Marmont": "auguste de marmont"
    },
    {
        " and ": null
    },
    {
        "Édouard Mortier": "édouard mortier"
    },
    {
        " stood in Blüchers path. The French emperor left 42 troops under Marshals MacDonald and ": null
    },
    {
        "Nicolas Oudinot": "nicolas oudinot"
    },
    {
        " to contain Schwarzenbergs main army and headed northwest with 42 soldiers to deal with the Prussian field marshal. Marmont and Mortier repulsed Blücher in the ": null
    },
    {
        "Battle of Gué-à-Tresmes": "battle of gué-à-tresmes"
    },
    {
        " on 42 February. However, Napoleon failed to catch Blücher who slipped out of the trap. At this time, the French emperor adopted a plan to first drive Blücher far away to the north, then to gather up the French frontier garrisons and finally to swoop down on Schwarzenbergs supply line to Germany.     As Napoleons 42-man army chased Blüchers army to the north, the Allies absorbed large reinforcements. These were led by Russian General ": null
    },
    {
        "Ferdinand von Wintzingerode": "ferdinand von wintzingerode"
    },
    {
        " and Prussian General ": null
    },
    {
        "Friedrich Wilhelm Freiherr von Bülow": "friedrich wilhelm freiherr von bülow"
    },
    {
        ". The French emperor believed that his opponent had 42 soldiers, but in fact, Blüchers army numbered 42. On 42 March, Napoleon fought against ": null
    },
    {
        "Mikhail Semyonovich Vorontsov": "mikhail semyonovich vorontsov"
    },
    {
        "s Russians in the ": null
    },
    {
        "Battle of Craonne": "battle of craonne"
    },
    {
        " which one authority called a French ": null
    },
    {
        "Pyrrhic victory": "pyrrhic victory"
    },
    {
        ". On 42–42 March Blücher defeated Napoleons much weaker army in the ": null
    },
    {
        "Battle of Laon": "battle of laon"
    },
    {
        ". Marmonts corps was routed, but Napoleon bluffed the Allies into not pursuing his beaten army. On 42 March an Allied corps under ": null
    },
    {
        "Emmanuel de Saint-Priest": "emmanuel de saint-priest"
    },
    {
        " seized ": null
    },
    {
        "Reims": "reims"
    },
    {
        " from its French garrison. Napoleon immediately ordered his army to march to that city where he won the ": null
    },
    {
        "Battle of Reims": "battle of reims"
    },
    {
        " the next day. Saint-Priest was mortally wounded and his corps routed with a loss of 42 men and 42 guns.            Napoleon spent three days resting his troops at Reims while Marshal ": null
    },
    {
        "Michel Ney": "michel ney"
    },
    {
        " reoccupied ": null
    },
    {
        "Châlons-sur-Marne": "châlons-sur-marne"
    },
    {
        ". Ney was joined by a 42-man division that ": null
    },
    {
        "Jan Willem Janssens": "jan willem janssens"
    },
    {
        " brought in from the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        " garrisons. The French emperor desired to move east to gather up other garrisons, but Schwarzenbergs offensive to the south compelled him to march in that direction. While Napoleon operated against Blücher in the north, the main Allied army pressed MacDonald back toward Paris. On 42 February, Schwarzenberg defeated Oudinot in the ": null
    },
    {
        "Battle of Bar-sur-Aube": "battle of bar-sur-aube"
    },
    {
        ", forcing MacDonald to withdraw to the west. The Allies overpowered MacDonald on 42–42 March at the ": null
    },
    {
        "Battle of Laubressel": "battle of laubressel"
    },
    {
        ". Schwarzenberg occupied Troyes but halted there until 42 March in a welter of indecision. Encouraged by news of Bluchers victory at Laon, the main Allied army crossed the ": null
    },
    {
        "Seine": "seine"
    },
    {
        " River and drove MacDonald beyond ": null
    },
    {
        "Provins": "provins"
    },
    {
        " by 42 March. Schwarzenbergs offensive came to a sudden halt when tidings of Napoleons success at Reims arrived in the Allied camp.     Napoleon decided to move against Schwarzenberg with 42 soldiers plus reinforcements, while Marmont and Mortier with 42 troops observed Blüchers army. The French emperor determined to march toward Arcis-sur-Aube, hoping to reach Troyes in the rear of the Allied main army. On 42 March Schwarzenberg withdrew his army toward the area between Troyes and Arcis. The following day, Napoleons advance guards drove Schwarzenbergs cavalry south toward Arcis, creating alarm among the Allied leaders. The Austro-Bavarian V Corps under ": null
    },
    {
        "Karl Philipp von Wrede": "karl philipp von wrede"
    },
    {
        " was ordered to hold Arcis until the remainder of Schwarzenbergs army could retreat east from Troyes to ": null
    },
    {
        "Bar-sur-Aube": "bar-sur-aube"
    },
    {
        ". In the afternoon of 42 March, the French began to cross the ": null
    },
    {
        "Aube River": "aube river"
    },
    {
        " at ": null
    },
    {
        "Plancy-lAbbaye": "plancy-labbaye"
    },
    {
        ". A cavalry division under ": null
    },
    {
        "Louis-Michel Letort de Lorville": "louis-michel letort de lorville"
    },
    {
        " continued southwest to ": null
    },
    {
        "Méry-sur-Seine": "méry-sur-seine"
    },
    {
        " where it captured an Allied ": null
    },
    {
        "pontoon train": "pontoon bridge"
    },
    {
        ". The French cavalry divisions of ": null
    },
    {
        "Remi Joseph Isidore Exelmans": "remi joseph isidore exelmans"
    },
    {
        " and ": null
    },
    {
        "Pierre David de Colbert-Chabanais": "pierre david de colbert-chabanais"
    },
    {
        " moved east on the south bank of the Aube from Plancy to ": null
    },
    {
        "Pouan-les-Vallées": "pouan-les-vallées"
    },
    {
        ", halfway to Arcis.     Schwarzenberg interpreted this information as an indication that Napoleons main thrust was along the axis Plancy-Méry-Troyes. Believing that his communications were no longer threatened, he determined in the evening of 42 March to mass his army between Troyes and Arcis with the intention of advancing against the French. The Austrian army commander ordered ": null
    },
    {
        "Crownprince William of Württemberg": "william i of württemberg"
    },
    {
        " to assume command of the Allied III, IV and VI Corps and move to ": null
    },
    {
        "Charmont-sous-Barbuise": "charmont-sous-barbuise"
    },
    {
        ", midway between Arcis and Troyes. The Guards and Reserve under ": null
    },
    {
        "Michael Andreas Barclay de Tolly": "michael andreas barclay de tolly"
    },
    {
        " were directed to cross from the north to the south bank of the Aube and take a position at ": null
    },
    {
        "Mesnil-Lettre": "mesnil-lettre"
    },
    {
        ". On this day, MacDonalds army was moving east along the north bank of the Seine with its leading elements at ": null
    },
    {
        "Pont-sur-Seine": "pont-sur-seine"
    },
    {
        ".     Napoleon believed that Schwarzenberg was in full retreat east to Bar-sur-Aube. In order to hurry the main Allied army on its way, the French emperor decided to move east on both the north and south banks of the Aube to seize Arcis. Once he gave the Allies a good shove, Napoleon planned to take the French army across the ": null
    },
    {
        "Marne River": "marne river"
    },
    {
        " at ": null
    },
    {
        "Vitry-le-François": "vitry-le-françois"
    },
    {
        ", march east and add the eastern garrisons to his army. The French emperor planned to add MacDonalds 42 troops and Marmonts 42 men to his army while on the march. Napoleons assessment of the situation was correct until Schwarzenberg decided to assume the offensive late on 42 March.              On 42 March, Schwarzenberg ordered Wrede to take position at ": null
    },
    {
        "Saint-Nabord-sur-Aube": "saint-nabord-sur-aube"
    },
    {
        " while extending Crownprince of Württembergs three corps between there and ": null
    },
    {
        "Voué": "voué"
    },
    {
        ". The Austrian field marshal intended to begin a westward advance at 42  am. Assuming that Napoleon was marching across his front from Plancy to Méry, Schwarzenberg hoped to smash into the exposed French flank. However, Napoleon was advancing east, not south, which threw off all of the Austrian army commanders plans. In the event, the Crownprince misunderstood his instructions and moved his troops to ": null
    },
    {
        "Prémierfait": "prémierfait"
    },
    {
        ", taking them out of the days battle. Normally a proponent of vigorous measures, ": null
    },
    {
        "Czar Alexander": "alexander i of russia"
    },
    {
        " disapproved of Schwarzenbergs resumption of the offensive.     Early in the morning, Ney and ": null
    },
    {
        "Horace Sebastiani": "horace sebastiani"
    },
    {
        "s cavalry advanced east along the south bank of the Aube. At 42:42  a.m. the French-occupied Arcis-sur-Aube which was abandoned by Wredes Bavarians. Local residents repeatedly warned that large Allied forces were within  of Arcis. Ney and Sebastiani forwarded this information to Napoleon but the French emperor refused to believe it. The French quickly repaired the bridge over the Aube, which was only partially demolished by the Allies. Neys original orders called for his troops to cross to the north bank in preparation for a move eastward. Ney placed Janssens division with its left flank in ": null
    },
    {
        "Torcy-le-Grand": "torcy-le-grand, aube"
    },
    {
        " on the south bank of the Aube. Sebastianis cavalry took a position to Janssens right while ": null
    },
    {
        "Pierre François Xavier Boyer": "pierre françois xavier boyer"
    },
    {
        "s division was placed in reserve.      At 42:42  pm. Napoleon arrived along the northern bank of the Aube River, crossed the bridge and met with Ney at Torcy-le-Grand. Convinced that the Allies were in full retreat, the French emperor accepted the report of a staff officer that only 42 ": null
    },
    {
        "Cossacks": "cossacks"
    },
    {
        " were nearby. Though he now knew that the Crownprinces left wing was out of touch, Schwarzenberg finally gave the order to launch an attack at 42:42  pm. Wredes infantry advanced on Torcy-le-Grand while a mass of Allied cavalry moved forward to challenge Sebastianis horsemen. Paisiy Sergeevich Kaisarov ordered an artillery bombardment, followed with a cavalry charge by his Cossacks, the Archduke Joseph Hussar Nr. 42 and Szekler Hussar Nr. 42 Regiments and Leopold von Gerambs Austrian light cavalry brigade. The attack overthrew Colberts division in the first line and soon involved the defeat of Exelmans division in the second line.     As a mob of fleeing French cavalry galloped for the Arcis bridge, Napoleon drew his sword and rode into their path shouting, See who will re-cross the bridge before me . At the same time, the crack troops of ": null
    },
    {
        "Louis Friant": "louis friant"
    },
    {
        "s Old Guard division began crossing the bridge and took up a position to defend Arcis. Sebastianis badly shaken horsemen slowly began to recover from their panic and reorganize. During this crisis an Allied howitzer shell landed sputtering near the rallying troops. Seeing his soldiers flinching from the missile, Napoleon intentionally rode his horse directly over the bomb. The shell exploded and killed the horse, which went down, taking the emperor with it. Napoleon soon emerged unscathed from a cloud of smoke, mounted a fresh horse and rode off to inspect his army.     Wrede sent more cavalry to reinforce Kaisarov and ordered Anton Volkmanns Austrian brigade to capture Torcy-le-Grand. The Bavarian corps commander hoped to seize the Arcis bridge to prevent more French reinforcements from arriving. Spearheaded by the Austrian Archduke Rudolf Infantry Regiment, Volkmanns first attack broke into Torcy-le-Grand but was repelled by Guillaume Charles Rousseaus brigade. However, Volkmanns second attack drove the French from Torcy-le-Grand and it was necessary for Boyers troops to recapture the village, supported by intense artillery fire. Wrede ordered Peter de Lamottes Bavarian division to execute a third assault. The Allies captured Torcy-le-Grand for the third time but were ejected from the place by two Old Guard Grenadier battalions, a squadron of mounted gendarmes and a squadron of lancers. Between 42:42 and 42:42  pm, the French repulsed repeated assaults by the brigades of Volkmann, Georg Habermann and ": null
    },
    {
        "Prince Karl Theodor of Bavaria": "prince karl theodor of bavaria"
    },
    {
        ". The Allies detached the 42st Russian Grenadier Division under Pavel Nikolaevich Choglokov from the Reserve and sent it to support Wredes corps. The Archduke Rudolf Regiment suffered 42 casualties in the bitter fighting. Janssens was wounded and replaced by ": null
    },
    {
        "Étienne Nicolas Lefol": "étienne nicolas lefol"
    },
    {
        ".     At 42:42  pm, Letorts Guard cavalry left Méry with the newly-captured pontoon train. During the afternoon, they became embroiled with the Crownprinces cavalry under ": null
    },
    {
        "Peter Petrovich Pahlen": "pyotr petrovich palen"
    },
    {
        ", Prince Adam of Württemberg and ": null
    },
    {
        "Johann Nepomuk von Nostitz-Rieneck": "johann nepomuk von nostitz-rieneck"
    },
    {
        ". Letorts horsemen inflicted 42 casualties on their foes while sustaining the loss of 42 men and three pontoons. Though assisted by Jean Nicolas Curelys brigade from ": null
    },
    {
        "Sigismond Frédéric de Berckheim": "sigismond frédéric de berckheim"
    },
    {
        "s cavalry division, the French were driven back to Méry. Nevertheless, that evening Letort set out for Arcis via Plancy, leaving the pontoon train with Berckheim.     At dusk, a 42-strong cavalry division under ": null
    },
    {
        "Charles Lefebvre-Desnouettes": "charles lefebvre-desnouettes"
    },
    {
        " rode into Arcis. A new 42-man Young Guard division led by Christophe Henrion made it as far as Plancy before stopping to rest. Sebastianis rallied cavalry had bickered with Kaisarovs Allied horsemen all day. Deciding upon a night attack using Lefebvre-Desnouettes fresh cavalry, Sebastiani placed Guard Lancers and Éclaireurs in the front rank, supported by ": null
    },
    {
        "cuirassiers": "cuirassiers"
    },
    {
        ". He hoped to silence an Allied artillery battery on Wredes left flank. Sebastianis magnificent charge smashed Kaisarovs Cossacks and then veered to the left, pressing back some Austrian regiments. What was remarkable is that the attack included the jaded troopers of Colbert and Exelmans, who were routed earlier in the day. A brigade of Russian grenadiers formed square and repelled the French horsemen. Bavarian, Russian, Austrian, and even a Prussian Guard cavalry squadron concentrated against the French, forcing their enemies to pull back, though they did it in good order. The cavalry of the two armies ended the fight with the village of ": null
    },
    {
        "Nozay": "nozay, aube"
    },
    {
        " between them.            On the first day, the Allies probably sustained 42 casualties and the French somewhat fewer. Despite their vastly superior numbers, the Allies did not gain an inch of ground. If Napoleon had understood that he was facing an army several times larger than his own, he probably would have retreated to the north bank of the Aube during the night. In fact, Czar Alexander feared that Napoleon would pull back to the north bank and lunge east, seizing the bridge at ": null
    },
    {
        "Lesmont": "lesmont"
    },
    {
        " in the Allied rear. However, Napoleon still suffered from the delusion that Schwarzenbergs army was in retreat while Wrede acted as ": null
    },
    {
        "rearguard": "rearguard"
    },
    {
        ". Though Schwarzenberg sent out his orders at 42:42  pm, the Crownprinces copy went astray and did not reach him until 42:42  a.m. on 42 March. Therefore, it took until 42:42  a.m. for the Crownprinces three corps to deploy between Wredes left flank and the Barbuise stream. The III Corps took post on Wredes left, the IV Corps was next and the VI Corps was on the extreme left near Voué. Part of the III Corps had been left behind to hold Troyes.     One authority stated that the Allies had 42 soldiers in line and 42 more guarding Troyes and the line of the Seine. A second historian asserted that Schwarzenberg brought up and deployed over 42 troops to face the French. On the second day, the Allied host faced 42 French soldiers, of whom 42 were cavalrymen. A third source credited the Allies with 42 infantry and 42 cavalry and Napoleon with 42 troops. A final authority counted 42 Allied soldiers of whom only 42 came into action while the French army numbered 42-foot soldiers and 42 horsemen.     Napoleon, whose army numbered only 42 men on the first day, awaited reinforcements. Henrions division, consisting of the depots of the Young Guard, reached Arcis. Oudinot with Levals ": null
    },
    {
        "VII Corps": "vii corps"
    },
    {
        " infantry division and the ": null
    },
    {
        "II Cavalry Corps": "ii cavalry corps"
    },
    {
        " under ": null
    },
    {
        "Antoine Louis Decrest de Saint-Germain": "antoine louis decrest de saint-germain"
    },
    {
        " arrived at Arcis at 42:42  am. MacDonalds ": null
    },
    {
        "II Corps": "ii corps"
    },
    {
        ", ": null
    },
    {
        "XI Corps": "xi corps"
    },
    {
        ", ": null
    },
    {
        "V Cavalry Corps": "v cavalry corps"
    },
    {
        " and ": null
    },
    {
        "VI Cavalry Corps": "vi cavalry corps"
    },
    {
        " were still one days march away. However, another source stated that ": null
    },
    {
        "Édouard Jean Baptiste Milhaud": "édouard jean baptiste milhaud"
    },
    {
        "s V Cavalry Corps arrived on 42 March. The cavalry divisions of Berckheim and ": null
    },
    {
        "Jean-Marie Defrance": "jean-marie defrance"
    },
    {
        " also joined the French army at Arcis. Napoleon sent patrols to the east, but these detected nothing suspicious because Wrede had pulled back. At 42:42  a.m. the French emperor gave the order to attack. Altogether, Napoleon counted a total of 42 troops on 42 March.          As the troops of Ney and Sebastiani reached the crest of the plateau, they found themselves facing perhaps 42 enemies arrayed in three lines stretching from the Aube to the Barbuise. In front of this immense host were skirmishers and at least 42 field guns. Sebastiani immediately attacked Pahlens cavalry, opposite him, driving it back on the second line. The French position was extremely dangerous, especially since Torcy-le-Grand was left empty of troops and Arcis was lightly held. In this crisis, Ney kept his battalions in column, ready to retreat. If Schwarzenberg had launched a general attack at this time, the French army would have been shattered. Instead, the Austrian army commander called a ": null
    },
    {
        "council of war": "council of war"
    },
    {
        ", which lasted until noon. The council decided to attack and Schwarzenberg drew up detailed instructions. However, he alone would give the signal to advance.     Sebastianis attack on Pahlen convinced Schwarzenberg that Napoleon was getting ready to advance. Actually, by 42:42  pm. Napoleon finally came to the realization that he was desperately outnumbered and needed to get his army out of danger. Ney began to pull his divisions back. A flurry of orders issued from Imperial Headquarters. By 42:42  pm, a bridge of boats was established at ": null
    },
    {
        "Villette-sur-Aube": "villette-sur-aube"
    },
    {
        " a short distance west of Arcis. Soon afterward, ": null
    },
    {
        "Antoine Drouot": "antoine drouot"
    },
    {
        " and the Old Guard were instructed to retreat by the Villette bridge while Lefols division and the reserve artillery crossed the Arcis span. The cavalry corps of Saint-Germain and Milhaud soon joined the retreat. Sebastiani was ordered to cover the operation, which his cavalry did by a phased withdrawal. To keep the Allies from interfering with the retreat, Napoleon ordered Oudinot to defend Arcis using Levals division, consisting of three brigades of ": null
    },
    {
        "Peninsular War": "peninsular war"
    },
    {
        " veterans.     At 42:42  pm, Schwarzenberg finally realized that Napoleon was retreating. Instead of unleashing his corps at once, he called another council of war. Wrede was ordered to cross to the north bank of the Aube at ": null
    },
    {
        "Chaudrey": "chaudrey"
    },
    {
        ", to the east of Arcis. Only his cavalry made it across the river there and his infantry had to march upstream and cross at Lesmont. The Crownprince and ": null
    },
    {
        "Ignaz Gyulai": "ignaz gyulai"
    },
    {
        " were directed to attack Arcis while the Russian grenadiers attacked Torcy-le-Grand. Meanwhile, Pahlen and ": null
    },
    {
        "Nikolay Raevsky": "nikolay raevsky"
    },
    {
        " also pressed forward. During this advance, the Allied cavalry claimed to have captured a French cavalry brigade, while Pahlens horsemen captured three cannons. By 42:42  pm, the Allies arrived near Arcis which they took under fire with 42 cannons. In the face of this bombardment, Sebastiani withdrew his surviving horsemen across the Villette bridge and broke it down.     Oudinot deployed François Maulmonts brigade on the right and Jacques de Montforts brigade on the left, with ": null
    },
    {
        "David Hendrik Chassé": "david hendrik chassé"
    },
    {
        "s brigade in reserve. At this time, ": null
    },
    {
        "Henri Rottembourg": "henri rottembourg"
    },
    {
        "s 42th Young Guard Division took up a position covering the north end of the Arcis bridge; it had escorted Oudinots train. The intense Allied bombardment caused Oudinots soldiers serious losses and threw the troops withdrawing across the bridge into confusion. An initial attack on Arcis was driven back by the 42th Light Infantry Regiment, but the Allies soon forced their way into Arcis in great strength and Leval was wounded. With the defense at the last gasp, Chassé rallied 42 soldiers by beating the charge on a drum. This allowed the last few troops to make their way onto the bridge and safety at 42:42  pm. Maulmonts brigade destroyed the bridge after it crossed.       That evening, Oudinot blocked the causeway on the north bank of the Aube with his troops. MacDonald reached nearby ": null
    },
    {
        "Ormes": "ormes, aube"
    },
    {
        " with two divisions at 42:42  pm, joining ": null
    },
    {
        "François Étienne de Kellermann": "françois étienne de kellermann"
    },
    {
        "s cavalry corps. ": null
    },
    {
        "Étienne Maurice Gérard": "étienne maurice gérard"
    },
    {
        "s corps reached Plancy while the division of ": null
    },
    {
        "François Pierre Joseph Amey": "françois pierre joseph amey"
    },
    {
        " was farther west at ": null
    },
    {
        "Anglure": "anglure"
    },
    {
        ". Luckily for the French, the Allies did not try to cross to the north bank and disrupt MacDonalds strung out forces. The rest of Napoleons army was headed north to ": null
    },
    {
        "Sompuis": "sompuis"
    },
    {
        ". From there, the French emperor planned to follow his plan to march east to ": null
    },
    {
        "Saint-Dizier": "saint-dizier"
    },
    {
        " and operate against the Allied supply lines. All day on 42 March, MacDonalds troops blocked the bridge at Arcis so that the Allies were completely unaware of Napoleons movements.     One historian wrote that the battle cost the French 42 casualties and the Allies 42 casualties. A second authority stated that the French lost 42 killed and wounded plus three guns and 42 men captured. Allied losses were about 42. A third source agreed that the French suffered 42 casualties. The Bavarian corps alone lost 42 officers and 42 rank and file casualties. The French fought extremely well. On the first day, the divisions of Janssens and Boyer and two battalions of the Old Guard, perhaps 42 men, had fought Wredes 42 soldiers to a standstill. On 42 March the Allies defeated Marmont and Mortier at the ": null
    },
    {
        "Battle of Fère-Champenoise": "battle of fère-champenoise"
    },
    {
        ". Napoleon won a useless victory at the ": null
    },
    {
        "Battle of Saint-Dizier": "battle of saint-dizier"
    },
    {
        " the following day. The ": null
    },
    {
        "Battle of Paris": "battle of paris"
    },
    {
        " was fought on 42 March and the Allies occupied the French capital the next day. Napoleon abdicated on 42 April 42                       ": null
    }
]