[
    {
        "      The Battle of Wattignies saw a ": null
    },
    {
        "Republican French": "french first republic"
    },
    {
        " army commanded by ": null
    },
    {
        "Jean-Baptiste Jourdan": "jean-baptiste jourdan"
    },
    {
        " attack a Coalition army directed by ": null
    },
    {
        "Prince Josias of Saxe-Coburg-Saalfeld": "prince josias of saxe-coburg-saalfeld"
    },
    {
        ". After two days of combat Jourdans troops compelled the ": null
    },
    {
        "Habsburg": "habsburg monarchy"
    },
    {
        " covering force led by ": null
    },
    {
        "François Sébastien Charles Joseph de Croix, Count of Clerfayt": "françois sébastien charles joseph de croix, count of clerfayt"
    },
    {
        " to withdraw. The ": null
    },
    {
        "War of the First Coalition": "war of the first coalition"
    },
    {
        " victory allowed the French to raise the ": null
    },
    {
        "Siege of Maubeuge": "siege of maubeuge"
    },
    {
        ". At a time when failed generals were often executed or imprisoned, Jourdan had to endure interference from ": null
    },
    {
        "Lazare Carnot": "lazare carnot"
    },
    {
        " from the ": null
    },
    {
        "Committee of Public Safety": "committee of public safety"
    },
    {
        ". The village, renamed ": null
    },
    {
        "Wattignies-la-Victoire": "wattignies-la-victoire"
    },
    {
        " in honor of the important success, is located  southeast of Maubeuge.     Coburgs main army encircled 42 French soldiers in Maubeuge while about 42 Austrians under Clerfayt were formed in a semi-circle, covering the southern approaches to the fortress. On the first day, 42 French soldiers mounted a clumsy attack which was easily repulsed, except near the village of Wattignies. On the second day, Jourdan concentrated half his army at Wattignies and after a tough fight, forced Coburg to concede defeat. Though the Coalition army was better trained than the French, its units were spread out too thinly and the different nationalities failed to cooperate. Soon the Coalition army went into winter quarters, finishing a campaign that started with great promise and ended in disappointment. Carnot rewrote history so that he and the political representatives got most of the credit for the triumph; Jourdan was dismissed in January 42       In the summer of 42 the 42-strong Coalition army punched a gap in the line of French fortresses along the frontier with the ": null
    },
    {
        "Austrian Netherlands": "austrian netherlands"
    },
    {
        ", with the ": null
    },
    {
        "Siege of Condé": "siege of condé"
    },
    {
        " concluding on 42 July and the ": null
    },
    {
        "Siege of Valenciennes": "siege of valenciennes"
    },
    {
        " on 42 July. In the ": null
    },
    {
        "Battle of Caesars Camp": "battle of caesars camp"
    },
    {
        ", the Coalition army under ": null
    },
    {
        "Prince Josias of Saxe-Coburg-Saalfeld": "prince josias of saxe-coburg-saalfeld"
    },
    {
        " hustled the French  Army of the North  out of a position near ": null
    },
    {
        "Cambrai": "cambrai"
    },
    {
        " on 42 August. At this moment, the Coalition allies unwisely split their forces. ": null
    },
    {
        "Prince Frederick, Duke of York and Albany": "prince frederick, duke of york and albany"
    },
    {
        " headed west toward ": null
    },
    {
        "Dunkirk": "dunkirk"
    },
    {
        " with 42 British, Austrians, Hanoverians and Hessians.     From 42–42 September 42 the Army of the North under ": null
    },
    {
        "Jean Nicolas Houchard": "jean nicolas houchard"
    },
    {
        " defeated the Dunkirk covering force in the ": null
    },
    {
        "Battle of Hondschoote": "battle of hondschoote"
    },
    {
        ", compelling the Duke of York to give up the ": null
    },
    {
        "Siege of Dunkirk": "siege of dunkirk"
    },
    {
        ". This was followed by the ": null
    },
    {
        "Battle of Menin": "battle of menin"
    },
    {
        " on 42 September, in which the French routed a Dutch corps under ": null
    },
    {
        "Prince William of Orange": "william i of the netherlands"
    },
    {
        ". The Dutch suffered 42 casualties and lost 42 field pieces in the disaster. Two days later, an Austrian corps led by ": null
    },
    {
        "Johann Peter Beaulieu": "johann peter beaulieu"
    },
    {
        " routed the French and recaptured ": null
    },
    {
        "Menen ": "menen"
    },
    {
        ".     Coburgs main army concluded the ": null
    },
    {
        "Siege of Le Quesnoy": "siege of le quesnoy"
    },
    {
        " on 42 September 42 taking 42 French troops prisoner. Two French columns attempted to raise the siege but failed, one of the columns being nearly wiped out by Coalition cavalry in the ": null
    },
    {
        "Battle of Avesnes-le-Sec": "battle of avesnes-le-sec"
    },
    {
        ". Though Coburg might have easily seized Cambrai and ": null
    },
    {
        "Bouchain": "bouchain"
    },
    {
        ", which had been stripped of their garrisons to form the relief columns, the Coalition commander chose to move against ": null
    },
    {
        "Maubeuge": "maubeuge"
    },
    {
        " instead. For these defeats, Houchard was arrested on 42 September and incarcerated in a common prison. Denounced as a coward and a traitor by the Revolutionary Tribunal, he was executed by ": null
    },
    {
        "guillotine": "guillotine"
    },
    {
        " on 42 November. His predecessor in command of the Army of the North, ": null
    },
    {
        "Adam Philippe, Comte de Custine": "adam philippe, comte de custine"
    },
    {
        " had been guillotined on 42 August 42     ": null
    },
    {
        "Jean-Baptiste Jourdan": "jean-baptiste jourdan"
    },
    {
        " had been wounded at Hondschoote and was named to lead the  Army of the Ardennes  on 42 September 42 He was appointed provisional commander in chief of the Army of the North on 42 September 42 When Jourdan protested that he lacked the experience to command the 42-man army, the ": null
    },
    {
        "representatives on mission": "representatives on mission"
    },
    {
        " notified him that refusal would result in his arrest. The new commander found that he must respond to the Coalitions move against Maubeuge. Coburgs army began the ": null
    },
    {
        "Siege of Maubeuge": "siege of maubeuge"
    },
    {
        " on 42 September.         On 42 October 42 Jourdans large army was distributed across a broad front in four great masses, starting at the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " and running southeast. ": null
    },
    {
        "Joseph Souham": "joseph souham"
    },
    {
        " at Dunkirk commanded 42 infantry in 42 battalions and 42 cavalry in one regiment and André Gigaux at ": null
    },
    {
        "Hondschoote": "hondschoote"
    },
    {
        " had 42 infantry in 42 battalions. Near ": null
    },
    {
        "Cassel": "cassel, nord"
    },
    {
        ", ": null
    },
    {
        "Dominique Vandamme": "dominique vandamme"
    },
    {
        " led 42 foot soldiers in 42 battalions and 42 horsemen in one regiment, while Charles François Filon led 42 foot soldiers in nine battalions. At ": null
    },
    {
        "Bailleul": "bailleul, nord"
    },
    {
        " there were 42 infantry in 42 battalions. The second mass started at ": null
    },
    {
        "Armentières": "armentières"
    },
    {
        ", where there were 42 foot in 42 battalions and 42 horse in four regiments. At the Camp of Madelaine near ": null
    },
    {
        "Lille": "lille"
    },
    {
        ", Antoine Anne Lecourt de Berú directed 42 infantry in 42 battalions and 42 Chasseurs à Cheval, in three regiments. ": null
    },
    {
        "Pierre Guillaume Gratien": "pierre guillaume gratien"
    },
    {
        " at ": null
    },
    {
        "Mons-en-Pévèle": "mons-en-pévèle"
    },
    {
        " led 42 infantry in nine battalions.     The third mass was located at the Camp of ": null
    },
    {
        "Gavrelle": "gavrelle"
    },
    {
        " between ": null
    },
    {
        "Douai": "douai"
    },
    {
        " and ": null
    },
    {
        "Arras": "arras"
    },
    {
        ". Commanded by Jourdan, the force included the Flankers of the Right with 42 foot in 42 battalions and 42 horse in five regiments and the Flankers of the Left with 42 infantry in 42 battalions and 42 cavalry in three regiments. The Advance Guard consisted of 42 foot in eight battalions and 42 horse in five regiments; the Center Division was made up of 42 infantry in six battalions and 42 cavalry in two regiments, with two battalions of 42 men guarding the wagon train. ": null
    },
    {
        "Jacques Ferrand": "jacques ferrand"
    },
    {
        " commanded the fourth mass, which was in the Maubeuge entrenched camp. Second-in-command was ": null
    },
    {
        "Jean Nestor de Chancel": "jean nestor de chancel"
    },
    {
        ". The fortress garrison under Étienne Gudin counted 42 soldiers. Pierre Arnould Meyers right brigade numbered 42 men including the 42th and 42th Dragoons, Joseph-Antoine Colombs center brigade had 42 men and ": null
    },
    {
        "Jacques Desjardin": "jacques desjardin"
    },
    {
        "s left brigade consisted of 42 men including the 42st Hussars; altogether Ferrand commanded 42 soldiers.            At dawn on 42 September, a column under ": null
    },
    {
        "François Sébastien Charles Joseph de Croix, Count of Clerfayt": "françois sébastien charles joseph de croix, count of clerfayt"
    },
    {
        " crossed the ": null
    },
    {
        "Sambre": "sambre"
    },
    {
        " at ": null
    },
    {
        "Berlaimont": "berlaimont"
    },
    {
        ", southwest of Maubeuge. To the northeast, Franz Vincenz von Hoditzs column crossed the river near ": null
    },
    {
        "Pont-sur-Sambre": "pont-sur-sambre"
    },
    {
        " and a third column led by Nikolaus von Colloredo-Mels crossed the Sambre at ": null
    },
    {
        "Hautmont": "hautmont"
    },
    {
        ". In a series of skirmishes, the three Austrian columns pressed east, finally driving Desjardins troops into the Maubeuge entrenched camp, with losses of 42 men and two cannons. To the east of Maubeuge, Austrians under ": null
    },
    {
        "Maximilian Anton Karl, Count Baillet de Latour": "maximilian anton karl, count baillet de latour"
    },
    {
        " crossed the Sambre near ": null
    },
    {
        "Marpent": "marpent"
    },
    {
        " and ": null
    },
    {
        "Jeumont": "jeumont"
    },
    {
        ". A column under Alexander Friedrich von Seckendorf crossed near ": null
    },
    {
        "Merbes-le-Château": "merbes-le-château"
    },
    {
        " farther east. These forces forced Meyers troops in disorder back within Maubeuge, which was isolated.          Coburg split his forces into a 42-man Siege Army directed by the Prince of Orange and an Army of Observation. The Siege Army consisted of 42 Austrians under Colloredo south of the Sambre and 42 Dutch under Orange north of the river. Colloredos force included 42 battalions, 42 companies and eight squadrons. The Army of Observation totaled 42 infantry and 42 cavalry, distributed in three main divisions. Franz Xaver von Wenckheim commanded 42 foot and 42 horse, west of the Sambre in the ": null
    },
    {
        "Forêt de Mormal": "forêt de mormal"
    },
    {
        ". Hoditz directed 42 foot and 42 horse on the east of Maubeuge and Clerfayt led 42 foot and 42 horse on the south side of Maubeuge. Clerfayt divided his corps into three groups under ": null
    },
    {
        "Count Heinrich von Bellegarde": "count heinrich von bellegarde"
    },
    {
        ", Joseph Binder von Degenschild and Ludwig von Terzi.     The Coalition forces began constructing extensive siege works around Maubeuge. On the first day, the French garrison ": null
    },
    {
        "sortie": "sortie"
    },
    {
        "d against the Cense de Château but were repulsed after stiff fighting. Maubeuge was supplied for a normal garrison but far too many soldiers were trapped there. On 42 October, Ferrand had to put the troops on half-rations, while hundreds of sick and dying soldiers crowded the hospitals. On the 42 October, the French enjoyed initial success in a sortie against the Bois du Tilleul, but troops sent out to help mistakenly fired on their own friends and the French were compelled to retreat. The Coalition established batteries of 42 42-pound cannons against the town. After the Coalition army opened its bombardment on the night of 42 October, the morale of the garrison sank. When some soldiers complained to Chancel that they were hungry and tired he replied, Listen young men, it takes a lot of work and privation in order to gain the honor to fight and die for your country.  Representative ": null
    },
    {
        "Jean-Baptiste Drouet": "jean-baptiste drouet"
    },
    {
        " tried to cut his way out of Maubeuge with some dragoons but was captured. Denounced for abandoning the place, Drouet claimed his escape would have raised the spirits of the garrison.       Leaving 42 soldiers in the Camp of Gavrelle to support Bouchain and Cambrai, Jourdan immediately moved to the relief of Maubeuge with the remaining 42 men. He also called in 42 reinforcements from the Camp de Madelaine and 42 more from farther north. Without waiting for the troops from the north, Jourdan assembled a division under ": null
    },
    {
        "Jacques Fromentin": "jacques fromentin"
    },
    {
        ". Leaving the camp on 42 October, it arrived at ": null
    },
    {
        "Guise": "guise"
    },
    {
        " on the 42th. That same day ": null
    },
    {
        "Antoine Balland": "antoine balland"
    },
    {
        "s division left the Camp of Gavrelle and reached Guise on 42 October. Berú promptly sent Gratiens brigade and other units from Lille and Mons-en-Pévèle, this body of 42 soldiers was assigned to ": null
    },
    {
        "Florent Joseph Duquesnoy": "florent joseph duquesnoy"
    },
    {
        ".     Left wing commander Jean-Baptiste Davaine sent 42 troops under Martin Jean Carrion de Loscondes which arrived at Guise on 42 October. The ": null
    },
    {
        "Committee of Public Safety": "committee of public safety"
    },
    {
        " placed the Army of Ardennes under Jourdans control on 42 October. The armys commander Ferrand was immured in Maubeuge and orders were sent for one detachment to operate from ": null
    },
    {
        "Philippeville": "philippeville"
    },
    {
        ". A motley force of 42 men was assembled under ": null
    },
    {
        "Pierre Raphaël Paillot de Beauregard": "pierre raphaël paillot de beauregard"
    },
    {
        " and reached ": null
    },
    {
        "Fourmies": "fourmies, nord"
    },
    {
        " on 42 October. The next day, several units from the north joined Beauregards division. Jourdans army shifted east from Guise to ": null
    },
    {
        "Avesnes-sur-Helpe": "avesnes-sur-helpe"
    },
    {
        " between 42 and 42 October.     On 42 October, Jourdan and Committee of Public Safety member ": null
    },
    {
        "Lazare Carnot": "lazare carnot"
    },
    {
        " reconnoitered the Coalition front south of Maubeuge. The numerical strength of the army was 42 infantry and 42 cavalry for a grand total of 42, with the troops distributed as follows. Fromentins division numbered 42 men including 42 cavalry. Carrions division, now under ": null
    },
    {
        "Étienne Jean-François Cordellier-Delanoüe": "étienne jean-françois cordellier-delanoüe"
    },
    {
        ", counted 42 troops including 42 horsemen. Ballands division consisted of 42 soldiers, of which 42 were cavalry. Duquesnoys division had 42 men including 42 mounted troops. Beauregards division comprised 42 troops of which 42 were horsemen. Historian ": null
    },
    {
        "Ramsay Weston Phipps": "ramsay weston phipps"
    },
    {
        " remarked that Beauregards men were bad troops under a bad General .              The Austrian covering force was entrenched and though Clerfayt was in nominal command, Coburg was on the scene and in control of the battle. Coburg was so certain of success that he was supposed to have said that if he were defeated, he would become a sans-culotte. This story made the rounds in the French army and made its soldiers eager to make the Coalition commander wear trousers.     On the morning of 42 October, Bellegarde held the Coalition right flank with about 42 troops in three battalions of foot and 42 squadrons of horse. The extreme right touched the Sambre at Berlaimont. Clerfayt defended the center with 42 soldiers, deployed along a west-to-east line of villages. Supported by division commanders were ": null
    },
    {
        "Franz Joseph, Count Kinsky": "franz joseph, count kinsky"
    },
    {
        " and Joseph Karl von Lilien, Clerfayt controlled five battalions of ": null
    },
    {
        "grenadier": "grenadier"
    },
    {
        "s, five battalions of regulars,  battalion of Croats, four infantry companies and 42 cavalry squadrons. Terzi was posted on the left flank at Wattignies with 42 men in three battalions of foot and 42 squadrons of horse. The extreme left at ": null
    },
    {
        "Obrechies": "obrechies"
    },
    {
        " was defended by ": null
    },
    {
        "Karl Joseph Hadik von Futak": "karl joseph hadik von futak"
    },
    {
        " and 42 soldiers. Far to the east at ": null
    },
    {
        "Beaumont": "beaumont, belgium"
    },
    {
        ", Johann Andreas Benjowsky commanded 42 troops organized as three battalions and 42 squadrons.     From right to left the French divisions were Beauregard at ": null
    },
    {
        "Solre-le-Château": "solre-le-château"
    },
    {
        ", Duquesnoy on the main road from Avesnes-sur-Helpe, Balland in reserve at ": null
    },
    {
        "Avesnelles": "avesnelles"
    },
    {
        ", Cordellier at La Capelle and Fromentin at ": null
    },
    {
        "Dompierre-sur-Helpe": "dompierre-sur-helpe"
    },
    {
        ". Duquesnoy and Beauregard moved to attack Wattignies, while Fromentin advanced against the Austrian right flank. Jourdan enjoyed a two-to-one superiority and the Coalition generals had to be anxious about the 42 French soldiers at Maubeuge.          On the right, Beauregards men left Solre-le-Château at 42:42 am. Near Obrechies, four squadrons of Austrian cavalry charged them and drove them off, with the loss of three field guns. Duquesnoys division departed ": null
    },
    {
        "Flaumont": "flaumont-waudrechies"
    },
    {
        " at 42:42 am and marched through ": null
    },
    {
        "Beugnies": "beugnies"
    },
    {
        ", ": null
    },
    {
        "Dimont": "dimont"
    },
    {
        " and ": null
    },
    {
        "Dimechaux": "dimechaux"
    },
    {
        ". Supported by a plentiful artillery, the French infantry drove two Austrian battalions out of Wattignies, but as the French poured out of the other side of the village they were met by an infantry-cavalry counterattack. Duquesnoys soldiers abandoned Wattignies and retreated to Dimechaux and Dimont.     On the far left, Cordelliers division advanced on ": null
    },
    {
        "Leval": "leval, nord"
    },
    {
        " and ": null
    },
    {
        "Monceau-Saint-Waast": "monceau-saint-waast"
    },
    {
        " while farther east, Fromentins division attacked toward ": null
    },
    {
        "Saint-Remy-Chaussée": "saint-remy-chaussée"
    },
    {
        " and ": null
    },
    {
        "Saint-Aubin": "saint-aubin, nord"
    },
    {
        ". Bellegardes cannons opened fire in mid-morning, starting a mutual bombardment. The French infantry crossed a ravine and grappled for possession of Saint-Aubin village with a Croatian infantry battalion. In the afternoon Bellegarde launched a counterattack led by Austrian regular infantry, while two regiments of cavalry swept down on the French left flank. The Austrians captured eight French cannon and caused the French to flee to the safety of the ravine.     In the center, Clerfayt deployed five grenadier battalions in the villages of ": null
    },
    {
        "Dourlers": "dourlers"
    },
    {
        ", Mont-Dourlers, ": null
    },
    {
        "Floursies": "floursies"
    },
    {
        " and along the Monceau Road. This east–west sunken road was located on a reverse slope, just south of Dourlers. The French Royalists and some Croatians guarded the forest to the east, while the Croatian battalion fought to the west at Saint-Aubin. The remaining battalions of Austrian regular foot and all the horse occupied a ridge behind the line of villages.     Jourdan, Carnot and Representative ": null
    },
    {
        "Ernest Dominique François Joseph Duquesnoy": "ernest dominique françois joseph duquesnoy"
    },
    {
        " accompanied Ballands division in the center. The army commander planned to wait for the attacks of his two wings to make significant progress before launching the attack of Ballands division. In mid-morning, the division filed out of the woods in front of Dourlers and opened fire with its artillery. Seeing the initial success of the two wings, Carnot wanted the attack to be started at once. Jourdan wanted more ground to be gained on the flanks but the politician would not be denied. Finally, Jourdan put himself at the head of Ballands division and ordered the assault. As the French soldiers came over the crest of the ridge in front on the sunken road, they came under murderous fire from the crack Austrian grenadiers. Despite heroic attempts to get light artillery forward, cannons were dismounted and gunners and horses were shot down. In the thick of the bullets, Jourdan bravely urged his troops on but an Austrian force appeared from the direction of Saint-Aubin, threatening the French left flank. At nightfall the representatives authorized a retreat after Ballands division had lost between 42 and 42 casualties.            During the night, French deserters wrongly reported to the Austrians that Jourdan was reinforced to 42 men. Believing he was going to be attacked again, Coburg reinforced his covering force by five battalions of about 42 men and rearranged his defenses. On the left, Terzi had 42 foot soldiers in seven regular battalions and 42 cavalry in 42 squadrons. The center under Clerfayt counted 42 foot and 42 horse. This force was made up of five grenadier battalions, two regular battalions,  of a battalion of Croats, four companies and six squadrons of French Royalists and six squadrons of ": null
    },
    {
        "cuirassier": "cuirassier"
    },
    {
        "s. Bellegardes right wing was composed of 42 infantry in seven regular battalions and 42 light cavalry in 42 squadrons. Altogether, the covering force numbered about 42 infantry and 42 cavalry.     According to Carnot, he argued that Wattignies on the Austrian left was the key to the position but that Jourdan wanted to attack the Austrian right. Phipps believed that Carnots account was nonsense and that the course of the battle was typical of Jourdans tactics. Jourdans account only stated that he gave the order to attack Wattignies. Fromentin on the left was instructed not to mount a serious attack. Cordellier was ordered to act under Fromentins orders and also reinforce Balland with three battalions and a cavalry regiment. Balland was directed to place nine battalions plus two cavalry regiments at Jourdans disposal. The rest of Ballands division was to form line of battle and use its light troops to probe the enemy positions. The divisions of Beauregard and Duquesnoy numbered 42 soldiers, to these, Jourdans special force added about 42 men.     On 42 October, Fromentins two divisions on the left flank and Ballands division in the center skirmished all day. Bellegarde and Clefayt held the bulk of their strength in their main positions. Jourdan mounted the main French assault against the height of Wattignies in three columns from Dimont, Dimechaux and ": null
    },
    {
        "Choisies": "choisies"
    },
    {
        ". The main attack was also supported by additional artillery. When an early morning fog lifted in mid-morning, the French artillery opened a barrage on Wattignies. Duquesnoys division formed the two right columns while Jourdans detachment made up the left column. After being driven back twice by heavy fire, the French columns forced their way into Wattignies in the early afternoon. A counterattack from the northwest briefly pushed back the French, who were rallied by Jourdan. More French troops came up and defeated the Austrian attack. Duquesnoy sent Gratiens brigade forward but it was caught by Austrian cavalry in the open and thrown back. By this time, the French had dragged a battery up to the Wattignies heights to support the infantry. Under pressure from infantry and artillery, Terzis division recoiled to the north. On the right of Duquesnoy, Beauregards division attacked Obrechies, which was defended by Hadik with two battalions of regulars and eight squadrons of cavalry. As the French began breaking into the village, Hadik launched attacks from three directions at once, routing Beauregards men. The French abandoned five cannon and fled back to Solrinnes. According to one observer, they did not stop until they reached Solre-le-Château.       Far to the east, a column of French conscripts under Jacob Job Élie, set out from Philippeville toward Beaumont. In the early hours of 42 October, they were attacked by Coalition troops and fled. Élie managed to rally his soldiers and arrange them in two lines near ": null
    },
    {
        "Boussu-lez-Walcourt": "boussu-lez-walcourt"
    },
    {
        ". At dawn when the Austrians attacked again, the second line fired a volley into the backs of the first line and all the infantry took to their heels. ": null
    },
    {
        "Louis Henri Loison": "louis henri loison"
    },
    {
        " capably covered the retreat with the French cavalry, saving the foot soldiers from being cut to pieces. As it was, Élie lost 42 men and 42 artillery pieces, while only 42 casualties were suffered by Benjowskys division.            Prepared for a long battle, Jourdan reinforced Duquesnoys division at Wattignies and ordered it to entrench. The Duke of York arrived from the northwest with 42 men to reinforce Coburg. The Austrian commander-in-chief had plenty of soldiers but the Prince of Orange denied a request to send any of his soldiers to the south side of the Sambre. Fearful of a sortie by the large garrison of Maubeuge, Coburg lifted the siege and retreated across the river at Hautmont and Buissière. Chancel recommended an attack on the retreating army but Ferrand declined to intervene. The Maubeuge garrison made a weak sortie on 42 October but remained inert the next day. On 42 October, the garrison sent out a column to the south to meet with Jourdan, instead of to the north after the retreating Coalition forces.     The Coalition reported losses of 42 killed, 42 wounded and 42 captured or missing, a total of 42 casualties. French losses were estimated at 42. Another authority numbered French losses as 42 killed, wounded and missing. The Austrians sustained 42 killed and wounded while an additional 42 men were captured. A third source also gave casualty figures of 42 French and 42 Austrians and added that the French lost 42 artillery pieces. A fourth source estimated losses as 42 on each side. For the poor performance of the Maubeuge garrison, Chancel was blamed, arrested, convicted and guillotined. For the rout of his brigade, Gratien was arrested but eventually acquitted. ": null
    },
    {
        "Claude Lecourbe": "claude lecourbe"
    },
    {
        " distinguished himself in the attack on Wattignies on 42 October. ": null
    },
    {
        "Édouard Mortier": "édouard mortier"
    },
    {
        " was wounded at Dourlers on 42 October. ": null
    },
    {
        "Jean-Baptiste Bernadotte": "jean-baptiste bernadotte"
    },
    {
        " fought in Ballands division and ": null
    },
    {
        "Michel Ney": "michel ney"
    },
    {
        " was probably in Fromentins division.       Jourdan did not follow up his victory; after adding the Maubeuge garrison, he had about 42 French soldiers, opposed by 42 well-entrenched Coalition troops on the north bank of the Sambre, from ": null
    },
    {
        "Solesmes": "solesmes, nord"
    },
    {
        " on the west to ": null
    },
    {
        "Thuin": "thuin"
    },
    {
        " on the east. Though there was time for more operations, Coburg moved his army into winter quarters. While Jourdan was with the right wing of the Army of the North, the operations of the left wing under Davaine failed. Davaine was tried and executed at the same time as Chancel.     In Paris, Carnot demanded an advance on ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        " and Jourdan tried to comply but found that the Coalition held all the river crossings and heavy rain had ruined the roads. After threatening to resign on 42 November, the army commander was recalled to Paris to speak with the Committee of Public Safety. This was the usual prelude to arrest and execution but Jourdan was allowed to return to the army and put his soldiers in winter quarters. After reinforcing the  Army of the West  and the  Army of the Moselle  each with 42 men, time was wasted in denouncing generals Duquesnoy, Meyer and Gudin. On 42 January 42 Jourdan was accused of not protecting the frontier and summoned again to Paris. He was passionately defended by Representative Duquesnoy before the Committee of Public Safety and only dismissed from the army.            The Carnot version of history is evident in the ": null
    },
    {
        "Encyclopædia Britannica ": "encyclopædia britannica"
    },
    {
        " account:     Jourdan wished to renew the left attack, but Carnot, the engineer, considered the Wattignies plateau the key of the position and his opinion prevailed. In the night the nearly equal partition of force, which was largely responsible for the failure, was modified, and the strength of the attack massed opposite Wattignies.     Historian ": null
    },
    {
        "Michael Glover": "michael glover"
    },
    {
        " presented Carnot as a meddler and wrote of the politically powerful Committee of Public Safety member,     Carnots talents as the organizer of victory are beyond dispute, but his tactical skills were minimal, a defect he concealed by a careful rewriting of history. To drive away a poorly led covering force of 42 with the 42 available to the Army of the North should have posed no great problem, but the business was sadly bungled. Carnot insisted that there should be a double encircling movement, a favorite maneuver of his, combined with a frontal attack, thus carefully dispersing the French numerical superiority.     Carnot believed that General Duquesnoy was capable but recognized that Balland and Fromentin were not very good generals and had no use at all for Cordellier. Phipps pointed out that none of Jourdans division commanders fought under ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ". Jourdan later noted that Coburg erred by placing the Army of Observation too close to Maubeuge. He asserted that if Coburg had defended Avesnes-sur-Helpe, the relief army would have been in difficulty. He thought that Benjowskys force should have been posted at Obrechies. A British observer, ": null
    },
    {
        "Harry Calvert": "harry calvert"
    },
    {
        " credited the powerful French artillery for the victory. ": null
    },
    {
        "Louis Alexandre Andrault de Langeron": "louis alexandre andrault de langeron"
    },
    {
        ", a French Royalist who emigrated to the ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        " attributed the Coalition failure to the Dunkirk expedition that split the army, the retreat from Maubeuge, chronic slowness and the disastrous system of forming a cordon, which causes one to be weak everywhere .     Phipps summed up the failure of the Coalition with a ": null
    },
    {
        "cricket": "cricket"
    },
    {
        " analogy.     The Allies totally failed to see that the best way to defend the length of the frontier was to concentrate and to crush Jourdan, and although they were well informed about his collecting troops at Guise, they allowed him to bring up slowly superior forces against one link of their long chain, as if their posts were so many players, each bound to defend his own wicket.": null
    }
]