[
    {
        "           The Battle of Świecino  also called the Battle of Żarnowiec  or in German Battle of Schwetz, took place on September 17, 1462 during the ": null
    },
    {
        "Thirteen Years War": "Thirteen Years War"
    },
    {
        ". The ": null
    },
    {
        "Poles": "Kingdom Of Poland"
    },
    {
        " commanded by ": null
    },
    {
        "Piotr Dunin": "Piotr Dunin"
    },
    {
        ", consisting of some 2,000 mercenaries and Poles, decisively defeated the 2,700 man army of the ": null
    },
    {
        "Teutonic Knights": "Teutonic Knights"
    },
    {
        " commanded by ": null
    },
    {
        "Fritz Raweneck": "Fritz Raweneck"
    },
    {
        " and ": null
    },
    {
        "Kaspar Nostyc": "Kaspar Nostyc"
    },
    {
        ". Auxiliary forces sent by duke ": null
    },
    {
        "Eric II of Pomerania": "Eric Ii Of Pomerania"
    },
    {
        ", an ally of the Polish king, did not enter the battle.       The Polish forces consisted mostly of the mercenaries hired by the Polish king, ": null
    },
    {
        "Casimir IV the Jagiellon": "Casimir Iv Of Poland"
    },
    {
        " and the city of Danzig . This army included 1000 cavalry, of which 112 were heavy cavalry, and another 1000 of infantry. 1000 cavalry and 400 infantry were mercenaries hired by Polish king, while the rest were units from Danzig .       Most of the ": null
    },
    {
        "Teutonic army": "Teutonic Knights"
    },
    {
        ", under the command of Fritz Raweneck and Kaspar Nostyc, were troops gathered from the nearby castles Mewe , Stargard , ": null
    },
    {
        "Nowe": "Nowe"
    },
    {
        ", ": null
    },
    {
        "Skarszewy": "Skarszewy"
    },
    {
        " and ": null
    },
    {
        "Kiszewy": "Kiszewy"
    },
    {
        ". This army totalled 1000 cavalry and 400 infantry. Raweneck also had the supply chain , cannons and up to 1300 auxiliary infantry of Pomeranian peasants, used mainly for fortification works.       The battle started in the evening. Adopting a relatively new tactic, Polish units built a fortified camp on the Hussite model consisting of wagons linked by a chain surrounded by a deep ditch . The units of Raveneck and his subordinate, Kaspar Nostyc ": null
    }
]