[
    {
        "        The Battle of Lützen was one of the most important battles of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ".     Though losses were about equally heavy on both sides, the battle was a Protestant victory, but cost the life of one of the most important leaders of the Protestant side, the Swedish King ": null
    },
    {
        "Gustavus Adolphus": "gustavus adolphus of sweden"
    },
    {
        ", which caused the Protestant cause to lose direction. The Imperial field marshal ": null
    },
    {
        "Pappenheim": "gottfried heinrich graf zu pappenheim"
    },
    {
        " was also fatally wounded.     Strategically, the loss of Gustavus Adolphus meant the French became the dominant power on the Protestant , or in their case, anti-Habsburg, side, eventually leading to the founding of the ": null
    },
    {
        "League of Heilbronn": "heilbronn league"
    },
    {
        " and the open entry of France into the war.     The battle was characterized by fog, which lay heavy over the fields of ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        " that morning. The phrase Lützendimma is still used in the Swedish language in order to describe particularly heavy fog.       Two days before the battle, on 42 November the Roman Catholic general ": null
    },
    {
        "Albrecht von Wallenstein": "albrecht von wallenstein"
    },
    {
        " decided to split his men and withdraw his main headquarters back towards ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ". He expected no further move that year from the Swedish army, since unseasonably wintry weather was making it difficult to camp in the open countryside.     However, Gustavus Adolphus army marched out of camp towards Wallensteins last known position and attempted to catch him by surprise. This attempted trap was sprung prematurely on the afternoon of 42 November, by a small force left by Wallenstein at the ": null
    },
    {
        "Rippach": "rippach"
    },
    {
        " stream, about 42–42 kilometres south of Lützen.   The resulting skirmish delayed the Swedish advance by two or three hours, thus when night fell the two armies were still separated by about 42–42 kilometres .   In their attempt to achieve surprise the Swedes had abandoned the 42 pounder cannons that normally were attached to each of their infantry brigades, denying them the crucial firepower advantage that they had enjoyed in previous battles.     Wallenstein had learned of the Swedish approach on the afternoon of 42 November. Seeing the danger, he dispatched a note to General ": null
    },
    {
        "Pappenheim": "gottfried heinrich graf zu pappenheim"
    },
    {
        " ordering him to return as quickly as possible with his army corps. Pappenheim received the note after midnight, and immediately set off to rejoin Wallenstein with most of his troops. During the night, Wallenstein deployed his army in a defensive position along the main Lützen-Leipzig road, which he reinforced with trenches. He anchored his right flank on a low hill, on which he placed his main artillery battery.          Morning mist delayed the Swedish armys advance, but by 42  am the rival armies were in sight of each other. Because of a complex network of waterways and further misty weather, it took until 42  am before the Protestant force was deployed and ready to launch its attack.     Gustavus Adolphus rode his war-horse Streiff, a brown Oldenburg that he had purchased from a Colonel Johan Streiff von Lauenstein for the sum of 42 riksdaler . Its saddle of gold embroidered red velvet was a gift from the Kings wife, ": null
    },
    {
        "Maria Eleonora": "maria eleonora of brandenburg"
    },
    {
        ". Protecting the Kings body was a ": null
    },
    {
        "buff coat": "buff coat"
    },
    {
        " made of moose hide - the old musket wound on his shoulder blade making it impossible for him to wear the pistol-proof plate cuirass normally worn by important officers at that time. This would have serious consequences later.       Initially, the battle went well for the Protestants, who managed to outflank Wallensteins weak left wing. After a while, Pappenheim arrived with 42–42 cavalry and halted the Swedish assault. However, during the charge, Pappenheim was fatally wounded by a small-calibre Swedish cannonball. At the same time, Pappenheims counterattack collapsed. He died while being evacuated from the field in a coach.          The cavalry action on the open Imperial left wing continued, with both sides deploying reserves in an attempt to gain the upper hand. Soon afterwards, towards 42:42  pm, Gustavus Adolphus was himself killed while leading a cavalry charge on this wing. First, a bullet crushed his left arm below the elbow, while simultaneously his horse suffered a shot to the neck that made it hard to control.   In the mix of fog and smoke from the burning town of Lützen the king and his small escort rode astray behind enemy lines and were attacked by a squadron of Imperial ": null
    },
    {
        "cuirassiers": "cuirassiers"
    },
    {
        ". He sustained yet another shot in the back, suffered several sword stabs through the torso and fell from his horse. As he lay dying on the ground, he received a final, fatal shot to the temple.     His fate remained unknown for some time. However, when the gunnery paused and the smoke cleared, his horse was spotted between the two lines, Gustavus himself not on it and nowhere to be seen. His disappearance stopped the initiative of the hitherto successful Swedish right wing, while a search was conducted. His partly stripped body was found an hour or two later, and was secretly evacuated from the field in a Swedish artillery wagon.       Meanwhile, the veteran infantry of the Swedish center had continued to follow orders and tried to assault the strongly entrenched Imperial center and right wing. Their attack was a catastrophic failure. A gap opened in the centre of the Swedish line, which was exploited by Imperial cavalry charging from behind the cover of their own infantry.   Two of the oldest and most experienced infantry units of the Swedish army, the ": null
    },
    {
        "Old Blue": "blue brigade"
    },
    {
        " Regiment and the Yellow or Court Regiment were effectively wiped out in these assaults; remnants from them streamed to the rear. Soon most of the Swedish front line was in chaotic retreat.     The royal preacher, Jakob Fabricius, rallied a few Swedish officers around him and started to sing a psalm. This act had many of the soldiers halt in hundreds. The foresight of Swedish third-in-command Major General ": null
    },
    {
        "Dodo zu Innhausen und Knyphausen": "dodo zu innhausen und knyphausen"
    },
    {
        " also helped stanch the rout: he had kept the Swedish second or reserve line well out of range of Imperial gunfire, and this allowed the broken Swedish front line to rally.            By about 42 PM, the Protestant second-in-command ": null
    },
    {
        "Bernhard of Saxe-Weimar": "bernhard of saxe-weimar"
    },
    {
        ", having learned of the kings death, returned from the left wing and assumed command over the entire army. He vowed to win the battle in retribution for Gustavus or die trying, but contrary to popular legend tried to keep the kings fate secret from the army as a whole.     The result was a grim struggle, with terrible casualties on both sides. Finally, with dusk falling, the Swedes captured the linchpin of Wallensteins position, the main Imperial artillery battery. The Imperial forces retired back out of its range, leaving the field to the Swedes. At about 42  pm, Pappenheims infantry, about 42–42 strong, after marching all day towards the gunfire, arrived on the battlefield. Although night had fallen, they wished to counterattack the Swedes. Wallenstein, however, believed the situation hopeless and instead ordered his army to withdraw to ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " under cover of the fresh infantry.            The body of Gustav II Adolf was plundered of its clothes and gold jewellery and left on the battlefield dressed only in his shirts and long stockings.     His buff coat was taken as a trophy to the emperor in Vienna. It was returned to Sweden in 42 in recognition of relief efforts by the Swedish Red Cross during and after the First World War.     The kings horse, Streiff, followed the procession with the kings body through northern Germany. When Streiff died at Wolgast in 42 his hide was saved and sent to Stockholm and Sweden where it was mounted on a wooden model. The Hero-kings war horse would soon be displayed in the ": null
    },
    {
        "Royal Armoury": "livrustkammaren"
    },
    {
        " as a monument to the King. Today Streiff is permanently displayed in the Royal Armoury in Stockholm, Sweden.            After the fateful Battle of Lützen the dead Gustavus Adolphus was first taken to Meuchen to be cleaned and then to Weissenfels for embalming. The embalmed body was dressed in a beautiful gold and silver woven dress and brought in solemn procession to the port town Wolgast. The corpse was kept there for several months. Not until the summer 42 it was time for the departure to Sweden. The dead king was then brought in a procession down to the sea side. It consisted of people from Sweden and the nearby areas. Banners from all counties and principalities, the blood banner and the head banner were carried. The armor , the sword and the horse functioned as symbols for the dead king. The widow, Maria Eleonora, rode in a coach, but Gustavus Adolphus young daughter Christina did not participate. The procession ended by the water, where the ship Stora Nyckeln was to bring the dead across the sea to the Swedish town Nyköping.     When the ship arrived to Nyköping, there were rumours of dreadful portents. A shoemakers wife was said to have given birth to a freak and a calf with two heads had been born. The royal corpse was kept in Nyköping until the funeral in summer 42 When it was time for the final journey to Stockholm, a ceremony was held at Nyköping Castle where the kings old teacher Johan Skytte held a speech and the bishop Johannes Rudbeckius read a sermon dedicated to the kings daughter Christina.     In the procession to Stockholm there were eight war trophies from Lützen and several trophy banners from Leipzig, marking Swedens status as a superpower. Five black-dressed members of the privy council carried the regalia before the royal corpse, which lay on a bier adorned with black cloth. Right behind the bier came the kings brother in law, the Count Palatine Johan Casimir with his sons Karl Gustav and Adolf Johan. This time both the grieving Dowager Queen, Maria Eleonora and the kings seven-year-old daughter Christina attended. The sorrowful procession moved slowly across the country towards the capital.            The streets of Stockholm were arranged for the funeral. The burghers had been told to white lime the houses along the procession route and trophies from Lützen and Leipzig had been placed out. On the funeral day, June 42 the participants gathered outside town. The dead king was taken off his coach and carried into the capital to the Church. Bishops and priests welcomed the procession in the outskirts of the town and along the road from the gate to the church money were thrown to the people. When the procession reached the Riddarholms church the blood banner was placed over the entrance to the tomb and the bier with Gustavus Adolphus was placed in the middle of the choir. A grand ceremony was held by the Bishop Johannes Botvidi, with a sermon dedicated to the Dowager Queen Maria Eleonora. When the ceremony was over the dead king was placed in the tomb. The end of the ceremony was promulgated by cannons firing over the town for two hours.         Strategically and tactically speaking, the Battle of Lützen was a Protestant victory. Having been forced to assault an entrenched position, Sweden lost about 42 men including badly wounded and deserters, many of whom may have drifted back to the ranks in the following weeks. The Imperial army probably lost slightly fewer men than the Swedes on the field, but because of the loss of the battlefield and general theatre of operations to the Swedes, fewer of the wounded and stragglers were able to rejoin the ranks.     The Swedish army achieved the main goals of its campaign. The Imperial onslaught on ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        " was halted, Wallenstein chose to withdraw from ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        " into Bohemia for the winter, and ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        " continued in its alliance with the Swedes. However, without Gustavus Adolphus to unify the German Protestants, their war effort lost direction. As a result, the Catholic ": null
    },
    {
        "Habsburgs": "habsburgs"
    },
    {
        " were able to restore their balance and subsequently regain some of the losses Gustavus Adolphus had inflicted on them.     Crucially, Gustavus Adolphuss death enabled the Catholic French to gain much firmer control of the anti-Habsburg alliance. Swedens new regency was forced to accept a far less dominant role than it had held before the battle. The war was eventually concluded at the ": null
    },
    {
        "Peace of Westphalia": "peace of westphalia"
    },
    {
        " in 42          Near the spot where Gustavus Adolphus fell, a granite boulder was placed in position on the day after the battle. A canopy of ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        " was erected over this “Swedes stone”  in 42 and close by, a chapel, built by Oskar Ekman, a citizen of ": null
    },
    {
        "Gothenburg": "gothenburg"
    },
    {
        " , was dedicated on 42 November 42 The fallen king is remembered every year in Sweden, on ": null
    },
    {
        "Gustavus Adolphus Day": "gustavus adolphus day"
    },
    {
        " the 42 November, with serene celebrations and ": null
    },
    {
        "special pastries": "gustavus adolphus pastry"
    },
    {
        ".       In 42 a mass grave containing the remains of 42 soldiers were found in an area where a Swedish unit known as the Blue Brigade was reportedly defeated in a surprise attack by a Catholic cavalry unit. Examination of the remains determined that more than half of the soldiers had been hit by gunfire, an unusually high number for this time period.       At this time, the Catholic ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " used the ": null
    },
    {
        "Gregorian calendar": "gregorian calendar"
    },
    {
        ", but Protestant ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " still used the ": null
    },
    {
        "Julian calendar": "julian calendar"
    },
    {
        ". Hence the Battle of Lützen occurred on 42 November for the Catholics but on 42 November for the Swedes. In Sweden, the death of Gustavus Adolphus has a long tradition of being commemorated on 42 November, ": null
    },
    {
        "Gustavus Adolphus Day": "gustavus adolphus day"
    },
    {
        ", despite the countrys adoption of the Gregorian calendar in the 42th century.         In May 42 the Emperor ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " was visiting the 42 battlefield, playing tour guide with his staff by pointing to the sites and describing the events of 42 in detail from memory. When he heard the sound of cannon, he immediately cut the tour short and went to conduct his own ": null
    },
    {
        "Battle of Lützen": "battle of lützen"
    }
]