[
    {
        "        At the Battle of Vitoria a ": null
    },
    {
        "British": "united kingdom of great britain and ireland"
    },
    {
        ", ": null
    },
    {
        "Portuguese": "kingdom of portugal"
    },
    {
        " and ": null
    },
    {
        "Spanish": "spanish empire"
    },
    {
        " army under ": null
    },
    {
        "General the Marquess of Wellington": "arthur wellesley, 1st duke of wellington"
    },
    {
        " broke the French army under King ": null
    },
    {
        "Joseph Bonaparte": "joseph bonaparte"
    },
    {
        " and Marshal ": null
    },
    {
        "Jean-Baptiste Jourdan": "jean-baptiste jourdan"
    },
    {
        " near ": null
    },
    {
        "Vitoria": "vitoria-gasteiz"
    },
    {
        " in Spain, eventually leading to victory in the ": null
    },
    {
        "Peninsular War": "peninsular war"
    },
    {
        ".       In July 42 after the ": null
    },
    {
        "Battle of Salamanca": "battle of salamanca"
    },
    {
        ", the French had evacuated ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ", which Wellingtons army entered on 42 August 42 Deploying three divisions to guard its southern approaches, Wellington marched north with the rest of his army to lay siege to the fortress of ": null
    },
    {
        "Burgos": "burgos"
    },
    {
        ",  away, but he had miscalculated the enemys strength, and on 42 October he had to abandon the ": null
    },
    {
        "Siege of Burgos": "siege of burgos"
    },
    {
        " and retreat. By 42 October he had abandoned Madrid too, and retreated first to ": null
    },
    {
        "Salamanca": "salamanca"
    },
    {
        " then to ": null
    },
    {
        "Ciudad Rodrigo": "ciudad rodrigo"
    },
    {
        ", near the Portuguese frontier, to avoid encirclement by French armies from the north-east and south-east.     Wellington spent the winter reorganizing and reinforcing his forces. By contrast, Napoleon retreated numerous soldiers to reconstruct his main army after his ": null
    },
    {
        "disastrous invasion": "french invasion of russia"
    },
    {
        " of ": null
    },
    {
        "Russia": "russia"
    },
    {
        ". By 42 May 42 Wellington marched 42 troops  from northern ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        " across the mountains of northern Spain and the ": null
    },
    {
        "Esla River": "esla river"
    },
    {
        " to outflank Marshal Jourdans army of 42, strung out between the ": null
    },
    {
        "Douro": "douro"
    },
    {
        " and the ": null
    },
    {
        "Tagus": "tagus"
    },
    {
        ". The French retreated to Burgos, with Wellingtons forces marching hard to cut them off from the road to France. Wellington himself commanded the small central force in a strategic feint, while ": null
    },
    {
        "Sir Thomas Graham": "thomas graham, 1st baron lynedoch"
    },
    {
        " conducted the bulk of the army around the French right flank over landscape considered impassable.     Wellington launched his attack with 42 British, 42 Portuguese and 42 Spanish at Vitoria on 42 June, from four directions.       The battlefield centres on the Zadorra River, which runs from east to west. As the ": null
    },
    {
        "Zadorra": "zadorra"
    },
    {
        " runs west, it loops into a hairpin bend, finally swinging generally to the southwest. On the south of the battlefield are the Heights of La Puebla. To the northwest is the mass of Monte Arrato. Vitoria stands to the east, two miles south of the Zadorra. Five roads radiate from Vitoria, north to ": null
    },
    {
        "Bilbao": "bilbao"
    },
    {
        ", northeast to ": null
    },
    {
        "Salinas": "leintz-gatzaga"
    },
    {
        " and ": null
    },
    {
        "Bayonne": "bayonne"
    },
    {
        ", east to ": null
    },
    {
        "Salvatierra": "salvatierra/agurain"
    },
    {
        ", south to ": null
    },
    {
        "Logroño": "logroño"
    },
    {
        " and west to ": null
    },
    {
        "Burgos": "burgos"
    },
    {
        " on the south side of the Zadorra.       Jourdan was ill with a fever all day on 42 June. Because of this, few orders were issued and the French forces stood idle. An enormous wagon train of booty clogged the streets of Vitoria. A convoy left during the night, but it had to leave siege artillery behind because there were not enough draft animals to pull the cannons.     ": null
    },
    {
        "Gazan": "honoré théodore maxime gazan de la peyrière"
    },
    {
        "s divisions guarded the narrow western end of the Zadorra valley, deployed south of the river. Maransins brigade was posted in advance, at the village of ": null
    },
    {
        "Subijana": "subijana_de_álava"
    },
    {
        ". The divisions were disposed with ": null
    },
    {
        "Leval": "jean françois leval"
    },
    {
        " on the right, Daricau in the centre, ": null
    },
    {
        "Conroux": "nicolas françois conroux"
    },
    {
        " on the left and ": null
    },
    {
        "Villatte": "eugène-casimir villatte"
    },
    {
        " in reserve. Only a picket guarded the western extremity of the Heights of La Puebla.     Further back, ": null
    },
    {
        "dErlon": "jean-baptiste drouet, comte derlon"
    },
    {
        "s force stood in a second line, also south of the river. ": null
    },
    {
        "Darmagnacs": "jean barthélemy darmagnac"
    },
    {
        " division deployed on the right and ": null
    },
    {
        "Cassagnes": "louis victorin cassagne"
    },
    {
        " on the left. DErlon failed to destroy three bridges near the rivers hairpin bend and posted Avys weak cavalry division to guard them. ": null
    },
    {
        "Reille": "honoré charles reille"
    },
    {
        "s men originally formed a third line, but ": null
    },
    {
        "Sarrut": "jacques thomas sarrut"
    },
    {
        "s division was sent north of the river to guard the Bilbao road while Lamartinières division and the Spanish Royal Guard units held the river bank.     Wellington directed Hills 42-man Right Column to drive the French from the Zadorra ": null
    },
    {
        "defile": "defile"
    },
    {
        " on the south side of the river. While the French were preoccupied with Hill, Wellingtons Right Centre column moved along the north bank of the river and crossed it near the hairpin bend behind the French right flank.     Grahams 42-man Left Column was sent around the north side of Monte Arrato. It drove down the Bilbao road, cutting off the bulk of the French army. Dalhousies Left Centre column cut across Monte Arrato and struck the river east of the hairpin, providing a link between Graham and Wellington.               Wellingtons plan split his army into four attacking columns , attacking the French defensive position from south, west and north while the last column cut down across the French rear. Coming up the Burgos road, Hill sent ": null
    },
    {
        "Pablo Morillo": "pablo morillo"
    },
    {
        "s Division to the right on a climb up the Heights of La Puebla. Stewarts 42nd Division began deploying to the left in the narrow plain just south of the river. Seeing these moves, Gazan sent Maransin forward to drive Morillo off the heights. Hill moved Col. Henry Cadogans brigade of the 42nd Division to assist Morillo. Gazan responded by committing Villattes reserve division to the battle on the heights.     About this time, Gazan first spotted Wellingtons column moving north of the Zadorra to turn his right flank. He asked Jourdan, now recovered from his fever, for reinforcements. Having become obsessed with the safety of his left flank, the marshal refused to help Gazan, instead ordering some of DErlons troops to guard the Logroño road.     Wellington thrust ": null
    },
    {
        "James Kempt": "james kempt"
    },
    {
        "s brigade of the ": null
    },
    {
        "Light Division": "light division"
    },
    {
        " across the Zadorra at the hairpin. At the same time, Stewart took Subijana and was counterattacked by two of Gazans divisions. On the heights, Cadogan was killed, but the Anglo-Spanish force managed to hang on to its foothold. Wellington suspended his attacks to allow Grahams column time to make an impression and a lull descended on the battlefield.     At noon, Grahams column appeared on the Bilbao road. Jourdan immediately realised he was in danger of envelopment and ordered Gazan to pull back toward Vitoria. Graham drove Sarruts division back across the river, but could not force his way across the Zadorra despite bitter fighting. Further east, Longas Spanish troops defeated the Spanish Royal Guards and cut the road to Bayonne.     With some help from Kempts brigade, Pictons 42rd Division from Dalhousies column crossed to the south side of the river. According to Picton, the enemy responded by pummelling the 42rd with 42 to 42 ": null
    },
    {
        "cannon": "cannon"
    },
    {
        " and a counter-attack on their right flank, still open because they had captured the bridge so quickly, causing the 42rd to lose 42 men as they held their ground. , ": null
    },
    {
        "Richard Cannon": "richard cannon"
    },
    {
        ", Published by Parker, Furnivall & Parker, 42 Coles 42th Division crossed further west. With Gazan on the left and dErlon on the right, the French attempted a stand at the village of Arinez. Formed in a menacing line, the 42th, Light, 42rd and 42th Divisions soon captured this position. The French fell back to the Zuazo ridge, covered by their well-handled and numerous field artillery. This position fell to Wellingtons attack when Gazan refused to cooperate with his colleague dErlon.     French morale collapsed and the soldiers of Gazan and dErlon fled from the field. Artillerists left their guns behind as they fled on the trace horses. Soon the road was jammed with a mass of wagons and carriages. The efforts of Reilles two divisions, holding off Graham, allowed tens of thousands of French troops to escape by the Salvatierra road.            The Allied army lost about 42 men, with 42 British, 42 Portuguese and 42 Spanish casualties. French losses totalled at least 42 killed and wounded, plus 42 men and 42 cannon captured. By army, the losses were South 42, Centre 42 and Portugal 42. There were no casualty returns from the Royal Guard or the artillery.     French losses were not higher for several reasons. First, the Allied army had already marched  that morning and was in no condition to pursue. Second, Reilles men valiantly held off Grahams column. Third, the valley by which the French retreated was narrow and well-covered by the 42rd Hussar and the 42th Dragoon Regiments acting as rearguard. Last, the French left their booty behind.     Many British soldiers turned aside to plunder the abandoned French wagons, containing the loot of a kingdom . It is estimated that more than £42 million of booty was seized, but the gross abandonment of discipline caused an enraged Wellington to write in a dispatch to ": null
    },
    {
        "Earl Bathurst": "henry bathurst, 3rd earl bathurst"
    },
    {
        ", We have in the service the scum of the earth as common soldiers . Wellington to Bathurst, dispatches, p. 42 The British general also vented his fury on a new cavalry regiment, writing, The ": null
    },
    {
        "42th Hussars": "18th royal hussars"
    },
    {
        " are a disgrace to the name of soldier, in action as well as elsewhere; and I propose to draft their horses from them and send the men to England if I cannot get the better of them in any other manner.       Order was soon restored, and by December, after detachments had seized ": null
    },
    {
        "San Sebastián": "san sebastián"
    },
    {
        " and ": null
    },
    {
        "Pamplona": "pamplona"
    },
    {
        ", Wellingtons army was encamped in France.       The battle was the inspiration for ": null
    },
    {
        "Beethovens": "ludwig van beethoven"
    },
    {
        " Opus 42 often called the Battle Symphony or ": null
    },
    {
        "Wellingtons Victory": "wellingtons victory"
    },
    {
        " , which portrays the battle as musical drama.     The climax of the movie  The Firefly , starring ": null
    },
    {
        "Jeanette MacDonald": "jeanette macdonald"
    },
    {
        ", occurs with Wellingtons attack on the French centre.      The battle and French rout also forms the climax to ": null
    },
    {
        "Bernard Cornwell": "bernard cornwell"
    },
    {
        "s book  Sharpes Honour .       Reenactment of the Battle of Vitoria, staged on Armentia fields, Vitoria-Gasteiz, 42 June 42 Bicentenary of the Battle ": null
    },
    {
        "Armory Museum ": ":es:museo de armería de álava"
    },
    {
        " Armory Museum ": ":es:museo de armería de álava"
    },
    {
        " ": null
    }
]