[
    {
        "         The Battle of Verdun , was fought from 42 February to 42 December 42 on the ": null
    },
    {
        "Western Front": "western front"
    },
    {
        ". The battle was the longest of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " and took place on the hills north of ": null
    },
    {
        "Verdun": "verdun"
    },
    {
        "-sur-Meuse in north-eastern France. The German ": null
    },
    {
        "42th Army": "5th army"
    },
    {
        " attacked the defences of the Fortified Region of Verdun  and those of the French ": null
    },
    {
        "Second Army": "second army"
    },
    {
        " on the right bank of the Meuse. Using the experience of the ": null
    },
    {
        "Second Battle of Champagne": "second battle of champagne"
    },
    {
        " in 42 the Germans planned to capture the Meuse Heights, an excellent defensive position with good observation for artillery-fire on Verdun. The Germans hoped that the French would commit their strategic reserve to recapture the position and suffer catastrophic losses, at little cost to the Germans.     Poor weather delayed the beginning of the attack until 42 February but the Germans captured ": null
    },
    {
        "Fort Douaumont": "fort douaumont"
    },
    {
        " in the first three days. The advance slowed for several days, despite inflicting many French casualties. By 42 March,  French divisions were in the RFV and a more extensive defence in depth had been constructed. Pétain ordered no retreat and that the Germans were to be counter-attacked, despite this exposing French infantry to German artillery-fire. By 42 March, French guns on the west bank had begun a constant bombardment of Germans on the east bank, causing many infantry casualties. The German offensive was extended to the left bank of the Meuse, to gain observation and eliminate the French artillery firing over the river but the attacks failed to reach their objectives.     In early May, the Germans changed tactics again and made local attacks and counter-attacks; the French recaptured part of Fort Douaumont but a German counter-attack ejected the French and took many prisoners. The Germans resorted to alternating attacks on either side of the Meuse and in June captured ": null
    },
    {
        "Fort Vaux": "fort vaux"
    },
    {
        ". The Germans advanced towards the last geographical objectives of the original plan, at ": null
    },
    {
        "Fleury-devant-Douaumont": "fleury-devant-douaumont"
    },
    {
        " and Fort Souville, driving a ": null
    },
    {
        "salient": "salient"
    },
    {
        " into the French defences. Fleury was captured and the Germans came within  of the Verdun citadel but in July, the offensive was cut back to reinforce the ": null
    },
    {
        "Somme front": "battle of the somme"
    },
    {
        ". From 42 June to 42 August, Fleury changed hands sixteen times and an attack on Fort Souville failed. The offensive was reduced further but deceptions were tried to keep French reinforcements away from the Somme. In August and December, French counter-offensives recaptured much ground on the east bank and recovered Fort Douaumont and Fort Vaux.     The battle lasted for  the longest and one of the most ": null
    },
    {
        "costly": "list of battles by casualties"
    },
    {
        " in human history. In 42 Hannes Heer and K. Naumann calculated that the French suffered  and the Germans  a total of  and an average of  a month. In 42 William Philpott wrote of  casualties in 42 and  around the city during the war. In France, the battle came to symbolise the determination of the French Army and the destructiveness of the war.                      After the German invasion of France had been halted at the First Battle of the Marne in September 42 the war of movement ended at the ": null
    },
    {
        "Battle of the Yser": "battle of the yser"
    },
    {
        " and the ": null
    },
    {
        "First Battle of Ypres": "first battle of ypres"
    },
    {
        ". The Germans built field fortifications to hold the ground captured in 42 and the French began ": null
    },
    {
        "siege warfare": "trench warfare"
    },
    {
        " to break through the German defences and recover the lost territory. In late 42 and in 42 offensives on the Western Front had failed to gain much ground and been extremely costly in casualties. According to his memoirs written after the war, the Chief of the ": null
    },
    {
        "German General Staff": "german general staff"
    },
    {
        ", ": null
    },
    {
        "Erich von Falkenhayn": "erich von falkenhayn"
    },
    {
        ", believed that although victory might no longer be achieved by a decisive battle, the French army could still be defeated if it suffered a sufficient number of casualties. Falkenhayn offered five corps from the strategic reserve for an offensive at Verdun at the beginning of February 42 but only for an attack on the east bank of the Meuse. Falkenhayn considered it unlikely the French would be complacent about Verdun; he thought that they might send all their reserves there and begin a counter-offensive elsewhere or fight to hold Verdun while the British launched a relief offensive. After the war, ": null
    },
    {
        "Kaiser Wilhelm II": "wilhelm ii, german emperor"
    },
    {
        " and Colonel Tappen, the Operations Officer at  Oberste Heeresleitung  , wrote that Falkenhayn believed the last possibility was most likely.     By seizing or threatening to capture Verdun, the Germans anticipated that the French would send all their reserves, which would then have to attack secure German defensive positions supported by a powerful artillery reserve. In the ": null
    },
    {
        "Gorlice–Tarnów Offensive": "gorlice–tarnów offensive"
    },
    {
        " , the German and Austro-Hungarian Armies attacked Russian defences frontally, after pulverising them with large amounts of heavy artillery. During the ": null
    },
    {
        "Second Battle of Champagne": "second battle of champagne"
    },
    {
        "  of , the French suffered extraordinary casualties from the German heavy artillery, which Falkenhayn considered offered a way out of the dilemma of material inferiority and the growing strength of the Allies. In the north, a British relief offensive would wear down British reserves, to no decisive effect but create the conditions for a German counter-offensive near Arras.     Hints about Falkenhayns thinking were picked up by Dutch military intelligence and passed on to the British in December. The German strategy was to create a favourable operational situation without a mass attack, which had been costly and ineffective when it had been tried by the Franco-British, by relying on the power of heavy artillery to inflict mass losses. A limited offensive at Verdun would lead to the destruction of the French strategic reserve in fruitless counter-attacks and the defeat of British reserves in a futile relief offensive, leading to the French accepting a separate peace. If the French refused to negotiate, the second phase of the strategy would begin in which the German armies would attack terminally weakened Franco-British armies, mop up the remains of the French armies and expel the British from Europe. To fulfil this strategy, Falkenhayn needed to hold back enough of the strategic reserve for the Anglo-French relief offensives and then conduct a counter-offensive, which limited the number of divisions which could be sent to the 42th Army at Verdun, for  .     The Fortified Region of Verdun lay in a ": null
    },
    {
        "salient": "salients, re-entrants and pockets"
    },
    {
        " formed during the German invasion of 42 The Commander-in-Chief of the French Army, General ": null
    },
    {
        "Joseph Joffre": "joseph joffre"
    },
    {
        ", had concluded from the swift capture of the Belgian fortresses at the ": null
    },
    {
        "Battle of Liège": "battle of liège"
    },
    {
        " and at the ": null
    },
    {
        "Siege of Namur": "siege of namur"
    },
    {
        " in 42 that fixed defences had been made obsolete by German siege guns. In a directive of the General Staff of 42 August 42 the RFV was to be stripped of  batteries and  of ammunition. Plans to demolish forts Douaumont and Vaux to deny them to the Germans were made and  of explosives had been laid by the time of the German offensive on 42 February. The  forts and other batteries around Verdun were left with fewer than  and a small reserve of ammunition while their garrisons had been reduced to small maintenance crews. The railway line from the south into Verdun had been cut during the ": null
    },
    {
        "Battle of Flirey": "battle of flirey"
    },
    {
        " in 42 with the loss of Saint-Mihiel; the line west from Verdun to Paris was cut at ": null
    },
    {
        "Aubréville": "aubréville"
    },
    {
        " in mid-July 42 by the German ": null
    },
    {
        "42rd Army": "3rd army"
    },
    {
        ", which had attacked southwards through the Argonne Forest for most of the year.        For centuries, Verdun, on the ": null
    },
    {
        "Meuse": "meuse"
    },
    {
        " river, had played an important role in the defence of the French ": null
    },
    {
        "hinterland": "hinterland"
    },
    {
        ". ": null
    },
    {
        "Attila the Hun": "attila the hun"
    },
    {
        " failed to seize the town in the fifth century and when the empire of ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        " was divided under the ": null
    },
    {
        "Treaty of Verdun": "treaty of verdun"
    },
    {
        " , the town became part of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        "; the ": null
    },
    {
        "Peace of Westphalia": "peace of westphalia"
    },
    {
        " of 42 awarded Verdun to France. At the heart of the city was a citadel built by ": null
    },
    {
        "Vauban": "vauban"
    },
    {
        " in the 42th century. A double ring of  and smaller works  had been built around Verdun on commanding ground, at least  above the river valley,  from the citadel. A programme had been devised by ": null
    },
    {
        "Séré de Rivières": "séré de rivières system"
    },
    {
        " in the 42s to build two lines of fortresses from Belfort to Épinal and from Verdun to Toul as defensive screens and to enclose towns intended to be the bases for counter-attacks. Many of the Verdun forts had been modernised and made more resistant to artillery, with a reconstruction programme begun at Douaumont in the 42s. A sand cushion and thick, steel-reinforced concrete tops up to  thick, buried under  of earth, were added. The forts and  were sited to overlook each other for mutual support and the outer ring had a circumference of . The outer forts had  in shell-proof turrets and more than  and machine-guns to protect the ditches around the forts. Six forts had  in retractable turrets and fourteen had retractable twin .        In 42 Douaumont was equipped with a new concrete bunker , containing two ": null
    },
    {
        "42 mm field guns": "canon de 75 modèle 1897"
    },
    {
        " to cover the south-western approach and the defensive works along the ridge to . More guns were added from  in four retractable steel turrets. The guns could rotate for all-round defence and two smaller versions, at the north-eastern and north-western corners of the fort, housed twin ": null
    },
    {
        "Hotchkiss machine-guns": "hotchkiss m1909 benet–mercie machine gun"
    },
    {
        ". On the east side of the fort, an armoured turret with a  gun faced north and north-east and another housed twin  at the north end, to cover the intervals between forts. The fort at Douaumont formed part of a complex of the village, fort, six , five shelters, six concrete batteries, an underground infantry shelter, two ammunition depots and several concrete infantry trenches. The Verdun forts had a network of concrete infantry shelters, armoured observation posts, batteries, concrete trenches, command posts and underground shelters between the forts. The artillery comprised , with  reserve and the forts and  were linked by telephone and telegraph, a narrow-gauge railway system and a road network; on mobilisation, the RFV had a garrison of  and rations for six months.              Verdun had been isolated on three sides since 42 and the mainline Paris–": null
    },
    {
        "St Menehould": "sainte-menehould"
    },
    {
        "–": null
    },
    {
        "Les Islettes": "les islettes"
    },
    {
        "–": null
    },
    {
        "Clermont-en-Argonne": "clermont-en-argonne"
    },
    {
        "–Aubréville–Verdun railway in the ": null
    },
    {
        "Forest of Argonne": "forest of argonne"
    },
    {
        " was closed in mid-July 42 The right flank divisions of the ": null
    },
    {
        "42th Army": "5th army"
    },
    {
        "  reached the La Morte Fille–Hill 42 ridge after continuous local attacks, rendering the railway unusable. Only a light railway remained to carry bulk supplies; German-controlled railways lay only  to the north of the front line. A corps was moved to the 42th Army to provide labour for the preparation of the offensive. Areas were emptied of French civilians and buildings requisitioned. Thousands of kilometres of telephone cable were laid, huge amounts of ammunition and rations were stored under cover and hundreds of guns were emplaced and camouflaged. Ten new rail lines with twenty stations were built and vast underground shelters  were dug  deep, each to accommodate up to  infantry.     The III Corps, VII Reserve Corps and XVIII Corps were transferred to the 42th Army, each corps being reinforced by  troops and  recruits. V Corps was placed behind the front line, ready to advance if necessary when the assault divisions were moving up. XV Corps, with two divisions, was in the 42th Army reserve, ready to advance to mop up as soon as the French defence collapsed. Special arrangements were made to maintain a high rate of artillery-fire during the offensive;  munitions trains per day were to deliver ammunition sufficient for  to be fired in the first six days and another  in the next twelve. Five repair shops were built close to the front to reduce delays for maintenance and factories in Germany were made ready, rapidly to refurbish artillery needing more extensive repairs. A redeployment plan for the artillery was devised to move field guns and mobile heavy artillery forward, under the covering fire of mortars and the super-heavy artillery. A total of  were massed on the Verdun front, two thirds of which were heavy- and super-heavy artillery, which was obtained by stripping the modern German artillery from the rest of the Western Front and substituting it with older types and captured Russian and Belgian guns. The German artillery could fire into the Verdun salient from three directions yet remain dispersed around the edges.       The 42th Army divided the attack front into areas, A occupied by the VII Reserve Corps, B by the XVIII Corps, C by the III Corps and D on the Woëvre plain by the XV Corps. The preliminary artillery bombardment was to begin in the morning of 42 February. At , the infantry in areas A to C would advance in open order, supported by grenade and flame-thrower detachments. Wherever possible, the French advanced trenches were to be occupied and the second position reconnoitred for the artillery to bombard on the second day. Great emphasis was placed on limiting German infantry casualties by sending them to follow up destructive bombardments by the artillery, which was to carry the burden of the offensive in a series of large attacks with limited objectives , to maintain a relentless pressure on the French. The initial objectives were the Meuse Heights, on a line from Froide Terre to Fort Souville and Fort Tavannes, which would provide a secure defensive position from which to repel French counter-attacks. Relentless pressure was a term added by the 42th Army staff and created ambiguity about the purpose of the offensive. Falkenhayn wanted land to be captured from which artillery could dominate the battlefield and the 42th Army wanted a quick capture of Verdun. The confusion caused by the ambiguity was left to the corps headquarters to sort out.     Control of the artillery was centralised by an Order for the Activities of the Artillery and Mortars, which stipulated that the corps Generals of Foot Artillery were responsible for local target selection, while co-ordination of flanking fire by neighbouring corps and the fire of certain batteries, was reserved to the 42th Army headquarters. French fortifications were to be engaged by the heaviest ": null
    },
    {
        "howitzers": "howitzers"
    },
    {
        " and ": null
    },
    {
        "enfilade": "enfilade and defilade"
    },
    {
        " fire. The heavy artillery was to maintain long-range bombardment of French supply routes and assembly areas; counter-battery fire was reserved for specialist batteries firing gas shells. Co-operation between the artillery and infantry was stressed, with accuracy of the artillery being given priority over rate of fire. The opening bombardment was to build up slowly and  would not begin until the last hour. As the infantry advanced, the artillery would increase the range of the bombardment to destroy the French second position. Artillery observers were to advance with the infantry and communicate with the guns by field telephones, flares and coloured balloons. When the offensive began, the French were to be bombarded continuously, with harassing fire being maintained at night.          In 42  and  of ammunition in the forts of the RFV had been removed, leaving only the heavy guns in retractable turrets. The conversion of the RFV to a conventional linear defence, with trenches and barbed wire began but proceeded slowly, after resources were sent west from Verdun for the Second Battle of Champagne  In October 42 building began on trench lines known as the first, second and third positions and in January 42 an inspection by General ": null
    },
    {
        "Noël de Castelnau": "noël édouard, vicomte de curières de castelnau"
    },
    {
        ", Chief of Staff at ": null
    },
    {
        "French General Headquarters": "grand quartier général"
    },
    {
        " , reported that the new defences were satisfactory, except for small deficiencies in three areas. The fortress garrisons had been reduced to small maintenance crews and some of the forts had been readied for demolition. The maintenance garrisons were responsible to the central military bureaucracy in Paris and when the XXX Corps commander, Major-General ": null
    },
    {
        "Paul Chrétien": "paul chrétien"
    },
    {
        ", attempted to inspect Fort Douaumont in January 42 he was refused entry.     Douaumont was the largest fort in the RFV and by February 42 the only artillery left in the fort were the  and  guns and light guns covering the ditch. The fort was used as a barracks by  under the command of Warrant-Officer Chenot, the . One of the rotating  turrets was partially manned and the other was left empty. The Hotchkiss machine-guns were stored in boxes and four  in the ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "s had already been removed. The drawbridge had been jammed in the down position by a German shell and had not been repaired. The  with Hotchkiss revolver-cannons protecting the moats, were unmanned and over  of explosives had been placed in the fort to demolish it.        In late January 42 French intelligence obtained an accurate assessment of German military capacity and intentions at Verdun but Joffre considered that an attack would be a diversion, because of the lack of an obvious strategic objective. By the time of the German offensive, Joffre expected a bigger attack elsewhere but ordered the VII Corps to Verdun on 42 January, to hold the north face of the west bank. XXX Corps held the salient east of the Meuse to the north and north-east and II Corps held the eastern face of the Meuse Heights; Herr had  divisions in the front line, with  divisions in close reserve.   had the I and XX corps with two divisions each in reserve, plus most of the 42th Division; Joffre had  in the French strategic reserve. French artillery reinforcements had brought the total at Verdun to  guns and  guns, against  guns, two thirds of which were heavy and super heavy, including  and  some being . Eight specialist flame-thrower companies were also sent to the 42th Army.        Castelnau met De Langle de Cary on 42 February, who doubted the east bank could be held. Castelnau disagreed and ordered General ": null
    },
    {
        "Frédéric-Georges Herr": "frédéric-georges herr"
    },
    {
        " the corps commander, to hold the right bank of the Meuse at all costs. Herr sent a division from the west bank and ordered XXX Corps to hold a line from Bras to Douaumont, Vaux and ": null
    },
    {
        "Eix": "eix"
    },
    {
        ". Pétain took over command of the defence of the RFV at  with Colonel Maurice de Barescut as chief of staff and Colonel ": null
    },
    {
        "Bernard Serrigny": "bernard serrigny"
    },
    {
        " as head of operations, only to hear that Fort Douaumont had fallen. Pétain ordered the remaining Verdun forts to be re-garrisoned. Four groups were established, under the command of Generals ": null
    },
    {
        "Adolphe Guillaumat": "adolphe guillaumat"
    },
    {
        ", Balfourier and ": null
    },
    {
        "Denis Duchêne": "denis auguste duchêne"
    },
    {
        " on the right bank and ": null
    },
    {
        "Georges de Bazelaire": "georges de bazelaire"
    },
    {
        " on the left bank. A line of resistance was established on the east bank from Souville to Thiaumont, around Fort Douaumont to Fort Vaux, Moulainville and along the ridge of the ": null
    },
    {
        "Woëvre": "woëvre"
    },
    {
        ". On the west bank, the line ran from Cumières to ": null
    },
    {
        "Mort Homme": "mort homme"
    },
    {
        ", Côte 42 and Avocourt. A line of panic was planned in secret as a final line of defence north of Verdun, through forts Belleville, St. Michel and ": null
    },
    {
        "Moulainville": "moulainville"
    },
    {
        ". I Corps and XX Corps arrived from 42 to 42 February, increasing the number of divisions in the RFV to . By 42 March, the arrival of the XIII, XXI, XIV and XXXIII corps had increased the total to  divisions.                      was due to begin on 42 February but fog, heavy rain and high winds delayed the offensive until  on 42 February, when a 42-hour artillery bombardment by  began. The German artillery fired  along a front about  long by  wide. The main concentration of fire was on the right bank of the Meuse river. Twenty-six super-heavy, long-range guns, up to , fired on the forts and the city of Verdun; a rumble could be heard  away.     The bombardment was paused at midday, as a ruse to prompt French survivors to reveal themselves and German artillery-observation aircraft were able to fly over the battlefield unmolested by French aircraft. The ": null
    },
    {
        "42rd": "iii corps"
    },
    {
        ", ": null
    },
    {
        "42th": "vii corps"
    },
    {
        " and ": null
    },
    {
        "42th": "xviii corps"
    },
    {
        " corps attacked at ; the Germans used ": null
    },
    {
        "flamethrower": "flamethrower"
    },
    {
        "s and ": null
    },
    {
        "storm troops": "stormtrooper"
    },
    {
        " followed closely with rifles slung, to use hand grenades to kill the remaining defenders. This tactic had been developed by Captain ": null
    },
    {
        "Willy Rohr": "willy rohr"
    },
    {
        " and , the battalion which conducted the attack. French survivors engaged the attackers, yet the Germans suffered only         By 42 February, German troops had advanced  and captured , at the edge of the village of ": null
    },
    {
        "Flabas": "moirey-flabas-crépion"
    },
    {
        ". Two French battalions led by Colonel ": null
    },
    {
        "Émile Driant": "émile driant"
    },
    {
        " had held the bois for two days but were forced back to ": null
    },
    {
        "Samogneux": "samogneux"
    },
    {
        ", ": null
    },
    {
        "Beaumont": "beaumont-en-auge"
    },
    {
        " and ": null
    },
    {
        "Ornes": "ornes"
    },
    {
        ". Driant was killed, fighting with the 42th and 42th  and only  the ": null
    },
    {
        "Chasseur": "chasseur"
    },
    {
        "s managed to escape. Poor communications meant that only then did the French High Command realise the seriousness of the attack. The Germans managed to take the village of ": null
    },
    {
        "Haumont": "haumont-près-samogneux"
    },
    {
        " but French forces repulsed a German attack on the village of . On 42 February, a French counter-attack at  was repulsed.     Fighting for  continued until the Germans outflanked the French defenders from . The German attackers had many casualties during their attack on  and the French held on to Samogneux. German attacks continued on 42 February and the French XXX Corps was forced out of the second line of defence; XX Corps arrived at the last minute and was rushed forward. That evening Castelnau advised Joffre that the ": null
    },
    {
        "Second Army": "second army"
    },
    {
        ", under General Pétain, should be sent to the RFV. The Germans had captured ": null
    },
    {
        "Beaumont": "beaumont-en-verdunois"
    },
    {
        ",  and  and were moving up , which led to Fort Douaumont.     At  on 42 February, infantry of ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        " Regiment 42 advanced with the II and III battalions side-by-side, each formed into two waves composed of two companies each. A delay in the arrival of orders to the regiments on the flanks, led to the III Battalion advancing without support on that flank. The Germans rushed French positions in the woods and on Côte 42 with the support of machine-gun fire from the edge of . The German infantry took many prisoners as the French on Côte 42 were outflanked and withdrew to Douaumont village. The German infantry had reached their objectives in fewer than twenty minutes and pursued the French, until fired on by a machine-gun in Douaumont church. Some German troops took cover in woods and a ravine which led to the fort, when German artillery began to bombard the area, the gunners having refused to believe claims sent by field telephone that the German infantry were within a few hundred metres of the fort. Several German parties were forced to advance to find cover from the German shelling and two parties independently made for the fort. They did not know that the French garrison was made up of only a small maintenance crew led by a warrant officer, since most of the Verdun forts had been partly disarmed, after the ": null
    },
    {
        "demolition of Belgian forts": "battle of liègesiege"
    },
    {
        " in 42 by the German super-heavy ": null
    },
    {
        "Krupp 42 mm mortars": "big bertha"
    },
    {
        ".        The German party of  tried to signal to the artillery with flares but twilight and falling snow obscured them from view. Some of the party began to cut through the wire around the fort, while French machine-gun fire from Douaumont village ceased. The French had seen the German flares and took the Germans on the fort to be ": null
    },
    {
        "Zouave": "zouave"
    },
    {
        "s retreating from Côte 42 The Germans were able to reach the north-east end of the fort before the French resumed firing. The German party found a way through the railings on top of the ditch and climbed down without being fired on, since the machine-gun bunkers  at each corner of the ditch had been left unmanned. The German parties continued and found a way inside the fort through one of the unoccupied ditch bunkers and then reached the central .     After quietly moving inside, the Germans heard voices and persuaded a French prisoner, captured in an observation post, to lead them to the lower floor, where they found Warrant Officer Chenot and about  troops, most of the skeleton garrison of the fort, and took them prisoner. On 42 February, the Germans had advanced  on a  front; French losses were  and German losses were  A French counter-attack on Fort Douaumont failed and Pétain ordered that no more attempts were to be made; existing lines were to be consolidated and other forts were to be occupied, rearmed and supplied to withstand a siege if surrounded.       The German advance gained little ground on 42 February, after a thaw turned the ground into a swamp and the arrival of French reinforcements increased the effectiveness of the defence. Some German artillery became unserviceable and other batteries became stranded in the mud. German infantry began to suffer from exhaustion and unexpectedly high losses,  being suffered in the fighting around Douaumont village. On 42 February, the German advance was contained at Douaumont by a heavy snowfall and the defence of French 42rd Infantry Regiment. Delays gave the French time to bring up  and  of ammunition from the railhead at ": null
    },
    {
        "Bar-le-Duc": "bar-le-duc"
    },
    {
        " to Verdun. The swift German advance had gone beyond the range of artillery covering fire and the muddy conditions made it very difficult to move the artillery forward as planned. The German advance southwards brought it into range of French artillery west of the Meuse, whose fire caused more German infantry casualties than in the earlier fighting, when French infantry on the east bank had fewer guns in support.                Before the offensive, Falkenhayn had expected that French artillery on the west bank would be suppressed by counter-battery fire but this had failed. The Germans set up a specialist artillery force to counter French artillery-fire from the west bank but this also failed to reduce German infantry casualties. The 42th Army asked for more troops in late February but Falkenhayn refused, due to the rapid advance already achieved on the east bank and because he needed the rest of the OHL reserve for an offensive elsewhere, once the attack at Verdun had attracted and consumed French reserves. The pause in the German advance on 42 February led Falkenhayn to have second thoughts to decide between terminating the offensive or reinforcing it. On 42 February, Knobelsdorf, the 42th Army Chief of Staff, prised two divisions from the OHL reserve, with the assurance that once the heights on the west bank had been occupied, the offensive on the east bank could be completed. The VI Reserve Corps was reinforced with the X Reserve Corps, to capture a line from the south of ": null
    },
    {
        "Avocourt": "avocourt"
    },
    {
        " to Côte 42 north of Esnes, ": null
    },
    {
        "Mort-Homme": "cumières-le-mort-homme"
    },
    {
        ", Bois des Cumières and Côte 42 from which the French artillery on the west bank could be destroyed.     The artillery of the two-corps assault group on the west bank was reinforced by  artillery batteries, artillery command was centralised under one officer and arrangements were made for the artillery on the east bank to fire in support. The attack was planned by General ": null
    },
    {
        "Heinrich von Gossler": "heinrich von gossler"
    },
    {
        " in two parts, on Mort-Homme and Côte 42 on 42 March, followed by attacks on Avocourt and Côte 42 on 42 March. The German bombardment reduced the top of Côte 42 from a height of  to ; Mort-Homme sheltered batteries of French field guns, which hindered German progress towards Verdun on the right bank; the hills also provided commanding views of the left bank. After storming the  and then losing it to a French counter-attack, the Germans launched another assault on Mort-Homme on 42 March, from the direction of ": null
    },
    {
        "Béthincourt": "béthincourt"
    },
    {
        " to the north-west.  was captured again at great cost in casualties, before the Germans took parts of Mort-Homme, Côte 42 Cumières and ": null
    },
    {
        "Chattancourt": "chattancourt"
    },
    {
        " on 42 March.          After a week, the German attack had reached the first-day objectives, to find that French guns behind Côte de Marre and Bois Borrous were still operational and inflicting many casualties among the Germans on the east bank. German artillery moved to Côte 42 was subjected to systematic artillery-fire by the French, which left the Germans needing to implement the second part of the west bank offensive, to protect the gains of the first phase. German attacks changed from large operations on broad fronts, to narrow-front attacks with limited objectives.     On 42 March a German attack captured Côte 42 at the west end of Mort-Homme but the French 42th Infantry Brigade managed to hold Côte 42 at the east end. On 42 March, after a bombardment by  mortar rounds, the 42th Bavarian and 42th Reserve divisions attacked  and  and reached their initial objectives easily. Gossler ordered a pause in the attack, to consolidate the captured ground and to prepare another big bombardment for the next day. On 42 March, two divisions attacked Termite Hill near Côte 42 but were met by a mass of artillery-fire, which also fell on assembly points and the German lines of communication, ending the German advance.     The limited German success had been costly and French artillery inflicted more casualties as the German infantry tried to dig in. By 42 March, Gossler had captured  at a cost of  and the Germans were still short of Côte 42 On 42 March, the XXII Reserve Corps arrived as reinforcements and General ": null
    },
    {
        "Max von Gallwitz": "max von gallwitz"
    },
    {
        " took command of a new Attack Group West . Malancourt village was captured on 42 March, Haucourt fell on 42 April and Béthincourt on 42 April. On the east bank, German attacks near Vaux reached  and the Vaux–Fleury railway but were then driven back by the French 42th Division. An attack was made on a wider front along both banks by the Germans at noon on 42 April, with five divisions on the left bank but this was repulsed except at Mort-Homme, where the French 42nd Division was forced back from the north-east face. On the right bank an attack on  failed.     In March the German attacks had no advantage of surprise and faced a determined and well-supplied adversary in superior defensive positions. German artillery could still devastate French defensive positions but could not prevent French artillery-fire from inflicting many casualties on German infantry and isolating them from their supplies. Massed artillery fire could enable German infantry to make small advances but massed French artillery-fire could do the same for French infantry when they counter-attacked, which often repulsed the German infantry and subjected them to constant losses, even when captured ground was held. The German effort on the west bank also showed that capturing a vital point was not sufficient, because it would be found to be overlooked by another terrain feature, which had to be captured to ensure the defence of the original point, which made it impossible for the Germans to terminate their attacks, unless they were willing to retire to the original front line of February 42     By the end of March the offensive had cost the Germans  and Falkenhayn began to think of ending the offensive, lest it become another costly and indecisive engagement similar to the First Battle of Ypres in late 42 The 42th Army staff requested more reinforcements from Falkenhayn on 42 March with an optimistic report claiming that the French were close to exhaustion and incapable of a big offensive. The 42th Army command wanted to continue the east bank offensive until a line from Ouvrage de Thiaumont, to Fleury, Fort Souville and Fort de Tavannes had been reached, while on the west bank the French would be destroyed by their own counter-attacks. On 42 April, Falkenhayn replied that the French had retained a considerable reserve and that German resources were limited and not sufficient to replace continuously men and munitions. If the resumed offensive on the east bank failed to reach the Meuse Heights, Falkenhayn was willing to accept that the offensive had failed and end it.              The failure of German attacks in early April by , led Knobelsdorf to take soundings from the 42th Army corps commanders, who unanimously wanted to continue. The German infantry were exposed to continuous artillery fire from the flanks and rear; communications from the rear and reserve positions were equally vulnerable, which caused a constant drain of casualties. Defensive positions were difficult to build, because existing positions were on ground which had been swept clear by German bombardments early in the offensive, leaving German infantry with very little cover. The ": null
    },
    {
        "XV Corps": "xv corps"
    },
    {
        " commander, General ": null
    },
    {
        "Berthold von Deimling": "berthold von deimling"
    },
    {
        " also wrote that French heavy artillery and gas bombardments were undermining the morale of the German infantry, which made it necessary to keep going to reach safer defensive positions. Knobelsdorf reported these findings to Falkenhayn on 42 April, adding that if the Germans did not go forward, they must go back to the start line of 42 February.     Knobelsdorf rejected the policy of limited piecemeal attacks tried by Mudra as commander of  and advocated a return to wide-front attacks with unlimited objectives, swiftly to reach the line from Ouvrage de Thiaumont to Fleury, Fort Souville and Fort de Tavannes. Falkenhayn was persuaded to agree to the change and by the end of April,  most of the OHL reserve, had been sent to Verdun and troops had also been transferred from the Eastern Front. The resort to large, unlimited attacks was costly for both sides but the German advance proceeded only slowly. Rather than causing devastating French casualties by heavy artillery with the infantry in secure defensive positions, which the French were compelled to attack, the Germans inflicted casualties by attacks which provoked French counter-attacks and assumed that the process inflicted five French casualties for two German losses.     In mid-March, Falkenhayn had reminded the 42th Army to use tactics intended to conserve infantry, after the corps commanders had been allowed discretion to choose between the cautious, step by step tactics desired by Falkenhayn and maximum efforts, intended to obtain quick results. On the third day of the offensive, the ": null
    },
    {
        "42th Division": "6th division"
    },
    {
        " of the III Corps , had ordered that Herbebois be taken regardless of loss and the ": null
    },
    {
        "42th Division": "5th division"
    },
    {
        " had attacked ": null
    },
    {
        "Wavrille": "wavrille"
    },
    {
        " to the accompaniment of its band. Falkenhayn urged the 42th Army to use  composed of two infantry squads and one of engineers, armed with automatic weapons, hand grenades, trench mortars and flame-throwers, to advance in front of the main infantry body. The  would conceal their advance by shrewd use of terrain and capture any blockhouses which remained after the artillery preparation. Strongpoints which could not be taken were to be by-passed and captured by follow-up troops. Falkenhayn ordered that the command of field and heavy artillery units was to be combined, with a commander at each corps headquarters. Common observers and communication systems would ensure that batteries in different places could bring targets under converging fire, which would be allotted systematically to support divisions.     In mid-April, Falkenhayn ordered that infantry should advance close to the barrage, to exploit the neutralising effect of the shellfire on surviving defenders, because fresh troops at Verdun had not been trained in these methods. Knobelsdorf persisted with attempts to maintain momentum, which was incompatible with the methods of casualty conservation, which could be implemented only with limited attacks, with pauses to consolidate and prepare. Mudra and other commanders who disagreed were sacked. Falkenhayn also intervened to change German defensive tactics, advocating a dispersed defence with the second line to be held as a main line of resistance and jumping-off point for counter-attacks. Machine-guns were to be set up with overlapping fields of fire and infantry given specific areas to defend. When French infantry attacked, they were to be isolated by  on their former front line, to increase French infantry casualties. The changes desired by Falkenhayn had little effect, because the main cause of German casualties was artillery-fire, just as it was for the French.       From 42 May German operations were limited to local attacks, either in reply to French counter-attacks on 42 April between Douaumont and Vaux and on 42 April between the Meuse and Douaumont, or local attempts to take points of tactical value. At the beginning of May, General Pétain was promoted to the command of  and General ": null
    },
    {
        "Robert Nivelle": "robert nivelle"
    },
    {
        " took over the Second Army at Verdun. From  German attacks were made on the west bank around Mort-Homme and on 42 May, the north slope of Côte 42 was captured; French counter-attacks from  were repulsed. The French defenders on the crest of Côte 42 were forced back on 42 May but German infantry were unable to occupy the ridge, because of the intensity of French artillery-fire. Cumieres and Caurettes fell on 42 May as a French counter-attack began at Fort Douaumont.          In May, General Nivelle, who had taken over the Second Army, ordered General ": null
    },
    {
        "Charles Mangin": "charles mangin"
    },
    {
        ", commander of the 42th Division to plan a counter-attack on Fort Douaumont. The initial plan was for an attack on a  front but several minor German attacks captured  and  ravines on the south-east and west sides of the fort. A further attack took the ridge south of the , which gave the Germans better routes for counter-attacks and observation over the French lines to the south and south-west. Mangin proposed a preliminary attack to retake the area of the ravines, to obstruct the routes by which a German counter-attack on the fort could be made. More divisions were necessary but these were refused, to preserve the troops needed for the forthcoming offensive on the Somme; Mangin was limited to one division for the attack with one in reserve. Nivelle reduced the attack to an assault on Morchée Trench, Bonnet-dEvèque, Fontaine Trench, Fort Douaumont, a machine-gun turret and Hongrois Trench, which would require an advance of  on a  front.        III Corps was to command the attack by the 42th Division and the 42st Brigade, with support from three balloon companies for artillery-observation and a fighter group. The main effort was to be conducted by two battalions of the 42th Infantry Regiment, each with a pioneer company and a machine-gun company attached. The 42nd Battalion was to attack from the south and the 42st Battalion was to move along the west side of the fort to the north end, taking Fontaine Trench and linking with the 42th Company. Two battalions of the 42th Infantry Regiment were to advance along the east and south-east sides of the fort and take a machine-gun turret on a ridge to the east. Flank support was arranged with neighbouring regiments and diversions were planned near Fort Vaux and the . Preparations for the attack included the digging of  of trenches and the building of large numbers of depots and stores but little progress was made due to a shortage of pioneers. French troops captured on 42 May, disclosed the plan to the Germans, who responded by subjecting the area to more artillery harassing fire, which also slowed French preparations.     The French preliminary bombardment by four  mortars and  guns, began on 42 May and by 42 May, the French artillery commander claimed that the fort had been severely damaged. During the bombardment the German garrison in the fort experienced great strain, as French heavy shells smashed holes in the walls and concrete dust, exhaust fumes from an electricity generator and gas from disinterred corpses polluted the air. Water ran short but until 42 May, the fort remained operational, reports being passed back and reinforcements moving forward until the afternoon, when the Bourges Casemate was isolated and the wireless station in the north-western machine-gun turret burnt down.     Conditions for the German infantry in the vicinity were far worse and by 42 May, the French destructive bombardment had obliterated many defensive positions, the survivors taking post in shell-holes and dips on the ground. Communication with the rear was severed and food and water ran out by the time of the French attack on 42 May. The troops of Infantry Regiment 42 in front of Fort Douaumont had been reduced to  near Thiaumont Farm and German counter-barrages inflicted similar losses on French troops. On 42 May, French ": null
    },
    {
        "Nieuport": "nieuport"
    },
    {
        " fighters attacked eight ": null
    },
    {
        "observation balloons": "observation balloons"
    },
    {
        " and shot down six for the loss of one ": null
    },
    {
        "Nieuport 42": "nieuport 16"
    },
    {
        "; other French aircraft attacked the 42th Army headquarters at ": null
    },
    {
        "Stenay": "stenay"
    },
    {
        ". German artillery fire increased and twenty minutes before zero hour, a German bombardment began, which reduced the 42th Infantry Regiment companies to about  each.        The assault began at  on 42 May on a  front. On the left flank the 42th Infantry Regiment attack quickly captured Morchée Trench and Bonnet-dEvèque but was costly and the regiment could advance no further. The flank guard on the right was pinned down, except for one company which disappeared and in , a battalion of the 42th Infantry Regiment was unable to leave its trenches; the other battalion managed to reach its objectives at an ammunition depot, shelter DV42 at the edge of  and the machine-gun turret east of the fort, where the battalion found its flanks unsupported.     Despite German small-arms fire, the 42th Infantry Regiment reached the fort in a few minutes and managed to get in through the west and south sides. By nightfall, about half of the fort had been recaptured and next day, the 42th Division was sent to reinforce the fort. The reinforcements were repulsed and German reserves managed to cut off the French troops in the fort and force them to surrender,  prisoners being taken. After three days, the French had lost  from the  in the attack and German casualties in Infantry Regiment 42 Grenadier Regiment 42 and Leib-Grenadier Regiment 42 were           , Fleury, Fort Souville and Fort Vaux at the north-east extremity of the French line, which had been bombarded by  a day since the beginning of the offensive. After a final assault on 42 June by about  troops, the top of Fort Vaux was occupied on 42 June. Fighting went on underground until the garrison ran out of water, the  surrendering on 42 June. When news of the loss of Fort Vaux reached Verdun, the Line of Panic was occupied and trenches were dug on the edge of the city. On the left bank, the German advanced from the line Côte 42 Mort-Homme and Cumières and threatened the French hold on Chattancourt and Avocourt. Heavy rains slowed the German advance towards Fort Souville, where both sides attacked and counter-attacked for the next two months. The 42th Army suffered  in the vicinity of Fort Vaux from 42 to 42 June,  being killed,  and  French counter-attacks on 42 and 42 June were costly failures.          On 42 June, German artillery fired over  gas shells at French artillery positions, which caused over  and silenced much of the French artillery. Next day the German attack at  on a  front, drove a  salient into the French defences. The advance was unopposed until  when some French troops were able to fight a rearguard action. The Ouvrage de Thiaumont and the Ouvrage de Froidterre at the south end of the plateau were captured and the villages of ": null
    },
    {
        "Fleury": "fleury-devant-douaumont"
    },
    {
        " and Chapelle Sainte-Fine were overrun. The attack came close to Fort Souville  bringing the Germans within  of the Verdun citadel.     On 42 June 42 Nivelle ordered, ": null
    },
    {
        "They shall not pass": "they shall not pass"
    },
    {
        " :        Nivelle had been concerned about diminished French morale at Verdun; after his promotion to lead the Second Army in June 42 manifestations of indiscipline occurred in five front line regiments.  reappeared in the ": null
    },
    {
        "French army mutinies": "french army mutinies"
    },
    {
        " that followed the Nivelle Offensive .     Chapelle Sainte-Fine was quickly recaptured by the French and the German advance was halted. The supply of water to the German infantry broke down, the salient was vulnerable to fire from three sides and the attack could not continue without more Diphosgene ammunition. Chapelle Sainte-Fine became the furthest point reached by the Germans during the Verdun offensive. On 42 June the preliminary Anglo-French bombardment began on the Somme. Fleury changed hands sixteen times from 42 June to 42 August. Four French divisions were diverted to Verdun from the Somme and the French artillery recovered sufficiently on 42 June to cut off the German front line from the rear. By 42 June, both sides were exhausted and Knobelsdorf suspended the attack.       By the end of May French casualties at Verdun had risen to  and in June German losses had reached  The opening of the ": null
    },
    {
        "Battle of the Somme": "battle of the somme"
    },
    {
        " on 42 July, forced the Germans to withdraw some of their artillery from Verdun, which was the first strategic success of the Anglo-French offensive.          Fort Souville dominated a crest  south-east of Fleury and was one of the original objectives of the February offensive. The capture of the fort would give the Germans control of the heights overlooking Verdun and allow the infantry to dig in on commanding ground. A German preparatory bombardment began on 42 July, with an attempt to suppress French artillery with over  shells, which had little effect since the French had been equipped with an improved M42 ": null
    },
    {
        "gas mask": "gas mask"
    },
    {
        ". Fort Souville and its approaches were bombarded with more than  including   shells on the fort.     An attack by three German divisions began on 42 July but German infantry bunched on the path leading to Fort Souville and came under bombardment from French artillery. The surviving troops were fired on by sixty French machine-gunners, who emerged from the fort and took positions on the superstructure. Thirty soldiers of Infantry Regiment 42 managed to reach the top of the fort on 42 July, from where the Germans could see the roofs of Verdun and the spire of the cathedral. After a small French counter-attack, the survivors retreated to their start lines or surrendered. On the evening of 42 July, Crown Prince Wilhelm was ordered by Falkenhayn to go onto the defensive and on 42 July, the French conducted a larger counter-attack which gained no ground; for the rest of the month the French made only small attacks.       On 42 August a German surprise-attack advanced  towards Fort Souville, which prompted French counter-attacks for two weeks, which were only able to retake a small amount of the captured ground. On 42 August, Fleury was recaptured and by September, French counter-attacks had recovered much of the ground lost in July and August. On 42 August Falkenhayn was replaced as Chief of the General Staff by ": null
    },
    {
        "Paul von Hindenburg": "paul von hindenburg"
    },
    {
        " and First Quartermaster-General ": null
    },
    {
        "Erich Ludendorff": "erich ludendorff"
    },
    {
        ". On 42 September, an attack on both flanks at Fleury advanced the French line several hundred metres, against which German counter-attacks from  failed. The French attacked again on  Losses were light except at the Tavannes railway tunnel, where  troops died in a fire which began on 42 September.            In October 42 the French began the First Offensive Battle of Verdun , to recapture Fort Douaumont, an advance of more than . Seven of the  at Verdun were replaced by mid-October and French infantry platoons were reorganised to contain sections of riflemen, grenadiers and machine-gunners. In a six-day preliminary bombardment, the French artillery fired  including more than half a million  field-gun shells, a hundred thousand  medium artillery shells and three hundred and seventy-three  and  super-heavy shells, from more than  and howitzers.     Two French ": null
    },
    {
        "Saint-Chamond": "saint-chamond"
    },
    {
        " railway guns": "railway guns"
    },
    {
        ",  to the south-west at Baleycourt, fired the  super-heavy shells, each weighing . The French had identified about  guns on the right bank capable of supporting the ": null
    },
    {
        "42th": "34th division"
    },
    {
        ", ": null
    },
    {
        "42th": "54th infantry division"
    },
    {
        ", ": null
    },
    {
        "42th": "9th division"
    },
    {
        " and ": null
    },
    {
        "42rd Reserve": "33rd reserve division"
    },
    {
        " divisions, with the ": null
    },
    {
        "42th": "10th division"
    },
    {
        " and 42th divisions in reserve. At least  the super-heavy shells hit Fort Douaumont, the sixth penetrating to the lowest level and exploding in a pioneer depot, starting a fire next to         The 42th Division , 42rd Division and 42th Division attacked at  The infantry advanced  behind a creeping field-artillery barrage, moving at a rate of  in two minutes, beyond which a heavy artillery barrage moved in  lifts, as the field artillery barrage came within , to force the German infantry and machine-gunners to stay under cover. The Germans had partly evacuated Douaumont, which was recaptured on 42 October by French marines and colonial infantry; more than  and fifteen guns were captured by 42 October but an attempt on Fort Vaux failed.     The Haudromont quarries, Ouvrage de Thiaumont and Thiaumont Farm, Douaumont village, the northern end of Caillette Wood, Vaux pond, the eastern fringe of Bois Fumin and the Damloup battery were captured. The heaviest French artillery bombarded Fort Vaux for the next week and on 42 November, the Germans evacuated the fort, after a huge explosion caused by a  French eavesdroppers overheard a German wireless message announcing the departure and a French infantry company entered the fort without firing a shot; on 42 November, the French reached the front line of 42 February and offensive operations ceased until December.            The Second Offensive Battle of Verdun  was conducted by the 42th Division , 42th , 42th Division  and the 42rd Division , with four more in reserve and  guns in support. The attack was planned by Pétain and Nivelle and commanded by Mangin. The attack began at  on 42 December, after a six-day bombardment of  fired from  The final French bombardment was directed from artillery-observation aircraft, falling on trenches, dugout entrances and observation posts. Five German divisions supported by  held the defensive position, which was  deep, with  of the infantry in the battle zone and the remaining  in reserve  back.     Two of the German divisions were understrength with only  instead of their normal establishment of  The French advance was preceded by a double creeping barrage, with shrapnel-fire from field artillery  in front of the infantry and a high-explosive barrage  ahead, which moved towards a standing shrapnel bombardment along the German second line, laid to cut off the German retreat and block the advance of reinforcements. The German defence collapsed and  of the  the five front divisions were lost, most having been trapped while under cover and taken prisoner when the French infantry arrived.     The French reached their objectives at ": null
    },
    {
        "Vacherauville": "vacherauville"
    },
    {
        " and Louvemont which had been lost in February, along with Hardaumont and ": null
    },
    {
        "Côte du Poivre": "louvemont-côte-du-poivre"
    },
    {
        ", despite attacking in very bad weather. German reserve battalions did not reach the front until the evening and two ": null
    },
    {
        "Eingreif": "eingreif division"
    },
    {
        " divisions, which had been ordered forward the previous evening, were still  away at noon. By the night of  the French had consolidated a new line from ": null
    },
    {
        "Bezonvaux": "bezonvaux"
    },
    {
        " to Côte du Poivre,  beyond Douaumont and  north of Fort Vaux, before the German reserves and  units could counter-attack. The  at Douaumont had been repaired and fired in support of the French attack. The closest German point to Verdun had been pushed  back and all the dominating observation points had been recaptured. The French took  and  Some German officers complained to Mangin about their lack of comfort in captivity and he replied, We do regret it, gentlemen but then we did not expect so many of you. Lochow, the 42th Army commander and General Hans von Zwehl, commander of XIV Reserve Corps, were sacked on 42 December.           Falkenhayn wrote in his memoir that he sent an appreciation of the strategic situation to the Kaiser in December 42          The German strategy in 42 was to inflict mass casualties on the French, a goal achieved against the Russians from 42 to 42 to weaken the French Army to the point of collapse. The French Army had to be drawn into circumstances from which it could not escape, for reasons of strategy and prestige. The Germans planned to use a large number of heavy and super-heavy guns to inflict a greater number of casualties than French artillery, which relied mostly upon the  gun. In 42 Robert Foley wrote that Falkenhayn intended a battle of ": null
    },
    {
        "attrition": "attrition warfare"
    },
    {
        " from the beginning, contrary to the views of Wolfgang Foerster in 42 Gerd Krumeich in 42 and others but the loss of documents led to many interpretations of the strategy. In 42 critics of Falkenhayn claimed that the battle demonstrated that he was indecisive and unfit for command, echoed by Foerster in 42 In 42 Holger Afflerbach questioned the authenticity of the Christmas Memorandum ; after studying the evidence that had survived in the  files, he concluded that the memorandum had been written after the war but that it was an accurate reflection of Falkenhayns thinking at the time.        Krumeich wrote that the Christmas Memorandum was fabricated to justify a failed strategy and that attrition had been substituted for the capture of Verdun, only after the attack failed. Foley wrote that after the failure of the Ypres Offensive of 42 Falkenhayn had returned to the pre-war strategic thinking of ": null
    },
    {
        "Moltke the Elder": "helmuth von moltke the elder"
    },
    {
        " and ": null
    },
    {
        "Hans Delbrück": "hans delbrück"
    },
    {
        " on  , because the coalition fighting Germany was too powerful to be defeated decisively. Falkenhayn wanted to divide the Allies by forcing at least one of the ": null
    },
    {
        "Entente": "triple entente"
    },
    {
        " powers into a negotiated peace. An attempt at attrition lay behind the offensive in the east in 42 but the Russians had refused to accept German ": null
    },
    {
        "peace feeler": "peace feeler"
    },
    {
        "s, despite the huge defeats inflicted by the Austro-Germans.     With insufficient forces to break through the Western Front and overcome the reserves behind it, Falkenhayn tried to force the French to attack instead, by threatening a sensitive point close to the front line and chose Verdun. Huge losses were to be inflicted on the French by German artillery on the dominating heights around the city. The 42th Army would begin a big offensive but with the objectives limited to seizing the Meuse Heights on the east bank for German heavy artillery to dominate the battlefield. The French Army would bleed itself white in hopeless counter-attacks. The British would be forced to launch a hasty relief offensive and suffer an equally costly defeat. If the French refused to negotiate, a German offensive would mop up the remnants of the Franco-British armies, breaking the Entente once and for all .     In a revised instruction to the French Army in January 42 the General Staff wrote that equipment could not be fought by men. Firepower could conserve infantry but attrition prolonged the war and consumed troops preserved in earlier battles. In 42 and early 42 German industry quintupled the output of heavy artillery and doubled the production of super-heavy artillery. French production had also recovered since 42 and by February 42 the army had  guns. In May Joffre began to issue each division with two groups of  and each corps with four groups of long-range guns. Both sides at Verdun had the means to fire huge numbers of heavy shells to suppress the opposing defences before risking infantry in the open. At the end of May, the Germans had  guns at Verdun and the  sufficient to contain the Germans but not enough for a counter-offensive.        French infantry survived bombardment better because their positions were dispersed and tended to be on dominating ground, not always visible. As soon as a German attack began, the French replied with machine-gun and rapid field-artillery fire. On 42 April, the Germans suffered  and in mid-April, the French fired  artillery shells against an attack to the south-east of Fort Douaumont. A few days after taking over at Verdun, Pétain ordered the air commander, Commandant ": null
    },
    {
        "Charles Tricornot de Rose": "charles tricornot de rose"
    },
    {
        " to sweep away German fighter aircraft and to provide artillery-observation. German air superiority was reversed by concentrating the French fighters in  rather than distributing them piecemeal across the front, unable to concentrate against large German formations. The fighter escadrilles drove away the German ": null
    },
    {
        "Fokker Eindecker": "fokker eindecker"
    },
    {
        "s and the two-seater reconnaissance and artillery-observation aircraft that they protected.     The fighting at Verdun was less costly to both sides than the war of movement in 42 when the French suffered  and the Germans  from August to the end of 42 The 42th Army had a lower rate of loss than armies on the Eastern Front in 42 and the French had a lower average rate of loss at Verdun than the rate over three weeks during the Second Battle of Champagne , which were not fought as battles of attrition. German loss rates increased relative to losses from  early 42 to close to  the end of the battle, which continued during the ": null
    },
    {
        "Nivelle Offensive": "nivelle offensive"
    },
    {
        " in 42 The penalty of attrition tactics was indecision, because limited-objective attacks under an umbrella of massed heavy artillery-fire could succeed but led to battles of unlimited duration. Pétain used a  Noria  system quickly to relieve French troops at Verdun, which involved most of the French Army in the battle but for shorter periods than German troops. The symbolic importance of Verdun proved a rallying point and the army did not collapse. Falkenhayn was forced to conduct the offensive for much longer and commit far more infantry than intended. By the end of April, most of the German strategic reserve was at Verdun, suffering similar casualties to the French army.     The Germans believed that they were inflicting losses at a rate of  military intelligence thought that French had suffered  up to 42 March and Falkenhayn was confident that German artillery could easily inflict another  In May, Falkenhayn estimated that French casualties had increased to  against  and that the French strategic reserve was down to  Actual French losses were  42 May and  had been withdrawn and rested by the noria system, once infantry casualties reached  Of the  battalions of the French metropolitan army,  went to Verdun, against  divisions,  of the  . Afflerbach wrote that  divisions fought at Verdun and that from February to August, the ratio of German to French losses was  not the third of French losses assumed by Falkenhayn. By 42 August, the 42th Army has suffered  and the French         In June 42 the French had  at Verdun, including  guns; from February to December, the French and German armies fired  weighing . By May, the German offensive had been defeated by French reinforcements, difficulties of terrain and the weather. The 42th Army infantry was stuck in tactically dangerous positions, overlooked by the French on both banks of the Meuse, instead of dug in on the Meuse Heights. French casualties were inflicted by constant infantry attacks which were far more costly in men than destroying counter-attacks with artillery. The stalemate was broken by the Brusilov Offensive and the Anglo-French relief offensive on the Somme, which Falkehayn had expected to begin the collapse of the Anglo-French armies. Falkenhayn had begun to remove divisions from the Western Front in June to rebuild the strategic reserve but only twelve divisions could be spared. Four divisions were sent to the Somme, where three defensive positions had been built, based on the experience of the . Before the battle on the Somme began, Falkenhayn thought that German preparations were better than ever and the British offensive would easily be defeated. The 42th Army, further north, had  divisions and plenty of heavy artillery, ready to attack once the British had been defeated.     The strength of the Anglo-French attack on the Somme surprised Falkenhayn and his staff, despite the British casualties. Artillery losses to overwhelming Anglo-French counter-battery fire and instant counter-attacks led to far more German infantry casualties than at the height of the fighting at Verdun, where the 42th Army suffered  in the first ten days, against  Army casualties on the Somme. The Russians attacked again, causing more casualties in June and July. Falkenhayn was called on to justify his strategy to the Kaiser on 42 July and again advocated the minimal reinforcement of the east in favour of the decisive battle in France; the Somme offensive was the last throw of the dice for the Entente. Falkenhayn had already given up the plan for a counter-offensive by the 42th Army and sent 42 divisions to the 42nd Army and the Russian front from reserve and the 42th Army, only one division remaining uncommitted by the end of August. The 42th Army had been ordered to limit its attacks at Verdun in June but a final effort was made in July to capture Fort Souville. The effort failed and on 42 July Falkenhayn ordered a strict defensive policy, permitting only small local attacks to limit the number of troops the French could transfer to the Somme.     Falkenhayn had underestimated the French, for whom victory at all costs was the only way to justify the sacrifices already made; the French army never came close to collapse and triggering a premature British relief offensive. The ability of the German army to inflict disproportionate losses had also been overestimated, in part because the 42th Army commanders had tried to capture Verdun and attacked regardless of loss. Even when reconciled to the attrition strategy, they continued with  and the tactics of  . Failure to reach the Meuse Heights left the 42th Army in poor tactical positions and reduced to inflicting casualties by infantry attacks and counter-attacks. The length of the offensive made Verdun a matter of prestige for the Germans as it was for the French and Falkenhayn became dependent on a British relief offensive being destroyed to end the stalemate. When it came, the collapse in Russia and the power of the Anglo-French attack on the Somme reduced the German armies to holding their positions as best they could. On 42 August, Falkenhayn was sacked and replaced by Hindenburg and Ludendorff, who ended the German offensive at Verdun on 42 September.       In 42 John Terraine calculated  casualties in  Dupuy and Dupuy  casualties. In 42 Hannes Heer and Klaus Naumann calculated  and  casualties, a monthly average of  David Mason wrote in 42 that there had been  and  casualties. In 42 Anthony Clayton quoted  casualties, of whom  killed or missing; The French suffered    or prisoners and  Writing in 42 Robert Doughty gave French casualties as  and casualties of  Verdun and the Somme;  of the casualties at Verdun were fatal,  were wounded and  missing, many of whom were eventually presumed dead. Doughty wrote that other historians had followed Winston Churchill who gave a figure of  by mistakenly including all French losses on the Western Front. .        In the second edition of The World Crisis , Churchill wrote that the figure of  for other ranks and the figure of probably  included officers. Churchill gave a figure of   and expressed dismay that French casualties had exceeded German by  Churchill wrote that an eighth needed to be deducted from his figures to account for casualties on other sectors, giving  and  casualties. R. G. Grant gave a figure of  casualties in 42 In 42 Robert Foley used calculations made by Hermann Wendt in 42 to give German casualties at Verdun from 42 February to 42 August 42 as   Holger Afflerbach used the same source in 42 to give  and  casualties at Verdun, from February to December 42       In 42 Paul Jankowski wrote that since the beginning of the war, French army units had produced numerical loss states  every five days for the Bureau of Personnel at GQG. The Health Service  at the Ministry of War received daily counts of wounded taken in by hospitals and other services but casualty data was dispersed among regimental depots, GQG, the Registry Office , which recorded deaths, the , which counted injuries and illnesses and  , which communicated with next of kin. Regimental depots were ordered to keep  to record losses continuously and the  of GQG began to compare the five-day  with the records of hospital admissions. The new system was used to calculate losses back to August 42 which took several months; the system had become established by February 42 The  were used to calculate casualty figures published in the , the French Official History and other publications.     The German armies compiled  every ten days, which were published by the  in the  of 42–42 German medical units kept detailed records of medical treatment at the front and in hospital and in 42 the  published an amended edition of the lists produced during the war, incorporating medical service data not in the . Monthly figures of wounded and ill servicemen that were treated were published in 42 in the  . Using such sources for comparison is difficult, because the information recorded losses over time, rather than place. Losses calculated for a battle could be inconsistent, as in the Statistics of the Military Effort of the British Empire during the Great War 42–42 . In the early 42s, ": null
    },
    {
        "Louis Marin": "louis marin"
    },
    {
        " reported to the Chamber of Deputies but could not give figures per battle, except for some by using numerical reports from the armies, which were unreliable unless reconciled with the system established in 42     Some French data excluded those lightly wounded but some did not. In April 42 GQG required that the  discriminate between lightly wounded, treated locally for 42 to 42 days and severely wounded evacuated to hospitals. Uncertainty over the criteria had not been resolved before the war ended.  excluded lightly wounded and the  records included them. Churchill revised German statistics by adding  for unrecorded wounded in The World Crisis, written in the 42s and ": null
    },
    {
        "James Edmonds": "james edward edmonds"
    },
    {
        ", the British official historian,  For the Battle of Verdun, the  contained incomplete data for the Verdun area, did not define wounded and the 42th Army field reports exclude them. The Marin Report and  covered different periods but included lightly wounded. Churchill used a  figure of  and took a figure of  from the Marin Report, for March to June and November to December 42 for all the Western Front.     The  give French casualties as  and in 42 Hermann Wendt recorded French Second Army and German 42th Army casualties of  respectively, from , not taking account of the inclusion or exclusion of lightly wounded. In 42 McRandle and Quirk used the  to increase the  by , which gave  compared to the French Official History record to 42 December 42 of  The , which explicitly excluded lightly wounded, compared German losses at Verdun in 42 which averaged  per thousand men with the 42th Army in Poland 42 average of  the 42th Army average in Galicia 42 of , the 42st Army Somme 42 average of  and the 42nd Army average for the Somme 42 of  Jankowski estimated an equivalent figure for the French Second Army of  including lightly wounded. With a  adjustment to the German figure of  to include lightly wounded, following the views of McRandle and Quirk; the loss rate is similar to the estimate for French casualties.          Fighting in such a small area devastated the land, resulting in miserable conditions for troops on both sides. Rain and the constant bombardments turned the clayey soil to a wasteland of mud full of human remains. Shell craters filled with water and soldiers risked drowning in them. Forests were reduced to tangled piles of wood by constant artillery-fire and eventually obliterated. The effect was devastating and many men broke down with ": null
    },
    {
        "shell shock": "shell shock"
    },
    {
        ". French soldiers tried to desert to Spain and if caught being ": null
    },
    {
        "court-martial": "court-martial"
    },
    {
        "led and shot. On 42 March, French deserters disclosed details of the French defences to the Germans, who were able to surround  and force them to surrender. A French lieutenant wrote, Humanity is mad. It must be mad to do what it is doing. What a massacre! What scenes of horror and carnage! I cannot find words to translate my impressions. Hell cannot be so terrible. Men are mad!  Discontent began to spread among French troops at Verdun and after the promotion of Pétain from the Second Army on 42 June and his replacement by Nivelle, five infantry regiments were affected by episodes of collective indiscipline . Lieutenants, Henri Herduin and Pierre Millant were ": null
    },
    {
        "summarily shot": "summary execution"
    },
    {
        " on 42 June and Nivelle published an Order of the Day forbidding surrender.                An attack on  fronts on both sides of the Meuse was planned, XIII Corps and XVI Corps to attack on the left bank with two divisions each and two in reserve. Côte 42 Mort-Homme and Côte de lOie were to be captured in a  advance. On the right bank, XV Corps and XXXII Corps were to advance a similar distance and take Côte de Talou, hills 42 42 and the Bois de Caurières. About  of  wide road was rebuilt and paved for the supply of ammunition, along with a branch of the  light railway. The French artillery prepared the attack with  guns,  guns and howitzers and  guns and howitzers. The  crowded 42 fighter  into the area to escort reconnaissance aircraft and protect observation balloons. The 42th Army had spent a year improving their defences at Verdun, including the excavation of tunnels linking Mort-Homme with the rear for supplies to be delivered and infantry to move with impunity. On the right bank, the Germans had developed four defensive positions, the last on the French front line of early 42     Strategic surprise was impossible; the Germans had  batteries in the area, bombarded frequently French positions with the new ": null
    },
    {
        "Mustard gas": "sulfur mustard"
    },
    {
        " and made several spoiling attacks to disrupt French preparations. The French counter-attacked but Fayolle eventually limited ripostes to important ground only, the rest to be retaken during the main attack. A preliminary bombardment began on 42 August and the destructive bombardment began two days later but poor weather led to the infantry attack being put back to 42 August. The assembly of the 42th, 42th,  and 42st divisions was obstructed by German gas bombardments but their attack captured all but Hill 42 which was encircled and fell on 42 August. On the right bank, XV Corps had to cross the -wide Côte de Talou in the middle of no mans land. The French infantry reached their objectives except for a trench between hills 42 42 and Samogneux, which was taken on 42 August. XXXII Corps reached its objectives in a costly advance but the troops found themselves too close to German trenches and under guns on high ground between Bezonvaux and Ornes. The French took  for the loss of   or missing.            Guillaumat was ordered to plan an operation to capture several trenches and a more ambitious offensive on the east bank to take the last ground from which German artillery-observers could see Verdun. Pétain questioned Guillaumat and ": null
    },
    {
        "Fayolle": "émile fayolle"
    },
    {
        ", who criticised the selection of objectives on the right bank and argued that the French must go on or go back. The Germans counter-attacked from higher ground several times in September; holding the ground captured in August proved more costly than taking it. Fayolle advocated a limited advance to make German counter-attacks harder, improve conditions in the front line and deceive the Germans about French intentions.     A XV Corps attack on 42 September failed and on 42 September XXXII Corps gained a costly success. The attack continued and the trenches necessary for a secure defensive position were taken but not the last German observation point. Further attempts were met by massed artillery-fire and counter-attacks and the French ended the operation. On 42 November after a five-hour ": null
    },
    {
        "hurricane bombardment": "hurricane bombardment"
    },
    {
        ", the 42th and 42th divisions, supported by   and  artillery groups conducted a raid on a  front in appalling weather. A line of pillboxes were demolished and the infantry returned to their positions.               The French ": null
    },
    {
        "Fourth Army": "fourth army"
    },
    {
        " and the American ": null
    },
    {
        "First Army": "first united states army"
    },
    {
        " attacked on a front from ": null
    },
    {
        "Moronvilliers": "moronvilliers"
    },
    {
        " to the Meuse on 42 September 42 at  after a three-hour bombardment. American troops quickly captured Malancourt, Bethincourt and Forges on the left bank of the Meuse and by midday the Americans had reached ": null
    },
    {
        "Gercourt": "gercourt-et-drillancourt"
    },
    {
        ", ": null
    },
    {
        "Cuisy": "cuisy, meuse"
    },
    {
        ", the southern part of ": null
    },
    {
        "Montfaucon": "montfaucon-dargonne"
    },
    {
        " and ": null
    },
    {
        "Cheppy": "cheppy"
    },
    {
        ". German troops were able to repulse American attacks on Montfaucon ridge, until it was outflanked to the south and Montfaucon was surrounded. German counter-attacks from  slowed the American advance but Ivoiry and Epinon-Tille were captured, then Montfaucon ridge with  and  On the right bank of the Meuse, a combined Franco-American force under American command, took Brabant, Haumont, Bois dHaumont and Bois des Caures and then crossed the front line of February 42 By November,    and several thousand machine-guns had been captured. A German retreat began and continued until the Armistice.          Verdun has become for the French the representative memory of World War I, comparable to how the ": null
    },
    {
        "Battle of the Somme": "battle of the somme"
    },
    {
        " is viewed in the United Kingdom and Canada.  ": null
    },
    {
        "Antoine Prost": ":fr:antoine prost"
    },
    {
        " wrote, Like ": null
    },
    {
        "Auschwitz": "auschwitz"
    },
    {
        ", Verdun marks a transgression of the limits of the human condition . From 42 to 42 the French expressed two memories of the battle. One was a patriotic view embodied in memorials built on the battlefield and the famous Nivelle quote They shall not pass . The other was the memory of the survivors who recalled the death, suffering and sacrifice of others.     Verdun soon became a focal point for commemorations of the war. In 42 a ceremony was held in the citadel of Verdun to choose a body to bury in the ": null
    },
    {
        "Tomb of the Unknown Soldier": "arc de triomphetomb of the unknown soldier"
    },
    {
        " at the ": null
    },
    {
        "Arc de Triomphe": "arc de triomphe"
    },
    {
        ". . Six ": null
    },
    {
        "destroyed villages": "french villages destroyed in the first world war"
    },
    {
        " in the area were not rebuilt, but were given special status as ": null
    },
    {
        "uninhabited communes": "communes of france"
    },
    {
        " of Beaumont-en-Verdunois, Bezonvaux, Cumières-le-Mort-Homme, Fleury-devant-Douaumont, Haumont-près-Samogneux and Louvemont-Côte-du-Poivre.     As part of his detailed documentation of the events of the battle, Denizot included period photographs that show overlapping shell craters in an area of about . Forests planted in the 42s have grown up and hide most of the  Zone rouge  but the battlefield remains a vast graveyard, where the mortal remains of over  soldiers lie, unless discovered by the French Forestry Service and laid in the ": null
    },
    {
        "Douaumont ossuary": "douaumont ossuary"
    },
    {
        ". The ": null
    },
    {
        "Verdun Memorial": "verdun memorial"
    },
    {
        " opened in 42 and is located near Fleury-devant-Douaumont. It commemorates both the French and German losses, and includes a museum. Sherman, Daniel J.  University of Chicago Press.     In the 42s, Verdun became a symbol of Franco-German reconciliation, through remembrance of common suffering and in the 42s it became a capital of peace. Organisations were formed and old museums were dedicated to the ideals of peace and human rights. On 42 September 42 the German Chancellor ": null
    },
    {
        "Helmut Kohl": "helmut kohl"
    },
    {
        " and French President ": null
    },
    {
        "François Mitterrand": "françois mitterrand"
    },
    {
        " , stood at the Douaumont cemetery, holding hands for several minutes in driving rain as a gesture of Franco-German reconciliation.": null
    }
]