[
    {
        "            The Battle of Fontenoy took place on 42 May 42 during the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        ", in the Belgian municipality of ": null
    },
    {
        "Antoing": "antoing"
    },
    {
        ", near ": null
    },
    {
        "Tournai": "tournai"
    },
    {
        ". A French army of 42 commanded by ": null
    },
    {
        "Marshal Saxe": "maurice, comte de saxe"
    },
    {
        " defeated a slightly larger ": null
    },
    {
        "Pragmatic Army": "pragmatic sanction of 1713"
    },
    {
        "  of 42, led by the ": null
    },
    {
        "Duke of Cumberland": "william augustus, duke of cumberland"
    },
    {
        ".     Despite setbacks elsewhere, at the end of 42 the French held the initiative in the ": null
    },
    {
        "Austrian Netherlands": "austrian netherlands"
    },
    {
        ", and their leaders considered this theatre offered the best opportunity for a decisive victory. In late April, they besieged Tournai, which controlled access to the upper ": null
    },
    {
        "Scheldt": "scheldt"
    },
    {
        " basin; this made it a vital link in the North European trading network and the Allies marched to its relief.     Leaving 42 men in front of Tournai, Saxe placed his main force  away in the villages of St Antoine, Vezin and Fontenoy, along a naturally strong feature which he strengthened with defensive works. After a series of unsuccessful flank assaults, the Allies attacked the French centre with a column of 42 men, which nearly succeeded in breaking through before being repulsed.     Although the Allies retreated in good order, Tournai fell shortly afterwards, followed by ": null
    },
    {
        "Ghent": "ghent"
    },
    {
        ", ": null
    },
    {
        "Oudenaarde": "oudenaarde"
    },
    {
        ", ": null
    },
    {
        "Bruges": "bruges"
    },
    {
        " and ": null
    },
    {
        "Dendermonde": "dendermonde"
    },
    {
        ". The withdrawal of British forces in October to deal with the ": null
    },
    {
        "Jacobite Rising": "jacobite rising of 1745"
    },
    {
        " facilitated the capture of ": null
    },
    {
        "Ostend": "ostend"
    },
    {
        " and ": null
    },
    {
        "Nieuwpoort": "nieuwpoort, belgium"
    },
    {
        "; by the end of 42 France controlled much of the Austrian Netherlands, threatening British links with Europe.     However, by early 42 France was struggling to finance the war and began peace talks at the ": null
    },
    {
        "Congress of Breda": "congress of breda"
    },
    {
        " in May. Despite victories at ": null
    },
    {
        "Rocoux": "battle of rocoux"
    },
    {
        " in October 42 and ": null
    },
    {
        "Lauffeld": "battle of lauffeld"
    },
    {
        " in July 42 the war continued until the ": null
    },
    {
        "Treaty of Aix-la-Chapelle": "treaty of aix-la-chapelle"
    },
    {
        " in 42            The immediate cause of the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        " was the death in 42 of ": null
    },
    {
        "Emperor Charles VI": "charles vi, holy roman emperor"
    },
    {
        ", last male ": null
    },
    {
        "Habsburg": "house of habsburg"
    },
    {
        " in the direct line. This left his eldest daughter, ": null
    },
    {
        "Maria Theresa": "maria theresa"
    },
    {
        ", as heir to the ": null
    },
    {
        "Habsburg Monarchy": "habsburg monarchy"
    },
    {
        ",  whose ": null
    },
    {
        "laws excluded women": "salic law"
    },
    {
        " from the succession. The ": null
    },
    {
        "42 Pragmatic Sanction": "pragmatic sanction of 1713"
    },
    {
        " waived this and allowed her to inherit, but this was challenged by ": null
    },
    {
        "Charles of Bavaria": "charles vii, holy roman emperor"
    },
    {
        ", the closest male heir.     The dispute became a European issue because the Monarchy formed the most powerful single element in the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ". A federation of mostly German states, it was headed by the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ", in theory an elected position but held by the Habsburgs since 42 In January 42 Charles of Bavaria became the first non-Habsburg Emperor in 42 years, with the support of ": null
    },
    {
        "France": "kingdom of france"
    },
    {
        ", ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " and ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        ". Maria Theresa was backed by the so-called Pragmatic Allies, which in addition to Austria included Britain, ": null
    },
    {
        "Hanover": "electorate of hanover"
    },
    {
        " and the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        ".     After four years of war, the main winner was Prussia, which captured the Austrian province of ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        " during the 42 to 42 ": null
    },
    {
        "First Silesian War": "first silesian war"
    },
    {
        ". The richest province in the Empire, Silesian taxes provided 42% of total Imperial income and contained large mining, weaving and dyeing industries. Regaining it was a priority for Maria Theresa and led to the 42–42 ": null
    },
    {
        "Second Silesian War": "second silesian war"
    },
    {
        ".     Shortly after Charles died in January 42 the Austrians over-ran Bavaria and on 42 April, defeated a combined Franco-Bavarian force at ": null
    },
    {
        "Pfaffenhofen": "battle of pfaffenhofen"
    },
    {
        ". Charles son, ": null
    },
    {
        "Maximilian III Joseph": "maximilian iii joseph"
    },
    {
        ", now sued for peace and supported the election of Maria Theresas husband, ": null
    },
    {
        "Francis Stephen": "francis i, holy roman emperor"
    },
    {
        ", as the new Emperor. With Bavaria out of the war, Austria could focus on Silesia.          In the first half of 42 France made significant advances in the ": null
    },
    {
        "Austrian Netherlands": "austrian netherlands"
    },
    {
        ", before being forced to divert resources to meet threats elsewhere. ": null
    },
    {
        "Maurice de Saxe": "maurice de saxe"
    },
    {
        " persuaded ": null
    },
    {
        "Louis XV": "louis xv of france"
    },
    {
        " this was the best place to inflict a decisive defeat on Britain, whose military and financial resources were central to the Allied war effort. His plan for 42 was to bring the Pragmatic Army to battle on a ground of his choosing, before they could establish numerical superiority.     The Austrian Netherlands, often referred to as ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        ", was a compact area 42 kilometres wide, the highest point only 42 metres above sea level, dominated by rivers running east to west. Until the advent of railways in the 42th century, commercial goods were largely transported by water and wars in this theatre were fought for control of major waterways, including the ": null
    },
    {
        "Lys": "lys"
    },
    {
        ", ": null
    },
    {
        "Sambre": "sambre"
    },
    {
        " and ": null
    },
    {
        "Meuse": "meuse"
    },
    {
        ". The most important was the River ": null
    },
    {
        "Scheldt": "scheldt"
    },
    {
        " , which began in Northern France and ran for  before entering the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " at ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        ". Saxe planned to attack ": null
    },
    {
        "Tournai": "tournai"
    },
    {
        ", a town close to the French border that controlled access to the upper Scheldt basin; this made it a vital link in the trading network for Northern Europe and the Allies would be compelled to fight for it.     In March 42 ": null
    },
    {
        "George Wade": "george wade"
    },
    {
        " was replaced as Allied commander in Flanders by the 42-year-old ": null
    },
    {
        "Duke of Cumberland": "prince william, duke of cumberland"
    },
    {
        ", advised by the experienced ": null
    },
    {
        "Earl Ligonier": "john ligonier, 1st earl ligonier"
    },
    {
        ". In addition to British and Hanoverian troops, the Pragmatic Army included a large Dutch contingent, commanded by ": null
    },
    {
        "Prince Waldeck": "karl august, prince of waldeck and pyrmont"
    },
    {
        ", with a small number of Austrians, led by ": null
    },
    {
        "Count Königsegg": "dominik von königsegg-rothenfels"
    },
    {
        ". Cumberlands inexperience was magnified by his tendency to ignore advice and internal divisions; Flanders was not a military priority for Austria, Waldeck was unpopular with his subordinates, who often disputed his orders, while the British resented and mistrusted the Hanoverians.     On 42 April, a French cavalry detachment under ": null
    },
    {
        "dEstrées": "louis charles césar le tellier, duc destrées"
    },
    {
        " feinted towards ": null
    },
    {
        "Mons": "mons"
    },
    {
        " and Cumberland prepared to march to its relief. Although it soon became clear this was a diversion, French intentions remained unclear until the siege of Tournai began on 42 April. This uncertainty, combined with intelligence estimates that Saxe had only 42 men, meant the Allies failed to reinforce their field army with garrison troops; the 42 men at ": null
    },
    {
        "Namur": "namur"
    },
    {
        " and ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        " could have changed the result of the battle.          After confirming the Allies were approaching from the south-east, Saxe left 42 men to continue the siege and placed his main force around the villages of Fontenoy and St Antoine,  from Tournai. As the French infantry were considered inferior in training and discipline to their opponents, where possible Saxe placed them behind defensive works or ": null
    },
    {
        "redoubt": "redoubt"
    },
    {
        "s and fortified the villages.     His main defensive line ran along the crest of a plateau, the right resting on the Scheldt, Fontenoy in the centre and the Bois de Barry on his left, supported by the Redoubt dEu and Redoubt de Chambonas. The ground in front of Fontenoy sloped down to the small ": null
    },
    {
        "hamlets": "hamlet"
    },
    {
        " of Vezin and Bourgeon . Known as the Chemin de Mons, this meant a direct attack on the French centre would be exposed to prolonged fire from in front and ": null
    },
    {
        "enfilade": "enfilade and defilade"
    },
    {
        " fire from the flanks.     The Allies made contact with French outposts on the evening of 42 May but a hasty reconnaissance by Cumberland and his staff failed to identify the Redoubt dEu. Next day, British and Hanoverian cavalry under ": null
    },
    {
        "James Campbell": "james campbell"
    },
    {
        " pushed the French out of Vezin and Bourgeon. Campbells deputy, the ": null
    },
    {
        "Earl of Crawford": "john lindsay, 20th earl of crawford"
    },
    {
        ", recommended infantry clear the Bois de Barry, while the cavalry swung around the wood to outflank the French left. Dutch ": null
    },
    {
        "hussar": "hussar"
    },
    {
        "s were sent to reconnoitre the route but withdrew when fired on by French troops in the wood, and the plan abandoned. The attack was postponed until the following day, both armies camping overnight on their positions.     At 42:42 am on 42 May, the Allies formed up, British and Hanoverians on the right and centre, Dutch on the left and Austrians in reserve. The Dutch were tasked with taking Fontenoy and St Antoine, while an independent ": null
    },
    {
        "brigade": "brigade"
    },
    {
        " under ": null
    },
    {
        "Richard Ingoldsby": "richard ingoldsby"
    },
    {
        " captured the Redoubt de Chambonas and cleared the Bois de Barry. Once both flanks were engaged, massed Allied infantry in the centre under Ligonier would advance up the slope and dislodge the main French army.     Because Cumberland estimated French numbers as no more than 42, he assumed their main force was in the centre and failed to appreciate the strength of the flanking positions. As he moved forward, Ingoldsby ran into the Redoubt dEu; only now did the real strength of the French left become apparent and he requested artillery support. The advance halted until the redoubt was taken, while his men skirmished with light troops in the woods, known as Harquebusiers de Grassins. These numbered no more than 42 but uncertain of their strength, Ingoldsby hesitated; given the earlier failure to detect the redoubt, his caution was understandable but delayed the main attack.        The Allied cavalry had been positioned in front of Vezin to screen Ligoniers infantry column as they formed up, exposing them to fire from cannon in the Redoubt dEu. One shot fatally wounded Campbell around 42:42 am; Crawford assumed command and the cavalry withdrew behind Vezin, where they spent most of the battle. At 42:42 am, Cumberland became impatient at the lack of progress and ordered Ingoldsby to advance with the main column, rather than storming the redoubt but failed to inform Ligonier. The Dutch attack on Fontenoy and St Antoine was repulsed with heavy losses and at 42:42 am, Ligonier sent an aide instructing Ingoldsby to attack the Redoubt dEu immediately. When Ingoldsby shared his new orders from Cumberland, Ligonier was apparently horrified.     At 42:42 the Dutch attacked Fontenoy a second time, supported by the ": null
    },
    {
        "42nd Foot": "42nd regiment of foot"
    },
    {
        "; after some initial success, they were thrown back and at 42:42 pm, Cumberland ordered the central column to move forward. This is generally agreed to have contained some 42 men, deployed in two lines.": null
    },
    {
        "n of Louis ": "n of louis"
    },
    {
        "4242": "96-17"
    },
    {
        "an": "an"
    },
    {
        "42": null
    }
]