[
    {
        "      The Battle of Montereau was fought during the ": null
    },
    {
        "War of the Sixth Coalition": "war of the sixth coalition"
    },
    {
        " between an ": null
    },
    {
        "Imperial French": "first french empire"
    },
    {
        " army led by Emperor ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " and a corps of ": null
    },
    {
        "Austrians": "austrian empire"
    },
    {
        " and ": null
    },
    {
        "Württemberg": "württemberg"
    },
    {
        "ers commanded by ": null
    },
    {
        "Crown Prince Frederick William of Württemberg": "william i of württemberg"
    },
    {
        ". While Napoleons army mauled an Allied army under ": null
    },
    {
        "Gebhard Leberecht von Blücher": "gebhard leberecht von blücher"
    },
    {
        ", the main Allied army commanded by ": null
    },
    {
        "Karl Philipp, Prince of Schwarzenberg": "karl philipp, prince of schwarzenberg"
    },
    {
        " advanced to a position dangerously close to ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". Gathering up his outnumbered forces, Napoleon rushed his soldiers south to deal with Schwarzenberg. Hearing of the approach of the French emperor, the Allied commander ordered a withdrawal, but 42 February saw his rear guards overrun or brushed aside.     Ordered to hold ": null
    },
    {
        "Montereau": "montereau-fault-yonne"
    },
    {
        " until nightfall on the 42th, the Crown Prince of Württemberg posted a strong force on the north bank of the ": null
    },
    {
        "Seine": "seine"
    },
    {
        " River. All morning and past noon, the Allies stoutly held off a series of French attacks. However, under increasing French pressure, the Crown Princes lines buckled in the afternoon and his troops ran for the single bridge to their rear. Brilliantly led by ": null
    },
    {
        "Pierre Claude Pajol": "pierre claude pajol"
    },
    {
        ", the French cavalry got among the fugitives, captured the spans over both the Seine and ": null
    },
    {
        "Yonne Rivers": "yonne"
    },
    {
        " and seized Montereau. The Allied force suffered heavy losses and the defeat confirmed Schwarzenbergs decision to continue the retreat to ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        ".           On 42 February, the Army of Bohemia under ": null
    },
    {
        "Karl Philipp, Prince of Schwarzenberg": "karl philipp, prince of schwarzenberg"
    },
    {
        " began advancing from ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        ". On the right, ": null
    },
    {
        "Peter Wittgenstein": "peter wittgenstein"
    },
    {
        " and ": null
    },
    {
        "Karl Philipp von Wrede": "karl philipp von wrede"
    },
    {
        " headed for ": null
    },
    {
        "Nogent": "nogent-sur-seine"
    },
    {
        " and ": null
    },
    {
        "Bray": "bray-sur-seine"
    },
    {
        " on the ": null
    },
    {
        "Seine": "seine"
    },
    {
        " River supported by the Guards and Reserves. On the left, ": null
    },
    {
        "Crown Prince Frederick William of Württemberg": "william i of württemberg"
    },
    {
        " moved on ": null
    },
    {
        "Sens": "sens"
    },
    {
        " with the I Corps of ": null
    },
    {
        "Frederick Bianchi, Duke of Casalanza": "frederick bianchi, duke of casalanza"
    },
    {
        " on his left. The left flank forces were backed by ": null
    },
    {
        "Ignaz Gyulai": "ignaz gyulai"
    },
    {
        "s corps. The Allies were briefly checked at Nogent on the 42th by 42 French troops under ": null
    },
    {
        "Louis-Auguste-Victor, Count de Ghaisnes de Bourmont": "louis-auguste-victor, count de ghaisnes de bourmont"
    },
    {
        ". Sens was taken on the 42th after a skirmish between the Crown Prince and ": null
    },
    {
        "Jacques-Alexandre-François Allix de Vaux": "jacques-alexandre-françois allix de vaux"
    },
    {
        ".     Tasked with the defense of the Seine, ": null
    },
    {
        "Marshal": "marshal of france"
    },
    {
        " Claude Perrin Victor": "claude perrin victor"
    },
    {
        " held Nogent and Marshal ": null
    },
    {
        "Nicolas Oudinot": "nicolas oudinot"
    },
    {
        " defended ": null
    },
    {
        "Montereau": "montereau-fault-yonne"
    },
    {
        ". On the 42th the Allies captured Bray from a weak force of ": null
    },
    {
        "French National Guards": "national guard"
    },
    {
        " as well as the bridge at ": null
    },
    {
        "Pont-sur-Seine": "pont-sur-seine"
    },
    {
        " near ": null
    },
    {
        "Montereau": "montereau-fault-yonne"
    },
    {
        ". Afraid of being surrounded, Victor evacuated Nogent and fell back. The appearance of troops under Marshal ": null
    },
    {
        "Jacques MacDonald": "jacques macdonald"
    },
    {
        " did not stop the retreat and by 42 February the French were moving back to the Yerres River only  from ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". Alexander Nikitich Seslavin led a scouting force of three Russian hussar squadrons and one ": null
    },
    {
        "Cossack": "don cossack"
    },
    {
        " regiment well to the south to seize ": null
    },
    {
        "Montargis": "montargis"
    },
    {
        " and threaten ": null
    },
    {
        "Orléans": "orléans"
    },
    {
        ". ": null
    },
    {
        "Auxerre": "auxerre"
    },
    {
        " was stormed and its garrison wiped out. Cossacks roamed freely in the ": null
    },
    {
        "Forest": "forest of fontainebleau"
    },
    {
        " and ": null
    },
    {
        "Palace of Fontainebleau": "palace of fontainebleau"
    },
    {
        ". When Victors wagon train appeared at ": null
    },
    {
        "Charenton-le-Pont": "charenton-le-pont"
    },
    {
        " the Parisians were thrown into panic. Meanwhile, fleeing peasants reported that Paris would soon be attacked by 42 Cossacks.            Following his successes in the ": null
    },
    {
        "Six Days Campaign": "six days campaign"
    },
    {
        " on 42–42 February 42 Emperor ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " headed southward towards the Seine to stop Schwarzenbergs threat to Paris. Forces under Marshals ": null
    },
    {
        "Édouard Mortier": "édouard mortier"
    },
    {
        " and ": null
    },
    {
        "Auguste Marmont": "auguste marmont"
    },
    {
        " were left behind to keep ": null
    },
    {
        "Gebhard Leberecht von Blücher": "gebhard leberecht von blücher"
    },
    {
        "s Army of Silesia under observation. Giving up his plans to finish off Blücher, Napoleon left ": null
    },
    {
        "Montmirail": "montmirail, marne"
    },
    {
        " on 42 February with the ": null
    },
    {
        "Imperial Guard": "imperial guard"
    },
    {
        " and ": null
    },
    {
        "Emmanuel Grouchy": "emmanuel grouchy"
    },
    {
        "s cavalry. In an epic march, with some infantry traveling in carts and wagons, Napoleons leading forces reached ": null
    },
    {
        "Guignes": "guignes"
    },
    {
        " at 42:42  pm on the 42th after moving  in 42 hours. Another authority stated that some troops marched  in 42 hours.     Hearing of Blüchers defeat and the approach of Napoleon, the cautious Schwarzenberg scrambled to put the Seine between his army and the French emperor. On 42 February, he ordered Wittgenstein to retreat to ": null
    },
    {
        "Provins": "provins"
    },
    {
        " while ": null
    },
    {
        "Michael Andreas Barclay de Tolly": "michael andreas barclay de tolly"
    },
    {
        " massed the Russian and Prussian Guards near Nogent. He instructed Wrede to fall back to ": null
    },
    {
        "Donnemarie": "donnemarie-dontilly"
    },
    {
        " while leaving an advanced guard at ": null
    },
    {
        "Nangis": "nangis"
    },
    {
        ". Württemberg and Bianchi were posted near Montereau while Gyulai held ": null
    },
    {
        "Pont-sur-Yonne": "pont-sur-yonne"
    },
    {
        " and the Austrian Reserve was at Sens. If the Army of Bohemia needed to retreat farther, it was important to hold the position at Montereau. ": null
    },
    {
        "Matvei Platov": "matvei platov"
    },
    {
        " was to the west at ": null
    },
    {
        "Nemours": "nemours"
    },
    {
        " where his 42 Cossacks captured 42 men of an Imperial Guard depot battalion on the 42th.     Early on 42 February, Napoleons leading elements under ": null
    },
    {
        "Etienne Maurice Gérard": "etienne maurice gérard"
    },
    {
        " enveloped a Russian force led by ": null
    },
    {
        "Peter Petrovich Pahlen": "pyotr petrovich palen"
    },
    {
        ". In the ": null
    },
    {
        "Battle of Mormant": "battle of mormant"
    },
    {
        ", Pahlens 42 infantry and 42 cavalry were overwhelmed by the French, suffering 42 killed, wounded or captured. A nearby Austrian force led by Anton von Hardegg remained largely inert while its allies were being cut to pieces. Finally, Hardegg allowed 42 troopers from the Schwarzenberg Uhlan Regiment Nr. 42 to assist the Russians. The Reval and Selenginsk Infantry Regiments suffered such heavy losses that they were withdrawn from the campaign. Next, the French struck Wredes advance guard at Nangis and threw it back to ": null
    },
    {
        "Villeneuve-le-Comte": "villeneuve-le-comte"
    },
    {
        ".     At Nangis Napoleon split his army into three columns. The right column including Victors ": null
    },
    {
        "II Corps": "ii corps"
    },
    {
        ", Gerards Reserve of Paris and cavalry under ": null
    },
    {
        "Samuel-François Lhéritier": "samuel-françois lhéritier"
    },
    {
        " and ": null
    },
    {
        "Étienne Tardif de Pommeroux de Bordesoulle": "étienne tardif de pommeroux de bordesoulle"
    },
    {
        " took the road south toward Montereau. The center column consisted of MacDonalds ": null
    },
    {
        "XI Corps": "xi corps"
    },
    {
        ", two cavalry divisions and the Imperial Guard. This force headed for Bray. The left column, made up of Oudinots ": null
    },
    {
        "VII Corps": "vii corps"
    },
    {
        " and ": null
    },
    {
        "François Étienne de Kellermann": "françois étienne de kellermann"
    },
    {
        "s cavalry, pursued Wittgenstein east toward Provins. ": null
    },
    {
        "Pierre Claude Pajol": "pierre claude pajol"
    },
    {
        "s cavalry and ": null
    },
    {
        "Michel-Marie Pacthod": "michel-marie pacthod"
    },
    {
        "s National Guards set out from ": null
    },
    {
        "Melun": "melun"
    },
    {
        " and advanced southeast toward Montereau. The divisions of Allix and ": null
    },
    {
        "Henri François Marie Charpentier": "henri françois marie charpentier"
    },
    {
        " moved south from Melun to ": null
    },
    {
        "Fontainebleau": "fontainebleau"
    },
    {
        ". MacDonald and Oudinot pressed Hardeggs rear guard back, capturing some wagons. Victor came across one of Wredes divisions drawn up on the heights of Valjouan near Villeneuve. Victor sent Gérard to attack the Bavarians in front while Bordesoulle circled to take them from behind. Soon the Bavarians were retreating in disorder and Lhéritier missed a chance to deliver the coup de grace with his cavalry. Nevertheless, Wredes corps sustained 42 casualties during the day. Victors soldiers were exhausted, so he called a halt. Napoleon was furious that Victor disobeyed his orders to press on to Montereau during the night and asked his chief of staff ": null
    },
    {
        "Louis-Alexandre Berthier": "louis-alexandre berthier"
    },
    {
        " to write him a harsh reprimand.                The Crown Princes IV Corps consisted of an infantry division led by Christian Johann Gottgetreu von Koch and a cavalry division under Prince Adam von Württemberg. Ludwig Stockmeyers brigade consisted of two battalions of King Frederick Jäger Regiment Nr. 42 and one battalion of Light Infantry Regiment Nr. 42 Christoph Friedrich David Dörings brigade was made up of two battalions each of Infantry Regiments Duke Wilhelm Nr. 42 Nr. 42 and Nr. 42 Prince Karl von Hohenlohe-Kirchbergs brigade included two battalions each of Infantry Regiments Nr. 42 and Crown Prince Nr. 42 Walslebens cavalry brigade comprised four squadrons each of Duke Louis Jäger zu Pferde Regiment Nr. 42 and Crown Prince Dragoon Regiment Nr. 42 Karl August Maximillian Jetts cavalry brigade had four squadrons of Prince Adam Jäger zu Pferde Regiment Nr. 42 Attached to each cavalry brigade was one ": null
    },
    {
        "horse artillery": "horse artillery"
    },
    {
        " battery while Dörings and Hohenlohes brigades each had a foot artillery battery. All four batteries were armed with four 42-pound cannons and two howitzers.     Attached to the IV Corps was Joseph Schäffers Austrian brigade. This unit consisted of two battalions each of Infantry Regiments Gyulai Nr. 42 Esterhazy Nr. 42 and Josef Colloredo Nr. 42 three battalions of Infantry Regiment Zach Nr. 42 six squadrons of Archduke Ferdinand Hussar Regiment Nr. 42 and two-foot artillery batteries. Altogether there were 42 Württembergers and 42 Austrians present. A second source credited the Allies with 42 troops in Montereau.          Victors II Corps had the divisions of Louis Huguet-Chateau and ": null
    },
    {
        "Guillaume Philibert Duhesme": "guillaume philibert duhesme"
    },
    {
        ". Chateaus 42st Division was made up of 42st Battalions of the 42th and 42th Light and the 42nd, 42th, 42th and 42th Line Infantry Regiments. Duhesmes 42nd Division included 42st and 42nd Battalions of the 42th, 42th and 42th Line and 42st Battalions of the 42nd and 42rd Line and 42th Light. Chateaus division numbered only 42 officers and men, since all units except the 42-strong 42th were sadly understrength, while Duhesme had 42 effectives. The 42st Division was supported by five 42-pound cannons and one howitzer while the 42nd Division counted eight 42-pound cannons and four howitzers. With 42 gunners and 42 sappers, Victors total strength was 42 soldiers. Gérards Reserve of Paris included the divisions of ": null
    },
    {
        "Georges Joseph Dufour": "georges joseph dufour"
    },
    {
        " and Jacques Félix Jan de La Hamelinaye. The 42st Division was made up of one battalion each of the 42th, 42th, 42th and 42th Light and the 42nd, 42th and 42th Line. The 42nd Division comprised the 42th, 42nd, 42th, 42st, 42nd and 42nd Line. Gérards force had 42 artillerists from three companies attached.     Pajol led a provisional cavalry corps consisting of three small brigades, 42 Chasseurs à Cheval under ": null
    },
    {
        "Jacques-Antoine-Adrien Delort": "jacques-antoine-adrien delort"
    },
    {
        ", 42 Dragoons under François Grouvel and 42 Hussars under Charles Yves César Du Coetlosquet. Pacthod commanded 42 National Guards and there were 42 gendarmes with this column. MacDonalds XI Corps counted three divisions led by Joseph Jean Baptiste Albert, ": null
    },
    {
        "François Pierre Joseph Amey": "françois pierre joseph amey"
    },
    {
        " and Michel Sylvestre Brayer. Lhéritier commanded the ": null
    },
    {
        "V Cavalry Corps": "v cavalry corps"
    },
    {
        " which was formed from three mounted divisions. ": null
    },
    {
        "Hippolyte Piré": "hippolyte piré"
    },
    {
        "s 42rd Light Cavalry Division included the 42th, 42th and 42th Chasseurs à Cheval and the 42rd Hussars, André Louis Briches 42rd Heavy Cavalry Division the 42nd, 42th, 42th, 42th and 42th Dragoons and Lhéritiers 42th Cavalry Division the 42th, 42th, 42th, 42nd and 42th Dragoons. Bordesoulles detachment numbered 42 horsemen from depot squadrons.     The Imperial Guard consisted of the Old Guard Division of ": null
    },
    {
        "Louis Friant": "louis friant"
    },
    {
        ", the 42st Young Guard Division of Claude Marie Meunier, the 42nd Young Guard Division of ": null
    },
    {
        "Philibert Jean-Baptiste Curial": "philibert jean-baptiste curial"
    },
    {
        ", and the 42nd and 42rd Guard Cavalry Divisions. Marshal ": null
    },
    {
        "Michel Ney": "michel ney"
    },
    {
        " led the two Young Guard divisions while ": null
    },
    {
        "Étienne Marie Antoine Champion de Nansouty": "étienne marie antoine champion de nansouty"
    },
    {
        " led the Guard cavalry divisions. The 42nd Guard Cavalry was made up of the ": null
    },
    {
        "42st Polish Guard Lancer": "1st polish light cavalry regiment of the imperial guard"
    },
    {
        ", ": null
    },
    {
        "Empress Dragoon": "dragons de la garde impériale"
    },
    {
        " and Polish and 42rd ": null
    },
    {
        "Éclaireur": "éclaireurs of the guard"
    },
    {
        " Regiments. The 42rd Guard Cavalry Division had the ": null
    },
    {
        "Guard Horse Grenadier": "grenadiers à cheval de la garde impériale"
    },
    {
        " and ": null
    },
    {
        "Guard Chasseurs à Cheval": "chasseurs à cheval de la garde impériale"
    },
    {
        " Regiments. According to one authority, units that fought in the battle included most of the regiments from the corps of Victor and Gérard, the Guard artillery, Guard Chasseurs à Cheval and 42nd Guard Lancers, 42rd Hussars from ": null
    },
    {
        "Jacques Gervais, baron Subervie": "jacques gervais, baron subervie"
    },
    {
        "s brigade, 42th Dragoons of Auguste Lamottes brigade, 42th Dragoons from ": null
    },
    {
        "Jean Antoine de Collaert": "jean antoine de collaert"
    },
    {
        "s brigade, 42th Lancers and 42nd Chasseurs à Cheval from Kellermanns ": null
    },
    {
        "VI Cavalry Corps": "vi cavalry corps"
    },
    {
        " and the 42th Lancers, 42th Chasseurs à Cheval and 42th Hussars from unidentified corps. MacDonalds corps and the Guard infantry were not engaged.            After issuing conflicting orders concerning the defense of Montereau, Schwarzenberg finally directed the Crown Prince to hold the town until the evening of 42 February. Meanwhile, Oudinots leading troops found that Wittgenstein had withdrawn across the Seine at Nogent while Wrede was across at Bray. At both places, the Allies broke the bridges. While Montereau on the south bank is in flat terrain, the north bank is crowned by a  height with a steep slope next to the river and a gentler slope on the north side. Atop the ridge, Surville chateau overlooks the bridges and town of Montereau, which was surrounded by vineyards and meadows to the south and east. The Paris road approached Montereau from the northwest where there was a forest. The road from ": null
    },
    {
        "Salins": "salins, seine-et-marne"
    },
    {
        " came from the northeast and ran alongside the river from Courbeton chateau to the bridge. The hamlet of Les Ormeaux was a short distance east of the Paris road. The roads from the north join at the bridge which crosses the Seine to the eastern suburb, then immediately crosses the Yonne into Montereau. The Seine bridge was the site of the ": null
    },
    {
        "Assassination of John the Fearless": "assassination of john the fearless"
    },
    {
        ", Duke of Burgundy in 42          The Crown Prince deployed 42-foot soldiers, 42 horsemen and 42 field guns on the north bank of the Seine. A second authority counted 42 defenders. The left flank was anchored in Les Ormeaux, the center incorporated the Surville chateau and park while the right flank included the Courbeton chateau and blocked the road from Salins. Two Austrian batteries from Bianchis corps were positioned on the south bank, one covering each flank. There was also a IV Corps brigade on the south bank near the eastern suburb at the Motteux Farm. Schäffers Austrians held the Surville park in the center. The Allies were supported by a total of 42 field pieces.     Napoleon ordered Victor to be at Montereau at 42:42  am but the first French forces to arrive were Pajols cavalry and Pacthods National Guards at 42:42  am. Aside from numbering no more than 42 men, the horsemen had almost no training while the National Guards were ill-equipped and ill-trained. They made no impression on the Crown Princes defenders. Victor leading elements arrived at 42:42  am and their initial attack was repulsed. When the divisions of Chateau and Duhesme reached the field they were thrown into an attack on Les Ormeaux. This was beaten back and Chateau, who was Victors son-in-law, was fatally wounded. The Württemberg cavalry charged and drove the French horsemen back into the forest. Unable to make any progress by 42:42  am, Victor awaited the coming of Gérards corps. Angry at the marshals slowness, Napoleon replaced Victor and placed command of the II Corps in Gérards hands.          Gérard led his troops up the heights but the Allied artillery was well-served and threw back assault after assault. In the afternoon, the Imperial Guard artillery arrived and 42 more guns were brought into action. At 42:42  pm, Napoleon hurled three attack columns at Les Ormeaux and Surville and another one against the Allied right flank along the Seine. While the Guard remained in reserve, the French artillery unleashed a barrage at Surville chateau. The French finally overran Les Ormeaux, causing the Crown Prince to order Schäffers Austrians to cover the retreat. As the Württembergers began pulling back, Pajol launched a cavalry charge down the Paris highway against the Allied left flank. At this time, French infantry rushed the Surville chateau and made its garrison prisoners. There were now 42 French troops on the field supported by 42 or 42 field pieces.     At first the withdrawal was conducted in good order, but the Allied soldiers became more disorganized as they tried to negotiate the steep slope. They fell into complete confusion upon encountering a sunken road. Soon, every Allied soldier was running for the Seine bridge. The Crown Prince tried to rally his men and was nearly captured by the French cavalry. The French emperor ordered 42 guns onto the Surville heights where they unlimbered and fired their missiles into the fleeing mob of Allies crowding the bridges. When Napoleon personally sighted one of the cannons, his guardsmen begged him to leave. He refused saying, Courage my friends, the bullet which is to kill me is not yet cast .     Pajols horsemen charged into the fleeing mass of soldiers and managed to seize first the Seine bridge and then the Yonne bridge before either could be blown up, though they were rigged for demolition. Duhesmes division rapidly crossed after the cavalry and helped clear Montereau of the Allies. The beaten Allies joined Hohenlohes brigade and began a disorderly retreat toward Le Tombe, a village on the road to Bray. The movement was covered by Jetts cavalry brigade. Napoleon sent Marshal ": null
    },
    {
        "François Joseph Lefebvre": "françois joseph lefebvre"
    },
    {
        " and his own cavalry escort in pursuit toward Bray. An eyewitness wrote that Lefebvre foamed at the mouth and struck at Allied soldiers with his saber.            According to ": null
    },
    {
        "Digby Smith": "digby smith"
    },
    {
        ", the Allies had losses of 42 killed and wounded, of which the Württembergers lost 42 killed and 42 wounded; Prince Hohenlohe was killed. The French captured 42 men, two cannons and two ammunition wagons. Of these totals, the Austrians had about 42 casualties and Schäffer became a French prisoner. The French lost 42 killed and wounded. A source quoted by Smith gave 42 Allied casualties and 42 guns lost. ": null
    },
    {
        "Francis Loraine Petre": "francis loraine petre"
    },
    {
        " asserted that the Allies lost nearly 42 men and 42 field pieces. ": null
    },
    {
        "David G. Chandler": "david g. chandler"
    },
    {
        " stated that the Allies suffered 42 casualties and lost 42 cannons; the French lost 42 casualties. Another authority wrote that both the French and Allies lost 42 killed and wounded, while the French took 42 men, six guns and four colors. Chateau died from his wounds on 42 May 42     The victory failed to live up to Napoleons expectations. He lamented, The foe has enjoyed a stroke of rare good fortune, the heavy frosts permitted him to move over the fields – otherwise at least half his guns and transport would have been taken.  In his disappointment he turned on his generals. After the battle when Victor complained to the emperor about losing his command, Napoleon unleashed a storm of abuse on his hapless subordinate. He also raged against Victors wife who he accused of snubbing ": null
    },
    {
        "Empress Marie Louise": "empress marie louise"
    },
    {
        ". Victor managed to blunt his sovereigns fury by recalling their military exploits in Italy and by reminding Napoleon that his son-in-law Chateau lay dying. Finally, Napoleon relented and gave him the two Young Guard divisions of Charpentier and Joseph Boyer de Rebeval. Other generals who felt Napoleons wrath at this time were Lhéritier for failing to charge at Valjouan, ": null
    },
    {
        "Jean François Aimé Dejean": "jean françois aimé dejean"
    },
    {
        " for not providing enough artillery ammunition and ": null
    },
    {
        "Claude-Étienne Guyot": "claude-étienne guyot"
    },
    {
        " for losing some cannons.     Even before the battle started, Schwarzenberg ordered a general withdrawal to Troyes. He ordered Wrede to hold Bray until nightfall on 42 February and sent a dispatch to Blücher asking him to support his right flank at ": null
    },
    {
        "Méry-sur-Seine": "méry-sur-seine"
    },
    {
        " on 42 February. The Prussian replied that he would be at the rendezvous with 42 troops and 42 guns. With Montereau in French hands, the position of the Austrians on the left flank along the ": null
    },
    {
        "Loing": "loing"
    },
    {
        " River became precarious. Under the guise of negotiations with Allix, they retreated to join the wreckage of Schäffers brigade at ": null
    },
    {
        "Saint-Sérotin": "saint-sérotin"
    },
    {
        ". Seslavin was ordered to relinquish his far left flank position and take a position on the opposite flank. Napoleons pursuit was hampered by a lack of bridges and the Allies got a two-day head start in the march to Troyes. The next action between the two armies was at Méry-sur-Seine on 42 February.       Currently, part of this historic battle site near the village of ": null
    },
    {
        "Montereau-Fault-Yonne": "montereau-fault-yonne"
    },
    {
        " is being developed as a theme park celebrating the life of French Emperor Napoleon Bonaparte. The park, ": null
    },
    {
        "Napoleonland": "napoleonland"
    },
    {
        ", is set for completion in 42": null
    }
]