[
    {
        "           The Battles of Lostwithiel or Lostwithiel Campaign, took place near ": null
    },
    {
        "Lostwithiel": "lostwithiel"
    },
    {
        " and ": null
    },
    {
        "Fowey": "fowey"
    },
    {
        " in Cornwall during the ": null
    },
    {
        "First English Civil War": "first english civil war"
    },
    {
        " in 1644. They resulted in victory for the Royalists commanded by ": null
    },
    {
        "King Charles": "charles i of england"
    },
    {
        " over the Parliamentarians commanded by the ": null
    },
    {
        "Earl of Essex": "robert devereux, 3rd earl of essex"
    },
    {
        ".       After defeating the army of Sir ": null
    },
    {
        "William Waller": "william waller"
    },
    {
        " at the ": null
    },
    {
        "Battle of Cropredy Bridge": "battle of cropredy bridge"
    },
    {
        ", King Charles marched west in pursuit of the Parliamentarian army of the Earl of Essex, who was invading the Royalist stronghold of ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        ".     Essex had been misled into believing that he could expect substantial support from the people of Cornwall. When he had reached ": null
    },
    {
        "Bodmin": "bodmin"
    },
    {
        " on 28 July, he found that there was no chance of supplies or recruits, and he also learned that the Royalist army was at ": null
    },
    {
        "Launceston": "launceston, cornwall"
    },
    {
        ", close to his rear. He withdrew to ": null
    },
    {
        "Lostwithiel": "lostwithiel"
    },
    {
        ", covering the port of ": null
    },
    {
        "Fowey": "fowey"
    },
    {
        ". Essex had previously arranged to rendezvous at Fowey with the Parliamentarian fleet under the ": null
    },
    {
        "Earl of Warwick": "robert rich, 2nd earl of warwick"
    },
    {
        ", but no ships appeared. Warwick was unable to leave ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        " because of westerly winds.     Charless army had been reinforced as it marched, and outnumbered that of Essex by nearly two to one. The first clashes took place on 2 August, but little action took place for several days, as the King waited for all his forces to arrive and Essex waited for the fleet.       On 13 August, the Royalists began to attack in earnest, occupying several outposts on the east bank of the ": null
    },
    {
        "River Fowey": "river fowey"
    },
    {
        ", making it even more difficult for help to reach Essex. A Parliamentarian attempt to send a relieving force under Lieutenant General ": null
    },
    {
        "Middleton": "john middleton, 1st earl of middleton"
    },
    {
        " was defeated at ": null
    },
    {
        "Bridgwater": "bridgwater"
    },
    {
        " in ": null
    },
    {
        "Somerset": "somerset"
    },
    {
        ".     On 21 August, the Royalists attacked Essexs positions north of Lostwithiel, capturing the ruins of ": null
    },
    {
        "Restormel Castle": "restormel castle"
    },
    {
        ". Royalist cavalry threatened to cut the Parliamentarians off from Fowey. Essex realised that there was no hope of relief and ordered his cavalry to break out of the encirclement. Under Sir ": null
    },
    {
        "William Balfour": "william balfour"
    },
    {
        ", they broke through the Royalist lines on the night of 31 August, eventually reaching ": null
    },
    {
        "Plymouth": "plymouth"
    },
    {
        " thirty miles to the east.     The increasingly demoralised Parliamentarian infantry fell back towards Fowey in pouring rain. They were forced to abandon several guns which became bogged down in the muddy roads. On 1 September, the pursuing Royalists captured ": null
    },
    {
        "Castle Dore": "castle dore"
    },
    {
        ", another ruined fortification which the Parliamentarians were using to anchor their lines. Essex left Sir ": null
    },
    {
        "Philip Skippon": "philip skippon"
    },
    {
        ", his Sergeant Major General of Foot, in command while he himself escaped to Plymouth in a fishing boat.     On 2 September, Skippon, having been told that his infantry were unable to break out as the cavalry had done, and having been offered generous terms by the King, surrendered 6,000 infantry and all his armys guns and train.       The disarmed soldiers marched eastward to Portsmouth in continuing bad weather, being continually robbed and threatened by local people. About 1,000 died of exposure and hunger, and 1,000 more deserted or fell sick.     Charles meanwhile wheeled about and marched towards London.     This setback for Parliament in ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        ", and the last major victory for the Royalists, was reversed by ": null
    },
    {
        "Sir Thomas Fairfax": "sir thomas fairfax"
    },
    {
        " leading the ": null
    },
    {
        "New Model Army": "new model army"
    },
    {
        " at or near ": null
    },
    {
        "Tresillian Bridge": "tresillian"
    },
    {
        ", close to ": null
    },
    {
        "Truro": "truro"
    }
]