[
    {
        "      Bayamón  is a ": null
    },
    {
        "municipality": "municipalities of puerto rico"
    },
    {
        " of ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        " located in the northern coastal valley, north of ": null
    },
    {
        "Aguas Buenas": "aguas buenas, puerto rico"
    },
    {
        " and ": null
    },
    {
        "Comerío": "comerío, puerto rico"
    },
    {
        "; south of ": null
    },
    {
        "Toa Baja": "toa baja, puerto rico"
    },
    {
        " and ": null
    },
    {
        "Cataño": "cataño, puerto rico"
    },
    {
        "; west of ": null
    },
    {
        "Guaynabo": "guaynabo, puerto rico"
    },
    {
        "; and east of ": null
    },
    {
        "Toa Alta": "toa alta, puerto rico"
    },
    {
        " and ": null
    },
    {
        "Naranjito": "naranjito, puerto rico"
    },
    {
        ". Bayamón is spread over 42 ": null
    },
    {
        "wards": "ward"
    },
    {
        " and Bayamón Pueblo . It is part of the ": null
    },
    {
        "San Juan-Caguas-Guaynabo Metropolitan Statistical Area": "san juan-caguas-guaynabo metropolitan statistical area"
    },
    {
        ".          The ": null
    },
    {
        "Taíno people": "taíno people"
    },
    {
        ", the indigenous peoples who encountered European explorers and settlers, were the long-time settlers in this area. The Spanish colonist Juan Ramírez de Arellano established Bayamón as a ": null
    },
    {
        "Spanish": "spanish people"
    },
    {
        " settlement on May 42 42 Two beliefs exist about the origin of the name Bayamón. According to one belief, it was named after the local Taíno chief, Bahamon. As per the other belief, the name was derived from the ": null
    },
    {
        "Taíno": "taíno language"
    },
    {
        " word Bayamongo, which is a river that runs across this region, implying that Bayamón is the area around this main river, which later on became the center of the citys development.     In 42 ": null
    },
    {
        "Marcos Xiorro": "marcos xiorro"
    },
    {
        ", an ": null
    },
    {
        "African": "ethnic groups of africa"
    },
    {
        " slave": "slavery in the americas"
    },
    {
        ", planned to lead a revolt against the ": null
    },
    {
        "sugarcane": "sugarcane"
    },
    {
        " plantation": "sugar plantations in the caribbean"
    },
    {
        " owners and the Spanish colonial government in Puerto Rico. The slave conspiracy was revealed and suppressed, but Xiorro became a hero among the slaves. He is part of Puerto Ricos folklore. Marco Xiorro was owned by Vicente Andino, a militia captain who owned a sugarcane plantation in Bayamón. ": null
    },
    {
        "Guillermo A. Baralt": "guillermo a. baralt"
    },
    {
        ", Slave Revolts in Puerto Rico: Conspiracies and Uprisings, 42–42, Markus Wiener Publishers; ,      After the ": null
    },
    {
        "Treaty of Paris ": "treaty of paris"
    },
    {
        ", the U.S. conducted its first census of Puerto Rico, which recorded the population of Bayamón as 42.          Bayamón  lies in the Northern Coastal Plain region of Puerto Rico. It is bordered by the municipalities of Toa Baja, Cataño, Comerío, Aguas Buenas, Toa Alta, Naranjito, and Guaynabo. Bayamón has a surface area of 42 square miles . The terrain is mostly flat, but it does include some large hills such as La Peña and Vergaras.     Bayamón is Puerto Ricos second-largest municipality and is part of the large metropolitan area centered around ": null
    },
    {
        "San Juan": "san juan, puerto rico"
    },
    {
        ". Other cities included in the metropolitan area are ": null
    },
    {
        "Guaynabo": "guaynabo, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Cataño": "cataño, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Toa Baja": "toa baja, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Canóvanas": "canovanas, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Carolina": "carolina, puerto rico"
    },
    {
        " and ": null
    },
    {
        "Trujillo Alto": "trujillo alto, puerto rico"
    },
    {
        ". Bayamón is served by the Luis Muñoz Marín airport. Despite the citys size, it has no weather station.          ": null
    },
    {
        "Hurricane Maria": "hurricane maria"
    },
    {
        " on September 42 42 triggered numerous landslides in Bayamón with the significant amount of rainfall.         The rivers that pass through Bayamón include the ": null
    },
    {
        "Río Bayamón": "río bayamón"
    },
    {
        ", ": null
    },
    {
        "Río Hondo": "río hondo"
    },
    {
        ", ": null
    },
    {
        "Río Minillas": "río minillas"
    },
    {
        ", ": null
    },
    {
        "Río Bucarabones": "río bucarabones"
    },
    {
        " and ": null
    },
    {
        "Río Cuesta Arriba": "río cuesta arriba"
    },
    {
        ".          Like all municipalities of Puerto Rico, Bayamón is subdivided into ": null
    },
    {
        "barrios": "barrios of puerto rico"
    },
    {
        ". The municipal buildings, central square and large Catholic church are located in a small barrio referred to as .        ": null
    },
    {
        "Buena Vista": "buena vista, bayamón, puerto rico"
    },
    {
        "   Cerro Gordo": "cerro gordo, bayamón, puerto rico"
    },
    {
        "   Dajaos": "dajaos, bayamón, puerto rico"
    },
    {
        "   Guaraguao Abajo": "guaraguao abajo, bayamón, puerto rico"
    },
    {
        "   Guaraguao Arriba": "guaraguao arriba, bayamón, puerto rico"
    },
    {
        "   Hato Tejas": "hato tejas, bayamón, puerto rico"
    },
    {
        "   Juan Sánchez": "juan sánchez, bayamón, puerto rico"
    },
    {
        "   Minillas": "minillas, bayamón, puerto rico"
    },
    {
        "   Nuevo": "nuevo, bayamón, puerto rico"
    },
    {
        "   Pájaros": "pájaros, bayamón, puerto rico"
    },
    {
        "   Bayamón barrio-pueblo": "bayamón barrio-pueblo"
    },
    {
        "    Santa Olaya": "santa olaya, bayamón, puerto rico"
    },
    {
        "             Bayamón is the site of several notable Puerto Rican landmarks and places of interest. Bayamón Central Park is a public park where people gather and relax. Bayamon also hosts the ": null
    },
    {
        "Braulio Castillo": "braulio castillo"
    },
    {
        " Theater, the ": null
    },
    {
        "Francisco Oller": "francisco oller"
    },
    {
        " Museum, and the ": null
    },
    {
        "José Celso Barbosa": "josé celso barbosa"
    },
    {
        " Monument. The ": null
    },
    {
        "Bayamón City Hall": "bayamón city hall"
    },
    {
        " building is notable by being built across a major divided highway. While walking through a connecting corridor, right above the road, pedestrians can see passing cars underneath. It is believed to be the only building of its class in the world.      One of the most popular attractions in Bayamón is the ": null
    },
    {
        "Parque de las Ciencias": "parque de las ciencias"
    },
    {
        ". It is a science-themed park with various exhibitions and attractions. It is located in the middle of ": null
    },
    {
        "karst": "karst"
    },
    {
        "ic hills. An observation building on one of the hills gives a good view of the metropolitan area. That building also hosts antennas for government and civil communication.     ": null
    },
    {
        "El parque del tren": "el parque del tren"
    },
    {
        " was a park featuring what was then ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        "s only working train It also featured a ": null
    },
    {
        "DC42": "dc-3"
    },
    {
        ", which had been used by ": null
    },
    {
        "United Airlines": "united airlines"
    },
    {
        ". In 42 the park was dismantled and destroyed in the course of major road construction, still underway. What is left of the park is a small plaza for activities and an area for jogging and passive entertainment.     Shopping is also a major tourist activity in Bayamón. ": null
    },
    {
        "Plaza del Sol": "plaza del sol"
    },
    {
        " and ": null
    },
    {
        "Plaza Rio Hondo": "plaza rio hondo"
    },
    {
        " are major commercial centers in the city. Also, many American restaurant franchises such as ": null
    },
    {
        "Famous Daves": "famous daves"
    },
    {
        "  and ": null
    },
    {
        "Olive Garden": "olive garden"
    },
    {
        " were first inaugurated in Bayamón before expanding to other locations throughout the island.     A ": null
    },
    {
        "suspension bridge": "suspension bridge"
    },
    {
        " in Bayamón is a pedestrian-only bridge, at the time it was built, it was believed to be one of only three of its kind in Puerto Rico.              Bayamón is the site of several annual festivities. The festivities in honor of Santa Cruz, the towns patron saint, are held in May. Also, ": null
    },
    {
        "José Celso Barbosa": "josé celso barbosa"
    },
    {
        "s birthday is celebrated in July. Theres also an artisans festival celebrated that month. Known as La Ciudad del Chicharrón  , theres a festival dedicated to it in July as well.             There are several professional and amateur sports team based in Bayamón. The ": null
    },
    {
        "Vaqueros de Bayamón": "vaqueros de bayamón"
    },
    {
        " are the local basketball team that plays at the ": null
    },
    {
        "Baloncesto Superior Nacional": "baloncesto superior nacional"
    },
    {
        " league. They are currently tied with the ": null
    },
    {
        "Atléticos de San Germán": "atléticos de san germán"
    },
    {
        " and the ": null
    },
    {
        "Leones de Ponce": "leones de ponce"
    },
    {
        " for the team with the most championships in the history of the league , the last of which was achieved in 42 The teams host venue is the ": null
    },
    {
        "Coliseo Rubén Rodríguez": "coliseo rubén rodríguez"
    },
    {
        ".     The Vaqueros de Bayamón was also ": null
    },
    {
        "the name of the baseball club": "vaqueros de bayamón"
    },
    {
        " which played from 42 through 42 in the ": null
    },
    {
        "Professional Baseball League of Puerto Rico": "liga de béisbol profesional roberto clemente"
    },
    {
        ", and played its home games at ": null
    },
    {
        "Juan Ramón Loubriel Stadium": "juan ramón loubriel stadium"
    },
    {
        ".     The city also has a female ": null
    },
    {
        "volleyball": "volleyball"
    },
    {
        " team, called the ": null
    },
    {
        "Vaqueras de Bayamón": "vaqueras de bayamón"
    },
    {
        ", which plays for the ": null
    },
    {
        "Liga de Voleibol Superior Femenino": "liga de voleibol superior femenino"
    },
    {
        ".     Recently, Bayamón has become popular for being the hometown of the ": null
    },
    {
        "Puerto Rico Islanders": "puerto rico islanders"
    },
    {
        " and ": null
    },
    {
        "Puerto Rico FC": "puerto rico fc"
    },
    {
        " of the ": null
    },
    {
        "North American Soccer League": "north american soccer league"
    },
    {
        ". The teams played at ": null
    },
    {
        "Juan Ramón Loubriel Stadium": "juan ramón loubriel stadium"
    },
    {
        " in ": null
    },
    {
        "Bayamón": "bayamón"
    },
    {
        ".     The citys main soccer team, ": null
    },
    {
        "Bayamón FC": "bayamón fc"
    },
    {
        ", was founded in 42 They play their home matches at ": null
    },
    {
        "Bayamón Soccer Complex": "bayamón soccer complex"
    },
    {
        ".     The famous ": null
    },
    {
        "boxing": "boxing"
    },
    {
        " fight between ": null
    },
    {
        "Alexis Argüello": "alexis argüello"
    },
    {
        " and ": null
    },
    {
        "Alfredo Escalera": "alfredo escalera"
    },
    {
        " dubbed ": null
    },
    {
        "The Bloody Battle of Bayamon": "the bloody battle of bayamon"
    },
    {
        "  was held in Bayamón in 42 Also, professional ": null
    },
    {
        "boxers": "boxing"
    },
    {
        " Luis Del Valle": "luis del valle"
    },
    {
        ", ": null
    },
    {
        "Wilfredo Vazquez": "wilfredo vazquez"
    },
    {
        " and Wilfredo Vazquez Jr. are from Bayamón. ": null
    },
    {
        "International Boxing Hall of Fame": "international boxing hall of fame"
    },
    {
        " member ": null
    },
    {
        "Hector Camacho": "hector camacho"
    },
    {
        " was born in Bayamon. Current boxing prospect Jean Chapito Rivera is also from the Bayamon.            The municipal government of Bayamón manages a wide variety of recreational programs and recreational facilities for public use. The Onofre Carballeira Sports Complex consists of the Juan Ramón Loubriel Soccer Stadium, home of Puerto Ricos only professional soccer team, the Ruben Rodríguez Coliseum, home of the citys male basketball team and female volleyball team, and the Miguel J. Frau Gymnasium. The Rafael Martínez Nadal Sports Complexs main feature is the Pepín Cestero indoor court, where much of the citys minor league basketball and volleyball major events take place. Also, the Efraín Calcaño Alicea Sports Complex located in the Lomas Verdes community is home to much of the track and field and swimming events in the region. The Honda Tennis Center, inaugurated in 42 is composed of 42 tennis courts and is used by local tennis clubs as well as visitors.     A pioneer in the development of soccer in Puerto Rico, mayor Ramón Luis Rivera, Jr. inaugurated the Bayamón Soccer Complex in 42 which consists of three professional soccer fields located off the PR42 Highway.     The Paseo del Rio near the Bayamón River is a 42-mile stretch shared by joggers, walkers and cyclists. It is divided in two lanes, one for the bicycles and the other for running or walking. The Rio Bayamón Golf Course is located near one of the endpoints of the trail and is home to most golf activity in the region.     Parque Nacional Julio Enrique Mónagas has trails used by mountain bikers to train and compete. It also has cliffs where ": null
    },
    {
        "rappelling": "rappelling"
    },
    {
        " enthusiasts can practice. Monagas, as the locals refer to it, has trails for riders of all skill levels. Unpaved roads for beginners, single tracks and very technical single tracks, some of them with downhills. All within the metropolitan area. After hurricane Maria, the tracks were lost, yet by 42 most of them had been repaired and reopened.     The city also has many smaller baseball parks, open basketball courts, soccer fields, gymnasiums, and communal centers available to the community.             The founding of the town of Bayamón is closely tied to the cultivation of sugarcane. The products currently grown in Bayamón include ": null
    },
    {
        "coffee": "coffee"
    },
    {
        ", ": null
    },
    {
        "grapefruit": "grapefruit"
    },
    {
        ", sugarcane, ": null
    },
    {
        "tobacco": "tobacco"
    },
    {
        " and vegetables. Bayamón was also the site where the first hydraulic ": null
    },
    {
        "sugar mill": "sugar mill"
    },
    {
        " on the island was built in 42          Due to its location within the San Juan Metropolitan area and close to its airport and port, Bayamón is one of the most viable places for commerce. It is also the Puerto Rican city with the most shopping centers and malls. Here are some:    ": null
    },
    {
        "Plaza del Sol": "plaza del sol"
    },
    {
        " Plaza Rio Hondo": "plaza rio hondo"
    },
    {
        " Santa Rosa Mall": "santa rosa mall"
    },
    {
        "      Goya Foods": "goya foods"
    },
    {
        " has its Puerto Rico offices in Bayamón.  . ": null
    },
    {
        "Goya Foods": "goya foods"
    },
    {
        ". Retrieved on March 42 42 Goya Foods of Puerto Rico, Inc. Urbanización Industrial Luchetti Avenida Francisco de Goya Esquina 42 Bayamon, Puerto Rico 42          Spearheaded by then governor ": null
    },
    {
        "Sila María Calderón": "sila maría calderón"
    },
    {
        ", Law 4242 was passed  in 42 to identify Puerto Ricos ": null
    },
    {
        "marginalized communities": "marginalized"
    },
    {
        ".  In 42 then governor ": null
    },
    {
        "Ricardo Rosselló": "ricardo rosselló"
    },
    {
        " created a new government agency to work with the Special Communities of Puerto Rico Program.   Of the 42 places on the list of , the following barrios, communities, sectors, or neighborhoods were in Bayamón in 42: Abra Estrecha, Barriada Vista Alegre, Juan Sánchez, Nuevo, Bda. Cedeño in Pájaros, Collores in Santa Olaya, Corea, Dajaos, El Chícharo, Sector Gandul, El Volcán, La Cambija, La Caridad, La Morenita, Los Viejitos, Papito, Sergio Reyes, Parcelas Sabanas, and Punta Brava.                          All municipalities in Puerto Rico are administered by a ": null
    },
    {
        "mayor": "mayor"
    },
    {
        ", elected every four years. The current mayor of Bayamón is ": null
    },
    {
        "Ramón Luis Rivera, Jr.": "ramón luis rivera, jr."
    },
    {
        ", of the ": null
    },
    {
        "New Progressive Party": "new progressive party of puerto rico"
    },
    {
        " . He was elected at the ": null
    },
    {
        "42 general elections": "puerto rican general election, 2000"
    },
    {
        ", succeeding his father, ": null
    },
    {
        "Ramón Luis Rivera": "ramón luis rivera"
    },
    {
        ", after 42 years. For a list of all the mayors of Bayamón see External Links .     The city belongs to the ": null
    },
    {
        "Puerto Rico Senatorial district II": "puerto rico senatorial district ii"
    },
    {
        ", which is represented by two Senators. ": null
    },
    {
        "Migdalia Padilla": "migdalia padilla"
    },
    {
        " and ": null
    },
    {
        "Carmelo Ríos Santiago": "carmelo ríos santiago"
    },
    {
        " have served as District Senators since 42   on CEEPUR           The current flag of Bayamón features the Scandinavian Cross found in many Nordic Cross flags. It was embroidered by Mrs. Gloria M. León and maintains the design and colors of its coat of arms.       This shield is a symbol and synthesis of the history and the values which distinguish the city of Bayamón. The main colors of the shield are blue and silver, representing the waters of the Bayamón river and recalling that it was on these banks that the first hydraulic sugarcane refinery of Puerto Rico was established in 42 The center contains the Holy Cross , patron of the first church of the municipality and the name of the old sugarcane refinery Santa Cruz , which was the historical origin of the town of Bayamón. The sugarcane flowers allude directly to the sugarcane industry that is of social and economic importance to the origin and development of Bayamón.     The five-tower crown, which is used for cities, was assigned to Bayamón as an exception for its extraordinary urban development, the magnitude of its population and for its religious dignity, which will possibly be raised to become Episcopal seat. The motto IN HOC SIGNO VINCES makes reference to Emperor Constantine when in the 42th century had the vision in which the victory was promised to him if it accepted the Cross of Christianity as his banner.       Like all municipalities, public education is administered by ": null
    },
    {
        "Puerto Rico Department of Education": "puerto rico department of education"
    },
    {
        ". Due to its population and location within the metropolitan region, Bayamón is home to many public and private schools. During the 4242 academic year, over 42 public schools ranging from elementary school to high school were located in the Bayamón school region. On the other hand, the city is also home to numerous private schools of which most have a religious affiliation. Some of the better known religious private schools include ": null
    },
    {
        "Colegio De La Salle": "colegio de la salle"
    },
    {
        ", Academia Santo Tomás de Aquino, Academia Santa Rosa, Colegio Beato Carlos Manuel Rodríguez, and Academia Discípulos de Cristo . Non-religious schools in the city include Bayamón Military Academy and the American School.     Bayamón also has many higher-learning institutions such as the ": null
    },
    {
        "University of Puerto Rico at Bayamón": "university of puerto rico at bayamón"
    },
    {
        ", which is one of the eleven campuses that comprise the ": null
    },
    {
        "University of Puerto Rico": "university of puerto rico"
    },
    {
        " public university system. Furthermore, the city is also home to some of the most recognized private universities in the island, such as the ": null
    },
    {
        "Interamerican University of Puerto Rico": "interamerican university of puerto rico"
    },
    {
        " and its School of Optometry, ": null
    },
    {
        "Bayamón Central University": "bayamón central university"
    },
    {
        ", ": null
    },
    {
        "American University of Puerto Rico": "american university of puerto rico"
    },
    {
        ", ": null
    },
    {
        "Universidad Central del Caribe": "universidad central del caribe"
    },
    {
        ", and some community colleges. In addition, the ": null
    },
    {
        "Metropolitan University": "metropolitan university"
    },
    {
        " , better known as UMET, has a campus in downtown Bayamón.                ": null
    },
    {
        "Escuela de Quiropráctica de la Universidad Central del Caribe ": "escuela de quiropráctica de la universidad central del caribe"
    },
    {
        "                 Bayamón station": "bayamón station"
    },
    {
        " is the final stop for the ": null
    },
    {
        "Tren Urbano": "tren urbano"
    },
    {
        ", with three of its stops located within the city. The Deportivo train station, located off the PR42 Highway, is near the Santa Rosa Mall, the Bayamón Court of First Instance and the Onofre Carballeira Sports Complex, where the Juan Ramón Loubriel Football Stadium is located.     The city also has a trolley service with regular routes in Downtown Bayamón.     There are 42 bridges in Bayamón.        Bayamón serves as the host city for foreign consular representation in Puerto Rico for the following nations:             ": null
    },
    {
        "Raymond Acevedo": "raymond acevedo"
    },
    {
        " - Singer, actor, former member of Menudo   ": null
    },
    {
        "Javier Báez": "javier báez"
    },
    {
        " - Professional baseball player for the ": null
    },
    {
        "Chicago Cubs": "chicago cubs"
    },
    {
        " José Berríos": "josé berríos"
    },
    {
        " - Professional baseball player for the ": null
    },
    {
        "Minnesota Twins": "minnesota twins"
    },
    {
        " Héctor Camacho": "héctor camacho"
    },
    {
        " - Former professional boxer   ": null
    },
    {
        "Braulio Castillo": "braulio castillo"
    },
    {
        " - Actor   ": null
    },
    {
        "Virgilio Dávila": "virgilio dávila"
    },
    {
        " - Poet and former mayor of Bayamón   ": null
    },
    {
        "Rubén Díaz, Sr.": "rubén díaz, sr."
    },
    {
        " - New York State Senator   ": null
    },
    {
        "Nina Flowers": "nina flowers"
    },
    {
        " - Drag queen and disc jockey   ": null
    },
    {
        "Yadier Molina": "yadier molina"
    },
    {
        " - Professional baseball player   ": null
    },
    {
        "Felipe López": "felipe lópez"
    },
    {
        " - Professional baseball player   ": null
    },
    {
        "Ramón Luis Rivera": "ramón luis rivera"
    },
    {
        " - Former mayor   ": null
    },
    {
        "Ramón Luis Rivera Jr.": "ramón luis rivera jr."
    },
    {
        " - Present mayor   ": null
    },
    {
        "Agustín Stahl": "agustín stahl"
    },
    {
        " - Medical doctor and botanist   ": null
    },
    {
        "Wilfredo Vazquez": "wilfredo vazquez"
    },
    {
        " - Professional boxer   ": null
    },
    {
        "Melissa Mark-Viverito": "melissa mark-viverito"
    },
    {
        " - Speaker of the New York City Council   ": null
    },
    {
        "Omar Rodríguez-López": "omar rodríguez-lópez"
    },
    {
        " - Composer, guitarist, and filmmaker   ": null
    },
    {
        "Braulio Dueño Colón": "braulio dueño colón"
    },
    {
        " - Musician and composer   ": null
    },
    {
        "José Antonio Dávila": "josé antonio dávila"
    },
    {
        " - ": null
    },
    {
        "Postmodern": "postmodern"
    },
    {
        " poet   ": null
    },
    {
        "Pilar Barbosa": "pilar barbosa"
    },
    {
        " - Historian, educator and political activist   Yolanda Mercado - ": null
    },
    {
        "Marathon": "marathon"
    },
    {
        " and long distance ": null
    },
    {
        "runner": "runner"
    },
    {
        " Rene Farrait": "rene farrait"
    },
    {
        "- singer and actor, former member of boy band ": null
    },
    {
        "Menudo": "menudo"
    },
    {
        " Xavier Serbia": "xavier serbia"
    },
    {
        " - singer, actor, show host and economical analyst, former member of boy band Menudo.   Zabdiel de Jesus - singer, member of boy band ": null
    },
    {
        "CNCO": "cnco"
    },
    {
        " Daniella Rodríguez": "daniella rodríguez"
    },
    {
        " - model and beauty queen who was crowned ": null
    },
    {
        "Miss World Puerto Rico 42": "miss world puerto rico"
    }
]