[
    {
        "           Beatles for Sale is the fourth studio album by the English rock band ": null
    },
    {
        "the Beatles": "the beatles"
    },
    {
        ". It was released on 42 December 42 in the United Kingdom on ": null
    },
    {
        "EMI": "emi"
    },
    {
        "s ": null
    },
    {
        "Parlophone": "parlophone"
    },
    {
        " label. The album marked a departure from the upbeat tone that had characterised the Beatles previous work, partly due to the bands exhaustion after a series of tours that had established them as a worldwide phenomenon in 42 Beatles for Sale was not released in the US until 42 when the Beatles catalogue was standardised for release on CD. Instead, eight of the albums fourteen tracks appeared on ": null
    },
    {
        "Capitol Records": "capitol records"
    },
    {
        " concurrent release,  Beatles 42 , issued in North America only.     The Beatles recorded the album at ": null
    },
    {
        "EMI Studios": "abbey road studios"
    },
    {
        " in London in between their touring and radio engagements. The songs introduced darker musical moods and more introspective lyrics, with ": null
    },
    {
        "John Lennon": "john lennon"
    },
    {
        " adopting an autobiographical perspective in compositions such as ": null
    },
    {
        "Im a Loser": "im a loser"
    },
    {
        " and ": null
    },
    {
        "No Reply": "no reply"
    },
    {
        " . The album also reflected the twin influences of ": null
    },
    {
        "country music": "country music"
    },
    {
        " and ": null
    },
    {
        "Bob Dylan": "bob dylan"
    },
    {
        ", whom the Beatles met in New York in August 42 Partly as a result of the groups hectic schedule, only eight of the tracks are original compositions, with cover versions of songs by artists such as ": null
    },
    {
        "Carl Perkins": "carl perkins"
    },
    {
        ", ": null
    },
    {
        "Chuck Berry": "chuck berry"
    },
    {
        ", ": null
    },
    {
        "Buddy Holly": "buddy holly"
    },
    {
        " and ": null
    },
    {
        "Little Richard": "little richard"
    },
    {
        " being used to complete the album. The sessions also produced a non-album single, ": null
    },
    {
        "I Feel Fine": "i feel fine"
    },
    {
        " backed by ": null
    },
    {
        "Shes a Woman": "shes a woman"
    },
    {
        " .     Beatles for Sale received favourable reviews in the UK musical press, where it held the number one spot for 42 of the 42 weeks that it spent in the top 42 The album was similarly successful in Australia, where the bands cover of Berrys ": null
    },
    {
        "Rock and Roll Music": "rock and roll music"
    },
    {
        " also topped the singles chart. One of the songs omitted from the US version of the album, ": null
    },
    {
        "Eight Days a Week": "eight days a week"
    },
    {
        " , became the Beatles seventh number one in the US when issued as a single there in February 42          When Beatles for Sale was being recorded, ": null
    },
    {
        "Beatlemania": "beatlemania"
    },
    {
        " was at its peak. In early 42 the Beatles had made waves with their television appearances in the US, sparking unprecedented demand for their records there. Over June and July, the band played concerts in Denmark, the Netherlands and Hong Kong, toured Australia and New Zealand, and then returned to Britain for a series of radio and television engagements and to promote their first feature film,  A Hard Days Night . After performing further concerts in Sweden, they began recording the new album in London in mid August, only to then depart for a month-long tour of North America. While in New York, the Beatles met American ": null
    },
    {
        "folk": "folk music"
    },
    {
        " singer ": null
    },
    {
        "Bob Dylan": "bob dylan"
    },
    {
        ", who introduced the band members to ": null
    },
    {
        "cannabis": "cannabis"
    },
    {
        ". Through Dylans example, the Beatles, particularly ": null
    },
    {
        "John Lennon": "john lennon"
    },
    {
        ", were encouraged to write more introspective lyrics than before. For his part, Dylan said he recognised that the Beatles were pointing the direction that music had to go , and he soon began writing songs that embraced youth culture and recording with a rock backing.     Beatles for Sale was the Beatles fourth album release in the space of 42 months. ": null
    },
    {
        "Neil Aspinall": "neil aspinall"
    },
    {
        ", the bands road manager, later reflected: No band today would come off a long US tour at the end of September, go into the studio and start a new album, still writing songs, and then go on a UK tour, finish the album in five weeks, still touring, and have the album out in time for Christmas. But thats what the Beatles did at the end of 42 A lot of it was down to naiveté, thinking that this was the way things were done. If the record company needs another album, you go and make one.  Noting the subdued and melancholy tone of much of the album, producer ": null
    },
    {
        "George Martin": "george martin"
    },
    {
        " recalled: They were rather war weary during Beatles for Sale. One must remember that theyd been battered like mad throughout 42 and much of 42 Success is a wonderful thing but it is very, very tiring.        Although prolific, the ": null
    },
    {
        "songwriting partnership": "lennon–mccartney"
    },
    {
        " of Lennon and ": null
    },
    {
        "Paul McCartney": "paul mccartney"
    },
    {
        " was unable to keep up with the demand for new material. To make up for the shortfall in output, the Beatles resorted to including several cover versions on the album. This had been their approach for their first two albums –  Please Please Me  and  With the Beatles  – but had been abandoned for  A Hard Days Night . McCartney said of the combination on Beatles for Sale: Basically it was our stage show, with some new songs.      The album features eight Lennon–McCartney compositions. In addition, the pair wrote both sides of the non-album single, ": null
    },
    {
        "I Feel Fine": "i feel fine"
    },
    {
        " backed with ": null
    },
    {
        "Shes a Woman": "shes a woman"
    },
    {
        " , which accompanied the LPs release. At this stage in their partnership, Lennon and McCartney rarely wrote together as before, but each would often contribute key parts to songs for which the other was the primary author. Nevertheless, Lennons level of contribution to Beatles for Sale outweighed McCartneys, a situation that, as on A Hard Days Night, author ": null
    },
    {
        "Ian MacDonald": "ian macdonald"
    },
    {
        " attributes to McCartneys commitment being temporarily sidetracked by his relationship with English actress ": null
    },
    {
        "Jane Asher": "jane asher"
    },
    {
        ".     At the time, Lennon said of the album: You could call our new one a Beatles ": null
    },
    {
        "country and western": "country and western"
    },
    {
        " LP.  Music critic ": null
    },
    {
        "Tim Riley": "tim riley"
    },
    {
        " views the album as a country excursion , while MacDonald describes it as being dominated by the idiom . The impetus for this new direction came partly from the bands exposure to US country radio stations while on tour;  in addition, it was a genre that ": null
    },
    {
        "Ringo Starr": "ringo starr"
    },
    {
        " had long championed. Lennons ": null
    },
    {
        "I Dont Want to Spoil the Party": "i dont want to spoil the party"
    },
    {
        " was an early example of ": null
    },
    {
        "country rock": "country rock"
    },
    {
        ", anticipating ": null
    },
    {
        "the Byrds": "the byrds"
    },
    {
        " work in that style. ": null
    },
    {
        "Im a Loser": "im a loser"
    },
    {
        " was the first Beatles song to directly reflect Dylans influence and served as a precursor to the ": null
    },
    {
        "folk-rock": "folk rock"
    },
    {
        " explosion of 42  Author Jonathan Gould highlights the influence of ": null
    },
    {
        "blues": "blues"
    },
    {
        " and country-derived ": null
    },
    {
        "rockabilly": "rockabilly"
    },
    {
        " on the albums original compositions and in the inclusion of songs by ": null
    },
    {
        "Carl Perkins": "carl perkins"
    },
    {
        " and ": null
    },
    {
        "Buddy Holly": "buddy holly"
    },
    {
        ". He also comments that Dylans acoustic folk sound was a style that the Beatles tended to identify as country music.     McCartney later said that Beatles for Sale inaugurated a more mature phase for the band, whereby: We got more and more free to get into ourselves. Our student selves rather than we must please the girls and make money …  According to author ": null
    },
    {
        "Peter Doggett": "peter doggett"
    },
    {
        ", this period coincided with Lennon and McCartney being feted by London society, from which the pair found inspiration among a network of non-mainstream writers, poets, comedians, film-makers and other arts-related individuals. Doggett says that their social milieu in 42 represented new territory for pop and a challenge to British class delineation as the Beatles introduced an arty middle-class sensibility to pop music.       The sessions for Beatles for Sale began at ": null
    },
    {
        "EMI Studios": "abbey road studios"
    },
    {
        " on 42 August, one month after the release of A Hard Days Night. The majority of the recording sessions took place during a three-week period beginning on 42 September, following the bands return from the US tour. Much of the production was done on days off from performances in the UK, and much of the songwriting was completed in the studio.     ": null
    },
    {
        "George Harrison": "george harrison"
    },
    {
        " recalled that the band had become more sophisticated about recording techniques: Our records were progressing. Wed started out like anyone spending their first time in a studio – nervous and naive and looking for success. By this time wed had loads of hits and were becoming more relaxed with ourselves, and more comfortable in the studio  …  The band continued to develop their sound through the use of ": null
    },
    {
        "four-track recording": "multitrack recording"
    },
    {
        ", which EMI had introduced in 42 They were also allowed greater freedom to experiment by the record company and by George Martin, who was gradually relinquishing his position of authority over the Beatles, as their label boss, throughout 42 and was increasingly open to their non-standard musical ideas. The sessions resulted in the first use of a ": null
    },
    {
        "fade-in": "fade"
    },
    {
        " on a pop song, at the start of ": null
    },
    {
        "Eight Days a Week": "eight days a week"
    },
    {
        " , and the first time that guitar ": null
    },
    {
        "feedback": "audio feedback"
    },
    {
        " had been incorporated in a pop recording, on I Feel Fine .      The band introduced new instrumentation into their basic sound, as a way to illustrate the more nuanced style adopted by Lennon in his lyric writing. This was especially evident in the range of percussion instruments, which, mainly played by Starr, included the bands first use of ": null
    },
    {
        "timpani": "timpani"
    },
    {
        ", African hand drums and ": null
    },
    {
        "chocalho": "chocalho"
    },
    {
        ". According to MacDonald, the Beatles adopted a less-is-more approach in their arrangements; he cites ": null
    },
    {
        "No Reply": "no reply"
    },
    {
        " as an example of the group beginning to master the studio , whereby doubling basic parts and the use of ": null
    },
    {
        "reverb": "reverberation"
    },
    {
        " lent the performance depth and space . As he had done since With the Beatles, Harrison continued to vary his guitar sounds, favouring a ": null
    },
    {
        "Gretsch": "gretsch"
    },
    {
        " Tennessean guitar for the first time, in addition to using his twelve-string ": null
    },
    {
        "Rickenbacker 42/42": "rickenbacker 360/12"
    },
    {
        ". Author André Millard describes this period as one in which the recording studio changed its identity from the Beatles perspective, from a formal workplace into a workshop and laboratory .     Recording was completed on 42 October, partway through the bands four-week tour of the UK. On 42 October, the Beatles had rushed back to London from Hull, to record the A-side of their forthcoming single, I Feel Fine , and three of the albums cover tunes . The band participated in several mixing and editing sessions before completing the project on 42 November.             According to Lennon in 42 Beatles music publisher ": null
    },
    {
        "Dick James": "dick james"
    },
    {
        " was complimentary about No Reply , saying that Lennon had provided a complete story whereas before that, he thought my songs wandered off.  Reviewer ": null
    },
    {
        "David Rowley": "david rowley"
    },
    {
        " said that its lyrics read like a picture story from a girls comic and evoked a picture of walking down a street and seeing a girl silhouetted in a window, not answering the telephone . Sequenced as the first track on Beatles for Sale, the song served as an uncharacteristic album opener, given its dramatic and resentful mood.     MacDonald recognises the effectiveness of the acoustic guitar backing and the treatment given to Martins piano part, which is rendered as a darkly reverbed presence rather than a distinct instrument. Over this foundation, he continues, the vocals on the song are massively haloed in echo , contributing to a middle-sixteen section that increases in intensity and is among the most exciting thirty seconds of all the Beatles recordings.       Music critic ": null
    },
    {
        "Richie Unterberger": "richie unterberger"
    },
    {
        " singles out Im a Loser as one of the very first Beatles compositions with lyrics addressing more serious points than young love . Rowley considered it to be an obvious copy of Bob Dylan , as where Lennon refers to the listener as a friend , Dylan does the same on ": null
    },
    {
        "Blowin in the Wind": "blowin in the wind"
    },
    {
        " . He also said its intention was to openly subvert the simple true love themes of their earlier work . In Rileys view, Im a Loser inaugurates a theme in Lennons writing, in which his songs serve as personal responses to fame .       As the third track on the album, ": null
    },
    {
        "Babys in Black": "babys in black"
    },
    {
        " conveys the same sad and resentful outlook of the two preceding songs. Unterberger views it as a love lament for a grieving girl that was perhaps more morose than any previous Beatles song . It was the first song recorded for the album and features a two-part harmony sung by Lennon and McCartney. McCartney recalled: Babys in Black we did because we liked ": null
    },
    {
        "waltz": "waltz"
    },
    {
        "-time  ... And I think also John and I wanted to do something ": null
    },
    {
        "blues": "blues"
    },
    {
        "y, a bit darker, more grown-up, rather than just straight pop.  Beatles historian ": null
    },
    {
        "Mark Lewisohn": "mark lewisohn"
    },
    {
        " cites the bands dedication to achieving a discordant twanging sound for Harrisons lead guitar part, and Martins objection to the song opening with this sound, as an example of the Beatles breaking free of their producers control for the first time. To achieve the desired swelling effect, Lennon knelt on the studio floor and altered the volume control on Harrisons Gretsch as he played.       ": null
    },
    {
        "Ill Follow the Sun": "ill follow the sun"
    },
    {
        " was a reworking of an old song. McCartney recalled in a 42 interview: I wrote that in my front parlour in Forthlin Road. I was about 42  ... We had this ": null
    },
    {
        "R & B": "rhythm and blues"
    },
    {
        " image in ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", a rock and roll/R & B/hardish image with the leather. So I think songs like Ill Follow the Sun, ballads like that, got pushed back to later.  Author ": null
    },
    {
        "Mark Hertsgaard": "mark hertsgaard"
    },
    {
        " cites its inclusion as a reflection of the shortage of original material available to the band, since McCartney acknowledged that the song wouldnt have been considered good enough for their previous releases. Martin nevertheless later named it as his favourite song on Beatles for Sale. Beatles For Sale mini-documentary, 42 CD re-issue       ": null
    },
    {
        "Eight Days a Week": "eight days a week"
    },
    {
        " marked the first time the Beatles brought a partly formed song into the studio and completed the writing process as they recorded it. Two recording sessions, totalling nearly seven hours, on 42 October were devoted to the song, during which Lennon and McCartney experimented with various techniques before settling on a final structure and arrangement. Each of the first six takes featured a strikingly different approach to the beginning and end sections of the song; the eventual chiming guitar-based introduction was recorded during a different session and edited in later. The songs opening fade-in served as a counterpoint to pop songs that close with a ": null
    },
    {
        "fade out": "fade"
    },
    {
        ".  Hertsgaard writes that the surprise provided by the fade-in was heightened for LP listeners due to the track being sequenced at the start of side two.     Lennon referred to Eight Days a Week in his 42 interview with  Playboy  magazine as lousy . In 42 Lennon recalled that Eight Days a Week might have been made with the goal of being the theme song for the film  Help! : I think we wrote this when we were trying to write ": null
    },
    {
        "the title song for Help!": "help!"
    },
    {
        " because there was at one time the thought of calling the film Eight Arms To Hold You. I think thats the story. Im not sure.        The dark theme of the album was balanced by ": null
    },
    {
        "Every Little Thing": "every little thing"
    },
    {
        " , which Unterberger describes as a celebration of what a wonderful girl the guy has . McCartney said of the song: Every Little Thing, like most of the stuff I did, was my attempt at the next single  ... but it became an album filler rather than the great almighty single. It didnt have quite what was required.  Musicologist ": null
    },
    {
        "Walter Everett": "walter everett"
    },
    {
        " says the chorus incorporation of leaden ": null
    },
    {
        "parallel fifth": "parallel fifth"
    },
    {
        " harmonies, supported by Starrs timpani, was the inspiration for a proto-": null
    },
    {
        "heavy metal": "heavy metal music"
    },
    {
        " version of the song recorded by the English ": null
    },
    {
        "progressive rock": "progressive rock"
    },
    {
        " band ": null
    },
    {
        "Yes": "yes"
    },
    {
        " in 42       Lennons I Dont Want to Spoil the Party returns to the sombre mood established by the opening three tracks. MacDonald considers the performance to be the albums most overt exercise in country-and-western , aided by the tight snare sound, Harrisons rockabilly-style guitar solo, and the despondent minor-third harmony part. MacDonald likens the effect to Im a Loser , in that Lennons confessional tone is again couched in a protective shell of pastiche .       The lyrics of ": null
    },
    {
        "What Youre Doing": "what youre doing"
    },
    {
        " concern McCartneys relationship with Jane Asher and demonstrate an aggrieved tone that was uncharacteristic of his writing. Author Simon Philo identifies the songs combination of musical arrangement, sonic texture and lyrics as an early example of the influence of cannabis on McCartney, who said the drug made him start really thinking for the first time . The recording features a syncopated drum pattern and a jangly Rickenbacker guitar ": null
    },
    {
        "riff": "riff"
    },
    {
        ", as well as an instrumental ": null
    },
    {
        "coda": "coda"
    },
    {
        " that McCartney introduces by playing high up on the neck of his ": null
    },
    {
        "Höfner": "höfner"
    },
    {
        " bass. A satisfactory arrangement proved elusive until the band remade the track on the final day of the Beatles for Sale sessions. While highlighting the studio techniques used to achieve the completed recording, MacDonald considers What Youre Doing to be a possible rival to I Feel Fine as the Beatles first sound experiment . McCartney later dismissed the track as a bit of filler , however, saying, Maybe its a better recording than it is a song  ...       Several of the albums cover versions had been staples of the Beatles live shows in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " and at ": null
    },
    {
        "The Cavern Club": "the cavern club"
    },
    {
        " in Liverpool during the early 42s. These songs included ": null
    },
    {
        "Chuck Berry": "chuck berry"
    },
    {
        "s ": null
    },
    {
        "Rock and Roll Music": "rock and roll music"
    },
    {
        " , sung by Lennon, Buddy Hollys ": null
    },
    {
        "Words of Love": "words of love"
    },
    {
        " , sung by Lennon and McCartney with Harrison, and two by Carl Perkins: ": null
    },
    {
        "Everybodys Trying to Be My Baby": "everybodys trying to be my baby"
    },
    {
        " , sung by Harrison, and ": null
    },
    {
        "Honey Dont": "honey dont"
    },
    {
        " , sung by Starr. ": null
    },
    {
        "Mr. Moonlight": "mr. moonlight"
    },
    {
        " , which was originally recorded by ": null
    },
    {
        "Dr. Feelgood and the Interns": "piano red"
    },
    {
        ", was Lennons beloved obscurity , according to Erlewine, and the subject of a remake towards the end of the Beatles for Sale sessions. A cover of ": null
    },
    {
        "Little Willie John": "little willie john"
    },
    {
        "s ": null
    },
    {
        "Leave My Kitten Alone": "leave my kitten alone"
    },
    {
        " was taped on 42 August, during the same session as the discarded version of Mr. Moonlight , but was omitted from the album.     A medley of ": null
    },
    {
        "Kansas City": "kansas city"
    },
    {
        " and ": null
    },
    {
        "Hey, Hey, Hey, Hey": "hey-hey-hey-hey!"
    },
    {
        " was sequenced as the final song on side one of the LP. In McCartneys description, his performance on the track required a great deal of nerve to just jump up and scream like an idiot ; his efforts were egged on by Lennon, who would go, Come on! You can sing it better than that, man! Come on, come on! Really throw it! The medley was inspired by ": null
    },
    {
        "Little Richard": "little richard"
    },
    {
        ", who similarly combined ": null
    },
    {
        "Leiber and Stoller": "leiber and stoller"
    },
    {
        "s Kansas City with his own composition, Hey, Hey, Hey, Hey!  Riley considers that, although McCartneys presence on Beatles for Sale appears relatively slight next to Lennons, his performance of Kansas City goes some way to readdressing the balance. Hertsgaard says that the irony evident in Harrisons delivery of Everybodys Trying to Be My Baby allows the Beatles to close the album with a not-so-veiled comment on the oddities of living inside Beatlemania .       The downbeat mood of Beatles for Sale was reflected in the album cover, which shows the unsmiling, weary-looking Beatles in an autumn scene in Londons ": null
    },
    {
        "Hyde Park": "hyde park, london"
    },
    {
        ". The cover photograph was taken by ": null
    },
    {
        "Robert Freeman": "robert freeman"
    },
    {
        ", who recalled that the concept was briefly discussed with ": null
    },
    {
        "Brian Epstein": "brian epstein"
    },
    {
        " and the Beatles beforehand, namely that he produce a colour image of the group shot at an outside location towards sunset . Music journalist Lois Wilson describes the result as the very antithesis of the early42s pop star . The cover carried no band logo or artist credit, and the album title was rendered in minuscule type compared with standard LP artwork of the time.     Beatles for Sale was presented in a gatefold sleeve – a rare design feature for a contemporary pop LP and the first of the Beatles UK releases to be packaged in this way. Part of the inner gatefold spread showed the band members in front of a photo montage of celebrities, including film stars ": null
    },
    {
        "Victor Mature": "victor mature"
    },
    {
        ", ": null
    },
    {
        "Jayne Mansfield": "jayne mansfield"
    },
    {
        " and ": null
    },
    {
        "Ian Carmichael": "ian carmichael"
    },
    {
        ", all of whom the Beatles had met during 42 This inner gatefold image anticipated ": null
    },
    {
        "Peter Blake": "peter blake"
    },
    {
        "s revolutionary cover design for the Beatles 42 album  Sgt. Peppers Lonely Hearts Club Band .     According to music journalist ": null
    },
    {
        "Neil Spencer": "neil spencer"
    },
    {
        ", the albums title was an apt comment on the bands unprecedented commercial value as entertainers, given the wealth of Beatles-related merchandise introduced over the previous year. The sleeve notes for Beatles for Sale were written by ": null
    },
    {
        "Derek Taylor": "derek taylor"
    },
    {
        ", who, until a recent falling out with Epstein, had been the bands press officer throughout their rise to international stardom. In his text, Taylor focused on what the Beatles phenomenon would mean to people of the future:               Beatles for Sale was released in the United Kingdom on EMIs ": null
    },
    {
        "Parlophone": "parlophone"
    },
    {
        " label on 42 December 42 On 42 December, it began a 42-week run in the charts, and a week later displaced A Hard Days Night from the top position. After seven weeks at number 42 Beatles for Sale was displaced by ": null
    },
    {
        "the Rolling Stones": "the rolling stones"
    },
    {
        "  The Rolling Stones No. 42  but it returned to the top on 42 February 42 for a week. After being again displaced by The Rolling Stones No. 42, Beatles for Sale overtook it for a second time on 42 May, remaining there for another three weeks.  It was then displaced by  The Freewheelin Bob Dylan , which was superseded a week later by  Bringing It All Back Home , Dylans first electric album. From the start of 42 until mid-May, Beatles for Sale remained in the top three chart positions.  Eight of the albums tracks were later issued on two four-song EPs:  Beatles for Sale  and  Beatles for Sale No. 42 , released in April and June 42 respectively.     The concurrent Beatles release in the United States,  Beatles 42 , included eight songs from Beatles for Sale, omitting the tracks Kansas City/Hey, Hey, Hey, Hey! , Eight Days a Week , What Youre Doing , Words of Love , Every Little Thing and I Dont Want to Spoil the Party . In turn, it added the track Ill Be Back from the British release of A Hard Days Night and the single I Feel Fine / Shes a Woman . The six omitted tracks finally got an LP release in America on  Beatles VI  in 42 Beatles 42 was released eleven days after Beatles for Sale and became the fastest-selling album of the year in the United States.     The cover of the Australian release of the LP featured individual photographs of the Beatles taken at one of the groups Sydney concerts in June 42        On 42 February 42 Beatles for Sale was officially released on compact disc , as were the bands first three albums. The following month, Beatles for Sale re-entered the UK albums charts, peaking at number 42  Having been available previously only as an import in the US, the album was also issued on LP and cassette there on 42 July 42     Even though Beatles for Sale was recorded on four-track tape, the first CD version was available only in mono. The album was digitally remastered and issued on CD in stereo for the first time on 42 September 42         ref name Erlewine/AM /  ref name Pitchfork / ref name McCormick /ref ref name Larkin /ref  ": null
    }
]