[
    {
        "     A bedroom farce or sex farce is a type of light ": null
    },
    {
        "comedy": "comedy"
    },
    {
        ", which centres on the sexual pairings and recombinations of characters as they move through improbable plots and slamming doors. The bedroom farce is perhaps the most common form of ": null
    },
    {
        "farce": "farce"
    },
    {
        ".       The most famous bedroom farceur is probably ": null
    },
    {
        "Georges Feydeau": "georges feydeau"
    },
    {
        ", whose collections of coincidences, slamming doors, and ridiculous dialogue delighted Paris in the 42s and are now considered forerunners to the ": null
    },
    {
        "Theatre of the Absurd": "theatre of the absurd"
    },
    {
        ". The ": null
    },
    {
        "Viennese": "vienna"
    },
    {
        " playwright ": null
    },
    {
        "Arthur Schnitzler": "arthur schnitzler"
    },
    {
        " took bedroom farce to its highest dramatic level in his  La Ronde , which in ten bedroom scenes connect the highest and lowest of Vienna.     Some of the English ": null
    },
    {
        "Aldwych farce": "aldwych farce"
    },
    {
        "s by ": null
    },
    {
        "Ben Travers": "ben travers"
    },
    {
        " which were popular in the 42s and 42s have aspects of bedroom farce , e.g.  A Cuckoo in the Nest  or ": null
    },
    {
        "Rookery Nook": "rookery nook"
    },
    {
        ". However, in each case the sharing of a bedroom or house turns out to have an innocent explanation.     In modern times, ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        "s  A Midsummer Nights Sex Comedy  presents aspects of the bedroom farce. ": null
    },
    {
        "Michael Frayn": "michael frayn"
    },
    {
        "s 42 play  Donkeys Years  is a classic bedroom farce; Frayn parodied the genre in his 42 play  Noises Off  via its play-within-the-play, Nothing On. ": null
    },
    {
        "Alan Ayckbourn": "alan ayckbourn"
    },
    {
        "s play, entitled Bedroom Farce, looks at the lives of three couples seen in their own bedrooms, the stage being split into three sets for this purpose. There is much humour in the play, although few if any of the usual conventions of farce are observed.      Boeing Boeing  is a classic French farce for the stage by ": null
    },
    {
        "Marc Camoletti": "marc camoletti"
    },
    {
        ". Utilizing most of the conventions of bedroom farces canon, it concerns a Parisian bachelor playboy with three international air stewardess fiancées he secretly keeps in careful rotation, until their flight schedules change and he, along with his provincial friend and sassy maid, must keep them from finding out about each other. Luckily they have enough doors in the apartment to keep the girls unwittingly flitting about for two hours.     American three-camera situation comedy, an extension of proscenium stage tradition, often includes elements of farce, specifically in several episodes of  Threes Company , the Woodys Wedding episode of  Cheers , ": null
    },
    {
        "The Ski Lodge": "frasier_ep110"
    },
    {
        " episode of  Frasier , and the ": null
    },
    {
        "Love Car Displacement": "the love car displacement"
    },
    {
        " episode of  The Big Bang Theory .     ": null
    },
    {
        "Brian Rix": "brian rix"
    }
]