[
    {
        "                     Bees are flying ": null
    },
    {
        "insects": "Insect"
    },
    {
        "closely related to ": null
    },
    {
        "wasps": "Wasp"
    },
    {
        "and ": null
    },
    {
        "ant": "Ant"
    },
    {
        "s, known for their role in ": null
    },
    {
        "pollination": "Pollination"
    },
    {
        " and, in the case of the best-known bee species, the ": null
    },
    {
        "western honey bee": "Western Honey Bee"
    },
    {
        ", for producing ": null
    },
    {
        "honey": "Honey"
    },
    {
        " and ": null
    },
    {
        "beeswax": "Beeswax"
    },
    {
        ". Bees are a ": null
    },
    {
        "monophyletic": "Monophyly"
    },
    {
        " lineage within the superfamily ": null
    },
    {
        "Apoidea": "Apoidea"
    },
    {
        " and are presently considered a ": null
    },
    {
        "clade": "Clade"
    },
    {
        ", called Anthophila. There are over 16,000 known species of bees in seven recognized ": null
    },
    {
        "biological families": "Family"
    },
    {
        ".  They are found on every continent except ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        ", in every habitat on the planet that contains insect-pollinated ": null
    },
    {
        "flowering plant": "Flowering Plant"
    },
    {
        "s.     Some species - including ": null
    },
    {
        "honey bee": "Honey Bee"
    },
    {
        "s, ": null
    },
    {
        "bumblebee": "Bumblebee"
    },
    {
        "s, and ": null
    },
    {
        "stingless bees": "Stingless Bee"
    },
    {
        "- live ": null
    },
    {
        "socially": "Eusociality"
    },
    {
        " in colonies. Bees are adapted for feeding on ": null
    },
    {
        "nectar": "Nectar"
    },
    {
        " and ": null
    },
    {
        "pollen": "Pollen"
    },
    {
        ", the former primarily as an energy source and the latter primarily for ": null
    },
    {
        "protein": "Protein"
    },
    {
        " and other nutrients. Most pollen is used as food for ": null
    },
    {
        "larva": "Larva"
    },
    {
        "e. Bee pollination is important both ecologically and ": null
    },
    {
        "commercially": "List Of Crop Plants Pollinated By Bees"
    },
    {
        ". The decline in wild bees has increased the value of pollination by commercially managed hives of honey bees.     Bees range in size from tiny ": null
    },
    {
        "stingless bee": "Stingless Bee"
    },
    {
        " species whose workers are less than  long, to  Megachile pluto , the largest species of ": null
    },
    {
        "leafcutter bee": "Megachilidae"
    },
    {
        ", whose females can attain a length of . The most common bees in the Northern Hemisphere are the ": null
    },
    {
        "Halictidae": "Halictidae"
    },
    {
        ", or sweat bees, but they are small and often mistaken for wasps or flies. Vertebrate predators of bees include birds such as ": null
    },
    {
        "bee-eater": "Bee-Eater"
    },
    {
        "s; insect predators include ": null
    },
    {
        "beewolves": "Beewolf"
    },
    {
        " and ": null
    },
    {
        "dragonflies": "Dragonfly"
    },
    {
        ".     Human ": null
    },
    {
        "beekeeping": "Beekeeping"
    },
    {
        " or apiculture has been practised for millennia, since at least the times of ": null
    },
    {
        "Ancient Egypt": "Ancient Egypt"
    },
    {
        " and ": null
    },
    {
        "Ancient Greece": "Ancient Greece"
    },
    {
        ". Apart from honey and pollination, honey bees produce beeswax, ": null
    },
    {
        "royal jelly": "Royal Jelly"
    },
    {
        " and ": null
    },
    {
        "propolis": "Propolis"
    },
    {
        ". Bees have appeared in mythology and folklore, through all phases of art and literature, from ancient times to the present day, though primarily focused in the ": null
    },
    {
        "Northern Hemisphere": "Northern Hemisphere"
    },
    {
        ", where beekeeping is far more common.     The analysis of 353 wild bee and hoverfly species across Britain from 1980 to 2013 found the insects have been lost from a quarter of the places they inhabited in 1980.             The ancestors of bees were ": null
    },
    {
        "wasps": "Wasp"
    },
    {
        "in the family ": null
    },
    {
        "Crabronidae": "Crabronidae"
    },
    {
        ", which were ": null
    },
    {
        "predators": "Predation"
    },
    {
        " of other insects. The switch from insect prey to pollen may have resulted from the consumption of prey insects which were flower visitors and were partially covered with pollen when they were fed to the wasp larvae. This same ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        "ary scenario may have occurred within the ": null
    },
    {
        "vespoid": "Vespoidea"
    },
    {
        " wasps, where the ": null
    },
    {
        "pollen wasps": "Pollen Wasp"
    },
    {
        "evolved from predatory ancestors. Until recently, the oldest non-compression bee fossil had been found in New Jersey ": null
    },
    {
        "amber": "Amber"
    },
    {
        ", Cretotrigona prisca of ": null
    },
    {
        "Cretaceous age": "Cretaceous"
    },
    {
        ", a ": null
    },
    {
        "corbiculate bee": "Apinae"
    },
    {
        ".  A bee fossil from the ": null
    },
    {
        "early Cretaceous": "Early Cretaceous"
    },
    {
        " ,  Melittosphex burmensis , is considered  an extinct lineage of pollen-collecting Apoidea sister to the modern bees .  Derived features of its morphology  place it clearly within the bees, but it retains two unmodified ancestral traits  of the legs , showing its transitional status. By the ": null
    },
    {
        "Eocene": "Eocene"
    },
    {
        " there was already considerable diversity among eusocial bee lineages.       The highly ": null
    },
    {
        "eusocial": "Eusociality"
    },
    {
        " corbiculate Apidae": "Apinae"
    },
    {
        " appeared roughly 87 Mya, and the ": null
    },
    {
        "Allodapini": "Allodapini"
    },
    {
        " around 53 Mya.    The ": null
    },
    {
        "Colletidae": "Colletidae"
    },
    {
        " appear as fossils only from the late ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        " to early ": null
    },
    {
        "Miocene": "Miocene"
    },
    {
        ".    The ": null
    },
    {
        "Melittidae": "Melittidae"
    },
    {
        " are known from Palaeomacropis eocenicus in the ": null
    },
    {
        "Early Eocene": "Ypresian"
    },
    {
        ".    The ": null
    },
    {
        "Megachilidae": "Megachilidae"
    },
    {
        " are known from trace fossils from the ": null
    },
    {
        "Middle Eocene": "Eocene"
    },
    {
        ".    The ": null
    },
    {
        "Andrenidae": "Andrenidae"
    },
    {
        " are known from the Eocene-Oligocene boundary, around 34 Mya, of the Florissant shale.    The ": null
    },
    {
        "Halictidae": "Halictidae"
    },
    {
        " first appear in the Early Eocene  with species   found in amber. The ": null
    },
    {
        "Stenotritidae": "Stenotritidae"
    },
    {
        " are known from fossil brood cells of ": null
    },
    {
        "Pleistocene": "Pleistocene"
    },
    {
        " age.                The earliest animal-pollinated flowers were shallow, cup-shaped blooms ": null
    },
    {
        "pollinated": "Pollination"
    },
    {
        " by insects such as ": null
    },
    {
        "beetle": "Beetle"
    },
    {
        "s, so the ": null
    },
    {
        "syndrome of insect pollination": "Pollination Syndrome"
    },
    {
        " was well established before the first appearance of bees. The novelty is that bees are ": null
    },
    {
        "specialized": "Specialization In Bees"
    },
    {
        " as pollination agents, with behavioral and physical modifications that specifically enhance pollination, and are the most efficient pollinating insects. In a process of ": null
    },
    {
        "coevolution": "Coevolution"
    },
    {
        ", flowers developed floral rewards  such as ": null
    },
    {
        "nectar": "Nectar"
    },
    {
        " and longer tubes, and bees developed longer tongues to extract the nectar. Bees also developed structures known as ": null
    },
    {
        "scopal hairs": "Scopa"
    },
    {
        " and ": null
    },
    {
        "pollen baskets": "Pollen Baskets"
    },
    {
        " to collect and carry pollen. The location and type differ among and between groups of bees. Most bees have ": null
    },
    {
        "scopal hairs": "Scopa"
    },
    {
        " located on their hind legs or on the underside of their abdomens, some bees in the family Apidae possess ": null
    },
    {
        "pollen baskets": "Pollen Baskets"
    },
    {
        " on their hind legs while very few species lack these entirely and instead collect pollen in their crops.  This drove the ": null
    },
    {
        "adaptive radiation": "Adaptive Radiation"
    },
    {
        " of the ": null
    },
    {
        "angiosperms": "Flowering Plant"
    },
    {
        ", and, in turn, the bees themselves.  Bees have not only coevolved with flowers but it is believed that some bees have coevolved with mites. Some bees provide tufts of hairs called acarinaria that appear to provide lodgings for mites; in return, it is believed that the mites eat fungi that attack pollen, so the relationship in this case may be ": null
    },
    {
        "mutualistc": "Mutualism"
    },
    {
        ".           This ": null
    },
    {
        "phylogenetic tree": "Phylogenetic Tree"
    },
    {
        " is based on Debevic et al, 2012, which used molecular phylogeny to demonstrate that the bees  arose from deep within the Crabronidae, which is therefore ": null
    },
    {
        "paraphyletic": "Paraphyletic"
    },
    {
        ". The placement of the ": null
    },
    {
        "Heterogynaidae": "Heterogynaidae"
    },
    {
        " is uncertain.  The small subfamily ": null
    },
    {
        "Mellininae": "Mellininae"
    },
    {
        " was not included in their analysis.            This cladogram of the bee families is based on Hedtke et al., 2013, which places the former families Dasypodaidae and Meganomiidae as subfamilies inside the Melittidae.    English names, where available, are given in parentheses.                      Bees differ from closely related groups such as wasps by having branched or plume-like ": null
    },
    {
        "setae": "Seta"
    },
    {
        ", combs on the forelimbs for cleaning their antennae, small anatomical differences in the limb structure, and the venation of the hind wings; and in females, by having the seventh dorsal abdominal plate divided into two half-plates.      Bees have the following characteristics:     A pair of large ": null
    },
    {
        "compound eyes": "Compound Eyes"
    },
    {
        " which cover much of the surface of the head. Between and above these are three small simple eyes  which provide information on light intensity.   The ": null
    },
    {
        "antennae": "Antenna"
    },
    {
        " usually have thirteen segments in males and twelve in females, and are ": null
    },
    {
        "geniculate": "Insect Morphologyantennae"
    },
    {
        ", having an elbow joint part way along. They house large numbers of sense organs that can detect touch , smell and taste; and small, hairlike mechanoreceptors that can detect air movement so as to hear sounds.   The ": null
    },
    {
        "mouthparts": "Insect Mouthparts"
    },
    {
        " are adapted for both chewing and sucking by having both a pair of ": null
    },
    {
        "mandibles": "Mandible"
    },
    {
        " and a long ": null
    },
    {
        "proboscis": "Proboscis"
    },
    {
        " for sucking up nectar.    The thorax has three segments, each with a pair of robust legs, and a pair of membranous wings on the hind two segments. The front legs of corbiculate bees bear combs for cleaning the antennae, and in many species the hind legs bear pollen baskets, flattened sections with incurving hairs to secure the collected pollen. The wings are synchronised in flight, and the somewhat smaller hind wings connect to the forewings by a row of hooks along their margin which connect to a groove in the forewing.   The abdomen has nine segments, the hindermost three being modified into the sting.          The worlds largest species of bee is thought to be Wallaces giant bee  Megachile pluto , whose females can attain a length of .  The smallest species may be dwarf stingless bees in the tribe ": null
    },
    {
        "Meliponini": "Meliponini"
    },
    {
        " whose workers are less than  in length.                  According to ": null
    },
    {
        "inclusive fitness": "Inclusive Fitness"
    },
    {
        " theory, organisms can gain fitness not just through increasing their own reproductive output, but also that of close relatives. In evolutionary terms, individuals should help relatives when Cost ": null
    }
]