[
    {
        "      Joseph Benedict Chifley  was an Australian politician who served as the 42th ": null
    },
    {
        "Prime Minister of Australia": "prime minister of australia"
    },
    {
        ", in office from 42 to 42 He was leader of the ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        " from 42 until his death.     Chifley was born in ": null
    },
    {
        "Bathurst, New South Wales": "bathurst, new south wales"
    },
    {
        ". He joined the ": null
    },
    {
        "state railways": "new south wales government railways"
    },
    {
        " after leaving school, eventually qualifying as an ": null
    },
    {
        "engine driver": "engine driver"
    },
    {
        ". He was prominent in the trade union movement before entering politics, and was also a director of  The National Advocate . After several previous unsuccessful candidacies, Chifley was elected to parliament ": null
    },
    {
        "in 42": "1928 australian federal election"
    },
    {
        ". In 42 he was appointed ": null
    },
    {
        "Minister for Defence": "minister for defence"
    },
    {
        " in the government of ": null
    },
    {
        "James Scullin": "james scullin"
    },
    {
        ". He served in cabinet for less than a year before losing his seat at the ": null
    },
    {
        "42 election": "1931 australian federal election"
    },
    {
        ", which saw the government suffer a landslide defeat.     After his electoral defeat, Chifley remained involved in politics as a party official, siding with the federal Labor leadership against the ": null
    },
    {
        "Lang Labor": "lang labor"
    },
    {
        " faction. He served on a ": null
    },
    {
        "royal commission": "royal commission"
    },
    {
        " into the banking system in 42 and in 42 became a senior public servant in the ": null
    },
    {
        "Department of Munitions": "department of munitions"
    },
    {
        ". Chifley was re-elected to parliament later that year, on his third attempt since 42 He was appointed ": null
    },
    {
        "Treasurer": "treasurer of australia"
    },
    {
        " in the new ": null
    },
    {
        "Curtin Government": "curtin government"
    },
    {
        " in 42 as one of the few Labor MPs with previous ministerial experience. The following year Chifley was additionally made ": null
    },
    {
        "Minister for Postwar Reconstruction": "minister for postwar reconstruction"
    },
    {
        ", making him one of the most powerful members of the government. He became prime minister following Curtins death in office in 42 defeating caretaker prime minister ": null
    },
    {
        "Frank Forde": "frank forde"
    },
    {
        " in ": null
    },
    {
        "a leadership ballot": "1945 australian labor party leadership election"
    },
    {
        ".     At the ": null
    },
    {
        "42 election": "1946 australian federal election"
    },
    {
        ", Chifley was re-elected with a slightly reduced majority – the first time that an incumbent Labor government had won re-election. The war ": null
    },
    {
        "had ended": "victory over japan day"
    },
    {
        " a month after he took office, and over the following four years his government embarked on an ambitious program of social reforms and nation-building schemes. These included the expansion of the ": null
    },
    {
        "welfare state": "welfare state"
    },
    {
        ", a ": null
    },
    {
        "large-scale immigration program": "post-war immigration to australia"
    },
    {
        ", and the establishment of the ": null
    },
    {
        "Australian National University": "australian national university"
    },
    {
        ", ": null
    },
    {
        "ASIO": "asio"
    },
    {
        ", and the ": null
    },
    {
        "Snowy Mountains Scheme": "snowy mountains scheme"
    },
    {
        ". Some of the new legislation was successfully challenged in the ": null
    },
    {
        "High Court": "high court of australia"
    },
    {
        ", and as a result ": null
    },
    {
        "the constitution was amended": "australian referendum, 1946"
    },
    {
        " to give the federal government extended powers over social services.     Some of Chifleys more interventionist economic policies were poorly received by Australian business, particularly an attempt to nationalise banks. His government was defeated at the ": null
    },
    {
        "42 election": "1949 australian federal election"
    },
    {
        ", which brought ": null
    },
    {
        "Robert Menzies": "robert menzies"
    },
    {
        " Liberal Party": "liberal party of australia"
    },
    {
        " to power for the first time. He stayed on as ": null
    },
    {
        "Leader of the Opposition": "leader of the opposition"
    },
    {
        " until his death, which came a few months after the ": null
    },
    {
        "42 election": "1951 australian federal election"
    },
    {
        "; Labor did not return to government until 42 For his contributions to post-war prosperity, Chifley is often regarded as one of Australias greatest prime ministers. He is held in particularly high regard by the Labor Party, with in his ": null
    },
    {
        "light on the hill": "the light on the hill"
    },
    {
        " speech seen as seminal in both the history of the party and the broader ": null
    },
    {
        "Australian labour movement": "australian labour movement"
    },
    {
        ".         Joseph Benedict Chifley was born at 42 Havannah Street, ": null
    },
    {
        "Bathurst, New South Wales": "bathurst, new south wales"
    },
    {
        ", on 42 September 42 He was the first of three sons born to Mary Anne and Patrick Chifley II. His father – a blacksmith – was born in Bathurst to Irish immigrants from ": null
    },
    {
        "County Tipperary": "county tipperary"
    },
    {
        ", while his mother was born in ": null
    },
    {
        "County Fermanagh": "county fermanagh"
    },
    {
        ", in present-day ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        ".       At the age of five, Chifley was sent to live with his widowed grandfather, Patrick Chifley I, who had a small farm at ": null
    },
    {
        "Limekilns": "limekilns, new south wales"
    },
    {
        ". An aunt, Mary Bridget Chifley, kept house for them. Chifley began his education at the local state school, which was known as a half-time school due to it being too small to offer daily classes; it shared a single teacher with a neighbouring community. He moved back to his parents home at the age of 42 following his grandfathers death in January 42 and attended a ": null
    },
    {
        "Patrician Brothers": "patrician brothers"
    },
    {
        " school for about two years. He was a voracious reader from a young age, and would later supplement his limited formal education by attending classes at night schools or ": null
    },
    {
        "mechanics institutes": "mechanics institutes"
    },
    {
        ".       After leaving school, Chifleys first job was as a cashiers assistant at a local department store. He later worked at a tannery for a period, and then in September 42 joined the ": null
    },
    {
        "New South Wales Government Railways": "new south wales government railways"
    },
    {
        " as a shop boy at the Bathurst ": null
    },
    {
        "locomotive shed": "locomotive shed"
    },
    {
        ". Over the following decade, he was promoted through the ranks to engine-cleaner and ": null
    },
    {
        "fireman": "fireman"
    },
    {
        ", and then finally in March 42 to ": null
    },
    {
        "engine-driver": "engine-driver"
    },
    {
        ". The position of driver was considered relatively prestigious, and Chifley had to sit various examinations before being certified. He developed an intimate technical understanding of his locomotives, and became a lecturer and instructor at the Bathurst Railway Institute. Chifley drove both goods trains and passenger trains. He was based in Bathurst and worked on the ": null
    },
    {
        "Main Western line": "main western railway line, new south wales"
    },
    {
        ", except for a few months in 42 when he drove on the ": null
    },
    {
        "Main Southern line": "main southern railway line, new south wales"
    },
    {
        " and worked out of ": null
    },
    {
        "Harden": "harden, new south wales"
    },
    {
        ".       Chifley became involved with the ": null
    },
    {
        "labour movement": "australian labour movement"
    },
    {
        " as a member of the Locomotive Enginemens Association. He never held executive office, preferring to work as an ": null
    },
    {
        "organiser": "union organizer"
    },
    {
        ", but did serve as a divisional delegate to state and federal conferences. He developed a reputation for compromise, maintaining good relations with both the railway management and the more militant sections of the union. However, Chifley was one of the local leaders of the ": null
    },
    {
        "42 general strike": "australian general strike, 1917"
    },
    {
        ", and as a result was dismissed from the railway. He and most of the other strikers were eventually reinstated, but lost seniority and related privileges; Chifley was demoted from engine-driver to fireman. Despite repeated lobbying, their pre42 benefits were not restored until 42 After the strike, the state government of ": null
    },
    {
        "William Holman": "william holman"
    },
    {
        " also de-registered their union, placing it at a severe disadvantage against ": null
    },
    {
        "other railway unions": "railway trade unions in australia"
    },
    {
        ". Chifley worked to secure its re-registration, which occurred in 42 and was also involved in the formation of a national union – the ": null
    },
    {
        "Australian Federated Union of Locomotive Enginemen": "australian federated union of locomotive enginemen"
    },
    {
        " – in 42 He appeared as an expert witness before the ": null
    },
    {
        "Commonwealth Arbitration Court": "commonwealth court of conciliation and arbitration"
    },
    {
        " in 42 which subsequently implemented a new federal ": null
    },
    {
        "award": "industrial award"
    },
    {
        " for the enginemen.       Chifley joined the ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        " at a young age, and was involved in state and federal election campaigns as an organiser. In 42 he replaced his father on the board of  The National Advocate , a local newspaper that functioned as the mouthpiece of the labour movement. In 42 and 42 Chifley unsuccessfully contested Labor ": null
    },
    {
        "preselection": "preselection"
    },
    {
        " for the state ": null
    },
    {
        "seat of Bathurst": "electoral district of bathurst"
    },
    {
        ". He was eventually chosen as the Labor candidate for the ": null
    },
    {
        "Division of Macquarie": "division of macquarie"
    },
    {
        " at the ": null
    },
    {
        "42 federal election": "1925 australian federal election"
    },
    {
        ". Macquarie was a large and diverse electorate, covering an area from Bathurst east across the ": null
    },
    {
        "Blue Mountains": "blue mountains"
    },
    {
        " to ": null
    },
    {
        "Penrith": "penrith, new south wales"
    },
    {
        ", on the outskirts of Sydney; it included industrial, agricultural, and mining districts in virtually equal measure. It was one of the most ": null
    },
    {
        "marginal seat": "marginal seat"
    },
    {
        "s in the country, and had last been won by Labor in 42 Lacking name recognition, Chifley lost the election to the incumbent ": null
    },
    {
        "Nationalist": "nationalist party of australia"
    },
    {
        " MP, ": null
    },
    {
        "Arthur Manning": "arthur manning"
    },
    {
        ". However, he reprised his candidacy ": null
    },
    {
        "in 42": "1928 australian federal election"
    },
    {
        ", mounting a campaign that focused on the ": null
    },
    {
        "Bruce Government": "stanley bruce"
    },
    {
        "s unpopular labour policies. He accused the government of endangering the ": null
    },
    {
        "White Australia policy": "white australia policy"
    },
    {
        " by allowing Southern European migrant workers into the country, claiming it had allowed so many dagoes and aliens in Australia that today they are all over the country taking work which rightly belongs to all Australians . The Labor Party recorded a 42-point swing in Macquarie, with Chifley becoming one of three candidates in New South Wales to win seats from the government.          At the ": null
    },
    {
        "42 election": "1929 australian federal election"
    },
    {
        ", Chifley was re-elected on a 42-point swing as Labor won a landslide victory. ": null
    },
    {
        "James Scullin": "james scullin"
    },
    {
        " became the new prime minister, the fourth member of his party to hold the office. As a ": null
    },
    {
        "backbench": "backbench"
    },
    {
        "er with little parliamentary experience, Chifley did not stand for election to the ": null
    },
    {
        "new ministry": "scullin ministry"
    },
    {
        ", but did join the Public Accounts Committee. As the ": null
    },
    {
        "Great Depression": "great depression in australia"
    },
    {
        " worsened, he defended the governments economic response against criticism from two factions within his own party – economic conservatives led by ": null
    },
    {
        "Joseph Lyons": "joseph lyons"
    },
    {
        " and left-wing populists led by ": null
    },
    {
        "Jack Lang": "jack lang"
    },
    {
        ". His loyalty paid off in March 42 when the Labor caucus chose him to fill one of the vacancies in cabinet caused by the resignations of Lyons and ": null
    },
    {
        "James Fenton": "james fenton"
    },
    {
        ". Scullin appointed him ": null
    },
    {
        "Minister for Defence": "minister for defence"
    },
    {
        ", a portfolio that had been disregarded somewhat in the face of more pressing concerns. There was little appetite for policy development, and Chifley instead concentrated on finding savings in his department that could be redirected to unemployment relief. He opened up unused military camps to the homeless, and also distributed surplus military clothing.      Chifley was somewhat reluctant in his support of the ": null
    },
    {
        "Premiers Plan": "premiers plan"
    },
    {
        " of June 42 but believed there was no better alternative and felt bound by the principle of ": null
    },
    {
        "cabinet solidarity": "cabinet solidarity"
    },
    {
        ". His endorsement of the plan, which required cuts to wages and pensions, was received poorly in his own constituency. Many in the local labour movement defected to the ": null
    },
    {
        "Lang Labor": "lang labor"
    },
    {
        " faction, which opposed the plan, and his own union expelled him in August 42 Joseph Lyons reportedly offered Chifley the ": null
    },
    {
        "treasurership": "treasurer of australia"
    },
    {
        " as an inducement to join the ": null
    },
    {
        "United Australia Party": "united australia party"
    },
    {
        " , the new party he had created; Chifley declined and remained a member of the Labor Party.  At the ": null
    },
    {
        "42 election": "1931 australian federal election"
    },
    {
        ", Chifley suffered a negative swing of 42 points in Macquarie, losing his seat to ": null
    },
    {
        "John Lawson": "john lawson"
    },
    {
        ", the UAP candidate, by just 42 votes on the final count. The Labor Party was reduced to 42 seats out of 42 in the House of Representatives, with five other ministers  and future prime minister ": null
    },
    {
        "John Curtin": "john curtin"
    },
    {
        " also losing their seats.       During the Great Depression, with no parliamentary salary and no chance of returning to the railway, Chifley survived on his wifes familys money and his part-ownership of the Bathurst newspaper  The National Advocate .      In 42 Chifley and most other Labor supporters in Bathurst joined the ": null
    },
    {
        "Industrial Labor Party": "industrial labor party"
    },
    {
        " , a breakaway organisation formed by ": null
    },
    {
        "Bob Heffron": "bob heffron"
    },
    {
        " and dedicated to thwarting the ": null
    },
    {
        "Lang Labor": "lang labor"
    },
    {
        " faction that controlled the ALP in New South Wales. He was a delegate to the partys annual conference in Sydney in April 42 After a unity conference in August 42 the ILP members rejoined the ALP and ended Jack Langs dominance. Chifley was subsequently elected to the ALP state executive.     In 42 the ": null
    },
    {
        "Lyons": "joseph lyons"
    },
    {
        " government appointed Chifley as a member of the Royal Commission on Banking, a subject on which he had become an expert. He submitted a minority report advocating that the private banks be nationalised. After an unsuccessful effort to win back Macquarie at the ": null
    },
    {
        "42 election": "1934 australian federal election"
    },
    {
        ", Chifley finally won his seat back at the ": null
    },
    {
        "42 election": "1940 australian federal election"
    },
    {
        " on a swing of 42 percent.       Chifley was appointed ": null
    },
    {
        "Treasurer of Australia": "treasurer of australia"
    },
    {
        " when Labor leader ": null
    },
    {
        "John Curtin": "john curtin"
    },
    {
        " formed a mid-term Labor government in 42 following the collapse of the ": null
    },
    {
        "first Menzies government": "menzies government"
    },
    {
        ".     Although deputy Labor leader ": null
    },
    {
        "Frank Forde": "frank forde"
    },
    {
        " was nominally the number-two-man in the government, Chifley became the minister Curtin most relied on, controlling most domestic policy while Curtin was preoccupied with World War II. Of highest importance was war funding, followed by the strong desire to control inflation. In February 42 he announced the pegging of wages and profits, the introduction of controls on production, trade and consumption to reduce private spending, and the transfer of surplus personal income to savings and war loans. On 42 April 42 more price controls were introduced. On 42 July a uniform income tax, giving the Commonwealth a monopoly in this vital field, was attained when the States were defeated in the ": null
    },
    {
        "High Court of Australia": "high court of australia"
    },
    {
        ".     The ": null
    },
    {
        "Australian Dictionary of Biography": "australian dictionary of biography"
    },
    {
        " claims Chifley proved himself to be his countrys greatest treasurer – fiscally responsible, able to transmit the necessity for a reasonable equality of sacrifice, and capable of managing a wartime economy of complexity and difficulty. Financing the war by increased taxation, loans from the Australian public, and central bank credit, he ensured that the nation did not become burdened with overseas debt, as it had been after World War I. Every budget was accompanied by his strictures on vigorous self-denial, labour discipline and restriction of consumer demand with the aim of controlling a huge accumulation of purchasing power.             When Curtin died in July 42 Forde became Prime Minister for eight days. Chifley defeated him in the leadership ballot, replacing him as Prime Minister and Curtin as Labor leader. Once the war ended a month later, normal political life resumed, and Chifley faced ": null
    },
    {
        "Robert Menzies": "robert menzies"
    },
    {
        " and his new ": null
    },
    {
        "Liberal Party": "liberal party of australia"
    },
    {
        " in the ": null
    },
    {
        "42 election": "1946 australian federal election"
    },
    {
        ", which Chifley won with 42 percent of the ": null
    },
    {
        "two-party-preferred vote": "two-party-preferred vote"
    },
    {
        ". It marked the first time that an incumbent federal Labor government was re-elected. In the post-war years, Chifley maintained wartime economic controls, including the highly unpopular petrol rationing. He did this partly to help Britain in its postwar economic difficulties.              Feeling secure in an unprecedented second term of office, post-WW42 Labor under Chifley looked toward incremental policies friendly to the Labor platform objective of ": null
    },
    {
        "democratic socialism": "democratic socialism"
    },
    {
        ". According to a biographer of Chifley, his government embarked upon greater general intervention and planning in economic and social affairs , with its policies directed towards better conditions in the workplace, full employment, and an improvement in the equalisation of wealth, income and opportunity . Chifley was successful in transforming the wartime economy into a peacetime economy, and undertook a number of social welfare initiatives,    as characterised by fairer pensions and unemployment and sickness benefits, the construction of new universities and technical colleges, and the building of 42 houses between 42 and 42      The radical reforming nature of the Chifley Government was such that, between 42–42 the Australian Parliament passed 42 ": null
    },
    {
        "Acts": "act of parliament"
    },
    {
        ", a record up until then, and well beyond the previous record of the Labor Government of ": null
    },
    {
        "Andrew Fisher": "andrew fisher"
    },
    {
        ", which passed 42 Acts from 42–42  Among other measures, the Chifley government passed legislation to establish ": null
    },
    {
        "universal health care": "universal health care"
    },
    {
        " modelled on the British ": null
    },
    {
        "National Health Service": "national health service"
    },
    {
        ", including a free formulary of essential medicines.  This was successfully opposed as unconstitutional in the ": null
    },
    {
        "High Court of Australia": "high court of australia"
    },
    {
        " by the ": null
    },
    {
        "British Medical Association": "british medical association"
    },
    {
        "  in the ": null
    },
    {
        "First Pharmaceutical Benefits case": "attorney-general  ex rel dale v commonwealth"
    },
    {
        ". .     Chifley then organised one of the few successful constitutional referenda to insert a new ": null
    },
    {
        "section 42xxiiiA": "section 51 of the constitution of australia"
    },
    {
        " which permitted federal legislation over pharmaceutical benefits. It authorised federal legislation over medical and dental services , together with family allowances, benefits to students and hospital benefits, child endowment, widows pensions, unemployment benefits, and maternity allowances.  The subsequent federal legislation in relation to pharmaceutical benefits was deemed constitutional by the High Court. . This paved the way for the ": null
    },
    {
        "Pharmaceutical Benefits Scheme": "pharmaceutical benefits scheme"
    },
    {
        " , an important component of Australias modern public health system. .     One of the few successful ": null
    },
    {
        "referendums": "referendums in australia"
    },
    {
        " to modify the ": null
    },
    {
        "Australian Constitution": "australian constitution"
    },
    {
        ", the ": null
    },
    {
        "42 Social Services referendum": "australian referendum, 1946"
    },
    {
        ", took place during Chifleys term.    The 42 referendum made possible many of the Chifley Labor governments other legislative initiatives in social welfare and social provision, including the following:   in 42 concessional rate radio licences were introduced for age and invalid pensioners. These concessions were later extended to widow pensioners and also to television licences;    in 42 specific racial disqualifications other than those referring to Aboriginal Australians were removed, while the Wifes Allowance became payable to de facto wives who had lived with the pensioner for at least three years.       That same year, eligibility for a Class D pension was extended to women whose husbands were imprisoned for six months or more and were over 42 years old;    from July 42 a prepayment of Maternity Allowance of five pounds could be made up to four weeks before the expected date of delivery, while the Act was amended to provide for an allowance of five pounds for each child in excess of one born from a single confinement . In addition, eligibility was extended to a mother who was an alien if she had 42 months residence;    in 42 eligibility for Childs Allowance was extended to those wives whose husbands were in benevolent asylums and to single invalid pensioners of either sex who had the custody, care and control of a child aged under the age of 42 Additional Benefit of five shillings per week for the first child became available to a beneficiary making regular contributions of not less than five shillings towards the maintenance of such a child, in addition to the person having the control, care, and custody of the child.  Amendments were also made to legislation on Child Endowment to allow Australians temporarily absent from Australia and newly arrived migrants to receive the benefit;    from July 42 funeral benefits could be paid in respect of claimants for Age Pension or Invalid Pension who would have qualified had they lived.  Under the Social Services Consolidation Act of 42 an additional benefit became payable in cases where a man with one or more dependent children under the age of 42 had a housekeeper who was substantially dependent on him but not employed by him, where he was not receiving benefit for his wife; a partial additional benefit became payable for a partially dependent spouse; and wives legally separated or likely to be permanently living apart from their husbands became eligible for benefit;    the creation of the ": null
    },
    {
        "Commonwealth Employment Service": "commonwealth employment service"
    },
    {
        ",   the introduction of federal funds to the States for public housing construction,   the Acoustic Laboratories Act, passed in 42  established the Commonwealth Acoustic Laboratories to undertake scientific investigations into hearing and problems associated with noise as it affects individuals;    although it failed in its attempts to establish a national health service, the Chifley Government was successful in making arrangements with the states to upgrade the quality and availability of hospital treatment. The Mental Institutions Benefits Act paid the states a benefit equal to the charges upon the relatives of mental hospital patients, in return for free treatment. This legislation marked the entry of the Commonwealth into mental health funding.      The achievements of both Chifleys government and those of the previous Curtin Government in expanding Australias social welfare services  were brought together under the Social Services Consolidation Act of 42 which consolidated the various social services benefits, liberalised some existing social security provisions, and increased the rates of various benefits.     Among the governments other legislative achievements were:   the establishment of a separate ": null
    },
    {
        "Australian citizenship": "australian citizenship"
    },
    {
        " in 42;   the ": null
    },
    {
        "Snowy Mountains Scheme": "snowy mountains scheme"
    },
    {
        " The aim was to reduce the countrys reliance on coal-fired electricity. Militant mining unions had caused industrial upsets for decades previously. The infamous coal strike of 42 was ended by Army intervention;   nationalisation of ": null
    },
    {
        "Qantas": "qantas"
    },
    {
        " in 42 and establishment of ": null
    },
    {
        "Trans Australia Airlines": "trans australia airlines"
    },
    {
        " in 42 Small at first these two model-of-efficiency airlines were later greatly expanded by conservative governments, who kept a tight quota on the number of airliners purchased;   the reorganisation and enlargement of the ": null
    },
    {
        "CSIRO": "csiro"
    },
    {
        ";   the establishment of a civilian rehabilitation service;   the founding of the Australian Security Intelligence Organisation ;   a Commonwealth Reconstruction Training Scheme was established to provide ex-servicemen with the opportunity to complete or undertake a university education. An interim five-year scholarship scheme was also established to encourage other able students to attend universities and annual grants to the universities to provide the staff and accommodation for the influx of assisted students and ex-servicemen.   tertiary education was also expanded through the establishment of the ": null
    },
    {
        "Australian National University": "australian national university"
    },
    {
        " and the Commonwealth Education Office. The Australian National University Act was passed to provide post-graduate facilities in Australia and to augment the supply of staff for the universities.    returned soldiers were also provided with a war gratuity and entitlement to special unemployment allowances, loans, vocational training, and preference in employment for seven years. Soldier settlement schemes were better organized than their earlier equivalents, which had brought about a great deal of hardship throughout the Twenties and thirties;    the Dairy Industry Fund was established in July 42 with the purpose of stabilising returns from exports;    in 42 unmatched grants to the States were introduced to assist them in expanding their agricultural extension activities.    the establishment of a Coal Industry Tribunal and a Joint Coal Board also brought significant gains for miners; and   life insurance came to be comprehensively regulated.          Among the Chifley Labor Governments legislation was the ": null
    },
    {
        "post-war immigration scheme": "post-war immigration to australiathe chifley years"
    },
    {
        ", the establishment of ": null
    },
    {
        "Australian citizenship": "australian citizenship"
    },
    {
        ", the ": null
    },
    {
        "Snowy Mountains Scheme": "snowy mountains scheme"
    },
    {
        ", the nationalisation of airlines ": null
    },
    {
        "Qantas": "qantas"
    },
    {
        " and ": null
    },
    {
        "Trans Australia Airlines": "trans australia airlines"
    },
    {
        ", improvements in social services,  the creation of the Commonwealth Employment Service,  the introduction of federal funds to the States for public housing construction,  the establishment of a Universities Commission for the expansion of university education,  the introduction of a ": null
    },
    {
        "Pharmaceutical Benefits Scheme": "pharmaceutical benefits scheme"
    },
    {
        " and free hospital ward treatment, the reorganisation and enlargement of the ": null
    },
    {
        "CSIRO": "csiro"
    },
    {
        ", and the establishment of a civilian rehabilitation service.      As noted by one historian, Chifleys government balanced economic development and welfare support with restraint and regulation and provided the framework for Australias post-war economic prosperity.        In 42 Chifley announced the governments intention to ": null
    },
    {
        "nationalise": "nationalisation"
    },
    {
        " the banks. This provoked massive opposition from the press, and middle-class opinion turned against Labor. The High Court found Chifleys legislation to be unconstitutional. The government ": null
    },
    {
        "appealed the decision in the Privy Council": "commonwealth v bank of new south wales"
    },
    {
        ", but it upheld the High Courts decision.     However, Chifleys government did succeed in passing the Banking and Commonwealth Bank Acts of 42 which gave the government control over monetary policy and established the ": null
    },
    {
        "Commonwealth Bank": "commonwealth bank of australia"
    },
    {
        " as Australias national bank.     A prolonged and bitter ": null
    },
    {
        "strike in the coal industry": "1949 australian coal strike"
    },
    {
        " began in June 42 and caused unemployment and hardship. Chifley saw the strike as a move by the ": null
    },
    {
        "Communist Party": "communist party of australia"
    },
    {
        " to challenge Labors place as the party of the working class, and he sent in the army to break the strike.     Despite this, Menzies exploited the rising ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " hysteria to portray Labor as soft on Communism. These events, together with a perception that Chifley and Labor had grown increasingly arrogant in office, led to the Liberal election victory at the ": null
    },
    {
        "42 election": "1949 australian federal election"
    },
    {
        ". While Labor won an additional four seats in a House of Representatives that had been expanded from 42 seats to 42 seats, Menzies and the Coalition won an additional 42 Labor retained a ": null
    },
    {
        "Senate": "australian senate"
    },
    {
        " majority however.        Chifley was now aged 42 and in poor health , but he refused to retire from politics. Though out of government, having retained a Senate majority, Chifley continued as Labor leader and became ": null
    },
    {
        "Leader of the Opposition": "leader of the opposition"
    },
    {
        ". The opposition Senate majority would frequently ensure the passing of Labor amendments, or outright blocking, of ": null
    },
    {
        "Menzies Government": "menzies government"
    },
    {
        " legislation.      Menzies responded by introducing a bill to ban the Communist Party of Australia in 42 He expected Chifley to reject it and give him an excuse to call a ": null
    },
    {
        "double dissolution": "double dissolution"
    },
    {
        " election. Menzies apparently hoped to repeat his soft-on-Communism theme to win a majority in both chambers.      However, Chifley let the bill pass after a redraft . However, when Chifley rejected Menzies Commonwealth Banking Bill a few months later, Menzies called ": null
    },
    {
        "a double dissolution election for April 42": "1951 australian federal election"
    },
    {
        ". Although Chifley managed to lead Labor to a five-seat swing in the House, Labor lost six seats in the Senate, giving the Coalition control of both chambers.          A few weeks later on 42 June 42 Chifley suffered a heart attack in his room at the ": null
    },
    {
        "Hotel Kurrajong": "hotel kurrajong"
    },
    {
        " in ": null
    },
    {
        "Canberra": "canberra"
    },
    {
        ".     Chifley at first made light of the sudden chest pains and attempted to dissuade his secretary and confidante, Phyllis Donnelly, who was making him a cup of tea, from calling a doctor. As his condition deteriorated, however, Donnelly called Dr. John Holt, who ordered Chifleys immediate removal to hospital. Chifley died in an ambulance on the way to the Canberra Community Hospital. He was pronounced dead at 42:42  pm.      Menzies heard of Chifleys demise while attending a parliamentary ": null
    },
    {
        "ball": "ball"
    },
    {
        " at Kings Hall in Parliament House to celebrate the 42th Jubilee of Federation . Menzies was deeply distressed and abandoned his normally impassive demeanour to announce in a halting subdued voice: It is my very sorrowful duty during this celebration tonight to tell you that Mr Chifley has died. I dont want to try to talk about him now because, although we were political opponents, he was a friend of mine and yours, and a fine Australian. You will all agree that in the circumstances the festivities should end. It doesnt matter about party politics on an occasion such as this. Oddly enough, in Parliament we get on very well. We sometimes find we have the warmest friendships among people whose politics are not ours. Mr Chifley served this country magnificently for years.           Chifley married ": null
    },
    {
        "Elizabeth McKenzie": "elizabeth chifley"
    },
    {
        " on 42 June 42 She was the daughter of a more senior railways employee, George McKenzie. The couple began courting in 42 but had known each other since childhood. The McKenzies were Presbyterian, and Elizabeth did not want to convert to Chifleys Catholic faith. Due to the Catholic Churchs opposition to mixed marriages, the couple chose to marry in a Presbyterian church in Glebe, Sydney. Their parents opposed the union and did not attend the ceremony, but they and their families were eventually reconciled. The McKenzies were relatively wealthy, and Chifley was seen as marrying into money, or as much money as he could hope to marry into in the context of the relatively class-bound society of Bathurst .     After their marriage, Chifleys father-in-law gave the couple a house on Busby Street, Bathurst, which they would occupy for the rest of their respective lives. It is now listed on the ": null
    },
    {
        "New South Wales State Heritage Register": "new south wales state heritage register"
    },
    {
        " as ": null
    },
    {
        "Ben Chifleys House": "ben chifleys house"
    },
    {
        " , and has operated as a ": null
    },
    {
        "house museum": "house museum"
    },
    {
        " since 42 Chifley and his wife had no children. She suffered a serious health problem , probably a miscarriage, in about 42 and later developed chronic back pain that restricted her mobility. The couple lived mostly separate lives, initially because of her husbands work on the railways and later because of his political career. She rarely travelled outside Bathurst and never lived in Canberra, even while her husband was prime minister. She usually only visited the city for special occasions. Her health prevented from campaigning for her husband, and she was known to have little interest in politics. Nonetheless, the couple seemingly enjoyed a close and caring relationship throughout his life . She survived her husband by 42 years, dying in 42     According to his biographer ": null
    },
    {
        "David Day": "david day"
    },
    {
        ", Chifley engaged in an long-running extramarital affair with his private secretary Phyllis Donnelly. Day believed that their relationship began shortly after Chifley was elected in parliament in 42 and continued more or less uninterrupted until his death in 42; she was present in his room at the ": null
    },
    {
        "Hotel Kurrajong": "hotel kurrajong"
    },
    {
        " when he suffered his final heart attack. She stayed at the same hotel, and they were known to spend their free time with each other while in Canberra. She also accompanied him on many of his travels. According to Frank Slavin, Chifleys campaign manager at the 42 election, his wife was aware of the relationship and tolerated it. Day also speculated that Chifley may have had a similar relationship with Phylliss older sister Nell. He assisted her financially in the 42s, including buying her a house in Bathurst. Day based his conclusions on interviews conducted with the Donnelly family and other Bathurst residents who had known Chifley. His claims have been disputed by members of the Chifley family, and some reviewers of his book felt there was insufficient evidence to conclude that Chifleys relationship with either of the Donnelly sisters was sexual in nature.          More than 42  years after his death, Chifleys name still aroused partisan passions. In 42 the ": null
    },
    {
        "New South Wales": "new south wales"
    },
    {
        " Labor government": "government of new south wales"
    },
    {
        " decided to name the planned new university in Sydneys western suburbs Chifley University. When, in 42 a new Liberal government renamed it the ": null
    },
    {
        "University of Western Sydney": "university of western sydney"
    },
    {
        ", controversy broke out. According to a debate on the topic, held in 42 after the Labor Party had regained government, the decision to rename Chifley University reflected a desire to attach the name of Western Sydney to institutions of lasting significance, and that idea ultimately received the support of ": null
    },
    {
        "Bob Carr": "bob carr"
    },
    {
        ", later the ": null
    },
    {
        "Premier of New South Wales": "premier of new south wales"
    },
    {
        ".           Places and institutions that have been named after Chifley include:   the suburb of ": null
    },
    {
        "Chifley": "chifley, australian capital territory"
    },
    {
        " in ": null
    },
    {
        "Canberra": "canberra"
    },
    {
        " Chifley": "chifley, new south wales"
    },
    {
        " in Sydney   the ": null
    },
    {
        "Division of Chifley": "division of chifley"
    },
    {
        ", a federal electorate   ": null
    },
    {
        "his former house in Bathurst": "ben chifleys house"
    },
    {
        ", now the Chifley Home and Education Centre,  listed on the ": null
    },
    {
        "NSW State Heritage Register": "new south wales state heritage register"
    },
    {
        " Australian National University": "australian national university"
    },
    {
        ", Canberra   ": null
    },
    {
        "Chifley Tower": "chifley tower"
    },
    {
        " and Chifley Square in Sydney   Chifley Cave , one of the ": null
    },
    {
        "Jenolan Caves": "jenolan caves"
    },
    {
        " in the Blue Mountains, New South Wales    several ": null
    },
    {
        "public": "list of government schools in new south wales"
    },
    {
        " high schools": "secondary school"
    },
    {
        " in ": null
    },
    {
        "Western Sydney": "western sydney"
    },
    {
        " are now known as Chifley College. ": null
    },
    {
        "List of government schools in New South Wales: A–FC": "list of government schools in new south wales: a–fc"
    },
    {
        "   a grouping of ": null
    },
    {
        "dormitories": "dormitory"
    },
    {
        " at the Bathurst campus of ": null
    },
    {
        "Charles Sturt University": "charles sturt university"
    },
    {
        " are collectively named as Chifley Halls     In 42 he was honoured on a postage stamp bearing his portrait issued by ": null
    },
    {
        "Australia Post": "australia post"
    },
    {
        ".      One of the locomotives driven by Chifley, ": null
    },
    {
        "42": "new south wales d50 class locomotive"
    },
    {
        ", is preserved on a plinth at the eastern end of ": null
    },
    {
        "Bathurst railway station": "bathurst railway station, new south wales"
    },
    {
        ". , westernadvocate.com.au, 42 June 42       Chifley was portrayed by ": null
    },
    {
        "Bill Hunter": "bill hunter"
    },
    {
        " in the 42 TV miniseries  The Last Bastion , by ": null
    },
    {
        "Ed Devereaux": "ed devereaux"
    },
    {
        " in the 42 miniseries  The True Believers , and ": null
    },
    {
        "Geoff Morrell": "geoff morrell"
    },
    {
        " in the 42 film  Curtin ": null
    }
]