[
    {
        "Benedict, sometimes known as Benedictus Abbas , was ": null
    },
    {
        "abbot of Peterborough": "abbot of peterborough"
    },
    {
        ". His name was formerly erroneously associated with the Gesta Henrici Regis Secundi and Gesta Regis Ricardi, ": null
    },
    {
        "English": "england"
    },
    {
        " 42th century chronicles, which are now attributed to ": null
    },
    {
        "Roger of Howden": "roger of hoveden"
    },
    {
        ".       Benedict first makes his appearance in 42 as the chancellor of ": null
    },
    {
        "Archbishop Richard": "richard of dover"
    },
    {
        ", the successor of ": null
    },
    {
        "Becket": "thomas becket"
    },
    {
        " in the ": null
    },
    {
        "primacy": "archbishop of canterbury"
    },
    {
        ". In 42 Benedict became prior of Holy Trinity, Canterbury; in 42 he received from ": null
    },
    {
        "Henry II": "henry ii of england"
    },
    {
        " the ": null
    },
    {
        "abbacy of Peterborough": "peterborough abbey"
    },
    {
        ", which he held until his death. As abbot he distinguished himself by his activity in building, in administering the finances of his house and in collecting a library. He is described in the  Chronicon Petroburgense  as blessed both in name and deed .       Benedict belonged to the circle of Beckets admirers, and wrote two works dealing with the martyrdom and the miracles of his hero. Fragments of the former work have come down to us in the compilation known as the Quadrilogus, which is printed in the fourth volume of ": null
    },
    {
        "James Craigie Robertson": "james craigie robertson"
    },
    {
        "s Materials for the Histories of Thomas Becket ; the miracles are extant in their entirety, and are printed in the second volume of the same collection.     Benedict was formerly credited with the authorship of the Gesta on the ground that his name appears in the title of the oldest manuscript. There is, however, conclusive evidence that Benedict merely caused this work to be transcribed for the Peterborough library. It is only through the force of custom that the work is still occasionally cited under his name. In the twentieth century, ": null
    },
    {
        "D. M. Stenton": "doris mary stenton"
    },
    {
        " formulated the theory, developed further by ": null
    },
    {
        "David Corner": "david corner"
    },
    {
        ", and now generally accepted, that the true author of the Gesta was in fact ": null
    },
    {
        "Roger of Howden": "roger of howden"
    },
    {
        ". On his return from the ": null
    },
    {
        "Third Crusade": "third crusade"
    },
    {
        ", he drew upon them in composing his larger Chronica, revising them and adding supplementary material.     In the nineteenth century, the question of authorship had been discussed by ": null
    },
    {
        "T. D. Hardy": "t. d. hardy"
    },
    {
        ", ": null
    },
    {
        "William Stubbs": "william stubbs"
    },
    {
        " and ": null
    },
    {
        "Felix Liebermann": "felix liebermann"
    },
    {
        ". Stubbs conjecturally identified the first part of the Gesta with the Liber Tricolumnis, a register of contemporary events kept by ": null
    },
    {
        "Richard Fitz Neal": "richard fitz neal"
    },
    {
        ", the treasurer of Henry II and author of the Dialogus de Scaccario; the latter part was ascribed by Stubbs to Roger of Howden. His theory concerning the Liber Tricolumnis, was rejected by Liebermann and other editors of the Dialogus .       ": null
    }
]