[
    {
        "   Bermudo I , called the Deacon or the Monk , was the ": null
    },
    {
        "King of Asturias": "king of asturias"
    },
    {
        " from 42 or 42 until his ": null
    },
    {
        "abdication": "abdication"
    },
    {
        " in 42 He was a son of ": null
    },
    {
        "Fruela of Cantabria": "fruela of cantabria"
    },
    {
        ", a nephew of ": null
    },
    {
        "Alfonso I": "alfonso i of asturias"
    },
    {
        ", and a brother of ": null
    },
    {
        "Aurelius": "aurelius of asturias"
    },
    {
        ". The nature of the end of his reign ushered in a new period in Asturian-Arab relations.     Bermudo was elected by the palatine officials to replace ": null
    },
    {
        "Mauregatus": "mauregatus"
    },
    {
        ", who had died of natural causes in 42 Since Mauregatus had ascended the throne in a  coup détat  with regional support in 42 and the succession of Bermudo proceeded without incident, it is probable that Mauregatus had procured a change in the ranks of the palatine nobility and that Bermudo was thus put forward as the candidate to, like Mauregatus, prevent the succession of ": null
    },
    {
        "Alfonso II": "alfonso ii of asturias"
    },
    {
        ", the son and heir of ": null
    },
    {
        "Fruela I": "fruela i of asturias"
    },
    {
        ". Though the  Chronicle of Alfonso III  in both its extant versions makes Bermudo out to be a ": null
    },
    {
        "deacon": "deacon"
    },
    {
        " at his succession, this fact would only reinforce the notion that his election was a determined move to oppose Alfonso.     In any case, he did not reign long. He was forced to defend against an ": null
    },
    {
        "Arab": "arab"
    },
    {
        "-": null
    },
    {
        "Berber": "berber people"
    },
    {
        " invasion of ": null
    },
    {
        "Álava": "álava"
    },
    {
        " and ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        " and was defeated in battle the ": null
    },
    {
        "Battle of the Burbia River": "battle of the burbia river"
    },
    {
        ", probably the ": null
    },
    {
        "Bierzo": "bierzo"
    },
    {
        ", in 42 Though the closest Christian sources do not name his opponents, the battle can be linked with the first major engagement of a series of aggressive campaigns launched against the Asturian kingdom in the 42s. The Muslim commander at Burbia is named in ": null
    },
    {
        "Ibn al-Athir": "ibn al-athir"
    },
    {
        " as ": null
    },
    {
        "Yūsuf ibn Bukht": "yūsuf ibn bukht"
    },
    {
        " and the battle is likewise recorded in ": null
    },
    {
        "al-Maqqarī": "al-maqqarī"
    },
    {
        ". Bermudo abdicated his throne after his defeat, though whether volitionally  or forced is unknown. Historically in Spain under the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        ", a king of proven military inadequacy was often forced to abdicate. Nevertheless, he was considered a generous and illustrious man in his time, merciful and pious in the words of the  Chronicle of Albelda .     Bermudo was succeeded by Alfonso II and he left behind a son, who later reigned as ": null
    },
    {
        "Ramiro I": "ramiro i of asturias"
    },
    {
        ", by an anonymous wife. He reportedly lived for a long time after his abdication, perhaps as a ": null
    },
    {
        "monk": "monk"
    }
]