[
    {
        "     Bernardo del Carpio, also spelled Bernaldo del Carpio, is, since the beginnings of modern historical scholarship, a legendary hero of the ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " Kingdom of Asturias": "kingdom of asturias"
    },
    {
        ". In contrast with ": null
    },
    {
        "El Cid": "el cid"
    },
    {
        ", he was not based on a real person . Until the end of the nineteenth century and the labors of ": null
    },
    {
        "Ramón Menéndez Pidal": "ramón menéndez pidal"
    },
    {
        ", he, not El Cid, was the chief hero of medieval Christian Spain. He was believed to be historical.       Supposedly the nephew of ": null
    },
    {
        "Alfonso II of Asturias": "alfonso ii of asturias"
    },
    {
        ", stories feature him striving against Alfonso to release his father from prison. Other stories have him as the rival and slayer of ": null
    },
    {
        "Roland": "roland"
    },
    {
        " at ": null
    },
    {
        "Roncesvaux": "battle of roncevaux pass"
    },
    {
        ".     Bernardo was said to be the son of Sancho, the Count of ": null
    },
    {
        "Saldaña": "saldaña, palencia"
    },
    {
        " and Dona Ximena . Alfonso was not happy with the marriage, so he had Sancho blinded and thrown into prison and took Bernardo. He was raised in Alfonso IIs court. Everybody was ordered not to tell the young Bernardo who his father was.     Alfonso invited ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        " into Iberia to defeat the ": null
    },
    {
        "Moors": "moors"
    },
    {
        ", promising to name him as heir. Bernardos victory at Roncesvaux ended that plan. But Bernardo then joined up with the Moors, hoping to force Alfonso into action; but Alfonso secretly had Sancho killed while in prison.       The original legend of Bernardo del Carpio was sung by the  jongleur s of the ": null
    },
    {
        "Kingdom of León": "kingdom of león"
    },
    {
        ". Later, the Castilian poet ": null
    },
    {
        "Pero Ferrús": "pero ferrús"
    },
    {
        "  mentions Bernardo del Carpio in one of his cantigas, which combines the theme of the good life in ": null
    },
    {
        "Castile": "castile"
    },
    {
        " with a series of loores, or lyric paeans, to a series of ": null
    },
    {
        "Greek": "greek mythology"
    },
    {
        ", ": null
    },
    {
        "Roman": "roman mythology"
    },
    {
        ", ": null
    },
    {
        "Biblical": "biblical"
    },
    {
        ", ": null
    },
    {
        "chivalric": "chivalry"
    },
    {
        ", and ": null
    },
    {
        "Arab": "arab"
    },
    {
        " heroes.     In 42 ": null
    },
    {
        "Bernardo de Balbuena": "bernardo de balbuena"
    },
    {
        " published El Bernardo, an account of Bernardos exploits. It is considered one of the masterpieces of ": null
    },
    {
        "Spanish literature": "spanish literature"
    },
    {
        ".     In the opening of  Don Quixote , ": null
    },
    {
        "Cervantes": "cervantes"
    },
    {
        " has the protagonist especially admiring Bernardo because he crushed Roland with his arms alone, although the context is clear that Don Quixote is placing too much credence in the fantastic stories of ": null
    },
    {
        "romance": "romance"
    }
]