[
    {
        "   Bernard Allan Bernie Federko is a ": null
    },
    {
        "Canadian": "Canadians"
    },
    {
        " retired professional ": null
    },
    {
        "ice hockey": "Ice Hockey"
    },
    {
        " centre": "Centre"
    },
    {
        " of ": null
    },
    {
        "Ukrainian": "Ukrainians"
    },
    {
        " ancestry who played fourteen seasons in the ": null
    },
    {
        "National Hockey League": "National Hockey League"
    },
    {
        " from ": null
    },
    {
        "1976": "1976–77 Nhl Season"
    },
    {
        " through ": null
    },
    {
        "1990": "1989–90 Nhl Season"
    },
    {
        ".       Federko began playing hockey at a young age in his home town of ": null
    },
    {
        "Foam Lake, Saskatchewan": "Foam Lake, Saskatchewan"
    },
    {
        ". He was captain of the 1971 Bantam provincial champions. He also played Senior hockey with the local ": null
    },
    {
        "Foam Lake Flyers": "Foam Lake Flyers"
    },
    {
        " of the Fishing Lake Hockey League, winning the league scoring title as a bantam-aged player. Federko continued his career with the ": null
    },
    {
        "Saskatoon Blades": "Saskatoon Blades"
    },
    {
        " of the ": null
    },
    {
        "WHL": "Western Hockey League"
    },
    {
        " where he set and still holds the team record for assists. He played three seasons with the Blades, and in his final year with the club he led the league in assists and points in both the regular season and playoffs. As a reward, Federko was drafted 7th overall by the ": null
    },
    {
        "St. Louis Blues": "St. Louis Blues"
    },
    {
        " in the ": null
    },
    {
        "1976 NHL Amateur Draft": "1976 Nhl Amateur Draft"
    },
    {
        ". He started the next season with the ": null
    },
    {
        "Kansas City Blues": "Kansas City Blues"
    },
    {
        " of the ": null
    },
    {
        "Central Hockey League": "Central Hockey League"
    },
    {
        " and was leading the league in points when he was called up mid-season to play 31 games with St. Louis. He scored three ": null
    },
    {
        "hat tricks": "Hat Trick"
    },
    {
        "in those 31 games. In the ": null
    },
    {
        "1978–79 NHL season": "1978–79 Nhl Season"
    },
    {
        ", Federko developed into a bona fide star, as he scored 95 points.     Federko scored 100 points in a season four times, and was a consistent and underrated performer for the Blues. Federko scored at least 90 points in seven of the eight seasons between 1978 and 1986, and became the first player in NHL history to record at least 50 assists in 10 consecutive seasons. However, in an era when ": null
    },
    {
        "Wayne Gretzky": "Wayne Gretzky"
    },
    {
        " was scoring 200 points a season, Federko never got the attention many felt he deserved. In 1986, in a poll conducted by GOAL magazine, he was named the most overlooked talent in hockey. His ": null
    },
    {
        "General Manager": "General Manager"
    },
    {
        " Ron Caron": "Ron Caron"
    },
    {
        " said he was A great playmaker. He makes the average or above average player look like a star at times. Hes such an unselfish player.     On March 19, 1988, Federko became the 22nd NHL player to record 1000 career points. After a poor season for Federko in ": null
    },
    {
        "1988–89": "1988–89 Nhl Season"
    },
    {
        ", he was traded to the ": null
    },
    {
        "Detroit Red Wings": "Detroit Red Wings"
    },
    {
        " with ": null
    },
    {
        "Tony McKegney": "Tony Mckegney"
    },
    {
        " for future Blues star ": null
    },
    {
        "Adam Oates": "Adam Oates"
    },
    {
        ", and ": null
    },
    {
        "Paul MacLean": "Paul Maclean"
    },
    {
        ". In Detroit, Federko re-united with former Blues head coach ": null
    },
    {
        "Jacques Demers": "Jacques Demers"
    },
    {
        ", but he had to play behind ": null
    },
    {
        "Steve Yzerman": "Steve Yzerman"
    },
    {
        " and did not get his desired ice time. After his lowest point output since his rookie season, Federko decided to retire after the ": null
    },
    {
        "1989–90 season": "1989–90 Nhl Season"
    },
    {
        ", having played exactly 1,000 NHL games with his final game on April 1, 1990.        Less than a year after retiring as a player, the Blues retired number 24 in his honor on March 16, 1991. Federko was eventually inducted into the ": null
    },
    {
        "Hockey Hall of Fame": "Hockey Hall Of Fame"
    },
    {
        " in 2002. Currently, Federko is a television color commentator for ": null
    },
    {
        "Fox Sports Midwest": "Fox Sports Midwest"
    },
    {
        " during Blues broadcasts. Federko was the head coach/general manager of the ": null
    },
    {
        "St. Louis Vipers": "St. Louis Vipers"
    },
    {
        " roller hockey": "Roller In-Line Hockey"
    },
    {
        " team of the ": null
    },
    {
        "Roller Hockey International": "Roller Hockey International"
    },
    {
        " for the 1993 and 1994 seasons.       Named to the WCHL All-Star Team   Named WCHL MVP   Named to the CHL Second All-Star Team   Won Ken McKenzie Trophy as CHL Rookie of the Year   Played in the NHL All-Star Game   Named NHL Player of the Week       St. Louis Blues team record for career games played   St. Louis Blues team record for career assists   St. Louis Blues team record for career points   Shares St. Louis Blues team record for assists in one game   St. Louis Blues team record for career playoff assists   Held St. Louis Blues team record for points in one playoff year ; Until Ryan OReilly in 2019 with 23   Held St. Louis Blues team record for assists in one playoff year ; Until Alex Pietrangelo in 2019 with 16   NHL Record   - First player to get 50 assists in 10 consecutive seasons in NHL history.       ": null
    }
]