[
    {
        "               Beryllium is a ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        " Be and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " 4. It is a ": null
    },
    {
        "relatively rare": "Abundance Of The Chemical Elementsuniverse"
    },
    {
        " element in the ": null
    },
    {
        "universe": "Universe"
    },
    {
        ", usually occurring as a product of the ": null
    },
    {
        "spallation": "Spallation"
    },
    {
        " of larger atomic nuclei that have collided with ": null
    },
    {
        "cosmic ray": "Cosmic Ray"
    },
    {
        "s. Within the cores of stars, beryllium is depleted as it is fused into heavier elements. It is a ": null
    },
    {
        "divalent": "Divalent"
    },
    {
        " element which occurs naturally only in combination with other elements in minerals. Notable ": null
    },
    {
        "gemstones": "Gemstones"
    },
    {
        " which contain beryllium include ": null
    },
    {
        "beryl": "Beryl"
    },
    {
        "  and ": null
    },
    {
        "chrysoberyl": "Chrysoberyl"
    },
    {
        ". As a free ": null
    },
    {
        "element": "Chemical Element"
    },
    {
        " it is a steel-gray, strong, lightweight and brittle ": null
    },
    {
        "alkaline earth metal": "Alkaline Earth Metal"
    },
    {
        ".     In structural applications, the combination of high ": null
    },
    {
        "flexural rigidity": "Flexural Rigidity"
    },
    {
        ", ": null
    },
    {
        "thermal stability": "Thermal Stability"
    },
    {
        ", ": null
    },
    {
        "thermal conductivity": "Thermal Conductivity"
    },
    {
        " and low ": null
    },
    {
        "density": "Density"
    },
    {
        " make beryllium metal a desirable ": null
    },
    {
        "aerospace": "Aerospace"
    },
    {
        " material for aircraft components, ": null
    },
    {
        "missile": "Missile"
    },
    {
        "s, ": null
    },
    {
        "spacecraft": "Spacecraft"
    },
    {
        ", and ": null
    },
    {
        "satellites": "Satellites"
    },
    {
        ". Because of its low density and ": null
    },
    {
        "atomic mass": "Atomic Mass"
    },
    {
        ", beryllium is relatively transparent to X-rays and other forms of ": null
    },
    {
        "ionizing radiation": "Ionizing Radiation"
    },
    {
        "; therefore, it is the most common window material for X-ray equipment and components of ": null
    },
    {
        "particle detector": "Particle Detector"
    },
    {
        "s. The high thermal conductivities of beryllium and ": null
    },
    {
        "beryllium oxide": "Beryllium Oxide"
    },
    {
        " have led to their use in thermal management applications. When added as an ": null
    },
    {
        "alloy": "Alloy"
    },
    {
        "ing element to ": null
    },
    {
        "aluminium": "Aluminium"
    },
    {
        ", ": null
    },
    {
        "copper": "Copper"
    },
    {
        " , ": null
    },
    {
        "iron": "Iron"
    },
    {
        " or ": null
    },
    {
        "nickel": "Nickel"
    },
    {
        " beryllium improves many physical properties. Tools made of ": null
    },
    {
        "beryllium copper": "Beryllium Copper"
    },
    {
        "alloys": "Alloy"
    },
    {
        "are ": null
    },
    {
        "strong": "Strength Of Materials"
    },
    {
        " and ": null
    },
    {
        "hard": "Hardness"
    },
    {
        " and do not create sparks when they strike a steel surface. Beryllium does not form oxides until it reaches very high temperatures.     The commercial use of beryllium requires the use of appropriate dust control equipment and industrial controls at all times because of the ": null
    },
    {
        "toxicity": "Toxicity"
    },
    {
        " of inhaled beryllium-containing dusts that can cause a chronic life-threatening allergic disease in some people called ": null
    },
    {
        "berylliosis": "Berylliosis"
    },
    {
        ".            Beryllium is a steel gray and hard ": null
    },
    {
        "metal": "Metal"
    },
    {
        " that is brittle at room temperature and has a close-packed hexagonal ": null
    },
    {
        "crystal structure": "Crystal Structure"
    },
    {
        ".  It has exceptional ": null
    },
    {
        "stiffness": "Stiffness"
    },
    {
        "  and a ": null
    },
    {
        "melting point": "Melting Point"
    },
    {
        " of 1287 C. The ": null
    },
    {
        "modulus of elasticity": "Modulus Of Elasticity"
    },
    {
        " of beryllium is approximately 50% greater than that of steel. The combination of this modulus and a relatively low density results in an unusually fast ": null
    },
    {
        "sound conduction speed": "Speed Of Sound"
    },
    {
        " in beryllium – about 12.9  km/s at ": null
    },
    {
        "ambient conditions": "Standard Conditions For Temperature And Pressure"
    },
    {
        ". Other significant properties are high specific heat and thermal conductivity , which make beryllium the metal with the best heat dissipation characteristics per unit weight. In combination with the relatively low coefficient of linear ": null
    },
    {
        "thermal expansion": "Thermal Expansion"
    },
    {
        " , these characteristics result in a unique stability under conditions of thermal loading.        Naturally occurring beryllium, save for slight contamination by the cosmogenic radioisotopes, is isotopically pure beryllium-9, which has a ": null
    },
    {
        "nuclear spin": "Spin"
    },
    {
        " of . Beryllium has a large scattering cross section for high-energy neutrons, about 6 ": null
    },
    {
        "barns": "Barn"
    },
    {
        " for energies above approximately 10  keV. Therefore, it works as a neutron reflector and ": null
    },
    {
        "neutron moderator": "Neutron Moderator"
    },
    {
        ", effectively slowing the neutrons to the ": null
    },
    {
        "thermal energy": "Neutron Temperature"
    },
    {
        " range of below 0.03  eV, where the total cross section is at least an order of magnitude lower – exact value strongly depends on the purity and size of the crystallites in the material.     The single primordial beryllium isotope 9 Be also undergoes a neutron reaction with neutron energies over about 1.9  MeV, to produce 8 Be, which almost immediately breaks into two alpha particles. Thus, for high-energy neutrons, beryllium is a neutron multiplier, releasing more neutrons than it absorbs. This nuclear reaction is:   : + n → 2  + 2 n     Neutrons are liberated when beryllium ": null
    },
    {
        "nuclei": "Atomic Nucleus"
    },
    {
        " are struck by energetic ": null
    },
    {
        "alpha particles": "Alpha Particle"
    },
    {
        " producing the nuclear reaction   : +  →  + n   where  is an alpha particle and  is a ": null
    },
    {
        "carbon-12": "Carbon-12"
    },
    {
        " nucleus.    Beryllium also releases neutrons under bombardment by gamma rays. Thus, natural beryllium bombarded either by alphas or gammas from a suitable radioisotope is a key component of most radioisotope-powered ": null
    },
    {
        "nuclear reaction": "Nuclear Reaction"
    },
    {
        "neutron sources": "Neutron Source"
    },
    {
        "for the laboratory production of free neutrons.     Small amounts of ": null
    },
    {
        "tritium": "Tritium"
    },
    {
        " are liberated when  nuclei absorb low energy neutrons in the three-step nuclear reaction   : + n →  + ,        →  + β − ,        + n →  +    Note that  has a half-life of only 0.8 seconds, β − is an electron, and  has a high neutron absorption cross-section. Tritium is a radioisotope of concern in nuclear reactor waste streams.      As a metal, beryllium is ": null
    },
    {
        "transparent": "Transparency And Translucency"
    },
    {
        " to most wavelengths of ": null
    },
    {
        "X-rays": "X-Ray"
    },
    {
        "and ": null
    },
    {
        "gamma ray": "Gamma Ray"
    },
    {
        "s, making it useful for the output windows of ": null
    },
    {
        "X-ray tubes": "X-Ray Tube"
    },
    {
        "and other such apparatus.          Both stable and unstable isotopes of beryllium are created in stars, but the radioisotopes do not last long. It is believed that most of the stable beryllium in the universe was originally created in the interstellar medium when ": null
    },
    {
        "cosmic rays": "Cosmic Rays"
    },
    {
        " induced fission in heavier elements found in interstellar gas and dust.  Primordial beryllium contains only one stable isotope, 9 Be, and therefore beryllium is a ": null
    },
    {
        "monoisotopic": "Monoisotopic Element"
    },
    {
        " and ": null
    },
    {
        "mononuclidic element": "Mononuclidic Element"
    },
    {
        ".        Radioactive ": null
    },
    {
        "cosmogenic": "Cosmogenic"
    },
    {
        "  10 Be": "Beryllium-10"
    },
    {
        " is produced in the ": null
    },
    {
        "atmosphere of the Earth": "Earths Atmosphere"
    },
    {
        " by the ": null
    },
    {
        "cosmic ray spallation": "Cosmic Ray Spallation"
    },
    {
        " of ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        "  . 10 Be accumulates at the ": null
    },
    {
        "soil": "Soil"
    },
    {
        " surface, where its relatively long ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " permits a long ": null
    },
    {
        "residence time": "Residence Time"
    },
    {
        " before decaying to ": null
    },
    {
        "boron": "Boron"
    },
    {
        "-10. Thus, 10 Be and its daughter products are used to examine natural ": null
    },
    {
        "soil erosion": "Soil Erosion"
    },
    {
        ", ": null
    },
    {
        "soil formation": "Soil Formation"
    },
    {
        " and the development of ": null
    },
    {
        "lateritic soils": "Laterite"
    },
    {
        ", and as a ": null
    },
    {
        "proxy": "Proxy"
    },
    {
        " for measurement of the variations in ": null
    },
    {
        "solar activity": "Solar Variation"
    },
    {
        " and the age of ": null
    },
    {
        "ice core": "Ice Core"
    },
    {
        "s.  The production of 10 Be is inversely proportional to solar activity, because increased ": null
    },
    {
        "solar wind": "Solar Wind"
    },
    {
        " during periods of high solar activity decreases the flux of ": null
    },
    {
        "galactic cosmic rays": "Galactic Cosmic Ray"
    },
    {
        "that reach the Earth. Nuclear explosions also form 10 Be by the reaction of fast neutrons with 13 C in the carbon dioxide in air. This is one of the indicators of past activity at ": null
    },
    {
        "nuclear weapon test": "Nuclear Weapon Test"
    },
    {
        " sites.    The isotope 7 Be is also cosmogenic, and shows an atmospheric abundance linked to sunspots, much like 10 Be.     8 Be has a very short half-life of about 8  s that contributes to its significant cosmological role, as elements heavier than beryllium could not have been produced by nuclear fusion in the ": null
    },
    {
        "Big Bang": "Big Bang"
    },
    {
        ".  This is due to the lack of sufficient time during the Big Bangs ": null
    },
    {
        "nucleosynthesis": "Nucleosynthesis"
    },
    {
        " phase to produce carbon by the fusion of 4 He nuclei and the very low concentrations of available ": null
    },
    {
        "beryllium-8": "Beryllium-8"
    },
    {
        ". British ": null
    },
    {
        "astronomer": "Astronomer"
    },
    {
        " Sir ": null
    },
    {
        "Fred Hoyle": "Fred Hoyle"
    },
    {
        " first showed that the energy levels of 8 Be and 12 C allow carbon production by the so-called ": null
    },
    {
        "triple-alpha process": "Triple-Alpha Process"
    },
    {
        " in helium-fueled stars where more nucleosynthesis time is available. This process allows carbon to be produced in stars, but not in the Big Bang. Star-created carbon  is thus a component in the elements in the gas and dust ejected by ": null
    },
    {
        "AGB stars": "Agb Star"
    },
    {
        "and ": null
    },
    {
        "supernovae": "Supernova"
    },
    {
        " , as well as the creation of all other elements with ": null
    },
    {
        "atomic numbers": "Atomic Number"
    },
    {
        "larger than that of carbon.      The 2s electrons of beryllium may contribute to chemical bonding. Therefore, when 7 Be decays by L-": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        ", it does so by taking electrons from its ": null
    },
    {
        "atomic orbitals": "Atomic Orbital"
    },
    {
        "that may be participating in bonding. This makes its decay rate dependent to a measurable degree upon its chemical surroundings  – a rare occurrence in nuclear decay.      The shortest-lived known isotope of beryllium is 13 Be which decays through ": null
    },
    {
        "neutron emission": "Neutron Emission"
    },
    {
        ". It has a half-life of 2.7  ×  10 −21 s. 6 Be is also very short-lived with a half-life of 5.0  ×  10 −21 s. Hammond, C. R. Elements in  The exotic isotopes 11 Be and 14 Be are known to exhibit a ": null
    },
    {
        "nuclear halo": "Halo Nucleus"
    },
    {
        ".  This phenomenon can be understood as the nuclei of 11 Be and 14 Be have, respectively, 1 and 4 neutrons orbiting substantially outside the classical Fermi waterdrop model of the nucleus.             The Sun has a concentration of 0.1 ": null
    },
    {
        "parts per billion": "Parts Per Billion"
    },
    {
        " of beryllium.  Beryllium has a concentration of 2 to 6 ": null
    },
    {
        "parts per million": "Parts Per Million"
    },
    {
        " in the Earths crust.  It is most concentrated in the soils, 6 ppm. Trace amounts of 9 Be are found in the Earths atmosphere. The concentration of beryllium in sea water is 0.2–0.6 ": null
    },
    {
        "parts per trillion": "Parts Per Trillion"
    },
    {
        ".  In stream water, however, beryllium is more abundant with a concentration of 0.1 ppb.      Beryllium is found in over 100 minerals,  but most are uncommon to rare. The more common beryllium containing minerals include: ": null
    },
    {
        "bertrandite": "Bertrandite"
    },
    {
        " , ": null
    },
    {
        "beryl": "Beryl"
    },
    {
        " , ": null
    },
    {
        "chrysoberyl": "Chrysoberyl"
    },
    {
        " and ": null
    },
    {
        "phenakite": "Phenakite"
    },
    {
        " . Precious forms of beryl are ": null
    },
    {
        "aquamarine": "Aquamarine"
    },
    {
        ", ": null
    },
    {
        "red beryl": "Red Beryl"
    },
    {
        " and ": null
    },
    {
        "emerald": "Emerald"
    },
    {
        ".       The green color in gem-quality forms of beryl comes from varying amounts of chromium .     The two main ores of beryllium, beryl and bertrandite, are found in Argentina, Brazil, India, Madagascar, Russia and the United States. Total world reserves of beryllium ore are greater than 400,000 tonnes.       The extraction of beryllium from its compounds is a difficult process due to its high affinity for oxygen at elevated temperatures, and its ability to reduce water when its oxide film is removed. The United States, China and Kazakhstan are the only three countries involved in the industrial-scale extraction of beryllium.  Beryllium production technology is in early stages of development in Russia after a 20-year hiatus.      Beryllium is most commonly extracted from the mineral ": null
    },
    {
        "beryl": "Beryl"
    },
    {
        ", which is either ": null
    },
    {
        "sintered": "Sintering"
    },
    {
        " using an extraction agent or melted into a soluble mixture. The sintering process involves mixing beryl with ": null
    },
    {
        "sodium fluorosilicate": "Sodium Fluorosilicate"
    },
    {
        " and soda at  to form ": null
    },
    {
        "sodium fluoroberyllate": "Tetrafluoroberyllate"
    },
    {
        ", ": null
    },
    {
        "aluminium oxide": "Aluminium Oxide"
    },
    {
        " and ": null
    },
    {
        "silicon dioxide": "Silicon Dioxide"
    },
    {
        ". ": null
    },
    {
        "Beryllium hydroxide": "Beryllium Hydroxide"
    },
    {
        " is precipitated from a solution of sodium fluoroberyllate and ": null
    },
    {
        "sodium hydroxide": "Sodium Hydroxide"
    },
    {
        " in water. Extraction of beryllium using the melt method involves grinding beryl into a powder and heating it to . The melt is quickly cooled with water and then reheated  in concentrated ": null
    },
    {
        "sulfuric acid": "Sulfuric Acid"
    },
    {
        ", mostly yielding ": null
    },
    {
        "beryllium sulfate": "Beryllium Sulfate"
    },
    {
        " and ": null
    },
    {
        "aluminium sulfate": "Aluminium Sulfate"
    },
    {
        ". Aqueous ": null
    },
    {
        "ammonia": "Ammonia"
    },
    {
        " is then used to remove the aluminium and sulfur, leaving beryllium hydroxide.     Beryllium hydroxide created using either the sinter or melt method is then converted into ": null
    },
    {
        "beryllium fluoride": "Beryllium Fluoride"
    },
    {
        " or ": null
    },
    {
        "beryllium chloride": "Beryllium Chloride"
    },
    {
        ". To form the fluoride, aqueous ammonium hydrogen fluoride is added to beryllium hydroxide to yield a precipitate of ammonium tetrafluoroberyllate, which is heated to  to form beryllium fluoride. Heating the fluoride to  with ": null
    },
    {
        "magnesium": "Magnesium"
    },
    {
        " forms finely divided beryllium, and additional heating to  creates the compact metal. Heating beryllium hydroxide forms the oxide, which becomes beryllium chloride when combined with carbon and chlorine. ": null
    },
    {
        "Electrolysis": "Electrolysis"
    },
    {
        " of molten beryllium chloride is then used to obtain the metal.                     A beryllium atom has the electronic configuration 2s 2 . The predominant ": null
    },
    {
        "oxidation state": "Oxidation State"
    },
    {
        " of beryllium is +2; the beryllium atom has lost both of its valence electrons. Lower oxidation states have been found in, for example, bis compounds.    Berylliums chemical behavior is largely a result of its small ": null
    },
    {
        "atomic": "Atomic Radius"
    },
    {
        " and ": null
    },
    {
        "ionic": "Ionic Radius"
    },
    {
        " radii. It thus has very high ": null
    },
    {
        "ionization potentials": "Ionization Potential"
    },
    {
        "and strong polarization while bonded to other atoms, which is why all of its compounds are ": null
    },
    {
        "covalent": "Covalent Bond"
    },
    {
        ". Its chemistry has similarities with the chemistry of aluminium, an example of a ": null
    },
    {
        "diagonal relationship": "Diagonal Relationship"
    },
    {
        ". An oxide layer forms on the surface of beryllium metal that prevents further reactions with air unless heated above 1000  °C. Once ignited, beryllium burns brilliantly forming a mixture of ": null
    },
    {
        "beryllium oxide": "Beryllium Oxide"
    },
    {
        " and ": null
    },
    {
        "beryllium nitride": "Beryllium Nitride"
    },
    {
        ". Beryllium dissolves readily in non-": null
    },
    {
        "oxidizing acid": "Oxidizing Acid"
    },
    {
        "s, such as HCl and diluted H 2 SO 4 , but not in ": null
    },
    {
        "nitric acid": "Nitric Acid"
    },
    {
        " or water as this forms the oxide. This behavior is similar to that of aluminium metal. Beryllium also dissolves in alkali solutions.      Binary compounds of beryllium are polymeric in the solid state. ": null
    },
    {
        "BeF 2 ": "Beryllium Fluoride"
    },
    {
        " has a ": null
    },
    {
        "silica": "Silica"
    },
    {
        "-like structure with corner-shared BeF 4 tetrahedra. ": null
    },
    {
        "BeCl 2 ": "Beryllium Chloride"
    },
    {
        " and ": null
    },
    {
        "BeBr 2 ": "Beryllium Bromide"
    },
    {
        " have chain structures with edge-shared tetrahedra. ": null
    },
    {
        "Beryllium oxide": "Beryllium Oxide"
    },
    {
        ", BeO, is a white ": null
    },
    {
        "refractory": "Refractory"
    },
    {
        " solid, which has the ": null
    },
    {
        "wurtzite": "Zinc Sulfide"
    },
    {
        " crystal structure and a thermal conductivity as high as in some metals. BeO is ": null
    },
    {
        "amphoteric": "Amphoteric"
    },
    {
        ". Beryllium ": null
    },
    {
        "sulfide": "Sulfide"
    },
    {
        ", ": null
    },
    {
        "selenide": "Selenide"
    },
    {
        " and ": null
    },
    {
        "telluride": "Telluride"
    },
    {
        " are known, all having the ": null
    },
    {
        "zincblende structure": "Cubic Crystal Systemzincblende Structure"
    },
    {
        ".  ": null
    },
    {
        "Beryllium nitride": "Beryllium Nitride"
    },
    {
        ", Be 3 N 2 is a high-melting-point compound which is readily hydrolyzed. Beryllium azide, BeN 6 is known and beryllium phosphide, Be 3 P 2 has a similar structure to Be 3 N 2 . A number of beryllium ": null
    },
    {
        "borides": "Boride"
    },
    {
        "are known, such as Be 5 B, Be 4 B, Be 2 B, BeB 2 , BeB 6 and BeB 12 . ": null
    },
    {
        "Beryllium carbide": "Beryllium Carbide"
    },
    {
        ", Be 2 C, is a refractory brick-red compound that reacts with water to give ": null
    },
    {
        "methane": "Methane"
    },
    {
        ". No beryllium ": null
    },
    {
        "silicide": "Silicide"
    },
    {
        " has been identified.     The halides BeX 2 have a linear monomeric molecular structure in the gas phase. Complexes of the halides are formed with one or more ligands donating at total of two pairs of electrons. Such compounds obey the ": null
    },
    {
        "octet rule": "Octet Rule"
    },
    {
        ". Other 4-coordinate complexes such as the aqua-ion 2+ also obey the octet rule.     Solutions of beryllium salts, such as ": null
    },
    {
        "beryllium sulfate": "Beryllium Sulfate"
    },
    {
        " and ": null
    },
    {
        "beryllium nitrate": "Beryllium Nitrate"
    },
    {
        ", are acidic because of hydrolysis of the 2+ ion. The concentration of the first hydrolysis product, + , is less than 1% of the beryllium concentration. The most stable hydrolysis product is the ": null
    },
    {
        "trimeric": "Trimer"
    },
    {
        " ion 3+ . ": null
    },
    {
        "Beryllium hydroxide": "Beryllium Hydroxide"
    },
    {
        ", Be 2 , is insoluble in water at pH 5 or more. Consequently, beryllium compounds are generally insoluble at biological pH. Because of this, inhalation of beryllium metal dust by people leads to the development of the fatal condition of ": null
    },
    {
        "berylliosis": "Berylliosis"
    },
    {
        ". Be 2 dissolves in strongly ": null
    },
    {
        "alkaline": "Alkalinity"
    },
    {
        " solutions. In ": null
    },
    {
        "basic beryllium acetate": "Basic Beryllium Acetate"
    },
    {
        " the central oxygen atom is surrounded by a tetrahedron of beryllium atoms. ": null
    },
    {
        "Beryllium difluoride": "Beryllium Difluoride"
    },
    {
        ", unlike the other alkaline earth difluorides, is very soluble in water,.  Aqueous solutions of this salt contain ions such as + .     Beryllium hydroxide reacts with ": null
    },
    {
        "ammonium bifluoride": "Ammonium Bifluoride"
    },
    {
        " to form the ammonium salt of the tetrafluoroberyllate complex, BeF 4 2– .       Organoberyllium chemistry is limited to academic research due to the cost and toxicity of beryllium, beryllium derivatives and reagents required for the introduction of beryllium, such as ": null
    },
    {
        "beryllium chloride": "Beryllium Chloride"
    },
    {
        ". Organometallic beryllium compounds are known to be highly reactive Off the Beaten Track—A Hitchhikers Guide to Beryllium Chemistry D. Naglav, M. R. Buchner, G. Bendt, F. Kraus, S. Schulz, Angew. Chem. Int. Ed. 2016, 55, 10562.  Examples of known organoberyllium compounds are dineopentylberyllium,  beryllocene ,     diallylberyllium ,  bisberyllium  and Be2. Synthesis and structural characterization of the beryllium compounds and cntdot.PhMe and determination of the structure of BeCl22 Karin Ruhlandt-Senge, Ruth A. Bartlett, Marilyn M. Olmstead, and Philip P. Power Inorganic Chemistry 1993 32 , 1724-1728  Ligands can also be aryls  and alkynyls.        The mineral ": null
    },
    {
        "beryl": "Beryl"
    },
    {
        ", which contains beryllium, has been used at least since the ": null
    },
    {
        "Ptolemaic dynasty": "Ptolemaic Dynasty"
    },
    {
        " of Egypt. In the first century ": null
    },
    {
        "CE": "Common Era"
    },
    {
        ", Roman naturalist ": null
    },
    {
        "Pliny the Elder": "Pliny The Elder"
    },
    {
        " mentioned in his encyclopedia  Natural History  that beryl and ": null
    },
    {
        "emerald": "Emerald"
    },
    {
        " were similar. The ": null
    },
    {
        "Papyrus Graecus Holmiensis": "Papyrus Graecus Holmiensis"
    },
    {
        ", written in the third or fourth century CE, contains notes on how to prepare artificial emerald and beryl.        Early analyses of emeralds and beryls by ": null
    },
    {
        "Martin Heinrich Klaproth": "Martin Heinrich Klaproth"
    },
    {
        ", ": null
    },
    {
        "Torbern Olof Bergman": "Torbern Olof Bergman"
    },
    {
        ", ": null
    },
    {
        "Franz Karl Achard": "Franz Karl Achard"
    },
    {
        ", and Johann Jakob Bindheim always yielded similar elements, leading to the fallacious conclusion that both substances are ": null
    },
    {
        "aluminium silicate": "Aluminium Silicate"
    },
    {
        "s. Mineralogist ": null
    },
    {
        "René Just Haüy": "René Just Haüy"
    },
    {
        " discovered that both crystals are geometrically identical, and he asked chemist ": null
    },
    {
        "Louis-Nicolas Vauquelin": "Louis-Nicolas Vauquelin"
    },
    {
        " for a chemical analysis.     In a 1798 paper read before the ": null
    },
    {
        "Institut de France": "Institut De France"
    },
    {
        ", Vauquelin reported that he found a new earth by dissolving ": null
    },
    {
        "aluminium hydroxide": "Aluminium Hydroxide"
    },
    {
        " from emerald and beryl in an additional ": null
    },
    {
        "alkali": "Alkali"
    },
    {
        ".  The editors of the journal Annales de Chimie et de Physique named the new earth glucine for the sweet taste of some of its compounds. In a footnote on  of , the editors write: La propriété la plus caractéristique de cette terre, confirmée par les dernières expériences de notre collègue, étant de former des sels dune saveur sucrée, nous proposons de lappeler glucine, de γλυχυς, doux, γλυχύ, vin doux, γλυχαιτω, rendre doux … Note des Rédacteurs.  Klaproth preferred the name beryllina due to the fact that ": null
    },
    {
        "yttria": "Yttria"
    },
    {
        " also formed sweet salts. Klaproth, Martin Heinrich, Beitrage zur Chemischen Kenntniss der Mineralkörper , vol. 3, , : Als Vauquelin der von ihm im Beryll und Smaragd entdeckten neuen Erde, wegen ihrer Eigenschaft, süsse Mittelsalze zu bilden, den Namen Glykine, Süsserde, beilegte, erwartete er wohl nicht, dass sich bald nachher eine anderweitige Erde finden würde, welche mit völlig gleichem Rechte Anspruch an diesen Namen machen können. Um daher keine Verwechselung derselben mit der Yttererde zu veranlassen, würde es vielleicht gerathen seyn, jenen Namen Glykine aufzugeben, und durch Beryllerde  zu ersetzen; welche Namensveränderung auch bereits vom Hrn. Prof. Link, und zwar aus dem Grunde empfohlen worden, weil schon ein Pflanzengeschlecht Glycine vorhanden ist.   The name beryllium was first used by Wöhler in 1828.         ": null
    },
    {
        "Friedrich Wöhler": "Friedrich Wöhler"
    },
    {
        "  and ": null
    },
    {
        "Antoine Bussy": "Antoine Bussy"
    },
    {
        "  independently isolated beryllium in 1828 by the ": null
    },
    {
        "chemical reaction": "Chemical Reaction"
    },
    {
        " of metallic ": null
    },
    {
        "potassium": "Potassium"
    },
    {
        " with ": null
    },
    {
        "beryllium chloride": "Beryllium Chloride"
    },
    {
        ", as follows:   :BeCl 2 + 2 K → 2 KCl + Be   Using an alcohol lamp, Wöhler heated alternating layers of beryllium chloride and potassium in a wired-shut platinum crucible. The above reaction immediately took place and caused the crucible to become white hot. Upon cooling and washing the resulting gray-black powder he saw that it was made of fine particles with a dark metallic luster. The highly reactive potassium had been produced by the ": null
    },
    {
        "electrolysis": "Electrolysis"
    },
    {
        " of its compounds, a process discovered 21 years before. The chemical method using potassium yielded only small grains of beryllium from which no ingot of metal could be cast or hammered.     The direct electrolysis of a molten mixture of ": null
    },
    {
        "beryllium fluoride": "Beryllium Fluoride"
    },
    {
        " and ": null
    },
    {
        "sodium fluoride": "Sodium Fluoride"
    },
    {
        " by ": null
    },
    {
        "Paul Lebeau": "Paul Lebeau"
    },
    {
        " in 1898 resulted in the first pure samples of beryllium. However, industrial production started only after the First World War. The original industrial involvement included subsidiaries and scientists related to the Union Carbide and Carbon Corporation in Cleveland OH and Siemens & Halske AG in Berlin. In the US, the process was ruled by Hugh S. Cooper, director of The Kemet Laboratories Company. In Germany, the first commercially successful process for producing beryllium was developed in 1921 by ": null
    },
    {
        "Alfred Stock": "Alfred Stock"
    },
    {
        " and ": null
    },
    {
        "Hans Goldschmidt": "Hans Goldschmidt"
    },
    {
        ".      A sample of beryllium was bombarded with ": null
    },
    {
        "alpha rays": "Alpha Ray"
    },
    {
        "from the decay of ": null
    },
    {
        "radium": "Radium"
    },
    {
        " in a 1932 experiment by ": null
    },
    {
        "James Chadwick": "James Chadwick"
    },
    {
        " that uncovered the existence of the ": null
    },
    {
        "neutron": "Neutron"
    },
    {
        ". This same method is used in one class of radioisotope-based laboratory ": null
    },
    {
        "neutron sources": "Neutron Source"
    },
    {
        "that produce 30 neutrons for every million α particles.     Beryllium production saw a rapid increase during World War II, due to the rising demand for hard beryllium-copper alloys and ": null
    },
    {
        "phosphors": "Phosphor"
    },
    {
        "for ": null
    },
    {
        "fluorescent light": "Fluorescent Light"
    },
    {
        "s. Most early fluorescent lamps used ": null
    },
    {
        "zinc orthosilicate": "Zinc Orthosilicate"
    },
    {
        " with varying content of beryllium to emit greenish light. Small additions of magnesium ": null
    },
    {
        "tungstate": "Tungstate"
    },
    {
        " improved the blue part of the spectrum to yield an acceptable white light. Halophosphate-based phosphors replaced beryllium-based phosphors after beryllium was found to be toxic.      Electrolysis of a mixture of ": null
    },
    {
        "beryllium fluoride": "Beryllium Fluoride"
    },
    {
        " and ": null
    },
    {
        "sodium fluoride": "Sodium Fluoride"
    },
    {
        " was used to isolate beryllium during the 19th century. The metals high melting point makes this process more energy-consuming than corresponding processes used for the ": null
    },
    {
        "alkali metals": "Alkali Metals"
    },
    {
        ". Early in the 20th century, the production of beryllium by the thermal decomposition of ": null
    },
    {
        "beryllium iodide": "Beryllium Iodide"
    },
    {
        " was investigated following the success of a similar process for the production of ": null
    },
    {
        "zirconium": "Zirconium"
    },
    {
        ", but this process proved to be uneconomical for volume production.      Pure beryllium metal did not become readily available until 1957, even though it had been used as an alloying metal to harden and toughen copper much earlier. Beryllium could be produced by reducing beryllium compounds such as ": null
    },
    {
        "beryllium chloride": "Beryllium Chloride"
    },
    {
        " with metallic potassium or sodium. Currently, most beryllium is produced by reducing beryllium fluoride with ": null
    },
    {
        "magnesium": "Magnesium"
    },
    {
        ".  The price on the American market for ": null
    },
    {
        "vacuum-cast": "Casting"
    },
    {
        " beryllium ingots was about $338 per pound in 2001.      Between 1998 and 2008, the worlds production of beryllium had decreased from 343 to about 200 ": null
    },
    {
        "tonne": "Tonne"
    },
    {
        "s, of which 176 tonnes came from the United States.         Early precursors of the word beryllium can be traced to many languages, including ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " ; ": null
    },
    {
        "French": "French Language"
    },
    {
        " ; ": null
    },
    {
        "Ancient Greek": "Ancient Greek Language"
    },
    {
        " , , beryl; ": null
    },
    {
        "Prakrit": "Prakrit"
    },
    {
        "  ; ": null
    },
    {
        "Pāli": "Pāli"
    },
    {
        "  ,   or   – to become pale , in reference to the pale semiprecious gemstone beryl. The original source is probably the ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " word  , which is of ": null
    },
    {
        "South Indian": "Dravidian Languages"
    },
    {
        " origin and could be related to the name of the modern city of ": null
    },
    {
        "Belur": "Belur, Karnataka"
    },
    {
        ".  For about 160 years, beryllium was also known as  glucinum or glucinium , the name coming from the Ancient Greek word for sweet: , due to the sweet taste of beryllium ": null
    },
    {
        "salts": "Salt"
    },
    {
        ".                  Because of its low atomic number and very low absorption for X-rays, the oldest and still one of the most important applications of beryllium is in radiation windows for ": null
    },
    {
        "X-ray tube": "X-Ray Tube"
    },
    {
        "s. Extreme demands are placed on purity and cleanliness of beryllium to avoid artifacts in the X-ray images. Thin beryllium foils are used as radiation windows for X-ray detectors, and the extremely low absorption minimizes the heating effects caused by high intensity, low energy X-rays typical of ": null
    },
    {
        "synchrotron": "Synchrotron"
    },
    {
        " radiation. Vacuum-tight windows and beam-tubes for radiation experiments on synchrotrons are manufactured exclusively from beryllium. In scientific setups for various X-ray emission studies  the sample holder is usually made of beryllium because its emitted X-rays have much lower energies than X-rays from most studied materials.     Low ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " also makes beryllium relatively transparent to energetic ": null
    },
    {
        "particles": "Elementary Particle"
    },
    {
        ". Therefore, it is used to build the ": null
    },
    {
        "beam pipe": "Beamline"
    },
    {
        " around the collision region in ": null
    },
    {
        "particle physics": "Particle Physics"
    },
    {
        " setups, such as all four main detector experiments at the ": null
    },
    {
        "Large Hadron Collider": "Large Hadron Collider"
    },
    {
        " ,  the ": null
    },
    {
        "Tevatron": "Tevatron"
    },
    {
        " and the ": null
    },
    {
        "SLAC": "Slac"
    },
    {
        ". The low density of beryllium allows collision products to reach the surrounding detectors without significant interaction, its stiffness allows a powerful vacuum to be produced within the pipe to minimize interaction with gases, its thermal stability allows it to function correctly at temperatures of only a few degrees above ": null
    },
    {
        "absolute zero": "Absolute Zero"
    },
    {
        ", and its ": null
    },
    {
        "diamagnetic": "Diamagnetic"
    },
    {
        " nature keeps it from interfering with the complex multipole magnet systems used to steer and ": null
    },
    {
        "focus": "Strong Focusing"
    },
    {
        " the ": null
    },
    {
        "particle beam": "Particle Beam"
    },
    {
        "s.        Because of its stiffness, light weight and dimensional stability over a wide temperature range, beryllium metal is used for lightweight structural components in the defense and ": null
    },
    {
        "aerospace": "Aerospace"
    },
    {
        " industries in high-speed ": null
    },
    {
        "aircraft": "Aircraft"
    },
    {
        ", ": null
    },
    {
        "guided missile": "Guided Missile"
    },
    {
        "s, ": null
    },
    {
        "spacecraft": "Spacecraft"
    },
    {
        ", and ": null
    },
    {
        "satellite": "Satellite"
    },
    {
        "s, including the ": null
    },
    {
        "James Webb telescope": "James Webb Telescope"
    },
    {
        ". Several ": null
    },
    {
        "liquid-fuel rockets": "Liquid-Fuel Rocket"
    },
    {
        "have used ": null
    },
    {
        "rocket nozzles": "Rocket Engine Nozzle"
    },
    {
        " made of pure beryllium.   Beryllium powder was itself studied as a ": null
    },
    {
        "rocket fuel": "Rocket Fuel"
    },
    {
        ", but this use has never materialized. A small number of extreme high-end ": null
    },
    {
        "bicycle frames": "Bicycle Frame"
    },
    {
        "have been built with beryllium.  From 1998 to 2000, the ": null
    },
    {
        "McLaren": "Mclaren"
    },
    {
        " Formula One": "Formula One"
    },
    {
        " team used ": null
    },
    {
        "Mercedes-Benz": "Mercedes-Benz"
    },
    {
        " engines with beryllium-aluminium-": null
    },
    {
        "alloy": "Alloy"
    },
    {
        " pistons.  The use of beryllium engine components was banned following a protest by ": null
    },
    {
        "Scuderia Ferrari": "Scuderia Ferrari"
    },
    {
        ".      Mixing about 2.0% beryllium into ": null
    },
    {
        "copper": "Copper"
    },
    {
        " forms an ": null
    },
    {
        "alloy": "Alloy"
    },
    {
        " called ": null
    },
    {
        "beryllium copper": "Beryllium Copper"
    },
    {
        " that is six times stronger than copper alone.  Beryllium alloys are used in many applications because of their combination of elasticity, high ": null
    },
    {
        "electrical conductivity": "Electrical Conductivity"
    },
    {
        " and ": null
    },
    {
        "thermal conductivity": "Thermal Conductivity"
    },
    {
        ", high strength and ": null
    },
    {
        "hardness": "Hardness"
    },
    {
        ", nonmagnetic properties, as well as good ": null
    },
    {
        "corrosion": "Corrosion"
    },
    {
        " and ": null
    },
    {
        "fatigue resistance": "Fatigue"
    },
    {
        ". These applications include  non-sparking tools that are used near flammable gases , in ": null
    },
    {
        "springs": "Spring"
    },
    {
        " and membranes  used in surgical instruments and high temperature devices  . As little as 50 parts per million of beryllium alloyed with liquid ": null
    },
    {
        "magnesium": "Magnesium"
    },
    {
        " leads to a significant increase in oxidation resistance and decrease in flammability.        The high elastic stiffness of beryllium has led to its extensive use in precision instrumentation, e.g. in ": null
    },
    {
        "inertial guidance": "Inertial Guidance"
    },
    {
        " systems and in the support mechanisms for optical systems. Beryllium-copper alloys were also applied as a hardening agent in Jason pistols , which were used to strip the paint from the hulls of ships.      Beryllium was also used for cantilevers in high performance phonograph cartridge styli, where its extreme stiffness and low density allowed for tracking weights to be reduced to 1 gram, yet still track high frequency passages with minimal distortion. Shure V15VxMR users guide, Page 2     An earlier major application of beryllium was in ": null
    },
    {
        "brakes": "Brake"
    },
    {
        "for military ": null
    },
    {
        "airplanes": "Airplane"
    },
    {
        "because of its hardness, high melting point, and exceptional ability to ": null
    },
    {
        "dissipate heat": "Heat Dissipation"
    },
    {
        ". Environmental considerations have led to substitution by other materials.     To reduce costs, beryllium can be ": null
    },
    {
        "alloy": "Alloy"
    },
    {
        "ed with significant amounts of ": null
    },
    {
        "aluminium": "Aluminium"
    },
    {
        ", resulting in the ": null
    },
    {
        "AlBeMet": "Albemet"
    },
    {
        " alloy . This blend is cheaper than pure beryllium, while still retaining many desirable properties.       Beryllium ": null
    },
    {
        "mirrors": "Mirror"
    },
    {
        "are of particular interest. Large-area mirrors, frequently with a ": null
    },
    {
        "honeycomb support structure": "Honeycomb Mirror"
    },
    {
        ", are used, for example, in ": null
    },
    {
        "meteorological satellites": "Meteorological Satellite"
    },
    {
        "where low weight and long-term dimensional stability are critical. Smaller beryllium mirrors are used in ": null
    },
    {
        "optical guidance": "Control System"
    },
    {
        " systems and in ": null
    },
    {
        "fire-control system": "Fire-Control System"
    },
    {
        "s, e.g. in the German-made ": null
    },
    {
        "Leopard 1": "Leopard 1"
    },
    {
        " and ": null
    },
    {
        "Leopard 2": "Leopard 2"
    },
    {
        " main battle tank": "Main Battle Tank"
    },
    {
        "s. In these systems, very rapid movement of the mirror is required which again dictates low mass and high rigidity. Usually the beryllium mirror is coated with hard ": null
    },
    {
        "electroless nickel plating": "Electroless Nickel Plating"
    },
    {
        " which can be more easily polished to a finer optical finish than beryllium. In some applications, though, the beryllium blank is polished without any coating. This is particularly applicable to ": null
    },
    {
        "cryogenic": "Cryogenic"
    },
    {
        " operation where thermal expansion mismatch can cause the coating to buckle.     The ": null
    },
    {
        "James Webb Space Telescope": "James Webb Space Telescope"
    },
    {
        "  will have 18 hexagonal beryllium sections for its mirrors. Because JWST will face a temperature of 33 K, the mirror is made of gold-plated beryllium, capable of handling extreme cold better than glass. Beryllium contracts and deforms less than glass – and remains more uniform – in such temperatures.  For the same reason, the optics of the ": null
    },
    {
        "Spitzer Space Telescope": "Spitzer Space Telescope"
    },
    {
        " are entirely built of beryllium metal.             Beryllium is non-magnetic. Therefore, tools fabricated out of beryllium-based materials are used by naval or military ": null
    },
    {
        "explosive ordnance disposal": "Explosive Ordnance Disposal"
    },
    {
        " teams for work on or near ": null
    },
    {
        "naval mine": "Naval Mine"
    },
    {
        "s, since these mines commonly have ": null
    },
    {
        "magnetic fuzes": "Fuze"
    },
    {
        ".  They are also found in maintenance and construction materials near ": null
    },
    {
        "magnetic resonance imaging": "Magnetic Resonance Imaging"
    },
    {
        " machines because of the high magnetic fields generated.  In the fields of ": null
    },
    {
        "radio communications": "Radio Communication"
    },
    {
        "and powerful ": null
    },
    {
        "radar": "Radar"
    },
    {
        "s, hand tools made of beryllium are used to tune the highly magnetic ": null
    },
    {
        "klystron": "Klystron"
    },
    {
        "s, ": null
    },
    {
        "magnetron": "Magnetron"
    },
    {
        "s, ": null
    },
    {
        "traveling wave tube": "Traveling Wave Tube"
    },
    {
        "s, etc., that are used for generating high levels of ": null
    },
    {
        "microwave": "Microwave"
    },
    {
        " power in the ": null
    },
    {
        "transmitter": "Transmitter"
    },
    {
        "s.        Thin plates or foils of beryllium are sometimes used in ": null
    },
    {
        "nuclear weapon designs": "Nuclear Weapon Design"
    },
    {
        "as the very outer layer of the ": null
    },
    {
        "plutonium pits": "Plutonium Pit"
    },
    {
        "in the primary stages of ": null
    },
    {
        "thermonuclear bomb": "Thermonuclear Bomb"
    },
    {
        "s, placed to surround the ": null
    },
    {
        "fissile": "Fissile"
    },
    {
        " material. These layers of beryllium are good pushers for the ": null
    },
    {
        "implosion": "Implosion"
    },
    {
        " of the ": null
    },
    {
        "plutonium-239": "Plutonium-239"
    },
    {
        ", and they are good ": null
    },
    {
        "neutron reflector": "Neutron Reflector"
    },
    {
        "s, just as in beryllium-moderated ": null
    },
    {
        "nuclear reactors": "Nuclear Reactors"
    },
    {
        ".     Beryllium is also commonly used in some ": null
    },
    {
        "neutron sources": "Neutron Source"
    },
    {
        "in laboratory devices in which relatively few neutrons are needed . For this purpose, a target of beryllium-9 is bombarded with energetic alpha particles from a ": null
    },
    {
        "radioisotope": "Radioisotope"
    },
    {
        " such as ": null
    },
    {
        "polonium": "Polonium"
    },
    {
        "-210, ": null
    },
    {
        "radium": "Radium"
    },
    {
        "-226, ": null
    },
    {
        "plutonium": "Plutonium"
    },
    {
        "-238, or ": null
    },
    {
        "americium": "Americium"
    },
    {
        "-241. In the nuclear reaction that occurs, a beryllium nucleus is ": null
    },
    {
        "transmuted": "Nuclear Transmutation"
    },
    {
        " into carbon-12, and one free neutron is emitted, traveling in about the same direction as the alpha particle was heading. Such ": null
    },
    {
        "alpha decay": "Alpha Decay"
    },
    {
        " driven beryllium neutron sources, named ": null
    },
    {
        " urchin ": "Modulated Neutron Initiator"
    },
    {
        " neutron initiators, were used in some early ": null
    },
    {
        "atomic bomb": "Atomic Bomb"
    },
    {
        "s.  Neutron sources in which beryllium is bombarded with ": null
    },
    {
        "gamma rays": "Gamma Ray"
    },
    {
        "from a ": null
    },
    {
        "gamma decay": "Gamma Decay"
    },
    {
        " radioisotope, are also used to produce laboratory neutrons. Byrne, J. Neutrons, Nuclei, and Matter, Dover Publications, Mineola, NY, 2011, , pp. 32–33.        Beryllium is also used in fuel fabrication for ": null
    },
    {
        "CANDU": "Candu"
    },
    {
        " reactors. The fuel elements have small appendages that are resistance brazed to the fuel cladding using an induction brazing process with Be as the braze filler material. Bearing pads are brazed in place to prevent fuel bundle to pressure tube contact, and inter-element spacer pads are brazed on to prevent element to element contact.     Beryllium is also used at the ": null
    },
    {
        "Joint European Torus": "Joint European Torus"
    },
    {
        " nuclear-fusion research laboratory": "Nuclear Fusion"
    },
    {
        ", and it will be used in the more advanced ": null
    },
    {
        "ITER": "Iter"
    },
    {
        " to condition the components which face the plasma.  Beryllium has also been proposed as a ": null
    },
    {
        "cladding": "Cladding"
    },
    {
        " material for ": null
    },
    {
        "nuclear fuel rod": "Nuclear Fuel Rod"
    },
    {
        "s, because of its good combination of mechanical, chemical, and nuclear properties. ": null
    },
    {
        "Beryllium fluoride": "Beryllium Fluoride"
    },
    {
        " is one of the constituent salts of the eutectic salt mixture ": null
    },
    {
        "FLiBe": "Flibe"
    },
    {
        ", which is used as a solvent, moderator and coolant in many hypothetical ": null
    },
    {
        "molten salt reactor": "Molten Salt Reactor"
    },
    {
        " designs, including the ": null
    },
    {
        "liquid fluoride thorium reactor": "Liquid Fluoride Thorium Reactor"
    },
    {
        " .        The low weight and high rigidity of beryllium make it useful as a material for high-frequency ": null
    },
    {
        "speaker driver": "Speaker Driver"
    },
    {
        "s. Because beryllium is expensive , hard to shape due to its brittleness, and toxic if mishandled, beryllium ": null
    },
    {
        "tweeters": "Tweeter"
    },
    {
        "are limited to high-end home,    ": null
    },
    {
        "pro audio": "Pro Audio"
    },
    {
        ", and ": null
    },
    {
        "public address": "Public Address"
    },
    {
        " applications.   Some high-fidelity products have been fraudulently claimed to be made of the material.      Some high-end ": null
    },
    {
        "phonograph cartridges": "Magnetic Cartridge"
    },
    {
        " used beryllium cantilevers to improve tracking by reducing mass.        Beryllium is a ": null
    },
    {
        "p-type": "P-Type Semiconductor"
    },
    {
        " dopant": "Dopant"
    },
    {
        " in ": null
    },
    {
        "III-V compound semiconductors": "List Of Semiconductor Materials"
    },
    {
        ". It is widely used in materials such as ": null
    },
    {
        "GaAs": "Gallium Arsenide"
    },
    {
        ", ": null
    },
    {
        "AlGaAs": "Algaas"
    },
    {
        ", ": null
    },
    {
        "InGaAs": "Ingaas"
    },
    {
        " and ": null
    },
    {
        "InAlAs": "Inalas"
    },
    {
        " grown by ": null
    },
    {
        "molecular beam epitaxy": "Molecular Beam Epitaxy"
    },
    {
        " .  Cross-rolled beryllium sheet is an excellent structural support for ": null
    },
    {
        "printed circuit boards": "Printed Circuit Board"
    },
    {
        "in ": null
    },
    {
        "surface-mount technology": "Surface-Mount Technology"
    },
    {
        ". In critical electronic applications, beryllium is both a structural support and ": null
    },
    {
        "heat sink": "Heat Sink"
    },
    {
        ". The application also requires a coefficient of ": null
    },
    {
        "thermal expansion": "Thermal Expansion"
    },
    {
        " that is well matched to the alumina and ": null
    },
    {
        "polyimide-glass": "Glass-Reinforced Plastic"
    },
    {
        " substrates": "Substrate"
    },
    {
        ". The beryllium-beryllium oxide ": null
    },
    {
        "composite": "Metal Matrix Composite"
    },
    {
        "E-Materials": "E-Material"
    },
    {
        " have been specially designed for these electronic applications and have the additional advantage that the thermal expansion coefficient can be tailored to match diverse substrate materials.     ": null
    },
    {
        "Beryllium oxide": "Beryllium Oxide"
    },
    {
        " is useful for many applications that require the combined properties of an ": null
    },
    {
        "electrical insulator": "Electrical Insulator"
    },
    {
        " and an excellent heat conductor, with high strength and hardness, and a very high melting point. Beryllium oxide is frequently used as an insulator base plate in ": null
    },
    {
        "high-power": "Power Semiconductor Device"
    },
    {
        "transistors": "Transistor"
    },
    {
        "in ": null
    },
    {
        "radio frequency": "Radio Frequency"
    },
    {
        "transmitters": "Transmitter"
    },
    {
        "for telecommunications. Beryllium oxide is also being studied for use in increasing the ": null
    },
    {
        "thermal conductivity": "Thermal Conductivity"
    },
    {
        " of ": null
    },
    {
        "uranium dioxide": "Uranium Dioxide"
    },
    {
        " nuclear fuel": "Nuclear Fuel"
    },
    {
        " pellets.  Beryllium compounds were used in ": null
    },
    {
        "fluorescent light": "Fluorescent Light"
    },
    {
        "ing tubes, but this use was discontinued because of the disease ": null
    },
    {
        "berylliosis": "Berylliosis"
    },
    {
        " which developed in the workers who were making the tubes.        Beryllium is a component of several ": null
    },
    {
        "dental alloys": "Dental Material"
    },
    {
        ". OSHA Hazard Information Bulletin HIB 02-04-19         Beryllium is a health and safety issue for workers. Exposure to beryllium in the workplace can lead to a sensitization immune response and can over time develop ": null
    },
    {
        "chronic beryllium disease": "Berylliosis"
    },
    {
        " .  The ": null
    },
    {
        "National Institute for Occupational Safety and Health": "National Institute For Occupational Safety And Health"
    },
    {
        " in the United States researches these effects in collaboration with a major manufacturer of beryllium products. The goal of this research is to prevent sensitization and CBD by developing a better understanding of the work processes and exposures that may present a potential risk for workers, and to develop effective interventions that will reduce the risk for adverse health effects. NIOSH also conducts genetic research on sensitization and CBD, independently of this collaboration. The NIOSH Manual of Analytical Methods contains methods for measuring occupational exposures to beryllium.                Approximately 35  micrograms of beryllium is found in the average human body, an amount not considered harmful. Beryllium is chemically similar to ": null
    },
    {
        "magnesium": "Magnesium"
    },
    {
        " and therefore can displace it from ": null
    },
    {
        "enzyme": "Enzyme"
    },
    {
        "s, which causes them to malfunction. Because Be 2+ is a highly charged and small ion, it can easily get into many tissues and cells, where it specifically targets cell nuclei, inhibiting many enzymes, including those used for synthesizing DNA. Its toxicity is exacerbated by the fact that the body has no means to control beryllium levels, and once inside the body the beryllium cannot be removed.  Chronic ": null
    },
    {
        "berylliosis": "Berylliosis"
    },
    {
        " is a ": null
    },
    {
        "pulmonary": "Pulmonary"
    },
    {
        " and ": null
    },
    {
        "systemic": "Systemic Circulation"
    },
    {
        " granuloma": "Granuloma"
    },
    {
        "tous disease caused by inhalation of dust or fumes contaminated with beryllium; either large amounts over a short time or small amounts over a long time can lead to this ailment. Symptoms of the disease can take up to five years to develop; about a third of patients with it die and the survivors are left disabled. The ": null
    },
    {
        "International Agency for Research on Cancer": "International Agency For Research On Cancer"
    },
    {
        " lists beryllium and beryllium compounds as ": null
    },
    {
        "Category 1 carcinogens": "List Of Iarc Group 1 Carcinogens"
    },
    {
        ".  In the US, the ": null
    },
    {
        "Occupational Safety and Health Administration": "Occupational Safety And Health Administration"
    },
    {
        " has designated a ": null
    },
    {
        "permissible exposure limit": "Permissible Exposure Limit"
    },
    {
        " in the workplace with a time-weighted average 2  µg/m 3 and a constant exposure limit of 5  µg/m 3 over 30 minutes, with a maximum peak limit of 25  µg/m 3 . The ": null
    },
    {
        "National Institute for Occupational Safety and Health": "National Institute For Occupational Safety And Health"
    },
    {
        " has set a ": null
    },
    {
        "recommended exposure limit": "Recommended Exposure Limit"
    },
    {
        " of constant 500  ng/m 3 . The ": null
    },
    {
        "IDLH": "Idlh"
    },
    {
        " value is 4  mg/m 3 .      The toxicity of finely divided beryllium is very well-documented. Solid beryllium metal does not carry the same hazards as airborne inhaled dust, but any hazard associated with physical contact is poorly documented. Workers handling finished beryllium pieces are routinely advised to handle them with gloves, both as a precaution and because many if not most applications of beryllium cannot tolerate residue of skin contact such as fingerprints.     Acute beryllium disease in the form of ": null
    },
    {
        "chemical pneumonitis": "Chemical Pneumonitis"
    },
    {
        " was first reported in Europe in 1933 and in the United States in 1943. A survey found that about 5% of workers in plants manufacturing ": null
    },
    {
        "fluorescent lamps": "Fluorescent Lamp"
    },
    {
        "in 1949 in the United States had beryllium-related lung diseases. Chronic berylliosis resembles ": null
    },
    {
        "sarcoidosis": "Sarcoidosis"
    },
    {
        " in many respects, and the ": null
    },
    {
        "differential diagnosis": "Differential Diagnosis"
    },
    {
        " is often difficult. It killed some early workers in nuclear weapons design, such as ": null
    },
    {
        "Herbert L. Anderson": "Herbert L. Anderson"
    },
    {
        ".      Beryllium may be found in coal slag. When the slag is formulated into an abrasive agent for blasting paint and rust from hard surfaces, the beryllium can become airborne and become a source of exposure. , ": null
    },
    {
        "Daily Press ": "Daily Press"
    },
    {
        ", Michael Welles Shapiro, 31 August 2013     Early researchers tasted beryllium and its various compounds for sweetness in order to verify its presence. Modern diagnostic equipment no longer necessitates this highly risky procedure and no attempt should be made to ingest this highly toxic substance. Beryllium and its compounds should be handled with great care and special precautions must be taken when carrying out any activity which could result in the release of beryllium dust . Although the use of beryllium compounds in fluorescent lighting tubes was discontinued in 1949, potential for exposure to beryllium exists in the nuclear and aerospace industries and in the refining of beryllium metal and melting of beryllium-containing alloys, the manufacturing of electronic devices, and the handling of other beryllium-containing material.      A successful test for beryllium in air and on surfaces has been recently developed and published as an international voluntary consensus standard ASTM D7202. The procedure uses dilute ": null
    },
    {
        "ammonium bifluoride": "Ammonium Bifluoride"
    },
    {
        " for dissolution and fluorescence detection with beryllium bound to sulfonated hydroxybenzoquinoline, allowing up to 100 times more sensitive detection than the recommended limit for beryllium concentration in the workplace. Fluorescence increases with increasing beryllium concentration. The new procedure has been successfully tested on a variety of surfaces and is effective for the dissolution and ultratrace detection of refractory beryllium oxide and siliceous beryllium .         ": null
    }
]