[
    {
        "   In ": null
    },
    {
        "nuclear physics": "nuclear physics"
    },
    {
        ", beta decay  is a type of ": null
    },
    {
        "radioactive decay": "radioactive decay"
    },
    {
        " in which a ": null
    },
    {
        "beta particle": "beta particle"
    },
    {
        "  is emitted from an ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        ", transforming the original ": null
    },
    {
        "nuclide": "nuclide"
    },
    {
        " to an ": null
    },
    {
        "isobar": "isobar"
    },
    {
        ". For example, beta decay of a ": null
    },
    {
        "neutron": "neutron"
    },
    {
        " transforms it into a ": null
    },
    {
        "proton": "proton"
    },
    {
        " by the emission of an electron accompanied by an ": null
    },
    {
        "antineutrino": "antineutrino"
    },
    {
        "; or, conversely a proton is converted into a neutron by the emission of a positron with a ": null
    },
    {
        "neutrino": "neutrino"
    },
    {
        " in so-called  positron emission . Neither the beta particle nor its associated neutrino exist within the nucleus prior to beta decay, but are created in the decay process. By this process, unstable atoms obtain a more stable ": null
    },
    {
        "ratio of protons to neutrons": "proton–neutron ratio"
    },
    {
        ". The probability of a nuclide decaying due to beta and other forms of decay is determined by its ": null
    },
    {
        "nuclear binding energy": "nuclear binding energy"
    },
    {
        ". The binding energies of all existing nuclides form what is called the nuclear band or ": null
    },
    {
        "valley of stability": "valley of stability"
    },
    {
        ".    For either electron or positron emission to be energetically possible, the energy release  or ": null
    },
    {
        "Q value": "q value"
    },
    {
        " must be positive.     Beta decay is a consequence of the ": null
    },
    {
        "weak force": "weak interaction"
    },
    {
        ", which is characterized by relatively lengthy decay times. Nucleons are composed of ": null
    },
    {
        "up quarks": "up quark"
    },
    {
        "and ": null
    },
    {
        "down quark": "down quark"
    },
    {
        "s,    and the weak force allows a ": null
    },
    {
        "quark": "quark"
    },
    {
        " to change its ": null
    },
    {
        "flavour": "flavour"
    },
    {
        " by emission of a ": null
    },
    {
        "W boson": "w boson"
    },
    {
        " leading to creation of an electron/antineutrino or positron/neutrino pair. For example, a neutron, composed of two down quarks and an up quark, decays to a proton composed of a down quark and two up quarks.     ": null
    },
    {
        "Electron capture": "electron capture"
    },
    {
        " is sometimes included as a type of beta decay,    because the basic nuclear process, mediated by the weak force, is the same. In electron capture, an inner atomic electron is captured by a proton in the nucleus, transforming it into a neutron, and an electron neutrino is released.       The two types of beta decay are known as beta minus and beta plus. In beta minus decay, a neutron is converted to a proton, and the process creates an electron and an ": null
    },
    {
        "electron antineutrino": "electron antineutrino"
    },
    {
        "; while in beta plus decay, a proton is converted to a neutron and the process creates a positron and an electron neutrino. β + decay is also known as ": null
    },
    {
        "positron emission": "positron emission"
    },
    {
        ".        Beta decay conserves a quantum number known as the ": null
    },
    {
        "lepton number": "lepton number"
    },
    {
        ", or the number of electrons and their associated neutrinos . These particles have lepton number +1, while their antiparticles have lepton number −1. Since a proton or neutron has lepton number zero, β + decay must be accompanied with an electron neutrino, while β − decay must be accompanied by an electron antineutrino.     An example of electron emission is the decay of ": null
    },
    {
        "carbon-14": "carbon-14"
    },
    {
        " into ": null
    },
    {
        "nitrogen-14": "nitrogen-14"
    },
    {
        " with a ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " of about 5,730 years:   : →  +  +      In this form of decay, the original element becomes a new chemical element in a process known as ": null
    },
    {
        "nuclear transmutation": "nuclear transmutation"
    },
    {
        ". This new element has an unchanged ": null
    },
    {
        "mass number": "mass number"
    },
    {
        " , but an ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        "  that is increased by one. As in all nuclear decays, the decaying element  is known as the parent nuclide while the resulting element  is known as the daughter nuclide.     Another example is the decay of hydrogen-3  into ": null
    },
    {
        "helium-3": "helium-3"
    },
    {
        " with a half-life of about 12.3 years:   : →  +  +      An example of positron emission is the decay of ": null
    },
    {
        "magnesium-23": "magnesium-23"
    },
    {
        " into ": null
    },
    {
        "sodium-23": "sodium-23"
    },
    {
        " with a half-life of about 11.3 s:     : →  +  +    β + decay also results in nuclear transmutation, with the resulting element having an atomic number that is decreased by one.        The beta spectrum, or distribution of energy values for the beta particles, is continuous. The total energy of the decay process is divided between the electron, the antineutrino, and the recoiling nuclide. In the figure to the right, an example of an electron with 0.40 MeV energy from the beta decay of 210 Bi is shown. In this example, the total decay energy is 1.16 MeV, so the antineutrino has the remaining energy: 1.16 MeV − 0.40 MeV 0.76 MeV. An electron at the far right of the curve would have the maximum possible kinetic energy, leaving the energy of the neutrino to be only its small rest mass.           Radioactivity was discovered in 1896 by ": null
    },
    {
        "Henri Becquerel": "henri becquerel"
    },
    {
        " in ": null
    },
    {
        "uranium": "uranium"
    },
    {
        ", and subsequently observed by ": null
    },
    {
        "Marie": "marie curie"
    },
    {
        " and ": null
    },
    {
        "Pierre Curie": "pierre curie"
    },
    {
        " in ": null
    },
    {
        "thorium": "thorium"
    },
    {
        " and in the new elements ": null
    },
    {
        "polonium": "polonium"
    },
    {
        " and ": null
    },
    {
        "radium": "radium"
    },
    {
        ". In 1899, ": null
    },
    {
        "Ernest Rutherford": "ernest rutherford"
    },
    {
        " separated radioactive emissions into two types: alpha and beta , based on penetration of objects and ability to cause ionization. Alpha rays could be stopped by thin sheets of paper or aluminium, whereas beta rays could penetrate several millimetres of aluminium. In 1900, ": null
    },
    {
        "Paul Villard": "paul villard"
    },
    {
        " identified a still more penetrating type of radiation, which Rutherford identified as a fundamentally new type in 1903 and termed ": null
    },
    {
        "gamma ray": "gamma ray"
    },
    {
        "s. Alpha, beta, and gamma are the first three letters of the ": null
    },
    {
        "Greek alphabet": "greek alphabet"
    },
    {
        ".     In 1900, Becquerel measured the ": null
    },
    {
        "mass-to-charge ratio": "mass-to-charge ratio"
    },
    {
        "  for beta particles by the method of ": null
    },
    {
        "J.J.  Thomson": "j.j. & nbsp;thomson"
    },
    {
        " used to study cathode rays and identify the electron. He found that  for a beta particle is the same as for Thomsons electron, and therefore suggested that the beta particle is in fact an electron.      In 1901, Rutherford and ": null
    },
    {
        "Frederick Soddy": "frederick soddy"
    },
    {
        " showed that alpha and beta radioactivity involves the ": null
    },
    {
        "transmutation": "nuclear transmutation"
    },
    {
        " of atoms into atoms of other chemical elements. In 1913, after the products of more radioactive decays were known, Soddy and ": null
    },
    {
        "Kazimierz Fajans": "kazimierz fajans"
    },
    {
        " independently proposed their ": null
    },
    {
        "radioactive displacement law": "radioactive displacement law of fajans and soddy"
    },
    {
        ", which states that beta   emission from one element produces another element one place to the right in the ": null
    },
    {
        "periodic table": "periodic table"
    },
    {
        ", while alpha emission produces an element two places to the left.         The study of beta decay provided the first physical evidence for the existence of the ": null
    },
    {
        "neutrino": "neutrino"
    },
    {
        ". In both alpha and gamma decay, the resulting alpha or gamma particle has a narrow energy ": null
    },
    {
        "distribution": "frequency distribution"
    },
    {
        ", since the particle carries the energy from the difference between the initial and final nuclear states. However, the kinetic energy distribution, or spectrum, of beta particles measured by ": null
    },
    {
        "Lise Meitner": "lise meitner"
    },
    {
        " and ": null
    },
    {
        "Otto Hahn": "otto hahn"
    },
    {
        " in 1911 and by ": null
    },
    {
        "Jean Danysz": "jean danysz"
    },
    {
        " in 1913 showed multiple lines on a diffuse background. These measurements offered the first hint that beta particles have a continuous spectrum.    In 1914, ": null
    },
    {
        "James Chadwick": "james chadwick"
    },
    {
        " used a magnetic ": null
    },
    {
        "spectrometer": "spectrometer"
    },
    {
        " with one of ": null
    },
    {
        "Hans Geigers": "hans geiger"
    },
    {
        " new ": null
    },
    {
        "counters": "geiger counter"
    },
    {
        " to make more accurate measurements which showed that the spectrum was continuous.    The distribution of beta particle energies was in apparent contradiction to the ": null
    },
    {
        "law of conservation of energy": "law of conservation of energy"
    },
    {
        ". If beta decay were simply electron emission as assumed at the time, then the energy of the emitted electron should have a particular, well-defined value.    For beta decay, however, the observed broad distribution of energies suggested that energy is lost in the beta decay process. This spectrum was puzzling for many years.     A second problem is related to the ": null
    },
    {
        "conservation of angular momentum": "conservation of angular momentum"
    },
    {
        ". Molecular band spectra showed that the ": null
    },
    {
        "nuclear spin": "nuclear spin"
    },
    {
        " of ": null
    },
    {
        "nitrogen-14": "nitrogen-14"
    },
    {
        " is 1  and more generally that the spin is integral for nuclei of even ": null
    },
    {
        "mass number": "mass number"
    },
    {
        " and half-integral for nuclei of odd mass number. This was later explained by the ": null
    },
    {
        "proton-neutron model of the nucleus": "discovery of the neutronproton-neutron model of the nucleus"
    },
    {
        ". Beta decay leaves the mass number unchanged, so the change of nuclear spin must be an integer. However, the electron spin is 1/2, hence angular momentum would not be conserved if beta decay were simply electron emission.     From 1920–1927, ": null
    },
    {
        "Charles Drummond Ellis": "charles drummond ellis"
    },
    {
        " further established that the beta decay spectrum is continuous. In 1933, Ellis and ": null
    },
    {
        "Nevill Mott": "nevill mott"
    },
    {
        " obtained strong evidence that the beta spectrum has an effective upper bound in energy. ": null
    },
    {
        "Niels Bohr": "niels bohr"
    },
    {
        " had suggested that the beta spectrum could be explained if ": null
    },
    {
        "conservation of energy": "conservation of energy"
    },
    {
        " was true only in a statistical sense, thus this ": null
    },
    {
        "principle": "laws of science"
    },
    {
        " might be violated in any given decay.  However, the upper bound in beta energies determined by Ellis and Mott ruled out that notion. Now, the problem of how to account for the variability of energy in known beta decay products, as well as for conservation of momentum and angular momentum in the process, became acute.     In a ": null
    },
    {
        "famous letter": "electron neutrinopaulis letter"
    },
    {
        " written in 1930, ": null
    },
    {
        "Wolfgang Pauli": "wolfgang pauli"
    },
    {
        " attempted to resolve the beta-particle energy conundrum by suggesting that, in addition to electrons and protons, atomic nuclei also contained an extremely light neutral particle, which he called the neutron. He suggested that this neutron was also emitted during beta decay , but it had simply not yet been observed. In 1931, ": null
    },
    {
        "Enrico Fermi": "enrico fermi"
    },
    {
        " renamed Paulis neutron the neutrino . In 1934, Fermi published his landmark ": null
    },
    {
        "theory for beta decay": "fermis interaction"
    },
    {
        ", where he applied the principles of quantum mechanics to matter particles, supposing that they can be created and annihilated, just as the light quanta in atomic transitions. Thus, according to Fermi, neutrinos are created in the beta-decay process, rather than contained in the nucleus; the same happens to electrons. The neutrino interaction with matter was so weak that detecting it proved a severe experimental challenge. Further indirect evidence of the existence of the neutrino was obtained by observing the recoil of nuclei that emitted such a particle after absorbing an electron. Neutrinos were finally detected directly in 1956 by ": null
    },
    {
        "Clyde Cowan": "clyde cowan"
    },
    {
        " and ": null
    },
    {
        "Frederick Reines": "frederick reines"
    },
    {
        " in the ": null
    },
    {
        "Cowan–Reines neutrino experiment": "cowan–reines neutrino experiment"
    },
    {
        ".    The properties of neutrinos were as predicted by Pauli and Fermi.       decay and electron capture": null
    },
    {
        "Frédéric": "frédéric joliot-curie"
    },
    {
        " and ": null
    },
    {
        "Irène Joliot-Curie": "irène joliot-curie"
    },
    {
        " bombarded aluminium with alpha particles to effect the nuclear reaction   +    →   +  , and observed that the product isotope  emits a positron identical to those found in cosmic rays . This was the first example of   decay , which they termed ": null
    },
    {
        "artificial radioactivity": "artificial radioactivity"
    },
    {
        " since  is a short-lived nuclide which does not exist in nature. In recognition of their discovery the couple were awarded the ": null
    },
    {
        "Nobel Prize in Chemistry": "nobel prize in chemistry"
    },
    {
        " in 1935  .     The theory of ": null
    },
    {
        "electron capture": "electron capture"
    },
    {
        " was first discussed by ": null
    },
    {
        "Gian-Carlo Wick": "gian-carlo wick"
    },
    {
        " in a 1934 paper, and then developed by ": null
    },
    {
        "Hideki Yukawa": "hideki yukawa"
    },
    {
        " and others. K-electron capture was first observed in 1937 by ": null
    },
    {
        "Luis Alvarez": "luis walter alvarez"
    },
    {
        ", in the nuclide 48 V.          Alvarez went on to study electron capture in 67 Ga and other nuclides.             In 1956, ": null
    },
    {
        "Tsung-Dao Lee": "tsung-dao lee"
    },
    {
        " and ": null
    },
    {
        "Chen Ning Yang": "chen ning yang"
    },
    {
        " noticed that there was no evidence that ": null
    },
    {
        "parity": "parity"
    },
    {
        " was conserved in weak interactions, and so they postulated that this symmetry may not be preserved by the weak force. They sketched the design for an experiment for testing conservation of parity in the laboratory.    Later that year, ": null
    },
    {
        "Chien-Shiung Wu": "chien-shiung wu"
    },
    {
        " and coworkers conducted the ": null
    },
    {
        "Wu experiment": "wu experiment"
    },
    {
        " showing an asymmetrical beta decay of ": null
    },
    {
        "cobalt-60": "cobalt-60"
    },
    {
        " at cold temperatures that proved that parity is not conserved in beta decay.     This surprising result overturned long-held assumptions about parity and the weak force. In recognition of their theoretical work, Lee and Yang were awarded the ": null
    },
    {
        "Nobel Prize for Physics": "nobel prize for physics"
    },
    {
        " in 1957.             In   decay, the ": null
    },
    {
        "weak interaction": "weak interaction"
    },
    {
        " converts an ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        " into a nucleus with ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        " increased by one, while emitting an electron  and an electron ": null
    },
    {
        "antineutrino": "neutrinoantineutrinos"
    },
    {
        " .   decay generally occurs in neutron-rich nuclei.    The generic equation is:     :  →  +  +    where  and  are the ": null
    },
    {
        "mass number": "mass number"
    },
    {
        " and ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        " of the decaying nucleus, and X and X′ are the initial and final elements, respectively.     Another example is when the ": null
    },
    {
        "free neutron": "free neutron"
    },
    {
        "  decays by   decay into a proton :   :  →  +  + .       At the ": null
    },
    {
        "fundamental": "fundamental particle"
    },
    {
        " level , this is caused by the conversion of the negatively charged  down quark to the positively charged  up quark by emission of a ": null
    },
    {
        " boson": "w boson"
    },
    {
        "; the  boson subsequently decays into an electron and an electron antineutrino:   : →  +  + .               In   decay, or positron emission , the weak interaction converts an atomic nucleus into a nucleus with atomic number decreased by one, while emitting a positron  and an ": null
    },
    {
        "electron neutrino": "electron neutrino"
    },
    {
        " .   decay generally occurs in proton-rich nuclei. The generic equation is:     :  →  +  +    This may be considered as the decay of a proton inside the nucleus to a neutron   :p → n +  +      However,   decay cannot occur in an isolated proton because it requires energy, due to the ": null
    },
    {
        "mass": "mass"
    },
    {
        " of the neutron being greater than the mass of the proton.   decay can only happen inside nuclei when the daughter nucleus has a greater ": null
    },
    {
        "binding energy": "nuclear binding energy"
    },
    {
        " than the mother nucleus. The difference between these energies goes into the reaction of converting a proton into a neutron, a positron and a neutrino and into the kinetic energy of these particles. This process is opposite to negative beta decay, in that the weak interaction converts a proton into a neutron by converting an up quark into a down quark resulting in the emission of a  or the absorption of a .             In all cases where   decay of a nucleus is allowed energetically, so too is ": null
    },
    {
        "electron capture": "electron capture"
    },
    {
        " allowed. This is a process during which a nucleus captures one of its atomic electrons, resulting in the emission of a neutrino:     :  +  →  +      An example of electron capture is one of the decay modes of ": null
    },
    {
        "krypton-81": "krypton-81"
    },
    {
        " into ": null
    },
    {
        "bromine-81": "bromine-81"
    },
    {
        ":   : +  →  +      All emitted neutrinos are of the same energy. In proton-rich nuclei where the energy difference between the initial and final states is less than ,   decay is not energetically possible, and electron capture is the sole decay mode.     If the captured electron comes from the innermost shell of the atom, the ": null
    },
    {
        "K-shell": "electron shell"
    },
    {
        ", which has the highest probability to interact with the nucleus, the process is called K-capture.    If it comes from the L-shell, the process is called L-capture, etc.     Electron capture is a competing decay process for all nuclei that can undergo β + decay. The converse, however, is not true: electron capture is the only type of decay that is allowed in proton-rich nuclides that do not have sufficient energy to emit a positron and neutrino.                If the proton and neutron are part of an ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        ", the above described decay processes ": null
    },
    {
        "transmute": "nuclear transmutation"
    },
    {
        " one chemical element into another. For example:     Ba-137 + e- + !ve   Na-22 _ _ - ": null
    }
]