[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", particularly in ": null
    },
    {
        "dynamical systems": "dynamical systems"
    },
    {
        ", a bifurcation diagram shows the values visited or approached asymptotically  of a system as a function of a ": null
    },
    {
        "bifurcation parameter": "bifurcation theory"
    },
    {
        " in the system. It is usual to represent stable values with a solid line and unstable values with a dotted line, although often the unstable points are omitted. Bifurcation diagrams enable the visualization of ": null
    },
    {
        "bifurcation theory": "bifurcation theory"
    },
    {
        ".                              An example is the bifurcation diagram of the ": null
    },
    {
        "logistic map": "logistic map"
    },
    {
        ":     : x_rx_n. \\,     The bifurcation parameter r is shown on the horizontal axis of the plot and the vertical axis shows the set of values of the logistic function visited asymptotically from almost all initial conditions.     The bifurcation diagram shows the forking of the periods of stable orbits from 42 to 42 to 42 to 42 etc. Each of these bifurcation points is a ": null
    },
    {
        "period-doubling bifurcation": "period-doubling bifurcation"
    },
    {
        ".   The ratio of the lengths of successive intervals between values of r for which bifurcation occurs ": null
    },
    {
        "converges": "convergent series"
    },
    {
        " to the ": null
    },
    {
        "first Feigenbaum constant": "first feigenbaum constant"
    },
    {
        ".     The diagram also shows period doublings from 42 to 42 to 42 etc., from 42 to 42 to 42 etc., and so forth.         In a dynamical system such as     : \\ddot + f + \\varepsilon g 42     which is ": null
    },
    {
        "structurally stable": "structurally stable"
    },
    {
        " when \\mu \\neq 42 , if a bifurcation diagram is plotted, treating \\mu as the bifurcation parameter, but for different values of \\varepsilon , the case \\varepsilon 42 is the symmetric pitchfork bifurcation. When \\varepsilon \\neq 42 , we say we have a pitchfork with broken symmetry.": null
    }
]