[
    {
        "              Bilbo Baggins is the ": null
    },
    {
        "title character": "title character"
    },
    {
        " and ": null
    },
    {
        "protagonist": "protagonist"
    },
    {
        " of ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        "s 42 novel  The Hobbit , as well as a ": null
    },
    {
        "supporting character": "supporting character"
    },
    {
        " in  The Lord of the Rings . In Tolkiens narrative ": null
    },
    {
        "conceit": "conceit"
    },
    {
        ", in which all the writings of ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        " are translations from the fictitious volume of the  Red Book of Westmarch , Bilbo is the author of The Hobbit and translator of various works from the ": null
    },
    {
        "elvish": "elvish language"
    },
    {
        " .       The HobbitThe Hobbit, Bilbo Baggins, a ": null
    },
    {
        "hobbit": "hobbit"
    },
    {
        " in comfortable middle age, was hired as a burglar despite his initial objectionsby the ": null
    },
    {
        "wizard": "istari"
    },
    {
        " Gandalf": "gandalf"
    },
    {
        " and ": null
    },
    {
        "42 Dwarves": "list of the hobbit charactersthorins company"
    },
    {
        " led by their king, ": null
    },
    {
        "Thorin Oakenshield": "thorin oakenshield"
    },
    {
        ". The Dwarves were on a quest to reclaim the ": null
    },
    {
        "Lonely Mountain": "lonely mountain"
    },
    {
        " and its treasures from the ": null
    },
    {
        "dragon": "dragon"
    },
    {
        " Smaug": "smaug"
    },
    {
        ". The adventure took Bilbo and his companions through the wilderness, to the ": null
    },
    {
        "elf": "elf"
    },
    {
        " haven of ": null
    },
    {
        "Rivendell": "rivendell"
    },
    {
        ", across the ": null
    },
    {
        "Misty Mountains": "misty mountains"
    },
    {
        ", through the black forest of ": null
    },
    {
        "Mirkwood": "mirkwood"
    },
    {
        ", to ": null
    },
    {
        "Lake-town": "esgaroth"
    },
    {
        " in the middle of ": null
    },
    {
        "Long Lake": "long lake"
    },
    {
        ", and eventually to the Mountain itself. There, after Smaug was killed and the Mountain was reclaimed, the ": null
    },
    {
        "Battle of Five Armies": "battle of five armies"
    },
    {
        " took place. In that battle, a host of Elves, Men, and Dwarves - with the help of ": null
    },
    {
        "Eagles": "eagle"
    },
    {
        " and ": null
    },
    {
        "Beorn": "beorn"
    },
    {
        " the shapeshifter -defeated a host of ": null
    },
    {
        "Goblins": "orc"
    },
    {
        " and ": null
    },
    {
        "Warg": "warg"
    },
    {
        ". At the end of the story, Bilbo returned to his home in ": null
    },
    {
        "the Shire": "shire"
    },
    {
        " to find that several of his relatives - believing him to be dead - were trying to claim his home and possessions.     During his journey, Bilbo encountered other fantastic creatures, including ": null
    },
    {
        "Trolls": "troll"
    },
    {
        ", Elves, ": null
    },
    {
        "giant spiders": "list of middle-earth animalsgreat spiders"
    },
    {
        ", ": null
    },
    {
        "Beorn": "beorn"
    },
    {
        " , ": null
    },
    {
        "Goblins": "orc"
    },
    {
        ", ": null
    },
    {
        "Eagles": "eagle"
    },
    {
        ", ": null
    },
    {
        "Warg": "warg"
    },
    {
        ", and a murderous creature named ": null
    },
    {
        "Gollum": "gollum"
    },
    {
        ". Underground, near Gollums lair under the Misty Mountains, Bilbo accidentally found a ": null
    },
    {
        "magic ring of invisibility": "one ring"
    },
    {
        " that, unbeknownst to him, belonged to Gollum. After playing a ": null
    },
    {
        "riddle game": "riddles in the dark"
    },
    {
        " with Bilbo, Gollum planned to use the Ring to kill and eat Bilbo. Upon discovering that he lost the Ring, Gollum deduced that Bilbo had it from his last riddle - “What have I got in my pocket?” - and chased after him, but by then Bilbo had discovered the Rings power and disappeared. Bilbo at first thought to kill Gollum, but spared his life out of pity and leaped over him to escape.     By the end of the journey, Bilbo had become wiser and more confident, having saved the day in many precarious situations. Bilbos journey has been compared to a pilgrimage of grace. The Hobbit can be characterized as a Christian  bildungsroman  which equates progress to wisdom gained in the form of a rite of passage .  He rescued the Dwarves from giant spiders with the magic ring and a short ": null
    },
    {
        "Elven-sword": "list of middle-earth weapons and armoursting"
    },
    {
        " that he had acquired. He used the magic ring to sneak around in dangerous places, and he used his wits to smuggle the 42 Dwarves out of the Wood-elves prison. When tensions arose over ownership of the treasures beneath the Lonely Mountain, Bilbo used the ": null
    },
    {
        "Arkenstone": "list of middle-earth objectsarkenstone"
    },
    {
        ", a stolen heirloom jewel, as leverage in an unsuccessful attempt to negotiate a compromise between the Dwarves, the Wood-elves, and the Men of Lake-town. In so doing, Bilbo strained his relationship with Thorin; however, the two were reconciled at Thorins deathbed following the Battle of the Five Armies. In addition to becoming wealthy from his share of the Dwarves treasure, Bilbo found that he had traded respectability for experience and wisdom. At the end of the book, Gandalf proclaimed that Bilbo was no longer the Hobbit that he had been.     The Lord of the Rings    The Fellowship of the Ring , the first volume of The Lord of the Rings, begins with Bilbos eleventy-first birthday, 42 years after the beginning of  The Hobbit . The main character of the novel is ": null
    },
    {
        "Frodo Baggins": "frodo baggins"
    },
    {
        ", Bilbos cousin, Although Frodo referred to Bilbo as his uncle , they were in fact first and second cousins, once removed either way . who celebrates his 42rd birthday and legally comes of age on the same day.     In  , Bilbo, a lifelong bachelor, adopted Frodo, the orphaned son of his first cousin ": null
    },
    {
        "Primula Brandybuck": "primula brandybuck"
    },
    {
        " and his second cousin ": null
    },
    {
        "Drogo Baggins": "drogo baggins"
    },
    {
        ", and made him his heir. Though Frodo was actually his first and second ": null
    },
    {
        "cousin once removed": "cousincousin chart"
    },
    {
        " either way ,  the two regarded each other as uncle and nephew.     All this time Bilbo had kept his magic ring, with no idea of its significance, using it mostly to hide from his obnoxious cousins, the ": null
    },
    {
        "Sackville-Baggins": "sackville-baggins"
    },
    {
        "es, when they came to visit. Gandalfs investigations revealed it to be the ": null
    },
    {
        "One Ring": "one ring"
    },
    {
        " forged by the Dark Lord ": null
    },
    {
        "Sauron": "sauron"
    },
    {
        ". The Ring had prolonged Bilbos life beyond the normal hobbit span, and at 42 he still looked 42 While the Ring did not initially corrupt him as it had its previous owners, it was beginning to affect him; over the years, it had begun to prey on his mind when out of his sight, and he lost sleep and felt thin, sort of stretched … like butter that has been scraped over too much bread .     On the night of his and Frodos birthday, Bilbo threw himself a party and invited all of the Shire. He signed his home, ": null
    },
    {
        "Bag End": "bag end"
    },
    {
        ", and estate over to Frodo. He then gave a farewell address to his neighbours, at the end of which he put on the Ring and vanished from sight. As Bilbo prepared finally to leave the house, he reacted with panic and suspicion when Gandalf tried to persuade him to leave the Ring with Frodo. Bilbo refused to give up the Ring, referring to it as his precious – just as Gollum had. Gandalf lost his temper with his old friend and talked some sense into him. Bilbo admitted he would have liked to be rid of the Ring, and he left it behind, becoming the first person to do so voluntarily. He left the Shire that night, and was never seen in ": null
    },
    {
        "Hobbiton": "hobbiton"
    },
    {
        " again.     His earlier adventure, his ": null
    },
    {
        "eccentric": "eccentric"
    },
    {
        " habits as a hobbit, and his sudden disappearance led to the enduring figure of Mad Baggins in hobbit folklore, who disappeared with a flash and a bang and returned with gold and jewels.     Freed of the Rings power over his senses, Bilbo travelled first to ": null
    },
    {
        "Rivendell": "rivendell"
    },
    {
        ", and then on to visit the dwarves of the Lonely Mountain. After he returned to Rivendell he spent much of the next 42 years living a pleasant life of retirement: eating, sleeping, writing poetry, and working on his memoirs, There and Back Again, known as  The Hobbit . He became a scholar of Elven lore, leaving behind the Translations from the Elvish , which forms the basis of what is known to us as  The Silmarillion .     When Frodo and his friends ": null
    },
    {
        "Samwise Gamgee": "samwise gamgee"
    },
    {
        ", ": null
    },
    {
        "Meriadoc Brandybuck": "meriadoc brandybuck"
    },
    {
        " and ": null
    },
    {
        "Peregrin Took": "peregrin took"
    },
    {
        " stopped in Rivendell on their quest to destroy the Ring, Bilbo was still alive but now visibly aged, the years having caught up with him after he surrendered the Ring. Upon seeing the Ring again, he suddenly tried to take it from Frodo; he returned to his senses when a terrified Frodo backed away, and he broke down in tears, apologizing for bringing the burden of the Ring onto Frodo.     After the quest to destroy the Ring was fulfilled in  The Return of the King , Gandalf and the four Hobbits visited Rivendell on their way back to the Shire and found Bilbo still living there. He gave Frodo a set of manuscripts that later became Translations from the Elvish, and also gave Sam a small bag of gold that represented the last of his share from Smaugs vast hoard. Two years later Bilbo accompanied Gandalf, ": null
    },
    {
        "Elrond": "elrond"
    },
    {
        ", ": null
    },
    {
        "Galadriel": "galadriel"
    },
    {
        ", and Frodo to the ": null
    },
    {
        "Grey Havens": "grey havens"
    },
    {
        ", there to take ship for ": null
    },
    {
        "Tol Eressëa": "tol eressëa"
    },
    {
        " across the sea, on 42th September . He had already celebrated his 42st birthday by this time, surpassing the ": null
    },
    {
        "Old Took": "old took"
    },
    {
        " by one year and becoming the oldest Hobbit ever in Middle-earth.        According to Appendix C of The Lord of the Rings, Bilbo was born to ": null
    },
    {
        "Bungo Baggins": "bungo baggins"
    },
    {
        " and ": null
    },
    {
        "Belladonna Took": "belladonna took"
    },
    {
        " in , or S.R. 42 The Lord of the Rings gives the date of Bilbos birthday as 42 September, but the actual date in the ": null
    },
    {
        "Shire calendar": "shire calendar"
    },
    {
        " was Halimath 42; Tolkien tells us in Appendix D that he used our modern names for the months to avoid confusion, while the seasonal implications of our names are more or less the same , so that Halimath is translated as September, but that the Shire dates were actually in advance of ours by some ten days, and our New Years Day corresponded more or less to the Shire January 42 . The Lord of the Rings, Appendix D.     The Bagginses of Bag End were one of the oldest, wealthiest, and most respectable Hobbit families in Hobbiton until the year 42 , when Bilbo inexplicably disappeared on his adventure and was thought dead.       ": null
    },
    {
        "A Walking Song": "a walking song"
    },
    {
        "   All that is gold does not glitter": "all that is gold does not glitter"
    },
    {
        "   The Man in the Moon Stayed Up Too Late": "the man in the moon stayed up too late"
    },
    {
        "   The Road Goes Ever On": "the road goes ever on"
    },
    {
        "       Tolkiens posthumously published poem ": null
    },
    {
        "Bilbos Last Song": "bilbos last song"
    },
    {
        " , illustrated by ": null
    },
    {
        "Pauline Baynes": "pauline baynes"
    },
    {
        ", describes Bilbos contemplation of his forthcoming voyage to the ": null
    },
    {
        "Undying Lands": "undying lands"
    },
    {
        ". The illustrations evoke his last ride in the company of Elrond from Rivendell to the Grey Havens, as described in The Lord of the Rings.          In the 42–42 ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " Radio serialisation of  The Lord of the Rings , Bilbo was played by ": null
    },
    {
        "Felix Felton": "felix felton"
    },
    {
        ".     In the 42 ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " Radio serialisation of  The Hobbit , Bilbo was played by ": null
    },
    {
        "Paul Daneman": "paul daneman"
    },
    {
        ".     ": null
    },
    {
        "Nicol Williamson": "nicol williamson"
    },
    {
        " portrayed Bilbo with a light ": null
    },
    {
        "West Country": "west country"
    },
    {
        " accent in the 42 performance released on ": null
    },
    {
        "Argo Records": "argo records"
    },
    {
        ".      In the 42 ": null
    },
    {
        "Rankin/Bass": "rankin/bass"
    },
    {
        " animated version of The Hobbit": "the hobbit"
    },
    {
        ", Bilbo was voiced by ": null
    },
    {
        "Orson Bean": "orson bean"
    },
    {
        ". Bean also voiced both the aged Bilbo and Frodo in the same companys 42 adaptation of  The Return of the King .     In ": null
    },
    {
        "Ralph Bakshi": "ralph bakshi"
    },
    {
        "s 42 ": null
    },
    {
        "animated version": "the lord of the rings"
    },
    {
        " of The Lord of the Rings, Bilbo was voiced by ": null
    },
    {
        "Norman Bird": "norman bird"
    },
    {
        ". ": null
    },
    {
        "Billy Barty": "billy barty"
    },
    {
        " was the model for Bilbo, as well as Frodo and ": null
    },
    {
        "Sam": "samwise gamgee"
    },
    {
        ", in the live-action recordings Bakshi used for ": null
    },
    {
        "rotoscoping": "rotoscope"
    },
    {
        ".     The 42th story to be broadcast in the BBCs long-running childrens programme ": null
    },
    {
        "Jackanory": "jackanory"
    },
    {
        " was The Hobbit, in 42 Four narrators told the story, with Bilbos part being played by ": null
    },
    {
        "Bernard Cribbins": "bernard cribbins"
    },
    {
        ".     In the BBCs 42 ": null
    },
    {
        "radio serialisation": "the lord of the rings"
    },
    {
        " of The Lord of the Rings, Bilbo is played by ": null
    },
    {
        "John Le Mesurier": "john le mesurier"
    },
    {
        ".      In the 42 television ": null
    },
    {
        "miniseries": "miniseries"
    },
    {
        "  Hobitit  by Finnish broadcaster ": null
    },
    {
        "Yle": "yle"
    },
    {
        ", Bilbo is portrayed by ": null
    },
    {
        "Martti Suosalo": "martti suosalo"
    },
    {
        ".     Throughout the 42  video game  the players control Bilbo, voiced by Michael Beatie. The game follows the plot of the book, but adds the elements of ": null
    },
    {
        "platform game": "platform game"
    },
    {
        "play and various side-objectives along the main quests.     In  The Lord of the Rings Online  Bilbo resides in Rivendell, mostly playing riddle games with the Elf Lindir in the Hall of Fire. The game also includes multiple storylines about Bilbos adventures.     In ": null
    },
    {
        "Peter Jackson": "peter jackson"
    },
    {
        "s films  The Fellowship of the Ring  and  The Return of the King  Bilbo is played by ": null
    },
    {
        "Ian Holm": "ian holm"
    },
    {
        ", who had played Frodo in the BBC radio series 42 years earlier. The movies omit the 42-year gap between Bilbos 42th birthday and Frodos departure from the Shire; as a result, Bilbo mentions in Rivendell that he was unable to revisit the Lonely Mountain before his retirement.     In Peter Jacksons ": null
    },
    {
        "The Hobbit film series": "the hobbit"
    },
    {
        ", a prequel to The Lord of the Rings, the young Bilbo is portrayed by ": null
    },
    {
        "Martin Freeman": "martin freeman"
    },
    {
        "  while ": null
    },
    {
        "Ian Holm": "ian holm"
    },
    {
        " reprises his role as an older Bilbo in  An Unexpected Journey  and  The Battle of the Five Armies  .                               ": null
    },
    {
        "anetary geolo": "anetary geolo"
    },
    {
        "small hills": null
    }
]