[
    {
        "        Bill Atkinson is an American ": null
    },
    {
        "computer engineer": "computer engineer"
    },
    {
        " and photographer. Atkinson worked at ": null
    },
    {
        "Apple Computer": "apple inc."
    },
    {
        " from 1978 to 1990.     Atkinson was the principal designer and developer of the ": null
    },
    {
        "graphical user interface": "graphical user interface"
    },
    {
        " of the ": null
    },
    {
        "Apple Lisa": "apple lisa"
    },
    {
        " and, later, one of the first thirty members of the original Apple ": null
    },
    {
        "Macintosh": "macintosh"
    },
    {
        " development team, and was the creator of the ground-breaking ": null
    },
    {
        "MacPaint": "macpaint"
    },
    {
        " application, which fulfilled the vision of using the computer as a creative tool. He also designed and implemented ": null
    },
    {
        "QuickDraw": "quickdraw"
    },
    {
        ", the fundamental toolbox that the Lisa and Macintosh used for graphics. QuickDraws performance was essential for the success of the Macintosh GUI. He also was one of the main designers of the Lisa and Macintosh ": null
    },
    {
        "user interface": "user interface"
    },
    {
        "s. Atkinson also conceived, designed and implemented ": null
    },
    {
        "HyperCard": "hypercard"
    },
    {
        ", the first popular ": null
    },
    {
        "hypermedia": "hypermedia"
    },
    {
        " system. HyperCard put the power of computer programming and database design into the hands of non": null
    },
    {
        "programmer": "programmer"
    },
    {
        "s. In 1994, Atkinson received the ": null
    },
    {
        "EFF Pioneer Award": "eff pioneer award"
    },
    {
        " for his contributions.       He received his undergraduate degree from the ": null
    },
    {
        "University of California, San Diego": "university of california, san diego"
    },
    {
        ", where Apple Macintosh developer ": null
    },
    {
        "Jef Raskin": "jef raskin"
    },
    {
        " was one of his professors. Atkinson continued his studies as a graduate student in neurochemistry at the ": null
    },
    {
        "University of Washington": "university of washington"
    },
    {
        ". Raskin invited Atkinson to visit him at ": null
    },
    {
        "Apple Computer": "apple inc."
    },
    {
        "; ": null
    },
    {
        "Steve Jobs": "steve jobs"
    },
    {
        " persuaded him to join the company immediately as employee No. 51, and Atkinson never finished his PhD.        Around 1990, ": null
    },
    {
        "General Magics": "general magic"
    },
    {
        "founding, with Bill Atkinson as one of the three cofounders, met the following press in  Byte  magazine:   The obstacles to General Magics success may appear daunting, but General Magic is not your typical start-up company. Its partners include some of the biggest players in the worlds of computing, communications, and consumer electronics, and its loaded with top-notch engineers who have been given a clean slate to reinvent traditional approaches to ubiquitous worldwide communications.      In 2007, Atkinson began working as an outside developer with ": null
    },
    {
        "Numenta": "numenta"
    },
    {
        ", a startup working on computer intelligence. On his work there Atkinson said, what Numenta is doing is more fundamentally important to society than the personal computer and the rise of the Internet.      Currently, Atkinson has combined his passion for computer programming with his love of ": null
    },
    {
        "nature photography": "nature photography"
    },
    {
        " to create art images. He takes close-up photographs of stones that have been cut and polished. His works are highly regarded for their resemblance to miniature landscapes which are hidden within the stones. Atkinsons 2004 book Within the Stone features a collection of his close-up photographs. The highly intricate and detailed images he creates are made possible by the accuracy and creative control of the digital printing process that he helped create.     Some of Atkinsons noteworthy contributions to the field of computing include:   Macintosh ": null
    },
    {
        "QuickDraw": "quickdraw"
    },
    {
        " and Lisa LisaGraf   Atkinson independently discovered the ": null
    },
    {
        "midpoint circle algorithm": "midpoint circle algorithm"
    },
    {
        " for fast drawing of circles by using the sum of consecutive odd numbers.    ": null
    },
    {
        "Marching ants": "marching ants"
    },
    {
        " double-click": "double-click"
    },
    {
        " Menu bar": "menu bar"
    },
    {
        " selection lasso": "selection lasso"
    },
    {
        " FatBits": "fatbits"
    },
    {
        " MacPaint": "macpaint"
    },
    {
        " HyperCard": "hypercard"
    },
    {
        " Atkinson dithering": "ditheralgorithms"
    },
    {
        "      Atkinson now works as a nature photographer. Actor ": null
    },
    {
        "Nelson Franklin": "nelson franklin"
    },
    {
        " portrayed him in the 2013 film  Jobs ": null
    }
]