[
    {
        "Bill Holbrook is an American cartoonist and ": null
    },
    {
        "webcomic": "webcomic"
    },
    {
        " writer and artist, best known for his syndicated ": null
    },
    {
        "comic strip": "comic strip"
    },
    {
        "  On the Fastrack .     Born in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", Holbrook grew up in ": null
    },
    {
        "Huntsville, Alabama": "huntsville, alabama"
    },
    {
        ", and began drawing at an early age. While majoring in illustration and visual design at ": null
    },
    {
        "Auburn University": "auburn university"
    },
    {
        ", Holbrook served as art director of the student newspaper, doing editorial cartoons and a weekly comic strip. At the same time, his work was being published in the  Huntsville Times  and the  Monroe Journal . After graduation in 1980, he joined the  Atlanta Constitution  as an editorial staff artist.     During a 1982 visit to relatives on the West Coast, Holbrook met  Peanuts  creator, ": null
    },
    {
        "Charles Schulz": "charles schulz"
    },
    {
        ". Following his advice and encouragement, Holbrook created a strip in the fall of that year about a college graduate working in a rundown diner. It did not stir syndicate interest, but what he learned on the strip helped him when he created On the Fastrack.     Eleven days before On the Fastrack made its syndicated debut , Holbrook met Teri Peitso on a blind date. They were married on ": null
    },
    {
        "Pearl Harbor Day": "pearl harbor day"
    },
    {
        ", 1985. They have two daughters, Chandler and Haviland. Peitso-Holbrooks novels have been nominated for both ": null
    },
    {
        "Edgar Awards": "edgar award"
    },
    {
        "and ": null
    },
    {
        "Agatha Award": "agatha award"
    },
    {
        "s. She is currently an assistant professor in literacy education at ": null
    },
    {
        "Georgia State University": "georgia state university"
    },
    {
        ". The family lives in the ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        " area.     In October 1989, Holbrook began his second strip,  Safe Havens , and his third strip,  Kevin and Kell  was launched in September 1995.        Every week Holbrook writes the story line for the next three weeks for one of his strips and draws the next three weeks worth of strips for another.   In 2010, characters from On the Fastrack and Safe Havens began appearing in both strips.   On the Fastrack - About the misadventures at Fastrack, Inc., On the Fastrack has been distributed by ": null
    },
    {
        "King Features Syndicate": "king features syndicate"
    },
    {
        " since 1984. It now appears in 75 newspapers nationwide.   Safe Havens - Initially about a day care center, this strip evolved into the adventures of Samantha Argus and her friends and is now syndicated nationally to over 50 newspapers.   Kevin and Kell - Originally an ": null
    },
    {
        "online-only strip": "webcomic"
    },
    {
        " but now also published in the  Atlanta Journal-Constitution , Kevin and Kell centers on the mixed marriage between a rabbit, Kevin and a grey wolf, Kell Dewclaw. The plot revolves around species-related humor, satire, and interpersonal conflict.   http://duelinthesomme.com/ Duel In The Somme - Holbrook illustrated a story by ": null
    },
    {
        "Ben Bova": "ben bova"
    },
    {
        " and ": null
    },
    {
        "Rob Balder": "rob balder"
    }
]