[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", a binary function  is a ": null
    },
    {
        "function": "function"
    },
    {
        " that takes two inputs.     Precisely stated, a function f is binary if there exists ": null
    },
    {
        "set": "set"
    },
    {
        "s X, Y, Z such that   : \\,f \\colon X \\times Y \\rightarrow Z   where X \\times Y is the ": null
    },
    {
        "Cartesian product": "cartesian product"
    },
    {
        " of X and Y.       ": null
    },
    {
        "Set-theoretically": "naive set theory"
    },
    {
        ", one may represent a binary function as a ": null
    },
    {
        "subset": "subset"
    },
    {
        " of the ": null
    },
    {
        "Cartesian product": "cartesian product"
    },
    {
        " X × Y × Z, where  belongs to the subset ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        " f z.   Conversely, a subset R defines a binary function if and only if ": null
    },
    {
        "for any": "universal quantification"
    },
    {
        " x in X and y in Y, ": null
    },
    {
        "there exists": "existential quantification"
    },
    {
        " a ": null
    },
    {
        "unique": "uniqueness quantification"
    },
    {
        " z in Z such that  belongs to R.   We then define f to be this z.     Alternatively, a binary function may be interpreted as simply a ": null
    },
    {
        "function": "function"
    },
    {
        " from X × Y to Z.   Even when thought of this way, however, one generally writes f  instead of f.          Division of ": null
    },
    {
        "whole numbers": "integer"
    },
    {
        " can be thought of as a function; if \\mathbb is the set of ": null
    },
    {
        "integer": "integer"
    },
    {
        "s, \\mathbb^+ is the set of ": null
    },
    {
        "natural number": "natural number"
    },
    {
        "s , and \\mathbb is the set of ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "s, then ": null
    },
    {
        "division": "division"
    },
    {
        " is a binary function f:\\mathbb \\times \\mathbb^+ \\rightarrow \\mathbb .     Another example is that of inner products, or more generally functions of the form \\mapsto x^TMy where x,y are real-valued vectors of appropriate size and M is a matrix. If M is a ": null
    },
    {
        "positive definite matrix": "positive definite matrix"
    },
    {
        ", this yields an ": null
    },
    {
        "inner product": "inner product"
    },
    {
        ".        Functions whose domain is a subset of \\mathbb^42 are often also called functions of two variables even if their domain does not form a rectangle and thus the cartesian product of two sets.        In turn, one can also derive ordinary functions of one variable from a binary function.   Given any element x of X, there is a function f x , or f , from Y to Z, given by f x  : f .   Similarly, given any element y of Y, there is a function f y , or f , from X to Z, given by f y  : f . In computer science, this identification between a function from X × Y to Z and a function from X to Z Y , where Z Y is the set of all functions from Y to Z, is called  currying .       The various concepts relating to functions can also be generalised to binary functions.   For example, the division example above is  surjective   because every rational number may be expressed as a quotient of an integer and a natural number.   This example is  injective  in each input separately, because the functions f x and f y are always injective.   However, its not injective in both variables simultaneously, because f f .     One can also consider partial binary functions, which may be defined only for certain values of the inputs.   For example, the division example above may also be interpreted as a partial binary function from Z and N to Q, where N is the set of all natural numbers, including zero.   But this function is undefined when the second input is zero.     A ": null
    },
    {
        "binary operation": "binary operation"
    },
    {
        " is a binary function where the sets X, Y, and Z are all equal; binary operations are often used to define ": null
    },
    {
        "algebraic structure": "algebraic structure"
    },
    {
        "s.     In ": null
    },
    {
        "linear algebra": "linear algebra"
    },
    {
        ", a ": null
    },
    {
        "bilinear transformation": "bilinear operator"
    },
    {
        " is a binary function where the sets X, Y, and Z are all ": null
    },
    {
        "vector space": "vector space"
    },
    {
        "s and the derived functions f x and f y are all ": null
    },
    {
        "linear transformation": "linear transformation"
    },
    {
        "s.   A bilinear transformation, like any binary function, can be interpreted as a function from X × Y to Z, but this function in general wont be linear.   However, the bilinear transformation can also be interpreted as a single linear transformation from the ": null
    },
    {
        "tensor product": "tensor product"
    },
    {
        " X \\otimes Y to Z.          The concept of binary function generalises to ternary  function, quaternary  function, or more generally to n-ary function for any ": null
    },
    {
        "natural number": "natural number"
    },
    {
        " n.   A 42-ary function to Z is simply given by an element of Z.   One can also define an A-ary function where A is any ": null
    },
    {
        "set": "set"
    },
    {
        "; there is one input for each element of A.       In ": null
    },
    {
        "category theory": "category theory"
    },
    {
        ", n-ary functions generalise to n-ary morphisms in a ": null
    },
    {
        "multicategory": "multicategory"
    },
    {
        ".   The interpretation of an n-ary morphism as an ordinary morphisms whose domain is some sort of product of the domains of the original n-ary morphism will work in a ": null
    },
    {
        "monoidal category": "monoidal category"
    },
    {
        ".   The construction of the derived morphisms of one variable will work in a ": null
    },
    {
        "closed monoidal category": "closed monoidal category"
    }
]