[
    {
        "           A biogeographic realm or ecozone is the broadest ": null
    },
    {
        "biogeographic": "biogeography"
    },
    {
        " division of the Earths land surface, based on distributional patterns of ": null
    },
    {
        "terrestrial": "terrestrial animal"
    },
    {
        " organisms. They are subdivided into ": null
    },
    {
        "ecoregion": "ecoregion"
    },
    {
        "s, which are classified based on their ": null
    },
    {
        "biome": "biome"
    },
    {
        "s or habitat types.     The realms delineate the large areas of the Earths surface within which organisms have been evolving in relative isolation over long periods of time, separated from one another by geographic features, such as ": null
    },
    {
        "ocean": "ocean"
    },
    {
        "s, broad ": null
    },
    {
        "desert": "desert"
    },
    {
        "s, or high ": null
    },
    {
        "mountain range": "mountain range"
    },
    {
        "s, that constitute barriers to migration. As such, biogeographic realm designations are used to indicate general groupings of organisms based on their shared biogeography. Biogeographic realms correspond to the ": null
    },
    {
        "floristic kingdom": "floristic kingdom"
    },
    {
        "s of ": null
    },
    {
        "botany": "botany"
    },
    {
        " or ": null
    },
    {
        "zoogeographic region": "zoogeographic region"
    },
    {
        "s of ": null
    },
    {
        "zoology": "zoology"
    },
    {
        ".     Biogeographic realms are characterized by the evolutionary history of the organisms they contain. They are distinct from biomes, also known as major habitat types, which are divisions of the Earths surface based on life form, or the adaptation of animals, fungi, micro-organisms and plants to climatic, ": null
    },
    {
        "soil": "soil"
    },
    {
        ", and other conditions. Biomes are characterized by similar ": null
    },
    {
        "climax vegetation": "climax vegetation"
    },
    {
        ". Each realm may include a number of different biomes. A ": null
    },
    {
        "tropical moist broadleaf forest": "tropical and subtropical moist broadleaf forests"
    },
    {
        " in Central America, for example, may be similar to one in New Guinea in its vegetation type and structure, climate, soils, etc., but these forests are inhabited by animals, fungi, micro-organisms and plants with very different evolutionary histories.     The patterns of distribution of living organisms in the worlds biogeographic realms were shaped by the process of ": null
    },
    {
        "plate tectonics": "plate tectonics"
    },
    {
        ", which has redistributed the worlds land masses over geological history.       The biogeographic realms of Udvardy were defined based on taxonomic composition. The rank corresponds more or less to the ": null
    },
    {
        "floristic kingdom": "floristic kingdom"
    },
    {
        "s and ": null
    },
    {
        "zoogeographic region": "zoogeographic region"
    },
    {
        "s.     The usage of the term ecozone is more variable. It was used originally in ": null
    },
    {
        "stratigraphy": "stratigraphy"
    },
    {
        " . In Canadian literature, the term was used by Wiken in macro level ": null
    },
    {
        "land classification": "land classification"
    },
    {
        ", with geographic criteria  . Later, Schültz would use it with ecological and physiognomical criteria, in a way similar to the concept of ": null
    },
    {
        "biome": "biome"
    },
    {
        ".     In the ": null
    },
    {
        "Global 42": "global 200"
    },
    {
        "/WWF scheme , originally the term biogeographic realm in Udvardy sense was used. However, in a scheme of ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " , it was replaced by the term ecozone .                     The ": null
    },
    {
        "World Wildlife Fund": "world wildlife fund"
    },
    {
        " scheme is broadly similar to ": null
    },
    {
        "Miklos Udvardy": "miklos udvardy"
    },
    {
        "s system, the chief difference being the delineation of the Australasian realm relative to the Antarctic, Oceanic, and Indomalayan realms. In the WWF system, The Australasia realm includes ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", ": null
    },
    {
        "Tasmania": "tasmania"
    },
    {
        ", the islands of ": null
    },
    {
        "Wallacea": "wallacea"
    },
    {
        ", ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        ", the ": null
    },
    {
        "East Melanesian islands": "east melanesian islands"
    },
    {
        ", ": null
    },
    {
        "New Caledonia": "new caledonia"
    },
    {
        ", and ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ". Udvardys Australian realm includes only Australia and Tasmania; he places ": null
    },
    {
        "Wallacea": "wallacea"
    },
    {
        " in the Indomalayan Realm, New Guinea, New Caledonia, and East Melanesia in the Oceanian Realm, and New Zealand in the Antarctic Realm.          The ": null
    },
    {
        "Palearctic": "palearctic realm"
    },
    {
        " and ": null
    },
    {
        "Nearctic": "nearctic realm"
    },
    {
        " are sometimes grouped into the ": null
    },
    {
        "Holarctic": "holarctic"
    },
    {
        " realm.       Following the nomenclatural conventions set out in the ": null
    },
    {
        "International Code of Area Nomenclature": "international code of area nomenclature"
    },
    {
        ", Morrone defined the next biogeographic kingdoms and regions:   Holarctic kingdom Heilprin   Nearctic region Sclater   Palearctic region Sclater   Holotropical kingdom Rapoport   Neotropical region Sclater   Ethiopian region Sclater   Oriental region Wallace   Austral kingdom Engler   Cape region Grisebach   Andean region Engler   Australian region Sclater   Antarctic region Grisebach   Transition zones:   Mexican transition zone   Saharo-Arabian transition zone   Chinese transition zone   Indo-Malayan, Indonesian or Wallaces transition zone   South American transition zone              The applicability of Udvardy scheme to most freshwater taxa is unresolved .     The drainage basins of the principal oceans and seas of the world are marked by continental divides. The grey areas are ": null
    },
    {
        "endorheic basin": "endorheic basin"
    },
    {
        "s that do not drain to the ocean.       According to Briggs and Morrone :        According to the WWF scheme :          ": null
    }
]