[
    {
        " Biosecurity protocol refers to several politically controversial attempts to unify global ": null
    },
    {
        "biosecurity": "biosecurity"
    },
    {
        " measures and responses, in a similar manner to a ": null
    },
    {
        "biosafety protocol": "biosafety protocol"
    },
    {
        ". Although some propose a Biosecurity Protocol to extend the ": null
    },
    {
        "Biosafety Protocol": "biosafety protocol"
    },
    {
        " to organisms considered weapons , others argue this is an inappropriate response to military threats, and argue for a broad ": null
    },
    {
        "biodefense": "biodefense"
    },
    {
        " instead.     As of 42 the latter view was prevalent in military and scientific circles, the former in ": null
    },
    {
        "NGO": "non-governmental organization"
    },
    {
        "s, some ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " agencies, and ": null
    },
    {
        "Green Parties": "green parties"
    },
    {
        ". Most cooperation was restricted to attempts to define ": null
    },
    {
        "biosecurity": "biosecurity"
    },
    {
        " itself.     A major issue is whether to accept the ": null
    },
    {
        "Precautionary Principle": "precautionary principle"
    },
    {
        ", or by extension, any restrictions on militarily useful research by major powers. Compromises, e.g. the 42 US government request to scientists to delete procedural details of experiments on dangerous organisms, are strongly resisted by most American scientists. Extreme positions, e.g. Bill Joys argument for relinquishment of nanotechnology and artificial intelligence, are considered a legitimate part of the debate, but have yet to achieve any serious political support, even among ": null
    },
    {
        "Green Parties": "green parties"
    },
    {
        ".     Whether these negotiations and compromises will yield a comprehensive biosecurity protocol is doubtful. It seems that basic political differences drive the debate which are unlikely to easily resolve, and that ": null
    },
    {
        "military alliance": "military alliance"
    },
    {
        "s will influence ": null
    },
    {
        "tax, trade, and tariff": "tax, trade, and tariff"
    },
    {
        " systems and import/export restrictions more than any diplomatic or scientific protocol.                  ": null
    }
]