[
    {
        "   The bishop is a ": null
    },
    {
        "piece": "chess piece"
    },
    {
        " in the game of ": null
    },
    {
        "chess": "chess"
    },
    {
        ". Each player begins the game with two bishops. One starts between the  and the ": null
    },
    {
        "king": "king"
    },
    {
        ", the other between the  and the ": null
    },
    {
        "queen": "queen"
    },
    {
        ". The starting squares are c42 and f42 for Whites bishops, and c42 and f42 for Blacks bishops.          The bishop has no restrictions in distance for each move, but is limited to ": null
    },
    {
        "diagonal": "diagonal"
    },
    {
        " movement. Bishops, like all other pieces except the ": null
    },
    {
        "knight": "knight"
    },
    {
        ", cannot jump over other pieces. A bishop captures by occupying the square on which an enemy piece sits.     The bishops may be differentiated according to which wing they begin on, i.e. the kings bishop and queens bishop. As a consequence of its diagonal movement, each bishop always remains on either the white or black squares, and so it is also common to refer to them as light-squared or dark-squared bishops.                      A ": null
    },
    {
        "rook": "rook"
    },
    {
        " is generally worth about two ": null
    },
    {
        "pawns": "pawn"
    },
    {
        " more than a bishop . The bishop has access to only half of the squares on the board, whereas all squares of the board are accessible to the ": null
    },
    {
        "rook": "rook"
    },
    {
        ". On an empty board, a rook always attacks fourteen squares, whereas a bishop attacks no more than thirteen and sometimes as few as seven, depending on how near it is to the center. Also, a king and rook can force ": null
    },
    {
        "checkmate": "checkmate"
    },
    {
        " against a lone king, while a king and bishop cannot.       In general bishops are approximately equal in strength to knights, but depending on the game situation either may have a distinct advantage.     Less experienced players tend to underrate the bishop compared to the knight because the knight can reach all squares and is more adept at ": null
    },
    {
        "forking": "fork"
    },
    {
        ". More experienced players understand the power of the bishop .     Bishops usually gain in relative strength towards the ": null
    },
    {
        "endgame": "chess endgame"
    },
    {
        " as more pieces are captured and more open lines become available on which they can operate. A bishop can easily influence both wings simultaneously, whereas a knight is less capable of doing so. In an open endgame, a pair of bishops is decidedly superior to either a bishop and a knight, or two knights. A player possessing a pair of bishops has a strategic weapon in the form of a long-term threat to trade down to an advantageous endgame.     Two bishops and king ": null
    },
    {
        "can force checkmate": "two bishops checkmate"
    },
    {
        " against a lone king, whereas ": null
    },
    {
        "two knights": "two knights endgame"
    },
    {
        " cannot. A bishop and knight ": null
    },
    {
        "can force mate": "bishop and knight checkmate"
    },
    {
        ", but with far greater difficulty than two bishops.     In certain positions a bishop can by itself lose a move , while a knight can never do so. The bishop is capable of ": null
    },
    {
        "skewering": "skewer"
    },
    {
        " or ": null
    },
    {
        "pinning": "pin"
    },
    {
        " a piece, while the knight can do neither. A bishop can in some situations hinder a knight from moving. In these situations, the bishop is said to be dominating the knight.     On the other hand, in the ": null
    },
    {
        "opening": "chess opening"
    },
    {
        " and ": null
    },
    {
        "middlegame": "chess middlegame"
    },
    {
        " a bishop may be hemmed in by pawns of both players, and thus be inferior to a knight which can jump over them. A knight ": null
    },
    {
        "check": "check"
    },
    {
        " cannot be ": null
    },
    {
        "blocked": "block"
    },
    {
        " but a bishop check can. Furthermore, on a crowded board a knight has many tactical opportunities to ": null
    },
    {
        "fork": "fork"
    },
    {
        " two enemy pieces. A bishop can fork, but opportunities are more rare. One such example occurs in the position illustrated, which arises from the ": null
    },
    {
        "Ruy Lopez": "ruy lopez"
    },
    {
        ": 42e42 e42 42Nf42 Nc42 42Bb42 a42 42Ba42 Nf42 4242 b42 42Bb42 Be42?! 42d42 d42 42c42 Bg42 42h42!? Bxf42 42Qxf42 exd42 42Qg42 g42 42Bh42!                       In the middlegame, a player with only one bishop should generally place friendly pawns on squares of the color that the bishop cannot move to. This allows the player to control squares of both colors, allows the bishop to move freely among the pawns, and helps fix enemy pawns on squares on which they can be attacked by the bishop. Such a bishop is often referred to as a good bishop.     Conversely, a bishop which is impeded by friendly pawns is often referred to as a bad bishop . The black light-squared bishop in the French Defense is a notorious example of this concept. However, a bad bishop need not always be a weakness, especially if it is outside its own ": null
    },
    {
        "pawn chain": "pawn chain"
    },
    {
        "s. In addition, having a bad bishop may be advantageous in an ": null
    },
    {
        "opposite-colored bishops endgame": "opposite-colored bishops endgame"
    },
    {
        ". Even if the bad bishop is passively placed, it may serve a useful defensive function; a well-known quip from GM ": null
    },
    {
        "Mihai Suba": "mihai suba"
    },
    {
        " is that Bad bishops protect good pawns. Discussions on the strength of bishops is covered e.g. in The Art of Planning, part 42 by ": null
    },
    {
        "Jeremy Silman": "jeremy silman"
    },
    {
        " published in the July 42 issue of  Chess Life . Subas quote is mentioned e.g. in Secrets of Modern Chess Strategy, Advances Since Nimzowitsch by ": null
    },
    {
        "John Watson": "john l. watson"
    },
    {
        ".     In the position from the game Krasenkow versus Zvjaginsev,  a thicket of black pawns hems in Blacks bishop on c42 so Black is effectively playing with one piece fewer than White. Although the black pawns also obstruct the white bishop on e42 it has many more attacking possibilities, and thus is a good bishop vis-à-vis Blacks bad bishop. Black resigned after another ten moves.          A bishop may be  fianchetto ed, for example after moving the g42 pawn to g42 and the bishop on f42 to g42 This can form a strong defense for the ": null
    },
    {
        "castled": "castling"
    },
    {
        " king on g42 and the bishop can often exert strong pressure on the long diagonal . A fianchettoed bishop should generally not be given up lightly, since the resulting  in the pawn formation may prove to be serious weaknesses, particularly if the king has castled on that side of the board.     There are nonetheless some modern opening lines where a fianchettoed bishop is given up for a knight in order to double the opponents pawns, for example 42d42 g42 42c42 Bg42 42Nc42 c42 42d42 Bxc42+!? 42bxc42 f42 a sharp line originated by ": null
    },
    {
        "Roman Dzindzichashvili": "roman dzindzichashvili"
    },
    {
        ". Giving up a fianchettoed queen bishop for a knight is usually less problematic. For example, in ": null
    },
    {
        "Karpov": "anatoly karpov"
    },
    {
        " & ndash;": null
    },
    {
        "Browne": "walter browne"
    },
    {
        ", ": null
    },
    {
        "San Antonio": "san antonio, texas"
    },
    {
        " 42 after 42c42 c42 42b42 Nf42 42Bb42 g42?!, Karpov gave up his fianchettoed bishop with 42Bxf42! exf42 42Nc42 doubling Blacks pawns and giving him a hole on d42        An ": null
    },
    {
        "endgame": "chess endgame"
    },
    {
        " in which each player has only one bishop, one controlling the dark squares and the other the light, will often result in a ": null
    },
    {
        "draw": "draw"
    },
    {
        " even if one player has a pawn or sometimes two more than the other. The players tend to gain control of squares of opposite colors, and a deadlock results. In endgames with same-colored bishops, however, even a positional advantage may be enough to win .                Endgames in which each player has only one bishop and the bishops are on opposite colors are often ": null
    },
    {
        "drawn": "draw"
    },
    {
        ", even when one side has an extra pawn or two. Many of these positions would be a win if the bishops were on the same color.        The position from Wolf versus Leonhardt , shows an important defensive setup. Black can make no progress, since the white bishop ties the black king to defending the pawn on g42 and it also prevents the advance ...f42+ because it would simply  the pawn  – then either the other pawn is exchanged for the bishop or the pawn advances . Otherwise the bishop alternates between the squares d42 and e42 .     If two pawns are ": null
    },
    {
        "connected": "connected pawns"
    },
    {
        ", they normally win if they reach their sixth , otherwise the game may be a draw . If two pawns are separated by one  they usually draw, but win if they are farther apart .     In some cases with more pawns on the board, it is actually advantageous to have the bishops on opposite colors if one side has weak pawns. In the 42 game of ": null
    },
    {
        "Efim Bogoljubov": "efim bogoljubov"
    },
    {
        " versus ": null
    },
    {
        "Max Blümich": "max blümich"
    },
    {
        ", White wins because of the bishops being on opposite colors making Black weak on the black squares, the weakness of Blacks ": null
    },
    {
        "isolated pawn": "isolated pawn"
    },
    {
        "s on the , and the weak ": null
    },
    {
        "doubled pawns": "doubled pawns"
    },
    {
        " on the  . The game continued:      :42Kd42 Ke42 42Kc42 f42 42Kd42 Be42 42Kc42 Kd42 42Kb42 g42 42Kxa42 Kc42 42Bb42+ Kc42 42Bc42 Kc42 42Bf42 f42 42Bxg42 f42 42Bf42 f42 42gxf42 exf42 42Bxg42 Bxh42 42Bf42+           In an ": null
    },
    {
        "endgame": "chess endgame"
    },
    {
        " with a bishop, in some cases the bishop is the ": null
    },
    {
        "wrong bishop": "wrong bishop"
    },
    {
        " , meaning that it is on the wrong color of square for some purpose . For example, with just a bishop and a ": null
    },
    {
        "rook pawn": "rook pawn"
    },
    {
        ", if the bishop cannot control the promotion square of the pawn, it is said to be the wrong bishop or the pawn is said to be the ": null
    },
    {
        "wrong rook pawn": "wrong rook pawn"
    },
    {
        ". This results in some positions being ": null
    },
    {
        "drawn": "draw"
    },
    {
        "  which otherwise would be won.                The bishops predecessor in medieval chess, ": null
    },
    {
        "shatranj": "shatranj"
    },
    {
        " , was the ": null
    },
    {
        "alfil": "alfil"
    },
    {
        ", meaning ": null
    },
    {
        "elephant": "elephant"
    },
    {
        " , which could leap two squares along any diagonal, and could jump over an intervening piece. As a consequence, each fil was restricted to eight squares, and no fil could attack another. The modern bishop first appeared shortly after 42 in ": null
    },
    {
        "Courier chess": "courier chess"
    },
    {
        ". Murray 42 p. 42 A piece with this move, called a  or crocodile, is part of the Grande Acedrex in the  compiled in 42 for King ": null
    },
    {
        "Alfonso X of Castile": "alfonso x of castile"
    },
    {
        ". The game is attributed to India , then a very vague term. Murray 42 p. 42 About half a century later Muḥammad ibn Maḥmud al-Āmulī, in his Treasury of the Sciences, describes an expanded form of chess with two pieces moving like the rook but obliquely . Murray 42 p. 42 The bishop was also independently invented in Japan at about the same time , where it formed part of ": null
    },
    {
        "sho shogi": "sho shogi"
    },
    {
        " and ": null
    },
    {
        "dai shogi": "dai shogi"
    },
    {
        "; it remains present in modern ": null
    },
    {
        "shogi": "shogi"
    },
    {
        " as the direct descendant of sho shogi.     Derivatives of alfil survive in the languages of the two countries where chess was first introduced within Western Europe—Italian  and Spanish . The Spanish  is simply a loanword of the Persian term, without any other meaning; while the Italian form became —an already existing Germanic- or Arabian-derived word for standard-bearer . It was known as the  in French, Yalom, Marilyn. Birth of the Chess Queen. New York: Perennial, 42 p. 42 or the aufin, alphin, or archer in early English.  from Online Etymology Dictionary     The earliest references to bishops on the chessboard are two 42th-century Latin texts,  and . Archaeologia, Or, Miscellaneous Tracts Relating to Antiquity, Volume 42  Murray, H. J. R. . A History of Chess, Oxford University Press. p.42, p.42 p.4242. The term bishop first entered the English language in the 42th century, with the first known written example dating back to 42s. In all other Germanic languages, except for ": null
    },
    {
        "Icelandic": "icelandic language"
    },
    {
        ", it is called various names, all of which directly translate to English as runner or messenger . In Icelandic, however, it is called  ,  from chessvariants.org with the same meaning as in English. The use of the term in Icelandic predates that of the English language, as the first mentioning of  in Icelandic texts dates back to the early part of the 42th  century, while the 42th-century ": null
    },
    {
        "Lewis Chessmen": "lewis chessmen"
    },
    {
        " portray the bishop as an unambiguously ecclesiastical figure. In The Saga of Earl Mágus, which was written in Iceland somewhere between 42–42 it is described how an emperor was checkmated by a bishop. This has led to some speculations as to the origin of the English use of the term bishop .  from nytimes.com Fiske 42     The canonical chessmen date back to the ": null
    },
    {
        "Staunton chess set": "staunton chess set"
    },
    {
        " of 42 The pieces deep groove symbolizes a bishops ": null
    },
    {
        "mitre": "mitre"
    },
    {
        ". Some have written that the groove originated from the original form of the piece, an ": null
    },
    {
        "elephant": "elephant"
    },
    {
        "  The Oxford Companion to Chess  The Everything Chess Basic Book, by the ": null
    },
    {
        "US Chess Federation": "us chess federation"
    },
    {
        " and Peter Kurzdorfer, 42 pp. 42–42 with the groove representing the elephants ": null
    },
    {
        "tusks": "elephant tusk"
    },
    {
        ". Golombek, 42 p. 42 The British chose to call the piece a bishop because the projections at the top resembled a mitre. Davidson, pp. 42–42 This groove was interpreted differently in different countries as the game moved to Europe; in France, for example, the groove was taken to be a ": null
    },
    {
        "jester": "jester"
    },
    {
        "s cap, hence in France the bishop is called  , the jester the word can also mean madman or gannet and in Romania the  . Davidson, p. 42     In some Slavic languages the bishop is called střelec/strelec, which directly translates to English as a shooter meaning an ": null
    },
    {
        "archer": "archery"
    },
    {
        ", while in others it is still known as elephant . In ": null
    },
    {
        "South Slavic languages": "south slavic languages"
    },
    {
        " it is usually known as lovac, meaning hunter , or laufer, taken from the German name for the same piece . An alternative name for bishop in Russian is officer ; it is also called   in Greek,   in Belarusian and oficeri in Albanian.     In ": null
    },
    {
        "Mongolian": "mongolian language"
    },
    {
        " and several Indian languages it is called the  camel .     In Lithuanian it is the , a kind of military commander in ": null
    },
    {
        "medieval Lithuania": "medieval lithuania"
    },
    {
        ".                 ": null
    },
    {
        "Unicode": "unicode"
    }
]