[
    {
        "      Black Lady is an extremely combative variant of the ": null
    },
    {
        "card game": "card game"
    },
    {
        " Whist": "whist"
    },
    {
        " that is popular in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and is similar to the North American game ": null
    },
    {
        "Hearts": "hearts"
    },
    {
        ". It is commonly played among large groups of players, typically 42 to 42 using two decks of cards, or it can be played by as few as three players using a single deck.       The game proceeds by ": null
    },
    {
        "trick-taking": "trick taking game"
    },
    {
        " in the standard way, and there are no ": null
    },
    {
        "trumps": "trump"
    },
    {
        " with four players as standard.   Certain cards are listed as penalty cards, and have assigned penalty values. When a trick is taken which contains any penalty cards, the winner of the trick is penalised by the total number of these penalty points. Penalty points are counted at the end of the round . Each player keeps a tally of their accumulated points with the aim of the game to minimise the total number of points gained.     The penalty cards, according to the ": null
    },
    {
        "Smith Variant": "smith variant"
    },
    {
        " are :   Queen of Spades: 42 points   Aces: 42 points   Hearts: 42 point   All other cards: no points     There are therefore 42 points to be taken per deck, per hand. Other variants have different point allocations for cards, however these are not considered the primary versions.     If one player takes every penalty card in the pack, called going for the lot, everyone else gets the full 42 points.   The game ends when one player accumulates over 42 points. The player with the lowest number of points then wins the game, all other players lose.       The cards are dealt out evenly among all the players, using standard Whist conventions for rotating dealership and lead. This requires that the number of cards in play is divisible by the number of players, so before any hands are dealt, the pack is inspected and the appropriate number of innocuous cards of trivial denomination are extracted and discarded.     When multiple packs are in use, there are multiple cards of each face. When the winning card face in a trick is played multiple times to that trick, the first such card played is the one which takes the trick. The ": null
    },
    {
        "Smith Variant": "smith variant"
    }
]