[
    {
        "   The blinds are ": null
    },
    {
        "forced bets": "betting forced bets"
    },
    {
        " posted by players to the left of the dealer button in ": null
    },
    {
        "flop-style": "community card poker"
    },
    {
        " poker": "poker"
    },
    {
        " games. The number of blinds is usually two, but it can range from none to three.     The small blind is placed by the player to the left of the ": null
    },
    {
        "dealer button": "button"
    },
    {
        " and the big blind is then posted by the next player to the left. The one exception is when there are only two players , when the player on the button is the small blind, and the other player is the big blind.     After the cards are dealt, the player to the left of the big blind is the first to act during the first ": null
    },
    {
        "betting": "betting"
    },
    {
        " round. If any players ": null
    },
    {
        "call": "betting in pokercall"
    },
    {
        " the big blind, the big blind is then given an extra opportunity to ": null
    },
    {
        "raise": "betting in pokerraise"
    },
    {
        ". This is known as a live blind. If the live blind checks, the betting round then ends.     Generally, the big blind is equal to the minimum bet. The small blind is normally half the big blind. In cases where posting exactly half the big blind is impractical due to the big blind being some odd-valued denomination, the small blind is rounded to the nearest practical value. For example, if the big blind in a live table game is $3, then the small blind will usually be $1 or $2 since most casinos do not distribute large quantities of $0.50 poker chips.     The blinds exist because ": null
    },
    {
        "Omaha": "omaha hold em"
    },
    {
        " and ": null
    },
    {
        "Texas hold em": "texas hold em"
    },
    {
        " are frequently played without ": null
    },
    {
        "ante": "betting ante"
    },
    {
        "s, allowing a player to fold his hand without placing a bet. The blind bets introduce a regular cost to take part in the game, thus inducing a player to enter pots in an attempt to compensate for that expense.     It is possible to play without blinds. The minimum bet is then the lowest denomination chip in play, and tossing only one chip is considered as a call. Anything higher than that is considered a raise. Poker without blinds is usually played with everyone posting an ante to receive cards.       In cash games, otherwise known as ": null
    },
    {
        "ring games": "cash game"
    },
    {
        ", blinds primarily serve to ensure all players are subject to some minimum, ongoing cost for participating in the game. This encourages players to play hands they otherwise might not, thereby increasing the average size of the pots and, by extension, increasing the amount of ": null
    },
    {
        "rake": "rake"
    },
    {
        " earned by the cardroom hosting the game.     In cash games, the amount of the blinds are normally fixed for each particular table and will not change for the duration of the game. However, many cardrooms will allow blind levels to change in cases where all players unanimously agree to a change. Larger cardrooms will often include tables with different blind levels to give players the option of playing at whatever stakes they are most comfortable with. In ": null
    },
    {
        "online poker": "online poker"
    },
    {
        ", blinds range from as little as one U.S. cent to USD1,000 or more.     The minimum and maximum buy-in at a table is usually set in relation to the big blind. At live games, the minimum buy-in is usually between 20 and 50 big blinds, while the maximum buy-in is usually between 100 and 250 big blinds. Some online cardrooms offer short stack tables where the maximum buy-in is 50 big blinds or less and/or deep stack tables where the minimum buy-in is 100 big blinds or more.         In cash games that do not deal cards to players who are absent from the table at the start of the hand , special rules are necessary to deal with players who miss their blinds.     In such a situation, if a player misses his or her big blind, he or she will not be dealt in again until the button has passed. At that point, if the player wishes to rejoin the game, he or she must super-post - he or she must post both the big and small blinds in order to be dealt cards. Of these, only the big blind is considered live while the small blind is dead - it is placed in the center of the pot apart from the big blind and will not count towards calling any additional bets or raises by other players. If the player has only missed the small blind, then the same procedure applies except that the player only has to post the dead small blind to rejoin the game. Most cardrooms allow players to relieve themselves of these obligations if they wait until they are again due to post the big blind before rejoining the game.     Some cardrooms hosting live cash games do not allow players to miss and/or avoid paying blinds in this manner. In these games, all players with chips on the table are dealt in whether or not they are present at the table. Any blinds due will be posted from the players stack - depending on the cardrooms rules this will be done either by the dealer, another cardroom employee or a nearby player under staff supervision. Whenever a player has not returned to the table by the time it is his turn to act, his or her hand is automatically folded. Under such rules, if a player wishes to be absent from the table then the only way he or she can avoid paying blinds is to cash out and leave the game altogether.       In ": null
    },
    {
        "poker tournament": "poker tournament"
    },
    {
        " play, blinds serve a dual purpose. In addition to the purpose explained above, blinds are also used to control how long the tournament will last. Before the tournament begins, the players will agree to a blinds structure, usually set by the tournament organizer. This structure defines how long each round is and how much the blinds increase per round. Typically, they are increased at a smooth rate of between 25% and 50% per round over the previous round. As the blinds increase, players need to increase their chip counts to stay in the game. The blinds will eventually consume all of a players stack if he or she does not play to win more.     Unlike many cash games, it is not possible for a player to miss blinds in a tournament. If a player is absent from the table, he will continue to have his or her cards dealt and mucked and will have blinds and, if applicable, antes taken from his stack as they are due, either until he or she returns or until his or her stack is completely consumed by blinds and antes. A player who loses his or her chips in this manner is said to have been blinded off.       There are two main goals for the blinds structure:     Ensure that by the time the desired duration of the tournament is reached, it will be very hard for players with small stacks to stay in the game. This forces players with smaller stacks to play them aggressively, thus increasing their chip count or losing everything quickly.   Ensure that players, in general, do not have a large stack relative to the blind level.     If desired, ": null
    },
    {
        "ante": "betting ante"
    }
]