[
    {
        "      Arthur Blind Blake was an American ": null
    },
    {
        "blues": "Blues"
    },
    {
        " and ": null
    },
    {
        "ragtime": "Ragtime"
    },
    {
        " singer and guitarist. He is known for numerous recordings he made for ": null
    },
    {
        "Paramount Records": "Paramount Records"
    },
    {
        " between 1926 and 1932.       Little is known of Blakes life. Promotional materials from ": null
    },
    {
        "Paramount Records": "Paramount Records"
    },
    {
        " indicate he was born blind and give his birthplace as ": null
    },
    {
        "Jacksonville, Florida": "Jacksonville, Florida"
    },
    {
        ", and it seems that he lived there during various periods. He seems to have had relatives in ": null
    },
    {
        "Patterson, Georgia": "Patterson, Georgia"
    },
    {
        ". Some authors have written that in one recording he slipped into a ": null
    },
    {
        "Geechee": "Geechee"
    },
    {
        " or ": null
    },
    {
        "Gullah": "Gullah"
    },
    {
        " dialect, suggesting a connection with the ": null
    },
    {
        "Sea Islands": "Sea Islands"
    },
    {
        ". ": null
    },
    {
        "Blind Willie McTell": "Blind Willie Mctell"
    },
    {
        " indicated that Blakes real name was Arthur Phelps, but later research has shown this is unlikely to be correct. Balfour, Alan. CD liner notes. Complete Recorded Works in Chronological Order, vol. 4, August 1929 to June 1932. DOCD–5027. Document Records, 1991. In 2011 a group of researchers led by Alex van der Tuuk published various documents regarding Blakes life and death in the journal Blues & Rhythm. One of these documents is his 1934 death certificate, which states he was born in 1896 in ": null
    },
    {
        "Newport News, Virginia": "Newport News, Virginia"
    },
    {
        ", to Winter and Alice Blake . Nothing else is known of Blake until the 1920s, when he emerged as a recording musician.        Blake recorded about 80 tracks for ": null
    },
    {
        "Paramount Records": "Paramount Records"
    },
    {
        " from 1926 to 1932.  He was one of the most accomplished guitarists of his genre and played a diverse range of material. He is best known for his distinctive guitar playing, which was comparable in sound and style to ": null
    },
    {
        "ragtime": "Ragtime"
    },
    {
        " piano.  He seems to have lived in Jacksonville and to have gone to ": null
    },
    {
        "Chicago": "Chicago"
    },
    {
        " for his recording sessions, at one point having an apartment at 31st Street and Cottage Grove Avenue. According to van der Tuuk et al., he apparently returned to Florida for the winter. In the 1930s he was reported to be playing in front of a Jacksonville hotel.       Blake married Beatrice McGee around 1931. In the following year he made his final recording at the Paramount headquarters, in ": null
    },
    {
        "Grafton, Wisconsin": "Grafton, Wisconsin"
    },
    {
        ", just before the label went out of business. For decades nothing was known of him after this point, and it was rumored that he met with a violent death; ": null
    },
    {
        "Reverend Gary Davis": "Reverend Gary Davis"
    },
    {
        " heard he had been hit by a ": null
    },
    {
        "streetcar": "Streetcar"
    },
    {
        " in 1934. The research of van der Tuuk et al. suggests that Blake stayed in Wisconsin, living in ": null
    },
    {
        "Milwaukees": "Milwaukee"
    },
    {
        " Brewers Hill": "Brewers Hill"
    },
    {
        " neighborhood, where Paramount boarded many of its artists. He seems not to have found work as a musician. In April 1933 he was hospitalized with ": null
    },
    {
        "pneumonia": "Pneumonia"
    },
    {
        " and never fully recovered. On December 1, 1934, after three weeks of decline, Beatrice Blake summoned an ambulance. He suffered a ": null
    },
    {
        "pulmonary hemorrhage": "Pulmonary Hemorrhage"
    },
    {
        " and died on the way to the hospital. The cause of death was listed as ": null
    },
    {
        "pulmonary tuberculosis": "Pulmonary Tuberculosis"
    },
    {
        ". He was buried in Glen Oaks Cemetery, in ": null
    },
    {
        "Glendale, Wisconsin": "Glendale, Wisconsin"
    },
    {
        ".       Blakes first recordings were made in 1926,  and his ": null
    },
    {
        "records": "Gramophone Record"
    },
    {
        " sold well. His first solo record was Early Morning Blues , with West Coast Blues on the ": null
    },
    {
        "B-side": "A-Side And B-Side"
    },
    {
        ". Both are considered excellent examples of his ragtime-based guitar style and were prototypes for the burgeoning ": null
    },
    {
        "Piedmont blues": "Piedmont Blues"
    },
    {
        ". Blake made his last recordings in 1932; his career ended with Paramounts bankruptcy. Stefan Grossman and Gayle Dean Wardlow have suggested it is possible that only one side of Blakes last record is actually by him; Jas Obrecht 1993 Champagne Charlie Is My Name does not sound like Blakes playing or singing.     His complex and intricate fingerpicking inspired ": null
    },
    {
        "Reverend Gary Davis": "Reverend Gary Davis"
    },
    {
        ", ": null
    },
    {
        "Jorma Kaukonen": "Jorma Kaukonen"
    },
    {
        ", ": null
    },
    {
        "Ry Cooder": "Ry Cooder"
    },
    {
        ", ": null
    },
    {
        "Arlen Roth": "Arlen Roth"
    },
    {
        ", ": null
    },
    {
        "John Fahey": "John Fahey"
    },
    {
        ", ": null
    },
    {
        "Ralph McTell": "Ralph Mctell"
    },
    {
        ", David Bromberg, ": null
    },
    {
        "Leon Redbone": "Leon Redbone"
    },
    {
        " and many others.     The title track of ": null
    },
    {
        "Bob Dylans": "Bob Dylan"
    },
    {
        "1992 album  Good As I Been to You  is a cover of Blind Blakes You Gonna Quit Me Blues.     The French singer-songwriter ": null
    },
    {
        "Francis Cabrel": "Francis Cabrel"
    },
    {
        " refers to Blake in the song Cent Ans de Plus , on the 1999 album Hors-Saison. The Legendary Blind Blake   Blues in Chicago    Guitar and Vocal   Bootleg Rum Dum Blues 1926–1930    Search Warrant Blues 1926–32   No Dough Blues 1926–29   That Lovin I Crave   Ragtime Guitars Foremost Fingerpicker   Blind Blake 1926–29   The Accompanist    Complete Recorded Works, vols. 1–4    The Master of Ragtime Guitar, The Essential Recordings   Georgie Bound   The Best of Blind Blake    The Essential Blind Blake   All the Published Sides    Blind Blake    The Best of Blind Blake    Southern Rag   The Complete Recordings    The Best of Blind Blake   No Dough Blues   Back Biting Bee Blues   True Revolution   The Rough Guide to Blues Legends: Blind Blake        Blake figures in the plot of ": null
    },
    {
        "Lee Childs": "Lee Child"
    },
    {
        "1997 Jack Reacher novel,  Killing Floor , and there are references to him in Childs 2011 prequel,  The Affair .     Blakes original recording of Diddy Wah Diddy is referenced on the cover of ": null
    },
    {
        "Robert Crumbs": "Robert Crumb"
    },
    {
        "  Zap Comix ": null
    }
]