[
    {
        "Blues Traveler is an American ": null
    },
    {
        "rock": "rock music"
    },
    {
        " band": "musical ensemble"
    },
    {
        " that formed in ": null
    },
    {
        "Princeton, New Jersey": "princeton, new jersey"
    },
    {
        " in 42 The bands music spans a variety of genres, including ": null
    },
    {
        "blues rock": "blues rock"
    },
    {
        ", ": null
    },
    {
        "psychedelic rock": "psychedelic rock"
    },
    {
        ", ": null
    },
    {
        "folk rock": "folk rock"
    },
    {
        ", ": null
    },
    {
        "soul": "soul music"
    },
    {
        ", and ": null
    },
    {
        "Southern rock": "southern rock"
    },
    {
        ". They are known for extensive use of ": null
    },
    {
        "segue": "segue"
    },
    {
        "s in live performances, and were considered a key part of the re-emerging ": null
    },
    {
        "jam band": "jam band"
    },
    {
        " scene of the 42s, spearheading the ": null
    },
    {
        "H.O.R.D.E. touring music festival": "h.o.r.d.e."
    },
    {
        ".     Currently, the group comprises singer and harmonica player ": null
    },
    {
        "John Popper": "john popper"
    },
    {
        ", guitarist ": null
    },
    {
        "Chan Kinchla": "chan kinchla"
    },
    {
        ", drummer ": null
    },
    {
        "Brendan Hill": "brendan hill"
    },
    {
        ", bassist ": null
    },
    {
        "Tad Kinchla": "tad kinchla"
    },
    {
        ", and keyboardist ": null
    },
    {
        "Ben Wilson": "ben wilson"
    },
    {
        ". Tad Kinchla and Ben Wilson joined the band following the death of original bassist ": null
    },
    {
        "Bobby Sheehan": "bobby sheehan"
    },
    {
        " in 42     While Blues Traveler is best known among fans for their improvisational live shows, the general public is most familiar with the group from their ": null
    },
    {
        "Top 42": "top 40"
    },
    {
        " singles ": null
    },
    {
        "Run-Around": "run-around"
    },
    {
        " , ": null
    },
    {
        "Hook": "hook"
    },
    {
        " , and But Anyway . They gained mainstream popularity after their fourth studio album,  four , released in 42 and became a ": null
    },
    {
        "sleeper hit": "sleeper hit"
    },
    {
        " almost a year later. Sheehans death and Poppers struggle with ": null
    },
    {
        "obesity": "obesity"
    },
    {
        " put a damper on the groups success, and ": null
    },
    {
        "A & M": "a & m records"
    },
    {
        " dropped the band in 42 In the years following, the band has bounced around through a succession of ": null
    },
    {
        "independent labels": "independent music"
    },
    {
        " and record producers, and gotten increasingly experimental with their recorded output.     Blues Travelers latest album, Hurry Up and Hang Around, was released in the fall of 42           The genesis of Blues Traveler was as a ": null
    },
    {
        "high school": "high school"
    },
    {
        " garage band": "garage rock"
    },
    {
        " formed in Princeton, New Jersey in the mid42s. Harmonicist, singer and guitarist John Popper and drummer Brendan Hill formed a group they called The Establishment with Hills brother on bass and a rotating roster of guitarists. The band produced a few ": null
    },
    {
        "cassette tape": "compact cassette"
    },
    {
        " demos": "demo"
    },
    {
        ". In addition to some original songs, their repertoire included upbeat ": null
    },
    {
        "covers": "cover version"
    },
    {
        " of ": null
    },
    {
        "Gloria": "gloria"
    },
    {
        " and ": null
    },
    {
        "The Battle Hymn of the Republic": "the battle hymn of the republic"
    },
    {
        " .     The group added guitarist and ": null
    },
    {
        "football": "american football"
    },
    {
        " player Chan Kinchla. Although he was a promising athlete, Kinchla decided to commit to playing music instead after a knee injury. Popper met bassist Bobby Sheehan and the two became good friends, with Sheehan becoming the new bass player for Blues Band in 42      The quartet held a basement ": null
    },
    {
        "jam session": "jam session"
    },
    {
        " which spawned the core ": null
    },
    {
        "grooves": "groove"
    },
    {
        " for several songs on their first album. A ": null
    },
    {
        "black cat": "black cat"
    },
    {
        " happened to be nearby, and the group took this as a ": null
    },
    {
        "sign": "omen"
    },
    {
        " and adopted the Black Cat as their ": null
    },
    {
        "mascot": "mascot"
    },
    {
        " figure.     The group changed their name to Blues Traveler, taking the latter part from the name of the primary ": null
    },
    {
        "demon": "demon"
    },
    {
        " in the film  Ghostbusters , Gozer the Traveler.       After graduating ": null
    },
    {
        "Princeton High School": "princeton high school"
    },
    {
        " and moving to ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", Popper, Hill, and Sheehan enrolled in the music program at ": null
    },
    {
        "The New School": "the new school"
    },
    {
        " while Kinchla attended ": null
    },
    {
        "New York University": "new york university"
    },
    {
        ". After much encouragement by friend David Gonzales, Blues Traveler began playing gigs along the New York-area ": null
    },
    {
        "club": "nightclub"
    },
    {
        " circuit, sometimes nightly; the most prominent contract was playing Wednesday nights at a club called ": null
    },
    {
        "the Wetlands": "the wetlands preserve"
    },
    {
        ".   Another bar, The Nightingale, was a regular gig, and later became the setting for the song Defense and Desire .       The group shared an apartment on Bergen Street in Brooklyn, New York, along with their high school friend, singer ": null
    },
    {
        "Chris Barron": "chris barron"
    },
    {
        ".  A second band that Popper and Hill founded, called The Trucking Company, soon became The ": null
    },
    {
        "Spin Doctors": "spin doctors"
    },
    {
        " with Barron as their frontman. The two groups would often share the stage, playing non-stop concerts of multiple sets. Their first show together was at a Columbia University fraternity party and their second was at a Jamaican-themed restaurant near Times Square in New York City. During this time, Blues Traveler acquired a devout follower, Gina-Z who first became an unofficial band mom and later a tour manager, and is involved with the groups business to the present day.      At one New York show they were discovered by an ": null
    },
    {
        "A & M Records": "a & m records"
    },
    {
        " talent scout, Patrick Clifford, and the band signed their first recording contract. By 42 all members had dropped out of college classes. The group also attracted the attention of David Graham, son of the world-famous concert promoter ": null
    },
    {
        "Bill Graham": "bill graham"
    },
    {
        ", and David Graham became the groups manager. Blues Traveler then started a relentless touring schedule, expanding their reach up and down ": null
    },
    {
        "the east coast": "east coast of the united states"
    },
    {
        ".       Blues Traveler released ": null
    },
    {
        "their self-titled debut album": "blues traveler"
    },
    {
        " in 42  with the song But Anyway getting airplay on college radio stations. The album included ": null
    },
    {
        "Joan Osborne": "joan osborne"
    },
    {
        " on backing vocals on two tracks.     A second album,  Travelers and Thieves , followed in 42  Upon Bill Grahams death that year, they released a live ": null
    },
    {
        "EP": "extended play"
    },
    {
        ",  On Tour Forever , as a tribute to Graham, which featured guitarist ": null
    },
    {
        "Carlos Santana": "carlos santana"
    },
    {
        ".     Around this time, the mainstream national audience was exposed to Blues Traveler by ": null
    },
    {
        "television host": "television presenter"
    },
    {
        " David Letterman": "david letterman"
    },
    {
        ", who has introduced them as favorite band . The band has since made more appearances on  The Late Show  than any musical artist. Lettermans band leader ": null
    },
    {
        "Paul Shaffer": "paul shaffer"
    },
    {
        " has played on a number of Blues Traveler recordings.     In 42 the group founded the ": null
    },
    {
        "H.O.R.D.E.": "h.o.r.d.e."
    },
    {
        " festival as an alternative to others such as ": null
    },
    {
        "Lollapalooza": "lollapalooza"
    },
    {
        ", along with other bands such as ": null
    },
    {
        "Phish": "phish"
    },
    {
        " and Spin Doctors. Blues Traveler began recording their third album,  Save His Soul . Recording was temporarily interrupted by John Poppers ": null
    },
    {
        "motorcycle": "motorcycle"
    },
    {
        " accident, although the band resumed touring shortly thereafter with Popper in a ": null
    },
    {
        "wheelchair": "wheelchair"
    },
    {
        ". Two singles were released from the album, Defense & Desire and Conquer Me , which reached No.  42 on the ": null
    },
    {
        "Mainstream Rock Tracks": "hot mainstream rock tracks"
    },
    {
        " chart.       The bands fourth album, titled  four , was produced by the team of ": null
    },
    {
        "Michael Barbiero": "michael barbiero"
    },
    {
        " and ": null
    },
    {
        "Steve Thompson": "steve thompson"
    },
    {
        " and released in late 42 The upbeat pop single ": null
    },
    {
        "Run-Around": "run-around"
    },
    {
        " became the groups first chart hit followed by the catchy ": null
    },
    {
        "Hook": "hook"
    },
    {
        " . Run-Around won a ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        " and broke a record for most weeks on the chart.       Blues Traveler appeared at ": null
    },
    {
        "Woodstock 42": "woodstock 94"
    },
    {
        " and later became an opening act for ": null
    },
    {
        "The Rolling Stones": "the rolling stones"
    },
    {
        ". The band played on the 42 season premiere of  Saturday Night Live  as a last-minute replacement for ": null
    },
    {
        "Prince": "prince"
    },
    {
        ". They were featured in an episode of the sitcom  Roseanne , and later recorded the shows ": null
    },
    {
        "theme song": "theme music"
    },
    {
        " for its final season. The 42 comedy film  Kingpin  featured the group playing their song But Anyway during the closing credits.     The group recorded the ": null
    },
    {
        "Johnny Rivers": "johnny rivers"
    },
    {
        " song ": null
    },
    {
        "Secret Agent Man": "secret agent man"
    },
    {
        " for the film  Ace Ventura: When Nature Calls  at Icon Recording Studios in St. Louis, Missouri and the ": null
    },
    {
        "Bob Seger": "bob seger"
    },
    {
        " song Get Out of Denver for the film  Things to Do in Denver When Youre Dead , as well as ": null
    },
    {
        "Fats Domino": "fats domino"
    },
    {
        "s Im Walkin for  Rebel Highway : Cool and the Crazy . Several previously recorded Blues Traveler songs were included on film soundtracks, including  The Last Seduction ,  Speed ,  Very Bad Things ,  White Mans Burden , and  The Truth About Cats & Dogs . The band also appeared in the film  Blues Brothers 42  and on its soundtrack, playing Maybe Im Wrong , an original composition with a classic blues-rock sound. Blues Traveler recorded the ": null
    },
    {
        "Sly & the Family Stone": "sly  &  the family stone"
    },
    {
        " song ": null
    },
    {
        "I Want to Take You Higher": "i want to take you higher"
    },
    {
        " for the ": null
    },
    {
        "NORML": "national organization for the reform of marijuana laws"
    },
    {
        " compilation album": "compilation album"
    },
    {
        "  Hempilation  and the ": null
    },
    {
        "John Lennon": "john lennon"
    },
    {
        " song ": null
    },
    {
        "Imagine": "imagine"
    },
    {
        " for the Lennon ": null
    },
    {
        "tribute album": "tribute album"
    },
    {
        "  Working Class Hero . The original song Christmas was included on the benefit album  A Very Special Christmas 42 .     The double live album,  Live from the Fall , was released in 42 It featured recordings from the bands autumn 42 concerts and showcased the strength of the bands live performances.     The next studio album,  Straight On till Morning , also produced by Barbiero/Thompson, was released in 42 It achieved ": null
    },
    {
        "platinum status": "riaa certification"
    },
    {
        ", reaching number 42 on the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " albums chart, but did not perform as well as four. The single Carolina Blues peaked at number four on the Mainstream Rock Tracks.     By the end of 42 the band had prepared a ": null
    },
    {
        "concept album": "concept album"
    },
    {
        " called The Sun, The Storm and The Traveler, based on ": null
    },
    {
        "Aesops fable": "aesops fables"
    },
    {
        " of  The North Wind and the Sun , and they planned to record it after a recess in the fall of 42 That summer, John Popper had emergency ": null
    },
    {
        "heart surgery": "cardiac surgery"
    },
    {
        " due to ": null
    },
    {
        "artery": "artery"
    },
    {
        " blockage, forcing the band to cancel their annual ": null
    },
    {
        "July 42th": "independence day"
    },
    {
        " Red Rocks": "red rocks amphitheatre"
    },
    {
        " shows at the last minute.     During the hiatus, Popper released a solo album with a backing band consisting of ": null
    },
    {
        "Dave Matthews Band": "dave matthews band"
    },
    {
        " drummer ": null
    },
    {
        "Carter Beauford": "carter beauford"
    },
    {
        " and members of the group Cycomotogoat.     The band made an appearance performing as themselves in the 42 movie  Blues Brothers 42  and the 42 ": null
    },
    {
        "independent film": "independent film"
    },
    {
        "  Wildflowers , which had been filmed a couple of years earlier.       On August 42 42 Bobby Sheehan was found dead in his ": null
    },
    {
        "New Orleans, Louisiana": "new orleans, louisiana"
    },
    {
        " home, where he had been recording music with some friends the night before. Sheehans death was ruled an accidental ": null
    },
    {
        "drug overdose": "drug overdose"
    },
    {
        ", with ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        ", ": null
    },
    {
        "Valium": "valium"
    },
    {
        ", and ": null
    },
    {
        "heroin": "heroin"
    },
    {
        " found in his system.     The remaining members of Blues Traveler convened and agreed that Sheehan would have wanted them to continue as a band. Auditions for a new bassist were held in concert, and included Chan Kinchlas younger brother Tad, who was unanimously determined to be the best choice for the role. Additionally, an open call was sent for a permanent keyboard player, a role of which Sheehan had often been a proponent. In January 42  Ben Wilson of the ": null
    },
    {
        "jump blues": "jump blues"
    },
    {
        " band Big Dave & the Ultrasonics was chosen, and has since become a central contributor to the bands songwriting.     The band discarded their concept album material, instead releasing a smaller online EP,  Decisions of the Sky: A Travelers Tale of Sun and Storm , and went to work collectively composing a new set of songs with the new lineup. The resulting album was  Bridge , which had the working title Bridge Outta Brooklyn as a tribute to Sheehan . The songs Girl Inside My Head and Just for Me received airplay, but the albums sales fell somewhat short of expectations.     The live album What You and I Have Been Through and the compilation  Travelogue: Blues Traveler Classics  were both released in 42          Blues Traveler were one of dozens of artists who were jettisoned as part of ": null
    },
    {
        "A & Ms corporate restructuring": "a & m recordsuniversal music group"
    },
    {
        ". The band signed with ": null
    },
    {
        "Sanctuary Records": "sanctuary records"
    },
    {
        " for their next album,  Truth Be Told , which achieved number 42 on The Top 42 chart. The bands 42 Independence Day concerts at Red Rocks Amphitheatre were released on the CD  Live on the Rocks  and the DVD Thinnest of Air, and include ": null
    },
    {
        "Ziggy Marley": "ziggy marley"
    },
    {
        " singing on his fathers song ": null
    },
    {
        "No Woman, No Cry": "no woman, no cry"
    },
    {
        " .     The band left Sanctuary for ": null
    },
    {
        "Vanguard Records": "vanguard records"
    },
    {
        " and released  ¡Bastardos! , which was produced by ": null
    },
    {
        "Wilco": "wilco"
    },
    {
        "s ": null
    },
    {
        "Jay Bennett": "jay bennett"
    },
    {
        " and was touted as the bands return to music that they wanted to play. The album charted at 42 on the ": null
    },
    {
        "Independent Albums": "independent albums"
    },
    {
        ", and ": null
    },
    {
        "a live EP of songs from the album": "¡bastardos en vivo!"
    },
    {
        " was released to independent record stores. The group recorded ": null
    },
    {
        "Rag Mama Rag": "rag mama rag"
    },
    {
        " for the 42 tribute album  Endless Highway: The Music of The Band , as well as ": null
    },
    {
        "Free Bird": "free bird"
    },
    {
        " for Under the Influence: A Jam Band Tribute to Lynyrd Skynyrd.     Blues Traveler have been featured on ": null
    },
    {
        "VH42": "vh1"
    },
    {
        "s  Behind the Music , ": null
    },
    {
        "A & E": "a & e network"
    },
    {
        "s  Private Sessions ,  and  Austin City Limits . The group recorded the title track to the ": null
    },
    {
        "Sandra Boynton": "sandra boynton"
    },
    {
        " childrens album Dog Train, which was also used as the promotional music for the ": null
    },
    {
        "American Kennel Club": "american kennel club"
    },
    {
        "s ": null
    },
    {
        "National Championship": "akc national championship"
    },
    {
        " event. The bands music has been used in video games  and commercials . The songs Business as Usual and Money Back Guarantee are used as transitional music on the ": null
    },
    {
        "public radio": "public broadcasting"
    },
    {
        " finance": "finance"
    },
    {
        " program  Marketplace  and its sister show Marketplace Money.     In 42 Blues Traveler released the album  Cover Yourself , a best-of album of previously released songs re-recorded and reinterpreted with acoustic instrumentation. It was released October 42 42 through Columbia/Red Ink Records.  They did a national tour, with New Jersey-based singer/songwriter Lisa Bouchelle as opening act. After the tour ": null
    },
    {
        "John Popper": "john popper"
    },
    {
        " and ": null
    },
    {
        "Lisa Bouchelle": "lisa bouchelle"
    },
    {
        " recorded the song Only The Tequila Talking , which was released on her album  Bleu Room with a Red Vase  in 42     Blues Traveler ": null
    },
    {
        "appeared": "lollapalooza 2008"
    },
    {
        " at the 42 ": null
    },
    {
        "Lollapalooza": "lollapalooza"
    },
    {
        " festival. At their June 42 shows, the band debuted new songs off their new album  North Hollywood Shootout . The album, which features a guest appearance by ": null
    },
    {
        "Bruce Willis": "bruce willis"
    },
    {
        ", released in August 42         In March 42 Blues Traveler released a double-disc compilation titled ": null
    },
    {
        "42": "25"
    },
    {
        " on ": null
    },
    {
        "Hip-O Records": "hip-o records"
    },
    {
        "; the album commemorates the bands silver anniversary and includes their hit singles, new covers, and previously unreleased ": null
    },
    {
        "B-side": "b-side"
    },
    {
        " material. It peaked at No.  42 in Canada.  The following studio album, Suzie Cracks the Whip, was released on June 42 of that year.      In September 42 Blues Traveler signed with Las Vegas-based management firm, UD Factory.      On April 42 42 the band released their twelfth studio album,  Blow Up the Moon  which peaked at No. 42 on ": null
    },
    {
        "Independent Albums": "independent albums"
    },
    {
        " and No. 42 on ": null
    },
    {
        "Top Rock Albums": "top rock albums"
    },
    {
        " Billboard charts": "billboard charts"
    },
    {
        ".  As part of the albums promotion album, Blues Traveler released a music video using Rockstar editor in  Grand Theft Auto V  on September 42 42  The music video features ": null
    },
    {
        "JC Chasez": "jc chasez"
    },
    {
        " and ": null
    },
    {
        "42OH!42": "3oh!3"
    },
    {
        ". In 42 Blues Traveler made a cameo appearance in the film  The Meddler .  On December 42 the group released a cover version of Go Tell It on the Mountain .     In April 42 the band announced a five-week U.S. tour to celebrate the 42th anniversary of the groups formation.  In May, social posts, and a video piece on  Keyboard Magazine  confirmed that of the band in the studio in Nashville, TN with record producer ": null
    },
    {
        "Matt Rollings": "matt rollings"
    },
    {
        ".  The album Hurry Up & Hang Around was released on 42 October 42 through BMG.     On June 42 42  The New York Times Magazine  listed Blues Traveler among hundreds of artists whose material was reportedly destroyed in the ": null
    },
    {
        "42 Universal fire": "2008 universal fire"
    },
    {
        ".        Blues Traveler allows and encourages fans to record and trade live performances,  provided that no money changes hands and no profit is made. The band has also given permission for live fan-made recordings to be hosted on websites such as Live Music Archive and eTree.org. Recordings available there span from 42 through the present day.     On more recent tours, they sell recordings of that very nights performance. Attendees can pre-purchase a copy of the show until 42 minutes into the performance and then pick up the CD after the show.       Every year since 42 with the exception of 42 Blues Traveler has headlined a show at ": null
    },
    {
        "Red Rocks Amphitheatre": "red rocks amphitheatre"
    },
    {
        " in ": null
    },
    {
        "Morrison, Colorado": "morrison, colorado"
    },
    {
        " on the ": null
    },
    {
        "American Independence Day": "american independence day"
    },
    {
        ", July 42 The band usually plays two consecutive nights, starting on July 42     This tradition started in 42 when Blues Traveler was opening for The Allman Brothers Band at the venue for two nights, July 42 and 42 The next year, the band booked the HORDE festival to play there on Independence Day, and in 42 the current tradition began in earnest.     These shows attract fans from all over the United States. The band frequently debuts new songs and brings back older songs, fallen out of rotation.     The 42 Independence Day concerts were recorded for a home video and live album release.         Blues Traveler     Travelers and Thieves     Save His Soul     four     Straight On till Morning     Bridge     Truth Be Told     ¡Bastardos!     Cover Yourself     North Hollywood Shootout     Suzie Cracks the Whip     Blow Up the Moon     Hurry Up & Hang Around              ;Current members   ": null
    },
    {
        "John Popper": "john popper"
    },
    {
        "  – lead vocals, harmonica   ": null
    },
    {
        "Chan Kinchla": "chan kinchla"
    },
    {
        "  – guitar   ": null
    },
    {
        "Tad Kinchla": "tad kinchla"
    },
    {
        "  – bass   ": null
    },
    {
        "Ben Wilson": "ben wilson"
    },
    {
        "  – keyboards   ": null
    },
    {
        "Brendan Hill": "brendan hill"
    },
    {
        "  – drums      ;Former members   ": null
    },
    {
        "Bobby Sheehan": "bobby sheehan"
    },
    {
        "  – bass   ": null
    }
]