[
    {
        "   Blue Corpse is the fifteenth album by ": null
    },
    {
        "Jandek": "jandek"
    },
    {
        ", and his second for 42 Primarily an all acoustic album with an unknown accompanist , it is considered by many to be one of the more accessible and cohesive albums in Jandeks oeuvre.         The cover of Blue Corpse completes the series of images that began with  Telegraph Melts  and was continued with  Modern Dances  . While the cover of  Modern Dances  shows the artist standing still and looking forward, the cover of Blue Corpse shows the artist in mid stride, producing a blurred image of the artist.         The tracks I Passed by the Building through Variant features an unknown man on lead vocals, and it is presumed that Jandek plays the guitar on these tracks. The tracks Part II through Only Lover appear to switch up this arrangement and feature Jandek on lead vocals and the unknown accompanist playing proficient blues guitar, with the except of Harmonica which features solo harmonica. Quinn Boys appears to be Jandek solo, while the closer One Minute features the unknown accompanist singing lead vocals and it is unknown who is playing drums.     Not unlike its follow up, 42s  You Walk Alone , the songs appear to be recorded in one session or in multiple sessions under the same conditions. This quality gives the album a cohesiveness that sets it apart from albums like  Chair Beside a Window  that appear to be compilations of multiple sessions under different conditions and with different players.     The album seems to center around the dissolution of a relationship which has led to many theories. Some have theorized that because from this point on it is not clear that Nancy is ever featured on an album again, it may be referring to her departure. It is unknown if there is any merit to this theory because no definitive proof exists.     Part II appears to be the second half of Your Other Man but for some reason is sequenced right before that track. ": null
    },
    {
        "House of the Rising Sun": "house of the rising sun"
    },
    {
        " is the first and only adaptation of a traditional song found in Jandeks discography, it features a unique arrangement and does not borrow from any other modern arrangement of the song. Quinn Boys gets a sequel on 42s  You Walk Alone  which contains the same lyrics.                 This newer album contains more folk sounds and less of the dissonance Jandek is so well known for... Jandeks angst-ridden vocals... filled with trials and tribulations... -- Art Black Away From the Pulsebeat            ": null
    }
]