[
    {
        "              A boat is a ": null
    },
    {
        "watercraft": "watercraft"
    },
    {
        " of a large range of types and sizes, but generally smaller than a ": null
    },
    {
        "ship": "ship"
    },
    {
        ", which is distinguished by its larger size, shape, cargo or passenger capacity, or its ability to carry boats.     Small boats are typically found on inland waterways such as ": null
    },
    {
        "rivers": "river"
    },
    {
        "and ": null
    },
    {
        "lake": "lake"
    },
    {
        "s, or in protected coastal areas. However, some boats, such as the ": null
    },
    {
        "whaleboat": "whaleboat"
    },
    {
        ", were intended for use in an offshore environment. In modern ": null
    },
    {
        "naval": "navy"
    },
    {
        " terms, a boat is a vessel small enough to be carried aboard a ship. Anomalous definitions exist, as ": null
    },
    {
        "lake freighters": "lake freighter"
    },
    {
        "  long on the ": null
    },
    {
        "Great Lakes": "great lakes"
    },
    {
        " are called boats .     Boats vary in proportion and construction methods with their intended purpose, available materials, or local traditions. ": null
    },
    {
        "Canoes": "canoe"
    },
    {
        "have been used since prehistoric times and remain in use throughout the world for transportation, fishing, and sport. ": null
    },
    {
        "Fishing boats": "fishing boat"
    },
    {
        "vary widely in style partly to match local conditions. ": null
    },
    {
        "Pleasure craft": "pleasure boat"
    },
    {
        " used in ": null
    },
    {
        "recreational boating": "boating"
    },
    {
        " include ski boats, ": null
    },
    {
        "pontoon boats": "pontoon"
    },
    {
        ", and ": null
    },
    {
        "sailboat": "sailboat"
    },
    {
        "s. ": null
    },
    {
        "House boats": "house boat"
    },
    {
        "may be used for vacationing or long-term residence. ": null
    },
    {
        "Lighters": "lighter"
    },
    {
        " are used to convey cargo to and from large ships unable to get close to shore. ": null
    },
    {
        "Lifeboats": "lifeboat"
    },
    {
        "have rescue and safety functions.     Boats can be propelled by manpower , wind , and motor .            Boats have served as transportation since the earliest times.  Circumstantial evidence, such as the ": null
    },
    {
        "early settlement of Australia": "early human migrationsoceania"
    },
    {
        " over 40,000 years ago, findings in ": null
    },
    {
        "Crete": "crete"
    },
    {
        " dated 130,000 years ago,  and in Flores dated to 900,000 years ago, . Archive.archaeology.org. Retrieved on 2013-11-16. suggest that boats have been used since prehistoric times. The earliest boats are thought to have been ": null
    },
    {
        "dugouts": "dugout"
    },
    {
        ",      and the oldest boats found by archaeological excavation date from around 7,000–10,000 years ago. The oldest recovered boat in the world, the ": null
    },
    {
        "Pesse canoe": "pesse canoe"
    },
    {
        ", found in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", is a dugout made from the hollowed tree trunk of a  Pinus sylvestris  that was constructed somewhere between 8200 and 7600 BC. This ": null
    },
    {
        "canoe": "canoe"
    },
    {
        " is exhibited in the Drents Museum in Assen, Netherlands.   Other very old dugout boats have also been recovered.        ": null
    },
    {
        "Rafts": "raft"
    },
    {
        "have operated for at least 8,000 years.        A 7,000-year-old seagoing ": null
    },
    {
        "reed boat": "reed boat"
    },
    {
        " has been found in ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        ".    Boats were used between 4000 and 3000 BC in ": null
    },
    {
        "Sumer": "sumer"
    },
    {
        ", ": null
    },
    {
        "ancient Egypt": "ancient egypt"
    },
    {
        "  and in the ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        ".     Boats played an important role in the commerce between the ": null
    },
    {
        "Indus Valley Civilization": "indus valley civilization"
    },
    {
        " and ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        ".  Evidence of varying models of boats has also been discovered at various Indus Valley archaeological sites.    ": null
    },
    {
        "Uru": "uru"
    },
    {
        " craft originate in ": null
    },
    {
        "Beypore": "beypore"
    },
    {
        ", a village in south ": null
    },
    {
        "Calicut": "kozhikode"
    },
    {
        ", ": null
    },
    {
        "Kerala": "kerala"
    },
    {
        ", in southwestern ": null
    },
    {
        "India": "india"
    },
    {
        ". This type of mammoth wooden ship was constructed solely of teak, with a transport capacity of 400 tonnes. The ancient Arabs and Greeks used such boats as trading vessels.      The historians ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        ", ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        " and ": null
    },
    {
        "Strabo": "strabo"
    },
    {
        " record the use of boats for commerce, travel, and military purposes.                  Boats can be categorized into three main types:   Unpowered or human-powered. Unpowered craft include ": null
    },
    {
        "rafts": "raft"
    },
    {
        "meant for one-way downstream travel. Human-powered boats include ": null
    },
    {
        "canoe": "canoe"
    },
    {
        "s, ": null
    },
    {
        "kayak": "kayak"
    },
    {
        "s, ": null
    },
    {
        "gondolas": "gondola"
    },
    {
        "and boats propelled by poles like a ": null
    },
    {
        "punt": "punt"
    },
    {
        ".   ": null
    },
    {
        "Sailboat": "sailboat"
    },
    {
        "s, propelled mainly by means of ": null
    },
    {
        "sail": "sail"
    },
    {
        "s.   ": null
    },
    {
        "Motorboat": "motorboat"
    },
    {
        "s, propelled by mechanical means, such as ": null
    },
    {
        "engine": "engine"
    },
    {
        "s.          The ": null
    },
    {
        "hull": "hull"
    },
    {
        " is the main, and in some cases only, structural component of a boat. It provides both capacity and ": null
    },
    {
        "buoyancy": "buoyancy"
    },
    {
        ". The ": null
    },
    {
        "keel": "keel"
    },
    {
        " is a boats backbone , a lengthwise structural member to which the perpendicular frames are fixed. On most boats a ": null
    },
    {
        "deck": "deck"
    },
    {
        " covers the hull, in part or whole. While a ": null
    },
    {
        "ship": "ship"
    },
    {
        " often has several decks, a boat is unlikely to have more than one. Above the deck are often ": null
    },
    {
        "lifelines": "lifeline"
    },
    {
        " connected to ": null
    },
    {
        "stanchion": "stanchion"
    },
    {
        "s, ": null
    },
    {
        "bulwarks": "bulwark"
    },
    {
        "perhaps topped by ": null
    },
    {
        "gunnel": "gunnel"
    },
    {
        "s, or some combination of the two. A ": null
    },
    {
        "cabin": "cabin"
    },
    {
        " may protrude above the deck forward, aft, along the centerline, or covering much of the length of the boat. Vertical structures dividing the internal spaces are known as ": null
    },
    {
        "bulkhead": "bulkhead"
    },
    {
        "s.     The forward end of a boat is called the ": null
    },
    {
        "bow": "bow"
    },
    {
        ", the aft end the ": null
    },
    {
        "stern": "stern"
    },
    {
        ". Facing forward the right side is referred to as ": null
    },
    {
        "starboard": "starboard"
    },
    {
        " and the left side as ": null
    },
    {
        "port": "port and starboard"
    },
    {
        ".                  Until the mid-19th century most boats were made of natural materials, primarily wood, although ": null
    },
    {
        "reed": "reed"
    },
    {
        ", bark and animal skins were also used. Early boats include the bound-reed style of boat seen in Ancient Egypt, the ": null
    },
    {
        "birch bark": "birch bark"
    },
    {
        " canoe": "canoe"
    },
    {
        ", the animal hide-covered ": null
    },
    {
        "kayak": "kayak"
    },
    {
        "  and ": null
    },
    {
        "coracle": "coracle"
    },
    {
        " and the ": null
    },
    {
        "dugout canoe": "dugout canoe"
    },
    {
        " made from a single log.     By the mid-19th century, many boats had been built with iron or steel frames but still planked in wood. In 1855 ferro-cement boat construction was patented by the French, who coined the name ferciment . This is a system by which a steel or iron wire framework is built in the shape of a boats hull and covered over with cement. Reinforced with bulkheads and other internal structure it is strong but heavy, easily repaired, and, if sealed properly, will not leak or corrode. These materials and methods were copied all over the world and have faded in and out of popularity to the present time.     As the forests of Britain and Europe continued to be over-harvested to supply the keels of larger wooden boats, and the ": null
    },
    {
        "Bessemer process": "bessemer process"
    },
    {
        "  cheapened the cost of steel, steel ships and boats began to be more common. By the 1930s boats built entirely of steel from frames to plating were seen replacing wooden boats in many industrial uses and fishing fleets. Private recreational boats of steel remain uncommon. In 1895 WH Mullins produced steel boats of galvanized iron and by 1930 became the worlds largest producer of pleasure boats.     Mullins also offered boats in aluminum from 1895 through 1899 and once again in the 1920s, WH Mullins boat history, Salem Ohio  but it wasnt until the mid-20th century that ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " gained widespread popularity. Though much more expensive than steel, aluminum alloys exist that do not corrode in salt water, allowing a similar load carrying capacity to steel at much less weight.     Around the mid-1960s, boats made of ": null
    },
    {
        "fiberglass": "fiberglass"
    },
    {
        " became popular, especially for recreational boats. Fiberglass is also known as GRP in the UK, and FRP in the US. Fiberglass boats are strong, and do not rust, corrode, or rot. Instead, they are susceptible to structural degradation from sunlight and extremes in temperature over their lifespan. Fiberglass structures can be made stiffer with sandwich panels, where the fiberglass encloses a lightweight core such as balsa .. as in the ": null
    },
    {
        "Iroqois": "iroqois"
    },
    {
        " catamaran": "catamaran"
    },
    {
        " or foam.     ": null
    },
    {
        "Cold moulding": "cold moulding"
    },
    {
        " is a modern construction method, using wood as the structural component. In cold moulding very thin strips of wood are layered over a form. Each layer is coated with resin, followed by another directionally alternating layer laid on top. Subsequent layers may be stapled or otherwise mechanically fastened to the previous, or weighted or vacuum bagged to provide compression and stabilization until the resin sets.          The most common means of boat propulsion are as follows:   Engine   ": null
    },
    {
        "Inboard motor": "inboard motor"
    },
    {
        " Stern drive": "stern drive"
    },
    {
        "   Outboard motor": "outboard motor"
    },
    {
        " Paddle wheel": "paddle wheel"
    },
    {
        " jetboat": "jetboat"
    },
    {
        ", ": null
    },
    {
        "personal water craft": "personal water craft"
    },
    {
        "hovercraft": "hovercraft"
    },
    {
        ", ": null
    },
    {
        "air boat": "air boat"
    },
    {
        "rowing": "watercraft rowing"
    },
    {
        ", ": null
    },
    {
        "paddling": "watercraft paddling"
    },
    {
        ", ": null
    },
    {
        "setting pole": "setting pole"
    },
    {
        " etc.": null
    },
    {
        "sail": "sails"
    },
    {
        "ing": null
    },
    {
        "u": "u"
    },
    {
        "ipboa": "ipboa"
    },
    {
        "front": null
    },
    {
        "sc": "sc"
    }
]