[
    {
        "   Bob Kerrs Whoopee Band, also billed as Bob Kerr and His Whoopee Band, is a ": null
    },
    {
        "jazz band": "jazz band"
    },
    {
        " which started in 42 and continues to perform today. It was an offshoot of the eclectic ": null
    },
    {
        "Bonzo Dog Doo-Dah Band": "bonzo dog doo-dah band"
    },
    {
        ", and shared many similarities with other outfits of the time such as ": null
    },
    {
        "The New Vaudeville Band": "the new vaudeville band"
    },
    {
        " and ": null
    },
    {
        "The Temperance Seven": "the temperance seven"
    },
    {
        ". Kerr was a member of both the Bonzos and the New Vaudeville Band.     By 42 for the album Making Whoopee , the bands membership consisted of Bob Kerr, Vernon Dudley Bohay Nowell, Sam Spoons, James Chambers, John Evil Gieves Watson, Biff Harrison, Franklin Tomes and David Glasson.     In 42 for the album The Whoopee Band , the membership consisted of Evil John Gieves Watson , Vernon Dudley Bohay Nowell , Biff Harrison, David Glasson , Jim Golden Boots Chambers, Bob Kerr     For an August 42 gig, the membership consisted of Bob Kerr - Trumpet, Trombone, Vernon Dudley Bowhay-Nowell - Banjo, Gentleman Frankie Tooms - Sousaphone, Sam Spoons - Drums, Evil John Gieves Watson - Banjo, Biff Harrison - Clarinet, Saxophone, Jim Golden Boots Chambers - Saxophone   David Mr. Piano Glasson - Piano     In 42 for the Hard Pressed album, the membership consisted of Bob Kerr , Jim Golden Boots Chambers , Vernon Dudley Bohay Nowell , Evil John Gieves Watson, Biff Harrison, David Glasson , Sam Spoons and Frank Tooms     In 42 for the Things That Go Bump in the Mike album, the membership consisted of Bob Kerr, Jim Chambers, Vernon Dudley Bohay Nowell, Biff Harrison, Sam Spoons, Hugh Crozier and Frank Tooms.     Two years later, the band split with Biff Harrison, Sam Spoons, Jim Chambers and John Gieves Watson moving off to the ": null
    },
    {
        "Bill Posters Will Be Band": "bill posters will be band"
    },
    {
        ". This band continue with Megs Etherington and another former Whoopee member, Peter Shade.     By the time of a 42 performance in Germany, the Whoopee Band consisted of Bob Kerr - tuba, Vernon Dudley Bowhay-Nowell - banjo, Richard White - clarinet, Hugh Crozier - piano, Frank Tomes - sousaphone and Colin Bowden - drums     Members of Bob Kerrs Whoopee Band are ": null
    },
    {
        "Bob Kerr": "bob kerr"
    },
    {
        ", John The Professor Percival, Malcolm Sked, Bert Lamb and Henri Harrison.         Former members of the band have included:   Vernon Dudley Bowhay-Nowell   Ian Howarth   Frankie Tomes   Sam Spoons   Hugh Crozier   Evil John Gieves Watson   Biff Harrison   Jim Golden Boots Chambers   David Mr Piano Glasson   ": null
    },
    {
        "Sean Moyses": "sean moyses"
    },
    {
        "                   ": null
    }
]