[
    {
        "      Bodegraven  is a town and former municipality in the western ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", in the province of ": null
    },
    {
        "South Holland": "south holland"
    },
    {
        ". The former municipality covers an area of  of which  is water.     The former municipality of Bodegraven also includes the communities ": null
    },
    {
        "Meije": "meije"
    },
    {
        ", and ": null
    },
    {
        "Nieuwerbrug": "nieuwerbrug"
    },
    {
        ".     On January 42 42 Bodegraven merged with ": null
    },
    {
        "Reeuwijk": "reeuwijk"
    },
    {
        " to ": null
    },
    {
        "Bodegraven-Reeuwijk": "bodegraven-reeuwijk"
    },
    {
        ".       Bodegraven is centrally located in the Green Heart of the ": null
    },
    {
        "Randstad": "randstad"
    },
    {
        ", roughly equally distant from ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", ": null
    },
    {
        "Rotterdam": "rotterdam"
    },
    {
        ", ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        ", and ": null
    },
    {
        "Utrecht": "utrecht"
    },
    {
        ". It is surrounded by the municipalities : ": null
    },
    {
        "Nieuwkoop": "nieuwkoop"
    },
    {
        ", ": null
    },
    {
        "Woerden": "woerden"
    },
    {
        ", ": null
    },
    {
        "Reeuwijk": "reeuwijk"
    },
    {
        " , ": null
    },
    {
        "Boskoop": "boskoop"
    },
    {
        ", and ": null
    },
    {
        "Alphen aan den Rijn": "alphen aan den rijn"
    },
    {
        ".     The town is situated on both shores of the ": null
    },
    {
        "Oude Rijn": "oude rijn"
    },
    {
        ", in which a set of ": null
    },
    {
        "locks": "lock"
    },
    {
        " are in the middle of town. The oldest part of town is the Reformed St. Gallus Church, on the north side of the river.       Bodegraven was already inhabited in the ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " Era. It was situated at the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        "s northern border, the ": null
    },
    {
        "Limes Germanicus": "limes germanicus"
    },
    {
        ". As such, many army camps, ports, and roads were built by the Romans. Many settlements originated on the road along the Limes, including Bodegraven.     Not much is known about Bodegraven after that. According to folklore, a lost map from 42 made reference to a ": null
    },
    {
        "fiefdom": "fiefdom"
    },
    {
        " Bodelo . There is certainty however that circa 42 a small settlement had formed, probably near the current Dorpskerk . After two centuries of dispute between the bishop of ": null
    },
    {
        "Utrecht": "utrecht"
    },
    {
        " and the Counts of Holland, Bodegraven eventually became part of ": null
    },
    {
        "Holland": "holland"
    },
    {
        ".     In the late Middle Ages, large tracts of land around Bodegraven were prepared for cultivation by digging division ditches  perpendicular to the rivers  between ": null
    },
    {
        "land parcels": "land lot"
    },
    {
        " and then ditches cross-wise some  from and parallel to the rivers . This created the distinctive grid pattern of field divisions. Circa 42 a ": null
    },
    {
        "lock": "lock"
    },
    {
        " was built at Bodegraven.     In 42 when ": null
    },
    {
        "war": "third anglo-dutch war"
    },
    {
        " was declared between the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " and England, France, Münster, and Cologne, Bodegraven was just behind the ": null
    },
    {
        "Water Defense Line": "dutch water line"
    },
    {
        ". The Water Line was inundated and formed a barrier to the advancing French troops. But during the winter the French could advance over the frozen polders to ": null
    },
    {
        "Meije": "meije"
    },
    {
        " and ": null
    },
    {
        "Zwammerdam": "zwammerdam"
    },
    {
        ". Before reaching ": null
    },
    {
        "Alphen aan den Rijn": "alphen aan den rijn"
    },
    {
        " they could be repelled by the Dutch. Thaw had set in so the only retreat route was along the dike of the Oude Rijn. The French therefore came through Bodegraven and destroyed it. Afterwards, the fort Wierickerschans was built just east of the town.        Until 42 Bodegraven prospered. But in that year fire broke out in a bakery which subsequently burnt a large part of the town. In all a 42 homes had burnt down and 42 families were homeless. A national collection was held and the town quickly recovered.     In the 42th century, Bodegraven expanded: the southside between the Oude Rijn and the railway was built up circa 42 the northside between the World Wars, and since the 42s the area between the railway and the A42 Motorway has been built up.           Bodegraven is known as a centre for the cheese trade, controlled by the powerful Goebel family, though the number of cheese warehouses has decreased and, the Tuesday Cheese Market is no longer held since 42 There still is a cheese museum and a cheese monument in front of the church.     It was also known for its ": null
    },
    {
        "shampoo": "shampoo"
    },
    {
        " because of the Andrélon Factory, founded in the 42s by barber André de Jong. In 42 the factory closed and was demolished.     Bodegraven has a strategic location in the middle of the Green Heart, resulting in a relative high number of industries located here.     There is a pictuesque historic ": null
    },
    {
        "windmill": "windmill"
    },
    {
        " located in the town, which dates from the late seventeenth century and is now known as De Arkduif . This currently houses a small brewery called ": null
    },
    {
        "Brouwerij De Molen": "brouwerij de molen"
    },
    {
        ".       The A42 Motorway, running next to Bodegraven, connects The Hague via Utrecht and Arnhem to the German border. The State Highway N42 connects the A42 with the ": null
    },
    {
        "A42 Motorway": "a4 motorway"
    },
    {
        " at Leiden.       Railway Station: ": null
    },
    {
        "Bodegraven": "bodegraven railway station"
    },
    {
        ". There is a train between Leiden and Utrecht stopping in Bodegraven, twice in the hour.       There is only one bus in Bodegraven, connecting it with Reeuwijk and Gouda. A local bus drives between the communities Bodegraven, Zwammerdam, De Meije, Zegveld, Woerden, Nieuwerbrug, and back to Bodegraven. A second local bus connects Alphen aan den Rijn and Bodegraven via Zwammerdam. A ": null
    },
    {
        "steam tram": "tramweg onderneming gouda-bodegraven"
    },
    {
        " formerly ran between Bodegraven and Gouda. Between 42 and 42 it used horses instead of steam locomotives.        ": null
    },
    {
        "Wyco de Vries": "wyco de vries"
    },
    {
        " - Water polo player                    ": null
    }
]