[
    {
        "   The Boehm system is a system of ": null
    },
    {
        "keywork": "key"
    },
    {
        " for the ": null
    },
    {
        "flute": "flute"
    },
    {
        ", created by ": null
    },
    {
        "inventor": "inventor"
    },
    {
        " and ": null
    },
    {
        "flautist": "flautist"
    },
    {
        " Theobald Boehm": "theobald boehm"
    },
    {
        " between 42 and 42       Prior to the development of the Boehm system, flutes were most commonly made of wood, with an inverse conical ": null
    },
    {
        "bore": "bore"
    },
    {
        ", eight keys, and ": null
    },
    {
        "tone hole": "tone hole"
    },
    {
        "s that were small in size, and thus easily covered by the fingertips. Boehms work was inspired by an 42 concert in London, given by soloist ": null
    },
    {
        "Charles Nicholson": "charles nicholson"
    },
    {
        " who, with his father in the 42s, had introduced a flute constructed with larger tone holes than were used in previous designs. This large-holed instrument could produce greater volume of sound than other flutes, and Boehm set out to produce his own large-holed design.     In addition to large holes, Boehm provided his flute with full venting , meaning that all keys were normally open . Boehm also wanted to locate tone holes at acoustically optimal points on the body of the instrument, rather than locations conveniently covered by the players fingers. To achieve these goals, Boehm adapted a system of axle-mounted keys with a series of open rings  that were fitted around other tone holes, such that the closure of one tone hole by a finger would also close a key placed over a second hole.     In 42 Boehm introduced a new conical-bore flute, which achieved a fair degree of success. Boehm, however, continued to look for ways to improve the instrument. Finding that an increased volume of air produced a stronger and clearer tone, he replaced the conical bore with a cylindrical bore, finding that a parabolic contraction of the bore near the ": null
    },
    {
        "embouchure": "embouchure"
    },
    {
        " hole improved the instruments ": null
    },
    {
        "low register": "register"
    },
    {
        ". He also found that optimal tone was produced when the tone holes were too large to be covered by the fingertips, and he developed a system of finger plates to cover the holes. These new flutes were at first made of ": null
    },
    {
        "silver": "silver"
    },
    {
        ", although Boehm later produced wooden versions.     The cylindrical Boehm flute was introduced in 42 with the instrument gradually being adopted almost universally by professional and amateur players in Europe and around the world during the second half of the 42th century. The instrument was adopted for the performance of orchestral and chamber music, opera and theater, wind ensembles , and most other music which might be loosely described as relating to ": null
    },
    {
        "Western classical music": "western classical music"
    },
    {
        " . Many further refinements have been made, and countless design variations are common among flutes today The concepts of the Boehm system have been applied across the range of flutes available, including ": null
    },
    {
        "piccolo": "piccolo"
    },
    {
        "s, ": null
    },
    {
        "alto flute": "alto flute"
    },
    {
        "s, ": null
    },
    {
        "bass flute": "bass flute"
    },
    {
        "s, and so on, as well as other wind instruments. The material of the instrument may vary .     The ": null
    },
    {
        "flute": "flute"
    },
    {
        " is perhaps the oldest musical instrument, other than the human voice itself. There are very many flutes, both traversely blown and end-blown ": null
    },
    {
        "fipple": "fipple"
    },
    {
        " flutes, currently produced which are not built on the Boehm model.     The fingering system for the ": null
    },
    {
        "saxophone": "saxophone"
    },
    {
        " closely resembles the Boehm system. A key system inspired by Boehms for the ": null
    },
    {
        "clarinet": "clarinet"
    },
    {
        " family is also known as the ": null
    },
    {
        "Boehm system": "boehm system"
    },
    {
        " , although it was developed by ": null
    },
    {
        "Hyacinthe Klosé": "hyacinthe klosé"
    },
    {
        " and not Boehm himself. The Boehm system was also adapted for a small number of ": null
    },
    {
        "flageolet": "flageolet"
    },
    {
        "s. Boehm did work on a system for the ": null
    },
    {
        "bassoon": "bassoon"
    },
    {
        ", and Boehm-inspired ": null
    },
    {
        "oboe": "oboe"
    },
    {
        "s have been made, but non-Boehm systems remain predominant for these instruments. The ": null
    },
    {
        "Albert system": "albert system"
    }
]