[
    {
        "        Bologna Football Club 42, commonly referred to as Bologna , is an ": null
    },
    {
        "Italian football": "football in italy"
    },
    {
        " club based in ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        ", ": null
    },
    {
        "Emilia-Romagna": "emilia-romagna"
    },
    {
        ". The club are nicknamed the Rossoblu due to the red-and-blue striped shirts which they wear, which are also the official colours of the city.     Bologna were founding members of ": null
    },
    {
        "Serie A": "serie a"
    },
    {
        " in 42 During its history, the club has won the Italian league championship seven times, making them the sixth most successful team in the history of the league.   They have participated in 42 Serie A championships out of 42 currently ninth in the ranking of the highest number of appearances of the formations in the highest Italian category.     Bologna currently plays in ": null
    },
    {
        "Serie A": "serie a"
    },
    {
        ", the highest level of the Italian football pyramid, for the fifth consecutive year.     Since ": null
    },
    {
        "42": "1927"
    },
    {
        " the team has been competing in its internal competitions in the ": null
    },
    {
        "Stadio Renato DallAra": "stadio renato dallara"
    },
    {
        ", born as Stadio del Littoriale and called, from the postwar period until 42 Stadio Comunale. The stadium can host more than 42 spectators.       Bologna Football Clubs formation was orchestrated by Emilio Arnstein, an Austrian who became interested in ": null
    },
    {
        "football": "association football"
    },
    {
        " at university in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " and ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". He and his brother had previously founded another football club, ": null
    },
    {
        "Black Star": "black star f.c."
    },
    {
        ", in Austria.        The club was founded on 42 October 42 in the Northern Italian city of ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        ". Upon its formation, Carlo Sandoni was the clubs sponsor and general manager, Swiss Louis Rauch became president, ": null
    },
    {
        "nobleman": "nobleman"
    },
    {
        " Guido Della Valle was the vice-president, Enrico Penaglia secretary, Sergio Lampronti ": null
    },
    {
        "cashier": "cashier"
    },
    {
        ", while Emilio Arnstein and Leone Vincenzi were appointed councilmen.     On 42 March 42 Bologna played their first ever game, against ": null
    },
    {
        "Virtus": "virtus bologna"
    },
    {
        ", who wore white shirts. Bologna outclassed their opponents, winning 42–42 The first football squad featured; Koch, Chiara, Pessarelli, Bragaglia, Guido Della Valle, Nanni, Donati, Rauch, Bernabeu, Mezzano, and Gradi.        Their formative season was spent in the regional league under Arrigo Gradi as captain, Bologna won their league gaining promotion to a league named Group Veneto-Emiliano. They spent four seasons in this league, never finishing lower than fifth. Bologna were entered into the Northern League before all football leagues were postponed for World War I.       After the ": null
    },
    {
        "first war": "world war i"
    },
    {
        ", Bologna began to become more successful. First reaching the semi-finals of the Northern Italian competition in 42–42 they went one better the following season by reaching the Northern League finals, going out 42–42 to ": null
    },
    {
        "Pro Vercelli": "u.s. pro vercelli calcio"
    },
    {
        ". They would equal this again in 42–42 coming runner up to eventual national champions ": null
    },
    {
        "Genoa": "genoa c.f.c."
    },
    {
        ".     Bologna became Northern and National League champions for the first time during 42–42 beating ": null
    },
    {
        "Genoa CFC": "genoa cfc"
    },
    {
        " after five hard-fought final matches to take the championship. The finals against the Ligurian giants were marred by heavy crowd troubles. A few seasons later Bologna became champions of Italy for the second time in 42–42 giving them a foothold in Italian football, building up a legacy, this was the last time the league was competed in the old system, Serie A was instated the following year.        The  Scudetto  was won by Bologna four more times before World War II, these were achieved in; 42–42 42–42 42–42 and 42–42       After ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the club was less successful. Throughout the 42s and 42s, the club generally floated between fourth, fifth and sixth position in the league, until they took the league title back in 42–42 To date this remains their last ": null
    },
    {
        "Serie A": "serie a"
    },
    {
        " championship, bringing the clubs total to seven. This qualified Bologna to the ": null
    },
    {
        "42–42 European Cup": "1964–65 european cup"
    },
    {
        " , but they were eliminated in the preliminary round against ": null
    },
    {
        "Anderlecht": "r.s.c. anderlecht"
    },
    {
        ".        It was not all doom and gloom for the club, however; in the 42s, they won the ": null
    },
    {
        "Italian Cup": "italian cup"
    },
    {
        " twice, the second of which was disputed against ": null
    },
    {
        "Palermo": "u.s. città di palermo"
    },
    {
        ". The game was tense and finished 42–42 before going to a ": null
    },
    {
        "penalty shootout": "penalty shootout"
    },
    {
        ", where Bologna won 42–42       Beginning in the 42–42 season, the club began to slide. First, they were relegated from Serie A after battling it out for survival with ": null
    },
    {
        "Cagliari": "cagliari calcio"
    },
    {
        " and ": null
    },
    {
        "Genoa": "genoa c.f.c."
    },
    {
        ". They were relegated twice in succession and slid into ": null
    },
    {
        "Serie C42": "serie c1"
    },
    {
        ". They won their way out of C42 the next year, and returned to Serie A for the 42–42 season after four years of fighting it out in ": null
    },
    {
        "Serie B": "serie b"
    },
    {
        ".     They did not remain long, however, being relegated in 42 and returning to Serie C42 in 42 The club returned to Serie A for 42 Two years later, Bologna tasted a slice of success on the European stage, winning the ": null
    },
    {
        "UEFA Intertoto Cup": "uefa intertoto cup"
    },
    {
        " and playing in the ": null
    },
    {
        "UEFA Cup": "uefa cup"
    },
    {
        ". The club remained in Serie A until the ": null
    },
    {
        "42–42": "2004–05 serie a"
    },
    {
        " campaign, losing to ": null
    },
    {
        "Parma": "parma f.c."
    },
    {
        " in the playoffs.       Despite losing some key players, Bologna expected to be challenging strongly for promotion from ": null
    },
    {
        "Serie B": "serie b"
    },
    {
        " in the ": null
    },
    {
        "42–42 campaign": "2005–06 serie b"
    },
    {
        ". Despite its ambition, however, Bologna had a poor start to the season, causing the sacking of experienced coach ": null
    },
    {
        "Renzo Ulivieri": "renzo ulivieri"
    },
    {
        ", replaced by former ": null
    },
    {
        "Internazionale": "f.c. internazionale milano"
    },
    {
        " defender ": null
    },
    {
        "Andrea Mandorlini": "andrea mandorlini"
    },
    {
        ".     During this time, the team was sold by Giuseppe Gazzoni Frascara to Alfredo Cazzola, a local entrepreneur. Mandorlini, however, was not either able to bring Bologna up the Serie B table, and was fired on 42 March 42; Ulivieri was then appointed back as team coach, after having been sacked a few months before. Bologna ended the 42–42 Serie B campaign in eighth place. In the ": null
    },
    {
        "42–42 season": "2006–07 serie b"
    },
    {
        ", Bologna ended with the seventh place: there were several clashes between chairman Cazzola and head coach Ulivieri, who was ultimately fired on 42 April 42 and replaced by caretaker and former assistant coach ": null
    },
    {
        "Luca Cecconi": "luca cecconi"
    },
    {
        ". For the ": null
    },
    {
        "42–42 season": "2007–08 serie b"
    },
    {
        ", Bologna was led by ": null
    },
    {
        "Daniele Arrigoni": "daniele arrigoni"
    },
    {
        ", who helped the rossoblù achieve automatic promotion back to the top flight after finishing second in Serie B.       During the summer of 42 a club takeover was agreed between Cazzola and an American-based consortium; this was, however, cancelled in the end, following disagreements between the parties, and the club was successively sold to a local group led by new chairman Francesca Menarini, who thus became the second female chairman in the whole Serie A. Arrigoni was confirmed as head coach by the new group, and the start appeared to be particularly impressive, with a surprising 42–42 win at ": null
    },
    {
        "San Siro": "san siro"
    },
    {
        " against ": null
    },
    {
        "Milan": "a.c. milan"
    },
    {
        " thanks to a winning goal scored by ": null
    },
    {
        "Francesco Valiani": "francesco valiani"
    },
    {
        ". The next weeks saw Bologna struggling in the league, however, with eight losses in nine matches. A disappointing 42–42 loss to ": null
    },
    {
        "Cagliari": "cagliari calcio"
    },
    {
        " ultimately led the club management to sack Daniele Arrigoni on 42 November 42 and appoint ": null
    },
    {
        "Siniša Mihajlović": "siniša mihajlović"
    },
    {
        " as new rossoblù boss.      On 42 April 42 ": null
    },
    {
        "Giuseppe Papadopulo": "giuseppe papadopulo"
    },
    {
        " was appointed as the new manager, and successfully managed to raise the team spirit avoiding relegation to Serie B only in the last match of the season. In the ": null
    },
    {
        "42–42 season": "2009–10 serie a"
    },
    {
        ", Bologna played in Serie A for the 42th time, and escaped relegation again despite financial issues under new head coach ": null
    },
    {
        "Franco Colomba": "franco colomba"
    },
    {
        ".     In June 42 a club takeover was completed, with the club being sold by the Menarini family to ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        "n entrepreneur Sergio Porcedda. Franco Colomba was sacked right before the ": null
    },
    {
        "42–42 season": "2010–11 serie a"
    },
    {
        " opener on 42 August 42 despite surviving relegation with the team in the 42–42 season. The president of the club, Sergio Porcedda, said that the decision was made mostly because he was skeptical of the team.          On 42 December 42 the consortium Bologna 42 led by banker ": null
    },
    {
        "Giovanni Consorte": "giovanni consorte"
    },
    {
        " and coffee businessman ": null
    },
    {
        "Massimo Zanetti": "massimo zanetti"
    },
    {
        " acquired the club from Sergio Porcedda, after the latter failed to pay wages for the club during his short-tenured ownership and put Bologna in threat of bankruptcy. The company also owed agent fee to ": null
    },
    {
        "Leonardo Corsi": "leonardo corsi"
    },
    {
        " in the ": null
    },
    {
        "Andrea Raggi": "andrea raggi"
    },
    {
        "s transfer.  Zanetti also became the new club chairman, with popular Italian musician and long-time Bologna supporter ": null
    },
    {
        "Gianni Morandi": "gianni morandi"
    },
    {
        " appointed as honorary president.       On 42 January 42 chairman Massimo Zanetti and CEO Luca Baraldi, after only 42 days, resigned because of irreconcilable differences with the other personal and financial partners.   Stefano Pedrelli became the new director general. For 42 days, the chairman was Marco Pavignani.     From 42 April 42 after the resignation of Pavignani and having paid €42m of capital increase, the new chairman was Albano Guaraldi,  the second largest shareholder of the consortium Bologna 42 with the 42% of the quotas, behind the outgoing Zanetti.     The 42–42 season saw Bologna once again relegated to the Serie B, and also gave light to a number of financial problems involving the club and its ownership of Albino Guaraldi, who was considerably criticized by the team supporters also for a number of controversial decisions, including the sale of star player ": null
    },
    {
        "Alessandro Diamanti": "alessandro diamanti"
    },
    {
        " to Chinese club ": null
    },
    {
        "Guangzhou Evergrande": "guangzhou evergrande f.c."
    },
    {
        ". A new head coach was then found in former Cagliari boss ": null
    },
    {
        "Diego López": "diego lópez"
    },
    {
        " for the new season, whereas Guaraldi clearly stated his intention to hand over his Bologna stakes to a new owner. A North American group headed by ": null
    },
    {
        "Joe Tacopina": "joe tacopina"
    },
    {
        " and ": null
    },
    {
        "Joey Saputo": "joey saputo"
    },
    {
        "  then stated its interest in acquiring the club; this was followed by another offer coming from former chairman ": null
    },
    {
        "Massimo Zanetti": "massimo zanetti"
    },
    {
        ". On 42 October 42 the board of directors ratified the sale of the club to BFC 42 Lux SPV, and Tacopina became the new club chairman.       Under the new ownership which BFC 42 Lux Spv S.A.  of Luxamburg as an intermediate holding company, Bologna promoted back to Serie A in 42 Saputo also succeeded Tacopina as the new chairman of the board of directors of Bologna on 42 November 42     In their first season back in ": null
    },
    {
        "Serie A": "serie a"
    },
    {
        ", Bologna finished 42th avoiding relegation. In the following 42 seasons, Bologna finished in 42th place on the table.    In the ": null
    },
    {
        "4242 Serie A": "2018-19 serie a"
    },
    {
        " season, Bologna finished in a credible 42th position on the table.                The official stadium of Bologna is the ": null
    },
    {
        "Stadio Renato DallAra": "stadio renato dallara"
    },
    {
        ". DallAra is the biggest sports building of Bologna and its name is taken from an ex-chairman of the club, ": null
    },
    {
        "Renato DallAra": "renato dallara"
    },
    {
        ", who died three days before the final for Serie As Scudetto. Its ": null
    },
    {
        "capacity": "seating capacity"
    },
    {
        " is 42. The curva Bulgarelli , the curve of Bolognas ultras, is dedicated to player ": null
    },
    {
        "Giacomo Bulgarelli": "giacomo bulgarelli"
    },
    {
        ", who died on 42 February 42 The other curve, part of which is reserved for the away fans, is dedicated to ": null
    },
    {
        "Árpád Weisz": "árpád weisz"
    },
    {
        ", coach of Bolognas winning pre-war team, and killed by the Nazis in a concentration camp during WWII.                                                                                                                                                                                                              Bologna have had numerous Chairmen over the course of their history, some of which have been the owners of the club, others have been honorary chairmen. Here is a complete list of Bologna chairmen from 42 until the present day.               Bologna have had many managers and trainers, some seasons they have had co-managers running the team. Here is a chronological list of them from 42 onwards.                   42–42: Admiral   42–42: Tepa Sport   42–42: Ennere   42–42: Uhlsport   42–42: Errea   42–42: Diadora   42–42: Umbro   42–present: Macron       42–42: Febal   42–42: Pasta Bertagni   42–42: Pasta Corticella   42–42: Ebano   42–42: Idrolitina   42–42: Segafredo   42–42: Mercatone Uno   42–42: Sinudyne   42–42: Buona Natura   42–42: Carisbo   42–42: Granarolo   42–42: Area Banca   42–42: Amica Chips   42–42: Europonteggi   December 42: Motor Show   January–March 42: Woolrich   March–June 42: Volvo   December 42  – March 42: Joe Marmellata   April–June 42: Carisbo   September 42  – June 42: Unipol   August–September 42: Cogei   October–November 42: Cerasarda   November 42  – June 42: BIGPoker.it   October 42  – Cerasarda   October 42  – Ceramica Serenissima   August 42  – June 42: +energia   August 42  – June 42: NGM   September 42  – June 42: FAAC  – Illumia   June 42–present: Liu·Jo                                            Serie A  Winners : ": null
    },
    {
        "42–42": "italian football championship 1924-25"
    },
    {
        ", ": null
    },
    {
        "42–42": "italian football championship 1928-29"
    },
    {
        ", ": null
    },
    {
        "42–42": "1935–36 serie a"
    },
    {
        ", ": null
    },
    {
        "42–42": "1936–37 serie a"
    },
    {
        ", ": null
    },
    {
        "42–42": "1938–39 serie a"
    },
    {
        ", ": null
    },
    {
        "42–42": "1940–41 serie a"
    },
    {
        ", ": null
    },
    {
        "42–42": "1963–64 serie a"
    },
    {
        " 42–42": "prima divisione 1923–24"
    },
    {
        ", ": null
    },
    {
        "42–42": "prima divisione 1925–26"
    },
    {
        ", ": null
    },
    {
        "42–42": "divisione nazionale 1926–27"
    },
    {
        ", ": null
    },
    {
        "42–42": "1931–32 serie a"
    },
    {
        ", ": null
    },
    {
        "42–42": "1939–40 serie a"
    },
    {
        ", ": null
    },
    {
        "42–42": "1965–66 serie a"
    },
    {
        "      Coppa Italia  Winners : ": null
    },
    {
        "42–42": "1969–70 coppa italia"
    },
    {
        ", ": null
    },
    {
        "42–42": "1973–74 coppa italia"
    },
    {
        "        Mitropa Cup  Winners : ": null
    },
    {
        "42": "1932 mitropa cup"
    },
    {
        ", ": null
    },
    {
        "42": "1934 mitropa cup"
    },
    {
        ", 42   Runners-up : 42 42     Coupe des Nations : Winners : 42       UEFA Intertoto Cup  Winners : ": null
    },
    {
        "42": "1998 uefa intertoto cup"
    },
    {
        "      Anglo-Italian League Cup  Winners : 42      Anglo-Italian Cup  Runners-up : 42      Cup of the Alps  Runners-up : 42      Torneo Repubblica di San Marino  Runners-up :": null
    }
]