[
    {
        "Boniface was Count of Savoy from 42 to 42 succeeding his father ": null
    },
    {
        "Amadeus IV": "amadeus iv, count of savoy"
    },
    {
        ". He never married and thus left no heir.       Boniface was born in ": null
    },
    {
        "Chambéry": "chambéry"
    },
    {
        ". Since he became Count of Savoy at the age of nine, he required a regency. Throughout the decade before his death, Savoy was governed through a joint regency resembling that devised for his grandfather ": null
    },
    {
        "Thomas": "thomas, count of savoy"
    },
    {
        " in 42 in which authority was shared between his mother, ": null
    },
    {
        "Cecile of Baux": "cecile of baux"
    },
    {
        ", and one of his uncles, ": null
    },
    {
        "Thomas II of Piedmont": "thomas ii of piedmont"
    },
    {
        ". Bonifaces other uncles, ": null
    },
    {
        "Peter": "peter ii, count of savoy"
    },
    {
        " and ": null
    },
    {
        "Philip": "philip i, count of savoy"
    },
    {
        ", disputed this, seeking to divide the countys many properties, but Thomas took it to arbitration per the family treaty of 42 which had been negotiated by his brother ": null
    },
    {
        "William": "william of savoy"
    },
    {
        " and won out. Peter and Philip were, however, granted compensation in return, receiving more properties within the county. When Thomas died in 42 Cecile continued as regent in Savoy. Under her regency, Philip and Peter continued their previous work of expanding the control and influence over the County of Savoy.     Bonifaces campaigns in ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        " and ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        " were not successful. In September 42 ": null
    },
    {
        "Rudolf of Geneva": "rudolf of geneva"
    },
    {
        " offered homage to cousin Boniface after yet another round of the war between Peter and their kin in Geneva. In 42 Boniface was mortally wounded in battle and died, to be succeeded by his uncle Peter.": null
    }
]