[
    {
        "      The Bonnot Gang  was a French criminal ": null
    },
    {
        "anarchist": "anarchism"
    },
    {
        " group that operated in France and ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " during the  Belle Époque , from 42 to 42 Composed of individuals who identified with the emerging ": null
    },
    {
        "illegalist": "illegalism"
    },
    {
        " milieu, the gang used cutting-edge technology  not yet available to the French police.     Originally referred to by the press as simply The Auto Bandits , the gang was dubbed The Bonnot Gang after ": null
    },
    {
        "Jules Bonnot": "jules bonnot"
    },
    {
        " gave an interview at the office of  Le Petit Parisien , a popular daily paper. Bonnots perceived prominence within the group was later reinforced by his high-profile death during a ": null
    },
    {
        "shootout": "shootout"
    },
    {
        " with French police in ": null
    },
    {
        "Choisy-le-Roi": "choisy-le-roi"
    },
    {
        ".       The Bonnot Gang originally consisted of a group of French anarchists centered around the ": null
    },
    {
        "individualist anarchist": "individualist anarchism"
    },
    {
        " magazine  lAnarchie . The group was founded by ": null
    },
    {
        "Octave Garnier": "octave garnier"
    },
    {
        ", Raymond Callemin, and ": null
    },
    {
        "René Valet": "rené valet"
    },
    {
        " Jules Bonnot": "jules bonnot"
    },
    {
        " Octave Garnier": "octave garnier"
    },
    {
        " Raymond Callemin": "raymond callemin"
    },
    {
        " Étienne Monier": "étienne monier"
    },
    {
        " André Soudy": "andré soudy"
    },
    {
        ", executed       Principal gang members included:   ": null
    },
    {
        "Jules Bonnot": "jules bonnot"
    },
    {
        " Octave Garnier": "octave garnier"
    },
    {
        " Raymond Callemin": "raymond callemin"
    },
    {
        " Anna Dondon": "anna dondon"
    },
    {
        " Marie Vuillemin": "marie vuillemin"
    },
    {
        " André Soudy": "andré soudy"
    },
    {
        " Édouard Carouy": "édouard carouy"
    },
    {
        " Jeanne Belardi": "jeanne belardi"
    },
    {
        " Jean De Boe": "jean de boe"
    },
    {
        " Étienne Monier": "étienne monier"
    },
    {
        " Eugène Dieudonné": "eugène dieudonné"
    },
    {
        "     Minor players included ": null
    },
    {
        "David Belonie": "david belonie"
    },
    {
        ", ": null
    },
    {
        "Marius Medge": "marius medge"
    },
    {
        ", ": null
    },
    {
        "Antoine Gauzy": "antoine gauzy"
    },
    {
        ", ": null
    },
    {
        "Pierre Jourdan ": "pierre jourdan"
    },
    {
        ", ": null
    },
    {
        "Charles Reinart": "charles reinart"
    },
    {
        ", ": null
    },
    {
        "Victor Serge": "victor serge"
    },
    {
        ", ": null
    },
    {
        "Godorowski": "godorowski"
    },
    {
        ", ": null
    },
    {
        "Henriette Maîtrejean": "henriette maîtrejean"
    },
    {
        ", and ": null
    },
    {
        "Berbe Leclech": "berbe leclech"
    },
    {
        ".     The gangs political and social perspective was heavily influenced by ": null
    },
    {
        "Mikhail Bakunin": "mikhail bakunin"
    },
    {
        " and ": null
    },
    {
        "Pierre-Joseph Proudhon": "pierre-joseph proudhon"
    },
    {
        " as well as ": null
    },
    {
        "Max Stirner": "max stirner"
    },
    {
        ", ": null
    },
    {
        "Ludwig Büchner": "ludwig büchner"
    },
    {
        ", and ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        ". Bonnots ideas were more part with late anarchist ": null
    },
    {
        "Ravachol": "ravachol"
    },
    {
        ".            The first robbery by Bonnots Gang was on December 42 42 at the AB Branch of ": null
    },
    {
        "Société Générale": "société générale"
    },
    {
        " Bank, located at 42 rue Ordener in the 42th Arrondissement of Paris. They shot a collection clerk in the neck and lung , snatched his cash bags,  then escaped in an automobile  they had stolen a week before. RobbersBonnot, Octave Garnier, Eugène Dieudonné and Raymond Callemingot earnings equal to 42 francs, but the rest of it was composed of securities.     On December 42 42 the gang broke into a gun shop in the Paris center. A few days later, on the night of January 42 42 they entered the home of the wealthy M. Moreau and murdered both him and his maid. The take was equal to 42 francs.     The ": null
    },
    {
        "National Police": "national police"
    },
    {
        " did its best to catch the gang. They were able to arrest one man based on their registry of anarchist organisations. The Gang fled temporarily to Belgium, where they sold the stolen automobile and tried to carjack another. In the process they shot a Belgian policeman.     The gang continued their automobile thefts and robberies, shooting two more policemen in the process. Automobiles were not yet common so the gang usually stole still expensive cars from garages, not from the street.     By March 42 police had arrested many of the gangs supporters and knew many of the members faces and names. In March 42 gang member and would-be leader Octave Garnier sent a mocking letter to the Sûretéwith his fingerprints. In those days, the French police still did not yet use fingerprinting.     On March 42 42 the gang stole a ": null
    },
    {
        "de Dion-Bouton": "de dion-bouton"
    },
    {
        " automobile in ": null
    },
    {
        "the Forest of Sénart": "the forest of sénart"
    },
    {
        " south of Paris by shooting the driver through the heart. Richard Parry: The Bonnot gang. Rebel Press, 42 , p. 42 They drove into ": null
    },
    {
        "Chantilly": "chantilly, oise"
    },
    {
        " north of Paris where they robbed the local branch of Société Générale Bank fatally shooting two bank cashiers and severely wounding a bookkeeper. They escaped in their stolen automobile as two policemen tried to catch them, one on horseback and the other on a bicycle.     Sûreté Chief ": null
    },
    {
        "Xavier Guichard": "xavier guichard"
    },
    {
        " took the matter personally. Even politicians became concerned, increasing police funding by 42 francs. Banks began to prepare for forthcoming robberies and many cashiers armed themselves. The Société Générale promised a reward of 42 francs for information that would lead to arrests.       On March 42 police arrested André Soudy at the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " coast, where he announced that he did not care whether he died of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " or by ": null
    },
    {
        "guillotine": "guillotine"
    },
    {
        ". Édouard Carouy was arrested April 42 Raymond Callemin was arrested April 42 and police had to prevent an angry mob from ": null
    },
    {
        "lynching": "lynching"
    },
    {
        " him on the spot. Étienne Monnier was arrested in Paris on April 42 By the end of that month, police had arrested 42 gang members and supporters. Still, Bonnot, Octave Garnier and René Valet remained at large.     On April 42 three police officers surprised Bonnot in the apartment of a suspected ": null
    },
    {
        "fence": "fence"
    },
    {
        ". He shot at the officers, killing one and wounding another, and then fled over the rooftops. Part of the 42 francs reward was later given to the widow of the police officer killed .     On April 42 police had tracked Bonnot to a converted garage in the Paris suburb of ": null
    },
    {
        "Choisy-le-Roi": "choisy-le-roi"
    },
    {
        ". The building had only one entrance so it was easy for Bonnot to keep the police at bay. They besieged the place with 42 armed police officers, soldiers , firefighters, military engineers and private gun-owners. By noon, after a sporadic firing from both sides, Paris Police Chief ": null
    },
    {
        "Louis Lépine": "louis lépine"
    },
    {
        " sent three police officers to put a dynamite charge under the house. The explosion demolished the front of the building. Bonnot was hiding in the middle of a rolled mattress and tried to shoot back until Lépine shot him non-fatally in the head. Afterwards police again had to prevent the spectators from lynching Bonnot. They simply told the crowd that Bonnot was already dead and had been buried in a secret grave. In fact, he was fatally injured but was taken to the ": null
    },
    {
        "Hôtel-Dieu hospital": "hôtel-dieu de paris"
    },
    {
        " and survived for around another hour.     On the evening of 42 May, Octave Garnier and Rene Valet were besieged in the Paris suburb of ": null
    },
    {
        "Nogent-sur-Marne": "nogent-sur-marne"
    },
    {
        " by a large force including 42 police officers and ": null
    },
    {
        "gendarme": "gendarmerie"
    },
    {
        "s and 42 soldiers. Sûreté Chief Xavier Guichard himself led the siege. The firing from both sides was intense, and at 42  am, Guichard decided to blow the place up. Garnier died in the explosion, but Valet tried to keep firing despite his wounds.       The trial of the gangs survivors began on February 42 42 ": null
    },
    {
        "Victor Serge": "victor serge"
    },
    {
        " was sentenced to five years for robbery. All the others were initially sentenced to death. The sentence of Eugène Dieudonné was commuted to life imprisonment. Sentences of Édouard Carouy and Marius Metge were commuted to life imprisonment at hard labor. Carouy later committed suicide. Metge was sent to a penal colony. Raymond Caillemin, Étienne Monier and André Soudy refused to plead for clemency and they were executed by ": null
    },
    {
        "guillotine": "guillotine"
    },
    {
        ".          In the aftermath of the collapse of the Bonnot Gang, French authorities used the threat of anarchist violence as the pretext for a substantial expansion in law enforcement power. Hundreds of raids were carried out against known anarchists and sympathizers . Although the actions of the gang were not widely supported, even within the anarchist milieu, the mainstream press called for a general crackdown on left-wing revolutionary activity.     French ": null
    },
    {
        "anarchist communists": "anarchist communism"
    },
    {
        " attempted to distance themselves from ": null
    },
    {
        "illegalism": "illegalism"
    },
    {
        " and individualist anarchism as a whole. In August 42 the ": null
    },
    {
        "Fédération Communiste-Anarchistes": "fédération communiste-anarchistes"
    },
    {
        " condemned ": null
    },
    {
        "individualism": "individualism"
    },
    {
        " as  bourgeois  and more in keeping with capitalism than communism.     Nevertheless, the Bonnot Gang found some sympathy from the French working-class. As many as one hundred thousand people visited ": null
    },
    {
        "Nogent-sur-Marne": "nogent-sur-marne"
    },
    {
        " and merchants in Paris sold souvenirs depicting the bandits.     The Bonnot Gang remains one of Frances best known anarchist groups.          La Bande à Bonnot , 42 film    Les Brigades du Tigre ": null
    }
]