[
    {
        "                    The Book of Revelation, often called the Book of Revelations, Revelation to John, the Apocalypse of John, The Revelation, or simply Revelation, the Revelation of Jesus Christ or the  Apocalypse , is the final book of the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        ", and therefore also the final book of the ": null
    },
    {
        "Christian Bible": "christian bible"
    },
    {
        ". It occupies a central place in ": null
    },
    {
        "Christian eschatology": "christian eschatology"
    },
    {
        ". Its title is derived from the ": null
    },
    {
        "first word": "incipit"
    },
    {
        " of the text, written in ": null
    },
    {
        "Koine Greek": "koine greek"
    },
    {
        ": apokalypsis, meaning unveiling or revelation . The Book of Revelation is the only ": null
    },
    {
        "apocalyptic document": "apocalyptic literature"
    },
    {
        " in the New Testament ": null
    },
    {
        "canon": "biblical canon"
    },
    {
        " . The only extended apocalyptic passage in the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " is in the ": null
    },
    {
        "Book of Daniel": "book of daniel"
    },
    {
        ".     The author names himself in the text as John , but his precise identity remains a point of academic debate. Second-century Christian writers such as ": null
    },
    {
        "Justin Martyr": "justin martyr"
    },
    {
        ", ": null
    },
    {
        "Irenaeus": "irenaeus"
    },
    {
        ", ": null
    },
    {
        "Melito": "melito"
    },
    {
        " the bishop of Sardis, and ": null
    },
    {
        "Clement of Alexandria": "clement of alexandria"
    },
    {
        " and the author of the ": null
    },
    {
        "Muratorian fragment": "muratorian fragment"
    },
    {
        " identify ": null
    },
    {
        "John the Apostle": "john the apostle"
    },
    {
        " as the John of Revelation.  Modern scholarship generally takes a different view, and many consider that nothing can be known about the author except that he was a Christian prophet. Some modern scholars characterise Revelations author as a putative figure whom they call ": null
    },
    {
        "John of Patmos": "john of patmos"
    },
    {
        " . The bulk of traditional sources date the book to the reign of the Roman emperor ": null
    },
    {
        "Domitian": "domitian"
    },
    {
        " , and the evidence tends to confirm this.     The book spans three literary genres: the ": null
    },
    {
        "epistolary": "letter"
    },
    {
        ", the ": null
    },
    {
        "apocalyptic": "apocalyptic literature"
    },
    {
        ", and the ": null
    },
    {
        "prophetic": "prophetic"
    },
    {
        ". It begins with John, on the island of ": null
    },
    {
        "Patmos": "patmos"
    },
    {
        " in the ": null
    },
    {
        "Aegean Sea": "aegean sea"
    },
    {
        ", addressing a letter to the ": null
    },
    {
        "Seven Churches of Asia": "seven churches of asia"
    },
    {
        " . He then describes a series of prophetic ": null
    },
    {
        "visions": "vision"
    },
    {
        ", including figures such as the Seven Headed Dragon, ": null
    },
    {
        "The Serpent": "serpents in the bibleancient serpent"
    },
    {
        " and ": null
    },
    {
        "the Beast": "the beast"
    },
    {
        ", culminating in the ": null
    },
    {
        "Second Coming": "second coming"
    },
    {
        " of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        ".     The obscure and extravagant imagery has led to a wide variety of Christian interpretations: ": null
    },
    {
        "historicist": "historicism"
    },
    {
        " interpretations see in Revelation a broad view of history; ": null
    },
    {
        "preterist": "preterist"
    },
    {
        " interpretations treat Revelation as mostly referring to the events of the ": null
    },
    {
        "apostolic era ": "apostolic age"
    },
    {
        ", or, at the latest, the fall of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        "; ": null
    },
    {
        "futurists": "futurism"
    },
    {
        " believe that Revelation describes future events, the seven churches growing into the body/believers throughout the age, and a reemergence or continuous rule of a Roman/Graeco system with modern capabilities described by John in ways familiar to him; and ": null
    },
    {
        "idealist or symbolic": "idealism"
    },
    {
        " interpretations consider that Revelation does not refer to actual people or events, but is an ": null
    },
    {
        "allegory": "allegory"
    },
    {
        " of the spiritual path and the ongoing struggle between good and evil.                    The name Revelation comes from the ": null
    },
    {
        "first word": "incipit"
    },
    {
        " of the book in ": null
    },
    {
        "Koine Greek": "koine greek"
    },
    {
        ": ἀποκάλυψις , which means unveiling or revelation . The author names himself as John , but modern scholars consider it unlikely that the author of Revelation also wrote the ": null
    },
    {
        "Gospel of John": "gospel of john"
    },
    {
        ". ": null
    },
    {
        "Pope Dionysius of Alexandria": "pope dionysius of alexandria"
    },
    {
        " set out some of the evidence for this view as early as the second half of the third century, noting that the gospel and the epistles attributed to John, unlike Revelation, do not name their author, and that the Greek of the gospel is stylistically correct and elegant while that of Revelation is neither; some later scholars believe that the two books also have radical differences in theological perspective.     Tradition ascribes the authorship to ": null
    },
    {
        "John the Apostle": "john the apostle"
    },
    {
        ", but it seems unlikely that the apostle could have lived into the most likely time for the books composition, the reign of Domitian, and the author never states that he knew Jesus. All that is known is that this John was a ": null
    },
    {
        "Jewish Christian": "jewish christian"
    },
    {
        " prophet, probably belonging to a group of such prophets, and was accepted as such by the congregations to whom he addresses his letter. His precise identity remains unknown, and modern scholarship commonly refers to him as ": null
    },
    {
        "John of Patmos": "john of patmos"
    },
    {
        "  .     The book was written about 95 AD. The date is suggested by clues in the visions pointing to the reign of the emperor ": null
    },
    {
        "Domitian": "domitian"
    },
    {
        ". The beast with seven heads and the number 666 seem to allude directly to the emperor ": null
    },
    {
        "Nero": "nero"
    },
    {
        " , but this does not require that Revelation was written in the 60s, as there was a widespread belief in later decades that ": null
    },
    {
        "Nero would return": "nero redivivus"
    },
    {
        ". No original manuscript exists, and some  believe it was originally written on the walls of a cave on Patmos, now a UNESCO World Heritage site called the ": null
    },
    {
        "Cave of the Apocalypse": "cave of the apocalypse"
    },
    {
        ".       Revelation is an ": null
    },
    {
        "apocalyptic": "apocalypse"
    },
    {
        " prophecy with an epistolary introduction addressed to seven churches in the Roman province of Asia. Apocalypse means the revealing of divine mysteries; John is to write down what is revealed and send it to the seven churches. The entire book constitutes the letter—the letters to the seven individual churches are introductions to the rest of the book, which is addressed to all seven. While the dominant genre is apocalyptic, the author sees himself as a Christian prophet: Revelation uses the word in various forms twenty-one times, more than any other ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " book.       The predominant view is that Revelation alludes to the Old Testament although it is difficult among scholars to agree on the exact number of allusions or the allusions themselves.  Revelation rarely quotes directly from the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ", yet almost every verse alludes to or echoes older scriptures. Over half of the references stem from ": null
    },
    {
        "Daniel": "book of daniel"
    },
    {
        ", ": null
    },
    {
        "Ezekiel": "book of ezekiel"
    },
    {
        ", ": null
    },
    {
        "Psalms": "book of psalms"
    },
    {
        ", and ": null
    },
    {
        "Isaiah": "book of isaiah"
    },
    {
        ", with Daniel providing the largest number in proportion to length and Ezekiel standing out as the most influential. Because these references appear as allusions rather than as quotes, it is difficult to know whether the author used the Hebrew or the Greek version of the Hebrew scriptures, but he was clearly often influenced by the Greek. He very frequently combines multiple references, and again the allusional style makes it impossible to be certain to what extent he did so consciously.       Conventional understanding until recent times was that the Book of Revelation was written to comfort beleaguered Christians as they underwent persecution at the hands of a ": null
    },
    {
        "megalomania": "megalomania"
    },
    {
        "cal Roman emperor, but much of this has now been jettisoned: ": null
    },
    {
        "Domitian": "emperor domitian"
    },
    {
        " is no longer viewed as a despot imposing an imperial cult, and it is no longer believed that there was any systematic empire-wide persecution of Christians in his time. The current view is that Revelation was composed in the context of a conflict within the Christian community of Asia Minor over whether to engage with, or withdraw from, the far larger non-Christian community: Revelation chastises those Christians who wanted to reach an accommodation with the Roman cult of empire. This is not to say that Christians in Roman Asia were not suffering, for withdrawal from, and defiance against, the wider Roman society, which imposed very real penalties; Revelation offered a victory over this reality by offering an apocalyptic hope: in the words of professor ": null
    },
    {
        "Adela Yarbro Collins": "adela yarbro collins"
    },
    {
        ", What ought to be was experienced as a present reality.           Revelation was the last book accepted into the ": null
    },
    {
        "Christian biblical canon": "christian biblical canons"
    },
    {
        ", and to the present day some churches that derive from the ": null
    },
    {
        "Church of the East": "church of the east"
    },
    {
        " reject it.        Eastern Christians became skeptical of the book as doubts concerning its authorship and unusual style were reinforced by aversion to its acceptance by ": null
    },
    {
        "Montanists": "montanism"
    },
    {
        " and other groups considered to be heretical. This distrust of the Book of Revelation persisted in the East through the ": null
    },
    {
        "15th century": "15th century"
    },
    {
        ".  by Andrew of Caesarea , pp. 3–6     ": null
    },
    {
        "Dionysius": "pope dionysius of alexandria"
    },
    {
        " , bishop of Alexandria, disciple of ": null
    },
    {
        "Origen": "origen"
    },
    {
        " wrote that the Book of Revelation could have been written by ": null
    },
    {
        "Cerinthus": "cerinthus"
    },
    {
        " although he himself did not adopt the view that Cerinthus was the writer. He regarded the Apocalypse as the work of an inspired man but not of an Apostle .      ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        ", in his ": null
    },
    {
        "Church History": "church history"
    },
    {
        " mentioned that the Apocalypse of John was accepted as a Canonical book and rejected at the same time:          The Apocalypse of John, also called Revelation, is counted as both accepted and disputed, which has caused some confusion over what exactly Eusebius meant by doing so. The disputation can perhaps be attributed to Origen.  Origen seems to have accepted it in his writings.      ": null
    },
    {
        "Cyril of Jerusalem": "cyril of jerusalem"
    },
    {
        " does not name it among the canonical books .      ": null
    },
    {
        "Athanasius": "athanasius of alexandria"
    },
    {
        " in his Letter 39,    ": null
    },
    {
        "Augustine of Hippo": "augustine of hippo"
    },
    {
        " in his book  On Christian Doctrine  ,  ": null
    },
    {
        "Tyrannius Rufinus": "tyrannius rufinus"
    },
    {
        " in his Commentary on the Apostles Creed,  ": null
    },
    {
        "Pope Innocent I": "pope innocent i"
    },
    {
        " in a letter to the bishop of Toulouse  and ": null
    },
    {
        "John of Damascus": "john of damascus"
    },
    {
        " in his work An Exposition of the Orthodox Faith   listed the Revelation of ": null
    },
    {
        "John the Evangelist": "john the evangelist"
    },
    {
        " as a canonical book.       The ": null
    },
    {
        "Council of Laodicea": "council of laodicea"
    },
    {
        " omits it as a canonical book.      The  Decretum Gelasianum , which is a work written by an anonymous scholar between 519 and 553, contains a list of books of scripture presented as having been reckoned as canonical by the ": null
    },
    {
        "Council of Rome": "council of rome"
    },
    {
        " . This list mentions it as a part of the New Testament canon.      The ": null
    },
    {
        "Synod of Hippo": "synod of hippo"
    },
    {
        " ,  followed by the ": null
    },
    {
        "Council of Carthage ": "council of carthage"
    },
    {
        ", the ": null
    },
    {
        "Council of Carthage ": "council of carthage"
    },
    {
        ", ": null
    },
    {
        "the Council of Florence": "the council of florence"
    },
    {
        "  and the ": null
    },
    {
        "Council of Trent": "council of trent"
    },
    {
        "  classified it as a canonical book.      The ": null
    },
    {
        "Apostolic Canons": "canons of the apostles"
    },
    {
        ", approved by the ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox church"
    },
    {
        " Council in Trullo": "quinisext council"
    },
    {
        " in 692, but rejected by ": null
    },
    {
        "Pope Sergius I": "pope sergius i"
    },
    {
        ", omit it.        Doubts resurfaced during the 16th-century ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " Reformation": "reformation"
    },
    {
        ". ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        " called Revelation neither apostolic nor prophetic in the 1522 preface to his translation of the New Testament , ": null
    },
    {
        "Huldrych Zwingli": "huldrych zwingli"
    },
    {
        " labelled it not a book of the Bible ,          and it was the only New Testament book on which ": null
    },
    {
        "John Calvin": "john calvin"
    },
    {
        " did not write a commentary.  Revelation remains the only New Testament book not read in the ": null
    },
    {
        "Divine Liturgy": "divine liturgy"
    },
    {
        " of the ": null
    },
    {
        "Eastern Orthodox Church": "eastern orthodox church"
    },
    {
        ",        though Catholic and Protestant liturgies include it.       There are approximately 300 Greek manuscripts of Revelation.  While it is not extant in ": null
    },
    {
        "Codex Vaticanus": "codex vaticanus"
    },
    {
        " , it is extant in the other great ": null
    },
    {
        "uncial": "list of new testament uncials"
    },
    {
        " codices: ": null
    },
    {
        "Sinaiticus": "codex sinaiticus"
    },
    {
        " , ": null
    },
    {
        "Alexandrinus": "codex alexandrinus"
    },
    {
        " , and ": null
    },
    {
        "Ephraemi Rescriptus": "codex ephraemi rescriptus"
    },
    {
        " . In addition, there are numerous ": null
    },
    {
        "papyri": "list of new testament papyri"
    },
    {
        ", especially  and  ; ": null
    },
    {
        "minuscules": "lists of new testament minuscules"
    },
    {
        " ; and fragmentary quotations in the Church fathers of the 2nd to 5th centuries and the 6th-century Greek commentary on Revelation by Andreas.                    Divisions in the book seem to be marked by the repetition of key phrases, by the arrangement of subject matter into blocks, and associated with its Christological passages, and much use is made of significant numbers, especially the number seven, which represented perfection according to ancient numerology. Nevertheless, there is a complete lack of consensus among scholars about the structure of Revelation. The following is therefore an outline of the books contents rather than of its structure.                                  The Revelation of Jesus Christ   The Revelation of Jesus Christ is communicated to ": null
    },
    {
        "John of Patmos": "john of patmos"
    },
    {
        " through prophetic visions.   John is instructed by the one like a son of man to write all that he hears and sees, from the prophetic visions, to ": null
    },
    {
        "Seven churches of Asia": "seven churches of asia"
    },
    {
        ".   The appearance of the one like a son of man is given, and he reveals what the seven stars and seven lampstands represent.   Messages for seven churches of Asia   ": null
    },
    {
        "Ephesus": "ephesus"
    },
    {
        ": From this church, those who overcome are granted to eat from the tree of life, which is in the midst of the Paradise of God.   Praised for not bearing those who are evil, testing those who say they are apostles and are not, and finding them to be liars; hating the deeds of the ": null
    },
    {
        "Nicolaitan": "nicolaitan"
    },
    {
        "s; having persevered and possessing patience.   Admonished to do the first works and to repent for having left their first love.   ": null
    },
    {
        "Smyrna": "smyrna"
    },
    {
        ": From this church, those who are faithful until death, will be given the crown of life. Those who overcome shall not be hurt by the ": null
    },
    {
        "second death": "second death"
    },
    {
        ".   Praised for being rich while impoverished and in tribulation.   Admonished not to fear the synagogue of ": null
    },
    {
        "Satan": "satan"
    },
    {
        " , nor fear a ten-day tribulation of being thrown into prison.   ": null
    },
    {
        "Pergamum": "pergamum"
    },
    {
        ": From this church, those who overcome will be given the hidden ": null
    },
    {
        "manna": "manna"
    },
    {
        " to eat and a white stone with a secret name on it.   Praised for holding fast to My name , not denying My faith even in the days of ": null
    },
    {
        "Antipas": "herod antipas"
    },
    {
        ", My faithful martyr.   Admonished to repent for having held the doctrine of ": null
    },
    {
        "Balaam": "balaam"
    },
    {
        ", who taught ": null
    },
    {
        "Balak": "balak"
    },
    {
        " to put a stumbling block before the ": null
    },
    {
        "children of Israel": "children of israel"
    },
    {
        "; eating things sacrificed to idols, committing sexual immorality, and holding the doctrine of the Nicolaitans.   ": null
    },
    {
        "Thyatira": "thyatira"
    },
    {
        ": From this church, those who overcome until the end, will be given power over the nations in order to dash them to pieces with the rule of a rod of iron; they will also be given the morning star.   Praised for their works, love, service, faith, and patience.   Admonished to repent for allowing a prophetess to promote sexual immorality and to eat things sacrificed to idols.   ": null
    },
    {
        "Sardis": "sardis"
    },
    {
        ": From this church, those who overcome will be clothed in white garments, and their names will not be blotted out from the ": null
    },
    {
        "Book of Life": "book of life"
    },
    {
        "; their names will also be confessed before the Father and His angels.   Admonished to be watchful and to strengthen since their works have not been perfect before God.   ": null
    },
    {
        "Philadelphia": "alaşehir"
    },
    {
        ": From this church, those who overcome will be made a pillar in the temple of God having the name of God, the name of the city of God, ": null
    },
    {
        "New Jerusalem": "new jerusalem"
    },
    {
        " , and the ": null
    },
    {
        "Son of Gods": "son of god"
    },
    {
        "new name.   Praised for having some strength, keeping My word , and having not denied My name.   Reminded to hold fast what they have, that no one may take their crown.   ": null
    },
    {
        "Laodicea": "laodicean church"
    },
    {
        ": From this church, those who overcome will be granted the opportunity to sit with the Son of God on His throne.   Admonished to be zealous and repent from being lukewarm ; they are instructed to buy the gold refined in the fire , that they may be rich; to buy white garments , that they may be clothed, so that the shame of their nakedness would not be revealed; to anoint their eyes with eye salve, that they may see.   Before the Throne of God   The ": null
    },
    {
        "Throne of God": "throne of god"
    },
    {
        " appears, surrounded by twenty four thrones with Twenty-four elders seated in them.   The four ": null
    },
    {
        "living creatures": "living creatures"
    },
    {
        " are introduced.   A scroll, with seven seals, is presented and it is declared that the ": null
    },
    {
        "Lion of the tribe of Judah": "lion of judah"
    },
    {
        ", from the Root of ": null
    },
    {
        "David": "king david"
    },
    {
        " , is the only one that will be worthy to open this scroll in the future    When the Lamb having seven horns and seven eyes took the scroll, the creatures of heaven fell down before the Lamb to give him praise, joined by myriads of angels and the creatures of the earth.   ": null
    },
    {
        "Seven Seals": "seven seals"
    },
    {
        " are opened   First Seal: A white horse appears, whose crowned rider has a bow with which to conquer.   Second Seal: A red horse appears, whose rider is granted a great sword to take peace from the earth.   Third Seal: A black horse appears, whose rider has a pair of balances in his hand , where a voice then says, A measure of wheat for a penny, and three measures of barley for a penny; and thou hurt not the oil and the wine.   Fourth Seal: A pale horse appears, whose rider is ": null
    },
    {
        "Death": "death in christianity"
    },
    {
        ", and ": null
    },
    {
        "Hades": "hades in christianity"
    },
    {
        " follows him. Death is granted a fourth part of the earth, to kill with sword, with hunger, with death, and with the beasts of the earth.   Fifth Seal: Under the altar , appeared the souls of martyrs for the word of God , who cry out for vengeance. They are given white robes and told to rest until the martyrdom of their brothers is completed.   Sixth Seal:   There occurs a great earthquake where the sun becomes black as sackcloth of hair, and the moon like blood .   The stars of heaven fall to the earth and the sky recedes like a scroll being rolled up .   Every mountain and island is moved out of place .   The people of earth retreat to caves in the mountains .   The survivors call upon the mountains and the rocks to fall on them, so as to hide them from the wrath of the Lamb .   Interlude: The 144,000 Hebrews are sealed.   ": null
    },
    {
        "144,000": "the 144,000 of the book of revelation"
    },
    {
        " from the ": null
    },
    {
        "Twelve Tribes of Israel": "twelve tribes of israel"
    },
    {
        " are sealed as servants of God on their foreheads   A great multitude stand before the Throne of God, who come out of the ": null
    },
    {
        "Great Tribulation": "great tribulation"
    },
    {
        ", clothed with robes made white in the blood of the Lamb and having ": null
    },
    {
        "palm branches": "martyrs palm"
    },
    {
        " in their hands.   Seventh Seal: Introduces the seven trumpets   Silence in heaven for about half an hour .   Seven angels are each given trumpets .   An eighth angel takes a golden ": null
    },
    {
        "censer": "censer"
    },
    {
        " , filled with fire from the heavenly altar, and throws it to the earth . What follows are peals of thunder, rumblings, flashes of lightning, and an earthquake .   After the eighth angel has devastated the earth, the seven angels introduced in verse 2 prepare to sound their trumpets .   ": null
    },
    {
        "Seven trumpets": "seven trumpets"
    },
    {
        " are sounded .   First Trumpet: Hail and fire, mingled with blood, are thrown to the earth burning up a third of the trees and green grass.   Second Trumpet: Something that resembles a great mountain, burning with fire, falls from the sky and lands in the ocean. It kills a third of the sea creatures and destroys a third of the ships at sea.   Third Trumpet: A great star, named ": null
    },
    {
        "Wormwood": "wormwood"
    },
    {
        ", falls from heaven and poisons a third of the rivers and springs of water.   Fourth Trumpet: A third of the sun, the moon, and the stars are darkened creating complete darkness for a third of the day and the night.   Fifth Trumpet: The First Woe   A star falls from the sky .   This star is given the key to the bottomless pit .   The star then opens the bottomless pit. When this happens, smoke from like smoke from a gigantic furnace. The sun and sky darkened by the smoke from the Abyss .   From out of the smoke, locusts who are given power like that of scorpions of the earth , who are commanded not to harm anyone or anything except for people who were not given the seal of God on their foreheads .   The locusts are described as having a human appearance but with lions teeth, and wearing breastplates of iron ; the sound of their wings resembles the thundering of many horses and chariots rushing into battle .   Sixth Trumpet: The Second Woe   The four angels bound to the great river ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " are released to prepare two hundred million horsemen.   These armies kill a third of mankind by plagues of fire, smoke, and brimstone.   Interlude: The little scroll.   An angel appears, with one foot on the sea and one foot on the land, having an opened little book in his hand.   Upon the cry of the angel, seven thunders utter mysteries and secrets that are not to be written down by John.   John is instructed to eat the little scroll that happens to be sweet in his mouth, but bitter in his stomach, and to prophesy.   John is given a measuring rod to measure the temple of God, the altar, and those who worship there.   Outside the temple, at the court of the holy city, it is trod by the nations for forty-two months .   ": null
    },
    {
        "Two witnesses": "two witnesses"
    },
    {
        " prophesy for 1,260 days, clothed in sackcloth.   Seventh Trumpet: The Third Woe that leads into the ": null
    },
    {
        "seven bowls": "seven bowls"
    },
    {
        "   The temple of God opens in heaven, where the ark of His covenant can be seen. There are lightnings, noises, thunderings, an earthquake, and great hail.   The Seven Spiritual Figures.   A Woman clothed with a white robe, with the sun at her back, with the moon under her feet, and on her head a crown of twelve stars is in pregnancy with a male child.   A great Dragon drags a third of the stars of Heaven with his tail, and throws them to the Earth. . The Dragon waits for the birth of the child so he can devour it. However, sometime after the child is born, he is caught up to Gods throne while the Woman flees into the wilderness into her place prepared of God that they should feed her there for 1,260 days . . War breaks out in heaven between ": null
    },
    {
        "Michael": "michael"
    },
    {
        " and the Dragon, identified as that old Serpent, the Devil, or Satan . After a great fight, the Dragon and his angels are cast out of Heaven for good, followed by praises of victory for Gods kingdom. . The Dragon engages to persecute the Woman, but she is given aid to evade him. Her evasiveness enrages the Dragon, prompting him to wage war against the rest of her offspring, who keep the commandments of God and have the testimony of Jesus Christ.   A Beast emerges from the Sea, having one mortally wounded head that is then healed. The people of the world wonder and follow the Beast. The Dragon grants him power and authority for forty-two months.   The Beast of the Sea blasphemes Gods name , wages war against the Saints, and overcomes them.   Then, a Beast emerges from the Earth having two horns like a lamb, speaking like a dragon. He directs people to make an image of the Beast of the Sea who was wounded yet lives, breathing life into it, and forcing all people to bear ": null
    },
    {
        "the mark of the Beast": "number of the beast"
    },
    {
        " , 666 . Events leading into the Third Woe:   The Lamb stands on ": null
    },
    {
        "Mount Zion": "mount zion"
    },
    {
        " with the 144,000 first fruits who are redeemed from Earth and victorious over the Beast and his mark and image.   The proclamations of three angels.   One like the Son of Man reaps the earth.   A second angel reaps the vine of the Earth and throws it into the great winepress of the wrath of God... and blood came out of the winepress... up to one thousand six hundred ": null
    },
    {
        "stadia": "stadion"
    },
    {
        ".   The temple of the tabernacle, in Heaven, is opened, beginning the Seven Bowls revelation.   Seven angels are given a golden bowl, from the Four Living Creatures, that contains the seven last plagues bearing the wrath of God.   ": null
    },
    {
        "Seven bowls": "seven bowls"
    },
    {
        " are poured onto Earth:   First Bowl: A foul and malignant sore afflicts the followers of the Beast.   Second Bowl: The Sea turns to blood and everything within it dies.   Third Bowl: All fresh water turns to blood.   Fourth Bowl: The Sun scorches the Earth with intense heat and even burns some people with fire.   Fifth Bowl: There is total darkness and great pain in the Beasts kingdom.   Sixth Bowl: The Great River Euphrates is dried up and preparations are made for the kings of the East and the final battle at ": null
    },
    {
        "Armageddon": "armageddon"
    },
    {
        " between the forces of good and evil.   Seventh Bowl: A great earthquake and heavy hailstorm: every island fled away and the mountains were not found.   Aftermath: Vision of John given by an angel who had the seven bowls   The great Harlot who sits on a scarlet Beast and by many waters: Babylon the Great. The angel showing John the vision of the Harlot and the scarlet Beast reveals their identities and fates   New Babylon is destroyed.   The people of the Earth mourn New Babylons destruction.   The permanence of New Babylons destruction.   The Marriage Supper of the Lamb   A great multitude praises God.   The marriage Supper of the Lamb.   The Judgment of the two Beasts, the Dragon, and the Dead   The Beast and the False Prophet are cast into the Lake of Fire.   The Dragon is imprisoned in the Bottomless Pit for a thousand years.   The resurrected martyrs live and reign with Christ for a thousand years.   After the Thousand Years   The Dragon is released and goes out to deceive the nations in the four corners of the Earth—": null
    },
    {
        "Gog and Magog": "gog and magog"
    },
    {
        "—and gathers them for battle at the holy city. The Dragon makes war against the people of God, but is defeated.   The Dragon is cast into the Lake of Fire with the Beast and the False Prophet.   The Last Judgment: the wicked, along with Death and Hades, are cast into the Lake of Fire, which is the second death.   The New Heaven and Earth, and New Jerusalem   A new heaven and new earth replace the old heaven and old earth. There is no more suffering or death.   God comes to dwell with humanity in the New Jerusalem.   Description of the New Jerusalem.   The River of Life and the Tree of Life appear for the healing of the nations and peoples. The curse of sin is ended.   Conclusion   Christs reassurance that his coming is imminent. Final admonitions.          Revelation has a wide variety of interpretations, ranging from the simple historical interpretation, to a prophetic view on what will happen in the future by way of the ": null
    },
    {
        "Will of God": "will of god"
    },
    {
        " and the ": null
    },
    {
        "Womans": "woman of the apocalypse"
    },
    {
        "victory on ": null
    },
    {
        "Satan": "satan"
    },
    {
        " , to different end time scenarios , Robert J. Karris The Collegeville Bible Commentary Liturgical Press, 1992 p. 1296. Ken Bowers, Hiding in plain sight, Cedar Fort, 2000 p. 175. to the views of critics who deny any spiritual value to Revelation at all, ": null
    },
    {
        "Carl Gustav Jung": "carl gustav jung"
    },
    {
        " in his autobiography Memories Dream Reflections said I will not discuss the transparent prophecies of the Book of Revelation because no one believes in them and the whole subject is felt to be an embarrassing one. ascribing it to a human-inherited ": null
    },
    {
        "archetype": "jungian archetypes"
    },
    {
        ".         This interpretation, which has found expression among both Catholic and Protestant theologians, considers the liturgical worship, particularly the ": null
    },
    {
        "Easter": "easter"
    },
    {
        " rites, of early Christianity as background and context for understanding the Book of Revelations structure and significance. This perspective is explained in The Paschal Liturgy and the Apocalypse by ": null
    },
    {
        "Massey H. Shepherd": "massey h. shepherd"
    },
    {
        ", an Episcopal scholar, and in ": null
    },
    {
        "Scott Hahns": "scott hahn"
    },
    {
        " The Lambs Supper: The Mass as Heaven on Earth , in which he states that Revelation in form is structured after creation, fall, judgment and redemption. Those who hold this view say that the Temples destruction had a profound effect on the Jewish people, not only in Jerusalem but among the Greek-speaking Jews of the Mediterranean. Scott Hahn, The Lambs Supper: The Mass as Heaven on Earth, . New York: Doubleday, 1999.     They believe the Book of Revelation provides insight into the early Eucharist, saying that it is the new Temple worship in the New Heaven and Earth. The idea of the Eucharist as a foretaste of the heavenly banquet is also explored by British Methodist Geoffrey Wainwright in his book Eucharist and Eschatology . According to ": null
    },
    {
        "Pope Benedict XVI": "pope benedict xvi"
    },
    {
        " some of the images of Revelation should be understood in the context of the dramatic suffering and persecution of the churches of Asia in the 1st century.     Accordingly, the Book of Revelation should not be read as an enigmatic warning, but as an encouraging vision of Christs definitive victory over evil.        In the ": null
    },
    {
        "Coptic Orthodox Church": "coptic orthodox church of alexandria"
    },
    {
        " the whole Book of Revelation is read during Apocalypse Night or ": null
    },
    {
        "Good Friday": "good friday"
    },
    {
        ". , published by ": null
    },
    {
        "Coptic Orthodox Diocese of the Southern United States": "coptic orthodox diocese of the southern united states"
    },
    {
        ", accessed 23 May 2018       Most Christian interpretations fall into one or more of the following categories:   ": null
    },
    {
        "Historicism": "historicism"
    },
    {
        ", which sees in Revelation a broad view of history;   ": null
    },
    {
        "Preterism": "preterism"
    },
    {
        ", in which Revelation mostly refers to the events of the ": null
    },
    {
        "apostolic era": "apostolic era"
    },
    {
        " or, at the latest, the fall of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ";   ": null
    },
    {
        "Amillennialism": "amillennialism"
    },
    {
        ", which rejects a literal interpretation of the millennium and treats the content of the book as symbolic;   ": null
    },
    {
        "Futurism": "futurism"
    },
    {
        ", which believes that Revelation describes future events ; and   ": null
    },
    {
        "Idealism/Allegoricalism": "idealism"
    },
    {
        ", which holds that Revelation does not refer to actual people or events, but is an ": null
    },
    {
        "allegory": "allegory"
    },
    {
        " of the spiritual path and the ongoing struggle between ": null
    },
    {
        "good and evil": "good and evil"
    },
    {
        ".          ": null
    },
    {
        "Eastern Orthodoxy": "eastern orthodoxy"
    },
    {
        " treats the text as simultaneously describing contemporaneous events and as prophecy of events to come, for which the contemporaneous events were a form of foreshadow. It rejects attempts to determine, before the fact, if the events of Revelation are occurring by mapping them onto present-day events, taking to heart the Scriptural warning against those who proclaim He is here! prematurely. Instead, the book is seen as a warning to be spiritually and morally ready for the end times, whenever they may come , but they will come at the time of Gods choosing, not something that can be precipitated nor trivially deduced by mortals.    This view is also held by many Catholics, although there is a diversity of opinion about the nature of the Apocalypse within Catholicism.     Book of Revelation is the only book of the New Testament that is not read during services by the Byzantine Rite Churches although in the ": null
    },
    {
        "Western Rite Orthodox Parishes": "western rite orthodoxy"
    },
    {
        ", which are under the same bishops as the Byzantine Rite, it is read.          The early Protestants followed a historicist interpretation of the Bible, which identified the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " as the ": null
    },
    {
        "Antichrist": "antichrist"
    },
    {
        ".        Similar to the early Protestants, Adventists maintain a historicist interpretation of the Bibles predictions of the apocalypse.      Seventh-day Adventists believe the Book of Revelation is especially relevant to believers in the days preceding the second coming of Jesus Christ. The universal church is composed of all who truly believe in Christ, but in the last days, a time of widespread apostasy, a remnant has been called out to keep the commandments of God and the faith of Jesus.  Here is the patience of the saints; here are those who keep the commandments of God and the faith of Jesus.  As participatory agents in the work of salvation for all humankind, This remnant announces the arrival of the judgment hour, proclaims salvation through Christ, and heralds the approach of His second advent.  The three angels of Revelation 14 represent the people who accept the light of Gods messages and go forth as His agents to sound the warning throughout the length and breadth of the earth.        By the analogous reasoning between the ": null
    },
    {
        "Millerite": "millerism"
    },
    {
        " historicism, and ": null
    },
    {
        "Bahaullahs": "bahaullah"
    },
    {
        "doctrine of ": null
    },
    {
        "progressive revelation": "progressive revelation"
    },
    {
        ", a modified historicist method of interpreting prophecy has become integrated in foremost American Baháí teachings.      ": null
    },
    {
        "Abdul-Bahá": "abdul-bahá"
    },
    {
        " has given some interpretations about the 11th and 12th chapters of Revelation in  Some Answered Questions .   The 1,260 days spoken of in the forms: one thousand two hundred and sixty days,  forty-two months,  refers to the 1,260 years in the ": null
    },
    {
        "Islamic Calendar": "islamic calendar"
    },
    {
        " . The two witnesses spoken of are ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        " and ": null
    },
    {
        "Ali": "ali"
    },
    {
        ".  Also, the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " reads, And there appeared a great wonder in heaven; and behold a great red dragon, having seven heads and ten horns, and seven crowns upon his heads .  The seven heads of the dragon are symbolic of the seven provinces dominated by the Umayyads: Damascus, Persia, Arabia, Egypt, Africa, Andalusia, and Transoxania. The ten horns represent the ten names of the leaders of the Umayyad dynasty: Abu Sufyan, Muawiya, Yazid, Marwan, Abd al-Malik, Walid, Sulayman, Umar, Hisham, and Ibrahim. Some names were re-used, as in the case of Yazid II and Yazid III and the like, which were not counted for this interpretation.        The ": null
    },
    {
        "Book of Mormon": "book of mormon"
    },
    {
        " states that ": null
    },
    {
        "John the Apostle": "john the apostle"
    },
    {
        " is the author of Revelation and that he was foreordained by God to write it.       ": null
    },
    {
        "Doctrine and Covenants": "doctrine and covenants"
    },
    {
        ", section 77, postulates answers to specific questions regarding the symbolism contained in the Book of Revelation.   Topics include: the sea of glass, the four beasts and their appearance, the 24 elders, the book with seven seals, certain angels, the sealing of the 144,000, the little book eaten by John, and the two witnesses in Chapter 11.     Members of The Church of Jesus Christ of Latter-day Saints believe that the warning contained in Revelation 22:18–19  does not refer to the biblical canon as a whole.  Rather, an open and ongoing dialogue between God and the modern-day Prophet and Apostles of the LDS faith constitute an open canon of scripture.        Christian Gnostics, however, are unlikely to be attracted to the teaching of Revelation because the doctrine of salvation through the sacrificed Lamb, which is central to Revelation, is repugnant to Gnostics. Christian Gnostics believed in the Forgiveness of Sins, but in no vicarious sacrifice for sin ... they accepted Christ in the full realisation of the word; his life, not his death, was the keynote of their doctrine and their practice. R. ": null
    },
    {
        "Frances Swiney": "frances swiney"
    },
    {
        " The Esoteric Teaching of the Gnostics London: Yellon, Williams & Co pp. 3, 4     ": null
    },
    {
        "James Morgan Pryse": "james morgan pryse"
    },
    {
        " was an esoteric gnostic who saw Revelation as a western version of the Hindu theory of the ": null
    },
    {
        "Chakra": "chakra"
    },
    {
        ". He began his work, The purpose of this book is to show that the Apocalypse is a manual of spiritual development and not, as conventionally interpreted, a cryptic history or prophecy. James M. Pryse Apocalypse Unsealed London: Watkins . The theory behind the book is given in ": null
    },
    {
        "Arthur Avalon": "arthur avalon"
    },
    {
        " The Serpent Power Madras : Ganesh & Co . One version of how these beliefs might have travelled from India to the Middle East, Greece and Rome is given in the opening chapters of ": null
    },
    {
        "Rudolf Otto": "rudolf otto"
    },
    {
        " The Kingdom of God and the Son of Man London: Lutterworth Such diverse theories have failed to command widespread acceptance. But Christopher Rowland argues: there are always going to be loose threads which refuse to be woven into the fabric as a whole. The presence of the threads which stubbornly refuse to be incorporated into the neat tapestry of our world-view does not usually totally undermine that view. Christopher Rowland Revelation London: Epworth p. 5       The radical discipleship interpretation asserts that the Book of Revelation is best understood as a handbook for radical discipleship; i.  e., how to remain faithful to the spirit and teachings of Jesus and avoid simply assimilating to surrounding society. In this interpretation the primary agenda of the book is to expose as impostors the worldly powers that seek to oppose the ways of God and Gods Kingdom. The chief temptation for Christians in the 1st century, and today, is to fail to hold fast to the non-violent teachings and example of Jesus and instead be lured into unquestioning adoption and assimilation of worldly, national or cultural values – ": null
    },
    {
        "imperialism": "imperialism"
    },
    {
        ", ": null
    },
    {
        "nationalism": "nationalism"
    },
    {
        ", and ": null
    },
    {
        "civil religion": "civil religion"
    },
    {
        " being the most dangerous and insidious.     This perspective  draws on the approach of Bible scholars such as ": null
    },
    {
        "Ched Myers": "ched myers"
    },
    {
        ", ": null
    },
    {
        "William Stringfellow": "william stringfellow"
    },
    {
        ", ": null
    },
    {
        "Richard Horsley": "richard horsley"
    },
    {
        ", ": null
    },
    {
        "Daniel Berrigan": "daniel berrigan"
    },
    {
        ", Wes Howard-Brook,  and ": null
    },
    {
        "Joerg Rieger": "joerg rieger"
    },
    {
        ".  Various ": null
    },
    {
        "Christian anarchists": "christian anarchism"
    },
    {
        ", such as ": null
    },
    {
        "Jacques Ellul": "jacques ellul"
    },
    {
        ", have identified the ": null
    },
    {
        "State": "state"
    },
    {
        " and ": null
    },
    {
        "political power": "political power"
    },
    {
        " as ": null
    },
    {
        "the Beast": "the beast"
    },
    {
        "  and the events described, being their doings and results, the aforementioned wrath.       Many literary writers and theorists have contributed to a wide range of theories about the origins and purpose of the Book of Revelation. Some of these writers have no connection with established Christian faiths but, nevertheless, found in Revelation a source of inspiration. Revelation has been approached from Hindu philosophy and Jewish ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        ". Others have pointed to aspects of composition which have been ignored such as the similarities of prophetic inspiration to modern poetic inspiration, or the parallels with ": null
    },
    {
        "Greek drama": "theatre of ancient greece"
    },
    {
        ". In recent years, theories have arisen which concentrate upon how readers and texts interact to create meaning and which are less interested in what the original author intended.     ": null
    },
    {
        "Charles Cutler Torrey": "charles cutler torrey"
    },
    {
        " taught ": null
    },
    {
        "Semitic languages": "semitic languages"
    },
    {
        " at ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        ". His lasting contribution has been to show how much more meaningful prophets, such as the scribe of Revelation, are when treated as poets first and foremost. He thought this was a point often lost sight of because most English bibles render everything in prose. Charles C. Torrey The Apocalypse of John New Haven: Yale University Press . Christopher R. North in his The Second Isaiah London: OUP p. 23 says of Torreys earlier Isaiah theory, Few scholars of any standing have accepted his theory. This is the general view of Torreys theories. However, Christopher North goes on to cite Torrey on 20 major occasions and many more minor ones in the course of his book. So, Torrey must have had some influence and poetry is the key. Poetry was also the reason John never directly quoted the older prophets. Had he done so, he would have had to use their poetry whereas he wanted to write his own. Torrey insisted Revelation had originally been written in Aramaic. Apocalypse of John p. 7     This was why the surviving Greek translation was written in such a strange idiom. It was a literal translation that had to comply with the warning at Revelation 22:18 that the text must not be corrupted in any way. According to Torrey, the story is that The Fourth Gospel was brought to Ephesus by a Christian fugitive from Palestine soon after the middle of the first century. It was written in Aramaic. Later, the Ephesians claimed this fugitive had actually been the beloved disciple himself. Subsequently, this John was banished by Nero and died on Patmos after writing Revelation. Torrey argued that until AD 80, when Christians were expelled from the synagogues, Apocalypse of John p. 37 the Christian message was always first heard in the synagogue and, for cultural reasons, the evangelist would have spoken in Aramaic, else he would have had no hearing. Apocalypse of John p. 8 Torrey showed how the three major songs in Revelation each fall naturally into four regular metrical lines plus a coda. Apocalypse of John p. 137 Other dramatic moments in Revelation, such as 6:16 where the terrified people cry out to be hidden, behave in a similar way. Apocalypse of John p. 140     ": null
    },
    {
        "Christina Rossetti": "christina rossetti"
    },
    {
        " was a Victorian poet who believed the sensual excitement of the natural world found its meaningful purpose in death and in God. Flowers preach to us if we will hear , begins her poem Consider the lilies of the field Goblin Market London: Oxford University Press p. 87 Her The Face of the Deep is a meditation upon the Apocalypse. In her view, what Revelation has to teach is patience. Ms Rossetti remarks that patience is a word which does not occur in the Bible until the New Testament, as if the usage first came from Christs own lips. Christina Rossetti The Face of the Deep London: SPCK p. 115 Patience is the closest to perfection the human condition allows. Christians should resemble fire-flies, not glow-worms; their brightness drawing eyes upward, not downward. The Face of the Deep p. 26 Her book, which is largely written in prose, frequently breaks into poetry or jubilation, much like Revelation itself. The relevance of Johns visions vision lends the wrong emphasis as Ms Rossetti sought to minimise the distinction between Johns experience and that of others. She quoted 1 John 3:24 He abideth in us, by the Spirit which he hath given us to show that when John says, I was in the Spirit it is not exceptional. belongs to Christians of all times as a continuous present meditation. Such matters are eternal and outside of normal human reckoning. That winter which will be the death of Time has no promise of termination. Winter that returns not to spring ... – who can bear it? The Face of the Deep p. 301 She dealt deftly with the vengeful aspects of Johns message. A few are charged to do judgment; everyone without exception is charged to show mercy. The Face of the Deep p. 292 Her conclusion is that Christians should see John as representative of all his brethren so they should hope as he hoped, love as he loved. The Face of the Deep p. 495     Recently, aesthetic and literary modes of interpretation have developed, which focus on Revelation as a work of art and imagination, viewing the imagery as symbolic depictions of timeless truths and the victory of good over evil. ": null
    },
    {
        "Elisabeth Schüssler Fiorenza": "elisabeth schüssler fiorenza"
    },
    {
        " wrote Revelation: Vision of a Just World from the viewpoint of rhetoric. Elisabeth Schuessler Fiorenza Revelation: Vision of a Just World Edinburgh: T & T Clark . The book seems to have started life as Invitation to the Book of Revelation Garden City: Doubleday Accordingly, Revelations meaning is partially determined by the way John goes about saying things, partially by the context in which readers receive the message and partially by its appeal to something beyond logic. Tina Pippin Death & Desire: The rhetoric of gender in the Apocalypse of John Louisville: Westminster-John Knox p. 105     Professor Schüssler Fiorenza believes that Revelation has particular relevance today as a liberating message to disadvantaged groups. Johns book is a vision of a just world, not a vengeful threat of world-destruction. Her view that Revelations message is not gender-based has caused dissent. She says we are to look behind the symbols rather than make a fetish out of them. In contrast, Tina Pippin states that John writes ": null
    },
    {
        "horror literature": "horror fiction"
    },
    {
        " and the ": null
    },
    {
        "misogyny": "misogyny"
    },
    {
        " which underlies the narrative is extreme.     ": null
    },
    {
        "D. H. Lawrence": "d. h. lawrence"
    },
    {
        " took an opposing, pessimistic view of Revelation in the final book he wrote, Apocalypse. D H Lawrence Apocalypse London: Martin Secker published posthumously with an introduction by Richard Aldington which is an integral part of the text. He saw the language which Revelation used as being bleak and destructive; a death-product. Instead, he wanted to champion a public-spirited individualism against its two natural enemies. One of these he called the sovereignty of the intellect Apocalypse p. xxiii which he saw in a technology-based totalitarian society. The other enemy he styled vulgarity Apocalypse p. 6 and that was what he found in Revelation. It is very nice if you are poor and not humble ... to bring your enemies down to utter destruction, while you yourself rise up to grandeur. And nowhere does this happen so splendiferously than in Revelation. Apocalypse p. 11 Lawrence did not consider how these two types of Christianity might be related other than as opposites. He noted the difference meant that the John who wrote a gospel could not be the same John that wrote Revelation.     His specific aesthetic objections to Revelation were that its imagery was unnatural and that phrases like the wrath of the Lamb were ridiculous. He saw Revelation as comprising two discordant halves. In the first, there was a scheme of cosmic renewal in great Chaldean sky-spaces , which he quite liked. After that, Lawrence thought, the book became preoccupied with the birth of the baby messiah and flamboyant hate and simple lust ... for the end of the world. Lawrence coined the term Patmossers to describe those Christians who could only be happy in paradise if they knew their enemies were suffering in hell.           Modern biblical scholarship attempts to understand Revelation in its 1st-century historical context within the genre of Jewish and Christian apocalyptic literature. This approach considers the text as an address to seven historical communities in Asia Minor. Under this interpretation, assertions that the time is near are to be taken literally by those communities. Consequently, the work is viewed as a warning to not conform to contemporary Greco-Roman society which John unveils as beastly, demonic, and subject to divine judgment. ": null
    },
    {
        "Dale Martin": "dale martin"
    },
    {
        " 2009 . . ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        ". Accessed 22 July 2013.      New Testament narrative criticism also places Revelation in its first century historical context but approaches the book from a literary perspective. David L. Barr, Tales of the End: A Narrative Commentary on the Book of Revelation ; Barr, Narrative Technique in the Book of Revelation . In Oxford Handbook of Biblical Narrative, ed. Danna Nolan Fewell , 376–88; ": null
    },
    {
        "James L. Resseguie": "james l. resseguie"
    },
    {
        ", Revelation Unsealed: A Narrative Critical Approach to John’s Apocalypse, Biblical Interpretation Series 32 ; Resseguie, The Revelation of John: A Narrative Commentary . For example, narrative critics examine characters and characterization, literary devices, settings, plot, themes, point of view, implied reader, implied author, and other constitutive features of narratives in their analysis of the book.     Although the acceptance of Revelation into the ": null
    },
    {
        "canon": "biblical canon"
    },
    {
        " has, from the beginning, been controversial, it has been essentially similar to the career of other texts.  The eventual exclusion of other contemporary apocalyptic literature from the canon may throw light on the unfolding historical processes of what was officially considered orthodox, what was ": null
    },
    {
        "heterodox": "heterodox"
    },
    {
        ", and what was even heretical. Interpretation of meanings and imagery are anchored in what the historical author intended and what his contemporary audience inferred; a message to Christians not to assimilate into the Roman imperial culture was Johns central message. Thus, his letter is pastoral in nature , and the symbolism of Revelation is to be understood entirely within its historical, literary, and social context. Critics study the conventions of apocalyptic literature and events of the 1st century to make sense of what the author may have intended.      Scholar Barbara Whitlock pointed out a similarity between the consistent destruction of thirds depicted in the Book of Revelation   and the ": null
    },
    {
        "Iranian mythology": "persian mythology"
    },
    {
        " evil character ": null
    },
    {
        "Zahhak": "zahhak"
    },
    {
        " or Dahāg, depicted in the ": null
    },
    {
        "Avesta": "avesta"
    },
    {
        ", the earliest religious texts of ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        ". Dahāg is mentioned as wreaking much evil in the world until at last chained up and imprisoned on the mythical Mt. Damāvand. The Middle Persian sources prophesy that at the end of the world, Dahāg will at last burst his bonds and ravage the world, consuming one in three humans and livestock, until the ancient hero ": null
    },
    {
        "Kirsāsp": "garshasp"
    },
    {
        " returns to life to kill Dahāg. Whitlock wrote: Zoroastrianism, the state religion of the Roman Empires main rival, was part of the intellectual millieu in which Christianity came into being, just as were Judaism, the Greek-Roman religion, and the worship of Isis and Mithras. A Zoroastrian influence is completely plausible . Dr. Barbara Whitlock, Tracing out the convoluted sources of Christianity in George D. Barnes , Collected New Essays in Comparative Religion       Much of Revelation employs ancient sources, primarily but not exclusively from the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ". For example, Howard-Brook and Gwyther Wes Howard-Brook & Anthony Gwyther Unveiling Empire New York: Orbis p. 76 regard the ": null
    },
    {
        "Book of Enoch": "book of enoch"
    },
    {
        " as an equally significant but contextually different source. Enochs journey has no close parallel in the Hebrew scriptures. Revelation, in one section, forms an inverted parallel  with the book of Enoch in which 1 En 100:1–3 has a river of blood deep enough to submerge a chariot and in Rev 14:20 has a river of blood up to the horses bridle. There is an angel ascending in both accounts and both accounts have three messages .      Academics showed little interest in this topic until recently. S Moyise p. 13 reports no work whatsoever done between 1912 and 1984 This was not, however, the case with popular writers from non-conforming backgrounds, who interspersed the text of Revelation with the prophecy they thought was being promised. For example, an anonymous Scottish commentary of 1871 Anon An exposition of the Apocalypse on a new principle of literal interpretation Aberdeen: Brown prefaces Revelation 4 with the Little Apocalypse of Mark 13, places Malachi 4:5 within Revelation 11 and writes Revelation 12:7 side-by-side with the role of the Satan in the ": null
    },
    {
        "Book of Job": "book of job"
    },
    {
        ". The message is that everything in Revelation will happen in its previously appointed time.     Steve Moyise uses the index of the United Bible Societies Greek New Testament to show that Revelation contains more Old Testament ": null
    },
    {
        "allusions": "allusion"
    },
    {
        "than any other New Testament book, but it does not record a single quotation. S. Moyise The Old Testament in the Book of Revelation Sheffield: ": null
    },
    {
        "Sheffield Academic Press": "sheffield academic press"
    },
    {
        " p. 31 Perhaps significantly, Revelation chooses different sources than other New Testament books. Revelation concentrates on Isaiah, Psalms, and Ezekiel, while neglecting, comparatively speaking, the books of the Pentateuch that are the dominant sources for other New Testament writers. Methodological objections have been made to this course as each allusion may not have an equal significance. To counter this, G. K. Beale sought to develop a system that distinguished clear, probable, and possible allusions. A clear allusion is one with almost the same wording as its source, the same general meaning, and which could not reasonably have been drawn from elsewhere. A probable allusion contains an idea which is uniquely traceable to its source. Possible allusions are described as mere echoes of their putative sources.     Yet, with Revelation, the problems might be judged more fundamental. The author seems to be using his sources in a completely different way to the originals. For example, he borrows the new temple imagery of Ezekiel 40–48 but uses it to describe a New Jerusalem which, quite pointedly, no longer needs a temple because it is Gods dwelling. Ian Boxall Ian Boxall The Revelation of St John London: Continuum & Peabody MA: Hendrickson p. 254 writes that Revelation is no montage of biblical quotations but a wealth of allusions and evocations rewoven into something new and creative. In trying to identify this something new , Boxall argues that Ezekiel provides the backbone for Revelation. He sets out a comparative table listing the chapters of Revelation in sequence and linking most of them to the structurally corresponding chapter in Ezekiel. The interesting point is that the order is not the same. John, on this theory, rearranges Ezekiel to suit his own purposes.     Some commentators argue that it is these purposes – and not the structure – that really matter. G. K. Beale believes that, however much John makes use of Ezekiel, his ultimate purpose is to present Revelation as a fulfillment of ": null
    },
    {
        "Daniel 7": "daniel 7"
    },
    {
        ". G. K. Beale Johns use of the Old Testament in Revelation Sheffield: Sheffield Academic Press p. 109 ": null
    },
    {
        "Richard Bauckham": "richard bauckham"
    },
    {
        " has argued that John presents an early view of the Trinity through his descriptions of the visions and his identifying Jesus and the Holy Spirit with YHWH. Brandon Smith has expanded on both of their proposals while proposing a trinitarian reading of Revelation, arguing that John uses Old Testament language and allusions from various sources to describe a multiplicity of persons in YHWH without sacrificing monotheism, which would later be codified in the trinitarian doctrine of ": null
    },
    {
        "Nicene Christianity": "nicene christianity"
    },
    {
        ". Brandon D. Smith, The Identification of Jesus with YHWH in the Book of Revelation, Criswell Theological Review     One theory, Revelation Draft Hypothesis, sees the book of Revelation constructed by forming parallels with several texts in the Old Testament such as Ezekiel, Isaiah, Zechariah, Deuteronomy, Joshua, Exodus, and Daniel. For example, Ezekiels encounter with God is in reverse order as Johns encounter with God ": null
    }
]