[
    {
        "Bookends is the fourth studio album by American music duo ": null
    },
    {
        "Simon & Garfunkel": "simon  &  garfunkel"
    },
    {
        ". Produced by ": null
    },
    {
        "Paul Simon": "paul simon"
    },
    {
        ", ": null
    },
    {
        "Roy Halee": "roy halee"
    },
    {
        " and ": null
    },
    {
        "Art Garfunkel": "art garfunkel"
    },
    {
        ", the album was released on April 42 42 in the United States by ": null
    },
    {
        "Columbia Records": "columbia records"
    },
    {
        ". The duo had risen to fame two years prior with the albums  Sounds of Silence  and  Parsley, Sage, Rosemary and Thyme  and the ": null
    },
    {
        "soundtrack album": "the graduate"
    },
    {
        " for the 42 film  The Graduate .     Bookends is a ": null
    },
    {
        "concept album": "concept album"
    },
    {
        " that explores a life journey from childhood to old age. Side one of the album marks successive stages in life, the theme serving as bookends to the life cycle. Side two largely consists of unused material for The Graduate soundtrack. Simons lyrics concern youth, disillusionment, relationships, old age, and mortality. Much of the material was crafted alongside producer ": null
    },
    {
        "John Simon": "john simon"
    },
    {
        " , who joined the recording when Paul Simon suffered from ": null
    },
    {
        "writers block": "writers block"
    },
    {
        ". The album was recorded gradually over the period of a year, with production speeding up around the later months of 42     Initial sales for Bookends were substantial in the US, and the album produced the ": null
    },
    {
        "number-one": "list of billboard hot 100 number-one singles of 1968"
    },
    {
        " single ": null
    },
    {
        "Mrs. Robinson": "mrs. robinson"
    },
    {
        " . The album sold best in the US and in the United Kingdom, where it peaked at number one. Bookends was considered a breakthrough for the duo, placing them on the same level as artists such as the ": null
    },
    {
        "Beatles": "the beatles"
    },
    {
        ", ": null
    },
    {
        "Bob Dylan": "bob dylan"
    },
    {
        " and the ": null
    },
    {
        "Rolling Stones": "the rolling stones"
    },
    {
        " at the forefront of the ": null
    },
    {
        "cultural movement": "counterculture of the 1960s"
    },
    {
        " in the 42s. The album has continued to receive critical acclaim.       ": null
    },
    {
        "Simon & Garfunkel": "simon  &  garfunkel"
    },
    {
        " first burst onto the national scene when their ": null
    },
    {
        "hit single": "hit single"
    },
    {
        " The Sound of Silence": "the sound of silence"
    },
    {
        " made waves on radio in 42 during a period in which the duo had broken up due to the failure of their debut release,  Wednesday Morning, 42 A.M.  . Following another release,  Sounds of Silence  , the duo recorded and released  Parsley, Sage, Rosemary and Thyme  , which brought new critical and commercial success to the duo. Simon, then 42 felt he had finally made it into an upper echelon of rock and roll, while most importantly retaining artistic integrity . The duo chose ": null
    },
    {
        "William Morris": "william morris agency"
    },
    {
        " as their ": null
    },
    {
        "booking agency": "talent agent"
    },
    {
        " after a recommendation from ": null
    },
    {
        "Wally Amos": "wally amos"
    },
    {
        ", a mutual friend through their producer, ": null
    },
    {
        "Tom Wilson": "tom wilson"
    },
    {
        ".     During the sessions for Parsley, the duo cut ": null
    },
    {
        "A Hazy Shade of Winter": "a hazy shade of winter"
    },
    {
        " and decided to release it as a single then, where it peaked at number 42 on the national charts. Similarly, they recorded At the Zoo for single release in early 42 . Simon began work for Bookends around this time, noting to a writer at  High Fidelity  that Im not interested in singles anymore . He had hit a ": null
    },
    {
        "dry spell in his writing": "writers block"
    },
    {
        ", which led to no Simon & Garfunkel album on the horizon for 42 Artists at the time were expected to release two, perhaps three albums each year and the lack of productivity from the duo worried executives at Columbia Records. Amid concerns for Simons idleness, Columbia Records chairman ": null
    },
    {
        "Clive Davis": "clive davis"
    },
    {
        " arranged for up-and-coming ": null
    },
    {
        "record producer": "record producer"
    },
    {
        " John Simon": "john simon"
    },
    {
        " to kick-start the recording. Simon was distrustful of ": null
    },
    {
        "suits": "music executive"
    },
    {
        " at the label; on one occasion, he and Garfunkel brought a tape recorder into a meeting with Davis, who was giving a fatherly talk on speeding up production, in order to laugh at it later.     Meanwhile, director ": null
    },
    {
        "Mike Nichols": "mike nichols"
    },
    {
        ", then filming  The Graduate , had become fascinated with the duos past two efforts, listening to them nonstop before and after filming. After two weeks of this obsession, he met with Clive Davis to ask for permission to license Simon & Garfunkel music for his film. Davis viewed it as a perfect fit and envisioned a best-selling soundtrack album. Simon was not as immediately receptive, viewing movies akin to ": null
    },
    {
        "selling out": "selling out"
    },
    {
        " , creating a damper on his artistic integrity. However, after meeting Nichols and becoming impressed by his wit and the script, he agreed to write at least one or two new songs for the film. ": null
    },
    {
        "Leonard Hirshan": "leonard hirshan"
    },
    {
        ", a powerful agent at William Morris, negotiated a deal that paid Simon $42  to submit three songs to Nichols and producer ": null
    },
    {
        "Lawrence Turman": "lawrence turman"
    },
    {
        ". Several weeks later, Simon re-emerged with two new tracks, ": null
    },
    {
        "Punkys Dilemma": "punkys dilemma"
    },
    {
        " and ": null
    },
    {
        "Overs": "overs"
    },
    {
        " , neither of which Nichols was particularly taken with. The duo offered another new song, which later became ": null
    },
    {
        "Mrs. Robinson": "mrs. robinson"
    },
    {
        " , that was not as developed. Nichols loved it.          Bookends was recorded in fits and starts from 42 to 42 John Simons first session with the group was for ": null
    },
    {
        "Fakin It": "fakin it"
    },
    {
        " in June 42 The duo were signed under an older contract that specified the label pay for sessions . Simon & Garfunkel took advantage of this indulgence, hiring ": null
    },
    {
        "viola": "viola"
    },
    {
        " and ": null
    },
    {
        "brass": "brass instrument"
    },
    {
        " players, as well as ": null
    },
    {
        "percussionists": "percussionists"
    },
    {
        ". When the viola players arrived, the duo were so intrigued with the sound of the musicians tuning their instruments before recording that they spent nearly all night trying to find the random sound.      The records brevity reflects its concise and perfectionistic production. The team spent over 42 studio hours recording Punkys Dilemma , for example, and re-recorded vocal parts, sometimes note by note, until they were satisfied.  Simon paid close attention to his vocal takes, and he strived to get each line perfect. He took a bigger role in all aspects of production, and harmonies for which the band was famous gradually disappeared in favor of songs sung solo by each member. Although the album had been planned long in advance, work did not begin in earnest until the late months of 42     John Simons work with the duo produced several tracks that ended up on Bookends, such as Punkys Dilemma , ": null
    },
    {
        "Save the Life of My Child": "save the life of my child"
    },
    {
        " , and Overs . In October 42 Morgan Ames, writer for High Fidelity magazine, attended a recording session with the duo, Simon, Halee and an assistant engineer at Columbias recording studio on 42nd Street in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ". Her observations were reported in the November edition of the magazine:          Work on Bookends slowed by the beginning of the new year, with John Simons departure from Columbia. The duo and Halee completed production themselves, recording ": null
    },
    {
        "America": "america"
    },
    {
        " on February 42 the final version of ": null
    },
    {
        "Mrs. Robinson": "mrs. robinson"
    },
    {
        " on February 42 and ": null
    },
    {
        "Old Friends": "old friends"
    },
    {
        " and the closing Bookends Theme on March 42 Simon felt the album had the most use of the studio of all of the duos albums.            The ": null
    },
    {
        "Bookends Theme": "bookends theme"
    },
    {
        " that opens and closes side one is played on the ": null
    },
    {
        "acoustic guitar": "acoustic guitar"
    },
    {
        ", with no additional instruments. An audio sample of the bands first hit, ": null
    },
    {
        "The Sound of Silence": "the sound of silence"
    },
    {
        " , softly plays during a cacophony of sounds near the end of the second track, ": null
    },
    {
        "Save the Life of My Child": "save the life of my child"
    },
    {
        " . John Simon, who was credited with production assistance on the song, created the bassline by playing a ": null
    },
    {
        "Moog synthesizer": "moog synthesizer"
    },
    {
        " with help from ": null
    },
    {
        "Robert Moog": "robert moog"
    },
    {
        " himself.  James Bennighof, author of The Words and Music of Paul Simon, finds that textural elements are variously supported by a churning groove, percussive, and distorted electronic sounds that complement the songs subject matter, suicide suburban youth. The song America explores the search of meaning in the life of a young adult.  Overs explores a more ": null
    },
    {
        "jazz": "jazz"
    },
    {
        "-oriented style, with a larger selection of chords and looser ": null
    },
    {
        "form": "musical form"
    },
    {
        " than the groups previous styles.     Voices of Old People is a sound collage, and was recorded on tape by Garfunkel at the United Home for Aged Hebrews and the California Home for the Aged at Reseda. The collection of audio recordings of the elderly find them musing on treasured photographs, illness and living conditions. In ": null
    },
    {
        "Old Friends": "old friends"
    },
    {
        " , the title generally conveys the introduction or ending of sections through repetition, and the song builds upon a rather loose formal structure that at first includes an ": null
    },
    {
        "acoustic guitar": "acoustic guitar"
    },
    {
        " and soft mood. An additional element is introduced midway through the track: an orchestral ": null
    },
    {
        "arrangement": "arrangement"
    },
    {
        " conducted by ": null
    },
    {
        "Jimmie Haskell": "jimmie haskell"
    },
    {
        ", dominated by ": null
    },
    {
        "strings": "strings"
    },
    {
        " and ": null
    },
    {
        "xylophone": "xylophone"
    },
    {
        " notes. Horns and other instruments are added when the duo cease singing, creating a turbulence that builds to a single high, sustained note on the strings. The song then segues into the final song of side one, the reprise of the Bookends Theme .     Side two consists of miscellaneous unrelated songs unused for The Graduate, with many possessing a more rock-based sound than the unified folk songs that precede it. Simon felt the albums second side was composed of throwaway tracks: They didnt mean a lot. They werent well recorded. In ": null
    },
    {
        "Fakin It": "fakin it"
    },
    {
        " , melodies are occasionally deleted to suit lyrics, but the song generally follows a similar chord structure and melodic outline over a ": null
    },
    {
        "funky": "funk rock"
    },
    {
        " rock beat that sonically references the Beatles ": null
    },
    {
        "Tomorrow Never Knows": "tomorrow never knows"
    },
    {
        " . ": null
    },
    {
        "Punkys Dilemma": "punkys dilemma"
    },
    {
        " is breezy and minimal musically, with a ": null
    },
    {
        "soft jazz": "soft jazz"
    },
    {
        "-style percussion and seemingly improvised guitar lines dominated by major and minor seventh chords. ": null
    },
    {
        "Mrs. Robinson": "mrs. robinson"
    },
    {
        " opens with an instantly recognizable ": null
    },
    {
        "pop rock": "pop rock"
    },
    {
        " guitar hook that carries throughout the track. The first verse consists only of syllables— dee-dee-dee and doo-doo-doo —that form stable harmonic foundation. The inclusion of the meaningless syllables arises from the unfinished nature of the song when pitched to director Mike Nichols, who particularly liked the verse. ": null
    },
    {
        "A Hazy Shade of Winter": "a hazy shade of winter"
    },
    {
        " follows a more rock-tinged sound, with a fairly straightforward verse-refrain structure. ": null
    },
    {
        "At the Zoo": "at the zoo"
    },
    {
        " uses a rock groove that settles into the key of G major.          According to ": null
    },
    {
        "disc jockey": "disc jockey"
    },
    {
        " and author ": null
    },
    {
        "Pete Fornatale": "pete fornatale"
    },
    {
        ", the album perhaps shares thematic qualities with another ": null
    },
    {
        "concept album": "concept album"
    },
    {
        ", the Beatles  Sgt. Peppers Lonely Hearts Club Band , released ten months prior. He equates At the Zoo and Old Friends to ": null
    },
    {
        "Being for the Benefit of Mr. Kite!": "being for the benefit of mr. kite!"
    },
    {
        " and ": null
    },
    {
        "When Im Sixty-Four": "when im sixty-four"
    },
    {
        " , respectively. Fornatale notes, however, that while Sgt. Pepper was notable for sonically colorful, ": null
    },
    {
        "psychedelic": "psychedelic music"
    },
    {
        " shapes, Bookends is starkly contrasted by moody, black-and-white and gray sounds. While concept albums were fairly common among rock groups at this time—such as ": null
    },
    {
        "The Rolling Stones": "the rolling stones"
    },
    {
        "  Their Satanic Majesties Request , ": null
    },
    {
        "The Byrds": "the byrds"
    },
    {
        "  Sweetheart of the Rodeo  and ": null
    },
    {
        "Iron Butterfly": "iron butterfly"
    },
    {
        "s  In-a-Gadda-Da-Vida —Bookends enjoyed massive success with the format not unlike the Beatles nearly one year before. Garfunkel confirmed the influence of Sgt. Peppers in a 42 interview, commenting, We were terribly impressed, and that shone a light on the path that led to Bookends.  Simon often smoked ": null
    },
    {
        "hashish": "hashish"
    },
    {
        " when writing, and he was convinced he must be high to write. He felt the drug had a negative effect and caused him to retreat more into myself. He often found himself alone while on tour, and his thoughts grew dark during these times. He attributed the pain that comes out in some of the songs is due to the exaggeration of being high.      Bookends contains many of Paul Simons major themes, including youth, alienation, life, love, disillusionment, relationships, old age, and mortality . Simons work on Bookends is loosely autobiographical, designed to function as both a personal and artistic statement. Simon, feeling especially auteurist in the ": null
    },
    {
        "Dylan": "bob dylan"
    },
    {
        " style of the day , had planned out the albums concept before he began writing, telling Garfunkel Im going to start writing a whole side of an album—a cycle of songs. I want the early ones to be about youth and the last song to be about old age, and I want the feel of each song to fit.  Bookends, originally released primarily as a ": null
    },
    {
        "vinyl LP": "vinyl lp"
    },
    {
        ", opens and closes side one of the disc with the ": null
    },
    {
        "Bookends Theme": "bookends theme"
    },
    {
        " , a brief acoustic piece  that evokes a time of innocence . ": null
    },
    {
        "Save the Life of My Child": "save the life of my child"
    },
    {
        " is a dramatic story involving drugs, violence and a mother-and-child relationship. According to James Bennighof, the song deals with individual crises in crowded urban settings, along with references to larger societal forces and at least a hint of some transcendent perspective . The song ": null
    },
    {
        "crossfades": "fade"
    },
    {
        " into ": null
    },
    {
        "America": "america"
    },
    {
        " , which follows two young lovers— an apparently impromptu romantic traveling alliance —as they board a ": null
    },
    {
        "Greyhound bus": "greyhound lines"
    },
    {
        " to look for America . It is a ": null
    },
    {
        "protest song": "protest song"
    },
    {
        " that creates a cinematic vista that tells of the singers search for a literal and physical America that seems to have disappeared, along with the countrys beauty and ideals . ": null
    },
    {
        "Overs": "overs"
    },
    {
        " includes themes regarding the disintegration of love and marriage. ": null
    },
    {
        "Old Friends": "old friends"
    },
    {
        " paints a portrait of two old men reminiscing on the years of their youth. The two men sit on a park bench like bookends , and ponder how strange it feels to be nearing their lifetime. The song is joined with the Bookends Theme , this time with vocal accompaniment from the duo. The piece closes the entire suite with the resigned admonition to Preserve your memories / Theyre all thats left you .     ": null
    },
    {
        "Fakin It": "fakin it"
    },
    {
        " opens side two and finds the protagonist mulling over his insecurities and shortcomings. It has been suggested that Fakin It may be an ": null
    },
    {
        "allegory": "allegory"
    },
    {
        " for Simons relationship with Art Garfunkel. ": null
    },
    {
        "Punkys Dilemma": "punkys dilemma"
    },
    {
        " employs breakfast-food images to lampoon ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        " and the film industry. It improbably takes an abrupt left turn in its third verse, when the singer begins to fantasize himself an admired soldier. ": null
    },
    {
        "Mrs. Robinson": "mrs. robinson"
    },
    {
        " collects wide-ranging images to address social milieu, with a constant reassurance that ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " loves the eponymous character, God will bless her, and heaven will welcome her. The song includes a famous reference to athlete ": null
    },
    {
        "Joe DiMaggio": "joe dimaggio"
    },
    {
        " of the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        ", one of Simons favorite baseball teams. It also features an explicit homage to the Beatles, with Simon uttering the meaningless phrase coo-coo-ca-choo that ": null
    },
    {
        "John Lennon": "john lennon"
    },
    {
        " sings in ": null
    },
    {
        "I Am the Walrus": "i am the walrus"
    },
    {
        " . ": null
    },
    {
        "A Hazy Shade of Winter": "a hazy shade of winter"
    },
    {
        " is an older track that dates back to Simons days in England in 42 The song follows a hopeless poet, with manuscripts of unpublished rhyme , unsure of his achievements in life. In sharp contrast, the whimsical, ": null
    },
    {
        "Orwellian": "george orwell"
    },
    {
        " At the Zoo": "at the zoo"
    },
    {
        " both concludes the album and what Simon described as the cycle of life . The song indicates that the personalities of certain zoo animals may represent particular walks of people. The song was originally intended as a possible ": null
    },
    {
        "childrens book": "childrens book"
    },
    {
        ". According to rock journalist Bud Scoppa, the record is a meditation on the passage of life and the psychological impact of lifes irreversible, ever-accumulating losses . The song cycle also describes the life and death of the romantic ideal of the ": null
    },
    {
        "American Dream": "american dream"
    },
    {
        ".          Prior to the release of the album, the band helped put together, and performed at, the ": null
    },
    {
        "Monterey Pop Festival": "monterey pop festival"
    },
    {
        ", which signaled the beginning of the ": null
    },
    {
        "Summer of Love": "summer of love"
    },
    {
        " on the ": null
    },
    {
        "West Coast": "west coast of the united states"
    },
    {
        ".  Fakin It was issued as a single that summer, but the duo was much more focused on the rising ": null
    },
    {
        "FM": "fm radio"
    },
    {
        " format, which played album cuts. On the label of the original 42 RPM single, the 42:42-long Fakin It was shown as having a run time of 42:42 , to try to get past radio programmers who were still strictly applying the under 42 minutes pop single formula. Fakin It had only modest success on ": null
    },
    {
        "AM radio": "am radio"
    },
    {
        ". In January 42 the duo appeared on a ": null
    },
    {
        "Kraft Music Hall": "kraft music hall"
    },
    {
        " special, Three for Tonight, performing ten songs largely culled from their third album. ": null
    },
    {
        "Richard Avedon": "richard avedon"
    },
    {
        ", regarded then as one of the best photographers, was commissioned to shoot the album cover. When viewed closely, one can see Avedons reflection in Simons irises.     Bookends was released by Columbia Records on April 42 42 In a historical context, that was just 42 hours before the ": null
    },
    {
        "assassination": "assassination of martin luther king, jr."
    },
    {
        " of ": null
    },
    {
        "Civil Rights Movement": "civil rights movement"
    },
    {
        " activist ": null
    },
    {
        "Martin Luther King, Jr.": "martin luther king, jr."
    },
    {
        ", which spurred nationwide outrage and riots. Fornatale opines that the album served as ": null
    },
    {
        "comfort food": "comfort food"
    },
    {
        " during rather tumultuous times within the nation. The album debuted on the ": null
    },
    {
        "Billboard Pop Album Chart": "billboard 200"
    },
    {
        " in the issue dated April 42 42 ": null
    },
    {
        "climbing to number one": "list of billboard 200 number-one albums of 1968"
    },
    {
        " and staying at that position for seven non-consecutive weeks, remaining on the chart for a total of 42 weeks. Bookends received such heavy orders weeks in advance of its release that Columbia was able to apply for award certification before copies had left the warehouse, a fact that was touted in magazine ads.  The record became the duos best-selling album to date. It fed off the buzz created by the release of The Graduate soundtrack album ten weeks earlier, creating an initial combined sales figure of over five million units. In the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", Bookends was a number one hit. The album charted highly in both ": null
    },
    {
        "Australia": "australia"
    },
    {
        " and ": null
    },
    {
        "France": "france"
    },
    {
        ", peaking in both countries at number three.     The duo had a complicated relationship with Davis; Simon was particularly outraged when Davis suggested raising the list price of Bookends to $42 , one dollar above the standard retail price.  Davis explained that including a large poster with each copy made it necessary to charge an extra dollar to cover the cost. Simon scoffed and viewed it as charging a premium on what was sure to be that years best-selling Columbia album . According to biographer Marc Eliot, Davis was offended by what he perceived as their lack of gratitude for what he believed was his role in turning them into superstars . Rather than implement Davis price increase plan, Simon & Garfunkel signed a contract extension with Columbia that guaranteed them a higher ": null
    },
    {
        "royalty": "royalties"
    },
    {
        " rate.       Reviews of Bookends upon its release in 42 were largely positive. Allen Evans of the British publication  New Musical Express  gave the record four out of five stars and called it inspiring, descriptive music, while noting the album is Imaginative and at times confusing to know what the composer is getting at, if anything.  Rival newspaper  Melody Maker  did not use a ratings system, but called Bookends a thoughtful, clever and well-produced album. Reviewer Chris Welch criticized the songs as not particularly tuneful, but performed with ": null
    },
    {
        "Beatles": "beatles"
    },
    {
        " fervour and Beatles conviction, praising the lyricism, opining that The words capture part of America today, a lot of its sickness and tragedy.  In the US,  Rolling Stone  reviewer Arthur Schmidt wrote that The music is, for me, questionable, but Ive always found their music questionable. It is nice enough, and I admit to liking it, but it exudes a sense of process, and it is slick, and nothing too much happens.      Later reviews were more positive. In just over 42 minutes, Bookends is stunning in its vision of a bewildered America in search of itself , said ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        " writer Thom Jurek, who gave it five stars out of five.  ": null
    },
    {
        "Pitchfork Media": "pitchfork media"
    },
    {
        "s Stephen M. Deusner called Bookends the moment in which the duo were settling into themselves, losing their folk revival pretensions and emphasizing quirky production techniques to match their soaring vocals .   The A.V. Club  called it the groups most musically and conceptually daring album .        Mrs. Robinson became the first rock and roll song to win ": null
    },
    {
        "Record of the Year": "grammy award for record of the year"
    },
    {
        " at the ": null
    },
    {
        "42th Annual Grammy Awards": "11th annual grammy awards"
    },
    {
        " in 42; it also nabbed the honor of ": null
    },
    {
        "Best Contemporary Pop Performance by a Duo or Group": "grammy award for best pop performance by a duo or group with vocals"
    },
    {
        ".     In 42 it was voted number 42 in ": null
    },
    {
        "Colin Larkin": "colin larkin"
    },
    {
        "s  All Time Top 42 Albums .             The album, alongside The Graduate soundtrack, propelled Simon & Garfunkel to become the biggest rock duo in the world. Simon was approached by numerous film producers who wished him to write music for their films or license a track; he turned down ": null
    },
    {
        "Franco Zeffirelli": "franco zeffirelli"
    },
    {
        ", who was preparing to film  Brother Sun, Sister Moon , and ": null
    },
    {
        "John Schlesinger": "john schlesinger"
    },
    {
        ", who likewise was readying to shoot  Midnight Cowboy . In addition to ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        " proposals, producers from the ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " show  Jimmy Shine   asked for two original songs and Simon declined. He eventually paired with ": null
    },
    {
        "Leonard Bernstein": "leonard bernstein"
    },
    {
        ", with whom he collaborated for a short time on a sacred mass .     Disc jockey and author ": null
    },
    {
        "Pete Fornatale": "pete fornatale"
    },
    {
        " writes that Bookends represents a once-in-a-career convergence of musical, personal, and societal forces that placed Simon & Garfunkel squarely at the center of the cultural zeitgeist of the sixties .  Rolling Stone  credited the record with striking a chord among lonely, adrift young adults near the end of the decade, writing that a lyric in A Hazy Shade of Winter — Time, time, time, see what’s become of me... — defined the moment for a generation on the edge of adulthood . Many viewed Bookends as the bands most accomplished work at the time, a breakthrough in production and songwriting. Bookends was our first serious piece of work, Id say , said Simon in a 42 interview with  Playboy .     In 42 a line from the song America — All gone to look for America —began appearing spray-painted on vacant buildings and abandoned factories in the town of ": null
    },
    {
        "Saginaw": "saginaw, michigan"
    },
    {
        ", ": null
    },
    {
        "Michigan": "michigan"
    },
    {
        ", which is mentioned in the song. A loose group of artists, who eventually became known as Paint Saginaw , began duplicating the phrase after the city population had dwindled vastly, noting that the song now encapsulated a sense of nostalgia for a bygone era among the city residents.      America was also featured in an ": null
    },
    {
        "eponymously-titled": "america"
    },
    {
        " television advertisement for the ": null
    },
    {
        "presidential campaign": "bernie sanders presidential campaign, 2016"
    },
    {
        " of ": null
    },
    {
        "Bernie Sanders": "bernie sanders"
    },
    {
        " during the ": null
    },
    {
        "42 Democratic Party presidential primaries": "democratic party presidential primaries, 2016"
    },
    {
        ".  The campaign sought permission to use it from Paul Simon and Art Garfunkel themselves, who both agreed. Garfunkel stated that he was a supporter of Sanders and his campaign, and that the usage of America did not take away from the songs original premise.      Bookends was the last Simon & Garfunkel album to be mixed in separate mono and stereo mixes, as manufacturing of mono LPs alongside concurrent stereo issues was in the final stages of being discontinued in 42 The mono mix was released as a promo issue to radio stations and given a very limited run for commercial sale. It was out-of-print very soon after release, and as of January 42 has yet to see a digital re-release.                  Credits for Bookends adapted from ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        ".  Track numbers refer to CD and digital releases.   ": null
    },
    {
        "Paul Simon": "paul simon"
    },
    {
        " – ": null
    },
    {
        "vocals": "lead vocalist"
    },
    {
        ", ": null
    },
    {
        "guitar": "guitar"
    },
    {
        " Art Garfunkel": "art garfunkel"
    },
    {
        " – vocals, tapes, percussion   Additional musicians ": null
    },
    {
        "Hal Blaine": "hal blaine"
    },
    {
        " – ": null
    },
    {
        "drums": "drums"
    },
    {
        ", ": null
    },
    {
        "percussion": "percussion"
    },
    {
        " Joe Osborn": "joe osborn"
    },
    {
        " – ": null
    },
    {
        "bass guitar": "bass guitar"
    },
    {
        " Larry Knechtel": "larry knechtel"
    },
    {
        " – ": null
    },
    {
        "piano": "piano"
    },
    {
        ", ": null
    },
    {
        "keyboards": "keyboard instrument"
    },
    {
        ", bass guitar on Mrs Robinson    ": null
    },
    {
        "John Simon": "john simon"
    },
    {
        " – ": null
    },
    {
        "synthesizer": "synthesizer"
    },
    {
        " on Save The Life Of My Child     Production ": null
    },
    {
        "Roy Halee": "roy halee"
    },
    {
        " – producer , ": null
    },
    {
        "recording engineer": "audio engineering"
    },
    {
        " John Simon": "john simon"
    },
    {
        " – production assistant on Save The Life Of My Child , Overs , Fakin It & Punkys Dilemma   ": null
    },
    {
        "Bob Johnston": "bob johnston"
    },
    {
        " – production assistant on A Hazy Shade of Winter & At the Zoo , production   ": null
    },
    {
        "Jimmie Haskell": "jimmie haskell"
    },
    {
        " – arranger, arrangement preparation   ": null
    },
    {
        "Richard Avedon": "richard avedon"
    },
    {
        " – cover photography                                           ": null
    }
]