[
    {
        "              The Book of Genesis, the first book of the ": null
    },
    {
        "Hebrew Bible": "tanakh"
    },
    {
        " and the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ", is ": null
    },
    {
        "Judaisms": "judaism"
    },
    {
        " account of the ": null
    },
    {
        "creation of the world": "genesis creation narrative"
    },
    {
        " and the origins of the ": null
    },
    {
        "Jewish people": "jewsorigins"
    },
    {
        ".     It is divisible into two parts, the ": null
    },
    {
        "primeval history": "primeval history"
    },
    {
        " and the ": null
    },
    {
        "ancestral history": "patriarchal age"
    },
    {
        " . The primeval history sets out the authors concepts of the nature of the deity and of humankinds relationship with its maker: God creates a world which is good and fit for mankind, but when man corrupts it with sin God decides to destroy his creation, saving only the righteous ": null
    },
    {
        "Noah": "noah"
    },
    {
        " to reestablish the relationship between man and God. The ancestral history tells of the prehistory of Israel, Gods chosen people. At Gods command Noahs descendant ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " journeys from his home into the God-given land of ": null
    },
    {
        "Canaan": "canaan"
    },
    {
        ", where he dwells as a sojourner, as does his son ": null
    },
    {
        "Isaac": "isaac"
    },
    {
        " and his grandson ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        ". Jacobs name is changed to Israel, and through the agency of his son ": null
    },
    {
        "Joseph": "joseph"
    },
    {
        ", the ": null
    },
    {
        "children of Israel": "children of israel"
    },
    {
        " descend into Egypt, 70 people in all with their households, and God promises them a future of greatness. Genesis ends with Israel in Egypt, ready for the coming of ": null
    },
    {
        "Moses": "moses"
    },
    {
        " and ": null
    },
    {
        "the Exodus": "the exodus"
    },
    {
        ". The narrative is punctuated by a series of ": null
    },
    {
        "covenants with God": "covenant"
    },
    {
        ", successively narrowing in scope from all mankind  to a special relationship with one people alone .     In ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        ", the theological importance of Genesis centers on the covenants linking ": null
    },
    {
        "God": "god in judaism"
    },
    {
        " to his ": null
    },
    {
        "chosen people": "jews as the chosen people"
    },
    {
        " and the people to the ": null
    },
    {
        "Promised Land": "promised land"
    },
    {
        ". Christianity has interpreted Genesis as the prefiguration of certain cardinal Christian beliefs, primarily the need for ": null
    },
    {
        "salvation": "salvation in christianity"
    },
    {
        "  and the ": null
    },
    {
        "redemptive act": "redeemer"
    },
    {
        " of ": null
    },
    {
        "Christ": "christ"
    },
    {
        " on the Cross as the ": null
    },
    {
        "fulfillment of covenant promises": "supersessionism"
    },
    {
        " as the ": null
    },
    {
        "Son of God": "son of god"
    },
    {
        ".     Tradition credits Moses as the ": null
    },
    {
        "author of Genesis": "mosaic authorship"
    },
    {
        ", as well as the books of ": null
    },
    {
        "Exodus": "book of exodus"
    },
    {
        ", ": null
    },
    {
        "Leviticus": "book of leviticus"
    },
    {
        ", ": null
    },
    {
        "Numbers": "book of numbers"
    },
    {
        " and most of ": null
    },
    {
        "Deuteronomy": "book of deuteronomy"
    },
    {
        ", but modern scholars increasingly see them as a product of the 6th and 5th centuries BC. Van Seters , p. 5 Davies , p. 37       Genesis appears to be structured around the recurring phrase elleh toledot, meaning these are the generations, with the first use of the phrase referring to the generations of heaven and earth and the remainder marking individuals—Noah, the sons of Noah , Shem, etc., down to Jacob. Hamilton , p. 2 It is not clear, however, what this meant to the original authors, and most modern commentators divide it into two parts based on subject matter, a primeval history and a patriarchal history . Whybray , p. 41  While the first is far shorter than the second, it sets out the basic themes and provides an interpretive key for understanding the entire book. McKeown , p. 2 The primeval history has a symmetrical structure hinging on chapters 6–9, the flood story, with the events before the flood mirrored by the events after; Walsh , p. 112 the ancestral history is structured around the three patriarchs ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        ", ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        " and ": null
    },
    {
        "Joseph": "joseph"
    },
    {
        ".              ": null
    },
    {
        "God": "god in abrahamic religions"
    },
    {
        " creates the world": "genesis creation narrative"
    },
    {
        " in six days and consecrates the seventh as a ": null
    },
    {
        "day of rest": "biblical sabbath"
    },
    {
        ". God creates the first ": null
    },
    {
        "humans": "humans"
    },
    {
        " Adam and Eve": "adam and eve"
    },
    {
        " and all the animals in the ": null
    },
    {
        "Garden of Eden": "garden of eden"
    },
    {
        " but instructs them not to eat the fruit of the ": null
    },
    {
        "tree of knowledge of good and evil": "tree of the knowledge of good and evil"
    },
    {
        ". A talking ": null
    },
    {
        "serpent": "serpent"
    },
    {
        " portrayed as a deceptive creature or ": null
    },
    {
        "trickster": "trickster"
    },
    {
        ", entices Eve into eating it against Gods wishes, and she entices Adam, whereupon God throws them out and curses them—Adam to getting what he needs only by sweat and work, and Eve to giving birth in pain. This is interpreted by Christians as ": null
    },
    {
        "the fall": "fall of man"
    },
    {
        " of humanity. Eve bears two sons, ": null
    },
    {
        "Cain and Abel": "cain and abel"
    },
    {
        ". Cain kills Abel after God accepts Abels offering but not Cains. God then ": null
    },
    {
        "curses Cain": "curse and mark of cain"
    },
    {
        ". Eve bears another son, ": null
    },
    {
        "Seth": "seth"
    },
    {
        ", to take Abels place.     After many ": null
    },
    {
        "generations of Adam": "generations of adam"
    },
    {
        " have passed from the lines of Cain and Seth, the world becomes corrupted by human ": null
    },
    {
        "sin": "sin"
    },
    {
        " and ": null
    },
    {
        "Nephilim": "nephilim"
    },
    {
        ", and God determines to wipe out humanity. First, he instructs the righteous ": null
    },
    {
        "Noah": "noah"
    },
    {
        " and his family to build an ": null
    },
    {
        "ark": "noahs ark"
    },
    {
        " and put examples of all the animals on it, seven pairs of every clean animal and one pair of every unclean. Then God sends a ": null
    },
    {
        "great flood": "genesis flood narrative"
    },
    {
        " to wipe out the rest of the world. When the waters recede, God promises he will never destroy the world with water again, using the ": null
    },
    {
        "rainbow as a symbol of his promise": "rainbows in mythology"
    },
    {
        ". God sees mankind cooperating to build a great tower city, the ": null
    },
    {
        "Tower of Babel": "tower of babel"
    },
    {
        ", and divides humanity with many languages and sets them apart with confusion.     God instructs Abram to travel from his home in ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " to the land of ": null
    },
    {
        "Canaan": "canaan"
    },
    {
        ". There, God makes a covenant with Abram, promising that his descendants shall be as numerous as the stars, but that people will suffer oppression in a foreign land for four hundred years, after which they will inherit the land from the ": null
    },
    {
        "river of Egypt": "brook of egypt"
    },
    {
        " to the great river, the river ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " . Abrams name is changed to Abraham and that of his wife Sarai to ": null
    },
    {
        "Sarah": "sarah"
    },
    {
        ", and ": null
    },
    {
        "circumcision": "circumcision"
    },
    {
        " of all males is instituted as the sign of the covenant. Due to her old age, Sarah tells Abraham to take her Egyptian handmaiden, ": null
    },
    {
        "Hagar": "hagar"
    },
    {
        ", as a second wife. Through Hagar, Abraham fathers ": null
    },
    {
        "Ishmael": "ishmael"
    },
    {
        ".     God resolves to destroy the cities of ": null
    },
    {
        "Sodom and Gomorrah": "sodom and gomorrah"
    },
    {
        " for the sins of their people. Abraham protests and gets God to agree not to destroy the cities for the sake of ten righteous men. Angels save Abrahams nephew ": null
    },
    {
        "Lot": "lot"
    },
    {
        " and his family, but ": null
    },
    {
        "his wife": "lots wife"
    },
    {
        " looks back on the destruction against their command and turns into a pillar of salt. Lots daughters, concerned that they are fugitives who will never find husbands, get him drunk to become pregnant by him, and give birth to the ancestors of the ": null
    },
    {
        "Moab": "moab"
    },
    {
        "ites and ": null
    },
    {
        "Ammon": "ammon"
    },
    {
        "ites.     Abraham and Sarah go to the Philistine town of ": null
    },
    {
        "Gerar": "gerar"
    },
    {
        ", pretending to be brother and sister . The King of Gerar takes Sarah for his wife, but God warns him to return her, and he obeys. God sends Sarah a son whom she will name ": null
    },
    {
        "Isaac": "isaac"
    },
    {
        "; through him will be the establishment of the covenant. Sarah drives Ishmael and his mother Hagar out into the wilderness, but God saves them and promises to make Ishmael a great nation.        God tests Abraham by demanding that he ": null
    },
    {
        "sacrifice Isaac": "binding of isaac"
    },
    {
        ". As Abraham is about to lay the knife upon his son, God restrains him, promising him numberless descendants. On the death of Sarah, Abraham purchases ": null
    },
    {
        "Machpelah": "cave of the patriarchs"
    },
    {
        "  for a family tomb and sends his servant to Mesopotamia to find among his relations a wife for Isaac; after proving herself, Rebekah becomes Isaacs betrothed. ": null
    },
    {
        "Keturah": "keturah"
    },
    {
        ", Abrahams other wife, births more children, among whose descendants are the ": null
    },
    {
        "Midian": "midian"
    },
    {
        "ites. Abraham dies at a prosperous old age and his family lays him to rest in Hebron.     Isaacs wife ": null
    },
    {
        "Rebecca": "rebecca"
    },
    {
        " gives birth to the twins ": null
    },
    {
        "Esau": "esau"
    },
    {
        ", father of the ": null
    },
    {
        "Edom": "edom"
    },
    {
        "ites, and ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        ". Through deception, Jacob becomes the heir instead of Esau and gains his fathers blessing. He flees to ": null
    },
    {
        "his uncle": "laban"
    },
    {
        " where he prospers and earns his two wives, ": null
    },
    {
        "Rachel": "rachel"
    },
    {
        " and ": null
    },
    {
        "Leah": "leah"
    },
    {
        ". Jacobs name is changed to Israel, and by his wives and their handmaidens he has twelve sons, the ancestors of the twelve tribes of the Children of Israel, and a daughter, ": null
    },
    {
        "Dinah": "dinah"
    },
    {
        ".     ": null
    },
    {
        "Joseph": "joseph"
    },
    {
        ", Jacobs favorite son, makes his brothers jealous and they sell him into slavery in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ". Joseph prospers, after hardship, with Gods guidance of ": null
    },
    {
        "interpreting Pharaohs dream": "dream interpretation"
    },
    {
        " of upcoming famine. He is then reunited with his father and brothers, who fail to recognize him, and plead for food. After much manipulation, he reveals himself and lets them and their households into Egypt, where ": null
    },
    {
        "Pharaoh": "pharaoh"
    },
    {
        " assigns to them the ": null
    },
    {
        "land of Goshen": "land of goshen"
    },
    {
        ". Jacob calls his sons to his bedside and ": null
    },
    {
        "reveals their future": "blessing of jacob"
    },
    {
        " before he dies. Joseph lives to an old age and exhorts his brethren, if God should lead them out of the country, to take his bones with them.              Genesis takes its Hebrew title from the first word of the first sentence, Bereshit, meaning In beginning ; in the Greek ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        " it was called Genesis, from the phrase the generations of heaven and earth . There are four major textual witnesses to the book: the ": null
    },
    {
        "Masoretic Text": "masoretic text"
    },
    {
        ", the ": null
    },
    {
        "Samaritan Pentateuch": "samaritan pentateuch"
    },
    {
        ", the ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        ", and fragments of Genesis found at ": null
    },
    {
        "Qumran": "qumran"
    },
    {
        ". The Qumran group provides the oldest manuscripts but covers only a small proportion of the book; in general, the Masoretic Text is well preserved and reliable, but there are many individual instances where the other versions preserve a superior reading. Hendel, R. S. . Genesis, Book of . In D. N. Freedman , The Anchor Yale Bible Dictionary . New York: Doubleday          For much of the 20th century most scholars agreed that the five books of the ": null
    },
    {
        "Pentateuch": "pentateuch"
    },
    {
        "—Genesis, ": null
    },
    {
        "Exodus": "book of exodus"
    },
    {
        ", ": null
    },
    {
        "Leviticus": "book of leviticus"
    },
    {
        ", ": null
    },
    {
        "Numbers": "book of numbers"
    },
    {
        " and ": null
    },
    {
        "Deuteronomy": "deuteronomy"
    },
    {
        "—came from four sources, the ": null
    },
    {
        "Yahwist": "yahwist"
    },
    {
        ", the ": null
    },
    {
        "Elohist": "elohist"
    },
    {
        ", the ": null
    },
    {
        "Deuteronomist": "deuteronomist"
    },
    {
        " and the ": null
    },
    {
        "Priestly source": "priestly source"
    },
    {
        ", each telling the same basic story, and joined together by various editors. Gooder , pp. 12–14 Since the 1970s there has been a revolution leading scholars to view the Elohist source as no more than a variation on the Yahwist, and the Priestly source as a body of revisions and expansions to the Yahwist material. Van Seters , pp. 30–86     Scholars use examples of repeated and duplicate stories to identify the separate sources. In Genesis these include three different accounts of a Patriarch claiming that his wife was his sister, the two creation stories, and the two versions of Abraham sending Hagar and Ishmael into the desert.      This leaves the question of when these works were created. Scholars in the first half of the 20th century came to the conclusion that the Yahwist is a product of the monarchic period, specifically at the court of ": null
    },
    {
        "Solomon": "solomon"
    },
    {
        ", 10th century BC, and the Priestly work in the middle of the 5th century BC , but more recent thinking is that the Yahwist is from either just before or during the ": null
    },
    {
        "Babylonian exile": "babylonian exile"
    },
    {
        " of the 6th century BC, and the Priestly final edition was made late in the Exilic period or soon after.     As for why the book was created, a theory which has gained considerable interest, although still controversial is Persian imperial authorisation . This proposes that the Persians of the ": null
    },
    {
        "Achaemenid Empire": "achaemenid empire"
    },
    {
        ", after their conquest of Babylon in 539  BC, agreed to grant Jerusalem a large measure of local autonomy within the empire, but required the local authorities to produce a single law code accepted by the entire community. The two powerful groups making up the community—the priestly families who controlled the Temple and who ": null
    },
    {
        "traced their origin": "myth of origins"
    },
    {
        " to Moses and the wilderness wanderings, and the major landowning families who made up the elders and who traced their own origins to Abraham, who had given them the land—were in conflict over many issues, and each had its own history of origins , but the Persian promise of greatly increased local autonomy for all provided a powerful incentive to cooperate in producing a single text. Ska , pp. 169, 217–18       Genesis is perhaps best seen as an example of a ": null
    },
    {
        "creation myth": "creation myth"
    },
    {
        ", a type of literature telling of the first appearance of humans, the stories of ancestors and heroes, and the origins of culture, cities and so forth. Van Seters pp. 113–14 The most notable examples are found in the work of Greek historians of the 6th century BC: their intention was to connect notable families of their own day to a distant and heroic past, and in doing so they did not distinguish between ": null
    },
    {
        "myth": "myth"
    },
    {
        ", ": null
    },
    {
        "legend": "legend"
    },
    {
        ", and facts. Whybray , p. 39 Professor Jean-Louis Ska of the ": null
    },
    {
        "Pontifical Biblical Institute": "pontifical biblical institute"
    },
    {
        " calls the basic rule of the antiquarian historian the law of conservation : everything old is valuable, nothing is eliminated. Ska , p. 169 Ska also points out the purpose behind such antiquarian histories: antiquity is needed to prove the worth of Israels traditions to the nations , and to reconcile and unite the various factions within Israel itself.              In 1978 ": null
    },
    {
        "David Clines": "david clines"
    },
    {
        " published his influential The Theme of the Pentateuch – influential because he was one of the first to take up the question of the theme of the entire five books. Clines conclusion was that the overall theme is the partial fulfillment – which implies also the partial nonfulfillment – of the promise to or blessing of the Patriarchs . . Clines , p. 30     The ": null
    },
    {
        "patriarchs": "patriarchs"
    },
    {
        ", or ancestors, are Abraham, Isaac and Jacob, with their wives . Hamilton , p. 50 Since the name YHWH had not been revealed to them, they worshipped El in his various manifestations.  Through the patriarchs God announces the election of Israel, meaning that he has chosen Israel to be his special people and committed himself to their future. Brueggemann , p. 61 God tells the patriarchs that he will be faithful to their descendants , and Israel is expected to have faith in God and his promise. . Brueggemann , p. 78     The promise itself has three parts: offspring, blessings, and land. McKeown , p. 4 The fulfilment of the promise to each patriarch depends on having a male heir, and the story is constantly complicated by the fact that each prospective mother – ": null
    },
    {
        "Sarah": "sarah"
    },
    {
        ", ": null
    },
    {
        "Rebekah": "rebekah"
    },
    {
        " and ": null
    },
    {
        "Rachel": "rachel"
    },
    {
        " – is barren. The ancestors, however, retain their faith in God and God in each case gives a son – in Jacobs case, twelve sons, the foundation of the chosen ": null
    },
    {
        "Israelites": "israelites"
    },
    {
        ". Each succeeding generation of the three promises attains a more rich fulfillment, until through Joseph all the world attains salvation from famine, Wenham , p. 34 and by bringing the children of Israel down to Egypt he becomes the means through which the promise can be fulfilled.       Scholars generally agree that the theme of divine promise unites the patriarchal cycles, but many would dispute the efficacy of trying to examine Genesis theology by pursuing a single overarching theme, instead citing as more productive the analysis of the Abraham cycle, the Jacob cycle, and the Joseph cycle, and the ": null
    },
    {
        "Yahwist": "yahwist"
    },
    {
        " and ": null
    },
    {
        "Priestly source": "priestly source"
    },
    {
        "s. Hamilton , pp. 38–39 The problem lies in finding a way to unite the patriarchal theme of divine promise to the stories of Genesis 1–11  with their theme of Gods forgiveness in the face of mans evil nature. Hendel, R. S. . Genesis, Book of . In D. N. Freedman , The Anchor Yale Bible Dictionary . New York: Doubleday Kugler, Hartin , p.9 One solution is to see the patriarchal stories as resulting from Gods decision not to remain alienated from mankind: God creates the world and mankind, mankind rebels, and God elects Abraham. Bandstra , pp. 28–29     To this basic plot  the ": null
    },
    {
        "Priestly source": "priestly source"
    },
    {
        " has added a series of ": null
    },
    {
        "covenants": "covenant"
    },
    {
        " dividing history into stages, each with its own distinctive sign . The ": null
    },
    {
        "first covenant": "covenant noahic covenant"
    },
    {
        " is between God and all living creatures, and is marked by the sign of the rainbow; the second is with the descendants of Abraham , and its sign is ": null
    },
    {
        "circumcision": "brit milah"
    },
    {
        "; and the last, which does not appear until the ": null
    },
    {
        "book of Exodus": "book of exodus"
    },
    {
        ", is with Israel alone, and its sign is ": null
    },
    {
        "Sabbath": "biblical sabbath"
    },
    {
        ". A great leader mediates each covenant , and at each stage God progressively reveals himself by his name .             : Bereshit , on Genesis 1–6: Creation, Eden, Adam and Eve, Cain and Abel, Lamech, wickedness   : Noach , on Genesis 6–11: Noahs Ark, the Flood, Noahs drunkenness, the Tower of Babel   : Lech-Lecha , on Genesis 12–17: Abraham, Sarah, Lot, covenant, Hagar and Ishmael, circumcision   : Vayeira , on Genesis 18–22: Abrahams visitors, Sodomites, Lots visitors and flight, Hagar expelled, binding of Isaac   : Chayei Sarah , on Genesis 23–25: Sarah buried, Rebekah for Isaac   : Toledot , on Genesis 25–28: Esau and Jacob, Esaus birthright, Isaacs blessing   : Vayetze , on Genesis 28–32: Jacob flees, Rachel, Leah, Laban, Jacobs children and departure   : Vayishlach , on Genesis 32–36: Jacobs reunion with Esau, the rape of Dinah   : Vayeshev , on Genesis 37–40: Josephs dreams, coat, and slavery, Judah with Tamar, Joseph and Potiphar   : Miketz , on Genesis 41–44: Pharaohs dream, Joseph in government, Josephs brothers visit Egypt   :": null
    },
    {
        "Vayigash": "vayigash"
    },
    {
        ", on Genesis 44–47: Joseph reveals himself, Jacob moves to Egypt   :": null
    }
]