[
    {
        "          The Book of Lamentations  is a collection of poetic ": null
    },
    {
        "laments": "laments"
    },
    {
        " for the ": null
    },
    {
        "destruction of Jerusalem": "siege of jerusalem"
    },
    {
        ". In the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        " it appears in the ": null
    },
    {
        "Ketuvim": "ketuvim"
    },
    {
        " , beside the ": null
    },
    {
        "Song of Songs": "song of songs"
    },
    {
        ", ": null
    },
    {
        "Book of Ruth": "book of ruth"
    },
    {
        ", ": null
    },
    {
        "Ecclesiastes": "ecclesiastes"
    },
    {
        " and the ": null
    },
    {
        "Book of Esther": "book of esther"
    },
    {
        " , although there is no set order; in the Christian ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " it follows the ": null
    },
    {
        "Book of Jeremiah": "book of jeremiah"
    },
    {
        ", as the prophet ": null
    },
    {
        "Jeremiah": "jeremiah"
    },
    {
        " is its traditional author. Jeremiahs authorship is no longer generally accepted, although it is generally accepted that the destruction of Jerusalem by Babylon in 586  BC forms the background to the poems. The book is partly a traditional city lament mourning the desertion of the city by God, its destruction, and the ultimate return of the divinity, and partly a funeral dirge in which the bereaved bewails and addresses the dead. The tone is bleak: God does not speak, the degree of suffering is presented as undeserved, and expectations of future redemption are minimal.     The book is traditionally recited on the fast day of ": null
    },
    {
        "Tisha BAv": "tisha bav"
    },
    {
        " , mourning the destruction of both the ": null
    },
    {
        "First Temple": "first temple"
    },
    {
        " and the ": null
    },
    {
        "Second": "second temple"
    },
    {
        ".            Lamentations consists of five distinct poems, corresponding to its five chapters. The first four are written as ": null
    },
    {
        "acrostics": "acrostic"
    },
    {
        "– chapters 1, 2, and 4 each have 22 verses, corresponding to the 22 letters of the Hebrew alphabet, the first lines beginning with the first letter of the alphabet, the second with the second letter, and so on. Chapter 3 has 66 verses, so that each letter begins three lines, and the fifth poem is not acrostic but still has 22 lines. The purpose or function of this form is unknown.     Unlike standard alphabetical order, in the middle chapters of Lamentations, the letter Pe comes before Ayin . The first chapter uses standard alphabetical order.       The book consists of five separate poems. In the first , the city sits as a desolate weeping widow overcome with miseries. In Chapter 2 these miseries are described in connection with national sins and acts of God. Chapter 3 speaks of hope for the people of God: the chastisement would only be for their good; a better day would dawn for them. Chapter 4 laments the ruin and desolation of the city and temple, but traces it to the peoples sins. Chapter 5 is a prayer that Zions reproach may be taken away in the repentance and recovery of the people.          Lamentations has traditionally been ascribed to ": null
    },
    {
        "Jeremiah": "book of jeremiah"
    },
    {
        ", probably on the grounds of the reference in 2 Chronicles 35:25 to the prophet composing a lament on the death of King ": null
    },
    {
        "Josiah": "josiah"
    },
    {
        ", but there is no reference to Josiah in the book and no reason to connect it to Jeremiah.   The language fits an ": null
    },
    {
        "Exilic": "babylonian exile"
    },
    {
        " date , and the poems probably originated from Judeans who remained in the land. Scholars are divided over whether they are the work of one or multiple authors. One clue pointing to multiple authors is that the gender and situation of the first-person witness changes – the narration is feminine in the first and second lamentation, and masculine in the third, while the fourth and fifth are eyewitness reports of Jerusalems destruction; conversely, the similarities of style, vocabulary, and theological outlook, as well as the uniform historical setting, are arguments for one author. F. B. Huey, Jeremiah, Lamentations, vol. 16, The New American Commentary , 443.       Lamentations combines elements of the  qinah , a funeral dirge for the loss of the city, and the communal lament pleading for the restoration of its people. It reflects the view, traceable to ": null
    },
    {
        "Sumer": "sumer"
    },
    {
        "ian literature of a thousand years earlier, that the destruction of the holy city was a punishment by God for the communal sin of its people.     Beginning with the reality of disaster, Lamentations concludes with the bitter possibility that God may have finally rejected Israel . Sufferers in the face of grief are not urged to a confidence in the goodness of God; in fact God is accountable for the disaster. The poet acknowledges that this suffering is a just punishment, still God is held to have had choice over whether to act in this way and at this time. Hope arises from a recollection of Gods past goodness, but although this justifies a cry to God to act in deliverance, there is no guarantee that he will. Repentance will not persuade God to be gracious, since he is free to give or withhold grace as he chooses. In the end, the possibility is that God has finally rejected his people and may not again deliver them: if God is predictable, then God is just a tool of humans. Nevertheless, it also affirms confidence that the mercies of Yahweh never end, but are new every morning .       The Book of Lamentations is recited annually by Jews on Tisha bAv , the anniversary of the destruction of both of the Jewish Temples.     In ": null
    },
    {
        "Western Christianity": "western christianity"
    },
    {
        ", readings and choral settings of extracts from the book are used in the ": null
    },
    {
        "Lent": "lent"
    },
    {
        "en religious service known as ": null
    },
    {
        "Tenebrae": "tenebrae"
    },
    {
        " . In the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ", readings are used at ": null
    },
    {
        "Morning": "morning prayer"
    },
    {
        " and ": null
    },
    {
        "Evening Prayer": "evening prayer"
    },
    {
        " on the ": null
    },
    {
        "Monday": "holy monday"
    },
    {
        " and ": null
    },
    {
        "Tuesday": "holy tuesday"
    },
    {
        " of ": null
    },
    {
        "Holy Week": "holy week"
    },
    {
        ", and at Evening Prayer on ": null
    },
    {
        "Good Friday": "good friday"
    },
    {
        ".     In the ": null
    },
    {
        "Coptic Orthodox Church": "coptic orthodox church"
    },
    {
        ", the books third chapter is chanted on the twelfth hour of the Good Friday service, that commemorates the burial of Jesus.": null
    }
]