[
    {
        "           The Book of Daniel is a 2nd-century BC biblical ": null
    },
    {
        "apocalypse": "Apocalypse"
    },
    {
        " combining a prophecy of history with an ": null
    },
    {
        "eschatology": "Eschatology"
    },
    {
        " which is both cosmic in scope and political in its focus. In more mundane language, it is an account of the activities and visions of ": null
    },
    {
        "Daniel": "Daniel"
    },
    {
        ", a noble ": null
    },
    {
        "Jew": "Jews"
    },
    {
        " exiled at Babylon": "Babylonian Captivity"
    },
    {
        ",  its message being that just as the ": null
    },
    {
        "God of Israel": "Yahweh"
    },
    {
        " saved Daniel and his friends from their enemies, so he would save all of ": null
    },
    {
        "Israel": "History Of Ancient Israel And Judah"
    },
    {
        " in their present oppression.     In the ": null
    },
    {
        "Hebrew Bible": "Hebrew Bible"
    },
    {
        " it is found in the  Ketuvim  , while in ": null
    },
    {
        "Christian Bibles": "Christian Biblical Canons"
    },
    {
        " it is grouped with the ": null
    },
    {
        "Major Prophet": "Major Prophet"
    },
    {
        "s. The book divides into two parts, a set of six court tales in chapters 1–6 followed by four apocalyptic visions in chapters 7–12. The ": null
    },
    {
        "deuterocanon": "Deuterocanonical Books"
    },
    {
        " contains three additional stories: the ": null
    },
    {
        "Song of the Three Holy Children": "The Prayer Of Azariah And Song Of The Three Holy Children"
    },
    {
        ", ": null
    },
    {
        "Susanna": "Susanna"
    },
    {
        ", and ": null
    },
    {
        "Bel and the Dragon": "Bel And The Dragon"
    },
    {
        ".     The books influence has resonated through later ages, from the ": null
    },
    {
        "Dead Sea Scrolls": "Dead Sea Scrolls"
    },
    {
        " community and the authors of the ": null
    },
    {
        "gospels": "Gospel"
    },
    {
        "and ": null
    },
    {
        "Revelation": "Book Of Revelation"
    },
    {
        ", to various movements from the 2nd century to the ": null
    },
    {
        "Protestant Reformation": "Protestant Reformation"
    },
    {
        " and modern ": null
    },
    {
        "millennial": "Millennialism"
    },
    {
        "ist movements—on which it continues to have a profound influence.              The Book of Daniel is divided between the court tales of chapters 1–6 and the apocalyptic visions of 7–12, and between the ": null
    },
    {
        "Hebrew": "Biblical Hebrew"
    },
    {
        " of chapters 1 and 8–12 and the ": null
    },
    {
        "Aramaic": "Biblical Aramaic"
    },
    {
        " of chapters 2–7. The division is reinforced by the ": null
    },
    {
        "chiastic": "Chiastic Structure"
    },
    {
        " arrangement of the Aramaic chapters , and by a chronological progression in chapters 1–6 from ": null
    },
    {
        "Babylonian": "Neo-Babylonian Empire"
    },
    {
        " to ": null
    },
    {
        "Median": "Medes"
    },
    {
        " rule, and from Babylonian to ": null
    },
    {
        "Persian": "Achaemenid Empire"
    },
    {
        " rule in chapters 7–12. Various suggestions have been made by scholars to explain the fact that the genre division does not coincide with the other two, but it appears that the language division and concentric structure of chapters 2–6 are artificial literary devices designed to bind the two halves of the book together. The following outline is provided by Collins in his commentary on Daniel:     PART I: Tales   1: Introduction   2: Nebuchadnezzars dream of four kingdoms   3: The fiery furnace   4: Nebuchadnezzars madness   5: Belshazzars feast   6: Daniel in the lions den   PART II: Visions   7: The beasts from the sea   8: The ram and the he-goat   9: Interpretation of Jeremiahs prophecy of the seventy weeks   10: The angels revelation: kings of the north and south       There is a clear ": null
    },
    {
        "chiasm": "Chiasmus"
    },
    {
        " in the chapter arrangement of the Aramaic section. The following is taken from Paul Redditts Introduction to the Prophets :           In the third year of King ": null
    },
    {
        "Jehoiakim": "Jehoiakim"
    },
    {
        ", God allows Jerusalem to fall into the power of ": null
    },
    {
        "Nebuchadnezzar II": "Nebuchadnezzar Ii"
    },
    {
        ", king of Babylon. Jehoiakim: King of Judah 608–598 BC; his third year would be either 606 or 605, depending how years are counted. Young Israelites of noble and royal family, without physical defect, and handsome, versed in wisdom and competent to serve in the palace of the king, are taken to Babylon to be taught the literature and language of that nation. Among them are Daniel and his three companions, who refuse to touch the royal food and wine. Their overseer fears for his life in case the health of his charges deteriorates, but Daniel suggests a trial and the four emerge healthier than their counterparts from ten days of nothing but vegetables and water. They are allowed to continue to refrain from eating the kings food, and to Daniel God gives insight into visions and dreams. When their training is done Nebuchadnezzar finds them ten times better than all the wise men in his service and therefore keeps them at his court, where Daniel continues until the first year of King ": null
    },
    {
        "Cyrus": "Cyrus The Great"
    },
    {
        ". Cyrus: Persian conqueror of Babylon, 539 BC.          In the second year of his reign Nebuchadnezzar has a dream. When he wakes up, he realizes that the dream has some important message, so he consults his wise men. Wary of their potential to fabricate an explanation, the king refuses to tell the wise men what he saw in his dream. Rather, he demands that his wise men tell him what the content of the dream was, and then interpret it. When the wise men protest that this is beyond the power of any man, he sentences all, including Daniel and his friends, to death. Daniel receives an explanatory vision from God: Nebuchadnezzar had seen an enormous statue with a head of gold, breast and arms of silver, belly and thighs of bronze, legs of iron, and feet of mixed iron and clay, then saw the statue destroyed by a rock that turned into a mountain filling the whole earth. Daniel explains the dream to the king: the statue symbolized four successive kingdoms, starting with Nebuchadnezzar, all of which would be crushed by Gods kingdom, which would endure forever. Nebuchadnezzar acknowledges the supremacy of Daniels god, raises Daniel over all his wise men, and places Daniel and his companions over the province of Babylon.          Daniels companions Shadrach, Meshach, and Abednego refuse to bow to King Nebuchadnezzars golden statue and are thrown into a fiery furnace. Nebuchadnezzar is astonished to see a fourth figure in the furnace with the three, one with the appearance like a son of the gods. So the king called the three to come out of the fire, and blessed the God of Israel, and decreed that any who blasphemed against him should be torn limb from limb.             Nebuchadnezzar recounts a dream of a huge tree that is suddenly cut down at the command of a heavenly messenger. Daniel is summoned and interprets the dream. The tree is Nebuchadnezzar himself, who for seven years will lose his mind and live like a wild beast. All of this comes to pass until, at the end of the specified time, Nebuchadnezzar acknowledges that heaven rules and his kingdom and sanity are restored.             ": null
    },
    {
        "Belshazzar": "Belshazzar"
    },
    {
        " and his nobles blasphemously drink from sacred Jewish temple vessels, offering praise to inanimate gods, until a hand mysteriously appears and ": null
    },
    {
        "writes upon the wall": "The Writing On The Wall"
    },
    {
        ". The horrified king summons Daniel, who upbraids him for his lack of humility before God and interprets the message: Belshazzars kingdom will be given to the Medes and Persians. Belshazzar rewards Daniel and raises him to be third in the kingdom, and that very night Belshazzar is slain and ": null
    },
    {
        "Darius the Mede": "Darius The Mede"
    },
    {
        " takes the kingdom. Darius the Mede: No such person is known to history . Darius is in any case a Persian, not a Median, name. The Persian army which captured Babylon was under the command of a certain ": null
    },
    {
        "Gobryas": "Gobryas"
    },
    {
        " , a Babylonian and former provincial governor who turned against his royal master, on behalf of Cyrus, the Persian king. The author of Daniel may have introduced the reference to a Mede in order to fulfill Isaiah and Jeremiah, who prophesied that the Medes would overthrow Babylon, and confused the events of 539 with those of 520 BC, when Darius I captured Babylon after an uprising. See Hammer, 1976, pp. 65–66.               Darius elevates Daniel to high office, exciting the jealousy of other officials. Knowing of Daniels devotion to his God, his enemies trick the king into issuing an edict forbidding worship of any other god or man for a 30-day period. Daniel continues to pray three times a day to God towards Jerusalem; he is accused and King Darius, forced by his own decree, throws Daniel into the lions den. But God shuts up the mouths of the lions, and the next morning Darius rejoices to find him unharmed. The king casts Daniels accusers into the lions pit together with their wives and children to be instantly devoured, while he himself acknowledges Daniels God as he whose kingdom shall never be destroyed.             In the first year of ": null
    },
    {
        "Belshazzar": "Belshazzar"
    },
    {
        " Daniel has a dream of four monstrous beasts arising from the sea. First year of Belshazzar: Probably 553 BC, when Belshazzar was given royal power by his father, ": null
    },
    {
        "Nabonidus": "Nabonidus"
    },
    {
        ". See Levine, 2010, p. 1248, footnote 7.1–8. The fourth, a beast with ten horns, devours the whole earth, treading it down and crushing it, and a further small horn appears and uproots three of the earlier horns. The ": null
    },
    {
        "Ancient of Days": "Ancient Of Days"
    },
    {
        " judges and destroys the beast, and one like a ": null
    },
    {
        "son of man": "Son Of Man"
    },
    {
        " is given everlasting kingship over the entire world. A divine being explains that the four beasts represent four kings, but that the holy ones of the Most High would receive the everlasting kingdom. The fourth beast would be a fourth kingdom with ten kings, and another king who would pull down three kings and make war on the holy ones for a time, two times and a half, after which the heavenly judgement will be made against him and the holy ones will receive the everlasting kingdom.          In the third year of Belshazzar Daniel has vision of a ram and goat. The ram has two mighty horns, one longer than the other, and it charges west, north and south, overpowering all other beasts. A goat with a single horn appears from the west and destroys the ram. The goat becomes very powerful until the horn breaks off and is replaced by four lesser horns. A small horn that grows very large, it stops the daily temple sacrifices and desecrates the sanctuary for two thousand three hundred evening and mornings until the temple is cleansed. The ": null
    },
    {
        "angel Gabriel": "Angel Gabriel"
    },
    {
        " informs him that the ram represents the Medes and Persians, the goat is Greece, and the little horn is a wicked king.          In the first year of Darius the Mede, Daniel meditates on the word of ": null
    },
    {
        "Jeremiah": "Book Of Jeremiah"
    },
    {
        " that the desolation of Jerusalem would last seventy years; he confesses the sin of Israel and pleads for God to restore Israel and the desolated sanctuary of the Temple. The angel ": null
    },
    {
        "Gabriel": "Gabriel"
    },
    {
        " explains that the seventy years stand for seventy weeks of years , during which the Temple will first be restored, then later defiled by a prince who is to come, until the decreed end is poured out.           Daniel 10: In the third year of ": null
    },
    {
        "Cyrus": "Cyrus The Great"
    },
    {
        " Third year of Cyrus : 536 BC. The author has apparently counted back seventy years to the third year of Jehoiakim, 606 BC, to round out Daniels prophetic ministry. See Towner, p. 149. Daniel sees in his vision an angel who explains that he is in the midst of a war with the prince of Persia , assisted only by ": null
    },
    {
        "Michael": "Michael"
    },
    {
        ", your prince. The prince of Greece will shortly come, but first he will reveal what will happen to Daniels people.     Daniel 11: A future king of Persia will make war on the king of ": null
    },
    {
        "Greece": "Ancient Greece"
    },
    {
        ", a mighty king will arise and wield power until his empire is broken up and given to others, and finally the king of the south  will go to war with the king of the north. After many battles a contemptible person will become king of the north; this king will invade the south two times, the first time with success, but on his second he will be stopped by ships of Kittim. He will turn back to his own country, and on the way his soldiers will desecrate the Temple, abolish the daily sacrifice, and set up the ": null
    },
    {
        "abomination of desolation": "Abomination Of Desolation"
    },
    {
        ". He will defeat and subjugate ": null
    },
    {
        "Libya": "Ancient Libya"
    },
    {
        " and Egypt, but reports from the east and north will alarm him, and he will meet his end between the sea and the holy mountain.     Daniel 12: At this time Michael will come. It will be a time of great distress, but all those whose names are written will be delivered. Multitudes who sleep in the dust of the earth will awake, some to everlasting life, others to shame and everlasting contempt; those who are wise will shine like the brightness of the heavens, and those who lead many to righteousness, like the stars for ever and ever. In the final verses the remaining time to the end is revealed: a time, times and half a time . Daniel fails to understand and asks again what will happen, and is told: From the time that the daily sacrifice is abolished and the abomination that causes desolation is set up, there will be 1,290 days. Blessed is the one who waits for and reaches the end of the 1,335 days.               The Greek text of Daniel is considerably longer than the Hebrew, due to three additional stories: they remain in ": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        " and ": null
    },
    {
        "Orthodox": "Eastern Orthodox Church"
    },
    {
        " Bibles but were rejected by the Protestant movement in the 16th century on the basis that they were absent from Jewish Bibles. ": null
    },
    {
        "The Prayer of Azariah and Song of the Three Holy Children": "The Prayer Of Azariah And Song Of The Three Holy Children"
    },
    {
        ", placed after Daniel 3:23;   The story of ": null
    },
    {
        "Susanna and the Elders": "Susanna"
    },
    {
        ", placed before chapter 1 in some Greek versions and after chapter 12 in others;   The story of ": null
    },
    {
        "Bel and the Dragon": "Bel And The Dragon"
    },
    {
        ", placed at the end of the book.            The visions of chapters 7–12 reflect the crisis which took place in Judea in 167–164 BC when ": null
    },
    {
        "Antiochus IV Epiphanes": "Antiochus Iv Epiphanes"
    },
    {
        ", the Greek king of the ": null
    },
    {
        "Seleucid Empire": "Seleucid Empire"
    },
    {
        ", threatened to destroy traditional Jewish worship in Jerusalem. When Antiochus came to the throne in 175 BC the Jews were largely pro-Seleucid. The High Priestly family was split by rivalry, and one member, Jason, offered the king a large sum to be made High Priest. Jason also asked—or more accurately, paid—to be allowed to make Jerusalem a  polis , or Greek city. This meant, among other things, that city government would be in the hands of the citizens, which meant in turn that citizenship would be a valuable commodity, to be purchased from Jason. None of this threatened the Jewish religion, and the reforms were widely welcomed, especially among the Jerusalem aristocracy and the leading priests. Three years later Jason was deposed when another priest, Menelaus, offered Antiochus an even larger sum for the post of High Priest.     Antiochus invaded Egypt twice, in 169 BC with success, but on the second incursion, in late 168 BC, he was forced to withdraw by the Romans. Jason, hearing a rumour that Antiochus was dead, attacked Menelaus to take back the High Priesthood. Antiochus drove Jason out of Jerusalem, plundered the Temple, and introduced measures to pacify his Egyptian border by imposing complete Hellenisation: the Jewish Book of the Law was prohibited and on 15 December 167 BC an abomination of desolation , probably a Greek altar, was introduced into the Temple. With the Jewish religion now clearly under threat a resistance movement sprang up, led by the Maccabee brothers, and over the next three years it won sufficient victories over Antiochus to take back and purify the Temple.     The crisis which the author of Daniel addresses is the defilement of the altar in Jerusalem in 167 BC : the daily offering which used to take place twice a day, at morning and evening, stopped, and the phrase evenings and mornings recurs through the following chapters as a reminder of the missed sacrifices. But whereas the events leading up to the sacking of the Temple in 167 BC and the immediate aftermath are remarkably accurate, the predicted war between the Syrians and the Egyptians never took place, and the prophecy that Antiochus would die in Palestine was inaccurate . The obvious conclusion is that the account must have been completed near the end of the reign of Antiochus but before his death in December 164 BC, or at least before news of it reached Jerusalem, and the consensus of modern scholarship is accordingly that the book dates to the period 167-163 BCE.              It is generally accepted that Daniel originated as a collection of Aramaic court tales later expanded by the Hebrew revelations. The court tales may have originally circulated independently, but the edited collection was probably composed in the third or early second century BC. Chapter 1 was composed at this time as a brief introduction of to provide historical context, introduce the characters of the tales, and explain how Daniel and his friends came to Babylon. The visions of chapters 7–12 were added and chapter 1 translated into Hebrew at the third stage when the final book was being drawn together.       Daniel is one of a large number of Jewish apocalypses, all of them ": null
    },
    {
        "pseudonym": "Pseudonym"
    },
    {
        "ous. The stories of the first half are considered legendary in origin, and the visions of the second the product of anonymous authors in the ": null
    },
    {
        "Maccabean": "Maccabees"
    },
    {
        " period .     Although the entire book is traditionally ascribed to Daniel the seer, chapters 1–6 are in the voice of an anonymous narrator, except for chapter 4 which is in the form of a letter from king Nebuchadnezzar; only the second half is presented by Daniel himself, introduced by the anonymous narrator in chapters 7 and 10. The real author/editor of Daniel was probably an educated Jew, knowledgeable in Greek learning, and of high standing in his own community. The book is a product of Wisdom circles, but the type of wisdom is ": null
    },
    {
        "mantic": "Wiktionary:Mantic"
    },
    {
        " rather than the wisdom of learning—the main source of wisdom in Daniel is Gods revelation.     It is possible that the name of Daniel was chosen for the hero of the book because of his reputation as a wise seer in Hebrew tradition, ": null
    },
    {
        "Ezekiel": "Ezekiel"
    },
    {
        ", who lived during the Babylonian exile, mentioned him in association with ": null
    },
    {
        "Noah": "Noah"
    },
    {
        " and ": null
    },
    {
        "Job": "Job"
    },
    {
        "  as a figure of legendary wisdom , and a hero named Daniel features in a late 2nd millennium myth from ": null
    },
    {
        "Ugarit": "Ugarit"
    },
    {
        ". The legendary Daniel, known from long ago but still remembered as an exemplary character  ... serves as the principal human hero in the biblical book that now bears his name ; Daniel is the wise and righteous intermediary who is able to interpret dreams and thus convey the will of God to humans, the recipient of visions from on high that are interpreted to him by heavenly intermediaries.       The prophecies of Daniel are accurate down to the career of ": null
    },
    {
        "Antiochus IV Epiphanes": "Antiochus Iv Epiphanes"
    },
    {
        ", king of Syria and oppressor of the Jews, but not in its prediction of his death: the author seems to know about Antiochus two campaigns in Egypt , the desecration of the Temple , and the fortification of the Akra , but he seems to know nothing about the reconstruction of the Temple or about the actual circumstances of Antiochus death in late 164 BC. Chapters 10–12 must therefore have been written between 167 and 164 BC. There is no evidence of a significant time lapse between those chapters and chapters 8 and 9, and chapter 7 may have been written just a few months earlier again.     Further evidence of the books date is in the fact that Daniel is excluded from the Hebrew Bibles ": null
    },
    {
        "canon of the prophets": "Neviim"
    },
    {
        ", which was closed around 200 BC, and the Wisdom of ": null
    },
    {
        "Sirach": "Sirach"
    },
    {
        ", a work dating from around 180 BC, draws on almost every book of the Old Testament except Daniel, leading scholars to suppose that its author was unaware of it. Daniel is, however, quoted in a section of the ": null
    },
    {
        "Sibylline Oracles": "Sibylline Oracles"
    },
    {
        " commonly dated to the middle of the 2nd century BC, and was popular at Qumran at much the same time, suggesting that it was known from the middle of that century.       The Book of Daniel is preserved in the 12-chapter ": null
    },
    {
        "Masoretic Text": "Masoretic Text"
    },
    {
        " and in two longer Greek versions, the original ": null
    },
    {
        "Septuagint": "Septuagint"
    },
    {
        " version, c. 100  BC, and the later ": null
    },
    {
        "Theodotion": "Theodotion"
    },
    {
        " version from c. 2nd century AD. Both Greek texts contain three ": null
    },
    {
        "additions to Daniel": "Additions To Daniel"
    },
    {
        ": ": null
    },
    {
        "The Prayer of Azariah and Song of the Three Holy Children": "The Prayer Of Azariah And Song Of The Three Holy Children"
    },
    {
        "; the story of ": null
    },
    {
        "Susannah and the Elders": "Susanna"
    },
    {
        "; and the story of ": null
    },
    {
        "Bel and the Dragon": "Bel And The Dragon"
    },
    {
        ". Theodotion is much closer to the Masoretic Text and became so popular that it replaced the original Septuagint version in all but two manuscripts of the Septuagint itself. The Greek additions were apparently never part of the Hebrew text.     Eight copies of the Book of Daniel, all incomplete, have been found at ": null
    },
    {
        "Qumran": "Qumran"
    },
    {
        ", two in ": null
    },
    {
        "Cave 1": "Qumran Caves"
    },
    {
        ", five in Cave 4, and one in Cave 6. Between them, they preserve text from eleven of Daniels twelve chapters, and the twelfth is quoted in the ": null
    },
    {
        "Florilegium": "Florilegium"
    },
    {
        " 4Q174, showing that the book at Qumran did not lack this conclusion. All eight manuscripts were copied between 125  BC and about 50 AD , showing that Daniel was being read at Qumran only about 40 years after its composition. All appear to preserve the 12-chapter Masoretic version rather than the longer Greek text. None reveal any major disagreements against the Masoretic, and the four scrolls that preserve the relevant sections all follow the bilingual nature of Daniel where the book opens in ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        ", switches to ": null
    },
    {
        "Aramaic": "Aramaic Language"
    },
    {
        " at 2:4b, then reverts to Hebrew at 8:1.                   The Book of Daniel is an ": null
    },
    {
        "apocalypse": "Apocalypse"
    },
    {
        ", a ": null
    },
    {
        "literary genre": "Literary Genre"
    },
    {
        " in which a heavenly reality is revealed to a human recipient; such works are characterized by visions, symbolism, an other-worldly mediator, an emphasis on cosmic events, angels and demons, and ": null
    },
    {
        "pseudonymity": "Pseudonymity"
    },
    {
        " . The production of apocalypses occurred commonly from 300 BC to 100 AD, not only among Jews and Christians, but also among Greeks, ": null
    },
    {
        "Romans": "Ancient Rome"
    },
    {
        ", Persians and ": null
    },
    {
        "Egyptians": "Egyptians"
    },
    {
        ". Daniel, the books hero, is a representative apocalyptic seer, the recipient of divine revelation: he has learned the wisdom of the Babylonian magicians and surpassed them, because his God is the true source of knowledge; he is one of the ": null
    },
    {
        "maskilim": "Maskil"
    },
    {
        " , the wise ones, who have the task of teaching righteousness and whose number may be considered to include the authors of the book itself. The book is also an ": null
    },
    {
        "eschatology": "Eschatology"
    },
    {
        ", as the divine revelation concerns the end of the present age, a predicted moment in which God will intervene in history to usher in the final kingdom. It gives no real details of the end-time, but it seems that Gods kingdom will be on this earth, that it will be governed by justice and righteousness, and that the tables will be turned on the Seleucids and those Jews who have cooperated with them.       The message of the Book of Daniel is that, just as the God of Israel saved Daniel and his friends from their enemies, so he would save all Israel in their present oppression. The book is filled with monsters, angels, and numerology, drawn from a wide range of sources, both biblical and non-biblical, that would have had meaning in the context of 2nd-century Jewish culture, and while Christian interpreters have always viewed these as predicting events in the New Testament— the Son of God , the Son of Man , Christ and the Antichrist—the books intended audience is the Jews of the 2nd century BC. The following explains a few of these predictions, as understood by modern biblical scholars.     The four kingdoms and the little horn : The concept of four successive world empires stems from Greek theories of mythological history. Most modern interpreters agree that the four represent ": null
    },
    {
        "Babylon": "Neo-Babylonian Empire"
    },
    {
        ", the ": null
    },
    {
        "Medes": "Medes"
    },
    {
        ", ": null
    },
    {
        "Persia": "Achaemenid Empire"
    },
    {
        " and the ": null
    },
    {
        "Greeks": "Macedonian Empire"
    },
    {
        ", ending with Hellenistic ": null
    },
    {
        "Seleucid Syria": "Seleucid Syria"
    },
    {
        " and with Hellenistic ": null
    },
    {
        "Ptolemaic Egypt": "Ptolemaic Egypt"
    },
    {
        ". The traditional interpretation of the dream identifies the four empires as the Babylonian , Medo-Persian , Greek , and Roman empires. The symbolism of four metals in the statue in chapter 2 comes from Persian writings, while the four beasts from the sea in chapter 7 reflect Hosea 13:7–8, in which God threatens that he will be to Israel like a lion, a leopard, a bear or a wild beast. The consensus among scholars is that the four beasts of chapter 7 symbolise the same four world empires. The modern interpretation views ": null
    },
    {
        "Antiochus IV": "Antiochus Iv Epiphanes"
    },
    {
        " as the small horn that uproots three others . Ancient of Days and the one like a son of man : The portrayal of God in Daniel  resembles the portrayal of the ": null
    },
    {
        "Canaan": "Canaan"
    },
    {
        "ite god ": null
    },
    {
        "El": "El"
    },
    {
        " as an ancient divine king presiding over the divine court. The Ancient of Days gives dominion over the earth to one like a ": null
    },
    {
        "son of man": "Son Of Man"
    },
    {
        " , and then in  to the people of the holy ones of the Most High , whom scholars consider the son of man to represent. These people can be understood as the maskilim , or as the Jewish people broadly. Son of man  simply means a human being , but in the context of Daniel 7 it may be a heavenly figure, possibly the archangel Michael functioning as a representative of the Jewish people . Scholars almost universally agree that this human figure represents the people of the holy ones of the Most High of Daniel 7:27, originally the maskilim community or group responsible for the composition of Daniel, but in later interpretation it is taken to mean the Jewish people as a whole. See Grabbe 2002a.   The ram and he-goat as conventional astrological symbols represent Persia and Syria, as the text explains. The mighty horn stands for ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " and the four lesser horns represent the four principal generals  who fought over the Greek empire following Alexanders death. The little horn again represents Antiochus IV. The key to the symbols lies in the description of the little horns actions: he ends the continual burnt offering and overthrows the Sanctuary, a clear reference to Antiochus desecration of the Temple. anointed ones and the seventy years : Daniel reinterprets ": null
    },
    {
        "Jeremiahs": "Book Of Jeremiah"
    },
    {
        " seventy years prophecy regarding the period Israel would spend in bondage to Babylon. From the point of view of the Maccabean era, Jeremiahs promise was obviously not true—the gentiles still oppressed the Jews, and the desolation of Jerusalem had not ended. Daniel therefore reinterprets the seventy years as seventy weeks of years, making up 490 years. The 70 weeks/490 years are subdivided, with seven weeks from the going forth of the word to rebuild and restore Jerusalem to the coming of an anointed one , while the final week is marked by the violent death of another anointed one , probably the High Priest ": null
    },
    {
        "Onias III": "Onias Iii"
    },
    {
        " , and the profanation of the Temple. The point of this for Daniel is that the period of gentile power is predetermined, and is coming to an end. Kings of north and south: Chapters 10 to 12 concern the war between these kings, the events leading up to it, and its heavenly meaning. In chapter 10 the angel explains that there is currently a war in heaven between Michael, the angelic protector of Israel, and the princes of Persia and Greece; then, in chapter 11, he outlines the human wars which accompany this—the mythological concept sees standing behind every nation a god/angel who does battle on behalf of his people, so that earthly events reflect what happens in heaven. The wars of the ": null
    },
    {
        "Ptolemies": "Ptolemies"
    },
    {
        " against the Seleucids are reviewed down to the career of ": null
    },
    {
        "Antiochus the Great": "Antiochus Iii The Great"
    },
    {
        " , but the main focus is Antiochus IV, to whom more than half the chapter is devoted. The accuracy of these predictions lends credibility to the real prophecy with which the passage ends, the death of Antiochus—which, in the event, was not accurate. Predicting the end-time : Biblical eschatology does not generally give precise information as to when the end will come, and Daniels attempts to specify the number of days remaining is a rare exception. Daniel asks the angel how long the little horn will be triumphant, and the angel replies that the Temple will be reconsecrated after 2300 evenings and mornings have passed . The angel is counting the two daily sacrifices, so the period is 1150 days from the desecration in December 167. In chapter 12 the angel gives three more dates: the desolation will last for a time, times and half a time , or a year, two years, and a half a year ; then that the desolation will last for 1290 days ; and finally, 1335 days . Verse 12:11 was presumably added after the lapse of the 1150 days of chapter 8, and 12:12 after the lapse of the number in 12:11.              The concepts of ": null
    },
    {
        "immortality": "Immortality"
    },
    {
        " and ": null
    },
    {
        "resurrection": "Resurrection"
    },
    {
        ", with rewards for the righteous and punishment for the wicked, have roots much deeper than Daniel, but the first clear statement is found in the final chapter of that book: Many of those who sleep in the dust of the earth shall awake, some to everlasting life, and some to everlasting shame and contempt.  Without this belief, ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", in which the ": null
    },
    {
        "resurrection of Jesus": "Resurrection Of Jesus"
    },
    {
        " plays a central role, would have disappeared, like the movements following other charismatic Jewish figures of the 1st century.     Daniel was quoted and referenced by both Jews and Christians in the 1st century AD as predicting the imminent end-time. Moments of national and cultural crisis continually reawakened the apocalyptic spirit, through the ": null
    },
    {
        "Montanists": "Montanism"
    },
    {
        " of the 2nd/3rd centuries, persecuted for their ": null
    },
    {
        "millennialism": "Millennialism"
    },
    {
        ", to the more extreme elements of the 16th-century Reformation such as the ": null
    },
    {
        "Zwickau prophets": "Zwickau Prophets"
    },
    {
        " and the ": null
    },
    {
        "Münster Rebellion": "Münster Rebellion"
    },
    {
        ". During the ": null
    },
    {
        "English Civil War": "English Civil War"
    },
    {
        ", the ": null
    },
    {
        "Fifth Monarchy Men": "Fifth Monarchists"
    },
    {
        " took their name and political program from Daniel 7, demanding that ": null
    },
    {
        "Oliver Cromwell": "Oliver Cromwell"
    },
    {
        " allow them to form a government of saints in preparation for the coming of the Messiah; when Cromwell refused, they identified him instead as the Beast usurping the rightful place of King Jesus. Daniel remains one of the most influential apocalypses in modern America, foretelling the history of Jesus and the ": null
    },
    {
        "Second Coming": "Second Coming"
    },
    {
        ".     The influence of Daniel has not been confined to Judaism and Christianity: In the Middle Ages Muslims created horoscopes whose authority was attributed to Daniel. More recently the ": null
    },
    {
        "Baháí": "Baháí Faith"
    },
    {
        " movement, which originated in Persian Shiite Islam, justified its existence on the 1260-day prophecy of Daniel, holding that it foretold the coming of the ": null
    },
    {
        "Twelfth Imam": "Muhammad Al-Mahdi"
    },
    {
        " and an age of peace and justice in the year 1844, which is the year 1260 of the ": null
    },
    {
        "Muslim era": "Hijri Year"
    },
    {
        ".       Daniel belongs not only to the religious tradition but also to the wider Western intellectual and artistic heritage. It was easily the most popular of the prophetic books for the Anglo-Saxons, who nevertheless treated it not as prophecy but as a historical book, a repository of dramatic stories about confrontations between God and a series of emperor-figures who represent the highest reach of man . In the early modern period the physicist ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        " paid special attention to it, and ": null
    },
    {
        "Francis Bacon": "Francis Bacon"
    },
    {
        " borrowed a ": null
    },
    {
        "motto": "Motto"
    },
    {
        " from it for his work  Novum Organum . Philosophers, such as ": null
    },
    {
        "Baruch Spinoza": "Baruch Spinoza"
    },
    {
        " drew on it. In the 20th century its apocalyptic second half attracted the attention of ": null
    },
    {
        "Carl Jung": "Carl Jung"
    },
    {
        ". The book has also inspired musicians, from medieval liturgical drama to the 20th century compositions of ": null
    },
    {
        "Darius Milhaud": "Darius Milhaud"
    },
    {
        ". Artists including ": null
    },
    {
        "Michelangelo": "Michelangelo"
    },
    {
        ", ": null
    },
    {
        "Rembrandt": "Rembrandt"
    },
    {
        " and ": null
    },
    {
        "Eugène Delacroix": "Eugène Delacroix"
    },
    {
        " have all drawn on its imagery.": null
    }
]