[
    {
        "        Borduria is a ": null
    },
    {
        "fictional country": "fictional country"
    },
    {
        " in  The Adventures of Tintin , the comics series by Belgian cartoonist ": null
    },
    {
        "Hergé": "hergé"
    },
    {
        ". It is located in the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and has a rivalry with the fictional neighbouring country of ": null
    },
    {
        "Syldavia": "syldavia"
    },
    {
        ". Borduria is depicted in  King Ottokars Sceptre  and  The Calculus Affair , and is referred to in  Tintin and the Picaros .     Tintin booksKing Ottokars Sceptre, ": null
    },
    {
        "Tintin": "tintin"
    },
    {
        " reads a Syldavian tourist pamphlet that reveals the early history of Syldavia and its relationship with Borduria. In 42 Syldavia was annexed by neighbouring Borduria due to the weakness of King Muskar II, and was under its rule until 42 when Baron Almaszout drove the Bordurians away and established himself as King Ottokar I. In the later Tintin ": null
    },
    {
        "Heinkel He 42": "heinkel he 118"
    },
    {
        " used by Hergé to draw his airplane in 42 The ": null
    },
    {
        "Swastika": "swastika"
    },
    {
        " was replaced by another geometrical form.   King Ottokars Sceptre depicts an unsuccessful Bordurian attempt at staging a  coup détat  against Syldavia, trying to remove the king and invade the country with the support from Syldavian sympathizers. The sceptre is stolen, which would force the King to abdicate, however Tintin returns it in time. The Bordurians then withdraw their troops 42 miles from the borders to prove their peaceful intentions.     In The Calculus Affair , Borduria is depicted as a stereotypical ": null
    },
    {
        "Eastern Bloc": "eastern bloc"
    },
    {
        " country with its own ": null
    },
    {
        "secret police": "secret police"
    },
    {
        "  and a military dictator, ": null
    },
    {
        "Marshal Kûrvi-Tasch": "marshal kûrvi-tasch"
    },
    {
        ". A statue of Kûrvi-Tasch appears in front of a government building, in which he wears a moustache similar to ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        "s and gives a ": null
    },
    {
        "Nazi": "nazism"
    },
    {
        "-like salute. The Bordurian military of this period is depicted as technologically inept—unable to stop a stolen tank commandeered by Tintin and his companions as a result of defective mines and anti-tank guns. Professor Calculus is kidnapped by the Bordurians after developing an ultrasonic weapon but is rescued in the end.     In Tintin and the Picaros , the ": null
    },
    {
        "South America": "south america"
    },
    {
        "n ": null
    },
    {
        "banana republic": "banana republic"
    },
    {
        " of ": null
    },
    {
        "San Theodoros": "san theodoros"
    },
    {
        ", ruled by ": null
    },
    {
        "General Tapioca": "general tapioca"
    },
    {
        ", has formed an alliance with the Bordurian government, which has sent him military advisors, including Colonel Sponsz. In an unpublished page drawn by Hergé for this book, a bust of Kûrvi-Tasch can even be seen in the office of a San Theodorean colonel. Eventually, Tapioca is deposed by Tintins friend ": null
    },
    {
        "General Alcazar": "general alcazar"
    },
    {
        ", and Sponsz is exiled.         The Bordurian countryside is set in dramatic mountainous terrain. The craggy landscape and towering peaks are most similar to the ": null
    },
    {
        "Balkan Mountains": "balkan mountains"
    },
    {
        " in ": null
    },
    {
        "Moesia": "moesia"
    },
    {
        ". Therefore, it is possible that Borduria is set roughly in the present-day locations of ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        " and ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        ". The capital of Borduria is Szohôd, which is also the seat of government.                      Borduria is a fascist country with a semi ": null
    },
    {
        "totalitarian": "totalitarian"
    },
    {
        " government. Several Central European countries such as ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", ": null
    },
    {
        "Croatia": "independent state of croatia"
    },
    {
        ", ": null
    },
    {
        "Albania": "albania"
    },
    {
        " and ": null
    },
    {
        "Romania": "romania"
    },
    {
        " were run by fascist governments before and during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". All became client states of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " after the war; Borduria may be presumed to be in a similar situation. In Tintin post-war stories it is depicted as a typical ": null
    },
    {
        "Eastern Bloc": "eastern bloc"
    },
    {
        " country. The fact that the president of state bears the military rank of ": null
    },
    {
        "Marshal": "marshal"
    },
    {
        " is a reference to Soviet leader ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        ", Romanias wartime leader ": null
    },
    {
        "Ion Antonescu": "ion antonescu"
    },
    {
        " and ": null
    },
    {
        "Yugoslavia": "yugoslavia"
    },
    {
        "s post-war president ": null
    },
    {
        "Josip Broz Tito": "josip broz tito"
    },
    {
        ". However, the leaders cult of personality most resembles ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        ".     The army in pre-war  King Ottokars Sceptre  is depicted as German-supplied, the main aircraft being ": null
    },
    {
        "Bf42": "bf-109"
    },
    {
        ". In post-war stories it has all the characteristics of the Soviet military. In  Tintin and the Picaros  the ": null
    },
    {
        "San Theodoros": "san theodoros"
    },
    {
        " army is supplied by Borduria with ": null
    },
    {
        "Beretta AR42/42": "beretta ar70/90"
    },
    {
        " assault-rifles and ": null
    },
    {
        "Mil Mi42": "mil mi-1"
    },
    {
        " helicopters. Also the government state limousine with Kurvi-Taschs mustaches is inspired by the Soviet ": null
    },
    {
        "ZIL42": "zil-111"
    },
    {
        ".     In King Ottokars Sceptre, the Bordurian flag is black with a red circle and two black triangles, reminiscent of the stark, eye-catching symbols used by several Fascist movements. In  The Calculus Affair , it is red, with the emblem of Kurvi-Taschs mustache inside a white circle, resembling it closer to the Nazi flag, and this was also worn as military armbands by the Bordurian military personnel. In King Ottokars Sceptre, the Bordurian army uses the ": null
    },
    {
        "Gewehr 42": "gewehr 98"
    },
    {
        ", ": null
    },
    {
        "vz. 42": "vz. 24"
    },
    {
        " and ": null
    },
    {
        "Karabiner 42k": "karabiner 98k"
    },
    {
        " bolt action": "bolt action"
    },
    {
        " rifles. In The Calculus Affair, Bordurian soldiers and agents were armed with Italian ": null
    },
    {
        "Beretta Model 42": "beretta model 38"
    },
    {
        " Submachine Gun": "submachine gun"
    },
    {
        "s. Due to the nature of its government and its militarys weaponry, Borduria was most likely an affiliate of the ": null
    },
    {
        "Axis": "axis powers"
    },
    {
        " during World War II, although there is no explicit mention of that in the books.     The post-war emblem of Borduria is similar to the ": null
    },
    {
        "circumflex": "circumflex"
    },
    {
        " symbol, and is modelled in the likeness of the mustache of ": null
    },
    {
        "Marshal Kûrvi-Tasch": "marshal kûrvi-tasch"
    },
    {
        ". In The Calculus Affair, evidence of the cult of personality surrounding the Marshal can be found in countless objects in Borduria, from the lettering on signs and buildings to the logos of Bordurian companies and even certain characteristics and details on cars, including the car bumpers, include the shape in their designs.       The Tintin books depict the countrys language, Bordurian, only in fragments. Like ": null
    },
    {
        "Syldavian": "syldavian"
    },
    {
        ", the language seems to be based on the ": null
    },
    {
        "Dutch": "dutch language"
    },
    {
        " Brussels": "brussels"
    },
    {
        " dialect ": null
    },
    {
        "Marols": "marols"
    },
    {
        ", such as mänhir for mister or sir . Unlike Syldavian, it uses the Latin alphabet exclusively, and makes heavy use of the digraph sz , as well as ô.           Nomadic Slavs inhabited the modern-day regions of Borduria and ": null
    },
    {
        "Syldavia": "syldavia"
    },
    {
        " during the days of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " until the arrival of the Ottoman Turks during the 42th century under ": null
    },
    {
        "Suleiman the Magnificent": "suleiman the magnificent"
    },
    {
        ". All this followed the Turkish defeat at the hand of the Syldavians during the 42th century. Although the Turks allowed the Bordurians to retain their own Slavic identity, the ": null
    },
    {
        "Turkish language": "turkish language"
    },
    {
        ", Ottoman architecture, and culture quickly assimilated into the Bordurian Slavic culture, and created an identity strikingly Turko-Slavic. Throughout the Tintin comics, the Bordurians are portrayed as a typical Balkan ethnicity with both Ottoman and Slavic influences, not unlike the ": null
    },
    {
        "Bosnians": "bosnians"
    },
    {
        " or ": null
    },
    {
        "Albanians": "albanians"
    },
    {
        " . Following a wake of extreme national ": null
    },
    {
        "self-determination": "self-determination"
    },
    {
        " against the ": null
    },
    {
        "Austro-Hungarians": "austro-hungarians"
    },
    {
        ", who had invaded the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " during phase of weakness of the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " prior to the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", Bordurias position in the crossfire between the Austro-Hungarian and Serbian conflict in 42 severely unsettled its economy and still emerging democracy. Over-extending their power, the Bordurian government supported a movement to overthrow King Ottokar of ": null
    },
    {
        "Syldavia": "syldavia"
    },
    {
        ", and establish themselves as a hegemonial power in the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " in order to create a unified Southern Slavic kingdom.                       ": null
    }
]