[
    {
        "            Bournemouth  is a coastal ": null
    },
    {
        "resort town": "resort town"
    },
    {
        " on the south coast of ": null
    },
    {
        "England": "england"
    },
    {
        ", east of the  ": null
    },
    {
        "Jurassic Coast": "jurassic coast"
    },
    {
        ", a ": null
    },
    {
        "World Heritage Site": "world heritage site"
    },
    {
        ". At the 42 census, the town had a population of 42, making it the largest in ": null
    },
    {
        "the administrative county of Dorset": "dorset"
    },
    {
        ". It is in the historic county of ": null
    },
    {
        "Hampshire": "hampshire"
    },
    {
        ". With ": null
    },
    {
        "Poole": "poole"
    },
    {
        " to the west and ": null
    },
    {
        "Christchurch": "christchurch, dorset"
    },
    {
        " in the east, Bournemouth is part of the ": null
    },
    {
        "South East Dorset conurbation": "south east dorset conurbation"
    },
    {
        ", which has a population of 42.     Before it was founded in 42 by ": null
    },
    {
        "Lewis Tregonwell": "lewis tregonwell"
    },
    {
        ", the area was a deserted ": null
    },
    {
        "heathland": "heathland"
    },
    {
        " occasionally visited by fishermen and smugglers. Initially marketed as a health resort, the town received a boost when it appeared in ": null
    },
    {
        "Augustus Granville": "augustus granville"
    },
    {
        "s 42 book, The Spas of England. Bournemouths growth accelerated with the arrival of the railway, and it became a town in 42 ": null
    },
    {
        "Historically": "historic counties of england"
    },
    {
        " part of ": null
    },
    {
        "Hampshire": "hampshire"
    },
    {
        ", it joined Dorset with the ": null
    },
    {
        "reorganisation of local government in 42": "local government act 1972"
    },
    {
        ". Through local government changes in 42 the town began to be administered by a ": null
    },
    {
        "unitary authority": "unitary authority"
    },
    {
        " independent of ": null
    },
    {
        "Dorset County Council": "dorset county council"
    },
    {
        ", although it remains part of that ": null
    },
    {
        "ceremonial county": "ceremonial county"
    },
    {
        ". Since April 42 the unitary authority has been merged with that of ": null
    },
    {
        "Poole": "poole"
    },
    {
        ", as well as the non-metropolitan district of ": null
    },
    {
        "Christchurch": "christchurch, dorset"
    },
    {
        " to create the ": null
    },
    {
        "Bournemouth, Christchurch and Poole": "bournemouth, christchurch and poole council"
    },
    {
        " unitary authority.     The town centre has notable Victorian architecture and the  spire of ": null
    },
    {
        "St Peters Church": "st peters church, bournemouth"
    },
    {
        ", one of three ": null
    },
    {
        "Grade I": "listed building"
    },
    {
        " listed churches in the borough, is a local landmark. Bournemouths location has made it a popular destination for tourists, attracting over five million visitors annually with its beaches and popular nightlife. The town is also a regional centre of business, home of the ": null
    },
    {
        "Bournemouth International Centre": "bournemouth international centre"
    },
    {
        " or BIC, and a financial sector that is worth more than £42 million in ": null
    },
    {
        "gross value added": "gross value added"
    },
    {
        ".       The first mention of Bournemouth comes in the ": null
    },
    {
        "Christchurch": "christchurch, dorset"
    },
    {
        " cartulary of 42 where a monk describes how a large fish ,  long, was washed up at La Bournemothe in October of that year and taken to the Manor of ": null
    },
    {
        "Wick": "wick, bournemouth"
    },
    {
        "; six days later, a portion of the fish was collected by a canon from ": null
    },
    {
        "Christchurch Priory": "christchurch priory"
    },
    {
        " and taken away as ": null
    },
    {
        "tithe": "tithe"
    },
    {
        ". A. McKinstry, The Village of Tuckton, 42 BC - 42 , p. 42 La Bournemowthe , however, was purely a geographic reference to the uninhabited area around the mouth of the small river which, in turn, drained the heathland between the towns of ": null
    },
    {
        "Poole": "poole"
    },
    {
        " and Christchurch. Andrews & Henson The word bourne, meaning a small stream, is a derivative of burna, ": null
    },
    {
        "old English": "old english"
    },
    {
        " for a brook. Edwards Ashley & Ashley From the latter half of the 42th century Bourne Mouth seems to be preferred, being recorded as such in surveys and reports of the period, but this appears to have been shortened to Bourne after the area had started to develop. A travel guide published in 42 calls the place Bourne Cliffe or Tregonwells Bourne after its founder. Ashley & Ashley The Spas of England, published ten years later, calls it simply Bourne Edwards as does an 42 edition of the Hampshire Advertiser. Edwards In the late 42th century Bournemouth became predominant, although its two-word form appears to have remained in use up until at least the early 42th century, turning up on a 42 ordnance map. Ashley and Ashley Andrews and Henson             In the 42th century the region around the mouth of the ": null
    },
    {
        "River Bourne": "river bourne, dorset"
    },
    {
        " was part of the ": null
    },
    {
        "Hundred": "hundred"
    },
    {
        " of ": null
    },
    {
        "Holdenhurst": "holdenhurst"
    },
    {
        ". The hundred later became the ": null
    },
    {
        "Liberty of Westover": "westover, hampshire"
    },
    {
        " when it was extended to include the settlements of North Ashley, ": null
    },
    {
        "Muscliff": "muscliff"
    },
    {
        ", Muccleshell, ": null
    },
    {
        "Throop": "throop, dorset"
    },
    {
        ", ": null
    },
    {
        "Iford": "iford, dorset"
    },
    {
        ", ": null
    },
    {
        "Pokesdown": "pokesdown"
    },
    {
        ", ": null
    },
    {
        "Tuckton": "tuckton"
    },
    {
        " and ": null
    },
    {
        "Wick": "wick, bournemouth"
    },
    {
        ", and incorporated into the Manor of ": null
    },
    {
        "Christchurch": "christchurch, dorset"
    },
    {
        ".  Although the ": null
    },
    {
        "Dorset": "dorset"
    },
    {
        " and ": null
    },
    {
        "Hampshire": "hampshire"
    },
    {
        " region surrounding it had been the site of human settlement for thousands of years, Westover was largely a remote and barren ": null
    },
    {
        "heathland": "heathland"
    },
    {
        " before 42 Edwards In 42 the ": null
    },
    {
        "Earl of Southampton": "henry wriothesley, 2nd earl of southampton"
    },
    {
        " noted that the area was Devoid of all habitation , and as late as 42 the ": null
    },
    {
        "Duke of Rutland": "john manners, 5th duke of rutland"
    },
    {
        " recorded that ...  on this barren and uncultivated heath there was not a human to direct us . Cave     In the late 42th and early 42th centuries the Borough of Bournemouth would grow to encompass a number of ancient settlements along the River Stour, including ": null
    },
    {
        "Longham": "longham, dorset"
    },
    {
        " where a skull thought to be 42 years old was found in 42 ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " burials near ": null
    },
    {
        "Moordown": "moordown"
    },
    {
        ", and the discovery of ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " pottery on the East Cliff in 42 suggest there may have been settlements there during that period. ": null
    },
    {
        "Hengistbury Head": "hengistbury head"
    },
    {
        ", added to the borough in 42 was the site of a much older ": null
    },
    {
        "Palaeolithic": "palaeolithic"
    },
    {
        " encampment. Ashley and Ashley Edwards  During the latter half of the 42th century ": null
    },
    {
        "James Blount, 42th Baron Mountjoy": "lord mountjoy"
    },
    {
        ", began mining for ": null
    },
    {
        "alum": "alum"
    },
    {
        " in the area, and at one time part of the heath was used for hunting, although by the late 42th century little evidence of either event remained. Ashley and Ashley Edwards No-one lived at the mouth of the Bourne river and the only regular visitors to the area before the 42th century were a few fishermen, turf cutters and gangs of ": null
    },
    {
        "smugglers": "smuggling"
    },
    {
        ". Edwards        Prior to the ": null
    },
    {
        "Christchurch Inclosures Act 42": "christchurch inclosures act 1802"
    },
    {
        ", more than 42% of the Westover area was ": null
    },
    {
        "common land": "common land"
    },
    {
        ". The act, together with the Inclosure Commissioners Award of 42 transferred 42 acres into the hands of five private owners, including ": null
    },
    {
        "James Harris, 42st Earl of Malmesbury": "james harris, 1st earl of malmesbury"
    },
    {
        ", and ": null
    },
    {
        "Sir George Ivison Tapps": "george ivison tapps"
    },
    {
        ". Andrews & Henson Ashley and Ashley In 42 the Tapps Arms ": null
    },
    {
        "public house": "public house"
    },
    {
        " appeared on the heath. A few years later, in 42 the first official residents, retired army officer ": null
    },
    {
        "Lewis Tregonwell": "lewis tregonwell"
    },
    {
        " and his wife, moved into their new home built on land purchased from Tapps. The area was well known to Tregonwell who, during the Napoleonic wars, spent much of his time searching the heath and coastline for French invaders and smugglers.      Anticipating that people would come to the area to indulge in the newly fashionable pastime of sea-bathing, an activity with perceived health benefits, Tregonwell built a series of ": null
    },
    {
        "villa": "villa"
    },
    {
        "s on his land between 42 and 42 which he hoped to let out. Ashley & Ashley Edwards The common belief that pine-scented air was good for lung conditions, and in particular ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        ", prompted Tregonwell and Tapps to plant hundreds of ": null
    },
    {
        "pine trees": "pine trees"
    },
    {
        ". These early attempts to promote the town as a health resort meant that by the time Tregonwell died in 42 Bournemouth had grown into a small community with a scattering of houses, villas and cottages. The town would ultimately grow up around the scattered pines and tree-lined walk to the beach, later to become known as the Invalids Walk. Edwards Ashley & Ashley     After the death of Tapps in 42 his son Sir ": null
    },
    {
        "George William Tapps-Gervis": "george william tapps-gervis"
    },
    {
        " inherited his fathers estate. He hired the young local architect ": null
    },
    {
        "Benjamin Ferrey": "benjamin ferrey"
    },
    {
        " to develop the coastal area on the east side of the stream. Emery Bournemouths first hotel, later to become part of the Royal Bath Hotel, opened in 42 and is one of the few buildings designed by Ferrey still standing.  Bournemouth grew at a faster rate as Tapps-Gervis began developing the area similarly to the south coast resorts of ": null
    },
    {
        "Weymouth": "weymouth, dorset"
    },
    {
        " and ": null
    },
    {
        "Brighton": "brighton"
    },
    {
        ". Despite enormous investment, the towns share of the market remained modest. In 42 Tapps-Gervis invited the physician and writer ": null
    },
    {
        "Augustus Granville": "augustus granville"
    },
    {
        " to stay. Granville was the author of The Spas of England, which described health resorts around the country, and as a result of his visit he included a chapter on Bournemouth in the second edition of his book. The publication of the book, and the increase in visitors seeking the medicinal use of seawater and the pine-scented air, helped the town to grow and establish itself as an early tourist destination. Edwards Ashley & Ashley        In the 42s Benjamin Ferrey was replaced by ": null
    },
    {
        "Decimus Burton": "decimus burton"
    },
    {
        ", whose plans for Bournemouth included the construction of a garden alongside the Bourne stream, an idea first mooted by Granville. The fields south of the road crossing were drained and laid out with shrubberies and walks. Many of these paths, including the Invalids Walk, remain in the town today. Edwards A second suggestion of Granvilles, a sanatorium, was completed in 42 and greatly raised Bournemouths profile as a place for recuperation. Emery     At a time when the most convenient way to arrive in the town was by sea, a pier was considered to be a necessity. Holdenhurst Parish Council was reluctant to find the money, and an attempt to raise funds privately in 42 had only succeeded in financing a small  jetty. Emery The Bournemouth Improvement Act of 42 granted greater financial autonomy to the town and a pier was approved that year. A number of wooden structures were built before an  cast iron design by ": null
    },
    {
        "Eugenius Birch": "eugenius birch"
    },
    {
        " was completed in 42  Under the Act, a board of 42 Commissioners was established to build and organise the expanding infrastructure of the town, such as paving, sewers, drainage, street lighting and street cleaning. Ashley and Ashley     The arrival of the railways in 42 precipitated a massive growth in seaside and summer visitors to the town, especially from the ": null
    },
    {
        "Midlands": "english midlands"
    },
    {
        " and London. In 42 the town had a population of 42, but by 42 when railway connections to Bournemouth were at their most developed, the towns population had risen to 42 and it had become a favourite location for visiting artists and writers. The town was improved greatly during this period through the efforts of Sir ": null
    },
    {
        "Merton Russell-Cotes": "merton russell-cotes"
    },
    {
        ", the towns mayor and a local philanthropist, who helped to establish the towns first library and museum. The ": null
    },
    {
        "Russell-Cotes Art Gallery & Museum": "russell-cotes art gallery  &  museum"
    },
    {
        " was housed in his mansion, and after his death it was given to the town. Ashley and Ashley Bournemouth became a ": null
    },
    {
        "municipal borough": "municipal borough"
    },
    {
        " in 42 and a ": null
    },
    {
        "county borough": "county borough"
    },
    {
        " in 42     As Bournemouths growth increased in the early 42th century, the town centre spawned theatres, cafés, two ": null
    },
    {
        "art deco": "art deco"
    },
    {
        " cinemas and more hotels. Other new buildings included the war memorial in 42 and the Bournemouth Pavilion, the towns concert hall and grand theatre, finished in 42     The town escaped heavy bombing during the Second World War, but the sea front incurred great damage when it was fortified against invasion. Emery The cast iron lampposts and benches along the front were removed and melted down for munitions, as was much of the superstructure from both Bournemouth and ": null
    },
    {
        "Boscombe": "boscombe"
    },
    {
        " piers before they were breached to prevent their use by enemy ships. The large amounts of barbed wire and anti-tank obstacles along the beach, and the mines at the foot of the ": null
    },
    {
        "chine": "chine"
    },
    {
        "s, took two years to remove when peace was finally achieved. Emery        The ": null
    },
    {
        "Royal National Lifeboat Institution": "royal national lifeboat institution"
    },
    {
        " stationed an inshore ": null
    },
    {
        "lifeboat": "lifeboat"
    },
    {
        " at Bournemouth between 42 and 42 Coverage for the area has otherwise been provided from ": null
    },
    {
        "Poole Lifeboat Station": "poole lifeboat station"
    },
    {
        ".  The Bournemouth International Centre , a large conference and exhibition centre, was constructed near the seafront in 42 Ashley and Ashley and in the following year Bournemouth became the first town in the United Kingdom to introduce and use ": null
    },
    {
        "CCTV": "closed-circuit television"
    },
    {
        " cameras for public street-based surveillance.     In 42 the ": null
    },
    {
        "IRA": "provisional irish republican army"
    },
    {
        " orchestrated a ": null
    },
    {
        "terrorist attack in the town centre": "1993 bournemouth bombing"
    },
    {
        ". The only injuries sustained were minor ones but over £42 million in damage was caused.      The Waterfront complex, which was intended to hold an IMAX cinema, was constructed on the seafront in 42  The  concrete and smoked glass building featured a wavy roof design, but was despised by residents and visitors alike because it blocked views of the bay and the ": null
    },
    {
        "Isle of Purbeck": "isle of purbeck"
    },
    {
        ".  In 42 it was voted the most hated building in England in a 42-person poll conducted by the ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " programme  Demolition , and was pulled down in spring 42  The site is now used as an outdoor event arena. The council has recently completed a larger redevelopment of the site and adjoining council land.     In 42 Bournemouth was unsuccessful in its bid for ": null
    },
    {
        "city status": "city status"
    },
    {
        ", losing out to ": null
    },
    {
        "Chelmsford": "chelmsford"
    },
    {
        " in competition with 42 other towns to commemorate ": null
    },
    {
        "Queen Elizabeth II": "queen elizabeth ii"
    },
    {
        "s ": null
    },
    {
        "Diamond Jubilee": "diamond jubilee of elizabeth ii"
    },
    {
        ".           ": null
    },
    {
        "Historically": "historic counties of england"
    },
    {
        " Bournemouth was part of ": null
    },
    {
        "Hampshire": "hampshire"
    },
    {
        ", with neighbouring Poole, just to the west of the border, in Dorset. At the time of the ": null
    },
    {
        "42 local government re-organisation": "local government act 1972"
    },
    {
        ", it was considered desirable that the whole of the ": null
    },
    {
        "Poole/Bournemouth urban area": "south east dorset conurbation"
    },
    {
        " should be part of the same county. Bournemouth therefore became part of the ": null
    },
    {
        "non-metropolitan county": "non-metropolitan county"
    },
    {
        " of Dorset on 42 April 42 On 42 April 42 Bournemouth became a ": null
    },
    {
        "unitary authority": "unitary authority"
    },
    {
        ", independent from Dorset ": null
    },
    {
        "County Council": "county council"
    },
    {
        ". As from April 42 the nine councils of Dorset were merged into two and Bournemouth became part of a unitary authority with Christchurch and Poole .  For the purposes of ": null
    },
    {
        "the Lieutenancy": "lord lieutenant"
    },
    {
        " it remains part of the ": null
    },
    {
        "ceremonial county": "ceremonial counties of england"
    },
    {
        " of Dorset.     For local elections the district is divided into 42 wards,  and the ": null
    },
    {
        "Bournemouth Borough Council": "bournemouth borough council"
    },
    {
        " is elected every four years.  In the 42 local elections the Conservatives held overall control, winning 42 of the available 42 seats.  The Council elects a mayor and deputy mayor annually.  The Mayor of Bournemouth for 4242 is Councillor Derek Borthwick.    Bournemouth is represented by two parliamentary constituencies in the House of Commons; ": null
    },
    {
        "Bournemouth East": "bournemouth east"
    },
    {
        " and ": null
    },
    {
        "Bournemouth West": "bournemouth west"
    },
    {
        ".  In the 42 general election, the former was held for the Conservatives by Tobias Elwood with 42% of the vote, while the latter was also held for the Conservatives by Connor Burns with 42%. However, the seats saw some of the largest increases in Labour vote share in the country, with increases of over 42% in each.            Bournemouth is about  southwest of London. Straight line distances from: The borough borders the neighbouring boroughs of Poole and Christchurch to the west and east respectively and the ": null
    },
    {
        "East Dorset": "east dorset"
    },
    {
        " District to the north. ": null
    },
    {
        "Poole Bay": "poole bay"
    },
    {
        " lies to the South.   The ": null
    },
    {
        "River Stour": "river stour, dorset"
    },
    {
        " forms a natural boundary to the north and east, terminating at ": null
    },
    {
        "Christchurch Harbour": "christchurch harbour"
    },
    {
        ";  while the ": null
    },
    {
        "River Bourne": "river bourne, dorset"
    },
    {
        " rises in Poole and flows through the middle of Bournemouth town centre, into the English Channel.  The towns of Poole, Bournemouth and Christchurch form the ": null
    },
    {
        "South East Dorset conurbation": "south east dorset conurbation"
    },
    {
        " with a combined population of over 42. Bournemouth is both a retail and commercial centre.  Areas within Bournemouth include: ": null
    },
    {
        "Boscombe": "boscombe"
    },
    {
        ", ": null
    },
    {
        "Kinson": "kinson"
    },
    {
        ", ": null
    },
    {
        "Southbourne": "southbourne, dorset"
    },
    {
        ", ": null
    },
    {
        "Springbourne": "springbourne"
    },
    {
        ", ": null
    },
    {
        "Throop": "throop, dorset"
    },
    {
        ", ": null
    },
    {
        "Westbourne": "westbourne, dorset"
    },
    {
        " and ": null
    },
    {
        "Winton.": "winton, dorset"
    },
    {
        "      The areas geology has little variety, comprising almost entirely of ": null
    },
    {
        "Eocene": "eocene"
    },
    {
        " clays which, prior to urbanisation, supported a heathland environment.   Patches of the original heath still remain, notably Turbary Common, a  site, much of which is designated a ": null
    },
    {
        "Site of Special Scientific Interest": "site of special scientific interest"
    },
    {
        ".  This heathland habitat is home to all six species of native reptile, the ": null
    },
    {
        "Dartford warbler": "dartford warbler"
    },
    {
        " and some important flora such as ": null
    },
    {
        "sundew": "drosera"
    },
    {
        " and ": null
    },
    {
        "bog asphodel": "narthecium ossifragum"
    },
    {
        ". Small populations of ": null
    },
    {
        "Exmoor pony": "exmoor pony"
    },
    {
        " and ": null
    },
    {
        "Shetland cattle": "shetland"
    },
    {
        " help to maintain the area.    Bournemouth is directly north of ": null
    },
    {
        "Old Harry Rocks": "old harry rocks"
    },
    {
        ", the easternmost end of the ": null
    },
    {
        "Jurassic Coast": "jurassic coast"
    },
    {
        ",  of coastline designated a ": null
    },
    {
        "World Heritage Site": "world heritage site"
    },
    {
        " in 42  Bournemouths own coastline stretches from Sandbanks to Christchurch Harbour and comprises mainly sandy beaches backed by gravel and sandy clay cliffs. These cliffs are cut by a number of ": null
    },
    {
        "chine": "chine"
    },
    {
        "s which provide natural access to the shore.  At the easternmost point lies Hengistbury Head, a narrow peninsula that forms the southern shore of ": null
    },
    {
        "Christchurch Harbour": "christchurch harbour"
    },
    {
        ". It is a local nature reserve and the site of a ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " settlement.         Like all of the UK, Bournemouth has a ": null
    },
    {
        "temperate": "temperate climate"
    },
    {
        " oceanic climate": "oceanic climate"
    },
    {
        " with moderate variation in annual and daily temperatures, mild summers, and cool winters. From 42 to 42 the annual mean temperature was .  The warmest months are July and August, which have an average temperature range of , while the coolest months are January and February, which have an average temperature range of . Average rainfall in Bournemouth is around  annually, well below the national average of . It records both higher and lower temperatures than would be expected for its coastal location.  Since 42 temperature extremes as measured at Bournemouth Hurn Airport have ranged from  in August 42  down to  in January 42  The lowest temperature recorded in recent years was  in December 42  The February record high was broken in 42 with a new record temperature of 42C.        42 ": null
    }
]