[
    {
        "              Brabham  is the common name for Motor Racing Developments Ltd., a British ": null
    },
    {
        "racing car": "Race Car"
    },
    {
        " manufacturer and ": null
    },
    {
        "Formula One": "Formula One"
    },
    {
        " racing team. Founded in 1960 by two Australians, driver ": null
    },
    {
        "Jack Brabham": "Jack Brabham"
    },
    {
        " and designer ": null
    },
    {
        "Ron Tauranac": "Ron Tauranac"
    },
    {
        ", the team won four ": null
    },
    {
        "Drivers": "List Of Formula One World Drivers Champions"
    },
    {
        " and two ": null
    },
    {
        "Constructors": "List Of Formula One World Constructors Champions"
    },
    {
        " World Championships in its 30-year Formula One history. Jack Brabhams 1966 ": null
    },
    {
        "FIA": "Fédération Internationale De Lautomobile"
    },
    {
        " Drivers Championship remains the only such achievement using a car bearing the drivers own name.     In the 1960s, Brabham was the worlds largest manufacturer of ": null
    },
    {
        "open-wheel racing cars": "Open Wheel Car"
    },
    {
        " for sale to customer teams; by 1970 it had built more than 500 cars. During this period, teams using Brabham cars won championships in ": null
    },
    {
        "Formula Two": "Formula Two"
    },
    {
        " and ": null
    },
    {
        "Formula Three": "Formula Three"
    },
    {
        ". Brabham cars also competed in the ": null
    },
    {
        "Indianapolis 500": "Indianapolis 500"
    },
    {
        " and in ": null
    },
    {
        "Formula 5000": "Formula 5000"
    },
    {
        " racing. In the 1970s and 1980s, Brabham introduced such innovations as in-race refuelling, carbon brakes, and ": null
    },
    {
        "hydropneumatic suspension": "Hydropneumatic Suspension"
    },
    {
        ". Its unique ": null
    },
    {
        "Gordon Murray": "Gordon Murray"
    },
    {
        "-designed ": null
    },
    {
        "fan car": "Fan Car"
    },
    {
        " won its only race before being withdrawn.     The team won two more Formula One Drivers Championships in the 1980s with Brazilian ": null
    },
    {
        "Nelson Piquet": "Nelson Piquet"
    },
    {
        ". He won his first championship in  in the ": null
    },
    {
        "ground effect": "Ground Effect"
    },
    {
        " BT49": "Brabham Bt49"
    },
    {
        "-": null
    },
    {
        "Ford": "Cosworth Dfv"
    },
    {
        ", and became the first to win a Drivers Championship with a ": null
    },
    {
        "turbocharged": "Turbocharger"
    },
    {
        " car, in . In 1983 the ": null
    },
    {
        "Brabham BT52": "Brabham Bt52"
    },
    {
        ", driven by Piquet and Italian ": null
    },
    {
        "Riccardo Patrese": "Riccardo Patrese"
    },
    {
        ", was powered by the ": null
    },
    {
        "BMW M12": "Bmw M12"
    },
    {
        " straight-4": "Straight-4"
    },
    {
        " engine, and powered Brabham to four of the teams 35 Grand Prix victories.     British businessman ": null
    },
    {
        "Bernie Ecclestone": "Bernie Ecclestone"
    },
    {
        " owned Brabham during most of the 1970s and 1980s, and later became responsible for administering the commercial aspects of Formula One. Ecclestone sold the team in 1988. Its last owner was the Middlebridge Group, a Japanese engineering firm. Midway through the ": null
    },
    {
        "1992 season": "1992 Formula One Season"
    },
    {
        ", the team collapsed financially as Middlebridge was unable to make repayments against loans provided by Landhurst Leasing. The case was investigated by the United Kingdom ": null
    },
    {
        "Serious Fraud Office": "Serious Fraud Office"
    },
    {
        ". In 2009, an unsuccessful attempt was made by a German organisation to enter the ": null
    },
    {
        "2010 Formula One season": "2010 Formula One Season"
    },
    {
        " using the Brabham name.          The Brabham team was founded by ": null
    },
    {
        "Jack Brabham": "Jack Brabham"
    },
    {
        " and ": null
    },
    {
        "Ron Tauranac": "Ron Tauranac"
    },
    {
        ", who met in 1951 while both were successfully building and racing cars in their native Australia. Brabham was the more successful driver and went to the United Kingdom in 1955 to further his racing career. There he started driving for the ": null
    },
    {
        "Cooper Car Company": "Cooper Car Company"
    },
    {
        " works team and by 1958 had progressed with them to Formula One, the highest category of ": null
    },
    {
        "open-wheel racing": "Open-Wheel Racing"
    },
    {
        " defined by the ": null
    },
    {
        "Fédération Internationale de lAutomobile": "Fédération Internationale De Lautomobile"
    },
    {
        " , motor sports world governing body. FIA has been used throughout this article to refer to the motor sports governing body. Until 1978 motor sport was governed directly by the Commission Sportive Internationale and from 1978 by the Fédération Internationale du Sport Automobile , both subsidiary bodies of the FIA. In 1992 the FIA subsumed FISA and its governing role. In ": null
    },
    {
        "1959": "1959 Formula One Season"
    },
    {
        " and ": null
    },
    {
        "1960": "1960 Formula One Season"
    },
    {
        ", Brabham won the Formula One World Drivers Championship in Coopers revolutionary ": null
    },
    {
        "mid-engine": "Mid-Engine"
    },
    {
        "d cars. Henry pp. 17–19     Despite their innovation of putting the engine behind the driver, the Coopers and their chief designer, ": null
    },
    {
        "Owen Maddock": "Owen Maddock"
    },
    {
        ", were generally resistant to developing their cars. Brabham pushed for further advances, and played a significant role in developing Coopers highly successful 1960 T53 lowline car, with input from his friend Tauranac. Lawrence pp. 18, 22. Brabham had consulted Tauranac by letter on technical matters since arriving in the UK. He used a gear cluster designed by Tauranac for several years and Tauranac also advised on the suspension geometry of the Cooper T53 lowline car. Brabham was confident he could do better than Cooper, and in late 1959 he asked Tauranac to come to the UK and work with him, initially producing upgrade kits for ": null
    },
    {
        "Sunbeam Rapier": "Sunbeam Rapier"
    },
    {
        " and ": null
    },
    {
        "Triumph Herald": "Triumph Herald"
    },
    {
        " road cars at his car dealership, Jack Brabham Motors, but with the long-term aim of designing racing cars. Lawrence p. 22–4. Jack had already tried to buy Cooper in association with fellow-driver ": null
    },
    {
        "Roy Salvadori": "Roy Salvadori"
    },
    {
        " Brabham describes Tauranac as absolutely the only bloke Id have gone into partnership with . Brabham, Nye p. 140 Later, Brabham offered a Coventry-Climax FWE-engined version of the Herald, with  and uprated suspension to match the extra power.      To meet that aim, Brabham and Tauranac set up Motor Racing Developments Ltd. , deliberately avoiding the use of either mans name. The new company would compete with Cooper in the market for customer racing cars. As Brabham was still employed by Cooper, Tauranac produced the first MRD car, for the entry level ": null
    },
    {
        "Formula Junior": "Formula Junior"
    },
    {
        " class, in secrecy. Unveiled in the summer of 1961, the MRD was soon renamed. Motoring journalist ": null
    },
    {
        "Jabby Crombac": "Gérard Crombac"
    },
    {
        " pointed out that way a Frenchman pronounces those initials—written phonetically, em air day—sounded perilously like the French word...  merde . Scarlett p. 43. Although compare pronunciation with the related verb ": null
    },
    {
        "emmerder": "Wiktionary:Emmerder"
    },
    {
        ". This is the story as recalled by both Ron Tauranac and Brabham mechanic Michael Scarlett. The British journalist Alan Brinton has also been credited with pointing out this unfortunate fact to Brabham. See Drackett p. 21. Gavin Youl achieved a second-place finish at Goodwood and another at ": null
    },
    {
        "Mallory Park": "Mallory Park"
    },
    {
        " in the MRD-Ford.  The cars were subsequently known as Brabhams, with type numbers starting with BT for Brabham Tauranac . Drackett p. 21. The first prototype FJunior car therefore became the BT1 and its production version the BT2.     By the ": null
    },
    {
        "1961 Formula One season": "1961 Formula One Season"
    },
    {
        ", the ": null
    },
    {
        "Lotus": "Team Lotus"
    },
    {
        " and ": null
    },
    {
        "Ferrari": "Scuderia Ferrari"
    },
    {
        " teams had developed the mid-engined approach further than Cooper. Brabham had a poor season, scoring only four points, and—having run his own private Coopers in non-championship events during 1961—left the company in 1962 to drive for his own team: the Brabham Racing Organisation, using cars built by Motor Racing Developments. Lawrence p. 31 Brabham, Nye pp. 14, 145–9. Brabhams and Tauranacs accounts differ on whether the BRO was formed for the purpose of F1, or was already in existence. The team was based at ": null
    },
    {
        "Chessington": "Chessington"
    },
    {
        ", England  and held the British ": null
    },
    {
        "licence": "List Of Formula One Constructorsteams Nationality"
    },
    {
        ".               Motor Racing Developments initially concentrated on making money by building cars for sale to customers in lower formulae, so the new car for the Formula One team was not ready until partway through the ": null
    },
    {
        "1962 Formula One season": "1962 Formula One Season"
    },
    {
        ". The Brabham Racing Organisation started the year fielding a customer ": null
    },
    {
        "Lotus": "Team Lotus"
    },
    {
        " chassis, which was delivered at 3:00 am in order to keep it a secret. Brabham took two points finishes in Lotuses, before the turquoise-": null
    },
    {
        "liveried": "Livery"
    },
    {
        " Brabham BT3 car made its debut at the ": null
    },
    {
        "1962 German Grand Prix": "1962 German Grand Prix"
    },
    {
        ". It retired with a ": null
    },
    {
        "throttle": "Throttle"
    },
    {
        " problem after 9 of the 15 laps, but went on to take a pair of fourth places at the end of the season. Henry pp. 21–22. Brabham bought a new spaceframe Lotus 24, but had to use a 1961-vintage Lotus 21 in the early races after a workshop fire. Team Lotus reserved the monocoque Lotus 25 for their own use that season.        From the ": null
    },
    {
        "1963 season": "1963 Formula One Season"
    },
    {
        ", Brabham was partnered by American driver ": null
    },
    {
        "Dan Gurney": "Dan Gurney"
    },
    {
        ", the pair now running in Australias ": null
    },
    {
        "racing colours": "List Of International Auto Racing Colors"
    },
    {
        " of green and gold. Brabham, Nye p. 147 Brabham took the teams first win at the non-championship ": null
    },
    {
        "Solitude Grand Prix": "Solituderennen"
    },
    {
        " in 1963. Henry p. 28 Gurney took the ": null
    },
    {
        "marques": "Marque"
    },
    {
        "first two wins in the world championship, at the 1964 ": null
    },
    {
        "French": "1964 French Grand Prix"
    },
    {
        " and ": null
    },
    {
        "Mexican": "1964 Mexican Grand Prix"
    },
    {
        " Grands Prix. Brabham works and customer cars took another three non-championship wins during the ": null
    },
    {
        "1964 season": "1964 Formula One Season"
    },
    {
        ". Henry pp. 35–41 The ": null
    },
    {
        "1965 season": "1965 Formula One Season"
    },
    {
        " was less successful, with no championship wins. Brabham finished third or fourth in the Constructors Championship for three years running, but poor reliability marred promising performances on several occasions. Motor sport authors Mike Lawrence and David Hodges have said that a lack of resources may have cost the team results, a view echoed by Tauranac. Tauranac says that he feels a third mechanic would have reduced the reliability problems. Lawrence himself notes that If only Jack had been prepared to spend a little more money, the results could have been so much better. Hodges p. 32 notes Economy was a watchword. It was this attitude, perhaps, which cost some races.     The FIA doubled the Formula One engine capacity limit to 3  litres for the ": null
    },
    {
        "1966 season": "1966 Formula One Season"
    },
    {
        " and suitable engines were scarce. Brabham used engines from Australian engineering firm ": null
    },
    {
        "Repco": "Repco"
    },
    {
        ", which had never produced a Formula One engine before, based on aluminium V8 ": null
    },
    {
        "engine blocks": "Engine Block"
    },
    {
        "from the defunct American ": null
    },
    {
        "Oldsmobile": "Oldsmobile"
    },
    {
        " F85 road car project, and other off-the-shelf parts. Lawrence pp. 51–52 Consulting and design engineer ": null
    },
    {
        "Phil Irving": "Phil Irving"
    },
    {
        "  was the project engineer responsible for producing the initial version of the engine. Few expected the Brabham-Repcos to be competitive, Unique p. 43. The team was the only one not contracted by ": null
    },
    {
        "John Frankenheimer": "John Frankenheimer"
    },
    {
        " for the shooting of the film  Grand Prix  at world championship races that year. but the light and reliable cars ran at the front from the start of the season. At the ": null
    },
    {
        "French Grand Prix": "1966 French Grand Prix"
    },
    {
        " at ": null
    },
    {
        "Reims-Gueux": "Reims-Gueux"
    },
    {
        ", Brabham became the first man to win a Formula One world championship race in a car bearing his own name. Only his former teammate, ": null
    },
    {
        "Bruce McLaren": "Bruce Mclaren"
    },
    {
        ", has since matched the achievement. It was the first in a run of four straight wins for the Australian veteran. Brabham won his third title in 1966, becoming the only driver to win the Formula One World Championship in a car carrying his own name . In ": null
    },
    {
        "1967": "1967 Formula One Season"
    },
    {
        ", the title went to Brabhams teammate, New Zealander ": null
    },
    {
        "Denny Hulme": "Denny Hulme"
    },
    {
        ". Hulme had better reliability through the year, possibly due to Brabhams desire to try new parts first. Lawrence p. 92. Hulme, Tauranac and Frank Hallam, Repco-Brabhams chief engineer, all shared this view. The Brabham team took the Constructors World Championship in both years. Fearnley pp. 34–40     For ": null
    },
    {
        "1968": "1968 Formula One Season"
    },
    {
        ", Austrian ": null
    },
    {
        "Jochen Rindt": "Jochen Rindt"
    },
    {
        " replaced Hulme, who had left to join ": null
    },
    {
        "McLaren": "Mclaren"
    },
    {
        ". Repco produced a more powerful version of their V8 to maintain competitiveness against Fords new ": null
    },
    {
        "Cosworth DFV": "Cosworth Dfv"
    },
    {
        ", but it proved very unreliable. Slow communications between the UK and Australia had always made identifying and correcting problems very difficult. The car was fast—Rindt set ": null
    },
    {
        "pole position": "Pole Position"
    },
    {
        " twice during the season—but Brabham and Rindt finished only three races between them, and ended the year with only ten points. Fearnley p. 41        Although Brabham bought Cosworth DFV engines for the ": null
    },
    {
        "1969 season": "1969 Formula One Season"
    },
    {
        ", Rindt left to join Lotus. His replacement, ": null
    },
    {
        "Jacky Ickx": "Jacky Ickx"
    },
    {
        ", had a strong second half to the season, winning in ": null
    },
    {
        "Germany": "1969 German Grand Prix"
    },
    {
        " and ": null
    },
    {
        "Canada": "1969 Canadian Grand Prix"
    },
    {
        ", after Brabham was sidelined by a testing accident. Henry p. 85 Ickx finished second in the Drivers Championship, with 37  points to ": null
    },
    {
        "Jackie Stewarts": "Jackie Stewart"
    },
    {
        "63. Brabham himself took a couple of pole positions and two top-3 finishes, but did not finish half the races. The team were second in the Constructors Championship, aided by second places at ": null
    },
    {
        "Monaco": "1969 Monaco Grand Prix"
    },
    {
        " and ": null
    },
    {
        "Watkins Glen": "1969 United States Grand Prix"
    },
    {
        " scored by ": null
    },
    {
        "Piers Courage": "Piers Courage"
    },
    {
        ", driving a Brabham for the ": null
    },
    {
        "Frank Williams Racing Cars": "Frank Williams Racing Cars"
    },
    {
        " privateer squad. Henry pp. 79–80     Brabham intended to retire at the end of the 1969 season and sold his share in the team to Tauranac. However, Rindts late decision to remain with Lotus meant that Brabham drove for another year. Lawrence p. 109 & Brabham, Nye pp. 230–231. He was therefore technically a team employee in his final season. He took his last win in the opening race of the ": null
    },
    {
        "1970 season": "1970 Formula One Season"
    },
    {
        " and was competitive throughout the year, although mechanical failures blunted his challenge. Henry p. 93 Aided by number-two driver ": null
    },
    {
        "Rolf Stommelen": "Rolf Stommelen"
    },
    {
        ", the team came fourth in the Constructors Championship.       Tauranac signed double world champion ": null
    },
    {
        "Graham Hill": "Graham Hill"
    },
    {
        " and young Australian ": null
    },
    {
        "Tim Schenken": "Tim Schenken"
    },
    {
        " to drive for the ": null
    },
    {
        "1971 season": "1971 Formula One Season"
    },
    {
        ". Tauranac designed the unusual lobster claw ": null
    },
    {
        "BT34": "Brabham Bt34"
    },
    {
        ", featuring twin ": null
    },
    {
        "radiators": "Radiator"
    },
    {
        "mounted ahead of the front wheels, a single example of which was built for Hill. Although Hill, no longer a front-runner since his 1969 accident, took his final Formula One win in the non-championship ": null
    },
    {
        "BRDC International Trophy": "Brdc International Trophy"
    },
    {
        " at ": null
    },
    {
        "Silverstone": "Silverstone Circuit"
    },
    {
        ", Henry pp. 114–17 the team scored only seven  championship points.     Tauranac, an engineer at heart, started to feel his Formula One budget of around £100,000 was a gamble he could not afford to take on his own and began to look around for an experienced business partner. Lawrence p. 113 He sold the company for £100,000 at the end of 1971 to British businessman ": null
    },
    {
        "Bernie Ecclestone": "Bernie Ecclestone"
    },
    {
        ", Rindts former manager and erstwhile owner of the ": null
    },
    {
        "Connaught": "Connaught Engineering"
    },
    {
        " team. Tauranac stayed on to design the cars and run the factory. Lawrence p. 116            Tauranac left Brabham early in the ": null
    },
    {
        "1972 season": "1972 Formula One Season"
    },
    {
        " after Ecclestone changed the way the company was organised without consulting him. Ecclestone has since said In retrospect, the relationship was never going to work , noting that both take the view: Please be reasonable, do it my way . Lawrence. pp. 116–118 The highlights of an aimless year, during which the team ran three different models, were pole position for Argentinian driver ": null
    },
    {
        "Carlos Reutemann": "Carlos Reutemann"
    },
    {
        " at his home race at ": null
    },
    {
        "Buenos Aires": "Buenos Aires"
    },
    {
        " and a victory in the non-championship Interlagos Grand Prix. For the ": null
    },
    {
        "1973 season": "1973 Formula One Season"
    },
    {
        ", Ecclestone promoted the young South African engineer ": null
    },
    {
        "Gordon Murray": "Gordon Murray"
    },
    {
        " to chief designer and moved Herbie Blash from the Formula Two programme to become the Formula One team manager. Both would remain with the team for the next 15 years. For 1973, Murray produced the triangular cross-section BT42, with which Reutemann scored two podium finishes and finished seventh in the Drivers Championship.     In the ": null
    },
    {
        "1974 season": "1974 Formula One Season"
    },
    {
        ", Reutemann took the first three victories of his Formula One career, and Brabhams first since 1970. The team finished a close fifth in the Constructors Championship, fielding the much more competitive ": null
    },
    {
        "BT44s": "Brabham Bt44"
    },
    {
        ". After a strong finish to the 1974 season, many observers felt the team were favourites to win the ": null
    },
    {
        "1975 title": "1975 Formula One Season"
    },
    {
        ". The year started well, with a first win for Brazilian driver ": null
    },
    {
        "Carlos Pace": "José Carlos Pace"
    },
    {
        " at the ": null
    },
    {
        "Interlagos": "Autódromo José Carlos Pace"
    },
    {
        " circuit in his native ": null
    },
    {
        "São Paulo": "São Paulo"
    },
    {
        ". However, as the season progressed, tyre wear frequently slowed the cars in races. Gill p. 103 Pace took another two podiums and finished sixth in the championship; while Reutemann had five podium finishes, including a dominant win in the ": null
    },
    {
        "1975 German Grand Prix": "1975 German Grand Prix"
    },
    {
        ", and finished third in the Drivers Championship. The team likewise ranked third in the Constructors Championship at the end of the year.     While rival teams Lotus and McLaren relied on the Cosworth DFV engine from the late 1960s to the early 1980s, Ecclestone sought a competitive advantage by investigating other options. Despite the success of Murrays Cosworth-powered cars, Ecclestone signed a deal with Italian motor manufacturer ": null
    },
    {
        "Alfa Romeo": "Alfa Romeo In Formula One"
    },
    {
        " to use their large and powerful ": null
    },
    {
        "flat-12": "Flat-12"
    },
    {
        " engine from the ": null
    },
    {
        "1976 season": "1976 Formula One Season"
    },
    {
        ". The engines were free, but they rendered the new ": null
    },
    {
        "BT45s": "Brabham Bt45"
    },
    {
        ", now in red ": null
    },
    {
        "Martini Racing": "Martini Racing"
    },
    {
        " livery, unreliable and overweight. Henry pp. 159–161 The 1976 and ": null
    },
    {
        "1977 seasons": "1977 Formula One Season"
    },
    {
        " saw Brabham fall toward the back of the field again. Reutemann negotiated a release from his contract before the end of the 1976 season and signed with ": null
    },
    {
        "Ferrari": "Scuderia Ferrari"
    },
    {
        ". Ulsterman ": null
    },
    {
        "John Watson": "John Watson"
    },
    {
        " replaced him at Brabham for 1977. Watson lost near certain victory in the ": null
    },
    {
        "French Grand Prix": "1977 French Grand Prix"
    },
    {
        " of that year when his car ran low on fuel on the last lap and was passed by Mario Andrettis Lotus, with Watsons second place being the teams best result of the season. The car often showed at the head of races, but the unreliability of the Alfa Romeo engine was a major problem. The team lost Pace early in the 1977 season when he died in a ": null
    },
    {
        "light aircraft": "Light Aircraft"
    },
    {
        " accident. Henry pp. 164, 167          For the ": null
    },
    {
        "1978 season": "1978 Formula One Season"
    },
    {
        ", Murrays ": null
    },
    {
        "BT46": "Brabham Bt46"
    },
    {
        " featured several new technologies to overcome the weight and packaging difficulties caused by the ": null
    },
    {
        "Alfa Romeo": "Alfa Romeo In Formula One"
    },
    {
        " engines. Ecclestone signed then two-time Formula One world champion ": null
    },
    {
        "Niki Lauda": "Niki Lauda"
    },
    {
        " from Ferrari through a deal with Italian dairy products company ": null
    },
    {
        "Parmalat": "Parmalat"
    },
    {
        " which met the cost of Lauda ending his Ferrari contract and made up his salary to the £200,000 Ferrari was offering. 1978 was the year of the dominant ": null
    },
    {
        "Lotus 79": "Lotus 79"
    },
    {
        " wing car , which used ": null
    },
    {
        "aerodynamic": "Aerodynamic"
    },
    {
        " ground effect": "Ground Effect In Cars"
    },
    {
        " to stick to the track when cornering, but Lauda won two races in the BT46, one with the controversial B or ": null
    },
    {
        "fan car": "Brabham Bt46Brabham Bt46B .E2.80.93 The .22Fan Car.22"
    },
    {
        " version. Details of BT46 and 1978 season: Henry p. 171, pp. 179–189   Laudas move and salary: Lovell p. 98     The partnership with Alfa Romeo ended during the ": null
    },
    {
        "1979 season": "1979 Formula One Season"
    },
    {
        ", the teams first with young Brazilian driver ": null
    },
    {
        "Nelson Piquet": "Nelson Piquet"
    },
    {
        ". Murray designed the full-ground effect ": null
    },
    {
        "BT48": "Brabham Bt48"
    },
    {
        " around a rapidly developed new Alfa Romeo V12 engine and incorporated an effective carbon-carbon braking system—": null
    },
    {
        "a technology Brabham pioneered in 1976": "Technical Innovation"
    },
    {
        ". However, unexpected movement of the cars aerodynamic ": null
    },
    {
        "centre of pressure": "Center Of Pressure"
    },
    {
        " made its handling unpredictable and the new engine was unreliable. The team dropped to eighth in the Constructors Championship by the end of the season. Henry p. 191 Alfa Romeo started testing their own Formula One car during the season, prompting Ecclestone to revert to Cosworth DFV engines, a move Murray described as being like having a holiday . Henry pp. 213, 215 The new, lighter, Cosworth-powered ": null
    },
    {
        "BT49": "Brabham Bt49"
    },
    {
        " was introduced before the end of the year at the ": null
    },
    {
        "Canadian Grand Prix": "1979 Canadian Grand Prix"
    },
    {
        "; where after practice Lauda announced his immediate retirement from driving, later saying that he was no longer getting any pleasure from driving round and round in circles . Henry p. 216          The team used the BT49 over four seasons. In the ": null
    },
    {
        "1980 season": "1980 Formula One Season"
    },
    {
        " Piquet scored three wins and the team took third in the Constructors Championship with Piquet second in the Drivers Championship. This season saw the introduction of the blue and white livery that the cars would wear through several changes of sponsor, until the teams demise in 1992. With a better understanding of ground effect, the team further developed the BT49C for the ": null
    },
    {
        "1981 season": "1981 Formula One Season"
    },
    {
        ", incorporating a hydropneumatic suspension system to avoid ": null
    },
    {
        "ride height": "Ride Height"
    },
    {
        " limitations intended to reduce downforce. Piquet, who had developed a close working relationship with Murray, Roebuck p. 114 took the drivers title with three wins, albeit ": null
    },
    {
        "amid accusations of cheating": "Controversy"
    },
    {
        ". The team finished second in the Constructors Championship, behind the ": null
    },
    {
        "Williams team": "Williamsf1"
    },
    {
        ".     ": null
    },
    {
        "Renault": "Renault F1"
    },
    {
        " had introduced ": null
    },
    {
        "turbocharged": "Turbocharged"
    },
    {
        " engines to Formula One in 1977. Brabham had tested a ": null
    },
    {
        "BMW": "Bmw In Formula One"
    },
    {
        " four-cylinder ": null
    },
    {
        "M12": "Bmw M12"
    },
    {
        " turbocharged engine in the summer of 1981. For the ": null
    },
    {
        "1982 season": "1982 Formula One Season"
    },
    {
        " the team designed a new car, the ": null
    },
    {
        "BT50": "Brabham Bt50"
    },
    {
        ", around the BMW engine which, like the Repco engine 16 years before, was based on a road car engine block, the ": null
    },
    {
        "BMW M10": "Bmw M10"
    },
    {
        ". Brabham continued to run the Cosworth-powered BT49D in the early part of the season while reliability and driveability issues with the BMW units were resolved. The relationship came close to ending, with the German manufacturer insisting that Brabham use their engine. The turbo car took its first win at the ": null
    },
    {
        "Canadian Grand Prix": "1982 Canadian Grand Prix"
    },
    {
        ". In the Constructors Championship, the team finished fifth, the drivers ": null
    },
    {
        "Riccardo Patrese": "Riccardo Patrese"
    },
    {
        ", who scored the last win of the Brabham-Ford combination in the ": null
    },
    {
        "Monaco Grand Prix": "1982 Monaco Grand Prix"
    },
    {
        ", 10th and World Champion Piquet a mere 11th in the Drivers Championship. In the ": null
    },
    {
        "1983 season": "1983 Formula One Season"
    },
    {
        ", Piquet took the championship lead from ": null
    },
    {
        "Renaults": "Renault F1"
    },
    {
        " Alain Prost": "Alain Prost"
    },
    {
        " at the last race of the year, the ": null
    },
    {
        "South African Grand Prix": "1983 South African Grand Prix"
    },
    {
        " to become the first driver to win the Formula One Drivers World Championship with a turbo-powered car. The team did not win the Constructors Championship in either 1981 or 1983, despite Piquets success. ": null
    },
    {
        "Riccardo Patrese": "Riccardo Patrese"
    },
    {
        " was the only driver other than Piquet to win a race for Brabham in this period—the drivers in the second car contributed only a fraction of the teams points in each of these championship seasons. Patrese finished ninth in the Drivers Championship with 13 points, dropping the team behind Ferrari and Renault to third in the Constructors Championship.          Piquet took the teams last wins: two in 1984 by winning the seventh and eighth races of that season, the ": null
    },
    {
        "Canadian Grand Prix": "1984 Canadian Grand Prix"
    },
    {
        " and the ": null
    },
    {
        "Detroit Grand Prix": "1984 Detroit Grand Prix"
    },
    {
        ", and one in 1985 by winning the ": null
    },
    {
        "French Grand Prix": "1985 French Grand Prix"
    },
    {
        ". He finished fifth in 1984 and a mere eighth in 1985 in the respective Drivers Championships. After seven years and two world championships, Piquet felt he was worth more than Ecclestones salary offer for 1986, and reluctantly left for the ": null
    },
    {
        "Williams": "Williamsf1"
    },
    {
        " team at the end of the season.     For the ": null
    },
    {
        "1986 season": "1986 Formula One Season"
    },
    {
        ", ": null
    },
    {
        "Riccardo Patrese": "Riccardo Patrese"
    },
    {
        " returned to Brabham, and was joined by ": null
    },
    {
        "Elio de Angelis": "Elio De Angelis"
    },
    {
        ". The season was a disaster for Brabham, scoring only two points. Murrays radical long and low ": null
    },
    {
        "BT55": "Brabham Bt55"
    },
    {
        ", with its BMW M12 engine tilted over to improve its aerodynamics and lower its centre of gravity, had severe reliability issues, and the Pirelli tyres performed poorly. De Angelis became the Formula One teams only fatality when he died in a testing accident at the ": null
    },
    {
        "Paul Ricard": "Circuit Paul Ricard"
    },
    {
        " circuit. ": null
    },
    {
        "Derek Warwick": "Derek Warwick"
    },
    {
        ", who replaced de Angelis, was close to scoring two points for fifth in the ": null
    },
    {
        "British Grand Prix": "1986 British Grand Prix"
    },
    {
        ", but a problem on the last lap dropped him out of the points.     In August, BMW after considering running their own in-house team, announced their departure from Formula One at the end of the season. Murray, who had largely taken over the running of the team as Ecclestone became more involved with his role at the ": null
    },
    {
        "Formula One Constructors Association": "Formula One Constructors Association"
    },
    {
        ", felt that the way the team had operated for 15 years broke down . He left Brabham in November to join ": null
    },
    {
        "McLaren": "Mclaren"
    },
    {
        ". Lovell pp. 161–164     Ecclestone held BMW to their contract for the ": null
    },
    {
        "1987 season": "1987 Formula One Season"
    },
    {
        ", but the German company would only supply the laydown engine. The upright units, around which Brabham had designed their new car, were sold for use by the ": null
    },
    {
        "Arrows": "Arrows"
    },
    {
        " team. Senior figures at Brabham, including Murray, have admitted that by this stage Ecclestone had lost interest in running the team. The 1987 season was only slightly more successful than the previous year—Patrese and de Cesaris scoring 10 points between them, including two third places at the ": null
    },
    {
        "Belgian Grand Prix": "1987 Belgian Grand Prix"
    },
    {
        " and the ": null
    },
    {
        "Mexican Grand Prix": "1987 Mexican Grand Prix"
    },
    {
        ". Unable to locate a suitable engine supplier, the team missed the FIA deadline for entry into the 1988 world championship and Ecclestone finally announced the teams withdrawal from Formula One at the Brazilian Grand Prix in April 1988. During the season-ending ": null
    },
    {
        "Australian Grand Prix": "1988 Australian Grand Prix"
    },
    {
        ", Ecclestone announced he had sold MRD to ": null
    },
    {
        "EuroBrun": "Eurobrun"
    },
    {
        " team owner ": null
    },
    {
        "Walter Brun": "Walter Brun"
    },
    {
        " for an unknown price.       Brun soon sold the team on, this time to Swiss financier Joachim Luhti, who brought it back into Formula One for the ": null
    },
    {
        "1989 season": "1989 Formula One Season"
    },
    {
        ". The new ": null
    },
    {
        "Brabham BT58": "Brabham Bt58"
    },
    {
        ", powered by a ": null
    },
    {
        "Judd": "Judd"
    },
    {
        " V8 engine": "V8 Engine"
    },
    {
        " , was produced for the ": null
    },
    {
        "1989 season": "1989 Formula One Season"
    },
    {
        ". Brabham, Nye p. 254. Engine Developments, the company which builds Judd engines, was a company Jack Brabham set up in partnership with John Judd after his retirement from driving in 1970. Judd had previously worked for Brabham on the Repco project. John Judd had based the engine, dubbed the CV, on a ": null
    },
    {
        "Honda": "Honda"
    },
    {
        " block and was something the Japanese company was looking at as it looked to move into the North American based ": null
    },
    {
        "IndyCar racing": "Champ Car"
    },
    {
        ". Italian driver ": null
    },
    {
        "Stefano Modena": "Stefano Modena"
    },
    {
        ", who had driven for the team in the ": null
    },
    {
        "1987 Australian Grand Prix": "1987 Australian Grand Prix"
    },
    {
        " in a one off drive for the team, drove alongside the more experienced ": null
    },
    {
        "Martin Brundle": "Martin Brundle"
    },
    {
        " who was returning to Formula One after spending 1988 winning the ": null
    },
    {
        "World Sportscar Championship": "1988 World Sportscar Championship Season"
    },
    {
        " for ": null
    },
    {
        "Jaguar": "Jaguar Cars"
    },
    {
        ". Modena took the teams last podium: a third place at the ": null
    },
    {
        "Monaco Grand Prix": "1989 Monaco Grand Prix"
    },
    {
        " . The team also failed to make the grid sometimes: Brundle failed to prequalify at the ": null
    },
    {
        "Canadian Grand Prix": "1989 Canadian Grand Prix"
    },
    {
        " and the ": null
    },
    {
        "French Grand Prix": "1989 French Grand Prix"
    },
    {
        ". The team finished 9th in the Constructors Championship at the end of the season.       After Luhtis arrest on tax fraud charges in mid-1989, Slevin, Gary  . Formula One Rejects. Retrieved 10 June 2009 several parties disputed the ownership of the team. Middlebridge Group Limited, a Japanese engineering firm owned by billionaire Koji Nakauchi, was already involved with established ": null
    },
    {
        "Formula 3000": "International Formula 3000"
    },
    {
        " team Middlebridge Racing and gained control of Brabham for the ": null
    },
    {
        "1990 season": "1990 Formula One Season"
    },
    {
        ". Herbie Blash had returned to run the team in 1989 and continued to do so in 1990. Middlebridge paid for its purchase using £1  million loaned to them by finance company Landhurst Leasing,  but the team remained underfunded and would only score a few more points finishes in its last three seasons. Jack Brabhams youngest son, ": null
    },
    {
        "David": "David Brabham"
    },
    {
        ", raced for the Formula One team for a short time in 1990 including the season-ending ": null
    },
    {
        "Australian Grand Prix": "1990 Australian Grand Prix"
    },
    {
        " . 1990 was a disastrous year, with Modenas fifth place in the season-opening ": null
    },
    {
        "United States Grand Prix": "1990 United States Grand Prix"
    },
    {
        " being the only top six finish. The team finished ninth in the Constructors Championship. Brundle and fellow Briton ": null
    },
    {
        "Mark Blundell": "Mark Blundell"
    },
    {
        ", scored only three points during the ": null
    },
    {
        "1991 season": "1991 Formula One Season"
    },
    {
        ". Due to poor results in the first half of 1991, they had to prequalify in the second half of the season; Blundell failed to do so in Japan, as did Brundle in Australia. The team finished 10th in the Constructors Championship, behind another struggling British team, Lotus. The 1992 season started with ": null
    },
    {
        "Eric van de Poele": "Eric Van De Poele"
    },
    {
        " and ": null
    },
    {
        "Giovanna Amati": "Giovanna Amati"
    },
    {
        " after ": null
    },
    {
        "Akihiko Nakaya": "Akihiko Nakaya"
    },
    {
        " was denied a superlicense. ": null
    },
    {
        "Damon Hill": "Damon Hill"
    },
    {
        ", the son of another former Brabham driver and World Champion, debuted in the team after Amati was dropped when her sponsorship failed to materialise. Amati, the fifth woman to race in Formula One, ended her career with three DNQs.     Argentine ": null
    },
    {
        "Sergio Rinland": "Sergio Rinland"
    },
    {
        " designed the teams final cars around Judd engines, except for 1991 when ": null
    },
    {
        "Yamaha": "Yamaha Motor Company Ltd."
    },
    {
        " powered the cars. In the ": null
    },
    {
        "1992 season": "1992 Formula One Season"
    },
    {
        " the cars rarely qualified for races. Hill gave the team its final finish, at the ": null
    },
    {
        "Hungarian Grand Prix": "1992 Hungarian Grand Prix"
    },
    {
        ", where he crossed the finish line 11th and last, four laps behind the winner, ": null
    },
    {
        "Ayrton Senna": "Ayrton Senna"
    },
    {
        ". After the end of that race the team ran out of funds and collapsed. Middlebridge Group Limited had been unable to continue making repayments against the £6  million ultimately provided by Landhurst Leasing, which went into ": null
    },
    {
        "administration": "Administration Order"
    },
    {
        ". The ": null
    },
    {
        "Serious Fraud Office": "Serious Fraud Office"
    },
    {
        " investigated the case. Landhursts managing directors were found guilty of corruption and imprisoned, having accepted bribes for further loans to Middlebridge. It was one of four teams to leave Formula One that year. . Although there was talk of reviving the team for the following year, its assets passed to Landhurst Leasing and were auctioned by the companys ": null
    },
    {
        "receivers": "Administrative Receivership"
    },
    {
        " in 1993. Baker Among these was the teams old factory in Chessington, which was acquired by Yamaha Motor Sports and used to house Activa Technology Limited, a company manufacturing composite components for race and road cars run by Herbie Blash. The factory was bought by the ": null
    },
    {
        "Carlin DPR": "Carlin Dpr"
    },
    {
        " GP2": "Gp2 Series"
    },
    {
        " motor racing team in 2006.        On 4 June 2009, ": null
    },
    {
        "Franz Hilmer": "Franz Hilmer"
    },
    {
        " confirmed that he had used the name to lodge an entry for the 2010 Formula One season as a cost capped team under the new budget cap regulations.  The Brabham family was not involved and announced that it was seeking legal advice over the use of the name.  The teams entry was not accepted, and the Brabham family later obtained legal recognition of their exclusive rights to the Brabham brand.           In September 2014, ": null
    },
    {
        "David Brabham": "David Brabham"
    },
    {
        "—the son of Brabham founder ": null
    },
    {
        "Sir Jack Brabham": "Jack Brabham"
    },
    {
        "—announced the reformation of the Brabham Racing team under the name Project Brabham, with plans to enter the 2015 ": null
    },
    {
        "FIA World Endurance Championship": "Fia World Endurance Championship"
    },
    {
        " and 2015 ": null
    },
    {
        "24 Hours of Le Mans": "24 Hours Of Le Mans"
    },
    {
        " in the LMP2 category using a ": null
    },
    {
        "crowdsourcing": "Crowdsourcing"
    },
    {
        " business model.  The team was also aiming to enter the ": null
    },
    {
        "FIA Formula E Championship": "Fia Formula E Championship"
    },
    {
        " and return to ": null
    },
    {
        "Formula One": "Formula One"
    },
    {
        " in the future.             Brabham cars were also widely used by other teams, and not just in Formula One. Jack Brabham and Ron Tauranac called the company they set up in 1961 to design and build ": null
    },
    {
        "formula racing": "Formula Racing"
    },
    {
        " cars to customer teams Motor Racing Developments , and this company had a large portfolio of other activities. Initially, Brabham and Tauranac each held 50  percent of the shares. Tauranac was responsible for design and running the business, while Brabham was the test driver and arranged corporate deals like the Repco engine supply and the use of the MIRA wind tunnel. He also contributed ideas to the design process and often machined parts and helped build the cars. Tauranac referred to this as Brabhams trade; they had first met at the small ": null
    },
    {
        "machine shop": "Machine Shop"
    },
    {
        " Brabham ran in Sydney in the early 1950s.     From 1963 to 1965, MRD was not directly involved in Formula One, and often ran works cars in other formulae. A separate company, Jack Brabhams Brabham Racing Organisation, ran the Formula One works entry. To confuse the relationship between the two companies further, MRD was renamed Brabham Racing Developments between 1962 and 1964. Henry p. 24 Like other customers, BRO bought its cars from MRD, initially at £3,000 per car, Fearnley p. 39 although it did not pay for development parts. Tauranac was unhappy with his distance from the Formula One operation and before the 1966 season suggested that he was no longer interested in producing cars for Formula One under this arrangement. Brabham investigated other chassis suppliers for BRO, however the two reached an agreement and from 1966 MRD was much more closely involved in this category. Lawrence pp. 74–75 After Jack Brabham sold his shares in MRD to Ron Tauranac at the end of 1969, the works Formula One team was MRD.     Despite only building its first car in 1961, by the mid-1960s MRD had overtaken established constructors like Cooper to become the largest manufacturer of single-seat racing cars in the world, Unique p. 111 and by 1970 had built over 500 cars. Lawrence p. 207 Of the other Formula One teams which used Brabhams, ": null
    },
    {
        "Frank Williams Racing Cars": "Frank Williams Racing Cars"
    },
    {
        " and the ": null
    },
    {
        "Rob Walker Racing Team": "Rob Walker Racing Team"
    },
    {
        " were the most successful. The ": null
    },
    {
        "1965 British Grand Prix": "1965 British Grand Prix"
    },
    {
        " saw seven Brabhams compete, only two of them from the works team, and there were usually four or five at championship Grands Prix throughout that season. The firm built scores of cars for the lower formulae each year, peaking with 89 cars in 1966. Brabham had the reputation of providing customers with cars of a standard equal to those used by the works team, which worked ": null
    },
    {
        "out of the box": "Wiktionary:Out Of The Box"
    },
    {
        " . The company provided a high degree of support to its customers—including Jack Brabham helping customers set up their cars. During this period the cars were usually known as Repco Brabhams , not because of the Repco engines used in Formula One between 1966 and 1968, but because of a smaller-scale sponsorship deal through which the Australian company had been providing parts to Jack Brabham since his Cooper days. Henry p. 53           At the end of 1971 Bernie Ecclestone bought MRD. He retained the Brabham brand, as did subsequent owners. Although the production of customer cars continued briefly under Ecclestones ownership, he believed the company needed to focus on Formula One to succeed. The last production customer Brabhams were the Formula Two BT40 and the Formula Three BT41 of 1973, Hodges p. 39 although Ecclestone sold ex-works Formula One BT44Bs to ": null
    },
    {
        "RAM Racing": "Ram Racing"
    },
    {
        " as late as 1976. Henry p. 156. Henry claims Ecclestone did this to ensure the team would focus on its troublesome new Alfa Romeo powered BT45s.     In 1988 Ecclestone sold Motor Racing Developments to Alfa Romeo. The Formula One team did not compete that year, but Alfa Romeo put the company to use designing and building a prototype Procar —a racing car with the silhouette of a large saloon  covering a composite racing car chassis and mid-mounted race engine. This was intended for a racing series for major manufacturers to support Formula One Grands Prix, and was designated the Brabham BT57.                        Brabham cars competed at the ": null
    },
    {
        "Indianapolis 500": "Indianapolis 500"
    },
    {
        " from the mid-1960s to the early 1970s. After an abortive project in 1962, Lawrence p. 30 MRD was commissioned in 1964 to build an IndyCar chassis powered by an American ": null
    },
    {
        "Offenhauser": "Offenhauser"
    },
    {
        " engine. The resultant BT12 chassis was raced by Jack Brabham as the Zink-Urschel Trackburner at the ": null
    },
    {
        "1964 event": "1964 Indianapolis 500"
    },
    {
        " and retired with a fuel tank problem. The car was entered again in ": null
    },
    {
        "1966": "1966 Indianapolis 500"
    },
    {
        ", taking a third place for ": null
    },
    {
        "Jim McElreath": "Jim Mcelreath"
    },
    {
        ". From 1968 to 1970, Brabham returned to Indianapolis, at first with a 4.2-litre version of the Repco V8 the team used in Formula One—with which ": null
    },
    {
        "Peter Revson": "Peter Revson"
    },
    {
        " finished fifth in 1969—before reverting to the Offenhauser engine for 1970. Brabham, Nye p. 240 The Brabham-Offenhauser combination was entered again in 1971 by ": null
    },
    {
        "J.C. Agajanian": "Christopher J.C. Agajanian"
    },
    {
        ", finishing fifth in the hands of ": null
    },
    {
        "Bill Vukovich II": "Bill Vukovich Ii"
    },
    {
        ". Lawrence p. 114 Although no Brabham car ever won at Indianapolis, McElreath won four ": null
    },
    {
        "United States Automobile Club": "United States Automobile Club"
    },
    {
        " races over 1965 and 1966 in the BT12. The Dean Van Lines Special in which ": null
    },
    {
        "Mario Andretti": "Mario Andretti"
    },
    {
        " won the 1965 USAC national championship was a direct copy of this car, made with permission from Brabham by Andrettis crew chief Clint Brawner. Lawrence p. 57. Brawner repaired BT12 after a crash in 1964. As part of the deal he was allowed to make a copy of the then still unusual mid-engined design. Revson took Brabhams final USAC race win in a BT25 in 1969, using the Repco engine. Lawrence p. 99       In the 1960s and early 1970s, drivers who had reached Formula One often continued to compete in ": null
    },
    {
        "Formula Two": "Formula Two"
    },
    {
        ". In 1966 MRD produced the BT18 for the lower category, with a ": null
    },
    {
        "Honda": "Honda"
    },
    {
        " engine acting as a stressed component. The car was extremely successful, winning 11 consecutive Formula Two races in the hands of the Formula One pairing of Brabham and Hulme. Cars were entered by MRD and not by the Brabham Racing Organisation, avoiding a direct conflict with Repco, their Formula One engine supplier. Unique p. 117       The first ": null
    },
    {
        "Formula Three": "Formula Three"
    },
    {
        " Brabham, the BT9, won only four major races in 1964. The BT15 which followed in 1965 was a highly successful design. 58 cars were sold, which won 42 major races. Further developments of the same concept, including wings by the end of the decade, were highly competitive up until 1971. The BT38C of 1972 was Brabhams first production monocoque and the first not designed by Tauranac. Although 40 were ordered, it was less successful than its predecessors. The angular BT41 was the final Formula Three Brabham. Hodges pp. 34–39       Brabham made one car for ": null
    },
    {
        "Formula 5000": "Formula 5000"
    },
    {
        " racing, the ": null
    },
    {
        "Brabham BT43": "Brabham Bt43"
    },
    {
        ". Rolled out in late 1973 it was tested in early 1974 by John Watson at Silverstone before making its debut at the Rothmans F5000 Championship Round at Monza on June 30, 1974 driven by ": null
    },
    {
        "Martin Birrane": "Martin Birrane"
    },
    {
        ". Former ": null
    },
    {
        "Australian Drivers Champion": "Australian Drivers Championship"
    },
    {
        " Kevin Bartlett": "Kevin Bartlett"
    },
    {
        " used the ": null
    },
    {
        "Chevrolet": "Chevrolet Small-Block Engine"
    },
    {
        " powered ": null
    },
    {
        "Brabham BT43": "Brabham Bt43"
    },
    {
        " to finish 3rd in the ": null
    },
    {
        "1978 Australian Drivers Championship": "1978 Australian Drivers Championship"
    },
    {
        " including finishing 5th in the ": null
    },
    {
        "1978 Australian Grand Prix": "1978 Australian Grand Prix"
    },
    {
        ".       Tauranac did not enjoy designing sports cars and could only spare a small amount of his time from MRDs very successful single-seater business. Only 14 sports car models were built between 1961 and 1972, out of a total production of almost 600 chassis. Lawrence pp. 205–207 The BT8A was the only one built in any numbers, and was quite successful in national level racing in the UK in 1964 and 1965. Lawrence p. 55 The design was stretched in 1966 to become the one-off BT17, originally fitted with the 4.3-litre version of the Repco engine for ": null
    },
    {
        "Can-Am": "Can-Am"
    },
    {
        " racing. It was quickly abandoned by MRD after engine reliability problems became evident. Lawrence pp. 84–85          Brabham was considered a technically conservative team in the 1960s, chiefly because it persevered with traditional ": null
    },
    {
        "spaceframe": "Spaceframe"
    },
    {
        " cars long after Lotus introduced lighter, stiffer ": null
    },
    {
        "monocoque": "Monocoque"
    },
    {
        " chassis to Formula One in 1962. Chief designer Tauranac reasoned that monocoques of the time were not usefully stiffer than well designed spaceframe chassis, and were harder to repair and less suitable for MRDs customers. Lawrence pp. 44–45 His old fashioned cars won the Brabham team the 1966 and 1967 championships, and were competitive in Formula One until rule changes forced a move to monocoques in 1970. Nye p. 60. Brabhams BT26As and Matras experimental four wheel drive MS84 of 1969 were the last cars with spaceframe chassis cars in F1. For 1970 the FIA mandated the use of bag tanks for fuel, which were to be carried inside box structures. This effectively forced the team to design a monocoque structure. From 1968 Brabhams IndyCars were monocoques for the same reason.     Despite the perceived conservatism, in 1963 Brabham was the first Formula One team to use a ": null
    },
    {
        "wind tunnel": "Wind Tunnel"
    },
    {
        " to hone their designs to reduce ": null
    },
    {
        "drag": "Drag"
    },
    {
        " and stop the cars lifting off the ground at speed. Henry p. 39. The initial tests were carried out at the ": null
    },
    {
        "Motor Industry Research Association": "Motor Industry Research Association"
    },
    {
        " wind tunnel under the auspices of Malcolm Sayer, who had been responsible for the aerodynamics of the ": null
    },
    {
        "Jaguar D-type": "Jaguar D-Type"
    },
    {
        " Le Mans-winning car. The practice only became the norm in the early 1980s, and is possibly the most important factor in the design of modern cars. Towards the end of the 1960s, teams began to exploit aerodynamic ": null
    },
    {
        "downforce": "Downforce"
    },
    {
        " to push the cars tyres down harder on the track and enable them to maintain faster speeds through high-speed corners. At the ": null
    },
    {
        "1968 Belgian Grand Prix": "1968 Belgian Grand Prix"
    },
    {
        ", Brabham were the first, alongside Ferrari, to introduce full width rear wings to this effect. Lawrence p. 100     The teams most fertile period of technical innovation came in the 1970s and 1980s when ": null
    },
    {
        "Gordon Murray": "Gordon Murray"
    },
    {
        " became technical director. During 1976, the team introduced carbon-carbon ": null
    },
    {
        "brakes": "Disc Brake"
    },
    {
        " to Formula One, which promised reduced ": null
    },
    {
        "unsprung weight": "Unsprung Weight"
    },
    {
        " and better stopping performance due to carbons greater ": null
    },
    {
        "coefficient of friction": "Coefficient Of Friction"
    },
    {
        ". The initial versions used ": null
    },
    {
        "carbon-carbon composite": "Reinforced Carbon-Carbon"
    },
    {
        " brake pads": "Brake Pads"
    },
    {
        " and a ": null
    },
    {
        "steel": "Steel"
    },
    {
        " disc faced with carbon pucks . The technology was not reliable at first; in 1976, Carlos Pace crashed at  at the ": null
    },
    {
        "Österreichring": "Österreichring"
    },
    {
        " circuit after heat build-up in the brakes boiled the ": null
    },
    {
        "brake fluid": "Brake Fluid"
    },
    {
        ", leaving him with no way of stopping the car. Henry p. 163 By 1979, Brabham had developed an effective carbon-carbon braking system, combining structural carbon discs with carbon brake pads. Howard p. 52. Interview with Gordon Murray and ": null
    },
    {
        "John Barnard": "John Barnard"
    },
    {
        " on the early uses of Carbon Fibre in Formula One for brakes and chassis structure. By the late 1980s, carbon brakes were used by all competitors in almost all top level motor sports.     Although Brabham experimented with airdams and underbody skirts in the mid-1970s, the team, like the rest of the field, did not immediately understand Lotuss development of a ": null
    },
    {
        "ground effect": "Ground Effect In Cars"
    },
    {
        " car in 1977. The ": null
    },
    {
        "Brabham BT46B": "Brabham Bt46"
    },
    {
        " Fan car of 1978, generated enormous downforce with a fan, which sucked air from beneath the car, although its claimed use was for engine cooling. The car only raced once in the Formula One World Championship—": null
    },
    {
        "Niki Lauda": "Niki Lauda"
    },
    {
        " winning the ": null
    },
    {
        "1978 Swedish Grand Prix": "1978 Swedish Grand Prix"
    },
    {
        "—before a ": null
    },
    {
        "loophole": "Wiktionary:Loophole"
    },
    {
        " in the regulations was closed by the FIA. Henry p. 186–187. It is often claimed that the car was never banned, but rather withdrawn by Ecclestone. Ecclestone did agree to withdraw it after three races, but the FIA changed the regulations to render fan cars in general, not the BT46B in particular, illegal before it could race again.     Although in 1979 Murray was the first to use lightweight ": null
    },
    {
        "carbon fibre composite": "Carbon Fibre Reinforced Plastic"
    },
    {
        " panels to stiffen Brabhams ": null
    },
    {
        "aluminium alloy": "Aluminium"
    },
    {
        " monocoques, he echoed his predecessor Tauranac in being the last to switch to the new fully composite monocoques. Murray was reluctant to build the entire chassis from composite materials until he understood their behaviour in a crash, an understanding achieved in part through an instrumented ": null
    },
    {
        "crash test": "Crash Test"
    },
    {
        " of a BT49 chassis. The team did not follow McLarens 1981 ": null
    },
    {
        "MP4/1": "Mclaren Mp4/1"
    },
    {
        " with their own fully composite chassis until the lowline BT55 in 1986, Hodges p. 43 the last team to do so. This technology is now used in all top level single seater racing cars.     For the 1981 season the FIA introduced a  minimum ": null
    },
    {
        "ride height": "Ride Height"
    },
    {
        " for the cars, intended to slow them in corners by limiting the downforce created by aerodynamic ground effect. Gordon Murray devised a ": null
    },
    {
        "hydropneumatic suspension": "Hydropneumatic Suspension"
    },
    {
        " system for the BT49C, which allowed the car to settle to a much lower ride height at speed. Brabham were accused of cheating by other teams, although Murray believes that the system met the letter of the regulations. No action was taken against the team and others soon produced systems with similar effects. Henry pp. 223–225     At the ": null
    },
    {
        "1982 British Grand Prix": "1982 British Grand Prix"
    },
    {
        ", Brabham reintroduced the idea of re-fuelling and changing the cars tyres during the race, unseen since the ": null
    },
    {
        "1957 Formula One season": "1957 Formula One Season"
    },
    {
        ", to allow their drivers to sprint away at the start of races on a light fuel load and soft tyres. After studying techniques used at the ": null
    },
    {
        "Indianapolis 500": "Indianapolis 500"
    },
    {
        " and in ": null
    },
    {
        "NASCAR": "Nascar"
    },
    {
        " racing in the United States, the team were able to refuel and re-tyre the car in 14 seconds in tests ahead of the race. In 1982 Murray felt the tactic did little more than get our sponsors noticed at races we had no chance of winning , but in 1983 the team made good use of the tactic. Hamilton pp. 63–72 Pitstops: A split-second spectacle feature by ": null
    },
    {
        "Denis Jenkinson": "Denis Jenkinson"
    },
    {
        ". Refuelling was banned for 1984, although it reappeared between ": null
    },
    {
        "1994": "1994 Formula One Season"
    },
    {
        " and ": null
    },
    {
        "2009": "2009 Formula One Season"
    },
    {
        ", but tyre changes have remained part of Formula One.        The fan car and hydropneumatic suspension exploited loopholes in the sporting regulations. In the early 1980s, Brabham was accused of going further and breaking the regulations. During 1981, Piquets first championship year, rumours circulated of illegal underweight Brabham chassis. Driver ": null
    },
    {
        "Jacques Laffite": "Jacques Laffite"
    },
    {
        " was among those to claim that the cars were fitted with heavily ballasted ": null
    },
    {
        "bodywork": "Coachwork"
    },
    {
        " before being weighed at ": null
    },
    {
        "scrutineer": "Scrutineer"
    },
    {
        "ing. The accusation was denied by Brabhams management. No formal protest was made against the team and no action was taken against them by the sporting authorities. Henry p. 225     From 1978, Ecclestone was president of the ": null
    },
    {
        "Formula One Constructors Association": "Formula One Constructors Association"
    },
    {
        " , a body formed by the teams to represent their interests. This left his team open to accusations of having advance warning of rule changes. Ecclestone denies that the team benefited from this and Murray has noted that, contrary to this view, at the end of 1982 the team had to abandon their new BT51 car, built on the basis that ground effect would be permitted in 1983. Brabham had to design and build a replacement, the BT52, in only three months. Henry p. 255 At the end of the 1983 season, Renault and Ferrari, both beaten to the Drivers Championship by Piquet, protested that the ": null
    },
    {
        "Research Octane Number": "Octane Rating"
    },
    {
        " of the teams fuel was above the legal limit of 102. The FIA declared that a figure of up to 102.9 was permitted under the rules, and that Brabham had not exceeded this limit. Drackett p. 133. Although protested , as used by Drackett, implies a formal protest, he does not specify this, and Henry p. 267 says no action was ever taken .            Results achieved by the works Brabham team. Bold results indicate a championship win.   ": null
    }
]