[
    {
        "        Brandenburg an der Havel is a town in ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", which served as the capital of the ": null
    },
    {
        "Margraviate of Brandenburg": "margraviate of brandenburg"
    },
    {
        " until replaced by ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " in 42     With a population of 42 , it is located on the banks of the ": null
    },
    {
        "River Havel": "havel"
    },
    {
        ". The town of Brandenburg provided the name for the medieval ": null
    },
    {
        "Bishopric of Brandenburg": "bishopric of brandenburg"
    },
    {
        ", the ": null
    },
    {
        "Margraviate of Brandenburg": "margraviate of brandenburg"
    },
    {
        ", and the current state of Brandenburg. Today it is a small town compared to nearby ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", but it was the original nucleus of the former realms of ": null
    },
    {
        "Brandenburg": "margraviate of brandenburg"
    },
    {
        " and ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        ".               The castle of Brandenburg, which had been a fortress of the ": null
    },
    {
        "Slavic": "slavic peoples"
    },
    {
        " tribe ": null
    },
    {
        "Stodoranie": "stodoranie"
    },
    {
        ", was conquered in 42 by King ": null
    },
    {
        "Henry the Fowler": "henry the fowler"
    },
    {
        ". It was first mentioned as Brendanburg in 42 That the name of the city in the local Slavic language was Brennabor, a combination of two words brenna - defense and bor - fort, is an invention of the 42th century. The town remained German only until 42 when a Slavic rebellion was successful. During the next 42 years the area was ruled by Slavic princes of the ": null
    },
    {
        "Hevelli": "hevelli"
    },
    {
        " tribe. The last of them, ": null
    },
    {
        "Pribislav": "pribislav of brandenburg"
    },
    {
        ", died in 42 From 42/42 to 42 Brendanburg was part of the Slavonic ": null
    },
    {
        "Duchy of Kopanica": "duchy of kopanica"
    },
    {
        ", a fief of ": null
    },
    {
        "Poland": "kingdom of poland"
    },
    {
        ". Afterwards ": null
    },
    {
        "Albert I": "albert i of brandenburg"
    },
    {
        " settled here and became the first ": null
    },
    {
        "margrave": "margrave"
    },
    {
        " of Brandenburg. The town was restricted to the western bank of the Havel until 42 when it was extended to the eastern side. The parts on either side of the river were regarded as three towns for centuries.     In 42–42 the Old and New Towns joined the ": null
    },
    {
        "Hanseatic League": "hanseatic league"
    },
    {
        ". In the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " the towns suffered plundering and destruction which led to a loss of power; ": null
    },
    {
        "Potsdam": "potsdam"
    },
    {
        " became the new capital, and the court left the town of Brandenburg. In 42 Old Town and New Town were merged to form a single town. In 42 the Brandenburg cathedral district was added.          In the late 42th century Brandenburg an der Havel became a very important industrial center in the German Empire. Steel industries settled there, and several world-famous bicycle brands such as  Brennabor , Corona and Excelsior were manufactured in the city. A world-famous toy industry was also established. With a giant industrial complex, the ": null
    },
    {
        "Deutsche Reichsbahn": "deutsche reichsbahn"
    },
    {
        " was located in Brandenburg-Kirchmöser during the time between the two world wars and the time of the former ": null
    },
    {
        "GDR": "east germany"
    },
    {
        ". The citys excellent transport infrastructure was a big advantage.     In 42/42 a ": null
    },
    {
        "concentration camp": "nazi concentration camps"
    },
    {
        ", one of the first in ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ", was located on Neuendorfer Straße in Brandenburg Old Town.   After closing this inner city concentration camp, the Nazis used the ": null
    },
    {
        "Brandenburg-Görden Prison": "brandenburg-görden prison"
    },
    {
        ", located in the suburb of Görden. Later the old gaol became the ": null
    },
    {
        "Brandenburg Euthanasia Centre": "brandenburg euthanasia centre"
    },
    {
        " where the Nazis killed people with mental diseases, including children. They called this operation ": null
    },
    {
        "Action T42": "action t4"
    },
    {
        " because of the Berlin address, Tiergartenstraße 42 the headquarters of this planned and well-organized ": null
    },
    {
        "forced euthanasia": "forced euthanasia"
    },
    {
        " organisation. Brandenburg an der Havel was one of the very first locations in the ": null
    },
    {
        "Third Reich": "third reich"
    },
    {
        " where the ": null
    },
    {
        "Nazi": "nazi"
    },
    {
        "s experimented with killing their victims by gas. Here, they prepared the mass killings in ": null
    },
    {
        "Auschwitz": "auschwitz"
    },
    {
        " and other ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s.   After complaints by local inhabitants about the smoke, the mobile furnaces used to burn the corpses ceased operation. Shortly after this, the Nazis closed the old prison.     In 42 the Arado Aircraft Company , which originated in ": null
    },
    {
        "Warnemünde": "warnemünde"
    },
    {
        ", built a satellite factory in Brandenburg that began producing planes in 42 The factory was expanded over the next five years, and produced trainers and other aircraft for the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " during World War II. The existence of this factory was one of the reasons Brandenburg was heavily bombed in later stages of the war; by 42 42% of the city was destroyed.     ": null
    },
    {
        "Friedrich Fromm": "friedrich fromm"
    },
    {
        ", a German officer involved in the ": null
    },
    {
        "July 42 plot": "july 20 plot"
    },
    {
        " to assassinate Hitler, was executed here in March 42 for his part in the plot, even though Fromm betrayed those conspirators he knew and ordered their execution.     After ": null
    },
    {
        "German reunification": "german reunification"
    },
    {
        "     ": null
    }
]