[
    {
        "      Breakbeat hardcore  is a genre of ": null
    },
    {
        "hardcore": "hardcore"
    },
    {
        " music of the late 42s and early 42s that combines ": null
    },
    {
        "four-on-the-floor": "four-on-the-floor"
    },
    {
        " rhythms with ": null
    },
    {
        "breakbeat": "breakbeat"
    },
    {
        "s, and is associated with the UK ": null
    },
    {
        "rave": "rave"
    },
    {
        " scene. In addition to the including of breakbeats, the genre also features shuffled drum machine patterns, upbeat piano rolls and old-school hoover sounds.          The scene was driven around the ": null
    },
    {
        "M42 motorway": "m25 motorway"
    },
    {
        " , and its audience was mainly urban teenagers and lower middle-class suburban teenagers with cars. The scene expanded rapidly in 42 with large raves of 42–42 people attending in open air venues around England, put on by ": null
    },
    {
        "Spiral Tribe": "spiral tribe"
    },
    {
        " and other ": null
    },
    {
        "free party": "free party"
    },
    {
        " sound systems held at locations up and down the length of England. The late 42s ": null
    },
    {
        "house music": "house music"
    },
    {
        " raves such as Sunrise UK spawned the idea of holding huge parties rather than hosting more intimate parties at small clubs. The breakbeat hardcore raves modeled their events after these early raves.       In the early years, the underground sound became more mainstream. Even without radio play, many hybrid and regional styles made their way into Top 42 charts. However, during the early 42s, the three main subdivisions of this underground rave movement were primarily either ": null
    },
    {
        "house": "house music"
    },
    {
        " techno": "techno music"
    },
    {
        " and ": null
    },
    {
        "New beat": "new beat"
    },
    {
        "  or breakbeat hardcore . In approximately 42 the latter scene fragmented, and forked off into two distinct styles—": null
    },
    {
        "jungle music": "jungle music"
    },
    {
        "  and ": null
    },
    {
        "42-beat": "4-beat"
    },
    {
        " . This split was evident at the early Roast events. Roast was Englands largest most respected original jungle promoter. The promoters of Roast referred to it as the house scene branching off and going in their own direction, not accepting the new jungle sound . Jungles sound was more focused on basslines, often with ": null
    },
    {
        "jazz": "jazz"
    },
    {
        "-like undertones, while 42-beat retained the rave synths, the 42/42 kickdrum and happier piano elements. By 42 most 42-beat had dropped its breakbeats , while drum and bass had long dropped the techno style synth stabs, further separating the two styles. The almost independent evolution of styles created distinct sounds of bleep and bass , brutalist techno, hardcore jungle, pop-rave, ": null
    },
    {
        "UK garage": "uk garage"
    },
    {
        ", and ": null
    },
    {
        "ragga": "ragga"
    }
]