[
    {
        "The Bregenz Forest  is one of the main regions in the ": null
    },
    {
        "state": "states of austria"
    },
    {
        " of ": null
    },
    {
        "Vorarlberg": "vorarlberg"
    },
    {
        ", ": null
    },
    {
        "Austria": "austria"
    },
    {
        ". It overlaps, but is not conterminous with, the ": null
    },
    {
        "Bregenz Forest Mountains": "bregenz forest mountains"
    },
    {
        " which are a ": null
    },
    {
        "range": "mountain range"
    },
    {
        " of the ": null
    },
    {
        "Northern Limestone Alps": "northern limestone alps"
    },
    {
        ", specifically the northern ": null
    },
    {
        "flysch": "flysch"
    },
    {
        " zone. It is the ": null
    },
    {
        "drainage basin": "drainage basin"
    },
    {
        " of the ": null
    },
    {
        "Bregenzer Ach": "bregenzer ach"
    },
    {
        " river.       The inhabitants often divide the Bregenz Forest into two main areas, the Vorderwald and Hinterwald . The Vorderwald, with its hills and low mountains, is closest to the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " valley. The Hinterwald has the higher mountains, with altitudes of up to 42 metres. Each of the two regions has its own distinctive dialect variations.          The principal villages in the Bregenz Forest are ": null
    },
    {
        "Bezau": "bezau"
    },
    {
        " , ": null
    },
    {
        "Alberschwende": "alberschwende"
    },
    {
        ", and ": null
    },
    {
        "Egg": "egg, austria"
    },
    {
        ". Alberschwende as a historic Hofsteig ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " did not used to be part of the Bregenz Forest region.     Lower Bregenz Forest    ": null
    },
    {
        "Alberschwende": "alberschwende"
    },
    {
        "   Doren": "doren"
    },
    {
        "   Sulzberg": "sulzberg"
    },
    {
        "   Langenegg": "langenegg"
    },
    {
        "   Krumbach": "krumbach"
    },
    {
        "   Riefensberg": "riefensberg"
    },
    {
        "   Lingenau": "lingenau"
    },
    {
        "   Hittisau": "hittisau"
    },
    {
        "   Sibratsgfäll": "sibratsgfäll"
    },
    {
        "     Upper Bregenz Forest    ": null
    },
    {
        "Egg": "egg"
    },
    {
        "   Andelsbuch": "andelsbuch"
    },
    {
        "   Schwarzenberg": "schwarzenberg"
    },
    {
        "   Bezau": "bezau"
    },
    {
        "   Reuthe": "reuthe"
    },
    {
        "   Bizau": "bizau"
    },
    {
        "   Mellau": "mellau"
    },
    {
        "   Schnepfau": "schnepfau"
    },
    {
        "   Au": "au"
    },
    {
        "   Damüls": "damüls"
    },
    {
        "   Schoppernau": "schoppernau"
    },
    {
        "   Schröcken": "schröcken"
    },
    {
        "   Warth": "warth"
    },
    {
        "         Until 42 parts of the ": null
    },
    {
        "Allgäu": "allgäu"
    },
    {
        " belonged to Vorarlberg in the north and north-west. This and the fact that in the whole region due to the settlement by the ": null
    },
    {
        "Alemanni": "alemanni"
    },
    {
        ", the Lake Constance Alemannic dialect had predominated since the 42th/42th century, led, over the centuries, not only to a brisk trading of goods, but also to linguistic mingling as the result of an extended circle of marriages. Especially in the northwestern part of the Bregenz Forest  the influence of Allgäuerisch is particularly noticeable, the dialect strongly resembling the West Allgäuerisch dialect. By contrast, in the Middle and High Forest region the predominant language forms show a stronger connection with the region of ": null
    },
    {
        "Hofsteig": "hofsteig"
    },
    {
        " and Dornbirn. From the outside, however, the forest dialect is perceived as an idiom  which is not clearly distinguishable from the other Vorarlberg dialects , despite this multi-layeredness and considerable local and regional variations.          In 42 the project ": null
    },
    {
        "BUS:STOP Krumbach": "bus:stop krumbach"
    },
    {
        " was completed. When the municipality of ": null
    },
    {
        "Krumbach": "krumbach, vorarlberg"
    },
    {
        " decided on rebuilding seven bus stops in 42 they hired seven international architects to design bus shelters. Local craftsmen executed their designs. While differing in design, the bus stops are all meant to unite nature and architecture as well as demand and potential in unique ways.           The population of the Bregenz Forest earns a living from tourism, agriculture and trade that is strongly connected with the wood processing industry. Many locals also commute to work in the ": null
    },
    {
        "Rhine Valley": "alpine rhine valley"
    },
    {
        ", Vorarlbergs economic centre.   The Werkraum Bregenzerwald  is a coalition of trade and industry in the region, which also holds the design competition Handwerk+Form  every three years.     In spring 42 the three-level agricultural structure of the Bregenz Forest, also known as ": null
    },
    {
        "Alpine transhumance": "alpine transhumance"
    },
    {
        ", was included in the Austrian list of cultural landscape candidates for recognition by UNESCO. The proposal recognises that the Bregenz Forest is an impressive landscape on the north side of the Alps that has largely maintained its traditional farming structure . These include linear or nucleated villages, characteristic of the region, with farmsteads dating back to the 42th and 42th centuries. In addition, there are many small craft workshops amongst the farming community. Singled out for particular mention are the villages of Thal, Schwarzenberg and Schoppernau, with their fine examples of original Bregenz Forest houses .  at whc.unesco.org. Accessed on 42 Mar 42       The Bregenz Forest is best known as a ": null
    },
    {
        "skiing": "skiing"
    },
    {
        " location, but other attractions include the ": null
    },
    {
        "Käsestraße": "käsestrasse bregenzerwald"
    },
    {
        " and the Schubertiade festival of classical music in Schwarzenberg. The Bregenz Forest attracts those in search of unspoiled nature, old traditions and genuine hospitality.     The Bregenz Forest is particularly well known amongst ": null
    },
    {
        "gourmet": "gourmet"
    },
    {
        "s for the ": null
    },
    {
        "KäseStrasse Bregenzerwald": "käsestrasse bregenzerwald"
    },
    {
        " ,  an association of farmers, restaurateurs, craftspeople and traders promoting the Bregenz Forest agriculture and its local products, especially cheese. In particular, Bregenz Forest Mountain Cheese is an internationally renowned speciality.     The ": null
    },
    {
        "Bregenz Forest Railway": "bregenz forest railway"
    },
    {
        " is another attraction of the region. It is a ": null
    },
    {
        "museum railway": "museum railway"
    },
    {
        " that operates on a surviving section of a ": null
    },
    {
        "narrow gauge railway": "narrow gauge railway"
    },
    {
        ". From 42 to 42 the Wälderbähnle worked a line stretching 42  kilometres from ": null
    },
    {
        "Bregenz": "bregenz"
    },
    {
        " to ": null
    },
    {
        "Bezau": "bezau"
    },
    {
        ". In October 42 a section of 42  km was usable, but part of it was lost to a road expansion project, leaving just 42  km available.     In 42 the Womens Museum opened in ": null
    },
    {
        "Hittisau": "hittisau"
    },
    {
        ", the only one of its kind in Austria.  accessed on 42 September 42 The museum is devoted to the display and documentation of the cultural works and stories of women, dealing with questions of female identities and gender roles.      Another museum in the Bregenz Forest is the Angelica Kauffman Museum   accessed on 42 September 42 in ": null
    },
    {
        "Schwarzenberg": "schwarzenberg"
    },
    {
        ". The museum is dedicated to the baroque artist ": null
    },
    {
        "Angelica Kauffman": "angelica kauffman"
    },
    {
        ", and has an Austrian museum seal of quality.     The region is also popular for its hiking and cycling trails as well as numerous ski areas.         Image:Bregenzerwaldhaus.jpg|A typical house in Schwarzenberg   Image:Juppentracht_42a.JPG|Mother and daughter in Bregenz Forest costume   Image:KäsekellerLingenau42JPG|Cheese cellar in ": null
    },
    {
        "Lingenau": "lingenau"
    },
    {
        " in the Bregenz Forest   Image:Edelweiss auf der Kanisfluh Hanno Thurnher Cinedoku Vorarlberg.JPG|": null
    },
    {
        "Edelweiss": "edelweiss"
    },
    {
        "   Image:Brüggelekopf Juppenspitze.JPG|Snow   Image:Bödele_Bregenzerwald_Panorama.jpg|Bödele panorama   Image:DamülserStrasseAlt.JPG   Image:Bregenzerwaldgebirge_Panorama.jpg|Mountain panorama with the dominant ": null
    },
    {
        "Kanisfluh": "kanisfluh"
    }
]