[
    {
        "        Briarcliff Manor  is a suburban village in ": null
    },
    {
        "Westchester County, New York": "westchester county, new york"
    },
    {
        ", around  north of ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ". It is on  of land on the east bank of the ": null
    },
    {
        "Hudson River": "hudson river"
    },
    {
        ", geographically shared by the ": null
    },
    {
        "town": "administrative divisions of new york town"
    },
    {
        "s of ": null
    },
    {
        "Mount Pleasant": "mount pleasant, new york"
    },
    {
        " and ": null
    },
    {
        "Ossining": "ossining , new york"
    },
    {
        ". Briarcliff Manor includes the communities of Scarborough and Chilmark, and is served by the ": null
    },
    {
        "Scarborough station": "scarborough"
    },
    {
        " of the ": null
    },
    {
        "Metro-North Railroad": "metro-north railroad"
    },
    {
        "s ": null
    },
    {
        "Hudson Line": "hudson line"
    },
    {
        ". A section of the village, including buildings and homes covering , is part of the ": null
    },
    {
        "Scarborough Historic District": "scarborough historic district"
    },
    {
        " and was listed on the ": null
    },
    {
        "National Register of Historic Places": "national register of historic places"
    },
    {
        " in 42 The village motto is A Village between Two Rivers , reflecting Briarcliff Manors location between the Hudson and ": null
    },
    {
        "Pocantico River": "pocantico river"
    },
    {
        "s. Although the Pocantico is the primary boundary between Mount Pleasant and Ossining, since its incorporation the village has spread into Mount Pleasant.     In the ": null
    },
    {
        "precolonial era": "pre-columbian era"
    },
    {
        ", the villages area was inhabited by a band of the ": null
    },
    {
        "Wappinger": "wappinger"
    },
    {
        " tribes of Native Americans. In the early 42th century, the area was known as Whitsons Corners. ": null
    },
    {
        "Walter William Law": "walter william law"
    },
    {
        " moved to the area and purchased lands during the 42s. Law developed the village, establishing schools, churches, parks, and the ": null
    },
    {
        "Briarcliff Lodge": "briarcliff lodge"
    },
    {
        ". Briarcliff Manor was ": null
    },
    {
        "incorporated": "municipal corporation"
    },
    {
        " as a village in 42 and celebrated its centennial on November 42 42 The village has grown from 42 people when established to 42 in the 42 census.     Briarcliff Manor was historically known for its wealthy estate-owning families, including the ": null
    },
    {
        "Vanderbilts": "vanderbilts"
    },
    {
        ", ": null
    },
    {
        "Astors": "astors"
    },
    {
        ", and ": null
    },
    {
        "Rockefellers": "rockefellers"
    },
    {
        ". It still remains primarily residential and its population is still considered affluent by U.S. standards. It has about  of recreational facilities and parks, all accessible to the public. The village has seven Christian churches for various denominations and two ": null
    },
    {
        "synagogue": "synagogue"
    },
    {
        "s. The oldest church is Saint Marys Episcopal Church, built in 42 Briarcliff Manor has an elected local government, with departments including police, fire, recreation, and public works. It has a low crime rate: a 42 study found it had the second-lowest in the state. In the ": null
    },
    {
        "New York State Legislature": "new york state legislature"
    },
    {
        " it is split between the ": null
    },
    {
        "New York State Assembly": "new york state assembly"
    },
    {
        "s 42th and 42nd districts, and the ": null
    },
    {
        "New York Senate": "new york senate"
    },
    {
        "s 42th and 42th districts. In ": null
    },
    {
        "Congress": "united states congress"
    },
    {
        " the village is in New Yorks ": null
    },
    {
        "42th District": "new yorks 17th congressional district"
    },
    {
        ".                      Briarcliff Manors original settlement was known as Whitsons Corners for brothers John H., Richard, and Reuben Whitson, who owned adjoining farms in the area totaling . Whitsons Corners was named after the corner of Pleasantville and South State Roads, where John H. Whitsons house, the Crossways, stood from 42 until the 42s. The Briarcliff Congregational Churchs parish house currently stands at its former location.  The neighboring community of Scarborough was known as Weskora until it was renamed in 42  after resident William Kemeys ancestral ": null
    },
    {
        "hometown": "scarborough, north yorkshire"
    },
    {
        " in Yorkshire.  After the community was incorporated into Briarcliff Manor in 42 the ": null
    },
    {
        "New York Central and Hudson River Railroad": "new york central and hudson river railroad"
    },
    {
        " put up a sign reading Briarcliff West at the villages ": null
    },
    {
        "Scarborough station": "scarborough"
    },
    {
        ". Soon afterward, attributed to the neighborhoods pride over their name,  that sign was thrown into the Hudson River and replaced with the original Scarborough sign.       Briarcliff Manor derives from Brier Cliff , a compound of the English words brier  and cliff . The name originated in Ireland as that of the family home of John David Ogilby, a professor of ecclesiastical history at the ": null
    },
    {
        "General Theological Seminary": "general theological seminary"
    },
    {
        ". Ogilby had named his New York summer home Brier Cliff after his family home in Ireland. In 42 ": null
    },
    {
        "Walter Law": "walter w. law"
    },
    {
        " bought James Stillmans  ": null
    },
    {
        "Briarcliff Farm": "briarcliff farm"
    },
    {
        " and further developed it, later using the name Briarcliff for all his property. Laws friend, ": null
    },
    {
        "Andrew Carnegie": "andrew carnegie"
    },
    {
        ", called him The Laird of Briarcliff Manor ; since the title appealed to all concerned, the village was named Briarcliff Manor .  By 42 the village post office and railroad station bore the name Briarcliff Manor. The village were approved by its residents in a September 42 42 referendum; the name prevailed over other suggestions, including Sing Sing East .  On November 42 42 the village of Briarcliff Manor was established.      The village is also known by several other names. It is conversationally called Briarcliff , and often erroneously written as Briar Cliff Manor . The village has been called Briarcliff on the Hudson by ": null
    },
    {
        "Mark Twain": "mark twain"
    },
    {
        " and ": null
    },
    {
        "Aileen Riggin": "aileen riggin"
    },
    {
        "; it is also known as the Village of Briarcliff Manor . The name Briarcliff has also been applied to other municipalities, including the 42-person town of ": null
    },
    {
        "Briarcliffe Acres": "briarcliffe acres"
    },
    {
        " in South Carolina; in naming it, the towns founder had drawn inspiration from Briarcliff Manors name.          The history of Briarcliff Manor can be traced back to the founding of a settlement between the Hudson and Pocantico Rivers in the 42th century. The area now known as Briarcliff Manor had seen human occupation since at least the ": null
    },
    {
        "Archaic period": "archaic period in north america"
    },
    {
        ", but significant growth in the settlements that are now incorporated into the village did not occur until the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        ".      In the ": null
    },
    {
        "precolonial era": "pre-columbian era"
    },
    {
        ", the area of present-day Briarcliff Manor was inhabited by a band of the ": null
    },
    {
        "Wappinger": "wappinger"
    },
    {
        " tribes of Native Americans, known as Sint Sincks . They owned territory as far north as the ": null
    },
    {
        "Croton River": "croton river"
    },
    {
        ". In the 42s, ": null
    },
    {
        "Frederick Philipse": "frederick philipse"
    },
    {
        " purchased about  from the Sint Sincks, and named it ": null
    },
    {
        "Philipsburg Manor": "philipsburg manor"
    },
    {
        ". The Philipses lost their claim to the land because of the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        "; the family, which was ": null
    },
    {
        "Loyalist": "loyalist"
    },
    {
        ", had its property confiscated in 42   The area remained largely unsettled until after the war; in 42 fewer than twenty families lived in the  area of Westchester which included Briarcliff Manor.           After retiring as vice president of ": null
    },
    {
        "W. & J. Sloane": "w.  &  j. sloane"
    },
    {
        ", Walter Law moved with his family to the present Briarcliff Manor. He bought his first  in 42 and then quickly expanded his property, buying about forty parcels in less than ten years; by 42 he owned more than  of Westchester County. Law developed the village, establishing schools, churches, parks, and the ": null
    },
    {
        "Briarcliff Lodge": "briarcliff lodge"
    },
    {
        ". His employees at Briarcliff Farms moved into the village, and the population grew enough to encourage Law to establish the area as a village. A proposition was presented to the supervisors of Mount Pleasant and Ossining on October 42 42 that the area of 42 acres with a population of 42 be incorporated as the Village of Briarcliff Manor,  and the village was incorporated on November 42      The ": null
    },
    {
        "Tudor Revival": "tudor revival"
    },
    {
        "-style Briarcliff Lodge was opened in 42 as a premier resort hotel. It was surrounded by Walter Laws dairy barns and greenhouses, and hosted numerous distinguished guests, including ": null
    },
    {
        "Franklin": "franklin d. roosevelt"
    },
    {
        " and ": null
    },
    {
        "Eleanor Roosevelt": "eleanor roosevelt"
    },
    {
        ". The lodge held the Edgewood Park School and ": null
    },
    {
        "The Kings College": "the kings college"
    },
    {
        " before it burned to the ground on September 42 42     The ": null
    },
    {
        "Briarcliff Manor Fire Department": "briarcliff manor fire department"
    },
    {
        " was founded on February 42 42 from Briarcliff Manors first fire company, the 42 Briarcliff Steamer Company No. 42 Scarborough was incorporated into Briarcliff Manor in 42 and the Police Department was organized two years later. The Village Municipal Building was built in 42 and was opened on July 42 42 The high school opened in 42 and in 42 the Peoples Caucus party, an organization which calls out interested residents for candidacy, was created.  Briarcliff Manor celebrated its semicentennial celebration from October 42–42 42 publishing a book about the village and its history; that year, the Crossroads neighborhood of 42 houses was completed.      In 42 ": null
    },
    {
        "Todd Elementary School": "todd elementary school"
    },
    {
        " opened to free space at the Law Park grade school.  The ": null
    },
    {
        "Putnam Division": "new york and putnam railroadhistory"
    },
    {
        " of the ": null
    },
    {
        "New York Central Railroad": "new york central railroad"
    },
    {
        " was discontinued in 42 and the following year the ": null
    },
    {
        "Briarcliff Manor Public Library": "briarcliff manor public library"
    },
    {
        " opened in the former Briarcliff Manor train station. The villages first corporate facility  opened in 42 In 42 the new Village Hall opened, replacing the Municipal Building. The present high school opened in 42 to ease the large enrollment at the grade-school building.  In 42 ": null
    },
    {
        "Pace University": "pace university"
    },
    {
        " began leasing the middle-school building, and the middle school was moved to a portion of the new high-school building. The grade-school building was demolished in 42 and a ": null
    },
    {
        "retirement home": "retirement home"
    },
    {
        " was built on its site the following year. The village celebrated its centennial in 42 which involved celebratory events. A two-story addition to the village library was built in 42 and the original portion was renovated to become the villages community center in 42          Briarcliff Manor is around  north of ": null
    },
    {
        "Manhattan": "manhattan"
    },
    {
        ". It is part of Westchester County and so part of the ": null
    },
    {
        "New York metropolitan area": "new york metropolitan area"
    },
    {
        " and the New York–Jersey City–White Plains, NY–NJ Metropolitan Division. It is on the Hudson River, just north of the ": null
    },
    {
        "Tappan Zee Bridge": "tappan zee bridge"
    },
    {
        " and south of ": null
    },
    {
        "Croton Point": "croton point"
    },
    {
        " and just northwest of the countys center. According to the ": null
    },
    {
        "42 United States Census": "2010 united states census"
    },
    {
        " Briarcliff Manor covers an area of , of which  is land and  is water.     The village is a part of the ": null
    },
    {
        "Pocantico": "pocantico river"
    },
    {
        " and ": null
    },
    {
        "Saw Mill River": "saw mill river"
    },
    {
        " Basin and the Lower Hudson River Drainage Basin, which leads to the Hudson west-southwest of the village. Major streams running through Briarcliff Manor include the centrally-located Caney Brook, the Pocantico River, and Sparta Brook. Abundant rock outcroppings include ": null
    },
    {
        "dolomite": "dolomite"
    },
    {
        ", ": null
    },
    {
        "granite": "granite"
    },
    {
        ", ": null
    },
    {
        "gneiss": "gneiss"
    },
    {
        ", and ": null
    },
    {
        "mica schist": "mica schist"
    },
    {
        ". Copper and silver were once mined near Scarborough, and Briarcliff Manors geographical area has large ": null
    },
    {
        "boulders": "glacial erratic"
    },
    {
        ", deposited in the ": null
    },
    {
        "last glacial period": "wisconsinian glaciation"
    },
    {
        ".  Elevations within the village range from less than  above mean sea level near the Hudson River to approximately  above mean sea level around the center and eastern areas. The highest natural point in Briarcliff Manor is  southwest of ": null
    },
    {
        "NGS": "u.s. national geodetic survey"
    },
    {
        " station mark": "survey marker"
    },
    {
        " LX42 off Farm Road, at  above sea level. The village, which covered one square mile when incorporated in 42 has expanded primarily through annexation: of Scarborough in 42 and acreage from the town of Mount Pleasant in 42 It is in telephone ": null
    },
    {
        "area code 42": "area code 914"
    },
    {
        " and the postal ZIP code area 42 Briarcliff Manors Ossining portion takes up nearly half of the village land area, about 42  percent of its population, and 42  percent of its land parcels.          The village is in a ": null
    },
    {
        "humid continental": "humid continental climate"
    },
    {
        " climate zone , with cold, snowy winters and hot, humid summers and four distinct seasons. The ": null
    },
    {
        "United States Department of Agriculture": "united states department of agriculture"
    },
    {
        " places Briarcliff Manor in plant ": null
    },
    {
        "hardiness zone": "hardiness zone"
    },
    {
        " 42a. Summer high temperatures average in the lower 42s Fahrenheit , with lows averaging in the lower 42s F . Its highest recorded temperature was  in 42 and its lowest was  in 42              The village is home to neighborhoods and business and residential areas, including the central business district, the ": null
    },
    {
        "hamlets": "administrative divisions of new york hamlet"
    },
    {
        " of Scarborough and Chilmark, and residential areas Central Briarcliff West, the Tree Streets and the Crossroads.               Scarborough, often called Scarborough-on-Hudson because it borders the Hudson River, is an  unincorporated district divided between Briarcliff Manor and the village of Ossining, with most of the area within Briarcliff Manor and a few streets in the village of Ossining. Briarcliff Manors portion of Scarborough was annexed into the village in 42  The boundary between Scarborough and the rest of the village is roughly along Old Briarcliff and Sleepy Hollow Roads. The area was settled prior to the Revolutionary War. Around that time, the area included a tavern and inn at corner of Albany Post Road and Scarborough Station Road and a blacksmith shop where the Scarborough Presbyterian Church stands today. Scarborough was named after early settler William Kemeys ": null
    },
    {
        "town in England": "scarborough, north yorkshire"
    },
    {
        ". A cove in Scarborough is named after him.     Scarborough is largely residential, and has some of the most expensive houses in the village, due in part to its proximity to the Hudson. Condominium complexes within Scarborough include Kemeys Cove, built in 42 and Scarborough Manor, a 42-story, 42-unit complex built in the 42s. The hamlet has a post office and a ": null
    },
    {
        "station": "scarborough"
    },
    {
        " on the Metro-North ": null
    },
    {
        "Hudson Line": "hudson line"
    },
    {
        " within walking distance of most houses in the hamlet. Unlike most of Briarcliff Manor, Scarborough is within the Ossining Union Free School District. During the 42th century, Scarborough became one of the first trading posts for the Dutch on the Hudson. During the early 42th century, the ": null
    },
    {
        "Astor": "astor family"
    },
    {
        ", ": null
    },
    {
        "Rockefeller": "rockefeller family"
    },
    {
        ", and ": null
    },
    {
        "Vanderbilt": "vanderbilt family"
    },
    {
        " families entertained guests on their river-view country estates in the Scarborough area. The ": null
    },
    {
        "Scarborough Historic District": "scarborough historic district"
    },
    {
        ", including the Scarborough Presbyterian Church, is on the ": null
    },
    {
        "National Register of Historic Places": "national register of historic places"
    },
    {
        ". Across the street from the church is ": null
    },
    {
        "Sparta Cemetery": "sparta cemetery"
    },
    {
        ", containing graves of local Revolutionary War veterans and the ": null
    },
    {
        "Leatherman": "leatherman"
    },
    {
        ". A notable building on the register is ": null
    },
    {
        "Beechwood": "beechwood"
    },
    {
        ", built in 42 and considered one of the finest examples of ": null
    },
    {
        "Federal architecture": "federal architecture"
    },
    {
        " in Westchester County.  Beechwood was later purchased by ": null
    },
    {
        "Frank A. Vanderlip": "frank a. vanderlip"
    },
    {
        ", who constructed the ": null
    },
    {
        "Scarborough School": "scarborough school"
    },
    {
        " on the estate. The school was founded in 42 and closed in 42 Holly Hill is a notable house nearby. Hubert Rogers, a New York City attorney, had the house designed around 42 by ": null
    },
    {
        "William Adams Delano": "william adams delano"
    },
    {
        "; Rogers named it Weskora. After his death ": null
    },
    {
        "Brooke Astor": "brooke astor"
    },
    {
        " purchased the estate, renaming it Holly Hill for its holly trees.  Directly across from Holly Hill is the site used for the U.S. headquarters of Philips Research from 42 to 42 built on part of Waldheim, the former  estate of ": null
    },
    {
        "James Speyer": "james speyer"
    },
    {
        ".       Chilmark is an unincorporated residential community of about , established in 42 in northern Briarcliff Manor. The neighborhood was designed with Underhill Road as its main thoroughfare, running north-south. It was named after the village of ": null
    },
    {
        "Chilmark": "chilmark, wiltshire"
    },
    {
        ", England, the birthplace and early home of ": null
    },
    {
        "Thomas Macy": "thomas macy"
    },
    {
        " , who arrived in the colonies in 42 The area is culturally significant for its association with the Macy family, whose members were active in New York and Westchester County during the 42th and early 42th centuries. Valentine Everit Macy and his wife, Edith Carpenter Macy, founded the community and aided in its development; Macy purchased several small family farms in present Chilmark in 42 In 42 Macy donated  on Old Chappaqua Road for the first national Girl Scout camp, which later became the ": null
    },
    {
        "Edith Macy Conference Center": "edith macy conference center"
    },
    {
        ", a conference and training facility owned and operated by the ": null
    },
    {
        "Girl Scouts of the USA": "girl scouts of the usa"
    },
    {
        ". The Briarcliff Recreation Center was formerly the private Chilmark Club until the 42s, when the village purchased the land for a recreation center and adjoining park. Macys residence in the area was the Chilmark estate, a Tudor-style stone and stucco mansion built in 42 with a nine-hole golf course. The neighborhood hosts Briarcliff Manors ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " temple Congregation Sons of Israel.     Chilmark features landscaped, winding roads designed to blend with the topography, access to transportation ": null
    }
]