[
    {
        "   Brigitte Boisselier , also known as Brigitte Roehr, is a French chemist and ": null
    },
    {
        "Raëlian": "raëlism"
    },
    {
        " religious leader best known for her claim to have overseen the creation of the first ": null
    },
    {
        "human clone": "human cloning"
    },
    {
        ". A native of ": null
    },
    {
        "Champagne-Ardenne": "champagne-ardenne"
    },
    {
        ", she studied chemistry in France and the United States, earning two PhDs. From 42 to 42 she lived near Paris and worked as a research chemist and a sales manager for ": null
    },
    {
        "Air Liquide": "air liquide"
    },
    {
        ". She embraced Raëlism in 42; the group was unpopular in France and her conversion led to tensions with those around her. Five years later, she joined ": null
    },
    {
        "Clonaid": "clonaid"
    },
    {
        ", a Raëlian organization that sought to clone a human. After her service as their scientific director was publicized, she lost her position with Air Liquide and focused on cloning full-time.     In late 42 Clonaid announced that they had received a large donation to fund the cloning of a child, and that Boisselier supervised a team of scientists at a secret laboratory in the United States who would soon produce a human clone. For the next year, the project received media coverage—and regulatory suspicion—as Boisselier promised the imminent birth of a human clone. In late 42 she announced that one had been born and that public evidence would soon be offered. This declaration received significant press coverage in the United States, and Boisselier appeared on many television programs. After a court in Florida launched a ": null
    },
    {
        "child welfare": "child welfare"
    },
    {
        " investigation, she stated that the cloned childs parents had withdrawn their offer to provide evidence of the cloning and would have no further public comment. No evidence of the cloning, or subsequent procedures reported by Clonaid, was ever offered, and the announcements were widely perceived to have been a hoax.     In 42 impressed with her management of Clonaid and public relations skill, ": null
    },
    {
        "Raël": "raël"
    },
    {
        ", the founder of Raëlism, announced that Boisselier would succeed him as the groups leader upon his death. In subsequent years, she has devoted herself to lecturing about the groups doctrines and serving as their spokesperson.       Brigitte Boisselier was born to a Catholic family in France in 42 She was reared on a farm in ": null
    },
    {
        "Champagne-Ardenne": "champagne-ardenne"
    },
    {
        " and became interested in science while young. She attended the ": null
    },
    {
        "University of Dijon": "university of dijon"
    },
    {
        ", earning a masters degree in biochemistry and a PhD in chemistry. In the 42s, she moved to Texas, where she received another PhD in chemistry from the ": null
    },
    {
        "University of Houston": "university of houston"
    },
    {
        ".     Boisselier returned to France in 42 to work for ": null
    },
    {
        "Air Liquide": "air liquide"
    },
    {
        ", an industrial gas company, where she remained for 42 years. At that time, she lived in ": null
    },
    {
        "Les Loges-en-Josas": "les loges-en-josas"
    },
    {
        " and worked as a research chemist and a sales manager in ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ". She married and had three children between the late 42s and early 42s.       In 42 Boisselier converted to ": null
    },
    {
        "Raëlism": "raëlism"
    },
    {
        ", a ": null
    },
    {
        "UFO religion": "ufo religion"
    },
    {
        " founded by the French journalist ": null
    },
    {
        "Claude Vorilhon": "claude vorilhon"
    },
    {
        ", usually known as Raël, in 42 After attending a meeting at which Raël spoke, she felt strongly that he was completely honest and joined his movement. She had left her husband, alleging violent behavior, shortly before her conversion; afterwards, owing to her involvement with Raëlism, he gained sole custody of their youngest child. Boisselier believed that religious intolerance motivated a court to transfer the childs custody. Although her faith led to tension with her parents, her eldest child converted. In the 42s, Raëlism was seen as dangerous and viewed with disdain in France, resulting in loss of employment for prominent members. The hostility was fueled in part by public concerns about ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        "s after deaths caused by the ": null
    },
    {
        "Order of the Solar Temple": "order of the solar temple"
    },
    {
        " in Europe during the mid42s.     Boisselier became the scientific director of ": null
    },
    {
        "Clonaid": "clonaid"
    },
    {
        ", an organization founded by Raël that sought to clone humans, in 42 That year, Boisselier was interviewed by  Le Monde  about her role in Clonaid, and she lost her position with Air Liquide after the company learned of this. Air Liquide stated that her termination was due to her holding dual employment, and that she was strained by her Clonaid service. She filed a lawsuit against Air Liquide, arguing that she was the victim of religious discrimination. Her suit was successful: in 42 she won a judgment of about US$42.     After losing her job, Boisselier moved with her middle child, a son, to Quebec, where her eldest daughter was a student. Boisselier began to travel to discuss Clonaid, eventually becoming a high-profile speaker. Around that time, she reached the rank of Bishop within Raëlism. She was one of the 42 members closest to Raël and joined the groups ": null
    },
    {
        "Order of Angels": "raëlismwomen-only groups"
    },
    {
        ", which promoted ": null
    },
    {
        "free love": "free love"
    },
    {
        " and femininity. She moved to the United States and began teaching at ": null
    },
    {
        "State University of New York at Plattsburgh": "state university of new york at plattsburgh"
    },
    {
        " for a short time before moving to ": null
    },
    {
        "Hamilton College": "hamilton college"
    },
    {
        " in 42 to teach chemistry. Her association with Clonaid was publicized in the U.S. in February 42 and she resigned her academic position that May, although she had a three-year contract. She claimed she was initially popular at Hamilton College, but felt that she was disrespected after her association with Clonaid was publicized.     Now going by the last name Hanly, Brigitte now runs a stem cell clinic in San Jose del Cabo, Mexico. Called Stemaid  the clinic provides what it claims to be embryonic stems cells to patients. Though, there is no word where the lab that created these cells is.           Raël founded Clonaid in March 42 shortly after the ": null
    },
    {
        "Dolly the Sheep": "dolly"
    },
    {
        " cloning, believing that the process was important because the human species had been created by an extraterrestrial cloning project. On a practical level, Raël promoted the practice as a way to develop more desirable genetics and eventually prolong memories in new bodies. Shortly after Clonaids launch, Boisselier began publicizing and managing its operations. In 42 she announced that she had set up cloning laboratories and had hired a team of six scientists. She said she had limited knowledge of cloning but was skilled in selecting experts.     In August 42 Mark Hunt, a politician from ": null
    },
    {
        "West Virginia": "west virginia"
    },
    {
        ", asked Boisselier to clone his late son, who had died as a child. Hunt paid Clonaid $42 and helped them rent a science laboratory from a school. Boisselier said that the laboratory would initially be used to clone cattle, before moving on to humans. She planned to use a number of Raëlian surrogates, who were willing to abort abnormal pregnancies, to bear clones; the high number of women would compensate for the low odds of a healthy child for each implantation. In September 42 Raël and Boisselier held a press conference with several aspiring surrogate mothers of clones. At the event, Boisselier announced the construction of a cloning laboratory and vaguely described Hunt, who wished to remain anonymous. Boisselier received significant media attention as an advocate of cloning. Some commentators initially accepted her work as a legitimate attempt at cloning; Margaret Talbot of the New York Times described her as a more credible spokesperson than Raël, projecting what she described as an air of cool, academic professionalism . Boisseliers striking physical appearance drew particular attention, and she developed an avant-garde, stylish reputation, contrary to popular images of scientists.          In early 42 Boisselier promised the cloning of a human child within a year, drawing further attention to her work. A prosecutor in New York began investigating her compliance with local medical laws. Boisselier said that the ": null
    },
    {
        "Food and Drug Administration": "food and drug administration"
    },
    {
        " also surreptitiously investigated her, and Raël claimed that U.S. President ": null
    },
    {
        "George W. Bush": "george w. bush"
    },
    {
        " was concerned about Clonaids work. The caretaker of the laboratory that Hunt had rented grew suspicious about their work and contacted law enforcement. They spoke with the FDA, who searched the site and persuaded Boisselier to suspend her cloning work pending legal clarification. After Hunt was asked by the laboratorys caretaker to shut down the cloning operation, he broke with Boisselier and criticized her for seeking media attention. The caretaker also spoke publicly, saying that Boisselier was seldom at the laboratory. Boisselier then announced that she was moving her cloning operations overseas. Boisselier never faced any legal charges in connection with the laboratory.     In March 42 Boisselier was invited to speak at a U.S. Congress hearing on human cloning, and at her insistence Raël was permitted to speak as well. The event garnered public attention, in large part because of Raëls unconventional appearance. On August 42 42 Boisselier attended a widely publicized human cloning symposium at the ": null
    },
    {
        "National Academy of Sciences": "national academy of sciences"
    },
    {
        " in Washington, D.C., Significant media attention was given to Boisselier, who, along with ": null
    },
    {
        "Severino Antinori": "severino antinori"
    },
    {
        " and ": null
    },
    {
        "Panayiotis Zavos": "panayiotis zavos"
    },
    {
        ", was one of three participants actively engaged in efforts to produce a human clone. The rest of the attendees were renowned scientists and ethicists, one of whom, ": null
    },
    {
        "Arthur Caplan": "arthur caplan"
    },
    {
        ", dismissed Boisselier as part of the loony cloning element . By May 42 Boisselier said that she had facilitated 42 to 42 pregnancies but had been thwarted by miscarriages.       Boisselier confidently announced at a press conference in Florida in December 42 that Clonaid had successfully produced a live-born clone, named Eve, for an infertile couple. Canadian sociologist ": null
    },
    {
        "Susan J. Palmer": "susan j. palmer"
    },
    {
        " notes that naming the cloned child Eve recalls Raëls teachings that aliens created the first humans through cloning. After the announcement, Boisselier received abundant press, but the media, particularly late-night comedy programs, criticized her glamorous appearance and mocked Raëlism. Around that time, Boisselier appeared on many U.S. network news broadcasts and on ": null
    },
    {
        "CNN": "cnn"
    },
    {
        ". She did not provide details about the child or its family, although she was often asked to. She hired a science editor from ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " to supervise verification of the cloning. Many scientists doubted that the Raëlians could overcome the difficulties that human cloning posed, or that they would be able to produce a healthy child. Boisselier said a DNA test was forthcoming and announced that five more clones would be born later that winter. As Raël and Boisselier continued to seek media exposure, journalistic animosity towards them grew.     ": null
    },
    {
        "Bernard Siegel": "bernard siegel"
    },
    {
        ", an attorney from Florida, learned of the case and felt that a hearing should be held about Eves welfare. In January 42 he initiated legal proceedings, seeking to bring the clones parents to court so its health could be verified. Raël and Boisselier attacked the filing as an attempt to take a child from loving parents and announced that, in protest, they would not provide DNA for testing. An arraignment occurred on January 42 and was televised live on CNN; Boisselier and Clonaids vice president, Thomas Kaenzig, were subpoenaed in lieu of the childs parents. In courtroom testimony, the vice president of Clonaid said he knew very little about the clone, and that Boisselier controlled all the information. She did not attend the hearing, and Kaenzig provided little information, angering the judge, who threatened ": null
    },
    {
        "contempt of court": "contempt of court"
    },
    {
        " charges. Boisselier attended a second hearing on January 42 telling the court that the child was in Israel. The judge then ruled that the court had no jurisdiction. In late January, the science editor announced that he suspected the cloning announcements were a hoax. Around that time, Boisselier held a press conference at which she announced that the cloned babys parents had cut off contact with her and would never speak to the press.     In the following years, Boisselier claimed to have facilitated the cloning of several children in a variety of countries. As of June 42 she reported that Clonaid has successfully cloned 42 children. She did not provide evidence to verify the claims. She stated that the a machine called the RMX 42 was used in the cloning attempts, and exhibited it publicly.     After Boisselier announced that no evidence of the cloning would be provided, journalists became very skeptical of her story. While discussing Boisseliers management of Clonaid, Palmer notes that it is impossible to know why she stated that a clone was produced but then refused to provide evidence. She argues that her refusal to provide evidence may have been because she organized a hoax, did not wish to publicize the birth of an unhealthy child, or was taken advantage of by a scientist she had hired. American science journalist Steven S. Hall criticized the media for their coverage of Clonaid, believe that they were inarticulately represented as a credible group. He speculates that the coverage of Boisselier and other cloning adherents galvanized sentiment against cloning, leading to its banning in the U.S.         In January 42 Raël held a ceremony at which he thanked Boisselier for her service and anointed her as his successor. He praised her for spreading the message of Raëlism internationally while publicizing the cloning. In the Raëlian hierarchy, she is one level below Raël and serves as a spokesperson for the movement. As a leader, she has attempted to rehabilitate the ": null
    },
    {
        "swastika": "swastika"
    },
    {
        ", one of the groups symbols. She maintains that it is valuable as an ancient symbol of peace, and that it has been unfairly associated with ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ".     In the mid42s, Boisselier often taught about the Raëlian perspective of the body and sexuality. She discussed these topics from a biological perspective, arguing that humans are essentially robots because they can be reprogrammed. Specifically, she maintained that hormones program the brain, and they provide humans with the freedom to choose from many possibilities. Raëlians emphasize sexual stimulation as a way to positively change their members, and Boisselier has stated that she sees the pursuit of femininity as a method of spiritual growth. The group highly values feminine beauty, and Raël has applauded Boisselier for maintaining her appearance, casting her as a role model.     By 42 Boisselier had taken the name Brigitte Roehr and was living in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ". That year, she began leading a Raëlian project to fight ": null
    },
    {
        "female genital mutilation": "female genital mutilation"
    },
    {
        ". She heads a Raëlian-affiliated group known as ": null
    },
    {
        "Clitoraid": "clitoraid"
    },
    {
        ", which raises funds to provide restorative surgery to women with damaged ": null
    },
    {
        "clitoris": "clitoris"
    },
    {
        "es. The project, which has attracted criticism of its effectiveness, aims to build a hospital in ": null
    },
    {
        "Burkina Faso": "burkina faso"
    },
    {
        " where women can receive clitoral surgery.": null
    }
]