[
    {
        "   The Broads Authority is the agency which has statutory responsibility for ": null
    },
    {
        "the Broads": "the broads"
    },
    {
        " in England. Originally, the ": null
    },
    {
        "Nature Conservancy Council": "nature conservancy council"
    },
    {
        " , pressed for a special authority to manage the Broads which had been neglected for a long time. In 42 the forerunner to the present-day Broads Authority was established by the Countryside Commission . Ten years later, it had become clear that a statutory body was needed, and a special ": null
    },
    {
        "Act of Parliament": "act of parliament"
    },
    {
        ", The Norfolk and Suffolk Broads Act 42  made the Broads Authority into a special statutory authority which gave it parity yet establishing key differences with ": null
    },
    {
        "national park": "national park"
    },
    {
        " authorities.       The Broads Authority has to:   conserve and enhance the natural beauty, wildlife and cultural heritage of the Broads   promote opportunities for the understanding and enjoyment of the special qualities of the Broads by the public   protect the interests of ": null
    },
    {
        "navigation": "navigation"
    },
    {
        "    have regard for ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        " and ": null
    },
    {
        "forestry": "forestry"
    },
    {
        " economic": "economic"
    },
    {
        " and ": null
    },
    {
        "social": "social issues"
    },
    {
        " interests of those who live or work in the Broads.       In 42 the Broads Authority promoted a second act, the primary purpose of which was to introduce greater safety controls on the broads and rivers. The ": null
    },
    {
        "Broads Authority Act 42": "broads authority act 2009"
    },
    {
        " received Royal Assent in July 42       The Broads Authority is not democratically elected. Members are either co-opted from local authorities or appointed by the ": null
    },
    {
        "Secretary of State": "secretary of state"
    },
    {
        " for the Environment. The Broads Authority was formerly represented by one member on the ": null
    },
    {
        "East of England Regional Assembly": "east of england regional assembly"
    }
]