[
    {
        "              A broch  is an ": null
    },
    {
        "Iron Age": "British Iron Age"
    },
    {
        " drystone": "Drystone"
    },
    {
        " hollow-walled structure found in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ". Brochs belong to the classification complex ": null
    },
    {
        "atlantic roundhouse": "Atlantic Roundhouse"
    },
    {
        " devised by Scottish ": null
    },
    {
        "archaeologists": "Archaeologist"
    },
    {
        "in the 1980s. Their origin is a matter of some controversy.          The word broch is derived from ": null
    },
    {
        "Lowland Scots": "Scots Language"
    },
    {
        " brough, meaning fort. In the mid-19th century Scottish ": null
    },
    {
        "antiquaries": "Antiquarian"
    },
    {
        " called brochs burgs, after ": null
    },
    {
        "Old Norse": "Old Norse"
    },
    {
        " , with the same meaning. Place names in Scandinavian Scotland such as Burgawater and Burgan show that Old Norse  is the older word used for these structures in the north. Brochs are often referred to as  dun s in the west. Antiquarians began to use the spelling broch in the 1870s.     A precise definition for the word has proved elusive. Brochs are the most spectacular of a complex class of roundhouse buildings found throughout Atlantic Scotland. The ": null
    },
    {
        "Shetland Amenity Trust": "Shetland Amenity Trust"
    },
    {
        " lists about 120 sites in ": null
    },
    {
        "Shetland": "Shetland"
    },
    {
        " as candidate brochs, while the ": null
    },
    {
        "Royal Commission on the Ancient and Historical Monuments of Scotland": "Royal Commission On The Ancient And Historical Monuments Of Scotland"
    },
    {
        " identifies a total of 571 candidate broch sites throughout the country. Researcher Euan MacKie has proposed a much smaller total for Scotland of 104. Armit p. 16.          The origin of brochs is a subject of continuing research. Sixty years ago most archaeologists believed that brochs, usually regarded as the castles of Iron Age chieftains, were built by immigrants who had been pushed northward after being displaced first by the intrusions of ": null
    },
    {
        "Belgic tribes": "Belgae"
    },
    {
        " into what is now southeast England at the end of the second century BC and later by the ": null
    },
    {
        "Roman invasion": "Scotland During The Roman Empire"
    },
    {
        " of southern Britain beginning in AD 43. Yet there is now little doubt that the hollow-walled broch tower was purely an invention in what is now Scotland; even the kinds of pottery found inside them that most resembled south British styles were local hybrid forms. The first of the modern review articles on the subject MacKie, E. W. The origin and development of the broch and wheelhouse building cultures of the Scottish Iron Age. Proceedings of the Prehistoric Society 31, pp. 93–146. did not, as is commonly believed, propose that brochs were built by immigrants, but rather that a hybrid culture formed from the blending of a small number of immigrants with the native population of the Hebrides produced them in the first century BC, basing them on earlier, simpler, promontory forts. This view contrasted, for example, with that of Sir ": null
    },
    {
        "W. Lindsay Scott": "W. Lindsay Scott"
    },
    {
        ", who argued, Scott, Sir Lindsay , The problem of the brochs, Proceedings of the Prehistoric Society 13, pages 1–36. following Childe , Childe, V. G. The Prehistory of Scotland. London. for a wholesale migration into Atlantic Scotland of people from southwest England.     MacKies theory has fallen from favour too, mainly because starting in the 1970s there was a general move in archaeology away from diffusionist explanations towards those pointing to exclusively indigenous development. Meanwhile, the increasing number – albeit still pitifully few – of ": null
    },
    {
        "radiocarbon": "Radiocarbon"
    },
    {
        " dates for the primary use of brochs still suggests that most of the towers were built in the 1st centuries BC and AD. Parker Pearson, M. & Sharples, N. et al. Between land and sea: excavations at Dun Vulan, South Uist. Sheffield. A few may be earlier, notably the one proposed for ": null
    },
    {
        "Old Scatness Broch": "Old Scatness Broch"
    },
    {
        " in Shetland, where a sheep bone dating to 390–200 BC has been reported. Dockrill, S. J., Outram, Z. and Batt, C. M. Time and place: a new chronology for the origin of the broch based on the scientific dating programme at the Old Scatness Broch, Shetland, PSAS, v. 136, pp. 89-110;      The other broch claimed to be substantially older than the 1st century BC is ": null
    },
    {
        "Crosskirk": "Crosskirk Broch"
    },
    {
        " in Caithness, but a recent review of the evidence suggests that it cannot plausibly be assigned a date earlier than the 1st centuries BC/AD. MacKie, E. W. The Roundhouses, Brochs and Wheelhouses of Atlantic Scotland c. 700 BC – AD 500: architecture and material culture. Part 2 The Mainland and the Western Islands. British Archaeological Reports British Series. Oxford. For the C14 dates for the Shetland sites see   Retrieved 14 August 2007.          The distribution of brochs is centred on northern Scotland. ": null
    },
    {
        "Caithness": "Caithness"
    },
    {
        ", Sutherland and the ": null
    },
    {
        "Northern Isles": "Northern Isles"
    },
    {
        " have the densest concentrations, but there are a great many examples in the west of Scotland and the ": null
    },
    {
        "Hebrides": "Hebrides"
    },
    {
        ". Although mainly concentrated in the northern Highlands and the Islands, a few examples occur in the ": null
    },
    {
        "Borders": "Scottish Borders"
    },
    {
        " , on the west coast of ": null
    },
    {
        "Dumfries and Galloway": "Dumfries And Galloway"
    },
    {
        ", and near ": null
    },
    {
        "Stirling": "Stirling"
    },
    {
        ". In a c.1560 sketch there appears to be a broch by the river next to ": null
    },
    {
        "Annan Castle": "Annan Castle"
    },
    {
        " in Dumfries and Galloway.  This small group of southern brochs has never been satisfactorily explained.             The original interpretation of brochs, favoured by nineteenth century antiquarians, was that they were defensive structures, places of refuge for the community and their livestock. They were sometimes regarded as the work of Danes or Picts. From the 1930s to the 1960s, archaeologists such as ": null
    },
    {
        "V. Gordon Childe": "V. Gordon Childe"
    },
    {
        " and later John Hamilton Hamilton, J.R.C. Excavations at Clickhimin, Shetland. Edinburgh. regarded them as castles where local landowners held sway over a subject population.     The castle theory fell from favour among Scottish archaeologists in the 1980s, due to a lack of supporting archaeological evidence. These archaeologists suggested defensibility was never a major concern in the siting of a broch, and argued that they may have been the ": null
    },
    {
        "stately homes": "Stately Home"
    },
    {
        " of their time, objects of prestige and very visible demonstrations of superiority for important families . Once again, however, there is a lack of archaeological proof for this reconstruction, and the sheer number of brochs, sometimes in places with a lack of good land, makes it problematic.     Brochs close groupings and profusion in many areas may indeed suggest that they had a primarily defensive or even offensive function. Some of them were sited beside precipitous cliffs and were protected by large ramparts, artificial or natural: a good example is at Burland near Gulberwick in ": null
    },
    {
        "Shetland": "Shetland"
    },
    {
        ", on a clifftop and cut off from the mainland by huge ditches. Often they are at key strategic points. In Shetland they sometimes cluster on each side of narrow stretches of water: the broch of ": null
    },
    {
        "Mousa": "Mousa"
    },
    {
        ", for instance, is directly opposite another at Burraland in Sandwick. In ": null
    },
    {
        "Orkney": "Orkney"
    },
    {
        " there are more than a dozen on the facing shores of Eynhallow Sound, and many at the exits and entrances of the great harbour of ": null
    },
    {
        "Scapa Flow": "Scapa Flow"
    },
    {
        ". In ": null
    },
    {
        "Sutherland": "Sutherland"
    },
    {
        " quite a few are placed along the sides and at the mouths of deep valleys. Writing in 1956 John Stewart suggested that brochs were forts put up by a military society to scan and protect the countryside and seas. Stewart, J. An Outline of Shetland Archaeology, Lerwick: Shetland Times Ltd.     Finally, some archaeologists consider broch sites individually, doubting that there ever was a single common purpose for which every broch was constructed. There are differences between the various areas in which brochs are found, with regard to position, dimensions and likely status. For example, the broch villages which occur at a few places in ": null
    },
    {
        "Orkney": "Orkney"
    },
    {
        " have no parallel in the ": null
    },
    {
        "Western Isles": "Western Isles"
    },
    {
        ".       Generally, brochs have a single entrance with bar-holes, door-checks and lintels. There are mural cells and there is a scarcement , perhaps for timber-framed lean-to dwellings lining the inner face of the wall. Also there is a spiral staircase winding upwards between the inner and outer wall and connecting the galleries. Prehistoric Scotland Brochs vary from 5 to 15  metres in internal diameter, with 3  metre thick walls. On average, the walls only survive to a few metres in height. There are five extant examples of towers with significantly higher walls: ": null
    },
    {
        "Dun Carloway": "Dun Carloway"
    },
    {
        " on ": null
    },
    {
        "Lewis": "Isle Of Lewis"
    },
    {
        ", ": null
    },
    {
        "Dun Telve": "Dun Telve"
    },
    {
        " and ": null
    },
    {
        "Dun Troddan": "Dun Troddan"
    },
    {
        " in ": null
    },
    {
        "Glenelg": "Glenelg, Scotland"
    },
    {
        ", ": null
    },
    {
        "Mousa": "Broch Of Mousa"
    },
    {
        " in Shetland and ": null
    },
    {
        "Dun Dornaigil": "Dun Dornaigil"
    },
    {
        " in Sutherland, all of whose walls exceed 6.5  m in height. Armit p. 55.     Mousas walls are the best preserved and are still 13  m tall; it is not clear how many brochs originally stood this high. A frequent characteristic is that the walls are galleried: with an open space between, the outer and inner wall skins are separate but tied together with linking stone slabs; these linking slabs may in some cases have served as steps to higher floors. It is normal for there to be a cell breaking off from the passage beside the door; this is known as the guard cell. It has been found in some Shetland brochs that guard cells in entrance passageways are close to large door-check stones. Although there was much argument in the past, it is now generally accepted among archaeologists that brochs were roofed, perhaps with a conical timber framed roof covered with a locally sourced thatch. The evidence for this assertion is still fairly scanty, although excavations at Dun Bharabhat, Lewis, may support it. The main difficulty with this interpretation continues to be the potential source of structural timber, though bog and driftwood may have been plentiful sources.      On the islands of ": null
    },
    {
        "Orkney": "Orkney"
    },
    {
        " and ": null
    },
    {
        "Shetland": "Shetland"
    },
    {
        " there are very few cells at ": null
    },
    {
        "ground floor": "Ground Floor"
    },
    {
        ". Most brochs have scarcements which may have allowed the construction of a very sturdy wooden first floor , and excavations at Loch na Berie on the Isle of Lewis show signs of a further, second floor . Some brochs such as Dun Dornaigil and ": null
    },
    {
        "Culswick": "Culswick"
    },
    {
        " in Shetland have unusual triangular lintels above the entrance door.   The Megalithic Portal. Retrieved 11 May 2008.   RockStanza; retrieved 11 May 2008.     As in the case of ": null
    },
    {
        "Old Scatness": "Old Scatness"
    },
    {
        " in Shetland , brochs were sometimes located close to ": null
    },
    {
        "arable land": "Arable Land"
    },
    {
        " and a ": null
    },
    {
        "source of water": "Water Supply"
    },
    {
        " . Hogan, C. Michael   The Megalithic Portal; retrieved 11 May 2008. Sometimes, on the other hand, they were sited in wilderness areas . Brochs are often built beside the sea ; sometimes they are on islands in ": null
    },
    {
        "lochs": "Lochs"
    },
    {
        " .     About 20 Orcadian broch sites include small settlements of stone buildings surrounding the main tower. Examples include Howe, near ": null
    },
    {
        "Stromness": "Stromness"
    },
    {
        ", ": null
    },
    {
        "Gurness Broch": "Gurness Broch"
    },
    {
        " in the north west of ": null
    },
    {
        "Mainland, Orkney": "Mainland, Orkney"
    },
    {
        ", Midhowe on ": null
    },
    {
        "Rousay": "Rousay"
    },
    {
        " and Lingro near ": null
    },
    {
        "Kirkwall": "Kirkwall"
    },
    {
        " . There are broch village sites in Caithness, but elsewhere they are unknown. Armit pp. 95-106.     Most brochs are unexcavated. Armit p. 51 notes that of 140 Atlantic roundhouses in the ": null
    },
    {
        "Outer Hebrides": "Outer Hebrides"
    },
    {
        " only 14 have been at least partially excavated . Those that have been properly examined show that they continued to be in use for many centuries, with the interiors often modified and changed, and that they underwent many phases of habitation and abandonment. The end of the broch building period seems to have come around AD 100–200.            The ": null
    },
    {
        "Crucible of Iron Age Shetlands": "Crucible Of Iron Age Shetland"
    },
    {
        "Mousa, Old Scatness and Jarlshof sites are on the United Kingdom Tentative List of possible nominations for the ": null
    },
    {
        "UNESCO": "Unesco"
    },
    {
        " World Heritage Programme": "World Heritage Sites"
    },
    {
        " list of sites of outstanding cultural or ": null
    },
    {
        "natural": "Natural"
    },
    {
        " importance to the common ": null
    },
    {
        "heritage": "Cultural Heritage"
    },
    {
        " of ": null
    },
    {
        "humankind": "Humankind"
    },
    {
        ". This list, published in July 2010, includes sites that may be nominated for inscription over the next 5–10 years. ": null
    }
]