[
    {
        "      Brunhild, also known as Brunhilda or Brynhild , is a powerful female figure from Germanic heroic legend. She may have her origins in the ": null
    },
    {
        "Visigothic": "visigoths"
    },
    {
        " princess ": null
    },
    {
        "Brunhilda of Austrasia": "brunhilda of austrasia"
    },
    {
        ".     In the Norse tradition, Brunhild is a ": null
    },
    {
        "shieldmaiden": "shieldmaiden"
    },
    {
        " or ": null
    },
    {
        "valkyrie": "valkyrie"
    },
    {
        ", who appears as a main character in the  and some ": null
    },
    {
        "Eddic poems": "poetic edda"
    },
    {
        " treating the same events. In the continental Germanic tradition, where she is a central character in the , she is a powerful Amazon-like queen. In both traditions, she is instrumental in bringing about the death of the hero ": null
    },
    {
        "Sigurd or Siegfried": "sigurd"
    },
    {
        " after he deceives her into marrying the ": null
    },
    {
        "Burgundian": "burgundians"
    },
    {
        " king ": null
    },
    {
        "Gunther or Gunnar": "gunther"
    },
    {
        ". In both traditions, the immediate cause for her desire to have Sigurd murdered is a quarrel with the heros wife, ": null
    },
    {
        "Gudrun or Kriemhild": "gudrun"
    },
    {
        ". In the Scandinavian tradition, but not in the continental tradition, Brunhild kills herself after Sigurds death.     ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        " made Brunhild  an important character in his opera cycle . The majority of modern conceptions of the figure have been inspired or influenced by Wagners depiction.     Brunhild has been called the paramount figure of Germanic legend.  The  introduces her by saying:          The name Brunhild in its various forms is derived from the equivalents of ": null
    },
    {
        "Old High German": "old high german"
    },
    {
        "  and  . The name is first attested in the sixth century, for the historical ": null
    },
    {
        "Brunhilda of Austrasia": "brunhilda of austrasia"
    },
    {
        ", as .     In the context of the heroic tradition, the first element of her name may be connected to Brunhilds role as a ": null
    },
    {
        "shieldmaiden": "shieldmaiden"
    },
    {
        ".     In the Eddic poem , the valkyrie  from  is identified with Brunhild. This name consists of the elements  and  and can be translated as driver to victory . It could simply be a synonym for ": null
    },
    {
        "valkyrie": "valkyrie"
    },
    {
        ".       The most popular theory about the origins of the legendary Brunhild is that she originates from two historical figures of the ": null
    },
    {
        "Merovingian dynasty": "merovingian dynasty"
    },
    {
        ": ": null
    },
    {
        "Brunhilda of Austrasia": "brunhilda of austrasia"
    },
    {
        ", a ": null
    },
    {
        "Visigothic": "visigoths"
    },
    {
        " princess who married the ": null
    },
    {
        "Frankish": "franks"
    },
    {
        " king ": null
    },
    {
        "Sigebert I": "sigebert i"
    },
    {
        ", and ": null
    },
    {
        "Fredegund": "fredegund"
    },
    {
        ", who was married to Sigeberts brother ": null
    },
    {
        "Chilperic I": "chilperic i"
    },
    {
        ". Frankish historian ": null
    },
    {
        "Gregory of Tours": "gregory of tours"
    },
    {
        " blames Fredegund for Sigeberts murder in 42 after which Fredegund and Brunhild carried on a feud that lasted until 42 when Chilperics son ": null
    },
    {
        "Chlothar II": "chlothar ii"
    },
    {
        " captured and killed her. If this theory is correct, then Brunhild has essentially taken the role of Fredegund in the Nibelungen story while maintaining Brunhilda of Austrasias name.     A less widely accepted theory locates the origins of the Brunhild figure in the story of the ": null
    },
    {
        "Ostrogothic": "ostrogoths"
    },
    {
        " general ": null
    },
    {
        "Uraias": "uraias"
    },
    {
        ". Uraiass wife insulted the wife of the Ostrogothic king ": null
    },
    {
        "Witiges": "witiges"
    },
    {
        ", and the kings wife then had Witiges murder Uraias.       Brunhild was a popular figure in Scandinavia, with traditions about her firmly attested around 42 with the composition of the Prose Edda. The Scandinavian tradition about Brunhild shows knowledge of the continental Germanic traditions as well.     Prose Edda   The so-called ": null
    },
    {
        "Prose Edda": "prose edda"
    },
    {
        " of ": null
    },
    {
        "Snorri Sturluson": "snorri sturluson"
    },
    {
        " is the earliest attestation of the Scandinavian version of Brunhilds life, dating to around 42 Snorri tells the story of Brunhild in several chapters of the section of the poem called Skáldskaparsmál. His presentation of the story is very similar to that found in the Völsunga saga , but is considerably shorter.     After Sigurd kills the dragon Fafnir, he rides up to a house on a mountain, inside of which he finds a woman sleeping wearing armor. He cuts the armor from her, and she wakes up, and says that she was a valkyrie named Hild, but called Brunhild. Sigurd then rides away.     Later, Sigurd brings Gunnar to Brunhilds brother ": null
    },
    {
        "Atli": "attila"
    },
    {
        " to ask for Brunhilds hand in marriage. Brunhild lives on a mountain called Hindarfjall, where she is surrounded by a wall of flame. Atli tells them that Brunhild will only marry a man who rides through the flame. Gunnar is unable to do this, and Sigurd switches shapes with him, riding through the flames. Sigurd then weds Brunhild as Gunnar, but places a sword between the two of them on their wedding night. The next morning, he gives Brunhild a ring from the hoard of the Nibelungen, and Brunhild gives him a ring in return. Gunnar and Sigurd then return to their own shapes and return to the court of Gunnars father Gjuki.     Some time later, Brunhild and ": null
    },
    {
        "Gudrun": "gudrun"
    },
    {
        " quarrel while washing their hair in the river. Brunhild says that she does not want the water that passes through Gudruns hair to touch her own, because her husband Gunnar is braver. Gudrun replies with Sigurds deeds of killing the dragon, but Brunhild says that only Gunnar had dared to ride through the wall of flame. Then Gudrun reveals to Brunhild that Sigurd was the one who rode through the wall, producing Brunhilds ring as proof. Brunhild then encourages Gunnar to kill Sigurd, which eventually he does. Once Sigurd is dead, Brunhild kills herself, and is burned on the same pyre as Sigurd. It is possible that Snorris account of the quarrel between Brunhild and Gudrun derives from a lost Eddic poem.     Poetic Edda Poetic Edda , a collection of heroic and mythological Nordic poems, appears to have been compiled around 42 in Iceland, and assembles mythological and heroic songs of various ages. A large number of poems deal with the relationship between Sigurd and Brunhild, which seems to have been of special interest to the compiler.     Generally, none of the poems in the collection is thought to be older than 42 and some appear to have been written in the thirteenth century. It is also possible that apparently old poems have been written in an archaicizing style and that apparently recent poems are reworkings of older material, so that reliable dating is impossible. Much of the Brunhild material is taken to have a relatively recent origin.     Grípisspá Grípisspá , Sigurd receives a prophecy of his life from his uncle Grípir. Among the prophesied actions are that he will awaken a valkyrie who will teach him the runes. Later, he will betroth himself to Brunhild at the court of Heimir. He will marry Gudrun but then aid Gunnar in wooing Brunhild, marrying but not sleeping with her. She, however, will later accuse Sigurd of taking her virginity and have him killed.     The poem appears to distinguish between Sigrdrífa in the following Sigrdrífumál and Brunhild as two different women. It also seems to identify Sigrdrífa with the valkyrie ": null
    },
    {
        "Sigrún": "sigrún"
    },
    {
        " from the preceding poems in the Edda about ": null
    },
    {
        "Helgi Hundingsbane": "helgi hundingsbane"
    },
    {
        ".     It is generally taken to be a late poem that was written on the basis of the other poems about Sigurds life.     Fáfnismál Fáfnismál , once Sigurd has tasted the blood of the dragon ": null
    },
    {
        "Fafnir": "fafnir"
    },
    {
        ", Sigurd understands the birds who tell him to go to a palace where the valkyrie Sigrdrífa sleeps surrounded by flames.     Sigrdrífumál Sigrdrífumál , Sigurd rides to the mountain Hindarfjall, where he sees a wall of shields that surround a sleeping woman. The woman is wearing armor that seems to have grown into her skin, and Sigurd uses his sword to cut it open. This awakens the maiden, who explains that she is the valkyrie Sigrdrífa and, in a prose interlude, tells how she had disobeyed ": null
    },
    {
        "Odin": "odin"
    },
    {
        " who then demanded she marry. She refused and said she would only marry a man without fear. She proceeds to teach Sigurd wisdom and the runes.     The condition that Sigrdrífa will only marry a man without fear is the same as Brunhild will later make, perhaps pointing to the two figures originally being identical.     Brot af Sigurðarkviðu Brot af Sigurðarkviðu  is only preserved fragmentarily: the surviving part of the poem tells the story of Sigurds murder. Brunhild has evidently accused Sigurd of having slept with her, and this has caused Gunnar and Högni to have their half-brother ": null
    },
    {
        "Guthorm": "gundomar i"
    },
    {
        " kill Sigurd. Once Sigurd has been murdered, Brunhild rejoices before admitting to Gunnar that Sigurd never slept with her.     Guðrúnarkviða I Guðrúnarkviða I , Brunhild briefly appears while Gudrun mourns the death of Sigurd. Brunhild defends herself against the accusation that she is responsible for Sigurds death and accuses her brother Atli of responsibility. In a prose section at the close of the poem, Brunhild commits suicide with several slaves.     The dialogue between Brunhild and Gudrun is characterized by immense hostility, and Brunhild is portrayed as evil.     Sigurðarkviða hin skamma Sigurðarkviða hin skamma  repeats the story of Sigurd once again. Sigurd wins Brunhild for Gunnar and weds her for him, but the two do not sleep together. Brunhild desires Sigurd, however, and decides to have him killed since she cannot have him. She threatens to leave Gunnar if he does not kill Sigurd, and he agrees. Once Sigurd is dead, Gudrun breaks into a lament, and Brunhild laughs loudly. Gunnar chastises her for this, whereupon Brunhild explains that she never wanted to marry Gunnar and had been forced to by her brother Atli. She had then secretly betrothed herself to Sigurd. Brunhild then gives away all her possessions and kills herself, despite Gunnars attempts to convince her not to. As she dies, she prophesies the future misfortunes of Gudrun and Gunnar. Finally, she asks to be burned on the same pyre as Sigurd.     Although the title indicates the poem is about Sigurd, the majority of the poem is actually concerned with Brunhild, who justifies her actions. The song is generally thought to be a recent composition.     Helreið Brynhildar   At the beginning of  Helreið Brynhildar , Brunhilds corpse is burned and she begins her journey to the ": null
    },
    {
        "Hel": "hel"
    },
    {
        ", the Scandinavian underworld. On her way, she encounters a giant who accuses her of having blood on her hands. In response, Brunhild tells the story of her life, defending herself and justifying her actions. She accuses the Burgundians of having deceived her. Brunhild hopes to spend the afterlife together with Sigurd.     As Brunhild narrates her life, she is clearly identified with the valkyrie Sigrdrífa and combines the story of Sigrdrífas awakening with Sigurds wooing for Gunnar as a single event. Odin himself is portrayed as requiring that only a man who knows no fear could awaken her. The song portrays Brunhild as a victim and she achieves a sort of apotheosis at the end.     Völsunga saga Völsunga saga  tells the fullest version of Brunhilds life in the Scandinavian tradition, explaining many unclear references found in the Poetic Edda. It follows the plot given in the Poetic Edda fairly closely, although there is no indication that the author knew the other text. The author appears to have been working in Norway and to have known the Thidrekssaga , a translation of continental Germanic traditions into Old Norse . Therefore, the Völsunga Saga is dated to sometime in the second half of the thirteenth century. The saga is connected to a second saga,  Ragnars saga Loðbrókar , which follows it in the manuscript, by having ": null
    },
    {
        "Ragnar Lodbrok": "ragnar lodbrok"
    },
    {
        " marry ": null
    },
    {
        "Aslaug": "aslaug"
    },
    {
        ", daughter of Sigurd and Brynhild.     According to the saga, Brunhild is the daughter of Budli and the sister of Atli. She is raised at a place called Hlymdalir by her King Heimir, who is married to her sister Bekkhild. At Hlymdalir she is known as Hild under the helmet  and is raised to be a shieldmaiden or valkyrie. When she is twelve years old, King Agnar steals Brunhilds magical swan shirt, and she is forced to swear an oath of loyalty to him. This causes her to intervene on Angars behalf when he is fighting Hjálmgunnar, despite Odins desire for Hjálmgunnar to win. As punishment, Odin stuck her with a sleep thorn and declared that she must marry. She swore that she would not awaken to marry unless a man came who knew no fear. Odin places the sleeping Brunhild on mount Hindarfjall and surrounds her with a wall of shields.     Eventually, Sigurd comes and awakens Brunhild. She makes foreboding prophecies and imparts wisdom to him. The two promise to marry each other. After this, Brunhild returns to Heimir. One day while Sigurd is hunting, his hawk flies up and lands at the window of the tower where Brunhild is living. Sigurd feels love when he sees her and, despite her insistence she wants only to fight as a warrior, convinces her to renew her vow to marry him. Meanwhile, Gudrun has had a foreboding dream and goes to Brunhild to have her interpret it. Brunhild tells Gudrun all of the misfortune that will befall her.     Soon afterward, Gunnar, Gudruns brother, decides to woo Brunhild to be his wife. Sigurd, who has married Gudrun after having been given a potion to forget his previous vows to Brunhild, aids him. Brunhild can only be wed by a man who will ride through the flames around her tower; Gunnar is unable to do this, so Sigurd takes his shape and performs the deed for him. While Brunhild is reluctant to marry Gunnar, Sigurd in his disguise reminds her of her vow to marry the man who can cross the flames. The two then wed and Sigurd places his sword between them for three nights while they share the marriage bed. Sigurd and Gunnar return to their normal shapes and take Brunhild back to Gunnars hall.     One day, Brunhild and Gudrun are bathing at a river; Brunhild declares that she should not have to use the same water as Gudrun, as her husband is the more important man. Gudrun then reveals that Sigurd had crossed the flames and not Gunnar, and shows a ring that Sigurd had taken from Brunhild and given to her. The next day, the queens continue their quarrel in the kings hall. Brunhild is so full of pain that she takes to bed. She demands vengeance against Sigurd, despite Gunnars attempts to pacify her. Sigurd comes and confesses his love for her, offering to leave Gudrun to be with her, but Brunhild refuses. Afterwards, she demands that Gunnar kill Sigurd. Once the deed is done, Brunhild laughs loudly when she hears Gudruns cry of lament. She reveals that she had slandered Sigurd by claiming that he had slept with her. She then stabs herself, and while dying holds a long conversation with Gunnar in which she prophesies the future. According to her wish, she is burned on the same pyre as Sigurd.          Brunhild lived on as a character in several late medieval and early modern Scandinavian ballads. These often have sources both from the Scandinavian tradition and from the continental tradition, either via the Thidrekssaga or directly from German sources.     In the Danish ballad Sivard og Brynild , Sigurd wins Brunhild on the glass mountain and then gives her to his friend Hagen. One day, Brunhild fights with Sigurds wife Signild, and Signild shows Brunhild a ring that Brunhild had given Sigurd as a love gift. Brynhild then tells Hagen to kill Sigurd, and Hagen does this by first borrowing Sigurds sword then killing him with it. He then shows Brunhild Sigurds head and kills her too when she offers him her love.     A ballad from the ": null
    },
    {
        "Faroe Islands": "faroe islands"
    },
    {
        ", Brynhildar táttur , also tells a version of the story of Brunhild. The original form of this ballad likely dates to the fourteenth century, though it is clear that many variants have been influenced by the Danish ballads. In the ballad, Brunhild refuses all suitors; she will only marry Sigurd. To attract him, she tells her father Budli to create a hall with a wall of fire around her. One day, Gunnar comes and sues for her hand, but she refuses. Then Sigurd comes, breaks through the wall of fire, and they sleep together. When he leaves, however, Gudrun and her mother ": null
    },
    {
        "Grimhild": "grimhild"
    },
    {
        " cast a spell on Sigurd so that he forgets Brunhild and marries Gudrun. Some time later Brunhild and Gudrun argue in the bath, with Gudrun refusing to share water with Brunhild. She reminds Brunhild that Sigurd took her virginity, whereupon Brunhild tells Högni to kill Sigurd. Budli tries unsuccessfully to change his daughters mind; once Sigurd is dead, Brunhild collapses in grief.       The Nibelungenlied represents the first attestation of Brunhild in either the continental or Scandinavian traditions. The German Brunhild was nevertheless still associated with Scandinavia, as shown by her kingdom being located on Island . It has been suggested that this may show knowledge of Norse traditions about Brunhild. In general, the literature that attests the continental tradition shows far less interest in Brunhild than the surviving Scandinavian material.     Nibelungenlied      In the Nibelungenlied, Brunhild is first presented as the ruling queen of Îsland  from her castle of Îsenstein . Some manuscripts spell the name of her kingdom Îsenlant , and it is possible that this is the original form, with the association with Iceland being secondary. Her kingdom is twelve days journey by boat from the ": null
    },
    {
        "Burgundian": "burgundians"
    },
    {
        " capital of ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        ", marking her as living outside the bounds of courtly society.     Brunhild is introduced to the story when word of her immense beauty reaches Worms one day, and King ": null
    },
    {
        "Gunther": "gunther"
    },
    {
        " decides he wishes to marry her. ": null
    },
    {
        "Siegfried": "siegfried"
    },
    {
        ", who is familiar with Brunhild, advises him against this marriage, but Gunther convinces Siegfried to help him woo Brunhild by promising to let Siegfried marry Gunthers sister Kriemhild. Gunther needs Siegfrieds help because Brunhild has set a series of three feats of strength that any suitor for her hand must complete; should the suitor fail any one of these feats, she will kill him. Siegfried agrees to help Gunther by using his ": null
    },
    {
        "cloak of invisibility": "cloak of invisibility"
    },
    {
        "  to aid Gunther during the challenges, while Gunther will simply pretend to accomplish them himself. He and Gunther agree that Siegfried will claim to be Gunthers vassal during the wooing.     When Siegfried and Gunther arrive at Isenstein, Brunhild initially assumes that Siegfried is the suitor, but immediately loses interest in him once he claims that he is Gunthers vassal. With Siegfrieds help, Gunther is able to accomplish all the feats of strength; although Brunhild initially looks like she might renege on the agreement, Siegfried quickly gathers his men from his kingdom in Nibelungenland and brings them to Isenstein. Gunther and Brunhild then agree to marry. The heroes return to Worms with Brunhild, and Siegfried marries Kriemhild at the same time that Brunhild marries Gunther. Brunhild cries seeing this however, believing that the royal princess Kriemhild has been married to a vassal. On her wedding night, when Gunther attempts to sleep with Brunhild, Brunhild quickly overpowers Gunther, tying him up by his hands and feet with her belt and leaving him hanging on a hook until morning. Gunther is forced to rely on Siegfried again, who takes Gunthers shape using his Tarnkappe and is only able to subdue Brunhild due to the Tarnkappe granting him the strength of twelve men. Gunther is secretly present during all of this, and is able to confirm that Siegfried did not sleep with Brunhild. Once Siegfried has subdued Brunhild, Gunther takes Siegfrieds place and takes Brunhilds virginity, which results in the loss of her superhuman strength. As a trophy, Siegfried takes Brunhilds ring and belt, which he later gives to Kriemhild.     It is mentioned that Brunhild and Gunther have a son, whom they name Siegfried. Some years later, Brunhild, still disturbed by Siegfrieds failure to behave as a vassal, convinces Gunther to invite Siegfried and Kriemhild to Worms. Once the guests arrive, Brunhild becomes increasingly insistent that her husband is superior to Kriemhilds. This culminates when the two queens encounter each other in front of the cathedral at Worms, and fight over who has the right to enter first. Brunhild declares that Kriemhild is the wife of a vassal, to which Kriemhild replies that Siegfried has taken Brunhilds virginity, showing her the belt and ring as proof. Brunhild bursts into tears and Kriemhild enters the church before her. Brunhild then goes to Gunther and Gunther forces Siegfried to confirm that this is not the case. However, Brunhild convinces Gunther to murder Siegfried nonetheless. The deed itself is carried out by the Burgundian vassal ": null
    },
    {
        "Hagen": "hagen"
    },
    {
        ", who justifies his action with the sorrow that Siegfried has caused Brunhild.     After this point, Brunhild plays no further role in the story. She is shown to be glad at Kriemhilds suffering, and to continue to hold a grudge against her much later in the text. Her disappearance in the second half of the epic may reflect the sources of the Nibelungenlied, but it also suggests a lack of interest in the character when she is no longer directly relevant to the story.     Nibelungenklage Nibelungenklage  is a sort of sequel to the Nibelungenlied that describes how the survivors of the end of the last poem deal with the catastrophe. After the dead are buried, Dietrich von Bern arranges for a messenger to travel to Worms to inform the Burgundians. The messenger is received by Brunhild, who admits her responsibility for Siegfrieds death and is shown to be greatly saddened by Gunthers death. She calls together all the nobles of the realm to decide on a course of action. Following a period of mourning, Brunhild and Gunthers son Siegfried is crowned as the new king of the Burgundians.     Rosengarten zu Worms Rosengarten zu Worms  version D , Brunhild is mentioned as among the spectators watching the tournament in Kriemhilds rose garden.     Þiðrekssaga Þiðrekssaga  is written in Old Norse, the majority of the material is translated from German  oral tales, as well as possibly some from German written sources such as the Nibelungenlied. Therefore, it is included here. The saga-author can nonetheless be shown to have changed some details to accord with Scandinavian traditions, of which he was aware.     According to the Thidrekssaga, Brunhild is the daughter of king Heimir and lives in the castle of Saegard in ": null
    },
    {
        "Swabia": "swabia"
    },
    {
        ". There she runs a stud farm that produces excellent horses. Sigurd encounters Brunhild shortly after he has killed the dragon Regin; he breaks into her castle and kills several of her warriors, but Brunhild recognizes Sigurd, tells him the names of his parents, and gives him the horse Grani before he leaves.     Later, Sigurd, who has gone to the court of the Burgundians , advises Gunnar to marry Brunhild, and the two go to see her. She is angered that Sigurd has not kept his promise to marry only her—something which was not mentioned in their previous encounter—but Sigurd persuades her to marry Gunnar. She nevertheless refuses to consummate the marriage on the wedding night, and Sigurd must take Gunthers place to take her virginity for Gunnar, which robs her of her strength.     Some time later, while Sigurd is living with the Burgundians, Brunhild begins to quarrel with Sigurds wife Grimhild over which of them has the higher status. One day, Grimhild fails to rise when Brunhild enters the hall. This causes Brunhild to accuse Grimhild of being married to a man without noble birth, whereupon Grimhild produces a ring that Brunhild had given to Sigurd after he had deflowered her, and publicly proclaims that Sigurd and not Gunnar took Brunhilds virginity. Brunhild then convinces Gunnar and Högni to kill Sigurd. Brunhild is shown to be overjoyed once it has occurred. Afterwards, she largely disappears from the saga, though it is mentioned that King Atli visits her among the Burgundians.     Biterolf und Dietleib Biterolf und Dietleib  , a parody of sorts of the heroic world, Brunhild is shown to be concerned with avoiding loss of life in the war between the Burgundians and the heroes of the Dietrich von Bern cycle. She gives Rüdiger, who acts as a messenger for the Dietrich heroes, a lance with a banner on it as a reward for his having done his job well. At a later point, Rüdiger and Brunhild negotiate the transformation of the battle into a tournament, though this quickly becomes an actual battle once more. When the Dietrich heroes succeed in reaching the gates of Worms, Brunhild and the other Burgundian women force a stop to hostilities. In the conciliatory festivities that follow, Brunhild explains that she gave Rüdiger the lance so that all the warriors would be encouraged to show the best of their abilities, not so that any would be killed.     Brunhilds role in Biterolf is usually taken to parodic, and includes the detail that she says that she is afraid of Gunthers strength, whereupon Rüdiger reminds her of her own violent past. That Brunhild has given Etzels most important hero, Rüdiger, a lance to fight against the Burgundians, without however, any of them dying, likely had a strong parodic effect on the poems audience. Biterolf also makes no mention of the hostility between Kriemhild and Brunhild.       If the origin of Brunhild in Brunhilda of Austrasia and Fredegund is correct, then Brunhilds role in Sigurd/Siegfrieds murder would be the oldest part of her legend and an original part of the Sigurd legend. Theodore Andersson has argued that Brunhild was originally the more important figure of the two, as she is the main character in the surviving Eddic poems. Only later, he argues did Sigurd come to be regarded as the more significant figure, as he acquired more stories beyond his murder.     Brunhild is nevertheless first attested as a legendary figure in the Nibelungenlied , with earlier attested placenames derived from the name Brunhild most likely referring to the historical queen.       There is no consensus as to whether Brunhilds identification as a valkyrie in the Norse legends represents an old common Germanic tradition or a late development, unique to the Scandinavian tradition. It is possible that the German Brunhilds immense strength alludes to a mythological past in which she was a valkyrie.     On the other hand, Sigrdrífumál gives the valkyrie whom Sigurd awakens another name, and many of the details about the Norse Brunhild do not accord with her being a valkyrie. It is possible that the Norse Sigurd was originally involved with two separate women, a valkyrie and his sister-in-law, who have been imperfectly merged.  Given the close similarity of Brunhilds awakening in the Scandinavian tradition to the common ": null
    },
    {
        "fairy tale": "fairy tale"
    },
    {
        " of ": null
    },
    {
        "Sleeping Beauty": "sleeping beauty"
    },
    {
        ", some scholars dismiss it as without basis in the original tradition. The existence of a mountain called lectulus Brunihildae in the ": null
    },
    {
        "Taunus": "taunus"
    },
    {
        " may attest to the awakening story in Germany, but it is more likely that this name refers to the historical queen Brunhilda of Austrasia. The superhuman powers Brunhild displays in both traditions may simply be a narrative way to make her an equal to Sigurd.       There is considerable debate about whether the ride through the wall of flames attested in the Norse tradition or the feats of strength attested in the continental tradition represents the version of the wooing of Brunhild. Although the ride through the flames is only attested in Scandinavia, a somewhat similar scene occurs in  Das Lied vom Hürnen Seyfrid  when Siegfried rescues Kriemhild. The feats of strength that Brunhilds suitors must complete in the Nibelungenlied, on the other hand, are paralleled in a Russian fairy tale that also contains a very similar scene in which the bride ties her new husband by his hands and feet on her wedding night. These parallels have led some scholars to argue that the feats of strength are not original to the tradition. Others have argued that the Russian fairy tale may derive from the Nibelungenlied.     Common to all versions of the wooing is that Sigurd takes Gunthers place in the marriage bed in one way or another using deception and marriage, which later provides part of Brunhilds motivation to have him killed.       In the Scandinavian tradition, Brunhild is the sister of Atli ; scholars generally see this as recent development of the saga. The familial connection to Atli provides an additional motivation for Atlis enmity for the Burgundians.     Brunhilds sister in the Scandinavian tradition, Oddrun, also does not seem to be a figure of the traditional legend. The continental tradition makes no reference to Brunhild having any kin at all, whereas the Scandinavian material mentions both a father and a fosterfather, Heimir. Theodore Andersson writes that the family looks like a late speculative attempt to domesticate in the style of other heroic stories.        Though it is only attested in the Norse tradition, it seems likely that the German Siegfried also had prior involvement with Brunhild before he wooed her for Gunther—the Nibelungenlied strongly hints that the two already know each other. Brunhilds original motivation for having Sigurd killed seems to have been her public dishonor, the only motivation observable in the Nibelungenlied and the Brot af Sigurðarkviðu. Her motivation as a scorned lover, which is introduced in the Sigurðarkviða hin skamma and reaches its apex in the Völsunga saga, is likely a later development of the Norse tradition and is possibly inspired by the story of ": null
    },
    {
        "Tristan and Iseult": "tristan and iseult"
    },
    {
        ".       Theodore M. Andersson and Hans Kuhn have both argued that Brunhilds suicide is a later development in the tradition, possibly modeled after the presumed original death of Gudrun/Kriemhild in the burning of Atli/Etzels hall.          Modern reception of Brunhild in Germany begins with the 42 rediscovery of the Nibelungenlied; early reception of the poem, however, largely focused on the figure of Kriemhild rather than Brunhild. In Scandinavia, the so-called Scandinavian Renaissance meant that traditions of Brunhild from the Edda remained somewhat more current and even influenced the Scandinavian ballad tradition to some degree, in which Brunhild also played a role.     Brunhild became a more important character in Germany with the introduction of the Norse material to a German audience. The Norse versions of the material were seen as more original and Germanic , and were thus often preferred to the courtly Nibelungenlied. In ": null
    },
    {
        "Friedrich Hebbel": "friedrich hebbel"
    },
    {
        "s three-part tragedy Die Nibelungen, Brunhild comes to symbolize a heathen past that must be overcome by Christianity, represented by ": null
    },
    {
        "Dietrich von Bern": "dietrich von bern"
    },
    {
        ".     Richard Wagners four-part opera cycle  Ring des Nibelungen  makes Brunhild into a major character, mostly according to the Old Norse sources, but Wagner occasionally took elements from the Nibelungenlied or invented them himself. Wagner refers to his Brunhild character as Brünnhilde, deriving the -e ending from the dative of the Middle High German name and likely respelling Brün- as Brünn- to make the connection to modern German Brünne more obvious. Wagners depiction of the character has largely eclipsed the original sources in the popular imagination, with most modern references to Brunhild deriving from Wagner in one way or another, particularly outside of Germany and Scandinavia.     Brunhild also plays a major role in the first film of ": null
    },
    {
        "Fritz Lang": "fritz lang"
    },
    {
        "s duology  Die Nibelungen . Here, she is largely based on her role in the Nibelungenlied, but also features some elements taken from the Norse tradition, namely her relationship to Siegfried and her suicide.     The majority of modern reception of the figure in comic books, video games, etc. does not engage directly with the medieval sources.     The ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        "  Thor  character of ": null
    },
    {
        "Brunnhilde/Valkyrie": "valkyrie"
    },
    {
        " is based off the Norse mythological figure of the same name and has appeared in movies, animated shows and games.       ": null
    }
]