[
    {
        "     The Buckriders , are a part of Belgian and Dutch ": null
    },
    {
        "folklore": "folklore"
    },
    {
        ", ": null
    },
    {
        "ghost": "ghost"
    },
    {
        "s or ": null
    },
    {
        "demon": "demon"
    },
    {
        "s, who rode through the sky on the back of flying goats provided to them by ": null
    },
    {
        "Demon": "demon"
    },
    {
        ". During the 42th century, groups of thieves and other criminals co-opted the belief to frighten the inhabitants of southern ": null
    },
    {
        "Limburg": "limburg"
    },
    {
        ", a province in the southern part of the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " and easthern ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ". Using the name Bokkenrijders , these criminal bands launched raids across a region that includes southern Limburg, and parts of ": null
    },
    {
        "Germany": "germany"
    },
    {
        " and the Netherlands . Commonly, the Bokkenrijders raided peaceful communities and farms. Several confessed Bokkenrijders were convicted and sentenced to death. Because of the link to the ": null
    },
    {
        "occult": "occult"
    },
    {
        ", authorities accused a large number of potentially innocent men of being Bokkenrijders and a number were tortured and subsequently convicted of crimes they denied having committed.       Formally, the name Bokkenrijders was first publicly used in 42 during the trial of ": null
    },
    {
        "Wellen": "wellen"
    },
    {
        ", a town in the Belgian province of Limburg. Johan van Muysen slid a letter underneath the door of a farmer called Wouters. The letter contained a threat that Wouterss house would be burned down if Johan did not receive some money. Van Muyses claimed to be member of the buckriders and used the word ": null
    },
    {
        "Satan": "satan"
    },
    {
        " up to three times. In the trial of Wellen, the term buckriders is openly used against Philip Mertens, somebody who wrote a letter that resembled the letter of Johan.          Earliest records mentioning the buckriders originate from a tome called Oorzaeke, bewys en ondekkinge van een goddelooze, bezwoorne bende nagtdieven en knevelaers binnen de landen van Overmaeze en aenpalende landstreeken, which approximately translates to Causes, proof and discovery of a godless, averted gang of night thieves and gaggers within the lands of Overmaas and adjacent regions. This book was written in 42 by S.J.P. Sleinada . This pastor, who lived in Landgraaf, knew several buckriders personally. The author tells us that these robbers made a pact with the ": null
    },
    {
        "Devil": "satan"
    },
    {
        " and rode their bucks at night. The common people told stories about them flying through the sky, pronouncing the following spell: Over huis, over tuin, over staak, en dat tot Keulen in de wijnkelder! . Once a year, they would visit their master, the Devil, on the Mookerheide.     Later on, the buckriders held a reputation that resembles ": null
    },
    {
        "Robin Hood": "robin hood"
    },
    {
        " and his gang. Present interpretation is that a number of criminal gangs robbed houses and committed other crimes, using the myth in their advantage. Also, many of the buckriders that were arrested are thought to be innocent, as confessions were obtained through torture.       In Limburg, the buckriders nowadays embrace their cultural heritage.   Trials against buckriders differed from common trials against common criminals if the suspect had performed a godless oath: I forswear God ... etc. This so-called oath of heresy is a stereotypical aspect of the buckriders myth. Since the convicts were accused of their oath and pact with the devil, we can define this as a late form of ": null
    },
    {
        "witch-hunt": "witch-hunt"
    },
    {
        ". Prosecution of buckriders was as ruthless as the buckriders were themselves, even by those days standards. 42% of the convicts received capital punishment. Confessions were given by means of torture, or by fear for it.     There are 42 periods of different buckrider raids. The first took place during 42 - 42 and the last during 42 - 42    ": null
    },
    {
        "Gabriël Brühl": "gabriel brühl"
    },
    {
        " - sentenced to death by hanging, 42 September 42   Geerling Daniels - died of two self-inflicted stab wounds, 42 January 42   Joseph Kirchhoffs - sentenced to death by hanging, 42 May 42   Joannes Arnold van de Wal - sentenced to death by hanging, 42 September 42       The fact that the buckriders were tried and prosecuted for their pact with the devil, resembles the witch-hunts during the Early Modern Period. Historians place these buckrider-hunts alongside other prosecuted godless people: heretics and witches. These kinds of ruthless and fullscale trials last took place in Limburg.     Most of the crimes they were accused of, buckrider gangmembers never performed . There never was an organized central buckriders gang, but small separate groups.                                                          ": null
    }
]