[
    {
        "              Charles Hardin Holley , known professionally as Buddy Holly, was an American musician and singer-songwriter who was a central and pioneering figure of mid42s ": null
    },
    {
        "rock and roll": "rock and roll"
    },
    {
        ". He was born in ": null
    },
    {
        "Lubbock, Texas": "lubbock, texas"
    },
    {
        ", to a musical family during the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ", and learned to play guitar and sing alongside his siblings. His style was influenced by ": null
    },
    {
        "gospel music": "gospel music"
    },
    {
        ", ": null
    },
    {
        "country music": "country music"
    },
    {
        ", and ": null
    },
    {
        "rhythm and blues": "rhythm and blues"
    },
    {
        " acts, which he performed in Lubbock with his friends from high school.     He made his first appearance on local television in 42 and the following year he formed the group Buddy and Bob with his friend ": null
    },
    {
        "Bob Montgomery": "bob montgomery"
    },
    {
        ". In 42 after opening for ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        ", he decided to pursue a career in music. He opened for Presley three times that year; his bands style shifted from country and western to entirely rock and roll. In October that year, when he opened for ": null
    },
    {
        "Bill Haley & His Comets": "bill haley  &  his comets"
    },
    {
        ", he was spotted by ": null
    },
    {
        "Nashville": "nashville, tennessee"
    },
    {
        " scout Eddie Crandall, who helped him get a contract with ": null
    },
    {
        "Decca Records": "decca records"
    },
    {
        ".     Hollys recording sessions at Decca were produced by ": null
    },
    {
        "Owen Bradley": "owen bradley"
    },
    {
        ", who had become famous for producing orchestrated country hits for stars like ": null
    },
    {
        "Patsy Cline": "patsy cline"
    },
    {
        ". Unhappy with Bradleys musical style and control in the studio, Holly went to producer ": null
    },
    {
        "Norman Petty": "norman petty"
    },
    {
        " in ": null
    },
    {
        "Clovis, New Mexico": "clovis, new mexico"
    },
    {
        ", and recorded a demo of ": null
    },
    {
        "Thatll Be the Day": "thatll be the day"
    },
    {
        " , among other songs. Petty became the bands manager and sent the demo to ": null
    },
    {
        "Brunswick Records": "brunswick records"
    },
    {
        ", which released it as a single credited to ": null
    },
    {
        "The Crickets": "the crickets"
    },
    {
        " , which became the name of Hollys band. In September 42 as the band toured, Thatll Be the Day topped the ": null
    },
    {
        "US": "list of billboard number-one singles of 1957"
    },
    {
        " and ": null
    },
    {
        "UK": "uk singles chart"
    },
    {
        " singles charts. Its success was followed in October by another major hit, ": null
    },
    {
        "Peggy Sue": "peggy sue"
    },
    {
        " .     The album  Chirping Crickets , released in November 42 reached number five on the ": null
    },
    {
        "UK Albums Chart": "uk albums chart"
    },
    {
        ". Holly made his second appearance on  The Ed Sullivan Show  in January 42 and soon after, toured Australia and then the UK. In early 42 he assembled a new band, consisting of future country music star ": null
    },
    {
        "Waylon Jennings": "waylon jennings"
    },
    {
        " , famed session musician ": null
    },
    {
        "Tommy Allsup": "tommy allsup"
    },
    {
        " , and ": null
    },
    {
        "Carl Bunch": "carl bunch"
    },
    {
        " , and embarked on a tour of the midwestern U.S. After a show in ": null
    },
    {
        "Clear Lake, Iowa": "clear lake, iowa"
    },
    {
        ", he chartered an airplane to travel to his next show, in ": null
    },
    {
        "Moorhead, Minnesota": "moorhead, minnesota"
    },
    {
        ". Soon after takeoff, the plane crashed, killing Holly, ": null
    },
    {
        "Ritchie Valens": "ritchie valens"
    },
    {
        ", ": null
    },
    {
        "The Big Bopper": "the big bopper"
    },
    {
        ", and pilot Roger Peterson in a tragedy later referred to by ": null
    },
    {
        "Don McLean": "don mclean"
    },
    {
        " as ": null
    },
    {
        "The Day the Music Died": "the day the music died"
    },
    {
        " .     During his short career, Holly wrote and recorded several songs. He is often regarded as the artist who defined the traditional rock-and-roll lineup of two guitars, bass, and drums. He was a major influence on later ": null
    },
    {
        "popular music": "popular music"
    },
    {
        " artists, including ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        ", ": null
    },
    {
        "Bob Dylan": "bob dylan"
    },
    {
        ", ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        ", ": null
    },
    {
        "The Rolling Stones": "the rolling stones"
    },
    {
        ", ": null
    },
    {
        "Eric Clapton": "eric clapton"
    },
    {
        ", ": null
    },
    {
        "Elvis Costello": "elvis costello"
    },
    {
        ", ": null
    },
    {
        "Marshall Crenshaw": "marshall crenshaw"
    },
    {
        " , and ": null
    },
    {
        "Elton John": "elton john"
    },
    {
        ". He was among the first artists inducted into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "rock and roll hall of fame"
    },
    {
        ", in 42  Rolling Stone  magazine ranked him number 42 in its list of 42 Greatest Artists .           Holly was born Charles Hardin Holley on September 42 42 in ": null
    },
    {
        "Lubbock, Texas": "lubbock, texas"
    },
    {
        ", the fourth child of Lawrence Odell L.O. Holley and Ella Pauline Drake . His elder siblings were Larry , Travis ,  and Patricia Lou . Buddy Holly was of mostly English and Welsh descent but had small amounts of Native American ancestry as well. Buddy Holly: A Biography By Ellis Amburn pg. 42 From early childhood, he was nicknamed Buddy . During the Great Depression, the Holleys frequently moved residence within Lubbock; L.O. changed jobs several times. Buddy Holly was baptized a ": null
    },
    {
        "Baptist": "baptist"
    },
    {
        ", and the family were members of the Tabernacle Baptist Church.     The Holleys had an interest in music; all the family members except L.O. were able to play an instrument or sing. The elder Holley brothers performed in local talent shows; on one occasion, Buddy joined them on violin. Since he could not play it, his brother Larry greased the strings so it would not make any sound. The brothers won the contest. During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Larry and Travis were called to military service. Upon his return, Larry brought with him a guitar he had bought from a shipmate while serving in the Pacific. At age 42 Buddy took piano lessons but abandoned them after nine months. He switched to the guitar after he saw a classmate playing and singing on the school bus. Buddys parents initially bought him a ": null
    },
    {
        "steel guitar": "steel guitar"
    },
    {
        ", but he insisted that he wanted a guitar like his brothers. His parents bought the guitar from a pawnshop, and Travis taught him to play it.     During his early childhood, Holley was influenced by the music of ": null
    },
    {
        "Hank Williams": "hank williams"
    },
    {
        ", ": null
    },
    {
        "Jimmie Rodgers": "jimmie rodgers"
    },
    {
        ", ": null
    },
    {
        "Hank Snow": "hank snow"
    },
    {
        ", ": null
    },
    {
        "Bob Wills": "bob wills"
    },
    {
        ", and the ": null
    },
    {
        "Carter Family": "carter family"
    },
    {
        ". At Roscoe Wilson Elementary, he became friends with ": null
    },
    {
        "Bob Montgomery": "bob montgomery"
    },
    {
        ", and the two played together, practicing with songs by the ": null
    },
    {
        "Louvin Brothers": "louvin brothers"
    },
    {
        " and ": null
    },
    {
        "Johnnie & Jack": "johnnie  &  jack"
    },
    {
        ". They both listened to the radio programs  Grand Ole Opry  on ": null
    },
    {
        "WSM": "wsm"
    },
    {
        ",  Louisiana Hayride  on ": null
    },
    {
        "KWKH": "kwkh"
    },
    {
        ", and  Big D Jamboree . At the same time, Holley played with other musicians he met in high school, including ": null
    },
    {
        "Sonny Curtis": "sonny curtis"
    },
    {
        " and ": null
    },
    {
        "Jerry Allison": "jerry allison"
    },
    {
        ". In 42 Holley and Jack Neal participated as a duo billed as Buddy and Jack in a talent contest on a local television show. After Neal left, he was replaced by Bob Montgomery and they were billed as Buddy and Bob . The two soon started performing on the Sunday Party show on ": null
    },
    {
        "KDAV": "kdav"
    },
    {
        " in 42 and performed live gigs in Lubbock. At that time, Holley was influenced by late-night radio stations that played ": null
    },
    {
        "blues": "blues"
    },
    {
        " and ": null
    },
    {
        "rhythm and blues": "rhythm and blues"
    },
    {
        " . Holley would sit in his car with Curtis and tune to distant radio stations that could only be received at night, when local transmissions ceased. Holley then modified his music by blending his earlier country and western influence with R & B.     By 42 after graduating from Lubbock High School, Holley decided to pursue a full-time career in music. He was further encouraged after seeing Elvis Presley performing live in Lubbock, whose act was booked by Pappy Dave Stone of KDAV. In February, Holley opened for Presley at the Fair Park Coliseum, in April at the Cotton Club, and again in June at the Coliseum. By that time, he had incorporated into his band Larry Welborn on the stand-up bass and Allison on drums, as his style shifted from C & W to ": null
    },
    {
        "rock and roll": "rock and roll"
    },
    {
        " due to seeing Presleys performances and hearing his music. In October, Stone booked Bill Haley & His Comets and placed Holley as the opening act to be seen by ": null
    },
    {
        "Nashville": "nashville, tennessee"
    },
    {
        " scout Eddie Crandall. Impressed, Crandall persuaded Grand Ole Opry manager Jim Denny to seek a recording contract for Holley. Stone sent a demo tape, which Denny forwarded to ": null
    },
    {
        "Paul Cohen": "paul cohen"
    },
    {
        ", who signed the band to ": null
    },
    {
        "Decca Records": "decca records"
    },
    {
        " in February 42 In the contract, Decca misspelled Holleys surname as Holly , and from then on he was known as Buddy Holly .     On January 42 42 Holly attended his first formal recording session, which was produced by ": null
    },
    {
        "Owen Bradley": "owen bradley"
    },
    {
        ". He attended two more sessions in Nashville, but with the producer selecting the session musicians and arrangements, Holly became increasingly frustrated by his lack of creative control. In April 42 Decca released ": null
    },
    {
        "Blue Days, Black Nights": "blue days, black nights"
    },
    {
        " as a single, with Love Me on the B-side. Denny included Holly on a tour as the opening act for ": null
    },
    {
        "Faron Young": "faron young"
    },
    {
        ". During the tour, they were promoted as Buddy Holly and the Two Tones , while later Decca called them Buddy Holly and the Three Tunes . The label later released Hollys second single Modern Don Juan , backed with You Are My One Desire . Neither single made an impression. On January 42 42 Decca informed Holly his contract would not be renewed, but insisted he could not record the same songs for anyone else for five years.            Holly was unhappy with the results of his time with Decca; he was inspired by the success of ": null
    },
    {
        "Buddy Knox": "buddy knox"
    },
    {
        "s ": null
    },
    {
        "Party Doll": "party doll"
    },
    {
        " and ": null
    },
    {
        "Jimmy Bowen": "jimmy bowen"
    },
    {
        "s ": null
    },
    {
        "Im Stickin with You": "im stickin with you"
    },
    {
        " , and visited ": null
    },
    {
        "Norman Petty": "norman petty"
    },
    {
        ", who had produced and promoted both records. Together with Allison, bassist ": null
    },
    {
        "Joe B. Mauldin": "joe b. mauldin"
    },
    {
        ", and rhythm guitarist ": null
    },
    {
        "Niki Sullivan": "niki sullivan"
    },
    {
        ", he went to Pettys studio in ": null
    },
    {
        "Clovis, New Mexico": "clovis, new mexico"
    },
    {
        ". The group recorded a demo of ": null
    },
    {
        "Thatll Be the Day": "thatll be the day"
    },
    {
        " , a song they had previously recorded in Nashville. Now playing lead guitar, Holly achieved the sound he desired. Petty became his manager and sent the record to ": null
    },
    {
        "Brunswick Records": "brunswick records"
    },
    {
        " in New York City. Holly, still under contract with Decca, could not release the record under his name, so a band name was used; Allison proposed the name Crickets . Brunswick gave Holly a basic agreement to release Thatll Be the Day , leaving him with both artistic control and financial responsibility for future recordings.      Impressed with the demo, the labels executives released it without recording a new version. Im Looking for Someone to Love was the B-side; the single was credited to the ": null
    },
    {
        "Crickets": "the crickets"
    },
    {
        ". Petty and Holly later learned that Brunswick was a subsidiary of Decca, which legally cleared future recordings under the name Buddy Holly. Recordings credited to the Crickets would be released on Brunswick, while the recordings under Hollys name were released on another subsidiary label, ": null
    },
    {
        "Coral Records": "coral records"
    },
    {
        ". Holly concurrently held a recording contract with both labels.     Thatll Be the Day was released on May 42 42 Petty booked Holly and the Crickets for a tour with ": null
    },
    {
        "Irvin Feld": "irvin feld"
    },
    {
        ", who had noticed the band after Thatll Be the Day appeared on the R & B chart. He booked them for appearances in Washington, D.C., ": null
    },
    {
        "Baltimore": "baltimore"
    },
    {
        ", and New York City. The band was booked to play at New Yorks ": null
    },
    {
        "Apollo Theater": "apollo theater"
    },
    {
        " on August 42–42 During the opening performances, the group did not impress the audience, but they were accepted after they included ": null
    },
    {
        "Bo Diddley": "bo diddley"
    },
    {
        ". By the end of their run at the Apollo, Thatll Be the Day was climbing the charts. Encouraged by the singles success, Petty started to prepare two album releases; a solo album for Holly and another for the Crickets. Holly appeared on  American Bandstand , hosted by ": null
    },
    {
        "Dick Clark": "dick clark"
    },
    {
        " on ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        ", on August 42 Before leaving New York, the band befriended the ": null
    },
    {
        "Everly Brothers": "everly brothers"
    },
    {
        ".     Thatll Be the Day topped the ": null
    },
    {
        "US Best Sellers in Stores ": "number-one hits of 1957"
    },
    {
        " chart on September 42 and was number one on the UK Singles Chart for three weeks in November. On September 42 Coral released ": null
    },
    {
        "Peggy Sue": "peggy sue"
    },
    {
        " , backed with ": null
    },
    {
        "Everyday": "everyday"
    },
    {
        " , with Holly credited as the performer. By October, Peggy Sue had reached number three on Billboards pop chart and number two on the R & B chart; it peaked at number six on the UK Singles chart. As the success of the song grew, it brought more attention to Holly, with the band at the time being billed as Buddy Holly and the Crickets .     In the last week of September the band members flew to Lubbock to visit their families. Hollys high school girlfriend, Echo McGuire, had left him for a fellow student. Aside from McGuire, Holly had a relationship with Lubbock fan June Clark. After Clark ended their relationship, Holly realized the importance of his relationship with McGuire and considered his with Clark a temporary one. Meanwhile, for their return to recording, Petty arranged a session in Oklahoma City , where he was performing with his own band. While the band drove to the location, the producer set up a makeshift studio. The rest of the songs needed for an album and singles were recorded; Petty later dubbed the material in Clovis. The resulting album, ": null
    },
    {
        "The Chirping Crickets": "the   chirping   crickets"
    },
    {
        ", was released on November 42 42 It reached number five on the UK Albums Chart. In October, Brunswick released the second single by the Crickets, Oh, Boy! , with Not Fade Away on the B-side. The single reached number 42 on the pop chart and 42 on the R & B chart. Holly and the Crickets performed Thatll Be the Day and Peggy Sue on The Ed Sullivan Show on December 42 42 Following the appearance, Niki Sullivan left the group because of the intensive touring. On December 42 Holly and the Crickets performed Peggy Sue on ": null
    },
    {
        "The Arthur Murray Party": "the arthur murray party"
    },
    {
        ".         On January 42 42 Holly and the Crickets joined Americas Greatest Teenage Recording Stars tour. On January 42 Holly recorded Rave On ; the next day, he made his second appearance on The Ed Sullivan Show, singing Oh, Boy! He departed to perform in Honolulu, Hawaii , on January 42 and then started a week-long tour of Australia. In March, the band toured the United Kingdom, playing 42 shows in 42 days. The same month, his debut solo album, ": null
    },
    {
        "Buddy Holly": "buddy holly"
    },
    {
        ", was released. Upon their return to the United States, Holly and the Crickets joined Alan Freeds Big Beat Show tour for 42 dates. In April, Decca released ": null
    },
    {
        "Thatll Be the Day": "thatll be the day"
    },
    {
        ", featuring the songs recorded with Bradley during his early Nashville sessions.     A new recording session in Clovis was arranged in May; Holly hired Tommy Allsup to play lead guitar. The session produced the recordings of Its So Easy and Heartbeat . Holly was impressed by Allsup and invited him to join the Crickets. In June, Holly traveled alone to New York for a solo recording session. Without the Crickets, he chose to be backed by a jazz and R & B band, recording Now Were One and Bobby Darin s Early in the Morning .     During a visit to the offices of Peer-South , Holly met María Elena Santiago . He asked her out on their first meeting and proposed marriage to her on their first date. The wedding took place on August 42 Petty disapproved of the marriage and advised Holly to keep it secret to avoid upsetting Hollys female fans. Pettys reaction created friction with Holly, who had also started to question Pettys bookkeeping. The Crickets, frustrated because he controlled all of the proceeds from the band, were also in conflict with Petty.     Holly and Santiago frequented many of New Yorks music venues, including the Village Gate , Blue Note, Village Vanguard , and Johnny Johnsons. Santiago later said that Holly was keen to learn fingerstyle flamenco guitar and that he would often visit her aunts home to play the piano there. Holly planned collaborations between soul singers and rock and roll. He wanted to make an album with Ray Charles and Mahalia Jackson . He also had ambitions to work in film and registered for acting classes with Lee Strasbergs Actors Studio .     Santiago accompanied Holly on tours. To hide her marriage to Holly, she was presented as the Crickets secretary. She took care of the laundry and equipment set-up and collected the concert revenues. Santiago kept the money for the band instead of their habitual transfer to Petty in New Mexico. She and her aunt Provi Garcia, executive of the Latin American music department at Peer-Southern , convinced Holly that Petty was paying the bands royalties from Coral-Brunswick into his own companys account. Holly planned to retrieve his royalties from Petty and to later fire him as manager and producer. At the recommendation of the Everly Brothers, Holly hired lawyer Harold Orenstein to negotiate his royalties. The problems with Petty were triggered after he was unable to pay Holly. At the time, New York promoter Manny Greenfield reclaimed a large part of Hollys earnings; Greenfield had booked Holly for shows during previous tours. The two had a verbal agreement; Greenfield would obtain 42% of the booking earnings. Greenfield later felt he was also acting as Hollys manager and deserved a higher payment, which Holly refused. Greenfield then sued Holly. Under New York law, because Hollys royalties originated in New York and were directed out of the state, the payments were frozen until the dispute was settled. Petty then could not complete the transfers to Holly, who considered him responsible for the missing profit.     In September, Holly returned to Clovis for a new recording session, which yielded Reminiscing and Come Back Baby . During the session, he ventured into producing by recording Lubbock DJ Waylon Jennings . Holly produced the single Jole Blon and When Sin Stops for Jennings. Holly became increasingly interested in the New York music, recording, and publishing scene. Santiago and he settled in Apartment 42H of the Brevoort Apartments, at 42 Fifth Avenue in Greenwich Village , where he recorded a series of acoustic songs, including Crying, Waiting, Hoping and What to Do . The inspiration to record the songs is sometimes attributed to the ending of his relationship with McGuire. In October, Holly recorded tracks for Coral; these were backed by saxophonist Boomie Richman and an 42-piece orchestra composed of former members of the NBC Symphony Orchestra . The three-and-a-half-hour session produced It Doesnt Matter Anymore , Raining in My Heart , Moondreams , and True Love Ways .     Holly ended his association with Petty in December 42 His band members kept Petty as their manager, and Holly also split from the Crickets. Petty was still holding the money from the royalties, forcing Holly to form a new band and return to touring.         thu   thu     Holly vacationed with his wife in Lubbock and visited Jenningss radio station in December 42 For the start of the Winter Dance Party tour, he assembled a band consisting of Waylon Jennings , Tommy Allsup , and Carl Bunch . Holly and Jennings left for New York City, arriving on January 42 42 Jennings stayed at Hollys apartment by Washington Square Park on the days prior to a meeting scheduled at the headquarters of the General Artists Corporation , which organized the tour. They then traveled by train to Chicago to join the rest of the band.     thu     The Winter Dance Party tour began in Milwaukee, Wisconsin , on January 42 42 The amount of travel involved created logistical problems, as the distance between venues had not been considered when scheduling performances. Adding to the problem, the unheated tour buses twice broke down in freezing weather, with dire consequences. Hollys drummer Carl Bunch was hospitalized for frostbite to his toes , so Holly decided to seek other transportation. On February 42 before their appearance in Clear Lake, Iowa , Holly chartered a four-seat Beechcraft Bonanza airplane for Jennings, Allsup, and himself, from Dwyer Flying Service in Mason City, Iowa . Hollys idea was to depart following the show at the Surf Ballroom in Clear Lake and fly to their next venue, in Moorhead, Minnesota , via Fargo, North Dakota , allowing them time to rest and launder their clothes and avoid a rigorous bus journey. Immediately after the Clear Lake show , Allsup agreed to flip a coin for the seat with Valens. Valens called heads; when he won, he reportedly said, Thats the first time Ive ever won anything in my life, Allsup later opened a restaurant in Fort Worth, Texas called Heads Up. Galloway, P. . Hit parade. Chicago Tribune Retrieved from http://search.proquest.com/docview/42 Waylon Jennings voluntarily gave up his seat to J. P. Richardson , who had influenza and complained that the tour bus was too cold and uncomfortable for a man of his size. Texas Monthly, January 42;     The pilot, Roger Peterson , took off in inclement weather , although he was not certified to fly by instruments only . Shortly after 42:42  am on February 42 42 Holly, Valens, Richardson, and Peterson were killed instantly when the aircraft crashed into a frozen cornfield five miles northwest of Mason City, Iowa, airport shortly after takeoff. The three musicians, who were ejected from the fuselage upon impact, suffered severe head and chest injuries.     thu     Hollys funeral was held on February 42 42 at the Tabernacle Baptist Church in Lubbock. The service was officiated by Ben D. Johnson, who had presided at the Hollys wedding just months earlier. The pallbearers were Jerry Allison, Joe B. Mauldin, Niki Sullivan, Bob Montgomery, and Sonny Curtis. Some sources say that Phil Everly, the one half of The Everly Brothers , was also the pallbearer, but he said at one time that he attended the funeral but was not a pallbearer. Waylon Jennings was unable to attend, because of his commitment to the still-touring Winter Dance Party. Hollys body was interred in the City of Lubbock Cemetery, in the eastern part of the city. His headstone carries the correct spelling of his surname and a carving of his Fender Stratocaster guitar.     María Elena watched the first reports of Hollys death on television. The following day, she claimed, she suffered a miscarriage, although there is no independent source for this. Hollys mother, who heard the news on the radio in Lubbock, Texas, screamed and collapsed. Because of Elenas miscarriage, in the months following the accident, the authorities implemented a policy against announcing victims names until after families are informed. Santiago did not attend the funeral and has never visited the grave site. She later told the Avalanche-Journal, In a way, I blame myself. I was not feeling well when he left. I was two weeks pregnant, and I wanted Buddy to stay with me, but he had scheduled that tour. It was the only time I wasnt with him. And I blame myself because I know that, if only I had gone along, Buddy never would have gotten into that airplane.       Hollys singing style was characterized by his vocal hiccups and his alternation between his regular voice and falsetto . His stuttering vocals were complemented by his percussive guitar playing , solos, stops , bent note s, and rhythm and blues chord progression s. He often strummed downstrokes that were accompanied by Allisons driving percussion.     Holly bought his first Fender Stratocaster, which became his signature guitar, at Harrod Music in Lubbock for US$42. Fender Stratocasters were popular with country musicians; Holly chose it for its loud sound. His innovative playing style was characterized by its blending of chunky rhythm and high string lead work . He played his first Stratocaster, a 42 model, until it was stolen during a tour stop in Michigan in 42 To replace it, he purchased a 42 model before a show in Detroit. Holly owned four or five Stratocasters during his career.     At the beginning of their music careers, Holly and his band wore business suits. When they met the Everly Brothers, Don Everly took the band to Phils mens shop in New York City and introduced them to Ivy League clothes . The brothers advised Holly to replace his old-fashioned glasses with horn-rimmed glasses , which had been popularized by Steve Allen . Holly bought a pair of glasses made in Mexico from Lubbock optometrist Dr. J. Davis Armistead. Teenagers in the United States started to request this style of glasses, which were later popularly known as Buddy Holly glasses .     When the plane crashed, the wreckage was strewn across many yards of snow-covered ground. While his other belongings were recovered immediately, there was no record of his signature glasses being found. They were presumed lost until, in March 42 they were discovered in a Cerro Gordo County courthouse storage area by Sheriff Gerald Allen. They had been found in the spring of 42 after the snow had melted, and had been given to the sheriffs office. They were placed in an envelope dated April 42 42 along with the Big Boppers watch, a lighter, two pairs of dice and part of another watch, and misplaced when the county moved courthouses. The glasses, missing their lenses, were returned to Maria Elena a year later, after a legal contest over them with his parents. They are now on display at the Buddy Holly Center in Lubbock, Texas.       Buddy Holly left behind dozens of unfinished recordings: solo transcriptions of his new compositions; informal jam sessions with bandmates; or tapes demonstrating songs intended for other artists. The most recent recordings, made in Hollys apartment in late 42 were his last six original songs. In June 42 Coral Records overdubbed two of them with backing vocals by the Ray Charles Singers and studio musicians in an attempt to simulate the established Crickets sound. The finished tracks became the first posthumous Holly single, Peggy Sue Got Married / Crying, Waiting, Hoping . The new release was successful enough to warrant an album drawing upon the other Holly demos, using the same studio personnel, in January 42 Goldrosen, John . The Buddy Holly Story. Quick Fox. All six songs were included in The Buddy Holly Story, Vol. 42 .     The demand for Holly records was so great, and Holly had recorded so prolifically, that his record label was able to release new Holly albums and singles for the next 42 years. Norman Petty produced most of these new editions, drawing upon unreleased studio masters, alternative takes, audition tapes, and even amateur recordings . The final new Buddy Holly album, Giant , was released in 42; the single chosen from the album was Love Is Strange .     ": null
    },
    {
        "Encyclopædia Britannica": "encyclopædia britannica"
    },
    {
        " stated that Holly produced some of the most distinctive and influential work in rock music . AllMusic defined him as the single most influential creative force in early rock and roll . ": null
    },
    {
        "Rolling Stone": "rolling stone"
    },
    {
        " ranked him number 42 on its list of 42 Greatest Artists . The ": null
    },
    {
        "Telegraph": "the daily telegraph"
    },
    {
        " called him a pioneer and a revolutionary a multidimensional talent co-wrote and performed remain as fresh and potent today .     The Rock and Roll Hall of Fame included Holly among its first class in 42 On its entry, the Hall of Fame remarked upon the large quantity of material he produced during his short musical career, and said it made a major and lasting impact on popular music . It called him an innovator for writing his own material, his experimentation with double tracking and the use of orchestration ; he is also said to have pioneered and popularized the now-standard use of two guitars, bass, and drums by rock bands. The Songwriters Hall of Fame also inducted Holly in 42 and said his contributions changed the face of Rock n Roll . Holly developed in collaboration with Petty techniques of overdubbing and reverberation , while he used innovative instrumentation later implemented by other artists. Holly became one of the most influential pioneers of rock and roll who had a lasting influence on genre performers of the 42s.     thu , a museum in Lubbock, Texas   In 42 Grant Speed sculpted a statue of Holly playing his Fender guitar. This statue is the centerpiece of Lubbocks Walk of Fame, which honors notable people who contributed to Lubbocks musical history. Other memorials to Buddy Holly include a street named in his honor and the Buddy Holly Center , which contains a museum of Holly memorabilia and fine arts gallery. The Center is located on Crickets Avenue, one street east of Buddy Holly Avenue, in a building that previously housed the Fort Worth and Denver South Plains Railway Depot.     In 42 the National Academy of Recording Arts and Sciences gave Holly the Lifetime Achievement Award . Holly was inducted into the Iowa Rock n Roll Hall of Fame in 42 In 42 Grant Speeds statue was taken down for refurbishment and construction of a new Walk of Fame began. On May 42 42 the City of Lubbock held a ribbon-cutting ceremony for the Buddy and Maria Elena Holly Plaza, the new home of the statue and the Walk of Fame. The same year, a star bearing Hollys name was placed on the Hollywood Walk of Fame , commemorating his 42th birthday.     Groundbreaking was held on April 42 42 for the construction of a new performing arts center in Lubbock, the Buddy Holly Hall of Performing Arts and Sciences , a downtown $42 million project expected to be completed in 42 Thus far, the private group, the Lubbock Entertainment and Performing Arts Association, has raised or received pledges in the amount of $42 million to underwrite the project.       According to a June 42 article in ": null
    },
    {
        "The New York Times Magazine": "the new york times magazine"
    },
    {
        ", virtually all of Hollys masters were lost in the 42 Universal fire . This is disputed by Chad Kassem of Analogue Productions, who claims to have used the master tapes of Hollys first two albums in Analogue Productions reissues of these albums on LP and SACD in 42       John Lennon and Paul McCartney saw Holly for the first time when he appeared on ": null
    },
    {
        "Sunday Night at the London Palladium": "sunday night at the london palladium"
    },
    {
        ". The two had recently met and begun their musical association. They studied Hollys records, learned his performance style and lyricism, and based their act around his persona. Inspired by Hollys insect-themed Crickets, they chose to name their band The Beatles . Lennon and McCartney later cited Holly as one of their main influences.     Lennons band the Quarrymen covered Thatll Be the Day in their first recording session, in 42 During breaks in the Beatles first appearance on The Ed Sullivan Show, on February 42 42 Lennon asked CBS coordinator Vic Calandra about Hollys performances; Calandra said Lennon and McCartney repeatedly expressed their appreciation of Holly. The Beatles recorded a close cover of Hollys version of Words of Love , which was released on their 42 album ": null
    },
    {
        "Beatles for Sale": "beatles for sale"
    },
    {
        " . During the January 42 recording sessions for their album ": null
    },
    {
        "Let It Be": "let it be"
    },
    {
        ", the Beatles played a slow, impromptu version of Mailman, Bring Me No More Blues – which Holly popularized but did not write – with Lennon mimicking Hollys vocal style. Lennon recorded a cover version of Peggy Sue on his 42 album ": null
    },
    {
        "Rock n Roll": "rock n roll"
    },
    {
        ". McCartney owns the publishing rights to Hollys song catalogue.     On January 42 42 two nights before Hollys death, 42-year-old Bob Dylan attended Hollys performance in Duluth. Dylan referred to this in his acceptance speech when he received the Grammy Award for Album of the Year for ": null
    },
    {
        "Time Out of Mind": "time out of mind"
    },
    {
        " in 42:  ...  when I was sixteen or seventeen years old, I went to see Buddy Holly play at Duluth National Guard Armory and I was three feet away from him  ...  and he looked at me. And I just have some sort of feeling that he was  ...  with us all the time we were making this record in some kind of way .     Mick Jagger saw Holly performing live in Woolwich , London, during a tour of England; Jagger particularly remembered Hollys performance of Not Fade Away – a song that also inspired Keith Richards , who modeled his early guitar playing on the track. The Rolling Stones had a hit version of the song in 42 Richards later said, passed it on via the Beatles and via  ...  Hes in everybody .     Don McLean s popular 42 ballad American Pie was inspired by Hollys death and the day of the plane crash. The songs lyric, which calls the incident The Day the Music Died , became popularly associated with the crash. McLeans album ": null
    },
    {
        "American Pie": "american pie"
    },
    {
        " is dedicated to Holly. In 42 McLean wrote, Buddy Holly would have the same stature musically whether he would have lived or died, because of his accomplishments  ...  By the time he was 42 years old, he had recorded some 42 tracks, most of which he had written himself  ...  in my view and the view of many others, a hit  ...  Buddy Holly and the Crickets were the template for all the rock bands that followed .     Elton John was musically influenced by Holly. At age 42 although he did not require them, John started wearing horn-rimmed glasses to imitate Holly. The Clash were also influenced by Holly, and referenced him in their song Corner Soul from the ": null
    },
    {
        "Sandinista!": "sandinista!"
    },
    {
        " album. The Chirping Crickets was the first album Eric Clapton ever bought; he later saw Holly on Sunday Night at the London Palladium. In his autobiography, Clapton recounted the first time he saw Holly and his Fender, saying, I thought Id died and gone to heaven  ...  it was like seeing an instrument from outer space and I said to myself: Thats the future – thats what I want .     The launch of Bobby Vee s successful musical career resulted from Hollys death; Vee was selected to replace Holly on the tour that continued after the plane crash. Hollys profound influence on Vees singing style can be heard in the songs Rubber Ball – the B-side of which was a cover of Hollys Everyday – and Run to Him. The name of the British rock band the Hollies is often claimed as a tribute to Holly; according to the band, they admired Holly, but their name was mainly inspired by sprigs of holly in evidence around Christmas 42 In an August 42 42 interview with Rolling Stone, Bruce Springsteen told Dave Marsh , I play Buddy Holly every night before I go on; that keeps me honest . The Grateful Dead performed the song Not Fade Away in concerts.     In 42 Richard Barone released his album Sorrows & Promises: Greenwich Village in the 42s, paying tribute to the new wave of singer-songwriters in the Village during that pivotal, post-Holly era. The album opens with Barones version of Learning the Game , one of the final songs written and recorded by Holly at his home in Greenwich Village, a week before his death.       Hollys life story inspired a Hollywood biographical film , ": null
    },
    {
        "The Buddy Holly Story": "the buddy holly story"
    },
    {
        " ; its lead actor Gary Busey received a nomination for the Academy Award for Best Actor for his portrayal of Holly. The film was widely criticized by the rock press, and by Hollys friends and family, for its inaccuracies. This led Paul McCartney to produce and host his own documentary about Holly in 42 titled The Real Buddy Holly Story. This video includes interviews with Keith Richards, Phil and Don Everly, Sonny Curtis, Jerry Allison, Hollys family, and McCartney, among others.     In 42 musician Marshall Crenshaw portrayed Buddy Holly in the movie ": null
    },
    {
        "La Bamba": "la bamba"
    },
    {
        ", which depicts him performing at the Surf Ballroom and boarding the fatal airplane with Ritchie Valens and the Big Bopper. Crenshaws version of Crying, Waiting, Hoping is featured on the La Bamba original motion picture soundtrack. ": null
    },
    {
        "Buddy – The Buddy Holly Story": "buddy – the buddy holly story"
    },
    {
        ", a jukebox musical depicting Hollys life, is credited for being the first of its kind. It spawned the genre that later included ": null
    },
    {
        "Mamma Mia!": "mamma mia!"
    },
    {
        " and ": null
    },
    {
        "We Will Rock You": "we will rock you"
    },
    {
        ". The musical opened in the late 42s and its most recent UK tour occurred in 42     Steve Buscemi appeared as Holly in a brief cameo as a 42s-themed restaurant employee in Quentin Tarantino s 42 film ": null
    },
    {
        "Pulp Fiction": "pulp fiction"
    },
    {
        ", in which he takes Mia Wallace and Vincent Vegas orders .     Holly was depicted in an episode of the science-fiction television program ": null
    },
    {
        "Quantum Leap": "quantum leap"
    },
    {
        " titled How the Tess Was Won ; Hollys identity is only revealed at the end of the episode. Dr. Sam Beckett influences Buddy Holly to change his lyrics from piggy, suey to Peggy Sue , setting up Hollys future hit song. Hollys follow up to that hit song is featured in the 42 Francis Ford Coppola film ": null
    },
    {
        "Peggy Sue Got Married": "peggy sue got married"
    },
    {
        ", in which a 42-year-old mother and housewife facing divorce played by Kathleen Turner is thrust back in time and given the chance to change the course of her life.     Weezers first top 42 single in the US was titled Buddy Holly .     In 42 country band, the Dixie Chicks mention Buddy Holly in their song Lubbock or Leave It . Lead singer, Natalie Maines , and Holly share a hometown, Lubbock, Texas .     Musician Richard Barone recorded one of Buddy Hollys Greenwich Village demos, Learning the Game on his 42 album Sorrows & Promises. In concert, Barone speaks of the importance of Hollys presence in the Village at the end of 42s, speculating that had he lived, Holly would have expedited the folk rock and singer-songwriter movements that emerged in the mid42s. http://popdose.com/album-review-richard-barone-sorrows-promises-greenwich-village-in-the42s/             ": null
    },
    {
        "The Chirping Crickets": "the   chirping   crickets"
    },
    {
        "       Buddy Holly": "buddy holly"
    },
    {
        "   Thatll Be the Day": "thatll be the day"
    }
]