[
    {
        "     Buddhist cuisine is an ": null
    },
    {
        "East Asia": "east asia"
    },
    {
        "n ": null
    },
    {
        "cuisine": "cuisine"
    },
    {
        " that is followed by ": null
    },
    {
        "monks": "bhikkhu"
    },
    {
        " and many believers from areas historically influenced by ": null
    },
    {
        "Chinese Buddhism": "chinese buddhism"
    },
    {
        ". It is vegetarian or vegan, and it is based on the Dharmic concept of ": null
    },
    {
        "ahimsa": "ahimsa"
    },
    {
        " . Vegetarianism is common in other Dharmic faiths such as ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        ", ": null
    },
    {
        "Jainism": "jainism"
    },
    {
        " and ": null
    },
    {
        "Sikhism": "sikhism"
    },
    {
        ", as well as East Asian religions like ": null
    },
    {
        "Taoism": "taoism"
    },
    {
        ". While ": null
    },
    {
        "monks": "bhikkhu"
    },
    {
        " and a minority of believers are vegetarian year-round, many believers follow the Buddhist vegetarian diet for celebrations.     The origin of Buddhist food as a distinct sub-style of cuisine is tied to ": null
    },
    {
        "monasteries": "monastery"
    },
    {
        ", where one member of the community would have the duty of being the head cook and supplying meals that paid respect to the strictures of Buddhist precepts. Temples that were open to visitors from the general public might also serve meals to them and a few temples effectively run functioning restaurants on the premises. In Japan, this practice is generally known as , and served at many temples, especially in ": null
    },
    {
        "Kyoto": "kyoto"
    },
    {
        ". A more recent version, more Chinese in style, is prepared by the ": null
    },
    {
        "Ōbaku": "ōbaku"
    },
    {
        " school of zen, and known as ; this is served at the head temple of ": null
    },
    {
        "Manpuku-ji": "manpuku-ji"
    },
    {
        ", as well as various subtemples. In modern times, commercial restaurants have also latched on to the style, catering both to practicing and non-practicing lay people.                Most of the dishes considered to be uniquely Buddhist are vegetarian, but not all Buddhist traditions require vegetarianism of lay followers or clergy. Vegetarian eating is primarily associated with the East Asian tradition in China, Vietnam, Japan, and Korea where it is commonly practiced by clergy and may be observed by laity on holidays or as a devotional practice.     ": null
    },
    {
        "Theravada": "theravada"
    },
    {
        " Monks and nuns traditionally feed themselves by gathering ": null
    },
    {
        "alms": "alms"
    },
    {
        ", and generally must eat whatever foods are given to them, including meat.  The exception to this alms rule is when monks and nuns have seen, heard or known that animal have been specifically killed to feed the alms-seeker, in which case consumption of such meat would be ": null
    },
    {
        "karmically": "karma"
    },
    {
        " negative, as well as meat from certain animals, such as dogs and snakes, that were regarded as impure in ancient India.  The same restriction is also followed by some ": null
    },
    {
        "lay": "laity"
    },
    {
        " Buddhists and is known as the consumption of triply clean meat . The ": null
    },
    {
        "Pali Sutras": "pali sutras"
    },
    {
        " also describe the Buddha as refusing a suggestion by his student ": null
    },
    {
        "Devadatta": "devadatta"
    },
    {
        " to mandate vegetarianism in the monastic precepts.     In the ": null
    },
    {
        "Mahayana": "mahayana"
    },
    {
        " tradition, by contrast, several sutras of the ": null
    },
    {
        "Mahayana canon": "mahayana sutras"
    },
    {
        " contain explicit prohibitions against consuming meat, including sections of the ": null
    },
    {
        "Lankavatara Sutra": "lankavatara sutra"
    },
    {
        " and ": null
    },
    {
        "Surangama Sutra": "surangama sutra"
    },
    {
        ". ": null
    },
    {
        "Japanese Buddhist": "japanese buddhism"
    },
    {
        " sects generally believe that Buddha ate meat.  All Japanese Kamakura sects of Buddhism  have relaxed Mahayana ": null
    },
    {
        "vinaya": "vinaya"
    },
    {
        ", and as a consequence, vegetarianism is optional. The monastic community in Chinese Buddhism, Vietnamese Buddhism and most of Korean Buddhism strictly adhere to vegetarianism.     ": null
    },
    {
        "Tibetan Buddhism": "tibetan buddhism"
    },
    {
        " has long accepted that the practical difficulties in obtaining vegetables and grains within most of Tibet make it impossible to insist upon vegetarianism; however, many leading Tibetan Buddhist teachers agree upon the great worth of practicing vegetarianism whenever and wherever possible.     Both ": null
    },
    {
        "Mahayana": "mahayana"
    },
    {
        " and ": null
    },
    {
        "Theravada": "theravada"
    },
    {
        " Buddhists consider that one may practice vegetarianism as part of cultivating ": null
    },
    {
        "Bodhisattvass": "bodhisattvas"
    },
    {
        " paramita": "paramita"
    },
    {
        ".          In addition to the ban on ": null
    },
    {
        "garlic": "garlic"
    },
    {
        " practically all ": null
    },
    {
        "Mahayana": "mahayana"
    },
    {
        " monastics in ": null
    },
    {
        "China": "china"
    },
    {
        ", ": null
    },
    {
        "Korea": "korea"
    },
    {
        ", ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        " and ": null
    },
    {
        "Japan": "japan"
    },
    {
        " specifically avoid eating strong-smelling plants, traditionally ": null
    },
    {
        "asafoetida": "asafoetida"
    },
    {
        ", ": null
    },
    {
        "shallot": "shallot"
    },
    {
        ", mountain ": null
    },
    {
        "leek": "leek"
    },
    {
        " and ": null
    },
    {
        "Allium chinense": "allium chinense"
    },
    {
        ", which together with garlic are referred to as wǔ hūn or wǔ xīn as they tend to excite senses. This is based on teachings found in the ": null
    },
    {
        "Brahamajala Sutra": "brahamajala sutra"
    },
    {
        ", the ": null
    },
    {
        "Surangama Sutra": "surangama sutra"
    },
    {
        " and the ": null
    },
    {
        "Lankavatara Sutra": "lankavatara sutra"
    },
    {
        " . In modern times this rule is often interpreted to include other vegetables of the ": null
    },
    {
        "onion": "allium"
    },
    {
        " genus": "genus"
    },
    {
        ", as well as ": null
    },
    {
        "coriander": "coriander"
    },
    {
        ". The origins of this additional restriction is from the Indic region and can still be found among some believers of ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        " and ": null
    },
    {
        "Jainism": "jainism"
    },
    {
        ". Some Taoists also have this additional restriction but the list of restricted plants differs from the Buddhist list. It also includes coriander and a type of rabe plant.        The food that a strict Buddhist takes, if not a vegetarian, is also specific. For many Chinese Buddhists beef and the consumption of large animals and exotic species is avoided. Then there would be the aforementioned triply clean meat rule. One restriction on food that is not known to many is the abstinence from eating animal innards and organs. This is known as xiàshui , not to be confused with the term for sewage.     Alcohol and other drugs are also avoided by many Buddhists because of their effects on the mind and ": null
    },
    {
        "mindfulness": "mindfulness"
    },
    {
        " . It is part of the ": null
    },
    {
        "Five Precepts": "five precepts"
    },
    {
        " which dictate that one is not to consume addictive materials . The definition of addictive depends on each individual but most Buddhists consider alcohol, ": null
    },
    {
        "tobacco": "tobacco"
    },
    {
        " and drugs other than medicine to be addictive. Although ": null
    },
    {
        "caffeine": "caffeine"
    },
    {
        " is now also known to be addictive, caffeinated drinks and especially ": null
    },
    {
        "tea": "tea"
    },
    {
        " are not included under this restriction; tea in particular is considered to be healthful and beneficial and its mild stimulant effect desirable. There are many legends about tea. Among meditators it is considered to keep the person alert and awake without overexcitement.         In theory and practice, many regional styles of cooking may be adopted to be Buddhist as long as the cook, with the above restrictions in mind, prepares the food, generally in simple preparations, with expert attention to its quality, wholesomeness and flavor. Often working on a tight budget, the monastery cook would have to make the most of whatever ingredients were available.     In  Tenzo kyokun  , ": null
    },
    {
        "Soto Zen": "soto zen"
    },
    {
        " founder ": null
    },
    {
        "Eihei Dogen": "eihei dogen"
    },
    {
        " wrote the following about the Zen attitude toward food:     In preparing food, it is essential to be sincere and to respect each ingredient regardless of how coarse or fine it is. A rich buttery soup is not better as such than a broth of wild herbs. In handling and preparing wild herbs, do so as you would the ingredients for a rich feast, wholeheartedly, sincerely, clearly. When you serve the monastic assembly, they and you should taste only the flavour of the Ocean of Reality, the Ocean of unobscured Awake Awareness, not whether or not the soup is creamy or made only of wild herbs. In nourishing the seeds of living in the Way, rich food and wild grass are not separate.             Following its dominant status in most parts of East Asia where Buddhism is most practiced, ": null
    },
    {
        "rice": "rice"
    },
    {
        " features heavily as a staple in the Buddhist meal, especially in the form of rice porridge or ": null
    },
    {
        "congee": "congee"
    },
    {
        " as the usual morning meal. ": null
    },
    {
        "Noodles": "noodle"
    },
    {
        "and other grains may often be served as well. Vegetables of all sorts are generally either stir-fried or cooked in vegetarian broth with seasonings and may be eaten with various sauces. Traditionally eggs and dairy are not permitted. Seasonings will be informed by whatever is common in the local region; for example, ": null
    },
    {
        "soy sauce": "soy sauce"
    },
    {
        " and vegan ": null
    },
    {
        "dashi": "dashi"
    },
    {
        " figure strongly in Japanese monastery food while ": null
    },
    {
        "curry": "curry"
    },
    {
        " and ": null
    },
    {
        "Tương": "tương"
    },
    {
        " may be prominent in Southeast Asia. Sweets and desserts are not often consumed, but are permitted in moderation and may be served at special occasions such as in the context of a ": null
    },
    {
        "tea ceremony": "tea ceremony"
    },
    {
        " in the Zen tradition.     Buddhist vegetarian chefs have become extremely creative in imitating meat using prepared ": null
    },
    {
        "wheat gluten": "wheat gluten"
    },
    {
        ", also known as seitan, kao fu or wheat meat, ": null
    },
    {
        "soy": "soy"
    },
    {
        " , ": null
    },
    {
        "agar": "agar"
    },
    {
        ", ": null
    },
    {
        "konnyaku": "konjac"
    },
    {
        " and other ": null
    },
    {
        "plant": "plant"
    },
    {
        " products. Some of their recipes are the oldest and most-refined ": null
    },
    {
        "meat analogues": "meat analogue"
    },
    {
        "in the world. Soy and wheat gluten are very versatile materials, because they can be manufactured into various shapes and textures, and they absorb flavorings , while having very little flavor of their own. With the proper ": null
    },
    {
        "seasoning": "seasoning"
    },
    {
        "s, they can mimic various kinds of meat quite closely.     Some of these Buddhist vegetarian chefs are in the many ": null
    },
    {
        "monasteries": "monastery"
    },
    {
        " and ": null
    },
    {
        "temples": "temple"
    },
    {
        "which serve allium-free and mock-meat dishes to the monks and visitors . Many Buddhist restaurants also serve vegetarian, vegan, non-alcoholic or allium-free dishes.     Some Buddhists eat vegetarian on the 1st and 15th of the lunar calendar , on Chinese New Year eve, and on saint and ancestral holy days. To cater to this type of customer, as well as full-time vegetarians, the menu of a Buddhist vegetarian restaurant usually shows no difference from a typical Chinese or East Asian restaurant, except that in recipes originally made to contain meat, a soy chicken substitute might be served instead.         According to cookbooks published in English, formal monastery meals in the ": null
    },
    {
        "Zen": "zen"
    },
    {
        " tradition generally follow a pattern of ": null
    },
    {
        " three bowls ": "ōryōki"
    },
    {
        " in descending size. The first and largest bowl is a grain-based dish such as rice, noodles or ": null
    },
    {
        "congee": "congee"
    },
    {
        "; the second contains the protein dish which is often some form of stew or soup; the third and smallest bowl is a vegetable dish or a salad. ": null
    }
]