[
    {
        "           Buffalo is the ": null
    },
    {
        "second largest city": "List Of Cities In New York"
    },
    {
        " in the ": null
    },
    {
        "U.S. state": "United States"
    },
    {
        " of ": null
    },
    {
        "New York": "New York"
    },
    {
        " and the largest city in ": null
    },
    {
        "Upstate New York": "Upstate New York"
    },
    {
        ". , the population was 256,304. The city is the ": null
    },
    {
        "county seat": "County Seat"
    },
    {
        " of ": null
    },
    {
        "Erie County": "Erie County, New York"
    },
    {
        " and a major gateway for commerce and travel across the ": null
    },
    {
        "Canada–United States border": "Canada–United States Border"
    },
    {
        ", forming part of the bi-national ": null
    },
    {
        "Buffalo Niagara Region": "Buffalo Niagara Region"
    },
    {
        ".     The Buffalo area was inhabited before the 17th century by the ": null
    },
    {
        "Native American": "Native Americans In The United States"
    },
    {
        " Iroquois": "Iroquois"
    },
    {
        " tribe and later by French colonizers. The city grew significantly in the 19th and 20th centuries as a result of immigration, the construction of the ": null
    },
    {
        "Erie Canal": "Erie Canal"
    },
    {
        " and ": null
    },
    {
        "rail transportation": "Rail Transportation In The United States"
    },
    {
        ", and its close proximity to ": null
    },
    {
        "Lake Erie": "Lake Erie"
    },
    {
        ". This growth provided an abundance of fresh water and an ample trade route to the ": null
    },
    {
        "Midwestern United States": "Midwestern United States"
    },
    {
        " while grooming its economy for the grain, steel and automobile industries that dominated the citys economy in the 20th century. Since the citys economy relied heavily on manufacturing, ": null
    },
    {
        "deindustrialization": "Deindustrialization"
    },
    {
        " in the latter half of the 20th century led to a steady decline in population. While some manufacturing activity remains, Buffalos economy has transitioned to service industries with a greater emphasis on healthcare, research and higher education, which emerged following the ": null
    },
    {
        "Great Recession": "Great Recession"
    },
    {
        ".     Buffalo is on the eastern shore of ": null
    },
    {
        "Lake Erie": "Lake Erie"
    },
    {
        ", at the head of the ": null
    },
    {
        "Niagara River": "Niagara River"
    },
    {
        ", 16 miles south of ": null
    },
    {
        "Niagara Falls": "Niagara Falls"
    },
    {
        ". Its early embrace of electric power led to the nickname The City of Light . The city is also famous for its urban planning and layout by ": null
    },
    {
        "Joseph Ellicott": "Joseph Ellicott"
    },
    {
        ", an extensive system of parks designed by ": null
    },
    {
        "Frederick Law Olmsted": "Frederick Law Olmsted"
    },
    {
        ", as well as ": null
    },
    {
        "significant architectural works": "National Register Of Historic Places Listings In Buffalo, New York"
    },
    {
        ". Its culture blends ": null
    },
    {
        "Northeastern": "Northeastern United States"
    },
    {
        " and ": null
    },
    {
        "Midwestern": "Midwestern United States"
    },
    {
        " traditions, with annual festivals including ": null
    },
    {
        "Taste of Buffalo": "Taste Of Buffalo"
    },
    {
        " and ": null
    },
    {
        "Allentown Art Festival": "Allentown, Buffaloallentown Art Festival"
    },
    {
        ", two professional sports teams , and a thriving and progressive music and arts scene.         The city of Buffalo received its name from a nearby creek called ": null
    },
    {
        "Buffalo Creek": "Buffalo River"
    },
    {
        ". British military engineer Captain ": null
    },
    {
        "John Montresor": "John Montresor"
    },
    {
        " made reference to Buffalo Creek in his 1764 journal, which may be the earliest recorded appearance of the name.      There are several theories regarding how Buffalo Creek received its name. , Toronto Star, Toronto, Ontario, Canada: Toronto Star, September 24, 1992, Stefaniuk, W., Retrieved April 23, 2014. , Buffalo News, Buffalo, NY: Berkshire Hathaway, March 19, 1993, Okun, J., Retrieved April 23, 2014. , Buffalo News, Buffalo, NY: Berkshire Hathaway, July 21, 2003, Retrieved April 23, 2014. While it is possible its name originated from French fur traders and Native Americans calling the creek Beau Fleuve , it is also possible Buffalo Creek was named after the ": null
    },
    {
        "American buffalo": "American Bison"
    },
    {
        ", whose historical range may have extended into ": null
    },
    {
        "western New York": "Western New York"
    },
    {
        ".                         The first inhabitants of the State of New York are believed to have been nomadic ": null
    },
    {
        "Paleo-Indians": "Paleo-Indians"
    },
    {
        ", who migrated after the disappearance of ": null
    },
    {
        "Pleistocene glaciers": "Quaternary Glaciation"
    },
    {
        " during or before 7000 BCE.     Around 1000 CE, 1,000 years ago, the ": null
    },
    {
        "Woodland period": "Woodland Period"
    },
    {
        " began, marked by the rise of the ": null
    },
    {
        "Iroquois Confederacy": "Iroquois"
    },
    {
        " and its tribes throughout the state.     During French exploration of the region in 1620, the region was occupied simultaneously by the ": null
    },
    {
        "agrarian": "Agrarian Society"
    },
    {
        " Erie people": "Erie People"
    },
    {
        ", a tribe outside of the Five Nations of the Iroquois southwest of Buffalo Creek, and the ": null
    },
    {
        "Wenro people": "Wenrohronon"
    },
    {
        " or Wenrohronon, an Iroquoian-speaking tribal offshoot of the large ": null
    },
    {
        "Neutral Nation": "Neutral Nation"
    },
    {
        " who lived along the inland south shore of ": null
    },
    {
        "Lake Ontario": "Lake Ontario"
    },
    {
        " and at the east end of Lake Erie and a bit of its northern shore. For trading, the Neutral people made a living by growing tobacco and ": null
    },
    {
        "hemp": "Hemp"
    },
    {
        " to trade with the Iroquois, using animal paths or warpaths to travel and move goods across the state. These paths were later paved, and now function as major roads.     Later, during the ": null
    },
    {
        "Beaver Wars": "Beaver Wars"
    },
    {
        " of the 1640s-1650s, the combined warriors of the ": null
    },
    {
        "Five Nations of the Iroquois": "Five Nations Of The Iroquois"
    },
    {
        " Confederacy conquered the populous Neutrals  and their peninsular territory, while the ": null
    },
    {
        "Senecas": "Seneca People"
    },
    {
        " alone took out the Wenro and their territory, c. 1651   –1653. Soon after, the Iroquois destroyed Erie nation and territory  over their assistance to ": null
    },
    {
        "Huron people": "Huron People"
    },
    {
        " during the Beaver Wars.     ": null
    },
    {
        "Louis Hennepin": "Louis Hennepin"
    },
    {
        " and ": null
    },
    {
        "Sieur de La Salle": "René-Robert Cavelier, Sieur De La Salle"
    },
    {
        " made the earliest European discoveries of the upper Niagara and Ontario regions in the late 1600s. On August 7, 1679, La Salle launched a vessel, ": null
    },
    {
        "Le Griffon": "Le Griffon"
    },
    {
        ", that became the first full-sized ship to sail across the Great Lakes before it disappeared in ": null
    },
    {
        "Green Bay, Wisconsin": "Green Bay, Wisconsin"
    },
    {
        ".     After the ": null
    },
    {
        "American Revolution": "American Revolution"
    },
    {
        ", the colony of New York—now a state—began westward expansion, looking for habitable land by following trends of the Iroquois. Land near fresh water was of considerable importance. New York and Massachusetts were fighting for the territory Buffalo lies on, and Massachusetts had the right to purchase all but a one-mile wide portion of land. The rights to the Massachusetts territories were sold to ": null
    },
    {
        "Robert Morris": "Robert Morris"
    },
    {
        " in 1791, and two years later to the ": null
    },
    {
        "Holland Land Company": "Holland Land Company"
    },
    {
        ".     As a result of the war, in which the Iroquois tribe sided with the ": null
    },
    {
        "British Army": "British Army During The American Revolutionary War"
    },
    {
        ", Iroquois territory was gradually reduced in the mid-to-late-1700s by European settlers through successive treaties statewide, such as the ": null
    },
    {
        "Treaty of Fort Stanwix ": "Treaty Of Fort Stanwix"
    },
    {
        ", the ": null
    },
    {
        "First Treaty of Buffalo Creek": "First Treaty Of Buffalo Creek"
    },
    {
        " , and the Treaty of Geneseo . The Iroquois were corralled onto reservations, including ": null
    },
    {
        "Buffalo Creek": "Buffalo Creek Reservation"
    },
    {
        ". By the end of the 18th century, only  of reservation territory remained.                  Former slave Joseph Black Joe Hodges, and Cornelius Winney, a Dutch trader from ": null
    },
    {
        "Albany": "Albany, New York"
    },
    {
        " who arrived in 1789, were early settlers along the mouth of Buffalo Creek. The first white settlers along the creek were prisoners captured during the ": null
    },
    {
        "Revolutionary War": "American Revolutionary War"
    },
    {
        ". The first resident and landowner of Buffalo with a permanent presence was Captain William Johnston, a white Iroquois interpreter who had been in the area since the days after the Revolutionary War and who the Senecas granted creekside land as a gift of appreciation. His house stood at present-day Washington and Seneca streets.     On July 20, 1793, the ": null
    },
    {
        "Holland Land Purchase": "Holland Land Purchase"
    },
    {
        " was completed, containing the land of present-day Buffalo, brokered by Dutch investors from ": null
    },
    {
        "Holland": "Holland"
    },
    {
        ". The ": null
    },
    {
        "Treaty of Big Tree": "Treaty Of Big Tree"
    },
    {
        " removed Iroquois title to lands west of the ": null
    },
    {
        "Genesee River": "Genesee River"
    },
    {
        " in 1797. In the fall of 1797, ": null
    },
    {
        "Joseph Ellicott": "Joseph Ellicott"
    },
    {
        ", the architect who helped survey Washington D.C. with brother ": null
    },
    {
        "Andrew": "Andrew Ellicott"
    },
    {
        ",   was appointed as the Chief of Survey for the Holland Land Company. Over the next year, he began to survey the tract of land at the mouth of Buffalo Creek. This was completed in 1803, and the new village boundaries extended from the creekside in the south to present-day Chippewa Street in the north and Carolina Street to the west,  which is where most settlers remained for the first decade of the 19th century. Although the company named the settlement New Amsterdam, the name did not catch on, reverting to Buffalo within ten years.  Buffalo had the first road to Pennsylvania built in 1802 for migrants passing through to the ": null
    },
    {
        "Connecticut Western Reserve": "Connecticut Western Reserve"
    },
    {
        " in Ohio.     In 1804, Ellicott designed a radial ": null
    },
    {
        "grid plan": "Grid Plan"
    },
    {
        " that would branch out from the village forming bicycle-like spokes, interrupted by diagonals, like the system used in the nations capital.  In the middle of the village was the intersection of eight streets, in what would become ": null
    },
    {
        "Niagara Square": "Niagara Square"
    },
    {
        ". Several blocks to the southeast he designed a semicircle fronting Main Street with an elongated park green, formerly his estate.  This would be known as Shelton Square,  at that time the center of the city ,  with the intersecting streets bearing the names of Dutch Holland Land Company members,   today Erie, Church and Niagara streets. ": null
    },
    {
        "Lafayette Square": "Lafayette Square"
    },
    {
        " also lies one block to the north, which was then bounded by streets bearing Iroquois names.     According to an early resident, the village had sixteen residences, a schoolhouse and two stores in 1806, primarily near Main, Swan and Seneca streets. There were also blacksmith shops, a tavern and a drugstore. The streets were small at 40 feet wide, and the village was still surrounded by woods. The first lot sold by the Holland Land Company was on September 11, 1806, to Zerah Phelps. By 1808, lots would sell from $25 to $50.     In 1804, Buffalos population was estimated at 400, similar to ": null
    },
    {
        "Batavia": "Batavia, New York"
    },
    {
        ", but Erie Countys growth was behind ": null
    },
    {
        "Chautauqua": "Chautauqua County, New York"
    },
    {
        ", ": null
    },
    {
        "Genesee": "Genesee County, New York"
    },
    {
        " and ": null
    },
    {
        "Wyoming": "Wyoming County, New York"
    },
    {
        " counties. Neighboring village ": null
    },
    {
        "Black Rock": "Black Rock, New York"
    },
    {
        " to the northwest was also an important center. Horatio J. Spafford noted in A Gazetteer of the State of New York that in fact, despite the growth the village of Buffalo had, Black Rock is deemed a better trading site for a great trading town than that of Buffalo, especially when considering the regional profile of mundane roads extending eastward. Before the east-to-west turnpike was completed, travelling from Albany to Buffalo would take a week, while even a trip from nearby ": null
    },
    {
        "Williamsville": "Williamsville, New York"
    },
    {
        " to Batavia could take upwards of three days.          Although ": null
    },
    {
        "slavery was rare in the state": "History Of Slavery In New York"
    },
    {
        ", limited instances of slavery had taken place in Buffalo during the early part of the 19th century. General ": null
    },
    {
        "Peter Buell Porter": "Peter Buell Porter"
    },
    {
        " is said to have had five slaves during his time in Black Rock, and several news ads also advertised slaves for sale.     In 1810, a courthouse was built. By 1811, the population was 500, with many people farming or doing manual labor. The first newspaper to be published was the Buffalo Gazette in October that same year.     On December 31, 1813, Buffalo and the village of Black Rock were burned by the British after the ": null
    },
    {
        "Battle of Buffalo": "Battle Of Buffalo"
    },
    {
        ".   The battle and subsequent fire was in response to the unprovoked destruction of ": null
    },
    {
        "Niagara-on-the-Lake": "Niagara-On-The-Lake"
    },
    {
        ", then known as Newark, by American forces.   On August4, 1814, British forces under Lt. Colonel John Tucker and Lt. Colonel William Drummond, General ": null
    },
    {
        "Gordon Drummonds": "Gordon Drummond"
    },
    {
        "nephew, attempted to raid Black Rock and Buffalo as part of a diversion to force an early surrender ": null
    },
    {
        "at Fort Erie": "Siege Of Fort Erie"
    },
    {
        " the next day, but were defeated by a small force of American riflemen under Major Lodwick Morgan at the ": null
    },
    {
        "Battle of Conjocta Creek": "Battle Of Conjocta Creek"
    },
    {
        ", and withdrew back into Canada. Consequently, Fort Eries siege under Gordon Drummond later failed, and British forces withdrew. Though only three buildings remained in the village, rebuilding was swift, finishing in 1815.       The population in 1840 was 18,213. The National Cyclopaedia of Useful Knowledge, Vol.III, London , Charles Knight, p.915 The village of Buffalo was part of and the seat of ": null
    },
    {
        "Niagara County": "Niagara County"
    },
    {
        " until the legislature passed an act separating the two on April 2, 1861.     On October 26, 1825,  the ": null
    },
    {
        "Erie Canal": "Erie Canal"
    },
    {
        " was completed, formed from part of Buffalo Creek,  with Buffalo a port-of-call for settlers heading westward.  At the time, the population was about 2,400.  By 1826, the 130 sq. mile Buffalo Creek Reservation at the western border of the village was transferred to Buffalo. The Erie Canal brought a surge in population and commerce, which led Buffalo to incorporate as a city in 1832.  The canal area was mature by 1847, with passenger and cargo ship activity leading to congestion in the harbor.              The mid-1800s saw a population boom, with the city doubling in size from 1845 to 1855. In 1855, almost two-thirds of the citys population were foreign-born immigrants, largely a mix of unskilled or educated ": null
    },
    {
        "Irish": "Irish Americans"
    },
    {
        " and ": null
    },
    {
        "Germans": "German Americans"
    },
    {
        " Catholics, who began self-segregating in different parts of the city. The Irish immigrants planted their roots along the railroad-heavy Buffalo River and Erie Canal to the southeast, to which there is still a heavy presence today; German immigrants found their way to the East Side, living a more laid-back, residential life. Some immigrants were apprehensive about the change of environment and left the city for the western region, while others tried to stay behind in the hopes of expanding their native cultures.     ": null
    },
    {
        "Fugitive black slaves": "Fugitive Slaves In The United States"
    },
    {
        " began to make their way northward to Buffalo in the 1840s, and many of them settled on the citys East Side. In 1845, construction began on the ": null
    },
    {
        "Macedonia Baptist Church": "Macedonia Baptist Church"
    },
    {
        ", a meeting spot in the Michigan and William Street neighborhood where blacks first settled.  It was also an important meeting place for the abolitionist movement. Buffalo was a terminus point of the ": null
    },
    {
        "Underground Railroad": "Underground Railroad"
    },
    {
        " with many ": null
    },
    {
        "fugitive slaves": "Fugitive Slaves In The United States"
    },
    {
        " crossing the ": null
    },
    {
        "Niagara River": "Niagara River"
    },
    {
        " to ": null
    },
    {
        "Fort Erie, Ontario": "Fort Erie, Ontario"
    },
    {
        " in search of freedom.      During the 1840s, Buffalos port continued to develop. Both passenger and commercial traffic expanded with some 93,000 passengers heading west from the port of Buffalo.   Grain and commercial goods shipments led to repeated expansion of the harbor. In 1843, the worlds first steam-powered ": null
    },
    {
        "grain elevator": "Grain Elevator"
    },
    {
        " was constructed by local merchant ": null
    },
    {
        "Joseph Dart": "Joseph Dart"
    },
    {
        " and engineer ": null
    },
    {
        "Robert Dunbar": "Robert Dunbar"
    },
    {
        ".  ": null
    },
    {
        "Darts Elevator": "Darts Elevator"
    },
    {
        " enabled faster unloading of ": null
    },
    {
        "lake freighters": "Lake Freighter"
    },
    {
        "along with the transshipment of grain in bulk from barges, canal boats, and rail cars.  By 1850, the citys population was 81,000.     In 1860, many railway companies and lines crossed through and terminated in Buffalo. Major ones were the ": null
    },
    {
        "Buffalo, Bradford and Pittsburgh Railroad": "Buffalo, Bradford And Pittsburgh Railroad"
    },
    {
        " , ": null
    },
    {
        "Buffalo and Erie Railroad": "Buffalo And Erie Railroad"
    },
    {
        " and the ": null
    },
    {
        "New York Central Railroad": "New York Central Railroad"
    },
    {
        " . During this time, Buffalonians controlled a quarter of all shipping traffic on Lake Erie, and shipbuilding was a thriving industry for the city.     Later, the ": null
    },
    {
        "Lehigh Valley Railroad": "Lehigh Valley Railroad"
    },
    {
        " would have its line terminate at Buffalo in 1867.                       At the dawn of the 20th century, local mills were among the first to benefit from ": null
    },
    {
        "hydroelectric power": "Hydroelectric Power"
    },
    {
        " generated by the Niagara River. The city got the nickname City of Light at this time due to the widespread electric lighting. , by Amanda Marie Rogers,  New York Makers , December 18, 2013 It was also part of the automobile revolution, hosting the ": null
    },
    {
        "brass era": "Brass Era"
    },
    {
        " car builders ": null
    },
    {
        "Pierce Arrow": "Pierce Arrow"
    },
    {
        " and the Seven Little Buffaloes early in the century. Believe it, or not. Clymer, Floyd. Treasury of Early American Automobiles, 1877–1925 , p.178. At the same time, an exit of local entrepreneurs and industrial titans brought about a nascent stage that would see the city lose its competitiveness against ": null
    },
    {
        "Pittsburgh": "Pittsburgh"
    },
    {
        ", ": null
    },
    {
        "Cleveland": "Cleveland"
    },
    {
        " and ": null
    },
    {
        "Detroit": "Detroit"
    },
    {
        ".     President ": null
    },
    {
        "William McKinley": "William Mckinley"
    },
    {
        " was ": null
    },
    {
        "shot and mortally wounded": "William Mckinley Assassination"
    },
    {
        " by an ": null
    },
    {
        "anarchist": "Anarchist"
    },
    {
        " at the ": null
    },
    {
        "Pan-American Exposition": "Pan-American Exposition"
    },
    {
        " in Buffalo on September 6, 1901.  McKinley died in the city eight days later  and ": null
    },
    {
        "Theodore Roosevelt": "Theodore Roosevelt"
    },
    {
        " was sworn in at the ": null
    },
    {
        "Wilcox Mansion": "Theodore Roosevelt Inaugural National Historic Site"
    },
    {
        ". The Great Depression of 1929–39 saw severe unemployment, especially among working-class men. The ": null
    },
    {
        "New Deal": "New Deal"
    },
    {
        " relief programs operated full force. The city became a stronghold of labor unions and the Democratic Party. Lansky, Lewis. Buffalo and the Great Depression, 1929–1933, in Milton Plesur, ed., American Historian: Essays to Honor Selig Adler , pp 204–13     During ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", Buffalo saw the return of prosperity and full employment due to its position as a manufacturing center.   As one of the ": null
    },
    {
        "most populous cities of the 1950s": "1950 United States Censuscity Rankings"
    },
    {
        ", Buffalos economy revolved almost entirely on its manufacturing base. Major companies such as ": null
    },
    {
        "Republic Steel": "Republic Steel"
    },
    {
        " and ": null
    },
    {
        "Lackawanna Steel": "Lackawanna Steel Company"
    },
    {
        " employed tens of thousands of Buffalonians. Integrated national shipping routes would use the ": null
    },
    {
        "Soo Locks": "Soo Locks"
    },
    {
        " near ": null
    },
    {
        "Lake Superior": "Lake Superior"
    },
    {
        " and a vast network of railroads and yards that crossed the city.     Lobbying by local businesses and interest groups against the ": null
    },
    {
        "St. Lawrence Seaway": "St. Lawrence Seaway"
    },
    {
        " began in the 1920s, long before its construction in 1957, which cut the city off from valuable trade routes. Its approval was reinforced by legislation shortly before its construction. Shipbuilding in Buffalo, such as the ": null
    },
    {
        "American Ship Building Company": "American Ship Building Company"
    },
    {
        ", shut down in 1962, ending an industry that had been a sector of the citys economy since 1812, and a direct result of reduced waterfront activity. With deindustrialization, and the nationwide trend of suburbanization; the citys economy began to deteriorate.   Like much of the ": null
    },
    {
        "Rust Belt": "Rust Belt"
    },
    {
        ", Buffalo, home to more than half a million people in the 1950s, has seen its population decline as heavy industries shut down and people left for the suburbs or other cities.                   Buffalo is on ": null
    },
    {
        "Lake Eries": "Lake Erie"
    },
    {
        "eastern end, opposite Fort Erie, Ontario, Canada.  It is at the origin of the Niagara River, which flows northward over ": null
    },
    {
        "Niagara Falls": "Niagara Falls"
    },
    {
        " and into ": null
    },
    {
        "Lake Ontario": "Lake Ontario"
    },
    {
        ".  The city is  south-southeast from ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        ". Relative to downtown, the city is generally flat with the exception of area surrounding North and High streets, where a hill of 90 feet gradually develops approaching from the south and north. The ": null
    },
    {
        "Southtowns": "Southtowns"
    },
    {
        " include the Boston Hills, while the ": null
    },
    {
        "Appalachian Mountains": "Appalachian Mountains"
    },
    {
        " sit in the ": null
    },
    {
        "Southern Tier": "Southern Tier"
    },
    {
        " below them. To the north and east, the region maintains a flatter profile descending to Lake Ontario. Various types of shale, limestone and ": null
    },
    {
        "lagerstätte": "Lagerstätte"
    },
    {
        "n are prevalent in the geographic makeup of Buffalo and surrounding areas, which line the waterbeds within and bordering the city.      Although there have not been any recent or significant ": null
    },
    {
        "earthquakes": "Earthquakes"
    },
    {
        ", Buffalo sits atop of the ": null
    },
    {
        "Southern Great Lakes Seismic Zone": "Southern Great Lakes Seismic Zone"
    },
    {
        ", which is part of the ": null
    },
    {
        "Great Lakes tectonic zone": "Great Lakes Tectonic Zone"
    },
    {
        ".      Buffalo has four ": null
    },
    {
        "channels": "Channel"
    },
    {
        " that flow through its boundaries: the ": null
    },
    {
        "Niagara River": "Niagara River"
    },
    {
        ", ": null
    },
    {
        "Buffalo River and Creek": "Buffalo River"
    },
    {
        ", ": null
    },
    {
        "Scajaquada Creek": "Scajaquada Creek"
    },
    {
        ", and the ": null
    },
    {
        "Black Rock Canal": "Black Rock Canal"
    },
    {
        ", which is adjacent to the Niagara River.      According to the ": null
    },
    {
        "United States Census Bureau": "United States Census Bureau"
    },
    {
        ", the city has an area of , of which  is land and the rest water. The total area is 22.66% water.                         Buffalos architecture is diverse, with a collection of buildings from the 19th and 20th centuries.  Most structures and works are still standing, such as the countrys largest intact parks system designed by ": null
    },
    {
        "Frederick Law Olmsted": "Frederick Law Olmsted"
    },
    {
        " and ": null
    },
    {
        "Calvert Vaux": "Calvert Vaux"
    },
    {
        ".   At the end of the 19th century, the ": null
    },
    {
        "Guaranty Building": "Prudential  Building"
    },
    {
        "—constructed by ": null
    },
    {
        "Louis Sullivan": "Louis Sullivan"
    },
    {
        "—was a prominent example of an early high-rise skyscraper.   The ": null
    },
    {
        "Darwin D. Martin House": "Darwin D. Martin House"
    },
    {
        " designed by ": null
    },
    {
        "Frank Lloyd Wright": "Frank Lloyd Wright"
    },
    {
        " and built between 1903 and 1905, is considered to be one of the most important projects from Wrights ": null
    },
    {
        "Prairie School": "Prairie School"
    },
    {
        " era. The ": null
    },
    {
        "Larkin Administration Building": "Larkin Administration Building"
    },
    {
        ", now demolished, was Frank Lloyd Wrights first commercial commission. The 20th century saw works such as the ": null
    },
    {
        "Art Deco": "Art Deco"
    },
    {
        "-style ": null
    },
    {
        "Buffalo City Hall": "Buffalo City Hall"
    },
    {
        " and ": null
    },
    {
        "Buffalo Central Terminal": "Buffalo Central Terminal"
    },
    {
        ", ": null
    },
    {
        "Electric Tower": "Electric Tower"
    },
    {
        ", the ": null
    },
    {
        "Richardson Olmsted Complex": "H. H. Richardson Complex"
    },
    {
        ", and the ": null
    },
    {
        "Rand Building": "Rand Building"
    },
    {
        ". ": null
    },
    {
        "Urban renewal": "Urban Renewal"
    },
    {
        " from the 1950s–1970s gave way to the construction of the ": null
    },
    {
        "Brutalist": "Brutalist Architecture"
    },
    {
        "-style ": null
    },
    {
        "Buffalo City Court Building": "Buffalo City Court Building"
    },
    {
        " and ": null
    },
    {
        "One Seneca Tower": "One Seneca Tower"
    },
    {
        "—formerly the HSBC Center, the citys tallest building.                  Buffalo has a ": null
    },
    {
        "humid continental climate": "Humid Continental Climate"
    },
    {
        " , which is common in the Great Lakes region.   Buffalo has snowy winters, but it is rarely the ": null
    },
    {
        "snowiest city in New York state": "Golden Snowball Award"
    },
    {
        ". , Retrieved May 31, 2013. , Retrieved May 31, 2013. The ": null
    },
    {
        "Blizzard of 1977": "Blizzard Of 1977"
    },
    {
        " resulted from a combination of high winds and snow accumulated on land and on frozen Lake Erie.  Snow does not typically impair the citys operation, but can cause significant damage during the autumn as with the ": null
    },
    {
        "October 2006 storm": "Lake Storm   Aphid"
    },
    {
        ".   In November 2014, the region had a ": null
    },
    {
        "record-breaking storm": "November 13–21, 2014 North American Winter Storm"
    },
    {
        ", producing over  of snow; this storm was named ": null
    },
    {
        "Snowvember": "November 13–21, 2014 North American Winter Storm"
    },
    {
        " .      Buffalo has the sunniest and driest summers of any major city in the ": null
    },
    {
        "Northeast": "Northeastern United States"
    },
    {
        ", but still has enough rain to keep vegetation green and lush. Summers are marked by plentiful sunshine and moderate ": null
    },
    {
        "humidity": "Humidity"
    },
    {
        " and temperature. Obscured by the notoriety of Buffalos winter snow is the fact Buffalo benefits from other lake effects such as the cooling southwest breezes off Lake Erie in summer that gently temper the warmest days. As a result, temperatures only rise above  three times in the average year, and the Buffalo station of the National Weather Service has never recorded an official temperature of  or more.  Rainfall is moderate but typically occurs at night. Lake Eries stabilizing effect continues to inhibit ": null
    },
    {
        "thunderstorms": "Thunderstorms"
    },
    {
        " and enhance sunshine in the immediate Buffalo area through most of July. August usually has more showers and is hotter and more humid as the warmer lake loses its temperature-stabilizing influence. The highest recorded temperature in Buffalo was  on August 27, 1948  and the lowest recorded temperature was , which occurred twice, on February 9, 1934 and February 2, 1961.                          Like most former industrial cities of the ": null
    },
    {
        "Great Lakes": "Great Lakes"
    },
    {
        " region in the United States, Buffalo is recovering from an economic depression from suburbanization and the loss of its industrial base. The citys population peaked in 1950 when it was the 15th largest city in the United States, down from the 8th largest city in America in 1900, and its population has been spreading out to the suburbs every census since then.     At the ": null
    },
    {
        "2010 Census": "2010 United States Census"
    },
    {
        ", the citys population was 50.4% White , 38.6% Black or African-American, 0.8% American Indian and Alaska Native, 3.2% Asian, 3.9% from some other race and 3.1% from two or more races, while 10.5% of the population was Hispanic or Latino of any race.  Since 2003, there has been an ever-growing number of ": null
    },
    {
        "Burmese": "Myanmar"
    },
    {
        " refugees, mostly of the ": null
    },
    {
        "Karen": "Karen People"
    },
    {
        " ethnicity, with an estimated 4,665 now residing in Buffalo.      The citys ": null
    },
    {
        "median household income": "Median Household Income"
    },
    {
        " is $24,536 and the median family income is $30,614. Males have a median income of $30,938 versus $23,982 for females. The citys per capita income is $14,991. Of the population 26.6%, and 23% of families, are below the poverty line. Of the total population, 38.4% of those under the age of 18 and 14% of those 65 and older live below the poverty line.                     Buffalos economic sectors include industrial, light manufacturing, high technology and services. The ": null
    },
    {
        "State of New York": "State Of New York"
    },
    {
        ", with over 15,000 employees, is the citys largest employer.  Other major employers include the ": null
    },
    {
        "United States government": "Federal Government Of The United States"
    },
    {
        ", ": null
    },
    {
        "Kaleida Health": "Kaleida Health"
    },
    {
        ", ": null
    },
    {
        "M & T Bank": "M & T Bank"
    },
    {
        " , the ": null
    },
    {
        "University at Buffalo": "University At Buffalo"
    },
    {
        ", ": null
    },
    {
        "General Motors": "Tonawanda Engine"
    },
    {
        ", ": null
    },
    {
        "Time Warner Cable": "Time Warner Cable"
    },
    {
        " and ": null
    },
    {
        "Tops Friendly Markets": "Tops Friendly Markets"
    },
    {
        ". Buffalo is home to ": null
    },
    {
        "Rich Products": "Rich Products"
    },
    {
        ", Canadian brewer ": null
    },
    {
        "Labatt": "Labatt"
    },
    {
        ", cheese company ": null
    },
    {
        "Sorrento Lactalis": "Sorrento Lactalis"
    },
    {
        ", ": null
    },
    {
        "Delaware North Companies": "Delaware North Companies"
    },
    {
        " /  and ": null
    },
    {
        "New Era Cap Company": "New Era Cap Company"
    },
    {
        ". More recently, the ": null
    },
    {
        "Tesla": "Tesla Inc."
    },
    {
        " Gigafactory 2": "Gigafactory 2"
    },
    {
        " opened in South Buffalo in summer 2017, as a result of the ": null
    },
    {
        "Buffalo Billion": "Buffalo Billion"
    },
    {
        " program.     The loss of traditional jobs in manufacturing, rapid suburbanization and high labor costs have led to economic decline and made Buffalo one of the poorest U.S. cities with populations of more than 250,000 people. An estimated 28.7–29.9% of Buffalo residents live below the poverty line, behind either only Detroit,  or only Detroit and Cleveland.  . WGRZ TV. Retrieved October 14, 2008. Buffalos median household income of $27,850 is third-lowest among large cities, behind only Miami and Cleveland; however the metropolitan areas median household income is $57,000. . Buffalo News. Retrieved September 2, 2007. This, in part, has led to the ": null
    },
    {
        "Buffalo-Niagara Falls metropolitan area": "Buffalo-Niagara Falls Metropolitan Area"
    },
    {
        " having the most affordable housing market in the U.S. The quarterly NAHB/Wells Fargo Housing Opportunity Index noted nearly 90% of the new and existing homes sold in the metropolitan area during the second quarter were affordable to families making the areas median income of $57,000. , the median home price in the city was $95,000.      Buffalos economy has begun to see significant improvements since the early 2010s.  Money from New York State Governor ": null
    },
    {
        "Andrew Cuomo": "Andrew Cuomo"
    },
    {
        " through a program known locally as ": null
    },
    {
        "Buffalo Billion": "Buffalo Billion"
    },
    {
        " has brought new construction, increased economic development, and hundreds of new jobs to the area.  As of March 2015, Buffalos unemployment rate was 5.9%,  slightly above the national average of 5.5%.  In 2016, the U.S. ": null
    },
    {
        "Bureau of Economic Analysis": "Bureau Of Economic Analysis"
    },
    {
        " valued the Buffalo areas economy at $54.9 billion.        Buffalos crime rate is higher than the national average. In 2015, there were 41 murders, 1,033 robberies, and 1,640 assaults.  In 2016, bizjournals.com published an article including an FBI report that ranked Buffalos violent crime rate as the 15th-worst in the nation.               Buffalos ": null
    },
    {
        "cuisine": "Cuisine"
    },
    {
        " encompasses a variety of cultural contributions, including ": null
    },
    {
        "Sicilian": "Sicilian Cuisine"
    },
    {
        ", ": null
    },
    {
        "Italian": "Italian Cuisine"
    },
    {
        ", ": null
    },
    {
        "Irish": "Irish Cuisine"
    },
    {
        ", ": null
    },
    {
        "Jewish": "Jewish Cuisine"
    },
    {
        ", ": null
    },
    {
        "German": "German Cuisine"
    },
    {
        ", ": null
    },
    {
        "Polish": "Polish Cuisine"
    },
    {
        ", ": null
    },
    {
        "African-American": "Soul Food"
    },
    {
        ", ": null
    },
    {
        "Greek": "Greek Cuisine"
    },
    {
        " and ": null
    },
    {
        "American": "Cuisine Of The United States"
    },
    {
        " influences. In 2015, the ": null
    },
    {
        "National Geographic Society": "National Geographic Society"
    },
    {
        " ranked Buffalo third on their list of The Worlds Top Ten Food Cities .  Locally owned restaurants offer ": null
    },
    {
        "Chinese": "Chinese Cuisine"
    },
    {
        ", German, ": null
    },
    {
        "Japanese": "Japanese Cuisine"
    },
    {
        ", ": null
    },
    {
        "Korean": "Korean Cuisine"
    },
    {
        ", ": null
    },
    {
        "Vietnamese": "Vietnamese Cuisine"
    },
    {
        ", ": null
    },
    {
        "Thai": "Thai Cuisine"
    },
    {
        ", ": null
    },
    {
        "Mexican": "Mexican Cuisine"
    },
    {
        ", ": null
    },
    {
        "Sicilian": "Sicilian Cuisine"
    },
    {
        ", ": null
    },
    {
        "Italian": "Italian Cuisine"
    },
    {
        ", ": null
    },
    {
        "Arab": "Arab Cuisine"
    },
    {
        ", ": null
    },
    {
        "Indian": "Indian Cuisine"
    },
    {
        ", ": null
    },
    {
        "Myanmar": "Burmese Cuisine"
    },
    {
        ", ": null
    },
    {
        "Caribbean": "Caribbean Cuisine"
    },
    {
        ", ": null
    },
    {
        "soul food": "Soul Food"
    },
    {
        " and ": null
    },
    {
        "French cuisine": "French Cuisine"
    },
    {
        ".   Buffalos local pizzerias differ from the thin-crust ": null
    },
    {
        "New York–style": "New York-Style Pizza"
    },
    {
        " pizzerias and deep-dish ": null
    },
    {
        "Chicago-style": "Chicago-Style Pizza"
    },
    {
        " pizzerias and is locally known for being a midpoint between the two.  The ": null
    },
    {
        "Beef on weck sandwich": "Beef On Weck Sandwich"
    },
    {
        ", ": null
    },
    {
        "kielbasa": "Kielbasa"
    },
    {
        ", ": null
    },
    {
        "sponge candy": "Sponge Candy"
    },
    {
        ", ": null
    },
    {
        "pastry heart": "Pastry Heart"
    },
    {
        "s, ": null
    },
    {
        "pierogi": "Pierogi"
    },
    {
        " and haddock ": null
    },
    {
        "fish fries": "Fish And Chips"
    },
    {
        " are local favorites, as is a ": null
    },
    {
        "loganberry": "Loganberryuses"
    },
    {
        "-flavored beverage that remains relatively obscure outside of Western New York and Southern ": null
    },
    {
        "Ontario": "Ontario"
    },
    {
        ".  ": null
    },
    {
        "Teressa Bellissimo": "Teressa Bellissimo"
    },
    {
        " first prepared the now widespread ": null
    },
    {
        "Chicken Wings": "Buffalo Wing"
    },
    {
        "at the ": null
    },
    {
        "Anchor Bar": "Anchor Bar"
    },
    {
        " in October 1964.      Buffalo has several well-known food companies. Non-dairy whipped topping was invented in Buffalo in 1945 by Robert E. Rich, Sr.  His company, ": null
    },
    {
        "Rich Products": "Rich Products"
    },
    {
        ", is one of the citys largest private employers.  ": null
    },
    {
        "General Mills": "General Mills"
    },
    {
        " was organized in Buffalo and Gold Medal brand flour, ": null
    },
    {
        "Wheaties": "Wheaties"
    },
    {
        ", ": null
    },
    {
        "Cheerios": "Cheerios"
    },
    {
        " and other General Mills brand cereals are manufactured here. ": null
    },
    {
        "Archer Daniels Midland": "Archer Daniels Midland"
    },
    {
        " operates its largest flour mill in the city. , Retrieved May 31, 2013. Buffalo is home to one of the worlds largest privately held food companies, ": null
    },
    {
        "Delaware North Companies": "Delaware North Companies"
    },
    {
        ", which operates concessions in sports arenas, stadiums, resorts and many state and federal parks.  The ": null
    },
    {
        "Taste of Buffalo": "Taste Of Buffalo"
    },
    {
        " and ": null
    },
    {
        "National Buffalo Wing Festival": "National Buffalo Wing Festival"
    },
    {
        " showcase food from the Buffalo area. These are two of the many festivals that take place in Buffalo during the summer.          Buffalo is home to over 50 private and public ": null
    },
    {
        "art galleries": "Art Gallery"
    },
    {
        ",  most notably the ": null
    },
    {
        "Albright-Knox Art Gallery": "Albright-Knox Art Gallery"
    },
    {
        ", home to a collection of ": null
    },
    {
        "modern": "Modern Art"
    },
    {
        " and ": null
    },
    {
        "contemporary art": "Contemporary Art"
    },
    {
        ", and the ": null
    },
    {
        "Burchfield-Penney Art Center": "Burchfield-Penney Art Center"
    },
    {
        ".  In 2012, AmericanStyle ranked Buffalo twenty-fifth in its list of top mid-sized cities for art.  It is also home to many independent media and literary arts organizations like ": null
    },
    {
        "Squeaky Wheel Film and Media Arts Center": "Squeaky Wheel Buffalo Media Arts Center"
    },
    {
        ". The Buffalo areas largest theater is ": null
    },
    {
        "Sheas Performing Arts Center": "Sheas Performing Arts Center"
    },
    {
        ", designed to accommodate 4,000 people with interiors by ": null
    },
    {
        "Louis Comfort Tiffany": "Louis Comfort Tiffany"
    },
    {
        ". Built in 1926, the theater presents Broadway musicals and concerts.  The theater community in the ": null
    },
    {
        "Buffalo Theater District": "Buffalo Theater District"
    },
    {
        " includes over 20 professional companies.        The ": null
    },
    {
        "Allentown Art Festival": "Allentown Art Festival"
    },
    {
        " showcases local and national artists every summer, in Buffalos ": null
    },
    {
        "Allentown": "Allentown, Buffalo"
    },
    {
        " district. Buffalo is also home to the ": null
    },
    {
        "Freedom Wall": "Freedom Wall"
    },
    {
        ", which is at the corner of Michigan Avenue and East Ferry Street. The Albright-Knox Art Gallery Public Art Initiative commissioned the Freedom Wall with support from the Niagara Frontier Transportation Authority.  The Freedom Wall,   2017.            The ": null
    },
    {
        "Buffalo Philharmonic Orchestra": "Buffalo Philharmonic Orchestra"
    },
    {
        ", which performs at ": null
    },
    {
        "Kleinhans Music Hall": "Kleinhans Music Hall"
    },
    {
        ", is one of the citys most prominent performing arts institutions. During the 1960s and 1970s, under the musical leadership of ": null
    },
    {
        "Lukas Foss": "Lukas Foss"
    },
    {
        " and ": null
    },
    {
        "Michael Tilson Thomas": "Michael Tilson Thomas"
    },
    {
        ", the Philharmonic collaborated with ": null
    },
    {
        "Grateful Dead": "Grateful Dead"
    },
    {
        " and toured with the ": null
    },
    {
        "Boston Pops Orchestra": "Boston Pops Orchestra"
    },
    {
        ".      Buffalo has the roots of many ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " and ": null
    },
    {
        "classical": "Classical Music"
    },
    {
        " musicians, and it is also the founding city for several mainstream bands and musicians,  ": null
    },
    {
        "Jazz fusion": "Jazz Fusion"
    },
    {
        " band ": null
    },
    {
        "Spyro Gyra": "Spyro Gyra"
    },
    {
        " and jazz ": null
    },
    {
        "saxophonists": "Saxophonists"
    },
    {
        " Grover Washington Jr": "Grover Washington Jr"
    },
    {
        ". also got their starts in Buffalo. Composer Harold Arlen, who wrote “Somewhere over the Rainbow”, was born and started his career in Buffalo. Pianist and composer ": null
    },
    {
        "Leonard Pennario": "Leonard Pennario"
    },
    {
        " was born in Buffalo in 1924 and made his debut concert at ": null
    },
    {
        "Carnegie Hall": "Carnegie Hall"
    },
    {
        " in 1943. Buffalos Colored Musicians Club , an extension of what was long ago a separate musicians union local, is thriving today and maintains a significant jazz history within its walls. Well-known indie artist ": null
    },
    {
        "Ani DiFranco": "Ani Difranco"
    },
    {
        " hails from Buffalo.        Although the regions primary tourism destination is Niagara Falls to the north, Buffalos tourism relies on historical attractions and outdoor recreation. The citys points of interest include the ": null
    },
    {
        "Edward M. Cotter fireboat": "Edward M. Cotter"
    },
    {
        ", considered the worlds oldest active ": null
    },
    {
        "fireboat": "Fireboat"
    },
    {
        "  and is a United States ": null
    },
    {
        "National Historic Landmark": "National Historic Landmark"
    },
    {
        ", ": null
    },
    {
        "Buffalo and Erie County Botanical Gardens": "Buffalo And Erie County Botanical Gardens"
    },
    {
        ", the ": null
    },
    {
        "Buffalo and Erie County Historical Society": "Buffalo And Erie County Historical Society"
    },
    {
        ",  ": null
    },
    {
        "Buffalo Museum of Science": "Buffalo Museum Of Science"
    },
    {
        ",  the ": null
    },
    {
        "Buffalo Zoo": "Buffalo Zoo"
    },
    {
        "—the third oldest in the United States  —": null
    },
    {
        "Forest Lawn Cemetery": "Forest Lawn Cemetery"
    },
    {
        ", ": null
    },
    {
        "Buffalo and Erie County Naval & Military Park": "Buffalo And Erie County Naval  &  Military Park"
    },
    {
        ", the ": null
    },
    {
        "Anchor Bar": "Anchor Bar"
    },
    {
        " and ": null
    },
    {
        "Darwin D. Martin House": "Darwin D. Martin House"
    },
    {
        ".     Redeveloped historical neighborhoods have also attracted tourism. The site of the former Erie Canal Harbor, ": null
    },
    {
        "Canalside": "Canalside"
    },
    {
        " has become a popular destination for tourists and residents since 2007 when Buffalo and the ": null
    },
    {
        "New York Power Authority": "New York Power Authority"
    },
    {
        " began to redevelop the former site of the ": null
    },
    {
        "Buffalo Memorial Auditorium": "Buffalo Memorial Auditorium"
    },
    {
        " into historically accurate canals.  ": null
    },
    {
        "Larkin Square": "Larkinville"
    },
    {
        ", in the former Hydraulics neighborhood and headquarters for the ": null
    },
    {
        "Larkin Company": "Larkin Company"
    },
    {
        ", has also become popular, featuring food trucks, concerts, and other events during the summer.      Buffalo is one of the largest Polish-American centers in the United States. As a result, many aspects of Polish culture have found a home in the city from food to festivals. One of the best examples is the yearly celebration of Easter Monday, known to many Eastern Europeans as ": null
    },
    {
        "Dyngus Day": "Dyngus Day"
    },
    {
        ".                Buffalo and the surrounding region is home to three major leagues ": null
    },
    {
        "professional sports": "Professional Sports"
    },
    {
        " teams. The ": null
    },
    {
        "NHLs": "Nhl"
    },
    {
        " Buffalo Sabres": "Buffalo Sabres"
    },
    {
        " and the ": null
    },
    {
        "NLL": "National Lacrosse League"
    },
    {
        "’s ": null
    },
    {
        "Buffalo Bandits": "Buffalo Bandits"
    },
    {
        " both play in ": null
    },
    {
        "KeyBank Center": "Keybank Center"
    },
    {
        ", while the ": null
    },
    {
        "NFLs": "Nfl"
    },
    {
        " Buffalo Bills": "Buffalo Bills"
    },
    {
        " play in suburban ": null
    },
    {
        "Orchard Park, New York": "Orchard Park, New York"
    },
    {
        ", where they have been since 1973.     The Bills, established in 1959, played in ": null
    },
    {
        "War Memorial Stadium": "War Memorial Stadium"
    },
    {
        " until 1973, when Rich Stadium, now ": null
    },
    {
        "New Era Field": "New Era Field"
    },
    {
        ", opened. The team competes in the ": null
    },
    {
        "AFC East": "Afc East"
    },
    {
        " division. Since the ": null
    },
    {
        "AFL–NFL merger": "Afl–Nfl Merger"
    },
    {
        " in 1970, the Bills have won the ": null
    },
    {
        "AFC": "American Football Conference"
    },
    {
        " conference championship four consecutive times , resulting in four lost ": null
    },
    {
        "Super Bowls": "Super Bowl"
    },
    {
        " .          The Sabres, established in 1970, played in ": null
    },
    {
        "Buffalo Memorial Auditorium": "Buffalo Memorial Auditorium"
    },
    {
        " until 1996, when ": null
    },
    {
        "Marine Midland Arena": "Marine Midland Arena"
    },
    {
        ", now ": null
    },
    {
        "KeyBank Center": "Keybank Center"
    },
    {
        " opened. The team plays in the ": null
    },
    {
        "Atlantic Division of the NHL": "Atlantic Division"
    },
    {
        ". The team has won one ": null
    },
    {
        "Presidents Trophy": "Presidents Trophy"
    },
    {
        " and three conference championships . However, like the Bills, the Sabres dont have a league championship, having lost the 1975 Stanley Cup to the ": null
    },
    {
        "Philadelphia Flyers": "Philadelphia Flyers"
    },
    {
        " and the 1999 Stanley Cup to the ": null
    },
    {
        "Dallas Stars": "Dallas Stars"
    },
    {
        ". Since 2014, both the Bills and Sabres have been owned by ": null
    },
    {
        "Terrence Pegula": "Terrence Pegula"
    },
    {
        ", a key investor in Buffalos revitalization efforts.     The ": null
    },
    {
        "Buffalo Bandits": "Buffalo Bandits"
    },
    {
        " where established in 1992 and played their home games in Buffalo Memorial Auditorium until 1996 when they followed the Sabres to Marine Midland Arena. They have won eight division championships and four league championships  ": null
    }
]