[
    {
        "         The Bundjalung National Park is a  ": null
    },
    {
        "national park": "national park"
    },
    {
        " located on the north coast of ": null
    },
    {
        "New South Wales": "new south wales"
    },
    {
        ", ": null
    },
    {
        "Australia": "australia"
    },
    {
        ",  north-east of ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        ". It protects an area of coastal plain, heathland and solitary beaches between the towns of ": null
    },
    {
        "Iluka": "iluka, new south wales"
    },
    {
        " and ": null
    },
    {
        "Evans Head": "evans head, new south wales"
    },
    {
        ".     The park features ": null
    },
    {
        "coffee rock": "coffee rock"
    },
    {
        " formations that can be found on the beaches at its northern end.     Along the Iluka peninsula coast at the southern end of the park are a number of closely spaced headlands that create small crescent shaped beaches of white sand. Each headland features rock platforms cut by waves and contain rock pools that are havens for intertidal marine life.     The park is named for the ": null
    },
    {
        "Bundjalung": "bundjalung people"
    },
    {
        " Aboriginal nation, the original occupiers of the land.     Facilities in the park include camping areas at Black Rocks and at Woody Head .     The park contains six picnic areas: Gummi Garra near Evans Head and Shark Bay, Old Ferry Crossing, Back Beach, Frazers Reef and Iluka Bluff on the Iluka Peninsula.     The north-eastern portion of the park contains an exclusion zone utilised by the ": null
    },
    {
        "RAAF": "royal australian air force"
    },
    {
        " as an active bombing range and public access is restricted. The bombing range has been in use since ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " as a training facility for target practice. Its existence predates the gazettal of the park and provides a mixed benefit in that it has preserved a large area that has been relatively untouched by human interference for many years.   ": null
    }
]