[
    {
        "   The Bureau of Sabotage is a fictional government entity set in two of ": null
    },
    {
        "Frank Herbert": "frank herbert"
    },
    {
        "s ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novels,  Whipping Star  and  The Dosadi Experiment , and first introduced in his 42 short story ": null
    },
    {
        "The Tactful Saboteur": "the tactful saboteur"
    },
    {
        " . It is colloquially known as BuSab. ": null
    },
    {
        "Jorj X. McKie": "jorj x. mckie"
    },
    {
        ", the ": null
    },
    {
        "protagonist": "protagonist"
    },
    {
        " of all the works listed below, is a saboteur extraordinary first appeared in the story ": null
    },
    {
        "A Matter of Traces": "a matter of traces"
    },
    {
        " in 42         In Herberts fiction, sometime in the far future, government becomes terrifyingly efficient. ": null
    },
    {
        "Red tape": "red tape"
    },
    {
        " no longer exists: laws are conceived of, passed, funded, and executed within hours, rather than months. The bureaucratic machinery becomes a juggernaut, rolling over human concerns and welfare with terrible speed, jerking the universe of sentients one way, then another, threatening to destroy everything in a fit of spastic reactions. In short, the speed of government goes beyond sentient control .         Founded by the mysterious Five Ears of unknown species, BuSab began as a terrorist organization whose sole purpose was to frustrate the workings of government in order to give sentients a chance to reflect upon changes and deal with them. Having saved sentiency from its government, BuSab was officially recognized as a necessary check on the power of government. It provides a natural outlet for societys regular crop of troublemakers, who must be countered by societys regular crop of do-gooders .     First a corps, then a bureau, BuSab gained legally recognized powers to interfere in the workings of any world, of any species, of any government or corporation, answerable only to themselves. Their motto is,  In Lieu of Red Tape.          Forbidden from committing acts of ": null
    },
    {
        "sabotage": "sabotage"
    }
]