[
    {
        "     The Burgundians  were a large ": null
    },
    {
        "East Germanic": "east germanic tribes"
    },
    {
        "  tribe or group of tribes that lived in the time of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " in the region of ": null
    },
    {
        "Germania": "germania"
    },
    {
        " that is now part of ": null
    },
    {
        "Poland": "poland"
    },
    {
        ".     In the ": null
    },
    {
        "late Roman period": "history of the roman empire284–301: diocletian and the tetrarchy"
    },
    {
        ", as the empire came under pressure from many such barbarian peoples, a powerful group of Burgundians and other Vandalic tribes moved westwards towards the Roman frontiers along the ": null
    },
    {
        "Rhine Valley": "rhine"
    },
    {
        ", making them neighbors of the ": null
    },
    {
        "Franks": "franks"
    },
    {
        " who formed their kingdoms to the north, and the ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        "c ": null
    },
    {
        "Alemanni": "alemanni"
    },
    {
        " who were settling to their south, also near the Rhine. They established themselves in ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        ", but with Roman cooperation their descendants eventually established the ": null
    },
    {
        "Kingdom of the Burgundians": "kingdom of the burgundians"
    },
    {
        " much further south, and within the empire, in the ": null
    },
    {
        "western Alps": "western alps"
    },
    {
        " region where modern Switzerland, France and Italy meet. This later became a component of the ": null
    },
    {
        "Frankish empire": "frankish empire"
    },
    {
        ". The name of this kingdom survives in the regional appellation, ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        ", which is a region in modern France, representing only a part of that kingdom.     Another part of the Burgundians stayed in their previous homeland in the ": null
    },
    {
        "Oder": "oder"
    },
    {
        "-": null
    },
    {
        "Vistula": "vistula"
    },
    {
        " basin and formed a contingent in ": null
    },
    {
        "Attilas": "attila"
    },
    {
        " Hunnic": "hunnic empire"
    },
    {
        " army by 451. Sidonnius Appolinarius, Carmina, 7, 322 Luebe, Die Burgunder, in Krüger II, p. 373 n. 21, in Herbert Schutz, Tools, weapons and ornaments: Germanic material culture in Pre-Carolingian Central Europe, 400-750, BRILL, 2001, p.36     Before clear documentary evidence begins, the Burgundians may have originally emigrated from mainland ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " to the Baltic island of ": null
    },
    {
        "Bornholm": "bornholm"
    },
    {
        ", and from there to the ": null
    },
    {
        "Vistula": "vistula"
    },
    {
        " basin, in the middle of what is now Poland.        The ": null
    },
    {
        "ethnonym": "ethnonym"
    },
    {
        " Burgundians is commonly used in English to refer to the Burgundi  who settled in ": null
    },
    {
        "Sapaudia": "sapaudia"
    },
    {
        " , in the western Alps, during the 5th century. The original ": null
    },
    {
        "Kingdom of the Burgundians": "kingdom of the burgundians"
    },
    {
        " barely intersected the modern Bourgogne and more closely matched the boundaries of the ": null
    },
    {
        "Arpitan": "arpitan"
    },
    {
        " or ": null
    },
    {
        "Romand": "romand"
    },
    {
        "  language area, Andres Kristol, Francoprovencal , in The Oxford Guide to the Romance Languages, Oxford, Oxford University Press, pp. 351–2. centred on the  Rôno-Arpes  region of France, ": null
    },
    {
        "Romandy": "romandy"
    },
    {
        " in west Switzerland and Val dOuta  , in north west Italy.     In modern usage, however, Burgundians can sometimes refer to later inhabitants of the geographical  Bourgogne  or Borgogne , named after the old kingdom, but not corresponding to the original boundaries of it. Between the 6th and 20th centuries, the boundaries and political connections of Burgundy have changed frequently. In modern times the only area still referred to as ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        " is in France, which derives its name from the ": null
    },
    {
        "Duchy of Burgundy": "duchy of burgundy"
    },
    {
        ". But in the context of the Middle Ages the term Burgundian can refer even to the powerful political entity the Dukes controlled which included not only Burgundy itself but had actually expanded to have a strong association with areas now in modern ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " and Southern ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ". The parts of the old Kingdom not within the French controlled Duchy tended to come under different names, except for the ": null
    },
    {
        "County of Burgundy": "county of burgundy"
    },
    {
        ".                The Burgundians had a tradition of ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        "n origin which finds support in place-name evidence and archaeological evidence and many consider their tradition to be correct . The Burgundians are believed to have then emigrated to the Baltic island of ": null
    },
    {
        "Bornholm": "bornholm"
    },
    {
        " . However, by about ": null
    },
    {
        "250 AD": "250 ad"
    },
    {
        ", the population of Bornholm had largely disappeared from the island. Most cemeteries ceased to be used, and those that were still used had few burials . In  Þorsteins saga Víkingssonar  , a man named ": null
    },
    {
        "Veseti": "veseti"
    },
    {
        " settled on a ": null
    },
    {
        "holm": "holm"
    },
    {
        " called borgundarhólmr in Old Norse, i.e. Bornholm. ": null
    },
    {
        "Alfred the Greats": "alfred the great"
    },
    {
        "translation of  Orosius  uses the name Burgenda land to refer to a territory next to the land of ": null
    },
    {
        "Sweons": "suiones"
    },
    {
        " .  The poet and early mythologist ": null
    },
    {
        "Viktor Rydberg": "viktor rydberg"
    },
    {
        " ,  asserted from an early medieval source,  Vita Sigismundi , that they themselves retained oral traditions about their Scandinavian origin.     Early Roman sources, such as ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        " and ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        ", knew little concerning the Germanic peoples east of the Elbe river, or on the Baltic Sea. Pliny however mentions them among the ": null
    },
    {
        "Vandalic": "vandals"
    },
    {
        " or ": null
    },
    {
        "Eastern Germanic": "eastern germanic"
    },
    {
        " Germani peoples, including also the ": null
    },
    {
        "Goths": "goths"
    },
    {
        ". ": null
    },
    {
        "Claudius Ptolemy": "claudius ptolemy"
    },
    {
        " lists them as living between the Suevus  and Vistula rivers, north of the ": null
    },
    {
        "Lugii": "lugii"
    },
    {
        ", and south of the coast dwelling tribes. Around the mid 2nd century AD, there was a significant migration by Germanic tribes of Scandinavian origin   towards the south-east, creating turmoil along the entire Roman frontier.    These migrations culminated in the ": null
    },
    {
        "Marcomannic Wars": "marcomannic wars"
    },
    {
        ", which resulted in widespread destruction and the first invasion of ": null
    },
    {
        "Italy": "italy"
    },
    {
        " in the Roman Empire period. ": null
    },
    {
        "Jordanes": "jordanes"
    },
    {
        " reports that during the 3rd century, the Burgundians living in the Vistula basin were almost annihilated by ": null
    },
    {
        "Fastida": "fastida"
    },
    {
        ", king of the Gepids, whose kingdom was at the mouth of the Vistula.     In the late 3rd century, the Burgundians appear on the east bank of the Rhine, confronting Roman Gaul. ": null
    },
    {
        "Zosimus": "zosimus"
    },
    {
        " reports them being defeated by the emperor ": null
    },
    {
        "Probus": "marcus aurelius probus"
    },
    {
        " in 278 in Gaul. At this time, they were led by a Vandal king. A few years later, ": null
    },
    {
        "Claudius Mamertinus": "claudius mamertinus"
    },
    {
        " mentions them along with the ": null
    },
    {
        "Alamanni": "alamanni"
    },
    {
        ", a ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        "c people. These two peoples had moved into the ": null
    },
    {
        "Agri Decumates": "agri decumates"
    },
    {
        " on the eastern side of the Rhine, an area today referred to still as ": null
    },
    {
        "Swabia": "swabia"
    },
    {
        ", at times attacking Roman Gaul together and sometimes fighting each other. He also mentions that the Goths had previously defeated the Burgundians.     ": null
    },
    {
        "Ammianus Marcellinus": "ammianus marcellinus"
    },
    {
        ", on the other hand, claimed that the Burgundians were descended from Romans. The Roman sources do not speak of any specific migration from Poland by the Burgundians , and so there have historically been some doubts about the link between the eastern and western Burgundians.      In 369/370, the Emperor ": null
    },
    {
        "Valentinian I": "valentinian i"
    },
    {
        " enlisted the aid of the Burgundians in his war against the Alemanni.     Approximately four decades later, the Burgundians appear again. Following ": null
    },
    {
        "Stilichos": "stilicho"
    },
    {
        "withdrawal of troops to fight ": null
    },
    {
        "Alaric I": "alaric i"
    },
    {
        " the ": null
    },
    {
        "Visigoth": "visigoths"
    },
    {
        " in AD 406-408, a large group of peoples from central Europe north of the Danube, came west and crossed the Rhine, entering the Empire, near the lands of the Burgundians who had moved much earlier. The dominant groups were ": null
    },
    {
        "Alans": "alans"
    },
    {
        ", ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " , and Danubian ": null
    },
    {
        "Suevi": "suevi"
    },
    {
        " . The majority of these Danubian peoples moved through Gaul and eventually established themselves in kingdoms in Roman Hispania. One group of Alans was settled in northern Gaul by the Romans.     Some Burgundians also migrated westwards and settled as  foederati  in the Roman province of ": null
    },
    {
        "Germania Prima": "germania prima"
    },
    {
        " along the ": null
    },
    {
        "Middle Rhine": "middle rhine"
    },
    {
        ". Other Burgundians however remained outside the empire and apparently formed a contingent in ": null
    },
    {
        "Attilas": "attila"
    },
    {
        " Hunnic": "hunnic empire"
    },
    {
        " army by 451.              In 411, the Burgundian king ": null
    },
    {
        "Gundahar": "gunther"
    },
    {
        "  set up a puppet emperor, ": null
    },
    {
        "Jovinus": "jovinus"
    },
    {
        ", in cooperation with ": null
    },
    {
        "Goar": "goar"
    },
    {
        ", king of the ": null
    },
    {
        "Alans": "alans"
    },
    {
        ". With the authority of the ": null
    },
    {
        "Gallic emperor": "gallo-roman culture"
    },
    {
        " that he controlled, Gundahar settled on the left bank of the Rhine, between the river ": null
    },
    {
        "Lauter": "lauter"
    },
    {
        " and the ": null
    },
    {
        "Nahe": "nahe"
    },
    {
        ", seizing ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        ", ": null
    },
    {
        "Speyer": "speyer"
    },
    {
        ", and ": null
    },
    {
        "Strassburg": "strassburg"
    },
    {
        ". Apparently as part of a truce, the Emperor ": null
    },
    {
        "Honorius": "honorius"
    },
    {
        " later officially granted them the land, Prosper, a. 386 with its capital at the old Celtic Roman settlement of Borbetomagus .     Despite their new status as foederati, Burgundian raids into Roman Upper ": null
    },
    {
        "Gallia Belgica": "gallia belgica"
    },
    {
        " became intolerable and were ruthlessly brought to an end in 436, when the Roman general ": null
    },
    {
        "Aëtius": "flavius aëtius"
    },
    {
        " called in ": null
    },
    {
        "Hun": "hun"
    },
    {
        " mercenaries, who overwhelmed the Rhineland kingdom in 437. Gundahar was killed in the fighting, reportedly along with the majority of the Burgundian tribe. Prosper; Chronica Gallica 452; Hydatius; and Sidonius Apollinaris     The destruction of Worms and the Burgundian kingdom by the Huns became the subject of heroic legends that were afterwards incorporated in the  Nibelungenlied —on which ": null
    },
    {
        "Wagner": "richard wagner"
    },
    {
        " based his ": null
    },
    {
        "Ring Cycle": "ring cycle"
    },
    {
        "—where King Gunther and Queen ": null
    },
    {
        "Brünhild": "brünnehilde"
    },
    {
        " hold their court at Worms, and ": null
    },
    {
        "Siegfried": "sigurd"
    },
    {
        " comes to woo Kriemhild.  In fact, the Etzel of the Nibelungenlied is based on ": null
    },
    {
        "Attila the Hun": "attila the hun"
    },
    {
        ".            For reasons not cited in the sources, the Burgundians were granted foederati status a second time, and in 443 were resettled by ": null
    },
    {
        "Aëtius": "flavius aëtius"
    },
    {
        " in the region of Sapaudia. Chronica Gallica 452 Though the precise geography is uncertain, Sapaudia corresponds to the modern-day ": null
    },
    {
        "Savoy": "savoy"
    },
    {
        ", and the Burgundians probably lived near Lugdunum, known today as ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ". Wood 1994, Gregory II, 9 A new king, ": null
    },
    {
        "Gundioc": "gundioc"
    },
    {
        " or Gunderic, presumed to be Gundahars son, appears to have reigned following his fathers death. Drew, p.  1 The historian Pline tells us that Gonderic ruled the areas of Saône, Dauphiny, Savoie and a part of Provence. He set up ": null
    },
    {
        "Vienne": "vienne, isère"
    },
    {
        " as the capital of the kingdom of Burgundy. In all, eight Burgundian kings of the house of Gundahar ruled until the kingdom was overrun by the Franks in 534.     As allies of Rome in its last decades, the Burgundians fought alongside Aëtius and a confederation of Visigoths and others in the battle against ": null
    },
    {
        "Attila": "attila the hun"
    },
    {
        " at the ": null
    },
    {
        "Battle of Châlons": "battle of châlons"
    },
    {
        " in 451. The alliance between Burgundians and Visigoths seems to have been strong, as Gundioc and his brother Chilperic I accompanied ": null
    },
    {
        "Theodoric II": "theodoric ii"
    },
    {
        " to Spain to fight the Sueves in 455. Jordanes, Getica, 231       Also in 455, an ambiguous reference infidoque tibi Burdundio ductu ": null
    },
    {
        "Sidonius Apollinaris": "sidonius apollinaris"
    },
    {
        " in Panegyr. Avit. 442. implicates an unnamed treacherous Burgundian leader in the murder of the emperor ": null
    },
    {
        "Petronius Maximus": "petronius maximus"
    },
    {
        " in the chaos preceding the sack of Rome by the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        ". The Patrician ": null
    },
    {
        "Ricimer": "ricimer"
    },
    {
        " is also blamed; this event marks the first indication of the link between the Burgundians and Ricimer, who was probably Gundiocs brother-in-law and ": null
    },
    {
        "Gundobads": "gundobad"
    },
    {
        "uncle. John Malalas, 374     In 456, the Burgundians, apparently confident in their growing power, negotiated a territorial expansion and power sharing arrangement with the local Roman senators. Marius of Avenches     In 457, Ricimer overthrew another emperor, ": null
    },
    {
        "Avitus": "avitus"
    },
    {
        ", raising ": null
    },
    {
        "Majorian": "majorian"
    },
    {
        " to the throne. This new emperor proved unhelpful to Ricimer and the Burgundians. The year after his ascension, Majorian stripped the Burgundians of the lands they had acquired two years earlier. After showing further signs of independence, he was murdered by Ricimer in 461.     Ten years later, in 472, Ricimer–who was by now the son-in-law of the Western Emperor ": null
    },
    {
        "Anthemius": "anthemius"
    },
    {
        "–was plotting with Gundobad to kill his father-in-law; Gundobad beheaded the emperor . Chronica Gallica 511; John of Antioch, fr. 209; Jordanes, Getica, 239 Ricimer then appointed ": null
    },
    {
        "Olybrius": "olybrius"
    },
    {
        "; both died, surprisingly of natural causes, within a few months. Gundobad seems then to have succeeded his uncle as Patrician and king-maker, and raised ": null
    },
    {
        "Glycerius": "glycerius"
    },
    {
        " to the throne. Marius of Avenches; John of Antioch, fr. 209     In 474, Burgundian influence over the empire seems to have ended. Glycerius was deposed in favor of ": null
    },
    {
        "Julius Nepos": "julius nepos"
    },
    {
        ", and Gundobad returned to Burgundy, presumably at the death of his father Gundioc. At this time or shortly afterwards, the Burgundian kingdom was divided among Gundobad and his brothers, Godigisel, Chilperic II, and Gundomar I. Gregory, II, 28            According to ": null
    },
    {
        "Gregory of Tours": "gregory of tours"
    },
    {
        ", the years following Gundobads return to Burgundy saw a bloody consolidation of power. Gregory states that Gundobad murdered his brother Chilperic, drowning his wife and exiling their daughters . Gregory, II, 28. Gregorys chronology of the events surrounding Clovis and Gundobad has been questioned by Bury, Shanzer, and Wood, among others. Gregory was somewhat of a Frankish apologist, and commonly discredited the enemies of Clovis by attributing to them some fairly shocking acts. As with Godegisel, he also commonly refers to the treachery of Clovis allies, when in fact Clovis seems to have bought them off . This is contested by, e.g., Bury, who points out problems in much of Gregorys chronology for the events.     In c. 500, when Gundobad and Clovis were at war, Gundobad appears to have been betrayed by his brother Godegisel, who joined the Franks; together Godegisels and Clovis forces crushed the army of Gundobad . Marius a. 500; Gregory, II, 32 Gundobad was temporarily holed up in Avignon, but was able to re-muster his army and sacked Vienne, where Godegisel and many of his followers were put to death. From this point, Gundobad appears to have been the sole king of Burgundy. e.g., Gregory, II, 33 This would imply that his brother Gundomar was already dead, though there are no specific mentions of the event in the sources.     Either Gundobad and Clovis reconciled their differences, or Gundobad was forced into some sort of vassalage by Clovis earlier victory, as the Burgundian king appears to have assisted the Franks in 507 in their victory over ": null
    },
    {
        "Alaric II": "alaric ii"
    },
    {
        " the Visigoth.     During the upheaval, sometime between 483–501, Gundobad began to set forth the Lex Gundobada , issuing roughly the first half, which drew upon the Lex Visigothorum. Following his consolidation of power, between 501 and his death in 516, Gundobad issued the second half of his law, which was more originally Burgundian.            The Burgundians were extending their power over southeastern ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        "—that is, northern Italy, western Switzerland, and southeastern France. In 493, ": null
    },
    {
        "Clovis": "clovis i"
    },
    {
        ", king of the Franks, married the Burgundian princess ": null
    },
    {
        "Clotilda": "clotilde"
    },
    {
        " , who converted him to the Catholic faith.     At first allied with ": null
    },
    {
        "Clovis": "clovis i"
    },
    {
        " Franks": "franks"
    },
    {
        " against the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " in the early 6th century, the Burgundians were eventually conquered at ": null
    },
    {
        "Autun": "battle of autun"
    },
    {
        " by the Franks in 532 after a first attempt in the ": null
    },
    {
        "Battle of Vézeronce": "battle of vézeronce"
    },
    {
        ". The Burgundian kingdom was made part of the ": null
    },
    {
        "Merovingian": "merovingian"
    },
    {
        " kingdoms, and the Burgundians themselves were by and large absorbed as well.       The 5th century ": null
    },
    {
        "Gallo-Roman": "gallo-roman"
    },
    {
        " poet": "poet"
    },
    {
        " and ": null
    },
    {
        "landowner": "landowner"
    },
    {
        " Sidonius": "sidonius apollinaris"
    },
    {
        ", who at one point lived with the Burgundians, described them as a long-haired people of immense physical size:               The Burgundian language belonged to the ": null
    },
    {
        "East Germanic language group": "east germanic languages"
    },
    {
        ". It appears to have become extinct during the late sixth century. W.B. Lockwood, A Panorama of Indo-European Languages     Little is known of the language. Some proper names of Burgundians are recorded, and some words used in the area in modern times are thought to be derived from the ancient Burgundian language, but it is often difficult to distinguish these from Germanic words of other origin, and in any case the modern form of the words is rarely suitable to infer much about the form in the old language.       Somewhere in the east the Burgundians had converted to the ": null
    },
    {
        "Arian Christianity": "arianism"
    },
    {
        " from earlier ": null
    },
    {
        "Germanic paganism": "germanic paganism"
    },
    {
        ". Their Arianism proved a source of suspicion and distrust between the Burgundians and the ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " Western Roman Empire": "western roman empire"
    },
    {
        ".     Divisions were evidently healed or healing circa 500, however, as ": null
    },
    {
        "Gundobad": "gundobad"
    },
    {
        ", one of the last Burgundian kings, maintained a close personal friendship with ": null
    },
    {
        "Avitus": "avitus of vienne"
    },
    {
        ", the ": null
    },
    {
        "bishop of Vienne": "roman catholic archdiocese of vienne"
    },
    {
        ". Moreover, Gundobads son and successor, ": null
    },
    {
        "Sigismund": "sigismund of burgundy"
    },
    {
        ", was himself a Catholic, and there is evidence that many of the Burgundian people had converted by this time as well, including several female members of the ruling family.            The Burgundians left three ": null
    },
    {
        "legal code": "legal code"
    },
    {
        "s, among the earliest from any of the Germanic tribes.     The Liber Constitutionum sive Lex Gundobada , also known as the  Lex Burgundionum , or more simply the Lex Gundobada or the Liber, was issued in several parts between 483 and 516, principally by Gundobad, but also by his son, Sigismund. Drew, p.  6–7 It was a record of Burgundian customary law and is typical of the many Germanic law codes from this period. In particular, the Liber borrowed from the  Lex Visigothorum  Drew, p.  6 and influenced the later  Lex Ripuaria . Rivers, p.  9 The Liber is one of the primary sources for contemporary Burgundian life, as well as the history of its kings.     Like many of the Germanic tribes, the Burgundians legal traditions allowed the application of separate laws for separate ethnicities. Thus, in addition to the Lex Gundobada, Gundobad also issued a set of laws for Roman subjects of the Burgundian kingdom, the Lex Romana Burgundionum .     In addition to the above codes, Gundobads son Sigismund later published the Prima Constitutio. ": null
    }
]