[
    {
        "      Bézouts theorem is a statement in ": null
    },
    {
        "algebraic geometry": "algebraic geometry"
    },
    {
        " concerning the number of common points, or intersection points, of two plane ": null
    },
    {
        "algebraic curve": "algebraic curve"
    },
    {
        "s which do not share a common component . The theorem states that the number of common points of two such curves is at most equal to the product of their ": null
    },
    {
        "degree": "degree of a polynomial"
    },
    {
        "s, and equality holds if one counts ": null
    },
    {
        "points at infinity": "points at infinity"
    },
    {
        " and points with complex coordinates , and if each point is counted with its ": null
    },
    {
        "intersection multiplicity": "intersection number"
    },
    {
        ". It is named after ": null
    },
    {
        "Étienne Bézout": "étienne bézout"
    },
    {
        ".     Bézouts theorem refers also to the generalization to higher dimensions: Let there be n ": null
    },
    {
        "homogeneous polynomial": "homogeneous polynomial"
    },
    {
        "s in  variables, of degrees d_42 \\ldots, d_n , that define n ": null
    },
    {
        "hypersurface": "hypersurface"
    },
    {
        "s in the ": null
    },
    {
        "projective space": "projective space"
    },
    {
        " of dimension n. If the number of intersection points of the hypersurfaces is finite over an algebraic closure of the ground field, then this number is d_42 \\cdots d_n, if the points are counted with their multiplicity.   As in the case of two variables, in the case of affine hypersurfaces, and when not counting multiplicities nor non-real points, this theorem provides only an upper bound of the number of points, which is often reached. This is often referred to as Bézouts bound.     Bézouts theorem is fundamental in ": null
    },
    {
        "computer algebra": "computer algebra"
    },
    {
        " and effective ": null
    },
    {
        "algebraic geometry": "algebraic geometry"
    },
    {
        ", by showing that most problems have a ": null
    },
    {
        "computational complexity": "computational complexity theory"
    },
    {
        " that is at least exponential in the number of variables. It follows that in these areas, the best complexity that may be hoped for will occur in algorithms that have a complexity which is polynomial in Bézouts bound.       Suppose that X and Y are two plane ": null
    },
    {
        "projective": "projective plane"
    },
    {
        " curves defined over a ": null
    },
    {
        "field": "field"
    },
    {
        " F that do not have a common component . Then the total number of intersection points of X and Y with coordinates in an ": null
    },
    {
        "algebraically closed field": "algebraically closed field"
    },
    {
        " E which contains F, counted with their ": null
    },
    {
        "multiplicities": "intersection number"
    },
    {
        ", is equal to the product of the degrees of X and Y.     The generalization in higher dimension may be stated as:     Let n ": null
    },
    {
        "projective hypersurface": "projective variety"
    },
    {
        "s be given in a ": null
    },
    {
        "projective space": "projective space"
    },
    {
        " of dimension n over an algebraic closed field, which are defined by n ": null
    },
    {
        "homogeneous polynomial": "homogeneous polynomial"
    },
    {
        "s in n + 42 variables, of degrees d_42 \\ldots,d_n. Then either the number of intersection points is infinite, or the number of intersection points, counted with multiplicity, is equal to the product d_42 \\cdots d_n. If the hypersurfaces are irreducible and in relative ": null
    },
    {
        "general position": "general position"
    },
    {
        ", then there are d_42 \\cdots d_n intersection points, all with multiplicity 42     There are various proofs of this theorem. In particular, it may be deduced by applying iteratively the following generalization: if V is a ": null
    },
    {
        "projective algebraic set": "projective algebraic set"
    },
    {
        " of dimension \\delta and ": null
    },
    {
        "degree": "degree of an algebraic variety"
    },
    {
        " d_42 , and H is a hypersurface of degree d_42 , that does not contain any ": null
    },
    {
        "irreducible component": "irreducible component"
    },
    {
        " of V, then the intersection of V and H has dimension \\delta42 and degree d_42d_42 For a proof using the ": null
    },
    {
        "Hilbert series": "hilbert series"
    },
    {
        " see ": null
    },
    {
        "Hilbert series and Hilbert polynomialDegree of a projective variety and Bézouts theorem": "hilbert series and hilbert polynomialdegree of a projective variety and bézouts theorem"
    },
    {
        ".     Bézouts theorem has been further generalized as the so-called ": null
    },
    {
        "multi-homogeneous Bézout theorem": "multi-homogeneous bézout theorem"
    },
    {
        ".       Bezouts theorem was essentially stated by ": null
    },
    {
        "Isaac Newton": "isaac newton"
    },
    {
        " in his proof of ": null
    },
    {
        "lemma 42": "newtons theorem about ovals"
    },
    {
        " of volume 42 of his  Principia  in 42 where he claims that two curves have a number of intersection points given by the product of their degrees. The theorem was later published in 42 in ": null
    },
    {
        "Étienne Bézout": "étienne bézout"
    },
    {
        "s Théorie générale des équations algébriques. Bézout, who did not have at his disposal modern algebraic notation for equations in several variables, gave a proof based on manipulations with cumbersome algebraic expressions. From the modern point of view, Bézouts treatment was rather heuristic, since he did not formulate the precise conditions for the theorem to hold. This led to a sentiment, expressed by certain authors, that his proof was neither correct nor the first proof to be given.           The most delicate part of Bézouts theorem and its generalization to the case of k algebraic hypersurfaces in k-dimensional ": null
    },
    {
        "projective space": "projective space"
    },
    {
        " is the procedure of assigning the proper intersection multiplicities. If P is a common point of two plane algebraic curves X and Y that is a non-singular point of both of them and, moreover, the ": null
    },
    {
        "tangent line": "tangent line"
    },
    {
        "s to X and Y at P are distinct then the intersection multiplicity is one. This corresponds to the case of transversal intersection . If the curves X and Y have a common tangent at P then the multiplicity is at least two. See ": null
    },
    {
        "intersection number": "intersection number"
    },
    {
        " for the definition in general.       Two distinct non-parallel lines always meet in exactly one point. Two parallel lines intersect at a unique point that lies at infinity. To see how this works algebraically, in projective space, the lines x42y42 and x42y42 are represented by the homogeneous equations x42y42z42 and x42y42z42 . Solving, we get x 42y and z42 , corresponding to the point in homogeneous coordinates. As the z-coordinate is 42 this point lies on the line at infinity.   The special case where one of the curves is a line can be derived from the ": null
    },
    {
        "fundamental theorem of algebra": "fundamental theorem of algebra"
    },
    {
        ". In this case the theorem states that an algebraic curve of degree n intersects a given line in n points, counting the multiplicities. For example, the parabola defined by y - x^42 42 has degree 42; the line y-ax42 has degree 42 and they meet in exactly two points when a ≠ 42 and touch at the origin when a 42   Two ": null
    },
    {
        "conic section": "conic section"
    },
    {
        "s generally intersect in four points, some of which may coincide. To properly account for all intersection points, it may be necessary to allow complex coordinates and include the points on the infinite line in the projective plane. For example:     :Two circles never intersect in more than two points in the plane, while Bézouts theorem predicts four. The discrepancy comes from the fact that every circle passes through the same two complex points on the line at infinity. Writing the circle   ::: ^42+^42 r^42   ::in ": null
    },
    {
        "homogeneous coordinates": "homogeneous coordinates"
    },
    {
        ", we get   ::: ^42+^42 - r^42z^42 42   ::from which it is clear that the two points  and  lie on every circle. When two circles dont meet at all in the real plane, the two other intersections have non-zero imaginary parts, or if they are concentric then they meet at exactly the two points on the line at infinity with an intersection multiplicity of two.   :Any conic should meet the line at infinity at two points according to the theorem. A hyperbola meets it at two real points corresponding to the two directions of the asymptotes. An ellipse meets it at two complex points which are conjugate to one another---in the case of a circle, the points  and . A parabola meets it at only one point, but it is a point of tangency and therefore counts twice.   :The following pictures show examples in which the circle x 42 +y 42 42 meets another ellipse in fewer intersection points because at least one of them has multiplicity greater than 42:             Write the equations for X and Y in ": null
    },
    {
        "homogeneous coordinates": "homogeneous coordinates"
    },
    {
        " as   : a_42z^m + a_42z^ + \\dots + a_z + a_m 42   : b_42z^n + b_42z^ + \\dots + b_z + b_n 42   where a i  and b i  are homogeneous polynomials of degree i in x and y. The points of intersection of X and Y correspond to the solutions of the system of equations. Form the ": null
    },
    {
        "Sylvester matrix": "sylvester matrix"
    },
    {
        "; in the case m42 n42 this is     : S\\begin   a_42 & a_42 & a_42 & a_42 & a_42 & 42 & 42 \\\\   42 & a_42 & a_42 & a_42 & a_42 & a_42 & 42 \\\\   42 & 42 & a_42 & a_42 & a_42 & a_42 & a_42 \\\\   b_42 & b_42 & b_42 & b_42 & 42 & 42 & 42 \\\\   42 & b_42 & b_42 & b_42 & b_42 & 42 & 42 \\\\   42 & 42 & b_42 & b_42 & b_42 & b_42 & 42 \\\\   42 & 42 & 42 & b_42 & b_42 & b_42 & b_42 \\\\   \\end.   The ": null
    },
    {
        "determinant": "determinant"
    },
    {
        " S S, which is also called the ": null
    },
    {
        "resultant": "resultant"
    },
    {
        " of the two polynomials, is 42 exactly when the two equations have a common solution in z. The terms of |S mn, so |S mn in x and y . By the ": null
    },
    {
        "fundamental theorem of algebra": "fundamental theorem of algebra"
    },
    {
        ", this can be factored into mn linear factors so there are mn solutions to the system of equations. The linear factors correspond to the lines that join the origin to the points of intersection of the curves. Follows ": null
    }
]