[
    {
        "            Clive Staples Lewis was a British writer and ": null
    },
    {
        "lay theologian": "Lay Theologian"
    },
    {
        ". He held academic positions in English literature at both ": null
    },
    {
        "Oxford University": "Oxford University"
    },
    {
        "  and ": null
    },
    {
        "Cambridge University": "Cambridge University"
    },
    {
        " . He is best known for his works of fiction, especially  The Screwtape Letters ,  The Chronicles of Narnia , and  The Space Trilogy , and for his non-fiction Christian apologetics, such as  Mere Christianity ,  Miracles , and  The Problem of Pain .     Lewis and fellow novelist ": null
    },
    {
        "J. R. R. Tolkien": "J. R. R. Tolkien"
    },
    {
        " were close friends. They both served on the English faculty at Oxford University and were active in the informal Oxford literary group known as the ": null
    },
    {
        "Inklings": "Inklings"
    },
    {
        ".  According to Lewiss memoir  Surprised by Joy , he was baptised in the ": null
    },
    {
        "Church of Ireland": "Church Of Ireland"
    },
    {
        ", but fell away from his faith during adolescence. Lewis returned to ": null
    },
    {
        "Anglicanism": "Anglicanism"
    },
    {
        " at the age of 32, owing to the influence of Tolkien and other friends, and he became an ordinary layman of the Church of England . Lewiss faith profoundly affected his work, and his wartime radio broadcasts on the subject of Christianity brought him wide acclaim.     Lewis wrote more than 30 books Richard B. Cunningham, C. S. Lewis: Defender of the Faith, Wipf and Stock Publishers , p. 14 which have been translated into more than 30 languages and have sold millions of copies. The books that make up The Chronicles of Narnia have sold the most and have been popularised on stage, TV, radio, and cinema. His philosophical writings are widely cited by Christian apologists from many denominations.     In 1956, Lewis married American writer ": null
    },
    {
        "Joy Davidman": "Joy Davidman"
    },
    {
        "; she died of cancer four years later at the age of 45. Lewis died on 22 November 1963 from ": null
    },
    {
        "renal failure": "Renal Failure"
    },
    {
        ", one week before his 65th birthday. In 2013, on the 50th anniversary of his death, Lewis was honoured with a memorial in ": null
    },
    {
        "Poets Corner": "Poets Corner"
    },
    {
        " in ": null
    },
    {
        "Westminster Abbey": "Westminster Abbey"
    },
    {
        ".              Clive Staples Lewis was born in ": null
    },
    {
        "Belfast": "Belfast"
    },
    {
        ", Ireland , on 29 November 1898.  His father was Albert James Lewis , a solicitor whose father Richard had come to Ireland from Wales during the mid-19th century. His mother was Florence Augusta Lewis, ": null
    },
    {
        "née": "Name At Birth"
    },
    {
        " Hamilton , known as Flora, the daughter of a ": null
    },
    {
        "Church of Ireland": "Church Of Ireland"
    },
    {
        " priest, and great granddaughter of both Bishop ": null
    },
    {
        "Hugh Hamilton": "Hugh Hamilton"
    },
    {
        " and ": null
    },
    {
        "John Staples": "John Staples"
    },
    {
        ". He had an elder brother, ": null
    },
    {
        "Warren Hamilton Lewis": "Warren Lewis"
    },
    {
        " .       When his dog Jacksie was killed by a car, the four-year old Lewis adopted the name Jacksie. At first, he would answer to no other name, but later accepted Jack, the name by which he was known to friends and family for the rest of his life.  When he was seven, his family moved into Little Lea , the family home of his childhood, in the ": null
    },
    {
        "Strandtown": "Strandtown"
    },
    {
        " area of East Belfast.      As a boy, Lewis was fascinated with ": null
    },
    {
        "anthropomorphic": "Anthropomorphic"
    },
    {
        " animals; he fell in love with ": null
    },
    {
        "Beatrix Potters": "Beatrix Potter"
    },
    {
        "stories and often wrote and illustrated his own animal stories. He and his brother Warnie created the world of ": null
    },
    {
        "Boxen": "Boxen"
    },
    {
        ", inhabited and run by animals. Lewis loved to read; his fathers house was filled with books, and he felt that finding a book to read was as easy as walking into a field and finding a new blade of grass .      Lewis was schooled by private tutors until age nine when his mother died in 1908 from cancer. His father then sent him to live and study at ": null
    },
    {
        "Wynyard School": "Wynyard School"
    },
    {
        " in ": null
    },
    {
        "Watford": "Watford"
    },
    {
        ", Hertfordshire. Lewiss brother had enrolled there three years previously. The school was closed not long afterward due to a lack of pupils; the headmaster Robert Oldie Capron was soon after committed to a psychiatric hospital. Lewis then attended ": null
    },
    {
        "Campbell College": "Campbell College"
    },
    {
        " in the east of Belfast about a mile from his home, but left after a few months due to respiratory problems. He was then sent to the health-resort town of ": null
    },
    {
        "Malvern": "Malvern, Worcestershire"
    },
    {
        ", Worcestershire, where he attended the preparatory school Cherbourg House, which Lewis calls Chartres in his autobiography. It was during this time that Lewis abandoned his childhood Christian faith and became an atheist, becoming interested in mythology and the occult. In September 1913, Lewis enrolled at ": null
    },
    {
        "Malvern College": "Malvern College"
    },
    {
        ", where he remained until the following June. He found the school socially competitive. After leaving Malvern, he studied privately with ": null
    },
    {
        "William T. Kirkpatrick": "William T. Kirkpatrick"
    },
    {
        ", his fathers old tutor and former headmaster of ": null
    },
    {
        "Lurgan College": "Lurgan College"
    },
    {
        ".      As a teenager, Lewis was wonder-struck by the songs and legends of what he called Northernness, the ancient literature of Scandinavia preserved in the ": null
    },
    {
        "Icelandic sagas": "Icelandic Sagas"
    },
    {
        ".  These legends intensified an inner longing that he would later call joy . He also grew to love nature; its beauty reminded him of the stories of the North, and the stories of the North reminded him of the beauties of nature. His teenage writings moved away from the tales of Boxen, and he began using different art forms, such as ": null
    },
    {
        "epic poetry": "Epic Poetry"
    },
    {
        " and opera, to try to capture his new-found interest in ": null
    },
    {
        "Norse mythology": "Norse Mythology"
    },
    {
        " and the natural world. Studying with Kirkpatrick instilled in him a love of ": null
    },
    {
        "Greek literature": "Greek Literature"
    },
    {
        " and mythology and sharpened his debate and reasoning skills. In 1916, Lewis was awarded a scholarship at ": null
    },
    {
        "University College, Oxford": "University College, Oxford"
    },
    {
        ".  Within months of entering Oxford, the British Army shipped him to France to fight in the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ". In one of his letters, Lewis cited that his experience of the horror of war, along with the loss of his mother and his unhappiness in school, were the bases of his pessimism and atheism.           Lewis experienced a certain cultural shock on first arriving in England: No Englishman will be able to understand my first impressions of England, Lewis wrote in  Surprised by Joy . The strange ": null
    },
    {
        "English accents": "Regional Accents Of English Speakers"
    },
    {
        " with which I was surrounded seemed like the voices of demons. But what was worst was the English landscape  ... I have made up the quarrel since; but at that moment I conceived a hatred for England which took many years to heal.      From boyhood, Lewis had immersed himself in ": null
    },
    {
        "Norse": "Norse Mythology"
    },
    {
        " and ": null
    },
    {
        "Greek": "Greek Mythology"
    },
    {
        " mythology, and later in ": null
    },
    {
        "Irish mythology": "Irish Mythology"
    },
    {
        " and ": null
    },
    {
        "literature": "Irish Literature"
    },
    {
        ". He also expressed an interest in the Irish language,   though there is not much evidence that he laboured to learn it. He developed a particular fondness for ": null
    },
    {
        "W. B. Yeats": "W. B. Yeats"
    },
    {
        ", in part because of Yeatss use of Irelands Celtic heritage in poetry. In a letter to a friend, Lewis wrote, I have here discovered an author exactly after my own heart, whom I am sure you would delight in, W. B. Yeats. He writes plays and poems of rare spirit and beauty about our old Irish mythology.      In 1921, Lewis met Yeats twice, since Yeats had moved to Oxford. Lewis was surprised to find his English peers indifferent to Yeats and the ": null
    },
    {
        "Celtic Revival": "Celtic Revival"
    },
    {
        " movement, and wrote: I am often surprised to find how utterly ignored Yeats is among the men I have met: perhaps his appeal is purely Irish  – if so, then thank the gods that I am Irish. Yeatss appeal wasnt exclusively Irish; he was also a major magical opponent of famed English occultist ": null
    },
    {
        "Aleister Crowley": "Aleister Crowley"
    },
    {
        ", as noted extensively throughout Lawrence Sutins . New York: MacMillan . cf. pp. 56–78.  Early in his career, Lewis considered sending his work to the major ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        " publishers, writing: If I do ever send my stuff to a publisher, I think I shall try Maunsel, those Dublin people, and so tack myself definitely onto the Irish school.  After his ": null
    },
    {
        "conversion to Christianity": "Conversion To Christianity"
    },
    {
        ", his interests gravitated towards Christian theology and away from pagan Celtic mysticism.      Lewis occasionally expressed a somewhat tongue-in-cheek chauvinism toward the English. Describing an encounter with a fellow Irishman, he wrote: Like all Irish people who meet in England, we ended by criticisms on the invincible flippancy and dullness of the Anglo-Saxon race. After all, there is no doubt, ami, that the Irish are the only people: with all their faults, I would not gladly live or die among another folk.  Throughout his life, he sought out the company of other Irish people living in England and visited Northern Ireland regularly. In 1958 he spent his honeymoon there at the Old Inn, ": null
    },
    {
        "Crawfordsburn": "Crawfordsburn"
    },
    {
        ", which he called my Irish life .     Various critics have suggested that it was Lewiss dismay over the sectarian conflict in his native Belfast which led him to eventually adopt such an ": null
    },
    {
        "ecumenical": "Ecumenism"
    },
    {
        " brand of Christianity. As one critic has said, Lewis repeatedly extolled the virtues of all branches of the Christian faith, emphasising a need for unity among Christians around what the Catholic writer  called Mere Christianity, the core doctrinal beliefs that all denominations share . On the other hand, Paul Stevens of the ": null
    },
    {
        "University of Toronto": "University Of Toronto"
    },
    {
        " has written that Lewis mere Christianity masked many of the political prejudices of an old-fashioned Ulster Protestant, a native of middle-class Belfast for whom British withdrawal from Northern Ireland even in the 1950s and 1960s was unthinkable. Paul Stevens, review of Reforming Empire: Protestant Colonialism and Conscience in British Literature by Christopher Hodgkins,  Modern Philology , Vol. 103, Issue 1 , pp. 137–38, citing Humphrey Carpenter, The Inklings , pp. 50–52, 206–207.       Soon after Lewis entered Oxford in the 1917 summer term, he joined the ": null
    },
    {
        "Officers Training Corps": "Officers Training Corps"
    },
    {
        " at the university as his most promising route into the army .  From there, he was drafted into a Cadet Battalion for training. After his training, he was ": null
    },
    {
        "commissioned": "Commissioned Officer"
    },
    {
        " into the Third Battalion of the ": null
    },
    {
        "Somerset Light Infantry": "Somerset Light Infantry"
    },
    {
        " of the ": null
    },
    {
        "British Army": "British Army"
    },
    {
        " as a Second Lieutenant. On his 19th birthday he arrived at the front line in the ": null
    },
    {
        "Somme": "River Somme"
    },
    {
        " Valley in France, where he experienced ": null
    },
    {
        "trench warfare": "Trench Warfare"
    },
    {
        " for the first time.  On 15 April 1918, Lewis was wounded and two of his colleagues were killed by a British shell falling short of its target.   He suffered from depression and homesickness during his convalescence and, upon his recovery in October, he was assigned to duty in ": null
    },
    {
        "Andover": "Andover, Hampshire"
    },
    {
        ", England. He was ": null
    },
    {
        "demobilised": "Demobilised"
    },
    {
        " in December 1918 and soon restarted his studies.      After Lewis returned to Oxford University, he received a ": null
    },
    {
        "First": "British Undergraduate Degree Classification"
    },
    {
        " in ": null
    },
    {
        "Honour Moderations": "Honour Moderations"
    },
    {
        "  in 1920, a First in ": null
    },
    {
        "Greats": "Literae Humaniores"
    },
    {
        " in 1922, and a First in English in 1923. In 1924 he became a philosophy tutor at ": null
    },
    {
        "University College": "University College Oxford"
    },
    {
        " and, in 1925, was elected a Fellow and Tutor in English Literature at ": null
    },
    {
        "Magdalen College": "Magdalen College, Oxford"
    },
    {
        ", where he served for 29 years until 1954.        During his army training, Lewis shared a room with another cadet, Edward Courtnay Francis Paddy Moore . Maureen Moore, Paddys sister, said that the two made a mutual pact that if either died during the war, the survivor would take care of both of their families. Paddy was killed in action in 1918 and Lewis kept his promise. Paddy had earlier introduced Lewis to his mother, Jane King Moore, and a friendship quickly sprang up between Lewis, who was 18 when they met, and Jane, who was 45. The friendship with Moore was particularly important to Lewis while he was recovering from his wounds in hospital, as his father did not visit him.     Lewis lived with and cared for Moore until she was hospitalised in the late 1940s. He routinely introduced her as his mother, referred to her as such in letters, and developed a deeply affectionate friendship with her. Lewiss own mother had died when he was a child, and his father was distant, demanding, and eccentric.     Speculation regarding their relationship resurfaced with the 1990 publication of ": null
    },
    {
        "A. N. Wilsons": "A. N. Wilson"
    },
    {
        "biography of Lewis. Wilson attempted to make a case for their having been lovers for a time. Wilsons biography was not the first to address the question of Lewiss relationship with Moore. ": null
    },
    {
        "George Sayer": "George Sayer"
    },
    {
        " knew Lewis for 29 years, and he had sought to shed light on the relationship during the period of 14 years prior to Lewiss conversion to Christianity. In his biography Jack: A Life of C. S. Lewis, he wrote:        Later Sayer changed his mind. In the introduction to the 1997 edition of his biography of Lewis he wrote:        Lewis spoke well of Mrs. Moore throughout his life, saying to his friend George Sayer, She was generous and taught me to be generous, too. In December 1917, Lewis wrote in a letter to his childhood friend Arthur Greeves that Jane and Greeves were the two people who matter most to me in the world .     In 1930, Lewis moved into ": null
    },
    {
        "The Kilns": "The Kilns"
    },
    {
        " with his brother Warnie, Mrs. Moore, and her daughter Maureen. The Kilns was a house in the district of ": null
    },
    {
        "Headington Quarry": "Headington Quarry"
    },
    {
        " on the outskirts of Oxford, now part of the suburb of ": null
    },
    {
        "Risinghurst": "Risinghurst"
    },
    {
        ". They all contributed financially to the purchase of the house, which passed to Maureen, who by then was ": null
    },
    {
        "Dame Maureen Dunbar": "Maureen Dunbar"
    },
    {
        ", when Warren died in 1973.     Jane Moore suffered from ": null
    },
    {
        "dementia": "Dementia"
    },
    {
        " in her later years and was eventually moved into a nursing home, where she died in 1951. Lewis visited her every day in this home until her death.       Lewis was raised in a religious family that attended the ": null
    },
    {
        "Church of Ireland": "Church Of Ireland"
    },
    {
        ". He became an atheist at age 15, though he later described his young self as being paradoxically angry with God for not existing . His early separation from Christianity began when he started to view his religion as a chore and a duty; around this time, he also gained an interest in the occult, as his studies expanded to include such topics. The Critic, Volume 32, Thomas More Association, 1973. Original from the ": null
    },
    {
        "University of Michigan": "University Of Michigan"
    },
    {
        ". Lewis quoted ": null
    },
    {
        "Lucretius": "Lucretius"
    },
    {
        "  as having one of the ": null
    },
    {
        "strongest arguments": "Argument From Poor Design"
    },
    {
        " for atheism:     :   :     which he translated poetically as follows:     :Had God designed the world, it would not be   :A world so frail and faulty as we see.          Lewiss interest in the works of ": null
    },
    {
        "George MacDonald": "George Macdonald"
    },
    {
        " was part of what turned him from atheism. This can be seen particularly well through this passage in Lewiss  The Great Divorce , chapter nine, when the semi-autobiographical ": null
    },
    {
        "main character": "Protagonist"
    },
    {
        " meets MacDonald in ": null
    },
    {
        "Heaven": "Heaven"
    },
    {
        ":        He eventually returned to Christianity, having been influenced by arguments with his Oxford colleague and Christian friend ": null
    },
    {
        "J. R. R. Tolkien": "J. R. R. Tolkien"
    },
    {
        ", whom he seems to have met for the first time on 11 May 1926, and the book  The Everlasting Man  by ": null
    },
    {
        "G. K. Chesterton": "G. K. Chesterton"
    },
    {
        ". Lewis vigorously resisted conversion, noting that he was brought into Christianity like a prodigal, kicking, struggling, resentful, and darting his eyes in every direction for a chance to escape . He described his last struggle in  Surprised by Joy :          After his conversion to ": null
    },
    {
        "theism": "Theism"
    },
    {
        " in 1929, Lewis converted to Christianity in 1931, following a long discussion and late-night walk with his close friends Tolkien and ": null
    },
    {
        "Hugo Dyson": "Hugo Dyson"
    },
    {
        ". He records making a specific commitment to Christian belief while on his way to the zoo with his brother. He became a member of the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        "  – somewhat to the disappointment of Tolkien, who had hoped that he would join the Catholic Church.     Lewis was a committed ": null
    },
    {
        "Anglican": "Church Of England"
    },
    {
        " who upheld a largely orthodox Anglican theology, though in his ": null
    },
    {
        "apologetic": "Apologetics"
    },
    {
        " writings, he made an effort to avoid espousing any one denomination. In his later writings, some believe that he proposed ideas such as purification of ": null
    },
    {
        "venial sins": "Venial Sin"
    },
    {
        "after death in ": null
    },
    {
        "purgatory": "Purgatory"
    },
    {
        "  and ": null
    },
    {
        "mortal sin": "Mortal Sin"
    },
    {
        " , which are generally considered to be Roman Catholic teachings, although they are also widely held in Anglicanism . Regardless, Lewis considered himself an entirely orthodox Anglican to the end of his life, reflecting that he had initially attended church only to receive communion and had been repelled by the hymns and the poor quality of the sermons. He later came to consider himself honoured by worshipping with men of faith who came in shabby clothes and work boots and who sang all the verses to all the hymns.       After the outbreak of the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        " in 1939, the Lewises took child evacuees from London and other cities into ": null
    },
    {
        "The Kilns": "The Kilns"
    },
    {
        ".  Lewis was only 40 when the war started, and he tried to re-enter military service, offering to instruct cadets; but his offer was not accepted. He rejected the recruiting offices suggestion of writing columns for the ": null
    },
    {
        "Ministry of Information": "Ministry Of Information"
    },
    {
        " in the press, as he did not want to write lies  to deceive the enemy. He later served in the local ": null
    },
    {
        "Home Guard": "Home Guard"
    },
    {
        " in Oxford.     From 1941 to 1943, Lewis spoke on religious programmes broadcast by the BBC from London while the city was under periodic air raids.  These broadcasts were appreciated by civilians and servicemen at that stage. For example, ": null
    },
    {
        "Air Chief Marshal Sir Donald Hardman": "Donald Hardman"
    },
    {
        " wrote:     : The war, the whole of life, everything tended to seem pointless. We needed, many of us, a key to the meaning of the universe. Lewis provided just that.      The broadcasts were anthologised in Mere Christianity. From 1941, he was occupied at his summer holiday weekends visiting R.A.F. stations to speak on his faith, invited by the ": null
    },
    {
        "R.A.F.s": "Royal Air Force"
    },
    {
        " Chaplain-in-Chief": "Chaplain-In-Chief"
    },
    {
        " Maurice Edwards": "Maurice Edwards"
    },
    {
        ".      It was also during the same wartime period that Lewis was invited to become first President of the ": null
    },
    {
        "Oxford Socratic Club": "Socratic Club"
    },
    {
        " in January 1942,  a position that he enthusiastically held until he resigned on appointment to Cambridge University in 1954.         Lewis was named on the last list of honours by ": null
    },
    {
        "George VI": "George Vi"
    },
    {
        " in December 1951 as a ": null
    },
    {
        "Commander of the Order of the British Empire": "Commander Of The Order Of The British Empire"
    },
    {
        " but declined so as to avoid association with any political issues.         In 1954, Lewis accepted the newly founded chair of Mediaeval and Renaissance Literature at ": null
    },
    {
        "Magdalene College, Cambridge": "Magdalene College, Cambridge"
    },
    {
        ", where he finished his career. He maintained a strong attachment to the city of ": null
    },
    {
        "Oxford": "Oxford"
    },
    {
        ", keeping a home there and returning on weekends until his death in 1963.            In later life, Lewis corresponded with ": null
    },
    {
        "Joy Davidman Gresham": "Joy Gresham"
    },
    {
        ", an American writer of Jewish background, a former Communist, and a convert from atheism to Christianity.  She was separated from her alcoholic and abusive husband, novelist ": null
    },
    {
        "William L. Gresham": "William Lindsay Gresham"
    },
    {
        ", and came to England with her two sons, David and ": null
    },
    {
        "Douglas": "Douglas Gresham"
    },
    {
        ". Lewis at first regarded her as an agreeable intellectual companion and personal friend, and it was on this level that he agreed to enter into a ": null
    },
    {
        "civil marriage": "Civil Marriage"
    },
    {
        " contract with her so that she could continue to live in the UK. The civil marriage took place at the ": null
    },
    {
        "register office": "Register Office"
    },
    {
        ", 42 ": null
    },
    {
        "St Giles, Oxford": "St Giles, Oxford"
    },
    {
        ", on 23 April 1956.   Lewiss brother Warren wrote: For Jack the attraction was at first undoubtedly intellectual. Joy was the only woman whom he had met  ... who had a brain which matched his own in suppleness, in width of interest, and in analytical grasp, and above all in humour and a sense of fun.  After complaining of a painful hip, she was diagnosed with terminal ": null
    },
    {
        "bone cancer": "Bone Cancer"
    },
    {
        ", and the relationship developed to the point that they sought a Christian marriage. Since she was divorced, this was not straightforward in the Church of England at the time, but a friend, the Rev. Peter Bide, performed the ceremony at her bed in the ": null
    },
    {
        "Churchill Hospital": "Churchill Hospital"
    },
    {
        " on 21 March 1957. Schultz and West , The C. S. Lewis Readers Encyclopedia , p. 249.     Greshams cancer soon went into remission, and the couple lived together as a family with ": null
    },
    {
        "Warren Lewis": "Warren Lewis"
    },
    {
        " until 1960, when her cancer recurred and she died on 13 July. Earlier that year, the couple took a brief holiday in Greece and the ": null
    },
    {
        "Aegean": "Aegean Sea"
    },
    {
        "; Lewis was fond of walking but not of travel, and this marked his only crossing of the English Channel after 1918. Lewiss book  A Grief Observed  describes his experience of bereavement in such a raw and personal fashion that he originally released it under the pseudonym N. W. Clerk to keep readers from associating the book with him. Ironically, many friends recommended the book to Lewis as a method for dealing with his own grief. After Lewiss death, his authorship was made public by Fabers, with the permission of the executors.     Lewis continued to raise Greshams two sons after her death. ": null
    },
    {
        "Douglas Gresham": "Douglas Gresham"
    },
    {
        " is a Christian like Lewis and his mother,  while David Gresham turned to his mothers ancestral faith, becoming Orthodox Jewish in his beliefs. His mothers writings had featured the Jews in an unsympathetic manner, particularly one ": null
    },
    {
        "shohet": "Shohet"
    },
    {
        " . David informed Lewis that he was going to become a ritual slaughterer to present this type of Jewish religious functionary to the world in a more favourable light. In a 2005 interview, Douglas Gresham acknowledged that he and his brother were not close, but he did say that they are in email contact.  Douglas remains involved in the affairs of the Lewis estate.          In early June 1961, Lewis began suffering from ": null
    },
    {
        "nephritis": "Nephritis"
    },
    {
        ", which resulted in blood poisoning. His illness caused him to miss the autumn term at Cambridge, though his health gradually began improving in 1962 and he returned that April. His health continued to improve and, according to his friend George Sayer, Lewis was fully himself by early 1963. On 15 July that year, he fell ill and was admitted to the hospital; he suffered a heart attack at 5:00  pm the next day and lapsed into a coma, unexpectedly waking the following day at 2:00  pm. After he was discharged from the hospital, Lewis returned to the Kilns, though he was too ill to return to work. As a result, he resigned from his post at Cambridge in August.     Lewiss condition continued to decline, and he was diagnosed with end-stage ": null
    },
    {
        "renal failure": "Chronic Renal Failure"
    },
    {
        " in mid-November. He collapsed in his bedroom at 5:30  pm on 22 November, exactly one week before his 65th birthday, and died a few minutes later.  He is buried in the churchyard of ": null
    },
    {
        "Holy Trinity Church": "Holy Trinity Church, Headington Quarry"
    },
    {
        ", ": null
    },
    {
        "Headington, Oxford": "Headington"
    },
    {
        ". His brother ": null
    },
    {
        "Warren": "Warren Lewis"
    },
    {
        " died on 9 April 1973 and was buried in the same grave.      Media coverage of Lewiss death was almost completely overshadowed by news of the ": null
    },
    {
        "assassination of US President John F. Kennedy": "Assassination Of John F. Kennedy"
    },
    {
        ", which occurred on the same day , as did the death of English writer ": null
    },
    {
        "Aldous Huxley": "Aldous Huxley"
    },
    {
        ", author of  Brave New World .  This coincidence was the inspiration for ": null
    },
    {
        "Peter Kreefts": "Peter Kreeft"
    },
    {
        "book  Between Heaven and Hell: A Dialog Somewhere Beyond Death with John F. Kennedy, C. S. Lewis, & Aldous Huxley . Lewis is commemorated on 22 November in the ": null
    },
    {
        "church calendar": "Calendar Of Saints"
    },
    {
        " of the ": null
    },
    {
        "Episcopal Church": "Episcopal Church"
    },
    {
        ".               Lewis began his academic career as an undergraduate student at ": null
    },
    {
        "Oxford University": "Oxford University"
    },
    {
        ", where he won a triple first, the highest honours in three areas of study.  He was then elected a Fellow of ": null
    },
    {
        "Magdalen College, Oxford": "Magdalen College, Oxford"
    },
    {
        ", where he worked for nearly thirty years, from 1925 to 1954.  In 1954, he was awarded the newly founded ": null
    },
    {
        "chair of Mediaeval and Renaissance Literature": "Professor Of Medieval And Renaissance English"
    },
    {
        " at ": null
    },
    {
        "Cambridge University": "Cambridge University"
    },
    {
        ", and was elected a fellow of ": null
    },
    {
        "Magdalene College": "Magdalene College, Cambridge"
    },
    {
        ". Concerning his appointed academic field, he argued that there was no such thing as an ": null
    },
    {
        "English Renaissance": "English Renaissance"
    },
    {
        ".  Much of his scholarly work concentrated on the ": null
    },
    {
        "later Middle Ages": "Late Middle Ages"
    },
    {
        ", especially its use of allegory. His  The Allegory of Love  helped reinvigorate the serious study of late medieval narratives such as the  Roman de la Rose .      Lewis was commissioned to write the volume English Literature in the Sixteenth Century  for the Oxford History of English Literature,   His book A Preface to Paradise Lost  is still cited as a criticism of that work. His last ": null
    },
    {
        "academic work": "Academia"
    },
    {
        ",  The Discarded Image : An Introduction to Medieval and Renaissance Literature , is a summary of the medieval world view, a reference to the discarded image of the cosmos.         Lewis was a prolific writer, and his circle of literary friends became an informal discussion society known as the ": null
    },
    {
        "Inklings": "Inklings"
    },
    {
        " , including ": null
    },
    {
        "J. R. R. Tolkien": "J. R. R. Tolkien"
    },
    {
        ", ": null
    },
    {
        "Nevill Coghill": "Nevill Coghill"
    },
    {
        ", ": null
    },
    {
        "Lord David Cecil": "Lord David Cecil"
    },
    {
        ", ": null
    },
    {
        "Charles Williams": "Charles Williams"
    },
    {
        ", ": null
    },
    {
        "Owen Barfield": "Owen Barfield"
    },
    {
        ", and his brother ": null
    },
    {
        "Warren Lewis": "Warren Lewis"
    },
    {
        ". Glyer points to December 1929 as the Inklings beginning date. Lewiss friendship with Coghill and Tolkien grew during their time as members of the Kolbítar, an Old Norse reading group that Tolkien founded and which ended around the time of the inception of the Inklings. At Oxford, he was the tutor of poet ": null
    },
    {
        "John Betjeman": "John Betjeman"
    },
    {
        ", critic ": null
    },
    {
        "Kenneth Tynan": "Kenneth Tynan"
    },
    {
        ", mystic ": null
    },
    {
        "Bede Griffiths": "Bede Griffiths"
    },
    {
        ", novelist ": null
    },
    {
        "Roger Lancelyn Green": "Roger Lancelyn Green"
    },
    {
        " and Sufi scholar ": null
    },
    {
        "Martin Lings": "Martin Lings"
    },
    {
        ", among many other undergraduates. Curiously, the religious and conservative Betjeman detested Lewis, whereas the ": null
    },
    {
        "anti-establishment": "Anti-Establishment"
    },
    {
        " Tynan retained a lifelong admiration for him.          Of Tolkien, Lewis writes in  Surprised by Joy :               In addition to his scholarly work, Lewis wrote several popular novels, including the science fiction  Space Trilogy  for adults and the ": null
    },
    {
        "Narnia": "Narnia"
    },
    {
        " fantasies for children. Most deal implicitly with Christian themes such as sin, humanitys ": null
    },
    {
        "fall from grace": "Fall Of Man"
    },
    {
        ", and redemption.     His first novel after becoming a Christian was  The Pilgrims Regress  , which depicted his experience with Christianity in the style of ": null
    },
    {
        "John Bunyans": "John Bunyan"
    },
    {
        "  The Pilgrims Progress . The book was poorly received by critics at the time, although David ": null
    },
    {
        "Martyn Lloyd-Jones": "Martyn Lloyd-Jones"
    },
    {
        ", one of Lewiss contemporaries at Oxford, gave him much-valued encouragement. Asked by Lloyd-Jones when he would write another book, Lewis replied, When I understand the meaning of prayer.      The  Space Trilogy   dealt with what Lewis saw as the dehumanising trends in contemporary science fiction. The first book,  Out of the Silent Planet , was apparently written following a conversation with his friend J.R.R. Tolkien about these trends. Lewis agreed to write a space travel story and Tolkien a time travel one, but Tolkien never completed ": null
    },
    {
        "The Lost Road": "The Lost Road And Other Writings"
    },
    {
        " , linking his ": null
    },
    {
        "Middle-earth": "Middle-Earth"
    },
    {
        " to the modern world. Lewiss main character ": null
    },
    {
        "Elwin Ransom": "Elwin Ransom"
    },
    {
        " is based in part on Tolkien, a fact to which Tolkien alludes in his letters.     The second novel,  Perelandra , depicts a new ": null
    },
    {
        "Garden of Eden": "Garden Of Eden"
    },
    {
        " on the planet Venus, a new ": null
    },
    {
        "Adam and Eve": "Adam And Eve"
    },
    {
        ", and a new serpent figure to tempt Eve. The story can be seen as an account of what might have happened if the terrestrial Adam had defeated the serpent and avoided the ": null
    },
    {
        "Fall of Man": "Fall Of Man"
    },
    {
        ", with Ransom intervening in the novel to ransom the new Adam and Eve from the deceptions of the enemy. The third novel,  That Hideous Strength , develops the theme of nihilistic science threatening traditional human values, embodied in Arthurian legend.     Many ideas in the trilogy, particularly opposition to dehumanization as portrayed in the third book, are presented more formally in  The Abolition of Man , based on a series of lectures by Lewis at ": null
    },
    {
        "Durham University": "Durham University"
    },
    {
        " in 1943. Lewis stayed in Durham, where he says he was overwhelmed by the magnificence of ": null
    },
    {
        "the cathedral": "Durham Cathedral"
    },
    {
        ". That Hideous Strength is in fact set in the environs of Edgestow university, a small English university like Durham, though Lewis disclaims any other resemblance between the two.     ": null
    },
    {
        "Walter Hooper": "Walter Hooper"
    },
    {
        ", Lewiss literary executor, discovered a fragment of another science-fiction novel apparently written by Lewis called  The Dark Tower . Ransom appears in the story but it is not clear whether the book was intended as part of the same series of novels. The manuscript was eventually published in 1977, though Lewis scholar ": null
    },
    {
        "Kathryn Lindskoog": "Kathryn Lindskoog"
    },
    {
        " doubts its authenticity.            The Chronicles of Narnia  is a series of seven fantasy novels for children and is considered a classic of childrens literature. Written between 1949 and 1954 and illustrated by ": null
    },
    {
        "Pauline Baynes": "Pauline Baynes"
    },
    {
        ", the series is Lewiss most popular work, having sold over 100 million copies in 41 languages  .             Lewis wrote several works on ": null
    },
    {
        "Heaven": "Heaven"
    },
    {
        " and ": null
    },
    {
        "Hell": "Hell"
    },
    {
        ". One of these,  The Great Divorce , is a short novella in which a few residents of Hell take a bus ride to Heaven, where they are met by people who dwell there. The proposition is that they can stay if they choose, in which case they can call the place where they had come from ": null
    },
    {
        "Purgatory": "Purgatory"
    },
    {
        " , instead of Hell , but many find it not to their taste. The title is a reference to ": null
    },
    {
        "William Blakes": "William Blake"
    },
    {
        "  The Marriage of Heaven and Hell , a concept that Lewis found a disastrous error . This work deliberately echoes two other more famous works with a similar theme: the  Divine Comedy  of ": null
    },
    {
        "Dante Alighieri": "Dante Alighieri"
    },
    {
        ", and Bunyans  The Pilgrims Progress .     Another short work,  The Screwtape Letters , consists of letters of advice from senior ": null
    },
    {
        "demon": "Demon"
    },
    {
        " Screwtape to his nephew Wormwood on the best ways to tempt a particular human and secure his ": null
    },
    {
        "damnation": "Damnationreligious"
    },
    {
        ".  Lewiss last novel was  Till We Have Faces , which he thought of as his most mature and masterly work of fiction but which was never a popular success. It is a retelling of the myth of ": null
    },
    {
        "Cupid and Psyche": "Cupid And Psyche"
    },
    {
        " from the unusual perspective of Psyches sister. It is deeply concerned with religious ideas, but the setting is entirely ": null
    },
    {
        "pagan": "Paganism"
    },
    {
        ", and the connections with specific Christian beliefs are left implicit.      Before Lewiss conversion to Christianity, he published two books:  Spirits in Bondage , a collection of poems, and  Dymer , a single ": null
    },
    {
        "narrative poem": "Narrative Poetry"
    },
    {
        ". Both were published under the pen name Clive Hamilton. Other narrative poems have since been published posthumously, including Launcelot, The Nameless Isle, and  The Queen of Drum .      He also wrote  The Four Loves , which rhetorically explains four categories of love: ": null
    },
    {
        "friendship": "Philia"
    },
    {
        ", ": null
    },
    {
        "eros": "Eros"
    },
    {
        ", ": null
    },
    {
        "affection": "Storge"
    },
    {
        ", and ": null
    },
    {
        "charity": "Agape"
    },
    {
        ".      In 2009, a partial draft was discovered of  Language and Human Nature , which Lewis had begun co-writing with J. R. R. Tolkien, but which was never completed.        Lewis is also regarded by many as one of the most influential ": null
    },
    {
        "Christian apologists": "Christian Apologetics"
    },
    {
        " of his time, in addition to his career as an English professor and an author of fiction.  Mere Christianity  was voted best book of the 20th century by  Christianity Today  in 2000.  He has been called The Apostle to the Skeptics due to his approach to religious belief as a sceptic, and his following conversion.      Lewis was very interested in presenting an ": null
    },
    {
        "argument from reason": "Argument From Reason"
    },
    {
        " against ": null
    },
    {
        "metaphysical naturalism": "Metaphysical Naturalism"
    },
    {
        " and for the ": null
    },
    {
        "existence of God": "Existence Of God"
    },
    {
        ". Mere Christianity,  The Problem of Pain , and  Miracles  were all concerned, to one degree or another, with refuting popular objections to Christianity, such as the question, How could a good God allow pain to exist in the world? He also became a popular lecturer and broadcaster, and some of his writing originated as scripts for radio talks or lectures .     According to George Sayer, losing a 1948 debate with ": null
    },
    {
        "Elizabeth Anscombe": "G. E. M. Anscombe"
    },
    {
        ", also a Christian, led Lewis to re-evaluate his role as an apologist, and his future works concentrated on devotional literature and childrens books.  Anscombe had a completely different recollection of the debates outcome and its emotional effect on Lewis. Victor Reppert also disputes Sayer, listing some of Lewiss post-1948 apologetic publications, including the second and revised edition of his Miracles in 1960, in which Lewis addressed Anscombes criticism.   Noteworthy too is Roger Teichmans suggestion in The Philosophy of Elizabeth Anscombe that the intellectual impact of Anscombes paper on Lewiss philosophical self-confidence should not be over-rated: ...  it seems unlikely that he felt as irretrievably crushed as some of his acquaintances have made out; the episode is probably an inflated legend, in the same category as the affair of ": null
    },
    {
        "Wittgensteins Poker": "Wittgensteins Poker"
    },
    {
        ". Certainly, Anscombe herself believed that Lewiss argument, though flawed, was getting at something very important; she thought that this came out more in the improved version of it that Lewis presented in a subsequent edition of Miracles  – though that version also had much to criticize in it.           His most famous works, the Chronicles of Narnia, contain many strong Christian messages and are often considered ": null
    },
    {
        "allegory": "Allegory"
    },
    {
        ". Lewis, an expert on the subject of allegory, maintained that the books were not allegory, and preferred to call the Christian aspects of them ": null
    },
    {
        "supposition": "Supposition"
    },
    {
        "al . As Lewis wrote in a letter to a Mrs. Hook in December 1958:             In a much-cited passage from Mere Christianity, Lewis challenged the view that Jesus was a great moral teacher but not God. He argued that Jesus made several implicit claims to divinity, which would logically exclude that claim:          Although this argument is sometimes called Lewiss trilemma , Lewis did not invent it but rather developed and popularized it. It has also been used by Christian apologist ": null
    },
    {
        "Josh McDowell": "Josh Mcdowell"
    },
    {
        " in his book More Than a Carpenter.  It has been widely repeated in Christian apologetic literature, but largely ignored by professional theologians and biblical scholars.      Lewiss Christian apologetics, and this argument in particular, have been criticised. Philosopher John Beversluis described Lewiss arguments as textually careless and theologically unreliable ,  and this particular argument as logically unsound and an example of ": null
    },
    {
        "false dilemma": "False Dilemma"
    },
    {
        ".  Theologian ": null
    },
    {
        "John Hick": "John Hick"
    },
    {
        " argues that New Testament scholars do not now support the view that Jesus claimed to be God.  New Testament scholar ": null
    },
    {
        "N. T. Wright": "N. T. Wright"
    },
    {
        " criticises Lewis for failing to recognise the significance of Jesus Jewish identity and setting  – an oversight which at best, drastically short-circuits the argument and which lays Lewis open to criticism that his argument doesnt work as history, and it backfires dangerously when historical critics question his reading of the gospels , although he believes this doesnt undermine the eventual claim .      Lewis used a similar argument in  The Lion, the Witch and the Wardrobe , when ": null
    },
    {
        "the old Professor": "Digory Kirke"
    },
    {
        " advises the young heroes that their sisters claims of a magical world must logically be taken as either lies, madness, or truth.        One of the main theses in Lewiss apologia is that there is a common morality known throughout humanity, which he calls ": null
    },
    {
        "natural law": "Natural Law"
    },
    {
        " . In the first five chapters of Mere Christianity, Lewis discusses the idea that people have a standard of behaviour to which they expect people to adhere. Lewis claims that people all over the earth know what this law is and when they break it. He goes on to claim that there must be someone or something behind such a universal set of principles.      Lewis also portrays Universal Morality in his works of fiction. In The Chronicles of Narnia he describes Universal Morality as the deep magic which everyone knew.     In the second chapter of Mere Christianity, Lewis recognises that many people find it difficult to understand what this Law of Human Nature  ... is. And he responds first to the idea that the Moral Law is simply our herd instinct and second to the idea that the Moral Law is simply a social convention . In responding to the second idea Lewis notes that people often complain that one set of moral ideas is better than another, but that this actually argues for there existing some Real Morality to which they are comparing other moralities. Finally, he notes that sometimes differences in moral codes are exaggerated by people who confuse differences in beliefs about morality with differences in beliefs about facts:          Lewis also had fairly progressive views on the topic of animal morality , in particular the suffering of animals, as is evidenced by several of his essays: most notably, On Vivisection  and On the Pains of Animals .              Lewis continues to attract a wide readership. In 2008,  The Times  ranked him eleventh on their list of the 50 greatest British writers since 1945 .  Readers of his fiction are often unaware of what Lewis considered the Christian themes of his works. His Christian apologetics are read and quoted by members of many ": null
    },
    {
        "Christian denomination": "Christian Denomination"
    },
    {
        "s. In 2013, on the 50th anniversary of his death, Lewis joined some of Britains greatest writers recognised at ": null
    },
    {
        "Poets Corner": "Poets Corner"
    },
    {
        ", ": null
    },
    {
        "Westminster Abbey": "Westminster Abbey"
    },
    {
        ".  The dedication service, at noon on 22 November 2013, included a reading from  The Last Battle  by ": null
    },
    {
        "Douglas Gresham": "Douglas Gresham"
    },
    {
        ", younger stepson of Lewis. Flowers were laid by ": null
    },
    {
        "Walter Hooper": "Walter Hooper"
    },
    {
        ", trustee and literary advisor to the Lewis Estate. An address was delivered by former Archbishop of Canterbury ": null
    },
    {
        "Rowan Williams": "Rowan Williams"
    },
    {
        ".   The floor stone inscription is a quotation from an address by Lewis:                Many books have been inspired by Lewis, including  A Severe Mercy  by his correspondent and friend ": null
    },
    {
        "Sheldon Vanauken": "Sheldon Vanauken"
    },
    {
        ". The Chronicles of Narnia has been particularly influential. Modern childrens literature has been more or less influenced by Lewiss series, such as ": null
    },
    {
        "Daniel Handlers": "Daniel Handler"
    },
    {
        "  A Series of Unfortunate Events , ": null
    },
    {
        "Eoin Colfers": "Eoin Colfer"
    },
    {
        "  Artemis Fowl , ": null
    },
    {
        "Philip Pullmans": "Philip Pullman"
    },
    {
        "  His Dark Materials , and ": null
    },
    {
        "J. K. Rowlings": "J. K. Rowling"
    },
    {
        "  Harry Potter . Pullman is an ": null
    },
    {
        "atheist": "Atheism"
    },
    {
        " and so fierce a critic of Lewiss work as to be dubbed the anti-Lewis .  He considers C. S. Lewis a negative influence and has accused Lewis of featuring religious propaganda, misogyny, racism, and emotional sadism in his books. Authors of adult fantasy literature such as ": null
    },
    {
        "Tim Powers": "Tim Powers"
    },
    {
        " have also testified to being influenced by Lewiss work.     In A Sword Between the Sexes? C. S. Lewis and the Gender Debates, Mary Stewart Van Leeuwen finds in Lewiss work a hierarchical and essentialist view of class and gender corresponding to an upbringing during ": null
    },
    {
        "the Edwardian era": "The Edwardian Era"
    },
    {
        ".      Most of Lewiss posthumous work has been edited by his literary executor ": null
    },
    {
        "Walter Hooper": "Walter Hooper"
    },
    {
        ". ": null
    },
    {
        "Kathryn Lindskoog": "Kathryn Lindskoog"
    },
    {
        ", an independent Lewis scholar, argued that Hoopers scholarship is not reliable and that he has made false statements and attributed forged works to Lewis. C. S. Lewiss stepson ": null
    },
    {
        "Douglas Gresham": "Douglas Gresham"
    },
    {
        " denies the forgery claims, saying, The whole controversy thing was engineered for very personal reasons  ... Her fanciful theories have been pretty thoroughly discredited.      A bronze statue of Lewiss character Digory from The Magicians Nephew stands in Belfasts ": null
    },
    {
        "Holywood": "Holywood"
    },
    {
        " Arches in front of the Holywood Road Library.     Several C. S. Lewis Societies exist around the world, including one which was founded in Oxford in 1982 to discuss papers on the life and works of Lewis and the other Inklings, and generally appreciate all things Lewisian.       Film adaptations have been made of three of The Chronicles of Narnia: The Lion, the Witch, and the Wardrobe  ,  Prince Caspian  and  The Voyage of the Dawn Treader  .     Lewis is featured as a main character in  The Chronicles of the Imaginarium Geographica  series by ": null
    },
    {
        "James A. Owen": "James A. Owen"
    },
    {
        ".                    C. S. Lewis and the Search for Rational Religion. Grand Rapids: Eerdmans  The Backward Glance: C. S. Lewis and Ireland. Belfast: Institute of Irish Studies at ": null
    },
    {
        "Queens University of Belfast": "Queens University Of Belfast"
    },
    {
        ".   Devin Brown , A Life Observed: A Spiritual Biography of C. S. Lewis. Grand Rapids: Brazos Press  ": null
    },
    {
        "Joan K. Ostling": "Joan K. Ostling"
    },
    {
        " , C. S. Lewis: An Annotated Checklist of Writings About Him and His Works. Kent, Ohio: Kent State University Press, n.d.  ": null
    },
    {
        "James Como": "James Como"
    },
    {
        " , Branches to Heaven: The Geniuses of C. S. Lewis. Spence   James Como , Remembering C. S. Lewis . Ignatius Press   Sean Connolly , Inklings of Heaven: C. S. Lewis and Eschatology. Gracewing.  The Man Who Created Narnia: The Story of C. S. Lewis. Grand Rapids: Eerdmans, reprint edition 1996 .  ": null
    },
    {
        "Christopher Derrick": "Christopher Derrick"
    },
    {
        " C. S. Lewis and the Church of Rome: A Study in Proto-Ecumenism. Ignatius Press.  Planets in Peril: A Critical Study of C. S. Lewiss Ransom Trilogy. Amherst: ": null
    },
    {
        "University of Massachusetts Press": "University Of Massachusetts Press"
    },
    {
        ".  The Most Reluctant Convert: C. S. Lewiss Journey to Faith. InterVarsity.  Into the Region of Awe: Mysticism in C. S. Lewis. InterVarsity.  Into the Wardrobe: C. S. Lewis and the Narnia Chronicles. San Francisco: Jossey-Bass.  ": null
    },
    {
        "Colin Duriez": "Colin Duriez"
    },
    {
        " , Tolkien and C. S. Lewis: The Gift of Friendship. Paulist Press  Bedeviled: Lewis, Tolkien and the Shadow of Evil. InterVarsity Press  The Inklings Handbook: The Lives, Thought and Writings of C. S. Lewis, J. R. R. Tolkien, Charles Williams, Owen Barfield, and Their Friends. London: Azure.  ": null
    },
    {
        "Bruce L. Edwards": "Bruce L. Edwards"
    },
    {
        " , Not a Tame Lion: The Spiritual World of Narnia. Tyndale.  Further Up and Further In: Understanding C. S. Lewiss The Lion, the Witch, and the Wardrobe. Broadman and Holman.   ": null
    },
    {
        "Alastair Fowler": "Alastair Fowler"
    },
    {
        ", , Yale Review; Vol. 91, No. 4 .   ": null
    },
    {
        "Helen Gardner": "Helen Gardner"
    },
    {
        " . Biographical memoir, in Proceedings of the British Academy 51 , 417–28.   Jocelyn Gibb , Light on C. S. Lewis. Geoffrey Bles, 1965, & Harcourt Brace Jovanovich, 1976.  ": null
    },
    {
        "Clyde Kilby": "Clyde Kilby"
    },
    {
        " C. S. Lewis: Images of His World. Eerdmans, 1973 & 2005.  .    ": null
    },
    {
        "Douglas Gresham": "Douglas Gresham"
    },
    {
        " , Lenten Lands: My Childhood with Joy Davidman and C. S. Lewis. HarperSanFrancisco.  Jacks Life: A Memory of C. S. Lewis. Broadman & Holman Publishers.  C. S. Lewis: The Authentic Voice . Lion.  Through the Open Door: A New Look at C. S. Lewis. University of Alabama Press.  ": null
    },
    {
        "Joel D. Heck": "Joel D. Heck"
    },
    {
        " , Irrigating Deserts: C. S. Lewis on Education. Concordia Publishing House.  C. S. Lewis: Speaker & Teacher. Zondervan.  The Everything Guide to C. S. Lewis and Narnia. Adams Media.  C. S. Lewis Themes and Threads. Amazon Kindle ASIN B00ATSY3AQ   ": null
    },
    {
        "Clyde S. Kilby": "Clyde S. Kilby"
    },
    {
        " , The Christian World of C. S. Lewis. Grand Rapids: Eerdmans, 1964, 1995.  C. S. Lewis, Poet: The Legacy of His Poetic Impulse. Kent, Ohio: Kent State University Press.  Light in the Shadowlands: Protecting the Real C. S. Lewis. Multnomah Pub.  C. S. Lewis: A Reference Guide, 1972–1988. Hall & Co.  The Quotable Lewis. Tyndale House Publishers.  Reading the Classics with C. S. Lewis. Baker Academic.  ": null
    },
    {
        "Laura Miller": "Laura Miller"
    },
    {
        " The Magicians Book , Little, Brown & Co.  ": null
    },
    {
        "David Mills": "David Mills"
    },
    {
        " The Pilgrims Guide: C. S. Lewis and the Art of Witness. Grand Rapids: Eerdmans.  ": null
    },
    {
        "Joseph Pearce": "Joseph Pearce"
    },
    {
        " , C. S. Lewis and the Catholic Church. HarperCollins, 1999; then Ignatius Press, 2003.  Simply C. S. Lewis: A Beginners Guide to His Life and Works. Kingsway Publications.  C. S. Lewis at the BBC: Messages of Hope in the Darkness of War. Marshall Pickering.  C. S. Lewis Remembered: Collected Reflections of Students, Friends & Colleagues. Zondervan.  C. S. Lewiss Dangerous Idea: In Defense of the Argument from Reason. InterVarsity Press.  ": null
    },
    {
        "George Sayer": "George Sayer"
    },
    {
        " , Jack: C. S. Lewis and His Times. London: Macmillan.  http://hope.edu/academic/english/schakel/tillwehavefaces/ Reason and Imagination in C. S. Lewis: A Study of Till We Have Faces . Grand Rapids: Eerdmans.  Imagination and the Arts in C. S. Lewis: Journeying to Narnia and Other Worlds. University of Missouri Press.  The Longing for a Form: Essays on the Fiction of C. S. Lewis. Kent, Ohio: Kent State University Press.  Word and Story in C. S. Lewis. University of Missouri Press.  In Search of C. S. Lewis. Bridge Logos Pub.  The C. S. Lewis Readers Encyclopedia. Zondervan Publishing House.  C. S. Lewis on the Final Frontier: Science and the Supernatural in the Space Trilogy. Oxford University Press. .   G. B. Tennyson , Owen Barfield on C. S. Lewis. Wesleyan University Press  C. S. Lewis and Narnia for Dummies. For Dummies.  Rumours of Heaven: Essays in Celebration of C. S. Lewis, Guildford: Eagle.  C. S. Lewis: Apostle to the Skeptics. London: Macmillan   Chad Walsh , The Literary Legacy of C. S. Lewis. New York: Harcourt Brace Jovanovich.  ": null
    },
    {
        "Michael Ward": "Michael Ward"
    },
    {
        " , Planet Narnia. Oxford University Press.  Critical Essays on C. S. Lewis. Menston: Scolar Press.  ": null
    },
    {
        "Michael White": "Michael White"
    },
    {
        " , C. S. Lewis: The Boy Who Chronicled Narnia. Abacus.  God and the Reach of Reason. Cambridge University Press.  .   .   ": null
    }
]