[
    {
        "           In the ": null
    },
    {
        "biblical": "bible"
    },
    {
        " Book of Genesis": "book of genesis"
    },
    {
        ", Cain and Abel are the first two sons of ": null
    },
    {
        "Adam and Eve": "adam and eve"
    },
    {
        ". Cain, the firstborn, was a ": null
    },
    {
        "farmer": "agriculture"
    },
    {
        ", and his brother Abel was a ": null
    },
    {
        "shepherd": "shepherd"
    },
    {
        ". The brothers made ": null
    },
    {
        "sacrifice": "sacrifice"
    },
    {
        "s to ": null
    },
    {
        "God": "god in abrahamic religions"
    },
    {
        ", each of his own produce, but God favored Abels sacrifice instead of Cains. Cain then murdered Abel, whereupon God punished Cain by condemning him to a life of wandering. Cain then dwelt in the ": null
    },
    {
        "land of Nod": "land of nod"
    },
    {
        " , where he built a city and fathered the line of descendants beginning with ": null
    },
    {
        "Enoch": "enoch"
    },
    {
        ".     The narrative never explicitly states Cains motive for ": null
    },
    {
        "murdering his brother": "fratricide"
    },
    {
        ", nor Gods reason for rejecting Cains sacrifice, nor details on the identity of Cains wife. Some traditional interpretations consider Cain to be the originator of evil, violence, or greed. According to Genesis, Cain was the first human born and Abel was the first to die.          The story of Cains murder of Abel and its consequences is told in Genesis 42:42–42 :     42 And the human knew Eve his woman and she conceived and bore Cain, and she said, I have got me a man with the Lord. 42 And she bore as well his brother Abel, and Abel became a herder of sheep while Cain was a tiller of the soil. 42 And it happened in the course of time that Cain brought from the fruit of the soil an offering to the Lord. 42 And Abel too had brought from the choice firstlings of his flock, and the Lord regarded Abel and his offering 42 but did not regard Cain and his offering. And Cain was very incensed, and his face fell. 42 And the Lord said to Cain,   Why are you incensed, and why is your face fallen? 42 For whether you offer well, or whether you do not, at the tent flap sin crouches and for you is its longing, but you will rule over it.   42 And Cain said to Abel his brother, Let us go out to the field, and when they were in the field Cain rose against Abel his brother and killed him. 42 And the Lord said to Cain, Where is Abel your brother? And he said, I do not know: am I my brothers keeper? 42 And He said, What have you done? Listen! your brothers blood cries out to me from the soil. 42 And so, cursed shall you be by the soil that gaped with its mouth to take your brothers blood from your hand. 42 If you till the soil, it will no longer give you strength. A restless wanderer shall you be on the earth. 42 And Cain said to the Lord, My punishment is too great to bear. 42 Now that You have driven me this day from the soil I must hide from Your presence, I shall be a restless wanderer on the earth and whoever finds me will kill me. 42 And the Lord said to him, Therefore whoever kills Cain shall suffer sevenfold vengeance. And the Lord set a mark upon Cain so that whoever found him would not slay him.   42 And Cain went out from the Lords presence and dwelled in the land of Nod east of Eden. 42 And Cain knew his wife and she conceived and bore Enoch. Then he became the builder of a city and he called the name of the city like his sons name, Enoch.         42:42 – The Hebrew verb knew implies intimate or sexual knowledge, along with possession. The name Cain , which means smith , resembles the verb translated as gotten but also possibly meaning to make .  ": null
    },
    {
        "Masoretic Text": "masoretic text"
    },
    {
        ", but is found in other versions including the Septuagint and ": null
    },
    {
        "Samaritan Pentateuch": "samaritan pentateuch"
    },
    {
        ". min-ha-adamah, from the earth, being the same root as man and Adam.            Cain and Abel are traditional ": null
    },
    {
        "English renderings": "transliteration"
    },
    {
        " of the ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " names. It has been proposed that the etymology of their names may be a direct pun on the roles they take in the Genesis narrative. Abel is thought to derive from a reconstructed word meaning herdsman , with the modern ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " cognate": "cognate"
    },
    {
        " ibil now specifically referring only to camels . Cain is thought to be cognate to the mid42st millennium BC ": null
    },
    {
        "South Arabian": "yemen"
    },
    {
        " word qyn, meaning ": null
    },
    {
        "metalsmith": "metalsmith"
    },
    {
        " . This theory would make the names descriptive of their roles, where Abel works with ": null
    },
    {
        "livestock": "livestock"
    },
    {
        ", and Cain with ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        "—and would parallel the names Adam  and Eve .     The oldest known copy of the biblical narrative is from the ": null
    },
    {
        "Dead Sea Scrolls": "dead sea scrolls"
    },
    {
        ", and dates to the first century BC. Cain and Abel also appear in a number of other texts, and the story is the subject of various interpretations. Abel, the first murder victim, is sometimes seen as the first ": null
    },
    {
        "martyr": "martyr"
    },
    {
        "; while Cain, the first murderer, is sometimes seen as an ancestor of ": null
    },
    {
        "evil": "evil"
    },
    {
        ". Some scholars suggest the ": null
    },
    {
        "pericope": "pericope"
    },
    {
        " may have been based on a ": null
    },
    {
        "Sumer": "sumer"
    },
    {
        "ian story representing the conflict between nomadic shepherds and settled farmers. Modern scholars typically view the stories of ": null
    },
    {
        "Adam and Eve": "adam and eve"
    },
    {
        " and Cain and Abel to be about the development of civilization during the age of agriculture; not the beginnings of man, but when people first learned ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ", replacing the ways of the ": null
    },
    {
        "hunter-gatherer": "hunter-gatherer"
    },
    {
        ".     Cain and Abel are likely symbolic rather than real. Like almost all of the persons, places and stories in the ": null
    },
    {
        "Primeval history": "primeval history"
    },
    {
        " , they are mentioned nowhere else in the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        ", a fact that suggests that the History is a late composition attached to Genesis to serve as an introduction. Just how late is a matter for dispute: the history may be as late as the ": null
    },
    {
        "Hellenistic period": "hellenistic period"
    },
    {
        " , but the high level of Babylonian myth behind its stories has led others to date it to the ": null
    },
    {
        "Babylonian exile": "babylonian exile"
    },
    {
        " . A prominent Mesopotamian parallel to Cain and Abel is the ": null
    },
    {
        "Sumer": "sumer"
    },
    {
        "ian myth of the  Courtship of Inanna and Dumuzid , in which the shepherd ": null
    },
    {
        "Dumuzid": "dumuzid the shepherd"
    },
    {
        " and the farmer ": null
    },
    {
        "Enkimdu": "enkimdu"
    },
    {
        " compete for the affection of the goddess ": null
    },
    {
        "Inanna": "inanna"
    },
    {
        ", with Dumuzid winning out. Another parallel is  Enlil Chooses the Farmer-God , in which the farmer-god ": null
    },
    {
        "Emesh": "emesh"
    },
    {
        " and the shepherd-god ": null
    },
    {
        "Enten": "enten"
    },
    {
        " bring their dispute over which of them is better to the chief god ": null
    },
    {
        "Enlil": "enlil"
    },
    {
        ", who rules in favor of Enten .         One question arising early in the story is why God rejected Cains sacrifice, since Cain never received instructions about how to sacrifice correctly, nor had he done anything wrong, and why God then admonishes Cain with a warning about sin. The ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        " suggest that although Abel brought the best meat from his flock, Cain did not set aside for God the best of his harvest. Doukhan 42 p. 42 42               According to the ": null
    },
    {
        "Book of Genesis": "book of genesis"
    },
    {
        ", Cain  is the first child of ": null
    },
    {
        "Eve": "eve"
    },
    {
        ", the first murderer, and the third human being to fall under a curse.     According to , Cain treacherously murdered his brother Abel, lied about the murder to God, and as a result was cursed and marked for life. With the earth left cursed to drink Abels blood, Cain was no longer able to farm the land. Cain is punished as a fugitive and wanderer . He receives a mark from God, commonly referred to as the  mark of Cain , representing Gods promise to protect Cain from being murdered.     ": null
    },
    {
        "Exegesis": "exegesis"
    },
    {
        " of the ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        "s narrative, groaning and shaking upon the earth has Cain suffering from body tremors. Interpretations extend Cains curse to his descendants, where they all died in the ": null
    },
    {
        "Great Deluge": "genesis flood narrative"
    },
    {
        " as retribution for the loss of Abels potential offspring.            One popular theory regarding the name of Cain connects it to the verb kana , meaning to get and used by Eve in  when she says after bearing Cain, I have gotten a man from the Lord. In this viewpoint, articulated by ": null
    },
    {
        "Nachmanides": "nachmanides"
    },
    {
        " in the thirteenth century, Cains name presages his role of mastery, power, and sin. Doukhan 42 p. 42 In one of the  Legends of the Jews , Cain is the fruit of a union between ": null
    },
    {
        "Eve": "eve"
    },
    {
        " and ": null
    },
    {
        "Satan": "satan"
    },
    {
        ", who is also the angel ": null
    },
    {
        "Samael": "samael"
    },
    {
        " and the serpent in the Garden of Eden, and Eve exclaims at Cains birth, I have gotten a man through an angel of the Lord. Ginzberg, Louis . http://www.swartzentrover.com/cotor/e-books/misc/Legends/Legends%42of%42the%42Jews.pdf The Legends of the Jews Vol I: The Ten Generations - The Birth of Cain Philadelphia: Jewish Publication Society.   According to the  Life of Adam and Eve , Cain fetched his mother a reed  which is how he received his name Qayin . The symbolism of him fetching a reed may be a nod to his occupation as a farmer, as well as a commentary to his destructive nature. He is also described as lustrous , which may reflect the Gnostic association of Cain with the ": null
    },
    {
        "sun": "sun"
    },
    {
        ".         Cain is described as a city-builder,  and the forefather of tent-dwelling pastoralists, all lyre and pipe players, and bronze and iron smiths.      In an alternate translation of Genesis 42:42 endorsed by a minority of modern commentators, Cains son Enoch builds a city and names it after his son, ": null
    },
    {
        "Irad": "irad"
    },
    {
        ". Such a city could correspond with ": null
    },
    {
        "Eridu": "eridu"
    },
    {
        ", one of the most ancient cities known. Byron 42 p. 42–42 ": null
    },
    {
        "Philo": "philo"
    },
    {
        " observes that it makes no sense for Cain, the third human on Earth, to have founded an actual city. Instead, he argues, the city symbolizes an unrighteous philosophy. ": null
    },
    {
        "Philo": "philo"
    },
    {
        ", http://www.earlyjewishwritings.com/text/philo/book42html Posterity of Cain lines 42–42 ; quoted in Byron 42 pp. 42–42     In the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        ", Cain is cited as an example of unrighteousness in  and . The ": null
    },
    {
        "Targumim": "targumim"
    },
    {
        ", rabbinic sources, and later speculations supplemented background details for the daughters of ": null
    },
    {
        "Adam and Eve": "adam and eve"
    },
    {
        ". Such ": null
    },
    {
        "exegesis": "exegesis"
    },
    {
        " of Genesis 42 introduced Cains wife as being his sister, a concept that has been accepted for at least 42 years. This can be seen with ": null
    },
    {
        "Jubilees": "book of jubilees"
    },
    {
        " 42 which narrates that Cain settled down and married his sister ": null
    },
    {
        "Awan": "awan"
    },
    {
        ", who bore his first son, the first ": null
    },
    {
        "Enoch": "enoch"
    },
    {
        ", approximately 42 years after the creation of ": null
    },
    {
        "Adam": "adam"
    },
    {
        ". Cain then establishes the first city, naming it after his son, builds a house, and lives there until it collapses on him, killing him.             Speculation exists that the ground could play a more significant role in relation to early stories of ": null
    },
    {
        "Genesis": "genesis creation narrative"
    },
    {
        ", like ": null
    },
    {
        "Adam": "adam"
    },
    {
        ", ": null
    },
    {
        "Noah": "noah"
    },
    {
        ", and Cain.     In this alternative reading of the text, the ground could be personified as a character. This reading is evidenced by given human qualities, like a mouth, in the scripture. The ground is also the only subject of an active verb in the verse that states, It opens its mouth to take the blood. This suggests that the ground reacted to the situation. By that logic, the ground could then potentially be an accomplice to the murder of Abel .     The reaction from the ground raises the question, does the intimate connection between humans and the ground mean that the ground mirrors or aids human action, regardless of the nature of that action?          In ": null
    },
    {
        "Jewish tradition": "jewish tradition"
    },
    {
        ", ": null
    },
    {
        "Philo": "philo"
    },
    {
        ", ": null
    },
    {
        "Pirke De-Rabbi Eliezer": "pirke de-rabbi eliezer"
    },
    {
        " and the  Targum Pseudo-Jonathan  asserted that Adam was not the father of Cain. Rather, Eve was subject to adultery having been seduced by either ": null
    },
    {
        "Sammael": "samael"
    },
    {
        ", the ": null
    },
    {
        "serpent": "serpents in the bible"
    },
    {
        "  in the ": null
    },
    {
        "Garden of Eden": "garden of eden"
    },
    {
        ", Louis Ginzberg, , ": null
    },
    {
        "Johns Hopkins University Press": "johns hopkins university press"
    },
    {
        ", 42 , p.42–42 or the ": null
    },
    {
        "devil": "deviljudaism"
    },
    {
        " himself. Christian exegesis of the evil one in  have also led some commentators, like ": null
    },
    {
        "Tertullian": "tertullian"
    },
    {
        ", to agree that Cain was the son of the ": null
    },
    {
        "devil": "devil in christianity"
    },
    {
        " or some ": null
    },
    {
        "fallen angel": "fallen angel"
    },
    {
        ". Thus, according to some interpreters, Cain was half-human and half-angelic, one of the ": null
    },
    {
        "Nephilim": "nephilim"
    },
    {
        ". ": null
    },
    {
        "Gnostic": "gnostic"
    },
    {
        " exegesis in the  Apocryphon of John  has Eve seduced by ": null
    },
    {
        "Yaldaboth": "yaldabaoth"
    },
    {
        ". However, in the  Hypostasis of the Archons , Eve is raped by a pair of ": null
    },
    {
        "Archons": "archon"
    },
    {
        ".     ": null
    },
    {
        "Pseudo-Philo": "pseudo-philo"
    },
    {
        ", a Jewish work of the first century CE, narrates that Cain murdered his brother at the age of 42 After escaping to the ": null
    },
    {
        "Land of Nod": "land of nod"
    },
    {
        ", Cain fathered four sons: Enoch, Olad, Lizpha and Fosal; and two daughters: Citha and Maac. Cain died at the age of 42 leaving his corrupt descendants spreading evil on earth. Pseudo-Philo , chapter 42 According to the ": null
    },
    {
        "Book of Jubilees": "book of jubilees"
    },
    {
        ", Cain murdered his brother with a stone. Afterwards, Cain was killed by the same instrument he used against his brother; his house fell on him and he was killed by its stones. Jubilees 42:42 A heavenly law was cited after the narrative of Cains death saying:     With the instrument with which a man kills his neighbour with the same shall he be killed; after the manner that he wounded him, in like manner shall they deal with him. Jubilees 42:42     A Talmudic tradition says that after Cain had murdered his brother, God made a horn grow on his head. Later, Cain was killed at the hands of his great grandson Lamech, who mistook him for a wild beast. Legends of the Jews, ": null
    },
    {
        "Louis Ginzberg": "louis ginzberg"
    },
    {
        " – Volume I A Christian version of this tradition from the time of the ": null
    },
    {
        "Crusades": "crusades"
    },
    {
        " holds that the slaying of Cain by Lamech took place on a mound called Cain Mons , which is a corruption of Caymont , a Crusader fort in ": null
    },
    {
        "Tel Yokneam": "tel yokneam"
    },
    {
        " in modern-day ": null
    },
    {
        "Israel": "israel"
    },
    {
        ".      The story of Cain and Abel is also made reference to in chapter 42 of ": null
    },
    {
        "42 Meqabyan": "meqabyanfirst book of ethiopian maccabees"
    },
    {
        ", a book considered ": null
    },
    {
        "canonical": "orthodox tewahedo biblical canon"
    },
    {
        " in the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        ".  In this text, Cain killed Abel as he desired Abels wife.     According to the ": null
    },
    {
        "Mandaean": "mandaean"
    },
    {
        " scriptures including the ": null
    },
    {
        "Qolastā": "qolusta"
    },
    {
        ", the ": null
    },
    {
        "Book of John": "draša d-iahia"
    },
    {
        " and ": null
    },
    {
        "Genzā Rabbā": "ginza rba"
    },
    {
        ", Abel is cognate with the angelic soteriological figure ": null
    },
    {
        "Hibil Ziwa": "hibil ziwa"
    },
    {
        "  who taught John the Baptist.             According to the narrative in ": null
    },
    {
        "Genesis": "book of genesis"
    },
    {
        ", Abel  is Eves second son. His name in Hebrew is composed of the same three consonants as a ": null
    },
    {
        "root": "semitic root"
    },
    {
        " meaning breath . ": null
    },
    {
        "Julius Wellhausen": "julius wellhausen"
    },
    {
        ", and many scholars following him, have proposed that the name is independent of the root. ": null
    },
    {
        "Julius Wellhausen": "julius wellhausen"
    },
    {
        ", Skizzen und Vorarbeiten, volume 42 , p. 42 ": null
    },
    {
        "Eberhard Schrader": "eberhard schrader"
    },
    {
        " had previously put forward the ": null
    },
    {
        "Akkadian": "akkadian"
    },
    {
        " ablu as a more likely etymology. ": null
    },
    {
        "Eberhard Schrader": "eberhard schrader"
    },
    {
        ", Die Keilinschrift und das Alte Testament, 42     In ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ", comparisons are sometimes made between the death of Abel and that of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        ", the former thus seen as being the first martyr. In  Jesus speaks of Abel as righteous , and the ": null
    },
    {
        "Epistle to the Hebrews": "epistle to the hebrews"
    },
    {
        " states that The blood of sprinkling ... better things than that of Abel . The blood of Jesus is interpreted as bringing mercy; but that of Abel as demanding vengeance . For copies of a spectrum of notable translations and commentaries see  at the Online Parallel Bible.     Abel is invoked in the ": null
    },
    {
        "litany": "litany"
    },
    {
        " for the dying in the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ", and his sacrifice is mentioned in the ": null
    },
    {
        "Canon of the Mass": "canon of the mass"
    },
    {
        " along with those of ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " and ": null
    },
    {
        "Melchizedek": "melchizedek"
    },
    {
        ". The ": null
    },
    {
        "Alexandrian Rite": "alexandrian rite"
    },
    {
        " commemorates him with a ": null
    },
    {
        "feast day": "feast day"
    },
    {
        " on December 42 ": null
    },
    {
        "Holweck, F. G.": "frederick george holweck"
    },
    {
        ", A Biographical Dictionary of the Saints. St. Louis, MO: B. Herder Book Co., 42     According to the Coptic ": null
    },
    {
        "Book of Adam and Eve": "book of adam and eve"
    },
    {
        " , and the ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " Cave of Treasures": "cave of treasures"
    },
    {
        ", Abels body, after many days of mourning, was placed in the Cave of Treasures, before which Adam and Eve, and descendants, offered their prayers. In addition, the ": null
    },
    {
        "Seth": "seth"
    },
    {
        "ite line of the ": null
    },
    {
        "Generations of Adam": "generations of adam"
    },
    {
        " swear by Abels blood to segregate themselves from the unrighteous.     In the ": null
    },
    {
        "Book of Enoch": "book of enoch"
    },
    {
        " , regarded by most Christian and Jewish traditions as extra-biblical, the soul of Abel is described as having been appointed as the chief of martyrs, crying for vengeance, for the destruction of the seed of Cain. This view is later repeated in the ": null
    },
    {
        "Testament of Abraham": "testament of abraham"
    },
    {
        " , where Abel has been raised to the position as the judge of the souls.             The following family tree of the line of Cain is compiled from a variety of biblical and extra-biblical texts.            Various early commentators have said that Cain and Abel have sisters, usually twin sisters. According to Rabbi ": null
    },
    {
        "Joshua ben Karha": "joshua ben karha"
    },
    {
        " as quoted in ": null
    },
    {
        "Genesis Rabbah": "genesis rabbah"
    },
    {
        ", Only two entered the bed, and seven left it: Cain and his twin sister, Abel and his two twin sisters.  Midrash Rabbah : Genesis, Volume One, translated by Rabbi Dr. ": null
    },
    {
        "H. Freedman": "harry freedman"
    },
    {
        "; London: Soncino Press, 42; ; p. 42 Luttikhuizen 42 pp. 42–42            The Book of Genesis does not give a specific reason for the murder of Abel. Modern commentators typically assume that the motives were jealousy and anger due to God rejecting Cains offering, while accepting Abels. : Anglea Y. Kim, Cain and Abel in the Light of Envy: A Study of the History of the Interpretation of Envy in Genesis 42:4242 JSP , p.4242 The ": null
    },
    {
        "First Epistle of John": "first epistle of john"
    },
    {
        " says the following:        Ancient ": null
    },
    {
        "exegetes": "exegesis"
    },
    {
        ", such as the ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        " and the  Conflict of Adam and Eve with Satan , tell that the motive involved a desire for the most beautiful woman. According to Midrashic tradition, Cain and Abel each had twin sisters; each was to marry the others. The Midrash states that Abels promised wife, ": null
    },
    {
        "Aclima": "luluwa"
    },
    {
        ", was more beautiful than ": null
    },
    {
        "Awan": "awan"
    },
    {
        ". Since Cain would not consent to this arrangement, Adam suggested seeking Gods blessing by means of a sacrifice. Whoever God blessed would marry Aclima. When God openly rejected Cains sacrifice, Cain slew his brother in a fit of jealousy and anger.  Rabbinical exegetes have discussed whether Cains incestuous relationship with his sister was in violation of  halakha .               The story appears in the ": null
    },
    {
        "Quran": "quran"
    },
    {
        ", in ": null
    },
    {
        "Surah 42": "surah 5"
    },
    {
        ", verses 42 to 42:         The story of Cain and Abel has always been used as a deterrent from murder in Islamic tradition. ": null
    },
    {
        "Abdullah ibn Masud": "abdullah ibn masud"
    },
    {
        " reported that ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        " said in a hadith:   No soul is wrongfully killed except that some of the burden falls upon the son of Adam, for he was the first to establish the practice of murder. ": null
    },
    {
        "Sahih Bukhari": "sahih bukhari"
    },
    {
        " and ": null
    },
    {
        "Sahih Muslim": "sahih muslim"
    },
    {
        "     Muslim scholars were divided on the motives behind Cains murder of Abel, and further why the two brothers were obliged to offer sacrifices to God. Some scholars believed that Cains motives were plain jealousy and lust. Both Cain and Abel desired to marry Adams beautiful daughter, ": null
    },
    {
        "Aclima": "aclima"
    },
    {
        " . Seeking to end the dispute between them, Adam suggested that each present an offering before God. The one whose offering God accepted would marry Aclima. Abel, a generous shepherd, offered the fattest of his sheep as an oblation to God. But Cain, a miserly farmer, offered only a bunch of grass and some worthless seeds to him. God accepted Abels offering and rejected Cains—an indication that Abel was more righteous than Cain, and thus worthier of Aclima. As a result, it was decided that Abel would marry Aclima. Cain, on the other hand, would marry her less beautiful sister. Blinded by anger and lust for Aclima, Cain sought to get revenge on Abel and escape with Aclima. Tafsir al-Quran al-adhim , ": null
    },
    {
        "Ibn Kathir": "ibn kathir"
    },
    {
        " – Surat ": null
    },
    {
        "Al-Maida": "al-maida"
    },
    {
        "      According to another tradition, the ": null
    },
    {
        "devil": "devil in islam"
    },
    {
        " appeared to Cain and instructed him how to exact revenge on Abel. Hit Abels head with a stone and kill him , whispered the devil to Cain. After the murder, the devil hurried to ": null
    },
    {
        "Eve": "eve"
    },
    {
        " shouting: Eve! Cain has murdered Abel! . Eve did not know what murder was or how death felt like. She asked, bewildered and horrified, Woe to you! What is murder? . He does not eat. He does not drink. He does not move , answered the Devil. Eve burst out into tears and started to wail madly. She ran to Adam and tried to tell him what happened. However, she could not speak because she could not stop wailing. Since then, women wail brokenheartedly when a loved one dies. Adapted from Ibn Abul-Hatims narrative in Tafsir al-Quran al-adhim and  Tafsir al-Tabari , Surat ": null
    },
    {
        "Al-Maida": "al-maida"
    },
    {
        " A different tradition narrates that while Cain was quarreling with Abel, the devil killed an animal with a stone in Cains sight to show him how to murder Abel. Tafsir al-Quran al-adhim and  Tafsir al-Tabari , Surat Al Maida     After burying Abel and escaping from his family, Cain got married and had children. They died in Noahs flood among other tyrants and unbelievers. The Beginning and the End, ": null
    },
    {
        "Ibn Kathir": "ibn kathir"
    },
    {
        " – Volume I     Some Muslim scholars puzzled over the mention of offerings in the narrative of Cain and Abel. Offerings and sacrifices were ordained only after the revelation of ": null
    },
    {
        "Tawrat": "tawrat"
    },
    {
        " to ": null
    },
    {
        "Musa": "moses in islam"
    },
    {
        ". This led some scholars, such as ": null
    },
    {
        "Said ibn al-Musayyib": "said ibn al-musayyib"
    },
    {
        ", to think that the sons of Adam mentioned in the Quran are actually two Israelites, not Cain and Abel.        According to ": null
    },
    {
        "Shia Muslim": "shia islam"
    },
    {
        " belief, Abel  is buried in the ": null
    },
    {
        "Nabi Habeel Mosque": "nabi habeel mosque"
    },
    {
        ", located on the west mountains of ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ", near the ": null
    },
    {
        "Zabadani": "zabadani"
    },
    {
        " Valley, overlooking the villages of the ": null
    },
    {
        "Barada": "barada"
    },
    {
        " river , in ": null
    },
    {
        "Syria": "syria"
    },
    {
        ". Shia are frequent visitors of this mosque for ": null
    },
    {
        "ziyarat": "ziyarat"
    },
    {
        ". The mosque was built by ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " Wali": "wali"
    },
    {
        " Ahmad Pasha in 42            ": null
    },
    {
        "Allusion": "allusion"
    },
    {
        "s to Cain and Abel as an ": null
    },
    {
        "archetype": "archetype"
    },
    {
        " of fratricide appear in numerous references and retellings, through ": null
    },
    {
        "medieval art": "medieval art"
    },
    {
        " and ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        "an works up to present day fiction. A millennia-old explanation for Cain being capable of murder is that he may have been the offspring of a ": null
    },
    {
        "fallen angel": "fallen angel"
    },
    {
        " or ": null
    },
    {
        "Satan": "satan"
    },
    {
        " himself, rather than being from Adam.      A medieval legend has Cain arriving at the ": null
    },
    {
        "Moon": "moon in culture"
    },
    {
        ", where he eternally settled with a bundle of twigs. This was originated by the popular fantasy of interpreting the ": null
    },
    {
        "shadows on the Moon as a face": "man in the moon"
    },
    {
        ". An example of this belief can be found in ": null
    },
    {
        "Dante Alighieri": "dante alighieri"
    },
    {
        "s  Inferno   where the expression Cain and the twigs is used as a ": null
    },
    {
        "kenning": "kenning"
    },
    {
        " for moon .     A treatise on ": null
    },
    {
        "Christian Hermeticism": "hermeticism"
    },
    {
        ",  Meditations on the Tarot: A Journey into Christian Hermeticism , describes the biblical account of Cain and Abel as a myth, i.e. it expresses, in a form narrated for a particular case, an eternal idea. It shows us how brothers can become mortal enemies through the very fact that they worship the same God in the same way. According to the author, the source of religious wars is revealed. It is not the difference in dogma or ritual which is the cause, but the pretention to equality or the negation of hierarchy . Anonymous, Meditations on the Tarot: A journey into Christian Hermeticism, translated by Robert Powell 42 42 ed, pp4242     In ": null
    },
    {
        "Latter-day Saint theology": "latter-day saint theology"
    },
    {
        ", Cain is considered to be the quintessential ": null
    },
    {
        "Son of Perdition": "son of perdition"
    },
    {
        ", the father of  secret combination s , as well as the first to hold the title ": null
    },
    {
        "Master Mahan": "master mahan"
    },
    {
        " meaning master of great secret, that may murder and get gain. Moses 42:42     In ": null
    },
    {
        "Mormon folklore": "mormon folklore"
    },
    {
        " — a second-hand account relates that an early Mormon leader, ": null
    },
    {
        "David W. Patten": "david w. patten"
    },
    {
        ", encountered a very tall, hairy, dark-skinned man in ": null
    },
    {
        "Tennessee": "tennessee"
    },
    {
        " who said that he was Cain. The account states that Cain had earnestly sought death but was denied it, and that his mission was to destroy the souls of men. Letter by ": null
    },
    {
        "Abraham O. Smoot": "abraham o. smoot"
    },
    {
        ", quoted in Lycurgus A. Wilson .  p. 42 . Linda Shelley Whiting . David W. Patten: Apostle and Martyr p. 42 The recollection of Pattens story is quoted in ": null
    },
    {
        "Spencer W. Kimball": "spencer w. kimball"
    },
    {
        "s  The Miracle of Forgiveness , a popular book within ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        ". ": null
    },
    {
        "Spencer W. Kimball": "spencer w. kimball"
    },
    {
        " . The Miracle of Forgiveness  pp. 42–42 This widespread Mormon belief is further emphasized by an account from Salt Lake City in 42 which stated that One superstition is based on the old Mormon belief that Cain is a black man who wanders the earth begging people to kill him and take his curse upon themselves . Cannon, Anthon S., Wayland D. Hand, and Jeannine Talley. Religion, Magic, Ghostlore. Popular Beliefs and Superstitions from Utah. Salt Lake City: University of Utah, 42 42 Print.     Freuds theory of ": null
    },
    {
        "fratricide": "fratricide"
    },
    {
        " is explained by the ": null
    },
    {
        "Oedipus": "oedipus complex"
    },
    {
        " or ": null
    },
    {
        "Electra complex": "electra complex"
    },
    {
        " through ": null
    },
    {
        "Carl Jung": "carl jung"
    },
    {
        "s supplementation. Jens de Vlemnick . Psychoanalytische Perspectieven. Vol 42 .  Universiteit Gent.     There were other, minor traditions concerning Cain and Abel, of both older and newer date. The apocryphal  Life of Adam and Eve  tells of ": null
    },
    {
        "Eve": "eve"
    },
    {
        " having a dream in which Cain drank his brothers blood. In an attempt to prevent the prophecy from happening the two young men are separated and given different jobs. ": null
    },
    {
        "Williams, David": "david williams"
    },
    {
        ": Cain and Beowulf: A Study in Secular Allegory, page 42 University of Toronto Press, 42     The author ": null
    },
    {
        "Daniel Quinn": "daniel quinn"
    },
    {
        ", first in his book  Ishmael  and later in  The Story of B , proposes that the story of Cain and Abel is an account of early Semitic herdsmen observing the beginnings of what he calls totalitarian agriculture, with Cain representing the first modern agriculturists and Abel the ": null
    },
    {
        "pastoralists": "pastoralism"
    },
    {
        ".         ": null
    },
    {
        "Titian": "titian"
    },
    {
        ", ": null
    },
    {
        "Peter Paul Rubens": "peter paul rubens"
    },
    {
        " and ": null
    },
    {
        "William Blake": "william blake"
    },
    {
        ".   In the classic poem  Beowulf , c. 42 CE, the monstrous ": null
    },
    {
        "Grendel": "grendel"
    },
    {
        " and ": null
    },
    {
        "his mother": "grendels mother"
    },
    {
        " are said to be descended from Cain.   In ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s  Hamlet , the characters ": null
    },
    {
        "King Claudius": "king claudius"
    },
    {
        " and ": null
    },
    {
        "King Hamlet": "king hamlet"
    },
    {
        " are parallels of Cain and Abel.  The expression Cain-coloured beard   is used in Shakespeares  The Merry Wives of Windsor  .   ": null
    },
    {
        "Lord Byron": "lord byron"
    },
    {
        " rewrote and dramatized the story in the play  Cain  , viewing Cain as symbolic of a ": null
    },
    {
        "sanguine temperament": "four temperaments"
    },
    {
        ", provoked by Abels hypocrisy and sanctimony.    ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        "s poem La Conscience  tells of Cain and his family fleeing from Gods wrath.    ": null
    },
    {
        "John Steinbeck": "john steinbeck"
    },
    {
        "s 42 novel  East of Eden   refers in its title to Cains exile and contains discussions of the Cain and Abel story which then play out in the plot.    ": null
    },
    {
        "James Baldwin": "james baldwin"
    },
    {
        "s 42 short story ": null
    },
    {
        "Sonnys Blues": "sonnys blues"
    },
    {
        " has been seen as alluding to the Cain and Abel story.     Cain and Abel have ": null
    },
    {
        "appeared in comics": "cain and abel"
    },
    {
        " since the 42s. In 42 ": null
    },
    {
        "Neil Gaiman": "neil gaiman"
    },
    {
        " made them ": null
    },
    {
        "recurring characters": "list of the sandman characterscain and abel"
    },
    {
        " in his comic series  The Sandman .    ": null
    },
    {
        "Bobby": "bobby ewing"
    },
    {
        " and ": null
    },
    {
        "J.R. Ewing": "j.r. ewing"
    },
    {
        " in the TV series  Dallas  have been described as variations of Cain and Abel.    The ": null
    },
    {
        "role-playing game": "tabletop role-playing game"
    },
    {
        "  Vampire: the Masquerade  refers to vampires as Cainites after Cain, who is referred to as the first vampire.    Cain and Abel appear in the ": null
    },
    {
        "Stephen Schwartz": "stephen schwartz"
    },
    {
        " musical  Children of Eden  .    Country music group ": null
    },
    {
        "42  Runner": "4 & nbsp;runner"
    },
    {
        "s song ": null
    },
    {
        "Cains Blood": "cains blood"
    },
    {
        " uses Cain and Abel as a metaphor for the struggle between good and evil in the songs narrator.    The heavy metal band ": null
    },
    {
        "Avenged Sevenfold": "avenged sevenfold"
    },
    {
        " took their name from the biblical story,  and their song Chapter Four on the album  Waking the Fallen  is based on it.    A Mark of Cain is featured in the TV series  Supernatural  , and ": null
    },
    {
        "Cain appears as a character": "list of supernatural characterscain"
    },
    {
        ".     The Danish stageplay  Biblen  discusses and reenacts various ": null
    },
    {
        "Biblical stories": "bible story"
    },
    {
        ", including Abels murder by Cain.    Cain appears as the ultimate antagonist of the comic book series  The Strange Talent of Luther Strode  .    In ": null
    },
    {
        "Darren Aronofsky": "darren aronofsky"
    },
    {
        "s ": null
    },
    {
        "allegorical": "allegory"
    },
    {
        " film  Mother!  , the characters oldest son and younger brother represent Cain and Abel.    Cain and Abel appear on the TV series  Lucifer  .  ": null
    }
]