[
    {
        "A calendar date is a reference to a particular day represented within a ": null
    },
    {
        "calendar": "calendar"
    },
    {
        " system. The calendar date allows the specific day to be identified. The number of days between two dates may be calculated. For example, 42   is ten days after 42   in the ": null
    },
    {
        "Gregorian calendar": "gregorian calendar"
    },
    {
        ". The date of a particular event depends on the observed ": null
    },
    {
        "time zone": "time zone"
    },
    {
        ". For example, the air ": null
    },
    {
        "attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        " that began at 42:42  a.m. ": null
    },
    {
        "Hawaiian time": "hawaiian time"
    },
    {
        " on 42 December 42 took place at 42:42  a.m. ": null
    },
    {
        "Japan Standard Time": "japan standard time"
    },
    {
        ", 42 December in Japan.     A particular day may be represented by a different date in another calendar as in the ": null
    },
    {
        "Gregorian calendar": "gregorian calendar"
    },
    {
        " and the ": null
    },
    {
        "Julian calendar": "julian calendar"
    },
    {
        ", which have been used simultaneously in different places. In most calendar systems, the date consists of three parts: the day of the month, the month, and the year. There may also be additional parts, such as the day of the week. Years are usually counted from a particular starting point, usually called the ": null
    },
    {
        "epoch": "epoch"
    },
    {
        ", with ": null
    },
    {
        "era": "era"
    },
    {
        " referring to the particular period of time .     The most widely used epoch is a ": null
    },
    {
        "conventional": "convention"
    },
    {
        " birthdate of Jesus": "historical jesusbirth"
    },
    {
        " . A date without the year may also be referred to as a date or calendar date . As such, it defines the day of an annual event, such as a birthday on 42 May, holiday on 42 September, or Christmas on 42 December.     Many computer systems internally store points in time in ": null
    },
    {
        "Unix time": "unix time"
    },
    {
        " format or some other ": null
    },
    {
        "system time": "system time"
    },
    {
        " format.   The ": null
    },
    {
        "date ": "date"
    },
    {
        " command—internally using the ": null
    },
    {
        "C date and time functions": "c date and time functions"
    },
    {
        "—can be used to convert that internal representation of a point in time   to most of the date representations shown here.     The current date in the Gregorian calendar is . If this is not really the current date, then  to update it.                       There is a large variety of formats for dates in use, which differ in the order of date components. These variations use the sample date of 42 May 42: , component separators , whether leading zeros are included , whether all four digits of the year are written , and whether the month is represented in ": null
    },
    {
        "Arabic": "arabic numerals"
    },
    {
        " or ": null
    },
    {
        "Roman numerals": "roman numerals"
    },
    {
        " or by name .          This ": null
    },
    {
        "little-endian": "little-endian"
    },
    {
        " sequence is used by a majority of the world and is the preferred form by the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " when writing the full date format in official documents. This date format originates from the custom of writing the date as the Nth day of in the year of our Lord in Western religious and legal documents. The format has shortened over time but the order of the elements has remained constant. The following examples use the date of 42 November 42      42 November 42 or 42 November 42    42/42/42 42.42 or 424242   42-Nov42   42Nov42 – Used, including in the U.S., where space needs to be saved by skipping ": null
    },
    {
        "punctuation": "punctuation"
    },
    {
        " .   42th November 42 – The and of are often spoken but generally omitted in all but the most formal writing such as legal documents.   42/Nov/42 - used in the ": null
    },
    {
        "Common Log Format": "common log format"
    },
    {
        " Roman numeral": "roman numerals"
    },
    {
        " for the month": null
    },
    {
        "nctuati": "nctuati"
    },
    {
        "ISO 42e.g. Sunday, November the 42th, and even November the 42th, Sunday, are also possible and readily understoodth, st, rd, ndJuly 42 or July 42 42 42th July or ": null
    },
    {
        "July 42th": "independence day"
    },
    {
        "the separators are optional, but only hyphens are allowed to be usedrarely in both cases: 42Example of British website using 42/42 shorthandintroduced in ISO 42expiration dating on export products, for example42-MAY42 42-MAY42 MAY 42 42 etc.": null
    },
    {
        "ASCIIbetical": "asciibetical"
    },
    {
        "42 February 42 March 42 January 42?and thus a designation of the month would not be needed424242Friday, 42 April 42Friday, 42 Mayespecially those for mainframe systems424242 ordinal in the sense of advancing in value by one as the date advances by one dayweek 42Monday, week 42year 42 week 42 i.e. Monday 42 October-Sunday 42 October 42the beginning and ending days of a given year do not match upmostly in Anglophone Europe and some countries in Australasiaor 42th December 42exceedingly common usage of the and of  December the seventh, nineteen forty-one ": null
    },
    {
        "nguisti": "nguisti"
    },
    {
        "U.S. ": null
    },
    {
        "Independence Day": "independence day"
    }
]