[
    {
        "In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Callisto or Kallisto  was a ": null
    },
    {
        "nymph": "nymph"
    },
    {
        ", or the daughter of King ": null
    },
    {
        "Lycaon": "lycaon"
    },
    {
        "; the myth varies in such details. She was one of the followers of ": null
    },
    {
        "Artemis": "artemis"
    },
    {
        ", or Diana for the Romans, who attracted ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " . He transformed himself into the figure of Artemis and raped her in this disguise. She became pregnant and when this was eventually discovered, she was expelled from Artemiss group, after which a furious ": null
    },
    {
        "Hera": "hera"
    },
    {
        " transformed her into a ": null
    },
    {
        "bear": "bears in antiquity"
    },
    {
        ". Later, just as she was about to be killed by her son when he was hunting, she was ": null
    },
    {
        "set among the stars": "catasterismi"
    },
    {
        " as ": null
    },
    {
        "Ursa Major": "ursa major"
    },
    {
        " . She was the bear-mother of the ": null
    },
    {
        "Arcadia": "arcadia"
    },
    {
        "ns, through her son ": null
    },
    {
        "Arcas": "arcas"
    },
    {
        " by Zeus.     The ": null
    },
    {
        "fourth Galilean moon of Jupiter": "callisto"
    },
    {
        " is named after Callisto.                 As a follower of Artemis, Callisto, who ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        " said In his lost Astronomy, quoted in  Catasterismi . was the daughter of ": null
    },
    {
        "Lycaon": "lycaon"
    },
    {
        ", king of ": null
    },
    {
        "Arcadia": "arcadia"
    },
    {
        ", Other writers gave her a mortal genealogy as the daughter of one or the other of Lycaons sons: Pseudo-Apollodorus,  Bibliotheke . took a vow to remain a virgin, as did all the nymphs of Artemis. But to have sex with her, Zeus disguised himself as Artemis  herself, in order to lure her into his embrace. Callisto was then turned into a ": null
    },
    {
        "bear": "bear"
    },
    {
        ", as ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        " described:     ...but afterwards, when she was already with child, was seen bathing and so discovered. Upon this, the goddess was enraged and changed her into a beast. Thus she became a bear and gave birth to a son called Arcas.     Either Artemis slew Kallisto with a shot of her silver bow,  Homerica, The Contest of Homer and Hesiod , 316 ff . perhaps urged by the wrath of ": null
    },
    {
        "Juno": "juno"
    },
    {
        "  This was the version current in Greece when Pausanias visited in the second century CE . or later ": null
    },
    {
        "Arcas": "arcas"
    },
    {
        ", the ": null
    },
    {
        "eponym": "eponym"
    },
    {
        " of ": null
    },
    {
        "Arcadia": "arcadia"
    },
    {
        ", nearly killed his bear-mother, when she had wandered into the ": null
    },
    {
        "forbidden precinct": "temenos"
    },
    {
        " of Zeus. In every case, Zeus placed them both in the sky as the ": null
    },
    {
        "constellations": "constellation"
    },
    {
        " Ursa Major": "ursa major"
    },
    {
        ", called Arktos , the Bear , by Greeks, and ": null
    },
    {
        "Ursa Minor": "ursa minor"
    },
    {
        ".        According to ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        ", Ovid.  Metamorphoses . Book II, Lines 405–531; Ovid narrates the myth also in  Fasti , book II. it was ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " who took the form of Diana so that he might evade his wife Juno’s detection, forcing himself upon Callisto while she was separated from Diana and the other nymphs. The transformation of Zeus, with its ": null
    },
    {
        "lesbian": "lesbian"
    },
    {
        " overtones, was rendered as comedy in a lost work by the Attic Amphis . Callistos subsequent pregnancy was discovered several months later while she was bathing with Diana and her fellow nymphs. Diana became enraged when she saw that Callisto was pregnant and expelled her from the group. Callisto later gave birth to ": null
    },
    {
        "Arcas": "arcas"
    },
    {
        ". Juno then took the opportunity to avenge her wounded pride and transformed the nymph into a bear. Sixteen years later Callisto, still a bear, encountered her son Arcas hunting in the forest. Just as Arcas was about to kill his own mother with his javelin, Jupiter averted the tragedy by placing mother and son amongst the stars as ": null
    },
    {
        "Ursa Major": "ursa major"
    },
    {
        " and ": null
    },
    {
        "Minor": "ursa minor"
    },
    {
        ", respectively. Juno, enraged that her attempt at revenge had been frustrated, appealed to ": null
    },
    {
        "Tethys": "tethys"
    },
    {
        " that the two might never meet her waters, thus providing a poetic explanation for their ": null
    },
    {
        "circumpolar": "circumpolar star"
    },
    {
        " positions in ancient times .          Callistos story was sometimes depicted in ": null
    },
    {
        "classical art": "classical art"
    },
    {
        ", where the moment of transformation into a bear was the most popular. Gods From the Renaissance on a series of major ": null
    },
    {
        "history paintings": "history painting"
    },
    {
        "as well as many smaller ": null
    },
    {
        "cabinet paintings": "cabinet painting"
    },
    {
        "and book illustrations, usually called Diana and Callisto , depicted the traumatic moment of discovery of the pregnancy, as the goddess and her nymphs bathed in a pool, following ": null
    },
    {
        "Ovids": "ovid"
    },
    {
        "account. The subjects attraction was undoubtedly mainly the opportunity it offered for a group of several females to be shown largely nude. There is a good but by no means complete, selection at ; more on Wikimedia Commons     ": null
    },
    {
        "Titians": "titian"
    },
    {
        "  Diana and Callisto  , was the greatest of these, quickly disseminated by a print by ": null
    },
    {
        "Cornelius Cort": "cornelius cort"
    },
    {
        ". Brigstocke, 184 Here, as in most subsequent depictions, Diana points angrily, as Callisto is held by two nymphs, who may be pulling off what little clothing remains on her. Other versions include ": null
    },
    {
        "one by Rubens": "diana and callisto"
    },
    {
        ", and  Diana Bathing with her Nymphs with Actaeon and Callisto  by ": null
    },
    {
        "Rembrandt": "rembrandt"
    },
    {
        ", which unusually combines the moment with the arrival of ": null
    },
    {
        "Actaeon": "actaeon"
    },
    {
        ". Hall, Gods The basic composition is rather unusually consistent. ": null
    },
    {
        "Carlo Ridolfi": "carlo ridolfi"
    },
    {
        " said there was a version by ": null
    },
    {
        "Giorgione": "giorgione"
    },
    {
        ", who died in 1510, though his many attributions to Giorgione of paintings that are now lost are treated with suspicion by scholars. Jane Martineau , The Genius of Venice, 1500–1600, 207, 1983, Royal Academy of Arts, London Other, less dramatic, treatments before Titian established his composition are by ": null
    },
    {
        "Palma Vecchio": "palma vecchio"
    },
    {
        " and ": null
    },
    {
        "Dosso Dossi": "dosso dossi"
    },
    {
        ".     Although Ovid places the discovery in the ninth month of Callistos pregnancy, in paintings she is generally shown with a rather modest bump for late pregnancy. With the  Visitation  in religious art, this was the leading recurring subject in history painting that required showing ": null
    },
    {
        "pregnancy in art": "pregnancy in art"
    },
    {
        ", which ": null
    },
    {
        "Early Modern": "early modern"
    },
    {
        " painters still approached with some caution. In any case, the narrative required that the rest of the group had not previously noticed the pregnancy.     Callisto being seduced by Zeus/Jupiter in disguise was also a popular subject, usually called Jupiter and Callisto ; it was the clearest common subject with lesbian lovers from classical mythology. The two lovers are usually shown happily embracing in a bower. The violent rape described by Ovid as following Callistos realization of what is going on is rarely shown. In versions before about 1700 Callisto may show some doubt about what is going on, as in the versions by Rubens. It was especially popular in the 18th century, when depictions were increasingly erotic; ": null
    },
    {
        "François Boucher": "françois boucher"
    },
    {
        " painted several versions. Hall, Gods     ": null
    },
    {
        "Aeschylus": "aeschylus"
    },
    {
        " tragedy Callisto is lost.          The name Kalliste , most beautiful , may be recognized as an ": null
    },
    {
        "epithet": "epithet"
    },
    {
        " of the goddess herself, though none of the inscriptions at Athens that record priests of Artemis Kalliste , date before the third century BCE. Daniel J. Geagan. The Athenian Constitution After Sulla . Artemis Kalliste was worshiped in Athens in a shrine which lay outside the Dipylon gate, by the side of the road to the ": null
    },
    {
        "Academy": "platonic academy"
    },
    {
        ". Klio: Beiträge Zur Alten Geschichte 1907. W. S. Ferguson suggested In Klio 7 . that Artemis Soteira and Artemis Kalliste were joined in a common cult administered by a single priest. The bearlike character of Artemis herself was a feature of the ": null
    },
    {
        "Brauronia": "brauronia"
    },
    {
        ".     The myth in  Catasterismi  may be derived from the fact that a set of constellations appear close together in the sky, in and near the ": null
    },
    {
        "Zodiac": "zodiac"
    },
    {
        " sign of ": null
    },
    {
        "Libra": "libra"
    },
    {
        ", namely Ursa Minor, Ursa Major, ": null
    },
    {
        "Boötes": "boötes"
    },
    {
        ", and ": null
    },
    {
        "Virgo": "virgo"
    },
    {
        ". The ": null
    },
    {
        "constellation Boötes": "boötes"
    },
    {
        ", was explicitly identified in the Hesiodic Astronomia  Hesiod, Astronomia, fragment 3, preserved as a quote in a commentary on ": null
    },
    {
        "Aratus": "aratus"
    },
    {
        ". as Arcas, the Bear-warden : Thus Hesiod is quoted, though Boötes, , from his very name, is a cow  herdsman.     He is Arkas the son of Kallisto and Zeus, and he lived in the country about Lykaion. After Zeus had seduced Kallisto, Lykaon, pretending not to know of the matter, entertained Zeus, as Hesiod says, and set before him on the table the babe which he had cut up. The episode is a doublet of the serving up of ": null
    },
    {
        "Pelops": "pelops"
    },
    {
        ".      The stars of Ursa Major were all circumpolar in Athens of 400 BCE, and all but the stars in the Great Bears left foot were circumpolar in Ovids Rome, in the first century CE. Now, however, due to the ": null
    },
    {
        "precession of the equinoxes": "precession of the equinoxes"
    },
    {
        ", the feet of the Great Bear constellation do sink below the horizon from Rome and especially from Athens; however, Ursa Minor does remain completely above the horizon, even from latitudes as far south as Honolulu and Hong Kong.     According to Julien dHuy, who used phylogenetic and statistical tools, the story could be a recent transformation of a Palaeolithic myth. dHuy Julien, Un ours dans les étoiles: recherche phylogénétique Sur un mythe préhistorique. Préhistoire du sud-ouest, 20 , 2012: 91-106 ; A Cosmic Hunt in the Berber sky : a phylogenetic reconstruction of Palaeolithic mythology. Les Cahiers de lAARS, 15, 2013: 93-106 .         Hercules: The Legendary Journeys  and its spinoff  Xena: Warrior Princess , Callisto is portrayed by ": null
    },
    {
        "Hudson Leick": "hudson leick"
    },
    {
        ".   In the video game  Persona 2: Eternal Punishment , Callisto is the initial ": null
    },
    {
        "Persona": "persona"
    },
    {
        " of supporting character Ulala Serizawa.   In the video game  God of War: Ghost of Sparta , Callisto is portrayed as the mother of protagonist Kratos and undergoes transformation into a monstrous beast that the player must defeat.    In the video game  The Secret World , Callisto is the nickname of a quest-giving non-player character and the myth related to a puzzle/investigation quest.    In music, the song Like Callisto to a Star in Heaven by American heavy metal band ": null
    },
    {
        "Trivium": "trivium_"
    },
    {
        " dramatically retells the myth of Callistos rape, pregnancy, and exile.       ": null
    }
]