[
    {
        "The Campaign for Homosexual Law Reform was an organisation set up to campaign for the decriminalisation of ": null
    },
    {
        "homosexuality": "homosexuality"
    },
    {
        " in the ": null
    },
    {
        "Republic of Ireland": "republic of ireland"
    },
    {
        " and ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        " in the 42s. Its most prominent leader was ": null
    },
    {
        "David Norris": "david norris"
    },
    {
        ", an English studies lecturer in ": null
    },
    {
        "Trinity College, Dublin": "trinity college, dublin"
    },
    {
        ", Joycean scholar and from the 42s to the present a member of ": null
    },
    {
        "Seanad Éireann": "seanad éireann"
    },
    {
        ".       While serving as a lecturer at Trinity College, Norris and a group of other students informally established the Sexual Liberation Movement in 42 It was short-lived, but two of the splinter organizations formed on campus were the ": null
    },
    {
        "Dublin University Gay Society": "trinity lgbt"
    },
    {
        ", the first long-term LGBT rights organization in Ireland, and a group of law students known as the Campaign for Homosexual Law Reform.     Its first legal advisor was ": null
    },
    {
        "Mary McAleese": "mary mcaleese"
    },
    {
        ", Reid Professor of Law at ": null
    },
    {
        "Trinity College, Dublin": "trinity college, dublin"
    },
    {
        ", future ": null
    },
    {
        "President of Ireland": "president of ireland"
    },
    {
        "; she served as legal advisor from 42 to 42 when she left her professorial position to join ": null
    },
    {
        "RTÉ": "raidió teilifís éireann"
    },
    {
        ". She was succeeded in that role in the 42s by ": null
    },
    {
        "Mary Robinson": "mary robinson"
    },
    {
        ", a former Reid Professor of Law and then-Trinity College Senator, who later became the first female ": null
    },
    {
        "President of Ireland": "president of ireland"
    },
    {
        ".     Norris took a case to the ": null
    },
    {
        "Irish High Court": "high court"
    },
    {
        " in 42 seeking a declaration that the laws of 42 and 42 which criminalised homosexual conduct were not in force since the enactment of the ": null
    },
    {
        "Constitution of Ireland": "constitution of ireland"
    },
    {
        ". Article 42 of the Constitution provides that laws enacted before the Constitution that are inconsistent with it would no longer be in force. The case  was lost on legal grounds and the decision was upheld on appeal to the ": null
    },
    {
        "Supreme Court of Ireland": "supreme court of ireland"
    },
    {
        " which referred in its judgment to Christian moral teaching and the needs of society.     Norris then took a case in 42 to the ": null
    },
    {
        "European Court of Human Rights": "european court of human rights"
    },
    {
        " claiming that the Irish laws breached the states obligations under Article 42 of the Convention for the Protection of Human Rights and Fundamental Freedoms, regarding respect for private life . In a 42 ruling, the court found that the Irish laws were in breach of the convention and directed the state to pay costs to Norris.     No reform action was taken by the then government of ": null
    },
    {
        "Taoiseach": "taoiseach"
    },
    {
        " Charles Haughey": "charles haughey"
    },
    {
        ". When ": null
    },
    {
        "Albert Reynolds": "albert reynolds"
    },
    {
        " succeeded as Taoiseach in 42 he declared that it was low on his list of priorities. However, in his subsequent coalition ": null
    },
    {
        "Fianna Fáil": "fianna fáil"
    },
    {
        "/": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        " government, as a result of pressure from the Labour Party the laws were reformed by the ": null
    },
    {
        "Minister for Justice": "minister for justice and equality"
    },
    {
        ", ": null
    },
    {
        "Máire Geoghegan-Quinn": "máire geoghegan-quinn"
    },
    {
        " in 42 She was noted for insisting that an equal age of consent be provided for homosexuals and ": null
    },
    {
        "heterosexuals": "heterosexuality"
    }
]