[
    {
        "                Canadian football  is a ": null
    },
    {
        "sport": "team sport"
    },
    {
        " played in Canada in which two teams of 12 players each compete for territorial control of a field of play  long and  wide attempting to advance a pointed oval-shaped ball into the opposing teams scoring area .     In Canada, the term football may refer to Canadian football and ": null
    },
    {
        "American football": "american football"
    },
    {
        " collectively, or to either sport specifically, depending on context; outside of Canada, the term Canadian football is used exclusively to describe this sport, even in the United States . The two sports have shared origins and are closely related but have ": null
    },
    {
        "some key differences": "comparison of american and canadian football"
    },
    {
        ", and both sports had their modern rules developed independently from each other.     ": null
    },
    {
        "Rugby football": "rugby football"
    },
    {
        " in Canada originated in the early 1860s, and over time, the game known as Canadian football developed. Both the ": null
    },
    {
        "Canadian Football League": "canadian football league"
    },
    {
        " , the sports top professional league, and ": null
    },
    {
        "Football Canada": "football canada"
    },
    {
        ", the governing body for amateur play, trace their roots to 1880 and the founding of the ": null
    },
    {
        "Canadian Rugby Football Union": "rugby canadacanadian rugby football union"
    },
    {
        ".     The CFL is the most popular and only major professional Canadian football league. Its championship game, the ": null
    },
    {
        "Grey Cup": "grey cup"
    },
    {
        ", is one of Canadas largest sporting events, attracting a broad television audience. In 2009, about 40% of Canadas population watched part of the game;  in 2014, it was closer to 33%, peaking at 5.1 million viewers in the fourth quarter. Chris Zelkovich, , Yahoo Sports, 2 December 2014     Canadian football is also played at the bantam, high school, junior, collegiate, and semi-professional levels: the ": null
    },
    {
        "Canadian Junior Football League": "canadian junior football league"
    },
    {
        ", formed May 8, 1974, and ": null
    },
    {
        "Quebec Junior Football League": "quebec junior football league"
    },
    {
        " are leagues for players aged 18–22, many post-secondary institutions compete in ": null
    },
    {
        "U Sports football": "u sports football"
    },
    {
        " for the ": null
    },
    {
        "Vanier Cup": "vanier cup"
    },
    {
        ", and senior leagues such as the ": null
    },
    {
        "Alberta Football League": "alberta football league"
    },
    {
        " have grown in popularity in recent years. Great achievements in Canadian football are enshrined in the ": null
    },
    {
        "Canadian Football Hall of Fame": "canadian football hall of fame"
    },
    {
        " located in ": null
    },
    {
        "Hamilton, Ontario": "hamilton, ontario"
    },
    {
        ".     Other organizations across Canada perform senior league Canadian football during the summer.        The first documented football match was a practice game played on November 9, 1861, at ": null
    },
    {
        "University College": "university college, university of toronto"
    },
    {
        ", ": null
    },
    {
        "University of Toronto": "university of toronto"
    },
    {
        " . One of the participants in the game involving University of Toronto students was Sir ": null
    },
    {
        "William Mulock": "william mulock"
    },
    {
        ", later chancellor of the school.  A football club was formed at the university soon afterward, although its rules of play at this stage are unclear.      The first written account of a game played was on October 15, 1862, on the Montreal Cricket Grounds. It was between the First Battalion ": null
    },
    {
        "Grenadier Guards": "grenadier guards"
    },
    {
        " and the Second Battalion ": null
    },
    {
        "Scots Fusilier Guards": "scots fusilier guards"
    },
    {
        " resulting in a win by the Grenadier Guards 3 goals, 2 rouges to nothing. In 1864, at ": null
    },
    {
        "Trinity College": "university of trinity college"
    },
    {
        ", Toronto, F. Barlow Cumberland, Frederick A. Bethune, and Christopher Gwynn, one of the founders of Milton, Massachusetts, devised rules based on ": null
    },
    {
        "rugby football": "rugby football"
    },
    {
        ". The game gradually gained a following, with the Hamilton Football Club formed on November 3, 1869. Montreal formed a team April 8, 1872. Toronto was formed on October 4, 1873, and the Ottawa FBC on September 20, 1876.     This rugby-football soon became popular at Montreals ": null
    },
    {
        "McGill University": "mcgill university"
    },
    {
        ". McGill challenged ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        " to a game, in 1874 using a hybrid game of English rugby devised by the University of McGill.       The first attempt to establish a proper governing body and adopted the current set of Rugby rules was the Foot Ball Association of Canada, organized on March 24, 1873, followed by the Canadian Rugby Football Union founded June 12, 1880,  which included teams from Ontario and Quebec. Later both the Ontario and Quebec Rugby Football Union were formed , and then the Interprovincial and Western Interprovincial Football Union .  The CRFU reorganized into an umbrella organization forming the Canadian Rugby Union in 1891.  The immediate forerunner to the current Canadian Football League was established in 1956 when the IRFU and WIFU formed an umbrella organization, the Canadian Football Council .  In 1958 the CFC left the CRU to become the CFL.     The ": null
    },
    {
        "Burnside rules": "burnside rules"
    },
    {
        " closely resembling American football  that were incorporated in 1903 by the ORFU, was an effort to distinguish it from a more rugby-oriented game. The Burnside Rules had teams reduced to 12 men per side, introduced the snap-back system, required the offensive team to gain 10 yards on three downs, eliminated the throw-in from the sidelines, allowed only six men on the line, stated that all goals by kicking were to be worth two points and the opposition was to line up 10 yards from the defenders on all kicks. The rules were an attempt to standardize the rules throughout the country. The CIRFU, QRFU and CRU refused to adopt the new rules at first.  ": null
    },
    {
        "Forward pass": "forward pass"
    },
    {
        "es were not allowed in the Canadian game until 1929, and touchdowns, which had been five points, were increased to six points in 1956, in both cases several decades after the Americans had adopted the same changes. The primary differences between the Canadian and American games stem from rule changes that the American side of the border adopted but the Canadian side did not . The Canadian field width was one rule that was not based on American rules, as the Canadian game was played in wider fields and stadiums that were not as narrow as the American stadiums.     The ": null
    },
    {
        "Grey Cup": "grey cup"
    },
    {
        " was established in 1909 after being donated by ": null
    },
    {
        "Albert Grey, 4th Earl Grey": "albert grey, 4th earl grey"
    },
    {
        ", Governor General of Canada, as the championship of teams under the CRU for the Rugby Football Championship of Canada. Initially an amateur competition, it eventually became dominated by professional teams in the 1940s and early 1950s. The ": null
    },
    {
        "Ontario Rugby Football Union": "ontario rugby football union"
    },
    {
        ", the last amateur organization to compete for the trophy, withdrew from competition after the 1954 season.  The move ushered in the modern era of Canadian professional football, culminating in the formation of the present-day ": null
    },
    {
        "Canadian Football League": "canadian football league"
    },
    {
        " in 1958.     Canadian football has mostly been confined to Canada, with the United States being the only other country to have hosted high-level Canadian football games. The CFLs controversial ": null
    },
    {
        "South Division": "canadian football league in the united states"
    },
    {
        " as it would come to be officially known attempted to put CFL teams in the United States playing under Canadian rules between 1992 and 1995. The move was aborted after three years; the ": null
    },
    {
        "Baltimore Stallions": "baltimore stallions"
    },
    {
        " were the most successful of the numerous Americans teams to play in the CFL, winning the ": null
    },
    {
        "83rd Grey Cup": "83rd grey cup"
    },
    {
        ". Continuing financial losses, a lack of proper Canadian football venues, a pervasive belief that the American teams were simply pawns to provide the struggling Canadian teams with expansion fee revenue, and the ": null
    },
    {
        "return of the NFL to Baltimore": "cleveland browns relocation controversy"
    },
    {
        " prompted the end of Canadian football on the American side of the border.     The CFL hosted the ": null
    },
    {
        "Touchdown Atlantic": "touchdown atlantic"
    },
    {
        " regular season game at Nova Scotia in 2005 and New Brunswick in 2010, 2011 and 2013. In 2013, Newfoundland and Labrador became the last province to establish football at the minor league level, with teams playing on the Avalon Peninsula and in Labrador City. The province however has yet to host a college or CFL game. ": null
    },
    {
        "Prince Edward Island": "prince edward island"
    },
    {
        " Hamilton Tigers": "hamilton tiger-cats"
    },
    {
        " and the ": null
    },
    {
        "Ottawa Rough Riders": "ottawa rough riders"
    },
    {
        " 4th Canadian Armoured Division": "4th canadian armoured division"
    },
    {
        " Atoms and ": null
    },
    {
        "First Canadian Army": "first canadian army"
    },
    {
        " Red and Blue Bombers, in ": null
    },
    {
        "Utrecht": "utrecht"
    },
    {
        ", ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " Touchdown monument outside the ": null
    },
    {
        "Canadian Football Hall of Fame": "canadian football hall of fame"
    },
    {
        " in ": null
    },
    {
        "Hamilton, Ontario": "hamilton, ontario"
    },
    {
        "            Canadian football is played at several levels in Canada; the top league is the professional nine-team ": null
    },
    {
        "Canadian Football League": "canadian football league"
    },
    {
        " . The CFL regular season begins in June, and playoffs for the ": null
    },
    {
        "Grey Cup": "grey cup"
    },
    {
        " are completed by late November.  In cities with outdoor stadiums such as ": null
    },
    {
        "Edmonton": "edmonton"
    },
    {
        ", ": null
    },
    {
        "Winnipeg": "winnipeg"
    },
    {
        ", ": null
    },
    {
        "Calgary": "calgary"
    },
    {
        ", and ": null
    },
    {
        "Regina": "regina, saskatchewan"
    },
    {
        ", low temperatures and icy field conditions can seriously affect the outcome of a game.     Amateur football is governed by ": null
    },
    {
        "Football Canada": "football canada"
    },
    {
        ". At the university level, 27 teams play in four conferences under the auspices of ": null
    },
    {
        "U Sports": "u sports"
    },
    {
        " ; the U Sports champion is awarded the ": null
    },
    {
        "Vanier Cup": "vanier cup"
    },
    {
        ".  Junior football is played by many after high school before joining the university ranks. There are 18 junior teams in three divisions in the ": null
    },
    {
        "Canadian Junior Football League": "canadian junior football league"
    },
    {
        " competing for the ": null
    },
    {
        "Canadian Bowl": "canadian bowl"
    },
    {
        ".  The ": null
    },
    {
        "Quebec Junior Football League": "quebec junior football league"
    },
    {
        " includes teams from Ontario and Quebec who battle for the Manson Cup.     ": null
    },
    {
        "Semi-professional": "semi-professional"
    },
    {
        " leagues have grown in popularity in recent years, with the ": null
    },
    {
        "Alberta Football League": "alberta football league"
    },
    {
        " becoming especially popular. The Northern Football Conference formed in Ontario in 1954 has also surged in popularity for former college players who do not continue to professional football. The Ontario champion plays against the Alberta champion for the National Championship . The Canadian Major Football League is the governing body for the semi-professional game.     Womens football has gained attention in recent years in Canada. The first Canadian womens league to begin operations was the ": null
    },
    {
        "Maritime Womens Football League": "maritime womens football league"
    },
    {
        " in 2004. The largest womens league is the ": null
    },
    {
        "Western Womens Canadian Football League": "western womens canadian football league"
    },
    {
        ".          The Canadian football field is  long and  wide, within which the ": null
    },
    {
        "goal areas": "end zone"
    },
    {
        " are  deep, and the goal lines are  apart. Weighted pylons are placed on the inside corner of the intersections of the goal lines and end lines. Including the endzones, the total area of the field is .     At each goal line is a set of  ": null
    },
    {
        "goalposts": "goalposts"
    },
    {
        ", which consist of two uprights joined by an  crossbar which is  above the goal line. The goalposts may be H-shaped although in the higher-calibre competitions the tuning-fork design  is preferred.     The sides of the field are marked by white sidelines, the goal line is marked in white or yellow, and white lines are drawn laterally across the field every  from the goal line. These lateral lines are called yard lines and often marked with the distance in yards from and an arrow pointed toward the nearest goal line. Prior to the early 1980s, arrows were not used and all yard lines were usually marked with the distance to the goal line, including the goal line itself which was marked with either a 0 or 00 ; in most stadiums today, only the yard markers in multiples of 10 are marked with numbers, with the goal line sometimes being marked with a G . The centre line usually is marked with a C . Hash marks are painted in white, parallel to the yardage lines, at  intervals,  from the sidelines.     On fields that have a surrounding ": null
    },
    {
        "running track": "running track"
    },
    {
        ", such as ": null
    },
    {
        "Molson Stadium": "percival molson memorial stadium"
    },
    {
        " and many ": null
    },
    {
        "universities": "canadian interuniversity sport"
    },
    {
        ", the end zones are often cut off in the corners to accommodate the track. Until 1986,  the end zones were  deep, giving the field an overall length of , and a correspondingly larger cutoff could be required at the corners. The first field to feature the shorter 20-yard endzones was ": null
    },
    {
        "Vancouvers": "vancouver, british columbia"
    },
    {
        " BC Place": "bc place"
    },
    {
        " , which opened in 1983. This was particularly common among U.S.-based teams during the CFLs American expansion, where few American stadiums were able to accommodate the much longer and noticeably wider CFL field. The end zones in Torontos ": null
    },
    {
        "BMO Field": "bmo field"
    },
    {
        " are only 18 yards instead of 20 yards.          Teams advance across the field through the execution of quick, distinct plays, which involve the possession of a brown, ": null
    },
    {
        "prolate spheroid": "prolate spheroid"
    },
    {
        " ball with ends tapered to a point. The ball has two one-inch-wide white stripes.       At the beginning of a match, an official tosses a coin and allows the captain of the visiting team to call heads or tails. The captain of the team winning the coin toss is given the option of having first choice, or of deferring first choice to the other captain. The captain making first choice may either choose a dyellow and whitefootballred and blackone of seven officials ": null
    }
]