[
    {
        "              Canonization is the act by which a ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " church declares that a person who has died is a saint, upon which declaration the person is included in the list of recognized saints, called the canon. Originally, a person was recognized as a saint without any formal process. Later, different processes were developed, such as those used today in the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ", the ": null
    },
    {
        "Eastern Orthodox Church": "eastern orthodox church"
    },
    {
        ", ": null
    },
    {
        "Oriental Orthodox Church": "oriental orthodox church"
    },
    {
        " and the ": null
    },
    {
        "Anglican Communion": "anglican communion"
    },
    {
        ".       The ": null
    },
    {
        "Roman Rites": "roman rite"
    },
    {
        "Canon of the ": null
    },
    {
        "Mass": "mass"
    },
    {
        " contains only the names of martyrs, along with that of the ": null
    },
    {
        "Blessed Virgin Mary": "mary, mother of jesus"
    },
    {
        " and, since 1962, that of ": null
    },
    {
        "Saint Joseph": "saint joseph"
    },
    {
        " her spouse.     By the fourth century, however, ": null
    },
    {
        "confessors": "confessor"
    },
    {
        " —people who had confessed their faith not by dying but by word and life—began to be venerated publicly. Examples of such people are Saint ": null
    },
    {
        "Hilarion": "hilarion"
    },
    {
        " and Saint ": null
    },
    {
        "Ephrem the Syrian": "ephrem the syrian"
    },
    {
        " in the East, and Saint ": null
    },
    {
        "Martin of Tours": "martin of tours"
    },
    {
        " and Saint ": null
    },
    {
        "Hilary of Poitiers": "hilary of poitiers"
    },
    {
        " in the West. Their names were inserted in the ": null
    },
    {
        "diptych": "diptych"
    },
    {
        "s, the lists of saints explicitly venerated in the ": null
    },
    {
        "liturgy": "liturgy"
    },
    {
        ", and their tombs were honoured in like manner as those of the martyrs. Since the witness of their lives was not as unequivocal as that of the martyrs, they were venerated publicly only with the approval by the local ": null
    },
    {
        "bishop": "bishop"
    },
    {
        ". This process is often referred to as local canonization .     This approval was required even for veneration of a reputed martyr. In his history of the ": null
    },
    {
        "Donatist": "donatism"
    },
    {
        " heresy, ": null
    },
    {
        "Saint Optatus": "saint optatus"
    },
    {
        " recounts that at ": null
    },
    {
        "Carthage": "carthage"
    },
    {
        " a Catholic matron, named Lucilla, incurred the censures of the Church for having kissed the ": null
    },
    {
        "relics": "relic"
    },
    {
        "of a reputed martyr whose claims to martyrdom had not been juridically proved. And Saint ": null
    },
    {
        "Cyprian": "cyprian"
    },
    {
        " recommended that the utmost diligence be observed in investigating the claims of those who were said to have died for the faith. All the circumstances accompanying the martyrdom were to be inquired into; the faith of those who suffered, and the motives that animated them were to be rigorously examined, in order to prevent the recognition of undeserving persons. Evidence was sought from the court records of the trials or from people who had been present at the trials.     ": null
    },
    {
        "Augustine of Hippo": "augustine of hippo"
    },
    {
        " tells of the procedure which was followed in his day for the recognition of a martyr. The bishop of the diocese in which the martyrdom took place set up a canonical process for conducting the inquiry with the utmost severity. The acts of the process were sent either to the ": null
    },
    {
        "metropolitan": "metropolitan bishop"
    },
    {
        " or ": null
    },
    {
        "primate": "primate"
    },
    {
        ", who carefully examined the cause, and, after consultation with the ": null
    },
    {
        "suffragan": "suffragan"
    },
    {
        " bishops, declared whether the deceased was worthy of the name of martyr and public veneration.     Acts of formal recognition, such as the erection of an ": null
    },
    {
        "altar": "altar"
    },
    {
        " over the saints tomb or transferring the saints relics to a church, were preceded by formal inquiries into the sanctity of the persons life and the miracles attributed to that persons intercession.     Such acts of recognition of a saint were authoritative, in the strict sense, only for the ": null
    },
    {
        "diocese": "diocese"
    },
    {
        " or ": null
    },
    {
        "ecclesiastical province": "ecclesiastical province"
    },
    {
        " for which they were issued, but with the spread of the fame of a saint, were often accepted elsewhere also.          The ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ", the ": null
    },
    {
        "Mother Church": "mother church"
    },
    {
        " of the ": null
    },
    {
        "Anglican Communion": "anglican communion"
    },
    {
        ", canonized ": null
    },
    {
        "Charles I": "charles i of england"
    },
    {
        " as a saint, in the ": null
    },
    {
        "Convocations of Canterbury and York": "convocations of canterbury and york"
    },
    {
        " of 1660.            In the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", both ": null
    },
    {
        "Latin": "latin church"
    },
    {
        " and ": null
    },
    {
        "constituent Eastern": "eastern catholic churches"
    },
    {
        " churches, the act of canonization is reserved to the ": null
    },
    {
        "Apostolic See": "apostolic see"
    },
    {
        " and occurs at the conclusion of a long process requiring extensive proof that the candidate for canonization lived and died in such an exemplary and holy way that they are worthy to be recognized as a saint. The Churchs official recognition of sanctity implies that the person is now in ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        " and that they may be publicly invoked and mentioned officially in the ": null
    },
    {
        "liturgy": "liturgy"
    },
    {
        " of the Church, including in the  Litany of the Saints .     In the Catholic Church, canonization is a decree that allows universal veneration of the saint in the ": null
    },
    {
        "liturgy": "liturgy"
    },
    {
        " of the ": null
    },
    {
        "Roman Rite": "roman rite"
    },
    {
        ". For permission to venerate merely locally, only ": null
    },
    {
        "beatification": "beatification"
    },
    {
        " is needed. Beatification, in the present discipline, differs from canonization in this: that the former implies a locally restricted, not a universal, permission to venerate, which is a mere permission, and no precept; while canonization implies a universal precept .            For several centuries the ": null
    },
    {
        "Bishop": "bishop"
    },
    {
        "s, or in some places only the ": null
    },
    {
        "Primates": "primate"
    },
    {
        " and ": null
    },
    {
        "Patriarch": "patriarch"
    },
    {
        "s, August., Brevic. Collat. cum Donatistis, III, 13, no. 25 in PL, XLIII, 628. could grant martyrs and confessors public ecclesiastical honor; such honor, however, was always decreed only for the local territory of which the grantors had jurisdiction. Only acceptance of the cultus by the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " made the cultus universal, because he alone can rule the universal ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ". Gonzalez Tellez, Comm. Perpet. in singulos textus libr. Decr., III, xlv, in Cap. 1, De reliquiis et vener. Sanct. Abuses, however, crept into this discipline, due as well to indiscretions of popular fervor as to the negligence of some bishops in inquiring into the lives of those whom they permitted to be honoured as saints.     In the Medieval West, the ": null
    },
    {
        "Apostolic See": "apostolic see"
    },
    {
        " was asked to intervene in the question of canonizations so as to ensure more authoritative decisions. The canonization of ": null
    },
    {
        "Saint Udalric, Bishop of Augsburg": "saint udalric, bishop of augsburg"
    },
    {
        " by ": null
    },
    {
        "Pope John XV": "pope john xv"
    },
    {
        " in 993 was the first undoubted example of Papal canonization of a saint from outside of ": null
    },
    {
        "Rome": "rome"
    },
    {
        "; some historians maintain further that the first Papal canonization was of ": null
    },
    {
        "St. Swibert": "st. swibert"
    },
    {
        " by ": null
    },
    {
        "Pope Leo III": "pope leo iii"
    },
    {
        " in 804.     Thereafter, recourse to the judgment of the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " was had more frequently. Toward the end of the eleventh century the ": null
    },
    {
        "Popes": "pope"
    },
    {
        "judged it necessary to restrict episcopal authority regarding canonization, and therefore decreed that the virtues and miracles of persons proposed for public veneration should be examined in councils, more specifically in general councils. ": null
    },
    {
        "Pope Urban II": "pope urban ii"
    },
    {
        ", ": null
    },
    {
        "Pope Calixtus II": "pope calixtus ii"
    },
    {
        ", and ": null
    },
    {
        "Pope Eugene III": "pope eugene iii"
    },
    {
        " conformed to this discipline.       ": null
    },
    {
        "Hugh de Boves": "hugh de boves"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Rouen": "archbishop of rouen"
    },
    {
        ", canonized ": null
    },
    {
        "Walter of Pontoise": "walter of pontoise"
    },
    {
        ", or St. Gaultier, in 1153, the final saint in ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        " to be canonized by an authority other than the ": null
    },
    {
        "Pope": "pope"
    },
    {
        ":   The last case of canonization by a metropolitan is said to have been that of ": null
    },
    {
        "St. Gaultier": "walter of pontoise"
    },
    {
        ", or Gaucher, bot of Pontoise, by the Archbishop of Rouen. A decree of ": null
    },
    {
        "Pope Alexander III": "pope alexander iii"
    },
    {
        " 1170 gave the prerogative to the pe thenceforth, so far as the Western Church was concerned. In a decretal of 1173, ": null
    },
    {
        "Pope Alexander III": "pope alexander iii"
    },
    {
        " reprimanded some bishops for permitting veneration of a man who was merely killed while intoxicated, prohibited veneration of the man, and most significantly decreed that you shall not therefore presume to honor him in the future; for, even if miracles were worked through him, it is not lawful for you to venerate him as a saint without the authority of the Catholic Church. Pope Gregory IX, Decretales, 3, De reliquiis et veneratione sanctorum . It is alternatively quoted as follows: For the future you will not presume to pay him reverence, as, even though miracles were worked through him, it would not allow you to revere him as a saint unless with the authority of the Roman Church . Theologians disagree as to the full import of the decretal of ": null
    },
    {
        "Pope Alexander III": "pope alexander iii"
    },
    {
        ": either a new law was instituted, St. Robert Bellarmine, De Eccles. Triumph., I, 8. in which case the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " then for the first time reserved the right of beatification to himself, or an existing law was confirmed.     However, the procedure initiated by the decretal of ": null
    },
    {
        "Pope Alexander III": "pope alexander iii"
    },
    {
        " was confirmed by a ": null
    },
    {
        "bull": "papal bull"
    },
    {
        " of ": null
    },
    {
        "Pope Innocent III": "pope innocent iii"
    },
    {
        " issued on the occasion of the canonization of ": null
    },
    {
        "Cunigunde of Luxembourg": "cunigunde of luxembourg"
    },
    {
        " in 1200. The ": null
    },
    {
        "bull": "papal bull"
    },
    {
        " of ": null
    },
    {
        "Pope Innocent III": "pope innocent iii"
    },
    {
        " resulted in increasingly elaborate inquiries to the ": null
    },
    {
        "Apostolic See": "apostolic see"
    },
    {
        " concerning canonizations. Because the decretal of ": null
    },
    {
        "Pope Alexander III": "pope alexander iii"
    },
    {
        " did not end all controversy and some bishops did not obey it in so far as it regarded beatification, the right of which they had certainly possessed hitherto, ": null
    },
    {
        "Pope Urban VIII": "pope urban viii"
    },
    {
        " issued the Apostolic letter Caelestis Hierusalem cives of 5 July 1634 that exclusively reserved to the ": null
    },
    {
        "Apostolic See": "apostolic see"
    },
    {
        " both its immemorial right of canonization and that of ": null
    },
    {
        "beatification": "beatification"
    },
    {
        ". He further regulated both of these acts by issuing his Decreta servanda in beatificatione et canonizatione Sanctorum on 12 March 1642.       In his De Servorum Dei beatificatione et de Beatorum canonizatione of five volumes the eminent canonist Prospero Lambertini , who later became ": null
    },
    {
        "Pope Benedict XIV": "pope benedict xiv"
    },
    {
        ", elaborated on the procedural norms of ": null
    },
    {
        "Pope Urban VIIIs": "pope urban viii"
    },
    {
        "Apostolic letter Caelestis Hierusalem cives of 1634 and Decreta servanda in beatificatione et canonizatione Sanctorum of 1642, and on the conventional practice of the time. His work published from 1734 to 1738 governed the proceedings until 1917. The article ": null
    },
    {
        "Beatification and canonization process in 1914": "beatification and canonization process in 1914"
    },
    {
        " describes the procedures followed until the promulgation of the Codex of 1917. The substance of De Servorum Dei beatifιcatione et de Beatorum canonizatione was incorporated into the  Codex Iuris Canonici   of 1917,  which governed until the promulgation of the revised  Codex Iuris Canonici  in 1983 by ": null
    },
    {
        "Pope John Paul II": "pope john paul ii"
    },
    {
        ". Prior to promulgation of the revised Codex in 1983, ": null
    },
    {
        "Pope St. Paul VI": "pope paul vi"
    },
    {
        " initiated a simplification of the procedures.       The ": null
    },
    {
        "Apostolic constitution": "apostolic constitution"
    },
    {
        " Divinus Perfectionis Magister of ": null
    },
    {
        "Pope John Paul II": "pope john paul ii"
    },
    {
        " of 25 January 1983  and the norms issued by the ": null
    },
    {
        "Congregation for the Causes of Saints": "congregation for the causes of saints"
    },
    {
        " on 7 February 1983 to implement the constitution in dioceses, continued the simplification of the process initiated by ": null
    },
    {
        "Pope Paul VI": "pope paul vi"
    },
    {
        ".  Contrary to popular belief, the reforms did not eliminate the office of the Promoter of the Faith , popularly known as the ": null
    },
    {
        "Devils advocate": "devils advocate"
    },
    {
        " , whose office is to question the material presented in favor of canonization. The reforms were intended to reduce the adversarial nature of the process. In November 2012 ": null
    },
    {
        "Pope Benedict XVI": "pope benedict xvi"
    },
    {
        " appointed Monsignor Carmello Pellegrino as Promoter of the Faith.      Candidates for canonization undergo the following process:     Servant of God : The process of canonization commences at the diocesan level. A ": null
    },
    {
        "bishop": "bishop"
    },
    {
        " with jurisdiction, usually the bishop of the place where the candidate died or is buried, although another ordinary can be given this authority, gives permission to open an investigation into the virtues of the individual in response to a petition of members of the faithful, either actually or  pro forma . Pope John Paul II,  , Art. 1, Sec. 1. This investigation usually commences no sooner than five years after the death of the person being investigated. Pietro Cardinal Palazzini, , 1983 , §9. The ": null
    },
    {
        "Pope": "pope"
    },
    {
        ", qua Bishop of Rome, may also open a process and has the authority to waive the waiting period of five years, e. g., as was done for ": null
    },
    {
        "St. Teresa of Calcutta": "st. teresa of calcutta"
    },
    {
        " by ": null
    },
    {
        "Pope John Paul II": "pope john paul ii"
    },
    {
        ", , Office of Papal Liturgical Celebrations, Internet Office of the Holy See and for ": null
    },
    {
        "Lúcia Santos": "lúcia santos"
    },
    {
        " and for ": null
    },
    {
        "Pope John Paul II": "pope john paul ii"
    },
    {
        " himself by ": null
    },
    {
        "Pope Benedict XVI": "pope benedict xvi"
    },
    {
        ".  ": null
    },
    {
        "Cardinal": "cardinal"
    },
    {
        " José Saraiva Martins": "josé saraiva martins"
    },
    {
        ", ": null
    },
    {
        "CMF": "claretians"
    },
    {
        ", , 2005  Normally, an association to promote the cause of the candidate is instituted, an exhaustive search of the candidates writings, speeches, and sermons is undertaken, a detailed biography is written, and eyewitness accounts are collected. When sufficient evidence has been collected, the local bishop presents the investigation of the candidate, who is titled Servant of God , to the ": null
    },
    {
        "Congregation for the Causes of the Saints": "congregation for the causes of the saints"
    },
    {
        " of the ": null
    },
    {
        "Roman Curia": "roman curia"
    },
    {
        ", where the cause is assigned a ": null
    },
    {
        "postulator": "postulator"
    },
    {
        ", whose office is to collect further evidence of the life of the Servant of God. Religious orders that regularly deal with the Congregation often designate their own Postulator General. At some time, permission is then granted for the body of the Servant of God to be exhumed and examined. A certification non-cultus is made that no superstitious or heretical worship, or improper cult of the Servant of God or his tomb has emerged, and relics are taken and preserved.   Venerable  or Heroic in Virtue : When sufficient evidence has been collected, the Congregation recommends to the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " that he proclaim the ": null
    },
    {
        "heroic virtue": "heroic virtue"
    },
    {
        " of the Servant of God; that is, that the Servant of God exercised to a heroic degree the ": null
    },
    {
        "theological virtues": "theological virtues"
    },
    {
        " of faith, hope, and charity and the ": null
    },
    {
        "cardinal virtues": "cardinal virtues"
    },
    {
        " of prudence, justice, fortitude, and temperance. From this time the one said to be heroic in virtue is entitled  Venerable  . A Venerable does not yet have a ": null
    },
    {
        "feast day": "feast day"
    },
    {
        ", permission to erect churches in his honor has not yet been granted, and the Church does not yet issue a statement on his probable or certain presence in ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        ", but ": null
    },
    {
        "prayer cards": "prayer card"
    },
    {
        "and other materials may be printed to encourage the faithful to pray for a ": null
    },
    {
        "miracle": "miracle"
    },
    {
        " wrought by his intercession as a sign of Gods will that the person be canonized.    Blessed  : Beatification is a statement of the Church that it is worthy of belief that the Venerable is in ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        " and saved. Attaining this grade depends on whether the Venerable is a ": null
    },
    {
        "martyr": "martyr"
    },
    {
        ":   For a martyr, the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " has only to make a declaration of martyrdom, which is a certification that the Venerable gave his life voluntarily as a witness of the Faith or in an ": null
    },
    {
        "act of heroic charity": "act of heroic charity"
    },
    {
        " for others.   For a non-martyr, all of them being denominated confessors because they confessed , i. e., bore witness to the Faith by how they lived, proof is required of the occurrence of a ": null
    },
    {
        "miracle": "miracle"
    },
    {
        " through the intercession of the Venerable; that is, that God granted a sign that the person is enjoying the ": null
    },
    {
        "Beatific Vision": "beatific vision"
    },
    {
        " by performing a miracle for which the Venerable interceded. Presently, these miracles are almost always miraculous cures of infirmity, because these are the easiest to judge given the Churchs evidentiary requirements for miracles; e. g., a patient was sick with an illness for which no cure was known; prayers were directed to the Venerable; the patient was cured; the cure was spontaneous, instantaneous, complete, and enduring; and physicians cannot discover any natural explanation for the cure.     The satisfaction of the applicable conditions permits ": null
    },
    {
        "beatification": "beatification"
    },
    {
        ", which then bestows on the Venerable the title of Blessed . A ": null
    },
    {
        "feast day": "feast day"
    },
    {
        " will be designated, but its observance is ordinarily only permitted for the Blesseds home ": null
    },
    {
        "diocese": "diocese"
    },
    {
        ", to specific locations associated with them, or to the churches or houses of the Blesseds religious order if they belonged to one. Parishes may not normally be named in honor of beati.      Saint  : To be canonized as a saint, ordinarily at least two miracles must have been performed through the intercession of the Blessed after their death, but for beati confessors, i. e., beati who were not declared martyrs, only one miracle is required, ordinarily being additional to that upon which beatification was premised. Very rarely, a pope may waive the requirement for a second miracle after beatification if they, the ": null
    },
    {
        "Sacred College of Cardinals": "college of cardinals"
    },
    {
        ", and the ": null
    },
    {
        "Congregation for the Causes of Saints": "congregation for the causes of saints"
    },
    {
        " all agree that the Blessed lived a life of great merit proven by certain actions. This extraordinary procedure was used in ": null
    },
    {
        "Pope Francis": "pope francis"
    },
    {
        " canonization of ": null
    },
    {
        "Pope John XXIII": "pope john xxiii"
    },
    {
        ", who convoked the first part of the ": null
    },
    {
        "Second Vatican Council": "second vatican council"
    },
    {
        ".     Canonization is a statement of the Church that the person certainly enjoys the ": null
    },
    {
        "Beatific Vision": "beatific vision"
    },
    {
        " of ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        ". The title of Saint  is then proper, reflecting that the Saint is a refulgence of the holiness  of God Himself, which alone comes from Gods gift. The Saint is assigned a ": null
    },
    {
        "feast day": "feast day"
    },
    {
        " which may be celebrated anywhere in the universal Church, although it is not necessarily added to the ": null
    },
    {
        "General Roman Calendar": "general roman calendar"
    },
    {
        " or local calendars as an obligatory feast; parish churches may be erected in his honor; and the faithful may freely celebrate and honor the Saint.     Although recognition of sainthood by the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " does not directly concern a fact of ": null
    },
    {
        "Divine revelation": "divine revelation"
    },
    {
        ", nonetheless it must be definitively held by the faithful as infallible pursuant to, at the least, the ": null
    },
    {
        "Universal Magisterium of the Church": "infallibility of the church"
    },
    {
        ", because it is a truth related to revelation by historical necessity. , by Cardinal Joseph Ratzinger , Congregation for the Doctrine of the Faith. , The Catholic Encyclopedia, Vol. 2. New York, New York: Robert Appleton Company, 1907. P. 366.     Regarding the ": null
    },
    {
        "Eastern Catholic Churches": "eastern catholic churches"
    },
    {
        ", individual  sui juris  churches have the right to glorify saints for their own jurisdictions, though this has rarely happened.         Popes have several times permitted to the universal Church, without executing the ordinary judicial process of canonization described above, the veneration as a saint, the  cultus  of one long venerated as such locally. This act of a pope is denominated equipollent or equivalent canonization and confirmation of cultus . According to the rules ": null
    },
    {
        "Pope Benedict XIV": "pope benedict xiv"
    },
    {
        "  instituted, there are three conditions for an equipollent canonization: existence of an ancient cultus of the person, a general and constant attestation to the virtues or martyrdom of the person by credible historians, and uninterrupted fame of the person as a worker of miracles.     As examples, prior to his pontificate, of this mode of canonization, ": null
    },
    {
        "Pope Benedict XIV": "pope benedict xiv"
    },
    {
        " himself enumerated the equipollent canonizations of Saints:   ": null
    },
    {
        "Romuald": "romuald"
    },
    {
        " - 9 July 1595   ": null
    },
    {
        "Norbert": "norbert"
    },
    {
        "- 7 September 1621   ": null
    },
    {
        "Bruno": "bruno of cologne"
    },
    {
        " - 6 October 1623   ": null
    },
    {
        "Peter Nolasco": "peter nolasco"
    },
    {
        " - 20 October 1655   ": null
    },
    {
        "Raymond Nonnatus": "raymond nonnatus"
    },
    {
        " - 10 March 1681   ": null
    },
    {
        "King Stephen of Hungary": "stephen of hungary"
    },
    {
        " - 28 November 1686   ": null
    },
    {
        "Queen Margaret of Scotland": "saint margaret of scotland"
    },
    {
        " - 15 September 1691   ": null
    },
    {
        "John of Matha": "john of matha"
    },
    {
        " and ": null
    },
    {
        "Felix of Valois": "felix of valois"
    },
    {
        " - 19 March 1694   ": null
    },
    {
        "Pope Gregory VII": "pope gregory vii"
    },
    {
        " - 25 September 1728   ": null
    },
    {
        "Duke Wenceslaus of Bohemia": "wenceslaus i, duke of bohemia"
    },
    {
        " - 14 March 1729   ": null
    },
    {
        "Gertrude of Helfta": "gertrude of helfta"
    },
    {
        " - 20 July 1738.     Later equipollent canonizations include those of Saints:   ": null
    },
    {
        "Peter Damian": "peter damian"
    },
    {
        " - 1 October 1828   ": null
    },
    {
        "Cyril and Methodius": "cyril and methodius"
    },
    {
        " - 30 September 1880   ": null
    },
    {
        "Cyril of Alexandria": "cyril of alexandria"
    },
    {
        ", ": null
    },
    {
        "Cyril of Jerusalem": "cyril of jerusalem"
    },
    {
        ", ": null
    },
    {
        "Justin Martyr": "justin martyr"
    },
    {
        " and ": null
    },
    {
        "Augustine of Canterbury": "augustine of canterbury"
    },
    {
        " - 28 July 1882   ": null
    },
    {
        "John of Damascus": "john of damascus"
    },
    {
        " and ": null
    },
    {
        "Sylvester Gozzolini": "sylvester gozzolini"
    },
    {
        " - 29 August 1890   ": null
    },
    {
        "Bede the Venerable": "bede the venerable"
    },
    {
        " - 25 May 1899   ": null
    },
    {
        "Boniface": "boniface"
    },
    {
        " - 4 May 1919   ": null
    },
    {
        "Ephrem the Syrian": "ephrem the syrian"
    },
    {
        " - 5 October 1920   ": null
    },
    {
        "Albert the Great": "albert the great"
    },
    {
        " - 15 December 1931   ": null
    },
    {
        "John Fisher": "john fisher"
    },
    {
        " and ": null
    },
    {
        "Thomas More": "thomas more"
    },
    {
        " - 19 May 1935   ": null
    },
    {
        "Margaret of Hungary": "margaret of hungary"
    },
    {
        " - 19 November 1943   ": null
    },
    {
        "Gregorio Barbarigo": "gregorio barbarigo"
    },
    {
        " - 26 May 1960   ": null
    },
    {
        "John of Ávila": "john of ávila"
    },
    {
        " - 31 May 1970   ": null
    },
    {
        "Nikola Tavelić": "nikola tavelić"
    },
    {
        " and his three companion martyrs - 21 June 1970   ": null
    },
    {
        "Meinhard of Livonia": "meinhard of livonia"
    },
    {
        " - 1993   ": null
    },
    {
        "Marko Krizin": "marko krizin"
    },
    {
        ", ": null
    },
    {
        "István Pongrácz": "istván pongrácz"
    },
    {
        ", and ": null
    },
    {
        "Melchior Grodziecki": "melchior grodziecki"
    },
    {
        " - 2 July 1995   ": null
    },
    {
        "Hildegard of Bingen": "hildegard of bingen"
    },
    {
        " - 10 May 2012     ": null
    },
    {
        "Pope Francis": "pope francis"
    },
    {
        " added Saints:   ": null
    },
    {
        "Angela of Foligno": "angela of foligno"
    },
    {
        " Angelo Amato, La canonizzazione equipollente della mistica Angela da Foligno in LOsservatore Romano . - 9 October 2013   ": null
    },
    {
        "Peter Faber": "peter faber"
    },
    {
        " - 17 December 2013   ": null
    },
    {
        "José de Anchieta": "josé de anchieta"
    },
    {
        ",  ": null
    },
    {
        "Marie of the Incarnation": "marie of the incarnation"
    },
    {
        ", and ": null
    },
    {
        "Francis-Xavier de Montmorency-Laval": "françois de laval"
    },
    {
        " - 3 April 2014     ": null
    },
    {
        "Bartholomew of Braga": "bartholomew of braga"
    },
    {
        " - 5 July 2019               The following terms are used for canonization by the ": null
    },
    {
        "autocephalous": "autocephalous"
    },
    {
        " national": "national polity"
    },
    {
        " Orthodox Church": "orthodox church"
    },
    {
        "es: канонизация  or прославление  ": null
    },
    {
        "glorification": "glorificationeastern orthodox church"
    },
    {
        "  by ": null
    },
    {
        "Protopresbyter": "protopresbyter"
    },
    {
        " Michael Pomazansky": "michael pomazansky"
    },
    {
        " , კანონიზაცია kanonizats’ia , канонизација , canonizare , and Канонизация . The following terms are used for canonization by other ": null
    },
    {
        "autocephalous": "autocephalous"
    },
    {
        " Orthodox Church": "orthodox church"
    },
    {
        "es: αγιοκατάταξη ": null
    },
    {
        "Georgios Babiniotis": "georgios babiniotis"
    },
    {
        ".  Dictionary of Modern Greek , Athens: Lexicology Centre, 1998, p. 53.  agiokatataxi/agiokatataxis, ranking among saints , kanonizim , kanonizacja , and kanonizace/kanonizácia .     The ": null
    },
    {
        "Orthodox Church in America": "orthodox church in america"
    },
    {
        ", an Eastern Orthodox Church partly recognized as autocephalous, uses the term glorification for granting official recognition to someone as a saint—see ": null
    },
    {
        "glorification": "glorificationeastern orthodox church"
    },
    {
        ".   by Fr. Joseph Frawley       Within the ": null
    },
    {
        "Armenian Apostolic Church": "armenian apostolic church"
    },
    {
        ", part of ": null
    },
    {
        "Oriental Orthodoxy": "oriental orthodoxy"
    },
    {
        ", there had been discussions since the 1980s about canonizing the victims of the ": null
    },
    {
        "Armenian Genocide": "armenian genocide"
    },
    {
        ". Roberta R. Ervine, Worship Traditions in Armenia and the Neighboring Christian East, St Vladimirs Seminary Press, 2006, p. 346 n. 17. On April 23, 2015, all of the victims of the genocide were canonized.          The ": null
    },
    {
        "General Conference": "general conference"
    },
    {
        " of the ": null
    },
    {
        "United Methodist Church": "united methodist church"
    },
    {
        " has formally declared individuals  martyrs , including ": null
    },
    {
        "Dietrich Bonhoeffer": "dietrich bonhoeffer"
    },
    {
        " and ": null
    },
    {
        "Martin Luther King Jr.": "martin luther king jr."
    },
    {
        " .  ": null
    }
]