[
    {
        "        The canton of Aargau  is one of the more northerly ": null
    },
    {
        "cantons of Switzerland": "Cantons Of Switzerland"
    },
    {
        ". It is situated by the lower course of the ": null
    },
    {
        "Aare": "Aare"
    },
    {
        ", which is why the canton is called Aar- gau  . It is one of the most densely populated regions of Switzerland.             The area of Aargau and the surrounding areas were controlled by the ": null
    },
    {
        "Helvetians": "Helvetians"
    },
    {
        ", a member of the ": null
    },
    {
        "Celts": "Celts"
    },
    {
        ", as far back as 200  BC, eventually being occupied by the ": null
    },
    {
        "Romans": "Roman Empire"
    },
    {
        " and then by the 6th century, the ": null
    },
    {
        "Franks": "Franks"
    },
    {
        ". The Romans built a major settlement called ": null
    },
    {
        "Vindonissa": "Vindonissa"
    },
    {
        ", near the present location of ": null
    },
    {
        "Brugg": "Brugg"
    },
    {
        ".              The reconstructed Old High German name of Aargau is Argowe,   first unambiguously attested  in 795.   The term described a territory only loosely equivalent to that of the modern canton, including the region between Aare and ": null
    },
    {
        "Reuss": "Reuss"
    },
    {
        ", including ": null
    },
    {
        "Pilatus": "Pilatus"
    },
    {
        " and ": null
    },
    {
        "Napf": "Napf"
    },
    {
        ", i.e. including parts of the modern cantons of Bern ,   ": null
    },
    {
        "Solothurn": "Canton Of Solothurn"
    },
    {
        ", ": null
    },
    {
        "Basel-Landschaft": "Basel-Landschaft"
    },
    {
        ", ": null
    },
    {
        "Lucerne": "Canton Of Lucerne"
    },
    {
        ", ": null
    },
    {
        "Obwalden": "Obwalden"
    },
    {
        " and ": null
    },
    {
        "Nidwalden": "Nidwalden"
    },
    {
        ", but not the parts of the modern canton east of the Reuss , which were part of ": null
    },
    {
        "Zürichgau": "Zürichgau"
    },
    {
        ".     Within the ": null
    },
    {
        "Frankish Empire": "Frankish Empire"
    },
    {
        " , the area was a disputed border region between the duchies of ": null
    },
    {
        "Alamannia": "Alamannia"
    },
    {
        " and ": null
    },
    {
        "Burgundy": "Burgundy"
    },
    {
        ". A line of the von ": null
    },
    {
        "Wetterau": "Wetterau"
    },
    {
        "  intermittently held the countship of Aargau from 750 until about 1030, when they lost it .   This division became the ill-defined outer border of the early ": null
    },
    {
        "Holy Roman Empire": "Holy Roman Empire"
    },
    {
        " at its formation in the second half of the 10th century.   Most of the region came under the control of the ducal ": null
    },
    {
        "house of Zähringen": "House Of Zähringen"
    },
    {
        " and the comital houses of ": null
    },
    {
        "Habsburg": "House Of Habsburg"
    },
    {
        " and ": null
    },
    {
        "Kyburg": "House Of Kyburg"
    },
    {
        " by about 1200.     In the second half of the 13th century, the territory became divided between the territories claimed by the ": null
    },
    {
        "imperial cities": "Reichsfrei"
    },
    {
        " of ": null
    },
    {
        "Bern": "Bern"
    },
    {
        ", ": null
    },
    {
        "Lucerne": "Lucerne"
    },
    {
        " and ": null
    },
    {
        "Solothurn": "Solothurn"
    },
    {
        " and the Swiss canton of ": null
    },
    {
        "Unterwalden": "Unterwalden"
    },
    {
        ".   The remaining portion, largely corresponding to the modern canton of Aargau, remained under the control of the Habsburgs until the conquest of Aargau by the ": null
    },
    {
        "Old Swiss Confederacy": "Old Swiss Confederacy"
    },
    {
        " in 1415.    ": null
    },
    {
        "Habsburg Castle": "Habsburg Castle"
    },
    {
        " itself, the original seat of the House of Habsburg, was taken by Bern in April 1415. Peter Frey. Die Habsburg. Bericht über die Ausgrabungen von 1994/95 in: Argovia, Jahresschrift der Historischen Gesellschaft des Kantons Aargau 109 , p. 167.   The Habsburgs had founded a number of monasteries , the closing of which by the government in 1841 was a contributing factor to the outbreak of the Swiss civil war – the ": null
    },
    {
        "Sonderbund War": "Sonderbund War"
    },
    {
        " – in 1847.          When ": null
    },
    {
        "Frederick IV of Habsburg": "Frederick Iv, Duke Of Austria"
    },
    {
        " sided with ": null
    },
    {
        "Antipope John XXIII": "Antipope John Xxiii"
    },
    {
        " at the ": null
    },
    {
        "Council of Constance": "Council Of Constance"
    },
    {
        ", ": null
    },
    {
        "Emperor": "Holy Roman Emperor"
    },
    {
        " Sigismund": "Sigismund, Holy Roman Emperor"
    },
    {
        " placed him under the ": null
    },
    {
        "Imperial ban": "Imperial Ban"
    },
    {
        ". In July 1414, the Pope visited ": null
    },
    {
        "Bern": "Bern"
    },
    {
        " and received assurances from them, that they would move against the Habsburgs. A few months later the ": null
    },
    {
        "Swiss Confederation": "Swiss Confederation"
    },
    {
        " denounced the ": null
    },
    {
        "Treaty of 1412": "Treaty Of 1412"
    },
    {
        ". Shortly thereafter in 1415, ": null
    },
    {
        "Bern": "Bern"
    },
    {
        " and the rest of the Swiss Confederation used the ban as a pretext to invade the Aargau. The Confederation was able to quickly conquer the towns of Aarau, Lenzburg, Brugg and Zofingen along with most of the Habsburg castles. ": null
    },
    {
        "Bern": "Bern"
    },
    {
        " kept the southwest portion , northward to the confluence of the ": null
    },
    {
        "Aare": "Aare"
    },
    {
        " and ": null
    },
    {
        "Reuss": "Reuss"
    },
    {
        ". The important city of ": null
    },
    {
        "Baden": "Baden, Switzerland"
    },
    {
        " was taken by a united Swiss army and governed by all 8 members of the Confederation. Some districts, named the  Freie Ämter   – ": null
    },
    {
        "Mellingen": "Mellingen"
    },
    {
        ", ": null
    },
    {
        "Muri": "Muri District"
    },
    {
        ", ": null
    },
    {
        "Villmergen": "Villmergen"
    },
    {
        ", and ": null
    },
    {
        "Bremgarten": "Bremgarten"
    },
    {
        ", with the ": null
    },
    {
        "countship of Baden": "County Of Baden"
    },
    {
        " – were governed as subject lands by all or some of the Confederates. Shortly after the conquest of the Aargau by the Swiss, ": null
    },
    {
        "Frederick": "Frederick Iv, Duke Of Austria"
    },
    {
        " humbled himself to the Pope. The Pope reconciled with him and ordered all of the taken lands to be returned. The Swiss refused and years later after no serious attempts at re-acquisition, the Duke officially relinquished rights to the Swiss.           Berns portion of the Aargau came to be known as the ": null
    },
    {
        "Unteraargau": "Unteraargau"
    },
    {
        ", though can also be called the Berner or Bernese Aargau. In 1514 Bern expanded north into the ": null
    },
    {
        "Jura": "Canton Of Jura"
    },
    {
        " and so came into possession of several strategically important mountain passes into the Austrian ": null
    },
    {
        "Fricktal": "Fricktal"
    },
    {
        ". This land was added to the Unteraargau and was directly ruled from Bern. It was divided into seven rural ": null
    },
    {
        "bailiwicks": "Bailiwick"
    },
    {
        "and four administrative cities, Aarau, Zofingen, Lenzburg and Brugg. While the Habsburgs were driven out, many of their minor nobles were allowed to keep their lands and offices, though over time they lost power to the Bernese government. The bailiwick administration was based on a very small staff of officials, mostly made up of Bernese citizens, but with a few locals.      When Bern converted during the ": null
    },
    {
        "Protestant Reformation": "Protestant Reformation"
    },
    {
        " in 1528, the Unteraargau also converted. At the beginning of the 16th century a number of ": null
    },
    {
        "anabaptists": "Anabaptist"
    },
    {
        "migrated into the upper Wynen and Rueder valleys from ": null
    },
    {
        "Zürich": "Zürich"
    },
    {
        ". Despite pressure from the Bernese authorities in the 16th and 17th centuries anabaptism never entirely disappeared from the Unteraargau.     Bern used the Aargau bailiwicks mostly as a source of grain for the rest of the city-state. The administrative cities remained economically only of regional importance. However, in the 17th and 18th centuries Bern encouraged industrial development in Unteraargau and by the late 18th century it was the most industrialized region in the city-state. The high industrialization led to high population growth in the 18th century, for example between 1764 and 1798, the population grew by 35%, far more than in other parts of the canton. In 1870 the proportion of farmers in Aarau, Lenzburg, Kulm, and Zofingen districts was 34–40%, while in the other districts it was 46–57%.          The rest of the ": null
    },
    {
        "Freie Ämter": "Freie Ämter"
    },
    {
        " were collectively administered as subject territories by the rest of the Confederation. Muri Amt was assigned to Zürich, Lucerne, ": null
    },
    {
        "Schwyz": "Canton Of Schwyz"
    },
    {
        ", ": null
    },
    {
        "Unterwalden": "Unterwalden"
    },
    {
        ", ": null
    },
    {
        "Zug": "Canton Of Zug"
    },
    {
        " and ": null
    },
    {
        "Glarus": "Canton Of Glarus"
    },
    {
        ", while the Ämter of Meienberg, Richensee and ": null
    },
    {
        "Villmergen": "Villmergen"
    },
    {
        " were first given to Lucerne alone. The final boundary was set in 1425 by an arbitration tribunal and Lucerne had to give the three Ämter to be collectively ruled.  The four Ämter were then consolidated under a single Confederation ": null
    },
    {
        "bailiff": "Bailiff"
    },
    {
        " into what was known in the 15th century as the Waggental Bailiwick . In the 16th century, it came to be known as the Vogtei der Freien Ämter. While the Freien Ämter often had independent lower courts, they were forced to accept the Confederations sovereignty. Finally, in 1532, the canton of Uri became part of the collective administration of the Freien Ämter.      At the time of ": null
    },
    {
        "Reformation": "Protestant Reformation"
    },
    {
        ", the majority of the Ämter converted to the new faith. In 1529, a wave of ": null
    },
    {
        "iconoclasm": "Iconoclasm"
    },
    {
        " swept through the area and wiped away much of the old religion. After the defeat of Zürich in the second ": null
    },
    {
        "Battle of Kappel": "Battle Of Kappel"
    },
    {
        " in 1531, the victorious five Catholic cantons marched their troops into the Freie Ämter and reconverted them to Catholicism.     In the ": null
    },
    {
        "First War of Villmergen": "First War Of Villmergen"
    },
    {
        ", in 1656, and the ": null
    },
    {
        "Toggenburg War": "Toggenburg War"
    },
    {
        " , in 1712, the Freie Ämter became the staging ground for the warring Reformed and Catholic armies. While the peace after the 1656 war did not change the status quo, the fourth Peace of Aarau in 1712 brought about a reorganization of power relations. The victory gave Zürich the opportunity to force the Catholic cantons out of the government in the ": null
    },
    {
        "county of Baden": "County Of Baden"
    },
    {
        " and the adjacent area of the Freie Ämter. The Freie Ämter were then divided in two by a line drawn from the gallows in ": null
    },
    {
        "Fahrwangen": "Fahrwangen"
    },
    {
        " to the ": null
    },
    {
        "Oberlunkhofen": "Oberlunkhofen"
    },
    {
        " church steeple. The northern part, the so-called Unteren Freie Ämter , which included the districts of Boswil and Hermetschwil and the Niederamt, were ruled by Zürich, Bern and Glarus. The southern part, the Oberen Freie Ämter , were ruled by the previous seven cantons but Bern was added to make an eighth.     During the ": null
    },
    {
        "Helvetic Republic": "Helvetic Republic"
    },
    {
        " , the county of Baden, the Freie Ämter and the area known as the ": null
    },
    {
        "Kelleramt": "Kelleramt"
    },
    {
        " were combined into the ": null
    },
    {
        "canton of Baden": "Canton Of Baden"
    },
    {
        ".          The ": null
    },
    {
        "County of Baden": "County Of Baden"
    },
    {
        " was a shared ": null
    },
    {
        "condominium": "Condominium"
    },
    {
        " of the entire ": null
    },
    {
        "Old Swiss Confederacy": "Old Swiss Confederacy"
    },
    {
        ". After the Confederacy conquest in 1415, they retained much of the Habsburg legal structure, which caused a number of problems. The local nobility had the right to hold the ": null
    },
    {
        "low court": "High, Middle And Low Justice"
    },
    {
        " in only about one fifth of the territory. There were over 30 different nobles who had the right to hold courts scattered around the surrounding lands. All these overlapping jurisdictions caused numerous conflicts, but gradually the Confederation was able to acquire these rights in the County. The cities of Baden, ": null
    },
    {
        "Bremgarten": "Bremgarten, Aargau"
    },
    {
        " and ": null
    },
    {
        "Mellingen": "Mellingen"
    },
    {
        " became the administrative centers and held the high courts. Together with the courts, the three administrative centers had considerable local autonomy, but were ruled by a governor who was appointed by the Acht Orte every two years. After the ": null
    },
    {
        "Protestant": "Swiss Reformed Church"
    },
    {
        " victory at the ": null
    },
    {
        "Second Battle of Villmergen": "Toggenburg War"
    },
    {
        ", the administration of the County changed slightly. Instead of the Acht Orte appointing a bailiff together, Zürich and Bern each appointed the governor for 7 out of 16 years while ": null
    },
    {
        "Glarus": "Canton Of Glarus"
    },
    {
        " appointed him for the remaining 2 years.      The chaotic legal structure and fragmented land ownership combined with a tradition of dividing the land among all the heirs in an inheritance prevented any large scale reforms. The governor tried in the 18th century to reform and standardize laws and ownership across the County, but with limited success. With an ever-changing administration, the County lacked a coherent long-term economic policy or support for reforms. By the end of the 18th century there were no factories or mills and only a few small ": null
    },
    {
        "cottage industries": "Cottage Industrycottage Industry"
    },
    {
        " along the border with Zürich. Road construction first became a priority after 1750, when Zürich and Bern began appointing a governor for seven years.     During the ": null
    },
    {
        "Protestant Reformation": "Protestant Reformation"
    },
    {
        ", some of the municipalities converted to the new faith. However, starting in 1531, some of the old parishes were ": null
    },
    {
        "converted back to the old faith": "Counter-Reformation"
    },
    {
        ". The governors were appointed from both Catholic and Protestant cantons and since they changed every two years, neither faith gained a majority in the County.     The County was the only federal condominium in the 17th century where Jews were tolerated. In 1774, they were restricted to just two towns, ": null
    },
    {
        "Endingen": "Endingen, Switzerland"
    },
    {
        " and ": null
    },
    {
        "Lengnau": "Lengnau, Aargau"
    },
    {
        ". While the rural upper class tried several times to finally expel the Jews, the financial interests of the authorities prevented this. The Jews were directly subordinate to the governor starting in 1696 when they were forced to buy a protecting and shielding letter every 16 years from the governor.     After the French invasion, on 19 March 1798, the governments of Zürich and Bern agreed to the creation of the short lived ": null
    },
    {
        "canton of Baden": "Canton Of Baden"
    },
    {
        " in the ": null
    },
    {
        "Helvetic Republic": "Helvetic Republic"
    },
    {
        ". With the ": null
    },
    {
        "Act of Mediation": "Act Of Mediation"
    },
    {
        " in 1803, the canton of Baden was dissolved. Portions of the lands of the former County of Baden now became the District of Baden in the newly created canton of Aargau. After World War II, this formerly agrarian region saw striking growth and became the district with the largest and densest population in the canton .             The contemporary canton of Aargau was formed in 1803, a canton of the ": null
    },
    {
        "Swiss Confederation": "Swiss Confederation"
    },
    {
        " as a result of the ": null
    },
    {
        "Act of Mediation": "Act Of Mediation"
    },
    {
        ". It was a combination of three short-lived cantons of the ": null
    },
    {
        "Helvetic Republic": "Helvetic Republic"
    },
    {
        ": Aargau , Baden and Fricktal . Its creation is therefore rooted in the ": null
    },
    {
        "Napoleonic era": "Switzerland In The Napoleonic Era"
    },
    {
        ". In the year 2003, the canton of Aargau celebrated its 200th anniversary.     French forces occupied the Aargau from 10 March to 18 April 1798; thereafter the Bernese portion became the canton of Aargau and the remainder formed the ": null
    },
    {
        "canton of Baden": "Canton Of Baden"
    },
    {
        ". Aborted plans to merge the two halves came in 1801 and 1802, and they were eventually united under the name Aargau,  which was then admitted as a full member of the reconstituted Confederation following the Act of Mediation. Some parts of the canton of Baden at this point were transferred to other cantons: the Amt of ": null
    },
    {
        "Hitzkirch": "Hitzkirch"
    },
    {
        " to Lucerne, whilst ": null
    },
    {
        "Hüttikon": "Hüttikon"
    },
    {
        ", ": null
    },
    {
        "Oetwil an der Limmat": "Oetwil An Der Limmat"
    },
    {
        ", ": null
    },
    {
        "Dietikon": "Dietikon"
    },
    {
        " and ": null
    },
    {
        "Schlieren": "Schlieren, Zürich"
    },
    {
        " went to Zürich. In return, Lucernes Amt of ": null
    },
    {
        "Merenschwand": "Merenschwand"
    },
    {
        " was transferred to Aargau .     The ": null
    },
    {
        "Fricktal": "Fricktal"
    },
    {
        ", ceded in 1802 by ": null
    },
    {
        "Austria": "Austria"
    },
    {
        " via Napoleonic France to the Helvetic Republic, was briefly a separate canton of the Helvetic Republic  under a  Statthalter  , but on 19 March 1803 was incorporated into the canton of Aargau.     The former cantons of Baden and Fricktal can still be identified with the contemporary ": null
    },
    {
        "districts": "Districts Of Switzerlandaargau"
    },
    {
        " – the ": null
    },
    {
        "canton of Baden": "Canton Of Baden"
    },
    {
        " is covered by the districts of Zurzach, Baden, Bremgarten, and Muri ; the ": null
    },
    {
        "canton of Fricktal": "Canton Of Fricktal"
    },
    {
        " by the districts of Rheinfelden and Laufenburg .       The chief magistracy of Aargau changed its style repeatedly:   first two consecutive  Regierungsstatthalter  :   April 1798 – November 1801 Jakob Emmanuel Feer   1802–1803 Johann Heinrich Rothpletz   Presidents of the Government Commission   10 March 1803 – 26 April 1803 Johann Rudolf Dolder   26 April 1803 – 1815 a Small Council   annual  Amtsbürgermeister  1815–1831   annual  Landammänner  since 1815          In the 17th century, Jews were banished from Switzerland. However, a few families were permitted to live in two villages, ": null
    },
    {
        "Endingen": "Endingen, Switzerland"
    },
    {
        " and ": null
    },
    {
        "Lengnau": "Lengnau, Aargau"
    },
    {
        ", in Aargau which became the Jewish ghetto in Switzerland. During this period, Jews and Christians were not allowed to live under the same roof, neither were Jews allowed to own land or houses. They were taxed at a much higher rate than others and, in 1712, the Lengnau community was pillaged. In 1760, they were further restricted regarding marriages and procreation. This remained the case until the 19th century. In 1799, all special tolls were abolished, and, in 1802, the poll tax was removed. On 5 May 1809, they were declared citizens and given broad rights regarding trade and farming. They were still restricted to Endingen and Lengnau until 7 May 1846, when their right to move and reside freely within the canton of Aargau was granted. On 24 September 1856, the ": null
    },
    {
        "Swiss Federal Council": "Swiss Federal Council"
    },
    {
        " granted them full political rights within Aargau, as well as broad business rights; however the majority Christian population did not abide by these new liberal laws fully. The time of 1860 saw the canton government voting to grant suffrage in all local rights and to give their communities autonomy. Before the law was enacted, it was repealed due to vocal opposition led by the ": null
    },
    {
        "Ultramonte Party": "Ultramontanism"
    },
    {
        ". Finally, the federal authorities in July 1863, granted all Jews full rights of citizens. However, they did not receive all of the rights in Endingen and Lengn until a resolution of the ": null
    },
    {
        "Grand Council": "Grand Council Of Aargau"
    },
    {
        ", on 15 May 1877, granted citizens rights to the members of the Jewish communities of those places, giving them charters under the names of New Endingen and New Lengnau.  The ": null
    },
    {
        "Swiss Jewish Kulturverein": "Swiss Jewish Kulturverein"
    },
    {
        " was instrumental in this fight from its founding in 1862 until it was dissolved 20 years later. During this period of diminished rights, they were not even allowed to bury their dead in Swiss soil and had to bury their dead on an island called  Judenäule  on the ": null
    },
    {
        "Rhine": "Rhine"
    },
    {
        " near ": null
    },
    {
        "Waldshut": "Waldshut-Tiengen"
    },
    {
        ". Beginning in 1603, the deceased Jews of the ": null
    },
    {
        "Surbtal": "Surbtal"
    },
    {
        " communities were buried on the river island which was leased by the Jewish community. As the island was repeatedly flooded and devastated, in 1750 the ": null
    },
    {
        "Surbtal Jews": "Surbtal Jews"
    },
    {
        " asked the  Tagsatzung  to establish the ": null
    },
    {
        "Endingen cemetery": "Jüdischer Friedhof Endingen"
    },
    {
        " in the vicinity of their communities.            The capital of the canton is ": null
    },
    {
        "Aarau": "Aarau"
    },
    {
        ", which is located on its western border, on the ": null
    },
    {
        "Aare": "Aare"
    },
    {
        ". The canton borders ": null
    },
    {
        "Germany": "Germany"
    },
    {
        "  to the north, the Rhine forming the border. To the west lie the Swiss cantons of ": null
    },
    {
        "Basel-Landschaft": "Basel-Landschaft"
    },
    {
        ", ": null
    },
    {
        "Solothurn": "Canton Of Solothurn"
    },
    {
        " and ": null
    },
    {
        "Bern": "Canton Of Bern"
    },
    {
        "; the ": null
    },
    {
        "canton of Lucerne": "Canton Of Lucerne"
    },
    {
        " lies south, and ": null
    },
    {
        "Zürich": "Canton Of Zürich"
    },
    {
        " and ": null
    },
    {
        "Zug": "Canton Of Zug"
    },
    {
        " to the east. Its total area is . It contains both large rivers, the ": null
    },
    {
        "Aare": "Aare"
    },
    {
        " and the ": null
    },
    {
        "Reuss": "Reuss"
    },
    {
        ".      The canton of Aargau is one of the least mountainous Swiss cantons, forming part of a ": null
    },
    {
        "great table-land": "Swiss Plateau"
    },
    {
        ", to the north of the ": null
    },
    {
        "Alps": "Swiss Alps"
    },
    {
        " and the east of the ": null
    },
    {
        "Jura": "Jura Mountains"
    },
    {
        ", above which rise low hills. The surface of the country is diversified with undulating tracts and well-wooded hills, alternating with fertile valleys watered mainly by the Aare and its tributaries. The valleys alternate with hills, many of which are wooded. Slightly over one-third of the canton is wooded , while nearly half is used from farming .  or about 2.4% of the canton is considered unproductive, mostly lakes  and streams. With a population density of 450/km 2 , the canton has a relatively high amount of land used for human development, with  or about 15% of the canton developed for housing or transportation.      It contains the hot sulphur springs of ": null
    },
    {
        "Baden": "Baden, Switzerland"
    },
    {
        " and ": null
    },
    {
        "Schinznach-Bad": "Schinznach-Bad"
    },
    {
        ", while at ": null
    },
    {
        "Rheinfelden": "Rheinfelden"
    },
    {
        " there are very extensive saline springs. Just below ": null
    },
    {
        "Brugg": "Brugg"
    },
    {
        " the ": null
    },
    {
        "Reuss": "Reuss"
    },
    {
        " and the ": null
    },
    {
        "Limmat": "Limmat"
    },
    {
        " join the Aar, while around Brugg are the ruined castle of ": null
    },
    {
        "Habsburg": "Habsburg"
    },
    {
        ", the old convent of ": null
    },
    {
        "Königsfelden": "Königsfelden Abbey"
    },
    {
        " and the remains of the ": null
    },
    {
        "Roman": "Ancient Rome"
    },
    {
        " settlement of Vindonissa .     ": null
    },
    {
        "Fahr Monastery": "Fahr Monastery"
    },
    {
        " forms a small ": null
    },
    {
        "exclave": "Enclave And Exclave"
    },
    {
        " of the canton, otherwise surrounded by the ": null
    },
    {
        "canton of Zürich": "Canton Of Zürich"
    },
    {
        ", and since 2008 is part of the Aargau municipality of ": null
    },
    {
        "Würenlos": "Würenlos"
    },
    {
        ".               Aargau is divided into 11 districts:   ": null
    },
    {
        "Aarau": "Aarau"
    },
    {
        " with capital ": null
    },
    {
        "Aarau": "Aarau"
    },
    {
        " Baden": "Baden"
    },
    {
        " with capital ": null
    },
    {
        "Baden": "Baden, Switzerland"
    },
    {
        " Bremgarten": "Bremgarten"
    },
    {
        " with capital ": null
    },
    {
        "Bremgarten": "Bremgarten Ag"
    },
    {
        " Brugg": "Brugg"
    },
    {
        " with capital ": null
    },
    {
        "Brugg": "Brugg, Switzerland"
    },
    {
        " Kulm": "Kulm"
    },
    {
        " with capital ": null
    },
    {
        "Unterkulm": "Unterkulm"
    },
    {
        " Laufenburg": "Laufenburg"
    },
    {
        " with capital ": null
    },
    {
        "Laufenburg": "Laufenburg, Switzerland"
    },
    {
        " Lenzburg": "Lenzburg"
    },
    {
        " with capital ": null
    },
    {
        "Lenzburg": "Lenzburg"
    },
    {
        " Muri": "Muri"
    },
    {
        " with capital ": null
    },
    {
        "Muri": "Muri, Aargau"
    },
    {
        " Rheinfelden": "Rheinfelden"
    },
    {
        " with capital ": null
    },
    {
        "Rheinfelden": "Rheinfelden"
    },
    {
        " Zofingen": "Zofingen"
    },
    {
        " with capital ": null
    },
    {
        "Zofingen": "Zofingen"
    },
    {
        " Zurzach": "Zurzach"
    },
    {
        " with capital ": null
    },
    {
        "Zurzach": "Zurzach"
    },
    {
        "     The most recent change in district boundaries occurred in 2010 when ": null
    },
    {
        "Hottwil": "Hottwil"
    },
    {
        " transferred from Brugg to Laufenburg, following its merger with other municipalities, all of which were in Laufenburg.          There are 213 municipalities in the canton of Aargau. As with most Swiss cantons there has been a trend since the early 2000s for municipalities to merge, though mergers in Aargau have so far been less radical than in other cantons.       The ": null
    },
    {
        "blazon": "Blazon"
    },
    {
        " of the ": null
    },
    {
        "coat of arms": "Coat Of Arms"
    },
    {
        " is Per pale, dexter: sable, a fess wavy argent, charged with two cotises wavy azure; sinister: sky blue, three mullets of five argent.      The flag and arms of Aargau date to 1803 and are an original design by Samuel Ringier-Seelmatter; the current official design, specifying the stars as five-pointed, dates to 1930.       Aargau has a population  of . , 21.5% of the population are resident foreign nationals. Over the last 10 years the population has changed at a rate of 11%. Migration accounted for 8.7%, while births and deaths accounted for 2.8%.  Most of the population  speaks German as their first language, Italian is the second most common and ": null
    },
    {
        "Serbo-Croatian": "Serbo-Croatian"
    },
    {
        " is the third . There are 4,151 people who speak French and 618 people who speak ": null
    },
    {
        "Romansh": "Romansh Language"
    },
    {
        ".     Of the population in the canton, 146,421 or about 26.7% were born in Aargau and lived there in 2000. There were 140,768 or 25.7% who were born in the same canton, while 136,865 or 25.0% were born somewhere else in Switzerland, and 107,396 or 19.6% were born outside of Switzerland.     , children and teenagers make up 24.3% of the population, while adults make up 62.3% and seniors make up 13.4%.     , there were 227,656 people who were single and never married in the canton. There were 264,939 married individuals, 27,603 widows or widowers and 27,295 individuals who are divorced.      , there were 224,128 private households in the canton, and an average of 2.4 persons per household. There were 69,062 households that consist of only one person and 16,254 households with five or more people. , the construction rate of new housing units was 6.5 new units per 1000 residents. The vacancy rate for the canton, , was 1.54%.     The majority of the population is centered on one of three areas: the ": null
    },
    {
        "Aare Valley": "Aare Valley"
    },
    {
        ", the side branches of the Aare Valley, or along the ": null
    },
    {
        "Rhine": "Rhine"
    },
    {
        ".       The historical population is given in the following chart:        Colors   id:lightgrey value:gray   id:darkgrey value:gray   ImageSize width:800 height:500   PlotArea top:10 left: 100 bottom:90 right:100   Legend columns:3 left:220 top:70 columnwidth:160   AlignBars justify   DateFormat x.y   Period from:0 till:550000   TimeAxis orientation:vertical   AlignBars justify   ScaleMajor gridcolor:darkgrey increment:110000 start:0   ScaleMinor gridcolor:lightgrey increment:22000 start:0   Colors   id:TO value:yellowgreen legend:Total   id:GE value:teal legend:German_Speaking   id:IT value:green legend:Italian_Speaking   id:PR value:lightpurple legend:Protestant   id:CA value:oceanblue legend:Catholic   id:SW value:red legend:Swiss   PlotData   color:yellowgreen width:60 mark: align:center   bar:1850 from:start till:199852 text: 199,852 color:TO   bar:1900 from:start till:206498 text: 206,498 color:TO   bar:1950 from:start till:300782 text: 300,782 color:TO   bar:1990 from:start till:507508 text: 507,508 color:TO   bar:2000 from:start till:547493 text: 547,493 color:TO   LineData   points: color:GE   points: color:GE   points: color:GE   points: color:IT   points: color:IT   points: color:IT   points: color:PR   points: color:PR   points: color:PR   points: color:PR   points: color:CA   points: color:CA   points: color:CA   points: color:CA   points: color:SW   points: color:SW   points: color:SW            In the 2011 ": null
    },
    {
        "federal election": "Swiss Federal Election, 2011"
    },
    {
        ", the most popular party was the ": null
    },
    {
        "SVP": "Swiss Peoples Party"
    },
    {
        " which received 34.7% of the vote. The next three most popular parties were the ": null
    },
    {
        "SP/PS": "Social Democratic Party Of Switzerland"
    },
    {
        " , the ": null
    },
    {
        "FDP": "Fdp.The Liberals"
    },
    {
        " and the ": null
    },
    {
        "CVP": "Christian Democratic Peoples Party Of Switzerland"
    },
    {
        " .      The SVP received about the same percentage of the vote as they did in the ": null
    },
    {
        "2007 Federal election": "Swiss Federal Election, 2007"
    },
    {
        " . The SPS retained about the same popularity , the FDP retained about the same popularity and the CVP retained about the same popularity .           : FDP before 2009, FDP.The Liberals after 2009   : indicates that the party was not on the ballot in this canton.   : Part of the GPS          From the , 219,800 or 40.1% were ": null
    },
    {
        "Roman Catholic": "Roman Catholic"
    },
    {
        ", while 189,606 or 34.6% belonged to the ": null
    },
    {
        "Swiss Reformed Church": "Swiss Reformed Church"
    },
    {
        ". Of the rest of the population, there were 11,523 members of an ": null
    },
    {
        "Orthodox": "Eastern Orthodox Church"
    },
    {
        " church , there were 3,418 individuals who belonged to the ": null
    },
    {
        "Christian Catholic Church": "Christian Catholic Church Of Switzerland"
    },
    {
        ", and there were 29,580 individuals who belonged to another Christian church. There were 342 individuals who were ": null
    },
    {
        "Jewish": "Jewish"
    },
    {
        ", and 30,072 who were ": null
    },
    {
        "Muslim": "Islam"
    },
    {
        ". There were 1,463 individuals who were ": null
    },
    {
        "Buddhist": "Buddhism"
    },
    {
        ", 2,089 individuals who were ": null
    },
    {
        "Hindu": "Hinduism"
    },
    {
        " and 495 individuals who belonged to another church. 57,573 belonged to no church, are agnostic or ": null
    },
    {
        "atheist": "Atheism"
    },
    {
        ", and 15,875 individuals did not answer the question.       In Aargau about 212,069 or of the population have completed non-mandatory ": null
    },
    {
        "upper secondary education": "Education In Switzerlandsecondary"
    },
    {
        ", and 70,896 or have completed additional higher education . Of the 70,896 who completed tertiary schooling, 63.6% were Swiss men, 20.9% were Swiss women, 10.4% were non-Swiss men and 5.2% were non-Swiss women.            , Aargau had an unemployment rate of 3.6%. , there were 11,436 people employed in the ": null
    },
    {
        "primary economic sector": "Primary Sector Of The Economy"
    },
    {
        " and about 3,927 businesses involved in this sector. 95,844 people were employed in the ": null
    },
    {
        "secondary sector": "Secondary Sector Of The Economy"
    },
    {
        " and there were 6,055 businesses in this sector. 177,782 people were employed in the ": null
    },
    {
        "tertiary sector": "Tertiary Sector Of The Economy"
    },
    {
        ", with 21,530 businesses in this sector.      the total number of ": null
    },
    {
        "full-time equivalent": "Full-Time Equivalent"
    },
    {
        " jobs was 238,225. The number of jobs in the primary sector was 7,167, of which 6,731 were in agriculture, 418 were in forestry or lumber production and 18 were in fishing or fisheries. The number of jobs in the secondary sector was 90,274 of which 64,089 or were in manufacturing, 366 or were in mining and 21,705 were in construction. The number of jobs in the tertiary sector was 140,784. In the tertiary sector; 38,793 or 27.6% were in the sale or repair of motor vehicles, 13,624 or 9.7% were in the movement and storage of goods, 8,150 or 5.8% were in a hotel or restaurant, 5,164 or 3.7% were in the information industry, 5,946 or 4.2% were the insurance or financial industry, 14,831 or 10.5% were technical professionals or scientists, 10,951 or 7.8% were in education and 21,952 or 15.6% were in health care.      Of the working population, 19.5% used public transportation to get to work, and 55.3% used a private car. Public transportation – bus and train – is provided by ": null
    },
    {
        "Busbetrieb Aarau AG": "Busbetrieb Aarau Ag"
    },
    {
        ".     The farmland of the canton of Aargau is some of the most fertile in Switzerland. ": null
    },
    {
        "Dairy farming": "Dairy Farming"
    },
    {
        ", cereal and fruit farming are among the cantons main economic activities. The canton is also industrially developed, particularly in the fields of ": null
    },
    {
        "electrical engineering": "Electrical Engineering"
    },
    {
        ", precision instruments, iron, steel, cement and ": null
    },
    {
        "textiles": "Textiles"
    },
    {
        ".     Three of Switzerlands five nuclear power plants are in the canton of Aargau . Additionally, the many rivers supply enough water for numerous hydroelectric power plants throughout the canton. The canton of Aargau is often called the energy canton .     A significant number of people commute into the financial center of the city of ": null
    },
    {
        "Zürich": "Zürich"
    },
    {
        ", which is just across the cantonal border. As such the per capita cantonal income is 49,209 ": null
    },
    {
        "CHF": "Swiss Franc"
    },
    {
        ".       Tourism is significant, particularly for the hot springs at ": null
    },
    {
        "Baden": "Baden, Switzerland"
    },
    {
        " and ": null
    },
    {
        "Schinznach-Bad": "Schinznach-Bad"
    },
    {
        ", the ancient castles, the landscape, and the many old museums in the canton. ": null
    }
]