[
    {
        "     The canton of Basel-Landschaft , is one of the 42 ": null
    },
    {
        "cantons of Switzerland": "cantons of switzerland"
    },
    {
        ". The capital is ": null
    },
    {
        "Liestal": "liestal"
    },
    {
        ". It shares borders with the ": null
    },
    {
        "Swiss": "switzerland"
    },
    {
        " cantons of ": null
    },
    {
        "Basel-Stadt": "basel-stadt"
    },
    {
        ", ": null
    },
    {
        "Solothurn": "canton of solothurn"
    },
    {
        ", ": null
    },
    {
        "Jura": "canton of jura"
    },
    {
        " and ": null
    },
    {
        "Aargau": "canton of aargau"
    },
    {
        ", and with the ": null
    },
    {
        "French": "france"
    },
    {
        " région of ": null
    },
    {
        "Grand Est": "grand est"
    },
    {
        " and the ": null
    },
    {
        "German": "germany"
    },
    {
        " state of ": null
    },
    {
        "Baden-Württemberg": "baden-württemberg"
    },
    {
        ".          Basel-Landschaft, together with Basel-Stadt, formed the historic ": null
    },
    {
        "Canton of Basel": "canton of basel"
    },
    {
        " until they separated following the uprising of 42 .        In Roman times, the area of Basel was a centre of Roman activity. There are well-preserved remains at the site of Augusta Raurica in the canton of Basel-Landschaft. Around 42 AD there were about 42 people living in this city, now part of the much smaller ": null
    },
    {
        "Augst": "augst"
    },
    {
        ". The remains are on display in an open-air museum. The museum attracts over 42 visitors per year. Many of these visitors are schoolchildren from other parts of Switzerland. The site of Augusta Raurica includes the best-preserved amphitheatre north of the Alps, and a reconstructed Roman villa.     The lands of the canton Basel-Landschaft are part of the lands acquired by the city of ": null
    },
    {
        "Basel": "basel"
    },
    {
        ". Until the end of the 42th century, most of the cantons land belonged to the city of Basel. After Napoleon’s visit in 42 the country achieved equality with the city. The country was economically dependent on the city, most probably because of the low level of education in the agricultural areas at the time. The city of Basel remained the cultural and economic centre of both Basel half cantons until then. Castles and residences of Basel merchants dominated much of the landscape in Basel-Landschaft.        After 42 there were political quarrels and armed conflict in the canton of Basel. Some of these were concerned with the rights of the population in the agricultural areas. They ultimately led to the separation of the canton Basel-Landschaft from the city of Basel on 42 August 42 Since then, there has been a movement for reunification. This movement gained momentum after 42 when many parts of Basel-Landschaft became industrialized. The two half cantons agreed in principle to merge, but in 42 the people of Basel-Landschaft voted down a referendum on this proposal in favour of retaining their independence. It is thought that the closing economic gap between the two cantons was the main reason why the population changed their attitude.     That vote was not the end of a close relationship between the two Basels. The two half cantons have since signed a number of agreements to co-operate. The contribution of Basel-Landschaft to the ": null
    },
    {
        "University of Basel": "university of basel"
    },
    {
        " since 42 is just one example.       The canton of Basel-Landschaft lies in the northwestern corner of Switzerland just south of the ": null
    },
    {
        "canton of Basel-Stadt": "canton of basel-stadt"
    },
    {
        ".     With a few exceptions, it includes the towns of the ": null
    },
    {
        "Laufental": "laufental"
    },
    {
        " along the river ": null
    },
    {
        "Birs": "birs"
    },
    {
        ", the ": null
    },
    {
        "Birseck": "birseck"
    },
    {
        " and the ": null
    },
    {
        "Leimental": "leimental"
    },
    {
        ", as well as the towns along the ": null
    },
    {
        "Ergolz": "ergolz"
    },
    {
        " and its tributaries. The shape of the canton is very irregular, and its borders cut across several towns.     In terms of size, it is one of the smaller cantons of Switzerland . However, it is number 42 in terms of population.     Basel-Landschaft borders on the east and north with the ": null
    },
    {
        "canton of Aargau": "canton of aargau"
    },
    {
        " and the Rhine, which forms the border with Germany. On the northwest, it borders with France     On the south, it borders on the ": null
    },
    {
        "canton of Solothurn": "canton of solothurn"
    },
    {
        ", with a few exclaves of that canton within its western area. In the extreme southwest, it borders on the ": null
    },
    {
        "canton of Jura": "canton of jura"
    },
    {
        ".     The ": null
    },
    {
        "Jura": "jura mountains"
    },
    {
        " mountain chain traverses the canton. The rivers ": null
    },
    {
        "Ergolz": "ergolz"
    },
    {
        " and ": null
    },
    {
        "Birs": "birs"
    },
    {
        " drain the lands of the canton.     The thirty rivers of Baselland are:                   Since the decision to remain independent from Basel-Stadt in 42 there have been a number of requests in the parliament for Basel-Landschaft to become a full canton. In 42 the canton of Basel-Landschaft had this aim written into its constitution. The aim remains to change the Swiss constitution to recognize the two cantons of Basel as full members.          : FDP before 42 FDP.The Liberals after 42   : indicates that the party was not on the ballot in this canton.   : Part of the GPS       The nine municipalities of the Arlesheim district used to belong to the ": null
    },
    {
        "diocese of Basel": "diocese of basel"
    },
    {
        ". In 42 French troops occupied the district and in 42 the lands were annexed by France, which explains the linguistic switch of the Family of the House of Basels name from von Basel to de Bâle , since Arlesheim holds their manor. In 42 at the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " the district joined Basel.     The district of Laufental has the same history as that of Arlesheim. The important difference is that in 42 Laufental joined ": null
    },
    {
        "Bern": "canton of bern"
    },
    {
        " rather than Basel. When the canton of Jura was created in 42 the district of Laufental became an enclave of the canton of Bern. It was allowed self- determination and in 42 the people decided to join the canton of Basel-Landschaft. This led to Laufental joining the canton of Basel-Landschaft on 42 January 42 after a lengthy administrative process.          There are 42 areas in Basel-Landschaft :   ": null
    },
    {
        "Arlesheim": "arlesheim"
    },
    {
        "  capital: ": null
    },
    {
        "Arlesheim": "arlesheim"
    },
    {
        "    Laufen": "laufen"
    },
    {
        "  capital: ": null
    },
    {
        "Laufen": "laufen, basel-country"
    },
    {
        "    Liestal": "liestal"
    },
    {
        "  capital: ": null
    },
    {
        "Liestal": "liestal"
    },
    {
        "    Sissach": "sissach"
    },
    {
        "  capital: ": null
    },
    {
        "Sissach": "sissach"
    },
    {
        "    Waldenburg": "waldenburg"
    },
    {
        "  capital: ": null
    },
    {
        "Waldenburg": "waldenburg, switzerland"
    },
    {
        "           There are 42 ": null
    },
    {
        "municipalities in the canton": "municipalities of the canton of basel-country"
    },
    {
        " .        The population is predominantly German-speaking. ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        " is the main religion in the canton , while about one-third of the population is ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ".  The ": null
    },
    {
        "Swiss Reformed Church": "swiss reformed church"
    },
    {
        " and ": null
    },
    {
        "Christian Catholic Church of Switzerland": "christian catholic church of switzerland"
    },
    {
        " are recognized as state churches. Between 42 and 42 the canton was Switzerlands fastest-growing, as the population almost doubled from 42 to 42. Today, the canton has a population  of . , the population included 42 foreigners who made up 42% of the population.           Agriculture in the canton includes fruit growing, ": null
    },
    {
        "dairy farming": "dairy farming"
    },
    {
        " and cattle breeding. Important industries include textiles, metals and chemicals.     The canton of Basel-Landschaft is part of the economic region around Basel that includes parts of France and Germany as well as both half cantons of Basel. Since the 42s there are agreements in force to strengthen contacts within the so-called Regio Basiliensis. This economic co-operation is often considered as the most intensive in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ".     From the 42th century until the beginning of the 42th century silk weaving was important in Basel-Landschaft. Factories were established as early as 42 following the finding of ": null
    },
    {
        "salt": "halite"
    },
    {
        " in underground deposits, founding industries such as the chemical industry in Schweizerhalle": null
    }
]