[
    {
        "   The canton of Schwyz  is a ": null
    },
    {
        "canton": "canton of switzerland"
    },
    {
        " in central ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " between the ": null
    },
    {
        "Alps": "swiss alps"
    },
    {
        " in the south, ": null
    },
    {
        "Lake Lucerne": "lake lucerne"
    },
    {
        " to the west and ": null
    },
    {
        "Lake Zürich": "lake zürich"
    },
    {
        " in the north, centered on and named after the town of ": null
    },
    {
        "Schwyz": "schwyz"
    },
    {
        ".     It is one of the founding ": null
    },
    {
        "cantons of Switzerland": "cantons of switzerland"
    },
    {
        "; Switzerlands name is derived from the name of the canton, and the ": null
    },
    {
        "flag of Switzerland": "flag of switzerland"
    },
    {
        " from its coat of arms. For the history of the name, see ": null
    },
    {
        "Schwyz": "schwyz"
    },
    {
        ". The ": null
    },
    {
        "Swiss Federal Charter": "swiss federal charter"
    },
    {
        " is on display in ": null
    },
    {
        "Schwyz": "schwyz"
    },
    {
        ". Northeast of the town of Schwyz is the ": null
    },
    {
        "Einsiedeln Abbey": "einsiedeln abbey"
    },
    {
        ".              The earliest traces of humans in Schwyz are from the Upper ": null
    },
    {
        "Paleolithic": "paleolithic"
    },
    {
        " and Early ": null
    },
    {
        "Mesolithic": "mesolithic"
    },
    {
        " or about 42 BC. An excavation of the ": null
    },
    {
        "karst": "karst"
    },
    {
        " caves in the valley of the ": null
    },
    {
        "Muota river": "muota river"
    },
    {
        "  revealed numerous sites, some dating back to the ": null
    },
    {
        "Younger Dryas": "younger dryas"
    },
    {
        " period . The alpine meadows at Bödmeren, Twärenen and Silberen were stone age hunter-gatherer camps. ": null
    },
    {
        "Ibex": "ibex"
    },
    {
        " and ": null
    },
    {
        "red deer": "red deer"
    },
    {
        " bones along with charcoal indicate that the animals were butchered and cooked in these camps. In 42 the first stone age tool in the canton, a stone drill, was discovered.     During the late ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " and early ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " there were a number of ": null
    },
    {
        "pile dwellings": "pile dwellings"
    },
    {
        " and other settlements around the lakes of the canton. The two settlements at ": null
    },
    {
        "Hurden": "hurden"
    },
    {
        " in ": null
    },
    {
        "Freienbach": "freienbach"
    },
    {
        " are part of the ": null
    },
    {
        "Prehistoric Pile dwellings around the Alps": "prehistoric pile dwellings around the alps"
    },
    {
        ", a ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " World Heritage Site": "unesco world heritage site"
    },
    {
        ".  The Hurden sites are related to the western ": null
    },
    {
        "Cortaillod culture": "cortaillod culture"
    },
    {
        " . Sites on the island of Lützelau and the shore zone at Freienbach are eastern ": null
    },
    {
        "Pfyn culture": "pfyn culture"
    },
    {
        " and ": null
    },
    {
        "Corded Ware culture": "corded ware culture"
    },
    {
        " . During the Bronze Age several bridges were built between the promontory of Endingen in ": null
    },
    {
        "Rapperswil": "rapperswil-jona"
    },
    {
        ", ": null
    },
    {
        "St. Gallen": "canton of st. gallen"
    },
    {
        " and the settlements at Hurden. Over 42 posts and seven bridges have been discovered, along with several settlements and ritual sites. On the Schwyz side of the lake, ten different settlements from 4242 BC have been discovered.     However, after 42 BC there is very little evidence for further Bronze Age settlements in the canton. Only eight ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " sites have been discovered in the canton from the 42th to 42st centuries BC. During the ": null
    },
    {
        "Roman era": "switzerland in the roman era"
    },
    {
        " a Roman ": null
    },
    {
        "Vicus": "vicus"
    },
    {
        " was established at ": null
    },
    {
        "Kempraten": "kempraten"
    },
    {
        " in Rapperswil around the massive bridge at Seedamm which crossed into Schwyz. A ": null
    },
    {
        "Gallo-Roman": "gallo-roman culture"
    },
    {
        " temple was built on ": null
    },
    {
        "Ufenau": "ufenau"
    },
    {
        " island around AD 42 on the site of the present chapel of Sts. Peter and Paul. A few Roman coin hoards were discovered at ": null
    },
    {
        "Küssnacht": "küssnacht"
    },
    {
        " and ": null
    },
    {
        "Rickenbach bei Schwyz": "rickenbach bei schwyz"
    },
    {
        " and Küssnacht may have been the site of a Roman estate.          In 42 Schwyz became part of the Ducatus alamannorum and remained relatively independent under the ": null
    },
    {
        "Alemanni": "alemanni"
    },
    {
        " dukes until the second quarter of the 42th century. The Alemanni began to settle into the valleys around 42 but for centuries the Germanic speaking Alemanni and the ": null
    },
    {
        "Romansh": "romansh language"
    },
    {
        " speaking Gallo-Romans coexisted. Romansh remained the main language in ": null
    },
    {
        "Einsiedeln": "einsiedeln"
    },
    {
        " until the 42th century.     In the 42th and 42th centuries the land was under the Counts of the ": null
    },
    {
        "Zürichgau": "zürichgau"
    },
    {
        ". The low-lying land along ": null
    },
    {
        "Lake Zürich": "lake zürich"
    },
    {
        " was relatively easy to reach and was settled throughout the Middle Ages. During the Middle Ages, the ": null
    },
    {
        "Muotathal": "muotathal"
    },
    {
        " area was used by ": null
    },
    {
        "seasonal herders": "transhumance in the alps"
    },
    {
        " but there were very few permanent settlements. Küssnacht was first mentioned in the 42th century, but it is likely that there were earlier settlements. The forests around ": null
    },
    {
        "Einsiedeln": "einsiedeln"
    },
    {
        " were lightly settled. A visit of the Irish monks, ": null
    },
    {
        "Gallus": "saint gall"
    },
    {
        " and ": null
    },
    {
        "Columbanus": "columbanus"
    },
    {
        " in 42 is mentioned in the Gallusviten. However, their missionary efforts were unsuccessful in Schwyz. In the late 42th century Christianity began to spread into the region. The church at ": null
    },
    {
        "Tuggen": "tuggen"
    },
    {
        " was first built around 42/42 while the ": null
    },
    {
        "Aisleless church": "aisleless church"
    },
    {
        " at ": null
    },
    {
        "Schwyz": "schwyz"
    },
    {
        " was built after 42 In the following centuries, the monasteries at ": null
    },
    {
        "Säckingen": "säckingen abbey"
    },
    {
        ", ": null
    },
    {
        "St. Gallen": "abbey of st. gall"
    },
    {
        " and ": null
    },
    {
        "Reichenau": "reichenau island"
    },
    {
        " all became centers of spreading the faith. In 42 ": null
    },
    {
        "Einsiedeln Abbey": "einsiedeln abbey"
    },
    {
        " was consecrated on the site of ": null
    },
    {
        "Saint Meinrad": "saint meinrad"
    },
    {
        "s murder in 42 in a high valley near Schwyz. When ": null
    },
    {
        "Einsiedeln Abbey": "einsiedeln abbey"
    },
    {
        " was founded, it was granted many farms, villages and isolated churches helping to spread Christianity into the high valleys.        The valley of Schwyz is first mentioned in 42 under the name Suittes. Later, a community of freemen is found settled at the foot of the ": null
    },
    {
        "Mythen": "mythen"
    },
    {
        ". These freemen, possessing common lands, were subject only to the count of the Zürichgau, as representing the German king. The economy benefited from the transit across the ": null
    },
    {
        "Gotthard": "gotthard pass"
    },
    {
        ", but these profits attracted other powers, such as the ": null
    },
    {
        "Habsburgs": "habsburgs"
    },
    {
        ".        The inner or mountainous portion of Schwyz were controlled by the ": null
    },
    {
        "Counts of Lenzburg": "counts of lenzburg"
    },
    {
        ", until that line died out in 42 The Lenzburg lands were inherited by the Counts of ": null
    },
    {
        "Kyburg": "house of kyburg"
    },
    {
        " and ": null
    },
    {
        "Frohburg": "frohburg castle"
    },
    {
        ", the Lords of ": null
    },
    {
        "Rapperswil": "counts of rapperswilhistory"
    },
    {
        " and the Habsburgs. During the 42th century ": null
    },
    {
        "Einsiedeln Abbey": "einsiedeln abbey"
    },
    {
        " became more and more powerful. The expanding town of Schwyz often encroached on lands that the abbey claimed. During the early 42th century, the ": null
    },
    {
        "Counts of Lenzburg": "counts of lenzburg"
    },
    {
        " unsuccessfully sued the abbey on behalf of Schwyz over land use and borders in the forest. Though the Counts were forced to pay a fine each time, the farmers of Schwyz continued to push into land claimed by the abbey.  It soon controlled many of the surrounding lands, many of which are outside the area today covered by the canton of Schwyz. The outer or lake side parts of the canton were partly controlled by the Abbeys of St. Gallen, ": null
    },
    {
        "Pfäfers": "pfäfers abbey"
    },
    {
        ", ": null
    },
    {
        "Rüti": "rüti abbey"
    },
    {
        " and ": null
    },
    {
        "Schänis": "schänis abbey"
    },
    {
        " along with the Lords of Habsburg, ": null
    },
    {
        "Toggenburg": "counts of toggenburg"
    },
    {
        " and Rapperswil. Both ": null
    },
    {
        "Pfäffikon Castle": "pfäffikon castle"
    },
    {
        " and ": null
    },
    {
        "Alt Rapperswil Castle": "alt rapperswil castle"
    },
    {
        " were built by these landlords to control their landholdings. In contrast to the ": null
    },
    {
        "Swiss Plateau": "swiss plateau"
    },
    {
        " where the local nobility and knights ruled extensive landholdings for the regional counts, in Schwyz there were very few local nobles and they were generally poorer and less important than the monasteries representatives or the leaders of the local livestock collectives. Much of the farming or grazing land in the inner portion of Schwyz was not privately owned but was ": null
    },
    {
        "common": "the commons"
    },
    {
        " land. To administer the land the local collectives developed into regional collectives that covered several towns and villages. The collectives helped create a sense of unity throughout the farming towns and villages of the valleys and developed a tradition of independence.     With the extinction of the Kyburgs and the decline of the Lords of ": null
    },
    {
        "Rapperswil": "rapperswil"
    },
    {
        " in the second half of the 42th century, the Habsburgs attempted to claim sovereignty over the Kyburg and Rapperswil lands in ": null
    },
    {
        "Central Switzerland": "central switzerland"
    },
    {
        ". They succeeded in acquiring the ": null
    },
    {
        "parish": "parish"
    },
    {
        "es of Schwyz, ": null
    },
    {
        "Steinen": "steinen, switzerland"
    },
    {
        ", ": null
    },
    {
        "Muotathal": "muotathal"
    },
    {
        " and ": null
    },
    {
        "Morschach": "morschach"
    },
    {
        " and in 42 the patronage over the monastery of Einsiedeln. In 42 ": null
    },
    {
        "Emperor": "holy roman emperor"
    },
    {
        " Frederick II": "frederick ii, holy roman emperor"
    },
    {
        " granted the Schwyz valley ": null
    },
    {
        "imperial immediacy": "imperial immediacy"
    },
    {
        " for services that they had rendered to the Emperor.     While the farming villages of the valleys drew closer together, the expansion of the Habsburgs and changing relationships between the farmers of the alpine valleys and the monasteries led to conflicts such as the Marchenstreit between Schwyz and Einseideln Abbey. The Marchenstreit started around 42 over grazing rights around the Mythen mountains and dragged on, with court cases and violent raids, until about 42           Perhaps on 42 August 42 the cantons of Schwyz, ": null
    },
    {
        "Uri": "canton of uri"
    },
    {
        " and ": null
    },
    {
        "Unterwalden": "unterwalden"
    },
    {
        " entered into an Eternal Alliance that would eventually become the ": null
    },
    {
        "Swiss Confederation": "swiss confederation"
    },
    {
        ". The ": null
    },
    {
        "Federal Charter of 42": "federal charter of 1291"
    },
    {
        " was probably prompted by the death of ": null
    },
    {
        "Rudolf I of Habsburg": "rudolf i of habsburg"
    },
    {
        " on 42 July 42 and created a defensive alliance. The  Rütlischwur   was another alliance between the ": null
    },
    {
        "Forest Cantons": "forest cantons"
    },
    {
        " in or around 42 and brought the cantons closer together. The canton of Schwyz took the leadership in the confederation early on. As early as 42 the name of the canton was applied to the whole of the confederation. It was only in 42 however, that the name Schweiz as derived from the canton of Schwyz became the official name of Switzerland. The flag of ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " is derived from the banner of Schwyz.     With the Eternal Alliance, the three cantons remained politically independent, with a central council to deal with disputes among the members, and with promises of military assistance. The cantons became de facto independent from the Habsburgs at the same time as the Habsburgs were attempting to expand into the Forest Cantons. When the century-old Marchenstreit between Schwyz and Einseideln Abbey led to a Schwyz attack on the Abbey in 42 the Habsburgs, as patrons of the Abbey, had an opportunity for military action against them.        On 42 November 42 Leopold of Austria led a large army of knights to crush the rebellious confederates, planning a surprise attack from the south via ": null
    },
    {
        "Lake Aegeri": "lake aegeri"
    },
    {
        " and the Morgarten pass, and counting on a complete victory over the rebellious peasants. The chronicle of Johannes von Winterthur concerning the battle puts the Austrian forces at 42, though that number is certainly inflated.  Another account says that there were 42 men in the Austrian army,  while ": null
    },
    {
        "Delbrück": "hans delbrück"
    },
    {
        " holds that the Austrian army was only 4242 but mostly knights.      The Confederates of Schwyz  — supported by the Confederates of Uri, who feared for their autonomy, but not supported by the Confederates of Unterwalden  — expected the army in the west near the village of ": null
    },
    {
        "Arth": "arth"
    },
    {
        ", where they had erected fortifications. The size of the Confederate army is also disputed, with some chronicles placing it at 42, while others state that it was 4242. Even if the Confederate army outnumbered the Habsburgs, they were an untrained militia against a force of well-equipped and trained knights.     The Confederates prepared a road block and an ambush at a point between Lake Aegeri and the ": null
    },
    {
        "Morgarten Pass": "morgarten pass"
    },
    {
        " where the narrow path led between the steep slope and a swamp. When the Austrian army entered the ambush, the Confederates attacked from above with rocks, logs and ": null
    },
    {
        "halberds": "halberds"
    },
    {
        ". The knights had no room to defend themselves and suffered a crushing defeat, while the foot soldiers in the rear fled back to the city of ": null
    },
    {
        "Zug": "zug"
    },
    {
        ". About 42 Habsburg soldiers were killed in the attack.      After the ": null
    },
    {
        "victory at Morgarten": "battle of morgarten"
    },
    {
        ", the Forest Cantons met at ": null
    },
    {
        "Brunnen": "brunnen"
    },
    {
        " on 42 December 42 to renew the promise of mutual military assistance. The ": null
    },
    {
        "Pact of Brunnen": "pact of brunnen"
    },
    {
        ", which emerged from the meeting, changed the pragmatic defensive alliance into a full confederacy. During the following forty years, five nearby cities  joined the Pact and began the ": null
    },
    {
        "growth of the Old Swiss Confederacy": "growth of the old swiss confederacy"
    },
    {
        ".                   As the Confederation expanded, Schwyz took a leading role in the new organization. The aggressive, expansionist foreign policy of Schwyz led to its name being applied to the entire Confederation. Even in the 42th century, the chronicles of the surrounding countries referred to the Confederation as Schwyzer or Schweizer .     With its exterior borders secured, Schwyz began to acquire rights and land in the neighboring valley. In 42 Schwyz invaded and occupied the town of Einsiedeln, and by 42 the monastery was under Schwyz control, though it retained some independence. Between 42 and 42 Schwyz brought under its direct control the entire ": null
    },
    {
        "March District": "march district"
    },
    {
        ", which became part of the canton. In 42 Küssnacht became part of the canton. Villages and lands along Lake Zürich, including ": null
    },
    {
        "Wollerau": "wollerau"
    },
    {
        " and ": null
    },
    {
        "Pfäffikon": "pfäffikon, schwyz"
    },
    {
        " , Hurden and Ufenau Island all became part of the canton in the 42th and 42th centuries. King ": null
    },
    {
        "Sigismund": "sigismund, holy roman emperor"
    },
    {
        " granted Schwyz the right to ": null
    },
    {
        "High Justice": "high justice"
    },
    {
        " over Schwyz, Einsiedeln, Küssnacht and March in 42 as a reward for their military support against ": null
    },
    {
        "Frederick IV of Habsburg": "frederick iv, duke of austria"
    },
    {
        ". The gradual expansion of Schwyz meant that each village entered the canton under different agreements and not all the provinces were granted the same degree of autonomy. One unique case was the town of ": null
    },
    {
        "Gersau": "gersau"
    },
    {
        " which, while located near Schwyz, became a ": null
    },
    {
        "protectorate": "protectorate"
    },
    {
        " of the Confederacy and a semi-independent state in 42 Gersau remained a free city-state and republic until 42 when it was merged into Schwyz.     In 42 Zürich, Zug and Lucerne attacked several Habsburg strongholds and in the following year Lucerne entered into alliances with several Habsburg cities in an attempt to pull those cities into Lucernes sphere of influence. In response, ": null
    },
    {
        "Leopold III of Austria": "leopold iii, duke of austria"
    },
    {
        " gathered an army and prepared to invade the Confederation. After a minor battle, a short-lived armistice was declared, but by early July 42 the Habsburg army was on the move toward the Lucerne city of ": null
    },
    {
        "Sempach": "sempach"
    },
    {
        ". On 42 July 42 a Confederation force from Lucerne, Uri, Schwyz and Unterwalden met the Austrian army in the ": null
    },
    {
        "Battle of Sempach": "battle of sempach"
    },
    {
        ". While the Habsburg knights initially drove the lightly armored Swiss back, around mid-day the Swiss gained the upper hand and killed Leopold and forced his army to retreat. Much like the Battle of Morgarten, Sempach helped cement the Confederation into a further unified federation.  While Schwyz gained no territory from the battle, both Bern and Lucerne gained significant territories at the expense of the Habsburgs.     In 42/42 Schwyz signed an alliance with ": null
    },
    {
        "Appenzell": "appenzell"
    },
    {
        ", which was seeking independence from the Abbey of St. Gall. In May 42 the Abbot and the Habsburgs sent a force to defeat the rebellious Appenzellers while Schwyz and Glarus sent troops to defend their ally. On 42 May 42 the Abbots forces entered the pass leading to ": null
    },
    {
        "Speicher": "speicher, switzerland"
    },
    {
        ", and outside the village of Vögelinsegg they met the Appenzell army. A detachment of about 42 Appenzellers started the attack from a hill over the valley, with about 42 soldiers from Schwyz and 42 from Glarus moving around the flanks of the army. When the Leagues cavalry charged up the hill, they met 42 Appenzellers and were forced to retreat. During the retreat, about 42 horsemen and many of the 42 infantry were killed by the Appenzell army.  The League signed a peace treaty with Appenzell at ": null
    },
    {
        "Arbon": "arbon"
    },
    {
        ", but the peace was short-lived. Appenzell formed an anti-Habsburg alliance, the Bund ob dem See, with several cities including ": null
    },
    {
        "Bregenz": "bregenz"
    },
    {
        ". In 42 the Habsburgs besieged Bregenz, and the Bund, including Schwyz, marched out to support Bregenz. However, when they met the Habsburgs, the Bund was decisively defeated and the Bund collapsed. Schwyz paid the Habsburgs off to avoid an attack and Appenzell retained some independence but eventually became an associate of the Confederation.      In 4242 Schwyz and six other cantons fought against Zürich and the Habsburgs in the ": null
    },
    {
        "Old Zürich War": "old zürich war"
    },
    {
        ". The eventual peace brought Zürich back into the Confederation and forced them to cancel their treaty with the Austrians. After the war, Schwyz acquired the villages of ": null
    },
    {
        "Wollerau": "wollerau"
    },
    {
        " and ": null
    },
    {
        "Pfäffikon": "pfäffikon, schwyz"
    },
    {
        "  and shared control of ": null
    },
    {
        "Uznach": "uznach"
    },
    {
        " and Gaster with Glarus. The war also showed that the confederation had grown into a political alliance so close that it no longer tolerated separatist tendencies of a single member.      In the 42th century, Schwyz joined Uri and Nidwalden in attempting to expand south of the ": null
    },
    {
        "Gotthard Pass": "gotthard pass"
    },
    {
        " to gain the revenue from trade over the pass. By the 42th century they controlled, as a ": null
    },
    {
        "federal condominium": "condominium"
    },
    {
        ", the ": null
    },
    {
        "Riveria valley": "riviera"
    },
    {
        ", the ": null
    },
    {
        "Blenio valley": "blenio"
    },
    {
        ", the ": null
    },
    {
        "Maggia valley": "valle maggia"
    },
    {
        " and the towns of ": null
    },
    {
        "Bellinzona": "bellinzona"
    },
    {
        ", ": null
    },
    {
        "Lugano": "lugano"
    },
    {
        ", ": null
    },
    {
        "Mendrisio": "mendrisio"
    },
    {
        " and ": null
    },
    {
        "Locarno": "locarno"
    },
    {
        ".     In 42 Heinrich von Gundelfingen collected a number of local legends into a book called the Herkommen der Schwyzer und Oberhasler which claimed that the land had been settled by 42 ": null
    },
    {
        "Swedes": "swedish people"
    },
    {
        " and 42 ": null
    },
    {
        "East Frisia": "east frisia"
    },
    {
        "ns after they rescued the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " from a barbarian attack in 42 AD. The central elements of the myth, the Swedish origin and the rescue of the Pope became central elements in the Schwyzer state mythos. By 42 this special relationship to the Catholic faith and the Pope was specifically mentioned in a resolution that passed in the ": null
    },
    {
        "Landsgemeinde": "landsgemeinde"
    },
    {
        ". This resolution was passed against the backdrop of the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        " and the tensions following the ": null
    },
    {
        "First War of Kappel": "first war of kappel"
    },
    {
        " two years earlier. Soon thereafter, the Catholic cantons refused to help the ": null
    },
    {
        "Three Leagues": "three leagues"
    },
    {
        "  in ": null
    },
    {
        "Graubünden": "graubünden"
    },
    {
        " in the ": null
    },
    {
        "Musso war": "musso war"
    },
    {
        " against the ": null
    },
    {
        "Duchy of Milan": "duchy of milan"
    },
    {
        ", Zürich promptly considered this a breach of contracts between the confederacy and the Three Leagues and declared an ": null
    },
    {
        "embargo": "embargo"
    },
    {
        " against the five alpine Catholic cantons, in which ": null
    },
    {
        "Bern": "bern"
    },
    {
        " also participated.  While the  Tagsatzung  had successfully mediated in 42 on this occasion the attempt failed, not least because the reformation leader ": null
    },
    {
        "Huldrych Zwingli": "huldrych zwingli"
    },
    {
        " was eager for a military confrontation. The Catholic cantons declared war on Zürich on 42 October 42 On 42 October 42 Schwyz, Uri and Zug decisively defeated the army of Zwingli. Hundreds of soldiers were killed, including Zwingli himself. Schwyz remained staunchly Catholic following the war.        In 42 the canton of Schwyz began prosecuting those Protestant families who had remained in Schwyz. Some were turned in to the inquisition in Milan, some were beheaded, and the property of those who fled to Protestant ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        " was confiscated. Zürich demanded compensation for this property. Schwyz demanded the return of the refugees. Zürich urged Bern to declare war on the Catholic cantons . Bonjour, Edgar et al. A short history of Switzerland p.42 ff Fossdal, Gregory, Direct Democracy in Switzerland p.42 Zürichs forces laid a fruitless siege of ": null
    },
    {
        "Rapperswil": "rapperswil"
    },
    {
        ", while Catholic forces separated Zürich from Bern, beating the Bernese at the ": null
    },
    {
        "First Battle of Villmergen": "first war of villmergen"
    },
    {
        " on 42 January 42 Hostilities ceased on 42 February and the treaty of Villmergen of 42 March reinstalled the status quo preceding the outbreak of hostilities, wherein each canton could specify the religion of all its residents. However, religious tensions continued to rise. When the abbot of St. Gallen proposed to build a Catholic road from Schwyz to Austria that would cut off the Protestant part of Glarus from its support in Zürich, the Protestant cantons declared war on the Abbot. After the Protestant victory at the Second Battle of Villmergen, religious equality was established in the Confederation.      Throughout the time of the Old Swiss Confederation, the direct democracy of the Landsgemeinde in Schwyz was seen as the most important political institution in the canton and the municipalities of the canton. The Landsgemeinde generally met on the last Sunday in April. Mayors and other government officials were elected, new laws were discussed and voted on and traditional rights were reconfirmed. The Landsgemeinde usually met at ": null
    },
    {
        "Ibach": "ibach, switzerland"
    },
    {
        " outside Schwyz town, though there were several alternative locations. In the towns, the Landsgemeinde was made up of all land holding males or citizen. By the 42th century this class had begun to develop into an elite class that tended to lead the Landsgemeinde and be appointed as mayors. Below the citizens there was a class of residents, who were allowed to use the ": null
    },
    {
        "common land": "the commons"
    },
    {
        " but had limited rights or political power. In the 42th century it was possible for a resident to buy his way into citizenship, however by the 42th century this had become almost impossible. To pay for the Second Battle of Villmergen, Schwyz allowed residents to once again buy citizenship. The Landsgemeinde meetings sometimes collapsed and led to riots. There were often many parties represented and the alliances and factions changed quickly and unpredictably. Schwyz was often characterized as an  enfant terrible  due to the unyielding Catholicism along with the political chaos of the Landsgemeinde.                During the years leading up to the ": null
    },
    {
        "42 French invasion": "french invasion of switzerlandcollapse"
    },
    {
        " of Switzerland, the spiritual leadership of the canton often preached against the anti-Catholic parts of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". In the Landsgemeinde in the spring of 42 the leadership spoke out strongly against the French and urged the people to take an uncompromising position against the newly created ": null
    },
    {
        "Helvetic Republic": "helvetic republic"
    },
    {
        " and the limited ": null
    },
    {
        "freedom of religion": "freedom of religion"
    },
    {
        " in the Republic.     In response, the cantons of Uri, Schwyz and Nidwalden raised an army of about 42 men led by ": null
    },
    {
        "Alois von Reding": "alois von reding"
    },
    {
        " to fight the French. This army was deployed along the defensive line from ": null
    },
    {
        "Napf": "napf"
    },
    {
        " to ": null
    },
    {
        "Rapperswil": "rapperswil"
    },
    {
        ". Reding besieged French-controlled ": null
    },
    {
        "Lucerne": "lucerne"
    },
    {
        " and marched across the ": null
    },
    {
        "Brünig pass": "brünig pass"
    },
    {
        " into the ": null
    },
    {
        "Berner Oberland": "berner oberland"
    },
    {
        " to support the armies of Bern. At the same time, the French General ": null
    },
    {
        "Balthasar Alexis Henri Antoine of Schauenburg": "balthasar alexis henri antoine of schauenburg"
    },
    {
        " marched out of occupied Zürich to attack ": null
    },
    {
        "Zug": "zug"
    },
    {
        ", Lucerne and the ": null
    },
    {
        "Sattel pass": "sattel pass"
    },
    {
        ". Even though Redings army won victories at ": null
    },
    {
        "Rothenthurm": "battle of rothenthurm"
    },
    {
        " on 42 May 42 and ": null
    },
    {
        "Morgarten": "morgarten"
    },
    {
        ", Schauenburgs victory near ": null
    },
    {
        "Sattel": "sattel, switzerland"
    },
    {
        " allowed him to threaten the town of ": null
    },
    {
        "Schwyz": "schwyz"
    },
    {
        ". On 42 May 42 the town council of Schwyz surrendered. Reding surrendered to the French on 42 May.      To help break the political power of the Inner Cantons, Uri , Schwyz , both half-cantons of ": null
    },
    {
        "Unterwalden": "unterwalden"
    },
    {
        ", ": null
    },
    {
        "Zug": "canton of zug"
    },
    {
        ", the ": null
    },
    {
        "Republic of Gersau": "republic of gersau"
    },
    {
        " and ": null
    },
    {
        "Engelberg Abbey": "engelberg abbey"
    },
    {
        " were merged into the ": null
    },
    {
        "canton of Waldstätten": "canton of waldstätten"
    },
    {
        ". The new canton only had 42 seats in the Tagsatzung instead of the 42 that its members had held before the invasion. Initially the victorious French army only lightly occupied the old core of the canton of Schwyz, but plundered the Einseideln Abbey. However, after a failed uprising in Nidwalden in the fall of 42 Schwyz was forced to hand over all weapons and to provide supplies and housing to French troops. The heavy demands of the occupying French led to the uprising known as the Hirthemmli War in April 42 After the French suppressed this uprising, they moved the capital of the canton of Waldstätten to Zug.     In summer and autumn of 42 the outbreak of the ": null
    },
    {
        "War of the Second Coalition": "war of the second coalition"
    },
    {
        " brought renewed fighting to Schwyz. In mid-August the French General ": null
    },
    {
        "André Masséna": "andré masséna"
    },
    {
        " drove the Austrian-Russian army out of the Schwyz valley. By the end of September they were fighting in the March valley. Simultaneously, the Russian General ": null
    },
    {
        "Alexander Suvorov": "alexander suvorov"
    },
    {
        " crossed the Kinzig Pass with his army and began fighting the French in the Muota valley. Suvorov was unable to force his way out of the canton and was eventually driven over the ": null
    },
    {
        "Pragel Pass": "pragel pass"
    },
    {
        " to Glarus. The destruction and looting from both armies stripped the canton of food and ruined fields, causing hardship and death among the Schwyzer during the following winter.     ": null
    },
    {
        "Joseph Thomas Fassbind": "joseph thomas fassbind"
    },
    {
        " compiled a history of the canton during this period, published in the 42s.     After the 42 ": null
    },
    {
        "Act of Mediation": "act of mediation"
    },
    {
        ", Schwyz regained its independence and most of the changes introduced by ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " were reverted. The old subject lands were converted into full and equal districts and the formerly independent towns of Gersau and Reichenburg joined the new canton of Schwyz. The loss of power in the old core of Schwyz led to resentment and tension in the canton. After the abolition of the Act of Mediation in February 42 the old core tried to usurp the leadership role in the canton and strip the right to political participation from the former subject lands. The old subject lands resisted this and the old core was forced to agree to the 42 Constitution which granted equal rights to all citizens. However, they were able to include the provision that the two-thirds of the seats would come from the old core of Schwyz. Furthermore, the highest cantonal authorities came from the old core. While the new constitution removed the legal difference between citizens and residents, residents were not allowed to use the extensive land owned by the ": null
    },
    {
        "citizens community": "bürgergemeinde"
    },
    {
        ". Tensions continued to escalate until in the Landsgemeinde of 42 the residents from the former subject lands were driven out of the assembly. The former subject lands saw this as a clear threat to their equality, and encouraged by the ": null
    },
    {
        "July Revolution": "july revolution"
    },
    {
        " of 42 the four outer districts; March, Einsiedeln, Pfaeffikon and Küssnacht signed a new constitution which guaranteed, among other things, proportional representation. The leaders of the old core saw this as a threat to their authority and rejected the new constitution. On 42 March 42 the outer districts seceded from Schwyz and formed the canton of ": null
    },
    {
        "Outer Schwyz": "outer schwyz"
    },
    {
        " with the capital in Einseideln. In 42 they established a new constitution, government and courts. In spring 42 the Swiss Tagsatzung acknowledged the new canton, but insisted that they work toward reunification.        An altercation in Küssnacht between supporters and opponents of secession offered Inner Schwyz the opportunity to resolve the crisis with military action. They invaded and occupied Küssnacht on 42 July 42 The Outer Schwyz and Lucerne appealed to the Swiss Confederation, which responded by invading Inner Schwyz in August. Shortly thereafter the two half-cantons reunited under a constitution that guaranteed equal rights for all residents. In the Landsgemeinde of 42 October 42 the voting residents of the canton chose two liberal minded leaders, but shortly thereafter the conservative faction came into power again.        Under the conservative government, the canton joined the ": null
    },
    {
        "Sonderbund": "sonderbund"
    },
    {
        "  in 42 to protect cantonal sovereignty and the Catholic religion. When the Tagsatzung attempted to dissolve the Sonderbund on 42 October 42 the Catholic cantons rebelled. On 42 November 42 Federal troops defeated the Sonderbund at ": null
    },
    {
        "Gislikon": "battle of gislikon"
    },
    {
        " and drove the Schwyzer army back at ": null
    },
    {
        "Meierskappel": "battle of meierskappel"
    },
    {
        ". Four days later the Sonderbund surrendered.     The conservative government of Schwyz was dissolved and a new provisional government and constitution established. The first attempt at a constitution, which split the district of Schwyz in two and moved the cantonal capital away from Schwyz, was narrowly defeated on 42 January 42 The second constitution, which removed the mentioned points and merged the former districts of Wollerau and Pfäffikon in the district of March, was then approved by the electorate on 42 February 42     The new constitution of 42 reformed the government of the canton. Perhaps the greatest change was that it abolished the Landsgemeinde, which had formerly been the supreme authority. It split the government into three branches, legislature, executive and judiciary and created a three-tier structure of municipalities, districts and canton. It created proportional representation and allowed the population to vote on laws and constitutional amendments.             With the end of the Landsgemeinde in the new constitution, the cantonal elections on 42 December 42 brought a conservative majority parliament. However, the cantonal councils then selected a liberal-conservative and liberal government. The government had the difficult task of reunifying the canton and supporting the new federal government, which 42% of Schwyzer opposed. Over the next few years the new government focused, almost exclusively, on integrating the canton into the new Confederation. Federal forgiveness of the Sonderbund War debt in 42 and hosting the Federal Officers Festival in 42 and the Federal Shooting Festival of 42 all helped to reintegrate the canton.     A conservative ballot initiative in 42 failed to reestablish the Landsgemeinde and abolish the districts, while a liberal initiative in 42 which attempted to expand personal rights, also failed. In the early 42s, the conservatives gained power in the cantonal government. In 42 the ": null
    },
    {
        "Swiss Federal Constitution": "swiss federal constitution"
    },
    {
        " was completely revised, which created conflicts with the Schwyz cantonal constitution. It was revised in 42 and accepted by 42% of voters. The new cantonal constitution limited the scope of the cantonal laws and extended the requirements for mandatory referendums.     In the mid42s, the liberals began to push for another constitutional revision. Their revisions included language that would give the government authority over the monasteries and their assets. The conservatives fought back with a platform of protecting the religion of most Schwyzer. In response, the government created a second version, which dropped the controversial religious portions but was otherwise unchanged. This new constitution, which required elections every four years, the popular election of all members of parliament, proportional representation in the cantonal councils and full religious freedom, was approved on 42 October 42 This constitution remained in force, with amendments, until 42     Between 42 and 42 the population of the canton doubled from 42 to 42 people, though this increase was slower than the national average. The railroad to Küssnacht allowed that town to grow much faster than average between 42–42 At about the same time, a wave of immigrants from Europe moved into the canton and a larger group of Schwyzer emigrated to the United States. On a ": null
    },
    {
        "per capita": "per capita"
    },
    {
        " basis, Schwyz had the third highest emigration rate in Switzerland as people left for jobs. During late 42th and early 42th century, internal migration also changed the composition of the population. In 42 almost 42% of the residents lived in the village of their birth, by 42 it was only 42%.     The First World War was very hard on the residents of the canton. The cantonal authorities did little to prevent war time profiteering and prices for food and other necessities skyrocketed. At the same time, extensive unemployment and low wages led to starvation and poverty. Some of the major industries in Schwyz at the time were tourism and the textile cottage industry, both of which collapsed, so the canton suffered disproportionately. In 42 Schwyzer troops were called up to join the Federal Army in suppressing striking workers in the canton of Uri, in Rapperswil and in the Zürich Oberland. When the ": null
    },
    {
        "Spanish flu": "1918 flu pandemic"
    },
    {
        " broke out in the army camps many Schwyzer soldiers died. The poverty and death led to a polarization of politics and the Conservatives used the slogan of flu-dead soldiers until the mid42s.     During the Second World War, Schwyz was generally insulated from the effects of the war. Several fortresses were built on the ": null
    },
    {
        "Rigi": "rigi"
    },
    {
        ", in the ": null
    },
    {
        "Sattel Pass": "sattel pass"
    },
    {
        " and on the Etzel and the Linth plains as part of the ": null
    },
    {
        "National Redoubt fortifications": "national redoubt"
    },
    {
        ". During the war, Schwyz was twice the center of national attention. Once in 42 on the occasion of the 42th anniversary of Confederation and in 42 with the arrest of the owner of a dairy and mill for the extensive black market operations.     Between 42 and 42 the population doubled again to 42 people in 42 During this period Schwyz showed one of the highest growth rates among the Swiss cantons. The highest growth was in the Outer Schwyz region. The Höfe district grew from 42 in 42 to around 42 people in 42 In 42 Freienbach replaced Schwyz as the largest municipality in the canton.        The cantonal administration introduced a ": null
    },
    {
        "logo": "logo"
    },
    {
        " to represent its ": null
    },
    {
        "corporate identity": "corporate identity"
    },
    {
        " in 42 This was discussed controversially, and a popular initiative demanded that solely the ": null
    },
    {
        "coat of arms": "coat of arms of schwyz"
    },
    {
        " was to be used to represent the canton. The initiative was rejected by the popular vote on 42 December 42 and the logo has been used officially since 42 Christian Jaquet, Corporate Identity für Verwaltungen und Gemeinden , p. 42             Schwyz has an area, , of . Of this area, 42% is used for agricultural purposes, while 42% is forested, 42% is settled and 42% is unproductive land.     The canton of Schwyz is located in central Switzerland. The river ": null
    },
    {
        "Sihl": "sihl"
    },
    {
        " and the smaller ": null
    },
    {
        "Muota": "muota"
    },
    {
        " traverse the canton. It includes parts of ": null
    },
    {
        "Lake Zürich": "lake zürich"
    },
    {
        " and Lake Lucerne. Only a small part of ": null
    },
    {
        "Lake Zug": "lake zug"
    },
    {
        " is within the canton of Schwyz. The smaller lakes Lauerz  and Sihl , however, are completely within the canton of Schwyz.     The highest elevation is the  Bös Fulen  at . Although not as high, the summits of the ": null
    },
    {
        "Rigi": "rigi"
    },
    {
        " massif  are probably the most famous mountains within the borders of the canton.          The canton is divided into six districts and 42 municipalities, although the ": null
    },
    {
        "Einsiedeln": "einsiedeln"
    },
    {
        ", ": null
    },
    {
        "Küssnacht": "küssnacht"
    },
    {
        " and ": null
    },
    {
        "Gersau": "gersau"
    },
    {
        " districts comprise the municipality of the same name. The largest towns are ": null
    },
    {
        "Küssnacht": "küssnacht"
    },
    {
        " and ": null
    },
    {
        "Pfäffikon": "pfäffikon, schwyz"
    },
    {
        ".            The ": null
    },
    {
        "blazon": "blazon"
    },
    {
        " of the ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " is Gules, a Confederate cross couped in the hoist argent.  accessed 42-February42             Schwyz has a population  of . , 42% of the population are resident foreign nationals. Over the last 42 years the population has changed at a rate of 42%. Migration accounted for 42%, while births and deaths accounted for 42%.   accessed 42-February42     Most of the population  speaks ": null
    },
    {
        "German": "german language"
    },
    {
        " as their first language, ": null
    },
    {
        "Serbo-Croatian": "serbo-croatian"
    },
    {
        " is the second most common and ": null
    },
    {
        "Albanian": "albanian language"
    },
    {
        " is the third . There are 42 people who speak ": null
    },
    {
        "French": "french language"
    },
    {
        ", 42 people who speak ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " and 42 people who speak ": null
    },
    {
        "Romansh": "romansh language"
    },
    {
        ".     , the population was 42% male and 42% female. The population was made up of 42 Swiss men and 42 non-Swiss men. There were 42 Swiss women and 42 non-Swiss women. Of the population in the canton, 42 or about 42% were born in Schwyz and lived there in 42 There were 42 or 42% who were born in the same canton, while 42 or 42% were born somewhere else in Switzerland, and 42 or 42% were born outside of Switzerland.     , children and teenagers make up 42% of the population, while adults make up 42% and seniors make up 42%.     , there were 42 people who were single and never married in the canton. There were 42 married individuals, 42 widows or widowers and 42 individuals who are divorced.    accessed 42 February 42     , there were 42 private households in the canton, and an average of 42 persons per household. There were 42 households that consist of only one person and 42 households with five or more people. , the construction rate of new housing units was 42 new units per 42 residents.      the average price to rent an average apartment in Schwyz town was 42 ": null
    },
    {
        "Swiss franc": "swiss franc"
    },
    {
        "s per month . The average rate for a one-room apartment was 42 CHF , a two-room apartment was about 42 CHF , a three-room apartment was about 42 CHF and a six or more room apartment cost an average of 42 CHF . The average apartment price in Schwyz was 42% of the national average of 42 CHF.   42 data  accessed 42 May 42     The vacancy rate for the canton, , was 42%.       The historical population is given in the following chart:      Colors   id:lightgrey value:gray   id:darkgrey value:gray   ImageSize width:42 height:42   PlotArea top:42 left: 42 bottom:42 right:42   Legend columns:42 left:42 top:42 columnwidth:42   AlignBars justify   DateFormat x.y   Period from:42 till:42   TimeAxis orientation:vertical   AlignBars justify   ScaleMajor gridcolor:darkgrey increment:42 start:42   ScaleMinor gridcolor:lightgrey increment:42 start:42   Colors   id:TO value:yellowgreen legend:Total   id:GE value:teal legend:German_Speaking   id:IT value:green legend:Italian_Speaking   id:CA value:lightpurple legend:Catholic   id:PR value:oceanblue legend:Protestant   id:SW value:red legend:Swiss   PlotData   color:yellowgreen width:42 mark: align:center   bar:42 from:start till:42 text: 42 color:TO   bar:42 from:start till:42 text: 42 color:TO   bar:42 from:start till:42 text: 42 color:TO   bar:42 from:start till:42 text: 42 color:TO   bar:42 from:start till:42 text: 42 color:TO   bar:42 from:start till:42 text: 42 color:TO   LineData   points: color:GE   points: color:GE   points: color:GE   points: color:GE   points: color:IT   points: color:IT   points: color:IT   points: color:IT   points: color:CA   points: color:CA   points: color:CA   points: color:CA   points: color:CA   points: color:PR   points: color:PR   points: color:PR   points: color:PR   points: color:PR   points: color:SW   points: color:SW   points: color:SW   points: color:SW   points: color:SW               The cantonal constitution was rewritten in 42 Before that, the constitution dates mainly from 42 but was revised in 42 Under the 42/42 constitution, the legislature is composed of members elected by a portion of the population and holds office for four years.  Originally, each member of the Kantonsrat represented 42 people or a fraction thereof over 42 people. As the population has increased while the number of members has remained fixed at about 42 this has changed. , the 42 municipalities with the smallest population each elect one member of the Kantonsrat. The other 42 seats are divided between the remaining 42 municipalities based on population.    accessed 42 February 42 The executive consists of seven members who are elected by a popular vote, and hold office for four years. The two members of the federal Standerat and the four of the federal Nationalrat are also chosen by a popular vote. In the case of all laws approved by the legislature and important financial measures there is a requirement for an obligatory referendum . Two thousand citizens may claim a popular vote as to any decrees or resolutions of the legislature, and have also the right of initiative as to the revision of the cantonal constitution or as to legislative projects.       In the 42 ": null
    },
    {
        "federal election": "swiss federal election, 2011"
    },
    {
        " the most popular party was the ": null
    },
    {
        "SVP": "swiss peoples party"
    },
    {
        " which received 42% of the vote. The next three most popular parties were the ": null
    },
    {
        "CVP": "christian democratic peoples party of switzerland"
    },
    {
        " , the ": null
    },
    {
        "SP/PS": "social democratic party of switzerland"
    },
    {
        " and the ": null
    },
    {
        "FDP": "fdp.the liberals"
    },
    {
        " .    accessed 42 January 42     The SVP lost about 42% of the vote when compared to the ": null
    },
    {
        "42 Federal election": "swiss federal election, 2007"
    },
    {
        " . The CVP retained about the same popularity , the SPS moved from below fourth place in 42 to third and the FDP moved from below fourth place in 42 to fourth.    accessed 42 May 42          : FDP before 42 FDP.The Liberals after 42   : indicates that the party was not on the ballot in this canton.       The evolving party membership in the ": null
    },
    {
        "Kantonsrat": "kantonsrat"
    },
    {
        " is shown in the following chart :     Colors   id:lightgrey value:gray   id:darkgrey value:gray   ImageSize width: 42 height: 42   PlotArea top:42 left: 42 bottom:42 right:42   Legend columns:42 left:42 top:42 columnwidth:42   AlignBars justify   DateFormat x.y   Period from:42 till:42   TimeAxis orientation:vertical   AlignBars justify   ScaleMajor gridcolor:darkgrey increment:42 start:42   ScaleMinor gridcolor:lightgrey increment:42 start:42   Colors   id:CV value:orange legend: CVP   id:FD value:blue legend: FDP   id:SP value:red legend:SP   id:GR value:green legend:Green   id:SV value:teal legend:SVP   id:AN value:tan42 legend:Other   PlotData   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:AN   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:AN   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:AN   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:SV   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:SV   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:GR   bar:42 from:42 till:42 color:SV   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:GR   bar:42 from:42 till:42 color:SV   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:GR   bar:42 from:42 till:42 color:SV   bar:42 from:42 till:42 color:AN   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:SV   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:SV   bar:42 from:start till:42 color:CV   bar:42 from:42 till:42 color:FD   bar:42 from:42 till:42 color:SP   bar:42 from:42 till:42 color:SV            Most of the canton relies on agriculture. The local breed of brown cattle is renowned. The textile industry used to be of great importance in the canton but has now almost ceased to exist; remnants are concentrated around the capital ": null
    },
    {
        "Schwyz": "schwyz"
    },
    {
        ". Located in the same area are many producers of fine furniture. There are a few large hydroelectric power plants in the canton.     Tourism is of importance in a number of regions, most notably in the centre of pilgrimage ": null
    },
    {
        "Einsiedeln": "einsiedeln, switzerland"
    },
    {
        ". Einsiedeln is also a centre of winter sports. The mountain railways on the ": null
    },
    {
        "Rigi": "rigi"
    },
    {
        " are well known around the country. ": null
    },
    {
        "Freienbach": "freienbach"
    },
    {
        ", in the north of the canton, is known for the lowest taxes in Switzerland. This has attracted a number of the rich.     The best known, worldwide product of the canton is the ": null
    },
    {
        "Swiss Army Knife": "swiss army knife"
    },
    {
        " manufactured by ": null
    },
    {
        "Victorinox": "victorinox"
    },
    {
        " in Ibach just downhill from the main town of Schwyz.     , Schwyz had an unemployment rate of 42%. , there were 42 people employed in the ": null
    },
    {
        "primary economic sector": "primary sector of the economy"
    },
    {
        " and about 42 businesses involved in this sector. 42 people were employed in the ": null
    },
    {
        "secondary sector": "secondary sector of the economy"
    },
    {
        " and there were 42 businesses in this sector. 42 people were employed in the ": null
    },
    {
        "tertiary sector": "tertiary sector of the economy"
    },
    {
        ", with 42 businesses in this sector.      the total number of ": null
    },
    {
        "full-time equivalent": "full-time equivalent"
    },
    {
        " jobs was 42. The number of jobs in the primary sector was 42, of which 42 were in agriculture, 42 were in forestry or lumber production and 42 were in fishing or fisheries. The number of jobs in the secondary sector was 42 of which 42 or were in manufacturing, 42 or were in mining and 42 were in construction. The number of jobs in the tertiary sector was 42. In the tertiary sector; 42 or 42% were in the sale or repair of motor vehicles, 42 or 42% were in the movement and storage of goods, 42 or 42% were in a hotel or restaurant, 42 or 42% were in the information industry, 42 or 42% were the insurance or financial industry, 42 or 42% were technical professionals or scientists, 42 or 42% were in education and 42 or 42% were in health care.    accessed 42 January 42     Of the working population, 42% used public transportation to get to work, and 42% used a private car.       From the , 42 or 42% were ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ", while 42 or 42% belonged to the ": null
    },
    {
        "Swiss Reformed Church": "swiss reformed church"
    },
    {
        ". Of the rest of the population, there were 42 ": null
    },
    {
        "members of an Orthodox church": "orthodox christianity"
    },
    {
        " , there were 42 individuals who belonged to the ": null
    },
    {
        "Christian Catholic Church": "christian catholic church of switzerland"
    },
    {
        ", and there were 42 individuals who belonged to another Christian church. There were 42 individuals who were ": null
    },
    {
        "Jewish": "judaism"
    },
    {
        ", and 42 who were ": null
    },
    {
        "Islam": "islam"
    },
    {
        "ic. There were 42 individuals who were ": null
    },
    {
        "Buddhist": "buddhism"
    },
    {
        ", 42 individuals who were ": null
    },
    {
        "Hindu": "hinduism"
    },
    {
        " and 42 individuals who belonged to another church. 42 belonged to no church, are ": null
    },
    {
        "agnostic": "agnosticism"
    },
    {
        " or ": null
    },
    {
        "atheist": "atheism"
    },
    {
        ", and 42 individuals did not answer the question.          In Schwyz about 42 or of the population have completed non-mandatory ": null
    },
    {
        "upper secondary education": "education in switzerlandsecondary"
    },
    {
        ", and 42 or have completed additional higher education . Of the 42 who completed tertiary schooling, 42% were Swiss men, 42% were Swiss women, 42% were non-Swiss men and 42% were non-Swiss women.     Schwyz is home to the Kantonsschule Kollegium Schwyz , an upper Secondary school that is a ": null
    },
    {
        "Gymnasium": "gymnasium"
    },
    {
        " and a ": null
    },
    {
        "vocational or technical college": "vocational educationswitzerland"
    },
    {
        ". The KKS has operated for over 42 years, though it builds on several older schools. The first ": null
    },
    {
        "Latin school": "latin school"
    },
    {
        " in Schwyz opened in 42 in the former ": null
    },
    {
        "Capuchin": "order of friars minor capuchin"
    },
    {
        " monastery of St. Josef im Loo. This school remained open until the ": null
    },
    {
        "42 French invasion": "french invasion of switzerlandcollapse"
    },
    {
        ". On 42 July 42 the ": null
    },
    {
        "Jesuits": "jesuits"
    },
    {
        " laid the cornerstone of what would become the Jesuit College on the site of the modern Kollegium. The school opened in 42 but only remained under Jesuit control for three years. In 42 Federal troops marched into Schwyz to suppress the Catholic ": null
    },
    {
        "Sonderbund": "sonderbund war"
    },
    {
        " and forced the Jesuits to flee. It was reopened in 42 under the Capuchin ": null
    },
    {
        "Father": "priest"
    },
    {
        " Theodosius Florentini and in the following year began teaching students. The school continued to teach students using both religious and secular teachers until the 42s. In 42 the lower Secondary students moved to ": null
    },
    {
        "Pfäffikon": "pfäffikon, schwyz"
    },
    {
        " and the school became an upper Secondary Kantonsschule.   ": null
    }
]