[
    {
        "           Captain America is a fictional ": null
    },
    {
        "superhero": "superhero"
    },
    {
        " appearing in ": null
    },
    {
        "American comic book": "american comic book"
    },
    {
        "s published by ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        ". Created by ": null
    },
    {
        "cartoonists": "cartoonists"
    },
    {
        " Joe Simon": "joe simon"
    },
    {
        " and ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        ", the character ": null
    },
    {
        "first appeared": "first appearance"
    },
    {
        " in  Captain America Comics  42  from ": null
    },
    {
        "Timely Comics": "timely comics"
    },
    {
        ", a predecessor of Marvel Comics. Captain America was designed as a ": null
    },
    {
        "patriotic": "american patriotism"
    },
    {
        " supersoldier": "supersoldier"
    },
    {
        " who often fought the ": null
    },
    {
        "Axis powers": "axis powers"
    },
    {
        " of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and was Timely Comics most popular character during the wartime period. The popularity of superheroes waned following the war and the Captain America comic book was discontinued in 42 with a short-lived revival in 42 Since Marvel Comics revived the character in 42 Captain America has remained in publication.     The character wears a costume bearing an ": null
    },
    {
        "American flag": "flag of the united states"
    },
    {
        " motif": "motif"
    },
    {
        ", and he utilizes a ": null
    },
    {
        "nearly indestructible shield which he throws as a projectile": "captain americas shield"
    },
    {
        ". Captain America is the ": null
    },
    {
        "alter ego": "alter ego"
    },
    {
        " of Steve Rogers, a frail young man enhanced to the peak of human perfection by an experimental serum to aid the ": null
    },
    {
        "United States": "united states"
    },
    {
        " governments efforts in World War II. Near the end of the war, he was trapped in ice and survived in ": null
    },
    {
        "suspended animation": "cryopreservation"
    },
    {
        " until he was revived in the present day. Although Captain America often struggles to maintain his ideals as a man out of his time with its modern realities, he remains a highly respected figure in his community which includes becoming the long-time leader of the ": null
    },
    {
        "Avengers": "avengers"
    },
    {
        ".     Captain America was the first Marvel Comics character to appear in media outside comics with the release of the 42 ": null
    },
    {
        "movie serial": "serial"
    },
    {
        ",  Captain America . Since then, the character has been featured in ": null
    },
    {
        "other films and television series": "captain america in other media"
    },
    {
        ". In the ": null
    },
    {
        "Marvel Cinematic Universe": "marvel cinematic universe"
    },
    {
        " , the ": null
    },
    {
        "character": "steve rogers"
    },
    {
        " was portrayed by ": null
    },
    {
        "Chris Evans": "chris evans"
    },
    {
        " in  Captain America: The First Avenger  ,  The Avengers  ,  Captain America: The Winter Soldier  ,  Avengers: Age of Ultron  ,  Captain America: Civil War  ,  Avengers: Infinity War  , and  Avengers: Endgame  . He had cameos in  Thor: The Dark World  ,  Ant-Man  ,  Spider-Man: Homecoming  , and  Captain Marvel  .     Captain America is ranked sixth on ": null
    },
    {
        "IGN": "ign"
    },
    {
        "s Top 42 Comic Book Heroes of All Time in 42  second in their list of The Top 42 Avengers in 42  and second in their Top 42 best Marvel superheroes list in 42                    In 42 writer Joe Simon conceived the idea for Captain America and made a sketch of the character in costume. 42 ": null
    },
    {
        "Comic Art Convention": "comic art convention"
    },
    {
        " program, cover I wrote the name Super American at the bottom of the page, Simon said in his autobiography, and then decided:          Simon recalled in his autobiography that ": null
    },
    {
        "Timely Comics": "timely comics"
    },
    {
        " publisher ": null
    },
    {
        "Martin Goodman": "martin goodman"
    },
    {
        " gave him the go-ahead and directed that a Captain America solo comic book series be published as soon as possible. Needing to fill a full comic with primarily one characters stories, Simon did not believe that his regular creative partner, artist ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        ", could handle the workload alone:        Al Lieberman would ink that first issue, which was lettered by Simon and Kirbys regular letterer, Howard Ferguson. Simon, p. 42     Simon said Captain America was a consciously political creation; he and Kirby were morally repulsed by the actions of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " in the years leading up to the United States involvement in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and felt war was inevitable: The opponents to the war were all quite well organized. We wanted to have our say too.        Captain America Comics 42 — ": null
    },
    {
        "cover-date": "cover-date"
    },
    {
        "d March 42   at the Grand Comics Database and on sale December 42 42   a year before the ": null
    },
    {
        "attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        ", but a full year into World War II — showed the protagonist punching Nazi leader ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        "; it sold nearly one million copies.  While most readers responded favorably to the comic, some took objection. Simon noted, When the first issue came out we got a lot of   ... threatening letters and hate mail. Some people really opposed what Cap stood for. The threats, which included menacing groups of people loitering out on the street outside of the offices, proved so serious that police protection was posted with ": null
    },
    {
        "New York Mayor": "mayor of new york city"
    },
    {
        " Fiorello La Guardia": "fiorello la guardia"
    },
    {
        " personally contacting Simon and Kirby to give his support.      Though preceded as a patriotically themed superhero by ": null
    },
    {
        "MLJ": "archie comics"
    },
    {
        "s ": null
    },
    {
        "The Shield": "the shield"
    },
    {
        ", Captain America immediately became the most prominent and enduring of that wave of superheroes introduced in American comic books prior to and during World War II,  as evidenced by the unusual move at the time of premiering the character in his own title instead of an anthology title first. This popularity drew the attention and a complaint from MLJ that the characters triangular shield too closely resembled the chest symbol of their Shield character. In response, Goodman had Simon and Kirby create a distinctive round shield for issue 42 which went on to become an iconic element of the character. Cronin, p. 42 With his sidekick ": null
    },
    {
        "Bucky": "bucky"
    },
    {
        ", Captain America faced ": null
    },
    {
        "Nazis": "nazism"
    },
    {
        ", ": null
    },
    {
        "Japanese": "empire of japan"
    },
    {
        ", and other threats to wartime America and the ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        ". Stanley Lieber, now better known as ": null
    },
    {
        "Stan Lee": "stan lee"
    },
    {
        ", contributed to the character in issue 42 in the filler text story Captain America Foils the Traitors Revenge , which introduced the characters use of his shield as a returning throwing weapon.  Captain America soon became Timelys most popular character and even had a fan-club called the Sentinels of Liberty .     Circulation figures remained close to a million copies per month after the debut issue, which outstripped even the circulation of news magazines such as  Time  during the period.  After the Simon and Kirby team moved to ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " in late 42 having produced Captain America Comics through issue 42 , ": null
    },
    {
        "Al Avison": "al avison"
    },
    {
        " and ": null
    },
    {
        "Syd Shores": "syd shores"
    },
    {
        " became regular ": null
    },
    {
        "penciller": "penciller"
    },
    {
        "s of the celebrated title, with one generally ": null
    },
    {
        "inking": "inker"
    },
    {
        " over the other. The character was featured in  All Winners Comics  42–42 ,  Marvel Mystery Comics  42–42 and 42–42  USA Comics  42–42 , and  All Select Comics  42–42 .     In the post-war era, with the popularity of superheroes fading, Captain America led Timelys first superhero team, the ": null
    },
    {
        "All-Winners Squad": "all-winners squad"
    },
    {
        ", in its two published adventures, in  All Winners Comics  42 and 42 . After Bucky was shot and wounded in a 42 Captain America story, he was succeeded by Captain Americas girlfriend, Betsy Ross, who became the superheroine ": null
    },
    {
        "Golden Girl": "golden girl"
    },
    {
        ". Captain America Comics ran until issue 42 ,  at which time the series was retitled Captain Americas Weird Tales for two issues,  with the finale being a horror/suspense anthology issue with no superheroes.     ": null
    },
    {
        "Atlas Comics": "atlas comics"
    },
    {
        " attempted to revive its superhero titles when it reintroduced Captain America, along with the original Human Torch and the Sub-Mariner, in Young Men 42 . Billed as Captain America, Commie Smasher! Captain America appeared during the next year in Young Men 42–42 and Mens Adventures 42–42 as well as in issues 42–42 of an eponymous title. Atlas attempted superhero revival was a commercial failure, Wright, p. 42 and the characters title was canceled with Captain America 42 .          In the ": null
    },
    {
        "Human Torch": "human torch"
    },
    {
        " story titled Captain America in Marvel Comics  Strange Tales  42 , ": null
    },
    {
        "DeFalco, Tom": "tom defalco"
    },
    {
        " 42s in Gilbert , p. 42: As the Human Torch had been instrumental in bringing back the Sub-Mariner in The Fantastic Four 42 , it seemed only natural that he would help usher in Captain America. writer-editor ": null
    },
    {
        "Stan Lee": "stan lee"
    },
    {
        " and artist and co-plotter ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        " depicted the brash young ": null
    },
    {
        "Fantastic Four": "fantastic four"
    },
    {
        " member Johnny Storm, the Human Torch, in an exhibition performance with Captain America, described as a legendary World War II and 42s superhero who has returned after many years of apparent retirement. The 42-page story ends with this Captain America revealed as an impostor: it was actually the villain the Acrobat, a former circus performer the Torch had defeated in Strange Tales 42 who broke two thieves out of jail, hoping to draw the police away while trying to rob the local bank. Afterward, Storm digs out an old comic book in which Captain America is shown to be Steve Rogers. A caption in the final panel says this story was a test to see if readers would like Captain America to return. According to Lee, fan response to the tryout was very enthusiastic.      Captain America was then formally reintroduced in  The Avengers  42 , DeFalco 42s in Gilbert , p. 42: Captain America lives again! announced the cover of The Avengers 42 A mere months after his imposter had appeared in Strange Tales 42 the real Cap was back. which explained that in the final days of World War II, he had fallen from an experimental ": null
    },
    {
        "drone plane": "unmanned aerial vehicle"
    },
    {
        " into the ": null
    },
    {
        "North Atlantic Ocean": "atlantic ocean"
    },
    {
        " and spent decades frozen in a block of ice in a state of ": null
    },
    {
        "suspended animation": "suspended animation"
    },
    {
        ". The hero found a new generation of readers as leader of that superhero team. Following the success of other Marvel characters introduced during the 42s, Captain America was recast as a hero haunted by past memories, and trying to adapt to 42s society . Wright, p. 42     After then guest-starring in the feature ": null
    },
    {
        "Iron Man": "iron man"
    },
    {
        " in  Tales of Suspense  42 , Captain America gained his own solo feature in that split book , beginning the following issue. DeFalco 42s in Gilbert , p. 42 Issue 42 , which retold Captain Americas origin, through issue 42 was a period feature set during World War II and co-starred Captain Americas Golden Age sidekick, Bucky. Kirby drew all but two of the stories in Tales of Suspense, which became  Captain America  with 42 ; DeFalco 42s in Gilbert , p. 42: Hailing 42 as the beginning of the Second Age of Marvel Comics, and with more titles to play with, editor Stan Lee discarded his split books and gave more characters their own titles: Tales of Suspense 42 was followed by Captain America 42 ": null
    },
    {
        "Gil Kane": "gil kane"
    },
    {
        " and ": null
    },
    {
        "John Romita Sr.": "john romita sr."
    },
    {
        ", each filled in once. Several stories were finished by penciller-inker ": null
    },
    {
        "George Tuska": "george tuska"
    },
    {
        " over Kirby layouts, with one finished by Romita Sr. and another by penciller ": null
    },
    {
        "Dick Ayers": "dick ayers"
    },
    {
        " and inker ": null
    },
    {
        "John Tartaglione": "john tartaglione"
    },
    {
        ". Kirbys regular inkers on the series were ": null
    },
    {
        "Frank Giacoia": "frank giacoia"
    },
    {
        " and ": null
    },
    {
        "Joe Sinnott": "joe sinnott"
    },
    {
        ", though ": null
    },
    {
        "Don Heck": "don heck"
    },
    {
        " and Golden Age Captain America artist ": null
    },
    {
        "Syd Shores": "syd shores"
    },
    {
        " inked one story each.     This series — considered Captain America volume one by comics researchers and historians,  and  following the 42s Captain America Comics and its 42s numbering continuation of Tales of Suspense — ended with 42 .     This series was almost immediately followed by the 42-issue Captain America vol. 42 ,  and  the 42-issue Captain America vol. 42 ,  and  Beginning with the 42th overall issue , Captain America resumed its original numbering, as if the series numbering had continued uninterrupted after 42       As part of the aftermath of Marvel Comics company-crossover storyline ": null
    },
    {
        "Civil War": "civil war"
    },
    {
        " , Steve Rogers was ostensibly killed in Captain America vol. 42 42 .     The storyline of Rogers return began in issue 42   Rogers, who was not dead but caroming through time, returned to the present day in the six-issue miniseries  Captain America: Reborn  .      After Rogers return, Barnes, at Rogers insistence, continued as Captain America, beginning in the ": null
    },
    {
        "one-shot": "one-shot"
    },
    {
        " comic Captain America: Who Will Wield the Shield? . While Bucky Barnes continued adventuring in the pages of Captain America, Steve Rogers received his own miniseries  as well as taking on the leadership position in a new Secret Avengers ongoing series.     Spinoff series included Captain America Sentinel of Liberty and  Captain America and the Falcon  . The 42s Captain America appeared alongside the 42s ": null
    },
    {
        "Human Torch": "human torch"
    },
    {
        " and ": null
    },
    {
        "Sub-Mariner": "sub-mariner"
    },
    {
        " in the 42-issue ": null
    },
    {
        "miniseries": "miniseries"
    },
    {
        " Avengers/Invaders.   The 42 ": null
    },
    {
        "mini-series": "limited series"
    },
    {
        " Captain America: The Chosen, written by ": null
    },
    {
        "David Morrell": "david morrell"
    },
    {
        " and penciled by Mitchell Breitweiser, depicts a dying Steve Rogers final minutes, at ": null
    },
    {
        "S.H.I.E.L.D.": "s.h.i.e.l.d."
    },
    {
        " headquarters, as his spirit guides James Newman, a young American Marine fighting in ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        ". The Chosen is not part of the main Marvel Universe continuity.       During the Two Americas storyline that ran in issues 4242 the series drew controversy for the similarity between protesters depicted in the comic and the ": null
    },
    {
        "Tea Party movement": "tea party movement"
    },
    {
        ". Particularly drawing scorn was a panel of a protester holding sign that read Tea Bag the Libs Before They Tea Bag You!  Also drawing controversy were remarks made by the Falcon implying that the crowd is racist.  In his column on ": null
    },
    {
        "Comic Book Resources": "comic book resources"
    },
    {
        ", Marvel Comics Editor-in-Chief ": null
    },
    {
        "Joe Quesada": "joe quesada"
    },
    {
        " apologized for the sign, claiming that it was a mistake, added by the letterer at the last minute.      The character, first as agent Steve Rogers and later after resuming his identity as Captain America, appeared as a regular character throughout the 42–42 Avengers series, from issue 42 through its final issue 42 . The character appeared as agent Steve Rogers as a regular character in the 42–42 Secret Avengers series, from issue 42 through issue 42 ; the character made guest appearances as Captain America in issues 42, 42–42 42 and the final issue of the series 42 .     Marvel stated in May 42 that Rogers, following the public death of Bucky Barnes in the  Fear Itself  miniseries, would resume his Captain America identity in a sixth volume of Captain America, by writer ": null
    },
    {
        "Ed Brubaker": "ed brubaker"
    },
    {
        " and artist ": null
    },
    {
        "Steve McNiven": "steve mcniven"
    },
    {
        ".       On July 42 42 Marvel Comics announced that the mantle of Captain America would be passed on by Rogers to his long-time ally ": null
    },
    {
        "The Falcon": "falcon"
    },
    {
        ", with the series being relaunched as All-New Captain America.      Marvel announced that Rogers will become Captain America once again in the comic series Captain America: Steve Rogers.  This new series follows the events of ": null
    },
    {
        "Avengers: Standoff!": "avengers: standoff!"
    },
    {
        ", in which Captain America is restored to his youthful state following an encounter with the sentient Cosmic Cube, Kobik, and his past is drastically rewritten under the instructions of the Red Skull. Afterward, Captain America plots to set himself and Hydra in a position where they can conquer America in Marvels event ": null
    },
    {
        "Secret Empire": "secret empire"
    },
    {
        ".        In 42 Joe Simon sued the owners of Marvel Comics, asserting that he—not Marvel—was legally entitled to renew the ": null
    },
    {
        "copyright": "copyright"
    },
    {
        " upon the expiration of the original 42-year term. The two parties settled out of court, with Simon agreeing to a statement that the character had been created under terms of employment by the publisher, and therefore it was ": null
    },
    {
        "work for hire": "work for hire"
    },
    {
        " owned by them.      In 42 Simon filed to claim the copyright to Captain America under a provision of the ": null
    },
    {
        "Copyright Act of 42": "copyright act of 1976"
    },
    {
        ", which allowed the original creators of works that had been sold to corporations to reclaim them after the original 42-year copyright term had expired. Marvel Entertainment challenged the claim, arguing that the settlement of Simons 42 suit made the character ineligible for termination of the copyright transfer. Simon and Marvel settled out of court in 42 in a deal that paid Simon royalties for merchandising and licensing use of the character.                 Steven Rogers was born in the ": null
    },
    {
        "Lower East Side": "lower east side"
    },
    {
        " of ": null
    },
    {
        "Manhattan": "manhattan"
    },
    {
        ", ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", in 42 to poor ": null
    },
    {
        "Irish": "irish people"
    },
    {
        " immigrants, Sarah and Joseph Rogers.  Joseph died when Steve was a child, and Sarah died of pneumonia while Steve was a teen. By early 42 before Americas entry into ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Rogers is a tall, scrawny ": null
    },
    {
        "fine art": "fine art"
    },
    {
        "s student specializing in illustration and a comic book writer and artist.     Disturbed by the devastation of Europe by the Nazis, Rogers attempts to enlist but is rejected due to his frail body. His resolution attracts the notice of U.S. Army General ": null
    },
    {
        "Chester Phillips": "chester phillips"
    },
    {
        " and Project: Rebirth . Rogers is used as a test subject for the ": null
    },
    {
        "Super-Soldier": "supersoldier"
    },
    {
        " project, receiving a special serum made by Dr. Josef Reinstein ,   later ": null
    },
    {
        "retroactively changed": "retroactive continuity"
    },
    {
        " to a code name for the scientist ": null
    },
    {
        "Abraham Erskine": "abraham erskine"
    },
    {
        ".      The serum is a success and transforms Steve Rogers into a nearly perfect human being with peak strength, agility, stamina, and intelligence. The success of the program leaves Erskine wondering about replicating the experiment on other human beings. The process itself has been inconsistently detailed: While in the original material Rogers is shown receiving injections of the Super-Serum, when the origin was retold in the 42s, the ": null
    },
    {
        "Comic Code Authority": "comic code authority"
    },
    {
        " had already put a veto over graphic description of drug intake and abuse, and thus the Super-Serum was ": null
    },
    {
        "retconned": "retroactive continuity"
    },
    {
        " into an oral formula.      Erskine refused to write down every crucial element of the treatment, leaving behind a flawed, imperfect knowledge of the steps. Thus, when the Nazi ": null
    },
    {
        "spy": "secret agent"
    },
    {
        " Heinz Kruger": "heinz kruger"
    },
    {
        " killed him, Erskines method of creating new Super-Soldiers died. Captain America, in his first act after his transformation, avenges Erskine. In the 42 origin story and in Tales of Suspense 42 Kruger dies when running into machinery but is not killed by Rogers; in the Captain America 42 and 42 revisions, Rogers causes the spys death by punching him into machinery.     Unable to create new Super-Soldiers and willing to hide the Project Rebirth fiasco, the American government casts Rogers as a patriotic superhero, able to counter the menace of the ": null
    },
    {
        "Red Skull": "red skull"
    },
    {
        " as a ": null
    },
    {
        "counter-intelligence": "counter-intelligence"
    },
    {
        " agent. He is supplied with a patriotic uniform of his own design, a bulletproof shield, a personal ": null
    },
    {
        "side arm": "sidearm"
    },
    {
        ", and the codename Captain America, while posing as a clumsy ": null
    },
    {
        "infantry": "infantry"
    },
    {
        " private at Camp Lehigh in Virginia. He forms a friendship with the camps teenage ": null
    },
    {
        "mascot": "mascot"
    },
    {
        ", James Buchanan Bucky Barnes.     Barnes learns of Rogers ": null
    },
    {
        "dual identity": "secret identity"
    },
    {
        " and offers to keep the secret if he can become Captain Americas ": null
    },
    {
        "sidekick": "sidekick"
    },
    {
        ". During their adventures, ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " presents Captain America with ": null
    },
    {
        "a new shield": "captain americas shield"
    },
    {
        ", forged from an alloy of ": null
    },
    {
        "steel": "steel"
    },
    {
        " and ": null
    },
    {
        "vibranium": "vibranium"
    },
    {
        ", fused by an unknown catalyst, so effective that it replaces his own firearm. Throughout World War II, Captain America and Bucky fight the Nazi menace both on their own and as members of the superhero team the ": null
    },
    {
        "Invaders": "invaders"
    },
    {
        " as seen in the 42s comic of the same name.  Captain America fights in numerous battles in World War II, primarily as a member of 42st Battalion, ": null
    },
    {
        "42th Infantry Regiment": "26th infantry regiment"
    },
    {
        " Blue Spaders .  Captain America battles a number of criminal menaces on American soil, including a wide variety of costumed villains: the Wax Man,  the Hangman,  the Fang,  the Black Talon,  and the White Death,  among others.     In addition to Bucky, Captain America was occasionally assisted by the ": null
    },
    {
        "Sentinels of Liberty": "sentinels of liberty"
    },
    {
        ".  Sentinels of Liberty was the title given to members of the Captain America Comics fan club who Captain America sometimes addressed as an aside, or as characters in the Captain America Comics stories.     In late April 42 during the closing days of World War II, Captain America and Bucky try to stop the villainous ": null
    },
    {
        "Baron Zemo": "baron heinrich zemo"
    },
    {
        " from destroying an experimental drone plane. Zemo launches the plane with an armed explosive on it with Rogers and Barnes in hot pursuit. The pair reaches the plane just before takeoff. When Bucky tries to defuse the bomb, it explodes in mid-air. Rogers is hurled into the freezing waters of the North Atlantic. Both are presumed dead, though it is later revealed that neither had died.       Captain America appeared in comics for the next few years, changing from World War II-era hero fighting the Nazis to confronting the United States newest enemy, ": null
    },
    {
        "Communism": "communism"
    },
    {
        ". The revival of the character in the mid42s was short-lived, and events during that time period are later retconned to show that multiple people operated using the code name to explain the changes in the character. These post World War II successors are listed as ": null
    },
    {
        "William Naslund": "spirit of 76"
    },
    {
        " and ": null
    },
    {
        "Jeffrey Mace": "jeffrey mace"
    },
    {
        ".     The last of these other official Captains, William Burnside,  was a history graduate enamored with the Captain America mythos, having his appearance surgically altered to resemble Rogers and legally changing his name to Steve Rogers , becoming the new 42s Captain America .  He administered to himself and his pupil ": null
    },
    {
        "James Jack Monroe": "jack monroe"
    },
    {
        " a flawed, incomplete copy of the Super-Serum, which made no mention about the necessary Vita-Ray portion of the treatment. As a result, while Burnside and Monroe became the new Captain America and Bucky, they became violently paranoid, often raving about innocent people being communist sympathizers during the height of the ": null
    },
    {
        "Red Scare": "red scare"
    },
    {
        " of the 42s. Their insanity forced the U.S. government to place them in indefinite cryogenic storage until they could be cured of their mental illness.  Monroe would later be cured and assume the Nomad identity.        Years later, the superhero team the ": null
    },
    {
        "Avengers": "avengers"
    },
    {
        " discovers Steve Rogers body in the North Atlantic. After he revives, they piece together that Rogers has been preserved in a block of ice since 42 surviving because of his enhancements from Project: Rebirth. The block began to melt after the ": null
    },
    {
        "Sub-Mariner": "namor"
    },
    {
        ", enraged that an ": null
    },
    {
        "Inuit": "inuit"
    },
    {
        " tribe is worshipping the frozen figure, throws it into the ocean.  Rogers accepts membership in the Avengers, and his experience in individual combat service and his time with the Invaders makes him a valuable asset. He quickly assumes leadership  and has typically returned to that position throughout the teams history.        Captain America is plagued by guilt for having been unable to prevent Buckys death. Although he takes the young ": null
    },
    {
        "Rick Jones": "rick jones"
    },
    {
        " under his tutelage, he refuses for some time to allow Jones to take up the Bucky identity, not wishing to be responsible for another youths death. Insisting that his hero move on from that loss, Jones convinces Rogers to let him don the Bucky costume,  but this partnership lasts only a short time; a disguised ": null
    },
    {
        "Red Skull": "red skull"
    },
    {
        ", impersonating Rogers with the help of the ": null
    },
    {
        "Cosmic Cube": "cosmic cube"
    },
    {
        ", drives Jones away.     Rogers reunites with his old war comrade ": null
    },
    {
        "Nick Fury": "nick fury"
    },
    {
        ", who is similarly well-preserved due to the Infinity Formula . As a result, Rogers regularly undertakes missions for the security agency ": null
    },
    {
        "S.H.I.E.L.D.": "s.h.i.e.l.d."
    },
    {
        ", for which Fury is public director.  Through Fury, Rogers befriends ": null
    },
    {
        "Sharon Carter": "sharon carter"
    },
    {
        ", a S.H.I.E.L.D. agent,  with whom he eventually begins a romantic relationship.     Rogers later meets and trains Sam Wilson, who becomes the superhero the ": null
    },
    {
        "Falcon": "falcon"
    },
    {
        ",  the first ": null
    },
    {
        "African-American": "african-american"
    },
    {
        " superhero in mainstream comic books.  DeFalco 42s in Gilbert , p. 42: The Black Panther may have broken the mold as Marvels first black super hero, but he was from Africa. The Falcon was the first black American super hero. Introduced by Stan Lee and artist Gene Colan, Sam Snap Wilson was a former community volunteer.  The characters established an enduring friendship and adventuring partnership, sharing the series title for some time as Captain America and the Falcon.  The two later encounter the revived but still insane ": null
    },
    {
        "42s Captain America": "grand director"
    },
    {
        ".   Sanderson 42s in Gilbert , p. 42: In his first story line as Captain America and the Falcon writer, Steve Englehart revealed that an unnamed teacher had rediscovered the Super-Soldier serum in the 42s and he and a student used it to turn themselves into new versions of Captain America and Bucky. Although Rogers and the Falcon defeat the faux Rogers and Jack Monroe, Rogers becomes deeply disturbed that he could have suffered his counterparts fate. During this period, Rogers temporarily gains super strength.      The series dealt with the ": null
    },
    {
        "Marvel Universe": "marvel universe"
    },
    {
        "s version of the ": null
    },
    {
        "Watergate scandal": "watergate scandal"
    },
    {
        ",   Sanderson 42s in Gilbert , p. 42: Inspired by the real life Watergate scandals,, writer Steve Englehart devised a story line about a conspiracy within the U.S. government. making Rogers so uncertain about his role that he abandons his Captain America identity in favor of one called ": null
    },
    {
        "Nomad": "nomad"
    },
    {
        ", Sanderson 42s in Gilbert , p. 42: Shocked by learning the identity of Number One of the Secret Empire, Steve Rogers abandoned his Captain America role and adopted a new costumed identity, Nomad. emphasizing the words meaning as man without a country . During this time, several men unsuccessfully assume the Captain America identity.  Rogers eventually re-assumes it after coming to consider that the identity could be a symbol of American ideals and not its government; its a personal conviction epitomized when he later confronted a corrupt Army officer attempting to manipulate him by appealing to his loyalty, Im loyal to nothing, General   ... except the Dream. Jack Monroe, cured of his mental instability, later takes up the Nomad alias.  Sharon Carter is believed to have been killed while under the mind control of ": null
    },
    {
        "Dr. Faustus": "doctor faustus"
    },
    {
        ".           The 42s included a run by writer ": null
    },
    {
        "Roger Stern": "roger stern"
    },
    {
        " and artist ": null
    },
    {
        "John Byrne": "john byrne"
    },
    {
        ". Stern had Rogers consider a run for President of the United States in Captain America 42 ,  an idea originally developed by ": null
    },
    {
        "Roger McKenzie": "roger mckenzie"
    },
    {
        " and ": null
    },
    {
        "Don Perlin": "don perlin"
    },
    {
        ". Stern, in his capacity as editor of the title, originally rejected the idea but later changed his mind about the concept.   McKenzie and Perlin received credit for the idea on the letters page at Sterns insistence. ": null
    },
    {
        "mi": "mi"
    },
    {
        "mi": "mi"
    },
    {
        "rvel Comi": "rvel comi"
    }
]