[
    {
        "In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        "s, the capture effect, or FM capture effect, is a phenomenon associated with ": null
    },
    {
        "FM": "frequency modulation"
    },
    {
        " reception in which only the stronger of two signals at, or near, the same ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " or channel will be ": null
    },
    {
        "demodulated": "demodulation"
    },
    {
        ".     The capture effect is defined as the complete suppression of the weaker signal at the ": null
    },
    {
        "receiver": "receiver"
    },
    {
        " limiter": "limiter"
    },
    {
        " where the weaker signal is not ": null
    },
    {
        "amplified": "amplifier"
    },
    {
        ", but ": null
    },
    {
        "attenuate": "attenuate"
    },
    {
        "d. When both signals are nearly equal in strength, or are ": null
    },
    {
        "fading": "fading"
    },
    {
        " independently, the receiver may ": null
    },
    {
        "switch": "switch"
    },
    {
        " from one to the other and exhibit ": null
    },
    {
        "picket fencing": "picket fencing"
    },
    {
        ".     The capture effect can occur at the signal limiter, or in the ": null
    },
    {
        "demodulation": "demodulation"
    },
    {
        " stage, for circuits that do not require a signal limiter. Some types of ": null
    },
    {
        "radio receiver circuits": "detector"
    },
    {
        " have a stronger capture effect than others. The measurement of how well a receiver can reject a second signal on the same frequency is called the capture ratio for a specific receiver. It is measured as the lowest ratio of the power of two signals that will result in the suppression of the smaller signal.     Amplitude modulation, or ": null
    },
    {
        "AM": "am broadcasting"
    },
    {
        " radio": "radio"
    },
    {
        ", ": null
    },
    {
        "transmission": "transmission"
    },
    {
        " is not subject to this effect. This is one reason that the ": null
    },
    {
        "aviation": "airband"
    },
    {
        " industry, and others, have chosen to use AM for communications rather than FM, allowing multiple signals ": null
    },
    {
        "transmitted": "transmission"
    },
    {
        " on the same channel to be heard. Phenomena similar to the capture effect are described in AM when offset carriers of different strengths are present in the passband of a receiver. For example, the aviation ": null
    },
    {
        "glideslope": "glideslope"
    },
    {
        " vertical guidance clearance beam is sometimes described as a capture effect system, even though it operates using AM signals.       In FM demodulation the receiver tracks the modulated frequency shift of the desired carrier while discriminating against any other signal since it can only follow the deviation of one signal at a time. In AM, the receiver tracks the signal strength of the AM signal as the basis for demodulation. This allows any other signal to be tracked as just another change in amplitude. So it is possible for an AM receiver to demodulate several carriers at the same time, resulting in an audio mix.     If the signals are close but not exactly on the same frequency, the mix will not only include the audio from both carriers, but depending on the carrier separation an audible tone may be heard at a frequency equal to the difference in the carrier frequencies involved. For instance, if one carrier is at 42 kHz, and the other is at 42 kHz, then a 42 Hz beat frequency tone will result.     This mix can also occur when a second AM carrier is received on a channel that is adjacent to the desired channel if the receivers ultimate bandwidth is wide enough to include the carriers of both signals. In the US AM broadcast bands this occurs at 42 kHz, which is the US channel spacing for the AM broadcast band. Elsewhere it can occur at 42 kHz, a commonly used channel spacing in many locales.     Modern SDR-based receivers can completely eliminate this by utilizing brick-wall filters narrower than the channel spacing that reduce signals outside the passband to inconsequential levels. Where such an overlap within the passband occurs, a high pitched whistle at precisely 42 or 42 kHz can be heard. This is particularly common at night when other carriers from adjacent channels are traveling long distances due to atmospheric bounce.     Because AM assumes short term changes in the amplitude to be information, any electrical impulse will be picked up and demodulated along with the desired carrier. Hence lightning causes crashing noises when picked up by an AM radio near a storm. In contrast, FM suppresses short term changes in amplitude and is therefore much less prone to noise during storms and during reception of electrical noise impulses.     For ": null
    },
    {
        "digital modulation": "digital modulation"
    },
    {
        " schemes it has been shown that for properly implemented ": null
    },
    {
        "on-off keying": "on-off keying"
    },
    {
        "/": null
    },
    {
        "amplitude-shift keying": "amplitude-shift keying"
    },
    {
        " systems, ": null
    },
    {
        "co-channel": "co-channel interference"
    },
    {
        " rejection": "electronic selectivity"
    },
    {
        " can be better than for ": null
    },
    {
        "frequency-shift keying": "frequency-shift keying"
    }
]