[
    {
        "     Cardiology  is a branch of ": null
    },
    {
        "medicine": "medicine"
    },
    {
        " that deals with the disorders of the ": null
    },
    {
        "heart": "heart"
    },
    {
        " as well as some parts of the ": null
    },
    {
        "circulatory system": "circulatory system"
    },
    {
        ". The field includes ": null
    },
    {
        "medical diagnosis": "medical diagnosis"
    },
    {
        " and treatment of ": null
    },
    {
        "congenital heart defect": "congenital heart defect"
    },
    {
        "s, ": null
    },
    {
        "coronary artery disease": "coronary artery disease"
    },
    {
        ", ": null
    },
    {
        "heart failure": "heart failure"
    },
    {
        ", ": null
    },
    {
        "valvular heart disease": "valvular heart disease"
    },
    {
        " and ": null
    },
    {
        "electrophysiology": "electrophysiology"
    },
    {
        ". ": null
    },
    {
        "Physicians": "physician"
    },
    {
        "who specialize in this field of medicine are called cardiologists, a specialty of ": null
    },
    {
        "internal medicine": "internal medicine"
    },
    {
        ". Pediatric cardiologists are ": null
    },
    {
        "pediatricians": "pediatrician"
    },
    {
        "who specialize in cardiology. Physicians who specialize in cardiac surgery are called  cardiothoracic surgeon s or cardiac surgeons, a specialty of ": null
    },
    {
        "general surgery": "general surgery"
    },
    {
        ".     Although the cardiovascular system is inextricably linked to blood, cardiology is relatively unconcerned with ": null
    },
    {
        "hematology": "hematology"
    },
    {
        " and its diseases. Some obvious exceptions that affect the function of the heart would be blood tests , decreased oxygen carrying capacity , and ": null
    },
    {
        "coagulopathies": "coagulopathy"
    },
    {
        ".       All cardiologists study the disorders of the heart, but the study of adult and child heart disorders are through different training pathways. Therefore, an adult cardiologist is inadequately trained to take care of children, and pediatric cardiologists are not trained to take care of adult heart disease. The surgical aspects are not included in cardiology and are in the domain of ": null
    },
    {
        "cardiothoracic surgery": "cardiothoracic surgery"
    },
    {
        ". For example, ": null
    },
    {
        "coronary artery bypass surgery": "coronary artery bypass surgery"
    },
    {
        " , ": null
    },
    {
        "cardiopulmonary bypass": "cardiopulmonary bypass"
    },
    {
        " and ": null
    },
    {
        "valve replacement": "valve replacement"
    },
    {
        " are surgical procedures performed by surgeons, not cardiologists. However the insertion of stents and pacemakers is performed by cardiologists       Cardiology is a specialty of ": null
    },
    {
        "internal medicine": "internal medicine"
    },
    {
        ". To be a cardiologist in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", a three-year residency in internal medicine is followed by a three-year fellowship in cardiology. It is possible to specialize further in a sub-specialty. Recognized sub-specialties in the United States by the ": null
    },
    {
        "ACGME": "accreditation council for graduate medical education"
    },
    {
        " are ": null
    },
    {
        "cardiac electrophysiology": "cardiac electrophysiology"
    },
    {
        ", ": null
    },
    {
        "echocardiography": "echocardiography"
    },
    {
        ", ": null
    },
    {
        "interventional cardiology": "interventional cardiology"
    },
    {
        ", and ": null
    },
    {
        "nuclear cardiology": "nuclear cardiology"
    },
    {
        ". Recognized subspecialties in the United States by the ": null
    },
    {
        "American Osteopathic Association Bureau of Osteopathic Specialists": "american osteopathic association bureau of osteopathic specialists"
    },
    {
        " include ": null
    },
    {
        "clinical cardiac electrophysiology": "clinical cardiac electrophysiology"
    },
    {
        " and ": null
    },
    {
        "interventional cardiology": "interventional cardiology"
    },
    {
        ".       While in India, a person needs to undergo three years of residency in General Medicine or Pediatrics after ": null
    },
    {
        "M.B.B.S": "m.b.b.s"
    },
    {
        " and then three years of residency in Cardiology to be a D.M/": null
    },
    {
        "Diplomate of National Board": "diplomate of national board"
    },
    {
        " in Cardiology.     Per ": null
    },
    {
        "doximity": "doximity"
    },
    {
        ", adult cardiologists make an average of $436,849 in the United States. Hamblin, James . theatlantic.com            ": null
    },
    {
        "Cardiac electrophysiology": "cardiac electrophysiology"
    },
    {
        " is the ": null
    },
    {
        "science": "science"
    },
    {
        " of elucidating, diagnosing, and treating the electrical activities of the ": null
    },
    {
        "heart": "heart"
    },
    {
        ". The term is usually used to describe studies of such phenomena by invasive catheter recording of spontaneous activity as well as of cardiac responses to ": null
    },
    {
        "programmed electrical stimulation ": "programmed electrical stimulation"
    },
    {
        ". These studies are performed to assess complex ": null
    },
    {
        "arrhythmias": "arrhythmias"
    },
    {
        ", elucidate symptoms, evaluate abnormal ": null
    },
    {
        "electrocardiograms": "electrocardiograms"
    },
    {
        ", assess risk of developing arrhythmias in the future, and design treatment. These procedures increasingly include therapeutic methods  in addition to diagnostic and prognostic procedures. Other therapeutic modalities employed in this field include ": null
    },
    {
        "antiarrhythmic drug": "antiarrhythmic drug"
    },
    {
        " therapy and implantation of ": null
    },
    {
        "pacemakers": "artificial pacemaker"
    },
    {
        " and automatic ": null
    },
    {
        "implantable cardioverter-defibrillators": "implantable cardioverter-defibrillators"
    },
    {
        " . Fauci, Anthony, et al. Harrisons Textbook of Medicine. New York: McGraw Hill, 2009. Braunwald, Eugene, ed. Heart Disease, 6th edition. Philadelphia: Saunders, 2011.     The cardiac ": null
    },
    {
        "electrophysiology study": "electrophysiology study"
    },
    {
        " typically measures the response of the injured or cardiomyopathic myocardium to PES on specific pharmacological regimens in order to assess the likelihood that the regimen will successfully prevent potentially fatal sustained ": null
    },
    {
        "ventricular tachycardia ": "ventricular tachycardia"
    },
    {
        " or ": null
    },
    {
        "ventricular fibrillation VF": "ventricular fibrillation"
    },
    {
        " in the future. Sometimes a series of EPS drug trials must be conducted to enable the cardiologist to select the one regimen for long-term treatment that best prevents or slows the development of VT or VF following PES. Such studies may also be conducted in the presence of a newly implanted or newly replaced cardiac pacemaker or AICD.          ": null
    },
    {
        "Clinical cardiac electrophysiology": "clinical cardiac electrophysiology"
    },
    {
        " is a branch of the medical specialty of cardiology and is concerned with the study and treatment of rhythm disorders of the heart. Cardiologists with expertise in this area are usually referred to as electrophysiologists. Electrophysiologists are trained in the mechanism, function, and performance of the electrical activities of the heart. Electrophysiologists work closely with other cardiologists and cardiac surgeons to assist or guide therapy for heart rhythm disturbances . They are trained to perform interventional and surgical procedures to treat cardiac arrhythmia.     The training required to become an electrophysiologist is long and requires 7 to 8 years after medical school . Three years of internal medicine residency, three years of Clinical Cardiology fellowship, and one to two years of clinical cardiac electrophysiology.            ": null
    },
    {
        "Cardiogeriatrics": "cardiogeriatrics"
    },
    {
        ", or geriatric cardiology, is the branch of cardiology and geriatric medicine that deals with the cardiovascular disorders in elderly people.     Cardiac disorders such as ": null
    },
    {
        "coronary heart disease": "coronary heart disease"
    },
    {
        ", including ": null
    },
    {
        "myocardial infarction": "myocardial infarction"
    },
    {
        ", ": null
    },
    {
        "heart failure": "heart failure"
    },
    {
        ", ": null
    },
    {
        "cardiomyopathy": "cardiomyopathy"
    },
    {
        ", and ": null
    },
    {
        "arrhythmias": "arrhythmia"
    },
    {
        "such as ": null
    },
    {
        "atrial fibrillation": "atrial fibrillation"
    },
    {
        ", are common and are a major cause of mortality in elderly people. Vascular disorders such as ": null
    },
    {
        "atherosclerosis": "atherosclerosis"
    },
    {
        " and ": null
    },
    {
        "peripheral arterial disease": "peripheral arterial disease"
    },
    {
        " cause significant morbidity and mortality in aged people.            Echocardiography uses standard two-dimensional, three-dimensional, and Doppler ultrasound to create images of the heart.     Echocardiography has become routinely used in the diagnosis, management, and follow-up of patients with any suspected or known heart diseases. It is one of the most widely used diagnostic tests in cardiology. It can provide a wealth of helpful information, including the size and shape of the heart , pumping capacity, and the location and extent of any tissue damage. An echocardiogram can also give physicians other estimates of heart function, such as a calculation of the cardiac output, ejection fraction, and diastolic function .     Echocardiography can help detect cardiomyopathies, such as hypertrophic cardiomyopathy, dilated cardiomyopathy, and many others. The use of stress echocardiography may also help determine whether any chest pain or associated symptoms are related to heart disease. The biggest advantage to echocardiography is that it is not invasive and has no known risks or side effects.            Interventional cardiology is a branch of cardiology that deals specifically with the catheter based treatment of structural heart diseases. A large number of procedures can be performed on the heart by catheterization. This most commonly involves the insertion of a sheath into the femoral artery and cannulating the heart under X-ray visualization .     The main advantages of using the interventional cardiology or radiology approach are the avoidance of the scars and pain, and long post-operative recovery. Additionally, interventional cardiology procedure of primary angioplasty is now the gold standard of care for an acute ": null
    },
    {
        "Myocardial infarction": "myocardial infarction"
    },
    {
        ". This procedure can also be done proactively, when areas of the vascular system become occluded from ": null
    },
    {
        "Atherosclerosis": "atherosclerosis"
    },
    {
        ". The Cardiologist will thread this sheath through the vascular system to access the heart. This sheath has a balloon and a tiny wire mesh tube wrapped around it, and if the cardiologist finds a blockage or ": null
    },
    {
        "Stenosis": "stenosis"
    },
    {
        ", they can inflate the balloon at the occlusion site in the vascular system to flatten or compress the plaque against the vascular wall. Once that is complete a ": null
    },
    {
        "Stent": "stent"
    },
    {
        " is placed as a type of scaffold to hold the vasculature open permanently.       In recent times, the focus is gradually shifting to Preventive cardiology due to increased Cardiovascular Disease burden at an early age. As per WHO, 37% of all premature deaths are due to cardiovascular diseases and out of this, 82% are in low and middle income countries.  Clinical cardiology is the sub specialty of Cardiology which looks after preventive cardiology and cardiac rehabilitation. Preventive cardiology also deals with routine preventive checkup though non invasive tests specifically ": null
    },
    {
        "Electrocardiography": "electrocardiography"
    },
    {
        ", Stress Tests, Lipid Profile and General Physical examination to detect any cardiovascular diseases at an early age while cardiac rehabilitation is the upcoming branch of cardiology which helps a person regain his overall strength and live a normal life after a cardiovascular event.       ": null
    },
    {
        "Helen B. Taussig": "helen b. taussig"
    },
    {
        " is known as the founder of pediatric cardiology. She became famous through her work with ": null
    },
    {
        "Tetralogy of Fallot": "tetralogy of fallot"
    },
    {
        ", a congenital heart defect in which oxygenated and deoxygenated blood enters the circulatory system resulting from a ": null
    },
    {
        "ventricular septal defect": "ventricular septal defect"
    },
    {
        " right beneath the aorta. This condition causes newborns to have a bluish-tint, ": null
    },
    {
        "cyanosis": "cyanosis"
    },
    {
        ", and have a deficiency of oxygen to their tissues, ": null
    },
    {
        "hypoxemia": "hypoxemia"
    },
    {
        ". She worked with ": null
    },
    {
        "Alfred Blalock": "alfred blalock"
    },
    {
        " and ": null
    },
    {
        "Vivien Thomas": "vivien thomas"
    },
    {
        " at the ": null
    },
    {
        "Johns Hopkins Hospital": "johns hopkins hospital"
    },
    {
        " where they experimented with dogs to look at how they would attempt to surgically cure these blue babies. They eventually figured out how to do just that by the ": null
    },
    {
        "anastomosis": "anastomosis"
    },
    {
        " of the systemic artery to the pulmonary artery and called this the ": null
    },
    {
        "Blalock-Taussig Shunt": "blalock–taussig shunt"
    },
    {
        ".      Tetralogy of Fallot, pulmonary atresia, double outlet right ventricle, transposition of the great arteries, persistent truncus arteriosus, and Ebsteins anomaly are various congenital cyanotic heart diseases. Congenital cyanotic heart diseases is where something is wrong with the heart of a newborn and it is not oxygenating the blood efficiently.          ": null
    },
    {
        "Tetralogy of Fallot": "tetralogy of fallot"
    },
    {
        " is the most common congenital heart disease arising in 1–3 cases per 1,000 births. The cause of this defect is a ": null
    },
    {
        "ventricular septal defect": "ventricular septal defect"
    },
    {
        " and an ": null
    },
    {
        "overriding aorta": "overriding aorta"
    },
    {
        ". These two defects combined causes deoxygenated blood to bypass the lungs and going right back into the ": null
    },
    {
        "circulatory system": "circulatory system"
    },
    {
        ". The ": null
    },
    {
        "modified Blalock-Taussig shunt": "modified blalock-taussig shunt"
    },
    {
        " is usually used to fix the circulation. This procedure is done by placing a graft between the subclavian artery and the ipsilateral pulmonary artery to restore the correct blood flow.       ": null
    },
    {
        "Pulmonary Atresia": "pulmonary atresia"
    },
    {
        " happens in 7–8 per 100,000 births and is characterized by the aorta branching out of the right ventricle. This causes the deoxygenated blood to bypass the lungs and enter the circulatory system. Surgeries can fix this by redirecting the aorta and fixing the right ventricle and pulmonary artery connection.     There are two types of pulmonary atresia, classified by whether or not the baby also has a ": null
    },
    {
        "ventricular septal defect": "ventricular septal defect"
    },
    {
        ".     Pulmonary atresia with an intact ventricular septum: This type of pulmonary atresia is associated with complete and intact ": null
    },
    {
        "septum": "septum"
    },
    {
        " between the ventricles.   Pulmonary atresia with a ventricular septal defect: This type of pulmonary atresia happens when a ventricular septal defect allows blood to flow into and out of the right ventricle.       ": null
    },
    {
        "Double outlet right ventricle": "double outlet right ventricle"
    },
    {
        " is when both great arteries, the pulmonary artery and the aorta, are connected to the right ventricle. There is usually a VSD in different particular places depending on the variations of DORV, typically 50% are subaortic and 30%. The surgeries that can be done to fix this defect can vary due to the different physiology and blood flow in the defected heart. One way it can be cured is by a VSD closure and placing conduits to restart the blood flow between the left ventricle and the aorta and between the right ventricle and the pulmonary artery. Another way is systemic-to-pulmonary artery shunt in cases associated with ": null
    },
    {
        "pulmonary stenosis": "pulmonic stenosis"
    },
    {
        ". Also, a ": null
    },
    {
        "balloon atrial septostomy": "atrial septostomy"
    },
    {
        " can be done to fix DORV with the Taussig-Bing anomaly.          There are two different types of ": null
    },
    {
        "transposition of the great arteries": "transposition of the great vessels"
    },
    {
        ", ": null
    },
    {
        "Dextro-transposition of the great arteries": "dextro-transposition of the great arteries"
    },
    {
        " and ": null
    },
    {
        "Levo-transposition of the great arteries": "levo-transposition of the great arteries"
    },
    {
        ", depending on where the chambers and vessels connect. Dextro-transposition happens in about 1 in 4,000 newborns and is when the right ventricle pumps blood into the aorta and deoxygenated blood enters the blood stream. The temporary procedure is to create an ": null
    },
    {
        "atrial septal defect": "atrial septal defect"
    },
    {
        " . A permanent fix is more complicated and involves redirecting the pulmonary return to the right atrium and the systemic return to the left atrium, which is known as the ": null
    },
    {
        "Senning procedure": "senning procedure"
    },
    {
        ". The ": null
    },
    {
        "Rastelli procedure": "rastelli procedure"
    },
    {
        " can also be done by rerouting the left ventricular outflow, dividing the pulmonary trunk, and placing a conduit in between the right ventricle and pulmonary trunk. Levo-transposition happens in about 1 in 13,000 newborns and is characterized by the left ventricle pumping blood into the lungs and the right ventricle pumping the blood into the aorta. This may not produce problems at the beginning, but will eventually due to the different pressures each ventricle uses to pump blood. Switching the left ventricle to be the systemic ventricle and the right ventricle to pump blood into the pulmonary artery can repair levo-transposition.       ": null
    },
    {
        "Persistent truncus arteriosus": "persistent truncus arteriosus"
    },
    {
        " is when the ": null
    },
    {
        "truncus arteriosus": "truncus arteriosus"
    },
    {
        " fails to split into the aorta and pulmonary trunk. This occurs in about 1 in 11,000 live births and allows both oxygenated and deoxygenated blood into the body. The repair consists of a VSD closure and the Rastelli procedure.       ": null
    },
    {
        "Ebsteins anomaly": "ebsteins anomaly"
    },
    {
        " is characterized by a right atrium that is significantly enlarged and a heart that is shaped like a box. This is very rare and happens in less than 1% of congenital heart disease cases. The surgical repair varies depending on the severity of the disease.      Pediatric cardiology is a sub-specialty of ": null
    },
    {
        "pediatrics": "pediatrics"
    },
    {
        ". To become a pediatric cardiologist in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", one must complete a three-year residency in pediatrics, followed by a three-year fellowship in pediatric cardiology. Per ": null
    },
    {
        "doximity": "doximity"
    },
    {
        ", pediatric cardiologists make an average of $303,917 in the United States.                 As the center focus of cardiology, the heart has numerous anatomical features  and numerous physiological features  that have been encyclopedically documented for many centuries.     Disorders of the heart lead to ": null
    },
    {
        "heart disease": "heart disease"
    },
    {
        " and ": null
    },
    {
        "cardiovascular disease": "cardiovascular disease"
    },
    {
        " and can lead to a significant number of deaths: ": null
    },
    {
        "cardiovascular disease": "cardiovascular disease"
    },
    {
        " is the leading ": null
    },
    {
        "cause of death": "cause of death"
    },
    {
        " in the United States and caused 24.95% of total deaths in 2008.      The primary responsibility of the heart is to pump ": null
    },
    {
        "blood": "blood"
    },
    {
        " throughout the body.   It pumps blood from the body — called the ": null
    },
    {
        "systemic circulation": "systemic circulation"
    },
    {
        " — through the ": null
    },
    {
        "lungs": "lung"
    },
    {
        "— called the ": null
    },
    {
        "pulmonary circulation": "pulmonary circulation"
    },
    {
        " — and then back out to the body.   This means that the heart is connected to and affects the entirety of the body. Simplified, the heart is a circuit of the ": null
    },
    {
        "Circulation": "circulatory system"
    },
    {
        ".   While plenty is known about the healthy heart, the bulk of study in cardiology is in disorders of the heart and restoration, and where possible, of function.     The heart is a muscle that squeezes blood and functions like a pump.   Each part of the heart is susceptible to failure or dysfunction and the heart can be divided into the mechanical and the electrical parts.     The electrical part of the heart is centered on the periodic contraction of the ": null
    },
    {
        "muscle cells": "myocardium"
    },
    {
        " that is caused by the ": null
    },
    {
        "cardiac pacemaker": "cardiac pacemaker"
    },
    {
        " located in the ": null
    },
    {
        "sinoatrial node": "sinoatrial node"
    },
    {
        ".   The study of the electrical aspects is a sub-field of ": null
    },
    {
        "electrophysiology": "electrophysiology"
    },
    {
        " called ": null
    },
    {
        "cardiac electrophysiology": "cardiac electrophysiology"
    },
    {
        " and is epitomized with the ": null
    },
    {
        "electrocardiogram": "electrocardiogram"
    },
    {
        " .   The ": null
    },
    {
        "action potentials": "action potential"
    },
    {
        "generated in the pacemaker propagate throughout the heart in a specific pattern. The system that carries this potential is called the ": null
    },
    {
        "electrical conduction system": "electrical conduction system of the heart"
    },
    {
        ".   Dysfunction of the electrical system manifests in many ways and may include ": null
    },
    {
        "Wolff–Parkinson–White syndrome": "wolff–parkinson–white syndrome"
    },
    {
        ", ": null
    },
    {
        "ventricular fibrillation": "ventricular fibrillation"
    },
    {
        ", and ": null
    },
    {
        "heart block": "heart block"
    },
    {
        ".     The mechanical part of the heart is centered on the ": null
    },
    {
        "fluidic movement": "fluid mechanics"
    },
    {
        " of ": null
    },
    {
        "blood": "blood"
    },
    {
        " and the functionality of the heart as a ": null
    },
    {
        "pump": "pump"
    },
    {
        ".   The mechanical part is ultimately the purpose of the heart and many of the disorders of the heart disrupt the ability to move blood.   Failure to move sufficient blood can result in failure in other organs and may result in death if severe.   ": null
    },
    {
        "Heart failure": "heart failure"
    },
    {
        " is one condition in which the mechanical properties of the heart have failed or are failing, which means insufficient blood is being circulated.            ": null
    },
    {
        "Coronary circulation": "coronary circulation"
    },
    {
        " is the circulation of blood in the ": null
    },
    {
        "blood vessels": "blood vessel"
    },
    {
        "of the ": null
    },
    {
        "heart": "heart"
    },
    {
        " muscle . The vessels that deliver oxygen-rich blood to the ": null
    },
    {
        "myocardium": "myocardium"
    },
    {
        " are known as coronary arteries. The vessels that remove the deoxygenated blood from the heart muscle are known as cardiac veins. These include the ": null
    },
    {
        "great cardiac vein": "great cardiac vein"
    },
    {
        ", the ": null
    },
    {
        "middle cardiac vein": "middle cardiac vein"
    },
    {
        ", the ": null
    },
    {
        "small cardiac vein": "small cardiac vein"
    },
    {
        " and the ": null
    },
    {
        "anterior cardiac veins": "anterior cardiac veins"
    },
    {
        ".     As the left and right coronary arteries run on the surface of the heart, they can be called epicardial coronary arteries. These arteries, when healthy, are capable of autoregulation to maintain coronary blood flow at levels appropriate to the needs of the ": null
    },
    {
        "heart muscle": "myocardium"
    },
    {
        ". These relatively narrow vessels are commonly affected by ": null
    },
    {
        "atherosclerosis": "atherosclerosis"
    },
    {
        " and can become blocked, causing ": null
    },
    {
        "angina": "angina pectoris"
    },
    {
        " or a ": null
    },
    {
        "heart attack": "myocardial infarction"
    },
    {
        ".  The coronary arteries that run deep within the myocardium are referred to as subendocardial.     The coronary arteries are classified as end circulation , since they represent the only source of blood supply to the myocardium; there is very little redundant blood supply, which is why blockage of these vessels can be so critical.            The ": null
    },
    {
        "cardiac examination": "cardiac examination"
    },
    {
        " , is performed as part of a ": null
    },
    {
        "physical examination": "physical examination"
    },
    {
        ", or when a patient presents with ": null
    },
    {
        "chest pain": "chest pain"
    },
    {
        " suggestive of a cardiovascular ": null
    },
    {
        "pathology": "pathology"
    },
    {
        ". It would typically be modified depending on the ": null
    },
    {
        "indication": "indication"
    },
    {
        " and integrated with other examinations especially the ": null
    },
    {
        "respiratory examination": "respiratory examination"
    },
    {
        ".     Like all medical examinations, the cardiac examination follows the standard structure of inspection, palpation and auscultation.            Cardiology is concerned with the normal functionality of the heart and the deviation from a healthy heart.   Many disorders involve the heart itself but some are outside of the heart and in the vascular system.   Collectively, the two together are termed the cardiovascular system and diseases of one part tend to affect the other.                  ": null
    },
    {
        "Hypertension": "hypertension"
    },
    {
        ", also known as high blood pressure , is a ": null
    },
    {
        "long term": "chronic"
    },
    {
        " medical condition": "disease"
    },
    {
        " in which the ": null
    },
    {
        "blood pressure": "blood pressure"
    },
    {
        " in the ": null
    },
    {
        "arteries": "artery"
    },
    {
        " is persistently elevated.  High blood pressure usually does not cause symptoms.  Long term high blood pressure, however, is a major risk factor for ": null
    },
    {
        "coronary artery disease": "coronary artery disease"
    },
    {
        ", ": null
    },
    {
        "stroke": "stroke"
    },
    {
        ", ": null
    },
    {
        "heart failure": "heart failure"
    },
    {
        ", ": null
    },
    {
        "peripheral vascular disease": "peripheral vascular disease"
    },
    {
        ", ": null
    },
    {
        "vision loss": "vision loss"
    },
    {
        ", and ": null
    },
    {
        "chronic kidney disease": "chronic kidney disease"
    },
    {
        ".         Lifestyle factors can increase the risk of hypertension. These include excess salt in the diet, ": null
    },
    {
        "excess body weight": "overweight"
    },
    {
        ", ": null
    },
    {
        "smoking": "smoking"
    },
    {
        ", and alcohol. Hypertension can also be caused by other diseases, or as a side-effect of drugs.       Blood pressure is expressed by two measurements, the ": null
    },
    {
        "systolic": "systole"
    },
    {
        " and ": null
    },
    {
        "diastolic": "diastolic"
    },
    {
        " pressures, which are the maximum and minimum pressures, respectively. Normal blood pressure at rest is within the range of 100–140 ": null
    },
    {
        "millimeters mercury": "millimeter of mercury"
    },
    {
        " systolic and 60–90 mmHg diastolic.  High blood pressure is present if the resting blood pressure is persistently at or above 140/90 mmHg for most adults. Different numbers apply to children.  ": null
    },
    {
        "Ambulatory blood pressure monitoring": "ambulatory blood pressure monitoring"
    },
    {
        " over a 24-hour period appears more accurate than office best ": null
    },
    {
        "blood pressure measurement": "blood pressure measurement"
    },
    {
        ".       Lifestyle changes and medications can lower blood pressure and decrease the risk of health complications.  Lifestyle changes include weight loss, decreased salt intake, physical exercise, and a healthy diet. If lifestyle changes are not sufficient then ": null
    },
    {
        "blood pressure medications": "blood pressure medication"
    },
    {
        "are used. Up to three medications can control blood pressure in 90% of people.  The treatment of moderate to severe high arterial blood pressure  ref  /ref ref  /ref ref  /ref ref nameDiao2012  /ref ref nameLancet2015/ ref  /ref  ref name pmid10645931-a  /ref ref name pmid14597461  /ref ref name isbn0-7216-0240-1  /ref ref name urlHypertension: eMedicine Nephrology  /ref  ref name urlEssential hypertension : The Lancet  /ref  ref name pmid19393824  /ref  ref name pmid19110086  /ref ref name pmid19394559  /ref ref name pmid19275607  /ref ref name pmid19138169  /ref ref name pmid19124420  /ref  ref name pmid19427498  /ref ref name pmid19427502  /ref  ref name pmid19363848  /ref ref name pmid19427499  /ref  ref name pmid19393824 /  ref name pmid12728683  /ref ref name pmid19195963  /ref ref name pmid11842376  /ref  ref name pmid18672184  /ref ref name pmid19008688  /ref  ref name pmid19149532  /ref  !-- --  ref nameNIH2011Def  /ref !-- --  !-- --  ref nameNIH2011Sym-a  /ref  ref nameNIH2011Def/ ref nameNIH2011Type/  ref nameNIH2011Type/ !-- Cause and diagnosis --  !-- --  !-- --  !-- --  ref nameNIH2011Type  /ref ref nameMartin2012  /ref  ref nameNIH2011Def/ ref nameNIH2011Type/  ref  /ref !-- Treatment -- ref nameNIH2011Def/  !-- --  !-- -- !-- -- !-- --  !-- --  ref nameNIH2011Tx-Arrhythmias  /ref !-- Epidemiology -- ref nameNIH2011Risk  /ref ref nameZoni2014  /ref ref nameGDB2013a  /ref  ref nameMeh2007  /ref ref nameMeh2007/ ref nameNIH2011Risk/  ref  /ref  ref nameWong2014  /ref  ref nameGDB2013b/  ref nameHLB2014/  ref nameHLB2014/  ref nameHLB2014  /ref ref nameCDC2013/  ref nameCDC2013  /ref !--Cause and diagnosis --  ref  /ref ref nameWHO2011b  /ref  ref  /ref  ref  /ref !-- Prevention and treatment -- ref nameHLB2013P/ ref nameHLB2013P  /ref ref  /ref ref  /ref ref nameHLB2013Tr/  ref nameHLB2013Tr/  ref nameHLB2013Tr  /ref ref  /ref  ref  /ref !--Epidemiology --  ref nameGDB2013b  /ref  ref  /ref ref  /ref  ref nameUS2011/ ref nameUS2011  /ref  ref nameNIH2016What/  ref nameFie2009  /ref ref nameNIH2016Sign/  ref nameNIH2016Sign  /ref  ref nameNIH2016What  /ref !-- Cause and diagnosis --  !-- --  !-- --  !-- --  ref nameNIH2016Ca  /ref ref nameFie2009/  ref nameNIH2016What/ !-- Treatment and prognosis -- ref nameNIH2016Pre/  ref nameNIH2016Tx  /ref  ref  /ref  ref nameNIH2016Pre  /ref !-- Epidemiology and history --  !-- -- ref nameAHA2015Part4  /ref !-- -- ref nameNIH2016Risk  /ref !-- --  !-- -- ref nameAdam2012  /ref  ref nameNIH2011  /ref ref nameWHO2011/ ref nameNIH2011/  ref nameNIH2011Sym-b/ ref nameNIH2011Sym-b  /ref ref nameWHO2011  /ref  ref nameNIH2011Sym-b/ !-- Cause and diagnosis-- ref  /ref  ref nameWHO2011/ ref nameDean2014  /ref ref nameMil2011/  ref nameWHO2011/  ref nameWHO2011/  ref nameNIH2011/ !-- Prevention and treatment --  ref nameWHO2011/ ref nameNIH2011/  ref nameNIH2011Tx/ ref nameNIH2011Tx  /ref  ref nameNIH2011Tx/ ref nameNIH2011/ !-- Epidemiology and prognosis --  ref nameWHO2011/ ref nameGBD2015/ ref nameGBD2015  /ref ref nameWHO2011/ ref nameMil2011  /ref ref nameMil2011/ ref nameWHO2011/ ref nameGDB2013  /ref                              ref  /ref     ": null
    }
]