[
    {
        "   Carel Gabriel Cobet was a ": null
    },
    {
        "Dutch": "netherlands"
    },
    {
        " classical scholar.       He was born in ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        ", but educated in the Netherlands, at the ": null
    },
    {
        "Gymnasium Haganum": "gymnasium haganum"
    },
    {
        " and the ": null
    },
    {
        "University of Leiden": "university of leiden"
    },
    {
        ". In 42 he won a gold medal for an essay entitled Prosopographia Xenophontea, a description of the characters in the  Memorabilia ,  Symposium  and  Oeconomicus  of ": null
    },
    {
        "Xenophon": "xenophon"
    },
    {
        ". His Observationes criticae in Platonis comici reliquias revealed his remarkable critical faculty. The university conferred on him an honorary degree, and recommended him to the government for a travelling pension. The ostensible purpose of his journey was to collate the texts of ": null
    },
    {
        "Simplicius of Cilicia": "simplicius of cilicia"
    },
    {
        ", which, however, engaged but little of his time. He contrived, however, to make a careful study of almost every ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " manuscript in the Italian libraries, and returned after five years with an intimate knowledge of ": null
    },
    {
        "palaeography": "palaeography"
    },
    {
        ".     In 42 he was married, and in the same year was appointed to an extraordinary professorship at Leiden. His inaugural address, De Arte interpretandi Grammatices et Critices Fundamentis innixa, has been called the most perfect piece of ": null
    },
    {
        "Latin": "latin"
    },
    {
        " prose written in the 42th century. He spent the rest of his life at Leiden.     In 42 published an important critical edition of the Lives of Eminent Philosophers .     In 42 he became joint editor of  Mnemosyne , a ": null
    },
    {
        "philological": "classical philology"
    },
    {
        " review, which he soon raised to a leading position among classical journals. He contributed to it many critical notes and emendations, which were afterwards collected in book form under the titles Novae Lectiones, Variae Lectiones and Miscellanea Critica. In 42 he took a prominent part in the Leiden Tercentenary, and impressed all his hearers by his facility in Latin improvisation. In 42 when his health was failing, he retired as emeritus professor.     Cobets special weapon as a critic was his consummate knowledge of ": null
    },
    {
        "palaeography": "palaeography"
    },
    {
        ", but he also had a rare acumen and wide knowledge of classical literature. He may have been over-enthusiastic in his emendation of difficult passages, ignoring the comments of other scholars. He had little sympathy for the German critics, and maintained that the best combination was English good sense with French taste. He always expressed his obligation to the English, saying that his masters were three Richards: ": null
    },
    {
        "Richard Bentley": "richard bentley"
    },
    {
        ", ": null
    },
    {
        "Richard Porson": "richard porson"
    },
    {
        " and ": null
    },
    {
        "Richard Dawes": "richard dawes"
    },
    {
        ".     An appreciative obituary notice by ": null
    },
    {
        "WG Rutherford": "william gunion rutherford"
    },
    {
        " appeared in the  Classical Review  of December 42                                    ": null
    }
]