[
    {
        "           A cash flow is a real or virtual movement of ": null
    },
    {
        "money": "cash"
    },
    {
        ":     a cash flow in its narrow sense is a payment , especially from one central bank account to another; the term cash flow is mostly used to describe payments that are expected to happen in the future, are thus uncertain and therefore need to be forecast with cash flows;   a cash flow is determined by its time t, nominal amount N, currency CCY and account A; symbolically CF CF.   it is however popular to use cash flow in a less specified sense describing payments into or out of a business, project, or financial product.     Cash flows are narrowly interconnected with the concepts of value, interest rate and liquidity.   A cash flow that shall happen on a future day t N can be transformed into a cash flow of the same value in t 42 .         Cash flows are often transformed into measures that give information e.g. on a companys value and situation:     to determine a projects ": null
    },
    {
        "rate of return": "rate of return"
    },
    {
        " or value. The time of cash flows into and out of projects are used as inputs in financial models such as ": null
    },
    {
        "internal rate of return": "internal rate of return"
    },
    {
        " and ": null
    },
    {
        "net present value": "net present value"
    },
    {
        ".   to determine problems with a businesss ": null
    },
    {
        "liquidity": "accounting liquidity"
    },
    {
        ". Being profitable does not necessarily mean being liquid. A company can fail because of a shortage of cash even while profitable.   as an alternative measure of a businesss ": null
    },
    {
        "profit": "profit"
    },
    {
        "s when it is believed that ": null
    },
    {
        "accrual accounting": "accrual accounting"
    },
    {
        " concepts do not represent economic realities. For instance, a company may be notionally profitable but generating little operational cash . In such a case, the company may be deriving additional operating cash by issuing shares or raising additional debt finance.   cash flow can be used to evaluate the quality of income generated by ": null
    },
    {
        "accrual accounting": "accrual accounting"
    },
    {
        ". When net ": null
    },
    {
        "income": "income"
    },
    {
        " is composed of large non-cash items it is considered low quality.   to evaluate the risks within a financial product, e.g., matching cash requirements, evaluating default risk, re-investment requirements, etc.     Cash flow notion is based loosely on cash flow statement accounting standards. The term is flexible and can refer to time intervals spanning over past-future. It can refer to the total of all flows involved or a subset of those flows. Subset terms include net cash flow, ": null
    },
    {
        "operating cash flow": "operating cash flow"
    },
    {
        " and ": null
    },
    {
        "free cash flow": "free cash flow"
    },
    {
        ".       The net cash flow of a company over a period is equal to the change in cash balance over this period: positive if the cash balance increases , negative if the cash balance decreases. The total net cash flow for a project is the sum of cash flows that are classified in three areas:     ": null
    },
    {
        "Operational cash flows": "operating cash flow"
    },
    {
        ": cash received or expended as a result of the companys internal business activities. Operating cash flow of a project is determined by: OCFincremental earnings+depreciation+depreciationearning before interest and tax+ depreciation +depreciation + depreciation . Depreciation which locates at the end of the formula is called depreciation shield through which we can see that there is a negative relation between depreciation and cash flow.   Changing in net working capital: it is the cost or revenue related to the companys short-term asset like inventory.   ": null
    },
    {
        "Capital spending": "capital spending"
    },
    {
        ": this is the cost or gain related to the companys fix asset such as the cash used to buy a new equipment or the cash which is gained from selling an old equipment.     The sum of the three component above will be the cash flow for a project.     And the cash flow for a company also include three parts:     ": null
    },
    {
        "Operating cash flow": "operating cash flow"
    },
    {
        ": refers to the cash received or loss because of the internal activities of a company such as the cash received from sales revenue or the cash paid to the workers.   Investment cash flow: refers to the cash flow which related to the companys fix asset such as equipment building and so on such as the cash used to buy a new equipment or a building   Financing cash flow: cash flow from a companys financing activities like issuing stock or paying dividends.     The sum of the three components above will be the total cash flow of a company.            The net cash flow only provides a limited amount of information. Compare, for instance, the cash flows over three years of two companies:     ": null
    }
]