[
    {
        "      Catan: Cities & Knights , formerly The Cities and Knights of Catan is an expansion to the ": null
    },
    {
        "board game": "Board Game"
    },
    {
        "  The Settlers of Catan  for three to four players . It contains features taken from The Settlers of Catan, with emphasis on city development and the use of ": null
    },
    {
        "knight": "Knight"
    },
    {
        "s, which are used as a method of attacking other players as well as helping opponents defend Catan against a common foe. Cities & Knights can also be combined with the  Catan: Seafarers  expansion or with ": null
    },
    {
        "Catan: Traders & Barbarians": "Catan: Traders  &  Barbarians"
    },
    {
        " scenarios .     The Settlers of Catan Cities & Knights, the game is played to 13 victory points, as opposed to 10 as in the base game The Settlers of Catan.     The following cards are not used in Cities & Knights:   the Development Cards—which have been replaced by ": null
    },
    {
        "Progress Cards": "Catan: Cities  &  Knightsprogress Cards"
    },
    {
        ".   the Building Cost Cards—the information on these cards is provided by the ": null
    },
    {
        "City Upgrade Calendar": "Catan: Cities  &  Knightscity Upgrade Calendar"
    },
    {
        ".   the Largest Army Card—having a large army is still an advantage, but does not earn victory points so directly as in the regular version of The Settlers of Catan. Instead of soldier cards, one is now able to purchase the eponymous knights.       One of the main additions to the game is commodities, which are a type of secondary resource produced only by cities. Like resources, commodities are associated with a type of terrain, can be stolen by the robber , count against the resource hand limit, and may not be collected if the robber is on the terrain. Resources may be traded for commodities, and commodities may be traded for resources. Commodities can then be used to build city improvements , which provide additional benefits.     The commodities are paper , coin , and cloth .     When combining Cities & Knights with Barbarian Attack, the written rules are ambiguous with regards to whether commodities are collected along with normal resources when collecting from a Gold River tile, as well as whether or not commodities can be collected directly from Gold River tiles. However, online rules state that Gold can only buy you resources, not commodities.      A city on grain or brick gives two of each, as in the original Settlers. A city on wool, ore, or wood, produces one corresponding resource as well as one corresponding commodity . Grain and brick, however, are used for new purchasing options: grain activates knights, and brick can be used to build city walls.     In total there are 36 commodity cards: 12 paper , 12 cloth , and 12 coin .       A player with a city may use commodities to build city improvements, which allow several advantages. There are city improvements in five levels, and in three different categories. Each category of improvements requires a different commodity and higher levels require more cards of that commodity. At the third level, players earn a special ability, depending on the type of improvement.     The first player with an improvement at the fourth level can claim any of their cities as a metropolis, worth four victory points instead of two for that city. Each type of improvement has only one associated metropolis, and no city can be a metropolis of two different types . If a player is the first to build an improvement to the final level , they take the metropolis from its current holder.       The other significant concept in Cities & Knights is the concept of knights, which replace the concept of soldiers and the largest army. Knights are units that require continuous maintenance through their activation mechanism, but have a wide variety of functions. Knights can be promoted through three ranks, although promotion to the final rank is a special ability granted by the city improvement the Fortress.     Knights are placed on the board in a similar manner to settlements, and can be used to block opposing roads, active or not. However, knights must be activated in order to perform other functions, which immediately deactivate the knight. Knights cannot perform actions on the same turn they are activated, but can be reactivated on the same turn as performing an action. These actions include:   Moving along a road    Displacing opposing knights of a lower rank, forcing the lower ranked knight to retreat   Dispelling the robber  if it is stationed nearby     If a knight is promoted or forced to retreat, its active status does not change.     The standard Cities & Knights game comes with 24 knights, 6 of each color. The 5/6 player extension adds a further 12 knights, 6 each of two new colors.          Cities & Knights introduces a third die, known as the event die, which serves two functions. The first applies to the concept of barbarians, a periodic foe that all players must work together to defend against. Three of the sides of the event die have a picture of a ship on them. The other three sides have a symbol of a city gate, allowing players who have sufficiently built up a city to obtain progress cards .     The barbarians are represented by a ship positioned on a track representing the distance between the ship and Catan . Each time the event die shows a black ship, the barbarian ship takes one step closer to Catan. When the barbarians arrive at Catan, a special phase is immediately performed before all other actions . In this special phase, the barbarians attack strength, corresponding to the combined number of cities and metropolises held by all players, is compared to Catans defense strength, corresponding to the combined levels of all activated knights in play.     If the barbarians are successful in their attack , then the players must pay the consequence. The player who had the least defense will be attacked, and will have one city reduced to a settlement. If they only have settlements, or metropolises, then they are immune to barbarians and do not count as the player contributing the least defense.     Should Catan prevail, the player who contributes the most to Catans defense receives a special Defender of Catan card, worth a victory point. Regardless of the outcome, all knights are immediately deactivated, and the barbarian ship returns to its starting point on the track. In the event of a tie among the greatest contributors of knights, none of the tied players earn a Defender of Catan card. Instead, each of the tied players draw a progress card of the type of their choosing. There are 6 Defender of Catan cards.     As the likelihood of having the barbarian move closer to Catan is very high, a variant in common usage is that the robber  does not move until the first barbarian attack, nor can a knight move the robber before that point.     Examples where cities are lost:     Player A has 3 cities and 1 active strong knight. Player B has 1 city and 2 active basic knights. Player C has 2 cities and 1 active basic knight. When the barbarians attack, player C will lose one of his cities, because the attack strength is greater than all knights combined .   Player A has 3 cities and 2 active basic knights. Player B has 1 city, which is a metropolis, and no active knights. Player C has 2 cities and 1 active mighty knight. Player Bs city is a metropolis, and metropolises cannot be destroyed by the barbarians, so Player A loses a city because they have the next fewest active knights.   Player A has 2 cities and 2 active basic knights. Player B has 3 cities and 1 active strong knight. Player C has 2 cities and 2 active basic knights. All players will lose a city, because they all tie in the number of knights activated, and the barbarian attack strength is greater than number of active knights .   Player A has 3 cities and 1 active mighty knight and 1 active basic knight. Player B has 2 cities, which both are metropolises, and 1 active basic knight. Player C has 1 city, which is a metropolis, and no active knights. First in line to lose a city is player C, but because his city is a metropolis we need to look at the person next in line. This would be player B, but the same applies for him: he has activated only 1 knight, but both of his cities are metropolises. This leaves player A to lose a city.       The other significant outcome of the event die is Progress cards, which replace development cards. Because of the mechanics of progress cards explained below, one of the two white dice used in Settlers is replaced by a red die.     Progress cards are organized into three categories, corresponding to the three types of improvements. Yellow progress cards aid in commercial development, green progress cards aid in technological advancements, and blue progress cards allow for political moves. When a castle appears on the event die, progress cards of the corresponding type may be drawn depending on the value of the red die. Higher levels of city improvements increase the chance that progress cards will be drawn, with the highest level of city improvement allowing progress cards to be drawn regardless of the value on the red die.     Progress cards, unlike the development cards they replace, can be played on the turn that they are drawn, and more than one progress card can be played per turn. However, they can generally only be played after the dice are rolled. Progress cards granting victory points are an exception, being played immediately , while the Alchemist progress card, which allows a player to select the roll of the white and red dice, necessitates the card being played instead of rolling the numerical dice.     Players are allowed to keep four progress cards , and any additional ones must be discarded on the spot . The only exception to this rule is if a player receives a 5th non-victory point progress card on his or her turn, in which case he or she has the option of playing any one of the five progress cards in his or her hand during the turn, thus bringing the progress card count back down to four. While this clarification is not overtly stated in the Cities & Knights rule book, it is enforced in the online version of the game.     In total, there are 54 progress cards: 18 science, 18 politics, and 18 trade.       City walls are a minor addition to Cities & Knights that increase the number of resource and commodity cards a player is allowed in their hand before having to discard on a roll of 7. However, they do not protect the player from the robber or barbarians. Only cities and metropolises may have walls, and each city or metropolis can only have one wall, up to three walls per player. Each wall that the player has deployed permits the player to hold two more cards before being required to discard on a roll of seven. This results in a maximum of 13 cards.     If the barbarians pillage your city, then the city wall is also destroyed and the wall is removed from the board.     The game comes with 12 city walls, 3 of each color.       The merchant is another addition to Cities & Knights. Like the robber, the merchant is placed on a single land hex. Unlike the robber, the merchant has a beneficial effect.     The merchant can only be deployed through the use of a Merchant progress card , on a land hex near a city or a settlement. The player with the control of the merchant can trade the resource of that type at a two-to-one rate, as if the player had a control of a corresponding two-to-one harbor.     The player with the control of the merchant also earns a victory point. Both the victory point and the trade privilege are lost if another player takes control of the merchant.       In place of The Settlers of Catan standard improvement cost card, Cities & Knights gives a calendar type flip-chart to each player, of course still matching that players color. The top of the chart has the standard costs from the Settlers game . It does not include the Development Card cost as those cards are not used in a Cities & Knights game. It does include the costs of hiring a knight, upgrading a knights level or strength, and the cost to activate a knight. It also includes the cost of a ship, which are not used in a regular game of Cities & Knights, but presumably this is to cater for players who have combined Cities & Knights and Seafarers.     Those are only the rudimentary costs of the game however. The calendar also shows the costs of the next city improvement in each of the three categories  — as a city is improved in a category, that segment has its card flipped down calendar style to reveal the newly built improvement, any advantages gained by the improvement, and the updated cost of upgrading to the next level in that category. Each segment, as it is flipped down, also shows the updated dice pattern needed to earn the player a progress card in that category.         of the author Klaus Teuber   Official PC version of  ": null
    }
]