[
    {
        "               Catherine of Aragon  was ": null
    },
    {
        "Queen of England": "List Of English Consorts"
    },
    {
        " from June 1509 until May 1533 as the ": null
    },
    {
        "first wife": "Wives Of Henry Viii"
    },
    {
        " of ": null
    },
    {
        "King Henry VIII": "King Henry Viii"
    },
    {
        "; she was previously ": null
    },
    {
        "Princess of Wales": "Princess Of Wales"
    },
    {
        " as the wife of Henrys elder brother, ": null
    },
    {
        "Arthur": "Arthur, Prince Of Wales"
    },
    {
        ".     The daughter of ": null
    },
    {
        "Isabella I of Castile": "Isabella I Of Castile"
    },
    {
        " and ": null
    },
    {
        "Ferdinand II of Aragon": "Ferdinand Ii Of Aragon"
    },
    {
        ", Catherine was three years old when she was betrothed to ": null
    },
    {
        "Arthur, Prince of Wales": "Arthur, Prince Of Wales"
    },
    {
        ", ": null
    },
    {
        "heir apparent": "Heir Apparent"
    },
    {
        " to the English throne. They married in 1501, but Arthur died five months later. She held the position of ambassador of the Aragonese Crown to England in 1507, the first female ambassador in European history. Catherine subsequently married Arthurs younger brother, the recently ascended Henry VIII, in 1509. For six months in 1513, she served as ": null
    },
    {
        "regent": "Regent"
    },
    {
        " of England while Henry  VIII was in France. During that time the English won the ": null
    },
    {
        "Battle of Flodden": "Battle Of Flodden"
    },
    {
        ", an event in which Catherine played an important part with an emotional speech about English courage.     By 1525, Henry VIII was infatuated with ": null
    },
    {
        "Anne Boleyn": "Anne Boleyn"
    },
    {
        " and dissatisfied that his marriage to Catherine had produced no surviving sons, leaving their daughter, the future ": null
    },
    {
        "Mary  I of England": "Mary & Nbsp;I Of England"
    },
    {
        ", as ": null
    },
    {
        "heir presumptive": "Heir Presumptive"
    },
    {
        " at a time when there was no established precedent for a woman on the throne. He sought to have their marriage ": null
    },
    {
        "annulled": "Annulment"
    },
    {
        ", setting in motion a chain of events that led to Englands schism with the Catholic Church. When ": null
    },
    {
        "Pope Clement  VII": "Pope Clement & Nbsp;Vii"
    },
    {
        " refused to annul the marriage, Henry defied him by ": null
    },
    {
        "assuming supremacy": "Acts Of Supremacy"
    },
    {
        " over religious matters. In 1533 their marriage was consequently declared invalid and Henry married Anne on the judgement of clergy in England, without reference to the Pope. Catherine refused to accept Henry as Supreme Head of the Church in England and considered herself the Kings rightful wife and queen, attracting much popular sympathy. Despite this, she was acknowledged only as Dowager Princess of Wales by Henry. After being banished from court by Henry, she lived out the remainder of her life at ": null
    },
    {
        "Kimbolton Castle": "Kimbolton Castle"
    },
    {
        ", and died there on 7 January 1536 of cancer. English people held Catherine in high esteem, and her death set off tremendous mourning.      The Education of a Christian Woman  by ": null
    },
    {
        "Juan Luis Vives": "Juan Luis Vives"
    },
    {
        ", controversial at its release for promoting that women have the right to an education, was commissioned by and dedicated to her in 1523. Such was Catherines impression on people that even her enemy, ": null
    },
    {
        "Thomas Cromwell": "Thomas Cromwell"
    },
    {
        ", said of her, If not for her sex, she could have defied all the heroes of History.  She successfully appealed for the lives of the rebels involved in the ": null
    },
    {
        "Evil May Day": "Evil May Day"
    },
    {
        ", for the sake of their families. Catherine also won widespread admiration by starting an extensive programme for the relief of the poor. She was a patron of ": null
    },
    {
        "Renaissance humanism": "Renaissance Humanism"
    },
    {
        ", and a friend of the great scholars ": null
    },
    {
        "Erasmus of Rotterdam": "Erasmus Of Rotterdam"
    },
    {
        " and ": null
    },
    {
        "Thomas More": "Thomas More"
    },
    {
        ".          Catherine was born at the ": null
    },
    {
        "Archbishops Palace of Alcalá de Henares": "Archbishops Palace Of Alcalá De Henares"
    },
    {
        " near Madrid, on the night of 16 December 1485. She was the youngest surviving child of King ": null
    },
    {
        "Ferdinand  II of Aragon": "Ferdinand & Nbsp;Ii Of Aragon"
    },
    {
        " and Queen ": null
    },
    {
        "Isabella  I of Castile": "Isabella & Nbsp;I Of Castile"
    },
    {
        ". Catherine was quite short in stature with long red hair, wide blue eyes, a round face, and a fair complexion. She was descended, on her maternal side, from the ": null
    },
    {
        "House of Lancaster": "House Of Lancaster"
    },
    {
        ", an English royal house; her great-grandmother ": null
    },
    {
        "Catherine of Lancaster": "Catherine Of Lancaster"
    },
    {
        ", after whom she was named, and her great-great-grandmother ": null
    },
    {
        "Philippa of Lancaster": "Philippa Of Lancaster"
    },
    {
        " were both daughters of ": null
    },
    {
        "John of Gaunt": "John Of Gaunt"
    },
    {
        " and granddaughters of ": null
    },
    {
        "Edward  III of England": "Edward & Nbsp;Iii Of England"
    },
    {
        ". Consequently, she was third cousin of her father-in-law, ": null
    },
    {
        "Henry VII of England": "Henry Vii Of England"
    },
    {
        ", and fourth cousin of her mother-in-law ": null
    },
    {
        "Elizabeth of York": "Elizabeth Of York"
    },
    {
        ".     Catherine was educated by a tutor, ": null
    },
    {
        "Alessandro Geraldini": "Alessandro Geraldini"
    },
    {
        ", who was a clerk in Holy Orders. She studied arithmetic, canon and civil law, classical literature, genealogy and heraldry, history, philosophy, religion, and theology. She had a strong religious upbringing and developed her Roman Catholic faith that would play a major role in later life. She learned to speak, read and write in Spanish and Latin, and spoke French and Greek. She was also taught domestic skills, such as cooking, dancing, drawing, embroidery, good manners, lace-making, music, needlepoint, sewing, spinning, and weaving. Scholar ": null
    },
    {
        "Erasmus": "Erasmus"
    },
    {
        " later said that Catherine loved good literature which she had studied with success since childhood .     At an early age, Catherine was considered a suitable wife for ": null
    },
    {
        "Arthur, Prince of Wales": "Arthur, Prince Of Wales"
    },
    {
        ", heir apparent to the English throne, due to the English ancestry she inherited from her mother. By means of her mother, Catherine had a stronger legitimate claim to the English throne than King Henry VII himself through the first two wives of ": null
    },
    {
        "John of Gaunt, 1st Duke of Lancaster": "John Of Gaunt, 1St Duke Of Lancaster"
    },
    {
        ": ": null
    },
    {
        "Blanche of Lancaster": "Blanche Of Lancaster"
    },
    {
        " and ": null
    },
    {
        "Constance of Castile": "Constance Of Castile, Duchess Of Lancaster"
    },
    {
        ". In contrast, Henry VII was the descendant of Gaunts third marriage to ": null
    },
    {
        "Katherine Swynford": "Katherine Swynford"
    },
    {
        ", whose children were born out of wedlock and only legitimised after the death of Constance and the marriage of John to Katherine. The children of John and Katherine, while legitimised, were barred from inheriting the English throne, a stricture that was ignored in later generations. Because of Henrys descent through illegitimate children barred from succession to the English throne, the Tudor monarchy was not accepted by all European kingdoms. At the time, the ": null
    },
    {
        "House of Trastámara": "House Of Trastámara"
    },
    {
        " was the most prestigious in Europe, due to the rule of the ": null
    },
    {
        "Catholic Monarchs": "Catholic Monarchs"
    },
    {
        ", so the alliance of Catherine and Arthur validated the House of Tudor in the eyes of European royalty and strengthened the Tudor claim to the English throne via Catherine of Aragons ancestry. It would have given a male heir an indisputable claim to the throne. The two were ": null
    },
    {
        "married by proxy": "Married By Proxy"
    },
    {
        " on 19 May 1499 and corresponded in Latin until Arthur turned fifteen, when it was decided that they were old enough to be married.     Catherine was accompanied to England by the ambassadors ": null
    },
    {
        "Diego Fernández de Córdoba y Mendoza": "Diego Fernández De Córdoba Y Mendoza"
    },
    {
        ", 3rd Count of Cabra, ": null
    },
    {
        "Alonso de Fonseca": "Alonso De Fonseca Y Acevedo"
    },
    {
        ", archbishop of Santiago de Compostela, and ": null
    },
    {
        "Antonio de Rojas Manrique": "Antonio De Rojas Manrique"
    },
    {
        ", bishop of Mallorca.    She brought a group of her African attendants with her, including one identified as the trumpeter ": null
    },
    {
        "John Blanke": "John Blanke"
    },
    {
        ". They are the first Africans recorded to have arrived in London at the time, and were considered luxury servants. They caused a great impression about the princess and the power of her family. Her Spanish retinue was supervised by her ": null
    },
    {
        "duenna": "Duenna"
    },
    {
        ", ": null
    },
    {
        "Elvira Manuel": "Elvira Manuel"
    },
    {
        ".            Then-15-year-old Catherine departed from ": null
    },
    {
        "A Coruña": "A Coruña"
    },
    {
        " on 17 August 1501 and met Arthur on 4 November at ": null
    },
    {
        "Dogmersfield": "Dogmersfield"
    },
    {
        " in Hampshire. Little is known about their first impressions of each other, but Arthur did write to his parents-in-law that he would be a true and loving husband and told his parents that he was immensely happy to behold the face of his lovely bride . The couple had corresponded in Latin, but found that they could not understand each others spoken conversation, because they had learned different Latin pronunciations. Ten days later, on 14 November 1501, they were married at ": null
    },
    {
        "Old St. Pauls Cathedral": "Old St. Pauls Cathedral"
    },
    {
        ". A dowry of 200,000 ducats had been agreed, and half was paid shortly after the marriage.      Once married, Arthur was sent to ": null
    },
    {
        "Ludlow Castle": "Ludlow Castle"
    },
    {
        " on the borders of Wales to preside over the ": null
    },
    {
        "Council of Wales and the Marches": "Council Of Wales And The Marches"
    },
    {
        ", as was his duty as Prince of Wales, and his bride accompanied him. The couple stayed at ": null
    },
    {
        "Castle Lodge, Ludlow": "Castle Lodge, Ludlow"
    },
    {
        ". A few months later, they both became ill, possibly with the ": null
    },
    {
        "sweating sickness": "Sweating Sickness"
    },
    {
        ", which was sweeping the area. Arthur died on 2 April 1502; 16-year-old Catherine recovered to find herself a widow.     At this point, Henry VII faced the challenge of avoiding the obligation to return her 200,000 ": null
    },
    {
        "ducat": "Ducat"
    },
    {
        " dowry, half of which he had not yet received, to her father, as required by her marriage contract should she return home.  Following the death of Queen Elizabeth in February 1503, King Henry VII initially considered marrying Catherine himself, but the opposition of her father and potential questions over the legitimacy of the couples issue ended the idea.  To settle the matter, it was agreed that Catherine would marry Henry VIIs second son, Henry, Duke of York, who was five years younger than she was. The death of Catherines mother, however, meant that her value in the marriage market decreased. Castile was a much larger kingdom than Aragon, and it was inherited by Catherines elder sister, ": null
    },
    {
        "Joanna": "Joanna Of Castile"
    },
    {
        ". Ostensibly, the marriage was delayed until Henry was old enough, but Ferdinand II procrastinated so much over payment of the remainder of Catherines dowry that it became doubtful that the marriage would take place. She lived as a virtual prisoner at ": null
    },
    {
        "Durham House": "Durham House"
    },
    {
        " in London. Some of the letters she wrote to her father complaining of her treatment have survived. In one of these letters she tells him that I choose what I believe, and say nothing. For I am not as simple as I may seem. She had little money and struggled to cope, as she had to support her ladies-in-waiting as well as herself. In 1507 she served as the Spanish ": null
    },
    {
        "ambassador": "Ambassador"
    },
    {
        " to England, the first female ambassador in European history. While Henry VII and his councillors expected her to be easily manipulated, Catherine went on to prove them wrong.     Marriage to Arthurs brother depended on the Pope granting a ": null
    },
    {
        "dispensation": "Papal Dispensation"
    },
    {
        " because ": null
    },
    {
        "canon law": "Canon Law"
    },
    {
        " forbade a man to ": null
    },
    {
        "marry his brothers widow": "Affinity"
    },
    {
        " . Catherine testified that her marriage to Arthur was never ": null
    },
    {
        "consummated": "Consummation"
    },
    {
        " as, also according to canon law, a marriage was not valid until consummated.              Catherines second wedding took place on 11 June 1509, seven years after Prince Arthurs death. She married ": null
    },
    {
        "Henry VIII": "Henry Viii Of England"
    },
    {
        ", who had only just acceded to the throne, in a private ceremony in the church of the Observant Friars outside ": null
    },
    {
        "Greenwich Palace": "Palace Of Placentia"
    },
    {
        ". She was 23 years of age.       On Saturday 23 June 1509, the traditional eve-of-coronation procession to Westminster was greeted by a large and enthusiastic crowd. As was the custom, the couple spent the night before their ": null
    },
    {
        "coronation": "Coronation"
    },
    {
        " at the ": null
    },
    {
        "Tower of London": "Tower Of London"
    },
    {
        ". On Midsummers Day, Sunday,  1509, Henry VIII and Catherine were ": null
    },
    {
        "anointed": "Anointing"
    },
    {
        " and ": null
    },
    {
        "crowned": "Coronation"
    },
    {
        " together by the Archbishop of Canterbury at a lavish ceremony at ": null
    },
    {
        "Westminster Abbey": "Westminster Abbey"
    },
    {
        ". The coronation was followed by a banquet in ": null
    },
    {
        "Westminster Hall": "Westminster Hall"
    },
    {
        ". Many new ": null
    },
    {
        "Knights of the Bath": "Knights Of The Bath"
    },
    {
        " were created in honour of the coronation.   In that month that followed, many social occasions presented the new Queen to the English public. She made a fine impression and was well received by the people of ": null
    },
    {
        "England": "England"
    },
    {
        ".          Catherine was pregnant seven times altogether:    In August 1509, two months after the wedding, Catherines first pregnancy was announced. On 31 January 1510, she delivered a stillborn girl.   In May 1510, four months after the loss of her first child, Catherine announced her second pregnancy. A son, ": null
    },
    {
        "Henry, Duke of Cornwall": "Henry, Duke Of Cornwall"
    },
    {
        ", was born on 1 January 1511. In his honour, guns were fired from the Tower of London and the city bells were rung, beacons were lit and free wine was distributed to all the population. Five days after his birth, on 6 January 1511, the prince was christened at Richmond Palace, his godparents being the Archbishop of Canterbury, the Earl of Surrey and the Countess of Devon. On 22 February 1511, after only 52 days of life, the young prince died suddenly. It was said that he died of an intestinal complaint.   By early 1513, Catherine was pregnant again. On 30 June 1513, Catherine was left as regent in England when Henry VIII went to fight in France. On 17 September 1513, she went into labour prematurely and gave birth to a boy who was either stillborn or died shortly after birth.   In June 1514, Catherine announced her fourth pregnancy. On 8 January 1515, she gave birth to a stillborn boy.   In the summer of 1515, Catherine announced her fifth pregnancy; however, less hope was placed on an heir following her previous failed pregnancies. On 18 February 1516, Catherine delivered a healthy girl at 4 a.m. at Greenwich Palace, Kent. She was named ": null
    },
    {
        "Mary": "Mary I Of England"
    },
    {
        " and christened three days later with great ceremony at the Church of ": null
    },
    {
        "Observant Friars": "Franciscan"
    },
    {
        ". Despite his evident disappointment, Henry VIII said that if it were a girl this time then surely boys would follow.   In the autumn of 1517, Catherine suffered another miscarriage.   In February 1518, Catherine announced her seventh pregnancy. In March, she visited Merton College, Oxford, and also made a pilgrimage to the shrine of St Frideswide, asking for a healthy son. On 10 November 1518 she gave birth to a daughter, but the child was weak and lived only a few hours.            On 11 June 1513, Henry appointed Catherine Regent in England with the titles Governor of the Realm and Captain General, while he went to France on a ": null
    },
    {
        "military campaign": "Battle Of Guinegate"
    },
    {
        ". Rymer, Thomas, ed., Foedera, vol. 13 , p. 370, Catherine was appointed Rectrix and Gubernatrix of England.   When ": null
    },
    {
        "Louis dOrléans, Duke of Longueville": "Louis I Dorléans, Duc De Longueville"
    },
    {
        ", was captured at ": null
    },
    {
        "Thérouanne": "Thérouanne"
    },
    {
        ", Henry sent him to stay in Catherines household. She wrote to Wolsey that she and her council would prefer the Duke to stay in the ": null
    },
    {
        "Tower of London": "Tower Of London"
    },
    {
        " as the Scots were so busy as they now be and she added her prayers for God to sende us as good lukke against the Scotts, as the King hath ther.  The war with Scotland occupied her subjects, and she was horrible busy with making standards, banners, and badges at ": null
    },
    {
        "Richmond Palace": "Richmond Palace"
    },
    {
        ". The Scots invaded and on 3 September 1513, she ordered ": null
    },
    {
        "Thomas Lovell": "Thomas Lovell"
    },
    {
        " to raise an army in the midland counties.     Catherine rode north in full armour to address the troops, despite being heavily pregnant at the time. Her fine speech was reported to the historian ": null
    },
    {
        "Peter Martyr dAnghiera": "Peter Martyr Danghiera"
    },
    {
        " in ": null
    },
    {
        "Valladolid": "Valladolid"
    },
    {
        " within a fortnight. Letters & Papers vol. 1 , no. 2299: Catherine was issued with banners at Richmond on 8 September, Letters & Papers, vol.1 , no.2243 Although an Italian newsletter said she was  north of London when news of the victory at ": null
    },
    {
        "Battle of Flodden Field": "Battle Of Flodden Field"
    },
    {
        " reached her, she was near ": null
    },
    {
        "Buckingham": "Buckingham"
    },
    {
        ". Letters & Papers Henry VIII vol. 1 no. 2278: Calendar State Papers Venice, vol.2, no. 340: Hall, Edward, Chronicle, , 564. From ": null
    },
    {
        "Woburn Abbey": "Woburn Abbey"
    },
    {
        " she sent a letter to Henry along with a piece of the bloodied coat of King ": null
    },
    {
        "James IV of Scotland": "James Iv Of Scotland"
    },
    {
        ", who died in the battle, for Henry to use as a banner at the siege of ": null
    },
    {
        "Tournai": "Tournai"
    },
    {
        ".     Catherines religious dedication increased as she became older, as did her interest in academics. She continued to broaden her knowledge and provide training for her daughter, Mary. Education among women became fashionable, partly because of Catherines influence, and she donated large sums of money to several colleges. Henry, however, still considered a male heir essential. The ": null
    },
    {
        "Tudor dynasty": "Tudor Dynasty"
    },
    {
        " was new, and its legitimacy might still be tested. ": null
    },
    {
        "A long civil war": "The Anarchy"
    },
    {
        " had been fought the last time a woman  had inherited the throne. The disasters of civil war were still fresh in living memory from the ": null
    },
    {
        "Wars of the Roses": "Wars Of The Roses"
    },
    {
        ".     In 1520, Catherines nephew, the ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        " Charles V": "Charles V, Holy Roman Emperor"
    },
    {
        ", paid a state visit to England, and she urged Henry to enter an alliance with Charles rather than with France. Immediately after his departure, she accompanied Henry to France on the celebrated visit to ": null
    },
    {
        "Francis I": "Francis I Of France"
    },
    {
        ", the ": null
    },
    {
        "Field of the Cloth of Gold": "Field Of The Cloth Of Gold"
    },
    {
        ". Within two years, war was declared against France and the Emperor was once again welcome in England, where plans were afoot to betroth him to Catherines daughter Mary.                    In 1525, Henry VIII became enamoured of ": null
    },
    {
        "Anne Boleyn": "Anne Boleyn"
    },
    {
        ", a lady-in-waiting to Queen Catherine; Anne was 11 years younger than Henry. Henry began pursuing her; Catherine was no longer able to bear children by this time. Henry began to believe that his marriage was cursed and sought confirmation from the Bible, which he interpreted to say that if a man marries his brothers wife, the couple will be childless. Leviticus 20:21  Even if her marriage to Arthur had not been consummated , Henrys interpretation of that biblical passage meant that their marriage had been wrong in the eyes of God. Whether the Pope at the time of Henry and Catherines marriage had the right to overrule Henrys claimed scriptural impediment would become a hot topic in Henrys campaign to wrest an annulment from the present Pope. It is possible that the idea of annulment had been suggested to Henry much earlier than this, and is highly probable that it was motivated by his desire for a son. Before Henrys father ascended the throne, England was beset by ": null
    },
    {
        "civil warfare": "Wars Of The Roses"
    },
    {
        " over rival claims to the English crown, and Henry may have wanted to avoid a similar uncertainty over the succession.     It soon became the one absorbing object of Henrys desires to secure an annulment. Catherine was defiant when it was suggested that she quietly retire to a nunnery, saying: God never called me to a nunnery. I am the Kings true and legitimate wife . He set his hopes upon an appeal to the ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        ", acting independently of Cardinal ": null
    },
    {
        "Thomas Wolsey": "Thomas Wolsey"
    },
    {
        ", whom he told nothing of his plans. ": null
    },
    {
        "William Knight": "William Knight"
    },
    {
        ", the Kings secretary, was sent to ": null
    },
    {
        "Pope Clement VII": "Pope Clement Vii"
    },
    {
        " to sue for an annulment, on the grounds that the dispensing ": null
    },
    {
        "bull": "Papal Bull"
    },
    {
        " of ": null
    },
    {
        "Pope Julius II": "Pope Julius Ii"
    },
    {
        " was obtained by false pretenses.     As the Pope was, at that time, the prisoner of Catherines nephew, ": null
    },
    {
        "Emperor Charles V": "Charles V, Holy Roman Emperor"
    },
    {
        ", following the ": null
    },
    {
        "Sack of Rome": "Sack Of Rome"
    },
    {
        " in May 1527, Knight had difficulty in obtaining access to him. In the end, Henrys envoy had to return without accomplishing much. Henry now had no choice but to put this great matter into the hands of Wolsey, who did all he could to secure a decision in Henrys favour.     Wolsey went so far as to convene an ecclesiastical court in England with a representative of the Pope presiding, and Henry and Catherine herself in attendance. The Pope had no intention of allowing a decision to be reached in England, and his legate was recalled.  The Pope forbade Henry to marry again before a decision was given in Rome. Wolsey had failed and was dismissed from public office in 1529. Wolsey then began a secret plot to have Anne Boleyn forced into exile and began communicating with the Pope to that end. When this was discovered, Henry ordered Wolseys arrest and, had he not been ": null
    },
    {
        "terminally ill": "Terminal Illness"
    },
    {
        " and died in 1530, he might have been executed for ": null
    },
    {
        "treason": "Treason"
    },
    {
        ". A year later, Catherine was banished from court, and her old rooms were given to Anne Boleyn. Catherine wrote in a letter to Charles V in 1531: My tribulations are so great, my life so disturbed by the plans daily invented to further the Kings wicked intention, the surprises which the King gives me, with certain persons of his council, are so mortal, and my treatment is what God knows, that it is enough to shorten ten lives, much more mine.   When ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        " William Warham": "William Warham"
    },
    {
        " died, the Boleyn familys chaplain, ": null
    },
    {
        "Thomas Cranmer": "Thomas Cranmer"
    },
    {
        ", was appointed to the vacant position.      When Henry decided to annul his marriage to Catherine, ": null
    },
    {
        "John Fisher": "John Fisher"
    },
    {
        " became her most trusted counsellor and one of her chief supporters. He appeared in the legates court on her behalf, where he shocked people with the directness of his language, and by declaring that, like ": null
    },
    {
        "John the Baptist": "John The Baptist"
    },
    {
        ", he was ready to die on behalf of the indissolubility of marriage. Henry was so enraged by this that he wrote a long Latin address to the legates in answer to Fishers speech. Fishers copy of this still exists, with his manuscript annotations in the margin which show how little he feared Henrys anger. The removal of the cause to Rome ended Fishers role in the matter, but Henry never forgave him. Other people who supported Catherines case included ": null
    },
    {
        "Thomas More": "Thomas More"
    },
    {
        "; Henrys own sister ": null
    },
    {
        "Mary Tudor, Queen of France": "Mary Tudor, Queen Of France"
    },
    {
        " ; ": null
    },
    {
        "María de Salinas": "María De Salinas"
    },
    {
        "; Holy Roman Emperor Charles V; ": null
    },
    {
        "Pope Paul III": "Pope Paul Iii"
    },
    {
        "; and Protestant Reformers ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        " and ": null
    },
    {
        "William Tyndale": "William Tyndale"
    },
    {
        ".            Upon returning to ": null
    },
    {
        "Dover": "Dover"
    },
    {
        " from a meeting with King ": null
    },
    {
        "Francis I of France": "Francis I Of France"
    },
    {
        " in ": null
    },
    {
        "Calais": "Calais"
    },
    {
        ", Henry married Anne Boleyn in a secret ceremony. Some sources speculate that Anne was already pregnant at the time but others testify that Anne  refused to sleep with Henry until they were married. Henry defended the legality of their union by pointing out that Catherine had previously been married. If she and Arthur had consummated their marriage, Henry by canon law had the right to remarry. On 23 May 1533, Cranmer, sitting in judgement at a special court convened at ": null
    },
    {
        "Dunstable Priory": "Dunstable Priory"
    },
    {
        " to rule on the validity of Henrys marriage to Catherine, declared the marriage illegal, even though Catherine testified she and Arthur had never had physical relations. Cranmer ruled Henry and Annes marriage valid five days later, on 28 May 1533.     Until the end of her life, Catherine would refer to herself as Henrys only lawful wedded wife and Englands only rightful queen, and her servants continued to address her by that title. Henry refused her the right to any title but ": null
    },
    {
        "Dowager": "Dowager"
    },
    {
        " Princess of Wales in recognition of her position as his brothers widow.     Catherine went to live at ": null
    },
    {
        "The More": "The More"
    },
    {
        " castle in the winter of 1531/32. In 1535 she was transferred to ": null
    },
    {
        "Kimbolton Castle": "Kimbolton Castle"
    },
    {
        ". There, she confined herself to one room , dressed only in the ": null
    },
    {
        "hair shirt": "Hair Shirt"
    },
    {
        " of the Order of St. Francis, and fasted continuously. While she was permitted to receive occasional visitors, she was forbidden to see her daughter Mary. They were also forbidden to communicate in writing, but sympathizers discreetly ferried letters between the two. Henry offered both mother and daughter better quarters and permission to see each other if they would acknowledge Anne Boleyn as the new queen. Both refused.     In late December 1535, sensing her death was near, Catherine made her ": null
    },
    {
        "will": "Will"
    },
    {
        ", and wrote to her nephew, the Emperor Charles V, asking him to protect her daughter. It has been alleged that she then penned one final letter to Henry, her most dear lord and husband : Sharon Turner, The History of England from the Earliest Period to the Death of Elizabeth        The authenticity of the letter itself has been questioned, but not Catherines attitude in its wording, which has been reported with variations in different sources. ": null
    },
    {
        "Giles Tremlett": "Giles Tremlett"
    },
    {
        " 2010 in Catherine of Aragon, Henry VIIIs Spanish Queen  p. 422     Catherine died at ": null
    },
    {
        "Kimbolton Castle": "Kimbolton Castle"
    },
    {
        " on  1536. The following day, news of her death reached the king. At the time there were rumours that she was poisoned, Letters and Papers of the Reign of Henry VIII, vol. X, no. 190 Letters and Papers of the Reign of Henry VIII, vol. X, no. 59 Letters and Papers of the Reign of Henry VIII, vol. X, no. 230 possibly by ": null
    },
    {
        "Gregory di Casale": "Gregory Di Casale"
    },
    {
        ". Letters and Papers of the Reign of Henry VIII, vol. X, no. 200 According to the chronicler ": null
    },
    {
        "Edward Hall": "Edward Hall"
    },
    {
        ", Anne Boleyn wore yellow for the mourning, which has been interpreted in various ways; ": null
    },
    {
        "Polydore Vergil": "Polydore Vergil"
    },
    {
        " interpreted this to mean that Anne did not mourn. Chapuys reported that it was King Henry who decked himself in yellow, celebrating the news and making a great show of his and Annes daughter, Elizabeth, to his courtiers. This was seen as distasteful and vulgar by many. Another theory is that the dressing in yellow was out of respect for Catherine as yellow was said to be the Spanish colour of mourning. Certainly, later in the day it is reported that Henry and Anne both individually and privately wept for her death. On the day of Catherines funeral, Anne Boleyn ": null
    },
    {
        "miscarried": "Miscarriage"
    },
    {
        " a boy. Rumours then circulated that Catherine had been poisoned by Anne or Henry, or both, as Anne had threatened to murder both Catherine and Mary on several occasions. The rumours were born after the apparent discovery during her embalming that there was a black growth on her heart that might have been caused by poisoning. Modern medical experts are in agreement that her hearts discolouration was due not to poisoning, but to ": null
    },
    {
        "cancer": "Heart Cancer"
    },
    {
        ", something which was not understood at the time.     Catherine was buried in ": null
    },
    {
        "Peterborough Cathedral": "Peterborough Cathedral"
    },
    {
        " with the ceremony due to her position as a Dowager ": null
    },
    {
        "Princess of Wales": "Princess Of Wales"
    },
    {
        ", and not a queen. Henry did not attend the funeral and forbade Mary to attend.          Catherine was a member of the ": null
    },
    {
        "Third Order of Saint Francis": "Third Order Of Saint Francis"
    },
    {
        " and she was punctilious in her religious obligations in the Order, integrating without demur her necessary duties as queen with her personal piety. After her divorce, she was quoted I would rather be a poor beggar’s wife and be sure of heaven, than queen of all the world and stand in doubt thereof by reason of my own consent.      The outward celebration of saints and holy ": null
    },
    {
        "relics": "Relic"
    },
    {
        "formed no major part of her personal devotions, which she rather expressed in the ": null
    },
    {
        "Mass": "Mass"
    },
    {
        ", prayer, ": null
    },
    {
        "confession": "Confession"
    },
    {
        " and ": null
    },
    {
        "penance": "Penance"
    },
    {
        ". Privately, however, she was aware of what she identified as the shortcomings of the papacy and church officialdom.  Her doubts about Church improprieties certainly did not extend so far as to support the allegations of corruption made public by ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        " in Wittenberg in 1517, which were soon to have such far-reaching consequences in initiating the ": null
    },
    {
        "Protestant Reformation": "Protestant Reformation"
    },
    {
        ".     In 1523 Alfonso de Villa Sancta, a learned ": null
    },
    {
        "friar": "Friar"
    },
    {
        " of the Observant branch of the ": null
    },
    {
        "Friars Minor": "Franciscan"
    },
    {
        " and friend of the kings old advisor ": null
    },
    {
        "Erasmus": "Erasmus"
    },
    {
        ", dedicated to the queen his book De Liberio Arbitrio adversus Melanchthonem denouncing ": null
    },
    {
        "Philip Melanchthon": "Philip Melanchthon"
    },
    {
        ", a supporter of Luther. Acting as her ": null
    },
    {
        "confessor": "Confessor"
    },
    {
        ", he was able to nominate her for the title of ": null
    },
    {
        "Defender of the Faith": "Fidei Defensor"
    },
    {
        " for denying Luthers arguments.       Catherine was of a very fair complexion, had blue eyes, and had a hair colour that was between ": null
    },
    {
        "reddish": "Red Hair"
    },
    {
        "-blonde and ": null
    },
    {
        "auburn": "Auburn Hair"
    },
    {
        ".   In her youth she was described as the most beautiful creature in the world  and that there was nothing lacking in her that the most beautiful girl should have . ": null
    },
    {
        "Thomas More": "Thomas More"
    },
    {
        " and Lord Herbert would reflect later in her lifetime that in regard to her appearance there were few women who could compete with the Queen in her prime.             The controversial book The Education of Christian Women by ": null
    },
    {
        "Juan Luis Vives": "Juan Luis Vives"
    },
    {
        ", which claimed women have the right to an education, was dedicated to and commissioned by her. Such was Catherines impression on people, that even her enemy, ": null
    },
    {
        "Thomas Cromwell": "Thomas Cromwell"
    },
    {
        ", said of her If not for her sex, she could have defied all the heroes of History.  She successfully appealed for the lives of the rebels involved in the ": null
    },
    {
        "Evil May Day": "Evil May Day"
    },
    {
        " for the sake of their families. Furthermore, Catherine won widespread admiration by starting an extensive programme for the relief of the poor. She was also a patron of ": null
    },
    {
        "Renaissance humanism": "Renaissance Humanism"
    },
    {
        ", and a friend of the great scholars ": null
    },
    {
        "Erasmus of Rotterdam": "Erasmus Of Rotterdam"
    },
    {
        " and ": null
    },
    {
        "Saint Thomas More": "Saint Thomas More"
    },
    {
        ". Some saw her as a martyr. Letters and Papers of Henry VIII, vol. X, no. 212 Letters and Papers of Henry VIII, vol. X, no. 232     In the reign of her daughter ": null
    },
    {
        "Mary I of England": "Mary I Of England"
    },
    {
        ", her marriage to Henry VIII was declared good and valid . Her daughter Queen Mary also had several portraits commissioned of Catherine, and it would not by any means be the last time she was painted. After her death, numerous portraits were painted of her, particularly of her speech at the Legatine Trial, a moment accurately rendered in Shakespeares play about Henry VIII.     Her tomb in ": null
    },
    {
        "Peterborough Cathedral": "Peterborough Cathedral"
    },
    {
        " can be seen and there is hardly ever a time when it is not decorated with flowers or pomegranates, her heraldic symbol. It bears the title Katharine Queen of England.     In the 20th century, ": null
    },
    {
        "George Vs": "George V"
    },
    {
        "wife, ": null
    },
    {
        "Mary of Teck": "Mary Of Teck"
    },
    {
        ", had her grave upgraded and there are now banners there denoting Catherine as a Queen of England. Every year at Peterborough Cathedral there is a service in her memory. There are processions, prayers, and various events in the Cathedral including processions to Catherines grave in which candles, pomegranates, flowers and other offerings are placed on her grave. On the service commemorating the 470th anniversary of her death, the Spanish Ambassador to the United Kingdom attended. During the 2010 service a rendition of Catherine of Aragons speech before the Legatine court was read by ": null
    },
    {
        "Jane Lapotaire": "Jane Lapotaire"
    },
    {
        ". There is a statue of her in her birthplace of ": null
    },
    {
        "Alcalá de Henares": "Alcalá De Henares"
    },
    {
        ", as a young woman holding a book and a rose.      Catherine has remained a popular biographical subject to the present day. The American historian ": null
    },
    {
        "Garrett Mattingly": "Garrett Mattingly"
    },
    {
        " was the author of a popular biography Katherine of Aragon in 1942. In 1966, Catherine and her many supporters at court were the subjects of Catherine of Aragon and her Friends, a biography by John E. Paul. In 1967, Mary M. Luke wrote the first book of her Tudor trilogy, Catherine the Queen which portrayed her and the controversial era of English history through which she lived.    In recent years, the historian ": null
    },
    {
        "Alison Weir": "Alison Weir"
    },
    {
        " covered her life extensively in her biography  The Six Wives of Henry  VIII , first published in 1991. ": null
    },
    {
        "Antonia Fraser": "Antonia Fraser"
    },
    {
        " did the same in her own 1992 biography of the same title; as did the British historian ": null
    },
    {
        "David Starkey": "David Starkey"
    },
    {
        " in his 2003 book Six Wives: The Queens of Henry  VIII. ": null
    },
    {
        "Giles Tremletts": "Giles Tremlett"
    },
    {
        "biography Catherine of Aragon: The Spanish Queen of Henry  VIII came out in 2010, and ": null
    },
    {
        "Julia Foxs": "Julia Fox"
    },
    {
        "2011 dual biography Sister Queens: The Noble, Tragic Lives of Katherine of Aragon and Juana, Queen of Castile.       In ": null
    },
    {
        "Alcalá de Henares": "Alcalá De Henares"
    },
    {
        ", the place of Catherines birth, a statue of Catherine as a young woman holding a rose and a book can be seen in the Archbishops Palace.   ": null
    },
    {
        "Peterborough": "Peterborough"
    },
    {
        " is ": null
    },
    {
        "twinned": "Town Twinning"
    },
    {
        " with the Spanish city of Alcalá de Henares, located in the wider Community of Madrid. Children from schools in the two places have learned about each other as part of the twinning venture, and artists have even come over from Alcalá de Henares to paint Catherines tombstone.   Many places in ": null
    },
    {
        "Ampthill": "Ampthill"
    },
    {
        " are named after Catherine. Also in Ampthill there is a cross in Ampthill Great Park named Queen Catherines Cross in her honour. It is on the site of the castle where she was sent during her divorce from the King.   ": null
    },
    {
        "Kimbolton Schools": "Kimbolton School"
    },
    {
        "science and mathematics block is called the QKB, or Queen Katherine Building.       Her baptismal name was Catalina , but Katherine was soon the accepted form in England after her marriage to Arthur. Catherine herself signed her name Katherine , Katherina , Katharine and sometimes Katharina . In a letter to her, Arthur, her husband, addressed her as Princess Katerine . Her daughter Queen Mary  I called her Quene Kateryn , in her will. Rarely were names, particularly first names, written in an exact manner during the sixteenth century and it is evident from Catherines own letters that she endorsed different variations.   Loveknots built into his various palaces by her husband, Henry  VIII, display the initials H   & amp;  K , as do other items belonging to Henry and Catherine, including gold goblets, a gold salt cellar, basins of gold, and candlesticks. Her tomb in ": null
    },
    {
        "Peterborough Cathedral": "Peterborough Cathedral"
    },
    {
        " is marked Katharine Queen of England .             Over the years, numerous artistic and cultural works have been dedicated to Catherine, have been written about her, or have mentioned her, including some by her husband ": null
    },
    {
        "Henry  VIII": "Henry Viii Of England"
    },
    {
        ", who wrote Grene growth the holy  about and for her, and ": null
    },
    {
        "Juan Luis Vives": "Juan Luis Vives"
    },
    {
        ", who dedicated The Education of Christian Women to her.     Catherine of Aragon has been portrayed in film, television, plays, novels, songs, poems, and other creative forms many times, and as a result she has stayed very much in popular memory. The first episode of  The Six Wives of Henry  VIII , is told from her point of view . ": null
    },
    {
        "Charlotte Hope": "Charlotte Hope"
    },
    {
        " plays her in the ": null
    },
    {
        "STARZ": "Starz"
    },
    {
        " mini-series  The Spanish Princess , which is based on the book The Constant Princess by ": null
    },
    {
        "Philippa Gregory": "Philippa Gregory"
    },
    {
        ". ": null
    },
    {
        "William Shakespeares": "William Shakespeare"
    },
    {
        "play  Henry  VIII  succeeds in recreating with great accuracy Catherines statement about the legitimacy of her marriage at the court in Blackfriars before King Henry, and Shakespeares portrayal of Catherine is remarkably sympathetic; however, most of the rest of the play is an attempt to absolve many, especially Henry  VIII, and the timing of key incidents is changed and other events are avoided .     In January 2013, the ": null
    },
    {
        "National Portrait Gallery": "National Portrait Gallery, London"
    },
    {
        " in London revealed that its curators had recently discovered that a portrait at ": null
    },
    {
        "Lambeth Palace": "Lambeth Palace"
    },
    {
        " formerly believed to have been a portrait of Catherine Parr in fact shows Catherine of Aragon. The National Portrait Gallery announced that the painting, which had hung in a private sitting room of the ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        " since at least the 19th century, would be paired with a portrait of Henry VIII already in the museums collection, and would remain at the museum on loan.        The song Green groweth the holly is said to have been written for her by Henry  VIII. ": null
    },
    {
        "nursery rhyme": "Nursery Rhyme"
    },
    {
        " I Had a Little Nut Tree": "I Had A Little Nut Tree"
    },
    {
        " she is the King of Spains Daughter.  ": null
    },
    {
        "Rick Wakemans": "Rick Wakeman"
    },
    {
        "album  The Six Wives of Henry VIII , Catherine of Aragon is listed as Track no. 1.            Catherine is the main character in:   Katharine, The Virgin Widow, The Shadow of the Pomegranate, and The Kings Secret Matter  by ": null
    },
    {
        "Jean Plaidy": "Eleanor Hibbert"
    },
    {
        "    My Catalina by ": null
    },
    {
        "Maureen Peters": "Maureen Peters"
    },
    {
        " The Kings Pleasure by ": null
    },
    {
        "Norah Lofts": "Norah Lofts"
    },
    {
        "     The Constant Princess  by ": null
    },
    {
        "Philippa Gregory": "Philippa Gregory"
    },
    {
        "    Patience, Princess Catherine by ": null
    },
    {
        "Carolyn Meyer": "Carolyn Meyer"
    },
    {
        "    Isabellas Daughter by Charity Bishop   Catherine of Aragon/My Tudor Queen by Alison Prince   Katherine of Aragon, The True Queen by ": null
    },
    {
        "Alison Weir": "Alison Weir"
    },
    {
        "    Falling Pomegranate Seeds: The Duty of Daughters  by Wendy J. Dunn    Catherine of Aragon: An Intimate History of Henry VIIIs True Wife by Amy Licence      Catherine is a character in:    Murder Most Royal  by Jean Plaidy   The Trusted Servant by Alison Macleod    The Other Boleyn Girl ,  The Kings Curse  and  Three Sisters, Three Queens  by Philippa Gregory    The Dark Rose, Volume 2 of  The Morland Dynasty , by ": null
    },
    {
        "Cynthia Harrod-Eagles": "Cynthia Harrod-Eagles"
    },
    {
        "  Wolf Hall  by ": null
    },
    {
        "Hilary Mantel": "Hilary Mantel"
    },
    {
        "    I, Elizabeth by Rosalind Miles    Keeper of the Kings Secrets by Michelle Diener        Catherine was portrayed by:    ": null
    },
    {
        "Sarah Siddons": "Sarah Siddons"
    },
    {
        " in the 18th century, in Shakespeares Henry  VIII. She told ": null
    },
    {
        "Samuel Johnson": "Samuel Johnson"
    },
    {
        " that the role of Queen Catherine was her favourite of all the Shakespearean roles she had played, as it was the most natural . ": null
    },
    {
        "Boswell, James": "Boswell, James"
    },
    {
        ".  Life of Samuel Johnson . May 1783.   ": null
    },
    {
        "Violet Vanbrugh": "Violet Vanbrugh"
    },
    {
        " in the 1911 short film production of ": null
    },
    {
        "William Shakespeares": "William Shakespeare"
    },
    {
        "play  Henry  VIII  . Hamilton Ball, Robert. The Shakespeare Film as Record: Sir Herbert Beerbohm Tree , Shakespeare Quarterly, Volume 3, No. 3, July 1952, pp. 227–36   German actress ": null
    },
    {
        "Hedwig Pauly-Winterstein": "Hedwig Pauly-Winterstein"
    },
    {
        " in the 1920 film  Anna Boleyn .    ": null
    },
    {
        "Rosalie Crutchley": "Rosalie Crutchley"
    },
    {
        " in  The Sword and the Rose , an account of ": null
    },
    {
        "Mary Tudors": "Mary Tudor"
    },
    {
        "romance with the ": null
    },
    {
        "Duke of Suffolk": "Charles Brandon, 1St Duke Of Suffolk"
    },
    {
        " in 1515.    Greek actress ": null
    },
    {
        "Irene Papas": "Irene Papas"
    },
    {
        " in ": null
    },
    {
        "Hal B. Wallis": "Hal B. Wallis"
    },
    {
        " film  Anne of the Thousand Days  .    British actress ": null
    },
    {
        "Annette Crosbie": "Annette Crosbie"
    },
    {
        " in a 90-minute television drama titled  Catherine of Aragon , the first part of the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " series  The Six Wives of Henry  VIII , for which she won the 1971 ": null
    },
    {
        "BAFTA TV Award for Best Actress": "British Academy Television Award For Best Actress1970S"
    },
    {
        ".    ": null
    },
    {
        "Frances Cuka": "Frances Cuka"
    },
    {
        " in the 1972 film  Henry  VIII and His Six Wives , based on the above TV series.  Keith Michell reprised his role as Henry  VIII. A scene was incorporated between Frances Cuka and ": null
    },
    {
        "Charlotte Rampling": "Charlotte Rampling"
    },
    {
        " to show their quiet, glacial enmity.   ": null
    },
    {
        "Annabelle Dowler": "Annabelle Dowler"
    },
    {
        " in Dr. ": null
    },
    {
        "David Starkeys": "David Starkey"
    },
    {
        "2001 documentary series  The Six Wives of Henry  VIII . The Six Wives of Henry VIII. PBS. Thirteen/WNET, 2003. Web. 28 April 2013.   Spanish actress ": null
    },
    {
        "Yolanda Vasquez": "Yolanda Vasquez"
    },
    {
        ", a brief appearance in the British TV version of  The Other Boleyn Girl  , opposite ": null
    },
    {
        "Jared Harris": "Jared Harris"
    },
    {
        " as Henry  VIII and ": null
    },
    {
        "Natascha McElhone": "Natascha Mcelhone"
    },
    {
        " as ": null
    },
    {
        "Mary Boleyn": "Mary Boleyn"
    },
    {
        ".    ": null
    },
    {
        "Assumpta Serna": "Assumpta Serna"
    },
    {
        " in the October 2003 ": null
    },
    {
        "ITV": "Itv"
    },
    {
        " two-part television drama  Henry  VIII , which starred ": null
    },
    {
        "Ray Winstone": "Ray Winstone"
    },
    {
        " in the title role.  Part 1 chronicled the kings life from the birth of his ": null
    },
    {
        "bastard": "Illegitimacy"
    },
    {
        " son, ": null
    },
    {
        "Henry Fitzroy": "Henry Fitzroy, 1St Duke Of Richmond And Somerset"
    },
    {
        " until the execution of Anne Boleyn in 1536. ": null
    },
    {
        "David Suchet": "David Suchet"
    },
    {
        " co-starred as ": null
    },
    {
        "Cardinal Wolsey": "Cardinal Wolsey"
    },
    {
        ".   ": null
    },
    {
        "Marge Simpson": "Marge Simpson"
    },
    {
        " , as Margerine of Aragon in  The Simpsons  episode ": null
    },
    {
        "Margical History Tour": "Margical History Tour"
    },
    {
        " .    ": null
    },
    {
        "Maria Doyle Kennedy": "Maria Doyle Kennedy"
    },
    {
        " in the ": null
    },
    {
        "Showtime": "Showtime"
    },
    {
        " 2007 television series  The Tudors  opposite ": null
    },
    {
        "Jonathan Rhys Meyers": "Jonathan Rhys Meyers"
    },
    {
        " as Henry. For her performance, Kennedy won an ": null
    },
    {
        "IFTA Award": "Ifta Film  &  Drama Awards"
    },
    {
        " for Best Actress in a Supporting Role Television,  and a ": null
    },
    {
        "Gemini Award": "Gemini Awards"
    },
    {
        " for an Actress in a Featured Supporting Role in a Dramatic Series.    ": null
    },
    {
        "Ana Torrent": "Ana Torrent"
    },
    {
        " in the ": null
    },
    {
        "2008 film adaptation": "The Other Boleyn Girl"
    },
    {
        " of The Other Boleyn Girl, with ": null
    },
    {
        "Eric Bana": "Eric Bana"
    },
    {
        " as Henry  VIII.    Virginia Weeks portrayed her in the play Six Dead Queens and an Inflatable Henry.    In 2008 she was played by ": null
    },
    {
        "Victoria Peiró": "Victoria Peiró"
    },
    {
        " in the film The Twisted Tale of Bloody Mary.    She is played by ": null
    },
    {
        "Siobhan Hewlett": "Siobhan Hewlett"
    },
    {
        " in the 2009 documentary  Henry VIII: The Mind of a Tyrant .    ": null
    },
    {
        "Kate Duchêne": "Kate Duchêne"
    },
    {
        " in a 2010 adaptation of Shakespeares  Henry  VIII  at ": null
    },
    {
        "Shakespeares Globe": "Shakespeares Globe"
    },
    {
        " Theatre.    ": null
    },
    {
        "Joanne Whalley": "Joanne Whalley"
    },
    {
        " in  Wolf Hall .    Natalia Rodríguez Arroyo in the Spanish historical series  Isabel .    Mélida Molina in the Spanish historical series  Carlos, rey emperador .    ": null
    },
    {
        "Paola Bontempi": "Paola Bontempi"
    },
    {
        " in the ": null
    },
    {
        "BBC One": "Bbc One"
    },
    {
        " history programme Six Wives with Lucy Worsley .    Jarneia Richard-Noel in the 2017 musical  Six , by ": null
    },
    {
        "Toby Marlow": "Toby Marlow"
    },
    {
        " and Lucy Moss.  It is set for a 2019 ": null
    },
    {
        "West End": "West End Theatre"
    },
    {
        " run.   ": null
    },
    {
        "Charlotte Hope": "Charlotte Hope"
    },
    {
        " portrays Catherine in the ": null
    },
    {
        "Starz": "Starz"
    },
    {
        " mini-series  The Spanish Princess  which is based on two novels by ": null
    },
    {
        "Philippa Gregory": "Philippa Gregory"
    },
    {
        ". The series aired in May 2019.           ": null
    }
]