[
    {
        "A cathode is the ": null
    },
    {
        "electrode": "Electrode"
    },
    {
        " from which a ": null
    },
    {
        "conventional current": "Conventional Current"
    },
    {
        " leaves a polarized electrical device. This definition can be recalled by using the ": null
    },
    {
        "mnemonic": "Mnemonic"
    },
    {
        " CCD for Cathode Current Departs. A conventional current describes the direction in which positive charges move. Electrons have a negative electrical charge, so the movement of electrons is opposite to that of the conventional current flow. Consequently, the mnemonic cathode current departs also means that electrons flow into the devices cathode from the external circuit.     The electrode through which conventional current flows the other way, into the device, is termed an ": null
    },
    {
        "anode": "Anode"
    },
    {
        ".            Conventional current flow is from cathode to anode outside of the cell or device , regardless of the cell or device type and operating mode.     Cathode ": null
    },
    {
        "polarity": "Electrical Polarity"
    },
    {
        " with respect to the ": null
    },
    {
        "anode": "Anode"
    },
    {
        " can be positive or negative depending on how the device is being operated. Positively charged ": null
    },
    {
        "cations": "Ion"
    },
    {
        " always move towards the anode and negatively charged ": null
    },
    {
        "anions": "Ion"
    },
    {
        " move towards the cathode , although cathode polarity depends on the device type, and can even vary according to the operating mode. In a device which absorbs energy of charge , the cathode is negative , and in a device which provides energy , the cathode is positive :   A battery or ": null
    },
    {
        "galvanic cell": "Galvanic Cell"
    },
    {
        " in use has a cathode that is the positive terminal since that is where the current flows out of the device. This outward current is carried internally by positive ions moving from the ": null
    },
    {
        "electrolyte": "Electrolyte"
    },
    {
        " to the positive cathode . It is continued externally by electrons moving into the battery which constitutes positive current flowing outwards. For example, the ": null
    },
    {
        "Daniell galvanic cells": "Daniell Cell"
    },
    {
        "copper electrode is the positive terminal and the cathode.   A battery that is recharging or an ": null
    },
    {
        "electrolytic cell": "Electrolytic Cell"
    },
    {
        " performing electrolysis has its cathode as the negative terminal, from which current exits the device and returns to the external generator as charge enters the battery/ cell. For example, reversing the current direction in a ": null
    },
    {
        "Daniell galvanic cell": "Daniell Cell"
    },
    {
        " converts it into an electrolytic cell  , Daniell cell can be reversed to, technically, produce an electrolytic cell. where the copper electrode is the positive terminal and also the ": null
    },
    {
        "anode": "Anode"
    },
    {
        ".   In a ": null
    },
    {
        "diode": "Diode"
    },
    {
        ", the cathode is the negative terminal at the pointed end of the arrow symbol, where current flows out of the device. Note: electrode naming for diodes is always based on the direction of the forward current , even for types such as ": null
    },
    {
        "Zener diodes": "Zener Diode"
    },
    {
        "or ": null
    },
    {
        "solar cells": "Solar Cell"
    },
    {
        "where the current of interest is the reverse current.   In ": null
    },
    {
        "vacuum tubes": "Vacuum Tube"
    },
    {
        "  it is the negative terminal where electrons enter the device from the external circuit and proceed into the tubes near-vacuum, constituting a positive current flowing out of the device.       The word was coined in 1834 from the ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " κάθοδος , descent or way down, by ": null
    },
    {
        "William Whewell": "William Whewell"
    },
    {
        ", who had been consulted  by ": null
    },
    {
        "Michael Faraday": "Michael Faraday"
    },
    {
        " over some new names needed to complete a paper on the recently discovered process of electrolysis. In that paper Faraday explained that when an electrolytic cell is oriented so that electric current traverses the decomposing body in a direction from East to West, or, which will strengthen this help to the memory, that in which the sun appears to move , the cathode is where the current leaves the electrolyte, on the West side: kata downwards, odos a way ; the way which the sun sets .      The use of West to mean the out direction may appear unnecessarily contrived. Previously, as related in the first reference cited above, Faraday had used the more straightforward term exode . His motivation for changing it to something meaning the West electrode was to make it immune to a possible later change in the direction convention for ": null
    },
    {
        "current": "Electric Current"
    },
    {
        ", whose exact nature was not known at the time. The reference he used to this effect was the ": null
    },
    {
        "Earths magnetic field": "Earths Magnetic Field"
    },
    {
        " direction, which at that time was believed to be invariant. He fundamentally defined his arbitrary orientation for the cell as being that in which the internal current would run parallel to and in the same direction as a hypothetical ": null
    },
    {
        "magnetizing current loop": "Solenoid"
    },
    {
        " around the local line of latitude which would induce a magnetic ": null
    },
    {
        "dipole": "Dipole"
    },
    {
        " field oriented like the Earths. This made the internal current East to West as previously mentioned, but in the event of a later convention change it would have become West to East, so that the West electrode would not have been the way out any more. Therefore, exode would have become inappropriate, whereas cathode meaning West electrode would have remained correct with respect to the unchanged direction of the actual phenomenon underlying the current, then unknown but, he thought, unambiguously defined by the magnetic reference. In retrospect the name change was unfortunate, not only because the Greek roots alone do not reveal the cathodes function any more, but more importantly because, as we now know, the Earths magnetic field direction on which the cathode term is based is subject to ": null
    },
    {
        "reversals": "Geomagnetic Reversal"
    },
    {
        " whereas the ": null
    },
    {
        "current": "Electric Current"
    },
    {
        " direction convention on which the exode term was based has no reason to change in the future.     Since the later discovery of the ": null
    },
    {
        "electron": "Electron"
    },
    {
        ", an easier to remember, and more durably technically correct , etymology has been suggested: cathode, from the Greek kathodos, way down, the way into the cell for electrons.       In ": null
    },
    {
        "chemistry": "Chemistry"
    },
    {
        ", a cathode is the ": null
    },
    {
        "electrode": "Electrode"
    },
    {
        " of an ": null
    },
    {
        "electrochemical cell": "Electrochemical Cell"
    },
    {
        " at which ": null
    },
    {
        "reduction": "Reduction"
    },
    {
        " occurs; a useful ": null
    },
    {
        "mnemonic": "Mnemonic"
    },
    {
        " to remember this is AnOx RedCat . ": null
    },
    {
        "Another mnemonic": "List Of Chemistry Mnemonicselectrodes"
    },
    {
        " is to note the cathode has a c, as does reduction. Hence, reduction at the cathode. Perhaps most useful would be to remember cathode corresponds to cation and anode corresponds to anion . The cathode can be negative like when the cell is electrolytic ; or positive as when the cell is galvanic . The cathode supplies electrons to the positively charged cations which flow to it from the electrolyte .     The cathodic current, in ": null
    },
    {
        "electrochemistry": "Electrochemistry"
    },
    {
        ", is the flow of ": null
    },
    {
        "electrons": "Electron"
    },
    {
        "from the cathode interface to a species in solution. The anodic current is the flow of electrons into the anode from a species in solution.       In an ": null
    },
    {
        "electrolytic cell": "Electrolytic Cell"
    },
    {
        ", the cathode is where the negative polarity is applied to drive the cell. Common results of reduction at the cathode are hydrogen gas or pure metal from metal ions. When discussing the relative reducing power of two redox agents, the couple for generating the more reducing species is said to be more cathodic with respect to the more easily reduced reagent.       In a ": null
    },
    {
        "galvanic cell": "Galvanic Cell"
    },
    {
        ", the cathode is where the positive ": null
    },
    {
        "pole": "Electrical Polarity"
    },
    {
        " is connected to allow the circuit to be completed: as the anode of the galvanic cell gives off electrons, they return from the circuit into the cell through the cathode.       When metal ions are reduced from ionic solution, they form a pure metal surface on the cathode. Items to be plated with pure metal are attached to and become part of the cathode in the electrolytic solution.              In a vacuum tube or electronic vacuum system, the cathode is a metal surface which emits free electrons into the evacuated space. Since the electrons are attracted to the positive nuclei of the metal atoms, they normally stay inside the metal and require energy to leave it; this is called the  work function  of the metal.  Cathodes are induced to emit electrons by several mechanisms:    Thermionic emission : The cathode can be heated. The increased thermal motion of the metal atoms knocks electrons out of the surface, an effect called thermionic emission. This technique is used in most vacuum tubes.    Field electron emission : A strong ": null
    },
    {
        "electric field": "Electric Field"
    },
    {
        " can be applied to the surface by placing an electrode with a high positive voltage near the cathode. The positively charged electrode attracts the electrons, causing some electrons to leave the cathodes surface. This process is used in ": null
    },
    {
        "cold cathodes": "Cold Cathode"
    },
    {
        "in some ": null
    },
    {
        "electron microscope": "Electron Microscope"
    },
    {
        "s,    and in microelectronics fabrication,    Secondary emission : An electron, atom or molecule colliding with the surface of the cathode with enough energy can knock electrons out of the surface. These electrons are called secondary electrons. This mechanism is used in ": null
    },
    {
        "gas-discharge lamps": "Gas-Discharge Lamp"
    },
    {
        "such as ": null
    },
    {
        "neon lamp": "Neon Lamp"
    },
    {
        "s.    Photoelectric emission : Electrons can also be emitted from the ": null
    },
    {
        "electrodes": "Electrode"
    },
    {
        "of certain metals when light of ": null
    },
    {
        "frequency": "Frequency"
    },
    {
        " greater than the threshold frequency falls on it. This effect is called photoelectric emission, and the electrons produced are called photoelectrons. This effect is used in ": null
    },
    {
        "phototubes": "Phototube"
    },
    {
        "and ": null
    },
    {
        "image intensifier": "Image Intensifier"
    },
    {
        " tubes.     Cathodes can be divided into two types:                  A hot cathode is a cathode that is heated by a ": null
    },
    {
        "filament": "Electrical Filament"
    },
    {
        " to produce electrons by ": null
    },
    {
        "thermionic emission": "Thermionic Emission"
    },
    {
        ". Ferris, Clifford Electron tube fundamentals in  The filament is a thin wire of a ": null
    },
    {
        "refractory metal": "Refractory Metal"
    },
    {
        " like ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        " heated red-hot by an electric current passing through it. Before the advent of transistors in the 1960s, virtually all electronic equipment used hot-cathode ": null
    },
    {
        "vacuum tube": "Vacuum Tube"
    },
    {
        "s. Today hot cathodes are used in vacuum tubes in radio transmitters and microwave ovens, to produce the electron beams in older ": null
    },
    {
        "cathode ray tube": "Cathode Ray Tube"
    },
    {
        " type televisions and computer monitors, in ": null
    },
    {
        "x-ray generator": "X-Ray Generator"
    },
    {
        "s, ": null
    },
    {
        "electron microscope": "Electron Microscope"
    },
    {
        "s, and ": null
    },
    {
        "fluorescent tube": "Fluorescent Tube"
    },
    {
        "s.     There are two types of hot cathodes:   Directly heated cathode: In this type, the filament itself is the cathode and emits the electrons directly. Directly heated cathodes were used in the first vacuum tubes, but today they are only used in ": null
    },
    {
        "fluorescent tube": "Fluorescent Tube"
    },
    {
        "s, some large transmitting vacuum tubes, and all X-ray tubes.   Indirectly heated cathode: In this type, the filament is not the cathode but rather heats the cathode which then emits electrons. Indirectly heated cathodes are used in most devices today. For example, in most vacuum tubes the cathode is a nickel tube with the filament inside it, and the heat from the filament causes the outside surface of the tube to emit electrons. The filament of an indirectly heated cathode is usually called the heater. The main reason for using an indirectly heated cathode is to isolate the rest of the vacuum tube from the electric potential across the filament. Many vacuum tubes use ": null
    },
    {
        "alternating current": "Alternating Current"
    },
    {
        " to heat the filament. In a tube in which the filament itself was the cathode, the alternating ": null
    },
    {
        "electric field": "Electric Field"
    },
    {
        " from the filament surface would affect the movement of the electrons and introduce hum into the tube output. It also allows the filaments in all the tubes in an electronic device to be tied together and supplied from the same current source, even though the cathodes they heat may be at different potentials.     In order to improve electron emission, cathodes are treated with chemicals, usually compounds of metals with a low ": null
    },
    {
        "work function": "Work Function"
    },
    {
        ". Treated cathodes require less surface area, lower temperatures and less power to supply the same cathode current. The untreated tungsten filaments used in early tubes had to be heated to 1400  °C , white-hot, to produce sufficient thermionic emission for use, while modern coated cathodes produce far more electrons at a given temperature so they only have to be heated to 425–600  °C   There are two main types of treated cathodes:      ": null
    },
    {
        "alkali metal": "Alkali Metal"
    },
    {
        " oxides, often ": null
    },
    {
        "barium": "Barium"
    },
    {
        " and ": null
    },
    {
        "strontium": "Strontium"
    },
    {
        " oxide. These are used in low-power tubes.   Thoriated tungsten – In high-power tubes, ": null
    },
    {
        "ion": "Ion"
    },
    {
        " bombardment can destroy the coating on a coated cathode. In these tubes a directly heated cathode consisting of a filament made of tungsten incorporating a small amount of ": null
    },
    {
        "thorium": "Thorium"
    },
    {
        " is used. The layer of thorium on the surface which reduces the work function of the cathode is continually replenished as it is lost by diffusion of thorium from the interior of the metal.           This is a cathode that is not heated by a filament. They may emit electrons by ": null
    },
    {
        "field electron emission": "Field Electron Emission"
    },
    {
        ", and in gas-filled tubes by ": null
    },
    {
        "secondary emission": "Secondary Emission"
    },
    {
        ". Some examples are electrodes in ": null
    },
    {
        "neon light": "Neon Light"
    },
    {
        "s, ": null
    },
    {
        "cold-cathode fluorescent lamps": "Cold-Cathode Fluorescent Lamp"
    },
    {
        " used as backlights in laptops, ": null
    },
    {
        "thyratron": "Thyratron"
    },
    {
        " tubes, and ": null
    },
    {
        "Crookes tube": "Crookes Tube"
    },
    {
        "s. They do not necessarily operate at room temperature; in some devices the cathode is heated by the electron current flowing through it to a temperature at which ": null
    },
    {
        "thermionic emission": "Thermionic Emission"
    },
    {
        " occurs. For example, in some fluorescent tubes a momentary high voltage is applied to the electrodes to start the current through the tube; after starting the electrodes are heated enough by the current to keep emitting electrons to sustain the discharge.     Cold cathodes may also emit electrons by ": null
    },
    {
        "photoelectric emission": "Photoelectric Emission"
    },
    {
        ". These are often called photocathodes and are used in ": null
    },
    {
        "phototubes": "Phototube"
    },
    {
        "used in scientific instruments and ": null
    },
    {
        "image intensifier": "Image Intensifier"
    },
    {
        " tubes used in night vision goggles.          In a ": null
    },
    {
        "semiconductor": "Semiconductor Device"
    },
    {
        " diode": "Diode"
    },
    {
        ", the cathode is the ": null
    },
    {
        "N–doped": "Doping"
    },
    {
        " layer of the ": null
    },
    {
        "PN junction": "Pn Junction"
    }
]