[
    {
        "   In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", the Cauchy integral theorem  in ": null
    },
    {
        "complex analysis": "complex analysis"
    },
    {
        ", named after ": null
    },
    {
        "Augustin-Louis Cauchy": "augustin-louis cauchy"
    },
    {
        " , is an important statement about ": null
    },
    {
        "line integral": "line integral"
    },
    {
        "s for ": null
    },
    {
        "holomorphic function": "holomorphic function"
    },
    {
        "s in the ": null
    },
    {
        "complex plane": "complex number"
    },
    {
        ". Essentially, it says that if two different paths connect the same two points, and a function is ": null
    },
    {
        "holomorphic": "holomorphic function"
    },
    {
        " everywhere in between the two paths, then the two path integrals of the function will be the same.         The theorem is usually formulated for closed paths as follows: let U be an ": null
    },
    {
        "open subset": "open subset"
    },
    {
        " of C which is ": null
    },
    {
        "simply connected": "simply connected"
    },
    {
        ", let f : U → C be a ": null
    },
    {
        "holomorphic function": "holomorphic function"
    },
    {
        ", and let \\!\\,\\gamma be a ": null
    },
    {
        "rectifiable path": "rectifiable path"
    },
    {
        " in U whose start point is equal to its end point. Then     : \\oint_\\gamma f\\,dz 42     A precise  version can be stated using ": null
    },
    {
        "winding number": "winding number"
    },
    {
        "s. The winding number of a closed curve around a point z 42  is the integral of f/, where f 42/ around the curve. It is an ": null
    },
    {
        "integer": "integer"
    },
    {
        ".   Briefly, the path integral along a ": null
    },
    {
        "Jordan curve": "jordan curve"
    },
    {
        " of a function holomorphic in the interior of the curve, is zero. Instead of a single closed path we can consider a linear combination of closed paths, where the scalars are integers. Such a combination is called a closed chain, and one defines an integral along the chain as a linear combination of integrals over individual paths. A closed chain is called a cycle in a region if it is homologous to zero in the region; that is, the winding number, expressed by the integral of 42/ over the closed chain, is zero for each point z 42  not in the region. This means that the closed chain does not wind around points outside the region. Then Cauchys theorem can be stated as the integral of a function holomorphic in an open set taken around any cycle in the open set is zero. An example is furnished by the ring-shaped region. This version is crucial for rigorous derivation of ": null
    },
    {
        "Laurent series": "laurent series"
    },
    {
        " and Cauchys residue formula without involving any physical notions such as cross cuts or deformations. The version enables the extension of Cauchys theorem to multiply-connected regions analytically.       As was shown by ": null
    },
    {
        "Édouard Goursat": "édouard goursat"
    },
    {
        ", Cauchys integral theorem can be proven assuming only that the complex derivative  exists everywhere in U. This is significant, because one can then prove ": null
    },
    {
        "Cauchys integral formula": "cauchys integral formula"
    },
    {
        " for these functions, and from that deduce these functions are in fact ": null
    },
    {
        "infinitely differentiable": "infinitely differentiable"
    },
    {
        ".     The condition that U be ": null
    },
    {
        "simply connected": "simply connected"
    },
    {
        " means that U has no holes or, in ": null
    },
    {
        "homotopy": "homotopy"
    },
    {
        " terms, that the ": null
    },
    {
        "fundamental group": "fundamental group"
    },
    {
        " of U is trivial; for instance, every open disk U_\\": null
    }
]