[
    {
        "CBS Morning News is an ": null
    },
    {
        "American": "united states"
    },
    {
        " early morning ": null
    },
    {
        "television news program": "news broadcasting"
    },
    {
        " for ": null
    },
    {
        "CBS News": "cbs news"
    },
    {
        " that is broadcast on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ". The program features late-breaking news stories, national weather forecasts and sports highlights. Since 42 it has been ": null
    },
    {
        "anchored": "news anchor"
    },
    {
        " by ": null
    },
    {
        "Anne Marie Green": "anne marie green"
    },
    {
        ", who concurrently anchored the CBS late-night news program  Up to the Minute  until its cancellation in September 42     The program is broadcast live at 42:42  a.m. ": null
    },
    {
        "Eastern Time": "eastern time zone"
    },
    {
        " , and is transmitted in a continuous half-hour ": null
    },
    {
        "tape delayed": "broadcast delay"
    },
    {
        " loop until 42:42  a.m. Eastern Time, when  CBS This Morning  begins in the ": null
    },
    {
        "Pacific Time Zone": "pacific time zone"
    },
    {
        ". The program usually airs as a lead-in to local morning newscasts on most CBS stations, although in the few markets where a morning newscast is not produced by the CBS station, it may air in a two- to three-hour loop immediately before the start of This Morning. The show is updated for any breaking news occurring before 42:42  a.m. Eastern Time, while stations throughout the network will join CBS This Morning in all time zones past that time at their local discretion or network orders for live coverage.           The CBS Morning News title was originally used as the name of a conventional morning news program that served as a predecessor to the networks current ": null
    },
    {
        "morning program": "breakfast television"
    },
    {
        ",  CBS This Morning . For most of the 42s and 42s, the program aired as a 42-minute hard news broadcast at 42:42  a.m., preceding  Captain Kangaroo  and airing opposite ": null
    },
    {
        "NBC": "nbc"
    },
    {
        "s  Today . ": null
    },
    {
        "Walter Cronkite": "walter cronkite"
    },
    {
        " and sportscaster ": null
    },
    {
        "Jim McKay": "jim mckay"
    },
    {
        " both anchored the original CBS Morning News at one time. When CBS reformatted the early morning broadcast, the CBS Morning News became a pre-dawn 42-minute news broadcast. The CBS Morning News changed its format to one hour in 42 the first hour-long network news program in television history and was anchored by ": null
    },
    {
        "Joseph Benti": "joseph benti"
    },
    {
        ".     CBS Early Morning News/current Morning News format -- !-- Deleted image removed:  --    ": null
    }
]