[
    {
        "        Celestial globes show the ": null
    },
    {
        "apparent positions": "Apparent Place"
    },
    {
        " of the ": null
    },
    {
        "stars": "Star"
    },
    {
        "in the sky. They omit the ": null
    },
    {
        "Sun": "Sun"
    },
    {
        ", ": null
    },
    {
        "Moon": "Moon"
    },
    {
        ", and ": null
    },
    {
        "planets": "Planet"
    },
    {
        "because the positions of these bodies vary relative to those of the stars, but the ": null
    },
    {
        "ecliptic": "Ecliptic"
    },
    {
        ", along which the Sun moves, is indicated.     There is an issue regarding the “": null
    },
    {
        "handedness": "Chirality"
    },
    {
        "” of celestial globes. If the globe is constructed so that the stars are in the positions they actually occupy on the imaginary ": null
    },
    {
        "celestial sphere": "Celestial Sphere"
    },
    {
        ", then the star field will appear reversed on the surface of the globe . This is because the view from ": null
    },
    {
        "Earth": "Earth"
    },
    {
        ", positioned at the centre of the celestial sphere, is of the ": null
    },
    {
        "gnomonic projection": "Gnomonic Projection"
    },
    {
        " inside of the celestial sphere, whereas the celestial globe is ": null
    },
    {
        "orthographic projection": "Orthographic Projection"
    },
    {
        " as viewed from the outside. For this reason, celestial globes are often produced in mirror image, so that at least the ": null
    },
    {
        "constellations": "Constellation"
    },
    {
        "appear as viewed from earth. Some modern celestial globes address this problem by making the surface of the globe ": null
    },
    {
        "transparent": "Transparency And Translucency"
    },
    {
        ". The stars can then be placed in their proper positions and viewed through the globe, so that the view is of the inside of the celestial sphere. However, the proper position from which to view the sphere would be from its centre, but the viewer of a transparent globe must be outside it, far from its centre. Viewing the inside of the sphere from the outside, through its transparent surface, produces serious distortions. ": null
    },
    {
        "Opaque": "Opacity"
    }
]