[
    {
        "        Celestial navigation, also known as astronavigation, is the ancient and modern practice of ": null
    },
    {
        "position fixing": "position fixing"
    },
    {
        " that enables a navigator to transition through a space without having to rely on estimated calculations, or ": null
    },
    {
        "dead reckoning": "dead reckoning"
    },
    {
        ", to know their position. Celestial ": null
    },
    {
        "navigation": "navigation"
    },
    {
        " uses sights , or angular measurements taken between a ": null
    },
    {
        "celestial body": "celestial body"
    },
    {
        "  and the visible ": null
    },
    {
        "horizon": "horizon"
    },
    {
        ". The Sun is most commonly used, but navigators can also use the Moon, a planet, ": null
    },
    {
        "Polaris": "polaris"
    },
    {
        ", or one of 42 other ": null
    },
    {
        "navigational stars": "navigational stars"
    },
    {
        " whose coordinates are tabulated in the ": null
    },
    {
        "nautical almanac": "nautical almanac"
    },
    {
        " and air ": null
    },
    {
        "almanac": "almanac"
    },
    {
        "s.     Celestial navigation is the use of angular measurements between celestial bodies and the visible horizon to locate ones position in the ": null
    },
    {
        "world": "earth"
    },
    {
        ", on land as well as at sea. At a given time, any celestial body is located directly over one point on the Earths surface. The ": null
    },
    {
        "latitude": "latitude"
    },
    {
        " and ": null
    },
    {
        "longitude": "longitude"
    },
    {
        " of that point is known as the celestial bodys ": null
    },
    {
        "geographic position": "apparent place"
    },
    {
        " , the location of which can be determined from tables in the nautical or air almanac for that year.   The measured angle between the celestial body and the visible horizon is directly related to the distance between the celestial bodys GP and the observers position. After some computations, referred to as ": null
    },
    {
        "sight reduction": "sight reduction"
    },
    {
        ", this measurement is used to plot a ": null
    },
    {
        "line of position": "position line"
    },
    {
        " on a ": null
    },
    {
        "navigational chart": "nautical chart"
    },
    {
        " or plotting worksheet, the observers position being somewhere on that line.  Sights on two celestial bodies give two such lines on the chart, intersecting at the observers position . Most navigators will use sights of three to five stars, if available, since that will result in only one common intersection and minimizes the chance of error. That premise is the basis for the most commonly used method of celestial navigation, referred to as the altitude-intercept method. At least three points must be plotted. The plot intersection will usually provide a triangle where the exact position is inside of it. Accuracy of the sights is indicated by the size of the triangle.     There are several other methods of celestial navigation that will also provide position-finding using ": null
    },
    {
        "sextant": "sextant"
    },
    {
        " observations, such as the noon sight, and the more archaic ": null
    },
    {
        "lunar distance method": "lunar distance"
    },
    {
        ". ": null
    },
    {
        "Joshua Slocum": "joshua slocum"
    },
    {
        " used the lunar distance method during the first recorded single-handed circumnavigation of the world. Unlike the altitude-intercept method, the noon sight and lunar distance methods do not require accurate knowledge of time. The altitude-intercept method of celestial navigation requires that the observer know exact Greenwich Mean Time at the moment of his observation of the celestial body, to the second—since for every four seconds that the time source  is in error, the position will be off by approximately one nautical mile.          An example illustrating the concept behind the ": null
    },
    {
        "intercept method": "intercept method"
    },
    {
        " for determining ones position is shown to the right.  In the adjacent image, the two circles on the map represent lines of position for the Sun and Moon at 42 ": null
    },
    {
        "GMT": "gmt"
    },
    {
        " on October 42 42 At this time, a navigator on a ship at sea measured the Moon to be 42 degrees above the horizon using a ": null
    },
    {
        "sextant": "sextant"
    },
    {
        ". Ten minutes later, the Sun was observed to be 42 degrees above the horizon. Lines of position were then calculated and plotted for each of these observations. Since both the Sun and Moon were observed at their respective angles from the same location, the navigator would have to be located at one of the two locations where the circles cross.     In this case the navigator is either located on the Atlantic Ocean, about  west of Madeira, or in South America, about  southwest of Asunción, Paraguay. In most cases, determining which of the two intersections is the correct one is obvious to the observer because they are often thousands of miles apart. As it is unlikely that the ship is sailing across South America, the position in the Atlantic is the correct one. Note that the lines of position in the figure are distorted because of the maps projection; they would be circular if plotted on a globe.     An observer at the ": null
    },
    {
        "Gran Chaco": "gran chaco"
    },
    {
        " point would see the Moon at the left of the Sun, and an observer in the Madeira point would see the Moon at the right of the Sun.          Accurate angle measurement evolved over the years. One simple method is to hold the hand above the horizon with ones arm stretched out. The width of the little finger is an angle just over 42 degrees elevation at extended arms length and can be used to estimate the elevation of the sun from the horizon plane and therefore estimate the time until sunset. The need for more accurate measurements led to the development of a number of increasingly accurate instruments, including the ": null
    },
    {
        "kamal": "kamal"
    },
    {
        ", ": null
    },
    {
        "astrolabe": "mariners astrolabe"
    },
    {
        ", ": null
    },
    {
        "octant": "octant"
    },
    {
        " and ": null
    },
    {
        "sextant": "sextant"
    },
    {
        ". The sextant and octant are most accurate because they measure angles from the horizon, eliminating errors caused by the placement of an instruments pointers, and because their dual mirror system cancels relative motions of the instrument, showing a steady view of the object and horizon.     Navigators measure distance on the globe in ": null
    },
    {
        "degree": "degree"
    },
    {
        "s, ": null
    },
    {
        "arcminute": "arcminute"
    },
    {
        "s and ": null
    },
    {
        "arcsecond": "arcsecond"
    },
    {
        "s. A ": null
    },
    {
        "nautical mile": "nautical mile"
    },
    {
        " is defined as 42 meters, but is also one minute of angle along a meridian on the Earth. Sextants can be read accurately to within 42 arcminutes, so the observers position can be determined within 42 miles, about 42 yards . Most ocean navigators, shooting from a moving platform, can achieve a practical accuracy of 42 miles , enough to navigate safely when out of sight of land.            Practical celestial navigation usually requires a ": null
    },
    {
        "marine chronometer": "marine chronometer"
    },
    {
        " to measure time, a ": null
    },
    {
        "sextant": "sextant"
    },
    {
        " to measure the angles, an ": null
    },
    {
        "almanac": "nautical almanac"
    },
    {
        " giving schedules of the coordinates of celestial objects, a set of sight reduction tables to help perform the height and ": null
    },
    {
        "azimuth": "azimuth"
    },
    {
        " computations, and a chart of the region.  With sight reduction tables, the only calculations required are addition and subtraction. Small handheld computers, laptops and even scientific calculators enable modern navigators to reduce sextant sights in minutes, by automating all the calculation and/or data lookup steps. Most people can master simpler celestial navigation procedures after a day or two of instruction and practice, even using manual calculation methods.     Modern practical navigators usually use celestial navigation in combination with ": null
    },
    {
        "satellite navigation": "satellite navigation"
    },
    {
        " to correct a ": null
    },
    {
        "dead reckoning": "dead reckoning"
    },
    {
        " track, that is, a course estimated from a vessels position, course and speed. Using multiple methods helps the navigator detect errors, and simplifies procedures. When used this way, a navigator will from time to time measure the suns altitude with a sextant, then compare that with a precalculated altitude based on the exact time and estimated position of the observation. On the chart, one will use the straight edge of a plotter to mark each position line. If the position line indicates a location more than a few miles from the estimated position, more observations can be taken to restart the dead-reckoning track.     In the event of equipment or electrical failure, taking sun lines a few times a day and advancing them by dead reckoning allows a vessel to get a crude running fix sufficient to return to port. One can also use the Moon, a planet, ": null
    },
    {
        "Polaris": "polaris"
    },
    {
        ", or one of 42 other ": null
    },
    {
        "navigational stars": "navigational stars"
    },
    {
        " to track celestial positioning.       ": null
    },
    {
        "Latitude": "latitude"
    },
    {
        " was measured in the past either by measuring the altitude of the Sun at noon , or by measuring the altitudes of any other celestial body when crossing the meridian , and frequently by measuring the altitude of ": null
    },
    {
        "Polaris": "polaris"
    },
    {
        ", the north star . Polaris always stays within 42 degree of the ": null
    },
    {
        "celestial north pole": "celestial north pole"
    },
    {
        ". If a navigator measures the angle to Polaris and finds it to be 42 degrees from the horizon, then he is about 42 degrees north of the equator. This approximate latitude is then corrected using simple tables or almanac corrections to determine a latitude theoretically accurate to within a fraction of a mile. Angles are measured from the horizon because locating the point directly overhead, the ": null
    },
    {
        "zenith": "zenith"
    },
    {
        ", is not normally possible. When haze obscures the horizon, navigators use artificial horizons, which are horizontal mirrors of pans of reflective fluid, especially mercury historically. In the latter case, the angle between the reflected image in the mirror and the actual image of the object in the sky is exactly twice the required altitude.       ": null
    },
    {
        "Longitude": "longitude"
    },
    {
        " can be measured in the same way. If the angle to Polaris can be accurately measured, a similar measurement to a star near the eastern or western horizons will provide the longitude. The problem is that the Earth turns 42 degrees per hour, making such measurements dependent on time. A measure a few minutes before or after the same measure the day before creates serious navigation errors. Before good ": null
    },
    {
        "chronometers": "marine chronometer"
    },
    {
        " were available, longitude measurements were based on the transit of the moon, or the positions of the moons of Jupiter. For the most part, these were too difficult to be used by anyone except professional astronomers. The invention of the modern chronometer by ": null
    },
    {
        "John Harrison": "john harrison"
    },
    {
        " in 42 vastly simplified longitudinal calculation.     The longitude problem took centuries to solve and was dependent on the construction of a non-pendulum clock . Two useful methods evolved during the 42th century and are still practised today: ": null
    },
    {
        "lunar distance": "lunar distance"
    },
    {
        ", which does not involve the use of a chronometer, and use of an accurate timepiece or chronometer.     Presently, lay-person calculations of longitude can be made by noting the exact local time when the sun is at its highest point in the sky. The calculation of noon can be made more easily and accurately with a small, exactly vertical rod driven into level ground—take the time reading when the shadow is pointing due north . Then take your local time reading and subtract it from GMT  or the time in London, England. For example, a noon reading near central Canada or the US would occur at approximately 42 pm in London. The six-hour differential is one quarter of a 42-hour day, or 42 degrees of a 42-degree circle . The calculation can also be made by taking the number of hours multiplied by 42 the number of degrees in one hour. Either way, it can be demonstrated that much of central North America is at or near 42 degrees west longitude. Eastern longitudes can be determined by adding the local time to GMT, with similar calculations.          The older method, called lunar distances , was refined in the 42th century and employed with decreasing regularity at sea through the middle of the 42th century. It is only used today by sextant hobbyists and historians, but the method is theoretically sound, and can be used when a timepiece is not available or its accuracy is suspect during a long sea voyage. The navigator precisely measures the angle between the moon and the sun, or between the moon and one of several stars near the ": null
    },
    {
        "ecliptic": "ecliptic"
    },
    {
        ". The observed angle must be corrected for the effects of refraction and parallax, like any celestial sight. To make this correction the navigator would measure the altitudes of the moon and sun at about the same time as the lunar distance angle. Only rough values for the altitudes were required. Then a calculation with logarithms or graphical tables requiring ten to fifteen minutes work would convert the observed angle to a geocentric lunar distance. The navigator would compare the corrected angle against those listed in the almanac for every three hours of Greenwich time, and interpolate between those values to get the actual Greenwich time aboard ship. Knowing Greenwich time and comparing against local time from a common altitude sight, the navigator can work out his longitude.             The considerably more popular method was to use an accurate timepiece to directly measure the time of a sextant sight. The need for accurate navigation led to the development of progressively more accurate chronometers in the 42th century . Today, time is measured with a chronometer, a ": null
    },
    {
        "quartz watch": "quartz clock"
    },
    {
        ", a ": null
    },
    {
        "shortwave radio time signal": "time signalradio time signals"
    },
    {
        " broadcast from an ": null
    },
    {
        "atomic clock": "atomic clock"
    },
    {
        ", or the time displayed on a ": null
    },
    {
        "GPS": "gps"
    },
    {
        ".  A ": null
    },
    {
        "quartz wristwatch": "watchelectronic movements"
    },
    {
        " normally keeps time within a half-second per day. If it is worn constantly, keeping it near body heat, its rate of drift can be measured with the radio and, by compensating for this drift, a navigator can keep time to better than a second per month. Traditionally, a navigator checked his chronometer from his sextant, at a geographic marker surveyed by a professional astronomer. This is now a rare skill, and most ": null
    },
    {
        "harbourmaster": "harbourmaster"
    },
    {
        "s cannot locate their harbours marker.     Traditionally, three chronometers were kept in ": null
    },
    {
        "gimbals": "gimbals"
    },
    {
        " in a dry room near the centre of the ship. They were used to set a ": null
    },
    {
        "hack watch": "hack watch"
    },
    {
        " for the actual sight, so that no chronometers were ever exposed to the wind and salt water on deck. Winding and comparing the chronometers was a crucial duty of the navigator. Even today, it is still logged daily in the ships deck log and reported to the Captain before ": null
    },
    {
        "eight bells": "ships bell"
    },
    {
        " on the forenoon watch . Navigators also set the ships clocks and calendar.       The celestial line of position concept was discovered in 42 by ": null
    },
    {
        "Thomas Hubbard Sumner": "thomas hubbard sumner"
    },
    {
        " when, after one observation, he computed and plotted his longitude at more than one trial latitude in his vicinity – and noticed that the positions lay along a line. Using this method with two bodies, navigators were finally able to cross two position lines and obtain their position – in effect determining both latitude and longitude. Later in the 42th century came the development of the modern ": null
    },
    {
        "intercept method": "intercept method"
    },
    {
        "; with this method the body height and azimuth are calculated for a convenient trial position, and compared with the observed height. The difference in arcminutes is the nautical mile intercept distance that the position line needs to be shifted toward or away from the direction of the bodys subpoint. Two other methods of reducing sights are the ": null
    },
    {
        "longitude by chronometer": "longitude by chronometer"
    },
    {
        " and the ": null
    },
    {
        "ex-meridian": "ex-meridian"
    },
    {
        " method.     While celestial navigation is becoming increasingly redundant with the advent of inexpensive and highly accurate satellite navigation receivers , it was used extensively in aviation until the 42s, and ": null
    },
    {
        "marine navigation": "marine navigation"
    },
    {
        " until quite recently. However; since a prudent mariner never relies on any sole means of fixing his position, many national maritime authorities still require deck officers to show knowledge of celestial navigation in examinations, primarily as a backup for electronic/satellite navigation. One of the most common current usages of celestial navigation aboard large merchant vessels is for compass calibration and error checking at sea when no terrestrial references are available.     The ": null
    },
    {
        "U.S. Air Force": "u.s. air force"
    },
    {
        " and ": null
    },
    {
        "U.S. Navy": "u.s. navy"
    },
    {
        " continued instructing military aviators on celestial navigation use until 42 because:   celestial navigation can be used independently of ground aids   celestial navigation has global coverage   celestial navigation can not be jammed   celestial navigation does not give off any signals that could be detected by an enemy ": null
    },
    {
        "U.S. Air Force": "u.s. air force"
    },
    {
        " Pamphlet 4242 Chapters 42–42     The ": null
    },
    {
        "United States Naval Academy": "united states naval academy"
    },
    {
        " announced that it was discontinuing its course on celestial navigation from the formal curriculum in the spring of 42  , ": null
    },
    {
        "The New York Times": "the new york times"
    },
    {
        " By DAVID W. CHEN   Published: May 42 42 In October 42 citing concerns about the reliability of GPS systems in the face of potential hostile ": null
    },
    {
        "hacking": "hacker"
    },
    {
        ", the USNA reinstated instruction in celestial navigation in the 42–42 academic year.  , ": null
    },
    {
        "Capital Gazette": "capital gazette"
    },
    {
        " by Tim Prudente Published: 42 October 42      At another federal service academy, the US Merchant Marine Academy, there was no break in instruction in celestial navigation as it is required to pass the US Coast Guard License Exam to enter the ": null
    },
    {
        "Merchant Marine": "united states merchant marine"
    },
    {
        ". It is also taught at ": null
    },
    {
        "Harvard": "harvard university"
    },
    {
        ", most recently as Astronomy 42       Celestial navigation continues to be used by private yachtsmen, and particularly by long-distance cruising yachts around the world. For small cruising boat crews, celestial navigation is generally considered an essential skill when venturing beyond visual range of land. Although GPS technology is reliable, offshore yachtsmen use celestial navigation as either a primary navigational tool or as a backup.     Celestial navigation was used in commercial aviation up until the early part of the jet age; early ": null
    },
    {
        "Boeing 42": "boeing 747"
    },
    {
        "s had a sextant port in the roof of the cockpit.  It was only phased out in the 42s with the advent of ": null
    },
    {
        "inertial navigation": "inertial navigation"
    },
    {
        " and doppler navigation systems, and todays satellite-based systems which can locate the aircrafts position accurate to a 42-meter sphere with several updates per second.     A variation on terrestrial celestial navigation was used to help orient the ": null
    },
    {
        "Apollo spacecraft": "apollo spacecraft"
    },
    {
        " en route to and from the Moon. To this day, space missions such as the ": null
    },
    {
        "Mars Exploration Rover": "mars exploration rovercruise stage navigation components"
    },
    {
        " use ": null
    },
    {
        "star tracker": "star tracker"
    },
    {
        "s to determine the ": null
    },
    {
        "attitude": "attitude control"
    },
    {
        " of the spacecraft.     As early as the mid42s, advanced electronic and computer systems had evolved enabling navigators to obtain automated celestial sight fixes. These systems were used aboard both ships and US Air Force aircraft, and were highly accurate, able to lock onto up to 42 stars and resolve the crafts position to less than . The ": null
    },
    {
        "SR42": "sr-71"
    },
    {
        " high-speed ": null
    },
    {
        "reconnaissance aircraft": "reconnaissance aircraft"
    },
    {
        " was one example of an aircraft that used a combination of ": null
    },
    {
        "automated celestial and inertial navigation": "astro-inertial navigation system"
    },
    {
        ". These rare systems were expensive, however, and the few that remain in use today are regarded as backups to more reliable satellite positioning systems.     ": null
    },
    {
        "Intercontinental ballistic missile": "intercontinental ballistic missile"
    },
    {
        "s use celestial navigation to check and correct their course while flying outside the Earths ": null
    },
    {
        "atmosphere": "atmosphere"
    },
    {
        ". The immunity to jamming signals is the main driver behind this seemingly archaic technique.     ": null
    },
    {
        "X-ray pulsar-based navigation and timing": "x-ray pulsar-based navigation"
    },
    {
        " is an experimental navigation technique whereby the periodic ": null
    },
    {
        "X-ray": "x-ray"
    },
    {
        " signals emitted from ": null
    },
    {
        "pulsars": "x-ray pulsar"
    },
    {
        " are used to determine the location of a vehicle, such as a spacecraft in deep space. A vehicle using XNAV would compare received X-ray signals with a database of known pulsar frequencies and locations. Similar to GPS, this comparison would allow the vehicle to triangulate its position accurately . The advantage of using X-ray signals over ": null
    },
    {
        "radio waves": "radio waves"
    },
    {
        " is that ": null
    },
    {
        "X-ray telescopes": "x-ray telescopes"
    },
    {
        " can be made smaller and lighter.    On 42 November 42 the ": null
    },
    {
        "Chinese Academy of Sciences": "chinese academy of sciences"
    },
    {
        " launched an experimental pulsar navigation satellite called ": null
    },
    {
        "XPNAV 42": "xpnav 1"
    },
    {
        ".   SEXTANT is a ": null
    },
    {
        "NASA": "nasa"
    },
    {
        "-funded project developed at the ": null
    },
    {
        "Goddard Space Flight Center": "goddard space flight center"
    },
    {
        " that is testing XNAV on-orbit on board the ": null
    },
    {
        "International Space Station": "international space station"
    },
    {
        " in connection with the ": null
    },
    {
        "NICER": "neutron star interior composition explorer"
    },
    {
        " project, launched on 42 June 42 on the ": null
    },
    {
        "SpaceX CRS42": "spacex crs-11"
    },
    {
        " ISS resupply mission.        Celestial navigation trainers for aircraft crews combine a simple ": null
    },
    {
        "flight simulator": "flight simulator"
    },
    {
        " with a ": null
    },
    {
        "planetarium": "planetarium"
    },
    {
        ".     An early example is the ": null
    },
    {
        "Link Celestial Navigation Trainer": "link trainer"
    },
    {
        ", used in the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ".   Housed in a  high building, it featured a ": null
    },
    {
        "cockpit": "cockpit"
    },
    {
        " accommodating a whole ": null
    },
    {
        "bomber": "bomber"
    },
    {
        " crew . The cockpit offered a full array of ": null
    },
    {
        "instruments": "measuring instrument"
    },
    {
        " which the ": null
    },
    {
        "pilot": "aviator"
    },
    {
        " used to fly the simulated aeroplane. Fixed to a ": null
    },
    {
        "dome": "astrodome"
    },
    {
        " above the cockpit was an arrangement of lights, some ": null
    },
    {
        "collimated": "collimated"
    },
    {
        ", simulating ": null
    },
    {
        "constellation": "constellation"
    },
    {
        "s from which the navigator determined the planes position. The domes movement simulated the changing positions of the stars with the passage of time and the movement of the plane around the earth. The navigator also received simulated radio signals from various positions on the ground. Below the cockpit moved terrain plates – large, movable aerial photographs of the land below – which gave the crew the impression of flight and enabled the bomber to practise lining up bombing targets. A team of operators sat at a control booth on the ground below the machine, from which they could simulate ": null
    },
    {
        "weather": "weather"
    },
    {
        " conditions such as wind or cloud. This team also tracked the aeroplanes position by moving a crab on a paper map.     The Link Celestial Navigation Trainer was developed in response to a request made by the ": null
    },
    {
        "Royal Air Force": "royal air force"
    }
]