[
    {
        "      The cervix or cervix uteri is the lower part of the ": null
    },
    {
        "uterus": "uterus"
    },
    {
        " in the ": null
    },
    {
        "human female reproductive system": "human female reproductive system"
    },
    {
        ". The cervix is usually 2 to 3  cm long and roughly cylindrical in shape, which changes during ": null
    },
    {
        "pregnancy": "pregnancy"
    },
    {
        ". The narrow, central ": null
    },
    {
        "cervical canal": "cervical canal"
    },
    {
        " runs along its entire length, connecting the ": null
    },
    {
        "uterine cavity": "uterine cavity"
    },
    {
        " and the ": null
    },
    {
        "lumen": "lumen"
    },
    {
        " of the ": null
    },
    {
        "vagina": "vagina"
    },
    {
        ". The opening into the uterus is called the ": null
    },
    {
        "internal os": "internal orifice of the uterus"
    },
    {
        ", and the opening into the vagina is called the ": null
    },
    {
        "external os": "external os"
    },
    {
        ". The lower part of the cervix, known as the vaginal portion of the cervix , bulges into the top of the vagina. The cervix has been documented anatomically since at least the time of ": null
    },
    {
        "Hippocrates": "hippocrates"
    },
    {
        ", over 2,000 years ago.     The cervical canal is a passage through which ": null
    },
    {
        "sperm": "sperm"
    },
    {
        " must travel to fertilize an ": null
    },
    {
        "egg cell": "egg cell"
    },
    {
        " after sexual intercourse. Several methods of contraception, including ": null
    },
    {
        "cervical caps": "cervical cap"
    },
    {
        "and ": null
    },
    {
        "cervical diaphragm": "diaphragm"
    },
    {
        "s, aim to block or prevent the passage of sperm through the cervical canal. Cervical mucus is used in several methods of fertility awareness, such as the ": null
    },
    {
        "Creighton model": "creighton model"
    },
    {
        " and ": null
    },
    {
        "Billings method": "billings method"
    },
    {
        ", due to its changes in consistency throughout the ": null
    },
    {
        "menstrual period": "menstrual period"
    },
    {
        ". During vaginal ": null
    },
    {
        "childbirth": "childbirth"
    },
    {
        ", the cervix must flatten and ": null
    },
    {
        "dilate": "cervical dilation"
    },
    {
        " to allow the ": null
    },
    {
        "fetus": "fetus"
    },
    {
        " to progress along the birth canal. Midwives and doctors use the extent of the dilation of the cervix to assist decision-making during childbirth.     The cervical canal is lined with a single ": null
    },
    {
        "layer of column-shaped cells": "columnar epithelia"
    },
    {
        ", while the ectocervix is covered with ": null
    },
    {
        "multiple layers of cells topped with flat cells": "stratified squamous"
    },
    {
        ". The two types of ": null
    },
    {
        "epithelia": "epithelium"
    },
    {
        " meet the squamocolumnar junction. Infection with the ": null
    },
    {
        "human papillomavirus": "human papillomavirus"
    },
    {
        " can cause changes in the epithelium, which can lead to ": null
    },
    {
        "cancer of the cervix": "cancer of the cervix"
    },
    {
        ". ": null
    },
    {
        "Cervical cytology": "exfoliative cervical cytology"
    },
    {
        " tests can often detect cervical cancer and its precursors, and enable early successful treatment. Ways to avoid HPV include avoiding sex, using condoms, and ": null
    },
    {
        "HPV vaccination": "hpv vaccines"
    },
    {
        ". HPV vaccines, developed in the early 21st century, reduce the risk of cervical cancer by preventing infections from the main cancer-causing strains of HPV.               The cervix is part of the ": null
    },
    {
        "female reproductive system": "female reproductive system"
    },
    {
        ". Around  in length, it is the lower narrower part of the uterus continuous above with the broader upper part—or body—of the uterus. The lower end of the cervix bulges through the anterior wall of the vagina, and is referred to as the ": null
    },
    {
        "vaginal portion of cervix": "vaginal portion of cervix"
    },
    {
        " while the rest of the cervix above the vagina is called the ": null
    },
    {
        "supravaginal portion of cervix": "supravaginal portion of cervix"
    },
    {
        ". A central canal, known as the ": null
    },
    {
        "cervical canal": "canal of the cervix"
    },
    {
        ", runs along its length and connects the ": null
    },
    {
        "cavity of the body of the uterus": "cavity of the body of the uterus"
    },
    {
        " with the lumen of the vagina. The openings are known as the ": null
    },
    {
        "internal os": "internal os"
    },
    {
        " and ": null
    },
    {
        "external orifice of the uterus": "external orifice of the uterus"
    },
    {
        " respectively. The mucosa lining the cervical canal is known as the ": null
    },
    {
        "endocervix": "endocervix"
    },
    {
        ",  and the mucosa covering the ectocervix is known as the exocervix.  The cervix has an inner mucosal layer, a thick layer of ": null
    },
    {
        "smooth muscle": "smooth muscle"
    },
    {
        ", and posteriorly the supravaginal portion has a ": null
    },
    {
        "serosal": "serosal"
    },
    {
        " covering consisting of connective tissue and overlying ": null
    },
    {
        "peritoneum": "peritoneum"
    },
    {
        ".          In front of the upper part of the cervix lies the ": null
    },
    {
        "bladder": "urinary bladder"
    },
    {
        ", separated from it by cellular connective tissue known as ": null
    },
    {
        "parametrium": "parametrium"
    },
    {
        ", which also extends over the sides of the cervix.  To the rear, the supravaginal cervix is covered by peritoneum, which runs onto the back of the vaginal wall and then turns upwards and onto the ": null
    },
    {
        "rectum": "rectum"
    },
    {
        ", forming the ": null
    },
    {
        "recto-uterine pouch": "recto-uterine pouch"
    },
    {
        ". The cervix is more tightly connected to surrounding structures than the rest of the uterus.      The cervical canal varies greatly in length and width between women or over the course of a womans life, and it can measure 8  mm at its widest diameter in ": null
    },
    {
        "premenopausal": "premenopause"
    },
    {
        " adults. It is wider in the middle and narrower at each end. The anterior and posterior walls of the canal each have a vertical fold, from which ridges run diagonally upwards and laterally. These are known as palmate folds, due to their resemblance to a palm leaf. The anterior and posterior ridges are arranged in such a way that they interlock with each other and close the canal. They are often effaced after pregnancy.     The ectocervix has a convex, elliptical shape and projects into the cervix between the anterior and posterior ": null
    },
    {
        "vaginal fornices": "vaginal fornix"
    },
    {
        ". On the rounded part of the ectocervix is a small, depressed ": null
    },
    {
        "external opening": "external orifice of the uterus"
    },
    {
        ", connecting the cervix with the vagina. The size and shape of the ectocervix and the external opening can vary according to age, hormonal state, and whether natural or normal ": null
    },
    {
        "childbirth": "childbirth"
    },
    {
        " has taken place. In women who have not had a vaginal delivery, the external opening is small and circular, and in women who have had a vaginal delivery, it is slit-like.  On average, the ectocervix is  long and  wide.     Blood is supplied to the cervix by the descending branch of the ": null
    },
    {
        "uterine artery": "uterine artery"
    },
    {
        "  and drains into the ": null
    },
    {
        "uterine vein": "uterine vein"
    },
    {
        ". The ": null
    },
    {
        "pelvic splanchnic nerves": "pelvic splanchnic nerves"
    },
    {
        ", emerging as ": null
    },
    {
        "S2": "sacral spinal nerve 2"
    },
    {
        " & ndash;": null
    },
    {
        "S3": "sacral spinal nerve 3"
    },
    {
        ", transmit the sensation of pain from the cervix to the brain. These nerves travel along the ": null
    },
    {
        "uterosacral ligament": "uterosacral ligament"
    },
    {
        "s, which pass from the uterus to the anterior ": null
    },
    {
        "sacrum": "sacrum"
    },
    {
        ".     Three channels facilitate ": null
    },
    {
        "lymphatic drainage": "lymphatic system"
    },
    {
        " from the cervix.  The anterior and lateral cervix drains to ": null
    },
    {
        "nodes": "lymph node"
    },
    {
        " along the uterine arteries, travelling along the ": null
    },
    {
        "cardinal ligaments": "cardinal ligament"
    },
    {
        "at the base of the ": null
    },
    {
        "broad ligament": "broad ligament"
    },
    {
        " to the ": null
    },
    {
        "external iliac lymph nodes": "external iliac lymph nodes"
    },
    {
        " and ultimately the ": null
    },
    {
        "paraaortic lymph node": "paraaortic lymph node"
    },
    {
        "s. The posterior and lateral cervix drains along the uterine arteries to the ": null
    },
    {
        "internal iliac lymph nodes": "internal iliac lymph nodes"
    },
    {
        " and ultimately the ": null
    },
    {
        "paraaortic lymph nodes": "paraaortic lymph nodes"
    },
    {
        ", and the posterior section of the cervix drains to the obturator and presacral ": null
    },
    {
        "lymph node": "lymph node"
    },
    {
        "s.   However, there are variations as lymphatic drainage from the cervix travels to different sets of pelvic nodes in some people. This has implications in scanning nodes for involvement in cervical cancer.     After ": null
    },
    {
        "menstruation": "menstruation"
    },
    {
        " and directly under the influence of ": null
    },
    {
        "estrogen": "estrogen"
    },
    {
        ", the cervix undergoes a series of changes in position and texture. During most of the menstrual cycle, the cervix remains firm, and is positioned low and closed. However, as ": null
    },
    {
        "ovulation": "ovulation"
    },
    {
        " approaches, the cervix becomes softer and rises to open in response to the higher levels of estrogen present.  These changes are also accompanied by changes in cervical mucus, described below.         As a component of the female ": null
    },
    {
        "reproductive system": "reproductive system"
    },
    {
        ", the cervix is derived from the two ": null
    },
    {
        "paramesonephric ducts": "paramesonephric duct"
    },
    {
        ", which develop around the sixth week of ": null
    },
    {
        "embryogenesis": "human embryogenesis"
    },
    {
        ". During development, the outer parts of the two ducts fuse, forming a single ": null
    },
    {
        "urogenital": "urogenital"
    },
    {
        " canal that will become the ": null
    },
    {
        "vagina": "vagina"
    },
    {
        ", cervix and ": null
    },
    {
        "uterus": "uterus"
    },
    {
        ".  The cervix grows in size at a smaller rate than the body of the uterus, so the relative size of the cervix over time decreases, decreasing from being much larger than the body of the uterus in ": null
    },
    {
        "fetal life": "fetus"
    },
    {
        ", twice as large during childhood, and decreasing to its adult size, smaller than the uterus, after puberty. Previously it was thought that during fetal development, the original squamous epithelium of the cervix is derived from the ": null
    },
    {
        "urogenital sinus": "urogenital sinus"
    },
    {
        " and the original columnar epithelium is derived from the paramesonephric duct. The point at which these two original epithelia meet is called the original squamocolumnar junction.   New studies show, however, that all the cervical as well as large part of the ": null
    },
    {
        "vaginal epithelium": "vaginal epithelium"
    },
    {
        " are derived from Müllerian duct tissue and that phenotypic differences might be due to other causes.                    The endocervical mucosa is about  thick and lined with a single layer of columnar mucous cells. It contains numerous tubular mucous glands, which empty viscous alkaline mucus into the lumen. In contrast, the ectocervix is covered with nonkeratinized stratified squamous epithelium, which resembles the squamous epithelium lining the vaginal.  The junction between these two types of epithelia is called the squamocolumnar junction.   Underlying both types of epithelium is a tough layer of ": null
    },
    {
        "collagen": "collagen"
    },
    {
        ".  The mucosa of the endocervix is not shed during menstruation. The cervix has more fibrous tissue, including collagen and ": null
    },
    {
        "elastin": "elastin"
    },
    {
        ", than the rest of the uterus.        In ": null
    },
    {
        "prepubertal": "preadolescence"
    },
    {
        " girls, the functional squamocolumnar junction is present just within the cervical canal.  Upon entering puberty, due to hormonal influence, and during pregnancy, the columnar epithelium extends outwards over the ectocervix as the cervix everts.  Hence, this also causes the squamocolumnar junction to move outwards onto the vaginal portion of the cervix, where it is exposed to the acidic vaginal environment.   The exposed columnar epithelium can undergo physiological ": null
    },
    {
        "metaplasia": "metaplasia"
    },
    {
        " and change to tougher metaplastic squamous epithelium in days or weeks,  which is very similar to the original squamous epithelium when mature.  The new squamocolumnar junction is therefore internal to the original squamocolumnar junction, and the zone of unstable epithelium between the two junctions is called the transformation zone of the cervix.  After menopause, the uterine structures involute and the functional squamocolumnar junction moves into the cervical canal.      ": null
    },
    {
        "Nabothian cysts": "nabothian cyst"
    },
    {
        " form in the transformation zone where the lining of metaplastic epithelium has replaced mucous epithelium and caused a strangulation of the outlet of some of the mucous glands.  A buildup of mucus in the glands forms Nabothian cysts, usually less than about  in diameter, which are considered physiological rather than pathological.  Both gland openings and Nabothian cysts are helpful to identify the transformation zone.              The cervical canal is a pathway through which sperm enter the uterus after sexual intercourse,  and some forms of ": null
    },
    {
        "artificial insemination": "artificial insemination"
    },
    {
        ".  Some sperm remains in cervical crypts, infoldings of the endocervix, which act as a reservoir, releasing sperm over several hours and maximising the chances of fertilisation.  A theory states the cervical and uterine contractions during ": null
    },
    {
        "orgasm": "orgasm"
    },
    {
        " draw semen into the uterus. Although the upsuck theory has been generally accepted for some years, it has been disputed due to lack of evidence, small sample size, and methodological errors.       Some methods of ": null
    },
    {
        "fertility awareness": "fertility awareness"
    },
    {
        ", such as the ": null
    },
    {
        "Creighton model": "creighton model fertilitycare system"
    },
    {
        " and the ": null
    },
    {
        "Billings method": "billings ovulation method"
    },
    {
        " involve estimating a womans periods of fertility and infertility by observing physiological changes in her body. Among these changes are several involving the quality of her cervical mucus: the sensation it causes at the vulva, its elasticity , its transparency, and the presence of ": null
    },
    {
        "ferning": "fern test"
    },
    {
        ".         Several hundred glands in the endocervix produce 20–60  mg of cervical ": null
    },
    {
        "mucus": "mucus"
    },
    {
        " a day, increasing to 600  mg around the time of ovulation. It is viscous because it contains large proteins known as ": null
    },
    {
        "mucin": "mucin"
    },
    {
        "s. The viscosity and water content varies during the ": null
    },
    {
        "menstrual cycle": "menstrual cycle"
    },
    {
        "; mucus is composed of around 93% water, reaching 98% at midcycle. These changes allow it to function either as a barrier or a transport medium to spermatozoa. It contains electrolytes such as calcium, sodium, and potassium; organic components such as glucose, amino acids, and soluble proteins; trace elements including zinc, copper, iron, manganese, and selenium; free fatty acids; enzymes such as ": null
    },
    {
        "amylase": "amylase"
    },
    {
        "; and ": null
    },
    {
        "prostaglandins": "prostaglandins"
    },
    {
        ".  Its consistency is determined by the influence of the hormones estrogen and progesterone. At midcycle around the time of ": null
    },
    {
        "ovulation": "ovulation"
    },
    {
        "—a period of high estrogen levels— the mucus is thin and serous to allow sperm to enter the uterus and is more alkaline and hence more hospitable to sperm. It is also higher in electrolytes, which results in the ferning pattern that can be observed in drying mucus under low magnification; as the mucus dries, the salts crystallize, resembling the leaves of a fern. The mucus has a stretchy character described as Spinnbarkeit most prominent around the time of ovulation.      At other times in the cycle, the mucus is thick and more acidic due to the effects of progesterone. This infertile mucus acts as a barrier to keep sperm from entering the uterus.  Women taking an ": null
    },
    {
        "oral contraceptive pill": "oral contraceptive pill"
    },
    {
        " also have thick mucus from the effects of progesterone. Thick mucus also prevents ": null
    },
    {
        "pathogens": "pathogen"
    },
    {
        "from interfering with a nascent pregnancy.      A ": null
    },
    {
        "cervical mucus plug": "cervical mucus plug"
    },
    {
        ", called the operculum, forms inside the cervical canal during pregnancy. This provides a protective seal for the uterus against the entry of pathogens and against leakage of uterine fluids. The mucus plug is also known to have antibacterial properties. This plug is released as the cervix dilates, either during the first stage of childbirth or shortly before.  It is visible as a blood-tinged mucous discharge.           The cervix plays a major role in ": null
    },
    {
        "childbirth": "childbirth"
    },
    {
        ". As the ": null
    },
    {
        "fetus": "fetus"
    },
    {
        " descends within the uterus in preparation for birth, the ": null
    },
    {
        "presenting part": "presentation"
    },
    {
        ", usually ": null
    },
    {
        "the head": "cephalic presentation"
    },
    {
        ", rests on and is supported by the cervix. As labour progresses, the cervix becomes softer and shorter, begins to dilate, and rotates to face anteriorly. The support the cervix provides to the fetal head starts to give way when the uterus begins its ": null
    },
    {
        "contractions": "uterine contraction"
    },
    {
        ". During childbirth, the ": null
    },
    {
        "cervix must dilate": "cervical dilation"
    },
    {
        " to a diameter of more than  to accommodate the head of the fetus as it descends from the uterus to the vagina. In becoming wider, the cervix also becomes shorter, a phenomenon known as ": null
    },
    {
        "effacement": "cervical effacement"
    },
    {
        ".     Along with other factors, midwives and doctors use the extent of cervical dilation to assist decision making during ": null
    },
    {
        "childbirth": "stages of labor"
    },
    {
        ". ": null
    }
]