[
    {
        "        In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", the Ceryneian Hind , also called Cerynitis or the Golden Hind, was an enormous hind  that lived in ": null
    },
    {
        "Keryneia, Greece": "keryneia, greece"
    },
    {
        ". It had golden antlers like a stag and hooves of bronze or brass, and it was said that it could outrun an arrow in flight. It was sacred to ": null
    },
    {
        "Artemis": "artemis"
    },
    {
        " . The capture of the hind was the third ": null
    },
    {
        "labour": "labours of hercules"
    },
    {
        " of ": null
    },
    {
        "Heracles": "heracles"
    },
    {
        ".     A doe bearing antlers was unknown in Greece, but the story of the hind is suggestive of ": null
    },
    {
        "reindeer": "reindeer"
    },
    {
        ", which, unlike other deer, can be harnessed and whose females bear antlers. The myth relates to the northern ": null
    },
    {
        "Hyperborea": "hyperborea"
    },
    {
        ", which may have been the archaic origin of the myth itself, as ": null
    },
    {
        "Robert Graves": "robert graves"
    },
    {
        " thought.     When the sun is in the sign of ": null
    },
    {
        "Scorpio": "scorpius"
    },
    {
        ", the constellation ": null
    },
    {
        "Hercules": "hercules"
    },
    {
        " rises": "heliacal rising"
    },
    {
        ". The Greeks referred to the constellation of Hercules as the Stag , the identification of the constellation with Hercules was made by the Romans.       ": null
    },
    {
        "Eurystheus": "eurystheus"
    },
    {
        " and ": null
    },
    {
        "Hera": "hera"
    },
    {
        " were greatly angered to find that Heracles had managed to escape from the claws of the ": null
    },
    {
        "Nemean Lion": "nemean lion"
    },
    {
        " and the fangs of the ": null
    },
    {
        "Lernaean Hydra": "lernaean hydra"
    },
    {
        ", so decided to spend more time thinking up a third task that would spell doom for the hero. The third task did not involve killing a beast, as it had already been established that Heracles could overcome even the most fearsome opponents, so Eurystheus decided to make him capture the female Ceryneian Hind, as it was so fast it could outrun an arrow.     After beginning the search, Heracles awoke from sleeping and he could see the hind from the glint on its antlers. Heracles then chased the hind on foot for a full year through ": null
    },
    {
        "Greece": "greece"
    },
    {
        ", ": null
    },
    {
        "Thrace": "thrace"
    },
    {
        ", ": null
    },
    {
        "Istria": "istria"
    },
    {
        ", and the land of the ": null
    },
    {
        "Hyperboreans": "hyperboreans"
    },
    {
        ". In some versions, he captured the hind while it slept, rendering it ": null
    },
    {
        "lame": "lameness"
    },
    {
        " with a trap net. In other versions, he encountered Artemis in her temple and she told him to leave the hind and tell Eurystheus all that had happened and his third labour would be considered to be completed. Yet another version claims that Heracles trapped the hind with an arrow between the fore legs of the creature.     Eurystheus had given Heracles this task hoping to incite Artemis anger at Heracles for his desecration of her sacred animal. As he was returning with the hind, Heracles encountered Artemis and her brother ": null
    },
    {
        "Apollo": "apollo"
    },
    {
        ". He begged the goddess for forgiveness, explaining that he had to catch it as part of his penance, but he promised to return it. Artemis forgave him, foiling Eurystheus plan to have her punish him.        Upon bringing the hind to Eurystheus, he was told that it was to become part of the Kings ": null
    },
    {
        "menagerie": "menagerie"
    },
    {
        ". Heracles knew that he had to return the hind as he had promised, so he agreed to hand it over on the condition that Eurystheus himself come out and take it from him. The King came out, but the moment Heracles let the hind go, it sprinted back to its mistress, and Heracles left saying that Eurystheus had not been quick enough. Eurystheus, upset that Heracles had managed to overcome yet another creature, told him to bring the fearsome ": null
    },
    {
        "Erymanthian Boar": "erymanthian boar"
    },
    {
        " Roman Spain": "roman spain"
    },
    {
        " J. M. Félix Magdalena": ":es:josé manuel félix magdalena"
    }
]