[
    {
        "              Chalk is a soft, white, porous, ": null
    },
    {
        "sedimentary": "sedimentary rock"
    },
    {
        " carbonate rock": "carbonate rock"
    },
    {
        ", a form of ": null
    },
    {
        "limestone": "limestone"
    },
    {
        " composed of the ": null
    },
    {
        "mineral": "mineral"
    },
    {
        " calcite": "calcite"
    },
    {
        ". Calcite is an ionic salt called ": null
    },
    {
        "calcium carbonate": "calcium carbonate"
    },
    {
        " or CaCO 42 . It forms under reasonably deep marine conditions from the gradual accumulation of minute ": null
    },
    {
        "calcite": "calcite"
    },
    {
        " shells  shed from micro-organisms called ": null
    },
    {
        "coccolithophores": "coccolithophores"
    },
    {
        ". ": null
    },
    {
        "Flint": "flint"
    },
    {
        "  is very common as bands parallel to the ": null
    },
    {
        "bedding": "bed"
    },
    {
        " or as ": null
    },
    {
        "nodule": "nodule"
    },
    {
        "s embedded in chalk. It is probably derived from ": null
    },
    {
        "sponge spicule": "spicule"
    },
    {
        "s or other ": null
    },
    {
        "siliceous": "silica"
    },
    {
        " organisms as water is expelled upwards during compaction. Flint is often deposited around larger ": null
    },
    {
        "fossil": "fossil"
    },
    {
        "s such as ": null
    },
    {
        "Echinoidea": "echinoidea"
    },
    {
        " which may be ": null
    },
    {
        "silicified": "silicification"
    },
    {
        " .     Chalk as seen in Cretaceous deposits of Western Europe is unusual among sedimentary limestones in the thickness of the beds. Most cliffs of chalk have very few obvious bedding planes unlike most thick sequences of limestone such as the Carboniferous Limestone or the Jurassic oolitic limestones. This presumably indicates very stable conditions over tens of millions of years.        Chalk has greater resistance to ": null
    },
    {
        "weathering": "weathering"
    },
    {
        " and slumping than the ": null
    },
    {
        "clay": "clay"
    },
    {
        "s with which it is usually associated, thus forming tall, steep ": null
    },
    {
        "cliff": "cliff"
    },
    {
        "s where chalk ridges meet the sea. Chalk ": null
    },
    {
        "hill": "hill"
    },
    {
        "s, known as chalk ": null
    },
    {
        "downland": "downland"
    },
    {
        ", usually form where bands of chalk reach the surface at an angle, so forming a ": null
    },
    {
        "scarp": "escarpment"
    },
    {
        " slope. Because chalk is well jointed it can hold a large volume of ": null
    },
    {
        "ground water": "ground water"
    },
    {
        ", providing a natural reservoir that releases water slowly through dry seasons.             Chalk is ": null
    },
    {
        "mined": "chalk mining"
    },
    {
        " from chalk deposits both above ground and ": null
    },
    {
        "underground": "underground mining"
    },
    {
        ". Chalk mining boomed during the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        ", due to the need for chalk products such as ": null
    },
    {
        "quicklime": "quicklime"
    },
    {
        " and ": null
    },
    {
        "brick": "brick"
    },
    {
        "s. Some abandoned chalk mines remain tourist destinations due to their massive expanse and natural beauty.       The ": null
    },
    {
        "Chalk Group": "chalk group"
    },
    {
        " is a ": null
    },
    {
        "Europe": "europe"
    },
    {
        "an stratigraphic unit deposited during the late ": null
    },
    {
        "Cretaceous": "cretaceous"
    },
    {
        " Period. It forms the famous ": null
    },
    {
        "White Cliffs of Dover": "white cliffs of dover"
    },
    {
        " in ": null
    },
    {
        "Kent": "kent"
    },
    {
        ", England, as well as their counterparts of the ": null
    },
    {
        "Cap Blanc Nez": "cap blanc nez"
    },
    {
        " on the other side of the ": null
    },
    {
        "Dover Strait": "dover strait"
    },
    {
        ". The ": null
    },
    {
        "Champagne region": "champagne region"
    },
    {
        " of France is mostly underlain by chalk deposits, which contain artificial caves used for ": null
    },
    {
        "wine storage": "wine storage"
    },
    {
        ". Some of the highest chalk cliffs in the world occur at ": null
    },
    {
        "Jasmund National Park": "jasmund national park"
    },
    {
        " in ": null
    },
    {
        "Germany": "germany"
    },
    {
        " and at ": null
    },
    {
        "Møns Klint": "møns klint"
    },
    {
        " in ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        " – both once formed a single island.       Ninety million years ago what is now the chalk downland of Northern Europe was ooze accumulating at the bottom of a great sea. Chalk was one of the earliest rocks made up of microscopic particles to be studied under the microscope, when it was found to be composed almost entirely of coccoliths. Their shells were made of calcite extracted from the rich seawater. As they died, a substantial layer gradually built up over millions of years and, through the weight of overlying sediments, eventually became consolidated into rock. Later earth movements related to the formation of the Alps raised these former sea-floor deposits above sea level.       The chemical composition of chalk is calcium carbonate, with minor amounts of ": null
    },
    {
        "silt": "silt"
    },
    {
        " and ": null
    },
    {
        "clay": "clay minerals"
    },
    {
        ". Huxley, T. H. 42 On a piece of chalk. Macmillans Magazine    It is formed in the sea by sub-microscopic plankton, which fall to the sea floor and are then consolidated and compressed during ": null
    },
    {
        "diagenesis": "diagenesis"
    },
    {
        " into chalk rock.       Most people first encounter chalk in school where it refers to blackboard chalk, which was originally made of mineral chalk, since it readily crumbles and leaves particles that stick loosely to rough surfaces, allowing it to make writing that can be readily erased. Blackboard chalk manufacture now may use mineral chalk, other ": null
    },
    {
        "mineral sources": "limestone"
    },
    {
        " of calcium carbonate, or the mineral ": null
    },
    {
        "gypsum": "gypsum"
    },
    {
        " . While gypsum-based blackboard chalk is the lowest cost to produce, and thus widely used in the ": null
    },
    {
        "developing world": "developing world"
    },
    {
        ", calcium-based chalk can be made where the crumbling particles are larger and thus produce less dust, and is marketed as dustless chalk . Thakker, M., Shukla, P. and Shah, D.O., 42 Surface and colloidal properties of chalks: A novel approach using surfactants to convert normal chalks into dustless chalks. Colloids and Surfaces A: Physicochemical and Engineering Aspects, 42 pp.4242 Colored chalks, pastel chalks, and ": null
    },
    {
        "sidewalk chalk": "sidewalk chalk"
    },
    {
        " , used to draw on ": null
    },
    {
        "sidewalk": "sidewalk"
    },
    {
        "s, streets, and ": null
    },
    {
        "driveway": "driveway"
    },
    {
        "s, are primarily made of gypsum.            Chalk is a source of ": null
    },
    {
        "quicklime": "quicklime"
    },
    {
        " by ": null
    },
    {
        "thermal decomposition": "thermal decomposition"
    },
    {
        ", or ": null
    },
    {
        "slaked lime": "slaked lime"
    },
    {
        " following ": null
    },
    {
        "quenching": "quenching"
    },
    {
        " of quicklime with water.  In southeast England, ": null
    },
    {
        "denehole": "denehole"
    },
    {
        "s are a notable example of ancient chalk pits. Such ": null
    },
    {
        "bell pit": "bell pit"
    },
    {
        "s may also mark the sites of ancient flint mines, where the prime object was to remove ": null
    },
    {
        "flint": "flint"
    },
    {
        " nodules": "nodule"
    },
    {
        " for ": null
    },
    {
        "stone tool": "stone tool"
    },
    {
        " manufacture. The surface remains at ": null
    },
    {
        "Cissbury": "cissbury"
    },
    {
        " are one such example, but perhaps the most famous is the extensive complex at ": null
    },
    {
        "Grimes Graves": "grimes graves"
    },
    {
        " in ": null
    },
    {
        "Norfolk": "norfolk"
    },
    {
        ".     ": null
    },
    {
        "Woodworking joints": "woodworking joints"
    },
    {
        " may be fitted by chalking one of the mating surfaces. A trial fit will leave a chalk mark on the high spots of the corresponding surface. Chalk transferring to cover the complete surface indicates a good fit. Builders ": null
    },
    {
        "putty": "putty"
    },
    {
        " also mainly contains chalk as a filler in ": null
    },
    {
        "linseed oil": "linseed oil"
    },
    {
        ".     Chalk may be used for its properties as a ": null
    },
    {
        "base": "base"
    },
    {
        ". In ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ", chalk is used for raising ": null
    },
    {
        "pH": "ph"
    },
    {
        " in soils with high ": null
    },
    {
        "acidity": "acidity"
    },
    {
        ". The most common forms are CaCO 42 and CaO . Small doses of chalk can also be used as an ": null
    },
    {
        "antacid": "antacid"
    },
    {
        ". Additionally, the small particles of chalk make it a substance ideal for cleaning and polishing. For example, toothpaste commonly contains small amounts of chalk, which serves as a mild ": null
    },
    {
        "abrasive": "abrasive"
    },
    {
        ". Polishing chalk is chalk prepared with a carefully controlled grain size, for very fine polishing of metals.  , from the 42 book The Workshop Companion Chalk can also be used as ": null
    },
    {
        "fingerprint powder": "fingerprint powder"
    },
    {
        ".         Several traditional uses of chalk have been replaced by other substances, although the word chalk is often still applied to the usual replacements. Tailors chalk is traditionally a hard chalk used to make temporary markings on cloth, mainly by ": null
    },
    {
        "tailor": "tailor"
    },
    {
        "s. It is now usually made of ": null
    },
    {
        "talc": "talc"
    },
    {
        " .     Chalk was traditionally used in recreation. In field sports, such as tennis played on grass, powdered chalk was used to mark the boundary lines of the playing field or court. If a ball hits the line, a cloud of chalk or pigment dust will be visible. In recent years, powdered chalk has been replaced with ": null
    },
    {
        "titanium dioxide": "titanium dioxide"
    },
    {
        ".  In gymnastics, rock-climbing, weightlifting and ": null
    },
    {
        "tug of war": "tug of war"
    },
    {
        ", chalk — now usually ": null
    },
    {
        "magnesium carbonate": "magnesium carbonate"
    },
    {
        " — is applied to the hands and feet to remove perspiration and reduce slipping.     Chalk may also be used as a house construction material instead of ": null
    },
    {
        "brick": "brick"
    },
    {
        " or ": null
    },
    {
        "wattle and daub": "wattle and daub"
    },
    {
        ": quarried chalk was cut into blocks and used as ": null
    },
    {
        "ashlar": "ashlar"
    },
    {
        ", or loose chalk was rammed into blocks and laid in mortar.   There are still houses standing which have been constructed using chalk as the main building material. Most are pre-": null
    },
    {
        "Victorian": "victorian architecture"
    },
    {
        " though a few are more recent. ": null
    }
]