[
    {
        "The Chalcedonian Definition  is a ": null
    },
    {
        "diophysite": "Dyophysitism"
    },
    {
        " declaration of the ": null
    },
    {
        "two natures of Christ": "Hypostatic Union"
    },
    {
        ", adopted at the ": null
    },
    {
        "Council of Chalcedon": "Council Of Chalcedon"
    },
    {
        " in AD  451. ": null
    },
    {
        "Chalcedon": "Chalcedon"
    },
    {
        " was an ": null
    },
    {
        "early centre": "Early Centres Of Christianitywestern Anatolia"
    },
    {
        " of Christianity located in ": null
    },
    {
        "Asia Minor": "Asia Minor"
    },
    {
        " . The council was the fourth of the ": null
    },
    {
        "Ecumenical Councils": "First Seven Ecumenical Councils"
    },
    {
        " that are accepted by ": null
    },
    {
        "Chalcedonian": "Chalcedonian"
    },
    {
        " churches which include the ": null
    },
    {
        "Eastern Orthodox": "Eastern Orthodox"
    },
    {
        ", ": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        ", and most ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        " churches. It was the first council not to be recognised by any ": null
    },
    {
        "Oriental Orthodox": "Oriental Orthodoxy"
    },
    {
        " church; these churches may be classified as ": null
    },
    {
        "non-Chalcedonian": "Non-Chalcedonianism"
    },
    {
        ".       The Council of Chalcedon was summoned to consider the Christological question in light of the one-nature view of Christ proposed by ": null
    },
    {
        "Eutyches": "Eutyches"
    },
    {
        ", archimandrite at Constantinople, which prevailed at the ": null
    },
    {
        "Second Council of Ephesus": "Second Council Of Ephesus"
    },
    {
        " in 449, sometimes referred to as the Robber Synod .      The Council first solemnly ratified the ": null
    },
    {
        "Nicene Creed": "Nicene Creed"
    },
    {
        " adopted in 325 and that creed as amended by the ": null
    },
    {
        "First Council of Constantinople": "First Council Of Constantinople"
    },
    {
        " in 381. It also confirmed the authority of two synodical letters of ": null
    },
    {
        "Cyril of Alexandria": "Cyril Of Alexandria"
    },
    {
        " and the ": null
    },
    {
        "letter of Pope Leo I to Flavian of Constantinople": "Leos Tome"
    },
    {
        ".        The full text of the definition reaffirms the decisions of the ": null
    },
    {
        "Council of Ephesus": "Council Of Ephesus"
    },
    {
        ", the pre-eminence of the ": null
    },
    {
        "Creed of Nicaea": "Nicene Creed"
    },
    {
        " and the further definitions of the ": null
    },
    {
        "Council of Constantinople": "First Council Of Constantinople"
    },
    {
        "      In one of the translations into English, the key section, emphasizing the double nature of Christ , runs:   Following, then, the holy Fathers, we all unanimously teach that our Lord Jesus Christ is to us One and the same Son, the Self-same Perfect in Godhead, the Self-same Perfect in Manhood; truly God and truly Man; the Self-same of a rational soul and body; co-essential with the Father according to the Godhead, the Self-same co-essential with us according to the Manhood; like us in all things, sin apart; before the ages begotten of the Father as to the Godhead, but in the last days, the Self-same, for us and for our salvation of Mary the Virgin ": null
    },
    {
        "Theotokos": "Theotokos"
    },
    {
        " as to the Manhood; One and the Same Christ, Son, Lord, Only-begotten; acknowledged in Two Natures unconfusedly, unchangeably, indivisibly, inseparably; the difference of the Natures being in no way removed because of the Union, but rather the properties of each Nature being preserved, and concurring into One Person and One Hypostasis; not as though He was parted or divided into Two Persons, but One and the Self-same Son and Only-begotten God, Word, Lord, Jesus Christ; even as from the beginning the prophets have taught concerning Him, and as the Lord Jesus Christ Himself hath taught us, and as the Symbol of the Fathers hath handed down to us.        The Definition implicitly addressed a number of popular heretical beliefs. The reference to co-essential with the Father was directed at ": null
    },
    {
        "Arianism": "Arianism"
    },
    {
        "; co-essential with us is directed at ": null
    },
    {
        "Apollinarianism": "Apollinarianism"
    },
    {
        "; Two Natures unconfusedly, unchangeably refutes ": null
    },
    {
        " Eutychianism": "Eutychianism"
    },
    {
        "; and indivisibly, inseparably is against ": null
    },
    {
        "Nestorianism": "Nestorianism"
    },
    {
        ".       The Chalcedonian Definition was written amid controversy between the ": null
    },
    {
        "Western": "Latin Church"
    },
    {
        " and ": null
    },
    {
        "Eastern churches": "Eastern Christianity"
    },
    {
        " over the meaning of the ": null
    },
    {
        "Incarnation": "Incarnation"
    },
    {
        " . The Western church readily accepted the creed, but some Eastern churches did not. Political disturbances prevented the Armenian bishops from attending. Even though Chalcedon reaffirmed the Third Council’s condemnation of ": null
    },
    {
        "Nestorius": "Nestorius"
    },
    {
        ", the Non-Chalcedonians always suspected that the Chalcedonian Definition tended towards Nestorianism. This was in part because of the restoration of a number of bishops deposed at the Second Council of Ephesus, bishops who had previously indicated what appeared to be support of Nestorian positions.     The ": null
    },
    {
        "Coptic Church of Alexandria": "Coptic Church Of Alexandria"
    },
    {
        " dissented, holding to ": null
    },
    {
        "Cyril of Alexandrias": "Cyril Of Alexandria"
    },
    {
        "preferred formula for the oneness of Christs nature in the incarnation of God the Word as out of two natures . Bindley, T. Herbert & Green, F.  W. The Oecumenical Documents of the Faith Methuen pp.  91–92 Cyrils language is not consistent and he may have countenanced the view that it is possible to contemplate in theory two natures after the incarnation, but the Church of Alexandria felt that the Definition should have stated that Christ be acknowledged out of two natures rather than in two natures .     The definition defines that Christ is acknowledged in two natures , which come together into one person and one ": null
    },
    {
        "hypostasis": "Hypostatic Union"
    },
    {
        " . The formal definition of two natures in Christ was understood by the critics of the council at the time, and is understood by many historians and theologians today, to side with western and Antiochene ": null
    },
    {
        "Christology": "Christology"
    },
    {
        " and to diverge from the teaching of ": null
    },
    {
        "Cyril of Alexandria": "Cyril Of Alexandria"
    },
    {
        ", who always stressed that Christ is one . However, a modern analysis of the sources of the creed  and a reading of the acts, or proceedings, of the council show that the bishops considered Cyril the great authority and that even the language of two natures derives from him.     This ": null
    },
    {
        "miaphysite": "Miaphysitism"
    },
    {
        " position, historically characterised by Chalcedonian followers as ": null
    },
    {
        "monophysitism": "Monophysitism"
    },
    {
        " though this is denied by the dissenters, formed the basis for the distinction from other churches of the Coptic Church of Egypt and ": null
    },
    {
        "Ethiopia": "Ethiopian Orthodox Church"
    },
    {
        " and the ": null
    },
    {
        "Jacobite": "Syriac Orthodox Church"
    },
    {
        " churches of ": null
    },
    {
        "Syria": "Syriac Orthodox Church"
    },
    {
        ", and the ": null
    },
    {
        "Armenian Apostolic Church": "Armenian Apostolic Church"
    },
    {
        " ": null
    }
]