[
    {
        "     The Chaos Computer Club  is Europes largest association of ": null
    },
    {
        "hackers": "hacker"
    },
    {
        " with  registered members. It is incorporated as an  eingetragener Verein  in Germany, with local chapters  in various cities in Germany and other German-speaking countries.   Since 1985, some chapters in Switzerland have organized an independent sister association called the  instead.     The CCC describes itself as a galactic community of life forms, independent of age, sex, race or societal orientation, which strives across borders for freedom of information… . In general, the CCC advocates more transparency in government, ": null
    },
    {
        "freedom of information": "freedom of information"
    },
    {
        ", and the ": null
    },
    {
        "human right": "human rights"
    },
    {
        " to communication. Supporting the principles of the ": null
    },
    {
        "hacker ethic": "hacker ethic"
    },
    {
        ", the club also fights for free universal access to computers and technological infrastructure as well as the use of ": null
    },
    {
        "open-source software": "open-source software"
    },
    {
        ". The CCC spreads an entrepreneurial vision refusing capitalist control. It has been characterised as …one of the most influential digital organisations anywhere, the centre of German digital culture, ": null
    },
    {
        "hacker culture": "hacker culture"
    },
    {
        ", hacktivism, and the intersection of any discussion of democratic and digital rights .     Members of the CCC have demonstrated and publicized a number of important information security problems.   The CCC frequently criticizes new legislation and products with weak information security which endanger citizen rights or the privacy of users.   Notable members of the CCC regularly function as expert witnesses for the ": null
    },
    {
        "German constitutional court": "federal constitutional court"
    },
    {
        ", organize lawsuits and campaigns, or otherwise influence the political process.                The CCC hosts the annual ": null
    },
    {
        "Chaos Communication Congress": "chaos communication congress"
    },
    {
        ", Europes biggest hacker gathering.   When the event was held in the ": null
    },
    {
        "Hamburg congress center": "congress center hamburg"
    },
    {
        " in 2013, it drew  guests.   For the 2016 installment,  guests were expected, with additional viewers following the event via live streaming.     Every four years, the ": null
    },
    {
        "Chaos Communication Camp": "chaos communication camp"
    },
    {
        " is the outdoor alternative for hackers worldwide.   The CCC also held, from 2009 to 2013, a yearly conference called ": null
    },
    {
        "SIGINT": "sigint"
    },
    {
        " in ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " which focused on the impact of digitisation on society. The SIGINT conference was discontinued in 2014.    Another yearly CCC event taking place on the Easter weekend is the ": null
    },
    {
        "Easterhegg": "easterhegg"
    },
    {
        ", which is more workshop oriented than the other events.     The CCC often uses the ": null
    },
    {
        "c-base station": "c-base"
    },
    {
        " located in Berlin as an event location or as function rooms.       The CCC publishes the irregular magazine  Datenschleuder   since 1984.   The Berlin chapter produces a monthly radio show called  which picks up various technical and political topics in a two-hour ": null
    },
    {
        "talk radio": "talk radio"
    },
    {
        " show. The program is aired on a local radio station called  and on the internet.   Other programs have emerged in the context of Chaosradio, including radio programs offered by some regional Chaos Groups and the podcast spin-off CRE by ": null
    },
    {
        "Tim Pritlove": "tim pritlove"
    },
    {
        ".     Many of the chapters of CCC participate in the volunteer project Chaos macht Schule which supports teaching in local schools. Its aims are to improve technology and ": null
    },
    {
        "media literacy": "media literacy"
    },
    {
        " of pupils, parents, and teachers.        CCC members are present in big tech companies and in administrative instances. One of the spokespersons of the CCC, as of 1986, ": null
    },
    {
        "Andy Müller-Maguhn": "andy müller-maguhn"
    },
    {
        ", was a member of the executive committee of the ": null
    },
    {
        "ICANN": "icann"
    },
    {
        " between 2000 and 2002.        The CCC sensitises and introduces people to the questions of data privacy. They regularly host so-called cryptoparties in bars in Berlin to which anyone is invited to better understand how to protect their personal data and their computer from hacking.                 The CCC was founded in Berlin on 12 September 1981 at a table which had previously belonged to the ": null
    },
    {
        "Kommune 1": "kommune 1"
    },
    {
        " in the rooms of the newspaper ": null
    },
    {
        "Die Tageszeitung": "die tageszeitung"
    },
    {
        " by ": null
    },
    {
        "Wau Holland": "wau holland"
    },
    {
        " and others in anticipation of the prominent role that information technology would play in the way people live and communicate.       The CCC became world-famous in 1984 when they drew public attention to the security flaws of the German ": null
    },
    {
        "Bildschirmtext": "bildschirmtext"
    },
    {
        " computer network by causing it to debit ": null
    },
    {
        "DM": "deutsche mark"
    },
    {
        "  in a Hamburg bank in favor of the club. The money was returned the next day in front of the press. Prior to the incident, the system provider had failed to react to proof of the security flaw provided by the CCC, claiming to the public that their system was safe. Bildschirmtext was the biggest commercially available online system targeted at the general public in its region at that time, run and heavily advertised by the German telecommunications agency ": null
    },
    {
        "Deutsche Bundespost": "deutsche bundespost"
    },
    {
        " which also strove to keep up-to-date alternatives out of the market.           In 1987, the CCC was peripherally involved in the first ": null
    },
    {
        "cyberespionage": "cyberespionage"
    },
    {
        " case to make international headlines. A group of ": null
    },
    {
        "German": "west germany"
    },
    {
        " hackers led by ": null
    },
    {
        "Karl Koch": "hagbard"
    },
    {
        ", who was loosely affiliated with the CCC, was arrested for breaking into US government and corporate computers, and then selling operating-system source code to the Soviet ": null
    },
    {
        "KGB": "kgb"
    },
    {
        ".   This incident was portrayed in the movie  23 .       In April 1998, the CCC successfully demonstrated the cloning of a ": null
    },
    {
        "GSM": "gsm"
    },
    {
        " customer card, breaking the ": null
    },
    {
        "COMP128": "comp128"
    },
    {
        " encryption": "encryption"
    },
    {
        " algorithm used at that time by many GSM ": null
    },
    {
        "SIM": "subscriber identity module"
    },
    {
        "s.               In 2001, the CCC celebrated its twentieth birthday with an interactive light installation dubbed Project Blinkenlights that turned the building ": null
    },
    {
        "Haus des Lehrers": "haus des lehrers"
    },
    {
        " in Berlin into a giant computer screen. A follow up installation, Arcade, at the ": null
    },
    {
        "Bibliothèque nationale de France": "bibliothèque nationale de france"
    },
    {
        " was the worlds biggest light installation.   Later in October 2008, CCCs Project Blinkenlights went to ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        ", ": null
    },
    {
        "Ontario": "ontario"
    },
    {
        ", Canada with project Stereoscope.        In March 2008, the CCC acquired and published the fingerprints of German ": null
    },
    {
        "Minister of the Interior": "minister of the interior"
    },
    {
        " Wolfgang Schäuble": "wolfgang schäuble"
    },
    {
        ". The magazine also included the fingerprint on a film that readers could use to fool ": null
    },
    {
        "fingerprint reader": "fingerprint reader"
    },
    {
        "s.  This was done to protest the use of biometric data in German identity devices such as ": null
    },
    {
        "e-passports": "biometric passport"
    },
    {
        ".              The Staatstrojaner  is a ": null
    },
    {
        "computer surveillance": "computer surveillance"
    },
    {
        " program installed secretly on a suspects computer, which the German police uses to ": null
    },
    {
        "wiretap": "wiretap"
    },
    {
        " Internet telephony": "internet telephony"
    },
    {
        ". This source wiretapping is the only feasible way to wiretap in this case, since Internet telephony programs will usually ": null
    },
    {
        "encrypt": "encryption"
    },
    {
        " the data when it leaves the computer. The ": null
    },
    {
        "Federal Constitutional Court of Germany": "federal constitutional court of germany"
    },
    {
        " has ruled that the police may only use such programs for telephony wiretapping, and for no other purpose, and that this restriction should be enforced through technical and legal means.     On 8 October 2011, the CCC published an analysis of the Staatstrojaner software. The software was found to have the ability to remote control the target computer, to capture ": null
    },
    {
        "screenshots": "screenshots"
    },
    {
        ", and to fetch and run arbitrary extra code. The CCC says that having this functionality built in is in direct contradiction to the ruling of the constitutional court.     In addition, there were a number of security problems with the implementation. The software was controllable over the Internet, but the commands were sent completely un": null
    },
    {
        "encrypted": "encrypted"
    },
    {
        ", with no checks for authentication or integrity. This leaves any computer under surveillance using this software vulnerable to attack. The captured screenshots and audio files were encrypted, but so incompetently that the encryption was ineffective. All captured data was sent over a proxy server in the United States, which is problematic since the data is then temporarily outside the German ": null
    },
    {
        "jurisdiction": "jurisdiction"
    },
    {
        ".     The CCCs findings were widely reported in the German press.    This trojan has also been nicknamed ": null
    },
    {
        "R2-D2": "r2-d2"
    },
    {
        " Basil Cupa, , LISS 2013, pp. 419-428   because the string C3PO-r2d2-POE was found in its code; another alias for it is 0zapftis .  According to a ": null
    },
    {
        "Sophos": "sophos"
    },
    {
        " analysis, the trojans behavior matches that described in a confidential memo between the German ": null
    },
    {
        "Landeskriminalamt": "landeskriminalamt"
    },
    {
        " and a software firm called ; the memo was leaked on ": null
    },
    {
        "WikiLeaks": "wikileaks"
    },
    {
        " in 2008. Among other correlations is the droppers file name scuinst.exe , short for Skype Capture Unit Installer.  The 64-bit Windows version installs a digitally signed driver, but signed by the non-existing ": null
    },
    {
        "certificate authority": "certificate authority"
    },
    {
        " Goose Cert .   DigiTask later admitted selling spy software to governments.      The ": null
    },
    {
        "Federal Ministry of the Interior": "federal ministry of the interior"
    },
    {
        " released a statement in which they denied that R2-D2 has been used by the ": null
    },
    {
        "Federal Criminal Police Office": "federal criminal police office"
    },
    {
        " ; this statement however does not eliminate the possibility that it has been used by state-level German police forces. The BKA had previously announced however that they had somewhat similar trojan software that can inspect a computers hard drive.       Former ": null
    },
    {
        "WikiLeaks": "wikileaks"
    },
    {
        " spokesman ": null
    },
    {
        "Daniel Domscheit-Berg": "daniel domscheit-berg"
    },
    {
        " was expelled from the national CCC in August 2011. ,  Der Spiegel , 2011-08-15 Heather Brooke, ,  The Guardian , 2011-08-25 This decision was revoked on February 2012.    As a result of his role in the expulsion, board member ": null
    },
    {
        "Andy Müller-Maguhn": "andy müller-maguhn"
    },
    {
        " was not reelected for another term.       The CCC has repeatedly warned phone users of the weakness of biometric identification in the wake of the 2008 Schäuble fingerprints affair. In their hacker ethics the CCC includes protect people data , but also Computers can change your life for the better .  The club regards privacy as an individual right: the CCC does not discourage people from sharing or storing personal information on their phones, but advocates better privacy protection, and the use of specific browsing and sharing techniques by users.       From a photograph of the users fingerprint on a glass surface, using easy everyday means ,  the biometrics hacking team of the CCC, was able to unlock an iPhone 5S.       The Samsung Galaxy S8s iris recognition system claims to be one of the safest ways to keep your phone locked and the contents private as patterns in your irises are unique to you and are virtually impossible to replicate , as quoted in official Samsung content.  However, in some cases, using a high resolution photograph of the phone owners iris and a lens, the CCC claimed to be able to trick the authentification system.     Fake Chaos Computer Club FranceChaos Computer Club France was a fake hacker organisation created in 1989 in ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " by ": null
    },
    {
        "Jean-Bernard Condat": "jean-bernard condat"
    },
    {
        ", under the command of Jean-Luc Delacour, an agent of the ": null
    },
    {
        "Direction de la surveillance du territoire": "direction de la surveillance du territoire"
    },
    {
        " governmental agency. The primary goal of the CCCF was to watch and to gather information about the French hacker community, identifying the hackers who could harm the country.  Phrack  No. 64, , 2007:  A good example of this was the fake hacking meeting created in the middle 1990 so called the CCCF where a lot of hackers got busted under the active participation of a renegade hacker so called Jean-Bernard Condat.  Journalist  said that this organization also worked with the ": null
    },
    {
        "French National Gendarmerie": "gendarmerie nationale"
    },
    {
        ".     The CCCF had an ": null
    },
    {
        "electronic": "digital edition"
    },
    {
        " magazine called Chaos Digest . Between 4 January 1993 and 5 August 1993, seventy-three issues were published ": null
    }
]