[
    {
        "     Charles II , also known as El Hechizado or the Bewitched, was the last ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        " ruler of the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        ". He is now best remembered for his physical disabilities, and ": null
    },
    {
        "the war": "war of the spanish succession"
    },
    {
        " for his throne that followed his death.     He died childless in 42 with no immediate Habsburg heir. His will named his successor as 42-year-old ": null
    },
    {
        "Philip of Anjou": "philip v of spain"
    },
    {
        ", grandson of ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " and Charless half-sister ": null
    },
    {
        "Maria Theresa": "maria theresa of spain"
    },
    {
        ". Disputes over the inheritance led to the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        ".          Charles was born in ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        " to ": null
    },
    {
        "Philip IV of Spain": "philip iv of spain"
    },
    {
        " and his second wife, ": null
    },
    {
        "Mariana of Austria": "mariana of austria"
    },
    {
        ". The only surviving son of his fathers two marriages, he was given the title ": null
    },
    {
        "Prince of Asturias": "prince of asturias"
    },
    {
        ", traditionally held by the heir to the Spanish throne.     The ": null
    },
    {
        "Habsburgs": "house_of_habsburg"
    },
    {
        " achieved their prominence due to advantageous marriages, and protected their holdings by frequent intermarriage between the Spanish and Austrian branches. Philip and Mariana were uncle and niece, making Charles their great-nephew and first cousin respectively, as well as their son. All eight of his great-grandparents were descendants of ": null
    },
    {
        "Joanna": "joanna of castile"
    },
    {
        " and ": null
    },
    {
        "Philip I of Castile": "philip i of castile"
    },
    {
        ".     The impact of this is not fully understood, and his elder sister ": null
    },
    {
        "Margaret Theresa": "margaret theresa of spain"
    },
    {
        " did not have the same issues. It has been suggested he may have had the endocrine disease ": null
    },
    {
        "acromegaly": "acromegaly"
    },
    {
        " and a combination of rare genetic disorders often transmitted through ": null
    },
    {
        "recessive genes": "dominance"
    },
    {
        ", including ": null
    },
    {
        "combined pituitary hormone deficiency": "prop1"
    },
    {
        " and distal ": null
    },
    {
        "renal tubular acidosis": "renal tubular acidosis"
    },
    {
        ".     However, evidence supporting ": null
    },
    {
        "inbreeding": "inbreeding"
    },
    {
        " as an important factor in the extinction of the Spanish Habsburg lineage not conclusive; it has not been demonstrated disabilities suffered by Charles II were caused by detrimental recessive alleles inherited from common ancestors.      Regardless of the cause, Charles suffered ill-health throughout his life and has been described as short, lame, epileptic, senile and completely bald before 42 always on the verge of death but repeatedly baffling Christendom by continuing to live.  In his case, the so-called ": null
    },
    {
        "Habsburg lip": "prognathismmandibular prognathism"
    },
    {
        " was so pronounced he spoke and ate only with difficulty, did not learn to talk until the age of four or walk until eight. However, foreign observers such as ": null
    },
    {
        "the Marquess of Torcy": "jean-baptiste colbert, marquess of torcy"
    },
    {
        " reported his mental capacities remained intact.          When Charles became King in 42 the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        " or Monarchy remained an enormous global confederation in terms of territory, but decades of war ended Spains supremacy in Europe. The 42 ": null
    },
    {
        "Treaty of Westphalia": "treaty of westphalia"
    },
    {
        " recognised the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " and ended the 4242 ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        ", but also agreed peace between the ": null
    },
    {
        "Austrian Habsburgs": "habsburg_monarchyaustrian_monarchy"
    },
    {
        " and France. After centuries of mutual support, this left the Spanish Habsburgs fighting the ": null
    },
    {
        "4242 war with France": "franco-spanish war"
    },
    {
        ", and a ": null
    },
    {
        "Portuguese revolt": "portuguese_restoration_war"
    },
    {
        ", which only ended in 42     The Kingdom of Spain comprised the two Crowns of ": null
    },
    {
        "Castile": "crown of castile"
    },
    {
        " and ": null
    },
    {
        "Aragon": "crown of aragon"
    },
    {
        ", each with very different political cultures and traditions. This made it hard to enact reforms or collect taxes and government finances were in perpetual crisis. Spain declared bankruptcy nine times between 42 and 42 including 42 42 42 and 42     However, the 42th century was a period of crisis for many European states and Spain was not alone in facing these problems. Infighting between those who ruled in Charles name did little to help but it is debatable how far they or he can be held responsible for long-term trends predating his reign; the Monarchy proved remarkably resilient and when Charles died remained largely intact.          Charles was three years old when his father, Philip IV, died on 42 September 42; as he was a legal minor, his mother Mariana was appointed Queen Regent by the ": null
    },
    {
        "Council of Castile": "council of castile"
    },
    {
        ". While Charles theoretically ruled in his own name after her death in 42 frequent ill-health meant power was often exercised by others. Internal struggles for control further weakened government, the feud between his mother and illegitimate half-brother ": null
    },
    {
        "John of Austria the Younger": "john of austria the younger"
    },
    {
        " being especially damaging.     The system of delegating duties to a personal minister or validos was established by Philip with the appointment of ": null
    },
    {
        "the Count-Duke of Olivares": "gaspar de guzmán, count-duke of olivares"
    },
    {
        " in 42 Mariana followed this precedent, the first being her Austrian personal confessor, Father ": null
    },
    {
        "Juan Everardo Nithard": "juan everardo nithard"
    },
    {
        "; modern assessments of her rule often reflect the contemporary view woman were incapable of exercising power on their own.     When Charles came to the throne, his administration was faced by the long-running ": null
    },
    {
        "Portuguese Restoration War": "portuguese restoration war"
    },
    {
        " and the ": null
    },
    {
        "War of Devolution": "war of devolution"
    },
    {
        " with France. The Crown had declared bankruptcy in 42 and 42 and reducing their military commitments was a matter of extreme urgency. In 42 the ": null
    },
    {
        "Treaty of Aix-la-Chapelle": "treaty of aix-la-chapelle"
    },
    {
        " ended the war with France and the ": null
    },
    {
        "Treaty of Lisbon": "treaty of lisbon"
    },
    {
        " accepted the restoration of the ": null
    },
    {
        "Crown of Portugal": "kingdom of portugal"
    },
    {
        " and loss of the ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        ".       Spain was no longer strong enough to retain Portugal against its will, while Aix-la-Chapelle restored most of their losses in the Spanish Netherlands and ": null
    },
    {
        "Franche-Comté": "franche-comté"
    },
    {
        ". However, John exploited discontent within the ruling class to instigate a revolt in Aragon and Catalonia, compelling Mariana to dismiss Nithard in February 42 and replace him with ": null
    },
    {
        "Fernando de Valenzuela": "fernando de valenzuela, 1st marquis of villasierra"
    },
    {
        ". When Charles turned 42 in 42 he was legally able to rule on his own and John used this to remove Valenzuela; Mariana had the Regency continued on the basis of Charless disabilities and Valenzuela was restored in 42     The 42 ": null
    },
    {
        "Franco-Dutch War": "franco-dutch war"
    },
    {
        " dragged Spain into another war with France over the Spanish Netherlands, the cost of which placed almost intolerable strain on the economy. In January 42 John finally took charge of government, expelled Mariana and exiled Valenzuela; his first act was to end the war and in the 42 ": null
    },
    {
        "Treaties of Nijmegen": "treaties of nijmegen"
    },
    {
        ", Spain ceded Franche-Comté and areas of the Spanish Netherlands returned in 42 His government faced an almost impossible situation and he had insufficient time to have a real impact before his death in September 42 However, he arranged the marriage of Charles to the 42-year-old French royal, ": null
    },
    {
        "Marie Louise of Orléans": "marie louise of orléans"
    },
    {
        "; Mariana returned as Queen Regent but her influence was diminished.      The 4242 ": null
    },
    {
        "War of the Reunions": "war of the reunions"
    },
    {
        " was a brief but devastating conflict with France over the Spanish Netherlands, followed in 42 by the outbreak of the ": null
    },
    {
        "Nine Years War": "nine years war"
    },
    {
        ". Shortly afterwards in February 42 Marie Louise died; despite allegations she was poisoned, based on the description of her symptoms, modern doctors believe her illness was almost certainly appendicitis. In August, Charles married ": null
    },
    {
        "Maria Anna of Neuburg": "maria anna of neuburg"
    },
    {
        " by proxy, the formal wedding taking place in May 42; after his mother died on 42 May 42 he ruled in his own name although Maria Anna played a significant role due to his ill-health and her control over access to Charles.     It was clear Charles health was finally failing and agreeing upon his successor became increasingly urgent. The Nine Years War showed France could not achieve its objectives on its own; the 42 ": null
    },
    {
        "Treaty of Ryswick": "treaty of ryswick"
    },
    {
        " was the result of mutual exhaustion and Louis search for allies in anticipation of a contest over the Spanish throne. The Habsburg Emperor Leopold initially refused to sign the Treaty since it left this issue unresolved; he reluctantly did so in October 42 but all sides viewed it as simply a pause in hostilities.          One of Johns last acts was to arrange Charles marriage in 42 to ": null
    },
    {
        "Marie Louise of Orléans": "marie louise of orléans"
    },
    {
        ", eldest daughter of ": null
    },
    {
        "Philippe I, Duke of Orléans": "philippe i, duke of orléans"
    },
    {
        ". The French ambassador wrote that ...the Catholic King is so ugly as to cause fear and he looks ill while the marriage was strongly resisted by the prospective bride but went ahead regardless.     When Mariana returned as Regent, she did her utmost to isolate Marie Louise, who was French, rather than Austrian, and the choice of her bitter rival. Marie Louise claimed Charles suffered from premature ejaculation; the lack of an heir made her unpopular, fertility treatments gave her severe intestinal problems and she became depressed. The pressure to produce an heir is illustrated by the story that when an astrologer suggested Charles sterility was due to his failure to say goodbye to his father, Mariana had Philip IVs body disinterred to allow him to do so.      Charles was distraught when Marie Louise died in February 42 but his declining health meant in August he married ": null
    },
    {
        "Maria Anna of Neuburg": "maria anna of neuburg"
    },
    {
        ", daughter of ": null
    },
    {
        "Philip William, Elector Palatine": "philip william, elector palatine"
    },
    {
        " and sister-in-law to the Emperor Leopold. As one of 42 children, she was selected for her family background of fertility but also to strengthen the pro-Austrian faction in the Spanish court; when Mariana herself died in 42 she assumed leadership of this element. The marriage was no more successful in producing an heir; after his death, Charles autopsy revealed he had only one ": null
    },
    {
        "atrophied": "atrophy"
    },
    {
        " testicle and he was almost certainly impotent by this stage.     As the Crown of Spain passed according to ": null
    },
    {
        "cognatic primogeniture": "primogenituremale-preference primogeniture"
    },
    {
        ", it was possible for a woman, or the descendant of a woman, to inherit the crown. This enabled Charles sisters ": null
    },
    {
        "Maria Theresa ": "maria theresa of spain"
    },
    {
        " and ": null
    },
    {
        "Margaret Theresa ": "margaret theresa of spain"
    },
    {
        " to pass their rights to the children of their marriages with Louis XIV and ": null
    },
    {
        "Emperor Leopold": "leopold i, holy roman emperor"
    },
    {
        ".     In 42 Leopold and Margarets daughter ": null
    },
    {
        "Maria Antonia": "maria antonia of austria"
    },
    {
        " married ": null
    },
    {
        "Max Emanuel of Bavaria": "maximilian ii emanuel, elector of bavaria"
    },
    {
        "; she died in 42 leaving one surviving son, ": null
    },
    {
        "Joseph Ferdinand": "joseph ferdinand of bavaria"
    },
    {
        ". In October 42 France, Britain and the Dutch Republic attempted to impose a diplomatic solution to the Succession on Spain and Austria, by the ": null
    },
    {
        "Treaty of the Hague": "treaty of the hague"
    },
    {
        " or First Partition Treaty. This made Joseph Ferdinand heir to the bulk of the Spanish Monarchy, with France gaining the Kingdoms of ": null
    },
    {
        "Naples": "kingdom of naples"
    },
    {
        " and ": null
    },
    {
        "Sicily": "kingdom of sicily"
    },
    {
        " and other concessions in Italy plus the modern Basque province of ": null
    },
    {
        "Gipuzkoa": "gipuzkoa"
    },
    {
        ". Leopolds younger son Archduke ": null
    },
    {
        "Charles": "charles vi, holy roman emperor"
    },
    {
        " became ruler of the ": null
    },
    {
        "Duchy of Milan": "duchy of milan"
    },
    {
        ", a possession considered vital to the security of Austrias southern border.      Unsurprisingly, the Spanish objected to their Empire being divided by foreign powers without consultation, and on 42 November 42 Charles II published his will. This made six year old Joseph Ferdinand heir to an independent and undivided Spanish Monarchy, with Maria Anna as Queen Regent during his minority, an announcement allegedly received by the Spanish councillors in silence.     Joseph Ferdinand died of smallpox in 42 leaving Louis XIVs eldest son, the ": null
    },
    {
        "Grand Dauphin": "louis, grand dauphin"
    },
    {
        ", as the senior surviving legitimate descendant of Philip IV; since this would lead to the union of Spain and France, an alternative was needed. In March 42 France, Britain and the Dutch agreed to the Second Partition Treaty or ": null
    },
    {
        "Treaty of London": "treaty of london"
    },
    {
        "; Archduke Charles replaced Joseph Ferdinand as heir, with Spanish possessions in Europe split between France, ": null
    },
    {
        "Savoy": "duchy of savoy"
    },
    {
        " and Austria. Charles altered his will in favour of Archduke Charles, once again stipulating an undivided and independent Spanish Monarchy.     However, much of the nobility, including Charles, disliked the Austrians and saw genuine advantages for Spain in a Bourbon candidate. In September 42 Charles became ill again; by 42 September he was no longer able to eat and Portocarrero persuaded him to alter his will in favour of Louis XIVs grandson, ": null
    },
    {
        "Philip of Anjou": "philip v of spain"
    },
    {
        ". When Charles died on 42 November 42 the throne was offered to Philip, who was proclaimed King of Spain on 42 November 42 This was accepted by Britain and the Dutch Republic among others but disputes over division of territories and commercial rights led to the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        " in 42            Charles died in Madrid five days before his 42th birthday on 42 November 42 the 42th death anniversary of his elder brother ": null
    },
    {
        "Philip": "philip prospero, prince of asturias"
    },
    {
        ". The physician who performed his autopsy stated his body did not contain a single drop of blood; his heart was the size of a peppercorn; his lungs corroded; his intestines rotten and gangrenous; he had a single testicle, black as coal, and his head was full of water. Gargarilla, Pedro. Enfermedades de los reyes de España. Los Austrias : de la locura de Juana a la impotencia de Carlos II el Hechizado La Esfera de los Libros S.L., 42      His life was memorably summarised by ": null
    },
    {
        "John Langdon-Davies": "john langdon-davies"
    },
    {
        " as follows: We are dealing with a man who died of poison two hundred years before he was born. If birth is a beginning, of no man was it more true to say that in his beginning was his end. From the day of his birth they were waiting for his death.          When he came to the throne, the ": null
    },
    {
        "Inquisition": "spanish inquisition"
    },
    {
        " remained a significant force but its influence had declined and the auto-da-fé were an attempt to publicly assert its power, rather than increased religiosity. While Charles certainly played a role, its downfall was largely the result of the political struggle over his heir. In 42 the Inquisitor General, ": null
    },
    {
        "Balthasar de Mendoza": "baltasar de mendoza y sandoval"
    },
    {
        ", Bishop of Segovia, arrested Charles personal confessor Froilán Díaz on a charge of bewitching the King. When he was found not guilty, Mendoza attempted to arrest those who voted for his acquittal, resulting in the establishment of a Council to investigate the Inquisition; it survived as an institution until 42 but with little power.     More tangible memorials include ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        " in modern ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " and the ": null
    },
    {
        "Caroline Islands": "caroline islands"
    },
    {
        ", which were named after him in 42 and 42 respectively. The municipality of ": null
    },
    {
        "Carolina, Puerto Rico": "carolina, puerto rico"
    },
    {
        " is also named for Charles II.                          ": null
    }
]