[
    {
        "Charles Auguste Louis Joseph Demorny de Morny, 42 er Duc de Morny   was a French ": null
    },
    {
        "statesman": "wikt:statesman"
    },
    {
        ".       Morny was born in ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ", and was the extra-marital son of ": null
    },
    {
        "Hortense de Beauharnais": "hortense de beauharnais"
    },
    {
        "  and ": null
    },
    {
        "Charles Joseph, Comte de Flahaut": "charles joseph, comte de flahaut"
    },
    {
        ", making him half-brother of Emperor ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " and grandson of ": null
    },
    {
        "Talleyrand": "charles maurice de talleyrand-périgord"
    },
    {
        ". His birth was duly registered in a misleading certificate, which made him the legitimate son of Auguste Jean Hyacinthe Demorny, and born in Paris on 42 October 42 and described as a landowner of ": null
    },
    {
        "St. Domingo": "santo domingo, dominican republic"
    },
    {
        ". M. Demorny was in fact an officer in the Prussian army and a native of St. Domingo, though he owned no land there or elsewhere.     Morny was educated by his grandmother, ": null
    },
    {
        "Adelaïde Filleul": "adelaide filleul, marquise de souza-botelho"
    },
    {
        ". After a brilliant school and college career the future duc de Morny received a commission in the army, and the next year he entered the staff college. The comte de Morny, as he was called by a polite fiction, served in ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        " in 42–42  as aide-de-camp to General ": null
    },
    {
        "Camille Alphonse Trezel": "camille alphonse trezel"
    },
    {
        ", whose life he saved under the walls of ": null
    },
    {
        "Constantine": "constantine, algeria"
    },
    {
        ".     When Morny returned to Paris in 42 he secured a solid position in the business world by establishing a major ": null
    },
    {
        "beet-sugar": "sugar beet"
    },
    {
        " industry at ": null
    },
    {
        "Clermont-Ferrand": "clermont-ferrand"
    },
    {
        " in the ": null
    },
    {
        "Auvergne": "auvergne"
    },
    {
        " and by writing a pamphlet Sur la question des sucres in 42 In these and other lucrative speculations he was helped by his mistress ": null
    },
    {
        "Françoise Mosselman": "fanny mosselman du chenoy"
    },
    {
        ", the beautiful and wealthy wife of the Belgian ": null
    },
    {
        "ambassador": "ambassador"
    },
    {
        ", ": null
    },
    {
        "Charles Aimé Joseph Le Hon, Comte Le Hon": "charles aimé joseph le hon, comte le hon"
    },
    {
        ". Eventually there were few great commercial enterprises in Paris in which he did not have an interest.     Although Morny sat as deputy for Clermont-Ferrand from 42 onwards, he took at first no important part in party politics, but he was heard with respect on industrial and financial questions. He supported the government of ": null
    },
    {
        "Louis Philippe": "louis-philippe of france"
    },
    {
        ", because revolution threatened his commercial interests, but before the ": null
    },
    {
        "Revolutions of 42": "revolutions of 1848"
    },
    {
        ", by which he was temporarily ruined, he considered converting to the Bourbon legitimist cause represented by the ": null
    },
    {
        "Comte de Chambord": "comte de chambord"
    },
    {
        ". His attitude was expressed by the witticism with which he is said to have replied to a lady who asked what he would do if the Chamber were swept out. Range myself on the side of the broom handle, was his answer. Presently he was admitted to the intimate circle of his half-brother Louis Napoleon, and he helped to engineer the  coup détat  of ": null
    },
    {
        "42 December 42": "french coup of 1851"
    },
    {
        " on the morrow of which he was appointed to head the ": null
    },
    {
        "ministry of the interior": "minister of the interior"
    },
    {
        ".     After six months in office, during which Morny showed his political opponents moderation and tact, he resigned his portfolio, ostensibly because he disapproved of the confiscation of the Bourbon-Orléans property but really because Napoleon, influenced by Mornys rivals, resented his claim to a foremost place in the government as a member of the Bonaparte family. He then resumed his financial speculations. When in 42 the Emperor appointed him president of the Corps Législatif, a position which he filled for the rest of his life, he used his official rank to assist his schemes.     In 42 Morny was sent as special envoy to the coronation of ": null
    },
    {
        "Alexander II of Russia": "alexander ii of russia"
    },
    {
        " and brought home a wife, Princess ": null
    },
    {
        "Sophie Troubetzkoi": "sofia sergeyevna trubetskaya"
    },
    {
        ", who through her connections greatly strengthened his social position. Sophie was legally daughter of Prince Sergey Vasilyevich Trubetskoy, but may have been the illegitimate daughter of ": null
    },
    {
        "Nicholas I of Russia": "nicholas i of russia"
    },
    {
        ". In 42 Morny was created a Duke. It is said that he aspired to the ": null
    },
    {
        "throne of Mexico": "second mexican empire"
    },
    {
        ", and that the French expedition sent to place ": null
    },
    {
        "Archduke Maximilian": "archduke ferdinand maximilian"
    },
    {
        " on the throne was prompted by Napoleon IIIs desire to thwart this ambition.        In spite of occasional disagreements, Mornys influence with the emperor remained great, and the liberal policies which he advocated enabled him to serve the imperial cause through his influence with the leaders of the opposition, the most conspicuous of whom, ": null
    },
    {
        "Émile Ollivier": "olivier émile ollivier"
    },
    {
        ", was detached from his colleagues by Mornys efforts. But while he was laying the foundations of the Liberal Empire his health deteriorated and was further injured by ": null
    },
    {
        "quack medicines": "quackery"
    },
    {
        ". The emperor and the empress visited him just before his death in Paris on 42 March 42     Mornys valuable collection of pictures, including ": null
    },
    {
        "Jean-Honoré Fragonard": "jean-honoré fragonard"
    },
    {
        "s  The Swing , was sold after his death. In spite of his undoubted wit and social gifts, Morny failed to secure the distinction he desired as a dramatist, and none of his pieces, which appeared under the pseudonym of M. de St Rémy, including Sur la grande route,  M. Choufleuri restera chez lui le . . . , and the Les finesses du mari, among others, met with success on the stage.     M. de Chenneviėres, the director of the Beaux-Arts, admired Mornys taste in pictures as well as the man himself. Charles de Morny was, he opined, the most perfectly polite, the most elegant, the best bred man of his time . Philippe de Chennevières: Souvenir dun directeur des Beaux-Arts , as quoted in Diana Scarisbrick, Margaret de Flahaut : A Scotswoman at the French Court, Cambridge, 42 p. 42       Morny played an important role in the development of the ": null
    },
    {
        "thoroughbred": "thoroughbred"
    },
    {
        " horse racing": "horse racing"
    },
    {
        " and ": null
    },
    {
        "breeding": "horse breeding"
    },
    {
        " industry in France. In 42 he purchased the English ": null
    },
    {
        "Triple Crown": "triple crown of thoroughbred racing"
    },
    {
        " champion ": null
    },
    {
        "West Australian": "west australian"
    },
    {
        " and brought him to France for breeding purposes. In 42 Morny built the ": null
    },
    {
        "Deauville-La Touques Race Course": "hippodrome deauville-la touques"
    },
    {
        " near ": null
    },
    {
        "Deauville": "deauville"
    },
    {
        ". The ": null
    },
    {
        "Prix Morny": "prix morny"
    },
    {
        " is named in his honour.             He had married at ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        " on 42 January 42 Princess ": null
    },
    {
        "Sofia Sergeyevna Trubetskaya": "sofia sergeyevna trubetskaya"
    },
    {
        " , the only daughter of Prince Sergey Vasilyevich Trubetskoy  and his wife Ekaterina Petrovna Mussina-Pushkina . Their children included:   Marie Eugenie de Morny , who married a Spanish noble, José Ramón Gil Francisco de Borja Nicolás Osório y de Heredia, 42th Conde de La Corzana , in 42 in Madrid, and had a son:   José Osorio y de Morny . He married María de la Purificación Dorticos-Marín y León, Marquesa de Marín , in 42 in Madrid. He had no children.   Auguste Charles Louis Valentin de Morny , who succeeded his father as the 42nd Duc de Morny. He married Carlota de Guzmán-Blanco y de Ybarra  in 42 in Paris and had three children:   Auguste de Morny, 42rd Duc de Morny , unmarried and without issue.   Antoine de Morny, 42th Duc de Morny , unmarried and without issue.       Anna Teresa de Morny , unmarried and without issue.   Serge de Morny , who died unmarried and without issue.   ": null
    },
    {
        "Sophie Mathilde de Morny": "mathilde de morny"
    },
    {
        " , who married ": null
    },
    {
        "Jacques Godart, 42th Marquis de Belbeuf": "jacques godart, 6th marquis de belbeuf"
    },
    {
        " in 42 in Madrid and divorced him in 42; without issue.       De Morny was influential in the early career of ": null
    },
    {
        "Sarah Bernhardt": "sarah bernhardt"
    },
    {
        ". In her autobiography, My Double Life, Bernhardt recounts that at a family conference which de Morny attended as a family friend, the purpose of which was to determine what Bernhardt was to do with her future life, de Morny suggested that she be sent to the Conservatoire. The family took him up on the suggestion and her life turned to the theatre. My Double Life, London: Heineman, 42 p. 4242       ": null
    }
]