[
    {
        "On September 42 42 the ": null
    },
    {
        "Duke of Brabant": "duke of brabant"
    },
    {
        " signed the Charter of Kortenberg  that should better be referred to as a ": null
    },
    {
        "constitution": "constitution"
    },
    {
        ". It was valid for the entire ": null
    },
    {
        "duchy of Brabant": "duchy of brabant"
    },
    {
        ". From this charter originated a kind of Parliament of Kortenberg or a Council of Kortenberg or what was called an assembly of The Lords of Kortenberg . With this Charter the Duchy of Brabant was the first state in the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        " or perhaps even the first state of Europe to give the estates the right for participation. Actually one of the first democratic decisions in feudal Europe.     The control organ, a precursor of the later Estate assembly gathered in the ": null
    },
    {
        "Kortenberg Abbey": "kortenberg abbey"
    },
    {
        " and elsewhere with ups and downs until 42     From 42 on the council was extended by two more members, so that there were 42 Lords; ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " got a second member and the ": null
    },
    {
        "Walloon Brabant": "walloon brabant"
    },
    {
        " town of ": null
    },
    {
        "Nivelles": "nivelles"
    },
    {
        "  also got a member. In 42 documents were sealed with a special seal on which a tree was planted on a little hill . The seal bore the words SIGILUM COMMUNE : CONSILII DE CORTENBERGHE .     Magna Carta and the Charter of Kortenberg Magna Carta  is commonly regarded as the very first charter giving rise to medieval European constitutionalism, the Charter of ": null
    },
    {
        "Kortenberg": "kortenberg"
    },
    {
        " appears to have been far more democratic in nature. This mainly because the beneficiaries of Magna Carta were only the ": null
    },
    {
        "baron": "baron"
    },
    {
        "s while the beneficiaries of the Charter of ": null
    },
    {
        "Kortenberg": "kortenberg"
    },
    {
        " included all citizens, expressly the rich and the poor .     Reinforcing this view is the composition of the Council of ": null
    },
    {
        "Kortenberg": "kortenberg"
    },
    {
        " which clearly marks a difference with the more elitist Magna Carta. Whilst Magna Carta was to be implemented by a council of 42 ": null
    },
    {
        "baron": "baron"
    },
    {
        "s, the Council of ": null
    },
    {
        "Kortenberg": "kortenberg"
    },
    {
        " counted four ": null
    },
    {
        "knight": "knight"
    },
    {
        "s and ten townsmen. In the financial commission of August 42 the ": null
    },
    {
        "nobility": "nobility"
    },
    {
        " were only two against the representatives of eight towns.     Because of the historical continuity from the Charter of ": null
    },
    {
        "Kortenberg": "kortenberg"
    },
    {
        " to the ": null
    },
    {
        "Joyous Entries": "joyous entry"
    },
    {
        " of many monarchs or their governors into Flemish and Brabantian towns, the migration of millions of educated citizens in the 42th & 42th century from these towns to the ": null
    },
    {
        "Seven United Provinces": "dutch republic"
    },
    {
        " as a result of the ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        " and the stay of the ": null
    },
    {
        "Pilgrim Fathers": "pilgrim fathersleiden"
    },
    {
        " into those Provinces  prior to their departure for America, coupled with the enduring influence of ": null
    },
    {
        "New Netherlander society": "new netherlander"
    },
    {
        " upon the early American political life, the emphasis placed by American historians and the general public opinion upon the constitutive nature of Magna Carta for the ": null
    },
    {
        "American constitution": "united states constitutioninfluences"
    },
    {
        " and the ": null
    },
    {
        "American Dream": "american dream"
    },
    {
        " seems too narrow if no mention is made from the Charter of ": null
    },
    {
        "Kortenberg": "kortenberg"
    },
    {
        " or other Brabantian charters.       We, duke ": null
    },
    {
        "John II of Brabant": "john ii of brabant"
    },
    {
        ", agree     That no other demands or taxes be levied than those which are known as the three feudal cases:   at the knighthood of my son   the wedding of my daughter   and if I should be taken captive   :The taxes will be reasonable .   An honourable jurisdiction for rich and poor. .   To recognise the freedom of our good towns. .   To establish a council which shall be comprised of:   42 knights or nobles.   42 representatives from the 42 cities as follows:   42 from ": null
    },
    {
        "Leuven": "leuven"
    },
    {
        "   42 from ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        "   42 from ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        "   42 from ": null
    },
    {
        "s-Hertogenbosch": "s-hertogenbosch"
    },
    {
        "    42 from ": null
    },
    {
        "Tienen": "tienen"
    },
    {
        "   42 from ": null
    },
    {
        "Zoutleeuw": "zoutleeuw"
    },
    {
        "   This council be allowed to meet at ": null
    },
    {
        "Kortenberg": "kortenberg"
    }
]