[
    {
        "      Charlie Dog, Charlie the Dog or Charles the Dog is an ": null
    },
    {
        "animated": "animation"
    },
    {
        " cartoon": "cartoon"
    },
    {
        " fictional character": "fictional character"
    },
    {
        " in the Warner Brothers ": null
    },
    {
        "Looney Tunes": "looney tunes"
    },
    {
        " series of cartoons.       ": null
    },
    {
        "Bob Clampett": "bob clampett"
    },
    {
        " minted the scenario that Charlie Dog would later inherit in his cartoon short  Porkys Pooch , first released on 42 December 42 A homeless hound pulls out all the stops to get adopted by bachelor ": null
    },
    {
        "Porky Pig": "porky pig"
    },
    {
        ". ": null
    },
    {
        "Mel Blanc": "mel blanc"
    },
    {
        " would provide the dogs gruff, ": null
    },
    {
        "Brooklyn": "brooklyn"
    },
    {
        "-": null
    },
    {
        "Bugs Bunny": "bugs bunny"
    },
    {
        "-like voice and accent which became Charlies standard voice.       As he did for so many other Looney Tunes characters, ": null
    },
    {
        "Chuck Jones": "chuck jones"
    },
    {
        " took Clampetts hound and transformed him into something new. Jones first used the dog in  Little Orphan Airedale  which saw Clampetts Rover renamed Charlie. The film was a success, and Jones would create two more Charlie Dog/Porky Pig cartoons in 42:  Awful Orphan  and  Often an Orphan  . Jones also starred Charlie without Porky in a couple of shorts:  Dog Gone South  which sees ": null
    },
    {
        "Yankee": "yankee"
    },
    {
        " Charlie searching for a fine gentleman of the ": null
    },
    {
        "Southern United States": "southern united states"
    },
    {
        ", and  A Hound for Trouble  which sends Charlie to ": null
    },
    {
        "Italy": "italy"
    },
    {
        " where he searches for a master who speaks ": null
    },
    {
        "English": "english language"
    },
    {
        ".     In these cartoons, Charlie Dog is defined by one desire: to find himself a master. To this end, Charlie is willing to pull out all the stops, from pulling the big soulful eyes routine to boasting of his pedigree ; when reminded by others that he is not a Labrador retriever, his response would be, Look, if you doubt my woid, get me a Labrador and Ill retrieve it for you. Dats fair, isnt it? & mdash; though in reality, he is just a slick-talking ": null
    },
    {
        "mutt": "mixed-breed dog"
    },
    {
        " who rarely realizes that his own aggressive obnoxiousness is sabotaging his appeal to any potential guardian.     Especially in the Porky Pig shorts, the pig would usually try to mail him out of the country, usually accompanied by Porky laughing evilly and maniacally, only to have Charlie return dressed in the costume of that place he was sent, which would make Porky even more determined to get rid of him.     Charlie makes a brief cameo appearance  in the ": null
    },
    {
        "Bob McKimson": "bob mckimson"
    },
    {
        "-directed short  Dog Tales  . Jones shelved the Charlie Dog series of films in the 42s, along with other characters he had introduced, such as ": null
    },
    {
        "The Three Bears": "the three bears"
    },
    {
        " and ": null
    },
    {
        "Hubie and Bertie": "hubie and bertie"
    },
    {
        ". He was turning his efforts to new characters, such as ": null
    },
    {
        "Pepé Le Pew": "pepé le pew"
    },
    {
        " and ": null
    },
    {
        "Wile E. Coyote and the Road Runner": "wile e. coyote and the road runner"
    },
    {
        ".     The ": null
    },
    {
        "Frisky Puppy": "frisky puppy"
    },
    {
        " character that Jones paired with ": null
    },
    {
        "Claude Cat": "claude cat"
    },
    {
        " in several 42s shorts bears a close physical resemblance to Charlie.       Recent Warner Brothers merchandising and series and films such as episodes of  Tiny Toon Adventures , and  Space Jam  in the crowd scenes ,  The Sylvester and Tweety Mysteries , and  Tweetys High-Flying Adventure  in Italy have brought Charlie back out of retirement.     Charlie Dog made a cameo in  The Looney Tunes Show  episode Father Figures. He was seen in a pet store where he was attacked by ": null
    },
    {
        "Henery Hawk": "henery hawk"
    },
    {
        " .                   ": null
    }
]