[
    {
        "      Charles I , commonly called Charles of Anjou, was a member of the royal ": null
    },
    {
        "Capetian dynasty": "capetian dynasty"
    },
    {
        " and the founder of the ": null
    },
    {
        "second House of Anjou": "capetian house of anjou"
    },
    {
        ". He was ": null
    },
    {
        "Count of Provence": "count of provence"
    },
    {
        " and ": null
    },
    {
        "Forcalquier": "county of forcalquier"
    },
    {
        " in the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", ": null
    },
    {
        "Count of Anjou": "count of anjou"
    },
    {
        " and ": null
    },
    {
        "Maine": "count of maine"
    },
    {
        " in France; he was also ": null
    },
    {
        "King of Sicily": "king of sicily"
    },
    {
        " and ": null
    },
    {
        "Prince of Achaea": "prince of achaea"
    },
    {
        " . In 42 he was proclaimed ": null
    },
    {
        "King of Albania": "king of albania"
    },
    {
        "; and in 42 he purchased a claim to the ": null
    },
    {
        "Kingdom of Jerusalem": "kingdom of jerusalem"
    },
    {
        ".     The youngest son of ": null
    },
    {
        "Louis VIII of France": "louis viii of france"
    },
    {
        " and ": null
    },
    {
        "Blanche of Castile": "blanche of castile"
    },
    {
        ", Charles was destined for a Church career until the early 42s. He acquired Provence and Forcalquier through his marriage to their heiress, ": null
    },
    {
        "Beatrice": "beatrice of provence"
    },
    {
        ". His attempts to secure comital rights brought him into conflict with his mother-in-law, ": null
    },
    {
        "Beatrice of Savoy": "beatrice of savoy"
    },
    {
        ", and the nobility. He received Anjou and Maine from his brother, ": null
    },
    {
        "Louis IX of France": "louis ix of france"
    },
    {
        ", in ": null
    },
    {
        "appanage": "appanage"
    },
    {
        ". He accompanied Louis during the ": null
    },
    {
        "Seventh Crusade": "seventh crusade"
    },
    {
        " to ": null
    },
    {
        "Egypt": "mamluk sultanate"
    },
    {
        ". Shortly after he returned to Provence in 42 Charles forced three wealthy ": null
    },
    {
        "free imperial cities": "free imperial city"
    },
    {
        "Marseilles": "marseilles"
    },
    {
        ", ": null
    },
    {
        "Arles": "arles"
    },
    {
        " and ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        "to acknowledge his suzerainty.     Charles supported ": null
    },
    {
        "Margaret II, Countess of Flanders and Hainaut": "margaret ii, countess of flanders and hainaut"
    },
    {
        ", against her eldest son, ": null
    },
    {
        "John": "john i, count of hainaut"
    },
    {
        ", in exchange for Hainaut in 42 Two years later Louis IX persuaded him to renounce the county, but compensated him by instructing Margaret to pay him 42 marks. Charles forced the rebellious Provençal nobles and towns into submission and expanded his suzerainty over a dozen towns and lordships in the ": null
    },
    {
        "Kingdom of Arles": "kingdom of arles"
    },
    {
        ". In 42 after years of negotiations, he accepted the offer of the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " to seize the ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        " from the ": null
    },
    {
        "Hohenstaufens": "hohenstaufens"
    },
    {
        ". This kingdom included, in addition to the island of ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ", southern Italy to well north of Naples and was known as the Regno. ": null
    },
    {
        "Pope Urban IV": "pope urban iv"
    },
    {
        " declared a crusade against the incumbent ": null
    },
    {
        "Manfred of Sicily": "manfred, king of sicily"
    },
    {
        " and assisted Charles to raise funds for the military campaign.     Charles was crowned king in Rome on 42 January 42 He ": null
    },
    {
        "annihilated Manfreds army": "battle of benevento"
    },
    {
        " and occupied the Regno almost without resistance. His victory over Manfreds young nephew, ": null
    },
    {
        "Conradin": "conradin"
    },
    {
        ", at the ": null
    },
    {
        "Battle of Tagliacozzo": "battle of tagliacozzo"
    },
    {
        " in 42 strengthened his rule. In 42 he took part in the ": null
    },
    {
        "Eighth Crusade": "eighth crusade"
    },
    {
        " and forced the ": null
    },
    {
        "Hafsid caliph of Tunis": "hafsid dynasty"
    },
    {
        " to pay a yearly tribute to him. Charless victories secured his undisputed leadership among the popes Italian partisans , but his influence on ": null
    },
    {
        "papal election": "papal election"
    },
    {
        "s and his strong military presence in Italy disturbed the popes. They tried to channel his ambitions towards other territories and assisted him in acquiring claims to Achaea, Jerusalem and Arles through treaties. In 42 ": null
    },
    {
        "Pope Martin IV": "pope martin iv"
    },
    {
        " authorised Charles to launch a crusade against the Byzantine Empire. Charles ships were gathering at ": null
    },
    {
        "Messina": "messina"
    },
    {
        ", ready to begin the campaign when a riotknown as the ": null
    },
    {
        "Sicilian Vespers": "sicilian vespers"
    },
    {
        "broke out on 42March 42 It put an end to Charles rule on the island of Sicily, but he was able to defend the mainland territories  with the support of France and the Holy See.             Charles was the youngest child of ": null
    },
    {
        "Louis VIII of France": "louis viii of france"
    },
    {
        " and ": null
    },
    {
        "Blanche of Castile": "blanche of castile"
    },
    {
        ". The date of his birth was not recorded, but he was probably a ": null
    },
    {
        "posthumous": "posthumous birth"
    },
    {
        " son, born in early 42 Historian Peter Herde notes that Charles may have also been identical with the first son of Louis VIII and Blanche born in 42 Stephen, or with the unnamed son who was born in late 42 If Charles was identical with Stephen, he must have changed his name before the late 42s.   Charles was Louiss only surviving son to be ": null
    },
    {
        "born in the purple": "born in the purple"
    },
    {
        " , a fact he often emphasised in his youth, according to ": null
    },
    {
        "Matthew Paris": "matthew paris"
    },
    {
        ". He was the first ": null
    },
    {
        "Capet": "capet"
    },
    {
        " to be named for ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        ".     Louis willed that his youngest sons were to be prepared for a career in the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ". The details of Charles tuition are unknown, but he received a good education. He understood the principal Catholic doctrines and could identify errors in Latin texts. His passion for poetry, medical sciences and law is well documented.     Charles said that their mother had a strong impact on her childrens education. In reality, Blanche was fully engaged in state administration, and could likely spare little time for her youngest children. Charles lived at the court of a brother, ": null
    },
    {
        "Robert I, Count of Artois": "robert i, count of artois"
    },
    {
        ", from 42 About four years later he was put into the care of his youngest brother, ": null
    },
    {
        "Alphonse, Count of Poitiers": "alphonse, count of poitiers"
    },
    {
        ". His participation in his brothers military campaign against ": null
    },
    {
        "Hugh X of Lusignan": "hugh x of lusignan"
    },
    {
        ", ": null
    },
    {
        "Count of La Marche": "count of la marche"
    },
    {
        ", in 42 showed that he was no longer destined for a Church career.              ": null
    },
    {
        "Raymond Berengar V of Provence": "ramon berenguer iv, count of provence"
    },
    {
        " died in August 42 bequeathing ": null
    },
    {
        "Provence": "county of provence"
    },
    {
        " and ": null
    },
    {
        "Forcalquier": "county of forcalquier"
    },
    {
        " to his youngest daughter, ": null
    },
    {
        "Beatrice": "beatrice of provence"
    },
    {
        ", allegedly because he had given generous ": null
    },
    {
        "dowries": "dowries"
    },
    {
        " to her three sisters. The dowries were actually not fully discharged, causing two of her sisters, ": null
    },
    {
        "Margaret": "margaret of provence"
    },
    {
        " and ": null
    },
    {
        "Eleanor": "eleanor of provence"
    },
    {
        " , to believe that they had been unlawfully disinherited. Their mother, ": null
    },
    {
        "Beatrice of Savoy": "beatrice of savoy"
    },
    {
        ", claimed that Raymond Berengar had willed the ": null
    },
    {
        "usufruct": "usufruct"
    },
    {
        " of Provence to her.     ": null
    },
    {
        "Emperor Frederick II": "frederick ii, holy roman emperor"
    },
    {
        ", ": null
    },
    {
        "Count Raymond VII of Toulouse": "count raymond vii of toulouse"
    },
    {
        " and other neighbouring rulers proposed themselves or their sons as husbands for the young countess. Her mother put her under the protection of the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        ". Louis IX and Margaret suggested that Beatrice should be given in marriage to Charles. To secure the support of France against Frederick II, ": null
    },
    {
        "Pope Innocent IV": "pope innocent iv"
    },
    {
        " accepted their proposal. Charles hurried to ": null
    },
    {
        "Aix-en-Provence": "aix-en-provence"
    },
    {
        " at the head of an army to prevent other suitors from attacking. He married Beatrice on 42January 42 Provence was a part of the ": null
    },
    {
        "Kingdom of Arles": "kingdom of arles"
    },
    {
        " and so of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", but Charles never swore fealty to the emperor. He ordered a survey of the counts rights and revenues, outraging both his subjects and his mother-in-law, who regarded this action as an attack against her rights.     Being a younger child, destined for a church career, Charles had not received an ": null
    },
    {
        "appanage": "appanage"
    },
    {
        " from his father. Louis VIII had willed that his fourth son, John, should receive ": null
    },
    {
        "Anjou": "county of anjou"
    },
    {
        " and ": null
    },
    {
        "Maine": "county of maine"
    },
    {
        " upon reaching the age of majority, but John died in 42 Louis IX knighted Charles at ": null
    },
    {
        "Melun": "melun"
    },
    {
        " in May 42 and three months later bestowed Anjou and Maine on him. Charles rarely visited his two counties and appointed ": null
    },
    {
        "bailli": "bailli"
    },
    {
        "es to administer them.     While Charles was absent from Provence, ": null
    },
    {
        "Marseilles": "marseilles"
    },
    {
        ", ": null
    },
    {
        "Arles": "arles"
    },
    {
        " and ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        "three wealthy cities, directly subject to the emperorformed a league and appointed a Provençal nobleman, ": null
    },
    {
        "Barral of Baux": "barral of baux"
    },
    {
        ", as the commander of their combined armies. Charles mother-in-law put the disobedient Provençals under her protection. Charles could not deal with the rebels as he was about to join his brothers crusade. To pacify his mother-in-law he acknowledged her right to rule Forcalquier and granted a third of his revenues from Provence to her.                   In December 42 Louis IX took a vow to lead a crusade. Ignoring their mothers strong opposition his three brothersRobert, Alphonse and Charlesalso took the cross. Preparations for the crusade lasted for years, with the crusaders embarking at ": null
    },
    {
        "Aigues-Mortes": "aigues-mortes"
    },
    {
        " on 42August 42 After spending several months in Cyprus they invaded ": null
    },
    {
        "Egypt": "egypt in the middle ages"
    },
    {
        " on 42June 42 They captured ": null
    },
    {
        "Damietta": "damietta"
    },
    {
        " and decided to attack ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " in November. During their advance ": null
    },
    {
        "Jean de Joinville": "jean de joinville"
    },
    {
        " noted Charles personal courage which saved dozens of crusaders lives. They were unable to reach Cairo because Egyptian troops surrounded them on 42April 42 Charles was captured along with his brothers. They were released in exchange of 42 bezants and the surrender of Damietta on 42May.     During their voyage to ": null
    },
    {
        "Acre": "acre"
    },
    {
        ", Charles outraged Louis by gambling while the king was mourning the recent death of their brother, Robert of Artois. Louis remained in the Holy Land, but Charles returned to France in October 42             During Charles absence rebellions had broken out in Provence. He applied both diplomacy and military force to deal with them. The ": null
    },
    {
        "Archbishop of Arles": "archbishop of arles"
    },
    {
        " and the ": null
    },
    {
        "Bishop of Digne": "bishop of digne"
    },
    {
        " ceded their secular rights in the two towns to Charles in 42 He received military assistance from his brother, Alphonse. Arles was the first town to surrender to them in April 42 In May they forced Avignon to acknowledge their joint rule. A month later Barral of Baux also capitulated. Marseilles was the only town to resist for several months, but it also sought peace in July 42 Its burghers acknowledged Charles as their lord, but retained their self-governing bodies.          Charles officials continued to ascertain his rights, visiting each town and holding public enquiries to obtain information about all claims. The counts salt monopoly  was introduced in the whole county. Income from the salt trade made up about 42% of comital revenues by the late 42s. Charles abolished local tolls and promoted shipbuilding and the cereal trade. He ordered the issue of new coins, called provencaux, to enable the use of the local currency in smaller transactions.          Emperor Frederick II, who was also the ruler of Sicily, died in 42 The ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        ", also known as the Regno, included the island of Sicily and southern Italy nearly as far as Rome. Pope Innocent IV claimed that the Regno had reverted to the Holy See. The pope first offered the Regno to ": null
    },
    {
        "Richard of Cornwall": "richard of cornwall"
    },
    {
        ", but Richard did not want to fight against Fredericks son, ": null
    },
    {
        "Conrad IV of Germany": "conrad iv of germany"
    },
    {
        ". Then the pope proposed to enfeoff Charles with the kingdom. Charles sought instructions from Louis IX who forbade him to accept the offer, because he regarded Conrad as the lawful ruler. After Charles informed the Holy See on 42October 42 that he would not accept the Regno, the pope offered it to ": null
    },
    {
        "Edmund of Lancaster": "edmund crouchback"
    },
    {
        ".     Queen Blanche, who had administered France during Louis crusade, died on 42December 42 Louis made Alphonse and Charles co-regents, so that he could remain in the Holy Land. ": null
    },
    {
        "Margaret II, Countess of Flanders and Hainaut": "margaret ii, countess of flanders"
    },
    {
        " had come into ": null
    },
    {
        "conflict with her son": "war of the flemish succession"
    },
    {
        " by her first marriage, ": null
    },
    {
        "John of Avesnes": "john i, count of hainaut"
    },
    {
        ". After her sons by her second marriage were captured in July 42 she needed foreign assistance to secure their release. Ignoring Louis IXs 42 ruling that Hainaut should pass to John, she promised the county to Charles. He accepted the offer and invaded Hainaut, forcing most local noblemen to swear fealty to him. After his return to France, Louis IX insisted that his ruling was to be respected. In November 42 he ordered Charles to restore Hainaut to Margaret, but her sons were obliged to swear fealty to Charles. Louis also ruled that she was to pay 42 marks to Charles during the following 42 years.     Charles returned to Provence, which had become restive again. His mother-in-law continued to support the rebellious ": null
    },
    {
        "Boniface of Castellane": "boniface of castellane"
    },
    {
        " and his allies, but Louis IX persuaded her to return Forcalquier to Charles and relinquish her claims for a lump sum payment from Charles and a pension from Louis in November 42 A coup by Charles supporters in Marseilles resulted in the surrender of all political powers there to his officials. Charles spent the next years expanding his power along the borders of Provence. He received territories in the Lower Alps from the ": null
    },
    {
        "Dauphin of Vienne": "dauphin of vienne"
    },
    {
        ". ": null
    },
    {
        "Raymond I of Baux": "raymond i of baux"
    },
    {
        ", ": null
    },
    {
        "Count of Orange": "count of orange"
    },
    {
        ", ceded the title of regent of the Kingdom of Arles to him. The burghers of ": null
    },
    {
        "Cuneo": "cuneo"
    },
    {
        "a town strategically located on the routes to Lombardysought Charles protection against ": null
    },
    {
        "Asti": "asti"
    },
    {
        " in July 42 ": null
    },
    {
        "Alba": "alba, piedmont"
    },
    {
        ", ": null
    },
    {
        "Cherasco": "cherasco"
    },
    {
        ", ": null
    },
    {
        "Savigliano": "savigliano"
    },
    {
        " and other nearby towns acknowledged his rule. The rulers of ": null
    },
    {
        "Mondovì": "mondovì"
    },
    {
        ", ": null
    },
    {
        "Ceva": "marquisate of ceva"
    },
    {
        ", ": null
    },
    {
        "Biandrate": "biandrate"
    },
    {
        " and ": null
    },
    {
        "Saluzzo": "marquisate of saluzzo"
    },
    {
        " did homage to him in 42     Emperor Frederick IIs illegitimate son, ": null
    },
    {
        "Manfred": "manfred of sicily"
    },
    {
        ", had been crowned king of Sicily in 42 After the English barons had announced that they opposed a war against Manfred, ": null
    },
    {
        "Pope Alexander IV": "pope alexander iv"
    },
    {
        " annulled the 42 grant of Sicily to Edmund of Lancaster. Alexanders successor, ": null
    },
    {
        "Pope Urban IV": "pope urban iv"
    },
    {
        ", was determined to put an end to the Emperors rule in Italy. He sent his notary, Albert of Parma, to Paris to negotiate with Louis IX for Charles to be placed on the Sicilian throne. Charles met with the Popes envoy in early 42     Taking advantage of Charles absence, Castellane stirred up a new revolt in Provence. The burghers of Marseilles expelled Charles officials, but Barral of Baux stopped the spread of the rebellion before Charles return. Charles renounced ": null
    },
    {
        "Ventimiglia": "ventimiglia"
    },
    {
        " in favour of ": null
    },
    {
        "Genoa": "republic of genoa"
    },
    {
        " to secure the neutrality of the republic. He defeated the rebels and forced Castellane into exile. The mediation of ": null
    },
    {
        "James I of Aragon": "james i of aragon"
    },
    {
        " brought about a settlement with Marseilles: its fortifications were dismantled and the townspeople surrendered their arms, but the town retained its autonomy.     Regno     Louis IX decided to support Charles military campaign in Italy in May 42 Pope Urban IV promised to proclaim a crusade against Manfred, while Charles pledged that he would not accept any offices in the Italian towns. Manfred staged a coup in Rome, but the ": null
    },
    {
        "Guelphs": "guelphs"
    },
    {
        " elected Charles ": null
    },
    {
        "senator": "summus senator"
    },
    {
        " . He accepted the office, at which a group of ": null
    },
    {
        "cardinals": "cardinal"
    },
    {
        " requested that the Pope revoke the agreement with him, but the Pope, being otherwise defenceless against Manfred, could not break with Charles.     In the spring of 42 Cardinals ": null
    },
    {
        "Simon of Brie": "pope martin iv"
    },
    {
        " and ": null
    },
    {
        "Guy Foulquois": "pope clement iv"
    },
    {
        " were sent to France to reach a compromise and start raising support for the crusade. Charles sent troops to Rome to protect the Pope against Manfreds allies. At Foulquois request, Charles sister-in-law Margaret pledged that she would not take actions against Charles during his absence. Foulquois also persuaded the French and Provençal prelates to offer financial support for the crusade. Pope Urban died before the final agreement was concluded. Charles made arrangements for his campaign against Sicily during the interregnum; he concluded agreements to secure his armys route across Lombardy and had the leaders of the Provençal rebels executed.     Foulquois was elected pope in February 42; he soon confirmed Charles senatorship and urged him to come to Rome. Charles agreed that he would hold the Kingdom of Sicily as the popes vassal for an annual tribute of 42 ounces of gold. He also promised that he would never seek the imperial title. He embarked at Marseilles on 42May and landed at ": null
    },
    {
        "Ostia": "ostia"
    },
    {
        " ten days later. He was installed as senator on 42June and four cardinals invested him with the Regno a week later. To finance further military actions he borrowed money from Italian bankers with the Popes assistance, who had authorised him to pledge Church property. Five cardinals crowned him king of Sicily on 42January 42 The crusaders from France and Provencereportedly 42 fully equipped mounted warriors, 42 mounted bowmen and 42 foot soldiersarrived in Rome ten days later.          Charles decided to invade the Regno without delay, because he was unable to finance a lengthy campaign. He left Rome on 42January 42 He marched towards ": null
    },
    {
        "Naples": "naples"
    },
    {
        ", but changed his strategy after learning of a muster of Manfreds forces near ": null
    },
    {
        "Capua": "capua"
    },
    {
        ". He led his troops across the ": null
    },
    {
        "Apennines": "apennine mountains"
    },
    {
        " towards ": null
    },
    {
        "Benevento": "benevento"
    },
    {
        ". Manfred also hurried to the town and reached it before Charles. Worried that further delays might endanger his subjects loyalty, Manfred attacked Charles army, then in disarray from the crossing of the hills, on 42February 42 In the ": null
    },
    {
        "ensuing battle": "battle of benevento"
    },
    {
        ", Manfreds army was defeated and he was killed.     Resistance throughout the Regno collapsed. All towns surrendered even before Charles troops reached them. The Saracens of ": null
    },
    {
        "Lucera": "lucera"
    },
    {
        "a ": null
    },
    {
        "Muslim colony established during Frederick IIs reign": "muslim settlement of lucera"
    },
    {
        "paid homage to him. His commander, Philip of Montfort, took control of the island of ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". Manfreds widow, ": null
    },
    {
        "Helena of Epirus": "helena angelina doukaina"
    },
    {
        ", and their children were captured. Charles laid claim to her dowrythe island of ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        " and the region of Durazzo by right of conquest. His troops seized Corfu before the end of the year.                   Charles was lenient with Manfreds supporters, but they did not believe that this conciliatory policy could last. They knew that he had promised to return estates to the Guelph lords expelled from the Regno. Neither could Charles gain the commoners loyalty, partly because he continued enforcing the  subventio generalis  despite the popes declaring it an illegal charge. He introduced a ban on the use of foreign currency in large transactions and made a profit of the compulsory exchange of foreign coinage for locally minted currency. He also traded in grain, spices and sugar, through a joint venture with Pisan merchants.     Pope Clement censured Charles for his methods of state administration, describing him as an arrogant and obstinate monarch. The consolidation of Charles power in northern Italy also alarmed Clement. To appease the pope, Charles resigned his senatorship in May. His successors, ": null
    },
    {
        "Conrad Monaldeschi": "conrad monaldeschi"
    },
    {
        " and ": null
    },
    {
        "Luca Savelli": "luca savelli"
    },
    {
        ", soon demanded the re-payment of the money that Charles and the Pope had borrowed from the Romans.     Victories by the ": null
    },
    {
        "Ghibellines": "ghibellines"
    },
    {
        ", the imperial familys supporters, forced the Pope to ask Charles to send his troops to ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        ". Charles troops ousted the Ghibellines from ": null
    },
    {
        "Florence": "florence"
    },
    {
        " in April. After being elected the ": null
    },
    {
        "Podestà": "podestà"
    },
    {
        " of Florence and ": null
    },
    {
        "Lucca": "lucca"
    },
    {
        " for seven years, Charles hurried to Tuscany. The Pope summoned him to ": null
    },
    {
        "Viterbo": "viterbo"
    },
    {
        ", forcing him to promise that he would abandon all claims to Tuscany in three years.     The Pope wanted to change the direction of Charles ambitions. He persuaded Charles to ": null
    },
    {
        "conclude agreements": "treaty of viterbo"
    },
    {
        " with ": null
    },
    {
        "William of Villehardouin": "william of villehardouin"
    },
    {
        ", ": null
    },
    {
        "Prince of Achaea": "prince of achaea"
    },
    {
        ", and the ": null
    },
    {
        "Latin Emperor": "latin emperor"
    },
    {
        " Baldwin II": "baldwin ii, latin emperor"
    },
    {
        " in late May. According to the first treaty, Villehardouin acknowledged Charles suzerainty and made Charles younger son, ": null
    },
    {
        "Philip": "philip of sicily"
    },
    {
        ", his heir, also stipulating that Charles would inherit Achaea if Philip died childless. Baldwin confirmed the first agreement and renounced his claims to suzerainty over his vassals in favour of Charles. Charles pledged that he would assist Baldwin in recapturing Constantinople from the Byzantine emperor, ": null
    },
    {
        "Michael VIII Palaiologos": "michael viii palaiologos"
    },
    {
        ", in exchange for one third of the conquered lands.     Charles returned to Tuscany and laid siege to the fortress of Poggibonsi, but it did not fall until the end of November. Manfreds staunchest supporters had meanwhile fled to Bavaria to attempt to persuade Conrad IVs 42-year-old son ": null
    },
    {
        "Conradin": "conradin"
    },
    {
        " to assert his hereditary right to the Regno. After Conradin accepted their proposal, Manfreds former vicar in Sicily, ": null
    },
    {
        "Conrad Capece": "conrad capece"
    },
    {
        ", returned to the island and stirred up a revolt. At Capeces request ": null
    },
    {
        "Muhammad I al-Mustansir": "muhammad i al-mustansir"
    },
    {
        ", the ": null
    },
    {
        "Hafsid caliph of Tunis": "hafsid dynasty"
    },
    {
        ", allowed Manfreds former ally, ": null
    },
    {
        "Frederick of Castile": "frederick of castile"
    },
    {
        ", to invade Sicily from North Africa. Fredericks brother, ": null
    },
    {
        "Henry": "henry of castile the senator"
    },
    {
        "who had been elected senator of Romealso offered support to Conradin. Henry had been Charles friend, but Charles had failed to repay a loan to him.          Conradin left Bavaria in September 42 His supporters revolt was spreading from Sicily to ": null
    },
    {
        "Calabria": "calabria"
    },
    {
        "; the Saracens of Lucera also rose up. Pope Clement urged Charles to return to the Regno, but he continued his campaign in Tuscany until March 42 when he met with the Pope who made him the Imperial Vicar of Lombardy. He marched to southern Italy and laid siege to Lucera, but he then had to hurry north to prevent Conradins invasion of ": null
    },
    {
        "Abruzzo": "abruzzo"
    },
    {
        " in late August. At the ": null
    },
    {
        "Battle of Tagliacozzo": "battle of tagliacozzo"
    },
    {
        ", on 42August 42 it appeared that Conradin had won the day, but a sudden charge by Charles reserve routed Conradins army.     The burghers of ": null
    },
    {
        "Potenza": "potenza"
    },
    {
        ", ": null
    },
    {
        "Aversa": "aversa"
    },
    {
        " and other towns in ": null
    },
    {
        "Basilicata": "basilicata"
    },
    {
        " and Apulia massacred their fellows who had agitated on Conradins behalf, but the Sicilians and the Saracens of Lucera did not surrender. Charles marched to Rome where he was again elected senator in September. He appointed new officials to administer justice and collect state revenues. New coins bearing his name were struck. During the following decade, Rome was ruled by Charles vicars, each appointed for one year.     Conradin was captured at ": null
    },
    {
        "Torre Astura": "torre astura"
    },
    {
        ". Most of his retainers were summarily executed, but Conradin and his friend, ": null
    },
    {
        "Frederick I, Margrave of Baden": "frederick i, margrave of baden"
    },
    {
        ", were brought to trial for robbery and treason in Naples. They were sentenced to death and beheaded on 42October. ": null
    },
    {
        "Conrad of Antioch": "conrad of antioch"
    },
    {
        " was Conradins only partisan to be released, but only after his wife threatened to execute the Guelph lords she held captive in her castle. The Ghibellin noblemen of the Regno fled to the court of ": null
    },
    {
        "Peter III of Aragon": "peter iii of aragon"
    },
    {
        ", who had married Manfreds daughter, ": null
    },
    {
        "Constance": "constance of sicily, queen of aragon"
    },
    {
        ".                          Charles wife, Beatrice of Provence, had died in July 42 The widowed Charles married ": null
    },
    {
        "Margaret of Nevers": "margaret of burgundy, queen of sicily"
    },
    {
        " in November 42 She was co-heiress to her father, ": null
    },
    {
        "Odo": "odo, count of nevers"
    },
    {
        ", the eldest son of ": null
    },
    {
        "Hugh IV, Duke of Burgundy": "hugh iv, duke of burgundy"
    },
    {
        ". Pope Clement died on 42November 42 The vacancy lasted for three years, which strengthened Charles authority in Italy, but it also deprived him of the ecclesiastic support that only a pope could provide.     Charles returned to Lucera to personally direct its siege in April 42 The Saracens and the Ghibellins who had escaped to the town resisted until starvation forced them to surrender in August 42 Charles sent Philip and ": null
    },
    {
        "Guy of Montfort": "guy de montfort, count of nola"
    },
    {
        " to Sicily to force the rebels there into submission, but they could only capture ": null
    },
    {
        "Augusta": "augusta, sicily"
    },
    {
        ". Charles made ": null
    },
    {
        "William lEstandart": "william lestandart"
    },
    {
        " the commander of the army in Sicily in August 42 LEstandart captured ": null
    },
    {
        "Agrigento": "agrigento"
    },
    {
        ", forcing Frederick of Castile and Frederick Lancia to seek refuge in Tunis. After LEstandarts subsequent victory at ": null
    },
    {
        "Sciacca": "sciacca"
    },
    {
        ", only Capece resisted, but he also had to surrender in early 42     Charles troops forced Siena and Pisathe last towns to resist him in Tuscanyto sue for peace in August 42 He granted privileges to the Tuscan merchants and bankers which strengthened their position in the Regno. His influence was declining in Lombardy, because the Lombard towns no longer feared an invasion from Germany. In May 42 Charles sent Walter of La Roche to represent him in the province, but this failed to strengthen his authority. In October Charles officials convoked an assembly at Cremona, and invited the Lombard towns to attend. The Lombard towns accepted the invitation, but some townsMilan, Bologna, Alessandria and Tortonaonly confirmed their alliance with Charles, without acknowledging his rule.              Louis IX never abandoned the idea of the liberation of Jerusalem, but he decided to begin his new crusade with a military campaign against Tunis. According to his confessor, ": null
    },
    {
        "Geoffrey of Beaulieu": "geoffrey of beaulieu"
    },
    {
        ", Louis was convinced that al-Mustansir of Tunis was ready to convert to Christianity. The 42th-century historian ": null
    },
    {
        "Saba Malaspina": "saba malaspina"
    },
    {
        " stated that Charles persuaded Louis to attack Tunis, because he wanted to secure the payment of the tribute that the rulers of Tunis had paid to the former Sicilian monarchs.     The French crusaders embarked at Aigues-Mortes on 42July 42; Charles departed from Naples six days later. He spent more than a month in Sicily, waiting for his fleet. By the time he landed at Tunis on 42August, ": null
    },
    {
        "dysentery": "dysentery"
    },
    {
        " and ": null
    },
    {
        "typhoid fever": "typhoid fever"
    },
    {
        " had decimated the French army. Louis died on the day of Charles arrival.     The crusaders twice defeated Al-Mustansirs army, forcing him to sue for peace. According to the peace treaty, signed on 42November, Al-Mustansir agreed to fully compensate Louis son and successor, ": null
    },
    {
        "Philip III of France": "philip iii of france"
    },
    {
        ", and Charles for the expenses of the military campaign and to release his Christian prisoners. He also promised to pay a yearly tribute to Charles and to expel Charles opponents from Tunis. The gold from Tunis, along with silver from the newly opened mine at ": null
    },
    {
        "Longobucco": "longobucco"
    },
    {
        ", enabled Charles to mint new coins, known as carlini, in the Regno.     Charles and Philip departed Tunis on 42November. A storm dispersed their fleet at ": null
    },
    {
        "Trapani": "trapani"
    },
    {
        " and most of Charles galleys were lost or damaged. Genoese ships returning from the crusade were also sunk or forced to land in Sicily. Charles seized the damaged ships and their cargo, ignoring all protests from the Ghibelline authorities of Genoa. Before leaving Sicily he granted temporary tax concessions to the Sicilians, because he realised that the conquest of the island had caused much destruction.         Charles accompanied Philip III as far as Viterbo in March 42 Here they failed to convince the cardinals to elect a new pope. Charles brother, Alphonse of Poitiers, fell ill. Charles sent his best doctors to cure him, but Alphonse died. He claimed the major part of Alphonse inheritance, including the ": null
    },
    {
        "Marquisate of Provence": "marquisate of provence"
    },
    {
        " and the ": null
    },
    {
        "County of Poitiers": "county of poitiers"
    },
    {
        ", because he was Alphonses ": null
    },
    {
        "nearest kin": "proximity of blood"
    },
    {
        ". After Philip III objected, he took the case to the ": null
    },
    {
        "Parlement": "parlement"
    },
    {
        " of Paris. In 42 the court ruled that appanages escheated to the French crown if their rulers died without descendants.          An earthquake destroyed the walls of Durazzo in the late 42s or early 42s. Charles troops took possession of the town with the assistance of the leaders of the nearby Albanian communities. Charles concluded an agreement with the Albanian chiefs, promising to protect them and their ancient liberties in February 42 He adopted the title of ": null
    },
    {
        "King of Albania": "king of albania"
    },
    {
        " and appointed ": null
    },
    {
        "Gazzo Chinardo": "gazzo chinardo"
    },
    {
        " as his vicar-general. He also sent his fleet to Achaea to defend the principality against Byzantine attacks.     Charles hurried to Rome to attend the enthronement of ": null
    },
    {
        "Pope Gregory X": "pope gregory x"
    },
    {
        " on 42March 42 The new pope was determined to put an end to the conflicts between the Guelphs and the Ghibellines. While in Rome Charles met with the Guelph leaders who had been exiled from Genoa. After they offered him the office of ": null
    },
    {
        "captain of the people": "capitano del popolo"
    },
    {
        ", Charles promised military assistance to them. In November 42 Charles commanded his officials to take prisoner all Genoese within his territories, except for the Guelphs, and to seize their property. His fleet occupied ": null
    },
    {
        "Ajaccio": "ajaccio"
    },
    {
        " in Corsica. Pope Gregory condemned his aggressive policy, but proposed that the Genoese should elect Guelph officials. Ignoring the popes proposal, the Genoese made alliance with Alfonso X of Castille, ": null
    },
    {
        "William VII of Montferrat": "william vii, marquess of montferrat"
    },
    {
        " and the Ghibelline towns of Lombardy in October 42     The conflict with Genoa prevented Charles from invading the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", but he continued to forge alliances in the Balkan Peninsula. The Bulgarian ruler, ": null
    },
    {
        "Konstantin Tih": "konstantin tih"
    },
    {
        ", was the first to conclude a treaty with him in 42 or 42 ": null
    },
    {
        "John I Doukas of Thessaly": "john i doukas of thessaly"
    },
    {
        " and ": null
    },
    {
        "Stefan Uroš I": "stefan uroš i"
    },
    {
        ", ": null
    },
    {
        "King of Serbia": "king of serbia"
    },
    {
        ", joined the coalition in 42 However, Pope Gregory forbade Charles to attack, because he hoped to unify the ": null
    },
    {
        "Orthodox": "eastern orthodox church"
    },
    {
        " and ": null
    },
    {
        "Catholic": "roman catholic church"
    },
    {
        " churches with the assistance of Emperor Michael VIII.     The renowned theologian ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        " died unexpectedly near Naples on 42March 42 before departing to attend the ": null
    },
    {
        "Second Council of Lyon": "second council of lyon"
    },
    {
        ". According to a popular legend, immortalised by Dante, Charles had him poisoned, because he feared that Aquinas would make complaint against him. Historian ": null
    },
    {
        "Steven Runciman": "steven runciman"
    },
    {
        " emphasises that there is no evidence for supposing that the great doctors death was not natural . Southern Italian churchmen at the council accused Charles of tyrannical acts. Their report reinforced the Popes attempt to reach a compromise with ": null
    },
    {
        "Rudolf of Habsburg": "rudolf i of germany"
    },
    {
        ", who had been elected king by the ": null
    },
    {
        "prince-elector": "prince-elector"
    },
    {
        "s of the Holy Roman Empire. In June, the Pope acknowledged Rudolf as the lawful ruler of both Germany and Italy. Charles sisters-in-law, Margaret and Eleanor, approached Rudolf, claiming that they had been unlawfully disinherited in favour of Charles late wife.     Michael VIIIs personal envoy announced at the Council of Lyon on 42July that he had accepted the ": null
    },
    {
        "Catholic creed": "filioque"
    },
    {
        " and ": null
    },
    {
        "papal primacy": "papal primacy"
    },
    {
        ". About three weeks later, Pope Gregory again prohibited Charles from launching military actions against the Byzantine Empire. The Pope also tried to mediate a truce between Charles and Michael, but the latter choose to attack the smaller states of the Balkans, including Charles vassals. The Byzantine fleet took control of the maritime routes between Albania and southern Italy in the late 42s. Gregory only allowed Charles to send reinforcements to Achaea. The organisation of a new crusade to the Holy Land remained the Popes principal object. He persuaded Charles to start negotiations with ": null
    },
    {
        "Maria of Antioch": "maria of antioch"
    },
    {
        " about purchasing her claim to the ": null
    },
    {
        "Kingdom of Jerusalem": "kingdom of jerusalem"
    },
    {
        ". The ": null
    },
    {
        "High Court of Jerusalem": "high court of jerusalem"
    },
    {
        " had already rejected her in favour of ": null
    },
    {
        "Hugh III of Cyprus": "hugh iii of cyprus"
    },
    {
        ", but the Pope had a low opinion of Hugh.     The war with Genoa and the Lombard towns increasingly occupied Charles attention. He appointed his nephew ": null
    },
    {
        "Robert II of Artois": "robert ii of artois"
    },
    {
        " as his deputy in Piedmont in October 42 but Artois could not prevent ": null
    },
    {
        "Vercelli": "vercelli"
    },
    {
        " and Alessandria from joining the Ghibelline League. The following summer, a Genoese fleet plundered Trapani and the island of ": null
    },
    {
        "Gozo": "gozo"
    },
    {
        ". Convinced that only Rudolf I could achieve a compromise between the Guelphs and Ghibellines, the Pope urged the Lombard towns to send envoys to him. He also urged Charles to renounce Tuscany. In the autumn of 42 the Ghibellines offered to make peace with Charles, but he did not accept their terms. Early the next year the Ghibellines defeated his troops at ": null
    },
    {
        "Col de Tende": "col de tende"
    },
    {
        ", forcing them to withdraw to Provence.              Pope Gregory X died on 42January 42 After the hostility he experienced during Gregorys pontificate, Charles was determined to secure the election of a pope willing to support his plans. Gregorys successor, ": null
    },
    {
        "Pope Innocent V": "pope innocent v"
    },
    {
        ", had always been Charles partisan and he rapidly confirmed Charles ranks of senator of Rome and imperial vicar of Tuscany. He also mediated a peace treaty between Charles and Genoa, which was signed in Rome on 42June 42 Charles restored the privileges of the Genoese merchants and renounced his conquests, and the Genoese acknowledged his rule in ": null
    },
    {
        "Ventimiglia": "ventimiglia"
    },
    {
        ".     Pope Innocent died on 42June 42 After the cardinals assembled in the ": null
    },
    {
        "Lateran Palace": "lateran palace"
    },
    {
        ", Charles troops surrounded it, enabling only his allies to communicate with other cardinals and with outsiders. On 42July the cardinals elected Charles old friend, ": null
    },
    {
        "Ottobuono de Fieschi": "ottobuono de fieschi"
    },
    {
        ", pope, but he died on 42August. The cardinals met again, this time at Viterbo. Although Charles was staying in the nearby Vetralla, he could not directly influence the election. ": null
    },
    {
        "Pope John XXI": "pope john xxi"
    },
    {
        ", who was elected on 42September, ": null
    },
    {
        "excommunicated": "excommunication"
    },
    {
        " Charles opponents in Piedmont and prohibited Rudolf from coming to Lombardy, but did not forbid the Lombardian Guelph leaders swearing fealty to Rudolf. The Pope also confirmed the treaty concluded by Charles and Maria of Antioch on 42March which transferred her claims to Jerusalem to Charles for 42  bezant s and a pension of 42  livres tournois .          Charles appointed ": null
    },
    {
        "Roger of San Severino": "roger of san severino"
    },
    {
        " to administer the Kingdom of Jerusalem as his ": null
    },
    {
        "bailiff": "bailiff of the kingdom of jerusalem"
    },
    {
        ". San Severino landed at Acre on 42June 42 Hugh IIIs bailliff, ": null
    },
    {
        "Balian of Arsuf": "balian of arsuf"
    },
    {
        ", surrendered the town without resistance. Although only the ": null
    },
    {
        "Knights Hospitaller": "knights hospitaller"
    },
    {
        " and the Venetians acknowledged Charles as the lawful ruler, the barons of the realm also paid homage to San Severino in January 42 after he had threatened to confiscate their estates. The ": null
    },
    {
        "Mamluks of Egypt": "mamluks of egypt"
    },
    {
        " had already confined the kingdom to a coastal strip covering  and Charles had ordered San Severino to avoid conflicts with Egypt.     Pope John died on 42May 42 Charles was ill and could not prevent the election of the head of the anti-French cardinals, Giovanni Gaetano Orsini , on 42November. The Pope soon declared that no foreign prince could rule in Rome and reminded Charles that he had been elected senator for ten years. Charles swore fealty to the new pope on 42May 42 after lengthy negotiations. He had to pledge that he would renounce both the senatorship of Rome and the vicariate of Tuscany in four months. On the other hand, Nicholas III confirmed the excommunication of Charles enemies in Piedmont and started negotiations with Rudolf to prevent him from making an alliance against Charles with Margaret of Provence and her nephew ": null
    },
    {
        "Edward I of England": "edward i of england"
    },
    {
        ".     Charles announced his resignation from the senatorship and the vicariate on 42August 42 He was succeeded by the Popes brother, ": null
    },
    {
        "Matteo Orsini": "matteo orsini"
    },
    {
        ", in Rome, and by the Popes nephew, Cardinal Latino Malabranca, in Tuscany. To ensure that Charles fully abandoned his ambitions in central Italy the Pope started negotiations with Rudolf about the restoration of the Kingdom of Arles for Charles grandson, ": null
    },
    {
        "Charles Martel": "charles martel of anjou"
    },
    {
        ". Margaret of Provence sharply opposed the plan, but Philip III of France did not stand by his mother. After lengthy negotiations, in the summer of 42 Rudolf recognised Charles as the lawful ruler of Provence without demanding his oath of fealty. An agreement about Charles Martels rule in Arles and his marriage to Rudolfs daughter, ": null
    },
    {
        "Clemence": "clemence of austria"
    },
    {
        ", was signed in May 42 The plan disturbed the rulers of the lands along the Upper Rhone, especially ": null
    },
    {
        "Duke Robert II": "robert ii, duke of burgundy"
    },
    {
        " and ": null
    },
    {
        "Count Otto IV of Burgundy": "count otto iv of burgundy"
    },
    {
        ".     Charles had meanwhile inherited the ": null
    },
    {
        "Principality of Achaea": "principality of achaea"
    },
    {
        " from William II of Villehardouin, who had died on 42May 42 He appointed the unpopular senechal of Sicily, ": null
    },
    {
        "Galeran of Ivry": "galeran of ivry"
    },
    {
        ", as his baillif in Achaea. Galeran could not pay his troops who started to pillage the peasants homes. ": null
    },
    {
        "John I de la Roche": "john i de la roche"
    },
    {
        ", ": null
    },
    {
        "Duke of Athens": "duke of athens"
    },
    {
        ", had to lend money to him to finance their salaries. ": null
    },
    {
        "Nicephoros I of Epirus": "nicephoros i of epirus"
    },
    {
        " acknowledged Charles suzerainty on 42March 42 to secure his assistance against the Byzantines. Nicephoros also ceded three towns": null
    },
    {
        "Butrinto": "butrinto"
    },
    {
        ", ": null
    },
    {
        "Sopotos": "sopotos"
    },
    {
        " and ": null
    },
    {
        "Panormos": "panormos"
    },
    {
        "to Charles.     Pope Nicholas died on 42August 42 Charles sent agents to Viterbo to promote the election of one of his supporters, taking advantage of the rift between the late popes relatives and other Italian cardinals. When a riot broke out in Viterbo, after the cardinals had not reached a decision for months, Charles troops took control of the town. On 42February 42 his staunchest supporter, Simon of Brie, was elected pope. Pope Martin IV dismissed his predecessors relatives and made Charles the senator of Rome again. ": null
    },
    {
        "Guido I da Montefeltro": "guido i da montefeltro"
    },
    {
        " rose up against the pope, but Charles troops under ": null
    },
    {
        "Jean dEppe": "jean deppe"
    },
    {
        " stopped the spread of the rebellion at ": null
    },
    {
        "Forlì": "forlì"
    },
    {
        ". Charles also sent an army to ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        ", but ": null
    },
    {
        "Thomas I, Marquess of Saluzzo": "thomas i, marquess of saluzzo"
    },
    {
        ", annihilated it at ": null
    },
    {
        "Borgo San Dalmazzo": "borgo san dalmazzo"
    },
    {
        " in May.         Pope Martin excommunicated Emperor Michael VIII on 42April 42 because the emperor had not imposed the Church union in his empire. The Pope soon authorised Charles to invade the empire. Charles vicar in Albania, ": null
    },
    {
        "Hugh of Sully": "hugh of sully"
    },
    {
        ", had already ": null
    },
    {
        "laid siege to the Byzantine fortress of Berat": "siege of berat"
    },
    {
        ". A Byzantine army of relief under ": null
    },
    {
        "Michael Tarchaneiotes": "michael tarchaneiotes"
    },
    {
        " and ": null
    },
    {
        "John Synadenos": "john synadenos"
    },
    {
        " arrived in March 42 Sully was ambushed and captured, his army put to flight and the interior of Albania was lost to the Byzantines. On 42July 42 Charles and his son-in-law, ": null
    },
    {
        "Philip of Courtenay": "philip i, latin emperor"
    },
    {
        ", the titular Latin emperor, made an alliance with ": null
    },
    {
        "Venice": "republic of venice"
    },
    {
        " for the restoration of the Roman Empire . They decided to start a full-scale campaign early the next year.     Margaret of Provence called Robert and Otto of Burgundy and other lords who held fiefs in the Kingdom of Arles to a meeting at ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        " in the autumn of 42 They were willing to unite their troops to prevent Charles army from taking possession of the kingdom, but Philip III of France strongly opposed his mothers plan and Edward I of England would not promise any assistance to them. Charles acknowledged that his wife held the ": null
    },
    {
        "County of Tonnerre": "county of tonnerre"
    },
    {
        " and her other inherited estates as a Burgundian fief, which appeased Robert of Burgundy. Charles ships started to assemble at Marseilles to sail up the Rhone in the spring of 42 Another fleet was gathering at Messina to start the crusade against the Byzantine Empire.                  Always in need of funds, Charles could not cancel the subventio generalis, although it was the most unpopular tax in the Regno. Instead he granted exemptions to individuals and communities, especially to the French and Provençal colonists, which increased the burden on those who did not enjoy such privileges. The yearly, or occasionally more frequent, obligatory exchange of the deniersthe coins almost exclusively used in local transactionswas also an important, and unpopular, source of revenue for the royal treasury. Charles took out enforced loans whenever he needed immediately a large sum of money for certain arduous and pressing business , as he explained in one of his decrees.     ": null
    },
    {
        "Purveyance": "purveyance"
    },
    {
        "s, the requisitioning of goods, increased the unpopularity of Charles government in the Regno. His subjects were forced to guard prisoners or lodge soldiers in their homes. The restoration of old fortresses, bridges and aqueducts and the building of new castles required the employment of craftsmen, although most of them were unwilling to participate in such lengthy projects. Thousands of people were forced to serve in the army in foreign lands, especially after 42 Trading in salt was declared a royal monopoly. In December 42 Charles again ordered the collection of the subventio generalis, requiring the payment of 42% of the customary amount.          Charles did not pay attention to the island of Sicily, although it had been the centre of resistance against him in 42 He transferred the capital from Palermo to Naples. He did not visit the island after 42 preventing Sicilians from directly informing him of their grievances. Sicilian noblemen were seldom employed as royal officials, although he often appointed their southern Italian peers to represent him in his other realms. Furthermore, having seized large estates on the island in the late 42s Charles almost exclusively employed French and Provençal clerics to administer the royal demesne.     Popular stories credited ": null
    },
    {
        "John of Procida": "john of procida"
    },
    {
        "Manfred of Sicilys former chancellorwith staging an international plot against Charles. Legend says that he visited Constantinople, Sicily and Viterbo in disguise in 42 and 42 to convince Michael VIII, the Sicilian barons and Pope Nicholas III to support a revolt. On the other hand, Michael VIII would later claim that he was Gods instrument in bringing freedom to the Sicilians in his memoirs. The emperors wealth enabled him to send money to the discontented Sicilian barons. Peter III of Aragon decided to lay claim to the Regno in late 42: he did not hide his disdain when he met with Charles son, ": null
    },
    {
        "Charles, Duke of Salerno": "charles ii of naples"
    },
    {
        ", in Toulouse in December 42 He began to assemble a fleet, ostensibly for another crusade to Tunis.     Rioting broke out in Sicily after a burgher of Palermo killed a drunken French soldier who had insulted his wife before the ": null
    },
    {
        "Church of the Holy Spirit": "church of the holy spirit, palermo"
    },
    {
        " on Easter Monday  of 42 When the soldiers comrades attacked the murderer, the mob turned against them and started to massacre all the French in the town. The riot, known since the 42th century as the ": null
    },
    {
        "Sicilian Vespers": "sicilian vespers"
    },
    {
        ", developed into an uprising and most of Charles officials were killed or forced to flee the island. Charles ordered the transfer of soldiers and ships from Achaea to Sicily, but could not stop the spread of the revolt to ": null
    },
    {
        "Calabria": "calabria"
    },
    {
        ". San Severino also had to return to Italy, accompanied by the major part of the garrison at Acre. ": null
    },
    {
        "Odo Poilechien": "odo poilechien"
    },
    {
        ", who succeeded him in Acre, had limited authority.     The burghers of the major Sicilian towns established ": null
    },
    {
        "communes": "medieval commune"
    },
    {
        " which sent delegates to Pope Martin, asking him to take them under the protection of the Holy See. Instead of accepting their offer, the pope excommunicated the rebels on 42May. Charles issued an edict on 42June, accusing his officials of having ignored his instructions on good administration, but he failed to promise fundamental changes. In July he sailed to Sicily and laid siege to Messina.         Peter III of Aragons envoy, William of Castelnou, started negotiations with the rebels leaders in Palermo. Realizing that they could not resist without foreign support, they acknowledged Peter and Constance as their king and queen. They appointed envoys to accompany Castelnou to ": null
    },
    {
        "Collo": "collo"
    },
    {
        " where the Aragonese fleet was assembling. After a short hesitation, Peter decided to intervene on the rebels behalf and sailed to Sicily. He was declared king of Sicily at Palermo on 42September. Thereafter two realms, each ruled by a monarch styled king of Sicily, coexisted for more than a century, with Charles and his successors ruling in southern Italy  while Peter and his descendants ruled the island of Sicily.     In the face of the Aragonese landing, Charles was compelled to withdraw from the island, but the Aragonese moved swiftly and destroyed part of his army and most of his baggage. Peter took control of the whole island and sent troops to Calabria, but they could not prevent Charles of Salerno from leading an army of 42 French knights to join his father at ": null
    },
    {
        "Reggio Calabria": "reggio calabria"
    },
    {
        ". Further French troops arrived under the command of Charles nephews, Robert II of Artois and ": null
    },
    {
        "Peter of Alençon": "peter i, count of alençon"
    },
    {
        ", in November. In the same month, the pope excommunicated Peter.     Neither Peter nor Charles could afford to wage a lengthy war. Charles made an astonishing proposal in late December 42 challenging Peter for a ": null
    },
    {
        "judicial duel": "judicial duel"
    },
    {
        ". Peter insisted that the war should be continued, but agreed that a battle between the two kings, each accompanied by 42 knights, should decide the possession of Sicily. They agreed that the duel should take place at ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        " on 42June 42 but they did not fix the hour. Charles appointed Charles of Salerno to administer the Regno during his absence. To secure the loyalty of the local lords in Achaea, he made one of their peers, ": null
    },
    {
        "Guy of Dramelay": "guy of dramelay"
    },
    {
        ", baillif. Pope Martin declared the war against the Sicilians a crusade on 42January 42 Charles met with the Pope in Viterbo on 42 March, but he ignored the Popes ban on his duel with Peter of Aragon. After visiting Provence and Paris in April, he left for Bordeaux to meet with Peter. The duel turned into a farce; the two kings each arriving at different times on the same day, declaring a victory over their absent opponent, and departing.     Skirmishes and raids continued to occur in southern Italy. Aragonese guerillas attacked ": null
    },
    {
        "Catona": "catona"
    },
    {
        " and killed Peter of Alençon in January 42; the Aragonese seized Reggio Calabria in February; and the Sicilian admiral, ": null
    },
    {
        "Roger of Lauria": "roger of lauria"
    },
    {
        ", annihilated a newly raised Provençal fleet at Malta in April. However, tensions arose between the Aragonese and the Sicilians and in May 42 one of the leaders of the anti-Angevin rebellion, Walter of Caltagirone, was executed for his secret correspondence with Charles agents. Pope Martin declared the war against Aragon ": null
    },
    {
        "a crusade": "aragonese crusade"
    },
    {
        " and conferred the kingdom upon Philip III of Frances son, ": null
    },
    {
        "Charles of Valois": "charles of valois"
    },
    {
        ", on 42February 42     Charles started to raise new troops and a fleet in Provence, and instructed his son, Charles of Salerno, to maintain a defensive posture until his return. Roger of Lauria based a small squadron on the island of ": null
    },
    {
        "Nisida": "nisida"
    },
    {
        " to blockade Naples in May 42 Charles of Salerno attempted to destroy the squadron, but most of his fleet was captured, and he himself was taken prisoner after ": null
    },
    {
        "a short, sharp fight": "battle of the gulf of naples"
    },
    {
        " on 42June. News of the reverse caused a riot in Naples, but the papal legate, Gerard of Parma, crushed it with the assistance of local noblemen. Charles learnt of the disaster when he landed at ": null
    },
    {
        "Gaeta": "gaeta"
    },
    {
        " on 42June. He was furious at Charles of Salerno and his disobedience. He allegedly stated that Who loses a fool loses nothing , referring to his sons capture.     Charles left Naples for Calabria on 42June 42 A huge armyreportedly 42 mounted warriors and 42 foot-soldiersaccompanied him as far as Reggio Calabria. He laid siege to the town by sea and land in late July. He tried to land in Sicily, but his forces were forced to withdraw. After Lauria landed troops near Reggio Calabria, Charles had to lift the siege and retreat from Calabria on 42August.              Charles went to ": null
    },
    {
        "Brindisi": "brindisi"
    },
    {
        " and made preparations for a campaign against Sicily in the new year. He dispatched orders to his officials for the collection of the subventio generalis. However, he fell seriously ill before moving to ": null
    },
    {
        "Foggia": "foggia"
    },
    {
        " on 42December. He made his last will on 42January 42 appointing Robert II of Artois regent for his grandson, Charles Martel, who was to rule his realms until Charles of Salerno was released. He died in the morning of 42January. He was buried in a marble sepulchre in Naples, but his heart was placed at the ": null
    },
    {
        "Couvent Saint-Jacques": "couvent des jacobins de la rue saint-jacques"
    },
    {
        " in Paris. His corpse was moved to a chapel of the newly built ": null
    },
    {
        "Naples Cathedral": "naples cathedral"
    },
    {
        " in 42                                          All records show that Charles was a faithful husband and a caring father. His first wife, Beatrice of Provence, gave birth to at least six children. According to contemporaneous gossips, she persuaded Charles to claim the Regno, because she wanted to wear a crown like his sisters. Before she died in July 42 she had willed the usufruct of Provence to Charles. ": null
    },
    {
        "Robert of Béthune": "robert iii, count of flanders"
    },
    {
        " in 42 but she died four years later. ": null
    },
    {
        "Beatrice": "beatrice of sicily, latin empress"
    },
    {
        ", her younger sister, married Philip, the titular Latin Emperor, in 42 ": null
    },
    {
        "Elisabeth": "elisabeth of sicily"
    },
    {
        ", Charles youngest daughter, was given in marriage to the future ": null
    },
    {
        "Ladislaus IV of Hungary": "ladislaus iv of hungary"
    },
    {
        " in 42 but Ladislaus preferred his mistresses to her. ": null
    },
    {
        "Principality of Salerno": "principality of salerno"
    },
    {
        " in 42 ": null
    },
    {
        "Charles the Lame": "charles ii, king of naples"
    },
    {
        " and his wife, ": null
    },
    {
        "Maria of Hungary": "mary of hungary, queen of naples"
    },
    {
        ", had fourteen children, which secured the survival of the ": null
    },
    {
        "Capetian House of Anjou": "capetian house of anjou"
    },
    {
        ". ": null
    },
    {
        "Philip": "philip of sicily"
    },
    {
        ", Charles and Beatrices next son, was elected ": null
    },
    {
        "king of Sardinia": "king of sardinia"
    },
    {
        " by the local Guelphs in 42 but without the popes consent. He died childless in 42      The widowed Charles first proposed himself to ": null
    },
    {
        "Margaret of Hungary": "margaret of hungary"
    },
    {
        ". However, Margaret, who had been brought up in a Dominican nunnery, did not want to marry. According to legends, she disfigured herself to prevent the marriage. Charles and his second wife, Margaret of Nevers, had children who did not survive to adulthood.         The works of ": null
    },
    {
        "Bartholomaeus of Neocastro": "bartholomaeus of neocastro"
    },
    {
        " and Saba Malaspina strongly influenced modern views about Charles, although they were biased. The former described Charles as a tyrant to justify the Sicilian Vespers, the latter argued for the cancellation of the crusade against Aragon in 42 Charles had continued his imperial predecessors policies in several fields, including coinage, taxation, and the employment of unpopular officials from ": null
    },
    {
        "Amalfi": "amalfi"
    },
    {
        ". Nevertheless, the monarchy underwent a Frenchification or Provençalistion during his reign. He donated estates in the Regno to about 42 noblemen from France or Provence. He did not adopt the rich ceremonial robes, inspired by Byzantine and Islamic art, of earlier Sicilian kings, but dressed like other western European monarchs, or as a simple knight , as it was observed by ": null
    },
    {
        "Thomas Tuscus": "thomas tuscus"
    },
    {
        " in 42          Around 42 ": null
    },
    {
        "Giovanni Villani": "giovanni villani"
    },
    {
        " stated that Charles had been the most powerful Christian monarch in the late 42s. ": null
    },
    {
        "Luchetto Gattilusio": "luchetto gattilusio"
    },
    {
        " compared Charles directly with Charlemagne. Both reports demonstrate that Charles was regarded almost as an emperor. Among modern historians, Runciman says that Charles tried to build an empire in the eastern Mediterraneum; ": null
    },
    {
        "Gérard Sivéry": "gérard sivéry"
    },
    {
        " writes that he wanted to dominate the west; and ": null
    },
    {
        "Jean Dunbabin": "jean dunbabin"
    },
    {
        " argues that his agglomeration of lands was in the process of forming an empire .     Historian Hiroshi Takayama concludes that Charles dominion was too large to control . Nevertheless, economic links among his realms strengthened during his reign. Provençal salt was transported to his other lands, grain from the Regno was sold in Achaea, Albania, Acre and Tuscany, and Tuscan merchants settled in Anjou, Maine, Sicily and Naples. His highest-ranking officials were transferred from their homelands to represent him in other territories: his senechals in Provence were from Anjou; French and Provençal noblemen held the highest offices in the Regno; and he chose his vicars in Rome from among southern Italian and Provençal nobles. Although his empire collapsed before his death, his son retained southern Italy and Provence.     Charles always emphasised his royal rank, but did not adopt imperial rhetoric . His renowned justiciar, ": null
    },
    {
        "Marino de Caramanico": "marino de caramanico"
    },
    {
        ", developed a new political theory, which denied the emperors monopoly on law-making and emphasised Charles full competence to issue decrees. To promote legal education Charles paid high salaries42–42 ounces of gold in a yearto masters of law at the ": null
    },
    {
        "University of Naples": "university of naples federico ii"
    },
    {
        ". Masters of medicine received similar remunerations, and the university became a principal centre of medical science. Charles personal interest in medicine grew during his life and he borrowed Arabic medical texts from the rulers of Tunis to have them translated. He employed at least one Jewish scholar, Moses of Palermo, who could translate texts from Arabic to Latin. ": null
    },
    {
        "Muhammad ibn Zakariya al-Razi": "muhammad ibn zakariya al-razi"
    },
    {
        "s medical encyclopaedia, known as  Kitab al-Hawi , was one of the books translated at his order.     Charles was also a poet, which distinguished him from his Capetian relatives. He composed lovesongs and a  partimen  . He was requested to judge at two poetic competitions in his youth, but modern scholars do not esteem his poetry. The Provençal troubadours were mostly critical when writing of Charles, but French poets were willing to praise him. ": null
    },
    {
        "Bertran dAlamanon": "bertran dalamanon"
    },
    {
        " wrote a poem against the salt tax and ": null
    },
    {
        "Raimon de Tors de Marseilha": "raimon de tors de marseilha"
    },
    {
        " rebuked Charles for invading the Regno. ": null
    },
    {
        "Adam de la Halle": "adam de la halle"
    },
    {
        " dedicated an unfinished epic poem to Charles and ": null
    },
    {
        "Jean de Meun": "jean de meun"
    },
    {
        " glorified his victories. Dante described Charles who bears a manly nose singing peacefully together with his one-time rival, Peter III of Aragon, in ": null
    },
    {
        "Purgatory": "purgatory"
    },
    {
        ".     Charles also showed interest in architecture. He designed a tower in Brindisi, but it soon collapsed. He ordered the erection of the ": null
    },
    {
        "Castel Nuovo": "castel nuovo"
    },
    {
        " in Naples, of which only the palatine chapel survives. He is also credited with the introduction of French-style glassed windows in southern Italy.       ": null
    }
]