[
    {
        "      Charles Edward Coughlin  was a Canadian-American ": null
    },
    {
        "Roman Catholic priest": "roman catholic priest"
    },
    {
        " based in the United States near ": null
    },
    {
        "Detroit": "detroit"
    },
    {
        ". He was the founding priest of the ": null
    },
    {
        "National Shrine of the Little Flower": "national shrine of the little flower"
    },
    {
        " church. Commonly known as Father Coughlin, he was one of the first political leaders to use ": null
    },
    {
        "radio": "radio broadcasting"
    },
    {
        " to reach a mass audience: during the 42s, an estimated 42 million listeners tuned to his weekly broadcasts. He was forced off the air in 42 because of his pro-fascist and ": null
    },
    {
        "anti-Semitic": "antisemitism"
    },
    {
        " rhetoric.     Initially, Coughlin was a vocal supporter of ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " and his ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        ", but became a harsh critic of Roosevelt, accusing him of being too friendly to bankers. In 42 he established a political organization called the ": null
    },
    {
        "National Union for Social Justice": "national union for social justice"
    },
    {
        ". Its platform called for monetary reforms, nationalization of major industries and railroads, and protection of labor rights. The membership ran into the millions, but it was not well organized locally.     After hinting at attacks on Jewish bankers, Coughlin began to use his radio program to broadcast antisemitic commentary. In the late 42s, he supported some of the ": null
    },
    {
        "fascist": "fascism"
    },
    {
        " policies of ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ", ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        ", and ": null
    },
    {
        "Emperor Hirohito": "emperor hirohito"
    },
    {
        " of Japan. The broadcasts have been described as a variation of the Fascist agenda applied to American culture . His chief topics were political and economic rather than religious, using the slogan ": null
    },
    {
        "Social Justice": "social justice"
    },
    {
        " . Many American bishops, as well as the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        ", wanted him silenced. After the outbreak of ": null
    },
    {
        "World War II in Europe": "world war ii in europe"
    },
    {
        " in 42 the Roosevelt administration finally forced the cancellation of his radio program and forbade distribution by mail of his newspaper,  Social Justice .       Coughlin was born in ": null
    },
    {
        "Hamilton, Ontario": "hamilton, ontario"
    },
    {
        ", to ": null
    },
    {
        "Irish Catholic": "irish catholic"
    },
    {
        " parents, Amelia and Thomas J. Coughlin. After his basic education, he attended ": null
    },
    {
        "St. Michaels College": "st. michaels college, toronto"
    },
    {
        " in Toronto in 42 run by the ": null
    },
    {
        "Congregation of St. Basil": "congregation of st. basil"
    },
    {
        ", a society of priests dedicated to education. After graduation, Coughlin entered the Basilian Fathers. He prepared for ": null
    },
    {
        "holy orders": "holy orders"
    },
    {
        " at St. Basils Seminary, and was ordained to the priesthood in Toronto in 42 He was assigned to teach at ": null
    },
    {
        "Assumption College": "assumption university"
    },
    {
        ", also operated by the Basilians, in ": null
    },
    {
        "Windsor, Ontario": "windsor, ontario"
    },
    {
        ".     In 42 a reorganization of Coughlins religious order resulted in his departure. The ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " required the Basilians to change the congregational structure from a ": null
    },
    {
        "society of common life": "society of apostolic life"
    },
    {
        " patterned after the ": null
    },
    {
        "Society of Priests of Saint Sulpice": "society of priests of saint sulpice"
    },
    {
        ", to a more ": null
    },
    {
        "monastic life": "monastic life"
    },
    {
        ". They had to take the traditional three ": null
    },
    {
        "religious vows": "religious vows"
    },
    {
        " of chastity, poverty, and obedience. Coughlin could not accept this.     Leaving the congregation, Coughlin moved across the ": null
    },
    {
        "Detroit River": "detroit river"
    },
    {
        " to the United States, settling in the booming industrial city of ": null
    },
    {
        "Detroit": "detroit"
    },
    {
        ", ": null
    },
    {
        "Michigan": "michigan"
    },
    {
        ", where the automotive industry was expanding rapidly. He was ": null
    },
    {
        "incardinated": "incardination and excardination"
    },
    {
        " by the ": null
    },
    {
        "Roman Catholic Archdiocese of Detroit": "roman catholic archdiocese of detroit"
    },
    {
        " in 42 After being transferred several times to different ": null
    },
    {
        "parish": "parish"
    },
    {
        "es, in 42 he was assigned to the newly founded ": null
    },
    {
        "Shrine of the Little Flower": "national shrine of the little flower"
    },
    {
        ", a congregation of some 42 Catholic families among the largely Protestant suburban community of ": null
    },
    {
        "Royal Oak, Michigan": "royal oak, michigan"
    },
    {
        ". His powerful preaching soon expanded the parish congregation.       In 42 Coughlin began broadcasting on radio station ": null
    },
    {
        "WJR": "wjr"
    },
    {
        ", in response to ": null
    },
    {
        "cross burning": "cross burning"
    },
    {
        "s by the ": null
    },
    {
        "Ku Klux Klan": "ku klux klan"
    },
    {
        " on the grounds of his church. The KKK was near the peak of its membership and power in Detroit. This second manifestation of the KKK, which developed chapters in cities and towns throughout the North and West as well as in its Southern origins, was also strongly anti-Catholic and anti-immigrant. In response, Coughlins weekly hour-long radio program denounced the KKK, appealing to his ": null
    },
    {
        "Irish Catholic": "irish catholic"
    },
    {
        " audience.     When WJR was acquired by ": null
    },
    {
        "Goodwill Stations": "goodwill stations"
    },
    {
        " in 42 owner George A. Richards encouraged Coughlin to focus on politics instead of religious topics. Becoming increasingly vehement, the broadcasts attacked the banking system and Jews. Coughlins program was picked up by ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " in 42 for national broadcast.      A number of studies of early broadcasting, and of Coughlin in particular, Michael Casey and Aimee Rowe. Driving Out the Money Changers: Radio Priest Charles E. Coughlins Rhetorical Vision. Journal of Communication & Religion 42 . Ronald H. Carpenter, Father Charles E. Coughlin, Style in Discourse and Opinion Leadership, in Thomas W. Benson, ed., American Rhetoric in the New Deal Era, 4242 pp 4242 have drawn parallels between the radio priests strident attacks on his opponents and the style and content of much of late 42th-century ": null
    },
    {
        "talk radio": "talk radio"
    },
    {
        ". Jack Kay, George W. Ziegelmueller, and Kevin M. Minch. From Coughlin to contemporary talk radio: Fallacies & propaganda in American populist radio, Journal of Radio Studies 42 : 4242       In January 42 Coughlin began a series of attacks against ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " and ": null
    },
    {
        "Soviet Communism": "ideology of the communist party of the soviet union"
    },
    {
        ", which was strongly opposed by the Catholic Church. He criticized capitalists in America whose greed had made communist ideology attractive. He warned: Let not the workingman be able to say that he is driven into the ranks of socialism by the inordinate and grasping greed of the manufacturer.  Having gained a reputation as an outspoken ": null
    },
    {
        "anti-communist": "anti-communist"
    },
    {
        ", in July 42 Coughlin was given star billing as a witness before the ": null
    },
    {
        "House Un-American Activities Committee": "house un-american activities committee"
    },
    {
        ".      In 42 the CBS radio network dropped Coughlins program when he refused to accept network demands to review his scripts prior to broadcast. He raised independent money to fund his own national network, which soon reached millions of listeners through a 42-station syndicate originating from ": null
    },
    {
        "flagship station": "flagship"
    },
    {
        " WJR, for the Golden Hour of the Shrine of the Little Flower, as the program was called.     Throughout the 42s, Coughlins views changed significantly. Eventually he was openly antidemocratic, according to Steven Levitsky and Daniel Ziblatt, calling for the abolition of political parties and questioning the value of elections.        Against the deepening crisis of the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ", Coughlin strongly endorsed ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " during the ": null
    },
    {
        "42 Presidential election": "1932 united states presidential election"
    },
    {
        ". He was an early supporter of Roosevelts ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        " reforms and coined the phrase Roosevelt or Ruin , which entered common usage during the early days of the first FDR administration. Another phrase he became known for was The New Deal is Christs Deal.  In January 42 Coughlin testified before Congress in support of FDRs policies, saying, If Congress fails to back up the President in his monetary program, I predict a revolution in this country which will make the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " look silly! He also said to the Congressional hearing, God is directing President Roosevelt.        Coughlins support for Roosevelt and his New Deal faded in 42 when he founded the ": null
    },
    {
        "National Union for Social Justice": "national union for social justice"
    },
    {
        " , a nationalistic workers rights organization. Its leaders grew impatient with what they considered the Presidents unconstitutional and pseudo-capitalistic monetary policies. Coughlin preached increasingly about the negative influence of money changers and permitting a group of private citizens to create money at the expense of the general welfare. He spoke of the need for ": null
    },
    {
        "monetary reform": "monetary reform"
    },
    {
        " based on ": null
    },
    {
        "free silver": "free silver"
    },
    {
        " . Coughlin claimed that the ": null
    },
    {
        "Great Depression in the United States": "great depression in the united states"
    },
    {
        " was a cash famine and proposed monetary reforms, including the nationalization of the ": null
    },
    {
        "Federal Reserve System": "federal reserve system"
    },
    {
        ", as the solution.       Among NUSJs articles of faith were work and income guarantees, nationalizing vital industry, wealth redistribution through taxation of the wealthy, federal protection of workers unions, and limiting property rights in favor of government control of the countrys assets for public good. Principles of the National Union for Social Justice , quoted in .     Illustrative of Coughlins disdain for ": null
    },
    {
        "free market": "free market"
    },
    {
        " capitalism is his statement:            By 42 Coughlin was perhaps the most prominent Roman Catholic speaker on political and financial issues, with a radio audience that reached tens of millions of people every week. Alan Brinkley wrote that by 42 he was receiving more than 42 letters every day and that his clerical staff at times numbered more than a hundred . He foreshadowed modern talk radio and ": null
    },
    {
        "televangelism": "televangelism"
    },
    {
        ". In 42 when Coughlin began criticizing the New Deal, Roosevelt sent ": null
    },
    {
        "Joseph P. Kennedy, Sr.": "joseph p. kennedy, sr."
    },
    {
        " and ": null
    },
    {
        "Frank Murphy": "frank murphy"
    },
    {
        ", both prominent Irish Catholics, to try to influence him. Kennedy was reported to be a friend of Coughlin.   Coughlin periodically visited Roosevelt while accompanied by Kennedy.  In an August 42 42  Boston Post  article, Coughlin referred to Kennedy as the shining star among the dim knights in the Administration.      Increasingly opposed to Roosevelt, Coughlin began denouncing the President as a tool of ": null
    },
    {
        "Wall Street": "wall street"
    },
    {
        ". The priest supported populist ": null
    },
    {
        "Huey Long": "huey long"
    },
    {
        " as governor of Louisiana until Long was assassinated in 42 He supported ": null
    },
    {
        "William Lemke": "william lemke"
    },
    {
        "s ": null
    },
    {
        "Union Party": "union party"
    },
    {
        " in 42 Coughlin opposed the New Deal with growing vehemence. His radio talks attacked Roosevelt, capitalists, and alleged the existence of Jewish conspirators. Another nationally known priest, ": null
    },
    {
        "Monsignor": "monsignor"
    },
    {
        " John A. Ryan": "john a. ryan"
    },
    {
        ", initially supported Coughlin, but opposed him after Coughlin turned on Roosevelt. Joseph Kennedy, who strongly supported the New Deal, warned as early as 42 that Coughlin was becoming a very dangerous proposition as an opponent of Roosevelt and an out and out demagogue . Kennedy worked with Roosevelt, Bishop ": null
    },
    {
        "Francis Spellman": "francis spellman"
    },
    {
        ", and Cardinal Eugenio Pacelli  in a successful effort to get the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        " to silence Coughlin in 42 In 42–42 reversing his own views, Kennedy attacked the ": null
    },
    {
        "isolationism": "isolationism"
    },
    {
        " of Coughlin.     In 42 Coughlin proclaimed, I have dedicated my life to fight against the heinous rottenness of modern capitalism because it robs the laborer of this worlds goods. But blow for blow I shall strike against Communism, because it robs us of the next worlds happiness.  He accused Roosevelt of leaning toward international socialism on the ": null
    },
    {
        "Spanish question": "spanish civil war"
    },
    {
        " . Coughlins NUSJ gained a strong following among ": null
    },
    {
        "nativists": "nativism"
    },
    {
        " and opponents of the Federal Reserve, especially in the ": null
    },
    {
        "Midwest": "midwestern united states"
    },
    {
        ". ": null
    },
    {
        "Michael Kazin": "michael kazin"
    },
    {
        " has written that Coughlinites saw Wall Street and Communism as twin faces of a secular Satan. They believed that they were defending those people who were joined more by piety, economic frustration, and a common dread of powerful, modernizing enemies than through any ": null
    },
    {
        "class": "social class"
    },
    {
        " identity.     One of Coughlins campaign slogans was: Less care for internationalism and more concern for national prosperity , which appealed to the 42s ": null
    },
    {
        "isolationists in the United States": "united states non-interventionism"
    },
    {
        ". Coughlins organization especially appealed to Irish Catholics.       After the 42 election, Coughlin expressed overt sympathy for the ": null
    },
    {
        "fascist": "fascism"
    },
    {
        " governments of ": null
    },
    {
        "Hitler": "adolf hitler"
    },
    {
        " and ": null
    },
    {
        "Mussolini": "benito mussolini"
    },
    {
        " as an antidote to ": null
    },
    {
        "Communism": "communism"
    },
    {
        ". According to him, Jewish bankers were behind the ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        "; he backed the ": null
    },
    {
        "Jewish Bolshevism": "jewish bolshevism"
    },
    {
        " conspiracy theory.        Coughlin promoted his controversial beliefs by means of his radio broadcasts and his weekly ": null
    },
    {
        "rotogravure": "rotogravure"
    },
    {
        " magazine,  Social Justice , which began publication in March 42 During the last half of 42 Social Justice reprinted in weekly installments the fraudulent, ": null
    },
    {
        "antisemitic": "antisemitism"
    },
    {
        " text  The Protocols of the Elders of Zion . The Protocols was a Russian forgery that purports to expose a Jewish conspiracy to seize control of the world.     On various occasions, Coughlin denied that he was antisemitic. In February 42 when the American Nazi organization the ": null
    },
    {
        "German American Bund": "german american bund"
    },
    {
        " held a large rally in New York City, Coughlin, in his weekly radio address, immediately distanced himself from the organization and said: Nothing can be gained by linking ourselves with any organization which is engaged in agitating racial animosities or propagating racial hatreds. Organizations which stand upon such platforms are immoral and their policies are only negative.      In August of that same year, in an interview with Edward Doherty of the weekly magazine  Liberty , Coughlin said:               On November 42 42 two weeks after ": null
    },
    {
        "Kristallnacht": "kristallnacht"
    },
    {
        " , Coughlin, referring to the millions of Christians killed by the Communists in Russia, said Jewish persecution only followed after Christians first were persecuted.  After this speech, some radio stations, including those in New York City and Chicago, began refusing to air Coughlins speeches without subjecting his scripts to prior review and approval. In New York City, his programs were cancelled by ": null
    },
    {
        "WINS": "wins"
    },
    {
        " and ": null
    },
    {
        "WMCA": "wmca"
    },
    {
        ", and Coughlin broadcast only on the ": null
    },
    {
        "Newark": "newark, new jersey"
    },
    {
        " part-time station WHBI.  On December 42 42 thousands of Coughlins followers picketed the studios of station WMCA in New York City to protest the stations refusal to carry the priests broadcasts. A number of protesters yelled anti-semitic statements, such as Send Jews back where they came from in leaky boats! and Wait until Hitler comes over here! The protests continued for several months. Historian Donald Warren, using information from the ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        " and German government archives, has documented that Coughlin received indirect funding from Nazi Germany during this period.     After 42 Coughlin began supporting an organization called the ": null
    },
    {
        "Christian Front": "christian front"
    },
    {
        ", which claimed him as an inspiration. In January 42 a New York City unit of the Christian Front was raided by the FBI for plotting to overthrow the government. Coughlin had never been a member.      In March 42 The Radio League of the Little Flower, creators of Social Justice magazine, self-published a book titled An Answer to Father Coughlins Critics.   Written by Father Coughlins Friends, the book was an attempt to deal with those matters which relate directly to the main charges registered against Father Coughlin… to his being a pro-Nazi, anti-Semite, a falsifier of documents, etc. .       At its peak in the early-to-mid 42s, Coughlins radio show was phenomenally popular. His office received up to 42 letters per week from listeners. Author Sheldon Marcus said that the size of Coughlins radio audience is impossible to determine, but estimates range up to 42 million each week.  He expressed an isolationist, and conspiratorial, viewpoint that resonated with many listeners.     Some members of the Catholic hierarchy may not have approved of Coughlin. ": null
    },
    {
        "The Vatican": "holy see"
    },
    {
        ", the ": null
    },
    {
        "Apostolic Nunciature to the United States": "apostolic nunciature to the united states"
    },
    {
        ", and the ": null
    },
    {
        "Roman Catholic Archdiocese of Cincinnati": "roman catholic archdiocese of cincinnati"
    },
    {
        " all wanted him silenced. They recognized that only Coughlins superior, Bishop ": null
    },
    {
        "Michael Gallagher": "michael gallagher"
    },
    {
        " of Detroit, had the canonical authority to curb him, but Gallagher supported the Radio Priest .  Owing to Gallaghers autonomy, and the prospect of the Coughlin problem leading to a schism, the Roman Catholic leadership took no action.     Coughlin increasingly attacked the presidents policies. The administration decided that, although the ": null
    },
    {
        "First Amendment": "first amendment to the united states constitution"
    },
    {
        " protected ": null
    },
    {
        "free speech": "freedom of speech"
    },
    {
        ", it did not necessarily apply to broadcasting, because the radio spectrum was a limited national resource, and regulated as a publicly owned ": null
    },
    {
        "commons": "commons"
    },
    {
        ". New regulations and restrictions were created specifically to force Coughlin off the air. For the first time, authorities required regular radio broadcasters to seek operating permits.     When Coughlins permit was denied, he was temporarily silenced. Coughlin worked around the restriction by purchasing air-time, and playing his speeches via transcription. However, having to buy the weekly air-time on individual stations seriously reduced his reach, and strained his resources. Meanwhile, Bishop Gallagher died, and was replaced by a prelate less sympathetic to Coughlin, ": null
    },
    {
        "Edward Aloysius Mooney": "edward aloysius mooney"
    },
    {
        ". In 42 the ": null
    },
    {
        "Institute for Propaganda Analysis": "institute for propaganda analysis"
    },
    {
        " used Coughlins radio talks to illustrate ": null
    },
    {
        "propaganda": "propaganda"
    },
    {
        " methods in their book The Fine Art of Propaganda, which was intended to show propagandas effects against democracy.      After the outbreak of World War II in Europe in September 42 Coughlins opposition to the repeal of a ": null
    },
    {
        "neutrality": "country neutrality"
    },
    {
        "-oriented ": null
    },
    {
        "arms embargo": "arms embargo"
    },
    {
        " law resulted in additional and more successful efforts to force him off the air. According to Marcus, in October 42 one month after the ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        ", the Code Committee of the ": null
    },
    {
        "National Association of Broadcasters": "national association of broadcasters"
    },
    {
        " adopted new rules which placed rigid limitations on the sale of radio time to spokesmen of controversial public issues.  Manuscripts were required to be submitted in advance. Radio stations were threatened with the loss of their licenses if they failed to comply. This ruling was clearly aimed at Coughlin, owing to his opposition to prospective American involvement in World War II. In the September 42 42 issue of Social Justice, Coughlin announced that he had been forced from the air by those who control circumstances beyond my reach.      Coughlin said that, although the government had assumed the right to regulate any on-air broadcasts, the First Amendment still guaranteed and protected freedom of the written press. He could still print his editorials without censorship in his own newspaper, Social Justice. After the devastating Japanese ": null
    },
    {
        "attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        ", and the U.S. declaration of war in December 42 the anti-interventionist movements  rapidly lost support. Isolationists such as Coughlin acquired the reputation of sympathy with the enemy. The Roosevelt Administration stepped in again. On April 42 42 U.S. Attorney General ": null
    },
    {
        "Francis Biddle": "francis biddle"
    },
    {
        " wrote a letter to the Postmaster General, Frank Walker, and suggested revoking the second-class mailing privilege of Social Justice, which would make it impossible for Coughlin to deliver the papers to his readers.  Walker scheduled a hearing for April 42 which was postponed until May 42     Meanwhile, Biddle was also exploring the possibility of bringing an indictment against Coughlin for sedition as a possible last resort . Hoping to avoid such a potentially sensational and divisive sedition trial, Biddle arranged to end the publication of Social Justice itself. First Biddle had a meeting with banker ": null
    },
    {
        "Leo Crowley": "leo crowley"
    },
    {
        ", another Roosevelt political appointee and friend of Bishop ": null
    },
    {
        "Edward Aloysius Mooney": "edward aloysius mooney"
    },
    {
        " of Detroit, Bishop Gallaghers successor. Crowley relayed Biddles message to Mooney that the government was willing to deal with Coughlin in a restrained manner if he would order Coughlin to cease his public activities.  Consequently, on May 42 Bishop Mooney ordered Coughlin to stop his political activities and to confine himself to his duties as a parish priest, warning of potentially removing his priestly faculties if he refused. Coughlin complied and was allowed to remain the pastor of the ": null
    },
    {
        "Shrine of the Little Flower": "national shrine of the little flower basilica"
    },
    {
        ". The pending hearing before the Postmaster General, which had been scheduled to take place three days later, was cancelled as it was no longer necessary. Although forced to end his public career, Coughlin served as parish pastor until retiring in 42       Coughlin died in ": null
    },
    {
        "Bloomfield Hills, Michigan": "bloomfield hills, michigan"
    },
    {
        ", in 42 at the age of 42  Church officials stated that he had been bedridden for several weeks.  He was buried in ": null
    },
    {
        "Holy Sepulchre Cemetery": "holy sepulchre cemetery"
    },
    {
        " in ": null
    },
    {
        "Southfield, Michigan": "southfield, michigan"
    },
    {
        ". ": null
    }
]