[
    {
        "     Charles-François du Périer Dumouriez was a ": null
    },
    {
        "French": "france"
    },
    {
        " general during the ": null
    },
    {
        "French Revolutionary Wars": "french revolutionary wars"
    },
    {
        ". He shared the victory at ": null
    },
    {
        "Valmy": "battle of valmy"
    },
    {
        " with General ": null
    },
    {
        "François Christophe Kellermann": "françois christophe kellermann"
    },
    {
        ", but later deserted the ": null
    },
    {
        "Revolutionary Army": "french revolutionary army"
    },
    {
        ", and became a royalist intriguer during the reign of ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " as well as an adviser to the British government. Dumouriez is one of the ": null
    },
    {
        "names inscribed under the Arc de Triomphe": "names inscribed under the arc de triomphe"
    },
    {
        ", on Column 42       Dumouriez was born in ": null
    },
    {
        "Cambrai": "cambrai"
    },
    {
        ", on the ": null
    },
    {
        "Scheldt": "scheldt"
    },
    {
        " River in northern France, to parents of noble rank. His father, Antoine-François du Périer, served as a commissary of the royal army, and educated his son most carefully and widely. The boy continued his studies in Paris at the  Lycée Louis-le-Grand , and in 42 began his military career as a volunteer in the campaign of ": null
    },
    {
        "Rossbach": "battle of rossbach"
    },
    {
        ", where he served as a ": null
    },
    {
        "cornet": "cornet"
    },
    {
        " in the Régiment dEscars. He received a commission for good conduct in action, and served in the later German campaigns of the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " with distinction ; but at the peace he was retired as a captain, with a small pension and the ": null
    },
    {
        "cross of St Louis": "order of saint louis"
    },
    {
        ".     Dumouriez then visited ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        " and ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        ", and his memoranda to the ": null
    },
    {
        "duc de Choiseul": "étienne françois, duc de choiseul"
    },
    {
        " on Corsican affairs at the time of the ": null
    },
    {
        "Corsican Republic": "corsican republic"
    },
    {
        " led to his re-employment on the staff of the ": null
    },
    {
        "French expeditionary corps sent to the island": "french conquest of corsica"
    },
    {
        ", for which he gained the rank of lieutenant-colonel. In 42 Choiseul gave Dumouriez a military command as deputy quartermaster general to the Army of Corsica under the ": null
    },
    {
        "Marquis de Chauvelin": "bernard-françois, marquis de chauvelin"
    },
    {
        ". After this, he became a member of the ": null
    },
    {
        "Secret du Roi": "secret du roi"
    },
    {
        ", the ": null
    },
    {
        "secret service": "intelligence agency"
    },
    {
        " under ": null
    },
    {
        "Louis XV": "louis xv of france"
    },
    {
        ", which gave full scope to his ": null
    },
    {
        "diplomatic": "diplomacy"
    },
    {
        " skills. In 42 he undertook a ": null
    },
    {
        "mission": "diplomatic mission"
    },
    {
        " into ": null
    },
    {
        "Poland": "poland"
    },
    {
        " to the ": null
    },
    {
        "Confederation of Bar": "confederation of bar"
    },
    {
        ", where, in addition to his political business, he organized a Polish militia for the ": null
    },
    {
        "War of the Bar Confederation": "war of the bar confederation"
    },
    {
        ". On 42 May, his Polish soldiers were smashed by the Russian forces of General ": null
    },
    {
        "Alexander Suvorov": "alexander suvorov"
    },
    {
        " in the ": null
    },
    {
        "Battle of Lanckorona": "battle of lanckorona"
    },
    {
        ". The fall of Choiseul brought about Dumouriezs recall. In 42 upon returning to Paris, Dumouriez sought a military position from the ": null
    },
    {
        "marquis de Monteynard": "louis françois de monteynard"
    },
    {
        ", ": null
    },
    {
        "Secretary of State for War": "minister of defence"
    },
    {
        ", who gave him a staff position with the regiment of Lorraine writing diplomatic and military reports. In 42 he found himself imprisoned in the ": null
    },
    {
        "Bastille": "bastille"
    },
    {
        " for six months, apparently for diverting funds intended for the employment of secret agents into the payment of personal debts. During his six months of captivity Dumouriez occupied himself with literary pursuits. He was then removed to ": null
    },
    {
        "Caen": "caen"
    },
    {
        ", where he remained in detention until the accession of ": null
    },
    {
        "Louis XVI": "louis xvi of france"
    },
    {
        " in 42 Dumouriez was then recalled to Paris and assigned to posts in Lille and Boulogne by the ": null
    },
    {
        "comte de Saint-Germain": "claude louis, comte de saint-germain"
    },
    {
        ", the new kings minister of war.     Upon his release, Dumouriez married his cousin, a certain Mademoiselle de Broissy, but he proved a neglectful and unfaithful husband, and in 42 the couple separated. Madame Dumouriez took refuge in a ": null
    },
    {
        "convent": "convent"
    },
    {
        ". In the meantime, Dumouriez had turned his attention to the internal state of his own country, and amongst the very numerous memoranda which he sent to the government was one on the defence of ": null
    },
    {
        "Normandy": "normandy"
    },
    {
        " and its ports, which procured for him in 42 the post of commandant of ": null
    },
    {
        "Cherbourg": "cherbourg-octeville"
    },
    {
        ", which he administered with much success for ten years. He became a maréchal de camp in 42 but his ambition was not satisfied.       At the outbreak of the ": null
    },
    {
        "Revolution": "french revolution"
    },
    {
        ", seeing the opportunity for carving out a new career, he went to Paris, where he joined the ": null
    },
    {
        "Jacobin Club": "jacobin club"
    },
    {
        " in 42 The death of ": null
    },
    {
        "Mirabeau": "honoré mirabeau"
    },
    {
        ", to whose fortunes he had attached himself, proved a great blow. However, opportunity arose again when, in his capacity as a lieutenant-general and the commandant of ": null
    },
    {
        "Nantes": "nantes"
    },
    {
        ", he offered to march to the assistance of the ": null
    },
    {
        "National Constituent Assembly": "national constituent assembly"
    },
    {
        " after the royal familys unsuccessful ": null
    },
    {
        "flight to Varennes": "flight to varennes"
    },
    {
        ".     In 42 Dumouriez was appointed French military advisor to the newly established independent Belgian government and remained dedicated to the cause of an independent Belgian Republic.     Minister of War, ": null
    },
    {
        "Louis Lebègue Duportail": "louis lebègue duportail"
    },
    {
        ", promoted Dumouriez from president of the War Council to major-general in June 42 and attached him to the Twelfth Division, which was commanded by General ": null
    },
    {
        "Jacques Alexis de Verteuil": "jacques alexis de verteuil"
    },
    {
        ".          On August 42 42 Dumouriez wrote to his ally General ": null
    },
    {
        "François Kellermann": "françois kellermann"
    },
    {
        " about the void in military power within France. Within this letter, Dumouriez voices his opinions adamantly that Lafayette was a traitor From Hero To “Traitor”: The French Revolution. Lafayette: Citizen of Two Worlds. Cornell University, n.d. Web. 42 Mar. 42  to France after being arrested for mobilizing his army from the borders of France to Paris to protect the Royal family from revolutionaries that were dissatisfied with the monarchy of France at the time. Within this letter, Dumouriezs attachment to the Jacobin club is explicitly present as he tells Kellermann that the army was finally purged of aristocrats . Dumouriez, Charles François. Letter to General François Kellermann . 42 August 42  Dumouriezs loyalty to Frances military which was evident within this letter was instrumental to him ascending to his future position of Foreign Minister of France from March 42 to June 42 and becoming a military hero for his decisive victory at Jemappes in which the newspaper ": null
    },
    {
        "Révolutions de Paris": "révolutions de paris"
    },
    {
        " proclaimed him the liberator of the Belgians. Department of History. Illustrations from Révolutions De Paris | Department of History. N.p., n.d. Web. 42 Feb. 42     He then attached himself to the ": null
    },
    {
        "Girondist": "girondist"
    },
    {
        " party and, on 42 March 42 became the French minister of foreign affairs. Dumouriez then selected Pierre LeBrun as his first officer for Belgian and Liégeois affairs. The relationship between the Girondists and Dumouriez was not based on ideology, but rather based on the practical benefit it gave to both parties. Dumouriez needed people in the Legislative Assembly to support him, and the Girondists needed a general to give them legitimacy in the army. Brace, Richard Munthe, General Dumouriez and the Girondins 4242, in The American Historical Review, Vol. 42 No. 42 , pp. 4242 He played a major part in the declaration of war against ": null
    },
    {
        "Austria": "austria"
    },
    {
        " , and he planned the invasion of the ": null
    },
    {
        "Low Countries": "netherlands"
    },
    {
        ". His foreign policy was greatly influenced by ": null
    },
    {
        "Jean-Louis Favier": "jean-louis favier"
    },
    {
        ". Savage, Gary. Favier’s Heirs: The French Revolution and the Secret du Roi, in The Historical Journal, Vol. 42 No. 42 , pp. 4242 Favier had called for France to break its ties with Austria. On the kings dismissal of ": null
    },
    {
        "Roland": "jean marie roland"
    },
    {
        ", ": null
    },
    {
        "Clavière": "étienne clavière"
    },
    {
        " and Servan , he took Servans post of minister of war, but resigned it two days later on account of ": null
    },
    {
        "Louis XVI": "louis xvi"
    },
    {
        "s refusal to come to terms with the ": null
    },
    {
        "National Constituent Assembly": "national constituent assembly"
    },
    {
        ", and went to join the army of Marshal ": null
    },
    {
        "Luckner": "nicolas luckner"
    },
    {
        ". After the émeute of ": null
    },
    {
        "42 August 42": "10th of august"
    },
    {
        " and ": null
    },
    {
        "Lafayette": "marquis de la fayette"
    },
    {
        "’s flight, he gained appointment to the command of the Army of the Centre . At the same moment, Frances enemies assumed the offensive. Dumouriez acted promptly. His subordinate ": null
    },
    {
        "Kellermann": "françois christophe kellermann"
    },
    {
        " repulsed the ": null
    },
    {
        "Prussians": "kingdom of prussia"
    },
    {
        " at ": null
    },
    {
        "Valmy": "battle of valmy"
    },
    {
        " , and Dumouriez himself severely defeated the ": null
    },
    {
        "Austrians": "habsburg monarchy"
    },
    {
        " at ": null
    },
    {
        "Jemappes": "battle of jemappes"
    },
    {
        " . After these military victories, Dumouriez was ready to invade Belgium to spread revolution. He was a true revolutionary in the sense that he believed that nations which had undergone a revolution, in this instance France, should give aid to oppressed countries. As his plans were largely limited to Belgium, this tunnel vision sometimes prevented him from acting in the most logical fashion as a commander. Howe, Patricia Chastain, Charles-Francois Dumouriez and the Revolutionizing of French Foreign Affairs in 42, in French Historical Studies, Vol. 42 No. 42 , pp. 4242     Returning to Paris, Dumouriez encountered popular ovation, but he gained less sympathy from the revolutionary government. His old-fashioned methodical method of conducting war exposed him to the criticism of ardent ": null
    },
    {
        "Jacobins": "jacobin club"
    },
    {
        ", and a defeat would have meant the end of his career. To the more radical elements in Paris, it became clear that Dumouriez was not a true patriot when he returned to Paris on 42 January 42 and worked during the trial of Louis XVI to save him from execution. Dumouriez had also written a letter to the Convention scolding it for not supplying his army to his satisfaction and for the Decree of 42 December, which allowed the French armies to loot in the territory they had won. The Decree insured that any plan concerning Belgium would fail due to a lack of popular support among the Belgians. This letter became known as “Dumouriez’s declaration of war”. After a major defeat in the ": null
    },
    {
        "Battle of Neerwinden": "battle of neerwinden"
    },
    {
        " in March 42 he made a desperate move to save himself from his radical enemies. Arresting the four deputy-commissioners of the ": null
    },
    {
        "National Convention": "national convention"
    },
    {
        " who had been sent to inquire into his conduct  as well as the ": null
    },
    {
        "Minister of War": "minister of defence"
    },
    {
        ", ": null
    },
    {
        "Pierre Riel de Beurnonville": "pierre riel de beurnonville"
    },
    {
        ", he handed them over to the enemy, and then attempted to persuade his troops to march on Paris and overthrow the revolutionary government. The attempt failed, and Dumouriez, along with the duc de Chartres  and his younger brother, the ": null
    },
    {
        "duc de Montpensier": "antoine philippe, duke of montpensier"
    },
    {
        ", fled into the Austrian camp. This blow left the Girondists vulnerable due to their association with Dumouriez.          Following his defection in April 42 Dumouriez remained in Brussels for a short time, and then traveled to Cologne, seeking a position at the electors court. He soon learned he had become an object of suspicion among his countrymen, the royal houses, aristocracies, and clergy of Europe. In response, Dumouriez wrote and published in Hamburg a first volume of memoirs in which he offered his version of the previous years events.     Dumouriez now wandered from country to country, occupied in ceaseless royalist intrigues, until 42 when he settled in ": null
    },
    {
        "England": "england"
    },
    {
        ", where the British government granted him a pension. He became a valuable adviser to the British ": null
    },
    {
        "War Office": "war office"
    },
    {
        " in its struggle against ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ", though the extent of his aid only became public many years later. In 42 and 42 he endeavoured to procure from ": null
    },
    {
        "Louis XVIII": "louis xviii of france"
    },
    {
        " the baton of a marshal of France but failed to do so.     He died at ": null
    },
    {
        "Turville Park": "turville"
    },
    {
        ", near ": null
    },
    {
        "Henley-on-Thames": "henley-on-thames"
    },
    {
        ", on 42 March 42     Dumouriezs memoirs appeared at Hamburg in 42 An enlarged edition, La Vie et les mémoires du Général Dumouriez": null
    }
]