[
    {
        "   Charles Francis Hockett was an American ": null
    },
    {
        "linguist": "linguist"
    },
    {
        " who developed many influential ideas in American ": null
    },
    {
        "structuralist": "structuralismstructuralism in linguistics"
    },
    {
        " linguistics. He represents the post-": null
    },
    {
        "Bloomfieldian": "leonard bloomfield"
    },
    {
        " phase of ": null
    },
    {
        "structuralism": "structuralism"
    },
    {
        " often referred to as distributionalism or taxonomic structuralism . His academic career spanned over half a century at Cornell and Rice universities.           At the age of 16, Hockett enrolled at ": null
    },
    {
        "Ohio State University": "ohio state university"
    },
    {
        " in ": null
    },
    {
        "Columbus, Ohio": "columbus, ohio"
    },
    {
        " where he received a ": null
    },
    {
        "Bachelor of Arts": "bachelor of arts"
    },
    {
        " and ": null
    },
    {
        "Master of Arts": "master of arts"
    },
    {
        " in ": null
    },
    {
        "ancient history": "ancient history"
    },
    {
        ". While enrolled at ": null
    },
    {
        "Ohio State": "ohio state university"
    },
    {
        ", Hockett became interested in the work of ": null
    },
    {
        "Leonard Bloomfield": "leonard bloomfield"
    },
    {
        ", a leading figure in the field of ": null
    },
    {
        "structural linguistics": "structural linguistics"
    },
    {
        ". Hockett continued his education at ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        " where he studied ": null
    },
    {
        "anthropology": "anthropology"
    },
    {
        " and ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        " and received his ": null
    },
    {
        "PhD": "doctor of philosophy"
    },
    {
        " in anthropology in 1939. While studying at Yale, Hockett studied with several other influential linguists such as ": null
    },
    {
        "Edward Sapir": "edward sapir"
    },
    {
        ", ": null
    },
    {
        "George P. Murdock": "george p. murdock"
    },
    {
        ", and ": null
    },
    {
        "Benjamin Whorf": "benjamin whorf"
    },
    {
        ". Hocketts dissertation was based on his fieldwork in ": null
    },
    {
        "Potawatomi": "potawatomi language"
    },
    {
        "; his paper on Potawatomi ": null
    },
    {
        "syntax": "syntax"
    },
    {
        " was published in  Language  in 1939. In 1948 his ": null
    },
    {
        "dissertation": "dissertation"
    },
    {
        " was published as a series in the ": null
    },
    {
        "International Journal of American Linguistics": "international journal of american linguistics"
    },
    {
        ". Following fieldwork in ": null
    },
    {
        "Kickapoo": "kickapoo language"
    },
    {
        " and ": null
    },
    {
        "Michoacán": "michoacán"
    },
    {
        ", ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        ", Hockett did two years of ": null
    },
    {
        "postdoctoral": "postdoctoral"
    },
    {
        " study with ": null
    },
    {
        "Leonard Bloomfield": "leonard bloomfield"
    },
    {
        " in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " and ": null
    },
    {
        "Michigan": "michigan"
    },
    {
        ".       Hockett began his teaching career in 1946 as an assistant professor of linguistics in the Division of ": null
    },
    {
        "Modern Languages": "modern languages"
    },
    {
        " at ": null
    },
    {
        "Cornell University": "cornell university"
    },
    {
        " where he was responsible for directing the ": null
    },
    {
        "Chinese language": "chinese language"
    },
    {
        " program. In 1957, Hockett became a member of Cornells anthropology department and continued to teach anthropology and linguistics until he retired to ": null
    },
    {
        "emeritus status": "emeritus"
    },
    {
        " in 1982. In 1986, he took up an adjunct post at ": null
    },
    {
        "Rice University": "rice university"
    },
    {
        " in ": null
    },
    {
        "Houston, Texas": "houston, texas"
    },
    {
        ", where he remained active until his death in 2000.       Charles Hockett held membership among many academic institutions such as the ": null
    },
    {
        "National Academy of Sciences": "united states national academy of sciences"
    },
    {
        " the ": null
    },
    {
        "American Academy of Arts and Sciences": "american academy of arts and sciences"
    },
    {
        ", and the ": null
    },
    {
        "Society of Fellows": "society of fellows"
    },
    {
        " at ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        ". He served as president of both the ": null
    },
    {
        "Linguistic Society of America": "linguistic society of america"
    },
    {
        " and the Linguistic Association of Canada and the United States.     In addition to making many contributions to the field of ": null
    },
    {
        "structural linguistics": "structural linguistics"
    },
    {
        ", Hockett also considered such things as ": null
    },
    {
        "Whorfian Theory": "benjamin whorf"
    },
    {
        ", ": null
    },
    {
        "jokes": "jokes"
    },
    {
        ", the nature of ": null
    },
    {
        "writing systems": "writing systems"
    },
    {
        ", slips of the tongue, and ": null
    },
    {
        "animal communication": "animal communication"
    },
    {
        " and their relativeness to ": null
    },
    {
        "speech": "speech"
    },
    {
        ".     Outside the realm of linguistics and anthropology, Hockett practiced ": null
    },
    {
        "musical": "musical theatre"
    },
    {
        " performance and ": null
    },
    {
        "composition": "musical composition"
    },
    {
        ". Hockett composed a full-length ": null
    },
    {
        "opera": "opera"
    },
    {
        " called The Love of Doña Rosita which was based on a play by ": null
    },
    {
        "Federico García Lorca": "federico garcía lorca"
    },
    {
        " and premiered at ": null
    },
    {
        "Ithaca College": "ithaca college"
    },
    {
        " by the ": null
    },
    {
        "Ithaca": "ithaca, new york"
    },
    {
        " Opera": "opera"
    },
    {
        ".     Hockett and his wife Shirley were vital leaders in the development of the ": null
    },
    {
        "Cayuga": "cayuga, new york"
    },
    {
        " Chamber Orchestra in Ithaca, New York. In appreciation of the Hocketts hard work and dedication to the Ithaca community, Ithaca College established the Charles F. Hockett Music Scholarship, the Shirley and Chas Hockett Chamber Music Concert Series, and the Hockett Family Recital Hall.       In his Note on Structure he argues that ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        " can be seen as a game and as a science. A linguist as player has a freedom for experimentation on all the utterances of a language, but no criterion to compare his analysis with other linguists. Late in his career, he was known for his stinging criticism of ": null
    },
    {
        "Chomskyan": "noam chomsky"
    },
    {
        " linguistics.           After carefully examining the generative schools proposed innovations in Linguistics, Hockett decided that this approach was of little value. His book The State of the Art outlined his criticisms of the generative approach. In his paraphrase a key principle of the Chomskyan paradigm is that there are an infinite number of grammatical sentences in any particular language.   The grammar of a language is a finite system that characterizes an infinite set of sentences. More specifically, the grammar of a language is a well-defined system by definition not more powerful than a universal Turing machine . The State of the Art, p. 40     The crux of Hocketts rebuttal is that the set of grammatical sentences in a language is not infinite, but rather ill-defined. p. 52 et passim Hockett proposes that no physical system is well-defined . p. 52     Later in Where the tongue slips, there slip I he writes as follows.     It is currently fashionable to assume that, underlying the actual more or less bumbling speech behavior of any human being, there is a subtle and complicated but determinate linguistic competence : a sentence-generating device whose design can only be roughly guessed at by any techniques so far available to us. This point of view makes linguistics very hard and very erudite, so that anyone who actually does discover facts about underlying competence is entitled to considerable kudos.     Within this popular frame of reference, a theory of performance -- of the generation of speech -- must take more or less the following form. If a sentence is to be uttered aloud, or even thought silently to oneself, it must first be built by the internal competence of the speaker, the functioning of which is by definition such that the sentence will be legal in every respect. But that is not enough; the sentence as thus constructed must then be performed, either overtly so that others may hear it, or covertly so that it is perceived only by the speaker himself. It is in this second step that blunders may appear. That which is generated by the speakers internal competence is what the speaker intends to say, and is the only real concern of linguistics: blunders in actually performed speech are instructions from elsewhere. Just if there are no such intrusions is what is performed an instance of smooth speech .     I believe this view is unmitigated nonsense, unsupported by any empirical evidence of any sort. In its place, I propose the following.     All speech, smooth as well as blunderful, can be and must be accounted for essentially in terms of the three mechanisms we have listed: analogy, blending, and editing. An individuals language, at a given moment, is a set of habits--that is, of analogies, where different analogies are in conflict, one may appear as a constraint on the working of another. Speech actualizes habits--and changes the habits as it does so. Speech reflects awareness of norms; but norms are themselves entirely a matter of analogy , not some different kind of thing. The View From Language, pp. 254-255.     Despite his criticisms, Hockett always expressed gratitude to the generative school for seeing real problems in the preexisting approaches.     There are many situations in which bracketing does not serve to disambiguate. As already noted, words that belong together cannot always be spoken together, and when they are not, bracketing is difficult or impossible. In the 1950s this drove some grammarians to drink and other to transformations, but both are only anodynes, not answers Hockett, Refurbishing our Foundations. John Benjamins, 1987, p. 23       One of Hocketts most important contributions was his development of the ": null
    },
    {
        "design-feature": "design features of language"
    },
    {
        " approach to comparative linguistics. He attempted to distinguish the similarities and differences among ": null
    },
    {
        "animal communication": "animal communication"
    },
    {
        " systems and ": null
    },
    {
        "human language": "human language"
    },
    {
        ".     Hockett initially developed seven features, which were published in the 1959 paper “Animal ‘Languages’ and Human Language.” However, after many revisions, he settled on 13 design-features in the  Scientific American  The Origin of Speech.     Hockett argued that while every communication system has some of the 13 design features, only human, spoken language has all 13 features. In turn, that differentiates human spoken language from animal communication and other human communication systems such as ": null
    },
    {
        "written language": "written language"
    },
    {
        ".          ": null
    },
    {
        "Vocal-Auditory Channel": "vocal-auditory channel"
    },
    {
        ": Much of human language is performed using the ": null
    },
    {
        "vocal": "vocal"
    },
    {
        " tract and ": null
    },
    {
        "auditory": "auditory system"
    },
    {
        " channel. Hockett viewed this as an advantage for human ": null
    },
    {
        "primates": "primates"
    },
    {
        " because it allowed for the ability to participate in other activities while simultaneously communicating through spoken language.   ": null
    },
    {
        "Broadcast transmission and directional reception": "broadcast transmission and directional reception"
    },
    {
        ": All human language can be heard if it is within range of another persons auditory channel. Additionally, a listener has the ability to determine the source of a sound by ": null
    },
    {
        "binaural direction": "binaural direction"
    },
    {
        " finding.   ": null
    },
    {
        "Rapid Fading ": "rapid fading"
    },
    {
        ": Wave forms of human language dissipate over time and do not persist. A hearer can only receive specific auditory information at the time it is spoken.   Interchangeability: A person has the ability to speak and hear the same ": null
    },
    {
        "signal": "signaling theory"
    },
    {
        ". Anything that a person is able to hear can be reproduced in spoken language.   ": null
    },
    {
        "Total Feedback": "total feedback"
    },
    {
        ": Speakers can hear themselves speak and monitor their ": null
    },
    {
        "speech production": "speech production"
    },
    {
        " and internalize what they are producing by language.   Specialization: Human language sounds are specialized for communication. When dogs pant it is to cool themselves off. When humans speak, it is to transmit information.   ": null
    },
    {
        "Semanticity": "semanticity"
    },
    {
        ": Specific signals can be matched with a specific ": null
    },
    {
        "meaning": "meaning"
    },
    {
        ".   ": null
    },
    {
        "Arbitrariness": "arbitrariness"
    },
    {
        ": There is no limitation to what can be communicated about and no specific or necessary connection between the sounds used and the message being sent.   ": null
    },
    {
        "Discreteness": "discrete mathematics"
    },
    {
        ": ": null
    },
    {
        "Phonemes": "phonemes"
    },
    {
        " can be placed in distinct categories which differentiate them from one another, like the distinct sound of /p/ versus /b/.   ": null
    },
    {
        "Displacement": "displacement"
    },
    {
        ": People can refer to things in space and time and communicate about things that are not present.   ": null
    },
    {
        "Productivity": "productivity"
    },
    {
        ": People can create new and unique meanings of utterances from previously existing utterances and sounds.   ": null
    },
    {
        "Traditional Transmission": "traditional transmission"
    },
    {
        ": Human language is not completely ": null
    },
    {
        "innate": "innate"
    },
    {
        ", and acquisition depends in part on the learning of a language.   ": null
    },
    {
        "Duality of patterning": "duality of patterning"
    },
    {
        ": Meaningless phonic segments  are combined to make meaningful words, which, in turn, are combined again to make sentences.     While Hockett believed that all communication systems, animal and human alike, share many of these features, only human language contains all 13 design features. Additionally, ": null
    },
    {
        "traditional transmission": "traditional transmission"
    },
    {
        ", and ": null
    },
    {
        "duality of patterning": "duality of patterning"
    },
    {
        " are key to human language.       Hockett suggests that the importance of a vocal-auditory channel lies in the fact that the animal can communicate while also performing other tasks, such as eating, or using tools.   ": null
    },
    {
        "Broadcast Transmission and Directional Reception": "broadcast transmission and directional reception"
    },
    {
        ": An auditory|audible human language signal is sent out in all directions but is perceived in a limited direction. For example, humans are more proficient in determining the location of a sound source when the sound is projecting directly in front of them, as opposed to a sound source projected directly behind them.   ": null
    },
    {
        "Rapid Fading": "rapid fading"
    },
    {
        " of a signal in human communication differs from such things as animal tracks and written language because an utterance does not continue to exist after it has been broadcast. With that in mind, it is important to note that Hockett viewed spoken language as the primary concern for investigation. Written language was seen as being secondary because of its recent evolution in culture.   Interchangeability represents a humans ability to act out or reproduce any linguistic message that they are able to comprehend. That differs from many animal communication systems, particularly in regards to mating. For example, humans have the ability to say and do anything that they feel may benefit them in attracting a mate. ": null
    },
    {
        "Stickleback": "stickleback"
    },
    {
        "s, on the other hand, have different male and female courtship motions; a male cannot replicate a females motions and vice versa.   ": null
    },
    {
        "Total Feedback": "total feedback"
    },
    {
        " is important in differentiating a humans ability to internalize their own productions of speech and behavior. That design-feature incorporates the idea that humans have insight into their actions.   Specialization is apparent in the anatomy of human ": null
    },
    {
        "speech organs": "speech organs"
    },
    {
        " and our ability to exhibit some control over these organs. For example, a key assumption in the evolution of language is that the descent of the ": null
    },
    {
        "larynx": "larynx"
    },
    {
        " has allowed humans to produce speech sounds. Additionally, in terms of control, humans are generally able to control the movements of their tongue and mouth. Dogs however, do not have control over these organs. When dogs pant they are communicating a signal, but the panting is an uncontrollable response reflex of being hot .   ": null
    },
    {
        "Semanticity": "semanticity"
    },
    {
        ": A specific signal can be matched with a specific meaning within a particular language system. For example, all people who understand ": null
    },
    {
        "English": "english language"
    },
    {
        " have the ability to make a connection between a specific word and what that word represents or refers to.    ": null
    },
    {
        "Arbitrariness": "arbitrariness"
    },
    {
        " within human language suggests that there is no direct connection between the type of signal and what is being referenced. For example, an animal as large as a cow can be referred to by a very short word .   ": null
    },
    {
        "Discreteness": "discrete mathematics"
    },
    {
        ": Each basic unit of speech can be categorized and is distinct from other categories. In human language, there are only a small set of sound ranges that are used and the differences between these bits of sound are absolute. In contrast, the ": null
    },
    {
        "waggle dance": "waggle dance"
    },
    {
        " of ": null
    },
    {
        "honey bees": "honey bee"
    },
    {
        "is continuous.   ": null
    },
    {
        "Displacement": "displacement"
    },
    {
        " refers to the human language systems ability to communicate about things that are not present spatially, temporally, or realistically. For example, humans have the ability to communicate about unicorns and outer space.   ": null
    },
    {
        "Productivity": "productivity"
    },
    {
        ": Human language is open and productive in the sense that humans have the ability to say things that have never before been spoken or heard. In contrast, apes such as the gibbon have a closed communication system because all of their vocal sounds are part of a finite repertoire of familiar calls.   ": null
    },
    {
        "Traditional Transmission": "traditional transmission"
    },
    {
        ":: suggests that while certain aspects of ": null
    },
    {
        "language": "language"
    },
    {
        " may be ": null
    },
    {
        "innate": "innate"
    },
    {
        ", humans acquire words and their ": null
    },
    {
        "native language": "native language"
    },
    {
        " from other speakers. That is different from many ": null
    },
    {
        "animal communication": "animal communication"
    },
    {
        " systems because most animals are born with the ": null
    },
    {
        "innate": "innate"
    },
    {
        " knowledge": "knowledge"
    },
    {
        ", and ": null
    },
    {
        "skills": "skills"
    },
    {
        " necessary for ": null
    },
    {
        "survival": "wiktionary:survival"
    },
    {
        ". .   ": null
    },
    {
        "Duality of patterning": "duality of patterning"
    },
    {
        ": Humans have the ability to recombine a finite set of ": null
    },
    {
        "phonemes": "phoneme"
    },
    {
        "to create an infinite number of words, which, in turn, can be combined to make an unlimited number of different sentences.       ;Honeybees     Foraging ": null
    },
    {
        "honey bees": "honey bee"
    },
    {
        "communicate with other members of their hive when they have discovered a relevant source of ": null
    },
    {
        "pollen": "pollen"
    },
    {
        ", ": null
    },
    {
        "nectar": "nectar"
    },
    {
        ", or water. In an effort to convey information about the location and the distance of such resources, honeybees participate in a particular figure-eight dance known as the ": null
    },
    {
        "waggle dance": "waggle dance"
    },
    {
        ".     In Hocketts The Origin of Speech , he determined that the honeybee communication system of the ": null
    },
    {
        "waggle dance": "waggle dance"
    },
    {
        " holds the following ": null
    },
    {
        "design features": "design features of language"
    },
    {
        ":     Broadcast Transmission and Directional Reception: By the use of this dance, honeybees are able to send out a signal that informs other members of the hive as to what direction the source of food, or water can be located.   ": null
    },
    {
        "Semanticity": "semanticity"
    },
    {
        ": Evidence that the specific signals of a communication system can be matched with specific meanings is apparent because other members of the hive are able to locate the food source after a performance of the waggle dance.   ": null
    },
    {
        "Displacement": "displacement"
    },
    {
        ": Foraging honeybees can communicate about a resource that is not currently present within the hive.   ": null
    },
    {
        "Productivity": "productivity"
    },
    {
        ": ": null
    },
    {
        "Waggle dances": "waggle dance"
    },
    {
        "change based on the direction, amount, and type of resource.     Gibbons are small apes in the family Hylobatidae. While they share the same ": null
    },
    {
        "kingdom": "kingdom"
    },
    {
        ", ": null
    },
    {
        "phylum": "phylum"
    },
    {
        ", ": null
    },
    {
        "class": "class"
    },
    {
        ", and ": null
    },
    {
        "order": "order"
    },
    {
        " of humans and are relatively close to man, Hockett distinguishes between the gibbon communication system and human language by noting that gibbons are devoid of the last four design features.     Gibbons possess the first nine ": null
    },
    {
        "design features": "design features of language"
    },
    {
        ", but do not possess the last four .     Displacement, according to Hockett, appears to be lacking in the vocal ": null
    },
    {
        "signal": "signalling theory"
    },
    {
        "ing of apes.   Productivity does not exist among gibbons because if any vocal sound is produced, it is one of a finite set of repetitive and familiar calls.   Hockett supports the idea that humans learn language extra genetically through the process of ": null
    },
    {
        "traditional transmission": "traditional transmission"
    },
    {
        ". Hockett distinguishes gibbons from humans by stating that despite any similarities in communication among a species of apes, one cannot attribute these similarities to acquisition through the teaching and learning  of signals; the only explanation must be a genetic basis.   Finally, ": null
    },
    {
        "duality of patterning": "duality of patterning"
    },
    {
        " explains a humans ability to create multiple ": null
    },
    {
        "meanings": "meanings"
    },
    {
        " from somewhat meaningless sounds. For example, the ": null
    },
    {
        "phonemess": "phonemes"
    },
    {
        "/t/, /a/, /c/ can be used to create the words cat, tack, and act. Hockett states that no other ": null
    },
    {
        "Hominoid": "hominoid"
    },
    {
        " communication system besides human language maintains this ability.       In a report published in 1968 with anthropologist and scientist Stuart A. Altmann, Hockett derived three more ": null
    },
    {
        "Design Features": "design features of language"
    },
    {
        ", bringing the total to 16. These are the additional three:      Prevarication : A speaker can say falsehoods, lies, and meaningless statements.   Reflexiveness: Language can be used communicate about the very system it is, and language can discuss language    Learnability : A speaker of a language can learn another language       Cognitive scientist and linguist at the University of Sussex ": null
    },
    {
        "Larry Trask": "larry trask"
    },
    {
        " offered an alternative term and definition for number 14,  Prevarication :   :14. Stimulus Freedom: One can choose to say anything nothing in any given situation     There has since been one more Feature added to the list, by , a director of the Undergraduate Studies program at the University of Maryland: College Parks Anthropology school, part of the College of Behavioral and Social Sciences. His “extra” Feature is:     :17. Grammaticality: A speaker’s sayings conform to the rules of grammar     This follows the definition of Grammar and Syntax, as given by Merriam-Websters Dictionary:     : Grammar :   ::1. the study of the classes of words, their inflections, and their functions and relations in the sentence a study of what is to be preferred and what avoided in inflection and syntax     ::2. the characteristic system of inflections and syntax of a language a system of rules that defines the grammatical structure of a language     : Syntax :   ::1. the way in which linguistic elements are put together to form constituents the part of grammar         Additionally, Dr. Stuart defends his postulation with references to famous linguist Noam Chomsky and University of New York psychologist Gary Marcus. Chomsky theorized that humans are unique in the animal world because of their ability to utilize Design Feature 5: Total Feedback, or recursive grammar. This includes being able to correct oneself and insert explanatory or even non sequitur statements into a sentence, without breaking stride, and keeping proper grammar throughout.     While there have been studies attempting to disprove Chomsky, Marcus states that, An intriguing possibility is that the capacity to recognize recursion might be found only in species that can acquire new patterns of vocalization, for example, songbirds, humans and perhaps some cetaceans. This is in response to a  by psychologist Timothy Gentner of the University of California at San Diego. Gentners study found that starling songbirds use recursive grammar to identify “odd” statements within a given “song.” However, the study does not necessarily debunk Chomskys observation because it has not yet been proven that songbirds have the semantic ability to generalize from patterns.      that symbolic thought is necessary for grammar-based speech, and thus Homo Erectus and all preceding “humans” would have been unable to comprehend modern speech. Rather, their utterances would have been halting and even quite confusing to us,   today.     : Phonetics Laboratory Faculty of Linguistics, Philology and Phonetics published the following chart, detailing how Hocketts Design Features fit into other forms of communication, in animals:    Language 15: 235–248.   1942: A System of Descriptive Phonology , Language 18: 3-21.   1944: Spoken Chinese; Basic Course. With C. Fang. Holt, New York.   1947: Peiping phonology , in: Journal of the American Oriental Society, 67, pp.  253–267. Martin Joos , Readings in Linguistics, vol. I, 4th edition. Chicago and London 1966, pp.  217–228.   1947: Problems of morphemic analysis , in:  Language , 24, pp.  414–41. Readings in Linguistics, vol. I, pp.  229–242.   1948: Biophysics, linguistics, and the unity of science , in:  American Scientist , 36, pp.  558–572.   1950: Peiping morphophonemics , in: Language, 26, pp.  63–85. Readings in Linguistics, vol. I, pp.  315–328.   1954: Two models of grammatical description , in: Word, 10, pp.  210–234. Readings in Linguistics, vol. I, pp.  386–399.   1955: A Manual of Phonology. Indiana University Publications in Anthropology and Linguistics 11.   1958: A Course in Modern Linguistics. The Macmillan Company: New York.   1960: The Origin of Speech . in  Scientific American , 203, pp.  89–97.   1961: Linguistic Elements and Their Relation in  Language , 37: 29–53.   1967: The State of the Art": null
    }
]