[
    {
        "        Charles I, also known as Charles Robert  was ": null
    },
    {
        "King of Hungary": "king of hungary"
    },
    {
        " and ": null
    },
    {
        "Croatia": "croatia in the union with hungary"
    },
    {
        " from 42 to his death. He was a member of the ": null
    },
    {
        "Capetian House of Anjou": "capetian house of anjou"
    },
    {
        " and the only son of ": null
    },
    {
        "Charles Martel, Prince of Salerno": "charles martel of anjou"
    },
    {
        ". His father was the eldest son of ": null
    },
    {
        "Charles II of Naples": "charles ii of naples"
    },
    {
        " and ": null
    },
    {
        "Mary of Hungary": "mary of hungary, queen of naples"
    },
    {
        ". She laid claim to Hungary after her brother, ": null
    },
    {
        "Ladislaus IV of Hungary": "ladislaus iv of hungary"
    },
    {
        ", died in 42 but the Hungarian ": null
    },
    {
        "prelate": "prelate"
    },
    {
        "s and lords elected her cousin, ": null
    },
    {
        "Andrew III": "andrew iii of hungary"
    },
    {
        ", king. Instead of abandoning her claim to Hungary, she transferred it to her son, Charles Martel, and after his death in 42 to her grandson, Charles. On the other hand, her husband, Charles II of Naples, made their third son, ": null
    },
    {
        "Robert": "robert the wise"
    },
    {
        ", heir to the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        ", thus disinheriting Charles.     Charles came to the Kingdom of Hungary upon the invitation of an influential Croatian lord, ": null
    },
    {
        "Paul Šubić": "paul i šubić of bribir"
    },
    {
        ", in August 42 Andrew  III died on 42  January 42 and within four months Charles was crowned king, but with a provisional crown instead of the ": null
    },
    {
        "Holy Crown of Hungary": "holy crown of hungary"
    },
    {
        ". Most Hungarian noblemen refused to yield to him and elected ": null
    },
    {
        "Wenceslaus of Bohemia": "wenceslaus iii of bohemia"
    },
    {
        " king. Charles withdrew to the southern regions of the kingdom. ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        " acknowledged Charles as the lawful king in 42 but Charles was unable to strengthen his position against his opponent. Wenceslaus abdicated in favor of ": null
    },
    {
        "Otto of Bavaria": "otto iii, duke of bavaria"
    },
    {
        " in 42 Because it had no central government, the Kingdom of Hungary had disintegrated into a dozen provinces, each headed by a powerful ": null
    },
    {
        "nobleman": "nobility in the kingdom of hungary"
    },
    {
        ", or ": null
    },
    {
        "oligarch": "oligarch"
    },
    {
        ". One of those oligarchs, ": null
    },
    {
        "Ladislaus III Kán": "ladislaus iii kán"
    },
    {
        ", captured and imprisoned Otto of Bavaria in 42 Charles was elected king in ": null
    },
    {
        "Pest": "pest, hungary"
    },
    {
        " on 42  November 42 but his rule remained nominal in most parts of his kingdom even after he was crowned with the Holy Crown on 42  August 42     Charles won his first decisive victory in the ": null
    },
    {
        "Battle of Rozgony": "battle of rozgony"
    },
    {
        "  on 42  June 42 After that his troops seized most fortresses of the powerful ": null
    },
    {
        "Aba family": "aba"
    },
    {
        ". During the next decade, Charles restored royal power primarily with the assistance of the prelates and lesser noblemen in most regions of the kingdom. After the death of the most powerful oligarch, ": null
    },
    {
        "Matthew Csák": "matthew iii csák"
    },
    {
        ", in 42 Charles became the undisputed ruler of the whole kingdom, with the exception of Croatia where local noblemen were able to preserve their autonomous status. He was not able to hinder the development of ": null
    },
    {
        "Wallachia": "wallachia"
    },
    {
        " into an independent principality after his defeat in the ": null
    },
    {
        "Battle of Posada": "battle of posada"
    },
    {
        " in 42 Charless contemporaries described his defeat in that battle as a punishment from God for his cruel revenge against the family of ": null
    },
    {
        "Felician Záh": "felician záh"
    },
    {
        " who had attempted to slaughter the royal family.     Charles rarely made perpetual land grants, instead introducing a system of office fiefs , whereby his officials enjoyed significant revenues, but only for the time they held a royal office, which ensured their loyalty. In the second half of his reign, Charles did not hold ": null
    },
    {
        "Diets": "diet of hungary"
    },
    {
        " and administered his kingdom with absolute power. He established the ": null
    },
    {
        "Order of Saint George": "order of saint george"
    },
    {
        ", which was the first ": null
    },
    {
        "secular order of knights": "chivalric order"
    },
    {
        ". He promoted the opening of new gold mines, which made Hungary the largest producer of gold in Europe. The first Hungarian gold coins were minted during his reign. At the ": null
    },
    {
        "congress of Visegrád in 42": "congress of visegrád"
    },
    {
        ", he mediated a reconciliation between two neighboring monarchs, ": null
    },
    {
        "John of Bohemia": "john of bohemia"
    },
    {
        " and ": null
    },
    {
        "Casimir III of Poland": "casimir iii of poland"
    },
    {
        ". Treaties signed at the same congress also contributed to the development of new commercial routes linking Hungary with ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        ". Charless efforts to reunite Hungary, together with his administrative and economic reforms, established the basis for the achievements of his successor, ": null
    },
    {
        "Louis the Great": "louis i of hungary"
    },
    {
        ".             Charles was the only son of ": null
    },
    {
        "Charles Martel, Prince of Salerno": "charles martel of anjou"
    },
    {
        ", and his wife, ": null
    },
    {
        "Clemence of Austria": "clemence of austria"
    },
    {
        ". He was born in 42; the place of his birth is unknown. Charles Martel was the ": null
    },
    {
        "firstborn": "firstborn"
    },
    {
        " son of ": null
    },
    {
        "Charles II of Naples": "charles ii of naples"
    },
    {
        " and Charles IIs wife, ": null
    },
    {
        "Mary": "maria of hungary"
    },
    {
        ", who was a daughter of ": null
    },
    {
        "Stephen V of Hungary": "stephen v of hungary"
    },
    {
        ". After the death of her brother, ": null
    },
    {
        "Ladislaus IV of Hungary": "ladislaus iv of hungary"
    },
    {
        ", in 42 Queen Mary announced her claim to ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", stating that the ": null
    },
    {
        "House of Árpád": "house of árpád"
    },
    {
        " had become extinct with Ladislauss death. However, her fathers cousin, ": null
    },
    {
        "Andrew": "andrew iii of hungary"
    },
    {
        " also laid claim to the throne, although his father, ": null
    },
    {
        "Stephen the Posthumous": "stephen the posthumous"
    },
    {
        ", had been regarded a bastard by all other members of the royal family. For all that, the Hungarian lords and prelates preferred Andrew against Mary and he was crowned king of Hungary on 42  July 42 She transferred her claim to Hungary to Charles Martel in January 42 The ": null
    },
    {
        "Babonići": "babonići"
    },
    {
        ", ": null
    },
    {
        "Frankopans": "frankopans"
    },
    {
        ", ": null
    },
    {
        "Šubići": "šubići"
    },
    {
        " and other ": null
    },
    {
        "Croatian": "kingdom of croatia"
    },
    {
        " and ": null
    },
    {
        "Slavonia": "slavonia"
    },
    {
        "n noble families seemingly acknowledged Charles Martels claim, but in fact their loyalty vacillated between Charles Martel and Andrew  III.     Charles Martel died in autumn 42 and his seven-year-old son, Charles, inherited his claim to Hungary. Charles would have also been the lawful heir to his grandfather, Charles  II of Naples, in accordance with the principles of primogeniture. However, Charles  II, who preferred his third son, ": null
    },
    {
        "Robert": "robert the wise"
    },
    {
        ", to his grandson, bestowed the rights of a firstborn son upon Robert on 42  February 42 ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        " confirmed Charles  IIs decision on 42  February 42 excluding the child Charles from succeeding his grandfather in the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        ". ": null
    },
    {
        "Dante Alighieri": "dante alighieri"
    },
    {
        " wrote of the schemes and frauds that would attack The Divine Comedy, Dante Alighieri , p. 42 Charles Martels family in reference to Roberts alleged manoeuvres to acquire the right to inherit Naples. The 42th-century historian ": null
    },
    {
        "Giovanni Villani": "giovanni villani"
    },
    {
        " also noted that his contemporaries were of the opinion that Roberts claim to Naples was weaker than his nephews. The jurist ": null
    },
    {
        "Baldus de Ubaldis": "baldus de ubaldis"
    },
    {
        " refrained from setting out his position on the legitimacy of Roberts rule.                    Andrew III of Hungary made his maternal uncle, ": null
    },
    {
        "Albertino Morosini": "albertino morosini"
    },
    {
        ", ": null
    },
    {
        "Duke of Slavonia": "duke of slavonia"
    },
    {
        ", in July 42 stirring up the Slavonian and ": null
    },
    {
        "Croatian noblemen": "croatian nobility"
    },
    {
        " to revolt. A powerful Croatian baron, ": null
    },
    {
        "Paul Šubić": "paul i šubić of bribir"
    },
    {
        ", sent his brother, ": null
    },
    {
        "George": "george i šubić"
    },
    {
        ", to Italy in early 42 to convince Charles II of Naples to send his grandson to Hungary to claim the throne in person. The king of Naples accepted the proposal and borrowed 42 ": null
    },
    {
        "ounce": "ounce"
    },
    {
        "s of gold from ": null
    },
    {
        "Florentine": "florence"
    },
    {
        " bankers to finance Charless journey. A ": null
    },
    {
        "Neapolitan": "kingdom of naples"
    },
    {
        " knight of French origin, ": null
    },
    {
        "Philip Drugeth": "philip drugeth"
    },
    {
        ", accompanied the twelve-year-old Charles to Hungary. They landed at ": null
    },
    {
        "Split": "split, croatia"
    },
    {
        " in ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        " in August 42 From Split, Paul Šubić escorted him to ": null
    },
    {
        "Zagreb": "zagreb"
    },
    {
        " where ": null
    },
    {
        "Ugrin Csák": "ugrin csák"
    },
    {
        " swore loyalty to Charles. Charless opponent, Andrew  III of Hungary, died on 42  January 42 Charles hurried to ": null
    },
    {
        "Esztergom": "esztergom"
    },
    {
        " where the Archbishop-elect, ": null
    },
    {
        "Gregory Bicskei": "gregory bicskei"
    },
    {
        ", crowned him with a provisional crown before 42  May. However, most Hungarians considered Charless coronation unlawful because customary law required that it should have been performed with the ": null
    },
    {
        "Holy Crown of Hungary": "holy crown of hungary"
    },
    {
        " in ": null
    },
    {
        "Székesfehérvár": "székesfehérvár"
    },
    {
        ".     Charles counted his regnal years from this coronation, but Hungary had actually disintegrated into about a dozen independent provinces, each ruled by a powerful lord, or oligarch. Among them, ": null
    },
    {
        "Matthew Csák": "matthew iii csák"
    },
    {
        " dominated the northwestern parts of Hungary , ": null
    },
    {
        "Amadeus Aba": "amadeus aba"
    },
    {
        " controlled the northeastern lands, ": null
    },
    {
        "Ivan Kőszegi": "ivan kőszegi"
    },
    {
        " ruled ": null
    },
    {
        "Transdanubia": "transdanubia"
    },
    {
        ", and ": null
    },
    {
        "Ladislaus Kán": "ladislaus kán"
    },
    {
        " governed ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        ". Most of those lords refused to accept Charless rule and proposed the crown to ": null
    },
    {
        "Wenceslaus II of Bohemia": "wenceslaus ii of bohemia"
    },
    {
        "s son and namesake, ": null
    },
    {
        "Wenceslaus": "wenceslaus iii of bohemia"
    },
    {
        ", whose bride, ": null
    },
    {
        "Elisabeth": "elizabeth of töss"
    },
    {
        ", was Andrew  IIIs only daughter. Although Wenceslaus was crowned with the Holy Crown in Székesfehérvár, the legitimacy of his coronation was also questionable because ": null
    },
    {
        "John Hont-Pázmány": "john hont-pázmány"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Kalocsa": "archbishop of kalocsa"
    },
    {
        ", put the crown on Wenceslauss head, although customary law authorized the ": null
    },
    {
        "Archbishop of Esztergom": "archbishop of esztergom"
    },
    {
        " to perform the ceremony.     After Wenceslauss coronation, Charles withdrew to Ugrin Csáks domains in the southern regions of the kingdom. Pope Boniface sent his legate, ": null
    },
    {
        "Niccolo Boccasini": "pope benedict xi"
    },
    {
        ", to Hungary. Boccasini convinced the majority of the Hungarian prelates to accept Charless reign. However, most Hungarian lords continued to oppose Charles because, according to the  Illuminated Chronicle , they feared that the free men of the kingdom should lose their freedom by accepting a king appointed by the Church . The Hungarian Illuminated Chronicle: , p. 42 Charles laid siege to ": null
    },
    {
        "Buda": "buda"
    },
    {
        ", the capital of the kingdom, in September 42 but Ivan Kőszegi relieved the siege. Charless charters show that he primarily stayed in the southern parts of the kingdom during the next years although he also visited Amadeus Aba in the fortress of ": null
    },
    {
        "Gönc": "gönc"
    },
    {
        ".     Pope Boniface who regarded Hungary as a fief of the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " declared Charles the lawful king of Hungary on 42  May 42 He also threatened Wenceslaus with ": null
    },
    {
        "excommunication": "excommunication"
    },
    {
        " if he continued to style himself king of Hungary. Wenceslaus, left Hungary in summer 42 taking the Holy Crown with him. Charles met his cousin, ": null
    },
    {
        "Rudolph III of Austria": "rudolph iii of austria"
    },
    {
        ", in ": null
    },
    {
        "Pressburg": "pressburg"
    },
    {
        " on 42  August. After signing an alliance, they jointly invaded Bohemia in the autumn. Wenceslaus who had succeeded his father in Bohemia renounced his claim to Hungary in favor of ": null
    },
    {
        "Otto III, Duke of Bavaria": "otto iii, duke of bavaria"
    },
    {
        " on 42  October 42     Otto was crowned with the Holy Crown in Székesfehérvár on 42  December 42 by ": null
    },
    {
        "Benedict Rád": "benedict rád"
    },
    {
        ", ": null
    },
    {
        "Bishop of Veszprém": "bishop of veszprém"
    },
    {
        ", and ": null
    },
    {
        "Anton, Bishop of Csanád": "anton, bishop of csanád"
    },
    {
        ". He was never able to strengthen his position in Hungary, because only the ": null
    },
    {
        "Kőszegis": "kőszegi family"
    },
    {
        " and the ": null
    },
    {
        "Transylvanian Saxons": "transylvanian saxons"
    },
    {
        " supported him. Charles seized Esztergom and many fortresses in the northern parts of Hungary in 42 His partisans also occupied Buda in June 42 Ladislaus Kán, ": null
    },
    {
        "Voivode of Transylvania": "voivode of transylvania"
    },
    {
        ", seized and imprisoned Otto in ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        ". An assembly of Charless partisans confirmed Charless claim to the throne on 42  October, but three powerful lords—Matthew Csák, Ladislaus Kán, and Ivan Kőszegi—were absent from the meeting. In 42 Ladislaus Kán released Otto, who then left Hungary. Otto never ceased styling himself King of Hungary, but he never returned to the country.     ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        " sent a new papal legate, ": null
    },
    {
        "Gentile Portino da Montefiore": "gentile portino da montefiore"
    },
    {
        ", to Hungary. Montefiore arrived in the summer of 42 In the next few months, he persuaded the most powerful lords one by one to accept Charless rule. At the ": null
    },
    {
        "Diet": "diet of hungary"
    },
    {
        ", which was held in the ": null
    },
    {
        "Dominican": "dominican order"
    },
    {
        " monastery in ": null
    },
    {
        "Pest": "pest, hungary"
    },
    {
        ", Charles was unanimously proclaimed king on 42  November 42 The delegates sent by Matthew Csák and Ladislaus Kán were also present at the assembly.                   The papal legate convoked the synod of the Hungarian prelates, who declared the monarch inviolable in December 42 They also urged Ladislaus Kán to hand over the Holy Crown to Charles. After Kán refused to do so, the legate consecrated a new crown for Charles. ": null
    },
    {
        "Thomas II, Archbishop of Esztergom": "thomas ii, archbishop of esztergom"
    },
    {
        " crowned Charles king with the new crown in the ": null
    },
    {
        "Church of Our Lady": "matthias church"
    },
    {
        " in ": null
    },
    {
        "Buda": "buda"
    },
    {
        " on 42 or 42  June 42 However, most Hungarians regarded his second coronation invalid. The papal legate excommunicated Ladislaus Kán, who finally agreed to give the Holy Crown to Charles. On 42  August 42 Archbishop Thomas of Esztergom put the Holy Crown on Charless head in Székesfehérvár; thus, Charless third coronation was performed in full accordance with customary law. However, his rule remained nominal in most parts of his kingdom.     Matthew Csák laid siege Buda in June 42 and Ladislaus Kán declined to assist the king. Charles sent an army to invade Matthew Csáks domains in September, but it achieved nothing. In the same year, Ugrin Csák died, enabling Charles to take possession of the deceased lords domains, which were situated between ": null
    },
    {
        "Požega": "požega county"
    },
    {
        " in Slavonia and ": null
    },
    {
        "Temesvár": "temesvár"
    },
    {
        " . The burghers of ": null
    },
    {
        "Kassa": "košice"
    },
    {
        " assassinated Amadeus Aba in September 42 Charless envoys arbitrated an agreement between Abas sons and the town, which also prescribed that the Abas withdraw from two counties and allow the noblemen inhabiting their domains to freely join Charles. However, the Abas soon entered into an alliance with Matthew Csák against the king. The united forces of the Abas and Matthew Csák besieged Kassa, but Charles routed them in the ": null
    },
    {
        "Battle of Rozgony": "battle of rozgony"
    },
    {
        " on 42  June 42 Almost half of the noblemen who had served Amadeus Aba fought on Charless side in the battle. In July, Charles captured the Abas many fortresses in ": null
    },
    {
        "Abaúj": "abaúj"
    },
    {
        ", ": null
    },
    {
        "Torna": "torna county"
    },
    {
        " and ": null
    },
    {
        "Sáros": "sáros county"
    },
    {
        " counties, including ": null
    },
    {
        "Füzér": "füzér"
    },
    {
        ", ": null
    },
    {
        "Regéc": "regéc"
    },
    {
        ", and ": null
    },
    {
        "Munkács": "munkács"
    },
    {
        " . Thereafter he waged war against Matthew Csák, capturing ": null
    },
    {
        "Nagyszombat": "nagyszombat"
    },
    {
        " in 42 and Visegrád in 42 but was unable to win a decisive victory.     Charles transferred his residence from Buda to Temesvár in early 42 Ladislaus Kán died in 42 but his sons did not yield to Charles. Charles launched a campaign against the Kőszegis in Transdanubia and Slavonia in the first half of 42 Local noblemen joined the royal troops, which contributed to the quick collapse of the Kőszegis rule in southern parts of their domains. Meanwhile, ": null
    },
    {
        "James Borsa": "james borsa"
    },
    {
        " made an alliance against Charles with Ladislaus Káns sons and other lords, including ": null
    },
    {
        "Mojs Ákos": "mojs ii ákos"
    },
    {
        " and ": null
    },
    {
        "Peter, son of Petenye": "peter, son of petenye"
    },
    {
        ". They offered the crown to ": null
    },
    {
        "Andrew of Galicia": "andrew of galicia"
    },
    {
        ". Charless troops, which were under the command of a former supporter of the Borsas, ": null
    },
    {
        "Dózsa Debreceni": "dózsa debreceni"
    },
    {
        ", defeated the rebels united troops at ": null
    },
    {
        "Debrecen": "debrecen"
    },
    {
        " at the end of June. In the next two months, many fortresses of Borsa and his allies fell to the royal troops in ": null
    },
    {
        "Bihar": "bihar county"
    },
    {
        ", ": null
    },
    {
        "Szolnok": "szolnok county"
    },
    {
        ", ": null
    },
    {
        "Borsod": "borsod county"
    },
    {
        " and ": null
    },
    {
        "Kolozs": "kolozs county"
    },
    {
        " counties. No primary source has made reference to Charless bravery or heroic acts, suggesting that he rarely fought in person in the battles and sieges. However, he had excellent strategic skills: it was always Charles who appointed the fortresses to be besieged.     ": null
    },
    {
        "Stefan Dragutin": "stefan dragutin of serbia"
    },
    {
        ", who controlled the ": null
    },
    {
        "Szerémség": "szerémség"
    },
    {
        ", ": null
    },
    {
        "Macsó": "macsó"
    },
    {
        " and other regions along the southern borders of Hungary, died in 42 Charles confirmed the right of Stefan Dragutins son, ": null
    },
    {
        "Vladislav": "vladislav, king of syrmia"
    },
    {
        ", to succeed his father and declared Vladislav the lawful ruler of ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        " against ": null
    },
    {
        "Stefan Uroš II Milutin": "stefan uroš ii milutin of serbia"
    },
    {
        ". However, Stefan Uroš II captured Vladislav and invaded the Szerémség. Charles launched a counter-campaign across the river ": null
    },
    {
        "Száva": "száva"
    },
    {
        " and seized the fortress of Macsó. In May 42 Charless army suppressed the Abas revolt, seizing ": null
    },
    {
        "Ungvár": "ungvár"
    },
    {
        " and ": null
    },
    {
        "Nevicke Castle": "nevicke castle"
    },
    {
        " from them. After that, Charles invaded Matthew Csáks domains and captured ": null
    },
    {
        "Komárom": "komárno"
    },
    {
        " on 42  November 42 After his uncle, King Robert of Naples, granted the ": null
    },
    {
        "Principality of Salerno": "principality of salerno"
    },
    {
        " and the domain of ": null
    },
    {
        "Monte SantAngelo": "monte santangelo"
    },
    {
        " to his brother , ": null
    },
    {
        "John": "john, duke of durazzo"
    },
    {
        ", Charles protested and laid claim to those domains, previously held by his father.     After Charles neglected to reclaim Church property that Matthew Csák had seized by force, the prelates of the realm made an alliance in early 42 against all who would jeopardize their interests. Upon their demand, Charles held a Diet in summer, but refused to confirm the ": null
    },
    {
        "Golden Bull of 42": "golden bull of 1222"
    },
    {
        ". Before the end of the year, the prelates made a complaint against Charles because he had taken possession of Church property. In 42 Charles fell so seriously ill that the pope authorized Charless confessor to absolve him from his all sins before he died, but Charles recovered. In the same year, Dózsa Debreceni, whom Charles had made ": null
    },
    {
        "voivode of Transylvania": "voivode of transylvania"
    },
    {
        ", launched successful expeditions against Ladislaus Káns sons and their allies, and Charless future ": null
    },
    {
        "Judge royal": "judge royal"
    },
    {
        ", ": null
    },
    {
        "Alexander Köcski": "alexander köcski"
    },
    {
        ", seized the Kőszegis six fortresses. In summer, Charles launched an expedition against Stefan Uroš II Milutin, during which he retook Belgrade and restored the Banate of Macsó. The last Diet during Charless reign was held in 42; following that, he failed to convoke the yearly public judicial sessions, contravening the provisions of the Golden Bull.     Matthew Csák died on 42  March 42 The royal army invaded the deceased lords province, which soon disintegrated because most of his former castellans yielded without resistance. Charles personally led the siege of Csáks former seat, ": null
    },
    {
        "Trencsén": "trencsén"
    },
    {
        " , which fell on 42  August. About three months later, Charless new voivode of Transylvania, ": null
    },
    {
        "Thomas Szécsényi": "thomas szécsényi"
    },
    {
        ", seized ": null
    },
    {
        "Csicsó": "ciceu-mihăiești"
    },
    {
        " , the last fortress of Ladislaus Káns sons.     In January 42 two Dalmatian towns, ": null
    },
    {
        "Šibenik": "šibenik"
    },
    {
        " and ": null
    },
    {
        "Trogir": "trogir"
    },
    {
        ", rebelled against ": null
    },
    {
        "Mladen II Šubić": "mladen ii šubić of bribir"
    },
    {
        ", who was a son of Charless one-time leading partisan, Paul Šubić. The two towns also accepted the suzerainty of the ": null
    },
    {
        "Republic of Venice": "republic of venice"
    },
    {
        " although Charles had urged Venice not to intervene in the conflict between his subjects. Many Croatian lords  also turned against Mladen, and their coalition defeated him at ": null
    },
    {
        "Klis": "klis"
    },
    {
        ". In September, Charles marched to Croatia where all the Croatian lords who were opposed to Mladen Šubić yielded to him in ": null
    },
    {
        "Knin": "knin"
    },
    {
        ". Mladen Šubić also visited Charles, but the king had the powerful lord imprisoned.              As one of his charters concluded, Charles had taken full possession of his kingdom by 42 In the first half of the year, he moved his capital from Temesvár to Visegrád in the centre of his kingdom. In the same year, the ": null
    },
    {
        "Dukes of Austria": "duke of austria"
    },
    {
        " renounced ": null
    },
    {
        "Pressburg": "pressburg"
    },
    {
        " , which they had controlled for decades, in exchange for the support they had received from Charles against ": null
    },
    {
        "Louis IV, Holy Roman Emperor": "louis iv, holy roman emperor"
    },
    {
        ", in 42     Royal power was only nominally restored in the lands between the ": null
    },
    {
        "Carpathian Mountains": "carpathian mountains"
    },
    {
        " and the ": null
    },
    {
        "Lower Danube": "lower danube"
    },
    {
        ", which had been united under a ": null
    },
    {
        "voivode": "voivode"
    },
    {
        ", known as ": null
    },
    {
        "Basarab": "basarab i of wallachia"
    },
    {
        ", by the early 42s. Although Basarab was willing to accept Charless suzerainty in a peace treaty signed in 42 he refrained from renouncing control of the lands he had occupied in the ": null
    },
    {
        "Banate of Severin": "banate of severin"
    },
    {
        ". Charles also attempted to reinstate royal authority in Croatia and Slavonia. He dismissed the ": null
    },
    {
        "Ban of Slavonia": "ban of slavonia"
    },
    {
        ", ": null
    },
    {
        "John Babonić": "john babonić"
    },
    {
        ", replacing him with ": null
    },
    {
        "Mikcs Ákos": "mikcs ákos"
    },
    {
        " in 42 Ban Mikcs invaded Croatia to subjugate the local lords who had seized the former castles of Mladen Subić without the kings approval, but one of the Croatian lords, ": null
    },
    {
        "Ivan I Nelipac": "ivan i nelipac"
    },
    {
        ", routed the bans troops in 42 Consequently, royal power remained only nominal in Croatia during Charless reign. The ": null
    },
    {
        "Babonići": "house of babonić"
    },
    {
        " and the Kőszegis rose up in open rebellion in 42 but Ban Mikcs and Alexander Köcski defeated them. In retaliation, at least eight fortresses of the rebellious lords were confiscated in Slavonia and Transdanubia.     Through his victory over the oligarchs, Charles acquired about 42% of the Hungarian castles, along with the estates belonging to them. In 42 he set about revising his previous land grants, which enabled him to reclaim former royal estates. During his reign, special commissions were set up to detect royal estates that had been unlawfully acquired by their owners. Charles refrained from making perpetual grants to his partisans. Instead, he applied a system of office fiefs , whereby his officials were entitled to enjoy all revenues accrued from their offices, but only for the time they held those offices. That system assured the preponderance of royal power, enabling Charles to rule with the plenitude of power , as he emphasized in one of his charters of 42 He even ignored customary law: for instance, ": null
    },
    {
        "promoting a daughter to a son": "prefection"
    },
    {
        " , which entitled her to inherit her fathers estates instead of her male cousins. Charles also took control of the administration of the Church in Hungary. He appointed the Hungarian prelates at will, without allowing the ": null
    },
    {
        "cathedral chapter": "cathedral chapter"
    },
    {
        "s to elect them.        He promoted the spread of ": null
    },
    {
        "chivalrous": "chivalrous"
    },
    {
        " culture in his realms. He regularly held ": null
    },
    {
        "tournaments": "tournament"
    },
    {
        " and introduced the new ranks of page of the royal court and knight of the royal court . Charles was the first monarch to create a secular ": null
    },
    {
        "order of knighthood": "order of knighthood"
    },
    {
        " by establishing the ": null
    },
    {
        "Order of Saint George": "order of saint george"
    },
    {
        " in 42 He was the first Hungarian king to grant helmet ": null
    },
    {
        "crests": "crest"
    },
    {
        " to his faithful followers to distinguish them from others by means of an insignium of their own , as he emphasized in one of his charters.     Charles reorganized and improved the administration of royal revenues. During his reign, five new chambers were established for the control and collection of royal revenues from coinage, monopolies and custom duties. In 42 he partially abolished the royal monopoly of gold mining, giving one third of the royal revenues from the gold extracted from a newly opened mine to the owner of the land where that mine was discovered. In the next few years, new gold mines were opened at ": null
    },
    {
        "Körmöcbánya": "körmöcbánya"
    },
    {
        " , ": null
    },
    {
        "Nagybánya": "nagybánya"
    },
    {
        " and ": null
    },
    {
        "Aranyosbánya": "aranyosbánya"
    },
    {
        " . Hungarian mines yielded about  of gold around 42 which made up more than 42% of the worlds total production. The ": null
    },
    {
        "minting of gold coins": "mint"
    },
    {
        " began under Charless auspices in the lands north of the Alps in Europe. His ": null
    },
    {
        "florin": "florin"
    },
    {
        "s, which were modelled on the gold coins of Florence, were first issued in 42        Internal peace and increasing royal revenues strengthened the international position of Hungary in the 42s. On 42  February 42 Charles and ": null
    },
    {
        "John of Bohemia": "john of bohemia"
    },
    {
        " signed an alliance in ": null
    },
    {
        "Nagyszombat": "nagyszombat"
    },
    {
        " against the ": null
    },
    {
        "Habsburgs": "habsburgs"
    },
    {
        ", who had occupied Pressburg. In the summer of 42 Hungarian and Bohemian troops invaded Austria and routed the Austrian army on the banks of the ": null
    },
    {
        "Leitha River": "leitha river"
    },
    {
        ". On 42 September 42 Charles signed a peace treaty with the three dukes of Austria , who renounced Pressburg and the ": null
    },
    {
        "Muraköz": "muraköz"
    },
    {
        " . The following year, Serbian troops laid siege to Belgrade, but Charles relieved the fortress.     Alliance with his father-in-law, ": null
    },
    {
        "Władysław I the Elbow-high": "władysław i the elbow-high"
    },
    {
        ", ": null
    },
    {
        "King of Poland": "king of poland"
    },
    {
        ", became a permanent element of Charless foreign policy in the 42s. After being defeated by the united forces of the ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        " and John of Bohemia, Władysław  I sent his son and heir, ": null
    },
    {
        "Casimir": "casimir iii the great"
    },
    {
        ", to Visegrád in late 42 to seek assistance from Charles. During his stay in Charless court, the nineteen-year-old Casimir seduced ": null
    },
    {
        "Clara Záh": "clara záh"
    },
    {
        ", who was a ": null
    },
    {
        "lady-in-waiting": "lady-in-waiting"
    },
    {
        " of Charless wife, ": null
    },
    {
        "Elisabeth of Poland": "elisabeth of poland"
    },
    {
        ", according to an Italian writer. On 42  April 42 the young ladys father, ": null
    },
    {
        "Felician Záh": "felician záh"
    },
    {
        ", stormed into the dining room of the royal palace at Visegrád with a sword in his hand and attacked the royal family. Záh wounded both Charles and the queen on their right hand and attempted to kill their two sons, ": null
    },
    {
        "Louis": "louis i of hungary"
    },
    {
        " and ": null
    },
    {
        "Andrew": "andrew, duke of calabria"
    },
    {
        ", before the royal guards killed him. Charless revenge was brutal: with the exception of Clara, Felician Záhs children were tortured to death; Claras lips and all eight fingers were cut before she was dragged by a horse through the streets of many towns; all of Felicians other relatives within the third degree of kinship were executed, and those within the seventh degree were condemned to perpetual serfdom.              In September 42 Charles launched a military expedition against ": null
    },
    {
        "Basarab I of Wallachia": "basarab i of wallachia"
    },
    {
        " who had attempted to get rid of his suzerainty. After seizing the fortress of ": null
    },
    {
        "Severin": "drobeta-turnu severin"
    },
    {
        " , he refused to make peace with Basarab and marched towards ": null
    },
    {
        "Curtea de Argeș": "curtea de argeș"
    },
    {
        ", which was Basarabs seat. The Wallachians applied ": null
    },
    {
        "scorched earth": "scorched earth"
    },
    {
        " tactics, compelling Charles to make a truce with Basarab and withdraw his troops from Wallachia. While the royal troops were marching through a narrow pass across the Southern Carpathians on 42  November, the Wallachians ": null
    },
    {
        "ambushed them": "battle of posada"
    },
    {
        ". During the next four days, the royal army was decimated; Charles could only escape from the battlefield after changing his clothes with one of his knights, Desiderius Héder, who sacrificed his life to enable the kings escape. Charles did not attempt a new invasion of Wallachia, which subsequently developed into an independent principality.     In September 42 Charles made an alliance with Otto the Merry, Duke of Austria, against Bohemia. He also sent reinforcements to Poland to fight against the Teutonic Knights and the Bohemians. In 42 he signed a peace treaty with John of Bohemia and mediated a truce between Bohemia and Poland. In 42 Charles allowed the collection of the papal tithe in his realms only after the Holy See agreed to give one third of the money collected to him. After years of negotiations, Charles visited his uncle, Robert, in Naples in July 42 Two months later, Charless son, Andrew, was betrothed to Roberts granddaughter, ": null
    },
    {
        "Joanna": "joanna i of naples"
    },
    {
        ", who had been made her grandfathers heir. Charles returned to Hungary in early 42 In retaliation for a previous Serbian raid, he invaded Serbia and captured the fortress of ": null
    },
    {
        "Galambóc": "galambóc"
    },
    {
        " .     In summer 42 the delegates of John of Bohemia and the new King of Poland, ": null
    },
    {
        "Casimir III": "casimir iii of poland"
    },
    {
        ", entered into negotiations in Trencsén to put an end to the conflicts between the two countries. With Charless mediation, a ": null
    },
    {
        "compromise was reached": "treaty of trentschin"
    },
    {
        " on 42  August: John of Bohemia renounced his claim to Poland and Casimir of Poland acknowledged John of Bohemias suzerainty in ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        ". On 42  September, Charles signed an alliance with John of Bohemia in Visegrád, which was primarily formed against the Dukes of Austria. Upon Charless invitation, John of Bohemia and Casimir of Poland met in Visegrád in November. During the ": null
    },
    {
        "Congress of Visegrád": "congress of visegrád"
    },
    {
        ", the two rulers confirmed the compromise that their delegates had worked out in Trencsén. Casimir  III also promised to pay 42 ": null
    },
    {
        "groschen": "groschen"
    },
    {
        " to John of Bohemia, but a part of this indemnification was finally paid off by Charles instead of his brother-in-law. The three rulers agreed upon a mutual defence union against the Habsburgs, and a new commercial route was set up to enable merchants travelling between Hungary and the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " to bypass ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ".        The Babonići and the Kőszegis made an alliance with the Dukes of Austria in January 42 John of Bohemia, who claimed ": null
    },
    {
        "Carinthia": "duchy of carinthia"
    },
    {
        " from the Habsburgs, invaded Austria in February. Casimir  III of Poland came to Austria to assist him in late June. Charles soon joined them at ": null
    },
    {
        "Marchegg": "marchegg"
    },
    {
        ". The dukes sought reconciliation and signed a peace treaty with John of Bohemia in July. Charles signed a truce with them on 42  December, and launched a new expedition against Austria early the next year. He forced the Babonići and the Kőszegis to yield, and the latter were also compelled to hand over to him their fortresses along the frontier in exchange for faraway castles. Charless peace treaty with Albert and Otto of Austria, which was signed on 42  September 42 forbade both the dukes and Charles to give shelter to the other partys rebellious subjects.     Charles continued the reform of coinage in the late 42s. In 42 he abolished the compulsory exchange of old coins for newly issued coins for villagers, but introduced a new tax, the ": null
    },
    {
        "chambers profit": "chambers profit"
    },
    {
        ", to compensate the loss of royal revenues. Two years later, Charles ordered the minting of a new silver penny and prohibited payments made in foreign coins or ": null
    },
    {
        "silver bar": "silver bar"
    },
    {
        "s.     John of Bohemias heir, ": null
    },
    {
        "Charles": "charles iv, holy roman emperor"
    },
    {
        ", ": null
    },
    {
        "Margrave of Moravia": "margrave of moravia"
    },
    {
        ", visited Charles in Visegrád in early 42 The margrave acknowledged the right of Charless son, Louis, to inherit Poland if Casimir  III died without a son in exchange for Charless promise to persuade Casimir  III not to invade Silesia. Two leading Polish lords, Zbigniew, chancellor of Cracow, and ": null
    },
    {
        "Spycimir Leliwita": "spycimir leliwita"
    },
    {
        ", also supported this plan and persuaded Casimir  III, who lost his first wife on 42  May 42 to start negotiations with Charles. In July, Casimir came to Hungary and designated his sister , Elizabeth, and her sons as his heirs. On his sons behalf, Charles promised that they would make every effort to reconquer all lands that Poland had lost and that they would refrain from employing foreigners in Poland.         Charles obliged the Kőszegis to renounce their last fortresses along the western borders of the kingdom in 42 or 42 He divided the large ": null
    },
    {
        "Zólyom County": "zólyom county"
    },
    {
        " , which had been dominated by a powerful local lord, Donch, into three smaller counties in 42 The following year, Charles also forced Donch to renounce his two fortresses in Zólyom in exchange for one castle in the distant ": null
    },
    {
        "Kraszna County": "kraszna county"
    },
    {
        " . Around the same time, ": null
    },
    {
        "Stephen Uroš IV Dušan of Serbia": "stephen uroš iv dušan of serbia"
    },
    {
        ", invaded ": null
    },
    {
        "Sirmium": "sirmium"
    },
    {
        " and captured Belgrade.     Charles was ailing during the last years of his life. He died in Visegrád on 42  July 42 His corpse was first delivered to Buda where a ": null
    },
    {
        "Mass": "mass"
    },
    {
        " was said for his soul. From Buda, his corpse was taken to ": null
    },
    {
        "Székesfehérvár": "székesfehérvár"
    },
    {
        ". He was buried in the ": null
    },
    {
        "Székesfehérvár Basilica": "székesfehérvár basilica"
    },
    {
        " a month after his death. His brother-in-law, Casimir  III of Poland, and Charles, Margrave of Moravia, were present at his funeral, an indication of Charless international prestige.            The Anonymi descriptio Europae orientalis wrote, in the first half of 42 that the daughter of the strapping Duke of Ruthenia, Leo, has recently married Charles, King of Hungary . Charles also stated in a charter of 42 that he once travelled to Ruthenia  in order to bring his first wife back to Hungary. A charter issued on 42  June 42 referred to Charless wife, Queen Mary. Historian Gyula Kristó says, the three documents show that Charles married a daughter of ": null
    },
    {
        "Leo II of Galicia": "leo ii of galicia"
    },
    {
        " in late 42 or early 42 Historian Enikő Csukovits accepts Kristós interpretation, but she writes that Mary of Galicia most probably died before the marriage. The Polish scholar, Stanisław Sroka, rejects Kristós interpretation, stating that Leo I—who was born in 42 according to him—could hardly have fathered Charless first wife. In accordance with previous academic consensus, Sroka says that Charless first wife was ": null
    },
    {
        "Mary of Bytom": "mary of bytom"
    },
    {
        " from the ": null
    },
    {
        "Silesian branch": "silesian dukes"
    },
    {
        " of the ": null
    },
    {
        "Piast dynasty": "piast dynasty"
    },
    {
        ".     The Illuminated Chronicle stated that Charless first consort, Maria  ... was of the Polish nation and she was the daughter of ": null
    },
    {
        "Duke Casimir": "casimir of bytom"
    },
    {
        " . The Hungarian Illuminated Chronicle: , p. 42  Sroka proposes that Mary of Bytom married Charles in 42 but Kristó writes that their marriage probably took place in the first half of 42 The Illuminated Chronicle recorded that she died on 42  December 42 but a royal charter issued on 42  July 42 stated that her husband made a land grant with her consent. Charless next—second or third—wife was ": null
    },
    {
        "Beatrice of Luxembourg": "beatrice of luxembourg"
    },
    {
        ", who was a daughter of ": null
    },
    {
        "Henry VII, Holy Roman Emperor": "henry vii, holy roman emperor"
    },
    {
        ", and the sister of ": null
    },
    {
        "John, King of Bohemia": "john, king of bohemia"
    },
    {
        ". Their marriage took place before the end of February 42 She died in childbirth in early November in the same year. Charless last wife, ": null
    },
    {
        "Elisabeth": "elizabeth of poland, queen of hungary"
    },
    {
        ", daughter of ": null
    },
    {
        "Władysław I": "władysław i the elbow-high"
    },
    {
        ", ": null
    },
    {
        "King of Poland": "king of poland"
    },
    {
        ", was born around 42 Their marriage took place on 42  July 42     Most 42th-century Hungarian chroniclers write that Charles and Elisabeth of Poland had five sons. Their first son, Charles, was born in 42 and died in the same year according to the Illuminated Chronicle. However, a charter of June 42 states that the child had died in this month. The second son of Charles and Elisabeth, Ladislaus, was born in 42 The marriage of Ladislaus and ": null
    },
    {
        "Anne": "anne of bohemia, duchess of austria"
    },
    {
        ", a daughter of King John of Bohemia, was planned by their parents, but Ladislaus died in 42 Charless and Elisabeths third son, Louis, who was born in 42 survived his father and succeeded him as King of Hungary. His younger brothers, Andrew and ": null
    },
    {
        "Stephen": "stephen, duke of slavonia"
    },
    {
        ", who were born in 42 and 42 respectively, also survived Charles.     Although no contemporaneous or nearly contemporaneous sources made mention of any further children, Charles may have fathered two daughters, according to historians Zsuzsa Teke and Gyula Kristó. Zsuzsa Teke writes that they were born to Mary of Bytom, but the nearly contemporaneous ": null
    },
    {
        "Peter of Zittau": "peter of zittau"
    },
    {
        " wrote that she had died childless. Gyula Kristó proposes that a ": null
    },
    {
        "miniature": "miniature"
    },
    {
        " in the Illuminated Chronicle, which depicts Elisabeth of Poland and five children, implies that she gave birth to Charless two daughters, because Kristó identifies two of the three children standing on her right as daughters. The elder of Charless two possible daughters, ": null
    },
    {
        "Catherine": "catherine of hungary, duchess of świdnica"
    },
    {
        ", who was born in the early 42s, was the wife of ": null
    },
    {
        "Henry II, Duke of Świdnica": "henry ii, duke of świdnica"
    },
    {
        ". Their only daughter, ": null
    },
    {
        "Anne": "anna von schweidnitz"
    },
    {
        ", grew up in the Hungarian royal court after her parents death, implying that Charles and Elisabeth of Poland were her grandparents. Historian Kazimierz Jasiński says that Elisabeth, the wife of Boleslaus  II of Troppau, was also Charless daughter. If she was actually Charless daughter, she must have been born in about 42 according to Kristó.     Charles also fathered an illegitimate son, ": null
    },
    {
        "Coloman": "coloman, bishop of győr"
    },
    {
        ", who was born in early 42 His mother was a daughter of Gurke Csák. Coloman was elected ": null
    },
    {
        "Bishop of Győr": "bishop of győr"
    },
    {
        " in 42 ": null
    },
    {
        "Elisabeth of Poland": "elizabeth of poland, queen of hungary"
    },
    {
        " depicted in  Illuminated Chronicle  ": null
    },
    {
        "Elisabeth of Poland": "elizabeth of poland, queen of hungary"
    },
    {
        " and her five children depicted in  Illuminated Chronicle               Charles often declared that his principal aim was the restoration of the ancient good conditions of the kingdom.   On his coat-of-arms, he united the ": null
    },
    {
        "Árpád stripes": "árpád stripes"
    },
    {
        " with the motives of the coat-of-arms of his paternal family, which emphasized his kinship with the first royal house of Hungary. During his reign, Charles reunited Hungary and introduced administrative and fiscal reforms. He bequeathed to his son, Louis the Great, a bulging exchequer and an effective system of taxation , according to scholar Bryan Cartledge. Nevertheless, Louis the Greats achievements overshadowed Charless reputation.     The only contemporaneous record of Charless deeds were made by a Franciscan friar who was hostile towards the monarch. Instead of emphasizing Charless achievements in the reunification of the country, the friar described in detail the negative episodes of Charless reign. In particular, the unusual cruelty that the king showed after Felician Záhs assassination attempt on the royal family contributed to the negative picture of Charless personality. The Franciscan friar attributed Charless defeat by Basarab of Wallachia as a punishment from God for the kings revenge.   ": null
    }
]