[
    {
        "            Charlton Athletic Football Club is an English professional ": null
    },
    {
        "association football": "association football"
    },
    {
        " club based in ": null
    },
    {
        "Charlton": "charlton, london"
    },
    {
        ", south-east ": null
    },
    {
        "London": "london"
    },
    {
        ". They currently compete in the ": null
    },
    {
        "EFL Championship": "efl championship"
    },
    {
        ", the second tier of English football. The club was founded on 9 June 1905 when a number of youth clubs in south-east London, including East Street Mission and Blundell Mission, combined to form Charlton Athletic. Their home ground is ": null
    },
    {
        "the Valley": "the valley"
    },
    {
        ", where the club have played since 1919, apart from one year in ": null
    },
    {
        "Catford": "catford"
    },
    {
        ", during ": null
    },
    {
        "1923–24": "1923–24 in english football"
    },
    {
        ", and seven years at ": null
    },
    {
        "Crystal Palace": "crystal palace f.c."
    },
    {
        " and ": null
    },
    {
        "West Ham United": "west ham united f.c."
    },
    {
        " between 1985 and 1992, due to financial issues, and then safety concerns raised by the local council. The clubs fans formed the Valley Party, nominating candidates to stand in local elections, in a bid to return the club to The Valley.     Charlton turned professional in 1920 and first entered ": null
    },
    {
        "the Football League": "the football league"
    },
    {
        " in 1921. Since then the club has had four separate periods in the top flight of English football: 1936–1957, 1986–1990, 1998–1999, and 2000–2007. Historically, Charltons most successful period was the 1930s, when the clubs highest league finishes were recorded, including runners-up of the ": null
    },
    {
        "First Division": "football league first division"
    },
    {
        " in 1937. After World War II, Charlton reached two consecutive ": null
    },
    {
        "FA Cup": "fa cup"
    },
    {
        " finals, losing in ": null
    },
    {
        "1946": "1946 fa cup final"
    },
    {
        ", and winning in ": null
    },
    {
        "1947": "1947 fa cup final"
    },
    {
        ".     The clubs traditional ": null
    },
    {
        "kit": "kit"
    },
    {
        " consists of red shirts, white shorts and red socks, and their most commonly used nickname is The Addicks. Charlton share ": null
    },
    {
        "local rivalries": "south london derby"
    },
    {
        " with fellow ": null
    },
    {
        "South East London": "football in london"
    },
    {
        " clubs ": null
    },
    {
        "Crystal Palace": "crystal palace f.c."
    },
    {
        " and ": null
    },
    {
        "Millwall": "millwall f.c."
    },
    {
        ".              Charlton Athletic F.C. were formed on 9 June 1905 by a group of 15- to 17-year-olds in East Street, Charlton, which is now known as Eastmoor Street and no longer residential. Charlton spent most of the years before the First World War playing in youth leagues. They became a senior side in 1913 the same year that nearby ": null
    },
    {
        "Woolwich Arsenal": "arsenal f.c."
    },
    {
        " relocated to North London.  After the war, they joined the Kent League for one season before becoming professional, appointing ": null
    },
    {
        "Walter Rayner": "walter rayner"
    },
    {
        " as the first full-time manager. They were accepted by the Southern League and played just a single season before being voted into the ": null
    },
    {
        "Football League": "football league"
    },
    {
        ". Charltons first Football League match was against ": null
    },
    {
        "Exeter City": "exeter city f.c."
    },
    {
        " in August 1921, which they won 1–0. In 1923, Charlton became giant killers in the ": null
    },
    {
        "FA Cup": "fa cup"
    },
    {
        " beating top flight sides Manchester City, West Bromwich Albion, and Preston North End before losing to eventual winners Bolton Wanderers in the Quarter-Finals. Later that year, it was proposed that Charlton merge with Catford Southend to create a larger team with bigger support. Clayton 2001, p.30 In the 1923–24 season Charlton played in Catford at ": null
    },
    {
        "The Mount stadium": "the mount stadium"
    },
    {
        " and wore the colours of The Enders , light and dark blue vertical stripes. However, the move fell through and the Addicks returned to the Charlton area in 1924, returning to the traditional red and white colours in the process. Clayton 2001, p.33     Charlton finished second bottom in the Football League in 1926 and were forced to apply for ": null
    },
    {
        "re-election": "re-election"
    },
    {
        " which was successful. Three years later the Addicks won the ": null
    },
    {
        "Division Three": "football league division three"
    },
    {
        " championship in 1929  and they remained at the ": null
    },
    {
        "Division Two": "football league division two"
    },
    {
        " level for four years. After ": null
    },
    {
        "relegation": "relegation"
    },
    {
        " into the Third Division south at the end of the 1932–33 season the club appointed Jimmy Seed as manager and he oversaw the most successful period in Charltons history either side of the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ". Seed, an ex-miner who had made a career as a footballer despite suffering the effects of poison gas in the First World War, remains the most successful manager in Charltons history. He is commemorated in the name of a stand at the Valley. Jimmy Seed, Soccer From the Inside , p.19. Seed was an innovative thinker about the game at a time when tactical formations were still relatively unsophisticated. He later recalled a simple scheme that enabled us to pull several matches out of the fire during the 1934–35 season: when the team was in trouble the centre-half was to forsake his defensive role and go up into the attack to add weight to the five forwards. Seed, Soccer From the Inside, p.66. The organisation Seed brought to the team proved effective and the Addicks gained successive promotions from the ": null
    },
    {
        "Third Division": "football league third division"
    },
    {
        " to the ": null
    },
    {
        "First Division": "football league first division"
    },
    {
        " between 1934 and 1936, becoming the first club to ever do so. Charlton finally secured promotion to the First Division by beating local rivals ": null
    },
    {
        "West Ham United": "west ham united"
    },
    {
        " at the ": null
    },
    {
        "Boleyn Ground": "boleyn ground"
    },
    {
        ", with their centre-half John Oakes playing on despite concussion and a broken nose. Colin Cameron, Home and Away with Chalton Athletic 1920–2004 , p.69.     In 1937, Charlton finished runners up in the First Division,  in 1938 finished fourth  and 1939 finished third.  They were the most consistent team in the top flight of English football over the three seasons immediately before the Second World War. This continued during the war years and they won the ": null
    },
    {
        "Football League War Cup": "football league war cup"
    },
    {
        " and appeared in finals.       Charlton reached the ": null
    },
    {
        "1946 FA Cup Final": "1946 fa cup final"
    },
    {
        ", but lost 4–1 to ": null
    },
    {
        "Derby County": "derby county f.c."
    },
    {
        " at ": null
    },
    {
        "Wembley": "wembley stadium"
    },
    {
        ". Charltons Bert Turner scored an own goal in the eightieth minute before equalising for the Addicks a minute later to take them into extra time, but they conceded three further goals in the extra period. Cameron, Home and Away with Charlton Athletic 1910–2004, p.112. When the full league programme resumed in 1946–47 Charlton could finish only 19th in the First Division, just above the relegation spots, but they made amends with their performance in the FA Cup, reaching the ": null
    },
    {
        "1947 FA Cup Final": "1947 fa cup final"
    },
    {
        ". This time they were successful, beating ": null
    },
    {
        "Burnley": "burnley f.c."
    },
    {
        " 1–0, with ": null
    },
    {
        "Chris Duffy": "chris duffy"
    },
    {
        " scoring the only goal of the day.  In this period of renewed football attendances, Charlton became one of only thirteen English football teams to average over 40,000 as their attendance during a full season. The Valley was the largest football ground in the League, drawing crowds in excess of 70,000. However, in the 1950s little investment was made either for players or to The Valley, hampering the clubs growth. In 1956, the then board undermined ": null
    },
    {
        "Jimmy Seed": "jimmy seed"
    },
    {
        " and asked for his resignation; Charlton were relegated the following year.     From the late 1950s until the early 1970s, Charlton remained a mainstay of the ": null
    },
    {
        "Second Division": "football league second division"
    },
    {
        " before relegation to the ": null
    },
    {
        "Third Division": "football league third division"
    },
    {
        " in 1972  caused the teams support to drop, and even a promotion in 1975 back to the second division  did little to re-invigorate the teams support and finances. In 1979–80 Charlton were relegated again to the Third Division,  but won immediate promotion back to the Second Division in 1980–81.  Even though it did not feel like it, this was a turning point in the clubs history leading to a period of turbulence and change including further promotion and exile. A change in management and shortly after a change in club ownership Clayton 2001, p.141 led to severe problems, such as the reckless signing of former ": null
    },
    {
        "European Footballer of the Year": "european footballer of the year"
    },
    {
        " Allan Simonsen": "allan simonsen"
    },
    {
        ", and the club looked like it would go out of business. Clayton 2001, pp.142–150       In 1984 financial matters came to a head and the club went into administration, to be reformed as Charlton Athletic. Ltd. although the clubs finances were still far from secure. They were forced to leave the Valley just after the start of the 1985–86 season, after its safety was criticised by Football League officials in the wake of the ": null
    },
    {
        "Bradford City stadium fire": "bradford city stadium fire"
    },
    {
        ".   The club began to groundshare with ": null
    },
    {
        "Crystal Palace": "crystal palace f.c."
    },
    {
        " at ": null
    },
    {
        "Selhurst Park": "selhurst park"
    },
    {
        " and this arrangement looked to be for the long-term, as Charlton did not have enough funds to revamp the Valley to meet safety requirements.        Despite the move away from the Valley, Charlton were promoted to the First Division as Second Division runners-up at the end of 1985–86,  and remained at this level for four years often with late escapes, most notably against ": null
    },
    {
        "Leeds": "leeds united a.f.c."
    },
    {
        " in 1987, where the Addicks triumphed in extra-time of the ": null
    },
    {
        "play-off": "english football league play-offs"
    },
    {
        " final replay to secure their top flight place. In 1987 Charlton also returned to ": null
    },
    {
        "Wembley": "wembley stadium"
    },
    {
        " for the first time since the 1947 FA Cup final for the ": null
    },
    {
        "Full Members Cup": "full members cup"
    },
    {
        " final against ": null
    },
    {
        "Blackburn": "blackburn rovers f.c."
    },
    {
        ". Clayton 2001, p.156   Eventually, Charlton were relegated in 1990 along with Sheffield Wednesday and bottom club Millwall. Manager ": null
    },
    {
        "Lennie Lawrence": "lennie lawrence"
    },
    {
        " remained in charge for one more season before he accepted an offer to take charge of ": null
    },
    {
        "Middlesbrough": "middlesbrough f.c."
    },
    {
        ". He was replaced by joint player-managers ": null
    },
    {
        "Alan Curbishley": "alan curbishley"
    },
    {
        " and ": null
    },
    {
        "Steve Gritt": "steve gritt"
    },
    {
        ". The pair had unexpected success in their first season finishing just outside the play-offs, and ": null
    },
    {
        "1992–93": "1992–93 in english football"
    },
    {
        " began promisingly and Charlton looked good bets for promotion in the new Division One . However, the club was forced to sell players such as ": null
    },
    {
        "Rob Lee": "rob lee"
    },
    {
        " to help pay for a return to the Valley, while club fans formed the Valley Party, nominating candidates to stand in local elections in 1990, pressing the local council to enable the clubs return to the Valley - finally achieved in December 1992.     There was a tragedy at the club late in the 1992–93 season. Defender ": null
    },
    {
        "Tommy Caton": "tommy caton"
    },
    {
        ", who had been out of action due to injury since January 1991, announced his retirement from playing on medical advice in March 1993 having failed to recover full fitness, and he died suddenly at the end of the following month at the age of 30.       In 1995, new chairman ": null
    },
    {
        "Richard Murray": "richard murray"
    },
    {
        " appointed Alan Curbishley as sole manager of Charlton.  Under his sole leadership Charlton made an appearance in the play-off in 1996 but were eliminated by Crystal Palace in the semi-finals and the following season brought a disappointing 15th-place finish. ": null
    },
    {
        "1997–98": "1997–98 in english football"
    },
    {
        " was Charltons best season for years. They reached the Division One play-off final and battled against ": null
    },
    {
        "Sunderland": "sunderland a.f.c."
    },
    {
        " in a thrilling game which ended with a 4–4 draw after extra time. Charlton won 7–6 on penalties,  with the match described as arguably the most dramatic game of football in Wembleys history ,   Wembley Stadium and were promoted to the ": null
    },
    {
        "Premier League": "premier league"
    },
    {
        ".     Charltons first Premier League campaign began promisingly but they were unable to keep up their good form and were soon battling relegation. The battle was lost on the final day of the season but the clubs board kept faith in Curbishley, confident that they could bounce back. Curbishley rewarded the chairmans loyalty with the Division One title in 2000 which signalled a return to the Premier League.      After the clubs return, Curbishley proved an astute spender and by 2003 he had succeeded in establishing Charlton in the top flight. Charlton spent much of the ": null
    },
    {
        "2003–04 Premier League": "2003–04 premier league"
    },
    {
        " season challenging for a ": null
    },
    {
        "Champions League": "uefa champions league"
    },
    {
        " place, but a late-season slump in form and the sale of star player ": null
    },
    {
        "Scott Parker": "scott parker"
    },
    {
        " to ": null
    },
    {
        "Chelsea": "chelsea f.c."
    },
    {
        ", left Charlton in seventh place,  which was still the clubs highest finish since the 1950s. Charlton were unable to build on this level of achievement and Curbishley departed in 2006, with the club still established as a solid mid-table side.      In May 2006, ": null
    },
    {
        "Iain Dowie": "iain dowie"
    },
    {
        " was named as Curbishleys successor,  but was sacked after 12 league matches in November 2006, with only two wins.  ": null
    },
    {
        "Les Reed": "les reed"
    },
    {
        " replaced Dowie as manager,  however he too failed to improve Charltons position in the league table and on Christmas Eve 2006, Reed was replaced by former player ": null
    },
    {
        "Alan Pardew": "alan pardew"
    },
    {
        ".  Although results did improve, Pardew was unable to keep Charlton up and relegation was confirmed in the penultimate match of the season.        Charltons return to ": null
    },
    {
        "the second tier of English football": "efl championship"
    },
    {
        " was a disappointment, with their promotion campaign tailing off to an 11th-place finish. Early in the following season the Addicks were linked with a foreign takeover,  but this was swiftly denied by the club. On 10 October 2008, Charlton received an indicative offer for the club from a Dubai-based diversified investment company. However, the deal later fell through. The full significance of this soon became apparent as the club recorded net losses of over £13  million for that financial year. Pardew left on 22 November after a 2–5 home loss to Sheffield United that saw the team fall into the relegation places.  Matters did not improve under caretaker manager ": null
    },
    {
        "Phil Parkinson": "phil parkinson"
    },
    {
        ", and the team went a club record 18 games without a win, a new club record, before finally achieving a 1–0 away victory over ": null
    },
    {
        "Norwich City": "norwich city f.c."
    },
    {
        " in an FA Cup Third Round replay; Parkinson was hired on a permanent basis. The team were relegated to League One after a 2–2 draw against Blackpool on 18 April 2009.      After spending almost the entire 2009–10 season in the top six of League One, Charlton were defeated in the ": null
    },
    {
        "Football League One play-offs": "football league one play-offs"
    },
    {
        " semi-final second leg on penalties against Swindon Town.         After a change in ownership, Parkinson and Charlton legend ": null
    },
    {
        "Mark Kinsella": "mark kinsella"
    },
    {
        " left after a poor run of results. Another Charlton legend, ": null
    },
    {
        "Chris Powell": "chris powell"
    },
    {
        ", was appointed manager of the club in January 2011, winning his first game in charge 2–0 over Plymouth at the Valley. This was Charltons first league win since November. Powells bright start continued with a further three victories, before running into a downturn which saw the club go 11 games in succession without a win. Yet the fans respect for Powell saw him come under remarkably little criticism. The clubs fortunes picked up towards the end of the season, but leaving them far short of the play-offs. In a busy summer, Powell brought in 19 new players and after a successful season, on 14 April 2012, Charlton Athletic won promotion back to the Championship with a 1–0 away win at ": null
    },
    {
        "Carlisle United": "carlisle united"
    },
    {
        ". A week later, on 21 April 2012, they were confirmed as champions after a 2–1 home win over ": null
    },
    {
        "Wycombe Wanderers": "wycombe wanderers"
    },
    {
        ". Charlton then lifted the League One trophy on 5 May 2012, having been in the top position since 15 September 2011, and after recording a 3–2 victory over ": null
    },
    {
        "Hartlepool United": "hartlepool united"
    },
    {
        ", recorded their highest ever league points score of 101, the highest in any professional European league that year.     In the first season back in the Championship, the 2012–13 season saw Charlton finish ninth place with 65 points, just three points short of the play-off places to the Premier League.       In early January 2014 during the 2013–14 season, Belgian businessman ": null
    },
    {
        "Roland Duchâtelet": "roland duchâtelet"
    },
    {
        " took over Charlton as owner in a deal worth £14million. This made Charlton a part of a network of football clubs owned by Duchâtelet. On 11 March 2014, two days after an FA Cup quarter-final loss to Sheffield United, and with Charlton sitting bottom of the table, Powell was sacked and leaked private emails suggested that this was due to a rift with the owner.      New manager ": null
    },
    {
        "Jose Riga": "jose riga"
    },
    {
        ", despite having to join Charlton long after the transfer window had closed, was able to improve Charltons form and eventually guide them to 18th place, successfully avoiding relegation. After Rigas departure to manage Blackpool, former Millwall player ": null
    },
    {
        "Bob Peeters": "bob peeters"
    },
    {
        " was appointed as manager in May 2014 on a 12-month contract. Charlton started strong, but a long run of draws meant that after only 25 games in charge Peeters was dismissed with the team in 14th place.   His replacement, ": null
    },
    {
        "Guy Luzon": "guy luzon"
    },
    {
        ", ensured there was no relegation battle by winning most of the remaining matches, resulting in a 12th-place finish.     The 2015–16 season began promisingly but results under Luzon deteriorated and on 24 October 2015 after a 3–0 defeat at home to ": null
    },
    {
        "Brentford": "brentford f.c."
    },
    {
        " he was sacked.  Luzon said in a  News Shopper  interview that he was not the one who chose how to do the recruitment as the reason why he failed as manager.  ": null
    },
    {
        "Karel Fraeye": "karel fraeye"
    },
    {
        " was appointed interim head coach ,  but was sacked after 14 games and just two wins, with the club then second from bottom in the Championship.  On 14 January 2016, Jose Riga was appointed head coach for a second spell,  but could not prevent Charlton from being relegated to ": null
    },
    {
        "League One": "efl league one"
    },
    {
        " for the 2016–17 season.  Riga resigned at the end of the season.  To many fans, the managerial changes and subsequent relegation to League One were symptomatic of the mismanagement of the club under Duchâtelets ownership and several protests began.       After a slow start to the new season, with the club in 15th place of League One, the club announced that it had parted company with ": null
    },
    {
        "Russell Slade": "russell slade"
    },
    {
        " in November 2016.  Karl Robinson was appointed on a permanent basis soon after.  He led the Addicks to an uneventful 13th-place finish. The following season Robinson had the team challenging for the play-offs, but a drop in form in March led him to resign by mutual consent. He was replaced by former player ": null
    },
    {
        "Lee Bowyer": "lee bowyer"
    },
    {
        " as caretaker manager who guided them to a 6th-place finish, but lost in the play-off semi-final.     Bowyer was appointed permanently in September on a one-year contract and after finishing third in the regular ": null
    },
    {
        "2018-19 EFL League One": "2018-19 efl league one"
    },
    {
        " season, Charlton beat ": null
    },
    {
        "Sunderland": "sunderland a.f.c."
    },
    {
        " 2–1 in the League One play-off final to earn promotion back to the ": null
    },
    {
        "EFL Championship": "efl championship"
    },
    {
        " after a three-season absence.        On 29 November 2019, Charlton Athletic was acquired from Duchâtelet by East Street Investments, subject to approval from the English Football League.                The clubs first ground was Siemens Meadow , a patch of rough ground by the River Thames. This was over-shadowed by the ": null
    },
    {
        "Siemens Brothers": "siemens brothers"
    },
    {
        " Telegraph Works. Then followed ": null
    },
    {
        "Woolwich Common": "woolwich common"
    },
    {
        " , Pound Park , and Angerstein Lane . After the end of the First World War, a chalk quarry known as the Swamps was identified as Charltons new ground, and in the summer of 1919 work began to create the level playing area and remove debris from the site. The first match at this site, now known as the clubs current ground The Valley, was in September 1919. Charlton stayed at The Valley until 1923, when the club moved to ": null
    },
    {
        "The Mount stadium": "the mount stadium"
    },
    {
        " in ": null
    },
    {
        "Catford": "catford"
    },
    {
        " as part of a proposed merger with Catford Southend Football Club. However, after this move collapsed in 1924 Charlton returned to The Valley.     During the 1930s and 1940s, significant improvements were made to the ground, making it one of the largest in the country at that time. In 1938 the highest attendance to date at the ground was recorded at over 75,000 for a ": null
    },
    {
        "FA Cup": "fa cup"
    },
    {
        " match against ": null
    },
    {
        "Aston Villa": "aston villa f.c."
    },
    {
        ". During the 1940s and 1950s the attendance was often above 40,000, and Charlton had one of the largest support bases in the country. However, after the clubs relegation little investment was made in The Valley as it fell into decline.     In the 1980s matters came to a head as the ownership of the club and The Valley was divided. The large East Terrace had been closed down by the authorities after the ": null
    },
    {
        "Bradford City stadium fire": "bradford city stadium fire"
    },
    {
        " and the grounds owner wanted to use part of the site for housing. In September 1985, Charlton made the controversial move to ground-share with South London neighbours ": null
    },
    {
        "Crystal Palace": "crystal palace f.c."
    },
    {
        " at ": null
    },
    {
        "Selhurst Park": "selhurst park"
    },
    {
        ". This move was unpopular with supporters and in the late 1980s significant steps were taken to bring about the clubs return to The Valley.     A ": null
    },
    {
        "single issue": "single-issue politics"
    },
    {
        " political party, the Valley Party, contested the 1990 local ": null
    },
    {
        "Greenwich Borough Council": "royal borough of greenwich"
    },
    {
        " elections on a ticket of reopening the stadium, capturing 11% of the vote, aiding the clubs return. The Valley Gold investment scheme was created to help supporters fund the return to The Valley, and several players were also sold to raise funds. For the 1991–92 season and part of the 1992–93 season, the Addicks played at ": null
    },
    {
        "West Hams": "west ham united f.c."
    },
    {
        " Upton Park": "the boleyn ground"
    },
    {
        "  as ": null
    },
    {
        "Wimbledon": "wimbledon f.c."
    },
    {
        " had moved into Selhurst Park alongside Crystal Palace. Charlton finally returned to The Valley in December 1992, celebrating with a 1–0 victory against ": null
    },
    {
        "Portsmouth": "portsmouth f.c."
    },
    {
        ".      Since the return to The Valley, three sides of the ground have been completely redeveloped turning The Valley into a modern, all-seater stadium with a 27,111 capacity. There are plans in place to increase the grounds capacity to approximately 31,000 and even around 40,000 in the future.        The bulk of the clubs support base comes from South East London and Kent, particularly the London boroughs of Greenwich, Bexley and Bromley. Supporters played a key role in the return of the club to The Valley in 1992 and were rewarded by being granted a voice on the board in the form of an elected supporter director. Any season ticket holder could put themselves forward for election, with a certain number of nominations, and votes were cast by all season ticket holders over the age of 18. The last such director, Ben Hayes,  was elected in 2006 to serve until 2008, when the role was discontinued as a result of legal issues. Its functions were replaced by a fans forum  which met for the first time in December 2008 and is still active to this day.         Charltons most common nickname is The Addicks. The most likely origin of this name is from a local fishmonger, Arthur Ikey Bryan, who rewarded the team with meals of haddock and chips. Clayton 2001, p.10     The progression of the nickname can be seen in the book The Addicks Cartoons: An Affectionate Look into the Early History of Charlton Athletic, which covers the pre-First World War history of Charlton through a narrative based on 56 cartoons which appeared in the now defunct Kentish Independent. The very first cartoon, from 31 October 1908, calls the team the Haddocks. By 1910, the name had changed to Addicks although it also appeared as Haddick. The club also have two other nicknames, The Red Robins, adopted in 1931, and The Valiants, chosen in a fan competition in the 1960s which also led to the adoption of the sword badge which is still in use. The Addicks nickname never went away and was revived by fans after the club lost its Valley home in 1985 and went into exile at ": null
    },
    {
        "Crystal Palace": "crystal palace f.c."
    },
    {
        ". It is now once again the official nickname of the club.     Charlton fans chants have included Valley, Floyd Road , a song noting the stadiums address to the tune of ": null
    },
    {
        "Mull of Kintyre": "mull of kintyre"
    },
    {
        " , and The Red, Red Robin .        Charlton Athletic featured in the ": null
    },
    {
        "ITV": "itv"
    },
    {
        " one-off drama Alberts Memorial, shown on 12 September 2010 and starring ": null
    },
    {
        "David Jason": "david jason"
    },
    {
        " and ": null
    },
    {
        "David Warner": "david warner"
    },
    {
        ".      In the long-running BBC sitcom  Only Fools and Horses , ": null
    },
    {
        "Rodney Charlton Trotter": "rodney trotter"
    },
    {
        " is named after the club. ": null
    }
]