[
    {
        "                    Sir Charles Spencer Chaplin  was an English comic actor, filmmaker, and composer who rose to fame in the era of ": null
    },
    {
        "silent film": "silent film"
    },
    {
        ". He became a worldwide icon through his screen persona, ": null
    },
    {
        "The Tramp": "the tramp"
    },
    {
        " , and is considered one of the most important figures in the history of the film industry. His career spanned more than 75 years, from childhood in the Victorian era until a year before his death in 1977, and encompassed both adulation and controversy.     Chaplins childhood in London was one of poverty and hardship, as his father was absent and his mother struggled financially, and he was sent to a ": null
    },
    {
        "workhouse": "workhouse"
    },
    {
        " twice before the age of nine. When he was 14, his mother was committed to a mental asylum. Chaplin began performing at an early age, touring ": null
    },
    {
        "music halls": "music hall"
    },
    {
        "and later working as a stage actor and comedian. At 19, he was signed to the prestigious ": null
    },
    {
        "Fred Karno": "fred karno"
    },
    {
        " company, which took him to America. He was scouted for the film industry and began appearing in 1914 for ": null
    },
    {
        "Keystone Studios": "keystone studios"
    },
    {
        ". He soon developed the Tramp persona and formed a large fan base. He directed his own films and continued to hone his craft as he moved to the ": null
    },
    {
        "Essanay": "essanay studios"
    },
    {
        ", ": null
    },
    {
        "Mutual": "mutual film"
    },
    {
        ", and ": null
    },
    {
        "First National": "first national pictures"
    },
    {
        " corporations. By 1918, he was one of the best-known figures in the world.     In 1919, Chaplin co-founded the distribution company ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        ", which gave him complete control over his films. His first feature-length film was  The Kid  , followed by  A Woman of Paris  ,  The Gold Rush  , and  The Circus  . He refused to move to sound films in the 1930s, instead producing  City Lights  and  Modern Times  without dialogue. He became increasingly political, and his next film,  The Great Dictator , satirized ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ". The 1940s were a decade marked with controversy for Chaplin, and his popularity declined rapidly. He was accused of communist sympathies, while he created scandal through his involvement in a paternity suit and his marriages to much younger women. An FBI investigation was opened, and Chaplin was forced to leave the United States and settle in Switzerland. He abandoned the Tramp in his later films, which include  Monsieur Verdoux  ,  Limelight  ,  A King in New York  , and  A Countess from Hong Kong  .     Chaplin wrote, directed, produced, edited, starred in, and composed the music for most of his films. He was a perfectionist, and his financial independence enabled him to spend years on the development and production of a picture. His films are characterized by slapstick combined with pathos, typified in the Tramps struggles against adversity. Many contain social and political themes, as well as autobiographical elements. He received an Honorary Academy Award for the incalculable effect he has had in making motion pictures the art form of this century in 1972, as part of a renewed appreciation for his work. He continues to be held in high regard, with The Gold Rush, City Lights, Modern Times, and The Great Dictator often ranked on lists of the greatest films of all time.             Charles Spencer Chaplin was born on 16 April 1889 to ": null
    },
    {
        "Hannah Chaplin": "hannah chaplin"
    },
    {
        " and ": null
    },
    {
        "Charles Chaplin Sr": "charles chaplin sr"
    },
    {
        ". There is no official record of his birth, although Chaplin believed he was born at ": null
    },
    {
        "East Street": "east street"
    },
    {
        ", ": null
    },
    {
        "Walworth": "walworth"
    },
    {
        ", in ": null
    },
    {
        "South London": "south london"
    },
    {
        ". His mother and father had married four years previously, at which time Charles Sr. became the legal guardian of Hannahs illegitimate son, ": null
    },
    {
        "Sydney John Hill": "sydney chaplin"
    },
    {
        ". At the time of his birth, Chaplins parents were both ": null
    },
    {
        "music hall": "music hall"
    },
    {
        " entertainers. Hannah, the daughter of a shoemaker, had a brief and unsuccessful career under the stage name Lily Harley, while Charles Sr., a butchers son, was a popular singer. Although they never divorced, Chaplins parents were estranged by around 1891. The following year, Hannah gave birth to a third son – ": null
    },
    {
        "George Wheeler Dryden": "wheeler dryden"
    },
    {
        " – fathered by the music hall entertainer ": null
    },
    {
        "Leo Dryden": "leo dryden"
    },
    {
        ". The child was taken by Dryden at six months old, and did not re-enter Chaplins life for 30 years.          Chaplins childhood was fraught with poverty and hardship, making his eventual trajectory the most dramatic of all the rags to riches stories ever told according to his authorised biographer ": null
    },
    {
        "David Robinson": "david robinson"
    },
    {
        ". Chaplins early years were spent with his mother and brother Sydney in the London district of ": null
    },
    {
        "Kennington": "kennington"
    },
    {
        "; Hannah had no means of income, other than occasional nursing and dressmaking, and Chaplin Sr. provided no financial support. As the situation deteriorated, Chaplin was sent to ": null
    },
    {
        "Lambeth Workhouse": "lambeth workhouse"
    },
    {
        " when he was seven years old. The council housed him at the ": null
    },
    {
        "Central London District School": "central london district school"
    },
    {
        " for ": null
    },
    {
        "paupers": "pauperism"
    },
    {
        ", which Chaplin remembered as a forlorn existence . He was briefly reunited with his mother 18 months later, before Hannah was forced to readmit her family to the workhouse in July 1898. The boys were promptly sent to ": null
    },
    {
        "Norwood": "west norwood"
    },
    {
        " Schools, another institution for destitute children.          In September 1898, Hannah was committed to ": null
    },
    {
        "Cane Hill": "cane hill hospital"
    },
    {
        " mental asylum – she had developed a ": null
    },
    {
        "psychosis": "psychosis"
    },
    {
        " seemingly brought on by an infection of ": null
    },
    {
        "syphilis": "syphilis"
    },
    {
        " and malnutrition. For the two months she was there, Chaplin and his brother Sydney were sent to live with their father, whom the young boys scarcely knew. Charles Sr. was by then a severe alcoholic, and life there was bad enough to provoke a visit from the ": null
    },
    {
        "National Society for the Prevention of Cruelty to Children": "national society for the prevention of cruelty to children"
    },
    {
        ". Chaplins father died two years later, at 38 years old, from ": null
    },
    {
        "cirrhosis": "cirrhosis"
    },
    {
        " of the liver.     Hannah entered a period of remission but, in May 1903, became ill again. Chaplin, then 14, had the task of taking his mother to the infirmary, from where she was sent back to Cane Hill. He lived alone for several days, searching for food and occasionally sleeping rough, until Sydney – who had enrolled in the Navy two years earlier – returned. Hannah was released from the asylum eight months later, but in March 1905, her illness returned, this time permanently. There was nothing we could do but accept poor mothers fate , Chaplin later wrote, and she remained in care until her death in 1928.            Between his time in the poor schools and his mother succumbing to mental illness, Chaplin began to perform on stage. He later recalled making his first amateur appearance at the age of five years, when he took over from Hannah one night in ": null
    },
    {
        "Aldershot": "aldershot"
    },
    {
        ". This was an isolated occurrence, but by the time he was nine Chaplin had, with his mothers encouragement, grown interested in performing. He later wrote: imbued me with the feeling that I had some sort of talent . Through his fathers connections, Chaplin became a member of the ": null
    },
    {
        "Eight Lancashire Lads": "the eight lancashire lads"
    },
    {
        " clog-dancing": "clog dance"
    },
    {
        " troupe, with whom he toured English music halls throughout 1899 and 1900. Chaplin worked hard, and the act was popular with audiences, but he was not satisfied with dancing and wished to form a comedy act.     In the years Chaplin was touring with the Eight Lancashire Lads, his mother ensured that he still attended school but, by age 13, he had abandoned education.  He supported himself with a range of jobs, while nursing his ambition to become an actor. At 14, shortly after his mothers relapse, he registered with a theatrical agency in Londons ": null
    },
    {
        "West End": "west end of london"
    },
    {
        ". The manager sensed potential in Chaplin, who was promptly given his first role as a newsboy in ": null
    },
    {
        "Harry Arthur Saintsburys": "harry arthur saintsbury"
    },
    {
        " Jim, a Romance of Cockayne. It opened in July 1903, but the show was unsuccessful and closed after two weeks. Chaplins comic performance, however, was singled out for praise in many of the reviews.     Saintsbury secured a role for Chaplin in ": null
    },
    {
        "Charles Frohmans": "charles frohman"
    },
    {
        "production of  Sherlock Holmes , where he played Billy the pageboy in three nationwide tours. His performance was so well received that he was called to London to play the role alongside ": null
    },
    {
        "William Gillette": "william gillette"
    },
    {
        ", the original Holmes. It was like tidings from heaven , Chaplin recalled. At 16 years old, Chaplin starred in the plays West End production at the ": null
    },
    {
        "Duke of Yorks Theatre": "duke of yorks theatre"
    },
    {
        " from October to December 1905. He completed one final tour of Sherlock Holmes in early 1906, before leaving the play after more than two-and-a-half years.       Chaplin soon found work with a new company, and went on tour with his brother – who was also pursuing an acting career – in a ": null
    },
    {
        "comedy sketch": "sketch comedy"
    },
    {
        " called Repairs. In May 1906, Chaplin joined the juvenile act Caseys Circus, where he developed popular ": null
    },
    {
        "burlesque": "burlesque"
    },
    {
        " pieces and was soon the star of the show. By the time the act finished touring in July 1907, the 18-year-old had become an accomplished comedic performer. He struggled to find more work, however, and a brief attempt at a solo act was a failure.          Meanwhile, Sydney Chaplin had joined ": null
    },
    {
        "Fred Karnos": "fred karno"
    },
    {
        "prestigious comedy company in 1906 and, by 1908, he was one of their key performers. In February, he managed to secure a two-week trial for his younger brother. Karno was initially wary, and considered Chaplin a pale, puny, sullen-looking youngster who looked much too shy to do any good in the theatre.  However, the teenager made an impact on his first night at the ": null
    },
    {
        "London Coliseum": "london coliseum"
    },
    {
        " and he was quickly signed to a contract. Chaplin began by playing a series of minor parts, eventually progressing to starring roles in 1909. In April 1910, he was given the lead in a new sketch, Jimmy the Fearless. It was a big success, and Chaplin received considerable press attention.     Karno selected his new star to join the section of the company, one that also included ": null
    },
    {
        "Stan Laurel": "stan laurel"
    },
    {
        ", that toured North Americas ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        " circuit. The young comedian headed the show and impressed reviewers, being described as one of the best pantomime artists ever seen here . His most successful role was a drunk called the Inebriate Swell , which drew him significant recognition. The tour lasted 21 months, and the troupe returned to England in June 1912. Chaplin recalled that he had a disquieting feeling of sinking back into a depressing commonplaceness and was, therefore, delighted when a new tour began in October.           Six months into the second American tour, Chaplin was invited to join the New York Motion Picture Company. A representative who had seen his performances thought he could replace ": null
    },
    {
        "Fred Mace": "fred mace"
    },
    {
        ", a star of their ": null
    },
    {
        "Keystone Studios": "keystone studios"
    },
    {
        " who intended to leave. Chaplin thought the Keystone comedies a crude mélange of rough and rumble , but liked the idea of working in films and rationalised: Besides, it would mean a new life.  He met with the company and signed a $150-per-week contract in September 1913. Chaplin arrived in Los Angeles in early December, and began working for the Keystone studio on 5 January 1914.           Chaplins boss was ": null
    },
    {
        "Mack Sennett": "mack sennett"
    },
    {
        ", who initially expressed concern that the 24-year-old looked too young. He was not used in a picture until late January, during which time Chaplin attempted to learn the processes of filmmaking. The ": null
    },
    {
        "one-reeler": "film reel"
    },
    {
        "  Making a Living  marked his film acting debut and was released on 2 February 1914. Chaplin strongly disliked the picture, but one review picked him out as a comedian of the first water . For his second appearance in front of the camera, Chaplin selected the costume with which he became identified. He described the process in his autobiography:          The film was  Mabels Strange Predicament , but ": null
    },
    {
        "the Tramp": "the tramp"
    },
    {
        " character, as it became known, debuted to audiences in  Kid Auto Races at Venice  – shot later than Mabels Strange Predicament but released two days earlier on 7 February 1914. Chaplin adopted the character as his screen persona and attempted to make suggestions for the films he appeared in. These ideas were dismissed by his directors. During the filming of his eleventh picture,  Mabel at the Wheel , he clashed with director ": null
    },
    {
        "Mabel Normand": "mabel normand"
    },
    {
        " and was almost released from his contract. Sennett kept him on, however, when he received orders from exhibitors for more Chaplin films. Chaplin, C. . My Autobiography. New York: Simon and Schuster. Sennett also allowed Chaplin to direct his next film himself after Chaplin promised to pay $1,500  if the film was unsuccessful.      Caught in the Rain , issued 4 May 1914, was Chaplins directorial debut and was highly successful. Thereafter he directed almost every short film in which he appeared for Keystone, at the rate of approximately one per week, a period which he later remembered as the most exciting time of his career. Chaplins films introduced a slower form of comedy than the typical Keystone farce, and he developed a large fan base. In November 1914, he had a supporting role in the first ": null
    },
    {
        "feature length": "feature length"
    },
    {
        " comedy film,  Tillies Punctured Romance , directed by Sennett and starring ": null
    },
    {
        "Marie Dressler": "marie dressler"
    },
    {
        ", which was a commercial success and increased his popularity. When Chaplins contract came up for renewal at the end of the year, he asked for $1,000 a week  – an amount Sennett refused as too large.            The ": null
    },
    {
        "Essanay Film Manufacturing Company": "essanay studios"
    },
    {
        " of Chicago sent Chaplin an offer of $1,250 a week with a signing bonus of $10,000. He joined the studio in late December 1914, where he began forming a stock company of regular players, actors he worked with again and again, including ": null
    },
    {
        "Leo White": "leo white"
    },
    {
        ", ": null
    },
    {
        "Bud Jamison": "bud jamison"
    },
    {
        ", Paddy McGuire and Billy Armstrong. He soon recruited a leading lady – ": null
    },
    {
        "Edna Purviance": "edna purviance"
    },
    {
        ", whom Chaplin met in a cafe and hired on account of her beauty. She went on to appear in 35 films with Chaplin over eight years; the pair also formed a romantic relationship that lasted into 1917.     Chaplin asserted a high level of control over his pictures and started to put more time and care into each film. There was a month-long interval between the release of his second production,  A Night Out , and his third,  The Champion . The final seven of Chaplins 14 Essanay films were all produced at this slower pace. Chaplin also began to alter his screen persona, which had attracted some criticism at Keystone for its mean, crude, and brutish nature. The character became more gentle and romantic;  The Tramp  was considered a particular turning point in his development. The use of pathos was developed further with  The Bank , in which Chaplin created a sad ending. Robinson notes that this was an innovation in comedy films, and marked the time when serious critics began to appreciate Chaplins work. At Essanay, writes film scholar ": null
    },
    {
        "Simon Louvish": "simon louvish"
    },
    {
        ", Chaplin found the themes and the settings that would define the Tramps world.      During 1915, Chaplin became a cultural phenomenon. Shops were stocked with Chaplin merchandise, he was featured in cartoons and comic strips, and several songs were written about him. In July, a journalist for  Motion Picture Magazine  wrote that Chaplinitis had spread across America. As his fame grew worldwide, he became the film industrys first international star. When the Essanay contract ended in December 1915, Chaplin – fully aware of his popularity – requested a $150,000 signing bonus from his next studio. He received several offers, including ": null
    },
    {
        "Universal": "universal studios"
    },
    {
        ", ": null
    },
    {
        "Fox": "fox film"
    },
    {
        ", and ": null
    },
    {
        "Vitagraph": "vitagraph studios"
    },
    {
        ", the best of which came from the ": null
    },
    {
        "Mutual Film Corporation": "mutual film"
    },
    {
        " at $10,000 a week.            A contract was negotiated with Mutual that amounted to $670,000 a year ,  which Robinson says made Chaplin – at 26 years old – one of the highest paid people in the world. The high salary shocked the public and was widely reported in the press. John R. Freuler, the studio president, explained: We can afford to pay Mr. Chaplin this large sum annually because the public wants Chaplin and will pay for him.      Mutual gave Chaplin his own Los Angeles studio to work in, which opened in March 1916. He added two key members to his stock company, ": null
    },
    {
        "Albert Austin": "albert austin"
    },
    {
        " and ": null
    },
    {
        "Eric Campbell": "eric campbell"
    },
    {
        ", and produced a series of elaborate two-reelers:  The Floorwalker ,  The Fireman ,  The Vagabond ,  One A.M. , and  The Count . For  The Pawnshop , he recruited the actor ": null
    },
    {
        "Henry Bergman": "henry bergman"
    },
    {
        ", who was to work with Chaplin for 30 years.  Behind the Screen  and  The Rink  completed Chaplins releases for 1916. The Mutual contract stipulated that he release a two-reel film every four weeks, which he had managed to achieve. With the new year, however, Chaplin began to demand more time. He made only four more films for Mutual over the first ten months of 1917:  Easy Street ,  The Cure ,  The Immigrant , and  The Adventurer . With their careful construction, these films are considered by Chaplin scholars to be among his finest work.   Later in life, Chaplin referred to his Mutual years as the happiest period of his career. However, Chaplin also felt that those films became increasingly formulaic over the period of the contract and he was increasingly dissatisfied with the working conditions encouraging that.        Chaplin was attacked in the British media for not fighting in the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        ". He defended himself, claiming that he would fight for Britain if called and had registered for the American draft, but he was not summoned by either country. Despite this criticism Chaplin was a favourite with the troops, and his popularity continued to grow worldwide.  Harpers Weekly  reported that the name of Charlie Chaplin was a part of the common language of almost every country , and that the Tramp image was universally familiar . In 1917, professional Chaplin imitators were so widespread that he took legal action, and it was reported that nine out of ten men who attended costume parties dressed as the Tramp. The same year, a study by the ": null
    },
    {
        "Boston Society for Psychical Research": "boston society for psychical research"
    },
    {
        " concluded that Chaplin was an American obsession . The actress ": null
    },
    {
        "Minnie Maddern Fiske": "minnie maddern fiske"
    },
    {
        " wrote that a constantly increasing body of cultured, artistic people are beginning to regard the young English buffoon, Charles Chaplin, as an extraordinary artist, as well as a comic genius .            In January 1918, Chaplin was visited by leading British singer and comedian ": null
    },
    {
        "Harry Lauder": "harry lauder"
    },
    {
        ", and the two acted in a short film together.  Charlie Chaplin meets Harry Lauder – Rare Archival Footage , Roy Export Company Ltd., Association Chaplin via YouTube. Retrieved 1 November 2018.     Mutual was patient with Chaplins decreased rate of output, and the contract ended amicably. With his aforementioned concern about the declining quality of his films because of contract scheduling stipulations, Chaplins primary concern in finding a new distributor was independence; Sydney Chaplin, then his business manager, told the press, Charlie be allowed all the time he needs and all the money for producing the way he wants  ... It is quality, not quantity, we are after.  In June 1917, Chaplin signed to complete eight films for ": null
    },
    {
        "First National Exhibitors Circuit": "first national pictures"
    },
    {
        " in return for $1  million . He chose to build his own studio, situated on five acres of land off ": null
    },
    {
        "Sunset Boulevard": "sunset boulevard"
    },
    {
        ", with production facilities of the highest order. It was completed in January 1918, and Chaplin was given freedom over the making of his pictures.       A Dogs Life , released April 1918, was the first film under the new contract. In it, Chaplin demonstrated his increasing concern with story construction and his treatment of the Tramp as a sort of ": null
    },
    {
        "Pierrot": "pierrot"
    },
    {
        " . The film was described by ": null
    },
    {
        "Louis Delluc": "louis delluc"
    },
    {
        " as cinemas first total work of art . Chaplin then embarked on the ": null
    },
    {
        "Third Liberty Bond": "liberty bondsales difficulties and the subsequent campaign"
    },
    {
        " campaign, touring the United States for one month to raise money for the Allies of the First World War. He also produced a short ": null
    },
    {
        "propaganda": "propaganda"
    },
    {
        " film at his own expense, donated to the government for fund-raising, called  The Bond . Chaplins next release was war-based, placing the Tramp in the trenches for  Shoulder Arms . Associates warned him against making a comedy about the war but, as he later recalled: Dangerous or not, the idea excited me.  He spent four months filming the 45-minute-long picture, which was released in October 1918 with great success.     The KidShoulder Arms, Chaplin requested more money from First National, which was refused. Frustrated with their lack of concern for quality, and worried about rumours of a possible merger between the company and ": null
    },
    {
        "Famous Players-Lasky": "famous players-lasky"
    },
    {
        ", Chaplin joined forces with ": null
    },
    {
        "Douglas Fairbanks": "douglas fairbanks"
    },
    {
        ", ": null
    },
    {
        "Mary Pickford": "mary pickford"
    },
    {
        ", and ": null
    },
    {
        "D. W. Griffith": "d. w. griffith"
    },
    {
        " to form a new distribution company – ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        ", established in January 1919. The arrangement was revolutionary in the film industry, as it enabled the four partners – all creative artists – to personally fund their pictures and have complete control. Chaplin was eager to start with the new company and offered to buy out his contract with First National. They refused and insisted that he complete the final six films owed.          Before the creation of United Artists, Chaplin married for the first time. The 16-year-old actress ": null
    },
    {
        "Mildred Harris": "mildred harris"
    },
    {
        " had revealed that she was pregnant with his child, and in September 1918, he married her quietly in Los Angeles to avoid controversy. Soon after, the pregnancy was found to be false. Chaplin was unhappy with the union and, feeling that marriage stunted his creativity, struggled over the production of his film  Sunnyside . Harris was by then legitimately pregnant, and on 7 July 1919, gave birth to a son. Norman Spencer Chaplin was born malformed and died three days later. The marriage ended in April 1920, with Chaplin explaining in his autobiography that they were irreconcilably mismated .     Losing the child, plus his own childhood experiences, are thought to have influenced Chaplins film, which turned the Tramp into the caretaker of a young boy.  For this new venture, Chaplin also wished to do more than comedy and, according to Louvish, make his mark on a changed world.  Filming on  The Kid  began in August 1919, with four-year-old ": null
    },
    {
        "Jackie Coogan": "jackie coogan"
    },
    {
        " his co-star. The Kid was in production for nine months until May 1920 and, at 68 minutes, it was Chaplins longest picture to date. Dealing with issues of poverty and parent–child separation, The Kid was one of the earliest films to combine comedy and drama. It was released in January 1921 with instant success, and, by 1924, had been screened in over 50 countries.     Chaplin spent five months on his next film, the two-reeler  The Idle Class . Following its September 1921 release, he chose to return to England for the first time in almost a decade. He then worked to fulfil his First National contract, releasing  Pay Day  in February 1922.  The Pilgrim  – his final short film – was delayed by distribution disagreements with the studio, and released a year later.       A Woman of Paris and The Gold Rush A Woman of Paris , a romantic drama about ill-fated lovers. Chaplin intended it to be a star-making vehicle for Edna Purviance, and did not appear in the picture himself other than in a brief, uncredited cameo. He wished the film to have a realistic feel and directed his cast to give restrained performances. In real life, he explained, men and women try to hide their emotions rather than seek to express them . A Woman of Paris premiered in September 1923 and was acclaimed for its innovative, subtle approach. The public, however, seemed to have little interest in a Chaplin film without Chaplin, and it was a ": null
    },
    {
        "box office disappointment": "box office bomb"
    },
    {
        ". The filmmaker was hurt by this failure – he had long wanted to produce a dramatic film and was proud of the result – and soon withdrew A Woman of Paris from circulation.          Chaplin returned to comedy for his next project. Setting his standards high, he told himself This next film must be an epic! The Greatest!  Inspired by a photograph of the 1898 ": null
    },
    {
        "Klondike Gold Rush": "klondike gold rush"
    },
    {
        ", and later the story of the ": null
    },
    {
        "Donner Party": "donner party"
    },
    {
        " of 1846–47, he made what Geoffrey Macnab calls an epic comedy out of grim subject matter.  In  The Gold Rush , the Tramp is a lonely ": null
    },
    {
        "prospector": "prospecting"
    },
    {
        " fighting adversity and looking for love. With ": null
    },
    {
        "Georgia Hale": "georgia hale"
    },
    {
        " as his new leading lady, Chaplin began filming the picture in February 1924. Its elaborate production, costing almost $1 million, included ": null
    },
    {
        "location shooting": "location shooting"
    },
    {
        " in the ": null
    },
    {
        "Truckee mountains": "truckee range"
    },
    {
        " in ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        " with 600 extras, extravagant sets, and ": null
    },
    {
        "special effect": "special effect"
    },
    {
        "s. The last scene was shot May 1925 after 15 months of filming.     Chaplin felt The Gold Rush was the best film he had made. It opened in August 1925 and became one of the highest-grossing films of the silent era with a U.S. box-office of $5 million. The comedy contains some of Chaplins most famous sequences, such as the Tramp eating his shoe and the Dance of the Rolls . Macnab has called it the quintessential Chaplin film . Chaplin stated at its release, This is the picture that I want to be remembered by .     The Circus     While making The Gold Rush, Chaplin married for the second time. Mirroring the circumstances of his first union, ": null
    },
    {
        "Lita Grey": "lita grey"
    },
    {
        " was a teenage actress, originally set to star in the film, whose surprise announcement of pregnancy forced Chaplin into marriage. She was 16 and he was 35, meaning Chaplin could have been charged with ": null
    },
    {
        "statutory rape": "statutory rape"
    },
    {
        " under California law. He therefore arranged a discreet marriage in Mexico on 25 November 1924. Their first son, ": null
    },
    {
        "Charles Spencer Chaplin, Jr.": "charles chaplin jr."
    },
    {
        ", was born on 5 May 1925, followed by ": null
    },
    {
        "Sydney Earl Chaplin": "sydney chaplin"
    },
    {
        " on 30 March 1926.     It was an unhappy marriage, and Chaplin spent long hours at the studio to avoid seeing his wife. In November 1926, Grey took the children and left the family home. A bitter divorce followed, in which Greys application – accusing Chaplin of infidelity, abuse, and of harbouring perverted sexual desires – was leaked to the press. Chaplin was reported to be in a state of nervous breakdown, as the story became headline news and groups formed across America calling for his films to be banned. Eager to end the case without further scandal, Chaplins lawyers agreed to a cash settlement of $600,000the largest awarded by American courts at that time. His fan base was strong enough to survive the incident, and it was soon forgotten, but Chaplin was deeply affected by it.     Before the divorce suit was filed, Chaplin had begun work on a new film,  The Circus . He built a story around the idea of walking a tightrope while besieged by monkeys, and turned the Tramp into the accidental star of a circus. Filming was suspended for 10 months while he dealt with the divorce scandal, and it was generally a trouble-ridden production. Finally completed in October 1927, The Circus was released in January 1928 to a positive reception. At the ": null
    },
    {
        "1st Academy Awards": "1st academy awards"
    },
    {
        ", Chaplin was given a special trophy For versatility and genius in acting, writing, directing and producing The Circus .  Despite its success, he permanently associated the film with the stress of its production; Chaplin omitted The Circus from his autobiography, and struggled to work on it when he recorded the score in his later years.     City Lights     By the time The Circus was released, Hollywood had witnessed the introduction of ": null
    },
    {
        "sound film": "sound film"
    },
    {
        "s. Chaplin was cynical about this new medium and the technical shortcomings it presented, believing that talkies lacked the artistry of silent films. He was also hesitant to change the formula that had brought him such success, and feared that giving the Tramp a voice would limit his international appeal. He, therefore, rejected the new Hollywood craze and began work on a new silent film. Chaplin was nonetheless anxious about this decision and remained so throughout the films production.          When filming began at the end of 1928, Chaplin had been working on the story for almost a year.  City Lights  followed the Tramps love for a blind flower girl  and his efforts to raise money for her sight-saving operation. It was a challenging production that lasted 21 months, with Chaplin later confessing that he had worked himself into a neurotic state of wanting perfection . One advantage Chaplin found in sound technology was the opportunity to record a musical score for the film, which he composed himself.      Chaplin finished editing City Lights in December 1930, by which time silent films were an anachronism. A preview before an unsuspecting public audience was not a success, but a showing for the press produced positive reviews. One journalist wrote, Nobody in the world but Charlie Chaplin could have done it. He is the only person that has that peculiar something called audience appeal in sufficient quality to defy the popular penchant for movies that talk.  Given its general release in January 1931, City Lights proved to be a popular and financial success – eventually grossing over $3 million. The ": null
    },
    {
        "British Film Institute": "british film institute"
    },
    {
        " cites it as Chaplins finest accomplishment, and the critic ": null
    },
    {
        "James Agee": "james agee"
    },
    {
        " hails the closing scene as the greatest piece of acting and the highest moment in movies .   City Lights became Chaplins personal favourite of his films and remained so throughout his life.     Modern TimesCity Lights had been a success, but Chaplin was unsure if he could make another picture without dialogue. He remained convinced that sound would not work in his films, but was also obsessed by a depressing fear of being old-fashioned.  In this state of uncertainty, early in 1931, the comedian decided to take a holiday and ended up travelling for 16 months. He spent months travelling Western Europe, including extended stays in France and Switzerland, and spontaneously decided to visit Japan. The day after he arrived in Japan, Prime Minister ": null
    },
    {
        "Inukai Tsuyoshi": "inukai tsuyoshi"
    },
    {
        " was assassinated by ultra-nationalists in the ": null
    },
    {
        "May 15 Incident": "may 15 incident"
    },
    {
        ". The groups original plan had been to provoke a war with the United States by assassinating Chaplin at a welcome reception organised by the prime minister, but the plan had been foiled due to delayed public announcement of the events date.          In his autobiography, Chaplin recalled that on his return to Los Angeles, I was confused and without plan, restless and conscious of an extreme loneliness . He briefly considered retiring and moving to China. Chaplins loneliness was relieved when he met 21-year-old actress ": null
    },
    {
        "Paulette Goddard": "paulette goddard"
    },
    {
        " in July 1932, and the pair began a relationship. He was not ready to commit to a film, however, and focused on writing a ": null
    },
    {
        "serial": "serial"
    },
    {
        " about his travels . The trip had been a stimulating experience for Chaplin, including meetings with several prominent thinkers, and he became increasingly interested in world affairs. The state of labour in America troubled him, and he feared that capitalism and machinery in the workplace would increase unemployment levels. It was these concerns that stimulated Chaplin to develop his new film.      Modern Times  was announced by Chaplin as a satire on certain phases of our industrial life.  Featuring the Tramp and Goddard as they endure the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ", it took ten and a half months to film. Chaplin intended to use spoken dialogue but changed his mind during rehearsals. Like its predecessor, Modern Times employed sound effects but almost no speaking. Chaplins performance of a gibberish song did, however, give the Tramp a voice for the only time on film. After recording the music, Chaplin released Modern Times in February 1936. It was his first feature in 15 years to adopt political references and social realism, a factor that attracted considerable press coverage despite Chaplins attempts to downplay the issue. The film earned less at the box-office than his previous features and received mixed reviews, as some viewers disliked the politicising. Today, Modern Times is seen by the British Film Institute as one of Chaplins great features, while David Robinson says it shows the filmmaker at his unrivalled peak as a creator of visual comedy.      Following the release of Modern Times, Chaplin left with Goddard for a trip to the Far East. The couple had refused to comment on the nature of their relationship, and it was not known whether they were married or not. Some time later, Chaplin revealed that they married in ": null
    },
    {
        "Canton": "guangzhou"
    },
    {
        " during this trip. By 1938, the couple had drifted apart, as both focused heavily on their work, although Goddard was again his leading lady in his next feature film, The Great Dictator. She eventually divorced Chaplin in Mexico in 1942, citing incompatibility and separation for more than a year.       The Great Dictator     The 1940s saw Chaplin face a series of controversies, both in his work and in his personal life, which changed his fortunes and severely affected his popularity in the United States. The first of these was his growing boldness in expressing his political beliefs. Deeply disturbed by the ": null
    },
    {
        "surge of militaristic nationalism": "para-fascism"
    },
    {
        " in 1930s world politics, Chaplin found that he could not keep these issues out of his work. Parallels between himself and ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " had been widely noted: the pair were born four days apart, both had risen from poverty to world prominence, and Hitler wore the same ": null
    },
    {
        "toothbrush moustache": "toothbrush moustache"
    },
    {
        " as Chaplin. It was this physical resemblance that supplied the plot for Chaplins next film,  The Great Dictator , which directly satirised Hitler and attacked fascism.     Chaplin spent two years developing the script, and began filming in September 1939 – six days after Britain declared war on Germany. He had submitted to using spoken dialogue, partly out of acceptance that he had no other choice, but also because he recognised it as a better method for delivering a political message. Making a comedy about Hitler was seen as highly controversial, but Chaplins financial independence allowed him to take the risk. I was determined to go ahead, he later wrote, for Hitler must be laughed at.  Chaplin replaced the Tramp with A Jewish Barber , a reference to the Nazi partys belief that he was Jewish.  In a dual performance, he also played the dictator Adenoid Hynkel , who parodied Hitler.     The Great Dictator spent a year in production and was released in October 1940. The film generated a vast amount of publicity, with a critic for  The New York Times  calling it the most eagerly awaited picture of the year , and it was one of the biggest money-makers of the era. The ending was unpopular, however, and generated controversy. Chaplin concluded the film with a five-minute speech in which he abandoned his barber character, looked directly into the camera, and pleaded against war and fascism. Charles J. Maland has identified this overt preaching as triggering a decline in Chaplins popularity, and writes, Henceforth, no movie fan would ever be able to separate the dimension of politics from star image . The Great Dictator received five Academy Award nominations, including ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        ", ": null
    },
    {
        "Best Original Screenplay": "academy award for best original screenplay"
    },
    {
        " and ": null
    },
    {
        "Best Actor": "academy award for best actor"
    },
    {
        ".        In the mid-1940s, Chaplin was involved in a series of trials that occupied most of his time and significantly affected his public image. The troubles stemmed from his affair with an aspirant actress named ": null
    },
    {
        "Joan Barry": "joan barry"
    },
    {
        ", with whom he was involved intermittently between June 1941 and the autumn of 1942. Barry, who displayed obsessive behaviour and was twice arrested after they separated, reappeared the following year and announced that she was pregnant with Chaplins child. As Chaplin denied the claim, Barry filed a ": null
    },
    {
        "paternity suit": "paternity suit"
    },
    {
        " against him.     The director of the ": null
    },
    {
        "Federal Bureau of Investigation": "federal bureau of investigation"
    },
    {
        " , ": null
    },
    {
        "J. Edgar Hoover": "j. edgar hoover"
    },
    {
        ", who had long been suspicious of Chaplins political leanings, used the opportunity to generate negative publicity about him. As part of a ": null
    },
    {
        "smear campaign": "smear campaign"
    },
    {
        " to damage Chaplins image, the FBI named him in four ": null
    },
    {
        "indictments": "indictment"
    },
    {
        "related to the Barry case. Most serious of these was an alleged violation of the ": null
    },
    {
        "Mann Act": "mann act"
    },
    {
        ", which prohibits the transportation of women across state boundaries for sexual purposes. The historian ": null
    },
    {
        "Otto Friedrich": "otto friedrich"
    },
    {
        " has called this an absurd prosecution of an ancient statute , yet if Chaplin was found guilty, he faced 23 years in jail. Three charges lacked sufficient evidence to proceed to court, but the Mann Act trial began on 21 March 1944. Associated Press, Tentative Jury In Chaplin Case – British Nationality Of Actor Made Issue , The San Bernardino Daily Sun, San Bernardino, California, 22 March 1944, Vol. 50, p. 1. Chaplin was ": null
    },
    {
        "acquitted": "acquittal"
    },
    {
        " two weeks later, on 4 April. Associated Press, Chaplin Acquitted Amid Cheers, Applause – Actor Chokes With Emotion as Court Fight Won , The San Bernardino Daily Sun, San Bernardino, California, Wednesday 5 April 1944, Volume 50, p. 1.  The case was frequently headline news, with  Newsweek  calling it the biggest public relations scandal since the ": null
    },
    {
        "Fatty Arbuckle": "roscoe arbuckle"
    },
    {
        " murder trial in 1921.           Barrys child, Carol Ann, was born in October 1944, and the paternity suit went to court in February 1945. After two arduous trials, in which the prosecuting lawyer accused him of ": null
    },
    {
        "moral turpitude": "moral turpitude"
    },
    {
        " , Chaplin was declared to be the father. Evidence from blood tests which indicated otherwise were not admissible, and the judge ordered Chaplin to pay child support until Carol Ann turned 21. Media coverage of the paternity suit was influenced by the FBI, as information was fed to the prominent gossip columnist ": null
    },
    {
        "Hedda Hopper": "hedda hopper"
    },
    {
        ", and Chaplin was portrayed in an overwhelmingly critical light.     The controversy surrounding Chaplin increased when, two weeks after the paternity suit was filed, it was announced that he had married his newest ": null
    },
    {
        "protégée": "protégée"
    },
    {
        ", 18-year-old ": null
    },
    {
        "Oona ONeill": "oona oneill"
    },
    {
        " – daughter of the American playwright ": null
    },
    {
        "Eugene ONeill": "eugene oneill"
    },
    {
        ". Chaplin, then 54, had been introduced to her by a film agent seven months earlier. In his autobiography, Chaplin described meeting ONeill as the happiest event of my life , and claimed to have found perfect love . Chaplins son, Charles Jr., reported that Oona worshipped his father. The couple remained married until Chaplins death, and had eight children over 18 years: ": null
    },
    {
        "Geraldine Leigh": "geraldine chaplin"
    },
    {
        " , ": null
    },
    {
        "Michael John": "michael chaplin"
    },
    {
        " , ": null
    },
    {
        "Josephine Hannah": "josephine chaplin"
    },
    {
        " , ": null
    },
    {
        "Victoria": "victoria chaplin"
    },
    {
        " , ": null
    },
    {
        "Eugene Anthony": "eugene chaplin"
    },
    {
        " , Jane Cecil , Annette Emily , and ": null
    },
    {
        "Christopher James": "christopher chaplin"
    },
    {
        " .     Monsieur Verdoux and communist accusations     Chaplin claimed that the Barry trials had crippled creativeness , and it was some time before he began working again. In April 1946, he finally began filming a project that had been in development since 1942.  Monsieur Verdoux  was a ": null
    },
    {
        "black comedy": "black comedy"
    },
    {
        ", the story of a French bank clerk, Verdoux , who loses his job and begins marrying and murdering wealthy widows to support his family. Chaplins inspiration for the project came from ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        ", who wanted him to star in a film about the French ": null
    },
    {
        "serial killer": "serial killer"
    },
    {
        " Henri Désiré Landru": "henri désiré landru"
    },
    {
        ". Chaplin decided that the concept would make a wonderful comedy , and paid Welles $5,000 for the idea.     Chaplin again vocalised his political views in Monsieur Verdoux, criticising ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        " and arguing that the world encourages mass killing through wars and ": null
    },
    {
        "weapons of mass destruction": "weapon of mass destruction"
    },
    {
        ". Because of this, the film met with controversy when it was released in April 1947; Chaplin was booed at the premiere, and there were calls for a boycott. Monsieur Verdoux was the first Chaplin release that failed both critically and commercially in the United States. It was more successful abroad, and Chaplins screenplay was nominated at the ": null
    },
    {
        "Academy Awards": "20th academy awards"
    },
    {
        ". He was proud of the film, writing in his autobiography, Monsieur Verdoux is the cleverest and most brilliant film I have yet made.      The negative reaction to Monsieur Verdoux was largely the result of changes in Chaplins public image. Along with damage of the Joan Barry scandal, he was publicly accused of being a ": null
    },
    {
        "communist": "communist"
    },
    {
        ". His political activity had heightened during World War II, when he campaigned for the opening of a Second Front to help the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and supported various Soviet–American friendship groups. He was also friendly with several suspected communists, and attended functions given by Soviet diplomats in Los Angeles. In the political climate of 1940s America, such activities meant Chaplin was considered, as Larcher writes, dangerously ": null
    },
    {
        "progressive": "progressivism"
    },
    {
        " and amoral.  The FBI wanted him out of the country, and launched an official investigation in early 1947.     Chaplin denied being a communist, instead calling himself a peacemonger , but felt the governments effort to suppress the ideology was an unacceptable infringement of ": null
    },
    {
        "civil liberties": "civil liberties"
    },
    {
        ". Unwilling to be quiet about the issue, he openly protested against the trials of ": null
    },
    {
        "Communist Party": "communist party usa"
    },
    {
        " members and the activities of the ": null
    },
    {
        "House Un-American Activities Committee": "house un-american activities committee"
    },
    {
        ". Chaplin received a ": null
    },
    {
        "subpoena": "subpoena"
    },
    {
        " to appear before HUAC but was not called to testify. As his activities were widely reported in the press, and ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " fears grew, questions were raised over his failure to take American citizenship. Calls were made for him to be deported; in one extreme and widely published example, Representative ": null
    },
    {
        "John E. Rankin": "john e. rankin"
    },
    {
        ", who helped establish HUAC, told ": null
    },
    {
        "Congress": "united states congress"
    },
    {
        " in June 1947: very life in Hollywood is detrimental to the moral fabric of America.  ... his loathsome pictures can be kept from before the eyes of the American youth. He should be deported and gotten rid of at once.      Limelight and banning from the United States     Although Chaplin remained politically active in the years following the failure of Monsieur Verdoux, his next film, about a forgotten vaudeville comedian and a young ballerina in ": null
    },
    {
        "Edwardian": "edwardian era"
    },
    {
        " London, was devoid of political themes.  Limelight  was heavily autobiographical, alluding not only to Chaplins childhood and the lives of his parents, but also to his loss of popularity in the United States. The cast included various members of his family, including his five oldest children and his half-brother, Wheeler Dryden.     Filming began in November 1951, by which time Chaplin had spent three years working on the story. He aimed for a more serious tone than any of his previous films, regularly using the word melancholy when explaining his plans to his co-star ": null
    },
    {
        "Claire Bloom": "claire bloom"
    },
    {
        ". Limelight featured a cameo appearance from ": null
    },
    {
        "Buster Keaton": "buster keaton"
    },
    {
        ", whom Chaplin cast as his stage partner in a pantomime scene. This marked the only time the comedians worked together.     Chaplin decided to hold the world premiere of Limelight in London, since it was the setting of the film. As he left Los Angeles, he expressed a premonition that he would not be returning. At New York, he boarded the  with his family on 18 September 1952. The next day, ": null
    },
    {
        "attorney general": "united states attorney general"
    },
    {
        " James P. McGranery": "james p. mcgranery"
    },
    {
        " revoked Chaplins ": null
    },
    {
        "re-entry permit": "re-entry permit"
    },
    {
        " and stated that he would have to submit to an interview concerning his political views and moral behaviour in order to re-enter the US. Although McGranery told the press that he had a pretty good case against Chaplin , Maland has concluded, on the basis of the FBI files that were released in the 1980s, that the US government had no real evidence to prevent Chaplins re-entry. It is likely that he would have gained entry if he had applied for it. However, when Chaplin received a cablegram informing him of the news, he privately decided to cut his ties with the United States:          Because all of his property remained in America, Chaplin refrained from saying anything negative about the incident to the press. The scandal attracted vast attention, but Chaplin and his film were warmly received in Europe. In America, the hostility towards him continued, and, although it received some positive reviews, Limelight was subjected to a wide-scale boycott. Reflecting on this, Maland writes that Chaplins fall, from an unprecedented level of popularity, may be the most dramatic in the history of stardom in America .       A King in New York     Chaplin did not attempt to return to the United States after his re-entry permit was revoked, and instead sent his wife to settle his affairs. The couple decided to settle in Switzerland and, in January 1953, the family moved into their permanent home: ": null
    },
    {
        "Manoir de Ban": "manoir de ban"
    },
    {
        ", a  estate  overlooking ": null
    },
    {
        "Lake Geneva": "lake geneva"
    },
    {
        " in ": null
    },
    {
        "Corsier-sur-Vevey": "corsier-sur-vevey"
    },
    {
        ". Chaplin put his Beverly Hills house and studio up for sale in March, and surrendered his re-entry permit in April. The next year, his wife renounced her US citizenship and became a British citizen. Chaplin severed the last of his professional ties with the United States in 1955, when he sold the remainder of his stock in United Artists, which had been in financial difficulty since the early 1940s.     Chaplin remained a controversial figure throughout the 1950s, especially after he was awarded the ": null
    },
    {
        "International Peace Prize": "world peace council prizes"
    },
    {
        " by the communist-led ": null
    },
    {
        "World Peace Council": "world peace council"
    },
    {
        ", and after his meetings with ": null
    },
    {
        "Zhou Enlai": "zhou enlai"
    },
    {
        " and ": null
    },
    {
        "Nikita Khrushchev": "nikita khrushchev"
    },
    {
        ". He began developing his first European film,  A King in New York , in 1954. Casting himself as an exiled king who seeks asylum in the United States, Chaplin included several of his recent experiences in the screenplay. His son, Michael, was cast as a boy whose parents are targeted by the FBI, while Chaplins character faces accusations of communism. The political satire parodied HUAC and attacked elements of 1950s culture – including consumerism, plastic surgery, and wide-screen cinema. In a review, the playwright ": null
    },
    {
        "John Osborne": "john osborne"
    },
    {
        " called it Chaplins most bitter and most openly personal film. In a 1957 interview, when asked to clarify his political views, Chaplin stated As for politics, I am an ": null
    },
    {
        "anarchist": "anarchist"
    },
    {
        ". I hate government and rules - and fetters ... People must be free.      Chaplin founded a new production company, Attica, and used ": null
    },
    {
        "Shepperton Studios": "shepperton studios"
    },
    {
        " for the shooting. Filming in England proved a difficult experience, as he was used to his own Hollywood studio and familiar crew, and no longer had limitless production time. According to Robinson, this had an effect on the quality of the film. A King in New York was released in September 1957, and received mixed reviews. Chaplin banned American journalists from its Paris première and decided not to release the film in the United States. This severely limited its revenue, although it achieved moderate commercial success in Europe. A King in New York was not shown in America until 1973.            In the last two decades of his career, Chaplin concentrated on re-editing and scoring his old films for re-release, along with securing their ownership and distribution rights. In an interview he granted in 1959, the year of his 70th birthday, Chaplin stated that there was still room for the Little Man in the atomic age . The first of these re-releases was  The Chaplin Revue  , which included new versions of A Dogs Life, Shoulder Arms, and The Pilgrim.     In America, the political atmosphere began to change and attention was once again directed to Chaplins films instead of his views. In July 1962, The New York Times published an editorial stating that we do not believe the Republic would be in danger if yesterdays unforgotten little tramp were allowed to amble down the gangplank of a steamer or plane in an American port . The same month, Chaplin was invested with the ": null
    },
    {
        "honorary degree": "honorary degree"
    },
    {
        " of ": null
    },
    {
        "Doctor of Letters": "doctor of letters"
    },
    {
        " by the universities of ": null
    },
    {
        "Oxford": "university of oxford"
    },
    {
        " and ": null
    },
    {
        "Durham": "durham university"
    },
    {
        ". In November 1963, the Plaza Theater in New York started a year-long series of Chaplins films, including Monsieur Verdoux and Limelight, which gained excellent reviews from American critics. September 1964 saw the release of Chaplins memoirs,  My Autobiography , which he had been working on since 1957. The 500-page book became a worldwide best-seller. It focused on his early years and personal life, and was criticised for lacking information on his film career.      Shortly after the publication of his memoirs, Chaplin began work on  A Countess from Hong Kong  , a romantic comedy based on a script he had written for Paulette Goddard in the 1930s. Set on an ocean liner, it starred ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        " as an American ambassador and ": null
    },
    {
        "Sophia Loren": "sophia loren"
    },
    {
        " as a stowaway found in his cabin. The film differed from Chaplins earlier productions in several aspects. It was his first to use ": null
    },
    {
        "Technicolor": "technicolor"
    },
    {
        " and the ": null
    },
    {
        "widescreen": "widescreen"
    },
    {
        " format, while he concentrated on directing and appeared on-screen only in a cameo role as a seasick steward. He also signed a deal with ": null
    },
    {
        "Universal Pictures": "universal studios"
    },
    {
        " and appointed his assistant, Jerome Epstein, as the producer. Chaplin was paid $600,000 directors fee as well as a percentage of the gross receipts. A Countess from Hong Kong premiered in January 1967, to unfavourable reviews, and was a box-office failure. Chaplin was deeply hurt by the negative reaction to the film, which turned out to be his last.     Chaplin suffered a series of minor strokes in the late 1960s, which marked the beginning of a slow decline in his health. Despite the setbacks, he was soon writing a new film script,  The Freak , a story of a winged girl found in South America, which he intended as a starring vehicle for his daughter, Victoria. His fragile health prevented the project from being realised. In the early 1970s, Chaplin concentrated on re-releasing his old films, including The Kid and The Circus. In 1971, he was made a ": null
    },
    {
        "Commander of the National Order of the Legion of Honour": "legion of honour"
    },
    {
        " at the ": null
    },
    {
        "Cannes Film Festival": "cannes film festival"
    },
    {
        ". The following year, he was honoured with a special award by the ": null
    },
    {
        "Venice Film Festival": "venice film festival"
    },
    {
        ".          In 1972, the ": null
    },
    {
        "Academy of Motion Picture Arts and Sciences": "academy of motion picture arts and sciences"
    },
    {
        " offered Chaplin an Honorary Award, which Robinson sees as a sign that America wanted to make amends . Chaplin was initially hesitant about accepting but decided to return to the US for the first time in 20 years. The visit attracted a large amount of press coverage and, at the Academy Awards gala, he was given a 12-minute standing ovation, the longest in the Academys history.   Visibly emotional, Chaplin accepted his award for the incalculable effect he has had in making motion pictures the art form of this century .     Although Chaplin still had plans for future film projects, by the mid-1970s he was very frail. He experienced several further strokes, which made it difficult for him to communicate, and he had to use a wheelchair.  His final projects were compiling a pictorial autobiography, My Life in Pictures and scoring A Woman of Paris for re-release in 1976. He also appeared in a documentary about his life, The Gentleman Tramp , directed by Richard Patterson. In the ": null
    },
    {
        "1975 New Year Honours": "1975 new year honours"
    },
    {
        ", Chaplin was awarded a knighthood by Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        ",  though he was too weak to kneel and received the honour in his wheelchair.           By October 1977, Chaplins health had declined to the point that he needed constant care. In the early morning of 25 December 1977, Chaplin died at home after suffering a stroke in his sleep. He was 88 years old. The funeral, on 27 December, was a small and private ": null
    },
    {
        "Anglican": "anglicanism"
    },
    {
        " ceremony, according to his wishes. Chaplin was interred in the Corsier-sur-Vevey cemetery. Among the film industrys tributes, director ": null
    },
    {
        "René Clair": "rené clair"
    },
    {
        " wrote, He was a monument of the cinema, of all countries and all times  ... the most beautiful gift the cinema made to us.  Actor ": null
    },
    {
        "Bob Hope": "bob hope"
    },
    {
        " declared, We were lucky to have lived in his time.      On 1 March 1978, Chaplins coffin was dug up and stolen from its grave by two unemployed immigrants, Roman Wardas, from Poland, and Gantcho Ganev, from Bulgaria. The body was held for ": null
    },
    {
        "ransom": "ransom"
    },
    {
        " in an attempt to extort money from Oona Chaplin. The pair were caught in a large police operation in May, and Chaplins coffin was found buried in a field in the nearby village of ": null
    },
    {
        "Noville": "noville, switzerland"
    },
    {
        ". It was re-interred in the Corsier cemetery surrounded by reinforced concrete.           Chaplin believed his first influence to be his mother, who entertained him as a child by sitting at the window and mimicking passers-by: it was through watching her that I learned not only how to express emotions with my hands and face, but also how to observe and study people.  Chaplins early years in music hall allowed him to see stage comedians at work; he also attended the Christmas pantomimes at ": null
    },
    {
        "Drury Lane": "theatre royal, drury lane"
    },
    {
        ", where he studied the art of clowning through performers like ": null
    },
    {
        "Dan Leno": "dan leno"
    },
    {
        ". Chaplins years with the Fred Karno company had a formative effect on him as an actor and filmmaker. Simon Louvish writes that the company was his training ground , and it was here that Chaplin learned to vary the pace of his comedy. The concept of mixing pathos with slapstick was learnt from Karno, who also used elements of absurdity that became familiar in Chaplins gags. A round-table   in 1952, first broadcast on BBC Radio on 15 October 1952. From the film industry, Chaplin drew upon the work of the French comedian ": null
    },
    {
        "Max Linder": "max linder"
    },
    {
        ", whose films he greatly admired. In developing the Tramp costume and persona, he was likely inspired by the American vaudeville scene, where tramp characters were common.            Chaplin never spoke more than cursorily about his filmmaking methods, claiming such a thing would be tantamount to a magician spoiling his own illusion. Little was known about his working process throughout his lifetime, but research from film historians – particularly the findings of ": null
    },
    {
        "Kevin Brownlow": "kevin brownlow"
    },
    {
        " and ": null
    },
    {
        "David Gill": "david gill"
    },
    {
        " that were presented in the three-part documentary  Unknown Chaplin  – has since revealed his unique working method.     Until he began making spoken dialogue films with The Great Dictator, Chaplin never shot from a completed script. Many of his early films began with only a vague premise – for example Charlie enters a health spa or Charlie works in a pawn shop.  He then had sets constructed and worked with his stock company to improvise gags and business using them, almost always working the ideas out on film. As ideas were accepted and discarded, a narrative structure would emerge, frequently requiring Chaplin to reshoot an already-completed scene that might have otherwise contradicted the story. From A Woman of Paris onward Chaplin began the filming process with a prepared plot, but Robinson writes that every film up to Modern Times went through many metamorphoses and permutations before the story took its final form.      Producing films in this manner meant Chaplin took longer to complete his pictures than almost any other filmmaker at the time. If he was out of ideas, he often took a break from the shoot, which could last for days, while keeping the studio ready for when inspiration returned. Delaying the process further was Chaplins rigorous perfectionism. According to his friend ": null
    },
    {
        "Ivor Montagu": "ivor montagu"
    },
    {
        ", nothing but perfection would be right for the filmmaker. Because he personally funded his films, Chaplin was at liberty to strive for this goal and shoot as many takes as he wished. The number was often excessive, for instance 53 takes for every finished take in The Kid. For The Immigrant, a 20 minute-short, Chaplin shot 40,000 feet of film – enough for a feature-length.          Describing his working method as sheer perseverance to the point of madness , Chaplin would be completely consumed by the production of a picture. Robinson writes that even in Chaplins later years, his work continued to take precedence over everything and everyone else.  The combination of story improvisation and relentless perfectionism – which resulted in days of effort and thousands of feet of film being wasted, all at enormous expense – often proved taxing for Chaplin who, in frustration, would lash out at his actors and crew.     Chaplin exercised complete control over his pictures, to the extent that he would act out the other roles for his cast, expecting them to imitate him exactly. He personally edited all of his films, trawling through the large amounts of footage to create the exact picture he wanted. As a result of his complete independence, he was identified by the film historian ": null
    },
    {
        "Andrew Sarris": "andrew sarris"
    },
    {
        " as one of the first ": null
    },
    {
        "auteur": "auteurism"
    },
    {
        " filmmakers. Chaplin did receive help, notably from his long-time cinematographer ": null
    },
    {
        "Roland Totheroh": "roland totheroh"
    },
    {
        ", brother Sydney Chaplin, and various ": null
    },
    {
        "assistant directors": "assistant director"
    },
    {
        "such as ": null
    },
    {
        "Harry Crocker": "harry crocker"
    },
    {
        " and ": null
    },
    {
        "Charles Reisner": "charles reisner"
    },
    {
        ".             While Chaplins comedic style is broadly defined as ": null
    },
    {
        "slapstick": "slapstick"
    },
    {
        ", it is considered restrained and intelligent, with the film historian Philip Kemp describing his work as a mix of deft, balletic physical comedy and thoughtful, situation-based gags . Chaplin diverged from conventional slapstick by slowing the pace and exhausting each scene of its comic potential, with more focus on developing the viewers relationship to the characters. Unlike conventional slapstick comedies, Robinson states that the comic moments in Chaplins films centre on the Tramps attitude to the things happening to him: the humour does not come from the Tramp bumping into a tree, but from his lifting his hat to the tree in apology. Dan Kamin writes that Chaplins quirky mannerisms and serious demeanour in the midst of slapstick action are other key aspects of his comedy, while the surreal transformation of objects and the employment of ": null
    },
    {
        "in-camera": "in-camera effect"
    },
    {
        " trickery are also common features.     Chaplins silent films typically follow the Tramps efforts to survive in a hostile world. The character lives in poverty and is frequently treated badly, but remains kind and upbeat; defying his social position, he strives to be seen as a gentleman. As Chaplin said in 1925, The whole point of the Little Fellow is that no matter how down on his ass he is, no matter how well the jackals succeed in tearing him apart, hes still a man of dignity.  The Tramp defies authority figures and gives as good as he gets , leading Robinson and Louvish to see him as a representative for the underprivileged – an ": null
    },
    {
        "everyman": "everyman"
    },
    {
        " turned heroic saviour . Hansmeyer notes that several of Chaplins films end with the homeless and lonely Tramp optimistically  ... into the sunset  ... to continue his journey .          The infusion of ": null
    },
    {
        "pathos": "pathos"
    },
    {
        " is a well-known aspect of Chaplins work, and Larcher notes his reputation for laughter and tears . Sentimentality in his films comes from a variety of sources, with Louvish pinpointing personal failure, societys strictures, economic disaster, and the elements.  Chaplin sometimes drew on tragic events when creating his films, as in the case of The Gold Rush , which was inspired by the fate of the Donner Party. Constance B. Kuriyama has identified serious underlying themes in the early comedies, such as greed  and loss . Chaplin also touched on controversial issues: immigration ; illegitimacy ; and drug use . He often explored these topics ironically, making comedy out of suffering.     Social commentary was a feature of Chaplins films from early in his career, as he portrayed the underdog in a sympathetic light and highlighted the difficulties of the poor. Later, as he developed a keen interest in economics and felt obliged to publicise his views, Chaplin began incorporating overtly political messages into his films. Modern Times depicted factory workers in dismal conditions, The Great Dictator parodied ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " and ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        " and ended in a speech against nationalism, Monsieur Verdoux criticised war and capitalism, and A King in New York attacked ": null
    },
    {
        "McCarthyism": "mccarthyism"
    },
    {
        ".     Several of Chaplins films incorporate autobiographical elements, and the psychologist ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        " believed that Chaplin always plays only himself as he was in his dismal youth . The Kid is thought to reflect Chaplins childhood trauma of being sent into an orphanage, the main characters in Limelight contain elements from the lives of his parents, and A King in New York references Chaplins experiences of being shunned by the United States. Many of his sets, especially in street scenes, bear a strong similarity to Kennington, where he grew up. ": null
    },
    {
        "Stephen M. Weissman": "stephen m. weissman"
    },
    {
        " has argued that Chaplins problematic relationship with his mentally ill mother was often reflected in his female characters and the Tramps desire to save them.     Regarding the structure of Chaplins films, the scholar ": null
    },
    {
        "Gerald Mast": "gerald mast"
    },
    {
        " sees them as consisting of sketches tied together by the same theme and setting, rather than having a tightly unified storyline. Visually, his films are simple and economic, with scenes portrayed as if set on a stage. His approach to filming was described by the art director ": null
    },
    {
        "Eugène Lourié": "eugène lourié"
    },
    {
        ": Chaplin did not think in artistic images when he was shooting. He believed that action is the main thing. The camera is there to photograph the actors . In his autobiography, Chaplin wrote, Simplicity is best  ... pompous effects slow up action, are boring and unpleasant  ... The camera should not intrude.  This approach has prompted criticism, since the 1940s, for being old fashioned , while the film scholar Donald McCaffrey sees it as an indication that Chaplin never completely understood film as a medium. Kamin, however, comments that Chaplins comedic talent would not be enough to remain funny on screen if he did not have an ability to conceive and direct scenes specifically for the film medium .            Chaplin developed a passion for music as a child and taught himself to play the piano, violin, and cello. He considered the musical accompaniment of a film to be important, and from A Woman of Paris onwards he took an increasing interest in this area. With the advent of sound technology, Chaplin began using a synchronised orchestral soundtrack – composed by himself – for City Lights . He thereafter composed the scores for all of his films, and from the late 1950s to his death, he scored all of his silent features and some of his short films.     As Chaplin was not a trained musician, he could not read sheet music and needed the help of professional composers, such as ": null
    },
    {
        "David Raksin": "david raksin"
    },
    {
        ", ": null
    },
    {
        "Raymond Rasch": "raymond rasch"
    },
    {
        " and ": null
    },
    {
        "Eric James": "eric james"
    },
    {
        ", when creating his scores. Musical directors were employed to oversee the recording process, such as ": null
    },
    {
        "Alfred Newman": "alfred newman"
    },
    {
        " for City Lights. Although some critics have claimed that credit for his film music should be given to the composers who worked with him, Raksin – who worked with Chaplin on Modern Times – stressed Chaplins creative position and active participation in the composing process. This process, which could take months, would start with Chaplin describing to the composer exactly what he wanted and singing or playing tunes he had improvised on the piano. These tunes were then developed further in a close collaboration among the composer and Chaplin. According to film historian ": null
    },
    {
        "Jeffrey Vance": "jeffrey vance"
    },
    {
        ", although he relied upon associates to arrange varied and complex instrumentation, the musical imperative is his, and not a note in a Chaplin musical score was placed there without his assent. Vance, Jeffrey . Chaplin the Composer: An Excerpt from Chaplin: Genius of the Cinema . Variety Special Advertising Supplement, pp. 20–21.     Chaplins compositions produced three popular songs. ": null
    },
    {
        "Smile": "smile"
    },
    {
        " , composed originally for Modern Times and later set to lyrics by ": null
    },
    {
        "John Turner": "john turner"
    },
    {
        " and ": null
    },
    {
        "Geoffrey Parsons": "geoffrey parsons"
    },
    {
        ", was a hit for ": null
    },
    {
        "Nat King Cole": "nat king cole"
    },
    {
        " in 1954. For Limelight, Chaplin composed Terrys Theme , which was popularised by ": null
    },
    {
        "Jimmy Young": "jimmy young"
    },
    {
        " as ": null
    },
    {
        "Eternally": "eternally"
    },
    {
        " . Finally, ": null
    },
    {
        "This Is My Song": "this is my song"
    },
    {
        " , performed by ": null
    },
    {
        "Petula Clark": "petula clark"
    },
    {
        " for A Countess from Hong Kong , reached number one on the UK and other European charts. Hennessy, Mike . Chaplins Song Catches Fire in Europe . Billboard, p. 60. Chaplin also received his only competitive Oscar for his composition work, as the Limelight theme won an ": null
    },
    {
        "Academy Award for Best Original Score": "academy award for best original score"
    },
    {
        " in 1973 following the films re-release.           In 1998, the film critic ": null
    },
    {
        "Andrew Sarris": "andrew sarris"
    },
    {
        " called Chaplin arguably the single most important artist produced by the cinema, certainly its most extraordinary performer and probably still its most universal icon . He is described by the British Film Institute as a towering figure in world culture ,  and was included in  Time  magazines list of the ": null
    },
    {
        "100 Most Important People of the 20th Century": "time 100: the most important people of the century"
    },
    {
        " for the laughter to millions and because he more or less invented global recognizability and helped turn an industry into an art .      The image of the Tramp has become a part of cultural history; according to Simon Louvish, the character is recognisable to people who have never seen a Chaplin film, and in places where his films are never shown. The critic ": null
    },
    {
        "Leonard Maltin": "leonard maltin"
    },
    {
        " has written of the unique and indelible nature of the Tramp, and argued that no other comedian matched his worldwide impact .  Praising the character, ": null
    },
    {
        "Richard Schickel": "richard schickel"
    },
    {
        " suggests that Chaplins films with the Tramp contain the most eloquent, richly comedic expressions of the human spirit in movie history. Memorabilia connected to the character still fetches large sums in auctions: in 2006 a bowler hat and a bamboo cane that were part of the Tramps costume were bought for $140,000 in a Los Angeles auction.      As a filmmaker, Chaplin is considered a pioneer and one of the most influential figures of the early twentieth century. He is often credited as one of the mediums first artists. Film historian ": null
    },
    {
        "Mark Cousins": "mark cousins"
    },
    {
        " has written that Chaplin changed not only the imagery of cinema, but also its sociology and grammar and claims that Chaplin was as important to the development of comedy as a genre as ": null
    },
    {
        "D.W. Griffith": "d. w. griffith"
    },
    {
        " was to drama. He was the first to popularise feature-length comedy and to slow down the pace of action, adding pathos and subtlety to it.  Although his work is mostly classified as slapstick, Chaplins drama A Woman of Paris was a major influence on ": null
    },
    {
        "Ernst Lubitschs": "ernst lubitsch"
    },
    {
        "film  The Marriage Circle  and thus played a part in the development of sophisticated comedy . According to David Robinson, Chaplins innovations were rapidly assimilated to become part of the common practice of film craft.  Filmmakers who cited Chaplin as an influence include ": null
    },
    {
        "Federico Fellini": "federico fellini"
    },
    {
        " , ": null
    },
    {
        "Jacques Tati": "jacques tati"
    },
    {
        " , René Clair , ": null
    },
    {
        "Michael Powell": "michael powell"
    },
    {
        ", ": null
    },
    {
        "Billy Wilder": "billy wilder"
    },
    {
        ",  ": null
    },
    {
        "Vittorio De Sica": "vittorio de sica"
    },
    {
        ", and ": null
    },
    {
        "Richard Attenborough": "richard attenborough"
    },
    {
        ".  Russian filmmaker ": null
    },
    {
        "Andrei Tarkovsky": "andrei tarkovsky"
    },
    {
        " praised Chaplin as the only person to have gone down into cinematic history without any shadow of a doubt. The films he left behind can never grow old.       Chaplin also strongly influenced the work of later comedians. ": null
    },
    {
        "Marcel Marceau": "marcel marceau"
    },
    {
        " said he was inspired to become a mime artist after watching Chaplin, while the actor ": null
    },
    {
        "Raj Kapoor": "raj kapoor"
    },
    {
        " based his screen persona on the Tramp. Mark Cousins has also detected Chaplins comedic style in the French character ": null
    },
    {
        "Monsieur Hulot": "monsieur hulot"
    },
    {
        " and the Italian character ": null
    },
    {
        "Totò": "totò"
    },
    {
        ". In other fields, Chaplin helped inspire the cartoon characters ": null
    },
    {
        "Felix the Cat": "felix the cat"
    },
    {
        " and ": null
    },
    {
        "Mickey Mouse": "mickey mouse"
    },
    {
        ", and was an influence on the ": null
    },
    {
        "Dada": "dada"
    },
    {
        " art movement. As one of the founding members of United Artists, Chaplin also had a role in the development of the film industry. Gerald Mast has written that although UA never became a major company like ": null
    },
    {
        "MGM": "mgm"
    },
    {
        " or ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        ", the idea that directors could produce their own films was years ahead of its time .     In the 21st century, several of Chaplins films are still regarded as classics and among the greatest ever made. The 2012  Sight & Sound  poll, which compiles top ten ballots from film critics and directors to determine each groups most acclaimed films,   saw City Lights rank among the critics top 50, Modern Times inside the top 100, and The Great Dictator and The Gold Rush placed in the top 250.  The top 100 films as voted on by directors included Modern Times at number 22, City Lights at number 30, and The Gold Rush at number 91.  Every one of Chaplins features received a vote.  In 2007, the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        " named City Lights the 11th ": null
    },
    {
        "greatest American film of all time": "afis 100 years...100 movies"
    },
    {
        ", while The Gold Rush and Modern Times again ranked in the top 100.  Books about Chaplin continue to be published regularly, and he is a popular subject for media scholars and film archivists. Many of Chaplins film have had a ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " and ": null
    },
    {
        "Blu-Ray": "blu-ray"
    },
    {
        " release.             Chaplins final home, Manoir de Ban in Corsier-sur-Vevey, Switzerland, has been converted into a museum named ": null
    },
    {
        "Chaplins World": "chaplins world"
    },
    {
        " . It opened on 17 April 2016 after 15 years of development, and is described by ": null
    },
    {
        "Reuters": "reuters"
    },
    {
        " as an interactive museum showcasing the life and works of Charlie Chaplin .  On the 128th anniversary of his birth, a record-setting 662 people dressed as the Tramp in an event organised by the museum.  Previously, the ": null
    },
    {
        "Museum of the Moving Image": "museum of the moving image"
    },
    {
        " in London held a permanent display on Chaplin, and hosted a dedicated exhibition to his life and career in 1988. The ": null
    },
    {
        "London Film Museum": "london film museum"
    },
    {
        " hosted an exhibition called Charlie Chaplin – The Great Londoner, from 2010 until 2013.         In London, a statue of Chaplin as the Tramp, sculpted by ": null
    },
    {
        "John Doubleday": "john doubleday"
    },
    {
        " and unveiled in 1981, is located in ": null
    },
    {
        "Leicester Square": "leicester square"
    },
    {
        ". The city also includes a road named after him in central London, Charlie Chaplin Walk , which is the location of the ": null
    },
    {
        "BFI IMAX": "bfi imax"
    },
    {
        ".  There are nine ": null
    },
    {
        "blue plaques": "blue plaque"
    },
    {
        "memorialising Chaplin in London, Hampshire, and Yorkshire.  The Swiss town of ": null
    },
    {
        "Vevey": "vevey"
    },
    {
        " named a park in his honour in 1980 and erected a statue there in 1982. In 2011, two large murals depicting Chaplin on two 14-storey buildings were also unveiled in Vevey.  Chaplin has also been honoured by the Irish town of ": null
    },
    {
        "Waterville": "waterville, county kerry"
    },
    {
        ", where he spent several summers with his family in the 1960s. A statue was erected in 1998;  since 2011, the town has been host to the annual Charlie Chaplin Comedy Film Festival, which was founded to celebrate Chaplins legacy and to showcase new comic talent.      In other tributes, a ": null
    },
    {
        "minor planet": "minor planet"
    },
    {
        ", ": null
    },
    {
        "3623 Chaplin": "3623 chaplin"
    },
    {
        " – discovered by ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " astronomer ": null
    },
    {
        "Lyudmila Karachkina": "lyudmila karachkina"
    },
    {
        " in 1981 – is named after Chaplin. Throughout the 1980s, the Tramp image was used by ": null
    },
    {
        "IBM": "ibm"
    },
    {
        " to advertise their personal computers. Chaplins 100th birthday anniversary in 1989 was marked with several events around the world, and on 15 April 2011, a day before his 122nd birthday, ": null
    },
    {
        "Google": "google"
    },
    {
        " celebrated him with a special ": null
    },
    {
        "Google Doodle": "google doodle"
    },
    {
        " video on its global and other country-wide homepages.  Many countries, spanning six continents, have honoured Chaplin with a postal stamp.      Chaplins legacy is managed on behalf of his children by the Chaplin office, located in Paris. The office represents Association Chaplin, founded by some of his children to protect the name, image and moral rights to his body of work, Roy Export SAS, which owns the copyright to most of his films made after 1918, and Bubbles Incorporated S.A., which owns the copyrights to his image and name. ;  Their central archive is held at the archives of ": null
    },
    {
        "Montreux": "montreux"
    },
    {
        ", Switzerland and scanned versions of its contents, including 83,630 images, 118 scripts, 976 manuscripts, 7,756 letters, and thousands of other documents, are available for research purposes at the Chaplin Research Centre at the ": null
    },
    {
        "Cineteca di Bologna": "cineteca di bologna"
    },
    {
        ". ; The photographic archive, which includes approximately 10,000 photographs from Chaplins life and career, is kept at the ": null
    },
    {
        "Musée de lElysée": "musée de lélysée"
    },
    {
        " in ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        ", ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ".  The British Film Institute has also established the Charles Chaplin Research Foundation, and the first international Charles Chaplin Conference was held in London in July 2005.             Chaplin is the subject of a ": null
    },
    {
        "biographical film": "biographical film"
    },
    {
        ",  Chaplin  directed by ": null
    },
    {
        "Richard Attenborough": "richard attenborough"
    },
    {
        ", and starring ": null
    },
    {
        "Robert Downey Jr.": "robert downey jr."
    },
    {
        " in the title role and Geraldine Chaplin playing Hannah Chaplin.  He is also a character in the ": null
    },
    {
        "period drama": "historical period drama"
    },
    {
        " film  The Cats Meow  , played by ": null
    },
    {
        "Eddie Izzard": "eddie izzard"
    },
    {
        ", and in the ": null
    },
    {
        "made-for-television movie": "television film"
    },
    {
        "  The Scarlett OHara War  , played by ": null
    },
    {
        "Clive Revill": "clive revill"
    },
    {
        ".   A television series about Chaplins childhood, Young Charlie Chaplin, ran on ": null
    },
    {
        "PBS": "pbs"
    },
    {
        " in 1989, and was nominated for an ": null
    },
    {
        "Emmy Award": "emmy award"
    },
    {
        " for Outstanding Childrens Program.  The French film  The Price of Fame  is a fictionalized account of the robbery of Chaplins grave.      Chaplins life has also been the subject of several stage productions. Two musicals,  Little Tramp  and  Chaplin , were produced in the early 1990s. In 2006, ": null
    },
    {
        "Thomas Meehan": "thomas meehan"
    },
    {
        " and Christopher Curtis created another musical,  Limelight: The Story of Charlie Chaplin , which was first performed at the ": null
    },
    {
        "La Jolla Playhouse": "la jolla playhouse"
    },
    {
        " in San Diego in 2010.  It was adapted for ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " two years later, re-titled Chaplin – A Musical.  Chaplin was portrayed by Robert McClure in both productions. In 2013, two plays about Chaplin premiered in ": null
    },
    {
        "Finland": "finland"
    },
    {
        ": Chaplin at the ": null
    },
    {
        "Svenska Teatern": "swedish theatre"
    },
    {
        ",  and Kulkuri  at the ": null
    },
    {
        "Tampere Workers Theatre": "tampere workers theatre"
    },
    {
        ".      Chaplin has also been characterised in ": null
    },
    {
        "literary fiction": "literary fiction"
    },
    {
        ". He is the protagonist of ": null
    },
    {
        "Robert Coovers": "robert coover"
    },
    {
        "short story Charlie in the House of Rue , and of ": null
    },
    {
        "Glen David Golds": "glen david gold"
    },
    {
        "  Sunnyside  , a ": null
    },
    {
        "historical novel": "historical novel"
    },
    {
        " set in the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        " period.  A day in Chaplins life in 1909 is dramatised in the chapter titled Modern Times in ": null
    },
    {
        "Alan Moores": "alan moore"
    },
    {
        "  Jerusalem  , a novel set in the authors home town of ": null
    },
    {
        "Northampton, England": "northampton, england"
    },
    {
        ".             Chaplin received many awards and honours, especially later in life. In the ": null
    },
    {
        "1975 New Year Honours": "1975 new year honours"
    },
    {
        ", he was appointed a ": null
    },
    {
        "Knight Commander of the Most Excellent Order of the British Empire": "knight commander of the most excellent order of the british empire"
    },
    {
        " .  He was also awarded honorary ": null
    },
    {
        "Doctor of Letters": "doctor of letters"
    },
    {
        " degrees by the University of Oxford and the University of Durham in 1962. In 1965, he and ": null
    },
    {
        "Ingmar Bergman": "ingmar bergman"
    },
    {
        " were joint winners of the ": null
    },
    {
        "Erasmus Prize": "erasmus prize"
    },
    {
        " and, in 1971, he was appointed a Commander of the National Order of the Legion of Honour by the French government.      From the film industry, Chaplin received a special ": null
    },
    {
        "Golden Lion": "golden lion"
    },
    {
        " at the Venice Film Festival in 1972, and a Lifetime Achievement Award from the ": null
    },
    {
        "Lincoln Center Film Society": "film society of lincoln center"
    },
    {
        " the same year. The latter has since been presented annually to filmmakers as The Chaplin Award.  Chaplin was given a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        " in 1972, having been previously excluded because of his political beliefs.     Chaplin received three ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        ": an ": null
    },
    {
        "Honorary Award": "academy honorary award"
    },
    {
        " for versatility and genius in acting, writing, directing, and producing The Circus in 1929, a second Honorary Award for the incalculable effect he has had in making motion pictures the art form of this century in 1972, and a ": null
    },
    {
        "Best Score": "academy award for best original score"
    },
    {
        " award in 1973 for Limelight . He was further nominated in the ": null
    },
    {
        "Best Actor": "academy award for best actor"
    },
    {
        ", ": null
    },
    {
        "Best Original Screenplay": "academy award for best original screenplay"
    },
    {
        ", and ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        " categories for The Great Dictator, and received another Best Original Screenplay nomination for Monsieur Verdoux.  In 1976, Chaplin was made a ": null
    },
    {
        "Fellow": "bafta academy fellowship award"
    },
    {
        " of the ": null
    },
    {
        "British Academy of Film and Television Arts": "british academy of film and television arts"
    },
    {
        " .      Six of Chaplins films have been selected for preservation in the ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        " by the United States ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        ": The Immigrant , The Kid , The Gold Rush , City Lights , Modern Times , and The Great Dictator .             Directed features:  The Kid     A Woman of Paris     The Gold Rush     The Circus     City Lights     Modern Times     The Great Dictator     Monsieur Verdoux     Limelight     A King in New York     A Countess from Hong Kong ": null
    }
]