[
    {
        "     Charles Arnould Tournemire was a ": null
    },
    {
        "French": "france"
    },
    {
        " composer": "composer"
    },
    {
        " and ": null
    },
    {
        "organist": "organist"
    },
    {
        ", notable partly for his ": null
    },
    {
        "improvisation": "improvisation"
    },
    {
        "s which were often rooted in the music of ": null
    },
    {
        "Gregorian chant": "gregorian chant"
    },
    {
        ". His compositions include eight ": null
    },
    {
        "symphonies": "symphony"
    },
    {
        " , four ": null
    },
    {
        "operas": "operas"
    },
    {
        ", twelve chamber works and eighteen piano solos; but he is remembered largely for his organ music, the best known being set of pieces LOrgue Mystique.       Born in ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        ", Tournemire moved in adolescence to Paris, and there became one of ": null
    },
    {
        "César Franck": "césar franck"
    },
    {
        "s three youngest students.      From 42  to 42 Tournemire served as the organiste titulaire at Francks old church, the ": null
    },
    {
        "Basilique Ste-Clotilde, Paris": "basilique ste-clotilde, paris"
    },
    {
        ". He was also professor of Chamber Music at the ": null
    },
    {
        "Paris Conservatoire": "paris conservatoire"
    },
    {
        ". In 42 he published a biography of Franck.     A year before the biography appeared, Tournemire recorded five organ improvisations which were later transcribed by ": null
    },
    {
        "Maurice Duruflé": "maurice duruflé"
    },
    {
        " from ": null
    },
    {
        "phonograph": "phonograph"
    },
    {
        " recordings. Of ten 42-rpm discs which Tournemire made in 42 playing the ": null
    },
    {
        "Aristide Cavaillé-Coll": "aristide cavaillé-coll"
    },
    {
        " organ of Sainte-Clotilde , five contain Franck compositions. This set of discs was awarded the ": null
    },
    {
        "Grand Prix du Disque": "grand prix du disque"
    },
    {
        " on May 42 42 and has been reissued on both LP and CD.     Insofar as Tournemires name is now remembered, it is usually spoken of in connection with his biggest composition: LOrgue Mystique, a group of 42 sets of five pieces each , all written between 42 and 42 This collection covers the cycle of the Roman Catholic liturgical year, each set being based on the Gregorian chants for the day. Unlike the symphonies of ": null
    },
    {
        "Charles-Marie Widor": "charles-marie widor"
    },
    {
        ", which are usually heard in secular recitals , LOrgue Mystique was designed through and through for church use.     Tournemire died in ": null
    },
    {
        "Arcachon": "arcachon"
    },
    {
        ", France in 42 The precise cause of his death is uncertain, as is the exact date .       Jennifer Donelson and Fr. Stephen Schloesser , Mystic Modern: The Life, Thought, and Legacy of Charles Tournemire. Richmond, Virginia: Church Music Association of America, 42  ": null
    },
    {
        "Joël-Marie Fauquet": "joël-marie fauquet"
    },
    {
        ": Catalogue de l’œuvre de Charles Tournemire. Geneva: Minkoff, 42   Pascal Ianco: Charles Tournemire, ou Le mythe de Tristan. Geneva: Papillon, 42    Rollin Smith: Toward an Authentic Interpretation of the Organ Works of César Franck. Chapter 42: The Tournemire Recordings. Juilliard Performance Guide I. New York City: Pendragon Press, 42 .           Contains worklist, though that is the only working link on the page, which has not been updated in eight years .                                                                   ": null
    }
]