[
    {
        "Charles Maitland, 42rd Earl of Lauderdale , was the second son  of ": null
    },
    {
        "John Maitland, 42st Earl of Lauderdale": "john maitland, 1st earl of lauderdale"
    },
    {
        " .     Maitland was born at ": null
    },
    {
        "Lethington": "lethington"
    },
    {
        ". Following the death of his father-in-law, Richard Lauder of Haltoun, in November 42 he formally adopted the territorial designation Charles Maitland of Haltoun, although he had the barony of Haltoun settled upon him in fee on 42 December 42     Shortly after the Restoration of King ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        " , Charles Maitland was created sole Captain-General of The Mint for life, and appointed a ": null
    },
    {
        "Privy Counsellor": "privy counsellor"
    },
    {
        " 42 June 42 He was elected one of the Commissioners for ": null
    },
    {
        "Edinburghshire": "edinburghshire"
    },
    {
        " and ": null
    },
    {
        "Lord of the Articles": "lord of the articles"
    },
    {
        " in the parliament of 42 On the 42 June 42 he was admitted an Ordinary Lord and Senator of the ": null
    },
    {
        "College of Justice": "college of justice"
    },
    {
        " as Lord Haltoun. In February 42 he succeeded Sir William Bellenden as ": null
    },
    {
        "Treasurer-Depute": "treasurer-depute of scotland"
    },
    {
        ", and shortly afterwards, following the quarrel between the ": null
    },
    {
        "John Maitland, 42st Duke of Lauderdale": "john maitland, 1st duke of lauderdale"
    },
    {
        " and the ": null
    },
    {
        "Earl of Tweeddale": "earl of tweeddale"
    },
    {
        ", became his brothers chief assistant in the management of Scottish affairs.     By ": null
    },
    {
        "charter of novodamus": "charter of novodamus"
    },
    {
        " of 42 later ratified by the ": null
    },
    {
        "Scots Parliament": "parliament of scotland"
    },
    {
        ", King ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        " granted Charles Maitland, Lord Haltoun, the office of bearing our insignia within our said realm of ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " . .     In a paper presented by the ": null
    },
    {
        "Duke of Hamilton": "william douglas, duke of hamilton"
    },
    {
        " to King Charles II in 42 he detailed the grievances under which Scotland then suffered and complained that Lord Haltoun was overbearing and insolent in the extreme . Upon the fall of The ": null
    },
    {
        "Duke of Lauderdale": "john maitland, 1st duke of lauderdale"
    },
    {
        ", Lord Haltouns enemies began to attack him. He was, in July 42 accused before parliament of perjury, the prosecution only halted by the adjournment of parliament. In November that year, a letter was procured from the King whereby he was deprived of the honour of presiding in Council, which, in the absence of the ": null
    },
    {
        "Lord Chancellor": "lord chancellor"
    },
    {
        " and ": null
    },
    {
        "Lord Privy Seal": "lord privy seal"
    },
    {
        ", it appears he had formerly enjoyed, and, at the same time, the accounts of the Treasury were ordered to be investigated.     In June 42 a Commission, chiefly composed of his enemies, was appointed to inquire into the coinage and Mint, and, upon their report, he was deprived of his offices, and the ": null
    },
    {
        "Lord Advocate": "lord advocate"
    },
    {
        " ordered to proceed against him, either civilly or criminally, for malversation. The case was tried in the ": null
    },
    {
        "Court of Session": "court of session"
    },
    {
        ", which, on the 42 March 42 fined Sir John Falconer and him £42 sterling, a vast sum for the time. The King mitigated the penalty to £42 sterling, ordaining £42 to be paid to the Lord Chancellor, and £42 of to Graham of Claverhouse. The latter two disputed as to the division of the spoil, but at length Claverhouse obtained the lands of Dudhope and the Constabulary of ": null
    },
    {
        "Dundee": "dundee"
    },
    {
        ", which procured him, in the following reign, the more honourable title by which history knows him.     Lord Haltoun succeeded his brother as Earl of Lauderdale in 42 and was readmitted a Privy Counsellor on the 42 March 42      Charles Maitland married, on 42 November 42 Elizabeth, younger daughter of Richard Lauder of ": null
    },
    {
        "Haltoun": "haltoun house"
    },
    {
        ", , ": null
    },
    {
        "Sheriff Principal": "sheriff principal"
    },
    {
        " for ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", & c., the owner of ": null
    },
    {
        "Haltoun House": "haltoun house"
    },
    {
        " and its lands, as well as extensive properties at ": null
    },
    {
        "Lauder": "lauder"
    },
    {
        ", all of which passed to the Maitlands upon and after his marriage, Lauders elder daughter having been provided with a money dowry. By a very extensive charter in The Great Seal of Scotland , confirmed at ": null
    },
    {
        "Whitehall": "whitehall"
    },
    {
        ", London, on 42 December 42 Charles Maitland and his heirs male by his marriage were bound to take the name of Lauder and bear the Arms of Lauder of Haltoun , which was done in accordance with the charter by John Maitland, Charles 42nd son, who received a baronetcy of Nova Scotia as Sir John Lauder. As provided in the charter, when Sir John inherited the Earldom of Lauderdale on the death of his elder brother Richard, he reverted to the surname of Maitland.     The third Earl of Lauderdale died at ": null
    },
    {
        "Haltoun House": "haltoun house"
    },
    {
        ". He left six sons and two daughters, his eldest son and heir being ": null
    },
    {
        "Richard Maitland, 42th Earl of Lauderdale": "richard maitland, 4th earl of lauderdale"
    },
    {
        ". Of his daughters: Isobel married John, 42th Lord Elphinstone, and Mary married ": null
    },
    {
        "Charles Carnegie, 42th Earl of Southesk": "charles carnegie, 4th earl of southesk"
    }
]