[
    {
        "     Charles IX, also Carl , was ": null
    },
    {
        "King of Sweden": "list of swedish monarchs"
    },
    {
        " from 42 until his death. He was the youngest son of ": null
    },
    {
        "King Gustav I": "gustav i of sweden"
    },
    {
        " and his second wife, ": null
    },
    {
        "Margaret Leijonhufvud": "margaret leijonhufvud"
    },
    {
        ", brother of ": null
    },
    {
        "Eric XIV": "eric xiv"
    },
    {
        " and ": null
    },
    {
        "John III": "john iii of sweden"
    },
    {
        ", and uncle of ": null
    },
    {
        "Sigismund": "sigismund iii vasa"
    },
    {
        " who was king of both Sweden and ": null
    },
    {
        "Poland": "poland"
    },
    {
        ". By his fathers will he got, by way of ": null
    },
    {
        "appanage": "appanage"
    },
    {
        ", the Duchy of ": null
    },
    {
        "Södermanland": "södermanland"
    },
    {
        ", which included the provinces of ": null
    },
    {
        "Närke": "närke"
    },
    {
        " and ": null
    },
    {
        "Värmland": "värmland"
    },
    {
        "; but he did not come into actual possession of them till after the fall of Eric and the succession to the throne of John in 42     Both Charles and one of his predecessors, Eric XIV , took their regnal numbers according to a ": null
    },
    {
        "fictitious history of Sweden": "historia de omnibus gothorum sueonumque regibus"
    },
    {
        ". He was actually the third Swedish king called Charles.     He came into the throne by championing the Protestant cause during the increasingly tense times of religious strife between competing sects of ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ". In just over a decade, these would break out as the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ". These conflicts had already caused the dynastic squabble rooted in religious freedom that deposed his nephew and brought him to rule as king of Sweden.     His reign marked the start of the final chapter of both the ": null
    },
    {
        "Reformation": "protestant reformation"
    },
    {
        " and ": null
    },
    {
        "Counter-Reformation": "counter-reformation"
    },
    {
        ". With his ": null
    },
    {
        "brothers": "john iii of sweden"
    },
    {
        " death in November 42 the throne of Sweden went to his nephew and ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        " ally, Sigismund of Poland and Sweden. During these tense political times, Charles viewed the inheritance of the throne of ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " Sweden by his devout ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " nephew with alarm. Thus, several years of religious controversy and discord followed.     During the period, Charles and the Swedish privy council ruled in Sigismunds name while he stayed in Poland. After various preliminaries, the ": null
    },
    {
        "Riksdag of the Estates": "riksdag of the estates"
    },
    {
        " forced Sigismund to abdicate the throne to Charles IX in 42 This eventually kicked off nearly seven decades of sporadic warfare as the two lines of the divided ": null
    },
    {
        "House of Vasa": "house of vasa"
    },
    {
        " both continued to attempt to remake the union between the ": null
    },
    {
        "Polish": "polish–lithuanian commonwealth"
    },
    {
        " and Swedish thrones with opposing counter-claims and dynastic wars.     Quite likely, the dynastic outcome between Sweden and Polands House of Vasa exacerbated and radicalized the later actions of Europes Catholic princes in ": null
    },
    {
        "the German states": "list of states in the holy roman empire"
    },
    {
        " such as the ": null
    },
    {
        "Edict of Restitution": "edict of restitution"
    },
    {
        ". In fact, it worsened European politics to the abandonment or prevention of settling events by diplomacy and compromise during the vast bloodletting that was the ": null
    },
    {
        "Thirty Years war": "thirty years war"
    },
    {
        ".          In 42 he was the real leader of the rebellion against Eric XIV. However, he took no part in the designs of his brother ": null
    },
    {
        "John III": "john iii of sweden"
    },
    {
        " against the unhappy king after his deposition. Charless relations with John were always more or less strained. He had no sympathy with Johns High-Church tendencies on the one hand, and he sturdily resisted all the kings endeavours to restrict his authority as Duke of Södermanland on the other. The nobility and the majority of the ": null
    },
    {
        "Riksdag of the Estates": "riksdag of the estates"
    },
    {
        " supported John. However, in his endeavours to unify the realm, and Charles had consequently to resign his pretensions to autonomy within his duchy. But, steadfast ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " as he was, on the religious question he was immovable. The matter came to a crisis on the death of John III in 42 The heir to the throne was Johns eldest son, ": null
    },
    {
        "Sigismund III Vasa": "sigismund iii vasa"
    },
    {
        ", already king of ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and a devoted ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        ". The fear that Sigismund might re-catholicize the land alarmed the ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " majority in Sweden—particularly the commoners and lower nobility, and Charles came forward as their champion, and also as the defender of the ": null
    },
    {
        "Vasa": "house of vasa"
    },
    {
        " dynasty against foreign interference.        It was due entirely to him that Sigismund as king-elect was forced to confirm the resolutions at the ": null
    },
    {
        "Uppsala Synod": "uppsala synod"
    },
    {
        " in 42 thereby recognizing the fact that Sweden was essentially a ": null
    },
    {
        "Lutheran": "lutheranism"
    },
    {
        " Protestant state. Under the agreement, Charles and the Swedish Privy Council shared power and ruled in Sigismunds place since he resided in Poland. In the ensuing years 42–42 Charless task was extraordinarily difficult. He had steadily to oppose Sigismunds reactionary tendencies and directives; he had also to curb the nobility which sought to increase their power at the expense of the absent king, which he did with cruel rigor.     Necessity compelled him to work with the clergy and people rather than the gentry; hence it was that the Riksdag of the Estates assumed under his regency government a power and an importance which it had never possessed before. In 42 the Riksdag of ": null
    },
    {
        "Söderköping": "söderköping"
    },
    {
        " elected Charles regent, and his attempt to force ": null
    },
    {
        "Klas Flemming": "klas flemming"
    },
    {
        ", governor of ": null
    },
    {
        "Österland": "österland"
    },
    {
        " , to submit to his authority, rather than to that of the king, provoked a civil war. Charles sought to increase his power and the king attempted to manage the situation by diplomacy over several years, until fed up, Sigismund got permission from the Commonwealths legislature to pursue the matters dividing his Swedish subjects, and ": null
    },
    {
        "invaded with a mercenary army": "war against sigismund"
    },
    {
        ".     Technically Charles was, without doubt, guilty of high treason, and the considerable minority of all classes which adhered to Sigismund on his landing in Sweden in 42 indisputably behaved like loyal subjects. In the events that followed, despite some initial successes, Sigismund lost the crucial ": null
    },
    {
        "Battle of Stångebro": "battle of stångebro"
    },
    {
        ", and was captured himself, as well as being forced to deliver up certain Swedish noblemen who were named traitor by Charles and the Riksens ständer. With Sigismund defeated and exiled, as both an alien and a heretic to the majority of the Swedish nation, and his formal deposition by the ": null
    },
    {
        "Riksdag of the Estates": "riksdag of the estates"
    },
    {
        " in 42 was, in effect, a natural vindication and  ex post facto legitimization of Charless position all along, for the same session of the Riksens ständer named him as the ruler as regent.             Finally, the Riksdag at Linköping, 42 February 42 declared that Sigismund abdicated the Swedish throne, that duke Charles was recognized as the sovereign. He was declared king as Karl IX . Charless short reign was one of uninterrupted warfare. The hostility of Poland and the breakup of ": null
    },
    {
        "Russia": "russia"
    },
    {
        " involved him in overseas contests for the possession of ": null
    },
    {
        "Livonia": "duchy of livonia"
    },
    {
        " and ": null
    },
    {
        "Ingria": "duchy of ingria"
    },
    {
        ", the ": null
    },
    {
        "Polish–Swedish War ": "polish–swedish war"
    },
    {
        " and the ": null
    },
    {
        "Ingrian War": "ingrian war"
    },
    {
        ", while his pretensions to claim ": null
    },
    {
        "Lappland": "laponia"
    },
    {
        " brought upon him a war with ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        " in the last year of his reign.     In all these struggles, he was more or less unsuccessful, owing partly to the fact that he and his forces had to oppose superior generals  and partly to sheer ill-luck. Compared with his foreign policy, the domestic policy of Charles IX was comparatively unimportant. It aimed at confirming and supplementing what had already been done during his regency. He did not officially become king until 42 March 42 The first deed in which the title appears is dated 42 March 42; but he was not crowned until 42 March 42       Four and a half years later Charles IX died at ": null
    },
    {
        "Nyköping": "nyköping"
    },
    {
        ", 42 October 42 when he was succeeded by his seventeen-year-old son ": null
    },
    {
        "Gustavus Adolphus": "gustavus adolphus"
    },
    {
        ", who had participated in the wars. As a ruler, he is the link between his great father and his still greater son. He consolidated the work of Gustav I, the creation of a great Protestant state; he prepared the way for the erection of the Protestant empire of ": null
    },
    {
        "Gustavus Adolphus": "gustavus adolphus"
    },
    {
        ".                         He married, firstly, ": null
    },
    {
        "Anna Marie of Palatinate-Simmern": "anna marie of palatinate-simmern"
    },
    {
        " , daughter of ": null
    },
    {
        "Louis VI": "louis vi, elector palatine"
    },
    {
        ", ": null
    },
    {
        "Elector Palatine": "electoral palatinate"
    },
    {
        " and ": null
    },
    {
        "Elisabeth of Hesse": "elisabeth of hesse"
    },
    {
        " . Their children were:     Margareta Elisabeth   Elisabeth Sabina   Louis   ": null
    },
    {
        "Catherine": "catherine of sweden"
    },
    {
        " , married a prince of the ": null
    },
    {
        "Palatinate": "electoral palatinate"
    },
    {
        " Zweibrücken": "zweibrücken"
    },
    {
        ", becoming mother of ": null
    },
    {
        "Charles X Gustav": "charles x gustav"
    },
    {
        ".   Gustav   Maria     In 42 he married his second wife ": null
    },
    {
        "Christina of Holstein-Gottorp": "christina of holstein-gottorp"
    },
    {
        " , daughter of ": null
    },
    {
        "Adolf of Holstein-Gottorp": "adolf of holstein-gottorp"
    },
    {
        " and ": null
    },
    {
        "Christine of Hesse": "christine of hesse"
    },
    {
        " , and first cousin of his previous wife. Their children were:     Christina   ": null
    },
    {
        "Gustavus Adolphus of Sweden": "gustavus adolphus of sweden"
    },
    {
        "   Maria Elizabeth": "princess maria elizabeth of sweden"
    },
    {
        " , married her first cousin ": null
    },
    {
        "Duke John": "john, duke of östergötland"
    },
    {
        ", youngest son of ": null
    },
    {
        "John III of Sweden": "john iii of sweden"
    },
    {
        " Charles Philip": "charles philip, duke of södermanland"
    },
    {
        "     He also had a son with his mistress, ": null
    },
    {
        "Karin Nilsdotter": "karin nilsdotter"
    },
    {
        ":   ": null
    },
    {
        "Carl Carlsson Gyllenhielm": "carl carlsson gyllenhielm"
    },
    {
        " , ": null
    },
    {
        "Field Marshal": "swedish field marshals"
    }
]