[
    {
        "Chaucer College Canterbury is an independent college for ": null
    },
    {
        "Japan": "japan"
    },
    {
        "ese university and high school students. It was founded in 42 by Hiroshi Kawashima, the Head of the Shumei Foundation, and opened on 42th October 42 and is located in a prize-winning building featuring a combination of western and oriental architectural styles on the campus of the ": null
    },
    {
        "University of Kent": "university of kent"
    },
    {
        " at Canterbury. All students are recruited by the Shumei Foundation, and many are drawn from its educational establishments in Japan, consisting of a small private university and three very successful independent high schools . The College now also offers English language courses for European and international students. This is in keeping with the founding principles that World peace in both political and economic spheres depends upon international exchange and understanding.       The college was founded in 42 by Hiroshi Kawashima, the Head of the Shumei Foundation.       Chaucer College, as a purpose-built academic institution and self-contained campus, contains over 42 single study bedrooms, leisure facilities , full catering facilities, a large, well-equipped lecture theatre, an excellent Library and a score of classrooms. Kingsgate College has similar teaching, catering and leisure facilities and 42 bedrooms .       The Colleges Senior Management Team consists of the Chancellor, the Director of Academic Programmes, the Dean of Students, the College Manager, and the Facilities Manager. There is a full complement of well-qualified academic staff, all of whom have university degrees, and many of whom hold higher qualifications. Most are highly experienced and qualified in the teaching of English as a second language.     The College also employs British university students either from the University of Kent or from ": null
    },
    {
        "Canterbury Christ Church University": "canterbury christ church university"
    },
    {
        " as Conversation Teachers. Students from Dartford Grammar School are also employed there as they have a pact of friendship with Shumei University. Their role is to socialise with the Colleges students by offering one-to-one conversation classes to enhance fluency in spoken English and to introduce them to various aspects of British society, typically through their own cultural and sporting interest groups. In exchange for the service they provide, Conversation Teachers receive free board and lodging at Chaucer College. They are expected to conform to the Colleges rules, which can appear to be quite stringent .       The group follows the Japanese academic year, running from April to February. During the first semester, Chaucer College welcomes Shumei University first-year students from four faculties:     The Faculty of Management and Administration   The Faculty of English & Information Technology   The Faculty of Tourism and Business   The Faculty of Teacher Education     Their programme consists of a combination of intensive study of the English language, combined with preparatory work on the subjects that will form the major component of their Shumei University degree. Teacher Education students also undertake a programme of visits to local partner schools to observe UK teaching methods. Students reside in the purpose-built accommodation on the Chaucer campus, but most include a period of homestay with a local family in their programme.     During the second semester, Chaucer, like Kingsgate, welcomes successive contingents of Shumei High School students visiting the UK. Junior high school students come for two weeks, senior high school students for four weeks. The latter also include a period of homestay in their programme.     During the Japanese university vacation , Chaucer hosts a four-week vacation programme for Shumei Teacher Education Faculty students whose major is not English. During this course, the students have the opportunity to visit both local and continental schools .     In a new venture, the College uses its considerable expertise to offer a variety of English language courses to individuals and groups seeking to improve their English and develop international exchanges at both its campuses. Courses currently last from between one and four weeks.       The Chaucer College group is a registered charity. The Charities Act stipulates that registered charities should demonstrate “public benefit”. In accordance with this expectation, the Colleges students engage in a variety of activities, including participation in local cultural festivals and an extensive community volunteering programme. Open Days or Open Evenings are held regularly, and the Colleges also offer accommodation and conference facilities to other local organisations. Students also visit local schools as “cultural ambassadors” for Japan and vice-versa.                           ": null
    }
]