[
    {
        "A check-raise in ": null
    },
    {
        "poker": "poker"
    },
    {
        " is a common deceptive play in which a player ": null
    },
    {
        "check": "betting check"
    },
    {
        "s early in a betting round, hoping someone else will ": null
    },
    {
        "open": "betting open"
    },
    {
        ". The player who checked then ": null
    },
    {
        "raise": "betting raise"
    },
    {
        "s in the same round.     This might be done, for example, when the first player believes that an opponent has an inferior hand and will not ": null
    },
    {
        "call": "betting call"
    },
    {
        " a direct bet, but that they may attempt to ": null
    },
    {
        "bluff": "bluff"
    },
    {
        ", allowing the first player to win more money than they would by betting straightforwardly. The key point is that if no one else is keen to bet, then the most a player can raise by is one single bet. If someone else bets first, they can raise, thus increasing the value of the pot by two bets. In a no-limit game, there is no restriction on the size of ones bet, and a raise is likely to be much larger than the second players bet. Of course, if no other player chooses to open, the betting will be checked around and the play will have failed to elicit additional money for the pot. Like a simple check, a failed check-raise provides other players an opportunity to view the next card or cards dealt without requiring the other players to commit more money to the pot. A check-raise thus contains an element of risk because the check-raising players advantage may deteriorate when new cards are revealed.     While it can be an important part of ones poker strategy, this play is not allowed by a ": null
    },
    {
        "house rule": "house rule"
    },
    {
        " in some home games and certain small-stakes ": null
    },
    {
        "casino": "casino"
    },
    {
        " games. It is also frequently not allowed in the game of ": null
    },
    {
        "California lowball": "draw poker"
    },
    {
        ". In older poker material and among ": null
    },
    {
        "stud": "stud poker"
    },
    {
        " and ": null
    },
    {
        "draw poker": "draw poker"
    },
    {
        " players, it is sometimes referred to as sandbagging.     Check-raises can also be used as an intimidation technique over the course of a game; a player who has frequently been check-raised may be less likely to attempt to steal the pot.     In online poker games special tracking software can be used to determine the exact percentage of times a player check-raised when they had the opportunity. This information helps to determine if a player who check-raised has a monster hand or is bluffing as part of their routine poker play.     Not all players agree that a check-raise is an especially effective play, however. In  Super/System , poker legend ": null
    },
    {
        "Doyle Brunson": "doyle brunson"
    }
]