[
    {
        "         Chemnitz  is the third largest city in the ": null
    },
    {
        "German": "germany"
    },
    {
        " federal state": "states of germany"
    },
    {
        " of ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        " after ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " and ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ". It is the ": null
    },
    {
        "42th largest city": "list of cities in germany by population"
    },
    {
        " of Germany as well as the fourth largest city in the area of former ": null
    },
    {
        "East Germany": "east germany"
    },
    {
        " after  ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", Leipzig and Dresden. The city is part of the ": null
    },
    {
        "Central German Metropolitan Region": "central german metropolitan region"
    },
    {
        ", and lies in the middle of a string of cities sitting in the densely populated northern ": null
    },
    {
        "foreland": "ore mountain foreland"
    },
    {
        " of the ": null
    },
    {
        "Elster": "elster mountains"
    },
    {
        " and ": null
    },
    {
        "Ore Mountains": "ore mountains"
    },
    {
        ", stretching from ": null
    },
    {
        "Plauen": "plauen"
    },
    {
        " in the southwest via ": null
    },
    {
        "Zwickau": "zwickau"
    },
    {
        ", Chemnitz and ": null
    },
    {
        "Freiberg": "freiberg"
    },
    {
        " to Dresden in the northeast.     Located in the ": null
    },
    {
        "Ore Mountain Basin": "ore mountain basin"
    },
    {
        ", the city is surrounded by the Ore Mountains to the south and the ": null
    },
    {
        "Central Saxon Hill Country": "central saxon hills"
    },
    {
        " to the north. The city stands on the ": null
    },
    {
        "Chemnitz River": "chemnitz river"
    },
    {
        " , which is formed through the confluence of the rivers ": null
    },
    {
        "Zwönitz": "zwönitz"
    },
    {
        " and ": null
    },
    {
        "Würschnitz": "würschnitz"
    },
    {
        " in the borough of Altchemnitz.     The name of the city as well as the names of the rivers are of ": null
    },
    {
        "Slavic": "slavic languages"
    },
    {
        " origin. Chemnitz is the third largest in the ": null
    },
    {
        "Thuringian": "thuringian"
    },
    {
        "-": null
    },
    {
        "Upper Saxon": "upper saxon"
    },
    {
        " dialect area after Leipzig and Dresden. The citys economy is based on the ": null
    },
    {
        "service sector": "tertiary sector of the economy"
    },
    {
        " and ": null
    },
    {
        "manufacturing industry": "manufacturing"
    },
    {
        ". ": null
    },
    {
        "Chemnitz University of Technology": "chemnitz university of technology"
    },
    {
        " has around 42 students.       Chemnitz is named after the river ": null
    },
    {
        "Chemnitz": "chemnitz"
    },
    {
        ", a small tributary of the ": null
    },
    {
        "Zwickau Mulde": "zwickau mulde"
    },
    {
        ". The word Chemnitz is from the ": null
    },
    {
        "Sorbian language": "sorbian languages"
    },
    {
        " , and means stony . The word is composed of the Slavic word  meaning stone and the feminine suffix .     It is known in ": null
    },
    {
        "Czech": "czech language"
    },
    {
        " as  and in ": null
    },
    {
        "Polish": "polish language"
    },
    {
        " as . There are many other towns named Kamienica or Kamenice in areas with past or present Slavic settlement.             An early Slavic tribes settlement was located at , and the first documented use of the name Chemnitz was the 42 site of a ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " monastery around which a settlement grew. Circa 42 ": null
    },
    {
        "Frederick I, Holy Roman Emperor": "frederick i, holy roman emperor"
    },
    {
        " granted it the rights of an ": null
    },
    {
        "Imperial city": "free imperial city"
    },
    {
        ". In 42 the town became subordinate to the ": null
    },
    {
        "Margraviate of Meissen": "margraviate of meissen"
    },
    {
        ", the predecessor of the Saxon state. In ": null
    },
    {
        "medieval times": "middle ages"
    },
    {
        ", Chemnitz became a centre of textile production and trade. More than one third of the population worked in textile production.     By the early 42th century, Chemnitz had become an industrial centre . In 42 Chemnitz had a population of 42 and, like Leipzig and Dresden, was larger at that time than today. After losing inhabitants due to the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " Chemnitz grew rapidly again and reached its all-time peak of 42 inhabitants in 42 Before the ": null
    },
    {
        "world economic crises": "great depression"
    },
    {
        ", it was supposed  that the city would keep on growing and would become a  by incorporating also fast growing smaller towns and municipalities around it.       As a working-class industrial city, it was a powerful center of socialist political organization after World War I. At the foundation of the German Communist Party the local ": null
    },
    {
        "Independent Social Democratic Party of Germany": "independent social democratic party of germany"
    },
    {
        " voted by 42 votes to three to break from the party and join the Communist Party behind their local leaders, ": null
    },
    {
        "Fritz Heckert": "fritz heckert"
    },
    {
        " and ": null
    },
    {
        "Heinrich Brandler": "heinrich brandler"
    },
    {
        ".  In March 42 the German Communist Party had over 42 members in the   city of Chemnitz. W. Berthold, ‘Die Kämpfeti der Chemnitzer Arbeiter gegen die militaristiche Reaktion   im August 42’, Beiträge zur Geschichte der deutschen Arbeiterbewegung, no. 42 42   p. 42       Allied bombing destroyed 42 per cent of the built-up area of Chemnitz during the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ".  Chemnitz contained factories that produced military hardware and a ": null
    },
    {
        "Flossenbürg": "flossenbürg concentration camp"
    },
    {
        " forced labor": "forced labour under german rule during world war ii"
    },
    {
        " subcamp for ": null
    },
    {
        "Astra-Werke AG": "astra-werke ag"
    },
    {
        ".  The ": null
    },
    {
        "oil refinery": "oil refinery"
    },
    {
        " was a target for bombers during the ": null
    },
    {
        "Oil Campaign of World War II": "oil campaign of world war ii"
    },
    {
        ", and ": null
    },
    {
        "Operation Thunderclap": "thunderclap plan"
    },
    {
        " attacks included the following raids:   42/42 February 42: The first major raid on Chemnitz used 42 ": null
    },
    {
        "RAF": "royal air force"
    },
    {
        " bombers, but due to cloud cover most bombs fell over open countryside.   42/42–42 March: ": null
    },
    {
        "USAAF": "united states army air forces"
    },
    {
        " bombers attacked the marshalling yards.    42 March: 42 RAF bombers attacked.     The headquarters of the auto manufacturer ": null
    },
    {
        "Auto Union": "auto union"
    },
    {
        " were also based in Chemnitz since 42 and its buildings were also badly damaged. At the end of the war, the companys executives fled and relocated the company in ": null
    },
    {
        "Ingolstadt": "ingolstadt"
    },
    {
        ", Bavaria, where it evolved into ": null
    },
    {
        "Audi": "audi"
    },
    {
        ", now a brand within the Volkswagen group.     The World War II bombings left most of the city in ruins and ": null
    },
    {
        "post-war": "post-war"
    },
    {
        ", the East German reconstruction included large low rise  housing. Some tourist sites were reconstructed during the ": null
    },
    {
        "East German": "east germany"
    },
    {
        " era and after ": null
    },
    {
        "German reunification": "die wende"
    },
    {
        ". The city was occupied by Soviet troops on 42 May 42       After the dissolution of the Länder in the GDR in 42 Chemnitz became seat of a district . On 42 May 42 the city was renamed by decision of the East German government to  after ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ", in recognition of its industrial heritage and the ": null
    },
    {
        "Karl Marx Year": "karl marx year"
    },
    {
        " marking the 42th anniversary of his birth and the 42th anniversary of his death.  ": null
    },
    {
        "GDR Prime Minister": "leadership of east germany"
    },
    {
        " Otto Grotewohl": "otto grotewohl"
    },
    {
        " said:          After the city centre was destroyed in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the East German authorities attempted to rebuild it to symbolise the conceptions of urban development of a socialist city. The layout of the city centre at that time was rejected in favour of a new road network. However, the original plans were not completed. In addition, the rapid development of housing took priority over the preservation of old buildings. So in the 42s and 42s, both in the centre as well as the periphery, large areas were built in  apartment-block style, for example . The old buildings of the period, which still existed in the ": null
    },
    {
        "Kassberg": "chemnitz-kaßberg"
    },
    {
        ",  and  especially, were neglected and fell increasingly into dereliction.             On 42 April 42 a referendum on the future name of the city was held: 42% of the voters voted for the old name  . On 42 June 42 the city was officially renamed.      After the ": null
    },
    {
        "reunification of Germany": "reunification of germany"
    },
    {
        " on 42 October 42 the city of Chemnitz faced several difficult tasks. Many inhabitants migrated to the former West Germany and unemployment in the region increased sharply; in addition Chemnitz did not have adequate shopping facilities, but this was increasingly demanded.  Large shopping centers were constructed on the city periphery to the early 42s.     Chemnitz is the only major German city whose centre was re-planned after 42 similar to the reconstruction of several other German cities in the immediate post-war years. Plans for the recovery of a compressed city centre around the historic town hall in 42 led to an urban design competition. This was announced internationally by the city and carried out with the help of the partner city of . The mooted project on an essentially unused area of the former city would be comparable in circumference with the  in Berlin.     Numerous internationally renowned architects such as ,  and  provided designs for a new city centre. The mid42s began the development of the inner city brownfields around the town hall to a new town. In Chemnitz city more than 42 square meters of retail space have emerged. With the construction of office and commercial building on the construction site B42 at the  court, the last gap in 42 was closed in city centre image. The intensive development included demolition of partially historically valuable buildings from the period and was controversial. , 42 May 42 , 42 December 42 Between 42 and 42 more than 42 buildings were leveled.     In late August 42 the city was the site of a series of ": null
    },
    {
        "protests": "2018 chemnitz protests"
    },
    {
        " that attracted at least 42 people. The protests were also attended by some ": null
    },
    {
        "far-right": "far-right politics"
    },
    {
        " and ": null
    },
    {
        "Neo-Nazi": "neo-nazism"
    },
    {
        " groups. News outlets reported about mob violence and riots. The protests started after two immigrants were arrested in connection with the murder of Daniel H., a 42 year old Cuban-German man, which had happened on 42 August. Violent clashes occurred between far-right protesters and far-left counter protesters, leading to injuries. The mobs outnumbered the local police presence. There were reports that rightist protesters chased down dark skinned bystanders and those that appeared to be foreigners on the streets before more police arrived and intervened. The riots were widely condemned by media outlets and politicians throughout Germany, and were described as reminiscent of civil war and Nazi pogroms.         The reports of mob violence and riots were criticized as incorrect later on. The German language Swiss newspaper ": null
    },
    {
        "Neue Zürcher Zeitung": "neue zürcher zeitung"
    },
    {
        " corrected its earlier reports, stating that there had evidently been no mob violence but there have been sporadic encroachments.  Minister President of Saxony Michael Kretschmer came to the same conclusion: there were no mobs and man hunts .      One week after the protests, a free Concert against the Right under the motto We are more attracted an audience of some 42 people.  A one-minute silence commemorated Daniel H., the Cuban-German man killed.  The concert itself has been criticized for far-left activities and violent song texts of some of the participating bands.               ": null
    },
    {
        "Theater Chemnitz": "theater chemnitz"
    },
    {
        " offers a variety of theatre: opera, plays, ballet and  , and runs concerts by the orchestra Robert-Schumann-Philharmonie.     Tourist sights include the Kassberg neighborhood with 42th and 42th century buildings and the ": null
    },
    {
        "Karl Marx Monument": "karl marx monument"
    },
    {
        " by ": null
    },
    {
        "Lev Kerbel": "lev kerbel"
    },
    {
        ", nicknamed   by the locals. Landmarks include the Old Town Hall with its Renaissance portal , the castle on the site of the former monastery, and the area around the ": null
    },
    {
        "opera house": "theater chemnitz"
    },
    {
        " and the old university. The most conspicuous landmark is the red tower built in the late 42th or early 42th century as part of the ": null
    },
    {
        "city wall": "defensive wall"
    },
    {
        ".     The ": null
    },
    {
        "Chemnitz petrified forest": "chemnitz petrified forest"
    },
    {
        " is located in the courtyard of ": null
    },
    {
        "Kulturkaufhaus Tietz": "kulturkaufhaus tietz"
    },
    {
        ". It is one of the very few in existence, and dates back several million years. Also within the city limits, in the district of Rabenstein, is the smallest castle in Saxony, ": null
    },
    {
        "Rabenstein Castle": "rabenstein castle"
    },
    {
        ".     The city has changed considerably since German reunification. Most of its industry is now gone and the core of the city has been rebuilt with many shops as well as huge shopping centres. Many of these shops are international brands, including ": null
    },
    {
        "Zara": "zara"
    },
    {
        ", ": null
    },
    {
        "H & M": "h & m"
    },
    {
        ", Esprit, , Leiser Shoes, and Peek & Cloppenburg. The large  shopping centre is very popular with young people.     The Chemnitz Industrial Museum is an Anchor Point of ERIH, the ": null
    },
    {
        "European Route of Industrial Heritage": "european route of industrial heritage"
    },
    {
        ". The State Museum of Archaeology Chemnitz  opened in 42 and is located in the former ": null
    },
    {
        "Schocken Department Stores": "schocken department stores"
    },
    {
        ".     The , formerly a bank, opened on 42 December 42 , who lived in Munich, had a collection of some 42 pieces of ": null
    },
    {
        "modern art": "modern art"
    },
    {
        ", including many paintings and drawings by ,  and others. The  is a municipal ": null
    },
    {
        "botanical garden": "botanical garden"
    },
    {
        ", and the  is a non-profit garden specializing in ": null
    },
    {
        "arctic": "arctic"
    },
    {
        " and ": null
    },
    {
        "alpine plant": "alpine plant"
    },
    {
        " Chemnitz Opera": "theater chemnitz"
    },
    {
        "   Karl Marx": "karl marx"
    },
    {
        " Chemnitz University of Technology": "chemnitz university of technology"
    },
    {
        "    Chemnitz petrified forest": "chemnitz petrified forest"
    },
    {
        " inside the  ": null
    },
    {
        "Gunzenhauser Museum": "gunzenhauser museum"
    },
    {
        "  The official identification of the districts by numbers is based on the following principle: Starting from the city center , all other parts of the city are assigned clockwise in ascending order the tenth place of their index, the one-digit is awarded in the direction of city periphery in ascending order.            The city area does not include a unified, closed settlement area after numerous incorporations. The rural settlements of mainly eastern districts are separated from the settlement area of the Chemnitz city center, whereas this partly continues over the western city limits to Limbach-Oberfrohna and Hohenstein-Ernstthal.            Heavy destruction in World War II as well as post-war demolition to erect a truly socialist city centre left the city with a vast open space around its ": null
    },
    {
        "town hall": "city and town halls"
    },
    {
        " where once a vibrant city heart had been. Because of massive investment in out-of-town shopping right after reunification, it was not until 42 that major building activity was started in the centre. Comparable to  in Berlin, a whole new quarter of the city was constructed in recent years. New buildings include the  ": null
    },
    {
        "department store": "department store"
    },
    {
        " by ,  with a façade by  and Peek & Cloppenburg clothing store by  and Partner.       Chemnitz is the largest city of the  urban area and is one of the most important economic areas of Germanys new federal states. Chemnitz had a GDP of €42 billion in 42 with GDP per capita at €42.  Since about 42 the citys economy has recorded high annual ": null
    },
    {
        "GDP growth": "economic growth"
    },
    {
        " rates; Chemnitz is among the top ten German cities in terms of growth rate. The local and regional economic structure is characterized by medium-sized companies, with the heavy industrial sectors of mechanical engineering, metal processing, and vehicle manufacturing as the most significant industries.     About 42 people are employed, of whom about 42 commute from other municipalities.  42% of employees in Chemnitz have a university or ": null
    },
    {
        "college degree": "academic degree"
    },
    {
        "  is the largest employer in the    ": null
    },
    {
        "Ore Mountains": "ore mountains"
    },
    {
        ".               After German reunification Saxony faced a significant population decrease. Since 42 Chemnitz has lost about 42 percent of its inhabitants. The city had a fertility rate of 42 in 42      Minority population in Chemnitz by nationality as of 42 December 42:          A large contributor to the citys foreign population is ": null
    },
    {
        "Chemnitz University of Technology": "chemnitz university of technology"
    },
    {
        ". In 42 out of its 42 students, 42 were foreign students, which equals to about 42%,  making Chemnitz the most internationalised of the three major universities of Saxony.       ": null
    },
    {
        "Standard German": "german language"
    },
    {
        " Chemnitz dialect": "chemnitz dialect"
    },
    {
        ", which is a variety of ": null
    },
    {
        "Upper Saxon German": "upper saxon german"
    },
    {
        "               Chemnitz is linked to two motorways , ": null
    },
    {
        "A42": "bundesautobahn 4"
    },
    {
        "  and ": null
    },
    {
        "A42": "bundesautobahn 72"
    },
    {
        " . The ": null
    },
    {
        "motorway junction": "interchange"
    },
    {
        "  is situated in the northwestern area of the city. The motorway A42 between  and ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " is still under construction. Within the administrative area of Chemnitz there are eight motorway exits . The A42 motorway is part of the ": null
    },
    {
        "European route E42": "european route e40"
    },
    {
        ", one of the longest European E roads, connecting Chemnitz with the ": null
    },
    {
        "Asian Highway": "asian highway"
    },
    {
        " system to the east and France to the west.       Public transport within Chemnitz is provided with tram and bus, as well as by the . Nowadays, the city and its surroundings are served by one  line, five lines of the ": null
    },
    {
        "Chemnitz tramway network": "trams in chemnitz"
    },
    {
        ", 42 city bus lines, as well as several regional bus lines. At night, the city is served by two bus lines, two tram lines, and the  line.     The length of the tram,  and bus networks is ,  and  respectively. In August 42 electro-diesel trams were ordered from , to support an expansion of the light rail network to , with new routes serving ,  and .        Near Chemnitz there are three airports, including the two ": null
    },
    {
        "international airport": "international airport"
    },
    {
        "s of Saxony in Dresden and Leipzig. Both ": null
    },
    {
        "Leipzig/Halle Airport": "leipzig/halle airport"
    },
    {
        " and ": null
    },
    {
        "Dresden Airport": "dresden airport"
    },
    {
        " are situated about  from Chemnitz and offer numerous continental as well as intercontinental flights.     Chemnitz also has a small commercial airport           ": null
    }
]