[
    {
        "Chemical engineering is a branch of ": null
    },
    {
        "engineering": "Engineering"
    },
    {
        " that uses principles of ": null
    },
    {
        "chemistry": "Chemistry"
    },
    {
        ", ": null
    },
    {
        "physics": "Physics"
    },
    {
        ", ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", ": null
    },
    {
        "biology": "Biology"
    },
    {
        ", and ": null
    },
    {
        "economics": "Economics"
    },
    {
        " to efficiently use, produce, design, transport and transform energy and materials. The work of chemical engineers can range from the utilisation of nano-technology and nano-materials in the laboratory to large-scale industrial processes that convert chemicals, raw materials, living cells, microorganisms, and energy into useful forms and products.     Chemical engineers are involved in many aspects of plant design and operation, including safety and hazard assessments, ": null
    },
    {
        "process design": "Process Engineering"
    },
    {
        " and analysis, ": null
    },
    {
        "modeling": "Modeling And Simulation"
    },
    {
        ", ": null
    },
    {
        "control engineering": "Control Engineering"
    },
    {
        ", ": null
    },
    {
        "chemical reaction engineering": "Chemical Reaction Engineering"
    },
    {
        ", ": null
    },
    {
        "nuclear engineering": "Nuclear Engineering"
    },
    {
        ", ": null
    },
    {
        "biological engineering": "Biological Engineering"
    },
    {
        ", construction specification, and operating instructions.     Chemical engineers typically hold a degree in Chemical Engineering or Process Engineering. Practising engineers may have professional certification and be accredited members of a professional body. Such bodies include the ": null
    },
    {
        "Institution of Chemical Engineers": "Institution Of Chemical Engineers"
    },
    {
        " or the ": null
    },
    {
        "American Institute of Chemical Engineers": "American Institute Of Chemical Engineers"
    },
    {
        " .   A degree in chemical engineering is directly linked with all of the other engineering disciplines, to various extents.            A 1996  British Journal for the History of Science  article cites James F. Donnelly for mentioning an 1839 reference to chemical engineering in relation to the production of ": null
    },
    {
        "sulfuric acid": "Sulfuric Acid"
    },
    {
        ". In the same paper however, ": null
    },
    {
        "George E. Davis": "George E. Davis"
    },
    {
        ", an English consultant, was credited for having coined the term. Davis also tried to found a Society of Chemical Engineering, but instead it was named the ": null
    },
    {
        "Society of Chemical Industry": "Society Of Chemical Industry"
    },
    {
        " , with Davis as its first Secretary.   The History of Science in United States: An Encyclopedia puts the use of the term around 1890. Chemical engineering , describing the use of mechanical equipment in the chemical industry, became common vocabulary in England after 1850. By 1910, the profession, chemical engineer, was already in common use in Britain and the United States.          Chemical engineering emerged upon the development of ": null
    },
    {
        "unit operations": "Unit Operations"
    },
    {
        ", a fundamental concept of the discipline of chemical engineering. Most authors agree that Davis invented the concept of unit operations if not substantially developed it. He gave a series of lectures on unit operations at the ": null
    },
    {
        "Manchester Technical School": "Manchester Technical School"
    },
    {
        "  in 1887, considered to be one of the earliest such about chemical engineering. Three years before Davis lectures, ": null
    },
    {
        "Henry Edward Armstrong": "Henry Edward Armstrong"
    },
    {
        " taught a degree course in chemical engineering at the ": null
    },
    {
        "City and Guilds of London Institute": "City And Guilds Of London Institute"
    },
    {
        ". Armstrongs course failed simply because its graduates were not especially attractive to employers. Employers of the time would have rather hired chemists and ": null
    },
    {
        "mechanical engineers": "Mechanical Engineers"
    },
    {
        ". Courses in chemical engineering offered by ": null
    },
    {
        "Massachusetts Institute of Technology": "Massachusetts Institute Of Technology"
    },
    {
        " in the United States, ": null
    },
    {
        "Owens College": "Owens College, Manchester"
    },
    {
        " in ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        ", England, and ": null
    },
    {
        "University College London": "University College London"
    },
    {
        " suffered under similar circumstances.          Starting from 1888, ": null
    },
    {
        "Lewis M. Norton": "Lewis M. Norton"
    },
    {
        " taught at MIT the first chemical engineering course in the United States. Nortons course was contemporaneous and essentially similar to Armstrongs course. Both courses, however, simply merged chemistry and engineering subjects along with product design. Its practitioners had difficulty convincing engineers that they were engineers and chemists that they were not simply chemists.  Unit operations was introduced into the course by ": null
    },
    {
        "William Hultz Walker": "William Hultz Walker"
    },
    {
        " in 1905. By the early 1920s, unit operations became an important aspect of chemical engineering at MIT and other US universities, as well as at ": null
    },
    {
        "Imperial College London": "Imperial College London"
    },
    {
        ". The ": null
    },
    {
        "American Institute of Chemical Engineers": "American Institute Of Chemical Engineers"
    },
    {
        " , established in 1908, played a key role in making chemical engineering considered an independent science, and unit operations central to chemical engineering. For instance, it defined chemical engineering to be a science of itself, the basis of which is ... unit operations in a 1922 report; and with which principle, it had published a list of academic institutions which offered satisfactory chemical engineering courses. Meanwhile, promoting chemical engineering as a distinct science in Britain led to the establishment of the ": null
    },
    {
        "Institution of Chemical Engineers": "Institution Of Chemical Engineers"
    },
    {
        " in 1922. IChemE likewise helped make unit operations considered essential to the discipline.          In 1940s, it became clear that unit operations alone were insufficient in developing ": null
    },
    {
        "chemical reactor": "Chemical Reactor"
    },
    {
        "s. While the predominance of unit operations in chemical engineering courses in Britain and the United States continued until the 1960s, ": null
    },
    {
        "transport phenomena": "Transport Phenomena"
    },
    {
        " started to experience greater focus. Along with other novel concepts, such as ": null
    },
    {
        "process systems engineering": "Process Systems Engineering"
    },
    {
        " , a second paradigm was defined. Transport phenomena gave an ": null
    },
    {
        "analytical": "Systems Analysis"
    },
    {
        " approach to chemical engineering while PSE focused on its synthetic elements, such as ": null
    },
    {
        "control system": "Control System"
    },
    {
        " and ": null
    },
    {
        "process design": "Process Design"
    },
    {
        ". Developments in chemical engineering before and after ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " were mainly incited by the ": null
    },
    {
        "petrochemical industry": "Petrochemical Industry"
    },
    {
        ", however, advances in other fields were made as well. Advancements in ": null
    },
    {
        "biochemical engineering": "Biochemical Engineering"
    },
    {
        " in the 1940s, for example, found application in the ": null
    },
    {
        "pharmaceutical industry": "Pharmaceutical Industry"
    },
    {
        ", and allowed for the ": null
    },
    {
        "mass production": "Mass Production"
    },
    {
        " of various ": null
    },
    {
        "antibiotic": "Antibiotic"
    },
    {
        "s, including ": null
    },
    {
        "penicillin": "Penicillin"
    },
    {
        " and ": null
    },
    {
        "streptomycin": "Streptomycin"
    },
    {
        ". Meanwhile, progress in ": null
    },
    {
        "polymer science": "Polymer Science"
    },
    {
        " in the 1950s paved way for the age of plastics .       Concerns regarding the safety and environmental impact of large-scale chemical manufacturing facilities were also raised during this period.  Silent Spring , published in 1962, alerted its readers to the harmful effects of ": null
    },
    {
        "DDT": "Ddt"
    },
    {
        ", a potent ": null
    },
    {
        "insecticide": "Insecticide"
    },
    {
        ". The 1974 ": null
    },
    {
        "Flixborough disaster": "Flixborough Disaster"
    },
    {
        " in the United Kingdom resulted in 28 deaths, as well as damage to a ": null
    },
    {
        "chemical plant": "Chemical Plant"
    },
    {
        " and three nearby villages. The 1984 ": null
    },
    {
        "Bhopal disaster": "Bhopal Disaster"
    },
    {
        " in India resulted in almost 4,000 deaths. These incidents, along with ": null
    },
    {
        "other incidents": "List Of Industrial Disasters"
    },
    {
        ", affected the reputation of the trade as ": null
    },
    {
        "industrial safety": "Industrial Safety"
    },
    {
        " and ": null
    },
    {
        "environmental protection": "Environmental Protection"
    },
    {
        " were given more focus. In response, the IChemE required safety to be part of every degree course that it accredited after 1982. By the 1970s, legislation and monitoring agencies were instituted in various countries, such as France, Germany, and the United States.       Advancements in ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        " found applications designing and managing plants, simplifying calculations and drawings that previously had to be done manually. The completion of the ": null
    },
    {
        "Human Genome Project": "Human Genome Project"
    },
    {
        " is also seen as a major development, not only advancing chemical engineering but ": null
    },
    {
        "genetic engineering": "Genetic Engineering"
    },
    {
        " and ": null
    },
    {
        "genomics": "Genomics"
    },
    {
        " as well. Chemical engineering principles were used to produce ": null
    },
    {
        "DNA sequences": "Dna Sequences"
    },
    {
        " in large quantities.            Chemical engineering involves the application of several principles. Key concepts are presented below.       Chemical engineering design concerns the creation of plans, specification, and economic analyses for ": null
    },
    {
        "pilot plant": "Pilot Plant"
    },
    {
        "s, new plants or plant modifications. Design engineers often work in a consulting role, designing plants to meet clients needs. Design is limited by a number of factors, including funding, government regulations and safety standards. These constraints dictate a plants choice of process, materials and equipment.     Plant construction is coordinated by ": null
    },
    {
        "project engineers": "Project Engineering"
    },
    {
        " and project managers Herbst, Andrew; Hans Verwijs . Project Engineering: Interdisciplinary Coordination and Overall Engineering Quality Control . Proc. of the Annual IAC conference of the American Society for Engineering Management 1 : 15–21 depending on the size of the investment. A chemical engineer may do the job of project engineer full-time or part of the time, which requires additional training and job skills or act as a consultant to the project group. In the USA the education of chemical engineering graduates from the Baccalaureate programs accredited by ": null
    },
    {
        "ABET": "Abet"
    },
    {
        " do not usually stress project engineering education, which can be obtained by specialized training, as electives, or from ": null
    },
    {
        "graduate programs": "Graduate Programs"
    },
    {
        ". Project engineering jobs are some of the largest employers for chemical engineers.             A unit operation is a physical step in an individual chemical engineering process. Unit operations  are used to prepare reactants, purifying and separating its products, recycling unspent reactants, and controlling energy transfer in reactors. On the other hand, a unit process is the chemical equivalent of a unit operation. Along with unit operations, unit processes constitute a process operation. Unit processes  involve the conversion of material by ": null
    },
    {
        "biochemical": "Biochemical"
    },
    {
        ", ": null
    },
    {
        "thermochemical": "Thermochemical"
    },
    {
        " and other means. Chemical engineers responsible for these are called ": null
    },
    {
        "process engineer": "Process Engineer"
    },
    {
        "s.     Process design requires the definition of equipment types and sizes as well as how they are connected together and the materials of construction. Details are often printed on a ": null
    },
    {
        "Process Flow Diagram": "Process Flow Diagram"
    },
    {
        " which is used to control the capacity and reliability of a new or modified chemical factory.     ": null
    },
    {
        "Education for chemical engineers": "Education For Chemical Engineers"
    },
    {
        " in the first college degree 3 or 4 years of study stresses the principles and practices of process design. The same skills are used in existing chemical plants to evaluate the ": null
    },
    {
        "efficiency": "Economicseconomic Efficiency"
    },
    {
        " and make recommendations for improvements.            Modeling and analysis of transport phenomena is essential for many industrial applications. Transport phenomena involve ": null
    },
    {
        "fluid dynamics": "Fluid Dynamics"
    },
    {
        ", ": null
    },
    {
        "heat transfer": "Heat Transfer"
    },
    {
        " and ": null
    },
    {
        "mass transfer": "Mass Transfer"
    },
    {
        ", which are governed mainly by ": null
    },
    {
        "momentum transfer": "Momentum Transfer"
    },
    {
        ", ": null
    },
    {
        "energy transfer": "Energy Transfer"
    },
    {
        " and transport of ": null
    },
    {
        "chemical species": "Chemical Species"
    },
    {
        ", respectively. Models often involve separate considerations for ": null
    },
    {
        "macroscopic": "Macroscopic Scale"
    },
    {
        ", ": null
    },
    {
        "microscopic": "Microscopic Scale"
    },
    {
        " and ": null
    },
    {
        "molecular": "Molecular"
    },
    {
        " level phenomena. Modeling of transport phenomena, therefore, requires an understanding of applied mathematics.               ": null
    },
    {
        "Chemical engineers": "Chemical Engineer"
    },
    {
        " develop economic ways of using materials and energy . Chemical engineers use ": null
    },
    {
        "chemistry": "Chemistry"
    },
    {
        " and engineering to turn raw materials into usable products, such as medicine, petrochemicals and plastics on a large-scale, industrial setting. They are also involved in ": null
    },
    {
        "waste management": "Waste Management"
    },
    {
        " and research. Both applied and research facets could make extensive use of computers.     Chemical engineers may be involved in industry or university research where they are tasked with designing and performing experiments to create better and safer methods for production, pollution control, and resource conservation. They may be involved in designing and constructing plants as a ": null
    },
    {
        "project engineer": "Project Engineer"
    },
    {
        ". Chemical engineers serving as project engineers use their knowledge in selecting optimal production methods and plant equipment to minimize costs and maximize safety and profitability. After plant construction, chemical engineering project managers may be involved in equipment upgrades, process changes, troubleshooting, and daily operations in either full-time or consulting roles. ": null
    }
]