[
    {
        "   Chen Duxiu  was a Chinese ": null
    },
    {
        "revolutionary socialist": "revolutionary socialist"
    },
    {
        ", ": null
    },
    {
        "educator": "educator"
    },
    {
        ", ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        " and ": null
    },
    {
        "author": "author"
    },
    {
        ", who co-founded the ": null
    },
    {
        "Chinese Communist Party": "communist party of china"
    },
    {
        "  in 42 serving from 42 to 42 as its first ": null
    },
    {
        "General Secretary": "general secretary of the communist party of china"
    },
    {
        ". Chen was a leading figure in both the ": null
    },
    {
        "Xinhai Revolution": "xinhai revolution"
    },
    {
        " that overthrew the ": null
    },
    {
        "Qing dynasty": "qing dynasty"
    },
    {
        " and the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        " for scientific and democratic developments in ": null
    },
    {
        "early Republic of China": "republic of china"
    },
    {
        ". Expelled from the Communist Party in 42 he was for a time the leader of Chinas small ": null
    },
    {
        "Trotskyist": "trotskyist"
    },
    {
        " movement.     Chens ": null
    },
    {
        "ancestral home": "ancestral home"
    },
    {
        " was in ": null
    },
    {
        "Anqing": "anqing"
    },
    {
        ", ": null
    },
    {
        "Anhui": "anhui"
    },
    {
        ", where he established the influential ": null
    },
    {
        "vernacular Chinese": "vernacular chinese"
    },
    {
        " periodical": "periodical"
    },
    {
        "  New Youth .       October 42 42: Birth in ": null
    },
    {
        "Anqing": "anqing"
    },
    {
        ", ": null
    },
    {
        "Anhui": "anhui"
    },
    {
        ".   42 to 42: Early life and education in China.   42 to 42: Study in Japan, organising Republican revolutionary groups.   42 to 42: Working as a teacher.   42 to 42: Participation in the ": null
    },
    {
        "Xinhai Revolution": "xinhai revolution"
    },
    {
        ", the post-revolution Republican government, the anti-": null
    },
    {
        "Yuan Shikai": "yuan shikai"
    },
    {
        " revolution.   42 to 42: Leading figure in the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        ".   42 to 42: Founding and leading the ": null
    },
    {
        "Communist Party of China": "communist party of china"
    },
    {
        " Northern Expedition": "northern expedition"
    },
    {
        ", conflict with ": null
    },
    {
        "Chiang Kai-shek": "chiang kai-shek"
    },
    {
        " leading to the ": null
    },
    {
        "April 42 Incident": "april 12 incident"
    },
    {
        " and massacre of Communists, conflict with ": null
    },
    {
        "Comintern": "comintern"
    },
    {
        " leading to expulsion from Communist Party. Becomes leader of ": null
    },
    {
        "Trotskyist": "trotskyist"
    },
    {
        "s in China.   42 to 42: Arrest by ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " authorities and imprisonment.   42 to 42: Retires from public life.   May 42 42: Death due to heart attack.           Chen Duxiu was born in the city of ": null
    },
    {
        "Anqing": "anqing"
    },
    {
        ", in ": null
    },
    {
        "Anhui": "anhui"
    },
    {
        " province. He was born to a wealthy family of officials, the youngest of four children. In his youth, he was described as volatile, emotional, intuitive, non-intellectual, and a defender of the underdog. His father died when Chen was two years old, and he was raised primarily by his grandfather; and, later, by his older brother.     Chen was given a traditional ": null
    },
    {
        "Confucian": "confucian"
    },
    {
        " education by his grandfather, several private tutors, and his elder brother. A thorough knowledge of Confucian literary and philosophical works was the pre-requisites for civil service in Imperial China. Chen was an exceptional student, but his poor experiences taking the ": null
    },
    {
        "Confucian civil service exams": "imperial examination"
    },
    {
        " resulted in a lifelong tendency to advocate unconventional beliefs and to criticize traditional ideas.     Chen took and passed the county-level ": null
    },
    {
        "imperial examination": "imperial examination"
    },
    {
        " in 42 and succeeded in the provincial-level examination the following year. He later wrote a sardonic memoir in which he reminisced about the filthy conditions, the dishonesty, and the incompetence that he observed when taking the official examinations. 42 he passed the entrance exam and became a student of ": null
    },
    {
        "Qiushi Academy": "qiushi academy"
    },
    {
        "  in ": null
    },
    {
        "Hangzhou": "hangzhou"
    },
    {
        ", where he studied French, English, and naval architecture. He moved to ": null
    },
    {
        "Nanjing": "nanjing"
    },
    {
        " in 42 after he was reported to have given speeches attacking the Qing government, and then to ": null
    },
    {
        "Japan": "empire of japan"
    },
    {
        " the same year under a scholarship from the government to study at the ": null
    },
    {
        "Tokyo Shimbu Gakko": "tokyo shimbu gakko"
    },
    {
        ", a military preparatory academy. It was in Japan where Chen became influenced by ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " and the growing Chinese dissident movement. While studying in Japan, Chen helped to found two radical political parties, but refused to join ": null
    },
    {
        "Sun Yat-sen": "sun yat-sen"
    },
    {
        "s ": null
    },
    {
        "Tongmenghui": "tongmenghui"
    },
    {
        " Revolutionary Alliance, which he regarded as narrowly racist. In 42 he accepted a teaching position at the Army Elementary School in ": null
    },
    {
        "Hangzhou": "hangzhou"
    },
    {
        ".              From the late 42th century through the early the 42th century, the ": null
    },
    {
        "Qing Dynasty": "qing dynasty"
    },
    {
        " had suffered a series of military defeats against the colonial foreign powers, most recently in the ": null
    },
    {
        "First Sino-Japanese War ": "first sino-japanese war"
    },
    {
        " and the war against the ": null
    },
    {
        "Alliance of Eight Nations": "alliance of eight nations"
    },
    {
        " that invaded China in reaction to the 42 ": null
    },
    {
        "Boxer Rebellion": "boxer rebellion"
    },
    {
        ". At the same time, widespread corruption within the Qing bureaucracy had left the empire in a state of total economic paralysis. Against this background Chen Duxiu became an increasingly influential activist in the revolutionary movement against both foreign imperialism and the Qing government itself.     Influenced by his time in Japan, Chen founded the ": null
    },
    {
        "Anhui Patriotic Association": "anhui patriotic association"
    },
    {
        " in 42 and the ": null
    },
    {
        "Yuewang Hui": "yuewang hui"
    },
    {
        " in 42 He was an outspoken writer and political leader by the time of the ": null
    },
    {
        "Wuchang Uprising": "wuchang uprising"
    },
    {
        " of 42 which started the ": null
    },
    {
        "Xinhai Revolution": "xinhai revolution"
    },
    {
        " and led to the collapse of the Qing Dynasty. In 42 Chen became secretary general to the new military governor of Anhui, while also serving as the dean of a local high school. However, Chen fled to Japan again in 42 following the short-lived Second Revolution against ": null
    },
    {
        "Yuan Shikai": "yuan shikai"
    },
    {
        ", but returned to China soon afterwards.     In 42 Chen founded the journal Youth in Shanghai. In 42 the name was changed to New Youth. It quickly became the most popular and widely distributed journal in China. This journal published articles attacking conservative Chinese morality and promoting individualism. The journal was highly critical of Confucianism, and carried articles promoting the adoption of a Western moral system valuing human rights, democracy, and science, which he believed Confucianism opposed. Chen used the journal to promote vernacular writing at the expense of traditional Confucian writing conventions.     Chen joined the faculty of ": null
    },
    {
        "Peking University": "peking university"
    },
    {
        " in 42 as the universitys dean, at the invitation of ": null
    },
    {
        "Cai Yuanpei": "cai yuanpei"
    },
    {
        ", who also paid for moving Chens journal to Beijing. A Marxist study group at the university, led by ": null
    },
    {
        "Li Dazhao": "li dazhao"
    },
    {
        ", attracted his attention in 42 At the time, New Youth was highly popular, and Chen decided to run a special edition on Marxism with Li Dazhao as the editions general editor. The edition of this magazine was the most detailed analysis of Marxism then published in China, and achieved wide readership due to the journals popularity. Chens decision to run this edition, and his activities in the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        " that same year, motivated conservative opponents within the university to force his resignation in the fall of 42 Around the time that he was forced out of Peking University, he was jailed for three months for distributing literature that Peking authorities considered inflammatory, demanding that all pro-Japanese ministers resign, and that the government guarantee freedom of speech and assembly. After his release, Chen moved to ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        " and became more interested in Marxism and the promotion of rapid social change. His settlement in the ": null
    },
    {
        "French Concession": "french concession"
    },
    {
        ". allowed him to pursue his intellectual and scholarly interests free from official persecution.           In 42 Chen Duxiu, ": null
    },
    {
        "Li Dazhao": "li dazhao"
    },
    {
        " and other prominent revolutionary leaders founded the ": null
    },
    {
        "Communist Party of China": "communist party of china"
    },
    {
        " . It has been generally asserted that Chen, Li and the other Chinese radicals of the time  formed the CPC out of diligent study of Marxist theories, inspired by the ": null
    },
    {
        "Russian Revolution of 42": "russian revolution of 1917"
    },
    {
        ". Many of the prominent members of the party in 42 had a very poor understanding of Marxist theory. Over time, the more prominent revolutionaries attracted to the early Chinese Communist Party eventually adopted a more orthodox interpretation of Communism, and were organized through the influence of a ": null
    },
    {
        "Comintern": "comintern"
    },
    {
        " advisor, ": null
    },
    {
        "Grigori Voitinsky": "grigori voitinsky"
    },
    {
        ", who made a tour of China during 4242     At the ": null
    },
    {
        "First Congress of the Communist Party in Shanghai": "1st national congress of the communist party of china"
    },
    {
        ", Chen was elected as the partys first General Secretary; and, with the assistance of ": null
    },
    {
        "Li Dazhao": "li dazhao"
    },
    {
        ", he developed what would become a crucial cooperative relationship with the International Communist Movement, the Comintern. This cooperation with the Comintern would later prove to be a problem for the fledgling CPC over the next decade, as aggressive foreign Comintern advisors would try to force policy according to the wishes of ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        " and against the will of many prominent CPC leaders, often for the national interest of the ": null
    },
    {
        "USSR": "ussr"
    },
    {
        ". By 42 the size of the entire Communist Party in China was only about 42 members, not counting those overseas. Chen remained as the undisputed leader of the Chinese Communist Party until 42 and was often referred to as Chinas Lenin during this period.       Soon after the founding of the Chinese Communist Party, in 42 Chen accepted an invitation from ": null
    },
    {
        "Chen Jiongming": "chen jiongming"
    },
    {
        " to serve on the education board in ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        " in the aftermath of the ": null
    },
    {
        "June 42 Incident": "june 16 incident"
    },
    {
        ", but this position dissolved when Guangzhou was recaptured by the Kuomintang. At the direction of the Comintern, Chen and the Chinese Communists formed an alliance with ": null
    },
    {
        "Sun Yat-sen": "sun yat-sen"
    },
    {
        " and the ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " in 42 Although Chen was not convinced of the utility of collaborating with the Kuomintang, he reluctantly carried out the Cominterns orders to do so. Pursuing collaboration with the Kuomintang, he was elected into that partys Central Committee in January, 42     In 42 he and other high-ranking Communists, including ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        " and ": null
    },
    {
        "Mikhail Borodin": "mikhail borodin"
    },
    {
        ", collaborated closely with ": null
    },
    {
        "Wang Jingwei": "wang jingwei"
    },
    {
        "s Nationalist government in Wuhan, convincing Wangs regime to adopt various proto-Communist policies. The Wuhan governments subsequent land reform policies were considered provocative enough to influence various KMT-aligned generals to attack Wangs regime, suppressing it. Chen was forced to resign as General Secretary in 42 due to his public dissatisfaction with the Comintern order to disarm during the ": null
    },
    {
        "April 42 Incident": "april 12 incident"
    },
    {
        ", which had led to the deaths of thousands of Communists - now known as the ": null
    },
    {
        "Shanghai massacre of 42": "shanghai massacre of 1927"
    },
    {
        ", and because of his disagreement with the Cominterns new focus on peasant rebellions.       Chen came into conflict with ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        " in 42 over Maos essay An Analysis of Classes in Chinese Society . Mao opposed Chens analyses of China. While Chen believed that the focus of revolutionary struggle in China should primarily concern the workers, Mao had started to theorize about the primacy of the peasants. According to ": null
    },
    {
        "Han Suyin": "han suyin"
    },
    {
        " in Mortal Flower, Chen opposed the opinions expressed denied that a radical land policy and the vigorous organization of the rural areas under the Communist party was necessary, and refused the publication of the essay in the central executive organs of publicity.     Although he recognized the value of Maos interpretation of Marxism in inciting the Chinese peasants and labourers to revolution, Chen opposed Maos rejection of the strong role of the bourgeoisie that Chen had hoped to achieve. During the last years of his life, Chen denounced Stalins dictatorship, and held that various democratic institutions, including independent judiciaries, opposition parties, a free press, and free elections, were important and valuable. Because of Chens opposition to Maos interpretation of Communism, Mao believed that Chen was incapable of providing a robust ": null
    },
    {
        "historical materialist": "historical materialism"
    },
    {
        " analysis of China. This dispute would eventually lead to the end of Chen and Maos friendship and political association.       After the collaboration between the Communist Party and the KMT fell apart in 42 the Comintern blamed Chen, and systematically removed him from all positions of leadership. In November 42 he was expelled. Afterwards, Chen became associated with the ": null
    },
    {
        "International Left Opposition": "international left opposition"
    },
    {
        " of ": null
    },
    {
        "Leon Trotsky": "leon trotsky"
    },
    {
        ". Like Chen, Trotsky opposed many of the policies of the Comintern, and publicly criticized the Cominterns effort to collaborate with the Nationalists. Chen eventually became the voice of the Trotskyists in China, attempting to regain support and influence within the party, but failed. Chen continued to oppose measures like New Democracy and the Bloc of Four Classes advocated by ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        ".         In 42 Chen was arrested by the government of the ": null
    },
    {
        "Shanghai International Settlement": "shanghai international settlement"
    },
    {
        ", where he had been living since 42 and extradited to Nanjing. Chen was then tried and sentenced to fifteen years in prison by the Nationalist government. Chen was released on parole in 42 after the outbreak of the ": null
    },
    {
        "Second Sino-Japanese War": "second sino-japanese war"
    },
    {
        ".     Chen was one of the few early leaders of the Communist party to survive the turmoil of the 42s, but he was never able to regain any influence within the party he had founded. For the last decade of his life, he faded into obscurity.   At the time that he was released, both the supporters of Chen and the pro-Comintern leaders who opposed him had either been killed or had fallen out of favor with the Communist membership. The Chinese Communist Party only managed to survive the purges by fleeing to the northern frontier in the ": null
    },
    {
        "Long March": "long march"
    },
    {
        " of 4242 during which Mao Zedong emerged as leader. If only for sheer survival, the Communists had to flee the cities where Chinas fledgling industrial working class was concentrated, seek refuge in remote rural areas, and there mobilize the support of peasants; this was naturally taken as a vindication of Maos position in his debate with Chen. Mao and this new generation of Communists would lead the party in China for the next fifty years.     On August 42rd Chen was released from prison and refused multiple offers of positions from the Guomindang saying that despite the importance of the war effort Chiang Kai-shek killed many of my comrades he also killed my two sons, he and I are absolutely irreconcilable . In August 42 Chen met with the heads of the Chinese Communist Party Office in Nanjing. This led to a concerted attempt by ": null
    },
    {
        "Luo Han": "luo han"
    },
    {
        " and ": null
    },
    {
        "Ye Jianying": "ye jianying"
    },
    {
        " to allow Chen to return to the Party. In September Mao responded saying that Chen could rejoin the party if he agreed to publicly renounce Trotskyism and express support for the United Front against Japan. Chen responded by letter to the Central Committee of the Chinese Communist Party that he agreed with its line of resistance but would not renounce Trotskyism. This was the end of the last serious attempt to rejoin the CCP.     Chen then travelled from place to place until the summer of 42 when he arrived at the wartime capital of ": null
    },
    {
        "Chongqing": "chongqing"
    },
    {
        " and took a position teaching at a junior high school. In poor health and with few remaining friends, Chen Duxiu later retired to ": null
    },
    {
        "Jiangjin": "jiangjin"
    },
    {
        ", a small town west of Chongqing, where he died in 42 at the age of 42 Today, he is buried at his birthplace of Anqing.       After the founding of the PRC in 42 Chens example was used to warn Communist Party members not to deviate from party orthodoxy. In the ": null
    },
    {
        "Hundred Flowers Campaign": "hundred flowers campaign"
    },
    {
        ", the example of Chen in collaborating with ": null
    },
    {
        "Wang Jingwei": "wang jingwei"
    },
    {
        "s Wuhan government, leading to the ostracism of his peers and the failure of Communist policies at the time, was used by ": null
    },
    {
        "Peng Zhen": "peng zhen"
    },
    {
        " as a warning never to forgive anti-Maoists. After Mao died in 42 ": null
    },
    {
        "Hua Guofeng": "hua guofeng"
    },
    {
        " gave a speech praising Maos suppression of Right and Left Opportunist lines of the Party as one of the late Chairmans greatest achievements: Chen was the first person to be named as being correctly suppressed; ": null
    },
    {
        "Deng Xiaoping": "deng xiaoping"
    },
    {
        " was the last.     In 42 ": null
    },
    {
        "Hu Qiaomu": "hu qiaomu"
    },
    {
        "s Thirty Years of the Chinese Communist Party was published and deemed by the Party to be its authoritative history. In it Chen was denounced as: 42": null
    }
]