[
    {
        "        Chervil , sometimes called French parsley or garden chervil , is a delicate ": null
    },
    {
        "annual": "annual plant"
    },
    {
        " herb": "herb"
    },
    {
        " related to ": null
    },
    {
        "parsley": "parsley"
    },
    {
        ". It is commonly used to season mild-flavoured dishes and is a constituent of the French herb mixture .         The name chervil is from ": null
    },
    {
        "Anglo-Norman": "anglo-norman language"
    },
    {
        ", from ": null
    },
    {
        "Latin": "latin"
    },
    {
        "  or , ultimately from ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        "  , meaning leaves of joy .         A member of the ": null
    },
    {
        "Apiaceae": "apiaceae"
    },
    {
        ", chervil is native to the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " but was spread by the Romans through most of Europe, where it is now naturalised.  It is also grown frequently in the United States, where it sometimes escapes cultivation. Such escape can be recognized, however, as garden chervil is distinguished from all other Anthriscus species growing in North America by its having lanceolate-linear bracteoles and a fruit with a relatively long beak.     The plants grow to , with tripinnate leaves that may be curly. The small white flowers form small umbels,  across. The fruit is about 1  cm long, oblong-ovoid with a slender, ridged beak.                 Chervil is used, particularly in France, to season ": null
    },
    {
        "poultry": "poultry"
    },
    {
        ", ": null
    },
    {
        "seafood": "seafood"
    },
    {
        ", young spring ": null
    },
    {
        "vegetables": "vegetable"
    },
    {
        ", soups, and sauces. More delicate than parsley, it has a faint taste of ": null
    },
    {
        "liquorice": "liquorice"
    },
    {
        " or ": null
    },
    {
        "aniseed": "aniseed"
    },
    {
        ".      Chervil is one of the four traditional French , along with ": null
    },
    {
        "tarragon": "tarragon"
    },
    {
        ", ": null
    },
    {
        "chive": "chive"
    },
    {
        "s, and ": null
    },
    {
        "parsley": "parsley"
    },
    {
        ", which are essential to French cooking. ": null
    },
    {
        "Julia Child": "julia child"
    },
    {
        ", Mastering the Art of French Cooking vol. I p 18. Unlike the more pungent, robust herbs such as ": null
    },
    {
        "thyme": "thyme"
    },
    {
        " and ": null
    },
    {
        "rosemary": "rosemary"
    },
    {
        ", which can take prolonged cooking, the  are added at the last minute, to salads, omelettes, and soups.       According to some, ": null
    },
    {
        "slugs": "slug"
    },
    {
        "are attracted to chervil and the plant is sometimes used to bait them.        Chervil has had various uses in folk medicine. It was claimed to be useful as a ": null
    },
    {
        "digestive": "digestion"
    },
    {
        " aid, for lowering ": null
    },
    {
        "high blood pressure": "high blood pressure"
    },
    {
        ", and, infused with ": null
    },
    {
        "vinegar": "vinegar"
    },
    {
        ", for curing ": null
    },
    {
        "hiccups": "hiccups"
    },
    {
        ".  Besides its digestive properties, it is used as a mild stimulant.     Chervil has also been implicated in strimmer ": null
    },
    {
        "dermatitis": "dermatitis"
    },
    {
        " , another name for ": null
    },
    {
        "phytophotodermatitis": "phytophotodermatitis"
    },
    {
        ", due to spray from weed trimmers and similar forms of contact. Other plants in the family ": null
    },
    {
        "Apiaceae": "apiaceae"
    },
    {
        " can have similar effects.        Transplanting chervil can be difficult, due to the long ": null
    },
    {
        "taproot": "taproot"
    },
    {
        ". It prefers a cool and moist location; otherwise, it rapidly goes to seed . It is usually grown as a cool-season crop, like ": null
    },
    {
        "lettuce": "lettuce"
    },
    {
        ", and should be planted in early spring and late fall or in a winter greenhouse. Regular harvesting of leaves also helps to prevent bolting. If plants bolt despite precautions, the plant can be periodically re-sown throughout the growing season, thus producing fresh plants as older plants bolt and go out of production.     Chervil grows to a height of , and a width of ": null
    }
]