[
    {
        "           Chester Burton Atkins , known as Mr. Guitar and The Country Gentleman , was an American musician, occasional vocalist, songwriter, and ": null
    },
    {
        "record producer": "record producer"
    },
    {
        " who, along with ": null
    },
    {
        "Owen Bradley": "owen bradley"
    },
    {
        ", ": null
    },
    {
        "Bob Ferguson": "bob ferguson"
    },
    {
        " and others, created the ": null
    },
    {
        "country music": "country music"
    },
    {
        " style that came to be known as the ": null
    },
    {
        "Nashville sound": "nashville sound"
    },
    {
        ", which expanded country musics appeal to adult pop music fans. He was primarily known as a guitarist. He also played the mandolin, fiddle, banjo, and ukulele.     Atkinss signature picking style was inspired by ": null
    },
    {
        "Merle Travis": "merle travis"
    },
    {
        ". Other major guitar influences were ": null
    },
    {
        "Django Reinhardt": "django reinhardt"
    },
    {
        ", ": null
    },
    {
        "George Barnes": "george barnes"
    },
    {
        ", ": null
    },
    {
        "Les Paul": "les paul"
    },
    {
        ", and, later, ": null
    },
    {
        "Jerry Reed": "jerry reed"
    },
    {
        ". His distinctive picking style and musicianship brought him admirers inside and outside the country scene, both in the United States and abroad. Atkins spent most of his career at ": null
    },
    {
        "RCA Victor": "rca victor"
    },
    {
        " and produced records for the ": null
    },
    {
        "Browns": "the browns"
    },
    {
        ", ": null
    },
    {
        "Hank Snow": "hank snow"
    },
    {
        ", ": null
    },
    {
        "Porter Wagoner": "porter wagoner"
    },
    {
        ", ": null
    },
    {
        "Norma Jean": "norma jean"
    },
    {
        ", ": null
    },
    {
        "Dolly Parton": "dolly parton"
    },
    {
        ", ": null
    },
    {
        "Dottie West": "dottie west"
    },
    {
        ", ": null
    },
    {
        "Perry Como": "perry como"
    },
    {
        ", ": null
    },
    {
        "Floyd Cramer": "floyd cramer"
    },
    {
        ", ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        ", the ": null
    },
    {
        "Everly Brothers": "everly brothers"
    },
    {
        ", ": null
    },
    {
        "Eddy Arnold": "eddy arnold"
    },
    {
        ", ": null
    },
    {
        "Don Gibson": "don gibson"
    },
    {
        ", ": null
    },
    {
        "Jim Reeves": "jim reeves"
    },
    {
        ", ": null
    },
    {
        "Jerry Reed": "jerry reed"
    },
    {
        ", ": null
    },
    {
        "Skeeter Davis": "skeeter davis"
    },
    {
        ", ": null
    },
    {
        "Waylon Jennings": "waylon jennings"
    },
    {
        ", and many others.      Rolling Stone  credited Atkins with inventing the popwise Nashville sound that rescued country music from a commercial slump, and ranked him number 21 on their list of The 100 Greatest Guitarists Of All Time. . Rolling Stone. Among many other honors, Atkins received 14 ": null
    },
    {
        "Grammy Awards": "grammy award"
    },
    {
        "and the ": null
    },
    {
        "Grammy Lifetime Achievement Award": "grammy lifetime achievement award"
    },
    {
        ". He also received nine ": null
    },
    {
        "Country Music Association": "country music association"
    },
    {
        " awards for Instrumentalist of the Year. He was inducted into the ": null
    },
    {
        "Rock & Roll Hall of Fame": "rock  &  roll hall of fame"
    },
    {
        ", the ": null
    },
    {
        "Country Music Hall of Fame and Museum": "country music hall of fame and museum"
    },
    {
        ", and the ": null
    },
    {
        "Musicians Hall of Fame and Museum": "musicians hall of fame and museum"
    },
    {
        ". George Harrison was also inspired by Chet Atkins; Early Beatle songs such as All my Loving show the influence.           Atkins was born on June 20, 1924, in ": null
    },
    {
        "Luttrell, Tennessee": "luttrell, tennessee"
    },
    {
        ", near ": null
    },
    {
        "Clinch Mountain": "clinch mountain"
    },
    {
        ". His parents divorced when he was six years old, after which he was raised by his mother. He was the youngest of three boys and a girl. He started out on the ": null
    },
    {
        "ukulele": "ukulele"
    },
    {
        ", later moving on to the ": null
    },
    {
        "fiddle": "fiddle"
    },
    {
        ", but made a swap with his brother, Lowell, when he was nine: an old pistol and some chores for a ": null
    },
    {
        "guitar": "guitar"
    },
    {
        ".  He stated in his 1974 autobiography, We were so poor and everybody around us was so poor that it was the forties before anyone even knew there had been a depression. Forced to relocate to Fortson, ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ", outside of ": null
    },
    {
        "Columbus": "columbus, georgia"
    },
    {
        ", to live with his father because of a critical ": null
    },
    {
        "asthma": "asthma"
    },
    {
        " condition, Atkins was a sensitive youth who made music his obsession. Because of his illness, he was forced to sleep in a straight-back chair to breathe comfortably. On those nights, he played his guitar until he fell asleep holding it, a habit that lasted his whole life. Atkins, Chet; Neely, Bill . Country Gentleman . Chicago. Harry Regnery. . While living in Fortson, he attended the historic Mountain Hill School. He returned in the 1990s to play a series of charity concerts to save the school from demolition.    Stories have been told about the very young Chet, who, when a friend or relative would come to visit and play guitar, would crowd in and put his ear so close to the instrument that it became difficult for the visitor to play.     Atkins became an accomplished guitarist while he was in high school. He used the restroom in the school to practice, because it had good acoustics. Atkins, Chet; Neely, Bill . Country Gentleman . Chicago. Harry Regnery. p. 52. . ": null
    },
    {
        "Halberstam, David": "david halberstam"
    },
    {
        " . liner notes. Chet Atkins Workshop. ": null
    },
    {
        "RCA Victor": "rca victor"
    },
    {
        " LSP-2232. His first guitar had a nail for a nut and was so bowed that only the first few frets could be used. Atkins, Chet; Cochran, Russ . Me and My Guitars . Milwaukee: Hal Leonard. . He later purchased a semi-acoustic electric guitar and amp, but he had to travel many miles to find an electrical outlet, since his home didnt have electricity. Atkins, Chet; Neely, Bill. . Country Gentleman . Chicago. Harry Regnery. pp. 61–62. .     Later in life, he lightheartedly gave himself  the honorary degree CGP .   In 2011, his daughter Merle Atkins Russell bestowed the CGP degree on his longtime sideman ": null
    },
    {
        "Paul Yandell": "paul yandell"
    },
    {
        ". She then declared no more CGPs would be allowed by the Atkins estate.      His half-brother, Jim, was a successful guitarist who worked with the ": null
    },
    {
        "Les Paul Trio": "les paul trio"
    },
    {
        " in New York.     Atkins did not have a strong style of his own until 1939, when he heard ": null
    },
    {
        "Merle Travis": "merle travis"
    },
    {
        " picking over ": null
    },
    {
        "WLW": "wlw"
    },
    {
        " radio.   This early influence dramatically shaped his unique playing style. Whereas Traviss right hand used his index finger for the melody and thumb for bass notes, Atkins expanded his right-hand style to include picking with his first three fingers, with the thumb on bass.     Chet Atkins was an ": null
    },
    {
        "amateur radio": "amateur radio"
    },
    {
        " general class licensee. Formerly using the call sign WA4CZD, he obtained the vanity call sign W4CGP in 1998 to include the CGP designation, which supposedly stood for Certified Guitar Picker . He was a member of the ": null
    },
    {
        "American Radio Relay League": "american radio relay league"
    },
    {
        ".        After dropping out of high school in 1942, Atkins landed a job at ": null
    },
    {
        "WNOX-AM": "wnox"
    },
    {
        " radio in ": null
    },
    {
        "Knoxville": "knoxville, tennessee"
    },
    {
        ", where he played fiddle and guitar with the singer ": null
    },
    {
        "Bill Carlisle": "bill carlisle"
    },
    {
        " and the comic ": null
    },
    {
        "Archie Campbell": "archie campbell"
    },
    {
        " and became a member of the stations Dixieland Swingsters, a small swing instrumental combo. After three years, he moved to ": null
    },
    {
        "WLW-AM": "wlw"
    },
    {
        " in ": null
    },
    {
        "Cincinnati, Ohio": "cincinnati, ohio"
    },
    {
        ", where Merle Travis had formerly worked.     After six months, he moved to Raleigh and worked with ": null
    },
    {
        "Johnnie and Jack": "johnnie and jack"
    },
    {
        " before heading for ": null
    },
    {
        "Richmond, Virginia": "richmond, virginia"
    },
    {
        ", where he performed with ": null
    },
    {
        "Sunshine Sue Workman": "sunshine sue"
    },
    {
        ". Atkinss shy personality worked against him, as did the fact that his sophisticated style led many to doubt he was truly country . He was fired often, but was soon able to land another job at another radio station on account of his unique playing ability.     Atkins and ": null
    },
    {
        "Jethro Burns": "jethro burns"
    },
    {
        "  married twin sisters, Leona and Lois Johnson, who sang as Laverne and Fern Johnson, the Johnson Sisters. Leona Atkins outlived her husband by eight years, dying in 2009 at the age of 85.      Travelling to Chicago, Atkins auditioned for ": null
    },
    {
        "Red Foley": "red foley"
    },
    {
        ", who was leaving his star position on ": null
    },
    {
        "WLS-AMs": "wls"
    },
    {
        "  National Barn Dance  to join the ": null
    },
    {
        "Grand Ole Opry": "grand ole opry"
    },
    {
        ".  Rolling Stone. Accessed on March 28, 2008. Atkins made his first appearance at the Opry in 1946 as a member of Foleys band. He also recorded a single for Nashville-based ": null
    },
    {
        "Bullet Records": "bullet records"
    },
    {
        " that year. That single, Guitar Blues , was fairly progressive, including a clarinet solo by the Nashville dance band musician Dutch McMillan, with ": null
    },
    {
        "Owen Bradley": "owen bradley"
    },
    {
        " on piano. He had a solo spot on the Opry, but when that was cut, Atkins moved on to ": null
    },
    {
        "KWTO": "kwto"
    },
    {
        " in ": null
    },
    {
        "Springfield, Missouri": "springfield, missouri"
    },
    {
        ". Despite the support of executive ": null
    },
    {
        "Si Siman": "si siman"
    },
    {
        ", however, he soon was fired for not sounding country enough .       While working with a Western band in ": null
    },
    {
        "Denver, Colorado": "denver, colorado"
    },
    {
        ", Atkins came to the attention of ": null
    },
    {
        "RCA Victor": "rca victor records"
    },
    {
        ". Siman had been encouraging ": null
    },
    {
        "Steve Sholes": "stephen h. sholes"
    },
    {
        " to sign Atkins, as his style was suddenly in vogue. Sholes, A & R director of country music at RCA, tracked Atkins down in Denver.     He made his first RCA Victor recordings in Chicago in 1947, but they did not sell. He did some studio work for RCA that year, but had relocated to Knoxville again where he worked with Homer and Jethro on WNOXs new Saturday night radio show The Tennessee Barn Dance and the popular Midday Merry Go Round.     In 1949, he left WNOX to join ": null
    },
    {
        "June Carter": "june carter"
    },
    {
        " with Mother Maybelle and the ": null
    },
    {
        "Carter Sisters": "the carter sisters"
    },
    {
        " on KWTO. This incarnation of the old ": null
    },
    {
        "Carter Family": "carter family"
    },
    {
        " featured Maybelle Carter and daughters June, Helen, and Anita. Their work soon attracted attention from the Grand Ole Opry. The group relocated to ": null
    },
    {
        "Nashville": "nashville, tennessee"
    },
    {
        " in the mid-1950s. Atkins began working on recording sessions and performing on ": null
    },
    {
        "WSM-AM": "wsm"
    },
    {
        " and the Opry. Atkins became a member of the Opry in the 1950s.      While he had not yet had a hit record for RCA Victor, his stature was growing. He began assisting Sholes as a session leader when the New York–based producer needed help organizing Nashville sessions for RCA Victor artists. Atkinss first hit single was ": null
    },
    {
        "Mr. Sandman": "mr. sandman"
    },
    {
        " , followed by Silver Bell , which he recorded as a duet with ": null
    },
    {
        "Hank Snow": "hank snow"
    },
    {
        ". His albums also became more popular. He was featured on ABC-TVs  The Eddy Arnold Show  in the summer of 1956 and on  Country Music Jubilee  in 1957 and 1958 .        In addition to recording, Atkins was a design consultant for ": null
    },
    {
        "Gretsch": "gretsch"
    },
    {
        ", which manufactured a popular Chet Atkins line of electric guitars from 1955–1980. He became manager of RCA Victors Nashville studios, eventually inspiring and seeing the completion of the legendary ": null
    },
    {
        "RCA Studio B": "rca studio b"
    },
    {
        ", the first studio built specifically for the purpose of recording on the now-famous ": null
    },
    {
        "Music Row": "music row"
    },
    {
        ". Also later on, Chet and ": null
    },
    {
        "Owen Bradley": "owen bradley"
    },
    {
        " would become instrumental in the creation of studio B’s adjacent building ": null
    },
    {
        "RCA Studio A": "rca studio a"
    },
    {
        " as well.       When Sholes took over pop production in 1957—a result of his success with ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        "—he put Atkins in charge of RCA Victors Nashville division. With country music record sales declining as rock and roll became more popular, Atkins and ": null
    },
    {
        "Bob Ferguson": "bob ferguson"
    },
    {
        " took their cue from ": null
    },
    {
        "Owen Bradley": "owen bradley"
    },
    {
        " and eliminated fiddles and steel guitar as a means of making country singers appeal to pop fans. This became known as the ": null
    },
    {
        "Nashville sound": "nashville sound"
    },
    {
        ", which Atkins said was a label created by the media for a style of recording during that period intended to keep country viable.     Atkins used the ": null
    },
    {
        "Jordanaires": "jordanaires"
    },
    {
        " and a rhythm section on hits such as ": null
    },
    {
        "Jim Reevess": "jim reeves"
    },
    {
        " Four Walls": "four walls"
    },
    {
        " and ": null
    },
    {
        "Hell Have to Go": "hell have to go"
    },
    {
        "  Allmusic entry for Welcome to My World, Jim Reeves 1996 box set, Bear Family Records and ": null
    },
    {
        "Don Gibsons": "don gibson"
    },
    {
        " Oh Lonesome Me": "oh lonesome me"
    },
    {
        " and Blue Blue Day .  Allmusic biography of Don Gibson The once-rare phenomenon of having a country hit ": null
    },
    {
        "cross over": "crossover"
    },
    {
        " to pop success became more common. He and Bradley had essentially put the producer in the drivers seat, guiding an artists choice of material and the musical background.     Atkins made his own records, which usually visited pop standards and ": null
    },
    {
        "jazz": "jazz"
    },
    {
        ", in a sophisticated home studio, often recording the rhythm tracks at RCA and adding his solo parts at home, refining the tracks until the results satisfied him. Guitarists of all styles came to admire various Atkins albums for their unique musical ideas and in some cases experimental electronic ideas. In this period, he became known internationally as Mister Guitar , inspiring an album,  Mister Guitar , engineered by both Bob Ferris and ": null
    },
    {
        "Bill Porter": "bill porter"
    },
    {
        ", Ferriss replacement.        At the end of March 1959, Porter took over as chief engineer at RCAs Nashville studio, in the space eventually known as ": null
    },
    {
        "Studio B": "rca studio b"
    },
    {
        " after the facility expanded with a second studio in 1960. Porter soon helped Atkins get a better reverberation sound from the studios German effects device, an ": null
    },
    {
        "EMT": "elektro-mess-technik"
    },
    {
        " plate reverb": "reverberationplate reverberators"
    },
    {
        ". With his ": null
    },
    {
        "golden ear": "golden ear"
    },
    {
        ", Porter found the studios acoustics to be problematic, and he devised a set of acoustic baffles to hang from the ceiling, then selected positions for microphones based on resonant ": null
    },
    {
        "room modes": "room modes"
    },
    {
        ". The sound of the recordings improved significantly, and the studio achieved a string of successes. The Nashville sound became more ": null
    },
    {
        "dynamic": "dynamic range"
    },
    {
        ".  In later years, when Bradley asked how he achieved his sound, Atkins told him it was Porter.  Porter described Atkins as respectful of musicians when recording—if someone was out of tune, he would not single that person out by name. Instead, he would say something like, we got a little tuning problem  ... Everybody check and see whats going on. If that did not work, Atkins would instruct Porter to turn the offending player down in the mix. When Porter left RCA in late-1964, Atkins said, the sound was never the same, never as great.     Atkinss trademark Atkins style of playing uses the thumb and first two or sometimes three fingers of the right hand. He developed this style from listening to Merle Travis,  occasionally on a primitive radio. He was sure no one could play that articulately with just the thumb and index finger , and he assumed it required the thumb and two fingers—and that was the style he pioneered and mastered.     He enjoyed jamming with fellow studio musicians, and they were asked to perform at the ": null
    },
    {
        "Newport Jazz Festival": "newport jazz festival"
    },
    {
        " in 1960. That performance was cancelled because of rioting, but a live recording of the group  was released. Atkins performed by invitation at the ": null
    },
    {
        "White House": "white house"
    },
    {
        " for every U.S. President from John F. Kennedy through to George H. W. Bush. Atkins was a member of the ": null
    },
    {
        "Million Dollar Band": "million dollar band"
    },
    {
        " during the 1980s. He is also well known for his song Yankee Doodle Dixie , in which he played ": null
    },
    {
        "Yankee Doodle": "yankee doodle"
    },
    {
        " and ": null
    },
    {
        "Dixie": "dixie"
    },
    {
        " simultaneously, on the same guitar.     Before his mentor Sholes died in 1968, Atkins had become vice president of RCAs country division. In 1987, he told ": null
    },
    {
        "Nine-O-One Network magazine": "nine-o-one network magazine"
    },
    {
        " that he was ashamed of his promotion: I wanted to be known as a guitarist and I know, too, that they give you titles like that in lieu of money. So beware when they want to make you vice president. Nine-O-One Interview, Nine-O-One Network Magazine, December 1987, p.10-11 He had brought ": null
    },
    {
        "Waylon Jennings": "waylon jennings"
    },
    {
        ", ": null
    },
    {
        "Willie Nelson": "willie nelson"
    },
    {
        ", ": null
    },
    {
        "Connie Smith": "connie smith"
    },
    {
        ", ": null
    },
    {
        "Bobby Bare": "bobby bare"
    },
    {
        ", ": null
    },
    {
        "Dolly Parton": "dolly parton"
    },
    {
        ", ": null
    },
    {
        "Jerry Reed": "jerry reed"
    },
    {
        ", and ": null
    },
    {
        "John Hartford": "john hartford"
    },
    {
        " to the label in the 1960s and inspired and helped countless others. , Rock and Roll Hall of Fame. Accessed on March 28, 2008. He took a considerable risk during the mid-1960s, when the ": null
    },
    {
        "civil rights movement": "civil rights movement"
    },
    {
        " sparked violence throughout the South, by signing country musics first African-American singer, ": null
    },
    {
        "Charley Pride": "charley pride"
    },
    {
        ", who sang rawer country than the smoother music Atkins had pioneered.     Atkinss biggest hit single came in 1965, with Yakety Axe , an adaptation of ": null
    },
    {
        "Yakety Sax": "yakety sax"
    },
    {
        " , by his friend, the saxophonist ": null
    },
    {
        "Boots Randolph": "boots randolph"
    },
    {
        ". He rarely performed in those days and eventually hired other RCA producers, such as ": null
    },
    {
        "Bob Ferguson": "bob ferguson"
    },
    {
        " and ": null
    },
    {
        "Felton Jarvis": "felton jarvis"
    },
    {
        ", to lessen his workload.       In the 1970s, Atkins became increasingly stressed by his executive duties. He produced fewer records, but could still turn out hits such as ": null
    },
    {
        "Perry Comos": "perry como"
    },
    {
        "1973 pop hit ": null
    },
    {
        "And I Love You So": "and i love you so"
    },
    {
        " . He recorded extensively with close friend and fellow picker Jerry Reed, who had become a hit artist in his own right. A 1973 diagnosis of ": null
    },
    {
        "colon cancer": "colorectal cancer"
    },
    {
        ", however, led Atkins to redefine his role at RCA, to allow others to handle administration while he went back to his first love, the guitar, often recording with Reed or even Jethro Burns from Homer and Jethro after Homer died in 1971. Atkins would turn over his administrative duties to ": null
    },
    {
        "Jerry Bradley": "jerry bradley"
    },
    {
        ", son of Owen, in 1973 at RCA.     Atkins did little production work at RCA after stepping down and in fact, had hired producers at the label in the 1960s, among them ": null
    },
    {
        "Bob Ferguson": "bob ferguson"
    },
    {
        " and ": null
    },
    {
        "Felton Jarvis": "felton jarvis"
    },
    {
        ". As a recording artist, Atkins grew disillusioned with RCA in the late 1970s. He felt stifled because the record company would not let him branch into jazz. He had also produced late 60s jazz recordings by Canadian guitarist ": null
    },
    {
        "Lenny Breau": "lenny breau"
    },
    {
        ", a friend and protege. His mid-1970s collaborations with one of his influences, ": null
    },
    {
        "Les Paul": "les paul"
    },
    {
        ",  Chester & Lester  and  Guitar Monsters , had already reflected that interest; Chester & Lester was one of the best-selling recordings of Atkinss career. At the same time, he grew dissatisfied with the direction Gretsch was going and withdrew his authorization for them to use his name and began designing guitars with ": null
    },
    {
        "Gibson": "gibson guitar corporation"
    },
    {
        ". Atkins ended his 35-year association with RCA in 1982 and signed with ": null
    },
    {
        "Columbia Records": "columbia records"
    },
    {
        ", for whom he produced a debut album in 1983.     Jazz had always been a strong love of his, and often in his career he was criticized by pure country musicians for his jazz influences. He also said on many occasions that he did not like being called a country guitarist, insisting that he was a guitarist, period. Although he played ": null
    },
    {
        "by ear": "playing by ear"
    },
    {
        " and was a masterful improviser, he was able to read music and even performed some classical guitar pieces. When ": null
    },
    {
        "Roger C. Field": "roger c. field"
    },
    {
        ", a friend, suggested to him in 1991 that he record and perform with a female singer, he did so with ": null
    },
    {
        "Suzy Bogguss": "suzy bogguss"
    },
    {
        ".     He returned to his country roots for albums he recorded with ": null
    },
    {
        "Mark Knopfler": "mark knopfler"
    },
    {
        " and Jerry Reed. Knopfler had long mentioned Atkins as one of his earliest influences. Atkins also collaborated with Australian guitar legend ": null
    },
    {
        "Tommy Emmanuel": "tommy emmanuel"
    },
    {
        ". On being asked to name the ten most influential guitarists of the twentieth century, he named ": null
    },
    {
        "Django Reinhardt": "django reinhardt"
    },
    {
        " to the first position, and also placed himself on the list. . Accessed on August 27, 2014.     In later years, he even went back to radio, appearing on ": null
    },
    {
        "Garrison Keillors": "garrison keillor"
    },
    {
        "  Prairie Home Companion  radio program, on ": null
    },
    {
        "American Public Media": "american public media"
    },
    {
        " radio, even picking up a fiddle from time to time, and performing songs such as ": null
    },
    {
        "Bob Willss": "bob wills"
    },
    {
        " Corrina, Corrina": "corrina, corrina"
    },
    {
        " and ": null
    },
    {
        "Willie Nelsons": "willie nelson"
    },
    {
        " Seven Spanish Angels": "seven spanish angels"
    },
    {
        " with Nelson on a 1985 broadcast of the show at the Bridges Auditorium on the campus of ": null
    },
    {
        "Pomona College": "pomona college"
    },
    {
        ".       Atkins received numerous awards, including 14 Grammy awards and nine Country Music Association awards for Instrumentalist of the Year. In 1993, he was honored with the Grammy Lifetime Achievement Award. Billboard magazine awarded him its Century Award, its highest honor for distinguished creative achievement, in December 1997. . Rolling Stone. Accessed on May 10, 2008.     Atkins is notable for his broad influence. His love for numerous styles of music can be traced from his early recording of the stride pianist ": null
    },
    {
        "James P. Johnsons": "james p. johnson"
    },
    {
        " Johnson Rag , all the way to the rock stylings of ": null
    },
    {
        "Eric Johnson": "eric johnson"
    },
    {
        ", an invited guest on Atkinss recording sessions, who, when Atkins attempted to copy his influential rocker ": null
    },
    {
        "Cliffs of Dover": "cliffs of dover"
    },
    {
        " , led to Atkinss creation of a unique arrangement of Londonderry Air .     The classical guitar selections included on almost all his albums were, for many American artists working in the field today, the first classical guitar they ever heard. He recorded ": null
    },
    {
        "smooth jazz": "smooth jazz"
    },
    {
        " guitar still played on American airwaves today.     Atkins continued performing in the 1990s, but his health declined after he was diagnosed again with colon cancer in 1996. He died on June 30, 2001, at his home in Nashville, Tennessee, at the age of 77.  , CNN, July 2, 2001 Accessed June 21, 2008 His memorial service was held at Ryman Auditorium in Nashville.  He was buried at Harpeth Hills Memory Gardens in Nashville.  Accessed November 24, 2010     A stretch of ": null
    },
    {
        "Interstate 185": "interstate 185"
    },
    {
        " in southwest ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        "  is named Chet Atkins Parkway .  This stretch of interstate runs through Fortson, where Atkins spent much of his childhood.     In 2002, Atkins was posthumously inducted into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "rock and roll hall of fame"
    },
    {
        ". His award was presented by ": null
    },
    {
        "Marty Stuart": "marty stuart"
    },
    {
        " and ": null
    },
    {
        "Brian Setzer": "brian setzer"
    },
    {
        " and accepted by Atkinss grandson, Jonathan Russell. The following year, Atkins ranked number 28 in ": null
    },
    {
        "Country Music Televisions": "country music television"
    },
    {
        " 40 Greatest Men of Country Music .     At the age of 13, the future jazz guitarist ": null
    },
    {
        "Earl Klugh": "earl klugh"
    },
    {
        " was captivated watching Atkinss guitar playing on The Perry Como Show.  Similarly, he was a big influence on ": null
    },
    {
        "Doyle Dykes": "doyle dykes"
    },
    {
        ". Atkins also inspired Drexl Jonez and Tommy Emmanuel.   Retrieved September 2009.     ": null
    },
    {
        "Clint Blacks": "clint black"
    },
    {
        "album  Nothin but the Taillights  includes the song Ode to Chet , which includes the lyrics Cause I can win her over like Romeo did Juliet, if I can only show her I can almost pick that legato lick like Chet and Itll take more than ": null
    },
    {
        "Mel Bay": "mel bay"
    },
    {
        " 1, 2, & 3 if Im ever gonna play like CGP. Atkins played guitar on the track. At the end of the song, Black and Atkins had a brief conversation.     Chets song Jam Man is currently used in commercials for Esurance.     The opening guitar licks to the ": null
    },
    {
        "Miranda Lambert": "miranda lambert"
    },
    {
        " song ": null
    },
    {
        "Only Prettier": "only prettier"
    },
    {
        " sound very similar to Atkinss guitar-picking style.     In 1967, a tribute song, Chets Tune , was produced for his birthday, with contributions by a long list of RCA Victor artists, including Eddy Arnold, Connie Smith, Jerry Reed, Willie Nelson, Hank Snow, and others. The song was written by the Nashville songwriter ": null
    },
    {
        "Cy Coben": "cy coben"
    },
    {
        ", a friend of Atkinss. The single reached number 38 on the country charts. Billboard, June 3, 1967, p. 41. McClellan, John; Bratic, Deyan. Chet Atkins in Three Dimensions: 50 Years of Legendary Guitar, vol. 1. Pacific, MO: Mel Bay Publications. pp. 47–49.      In 2009, ": null
    },
    {
        "Steve Wariner": "steve wariner"
    },
    {
        " released an album titled My Tribute to Chet Atkins. One song from that record, Producers Medley , featured Wariners recreation of several famous songs that Atkins both produced and performed. Producers Medley won the Grammy for Best Country Instrumental Performance in 2010.     In November 2011, ": null
    },
    {
        "Rolling Stone": "rolling stone"
    },
    {
        " ranked Atkins number 21 on their list of the 100 Greatest Guitarists of All Time .               Country Music Association  ": null
    },
    {
        "1967 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1968 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1969 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1981 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1982 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1983 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1984 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1985 Instrumentalist of the Year": "country music association awards"
    },
    {
        " 1988 Instrumentalist of the Year": "country music association awards"
    },
    {
        "      Country Music Hall of Fame and Museum  ": null
    },
    {
        "Inducted in 1973": "inductees of the country music hall of fame"
    },
    {
        "      Grammy Awards  ": null
    },
    {
        "1971 Best Country Instrumental Performance": "grammy award for best country instrumental performance"
    },
    {
        " with ": null
    },
    {
        "Jerry Reed": "jerry reed"
    },
    {
        "  – Me and Jerry ": null
    },
    {
        "Merle Travis": "merle travis"
    },
    {
        "  – The Atkins-Travis Traveling Show ": null
    },
    {
        "Les Paul": "les paul"
    },
    {
        "  – Chester and Lester Country After All These Years ": null
    },
    {
        "Mark Knopfler": "mark knopfler"
    },
    {
        "  – Cosmic Square Dance   1991 Best Country Instrumental Performance with ": null
    },
    {
        "Mark Knopfler": "mark knopfler"
    },
    {
        "  – So Soft, Your Goodbye   ": null
    },
    {
        "1991 Best Country Vocal Collaboration": "grammy award for best country collaboration with vocals"
    },
    {
        " with ": null
    },
    {
        "Mark Knopfler": "mark knopfler"
    },
    {
        "  – Poor Boy Blues   1993 Best Country Instrumental Performance with ": null
    },
    {
        "Jerry Reed": "jerry reed"
    },
    {
        "  – Sneakin Around ": null
    },
    {
        "1993 Grammy Lifetime Achievement Award": "grammy lifetime achievement award"
    },
    {
        "   1994 Best Country Instrumental Performance with ": null
    },
    {
        "Asleep at the Wheel": "asleep at the wheel"
    },
    {
        ", ": null
    },
    {
        "Eldon Shamblin": "eldon shamblin"
    },
    {
        ", ": null
    },
    {
        "Johnny Gimble": "johnny gimble"
    },
    {
        ", ": null
    },
    {
        "Marty Stuart": "marty stuart"
    },
    {
        ", Reuben Lucky Oceans Gosfield & ": null
    },
    {
        "Vince Gill": "vince gill"
    },
    {
        "  – Red Wing   1995 Best Country Instrumental Performance  – Young Thing   1997 Best Country Instrumental Performance  – Jam Man      Rock and Roll Hall of Fame  ": null
    },
    {
        "Inductees of the Rock and Roll Hall of Fame": "inductees of the rock and roll hall of fame"
    }
]