[
    {
        "        The Chief of Naval Operations  is the head of the ": null
    },
    {
        "United States Navy": "United States Navy"
    },
    {
        ". The position is a statutory office  held by a ": null
    },
    {
        "four-star admiral": "Admiral"
    },
    {
        " who is a military adviser and deputy to the ": null
    },
    {
        "Secretary of the Navy": "United States Secretary Of The Navy"
    },
    {
        ". In a separate capacity as a member of the ": null
    },
    {
        "Joint Chiefs of Staff": "Joint Chiefs Of Staff"
    },
    {
        "  the CNO is a military adviser to the ": null
    },
    {
        "National Security Council": "United States National Security Council"
    },
    {
        ", the ": null
    },
    {
        "Homeland Security Council": "United States Homeland Security Council"
    },
    {
        ", the ": null
    },
    {
        "Secretary of Defense": "United States Secretary Of Defense"
    },
    {
        ", and the ": null
    },
    {
        "President": "President Of The United States"
    },
    {
        ". The current Chief of Naval Operations is ": null
    },
    {
        " Admiral Michael M. Gilday": "Michael M. Gilday"
    },
    {
        ".     Despite the title, the CNO does not have operational command authority over Naval forces. The CNO is an administrative position based in ": null
    },
    {
        "the Pentagon": "The Pentagon"
    },
    {
        ", and exercises supervision of Navy organizations as the designee of the Secretary of the Navy. Operational command of naval forces falls within the purview of the ": null
    },
    {
        "Combatant Commanders": "Unified Combatant Command"
    },
    {
        " who report to the Secretary of Defense.       The Chief of Naval Operations is typically the highest-ranking officer on ": null
    },
    {
        "active duty": "Active Duty"
    },
    {
        " in the U.S. Navy unless the ": null
    },
    {
        "Chairman": "Chairman Of The Joint Chiefs Of Staff"
    },
    {
        " and/or the ": null
    },
    {
        "Vice Chairman of the Joint Chiefs of Staff": "Vice Chairman Of The Joint Chiefs Of Staff"
    },
    {
        " are naval officers.     As per , whenever there is a vacancy for the Chief of Naval Operations or during the absence or disability of the Chief of Naval Operations, and unless the President directs otherwise, the ": null
    },
    {
        "Vice Chief of Naval Operations": "Vice Chief Of Naval Operations"
    },
    {
        " performs the duties of the Chief of Naval Operations until a successor is appointed or the absence or disability ceases.        The CNO also performs all other functions prescribed under , such as presiding over the Office of the Chief of Naval Operations , exercising supervision of ": null
    },
    {
        "Navy organizations": "Structure Of The United States Navy"
    },
    {
        ", and other duties assigned by the Secretary or higher lawful authority, or the CNO delegates those duties and responsibilities to other officers in OPNAV or in organizations below.      Acting for the Secretary of the Navy, the CNO also designates naval personnel and naval forces available to the commanders of ": null
    },
    {
        "Unified Combatant Command": "Unified Combatant Command"
    },
    {
        "s, subject to the approval of the Secretary of Defense.         The CNO is a member of the ": null
    },
    {
        "Joint Chiefs of Staff": "Joint Chiefs Of Staff"
    },
    {
        " as prescribed by  and . Like the other members of the Joint Chiefs of Staff, the CNO is an administrative position, with no operational command authority over the United States Navy forces.     Members of the Joint Chiefs of Staff, individually or collectively, in their capacity as military advisers, shall provide advice to the President, the ": null
    },
    {
        "National Security Council": "National Security Council"
    },
    {
        " , or the Secretary of Defense on a particular matter when the President, the NSC, or SECDEF requests such advice. Members of the Joint Chiefs of Staff  may submit to the Chairman advice or an opinion in disagreement with, or advice or an opinion in addition to, the advice presented by the Chairman to the President, NSC, or SECDEF.     When performing his JCS duties, the CNO is responsible directly to the SECDEF, but keeps SECNAV fully informed of significant military operations affecting the duties and responsibilities of the SECNAV, unless SECDEF orders otherwise.        The Chief of Naval Operations is nominated by the President for appointment and must be confirmed by the ": null
    },
    {
        "Senate": "United States Senate"
    },
    {
        ".  A requirement for being Chief of Naval Operations is having significant experience in joint duty assignments, which includes at least one full tour of duty in a joint duty assignment as a flag officer. However, the president may waive those requirements if he determines that appointing the officer is necessary for the national interest. By statute, the CNO is appointed as a four-star ": null
    },
    {
        "admiral": "Admiral"
    },
    {
        ".       ": null
    },
    {
        "Number One Observatory Circle": "Number One Observatory Circle"
    },
    {
        ", located on the northeast grounds of the ": null
    },
    {
        "United States Naval Observatory": "United States Naval Observatory"
    },
    {
        " in Washington, DC, was built in 1893 for its superintendent. The Chief of Naval Operations liked the house so much that in 1923 he took over the house as his own ": null
    },
    {
        "official residence": "Official Residence"
    },
    {
        ". It remained the residence of the CNO until 1974, when ": null
    },
    {
        "Congress": "United States Congress"
    },
    {
        " authorized its transformation to an official residence for the ": null
    },
    {
        "Vice President": "Vice President Of The United States"
    },
    {
        ".  The Chief of Naval Operations currently resides in ": null
    },
    {
        "Quarters A": "Officers Quarters, Washington Navy Yardquarters A"
    },
    {
        " in the ": null
    },
    {
        "Washington Naval Yard": "Washington Naval Yard"
    },
    {
        ".          The Chief of Naval Operations presides over the Navy Staff, formally known as the Office of the Chief of Naval Operations .   Chief of Naval Operations − Responsibilities. Retrieved 3 July 2010.    The Office of the Chief of Naval Operations is a statutory organization within the executive part of the Department of the Navy, and its purpose is to furnish professional assistance to the Secretary of the Navy and the CNO in carrying out their responsibilities.       The OPNAV organization consists of:   The Chief of Naval Operations   The ": null
    },
    {
        "Vice Chief of Naval Operations": "Vice Chief Of Naval Operations"
    },
    {
        " , the principal deputy of the Chief of Naval Operations, delegated complete authority to act for the CNO in all matters not specifically reserved by law to the CNO.   The Director of the Navy Staff .   Several Deputy Chiefs of Naval Operations  of either ": null
    },
    {
        "three": "Vice Admiral"
    },
    {
        " or ": null
    },
    {
        "two-star rank": "Rear Admiral Rear Admiral"
    },
    {
        ", heading functional directorates.   DCNO Manpower, Personnel, Training, & Education/": null
    },
    {
        "Chief of Naval Personnel": "Chief Of Naval Personnel"
    },
    {
        " Director of the Office of Naval Intelligence": "Director Of The Office Of Naval Intelligence"
    },
    {
        " Master Chief Petty Officer of the Navy": "Master Chief Petty Officer Of The Navy"
    },
    {
        " , appointed by the Chief of Naval Operations to serve as a spokesperson to address the issues of enlisted personnel to the highest positions in the Navy.   The ": null
    },
    {
        "Director of the Naval Nuclear Propulsion Program": "Naval Reactors"
    },
    {
        ", a unique eight-year posting held by a 4 star admiral, which was originally created and served in by Admiral ": null
    },
    {
        "Hyman G. Rickover": "Hyman G. Rickover"
    },
    {
        ". The appointment as Director is both a military and civilian position as it is the head of the Naval Nuclear Propulsion Program in the ": null
    },
    {
        "Department of the Navy": "United States Department Of The Navy"
    },
    {
        " and deputy administrator for the Office of Naval Reactors of the ": null
    },
    {
        "National Nuclear Security Administration": "National Nuclear Security Administration"
    },
    {
        " in the ": null
    },
    {
        "Department of Energy": "United States Department Of Energy"
    },
    {
        ".      The ": null
    },
    {
        "Surgeon General of the Navy": "Surgeon General Of The United States Navy"
    },
    {
        ", the most senior officer in the ": null
    },
    {
        "Medical Corps": "Medical Corps"
    },
    {
        " who heads the ": null
    },
    {
        "Bureau of Medicine and Surgery": "Bureau Of Medicine And Surgery"
    },
    {
        " .   The ": null
    },
    {
        "Chief of Navy Reserve/Commander, Navy Reserve Force": "United States Navy Reserve"
    },
    {
        ".   The ": null
    },
    {
        "Chief of Chaplains": "Chief Of Chaplains Of The United States Navy"
    },
    {
        ".   In addition, there are officials who are by either law or regulation part of the ": null
    },
    {
        "Office of the Secretary of the Navy": "Office Of The Secretary Of The Navy"
    },
    {
        " , but who advise the CNO and OPNAV, on an additional duty basis, within their area of specialty, these include:   Special Assistant for Public Affairs Support, additional duty for the ": null
    },
    {
        "Chief of Information": "Public Affairs Navy"
    },
    {
        " .   Special Assistant for Inspection Support, additional duty for the ": null
    },
    {
        "Naval Inspector General": "Naval Inspector General"
    },
    {
        " .   Special Assistant for Legal Services, additional duty for the ": null
    },
    {
        "Judge Advocate General of the Navy": "Judge Advocate General Of The Navy"
    },
    {
        " .   Special Assistant for Legislative Support, additional duty for the ": null
    },
    {
        "Chief of Legislative Affairs": "Office Of Legislative Affairs"
    },
    {
        " .   Special Assistant for Naval Investigative Matters and Security, additional duty for the ": null
    },
    {
        "Director of the Naval Criminal Investigative Service": "Naval Criminal Investigative Service"
    },
    {
        ".     Policy documents emanating from the CNO are issued in the form of ": null
    },
    {
        "OPNAV Instruction": "Opnav Instruction"
    },
    {
        "s.     OPNAV is one of the three headquarters staffs in Department of the Navy mainly based at ": null
    },
    {
        "The Pentagon": "The Pentagon"
    },
    {
        ", with the others being the Office of the Secretary of the Navy and ": null
    },
    {
        "Headquarters, Marine Corps": "Headquarters, Marine Corps"
    },
    {
        ".       The position of CNO replaced the position of Aide for Naval Operations, which was a position established by regulation rather than statutory law.                                                                                                               ": null
    }
]