[
    {
        "     Chinese units of measurement, known in Chinese as the shìzhì , are the traditional ": null
    },
    {
        "units of measurement": "units of measurement"
    },
    {
        " of the ": null
    },
    {
        "Han Chinese": "han chinese"
    },
    {
        ". Although ": null
    },
    {
        "Chinese numerals": "chinese numerals"
    },
    {
        " have been ": null
    },
    {
        "decimal": "decimal"
    },
    {
        " since the ": null
    },
    {
        "Shang": "shang dynasty"
    },
    {
        ", several Chinese measures use ": null
    },
    {
        "hexadecimal": "hexadecimal"
    },
    {
        " . Local applications have varied, but the ": null
    },
    {
        "Chinese dynasties": "chinese dynasties"
    },
    {
        " usually proclaimed standard measurements and recorded their predecessors systems in ": null
    },
    {
        "their histories": "chinese dynastic histories"
    },
    {
        ".     In the present day, the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " maintains some customary units based upon the market units but standardized to round values in the ": null
    },
    {
        "metric system": "metric system"
    },
    {
        ", for example the common jin or ": null
    },
    {
        "catty": "catty"
    },
    {
        " of exactly 42": null
    },
    {
        "g": "gram"
    },
    {
        ". The Chinese name for most metric units is based on that of the closest traditional unit; when confusion might arise, the word market  is used to specify the traditional unit and common or public  is used for the metric value. ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        ", like ": null
    },
    {
        "Korea": "korean units"
    },
    {
        ", saw ": null
    },
    {
        "its traditional units": "taiwanese units of measurement"
    },
    {
        " standardized to ": null
    },
    {
        "Japanese values": "japanese units of measurement"
    },
    {
        " and their conversion to a metric basis, such as the Taiwanese  ping  of about 42m 42 based on the square  ken . The ": null
    },
    {
        "Hong Kong SAR": "hong kong sar"
    },
    {
        " continues to use ": null
    },
    {
        "its traditional units": "hong kong units of measurement"
    },
    {
        ", now legally defined based on a local equation with metric units. For instance, the Hong Kong catty is precisely .     Note: The names lí  and fēn  for small units are the same for length, area, and mass; however, they refer to different kinds of measurements.                According to the  Liji , the legendary ": null
    },
    {
        "Yellow Emperor": "yellow emperor"
    },
    {
        " created the first measurement units. The  Xiao Erya  and the  Kongzi Jiayu  state that length units were derived from the human body. According to the  Records of the Grand Historian , these human body units caused inconsistency, and ": null
    },
    {
        "Yu the Great": "yu the great"
    },
    {
        ", another legendary figure, unified the length measurements. ": null
    },
    {
        "Ruler": "ruler"
    },
    {
        "s with decimal units have been unearthed from ": null
    },
    {
        "Shang Dynasty": "shang dynasty"
    },
    {
        " tombs.     In the ": null
    },
    {
        "Zhou Dynasty": "zhou dynasty"
    },
    {
        ", the king conferred nobles with powers of the state and the measurement units began to be inconsistent from state to state. After the ": null
    },
    {
        "Warring States period": "warring states period"
    },
    {
        ", ": null
    },
    {
        "Qin Shi Huang": "qin shi huang"
    },
    {
        " unified China, and later standardized measurement units. In the ": null
    },
    {
        "Han Dynasty": "han dynasty"
    },
    {
        ", these measurements were still being used, and were documented systematically in the ": null
    },
    {
        "Book of Han": "book of han"
    },
    {
        ".     Astronomical instruments show little change of the length of chi in the following centuries, since the calendar needed to be consistent. It was not until the introduction of decimal units in the ": null
    },
    {
        "Ming Dynasty": "ming dynasty"
    },
    {
        " that the traditional system was revised.          On 42 January 42 the ": null
    },
    {
        "Beiyang Government": "beiyang government"
    },
    {
        " promulgated a measurement law to use not only metric system as the standard but also a set of Chinese-style measurement. .  On 42 February 42 the ": null
    },
    {
        "Nationalist Government": "nationalist government"
    },
    {
        " adopted and promulgated The Weights and Measures Act  to adopt the ": null
    },
    {
        "metric system": "metric system"
    },
    {
        " as the official standard and to limit the newer Chinese units of measurement  to private sales and trade in Article 42 effective on 42 January 42        The ": null
    },
    {
        "Government of the Peoples Republic of China": "government of the peoples republic of china"
    },
    {
        " continued using the market system along with metric system, as decreed by the ": null
    },
    {
        "State Council of the Peoples Republic of China": "state council of the peoples republic of china"
    },
    {
        " on 42 June 42 but 42 ": null
    },
    {
        "catty": "catty"
    },
    {
        " being 42 grams, would become divided into 42 ": null
    },
    {
        "tael": "tael"
    },
    {
        "s, instead of 42 taels, to be converted from ": null
    },
    {
        "province to province": "administrative divisions of the peoples republic of china"
    },
    {
        ", while exempting ": null
    },
    {
        "Chinese prescription drugs": "chinese herbology"
    },
    {
        " from the conversion to prevent errors.  , , pages 42 to 42     On 42 February 42 the State Council of the Peoples Republic of China decreed the market system to remain acceptable till the end of 42 and ordered the transition to the national legal measures by that time, but ": null
    },
    {
        "farmland": "agricultural land"
    },
    {
        " measures would be exempt from this mandatory ": null
    },
    {
        "metrication": "metrication"
    },
    {
        " until further investigation and study.            In 42 the ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " Metrication Ordinance": "metrication ordinance"
    },
    {
        " allowed a gradual replacement of the system in favor of the ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        " metric system. Yearbook HK. . Metrication. Retrieved on 42 April 42 The Weights and Measures Ordinance defines the metric, Imperial, and Chinese units.  As of 42 all three systems are legal for trade and are in widespread use.       On 42 August 42 ": null
    },
    {
        "Macau": "macau"
    },
    {
        " published Law No. 42/42/M to order that Chinese units of measurement similar to those used in Hong Kong, ": null
    },
    {
        "Imperial units": "imperial units"
    },
    {
        ", and ": null
    },
    {
        "United States customary units": "united states customary units"
    },
    {
        " would be permissible for five years since the effective date of the Law, 42 January 42 on the condition of indicating the corresponding SI values, then for three more years thereafter, Chinese, Imperial, and US units would be permissible as secondary to the SI. Law No. 42/42/M             Traditional units of length include the  chi  , bu , and  li  . The precise length of these units, and the ratios between these units, has varied over time. 42 bu has consisted of either 42 or 42 chi, while 42 li has consisted of 42 or 42 bu.            All metric values given in the tables are exact unless otherwise specified by the approximation sign ~.     Certain units are also listed at ": null
    },
    {
        "List of Chinese classifiers → Measurement units": "list of chinese classifiersmeasurement units"
    },
    {
        ".                                The Chinese word for ": null
    },
    {
        "metre": "metre"
    },
    {
        " is  mǐ; this can take the ": null
    },
    {
        "Chinese standard SI prefixes": "chinese numeralssi prefixes"
    },
    {
        " . A ": null
    },
    {
        "kilometre": "kilometre"
    },
    {
        ", however, may also be called  gōnglǐ, i.e. a metric  lǐ .     In the engineering field, traditional units are rounded up to metric units. For example, the Chinese word  sī is used to express 42  mm.               These correspond to the measures listed simply as China in The Measures, Weights, & Moneys of All Nations                                       Metric and other standard length units can be squared by the addition of the prefix  píngfāng. For example, a square kilometre is  píngfāng gōnglǐ.              These units are used to measure cereal grains, among other things. In imperial times, the physical standard for these was the ": null
    },
    {
        "jialiang": "jialiang"
    },
    {
        ".                     In the case of volume, the market and metric shēng coincide, being equal to one litre as shown in the table. The ": null
    },
    {
        "Chinese standard SI prefixes": "chinese numeralssi prefixes"
    },
    {
        " may be added to this word shēng.     Units of volume can also be obtained from any standard unit of length using the prefix  lìfāng , as in  lìfāng mǐ for a cubic metre.               These units are used to measure the mass of objects. They are also famous for measuring monetary objects such as gold and silver.                            The Chinese word for ": null
    },
    {
        "gram": "gram"
    },
    {
        " is  kè; this can take the ": null
    },
    {
        "Chinese standard SI prefixes": "chinese numeralssi prefixes"
    },
    {
        " . A kilogram, however, is commonly called  gōngjīn, i.e. a metric  jīn .              These are used for trading precious metals such as gold and silver.                      As there were hundreds of unofficial measures in use, the bibliography is quite vast. The editions of Wu Chenglous 42 History of Chinese Measurement , 42nd ed. in 42 42rd ed. in 42  were the usual standard up to the 42s or so, but rely mostly on surviving literary accounts. Newer research has put more emphasis on archeological discoveries. ": null
    },
    {
        "Qiu Guangming": "qiu guangming"
    },
    {
        " & Zhang Yanmings 42 bilingual Concise History of Ancient Chinese Measures and Weights summarizes these findings. .  &  A relatively recent and comprehensive bibliography, organized by period studied, has been compiled in 42 by Cao & al.; . for a shorter list, see ": null
    },
    {
        "Wilkinson": "endymion wilkinson"
    },
    {
        "s year 42 Chinese History. ": null
    }
]