[
    {
        "     Chinese numerals are words and characters used to denote ": null
    },
    {
        "numbers": "number"
    },
    {
        "in ": null
    },
    {
        "Chinese": "chinese language"
    },
    {
        ".     Today, speakers of Chinese use three written ": null
    },
    {
        "numeral system": "numeral system"
    },
    {
        "s: the system of ": null
    },
    {
        "Arabic numerals": "arabic numerals"
    },
    {
        " used worldwide, and two indigenous systems. The more familiar indigenous system is based on ": null
    },
    {
        "Chinese characters": "chinese character"
    },
    {
        "that correspond to ": null
    },
    {
        "numerals in the spoken language": "numeral"
    },
    {
        ". These are shared with other languages of the ": null
    },
    {
        "Chinese cultural sphere": "chinese cultural sphere"
    },
    {
        " such as Japanese, Korean and Vietnamese. Most people and institutions in China and Taiwan primarily use the Arabic or mixed Arabic-Chinese systems for convenience, with traditional Chinese numerals used in finance, mainly for writing amounts on checks, banknotes, some ceremonial occasions, some boxes, and on commercials.        The other indigenous system is the ": null
    },
    {
        "Suzhou numerals": "suzhou numerals"
    },
    {
        ", or huama, a positional system, the only surviving form of the ": null
    },
    {
        "rod numerals": "rod numerals"
    },
    {
        ". These were once used by Chinese mathematicians, and later in Chinese markets, such as those in ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " before the 1990s, but have been gradually supplanted by Arabic  numerals.          The Chinese character numeral system consists of the ": null
    },
    {
        "Chinese characters": "chinese characters"
    },
    {
        " used by the ": null
    },
    {
        "Chinese written language": "chinese written language"
    },
    {
        " to write spoken numerals. Similar to spelling-out numbers in English , it is not an independent system per se. Since it reflects spoken language, it does not use the positional system as in ": null
    },
    {
        "Arabic numerals": "arabic numerals"
    },
    {
        ", in the same way that spelling out numbers in English does not.       There are characters representing the numbers zero through nine, and other characters representing larger numbers such as tens, hundreds, thousands and so on. There are two sets of characters for Chinese numerals: one for everyday writing, known as xiǎoxiě , and one for use in commercial or financial contexts, known as dàxiě . The latter arose because the characters used for writing numerals are geometrically simple, so simply using those numerals cannot prevent forgeries in the same way spelling numbers out in English would.   A forger could easily change the everyday characters ": null
    },
    {
        "三十": "wikt:三十"
    },
    {
        " to ": null
    },
    {
        "五千": "wikt:五千"
    },
    {
        " just by adding a few strokes. That would not be possible when writing using the financial characters ": null
    },
    {
        "叁拾": "wikt:叁拾"
    },
    {
        " and ": null
    },
    {
        "伍仟": "wikt:伍仟"
    },
    {
        " . They are also referred to as bankers numerals , anti-fraud numerals , or bankers anti-fraud numerals . For the same reason, rod numerals were never used in commercial records.     T denotes ": null
    },
    {
        "Traditional Chinese characters": "traditional chinese characters"
    },
    {
        ", while S denotes ": null
    },
    {
        "Simplified Chinese characters": "simplified chinese characters"
    },
    {
        ".                     In the ": null
    },
    {
        "Peoples Liberation Army": "peoples liberation army"
    },
    {
        " of the Peoples Republic of China, some numbers will have altered names when used for ": null
    },
    {
        "clearer radio communications": "radiotelephony procedure"
    },
    {
        ". They are: “军语”里的那些秘密    0: renamed 洞 lit. hole   1: renamed 幺 lit. small   2: renamed 两 lit. double   7: renamed 拐 lit. cane, turn   9: renamed 勾 lit. hook       For numbers larger than 10,000, similarly to the ": null
    },
    {
        "long and short scales": "long and short scales"
    },
    {
        " in the West, there have been four systems in ancient and modern usage. The original one, with unique names for all powers of ten up to the 14th, is ascribed to the ": null
    },
    {
        "Yellow Emperor": "yellow emperor"
    },
    {
        " in the 6th century book by Zhen Luan, Wujing suanshu . In modern Chinese only the second system is used, in which the same ancient names are used, but each represents a number 10,000  times the previous:      In practice, this situation does not lead to ambiguity, with the exception of 兆 , which means 10 12 according to the system in common usage throughout the Chinese communities as well as in ": null
    },
    {
        "Japan": "japanese numerals"
    },
    {
        " and ": null
    },
    {
        "Korea": "korean numerals"
    },
    {
        ", but has also been used for 10 6 in recent years . To avoid problems arising from the ambiguity, the ": null
    },
    {
        "PRC": "peoples republic of china"
    },
    {
        " government never uses this character in official documents, but uses 万亿 or 太  instead. Partly due to this, combinations of 万 and 亿 are often used instead of the larger units of the traditional system as well, for example 亿亿 instead of 京. The ": null
    },
    {
        "ROC": "republic of china"
    },
    {
        " government in ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " uses 兆 to mean 10 12 in official documents.          Numerals beyond 載 zǎi come from ": null
    },
    {
        "Buddhist texts": "buddhist texts"
    },
    {
        " in ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        ", but are mostly found in ancient texts. Some of the following words are still being used today, but may have transferred meanings.            The following are characters used to denote small ": null
    },
    {
        "order of magnitude": "order of magnitude"
    },
    {
        " in Chinese historically. With the introduction of SI units, some of them have been incorporated as SI prefixes, while the rest have fallen into disuse.                        In the Peoples Republic of China, the early translation for the ": null
    },
    {
        "SI prefix": "si prefix"
    },
    {
        "es in 1981 was different from those used today. The larger and smaller Chinese numerals were defined as translation for the SI prefixes as mega, giga, tera, peta, exa, micro, nano, pico, femto, atto, resulting in the creation of yet more values for each numeral.  , , page 575, Table 7: SI prefixes     The Republic of China defined 百萬 as the translation for mega and 兆 as the translation for tera. This translation is widely used in official documents, academic communities, informational industries, etc. However, the civil broadcasting industries sometimes use ": null
    },
    {
        "兆赫": "wikt:兆赫"
    },
    {
        " to represent ": null
    },
    {
        "megahertz": "megahertz"
    },
    {
        " .     Today, the governments of both China and Taiwan use phonetic transliterations for the SI prefixes. However, the governments have each chosen different Chinese characters for certain prefixes. The following table lists the two different standards together with the early translation.                Multiple-digit numbers are constructed using a multiplicative principle; first the digit itself , then the place ; then the next digit.     In Mandarin, the multiplier   is often used rather than   for all numbers 200 and greater with the 2 numeral . Use of both 兩  or 二  are acceptable for the number 200. When writing in the Cantonese dialect, 二  is used to represent the 2 numeral for all numbers. In the ": null
    },
    {
        "southern Min": "min nan"
    },
    {
        " dialect of Chaozhou , 兩  is used to represent the 2 numeral in all numbers from 200 onwards. Thus:        For the numbers 11 through 19, the leading one  is usually omitted. In some dialects, like Shanghainese, when there are only two significant digits in the number, the leading one and the trailing zeroes are omitted. Sometimes, the one before ten in the middle of a number, such as 213, is omitted. Thus:          Notes:   Nothing is ever omitted in large and more complicated numbers such as this.     In certain older texts like the ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " Bible": "bible"
    },
    {
        " or in poetic usage, numbers such as 114 may be written as .     Outside of Taiwan, digits are sometimes grouped by ": null
    },
    {
        "myriads": "myriad"
    },
    {
        " instead of thousands. Hence it is more convenient to think of numbers here as in groups of four, thus 1,234,567,890 is regrouped here as 12,3456,7890. Larger than a myriad, each number is therefore four zeroes longer than the one before it, thus 10000 ×    . If one of the numbers is between 10 and 19, the leading one is omitted as per the above point. Hence :        In Taiwan, pure Arabic numerals are officially always and only grouped by thousands.  Unofficially, they are often not grouped, particularly for numbers below 100,000. Mixed Arabic-Chinese numerals are often used in order to denote myriads. This is used both officially and unofficially, and come in a variety of styles:        Interior zeroes before the unit position must be spelt explicitly. The reason for this is that trailing zeroes are often omitted as shorthand, so ambiguity occurs. One zero is sufficient to resolve the ambiguity. Where the zero is before a digit other than the units digit, the explicit zero is not ambiguous and is therefore optional, but preferred. Thus:          To construct a fraction, the ": null
    },
    {
        "denominator": "denominator"
    },
    {
        " is written first, followed by  and then the ": null
    },
    {
        "numerator": "numerator"
    },
    {
        ". This is the opposite of how fractions are read in English, which is numerator first. Each half of the fraction is written the same as a whole number. ": null
    },
    {
        "Mixed numbers": "mixed number"
    },
    {
        "are written with the whole-number part first, followed by  , then the fractional part.        Percentages are constructed similarly, using  as the denominator. The  before  is omitted.         Decimal numbers are constructed by first writing the whole number part, then inserting a point , and finally the decimal expression. The decimal expression is written using only the digits for 0 to 9, without multiplicative words.        , functions as a number and therefore requires a ": null
    },
    {
        "measure word": "chinese measure word"
    },
    {
        ". Example:  is half a glass of water .       Ordinal numbers are formed by adding  before the number.          Negative numbers are formed by adding fù  before the number.              ": null
    },
    {
        "Chinese grammar": "chinese grammar"
    },
    {
        " requires the use of ": null
    },
    {
        "classifiers": "classifier"
    },
    {
        " when a numeral is used together with a noun to express a quantity. For example, three people is expressed as  , three  person , where /  is a ": null
    },
    {
        "classifier": "classifier"
    },
    {
        ". There exist many ": null
    },
    {
        "different classifiers": "list of chinese classifiers"
    },
    {
        ", for use with different sets of nouns, although / is the most common, and may be used informally in place of other classifiers.     Chinese uses ": null
    },
    {
        "cardinal numbers": "cardinal number"
    },
    {
        " in certain situations in which English would use ": null
    },
    {
        "ordinals": "ordinal number"
    },
    {
        ". For example,   means third floor . Likewise,  is used for 21st century . Yip, Po-Ching; Rimmington, Don, Chinese: A Comprehensive Grammar, Routledge, 2004, p. 12.     Numbers of years are commonly spoken as a sequence of digits, as in  for the year 2001. Yip, Po-Ching; Rimmington, Don, Chinese: A Comprehensive Grammar, Routledge, 2004, p. 13. Names of months and days are also expressed using numbers:  for January, etc.; and  for Monday, etc. Only one exception, Sunday is , or informally , both literally week day . When meaning week ,   and   are interchangeable.   or   means day of worship . ": null
    },
    {
        "Chinese Catholics": "chinese catholics"
    },
    {
        " call Sunday  , Lords day . Days of the Week in Chinese: Three Different Words for Week      Full dates are usually written in the format 2001年1月20日 for January 20, 2001  – all the numbers are read as cardinals, not ordinals, with no leading zeroes, and the year is read as a sequence of digits. For brevity the ,  and  may be dropped to give a date composed of just numbers. For example 6-4 in Chinese is six-four , short for month six, day four i.e. June Fourth, a common Chinese shorthand for the ": null
    },
    {
        "1989 Tiananmen Square protests": "1989 tiananmen square protests"
    },
    {
        " . For another example 67, in Chinese is sixty seven, short for year nineteen sixty seven, a common Chinese shorthand for the ": null
    },
    {
        "Hong Kong 1967 leftist riots": "hong kong 1967 leftist riots"
    },
    {
        ".               In the same way that ": null
    },
    {
        "Roman numerals": "roman numerals"
    },
    {
        " were standard in ancient and medieval Europe for mathematics and commerce, the Chinese formerly used the ": null
    },
    {
        "rod numerals": "counting rods"
    },
    {
        ", which is a positional system. The Suzhou numerals  system is a variation of the ": null
    },
    {
        "Southern Song": "song dynasty"
    },
    {
        " rod numerals. Nowadays, the huāmǎ system is only used for displaying prices in Chinese markets or on traditional handwritten invoices.            There is a common method of using of one hand to signify the numbers one to ten. While the five digits on one hand can express the numbers one to five, six to ten have special signs that can be used in commerce or day-to-day communication.                     Most Chinese numerals of later periods were descendants of the ": null
    },
    {
        "Shang dynasty": "shang dynasty"
    },
    {
        " oracle numerals of the 14th century BC. The ": null
    },
    {
        "oracle bone script": "oracle bone script"
    },
    {
        " numerals were found on tortoise shell and animal bones. In early civilizations, the Shang were able to express any numbers, however large, with only nine symbols and a counting board. The Shorter Science & Civilisation in China Vol 2, An abridgement by Colin Ronan of Joseph Needhams original text, p5, Cambridge University Press      Some of the bronze script numerals such as 1, 2, 3, 4, 10, 11, 12, and 13 became part of the system of ": null
    },
    {
        "rod numerals": "rod numerals"
    },
    {
        ".     In this system, horizontal rod numbers are used for the tens, thousands, hundred thousands etc. Its written in  Sunzi Suanjing  that one is vertical, ten is horizontal .  孫子算經: 先識其位，一從十橫，百立千僵，千十相望，萬百相當。          The counting rod numerals system has place value and decimal numerals for computation, and was used widely by Chinese merchants, mathematicians and astronomers from the ": null
    },
    {
        "Han dynasty": "han dynasty"
    },
    {
        " to the 16th century.     In AD ": null
    },
    {
        "690": "690"
    },
    {
        ", ": null
    },
    {
        "Empress Wǔ": "wu zetian"
    },
    {
        " promulgated ": null
    },
    {
        "Zetian characters": "chinese characters of empress wu"
    },
    {
        ", one of which was 〇 . The word is now used as a synonym for the number zero. Note: The code for the lowercase 〇 is U+3007, not to be confused with the ": null
    },
    {
        "O mark": "o mark"
    },
    {
        " .     ": null
    },
    {
        "Alexander Wylie": "alexander wylie"
    },
    {
        ", Christian missionary to China, in 1853 already refuted the notion that the Chinese numbers were written in words at length , and stated that in ancient China, calculation was carried out by means of counting rods, and the written character is evidently a rude presentation of these . After being introduced to the rod numerals, he said Having thus obtained a simple but effective system of figures, we find the Chinese in actual use of a method of notation depending on the theory of local value several centuries before such theory was understood in Europe, and while yet the science of numbers had scarcely dawned among the Arabs. Alexander Wylie, Jottings on the Sciences of the Chinese, North Chinese Herald, 1853, Shanghai     During the ": null
    },
    {
        "Ming": "ming dynasty"
    },
    {
        " and ": null
    },
    {
        "Qing": "qing dynasty"
    },
    {
        " dynasties , some Chinese mathematicians used Chinese numeral characters as positional system digits. After the Qing period, both the Chinese numeral characters and the Suzhou numerals were replaced by Arabic numerals in mathematical writings.         Traditional Chinese numeric characters are also used in ": null
    },
    {
        "Japan": "japan"
    },
    {
        " and ": null
    },
    {
        "Korea": "korea"
    },
    {
        " and were used in ": null
    },
    {
        "Vietnam": "vietnam"
    }
]