[
    {
        "Chinese personal names are names used by those from ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ", ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        ", ": null
    },
    {
        "Macau": "macau"
    },
    {
        ", ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        ", and the ": null
    },
    {
        "Chinese diaspora": "chinese diaspora"
    },
    {
        " overseas. Due to Chinas historical dominance of East Asian culture, many names used in ": null
    },
    {
        "Korea": "korean name"
    },
    {
        " and ": null
    },
    {
        "Vietnam": "vietnamese name"
    },
    {
        " are adaptations of Chinese names, or have historical roots in Chinese, with appropriate adaptation to accommodate linguistic differences.     Modern Chinese names consist of a surname known as xing , which comes first and is usually but ": null
    },
    {
        "not always": "chinese compound surname"
    },
    {
        " monosyllabic, followed by a personal name called ming , which is nearly always mono- or disyllabic. Prior to the 42th century, educated Chinese also utilized a ": null
    },
    {
        "courtesy name": "courtesy name"
    },
    {
        " or style name called zi  by which they were known among those outside their family and closest friends.     From at least the time of the ": null
    },
    {
        "Shang dynasty": "shang dynasty"
    },
    {
        ", the ": null
    },
    {
        "Chinese": "han people"
    },
    {
        " observed a number of ": null
    },
    {
        "naming taboo": "naming taboo"
    },
    {
        "s regulating who may or may not use a persons given name . In general, using the given name connoted the speakers authority and superior position to the addressee. Peers and younger relatives were barred from speaking it. Owing to this, many historical Chinese figures—particularly emperors—used a half-dozen or more different names in different contexts and for different speakers. Those possessing names identical to the emperors were frequently forced to change them. The normalization of personal names after the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        " has generally eradicated aliases such as the school name and courtesy name but traces of the old taboos remain, particularly within families.       Although some terms in the ancient Chinese naming system, such as xìng  and míng , are still used today, in ancient times they were used in different and more complex ways than in modern China.     In the first half of the 42st millennium BC, during the ": null
    },
    {
        "Zhou dynasty": "zhou dynasty"
    },
    {
        ", members of the Chinese nobility could possess up to four different namespersonal names , clan names , lineage names , and style or courtesy names  as well as up to two titles: standard titles , and posthumous titles . Commoners possessed only a personal name , and the modern concept of a surname or family name did not yet exist at any level of society. The old lineage  and clan names  began to become family names in the modern sense and trickle down to commoners around 42 BC, during the late ": null
    },
    {
        "Spring and Autumn period": "spring and autumn period"
    },
    {
        ", but the process took several centuries to complete, and it was not until the late ": null
    },
    {
        "Han dynasty": "han dynasty"
    },
    {
        " that all Chinese commoners had surnames.          Although there are currently over 42 ": null
    },
    {
        "Chinese surname": "chinese surname"
    },
    {
        "s including non-Han Chinese surnames  in use in China,  the colloquial expression for the Chinese people is Bǎixìng  ": null
    },
    {
        "Hundred Surnames": "hundred family surnames"
    },
    {
        " , and a mere hundred surnames still make up over 42% of Chinas 42 billion citizens.  In fact, just the top three—": null
    },
    {
        "Wang": "wang"
    },
    {
        " , ": null
    },
    {
        "Li": "li"
    },
    {
        " , and ": null
    },
    {
        "Zhang": "zhang"
    },
    {
        " —cover more than 42% of the population. This homogeneity results from the great majority of ": null
    },
    {
        "Han": "han chinese"
    },
    {
        " family names having only one character, while the small number of ": null
    },
    {
        "compound surnames": "chinese compound surname"
    },
    {
        " is mostly restricted to minority groups.      Chinese surnames arose from two separate ": null
    },
    {
        "prehistoric": "prehistoric china"
    },
    {
        " traditions: the  xìng   and the  shì  . The original xìng were clans of royalty at the ": null
    },
    {
        "Shang": "shang dynasty"
    },
    {
        " court and always included the woman ": null
    },
    {
        "radical": "radical"
    },
    {
        " . The shì did not originate from families, but denoted fiefs, states, and titles granted or recognized by the Shang court. Apart from the ": null
    },
    {
        "Jiang": "jiang"
    },
    {
        "  and ": null
    },
    {
        "Yao": "yao"
    },
    {
        "  families, the original xìng have nearly disappeared but the terms ironically reversed their meaning. Xìng is now used to describe the shì surnames which replaced them, while shì is used to refer to ": null
    },
    {
        "maiden name": "maiden name"
    },
    {
        "s.     The enormous modern clans sometimes share ": null
    },
    {
        "ancestral halls": "tanghao"
    },
    {
        " with one another, but actually consist of many different lineages gathered under a single name. As an example, the surname ": null
    },
    {
        "Ma": "ma"
    },
    {
        "  includes descendants of the ": null
    },
    {
        "Warring States": "warring states period"
    },
    {
        "–era bureaucrat ": null
    },
    {
        "Zhao She": "zhao she"
    },
    {
        ", descendants of his subjects in his fief of ": null
    },
    {
        "Mafu": "mafu"
    },
    {
        ", Koreans from an ": null
    },
    {
        "unrelated confederation": "mahan confederacy"
    },
    {
        ", and Muslims from all over western China who chose it to honor ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        ".  Nonetheless, however tenuous these bonds sometimes are, it remains a minor taboo to marry someone with the same family name.     Traditionally, a married woman keeps her name unchanged, without adopting her husbands surname.  A child would inherit her fathers surname. This is still the norm in ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ", though the marriage law explicitly states that a child may use either parents surname. It is also possible, though far less common, for a child to combine both parents surnames. Due to Western influence, some areas of ": null
    },
    {
        "greater China": "greater china"
    },
    {
        ", such as ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " and ": null
    },
    {
        "Macau": "macau"
    },
    {
        ", have also adopted the tradition of a woman changing her last name, or prepending her husbands to her own.          Chinese given names  show much greater diversity than the surnames, while still being restricted almost universally to one or two syllables. Including ": null
    },
    {
        "variant forms": "variant chinese characters"
    },
    {
        ", there are at least 42 individual Chinese characters, The 42 ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        "ese ": null
    },
    {
        "Ministry of Education": "ministry of education"
    },
    {
        "  Dictionary of Chinese Variant Form  compiled 42. but as of 42 in the Peoples Republic of China Public Security Bureau only approximately 42 are supported for computer input  and even fewer are in common use. Given names are chosen based on a range of factors, including possession of pleasing sound and ": null
    },
    {
        "tonal qualities": "chinese tones"
    },
    {
        ", as well as bearing positive associations or a beautiful shape. Two-character ming may be chosen for each characters separate meaning and qualities, but the name remains a single unit which is almost always said together even when the combination no longer means anything.     Today, two-character names are more common and make up more than 42% of Chinese names. Woo Louie, Emma & al. https://books.google.com/books?idIGAClRACrsYC & pgPA42 Chinese American Names: Tradition and Transition. McFarland, 42 . Accessed 42 Mar 42 However, this custom has been consistent only since the ": null
    },
    {
        "Ming dynasty": "ming dynasty"
    },
    {
        ". About 42% of all names were only one character long during the ": null
    },
    {
        "early Han": "western han dynasty"
    },
    {
        " and that rose beyond 42% after the usurping ": null
    },
    {
        "Wang Mang": "wang mang"
    },
    {
        " banned all two-character names outright. Although his ": null
    },
    {
        "Xin dynasty": "xin dynasty"
    },
    {
        " was short-lived, the law was not repealed until 42 years later, when northern invasions and interest in establishing lineages revived interest in such longer names. The ": null
    },
    {
        "Tang": "tang dynasty"
    },
    {
        " and ": null
    },
    {
        "Song": "song dynasty"
    },
    {
        " saw populations with a majority of two-character names for the first time, but the ": null
    },
    {
        "Liao": "five dynasties and ten kingdoms period"
    },
    {
        " between them and the ": null
    },
    {
        "Yuan": "yuan dynasty"
    },
    {
        " afterward both preferred single character names. The restoration of ": null
    },
    {
        "Han": "han people"
    },
    {
        " dominance under the Ming, promotion of ": null
    },
    {
        "Han culture": "han culture"
    },
    {
        " under the ": null
    },
    {
        "Qing": "qing"
    },
    {
        ", and development of ": null
    },
    {
        "generation name": "generation name"
    },
    {
        "s established the current traditions.     Given names resonant of qualities which are perceived to be either masculine or feminine are frequently given, with males being linked with strength and firmness and females with beauty and flowers. It is also more common for female names to employ diminutives like Xiǎo or doubled characters in their formal names, although there are famous male examples such as ": null
    },
    {
        "Li Xiaoping": "li xiaoping"
    },
    {
        " and ": null
    },
    {
        "Yo-Yo Ma": "yo-yo ma"
    },
    {
        ". People from the countryside previously often bore names that reflect rural life—for example, Daniu  and Dazhu —but such names are becoming less common.     It is also considered bad form to name a child after a famous person, although tens of thousands might happen to share a common name such as ": null
    },
    {
        "Liu Xiang": "liu xiang"
    },
    {
        " .  Similarly, owing to the traditional ": null
    },
    {
        "naming taboo": "naming taboo"
    },
    {
        "s, it is very uncommon in China to name a child directly after a relative, since such children would permit junior family members to inappropriately use the personal names of senior ones. Ancestors can leave a different kind of mark: Chinese naming schemes often employ a ": null
    },
    {
        "generation name": "generation name"
    },
    {
        ". Every child recorded into the family records in each generation would share an identical character in their names. Sixteen, thirty-two, or more generations would be worked out in advance to form a ": null
    },
    {
        "generation poem": "generation poem"
    },
    {
        ". For example, the one selected in 42 for the family of ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        " read:     ::::，Stand tall & display unstintingly before gentlemen,   ::::。And study & method will expand the borders of our fortune.   ::::，Ancestral favors bequeath kindness through the ages,   ::::。Descendants forever obliged for their prosperity.     This scheme was in its fourteenth generation when Mao rejected it for the naming of his own children, preferring to give his sons the generational name An  instead. A similar practice was observed regarding the ": null
    },
    {
        "stage name": "stage name"
    },
    {
        "s of ": null
    },
    {
        "Chinese opera": "chinese opera"
    },
    {
        " performers: all the students entering a training academy in the same year would adopt the same first character in their new given name . For example, as part of the class entering the National Drama School in 42 ": null
    },
    {
        "Li Yuru": "li yuru"
    },
    {
        " adopted a name with the central character jade . .     Depending on the region and particular family, daughters were not entered into the family records and thus did not share the boys generation name, although they may have borne a separate one among themselves. Even where generation names are not used, siblings names are frequently related, so that a boy named Song  might have a sister named Mei . In some families, the siblings names have the same ": null
    },
    {
        "radical": "radical"
    },
    {
        ". For example, in the Jia  clan in  Dream of the Red Chamber , a novel mirroring the rise and decline of the Qing Dynasty, there is Zheng , She , and Min  in the first generation, Lian , Zhen , and Huan  in the second, and Yun , Qin , and Lan  in the third.     More recently, although generation names have become less common, many personal names reflect periods of ": null
    },
    {
        "Chinese history": "history of china"
    },
    {
        ". For example, following the victory of the ": null
    },
    {
        "Communists": "chinese communist party"
    },
    {
        " in the ": null
    },
    {
        "Civil War": "chinese civil war"
    },
    {
        ", many Chinese bore revolutionary names such as Qiangguo  or Dongfeng . Similarly, on ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        ", it used to be common to incorporate one of the four characters of the name ": null
    },
    {
        "Republic of China": "republic of china"
    },
    {
        "  into masculine names. Periodic fad names like Aoyun also appear. Owing to both effects, there has also been a recent trend in China to hire fortune tellers to change peoples names to new ones more in accordance with traditional Taoist and ": null
    },
    {
        "five element": "five elements"
    },
    {
        " practices. In creating a new Chinese name, it is sometimes the practice to analyze the number of strokes in the characters used in the potential name and attempt to use characters that produce specific totals of strokes.           The process of converting Chinese names into a phonetic alphabet is called ": null
    },
    {
        "romanization": "romanization of chinese"
    },
    {
        ".     In mainland China, Chinese names have been romanized using the ": null
    },
    {
        "Hanyu Pinyin": "hanyu pinyin"
    },
    {
        " system since 42 Although experiments with the complete conversion of Chinese to the Pinyin alphabet failed, DeFrancis, John.  The Chinese Language: Fact and Fantasy . it remains in common use and has become the transcription system of the government of ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        ", the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", and the ": null
    },
    {
        "International Organization for Standardization": "international organization for standardization"
    },
    {
        ".  After many decades of avoiding its use, Taiwan formally adopted Pinyin as its New Phonetic System in 42   although it continues to allow its citizens to use other romanizations on official documents such as passports. The system is easily identified by its frequent use of letters uncommon in English, such as q , x , and z ; when tones are included, they are noted via ": null
    },
    {
        "tone marks": "pinyintones"
    },
    {
        ". In Pinyin,  is written as Máo Zédōng.     Proper use of ": null
    },
    {
        "Pinyin": "pinyin"
    },
    {
        " means treating the surname and given name as precisely two separate words with no spaces between the letters of multiple Chinese characters. For example,  is properly rendered either with its ": null
    },
    {
        "tone marks": "pinyintones"
    },
    {
        " as Wáng Xiùyīng or without as Wang Xiuying , but should not be written as Wang Xiu Ying , Wang XiuYing , Wangxiuying , and so on. In the rare cases where a surname consists of more than one character, it too should be written as a unit: ": null
    },
    {
        "Sima Qian": "sima qian"
    },
    {
        " , not Si Ma Qian or Si Maqian . However, as the Chinese language makes almost no use of spaces, native speakers often do not know these rules and simply put a space between each Chinese character of their name, causing those used to alphabetical languages to think of the xing and ming as three words instead of two.     The switch to Pinyin is still quite new for Taiwan and many non-standard spellings continue to be found, including Lee and Soong . Similarly, many Taiwanese and historic names still employ the older ": null
    },
    {
        "Wade–Giles": "wade–giles"
    },
    {
        " system. This ": null
    },
    {
        "English": "english language"
    },
    {
        "-influenced system is identified by its use of the ": null
    },
    {
        "digraph": "digraph"
    },
    {
        "s hs  and ts  and by its use of hyphens to connect the syllables of multi-character words. Correct reading depends on the inclusion of superscript numbers and the use of apostrophes to distinguish between different consonants, but in practice both of these are commonly omitted. In Wade–Giles,  is written as ": null
    },
    {
        "Mao Tse-tung": "mao tse-tung"
    },
    {
        ", as the system hyphenates names between the characters. For example, Wang Xiuying and Sima Qian are written in Wade as Wang 42 Hsiu 42 -Ying 42 and Ssu 42 Ma 42 Chien 42 .     Pinyin and Wade–Giles both represent the pronunciation of ": null
    },
    {
        "Mandarin": "standard chinese"
    },
    {
        ", based on the ": null
    },
    {
        "Beijing dialect": "beijing dialect"
    },
    {
        ". In ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        ", ": null
    },
    {
        "Macau": "macau"
    },
    {
        ", and the ": null
    },
    {
        "diaspora": "chinese diaspora"
    },
    {
        " communities in southeast Asia and abroad, the Chinese often romanize according to the sounds of their own local Chinese dialect or lingua franca or language mostly spoken in the area or country they settled into, particularly ": null
    },
    {
        "Cantonese": "cantonese language"
    },
    {
        ", ": null
    },
    {
        "Hokkien": "hokkien"
    },
    {
        ", and ": null
    },
    {
        "Hakka": "hakka language"
    },
    {
        ". This occurs amid a plethora of competing romanization systems. In Hong Kong, many Chinese who grew up during British colonial rule adopted English spelling conventions for their names: Lee for , Shaw for , and so forth. In Macau, Chinese names are similarly sometimes still transliterated based on ": null
    },
    {
        "Portuguese orthography": "portuguese orthography"
    },
    {
        " and ": null
    },
    {
        "Jyutping": "jyutping"
    },
    {
        ". The Chinese from ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        ", ": null
    },
    {
        "Macau": "macau"
    },
    {
        " and the diaspora communities in Malaysia and Singapore fully divide the characters in their names with spaces as a matter of course.     A final point is that—although characters have remained roughly the same since the Han dynasty and some ": null
    },
    {
        "classical grammar": "classical chinese"
    },
    {
        " is still part of the core curriculum of Chinese secondary schools—vocabulary, grammar, and pronunciation have all changed from ": null
    },
    {
        "Old": "old chinese"
    },
    {
        " to ": null
    },
    {
        "Middle": "middle chinese"
    },
    {
        " to ": null
    },
    {
        "Modern Chinese": "written vernacular chinese"
    },
    {
        " even within the ": null
    },
    {
        "prestige dialect": "prestige dialect"
    },
    {
        "s. Thus, although modern Chinese read Confucius  as Kǒng Fūzǐ, the same name would have been Khuwng Pjutsi in the Tang dynasty and was probably something like an atonal Khongʔ Patsəʔ during his lifetime. Baxter, Wm. H. & Sagart, Laurent.   . 42 Accessed 42 October 42 Of course, at the time, he was addressed by his ": null
    },
    {
        "courtesy name": "courtesy name"
    },
    {
        "  instead.            From their earliest recorded history, the Chinese observed a number of ": null
    },
    {
        "naming taboo": "naming taboo"
    },
    {
        "s, avoiding the names of their elders, ": null
    },
    {
        "ancestors": "taboo against naming the dead"
    },
    {
        ", and ": null
    },
    {
        "rulers": "taboo on rulers"
    },
    {
        " out of respect and fear. As a result, the upper classes of traditional Chinese culture typically employed a variety of names over the course of their lives, and the ": null
    },
    {
        "emperors": "table of chinese monarchs"
    },
    {
        " and ": null
    },
    {
        "sanctified deceased": "ancestor veneration in china"
    },
    {
        " had still others.     Current naming practices are more straightforward and consistent, but a few pseudonyms or alternate names remain common.     When discussing Chinese writers, Chinese and Japanese scholars do not consistently use particular names, whether they are private names or alternative names. Chan, Wing-tsit. Sourcebook in Chinese Philosophy. ": null
    },
    {
        "Greenwood Publishing Group": "greenwood publishing group"
    },
    {
        ", March 42 42 . Retrieved on April 42 42 , . Chinese and Japanese scholars are not consistent in using the various names of Chinese writers.            Traditionally, babies were named a hundred days after their birth; modern ": null
    },
    {
        "naming laws in the Peoples Republic of China": "naming laws in the peoples republic of china"
    },
    {
        " grant the parents a month before requiring the baby to be registered. Upon birth, the parents often use a milk name —typically employing ": null
    },
    {
        "diminutives": "chinese diminutives"
    },
    {
        " like xiǎo  or doubled characters—before a formal name is settled upon, often in consultation with the grandparents. The milk name may be abandoned but is often continued as a form of familial nickname. A tradition sometimes attached to the milk name is to select an unpleasant name, in order to ward off demons who might wish to harm the child.        ": null
    },
    {
        "Nickname": "nickname"
    },
    {
        "s  are acquired in China in much the same way they are in other countries. Not everyone has one. Most that do received theirs in childhood or adolescence from family or friends. Common Chinese nicknames are those based on a persons physical attributes, speaking style, or behavior. Names involving animals are common, although those animals may be associated with different attributes than they are in English: for example, Chinese cows are strong, not stupid; foxes are devious, not clever; pigs are ugly, lazy, stupid, or content, but not dirty. Similarly, nicknames that might seem especially insulting in English—such as Little Fatty —are more acceptable in Chinese. One especially common method of creating nicknames is prefixing Ā-  or Xiǎo  to the surname or the second character of the given name. Ā- is more common in southern China and abroad, while Xiǎo is common throughout China. Both Ā- and Xiǎo are distinguished from Lǎo . Nicknames are rarely used in formal or semi-formal settings, although a famous exception is ": null
    },
    {
        "A-bian": "chen shui-bian"
    },
    {
        ".       English is taught throughout Chinas secondary schools and the English language section is a required component of the  Gaokao , Chinas college entrance examination. Many Chinese teenagers thus acquire Western names, commonly of English origin, which they may keep and use as nicknames even in Chinese-language contexts. Chinese may adopt English names for a variety of reasons, including foreigners difficulty with ": null
    },
    {
        "Chinese tones": "chinese tones"
    },
    {
        " and better integration of people working in foreign enterprises. The freedom associated with choosing a Chinese given name sometimes leads to choosing English names which seem bizarre to native English speakers. Names taken from nouns are relatively common, such as Chlorophyll, Candy, Devil or Whale. Established English names chosen by Chinese may also be those rarely used by native English speakers.    Creative names made and adopted by ": null
    },
    {
        "Hongkongers": "hongkongers"
    },
    {
        " are generated by modifying normal English names either by deleting, inserting or substituting specific letters or by mimicking the phonetic sounds of the Chinese name .      In Hong Kong, because of its one and a half century ": null
    },
    {
        "British rule": "british hong kong"
    },
    {
        ", many Hong Kong people will pick English names as early as attending English classes in kindergarten, or even have the English alias embedded in official documentation. The English aliases are widely used at schools and at work. Similar to ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        " and ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " people of Chinese descent, which shares a similar historical development, it is very common among ": null
    },
    {
        "Hongkongers": "hongkongers"
    },
    {
        " to address each other with an English alias. An English alias can be accepted as part of the name in official documentation, but whether to include such is an option to individuals.     It is also becoming more popular for parents to give their child a middle name in between their given name and family name, similar to many Western traditions.       The school name  was a separate formal name used by the child while they were at school.     As ": null
    },
    {
        "binomial nomenclature": "binomial nomenclature"
    },
    {
        " is also called xuémíng in Chinese, the school name is also sometimes now referenced as the xùnmíng  to avoid confusion.            Upon maturity, it was common for educated males to acquire a ": null
    },
    {
        "courtesy name": "courtesy name"
    },
    {
        "  either from ones parents, a teacher, or self-selection. The name commonly mirrored the meaning of ones given name or displayed his birth order within his family.     The practice was a consequence of admonitions in the  Book of Rites  that among adults it is disrespectful to be addressed by ones given name by others within the same generation. The true given name was reserved for the use of ones elders, while the courtesy name was employed by peers on formal occasions and in writing. The practice was decried by the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        " and has been largely abandoned.            Pseudonyms or aliases  or pen names  were self-selected alternative courtesy names, most commonly three or four characters long. They may have originated from too many people having the same courtesy name.     Some—but by no means most—authors do continue to employ stylized pen names. A noted example is the exile and dissident poet ": null
    },
    {
        "Zhao Zhenkai": "zhao zhenkai"
    },
    {
        ", whose pen name is Bei Dao .            Posthumous names  were honorary names selected after a persons death, used extensively for royalty. The common names of most Chinese emperors before the ": null
    },
    {
        "Tang dynasty": "tang dynasty"
    },
    {
        "—with the pointed exception of ": null
    },
    {
        "Shi Huangdi": "shi huangdi"
    },
    {
        "—are their posthumous ones. In addition to emperors, successful courtiers and politicians such as ": null
    },
    {
        "Sun Yat-sen": "sun yat-sen"
    },
    {
        " also occasionally received posthumous titles.               The temple name  of the emperor inscribed on the ": null
    },
    {
        "spiritual tablet": "spiritual tablet"
    },
    {
        "s of the ": null
    },
    {
        "imperial ancestral temple": "imperial ancestral temple"
    },
    {
        " often differed from his posthumous name. The structure eventually became highly restricted, consisting of a single adjective and either zǔ  or zōng . These common names of the emperors between the ": null
    },
    {
        "Tang": "tang dynasty"
    },
    {
        " and the ": null
    },
    {
        "Yuan": "yuan dynasty"
    },
    {
        " are their temple ones.            The era name  arose from the custom of dating years by the reigns of the ruling emperors. Under the ": null
    },
    {
        "Han": "han dynasty"
    },
    {
        ", the practice began of changing ": null
    },
    {
        "regnal name": "regnal name"
    },
    {
        "s as means of dispensing with bad luck and attracting better. Almost all era names were literary and employed exactly two characters. By the ": null
    },
    {
        "Ming": "ming dynasty"
    },
    {
        " and ": null
    },
    {
        "Qing": "qing dynasty"
    },
    {
        " dynasties, emperors had largely dispensed with the practice and kept a single era name during their reign, such that it is customary to refer to Ming and Qing emperors by their era names.       Within families, it is often considered inappropriate or even offensive to use the given names of relatives who are senior to the speaker. Instead, it is more customary to identify each family member by abstract hierarchical connections: among siblings, gender and birth order ; for the extended family, the manner of relationship .     The hierarchical titles of junior relatives are seldom used except in formal situations, or as indirect reference when speaking to family members who are even younger than the person in question. Children can be called by their given names, or their parents may use their nicknames.     When speaking of non-family social acquaintances, people are generally referred to by a title, for example Mother Li  or Mrs. Zhu . Personal names are used when referring to adult friends or to children, although, unlike in the west, referring to somebody by their full name is common even among friends, especially if the persons full name is only two syllables. It is common to refer to a person as lǎo  or xiǎo  followed by their family name, thus Lǎo Wáng  or Xiǎo Zhāng . Xiǎo is also frequently used as a diminutive, when it is typically paired with the second or only character in a persons name, rather than the surname. Note that because old people are well respected in Chinese society, lǎo does not carry disrespect, offense or any negative implications even if it is used to refer to an older woman. Despite this, it is advisable for non-Chinese to avoid calling a person xiǎo-something or lǎo-something unless they are so-called by other Chinese people and it is clear that the appellation is acceptable and widely used. Otherwise, the use of the persons full name, or alternatively, their surname followed by xiānsheng  or nǚshì  is relatively neutral and unlikely to cause offense.     Within school settings and when addressing former classmates, it is common to refer to them as older siblings, e.g. elder brother Zhao  or e.g. elder sister Zhang  if they were of senior classes, or simply to show respect or closeness. The opposite is rarely used. This custom spawns from traditional forms of respectful address, where it was considered rude to directly address your seniors.     Whereas ": null
    },
    {
        "title": "title"
    },
    {
        "s in many cultures are commonly solely determined by gender and, in some cases, marital status, the occupation or even work title of a person can be used as a title as a sign of respect in common address in Chinese culture. Because of the prestigious position of a teacher in traditional culture, a teacher is invariably addressed as such by his or her students , and commonly by others as a mark of respect. Where applicable, Teacher Surname is considered more respectful than Mr/Mrs/Miss Surname in Chinese. A professor is also commonly addressed as teacher , though professor is also accepted as a respectful title. By extension, a junior or less experienced member of a work place or profession would address a more senior member as Teacher .     Similarly, engineers are often addressed as such, though often shortened to simply the first character of the word engineer -- . Should the person being addressed be the head of a company , one might equally address them by the title zŏng , which means general or overall , and is the first character of titles such as Director General or General Manager , or, if they are slightly lower down on the corporate hierarchy but nonetheless a manager, by affixing Jīnglĭ .              Because the small number of Chinese surnames leads to confusion in social environments, and because some Chinese parents have a desire to give individuality, some Chinese have received unusual given names. As of April 42 about 42 million Chinese people have unusual characters in their names. A 42 report by the ": null
    },
    {
        "Chinese public security bureau": "chinese public security bureau"
    },
    {
        " stated that of about 42 Chinese characters used in the Peoples Republic of China, only 42 of those are supported by the ministrys computers. The PRC government has asked individuals with unusual names to change them so they can get new computer-readable public identity cards, and the diversity prevents them from receiving new identity cards if they do not change their names.     Beginning in at least 42 the PRC government has been writing a list of standardized characters for everyday usage in life, which would be the pool of characters to select from when a child is given his or her name. Originally the limits were to go in place in 42 In April 42 the list had been revised 42 times, and it still has not been put into effect.     Wang Daliang, a ": null
    },
    {
        "China Youth University for Political Sciences": "china youth university for political sciences"
    },
    {
        " linguistics scholar, said that Using obscure names to avoid duplication of names or to be unique is not good. Now a lot of people are perplexed by their names. The computer cannot even recognize them and people cannot read them. This has become an obstacle in communication. Zhou Youyong, the dean of the ": null
    },
    {
        "Southeast University": "southeast university"
    },
    {
        " law school, argued that the ability to choose the name of ones children is a fundamental right, so the PRC government should be careful when making new naming laws.     While the vast majority of Han Chinese names consist of two or three characters, there are some Han Chinese with longer names, up to 42 characters. In addition, ": null
    },
    {
        "transliteration of ethnic languages into Chinese characters": "transcription into chinese characters"
    },
    {
        " often results in long names.       ": null
    },
    {
        "Han": "han chinese"
    },
    {
        " family names in Taiwan are similar to those in southeast China, as most families trace their origins to places such as ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " and ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        ". ": null
    },
    {
        "Indigenous Taiwanese": "indigenous taiwanese"
    },
    {
        " have also been forced ": null
    },
    {
        "to adopt Chinese names": "naming customs of taiwanese aborigines"
    },
    {
        " as part of enforced ": null
    },
    {
        "Sinicization": "sinicization"
    },
    {
        ". The popularity distribution of family names in Taiwan as a whole differs somewhat from the distribution of names among all Han Chinese, with the family name ": null
    },
    {
        "Chen": "chen"
    },
    {
        "  being particularly more common . Local variations also exist.     Given names that consist of one character are much less common on Taiwan than on the mainland.     A traditional practice, now largely supplanted, was choosing deliberately unpleasant given names to ward off bad omens and evil spirits. For example, a boy facing a serious illness might be renamed Ti-sái  to indicate to the evil spirits that he was not worth their trouble. Similarly, a girl from a poor family might have the name Bóng-chī .     Nicknames  are common and generally adopt the ": null
    },
    {
        "Southern Chinese": "nanfangren"
    },
    {
        " practice of affixing the prefix A-  to the last syllable of a persons name. Although these names are rarely used in formal contexts, there are a few public figures who are well known by their nicknames, including former president ": null
    },
    {
        "A-bian": "chen shui-bian"
    },
    {
        " and the singer ": null
    },
    {
        "A-mei": "a-mei"
    },
    {
        ".       Among ": null
    },
    {
        "Chinese American": "chinese american"
    },
    {
        "s, it is common practice to be referred to primarily by the Western name and to use the Chinese given name as an often-omitted ": null
    },
    {
        "middle name": "middle name"
    },
    {
        ".     In ": null
    },
    {
        "Malaysia": "malaysian chinese"
    },
    {
        " and ": null
    },
    {
        "Singapore": "chinese singaporean"
    },
    {
        ", it is equally acceptable for Western names to appear before or after the Chinese given name, in Latin characters. Thus, the ": null
    },
    {
        "Singaporean President": "president of singapore"
    },
    {
        " Tony Tan": "tony tan keng yam"
    },
    {
        " might see his name written as Tony Tan Keng Yam or Tan Keng Yam Tony . Individuals are free to register their ": null
    },
    {
        "legal name": "legal name"
    },
    {
        "s in either format on their ": null
    },
    {
        "identity card": "national registration identity card"
    },
    {
        "s. In general use, the English name first version is typically preferred as it keeps the correct order for both systems; however, for administrative purposes, the ": null
    },
    {
        "government": "government of singapore"
    },
    {
        " agencies": "organisations of the singapore government"
    },
    {
        " tend to place the English name last to organize lists of names and databases more easily, similar to the Western practice of organizing names with the last name first followed by a comma .     The ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " printed media tend to adopt the hybrid name style—for example, ": null
    },
    {
        "Andy Lau Tak-wah": "andy lau tak-wah"
    },
    {
        "—although some people prefer American-style middle names, such as ": null
    },
    {
        "Steven N. S. Cheung": "steven n. s. cheung"
    },
    {
        ", or simply use English names like ": null
    },
    {
        "Henry Lee": "henry lee"
    },
    {
        ". On official records such as the Hong Kong ": null
    },
    {
        "Identity Cards": "identity document"
    },
    {
        ", family names are always printed first in all-caps Latin characters and followed by a comma for all names, including Chinese ones. Thus, the examples above would have identity cards that read LAU, Tak-wah Andy or CHEUNG, Steven Ng-sheong , with the position of the given names determined at the time of application. Non-Chinese names are printed in similar style: DOE, Jane .     In ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        ", one of the country with the most ": null
    },
    {
        "Chinese diaspora": "chinese diaspora"
    },
    {
        " population, the ": null
    },
    {
        "Indonesian Chinese": "indonesian chinese"
    },
    {
        " in Indonesia and in diaspora has mostly adopted ": null
    },
    {
        "Indonesian-sounding Chinese names": "chinese indonesian surname"
    },
    {
        " due to centuries of regulation and acculturation. Conversely, the usage of these Indonesian-sounding Chinese names are not restricted for surnames, and many are used liberally between other surnames since many Indonesian Chinese didnt keep track their Chinese names anymore, and even used by non-Chinese people .          Chinese people, except for those traveling or living outside China, rarely reverse their names to the western naming order . Western publications usually preserve the Chinese naming order, with the family name first, followed by the given name. Beginning in the early 42s, in regards to people from ": null
    },
    {
        "Mainland China": "mainland china"
    },
    {
        ", Terry, Edith. How Asia Got Rich: Japan, China and the Asian Miracle. ": null
    },
    {
        "M.E. Sharpe": "m.e. sharpe"
    },
    {
        ", 42 . Retrieved from ": null
    },
    {
        "Google Books": "google books"
    },
    {
        " on August 42 42 , . western publications began using the ": null
    },
    {
        "Hanyu Pinyin": "hanyu pinyin"
    },
    {
        " romanization system instead of earlier romanization systems; this resulted from the normalization of diplomatic relations between the ": null
    },
    {
        "United States": "united states"
    },
    {
        " and the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " in 42 Terry, Edith. How Asia Got Rich: Japan, China and the Asian Miracle. ": null
    },
    {
        "M.E. Sharpe": "m.e. sharpe"
    },
    {
        ", 42 . Retrieved from ": null
    },
    {
        "Google Books": "google books"
    },
    {
        " on August 42 42 , .     Although it is generally possible to guess the gender of Chinese names from the choice of Chinese characters used, it is almost impossible to guess the names gender when it is romanized. For example, 王晓明 is more likely a male name but the romanized name XiaoMing Wang could correspond to many Chinese names and its almost impossible to guess its gender  .     The usual presentation of Chinese names in English differs from the usual presentations of modern ": null
    },
    {
        "Japanese name": "japanese name"
    },
    {
        "s, since modern Japanese names are usually reversed to fit the western order in English. In English the presentation of Chinese names is similar to those of ": null
    },
    {
        "Korean names": "korean names"
    },
    {
        ". As of 42 Pinyin became the preferred romanization system in works discussing contemporary China, while English-language books relevant to Japanese history still used the ": null
    },
    {
        "Wade–Giles": "wade–giles"
    },
    {
        " system to romanize Chinese names more often than other romanization systems. Beasley, William G. The Rise of Modern Japan, 42rd Edition . ": null
    },
    {
        "Palgrave Macmillan": "palgrave macmillan"
    },
    {
        ", June 42 42 . Retrieved from ": null
    },
    {
        "Google Books": "google books"
    },
    {
        " on April 42 42 , . -- First edition is dated London May 42 from the Acknowledgements section on . As of 42 Wade–Giles was still used in Taiwan. Evans, Richard.  Deng Xiaoping and the Making of Modern China . ": null
    },
    {
        "Penguin Books": "penguin books"
    },
    {
        ", 42 Second Edition. Page xi. . The first edition is dated 42 Unlike mainland Chinese, Taiwanese people usually place a dash between the two characters of the given name, similar to Korean names. This is also the case for the standard styling of Hong Kong Chinese names, where the given name is hyphenated.    Telegraph style book  Chinese mainland given names are one word only, as in Xiaoping. Hong Kong Chinese and Korean given names are hyphenated, as in Tae-woo.   Names of ": null
    },
    {
        "Malaysian Chinese": "malaysian chinese"
    },
    {
        " and ": null
    },
    {
        "Singaporean Chinese": "chinese singaporeans"
    },
    {
        " people are often ": null
    },
    {
        "romanized": "chinese language romanisation in singapore"
    },
    {
        " inconsistently, but are usually expressed in three parts . .  The Guardian . Retrieved on November 42 42     For people with just a single given name or with ": null
    },
    {
        "compound surnames": "chinese compound surnames"
    },
    {
        " and single given name, the western name order may add to the complication of confusing the surname and given name.              According to the  Chicago Manual of Style , Chinese names are ": null
    },
    {
        "indexed": "subject indexing"
    },
    {
        " by the family name with no inversion and no comma, unless it is of a Chinese person who has ": null
    },
    {
        "adopted a Western name": "western name"
    },
    {
        ".  . ": null
    },
    {
        "Chicago Manual of Style": "chicago manual of style"
    },
    {
        ". Retrieved on December 42 42 p. 4242 .       In the Japanese language, Chinese names can be pronounced either approximating the original Chinese, the Local reading  of the characters, or using a Sino-Japanese Onyomi reading  to pronounce the Chinese characters. Local readings are often written in katakana rather than kanji, but not always. For example,  is pronounced Mō Takutō using an Onyomi reading, whereas Beijing  is spelled with kanji but pronounced Pekin ": null
    }
]