[
    {
        "           Chojnów   is a small town in ": null
    },
    {
        "Legnica County": "Legnica County"
    },
    {
        ", ": null
    },
    {
        "Lower Silesian Voivodeship": "Lower Silesian Voivodeship"
    },
    {
        ", in south-western ": null
    },
    {
        "Poland": "Poland"
    },
    {
        ". It is located on the ": null
    },
    {
        "Skora": "Skora"
    },
    {
        " river, a tributary of the ": null
    },
    {
        "Kaczawa": "Kaczawa"
    },
    {
        " at an average altitude of  above sea level. Chojnów is the administrative seat of the rural ": null
    },
    {
        "gmina": "Gmina"
    },
    {
        " called ": null
    },
    {
        "Gmina Chojnów": "Gmina Chojnów"
    },
    {
        ", although the town is not part of its territory and forms a separate urban gmina.  it had 14,389 inhabitants.     Chojnów is located  west of ": null
    },
    {
        "Legnica": "Legnica"
    },
    {
        ",  east from ": null
    },
    {
        "Bolesławiec": "Bolesławiec"
    },
    {
        " and  north of ": null
    },
    {
        "Złotoryja": "Złotoryja"
    },
    {
        ",  from the ": null
    },
    {
        "A4 motorway": "A4 Autostrada"
    },
    {
        ". It has railroad connections to Bolesławiec and Legnica.       Coat of arms of the Chojnów has is a blue ": null
    },
    {
        "escutcheon": "Escutcheon"
    },
    {
        ". On the dial there is a tower with three bastions of white colour. The central tower has two Windows, and one side. On the towers is located on the right side of the Moon and Sun on the left. In the gate of the ": null
    },
    {
        "Silesian Eagle": "Silesian Eagle"
    },
    {
        " on a yellow background.   The Motto of Chojnów is Friendly City .       Chojnów is located in the Central-Western part of the ": null
    },
    {
        "Lower Silesia": "Lower Silesia"
    },
    {
        " region. The ": null
    },
    {
        "Skora River": "Skora River"
    },
    {
        " flows through the town in a westerly direction. The city of Chojnów is  in area, including 41% agricultural land.     Chojnów has a connection with the major cities of the country and located  south of Chojnów has the A4 Autostrada. To the South of the town is the surrounding Chojnowska Plain.       The town is first mentioned in a Latin mediaeval document issued in ": null
    },
    {
        "Breslau": "Wrocław"
    },
    {
        " on February 26, 1253, stating, the Silesian Duke ": null
    },
    {
        "Henry III": "Henry Iii The White"
    },
    {
        " when the town is mentioned under the name Honowo.  . Georg Korn, Breslauer Urkundenbuch , Erster Theil, Breslau, Verlag von Wilhelm Gottlieb Korn 1870, p14. Possible the name of nearby Hainau Island. The name in ": null
    },
    {
        "German": "German Language"
    },
    {
        " is still Haynau.  .     The settlement of Haynow was mentioned in a 1272 deed. It was already called a civitas in a 1288 document issued by the ": null
    },
    {
        "Piast": "Silesian Piasts"
    },
    {
        " duke ": null
    },
    {
        "Henry V of Legnica": "Henry V, Duke Of Legnica"
    },
    {
        ", and officially received ": null
    },
    {
        "town privileges": "Town Privileges"
    },
    {
        " in 1333. In 1288, the city is known from documents of the Prince of Legnica ": null
    },
    {
        "Henryk V colon": "Henryk V Colon"
    },
    {
        ".          The town survived the ": null
    },
    {
        "Hussite": "Hussite"
    },
    {
        "s, who burned almost the entire town Center and castle, but it quickly helped recover its former glory. The largest boom Haynau experienced was in the 16th century, however by the end of that century began to decline due to fires and epidemic, which claimed many victims in 1613.     From 1618 to 1648 , there was another outbreak in the city and in 1740 Hanyau was incorporated by ": null
    },
    {
        "Prussia": "Prussia"
    },
    {
        ".     During the ": null
    },
    {
        "Napoleonic wars": "Napoleonic Wars"
    },
    {
        " there were more epidemics. A railway line was connected in the 19th century. ": null
    },
    {
        "Sewer": "Sewerage"
    },
    {
        ", ": null
    },
    {
        "Gas light": "Gas Light"
    },
    {
        "ing a Newspaper and a hospital soon followed as the towns economy improved.     The city was not spared in ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", with 60% of the town being destroyed on February 10, 1945 when Soviet ": null
    },
    {
        "Red Army": "Red Army"
    },
    {
        " troops took the town. After World War II and the implementation of the ": null
    },
    {
        "Oder-Neisse line": "Oder-Neisse Line"
    },
    {
        " in 1945, the town passed to the ": null
    },
    {
        "Republic of Poland": "Peoples Republic Of Poland"
    },
    {
        ". The German population was ": null
    },
    {
        "expelled": "Flight And Expulsion Of Germans From Poland During And After World War Ii"
    },
    {
        " from the region.     In March 31, 2011, the city had 14,367 inhabitants. Rynek za czasów grodu Chojnów i PRLu uznawany był za plac, nie posiadał wtedy jeszcze skweru pośrodku.       1428 15 residents   1633 500 residents   1657 180 residents   1742 400 residents   1788 20176 residents   1801 2314 residents   1890 8115 residents   2005 14510 residents       Chojnów is an industrial and agricultural town. Among local products are: paper, agricultural machinery, chains, metal furniture for hospitals, equipment for the ": null
    },
    {
        "meat industry": "Meat Industry"
    },
    {
        ", beer, wine, leather clothing, and clothing for infants, children and adults. The local government-run weekly newspaper is ": null
    },
    {
        "Gazeta Chojnowska": "Gazeta Chojnowska"
    },
    {
        ", which has been published since 1992.     Among the interesting monuments of Chojnów are the 13th-century castle of the ": null
    },
    {
        "Dukes of Legnica": "Duchy Of Legnica"
    },
    {
        " , two old churches, the Baszta Tkaczy  and preserved fragments of city walls.     The biggest green area in Chojnów is small forest Park Piastowski , named after ": null
    },
    {
        "Piast dynasty": "Piast Dynasty"
    },
    {
        ". Wild animals that can be found in the Chojnów area are roe-deer , foxes, rabbits and wild domestic animals, especially cats.     Every year in the first days of June, the Days of Chojnów  are celebrated. The Whole-Poland bike race Masters has been organized yearly in Chojnów for the past few years.         SM Chojnów Zamek ID 593385.jpg|SM Chojnów Castle   Chojnów, Ab-047.JPG|Flower beds in Chojnów   SM Chojnów Rynek ID 593382.jpg|Market Square   Chojnow 054 jeziorko.jpg|Pond in Chojnów   Chojnow 055 most kolejowy.jpg|Railway bridge   Chojnow 019 gimnazjum.jpg|Chojnów Gymnasium School   Chojnow 067 duzy kosciol.jpg|St Peter and Paul Church   SM Chojnów kościół Niepokalanego Poczęcia NMP ID 593383.jpg|Immaculate Conception Church              Chojnów has a Municipal sports and recreation center formed in 2008 holding various events, festivals, reviews, exhibitions, and competitions. The regional Museum is housed in the old Piast era castle. The collections include tiles, relics, and the castle garden. Next to the Museum there is a municipal library. In śródmiejskim Park, near the Town Hall is the ": null
    },
    {
        "amphitheatre": "Amphitheatre"
    },
    {
        ".     The Gazeta Chojnowska is a newspaper published biweekly. Editions have a run of 900 copies and it is one of the oldest newspapers in Poland issued without interruption. The Chojnów is the official newspaper of Chojnów with copy run of 750 copies.       In Chojnów, there are two kindergartens, two elementary schools and two middle schools.   Mary Konopnickiej is the smallest elementary school in Chojnów, and is located in the northern part of the city, close to the train station and founded in 1962.   Janusz Korczak is the largest primary school in Chojnów in the southern part of the town.   Middle School No. , it is situated in the north-western part of the city next to the Small Church .   Gimnazjum nr 2 im. Nicolaus Copernicus is the largest high school in Chojnów.   Liceum Ogólnokształcące im. Nicolaus Copernicus       Chojnów is in the ": null
    },
    {
        "Catholic": "Roman Catholic Church"
    },
    {
        " deanery of Chojnów and has two parishes, Immaculate Conception of the Blessed Virgin Mary and also the Holy Apostles Peter and Paul. Both parishes have active congregations.   There are also two Congregations of Jehovahs witnesses. .       ": null
    },
    {
        "Johann Wilhelm Ritter": "Johann Wilhelm Ritter"
    },
    {
        " , chemist and ": null
    },
    {
        "physicist": "Physicist"
    },
    {
        " Georg Michaelis": "Georg Michaelis"
    },
    {
        " , politician, ": null
    },
    {
        "Chancellor of Germany": "Chancellor Of Germany"
    },
    {
        "   Edith Jacobson": "Edith Jacobson"
    },
    {
        " , German psychoanalyst   ": null
    },
    {
        "Oswald Lange": "Oswald Lange"
    },
    {
        " , German-American aerospace engineer   ": null
    },
    {
        "Horst Mahler": "Horst Mahler"
    },
    {
        " , German lawyer, former ": null
    },
    {
        "Red Army Faction": "Red Army Faction"
    },
    {
        " militant, now ": null
    },
    {
        "Neo-Nazi": "Neo-Nazism"
    },
    {
        " activist              Chojnów is ": null
    },
    {
        "twinned": "Twin Towns And Sister Cities"
    },
    {
        " with:    ": null
    },
    {
        "Egelsbach": "Egelsbach"
    },
    {
        ", Germany    ": null
    },
    {
        "Commentry": "Commentry"
    }
]