[
    {
        "      The Cholistan Desert , also locally known as Rohi , sprawls  from ": null
    },
    {
        "Bahawalpur": "Bahawalpur"
    },
    {
        ", ": null
    },
    {
        "Punjab": "Punjab, Pakistan"
    },
    {
        ", ": null
    },
    {
        "Pakistan": "Pakistan"
    },
    {
        " and covers an area of . It adjoins the ": null
    },
    {
        "Thar Desert": "Thar Desert"
    },
    {
        ", extending over to ": null
    },
    {
        "Sindh": "Sindh"
    },
    {
        " and into ": null
    },
    {
        "India": "India"
    },
    {
        ".     The word Cholistan is derived from the ": null
    },
    {
        "Turkic": "Turkic Languages"
    },
    {
        " word chol, meaning desert. The people of Cholistan lead a semi-nomadic life, moving from one place to another in search of water and fodder for their animals. The dry bed of the ": null
    },
    {
        "Hakra River": "Hakra River"
    },
    {
        " runs through the area, along which many settlements of the ": null
    },
    {
        "Indus Valley Civilization": "Indus Valley Civilization"
    },
    {
        " have been found.     The desert also hosts an annual Jeep rally, known as ": null
    },
    {
        "Cholistan Desert Jeep Rally": "Cholistan Desert Jeep Rally"
    },
    {
        ". It is the biggest motor sports event in Pakistan. It is now famous internationally.              As mentioned above, the Indus Valley has always been occupied by the wandering ": null
    },
    {
        "nomadic": "Nomad"
    },
    {
        " tribes, who are fond of isolated areas, as such areas allow them to lead life free of foreign intrusion, enabling them to establish their own individual and unique cultures. Cholistan till the era of ": null
    },
    {
        "Mughal rule": "Mughal Empire"
    },
    {
        " had also been isolated from outside influence. During the rule of ": null
    },
    {
        "Mughal Emperor Akbar": "Jalal-Ud-Din Muhammad Akbar"
    },
    {
        ", it became a proper productive unit. The entire area was ruled by a host of kings who securely guarded their frontiers. The rulers were the great patrons of art, and the various crafts underwent a simultaneous and parallel development, influencing each other. Masons, stone carvers, artisans, artists, and designers started rebuilding the old cities and new sites, and with that flourished new courts, paintings, weaving, and pottery. The fields of architecture, sculpture, terra cotta, and pottery developed greatly in this phase.       The backbone of Cholistan economy is cattle breeding. It has the major importance for satisfying the areas major needs for cottage industry as well as milk meat and fat. Because of the nomadic way of life the main wealth of the people are their cattle that are bred for sale, milked or shorn for their wool. Moreover, isolated as they were, they had to depend upon themselves for all their needs like food, clothing, and all the items of daily use. So all their crafts initially stemmed from necessity but later on they started exporting their goods to the other places as well. The estimated number of livestock in the desert areas is 1.6 million.       Cholistan produces very superior type of carpet wool as compared to that produced in other parts of Pakistan. From this wool they knit beautiful carpets, rugs and other woolen items. This includes blankets, which is also a local necessity for the desert is not just a land of dust and heat, but winter nights here are very cold, usually below freezing points. Khes and pattu are also manufactured with wool or cotton. Khes is a form of blanket with a field of black white and pattu has a white ground base. Cholistanis now sell the wool for it brings maximum profit.       It may be mentioned that cotton textiles have always been a hallmark of craft of Indus valley civilization. Various kinds of khaddar-cloth are made for local consumption, and fine khaddar bedclothes and coarse lungies are woven here. A beautiful cloth called Sufi is also woven of silk and cotton, or with cotton wrap and silk wool. Gargas are made with numerous patterns and color, having complicated embroidery, mirror, and patchwork. Ajrak is another specialty of Cholistan. It is a special and delicate printing technique on both sides of the cloth in indigo blue and red patterns covering the base cloth. Cotton turbans and shawls are also made here. Chunri is another form of dopattas, having innumerable colors and patterns like dots, squares, and circles on it.       Camels are highly valued by the desert dwellers. Camels are not only useful for transportation and loading purposes, but its skin and wool are also quite worthwhile. Camel wool is spun and woven into beautiful woolen blankets known as falsies and into stylish and durable rugs. The camels leather is also utilized in making kuppies, goblets, and expensive lampshades.       Leatherwork is another important local cottage industry due to the large number of livestock here. Other than the products mentioned above, Khusa is a specialty of this area. Cholistani khusas are very famous for the quality of workmanship, variety, and richness of designs especially when stitched and embroidered with golden or brightly colored threads.       The Cholistanis are fond of jewellery, especially gold jewellery. The chief ornaments made and worn by them are Nath , Katmala Kangan , and Pazeb . Gold and silver bangles are also a product of Cholistan. The locals similarly work in enamel, producing enamel buttons, earrings, bangles, and rings.       The great desert though considered to be colorless and drab, is not wholly devoid of color. Its green portion plays the role of color belt especially after rains when vegetation growth is at its peak. Adding to that the locals always wear brightly colored clothes mostly consisting of brilliant reds, blazing oranges shocking pinks, and startling yellows and greens. Even the cloth trappings of their bullocks and camels are richly colored and highly textured.       There is a rain forest in Cholistan named Dodhla Forest       The wildlife of Cholistan desert mostly consists of migratory birds, especially ": null
    },
    {
        "Houbara bustard": "Houbara Bustard"
    },
    {
        " who migrates to this part during winters. This species of birds is most famous in the hunting season, even though they are ": null
    },
    {
        "endangered": "Endangered"
    },
    {
        " in ": null
    },
    {
        "Pakistan": "Pakistan"
    },
    {
        " , according to ": null
    },
    {
        "IUCN Red List": "Iucn Red List"
    },
    {
        ". Their population has decreased from 4,746 in 2001 to just a few dozens in recent times.    In December 2016, a Qatari prince, had his hunting license rejected due to the species being endangered. Another prince, Dr. Fahad was fined with Rs. 80,000 and all of the birds he caught were set free for hunting without permit and license.    The other endangered species in this desert is ": null
    },
    {
        "Chinkara": "Chinkara"
    },
    {
        ", their population has also decreased from 3,000 in 2007 to just a few above 1,000 in 2010 due non-permit hunting of the species by influential political families.       ": null
    },
    {
        "Derawar Fort": "Derawar Fort"
    },
    {
        "    Islamgarh Fort": "Islamgarh Fort"
    },
    {
        "   Mirgarh Fort": "Mirgarh Fort"
    },
    {
        "   Jamgarh Fort": "Jamgarh Fort"
    },
    {
        "   Mojgarh Fort": "Mojgarh Fort"
    },
    {
        "   Marot Fort": "Marot"
    },
    {
        "   Phoolra Fort": "Phoolra Fort"
    },
    {
        "   Khangarh Fort": "Khangarh Fort"
    },
    {
        "   Khairgarh Fort": "Khairgarh Fort"
    },
    {
        "   Nawankot Fort": "Nawankot Fort"
    },
    {
        "   Bijnot Fort": "Bijnot Fort"
    },
    {
        "       ": null
    }
]