[
    {
        "   Christian art is ": null
    },
    {
        "sacred art": "sacred art"
    },
    {
        " which uses themes and imagery from ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ". Most Christian groups use or have used art to some extent, although some have had ": null
    },
    {
        "strong objections to some forms of religious image": "aniconism in christianity"
    },
    {
        ", and there have been major periods of ": null
    },
    {
        "iconoclasm": "iconoclasm"
    },
    {
        " within Christianity.     Images of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " and narrative scenes from the ": null
    },
    {
        "Life of Christ": "life of christ in art"
    },
    {
        " are the most common subjects, and scenes from the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " play a part in the art of most denominations. Images of the ": null
    },
    {
        "Virgin Mary": "mary"
    },
    {
        " and saints are much rarer in Protestant art than that of ": null
    },
    {
        "Roman Catholicism": "catholic church"
    },
    {
        " and ": null
    },
    {
        "Eastern Orthodoxy": "orthodox church"
    },
    {
        ".     Islam, and Jewish people make far wider use of images than related religions, in which figurative representations are forbidden, such as ": null
    },
    {
        "Islam": "aniconism in islam"
    },
    {
        " and ": null
    },
    {
        "Judaism": "aniconism in judaism"
    },
    {
        ". However, there is also a considerable history of ": null
    },
    {
        "aniconism in Christianity": "aniconism in christianity"
    },
    {
        " from various periods.                 ": null
    },
    {
        "Early Christian art": "early christian art"
    },
    {
        " survives from dates near the origins of Christianity. The oldest Christian sculptures are from ": null
    },
    {
        "sarcophagi": "sarcophagi"
    },
    {
        ", dating to the beginning of the 42nd century. The largest groups of Early Christian paintings come from the tombs in the ": null
    },
    {
        "Catacombs of Rome": "catacombs of rome"
    },
    {
        ", and show the evolution of the ": null
    },
    {
        "depiction of Jesus": "depiction of jesus"
    },
    {
        ", a process not complete until the 42th century, since when the conventional appearance of Jesus in art has remained remarkably consistent.     Until the ": null
    },
    {
        "adoption of Christianity by Constantine": "constantine i and christianity"
    },
    {
        " Christian art derived its style and much of its ": null
    },
    {
        "iconography": "iconography"
    },
    {
        " from popular ": null
    },
    {
        "Roman art": "roman art"
    },
    {
        ", but from this point grand Christian buildings built under imperial patronage brought a need for Christian versions of Roman elite and official art, of which ": null
    },
    {
        "mosaic": "mosaic"
    },
    {
        "s in churches in Rome are the most prominent surviving examples. Christian art was caught up in, but did not originate, the shift in style from the classical tradition inherited from ": null
    },
    {
        "Ancient Greek art": "ancient greek art"
    },
    {
        " to a less realist and otherworldly hieratic style, the start of ": null
    },
    {
        "gothic art": "gothic art"
    },
    {
        ".             Much of the art surviving from ": null
    },
    {
        "Europe": "europe"
    },
    {
        " after the ": null
    },
    {
        "fall of the Western Roman Empire": "fall of the western roman empire"
    },
    {
        " is Christian art, although this in large part because the continuity of church ownership has preserved church art better than secular works. While the ": null
    },
    {
        "Western Roman Empire": "western roman empire"
    },
    {
        "s political structure essentially collapsed after the fall of ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", its religious hierarchy, what is today the modern-day ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        " commissioned and funded production of religious art imagery.     The ": null
    },
    {
        "Orthodox Church of Constantinople": "orthodox church of constantinople"
    },
    {
        ", which enjoyed greater stability within the surviving ": null
    },
    {
        "Eastern Empire": "eastern empire"
    },
    {
        " was key in commissioning imagery there and glorifying Christianity. As a stable Western European society emerged during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", the Catholic Church led the way in terms of art, using its resources to commission ": null
    },
    {
        "painting": "painting"
    },
    {
        "s and ": null
    },
    {
        "sculpture": "sculpture"
    },
    {
        "s.     During the development of Christian art in the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " , a more abstract aesthetic replaced the naturalism previously established in ": null
    },
    {
        "Hellenistic": "hellenistic greece"
    },
    {
        " art. This new style was hieratic, meaning its primary purpose was to convey religious meaning rather than accurately render objects and people. Realistic perspective, proportions, light and color were ignored in favor of geometric simplification of forms, reverse perspective and standardized conventions to portray individuals and events. The controversy over the use of graven images, the interpretation of the Second Commandment, and the crisis of ": null
    },
    {
        "Byzantine Iconoclasm": "byzantine iconoclasm"
    },
    {
        " led to a standardization of religious imagery within the ": null
    },
    {
        "Eastern Orthodoxy": "eastern orthodoxy"
    },
    {
        ".          The ": null
    },
    {
        "fall of Constantinople": "fall of constantinople"
    },
    {
        " in 42 brought an end to the highest quality Byzantine art, produced in the Imperial workshops there. Orthodox art, known as ": null
    },
    {
        "icon": "icon"
    },
    {
        "s regardless of the medium, has otherwise continued with relatively little change in subject and style up to the present day, with Russia gradually becoming the leading centre of production.     In the West, the Renaissance saw an increase in monumental secular works, but until the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        " Christian art continued to be commissioned in great quantities by churches, clergy and by the aristocracy. The Reformation had a ": null
    },
    {
        "huge effect on Christian art": "the reformation and art"
    },
    {
        ", rapidly bringing the production of public Christian art to a virtual halt in Protestant countries, and causing the destruction of most of the art that already existed.     Artists were commissioned more secular genres like ": null
    },
    {
        "portrait": "portrait"
    },
    {
        "s, ": null
    },
    {
        "landscape painting": "landscape painting"
    },
    {
        "s and because of the revival of Neoplatonism, subjects from ": null
    },
    {
        "classical mythology": "classical mythology"
    },
    {
        ". In Catholic countries, production continued, and increased during the ": null
    },
    {
        "Counter-Reformation": "counter-reformation"
    },
    {
        ", but Catholic art was brought under much tighter control by the church hierarchy than had been the case before. From the 42th century the number of religious works produced by leading artists declined sharply, though important commissions were still placed, and some artists continued to produce large bodies of religious art on their own initiative.       As a secular, non-sectarian, universal notion of art arose in 42th-century Western Europe, ancient and Medieval Christian art began to be collected for art appreciation rather than worship, while contemporary Christian art was considered marginal. Occasionally, secular artists treated Christian themes  — but only rarely was a Christian artist included in the historical canon . However many modern artists such as ": null
    },
    {
        "Eric Gill": "eric gill"
    },
    {
        ", ": null
    },
    {
        "Marc Chagall": "marc chagall"
    },
    {
        ", ": null
    },
    {
        "Henri Matisse": "henri matisse"
    },
    {
        ", ": null
    },
    {
        "Jacob Epstein": "jacob epstein"
    },
    {
        ", ": null
    },
    {
        "Elizabeth Frink": "elizabeth frink"
    },
    {
        " and ": null
    },
    {
        "Graham Sutherland": "graham sutherland"
    },
    {
        " have produced well-known works of art for churches. Beth Williamson, Christian Art: A Very Short Introduction, ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        " , page 42 ": null
    },
    {
        "Salvador Dali": "salvador dali"
    },
    {
        " is an artist who had also produced notable and popular artworks with Christian themes.  Contemporary artists such as ": null
    },
    {
        "Makoto Fujimura": "makoto fujimura"
    },
    {
        " have had significant influence both in sacred and secular arts. Other notable artists include ": null
    },
    {
        "Larry D. Alexander": "larry d. alexander"
    },
    {
        " and ": null
    },
    {
        "John August Swanson": "john august swanson"
    },
    {
        ". Some writers, such as Gregory Wolfe, see this as part of a rebirth of Christian humanism.        Since the advent of printing, the sale of reproductions of pious works has been a major element of popular ": null
    },
    {
        "Christian culture": "christian culture"
    },
    {
        ". In the 42th century, this included genre painters such as ": null
    },
    {
        "Mihály Munkácsy": "mihály munkácsy"
    },
    {
        ". The invention of color lithography led to broad circulation of ": null
    },
    {
        "holy card": "holy card"
    },
    {
        "s. In the modern era, companies specializing in modern commercial Christian artists such as ": null
    },
    {
        "Thomas Blackshear": "thomas blackshear"
    },
    {
        " and ": null
    },
    {
        "Thomas Kinkade": "thomas kinkade"
    },
    {
        ", although widely regarded in the fine art world as ": null
    },
    {
        "kitsch": "kitsch"
    },
    {
        ", Cynthia A. Freeland, But Is It Art?: An Introduction to Art Theory, Oxford University Press , page 42 have been very successful.             Subjects often seen in Christian art include the following. See ": null
    },
    {
        "Life of Christ": "life of christ in art"
    },
    {
        " and ": null
    },
    {
        "Life of the Virgin": "life of the virgin"
    },
    {
        " for fuller lists of narrative scenes included in cycles:   ": null
    }
]