[
    {
        "              Christopher Marlowe, also known as Kit Marlowe , was an English playwright, poet and translator of the ": null
    },
    {
        "Elizabethan era": "elizabethan era"
    },
    {
        ". Christopher Marlowe was baptised as Marlow, but he spelled his name Marley in his one known surviving signature. David Kathman.  Marlowe was the foremost ": null
    },
    {
        "Elizabethan": "english renaissance theatre"
    },
    {
        " tragedian": "tragedy"
    },
    {
        " of his day. Robert A. Logan, Shakespeares Marlowe p.4. During Marlowes lifetime, the popularity of his plays, Robert Greenes ... remarks ... including the designation famous , and the many imitations of Tamburlaine suggest that he was for a brief time considered Englands foremost dramatist. He greatly influenced ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        ", who was born in the same year as Marlowe and who rose to become the pre-eminent Elizabethan playwright after Marlowes mysterious early death. Marlowes plays are known for the use of ": null
    },
    {
        "blank verse": "blank verse"
    },
    {
        " and their overreaching ": null
    },
    {
        "protagonist": "protagonist"
    },
    {
        "s.     Some scholars believe that a warrant was issued for Marlowes arrest on 18 May 1593.  No reason was given for it, though it was thought to be connected to allegations of blasphemy—a manuscript believed to have been written by Marlowe was said to contain vile heretical conceipts . On 20 May, he was brought to the court to attend upon the ": null
    },
    {
        "Privy Council": "privy council"
    },
    {
        " for questioning. There is no record of their having met that day, and his being commanded to attend upon them each day thereafter, until licensed to the contrary . Ten days later, he was stabbed to death by ": null
    },
    {
        "Ingram Frizer": "ingram frizer"
    },
    {
        ". Whether or not the stabbing was connected to his arrest, remains unknown. Nicholl, Charles . By my onely meanes sett downe: The Texts of Marlows Atheism , in Kozuka, Takashi and Mulryne, J. R. Shakespeare, Marlowe, Jonson: New Directions in Biography. Ashgate Publishing, p. 153.       Marlowe was born in ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        " to shoemaker John Marlowe and his wife Catherine. His date of birth is not known but he was baptised on 26 February 1564 and is likely to have been born a few days before, making him two months older than ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        ", who was baptised on 26 April 1564 in ": null
    },
    {
        "Stratford-upon-Avon": "stratford-upon-avon"
    },
    {
        ".     Marlowe attended ": null
    },
    {
        "The Kings School": "the kings school, canterbury"
    },
    {
        " in Canterbury  and ": null
    },
    {
        "Corpus Christi College, Cambridge": "corpus christi college, cambridge"
    },
    {
        ", where he studied on a scholarship and received his Bachelor of Arts degree in 1584.  In 1587, the university hesitated to award him his Master of Arts degree because of a rumour that he intended to go to the English college at ": null
    },
    {
        "Rheims": "rheims"
    },
    {
        ", presumably to prepare for ordination as a ": null
    },
    {
        "Roman Catholic": "roman catholicism"
    },
    {
        " priest. His degree was awarded on schedule when the ": null
    },
    {
        "Privy Council": "privy council of england"
    },
    {
        " intervened on his behalf, commending him for his faithful dealing and good service to ": null
    },
    {
        "the Queen": "elizabeth i of england"
    },
    {
        ". For a full transcript, see  . The nature of Marlowes service was not specified by the Council, but its letter to the Cambridge authorities has provoked much speculation, notably the theory that Marlowe was operating as a secret agent working for Sir ": null
    },
    {
        "Francis Walsingham": "francis walsingham"
    },
    {
        ". He died in a brawl. No direct evidence supports this theory, although the Councils letter itself is an evidence that Marlowe had served the government in some secret capacity.                Of the dramas attributed to Marlowe,  Dido, Queen of Carthage  is believed to have been his first. It was performed by the ": null
    },
    {
        "Children of the Chapel": "children of the chapel"
    },
    {
        ", a company of boy actors, between 1587 and 1593. The play was first published in 1594; the title page attributes the play to Marlowe and ": null
    },
    {
        "Thomas Nashe": "thomas nashe"
    },
    {
        ".     Marlowes first play performed on the regular stage in London in 1587, was  Tamburlaine the Great , about the conqueror ": null
    },
    {
        "Timur": "timur"
    },
    {
        " , who rises from shepherd to warlord. It is among the first English plays in blank verse, and with ": null
    },
    {
        "Thomas Kyds": "thomas kyd"
    },
    {
        "  The Spanish Tragedy , is generally considered the beginning of the mature phase of the ": null
    },
    {
        "Elizabethan theatre": "elizabethan theatre"
    },
    {
        ".  Tamburlaine was a success and was followed by Tamburlaine the Great, Part II.     The two parts of Tamburlaine were published in 1590. All Marlowes other works were published posthumously. The sequence of the writing of his other four plays is unknown; they all deal with controversial themes.    The Jew of Malta  , about the Jew Barabas barbarous revenge against the city authorities, has a prologue delivered by a character representing ": null
    },
    {
        "Machiavelli": "niccolò machiavelli"
    },
    {
        ". It was probably written in 1589 or 1590 and was first performed in 1592. It was a success and remained popular for the next fifty years. The play was entered in the ": null
    },
    {
        "Stationers Register": "stationers register"
    },
    {
        " on 17 May 1594 but the earliest surviving printed edition is from 1633.    Edward the Second  is an English history play about the deposition of King ": null
    },
    {
        "Edward II": "edward ii of england"
    },
    {
        " by his barons and the Queen, who resent the undue influence the kings favourites have in court and state affairs. The play was entered into the ": null
    },
    {
        "Stationers Register": "stationers register"
    },
    {
        " on 6 July 1593, five weeks after Marlowes death. The full title of the earliest extant edition of 1594, is The troublesome reigne and lamentable death of Edward the second, King of England, with the tragicall fall of proud Mortimer.    The Massacre at Paris  is a short and luridly written work, the only surviving text of which was probably a ": null
    },
    {
        "reconstruction from memory": "memorial reconstruction"
    },
    {
        " of the original performance text, portraying the events of the ": null
    },
    {
        "Saint Bartholomews Day Massacre": "saint bartholomews day massacre"
    },
    {
        " in 1572, which English Protestants invoked as the blackest example of Catholic treachery.  It features the silent English Agent , whom tradition has identified with Marlowe and his connexions to the secret service. Wilson, Richard . Tragedy, Patronage and Power in Cheney, Patrick, 2007, p. 207 The Massacre at Paris is considered his most dangerous play, as agitators in London seized on its theme to advocate the murders of refugees from the ": null
    },
    {
        "low countries": "spanish netherlands"
    },
    {
        ", and it warns ": null
    },
    {
        "Elizabeth I": "elizabeth i"
    },
    {
        " of this possibility in its last scene.   The full title was The Massacre at Paris: With the Death of the Duke of Guise.    Doctor Faustus  , based on the German ": null
    },
    {
        "Faustbuch": "faustbuch"
    },
    {
        ", was the first dramatised version of the ": null
    },
    {
        "Faust": "faust"
    },
    {
        " legend of a scholars dealing with the devil. This was the title of the edition published in 1616. The earlier edition of 1604 simply had The Tragicall History of D. Faustus. Versions of The Devils Pact can be traced back to the 4th century, Marlowe deviates significantly by having his hero unable to burn his books or repent to a merciful God to have his contract annulled at the end of the play. Marlowes protagonist is instead carried off by demons and in the 1616 quarto his mangled corpse is found by several scholars. Doctor Faustus is a textual problem for scholars as two versions of the play exist: the 1604 ": null
    },
    {
        "quarto": "quarto"
    },
    {
        ", also known as the A text, and the 1616 quarto or B text. Both were published after Marlowes death. Scholars have disagreed which text is more representative of Marlowes original and some editions are based on a combination of the two. The scholarly consensus of the late 20th century holds the A text is more representative because it contains irregular character names and idiosyncratic spelling, which are believed to reflect a text based on the authors handwritten manuscript or ": null
    },
    {
        "foul papers": "foul papers"
    },
    {
        " . The B text in comparison, was highly edited, censored because of shifting theater laws regarding religious words onstage and contains several additional scenes which scholars believe to be the additions of other playwrights, particularly ": null
    },
    {
        "Samuel Rowley": "samuel rowley"
    },
    {
        " and William Bird .     Marlowes plays were enormously successful, thanks in part - no doubt - to the imposing stage presence of ": null
    },
    {
        "Edward Alleyn": "edward alleyn"
    },
    {
        ". Alleyn was unusually tall for the time and the haughty roles of Tamburlaine, Faustus and Barabas were probably written for him. Marlowes plays were the foundation of the repertoire of Alleyns company, the ": null
    },
    {
        "Admirals Men": "admirals men"
    },
    {
        ", throughout the 1590s. Marlowe also wrote the poem  Hero and Leander  , the popular lyric  The Passionate Shepherd to His Love , translations of ": null
    },
    {
        "Ovids": "ovid"
    },
    {
        "  Amores  and the first book of ": null
    },
    {
        "Lucans": "lucan"
    },
    {
        "  Pharsalia . In 1599, his translation of ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " was banned and copies publicly burned as part of ": null
    },
    {
        "Archbishop Whitgifts": "john whitgift"
    },
    {
        "crackdown on offensive material. Marlowe has been credited in the ": null
    },
    {
        "New Oxford Shakespeare": "the oxford shakespeare"
    },
    {
        " series as co-author of the three  Henry VI  plays, though some scholars doubt any actual collaboration.         As with other writers of the period, little is known about Marlowe. What evidence there is can be found in legal records and other official documents. This has not stopped writers of fiction and non-fiction from speculating about his activities and character. Marlowe has often been described as a spy, a brawler and a heretic, as well as a magician , duellist , tobacco-user , counterfeiter and ": null
    },
    {
        "rakehell": "rake"
    },
    {
        " . J. A. Downie and Constance Kuriyama have argued against the more lurid speculation but ": null
    },
    {
        "J. B. Steane": "j. b. steane"
    },
    {
        " remarked, it seems absurd to dismiss all of these Elizabethan rumours and accusations as the Marlowe myth. J. A. Downie in his and J. T. Parnells Constructing Christopher Marlowe and Constance Kuriyama in her Christopher Marlowe: A Renaissance Life .          Marlowe is alleged to have been a government spy . The author ": null
    },
    {
        "Charles Nicholl": "charles nicholl"
    },
    {
        " speculates this was the case and suggests that Marlowes recruitment took place when he was at Cambridge. As noted above, in 1587 the Privy Council ordered the University of Cambridge to award Marlowe his degree of Master of Arts, denying rumours that he intended to go to the English Catholic college in Rheims, saying instead that he had been engaged in unspecified affaires on matters touching the benefit of his country . This is from a document dated 29 June 1587, from the National Archives – Acts of Privy Council. Surviving college records from the period also indicate that Marlowe had had a series of unusually lengthy absences from the university that began in the academic year 1584–1585. Surviving college ": null
    },
    {
        "buttery": "buttery"
    },
    {
        " accounts indicate he began spending lavishly on food and drink during the periods he was in attendance, more than he could have afforded on his known scholarship income.       It has been speculated that Marlowe was the Morley who was tutor to ": null
    },
    {
        "Arbella Stuart": "arbella stuart"
    },
    {
        " in 1589. He was described by Arbellas guardian, the Countess of Shrewsbury, as having hoped for an annuity of some £40 from Arbella, his being so much damnified by leaving the University. : BL ": null
    },
    {
        "Lansdowne MS.": "lansdowne ms."
    },
    {
        " 71, f.3.and Charles Nicholl, The Reckoning , pp. 340–2. This possibility was first raised in a  Times Literary Supplement  letter by E. St John Brooks in 1937; in a letter to  Notes and Queries , John Baker has added that only Marlowe could have been Arbellas tutor due to the absence of any other known Morley from the period with an MA and not otherwise occupied. John Baker, letter to Notes and Queries 44.3 , pp. 367–8 If Marlowe was Arbellas tutor , it might indicate that he was there as a spy, since Arbella, niece of ": null
    },
    {
        "Mary, Queen of Scots": "mary, queen of scots"
    },
    {
        ", and cousin of James VI of Scotland, later ": null
    },
    {
        "James I of England": "james i of england"
    },
    {
        ", was at the time a strong candidate for the ": null
    },
    {
        "succession to Elizabeths throne": "succession to elizabeths throne"
    },
    {
        ". Constance Kuriyama, Christopher Marlowe: A Renaissance Life , p. 89. Also in Handovers biography of Arbella, and Nicholl, The Reckoning, p. 342. , . ": null
    },
    {
        "Frederick S. Boas": "frederick s. boas"
    },
    {
        " dismisses the possibility of this identification, based on surviving legal records which document his residence in London between September and December 1589 . Marlowe had been party to a fatal quarrel involving his neighbours and the poet ": null
    },
    {
        "Thomas Watson": "thomas watson"
    },
    {
        " in ": null
    },
    {
        "Norton Folgate": "norton folgate"
    },
    {
        " and was held in ": null
    },
    {
        "Newgate Prison": "newgate prison"
    },
    {
        " for a fortnight. Frederick S. Boas, Christopher Marlowe: A biographical and critical study , pp. 101ff. In fact, the quarrel and his arrest was on 18 September, he was released on bail on 1 October and he had to attend court, where he was acquitted on 3 December but there is no record of where he was for the intervening two months. Constance Kuriyama, Christopher Marlowe: A Renaissance Life , p. xvi.     In 1592 Marlowe was arrested in the town of ": null
    },
    {
        "Flushing": "flushing, netherlands"
    },
    {
        "  in the Netherlands, for his alleged involvement in the ": null
    },
    {
        "counterfeiting": "counterfeit money"
    },
    {
        " of coins, presumably related to the activities of seditious Catholics. He was sent to be dealt with by the Lord Treasurer  but no charge or imprisonment resulted. For a full transcript, see  . This arrest may have disrupted another of Marlowes spying missions, perhaps by giving the resulting coinage to the Catholic cause. He was to infiltrate the followers of the active Catholic plotter ": null
    },
    {
        "William Stanley": "william stanley"
    },
    {
        " and report back to Burghley. Nicholl          In early May 1593, several bills were posted about London threatening Protestant refugees from France and the Netherlands who had settled in the city. One of these, the Dutch church libel , written in rhymed ": null
    },
    {
        "iambic pentameter": "iambic pentameter"
    },
    {
        ", contained allusions to several of Marlowes plays and was signed, ": null
    },
    {
        "Tamburlaine": "tamburlaine"
    },
    {
        " . For a full transcript, see  . On 11 May the ": null
    },
    {
        "Privy Council": "privy council of the united kingdom"
    },
    {
        " ordered the arrest of those responsible for the libels. The next day, Marlowes colleague ": null
    },
    {
        "Thomas Kyd": "thomas kyd"
    },
    {
        " was arrested, his lodgings were searched and a three-page fragment of a ": null
    },
    {
        "heretical": "heresy"
    },
    {
        " tract was found. In a letter to ": null
    },
    {
        "Sir John Puckering": "sir john puckering"
    },
    {
        ", Kyd asserted that it had belonged to Marlowe, with whom he had been writing in one chamber some two years earlier. J. R. Mulryne states in his ODNB article that the document was identified in the 20th century as transcripts from John Proctours The Fall of the Late Arian . For a full transcript of Kyds letter, see  . In a second letter, Kyd described Marlowe as blasphemous, disorderly, holding treasonous opinions, being an irreligious reprobate and intemperate & of a cruel hart . They had both been working for an ": null
    },
    {
        "aristocratic": "aristocracy"
    },
    {
        " patron, probably ": null
    },
    {
        "Ferdinando Stanley": "ferdinando stanley, 5th earl of derby"
    },
    {
        ", Lord Strange. Mulryne, J. R. Thomas Kyd.  Oxford Dictionary of National Biography . Oxford: ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ", 2004. A warrant for Marlowes arrest was issued on 18 May, when the Privy Council apparently knew that he might be found staying with ": null
    },
    {
        "Thomas Walsingham": "thomas walsingham"
    },
    {
        ", whose father was a first cousin of the late Sir ": null
    },
    {
        "Francis Walsingham": "francis walsingham"
    },
    {
        ", Elizabeths ": null
    },
    {
        "principal secretary": "secretary of state"
    },
    {
        " in the 1580s and a man more deeply involved in state espionage than any other member of the Privy Council. Haynes, Alan. The Elizabethan Secret Service. London: Sutton, 2005. Marlowe duly presented himself on 20 May but there apparently being no Privy Council meeting on that day, was instructed to give his daily attendance on their Lordships, until he shall be licensed to the contrary . National Archives, Acts of the Privy Council. Meetings of the Privy Council, including details of those attending, are recorded and minuted for 16, 23, 25, 29 and the morning of 31 May, all of them taking place in the Star Chamber at Westminster. There is no record of any meeting on either 18 or 20 May, however, just a note of the warrant being issued on 18 May and the fact that Marlowe entered his appearance for his indemnity therein on the 20th. On Wednesday, 30 May, Marlowe was killed.     Various accounts of Marlowes death were current over the next few years. In his  Palladis Tamia , published in 1598, ": null
    },
    {
        "Francis Meres": "francis meres"
    },
    {
        " says Marlowe was stabbed to death by a bawdy serving-man, a rival of his in his lewd love as punishment for his epicurism and atheism . Palladis Tamia. London, 1598: 286v-287r. In 1917, in the  Dictionary of National Biography , Sir ": null
    },
    {
        "Sidney Lee": "sidney lee"
    },
    {
        " wrote that Marlowe was killed in a drunken fight and this is still often stated as fact today. The official account came to light only in 1925, when the scholar ": null
    },
    {
        "Leslie Hotson": "leslie hotson"
    },
    {
        " discovered the ": null
    },
    {
        "coroners": "coroner"
    },
    {
        "report of the inquest on Marlowes death, held two days later on Friday 1 June 1593, by the ": null
    },
    {
        "Coroner of the Queens Household": "coroner of the queens household"
    },
    {
        ", ": null
    },
    {
        "William Danby": "william danby"
    },
    {
        ". For a full transcript, see  . Marlowe had spent all day in a house in ": null
    },
    {
        "Deptford": "deptford, london"
    },
    {
        ", owned by the widow ": null
    },
    {
        "Eleanor Bull": "eleanor bull"
    },
    {
        " and together with three men: ": null
    },
    {
        "Ingram Frizer": "ingram frizer"
    },
    {
        ", ": null
    },
    {
        "Nicholas Skeres": "nicholas skeres"
    },
    {
        " and ": null
    },
    {
        "Robert Poley": "robert poley"
    },
    {
        ". All three had been employed by one or other of the Walsinghams. Skeres and Poley had helped snare the conspirators in the ": null
    },
    {
        "Babington plot": "babington plot"
    },
    {
        " and Frizer would later describe ": null
    },
    {
        "Thomas Walsingham": "thomas walsingham"
    },
    {
        " as his master at that time, although his role was probably more that of a financial or business agent, as he was for Walsinghams wife ": null
    },
    {
        "Audrey": "audrey walsingham"
    },
    {
        " a few years later. Leslie Hotson, The Death of Christopher Marlowe p.65 Park Honan, Christopher Marlowe: Poet and Spy p.325 These witnesses testified that Frizer and Marlowe had argued over payment of the bill exchanging divers malicious words while Frizer was sitting at a table between the other two and Marlowe was lying behind him on a couch. Marlowe snatched Frizers dagger and wounded him on the head. In the ensuing struggle, according to the coroners report, Marlowe was stabbed above the right eye, killing him instantly. The jury concluded that Frizer acted in self-defence and within a month he was pardoned. Marlowe was buried in an unmarked grave in the churchyard of St. Nicholas, Deptford immediately after the inquest, on 1 June 1593. Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 . McFarland & Company, Inc., Publishers. Kindle Edition     The complete text of the inquest report was published by Leslie Hotson in his book, The Death of Christopher Marlowe, in the introduction to which Prof. ": null
    },
    {
        "George Kittredge": "george lyman kittredge"
    },
    {
        " said The mystery of Marlowes death, heretofore involved in a cloud of contradictory gossip and irresponsible guess-work, is now cleared up for good and all on the authority of public records of complete authenticity and gratifying fullness but this confidence proved fairly short-lived. Hotson had considered the possibility that the witnesses had concocted a lying account of Marlowes behaviour, to which they swore at the inquest, and with which they deceived the jury but came down against that scenario. Hotson pp.39–40 Others began to suspect that this was indeed the case. Writing to the TLS shortly after the books publication, Eugénie de Kalb disputed that the struggle and outcome as described were even possible and ": null
    },
    {
        "Samuel A. Tannenbaum": "samuel a. tannenbaum"
    },
    {
        " insisted the following year that such a wound could not have possibly resulted in instant death, as had been claimed. de Kalb, Eugénie . The Death of Marlowe , in The Times Literary Supplement Tannenbaum, Samuel . The Assassination of Christopher Marlowe, New York, pp.41–42 Even Marlowes biographer John Bakeless acknowledged that some scholars have been inclined to question the truthfulness of the coroners report. There is something queer about the whole episode and said that Hotsons discovery raises almost as many questions as it answers . Bakeless, John . The Tragicall History of Christopher Marlowe, p.182 It has also been discovered more recently that the apparent absence of a local county coroner to accompany the Coroner of the Queens Household would, if noticed, have made the inquest null and void. Honan , p.354     One of the main reasons for doubting the truth of the inquest concerns the reliability of Marlowes companions as witnesses. Nicholl, Charles . Marlowe, Christopher , Oxford Dictionary of National Biography, Oxford University Press. , January 2008. Retrieved 24 August 2013. The authenticity of the inquest is not in doubt, but whether it tells the full truth is another matter. The nature of Marlowes companions raises questions about their reliability as witnesses. As an agent provocateur for the late Sir Francis Walsingham, Robert Poley was a consummate liar, the very genius of the Elizabethan underworld and is on record as saying I will swear and forswear myself, rather than I will accuse myself to do me any harm . Boas , p.293 Nicholl , p.38 The other witness, Nicholas Skeres, had for many years acted as a confidence trickster, drawing young men into the clutches of people in the money-lending racket, including Marlowes apparent killer, Ingram Frizer, with whom he was engaged in such a swindle. Nicholl , pp.29–30 Despite their being referred to as generosi in the inquest report, the witnesses were professional liars. Some biographers, such as Kuriyama and Downie, take the inquest to be a true account of what occurred but in trying to explain what really happened if the account was not true, others have come up with a variety of murder theories. Kuriyama , p.136 Downie, J. A. Marlowe, facts and fictions , in Downie, J. A. & Parnell, J. T. . Constructing Christopher Marlowe, pp.26–27   Jealous of her husband Thomass relationship with Marlowe, Audrey Walsingham arranged for the playwright to be murdered. de Kalb   Sir Walter Raleigh arranged the murder, fearing that under torture Marlowe might incriminate him. Tannenbaum   With Skeres the main player, the murder resulted from attempts by the Earl of Essex to use Marlowe to incriminate Sir Walter Raleigh. Nicholl , p.415   He was killed on the orders of father and son Lord Burghley and ": null
    },
    {
        "Sir Robert Cecil": "robert cecil, 1st earl of salisbury"
    },
    {
        ", who thought that his plays contained Catholic propaganda. Breight, Curtis C. .  Surveillance, Militarism and Drama in the Elizabethan Era, p.114   He was accidentally killed while Frizer and Skeres were pressuring him to pay back money he owed them. Hammer, Paul E. J. A Reckoning Reframed: the Murder of Christopher Marlowe Revisited , in English Literary Renaissance, pp.225–242   Marlowe was murdered at the behest of several members of the Privy Council who feared that he might reveal them to be atheists. Trow, M. J. . Who Killed Kit Marlowe? A contract to murder in Elizabethan England, p.250   The Queen ordered his assassination because of his subversive atheistic behaviour. Riggs, David . The World of Christopher Marlowe, pp.334–7   Frizer murdered him because he envied Marlowes close relationship with his master Thomas Walsingham and feared the effect that Marlowes behaviour might have on Walsinghams reputation. Honan , p.348   Marlowes ": null
    },
    {
        "death was faked": "marlovian theory of shakespeare authorship"
    },
    {
        " to save him from trial and execution for subversive atheism. Honan , p.355. Useful research has been stimulated by the infinitesimally thin possibility that Marlowe did not die when we think he did. ... History holds its doors open.     Since there are only written documents on which to base any conclusions and since it is probable that the most crucial information about his death was never committed to paper, it is unlikely that the full circumstances of Marlowes death will ever be known.          Marlowe was reputed to be an ": null
    },
    {
        "atheist": "atheist"
    },
    {
        ", which held the dangerous implication of being an enemy of God and the state, by association.  With the rise of public fears concerning ": null
    },
    {
        "The School of Night": "the school of night"
    },
    {
        ", or School of Atheism in the late 16th century, accusations of atheism were closely associated with disloyalty to the Protestant monarchy of England.      Some modern historians consider that Marlowes professed atheism, as with his supposed Catholicism, may have been no more than a sham to further his work as a government spy.  Contemporary evidence comes from Marlowes accuser in ": null
    },
    {
        "Flushing": "flushing, netherlands"
    },
    {
        ", an informer called ": null
    },
    {
        "Richard Baines": "richard baines"
    },
    {
        ". The governor of Flushing had reported that each of the men had of malice accused the other of instigating the counterfeiting and of intending to go over to the Catholic enemy ; such an action was considered atheistic by the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ". Following Marlowes arrest in 1593, Baines submitted to the authorities a note containing the opinion of one Christopher Marly concerning his damnable judgment of religion, and scorn of Gods word . For a full transcript, see  . Baines attributes to Marlowe a total of eighteen items which scoff at the pretensions of the ": null
    },
    {
        "Old": "old testament"
    },
    {
        " and ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " such as, Christ was a bastard and his mother dishonest , the woman of Samaria and her sister were whores and that Christ knew them dishonestly , St ": null
    },
    {
        "John the Evangelist": "john the evangelist"
    },
    {
        " was bedfellow to Christ and leaned always in his bosom and that he used him as the sinners of ": null
    },
    {
        "Sodom": "sodom and gomorrah"
    },
    {
        " .  He also implied that Marlowe had Catholic sympathies. Other passages are merely sceptical in tone: he persuades men to atheism, willing them not to be afraid of bugbears and hobgoblins . The final paragraph of Bainess document reads:          Similar examples of Marlowes statements were given by ": null
    },
    {
        "Thomas Kyd": "thomas kyd"
    },
    {
        " after his imprisonment and possible torture ; Kyd and Baines connect Marlowe with the mathematician ": null
    },
    {
        "Thomas Harriots": "thomas harriot"
    },
    {
        "and ": null
    },
    {
        "Sir Walter Raleighs": "sir walter raleigh"
    },
    {
        "circle. Another document claimed about that time that one Marlowe is able to show more sound reasons for Atheism than any divine in England is able to give to prove divinity, and that ... he hath read the Atheist lecture to Sir Walter Raleigh and others . The so-called Remembrances against Richard Cholmeley. For a full transcript, see .        Some critics believe that Marlowe sought to disseminate these views in his work and that he identified with his rebellious and iconoclastic protagonists. Waith, Eugene. The Herculean Hero in Marlowe, Chapman, Shakespeare, and Dryden. Chatto and Windus, London, 1962. The idea is commonplace, though by no means universally accepted. Plays had to be approved by the ": null
    },
    {
        "Master of the Revels": "master of the revels"
    },
    {
        " before they could be performed and the censorship of publications was under the control of the ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        ". Presumably these authorities did not consider any of Marlowes works to be unacceptable other than the Amores.       Marlowe is frequently claimed to have been homosexual. Some scholars argue that the question of whether an Elizabethan was gay or homosexual in a modern sense is anachronistic, claiming that for the Elizabethans, what is often today termed homosexual or bisexual was more likely to be recognised as a sexual act, rather than an exclusive sexual orientation and identity.  Other scholars argue that the evidence is inconclusive and that the reports of Marlowes homosexuality may be rumours produced after his death. Richard Baines reported Marlowe as saying: all they that love not Tobacco & Boies were fools . ": null
    },
    {
        "David Bevington": "david bevington"
    },
    {
        " and Eric Rasmussen describe Bainess evidence as unreliable testimony and These and other testimonials need to be discounted for their exaggeration and for their having been produced under legal circumstances we would regard as a witch-hunt . Doctor Faustus and Other Plays, pp. viii–ix     ": null
    },
    {
        "J. B. Steane": "j. b. steane"
    },
    {
        " remarked that he considered there to be no evidence for Marlowes homosexuality at all . Other scholars point to homosexual themes in Marlowes writing: in  Hero and Leander , Marlowe writes of the male youth Leander: in his looks were all that men desire...  Hero and Leander, 88 . Hero and Leander, 157–192. Hero and Leander, 192–193.  Edward the Second  contains the following passage enumerating homosexual relationships:        Marlowe wrote the only play about the life of ": null
    },
    {
        "Edward II": "edward ii"
    },
    {
        " up to his time, taking the ": null
    },
    {
        "humanist": "renaissance humanism"
    },
    {
        " literary discussion of male sexuality much further than his contemporaries. The play was extremely bold, dealing with a star-crossed love story between Edward II and ": null
    },
    {
        "Piers Gaveston": "piers gaveston, 1st earl of cornwall"
    },
    {
        ". Though it was a common practice at the time to reveal characters as gay to give audiences reason to suspect them as culprits in a crime, Christopher Marlowes Edward II is portrayed as a sympathetic character.        For his contemporaries in the literary world, Marlowe was above all an admired and influential artist. Within weeks of his death, ": null
    },
    {
        "George Peele": "george peele"
    },
    {
        " remembered him as Marley, the Muses darling ; ": null
    },
    {
        "Michael Drayton": "michael drayton"
    },
    {
        " noted that he Had in him those brave translunary things / That the first poets had and ": null
    },
    {
        "Ben Jonson": "ben jonson"
    },
    {
        " wrote of Marlowes mighty line . ": null
    },
    {
        "Thomas Nashe": "thomas nashe"
    },
    {
        " wrote warmly of his friend, poor deceased Kit Marlowe . So too did the publisher Edward Blount, in the dedication of Hero and Leander to Sir Thomas Walsingham. Among the few contemporary dramatists to say anything negative about Marlowe was the anonymous author of the Cambridge University play  The Return From Parnassus  who wrote, Pity it is that wit so ill should dwell, / Wit lent from heaven, but vices sent from hell .     The most famous tribute to Marlowe was paid by ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        " in  As You Like It , where he not only quotes a line from  Hero and Leander   but also gives to the clown ": null
    },
    {
        "Touchstone": "touchstone"
    },
    {
        " the words When a mans verses cannot be understood, nor a mans good wit seconded with the forward child, understanding, it strikes a man more dead than a great reckoning in a little room . Peter Alexander ed., William Shakespeare: The Complete Works p. 273 This appears to be a reference to Marlowes murder which involved a fight over the reckoning , the bill, as well as to a line in Marlowes Jew of Malta; Infinite riches in a little room .     Shakespeare was much influenced by Marlowe in his work, as can be seen in the use of Marlovian themes in  Antony and Cleopatra ,  The Merchant of Venice ,  Richard II  and  Macbeth  . In  Hamlet , after meeting with the travelling actors, Hamlet requests the Player perform a speech about the Trojan War, which at 2.2.429–32 has an echo of Marlowes  Dido, Queen of Carthage . In  Loves Labours Lost  Shakespeare brings on a character Marcade in conscious acknowledgement of Marlowes character Mercury , also attending the King of Navarre, in Massacre at Paris. The significance, to those of Shakespeares audience who had read Hero and Leander, was Marlowes identification of himself with the god ": null
    },
    {
        "Mercury": "mercury"
    },
    {
        ".           An ": null
    },
    {
        "argument": "argument"
    },
    {
        " has arisen about the notion that Marlowe may have faked his death and then continued to write under the assumed name of William Shakespeare. Orthodox academic consensus rejects alternative candidates for authorship of Shakespeares plays and sonnets, including Marlowe. Kathman, David , The Question of Authorship , in Wells, Stanley; Orlin, Lena C., Shakespeare: an Oxford Guide, Oxford University Press, pp. 620–32,           A ": null
    },
    {
        "Marlowe Memorial": "marlowe memorial"
    },
    {
        " in the form of a ": null
    },
    {
        "bronze sculpture": "bronze sculpture"
    },
    {
        " of The Muse of Poetry by ": null
    },
    {
        "Edward Onslow Ford": "edward onslow ford"
    },
    {
        " was erected by subscription in Buttermarket, Canterbury in 1891.  In July 2002, a memorial window to Marlowe, a gift of the Marlowe Society, was unveiled in ": null
    },
    {
        "Poets Corner": "poets corner"
    },
    {
        " in ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        ".  – Westminster Abbey Controversially, a question mark was added to the generally accepted date of death.  On 25 October 2011 a letter from Paul Edmondson and ": null
    },
    {
        "Stanley Wells": "stanley wells"
    },
    {
        " was published by  The Times  newspaper, in which they called on the Dean and Chapter to remove the question mark on the grounds that it flew in the face of a mass of unimpugnable evidence . In 2012, they renewed this call in their e-book Shakespeare Bites Back, adding that it denies history and again the following year in their book Shakespeare Beyond Doubt.  pp. 21, 22 & 38.             Marlowe has been used as a character in plays, novels, films and TV-productions.       The dates of composition are approximate.        Dido, Queen of Carthage       Tamburlaine , part 1 , part 2     The Jew of Malta      Doctor Faustus      Edward II      The Massacre at Paris       The play  Lusts Dominion  was attributed to Marlowe upon its initial publication in 1657, though scholars and critics have almost unanimously rejected the attribution. He may also have written or co-written  Arden of Faversham .       Translation of Book One of ": null
    },
    {
        "Lucans": "lucan"
    },
    {
        "  Pharsalia    Translation of ": null
    },
    {
        "Ovids": "ovid"
    },
    {
        " Amores     The Passionate Shepherd to His Love     Hero and Leander         ": null
    }
]