[
    {
        "              Christology , translated literally from Greek as the word of Christ , is the study of the nature and work of ": null
    },
    {
        "Jesus Christ": "Jesus In Christianity"
    },
    {
        ". It studies Jesus Christs humanity and divinity, and the relation between these two natures; and the role he plays in ": null
    },
    {
        "salvation": "Salvation In Christianity"
    },
    {
        ".     The earliest Christian writings gave several titles to Jesus, such as ": null
    },
    {
        "Son of Man": "Son Of Man"
    },
    {
        ", ": null
    },
    {
        "Son of God": "Son Of God"
    },
    {
        ", ": null
    },
    {
        "Messiah": "Messiah"
    },
    {
        ", and ": null
    },
    {
        "Kyrios": "Kyrios"
    },
    {
        ", which were all derived from the Hebrew scriptures. These terms centered around two themes, namely Jesus as a ": null
    },
    {
        "preexistent figure": "Pre-Existence Of Christ"
    },
    {
        " who ": null
    },
    {
        "becomes human": "Incarnation"
    },
    {
        " and then ": null
    },
    {
        "returns to God": "Session Of Christ"
    },
    {
        ", and Jesus as a creature elected and ": null
    },
    {
        "adopted": "Adoptionism"
    },
    {
        " by God.     From the second to the fifth centuries, the relation of the human and divine nature of Christ was a major focus of debates in the ": null
    },
    {
        "early church": "Early Centers Of Christianity"
    },
    {
        " and at the ": null
    },
    {
        "first seven ecumenical councils": "First Seven Ecumenical Councils"
    },
    {
        ". The ": null
    },
    {
        "Council of Chalcedon": "Council Of Chalcedon"
    },
    {
        " in 451 issued a formulation of the ": null
    },
    {
        "hypostatic union": "Hypostatic Union"
    },
    {
        " of the two natures of Christ, one human and one divine, united with neither confusion nor division . Most of the major branches of Western Christianity and ": null
    },
    {
        "Eastern Orthodoxy": "Eastern Orthodoxy"
    },
    {
        " subscribe to this formulation, while many branches of ": null
    },
    {
        "Oriental Orthodox Churches": "Oriental Orthodox Churches"
    },
    {
        " reject it, subscribing to ": null
    },
    {
        "miaphysitism": "Miaphysitism"
    },
    {
        ".         Christology , literally the understanding of Christ,  is the study of the nature and work  of ": null
    },
    {
        "Jesus Christ": "Jesus In Christianity"
    },
    {
        ". Matt Stefon, Hans J. Hillerbrand, , Encyclopedia Britannica Catholic encyclopedia,   It studies Jesus Christs humanity and divinity, and the relation between these two aspects; and the role he plays in ": null
    },
    {
        "salvation": "Salvation In Christianity"
    },
    {
        ".     ": null
    },
    {
        "Ontological": "Ontology"
    },
    {
        " Christology analyzes the nature or being thinkapologetics.com,  Jesus- A Functional or Ontological Christology? of Jesus Christ. Functional Christology analyzes the works of Jesus Christ, while ": null
    },
    {
        "soteriological": "Christian Soteriology"
    },
    {
        " Christology analyzes the ": null
    },
    {
        "salvific": "Christian Soteriology"
    },
    {
        " standpoints of Christology. Christology from within and ahead by Mark L. Y. Chan 2001  pp. 59–62      Several approaches can be distinguished within Christology. The term Christology from above  or high Christology  refers to approaches that include aspects of divinity, such as Lord and Son of God, and the idea of the ": null
    },
    {
        "pre-existence of Christ": "Pre-Existence Of Christ"
    },
    {
        " as the  Logos  , as expressed in the ": null
    },
    {
        "prologue to the Gospel of John": "Wikisource:Bible /John1"
    },
    {
        ". These approaches interpret the works of Christ in terms of his divinity. According to Pannenberg, Christology from above was far more common in the ancient Church, beginning with ": null
    },
    {
        "Ignatius of Antioch": "Ignatius Of Antioch"
    },
    {
        " and the second century Apologists.  The term Christology from below  or low Christology  refers to approaches that begin with the human aspects and the ministry of Jesus and move towards his divinity and the mystery of incarnation.               A basic Christological teaching is that the person of ": null
    },
    {
        "Jesus Christ": "Christ"
    },
    {
        " is both human and divine. The human and divine natures of Jesus Christ apparently  form a duality, as they coexist within one person . Introducing Christian Doctrine by Millard J. Erickson, L. Arnold Hustad 2001 ISBN p. 234 There are no direct discussions in the ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        " regarding the ": null
    },
    {
        "dual nature": "Hypostatic Union"
    },
    {
        " of the Person of Christ as both divine and human, and since the early days of Christianity, theologians have debated various approaches to the understanding of these natures, at times resulting in ecumenical councils, and schisms.     Some historical christological doctrines gained broad support. We show them here with simplified summaries; see the linked articles for details.   ": null
    },
    {
        "Monophysitism": "Monophysitism"
    },
    {
        " After the union of the divine and the human in the historical incarnation, Jesus Christ had only a single nature   ": null
    },
    {
        "Miaphysitism": "Miaphysitism"
    },
    {
        "  In the person of Jesus Christ, divine nature and human nature are united in a compound nature   ": null
    },
    {
        "Dyophysitism": "Dyophysitism"
    },
    {
        "  Christ maintained two natures, one divine and one human, before and after the Incarnation   ": null
    },
    {
        "Monarchianism": "Monarchianism"
    },
    {
        "  God as one, in contrast to the doctrine of the ": null
    },
    {
        "Trinity": "Trinity"
    },
    {
        "   Influential Christologies which were broadly condemned as heretical are:   ": null
    },
    {
        "Docetism": "Docetism"
    },
    {
        " claimed the human form of Jesus was mere semblance without any true reality   ": null
    },
    {
        "Arianism": "Arianism"
    },
    {
        " viewed Jesus as primarily an ordinary mortal, albeit in contact with or infused by the Divine   ": null
    },
    {
        "Nestorianism": "Nestorianism"
    },
    {
        " considered the two natures of Jesus Christ almost entirely distinct   Various church ": null
    },
    {
        "councils": "Controversies_And_Ecumenical_Councils_"
    },
    {
        ", mainly in the 4th and 5th centuries, resolved most of these controversies, making the doctrine of the ": null
    },
    {
        "Trinity": "Trinity"
    },
    {
        " orthodox in nearly all branches of Christianity. Among them, only the Dyophysite doctrine was recognized as true and not heretical, belonging to the Christian ": null
    },
    {
        "orthodoxy": "Orthodoxy"
    },
    {
        " and ": null
    },
    {
        "deposit of faith": "Deposit Of Faith"
    },
    {
        ".            In ": null
    },
    {
        "Christian theology": "Christian Theology"
    },
    {
        ", ": null
    },
    {
        "atonement": "Atonement"
    },
    {
        " is the method by which human beings can be reconciled to ": null
    },
    {
        "God": "God In Christianity"
    },
    {
        " through ": null
    },
    {
        "Christs": "Christ"
    },
    {
        "sacrificial suffering and ": null
    },
    {
        "death": "Crucifixion Of Jesus"
    },
    {
        ". Atonement. Cross, F. L., ed. The Oxford dictionary of the Christian church. New York: Oxford University Press. 2005 Atonement is the ": null
    },
    {
        "forgiving": "Forgivenesschristianity"
    },
    {
        " or pardoning of ": null
    },
    {
        "sin": "Christian Views Of Sin"
    },
    {
        " in general and ": null
    },
    {
        "original sin": "Original Sin"
    },
    {
        " in particular through the suffering, death and ": null
    },
    {
        "resurrection of Jesus": "Resurrection Of Jesus"
    },
    {
        ", Collins English Dictionary, Complete & Unabridged 11th Edition, , retrieved October 03, 2012: 2. Christian theol a. the reconciliation of man with God through the life, sufferings, and sacrificial death of Christ b. the sufferings and death of Christ enabling the ": null
    },
    {
        "reconciliation": "Reconciliation"
    },
    {
        " between God and ": null
    },
    {
        "his creation": "Genesis Creation Narrative"
    },
    {
        ". Due to the influence of ": null
    },
    {
        "Gustaf Aulèns": "Gustaf Aulen"
    },
    {
        " Christus Victor , the various theories or paradigmas of atonement are often grouped as classical paradigm, objective paradigm, and the subjective paradigm : ": null
    },
    {
        "Gustaf Aulen": "Gustaf Aulen"
    },
    {
        ", Christus Victor: An Historical Study of the Three Main Types of the Idea of Atonement, E.T. London: SPCK; New York: Macmillan,1931 ": null
    },
    {
        "Vincent Taylor": "Vincent Taylor"
    },
    {
        ", The Cross of Christ , p. 71-2   Classical paradigm: ": null
    },
    {
        "Ransom theory of atonement": "Ransom Theory Of Atonement"
    },
    {
        ", which teaches that the ": null
    },
    {
        "death": "Crucifixion Of Jesus"
    },
    {
        " of ": null
    },
    {
        "Christ": "Christ"
    },
    {
        " was a ": null
    },
    {
        "ransom": "Ransom"
    },
    {
        " sacrifice": "Sacrificechristianity"
    },
    {
        ", usually said to have been paid to ": null
    },
    {
        "Satan": "Satan"
    },
    {
        " or to death itself, in some views paid to ": null
    },
    {
        "God the Father": "God The Father"
    },
    {
        ", in satisfaction for the bondage and debt on the souls of humanity as a result of ": null
    },
    {
        "inherited sin": "Original Sin"
    },
    {
        ". Gustaf Aulén reinterpreted the ransom thory, calling it the ": null
    },
    {
        "Christus Victor": "Christus Victor"
    },
    {
        " doctrine, arguing that Christs death was not a payment to the Devil, but defeated the powers of ": null
    },
    {
        "evil": "Evil"
    },
    {
        ", which had held humankind in their dominion.; Leon Morris, Theories of the Atonement in Elwell Evangelical Dictionary.  ": null
    },
    {
        "Recapitulation theory": "Recapitulation Theory Of Atonement"
    },
    {
        ", which says that Christ succeeded where ": null
    },
    {
        "Adam": "Adam"
    },
    {
        " failed": "Fall Of Man"
    },
    {
        ". ": null
    },
    {
        "Theosis": "Divinization"
    },
    {
        " is a corollary of the recapitulation. ": null
    },
    {
        "Satisfaction theory of atonement": "Satisfaction Theory Of Atonement"
    },
    {
        ", developed by ": null
    },
    {
        "Anselm of Canterbury": "Anselm Of Canterbury"
    },
    {
        " , which teaches that ": null
    },
    {
        "Jesus Christ": "Jesus Christ"
    },
    {
        " suffered ": null
    },
    {
        "crucifixion": "Crucifixion Of Jesus"
    },
    {
        " as a ": null
    },
    {
        "substitute": "Substitutionary Atonement"
    },
    {
        " for human ": null
    },
    {
        "sin": "Sin"
    },
    {
        ", satisfying Gods just wrath against humankinds transgression due to Christs infinite merit.    ": null
    },
    {
        "Penal substitution": "Penal Substitution"
    },
    {
        ", also called forensic theory and vicarious punishment, which was a development by the Reformers of Anselms satisfaction theory. Instead of considering sin as an affront to Gods honour, it sees sin as the breaking of Gods moral law. Penal substitution sees sinful man as being subject to Gods wrath, with the essence of Jesus saving work being his substitution in the sinners place, bearing the curse in the place of man.   ": null
    },
    {
        "Moral government theory": "Governmental Theory Of Atonement"
    },
    {
        ", which views God as both the loving creator and moral Governor of the universe.  ": null
    },
    {
        "Moral influence theory of atonement": "Moral Influence Theory Of Atonement"
    },
    {
        ", developed, or most notably propagated, by ": null
    },
    {
        "Abelard": "Abelard"
    },
    {
        " , who argued that Jesus died as the demonstration of Gods love, a demonstration which can change the hearts and minds of the sinners, turning back to God. ": null
    },
    {
        "Moral example theory": "Moral Example Theory"
    },
    {
        ", developed by ": null
    },
    {
        "Faustus Socinus": "Faustus Socinus"
    },
    {
        " in his work De Jesu Christo servatore , who rejected the idea of vicarious satisfaction.  According to Socinus, Jesus death offers us a perfect example of self-sacrificial dedication to God.      Other theories are the embracement theory and the shared atonement theory. Jeremiah, David. 2009. Living With Confidence in a Chaotic World, pp. 96 & 124. Nashville, Tennessee: Thomas Nelson, Inc. Massengale, Jamey. 2013.Renegade Gospel, The Jesus Manifold. Amazon, Kindle              The earliest Christological reflections were shaped by both the Jewish background of the earliest Christians, and by the Greek world of the eastern Mediterranean in which they operated.  The earliest Christian writings give several titles to Jesus, such as ": null
    },
    {
        "Son of Man": "Son Of Man"
    },
    {
        ", ": null
    },
    {
        "Son of God": "Son Of God"
    },
    {
        ", ": null
    },
    {
        "Messiah": "Messiah"
    },
    {
        ", and ": null
    },
    {
        "Kyrios": "Kyrios"
    },
    {
        ", which were all derived from the Hebrew scriptures.  According to Matt Stefon and Hans J. Hillerbrand,        Historically in the ": null
    },
    {
        "Alexandrian school": "Alexandrian School"
    },
    {
        " of thought , Jesus Christ is the ": null
    },
    {
        "eternal Logos": "Logos"
    },
    {
        " who already possesses unity with the Father before the act of ": null
    },
    {
        "Incarnation": "Incarnation"
    },
    {
        ". Karl Barths christology by Charles T. Waldrop 1985  pp. 19–23 In contrast, the ": null
    },
    {
        "Antiochian school": "Antiochian School"
    },
    {
        " viewed Christ as a single, unified human person apart from his relationship to the divine.        The notion of pre-existence is deeply rooted in Jewish thought, and can be found in apocalyptic thought and among the rabbis of Pauls time, but Paul was most influenced by Jewish-Hellenistic wisdom literature, where Wisdom is extolled as something existing before the world and already working in creation. According to Witherington, Paul subscribed to the christological notion that Christ existed prior to taking on human flesh founding the story of Christ on the story of divine Wisdom.        The title ": null
    },
    {
        "Kyrios": "Kyrios"
    },
    {
        " for Jesus is central to the development of ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        " Christology. It is the Greek translation of ": null
    },
    {
        "Aramaic": "Aramaic"
    },
    {
        " Mari, which in everyday Aramaic usage was a very respectful form of polite address, which means more than just Teacher and was somewhat similar to ": null
    },
    {
        "Rabbi": "Rabbi"
    },
    {
        ". While the term Mari expressed the relationship between Jesus and his disciples during his life, the Greek Kyrios came to represent his lordship over the world. The Christology of the New Testament by Oscar Cullmann 1959  p. 202      The ": null
    },
    {
        "early Christians": "Early Christianity"
    },
    {
        " placed Kyrios at the center of their understanding, and from that center attempted to understand the other issues related to the Christian mysteries. Christology: Biblical And Historical by Mini S. Johnson, 2005  pp. 229–35  The question of the deity of Christ in the New Testament is inherently related to the Kyrios title of Jesus used in the early Christian writings and its implications for the absolute lordship of Jesus. In early Christian belief, the concept of Kyrios included the ": null
    },
    {
        "pre-existence of Christ": "Pre-Existence Of Christ"
    },
    {
        ", for they believed if Christ is one with God, he must have been united with God from the very beginning. The Christology of the New Testament by Oscar Cullmann 1959  pp. 234–37             Two fundamentally different Christologies developed in the early Church, namely a low or ": null
    },
    {
        "adoptionist": "Adoptionism"
    },
    {
        " Christology, and a high or incarnation Christology.  The chronology of the development of these early Christologies is a matter of debate within contemporary scholarship.     The low Christology or adoptionist Christology is the belief that God exalted Jesus to be his Son by raising him from the dead,  thereby raising him to divine status.  According to the evolutionary model  c.q. evolutionary theories,  the Christological understanding of Christ developed over time, Bart Ehrman, How Jesus became God, Course Guide as witnessed in the Gospels, with the earliest Christians believing that Jesus was a human who was exalted, c.q. ": null
    },
    {
        "adopted": "Adoptionism"
    },
    {
        " as Gods Son, when he was resurrected. Geza Vermez , The Resurrection, p.138-139 Later beliefs shifted the exaltation to his baptism, birth, and subsequently to the idea of his pre-existence, as witnessed in the Gospel of John. This evolutionary model was proposed by proponents of the Religionsgeschichtliche Schule, especially ": null
    },
    {
        "Wilhelm Boussets": "Wilhelm Bousset"
    },
    {
        "influential Kyrios Christos . This evolutionary model was very influential, and the low Christology has long been regarded as the oldest Christology.      The other early Christology is high Christology, which is the view that Jesus was a pre-existent divine being who became a human, did the Father’s will on earth, and then was taken back up into heaven whence he had originally come,  and from where he ": null
    },
    {
        "appeared on earth": "Christophany"
    },
    {
        ". According to Bousset, this high Christology developed at the time of Pauls writing, under the influence of Gentile Christians, who brought their pagan Hellenistic traditions to the early Christian communities, introducing divine honours to Jesus. According to Casey and Dunn, this high Christology developed after the time of Paul, at the end of the first century CE when the Gospel according to John was written.     Since the 1970s, these late datings for the development of a high Christology have been contested, and a majority of scholars argue that this High Christology existed already before the writings of Paul.  According to the New Religionsgeschichtliche Schule,  Larry Hurtado ,  c.q. Early High Christology Club, which includes ": null
    },
    {
        "Martin Hengel": "Martin Hengel"
    },
    {
        ", ": null
    },
    {
        "Larry Hurtado": "Larry Hurtado"
    },
    {
        ", ": null
    },
    {
        "N. T. Wright": "N. T. Wright"
    },
    {
        ", and ": null
    },
    {
        "Richard Bauckham": "Richard Bauckham"
    },
    {
        ", this incarnation Christology or high Christology did not evolve over a longer time, but was a big bang of ideas which were already present at the start of Christianity, and took further shape in the first few decades of the church, as witnessed in the writings of Paul.   Some Early High Christology proponents scholars argue that this High Christology may go back to Jesus himself. Larry Hurtado,            The study of the various Christologies of the ": null
    },
    {
        "Apostolic Age": "Apostolic Age"
    },
    {
        " is based on early Christian documents.          The oldest Christian sources are the writings of ": null
    },
    {
        "Paul": "Paul The Apostle"
    },
    {
        ". The central Christology of Paul conveys the notion of Christs pre-existence and the identification of Christ as  Kyrios . Both notions already existed before him in the early Christian communities, and Paul deepened them and used them for preaching in the Hellenistic communities.     The ": null
    },
    {
        "Pauline epistles": "Pauline Epistles"
    },
    {
        " use Kyrios to identify Jesus almost 230 times, and express the theme that the true mark of a Christian is the confession of Jesus as the true Lord. Paul viewed the superiority of the Christian revelation over all other divine manifestations as a consequence of the fact that Christ is the ": null
    },
    {
        "Son of God": "Son Of God"
    },
    {
        ".     The Pauline epistles also advanced the ": null
    },
    {
        "cosmic Christ": "Cosmic Christ"
    },
    {
        "ology  later developed in the fourth gospel,  elaborating the cosmic implications of Jesus existence as the Son of God, as in Corinthians 5:17: Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come. Also, in Colossians 1:15: He is the image of the invisible God, the firstborn of all creation.             The synoptic Gospels date from after the writings of Paul. They provide episodes from the life of Jesus and some of his works, but the authors of the New Testament show little interest in an absolute chronology of Jesus or in synchronizing the episodes of his life, Encyclopedia of theology: a concise Sacramentum mundi by ": null
    },
    {
        "Karl Rahner": "Karl Rahner"
    },
    {
        " 2004  p. 731 and as in ": null
    },
    {
        "John 21:25": "Wikisource:Bible /John21:25"
    },
    {
        ", the Gospels do not claim to be an exhaustive list of his works.     Christologies that can be gleaned from the three ": null
    },
    {
        "Synoptic Gospels": "Synoptic Gospels"
    },
    {
        " generally emphasize the humanity of Jesus, his sayings, his ": null
    },
    {
        "parables": "Parables Of Jesus"
    },
    {
        ", and his ": null
    },
    {
        "miracles": "Miracles Of Jesus"
    },
    {
        ". The ": null
    },
    {
        "Gospel of John": "Gospel Of John"
    },
    {
        " provides a different perspective that focuses on his divinity. The first 14 verses of the Gospel of John are devoted to the divinity of Jesus as the  Logos , usually translated as Word , along with his pre-existence, and they emphasize the cosmic significance of Christ, e.g. John 1:3: All things were made through him, and without him was not any thing made that was made. In the context of these verses, the Word made flesh is identical with the Word who was in the beginning with God, being exegetically equated with Jesus.               Following the ": null
    },
    {
        "Apostolic Age": "Apostolic Age"
    },
    {
        ", from the second century onwards, a number of controversies developed about how the human and divine are related within the person of Jesus. As of the second century, a number of different and opposing approaches developed among various groups. In contrast to prevailing ": null
    },
    {
        "monoprosopic": "Monoprosopic"
    },
    {
        " views on the Person of Christ, alternative ": null
    },
    {
        "dyoprosopic": "Dyoprosopic"
    },
    {
        " notions were also promoted by some theologians, but such views were rejected by the ": null
    },
    {
        "ecumenical councils": "Ecumenical Councils"
    },
    {
        ". For example, ": null
    },
    {
        "Arianism": "Arianism"
    },
    {
        " did not endorse divinity, ": null
    },
    {
        "Ebionism": "Ebionism"
    },
    {
        " argued Jesus was an ordinary mortal, while ": null
    },
    {
        "Gnosticism": "Gnosticism"
    },
    {
        " held ": null
    },
    {
        "docetic": "Docetism"
    },
    {
        " views which argued Christ was a spiritual being who only appeared to have a physical body. The resulting tensions led to ": null
    },
    {
        "schisms": "Schism"
    },
    {
        "within the church in the second and third centuries, and ": null
    },
    {
        "ecumenical councils": "Ecumenical Councils"
    },
    {
        " were convened in the fourth and fifth centuries to deal with the issues.     Although some of the debates may seem to various modern students to be over a theological iota, they took place in controversial political circumstances, reflecting the relations of temporal powers and divine authority, and certainly resulted in schisms, among others that separated the ": null
    },
    {
        "Church of the East": "Church Of The East"
    },
    {
        " from the Church of the Roman Empire. Nicene and Post-Nicene Fathers, 2nd series, Vol. XIV p. 207, translated edition by H.R. Percival.  The Seven Ecumenical Councils of the Undivided Church, trans H. R. Percival, in Nicene and Post-Nicene Fathers, 2nd Series, ed. P. Schaff and H. Wace, , XIV, pp. 192–42       In 325, the ": null
    },
    {
        "First Council of Nicaea": "First Council Of Nicaea"
    },
    {
        " defined the persons of the ": null
    },
    {
        "Godhead": "Godhead"
    },
    {
        " and their relationship with one another, decisions which were ratified at the ": null
    },
    {
        "First Council of Constantinople": "First Council Of Constantinople"
    },
    {
        " in 381. The language used was that the one God exists in three persons ; in particular, it was affirmed that the Son was  homoousios  as the Father. The ": null
    },
    {
        "Nicene Creed": "Nicene Creed"
    },
    {
        " declared the full divinity and full humanity of Jesus. Jonathan Kirsch, God Against the Gods: The History of the War Between Monotheism and Polytheism Charles Freeman, The Closing of the Western Mind: The Rise of Faith and the Fall of Reason Edward Gibbons, The Decline and Fall of the Roman Empire , 21 After the ": null
    },
    {
        "First Council of Nicaea": "First Council Of Nicaea"
    },
    {
        " in 325 the Logos and the second Person of the ": null
    },
    {
        "Trinity": "Holy Trinity"
    },
    {
        " were being used interchangeably. A concise dictionary of theology by ": null
    },
    {
        "Gerald OCollins": "Gerald Ocollins"
    },
    {
        " 2004  pages 144-145       In 431, the ": null
    },
    {
        "First Council of Ephesus": "First Council Of Ephesus"
    },
    {
        " was initially called to address the views of ": null
    },
    {
        "Nestorius": "Nestorius"
    },
    {
        " on ": null
    },
    {
        "Mariology": "Mariology"
    },
    {
        ", but the problems soon extended to Christology, and schisms followed. The 431 council was called because in defense of his loyal priest Anastasius, Nestorius had denied the  Theotokos  title for ": null
    },
    {
        "Mary": "Virgin Mary"
    },
    {
        " and later contradicted ": null
    },
    {
        "Proclus": "Proclus"
    },
    {
        " during a sermon in ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        ". Pope ": null
    },
    {
        "Celestine I": "Celestine I"
    },
    {
        " wrote about this to ": null
    },
    {
        "Cyril of Alexandria": "Cyril Of Alexandria"
    },
    {
        ", who orchestrated the council. During the council, Nestorius defended his position by arguing there must be two persons of Christ, one human, the other divine, and Mary had given birth only to a human, hence could not be called the Theotokos, i.e. the one who gives birth to God . The debate about the single or dual nature of Christ ensued in Ephesus. The creed: the apostolic faith in contemporary theology by Berard L. Marthaler 2007  p. 114   Essential theological terms by Justo L. González 2005  p. 120  Doctrine and practice in the early church by Stuart George Hall 1992  pp. 211–18      The First Council of Ephesus debated ": null
    },
    {
        "miaphysitism": "Miaphysitism"
    },
    {
        "  versus ": null
    },
    {
        "dyophysitism": "Dyophysitism"
    },
    {
        " versus ": null
    },
    {
        "monophysitism": "Monophysitism"
    },
    {
        " versus ": null
    },
    {
        "Nestorianism": "Nestorianism"
    },
    {
        " . From the Christological viewpoint, the council adopted Mia Physis  - Council of Ephesus, Epistle of Cyril to Nestorius, i.e. One Nature of the Word of God Incarnate . In 451, the Council of Chalcedon affirmed ": null
    },
    {
        "dyophysitism": "Dyophysitism"
    },
    {
        ". The ": null
    },
    {
        "Oriental Orthodox": "Oriental Orthodox"
    },
    {
        " rejected this and subsequent councils and continued to consider themselves as miaphysite according to the faith put forth at the Councils of ": null
    },
    {
        "Nicaea": "First Council Of Nicaea"
    },
    {
        " and ": null
    },
    {
        "Ephesus": "Council Of Ephesus"
    },
    {
        ". Systematic Theology by Lewis Sperry Chafer 1993  pp. 382–84  The Blackwell Companion to Eastern Christianity by Ken Parry 2009  p. 88  The council also confirmed the Theotokos title and excommunicated Nestorius. Fundamentals of Catholicism: God, Trinity, Creation, Christ, Mary by Kenneth Baker 1983  pp. 228–31  Mary, Mother of God by Carl E. Braaten and Robert W. Jenson 2004  p. 84            The 451 ": null
    },
    {
        "Council of Chalcedon": "Council Of Chalcedon"
    },
    {
        " was highly influential, and marked a key turning point in the Christological debates. It is the last council which many ": null
    },
    {
        "Anglicans": "Anglican"
    },
    {
        "and most ": null
    },
    {
        "Protestants": "Protestants"
    },
    {
        " consider ecumenical.     The Council of Chalcedon fully promulgated the Western ": null
    },
    {
        "dyophysite": "Dyophysitism"
    },
    {
        " understanding put forth by ": null
    },
    {
        "Pope Leo I": "Pope Leo I"
    },
    {
        " of Rome of the  hypostatic union , the proposition that Christ has one human nature  physis  and one divine nature physis, each distinct and complete, and united with neither confusion nor division. Most of the major branches of Western Christianity  and ": null
    },
    {
        "Eastern Orthodoxy": "Eastern Orthodoxy"
    },
    {
        " subscribe to the Chalcedonian Christological formulation, while many branches of ": null
    },
    {
        "Oriental Orthodox Churches": "Oriental Orthodox Churches"
    },
    {
        "  reject it.     Although the ": null
    },
    {
        "Chalcedonian Creed": "Chalcedonian Creed"
    },
    {
        " did not put an end to all Christological debate, it did clarify the terms used and became a point of reference for many future Christologies. But it also broke apart the church of the ": null
    },
    {
        "Eastern Roman Empire": "Eastern Roman Empire"
    },
    {
        " in the fifth century, and unquestionably established the primacy of Rome in the East over those who accepted the Council of Chalcedon. This was reaffirmed in 519, when the Eastern Chalcedonians accepted the ": null
    },
    {
        "Formula of Hormisdas": "Pope Hormisdas"
    },
    {
        ", anathematizing all of their own Eastern Chalcedonian hierarchy, who died out of communion with Rome from 482-519.       The ": null
    },
    {
        "Second Council of Constantinople": "Second Council Of Constantinople"
    },
    {
        " in 553 interpreted the decrees of Chalcedon, and further explained the relationship of the two natures of Jesus. It also condemned the alleged teachings of ": null
    },
    {
        "Origen": "Origen"
    },
    {
        " on the pre-existence of the soul, and other topics.      The ": null
    },
    {
        "Third Council of Constantinople": "Third Council Of Constantinople"
    },
    {
        " in 681 declared that Christ has two wills of his two natures, human and divine, contrary to the teachings of the ": null
    },
    {
        "Monothelites": "Monothelites"
    },
    {
        ",  with the divine will having precedence, leading and guiding the human will. The Westminster Dictionary of Christian Theology by Alan Richardson and John Bowden  page 169     The ": null
    },
    {
        "Second Council of Nicaea": "Second Council Of Nicaea"
    },
    {
        " was called under the Empress Regent ": null
    },
    {
        "Irene of Athens": "Irene Of Athens"
    },
    {
        " in 787, known as the second of Nicaea. It supports the ": null
    },
    {
        "veneration": "Veneration"
    },
    {
        " of ": null
    },
    {
        "icons": "Icon"
    },
    {
        "while forbidding their worship. It is often referred to as The Triumph of Orthodoxy .                         The term monastic Christology has been used to describe spiritual approaches developed by ": null
    },
    {
        "Anselm of Canterbury": "Anselm Of Canterbury"
    },
    {
        ", ": null
    },
    {
        "Peter Abelard": "Peter Abelard"
    },
    {
        " and ": null
    },
    {
        "Bernard of Clairvaux": "Bernard Of Clairvaux"
    },
    {
        ". The ": null
    },
    {
        "Franciscan": "Franciscan"
    },
    {
        " piety of the 12th and 13th centuries led to popular Christology . Systematic approaches by theologians, such as ": null
    },
    {
        "Thomas Aquinas": "Thomas Aquinas"
    },
    {
        ", are called scholastic Christology . Christology: Biblical And Historical by Mini S. Johnson, 2005  pp. 74–76      In the ": null
    },
    {
        "13th century": "Christianity In The 13Th Century"
    },
    {
        ", Saint ": null
    },
    {
        "Thomas Aquinas": "Thomas Aquinas"
    },
    {
        " provided the first systematic Christology that consistently resolved a number of the existing issues.  In his Christology from above, Aquinas also championed the ": null
    },
    {
        "principle of perfection of Christs": "Perfection Of Christ"
    },
    {
        "human attributes. Christology: Biblical And Historical by Mini S. Johnson, 2005  pp. 76–79   Aquinas as authority by Paul van Geest, Harm J. M. J. Goris pp. 25–35      The ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        " also witnessed the emergence of the tender image of Jesus as a friend and a living source of love and comfort, rather than just the Kyrios image. Christology: Key Readings in Christian Thought by Jeff Astley, David Brown, Ann Loades 2009  p. 106       ": null
    },
    {
        "John Calvin": "John Calvin"
    },
    {
        " maintained there was no human element in the Person of Christ which could be separated from the Person of ": null
    },
    {
        "The Word": "Logos"
    },
    {
        ". Calvins Christology by Stephen Edmondson 2004  p. 217 Calvin also emphasized the importance of the Work of Christ in any attempt at understanding the Person of Christ and cautioned against ignoring the Works of Jesus during his ministry. Calvins First Catechism by I. John Hesselink 1997  p. 217              The 19th century saw the rise of Liberal Protestant theology, which questioned the dogmatic foundations of Christianity, and approached the Bible with critical-historical tools. Jaroslav Jan Pelikan,  The divinity of Jesus was problematized, and replaced with an emphasis on the ethical aspects of his teachings.       ": null
    },
    {
        "Catholic": "Catholic"
    },
    {
        " theologian": "Theologian"
    },
    {
        " Karl Rahner": "Karl Rahner"
    },
    {
        " sees the purpose of modern Christology as to formulate the Christian belief that God became man and that God-made-man is the individual Jesus Christ in a manner that this statement can be understood consistently, without the confusions of past debates and mythologies. Rahner pointed out the coincidence between the Person of Christ and the Word of God, referring to ": null
    },
    {
        "Mark 8:38": "Wikisource:Bible /Mark8:38"
    },
    {
        " and ": null
    },
    {
        "Luke 9:26": "Wikisource:Bible /Luke9:26"
    },
    {
        " which state whoever is ashamed of the words of Jesus is ashamed of the Lord himself. Encyclopedia of theology: a concise Sacramentum mundi by Karl Rahner 2004  p. 1822     ": null
    },
    {
        "Hans von Balthasar": "Hans Urs Von Balthasar"
    },
    {
        " argued the union of the human and divine natures of Christ was achieved not by the absorption of human attributes, but by their assumption . Thus, in his view, the divine nature of Christ was not affected by the human attributes and remained forever divine. The eschatology of Hans Urs von Balthasar by Nicholas J. Healy 2005  pp. 22–23                The ": null
    },
    {
        "Nativity of Jesus": "Nativity Of Jesus"
    },
    {
        " impacted the Christological issues about his Person from the earliest days of Christianity. Lukes Christology centers on the dialectics of the dual natures of the earthly and heavenly manifestations of existence of the Christ, while Matthews Christology focuses on the mission of Jesus and his role as the savior. Theology of the New Testament by Georg Strecker 2000  pp. 401–03 Matthew by ": null
    },
    {
        "Grant R. Osborne": "Grant R. Osborne"
    },
    {
        " 2010  lxxix The ": null
    },
    {
        "salvific": "Christian Soteriology"
    },
    {
        " emphasis of ": null
    },
    {
        "Matthew 1:21": "Wikisource:Bible /Matthew1:21"
    },
    {
        " later impacted the theological issues and the devotions to ": null
    },
    {
        "Holy Name of Jesus": "Holy Name Of Jesus"
    },
    {
        ". Matthew 1-13 by Manlio Simonetti 2001  p. 17 Matthew 1-2/ Luke 1-2 by Louise Perrotta 2004 p. 19 All the Doctrines of the Bible by Herbert Lockyer 1988 p. 159     Matthew 1:23 provides a key to the Emmanuel Christology of Matthew. Beginning with 1:23, Matthew shows a clear interest in identifying Jesus as God with us and in later developing the Emmanuel characterization of Jesus at key points throughout the rest of his Gospel. Matthews Emmanuel by David D. Kupp 1997 pp. 220–24 The name Emmanuel does not appear elsewhere in the New Testament, but Matthew builds on it in Matthew 28:20 to indicate Jesus will be with the faithful to the end of the age. Who do you say that I am?: essays on Christology by Jack Dean Kingsbury, Mark Allan Powell, David R. Bauer 1999 p. 17 According to Ulrich Luz , the Emmanuel motif brackets the entire Gospel of Matthew between 1:23 and 28:20, appearing explicitly and implicitly in several other passages. The theology of the Gospel of Matthew by Ulrich Luz 1995 p. 31         The accounts of the crucifixion and subsequent resurrection of Jesus provides a rich background for Christological analysis, from the canonical Gospels to the Pauline Epistles . Who do you say that I am? Essays on Christology by Jack Dean Kingsbury, Mark Allan Powell, David R. Bauer 1999 p. 106     A central element in the Christology presented in the Acts of the Apostles is the affirmation of the belief that the death of Jesus by crucifixion happened with the foreknowledge of God, according to a definite plan . New Testament christology by Frank J. Matera 1999 p. 67 In this view, as in Acts 2:23 , the cross is not viewed as a scandal, for the crucifixion of Jesus at the hands of the lawless is viewed as the fulfilment of the plan of God. The speeches in Acts: their content, context, and concerns by Marion L. Soards 1994 p. 34     Pauls Christology has a specific focus on the death and resurrection of Jesus. For Paul, the crucifixion of Jesus is directly related to his resurrection and the term the cross of Christ used in Galatians 6:12 may be viewed as his abbreviation of the message of the gospels. Christology by Hans Schwarz 1998 pp 132–34 For Paul, the crucifixion of Jesus was not an isolated event in history, but a cosmic event with significant eschatological consequences, as in Cor 2:8. In the Pauline view, Jesus, obedient to the point of death , died at the right time based on the plan of God. For Paul, the power of the cross is not separable from the resurrection of Jesus.           The threefold office  of Jesus Christ is a Christian doctrine based upon the teachings of the Old Testament. It was described by Eusebius and more fully developed by John Calvin . It states that Jesus Christ performed three functions in his earthly ministry  – those of prophet , priest , and king . In the Old Testament, the appointment of someone to any of these three positions could be indicated by anointing him or her by pouring oil over the head. Thus, the term messiah, meaning anointed one , is associated with the concept of the threefold office. While the office of king is that most frequently associated with the Messiah, the role of Jesus as priest is also prominent in the New Testament, being most fully explained in chapters 7 to 10 of the Book of Hebrews .         Some Christians, notably Roman Catholics , view Mariology as a key component of Christology. Mariology Is Christology , in Vittorio Messori , The Mary Hypothesis, Rome: 2005. In this view, not only is Mariology a logical and necessary consequence of Christology, but without it, Christology is incomplete, since the figure of Mary contributes to a fuller understanding of who Christ is and what he did. Paul Haffner, 2004 The mystery of Mary Gracewing Press p. 17     Protestants have criticized Mariology because many of its assertions lack any biblical foundation. Walter A. Elwell, Evangelical Dictionary of Theology, Second Edition , 736. Strong Protestant reaction against Roman Catholic Marian devotion and teaching has been a significant issue for ecumenical dialogue. Erwin Fahlbusch et al., “Mariology,” The Encyclopedia of Christianity , 409.     Joseph Cardinal Ratzinger expressed this sentiment about Roman Catholic Mariology when in two separate occasions he stated, The appearance of a truly Marian awareness serves as the touchstone indicating whether or not the Christological substance is fully present Communio , 1996, Volume 23, p. 175 and It is necessary to go back to Mary, if we want to return to the truth about Jesus Christ. Raymond Burke, 2008 Mariology: A Guide for Priests, Deacons, seminarians, and Consecrated Persons": null
    }
]