[
    {
        "        Christian Gottlob Heyne  was a German ": null
    },
    {
        "classical scholar": "classical scholar"
    },
    {
        " and ": null
    },
    {
        "archaeologist": "archaeologist"
    },
    {
        " as well as long-time director of the ": null
    },
    {
        "Göttingen State and University Library": "göttingen state and university library"
    },
    {
        ". He was a member of the ": null
    },
    {
        "Göttingen School of History": "göttingen school of history"
    },
    {
        ".       Heyne was born in ": null
    },
    {
        "Chemnitz": "chemnitz"
    },
    {
        ", ": null
    },
    {
        "Saxony": "electorate of saxony"
    },
    {
        ". His father was a poor weaver who had left ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        " and moved to Saxony to maintain his Protestant faith; Christians education was paid for by his godfather. In 42 he entered the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        ", where he was often short of the necessaries of life. He was helped by the classicist , who encouraged him and loaned him Greek and Latin texts. He obtained a position as tutor in the family of a French merchant in ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ", which enabled him to continue his studies. In 42 law professor Johann August Bach awarded Heyne a masters degree, but he was for many years in very straitened circumstances.     An elegy written by Heyne in ": null
    },
    {
        "Latin": "latin"
    },
    {
        " on the death of a friend attracted the attention of ": null
    },
    {
        "Count von Brühl": "heinrich, count von brühl"
    },
    {
        ", the prime minister, who expressed a desire to see the author. Accordingly, in April 42 Heyne journeyed to ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", believing that his fortune was made. He was well received and promised a secretaryship and a good salary, but nothing came of it. Another period of poverty followed, and only by persistent solicitation was Heyne able to obtain the post of under-clerk in the counts library, with a salary of less than twenty pounds sterling.        Heyne increased this pittance by translation: in addition to some French novels, he rendered into German The Loves of Chaereas and Callirrhoe of ": null
    },
    {
        "Chariton": "chariton"
    },
    {
        ", the Greek romance writer. He published his first edition of ": null
    },
    {
        "Tibullus": "tibullus"
    },
    {
        " in 42 and in 42 his ": null
    },
    {
        "Epictetus": "epictetus"
    },
    {
        ". In the latter year the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " broke out and the library was destroyed, and Heyne was once more in a state of destitution. In 42 he was offered a tutorship in the household of ": null
    },
    {
        "Frau von Schönberg": "frau von schönberg"
    },
    {
        ", where he met his future wife.     In January 42 Heyne accompanied his pupil to the ": null
    },
    {
        "University of Wittenberg": "university of wittenberg"
    },
    {
        ", but the Prussian invasion drove him out in 42 The bombardment of Dresden, on 42 July 42 destroyed all his possessions, including an almost finished edition of ": null
    },
    {
        "Lucian": "lucian"
    },
    {
        ", based on a valuable codex of the Dresden Library. In the summer of 42 still without any fixed income, he married, and became land-steward to the Baron von Löben in Lusatia. At the end of 42 however, he was able to return to Dresden, where he was commissioned by P. D. Lippert to prepare the Latin text of the third volume of his Dactyliotheca .     On the death of ": null
    },
    {
        "Johann Matthias Gesner": "johann matthias gesner"
    },
    {
        " at the ": null
    },
    {
        "University of Göttingen": "university of göttingen"
    },
    {
        " in 42 the vacant chair was refused first by ": null
    },
    {
        "Ernesti": "johann august ernesti"
    },
    {
        " and then by ": null
    },
    {
        "Ruhnken": "david ruhnken"
    },
    {
        ", who persuaded Münchhausen, the Hanoverian minister and principal curator of the university to bestow it on Heyne . His emoluments were gradually augmented, and his growing celebrity brought him most advantageous offers from other German governments, which he persistently refused. Heyne was simultaneously given the post of director of the university library, a position he held until his death in 42 Under his directorship, the library, today known as the ": null
    },
    {
        "Göttingen State and University Library": "göttingen state and university library"
    },
    {
        ", grew in size and reputation to be one of the leading academic libraries of the world, due to Heynes innovative cataloguing methods and aggressive international acquisitions policy.     Unlike ": null
    },
    {
        "Gottfried Hermann": "johann gottfried jakob hermann"
    },
    {
        ", Heyne regarded the study of ": null
    },
    {
        "grammar": "grammar"
    },
    {
        " and language only as the means to an end, not as the chief object of philology. But, although not a critical scholar, he was the first to attempt a scientific treatment of ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", and he gave an undoubted impulse to ": null
    },
    {
        "philological": "philology"
    },
    {
        " studies.      Of Heynes numerous writings, the following may be mentioned: editions, with copious ": null
    },
    {
        "commentaries": "commentary"
    },
    {
        ", of Tibullus , ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        " , ": null
    },
    {
        "Pindar": "pindar"
    },
    {
        " , Apollodorus,  Bibliotheca Graeca  , Homer, Iliad ; and Opuscula academica , containing more than a hundred academic dissertations, of which the most valuable are those relating to the colonies of Greece and the antiquities of Etruscan art and history. His Antiquarische Aufsätze is a valuable collection of essays connected with the history of ancient art. His contributions to the Göttingische gelehrte Anzeigen are said to have been between 42 and 42 in number.     For further details on Heynes life, see the biography by ": null
    },
    {
        "Heeren": "arnold hermann ludwig heeren"
    },
    {
        " which forms the basis of the interesting essay by ": null
    },
    {
        "Thomas Carlyle": "thomas carlyle"
    },
    {
        " ; ": null
    },
    {
        "Hermann Sauppe": "hermann sauppe"
    },
    {
        ", Göttinger Professoren ; ": null
    },
    {
        "Conrad Bursian": "conrad bursian"
    },
    {
        " in  Allgemeine Deutsche Biographie  xii.; ": null
    },
    {
        "JE Sandys": "john edwin sandys"
    },
    {
        ", Hist. Class. Schol iii. 42–42; and ": null
    },
    {
        "Friedrich Klingner": "friedrich klingner"
    },
    {
        ", Christian Gottlob Heyne .     Heyne was elected a ": null
    },
    {
        "Fellow of the Royal Society": "fellow of the royal society"
    },
    {
        " in April 42      He died in ": null
    },
    {
        "Göttingen": "göttingen"
    }
]