[
    {
        "          The Church of St Mary in Palmis , better known as Chiesa del Domine Quo Vadis, is a small ": null
    },
    {
        "church": "church"
    },
    {
        " southeast of ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", central ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". It is located about some 42  m from ": null
    },
    {
        "Porta San Sebastiano": "porta san sebastiano"
    },
    {
        ", where the ": null
    },
    {
        "Via Ardeatina": "via ardeatina"
    },
    {
        " branches off the ": null
    },
    {
        "Appian Way": "appian way"
    },
    {
        ", on the site where, according to the ": null
    },
    {
        "apocryphal": "new testament apocrypha"
    },
    {
        "  Acts of Peter , ": null
    },
    {
        "Saint Peter": "saint peter"
    },
    {
        " met ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " while the former was fleeing persecution in Rome. According to the legend, Peter asked Jesus, Lord, where are you going? . Jesus answered, I am going to Rome to be crucified again .       There has been a sanctuary on the spot since the ninth century, but the current church is from 42 The current façade was added in the 42th century.     It has been supposed that the sanctuary might have been even more ancient, perhaps a Christian adaptation of some already existing ": null
    },
    {
        "temple": "temple"
    },
    {
        ": the church is in fact located just in front of the sacred campus dedicated to ": null
    },
    {
        "Rediculus": "rediculus"
    },
    {
        ", the Roman God of the Return . This campus hosted a sanctuary for the cult of the deity that received devotion by travellers before their departure, especially by those who were going to face long and dangerous journeys to far places like ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", ": null
    },
    {
        "Greece": "greece"
    },
    {
        " or the East. Those travellers who returned also stopped to thank the god for the happy outcome of their journey.     The presence of the Apostle Peter in this area, where he is supposed to have lived, appears to be confirmed in an ": null
    },
    {
        "epigraph": "epigraphy"
    },
    {
        " in the ": null
    },
    {
        "Catacombs of Saint Sebastian": "catacombs of romecatacombs of san sebastiano"
    },
    {
        " that reads Domus Petri . An ": null
    },
    {
        "epigram": "epigram"
    },
    {
        " by ": null
    },
    {
        "Pope Damasus I": "pope damasus i"
    },
    {
        " in honor of Peter and ": null
    },
    {
        "Paul": "paul of tarsus"
    },
    {
        " reads: You that are looking for the names of Peter and Paul, you must know that the saints have lived here.     The two footprints on a marble slab at the center of the church — nowadays a copy of the original, which is kept in the nearby ": null
    },
    {
        "Basilica of San Sebastiano fuori le mura": "san sebastiano fuori le mura"
    },
    {
        " — are popularly held to be a miraculous sign left by Jesus. It is to these footprints that the official name of the church alludes: palmis refers to the soles of Jesus feet. It is likely that these footprints are actually the draft of an ancient Roman ": null
    },
    {
        "ex voto": "ex voto"
    },
    {
        " , a tribute paid to the gods for the good outcome of a journey.     There was an inscription above the front door on the churchs façade which used to say: Stop your walking, traveller, and enter this sacred temple in which you will find the footprint of our Lord Jesus Christ when He met with St. Peter who escaped from the prison. An alms for the wax and the oil is recommended in order to free some spirits from ": null
    },
    {
        "Purgatory": "purgatory"
    },
    {
        ". ": null
    },
    {
        "Pope Gregory XVI": "pope gregory xvi"
    },
    {
        " found the advertising tone of this inscription so inappropriate that he ordered its removal in 42     There is also a modern column with a bust of ": null
    },
    {
        "Henryk Sienkiewicz": "henryk sienkiewicz"
    },
    {
        ", the Polish author of the famous historical fiction novel  Quo Vadis: A Narrative of the Time of Nero  . It is said that Sienkiewicz was inspired to write his novel while sitting in this church.     The church is currently administered by priests of the ": null
    },
    {
        "Congregation of Saint Michael the Archangel": "congregation of saint michael the archangel"
    }
]