[
    {
        "Châtelet  is a ": null
    },
    {
        "Walloon": "wallonia"
    },
    {
        " municipality": "municipalities in belgium"
    },
    {
        " located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province": "provinces of belgium"
    },
    {
        " of ": null
    },
    {
        "Hainaut": "hainaut"
    },
    {
        ", on the river ": null
    },
    {
        "Sambre": "sambre"
    },
    {
        ". As of January 42 42 Châtelet had a total population of 42. The total area of the municipality is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km². It is composed of three separate entities: Châtelet, Bouffioulx and Châtelineau. Châtelet was a long established independent city prior to its fusion with the other entities.           The first settlers of the site of Châtelet, dating from ": null
    },
    {
        "paleolithic": "paleolithic"
    },
    {
        " times, were attracted by the ford on the river, the nearby wooded areas and flint-rich highlands. This region was continuously populated, first by ": null
    },
    {
        "Celtic": "celts"
    },
    {
        ", then ": null
    },
    {
        "Gallo-Roman": "gallo-roman culture"
    },
    {
        " peoples, until the ": null
    },
    {
        "Germanic": "germanic peoples"
    },
    {
        " invasions of the 42th and 42th century. In the 42th century, the land was likely part of emperor ": null
    },
    {
        "Louis the Pious": "louis the pious"
    },
    {
        "’s estate. The first occurrence of the name Châtelet appears in a text dating from the time when its territory was given to the ": null
    },
    {
        "chapter": "chapter"
    },
    {
        " of the ": null
    },
    {
        "Liège": "liège"
    },
    {
        " cathedral in the 42th century. Châtelet obtained its charter of rights in 42 symbolized by the perron. The protection later afforded by the ": null
    },
    {
        "Prince-Bishopric of Liège": "prince-bishopric of liège"
    },
    {
        " made the city into an important administrative, cultural, and economic centre, which could boast four annual trade fairs and a weekly cattle market. It became one of the 42 bonne villes of the prince-bishopric in 42 While Châtelet’s economy was dominated by artisanal guilds and trade, that of its neighbours, including Châtelineau and Bouffioulx, remained mostly agricultural.       The 42th century first witnessed the gradual shift of the regional economic power from Châtelet to the newly founded neighbouring city of ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        ". This was also a time of political instability as the various powers of the day fought for supremacy in this region. By the end of the century, the main economic drivers of the whole ": null
    },
    {
        "Sambre": "sambre"
    },
    {
        " valley had become coal and heavy industry. The prosperity that came with the industrial revolution accounts for much of the population growth of the 42s: Châtelet grew by a factor 42 in less than a century; Châtelineau grew by a factor 42 between 42 and 42 to more than 42 inhabitants. Many of the current city streets can be dated from that period. Cultural activities and artistic talent flourished as well.     Chatelet, and, in particular, Bouffioux, became well known for the production of its potteries. Originally formed in coal-fired kilns, the works from the region became internationally sought after. Three major producers still exist in the region and continue to produce artistic, as well as useful, pottery, but on a much smaller scale. The 42th century was not kind to the region but despite having witnessed two world wars and the decline of most of its industries, Châtelet is now again a regional center for trade, culture, and educational services.       The Saint ": null
    },
    {
        "Roch": "roch"
    },
    {
        " chapel, built in the ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " style, dates from 42 The so-called Spanish House dates from the same period.   The ": null
    },
    {
        "Magritte": "rené magritte"
    },
    {
        " walk in the center of the city features various ": null
    },
    {
        "surrealistic": "surrealism"
    },
    {
        " representations, including street lights capped with bowler hats in homage to the artist.   Châtelet also boasts several green areas, including the Sebastopol reservation, which contains old quarries and an extensive bird population, the municipal woods , with a bat-filled cave, and the municipal park, located at the heart of the city.       Since 42 a folkloric march starting at the Saint-Roch chapel takes place every year on the Sunday following the feast of the ": null
    },
    {
        "Ascension": "ascension of jesus christ"
    },
    {
        ".       ": null
    },
    {
        "René Magritte": "rené magritte"
    },
    {
        " , ": null
    },
    {
        "surrealist": "surrealism"
    },
    {
        " painter": "painting"
    },
    {
        " , spent his youth in Châtelet   ": null
    },
    {
        "Pierre Paulus": "pierre paulus"
    },
    {
        " , ": null
    },
    {
        "expressionist": "expressionism"
    },
    {
        " painter and ": null
    },
    {
        "designer": "designer"
    },
    {
        " of the rooster of the ": null
    },
    {
        "Walloon flag": "flag of wallonia"
    },
    {
        ", was born in Châtelet   ": null
    },
    {
        "Octave Pirmez": "octave pirmez"
    },
    {
        " , ": null
    },
    {
        "author": "author"
    },
    {
        ", was born in Châtelineau   ": null
    },
    {
        "Joel Robert": "joel robert"
    },
    {
        ", six-time motocross world champion   ": null
    },
    {
        "Claude Barzotti": "claude barzotti"
    },
    {
        ", Belgian singer of Italian origin   ": null
    },
    {
        "Claire Kerwin": "claire kerwin"
    },
    {
        " , artist who was born in Châtelet       : ": null
    },
    {
        "Vimoutiers": "vimoutiers"
    }
]