[
    {
        "   The  Château dOiron is located in ": null
    },
    {
        "Oiron": "oiron"
    },
    {
        ", in the ": null
    },
    {
        "Deux-Sèvres": "deux-sèvres"
    },
    {
        "  département  of western ": null
    },
    {
        "France": "france"
    },
    {
        ". It has its origins in the 42th century war with the English for control of France when a victorious ": null
    },
    {
        "Charles VII of France": "charles vii of france"
    },
    {
        " gave the domain and great forest of Oiron to ": null
    },
    {
        "Guillaume Gouffier": "guillaume gouffier, seigneur de bonnivet"
    },
    {
        " who became governor of ": null
    },
    {
        "Touraine": "touraine"
    },
    {
        ". This château is the background for ": null
    },
    {
        "Charles Perrault": "charles perrault"
    },
    {
        "s fairy tale,  Puss in Boots . ": null
    },
    {
        "King Louis XIV": "louis xiv of france"
    },
    {
        "s mistress, ": null
    },
    {
        "Madame de Montespan": "madame de montespan"
    },
    {
        " was one of the residents in the place.       Today, Oiron is only a short drive from the royal châteaux in the ": null
    },
    {
        "Val de Loire": "loire valley"
    },
    {
        ", but in the 42th century it was considered far removed from the seat of power at the royal domains. Nonetheless, Guillaume Gouffier built a magnificent château and his offspring updated and improved it. In 42 his daughter-in-law, ": null
    },
    {
        "Helene de Hengest": "helene de hengest"
    },
    {
        ", was responsible for the construction of a collegiate church adjacent to the château. In 42 ": null
    },
    {
        "Henry II": "henry ii of france"
    },
    {
        " and his entire court were guests of ": null
    },
    {
        "Claude Gouffier": "claude gouffier"
    },
    {
        " who had been granted the title Marquis de Caravaz. ": null
    },
    {
        "Claude Gouffier": "claude gouffier"
    },
    {
        " served as the model for Charles Perraults Marquis de Carabas in his story, Puss in Boots.     Two generations later, another Gouffier was exiled from the kings court by ": null
    },
    {
        "Cardinal Richelieu": "cardinal richelieu"
    },
    {
        " in 42 In the mid 42th century, Charlotte Gouffier became enamored with the renowned intellect, ": null
    },
    {
        "Blaise Pascal": "blaise pascal"
    },
    {
        " , who spent considerable time at the Château dOiron. After Pascal died, Charlotte Gouffier married ": null
    },
    {
        "Francois dAubusson, the duc de La Feuillade": "françois daubusson de la feuillade"
    },
    {
        ", who enhanced the castle with his wealth and connections to ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        ". With the renovations, the castle ended up with a main building and two long projecting wings, one of which is a ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " structure built over a cloister. One of the galleries contains one of the most prestigious works of art from the French Renaissance period.      The Duc de La Feuillades son sold the château to ": null
    },
    {
        "Louis XIVs": "louis xiv of france"
    },
    {
        " mistress, ": null
    },
    {
        "Madame de Montespan": "madame de montespan"
    },
    {
        " who lived there for the rest of her life. Her son had little interest in the property as he preferred to be much closer to the royal court so in 42 he sold the château to the ": null
    },
    {
        "Duc de Villeroi": "villeroi"
    },
    {
        ". After that, the château went into severe decline and in 42 was ransacked by ": null
    },
    {
        "Revolutionaries": "french revolution"
    },
    {
        ". For many years the château lay abandoned until the government of France took possession just before ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " eventually converting it to a museum.     Recognized worldwide, the museum is dedicated to contemporary art. In 42 The Year of Solar Burns was commissioned by the ": null
    },
    {
        "French Ministry of Culture": "french ministry of culture"
    },
    {
        " for permanent installation in the Château dOiron. The château has been listed as a  monument historique ": null
    }
]