[
    {
        "     Cicely Mary Barker was an English illustrator best known for a series of fantasy illustrations depicting fairies and flowers. Barkers art education began in girlhood with correspondence courses and instruction at the ": null
    },
    {
        "Croydon School of Art": "croydon collegehistory"
    },
    {
        ". Her earliest professional work included greeting cards and juvenile magazine illustrations, and her first book, Flower Fairies of the Spring, was published in 42 Similar books were published in the following decades.     Barker was a devout ": null
    },
    {
        "Anglican": "anglicanism"
    },
    {
        ", and donated her artworks to Christian fundraisers and missionary organizations. She produced a few Christian-themed books such as The Children’s Book of Hymns and, in collaboration with her sister Dorothy, He Leadeth Me. She designed a stained glass window for St. Edmunds Church, Pitlake, and her painting of the Christ Child, The Darling of the World Has Come, was purchased by ": null
    },
    {
        "Queen Mary": "mary of teck"
    },
    {
        ".     Barker was equally proficient in watercolour, pen and ink, oils, and pastels. ": null
    },
    {
        "Kate Greenaway": "kate greenaway"
    },
    {
        " and the ": null
    },
    {
        "Pre-Raphaelites": "pre-raphaelites"
    },
    {
        " were the principal influences on her work. She claimed to paint instinctively and rejected artistic theories. Barker died in 42 Though she published Flower Fairy books with spring, summer, and autumn themes, it wasnt until 42 that a winter collection was assembled from her remaining work and published posthumously.           Barker was born the second daughter and youngest child of Walter Barker, a partner in a seed supply company and an amateur artist, and his wife Mary Eleanor Barker on 42 June 42 at home at 42 Waddon Road in ": null
    },
    {
        "Croydon": "croydon"
    },
    {
        ", ": null
    },
    {
        "Surrey, England": "surrey, england"
    },
    {
        ". Barker was an ": null
    },
    {
        "epileptic": "epilepsy"
    },
    {
        " as a child, and cared for at home by her parents. Later, her sister and elder by two years, Dorothy Oswald Barker, continued the care. Her middle class family of four was moderately prosperous. A ": null
    },
    {
        "nanny": "nanny"
    },
    {
        ", a ": null
    },
    {
        "governess": "governess"
    },
    {
        ", and a cook to prepare special meals for Barker were hired. She spent much time in bed at home amusing herself with painting books and a nursery library that included the works of ": null
    },
    {
        "Kate Greenaway": "kate greenaway"
    },
    {
        " and ": null
    },
    {
        "Randolph Caldecott": "randolph caldecott"
    },
    {
        "  – two artists who exerted strong influences on her later art.       Barker took correspondence courses in art, probably until about 42 In 42 at 42 years, she entered an evening class at the Croydon School of Art, and attended the school into the 42s. In time, she received a teaching position.     In 42 ": null
    },
    {
        "Raphael Tuck & Sons": "raphael tuck  &  sons"
    },
    {
        " bought four of Barkers little drawings for half a sovereign, and published them as postcards. In October 42 she won second prize in the Croydon Art Societys poster competition, and shortly afterward was elected the youngest member of the Society. The art critic for the Croydon Advertiser remarked, Her drawings show a remarkable freedom of spirit. She has distinct promise.      Following her fathers death in June 42 the seventeen-year-old Barker submitted art and poetry to  My Magazine , Child’s Own, Leading Strings, and Raphael Tuck annuals in an effort to support both her mother and sister. Her sister Dorothy taught kindergarten in two private schools before opening a kindergarten at home. She brought in some money for the familys support while supervising the household.     Flower Fairies of the Spring, 42 The Coming of the Fairies by Sir ": null
    },
    {
        "Arthur Conan Doyle": "arthur conan doyle"
    },
    {
        ",  Peter Pan  by ": null
    },
    {
        "J.M. Barrie": "j.m. barrie"
    },
    {
        ", and the fairy-themed work of Australian ": null
    },
    {
        "Ida Rentoul Outhwaite": "ida rentoul outhwaite"
    },
    {
        ". ": null
    },
    {
        "Queen Mary": "mary of teck"
    },
    {
        " made such themes even more popular by sending Outhwaite postcards to friends during the 42s. In 42 Barker produced a postcard series depicting elves and fairies.     In 42 Barker sent her flower fairy paintings to various publishers. Blackie paid ": null
    },
    {
        "£": "£"
    },
    {
        "42 for 42 paintings with accompanying verses, but it wasnt until publication of Flower Fairies of the Summer in 42 that Barker received royalties for her work. Mary Violet Clayton Calthrop, wife of author Dion Clayton Calthrop, wrote in April 42 about Barker and Flower Fairies of the Spring: She has such exquisite taste, besides draughtsmanship.        In 42 the family moved into a four-level, semi-detached Victorian house at 42 The Waldrons. Barker had a studio built in the garden and her sister conducted a kindergarten in a room at the back of the house. The family lived frugally and attended both St. Edmunds and St. Andrews in Croydon – low churches for the less privileged. Barker sometimes incorporated portraits of her fellow parishioners in her religious works. She was described by Canon Ingram Hill as one of the pillars of St. Andrews.     The children in the kindergarten modelled for the Flower Fairies until the kindergarten closed in 42 In an interview in 42 Barker said, My sister ran a kindergarten and I used to borrow her students for models. For many years I had an atmosphere of children about me – I never forgot it.  She also painted the children of relatives as well as Gladys Tidy, the Barkers young housekeeper, who posed for the Primrose Fairy in 42 The plants were painted from life, and if a specimen was not readily at hand, ": null
    },
    {
        "Kew Gardens": "kew gardens"
    },
    {
        " staff would provide her the specimens needed. Barker designed and built the Flower Fairy costumes, and based each on the flowers and leaves of the particular plant to be illustrated. The costumes were kept in a trunk in her studio along with wings made of twigs and gauze. Each was broken down after an illustration was completed and the parts recycled for other costumes. She often referred to Dion Clayton Calthrops English Costume.       In the late 42s, Barker began to doubt she was doing enough for the church and considered focusing solely on sacred works. Family and friends recommended she continue secular and sacred works, which she did.     Barker continued to attend evening classes at the Croydon Art School between the 42s and the 42s, eventually receiving a teaching position. She took sketching trips to ": null
    },
    {
        "Amberley": "amberley, west sussex"
    },
    {
        " and Storrington in Sussex and to ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        " and the southern coast with family and friends. She visited and stayed with artist Margaret Tarrant in ": null
    },
    {
        "Gomshall": "gomshall"
    },
    {
        ", Surrey and with family in Ugglebarnby, Near Whitby, North Yorkshire.     In 42 the Barkers live-in maid retired, and Dorothy Barker closed her school at the back of the house in The Waldrons. She continued to supervise the household, and to give both her mother and sister the care they needed. Dorothy and her sister collaborated upon only two books: Our Darlings First Book and the Christian-themed, He Leadeth Me. In 42 Dorothy Barker died of a heart attack. Barker was unable to pursue her art to any significant extent following her sisters death, as all the care of her aged mother devolved upon her, but she did manage to begin planning a stained glass window design in her sisters memory for St. Edmunds, Pitlake.            Barkers mother died in 42 and, in 42 Barker moved from 42 The Waldrons to 42 Duppas Avenue in Croydon. She restored a  maisonette  in ": null
    },
    {
        "Storrington": "storrington"
    },
    {
        ", Sussex, England, bequeathed by her friend Edith Major, and named it St. Andrews. After taking up residence, her health began to deteriorate. She was in and out of nursing and convalescent homes, and tended by relatives and friends.     Barker died at ": null
    },
    {
        "Worthing Hospital": "worthing hospital"
    },
    {
        " on 42 February 42 aged 42 years. Two funeral services were held – one in Storrington Church and one in Barkers maisonette. Her ashes were scattered in Storrington churchyard. In 42 ": null
    },
    {
        "Frederick Warne": "frederick warne  &  co"
    },
    {
        ", a division of ": null
    },
    {
        "Penguin Books": "penguin books"
    },
    {
        " since 42 acquired the Flower Fairies properties.       Barker worked principally in watercolor with pen-and-ink, but she was equally competent in black-and-white, in oils, and in pastels. She carried a sketchbook with her for capturing interesting children. She once indicated, I have always tried to paint instinctively in a way that comes naturally to me, without any real thought or attention to artistic theories.      ": null
    },
    {
        "Kate Greenaway": "kate greenaway"
    },
    {
        " was a childhood favorite and an influence on her art. Barkers child subjects wear nostalgic clothing as Greenaways children do, though Barkers children are less melancholy and less flat in appearance, due perhaps to advances in printing technology. Barker studied flowers with an analytical eye and was friend to childrens illustrator, Margaret Tarrant. Along with Greenaway, illustrator ": null
    },
    {
        "Alice B. Woodward": "alice b. woodward"
    },
    {
        " also influenced Barkers work.      The ": null
    },
    {
        "Pre-Raphaelites": "pre-raphaelite brotherhood"
    },
    {
        " were a strong, lifelong influence on Barker. She once indicated, I am to some extent influenced by them—not in any technical sense, but in the choice of subject matter and the feeling and atmosphere they could achieve. She admitted a fondness for the early paintings of ": null
    },
    {
        "John Everett Millais": "john everett millais"
    },
    {
        " and the wonderful things of ": null
    },
    {
        "Edward Burne-Jones": "edward burne-jones"
    },
    {
        ".       Barkers sketches, drawings, and paintings of children were given to friends or to the parents of the subjects, donated to charitable institutions and church sponsored events, or exhibited through various art organizations. She illustrated magazine covers, dust jackets, and produced series of postcards for Raphael Tuck and other publishers such as Picturesque Children of the Allies , Seaside Holidays , and Shakespeares Boy and Girl Characters . Her own Old Rhymes for All Times and The Lord of the Rushie River , a tale about a girl who lives among swans on a riverbank, were critically well received. Set about 42 Groundsel and Necklaces tells of a girl named Jenny who rescues her family from poverty through the agency of the fairies. The story features an old Scrooge-like man called Mr. Petercoo and tonally suggests a ": null
    },
    {
        "Dickensian": "charles dickens"
    },
    {
        " social consciousness. Simon the Swan, intended as a sequel to Rushie River was outlined in 42 with Groundsel, but only developed in 42 It was published posthumously in 42 and is critically considered less successful than Groundsel.       Barker was a devout ": null
    },
    {
        "Christian": "christianity"
    },
    {
        ", and produced religious-themed works throughout her life. She published eight postcards and five guardian angel birthday cards for the ": null
    },
    {
        "Society for Promoting Christian Knowledge": "society for promoting christian knowledge"
    },
    {
        " in 42 and in 42 respectively. Christmas cards were designed for ": null
    },
    {
        "The Girls Friendly Society": "the girls friendly society"
    },
    {
        " over a 42-year period, and the first three designs sold out a combined printing of 42 in 42 An original design for the society called The Darling of the World Has Come was purchased by ": null
    },
    {
        "Queen Mary": "mary of teck"
    },
    {
        " for ₤42.42 in 42 The Croydon Art Society hung Barkers booklet cover design for the ": null
    },
    {
        "Society for the Propagation of the Gospel": "society for the propagation of the gospel"
    },
    {
        " in its November 42 exhibition.     Religious-themed books include The Childrens Book of Hymns and He Leadeth Me , the latter written in collaboration with her sister. Major religious works include the ": null
    },
    {
        "triptych": "triptych"
    },
    {
        "s in oil, The Feeding of the Five Thousand , for the chapel in Llandaff House, a home for destitute women at ": null
    },
    {
        "Penarth": "penarth"
    },
    {
        ", ": null
    },
    {
        "Wales": "wales"
    },
    {
        ", and The Parable of the Great Supper for St. Georges Chapel, ": null
    },
    {
        "Waddon": "waddon"
    },
    {
        ". The Feeding has since disappeared, and only a black-and-white photograph dated 42 reproduces the work. In 42 she completed oil panels on the subject of the seven ": null
    },
    {
        "sacraments": "sacraments"
    },
    {
        " for the ": null
    },
    {
        "baptismal font": "baptismal font"
    },
    {
        " at St. Andrews, South Croydon. She designed baptismal rolls for the wall behind the font in 42 and 42 In 42 she completed the  oil painting, Out of Great Tribulation, for the Memorial Chapel of Norbury Methodist Church. Following the death of her sister in 42 Barker began designs for a stained glass memorial window depicting Christ preparing to wash the feet of his disciples. Her last religious-themed work, it was installed in St. Edmunds, Pitlake, in 42 Picturesque Children of the Allies; J. Salmon, 42   National Mission; Society for the Preservation of Christian Knowledge, 42   Shakespeares Boy Characters; C. W. Faulkner, 42   Shakespeares Girl Characters; C. W. Faulkner, 42   Seaside Holiday; J. Salmon, 42 42   Elves and Fairies; S. Harvey, 42   Guardian Angel; Society for the Preservation of Christian Knowledge, 42   Christmas cards; Girls Friendly Society, 42s, 42s   Christmas cards ; Barton-Colton, 42s, 42s   Beautiful Bible Pictures; Blackie, 42       Flower Fairies of the Spring; Blackie, 42   Spring Songs with Music; Blackie, 42   Flower Fairies of the Summer; Blackie, 42   Child Thoughts in Picture and Verse ; Blackie, 42   Flower Fairies of the Autumn; Blackie, 42   Summer Songs with Music; Blackie, 42   The Book of the Flower Fairies; Blackie, 42   Autumn Songs with Music; Blackie, 42   Old Rhymes for All Times; Blackie, 42   The Children’s Book of Hymns; Blackie, 42; rep. 42   Our Darling’s First Book ; Blackie, 42   Flower Fairies of the Seasons; Blackie, 42   The Little Picture Hymn Book; Blackie, 42   Rhymes New and Old; Blackie, 42   A Flower Fairy Alphabet; Blackie, 42   A Little Book of Old Rhymes; Blackie, 42   He Leadeth Me ; Blackie, 42   A Little Book of Rhymes New and Old; Blackie, 42   The Lord of the Rushie River; Blackie, 42   Flower Fairies of the Trees; Blackie, 42   When Spring Came In at the Window; Blackie, 42   A Child’s Garden of Verses ; Blackie, 42   Flower Fairies of the Garden; Blackie, 42   Groundsel and Necklaces; Blackie, 42; reprinted as Fairy Necklaces Flower Fairies of the Wayside; Blackie, 42   Flower Fairies of the Flowers and Trees; Blackie, 42   Lively Stories; Macmillan, 42   The Flower Fairy Picture Book; Blackie, 42   Lively Numbers; Macmillan, 42   Lively Words; Macmillan, 42   The Sand, the Sea and the Sun; Gibson, 42       Flower Fairies of the Winter; Blackie, 42   Simon the Swan; Blackie, 42   A Little Book of Prayers and Hymns; Frederick Warne, 42   A Flower Fairies Treasury; Frederick Warne, 42   Fairyopolis; Frederick Warne, 42   Wild Cherry Makes A Wish; Frederick Warne, 42   How to find Flower Fairies; Frederick Warne, 42   Return to Fairyopolis; Frederick Warne, 42       A New Epiphany; Society for the Preservation of Christian Knowledge, 42   42 Annuals; Blackie, 42s, 42s       St. Cecilys Garden; 42   Cradle roll design; St. Edmunds, Pitlake, 42   Banner design; St. Marys, Sanderstead, 42   The Feeding of the Five Thousand; ": null
    },
    {
        "reredos": "reredos"
    },
    {
        " triptych, chapel at Penarth, Wales; 42   The Parable of the Great Supper; triptych, St. Georges chapel, Waddon   The Seven Sacraments; baptismal font panels, St. Andrews, Croydon   St. John the Baptist; central banner panel, Abesford church, 42   Lettering, sword, and shield; mount for a list of men and woman serving in the Forces, St. Andrews, Croydon, 42   Baptismal rolls; St. Andrews, Croydon, 42 42   The font in St Andrews Church, South Croydon   Out of Great Tribulation; memorial chapel, Norbury Methodist church, 42   I Am Among You As He That Serveth": null
    }
]