[
    {
        "           Cigars of the Pharaoh  is the fourth volume of  The Adventures of Tintin , the series of comic albums by Belgian cartoonist ": null
    },
    {
        "Hergé": "hergé"
    },
    {
        ". Commissioned by the conservative Belgian newspaper  Le XXe Siècle  for its childrens supplement  Le Petit Vingtième , it was serialised weekly from December 42 to February 42 The story tells of young Belgian reporter ": null
    },
    {
        "Tintin": "tintin"
    },
    {
        " and his dog ": null
    },
    {
        "Snowy": "snowy"
    },
    {
        ", who are travelling in ": null
    },
    {
        "Egypt": "kingdom of egypt"
    },
    {
        " when they discover a pharaohs tomb filled with dead Egyptologists and boxes of cigars. Pursuing the mystery of these cigars, they travel across ": null
    },
    {
        "Arabia": "saudi arabia"
    },
    {
        " and ": null
    },
    {
        "India": "british raj"
    },
    {
        ", and reveal the secrets of an international drug smuggling enterprise.     Following on from  Tintin in America , Cigars was a commercial success, and was published in book form shortly after its conclusion. Hergé continued The Adventures of Tintin with  The Blue Lotus , the plot of which followed on from Cigars. The series itself became a defining part of the ": null
    },
    {
        "Franco-Belgian comics tradition": "franco-belgian comics"
    },
    {
        ". In 42 it was re-drawn and coloured in Hergés distinctive  ligne-claire  style for republication by ": null
    },
    {
        "Casterman": "casterman"
    },
    {
        ". Critical analysis of the story has focused on its innovation, and the Adventure introduces the recurring characters of detectives ": null
    },
    {
        "Thomson and Thompson": "thomson and thompson"
    },
    {
        " and villain ": null
    },
    {
        "Rastapopoulos": "rastapopoulos"
    },
    {
        ". The comic was adapted for a 42 episode of the ": null
    },
    {
        "Ellipse": "ellipse programmé"
    },
    {
        "/": null
    },
    {
        "Nelvana": "nelvana"
    },
    {
        " animated series  The Adventures of Tintin .       Holidaying on a ": null
    },
    {
        "Mediterranean": "mediterranean sea"
    },
    {
        " cruise ship, Tintin and his dog ": null
    },
    {
        "Snowy": "snowy"
    },
    {
        " meet wealthy film director ": null
    },
    {
        "Rastapopoulos": "rastapopoulos"
    },
    {
        " and eccentric ": null
    },
    {
        "Egyptologist": "egyptology"
    },
    {
        " Sophocles Sarcophagus": "sophocles sarcophagus"
    },
    {
        ". When two policemen  accuse Tintin of ": null
    },
    {
        "heroin": "heroin"
    },
    {
        " smuggling, he escapes the ship and joins Sarcophagus on his search for the undiscovered tomb of the ": null
    },
    {
        "Pharaoh": "pharaoh"
    },
    {
        " Kih-Oskh. Tintin discovers that the tomb is full of boxes of cigars labelled with a mysterious symbol, but he and Sarcophagus fall unconscious after an unseen enemy gasses them. They are then taken aboard a ship inside wooden ": null
    },
    {
        "sarcophagi": "sarcophagi"
    },
    {
        ", captained by smuggler ": null
    },
    {
        "Allan": "allan thompson"
    },
    {
        ", but to avoid the coastguard Allan orders Tintin and Snowy thrown overboard. They are rescued by a ": null
    },
    {
        "gunrunner": "gunrunner"
    },
    {
        " who sails them to ": null
    },
    {
        "Arabia": "arabian peninsula"
    },
    {
        ". Travelling by land, Tintin meets Sheikh ": null
    },
    {
        "Patrash Pasha": "patrash pasha"
    },
    {
        ", a big fan of his, and encounters Rastapopoulos filming a movie. The local army drafts Tintin and then arrests him as a spy, before Thomson and Thompson rescue him so that they can arrest him.     However, when the army storms their hideout, Tintin manages to elude the policemen, though the twins escape too. Boarding a plane, Tintin escapes Arabia but runs out of fuel over India, crashing into the jungle. After saving a sick ": null
    },
    {
        "elephant": "asian elephant"
    },
    {
        ", Tintin discovers Sarcophagus, who has become insane as the result of being injected with Rajaijah juice, the poison of madness . Tintin is hypnotised by a ": null
    },
    {
        "fakir": "fakir"
    },
    {
        " and institutionalized in an asylum, which he soon escapes. Meeting the ": null
    },
    {
        "Maharaja of Gaipajama": "list of the adventures of tintin charactersmaharaja of gaipajama"
    },
    {
        ", the two become friends, with the Maharaja revealing that his family has long been fighting a criminal ": null
    },
    {
        "opium": "opium"
    },
    {
        "-smuggling gang. The fakir appears and Tintin follows him, discovers the drug cartels hideout and is able to capture the cartel. Tintin recognises their Kih-Oskh symbol and realises it is the same organisation that was operating in Egypt and Arabia. The fakir escapes, and with the masked leader of the conspiracy kidnaps the Maharajas son. Tintin pursues them in a sports car, rescuing the boy and capturing the fakir, while the leader falls into a ": null
    },
    {
        "chasm": "chasm"
    },
    {
        ", seemingly dying. Tintin returns to Gaipajama, where his return is celebrated. Unwrapping one of the cigars with the mysterious Kih-Oskh symbol, Tintin explains to the Maharaja how opium was smuggled across the world in the cigars.              Georges Remi—best known under the pen name ": null
    },
    {
        "Hergé": "hergé"
    },
    {
        "—was employed as editor and illustrator of  , a childrens supplement to  , a staunchly Roman Catholic, ": null
    },
    {
        "conservative": "social conservatism"
    },
    {
        " Belgian newspaper based in Hergés native Brussels which was run by the ": null
    },
    {
        "Abbé": "abbé"
    },
    {
        " Norbert Wallez": "norbert wallez"
    },
    {
        ". In 42 Hergé began  The Adventures of Tintin  comic for , revolving around the exploits of fictional Belgian reporter ": null
    },
    {
        "Tintin": "tintin"
    },
    {
        ". Wallez ordered Hergé to set his first adventure in the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " to act as ": null
    },
    {
        "anti-socialist": "anti-socialism"
    },
    {
        " propaganda for children , to set his second adventure in the ": null
    },
    {
        "Belgian Congo": "belgian congo"
    },
    {
        " to encourage colonial sentiment , and to set his third adventure in the United States to use the story as a denunciation of American capitalism .          For his fourth Adventure, Hergé was eager to write a mystery story. The 42s saw mystery novels flourish across Western Europe with the success of authors like ": null
    },
    {
        "Agatha Christie": "agatha christie"
    },
    {
        " and ": null
    },
    {
        "Ellery Queen": "ellery queen"
    },
    {
        ". The decision to create a scenario around the tomb of Kih-Oskh was influenced by the 42 discovery of Pharaoh ": null
    },
    {
        "Tutankhamun": "tutankhamun"
    },
    {
        "s tomb by ": null
    },
    {
        "Howard Carter": "howard carter"
    },
    {
        " and the surrounding tabloid claims regarding a ": null
    },
    {
        "Curse of the Pharaohs": "curse of the pharaohs"
    },
    {
        ". Hergé returned to this theme for  The Seven Crystal Balls  . The name Kih-Oskh was an allusion to the ": null
    },
    {
        "kiosk": "kiosk"
    },
    {
        "s where  was sold. The Kih-Oskh symbol was described by Hergé as a distortion of the ": null
    },
    {
        "Taoist": "taoism"
    },
    {
        " symbol of the ": null
    },
    {
        "Taijitu": "taijitu"
    },
    {
        ", with biographer ": null
    },
    {
        "Benoît Peeters": "benoît peeters"
    },
    {
        " thinking that it foreshadowed the Yellow Mark that featured in the  Blake and Mortimer  comic  The Yellow M  authored by Hergés later collaborator ": null
    },
    {
        "Edgar P. Jacobs": "edgar p. jacobs"
    },
    {
        ". Hergé was aided in the production of Cigars of the Pharaoh by his assistant Paul Jam Jamin, who was heavily influenced by British magazines The Humorist and  Punch .     Hergé took influence from the published works of French adventurer and gunrunner ": null
    },
    {
        "Henry de Monfreid": "henry de monfreid"
    },
    {
        ", particularly his books Secrets of the Red Sea and The Hashish Cruise. Having lived through the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", Hergé disliked arms dealers, and used Monfreid as the basis for the gunrunner character in Cigars.   The idea of mummified bodies being lined up along a wall was adopted from ": null
    },
    {
        "Pierre Benoît": "pierre benoît"
    },
    {
        "s 42 book  LAtlantide  , which had recently been made into ": null
    },
    {
        "a 42 film": "latlantide"
    },
    {
        " by ": null
    },
    {
        "Georg Wilhelm Pabst": "georg wilhelm pabst"
    },
    {
        ". The wall paintings depicted on a cover of  was based on a bas-relief of ": null
    },
    {
        "Hathor": "hathor"
    },
    {
        " and ": null
    },
    {
        "Seti I": "seti i"
    },
    {
        " housed in the ": null
    },
    {
        "Louvre": "louvre"
    },
    {
        ", Paris, while the throne featured in Tintins dream was adopted from that found in the tomb of Tutankhamun. The inclusion of the secret society operating the smuggling ring was influenced by right-wing conspiracy theories about ": null
    },
    {
        "Freemasonry": "freemasonry"
    },
    {
        ", with Hergé likely gaining information on the brotherhood from a 42 article by Lucien Farnoux-Reynaud in the radical magazine La Crapouillot .          On 42 November 42 Le Petit Vingtième published a fictional interview between Jamin and Tintin in which the reporter announced that he would be travelling to China via Egypt, India, Ceylon, and Indochina. On 42 December 42 the story began serialisation in the supplement under the title of The Adventures of Tintin, Reporter, in the Orient. As the story began in Egypt rather than China, Hergé briefly renamed the story to The Cairo Affair. The story was not following any plan or pre-written plot, with Hergé as usual devising the story on a week-by-week basis.   In Autumn 42 the adventure was published in a book. Cigars was the first of the Adventures published by ": null
    },
    {
        "Casterman": "casterman"
    },
    {
        ", with whom Hergé had signed a contract in late 42 although much to his annoyance, they delayed publication until the autumn of 42 after the culmination of the summer holidays. In 42 they successfully requested that he produce several colour plates to be inserted into the reprint of the book.     Cigars of the Pharaoh saw the introduction of several characters who would gain a recurring role in The Adventures of Tintin. The most notable are the two detectives, who were initially called Agent X42 and Agent X42 . In his 42 Tintin play co-written with ": null
    },
    {
        "Jacques Van Melkebeke": "jacques van melkebeke"
    },
    {
        ",  Tintin in India: The Mystery of the Blue Diamond , Hergé named them Durant and Durand, although he later renamed them Dupont and Dupond.  The series English-language translators, Michael Turner and Leslie Lonsdale-Cooper, renamed them Thomson and Thompson.  They were based on a combination of the stereotypical Belgian policeman of the 42s with Hergés observations of his father and uncle, Alexis and Léon Remi, who were identical twins.     The series introduced Tintins adversary Roberto Rastapopoulos in Cigars of the Pharaoh, here depicted as a famous ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        " film director. It is only in the successor volume, The Blue Lotus, that he is also revealed as the head of an international criminal organisation. His name was developed by one of Hergés friends; Hergé thought it was hilarious and decided to use it. He devised Rastapopoulos as an Italian with a Greek surname, but the character fitted ": null
    },
    {
        "anti-Semitic": "antisemitism"
    },
    {
        " stereotypes of Jews; Hergé was adamant that the character was not Jewish. A fourth recurring character introduced in this story was the Portuguese merchant ": null
    },
    {
        "Oliveira da Figueira": "oliveira da figueira"
    },
    {
        ", who would reappear in both the subsequent Adventures set in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ",  Land of Black Gold  and  The Red Sea Sharks . One of the core characters of the story was Sophocles Sarcophagus, an Egyptologist who is the stereotype of an eccentric professor. In this respect, he is a prototype for the character of ": null
    },
    {
        "Cuthbert Calculus": "cuthbert calculus"
    },
    {
        ", whom Hergé would introduce later in  Red Rackhams Treasure .     It was during the serialisation of Cigars that Wallez was embroiled in a scandal after he was accused of defaming the Bureau of Public Works. The accusation resulted in a legal case being brought against the newspaper, and in response its owners demanded Wallezs resignation, which was tended in August 42 Without Wallez, Hergé became despondent, and in March 42 he tried to resign, but was encouraged to stay after his workload was reduced and his monthly salary was increased from 42 to 42 francs. Jamin subsequently took over Hergés responsibility for the day-to-day running of Le Petit Vingtième.          In the 42s and 42s, when Hergés popularity had increased, he and his team at ": null
    },
    {
        "Studios Hergé": "studios hergé"
    },
    {
        " redrew many of the original black-and-white Tintin adventures in colour using the   drawing style he had developed so that they visually fitted in with the new Tintin stories being created. The Studios reformatted and coloured Cigars of the Pharaoh in 42; it was the last of the early works to undergo this process.     In cutting down the length of the story, Hergé removed various isolated scenes that added nothing to the development of the plot, such as those in which Tintin confronts a bat, a crocodile, and snakes. The Arabian city that Tintin and Snowy searched for in the story was no longer identified as ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        ", while the Maharajahs three advisers were removed. New elements were also inserted; Hergé added a depiction of ancient Egyptian pyramids into the background. Hergé also added the character of Allan, who had originally been introduced in the later, 42 adventure  The Crab with the Golden Claws , and also appeared as Rastapopoulos henchman in later albums. Hergé inserted an allusion to his friend and collaborator Edgar P. Jacobs into the story by including a mummified professor named E.P. Jacobini in the Egyptian tomb.     Whereas the original version had included Sheikh Patrash Pasha showing Tintin a copy of Tintin in America, in the 42 version this was changed to the earlier Tintin in the Congo, and Hergé would change it again for subsequent printings, this time to  Destination Moon  , an Adventure set chronologically after Cigars. Benoît Peeters exclaimed that with this scene, the reader can imagine Tintins surprise at encountering an adventure he had not yet had and which included the characters of ": null
    },
    {
        "Captain Haddock": "captain haddock"
    },
    {
        " and Cuthbert Calculus whom he had not yet met. Another anachronism in this version appears when Snowy refers to ": null
    },
    {
        "Marlinspike Hall": "marlinspike hall"
    },
    {
        ", the ancestral home of Captain Haddock, from the much later volumes of the series. ": null
    },
    {
        "Harry Thompson": "harry thompson"
    },
    {
        " opined that the most important changes to the book were artistic, for in the late 42s Hergé was at the peak of his artistic ability.       Casterman republished the original black-and-white version in 42 in a French-language collected volume with The Blue Lotus and The Broken Ear, the second part of the  collection. In 42 they then published a facsimile version of the original.       ": null
    },
    {
        "Jean-Marc Lofficier": "jean-marc lofficier"
    },
    {
        " and Randy Lofficier considered Cigars of the Pharaoh to be graphically between Tintin in America and The Blue Lotus, as Hergé was expanding his visual vocabulary and making use of unforgettable moments such as the dream sequence in the tomb. Although recognising that Hergé was still devising his plot on a week-by-week basis, they thought that the work was an improvement on his earlier stories because of the inclusion of mystery and fantasy .   Awarding it three stars out of five, they thought the book was a surreal thriller, drenched and atmospheric. Believing that the work not only dealt with madness, but also was madness, they thought the book evoked a sense of dreamlike suspension of belief.  They also highlighted the inclusion of the Kih-Oskh symbol throughout the book, describing it as being akin to a recurring musical theme, stating that it added a note of pure oneirism.           Harry Thompson considered Cigars of the Pharaoh almost completely unrecognisable from its predecessors , praising its inspired comic characters and observed character comedy , which he thought escaped the sheer slapstick evident in the earlier Adventures. He also praised the elements of mystery and suspense that Hergé introduced, opining that it created a genuine sense of fear without recourse to a  deus ex machina .  More critically, he thought that the plots glaring flaw was the immediate transposition of events from Egypt to India, also believing that the inclusion of British colonialists as the antagonists made partial amends for the colonialist attitude displayed by Tintin in Tintin in the Congo. ": null
    },
    {
        "Michael Farr": "michael farr"
    },
    {
        " thought that Tintin was a maturer hero in Cigars, being more of a detective than a reporter. He thought that the dream sequence was one of the most imaginative and disturbing scenes in the series, illustrating Hergés growing virtuosity with the medium.  He also praised the scenes set in the Indian colonial bungalow, commenting that it was claustrophobic and sinisterly dramatic and worthy of the work of Agatha Christie, opining that the car chase provided a highly cinematic ending.  Overall, he thought it to be a narrative rich in mystery and drama which was as much of a landmark in the series as The Blue Lotus.     Hergé biographer Benoît Peeters thought that with Cigars, Hergé was engaging in the novelesque , and that the opening scene had echoes of ": null
    },
    {
        "Rodolphe Töpffer": "rodolphe töpffer"
    },
    {
        "s Mr Pencil. He also thought it the first of the Adventures to have a semblance or narrative unity.  Fellow biographer Pierre Assouline thought that the story was difficult for the reader to follow, because the exoticism of the backdrop faded amid the fast pace of the narrative.   Literary critic ": null
    },
    {
        "Tom McCarthy": "tom mccarthy"
    },
    {
        " highlighted the prominent role of ": null
    },
    {
        "tobacco": "tobacco"
    },
    {
        " in the story, drawing on the ideas of French philosopher ": null
    },
    {
        "Jacques Derrida": "jacques derrida"
    },
    {
        " to suggest the potential symbolism of this. He also suggested that the inclusion of mummified Egyptologists in the story warns readers of the dangers of mummification through interpretation.        Cigars of the Pharaoh was adapted into a 42 episode of  The Adventures of Tintin  television series by French studio ": null
    },
    {
        "Ellipse": "ellipse programmé"
    },
    {
        " and Canadian animation company ": null
    },
    {
        "Nelvana": "nelvana"
    },
    {
        ". Directed by Stéphane Bernasconi, Thierry Wermuth voiced the character of Tintin. In 42 the television channel ": null
    },
    {
        "Arte": "arte"
    },
    {
        " filmed an episode of its documentary series, Sur les traces de Tintin , in Egypt exploring the inspiration and setting of the Cigars of the Pharaoh.": null
    }
]