[
    {
        "Circe chess  is a ": null
    },
    {
        "chess variant": "chess variant"
    },
    {
        " in which captured pieces are reborn on their starting positions as soon as they are captured. The game was invented by French ": null
    },
    {
        "composer": "chess composer"
    },
    {
        " Pierre Monréal in 42 and the rules of Circe chess were first detailed by Monréal and Jean-Pierre Boyer in an article in Problème, 42     Circe is rarely played as a variant game , but very often employed in composed ": null
    },
    {
        "fairy chess problem": "fairy chess problem"
    },
    {
        "s.          These are the most usual rules employed in Circe—there are numerous other forms of the game in which the rules of rebirth may vary.     Pawns return to the start position on the same file they are captured on.   Rooks, knights and bishops return to the starting square which is the same colour as the square they are captured on.     For instance, a white pawn captured on b42 is reborn on b42; a black knight captured on f42 is reborn on b42; a black rook captured on the same square is reborn on h42 ": null
    },
    {
        "Castling": "castling"
    },
    {
        " with a reborn rook is permitted. A reborn pawn regains its initial two-step move option. A captured promoted piece is treated as a piece .     If the square that the rebirth should take place on is occupied, either by a friendly or enemy piece, the captured unit is not reborn—it is instead removed from the board and takes no further part in the game .     If a pawn captures via  en passant , it would be immediately in front of the reborn opponents pawn, thus preventing either pawn from moving.     ": null
    },
    {
        "Philip Cohen": "philip m. cohen"
    },
    {
        " has suggested that a move that simply reverses the opponents previous move should not be permitted.        The position illustrated demonstrates a couple of unusual effects which can occur in Circe. It is Black to move. White is threatening checkmate with 42Re42 Black would not be able to defend with 42..Kxe42 after this move, because the rook is instantly reborn on a42 from where it gives check . It might appear that there is nothing Black can do to prevent this threat, but in fact he has 42..Ba42 – if now 42Re42+, Kxe42 is possible because the rook is not reborn because its rebirth square is occupied.       When notating a Circe game in ": null
    },
    {
        "algebraic notation": "algebraic chess notation"
    },
    {
        ", it is conventional to place details of where a captured piece has been reborn in parentheses following the move. For example, if in the example diagram, White were to take Blacks knight, this would be notated Rxe42       There are many variants of Circe, especially in chess problems. Instead of being reborn on their starting positions the pieces may be reborn on other locations.   Anticirce: The capturing piece is reborn on its initial square. The captured piece disappears from the board. The rebirth square must be empty or the capture is illegal. There are two types: Type Cheylan: captures on the rebirth square are illegal . Type Calvet: captures on the rebirth square are legal.   Assassin Circe: The rebirth occurs even if the rebirth square is occupied. The occupying piece is removed from the board. When a piece is captured on its rebirth square, the capturing piece disappears.   Chamaeleon Circe: A captured piece is reborn as a different piece: knight becomes bishop, bishop becomes rook, rook becomes queen and queen becomes knight. The reborn piece is placed according to the Circe rule for the new piece.   Circe Parrain: A captured piece is reborn on the square displaced from the capture square by a vector equal to that of the move following the capture. If the following move is castling, then the sum of the king-move and rook-move vectors is used .   Circe Rex inclusive: As Circe, but also the kings may be captured. A mate requires that the initial square of the king is occupied.   Clone Circe: A captured piece is reborn on its initial square but reappears as the piece by which it is captured .   CouCou Circe: As Circe, but the rebirth square is that of the capturing piece. Pawns captured by a piece are reborn on the promotion rank, and promote. The promotion is chosen by the capturing side.   CousCous Circe: As CouCou Circe, but for captures resulting in promotion, the promotion type is chosen by the side whose pawn promotes.   Diagram Circe: A captured piece is reborn on the position it had on the diagram.   Equipollents Circe: As Circe Parrain, but the rebirth occurs immediately on a vector equal to the capturing move.   Kamikaze Circe: The captured piece is reborn on its initial square. The capturing piece disappears.   Martian Circe: Pieces move in the ordinary manner but capture only from their initial position . Captured pieces disappear from the board.   Mirror Circe: A captured piece is reborn on a square where a piece of the opposite colour would be reborn in ordinary Circe.   Platzwechsel Circe : A captured piece is reborn on the square where the capturer was placed before the capture. Platzwechsel means position exchange in German.   Strict Circe: As ordinary Circe, but the rebirth square must be free for the capture to be legal.   Symmetrical Circe: As Circe, but the rebirth square is the capture square mirrored across the center of the board.   Volcanic Circe": null
    }
]