[
    {
        "   The Cirth   is a semi‑": null
    },
    {
        "artificial script": "artificial script"
    },
    {
        ", based on real‑life ": null
    },
    {
        "runic alphabet": "runic alphabet"
    },
    {
        "s, invented by ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        " for the ": null
    },
    {
        "constructed languages": "constructed language"
    },
    {
        "he devised and used in his works. Cirth is written with a capital letter when referring to the writing system; the runes themselves can be called cirth.     In the fictional history of ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        ", the original Certhas was created by the ": null
    },
    {
        "Grey Elves": "sindar"
    },
    {
        " for their language, ": null
    },
    {
        "Sindarin": "sindarin"
    },
    {
        ". Its extension and   elaboration was known as the Angerthas Daeron, as it was attributed to the Sindar ": null
    },
    {
        "Daeron": "daeron"
    },
    {
        ", although it was most probably expanded by the ": null
    },
    {
        "Noldor": "noldor"
    },
    {
        " in order to represent the sounds of other languages like ": null
    },
    {
        "Quenya": "quenya"
    },
    {
        ".     Although the Cirth was later largely replaced by the ": null
    },
    {
        "Tengwar": "tengwar"
    },
    {
        ", it was adopted by ": null
    },
    {
        "Dwarves": "dwarf"
    },
    {
        " to write down both their ": null
    },
    {
        "Khuzdul": "khuzdul"
    },
    {
        " language  and the languages of ": null
    },
    {
        "Men": "man"
    },
    {
        " . The Cirth was also adapted, in its oldest and simplest form, by various races including ": null
    },
    {
        "Men": "man"
    },
    {
        " and even ": null
    },
    {
        "Orcs": "orc"
    },
    {
        ".         Many letters have shapes also found in the historical ": null
    },
    {
        "runic alphabets": "runic alphabets"
    },
    {
        ", but their sound values are only similar in a few of the vowels. Rather, the system of assignment of sound values is much more systematic in the Cirth than in the historical runes . A similar system has been proposed for a few historical runes but is in any case much more obscure.     The division between the older Cirth of Daeron and their adaptation by Dwarves and Men has been interpreted as a parallel drawn by Tolkien to the development of the Fuþorc to the ": null
    },
    {
        "Younger Fuþark": "younger fuþark"
    },
    {
        ".  The original Elvish Cirth as supposed products of a superior culture are focused on logical arrangement and a close connection between form and value whereas the adaptations by mortal races introduced irregularities. Similar to the Germanic tribes who had no written literature and used only simple runes before their conversion to Christianity, the Sindarin Elves of Beleriand with their Cirth were introduced to the more elaborate Tengwar of Fëanor when the Noldorin Elves returned to Middle-earth from the lands of the divine ": null
    },
    {
        "Valar": "valar"
    },
    {
        ".        Certhas The Return of the King , Tolkien writes that the ": null
    },
    {
        "Sindar": "sindar"
    },
    {
        " of ": null
    },
    {
        "Beleriand": "beleriand"
    },
    {
        " first developed an ": null
    },
    {
        "alphabet": "alphabet"
    },
    {
        " for their language some time between the invention of the ": null
    },
    {
        "Tengwar": "tengwar"
    },
    {
        " by ": null
    },
    {
        "Fëanor": "fëanor"
    },
    {
        " and their introduction to ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        " by the exiled ": null
    },
    {
        "Noldor": "noldor"
    },
    {
        ".     This alphabet was devised to represent only the sounds of their ": null
    },
    {
        "Sindarin": "sindarin"
    },
    {
        " language and its letters were entirely used for inscribing names or brief memorials on wood, stone or metal, hence their angular forms and straight lines.  In ": null
    },
    {
        "Sindarin": "sindarin"
    },
    {
        " these letters were named cirth , from the Elvish root kir- meaning to cleave, to cut .  An ": null
    },
    {
        "abecedarium": "abecedarium"
    },
    {
        " of cirth, consisting of the runes listed in due order, was commonly known as Certhas .     The cirth used for ": null
    },
    {
        "voiceless": "voiceless consonant"
    },
    {
        "stop consonants": "stop consonant"
    },
    {
        "were constructed systematically by the combination of a stem and a branch . The attachment of the branch was usually made on the right side. The reverse was not infrequent, but had no phonetic significance .   Other consonants were formed following two basic principles:   adding a stroke to a branch added ": null
    },
    {
        "voice": "voiced consonant"
    },
    {
        " ;   placing the branch on both sides of the stem added ": null
    },
    {
        "voice and nasality": "nasal stop"
    },
    {
        " .   The cirth constructed in this way can therefore be grouped into series. Each series corresponds to a ": null
    },
    {
        "place of articulation": "place of articulation"
    },
    {
        ". This earliest system had three series:   ": null
    },
    {
        "labial consonant": "labial consonant"
    },
    {
        "s, based on ": null
    },
    {
        "16px": "image:certh 1.svg"
    },
    {
        ";   ": null
    },
    {
        "dental consonant": "dental consonant"
    },
    {
        "s, based on ": null
    },
    {
        "16px": "image:certh 8.svg"
    },
    {
        ";   ": null
    },
    {
        "velar consonant": "velar consonant"
    },
    {
        "s, based on ": null
    },
    {
        "16px": "image:certh 18.svg"
    },
    {
        ".     There are also additional cirth that do not have regular shapes. These include ": null
    },
    {
        "liquid consonants": "liquid consonant"
    },
    {
        "  and , the ": null
    },
    {
        "voiceless glottal transition": "voiceless glottal transition"
    },
    {
        " , the ": null
    },
    {
        "voiceless alveolar fricative": "voiceless alveolar fricative"
    },
    {
        " , and ": null
    },
    {
        "vowel": "vowel"
    },
    {
        "s.     The original display of Cirth should have been this:            The known ancient cirth do not cover all the sounds of Sindarin: there is no certh for , , ,  or . Perhaps this system had been devised for the Old Sindarin tongue, as many of the above-mentioned sounds did not exist in that language.   However, still frequent sounds  and  are missing, too. This indicates that some ancient, unknown cirth could have existed, but did not make it to the later systems; a fuller table therefore cannot be reconstructed.   Long vowels were evidently indicated by doubling.          Angerthas Daeron": null
    },
    {
        "First Age": "first age"
    },
    {
        " the Certhas was rearranged and further developed, partly under the influence of the ": null
    },
    {
        "Tengwar": "tengwar"
    },
    {
        ". This reorganisation of the Cirth was commonly attributed to the ": null
    },
    {
        "Elf": "elf"
    },
    {
        " Daeron": "daeron"
    },
    {
        ", ": null
    },
    {
        "minstrel": "minstrel"
    },
    {
        " and loremaster of king ": null
    },
    {
        "Thingol": "thingol"
    },
    {
        " of ": null
    },
    {
        "Doriath": "doriath"
    },
    {
        ". Thus, the new system became known as the Angerthas Daeron .     Unlike the previous system, the flipped form of a certh had now a phonemic significance: it signalled the ": null
    },
    {
        "lenition": "lenition"
    },
    {
        " of the original rune. These new cirth were needed in order to represent ": null
    },
    {
        "fricatives": "fricative consonant"
    },
    {
        " that were developed at one point in Sindarin .     Some new runes were introduced in the Angerthas with the purpose to represent:   the frequent sounds  and ;   ": null
    },
    {
        "long vowel": "long vowel"
    },
    {
        "s, that evidently used to be written by doubling the certh of the corresponding short vowel ;   two ": null
    },
    {
        "front vowel": "front vowel"
    },
    {
        "s, probably originated as ligatures of the corresponding ": null
    },
    {
        "back vowel": "back vowel"
    },
    {
        " with : ": null
    },
    {
        "16px": "image:certh 42.svg"
    },
    {
        "16px": "image:certh 39.svg"
    },
    {
        " → ": null
    },
    {
        "16px": "image:certh 45a.svg"
    },
    {
        " , and ": null
    },
    {
        "16px": "image:certh 50.svg"
    },
    {
        "16px": "image:certh 39.svg"
    },
    {
        " → ": null
    },
    {
        "16px": "image:certh 52.svg"
    },
    {
        " ;   two common ": null
    },
    {
        "consonant cluster": "consonant cluster"
    },
    {
        "s:  and .     However, the principal additions to the former Certhas were two entirely new series of regularly-formed cirth:   ": null
    },
    {
        "palatal consonant": "palatal consonant"
    },
    {
        "s, based on ": null
    },
    {
        "16px": "image:certh 13.svg"
    },
    {
        ";   ": null
    },
    {
        "labialized velar consonant": "labialized velar consonant"
    },
    {
        "s, based on ": null
    },
    {
        "16px": "image:certh 23.svg"
    },
    {
        ".   Since these new series represent sounds which do not occur in Sindarin but are present in ": null
    },
    {
        "Quenya": "quenya"
    },
    {
        ", they were most probably invented by the Exiled ": null
    },
    {
        "Noldor": "noldor"
    },
    {
        " that spoke Quenya as a language of knowledge. By loan-translation, the Cirth became known in Quenya as Certar , while a single certh was called certa .     According to Tolkien, the Angerthas Daeron was used primarily for carved inscriptions, as for most other forms of written communication the Tengwar were used after their introduction in Middle-earth. Apparently, the Elves abandoned the Cirth altogether, with the exception of the Noldor dwelling in ": null
    },
    {
        "Eregion": "eregion"
    },
    {
        ", where the Angerthas was maintained and became also known as Angerthas Eregion.              Whereas the regular Sindarin spelling is used in this article to transliterate the primitive Certhas, the Angerthas follows the peculiar transliteration introduced by Tolkien in the Appendix E. For example, the Sindarin spelling for  is , but the same sound is spelled  when transliterating the Angerthas . The motivation behind this peculiar transliteration is that this alphabet was meant to cover a much larger set of sounds than the previous one.     In this article, the cirth of the ": null
    },
    {
        "16px": "image:certh 13.svg"
    },
    {
        "‑series present two IPA transcriptions each. The reason is that the ": null
    },
    {
        "palatal consonants": "palatal consonant"
    },
    {
        "of Noldorin Quenya are realised as ": null
    },
    {
        "palato-alveolar consonants": "palato-alveolar consonant"
    },
    {
        "in Vanyarin Quenya . For example, the Quenya world  is pronounced   in the Noldorin dialect, but   in Vanyarin.   Although in the fictional history of Middle-earth this series of consonants was introduced by the Noldor, it is deemed necessary to show the Vanyarin pronunciation as well, given that the very transliteration used by Tolkien is more similar to the Vanyarin ": null
    },
    {
        "phonotactics": "phonotactics"
    },
    {
        " than the Noldorin.            According to ": null
    },
    {
        "Tolkiens legendarium": "tolkiens legendarium"
    },
    {
        ", the ": null
    },
    {
        "Dwarves": "dwarf"
    },
    {
        " first came to know the runes of the Noldor at the beginning of the ": null
    },
    {
        "Second Age": "second age"
    },
    {
        ". The Dwarves introduced a number of unsystematic changes in value, as well as certain new cirth . They modified the previous system to suit the specific needs of their language, ": null
    },
    {
        "Khuzdul": "khuzdul"
    },
    {
        ". The Dwarves spread their revised alphabet to ": null
    },
    {
        "Moria": "moria"
    },
    {
        ", where it came to be known as Angerthas Moria, and developed both carved and pen-written forms of these runes.     Many cirth here represent sounds not occurring in Khuzdul . Here they are marked with a black star .                      In Angerthas Moria the cirth ": null
    },
    {
        "16px": "image:certh 14.svg"
    },
    {
        "  and ": null
    },
    {
        "16px": "image:certh 16.svg"
    },
    {
        "  were dropped. Thus ": null
    },
    {
        "16px": "image:certh 29.svg"
    },
    {
        " and ": null
    },
    {
        "16px": "image:certh 30.svg"
    },
    {
        " were adopted for  and , although they were used for  and  in Elvish languages. Subsequently, this script used the certh ": null
    },
    {
        "16px": "image:certh 12.svg"
    },
    {
        " for , which had the sound  in the Elvish systems. Therefore, the certh ": null
    },
    {
        "16px": "image:certh 22.svg"
    },
    {
        "  was adopted for the sound . A totally new introduction was the certh ": null
    },
    {
        "16px": "image:certh 53.svg"
    },
    {
        ", used as an alternative, simplified and, maybe, weaker form of ": null
    },
    {
        "16px": "image:certh 22.svg"
    },
    {
        ". Because of the visual relation of these two cirth, the certh ": null
    },
    {
        "16px": "image:certh 17.svg"
    },
    {
        " was given the sound  to relate better with ": null
    },
    {
        "16px": "image:certh 54.svg"
    },
    {
        " that, in this script, had the sound .       At the beginning of the ": null
    },
    {
        "Third Age": "third age"
    },
    {
        " the Dwarves were driven out of Moria, and some migrated to ": null
    },
    {
        "Erebor": "lonely mountain"
    },
    {
        ". As the Dwarves of Erebor would trade with the Men of the nearby towns of ": null
    },
    {
        "Dale": "dale"
    },
    {
        " and ": null
    },
    {
        "Lake-town": "esgaroth"
    },
    {
        ", they needed a script to write in ": null
    },
    {
        "Westron": "westron"
    },
    {
        " . The Angerthas Moria was adapted accordingly: some new cirth were added, while some were restored to their Elvish usage, thus creating the Angerthas Erebor.     While the Angerthas Moria was still used to write down Khuzdul, this new script was primarily used for Mannish languages. It is also the script used in the ": null
    },
    {
        "Book of Mazarbul": "list of middle-earth objectsbook of mazarbul"
    },
    {
        ".              Angerthas Erebor also features ": null
    },
    {
        "combining diacritic": "combining diacritic"
    },
    {
        "s:   a ": null
    },
    {
        "circumflex": "circumflex"
    },
    {
        " 16px": "image:certh circumflex.png"
    },
    {
        " used to denote ": null
    },
    {
        "long consonants": "gemination"
    },
    {
        ";   a ": null
    },
    {
        "macron below": "macron below"
    },
    {
        " 16px": "image:certh macron below.png"
    },
    {
        " to indicate a ": null
    },
    {
        "long vowel": "long vowel"
    },
    {
        " sound;   an ": null
    },
    {
        "underdot": "dot underdot"
    },
    {
        " 16px": "image:certh underdot.png"
    },
    {
        " to mark cirth used as ": null
    },
    {
        "numerals": "numerical digits"
    },
    {
        ". As a matter of fact, in the ": null
    },
    {
        "Book of Mazarbul": "list of middle-earth objectsbook of mazarbul"
    },
    {
        " some cirth are used as numerals: ": null
    },
    {
        "16px": "image:certh 39.svg"
    },
    {
        " for 1, ": null
    },
    {
        "16px": "image:certh 50.svg"
    },
    {
        " for 2, ": null
    },
    {
        "16px": "image:certh 52.svg"
    },
    {
        " for 3, ": null
    },
    {
        "16px": "image:gondolin rune b.svg"
    },
    {
        " for 4, ": null
    },
    {
        "16px": "image:certh 22.svg"
    },
    {
        " for 5.        The Angerthas Erebor is used twice in  The Lord of the Rings  to write in English:   in the upper inscription of the title page, where it reads  & 183; & 8203;lord & 183; & 8203;ov & 183; & 8203; & 183; & 8203;riŋs & 183; & 8203;translatᵊd & 183; & 8203;from & 183; & 8203; & 183; & 8203; ... ;   in the bottom inscription of ": null
    },
    {
        "Balins": "balin"
    },
    {
        "tomb—being the translation of the upper inscription, which is written in Khuzdul using Angerthas Moria.     The Book of Mazarbul shows some additional cirth used in Angerthas Erebor: one for a double  ": null
    },
    {
        "ligature": "typographic ligature"
    },
    {
        ", one for the ": null
    },
    {
        "definite article": "article definite article"
    },
    {
        ", and six for the representation of the same number of English ": null
    },
    {
        "diphthong": "diphthong"
    },
    {
        "s:                       The Cirth is not the only runic writing system devised by Tolkien for Middle-earth. In fact, he invented a great number of runic alphabets, of which only a few others have been published. Most of these runic scripts were published in the Appendix on Runes in  The History of Middle-earth , vol. VII,  The Treason of Isengard , edited by ": null
    },
    {
        "Christopher Tolkien": "christopher tolkien"
    },
    {
        ".     The Hobbit --  ref  /ref  center  /center  center  /center  ref  /ref center  /center  br  ref  /ref br /  ref  /ref center  /center center  /center  div style font-family: Quivira, Everson Mono;    /div  ref  /ref ref name roadmapsmp  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ": null
    }
]