[
    {
        "Civil defence  or civil protection is an effort to protect the citizens of a state  from ": null
    },
    {
        "military": "military"
    },
    {
        " attacks and ": null
    },
    {
        "natural disaster": "natural disaster"
    },
    {
        "s. It uses the principles of ": null
    },
    {
        "emergency operation": "emergency operation"
    },
    {
        "s: ": null
    },
    {
        "prevention": "hazard prevention"
    },
    {
        ", ": null
    },
    {
        "mitigation": "mitigation"
    },
    {
        ", preparation, response, or ": null
    },
    {
        "emergency evacuation": "emergency evacuation"
    },
    {
        " and recovery. Programs of this sort were initially discussed at least as early as the 1920s and were implemented in some countries during the 1930s as the threat of ": null
    },
    {
        "war": "war"
    },
    {
        " and ": null
    },
    {
        "aerial bombardment": "strategic bombing"
    },
    {
        " grew. It became widespread after the threat of ": null
    },
    {
        "nuclear weapons": "nuclear weapon"
    },
    {
        "was realized.     Since the end of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ", the focus of civil defence has largely shifted from military attack to emergencies and disasters in general. The new concept is described by a number of terms, each of which has its own specific shade of meaning, such as  crisis management ,  emergency management , emergency preparedness, contingency planning, civil contingency, civil aid and civil protection.     In some countries, civil defense is seen as a key part of total defense . For example, in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", the ": null
    },
    {
        "Swedish word": "swedish language"
    },
    {
        " totalförsvar refers to the commitment of a wide range of resources of the nation to its defense—including to civil protection. Respectively, some countries  may have or have had military-organized civil defense units as part of their ": null
    },
    {
        "armed forces": "armed forces"
    },
    {
        " or as a ": null
    },
    {
        "paramilitary": "paramilitary"
    },
    {
        " service.                     The advent of civil defense was stimulated by the experience of the bombing of civilian areas during the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". The bombing of the United Kingdom began on 19 January 1915 when German ": null
    },
    {
        "zeppelins": "zeppelin"
    },
    {
        "dropped bombs on the ": null
    },
    {
        "Great Yarmouth": "great yarmouth"
    },
    {
        " area, killing six people. ": null
    },
    {
        "German": "germany"
    },
    {
        " bombing operations of the First World War were surprisingly effective, especially after the ": null
    },
    {
        "Gotha": "gotha g"
    },
    {
        " bombers surpassed the zeppelins. The most devastating raids inflicted 121 casualties for each ": null
    },
    {
        "ton": "ton"
    },
    {
        " of bombs dropped; this figure was then used as a basis for predictions.     After the war, attention was turned toward civil defense in the event of war, and the ": null
    },
    {
        "Air Raid Precautions": "air raid precautions"
    },
    {
        " Committee was established in 1924 to investigate ways for ensuring the protection of civilians from the danger of ": null
    },
    {
        "air-raids": "aerial bombing of citieseuropean theatre"
    },
    {
        ".     The Committee produced figures estimating that in ": null
    },
    {
        "London": "london"
    },
    {
        " there would be 9,000 casualties in the first two days and then a continuing rate of 17,500 casualties a week. These rates were thought conservative. It was believed that there would be total chaos and panic and hysterical neurosis as the people of London would try to flee the city. To control the population harsh measures were proposed: bringing London under almost military control, and physically cordoning off the city with 120,000 troops to force people back to work. A different government department proposed setting up camps for ": null
    },
    {
        "refugees": "refugee"
    },
    {
        "for a few days before sending them back to London.     A special government department, the ": null
    },
    {
        "Civil Defence Service": "civil defence service"
    },
    {
        ", was established by the ": null
    },
    {
        "Home Office": "home office"
    },
    {
        " in 1935. Its remit included the pre-existing ARP as well as wardens, firemen , fire watchers, rescue, first aid post, stretcher party and industry. Over 1.9 million people served within the CD; nearly 2,400 lost their lives to enemy action.        The organization of civil defense was the responsibility of the local authority. Volunteers were ascribed to different units depending on experience or training. Each local civil defense service was divided into several sections. Wardens were responsible for local ": null
    },
    {
        "reconnaissance": "reconnaissance"
    },
    {
        " and reporting, and leadership, organization, guidance and control of the general public. Wardens would also advise survivors of the locations of rest and food centers, and other welfare facilities.     Rescue Parties were required to assess and then access bombed-out buildings and retrieve injured or dead people. In addition they would turn off ": null
    },
    {
        "gas": "gas"
    },
    {
        ", ": null
    },
    {
        "electricity": "electricity"
    },
    {
        " and ": null
    },
    {
        "water supplies": "water supply"
    },
    {
        ", and repair or pull down unsteady buildings. Medical services, including ": null
    },
    {
        "First Aid": "first aid"
    },
    {
        " Parties, provided on the spot medical assistance.     The expected stream of information that would be generated during an attack was handled by Report and Control teams. A local ": null
    },
    {
        "headquarters": "headquarter"
    },
    {
        "would have an ARP controller who would direct rescue, first aid and ": null
    },
    {
        "decontamination": "decontamination"
    },
    {
        " teams to the scenes of reported bombing. If local services were deemed insufficient to deal with the incident then the controller could request assistance from surrounding ": null
    },
    {
        "borough": "borough"
    },
    {
        "s.     Fire Guards were responsible for a designated area/building and required to monitor the fall of ": null
    },
    {
        "incendiary bombs": "incendiary bomb"
    },
    {
        "and pass on news of any fires that had broken out to the NFS. They could deal with an individual ": null
    },
    {
        "magnesium electron incendiary bomb": "elektron"
    },
    {
        " by dousing it with buckets of sand or water or by smothering. Additionally, Gas Decontamination Teams kitted out with gas-tight and ": null
    },
    {
        "waterproof": "waterproof"
    },
    {
        " protective clothing": "protective clothing"
    },
    {
        " were to deal with any ": null
    },
    {
        "gas attack": "gas attack"
    },
    {
        "s. They were trained to decontaminate buildings, roads, rail and other material that had been contaminated by liquid or jelly gases.        Little progress was made over the issue of ": null
    },
    {
        "air-raid shelter": "air-raid shelter"
    },
    {
        "s, because of the apparently irreconcilable conflict between the need to send the public underground for shelter and the need to keep them above ground for protection against gas attacks. In February 1936 the ": null
    },
    {
        "Home Secretary": "home secretary"
    },
    {
        " appointed a technical Committee on Structural Precautions against Air Attack. During the ": null
    },
    {
        "Munich crisis": "munich crisis"
    },
    {
        ", local authorities dug trenches to provide shelter. After the crisis, the British Government decided to make these a permanent feature, with a standard design of precast concrete trench lining. They also decided to issue the ": null
    },
    {
        "Anderson shelter": "anderson shelter"
    },
    {
        " free to poorer households and to provide steel props to create shelters in suitable basements.      During the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", the ARP was responsible for the issuing of ": null
    },
    {
        "gas mask": "gas mask"
    },
    {
        "s, pre-fabricated ": null
    },
    {
        "air-raid shelters": "air-raid shelter"
    },
    {
        " , the upkeep of local public shelters, and the maintenance of the ": null
    },
    {
        "blackout": "blackout"
    },
    {
        ". The ARP also helped rescue people after air raids and other attacks, and some women became ARP Ambulance Attendants whose job was to help administer first aid to casualties, search for survivors, and in many grim instances, help recover bodies, sometimes those of their own colleagues.        As the war progressed, the military effectiveness of Germanys aerial bombardment was very limited. Thanks to the Luftwaffes shifting aims, the strength of British air defenses, the use of early warning radar and the life-saving actions of local civil defense units, the aerial Blitz during the ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        " failed to break the morale of the British people, destroy the Royal Air Force or significantly hinder British industrial production.  Despite a significant investment in civil and military defense, British civilian losses during the Blitz were higher than in most strategic bombing campaigns throughout the war. For example, there were 14,000-20,0000 UK civilian fatalities during the Battle of Britain,  a relatively high number considering that the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " dropped only an estimated 30,000 tons of ordinance during the battle.  In comparison, Allied ": null
    },
    {
        "strategic bombing of Germany": "strategic bombing during world war ii"
    },
    {
        " during the war was less lethal, with an estimated 400,000-600,000 German civilian fatalities for approximately 1.35 million tons of bombs dropped on Germany.            In the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", the ": null
    },
    {
        "Office of Civil Defense": "office of civil defense"
    },
    {
        " was established in May 1941 to coordinate civilian defense efforts. It coordinated with the ": null
    },
    {
        "Department of the Army": "department of the army"
    },
    {
        " and established similar groups to the British ARP. One of these groups that still exists today is the ": null
    },
    {
        "Civil Air Patrol": "civil air patrol"
    },
    {
        ", which was originally created as a civilian auxiliary to the ": null
    },
    {
        "Army": "us army"
    },
    {
        ". The CAP was created on December 1, 1941, with the main civil defense mission of search and rescue. The CAP also sank two Axis submarines and provided aerial reconnaissance for Allied and neutral merchant ships.  In 1946, the Civil Air Patrol was barred from combat by ": null
    },
    {
        "Public Law 79-476": "public law 79-476"
    },
    {
        ". The CAP then received its current mission: search and rescue for downed aircraft. When the ": null
    },
    {
        "Air Force": "united states air force"
    },
    {
        " was created, in 1947, the Civil Air Patrol became the auxiliary of the ": null
    },
    {
        "Air Force": "united states air force"
    },
    {
        ". Texas Wing Civil Air Patrol 2014 Summer Encampment Standard Operating Instructions     The ": null
    },
    {
        "Coast Guard Auxiliary": "coast guard auxiliary"
    },
    {
        " performs a similar role in support of the ": null
    },
    {
        "U.S. Coast Guard": "united states coast guard"
    },
    {
        ".  Like the Civil Air Patrol, the Coast Guard Auxiliary was established in the run up to World War II. Auxiliarists were sometimes armed during the war, and extensively participated in port security operations. After the war, the Auxiliary shifted its focus to promoting boating safety and assisting the Coast Guard in performing search and rescue and marine safety and environmental protection.     In the United States a federal civil defense program existed under Public Law 920 of the 81st Congress,  as amended, from 1951–1994. That statutory scheme was made so-called all-hazards by Public Law 103-160 in 1993 and largely repealed by Public Law 103-337 in 1994.  Parts now appear in Title VI of the Robert T. Stafford Disaster Relief and Emergency Assistance Act, Public Law 100-107  The term EMERGENCY PREPAREDNESS was largely codified by that repeal and amendment. See 42 USC Sections 5101 and following.               In most of the states of the ": null
    },
    {
        "North Atlantic Treaty Organization": "north atlantic treaty organization"
    },
    {
        ", such as the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and ": null
    },
    {
        "West Germany": "west germany"
    },
    {
        ", as well as the ": null
    },
    {
        "Soviet Bloc": "soviet bloc"
    },
    {
        ", and especially in the neutral countries, such as ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " and in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " during the 1950s and 1960s, many civil defense practices took place to prepare for the aftermath of a ": null
    },
    {
        "nuclear war": "nuclear warfare"
    },
    {
        ", which seemed quite likely at that time.      In the United Kingdom, the ": null
    },
    {
        "Civil Defence Service": "civil defence service"
    },
    {
        " was disbanded in 1945, followed by the ARP in 1946. With the onset of the growing ": null
    },
    {
        "tensions between East and West": "cold war"
    },
    {
        ", the service was revived in 1949 as the ": null
    },
    {
        "Civil Defence Corps": "civil defence corps"
    },
    {
        ". As a civilian volunteer organization, it was tasked to take control in the aftermath of a major national emergency, principally envisaged as being a Cold War ": null
    },
    {
        "nuclear attack": "nuclear warfare"
    },
    {
        ". Although under the authority of the ": null
    },
    {
        "Home Office": "home office"
    },
    {
        ", with a centralized administrative establishment, the corps was administered locally by Corps Authorities. In general every ": null
    },
    {
        "county": "counties of the united kingdom"
    },
    {
        " was a Corps Authority, as were most ": null
    },
    {
        "county boroughs": "county borough"
    },
    {
        "in ": null
    },
    {
        "England and Wales": "england and wales"
    },
    {
        " and large ": null
    },
    {
        "burghs": "burgh"
    },
    {
        "in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ".     Each division was divided into several sections, including the Headquarters, Intelligence and Operations, Scientific and Reconnaissance, Warden & Rescue, Ambulance and First Aid and Welfare.     In 1954 ": null
    },
    {
        "Coventry City Council": "coventry city council"
    },
    {
        " caused international controversy when it announced plans to disband its Civil Defence committee because the councillors had decided that hydrogen bombs meant that there could be no recovery from a nuclear attack. The British government opposed such a move and held a provocative Civil Defence exercise on the streets of Coventry which Labour council members protested against.  The government also decided to implement its own committee at the citys cost until the council reinstituted its committee.     In the United States, the sheer power of ": null
    },
    {
        "nuclear weapons": "nuclear weapon"
    },
    {
        "and the perceived likelihood of such an attack precipitated a greater response than had yet been required of civil defense. Civil defense, previously considered an important and commonsense step, became divisive and controversial in the charged atmosphere of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ". In 1950, the ": null
    },
    {
        "National Security Resources Board": "national security resources board"
    },
    {
        " created a 162-page document outlining a model civil defense structure for the U.S. Called the Blue Book by civil defense professionals in reference to its solid blue cover, it was the template for legislation and organization for the next 40 years. National Security Resources Board. United States Civil Defense. Washington, D.C.: U.S. Government Printing Office , 1950. LCCN 51060552.        Perhaps the most memorable aspect of the Cold War civil defense effort was the educational effort made or promoted by the government.  In  Duck and Cover , ": null
    },
    {
        "Bert the Turtle": "bert the turtle"
    },
    {
        " advocated that children ": null
    },
    {
        "duck and cover": "duck and cover"
    },
    {
        " when they see the ": null
    },
    {
        "flash": "nuclear fireball"
    },
    {
        ". Booklets such as  Survival Under Atomic Attack ,  Fallout Protection  and  Nuclear War Survival Skills  were also commonplace. The transcribed radio program ": null
    },
    {
        "Stars for Defense": "stars for defense"
    },
    {
        " combined hit music with civil defense advice. Government institutes created ": null
    },
    {
        "public service announcements": "public service announcements"
    },
    {
        " including childrens songs and distributed them to radio stations to educate the public in case of nuclear attack.      The US ": null
    },
    {
        "President Kennedy": "president kennedy"
    },
    {
        " launched an ambitious effort to install fallout shelters throughout the United States. These shelters would not protect against the blast and heat effects of nuclear weapons, but would provide some protection against the radiation effects that would last for weeks and even affect areas distant from a nuclear explosion. In order for most of these preparations to be effective, there had to be some degree of warning. In 1951, ": null
    },
    {
        "CONELRAD": "conelrad"
    },
    {
        " was established. Under the system, a few primary stations would be alerted of an emergency and would broadcast an alert. All broadcast stations throughout the country would be constantly listening to an upstream station and repeat the message, thus passing it from station to station.     In a once classified US ": null
    },
    {
        "war game": "military simulation"
    },
    {
        " analysis, looking at varying levels of war escalation, warning and pre-emptive attacks in the late 1950s early 1960s, it was estimated that approximately 27 million US citizens would have been saved with civil defense education.  At the time, however, the cost of a full-scale civil defense program was regarded as less effective in ": null
    },
    {
        "cost-benefit analysis": "cost-benefit analysis"
    },
    {
        " than a ": null
    },
    {
        "ballistic missile defense": "ballistic missile defense"
    },
    {
        "  system, and as the Soviet adversary was increasing their ": null
    },
    {
        "nuclear stockpile": "nuclear stockpile"
    },
    {
        ", the ": null
    },
    {
        "efficacy": "efficacy"
    },
    {
        " of both would follow a ": null
    },
    {
        "diminishing returns": "diminishing returns"
    },
    {
        " trend.     Contrary to the largely noncommittal approach taken in ": null
    },
    {
        "NATO": "nato"
    },
    {
        ", with its stops and starts in civil defense depending on the whims of each newly elected government, the military strategy in the comparatively more ideologically consistent  USSR  held that, amongst other things, a winnable nuclear war was possible.    To this effect the ": null
    },
    {
        "Soviets": "soviet"
    },
    {
        "planned to minimize, as far as possible, the effects of nuclear weapon strikes on its territory, and therefore spent considerably more thought on civil defense preparations than in U.S., with defense plans that have been assessed to be far more effective than those in the U.S.        Soviet Civil Defense Troops played the main role in the massive disaster relief operation following the ": null
    },
    {
        "1986 Chernobyl nuclear accident": "chernobyl accident"
    },
    {
        ". Defense Troop ": null
    },
    {
        "reservists": "reservists"
    },
    {
        " were officially ": null
    },
    {
        "mobilized": "mobilization"
    },
    {
        " from throughout the USSR to join the Chernobyl task force and formed on the basis of the ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        " Civil Defense Brigade. The task force performed some high-risk tasks including, with the failure of their robotic machinery, the manual removal of highly-": null
    },
    {
        "radioactive": "radioactivity"
    },
    {
        " debris. Many of their personnel were later ": null
    },
    {
        "decorated with medals for their work at containing the release of radiation into the environment": "liquidator"
    },
    {
        ", with a number of ": null
    },
    {
        "the 56 deaths from the accident": "deaths due to the chernobyl disaster"
    },
    {
        " being Civil defense troops.            In Western countries, strong civil defense policies were never properly implemented, because it was fundamentally at odds with the doctrine of ": null
    },
    {
        "mutual assured destruction": "mutual assured destruction"
    },
    {
        " by making provisions for survivors. It was also considered that a full-fledged total defense would have not been worth the very large expense. For whatever reason, the public saw efforts at civil defense as fundamentally ineffective against the powerful destructive forces of nuclear weapons, and therefore a waste of time and money, although detailed scientific research programs did underlie the much-mocked government civil defense pamphlets of the 1950s and 1960s.      Governments in most Western countries, with the sole exception of Switzerland, generally sought to underfund Civil Defense due to its perceived pointlessness. Nevertheless, effective but commonly dismissed ": null
    },
    {
        "civil defense measures against nuclear attack": "duck and cover"
    },
    {
        " were implemented, in the face of popular apathy and skepticism of authority. After the end of the Cold War, the focus moved from defense against nuclear war to defense against a terrorist attack possibly involving ": null
    },
    {
        "chemical": "chemical weapon"
    },
    {
        " or ": null
    },
    {
        "biological weapon": "biological weapon"
    },
    {
        "s.     The ": null
    },
    {
        "Civil Defence Corps": "civil defence corps"
    },
    {
        " was stood down in Great Britain in 1968 with the tacit realization that nothing practical could be done in the event of an unrestricted nuclear attack. Its neighbors, however, remained committed to Civil Defence, namely the ": null
    },
    {
        "Isle of Man Civil Defence Corps": "isle of man civil defence corps"
    },
    {
        " and ": null
    },
    {
        "Civil Defence Ireland": "civil defence ireland"
    },
    {
        " .     In the United States, the various civil defense agencies were replaced with the ": null
    },
    {
        "Federal Emergency Management Agency": "federal emergency management agency"
    },
    {
        " in 1979. In 2002 this became part of the ": null
    },
    {
        "Department of Homeland Security": "department of homeland security"
    },
    {
        ". The focus was shifted from nuclear war to an all-hazards approach of ": null
    },
    {
        "Comprehensive Emergency Management": "comprehensive emergency management"
    },
    {
        ". ": null
    },
    {
        "Natural disasters": "natural disaster"
    },
    {
        "and the emergence of new threats such as ": null
    },
    {
        "terrorism": "terrorism"
    },
    {
        " have caused attention to be focused away from traditional civil defense and into new forms of civil protection such as ": null
    },
    {
        "emergency management": "emergency management"
    },
    {
        " and ": null
    },
    {
        "homeland security": "homeland security"
    },
    {
        ".       Many ": null
    },
    {
        "countries": "civil defense by country"
    },
    {
        " still maintain a national Civil Defence Corps, usually having a wide brief for assisting in large scale civil emergencies such as flood, earthquake, invasion, or civil disorder.     After the ": null
    },
    {
        "September 11 attacks": "september 11 attacks"
    },
    {
        " in 2001, in the United States the concept of civil defense has been revisited under the umbrella term of ": null
    },
    {
        "homeland security": "homeland security"
    },
    {
        " and all-hazards emergency management.     In ": null
    },
    {
        "Europe": "europe"
    },
    {
        ", the triangle CD logo continues to be widely used. The old U.S. civil defense logo was used in the FEMA logo until 2006 and is hinted at in the United States ": null
    },
    {
        "Civil Air Patrol": "civil air patrol"
    },
    {
        " logo.  Created in 1939 by Charles Coiner of the N. W. Ayer Advertising Agency, it was used throughout World War II and the Cold War era. In 2006, the National Emergency Management Association—a U.S. organization made up of state emergency managers— officially retired the Civil Defense triangle logo, replacing it with a stylised EM .  The name and logo, however, continue to be used by ": null
    },
    {
        "Hawaii": "hawaii"
    },
    {
        " State Civil Defense  and ": null
    },
    {
        "Guam": "guam"
    },
    {
        " Homeland Security/Office of Civil Defense.      The term civil protection is currently widely used within the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " to refer to government-approved systems and resources tasked with protecting the non-combat population, primarily in the event of natural and technological disasters. In recent years there has been emphasis on preparedness for technological disasters resulting from terrorist attack. Within EU countries the term crisis-management emphasizes the political and security dimension rather than measures to satisfy the immediate needs of the population.     In Australia, civil defense is the responsibility of the volunteer-based ": null
    },
    {
        "State Emergency Service": "state emergency service"
    },
    {
        ".     In most former Soviet countries civil defense is the responsibility of governmental ministries, such as Russias ": null
    },
    {
        "Ministry of Emergency Situations": "ministry of emergency situations"
    },
    {
        ".       Relatively small investments in preparation can speed up recovery by months or years and thereby prevent millions of deaths by hunger, cold and disease.  According to ": null
    },
    {
        "human capital": "human capital"
    },
    {
        " theory in ": null
    },
    {
        "economics": "economics"
    },
    {
        ", a countrys population is more valuable than all of the land, factories and other assets that it possesses. People rebuild a country after its destruction, and it is therefore important for the economic security of a country that it protect its people. According to ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", it is important for people to feel as though they are in control of their own destiny, and preparing for uncertainty via civil defense may help to achieve this.     In the United States, the federal civil defense program was authorized by statute and ran from 1951 to 1994. Originally authorized by Public Law 920 of the 81st Congress, it was repealed by Public Law 93-337 in 1994. Small portions of that statutory scheme were incorporated into the ": null
    },
    {
        "Robert T. Stafford Disaster Relief and Emergency Assistance Act": "stafford disaster relief and emergency assistance act"
    },
    {
        " which partly superseded in part, partly amended, and partly supplemented the ": null
    },
    {
        "Disaster Relief Act of 1974": "disaster relief act of 1974"
    },
    {
        " . In the portions of the civil defense statute incorporated into the Stafford Act, the primary modification was to use the term ": null
    },
    {
        "Emergency Preparedness": "emergency preparedness"
    },
    {
        " wherever the term Civil Defence had previously appeared in the statutory language.     An important concept initiated by President ": null
    },
    {
        "Jimmy Carter": "jimmy carter"
    },
    {
        " was the so-called Crisis Relocation Program administered as part of the federal civil defense program. That effort largely lapsed under President Ronald Reagan, who discontinued the Carter initiative because of opposition from areas potentially hosting the relocated population. See  and          Threats to civilians and civilian life include NBC  and others, like the more modern term ": null
    },
    {
        "CBRN": "cbrn"
    },
    {
        " . ": null
    },
    {
        "Threat assessment": "threat assessment"
    },
    {
        " involves studying each threat so that preventative measures can be built into civilian life.     ;Conventional     Refers to conventional explosives. A ": null
    },
    {
        "blast shelter": "blast shelter"
    },
    {
        " designed to protect only from radiation and fallout would be much more vulnerable to conventional explosives. See also ": null
    },
    {
        "fallout shelter": "fallout shelter"
    },
    {
        ".     ;Nuclear     Shelter intended to protect against nuclear blast effects would include thick concrete and other sturdy elements which are resistant to conventional explosives. The biggest threats from a nuclear attack are effects from the blast, fires and radiation. One of the most prepared countries for a nuclear attack is ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ". Almost every building in Switzerland has an abri against the initial nuclear bomb and explosion followed by the fall-out.   Because of this, many people use it as a safe to protect valuables, photos, financial information and so on. Switzerland also has air-raid and nuclear-raid sirens in every village.     ;Dirty Bomb   A radiologically enhanced weapon , or ": null
    },
    {
        "dirty bomb": "dirty bomb"
    },
    {
        " , uses an explosive to spread radioactive material. This is a theoretical risk, and such weapons have not been used by terrorists. Depending on the quantity of the radioactive material, the dangers may be mainly psychological. Toxic effects can be managed by standard ": null
    },
    {
        "hazmat": "dangerous goods"
    },
    {
        " techniques.     ;Biological     The threat here is primarily from disease-causing microorganisms such as bacteria and viruses.     ;Chemical     Various chemical agents are a threat, such as ": null
    },
    {
        "nerve gas": "nerve gas"
    },
    {
        " .                   Mitigation is the process of actively preventing the war or the release of ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s. It includes policy analysis, diplomacy, political measures, ": null
    },
    {
        "nuclear disarmament": "nuclear disarmament"
    },
    {
        " and more military responses such as a ": null
    },
    {
        "National Missile Defense": "national missile defense"
    },
    {
        " and ": null
    },
    {
        "air defense artillery": "air defense artillery"
    },
    {
        ". In the case of counter-terrorism, mitigation would include diplomacy, ": null
    },
    {
        "intelligence": "intelligence"
    },
    {
        " gathering and direct action against terrorist groups. Mitigation may also be reflected in long-term planning such as the design of the ": null
    },
    {
        "interstate highway": "interstate highway"
    },
    {
        " system and the placement of military bases further away from populated areas.         Preparation consists of building ": null
    },
    {
        "blast shelters": "blast shelter"
    },
    {
        "and pre-positioning information, supplies, and emergency infrastructure. For example, most larger cities in the U.S. now have underground emergency operations centers that can perform civil defense coordination. FEMA also has many underground facilities for the same purpose located near major railheads such as the ones in ": null
    },
    {
        "Denton, Texas": "denton, texas"
    },
    {
        " and ": null
    },
    {
        "Mount Weather": "mount weather"
    },
    {
        ", Virginia.     Other measures would include continual government inventories of grain silos, the ": null
    },
    {
        "Strategic National Stockpile": "strategic national stockpile"
    },
    {
        ", the uncapping of the ": null
    },
    {
        "Strategic Petroleum Reserve": "strategic petroleum reserve"
    },
    {
        ", the dispersal of lorry-transportable bridges, water purification, mobile refineries, mobile de-contamination facilities, mobile general and special purpose disaster mortuary facilities such as ": null
    },
    {
        "Disaster Mortuary Operational Response Team": "disaster mortuary operational response team"
    },
    {
        " and ": null
    },
    {
        "DMORT-WMD": "dmort-wmd"
    },
    {
        ", and other aids such as temporary housing to speed civil recovery.     On an individual scale, one means of preparation for exposure to ": null
    },
    {
        "nuclear fallout": "nuclear fallout"
    },
    {
        " is to obtain ": null
    },
    {
        "potassium iodide": "potassium iodide"
    },
    {
        " tablets as a safety measure to protect the human ": null
    },
    {
        "thyroid": "thyroid"
    },
    {
        " gland from the uptake of dangerous radioactive ": null
    },
    {
        "iodine": "iodine"
    },
    {
        ". Another measure is to cover the nose, mouth and eyes with a piece of cloth and sunglasses to protect against ": null
    },
    {
        "alpha particle": "alpha particle"
    },
    {
        "s, which are only an internal hazard.     To support and supplement efforts at national, regional and local level with regard to disaster prevention, the ": null
    },
    {
        "preparedness": "wikt:preparedness"
    },
    {
        " of those responsible for civil protection and the intervention in the event of disaster   To establish a framework for effective and rapid cooperation between different civil protection services when mutual assistance is needed    To set up and implement training programs for intervention and coordination teams as well as assessment experts including joint courses and exchange systems   To enhance the coherence of actions undertaken at international level in the field of civil protection, especially in the context of cooperation     Preparing also includes sharing information:   To contribute to informing the public, in view of increasing citizens level of self-protection   To collect and disseminate validated emergency information   To pool information on national civil protection capabilities, military and medical resources   To ensure efficient information sharing between the different authorities       Response consists first of warning civilians so they can enter ": null
    },
    {
        "fallout shelters": "fallout shelter"
    },
    {
        "and protect assets.     Staffing a response is always full of problems in a civil defense emergency. After an attack, conventional full-time emergency services are dramatically overloaded, with conventional fire fighting response times often exceeding several days. Some capability is maintained by local and state agencies, and an emergency reserve is provided by specialized military units, especially ": null
    },
    {
        "civil affairs": "civil affairs"
    },
    {
        ", ": null
    },
    {
        "Military Police": "military police"
    },
    {
        ", ": null
    },
    {
        "Judge Advocates": "judge advocate"
    },
    {
        "and ": null
    },
    {
        "combat engineer": "combat engineer"
    },
    {
        "s.     However, the traditional response to massed attack on civilian population centers is to maintain a mass-trained force of volunteer emergency workers. Studies in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " showed that lightly trained civilians in organised teams can perform up to 95% of emergency activities when trained, liaised and supported by local government. In this plan, the populace rescues itself from most situations, and provides information to a central office to prioritize professional emergency services.     In the 1990s, this concept was revived by the ": null
    },
    {
        "Los Angeles Fire Department": "los angeles fire department"
    },
    {
        " to cope with civil emergencies such as ": null
    },
    {
        "earthquake": "earthquake"
    },
    {
        "s. The program was widely adopted, providing standard terms for organization. In the U.S., this is now official federal policy, and it is implemented by ": null
    },
    {
        "community emergency response team": "community emergency response team"
    },
    {
        "s, under the Department of Homeland Security, which certifies training programs by local governments, and registers certified disaster service workers who complete such training.         Recovery consists of rebuilding damaged infrastructure, buildings and production. The recovery phase is the longest and ultimately most expensive phase. Once the immediate crisis has passed, cooperation fades away and recovery efforts are often politicized or seen as economic opportunities.     Preparation for recovery can be very helpful. If mitigating resources are dispersed before the attack, cascades of social failures can be prevented. One hedge against bridge damage in riverine cities is to subsidize a tourist ferry that performs scenic cruises on the river. When a bridge is down, the ferry takes up the load.          Civil Defense is also the name of a number of organizations around the world dedicated to protecting civilians from military attacks, as well as to providing rescue services after natural and human-made disasters alike.     Worldwide protection is managed by the ": null
    },
    {
        "United Nations Office for the Coordination of Humanitarian Affairs": "united nations office for the coordination of humanitarian affairs"
    },
    {
        " .     In a few countries such as ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " and ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " , civil defense is essentially the same organization  as the ": null
    },
    {
        "fire brigade": "fire brigade"
    },
    {
        ". In most countries, however, civil defense is a government-managed, volunteer-staffed organization, separate from the fire brigade and the ": null
    },
    {
        "ambulance": "ambulance"
    },
    {
        " service.     As the threat of Cold War eased, a number of such civil defense organizations have been disbanded or mothballed , while others have changed their focuses into providing rescue services after natural disasters . However, the ideals of Civil Defense  have been brought back in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " under FEMAs ": null
    },
    {
        "Citizen Corps": "citizen corps"
    },
    {
        " and ": null
    },
    {
        "Community Emergency Response Team": "community emergency response team"
    },
    {
        " .     In the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " Civil Defence work is carried out by Emergency Responders under the ": null
    },
    {
        "Civil Contingencies Act 2004": "civil contingencies act 2004"
    },
    {
        ", with assistance from voluntary groups such as ": null
    },
    {
        "RAYNET": "raynet"
    },
    {
        ", ": null
    },
    {
        "Search and Rescue": "search and rescue"
    },
    {
        " Teams and ": null
    },
    {
        "4x4 Response": "4x4 response"
    },
    {
        ". In ": null
    },
    {
        "Ireland": "republic of ireland"
    },
    {
        ", the ": null
    },
    {
        "Civil Defence": "civil defence ireland"
    },
    {
        " is still very much an active organization and is occasionally called upon for its Auxiliary Fire Service and ambulance/rescue services when emergencies such as ": null
    },
    {
        "flash flooding": "flash flooding"
    },
    {
        " occur and require additional manpower. The organization has units of trained ": null
    },
    {
        "firemen": "firemen"
    },
    {
        " and ": null
    },
    {
        "medical responders": "medical responder"
    },
    {
        "based in key areas around the country.        ": null
    },
    {
        "Albanian Civil Protection": "albanian civil protection"
    },
    {
        " State Emergency Service": "state emergency service"
    },
    {
        " – ": null
    },
    {
        "Australia": "australia"
    },
    {
        " Belgian Civil Protection": "belgian civil protection"
    },
    {
        " – ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " Defesa Civil": "defesa civil"
    },
    {
        " – ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " Cyprus Civil Defence": "cyprus civil defence"
    },
    {
        " Population Protection": "population protection"
    },
    {
        " – ": null
    },
    {
        "Czech Republic": "czech republic"
    },
    {
        " Beredskabsstyrelsen, or the Emergency Management Agency": "danish emergency management agency"
    },
    {
        " – ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        " Protección Civil": "civil protection"
    },
    {
        " - ": null
    },
    {
        "El Salvador": "el salvador"
    },
    {
        " Civil defense in Finland": "civil defense in finland"
    },
    {
        " Sécurité Civile": "sécurité civile"
    },
    {
        " – ": null
    },
    {
        "France": "france"
    },
    {
        " General Secretariat for Civil Protection": "general secretariat for civil protection"
    },
    {
        " – ": null
    },
    {
        "Greece": "greece"
    },
    {
        " Civil Aid Service": "civil aid service"
    },
    {
        " – ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " Civil Defence of India": "civil defence of india"
    },
    {
        " – ": null
    },
    {
        "India": "india"
    },
    {
        " Civil Defence Harir in Kurdistan": "civil defence harir in kurdistan"
    },
    {
        " – ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        " Civil Defence Ireland": "civil defence ireland"
    },
    {
        " Isle of Man Civil Defence Corps": "isle of man civil defence corps"
    },
    {
        " Civil defense in Israel": "civil defense in israel"
    },
    {
        " Protezione Civile": "protezione civile"
    },
    {
        " – ": null
    },
    {
        "Italy": "italy"
    },
    {
        " Malaysian Civil Defence Department": "malaysian civil defence department"
    },
    {
        " Protección Civil": "protección civil"
    },
    {
        " – ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " Corps des Sapeurs-Pompiers": "corps des sapeurs-pompiers"
    },
    {
        " – ": null
    },
    {
        "Monaco": "monaco"
    },
    {
        "    Civil Defence ": "civil defence"
    },
    {
        "    Nigeria security and civil defence corps": "nigeria security and civil defence corps"
    },
    {
        " – ": null
    },
    {
        "Nigeria": "nigeria"
    },
    {
        " Norwegian Civil Defence": "norwegian civil defence"
    },
    {
        " Panama Civil Defense Seismic Network": "panama civil defense seismic network"
    },
    {
        " Portugal": "portugal"
    },
    {
        " – ": null
    },
    {
        "Autoridade Nacional de Proteção Civil": "autoridade nacional de proteção civil"
    },
    {
        ":  ": null
    },
    {
        "Civil Police": "civil police"
    },
    {
        " – ": null
    },
    {
        "San Marino": "san marino"
    },
    {
        "    Singapore Civil Defence Force": "singapore civil defence force"
    },
    {
        "     UK: ": null
    },
    {
        "Civil Defence Corps": "civil defence corps"
    },
    {
        " 4x4 Response": "4x4 response"
    },
    {
        " UKs National Attack Warning System": "handel"
    },
    {
        " Royal Observer Corps": "royal observer corps"
    },
    {
        "     US: ": null
    },
    {
        "Civil Air Patrol": "civil air patrol"
    },
    {
        " United States civil defense": "united states civil defense"
    },
    {
        " United States civil defense association": "united states civil defense association"
    },
    {
        " Comprehensive Emergency Management": "comprehensive emergency management"
    },
    {
        " Federal Emergency Management Agency": "federal emergency management agency"
    },
    {
        " CONELRAD": "conelrad"
    },
    {
        " Duck and cover": "duck and cover"
    },
    {
        "     Germany: ": null
    },
    {
        "Technisches Hilfswerk": "technisches hilfswerk"
    },
    {
        " Katastrophenschutz": ":de:katastrophenschutz"
    },
    {
        " DRK": "deutsches rotes kreuz"
    },
    {
        " ASB": "arbeiter-samariter-bund deutschland"
    },
    {
        " DLRG": "german life saving association"
    },
    {
        " Feuerwehr": "german fire services"
    },
    {
        " Johanniter": "johanniter-unfall-hilfe"
    },
    {
        " Malteser": "malteser international"
    },
    {
        " Bergwacht": "bergwacht"
    },
    {
        " Verkehrswacht": "verkehrswacht"
    },
    {
        " Seenotretter": "seenotretter"
    }
]