[
    {
        "In ": null
    },
    {
        "set theory": "Set Theory"
    },
    {
        " and its applications throughout ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", a class is a collection of ": null
    },
    {
        "sets": "Set"
    },
    {
        " that can be unambiguously defined by a property that all its members share. The precise definition of class depends on foundational context. In work on ": null
    },
    {
        "Zermelo–Fraenkel set theory": "Zermelo–Fraenkel Set Theory"
    },
    {
        ", the notion of class is informal, whereas other set theories, such as ": null
    },
    {
        "von Neumann–Bernays–Gödel set theory": "Von Neumann–Bernays–Gödel Set Theory"
    },
    {
        ", axiomatize the notion of proper class , e.g., as entities that are not members of another entity.     A class that is not a set is called a proper class, and a class that is a set is sometimes called a small class. For instance, the class of all ": null
    },
    {
        "ordinal number": "Ordinal Number"
    },
    {
        "s, and the class of all sets, are proper classes in many formal systems.     In Quines set-theoretical writing, the phrase ultimate class is often used instead of the phrase proper class emphasising that in the systems he considers, certain classes cannot be members, and are thus the final term in any membership chain to which they belong.     Outside set theory, the word class is sometimes used synonymously with set . This usage dates from a historical period where classes and sets were not distinguished as they are in modern set-theoretic terminology. Many discussions of classes in the 19th century and earlier are really referring to sets, or perhaps rather take place without considering that certain classes can fail to be sets.       The collection of all algebraic objects of a given type will usually be a proper class. Examples include the class of all ": null
    },
    {
        "group": "Group"
    },
    {
        "s, the class of all ": null
    },
    {
        "vector space": "Vector Space"
    },
    {
        "s, and many others. In ": null
    },
    {
        "category theory": "Category Theory"
    },
    {
        ", a category whose collection of objects forms a proper class  is called a ": null
    },
    {
        "large category": "Large Category"
    },
    {
        ".     The ": null
    },
    {
        "surreal numbers": "Surreal Number"
    },
    {
        "are a proper class of objects that have the properties of a ": null
    },
    {
        "field": "Field"
    },
    {
        ".     Within set theory, many collections of sets turn out to be proper classes. Examples include the class of all sets, the class of all ordinal numbers, and the class of all cardinal numbers.     One way to prove that a class is proper is to place it in ": null
    },
    {
        "bijection": "Bijection"
    },
    {
        " with the class of all ordinal numbers. This method is used, for example, in the proof that there is no ": null
    },
    {
        "free": "Free Latticethe Complete Free Lattice"
    },
    {
        " complete lattice": "Complete Latticefree Complete Lattices"
    },
    {
        " on three or more ": null
    },
    {
        "generators": "Generator"
    },
    {
        ".       The ": null
    },
    {
        "paradoxes of naive set theory": "Naive Set Theoryparadoxes"
    },
    {
        " can be explained in terms of the inconsistent ": null
    },
    {
        "tacit assumption": "Tacit Assumption"
    },
    {
        " that all classes are sets . With a rigorous foundation, these paradoxes instead suggest ": null
    },
    {
        "proofs": "Proof"
    },
    {
        "that certain classes are proper . For example, ": null
    },
    {
        "Russells paradox": "Russells Paradox"
    },
    {
        " suggests a proof that the class of all sets which do not contain themselves is proper, and the ": null
    },
    {
        "Burali-Forti paradox": "Burali-Forti Paradox"
    },
    {
        " suggests that the class of all ": null
    },
    {
        "ordinal numbers": "Ordinal Numbers"
    },
    {
        " is proper. The paradoxes do not arise with classes because there is no notion of classes containing classes. Otherwise, one could, for example, define a class of all classes that do not contain themselves, which would lead to a Russell paradox for classes. A ": null
    },
    {
        "conglomerate": "Conglomerate"
    },
    {
        ", on the other hand, can have proper classes as members, although the theory of conglomerates is not yet well-established.         ": null
    },
    {
        "ZF set theory": "Zf Set Theory"
    },
    {
        " does not formalize the notion of classes, so each formula with classes must be reduced syntactically to a formula without classes.  For example, one can reduce the formula A \\ to \\forall x . Semantically, in a ": null
    },
    {
        "metalanguage": "Metalanguage"
    },
    {
        ", the classes can be described as equivalence classes of logical formulas: If \\mathcal A is a ": null
    },
    {
        "structure": "Structure"
    },
    {
        " interpreting ZF, then the object language class builder expression \\ is interpreted in \\mathcal A by the collection of all the elements from the domain of \\mathcal A on which \\lambda x\\phi holds; thus, the class can be described as the set of all predicates equivalent to \\phi . In particular, one can identify the class of all sets with the set of all predicates equivalent to x x.     Because classes do not have any formal status in the theory of ZF, the axioms of ZF do not immediately apply to classes. However, if an ": null
    },
    {
        "inaccessible cardinal": "Inaccessible Cardinal"
    },
    {
        " \\kappa is assumed, then the sets of smaller rank form a model of ZF , and its subsets can be thought of as classes .     In ZF, the concept of a ": null
    },
    {
        "function": "Function"
    },
    {
        " can also be generalised to classes. A class function is not a function in the usual sense, since it is not a set; it is rather a formula \\Phi with the property that for any set x there is no more than one set y such that the pair satisfies \\Phi. For example, the class function mapping each set to its successor may be expressed as the formula y x \\cup \\. The fact that the ordered pair satisfies \\Phi may be expressed with the shorthand notation \\Phi y.     Another approach is taken by the ": null
    },
    {
        "von Neumann–Bernays–Gödel axioms": "Von Neumann–Bernays–Gödel Axioms"
    },
    {
        " ; classes are the basic objects in this theory, and a set is then defined to be a class that is an element of some other class. However, the class existence axioms of NBG are restricted so that they only quantify over sets, rather than over all classes. This causes NBG to be a ": null
    },
    {
        "conservative extension": "Conservative Extension"
    },
    {
        " of ZF.     ": null
    },
    {
        "Morse–Kelley set theory": "Morse–Kelley Set Theory"
    },
    {
        " admits proper classes as basic objects, like NBG, but also allows quantification over all proper classes in its class existence axioms. This causes MK to be strictly stronger than both NBG and ZF.     In other set theories, such as ": null
    },
    {
        "New Foundations": "New Foundations"
    },
    {
        " or the theory of ": null
    },
    {
        "semiset": "Semiset"
    },
    {
        "s, the concept of proper class still makes sense but the criterion of sethood is not closed under subsets. For example, any set theory with a universal set has proper classes which are subclasses of sets.       ": null
    }
]