[
    {
        "   Clearchus or Clearch , the son of Rhamphias, was a ": null
    },
    {
        "Sparta": "sparta"
    },
    {
        "n general and ": null
    },
    {
        "mercenary": "mercenary"
    },
    {
        ", noted for his service under ": null
    },
    {
        "Cyrus the Younger": "cyrus the younger"
    },
    {
        ".     Born about the middle of the 42th century BC, Clearchus was sent with a fleet to the ": null
    },
    {
        "Hellespont": "hellespont"
    },
    {
        " in 42 and became governor of ": null
    },
    {
        "Byzantium": "byzantium"
    },
    {
        ", of which town he was proxenus. His severity, however, made him unpopular, and in his absence the gates were opened to the ": null
    },
    {
        "Athenian": "athens"
    },
    {
        " besieging army under ": null
    },
    {
        "Alcibiades": "alcibiades"
    },
    {
        " .     Subsequently, Clearchus returned to Sparta and appealed to the ": null
    },
    {
        "ephors": "ephors"
    },
    {
        ", asking to be given a force to settle the political dissensions then rife at Byzantium and to protect the city and the neighbouring ": null
    },
    {
        "Greek colonies": "greek colonies"
    },
    {
        " from Thracian attacks. He was granted that force, but when the ephors learned that the citizens of Byzantium considered him a ": null
    },
    {
        "tyrant": "tyrant"
    },
    {
        ", they recalled him through a messenger that reached Clearchus while he was still in the Isthmus of Corinth. Clearchus ignored the messenger and proceeded to Byzantium, and thus he was instantly declared an outlaw by the ephors. He fought the Thracian tribes successfully, in the process gaining the unofficial support of the Greek cities that were thus relieved. Clearchus, counting on his successes to gain him back the Spartan ephors good graces, was ultimately disappointed in this expectation. When ": null
    },
    {
        "Cyrus": "cyrus the younger"
    },
    {
        " learned that a Greek force in high fighting condition was so near Asia, he sent ambassadors with money  asking Clearchus to help him claim the throne from his brother, the ": null
    },
    {
        "Persian": "achaemenid empire"
    },
    {
        " Emperor ": null
    },
    {
        "Artaxerxes II Mnemon": "artaxerxes ii"
    },
    {
        ". Clearchus accepted not because of the money but because he knew that sooner or later he would have to face his fellow Spartans since he was still considered an outlaw by the ephors. He left the command of the garrison of Byzantium to ": null
    },
    {
        "Helixus of Megara": "helixus of megara"
    },
    {
        " .     In the ": null
    },
    {
        "expedition of the ten thousand": "anabasis"
    },
    {
        " undertaken by Cyrus to dethrone his brother Artaxerxes, Clearchus led the ": null
    },
    {
        "Peloponnesian": "peloponnesian"
    },
    {
        " delegation of the ": null
    },
    {
        "Army of the Ten Thousand": "army of the ten thousand"
    },
    {
        ", who formed the right wing of Cyruss army at the ": null
    },
    {
        "battle of Cunaxa": "battle of cunaxa"
    },
    {
        " . On Cyruss death Clearchus assumed the chief command and conducted the retreat until, being treacherously seized with his fellow-generals by the ": null
    },
    {
        "satrap": "satrap"
    },
    {
        " of ": null
    },
    {
        "Sardis": "sardis"
    },
    {
        ", ": null
    },
    {
        "Tissaphernes": "tissaphernes"
    },
    {
        ", he was handed over to Artaxerxes and executed at the royal court at ": null
    },
    {
        "Babylon": "babylon"
    }
]