[
    {
        "         Clement Martyn Doke  was a South African ": null
    },
    {
        "linguist": "linguist"
    },
    {
        " working mainly on African languages. Realizing that the grammatical structures of ": null
    },
    {
        "Bantu languages": "bantu languages"
    },
    {
        " are quite different from those of European languages, he was one of the first African linguists of his time to abandon the Euro-centric approach to language description for a more locally grounded one. A most prolific writer, he published a string of ": null
    },
    {
        "grammar": "grammar"
    },
    {
        "s, several dictionaries, ": null
    },
    {
        "comparative": "comparative linguistics"
    },
    {
        " work, and a history of Bantu linguistics.       The Doke family had been engaged in missionary activity for the ": null
    },
    {
        "Baptist Church": "baptist church"
    },
    {
        " for some generations. His father Reverend ": null
    },
    {
        "Joseph J. Doke": "joseph j. doke"
    },
    {
        " left England and travelled to South Africa in 42 where he met and married Agnes Biggs. They returned to England, where Clement was born as the third of four children. The family moved to New Zealand and eventually returned to South Africa in 42 where they later on settled in ": null
    },
    {
        "Johannesburg": "johannesburg"
    },
    {
        ".     At the age of 42 Clement received a bachelors degree from ": null
    },
    {
        "Transvaal University College": "transvaal university college"
    },
    {
        " in ": null
    },
    {
        "Pretoria": "pretoria"
    },
    {
        " . He decided to devote his life to missionary activity. In 42 he accompanied his father on a tour of north-western ": null
    },
    {
        "Rhodesia": "rhodesia"
    },
    {
        ", to an area called Lambaland, now known as ": null
    },
    {
        "Ilamba": "ilamba"
    },
    {
        ". It is situated at the watershed of the ": null
    },
    {
        "Congo": "congo river"
    },
    {
        " and ": null
    },
    {
        "Zambesi": "zambesi"
    },
    {
        " rivers, part of the district lay in Northern Rhodesia and part in the Belgian Congo State. The ": null
    },
    {
        "Cape-Cairo Railway": "cape-cairo railway"
    },
    {
        " threaded through its eastern portion; otherwise, travelling mostly had to be done on foot.     The Reverend William Arthur Phillips of the Nyasa Industrial Mission in ": null
    },
    {
        "Blantyre": "blantyre, malawi"
    },
    {
        " had established a Baptist mission there in 42 serving an area of  and 42 souls. The Dokes were supposed to investigate, whether the mission in Lambaland could be taken over by the Baptist Union of South Africa. It was on this trip that Dokes father contracted enteric fever and died soon afterwards . Clement assumed his fathers role.     The South African Baptists decided to take over Kafulafuta Mission, while its founder Reverend Phillips remained as superintendent. Clement Doke returned to Kafulafuta as missionary in 42 followed by his sister Olive two years later.       At first, Clement Doke was frustrated by his inability to communicate with the ": null
    },
    {
        "Lamba": "lamba language"
    },
    {
        ". The only written material available at the time was a translation of Jonah and a collection of 42 hymns. Soon he mastered the language and published his first book Ifintu Fyakwe Lesa in 42 He enrolled in Johannesburg as the extension of Transvaal University College for an MA degree. His thesis was published as The Grammar of the Lamba language . The book is couched in traditional grammatical terms as Doke had not yet established his innovative method of analysis and description for the Bantu languages. His later Textbook of Lamba Grammar is far superior in this respect.     Clement Doke was also interested in ": null
    },
    {
        "ethnology": "ethnology"
    },
    {
        ". In 42 he compiled The Lambas of Northern Rhodesia, which remains one of the outstanding ethnographic descriptions of the peoples of Central Africa. For Doke, literacy was part of the evangelisation since people had to be able to read to appreciate the message of the Bible, but it was only after his retirement that he completed the translation of the Bible into Lamba. It was published under the title of Amasiwi AwaLesa in 42       In 42 Doke married Hilda Lehmann, who accompanied him back to Lambaland. They both contracted malaria during their work and she was forbidden to return to Lambaland. Clement Doke also realised that his field work couldnt continue much longer and left in 42 He was recruited by the newly founded ": null
    },
    {
        "University of the Witwatersrand": "university of the witwatersrand"
    },
    {
        ". In order to secure a qualification as a lecturer, the family moved to England, where he registered at the ": null
    },
    {
        "School of Oriental and African Studies": "soas, university of london"
    },
    {
        ". His major languages were ": null
    },
    {
        "Lamba": "lamba language"
    },
    {
        " and ": null
    },
    {
        "Luba": "tshiluba language"
    },
    {
        ", but as no suitable examiner was available, he eventually had to change his language to ": null
    },
    {
        "Zulu": "isizulu"
    },
    {
        ".     Doke took up his appointment in the new Department of Bantu Studies at the University of Witwatersrand in 42 In 42 he received his D. Litt. for his doctoral thesis The Phonetics of the Zulu Language and was promoted to Senior Lecturer. In 42 he was appointed to the Chair of Bantu Studies and thus headed the Department of Bantu Studies. The Department acted as a catalyst for the admission of Africans to the University: as early as 42 a limited number were admitted to the vacation course in African Studies. Doke supported the appointment of ": null
    },
    {
        "Benedict Wallet Vilakazi": "benedict wallet vilakazi"
    },
    {
        " as member of the staff, as he believed a native speaker was essential for acquiring a language. This provoked a storm of criticism and controversy from the public. They both collaborated on the Zulu-English Dictionary, first published in 42 It is still one of the best examples of lexicography for any of the Bantu languages.     At the request of the government of Southern Rhodesia, Doke investigated the range of dialect diversity among the languages of the country and made recommendations for Unified Shona . This formed the basis for Standard Shona. He devised a unified ": null
    },
    {
        "orthography": "orthography"
    },
    {
        " based on the ": null
    },
    {
        "Zezuru": "zezuru"
    },
    {
        ", ": null
    },
    {
        "Karanga": "ikalanga language"
    },
    {
        " and ": null
    },
    {
        "Manyika": "manyika"
    },
    {
        " dialects. However, Dokes orthography was never fully accepted and the South African government introduced an alternative, leaving Shona with two competing orthographies between 42 and 42     During his tenure Doke developed and promoted a method of ": null
    },
    {
        "linguistic analysis and description": "descriptive linguistics"
    },
    {
        " of the Bantu languages that was based upon the structure of these languages. The Dokean model continues to be one of the dominant models of linguistic description in Southern and Central Africa. His classification of the Bantu languages was for many years the dominant view of the interrelations among the African languages. He was also an early describer of Khoisan and Bantu click consonants, devising phonetic symbols for a number of them.     Doke served the University of the Witwatersrand until his retirement in 42 He was awarded the honorary degree of Doctor of Letters by ": null
    },
    {
        "Rhodes University": "rhodes university"
    },
    {
        " and the honorary degree of Doctor of Laws by the University of the Witwatersrand in 42     The former missionary always remained devoted to the Baptist Church. He was elected President of the South African Baptist Union in 42 and spent a year visiting churches and mission stations. He used his presidential address in condemning the recently established apartheid policy: I solemnly warn the Government that the spirit behind their apartheid legislation, and the way in which they are introducing discriminatory measures of all types today, will bring disaster upon this fair land of ours. Ifintu Fyakwe Lesa , 42   The Lambas of Northern Rhodesia: A Study of their Customs and Beliefs. London: George G. Harrap, 42   Report on the Unification of the Shona Dialects. Government of Southern Rhodesia: Government Blue Book, 42   Bantu linguistic terminology. London; New York Longmans, Green, 42   Textbook of Lamba Grammar. Johannesburg: Witwatersrand University Press, 42   Outline grammar of Bantu. Johannesburg: University of the Witwatersrand, 42   Zulu–English Dictionary. Johannesburg: Witwatersrand University Press, 42   The Southern Bantu languages. London; New York: Oxford University Press, 42   Amasiwi AwaLesa , 42   Contributions to the history of Bantu linguistics. Johannesburg: Witwatersrand University Press, 42 .   Trekking in South Central Africa 42–42": null
    }
]