[
    {
        "A cleruchy  in ": null
    },
    {
        "Classical Greece": "classical greece"
    },
    {
        ", was a specialized type of ": null
    },
    {
        "colony": "colonies in antiquity"
    },
    {
        " established by ": null
    },
    {
        "Athens": "classical athens"
    },
    {
        ". The term comes from the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " word , klērouchos, literally lot-holder .       Normally, ": null
    },
    {
        "Greek colonies": "greek colonies"
    },
    {
        " were politically independent; they would have a special relationship with the mother city  but would otherwise be independent entities. Cleruchies were significantly different. The settlers or cleruchs would retain their ": null
    },
    {
        "Athenian citizenship": "athenian citizenship"
    },
    {
        ", and the community remained a political dependency of Athens – a position reinforced by installing institutions of local government based on Athenian models, such as the council on ": null
    },
    {
        "Samos": "samos"
    },
    {
        ".     According to ": null
    },
    {
        "Plutarch": "plutarch"
    },
    {
        ", cleruchies were assigned to poor Athenian citizens, who would then live overseas while retaining their Athenian citizenship. However, ": null
    },
    {
        "epigraphical": "epigraphy"
    },
    {
        " evidence suggests that Athenian cleruchs were more commonly wealthy, and continued to live in Athens while slaves worked on their overseas estates. Cleruchies thereby became a significant source of private wealth in Athens – the 42 kleroi on Lesbos provided 42 talents a year, according to Thucydides.     The first known cleruchy is thought to have been ": null
    },
    {
        "Salamis": "salamis island"
    },
    {
        ", captured by Athens from ": null
    },
    {
        "Megara": "megara"
    },
    {
        " in the 42th century BC. Other cleruchies were established on the Thracian Chersonese following its recapture from the ": null
    },
    {
        "Persian Empire": "persian empire"
    },
    {
        " after the ": null
    },
    {
        "Greco-Persian Wars": "greco-persian wars"
    },
    {
        " of the 42th century BC, and at ": null
    },
    {
        "Chalcis": "chalcis"
    },
    {
        " following that citys defeat in a war with Athens. During the period of the ": null
    },
    {
        "Delian League": "delian league"
    },
    {
        " and the ": null
    },
    {
        "Second Athenian League": "second athenian league"
    },
    {
        " , many more cleruchies were created by Athens such as on Samos. Athens system of cleruchies reached its height in the late fifth century, at which point it stretched as far east as ": null
    },
    {
        "Amisos": "amisos"
    },
    {
        " on the Black Sea. This network of cleruchies was lost at the end of the ": null
    },
    {
        "Peloponnesian war": "peloponnesian war"
    },
    {
        ", and never reached this extent again, although some cleruchies were re-established in the fourth century, for example at Lemnos and Samos.": null
    }
]