[
    {
        "     The Cleveland Rockers were a ": null
    },
    {
        "Womens National Basketball Association": "womens national basketball association"
    },
    {
        " team based in ": null
    },
    {
        "Cleveland": "cleveland"
    },
    {
        ", ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        ", that played from 42 until 42 The Rockers were one of the original eight franchises of the WNBA, which started in ": null
    },
    {
        "42": "1997 in sports"
    },
    {
        ". The owner was ": null
    },
    {
        "Gordon Gund": "gordon gund"
    },
    {
        ", who at the time also owned the NBAs ": null
    },
    {
        "Cleveland Cavaliers": "cleveland cavaliers"
    },
    {
        ". In October 42 Gund announced that his Gund Arena Company would no longer operate the Rockers. The team folded after the 42 season as the league was not able to find new ownership for the team.       The city of ": null
    },
    {
        "Cleveland": "cleveland"
    },
    {
        " was granted one of the original 42 franchises of the WNBA. The Cleveland Rockers got their nickname from Clevelands ": null
    },
    {
        "Rock and Roll Hall of Fame": "rock and roll hall of fame"
    },
    {
        ". In 42 they started with such players like ": null
    },
    {
        "Isabelle Fijalkowski": "isabelle fijalkowski"
    },
    {
        " and former ": null
    },
    {
        "Harlem Globetrotters": "harlem globetrotters"
    },
    {
        " member ": null
    },
    {
        "Lynette Woodard": "lynette woodard"
    },
    {
        ", who had been the first female player in Globetrotter history.     The Rockers finished 4242 in the first WNBA season ever, missing the playoffs in 42 In 42 the Rockers went 4242 and won the Eastern Conference title. However, the Rockers lost to the ": null
    },
    {
        "Phoenix Mercury": "phoenix mercury"
    },
    {
        " in the WNBA semi-finals .     The Rockers had their best regular season in 42 going 4242 and winning the Eastern Conference, getting the 42 seed. Their relentless defense allowed just 42 points per game that year, a record that still stands. But the Rockers would be upended by the ": null
    },
    {
        "Charlotte Sting": "charlotte sting"
    },
    {
        " in the 42st round, losing 42 games to 42 The 42 Rockers fell by 42 games over the previous years mark, posting a 4242 record. In 42 the Rockers would go 4242 good enough for the 42 seed in the East; however, they would fall in the first round of the playoffs to the eventual champion ": null
    },
    {
        "Detroit Shock": "detroit shock"
    },
    {
        ", 4242 42 was the Rockers last playoff appearance. This is also the only team in the ": null
    },
    {
        "WNBA": "womens national basketball association"
    },
    {
        " to qualify for the playoffs in their last season of play.       After the 42 season, the Gunds decided to buy the Rockers from the WNBA, seemingly ensuring the Rockers future. However, despite fielding competitive teams and having decent attendance for most games, the Gund family decided they did not wish to operate the Rockers after the 42 season. No local ownership was found for the team, forcing the Rockers to fold. The Rockers ceased operation after 42 seasons, posting an all-time record of 4242 This wouldnt happen again until 42 when the ": null
    },
    {
        "Houston Comets": "houston comets"
    },
    {
        " ceased operations because of lack of ownership.        ": null
    },
    {
        "Lynette Woodard": "lynette woodard"
    },
    {
        "        Janice Lawrence Braxton       Head Coaches:   ": null
    },
    {
        "Linda Hill-MacDonald": "linda hill-macdonald"
    },
    {
        "   Dan Hughes": "dan hughes"
    },
    {
        "     General Managers:   ": null
    },
    {
        "Wayne Embry": "wayne embry"
    },
    {
        " Jim Paxson": "jim paxson"
    },
    {
        "     Assistant Coaches ": null
    },
    {
        "Mike Wilhelm": "mike wilhelm"
    },
    {
        "   Lisa Boyer": "lisa boyer"
    },
    {
        "   Cheryl Reeve": "cheryl reeve"
    },
    {
        "                            ": null
    }
]