[
    {
        "In the game of ": null
    },
    {
        "poker": "poker"
    },
    {
        ", a betting round is said to be closed if no player will have the right to ": null
    },
    {
        "raise": "raise"
    },
    {
        " in the round. Normally this occurs when a player calls, and the next player whose turn it is to act is the one who made the last raise, so he cannot raise further . The round can also said to be closed before it has actually ended if there are still players remaining to act, but they will not be entitled to raise either because the last raise was a sub-minimum all-in raise  or because the limit on allowed raises has been reached.     The term is also used to describe a category of poker game in which no cards held by individual players are visible to any other player before the ": null
    },
    {
        "showdown": "showdown"
    },
    {
        ". Most forms of ": null
    },
    {
        "draw poker": "draw poker"
    },
    {
        " are closed games . Most forms of ": null
    },
    {
        "stud poker": "stud poker"
    },
    {
        ", in contrast, are ": null
    },
    {
        "open": "open"
    },
    {
        " games, because some players cards are dealt face up or are exposed during play . Most ": null
    },
    {
        "community card poker": "community card poker"
    },
    {
        " games like ": null
    },
    {
        "Texas hold em": "texas hold em"
    },
    {
        " are considered closed as well, because the only cards exposed before showdown belong to everyone; the individual players cards are never seen until showdown.       A player who closes the betting round by calling or ": null
    },
    {
        "overcall": "glossary_of_poker_termsovercall"
    },
    {
        "ing is entitled to greater freedom by doing so, since he does not face the threat of subsequent raises. This is especially true when comparing limit holdem games with a standard cap to an elevated cap or capless game. A player can cap with as much as 42% of his ": null
    },
    {
        "flat call": "smooth call"
    },
    {
        "ing range when he knows he cannot be forced out of the pot and no opponent can make his hand appear much stronger by raising. This is particularly correct when closing the action on the ": null
    },
    {
        "river": "river"
    },
    {
        " in Texas holdem or on the 42th street in stud poker, where a player can make calldowns with hands that are unlikely to win simply because of the ": null
    },
    {
        "pot odds": "pot odds"
    },
    {
        " he is getting and the fact he cannot be ": null
    },
    {
        "bluff": "bluff"
    }
]