[
    {
        "     The Château du Clos Lucé , formerly called Manoir du Cloux, is a large ": null
    },
    {
        "château": "château"
    },
    {
        " located in the center of ": null
    },
    {
        "Amboise": "amboise"
    },
    {
        ", in the department of ": null
    },
    {
        "Indre-et-Loire": "indre-et-loire"
    },
    {
        ", in the ": null
    },
    {
        "Centre-Val de Loire": "centre-val de loire"
    },
    {
        " region. It is located in the natural ": null
    },
    {
        "Val de Loire": "loire valley"
    },
    {
        " region. Built by Hugues dAmboise in 42 the palace has known several famous owners such as the French king ": null
    },
    {
        "Charles VIII": "charles viii of france"
    },
    {
        " and ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        ". Clos Lucé is 42 metres from the royal ": null
    },
    {
        "Château dAmboise": "château damboise"
    },
    {
        ", to which it is connected by an underground passageway.     King Charles VIII bought the home from Etienne Le Loup in 42 and during this time it became known as the ‘summer house’, housing ": null
    },
    {
        "French royalty": "list of french monarchs"
    },
    {
        ". After a few decades ": null
    },
    {
        "Francis I": "francis i of france"
    },
    {
        " gave it to Leonardo da Vinci when he invited him to live in France in 42 The old painter lived his last years in this house, until his death on 42 May 42     Thanks to its illustrious owners, this house today ranks as a ‘": null
    },
    {
        "historical monument": "monument"
    },
    {
        "’ and therefore is protected from demolition or reconstruction. After 42 it became a well-known museum about Leonardo da Vincis life, work and memory, which was put together and directed by The Saint-Bris family, the final owners of the property.           The house was built on ancient Gallo-Roman foundations and organized around an octagonal tower, within which a spiral staircase stood. Around the spiral staircase were two building that had two floors each. The elegant facade made with pink bricks and whites stones was typical of the XVth century. Formally called Château de Cloux, the building was property of the ": null
    },
    {
        "Chateau D’Amboise": "château damboise"
    },
    {
        ", and the lands of Lucé were annexed to the castle from the XIVth century.      For a short time the building housed religious people of the abbaye of Moncé, as they resided in the building until 42 The Clos Lucé was then sold on 42 May to Etienne le Loup, who was ": null
    },
    {
        "Louis XI": "louis xi of france"
    },
    {
        " Counselor and Amboise ": null
    },
    {
        "beadle": "beadle"
    },
    {
        ". The building was in ruin when Etienne acquired the lands, he restored it giving it the famous visual aspect that we see today - a square tower with ": null
    },
    {
        "Gothic": "gothic architecture"
    },
    {
        " windows that created a  towering and well protected ": null
    },
    {
        "medieval fortress": "medieval fortification"
    },
    {
        ".     On the 42 July 42 ": null
    },
    {
        "Charles VIII": "charles viii of france"
    },
    {
        " bought the castle from Etienne Le Loup for 42 golden ecus and transformed the medieval stronghold into a more comfortable and habitable home. He also built an oratory for his wife, ": null
    },
    {
        "Anne of Brittany": "anne of brittany"
    },
    {
        " who lived at the Clos-Lucé until she left for the royal castle of Blois. It became known as ‘the summer house’ for the French royalty for 42 years.   Between 42 42 the Castle housed ": null
    },
    {
        "Charles IV Duke of Alençon": "charles iv, duke of alençon"
    },
    {
        " and ": null
    },
    {
        "Marguerite of Valois": "margaret of valois"
    },
    {
        ". The duke then sold the castle to ": null
    },
    {
        "Louise of Savoy": "louise of savoy"
    },
    {
        ", ": null
    },
    {
        "Regent": "regent"
    },
    {
        " of France, who took up residence and raised her two children the Duke of Angoulême who was destined to become the next king of France, ": null
    },
    {
        "Francis I": "francis i of france"
    },
    {
        " and ": null
    },
    {
        "Marguerite de Navarre": "marguerite de navarre"
    },
    {
        ", intellectual and writer of the  Heptaméron .          In 42 at aged 42 ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        " left ": null
    },
    {
        "Rome": "rome"
    },
    {
        " and traveled through Italy, armed with his sketchbooks and 42 of his most famous paintings:  Mona Lisa , ": null
    },
    {
        "The Virgin and Child, with St. Anne": "the virgin and child with st. anne"
    },
    {
        " and ": null
    },
    {
        "St. John the Baptist": "st. john the baptist"
    },
    {
        ". They are now conserved in the ": null
    },
    {
        "Musée du Louvre": "louvre"
    },
    {
        ", Paris. His disciples ": null
    },
    {
        "Francesco Melzi": "francesco melzi"
    },
    {
        " and ": null
    },
    {
        "Salaì": "salaì"
    },
    {
        " followed him throughout his travels, as did his servant, Batista of Vilanis.     ": null
    },
    {
        "Benvenuto Cellini": "benvenuto cellini"
    },
    {
        " wrote that king Francis I gave Leonardo da Vinci a pension of 42 gold ecus, as well as buying his artwork allowing him to live and work in the Clos Lucé. Leonardo da Vinci was appointed ‘The first painter, engineer and architect of the King’.   Leonardo da Vinci was enthusiastic and productive during his years at the Clos Lucé. He worked on numerous projects, organized feasts for the court of Amboise, and even drew the famous “Double Spiral Staircase” of the ": null
    },
    {
        "Château de Chambord": "château de chambord"
    },
    {
        ". He also spent time on other projects, one of them consisting of designing the perfect city of ": null
    },
    {
        "Romorantin": "romorantin-lanthenay"
    },
    {
        ". In this, Leornardo Da Vinci wanted to dig a canal to connect two rivers allowing easier trade. He is still considered as one of the most renowned artist of his time.     On the 42 October 42 he was visited by the Cardinal ": null
    },
    {
        "Luigi d’Aragona": "luigi daragona"
    },
    {
        ", who was so impressed by his artwork that he described them in his Itinerario, as “rare perfection”. These include his three most famous pieces of work : The Mona Lisa, The Virgin and Child, with St. Anne and St John the Baptist,     Leonardo organized a feast in the Château du Clos Lucé on the 42 June 42 to thank The French King Francis I for his multiple gifts and generosity.   There were a lot of similarities with the feast that Leonardo organised in ": null
    },
    {
        "Milan": "milan"
    },
    {
        " on the 42 January 42 : there was a complex machinery to impress the guests, which referred to the movements of the celestial bodies thanks to a blue canvas which symbolized the heavens where ran planets, stars, the Sun, the Moon and the twelve ": null
    },
    {
        "zodiac signs": "astrological sign"
    },
    {
        ".     Despite the rumors that he would die in the kings arms Leonardo da Vinci passed away in his room at the Clos Lucé on the 42 May 42 He left his books, drawings, sketches and manuscripts to his beloved apprentice, ": null
    },
    {
        "Francesco Melzi": "francesco melzi"
    },
    {
        ".       After Leonardos death, ": null
    },
    {
        "Louise of Savoy": "louise of savoy"
    },
    {
        " took over the Chateau, however this did not last too long as Philibert Babou of the Bourdaisière and his wife succeed her in 42 The Chateau was then taken over by Michel of Gast, who was the Guards Captain under King ": null
    },
    {
        "Henri III of France": "henry iii of france"
    },
    {
        " and became the owner after the murder of the Cardinal of Guise by the king himself, in 42     In 42 the marriage of Antoine d’Amboise and Michel de Gast’s granddaughter brought the Chateau back in the hands of ": null
    },
    {
        "House Amboise": "house of amboise"
    },
    {
        ". During the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " the castle was miraculously spared and remained in the Amboise family until 42 - it was then designed as a ": null
    },
    {
        "historical monument": "monument"
    },
    {
        " by the list of 42     Finally, the castle became the property of the Saint-Bris family on the 42th of July 42 who decided to open it to the public in 42       The castle is set in the heart of a 42-hectares park, crossed by the Amasse, a tributary of the Loire. The facade of the house is made with pink bricks and white stones and has remained almost unaltered since the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " in which an old rampart walkway still remains. Within the castle, remain the rooms of ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        ", ": null
    },
    {
        "Anne of Brittany": "anne of brittany"
    },
    {
        " and ": null
    },
    {
        "Marguerite of Navarre": "marguerite de navarre"
    },
    {
        ", including the oratory and council rooms. The first floor bedrooms were restored in 42 with period details and artifacts.     The oratory was built in 42 by ": null
    },
    {
        "Charles VIII": "charles viii of france"
    },
    {
        " for his wife, Anne of Brittany. It was a chapel of the Gothic movement made with chalk stones  and decorated with murals painted by Leonardos disciples: there is an Annunciation, a Last Judgement and a final painting called Virgo Lucis above the door, which may have gave its name to the castle. The museum also includes a copy of the Mona Lisa, painted in 42 by ": null
    },
    {
        "Ambroise Dubois": "ambroise dubois"
    },
    {
        ".     In the basement, there are 42 models that ": null
    },
    {
        "IBM": "ibm"
    },
    {
        " made from Leonardos sketches and drawings, as well as some 42D animations about the Italian masters inventions, allowing the public to see them working. In the park is a ": null
    },
    {
        "pigeon house": "dovecote"
    },
    {
        " from the middle of XVth century built by Etienne le Loup, Amboise ": null
    },
    {
        "beadle": "beadle"
    },
    {
        " that can shelter up to a thousand birds. In 42 Jean Saint-Bris set up an educational and cultural course in the park of the Clos Lucé with several sound terminals and impressive machines inspired from Leonardos mind. A garden shows his work in botany, and a two-leveled bridge made from a sketch of the artist.         Image:Clos_luce_42jpg|The chamber of ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        "   Image:Clos_luce_42jpg|The chamber of ": null
    },
    {
        "Marguerite de Navarre": "marguerite de navarre"
    },
    {
        "   Image:ClosLuce42jpg|The great room   Image:ClosLuce42jpg|The kitchen   Image:Clos luce 42jpg|The paddle wheel   Image:Clos luce 42jpg|The helicopter   Image:Clos luce 42jpg|The two-level bridge   Image:Jardin de Léonard 42jpg|The garden of Leonardo   Image:Boulins intérieurs du pigeonnier du Clos Lucé.JPG|Pigeon-holes in the dovecote   Image:Engrenages du moulin du Clos Lucé.JPG|The water-mill   Image:Jardin_botanique_du_Clos_Lucé.JPG|The botanical garden   Image:La_cité_idéale_de_Léonard_de_Vinci.JPG|Exhibitions of drawings by Leonardo in the garden       ": null
    }
]