[
    {
        "           A clown is a comic ": null
    },
    {
        "performer": "performer"
    },
    {
        " who employs ": null
    },
    {
        "slapstick": "slapstick"
    },
    {
        " or similar types of ": null
    },
    {
        "physical comedy": "physical comedy"
    },
    {
        ", often in a ": null
    },
    {
        "mime": "mime artist"
    },
    {
        " style.            Clowns have a varied tradition with significant variations in costume and performance. The most recognisable modern clown character is the  Auguste  or red clown type, with outlandish costumes featuring distinctive makeup, colourful wigs, ": null
    },
    {
        "exaggerated": "exaggerated"
    },
    {
        " footwear, and colourful clothing. Their entertainment style is generally designed to entertain large audiences.      Modern clowns are strongly associated with the tradition of the ": null
    },
    {
        "circus clown": "circus clown"
    },
    {
        ", which developed out of earlier comedic roles in theatre or Varieté shows during the 19th to mid 20th centuries.     Many circus clowns have become well known and are a key circus act in their own right. The first mainstream clown role was portrayed by ": null
    },
    {
        "Joseph Grimaldi": "joseph grimaldi"
    },
    {
        " . In the early 1800s, he expanded the role of ": null
    },
    {
        "Clown": "harlequinadeclown"
    },
    {
        " in the ": null
    },
    {
        "harlequinade": "harlequinade"
    },
    {
        " that formed part of British ": null
    },
    {
        "pantomime": "pantomime"
    },
    {
        "s, notably at the ": null
    },
    {
        "Theatre Royal, Drury Lane": "theatre royal, drury lane"
    },
    {
        " and the ": null
    },
    {
        "Sadlers Wells": "sadlers wells"
    },
    {
        " and ": null
    },
    {
        "Covent Garden": "royal opera house"
    },
    {
        " theatres. He became so dominant on the London comic stage that harlequinade Clowns became known as Joey , and both the nickname and Grimaldis whiteface make-up design were, and still are, used by other types of clowns.     The ": null
    },
    {
        "comedy": "comedy"
    },
    {
        " that clowns perform is usually in the role of a fool whose everyday actions and tasks become extraordinary—and for whom the ridiculous, for a short while, becomes ordinary. This style of comedy has a long history in many countries and cultures across the world. Some writers have argued that due to the widespread use of such comedy and its long history it is a need that is part of the human condition.      The fear of clowns , particularly circus clowns, has become known by the term ": null
    },
    {
        "coulrophobia": "coulrophobia"
    },
    {
        ".        The clown character developed out of the ": null
    },
    {
        "zanni": "zanni"
    },
    {
        " rustic fool characters of the early modern ": null
    },
    {
        "commedia dellarte": "commedia dellarte"
    },
    {
        ", which were themselves directly based on the rustic fool characters of ancient ": null
    },
    {
        "Greek": "theatre of ancient greece"
    },
    {
        " and ": null
    },
    {
        "Roman theatre": "theatre of ancient rome"
    },
    {
        ".   Rustic buffoon characters in Classical Greek theater were known as  sklêro-paiktês  or deikeliktas, besides other generic terms for rustic or peasant . In Roman theater, a term for clown was fossor, literally digger; labourer .     The English word  clown  was first recorded c. 1560  in the generic meaning rustic, boor, peasant . The origin of the word is uncertain, perhaps from a Scandinavian word cognate with clumsy. Icelandic klunni, Swedish kluns clumsy, boorish person ; c.f. North Frisian klönne and kluns , also meaning clumsy person . An alternative proposal derives clown from Latin colonus colonist, farmer . The verb to clown to play the clown onstage is from about 1600.  It is in this sense that Clown is used as the name of ": null
    },
    {
        "fool characters": "shakespearean fool"
    },
    {
        " in Shakespeares  Othello  and  The Winters Tale . The sense of clown as referring to a professional or habitual fool or jester developed soon after 1600, based on ": null
    },
    {
        "Elizabethan": "elizabethan theater"
    },
    {
        " rustic fool characters such as Shakespeares.     The ": null
    },
    {
        "harlequinade": "harlequinade"
    },
    {
        " developed in England in the 17th century, inspired by the commedia dellarte. It was here that Clown came into use as the given name of a stock character. Originally a foil for ": null
    },
    {
        "Harlequins": "harlequin"
    },
    {
        "slyness and adroit nature, Clown was a buffoon or bumpkin fool who resembled less a jester than a comical idiot. He was a lower class character dressed in tattered servants garb.     The now-classical features of the clown character were developed in the early 1800s by ": null
    },
    {
        "Joseph Grimaldi": "joseph grimaldi"
    },
    {
        ", who played Clown in ": null
    },
    {
        "Charles Dibdins": "charles dibdin the younger"
    },
    {
        " 1800 pantomime Peter Wilkins: or Harlequin in the Flying World at ": null
    },
    {
        "Sadlers Wells Theatre": "sadlers wells theatre"
    },
    {
        ", where Grimaldi built the character up into the central figure of the harlequinade. Neville, pp. 6–7 McConnell Stott, pp. 95–100            The ": null
    },
    {
        "circus clown": "circus clown"
    },
    {
        " developed in the 19th century. The modern circus derives from ": null
    },
    {
        "Philip Astleys": "philip astley"
    },
    {
        "London riding school, which opened in 1768. Astley added a clown to his shows to amuse the spectators between equestrian sequences. American comedian ": null
    },
    {
        "George L. Fox": "george l. fox"
    },
    {
        " became known for his clown role, directly inspired by Grimaldi, in the 1860s.   ": null
    },
    {
        "Tom Belling": "tom belling"
    },
    {
        " senior developed the red clown or Auguste  character c. 1870, acting as a foil for the more sophisticated white clown . Belling worked for ": null
    },
    {
        "Circus Renz": "circus renz"
    },
    {
        " in Vienna. Bellings costume became the template for the modern stock character of circus or childrens clown, based on a lower class or hobo character, with red nose, white makeup around the eyes and mouth, and oversized clothes and shoes. The clown character as developed by the late 19th century is reflected in ": null
    },
    {
        "Ruggero Leoncavallos": "ruggero leoncavallo"
    },
    {
        "1892 opera  Pagliacci  .   Bellings Auguste character was further popularized by ": null
    },
    {
        "Nicolai Poliakoffs": "nicolai poliakoff"
    },
    {
        " Coco in the 1920s to 1930s.     The English word clown was borrowed, along with the circus clown act, from many other languages, such as French clown, Russian кло́ун, Greek κλόουν, Danish/Norwegian klovn, Romanian clovn etc.     Italian retains Pagliaccio, a Commedia dellarte ": null
    },
    {
        "zanni": "zanni"
    },
    {
        " character, From paglia, the word for straw , or from bajaccio mocker, scoffer . and derivations of the Italian term are found in other Romance languages, such as French Paillasse, Spanish payaso, Catalan/Galician pallasso, Portuguese palhaço, Greek παλιάτσος, Turkish palyaço, German Pajass , Dialectal  in  Schweizerisches Idiotikon  Yiddish פּאַיאַץ , Russian пая́ц.       In the early 20th century, with the disappearance of the rustic simpleton or village idiot character of everyday experience, North American circuses developed characters such as the ": null
    },
    {
        "tramp": "tramp"
    },
    {
        " or ": null
    },
    {
        "hobo": "hobo"
    },
    {
        ". Examples include ": null
    },
    {
        "Marceline Orbes": "marceline orbes"
    },
    {
        ", who performed at the ": null
    },
    {
        "Hippodrome Theater": "new york hippodrome"
    },
    {
        ", ": null
    },
    {
        "Charlie Chaplins": "charlie chaplin"
    },
    {
        "  The Tramp  , and ": null
    },
    {
        "Emmett Kellys": "emmett kelly"
    },
    {
        " Weary Willie based on hobos of the Depression era. Another influential tramp character was played by ": null
    },
    {
        "Otto Griebling": "otto griebling"
    },
    {
        " during the 1930s to 1950s. ": null
    },
    {
        "Red Skeltons": "red skelton"
    },
    {
        "Dodo the Clown in  The Clown  , depicts the circus clown as a tragicomic stock character, a funny man with a drinking problem .     In the United States, ": null
    },
    {
        "Bozo the Clown": "bozo the clown"
    },
    {
        " was an influential Auguste character since the late 1950s.  The Bozo Show  premiered in 1960 and appeared nationally on cable television in 1978. ": null
    },
    {
        "McDonalds": "mcdonalds"
    },
    {
        " derived its mascot clown, ": null
    },
    {
        "Ronald McDonald": "ronald mcdonald"
    },
    {
        ", from the Bozo character in the 1960s. ": null
    },
    {
        "Willard Scott": "willard scott"
    },
    {
        ", who had played Bozo during 1959–1962, performed as the mascot in 1963 television spots. The McDonalds trademark application for the character dates to 1967.     Based on the Bozo template, the US custom of birthday clown, private contractors who offer to perform as clowns at childrens parties, developed in the 1960s to 1970s. The strong association of the  clown character with childrens entertainment as it has developed since the 1960s also gave rise to ": null
    },
    {
        "Clown Care": "clown care"
    },
    {
        " or hospital clowning in childrens hospitals by the mid 1980s. ": null
    },
    {
        "Clowns of America International": "clowns of america international"
    },
    {
        " and ": null
    },
    {
        "World Clown Association": "world clown association"
    },
    {
        " are associations of semi-professionals and professional performers.     The shift of the Auguste or red clown character from his role as a foil for the white in circus or pantomime shows to a Bozo-derived standalone character in childrens entertainment by the 1980s also gave rise to the ": null
    },
    {
        "evil clown": "evil clown"
    },
    {
        " character, the attraction of clowns for small children being based in their fundamentally threatening or frightening nature. A study by the ": null
    },
    {
        "University of Sheffield": "university of sheffield"
    },
    {
        " concluded that clowns are universally disliked by children. Some found them quite frightening and unknowable.  . The natural dislike of clowns makes them effective in eliciting laughter by releasing tension in acting clumsy or rendering themselves helpless.            There are different types of clowns portrayed around the world. They include    ": null
    },
    {
        "Blackface": "blackface"
    },
    {
        " Harlequin": "harlequin"
    },
    {
        " Jester": "jester"
    },
    {
        " Mime artist": "mime artist"
    },
    {
        " Pierrot": "pierrot"
    },
    {
        " Pueblo": "pueblo clowns"
    },
    {
        " Rodeo clown": "rodeo clown"
    },
    {
        "               :See Harlequinade      The classical pairing of the White Clown with Auguste in modern tradition   has a precedent in the pairing of ": null
    },
    {
        "Pierrot": "pierrot"
    },
    {
        " and ": null
    },
    {
        "Harlequin": "harlequin"
    },
    {
        " in the ": null
    },
    {
        "Commedia dellarte": "commedia dellarte"
    },
    {
        ".   Originally, Harlequins role was that of a light-hearted, nimble and astute servant, paired with the sterner and melancholic Pierrot.     In the 18th-century English ": null
    },
    {
        "Harlequinade": "harlequinade"
    },
    {
        ", Harlequin was now paired with Clown.   As developed by Joseph Grimaldi around 1800, Clown became the mischievous and brutish foil for the more sophisticated Harlequin, who became more of a romantic character. The most influential such pair in Victorian England were the Payne Brothers, active during the 1860s and 1870s.               The white clown, or clown blanc from the original French, is a sophisticated character, as opposed to the clumsy auguste. Schechter, Joel  p.139 They are also distinguished as the sad clown and happy clown .       The Auguste face base makeup color is a variation of pink, red, or tan rather than white. Features are exaggerated in size, and are typically red and black in color. The mouth is thickly outlined with white as are the eyes. Appropriate to the character, the auguste can be dressed in either well-fitted garb or in a costume that does not fit — oversize or too small, either is appropriate. Bold colors, large prints or patterns, and suspenders often characterize Auguste costumes.     The auguste character-type is often an anarchist, a joker, or a fool. He is clever and has much lower status than the whiteface. Classically the whiteface character instructs the auguste character to perform his bidding. The auguste has a hard time performing a given task, which leads to funny situations. Sometimes the auguste plays the role of an anarchist and purposefully has trouble following the whitefaces directions. Sometimes the auguste is confused or is foolish and makes errors less deliberately.     The contra-auguste plays the role of the mediator between the white clown and the auguste character. He has a lower status than the white clown but a higher status than the auguste. He aspires to be more like the white clown and often mimics everything the white clown does to try to gain approval. If there is a contra-auguste character, he often is instructed by the whiteface to correct the auguste when he is doing something wrong.            There are two major types of clowns with whiteface makeup:   The classic white clown is derived from the ": null
    },
    {
        "Pierrot": "pierrot"
    },
    {
        " character. His makeup is white, usually with facial features such as eyebrows emphasized in black. He is the more intelligent and sophisticated clown, contrasting with the rude or grotesque Auguste types. ": null
    },
    {
        "Francesco Caroli": "francesco caroli"
    },
    {
        " and ": null
    },
    {
        "Glenn Frosty Little": "glen little"
    },
    {
        " are examples of this type. The second type of whiteface is the buffoonish clown of the  Bozo  type, known as Comedy or Grotesque Whiteface . This type has grotesquely emphasized features, especially a red nose and red mouth, often with partial hair.   In the comedic partnership of ": null
    },
    {
        "Abbott and Costello": "abbott and costello"
    },
    {
        ", Bud Abbot would have been the classic whiteface and Lou Costello the comedy whiteface or Auguste. Tiffany McCoy,   , citing Strutters Complete Guide to Clown Makeup .     Traditionally, the whiteface clown uses clown white makeup to cover the entire face and neck, leaving none of the underlying natural skin visible. In the European whiteface makeup, the ears are painted red.     Whiteface makeup was originally designed by ": null
    },
    {
        "Joseph Grimaldi": "joseph grimaldi"
    },
    {
        " in 1801. He began by painting a white base over his face, neck and chest before adding red triangles on the cheeks, thick eyebrows and large red lips set in a mischievous grin. Grimaldis design is used by many modern clowns. According to Grimaldis biographer Andrew McConnell Stott, it was one of the most important theatrical designs of the 1800s. McConnell Stott, pp. 117–118     Americas first great whiteface clown was stage star ": null
    },
    {
        "George G.L. Fox": "george l. fox"
    },
    {
        ". Following English ": null
    },
    {
        "Joseph Grimaldi": "joseph grimaldi"
    },
    {
        ", Fox popularised the Humpty Dumpty stories throughout the land in the first half of the 19th century in America. , Library of Congress , accessed 24 October 2013       The character clown adopts an eccentric character of some type, such as a butcher, a baker, a policeman, a housewife or ": null
    },
    {
        "hobo": "hobo"
    },
    {
        ". Prime examples of this type of clown are the circus tramps ": null
    },
    {
        "Otto Griebling": "otto griebling"
    },
    {
        " and ": null
    },
    {
        "Emmett Kelly": "emmett kelly"
    },
    {
        ". ": null
    },
    {
        "Red Skelton": "red skelton"
    },
    {
        ", ": null
    },
    {
        "Harold Lloyd": "harold lloyd"
    },
    {
        ", ": null
    },
    {
        "Buster Keaton": "buster keaton"
    },
    {
        ", ": null
    },
    {
        "Charlie Chaplin": "charlie chaplin"
    },
    {
        " and ": null
    },
    {
        "Sacha Baron Cohen": "sacha baron cohen"
    },
    {
        " would all fit the definition of a character clown.     The character clown makeup is a comic slant on the standard human face. Their makeup starts with a flesh tone base and may make use of anything from glasses, mustaches and beards to freckles, warts, big ears or strange haircuts.       The most prevalent character clown in the American circus is the hobo, tramp or bum clown. There are subtle differences in the American character clown types. The primary differences among these clown types is ": null
    },
    {
        "attitude": "attitude"
    },
    {
        ". According to American circus expert ": null
    },
    {
        "Hovey Burgess": "hovey burgess"
    },
    {
        ", they are:   The Hobo: Migratory and finds work where he travels. Down on his luck but maintains a positive ": null
    },
    {
        "attitude": "attitude"
    },
    {
        ".   The Tramp: Migratory and does not work where he travels. Down on his ": null
    },
    {
        "luck": "luck"
    },
    {
        " and depressed about his situation.   The Bum: Non-migratory and non-working.          ": null
    },
    {
        "Barry Lubin": "barry lubin"
    },
    {
        " Bello Nock": "bello nock"
    },
    {
        " Bill Irwin": "bill irwin"
    },
    {
        " Bobo Barnett": "bobo barnett"
    },
    {
        " Charlie Cairoli": "charlie cairoli"
    },
    {
        " Clarabell": "clarabell the clown"
    },
    {
        " Clownzo": "terry teene"
    },
    {
        " Coco the Clown": "nicolai poliakoff"
    },
    {
        " David Larible": "david larible"
    },
    {
        " David Shiner": "david shiner"
    },
    {
        " Doink the Clown": "doink the clown"
    },
    {
        " Emmett Kelly": "emmett kelly"
    },
    {
        " Eric Davis": "eric davis"
    },
    {
        " Gamzee Makara": "gamzee makara"
    },
    {
        " Geoff Hoyle": "geoff hoyle"
    },
    {
        " Jef Johnson": "jef johnson"
    },
    {
        " Joseph Grimaldi": "joseph grimaldi"
    },
    {
        " John Wayne Gacy": "john wayne gacy"
    },
    {
        " John Gilkey": "john gilkey"
    },
    {
        " Lou Jacobs": "lou jacobs"
    },
    {
        " Oleg Popov": "oleg popov"
    },
    {
        " Peter Shub": "peter shub"
    },
    {
        " Poodles Hanneford": "poodles hanneford"
    },
    {
        " Puddles Pity Party": "puddles pity party"
    },
    {
        " Red Skelton": "red skelton"
    },
    {
        " Roly Bain": "roly bain"
    },
    {
        " Sol": "sol"
    },
    {
        " Vance Colvig, Jr.": "vance colvig"
    },
    {
        " Yuri Nikulin": "yuri nikulin"
    },
    {
        " Zig and Zag": "zig and zag"
    },
    {
        "                                     The World Clown Association is a worldwide organization for clowns, jugglers, magicians, and face painters. It holds an annual convention, mainly in the United States.            Clowns of America International, Inc. is a Minnesota-based nonprofit clown arts membership organization which aims to share, educate, and act as a gathering place for serious minded amateurs, semiprofessionals, and professional clowns .           In the circus, a clown might perform other circus roles or skills. Clowns may perform such skills as ": null
    },
    {
        "tightrope": "tightrope"
    },
    {
        ", ": null
    },
    {
        "juggling": "juggling"
    },
    {
        ", ": null
    },
    {
        "unicycling": "unicycling"
    },
    {
        ", ": null
    },
    {
        "Master of Ceremonies": "mc"
    },
    {
        ", or ride an animal. Clowns may also sit in with the ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        ". Other circus performers may also temporarily stand in for a clown and perform their skills in clown costume.       Frameworks are the general outline of an act that clowns use to help them build out an act.  Frameworks can be loose, including only a general beginning and ending to the act, leaving it up to the clowns creativity to fill in the rest, or at the other extreme a fully developed script that allows very little room for creativity.     Shows are the overall production that a clown is a part of, it may or may not include elements other than clowning, such as in a circus show. In a circus context, clown shows are typically made up of some combination of Entrées, Side dishes, Clown Stops, Track Gags, Gags and bits.       Business — the individual motions the clown uses, often used to express the clowns character.   Gag — very short piece of clown comedy that, when repeated within a bit or routine , may become a  running gag . Gags are, loosely, the jokes clowns play on each other. A gag may have a beginning, a middle, and an end — or may not. Gags can also refer to the prop stunts/tricks or the stunts that clowns use, such as a squirting flower.   Bit — the clowns sketch or routine, made up of one or more gags either worked out and timed before going on stage, or impromptu bits composed of familiar improvisational material.       Entrée — clowning acts lasting 5–10 minutes. Typically made up of various gags and bits, usually within a clowning framework. Entrées almost always end with a blow-off — the comedic ending of a show segment, bit, gag, stunt, or routine.   Side dish — shorter feature act. Side dishes are essentially shorter versions of the entrée, typically lasting 1–3 minutes. Typically made up of various gags and bits, side dishes are usually within a clowning framework. Side dishes almost always end with a blow-off.       Clown Stops or interludes are the brief appearances of clowns in a circus while the props and rigging are changed. These are typically made up of a few gags or several bits. Clown stops will always have a beginning, a middle, and an end to them, invariably culminating in a blow-off. These are also called reprises or run-ins by many, and in todays circus they are an art form in themselves. Originally they were bits of business usually parodying the preceding act. If for instance there had been a ": null
    },
    {
        "tightrope walker": "tightrope walker"
    },
    {
        " the reprise would involve two chairs with a piece of rope between and the clown trying to imitate the artiste by trying to walk between them, with the resulting falls and cascades bringing laughter from the audience. Today, interludes are far more complex, and in many modern shows the clowning is a thread that links the whole show together.       Among the more well-known clown stunts are: squirting flower; the ": null
    },
    {
        "too-many-clowns-coming-out-of-a-tiny-car": "clown car"
    },
    {
        " stunt; doing just about anything with a ": null
    },
    {
        "rubber chicken": "rubber chicken"
    },
    {
        ", tripping over ones own feet , or riding any number of ridiculous vehicles or ": null
    },
    {
        "clown bikes": "clown bicycle"
    },
    {
        " . Individual prop stunts are generally considered individual bits.                 In anthropology, the term clown has been extended to comparable jester or fool characters in non-Western cultures. A society in which such clowns have an important position are termed ": null
    },
    {
        "clown societies": "clown society"
    },
    {
        " , and a clown character involved in a religious or ritual capacity is known as a ": null
    },
    {
        "ritual clown": "ritual clown"
    },
    {
        " .     The most ancient clowns have been found in the ": null
    },
    {
        "Fifth dynasty of Egypt": "fifth dynasty of egypt"
    },
    {
        ", around 2400 BC.  Unlike ": null
    },
    {
        "court jester": "court jester"
    },
    {
        "s, clowns have traditionally served a socio-religious and psychological role, and traditionally the roles of ": null
    },
    {
        "priest": "priest"
    },
    {
        " and clown have been held by the same persons.  p.774.Charles, Lucile Hoerr  in The Journal of American Folklore Vol. 58, No. 227 , pp. 25-34.   Edward P. Dozier  p.202    Peter Berger writes, It seems plausible that folly and fools, like religion and magic, meet some deeply rooted needs in human society.  For this reason, clowning is often considered an important part of training as a ": null
    },
    {
        "physical performance": "physical theatre"
    },
    {
        " discipline, partly because tricky subject matter can be dealt with, but also because it requires a high level of risk and play in the performer.      In Native American mythology, the ": null
    },
    {
        "Trickster": "trickster"
    },
    {
        " channels the spirit of the Coyote and becomes a sacred Clown character. A ": null
    },
    {
        "Heyoka": "heyoka"
    },
    {
        " is an individual in Native cultures who lives outside the constraints of normal cultural roles. The Heyoka plays the role of a backwards clown, doing everything in reverse. The Heyoka role is sometimes best filled by a ": null
    },
    {
        "Winkte": "winkte"
    },
    {
        ".     Many native tribes have a history of clowning.   The ": null
    },
    {
        "Canadian Clowning": "canadian clowning"
    },
    {
        " method developed by ": null
    },
    {
        "Richard Pochinko": "richard pochinko"
    },
    {
        " and furthered by his former apprentice, ": null
    },
    {
        "Sue Morrison": "sue morrison"
    },
    {
        ", combines European and Native American clowning techniques.     In this tradition, masks are made of clay while the creators eyes are closed. A mask is made for each direction of the ": null
    },
    {
        "medicine wheel": "medicine wheel"
    },
    {
        ". During this process, the clown creates a personal mythology that explores their personal experiences.         Black and White looking sad.jpg| Chuchín  , a famous Mexican circus clown from the late 1960s to 1984   Actor in clown costume - Weir Collection.jpg|Actor in a clown costume   SAND Maurice Masques et bouffons 05.jpg|The Italian Pagliacco of c. 1600    Paillasse.jpg|The French Paillasse character   Joseph-Grimaldi-head.jpg|": null
    },
    {
        "Joseph Grimaldi": "joseph grimaldi"
    },
    {
        " as Clown, showing his own make-up design   Arm & Hammer Brand Soda poster ca. 1900.jpg|A ": null
    },
    {
        "circus clown": "circus clown"
    },
    {
        " in an Arm & Hammer Brand Soda advertisement poster   Bozos Circus 1968.JPG|1968 postcard, main cast of  Bozos Circus  ; left to right, Ringmaster Ned , Mr. Bob ,  Bozo the Clown  , Oliver O. Oliver , Sandy the Clown    Paul Cézanne- Pierrot and Harlequin.JPG|Pierrot and Harlequin by ": null
    },
    {
        "Paul Cézanne": "paul cézanne"
    },
    {
        "   Geclown.jpg|Swedish actor ": null
    },
    {
        "Gösta Ekman senior": "gösta ekman"
    },
    {
        " as a whiteface clown in the play Han som får örfilarna  by ": null
    },
    {
        "Leonid Andreyev": "leonid andreyev"
    },
    {
        "   Lasse Beischer .jpg|Typical aspects of an Auguste; white muzzle and eyes       Emmett Kelly 1953.jpg|": null
    },
    {
        "Emmett Kelly": "emmett kelly"
    },
    {
        " in his Weary Willie persona with two ": null
    },
    {
        "Ringling Bros.": "ringling bros. and barnum  &  bailey circus"
    }
]