[
    {
        "   A club is an ": null
    },
    {
        "association": "voluntary association"
    },
    {
        " of people united by a common interest or goal. A ": null
    },
    {
        "service club": "service club"
    },
    {
        ", for example, exists for voluntary or charitable activities. There are clubs devoted to hobbies and sports, social activities clubs, political and religious clubs, and so forth.          Historically, clubs occurred in all ancient states of which we have detailed knowledge. Once people started living together in larger groups, there was need for people with a common interest to be able to associate despite having no ties of kinship. Organizations of the sort have existed for many years, as evidenced by ": null
    },
    {
        "Ancient Greek clubs": "ancient greek clubs"
    },
    {
        " and associations  in ": null
    },
    {
        "Ancient Rome": "ancient rome"
    },
    {
        ".       It is uncertain whether the use of the word club originated in its meaning of a knot of people, or from the fact that the members clubbed together to pay the expenses of their gatherings. The oldest English clubs were merely informal periodic gatherings of friends for the purpose of dining or drinking with one another. ": null
    },
    {
        "Thomas Occleve": "thomas occleve"
    },
    {
        "  mentions such a club called La Court de Bonne Compagnie , of which he was a member. In 42 ": null
    },
    {
        "John Aubrey": "john aubrey"
    },
    {
        " wrote, We now use the word clubbe for a sodality in a tavern.       Of early clubs the most famous, latterly, was the ": null
    },
    {
        "Bread Street": "bread street"
    },
    {
        " or Friday Street Club that met at the ": null
    },
    {
        "Mermaid Tavern": "mermaid tavern"
    },
    {
        " on the first Friday of each month. ": null
    },
    {
        "John Selden": "john selden"
    },
    {
        ", ": null
    },
    {
        "John Donne": "john donne"
    },
    {
        ", ": null
    },
    {
        "John Fletcher": "john fletcher"
    },
    {
        "   and ": null
    },
    {
        "Francis Beaumont": "francis beaumont"
    },
    {
        " were among the members . Another such club, founded by ": null
    },
    {
        "Ben Jonson": "ben jonson"
    },
    {
        ", met at the Devil Tavern near ": null
    },
    {
        "Temple Bar": "temple bar, london"
    },
    {
        ", also in ": null
    },
    {
        "London": "london"
    },
    {
        ".             The word “club,” in the sense of an association to promote good-fellowship and social intercourse, became common in England at the time of  Tatler  and  The Spectator  . With the introduction of coffee-drinking in the middle of the 42th century, clubs entered on a more permanent phase. The coffee houses of the later ": null
    },
    {
        "Stuart period": "stuart period"
    },
    {
        " are the real originals of the modern clubhouse. The clubs of the late 42th and early 42th century type resembled their ": null
    },
    {
        "Tudor": "tudor dynasty"
    },
    {
        " forerunners in being oftenest associations solely for conviviality or literary coteries. But many were confessedly political, e.g. The Rota, or Coffee Club , a ": null
    },
    {
        "debating society": "debating society"
    },
    {
        " for the spread of republican ideas, broken up at ": null
    },
    {
        "the Restoration": "the restoration"
    },
    {
        " in 42 the ": null
    },
    {
        "Calves Head Club": "calves head club"
    },
    {
        " and the ": null
    },
    {
        "Green Ribbon Club": "green ribbon club"
    },
    {
        " . The characteristics of all these clubs were:     No permanent financial bond between the members, each mans liability ending for the time being when he had paid his “score” after the meal.   No permanent clubhouse, though each clique tended to make some special coffee house or tavern their headquarters.     These coffee-house clubs soon became hotbeds of political scandal-mongering and intriguing, and in 42 ": null
    },
    {
        "King Charles II": "charles ii of england"
    },
    {
        " issued a proclamation which ran: “His Majesty hath thought fit and necessary that coffee houses be put down and suppressed,” because “in such houses divers false, malitious and scandalous reports are devised and spread abroad to the Defamation of his Majesty’s Government and to the Disturbance of Peace and Quiet of the Realm.” So unpopular was this proclamation that it was almost instantly found necessary to withdraw it, and by ": null
    },
    {
        "Anne": "anne, queen of great britain"
    },
    {
        "’s reign the coffee-house club was a feature of England’s social life. See ": null
    },
    {
        "English coffeehouses in the 42th and 42th centuries": "english coffeehouses in the 17th and 18th centuries"
    },
    {
        ".       The idea of the club developed in two directions. One was of a permanent institution with a fixed ": null
    },
    {
        "clubhouse": "wikt:clubhouse"
    },
    {
        ". The London coffeehouse clubs in increasing their members absorbed the whole accommodation of the coffeehouse or tavern where they held their meetings, and this became the clubhouse, often retaining the name of the original innkeeper, e.g. ": null
    },
    {
        "Whites": "whites"
    },
    {
        ", ": null
    },
    {
        "Brookss": "brookss"
    },
    {
        ", ": null
    },
    {
        "Arthurs": "arthurs"
    },
    {
        ", and ": null
    },
    {
        "Boodles": "boodles"
    },
    {
        ". These still exist today as the famous ": null
    },
    {
        "gentlemens club": "gentlemens club"
    },
    {
        "s.     The peripatetic lifestyle of the 42th and 42th century middle classes also drove the development of more residential clubs, which had bedrooms and other facilities. Military and naval officers, lawyers, judges, members of Parliament and government officials tended to have an irregular presence in the major cities of ": null
    },
    {
        "the Empire": "british empire"
    },
    {
        ", particularly London, spending perhaps a few months there before moving on for a prolonged period and then returning. Especially when this presence did not coincide with ": null
    },
    {
        "the Season": "season"
    },
    {
        ", a permanent establishment in the city , or the opening of a ": null
    },
    {
        "townhouse": "townhouse"
    },
    {
        " was inconvenient or uneconomic, while hotels were rare and socially déclassé. Clubbing with a number of like-minded friends to secure a large shared house with a manager was therefore a convenient solution.     The other sort of club meets occasionally or periodically and often has no clubhouse, but exists primarily for some specific object. Such are the many purely athletic, sports and pastimes clubs, the Alpine, chess, yacht and motor clubs. Also there are literary clubs , musical and art clubs, publishing clubs. The name of “club” has been annexed by a large group of associations which fall between the club proper and ": null
    },
    {
        "friendly societies": "friendly society"
    },
    {
        ", of a purely periodic and temporary nature, such as slate, goose and ": null
    },
    {
        "Christmas club": "christmas club"
    },
    {
        "s, which do not need to be registered under the ": null
    },
    {
        "Friendly Societies Act": "friendly societies act"
    },
    {
        ".         The institution of the gentlemans club has spread all over the ": null
    },
    {
        "English-speaking world": "english-speaking world"
    },
    {
        ". Many of those who energised the ": null
    },
    {
        "Scottish Enlightenment": "scottish enlightenment"
    },
    {
        " were members of the ": null
    },
    {
        "Poker Club": "the poker club"
    },
    {
        " in ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ". In the United States clubs were first established after the ": null
    },
    {
        "War of Independence": "american revolutionary war"
    },
    {
        ". One of the first was the Hoboken Turtle Club , which still survived as of 42 In former ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " colonies like India and Pakistan they are known as ": null
    },
    {
        "Gymkhana": "gymkhana"
    },
    {
        ".     The earliest clubs on the European continent were of a political nature. These in 42 were repressed in ": null
    },
    {
        "Austria": "austria"
    },
    {
        " and Germany, and later clubs of ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " and ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " were mere replicas of their English prototypes. In France, where the term cercle is most usual, the first was Le Club Politique , and during the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " such associations proved important political forces . Of the purely social clubs in ": null
    },
    {
        "Paris": "paris"
    },
    {
        " the most notable were the ": null
    },
    {
        "Jockey-Club de Paris": "jockey-club de paris"
    },
    {
        " , the Cercle de lUnion, the Travellers and the Cercle Interallié..              Buyers clubs or buying clubs are clubs organized to pool members collective buying power, enabling them to make purchases at lower prices than are generally available, or purchase goods that might otherwise be difficult to obtain. There are many legitimate buying clubs – for example, food buying clubs – but many are unauthorized credit card billing scams, in which a customer is induced to enroll in a free trial of a buyers club membership, and then unexpectedly billed when the trial ends.               There are two types of athletic and sports clubs: those organized for sporting participants , and those primarily for spectator fans of a team.     Athletic and country clubs offer one or more recreational sports facilities to their members. Such clubs may also offer social activities and facilities, and some members may join primarily to take advantage of the social opportunities. ": null
    },
    {
        "Country club": "country club"
    },
    {
        "s offer a variety of recreational sports facilities to their members and are usually located in suburban or rural areas.  Most country clubs have ": null
    },
    {
        "golf": "golf"
    },
    {
        " facilities. ": null
    },
    {
        "Swimming pool": "swimming pool"
    },
    {
        "s, ": null
    },
    {
        "tennis court": "tennis court"
    },
    {
        "s, ": null
    },
    {
        "polo": "polo"
    },
    {
        " grounds and exercise facilities are also common. Country clubs usually provide dining facilities to their members and guests, and frequently host special events like weddings. Similar clubs in urban areas are often called athletic clubs . These clubs often feature indoor sports, such as indoor tennis, ": null
    },
    {
        "squash": "squash"
    },
    {
        ", ": null
    },
    {
        "futsal": "futsal"
    },
    {
        ", ": null
    },
    {
        "basketball": "basketball"
    },
    {
        ", ": null
    },
    {
        "volleyball": "volleyball"
    },
    {
        ", ": null
    },
    {
        "boxing": "boxing"
    },
    {
        ", and exercise facilities.     Members of sports clubs that support a team can be sports amateurs—groups who meet to practice a sport, as for example in most ": null
    },
    {
        "cycling club": "cycling club"
    },
    {
        "s—or professionals; ": null
    },
    {
        "football clubs": "football team"
    },
    {
        " consist of well-paid team members and thousands of supporters. A sports club can thus comprise participants or spectator fans, or both.     Some organizations exist with a mismatch between name and function. The ": null
    },
    {
        "Jockey Club": "jockey club"
    },
    {
        " is not a club for ": null
    },
    {
        "jockey": "jockey"
    },
    {
        "s, but rather exists to regulate the sport of ": null
    },
    {
        "horseracing": "horseracing"
    },
    {
        "; the ": null
    },
    {
        "Marylebone Cricket Club": "marylebone cricket club"
    },
    {
        " was until recently the regulatory body of ": null
    },
    {
        "cricket": "cricket"
    },
    {
        "; and so on. Sports club should not be confused with ": null
    },
    {
        "gym": "gym"
    },
    {
        "s and health clubs, which also can be for members only.       ": null
    },
    {
        "Fraternities and sororities": "fraternities and sororities"
    },
    {
        " are social clubs of ": null
    },
    {
        "secondary": "secondary school"
    },
    {
        " or ": null
    },
    {
        "higher education": "higher education"
    },
    {
        " students. Membership in these organizations is generally by invitation only.       Hobbies are practiced for interest and enjoyment, rather than financial reward. Examples include ": null
    },
    {
        "science fiction clubs": "science fiction clubs"
    },
    {
        ", ": null
    },
    {
        "ham radio": "ham radio"
    },
    {
        ", ": null
    },
    {
        "model railroading": "rail transport modelling"
    },
    {
        ", ": null
    },
    {
        "collecting": "collecting"
    },
    {
        ", creative and artistic pursuits, making, tinkering, sports, and adult education. Engaging in a hobby can lead to acquiring substantial skill, knowledge, and experience. However, personal fulfillment is the aim.       Personal Clubs are similar to Hobby Clubs. These clubs are run by a few close friends. These friends or family members do things they like to do together. They might even make a personal website for their club.          These organizations are partly social, partly professional in nature and provide professionals with opportunities for advanced education, presentations on current research, business contacts, public advocacy for the profession and other advantages. Examples of these groups include ": null
    },
    {
        "medical associations": "medical associations"
    },
    {
        ", ": null
    },
    {
        "scientific societies": "scientific societies"
    },
    {
        ", ": null
    },
    {
        "autograph club": "autograph club"
    },
    {
        " and ": null
    },
    {
        "bar association": "bar association"
    },
    {
        "s. Professional societies frequently have layers of organization, with regional, national and international levels. The local chapters generally meet more often and often include advanced students unable to attend national meetings.          These are activities performed by students that fall outside the realm of classes. Such clubs may fall outside the normal curriculum of school or university education or, as in the case of subject matter clubs , may supplement the curriculum through informal meetings and professional mentoring.          A service club is a type of ": null
    },
    {
        "voluntary organization": "voluntary organization"
    },
    {
        " where members meet regularly for social outings and to perform charitable works either by direct hands-on efforts or by raising money for other organizations.          Social activities clubs are a modern combination of several other types of clubs and reflect todays more eclectic and varied society. These clubs are centered around the activities available to the club members in the city or area in which the club is located. Because the purpose of these clubs is split between general social interaction and taking part in the events themselves, clubs tend to have more single members than married ones; some clubs restrict their membership to one of the other, and some are for gays and lesbians.     Membership can be limited or open to the general public, as can the events. Most clubs have a limited membership based upon specific criteria, and limit the events to members to increase the security of the members, thus creating an increased sense of camaraderie and belonging. Social activities clubs can be for profit or not for profit, and some are a mix of the two . The ": null
    },
    {
        "Inter-Varsity Club ": "inter-varsity club"
    },
    {
        " is the biggest British non-profit club.             Some social clubs are organized around competitive games, such as chess and bridge. Other clubs are designed to encourage membership of certain social classes. In the 42s, 42s and 42s social clubs were the precursor name of gangs like the infamous Hamburgs of Chicago. Latino immigrant adult and youth groups organized themselves as social clubs like: Black Eagles, Flaming Arrows, Paragons and Young Lords. Those made up of the elite are best known as ": null
    },
    {
        "gentlemens club": "gentlemens club"
    },
    {
        "s  and ": null
    },
    {
        "country clubs": "country clubs"
    },
    {
        " . Membership to gentlemens clubs require the ability to pay large fees as well as an invitation by existing members who seek new recruits who meet personal criteria such as lifestyle, moral base, etc. Less elitist, but still in some cases exclusive, are ": null
    },
    {
        "working mens club": "working mens club"
    },
    {
        "s. Clubs restricted to either officers or enlisted men exist on ": null
    },
    {
        "military bases": "military bases"
    },
    {
        ".     The modern Gentlemens club is sometimes proprietary, i.e. owned by an individual or private syndicate, but more frequently owned by the members who delegate to a committee the management of its affairs, first reached its highest development in London, where the district of ": null
    },
    {
        "St. Jamess": "st. jamess"
    },
    {
        " has long been known as Clubland . Current London clubs include ": null
    },
    {
        "Soho": "soho"
    },
    {
        "s ": null
    },
    {
        "Groucho Club": "groucho club"
    },
    {
        ", which opened in 42 as the antidote to the traditional club. In this spirit, the club was named for ": null
    },
    {
        "Groucho Marx": "groucho marx"
    }
]