[
    {
        "                  The Territory of Cocos Islands is an ": null
    },
    {
        "Australian external territory": "states and territories of australia"
    },
    {
        " on the ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        ", comprising a small archipelago approximately midway between Australia and ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        " and closer to the Indonesian island of ": null
    },
    {
        "Sumatra": "sumatra"
    },
    {
        ". It is part of ": null
    },
    {
        "Southeast Asia": "southeast asia"
    },
    {
        " and is in the ": null
    },
    {
        "Southern Hemisphere": "southern hemisphere"
    },
    {
        ". The territorys ": null
    },
    {
        "dual name": "dual naming"
    },
    {
        " reflects that the islands have historically been known as either the Cocos Islands or the Keeling Islands.     The territory consists of two ": null
    },
    {
        "atolls": "atoll"
    },
    {
        "made up of 27 ": null
    },
    {
        "coral island": "coral island"
    },
    {
        "s, of which only two – ": null
    },
    {
        "West Island": "west island, cocos  islands"
    },
    {
        " and ": null
    },
    {
        "Home Island": "home island"
    },
    {
        " – are inhabited. The population of around 600 people consists mainly of ": null
    },
    {
        "Cocos Malays": "cocos malays"
    },
    {
        ", who mostly practise ": null
    },
    {
        "Sunni Islam": "sunni islam"
    },
    {
        " and speak ": null
    },
    {
        "a dialect of Malay": "cocos malay"
    },
    {
        " as their first language.  The territory is administered by the Australian federal governments ": null
    },
    {
        "Department of Infrastructure, Regional Development and Cities": "department of infrastructure, regional development and cities"
    },
    {
        ", and together with ": null
    },
    {
        "Christmas Island": "christmas island"
    },
    {
        "  forms the ": null
    },
    {
        "Australian Indian Ocean Territories": "australian indian ocean territories"
    },
    {
        " administrative unit. However, the islanders do have a degree of self-government through ": null
    },
    {
        "the local shire council": "shire of cocos"
    },
    {
        ". Many public services – including health, education, and policing – are provided by the state of ": null
    },
    {
        "Western Australia": "western australia"
    },
    {
        ", and Western Australian law applies except where the federal government has determined otherwise.     The islands were first discovered in 1609 by ": null
    },
    {
        "William Keeling": "william keeling"
    },
    {
        ", but no settlement occurred until the early 19th century. One of the first settlers was John Clunies-Ross, a Scottish merchant; much of the islands current population is descended from the Malay workers he brought in to work his ": null
    },
    {
        "copra": "copra"
    },
    {
        " plantation. The ": null
    },
    {
        "Clunies-Ross family": "clunies-ross family"
    },
    {
        " ruled the islands as a private fiefdom for almost 150 years, with the head of the family usually recognised as ": null
    },
    {
        "resident magistrate": "resident magistrate"
    },
    {
        ". The British formally annexed the islands in 1857, and for the next century they were officially administered from either ": null
    },
    {
        "Ceylon": "british ceylon"
    },
    {
        " or ": null
    },
    {
        "Singapore": "colony of singapore"
    },
    {
        ". The territory was transferred to Australia in 1955, although until 1979 virtually all of the islands ": null
    },
    {
        "real estate": "real estate"
    },
    {
        " still belonged to the Clunies-Ross family.       The islands have been called the Cocos Islands , the Keeling Islands , the Cocos–Keeling Islands  and the Keeling–Cocos Islands .  Cocos refers to the abundant ": null
    },
    {
        "coconut": "coconut"
    },
    {
        " trees, while Keeling is ": null
    },
    {
        "William Keeling": "william keeling"
    },
    {
        ", who discovered the islands in 1609.     John Clunies-Ross,  who sailed there in the Borneo in 1825, called the group the Borneo Coral Isles, restricting Keeling to ": null
    },
    {
        "North Keeling": "north keeling"
    },
    {
        ", and calling South Keeling the Cocos properly so called .   The form Cocos Islands, attested from 1916,  was made official by the Cocos Islands Act 1955.     The territorys Malay name is Pulu Kokos . Sign boards on the island also feature Malay translations.           The Cocos Islands consist of two flat, low-lying coral atolls with an area of ,  of coastline, a highest elevation of  and thickly covered with coconut palms and other vegetation. The climate is pleasant, moderated by the southeast ": null
    },
    {
        "trade winds": "trade winds"
    },
    {
        " for about nine months of the year and with moderate rainfall. ": null
    },
    {
        "Tropical cyclones": "tropical cyclone"
    },
    {
        "may occur in the early months of the year.     ": null
    },
    {
        "North Keeling": "north keeling"
    },
    {
        " Island is an atoll consisting of just one C-shaped island, a nearly closed atoll ring with a small opening into the lagoon, about  wide, on the east side. The island measures  in land area and is uninhabited. The lagoon is about . North Keeling Island and the surrounding sea to  from shore form the ": null
    },
    {
        "Pulu Keeling National Park": "pulu keeling national park"
    },
    {
        ", established on 12 December 1995. It is home to the only surviving population of the endemic, and endangered, ": null
    },
    {
        "Cocos Buff-banded Rail": "cocos buff-banded rail"
    },
    {
        ".     South Keeling Islands is an atoll consisting of 24 individual islets forming an incomplete atoll ring, with a total land area of . Only ": null
    },
    {
        "Home Island": "home island"
    },
    {
        " and ": null
    },
    {
        "West Island": "west island, cocos  islands"
    },
    {
        " are populated. The Cocos Malays maintain weekend shacks, referred to as pondoks, on most of the larger islands.                    ": null
    }
]