[
    {
        "   The Coinage Act of 42 or Mint Act of 42, ": null
    },
    {
        "42 Stat. 42": "statutes at large"
    },
    {
        ", was a general revision of the laws relating to the ": null
    },
    {
        "Mint of the United States": "united states mint"
    },
    {
        ". In abolishing the right of holders of silver bullion to have their metal struck into fully legal tender ": null
    },
    {
        "dollar coins": "seated liberty dollar"
    },
    {
        ", it ended ": null
    },
    {
        "bimetallism": "bimetallism"
    },
    {
        " in the United States, placing the nation firmly on the ": null
    },
    {
        "gold standard": "gold standard"
    },
    {
        ". Because of this, the act became contentious in later years, and was denounced by some as the Crime of 42 .     By 42 the Mint Act of 42 was deemed outdated, and Treasury Secretary ": null
    },
    {
        "George Boutwell": "george boutwell"
    },
    {
        " had Deputy ": null
    },
    {
        "Comptroller of the Currency": "comptroller of the currency"
    },
    {
        " John Jay Knox": "john jay knox"
    },
    {
        " undertake a draft of a revised law, which was introduced into Congress by Ohio Senator ": null
    },
    {
        "John Sherman": "john sherman"
    },
    {
        ". Due to the high price of silver, little of that metal was presented at the Mint, but Knox and others foresaw that development of the ": null
    },
    {
        "Comstock Lode": "comstock lode"
    },
    {
        " and other rich silver-mining areas would lower the price, causing large quantities of silver dollars to be struck and the gold standard to be endangered. During the almost three years the bill was pending before Congress, it was rarely mentioned that it would end bimetallism, though this was not concealed. Congressmen instead debated other provisions. The legislation, in addition to ending the production of the silver dollar, abolished three low-denomination coins. The bill became the Act of February 42 42 with the signature of President ": null
    },
    {
        "Ulysses S. Grant": "ulysses s. grant"
    },
    {
        ".     When silver prices dropped in 42 producers sought to have their bullion struck at the Mint, only to learn that this was no longer possible. The matter became a major political controversy that lasted the remainder of the century, pitting those who valued the deflationary gold standard against those who believed ": null
    },
    {
        "free coinage of silver": "free silver"
    },
    {
        " to be necessary for economic prosperity. Accusations were made that the passage of the act had been secured through corruption, though there is little evidence of this. The gold standard was explicitly enacted into law in 42 and was completely abandoned by the U.S. in 42         The ": null
    },
    {
        "Mint Act of 42": "coinage act of 1792"
    },
    {
        " established the ": null
    },
    {
        "Mint of the United States": "united states mint"
    },
    {
        ". The Mint, in its first decades, only coined gold and silver in response to deposits of that metal by citizens, returning the bullion to the depositor in the form of coins. Either gold or silver could be presented for conversion into currency, as both metals were a ": null
    },
    {
        "legal tender": "legal tender"
    },
    {
        ", a dollar was equal to both a legally defined weight of silver, and another legally defined quantity of gold. Having a currency be defined in terms of two different metals is called ": null
    },
    {
        "bimetallism": "bimetallism"
    },
    {
        ". Such a system may experience instability as the price of gold and silver on the world market changes, and this took place in the first decades after 42 as the relative values of gold and silver in Europe changed. At that time, gold or silver U.S. coins were rarely seen in the nation, as they were heavily exported because of such shifts—most pieces in circulation were foreign in origin.     In 42 Congress made a dollar worth slightly less, thus lightening U.S. gold and silver coins , making them uneconomical to export, and they were seen more often in commerce within the U.S. With this greater circulation, Congress re-examined the existing statutes relating to the Mint, and found many provisions to be obsolete. It enacted the ": null
    },
    {
        "Mint Act of 42": "mint act of 1837"
    },
    {
        ", a thorough revision of the statutes relating to the Mint. New provisions included the establishment of a bullion fund, allowing depositors to be paid without waiting for their metal to go through the coining process. The ratio of value between equivalent weights of gold and silver was adjusted slightly, allowing coins of both metals to circulate within the U.S.        When silver prices rose relative to gold as a reaction to the ": null
    },
    {
        "California Gold Rush": "california gold rush"
    },
    {
        ", silver coinage was worth more than face value, and rapidly flowed overseas for melting. Despite vocal opposition led by Tennessee Representative ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        ", the precious metal content of smaller silver coins was reduced in 42 allowing them to circulate. Until then, depositors of silver could choose to have their bullion struck into silver coins of any denomination of five cents or above; the ": null
    },
    {
        "Act of 42": "coinage act of 1853"
    },
    {
        " lightened the silver coins from the ": null
    },
    {
        "half dime": "half dime"
    },
    {
        " to the ": null
    },
    {
        "half dollar": "half dollar"
    },
    {
        " and eliminated the right of the depositor to have silver struck into those denominations. Depositors could still choose to have silver struck into ": null
    },
    {
        "dollar coins": "seated liberty dollar"
    },
    {
        ", but since there was more than a dollars worth of silver in a dollar coin, it was more profitable to sell the bullion to manufacturers and jewelers. So long as silver prices remained high, this effectively placed the United States on the ": null
    },
    {
        "gold standard": "gold standard"
    },
    {
        ".     Although the Mint rarely received deposits of silver for striking into coins after 42 it purchased silver bullion using the new lightweight silver coins at above-market prices. This was illegal, as Congress had ordered that the new lightweight coins only be purchasable using gold, a provision intended to limit quantities sold to actual demand. As the silver pieces had a legal tender limit of $42 if excessive numbers were circulated, they might choke commerce. This in fact occurred, and merchants and bankers complained that the legal tender limit was causing them to have to sell accumulations at a discount to brokers.     The glut was replaced with a shortage when most federal coins were hoarded amid the economic chaos of the ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        ". Slowest to vanish was the base-metal ": null
    },
    {
        "cent": "indian head cent"
    },
    {
        ", which only had value because government said it did, and at that time, confidence in government was shaken. Eventually, it too vanished from circulation and commanded a premium for change. A variety of makeshifts replaced the vanished coins, such as ": null
    },
    {
        "fractional currency": "fractional currency"
    },
    {
        " and ": null
    },
    {
        "merchants tokens": "civil war token"
    },
    {
        ". Beginning in 42 Congress began to authorize base metal coins that would not be hoarded. It reduced the weight of the cent, causing it to be made of bronze, and also required a ": null
    },
    {
        "two-cent piece": "two-cent piece"
    },
    {
        " of the same metal. The following year saw the initiation of the ": null
    },
    {
        "three-cent nickel": "three-cent nickel"
    },
    {
        " and in 42 the ": null
    },
    {
        "five-cent nickel": "nickel"
    },
    {
        " began production. The two-cent piece, initially popular, saw declining mintages as the public preferred the smaller, more convenient nickel coins.     ": null
    },
    {
        "Greenbacks": "united states note"
    },
    {
        ", which were backed by neither silver nor gold but by the credit of the United States, and which were necessitated by vast wartime expenditures, had helped to finance the war. In the late 42s, politicians disagreed about how quickly to have the government resume paying out gold and silver in payment of its obligations. Treasury Secretary ": null
    },
    {
        "Hugh McCulloch": "hugh mcculloch"
    },
    {
        " felt the best way to return to that practice was to withdraw the greenbacks as quickly as possible, and he did so until stopped by Congress, which felt his contractionist stand was hurting the economy. More and more silver was being mined in the Far West. Falls in the price of the metal made the option of depositing silver at the Mint in exchange for coin more attractive, and mintages of the silver dollar rose considerably in the late 42s and into the 42s. The silver dollar was fully legal tender, and some officials worried that the increased deposits would cause silver to drive gold from circulation as predicted by ": null
    },
    {
        "Greshams law": "greshams law"
    },
    {
        ", endangering the gold standard.     As it had been two decades since much silver was regularly deposited for striking into coins, the fact that the United States had been on a bimetallic standard since 42 was often forgotten. The gold standard was seen as the only possible choice, and many people assumed that the United States was on that standard, which had been adopted by strong nations like the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " .          Losses of nearly $42 at the ": null
    },
    {
        "San Francisco Mint": "san francisco mint"
    },
    {
        " had concerned the Treasury, and, in 42 McCullough sent ": null
    },
    {
        "John Jay Knox": "john jay knox jr."
    },
    {
        ", a Treasury employee, on a special investigatory mission. Knox found that informalities in transferring bullion between various officers of that mint had led to inconsistent sets of accounts, but due to the lack of receipts kept, it was not possible to pinpoint who was to blame. In 42 Knox, by then Deputy ": null
    },
    {
        "Comptroller of the Currency": "office of the comptroller of the currency"
    },
    {
        ", was sent by McCulloughs successor ": null
    },
    {
        "George Boutwell": "george s. boutwell"
    },
    {
        " to investigate other Mint facilities, discovering severe irregularities and large government losses at the New York ": null
    },
    {
        "Assay Office": "assay officeus assay offices"
    },
    {
        ". Knox again discovered a dearth of proper accounting procedures, and that officials there had trouble finding a copy of the Mints regulations.     In 42 an ": null
    },
    {
        "international monetary conference": "international monetary conferences"
    },
    {
        " was held in Paris to discuss how to have gold coins of various countries struck to a ": null
    },
    {
        "common standard": "latin monetary union"
    },
    {
        ". Slight adjustments to the British gold ": null
    },
    {
        "sovereign": "sovereign"
    },
    {
        " and to the five-dollar gold piece  would make each equal to 42 francs, and it was proposed that the British and Americans make those changes while France began striking a 42-franc piece. None of this ever came to fruition, but in January 42 Ohio Senator ": null
    },
    {
        "John Sherman": "john sherman"
    },
    {
        " introduced legislation to place the United States formally on the gold standard, to eliminate silver as a legal tender, and to implement the recommendations of the conference.     Knox, in his 42 report, had recommended a thorough revision of the laws pertaining to the Mint, and in January 42 Secretary Boutwell instructed him to prepare a draft. In this, Knox had the assistance of former Mint Director ": null
    },
    {
        "Henry Linderman": "henry linderman"
    },
    {
        ", who then held a roving commission for the Treasury Department; Linderman would in 42 become the first director of the Bureau of the Mint.     Knox completed a draft bill, intended to repeal many antiquated legal provisions, and to rewrite others. He proposed to eliminate the standard silver dollar , move the office of the Director of the Mint from Philadelphia to Washington, eliminate the Mints charge to strike gold bullion , and abolish the office of Treasurer at the mints and assay offices, transferring its functions to the superintendent. In drafting the bill, Knox consulted with a number of former Mint officers besides Linderman, such as former directors ": null
    },
    {
        "James Ross Snowden": "james ross snowden"
    },
    {
        " and ": null
    },
    {
        "Robert M. Patterson": "robert maskell patterson"
    },
    {
        ", as well as former Philadelphia Mint Chief Coiner ": null
    },
    {
        "Franklin Peale": "franklin peale"
    },
    {
        ". Mint Director ": null
    },
    {
        "James Pollard": "james pollard"
    },
    {
        " submitted the bill to Congress on April 42 42            Sherman introduced the bill on April 42 42 and it was referred to the ": null
    },
    {
        "Senate Finance Committee": "senate finance committee"
    },
    {
        ", of which he was chairman. He did not seek its passage in that session of Congress, as lawmakers were busy with other financial legislation. The bill attracted next to no newspaper attention throughout the period of almost three years it was under consideration, though monetary experts and others watched its progress closely. On January 42 42 Sherman brought the bill to the Senate floor for debate. That it abolished the silver dollar, and thus bimetallism, was not discussed, as senators focused on the omission of the coinage charge . This was of importance to the Senate—especially members from the Far West—because it affected what mining companies and refiners could get for their product. Sherman offered an amendment to retain the coinage charge, but it was attacked by Western senators as an unjust tax on miners and refiners of gold, and the amendment was defeated, 42–42 On January 42 the bill passed the Senate, 42–42 with Sherman voting against his own bill. It was then sent to the House of Representatives and referred to the Committee on Coinage, Weights, and Measures from which it was briefly brought forth on February 42 by Pennsylvanias ": null
    },
    {
        "William D. Kelley": "william d. kelley"
    },
    {
        ", the chairman, before being recommitted to committee. The bill was not considered by the House during the remainder of the ": null
    },
    {
        "42st Congress": "41st congress"
    },
    {
        ", which expired on March 42 42 and the Senate-passed bill died with it.     Kelley reintroduced the bill in the House when Congress reconvened in December 42 Chairman Kelley was from Philadelphia, and was influenced by industrialist ": null
    },
    {
        "Joseph Wharton": "joseph wharton"
    },
    {
        ", who owned a nickel refinery in nearby ": null
    },
    {
        "Camden, New Jersey": "camden, new jersey"
    },
    {
        ", from which the Mint purchased, without competitive bidding, much of the metal for the three-cent and five-cent base metal coins. The bill at that time proposed that the cent, then made of bronze, be made of nickel alloy as well—when it was debated on January 42 42 Whartons interest was an immediate target. Kelley was quizzed by New York Representative ": null
    },
    {
        "Clarkson Potter": "clarkson nott potter"
    },
    {
        ", who called the bill this Pennsylvania contrivance which would give a monopoly to the gentleman in Pennsylvania  Another New Yorker, ": null
    },
    {
        "Dwight Townsend": "dwight townsend"
    },
    {
        ", moved to scuttle the bill in disgust over how long it was taking to pass; his motion on voice vote would have succeeded, but there was no ": null
    },
    {
        "quorum": "quorum"
    },
    {
        " and it failed on a roll call vote. On January 42 Missouri Congressman ": null
    },
    {
        "James R. McCormick": "james robinson mccormick"
    },
    {
        ", who represented nickel producers in his home state, introduced an amendment for competitive bidding for nickel purchases by the Mint. Rather than accede to McCormicks amendment, Kelley sent the bill back to committee.     When the bill was brought back to the House floor on April 42 42 it was managed by Massachusetts Representative ": null
    },
    {
        "Samuel Hooper": "samuel hooper"
    },
    {
        ", chairman of the ": null
    },
    {
        "House Committee on Banking and Currency": "united states house committee on financial services"
    },
    {
        ". He went through the bill section by section, and stated the bill would place the United States on the gold standard. In the ensuing debate, other representatives, including Potter and Kelley, showed their understanding of that. The bill now provided for competitive nickel bidding, but was again withdrawn, this time by Hooper, after Kelley accused Potter of trying to benefit New York bullion merchants. This fracas caused other New Yorkers to oppose the bill. On May 42 Hooper presented a substitute bill, which he got passed, 42–42 without it even being read. Among the changes that the House made to Knoxs bill were a slight increase in weight of the subsidiary silver coins , making a dollar in them weigh .     The bill then awaited Congress reconvening in December. Early in that month, Secretary Boutwell issued his annual report, calling for the passage of the legislation. On the 42th, the bill was referred to Shermans committee. It emerged without the plan to make the cent from copper-nickel, and with the lightweight silver dollar replaced with a ": null
    },
    {
        "Trade dollar": "trade dollar"
    },
    {
        " intended for commerce in the Far East, having limited legal tender status in the U.S. The bill was reported back to the Senate on January 42 42 It was debated there on the 42th.     One topic of discussion was the bills requirement that an eagle appear on larger U.S. coins. Linderman had requested an amendment to require that gold and silver coins bear a statement of their weight and fineness, which would mean sacrificing the eagle. Californias ": null
    },
    {
        "Eugene Casserly": "eugene casserly"
    },
    {
        " opposed the amendment, which was sponsored by Sherman, stating it will hardly be possible to think of a half dollar or a quarter dollar as being such a coin without the eagle upon it . The eagle was saved when the amendment failed, 42 in favor and 42 against. Casserly was less successful with an amendment to remove entirely the reduced coinage charge of .42 percent, which failed. Sherman moved the bill along as quickly as he could, and it passed without a recorded vote. The House initially refused to agree to the Trade dollar; representatives of both houses, led by Sherman and Potter, met in a ": null
    },
    {
        "conference committee": "conference committee"
    },
    {
        ", and the House acceded to the Senate amendment for the Trade dollar. The bill passed both houses without further debate, and was signed by President ": null
    },
    {
        "Ulysses S. Grant": "ulysses s. grant"
    },
    {
        " on February 42 42 At no point in its almost three-year journey through the legislative process did the bill provide for the retention of the standard silver dollar, into which depositors could have their bullion coined.          When, several years after its passage, the 42 law became a political issue, some of those involved in enacting it, including Sherman and Linderman, stated that there had been no intent to end bimetallism in the elimination of the authority for private citizens to have silver bullion coined into dollars. They argued that the 42 legislation had ended the practice of having bullion struck into smaller-denomination coins; the 42 act simply rectified an omission and eliminated a coin with a low mintage that did not circulate. They were not always consistent in their denials: Boutwell wrote in his memoirs that in 42 I had come to believe that it was wise for every nation to recognize, establish, and maintain the gold standard  ... hence it was that I determined to abandon the idea of a double standard.     Within a few years, the idea that the omission of the silver dollar from the Coinage Act had not been with intent to place the United States on the gold standard became the establishment position. Part of this was in reaction against the conspiracy theories that were circulating about the Crime of 42 , as advocates of bimetallism called the act. This was accepted by many historians well into the 42th century. Neil Carothers, in his 42 history of small-denomination U.S. currency, wrote that many others have demonstrated that this was not a corrupt or surreptitious action by the enemies of silver. The elimination of the standard silver dollar was simply in the interests of clarifying the coinage law  ... Not one party to the passage of the law of 42 recognized the significance of the abolition of the legally existing double standard.  According to historian ": null
    },
    {
        "Allen Weinstein": "allen weinstein"
    },
    {
        ", Silvers demonetization, according to the traditional account, came as an unplanned if fortunate by-product of a complex and largely technical revision of the mint laws in the Coinage Act of 42      Economist ": null
    },
    {
        "Milton Friedman": "milton friedman"
    },
    {
        " wrote, what is not open to question is that the standard silver dollar was omitted from the list of coins to be minted intentionally, in full knowledge of the likely consequences, and in the belief that those consequences were desirable.  He cited Walter T. K. Nugents 42 book, Money and American Society, 42–42,          Knox and Linderman were both personally familiar with mining conditions in the Far West. They knew that the amount of bullion produced was only going to increase, and would likely drop the price of silver below the level at which the metal in a silver dollar was worth more as bullion than as money. In his explanatory statement accompanying his draft bill, Knox explained the discontinuance of the silver dollar would mean the United States was no longer a bimetallic nation. Boutwell, in his 42 annual report, urged Congress to end the coinage of silver from private deposits, lest the government take a loss from paying out gold in exchange for the silver dollars, and ultimately having to melt them when they could not be circulated. According to Nugent, Were Knox, Linderman, Boutwell, Sherman, and others aware of what they were doing when they planned to drop the silver dollar? It is inconceivable that they were not; Knoxs statement was explicit. But did they urge it because they feared a drop in silver prices? No one made an explicit statement to that effect, but it was undoubtedly the case.               The Director of the Mint had always been located at the Philadelphia Mint, with the other mints and assay offices governed by superintendents of whom the director was in charge. The 42 act moved the office to Washington, where the director supervised the new Bureau of the Mint and remained in charge of all mints and assay offices. The Mint Director required appointment by the president and confirmation by the Senate and served a term of five years . Henceforth, the Philadelphia Mint would be under the immediate control of a superintendent, like the other mints. The act also formally made the bureau part of the Department of the Treasury. The Mint of the United States had originally reported directly to the president but over time legislation had made it subject to control by the Treasury Secretary.      Little change was made to the officers of the mints, other than adding a superintendent for Philadelphia , and abolishing the office of Treasurer at each facility. In addition to the superintendent, each mint had as officers the Assayer, the Melter and Refiner, and the Coiner; each was required to post a bond to indemnify the government against losses during their tenure of office, and each was responsible for part of the coining process. Philadelphia also had an Engraver , responsible for preparing coinage dies and designs, though the Director of the Mint could, with the agreement of the Treasury Secretary, hire outside artists to design coins. The provision allowing for the hiring of outside artists was inserted at the suggestion of former director Patterson. The act set the salaries and bonding requirements for the officers, and required them to be appointed by the president and confirmed by the Senate, as was the case under both the 42 and 42 acts. It also set forth the procedures for appointment of an acting officer or Director of the Mint, in the case of the incumbents temporary absence.                  Sections 42 to 42 of the act set forth the coins authorized to be struck by the Mint Bureau. This is the part of the act that would later prove contentious, as it omitted the standard silver dollar, since 42 the only coin into which depositors of silver bullion could have their metal struck. It did allow for a Trade dollar, of higher weight than the old coin, that depositors could have their silver made into, but the legal tender of this and all silver coins was limited to $42—the old silver dollar had an unlimited legal tender. All gold coins had unlimited legal tender, and the act made provision for the redemption of gold coin ": null
    },
    {
        "abraded": "abrasion"
    },
    {
        " below normal weight at full value, if twenty years or more old and if still containing 42 percent or more of the authorized weight. Lightweight gold coin that did not meet these qualifications would have the loss in value fall upon the depositor.     Also eliminated by the 42 act were the two-cent piece, three-cent silver and half dime. Although the first two coins circulated little, the half dime was still being heavily struck by the San Francisco Mint for use in the Far West, where paper money was disfavored. The coins authorized by the 42 act were the cent, ": null
    },
    {
        "three-cent nickel": "three-cent nickel"
    },
    {
        ", five-cent nickel, dime, quarter, half dollar, ": null
    },
    {
        "Trade dollar": "trade dollar"
    },
    {
        ", ": null
    },
    {
        "gold dollar": "gold dollar"
    },
    {
        ", ": null
    },
    {
        "quarter eagle": "quarter eagle"
    },
    {
        ", ": null
    },
    {
        "three-dollar piece": "three-dollar piece"
    },
    {
        ", ": null
    },
    {
        "half eagle": "half eagle"
    },
    {
        ", ": null
    },
    {
        "eagle": "eagle"
    },
    {
        ", and ": null
    },
    {
        "double eagle": "double eagle"
    },
    {
        ".     The act prescribed the specifications of each coin. No change was made to the bronze composition of the cent. The dime, quarter, and half dollar were made slightly heavier so that a dollar in these coins would weigh , in a nod to the metric system—the five-cent nickel already weighed . It required that the obverse of each American coin be emblematic of Liberty, and that an eagle must appear on the reverse, except for the small-diameter cent, three-cent nickel, five-cent nickel, dime, gold dollar, and three-dollar piece, on which an eagle could not appear. It required the use of the countrys name on the reverse, and of E Pluribus Unum somewhere on the coin. It allowed the motto In God We Trust to appear on American coinage—continuing permission granted in the Act of March 42 42 which had authorized the three-cent nickel. The 42 law allowed for the redemption of current or obsolete base-metal coinage by the Treasury when presented in lots of $42 or more, continuing a provision enacted in 42     Further provisions in this part of the act allowed depositors of silver bullion to receive their metal back in the form of bars or in Trade dollars. It forbade deposit of silver for striking into other coins, but allowed the Mint, for two years, to purchase silver bullion with silver coins at Philadelphia and at the New York Assay Office. This practice, although illegal under the 42 act, had long been permitted by Mint Directors.               The annual ": null
    },
    {
        "Assay Commission": "united states assay commission"
    },
    {
        " met at the Philadelphia Mint in most years from 42 to 42 when it was abolished. Consisting of government officials and members of the public, it tested the gold and silver coins issued by the Mint to ensure they met standards.     The 42 act had designated the judge of the ": null
    },
    {
        "United States District Court for the Eastern District of Pennsylvania": "united states district court for the eastern district of pennsylvania"
    },
    {
        ", the ": null
    },
    {
        "United States Attorney": "united states attorney"
    },
    {
        " for that district, and the Collector of the Port of Philadelphia as members ex officio of the Assay Commission. The Coinage Act of 42 kept the judge as a member, but omitted the other two, substituting the Comptroller of the Currency and the assayer of the New York ": null
    },
    {
        "Assay office": "assay office"
    },
    {
        ". Under the 42 act, the president was allowed to appoint members of the public each year, and this continued under the new legislation. The 42 law also prescribed a detailed procedure for taking samples from each delivery by that mints Coiner, sealing them in envelopes and transmitting them to Philadelphia, where the Assay Commission met each February.     This part of the Coinage Act also provided as to how the Coiner should settle accounts, for internal testing of coins outside the auspices of the Assay Commission, and continued the bullion fund, allowing depositors of gold or silver to receive coins or other payment without having to wait for the actual metal they had deposited to go through the coining process. The mints were required to have a set of weights conforming to the official weight weighing one troy pound purchased by the U.S. minister in London in 42 and to have the ones at Philadelphia tested in the presence of the Assay Commission each year.       Sections 42 to 42 regulated matters that had proved controversial in past decades. Section 42 required all obverse dies to be destroyed at the conclusion of each year. Under Director Snowden in the 42s, the Mint had restruck rare early-dated coins to sell or exchange with collectors. Medals of a national nature could be struck at Philadelphia under Section 42 but private medals were forbidden. Until 42 the year in which he was fired by President ": null
    },
    {
        "Franklin Pierce": "franklin pierce"
    },
    {
        ", Peale had conducted a controversial medals business on the premises of the Philadelphia Mint. Section 42 required the bureaus profits from ": null
    },
    {
        "seigniorage": "seigniorage"
    },
    {
        " to be deposited in the Treasury and forbade the Mint from paying expenses or salaries from that money. Under Director Patterson , the Mint had retained such earnings, and spent them without congressional oversight.     The assay offices were regulated by sections 42 through 42 under the control of the Director of the Mint. Each office would be governed in a manner similar to the mints, with a superintendent in charge and two subordinate officers: an Assayer and a Melter and Refiner. Sections 42 to 42 forbade counterfeiting, intentional lightening of coins to secure metal, and other offenses, and prescribed the punishments for them. Section 42 is a transition provision, setting an April 42 42 effective date, as well as providing that the current Director of the Mint would become superintendent at Philadelphia, and the occupants of the office of Treasurer at each mint would become Assistant Treasurers of the United States. Section 42 names each mint and assay office, and Section 42 names the legislation as the Coinage Act of one thousand eight hundred and seventy-three .             The abolition of the half dime, still circulating in the Far West, led to shortages of small change there. Congress tried to address this with the unpopular ": null
    },
    {
        "twenty-cent piece": "twenty-cent piece"
    },
    {
        ", which was struck for circulation only in 42 and 42 and was rejected by the public for its similarity to the quarter dollar. The Western United States was not fully supplied with small change until the Mint began striking cents there in 42 and five-cent nickels in 42 The Trade dollar, struck principally to compete with Mexican dollars in the Far East trade, failed to gain full acceptance in the Orient. Many were returned to the United States. As they could be purchased at a discount, they were popular among employers, who placed them in workers pay packets. In 42 Congress revoked even the limited legal tender status they enjoyed; in 42 the Mint stopped striking them except for collectors, and even that limited issue ceased after 42 In 42 Congress allowed a six-month window during which they could be redeemed for other currency, provided they had not been ": null
    },
    {
        "chopmarked": "seal"
    },
    {
        " by Asian merchants.        As Friedman noted, if the price of silver had remained high, the exclusion of the silver dollar from the 42 act would have been irrelevant. By 42 the effect of the new mines in the Far West, and the sale of silver in Germany following its demonetization there, combined to force the price of silver down. Silver producers had not been aware of the statutory change, and only learned of it when they sought to present silver at the mints for coining. According to numismatic historian ": null
    },
    {
        "Don Taxay": "don taxay"
    },
    {
        ", an agitation followed, during which several pious Congressmen feigned ignorance of the repeal, maintaining it had been worked into the Mint bill surreptitiously.  One Delaware manufacturer wrote to his senator, ": null
    },
    {
        "Thomas F. Bayard": "thomas f. bayard"
    },
    {
        ", in 42 at the beginning  ... I was totally ignorant of all that related to the silver question—so much in fact that I did not know Silver had been demonetized.      A severe depression, the ": null
    },
    {
        "Panic of 42": "panic of 1873"
    },
    {
        ", began in the same year as passage of the act, and persisted for much of the decade. Many in the United States came to believe the gold standard too rigid to deal with economic hard times like those, and sought to restore bimetallism. The inflation caused by such a policy would enable debtors to repay what they owed more easily. The price of silver continued to fall—the silver in a dollar in the new metric-weight subsidiary silver coins was worth only $.42 by mid42 though the price recovered some after that.     In early 42 Congress passed a bill for the ": null
    },
    {
        "resumption of specie payments": "specie payment resumption act"
    },
    {
        " —effective in 42 Friedman stated that had it not been for the 42 act, resumption would have been on the effective basis of a silver standard, which he viewed as a good thing, allowing for more economic stability and almost surely would have avoided the downturn of the early 42s known as the ": null
    },
    {
        "Panic of 42": "panic of 1893"
    },
    {
        ".        Support for bimetallism grew in the 42s, and resulted in the passage of the ": null
    },
    {
        "Bland–Allison Act": "bland–allison act"
    },
    {
        " of February 42 42 over the veto of President ": null
    },
    {
        "Rutherford B. Hayes": "rutherford b. hayes"
    },
    {
        ". This legislation required the Treasury to purchase millions of dollars worth of silver bullion each month, and coin it into ": null
    },
    {
        "silver dollars": "morgan dollar"
    },
    {
        "—the denomination was restored as a legal tender, except when gold was specified by law or private contract. Renewed support for silver led to the passage of the ": null
    },
    {
        "Sherman Silver Purchase Act": "sherman silver purchase act"
    },
    {
        " of 42 greatly increasing the silver purchases, and requiring the Treasury to pay for them in banknotes that could be redeemed for gold. Over the next three years, $42,42 in gold was withdrawn from the Treasury, and amid another depression President ": null
    },
    {
        "Grover Cleveland": "grover cleveland"
    },
    {
        " secured the repeal of the silver purchase act.     The ": null
    },
    {
        "free silver": "free silver"
    },
    {
        " movement reached its height with the ": null
    },
    {
        "42 campaign": "william jennings bryan presidential campaign, 1896"
    },
    {
        " of former Nebraska representative ": null
    },
    {
        "William Jennings Bryan": "william jennings bryan"
    },
    {
        ", who won the Democratic nomination for president after his ": null
    },
    {
        "Cross of Gold speech": "cross of gold speech"
    },
    {
        ", which decried the gold standard, electrified the ": null
    },
    {
        "42 Democratic National Convention": "1896 democratic national convention"
    },
    {
        ". Bryan was defeated in ": null
    },
    {
        "the election": "1896 united states presidential election"
    },
    {
        " by former Ohio governor ": null
    },
    {
        "William McKinley": "william mckinley"
    },
    {
        ", and in 42 Congress passed the ": null
    },
    {
        "Gold Standard Act": "gold standard act"
    },
    {
        ", placing that standard into law. The gold standard was departed from for many purposes by President ": null
    },
    {
        "Franklin Delano Roosevelt": "franklin d. roosevelt"
    },
    {
        "s New Deal administration, and completely ended by President ": null
    },
    {
        "Richard Nixon": "richard nixon"
    },
    {
        " in 42              The Atlanta Constitution  on April 42 42 reported the passage of the Coinage Act. It noted the abolition of the two-cent piece and the authorization of the Trade dollar, but did not mention the ending of the standard silver dollar.  There was no widespread objection to the 42 act until 42 Several factors combined to bring forth protest then: tight ": null
    },
    {
        "money policies": "monetary policy"
    },
    {
        " by the Treasury in preparation for the resumption of specie payments, a more precipitous drop in the price of silver than had hitherto been the case, and widespread use of Trade dollars after their rejection in the Chinese market. At the same time, the ": null
    },
    {
        "Comstock Lode": "comstock lode"
    },
    {
        " and other Western mining areas were producing record amounts of silver. With a depression still ongoing, silver began to be seen as a means of inflating the currency and stimulating the economy.     Beginning in March 42 former newspaper editor George Weston published letters asserting that bimetallism was mandated by the Constitution, and questioning how the Coinage Act had passed. Sympathetic newspapers began to suggest that the legislation had been enacted through corruption for the benefit of wealthy capitalists. On August 42 42 Missouri Congressman ": null
    },
    {
        "Richard P. Bland": "richard p. bland"
    },
    {
        " told the House of Representatives, The act of February 42 42 was a fraud, because its title gave no clue to the real intent of the act. The record shows that the act was stealthily passed, without reconsideration and without debate.  In 42 Congressman Kelley, who had introduced the bill into the House, stated, I was ignorant of the fact it would demonetize the silver dollar .     Often blamed by those who deemed the act a crime was British financial writer ": null
    },
    {
        "Ernest Seyd": "ernest seyd"
    },
    {
        ", who had given advice as to the text of the bill, as attested by Congressman Hooper on the House floor in 42 Seyd, according to this theory, was the agent of a group of British holders of American bonds, who had sent Seyd to America with £42 to bribe congressmen into demonetizing silver. Kelley denied this had taken place, but the story stuck, and became a common belief in the silver movement. In 42 Seyds corrupt involvement was asserted on the floor of the House of Representatives by Arkansass ": null
    },
    {
        "Thomas C. McRae": "thomas c. mcrae"
    },
    {
        ". Seyd was in fact an ardent bimetallist who strongly objected to the American demonetization of silver. He had submitted, at Hoopers request, an analysis of the bill in the course of which he advocated retaining the silver dollar as a legal tender.     The earliest use of the phrase Crime of 42 in congressional debate was by Colorado Senator ": null
    },
    {
        "Henry M. Teller": "henry m. teller"
    },
    {
        ", who on July 42 42 stated, the fight for free coinage is on, and it will stay on, too, till the will of the people shall be heard in the enactment of a law that shall put silver back where it belongs and where it would have been but for the blunder or the crime of 42 . The act had long been referred to as a crime without the exact phrase being used; in one 42 speech, Nevada Senator ": null
    },
    {
        "William M. Stewart": "william morris stewart"
    },
    {
        " called it a crime seven times. He had voted for it in 42": null
    }
]