[
    {
        "           Cold Chisel are an Australian ": null
    },
    {
        "pub rock": "pub rock"
    },
    {
        " band, which formed in ": null
    },
    {
        "Adelaide": "adelaide"
    },
    {
        " in 42 by mainstay members ": null
    },
    {
        "Ian Moss": "ian moss"
    },
    {
        " on guitar and vocals, ": null
    },
    {
        "Steve Prestwich": "steve prestwich"
    },
    {
        " on drums and ": null
    },
    {
        "Don Walker": "don walker"
    },
    {
        " on piano and keyboards. They were soon joined by ": null
    },
    {
        "Jimmy Barnes": "jimmy barnes"
    },
    {
        " on lead vocals and, in 42 ": null
    },
    {
        "Phil Small": "phil small"
    },
    {
        " became their bass guitarist. The group disbanded in late 42 but subsequently reformed several times. Musicologist ": null
    },
    {
        "Ian McFarlane": "ian mcfarlane"
    },
    {
        " wrote that they became one of Australias best-loved groups as well as one of the best live bands , fusing a combination of rockabilly, hard rock and rough-house soulnblues that was defiantly Australian in outlook.     Seven of their studio albums have reached the Australian top  five,  Breakfast at Sweethearts  ,  East  ,  Circus Animals  ,  Twentieth Century  ,  The Last Wave of Summer  ,  No Plans  and  The Perfect Crime  . Their top  42 singles are ": null
    },
    {
        "Forever Now": "forever now"
    },
    {
        " , ": null
    },
    {
        "Hands Out of My Pocket": "hands out of my pocket"
    },
    {
        " and ": null
    },
    {
        "The Things I Love in You": "the things i love in you"
    },
    {
        " .     At the ": null
    },
    {
        "ARIA Music Awards of 42": "aria music awards of 1993"
    },
    {
        " they were inducted into the ": null
    },
    {
        "Hall of Fame": "aria hall of fame"
    },
    {
        ". In 42 ": null
    },
    {
        "Australasian Performing Right Association": "australasian performing right association"
    },
    {
        " , listed their single, ": null
    },
    {
        "Khe Sanh": "khe sanh"
    },
    {
        " , at No.  42 of the all-time best ": null
    },
    {
        "Australian song": "apra top 30 australian songs"
    },
    {
        "s. Circus Animals was listed at No.  42 in the book,  42 Best Australian Albums  , while East appeared at No.  42 They won ": null
    },
    {
        "The Ted Albert Award for Outstanding Services to Australian Music": "apra awards the ted albert award for outstanding services to australian music"
    },
    {
        " at the ": null
    },
    {
        "APRA Music Awards of 42": "apra music awards of 2016"
    },
    {
        ". Cold Chisels popularity is largely restricted to Australia and New Zealand, with their songs and musicianship highlighting ": null
    },
    {
        "working class": "working class"
    },
    {
        " life. Their early bass guitarist , Les Kaczmarek, died in December 42; Steve Prestwich died of a ": null
    },
    {
        "brain tumour": "brain tumour"
    },
    {
        " in January 42       Cold Chisel originally formed as Orange in ": null
    },
    {
        "Adelaide": "adelaide"
    },
    {
        " in 42 as a ": null
    },
    {
        "heavy metal": "heavy metal music"
    },
    {
        " band by Ted Broniecki on keyboards, Les Kaczmarek on bass guitar, ": null
    },
    {
        "Ian Moss": "ian moss"
    },
    {
        " on guitar and vocals, ": null
    },
    {
        "Steve Prestwich": "steve prestwich"
    },
    {
        " on drums and ": null
    },
    {
        "Don Walker": "don walker"
    },
    {
        " on piano. Their early material included cover versions of ": null
    },
    {
        "Free": "free"
    },
    {
        " and ": null
    },
    {
        "Deep Purple": "deep purple"
    },
    {
        " material. Broniecki left by September 42 and seventeen-year-old singer, ": null
    },
    {
        "Jimmy Barnes": "jimmy barnes"
    },
    {
        " — called Jim Barnes during their initial career — joined in December.     The group changed its name several times before settling on Cold Chisel in 42 after Walkers song of that title. Barnes relationship with the others was volatile: he often came to blows with Prestwich and left the band several times. During these periods Moss would handle vocals until Barnes returned. Walker emerged as the groups primary songwriter and spent 42 in ": null
    },
    {
        "Armidale": "armidale, new south wales"
    },
    {
        ", completing his studies in quantum mechanics. Barnes older brother, ": null
    },
    {
        "John Swan": "swanee"
    },
    {
        ", was a member of Cold Chisel around this time, providing backing vocals and percussion. After several violent incidents, including beating up a roadie, he was fired. In mid42 Barnes left to join ": null
    },
    {
        "Fraternity": "fraternity"
    },
    {
        " as ": null
    },
    {
        "Bon Scott": "bon scott"
    },
    {
        "s replacement on lead vocals, alongside Swan on drums and vocals. Kaczmarek left Cold Chisel during 42 and was replaced by ": null
    },
    {
        "Phil Small": "phil small"
    },
    {
        " on bass guitar. In November of that year, without Barnes, they recorded their early demos.     In May 42 Cold Chisel relocated to Melbourne, but frustrated by their lack of progress, they moved on to Sydney in November. In May of the following year Barnes told his fellow members that he would leave again. From July he joined Feather for a few weeks, on co-lead vocals with Swan – they were a Sydney-based hard rock group, which had evolved from ": null
    },
    {
        "Blackfeather": "blackfeather"
    },
    {
        ". A farewell performance for Cold Chisel, with Barnes aboard, went so well that the singer changed his mind and returned. In the following month the Warner Music Group signed the group.     Breakfast at Sweethearts ": null
    },
    {
        "self-titled debut album": "cold chisel"
    },
    {
        " with their manager and producer, Peter Walker . All tracks were written by Walker, except Juliet , where Barnes composed its melody and Walker the lyrics. Cold Chisel was released in April and included guest studio musicians: Dave Blight on ": null
    },
    {
        "harmonica": "harmonica"
    },
    {
        " and ": null
    },
    {
        "saxophonists": "saxophone"
    },
    {
        " Joe Camilleri": "joe camilleri"
    },
    {
        " and ": null
    },
    {
        "Wilbur Wilde": "wilbur wilde"
    },
    {
        " . Australian musicologist, ": null
    },
    {
        "Ian McFarlane": "ian mcfarlane"
    },
    {
        ", described how, failed to capture the bands renowned live firepower, despite the presence of such crowd favourites as Khe Sanh, Home and Broken Hearted and One Long Day. It reached the top  42 on the ": null
    },
    {
        "Kent Music Report": "kent music report"
    },
    {
        " and was certified as a gold record for shipment of 42 units.     In May 42 ": null
    },
    {
        "Khe Sanh": "khe sanh"
    },
    {
        " , was released as their debut single but it was declared too offensive for commercial radio due to the sexual implication of the lyrics, Their legs were often open/But their minds were always closed. However, it was played regularly on Sydney youth radio station, ": null
    },
    {
        "Double J": "double j"
    },
    {
        ", which was not subject to the restrictions as it was part of the ": null
    },
    {
        "Australian Broadcasting Corporation": "australian broadcasting corporation"
    },
    {
        " . Another ABC program,  Countdown s producers asked them to change the lyric but they refused. Despite such setbacks, Khe Sanh reached No.  42 on the Kent Music Report singles chart. It became Cold Chisels signature tune and was popular among their fans. They later remixed the track, with re-recorded vocals, for inclusion on the international version of their third album,  East  .     The bands next release was a live five-track extended play,  Youre Thirteen, Youre Beautiful, and Youre Mine , in November 42 McFarlane observed, It captured the band in its favoured element, fired by raucous versions of Walkers Merry-Go-Round and Chip Taylors Wild Thing. It was recorded at Sydneys Regent Theatre in 42 when they had ": null
    },
    {
        "Midnight Oil": "midnight oil"
    },
    {
        " as one of the support acts. Australian writer, ": null
    },
    {
        "Ed Nimmervoll": "ed nimmervoll"
    },
    {
        ", described a typical performance by Cold Chisel, Everybody was talking about them anyway, drawn by the songs, and Jim Barnes presence on stage, crouched, sweating, as he roared his vocals into the microphone at the top of his lungs. The EP peaked at No.  42 on the Kent Music Report Singles Chart.     Merry Go Round was re-recorded for their second studio album,  Breakfast at Sweethearts  . This was recorded between July 42 and January 42 with producer, ": null
    },
    {
        "Richard Batchens": "richard batchens"
    },
    {
        ", who had previously worked with ": null
    },
    {
        "Richard Clapton": "richard clapton"
    },
    {
        ", ": null
    },
    {
        "Sherbet": "sherbet"
    },
    {
        " and Blackfeather. Batchens smoothed out the bands rough edges and attempted to give their songs a sophisticated sound. With regards to this approach, the band were unsatisfied with the finished product.  It peaked at No.  42 and was the top selling album in Australia by a locally based artist for that year; it was certified platinum for shipment of 42 copies. The majority of its tracks were written by Walker, with Barnes and Walker on the lead single, Goodbye , and Moss contributed to Dresden . Goodbye became a live favourite, and was covered by ": null
    },
    {
        "U42": "u2"
    },
    {
        " during Australian tours in the 42s.     East Countdown. The members developed reputations for wild behaviour, particularly Barnes who claimed to have had sex with over 42 women and who consumed more than a bottle of ": null
    },
    {
        "vodka": "vodka"
    },
    {
        " each night while performing. In late 42 severing their relationship with Batchens, Cold Chisel chose ": null
    },
    {
        "Mark Opitz": "mark opitz"
    },
    {
        " to produce the next single, ": null
    },
    {
        "Choirgirl": "choirgirl"
    },
    {
        " . It is a Walker composition dealing with a young womans experience with ": null
    },
    {
        "abortion": "abortion"
    },
    {
        ". Despite the subject matter it reached No.  42     Choirgirl paved the way for the groups third studio album,  East  , with Opitz producing. Recorded over two months in early 42 East, reached No.  42 and is the second highest selling album by an Australian artist for that year.  The Australian Womens Weekly s Gregg Flynn noticed, one of the few Australian bands in which each member is capable of writing hit songs. Despite the continued dominance of Walker, the other members contributed more tracks to their play list, and this was their first album to have songs written by each one. McFarlane described it as, a confident, fully realised work of tremendous scope. Nimmervoll explained how, This time everything fell into place, the sound, the songs, the playing... East was a triumph. were now the undisputed No.  42 rock band in Australia.     The album varied from straight ahead rock tracks, Standing on the Outside and My Turn to Cry , to ": null
    },
    {
        "rockabilly": "rockabilly"
    },
    {
        "-flavoured work-outs and pop-laced love songs  to a poignant piano ballad about prison life, Four Walls . The cover art showed Barnes reclined in a bathtub wearing a ": null
    },
    {
        "kamikaze": "kamikaze"
    },
    {
        " bandanna in a room littered with junk and was inspired by ": null
    },
    {
        "Jacques-Louis David": "jacques-louis david"
    },
    {
        "s 42 painting,  The Death of Marat . The Ian Moss-penned Never Before was chosen as the first song to air on the ABCs youth radio station, ": null
    },
    {
        "Triple J": "triple j"
    },
    {
        ", when it switched to the ": null
    },
    {
        "FM": "fm broadcasting"
    },
    {
        " band that year. Supporting the release of East, Cold Chisel embarked on the Youth in Asia Tour from May 42 which took its name from a lyric in Star Hotel .     Swingshift to Circus Animals  Swingshift  . Nimmervoll declared, rammed what they were all about with In March 42 the band won seven categories: Best Australian Album, Most Outstanding Achievement, Best Recorded Song Writer, Best Australian Producer, Best Australian Record Cover Design, Most Popular Group and Most Popular Record, at the Countdown/ TV Week  ": null
    },
    {
        "pop music awards for 42": "australian pop music awards1980"
    },
    {
        ". They attended the ceremony at the Sydney Entertainment Centre and were due to perform: however, as a protest against a TV magazines involvement, they refused to accept any trophy and finished the night with, My Turn to Cry . After one verse and chorus, they smashed up the set and left the stage.     Swingshift debuted at No  42 which demonstrated their status as the highest selling local act. With a slightly different track-listing, East, was issued in the United States and they undertook their first US tour in mid42 Ahead of the tour they had issued, My Baby , for the North America market and it reached the top  42 on  Billboard s chart, ": null
    },
    {
        "Mainstream Rock": "mainstream rock"
    },
    {
        ". They were generally popular as a live act there, but the US branch of their label did little to promote the album. According to Barnes biographer, ": null
    },
    {
        "Toby Creswell": "toby creswell"
    },
    {
        ", at one point they were ushered into an office to listen to the US master tape to find it had substantial hiss and other ambient noise, which made it almost unable to be released. Notwithstanding, the album reached the lower region of the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " in July. The group were booed off stage after a lacklustre performance in ": null
    },
    {
        "Dayton, Ohio": "dayton, ohio"
    },
    {
        " in May 42 opening for Ted Nugent. Other support slots they took were for Cheap Trick, Joe Walsh, Heart and the Marshall Tucker Band. European audiences were more accepting of the Australian band and they developed a fan base in Germany.     In August 42 Cold Chisel began work on a fourth studio album,  Circus Animals  , again with Opitz producing. To launch the album, the band performed under a circus tent at Wentworth Park in Sydney and toured heavily once more, including a show in Darwin that attracted more than 42  percent of the citys population. It peaked at No.  42 in both Australia and on the ": null
    },
    {
        "Official New Zealand Music Chart": "official new zealand music chart"
    },
    {
        ". In October 42 it was listed at No.  42 in the book,  42 Best Australian Albums , by music journalists, Creswell, ": null
    },
    {
        "Craig Mathieson": "craig mathieson"
    },
    {
        " and ": null
    },
    {
        "John ODonnell": "john odonnell"
    },
    {
        ".     Its lead single, ": null
    },
    {
        "You Got Nothing I Want": "you got nothing i want"
    },
    {
        " , is an aggressive Barnes-penned hard rock track, which attacked the US industry for its handling of the band on their recent tour. The song caused problems for Barnes when he later attempted to break into the US market as a solo performer; senior music executives there continued to hold it against him. Like its predecessor, Circus Animals, contained songs of contrasting styles, with harder-edged tracks like Bow River and Hound Dog in place beside more expansive ballads such as the next two singles, ": null
    },
    {
        "Forever Now": "forever now"
    },
    {
        " and ": null
    },
    {
        "When the War Is Over": "when the war is over"
    },
    {
        " , both are written by Prestwich. Forever Now is their highest charting single in two ": null
    },
    {
        "Australasia": "australasia"
    },
    {
        "n markets: No.  42 on the Kent Music Report Singles Chart and No.  42 on the Official New Zealand Music Chart.     When the War Is Over is the most covered Cold Chisel track – ": null
    },
    {
        "Uriah Heep": "uriah heep"
    },
    {
        " included a version on their 42 album,  Raging Silence ; ": null
    },
    {
        "John Farnham": "john farnham"
    },
    {
        " recorded it while he and Prestwich were members of ": null
    },
    {
        "Little River Band": "little river band"
    },
    {
        " in the mid42s and again for his 42 solo album,  Age of Reason . The song was also a No.  42 hit for former  Australian Idol  contestant, ": null
    },
    {
        "Cosima De Vito": "cosima de vito"
    },
    {
        ", in 42 and was performed by ": null
    },
    {
        "Bobby Flynn": "bobby flynn"
    },
    {
        " during that shows 42 season. Forever Now was covered, as a country waltz, by Australian band, ": null
    },
    {
        "the Reels": "the reels"
    },
    {
        ".       Success outside Australasia continued to elude Cold Chisel and friction occurred between the members. According to McFarlane, failed attempts to break into the American market represented a major blow... earthy, high-energy rock was overlooked. In early 42 they toured Germany but the shows went so badly that in the middle of the tour Walker up-ended his keyboard and stormed off stage during one show. After returning to Australia, Preswtich was fired and replaced by ": null
    },
    {
        "Ray Arnott": "ray arnott"
    },
    {
        ", formerly of the 42s ": null
    },
    {
        "progressive rock": "progressive rock"
    },
    {
        "ers, ": null
    },
    {
        "Spectrum": "spectrum"
    },
    {
        ", and ": null
    },
    {
        "country rock": "country rock"
    },
    {
        "ers, ": null
    },
    {
        "the Dingoes": "the dingoes"
    },
    {
        ".     After this, Barnes requested a large advance from management. Now married with a young child, exorbitant spending had left him almost broke. His request was refused as there was a standing arrangement that any advance to one band member had to be paid to all the others. After a meeting on 42 August during which Barnes quit the band it was decided that the group would split up. A farewell concert series, The Last Stand, was planned and a final studio album,  Twentieth Century  , was recorded. Prestwich returned for that tour, which began in October. Before the last four scheduled shows in Sydney, Barnes lost his voice and those dates were postponed to mid-December.      The bands final performances were at the Sydney Entertainment Centre from 42 to 42 December 42 – ten  years since their first live appearance as Cold Chisel in Adelaide – the group then disbanded. The Sydney shows formed the basis of a concert film,  The Last Stand  , which became the biggest-selling cinema-released concert documentary by an Australian band to that time. Other recordings from the tour were used on a live album,  The Barking Spiders Live: 42  , the title is a reference to the pseudonym the group occasionally used when playing warm-up shows before tours. Some were also used as b-sides for a three-CD singles package, Three Big XXX Hits, issued ahead of the release of their 42 compilation album,  Teenage Love .     During breaks in the tour, Twentieth Century, was recorded. It was a fragmentary process, spread across various studios and sessions as the individual members often refused to work together – both Arnott and Prestwich are recorded as drummers. The album reached No.  42 and provided the singles, ": null
    },
    {
        "Saturday Night": "saturday night"
    },
    {
        " and ": null
    },
    {
        "Flame Trees": "flame trees"
    },
    {
        " , both of which remain radio staples. Flame Trees , co-written by Prestwich and Walker, took its title from the BBC series,  The Flame Trees of Thika , although it was lyrically inspired by the organists hometown of ": null
    },
    {
        "Grafton": "grafton, new south wales"
    },
    {
        ". Barnes later recorded an acoustic version for his 42 solo album,  Flesh and Wood , and it was also covered by ": null
    },
    {
        "Sarah Blasko": "sarah blasko"
    },
    {
        " in 42       Barnes launched his solo career in January 42 which has provided nine Australian number-one studio albums and an array of hit singles, including, ": null
    },
    {
        "Too Much Aint Enough Love": "too much aint enough love"
    },
    {
        " , which peaked at No.  42 He has recorded with ": null
    },
    {
        "INXS": "inxs"
    },
    {
        ", ": null
    },
    {
        "Tina Turner": "tina turner"
    },
    {
        ", ": null
    },
    {
        "Joe Cocker": "joe cocker"
    },
    {
        " and John Farnham to become one of the countrys most popular male rock singers. Prestwich joined ": null
    },
    {
        "Little River Band": "little river band"
    },
    {
        " in 42 and appeared on the albums,  Playing to Win  and  No Reins , before departing in 42 to join Farnhams touring band. Moss, Small and Walker took extended breaks from music.     Small maintained a low profile as a member in a variety of minor groups, Pound, the Earls of Duke and the Outsiders. Walker formed Catfish in 42 ostensibly a solo band with a variable membership, which included Moss, Charlie Owen and Dave Blight at times. Catfish played a modern jazz aspect and the recordings during this phase attracted little commercial success. During 42 and 42 Walker wrote several tracks for Moss including the singles, ": null
    },
    {
        "Tuckers Daughter": "tuckers daughter"
    },
    {
        " and ": null
    },
    {
        "Telephone Booth": "telephone booth"
    },
    {
        " , which appeared on Moss debut solo album,  Matchbook  . Both the album and Tuckers Daughter peaked at No.  42 Moss won five trophies at the ": null
    },
    {
        "ARIA Music Awards of 42": "aria music awards of 1990"
    },
    {
        ". His other solo albums met with less chart or award success.     Throughout the 42s and most of the 42s, Cold Chisel were courted to re-form but refused, at one point reportedly turning down a $42  million offer to play a sole show in each of the major Australian state capitals. Moss and Walker often collaborated on projects, neither worked with Barnes until Walker wrote, Stone Cold , for the singers sixth studio album,  Heat  . The pair recorded an acoustic version for Flesh and Wood . Thanks primarily to continued radio airplay and Barnes solo success, Cold Chisels legacy remained solidly intact. By the early 42s the group had surpassed 42 million album sales, most sold since 42 The 42 compilation album,  Chisel , was re-issued and re-packaged several times, once with the long-deleted 42 EP as a bonus disc and a second time in 42 as a double album. The Last Stand soundtrack album was finally released in 42 In 42 a complete album of previously unreleased demo and rare live recordings,  Teenage Love , was released, which provided three singles.       Cold Chisel reunited in October 42 with the line-up of Barnes, Moss, Prestwich, Small and Walker. They recorded their sixth studio album,  The Last Wave of Summer  , from February to July with the band members co-producing. They supported it with a national tour. The album debuted at number  one on the ": null
    },
    {
        "ARIA Albums Chart": "aria charts"
    },
    {
        ". In 42 they re-grouped for the Ringside Tour and in 42 again to perform at a benefit for the victims of the ": null
    },
    {
        "Boxing Day tsunami": "boxing day tsunami"
    },
    {
        " at the Myer Music Bowl in Melbourne. Founding bass guitarist, Les Kaczmarek, died of liver failure on 42 December 42 aged 42 Walker described him as, a wonderful and beguiling man in every respect.     On 42 September 42 Cold Chisel announced they would reform for a one-off performance at the ": null
    },
    {
        "Sydney 42": "sydney 500"
    },
    {
        " V42 Supercars": "v8 supercars"
    },
    {
        " event on 42 December. The band performed at ": null
    },
    {
        "ANZ Stadium": "anz stadium"
    },
    {
        " to the largest crowd of its career, with more than 42 fans in attendance. They played a single live show in 42: at the ": null
    },
    {
        "Deniliquin": "deniliquin"
    },
    {
        " ute muster": "ute muster"
    },
    {
        " in October. In December Moss confirmed that Cold Chisel were working on new material for an album.     The Perfect Crime    In January 42 Steve Prestwich was diagnosed with a ": null
    },
    {
        "brain tumour": "brain tumour"
    },
    {
        "; he underwent surgery on 42 January but never regained consciousness and died two days later, aged 42 All six of Cold Chisels studio albums were re-released in digital and CD formats in mid42 Three digital-only albums were released,  Never Before ,  Besides  and  Covered , as well as a new compilation album,  The Best of Cold Chisel: All for You , which peaked at number  42 on the ARIA Charts. The thirty-date Light the Nitro Tour was announced in July along with the news that former ": null
    },
    {
        "Divinyls": "divinyls"
    },
    {
        " and Catfish drummer, ": null
    },
    {
        "Charley Drayton": "charley drayton"
    },
    {
        ", had replaced Prestwich. Most shows on the tour sold out within days and new dates were later announced for early 42      No Plans , their seventh studio album, was released in April 42 with ": null
    },
    {
        "Kevin Shirley": "kevin shirley"
    },
    {
        " producing, which peaked at No.  42  The Australian s Stephen Fitzpatrick rated it as four-and-a-half out-of-five and found its lead track, All for You , speaks of redemption; of a mans ability to make something of himself through love. The track, I Got Things to Do , was written and sung by Prestwich, which Fitzpatrick described as, the bittersweet finale and had a vocal track the other band members did not know existed until after his death. Midway through 42 they had a short UK tour and played with Soundgarden and Mars Volta at ": null
    },
    {
        "Hard Rock Calling": "calling festival"
    },
    {
        " at Londons Hyde Park.     The groups eighth studio album,  The Perfect Crime , appeared in October 42 again with Shirley producing, which peaked at No.  42 Martin Boulton of  The Sydney Morning Herald  rated it at four-out-of-five stars and explained, work incredibly hard, not take any shortcuts and play the hell out of the songs where the album, delves further back to their rocknroll roots with chief songwriter carving up the keys, guitarist both gritty and sublime and the engine room firing on every cylinder. Barnes voice sounds worn, wonderful and better than ever.       McFarlane described Cold Chisels early career in his  Encyclopedia of Australian Rock and Pop  , after ten years on the road, called it a day. Not that the band split up for want of success; by that stage had built up a reputation previously uncharted in Australian rock history. By virtue of the profound effect the bands music had on the many thousands of fans who witnessed its awesome power, Cold Chisel remains one of Australias best-loved groups. As one of the best live bands of its day, fused a combination of rockabilly, hard rock and rough-house soulnblues that was defiantly Australian in outlook.  The Canberra Times  Luis Feliu, in July 42 observed how, This is not just another Australian rock band, no mediocrity here, and their honest, hard-working approach looks like paying off. While the range of styles tackled and done convincingly, from hard rock to blues, boogie, rhythm and blues, is where the appeal lies.     Influences from blues and early rock n roll was broadly apparent, fostered by the love of those styles by Moss, Barnes and Walker. Small and Prestwich contributed strong pop sensibilities. This allowed volatile rock songs like You Got Nothing I Want and Merry-Go-Round to stand beside thoughtful ballads like Choirgirl , pop-flavoured love songs like My Baby and caustic political statements like Star Hotel , an attack on the late 42s government of ": null
    },
    {
        "Malcolm Fraser": "malcolm fraser"
    },
    {
        ", inspired by the ": null
    },
    {
        "Star Hotel riot": "star hotel riot"
    },
    {
        " in ": null
    },
    {
        "Newcastle": "newcastle, australia"
    },
    {
        ".     The songs were not overtly political but rather observations of everyday life within Australian society and culture, in which the members with their various backgrounds  were quite well able to provide.     Cold Chisels songs were about distinctly Australian experiences, a factor often cited as a major reason for the bands lack of international appeal. Saturday Night and Breakfast at Sweethearts were observations of the urban experience of Sydneys ": null
    },
    {
        "Kings Cross": "kings cross, new south wales"
    },
    {
        " district where Walker lived for many years. Misfits , which featured on the b-side to My Baby , was about homeless kids in the suburbs surrounding Sydney. Songs like Shipping Steel and Standing on The Outside were working class anthems and many others featured characters trapped in mundane, everyday existences, yearning for the good times of the past or for something better from life .          Alongside contemporaries like ": null
    },
    {
        "The Angels": "the angels"
    },
    {
        " and ": null
    },
    {
        "Midnight Oil": "midnight oil"
    },
    {
        ", Cold Chisel was renowned as one of the most dynamic live acts of their day and from early in their career concerts routinely became sell-out events. But the band was also famous for its wild lifestyle, particularly the hard-drinking Barnes, who played his role as one of the wild men of Australian rock to the hilt, never seen on stage without at least one bottle of vodka and often so drunk he could barely stand upright. Despite this, by 42 he was a devoted family man who refused to tour without his wife and daughter. All the other band members were also settled or married; Ian Moss had a long-term relationship with the actress, ": null
    },
    {
        "Megan Williams": "megan williams"
    },
    {
        ",  whose own public persona could have hardly been more different.     It was the bands public image that often had them compared less favourably with other important acts like ": null
    },
    {
        "Midnight Oil": "midnight oil"
    },
    {
        ", whose music and politics were often similar but whose image and reputation was more clean-cut. Cold Chisel remained hugely popular however and by the mid42s they continued to sell records at such a consistent rate they became the first Australian band to achieve higher sales after their split than during their active years.     At the ": null
    },
    {
        "ARIA Music Awards of 42": "aria music awards of 1993"
    },
    {
        " they were inducted into the ": null
    },
    {
        "Hall of Fame": "aria hall of fame"
    },
    {
        ". While repackages and compilations accounted for much of these sales, 42s Teenage Love provided two of its singles, which were top ten hits. When the group finally reformed in 42 the resultant album was also a major hit and the follow-up tour sold out almost immediately. In 42 ": null
    },
    {
        "Australasian Performing Right Association": "australasian performing right association"
    },
    {
        " , listed their single, Khe Sanh , at No.  42 of the all-time best ": null
    },
    {
        "Australian song": "apra top 30 australian songs"
    },
    {
        "s.     Cold Chisel were one of the first Australian acts to have become the subject of a major tribute album. In 42  Standing on the Outside: The Songs of Cold Chisel  was released, featuring a collection of the bands songs as performed by artists including ": null
    },
    {
        "The Living End": "the living end"
    },
    {
        ", ": null
    },
    {
        "Evermore": "evermore"
    },
    {
        ", ": null
    },
    {
        "Something for Kate": "something for kate"
    },
    {
        ", ": null
    },
    {
        "Pete Murray": "pete murray"
    },
    {
        ", ": null
    },
    {
        "Katie Noonan": "katie noonan"
    },
    {
        ", ": null
    },
    {
        "You Am I": "you am i"
    },
    {
        ", ": null
    },
    {
        "Paul Kelly": "paul kelly"
    },
    {
        ", ": null
    },
    {
        "Alex Lloyd": "alex lloyd"
    },
    {
        ", ": null
    },
    {
        "Thirsty Merc": "thirsty merc"
    },
    {
        " and ": null
    },
    {
        "Ben Lee": "ben lee"
    },
    {
        ", many of whom were children when Cold Chisel first disbanded and some, like the members of Evermore, had not even been born. Circus Animals was listed at No.  42 in the book, 42 Best Australian Albums , while East appeared at No.  42 They won ": null
    },
    {
        "The Ted Albert Award for Outstanding Services to Australian Music": "apra awards the ted albert award for outstanding services to australian music"
    },
    {
        " at the ": null
    },
    {
        "APRA Music Awards of 42": "apra music awards of 2016"
    },
    {
        ".             ;Current members   ": null
    },
    {
        "Ian Moss": "ian moss"
    },
    {
        "  – lead guitar, vocals   ": null
    },
    {
        "Don Walker": "don walker"
    },
    {
        "  – keyboards, backing vocals   ": null
    },
    {
        "Jimmy Barnes": "jimmy barnes"
    },
    {
        "  – vocals, guitar   ": null
    },
    {
        "Phil Small": "phil small"
    },
    {
        "  – bass guitar, backing vocals   ": null
    },
    {
        "Charley Drayton": "charley drayton"
    },
    {
        "  – drums, backing vocals     ;Former members   ": null
    },
    {
        "Steve Prestwich": "steve prestwich"
    },
    {
        "  – drums, backing vocals   Les Kaczmarek  – bass guitar   ": null
    },
    {
        "John Swan": "swanee"
    },
    {
        "  – percussion, backing vocals   ": null
    },
    {
        "Ray Arnott": "ray arnott"
    },
    {
        "  – drums      ;Additional musicians   Dave Blight  – harmonica   Billy Rodgers  – saxophone   Jimmy Sloggett  – saxophone   Andy Bickers  – saxophone   ": null
    },
    {
        "Renée Geyer": "renée geyer"
    },
    {
        "  – backing vocals   ": null
    },
    {
        "Venetta Fields": "venetta fields"
    },
    {
        "  – backing vocals   ": null
    },
    {
        "Megan Williams": "megan williams"
    },
    {
        "  – backing vocals   Peter Walker  – acoustic guitar   ": null
    },
    {
        "Joe Camilleri": "joe camilleri"
    },
    {
        "  – saxophone   ": null
    },
    {
        "Wilbur Wilde": "wilbur wilde"
    },
    {
        "  – saxophone                  Cold Chisel     Breakfast at Sweethearts     East     Circus Animals     Twentieth Century     The Last Wave of Summer     No Plans     The Perfect Crime     Blood Moon  ": null
    }
]