[
    {
        "     A collective business system or collective business model is a ": null
    },
    {
        "business organization": "trade association"
    },
    {
        " or association typically composed of relatively large numbers of ": null
    },
    {
        "business": "business"
    },
    {
        "es, tradespersons or ": null
    },
    {
        "professional": "professional"
    },
    {
        "s in the same or related fields of endeavor, which pools resources, shares information or provides other benefits for their members. In the past, collective business systems such as the ": null
    },
    {
        "trade association": "trade association"
    },
    {
        ", the ": null
    },
    {
        "cooperative": "cooperative"
    },
    {
        " and the ": null
    },
    {
        "franchise": "franchising"
    },
    {
        " were created to allow groups of independently owned businesses with common interests to successfully compete in the marketplace.       During the twentieth century, the business world in the ": null
    },
    {
        "United States of America": "united states"
    },
    {
        " and many ": null
    },
    {
        "Europe": "europe"
    },
    {
        "an countries has witnessed the consolidation of all types of businesses through ": null
    },
    {
        "merger": "merger"
    },
    {
        "s, ": null
    },
    {
        "rollup": "rollup"
    },
    {
        "s or ": null
    },
    {
        "acquisitions": "takeover"
    },
    {
        ". Typically, by the end of the consolidation process, a particular ": null
    },
    {
        "industry": "industry"
    },
    {
        " or ": null
    },
    {
        "profession": "profession"
    },
    {
        " becomes dominated by three or four nationally based ": null
    },
    {
        "enterprise": "business"
    },
    {
        "s. Under these circumstances many smaller companies  are often forced out of business or decide to sell to one of the dominant entities because it can no longer compete profitably with them. Typically, locally based businesses are unable to compete because they lack the capital, global ": null
    },
    {
        "marketing": "marketing"
    },
    {
        " capabilities, purchasing power and expensive ": null
    },
    {
        "technology": "technology"
    },
    {
        " necessary to operate efficiently. This trend toward consolidation is expected to continue well into the twenty-first century and is sometimes shortened in developing countries, where the initial business in a market sector may be a single, large enterprise able to compete on the international market.     Presently, and for the foreseeable future, the inherent limitations of traditional collective business systems such as the trade organization, the cooperative and the ": null
    },
    {
        "franchise": "franchising"
    },
    {
        " render them considerably less effective than they once were in advancing the business interests of their constituents. The following is a brief synopsis of those traditional collective business systems.         Trade associations are ": null
    },
    {
        "non-profit organization": "non-profit organization"
    },
    {
        "s in which the individual members are companies or individuals engaged in a common business pursuit. Competitors join together to create a platform format in which they deal with common problems of their industry. Any applicant meeting the standards of the association must be accepted as a member. ": null
    },
    {
        "Anti-trust law": "anti-trust law"
    },
    {
        " prohibits a member trade association from denying an otherwise qualified applicants membership based upon a geographical proximity to an existing member. Trade associations commonly offer their members educational programs, the opportunity to come together at meetings to discuss common problems, and marketing materials designed to be imprinted by each member with its relevant information. Trade associations also offer elective group purchasing plans. The trade association bears no credit risk in these transactions but instead, provides chosen vendors with access to a large body of member customers. Because the trade association does not pledge its credit, the vendor must rely upon the credit worthiness of each purchaser.     To sustain its operations, a trade association generally receives an initiation fee and/or a yearly membership fee  from its members, and it may collect rebates or commissions from the purchasing plan suppliers.     The trade organization imposes relatively low membership dues on its members. However, because initiation fees and annual membership fees are nominal, the trade organization lacks the ability to engage in offering its members national marketing capability, access to expensive technologies and cost-effective purchasing programs for major purchases due to a lack of capital. Furthermore, being ": null
    },
    {
        "non-profit": "non-profit"
    },
    {
        ", trade associations do not have the management mentality necessary to sustain major projects such as national sales and marketing.     While offering potentially valuable services to businesses, few trade associations offer much direct help in the major business areas of purchasing, production or marketing.          A ": null
    },
    {
        "cooperative": "cooperative"
    },
    {
        " is a non-profit organization somewhat similar to a trade association. A significant difference between the cooperative and the trade association, however, is that with a trade association, the members have a non-equity position in the association, whereas in the typical cooperative the members will have an equity interest as all members of the cooperative own a portion of the cooperative.     The cooperative utilizes its volume leverage with suppliers in purchasing products and services for less than the individual member company could obtain outside of the cooperative. The cooperative marks up the purchased products or services in order to cover operating expenses. Any net income achieved by the cooperative is then returned to the cooperative members in the form of a redistribution of profits or dividends.     There are also cooperatives in which the sole function is for marketing and ": null
    },
    {
        "advertising": "advertising"
    },
    {
        " in a given region. New ": null
    },
    {
        "car dealer": "car dealer"
    },
    {
        "s and ": null
    },
    {
        "fast food franchisees": "fast food"
    },
    {
        " typically form marketing and advertising cooperatives.         The employees typically are required to wear ": null
    },
    {
        "uniform": "uniform"
    }
]