[
    {
        "     In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        "s, a collinear antenna array is an ": null
    },
    {
        "array": "antenna array"
    },
    {
        " of ": null
    },
    {
        "dipole antenna": "dipole antenna"
    },
    {
        "s mounted in such a manner that the corresponding elements of each ": null
    },
    {
        "antenna": "antenna"
    },
    {
        " are parallel and ": null
    },
    {
        "collinear": "collinearity"
    },
    {
        ", that is they are located along a common line or axis.     Collinear arrays of dipoles are high gain ": null
    },
    {
        "omnidirectional antenna": "omnidirectional antenna"
    },
    {
        "s. A dipole has an ": null
    },
    {
        "omnidirectional": "omnidirectional antenna"
    },
    {
        " radiation pattern": "radiation pattern"
    },
    {
        " in free space when oriented vertically; it radiates equal radio power in all ": null
    },
    {
        "azimuth": "azimuth"
    },
    {
        "al directions perpendicular to the antenna, with the signal strength dropping to zero on the antenna axis. The purpose of stacking multiple dipoles in a vertical collinear array is to increase the power radiated in horizontal directions and reduce the power radiated into the sky or down toward the earth, where it is wasted. They radiate ": null
    },
    {
        "vertically polarized": "vertical polarization"
    },
    {
        " radio waves. Theoretically, when stacking idealised lossless dipole antennas in such a fashion, doubling their number will produce double the gain, with an increase of 42 ": null
    },
    {
        "dB": "decibel"
    },
    {
        ". In practice, the gain realized will be below this due to imperfect radiation spread and losses.     Collinear dipole arrays are often used as the antennas for base stations for ": null
    },
    {
        "land mobile radio system": "land mobile radio system"
    },
    {
        "s that communicate with mobile ": null
    },
    {
        "two-way radio": "two-way radio"
    },
    {
        "s in vehicles, such as police, fire, ambulance, and taxi dispatchers. They are also sometimes used for ": null
    },
    {
        "broadcasting": "radio broadcasting"
    }
]