[
    {
        "The Comateens were originally a ": null
    },
    {
        "new wave": "new wave music"
    },
    {
        " duo formed in 42 in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " by bassist/vocalist Nic North and guitarist Ramona Jan. Soon after, Lyn Byrd joined on vocals and synthesizer, and the duo became a trio. When Jan departed in 42 Norths brother Oliver joined on guitar, completing the final lineup.     They contributed two tracks to the influential  Marty Thau Presents 42x42 compilation, and their debut album, the self-titled Comateens , featured the bands original compositions alongside covers of Summer in the City , ": null
    },
    {
        "TVC 42": "tvc 15"
    },
    {
        " , and the theme song from TVs  The Munsters . Pictures on a String, their first album for ": null
    },
    {
        "Virgin Records": "virgin records"
    },
    {
        ", followed in 42 yielding the dance club hit Get Off My Case . In 42 the band released their final album, Deal with It, which featured live drums played by Chuck Sabo.     The band split up in 42 Oliver North died in 42 of ": null
    },
    {
        "asthma": "asthma"
    },
    {
        "-related heart failure due to a heroin overdose. In 42 Nic North and Lyn Byrd recorded an album, West & Byrd, together. In 42 the duo, again under the name Comateens, recorded the song A Place For Me , an English language adaptation of the ": null
    },
    {
        "Julien Clerc": "julien clerc"
    },
    {
        " and ": null
    },
    {
        "Françoise Hardy": "françoise hardy"
    },
    {
        " song Fais Moi Une Place , and it became a European hit. Virgin Records released a retrospective compilation of their music in 42 called One By One: Best Of Comateens which has become a rare and much sought-after record among collectors of new wave music. In 42 their video for The Late Mistake was mocked in a season five episode of ": null
    },
    {
        "Beavis and Butt-head": "beavis and butt-head"
    },
    {
        " called Top OThe Mountain .           Comateens   Pictures on a String   Deal with It   Comateens       One by One - The Best of the Comateens       West & Byrd": null
    }
]