[
    {
        "              A comet is an icy, ": null
    },
    {
        "small Solar System body": "small solar system body"
    },
    {
        " that, when passing close to the ": null
    },
    {
        "Sun": "sun"
    },
    {
        ", warms and begins to release gases, a process called ": null
    },
    {
        "outgassing": "outgassing"
    },
    {
        ". This produces a visible atmosphere or ": null
    },
    {
        "coma": "coma"
    },
    {
        ", and sometimes also a ": null
    },
    {
        "tail": "comet tail"
    },
    {
        ". These phenomena are due to the effects of ": null
    },
    {
        "solar radiation": "solar radiation"
    },
    {
        " and the ": null
    },
    {
        "solar wind": "solar wind"
    },
    {
        " acting upon the nucleus of the comet. ": null
    },
    {
        "Comet nuclei": "comet nuclei"
    },
    {
        " range from a few hundred meters to tens of kilometers across and are composed of loose collections of ice, dust, and small rocky particles. The coma may be up to 15 times Earths diameter, while the tail may stretch one ": null
    },
    {
        "astronomical unit": "astronomical unit"
    },
    {
        ". If sufficiently bright, a comet may be seen from Earth without the aid of a telescope and may ": null
    },
    {
        "subtend": "subtended angle"
    },
    {
        " an arc of 30° across the sky. Comets have been observed and recorded since ancient times by many cultures.     Comets usually have highly ": null
    },
    {
        "eccentric": "orbital eccentricity"
    },
    {
        " elliptical orbits, and they have a wide range of ": null
    },
    {
        "orbital period": "orbital period"
    },
    {
        "s, ranging from several years to potentially several millions of years. ": null
    },
    {
        "Short-period comets": "short period"
    },
    {
        "originate in the ": null
    },
    {
        "Kuiper belt": "kuiper belt"
    },
    {
        " or its associated ": null
    },
    {
        "scattered disc": "scattered disc"
    },
    {
        ", which lie beyond the orbit of ": null
    },
    {
        "Neptune": "neptune"
    },
    {
        ". ": null
    },
    {
        "Long-period comets": "long period"
    },
    {
        "are thought to originate in the ": null
    },
    {
        "Oort cloud": "oort cloud"
    },
    {
        ", a spherical cloud of icy bodies extending from outside the Kuiper belt to halfway to the nearest star.  Long-period comets are set in motion towards the Sun from the Oort cloud by ": null
    },
    {
        "gravitational perturbations": "gravitational perturbation"
    },
    {
        "caused by ": null
    },
    {
        "passing stars": "list of nearest starsfuture and past"
    },
    {
        " and the ": null
    },
    {
        "galactic tide": "galactic tide"
    },
    {
        ". ": null
    },
    {
        "Hyperbolic comets": "hyperbolic comet"
    },
    {
        "may pass once through the inner Solar System before being flung to interstellar space. The appearance of a comet is called an apparition.     Comets are distinguished from ": null
    },
    {
        "asteroids": "asteroid"
    },
    {
        "by the presence of an extended, gravitationally unbound atmosphere surrounding their central nucleus. This atmosphere has parts termed the coma and the tail . However, ": null
    },
    {
        "extinct comets": "extinct comets"
    },
    {
        " that have passed close to the Sun many times have lost nearly all of their ": null
    },
    {
        "volatile": "volatility"
    },
    {
        " ices and dust and may come to resemble small asteroids.  Asteroids are thought to have a different origin from comets, having formed inside the orbit of Jupiter rather than in the outer Solar System.   The discovery of ": null
    },
    {
        "main-belt comets": "main-belt comet"
    },
    {
        "and active ": null
    },
    {
        "centaur": "centaur"
    },
    {
        " minor planets has blurred the ": null
    },
    {
        "distinction between asteroids and comets": "asteroidterminology"
    },
    {
        ". In the early 21st century, the discovery of some minor bodies with long-period comet orbits, but characteristics of inner solar system asteroids, were called ": null
    },
    {
        "Manx comet": "manx comet"
    },
    {
        "s. They are still classified as comets, such as C/2014 S3 .  27 Manx comets were found from 2013 to 2017.       there are 6,619 known comets,  a number that is steadily increasing as they are discovered. However, this represents only a tiny fraction of the total potential comet population, as the reservoir of comet-like bodies in the outer Solar System  is estimated to be one trillion.   Roughly one comet per year is visible to the ": null
    },
    {
        "naked eye": "naked eye"
    },
    {
        ", though many of those are faint and unspectacular.  Particularly bright examples are called ": null
    },
    {
        "great comets": "great comet"
    },
    {
        " . Comets have been visited by unmanned probes such as the European Space Agencys  Rosetta , which became the first to land a robotic spacecraft on a comet,  and NASAs  Deep Impact , which blasted a crater on Comet ": null
    },
    {
        "Tempel 1": "tempel 1"
    },
    {
        " to study its interior.               The word comet derives from the ": null
    },
    {
        "Old English": "old english"
    },
    {
        " cometa from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " comēta or comētēs. That, in turn, is a ": null
    },
    {
        "latinization": "latinisation of names"
    },
    {
        " of the ": null
    },
    {
        "Greek": "ancient greek"
    },
    {
        " κομήτης , and the  Oxford English Dictionary  notes that the term κομήτης already meant long-haired star, comet in Greek. Κομήτης was derived from κομᾶν , which was itself derived from κόμη and was used to mean the tail of a comet .       The ": null
    },
    {
        "astronomical symbol": "astronomical symbols"
    },
    {
        " for comets is  , consisting of a small disc with three hairlike extensions.                  The solid, core structure of a comet is known as the nucleus. Cometary nuclei are composed of an amalgamation of ": null
    },
    {
        "rock": "rock"
    },
    {
        ", dust, ": null
    },
    {
        "water ice": "ice"
    },
    {
        ", and frozen ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        ", ": null
    },
    {
        "carbon monoxide": "carbon monoxide"
    },
    {
        ", ": null
    },
    {
        "methane": "methane"
    },
    {
        ", and ": null
    },
    {
        "ammonia": "ammonia"
    },
    {
        ".  As such, they are popularly described as dirty snowballs after ": null
    },
    {
        "Fred Whipples": "fred whipple"
    },
    {
        "model.  However, many comets have a higher dust content, leading them to be called icy dirtballs .  Research conducted in 2014 suggests that comets are like ": null
    },
    {
        "deep fried ice cream": "fried ice cream"
    },
    {
        " , in that their surfaces are formed of dense crystalline ice mixed with ": null
    },
    {
        "organic compound": "organic compound"
    },
    {
        "s, while the interior ice is colder and less dense.     The surface of the nucleus is generally dry, dusty or rocky, suggesting that the ices are hidden beneath a surface crust several metres thick. In addition to the gases already mentioned, the nuclei contain a variety of ": null
    },
    {
        "organic compound": "organic compound"
    },
    {
        "s, which may include ": null
    },
    {
        "methanol": "methanol"
    },
    {
        ", ": null
    },
    {
        "hydrogen cyanide": "hydrogen cyanide"
    },
    {
        ", ": null
    },
    {
        "formaldehyde": "formaldehyde"
    },
    {
        ", ": null
    },
    {
        "ethanol": "ethanol"
    },
    {
        ", and ": null
    },
    {
        "ethane": "ethane"
    },
    {
        " and perhaps more complex molecules such as long-chain ": null
    },
    {
        "hydrocarbons": "hydrocarbon"
    },
    {
        "and ": null
    },
    {
        "amino acid": "amino acid"
    },
    {
        "s.   In 2009, it was confirmed that the amino acid ": null
    },
    {
        "glycine": "glycine"
    },
    {
        " had been found in the comet ": null
    },
    {
        "dust": "dust"
    },
    {
        " recovered by NASAs ": null
    },
    {
        "Stardust mission": "stardust"
    },
    {
        ".  In August 2011, a report, based on ": null
    },
    {
        "NASA": "nasa"
    },
    {
        " studies of ": null
    },
    {
        "meteorites": "meteorite"
    },
    {
        "found on Earth, was published suggesting ": null
    },
    {
        "DNA": "dna"
    },
    {
        " and ": null
    },
    {
        "RNA": "rna"
    },
    {
        " components  may have been formed on ": null
    },
    {
        "asteroids": "asteroid"
    },
    {
        "and comets.          The outer surfaces of cometary nuclei have a very low ": null
    },
    {
        "albedo": "albedo"
    },
    {
        ", making them among the least reflective objects found in the Solar System. The ": null
    },
    {
        "Giotto": "giotto"
    },
    {
        " space probe": "space probe"
    },
    {
        " found that the nucleus of ": null
    },
    {
        "Halleys Comet": "halleys comet"
    },
    {
        " reflects about four percent of the light that falls on it,  and ": null
    },
    {
        "Deep Space 1": "deep space 1"
    },
    {
        " discovered that ": null
    },
    {
        "Comet Borrellys": "19p/borrelly"
    },
    {
        " surface reflects less than 3.0%; by comparison, ": null
    },
    {
        "asphalt": "asphalt"
    },
    {
        " reflects seven percent. The dark surface material of the nucleus may consist of complex ": null
    },
    {
        "organic compound": "organic compound"
    },
    {
        "s. Solar heating drives off lighter ": null
    },
    {
        "volatile": "volatility"
    },
    {
        " compounds": "chemical compound"
    },
    {
        ", leaving behind larger organic compounds that tend to be very dark, like ": null
    },
    {
        "tar": "tar"
    },
    {
        " or ": null
    },
    {
        "crude oil": "petroleum"
    },
    {
        ". The low reflectivity of cometary surfaces causes them to absorb the heat that drives their ": null
    },
    {
        "outgassing": "outgassing"
    },
    {
        " processes.      Comet nuclei with radii of up to  have been observed,  but ascertaining their exact size is difficult.  The nucleus of ": null
    },
    {
        "322P/SOHO": "322p/soho"
    },
    {
        " is probably only  in diameter.  A lack of smaller comets being detected despite the increased sensitivity of instruments has led some to suggest that there is a real lack of comets smaller than  across.  Known comets have been estimated to have an average density of .  Because of their low mass, comet nuclei do not ": null
    },
    {
        "become spherical": "gravitational collapse"
    },
    {
        " under their own ": null
    },
    {
        "gravity": "gravity"
    },
    {
        " and therefore have irregular shapes.         Roughly six percent of the ": null
    },
    {
        "near-Earth asteroids": "near-earth asteroid"
    },
    {
        "are thought to be ": null
    },
    {
        "extinct nuclei of comets": "extinct comet"
    },
    {
        " that no longer experience outgassing,  including ": null
    },
    {
        "14827 Hypnos": "14827 hypnos"
    },
    {
        " and ": null
    },
    {
        "3552 Don Quixote": "3552 don quixote"
    },
    {
        ".     Results from the ": null
    },
    {
        "Rosetta": "rosetta"
    },
    {
        " and ": null
    },
    {
        "Philae": "philae"
    },
    {
        " spacecraft show that the nucleus of ": null
    },
    {
        "67P/Churyumov–Gerasimenko": "67p/churyumov–gerasimenko"
    },
    {
        " has no magnetic field, which suggests that magnetism may not have played a role in the early formation of ": null
    },
    {
        "planetesimal": "planetesimal"
    },
    {
        "s.   Further, the ": null
    },
    {
        "ALICE spectrograph": "rosetta instruments"
    },
    {
        " on Rosetta determined that ": null
    },
    {
        "electrons": "electron"
    },
    {
        "  produced from ": null
    },
    {
        "photoionization": "photoionization"
    },
    {
        " of water ": null
    },
    {
        "molecules": "molecule"
    },
    {
        "by ": null
    },
    {
        "solar radiation": "sunlight"
    },
    {
        ", and not ": null
    },
    {
        "photons": "photon"
    },
    {
        "from the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " as thought earlier, are responsible for the degradation of water and ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        "molecules": "molecule"
    },
    {
        "released from the comet nucleus into its ": null
    },
    {
        "coma": "coma"
    },
    {
        ".   Instruments on the Philae lander found at least sixteen ": null
    },
    {
        "organic compounds": "organic compound"
    },
    {
        "at the comets surface, four of which  have been detected for the first time on a comet.                       The streams of ": null
    },
    {
        "dust": "comet dust"
    },
    {
        " and gas thus released form a huge and extremely thin atmosphere around the comet called the coma . The force exerted on the coma by the Suns ": null
    },
    {
        "radiation pressure": "radiation pressure"
    },
    {
        " and ": null
    },
    {
        "solar wind": "solar wind"
    },
    {
        " cause an enormous tail to form pointing away from the Sun.      The coma is generally made of  and ": null
    },
    {
        "dust": "dust"
    },
    {
        ", with water making up to 90% of the ": null
    },
    {
        "volatiles": "volatiles"
    },
    {
        " that outflow from the nucleus when the comet is within  of the Sun.  The  parent molecule is destroyed primarily through ": null
    },
    {
        "photodissociation": "photodissociation"
    },
    {
        " and to a much smaller extent ": null
    },
    {
        "photoionization": "photoionization"
    },
    {
        ", with the solar wind playing a minor role in the destruction of water compared to ": null
    },
    {
        "photochemistry": "photochemistry"
    },
    {
        ". Larger dust particles are left along the comets orbital path whereas smaller particles are pushed away from the Sun into the comets tail by ": null
    },
    {
        "light pressure": "radiation pressure"
    },
    {
        ".      Although the solid nucleus of comets is generally less than  across, the coma may be thousands or millions of kilometers across, sometimes becoming larger than the Sun.  For example, about a month after an outburst in October 2007, comet ": null
    },
    {
        "17P/Holmes": "17p/holmes"
    },
    {
        " briefly had a tenuous dust atmosphere larger than the Sun.  The ": null
    },
    {
        "Great Comet of 1811": "great comet of 1811"
    },
    {
        " also had a coma roughly the diameter of the Sun.  Even though the coma can become quite large, its size can decrease about the time it crosses the orbit of ": null
    },
    {
        "Mars": "mars"
    },
    {
        " around  from the Sun. At this distance the solar wind becomes strong enough to blow the gas and dust away from the coma, and in doing so enlarging the tail. Ion tails have been observed to extend one ": null
    },
    {
        "astronomical unit": "astronomical unit"
    },
    {
        " or more.        Both the coma and tail are illuminated by the Sun and may become visible when a comet passes through the inner Solar System, the dust reflects sunlight directly while the gases glow from ": null
    },
    {
        "ion": "ion"
    },
    {
        "isation.  Most comets are too faint to be visible without the aid of a ": null
    },
    {
        "telescope": "telescope"
    },
    {
        ", but a few each decade become bright enough to be visible to the naked eye.  Occasionally a comet may experience a huge and sudden outburst of gas and dust, during which the size of the coma greatly increases for a period of time. This happened in 2007 to ": null
    },
    {
        "Comet Holmes": "17p/holmes"
    },
    {
        ".      In 1996, comets were found to emit ": null
    },
    {
        "X-ray": "x-ray"
    },
    {
        "s.  This greatly surprised astronomers because X-ray emission is usually associated with very ": null
    },
    {
        "high-temperature bodies": "black-body radiation"
    },
    {
        ". The X-rays are generated by the interaction between comets and the solar wind: when highly charged solar wind ions fly through a cometary atmosphere, they collide with cometary atoms and molecules, stealing one or more electrons from the atom in a process called charge exchange . This exchange or transfer of an electron to the solar wind ion is followed by its de-excitation into the ground state of the ion by the emission of X-rays and ": null
    },
    {
        "far ultraviolet": "far ultraviolet"
    },
    {
        " photon": "photon"
    },
    {
        "s.        ": null
    },
    {
        "Bow shocks": "bow shock"
    },
    {
        "form as a result of the interaction between the ": null
    },
    {
        "solar wind": "solar wind"
    },
    {
        " and the cometary ionosphere, which is created by ionization of gases in the coma. As the comet approaches the Sun, increasing outgassing rates cause the coma to expand, and the sunlight ionizes gases in the coma. When the solar wind passes through this ion coma, the bow shock appears.     The first observations were made in the 1980s and 90s as several spacecraft flew by comets ": null
    },
    {
        "21P/Giacobini–Zinner": "21p/giacobini–zinner"
    },
    {
        ",  ": null
    },
    {
        "1P/Halley": "halleys comet"
    },
    {
        ",  and ": null
    },
    {
        "26P/Grigg–Skjellerup": "26p/grigg–skjellerup"
    },
    {
        ".  It was then found that the bow shocks at comets are wider and more gradual than the sharp planetary bow shocks seen at, for example, Earth. These observations were all made near ": null
    },
    {
        "perihelion": "perihelion"
    },
    {
        " when the bow shocks already were fully developed.     The ": null
    },
    {
        "Rosetta": "rosetta"
    },
    {
        " spacecraft observed the bow shock at comet ": null
    },
    {
        "67P/Churyumov–Gerasimenko": "67p/churyumov–gerasimenko"
    },
    {
        " at an early stage of bow shock development when the outgassing increased during the comets journey toward the Sun. This young bow shock was called the infant bow shock . The infant bow shock is asymmetric and, relative to the distance to the nucleus, wider than fully developed bow shocks.              In the outer ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        ", comets remain frozen and inactive and are extremely difficult or impossible to detect from Earth due to their small size. Statistical detections of inactive comet nuclei in the ": null
    },
    {
        "Kuiper belt": "kuiper belt"
    },
    {
        " have been reported from observations by the ": null
    },
    {
        "Hubble Space Telescope": "hubble space telescope"
    },
    {
        "   but these detections have been questioned.   As a comet approaches the inner Solar System, ": null
    },
    {
        "solar radiation": "solar radiation"
    },
    {
        " causes the volatile materials within the comet to vaporize and stream out of the nucleus, carrying dust away with them.     The streams of dust and gas each form their own distinct tail, pointing in slightly different directions. The tail of dust is left behind in the comets orbit in such a manner that it often forms a curved tail called the type II or dust tail. At the same time, the ion or type I tail, made of gases, always points directly away from the Sun because this gas is more strongly affected by the solar wind than is dust, following magnetic field lines rather than an orbital trajectory.  On occasions—such as when Earth passes through a comets orbital plane, the ": null
    },
    {
        "antitail": "antitail"
    },
    {
        ", pointing in the opposite direction to the ion and dust tails, may be seen.         The observation of antitails contributed significantly to the discovery of solar wind.  The ion tail is formed as a result of the ionization by solar ultra-violet radiation of particles in the coma. Once the particles have been ionized, they attain a net positive electrical charge, which in turn gives rise to an induced ": null
    },
    {
        "magnetosphere": "magnetosphere"
    },
    {
        " around the comet. The comet and its induced magnetic field form an obstacle to outward flowing solar wind particles. Because the relative orbital speed of the comet and the solar wind is supersonic, a ": null
    },
    {
        "bow shock": "bow shock"
    },
    {
        " is formed upstream of the comet in the flow direction of the solar wind. In this bow shock, large concentrations of cometary ions congregate and act to load the solar magnetic field with plasma, such that the field lines drape around the comet forming the ion tail.      If the ion tail loading is sufficient, the magnetic field lines are squeezed together to the point where, at some distance along the ion tail, ": null
    },
    {
        "magnetic reconnection": "magnetic reconnection"
    },
    {
        " occurs. This leads to a tail disconnection event . This has been observed on a number of occasions, one notable event being recorded on 20 April 2007, when the ion tail of ": null
    },
    {
        "Enckes Comet": "enckes comet"
    },
    {
        " was completely severed while the comet passed through a ": null
    },
    {
        "coronal mass ejection": "coronal mass ejection"
    },
    {
        ". This event was observed by the ": null
    },
    {
        "STEREO space probe": "stereo"
    },
    {
        ".      In 2013, ": null
    },
    {
        "ESA": "esa"
    },
    {
        " scientists reported that the ": null
    },
    {
        "ionosphere": "ionosphere"
    },
    {
        " of the planet ": null
    },
    {
        "Venus": "venus"
    },
    {
        " streams outwards in a manner similar to the ion tail seen streaming from a comet under similar conditions.            Uneven heating can cause newly generated gases to break out of a weak spot on the surface of comets nucleus, like a geyser.  These streams of gas and dust can cause the nucleus to spin, and even split apart. In 2010 it was revealed ": null
    },
    {
        "dry ice": "dry ice"
    },
    {
        " can power jets of material flowing out of a comet nucleus.  Infrared imaging of Hartley  2 shows such jets exiting and carrying with it dust grains into the coma.          Most comets are ": null
    },
    {
        "small Solar System bodies": "small solar system bodies"
    },
    {
        " with elongated ": null
    },
    {
        "elliptical orbits": "elliptical orbit"
    },
    {
        "that take them close to the Sun for a part of their orbit and then out into the further reaches of the Solar System for the remainder.  Comets are often classified according to the length of their ": null
    },
    {
        "orbital period": "orbital period"
    },
    {
        "s: The longer the period the more elongated the ellipse.      Short period      ": null
    },
    {
        "Periodic comets": "list of periodic comets"
    },
    {
        " or short-period comets are generally defined as those having orbital periods of less than 200 years.  They usually orbit more-or-less in the ": null
    },
    {
        "ecliptic": "ecliptic"
    },
    {
        " plane in the same direction as the planets.  Their orbits typically take them out to the region of the outer planets  at ": null
    },
    {
        "aphelion": "aphelion"
    },
    {
        "; for example, the aphelion of Halleys Comet is a little beyond the orbit of ": null
    },
    {
        "Neptune": "neptune"
    },
    {
        ". Comets whose aphelia are near a major planets orbit are called its family .  Such families are thought to arise from the planet capturing formerly long-period comets into shorter orbits.      At the shorter orbital period extreme, ": null
    },
    {
        "Enckes Comet": "enckes comet"
    },
    {
        " has an orbit that does not reach the orbit of Jupiter, and is known as an Encke-type comet. Short-period comets with orbital periods less than 20 years and low inclinations to the ecliptic are called traditional Jupiter-family comets .   Those like Halley, with orbital periods of between 20 and 200 years and inclinations extending from zero to more than 90 degrees, are called Halley-type comets .   , 89 HTCs have been observed,  compared with 676 identified JFCs.      Recently discovered ": null
    },
    {
        "main-belt comets": "main-belt comets"
    },
    {
        " form a distinct class, orbiting in more circular orbits within the ": null
    },
    {
        "asteroid belt": "asteroid belt"
    },
    {
        ".        Because their elliptical orbits frequently take them close to the giant planets, comets are subject to further ": null
    },
    {
        "gravitational perturbations": "perturbation"
    },
    {
        ".  Short-period comets have a tendency for their ": null
    },
    {
        "aphelia": "apsis"
    },
    {
        " to coincide with a ": null
    },
    {
        "giant planets": "giant planet"
    },
    {
        "semi-major axis, with the JFCs being the largest group. It is clear that comets coming in from the Oort cloud often have their orbits strongly influenced by the gravity of giant planets as a result of a close encounter. Jupiter is the source of the greatest perturbations, being more than twice as massive as all the other planets combined. These perturbations can deflect long-period comets into shorter orbital periods.       Based on their orbital characteristics, short-period comets are thought to originate from the ": null
    },
    {
        "centaurs": "centaur"
    },
    {
        " and the Kuiper belt/": null
    },
    {
        "scattered disc": "scattered disc"
    },
    {
        "  —a disk of objects in the trans-Neptunian region—whereas the source of long-period comets is thought to be the far more distant spherical ": null
    },
    {
        "Oort cloud": "oort cloud"
    },
    {
        " .  Vast swarms of comet-like bodies are thought to orbit the Sun in these distant regions in roughly circular orbits. Occasionally the gravitational influence of the outer planets or nearby stars may throw one of these bodies into an elliptical orbit that takes it inwards toward the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " to form a visible comet. Unlike the return of periodic comets, whose orbits have been established by previous observations, the appearance of new comets by this mechanism is unpredictable.                Long-period comets have highly ": null
    },
    {
        "eccentric": "orbital eccentricity"
    },
    {
        " orbits and periods ranging from 200 years to thousands of years. An eccentricity greater than 1 when near ": null
    },
    {
        "perihelion": "perihelion"
    },
    {
        " does not necessarily mean that a comet will leave the Solar System.  For example, ": null
    },
    {
        "Comet McNaught": "c/2006 p1"
    },
    {
        " had a heliocentric osculating eccentricity of 1.000019 near its perihelion passage ": null
    },
    {
        "epoch": "epoch"
    },
    {
        " in January 2007 but is bound to the Sun with roughly a 92,600-year orbit because the ": null
    },
    {
        "eccentricity": "orbital eccentricity"
    },
    {
        " drops below 1 as it moves farther from the Sun. The future orbit of a long-period comet is properly obtained when the ": null
    },
    {
        "osculating orbit": "osculating orbit"
    },
    {
        " is computed at an epoch after leaving the planetary region and is calculated with respect to the ": null
    },
    {
        "center of mass of the Solar System": "barycentric coordinates"
    },
    {
        ". By definition long-period comets remain gravitationally bound to the Sun; those comets that are ejected from the Solar System due to close passes by major planets are no longer properly considered as having periods . The orbits of long-period comets take them far beyond the outer planets at aphelia, and the plane of their orbits need not lie near the ecliptic. Long-period comets such as ": null
    },
    {
        "Comet West": "comet west"
    },
    {
        " and ": null
    },
    {
        "C/1999 F1": "c/1999 f1"
    },
    {
        " can have ": null
    },
    {
        "aphelion": "aphelion"
    },
    {
        " distances of nearly 70,000 AU with orbital periods estimated around 6 million years.     Single-apparition or non-periodic comets are similar to long-period comets because they also have ": null
    },
    {
        "parabolic": "parabolic trajectory"
    },
    {
        " or slightly ": null
    },
    {
        "hyperbolic": "hyperbolic trajectory"
    },
    {
        " trajectories  when near perihelion in the inner Solar System. However, gravitational perturbations from giant planets cause their orbits to change. Single-apparition comets have a hyperbolic or parabolic ": null
    },
    {
        "osculating orbit": "osculating orbit"
    },
    {
        " which allows them to permanently exit the Solar System after a single pass of the Sun.  The Suns ": null
    },
    {
        "Hill sphere": "hill sphere"
    },
    {
        " has an ": null
    },
    {
        "unstable": "unstable"
    },
    {
        " maximum boundary of .  Only a few hundred comets have been seen to reach a hyperbolic orbit ref name e1  ": null
    }
]