[
    {
        "           Communications in Hong Kong includes a wide-ranging and sophisticated network of radio, television, telephone, Internet, and related online services, reflecting Hong Kongs thriving commerce and international importance.     There are some 60 ": null
    },
    {
        "online": "Internet"
    },
    {
        " newspapers  and the numbers of online periodicals run into the hundreds. The territory is in addition the ": null
    },
    {
        "East": "East Asia"
    },
    {
        " and ": null
    },
    {
        "Southeast": "Southeast Asia"
    },
    {
        " Asian headquarters for most of the major international communications and media services.     Broadcast media and news is provided by several television and radio companies, one of which is ": null
    },
    {
        "government": "Government Of Hong Konggovernment Offices And Policy Bureaus"
    },
    {
        "-run. Television provides the major source of news and entertainment for the average family. Chinese television programs are produced for both local and overseas markets.     Hong Kong also ranks as an important centre of publishing and printing: numerous books are published yearly for local consumption, several leading foreign publishers have their regional offices in Hong Kong, and many international magazines are printed in the territory.         5 radio networks, one of which is government-funded, operate 30 radio stations   Radios: 4.45 million               There are a total of nine terrestrial television channels in Hong Kong, owned by three television networks, one of which is a public broadcaster.     Hong Kongs terrestrial commercial TV networks can also be seen in ": null
    },
    {
        "Macau": "Macau"
    },
    {
        ", via cable.       ": null
    },
    {
        "Television Broadcasts Limited": "Tvb"
    },
    {
        " operates ": null
    },
    {
        "TVB Jade": "Tvb Jade"
    },
    {
        ", ": null
    },
    {
        "TVB Pearl": "Tvb Pearl"
    },
    {
        ", ": null
    },
    {
        "J2": "Tvb J2"
    },
    {
        ", ": null
    },
    {
        "iNews": "Tvb Inews"
    },
    {
        " and ": null
    },
    {
        "J5": "Tvb J5"
    },
    {
        ", of which Jade and Pearl are available on analogue frequencies. TVB is the citys first commercial terrestrial television network , and is the citys predominant TV network.       ": null
    },
    {
        "HK Television Entertainment": "Hk Television Entertainment"
    },
    {
        " operates ": null
    },
    {
        "ViuTV": "Viutv"
    },
    {
        ", which is a Cantonese general entertainment channel. The network is mandated by its service license to launch a 17-hour ": null
    },
    {
        "English": "English Language"
    },
    {
        " television channel on or before 31 March 2017.      ViuTV is not broadcast on analogue frequencies.       Public broadcaster ": null
    },
    {
        "RTHK": "Rthk"
    },
    {
        " operates three digital channels, two of which have been simulcast on analogue frequencies formerly used by ATV since April 2, 2016.       Paid cable and satellite television have also been widespread, with ": null
    },
    {
        "Cable TV Hong Kong": "Cable Tv Hong Kong"
    },
    {
        ", ": null
    },
    {
        "Now TV": "Now Tv"
    },
    {
        ", TVB Network Vision and ": null
    },
    {
        "HKBN bbTV": "Hkbn Bbtv"
    },
    {
        " being the more prominent providers.     The production of Hong Kongs soap drama, comedy series and variety shows have reached mass audiences throughout the Chinese-speaking world. Many international and pan-Asian broadcasters are based in Hong Kong, including ": null
    },
    {
        "News Corporations": "News Corporation"
    },
    {
        " STAR TV": "Fox Networks Group Asia Pacific"
    },
    {
        ".        ": null
    },
    {
        "ASEAN": "Asean"
    },
    {
        " member nations, Japan, Taiwan, Australia, Middle East, and Western Europe      The Hong Kong telecommunication industry was deregulated in 1995. There are no foreign ownership restrictions. The Office of Telecommunications Authority is the legislative body responsible for regulating the telecommunications industry. Competition in this sector is fierce. Since 2008, one can get 10 Mbit/s up and down unlimited ": null
    },
    {
        "VDSL": "Vdsl"
    },
    {
        ", telephone line rental, unlimited local calls, and 100 minutes of international calls for US$25/month. Telephone line rental and unlimited local calls is only US$3/month.         International dialling code: +852   Telephones – main lines in use: 4.345 million, 37th in the world   Telephones – mobile cellular: 13.416 million, 54th in the world   Major fixed-line operators: ": null
    },
    {
        "PCCW": "Pccw"
    },
    {
        " 3 Hong Kong": "3 Hong Kong"
    },
    {
        ", ": null
    },
    {
        "SmarTone": "Smartone"
    },
    {
        ", ": null
    },
    {
        "CSL": "Csl Mobile Limited"
    },
    {
        ", ": null
    },
    {
        "China Mobile Hong Kong": "China Mobile Hong Kong"
    },
    {
        " , ": null
    },
    {
        "International Telecommunication Union": "International Telecommunication Union"
    },
    {
        ", accessed 16 April 2012.   Number of Internet hosts: 861,516 hosts, 48th in the world , CIA World Factbook, U.S. Central Intelligence Agency, accessed 2 April 2012   IPv4 addresses allocated: 11,777,024 or 1,646 per 1000 population  , Country IP Blocks. Accessed on 2 April 2012. Note: Site is said to be updated daily.   Internet Service Providers : 179   Dial-up access accounts: 0.99 million   ": null
    },
    {
        "Country code": "Country Codes"
    },
    {
        " : ": null
    },
    {
        ".hk": ".Hk"
    },
    {
        "       Fixed broadband subscriptions: 2,111,109 or 29.93 per 100 inhabitants , ": null
    },
    {
        "International Telecommunication Union": "International Telecommunication Union"
    },
    {
        ". Accessed on 8 April 2012. Excluding subscriptions that have access to data communications via mobile cellular networks,  , ": null
    },
    {
        "International Telecommunication Union": "International Telecommunication Union"
    },
    {
        ". Accessed on 30 September 2011.     As of April 2006, ": null
    },
    {
        "HKBN": "Hkbn"
    },
    {
        " offers its customers Internet access with speeds starting from 10 Mbit/s up to 1000 Mbit/s via ": null
    },
    {
        "Fiber to the building": "Fiber To The Building"
    },
    {
        " and ": null
    },
    {
        "Fiber to the Home": "Fiber To The Home"
    },
    {
        ". However the speed to non-Hong Kong destinations is capped to 20 Mbit/s.   As of November 2009, the company was offering 100 Mbit/s service for HK$99 per month.     Major Internet Service Providers include: ": null
    },
    {
        "PCCW": "Pccw"
    },
    {
        " Netvigator": "Netvigator"
    },
    {
        ", with a 95% coverage area and providing internet access to 1.9 million users. ADSL connections, speeds up to 8M/800K are priced differently. Newly constructed apartments have ADSL2 and VDSL connections, which have speeds up to 100M/100M. FTTH for last mile broadband of speeds up to 10G/10G. Business plans have speeds up to 10G/10G.   ": null
    },
    {
        "HGC": "Hutchison Global Communications"
    },
    {
        " ADSL & VDSL & FTTH broadband of speeds up to 1G/1G.    ADSL & VDSL broadband of speeds up to 10M/10M.   ": null
    },
    {
        "HKBN": "Hkbn"
    },
    {
        " Metro Ethernet": "Metro Ethernet"
    },
    {
        "  broadband of speeds up to 1G/1G.    Cable HFC Broadband of speeds up to 200M/10M shared by one tower and FTTH Broadband of speeds up to 1G/1G.            There is very little Internet censorship in Hong Kong beyond laws that criminalise the distribution of unlicensed copyrighted material and obscene images, particularly child pornography. Hong Kong law provides for freedom of speech and press, and the government generally respects these rights in practice. Freedom of expression is well protected by the ": null
    },
    {
        "Hong Kong Bill of Rights": "Hong Kong Bill Of Rights Ordinance"
    },
    {
        ".  , 8 June 1991, Hong Kong Human Rights Monitor, accessed 30 June 2012 No websites, regardless of their political views, are blocked and government licenses are not required to operate a website. There is some monitoring of the Internet. Democratic activists claim central government authorities closely monitor their e-mails and Internet use. , 2011 Country Reports on Human Rights Practices": null
    }
]