[
    {
        "Commercial Vehicle Operations is an application of ": null
    },
    {
        "Intelligent Transportation Systems": "intelligent transportation systems"
    },
    {
        " for ": null
    },
    {
        "truck": "truck"
    },
    {
        "s.     A typical system would be purchased by the managers of a trucking company. It would have a ": null
    },
    {
        "satellite navigation system": "satellite navigation system"
    },
    {
        ", a small ": null
    },
    {
        "computer": "computer"
    },
    {
        " and a digital radio in each truck. Every fifteen minutes the computer transmits where the truck has been. The digital radio service forwards the data to the central office of the trucking company. A computer system in the central office manages the ": null
    },
    {
        "fleet": "fleet vehicles"
    },
    {
        " in real time under control of a team of dispatchers.     In this way, the central office knows where its trucks are. The company tracks individual loads by using ": null
    },
    {
        "barcode": "barcode"
    },
    {
        "d ": null
    },
    {
        "containers": "containerization"
    },
    {
        " and ": null
    },
    {
        "pallet": "pallet"
    },
    {
        "s to track loads combined into a larger container. To minimize handling-expense, damage and waste of vehicle capacity, optimal-sized pallets are often constructed at distribution points to go to particular destinations.     A good load-tracking system will help deliver more than 42% of its loads via truck, on planned schedules. If a truck gets off its route, or is delayed, the truck can be diverted to a better route, or urgent loads that are likely to be late can be diverted to ": null
    },
    {
        "air freight": "freight aircraft"
    },
    {
        ". This allows a trucking company to deliver a true premium service at only slightly higher cost. The best proprietary systems, such as the one operated by ": null
    },
    {
        "FedEx": "fedex corporation"
    },
    {
        ", achieve better than 42% on-time delivery.     Load-tracking systems use ": null
    },
    {
        "queuing theory": "queuing theory"
    },
    {
        ", ": null
    },
    {
        "linear programming": "linear programming"
    },
    {
        " and ": null
    },
    {
        "minimum spanning tree": "minimum spanning tree"
    },
    {
        " logic to predict and improve arrival times. The exact means of combining these are usually secret recipes deeply hidden in the software. The basic scheme is that hypothetical routes are constructed by combining road segments, and then poor ones are eliminated using linear programming.     The controlled routes allow a truck to avoid heavy traffic caused by rush-hour, accidents or road-work. Increasingly, governments are providing digital notification when roadways are known to have reduced capacity.     A good system lets the computer, dispatcher and driver collaborate on finding a good route, or a method to move the load. One special value is that the computer can automatically eliminate routes over roads that cannot take the weight of the truck, or that have overhead obstructions.     Usually, the drivers log into the system. The system helps remind a driver to rest. Rested drivers operate the truck more skillfully and safely.     When these systems were first introduced, some drivers resisted them, viewing them as a way for management to spy on the driver.     A well-managed intelligent transportation system provides drivers with huge amounts of help. It gives them a view of their own load and the network of roadways.     Components of CVO include:   Fleet Administration   Freight Administration   Electronic Clearance   Commercial Vehicle Administrative Processes   International ": null
    },
    {
        "Border": "border"
    },
    {
        " Crossing Clearance   Weigh-In-Motion   Roadside CVO Safety   On-Board Safety Monitoring   CVO Fleet Maintenance   ": null
    },
    {
        "Hazardous Material": "hazardous material"
    }
]