[
    {
        "   Commander Keen is a series of ": null
    },
    {
        "side-scrolling": "side-scrolling video game"
    },
    {
        " platform": "platform game"
    },
    {
        " video game": "video game"
    },
    {
        "s developed primarily by ": null
    },
    {
        "id Software": "id software"
    },
    {
        ". The series consists of six main episodes, a lost episode, and a final game; all but the final game were originally released for ": null
    },
    {
        "MS-DOS": "ms-dos"
    },
    {
        " in 42 and 42 while the 42  Commander Keen  was released for the ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        ". The series follows the eponymous Commander Keen, the secret identity of the eight-year-old genius Billy Blaze, as he defends the Earth and the galaxy from alien threats with his homemade spaceship, ": null
    },
    {
        "raygun": "raygun"
    },
    {
        "s, and ": null
    },
    {
        "pogo stick": "pogo stick"
    },
    {
        ". The first three episodes were developed by Ideas from the Deep, the precursor to id, and published by ": null
    },
    {
        "Apogee Software": "3d realms"
    },
    {
        " as the ": null
    },
    {
        "shareware": "shareware"
    },
    {
        " title  Commander Keen in Invasion of the Vorticons ; the lost episode 42  Commander Keen in Keen Dreams  was developed by id and published as a retail title by ": null
    },
    {
        "Softdisk": "softdisk"
    },
    {
        "; episodes four and five were released by Apogee as the shareware  Commander Keen in Goodbye, Galaxy ; and the simultaneously developed episode six was published in retail by ": null
    },
    {
        "FormGen": "formgen"
    },
    {
        " as  Commander Keen in Aliens Ate My Babysitter . Ten years later, a homage and sequel to the series was developed by David A. Palmer Productions and published by ": null
    },
    {
        "Activision": "activision"
    },
    {
        " as Commander Keen. Another game was announced in 42 as under development by ZeniMax Online Studios.     Invasion of the Vorticons was the only game developed by Ideas from the Deep, and was based on programmer ": null
    },
    {
        "John Carmack": "john carmack"
    },
    {
        "s creation of ": null
    },
    {
        "adaptive tile refresh": "adaptive tile refresh"
    },
    {
        ", a technique that allowed ": null
    },
    {
        "IBM-compatible general-purpose computers": "ibm pc compatible"
    },
    {
        " to replicate the smooth scrolling of ": null
    },
    {
        "video game console": "video game console"
    },
    {
        "s such as the ": null
    },
    {
        "Nintendo Entertainment System": "nintendo entertainment system"
    },
    {
        ". The games success caused designer ": null
    },
    {
        "Tom Hall": "tom hall"
    },
    {
        ", programmers John Carmack and ": null
    },
    {
        "John Romero": "john romero"
    },
    {
        ", and artist ": null
    },
    {
        "Adrian Carmack": "adrian carmack"
    },
    {
        " to found id Software. Their obligations to Softdisk, where they had worked during development of the game, led to the creation of Keen Dreams as a prototype for the second trilogy of episodes. The final episode was split off during development into a stand-alone retail title, and plans for a third trilogy were cancelled after the success of  Wolfenstein 42D  and development focus on 42D ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        "s such as  Doom  . The final Keen game ten years later had oversight but little development work from id.     Critical reception and the series legacy has focused on the two main trilogies of episodes, with Vorticons having large success as a shareware game and impacting the success of Apogee and its shareware model. The second trilogy sold fewer copies, which was blamed by id and Apogee on its split into two parts, and the 42 game received mixed reviews. The MS-DOS games have been re-released in several compilation packages, and all but the sixth episode are still sold through modern emulation releases on platforms such as ": null
    },
    {
        "Steam": "steam"
    }
]