[
    {
        "In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        ", communications-electronics is the specialized field concerned with the use of electronic devices and systems for the ": null
    },
    {
        "acquisition": "data acquisition"
    },
    {
        " or acceptance, processing, ": null
    },
    {
        "storage": "computer data storage"
    },
    {
        ", display, analysis, protection, disposition, and transfer of ": null
    },
    {
        "information": "information"
    },
    {
        ".     C-E includes the wide range of responsibilities and actions relating to:     Electronic devices and systems used in the transfer of ideas and perceptions;   Electronic sensors and sensory systems used in the acquisition of information devoid of semantic influence;   Electronic devices and systems intended to allow friendly forces to operate in hostile environments and to deny to hostile forces the effective use of electromagnetic resources.       Communication electronics ": null
    },
    {
        "radio equipment": "radio equipment"
    },
    {
        " has been a rapidly growing industry for more than a century. ": null
    },
    {
        "Homeland Security": "homeland security"
    },
    {
        " in the USA is one of the reasons for the fast growth. Since the invention of the “solid state” ": null
    },
    {
        "transistor": "transistor"
    },
    {
        " in the 42s and the TTL  that led to the development of the IC  in the 42s the growth in the field of electronics has been phenomenal. As now witnessed in the “radio communications” field. The latest trend is to send conventional LMR signals over the Internet  this is called ": null
    },
    {
        "RoIP": "roip"
    },
    {
        " , which is just like VoIP but uses the radio. By sending signals over the Internet it allows radios to be connected together all over the world. Hence: the “Communications Revolution”.                    ": null
    },
    {
        "it:Ingegneria delle telecomunicazioni": "it:ingegneria delle telecomunicazioni"
    }
]