[
    {
        "                Compact disc  is a ": null
    },
    {
        "digital": "digital media"
    },
    {
        " optical disc": "optical disc"
    },
    {
        " data storage": "data storage device"
    },
    {
        " format that was co-developed by ": null
    },
    {
        "Philips": "philips"
    },
    {
        " and ": null
    },
    {
        "Sony": "sony"
    },
    {
        " and released in 1982. The format was originally developed to store and play only sound recordings  but was later adapted for storage of data . Several other formats were further derived from these, including write-once audio and data storage , rewritable media , Video Compact Disc , Super Video Compact Disc , ": null
    },
    {
        "Photo CD": "photo cd"
    },
    {
        ", PictureCD, Compact Disc-Interactive , and ": null
    },
    {
        "Enhanced Music CD": "enhanced music cd"
    },
    {
        ". The first commercially available audio ": null
    },
    {
        "CD player": "cd player"
    },
    {
        ", the ": null
    },
    {
        "Sony CDP-101": "sony cdp-101"
    },
    {
        ", was released October 1982 in ": null
    },
    {
        "Japan": "japan"
    },
    {
        ".     Standard CDs have a diameter of  and can hold up to about 80 minutes of uncompressed audio or about 700  ": null
    },
    {
        "MiB": "mib"
    },
    {
        " of data. The ": null
    },
    {
        "Mini CD": "mini cd"
    },
    {
        " has various diameters ranging from ; they are sometimes used for CD singles, storing up to 24 minutes of audio, or delivering ": null
    },
    {
        "device driver": "device driver"
    },
    {
        "s.     At the time of the technologys introduction in 1982, a CD could store much more data than a ": null
    },
    {
        "personal computer": "personal computer"
    },
    {
        " hard drive": "hard drive"
    },
    {
        ", which would typically hold 10 MB. By 2010, hard drives commonly offered as much storage space as a thousand CDs, while their prices had plummeted to commodity level. In 2004, worldwide sales of audio CDs, CD-ROMs and CD-Rs reached about 30 billion discs. By 2007, 200 billion CDs had been sold worldwide.     From the early 2000s CDs were increasingly being replaced by other forms of digital storage and distribution, with the result that by 2010 the number of audio CDs being sold in the U.S. had dropped about 50 percent from their peak; however, they remained one of the primary distribution methods for the ": null
    },
    {
        "music industry": "music industry"
    },
    {
        ". In 2014, revenues from digital music services matched those from physical format sales for the first time.        American inventor ": null
    },
    {
        "James T. Russell": "james russell"
    },
    {
        " has been credited with inventing the first system to record digital information on an optical ": null
    },
    {
        "transparent": "transparency and translucency"
    },
    {
        " foil": "foil"
    },
    {
        " that is lit from behind by a high-power halogen lamp.  Analog to digital to optical photographic recording and playback system, March 1970.  Method and apparatus for synchronizing photographic records of digital information, March 1974. Russells patent application was filed in 1966, and he was granted a patent in 1970. Following litigation, Sony and Philips licensed Russells patents in the 1980s.        The compact disc is an evolution of ": null
    },
    {
        "LaserDisc": "laserdisc"
    },
    {
        " technology, where a focused ": null
    },
    {
        "laser": "laser"
    },
    {
        " beam   is used that enables the high information density required for high-quality digital audio signals.   Prototypes were developed by ": null
    },
    {
        "Philips": "philips"
    },
    {
        " and ": null
    },
    {
        "Sony": "sony"
    },
    {
        " independently in the late 1970s.  Although originally dismissed by ": null
    },
    {
        "Philips Research": "philips research"
    },
    {
        " management as a trivial pursuit, the CD became the primary focus for Philips as the ": null
    },
    {
        "LaserDisc": "laserdisc"
    },
    {
        " format struggled.  In 1979, Sony and Philips set up a joint task force of engineers to design a new digital audio disc. After a year of experimentation and discussion, the  Red Book  ": null
    },
    {
        "CD-DA": "compact disc digital audio"
    },
    {
        " standard was published in 1980. After their commercial release in 1982, compact discs and their players were extremely popular. Despite costing up to $1,000, over 400,000 CD players were sold in the United States between 1983 and 1984.  By 1988, CD sales in the United States surpassed those of vinyl LPs, and by 1992 CD sales surpassed those of prerecorded music cassette tapes.   The success of the compact disc has been credited to the cooperation between ": null
    },
    {
        "Philips": "philips"
    },
    {
        " and ": null
    },
    {
        "Sony": "sony"
    },
    {
        ", which together agreed upon and developed compatible hardware. The unified design of the compact disc allowed consumers to purchase any disc or player from any company, and allowed the CD to dominate the at-home music market unchallenged.        In 1974, Lou Ottens, director of the audio division of ": null
    },
    {
        "Philips": "philips"
    },
    {
        ", started a small group with the aim to develop an analog optical audio disc with a diameter of  and a sound quality superior to that of the vinyl record.  ,   Chris Kornelis, 27 January 2015 However, due to the unsatisfactory performance of the analog format, two Philips research engineers recommended a digital format in March 1974. In 1977, Philips then established a laboratory with the mission of creating a digital audio disc. The diameter of Philipss prototype compact disc was set at , the diagonal of an audio cassette.     ": null
    },
    {
        "Heitaro Nakajima": "heitaro nakajima"
    },
    {
        ", who developed an early digital audio recorder within Japans national public broadcasting organization ": null
    },
    {
        "NHK": "nhk"
    },
    {
        " in 1970, became general manager of ": null
    },
    {
        "Sonys": "sony"
    },
    {
        "audio department in 1971. His team developed a digital ": null
    },
    {
        "PCM adaptor": "pcm adaptor"
    },
    {
        " audio tape recorder using a ": null
    },
    {
        "Betamax": "betamax"
    },
    {
        " video recorder in 1973. After this, in 1974 the leap to storing digital audio on an optical disc was easily made.  ": null
    },
    {
        "Sony": "sony"
    },
    {
        " first publicly demonstrated an optical digital audio disc in September 1976. A year later, in September 1977, Sony showed the press a  disc that could play 60 minutes of digital audio using ": null
    },
    {
        "MFM": "run-length limited"
    },
    {
        " modulation. In September 1978, the company demonstrated an optical digital audio disc with a 150-minute playing time, 44,056  Hz sampling rate, 16-bit linear resolution, and ": null
    },
    {
        "cross-interleaved": "cross-interleaved reed-solomon coding"
    },
    {
        " error correction": "error correction"
    },
    {
        " code—specifications similar to those later settled upon for the standard compact disc format in 1980. Technical details of Sonys digital audio disc were presented during the 62nd ": null
    },
    {
        "AES": "audio engineering society"
    },
    {
        " Convention, held on 13–16 March 1979, in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ". Sonys AES technical paper was published on 1 March 1979. A week later, on 8 March, Philips publicly demonstrated a prototype of an optical digital audio disc at a press conference called Philips Introduce Compact Disc in ": null
    },
    {
        "Eindhoven": "eindhoven"
    },
    {
        ", ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ".          Sony executive ": null
    },
    {
        "Norio Ohga": "norio ohga"
    },
    {
        ", later CEO and chairman of Sony, and ": null
    },
    {
        "Heitaro Nakajima": "heitaro nakajima"
    },
    {
        " were convinced of the formats commercial potential and pushed further development despite widespread skepticism.     As a result, in 1979, Sony and Philips set up a joint task force of engineers to design a new digital audio disc. Led by engineers ": null
    },
    {
        "Kees Schouhamer Immink": "kees schouhamer immink"
    },
    {
        " and ": null
    },
    {
        "Toshitada Doi": "toshitada doi"
    },
    {
        ", the research pushed forward ": null
    },
    {
        "laser": "laser"
    },
    {
        " and ": null
    },
    {
        "optical disc": "optical disc"
    },
    {
        " technology. After a year of experimentation and discussion, the task force produced the  Red Book  ": null
    },
    {
        "CD-DA": "compact disc digital audio"
    },
    {
        " standard. First published in 1980, the standard was formally adopted by the ": null
    },
    {
        "IEC": "international electrotechnical commission"
    },
    {
        " as an international standard in 1987, with various amendments becoming part of the standard in 1996.     Philips coined the term compact disc in line with another audio product, the ": null
    },
    {
        "Compact Cassette": "compact cassette"
    },
    {
        ", and contributed the general ": null
    },
    {
        "manufacturing": "manufacturing"
    },
    {
        " process": "industrial process"
    },
    {
        ", based on video LaserDisc technology. Philips also contributed ": null
    },
    {
        "eight-to-fourteen modulation": "eight-to-fourteen modulation"
    },
    {
        " , which offers a certain resilience to defects such as scratches and fingerprints, while Sony contributed the ": null
    },
    {
        "error-correction": "error-correction"
    },
    {
        " method, ": null
    },
    {
        "CIRC": "cross-interleaved reed-solomon coding"
    },
    {
        ".     The Compact Disc Story, told by a former member of the task force, gives background information on the many technical decisions made, including the choice of the sampling frequency, playing time, and disc diameter. The task force consisted of around four to eight persons, though according to Philips, the compact disc was invented collectively by a large group of people working as a team.       Philips established the Polydor Pressing Operations plant in ": null
    },
    {
        "Langenhagen": "langenhagen"
    },
    {
        " near ": null
    },
    {
        "Hannover": "hannover"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", and quickly passed a series of milestones.   The first test pressing was of a recording of ": null
    },
    {
        "Richard Strausss": "richard strauss"
    },
    {
        "  Eine Alpensinfonie   played by the ": null
    },
    {
        "Berlin Philharmonic": "berlin philharmonic"
    },
    {
        " and conducted by ": null
    },
    {
        "Herbert von Karajan": "herbert von karajan"
    },
    {
        ", who had been enlisted as an ambassador for the format in 1979.   The first public demonstration was on the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " television programme  Tomorrows World  in 1981, when the ": null
    },
    {
        "Bee Gees": "bee gees"
    },
    {
        " album  Living Eyes  was played.   The first commercial compact disc was produced on 17 August 1982, a 1979 recording of Chopin waltzes by ": null
    },
    {
        "Claudio Arrau": "claudio arrau"
    },
    {
        ".    The first 50 titles were released in Japan on 1 October 1982, the very first of which was a re-release of the ": null
    },
    {
        "Billy Joel": "billy joel"
    },
    {
        " album  52nd Street .    The first CD played on BBC Radio was in October 1982 on BBC Radio Scotland , with the first CD played on UK independent radio station shortly after . The CD was ": null
    },
    {
        "Dire Straits": "dire straits"
    },
    {
        " album  Love Over Gold .     The Japanese launch was followed in March 1983 by the introduction of CD players and discs to Europe  , Philips Media Release, 16 August 2007. Retrieved 6 October 2013. and North America .  This 1983 event is often seen as the Big Bang  of the digital audio revolution. The new audio disc was enthusiastically received, especially in the early-adopting ": null
    },
    {
        "classical music": "european classical music"
    },
    {
        " and ": null
    },
    {
        "audiophile": "audiophile"
    },
    {
        " communities, and its handling quality received particular praise. As the price of players gradually came down, and with the introduction of the portable ": null
    },
    {
        "Discman": "discman"
    },
    {
        " the CD began to gain popularity in the larger popular and rock music markets. With the rise in CD sales, pre-recorded ": null
    },
    {
        "cassette tape": "cassette tape"
    },
    {
        " sales began to decline in the late 1980s; CD sales overtook cassette sales in the early 1990s.       The first artist to sell a million copies on CD was ": null
    },
    {
        "Dire Straits": "dire straits"
    },
    {
        ", with their 1985 album  Brothers in Arms . One of the first CD markets was devoted to reissuing popular music whose commercial potential was already proven. The first major artist to have their entire catalogue converted to CD was ": null
    },
    {
        "David Bowie": "david bowie"
    },
    {
        ", whose first fourteen studio albums of sixteen were made available by ": null
    },
    {
        "RCA Records": "rca records"
    },
    {
        " in February 1985, along with four greatest hits albums; his fifteenth and sixteenth albums had already been issued on CD by ": null
    },
    {
        "EMI Records": "emi records"
    },
    {
        " in 1983 and 1984, respectively. On February 26, 1987, the first four UK albums by ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        " were released in mono on compact disc. In 1988, 400 million CDs were manufactured by 50 pressing plants around the world.          The CD was planned to be the successor of the ": null
    },
    {
        "vinyl record": "vinyl record"
    },
    {
        " for playing music, rather than primarily as a data storage medium. From its origins as a musical format, CDs have grown to encompass other applications. In 1983, following the CDs introduction, ": null
    },
    {
        "Immink": "kees schouhamer immink"
    },
    {
        " and ": null
    },
    {
        "Braat": "joseph braat"
    },
    {
        " presented the first experiments with erasable compact discs during the 73rd ": null
    },
    {
        "AES": "audio engineering society"
    },
    {
        " Convention.    In June 1985, the computer-readable ": null
    },
    {
        "CD-ROM": "cd-rom"
    },
    {
        " and, in 1990, ": null
    },
    {
        "CD-R": "cd-r"
    },
    {
        "ecordable were introduced, also developed by both Sony and Philips. Recordable CDs were a new alternative to tape for recording music and copying music albums without defects introduced in compression used in other digital recording methods. Other newer video formats such as ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " and ": null
    },
    {
        "Blu-ray": "blu-ray"
    },
    {
        " use the same physical geometry as CD, and most DVD and Blu-ray players are ": null
    },
    {
        "backward compatible": "backward compatible"
    },
    {
        " with audio CD.     U.S. CD sales peaked in 2000.  By the early 2000s, the CD player had largely replaced the ": null
    },
    {
        "audio cassette": "compact cassette"
    },
    {
        " player as standard equipment in new automobiles, with 2010 being the final model year for any car in the United States to have a factory-equipped cassette player. With the increasing popularity of portable digital audio players, such as mobile phones, and solid state music storage, CD players are being phased out of automobiles in favor of ": null
    },
    {
        "minijack": "minijack"
    },
    {
        " auxiliary inputs, wired connection to USB devices and wireless ": null
    },
    {
        "Bluetooth": "bluetooth"
    },
    {
        " connection.      Meanwhile, with the advent and popularity of ": null
    },
    {
        "Internet-based distribution": "digital distribution"
    },
    {
        " of files in ": null
    },
    {
        "lossily-compressed": "lossy compression"
    },
    {
        "audio formats": "audio format"
    },
    {
        "such as ": null
    },
    {
        "MP3": "mp3"
    },
    {
        ", sales of CDs began to decline in the 2000s. For example, between 2000 and 2008, despite overall growth in music sales and one anomalous year of increase, major-label CD sales declined overall by 20 percent, although independent and DIY music sales may be tracking better according to figures released 30 March 2009, and CDs still continue to sell greatly. As of 2012, CDs and DVDs made up only 34 percent of music sales in the United States.  , only 24 percent of music in the United States was purchased on physical media, ⅔ of this consisting of CDs;  however, in the same year in Japan, over 80 percent of music was bought on CDs and other physical formats. Sisaro, Ben. New York Times 11 June 2015:  In 2018, U.S. CD sales were 52 million units — less than 6% of the peak sales volume in 2000.     Despite the rapidly declining sales year-over-year, the pervasiveness of the technology remained for a time, with companies placing CDs in pharmacies, supermarkets, and filling station convenience stores targeting buyers least able to use Internet-based distribution. However, in 2018, ": null
    },
    {
        "Best Buy": "best buy"
    },
    {
        " announced plans to decrease their focus on CD sales.          Sony and Philips received praise for the development of the compact disc from professional organizations. These awards include   Technical ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        " for Sony and Philips, 1998.   ": null
    },
    {
        "IEEE": "ieee"
    },
    {
        " Milestone award, 2009, for Philips only with the citation: On 8 March 1979, N.V. Philips Gloeilampenfabrieken demonstrated for the international press a Compact Disc Audio Player. The demonstration showed that it is possible by using digital optical recording and playback to reproduce audio signals with superb stereo quality. This research at Philips established the technical standard for digital optical recording systems.               A CD is made from  thick, ": null
    },
    {
        "polycarbonate": "polycarbonate"
    },
    {
        " plastic and weighs 15–20  grams.  From the center outward, components are: the center spindle hole , the first-transition area , the clamping area , the second-transition area , the program area, and the rim. The inner program area occupies a radius from 25 to 58  mm.     A thin layer of aluminium or, more rarely, ": null
    },
    {
        "gold": "gold compact disc"
    },
    {
        " is applied to the surface, making it reflective. The metal is protected by a film of lacquer normally ": null
    },
    {
        "spin coated": "spin coated"
    },
    {
        " directly on the reflective layer. The label is printed on the lacquer layer, usually by ": null
    },
    {
        "screen printing": "screen printing"
    },
    {
        " or ": null
    },
    {
        "offset printing": "offset printing"
    },
    {
        ".     CD data is represented as tiny indentations known as pits , encoded in a spiral track moulded into the top of the polycarbonate layer. The areas between pits are known as lands. Each pit is approximately 100  ": null
    },
    {
        "nm": "nanometre"
    },
    {
        " deep by 500  nm wide, and varies from 850  nm to 3.5  ": null
    },
    {
        "µm": "micrometre"
    },
    {
        " in length.  The distance between the tracks is 1.6  µm.        When playing an audio CD, a motor within the CD player spins the disc to a scanning velocity of 1.2–1.4  m/s   – equivalent to approximately 500 RPM at the inside of the disc, and approximately 200 RPM at the outside edge. The track on the CD begins at the inside and spirals outward so a disc played from beginning to end slows its rotation rate during playback.        The program area is 86.05  cm 2 and the length of the recordable spiral is    5.38  km. With a scanning speed of 1.2  m/s, the playing time is 74 minutes, or 650  MiB of data on a CD-ROM. A disc with data packed slightly more densely is tolerated by most players . Using a linear velocity of 1.2  m/s and a narrower track pitch of 1.5  µm increases the playing time to 80 minutes, and data capacity to 700  MiB.        A CD is read by focusing a 780  nm ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        "  semiconductor laser": "semiconductor laser"
    },
    {
        " housed within the CD player, through the bottom of the polycarbonate layer. The change in height between pits and lands results in a difference in the way the light is reflected. By measuring the intensity change with a ": null
    },
    {
        "photodiode": "photodiode"
    },
    {
        ", the data can be read from the disc. In order to accommodate the spiral pattern of data, the ": null
    },
    {
        "semiconductor laser": "semiconductor laser"
    },
    {
        " is placed on a mobile laser pickup assembly mechanism within the disc tray of any CD player; this mechanism typically takes the form of a hub that slides across a rail or ": null
    },
    {
        "worm gear": "worm gear"
    },
    {
        ", though some CD drives use a swing arm similar to that seen on a gramophone. This mechanism allows the laser to read information from the centre to the edge of a disc without having to interrupt the spinning of the disc itself.          The pits and lands do not directly represent the 0s and 1s of ": null
    },
    {
        "binary data": "binary data"
    },
    {
        ". Instead, ": null
    },
    {
        "non-return-to-zero, inverted": "non-return-to-zero, inverted"
    },
    {
        " encoding is used: a change from either pit to land or land to pit indicates a 1, while no change indicates a series of 0s. There must be at least two, and no more than ten 0s between each 1, which is defined by the length of the pit. This in turn is decoded by reversing the ": null
    },
    {
        "eight-to-fourteen modulation": "eight-to-fourteen modulation"
    },
    {
        " used in mastering the disc, and then reversing the ": null
    },
    {
        "cross-interleaved Reed–Solomon coding": "cross-interleaved reed–solomon coding"
    },
    {
        ", finally revealing the raw data stored on the disc. These encoding techniques  were originally designed for ": null
    },
    {
        "CD Digital Audio": "compact disc digital audio"
    },
    {
        ", but they later became a standard for almost all CD formats .       CDs are susceptible to damage during handling and from environmental exposure. Pits are much closer to the label side of a disc, enabling defects and contaminants on the clear side to be out of focus during playback. Consequently, CDs are more likely to suffer damage on the label side of the disc. Scratches on the clear side can be repaired by refilling them with similar refractive plastic or by careful polishing. The edges of CDs are sometimes incompletely sealed, allowing gases and liquids to enter the CD and corrode the metal reflective layer and/or interfere with the focus of the laser on the pits, a condition known as ": null
    },
    {
        "disc rot": "disc rot"
    },
    {
        ". Council on Library and Information Resources:   The fungus  Geotrichum candidum  has been found—under conditions of high heat and humidity—to consume the polycarbonate plastic and aluminium found in CDs.              The digital data on a CD begins at the center of the disc and proceeds toward the edge, which allows adaptation to the different size formats available. Standard CDs are available in two sizes. By far, the most common is  in diameter, with a 74- or 80-minute audio capacity and a 650 or 700  MiB data capacity. The official Philips history says this capacity was specified by Sony executive ": null
    },
    {
        "Norio Ohga": "norio ohga"
    },
    {
        " so as to be able to contain the entirety of ": null
    },
    {
        "Beethovens Ninth Symphony": "beethovens ninth symphony"
    },
    {
        " on one disc. This is a myth according to ": null
    },
    {
        "Kees Immink": "kees schouhamer immink"
    },
    {
        ", as the code format had not yet been decided in December 1979. The adoption of ": null
    },
    {
        "EFM": "eight-to-fourteen modulation"
    },
    {
        " in June 1980 would have allowed a playing time of 97 minutes for 120  mm diameter or 74 minutes for a disc as small as 100  mm, but instead the information density was lowered by 30 percent to keep the playing time at 74 minutes.  Tim Buthe and Walter Mattli, The New Global Rulers: The Privatization of Regulation in the World Economy, Princeton University Press, Feb. 2011. The 120  mm diameter has been adopted by subsequent formats, including ": null
    },
    {
        "Super Audio CD": "super audio cd"
    },
    {
        ", ": null
    },
    {
        "DVD": "dvd"
    },
    {
        ", ": null
    },
    {
        "HD DVD": "hd dvd"
    },
    {
        ", and ": null
    },
    {
        "Blu-ray Disc": "blu-ray disc"
    },
    {
        ". The 80  mm diameter discs  can hold up to 24 minutes of music or 210  MiB.                      The logical format of an audio CD is described in a document produced in 1980 by the formats joint creators, Sony and Philips. The document is known colloquially as the Red Book ": null
    },
    {
        "CD-DA": "compact disc digital audio"
    },
    {
        " after the colour of its cover. The format is a two-channel 16-bit ": null
    },
    {
        "PCM": "pulse-code modulation"
    },
    {
        " encoding at a ": null
    },
    {
        "44.1  kHz": "44.1 khz"
    },
    {
        " sampling rate": "sampling rate"
    },
    {
        " per channel. ": null
    },
    {
        "Four-channel sound": "four-channel compact disc digital audio"
    },
    {
        " was to be an allowable option within the Red Book format, but has never been implemented. ": null
    },
    {
        "Monaural": "monaural"
    },
    {
        " audio has no existing standard on a Red Book CD; thus, mono source material is usually presented as two identical channels in a standard Red Book stereo track ; an ": null
    },
    {
        "MP3 CD": "mp3 cd"
    },
    {
        ", however, can have audio file formats with mono sound.     ": null
    },
    {
        "CD-Text": "cd-text"
    },
    {
        " is an extension of the Red Book specification for audio CD that allows for storage of additional text information on a standards-compliant audio CD. The information is stored either in the ": null
    },
    {
        "lead-in area": "lead-in"
    },
    {
        " of the CD, where there is roughly five kilobytes of space available, or in the ": null
    },
    {
        "subcode": "compact disc subcode"
    },
    {
        " channels R to W on the disc, which can store about 31 megabytes.     ": null
    },
    {
        "Compact Disc + Graphics": "compact disc + graphics"
    },
    {
        " is a special audio compact disc that contains graphics data in addition to the audio data on the disc. The disc can be played on a regular audio CD player, but when played on a special CD+G player, it can output a graphics signal ; these graphics are almost exclusively used to display lyrics on a television set for ": null
    },
    {
        "karaoke": "karaoke"
    },
    {
        " performers to sing along with. The CD+G format takes advantage of the channels R through W. These six bits store the graphics information.     ": null
    },
    {
        "CD + Extended Graphics": "cd + extended graphics"
    },
    {
        " is an improved variant of the ": null
    },
    {
        "Compact Disc + Graphics": "cd + graphics"
    },
    {
        " format. Like CD+G, CD+EG uses basic CD-ROM features to display text and video information in addition to the music being played. This extra data is stored in ": null
    },
    {
        "subcode": "compact disc subcode"
    },
    {
        " channels R-W. Very few, if any, CD+EG discs have been published.          Super Audio CD is a high-resolution read-only ": null
    },
    {
        "optical": "optical disc"
    },
    {
        " audio disc": "audio storage"
    },
    {
        " format that was designed to provide ": null
    },
    {
        "higher fidelity": "high fidelity"
    },
    {
        " digital audio reproduction than the Red Book. Introduced in 1999, it was developed by Sony and Philips, the same companies that created the Red Book. SACD was in a ": null
    },
    {
        "format war": "format war"
    },
    {
        " with ": null
    },
    {
        "DVD-Audio": "dvd-audio"
    },
    {
        ", but neither has replaced audio CDs. The SACD standard is referred to the Scarlet Book standard.     Titles in the SACD format can be issued as hybrid discs; these discs contain the SACD audio stream as well as a standard audio CD layer which is playable in standard CD players, thus making them ": null
    },
    {
        "backward compatible": "backward compatibility"
    },
    {
        ".       CD-": null
    },
    {
        "MIDI": "musical instrument digital interface"
    },
    {
        " is a format used to store music-performance data, which upon playback is performed by electronic instruments that synthesize the audio. Hence, unlike the original Red Book CD-DA, these recordings are not digitally sampled audio recordings. The CD-MIDI format is defined as an extension of the original Red Book.          For the first few years of its existence, the CD was a medium used purely for audio. However, in 1988, the Yellow Book ": null
    },
    {
        "CD-ROM": "cd-rom"
    },
    {
        " standard was established by Sony and Philips, which defined a non-volatile optical data ": null
    },
    {
        "computer data storage": "computer data storage"
    },
    {
        " medium using the same physical format as audio compact discs, readable by a computer with a CD-ROM drive.          Video CD is a standard ": null
    },
    {
        "digital": "digital data"
    },
    {
        " format for storing video media on a CD. VCDs are playable in dedicated VCD players, most modern ": null
    },
    {
        "DVD-Video": "dvd-video"
    },
    {
        " players, personal computers, and some video game consoles.     The VCD standard was created in 1993 by Sony, Philips, ": null
    },
    {
        "Matsushita": "panasonic corporation"
    },
    {
        ", and ": null
    },
    {
        "JVC": "jvc"
    },
    {
        " and is referred to as the White Book standard.     Overall picture quality is intended to be comparable to ": null
    },
    {
        "VHS": "vhs"
    },
    {
        " video. Poorly compressed VCD video can sometimes be lower quality than VHS video, but VCD exhibits block artifacts rather than analog noise and does not deteriorate further with each use.     352x240  resolution was chosen because it is half the vertical and half the horizontal resolution of NTSC video. 352x288 is similarly one quarter PAL/SECAM resolution. This approximates the resolution of an analog VHS tape, which, although it has double the number of scan lines, has a much lower horizontal resolution.          Super Video CD is a format used for storing video media on standard compact discs. SVCD was intended as a successor to VCD and an alternative to DVD-Video and falls somewhere between both in terms of technical capability and picture quality.     SVCD has two thirds the ": null
    },
    {
        "resolution": "display resolution"
    },
    {
        " of DVD, and over 2.7 times the resolution of VCD. One CD-R disc can hold up to 60 minutes of standard quality SVCD-format video. While no specific limit on SVCD video length is mandated by the specification, one must lower the video bit rate, and therefore quality, to accommodate very long videos. It is usually difficult to fit much more than 100 minutes of video onto one SVCD without incurring significant quality loss, and many hardware players are unable to play video with an instantaneous bit rate lower than 300 to 600 ": null
    },
    {
        "kilobits": "kilobits"
    },
    {
        " per second.          Photo CD is a system designed by ": null
    },
    {
        "Kodak": "kodak"
    },
    {
        " for digitizing and storing photos on a CD. Launched in 1992, the discs were designed to hold nearly 100 high-quality images, scanned prints and slides using special proprietary encoding. Photo CDs are defined in the Beige Book and conform to the ": null
    },
    {
        "CD-ROM XA": "cd-rom xa"
    },
    {
        " and CD-i Bridge specifications as well. They are intended to play on CD-i players, Photo CD players and any computer with suitable software . The images can also be printed out on photographic paper with a special Kodak machine. This format is not to be confused with Kodak ": null
    },
    {
        "Picture CD": "picture cd"
    },
    {
        ", which is a consumer product in CD-ROM format.          The Philips  Green Book  specifies a standard for interactive multimedia compact discs designed for ": null
    },
    {
        "CD-i": "philips cd-i"
    },
    {
        " players . CD-i discs can contain audio tracks which can be played on regular ": null
    },
    {
        "CD player": "cd player"
    },
    {
        "s, but CD-i discs are not compatible with most ": null
    },
    {
        "CD-ROM": "cd-rom"
    },
    {
        " drives and software. The ": null
    },
    {
        "CD-i Ready": "cd-i ready"
    },
    {
        " specification was later created to improve compatibility with audio CD players, and the ": null
    },
    {
        "CD-i Bridge": "cd-i bridge"
    },
    {
        " specification was added to create CD-i compatible discs that can be accessed by regular CD-ROM drives.          Philips defined a format similar to CD-i called ": null
    },
    {
        "CD-i Ready": "cd-i ready"
    },
    {
        ", which puts CD-i software and data into the ": null
    },
    {
        "pregap": "pregapcomputer data in pregap"
    },
    {
        " of track 1. This format was supposed to be more compatible with older audio CD players.          Enhanced Music CD, also known as CD Extra or CD Plus, is a format which combines ": null
    },
    {
        "audio tracks": "cd-da"
    },
    {
        " and ": null
    },
    {
        "data tracks": "cd-rom"
    },
    {
        " on the same disc by putting audio tracks in a first ": null
    },
    {
        "session": "session"
    },
    {
        " and data in a second session. It was developed by Philips and Sony, and it is defined in the  Blue Book .          VinylDisc is the hybrid of a standard audio CD and the ": null
    },
    {
        "vinyl record": "gramophone record"
    },
    {
        ". The vinyl layer on the discs label side can hold approximately three minutes of music.             In 1995, material costs were 30 cents for the jewel case and 10 to 15 cents for the CD. Wholesale cost of CDs was $0.75 to $1.15, while the typical retail price of a prerecorded music CD was $16.98.  On average, the store received 35 percent of the retail price, the record company 27 percent, the artist 16 percent, the manufacturer 13 percent, and the distributor 9 percent. When 8-track tapes, cassette tapes, and CDs were introduced, each was marketed at a higher price than the format they succeeded, even though the cost to produce the media was reduced. This was done because the apparent value increased. This continued from vinyl to CDs but was broken when ": null
    },
    {
        "Apple": "apple inc."
    },
    {
        " marketed MP3s for $0.99, and albums for $9.99. The incremental cost, though, to produce an MP3 is very small.                  Recordable Compact Discs, ": null
    },
    {
        "CD-R": "cd-r"
    },
    {
        "s, are injection-molded with a blank data spiral. A photosensitive dye is then applied, after which the discs are metalized and lacquer-coated. The write laser of the ": null
    },
    {
        "CD recorder": "cd recorder"
    },
    {
        " changes the colour of the dye to allow the read laser of a standard ": null
    },
    {
        "CD player": "cd player"
    },
    {
        " to see the data, just as it would with a standard stamped disc. The resulting discs can be read by most CD-ROM drives and played in most audio CD players. CD-Rs follow the Orange Book standard.     CD-R recordings are designed to be permanent. Over time, the dyes physical characteristics may change causing read errors and data loss until the reading device cannot recover with error correction methods. The design life is from 20 to 100 years, depending on the quality of the discs, the quality of the writing drive, and storage conditions. However, testing has demonstrated such degradation of some discs in as little as 18 months under normal storage conditions. This failure is known as ": null
    },
    {
        "disc rot": "disc rot"
    },
    {
        ", for which there are several, mostly environmental, reasons.      The recordable audio CD is designed to be used in a consumer audio CD recorder. These consumer audio CD recorders use SCMS , an early form of ": null
    },
    {
        "digital rights management": "digital rights management"
    },
    {
        " , to conform to the AHRA . The Recordable Audio CD is typically somewhat more expensive than CD-R due to lower production volume and a 3 percent ": null
    },
    {
        "AHRA royalty": "audio home recording actahra royalties"
    },
    {
        " used to compensate the music industry for the making of a copy.     High-capacity recordable CD is a higher-density recording format that can hold 20% more data than of conventional discs.  The higher capacity is incompatible with some recorders and recording software.           ": null
    },
    {
        "CD-RW": "cd-rw"
    },
    {
        " is a re-recordable medium that uses a metallic alloy instead of a dye. The write laser in this case is used to heat and alter the properties of the alloy, and hence change its reflectivity. A CD-RW does not have as great a difference in reflectivity as a pressed CD or a CD-R, and so many earlier CD audio players cannot read CD-RW discs, although most later CD audio players and stand-alone ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " players can. CD-RWs follow the Orange Book standard.     The ReWritable Audio CD is designed to be used in a consumer audio CD recorder, which will not accept standard CD-RW discs. These consumer audio CD recorders use the ": null
    },
    {
        "Serial Copy Management System": "serial copy management system"
    },
    {
        " , an early form of ": null
    },
    {
        "digital rights management": "digital rights management"
    },
    {
        " , to conform to the United States ": null
    },
    {
        "Audio Home Recording Act": "audio home recording act"
    },
    {
        " . The ReWritable Audio CD is typically somewhat more expensive than CD-RW due to lower volume and a 3 percent ": null
    },
    {
        "AHRA royalty": "audio home recording actahra royalties"
    },
    {
        " used to compensate the music industry for the making of a copy.          The Red Book audio specification, except for a simple anti-copy statement in the subcode, does not include any ": null
    },
    {
        "copy protection": "copy protection"
    },
    {
        " mechanism. Known at least as early as 2001, attempts were made by record companies to market copy-protected non-standard compact discs, which cannot be ": null
    },
    {
        "ripped": "ripping"
    },
    {
        ", or copied, to hard drives or easily converted to other formats . One major drawback to these copy-protected discs is that most will not play on either computer CD-ROM drives or some standalone CD players that use CD-ROM mechanisms. Philips has stated that such discs are not permitted to bear the trademarked Compact Disc Digital Audio logo because they violate the Red Book specifications. Numerous copy-protection systems have been countered by readily available, often free, software, or even by simply turning off automatic ": null
    },
    {
        "AutoPlay": "autoplay"
    },
    {
        " to prevent the running of the DRM ": null
    },
    {
        "executable": "executable"
    }
]