[
    {
        "   In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", a complete measure  is a ": null
    },
    {
        "measure space": "measure"
    },
    {
        " in which every ": null
    },
    {
        "subset": "subset"
    },
    {
        " of every ": null
    },
    {
        "null set": "null set"
    },
    {
        " is measurable . More formally, a measure space  is complete if and only if     : S \\subseteq N \\in \\Sigma \\mbox \\mu 42\\ \\Rightarrow\\ S \\in \\Sigma.       The need to consider questions of completeness can be illustrated by considering the problem of product spaces.     Suppose that we have already constructed ": null
    },
    {
        "Lebesgue measure": "lebesgue measure"
    },
    {
        " on the ": null
    },
    {
        "real line": "real line"
    },
    {
        ": denote this measure space by . We now wish to construct some two-dimensional Lebesgue measure λ 42 on the plane R 42 as a ": null
    },
    {
        "product measure": "product measure"
    },
    {
        ". Naïvely, we would take the ": null
    },
    {
        " & sigma;-algebra": "sigma algebra"
    },
    {
        " on R 42 to be B  ⊗  B, the smallest σ-algebra containing all measurable rectangles A 42   & times;  A 42 for A i  ∈  B.     While this approach does define a ": null
    },
    {
        "measure space": "measure space"
    },
    {
        ", it has a flaw. Since every ": null
    },
    {
        "singleton": "singleton"
    },
    {
        " set has one-dimensional Lebesgue measure zero,     : \\lambda^ \\lambda \\cdot \\lambda 42     for any subset A of R. However, suppose that A is a ": null
    },
    {
        "non-measurable subset": "non-measurable set"
    },
    {
        " of the real line, such as the ": null
    },
    {
        "Vitali set": "vitali set"
    },
    {
        ". Then the λ 42 -measure of   & times;  A is not defined, but     : \\ \\times A \\subseteq \\ \\times \\mathbb,     and this larger set does have λ 42 -measure zero. So, this two-dimensional Lebesgue measure as just defined is not complete, and some kind of completion procedure is required.       Given a measure space , there is an extension  of this measure space that is complete. The smallest such extension  is called the completion of the measure space.     The completion can be constructed as follows:   let Z be the set of all the subsets of the zero-μ-measure subsets of X ;   let Σ 42 be the σ-algebra generated by Σ and Z ;   μ has an extension to Σ 42 , called the ": null
    },
    {
        "outer measure": "outer measure"
    },
    {
        " of μ, given by the ": null
    },
    {
        "infimum": "infimum"
    },
    {
        "     :: \\mu_ : \\inf \\.     Then  is a complete measure space, and is the completion of .     In the above construction it can be shown that every member of Σ 42 is of the form A  ∪  B for some A  ∈  Σ and some B  ∈  Z, and     : \\mu_ \\mu .       ": null
    },
    {
        "Borel measure": "borel measure"
    },
    {
        " as defined on the Borel σ-algebra generated by the ": null
    },
    {
        "open": "open set"
    },
    {
        " intervals": "interval"
    },
    {
        " of the real line is not complete, and so the above completion procedure must be used to define the complete Lebesgue measure. This is illustrated by the fact that the set of all Borel sets over the reals has the same cardinality as the reals. While the ": null
    },
    {
        "Cantor set": "cantor set"
    },
    {
        " is a Borel set, has measure zero, and its power set has cardinality strictly greater than that of the reals. Thus there is a subset of the Cantor set that is not contained in the Borel sets. Hence, the Borel measure is not complete.   n-dimensional Lebesgue measure is the completion of the n-fold product of the one-dimensional Lebesgue space with itself. It is also the completion of the Borel measure, as in the one-dimensional case.       ": null
    },
    {
        "Maharams theorem": "maharams theorem"
    },
    {
        " states that every complete measure space is decomposable into a measure on the ": null
    },
    {
        "continuum": "continuum"
    },
    {
        ", and a finite or countable ": null
    },
    {
        "counting measure": "counting measure"
    }
]