[
    {
        "In ": null
    },
    {
        "mathematical analysis": "mathematical analysis"
    },
    {
        ", a ": null
    },
    {
        "metric space": "metric space"
    },
    {
        " M is called complete  if every ": null
    },
    {
        "Cauchy sequence": "cauchy sequencein a metric space"
    },
    {
        " of points in M has a ": null
    },
    {
        "limit": "limit of a sequence"
    },
    {
        " that is also in M or, alternatively, if every Cauchy sequence in M converges in M.     Intuitively, a space is complete if there are no points missing from it . For instance, the set of ": null
    },
    {
        "rational numbers": "rational number"
    },
    {
        "is not complete, because e.g. ": null
    },
    {
        " \\sqrt ": "square root of 2"
    },
    {
        " is missing from it, even though one can construct a Cauchy sequence of rational numbers that converges to it. It is always possible to fill all the holes , leading to the completion of a given space, as explained below.       The space Q of ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "s, with the standard metric given by the ": null
    },
    {
        "absolute value": "absolute value"
    },
    {
        " of the ": null
    },
    {
        "difference": "subtraction"
    },
    {
        ", is not complete. Consider for instance the sequence defined by x_1 \\;\\; 1 and x_ \\;\\; \\frac \\,+\\, \\frac . This is a Cauchy sequence of rational numbers, but it does not converge towards any rational limit: If the sequence did have a limit x, then by solving x \\;\\; \\frac \\,+\\, \\frac necessarily x 2    2, yet no rational number has this property. However, considered as a sequence of ": null
    },
    {
        "real number": "real number"
    },
    {
        "s, it does converge to the ": null
    },
    {
        "irrational number": "irrational number"
    },
    {
        " \\sqrt .     The ": null
    },
    {
        "open interval": "interval"
    },
    {
        " , again with the absolute value metric, is not complete either. The sequence defined by x n  is Cauchy, but does not have a limit in the given space. However the ": null
    },
    {
        "closed": "closed set"
    },
    {
        " interval  is complete; for example the given sequence does have a limit in this interval and the limit is zero.     The space R of real numbers and the space C of ": null
    },
    {
        "complex numbers": "complex number"
    },
    {
        " are complete, and so is ": null
    },
    {
        "Euclidean space": "euclidean space"
    },
    {
        " R n , with the ": null
    },
    {
        "usual distance": "euclidean distance"
    },
    {
        " metric. In contrast, infinite-dimensional ": null
    },
    {
        "normed vector spaces": "normed vector space"
    },
    {
        "may or may not be complete; those that are complete are ": null
    },
    {
        "Banach space": "banach space"
    },
    {
        "s. The space C of ": null
    },
    {
        "continuous real-valued functions on a closed and bounded interval": "continuous functions on a compact hausdorff space"
    },
    {
        " is a Banach space, and so a complete metric space, with respect to the ": null
    },
    {
        "supremum norm": "supremum norm"
    },
    {
        ". However, the supremum norm does not give a norm on the space C of continuous functions on , for it may contain unbounded functions. Instead, with the topology of ": null
    },
    {
        "compact convergence": "compact convergence"
    },
    {
        ", C can be given the structure of a ": null
    },
    {
        "Fréchet space": "fréchet space"
    },
    {
        ": a ": null
    },
    {
        "locally convex topological vector space": "locally convex topological vector space"
    },
    {
        " whose topology can be induced by a complete translation-invariant metric.     The space Q p of ": null
    },
    {
        "p-adic numbers": "p-adic number"
    },
    {
        " is complete for any ": null
    },
    {
        "prime number": "prime number"
    },
    {
        " p. This space completes Q with the p-adic metric in the same way that R completes Q with the usual metric.     If S is an arbitrary set, then the set S N of all ": null
    },
    {
        "sequences": "sequence"
    },
    {
        "in S becomes a complete metric space if we define the distance between the sequences  and  to be , where N is the smallest index for which x N is ": null
    },
    {
        "distinct": "distinct"
    },
    {
        " from y N , or 0 if there is no such index. This space is ": null
    },
    {
        "homeomorphic": "homeomorphic"
    },
    {
        " to the ": null
    },
    {
        "product": "product topology"
    },
    {
        " of a ": null
    },
    {
        "countable": "countable"
    },
    {
        " number of copies of the ": null
    },
    {
        "discrete space": "discrete space"
    },
    {
        " S.       A metric space X is complete if and only if every decreasing sequence of non-empty closed subsets of X, with ": null
    },
    {
        "diameters": "diametergeneralizations"
    },
    {
        " tending to  0, has a non-empty intersection: if F n is closed and non-empty,  for every n, and , then there is a point  common to all sets  F n .     Every ": null
    },
    {
        "compact": "compact space"
    },
    {
        " metric space is complete, though complete spaces need not be compact. In fact, a metric space is compact ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        " it is complete and ": null
    },
    {
        "totally bounded": "totally bounded"
    },
    {
        ". This is a generalization of the ": null
    },
    {
        "Heine–Borel theorem": "heine–borel theorem"
    },
    {
        ", which states that any closed and bounded subspace S of R n is compact and therefore complete.      Let  be a complete metric space. If  is a closed set, then A is also complete.  Let  be a metric space. If  is a complete subspace, then A is also closed.      If X is a ": null
    },
    {
        "set": "set"
    },
    {
        " and M is a complete metric space, then the set  of all ": null
    },
    {
        "bounded functions": "bounded function"
    },
    {
        " f from X to M is a complete metric space. Here we define the distance in  in terms of the distance in M with the ": null
    },
    {
        "supremum norm": "supremum norm"
    },
    {
        "     : d \\equiv \\sup\\left\\     If X is a ": null
    },
    {
        "topological space": "topological space"
    },
    {
        " and M is a complete metric space, then the set C b  consisting of all ": null
    },
    {
        "continuous": "continuous function"
    },
    {
        " bounded functions f from X to M is a closed subspace of  and hence also complete.     The ": null
    },
    {
        "Baire category theorem": "baire category theorem"
    },
    {
        " says that every complete metric space is a ": null
    },
    {
        "Baire space": "baire space"
    },
    {
        ". That is, the ": null
    },
    {
        "union": "union"
    },
    {
        " of ": null
    },
    {
        "countably many": "countable"
    },
    {
        " nowhere dense": "nowhere dense"
    },
    {
        " subsets of the space has ": null
    },
    {
        "empty": "empty set"
    },
    {
        " interior": "interior"
    },
    {
        ".     The ": null
    },
    {
        "Banach fixed point theorem": "banach fixed point theorem"
    },
    {
        " states that a contraction mapping on a complete metric space admits a fixed point. The fixed point theorem is often used to prove the ": null
    },
    {
        "inverse function theorem": "inverse function theorem"
    },
    {
        " on complete metric spaces such as Banach spaces.     The ": null
    },
    {
        "expansion constant": "expansion constant"
    },
    {
        " of a metric space is the ": null
    },
    {
        "infimum": "infimum"
    },
    {
        " of all constants \\textstyle \\mu such that whenever the family \\textstyle \\left\\ intersects pairwise, the intersection   : \\bigcap_\\alpha \\overline     is nonempty. A metric space is complete if and only if its expansion constant is ≤  2.        For any metric space M, one can construct a complete metric space M′ , which contains M as a ": null
    },
    {
        "dense subspace": "dense subspace"
    },
    {
        ". It has the following ": null
    },
    {
        "universal property": "universal property"
    },
    {
        ": if N is any complete metric space and f is any ": null
    },
    {
        "uniformly continuous function": "uniformly continuous function"
    },
    {
        " from M to N, then there exists a ": null
    },
    {
        "unique": "unique"
    },
    {
        " uniformly continuous function f′ from M′ to N that extends f. The space M is determined up to isometry by this property , and is called the completion of M.     The completion of M can be constructed as a set of equivalence class es of Cauchy sequences in M. For any two Cauchy sequences x     and y     in M, we may define their distance as   : d \\lim_n d\\left     This is only a pseudometric , not yet a metric, since two different Cauchy sequences may have the distance 0. But having distance 0 is an equivalence relation on the set of all Cauchy sequences, and the set of equivalence classes is a metric space, the completion of M. The original space is embedded in this space via the identification of an element x of M with the equivalence class of sequences in M converging to x . This defines an isometry onto a dense subspace, as required. Notice, however, that this construction makes explicit use of the completeness of the real numbers, so completion of the rational numbers needs a slightly different treatment.     Cantor s construction of the real numbers is similar to the above construction; the real numbers are the completion of the rational numbers using the ordinary absolute value to measure distances. The additional subtlety to contend with is that it is not logically permissible to use the completeness of the real numbers in their own construction. Nevertheless, equivalence classes of Cauchy sequences are defined as above, and the set of equivalence classes is easily shown to be a field that has the rational numbers as a subfield. This field is complete, admits a natural total ordering , and is the unique totally ordered complete field . It is defined as the field of real numbers . One way to visualize this identification with the real numbers as usually viewed is that the equivalence class consisting of those Cauchy sequences of rational numbers that ought to have a given real limit is identified with that real number. The truncations of the decimal expansion give just one choice of Cauchy sequence in the relevant equivalence class.     For a prime p, the p-adic numbers arise by completing the rational numbers with respect to a different metric.     If the earlier completion procedure is applied to a normed vector space , the result is a Banach space containing the original space as a dense subspace, and if it is applied to an inner product space , the result is a Hilbert space containing the original space as a dense subspace.       Note that completeness is a property of the metric and not of the ": null
    },
    {
        "topology": "topology"
    },
    {
        ", meaning that a complete metric space can be homeomorphic to a non-complete one. An example is given by the real numbers, which are complete but homeomorphic to the open interval , which is not complete.     In topology one considers ": null
    },
    {
        "completely metrizable spaces": "completely metrizable space"
    },
    {
        " , spaces for which there exists at least one complete metric inducing the given topology. Completely metrizable spaces can be characterized as those spaces that can be written as an intersection of countably many open subsets of some complete metric space. Since the conclusion of the Baire category theorem is purely topological, it applies to these spaces as well.     Completely metrizable spaces are often called topologically complete. However, the latter term is somewhat arbitrary since metric is not the most general structure on a topological space for which one can talk about completeness . Indeed, some authors use the term topologically complete for a wider class of topological spaces, the completely uniformizable space s. Kelley, Problem 6.L, p. 208     A topological space homeomorphic to a separable complete metric space is called a Polish space .       Since Cauchy sequence s can also be defined in general topological group s, an alternative to relying on a metric structure for defining completeness and constructing the completion of a space is to use a group structure. This is most often seen in the context of topological vector space s, but requires only the existence of a continuous subtraction operation. In this setting, the distance between two points x and y is gauged not by a real number ε via the metric d in the comparison d   & lt;  ε, but by an open neighbourhood N of 0 via subtraction in the comparison x  −  y  ∈  N.     A common generalisation of these definitions can be found in the context of a uniform space , where an entourage is a set of all pairs of points that are at no more than a particular distance from each other.     It is also possible to replace Cauchy sequences in the definition of completeness by Cauchy ": null
    },
    {
        "nets": "net"
    },
    {
        " or Cauchy filters . If every Cauchy net has a limit in X, then X": null
    }
]