[
    {
        "        Compost  is ": null
    },
    {
        "organic matter": "organic matter"
    },
    {
        " that has been ": null
    },
    {
        "decomposed": "biodegradation"
    },
    {
        " in a process called composting. This process ": null
    },
    {
        "recycles": "recycling"
    },
    {
        " various organic materials otherwise regarded as waste products and produces a ": null
    },
    {
        "soil conditioner": "soil conditioner"
    },
    {
        " .     Compost is rich in nutrients. It is used, for example, in ": null
    },
    {
        "garden": "garden"
    },
    {
        "s, ": null
    },
    {
        "landscaping": "landscaping"
    },
    {
        ", ": null
    },
    {
        "horticulture": "horticulture"
    },
    {
        ", ": null
    },
    {
        "urban agriculture": "urban agriculture"
    },
    {
        " and ": null
    },
    {
        "organic farming": "organic farming"
    },
    {
        ". The compost itself is beneficial for the land in many ways, including as a soil conditioner, a ": null
    },
    {
        "fertilizer": "fertilizer"
    },
    {
        ", addition of vital ": null
    },
    {
        "humus": "humus"
    },
    {
        " or ": null
    },
    {
        "humic acids": "humic acids"
    },
    {
        ", and as a natural ": null
    },
    {
        "pesticide": "pesticide"
    },
    {
        " for soil. In ": null
    },
    {
        "ecosystems": "ecosystems"
    },
    {
        ", compost is useful for erosion control, land and stream reclamation, wetland construction, and as landfill cover .     At the simplest level, the process of composting requires making a heap of wet organic matter , such as leaves, grass, and food scraps, and waiting for the materials to break down into ": null
    },
    {
        "humus": "humus"
    },
    {
        " after a period of months. However, composting also can take place as a multi-step, closely monitored process with measured inputs of water, air, and carbon- and nitrogen-rich materials. The ": null
    },
    {
        "decomposition": "decomposition"
    },
    {
        " process is aided by shredding the plant matter, adding water and ensuring proper aeration by regularly turning the mixture when open piles or windrows are used. ": null
    },
    {
        "fungi": "fungus"
    },
    {
        ", ": null
    },
    {
        "earthworms": "earthworm"
    },
    {
        "and other ": null
    },
    {
        "detritivores": "detritivore"
    },
    {
        "further break up the material. Bacteria requiring oxygen to function  and fungi manage the chemical process by converting the inputs into heat, ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        ", and ": null
    },
    {
        "ammonium": "ammonium"
    },
    {
        ".                     Composting is an aerobic method of decomposing organic solid wastes.  It can therefore be used to recycle organic material. The process involves decomposition of organic material into a ": null
    },
    {
        "humus": "humus"
    },
    {
        "-like material, known as compost, which is a good ": null
    },
    {
        "fertilizer": "fertilizer"
    },
    {
        " for plants. Composting requires the following three components: human management, aerobic conditions, development of internal biological heat.     Composting organisms require four equally important ingredients to work effectively:   Carbon — for energy; the microbial ": null
    },
    {
        "oxidation": "oxidation"
    },
    {
        " of carbon produces the heat, if included at suggested levels.  High carbon materials tend to be brown and dry.   Nitrogen — to grow and reproduce more organisms to oxidize the carbon. High nitrogen materials tend to be green and wet.   Oxygen — for oxidizing the carbon, the decomposition process.   Water — in the right amounts to maintain activity without causing anaerobic conditions.      Certain ratios of these materials will provide microorganisms to work at a rate that will heat up the pile. Active management of the pile is needed to maintain sufficient supply of oxygen and the right moisture level. The air/water balance is critical to maintaining high temperatures  until the materials are broken down.      The most efficient composting occurs with an optimal carbon:nitrogen ratio of about 25:1.  ": null
    },
    {
        "Hot container composting": "hot container composting"
    },
    {
        " focuses on retaining the heat to increase decomposition rate and produce compost more quickly. Rapid composting is favored by having a C/N ratio of ~30 or less. Above 30 the substrate is nitrogen starved, below 15 it is likely to outgas a portion of nitrogen as ammonia.      Nearly all plant and animal materials have both carbon and nitrogen, but amounts vary widely, with characteristics noted above .   Fresh grass clippings have an average ratio of about 15:1 and dry autumn leaves about 50:1 depending on species. Mixing equal parts by volume approximates the ideal C:N range. Few individual situations will provide the ideal mix of materials at any point. Observation of amounts, and consideration of different materials as a pile is built over time, can quickly achieve a workable technique for the individual situation.       With the proper mixture of water, oxygen, carbon, and nitrogen, micro-organisms are able to break down organic matter to produce compost.   The composting process is dependent on micro-organisms to break down organic matter into compost. There are many types of microorganisms found in active compost of which the most common are:    ": null
    },
    {
        "Bacteria": "bacteria"
    },
    {
        "- The most numerous of all the ": null
    },
    {
        "microorganisms": "microorganism"
    },
    {
        "found in compost. Depending on the phase of composting, ": null
    },
    {
        "mesophilic": "mesophile"
    },
    {
        " or ": null
    },
    {
        "thermophilic": "thermophile"
    },
    {
        " bacteria may predominate.   ": null
    },
    {
        "Actinobacteria": "actinobacteria"
    },
    {
        "- Necessary for breaking down paper products such as newspaper, ": null
    },
    {
        "bark": "bark"
    },
    {
        ", etc.   ": null
    },
    {
        "Fungi": "fungi"
    },
    {
        "- ": null
    },
    {
        "molds": "molds"
    },
    {
        " and ": null
    },
    {
        "yeast": "yeast"
    },
    {
        " help break down materials that bacteria cannot, especially ": null
    },
    {
        "lignin": "lignin"
    },
    {
        " in woody material.   ": null
    },
    {
        "Protozoa": "protozoa"
    },
    {
        "- Help consume bacteria, fungi and micro organic particulates.   ": null
    },
    {
        "Rotifers": "rotifers"
    },
    {
        "- Rotifers help control populations of bacteria and small protozoans.     In addition, ": null
    },
    {
        "earthworms": "earthworm"
    },
    {
        "not only ingest partly composted material, but also continually re-create aeration and drainage tunnels as they move through the compost.          Under ideal conditions, composting proceeds through three major phases:   An initial, mesophilic phase, in which the decomposition is carried out under moderate temperatures by mesophilic microorganisms.   As the temperature rises, a second, thermophilic phase starts, in which the decomposition is carried out by various thermophilic bacteria under high temperatures.   As the supply of high-energy compounds dwindles, the temperature starts to decrease, and the mesophiles once again predominate in the maturation phase.          There are many proponents of rapid composting that attempt to correct some of the perceived problems associated with traditional, slow composting. Many advocate that compost can be made in 2 to 3 weeks.  Many such short processes involve a few changes to traditional methods, including smaller, more homogenized pieces in the compost, controlling carbon-to-nitrogen ratio at 30 to 1 or less, and monitoring the moisture level more carefully. However, none of these parameters differ significantly from the early writings of compost researchers, suggesting that in fact modern composting has not made significant advances over the traditional methods that take a few months to work. For this reason and others, many scientists who deal with carbon transformations are sceptical that there is a super-charged way to get nature to make compost rapidly.      Both sides may be right to some extent. The bacterial activity in rapid high heat methods breaks down the material to the extent that pathogens and seeds are destroyed, and the original feedstock is unrecognizable. At this stage, the compost can be used to prepare fields or other planting areas. However, most professionals recommend that the compost be given time to cure before using in a nursery for starting seeds or growing young plants. The curing time allows fungi to continue the decomposition process and eliminating ": null
    },
    {
        "phytotoxic": "phytotoxic"
    },
    {
        " substances.     An alternative approach is anaerobic fermentation, known as ": null
    },
    {
        "bokashi": "bokashi"
    },
    {
        ". It retains carbon bonds, is faster than decomposition, and for application to soil requires only rapid but thorough aeration rather than curing. It depends on sufficient carbohydrates in the treated material.          Composting can destroy ": null
    },
    {
        "pathogens": "pathogen"
    },
    {
        "or unwanted ": null
    },
    {
        "seed": "seed"
    },
    {
        "s. Unwanted living plants  can be discouraged by ": null
    },
    {
        "covering with mulch/compost": "mulchmulching  over unwanted plants"
    },
    {
        ". The ": null
    },
    {
        "microbial pesticides": "biopesticide"
    },
    {
        " in compost may include ": null
    },
    {
        "thermophiles": "thermophile"
    },
    {
        "and ": null
    },
    {
        "mesophile": "mesophile"
    },
    {
        "s.     Thermophilic composting is well known to destroy many seeds and nearly all types of pathogens . The ": null
    },
    {
        "sanitizing": "disinfection"
    },
    {
        " qualities of  composting are desirable where there is a high likelihood of pathogens, such as with ": null
    },
    {
        "manure": "manure"
    },
    {
        ".       Composting is a process used for ": null
    },
    {
        "resource recovery": "resource recovery"
    },
    {
        ". It can ": null
    },
    {
        "recycle": "recycle"
    },
    {
        " an unwanted by-product from another process  into a useful new product.            Composting is a process for converting decomposable organic materials into useful stable products. Therefore, valuable ": null
    },
    {
        "landfill": "landfill"
    },
    {
        " space can be used for other wastes by composting these materials rather than dumping them on landfills. It may however be difficult to control inert and plastics contamination from ": null
    },
    {
        "municipal solid waste": "municipal solid waste"
    },
    {
        ".     Co-composting is a technique that processes organic solid waste together with other input materials such as dewatered ": null
    },
    {
        "fecal sludge": "fecal sludge"
    },
    {
        " or ": null
    },
    {
        "sewage sludge": "sewage sludge"
    },
    {
        ".     Industrial composting systems are being installed to treat organic solid waste and recycle it rather than landfilling it. It is one example of an ": null
    },
    {
        "advanced waste processing system": "advanced waste processing systems"
    },
    {
        ". Mechanical sorting of mixed waste streams combined with ": null
    },
    {
        "anaerobic": "anaerobic respiration"
    },
    {
        " digestion or in-vessel composting is called ": null
    },
    {
        "mechanical biological treatment": "mechanical biological treatment"
    },
    {
        ". It is increasingly being used in developed countries due to regulations controlling the amount of organic matter allowed in landfills. Treating ": null
    },
    {
        "biodegradable waste": "biodegradable waste"
    },
    {
        " before it enters a landfill reduces ": null
    },
    {
        "global warming": "global warming"
    },
    {
        " from fugitive ": null
    },
    {
        "methane": "methane"
    },
    {
        "; untreated waste breaks down anaerobically in a landfill, producing ": null
    },
    {
        "landfill gas": "landfill gas"
    },
    {
        " that contains ": null
    },
    {
        "methane": "atmospheric methane"
    },
    {
        ", a potent ": null
    },
    {
        "greenhouse gas": "greenhouse gas"
    },
    {
        ".       On many farms, the basic composting ingredients are animal ": null
    },
    {
        "manure": "manure"
    },
    {
        " generated on the farm and bedding. Straw and sawdust are common bedding materials. Non-traditional bedding materials are also used, including newspaper and chopped cardboard. The amount of manure composted on a livestock farm is often determined by cleaning schedules, land availability, and weather conditions. Each type of manure has its own physical, chemical, and biological characteristics. Cattle and horse manures, when mixed with bedding, possess good qualities for composting. Swine manure, which is very wet and usually not mixed with bedding material, must be mixed with straw or similar raw materials. Poultry manure also must be blended with carbonaceous materials - those low in nitrogen preferred, such as sawdust or straw. Dougherty, Mark. . Field Guide to On-Farm Composting. Ithaca, New York: Natural Resource, Agriculture, and Engineering Service.          ": null
    },
    {
        "Human waste": "human waste"
    },
    {
        " can be added as an input to the composting process since human excreta is a nitrogen-rich organic material. It can be either composted directly, as in ": null
    },
    {
        "composting toilets": "composting toilets"
    },
    {
        ", or indirectly , after it has undergone treatment in a ": null
    },
    {
        "sewage treatment plant": "sewage treatment"
    },
    {
        ". Faeces contain a wide range of microorganisms including bacteria, viruses and parasitic worms and its use in home composting can pose significant health risks.      ": null
    },
    {
        "Urine": "urine"
    },
    {
        " can be put on compost piles or directly used as fertilizer.  Adding urine to compost can increase temperatures and therefore increase its ability to destroy pathogens and unwanted seeds. Unlike feces, urine does not attract disease-spreading flies , and it does not contain the most hardy of pathogens, such as ": null
    },
    {
        "parasitic worm": "parasitic worm"
    },
    {
        " eggs. Urine usually does not smell for long, particularly when it is fresh, diluted, or put on ": null
    },
    {
        "sorbent": "sorbent"
    },
    {
        "s.           Compost can be used as an additive to soil, or other matrices such as ": null
    },
    {
        "coir": "coir"
    },
    {
        " and ": null
    },
    {
        "peat": "peat"
    },
    {
        ", as a ": null
    },
    {
        "tilth": "tilth"
    },
    {
        " improver, supplying humus and nutrients. It provides a rich growing medium, or a porous, absorbent material that holds moisture and soluble minerals, providing the support and ": null
    },
    {
        "nutrients": "nutrient"
    },
    {
        "in which plants can flourish, although it is rarely used alone, being primarily mixed with ": null
    },
    {
        "soil": "soil"
    },
    {
        ", ": null
    },
    {
        "sand": "sand"
    },
    {
        ", grit, bark chips, ": null
    },
    {
        "vermiculite": "vermiculite"
    },
    {
        ", ": null
    },
    {
        "perlite": "perlite"
    },
    {
        ", or ": null
    },
    {
        "clay": "clay"
    },
    {
        " granules to produce ": null
    },
    {
        "loam": "loam"
    },
    {
        ". Compost can be tilled directly into the soil or growing medium to boost the level of organic matter and the overall fertility of the soil. Compost that is ready to be used as an additive is dark brown or even black with an earthy smell.      Generally, direct seeding into a compost is not recommended due to the speed with which it may dry and the possible presence of ": null
    },
    {
        "phytotoxins": "phytotoxin"
    },
    {
        "in immature compost that may inhibit germination,  Itävaara et al. Compost maturity - problems associated with testing. in Proceedings of Composting. Innsbruck Austria 18-21.10.2000  and the possible tie up of nitrogen by incompletely decomposed lignin.  It is very common to see blends of 20–30% compost used for transplanting ": null
    },
    {
        "seedlings": "seedlings"
    },
    {
        " at ": null
    },
    {
        "cotyledon": "cotyledon"
    },
    {
        " stage or later.     Compost can be used to increase plant immunity to diseases and pests.        Various approaches have been developed to handle different ingredients, locations, throughput and applications for the composted product.       Industrial-scale composting can be carried out in the form of ": null
    },
    {
        "in-vessel composting": "in-vessel composting"
    },
    {
        ", ": null
    },
    {
        "aerated static pile composting": "aerated static pile composting"
    },
    {
        ", ": null
    },
    {
        "vermicomposting": "vermicomposting"
    },
    {
        ", or ": null
    },
    {
        "windrow composting": "windrow composting"
    },
    {
        ".     Vermicomposting       ": null
    },
    {
        "Vermicompost": "vermicompost"
    },
    {
        " is the product or process of organic material degradation using various species of worms, usually ": null
    },
    {
        "red wigglers": "eisenia fetida"
    },
    {
        ", ": null
    },
    {
        "white worms": "enchytraeus buchholzi"
    },
    {
        ", and ": null
    },
    {
        "earthworm": "earthworm"
    },
    {
        "s, to create a heterogeneous mixture of decomposing vegetable or food waste , bedding materials, and vermicast. Vermicast, also known as ": null
    },
    {
        "worm castings": "worm castings"
    },
    {
        ", worm humus or worm manure, is the end-product of the breakdown of organic matter by ": null
    },
    {
        "species": "species"
    },
    {
        " of earthworm.      Vermicomposting can also be applied for ": null
    },
    {
        "treatment of sewage sludge": "sewage sludge treatment"
    },
    {
        ".               A ": null
    },
    {
        "composting toilet": "composting toilet"
    },
    {
        " collects human excreta. These are added to a compost heap that can be located in a chamber below the toilet seat. ": null
    },
    {
        "Sawdust": "sawdust"
    },
    {
        " and straw or other carbon rich materials are usually added as well. Some ": null
    },
    {
        "composting toilets": "compost toilet"
    },
    {
        "do not require water or electricity; others may. If they do not use water for flushing they fall into the category of ": null
    },
    {
        "dry toilets": "dry toilets"
    },
    {
        ". Some composting toilet designs use ": null
    },
    {
        "urine diversion": "urine diversion"
    },
    {
        ", others do not. When properly managed, they do not smell. The composting process in these toilets destroys pathogens to some extent. The amount of pathogen destruction depends on the temperature and composting time. Stenström, T.A., Seidu, R., Ekane, N., Zurbrügg, C. .  - EcoSanRes Series, 2011-1. Stockholm Environment Institute , Stockholm, Sweden, page 88     Composting toilets with a large composting container  are popular in United States, Canada, Australia, New Zealand and Sweden. They are available as commercial products, as designs for self builders or as design derivatives which are marketed under various names.          ": null
    },
    {
        "Black soldier fly": "hermetia illucens"
    },
    {
        "  larvae are able to rapidly consume large amounts of organic material when kept at around 30  °C.   Black soldier fly larvae can reduce the dry matter of the organic waste by 73% and convert 16–22% of the dry matter in the waste to biomass.   The resulting compost still contains nutrients and can be used for ": null
    },
    {
        "biogas": "biogas"
    },
    {
        " production, or further traditional composting or ": null
    },
    {
        "vermicompost": "vermicompost"
    },
    {
        "ing  The larvae are rich in fat and protein, and can be used as, for example, animal feed or ": null
    },
    {
        "biodiesel": "biodiesel"
    },
    {
        " production.  Enthusiasts have experimented with a large number of different waste products.      Bokashi      Bokashi is not composting as defined earlier, rather an alternative technology. It ": null
    },
    {
        "ferments": "homolactic fermentation"
    },
    {
        " the input organic matter and feeds the result to the ": null
    },
    {
        "soil food web": "soil food web"
    },
    {
        " . The process involves adding ": null
    },
    {
        "Lactobacilli": "lactobacillus"
    },
    {
        " to the input in an airtight container kept at normal room temperature. These bacteria ferment ": null
    },
    {
        "carbohydrates": "carbohydrate"
    },
    {
        "to ": null
    },
    {
        "lactic acid": "lactic acid"
    },
    {
        ", which preserves the input. After this is complete the preserve is mixed into soil, converting the lactic acid to ": null
    },
    {
        "pyruvate": "pyruvate"
    },
    {
        ", which enables soil life to consume the result.     Bokashi is typically applied to ": null
    },
    {
        "food waste": "food waste"
    },
    {
        " from households, workplaces and catering establishments, because such waste normally holds a good proportion of carbohydrates; it is also applied to other organic waste by supplementing carbohydrates. Household containers typically give a batch size of , accumulated over a few weeks. In horticultural settings batches can be orders of magnitude greater.     Bokashi offers several advantages:   Fermentation retains all the original carbon and energy.     Virtually the full range of food waste is accepted, without the exclusions of composting. The exception is large bones.   Being airtight, the container inherently traps smells, and when opened the smell of fermentation is far less offensive than decomposition. Hence bokashi bins usually operate indoors, in or near kitchens.   Similarly the container neither attracts insect pests nor allows them ingress.   The process is inherently hygienic because lactic acid is a natural ": null
    },
    {
        "bactericide": "bactericide"
    },
    {
        " and anti-": null
    },
    {
        "pathogen": "pathogen"
    },
    {
        "; even its own fermentation is self-limiting.   Both preservation and consumption complete within a few weeks rather than months.   The preserve can be stored until needed, for example if ground is frozen or waterlogged.   The increased activity of the soil food web improves the soil texture, especially by worm action - in effect this is in-soil ": null
    },
    {
        "vermicomposting": "vermicomposting"
    },
    {
        ".     The importance of the first advantage should not be underestimated: the mass of any ": null
    },
    {
        "ecosystem": "ecosystem"
    },
    {
        " depends on the energy it captures. Plants depend upon the soil ecosystem making nutrients available within ": null
    },
    {
        "soil water": "soilwater"
    },
    {
        ". Therefore, the richer the ecosystem, the richer the plants. .       Hügelkultur       The practice of making raised garden beds or mounds filled with rotting wood is also called hügelkultur in German.   It is in effect creating a ": null
    },
    {
        "nurse log": "nurse log"
    },
    {
        " that is covered with soil.     Benefits of hügelkultur garden beds include water retention and warming of soil.  Buried wood acts like a ": null
    },
    {
        "sponge": "sponge"
    },
    {
        " as it decomposes, able to capture water and store it for later use by crops planted on top of the hügelkultur bed. Hemenway, Toby . Gaias Garden: A Guide to Home-Scale Permaculture. Chelsea Green Publishing. pp. 84–85. .     Compost tea  Compost teas are generally produced from adding one volume of compost to 4–10 volumes of water, but there has also been debate about the benefits of aerating the mixture. Field studies have shown the benefits of adding compost teas to crops due to the adding of organic matter, increased nutrient availability and increased microbial activity. They have also been shown to have an effect on plant pathogens.           Worm Hotels accommodate useful worm in ideal conditions.       Organic ingredients intended for composting can also be used to generate ": null
    },
    {
        "biogas": "biogas"
    },
    {
        " through ": null
    },
    {
        "anaerobic digestion": "anaerobic digestion"
    },
    {
        ". This process stabilizes organic material. The residual material, sometimes in combination with ": null
    },
    {
        "sewage sludge": "sewage sludge"
    },
    {
        " can be treated by a composting process before selling or giving away the compost.          There are process and product guidelines in Europe that date to the early 1980s and only more recently in the UK and the US. In both these countries, private trade associations within the industry have established loose standards, some say as a stop-gap measure to discourage independent government agencies from establishing tougher consumer-friendly standards.      The USA is the only Western country that does not distinguish sludge-source compost from green-composts, and by default in the USA 50% of states expect composts to comply in some manner with the federal EPA 503 rule promulgated in 1984 for sludge products.      Compost is regulated in Canada  and Australia  as well.     Many countries such as ": null
    },
    {
        "Wales": "wales"
    },
    {
        "   and some individual cities such as Seattle and ": null
    },
    {
        "San Francisco": "san francisco mandatory recycling and composting ordinance"
    },
    {
        " require food and yard waste to be sorted for composting .            Large-scale composting systems are used by many urban areas around the world.     The worlds largest municipal co-composter for ": null
    },
    {
        "municipal solid waste": "municipal solid waste"
    },
    {
        " is the ": null
    },
    {
        "Edmonton Composting Facility": "edmonton composting facility"
    },
    {
        " in ": null
    },
    {
        "Edmonton": "edmonton"
    },
    {
        ", ": null
    },
    {
        "Alberta": "alberta"
    },
    {
        ", Canada, which turns 220,000 tonnes of municipal solid waste and 22,500 dry tonnes of ": null
    },
    {
        "sewage sludge": "sewage sludge"
    },
    {
        " per year into 80,000 tonnes of compost. The facility is  in area, equivalent to 4½ ": null
    },
    {
        "Canadian football": "canadian football"
    },
    {
        " fields, and the operating structure is the largest ": null
    },
    {
        "stainless steel": "stainless steel"
    },
    {
        " building in ": null
    },
    {
        "North America": "north america"
    },
    {
        ". ": null
    },
    {
        "Qatar": "qatar"
    },
    {
        " awarded Keppel Seghers Singapore, a subsidiary of ": null
    },
    {
        "Keppel Corporation": "keppel corporation"
    },
    {
        ", a contract to begin construction on a 275,000 tonne/year ": null
    },
    {
        "anaerobic digestion": "anaerobic digestion"
    },
    {
        " and composting plant licensed by Kompogas Switzerland. This plant, with 15 independent anaerobic digesters, will be the worlds largest composting facility once fully operational in early 2011 and forms part of Qatars Domestic Solid Waste Management Centre, the largest integrated ": null
    },
    {
        "waste management": "waste management"
    },
    {
        " complex in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ". ": null
    },
    {
        "Lahore Composting Facility": "lahore composting facility"
    },
    {
        " in ": null
    },
    {
        "Lahore": "lahore"
    },
    {
        ", Pakistan, which has a capacity to convert 1,000 tonnes of municipal solid waste per day into compost. It also has a capacity to convert substantial portion of the intake into ": null
    },
    {
        "refuse-derived fuel": "refuse-derived fuel"
    },
    {
        " materials for further combustion use in several energy consuming industries across Pakistan, for example in cement manufacturing companies where it is used to heat ": null
    },
    {
        "cement kiln": "cement kiln"
    },
    {
        "s. This project has also been approved by the Executive Board of the ": null
    },
    {
        "United Nations Framework Convention on Climate Change": "united nations framework convention on climate change"
    },
    {
        " for reducing ": null
    },
    {
        "methane emissions": "methane emissions"
    },
    {
        ", and has been registered with a capacity of reducing 108,686 tonnes ": null
    },
    {
        "carbon dioxide equivalent": "carbon dioxide equivalent"
    },
    {
        " per annum. Details on project design and its validation and monitoring reports are available at:    ": null
    },
    {
        "Kew Gardens": "kew gardens"
    },
    {
        " in London has one of the biggest non-commercial compost heaps in Europe. ": null
    },
    {
        "organic farming": "organic farming"
    },
    {
        ".          Composting as a recognized practice dates to at least the early Roman Empire, and was mentioned as early as ": null
    },
    {
        "Cato the Elders": "cato the elder"
    },
    {
        "160 BCE piece  De Agri Cultura .  Traditionally, composting involved piling organic materials until the next planting season, at which time the materials would have decayed enough to be ready for use in the soil. The advantage of this method is that little working time or effort is required from the composter and it fits in naturally with agricultural practices in temperate climates. Disadvantages are that space is used for a whole year, some nutrients might be leached due to exposure to rainfall, and disease-producing organisms and insects may not be adequately controlled.     Composting was somewhat modernized beginning in the 1920s in Europe as a tool for ": null
    },
    {
        "organic farming": "organic farming"
    },
    {
        ".  The first industrial station for the transformation of urban organic materials into compost was set up in ": null
    },
    {
        "Wels": "wels"
    },
    {
        ", Austria in the year 1921. Welser Anzeiger vom 05. Januar 1921, 67. Jahrgang, Nr. 2, S. 4 Early frequent citations for propounding composting within farming are for the German-speaking world ": null
    },
    {
        "Rudolf Steiner": "rudolf steiner"
    },
    {
        ", founder of a farming method called ": null
    },
    {
        "biodynamics": "biodynamics"
    },
    {
        ", and ": null
    },
    {
        "Annie Francé-Harrar": "annie francé-harrar"
    },
    {
        ", who was appointed on behalf of the government in ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " and supported the country 1950–1958 to set up a large humus organization in the fight against erosion and ": null
    },
    {
        "soil degradation": "soil degradation"
    },
    {
        ".      In the English-speaking world it was ": null
    },
    {
        "Sir Albert Howard": "sir albert howard"
    },
    {
        " who worked extensively in ": null
    },
    {
        "India": "india"
    },
    {
        " on sustainable practices and ": null
    },
    {
        "Lady Eve Balfour": "lady eve balfour"
    },
    {
        " who was a huge proponent of composting. Composting was imported to America by various followers of these early European movements by the likes of ": null
    },
    {
        "J.I. Rodale": "jerome irving rodale"
    },
    {
        " , E.E. Pfeiffer , ": null
    },
    {
        "Paul Keene": "paul k. keene"
    },
    {
        " , and ": null
    },
    {
        "Scott": "scott nearing"
    },
    {
        " and ": null
    },
    {
        "Helen Nearing": "helen nearing"
    },
    {
        " . Coincidentally, some of the above met briefly in India - all were quite influential in the U.S. from the 1960s into the 1980s.         The term composting is used worldwide with differing meanings.     Humanure is a ": null
    },
    {
        "portmanteau": "portmanteau"
    },
    {
        " of human and manure, designating human excrement  that is recycled via composting for agricultural purposes. The term was first used in 1994 in a book by Joseph Jenkins that advocates the use of this ": null
    },
    {
        "organic": "organic material"
    },
    {
        " soil amendment.  The term humanure is used by compost enthusiasts in the United States but not widely used elsewhere. Because the term humanure has no authoritative definition it is subject to various uses. News reporters may use the term also for ": null
    },
    {
        "sewage sludge": "sewage sludge"
    },
    {
        " or ": null
    },
    {
        "biosolids": "biosolids"
    },
    {
        ". ": null
    }
]