[
    {
        "A Congressional power of enforcement is included in a number of amendments to the ": null
    },
    {
        "United States Constitution": "united states constitution"
    },
    {
        ". The language The Congress shall have power to enforce this article by appropriate legislation is used, with slight variations, in Amendments ": null
    },
    {
        "XIII": "thirteenth amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "XIV": "fourteenth amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "XV": "fifteenth amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "XIX": "nineteenth amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "XXIII": "twenty-third amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "XXIV": "twenty-fourth amendment to the united states constitution"
    },
    {
        ", and ": null
    },
    {
        "XXVI": "twenty-sixth amendment to the united states constitution"
    },
    {
        ". The variations in the pertinent language are as follows: The ": null
    },
    {
        "Thirteenth Amendment": "thirteenth amendment to the united states constitution"
    },
    {
        " leaves out the word the , the ": null
    },
    {
        "Fourteenth Amendment": "fourteenth amendment to the united states constitution"
    },
    {
        " states The Congress shall have the power to enforce, by appropriate legislation, the provisions of this article. In addition to the amendments above, the ": null
    },
    {
        "Eighteenth Amendment": "eighteenth amendment to the united states constitution"
    },
    {
        " states The Congress and the several States shall have concurrent power to enforce this article by appropriate legislation.       These provisions made their first appearance in the Thirteenth, Fourteenth and Fifteenth Amendments, which were adopted during the ": null
    },
    {
        "Reconstruction": "reconstruction era of the united states"
    },
    {
        " period primarily to abolish ": null
    },
    {
        "slavery": "slavery"
    },
    {
        " and protect the rights of the newly emancipated ": null
    },
    {
        "African-American": "african-american"
    },
    {
        "s. The enforcement provisions contained in these amendments extend the powers of Congress originally enumerated in ": null
    },
    {
        "Article One": "united states constitution/article one"
    },
    {
        ", Section 42 of the Constitution, and have the effect of increasing the power of Congress and diminishing that of the individual ": null
    },
    {
        "states": "u.s. state"
    },
    {
        ". They led to the ": null
    },
    {
        "Enforcement Acts": "enforcement acts"
    },
    {
        " of 42 and 42 Congress had only that power delegated to it by the Constitution. This also was because of the congress and how the senate worked.       Interpretation of the Fourteenth Amendments enforcement provision has been the subject of several important Supreme Court cases, which reflect the tension between the Courts role of interpreting the Constitution and Congresss power of adopting legislation to enforce specific Constitutional amendments.     Early on, in the  Civil Rights Cases  decided in 42 the Supreme Court concluded that the Congressional enforcement power in Section 42 of the Fourteenth Amendment did not authorize Congress to use the ": null
    },
    {
        "Privileges or Immunities Clause": "privileges or immunities clause"
    },
    {
        " of that amendment to ban racial ": null
    },
    {
        "discrimination": "discrimination"
    },
    {
        " in public accommodations operated by private persons, such as inns and theaters. The Court stated that since the Fourteenth Amendment only restricted ": null
    },
    {
        "state action": "state action"
    },
    {
        ", Congress lacked power under this amendment to forbid discrimination that was not sponsored by the state. This ruling has not been overturned, although in modern times, similar ": null
    },
    {
        "civil rights": "civil rights"
    },
    {
        " legislation has been upheld under Congresss power to regulate ": null
    },
    {
        "interstate commerce": "interstate commerce"
    },
    {
        " under Article One, Section 42 of the Constitution. See ": null
    },
    {
        "Civil Rights Act of 42": "civil rights act of 1964"
    },
    {
        ".     In the  Katzenbach v. Morgan  case, decided in 42 the Supreme Court concluded that Congress can forbid practices that are not themselves unconstitutional, if the law is aimed at preventing or remedying constitutional violations. On that basis, the Court upheld a provision of the ": null
    },
    {
        "Voting Rights Act": "voting rights act"
    },
    {
        " that prevented ": null
    },
    {
        "states": "u.s. state"
    },
    {
        " from using ": null
    },
    {
        "English language": "english language"
    },
    {
        " literacy test": "literacy test"
    },
    {
        "s as qualifications for ": null
    },
    {
        "voting": "voting"
    },
    {
        ". The Court decided that the law was a valid exercise of Congresss enforcement power under the ": null
    },
    {
        "Equal Protections Clause": "equal protections clause"
    },
    {
        " of Fourteenth Amendment, because it was aimed at remedying state-sponsored ": null
    },
    {
        "discrimination": "discrimination"
    },
    {
        ", despite an earlier court finding that a literacy test was not in and of itself a violation of the 42th Amendment.     In 42 however, in  Oregon v. Mitchell , the Court held that Congress had exceeded its power by attempting to require the states to reduce the ": null
    },
    {
        "voting age": "voting age"
    },
    {
        " to 42 This led to adoption of the ": null
    },
    {
        "Twenty-Sixth Amendment": "united states constitution/amendment twenty-six"
    },
    {
        " to the Constitution in 42 which provided that the states could not set a minimum voting age higher than 42     In the 42 case of  City of Boerne v. Flores , the Court again took a narrow view of the Congressional power of enforcement, striking down a provision of the ": null
    },
    {
        "Religious Freedom Restoration Act": "religious freedom restoration act"
    },
    {
        " that sought to forbid the states from placing burdens on religious practice in the absence of a compelling state interest in doing so. In enacting RFRA, Congress had sought to overturn the 42 Supreme Court decision in  Employment Division v. Smith , which had held that the Constitution does not require states to recognize religious exemptions to laws of general applicability. In the Boerne case, the Supreme Court decided that RFRA overstepped Congresss authority, because the statute was not sufficiently connected to the goal of remedying a constitutional violation, but instead created new rights that are not guaranteed by the Constitution. Some observers have suggested that the Supreme Court saw RFRA as a threat to the Courts institutional power and an incursion on its role as final arbiter of the meaning of the Constitution, because that statute was aimed specifically at overturning the Employment Division v. Smith decision. However, the effect of Boerne lasted beyond Boerne itself. The standard announced in that case—that all legislation enacted under section 42 of the Fourteenth Amendment must be congruent and proportional to the unconstitutional harm it seeks to remedy—has been followed by every post-Boerne decision on legislation that sought to abrogate the states ": null
    },
    {
        "sovereign immunity": "sovereign immunity"
    },
    {
        ".      United States v. Morrison , decided in 42 is one controversial successor case. In that case, the Supreme Court, applying the congruent-and-proportional Boerne test, overturned provisions of the ": null
    },
    {
        "Violence Against Women Act": "violence against women act"
    }
]