[
    {
        "In ": null
    },
    {
        "group theory": "group theory"
    },
    {
        ", the conjugate closure of a ": null
    },
    {
        "subset": "subset"
    },
    {
        " S of a ": null
    },
    {
        "group": "group"
    },
    {
        " G is the ": null
    },
    {
        "subgroup": "subgroup"
    },
    {
        " of G ": null
    },
    {
        " generated": "generating set of a group"
    },
    {
        " by S G , i.e. the closure of S G under the group operation, where S G is the set of the ": null
    },
    {
        "conjugates": "conjugate"
    },
    {
        " of the elements of S:   :S G    The conjugate closure of S is denoted  or  G .     The conjugate closure of any non-empty subset S of a group G is always a ": null
    },
    {
        "normal subgroup": "normal subgroup"
    },
    {
        " of G; in fact, it is the smallest normal subgroup of G which contains the non-empty set S. For this reason, the conjugate closure coincides with the normal closure of S or the normal subgroup generated by S for non-empty S, where the normal closure is defined as the ": null
    },
    {
        "intersection": "intersection"
    },
    {
        " of all normal subgroups of G which contain S. Any normal subgroup is equal to its normal closure.     The conjugate closure of a ": null
    },
    {
        "singleton subset": "singleton set"
    },
    {
        "  of a group G is a normal subgroup generated by a and all elements of G which are conjugate to a. Therefore, any ": null
    },
    {
        "simple group": "simple group"
    },
    {
        " is the conjugate closure of any non-identity group element. Note that the conjugate closure of the empty set \\varnothing is empty, while its normal closure is the ": null
    },
    {
        "trivial group": "trivial group"
    },
    {
        ".     Contrast the normal closure of S with the  normalizer  of S, which is  the largest subgroup of G in which S itself is normal.      Dual to the concept of normal closure is that of normal interior or  normal core , defined as the join of all normal subgroups contained in S": null
    }
]