[
    {
        "           In ": null
    },
    {
        "topology": "topology"
    },
    {
        " and related branches of ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", a connected space is a ": null
    },
    {
        "topological space": "topological space"
    },
    {
        " that cannot be represented as the ": null
    },
    {
        "union": "union"
    },
    {
        " of two or more ": null
    },
    {
        "disjoint": "disjoint set"
    },
    {
        " non-empty": "empty set"
    },
    {
        " open subsets": "open"
    },
    {
        ". Connectedness is one of the principal ": null
    },
    {
        "topological properties": "topological properties"
    },
    {
        " that are used to distinguish topological spaces.     A subset of a topological space X is a connected set if it is a connected space when viewed as a ": null
    },
    {
        "subspace": "subspace topology"
    },
    {
        " of X.     Some related but stronger conditions are ": null
    },
    {
        "path connected": "connected spacepath connectedness"
    },
    {
        ", ": null
    },
    {
        "simply connected": "simply connected space"
    },
    {
        ", and ": null
    },
    {
        "n-connected": "n-connected space"
    },
    {
        ". Another related notion is ": null
    },
    {
        "locally connected": "locally connected space"
    },
    {
        ", which neither implies nor follows from connectedness.       A ": null
    },
    {
        "topological space": "topological space"
    },
    {
        " X is said to be disconnected if it is the union of two disjoint non-empty open sets. Otherwise, X is said to be connected. A ": null
    },
    {
        "subset": "subset"
    },
    {
        " of a topological space is said to be connected if it is connected under its subspace topology. Some authors exclude the ": null
    },
    {
        "empty set": "empty set"
    },
    {
        " as a connected space, but this article does not follow that practice.     For a topological space X the following conditions are equivalent:     X is connected, that is, it cannot be divided into two disjoint non-empty open sets.   X cannot be divided into two disjoint non-empty ": null
    },
    {
        "closed set": "closed set"
    },
    {
        "s.   The only subsets of X which are both open and closed  are X and the empty set.   The only subsets of X with empty ": null
    },
    {
        "boundary": "boundary"
    },
    {
        " are X and the empty set.   X cannot be written as the union of two non-empty ": null
    },
    {
        "separated sets": "separated sets"
    },
    {
        " .   All ": null
    },
    {
        "continuous": "continuous_functioncontinuous_functions_between_topological_spaces"
    },
    {
        " functions from X to are constant, where is the two-point space endowed with the discrete topology.       The ": null
    },
    {
        "maximal": "maximal element"
    },
    {
        " connected subsets  of a non-empty topological space are called the connected components of the space.   The components of any topological space X form a ": null
    },
    {
        "partition": "partition of a set"
    },
    {
        " of  X: they are ": null
    },
    {
        "disjoint": "disjoint sets"
    },
    {
        ", non-empty, and their union is the whole space.   Every component is a ": null
    },
    {
        "closed subset": "closed subset"
    },
    {
        " of the original space. It follows that, in the case where their number is finite, each component is also an open subset. However, if their number is infinite, this might not be the case; for instance, the connected components of the set of the ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "s are the one-point sets , which are not open.     Let \\Gamma_x be the connected component of x in a topological space X, and \\Gamma_x be the intersection of all ": null
    },
    {
        "clopen": "clopen"
    },
    {
        " sets containing x  Then \\Gamma_x \\subset \\Gamma_x where the equality holds if X is compact Hausdorff or locally connected.       A space in which all components are one-point sets is called ": null
    },
    {
        "totally disconnected": "totally disconnected"
    },
    {
        ". Related to this property, a space X is called totally separated if, for any two distinct elements x and y of X, there exist disjoint ": null
    },
    {
        "open sets": "open sets"
    },
    {
        " U containing x and V containing y such that X is the union of U and V. Clearly, any totally separated space is totally disconnected, but the converse does not hold. For example take two copies of the rational numbers Q, and identify them at every point except zero. The resulting space, with the quotient topology, is totally disconnected. However, by considering the two copies of zero, one sees that the space is not totally separated. In fact, it is not even ": null
    },
    {
        "Hausdorff": "hausdorff space"
    },
    {
        ", and the condition of being totally separated is strictly stronger than the condition of being Hausdorff.         The closed interval  in the ": null
    },
    {
        "standard": "euclidean space"
    },
    {
        " subspace topology": "subspace topology"
    },
    {
        " is connected; although it can, for example, be written as the union of 42  42such as \\R or \\C GLn, \\mathbfthat is, the group of n-by-n real, invertible matricesGLn, \\mathbfi.e., R is not a product of two rings in a nontrivial waythat is, spaces which are not connected": null
    },
    {
        "themati": "themati"
    },
    {
        "themati": "themati"
    },
    {
        "polo": "polo"
    },
    {
        "polo": "polo"
    },
    {
        "topology4242or pathwise connected or 42-connectednote however that by this definition, the empty space is not path-connected because it has zero path-components; there is a unique equivalence relation on the empty set which has zero equivalence classes": null
    },
    {
        "polo": "polo"
    },
    {
        " themati": "themati"
    },
    {
        "themati": "themati"
    },
    {
        "42  42": null
    }
]