[
    {
        "   A constitutional monarchy is a form of ": null
    },
    {
        "monarchy": "monarchy"
    },
    {
        " in which the ": null
    },
    {
        "sovereign": "sovereignty"
    },
    {
        " exercises authority in accordance with a written or unwritten ": null
    },
    {
        "constitution": "constitution"
    },
    {
        ". Constitutional monarchy differs from ": null
    },
    {
        "absolute monarchy": "absolute monarchy"
    },
    {
        " in that constitutional monarchs are bound to exercise their powers and authorities within the limits prescribed within an established legal framework. Constitutional monarchies range from countries such as ": null
    },
    {
        "Monaco": "monaco"
    },
    {
        ", ": null
    },
    {
        "Morocco": "morocco"
    },
    {
        ", ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " and ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        ", where the constitution grants substantial discretionary powers to the sovereign, to countries such as the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " and ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", where the monarch retains no formal authorities.     Constitutional monarchy may refer to a system in which the monarch acts as a non-party political ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " under the ": null
    },
    {
        "constitution": "constitution"
    },
    {
        ", whether written or ": null
    },
    {
        "unwritten": "uncodified constitution"
    },
    {
        ". While most monarchs may hold formal authority and the government may legally operate in the monarchs name, in the form typical in Europe the monarch no longer personally sets ": null
    },
    {
        "public policy": "public policy"
    },
    {
        " or chooses political leaders. Political scientist ": null
    },
    {
        "Vernon Bogdanor": "vernon bogdanor"
    },
    {
        ", paraphrasing ": null
    },
    {
        "Thomas Macaulay": "thomas macaulay"
    },
    {
        ", has defined a constitutional monarch as A sovereign who reigns but does not rule .     In addition to acting as a visible symbol of ": null
    },
    {
        "national unity": "national unity"
    },
    {
        ", a constitutional monarch may hold formal powers such as ": null
    },
    {
        "dissolving parliament": "dissolving parliament"
    },
    {
        " or giving ": null
    },
    {
        "royal assent": "royal assent"
    },
    {
        " to legislation. However, the exercise of such powers is largely strictly in accordance with either written constitutional principles or unwritten constitutional conventions, rather than any personal political preference imposed by the sovereign. In  The English Constitution , British political theorist ": null
    },
    {
        "Walter Bagehot": "walter bagehot"
    },
    {
        " identified three main political rights which a constitutional monarch may freely exercise: the right to be consulted, the right to encourage, and the right to warn. Many constitutional monarchies still retain significant authorities or political influence however, such as through certain ": null
    },
    {
        "reserve power": "reserve power"
    },
    {
        "s, and may also play an important political role.     The ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and the other ": null
    },
    {
        "Commonwealth realms": "commonwealth realms"
    },
    {
        " are all constitutional monarchies in the ": null
    },
    {
        "Westminster system": "westminster system"
    },
    {
        " of constitutional governance. Two constitutional monarchies  – ": null
    },
    {
        "Malaysia": "monarchy of malaysia"
    },
    {
        " and ": null
    },
    {
        "Cambodia": "monarchy of cambodia"
    },
    {
        "  – are ": null
    },
    {
        "elective monarchies": "elective monarchies"
    },
    {
        ", wherein the ruler is periodically selected by a small ": null
    },
    {
        "electoral college": "electoral college"
    },
    {
        ".     Strongly limited constitutional monarchies can be called ": null
    },
    {
        "crowned republic": "crowned republic"
    },
    {
        "s.     The concept of ": null
    },
    {
        "semi-constitutional monarchy": "semi-constitutional monarchy"
    },
    {
        " identifies constitutional monarchies with less parliamentary powers.  Because of this, constitutional monarchies are also called parliamentary monarchies to differentiate them from semi-constitutional monarchies.        The oldest constitutional monarchy dating back to ancient times was that of the ": null
    },
    {
        "Hittites": "hittites"
    },
    {
        ". They were an ": null
    },
    {
        "ancient Anatolian people": "ancient anatolian people"
    },
    {
        " that lived during the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " whose king or queen had to share their authority with an assembly, called the  Panku , which was the equivalent to a modern-day deliberative assembly or a legislature. Members of the Panku came from scattered noble families who worked as representatives of their subjects in an adjutant or subaltern federal-type landscape.               In the ": null
    },
    {
        "Kingdom of England": "kingdom of england"
    },
    {
        ", the ": null
    },
    {
        "Glorious Revolution": "glorious revolution"
    },
    {
        " of 1688 led to a constitutional monarchy restricted by laws such as the ": null
    },
    {
        "Bill of Rights 1689": "bill of rights 1689"
    },
    {
        " and the ": null
    },
    {
        "Act of Settlement 1701": "act of settlement 1701"
    },
    {
        ", although limits on the power of the monarch are much older than that . At the same time, in ": null
    },
    {
        "Scotland": "kingdom of scotland"
    },
    {
        ", the ": null
    },
    {
        "Convention of Estates": "convention of estates"
    },
    {
        " enacted the ": null
    },
    {
        "Claim of Right Act 1689": "claim of right act 1689"
    },
    {
        ", which placed similar limits on the Scottish monarchy.     Although ": null
    },
    {
        "Queen Anne": "anne, queen of great britain"
    },
    {
        " was the last monarch to veto an Act of Parliament when, on 11 March 1708, she blocked the ": null
    },
    {
        "Scottish Militia Bill": "scottish militia bill"
    },
    {
        ", Hanoverian monarchs continued to selectively dictate government policies. For instance ": null
    },
    {
        "King George III": "king george iii"
    },
    {
        " constantly blocked ": null
    },
    {
        "Catholic Emancipation": "catholic emancipation in britain"
    },
    {
        ", eventually precipitating the resignation of ": null
    },
    {
        "William Pitt the Younger": "william pitt the younger"
    },
    {
        " as prime minister in 1801.  The sovereigns influence on the choice of prime minister gradually declined over this period, ": null
    },
    {
        "King William IV": "king william iv"
    },
    {
        " being the last monarch to dismiss a prime minister, when in 1834 he removed ": null
    },
    {
        "Lord Melbourne": "lord melbourne"
    },
    {
        " as a result of Melbournes choice of ": null
    },
    {
        "Lord John Russell": "lord john russell, 1st earl russell"
    },
    {
        " as Leader of the House of Commons.   ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        " was the last monarch to exercise real personal power, but this diminished over the course of her reign. In 1839, she became the last sovereign to keep a prime minister in power against the will of Parliament when the ": null
    },
    {
        "Bedchamber crisis": "bedchamber crisis"
    },
    {
        " resulted in the retention of Lord Melbournes administration.  By the end of her reign, however, she could do nothing to block the unacceptable premierships of ": null
    },
    {
        "William Gladstone": "william ewart gladstone"
    },
    {
        ", although she still exercised power in appointments to the Cabinet, for example in 1886 preventing Gladstones choice of ": null
    },
    {
        "Hugh Childers": "hugh childers"
    },
    {
        " as War Secretary in favor of ": null
    },
    {
        "Sir Henry Campbell-Bannerman": "sir henry campbell-bannerman"
    },
    {
        ".      Today, the role of the British monarch is by convention effectively ceremonial. Instead, the ": null
    },
    {
        "British Parliament": "british parliament"
    },
    {
        " and the ": null
    },
    {
        "Government": "government of the united kingdom"
    },
    {
        " – chiefly in the office of ": null
    },
    {
        "Prime Minister of the United Kingdom": "prime minister of the united kingdom"
    },
    {
        " – exercise their powers under ": null
    },
    {
        " Royal Prerogative ": "royal prerogative"
    },
    {
        ": on behalf of the monarch and through powers still formally possessed by the Monarch.     No person may accept significant public office without swearing an ": null
    },
    {
        "oath of allegiance to the Queen": "oath of allegiance"
    },
    {
        ". With few exceptions, the monarch is bound by ": null
    },
    {
        "constitutional convention": "constitutional conventions of the united kingdom"
    },
    {
        " to act on the ": null
    },
    {
        "advice": "advice"
    },
    {
        " of the Government.       Constitutional monarchy originated in continental Europe, with Poland developing the first constitution for a monarchy with the ": null
    },
    {
        "Constitution of May 3, 1791": "constitution of may 3, 1791"
    },
    {
        "; it was the third single-document constitution in the world just after the first republican ": null
    },
    {
        "Constitution of the United States": "constitution of the united states"
    },
    {
        ". Constitutional monarchy also occurred briefly in the early years of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ", but much more widely afterwards. ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        " is considered the first monarch proclaiming himself as an embodiment of the nation, rather than as a divinely-appointed ruler; this interpretation of monarchy is germane to continental constitutional monarchies. German philosopher ": null
    },
    {
        "Georg Wilhelm Friedrich Hegel": "georg wilhelm friedrich hegel"
    },
    {
        ", in his work  Elements of the Philosophy of Right  , gave the concept a philosophical justification that concurred with evolving contemporary political theory and the ": null
    },
    {
        "Protestant": "protestantism"
    },
    {
        " Christian view of natural law. Hegels forecast of a constitutional monarch with very limited powers whose function is to embody the national character and provide constitutional continuity in times of emergency was reflected in the development of constitutional monarchies in Europe and Japan.       As originally conceived, a constitutional monarch was head of the ": null
    },
    {
        "executive branch": "executive branch"
    },
    {
        " and quite a powerful figure even though his or her power was limited by the constitution and the elected parliament. Some of the framers of the U.S. Constitution may have envisioned the president as an elected constitutional monarch, as the term was then understood, following ": null
    },
    {
        "Montesquieus": "baron de montesquieu"
    },
    {
        " account of the separation of powers.     The present-day concept of a constitutional monarchy developed in the United Kingdom, where the democratically elected parliaments, and their leader, the ": null
    },
    {
        "prime minister": "prime minister"
    },
    {
        ", exercise power, with the monarchs having ceded power and remaining as a titular position. In many cases the monarchs, while still at the very top of the political and social hierarchy, were given the status of servants of the people to reflect the new, egalitarian position. In the course of ": null
    },
    {
        "Frances": "france"
    },
    {
        " July Monarchy": "july monarchy"
    },
    {
        ", ": null
    },
    {
        "Louis-Philippe I": "louis-philippe i"
    },
    {
        " was styled King of the French rather than King of France.     Following the ": null
    },
    {
        "Unification of Germany": "unification of germany"
    },
    {
        ", ": null
    },
    {
        "Otto von Bismarck": "otto von bismarck"
    },
    {
        " rejected the British model. In the constitutional monarchy established under the ": null
    },
    {
        "Constitution of the German Empire": "constitution of the german empire"
    },
    {
        " which Bismarck inspired, the ": null
    },
    {
        "Kaiser": "kaiser"
    },
    {
        " retained considerable actual executive power, while the ": null
    },
    {
        "Imperial Chancellor": "reichskanzler"
    },
    {
        " needed no parliamentary vote of confidence and ruled solely by the imperial mandate. However this model of constitutional monarchy was discredited and abolished following Germanys defeat in the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". Later, ": null
    },
    {
        "Fascist Italy": "kingdom of italy under fascism"
    },
    {
        " could also be considered a constitutional monarchy, in that there was a ": null
    },
    {
        "king": "king of italy"
    },
    {
        " as the titular head of state while actual power was held by ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        " under a constitution. This eventually discredited the Italian monarchy and led to its abolition in 1946. After the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", surviving European monarchies almost invariably adopted some variant of the constitutional monarchy model originally developed in Britain.     Nowadays a ": null
    },
    {
        "parliamentary democracy": "parliamentary democracy"
    },
    {
        " that is a constitutional monarchy is considered to differ from one that is a ": null
    },
    {
        "republic": "republic"
    },
    {
        " only in detail rather than in substance. In both cases, the titular head of state—monarch or president—serves the traditional role of embodying and representing the nation, while the government is carried on by a cabinet composed predominantly of elected ": null
    },
    {
        "Members of Parliament": "member of parliament"
    },
    {
        ".     However, three important factors distinguish monarchies such as the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " from systems where greater power might otherwise rest with ": null
    },
    {
        "Parliament": "parliament"
    },
    {
        ". These are: the ": null
    },
    {
        "Royal Prerogative": "royal prerogative"
    },
    {
        " under which the monarch may exercise power under certain very limited circumstances; ": null
    },
    {
        "Sovereign Immunity": "sovereign immunity"
    },
    {
        " under which the monarch may do no wrong under the law because the ": null
    },
    {
        "responsible government": "responsible government"
    },
    {
        " is instead deemed accountable; and the monarch may not be subject to the same taxation or property use restrictions as most citizens. Other privileges may be nominal or ceremonial .     Today slightly more than a quarter of constitutional monarchies are ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        "an countries, including the ": null
    },
    {
        "United Kingdom": "monarchy of the united kingdom"
    },
    {
        ", ": null
    },
    {
        "Spain": "monarchy of spain"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "monarchy of the netherlands"
    },
    {
        ", ": null
    },
    {
        "Belgium": "monarchy of belgium"
    },
    {
        ", ": null
    },
    {
        "Norway": "monarchy of norway"
    },
    {
        ", ": null
    },
    {
        "Denmark": "monarchy of denmark"
    },
    {
        ", ": null
    },
    {
        "Luxembourg": "monarchy of luxembourg"
    },
    {
        ", ": null
    },
    {
        "Monaco": "monarchy of monaco"
    },
    {
        ", ": null
    },
    {
        "Liechtenstein": "monarchy of liechtenstein"
    },
    {
        " and ": null
    },
    {
        "Sweden": "monarchy of sweden"
    },
    {
        ". However, the two most populous constitutional monarchies in the world are in Asia: ": null
    },
    {
        "Japan": "monarchy of japan"
    },
    {
        " and ": null
    },
    {
        "Thailand": "monarchy of thailand"
    },
    {
        ". In these countries the ": null
    },
    {
        "prime minister": "prime minister"
    },
    {
        " holds the day-to-day powers of governance, while the monarch retains residual powers. The powers of the monarch differ between countries. In Denmark and in Belgium, for example, the Monarch formally appoints a representative to preside over the creation of a ": null
    },
    {
        "coalition government": "coalition government"
    },
    {
        " following a parliamentary election, while in Norway the King chairs special meetings of the ": null
    },
    {
        "cabinet": "cabinet"
    },
    {
        ".     In nearly all cases, the monarch is still the nominal chief executive, but is bound by convention to act on the advice of the Cabinet. Only a few monarchies  have amended their constitutions so that the monarch is no longer even the nominal chief executive.     There are sixteen constitutional monarchies under Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        ", which are known as ": null
    },
    {
        "Commonwealth realm": "commonwealth realm"
    },
    {
        "s. Unlike some of their continental European counterparts, the Monarch and her Governors-General in the Commonwealth realms hold significant reserve or prerogative powers, to be wielded in times of extreme emergency or constitutional crises, usually to uphold parliamentary government. An instance of a Governor-General exercising such power occurred during the ": null
    },
    {
        "1975 Australian constitutional crisis": "1975 australian constitutional crisis"
    },
    {
        ", when the Australian Prime Minister, ": null
    },
    {
        "Gough Whitlam": "gough whitlam"
    },
    {
        ", was dismissed by the Governor-General. The Australian senate had threatened to block the Governments ": null
    },
    {
        "budget": "budget"
    },
    {
        " by refusing to pass the necessary appropriation bills. On November 11, 1975, Whitlam intended to call a half-Senate election in an attempt to break the deadlock. When he sought the Governor-Generals approval of the election, the Governor-General instead dismissed him as Prime Minister, and shortly thereafter installed leader of the opposition ": null
    },
    {
        "Malcolm Fraser": "malcolm fraser"
    },
    {
        " in his place. Acting quickly before all parliamentarians became aware of the change of government, Fraser and his allies secured passage of the appropriation bills, and the Governor-General dissolved Parliament for a ": null
    },
    {
        "double dissolution": "double dissolution"
    },
    {
        " election. Fraser and his government were returned with a massive majority. This led to much speculation among Whitlams supporters as to whether this use of the Governor-Generals reserve powers was appropriate, and whether ": null
    },
    {
        "Australia should become a republic": "republicanism in australia"
    },
    {
        ". Among supporters of constitutional monarchy, however, the experience confirmed the value of the monarchy as a source of checks and balances against elected politicians who might seek powers in excess of those conferred by the constitution, and ultimately as a safeguard against dictatorship.     In Thailands constitutional monarchy, the monarch is recognized as the Head of State, Head of the Armed Forces, Upholder of the Buddhist Religion, and Defender of the Faith. The immediate former King, ": null
    },
    {
        "Bhumibol Adulyadej": "bhumibol adulyadej"
    },
    {
        ", was the longest-reigning monarch in the world and in all of Thailands history, before passing away on 13 October 2016.  Bhumibol reigned through several political changes in the Thai government. He played an influential role in each incident, often acting as mediator between disputing political opponents.  Among the powers retained by the Thai monarch under the constitution, ": null
    },
    {
        "lèse majesté": "lèse majesté in thailand"
    },
    {
        " protects the image of the monarch and enables him to play a role in politics. It carries strict criminal penalties for violators. Generally, the Thai people were reverent of Bhumibol. Much of his social influence arose from this reverence and from the socioeconomic improvement efforts undertaken by the royal family.     In the United Kingdom, a frequent debate centers on when it is appropriate for a British monarch to act. When a monarch does act, political controversy can often ensue, partially because the neutrality of the crown is seen to be compromised in favor of a ": null
    },
    {
        "partisan": "partisan"
    },
    {
        " goal, while some ": null
    },
    {
        "political scientists": "political scientist"
    },
    {
        "champion the idea of an interventionist monarch as a check against possible illegal action by politicians. For instance, the monarch of the United Kingdom can theoretically exercise an absolute veto over legislation by withholding royal assent. However, no monarch has done so since 1708, and it is widely believed that this and many of the monarchs other political powers are ": null
    },
    {
        "lapsed power": "lapsed power"
    },
    {
        "s.     There are currently 43 monarchies worldwide.                  ": null
    },
    {
        "Anglo-Corsican Kingdom": "anglo-corsican kingdom"
    },
    {
        " was a brief period in the ": null
    },
    {
        "history of Corsica": "history of corsica"
    },
    {
        " when the island broke with ": null
    },
    {
        "Revolutionary France": "revolutionary france"
    },
    {
        " and sought military protection from ": null
    },
    {
        "Great Britain": "kingdom of great britain"
    },
    {
        ". Corsica became an independent kingdom under ": null
    },
    {
        "George III": "george iii"
    },
    {
        " of the United Kingdom, but with its own elected parliament and a written constitution guaranteeing local autonomy and democratic rights.   ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " from 1822, with the proclamation of independence and rise of the ": null
    },
    {
        "Empire of Brazil": "empire of brazil"
    },
    {
        " by ": null
    },
    {
        "Pedro I of Brazil": "pedro i of brazil"
    },
    {
        " to 1889, when ": null
    },
    {
        "Pedro II": "pedro ii of brazil"
    },
    {
        " was deposed by a military coup.   ": null
    },
    {
        "Kingdom of Bulgaria": "kingdom of bulgaria"
    },
    {
        " until 1946 when ": null
    },
    {
        "Tsar Simeon": "simeon saxe-coburg-gotha"
    },
    {
        " was deposed by the communist assembly.   Many ": null
    },
    {
        "Commonwealth republics": "commonwealth republic"
    },
    {
        "were constitutional monarchies for some period after their independence, including ": null
    },
    {
        "Ceylon": "dominion of ceylon"
    },
    {
        " from 1948 to 1972 , ": null
    },
    {
        "Fiji": "monarchy of fiji"
    },
    {
        " , ": null
    },
    {
        "Gambia": "queen of the gambia"
    },
    {
        " , ": null
    },
    {
        "Ghana": "queen of ghana"
    },
    {
        " , ": null
    },
    {
        "Guyana": "queen of guyana"
    },
    {
        " , and ": null
    },
    {
        "Trinidad and Tobago": "queen of trinidad and tobago"
    },
    {
        " .   The ": null
    },
    {
        "Grand Principality of Finland": "grand principality of finland"
    },
    {
        " was a constitutional monarchy though its ruler, ": null
    },
    {
        "Alexander I": "alexander i of russia"
    },
    {
        ", was simultaneously an ": null
    },
    {
        "autocrat": "autocracy"
    },
    {
        " and ": null
    },
    {
        "absolute ruler": "absolute monarchy"
    },
    {
        " in Russia.   ": null
    },
    {
        "France": "france"
    },
    {
        ", several times during the 19th century. ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        " proclaimed himself Emperor of the French in what was ostensibly a constitutional monarchy, though modern historians often call his reign as an absolute monarchy. The ": null
    },
    {
        "Bourbon Restoration": "bourbon restoration"
    },
    {
        " , the ": null
    },
    {
        "July Monarchy": "july monarchy"
    },
    {
        " , and the ": null
    },
    {
        "Second Empire": "second french empire"
    },
    {
        "  were also constitutional monarchies, although the power of the monarch varied considerably between them.   The ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " from 1871 to 1918, was also a constitutional monarchy—see ": null
    },
    {
        "Constitution of the German Empire": "constitution of the german empire"
    },
    {
        ".   ": null
    },
    {
        "Greece": "greece"
    },
    {
        " until 1973 when ": null
    },
    {
        "Constantine II": "constantine ii of greece"
    },
    {
        " was deposed by the ": null
    },
    {
        "military government": "greek military junta of 1967–74"
    },
    {
        ". The decision was formalized by a ": null
    },
    {
        "plebiscite": "greek plebiscite, 1974"
    },
    {
        " December 8, 1974.   ": null
    },
    {
        "Hawaii": "kingdom of hawaii"
    },
    {
        ", which was an absolute monarchy from its founding in 1810, transitioned to a constitutional monarchy in 1840 when ": null
    },
    {
        "King Kamehameha III": "king kamehameha iii"
    },
    {
        " promulgated the kingdoms ": null
    },
    {
        "first constitution": "1840 constitution of the kingdom of hawaii"
    },
    {
        ". This constitutional form of government continued until the monarchy was overthrown in an 1893 ": null
    },
    {
        "coup": "overthrow of the kingdom of hawaiicoup d.27état"
    },
    {
        ".   The ": null
    },
    {
        "Kingdom of Hungary": "kingdom of hungary"
    },
    {
        ". In 1848–1849 and 1867–1918 as part of ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ". In the interwar period ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        " remained a constitutional monarchy without a reigning monarch.   ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        ". The Act of Union, a December 1, 1918 agreement with Denmark, established Iceland as a ": null
    },
    {
        "sovereign kingdom": "monarchy of iceland"
    },
    {
        " united with Denmark under a common king. Iceland abolished the monarchy and became a republic on June 17, 1944 after the Icelandic constitutional referendum, May 24, 1944.   ": null
    },
    {
        "India": "india"
    },
    {
        " was a constitutional monarchy, with ": null
    },
    {
        "George VI": "george vi"
    },
    {
        " as head of state and ": null
    },
    {
        "the Earl Mountbatten": "louis mountbatten, 1st earl mountbatten of burma"
    },
    {
        " as ": null
    },
    {
        "governor-general": "governor-general of india"
    },
    {
        ", for a brief period between gaining its independence from the British on ": null
    },
    {
        "August 15, 1947": "independence day"
    },
    {
        " and becoming a republic when it adopted ": null
    },
    {
        "its constitution": "constitution of india"
    },
    {
        " on January 26, 1950, henceforth celebrated as ": null
    },
    {
        "Republic Day": "republic day"
    },
    {
        ".   ": null
    },
    {
        "Iran": "iran"
    },
    {
        " under ": null
    },
    {
        "Mohammad Reza Shah Pahlavi": "mohammad reza pahlavi"
    },
    {
        " was a constitutional monarchy, which had been originally established during the ": null
    },
    {
        "Persian Constitutional Revolution": "persian constitutional revolution"
    },
    {
        " in 1906.   ": null
    },
    {
        "Italy": "italy"
    },
    {
        " until June 2, 1946, when a referendum proclaimed the end of the Kingdom and the beginning of the Republic.   The ": null
    },
    {
        "Kingdom of Laos": "kingdom of laos"
    },
    {
        " was a constitutional monarchy until 1975, when ": null
    },
    {
        "Sisavang Vatthana": "savang vatthana"
    },
    {
        " was forced to abdicate by the communist ": null
    },
    {
        "Pathet Lao": "pathet lao"
    },
    {
        ".   ": null
    },
    {
        "Malta": "malta"
    },
    {
        " was a constitutional monarchy with ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        " as Queen of Malta, represented by a Governor-General appointed by her, for the first ten years of independence from 21 September 1964 to the declaration of the Republic of Malta on 13 December 1974.   ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " was twice an Empire. The ": null
    },
    {
        "First Mexican Empire": "first mexican empire"
    },
    {
        " was from May 19, 1822, to March 19, 1823, with ": null
    },
    {
        "Agustín de Iturbide": "agustín de iturbide"
    },
    {
        " serving as emperor. Then, with the help of the Austrian and Spanish crowns, ": null
    },
    {
        "Napoleon III of France": "napoleon iii of france"
    },
    {
        " installed ": null
    },
    {
        "Maximilian of Austria": "maximilian of mexico"
    },
    {
        " as ": null
    },
    {
        "Emperor of Mexico": "emperor of mexico"
    },
    {
        ". This attempt to create a European-style monarchy lasted three years, from 1864 to 1867.   ": null
    },
    {
        "Montenegro": "kingdom of montenegro"
    },
    {
        " until 1918 when it merged with ": null
    },
    {
        "Serbia": "kingdom of serbia"
    },
    {
        " and other areas to form ": null
    },
    {
        "Yugoslavia": "kingdom of yugoslavia"
    },
    {
        ".   ": null
    },
    {
        "Nepal": "nepal"
    },
    {
        " until May 28, 2008, when ": null
    },
    {
        "King Gyanendra": "king gyanendra"
    },
    {
        " was deposed, and the Federal Democratic Republic of Nepal was declared.   ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " from 1876 until 1878 and again from 1908 until the dissolution of the empire in 1922.   The ": null
    },
    {
        "Kingdom of Afghanistan": "kingdom of afghanistan"
    },
    {
        " was a constitutional monarchy under ": null
    },
    {
        "Mohammad Zahir Shah": "mohammad zahir shah"
    },
    {
        " until 1973.   The ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        ", formed after the ": null
    },
    {
        "Union of Lublin": "union of lublin"
    },
    {
        " in 1569 and lasting until the final partition of the state in 1795, operated much like many modern European constitutional monarchies . The legislators of the unified state truly did not see it as a monarchy at all, but as a republic under the presidency of the King. Poland–Lithuania also followed the principle of Rex regnat et non gubernat , had a bicameral parliament, and a collection of entrenched legal documents amounting to a constitution along the lines of the modern ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". The King was elected, and had the duty of maintaining the peoples rights.   ": null
    },
    {
        "Kingdom of Albania": "albanian kingdom"
    },
    {
        " from 1928 until 1939, Albania was a Constitutional Monarchy ruled by the ": null
    },
    {
        "House of Zogu": "house of zogu"
    },
    {
        ", ": null
    },
    {
        "King Zog I": "king zog i"
    },
    {
        ".   ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        " was a monarchy since 1139 and a constitutional monarchy from 1822 to 1828, and again from 1834 until 1910, when ": null
    },
    {
        "Manuel II": "manuel ii of portugal"
    },
    {
        " was overthrown by a military coup. From 1815 to 1825 it was part of the ": null
    },
    {
        "United Kingdom of Portugal, Brazil and the Algarves": "united kingdom of portugal, brazil and the algarves"
    },
    {
        " which was a constitutional monarchy for the years 1820–23.   ": null
    },
    {
        "Kingdom of Romania": "kingdom of romania"
    },
    {
        " From its establishment in 1881 until 1947 when ": null
    },
    {
        "Michael I": "michael i of romania"
    },
    {
        " was forced to abdicate by the communists.   ": null
    },
    {
        "Kingdom of Serbia": "kingdom of serbia"
    },
    {
        " from 1882 until 1918, when it merged with the State of Slovenes, Croats and Serbs into the unitary Yugoslav Kingdom, that was led by the Serbian ": null
    },
    {
        "Karadjordjevic": "karadjordjevic"
    },
    {
        " dynasty.   ": null
    },
    {
        "Yugoslavia": "kingdom of yugoslavia"
    },
    {
        " from 1918  until 1929 and from then  until 1944 when under pressure from the Allies ": null
    },
    {
        "Peter II": "peter ii of yugoslavia"
    },
    {
        " recognized the communist government.       ": null
    },
    {
        "Andorra": "andorra"
    },
    {
        " is the only monarchy where the head of state is vested ": null
    },
    {
        "jointly in two individuals": "coregency"
    },
    {
        " : the ": null
    },
    {
        "Bishop of Urgell": "bishop of urgell"
    },
    {
        " and the ": null
    },
    {
        "President of France": "president of france"
    },
    {
        ".   ": null
    },
    {
        "Andorra": "andorra"
    },
    {
        ", ": null
    },
    {
        "Monaco": "monaco"
    },
    {
        " and ": null
    },
    {
        "Liechtenstein": "liechtenstein"
    },
    {
        " are the only countries with a reigning ": null
    },
    {
        "prince": "prince"
    },
    {
        ".   ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " is the only explicit ": null
    },
    {
        "popular monarchy": "popular monarchy"
    },
    {
        ", the formal title of its ": null
    },
    {
        "King": "monarchy of belgium"
    },
    {
        " being King of the Belgians rather than King of Belgium.   ": null
    },
    {
        "Japan": "japan"
    },
    {
        " is the only country remaining with an ": null
    },
    {
        "emperor": "emperor of japan"
    },
    {
        "  , whose position functions as a symbol of the state  .   ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        " is the only country with a ": null
    },
    {
        "grand duke": "grand duke"
    },
    {
        ".   ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        " is the only ": null
    },
    {
        "federal": "federation"
    },
    {
        " country with an ": null
    },
    {
        "elective monarchy": "elective monarchy"
    },
    {
        ", the ": null
    },
    {
        "Yang di-Pertuan Agong": "yang di-pertuan agong"
    },
    {
        ", being selected from among nine ": null
    },
    {
        "state": "states and federal territories of malaysia"
    }
]