[
    {
        "         Constantine, son of Áed   was an early ": null
    },
    {
        "King of Scotland": "King Of Scotland"
    },
    {
        ", known then by the Gaelic name Alba. The ": null
    },
    {
        "Kingdom of Alba": "Kingdom Of Alba"
    },
    {
        ", a name which first appears in Constantines lifetime, was situated in modern-day Scotland.     The core of the kingdom was formed by the lands around the ": null
    },
    {
        "River Tay": "River Tay"
    },
    {
        ". Its southern limit was the ": null
    },
    {
        "River Forth": "River Forth"
    },
    {
        ", northwards it extended towards the ": null
    },
    {
        "Moray Firth": "Moray Firth"
    },
    {
        " and perhaps to ": null
    },
    {
        "Caithness": "Caithness"
    },
    {
        ", while its western limits are uncertain. Constantines grandfather ": null
    },
    {
        "Kenneth I of Scotland": "Kenneth I Of Scotland"
    },
    {
        " was the first of the family recorded as a king, but as ": null
    },
    {
        "king of the Picts": "King Of The Picts"
    },
    {
        ". This change of title, from king of the Picts to king of Alba, is part of a broader transformation of ": null
    },
    {
        "Pictland": "Pictland"
    },
    {
        " and the ": null
    },
    {
        "origins of the Kingdom of Alba": "Origins Of The Kingdom Of Alba"
    },
    {
        " are traced to Constantines lifetime.     His reign, like those of his predecessors, was dominated by the actions of ": null
    },
    {
        "Viking": "Viking"
    },
    {
        " rulers in the ": null
    },
    {
        "British Isles": "British Isles"
    },
    {
        ", particularly the ": null
    },
    {
        "Uí Ímair": "Uí Ímair"
    },
    {
        " . During Constantines reign the rulers of the southern kingdoms of ": null
    },
    {
        "Wessex": "Wessex"
    },
    {
        " and ": null
    },
    {
        "Mercia": "Mercia"
    },
    {
        ", later the ": null
    },
    {
        "Kingdom of England": "Kingdom Of England"
    },
    {
        ", extended their authority northwards into the disputed kingdoms of ": null
    },
    {
        "Northumbria": "Northumbria"
    },
    {
        ". At first allied with the southern rulers against the Vikings, Constantine in time came into conflict with them. King ": null
    },
    {
        "Æthelstan": "Athelstan Of England"
    },
    {
        " was successful in securing Constantines submission in 927 and 934, but the two again fought when Constantine, allied with the ": null
    },
    {
        "Strathclyde Britons": "Strathclyde Britons"
    },
    {
        " and the Viking king of ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        ", invaded Æthelstans kingdom in 937, only to be defeated at the great ": null
    },
    {
        "battle of Brunanburh": "Battle Of Brunanburh"
    },
    {
        ". In 943 Constantine abdicated the throne and retired to the ": null
    },
    {
        "Céli Dé": "Céli Dé"
    },
    {
        " monastery of St Andrews": "Church Of St Mary On The Rock"
    },
    {
        " where he died in 952. He was succeeded by his predecessors son ": null
    },
    {
        "Malcolm  I": "Malcolm I Of Scotland"
    },
    {
        " .     Constantines reign of 43 years, exceeded in Scotland only by that of King ": null
    },
    {
        "William the Lion": "William The Lion"
    },
    {
        " before the ": null
    },
    {
        "Union of the Crowns": "Union Of The Crowns"
    },
    {
        " in 1603, is believed to have played a defining part in the ": null
    },
    {
        "gaelicisation": "Gaelicisation"
    },
    {
        " of Pictland, in which his patronage of the Irish Céli Dé monastic reformers was a significant factor. During his reign the words Scots and Scotland  are first used to mean part of what is now ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ". The earliest evidence for the ecclesiastical and administrative institutions which would last until the ": null
    },
    {
        "Davidian Revolution": "Davidian Revolution"
    },
    {
        " also appears at this time.       Compared to neighbouring Ireland and ": null
    },
    {
        "Anglo-Saxon England": "Anglo-Saxon England"
    },
    {
        ", few records of 9th- and 10th-century events in Scotland survive. The main local source from the period is the  Chronicle of the Kings of Alba , a list of kings from Kenneth MacAlpin to ": null
    },
    {
        "Kenneth  II": "Kenneth Ii Of Scotland"
    },
    {
        " . The list survives in the ": null
    },
    {
        "Poppleton Manuscript": "Poppleton Manuscript"
    },
    {
        ", a 13th-century compilation. Originally simply a list of kings with reign lengths, the other details contained in the Poppleton Manuscript version were added in the 10th and 12th centuries. Woolf, Pictland to Alba, pp. 87–93; Dumville, Chronicle of the Kings of Alba . In addition to this, later king lists survive. Anderson, Kings and Kingship, reproduces these lists and discusses their origins. The earliest ": null
    },
    {
        "genealogical": "Genealogical"
    },
    {
        " records of the descendants of Kenneth MacAlpin may date from the end of the 10th century, but their value lies more in their context, and the information they provide about the interests of those for whom they were compiled, than in the unreliable claims they contain. Broun, Irish Identity, pp. 133–164; Woolf, Pictland to Alba, pp. 220–221.     For narrative history the principal sources are the  Anglo-Saxon Chronicle  and the ": null
    },
    {
        "Irish annals": "Irish Annals"
    },
    {
        ". The evidence from ": null
    },
    {
        "charters": "Charter"
    },
    {
        "created in the ": null
    },
    {
        "Kingdom of England": "Kingdom Of England"
    },
    {
        " provides occasional insight into events in northern Britain. Woolf, Pictland to Alba, pp. 2–3, 87–88, and 357–359. While ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        "n ": null
    },
    {
        "sagas": "Sagas"
    },
    {
        " describe events in 10th-century Britain, their value as sources of historical narrative, rather than documents of social history, is disputed. Woolf, Pictland to Alba, pp. 277–285; Ó Corrain, Vikings in Scotland and Ireland ; Sawyer and Sawyer, Medieval Scandinavia, pp. 21–26. Mainland European sources rarely concern themselves with affairs in Britain, and even less commonly with events in northern Britain, but the life of Saint ": null
    },
    {
        "Cathróe of Metz": "Cathróe Of Metz"
    },
    {
        ", a work of ": null
    },
    {
        "hagiography": "Hagiography"
    },
    {
        " written in Germany at the end of the 10th century, provides plausible details of the saints early life in north Britain. MacQuarrie, Saints of Scotland, pp. 199–210.     While the sources for north-eastern Britain, the lands of the kingdom of ": null
    },
    {
        "Northumbria": "Northumbria"
    },
    {
        " and the former Pictland, are limited and late, those for the areas on the ": null
    },
    {
        "Irish Sea": "Irish Sea"
    },
    {
        " and Atlantic coasts—the modern regions of north-west England and all of northern and western Scotland—are non-existent, and ": null
    },
    {
        "archaeology": "Archaeology"
    },
    {
        " and ": null
    },
    {
        "toponymy": "Toponymy"
    },
    {
        " are of primary importance. Woolf, Pictland to Alba, p. 12.               The dominant kingdom in eastern Scotland before the ": null
    },
    {
        "Viking Age": "Viking Age"
    },
    {
        " was the northern ": null
    },
    {
        "Pictish": "Pictish"
    },
    {
        " kingdom of ": null
    },
    {
        "Fortriu": "Fortriu"
    },
    {
        " on the shores of the ": null
    },
    {
        "Moray Firth": "Moray Firth"
    },
    {
        ". By the 9th century, the ": null
    },
    {
        "Gaels": "Gaels"
    },
    {
        " of ": null
    },
    {
        "Dál Riata": "Dál Riata"
    },
    {
        " were subject to the kings of Fortriu of the family of ": null
    },
    {
        "Constantín mac Fergusa": "Constantín Of The Picts"
    },
    {
        " . Constantíns family dominated Fortriu after 789 and perhaps, if Constantín was a kinsman of ": null
    },
    {
        "Óengus I of the Picts": "Óengus I Of The Picts"
    },
    {
        " , from around 730. The dominance of Fortriu came to an end in 839 with a defeat by Viking armies reported by the  Annals of Ulster  in which King ": null
    },
    {
        "Uen": "Uen Of The Picts"
    },
    {
        " of Fortriu and his brother Bran, Constantíns nephews, together with the king of Dál Riata, ": null
    },
    {
        "Áed mac Boanta": "Áed Mac Boanta"
    },
    {
        ", and others almost innumerable were killed. Annals of Ulster, s.a. 838. These deaths led to a period of instability lasting a decade as several families attempted to establish their dominance in Pictland. By around 848 ": null
    },
    {
        "Kenneth MacAlpin": "Kenneth I Of Scotland"
    },
    {
        " had emerged as the winner. Woolf, Pictland to Alba, pp. 57–67 and 93–98; Smyth, Warlords and Holy Men, pp. 180–185; Duncan, Kingship of the Scots, pp. 8–10; Bannerman, Scottish takeover ; Foster, Picts, Gaels and Scots, pp. 107–108.     Later ": null
    },
    {
        "national myth": "National Myth"
    },
    {
        " made Kenneth MacAlpin the creator of the ": null
    },
    {
        "kingdom of Scotland": "Kingdom Of Scotland"
    },
    {
        ", the founding of which was dated from 843, the year in which he was said to have destroyed the Picts and inaugurated a new era. The historical record for 9th-century Scotland is meagre, but the Irish annals and the 10th-century Chronicle of the Kings of Alba agree that Kenneth was a Pictish king, and call him king of the Picts at his death. The same style is used of Kenneths brother ": null
    },
    {
        "Donald  I": "Donald I Of Scotland"
    },
    {
        " and sons ": null
    },
    {
        "Constantine  I": "Constantine I Of Scotland"
    },
    {
        " and ": null
    },
    {
        "Áed": "Áed Of Scotland"
    },
    {
        " . Woolf, Pictland to Alba, pp. 93–117 and 320–322; Broun, Dunkeld ; Duncan, Kingship of the Scots, pp. 13–14; Herbert, Ri Éirenn, Ri Alban ; Dumville, Chronicle of the Kings of Alba , p. 76.     The kingdom ruled by Kenneths descendants—older works used the name ": null
    },
    {
        "House of Alpin": "House Of Alpin"
    },
    {
        " to describe them but descent from Kenneth was the defining factor, Irish sources referring to Clann Cináeda meic Ailpín Woolf, Pictland to Alba, pp. 220–221 and 256–257; Broun, Irish Identity, pp. 173–174 —lay to the south of the previously dominant kingdom of Fortriu, centred in the lands around the ": null
    },
    {
        "River Tay": "River Tay"
    },
    {
        ". The extent of Kenneths nameless kingdom is uncertain, but it certainly extended from the ": null
    },
    {
        "Firth of Forth": "Firth Of Forth"
    },
    {
        " in the south to the ": null
    },
    {
        "Mounth": "Mounth"
    },
    {
        " in the north. Whether it extended beyond the mountainous spine of north Britain—": null
    },
    {
        "Druim Alban": "Druim Alban"
    },
    {
        "—is unclear. The core of the kingdom was similar to the old counties of ": null
    },
    {
        "Mearns": "Kincardineshire"
    },
    {
        ", ": null
    },
    {
        "Forfar": "Forfarshire"
    },
    {
        ", ": null
    },
    {
        "Perth": "Perthshire"
    },
    {
        ", Fife, and ": null
    },
    {
        "Kinross": "Kinross-Shire"
    },
    {
        ". Among the chief ecclesiastical centres named in the records are ": null
    },
    {
        "Dunkeld": "Dunkeld"
    },
    {
        ", probably seat of the bishop of the kingdom, and Cell Rígmonaid . Woolf, Pictland to Alba, pp. 98–101; Driscoll, Alba pp. 33–51; Foster, Picts, Gaels and Scots, pp. 8 fig. 1, 39 fig. 24., and 110–111.     Kenneths son Constantine died in 876, probably killed fighting against a Viking army which had come north from Northumbria in 874. According to the king lists, he was counted the 70th and last king of the Picts in later times. Woolf, Pictland to Alba, pp. 106–116; Swanton, Anglo-Saxon Chronicle, pp. 72–75, s.a. 875. For Constantine as the last Pictish king, the original count being 66 kings, see Woolf, Pictland to Alba, pp. 124–126; Broun, Irish Identity, pp. 168–169; Anderson, Kings and Kingship, pp. 78–79.               In 899 ": null
    },
    {
        "Alfred the Great": "Alfred The Great"
    },
    {
        ", king of ": null
    },
    {
        "Wessex": "Wessex"
    },
    {
        ", died leaving his son ": null
    },
    {
        "Edward the Elder": "Edward The Elder"
    },
    {
        " as ruler of Britain south of the ": null
    },
    {
        "River Thames": "River Thames"
    },
    {
        " and his daughter ": null
    },
    {
        "Æthelflæd": "Æthelflæd"
    },
    {
        " and son-in-law ": null
    },
    {
        "Æthelred": "Æthelred, Ealdorman Of Mercia"
    },
    {
        " ruling the western, English part of ": null
    },
    {
        "Mercia": "Mercia"
    },
    {
        ". The situation in the Danish kingdoms of eastern Britain is less clear. King ": null
    },
    {
        "Eohric": "Eohric Of East Anglia"
    },
    {
        " was probably ruling in ": null
    },
    {
        "East Anglia": "East Anglia"
    },
    {
        ", but no dates can reliably be assigned to the successors of ": null
    },
    {
        "Guthfrith of York": "Guthfrith, King Of York"
    },
    {
        " in Northumbria. It is known that Guthfrith was succeeded by Sigurd and Cnut, although whether these men ruled jointly or one after the other is uncertain. Northumbria may have been divided by this time between the Viking kings in York and the local rulers, perhaps represented by ": null
    },
    {
        "Eadulf": "Eadulf I Of Bernicia"
    },
    {
        ", based at ": null
    },
    {
        "Bamburgh": "Bamburgh"
    },
    {
        " who controlled the lands from the ": null
    },
    {
        "River Tyne": "River Tyne"
    },
    {
        " or ": null
    },
    {
        "River Tees": "River Tees"
    },
    {
        " to the Forth in the north. Keynes, Rulers of the English , pp. 504–505; Woolf, Pictland to Alba, pp. 138–139; Blair, Anglo-Saxon England, pp. 75–79.     In Ireland, ": null
    },
    {
        "Flann Sinna": "Flann Sinna"
    },
    {
        ", married to Constantines aunt Máel Muire, was dominant. The years around 900 represented a period of weakness among the Vikings and ": null
    },
    {
        "Norse-Gaels": "Norse-Gaels"
    },
    {
        " of ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        ". They are reported to have been divided between two rival leaders. In 894 one group left Dublin, perhaps settling on the Irish Sea coast of Britain between the ": null
    },
    {
        "River Mersey": "River Mersey"
    },
    {
        " and the ": null
    },
    {
        "Firth of Clyde": "Firth Of Clyde"
    },
    {
        ". The remaining Dubliners were expelled in 902 by Flann Sinnas son-in-law ": null
    },
    {
        "Cerball mac Muirecáin": "Cerball Mac Muirecáin"
    },
    {
        ", and soon afterwards appeared in western and northern Britain. Annals of Ulster, s.a. 893 and 902; Woolf, Pictland to Alba, pp 131 and 138–139.     To the south-west of Constantines lands lay the ": null
    },
    {
        "kingdom of Strathclyde": "Kingdom Of Strathclyde"
    },
    {
        ". This extended north into the ": null
    },
    {
        "Lennox": "Lennox"
    },
    {
        ", east to the River Forth, and south into the ": null
    },
    {
        "Southern Uplands": "Southern Uplands"
    },
    {
        ". In 900 it was probably ruled by King ": null
    },
    {
        "Dyfnwal": "Dyfnwal I Of Strathclyde"
    },
    {
        ". Woolf, Pictland to Alba, pp. 153–157.     The situation of the Gaelic kingdoms of ": null
    },
    {
        "Dál Riata": "Dál Riata"
    },
    {
        " in western Scotland is uncertain. No kings are known by name after Áed mac Boanta. The ": null
    },
    {
        "Frankish": "Francia"
    },
    {
        "  Annales Bertiniani  may record the conquest of the ": null
    },
    {
        "Inner Hebrides": "Inner Hebrides"
    },
    {
        ", the seaward part of Dál Riata, by Northmen in 849. Woolf, pp. 99–100 and 286–289; Anderson, Early Sources, p. 277. In addition to these, the arrival of new groups of Vikings from northern and western Europe was still commonplace. Whether there were Viking or Norse-Gael kingdoms in the ": null
    },
    {
        "Western Isles": "Western Isles"
    },
    {
        " or the ": null
    },
    {
        "Northern Isles": "Northern Isles"
    },
    {
        " at this time is debated. Woolf, Pictland to Alba, pp. 275–311, especially 286–289; Ó Corrain, Vikings in Scotland and Ireland ; Crawford, Scandinavian Scotland, pp. 39–62; Smyth, Warlords and Holy Men, pp. 141–174.       ": null
    },
    {
        "Áed": "Áed Of Scotland"
    },
    {
        ", Constantines father, succeeded Constantines uncle and namesake ": null
    },
    {
        "Constantine  I": "Constantine I Of Scotland"
    },
    {
        " in 876 but was killed in 878. Áeds short reign is glossed as being of no importance by most king lists. Although the date of his birth is nowhere recorded, Constantine  II cannot have been born any later than the year after his fathers death, that is 879. His name may suggest that he was born a few years earlier, during the reign of his uncle Constantine  I. Woolf, Pictland to Alba, pp. 116–117, 124, and 166, note 84.     After Áeds death, there is a two-decade gap until the death of ": null
    },
    {
        "Donald  II": "Donald Ii Of Scotland"
    },
    {
        " in 900 during which nothing is reported in the Irish annals. Anderson, Early Sources, pp. 357–358 and 395; Woolf, Pictland to Alba, pp. 117–118. The entry for the reign between Áed and Donald  II is corrupt in the Chronicle of the Kings of Alba, and in this case the Chronicle is at variance with every other king list. On this, note Dumvilles comments regarding ": null
    },
    {
        "damnatio memoriae": "Damnatio Memoriae"
    },
    {
        ", Dumville, Chronicle of the Kings of Alba , p. 75; see also Woolf, Pictland to Alba, pp. 117–121. According to the Chronicle, Áed was followed by ": null
    },
    {
        "Eochaid": "Eochaid Of Scotland"
    },
    {
        ", a grandson of Kenneth MacAlpin, who is somehow connected with ": null
    },
    {
        "Giric": "Giric Of Scotland"
    },
    {
        ", but all other lists say that Giric ruled after Áed and make great claims for him. Anderson, Kings and Kingship, pp. 251–252, 254, 263, 267, 274, 283, and 288. Giric is not known to have been a kinsman of Kenneths, although it has been suggested that he was related to him by marriage. The major changes in Pictland which began at about this time have been associated by ": null
    },
    {
        "Alex Woolf": "Alex Woolf"
    },
    {
        " and ": null
    },
    {
        "Archie Duncan": "Archie Duncan"
    },
    {
        " with Girics reign. Duncan, pp. 11–16; Woolf, Pictland to Alba, pp. 117–121, 137–138, and 320–322. For an alternative view of all this, see Smyth, Warlords and Holy Men, pp. 215–218.     Woolf suggests that Constantine and his cousin Donald may have passed Girics reign in exile in Ireland where their aunt Máel Muire was wife of two successive ": null
    },
    {
        "High Kings of Ireland": "High Kings Of Ireland"
    },
    {
        ", ": null
    },
    {
        "Áed Findliath": "Áed Findliath"
    },
    {
        " and ": null
    },
    {
        "Flann Sinna": "Flann Sinna"
    },
    {
        ". Woolf, Pictland to Alba, pp. 122–125. Giric died in 889. If he had been in exile, Constantine may have returned to Pictland where his cousin Donald  II became king. Donalds reputation is suggested by the ": null
    },
    {
        "epithet": "Epithet"
    },
    {
        " dasachtach, a word used of violent madmen and mad bulls, attached to him in the 11th-century writings of ": null
    },
    {
        "Flann Mainistrech": "Flann Mainistrech"
    },
    {
        ", echoed by his description in the  Prophecy of Berchan  as the rough one who will think relics and psalms of little worth . Anderson, Early Sources, pp. cxlix and 397–398. Wars with the Viking kings in Britain and Ireland continued during Donalds reign and he was probably killed fighting yet more Vikings at ": null
    },
    {
        "Dunnottar": "Dunnottar"
    },
    {
        " in the Mearns in 900. Constantine succeeded him as king. Woolf, p. 125; Anderson, Early Sources, pp. 395–398. The account of the conquest of the ": null
    },
    {
        "Kingdom of Strathclyde": "Kingdom Of Strathclyde"
    },
    {
        " in Domnalls time given by, for example, Smyth, Warlords and Holy Men, pp. 217–218, is rejected by Duncan, Kingship of the Scots, p. 40, and Woolf, Pictland to Alba, pp. 152–157.            The earliest event recorded in the Chronicle of the Kings of Alba in Constantines reign is an attack by Vikings and the plundering of Dunkeld and all Albania in his third year. This is the first use of the word Albania, the ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " form of the ": null
    },
    {
        "Old Irish": "Old Irish Language"
    },
    {
        " Alba, in the Chronicle which until then describes the lands ruled by the descendants of Cináed as Pictavia. Woolf, Pictland to Alba, pp. 122–126; Anderson, Early Sources, pp. 444–446, where Albania is translated as Scotland; Broun, Dunkeld .     These Norsemen could have been some of those who were driven out of ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        " in 902, or were the same group who had defeated Domnall in 900. The Chronicle states that the Northmen were killed in Srath Erenn, which is confirmed by the Annals of Ulster which records the death of ": null
    },
    {
        "Ímar grandson of Ímar": "Ímar Ua Ímair"
    },
    {
        " and many others at the hands of the men of Fortriu in 904. This Ímar was the first of the ": null
    },
    {
        "Uí Ímair": "Uí Ímair"
    },
    {
        ", that is the grandsons of Ímar, to be reported; three more grandsons of Ímar appear later in Constantíns reign. The  Fragmentary Annals of Ireland  contain an account of the battle, and this attributes the defeat of the Norsemen to the intercession of Saint ": null
    },
    {
        "Columba": "Columba"
    },
    {
        " following fasting and prayer. An entry in the  Chronicon Scotorum  under the year 904 may possibly contain a corrupted reference to this battle. Woolf, Pictland to Alba, pp. 127–128 and 130–131; Anderson, Early Sources, pp. 398, 399, and 444–446; Annals of Ulster, s.a. 902, 904; Chronicon Scotorum, s.a. 902, 904; Fragmentary Annals, FA 429.     The next event reported by the Chronicle of the Kings of Alba is dated to 906. This records that: King Constantine and Bishop ": null
    },
    {
        "Cellach": "Cellach I Of Cennrígmonaid"
    },
    {
        " met at the Hill of Belief near the royal city of ": null
    },
    {
        "Scone": "Scone, Perth And Kinross"
    },
    {
        " and pledged themselves that the laws and disciplines of the faith, and the laws of churches and gospels, should be kept pariter cum Scottis. After Anderson, Early Sources, p. 445. The meaning of this entry, and its significance, have been the subject of debate.        The phrase pariter cum Scottis in the ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " text of the Chronicle has been translated in several ways. ": null
    },
    {
        "William Forbes Skene": "William Forbes Skene"
    },
    {
        " and ": null
    },
    {
        "Alan Orr Anderson": "Alan Orr Anderson"
    },
    {
        " proposed that it should be read as in conformity with the customs of the Gaels , relating it to the claims in the king lists that Giric liberated the church from secular oppression and adopted Irish customs. Anderson, Early Sources, p. 445, note 1; Woolf, Pictland to Alba, p. 135. This version is followed by Smyth, Warlords and Holy Men, pp. 188–189. It has been read as together with the Gaels , suggesting either public participation or the presence of Gaels from the western coasts as well as the people of the east coast. Driscoll, p. 37, translates the phrase in this way; Woolf, Pictland to Alba, pp. 135–136. Finally, it is suggested that it was the ceremony which followed the custom of the Gaels and not the agreements. Woolf, Pictland to Alba, p. 136; see also Smyth, Warlords and Holy Men, p. 188.     The idea that this gathering agreed to uphold Irish laws governing the church has suggested that it was an important step in the ": null
    },
    {
        "gaelicisation": "Gaelicisation"
    },
    {
        " of the lands east of Druim Alban. Smyth, Warlords and Holy Men, pp. 188–189, writes that it marks the final triumph of the Gaelic order over the old Pictish order . Others have proposed that the ceremony in some way endorsed Constantines kingship, prefiguring later royal inaugurations at Scone. Driscoll, Alba, p. 37; Duncan, Kingship of the Scots, pp. 15–16. Alternatively, if Bishop Cellach was appointed by Giric, it may be that the gathering was intended to heal a rift between king and church. Woolf, Pictland to Alba, pp. 137–138.       Following the events at Scone, there is little of substance reported for a decade. A story in the Fragmentary Annals of Ireland, perhaps referring to events some time after 911, claims that Queen Æthelflæd, who ruled in Mercia, allied with the Irish and northern rulers against the Norsemen on the Irish sea coasts of Northumbria. The Annals of Ulster record the defeat of an Irish fleet from the kingdom of ": null
    },
    {
        "Ulaid": "Ulaid"
    },
    {
        " by Vikings on the coast of England at about this time. Higham, Kingdom of Northumbria, pp. 185–6; Fragmentary Annals of Ireland, FA 429; Annals of Ulster, s.a. 913.     In this period the Chronicle of the Kings of Alba reports the death of ": null
    },
    {
        "Cormac mac Cuilennáin": "Cormac Mac Cuilennáin"
    },
    {
        ", ": null
    },
    {
        "king of Munster": "King Of Munster"
    },
    {
        ", in the eighth year of Constantines reign. The Annals of Ulster states that Cormac died on  908; Woolf, pp. 127–9. This is followed by an undated entry which was formerly read as In his time Domnall king of the Britons died, and Domnall son of Áed was elected . This was thought to record the election of a brother of Constantine named Domnall to the kingship of the Britons of Strathclyde and was seen as early evidence of the domination of Strathclyde by the kings of Alba. The entry in question is now read as ...Dynfwal... and Domnall son Áed ": null
    },
    {
        "king of Ailech": "King Of Ailech"
    },
    {
        " died , this ": null
    },
    {
        "Domnall": "Domnall Dabaill"
    },
    {
        " being a son of ": null
    },
    {
        "Áed Findliath": "Áed Findliath"
    },
    {
        " who died on  915. Domnalls death is recorded by the Annals of Ulster. For the re-reading by Benjamin Hudson, see Woolf, Pictland to Alba, pp. 127–129 and 152–157; Dumville, Chronicle of the Kings of Alba , p. 77. Smyth, Warlords and Holy Men, pp. 222–223, is typical of the interpretation found in older works. The phrase in question reads et Dunenaldus filius Ede elig 7  . Finally, the deaths of Flann Sinna and ": null
    },
    {
        "Niall Glúndub": "Niall Glúndub"
    },
    {
        " are recorded. The Annals of Ulster record the death of Flann on  916 and that of Niall on  919; Woolf, pp. 127–9.     There are more reports of Viking fleets in the ": null
    },
    {
        "Irish Sea": "Irish Sea"
    },
    {
        " from 914 onwards. By 916 fleets under ": null
    },
    {
        "Sihtric Cáech": "Sihtric Cáech"
    },
    {
        " and ": null
    },
    {
        "Ragnall": "Ragnall Ua Ímair"
    },
    {
        ", said to be grandsons of Ímar , were very active in Ireland. Sihtric inflicted a heavy defeat on the armies of ": null
    },
    {
        "Leinster": "Leinster"
    },
    {
        " and retook Dublin in 917. Hart, Sihtric Cáech ; Hart Ragnall ; Woolf, Pictland to Alba, pp. 138–141; Annals of Ulster, s.a. 914–917. The following year Ragnall appears to have returned across the Irish sea intent on establishing himself as king at ": null
    },
    {
        "York": "York"
    },
    {
        ". Woolf, Pictland to Alba, p. 142; Annals of Ulster, s.a. 918. The only precisely dated event in the summer of 918 is the death of Queen Æthelflæd on  918 at ": null
    },
    {
        "Tamworth, Staffordshire": "Tamworth, Staffordshire"
    },
    {
        ". Æthelflæd had been negotiating with the Northumbrians to obtain their submission, but her death put an end to this and her successor, her brother ": null
    },
    {
        "Edward the Elder": "Edward The Elder"
    },
    {
        ", was occupied with securing control of Mercia. Higham, Kingdom of Northumbria, pp. 186–8; Swanton, Anglo-Saxon Chronicle, p. 105, Ms. C, s.a. 918, 919.        The northern part of Northumbria, and perhaps the whole kingdom, had probably been ruled by ": null
    },
    {
        "Ealdred": "Ealdred I Of Bernicia"
    },
    {
        " son of ": null
    },
    {
        "Eadulf": "Eadulf I Of Bernicia"
    },
    {
        " since 913. Keynes, Rulers of the English ; Woolf, Pictland to Alba, pp. 138–141. Faced with Ragnalls invasion, Ealdred came north seeking assistance from Constantine. The two advanced south to face Ragnall, and this led to a battle somewhere on the banks of the ": null
    },
    {
        "River Tyne": "River Tyne"
    },
    {
        ", probably at ": null
    },
    {
        "Corbridge": "Corbridge"
    },
    {
        " where ": null
    },
    {
        "Dere Street": "Dere Street"
    },
    {
        " crosses the river. The ": null
    },
    {
        "Battle of Corbridge": "Battle Of Corbridge"
    },
    {
        " appears to have been indecisive; the Chronicle of the Kings of Alba is alone in giving Constantine the victory. There is disagreement as to whether there was one battle at Corbridge in the 910s or two. The Annals of Ulster, s.a. 918, the Fragmentary Annals of Ireland, and the Chronicle of the Kings of Alba, report only one battle. The idea that there were two rests on the  Historia de Sancto Cuthberto , for which see Anderson, Scottish Annals, p. 64. The question is discussed by Woolf, Pictland to Alba, pp. 142–144; Stenton, Anglo-Saxon England, pp. 332–333.     The report of the battle in the Annals of Ulster says that none of the kings or ": null
    },
    {
        "mormaers": "Mormaer"
    },
    {
        "among the men of Alba were killed. This is the first surviving use of the word mormaer; other than the knowledge that Constantines kingdom had its own bishop or bishops and royal villas, this is the only hint to the institutions of the kingdom. For Mormaers, see Woolf, Pictland to Alba, pp 342–350; Smyth, Warlords and Holy Men, pp. 219–220. For the later institutions of the kingdom of Alba, see      After Corbridge, Ragnall enjoyed only a short respite. In the south, Alfreds son Edward had rapidly secured control of Mercia and had a ": null
    },
    {
        "burh": "Burh"
    },
    {
        " constructed at ": null
    },
    {
        "Bakewell": "Bakewell"
    },
    {
        " in the ": null
    },
    {
        "Peak District": "Peak District"
    },
    {
        " from which his armies could easily strike north. An army from Dublin led by Ragnalls kinsman Sihtric struck at north-western Mercia in 919, but in 920 or 921 Edward met with Ragnall and other kings. The Anglo-Saxon Chronicle states that these king chose Edward as father and lord . Among the other kings present were Constantine, Ealdred son of Eadwulf, and the king of Strathclyde, ": null
    },
    {
        "Owain ap Dyfnwal": "Owain Ap Dyfnwal"
    },
    {
        ". Here, again, a new term appears in the record, the Anglo-Saxon Chronicle for the first time using the word scottas, from which Scots derives, to describe the inhabitants of Constantines kingdom in its report of these events. Stenton, Anglo-Saxon England, pp. 333–335; Swanton, Anglo-Saxon Chronicle, p. 104, Ms. A, s.a. 924; Woolf, Pictland to Alba, pp. 145–147.     Edward died in 924. His realms appear to have been divided with the West Saxons recognising ": null
    },
    {
        "Ælfweard": "Ælfweard Of Wessex"
    },
    {
        " while the Mercians chose ": null
    },
    {
        "Æthelstan": "Æthelstan"
    },
    {
        " who had been raised at Æthelflæds court. Ælfweard died within weeks of his father and Æthelstan was inaugurated as king of all of Edwards lands in 925. Keynes, Rulers of the English , p. 514; Miller, Æthelstan ; Stenton, Anglo-Saxon England, p. 339.       By 926 Sihtric had evidently acknowledged ": null
    },
    {
        "Æthelstan": "Æthelstan"
    },
    {
        " as overlord, adopting Christianity and marrying a sister of Æthelstan at Tamworth. Within the year he appears to have forsaken his new faith and repudiated his wife, but before Æthelstan could respond, Sihtric died suddenly in 927. His kinsman, perhaps brother, ": null
    },
    {
        "Gofraid": "Gofraid Ua Ímair"
    },
    {
        ", who had remained as his deputy in ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        ", came from Ireland to take power in York, but failed. Æthelstan moved quickly, seizing much of Northumbria. In less than a decade, the kingdom of the English had become by far the greatest power in Britain and Ireland, perhaps stretching as far north as the ": null
    },
    {
        "Firth of Forth": "Firth Of Forth"
    },
    {
        ". Higham, Kingdom of Northumbria, pp. 186–190; Stenton, Anglo-Saxon England, pp. 339–340; Woolf, Pictland to Alba, pp.148–151; Swanton, Anglo-Saxon Chronicle, pp. 105 and 107, Ms. D, s.a. 925, 926, Ms. E, F, s.a. 927.     ": null
    },
    {
        "John of Worcesters": "John Of Worcester"
    },
    {
        "chronicle suggests that Æthelstan faced opposition from Constantine, from Owain, and from the Welsh kings. ": null
    },
    {
        "William of Malmesbury": "William Of Malmesbury"
    },
    {
        " writes that Gofraid, together with Sihtrics young son ": null
    },
    {
        "Olaf Cuaran": "Olaf Cuaran"
    },
    {
        " fled north and received refuge from Constantine, which led to war with Æthelstan. A meeting at ": null
    },
    {
        "Eamont Bridge": "Eamont Bridge"
    },
    {
        " on  927 was sealed by an agreement that Constantine, Owain, ": null
    },
    {
        "Hywel Dda": "Hywel Dda"
    },
    {
        ", and Ealdred would renounce all idolatry : that is, they would not ally with the Viking kings. William states that Æthelstan stood godfather to a son of Constantine, probably ": null
    },
    {
        "Indulf": "Indulf Of Scotland"
    },
    {
        " , during the conference. Anderson, Scottish Annals, pp. 66–67; Swanton, Anglo-Saxon Chronicle, p.107, Ms. D, s.a. 926; Stenton, Anglo-Saxon England, pp. 339–340; Woolf, Pictland to Alba, pp 150–152 and 192–193; Smyth, Warlords and Holy Men, pp. 201–202; Miller, Æthelstan .     Æthelstan followed up his advances in the north by securing the recognition of the Welsh kings. Stenton, Anglo-Saxon England, pp. 340–341. For the next seven years, the record of events in the north is blank. Æthelstans court was attended by the Welsh kings, but not by Constantine or Owain. This absence of record means that Æthelstans reasons for marching north against Constantine in 934 are unclear. Woolf, Pictland to Alba, pp. 161–165. The previous year had seen the death of Æthelstans brother ": null
    },
    {
        "Edwin": "Edwin, Son Of Edward The Elder"
    },
    {
        ", perhaps drowned on the kings orders; Swanton, Anglo-Saxon Chronicle, p. 107, Ms. E, s.a. 933 and note 11; Stenton, Anglo-Saxon England, pp. 355–356. The following year Gofraid died and was succeeded by his son Amlaíb, Constantines son-in-law; Annals of Ulster, s.a. 934. Finally, the Annals of Clonmacnoise report the death of Adulf mcEtulfe, king of the North Saxons in the same year as Æthelstans campaign; Woolf suggests that this represents Ealdred, or some other son of Eadulf, ruling in Northumbria.     Æthelstans campaign is reported in brief by the Anglo-Saxon Chronicle, and later chroniclers such as John of Worcester, William of Malmesbury, ": null
    },
    {
        "Henry of Huntingdon": "Henry Of Huntingdon"
    },
    {
        ", and ": null
    },
    {
        "Symeon of Durham": "Symeon Of Durham"
    },
    {
        " add detail to that bald account. Æthelstans army began gathering at ": null
    },
    {
        "Winchester": "Winchester"
    },
    {
        " by  934, and travelled north to ": null
    },
    {
        "Nottingham": "Nottingham"
    },
    {
        " by . He was accompanied by many leaders, including the Welsh kings Hywel Dda, Idwal Foel, and Morgan ab Owain. From Mercia the army continued to ": null
    },
    {
        "Chester-le-Street": "Chester-Le-Street"
    },
    {
        ", before resuming the march accompanied by a fleet of ships. Owain was defeated and Symeon states that the army went as far north as Dunnottar and Fortriu, while the fleet is said to have raided ": null
    },
    {
        "Caithness": "Caithness"
    },
    {
        ", by which a much larger area, including ": null
    },
    {
        "Sutherland": "Sutherland"
    },
    {
        ", is probably intended. It is unlikely that Constantines personal authority extended so far north, so the attacks were probably directed at his allies, comprising simple looting expeditions. Swanton, Anglo-Saxon Chronicle, p. 107, Ms. D, s.a. 934; Anderson, Scottish Annals, pp. 67–69; Miller, Æthelstan ; Stenton, Anglo-Saxon England, p. 342; Woolf, Pictland to Alba, pp. 160–166; Smyth, Warlords and Holy Men, p. 203.     The  Annals of Clonmacnoise  state that the Scottish men compelled to return without any great victory , while Henry of Huntingdon claims that the English faced no opposition. A negotiated settlement might have ended matters: according to John of Worcester, a son of Constantine was given as a hostage to Æthelstan and Constantine himself accompanied the English king on his return south. He witnessed a charter with Æthelstan at ": null
    },
    {
        "Buckingham": "Buckingham"
    },
    {
        " on  934 in which he is described as subregulus, that is a king acknowledging Æthelstans overlordship. Anderson, Early Sources, p. 426; Anderson, Scottish Annals, pp. 67–69; Woolf, Pictland to Alba, pp. 166–168;  The following year, Constantine was again in England at Æthelstans court, this time at ": null
    },
    {
        "Cirencester": "Cirencester"
    },
    {
        " where he appears as a witness, as the first of several subject kings, followed by Owain and Hywel Dda, who subscribed to the diploma. Woolf, Pictland to Alba, pp. 166–168; only a part of this charter survives, see  At Christmas of 935, Owain was once more at Æthelstans court along with the Welsh kings, but Constantine was not. His return to England less than two years later would be in very different circumstances. Woolf, Pictland to Alba, pp. 167–168.       Following his departure from Æthelstans court after 935, there is no further report of Constantine until 937. In that year, together with Owain and ": null
    },
    {
        "Olaf Guthfrithson": "Olaf Iii Guthfrithson"
    },
    {
        " of Dublin, Constantine invaded England. The resulting ": null
    },
    {
        "battle of Brunanburh": "Battle Of Brunanburh"
    },
    {
        "—Dún Brunde—is reported in the Annals of Ulster as follows: a great battle, lamentable and terrible was cruelly fought... in which fell uncounted thousands of the Northmen.   ...And on the other side, a multitude of Saxons fell; but Æthelstan, the king of the Saxons, obtained a great victory. Anderson, Early Sources, pp. 428–9; Annals of Ulster, s.a. 937. The battle was remembered in England a generation later as the Great Battle . When reporting the battle, the Anglo-Saxon Chronicle abandons its usual terse style in favour of a heroic poem vaunting the great victory. In this the hoary Constantine, by now around 60 years of age, is said to have lost a son in the battle, a claim which the Chronicle of the Kings of Alba confirms. The Annals of Clonmacnoise give his name as Cellach. For all its fame, the site of the battle is uncertain and several sites have been advanced, with ": null
    },
    {
        "Bromborough": "Bromborough"
    },
    {
        " on the ": null
    },
    {
        "Wirral": "Wirral Peninsula"
    },
    {
        " the most favoured location. Swanton, Anglo-Saxon Chronicle, pp. 106–10, Ms. A, s.a. 937; Anderson, Scottish Annals, pp. 69–73; Anderson, Early Sources, p. 429; Woolf, Pictland to Alba, 168–73; Smyth, Warlords and Holy Men, pp. 203–4; Stenton, Anglo-Saxon England, pp. 342–3; Scragg, Battle of Brunanburh .     Brunanburh, for all that it had been a famous and bloody battle, settled nothing. On  939 Æthelstan, the pillar of the dignity of the western world in the words of the Annals of Ulster, died at ": null
    },
    {
        "Malmesbury": "Malmesbury"
    },
    {
        ". He was succeeded by his brother ": null
    },
    {
        "Edmund": "Edmund I Of England"
    },
    {
        ", then aged 18. Æthelstans realm, seemingly made safe by the victory of Brunanburh, collapsed in little more than a year from his death when Amlaíb returned from Ireland and seized Northumbria and the Mercian Danelaw. Edmund spent the remainder of Constantíns reign rebuilding his kingdom. Woolf, Pictland to Alba, p. 174; Stenton, Anglo-Saxon England, pp. 356–9; Higham, Kingdom of Northumbria, p. 193; Blair, Anglo-Saxon England, pp. 87–9.     For Constantines last years as king there is only the meagre record of the Chronicle of the Kings of Alba. The death of Æthelstan is reported, as are two others. The first of these, in 938, is that of ": null
    },
    {
        "Dubacan": "Dubacan Of Angus"
    },
    {
        ", ": null
    },
    {
        "mormaer of Angus": "Mormaer Of Angus"
    },
    {
        " or son of the mormaer. Unlike the report of 918, on this occasion the title mormaer is attached to a geographical area, but it is unknown whether the Angus of 938 was in any way similar to the later mormaerdom or earldom. Woolf, Pictland to Alba, pp. 175, 211–2. The second death, entered with that of Æthelstan, is that of Eochaid mac Ailpín, who might, from his name, have been a kinsman of Constantín. Woolf, Pictland to Alba, p. 175.       By the early 940s Constantine was an old man in his late sixties or seventies. The kingdom of Alba was too new to be said to have a customary rule of succession, but Pictish and Irish precedents favoured an adult successor descended from Kenneth MacAlpin. Constantines surviving son ": null
    },
    {
        "Indulf": "Indulf Of Scotland"
    },
    {
        ", probably baptised in 927, would have been too young to be a serious candidate for the kingship in the early 940s, and the obvious heir was Constantines nephew, ": null
    },
    {
        "Malcolm I": "Malcolm I Of Scotland"
    },
    {
        ". As Malcolm was born no later than 901, by the 940s he was no longer a young man, and may have been impatient. Willingly or not—the 11th-century  Prophecy of Berchán , a verse history in the form of a supposed prophecy, states that it was not a voluntary decision—Constantine abdicated in 943 and entered a monastery, leaving the kingdom to Malcolm. Woolf, Pictland to Alba, p. 175; Anderson, Early Sources, pp. 444–448; Broun, Constantine  II .     Although his retirement might have been involuntary, the Life of ": null
    },
    {
        "Cathróe of Metz": "Cathróe Of Metz"
    },
    {
        " and the Prophecy of Berchán portray Constantine as a devout king. The monastery which Constantine retired to, and where he is said to have been ": null
    },
    {
        "abbot": "Abbot"
    },
    {
        ", was probably that of ": null
    },
    {
        "St Andrews": "Church Of St Mary On The Rock"
    },
    {
        ". This had been refounded in his reign and given to the reforming ": null
    },
    {
        "Céli Dé": "Céli Dé"
    },
    {
        " movement. The Céli Dé were subsequently to be entrusted with many monasteries throughout the kingdom of Alba until replaced in the 12th century by new orders imported from France. Anderson, Early Sources, pp. 431–444; Broun, Constantine  II ; Woolf, Pictland to Alba, p. 175; MacQuarrie, Saints of Scotland, pp. 199–210. The Prophecy of Berchán describes Constantines fair, long reign as a time with fruit upon slender branches, with ale, with music, with good cheer; with corn, with milk, with nimble cattle; with pride, with fortune, with ; Anderson, Early Sources, pp. 447–448.     Seven years later the Chronicle of the Kings of Alba says: plundered the English as far as the ": null
    },
    {
        "river Tees": "River Tees"
    },
    {
        ", and he seized a multitude of people and many herds of cattle: and the Scots called this the raid of Albidosorum, that is, Nainndisi. But others say that Constantine made this raid, asking of the king, Malcolm, that the kingship should be given to him for a weeks time, so that he could visit the English. In fact, it was Malcolm who made the raid, but Constantine incited him, as I have said. Anderson, Early Sources, pp. 452–453. Woolf suggests that the association of Constantine with the raid is a late addition, one derived from a now-lost saga or poem. Woolf, Pictland to Alba, pp. 178–181.     Constantines death in 952 is recorded by the Irish annals, who enter it among ecclesiastics. His son Indulf would become king on Malcolms death. The last of Constantines certain descendants to be king in Alba was a great-grandson, ": null
    },
    {
        "Constantine  III": "Constantine Iii Of Scotland"
    },
    {
        " . Another son had died at Brunanburh, and, according to John of Worcester, Amlaíb mac Gofraid was married to a daughter of Constantine. It is possible that Constantine had other children, but like the name of his wife, or wives, this has not been recorded. Woolf, Pictland to Alba, pp. 171, 175, and 177; Duncan, Kingship of the Scots, p. 345, table A; Anderson, Early Sources, p. 451.     The form of kingdom which appeared in Constantines reign continued in much the same way until the ": null
    },
    {
        "Davidian Revolution": "Davidian Revolution"
    },
    {
        " in the 12th century. As with his ecclesiastical reforms, his political legacy was the creation of a new form of Scottish kingship that lasted for two centuries after his death. Broun, Constantine  II . The nature of that kingdom is, however, still a matter of debate, see Woolf, Pictland to Alba, pp. 342–350; .       ": null
    }
]