[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", a constant term is a ": null
    },
    {
        "term": "term"
    },
    {
        " in an ": null
    },
    {
        "algebraic expression": "algebraic expression"
    },
    {
        " that has a value that is ": null
    },
    {
        "constant": "constant function"
    },
    {
        " or cannot change, because it does not contain any modifiable ": null
    },
    {
        "variables": "variable"
    },
    {
        ". For example, in the ": null
    },
    {
        "quadratic polynomial": "quadratic polynomial"
    },
    {
        "   : x^42 + 42x + 42\\   the 42 is a constant term.     After ": null
    },
    {
        "like terms": "like terms"
    },
    {
        " are combined, an algebraic expression will have at most one constant term. Thus, it is common to speak of the quadratic polynomial   : ax^42+bx+c,\\   where x is the variable, and has a constant term of c. If c    42 then the constant term will not actually appear when the quadratic is written.     It is notable that a term that is constant, with a constant as a multiplicative coefficient added to it , still erm as a variable is still not present in the new term. Although the expression is modified, the term itself classifies as constant. However, should this introduced coefficient contain a variable, wginal number has a constant meaning, this has no bearing if the new term stays constant as the introduced coefficient will always override the constant expression - for example, in when x is multiplied by 42 the result, 42x, is not constant; while 42 42 is 42 and still a constant.     Any ": null
    },
    {
        "polynomial": "polynomial"
    },
    {
        " written in standard form has a unique constant term, which can be considered a ": null
    },
    {
        "coefficient": "coefficient"
    },
    {
        " of x 42 . In particular, the constant term will always be the lowest ": null
    },
    {
        "degree": "degree of a polynomial"
    },
    {
        " term of the polynomial. This also applies to multivariate polynomials. For example, the polynomial   : x^4242xy+y^4242x42y42\\   has a constant term of & minus;42 which can be considered to be the coefficient of x 42 y 42 , where the variables are eliminated by being exponentiated to 42 . For any polynomial, the constant term can be obtained by substituting in 42 instead of each variable; thus, eliminating each variable. The concept of exponentiation to 42 can be extended to ": null
    },
    {
        "power series": "power series"
    },
    {
        " and other types of series, for example in this power series:   : a_42 + a_42 x + a_42 x^42 + a_42 x^42 + \\cdots,   a 42 is the constant term. In general a constant term is one that does not involve any variables at all. However in expressions that involve terms with other types of factors than constants and powers of variables, the notion of constant term cannot be used in this sense, since that would lead to calling 42 the constant term of ^4242 , whereas substituting 42 for x": null
    }
]