[
    {
        "           Consort Qi , also known as Lady Qi, was a consort of ": null
    },
    {
        "Emperor Gaozu": "emperor gaozu of han"
    },
    {
        ", founder of the ": null
    },
    {
        "Han dynasty": "han dynasty"
    },
    {
        ".          Qi was born in ": null
    },
    {
        "Dingtao": "dingtao"
    },
    {
        ", ": null
    },
    {
        "Shandong": "shandong"
    },
    {
        ". She bore ": null
    },
    {
        "Emperor Gaozu": "emperor gaozu of han"
    },
    {
        " a son ": null
    },
    {
        "Liu Ruyi": "liu ruyi"
    },
    {
        ", who was later installed as Prince of ": null
    },
    {
        "Zhao": "zhao"
    },
    {
        ". Gaozu felt that the crown prince ": null
    },
    {
        "Liu Ying": "emperor hui of han"
    },
    {
        " was an unsuitable heir to his throne. He tried several times, fruitlessly, to replace Liu Ying with Liu Ruyi, as his desire was objected to by Liu Yings mother ": null
    },
    {
        "Empress Lü Zhi": "empress lü zhi"
    },
    {
        ". Because of this, Lü Zhi hated Qi deeply. Nevertheless, Gaozu ordered Liu Ruyi to proceed to his ": null
    },
    {
        "principality of Zhao": "zhao"
    },
    {
        "  on his deathbed. Qi did not accompany Liu Ruyi.     Lü Zhi, now declared the ": null
    },
    {
        "empress dowager": "empress dowager"
    },
    {
        " when her son Liu Ying succeeded to the throne as Emperor Hui after Gaozus death, commenced an inhumane plot against Qi and Liu Ruyi. She first had Qi arrested and treated her like a convict . She then summoned Liu Ruyi to the capital ": null
    },
    {
        "Changan": "changan"
    },
    {
        " in an attempt that was initially resisted by Liu Ruyis chief of staff ": null
    },
    {
        "Zhou Chang": "zhou chang"
    },
    {
        " , whom she respected because he was one of the officials who insisted on Liu Ying being the rightful heir. Instead of directly moving against Zhou Chang and Liu Ruyi, Lü Zhi circumvented Zhou by first summoning him to Changan, and then summoning Liu Ruyi. She then consummated her plot to put Qi and Liu Ruyi to death, which was documented in Volume 42 of the historical text  Records of the Grand Historian  as follows:     ::Emperor Xiaohui kept King of Zhao by his side in the palace and checked for poison in any aliment delivered to him. Emperor Xiaohui also brought Liu Ruyi with him wherever he went. In one early morning in the twelfth month of the first year of Emperor Xiaohui, the emperor went on a hunting trip; this time King of Zhao was left alone because he could not wake up early. Emperor Xiaohui supposed his mother would not plot against King of Zhao as several months had passed without any occurrence. Nevertheless, Empress Dowager had an assassin force venom down King of Zhaos throat....She then had Concubine Qis limbs chopped off, blinded her by gouging out her eyes, cut off her tongue, cut off her nose, cut off her ears, forced her to drink a potion that made her mute, made her dumb with toxins, and locked her in the pigsty, and called her a Human Swine . Several days after, Emperor Xiaohui saw the Human Swine , and after realising who the Human Swine was, the emperor was so sick of his mothers cruelty that he virtually relinquished his authority and indulged in carnal pleasures.     Both Qi and her son died in the first year of Emperor Huis reign.          According to Xijing Zaji by Hong Ge, Qi had a maid named Jia Peilan who escaped and later married to a commoner named Duan Ru from ": null
    },
    {
        "Fufeng Prefecture": "fufeng"
    },
    {
        " . She described Qi as a very beautiful woman, a great songwriter and ": null
    },
    {
        "weiqi": "go"
    },
    {
        " player. On the fourth day of the eighth ": null
    },
    {
        "lunar month": "lunar month"
    },
    {
        " every year, Qi would play a weiqi game with ": null
    },
    {
        "Emperor Gaozu": "emperor gaozu of han"
    },
    {
        " in the bamboo forest on the north side of the palace. The winner would make a wish that they believed to come true, while the loser would suffer from illness for the year; however loser can avoid this bad luck by cutting off a strand of hair and praying to the ": null
    },
    {
        "North Star": "north star"
    },
    {
        ".     Qi won every year and wished for good fortune for the Han Dynasty.     Jia Peilan is credited in passing out ": null
    },
    {
        "Han Dynasty": "han dynasty"
    },
    {
        " court customs of ": null
    },
    {
        "Double Ninth Festival": "double ninth festival"
    }
]