[
    {
        "                 A context menu  is a ": null
    },
    {
        "menu": "Menu"
    },
    {
        " in a ": null
    },
    {
        "graphical user interface": "Graphical User Interface"
    },
    {
        " that appears upon user interaction, such as a right-click ": null
    },
    {
        "mouse operation": "Mouse Operation"
    },
    {
        ". A context menu offers a limited set of choices that are available in the current state, or context, of the operating system or application to which the menu belongs. Usually the available choices are actions related to the ": null
    },
    {
        "selected object": "Selection"
    },
    {
        ". From a technical point of view, such a context menu is a ": null
    },
    {
        "graphical control element": "Graphical Control Element"
    },
    {
        ".       Context menus first appeared in the ": null
    },
    {
        "Smalltalk": "Smalltalk"
    },
    {
        " environment on the ": null
    },
    {
        "Xerox Alto": "Xerox Alto"
    },
    {
        " computer, where they were called pop-up menus; they were invented by ": null
    },
    {
        "Dan Ingalls": "Dan Ingalls"
    },
    {
        " in the mid-1970s.       ": null
    },
    {
        "Microsoft Office": "Microsoft Office"
    },
    {
        " v3.0 introduced the context menu for copy and paste functionality in 1990. Borland demonstrated extensive use of the context menu in 1991 at the Second Paradox Conference in Phoenix Arizona. ": null
    },
    {
        "Lotus 1-2-3": "Lotus 1-2-3"
    },
    {
        "/G for ": null
    },
    {
        "OS/2": "Os/2"
    },
    {
        " v1.0 added additional formatting options in 1991. Borland ": null
    },
    {
        "Quattro Pro": "Quattro Pro"
    },
    {
        " for Windows v1.0 introduced the Properties context menu option in 1992.       Context menus are opened via various forms of user interaction that target a region of the GUI that supports context menus. The specific form of user interaction and the means by which a region is targeted vary:     On a computer running ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        ", ": null
    },
    {
        "macOS": "Macos"
    },
    {
        ", or ": null
    },
    {
        "Unix": "Unix"
    },
    {
        " running the ": null
    },
    {
        "X Window System": "X Window System"
    },
    {
        ", clicking the secondary mouse button opens a context menu for the region that is under the mouse pointer.   On systems that support one-button mice, context menus are typically opened by pressing and holding the primary mouse button  or by pressing a keyboard/mouse button combination . A keyboard alternative for macOS is to enable ": null
    },
    {
        "Mouse keys": "Mouse Keys"
    },
    {
        " in ": null
    },
    {
        "Universal Access": "Universal Access"
    },
    {
        ". Then, depending on whether a laptop or compact or extended keyboard type is used, the shortcut is ++5 or +5 or ++i .   On systems with a ": null
    },
    {
        "multi-touch": "Multi-Touch"
    },
    {
        " interface such as MacBook or Surface, the context menu can be opened by pressing or tapping with two fingers instead of just one.     Windows mouse click behavior is such that the context menu doesnt open while the mouse button is pressed, but only opens the menu when the button is released, so the user has to click again to select a context menu item. This behavior differs from that of macOS and most free software GUIs.   In Microsoft Windows, pressing the ": null
    },
    {
        "Application key": "Menu Key"
    },
    {
        " or Shift+F10 opens a context menu for the region that has ": null
    },
    {
        "focus": "Focus"
    },
    {
        ".     Context menus are sometimes hierarchically organized, allowing navigation through different levels of the menu structure. The implementations differ: ": null
    },
    {
        "Microsoft Word": "Microsoft Word"
    },
    {
        " was one of the first applications to only show sub-entries of some menu entries after clicking an arrow icon on the context menu, otherwise executing an action associated with the parent entry. This makes it possible to quickly repeat an action with the parameters of the previous execution, and to better separate options from actions.       The following ": null
    },
    {
        "window managers": "Window Manager"
    },
    {
        "provide context menu functionality:     ": null
    },
    {
        "9wm": "9Wm"
    },
    {
        " IceWM": "Icewm"
    },
    {
        "—": null
    },
    {
        "middle-click": "Middle-Click"
    },
    {
        " and ": null
    },
    {
        "right-click": "Right-Click"
    },
    {
        " context menus on ": null
    },
    {
        "desktop": "Desktop Environment"
    },
    {
        ", ": null
    },
    {
        "menubar": "Menubar"
    },
    {
        ". ": null
    },
    {
        "titlebar": "Titlebar"
    },
    {
        "s, and ": null
    },
    {
        "titleicon": "Titleicon"
    },
    {
        " olwm": "Olwm"
    },
    {
        " openbox": "Openbox"
    },
    {
        " sawfish": "Sawfish"
    },
    {
        "       Context menus have received some criticism from ": null
    },
    {
        "usability": "Usability"
    },
    {
        " analysts when improperly used, as some applications make certain features only available in context menus, which may confuse even experienced users .     Context menus usually open in a fixed position under the ": null
    },
    {
        "pointer": "Elements Of Graphical User Interfacespointer"
    },
    {
        ", but when the pointer is near a screen edge the menu will be displaced - thus reducing consistency and impeding use of ": null
    },
    {
        "muscle memory": "Muscle Memory"
    },
    {
        ". If the context menu is being triggered by keyboard, such as by using Shift + F10, the context menu appears near the focused widget instead of the position of the pointer, to save recognition efforts.       Microsofts guidelines call for always using the term context menu, and explicitly deprecate shortcut menu. ": null
    }
]