[
    {
        "   Conventional warfare is a form of ": null
    },
    {
        "warfare": "warfare"
    },
    {
        " conducted by using ": null
    },
    {
        "conventional weapons": "conventional weapon"
    },
    {
        "and ": null
    },
    {
        "battlefield tactics": "battlefield tactics"
    },
    {
        " between two or more ": null
    },
    {
        "states": "sovereign state"
    },
    {
        "in open confrontation. The forces on each side are well-defined, and fight using weapons that primarily target the opponents military. It is normally fought using conventional weapons, and not with ": null
    },
    {
        "chemical": "chemical weapons"
    },
    {
        ", ": null
    },
    {
        "biological": "biological weapons"
    },
    {
        ", or ": null
    },
    {
        "nuclear weapons": "nuclear weapons"
    },
    {
        ".     The general purpose of conventional warfare is to weaken or destroy the opponents military, thereby negating its ability to engage in conventional warfare. In forcing ": null
    },
    {
        "capitulation": "capitulation"
    },
    {
        ", however, one or both sides may eventually resort to ": null
    },
    {
        "unconventional warfare": "unconventional warfare"
    },
    {
        " tactics.            The state was first advocated by ": null
    },
    {
        "Plato": "plato"
    },
    {
        ", then found more acceptance in the consolidation of power under the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ". European monarchs then gained power as the Catholic Church was stripped of temporal power and was replaced by the ": null
    },
    {
        "divine right of kings": "divine right of kings"
    },
    {
        ". In 1648, the powers of ": null
    },
    {
        "Europe": "europe"
    },
    {
        " signed the ": null
    },
    {
        "Treaty of Westphalia": "treaty of westphalia"
    },
    {
        " which ended the religious violence for purely political governance and outlook, signifying the birth of the modern state.     Within this statist paradigm, only the state and its appointed representatives were allowed to bear ": null
    },
    {
        "arms": "weapon"
    },
    {
        " and enter into war. In fact, war was only understood as a conflict between sovereign states. ": null
    },
    {
        "Kings": "monarch"
    },
    {
        "strengthened this idea and gave it the force of ": null
    },
    {
        "law": "law"
    },
    {
        ". Whereas previously any ": null
    },
    {
        "noble": "nobility"
    },
    {
        " could start a war, the monarchs of Europe of necessity consolidated military power in response to the ": null
    },
    {
        "Napoleonic war": "napoleonic war"
    },
    {
        ".         ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " was one country attempting to amass military power. ": null
    },
    {
        "Carl von Clausewitz": "carl von clausewitz"
    },
    {
        ", one of Prussias officers, wrote  On War , a work rooted solely in the world of the state. All other forms of intrastate conflict, such as ": null
    },
    {
        "rebellion": "rebellion"
    },
    {
        ", are not accounted for because in theoretical terms, Clausewitz could not account for warfare before the state. However, near the end of his life, Clausewitz grew increasingly aware of the importance of non-state military actors. This is revealed in his conceptions of the people in arms which he noted arose from the same social and political sources as traditional inter-state warfare. Smith, M.L.R. Guerrillas in the mist: reassessing strategy and low intensity warfare . Review of International Studies. Vol. 29, 19–37. 2003     Practices such as ": null
    },
    {
        "raiding": "raid"
    },
    {
        " or ": null
    },
    {
        "blood feuds": "feud"
    },
    {
        " were then labeled criminal activities and stripped of ": null
    },
    {
        "legitimacy": "legitimacy"
    },
    {
        ". This war paradigm reflected the view of most of the modernized world at the beginning of the 21st century, as verified by examination of the conventional armies of the time: large, high maintenance, technologically advanced armies designed to compete against similarly designed forces.     Clausewitz also forwarded the issue of ": null
    },
    {
        "casus belli": "casus belli"
    },
    {
        ". While previous wars were fought for social, religious, or even cultural reasons, Clausewitz taught that war is merely a continuation of politics by other means. It is a rational calculation in which states fight for their interests once normal discourse has broken down.       The majority of modern wars have been conducted using the means of conventional warfare. Confirmed use of ": null
    },
    {
        "biological warfare": "biological warfare"
    },
    {
        " by a nation state has not occurred since 1945, and ": null
    },
    {
        "chemical warfare": "chemical warfare"
    },
    {
        " has been used only a few times . ": null
    },
    {
        "Nuclear warfare": "nuclear warfare"
    },
    {
        " has only occurred once with the ": null
    },
    {
        "United States": "united states"
    },
    {
        " bombing": "atomic bombings of hiroshima and nagasaki"
    },
    {
        " the ": null
    },
    {
        "Japan": "japan"
    },
    {
        "ese cities of ": null
    },
    {
        "Hiroshima": "hiroshima"
    },
    {
        " and ": null
    },
    {
        "Nagasaki": "nagasaki"
    },
    {
        " in August 1945.          The state and Clausewitzian principles peaked in the ": null
    },
    {
        "World Wars": "world war"
    },
    {
        "of the 20th century, but also laid the groundwork for their dilapidation due to ": null
    },
    {
        "nuclear proliferation": "nuclear proliferation"
    },
    {
        " and the manifestation of culturally aligned conflict. The nuclear bomb was the result of the state perfecting its quest to overthrow its competitive duplicates. This development seems to have pushed conventional conflict waged by the state to the sidelines. Were two conventional armies to fight, the loser would have redress in its nuclear arsenal.     Thus, no two ": null
    },
    {
        "nuclear powers": "nuclear powers"
    },
    {
        " have yet fought a conventional war ": null
    },
    {
        "directly": "proxy war"
    },
    {
        ", with the exception of two brief skirmishes between, China and Russia in the 1969 ": null
    },
    {
        "Sino-Soviet conflict": "sino-soviet conflict"
    },
    {
        " and between ": null
    },
    {
        "India": "india"
    },
    {
        " and ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        " in the 1999 ": null
    },
    {
        "Kargil War": "kargil war"
    },
    {
        ".       With the invention of ": null
    },
    {
        "nuclear weapons": "nuclear weapons"
    },
    {
        ", the concept of full-scale war carries the prospect of ": null
    },
    {
        "global annihilation": "global annihilation"
    },
    {
        ", and as such conflicts since WWII have by definition been low intensity conflicts,  typically in the form of ": null
    },
    {
        "proxy wars": "proxy war"
    },
    {
        "fought within local regional confines, using what are now referred to as ": null
    },
    {
        "conventional weapons": "conventional weapons"
    },
    {
        " , typically combined with the use of ": null
    },
    {
        "asymmetric warfare": "asymmetric warfare"
    },
    {
        " tactics and applied use of ": null
    },
    {
        "intelligence": "intelligence"
    },
    {
        ".     ": null
    },
    {
        "Samuel Huntington": "samuel p. huntington"
    },
    {
        " has posited that the world in the early 21st century exists as a system of nine distinct civilizations , instead of many ": null
    },
    {
        "sovereign state": "sovereign state"
    },
    {
        "s. These civilizations are delineated along cultural lines . In this way, cultures that have long been dominated by the West are reasserting themselves and looking to challenge the status quo. Thus, culture has replaced the state as the locus of war. This kind of civilizational war, in our time as in times long past, occurs where these cultures buffet up against one another. Some high-profile examples are the Pakistan/India conflict or the battles in the Sudan. This sort of war has defined the field since World War II.     These cultural forces will not contend with state-based armies in the traditional way. When faced with battalions of tanks, jets, and missiles, the cultural opponent dissolves away into the population. They benefit from the territorially constrained states, being able to move freely from one country to the next, while states must negotiate with other sovereign states. The states spy networks are also severely limited by this mobility not constrained by state borders. ": null
    }
]