[
    {
        "                The Coptic Orthodox Church of Alexandria  is an ": null
    },
    {
        "Oriental Orthodox": "oriental orthodoxy"
    },
    {
        " Christian": "christianity"
    },
    {
        " church": "christian denomination"
    },
    {
        " based in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", ": null
    },
    {
        "Africa": "africa"
    },
    {
        " and the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ". The head of the Church and the ": null
    },
    {
        "See": "apostolic see"
    },
    {
        " of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " is the ": null
    },
    {
        "Patriarch of Alexandria on the Holy See of Saint Mark": "pope of the coptic orthodox church of alexandria"
    },
    {
        ", who also carries the title of Coptic Pope. The See of Alexandria is titular, and today the Coptic Pope presides from ": null
    },
    {
        "Saint Marks Coptic Orthodox Cathedral": "saint marks coptic orthodox cathedral"
    },
    {
        " in the ": null
    },
    {
        "Abbassia": "abbassia"
    },
    {
        " District in ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        ". The church follows the ": null
    },
    {
        "Alexandrian Rite": "alexandrian rite"
    },
    {
        " for its liturgy, prayer and devotional patrimony. With 18–22 million members worldwide, whereof about 15 to 20 million are in Egypt,  it is the countrys largest Christian church.     According to its tradition, the Coptic Church was established by ": null
    },
    {
        "Saint Mark": "st. mark the evangelist"
    },
    {
        ", an ": null
    },
    {
        "apostle": "apostles"
    },
    {
        " and ": null
    },
    {
        "evangelist": "four evangelists"
    },
    {
        ", during the middle of the 1st century . ": null
    },
    {
        "Eusebius of Caesarea": "eusebius of caesarea"
    },
    {
        ", the author of  Ecclesiastical History  in the 4th century, states that Saint Mark came to Egypt in the first or third year of the reign of Emperor Claudius, i.e. AD  41 or 43  Due to disputes concerning the ": null
    },
    {
        "nature of Christ": "hypostatic union"
    },
    {
        ", it split from the rest of the Christendom after the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        " in AD  451, resulting in a rivalry with the ": null
    },
    {
        "Byzantine Orthodox Church": "greek orthodox patriarchate of alexandria and all africa"
    },
    {
        ". In the 4–7th centuries the Coptic Church gradually expanded due to the ": null
    },
    {
        "Christianization": "christianization"
    },
    {
        " of the ": null
    },
    {
        "Aksumite empire": "aksumite kingdom"
    },
    {
        " and of two of the three ": null
    },
    {
        "Nubian": "nubians"
    },
    {
        " kingdoms, ": null
    },
    {
        "Nobatia": "nobatia"
    },
    {
        " and ": null
    },
    {
        "Alodia": "alodia"
    },
    {
        ", while the third Nubian kingdom, ": null
    },
    {
        "Makuria": "makuria"
    },
    {
        ", recognized the Coptic patriarch after initially being aligned to the Byzantine Orthodox Church.     After AD  639 Egypt was ruled by its ": null
    },
    {
        "Islam": "islam"
    },
    {
        "ic conquerors from ": null
    },
    {
        "Arabia": "arabia"
    },
    {
        ", and the treatment of the Coptic Christians ranged from tolerance to open persecution. In the 12th century, the church relocated its seat from Alexandria to Cairo. The same century also saw the Copts become a religious minority. During the 14th and 15th centuries, Nubian Christianity was supplanted by Islam.     In 1959, the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        " was granted ": null
    },
    {
        "autocephaly": "autocephaly"
    },
    {
        " or independence. This was extended to the ": null
    },
    {
        "Eritrean Orthodox Tewahedo Church": "eritrean orthodox tewahedo church"
    },
    {
        " in 1998 following the successful ": null
    },
    {
        "Eritrean War of Independence": "eritrean war of independence"
    },
    {
        " from ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        ".     Since the ": null
    },
    {
        "Arab Spring in 2011": "egyptian revolution of 2011"
    },
    {
        ", the Copts have been suffering increased religious discrimination and violence.                    The Egyptian Church is traditionally believed to be founded by St Mark at around AD  42, and regards itself as the subject of many ": null
    },
    {
        "prophecies": "prophecies"
    },
    {
        " in the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ". ": null
    },
    {
        "Isaiah": "isaiah"
    },
    {
        " the prophet, in Chapter 19, Verse 19 says In that day there will be an altar to the  in the midst of the land of Egypt, and a pillar to the  at its border . The first Christians in Egypt were common people who spoke Egyptian ": null
    },
    {
        "Coptic": "coptic language"
    },
    {
        ".  There were also Alexandrian ": null
    },
    {
        "Jewish": "jewish"
    },
    {
        " people such as ": null
    },
    {
        "Theophilus": "theophilus"
    },
    {
        ", whom ": null
    },
    {
        "Saint Luke the Evangelist": "luke the evangelist"
    },
    {
        " addresses in the introductory chapter of his ": null
    },
    {
        "gospel": "gospel of luke"
    },
    {
        ". When the church was founded by ": null
    },
    {
        "Saint Mark": "saint mark"
    },
    {
        " during the reign of the ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " emperor": "emperor"
    },
    {
        " Nero": "nero"
    },
    {
        ", a great multitude of native Egyptians  embraced the Christian faith.      Christianity spread throughout Egypt within half a century of ": null
    },
    {
        "Saint Marks": "saint mark"
    },
    {
        "arrival in Alexandria, as is clear from the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " writings found in ": null
    },
    {
        "Bahnasa": "oxyrhynchus"
    },
    {
        ", in Middle Egypt, which date around the year AD  200, and a fragment of the ": null
    },
    {
        "Gospel of John": "gospel of john"
    },
    {
        ", written in Coptic, which was found in ": null
    },
    {
        "Upper Egypt": "upper egypt"
    },
    {
        " and can be dated to the first half of the 2nd century. In the 2nd century, Christianity began to spread to the rural areas, and scriptures were translated into the local languages, namely Coptic.       The Coptic language is a universal language used in Coptic churches in every country. It is derived from ancient Egyptian and uses Greek letters. Many of the hymns in the liturgy are in Coptic and have been passed down for several thousand years. The language is used to preserve Egypts original language, which was banned by the Arab invaders, who ordered Arabic to be used instead.  Some examples of these hymns are ,, , and many more.           The ": null
    },
    {
        "Catechetical School of Alexandria": "catechetical school of alexandria"
    },
    {
        " is the oldest catechetical school in the world. St. ": null
    },
    {
        "Jerome": "jerome"
    },
    {
        " records that the Christian School of Alexandria was founded by Saint Mark himself.  Around AD  190, under the leadership of the scholar ": null
    },
    {
        "Pantanaeus": "pantanaeus"
    },
    {
        ", the school of Alexandria became an important institution of religious learning, where students were taught by scholars such as ": null
    },
    {
        "Athenagoras": "athenagoras of athens"
    },
    {
        ", ": null
    },
    {
        "Clement": "clement of alexandria"
    },
    {
        ", ": null
    },
    {
        "Didymus": "didymus the blind"
    },
    {
        ", and the native Egyptian ": null
    },
    {
        "Origen": "origen"
    },
    {
        ", who was considered the father of theology and who was also active in the field of commentary and comparative Biblical studies.     Many scholars such as Jerome visited the school of Alexandria to exchange ideas and to communicate directly with its scholars. The scope of this school was not limited to theological subjects; science, mathematics and humanities were also taught there. The question-and-answer method of commentary began there, and 15 centuries before ": null
    },
    {
        "Braille": "braille"
    },
    {
        ", wood-carving techniques were in use there by blind scholars to read and write.     The Theological college of the catechetical school was re-established in 1893. The new school currently has campuses in Ireland, Cairo, ": null
    },
    {
        "New Jersey": "new jersey"
    },
    {
        ", and Los Angeles, where Coptic priests-to-be and other qualified men and women are taught among other subjects Christian theology, history, the Coptic language and art – including chanting, music, ": null
    },
    {
        "iconography": "iconography"
    },
    {
        ", and tapestry.          Many Egyptian Christians went to the desert during the 3rd century, and remained there to pray and work and dedicate their lives to seclusion and worship of God. This was the beginning of the ": null
    },
    {
        "monastic movement": "monasticism"
    },
    {
        ", which was organized by ": null
    },
    {
        "Anthony the Great": "saint anthony the great"
    },
    {
        ", Saint ": null
    },
    {
        "Paul of Thebes": "paul of thebes"
    },
    {
        ", the worlds first ": null
    },
    {
        "anchorite": "anchorite"
    },
    {
        ", ": null
    },
    {
        "Saint Macarius the Great": "macarius the great"
    },
    {
        " and ": null
    },
    {
        "Saint Pachomius the Cenobite": "pachomius"
    },
    {
        " in the 4th century.     ": null
    },
    {
        "Christian monasticism": "christian monasticism"
    },
    {
        " was born in Egypt and was instrumental in the formation of the Coptic Orthodox Church character of submission, simplicity and humility, thanks to the teachings and writings of the ": null
    },
    {
        "Great Fathers of Egypts Deserts": "desert fathers"
    },
    {
        ". By the end of the 5th century, there were hundreds of monasteries, and thousands of cells and caves scattered throughout the Egyptian desert. A great number of these monasteries are still flourishing and have new vocations to this day.     All Christian monasticism stems, either directly or indirectly, from the Egyptian example: ": null
    },
    {
        "Saint Basil the Great": "basil of caesarea"
    },
    {
        " Archbishop of Caesarea of Cappadocia, founder and organizer of the monastic movement in Asia Minor, visited Egypt around AD  357 and his rule is followed by the Eastern Orthodox Churches; Saint Jerome who translated the Bible into Latin, came to Egypt, while en route to ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ", around AD  400 and left details of his experiences in his letters; ": null
    },
    {
        "Benedict": "benedict of nursia"
    },
    {
        " founded the Benedictine Order in the 6th century on the model of Saint Pachomius, but in a stricter form. Countless pilgrims have visited the Desert Fathers to emulate their spiritual, disciplined lives.                In the 4th century, an Alexandrian ": null
    },
    {
        "presbyter": "presbyter"
    },
    {
        " named ": null
    },
    {
        "Arius": "arius"
    },
    {
        " began a theological dispute about the nature of Christ that spread throughout the Christian world and is now known as ": null
    },
    {
        "Arianism": "arianism"
    },
    {
        ". The ": null
    },
    {
        "Ecumenical Council of Nicea": "first council of nicaea"
    },
    {
        " AD  325 was convened by ": null
    },
    {
        "Constantine": "constantine i"
    },
    {
        " after the Pope ": null
    },
    {
        "Alexander I of Alexandria": "pope alexander i of alexandria"
    },
    {
        " requested to hold a Council to respond to heresies,  under the presidency of Saint ": null
    },
    {
        "Hosius of Cordova": "hosius of cordova"
    },
    {
        " to resolve the dispute. This eventually led to the formulation of the Symbol of Faith, also known as the ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        ".  The Creed, which is now recited throughout the Christian world, was based largely on the teaching put forth by a man who eventually would become Pope Saint ": null
    },
    {
        "Athanasius of Alexandria": "athanasius of alexandria"
    },
    {
        ", the chief opponent of Arius.            In the year AD  381, Pope ": null
    },
    {
        "Timothy I of Alexandria": "timothy i of alexandria"
    },
    {
        " presided over the second ecumenical council known as the Ecumenical ": null
    },
    {
        "Council of Constantinople": "first council of constantinople"
    },
    {
        ", to judge Macedonius, who denied the Divinity of the Holy Spirit. This council completed the ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        " with this confirmation of the divinity of the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        ":     We believe in the Holy Spirit, the Lord, the Giver of Life, who proceeds from the Father, who with the Father through the Son is worshiped and glorified who spoke by the Prophets and in One, Holy, Catholic, and Apostolic church. We confess one Baptism for the remission of sins and we look for the resurrection of the dead and the life of the coming age, Amen.               Another theological dispute in the 5th century occurred over the teachings of ": null
    },
    {
        "Nestorius": "nestorius"
    },
    {
        ", the Patriarch of Constantinople who taught that God the Word was not ": null
    },
    {
        "hypostatically": "hypostasis"
    },
    {
        " joined with human nature, but rather dwelt in the man Jesus. As a consequence of this, he denied the title Mother of God  to the ": null
    },
    {
        "Virgin Mary": "mary, the mother of jesus"
    },
    {
        ", declaring her instead to be Mother of Christ  Christotokos .     When reports of this reached the Apostolic Throne of Saint Mark, Pope Saint ": null
    },
    {
        "Cyril I of Alexandria": "cyril of alexandria"
    },
    {
        " acted quickly to correct this breach with orthodoxy, requesting that Nestorius repent. When he would not, the Synod of Alexandria met in an emergency session and a unanimous agreement was reached. Pope ": null
    },
    {
        "Cyril I of Alexandria": "cyril of alexandria"
    },
    {
        ", supported by the entire See, sent a letter to Nestorius known as The Third Epistle of Saint Cyril to Nestorius. This epistle drew heavily on the established Patristic Constitutions and contained the most famous article of Alexandrian Orthodoxy: The Twelve Anathemas of Saint Cyril. In these ": null
    },
    {
        "anathema": "anathema"
    },
    {
        "s, Cyril excommunicated anyone who followed the teachings of Nestorius. For example, Anyone who dares to deny the Holy Virgin the title  Theotokos  is Anathema! Nestorius however, still would not repent and so this led to the convening of the ": null
    },
    {
        "First Ecumenical Council of Ephesus": "first ecumenical council of ephesus"
    },
    {
        " , over which Cyril presided.     The Council confirmed the teachings of ": null
    },
    {
        "Saint Athanasius": "athanasius of alexandria"
    },
    {
        " and confirmed the title of Mary as ": null
    },
    {
        "Mother of God": "mother of god"
    },
    {
        " . It also clearly stated that anyone who separated Christ into two hypostases was anathema, as Cyril had said that there is One Nature for God the Word Incarnate . Also, the introduction to the creed was formulated as follows:     We magnify you O Mother of the True Light and we glorify you O saint and Mother of God  for you have borne unto us the Saviour of the world. Glory to you O our Master and King: Christ, the pride of the Apostles, the crown of the martyrs, the rejoicing of the righteous, firmness of the churches and the forgiveness of sins. We proclaim the Holy Trinity in One Godhead: we worship Him, we glorify Him, Lord have mercy, Lord have mercy, Lord bless us, Amen. not dissimilar to the ": null
    },
    {
        "Axion Estin": "axion estin"
    },
    {
        " Chant still used in Orthodoxy               When in AD  451 Emperor ": null
    },
    {
        "Marcian": "marcian"
    },
    {
        " attempted to heal divisions in the Church, the response of ": null
    },
    {
        "Pope Dioscorus": "dioscorus of alexandria"
    },
    {
        " – the Pope of Alexandria who was later exiled – was that the emperor should not intervene in the affairs of the Church. It was at ": null
    },
    {
        "Chalcedon": "chalcedon"
    },
    {
        " that the emperor, through the Imperial delegates, enforced harsh disciplinary measures against Pope Dioscorus in response to his boldness. In AD  449, Pope Dioscorus headed the 2nd Council of Ephesus, called the ": null
    },
    {
        "Robber Council": "robber council"
    },
    {
        " by Chalcedonian historians. It held to the ": null
    },
    {
        "Miaphysite": "miaphysite"
    },
    {
        " formula which upheld the Christology of One Incarnate Nature of God the Word ,  and upheld the heretic ": null
    },
    {
        "Eutyches": "eutyches"
    },
    {
        " claiming he was ": null
    },
    {
        "orthodox": "orthodoxy"
    },
    {
        ".     The ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        " summoned Dioscorus three times to appear at the council, after which he was deposed. The Council of Chalcedon further deposed him for his support of Eutyches, but not necessarily for Eutychian ": null
    },
    {
        "Monophysitism": "monophysitism"
    },
    {
        ". Dioscorus appealed to the conciliar fathers to allow for a more ": null
    },
    {
        "Miaphysite": "miaphysitism"
    },
    {
        " interpretation of Christology at the council, but was denied. Following his being deposed, the Coptic Church and its faithful felt unfairly underrepresented at the council and oppressed politically by the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ". After the Byzantines appointed ": null
    },
    {
        "Proterius of Alexandria": "proterius of alexandria"
    },
    {
        " as Patriarch to represent the ": null
    },
    {
        "Chalcedonian Church": "greek orthodox patriarchate of alexandria and all africa"
    },
    {
        ", the Coptic Church appointed their own Patriarch ": null
    },
    {
        "Timothy Aelurus": "timothy aelurus"
    },
    {
        " and broke from the ": null
    },
    {
        "Chalcedonian communion": "chalcedonian christianity"
    },
    {
        ".     The ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        ", from the perspective of the Alexandrine Christology, has deviated from the approved Cyrillian terminology and declared that Christ was one hypostasis in two natures. However, in the Nicene-Constantinopolitan Creed, Christ was conceived of the Holy Spirit and of the Virgin Mary, thus the foundation of the definition according to the ": null
    },
    {
        "Non-Chalcedonian": "non-chalcedonianism"
    },
    {
        " adherents, according to the Christology of Cyril of Alexandria is valid. There is a change in the Non-Chalcedonian definition here, as the Nicene creed clearly uses the terms of , rather than in.     In terms of Christology, the Oriental Orthodox understanding is that Christ is One Nature—the Logos Incarnate, of the full humanity and full divinity. The Chalcedonians understanding is that Christ is recognized in two natures, full humanity and full divinity. ": null
    },
    {
        "Oriental Orthodoxy": "oriental orthodoxy"
    },
    {
        " contends that such a formulation is no different from what the ": null
    },
    {
        "Nestorians": "nestorianism"
    },
    {
        " teach.  This is the doctrinal perception that makes the apparent difference which separated the Oriental Orthodox from the Eastern Orthodox.     The Councils findings were rejected by many of the Christians on the fringes of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", including Egyptians, ": null
    },
    {
        "Syriacs": "syriac orthodox church"
    },
    {
        ", ": null
    },
    {
        "Armenians": "armenian apostolic church"
    },
    {
        ", and others.     From that point onward, Alexandria would have two patriarchs: the non-Chalcedonian native Egyptian one, now known as the ": null
    },
    {
        "Coptic Pope of Alexandria and Patriarch of All Africa on the Holy Apostolic See of St. Mark": "list of coptic orthodox popes of alexandria"
    },
    {
        ", and the ": null
    },
    {
        "Melkite": "melkite"
    },
    {
        " or Imperial Patriarch, now known as the ": null
    },
    {
        "Greek Orthodox Patriarch of Alexandria": "list of greek orthodox patriarchs of alexandria"
    },
    {
        ". .     Almost the entire Egyptian population rejected the terms of the Council of Chalcedon and remained faithful to the native Egyptian Church .  See drop-down essay on Islamic Conquest and the Ottoman Empire Those who supported the Chalcedonian definition remained in ": null
    },
    {
        "communion": "full communion"
    },
    {
        " with the other leading imperial churches of ": null
    },
    {
        "Rome": "history of the roman catholic church"
    },
    {
        " and ": null
    },
    {
        "Constantinople": "ecumenical patriarch of constantinople"
    },
    {
        ". The non-Chalcedonian party became what is today called the ": null
    },
    {
        "Oriental Orthodox Church": "oriental orthodoxy"
    },
    {
        ".     The Coptic Orthodox Church of Alexandria regards itself as having been misunderstood at the Council of Chalcedon. There was an opinion in the Church that viewed that perhaps the Council understood the Church of Alexandria correctly, but wanted to curtail the existing power of the Alexandrine Hierarch, especially after the events that happened several years before at Constantinople from ": null
    },
    {
        "Pope Theophilus of Alexandria": "pope theophilus of alexandria"
    },
    {
        " towards Patriarch ": null
    },
    {
        "John Chrysostom": "john chrysostom"
    },
    {
        " and the unfortunate turnouts of the Second Council of Ephesus in AD  449, where Eutychus misled Pope Dioscorus and the Council in confessing the Orthodox Faith in writing and then renouncing it after the Council, which in turn, had upset Rome, especially that the Tome which was sent was not read during the Council sessions.     To make things even worse, the Tome of Pope Leo of Rome was, according to the Alexandria School of Theology, particularly in regards to the definition of Christology, considered influenced by Nestorian heretical teachings. So, due to the above-mentioned, especially in the consecutive sequences of events, the Hierarchs of Alexandria were considered holding too much of power from one hand, and on the other hand, due to the conflict of the Schools of Theology, there would be an impasse and a scapegoat, i.e. Pope Dioscorus. The Tome of Leo has been widely criticized in the past 50 years as a much less than perfect orthodox theological doctrine.     It is also to be noted that by anathematizing Pope Leo because of the tone and content of his tome, as per Alexandrine Theology perception, Pope Dioscorus was found guilty of doing so without due process; in other words, the Tome of Leo was not a subject of heresy in the first place, but it was a question of questioning the reasons behind not having it either acknowledged or read at the ": null
    },
    {
        "Second Council of Ephesus": "second council of ephesus"
    },
    {
        " in AD  449. Pope Dioscorus of Alexandria was never labeled as heretic by the councils canons.     Copts also believe that the Pope of Alexandria was forcibly prevented from attending the third congregation of the council from which he was ousted, apparently the result of a conspiracy tailored by the Roman delegates. Romanides, John S. .     Before the current positive era of Eastern and Oriental Orthodox dialogues, Chalcedonians sometimes used to call the non-Chalcedonians ": null
    },
    {
        "Monophysites": "monophysitism"
    },
    {
        " , though the Coptic Orthodox Church in reality regards Monophysitism as a heresy. The Chalcedonian doctrine in turn came to be known as ": null
    },
    {
        "Dyophysite": "dyophysitism"
    },
    {
        " .     A term that comes closer to Coptic Orthodoxy is ": null
    },
    {
        "Miaphysite": "miaphysitism"
    },
    {
        ", which refers to a conjoined nature for Christ, both human and divine, united indivisibly in the Incarnate Logos. The Coptic Orthodox Church of Alexandria believes that Christ is perfect in His divinity, and He is perfect in His humanity, but His divinity and His humanity were united in one nature called the nature of the incarnate word , which was reiterated by ": null
    },
    {
        "Saint Cyril of Alexandria": "cyril of alexandria"
    },
    {
        ".     Copts, thus, believe in two natures human and divine that are united in one hypostasis without mingling, without confusion, and without alteration . These two natures did not separate for a moment or the twinkling of an eye .       Prior to Chalcedon, the Imperial Churchs main division stemmed from ": null
    },
    {
        "Nestorianism": "nestorianism"
    },
    {
        ", eventually leading the ": null
    },
    {
        "Church of the East": "church of the east"
    },
    {
        " to declare its independence in AD  424. After the Council of Chalcedon in AD  451, the Coptic Church and its hierarchy felt suspicious of what they believed were ": null
    },
    {
        "Nestorian": "nestorianism"
    },
    {
        " elements within the ": null
    },
    {
        "Chalcedonian Church": "chalcedonian christianity"
    },
    {
        ". As a result, the anti-Chalcedon partisan, ": null
    },
    {
        "Timotheos Aelurus": "pope timothy ii of alexandria"
    },
    {
        ", consigned himself to depose the ": null
    },
    {
        "Chalcedonian Pope of Alexandria": "list of greek orthodox patriarchs of alexandria"
    },
    {
        ", ": null
    },
    {
        "Proterius of Alexandria": "proterius of alexandria"
    },
    {
        ", and to set himself up as the ": null
    },
    {
        "Pope of Alexandria": "pope of the coptic orthodox church of alexandria"
    },
    {
        " in opposition to the Chalcedonian Church. Copts suffered under the rule of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ". The ": null
    },
    {
        "Melkite": "melkite"
    },
    {
        " Patriarchs, appointed by the emperors as both spiritual leaders and civil governors, massacred those Egyptians they considered heretics. Many were tortured and martyred in attempts to force their acceptance of the Chalcedonian terms, but the Egyptians remained loyal to the Cyrillian ": null
    },
    {
        "Miaphysitism": "miaphysitism"
    },
    {
        ". One of the most renowned Egyptian saints of the period is ": null
    },
    {
        "Saint Samuel the Confessor": "saint samuel the confessor"
    },
    {
        ".          The ": null
    },
    {
        "Muslim invasion of Egypt": "muslim invasion of egypt"
    },
    {
        " took place in AD  639. Despite the political upheaval, the Egyptian population remained mainly Christian. However, gradual conversions to ": null
    },
    {
        "Islam": "islam"
    },
    {
        " over the centuries had changed Egypt from a Christian to a largely Muslim country by the end of the 12th century. Kamil, Jill . Coptic Egypt: History and Guide. Cairo: American University in Cairo. Another scholar writes that a combination of repression of Coptic revolts , Arab-Muslim immigration, and Coptic conversion to Islam resulted in the demographic decline of the Copts.  Egypts Umayyad rulers taxed Christians at a higher rate than Muslims, driving merchants towards Islam and undermining the economic base of the Coptic Church. Jerry Bentley, Old World Encounters: Cross-Cultural Contacts and Exchange in Pre-Modern Times , 93. Although the Coptic Church did not disappear, the Umayyad tax policies made it difficult for the church to retain the Egyptian elites. Jerry Bentley, Old World Encounters: Cross-Cultural Encounters and Exchanges in Pre-Modern Times , 93.       The Church suffered greatly under the many regimes of Islamic rule. Sometime during the 2nd millennium AD, the leadership of the Church, including the Pope, moved from Alexandria to Cairo. In 1798, the French invade Egypt unsuccessfully and the British help the Turks regain power over Egypt under the Muhammad Ali dynasty.        The position of Copts began to improve early in the 19th century under the stability and tolerance of the ": null
    },
    {
        "Muhammad Ali Dynasty": "muhammad ali dynasty"
    },
    {
        ". The Coptic community ceased to be regarded by the state as an administrative unit. In 1855 the ": null
    },
    {
        "jizya": "jizya"
    },
    {
        " tax was abolished by Said Pasha.  Shortly thereafter, the Copts started to serve in the Egyptian army.       Towards the end of the 19th century, the Coptic Church underwent phases of new development. In 1853, Pope Cyril IV established the first modern Coptic schools, including the first Egyptian school for girls. He also founded a printing press, which was only the second national press in the country. The Pope established very friendly relations with other denominations, to the extent that when the Greek Patriarch in Egypt had to absent himself from the country for a long period of time, he left his Church under the guidance of the Coptic Patriarch.     The Theological College of the School of Alexandria was reestablished in 1893. It began its new history with five students, one of whom was later to become its dean. Today it has campuses in Alexandria and Cairo, and in various dioceses throughout Egypt, as well as outside Egypt. It has campuses in New Jersey, Los Angeles, Sydney, Melbourne, and London, where potential clergymen and other qualified men and women study many subjects, including theology, church history, missionary studies, and the Coptic language.               In 1959, the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        " was granted its first own Patriarch by ": null
    },
    {
        "Pope Cyril VI": "pope cyril vi of alexandria"
    },
    {
        ". Furthermore, the Eritrean Orthodox Tewahedo Church similarly became independent of the Ethiopian Orthodox Tewahedo Church in 1994, when four bishops were consecrated by ": null
    },
    {
        "Pope Shenouda III of Alexandria": "pope shenouda iii of alexandria"
    },
    {
        " to form the basis of a local Holy Synod of the Eritrean Church. In 1998, the Eritrean Orthodox Tewahedo Church gained its ": null
    },
    {
        "autocephaly": "autocephaly"
    },
    {
        " from the Coptic Orthodox Church when its first Patriarch was enthroned by ": null
    },
    {
        "Pope Shenouda III of Alexandria": "pope shenouda iii of alexandria"
    },
    {
        ".     These three churches remain in ": null
    },
    {
        "full communion": "full communion"
    },
    {
        " with each other and with the other ": null
    },
    {
        "Oriental Orthodox": "oriental orthodox"
    },
    {
        " churches. The Ethiopian Orthodox Tewahedo Church and the Eritrean Orthodox Tewahedo Church do acknowledge the Honorary Supremacy of the ": null
    },
    {
        "Coptic Orthodox Patriarch of Alexandria": "coptic orthodox patriarch of alexandria"
    },
    {
        ", since the ": null
    },
    {
        "Church of Alexandria": "church of alexandria"
    },
    {
        " is technically their Mother Church. Upon their selection, both Patriarchs must receive the approval and communion from the Holy Synod of the ": null
    },
    {
        "Apostolic See of Alexandria": "church of alexandria"
    },
    {
        " before their enthronement.     Since the 1980s theologians from the Oriental Orthodox and Eastern Orthodox churches have been meeting in a bid to resolve theological differences, and have concluded that many of the differences are caused by the two groups using different terminology to describe the same thing .     In the summer of 2001, the Coptic Orthodox and Greek Orthodox Patriarchates of Alexandria agreed to mutually recognize baptisms performed in each others churches, making re-baptisms unnecessary, and to recognize the sacrament of marriage as celebrated by the other.  Previously, if a Coptic Orthodox and Greek Orthodox wanted to get married, the marriage had to be performed twice, once in each church, for it to be recognized by both. Now it can be done in only one church and be recognized by both.     According to Christian Tradition and Canon Law, the Coptic Orthodox Church of Alexandria only ordains men to the priesthood and episcopate, and if they wish to be married, they must be married before they are ordained. In this respect they follow the same practices as all other ": null
    },
    {
        "Oriental Orthodox Churches": "oriental orthodox churches"
    },
    {
        ", as well as all of ": null
    },
    {
        "Eastern Orthodox Churches": "eastern orthodox churches"
    },
    {
        ".     Traditionally, the ": null
    },
    {
        "Coptic language": "coptic language"
    },
    {
        " was used in church services, and the scriptures were written in the ": null
    },
    {
        "Coptic alphabet": "coptic alphabet"
    },
    {
        ". However, due to the Arabisation of Egypt, service in churches started to witness increased use of Arabic, while preaching is done entirely in Arabic. Native languages are used, in conjunction with Coptic, during services outside Egypt.     The liturgical calendar of the Coptic Orthodox Church is the ": null
    },
    {
        "Coptic calendar": "coptic calendar"
    },
    {
        " . This calendar is based on the ": null
    },
    {
        "Egyptian calendar": "egyptian calendar"
    },
    {
        " of ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        ". Coptic Orthodox Christians celebrate ": null
    },
    {
        "Christmas": "christmas"
    },
    {
        " on 29 Koiak, which corresponds to 7 January in the ": null
    },
    {
        "Gregorian Calendar": "gregorian calendar"
    },
    {
        " and 25 December in the ": null
    },
    {
        "Julian Calendar": "julian calendar"
    },
    {
        ". Coptic Christmas was adopted as an official national holiday in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " in 2002.     In ": null
    },
    {
        "Tahrir Square": "tahrir square"
    },
    {
        ", Cairo, on Wednesday 2 February 2011, Coptic Christians joined hands to provide a protective cordon around their Muslim neighbors during ": null
    },
    {
        "salat": "salat"
    },
    {
        " in the midst of the ": null
    },
    {
        "2011 Egyptian Revolution": "2011 egyptian revolution"
    },
    {
        ". , Nevine Zaki, 3 February 2011, accessed 9 February 2011     On 17 March 2012, the ": null
    },
    {
        "Coptic Orthodox Pope": "coptic orthodox pope"
    },
    {
        ", ": null
    },
    {
        "Pope Shenouda III": "pope shenouda iii"
    },
    {
        " died, leaving many Copts mourning and worrying as tensions rose with ": null
    },
    {
        "Muslims": "muslims"
    },
    {
        ". Pope Shenouda III constantly met with Muslim leaders in order to create peace. Many were worried about Muslims controlling ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " as the ": null
    },
    {
        "Muslim Brotherhood": "muslim brotherhood"
    },
    {
        " won 70% of the parliamentary elections.       On 4 November 2012, Bishop Tawadros was chosen as the 118th Pope. In a ritual filled with prayer, chants and incense at ": null
    },
    {
        "Abbasiya": "abbassia"
    },
    {
        " cathedral in Cairo, the 60-year-old bishops name was picked by a blindfolded child from a glass bowl in which the names of two other candidates had also been placed. The enthronement was scheduled on 18 November 2012.            There are about 30 million Coptic Orthodox Christians in the world.  Between 23 and 25 million of them are found in Egypt under the jurisdiction of the Coptic Orthodox Church of Alexandria.     Since Egypt does not have an official government census on religion, estimates of the size of Egypts Christian population vary from the estimated low previous government figures of 6 to 7 million to the 12 million reported by some Christian leaders in 2008. The actual numbers may be in the 23 to 25 million range, out of an Egyptian population of more than 90 million.      However, in 2011, the ": null
    },
    {
        "Pew Research Center": "pew research center"
    },
    {
        " announced that Copts in Egypt constitute 4.5% of the population, while the Catholic ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " puts Copts at 6 to 8%. Then in 2017 government owned news ": null
    },
    {
        "Al Ahram": "al ahram"
    },
    {
        " estimated the percentage of Copts at 10 to 15%.  However, in 2012 after the Egyptian revolution the Muslim Brotherhood was drafting new constitution then Major-General Abu Bakr al-Guindi claimed that the lower figures support a downward trend in the percentage of Copts in Egypt, as recorded in consecutive estimated Egyptian censuses since a 1927 high where Egyptian Christians formed 8.3% of the population.  This decline has been explained by Major-General ": null
    },
    {
        "Abu Bakr al-Guindi": "abu bakr al-guindi"
    },
    {
        ", head of Egypts Central Agency for Public Mobilization and Statistics, as being the result of Copts having the highest emigration rate, the lowest birthrate and the highest income level in the country. However, this statement and population count has been rejected by the Coptic Church.      There are also significant numbers in the diaspora outside Africa in countries such as the United States, Canada, Australia, France, and Germany. The number of Coptic Orthodox Christians in the diaspora is roughly 2 to 5 million.      In addition, there are between 350,000 and 400,000 native African adherents in East, Central and South Africa, most in Sudan, whose population is less than 200,000.   Although under the jurisdiction of the Coptic Orthodox Church, these adherents are not considered Copts, since they are not ethnic Egyptians.     Some accounts regard members of the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        " ,   World Council of Churches – News Release. 21 September 2005. Retrieved 25 November 2006. the ": null
    },
    {
        "Eritrean Orthodox Tewahedo Church": "eritrean orthodox tewahedo church"
    },
    {
        " , as members of the Coptic Orthodox Church. This is however a misnomer, since both the Ethiopian and the Eritrean Churches, although daughter churches of the Church of Alexandria, are currently ": null
    },
    {
        "autocephalous": "autocephaly"
    },
    {
        " churches.          While Copts have cited instances of persecution throughout their history, ": null
    },
    {
        "Human Rights Watch": "human rights watch"
    },
    {
        " has noted growing religious intolerance and sectarian violence against Coptic Christians in recent years, and a failure by the Egyptian government to effectively investigate properly and prosecute those responsible. , hrw.org, January 24, 2010  Over a hundred Egyptian copts have been killed in sectarian clashes from 2011 to 2017, and many homes and businesses destroyed. In just one province , 77 cases of sectarian attacks on Copts between 2011 and 2016 have been documented by the ": null
    },
    {
        "Egyptian Initiative for Personal Rights": "egyptian initiative for personal rights"
    },
    {
        ".  The abduction and disappearance of Coptic Christian women and girls also remains a serious ongoing problem.            Besides Egypt, the Church of Alexandria has jurisdiction over all of ": null
    },
    {
        "Africa": "africa"
    },
    {
        ".     In addition, the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        " and ": null
    },
    {
        "Eritrean Orthodox Tewahedo Church": "eritrean orthodox tewahedo church"
    },
    {
        " are daughter churches of the Coptic Orthodox Church of Alexandria. Both the Patriarchate of ": null
    },
    {
        "Addis Ababa": "addis ababa"
    },
    {
        " and all Ethiopia and the Patriarchate of ": null
    },
    {
        "Asmara": "asmara"
    },
    {
        " and all ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        " acknowledge the supremacy of honor and dignity of the ": null
    },
    {
        "Pope of Alexandria": "pope of the coptic orthodox church of alexandria"
    },
    {
        " on the basis that both patriarchates were established by the Throne of Alexandria and that they have their roots in the Apostolic Church of Alexandria, and acknowledge that Saint Mark the Apostle is the founder of their Churches through the heritage and Apostolic evangelization of the Fathers of Alexandria.          Ethiopia received Christianity next to Jerusalem, through Jesuss own apostle, only a year after Jesus was crucified . Christianity became a national religion of Ethiopia, under the dominion of the Church of Alexandria, in the 4th century. The first bishop of Ethiopia, ": null
    },
    {
        "Saint Frumentius": "frumentius"
    },
    {
        ", was consecrated as ": null
    },
    {
        "Bishop of Axum": "list of abunas of ethiopia"
    },
    {
        " by ": null
    },
    {
        "Pope Athanasius of Alexandria": "athanasius of alexandria"
    },
    {
        " in AD  328. From then on, until 1959, the ": null
    },
    {
        "Pope of Alexandria": "pope of alexandria"
    },
    {
        ", as Patriarch of All Africa, always named an Egyptian to be the Archbishop of the Ethiopian Church. On 13 July 1948, the Coptic Church of Alexandria and the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        " reached an agreement concerning the relationship between the two churches. In 1950, the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        " was granted autocephaly by ": null
    },
    {
        "Pope Joseph II of Alexandria": "pope joseph ii of alexandria"
    },
    {
        ", head of the Coptic Orthodox Church. Five Ethiopian bishops were immediately consecrated by the Pope of Alexandria and Patriarch of All Africa, and were empowered to elect a new Patriarch for their church. This promotion was completed when Joseph II consecrated the first Ethiopian-born Archbishop, ": null
    },
    {
        "Abuna Basilios": "abuna basilios"
    },
    {
        ", as head of the Ethiopian Church on 14 January 1951. In 1959, ": null
    },
    {
        "Pope Cyril VI of Alexandria": "pope cyril vi of alexandria"
    },
    {
        " crowned ": null
    },
    {
        "Abuna Basilios": "abuna basilios"
    },
    {
        " as the first ": null
    },
    {
        "Patriarch of Ethiopia": "list of abunas of ethiopia"
    },
    {
        ".     Patriarch Basilios died in 1971, and was succeeded on the same year by ": null
    },
    {
        "Abuna Theophilos": "abuna theophilos"
    },
    {
        ". With the fall of Emperor ": null
    },
    {
        "Haile Selassie I of Ethiopia": "haile selassie i of ethiopia"
    },
    {
        " in 1974, the new Marxist government arrested Abuna Theophilos and secretly executed him in 1979. The Ethiopian government then ordered the Ethiopian Church to elect ": null
    },
    {
        "Abuna Takla Haymanot": "abuna takla haymanot"
    },
    {
        " as Patriarch of Ethiopia. The Coptic Orthodox Church refused to recognize the election and enthronement of Abuna Takla Haymanot on the grounds that the Synod of the Ethiopian Church had not removed Abuna Theophilos, and that the Ethiopian government had not publicly acknowledged his death, and he was thus still legitimate Patriarch of Ethiopia. Formal relations between the two churches were halted, although they remained in communion with each other.     After the death of Abuna Takla Haymanot in 1988, ": null
    },
    {
        "Abune Merkorios": "abune merkorios"
    },
    {
        " who had close ties to the ": null
    },
    {
        "Derg": "derg"
    },
    {
        " government was elected Patriarch of Ethiopia. Following the fall of the Derg regime in 1991, Abune Merkorios abdicated under public and governmental pressure and went to exile in the United States. The newly elected Patriarch, ": null
    },
    {
        "Abune Paulos": "abune paulos"
    },
    {
        " was officially recognized by the Coptic Orthodox Church of Alexandria in 1992 as the legitimate Patriarch of Ethiopia. Formal relations between the Coptic Church of Alexandria and the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox church"
    },
    {
        " were resumed on 13 July 2007. Abune Paulos died in August 2012.          Following the independence of ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        " from Ethiopia in 1993, the newly independent Eritrean government appealed to ": null
    },
    {
        "Pope Shenouda III of Alexandria": "pope shenouda iii of alexandria"
    },
    {
        " for Eritrean Orthodox autocephaly. In 1994, Pope Shenouda ordained ": null
    },
    {
        "Abune Phillipos": "abune phillipos"
    },
    {
        " as first Archbishop of Eritrea. The ": null
    },
    {
        "Eritrean Orthodox Tewahedo Church": "eritrean orthodox tewahedo church"
    },
    {
        " obtained autocephaly on 7 May 1998, and Abune Phillipos was subsequently consecrated as first Patriarch of Eritrea. The two churches remain in full communion with each other and with the other ": null
    },
    {
        "Oriental Orthodox Churches": "oriental orthodox churches"
    },
    {
        ", although the Coptic Orthodox Church of Alexandria, along with the ": null
    },
    {
        "Ethiopian Orthodox Tewahedo Church": "ethiopian orthodox tewahedo church"
    },
    {
        " does not recognize the deposition of the third Patriarch of Eritrea, ": null
    },
    {
        "Abune Antonios": "abune antonios"
    },
    {
        ".             The Coptic Orthodox Church has a presence in many countries outside ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", including:   ": null
    },
    {
        "Africa": "coptic orthodox church in africa"
    },
    {
        " Asia": "coptic orthodox church in asia"
    },
    {
        " Australia and Oceania": "coptic orthodox church in australia"
    },
    {
        " Europe": "coptic orthodox church in europe"
    },
    {
        " Britain and Ireland": "coptic orthodox church in britain and ireland"
    },
    {
        " France": "french coptic orthodox church"
    },
    {
        "   North America": "coptic orthodox church in north america"
    },
    {
        " United States": "coptic orthodox church in the united states"
    },
    {
        " Canada": "coptic orthodox church in canada"
    },
    {
        " Mexico": "coptic orthodox church in mexico"
    },
    {
        " South America": "coptic orthodox church in south america"
    },
    {
        "                Pope of Alexandria and Patriarch of all Africa on the Holy See of St. Mark the Apostle .   His full title is Patriarch and Lord Archbishop of the Great City of Alexandria on the Holy Orthodox and Apostolic Throne of Saint Mark the Evangelist and Holy Apostle that is, in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", ": null
    },
    {
        "Pentapolis": "cyrenaicachristianization"
    },
    {
        ", ": null
    },
    {
        "Libya": "libya"
    },
    {
        ", ": null
    },
    {
        "Nubia": "nubia"
    },
    {
        ", ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        ", ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        ", ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        " and all Africa.   The Successor of ": null
    },
    {
        "St. Mark": "st. mark"
    },
    {
        " the ": null
    },
    {
        "Evangelist": "four evangelists"
    },
    {
        ", Holy Apostle and Martyr, on the Holy Apostolic Throne of the Great City of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ".   ": null
    },
    {
        "Pope of Alexandria": "list of coptic orthodox popes of alexandria"
    },
    {
        ", being the ": null
    },
    {
        "Diocesan Bishop": "bishop"
    },
    {
        " of the Great and Ancient ": null
    },
    {
        "Metropolis": "metropolis"
    },
    {
        " of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ", that is in ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " and the metropolitan province of Greater Cairo.   Elder ": null
    },
    {
        "Metropolitan Archbishop": "metropolitan archbishop"
    },
    {
        " of the Egyptian Province.   ": null
    },
    {
        "Primate": "primate"
    },
    {
        " of ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", ": null
    },
    {
        "Pentapolis": "cyrenaicachristianization"
    },
    {
        ", ": null
    },
    {
        "Libya": "libya"
    },
    {
        ", ": null
    },
    {
        "Nubia": "nubia"
    },
    {
        " and ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        ".   Father of Fathers.   ": null
    },
    {
        "Shepherd": "shepherd"
    },
    {
        " of Shepherds.   ": null
    },
    {
        "Hierarch": "hierarch"
    },
    {
        " of all Hierarchs.       The Dean of the ": null
    },
    {
        "Great Catechetical School of Theology of Alexandria": "catechetical school of alexandria"
    },
    {
        ".   The Ecumenical Judge of the Holy Apostolic and Catholic Church.   The 13th among the Holy ": null
    },
    {
        "Apostles": "twelve apostles"
    },
    {
        ".   The Pillar and Defender of the ": null
    },
    {
        "Holy": "holy"
    },
    {
        ", ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        " , ": null
    },
    {
        "Apostolic": "apostle"
    },
    {
        " Church and of the ": null
    },
    {
        "Orthodox": "orthodoxy"
    },
    {
        " Doctrine.       The patriarch of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " was originally known merely as bishop of Alexandria. However, this title continued to evolve as the Church grew under Theophilus and his nephew and successor ": null
    },
    {
        "Cyril": "cyril of alexandria"
    },
    {
        " , and especially in the 5th century when the Church developed its hierarchy.     The bishop of Alexandria, being the successor of the first bishop in Roman Egypt consecrated by ": null
    },
    {
        "Saint Mark": "saint mark"
    },
    {
        ", was honored by the other bishops as first among equals primus inter pares. Under the sixth canon of the ": null
    },
    {
        "Council of Nicaea": "first council of nicaea"
    },
    {
        ", Cyril was raised to prelate or chief bishop at the head of the episcopates of Egypt, ": null
    },
    {
        "Libya": "roman libya"
    },
    {
        ", and the ": null
    },
    {
        "Pentapolis": "cyrenaica"
    },
    {
        " without the existence of intermediate archbishops as existed in other ecclesiastic provinces. Cannuyer, 2001, p. 40. He had the privilege of choosing and consecrating bishops.     The title of pope has been attributed to the Patriarch of Alexandria since the episcopate of ": null
    },
    {
        "Heraclas": "heraclas of alexandria"
    },
    {
        ", the 13th Patriarch of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ". All the clergy of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " and ": null
    },
    {
        "Lower Egypt": "lower egypt"
    },
    {
        " honored him with the title papas, which means father as the archbishop and metropolitan having authority over all bishops, within the Egyptian province, who are under his jurisdiction. ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ", while the ecclesiastical and provincial capital, also had the distinction as being the place where ": null
    },
    {
        "Saint Mark": "saint mark"
    },
    {
        " was martyred.     The title ": null
    },
    {
        "Patriarch": "patriarch"
    },
    {
        " originally referred to a clan leader or head of a familial lineage. Ecclesiastically it means a bishop of high rank and was originally used as a title for the bishops of Rome, Constantinople, Jerusalem, Antioch, and Alexandria. For the Coptic patriarch, this title was ": null
    },
    {
        "Patriarch": "patriarch"
    },
    {
        " of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " and all Africa on the Holy Apostolic Throne of ": null
    },
    {
        "Saint Mark": "saint mark"
    },
    {
        " the Evangelist, that is of Egypt . The title of Patriarch was first used around the time of the Third Ecumenical ": null
    },
    {
        "Council of Ephesus": "first council of ephesus"
    },
    {
        ", convened in AD  431, and ratified at ": null
    },
    {
        "Chalcedon": "council of chalcedon"
    },
    {
        " in AD  451.     It is to be noted that only the ": null
    },
    {
        "Patriarch of Alexandria": "patriarch of alexandria"
    },
    {
        " has the double title of Pope and Patriarch among the ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox church"
    },
    {
        " and ": null
    },
    {
        "Oriental Orthodox": "oriental orthodox"
    },
    {
        " ecumenical church heads.       The Coptic Orthodox patriarchate of Alexandria is governed by its ": null
    },
    {
        "Holy Synod": "the holy synod of the coptic orthodox patriarchate of alexandria"
    },
    {
        ", which is headed by the ": null
    },
    {
        "Patriarch of Alexandria": "patriarch of alexandria"
    },
    {
        ". Under his authority are the ": null
    },
    {
        "metropolitan archbishop": "metropolitan archbishop"
    },
    {
        "s, ": null
    },
    {
        "metropolitan bishop": "metropolitan bishop"
    },
    {
        "s, ": null
    },
    {
        "diocesan bishops": "bishop"
    },
    {
        ", ": null
    },
    {
        "patriarchal exarchs": "exarch"
    },
    {
        ", ": null
    },
    {
        "missionary bishop": "missionary bishop"
    },
    {
        "s, ": null
    },
    {
        "auxiliary bishop": "auxiliary bishop"
    },
    {
        "s, ": null
    },
    {
        "suffragan bishop": "suffragan bishop"
    },
    {
        "s, ": null
    },
    {
        "assistant bishop": "assistant bishop"
    },
    {
        "s, ": null
    },
    {
        "chorbishops": "chorbishop"
    },
    {
        "and the ": null
    },
    {
        "patriarch": "patriarch"
    },
    {
        "al ": null
    },
    {
        "vicars": "vicar"
    },
    {
        "for the Church of Alexandria. They are organized as follows:   16 ": null
    },
    {
        "metropolitanates": "metropolis"
    },
    {
        ", out of which 12 metropolitanates are in Egypt, one metropolitanate in the Near East, one in Europe, one in the US and one in Africa; served by two metropolitan archbishops and 14 metropolitan bishops; out of the 16 hierarchs, one metropolitan archbishop is in the Near East, one metropolitan archbishop in Egypt, while 11 metropolitan bishops are in Egypt, one metropolitan bishop in Europe, one metropolitan bishop in the US and one metropolitan bishop in Africa.   67 ": null
    },
    {
        "dioceses": "diocese"
    },
    {
        "with 41 diocesan bishops are in Egypt, 13 diocesan bishops are in Europe, 7 diocesan bishops are in North America, two diocesan bishops are in South America, two diocesan bishops are in Sudan, and finally two diocesan bishops are in Australia.   one ": null
    },
    {
        "suffragan diocese": "suffragan diocese"
    },
    {
        "s, with one suffragan bishop in North America.   six auxiliary bishops, with two auxiliary bishops for dioceses in Egypt and four auxiliary bishops in North America.   12 assistant bishops in Egypt for 12 suffragan dioceses within an ": null
    },
    {
        "archdiocese": "archdiocese"
    },
    {
        " under the Patriarchs jurisdiction;   five patriarchal exarchates, with one patriarchal exarch in Africa, one patriarchal exarch in North America and three patriarchal exarchs in Egypt.   14 ": null
    },
    {
        "bishop abbots": "abbot"
    },
    {
        " for 12 patriarchal monasteries in Egypt, one patriarchal monastery in Australia and one patriarchal monastery in Germany   two general bishops, patriarchal emissary at large in Egypt and abroad.   five general bishops, administrators of patriarchal institutions in Egypt.   one ": null
    },
    {
        "hegumen": "hegumen"
    },
    {
        " in the capacity of ": null
    },
    {
        "grand economos": "oeconomus"
    },
    {
        ", ": null
    },
    {
        "patriarchal vicar": "vicar"
    },
    {
        " for ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ".   one hegumen as administrative patriarchal vicar for Cairo.       ": null
    },
    {
        "Saint Marks Coptic Orthodox Cathedral": "saint marks coptic orthodox cathedral"
    },
    {
        ", ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " Saint Marks Coptic Orthodox Cathedral": "saint marks coptic orthodox cathedral"
    },
    {
        ", Abbassia, Cairo   ": null
    },
    {
        "Saint Marks Coptic Orthodox Cathedral": "saint marks coptic orthodox cathedral"
    },
    {
        ", Azbakeya, Cairo   ": null
    },
    {
        "Cathedral of the Nativity in Cairo": "cathedral of the nativity in cairo"
    },
    {
        " Markham, Ontario": "markham, ontario"
    },
    {
        ", Canada          ": null
    },
    {
        "Monastery of Saint Anthony": "monastery of saint anthony"
    },
    {
        "   Monastery of Saint Paul the Anchorite": "monastery of saint paul the anchorite"
    },
    {
        "   Monastery of Saint Fana": "monastery of saint fana"
    },
    {
        " Monastery of Saint Macarius the Great": "monastery of saint macarius the great"
    },
    {
        " Monastery of the Martyrs": "monastery of the martyrs"
    },
    {
        " Monastery of Saint Matthew the Potter": "monastery of saint matthew the potter"
    },
    {
        " Monastery of Saint Mina": "monastery of saint mina"
    },
    {
        " Paromeos Monastery": "paromeos monastery"
    },
    {
        " Monastery of Saint Pishoy": "monastery of saint pishoy"
    },
    {
        " Red Monastery": "red monastery"
    },
    {
        " Syrian Monastery": "syrian monastery"
    },
    {
        " White Monastery": "white monastery"
    },
    {
        " ": null
    }
]