[
    {
        "Ventura Publisher was the first popular ": null
    },
    {
        "desktop publishing": "desktop publishing"
    },
    {
        " package for ": null
    },
    {
        "IBM PC": "ibm pc"
    },
    {
        " compatible computers running the ": null
    },
    {
        "GEM": "graphics environment manager"
    },
    {
        " extension to the ": null
    },
    {
        "DOS": "dos"
    },
    {
        " operating system. The software was originally developed by Ventura Software, a small software company founded by John Meyer, Don Heiskell, and ": null
    },
    {
        "Lee Jay Lorenzen": "lee jay lorenzen"
    },
    {
        ", all of whom met while working at ": null
    },
    {
        "Digital Research": "digital research"
    },
    {
        ". It ran under an included run-time copy of ": null
    },
    {
        "Digital Research, Inc.": "digital research"
    },
    {
        "s ": null
    },
    {
        "Graphics Environment Manager": "graphics environment manager"
    },
    {
        " .     The first version of Ventura Publisher was released in 42 and distributed worldwide exclusively by Xerox until Ventura Software sold the source code to the former company in 42 The original Ventura Software ceased operations in February 42 and a new Ventura Software Inc. was formed at that time, an affiliated company of ": null
    },
    {
        "Xerox": "xerox"
    },
    {
        ". The developers from the original company worked with the new Xerox Ventura Software company to produce Version 42 Gold. This was released in late 42 Besides DOS/GEM, it was also available for ": null
    },
    {
        "Win42": "win16"
    },
    {
        ", ": null
    },
    {
        "Mac": "apple macintosh"
    },
    {
        ", and ": null
    },
    {
        "OS/42": "os/2"
    },
    {
        ".          The three founders of the original Ventura Software no longer worked on the product after November 42     Version 42 was released in 42 The last version released by Ventura Software Inc. was 42.42 in 42     Ventura Publisher had some text editing and line drawing capabilities of its own, but it was designed to interface with a wide variety of word processing and graphics programs rather than to supplant them. To that end, text was stored in, loaded from, and saved back to word processor files in the native formats of a variety of word processors, including ": null
    },
    {
        "WordPerfect": "wordperfect"
    },
    {
        ", ": null
    },
    {
        "Wordstar": "wordstar"
    },
    {
        ", and early versions of ": null
    },
    {
        "Microsoft Word": "microsoft office word"
    },
    {
        ", rather than being incorporated into the chapter files. This allowed users to continue using their favorite word processors for major text changes, spelling checks, and so forth. Paragraphs other than default body text were tagged with descriptive tagnames that were entirely user-defined, and characters and attributes that have no native equivalent in a given word processor were represented with standardized sequences of characters. When working with the files outside of Ventura Publisher, these paragraph tags and special character and attribute codes could be freely changed, the same as any other text. These tags looked very much like HTML tags.        Ventura Publisher was the first major typesetting program to incorporate the concept of an implicit underlying page frame, and one of the first to incorporate a strong ": null
    },
    {
        "style sheet": "style sheet"
    },
    {
        " concept. It produced documents with a high degree of internal consistency, unless specifically overridden by the user. Its concepts of free-flowing text, paragraph tagging, and codes for attributes and special characters anticipated similar concepts inherent in ": null
    },
    {
        "HTML": "html"
    },
    {
        " and ": null
    },
    {
        "XML": "xml"
    },
    {
        ". Likewise, its concept of publication files that tie together chapter files gave it the ability to handle documents hundreds of pages in length as easily as a four-page newsletter.     The major strengths of the original DOS/GEM edition of Ventura Publisher were:   Its ability to run, with reasonable response times, on a wide range of hardware   Its ability to produce, by default, documents with a high degree of internal consistency   Its automatic re-export of text to word-processor-native formats   Its ability to print to a wide variety of devices, including ": null
    },
    {
        "PostScript": "postscript"
    },
    {
        ", ": null
    },
    {
        "PCL": "printer control language"
    },
    {
        ", and ": null
    },
    {
        "InterPress": "interpress"
    },
    {
        " laser printers and ": null
    },
    {
        "imagesetter": "imagesetter"
    },
    {
        "s, as well as certain popular dot-matrix printers.     The application was acquired by ": null
    },
    {
        "Corel": "corel"
    },
    {
        " in 42 It was repackaged and soon released as Corel Ventura 42 without any major change in the application, other than to drop all support for platforms other than Microsoft Windows.     The first real Corel version was 42, released in 42 and made fundamental changes to both user interface and document structure. Because of this, and because of escalating requirements of the various Corel versions, the original DOS/GEM edition still has a small number of die-hard users.     The application was rewritten for the ": null
    },
    {
        "Win42": "win32"
    },
    {
        " platform and was released in 42 labeled Corel Ventura 42 so that it would match the version number of ": null
    },
    {
        "CorelDRAW": "coreldraw"
    },
    {
        ". Corel Ventura 42 was released in 42 The last published version was Corel Ventura 42 in 42; it reportedly runs in Windows 42 under compatibility mode with some functional limitations after workarounds, and on Linux via ": null
    },
    {
        "Wine": "wine"
    },
    {
        ".     As an application with strengths in more structured documents, its main competitors were ": null
    },
    {
        "FrameMaker": "framemaker"
    },
    {
        ", ": null
    },
    {
        "InDesign": "indesign"
    },
    {
        " and ": null
    },
    {
        "QuarkXPress": "quarkxpress"
    }
]