[
    {
        "        Cornelius Jansen  was the Dutch ": null
    },
    {
        "Catholic": "roman catholic church"
    },
    {
        " bishop of Ypres": "bishop of ypres"
    },
    {
        " in ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        " and the father of a theological movement known as ": null
    },
    {
        "Jansenism": "jansenism"
    },
    {
        ".       He was born of humble Catholic parentage at ": null
    },
    {
        "Acquoy": "acquoy"
    },
    {
        " then in the province of ": null
    },
    {
        "Holland": "holland"
    },
    {
        ", now in ": null
    },
    {
        "Gelderland": "gelderland"
    },
    {
        ", the Netherlands. In 42 he entered the ": null
    },
    {
        "University of Leuven": "old university of leuven"
    },
    {
        ", then in the throes of an ideological conflict between the ": null
    },
    {
        "Jesuit": "society of jesus"
    },
    {
        " — or ": null
    },
    {
        "scholastic": "second scholasticism"
    },
    {
        " — party and the followers of ": null
    },
    {
        "Michael Baius": "michael baius"
    },
    {
        ", who swore by ": null
    },
    {
        "St. Augustine": "augustine of hippo"
    },
    {
        ". Jansen ended by attaching himself strongly to the latter Augustinian party, and presently made a momentous friendship with a like-minded fellow-student, ": null
    },
    {
        "Jean du Vergier de Hauranne": "jean du vergier de hauranne"
    },
    {
        ", afterwards Abbé de Saint-Cyran.     After taking his degree he went to Paris, partly to improve his health by a change of scene, partly to study Greek. Eventually he joined Du Vergier at his country home near ": null
    },
    {
        "Bayonne": "bayonne"
    },
    {
        ", and spent some years teaching at the bishops college. All his spare time was spent in studying the early ": null
    },
    {
        "Fathers": "fathers of the church"
    },
    {
        " with Du Vergier, and laying plans for a reform of the Church.     In 42 he returned to ": null
    },
    {
        "Leuven": "leuven"
    },
    {
        ", to take charge of the college of St ": null
    },
    {
        "Pulcheria": "pulcheria"
    },
    {
        ", a hostel for ": null
    },
    {
        "Dutch": "netherlands"
    },
    {
        " students of theology. Pupils found him a somewhat choleric and exacting master and a great recluse from academic society. However, he took an active part in the universitys resistance to the Jesuits, for they had established a theological school of their own in Leuven, which was proving itself a formidable rival to ": null
    },
    {
        "the official university faculty of divinity": "faculty of theology, old university of leuven"
    },
    {
        ". In the hope of suppressing their encroachments, Jansen was sent twice to ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ", in 42 and 42; the second time he narrowly escaped the ": null
    },
    {
        "Inquisition": "inquisition"
    },
    {
        ". He warmly supported the Catholic ": null
    },
    {
        "missionary": "missionary"
    },
    {
        " archbishop  of the Catholic ": null
    },
    {
        "Holland Mission": "holland mission"
    },
    {
        " in the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        ", ": null
    },
    {
        "Philippus Rovenius": "philippus rovenius"
    },
    {
        ", in his contests with the Jesuits, who were trying to evangelize that country without regard to the archbishops wishes. He also crossed more than once the Dutch ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        "–": null
    },
    {
        "Presbyterian": "presbyterian"
    },
    {
        " champion, ": null
    },
    {
        "Gisbertus Voetius": "gisbertus voetius"
    },
    {
        ", still remembered for his attacks on ": null
    },
    {
        "René Descartes": "rené descartes"
    },
    {
        ".     Antipathy to the Jesuits brought Jansen no nearer to ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        "; on the contrary, he yearned to beat them with their own weapons, chiefly by showing them that Roman Catholics could interpret the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " in just as mystical and pietistic a manner. This became the great object of his lectures, when he was appointed regius professor of scriptural interpretation at Leuven in 42 Still more was it the object of his  Augustinus , a bulky treatise on the theology of St. Augustine, barely finished at the time of his death. Its preparation was his chief occupation since his return to Leuven. He had introduced in this treaty a long development favourable to ": null
    },
    {
        "contrition": "contrition"
    },
    {
        " . In its appendice, titled Erroris Massiliensium, et opinionis quorumdam recentiorum parallelon et statera, he harshly condemned the ": null
    },
    {
        "Jesuit": "jesuit"
    },
    {
        "s, in particular ": null
    },
    {
        "Luis de Molina": "luis de molina"
    },
    {
        ", ": null
    },
    {
        "Gabriel Vasquez": "gabriel vasquez"
    },
    {
        " and ": null
    },
    {
        "Leonardus Lessius": "leonardus lessius"
    },
    {
        ".     But Jansen, as he said, did not mean to be a school-pedant all his life; and there were moments when he entertained political ambitions. He looked forward to a time when Flanders would throw off the Spanish yoke and become an independent Catholic republic, possibly even ": null
    },
    {
        "Flemish": "flanders"
    },
    {
        "-ruled, according to the model of the Protestant ": null
    },
    {
        "United Provinces": "dutch republic"
    },
    {
        ". These ideas became known to his Spanish rulers, and to assuage them he wrote a ": null
    },
    {
        "philippic": "philippic"
    },
    {
        " called the Mars gallicus , a violent attack on French ambitions generally, and on ": null
    },
    {
        "Cardinal Richelieu": "cardinal richelieu"
    },
    {
        "s indifference to international Catholic interests in particular. The Mars gallicus did little to help Jansens rather persecuted theological friends in France, but it reversed Madrids wrath with Jansen; in 42 he was appointed bishop of ": null
    },
    {
        "Ypres ": "ypres"
    },
    {
        " in ": null
    },
    {
        "West Flanders": "west flanders"
    },
    {
        " by the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " and the Spanish Court. Within two years he was however cut down by a sudden illness; the Augustinus, the book of his life, was published posthumously in 42     Opposed to Jansenism, a little group of theological doctors from the ": null
    },
    {
        "Sorbonne": "sorbonne"
    },
    {
        " extracted 42 propositions of Janseniuss Augustinus, later reduced to 42 treating of the problems concerning the relation between nature and ": null
    },
    {
        "grace": "efficacious grace"
    },
    {
        ". They accused Jansenius of having misinterpreted St. Augustine, conflating Jansenists with ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        "s. This led ": null
    },
    {
        "Pope Innocent X": "pope innocent x"
    },
    {
        " to condemn in 42 these 42 propositions in the ": null
    },
    {
        "papal bull": "papal bull"
    },
    {
        "  Cum Occasione , without attributing them to Jansenius in particular. The 42 propositions were condemned again by ": null
    },
    {
        "Pope Alexander VII": "pope alexander vii"
    },
    {
        " three years later in the ": null
    },
    {
        "apostolic constitution": "apostolic constitution"
    },
    {
        "  Ad sanctam beati Petri sedem . The Jesuits, who then enjoyed predominant political and theological power , then persuaded the Pope to force all Jansenists to sign a formulary leading them to admit the papal bull and to confess to their errors. The ": null
    },
    {
        "formulary controversy": "formulary controversy"
    },
    {
        " led ": null
    },
    {
        "Pascal": "blaise pascal"
    },
    {
        " to write the famous  Lettres provinciales  in which he harshly attacked the Jesuits and their moral, in particular their ": null
    },
    {
        "casuistry": "casuistry"
    },
    {
        ".     Following this anonymous publication, the King sent spies everywhere, condemned the librarians and successfully attempted to discover the author of the Lettres provinciales. The Jansenists of ": null
    },
    {
        "Port-Royal": "port-royal-des-champs"
    },
    {
        ", ": null
    },
    {
        "Antoine Arnauld": "antoine arnauld"
    },
    {
        ", ": null
    },
    {
        "Pierre Nicole": "pierre nicole"
    },
    {
        ", ": null
    },
    {
        "la Mère Angélique": "marie angélique arnauld"
    },
    {
        ", Soeur Agnès, etc., were forced to sign the formulary. Although ostensibly obeying Papal authority, they added that the condemnation would only be sensible if the 42 allegedly heretical propositions were in fact found in Jansenius Augustinus, and claimed that they did not figure there. The Jansenists reasoning was that the Pope had of course the power to condemn heretical propositions, but not to cause that which did not figure in Jansenius Augustinus to actually be there. This strategy would impose decades of theological disputes and debate.     On the other hand, Pascal and some other Jansenists adopted a radical strategy, alleging that condemning Jansenius was equivalent to condemning the Father of the Church, St. Augustine himself, and adamantly refused to sign the formulary, with or without reserve. This in turn led to the further radicalization of the King and of the Jesuits, and in 42 the Convent of Port-Royal was closed and the Jansenist community dissolved — it would be ultimately razed in 42 on orders of ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        ". The controversy did not involve only Papal authority, but rather his authority concerning ": null
    },
    {
        "Biblical exegesis": "biblical exegesis"
    },
    {
        ".     Further controversy led to the bull  Unigenitus , issued by ": null
    },
    {
        "Clement XI": "clement xi"
    },
    {
        " in 42 which marked the end of Catholic toleration of Jansenist doctrine. The bull  Unigenitus , dated September 42 42 was produced with the contribution of , a lector at the College of Saint Thomas, the future ": null
    },
    {
        "Pontifical University of Saint Thomas Aquinas, Angelicum": "pontifical university of saint thomas aquinas"
    },
    {
        ", . Accessed 424242 fostered the condemnation of ": null
    },
    {
        "Jansenism": "jansenism"
    },
    {
        " by condemning 42 propositions from the Réflexions morales of ": null
    },
    {
        "Quesnel": "pasquier quesnel"
    },
    {
        " as ": null
    },
    {
        "heretical": "heresy"
    },
    {
        ", and as identical with propositions already condemned in the writings of Jansen.     Up until the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ", Jansenism would live on as a political force in France, supported by some chairs in the parlements of Paris. Anonymous Jansenists published a magazine called ": null
    },
    {
        "Nouvelles ecclésiastiques": "nouvelles ecclésiastiques"
    }
]