[
    {
        "                    Corrosion is a ": null
    },
    {
        "natural process": "erosion"
    },
    {
        " that converts a refined metal into a more chemically-stable form such as ": null
    },
    {
        "oxide": "oxide"
    },
    {
        ", ": null
    },
    {
        "hydroxide": "hydroxide"
    },
    {
        ", or ": null
    },
    {
        "sulfide": "sulfide"
    },
    {
        ". It is the gradual destruction of materials  by chemical and/or electrochemical reaction with their environment. ": null
    },
    {
        "Corrosion engineering": "corrosion engineering"
    },
    {
        " is the field dedicated to controlling and preventing corrosion.     In the most common use of the word, this means ": null
    },
    {
        "electrochemical": "electrochemical"
    },
    {
        " oxidation": "oxidation"
    },
    {
        " of metal in reaction with an oxidant such as ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " or ": null
    },
    {
        "sulfates": "sulfates"
    },
    {
        ". ": null
    },
    {
        "Rusting": "rusting"
    },
    {
        ", the formation of ": null
    },
    {
        "iron": "iron"
    },
    {
        " oxides, is a well-known example of electrochemical corrosion. This type of damage typically produces ": null
    },
    {
        "oxide": "oxide"
    },
    {
        " or ": null
    },
    {
        "salt": "salt"
    },
    {
        " of the original metal and results in a distinctive orange colouration. Corrosion can also occur in materials other than metals, such as ": null
    },
    {
        "ceramics": "ceramic materials"
    },
    {
        " or ": null
    },
    {
        "polymers": "polymers"
    },
    {
        ", although in this context, the term degradation is more common. Corrosion degrades the useful properties of materials and structures including strength, appearance and permeability to liquids and gases.     Many structural ": null
    },
    {
        "alloy": "alloy"
    },
    {
        "s corrode merely from exposure to moisture in air, but the process can be strongly affected by exposure to certain substances. Corrosion can be concentrated locally to form a ": null
    },
    {
        "pit": "corrosionpitting corrosion"
    },
    {
        " or crack, or it can extend across a wide area more or less uniformly corroding the surface. Because corrosion is a diffusion-controlled process, it occurs on exposed surfaces. As a result, methods to reduce the activity of the exposed surface, such as ": null
    },
    {
        "passivation": "passivation"
    },
    {
        " and ": null
    },
    {
        "chromate conversion": "chromate conversion coating"
    },
    {
        ", can increase a materials corrosion resistance. However, some corrosion mechanisms are less visible and less predictable.             Galvanic corrosion occurs when two different metals have physical or electrical contact with each other and are immersed in a common ": null
    },
    {
        "electrolyte": "electrolyte"
    },
    {
        ", or when the same metal is exposed to electrolyte with different concentrations. In a ": null
    },
    {
        "galvanic couple": "galvanic cell"
    },
    {
        ", the more active metal corrodes at an accelerated rate and the more ": null
    },
    {
        "noble metal": "noble metal"
    },
    {
        " corrodes at a slower rate. When immersed separately, each metal corrodes at its own rate. What type of metal to use is readily determined by following the ": null
    },
    {
        "galvanic series": "galvanic series"
    },
    {
        ". For example, zinc is often used as a sacrificial anode for steel structures. Galvanic corrosion is of major interest to the marine industry and also anywhere water contacts pipes or metal structures.     Factors such as relative size of ": null
    },
    {
        "anode": "anode"
    },
    {
        ", types of metal, and operating conditions  affect galvanic corrosion. The surface area ratio of the anode and ": null
    },
    {
        "cathode": "cathode"
    },
    {
        " directly affects the corrosion rates of the materials. Galvanic corrosion is often prevented by the use of ": null
    },
    {
        "sacrificial anode": "sacrificial anode"
    },
    {
        "s.          In any given environment , one metal will be either more noble or more active than others, based on how strongly its ions are bound to the surface. Two metals in electrical contact share the same electrons, so that the tug-of-war at each surface is analogous to competition for free electrons between the two materials. Using the electrolyte as a host for the flow of ions in the same direction, the noble metal will take electrons from the active one. The resulting mass flow or electric current can be measured to establish a hierarchy of materials in the medium of interest. This hierarchy is called a galvanic series and is useful in predicting and understanding corrosion.          Often it is possible to chemically remove the products of corrosion. For example, ": null
    },
    {
        "phosphoric acid": "phosphoric acid"
    },
    {
        " in the form of ": null
    },
    {
        "naval jelly": "naval jelly"
    },
    {
        " is often applied to ferrous tools or surfaces to remove rust. Corrosion removal should not be confused with ": null
    },
    {
        "electropolishing": "electropolishing"
    },
    {
        ", which removes some layers of the underlying metal to make a smooth surface. For example, phosphoric acid may also be used to electropolish copper but it does this by removing copper, not the products of copper corrosion.       Some metals are more intrinsically resistant to corrosion than others . There are various ways of ": null
    },
    {
        "protecting metals from corrosion": "anti-corrosion"
    },
    {
        " including painting, ": null
    },
    {
        "hot dip galvanizing": "hot dip galvanizing"
    },
    {
        ", and combinations of these.  Piping Technology & Products,          The materials most resistant to corrosion are those for which corrosion is ": null
    },
    {
        "thermodynamically": "thermodynamics"
    },
    {
        " unfavorable. Any corrosion products of ": null
    },
    {
        "gold": "gold"
    },
    {
        " or ": null
    },
    {
        "platinum": "platinum"
    },
    {
        " tend to decompose spontaneously into pure metal, which is why these elements can be found in metallic form on Earth and have long been valued. More common base metals can only be protected by more temporary means.     Some metals have naturally slow ": null
    },
    {
        "reaction kinetics": "chemical kinetics"
    },
    {
        ", even though their corrosion is thermodynamically favorable. These include such metals as ": null
    },
    {
        "zinc": "zinc"
    },
    {
        ", ": null
    },
    {
        "magnesium": "magnesium"
    },
    {
        ", and ": null
    },
    {
        "cadmium": "cadmium"
    },
    {
        ". While corrosion of these metals is continuous and ongoing, it happens at an acceptably slow rate. An extreme example is ": null
    },
    {
        "graphite": "graphite"
    },
    {
        ", which releases large amounts of energy upon ": null
    },
    {
        "oxidation": "oxidation"
    },
    {
        ", but has such slow kinetics that it is effectively immune to electrochemical corrosion under normal conditions.          Passivation refers to the spontaneous formation of an ultrathin film of corrosion products, known as a passive film, on the metals surface that act as a barrier to further oxidation. The chemical composition and microstructure of a passive film are different from the underlying metal. Typical passive film thickness on aluminium, stainless steels, and alloys is within 42 nanometers. The passive film is different from oxide layers that are formed upon heating and are in the micrometer thickness range – the passive film recovers if removed or damaged whereas the oxide layer does not. Passivation in natural environments such as air, water and soil at moderate ": null
    },
    {
        "pH": "ph"
    },
    {
        " is seen in such materials as ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        ", ": null
    },
    {
        "stainless steel": "stainless steel"
    },
    {
        ", ": null
    },
    {
        "titanium": "titanium"
    },
    {
        ", and ": null
    },
    {
        "silicon": "silicon"
    },
    {
        ".     Passivation is primarily determined by metallurgical and environmental factors. The effect of pH is summarized using ": null
    },
    {
        "Pourbaix diagram": "pourbaix diagram"
    },
    {
        "s, but many other factors are influential. Some conditions that inhibit passivation include high pH for aluminium and zinc, low pH or the presence of ": null
    },
    {
        "chloride": "chloride"
    },
    {
        " ions for stainless steel, high temperature for titanium and ": null
    },
    {
        "fluoride": "fluoride"
    },
    {
        " ions for silicon. On the other hand, unusual conditions may result in passivation of materials that are normally unprotected, as the alkaline environment of ": null
    },
    {
        "concrete": "concrete"
    },
    {
        " does for ": null
    },
    {
        "steel": "steel"
    },
    {
        " rebar": "rebar"
    },
    {
        ". Exposure to a liquid metal such as ": null
    },
    {
        "mercury": "mercury"
    },
    {
        " or hot ": null
    },
    {
        "solder": "solder"
    },
    {
        " can often circumvent passivation mechanisms.       Passivation is extremely useful in mitigating corrosion damage, however even a high-quality alloy will corrode if its ability to form a passivating film is hindered. Proper selection of the right grade of material for the specific environment is important for the long-lasting performance of this group of materials. If breakdown occurs in the passive film due to chemical or mechanical factors, the resulting major modes of corrosion may include ": null
    },
    {
        "pitting corrosion": "pitting corrosion"
    },
    {
        ", ": null
    },
    {
        "crevice corrosion": "crevice corrosion"
    },
    {
        ", and ": null
    },
    {
        "stress corrosion cracking": "stress corrosion cracking"
    },
    {
        ".             Certain conditions, such as low concentrations of oxygen or high concentrations of species such as chloride which compete as ": null
    },
    {
        "anion": "anion"
    },
    {
        "s, can interfere with a given alloys ability to re-form a passivating film. In the worst case, almost all of the surface will remain protected, but tiny local fluctuations will degrade the oxide film in a few critical points. Corrosion at these points will be greatly amplified, and can cause corrosion pits of several types, depending upon conditions. While the corrosion pits only ": null
    },
    {
        "nucleate": "nucleation"
    },
    {
        " under fairly extreme circumstances, they can continue to grow even when conditions return to normal, since the interior of a pit is naturally deprived of oxygen and locally the pH decreases to very low values and the corrosion rate increases due to an autocatalytic process. In extreme cases, the sharp tips of extremely long and narrow corrosion pits can cause ": null
    },
    {
        "stress concentration": "stress concentration"
    },
    {
        " to the point that otherwise tough alloys can shatter; a thin film pierced by an invisibly small hole can hide a thumb sized pit from view. These problems are especially dangerous because they are difficult to detect before a part or structure ": null
    },
    {
        "fails": "structural failure"
    },
    {
        ". Pitting remains among the most common and damaging forms of corrosion in passivated alloys, but it can be prevented by control of the alloys environment.     Pitting results when a small hole, or cavity, forms in the metal, usually as a result of de-passivation of a small area. This area becomes anodic, while part of the remaining metal becomes cathodic, producing a localized galvanic reaction. The deterioration of this small area penetrates the metal and can lead to failure. This form of corrosion is often difficult to detect due to the fact that it is usually relatively small and may be covered and hidden by corrosion-produced compounds.                Stainless steel can pose special corrosion challenges, since its passivating behavior relies on the presence of a major alloying component . Because of the elevated temperatures of ": null
    },
    {
        "welding": "welding"
    },
    {
        " and heat treatment, ": null
    },
    {
        "chromium carbide": "chromium carbide"
    },
    {
        "s can form in the ": null
    },
    {
        "grain boundaries": "crystallite"
    },
    {
        " of stainless alloys. This chemical reaction robs the material of chromium in the zone near the grain boundary, making those areas much less resistant to corrosion. This creates a ": null
    },
    {
        "galvanic couple": "galvanic corrosion"
    },
    {
        " with the well-protected alloy nearby, which leads to weld decay in highly corrosive environments. This process can seriously reduce the mechanical strength of welded joints over time.     A stainless steel is said to be sensitized if chromium carbides are formed in the microstructure. A typical microstructure of a normalized ": null
    },
    {
        "type 42 stainless steel": "sae 304 stainless steel"
    },
    {
        " shows no signs of sensitization, while a heavily sensitized steel shows the presence of grain boundary precipitates. The dark lines in the sensitized microstructure are networks of chromium carbides formed along the grain boundaries.     Special alloys, either with low carbon content or with added carbon ": null
    },
    {
        "getter": "getter"
    },
    {
        "s such as titanium and ": null
    },
    {
        "niobium": "niobium"
    },
    {
        " , can prevent this effect, but the latter require special heat treatment after welding to prevent the similar phenomenon of knifeline attack . As its name implies, corrosion is limited to a very narrow zone adjacent to the weld, often only a few micrometers across, making it even less noticeable.             ": null
    },
    {
        "Crevice corrosion": "crevice corrosion"
    },
    {
        " is a localized form of corrosion occurring in confined spaces , to which the access of the working fluid from the environment is limited. Formation of a differential aeration cell leads to corrosion inside the crevices. Examples of crevices are gaps and contact areas between parts, under gaskets or seals, inside cracks and seams, spaces filled with deposits and under sludge piles.     Crevice corrosion is influenced by the crevice type , crevice geometry , and metallurgical and environmental factors. The susceptibility to crevice corrosion can be evaluated with ASTM standard procedures. A critical crevice corrosion temperature is commonly used to rank a materials resistance to crevice corrosion.         In the ": null
    },
    {
        "chemical": "chemical"
    },
    {
        " industry": "industry"
    },
    {
        ", hydrogen grooving is the corrosion of piping by grooves created by the interaction of a corrosive agent, corroded pipe constituents, and ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " gas": "gas"
    },
    {
        " bubble": "bubble"
    },
    {
        "s.  For example, when ": null
    },
    {
        "sulfuric acid": "sulfuric acid"
    },
    {
        "  flows through ": null
    },
    {
        "steel": "steel"
    },
    {
        " pipes, the ": null
    },
    {
        "iron": "iron"
    },
    {
        " in the steel reacts with the ": null
    },
    {
        "acid": "acid"
    },
    {
        " to form a ": null
    },
    {
        "passivation": "passivation"
    },
    {
        " coating of ": null
    },
    {
        "iron sulfate": "iron sulfate"
    },
    {
        "  and hydrogen gas . The iron sulfate coating will protect the steel from further reaction; however, if hydrogen bubbles contact this coating, it will be removed. Thus, a groove will be formed by a traveling bubble, exposing more steel to the acid: a ": null
    },
    {
        "vicious cycle": "vicious cycle"
    },
    {
        ". The grooving is exacerbated by the tendency of subsequent bubbles to follow the same path.          ": null
    },
    {
        "High-temperature corrosion": "high-temperature corrosion"
    },
    {
        " is chemical deterioration of a material as a result of heating. This non-galvanic form of corrosion can occur when a metal is subjected to a hot atmosphere containing oxygen, sulfur, or other compounds capable of oxidizing the material concerned. For example, materials used in aerospace, power generation and even in car engines have to resist sustained periods at high temperature in which they may be exposed to an atmosphere containing potentially highly corrosive products of combustion.     The products of high-temperature corrosion can potentially be turned to the advantage of the engineer. The formation of oxides on stainless steels, for example, can provide a protective layer preventing further atmospheric attack, allowing for a material to be used for sustained periods at both room and high temperatures in hostile conditions. Such high-temperature corrosion products, in the form of ": null
    },
    {
        "compacted oxide layer glaze": "compacted oxide layer glaze"
    },
    {
        "s, prevent or reduce wear during high-temperature sliding contact of metallic surfaces. ": null
    },
    {
        "Thermal oxidation": "thermal oxidation"
    },
    {
        " is also commonly used as a route towards the obtainment of controlled oxide nanostructures, including ": null
    },
    {
        "nanowires": "nanowires"
    },
    {
        " and thin films.          ": null
    },
    {
        "Microbial corrosion": "microbial corrosion"
    },
    {
        ", or commonly known as microbiologically influenced corrosion , is a corrosion caused or promoted by ": null
    },
    {
        "microorganism": "microorganism"
    },
    {
        "s, usually ": null
    },
    {
        "chemoautotroph": "chemoautotroph"
    },
    {
        "s. It can apply to both metallic and non-metallic materials, in the presence or absence of oxygen. ": null
    },
    {
        "Sulfate-reducing bacteria": "sulfate-reducing bacteria"
    },
    {
        " are active in the absence of oxygen ; they produce ": null
    },
    {
        "hydrogen sulfide": "hydrogen sulfide"
    },
    {
        ", causing ": null
    },
    {
        "sulfide stress cracking": "sulfide stress cracking"
    },
    {
        ". In the presence of oxygen , some bacteria may directly oxidize iron to iron oxides and hydroxides, other bacteria oxidize sulfur and produce sulfuric acid causing ": null
    },
    {
        "biogenic sulfide corrosion": "biogenic sulfide corrosion"
    },
    {
        ". ": null
    },
    {
        "Concentration cell": "concentration cell"
    },
    {
        "s can form in the deposits of corrosion products, leading to localized corrosion.     Accelerated low-water corrosion is a particularly aggressive form of MIC that affects steel piles in seawater near the low water tide mark. It is characterized by an orange sludge, which smells of hydrogen sulfide when treated with acid. Corrosion rates can be very high and design corrosion allowances can soon be exceeded leading to premature failure of the steel pile. JE Breakell, M Siegwart, K Foster, D Marshall, M Hodgson, R Cottis, S Lyon . Management of Accelerated Low Water Corrosion in Steel Maritime Structures, Volume 42 of CIRIA Series,  Piles that have been coated and have cathodic protection installed at the time of construction are not susceptible to ALWC. For unprotected piles, sacrificial anodes can be installed locally to the affected areas to inhibit the corrosion or a complete retrofitted sacrificial anode system can be installed. Affected areas can also be treated using cathodic protection, using either sacrificial anodes or applying current to an inert anode to produce a calcareous deposit, which will help shield the metal from further attack.          ": null
    },
    {
        "Metal dusting": "metal dusting"
    },
    {
        " is a catastrophic form of corrosion that occurs when susceptible materials are exposed to environments with high carbon activities, such as synthesis gas and other high-CO environments. The corrosion manifests itself as a break-up of bulk metal to metal powder. The suspected mechanism is firstly the deposition of a graphite layer on the surface of the metal, usually from ": null
    },
    {
        "carbon monoxide": "carbon monoxide"
    },
    {
        " in the vapor phase. This graphite layer is then thought to form metastable M 42 C species , which migrate away from the metal surface. However, in some regimes no M 42 C species is observed indicating a direct transfer of metal atoms into the graphite layer.          Various treatments are used to slow corrosion damage to metallic objects which are exposed to the weather, salt water, acids, or other hostile environments. Some unprotected metallic alloys are extremely vulnerable to corrosion, such as those used in ": null
    },
    {
        "neodymium magnet": "neodymium magnet"
    },
    {
        "s, which can ": null
    },
    {
        "spall": "spall"
    },
    {
        " or crumble into powder even in dry, temperature-stable indoor environments unless properly treated to discourage corrosion.       When surface treatments are used to retard corrosion, great care must be taken to ensure complete coverage, without gaps, cracks, or pinhole defects. Small defects can act as an ": null
    },
    {
        "Achilles heel": "achilles heel"
    },
    {
        " , allowing corrosion to penetrate the interior and causing extensive damage even while the outer protective layer remains apparently intact for a period of time.             ": null
    },
    {
        "Plating": "plating"
    },
    {
        ", ": null
    },
    {
        "paint": "paint"
    },
    {
        "ing, and the application of ": null
    },
    {
        "enamel": "vitreous enamel"
    },
    {
        " are the most common ": null
    },
    {
        "anti-corrosion": "anti-corrosion"
    },
    {
        " treatments. They work by providing a barrier of corrosion-resistant material between the damaging environment and the structural material. Aside from cosmetic and manufacturing issues, there may be tradeoffs in mechanical flexibility versus resistance to abrasion and high temperature. Platings usually fail only in small sections, but if the plating is more noble than the substrate , a ": null
    },
    {
        "galvanic couple": "galvanic corrosion"
    },
    {
        " will cause any exposed area to corrode much more rapidly than an unplated surface would. For this reason, it is often wise to plate with active metal such as ": null
    },
    {
        "zinc": "zinc"
    },
    {
        " or ": null
    },
    {
        "cadmium": "cadmium"
    },
    {
        ". If the zinc coating is not thick enough the surface soon becomes unsightly with rusting obvious. The design life is directly related to the metal coating thickness.        Painting either by roller or brush is more desirable for tight spaces; spray would be better for larger coating areas such as steel decks and waterfront applications. Flexible ": null
    },
    {
        "polyurethane": "polyurethane"
    },
    {
        " coatings, like Durabak-M42 for example, can provide an anti-corrosive seal with a highly durable slip resistant membrane. Painted coatings are relatively easy to apply and have fast drying times although temperature and humidity may cause dry times to vary.       If the environment is controlled , ": null
    },
    {
        "corrosion inhibitor": "corrosion inhibitor"
    },
    {
        "s can often be added to it. These chemicals form an electrically insulating or chemically impermeable coating on exposed metal surfaces, to suppress electrochemical reactions. Such methods make the system less sensitive to scratches or defects in the coating, since extra inhibitors can be made available wherever metal becomes exposed. Chemicals that inhibit corrosion include some of the salts in ": null
    },
    {
        "hard water": "hard water"
    },
    {
        " , ": null
    },
    {
        "chromates": "chromates"
    },
    {
        ", ": null
    },
    {
        "phosphate": "phosphate"
    },
    {
        "s, ": null
    },
    {
        "polyaniline": "polyaniline"
    },
    {
        ", other ": null
    },
    {
        "conducting polymers": "conducting polymers"
    },
    {
        " and a wide range of specially-designed chemicals that resemble ": null
    },
    {
        "surfactant": "surfactant"
    },
    {
        "s .             ": null
    },
    {
        "Aluminium alloys": "aluminium alloy"
    },
    {
        " often undergo a surface treatment. Electrochemical conditions in the bath are carefully adjusted so that uniform pores, several ": null
    },
    {
        "nanometer": "nanometer"
    },
    {
        "s wide, appear in the metals oxide film. These pores allow the oxide to grow much thicker than passivating conditions would allow. At the end of the treatment, the pores are allowed to seal, forming a harder-than-usual surface layer. If this coating is scratched, normal passivation processes take over to protect the damaged area.     Anodizing is very resilient to weathering and corrosion, so it is commonly used for building facades and other areas where the surface will come into regular contact with the elements. While being resilient, it must be cleaned frequently. If left without cleaning, ": null
    },
    {
        "panel edge staining": "panel edge staining"
    },
    {
        " will naturally occur. Anodization is the process of converting an anode into cathode by bringing a more active anode in contact with it.       A new form of protection has been developed by applying certain species of bacterial films to the surface of metals in highly corrosive environments. This process increases the corrosion resistance substantially. Alternatively, antimicrobial-producing ": null
    },
    {
        "biofilms": "biofilms"
    },
    {
        " can be used to inhibit mild steel corrosion from ": null
    },
    {
        "sulfate-reducing bacteria": "sulfate-reducing bacteria"
    },
    {
        ".           Controlled permeability formwork is a method of preventing the corrosion of ": null
    },
    {
        "reinforcement": "reinforcement"
    },
    {
        " by naturally enhancing the durability of the ": null
    },
    {
        "cover": "concrete cover"
    },
    {
        " during concrete placement. CPF has been used in environments to combat the effects of ": null
    },
    {
        "carbonation": "carbonation"
    },
    {
        ", chlorides, ": null
    },
    {
        "frost": "frost"
    },
    {
        " and abrasion.          Cathodic protection is a technique to control the corrosion of a metal surface by making that surface the cathode of an ": null
    },
    {
        "electrochemical cell": "electrochemical cell"
    },
    {
        ". Cathodic protection systems are most commonly used to protect steel ": null
    },
    {
        "pipelines": "pipeline transport"
    },
    {
        " and tanks; steel pier ": null
    },
    {
        "piles": "deep foundation"
    },
    {
        ", ships, and offshore ": null
    },
    {
        "oil platform": "oil platform"
    },
    {
        "s.          For effective CP, the potential of the steel surface is polarized more negative until the metal surface has a uniform potential. With a uniform potential, the driving force for the corrosion reaction is halted. For galvanic CP systems, the anode material corrodes under the influence of the steel, and eventually it must be replaced. The ": null
    },
    {
        "polarization": "polarization"
    },
    {
        " is caused by the current flow from the anode to the cathode, driven by the difference in ": null
    },
    {
        "electrode potential": "electrode potential"
    },
    {
        " between the anode and the cathode. The most common sacrificial anode materials are aluminum, zinc, magnesium and related alloys. Aluminum has the highest capacity, and magnesium has the highest driving voltage and is thus used where resistance is higher. Zinc is general purpose and the basis for galvanizing.       For larger structures, galvanic anodes cannot economically deliver enough current to provide complete protection. ": null
    },
    {
        "Impressed current cathodic protection": "impressed current cathodic protection"
    },
    {
        " systems use anodes connected to a ": null
    },
    {
        "DC": "direct current"
    },
    {
        " power source . Anodes for ICCP systems are tubular and solid rod shapes of various specialized materials. These include high silicon ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        ", graphite, mixed metal oxide or platinum coated titanium or niobium coated rod and wires.          Anodic protection impresses anodic current on the structure to be protected . It is appropriate for metals that exhibit passivity and suitably small passive current over a wide range of potentials. It is used in aggressive environments, such as solutions of sulfuric acid.          The formation of an oxide layer is described by the ": null
    },
    {
        "Deal Grove model": "deal grove model"
    },
    {
        ", which is used to predict and control oxide layer formation in diverse situations. A simple test for measuring corrosion is the weight loss method. Fundamentals of corrosion – Mechanisms, Causes and Preventative Methods. Philip A. Schweitzer, Taylor and Francis Group, LLC , p. 42 The method involves exposing a clean weighed piece of the metal or alloy to the corrosive environment for a specified time followed by cleaning to remove corrosion products and weighing the piece to determine the loss of weight. The rate of corrosion is calculated as     : R \\frac     where k is a constant,   W is the weight loss of the metal in time t, A is the surface area of the metal exposed, and ρ is the density of the metal .     Other common expressions for the corrosion rate is penetration depth and change of mechanical properties.          In 42 the US ": null
    },
    {
        "Federal Highway Administration": "federal highway administration"
    },
    {
        " released a study titled Corrosion Costs and Preventive Strategies in the United States on the direct costs associated with metallic corrosion in the US industry. In 42 the total annual direct cost of corrosion in the U.S. was ca. $42 billion . Gerhardus H. Koch, Michiel P.H.Brongers, Neil G. Thompson, Y. Paul Virmani and Joe H. Payer.  – report by CC Technologies Laboratories, Inc. to Federal Highway Administration , September 42 Broken down into five specific industries, the economic losses are $42 billion in infrastructure; $42 billion in production and manufacturing; $42 billion in transportation; $42 billion in government; and $42 billion in utilities.      Rust is one of the most common causes of bridge accidents. As rust has a much higher volume than the originating mass of iron, its build-up can also cause failure by forcing apart adjacent parts. It was the cause of the collapse of the ": null
    },
    {
        "Mianus river bridge": "mianus river bridge"
    },
    {
        " in 42 when the bearings rusted internally and pushed one corner of the road slab off its support. Three drivers on the roadway at the time died as the slab fell into the river below. The following ": null
    },
    {
        "NTSB": "ntsb"
    },
    {
        " investigation showed that a drain in the road had been blocked for road re-surfacing, and had not been unblocked; as a result, runoff water penetrated the support hangers. Rust was also an important factor in the ": null
    },
    {
        "Silver Bridge": "silver bridge"
    },
    {
        " disaster of 42 in ": null
    },
    {
        "West Virginia": "west virginia"
    },
    {
        ", when a steel ": null
    },
    {
        "suspension bridge": "suspension bridge"
    },
    {
        " collapsed within a minute, killing 42 drivers and passengers on the bridge at the time.     Similarly, corrosion of concrete-covered steel and iron can cause the concrete to ": null
    },
    {
        "spall": "spall"
    },
    {
        ", creating severe structural problems. It is one of the most common failure modes of ": null
    },
    {
        "reinforced concrete": "reinforced concrete"
    },
    {
        " bridge": "bridge"
    },
    {
        "s. Measuring instruments based on the half-cell potential can detect the potential corrosion spots before total failure of the concrete structure is reached.     Until 42–42 years ago, galvanized steel pipe was used extensively in the potable water systems for single and multi-family residents as well as commercial and public construction. Today, these systems have long ago consumed the protective zinc and are corroding internally resulting in poor water quality and pipe failures.  The economic impact on homeowners, condo dwellers, and the public infrastructure is estimated at 42 billion dollars as the insurance industry braces for a wave of claims due to pipe failures.       Most ": null
    },
    {
        "ceramic": "ceramic"
    },
    {
        " materials are almost entirely immune to corrosion. The strong ": null
    },
    {
        "chemical bond": "chemical bond"
    },
    {
        "s that hold them together leave very little free chemical energy in the structure; they can be thought of as already corroded. When corrosion does occur, it is almost always a simple dissolution of the material or chemical reaction, rather than an electrochemical process. A common example of corrosion protection in ceramics is the ": null
    },
    {
        "lime": "calcium oxide"
    },
    {
        " added to soda-lime ": null
    },
    {
        "glass": "glass"
    },
    {
        " to reduce its solubility in water; though it is not nearly as soluble as pure ": null
    },
    {
        "sodium silicate": "sodium silicate"
    },
    {
        ", normal glass does form sub-microscopic flaws when exposed to moisture. Due to its ": null
    },
    {
        "brittle": "brittle"
    },
    {
        "ness, such flaws cause a dramatic reduction in the strength of a glass object during its first few hours at room temperature.          ": null
    },
    {
        "Polymer degradation": "polymer degradation"
    },
    {
        " involves several complex and often poorly understood physiochemical processes. These are strikingly different from the other processes discussed here, and so the term corrosion is only applied to them in a loose sense of the word. Because of their large molecular weight, very little ": null
    },
    {
        "entropy": "entropy"
    },
    {
        " can be gained by mixing a given mass of polymer with another substance, making them generally quite difficult to dissolve. While dissolution is a problem in some polymer applications, it is relatively simple to design against.     A more common and related problem is swelling , where small molecules infiltrate the structure, reducing strength and stiffness and causing a volume change. Conversely, many polymers  are intentionally swelled with ": null
    },
    {
        "plasticizer": "plasticizer"
    },
    {
        "s, which can be leached out of the structure, causing brittleness or other undesirable changes.     The most common form of degradation, however, is a decrease in polymer chain length. Mechanisms which break polymer chains are familiar to biologists because of their effect on ": null
    },
    {
        "DNA": "dna"
    },
    {
        ": ": null
    },
    {
        "ionizing radiation": "ionizing radiation"
    },
    {
        " , ": null
    },
    {
        "free radical": "radical"
    },
    {
        "s, and ": null
    },
    {
        "oxidizer": "redox"
    },
    {
        "s such as oxygen, ": null
    },
    {
        "ozone": "ozone"
    },
    {
        ", and ": null
    },
    {
        "chlorine": "chlorine"
    },
    {
        ". ": null
    },
    {
        "Ozone cracking": "ozone cracking"
    },
    {
        " is a well-known problem affecting ": null
    },
    {
        "natural rubber": "natural rubber"
    },
    {
        " for example. Plastic additives can slow these process very effectively, and can be as simple as a UV-absorbing ": null
    },
    {
        "pigment": "pigment"
    },
    {
        " . ": null
    },
    {
        "Plastic shopping bag": "plastic shopping bag"
    },
    {
        "s often do not include these additives so that they break down more easily as ultrafine particles of ": null
    },
    {
        "litter": "litter"
    },
    {
        ".          Glass is characterized by a high degree of corrosion-resistance. Because of its high water-resistance it is often used as primary packaging material in the pharma industry since most medicines are preserved in a watery solution. Bettine Boltres When Glass Meets Pharma: Insights about Glass as Primary Packaging Material. Editio Cantor.  Besides its water-resistance, glass is also robust when exposed to certain chemically aggressive liquids or gases.     ": null
    },
    {
        "Glass disease": "glass disease"
    },
    {
        " is the corrosion of silicate glasses in ": null
    },
    {
        "aqueous": "aqueous"
    },
    {
        " solutions. It is governed by two mechanisms: ": null
    },
    {
        "diffusion": "diffusion"
    },
    {
        "-": null
    },
    {
        "controlled": "reaction-diffusion"
    },
    {
        " leaching and hydrolytic dissolution of the glass network. A.K. Varshneya . . Gulf Professional Publishing. . Both mechanisms strongly depend on the pH of contacting solution: the rate of ion exchange decreases with pH as 42 −42pH whereas the rate of hydrolytic dissolution increases with pH as 42 42pH . M.I. Ojovan, W.E. Lee. . Nova Science Publishers, New York  pp. 42 ff.     Mathematically, corrosion rates of glasses are characterized by normalized corrosion rates of elements NR i which are determined as the ratio of total amount of released species into the water M i to the water-contacting surface area S , time of contact t and weight fraction content of the element in the glass f i :     : \\mathrm_i \\frac .     The overall corrosion rate is a sum of contributions from both mechanisms NR i NRx i +NRh.   Diffusion-controlled leaching is characteristic of the initial phase of corrosion and involves replacement of alkali ions in the glass by a hydronium ion from the solution. It causes an ion-selective depletion of near surface layers of glasses and gives an inverse square root dependence of corrosion rate with exposure time. The diffusion-controlled normalized leaching rate of cations from glasses is given by:     : \\mathrmx_i 42\\rho \\sqrt ,     where t is time, D i is the i-th cation effective diffusion coefficient , which depends on pH of contacting water as D i D i42 ·42 –pH , and ρ is the density of the glass .     Glass network dissolution is characteristic of the later phases of corrosion and causes a congruent release of ions into the water solution at a time-independent rate in dilute solutions :     : \\mathrmh \\rho r_h ,     where r h is the stationary ": null
    },
    {
        "hydrolysis": "hydrolysis"
    },
    {
        " rate of the glass .   In closed systems the consumption of protons from the aqueous phase increases the pH and causes a fast transition to hydrolysis. . D.E. Clark, B.K. Zoitos , William Andrew Publishing/Noyes . However, a further saturation of solution with silica impedes hydrolysis and causes the glass to return to an ion-exchange, e.g. diffusion-controlled regime of corrosion.     In typical natural conditions normalized corrosion rates of silicate glasses are very low and are of the order of 42 −42 –42 −42 g/. The very high durability of silicate glasses in water makes them suitable for hazardous and nuclear waste immobilisation.          There exist numerous standardized procedures for measuring the corrosion  of glasses in neutral, basic, and acidic environments, under simulated environmental conditions, in simulated body fluid, at high temperature and pressure,  . Vscht.cz. Retrieved on 424242 and under other conditions.     The standard procedure ISO 42 . Iso.org . Retrieved on 424242 describes a test of the extraction of water-soluble basic compounds under neutral conditions: 42 g of glass, particle size 42–42 μm, is kept for 42 min in 42 ml de-ionized water of grade 42 at 42  °C; 42 ml of the obtained solution is titrated against 42  mol/l ": null
    },
    {
        "HCl": "hydrochloric acid"
    },
    {
        " solution. The volume of HCl required for neutralization is classified according to the table below.      sub /sub sub /sub sub /sub sub /sub ": null
    }
]