[
    {
        "   Cotton Lyndal Hill is a ": null
    },
    {
        "fictional character": "character"
    },
    {
        " in the ": null
    },
    {
        "Fox": "fox broadcasting company"
    },
    {
        " animated series": "list of animated television series"
    },
    {
        "  King of the Hill  voiced by ": null
    },
    {
        "Toby Huss": "toby huss"
    },
    {
        ". He is the father of ": null
    },
    {
        "Hank Hill": "hank hill"
    },
    {
        ", Good Hank Hill , Junichiro , and, according to him, 42 possible others. He is also a ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " veteran, who had his shins blowed off by a Japanmans machine gun in combat and later had his feet attached to his knees. This made him a foot shorter than his relatives and caused a characteristic waddle. According to Hank, Cotton was 42  ft. 42 in. with his shins and was 42  ft. 42 without them. Despite his disability, he eventually reached the rank of ": null
    },
    {
        "Colonel": "colonel"
    },
    {
        " in the ": null
    },
    {
        "Texas State Defense Forces": "texas state guard"
    },
    {
        " and was addressed as such by his friends. Cotton Hill dies in the 42th season of King of the Hill at age 42       If Cottons story is to be believed, he was born around 42 making him about 42 in the first season of the show. In a third-season episode Hank says Cotton is 42 and in the Season 42 episode Cotton Comes Marching Home , he states himself to be 42 Little is known about Cottons childhood other than that he started out with a gun at an early age according to Hank in the episode How to Fire A Rifle Without Really Trying , that he attended Fort Birk when he was very young and spent much of his childhood there as he revealed in An Officer and A Gentle Boy , that he apparently joined the army when he was only 42 years old as revealed in Shins of the Father , and that Cottons mother apparently died giving birth to him, as he exaggerates in Death Picks Cotton . Almost nothing is known about Cottons father, except that he may have been German, as Peggy tells Bobby in the episode Tears of an Inflatable Clown and the only time Cotton ever himself refers to his father during the entire series is when he shouts at Hank: You aint my daddy, Im your daddy! Cotton also has an unnamed brother .     Cotton was zealously proud of his military service record and his status as a war hero, although he tended to exaggerate his exploits. He often claims to anyone who will listen that he killed fitty men during the war. He consistently reminded everyone within earshot about how he lost his shins during World War II:     I was 42 just a little older than Bobby. But I knew ": null
    },
    {
        "Uncle Sam": "uncle sam"
    },
    {
        " needed me, so I lied and signed up. We had beat the ": null
    },
    {
        "Nazzys": "nazis"
    },
    {
        " in ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", and they shipped me to the ": null
    },
    {
        "Pacific theater": "pacific ocean theater of world war ii"
    },
    {
        ". A ": null
    },
    {
        "Tojo": "hideki tojo"
    },
    {
        " torpedo sent our troop ship to the bottom. I could only save three of my buddies: Fatty, Stinky, and Brooklyn. They were kind of like you fellas to ": null
    },
    {
        "Bill": "bill dauterive"
    },
    {
        ", ": null
    },
    {
        "Dale": "dale gribble"
    },
    {
        ", and ": null
    },
    {
        "Boomhauer": "boomhauer"
    },
    {
        ", only one of them was from ": null
    },
    {
        "Brooklyn": "brooklyn"
    },
    {
        ". Out of the sun came a Tojo ": null
    },
    {
        "Zero": "a6m zero"
    },
    {
        " and put fitty bullets in my back. The blood attracted sharks. I had to give em Fatty. Then things took a turn for the worse. I made it to an island, but it was full of Tojos! They were spitting on the U.S. flag! So I rushed em, but it was a trap. They opened fire and blew my shins off. Last thing I remember, I beat em all to death with a big piece of Fatty. I woke up in a field hospital, and they were sewing my feet to my knees. Cotton is shown walking with distinct knee bends visible through his pants, albeit very close to his feet.     He refers to the Japanese as Tojos, a slur not unlike ": null
    },
    {
        "Jap": "jap"
    },
    {
        " and deriving from war-time Japanese Prime Minister and General ": null
    },
    {
        "Hideki Tojo": "hideki tojo"
    },
    {
        ". He would also refer to the Nazis as Nazzys.     Based upon Cottons uniform in the episode Returning Japanese , he was awarded the following military decorations: ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        ", ": null
    },
    {
        "Purple Heart": "purple heart"
    },
    {
        ", and ": null
    },
    {
        "American Campaign Medal": "american campaign medal"
    },
    {
        ". Cotton left Japan wearing the rank of Private in his own flashback while reminiscing to Hank how he had met Michiko. He was referred to as a colonel repeatedly during the series, reflecting his rank in the Texas State Guard after the war. In the episode When Cotton Comes Marching Home , his ": null
    },
    {
        "Silver Star": "silver star"
    },
    {
        " is displayed in a case at the VFW. In the 42th episode of season 42 he is wearing the third class of the ": null
    },
    {
        "Legion of Honor": "legion of honor"
    },
    {
        ", the highest award given by the French government, who gave it to a select handful of American troops for their service in World War II.     Cotton states in a sixth-season episode that he served with the ": null
    },
    {
        "U.S. Army": "united states army"
    },
    {
        "s ": null
    },
    {
        "42th Infantry Division": "77th sustainment brigade"
    },
    {
        ".     He has a number of war trophies that can be seen in various episodes, including a ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n ": null
    },
    {
        "Pickelhaube": "pickelhaube"
    },
    {
        " which he sometimes used to cut Hanks hair in an even bowl cut during Hanks youth, and a Nazi canoe which he claimed was Hitlers canoe , though given his propensity to exaggerate his war stories, the actual origin of the canoe is uncertain.     The pride he has in his military service often colors his opinions of others; he has often expressed disdain for Hanks lack of service, and enjoys making fun of his son for being excluded due to his narrow urethra. Cotton also has a tendency to exaggerate his service in the war. For example, in the episode Cottons Plot he stated he killed Nazis in Munich on April 42 and Japanese on May 42 in Okinawa.     He also has expressed dislike for veterans of the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", as he blames them to some degree for losing it - though he eventually accords them a measure of respect for trying their best.          It is unknown if Cotton actually ever served in Europe, considering the 42th served in the Pacific Theater and the majority of his war flashbacks are shown to take place in the Pacific fighting the Japanese.     Solomon Islands   Cotton was ordered to retake an airfield on the Solomon Islands. His unit was pinned down by a Japanese machine gun nest high up in a hill. So he sneaked into a fifty-five gallon of sake. He held his breath until the Japanese got good and drunk, and then he jumped out and spit it all out into his Zippo . He hibachid the whole squad.     Guadalcanal   In the episode Yankee Hanky, Cotton references that he and Stinky were on Guadalcanal, and it rained for 42 days.     Anzio   On January 42 42 Cottons unit attacked Anzio. They had caught the Krauts with their pants down and their schnitzel exposed. They had taken the beach by noon, and the town by nightfall.     Normandy   Cotton said that he climbed the cliffs of Normandy with a fifty-pound ice cream maker on his back.     Saipan   Cotton said that he led a platoon of men through the jungles of Sai Pan.     Guam   In 42 in Guam, Cotton crawled through a minefield to retrieve General MacArthurs corn cob pipe.     Philippines   Cotton said that he served in the Philippines.     Iwo Jima   Cotton spent two weeks under a pile of bodies on Iwo Jima . He and Topsy show a bayonet technique Topsy used to gut a kamikaze .     Munich   Cotton claimed to have fought in Munich on April 42 42 and probably longer, but later realized he didnt.     Okinawa   On May 42 42 on Okinawa, Cotton invented a bayonet technique that is still used by the army today.     P.O.W. Camp   Cotton was captured at an unknown time by the Japanese, and put in a bamboo rat cage. He had to eat rats, but let the last one live so he could eat its droppings. He called it Jungle Rice , and said it tasted fine . By September, he was skinny enough to slip through the bars, and strangled the guard with a string made of braided rat tails, and ran to safety. He had also learned to stop his heartbeat, so the Japanese would stop torturing him for a moment, probably at the P.O.W. camp , and claimed that he only cried when the Japanese tore off his fingernails.     Miscellaneous   Cotton severed the windpipe of a German corporal with a two-foot strand of dental floss he kept in his boot. He survived on a life raft by trapping rain water in his upturned eyelid.       Before leaving ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", Cotton had an affair with a Japanese nurse, Michiko, which resulted in the birth of his eldest son , Junichiro ; he left suddenly despite trying to stay, and knew nothing of his child until years later . Michiko is one of the few women he treats respectfully at all and the only woman he treats respectfully all the time.     After the war, Cotton supervised the installation of ": null
    },
    {
        "asbestos": "asbestos"
    },
    {
        " in eleven bowling alleys and every public school in Heimlich County. Cotton eventually traveled back to Japan to reconcile with his long-lost lover, and soon learned of his illegitimate son. Junichiro initially rejected Cottons attempt to make peace, and formally renounced his Hill family heritage. This enraged Cotton, who re-declared war on Japan and planned to spit in the face of ": null
    },
    {
        "Emperor": "emperor of japan"
    },
    {
        " Akihito": "akihito"
    },
    {
        " out of spite . When Cotton saw that Hank and Junichiro had mended fences and even become friends, and Junichiro said that he was not ashamed to be a Hill any more, Cotton ditched his plan and accepted the Emperors kind words. He also made peace with Junichiros mother, who tore a picture taken of them as young adults after World War II in half—and gave the half with her picture to Cotton, while keeping his picture for herself.     Cotton claimed he divorced from Hanks mother, Tilly, because he outgrew her after she lost her large rear end, though it had been stated earlier in the show- such as in season 42 episode Shins of a Father- that Tilly divorced him after years of verbal abuse. His second wife was a ": null
    },
    {
        "hospital volunteer": "hospital volunteer"
    },
    {
        " Deirdre Didi Hill, who is the same age as Hank. Hank was in kindergarten with her . At age 42 Cotton fathered a third son whom he decided to also name Hank, from his second wife Didi. Cotton nicknamed his infant son G.H. .     Cottons relationship with Hank was strained; while Hank seemed to have a deep reverence of his father, he stood up to Cotton on several occasions. Cotton also became depressed by the fact that he and Hank did not have a good relationship, once going homicidally insane when Hank said that he hates him. In spite of all this, however, Cotton never hesitated to refer to Hank as My Boy, and on several occasions tried to help him . Throughout the series, Cotton has also shown several times that he may actually care for Hank, such as calling him a good son in Returning Japanese , saving him from being shot in the episode Yankee Hankee , and leaving and trusting Hank with his last requests and personal possessions in Serving me right for giving George S Patton the bathroom key . The most likely reason why Cotton treats Hank horribly is most likely because he hates various aspects of Hanks life, such as his job as a propane salesman, his place of birth , his personality, how he chooses to raise Bobby, his marriage to Peggy, how he is different from his cousin Dusty, how Hank thwarted his plan to assassinate Fidel Castro and most importantly how Hank did not follow in his fathers footsteps and become a war hero.     Cotton had an antagonistic relationship with Peggy, whom he addressed as Hanks wife among other epithets. On rare occasions though, Cotton evinced a grudging respect for Peggy, as in To Spank With Love and Cottons Plot.     Cotton appears to have a good relationship with Bobby. He once conceded that Hank was a better father than himself, stating, You made Bobby. All I made was you. Cotton shows that he is proud of Bobby and supports him. Once contemplating suicide, Cotton confides in Bobby and gives him a letter of recommendation for the army, irking Hank. Cotton often tries to pass on his misogynistic views to Bobby, even going so far as to try to buy him a hooker once, although Hank and Peggy are always able to reverse the damage. Cotton demonstrates his affection for Bobby in numerous instances. In How to Fire a Rifle Without Really Trying , he comes to watch Bobby and Hank shoot in a father-son shooting competition, stating, Im always here to support my Bobby. In Revenge of the Lutefisk , Cotton even goes so far as to take the blame for Bobby after Bobby confesses he was the one who burned down the church and Didi reveals to Bobby that Cotton told her that if their unborn child turned out as good as Bobby, he wouldnt abandon it. Reflecting on Cottons relationship with his grandson in Death Picks Cotton, Hank states, Even though he hates most things, he does love Bobby. It could be inferred that his love for Bobby is mixed also with a deep pride and respect for him, viewing him as actually tougher than Hank. Although Cotton respects Bobby more than anyone in the family, on his deathbed in Death Picks Cotton , Cotton claims he does not love anyone, though this could be him just trying to sound tough.       Cotton is a consistently sexist, chauvinistic, violent, abusive and intolerant character. He talks down to women, berates his son, is prone to violent outbursts, and on more than one occasion has exhibited homicidal tendencies. His abrasive manner is consistently embarrassing for Hank and usually infuriating for Hanks wife, ": null
    },
    {
        "Peggy": "peggy hill"
    },
    {
        ". Throughout his history on the series, Cotton never once addressed Peggy by name, but he instead called her Hanks wife , which was used as a ": null
    },
    {
        "running gag": "running gag"
    },
    {
        ", including on the very rare occasion hes trying to be nice to her . He even attempts to pass on some of his sexist traits to Bobby at one point, teaching him that women should be made to cook and clean for their husbands all day long.     On rare occasions, Cotton shows a vulnerable side that he normally keeps hidden: he realizes that he was a terrible father and person, hates himself for growing old and becoming disabled, and readily admits that he would die to protect his grandson, ": null
    },
    {
        "Bobby": "bobby hill"
    },
    {
        " .     Cotton also demonstrates a rough, demanding, and often abusive, but at times inspirational leadership. He admits to Hank that he always wanted to win in battle but accepted defeat when his men did their best. Through tough love and intense physical therapy, Cotton also helped Peggy walk again after a debilitating skydiving accident crippled her. Hank was initially wary of this, because he feared that Cotton was simply taking advantage of Peggys brief disability in order to humiliate her.     It was never revealed throughout the series how Cotton became such a nasty and rude character, or if he ever was a different person. It is most likely his military upbringing during his childhood and his eventual military service. Cotton has also shown in multiple episodes that he suffers from mild to severe post traumatic stress disorder which can explain for majority of his violent outbursts . Whatever the reason is, Cotton never sought recognition for how he treated Hank, Peggy, Tilly and many others throughout the series. In the episode Hank gets Dusted Hank says straight up to his cousin Dusty that Cotton is in fact a jack-ass.       In the season 42 episode ": null
    },
    {
        "Death Picks Cotton": "death picks cotton"
    },
    {
        ", Cotton suffers severe injuries while at a Japanese restaurant in Arlen. Climbing onto a grill table, he chokes on a piece of shrimp , then slips and falls on the hot surface. He is taken to the hospital and diagnosed with a ": null
    },
    {
        "hip fracture": "hip fracture"
    },
    {
        ", severe burns on his arms, torn ligaments in his ankle/knee joints, and an infection of his ": null
    },
    {
        "esophagus": "esophagus"
    },
    {
        " due to swallowing the shrimp. X-rays reveal that he has four rusty bullets lodged in his back and one in his heart from old war wounds. In spite of his injuries and a ": null
    },
    {
        "heart attack": "heart attack"
    },
    {
        " suffered while in the hospital, Cotton survives long enough to torment both Hank and Peggy, even slowing his heartbeat down to feign death .     The last person to see him alive is Peggy, who tells him that despite Cottons constant torture of his son, Hank has always loved him and that she hopes he will live forever in the friendless, spiteful existence he has made for himself as the unhappy, unpleasant person he is. Cotton replies Oh, do ya, now?, laughs and then dies. Peggy does not tell Hank of this exchange; instead, she lies that Cottons last words were kind ones meant for Hank. In the final scene of the episode, ": null
    },
    {
        "Dale Gribble": "dale gribble"
    },
    {
        " fulfills a request from Cotton to blow up a storage shed Hank has built. Hank initially plans to honor a separate wish, to have Cottons head detached from his body and sent to the ": null
    },
    {
        "Emperor of Japan": "emperor of japan"
    },
    {
        ", but Peggy stops him by claiming that Cotton withdrew the request just before his death. Neither Didi nor G.H. appear in Death Picks Cotton, nor is his funeral shown. He was to have been buried at the ": null
    },
    {
        "Texas State Cemetery": "texas state cemetery"
    },
    {
        ", a grave which he earned in recognition of his military service, as explained by the episode Cottons Plot , although he ended up being cremated instead.     In the season 42 episode Serves Me Right for Giving General George S. Patton the Bathroom Key, Hank receives from Didi a box containing Cottons personal possessions and a list of embarrassing last requests. Cotton also left Hank a rude message on his tape recorder telling Hank that he wanted all the embarrassing requests completed by him. Peggy did not want Hank to fulfill Cottons wishes, but Hank said that fulfilling Cottons last requests was the best gift he had ever received from his father. Hank completed every single one of the humiliating requests, which Hank felt was Cottons way of humiliating Hank one last time. The last request Cotton left was to have his cremated remains flushed down a bar toilet that General George S. Patton once used; such practice was also a tradition in Cottons platoon, and all of Cottons deceased war buddies were also flushed down the toilet. Hank and his friends respectively honored the request and flushed Cottons remains down the toilet, resulting in the toilet being plugged and the bar owner demanding Hank pay for the damage. As a result of this, Peggy claims at the end of the episode that even though Cotton is dead, he will always find a way to disrupt their lives. Cottons spirit and memory lives on for the rest of the King of the Hill series.     Fox published the following ": null
    },
    {
        "obituary": "obituary"
    },
    {
        " for Cotton:     Cotton Hill, age 42 World War II veteran, died Sunday in a Texas VA hospital. Hill suffered from several injuries ranging from four rusty bullets lodged in his back from his military service, a broken hip and torn ligaments in his ankle-knees, to an infection in his esophagus and severe burns caused by a freak shrimp accident that occurred earlier this week at Tokyakis Japanese restaurant. Hill leaves behind sons Hank Hill and G.H. ; daughter-in-law Peggy Hill; grandson Bobby Hill; ex-wife Tilly; second wife Didi; first love and former Japanese lover Michiko; an illegitimate Japanese son, Junichiro; and nephew ": null
    },
    {
        "Dusty Hill": "dusty hill"
    },
    {
        " .  ": null
    }
]