[
    {
        "           The Council of Florence is the seventeenth ": null
    },
    {
        "ecumenical council": "ecumenical council"
    },
    {
        " recognized by the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", held between 42 to 42 It was convoked as the Council of Basel by ": null
    },
    {
        "Pope Martin V": "pope martin v"
    },
    {
        " shortly before his death in February 42 and took place in the context of the ": null
    },
    {
        "Hussite wars": "hussite wars"
    },
    {
        " in Bohemia and the ": null
    },
    {
        "rise of the Ottoman Empire": "rise of the ottoman empire"
    },
    {
        ". At stake was the greater conflict between the ": null
    },
    {
        "Conciliar movement": "conciliar movement"
    },
    {
        " and the principle of ": null
    },
    {
        "papal supremacy": "papal supremacy"
    },
    {
        ".     The Council entered a second phase after ": null
    },
    {
        "Emperor Sigismund": "sigismund, holy roman emperor"
    },
    {
        "s death in 42 ": null
    },
    {
        "Pope Eugene IV": "pope eugene iv"
    },
    {
        " convoked a rival Council of Ferrara  on 42 January 42 and succeeded in drawing the ": null
    },
    {
        "Byzantine": "byzantine"
    },
    {
        " ambassadors to Italy. The Council of Basel first suspended him, declared him a ": null
    },
    {
        "heretic": "heresy"
    },
    {
        ", and then in November 42 elected an ": null
    },
    {
        "antipope": "antipope"
    },
    {
        ", ": null
    },
    {
        "Felix V": "felix v"
    },
    {
        ". The rival Council of Florence  concluded in 42 after negotiating ": null
    },
    {
        "unions": "church union"
    },
    {
        " with the various ": null
    },
    {
        "eastern churches": "eastern christianity"
    },
    {
        ". This bridging of the ": null
    },
    {
        "Great Schism": "east–west schism"
    },
    {
        " proved fleeting, but was a political coup for the papacy. In 42 Sigismunds successor ": null
    },
    {
        "Frederick III": "frederick iii, holy roman emperor"
    },
    {
        " commanded the city of ": null
    },
    {
        "Basel": "basel"
    },
    {
        " to expel the Council of Basel; the ": null
    },
    {
        "rump": "rump organization"
    },
    {
        " council reconvened in ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        " before dissolving itself in 42       The initial location in the ": null
    },
    {
        "Prince-Bishopric of Basel": "prince-bishopric of basel"
    },
    {
        " reflected the desire among parties seeking reform to meet outside territories directly controlled by the ": null
    },
    {
        "Pope": "papal states"
    },
    {
        ", the ": null
    },
    {
        "Emperor": "holy roman empire"
    },
    {
        " or the ": null
    },
    {
        "kings": "monarch"
    },
    {
        " of ": null
    },
    {
        "Aragon": "crown of aragon"
    },
    {
        " and ": null
    },
    {
        "France": "kingdom of france"
    },
    {
        ", whose influences the council hoped to avoid. ": null
    },
    {
        "Ambrogio Traversari": "ambrogio traversari"
    },
    {
        " attended the Council of Basel as ": null
    },
    {
        "legate": "papal legate"
    },
    {
        " of ": null
    },
    {
        "Pope Eugene IV": "pope eugene iv"
    },
    {
        ".     Under pressure for ecclesiastical reform, ": null
    },
    {
        "Pope Martin V": "pope martin v"
    },
    {
        " sanctioned a decree of the ": null
    },
    {
        "Council of Constance": "council of constance"
    },
    {
        " obliging the ": null
    },
    {
        "papacy": "papacy"
    },
    {
        " to summon general councils periodically. At the expiration of the first term fixed by this decree, ": null
    },
    {
        "Pope Martin V": "pope martin v"
    },
    {
        " complied by calling a council at ": null
    },
    {
        "Pavia": "pavia"
    },
    {
        ". Due to an epidemic the location transferred almost at once to ": null
    },
    {
        "Siena": "siena"
    },
    {
        "  and disbanded, in circumstances still imperfectly known, just as it had begun to discuss the subject of reform . The next council fell due at the expiration of seven years in 42; Martin V duly convoked it for this date to the town of ": null
    },
    {
        "Basel": "basel"
    },
    {
        " and selected to preside over it the cardinal ": null
    },
    {
        "Julian Cesarini": "julian cesarini"
    },
    {
        ", a well-respected ": null
    },
    {
        "prelate": "prelate"
    },
    {
        ". Martin himself, however, died before the opening of the synod.     The Council was seated on 42 December 42 at a period when the ": null
    },
    {
        "conciliar movement": "conciliar movement"
    },
    {
        " was strong and the authority of the papacy weak. The Council at Basel opened with only a few bishops and abbots attending, but it grew rapidly and to make its numbers greater gave the lower orders a majority over the bishops. It adopted an anti-papal attitude, proclaimed the superiority of the Council over the Pope and prescribed an ": null
    },
    {
        "oath": "profession of the supreme pontiff"
    },
    {
        " to be taken by every Pope on his election. On 42 December Martins successor, ": null
    },
    {
        "Pope Eugene IV": "pope eugene iv"
    },
    {
        ", tried to dissolve it and open a new council on Italian soil at Bologna, but he was overruled.     ": null
    },
    {
        "Sigismund": "sigismund, holy roman emperor"
    },
    {
        ", King of Hungary and titular King of Bohemia, had been defeated at the ": null
    },
    {
        "Battle of Domažlice": "battle of domažlice"
    },
    {
        " in the fifth crusade against the ": null
    },
    {
        "Hussites": "hussites"
    },
    {
        " in August 42 Under his sponsorship, the Council negotiated a peace with ": null
    },
    {
        "Calixtine faction": "calixtines"
    },
    {
        " of the Hussites in January 42 Pope Eugene acknowledged the council in May and crowned Sigismund ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        " on 42 May 42 The ": null
    },
    {
        "divided Hussites": "taborites"
    },
    {
        " were ": null
    },
    {
        "defeated in May": "battle of lipany"
    },
    {
        " 42 In June 42 the pope had to flee a revolt in Rome and began a ten-year exile in ": null
    },
    {
        "Florence": "florence"
    },
    {
        ".     When the Council was moved from Basel to ": null
    },
    {
        "Ferrara": "ferrara"
    },
    {
        " in 42 some remained at Basel, claiming to be the Council. They elected ": null
    },
    {
        "Amadeus VIII, Duke of Savoy": "amadeus viii, duke of savoy"
    },
    {
        ", as ": null
    },
    {
        "Antipope": "antipope"
    },
    {
        ". Driven out of Basel in 42 they moved to ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        ", where ": null
    },
    {
        "Felix V": "felix v"
    },
    {
        ", the pope they had elected and the only claimant to the papal throne who ever took the oath that they had prescribed, resigned. The next year, they decreed the closure of what for them was still the Council of Basel.     The new council was transferred to ": null
    },
    {
        "Florence": "florence"
    },
    {
        " in 42 because of the danger of ": null
    },
    {
        "plague": "bubonic plague"
    },
    {
        " at Ferrara and because Florence had agreed, against future payment, to finance the Council. . The Council had meanwhile successfully negotiated reunification with several ": null
    },
    {
        "Eastern Churches": "eastern orthodoxy"
    },
    {
        ", reaching agreements on such matters as the Western insertion of the phrase ": null
    },
    {
        "Filioque": "filioque"
    },
    {
        " to the ": null
    },
    {
        "Nicene-Constantinopolitan Creed": "nicene-constantinopolitan creed"
    },
    {
        ", the definition and number of the sacraments, and the doctrine of ": null
    },
    {
        "Purgatory": "purgatory"
    },
    {
        ". Another key issue was papal primacy, which involved the universal and supreme jurisdiction of the Bishop of Rome over the whole Church, including the national Churches of the East and nonreligious matters such as the promise of military assistance against the ": null
    },
    {
        "Ottomans": "ottomans"
    },
    {
        ". The final decree of ": null
    },
    {
        "union": "church union"
    },
    {
        " was a signed document called the  Laetentur Caeli , Let the Heavens Rejoice . Some bishops, perhaps feeling political pressure from the Byzantine Emperor, accepted the decrees of the Council and reluctantly signed. Others did so by sincere conviction, such as ": null
    },
    {
        "Isidore of Kiev": "isidore of kiev"
    },
    {
        ", who subsequently suffered greatly for it. Only one Eastern Bishop, ": null
    },
    {
        "Mark of Ephesus": "mark of ephesus"
    },
    {
        ", refused to accept the union and became the leader of opposition back in Byzantium, while the Serbian patriarch did not even attend the council. The Russians, upon learning of the union, angrily rejected it and ousted any prelate who was even remotely sympathetic to it, declaring the ": null
    },
    {
        "Russian Orthodox Church": "russian orthodox church"
    },
    {
        " as ": null
    },
    {
        "autocephalus": "autocephalus"
    },
    {
        " . Despite the religious union, Western military assistance to Byzantium was ultimately insufficient, and the ": null
    },
    {
        "fall of Constantinople": "fall of constantinople"
    },
    {
        " occurred in May 42 The Council declared the Basel group heretics and excommunicated them, and the superiority of the Pope over the Councils was affirmed in the bull Etsi non dubitemus of 42 April 42       The ": null
    },
    {
        "democratic": "democracy"
    },
    {
        " character of the assembly at Basel was a result of both its composition and its organization. Doctors of ": null
    },
    {
        "theology": "theology"
    },
    {
        ", masters and representatives of chapters, ": null
    },
    {
        "monk": "monk"
    },
    {
        "s and clerks of inferior orders constantly outnumbered the prelates in it, and the influence of the superior clergy had less weight because instead of being separated into ": null
    },
    {
        "nation": "nation"
    },
    {
        "s , as at Constance, the fathers divided themselves according to their tastes or aptitudes into four large committees or deputations . One was concerned with questions of ": null
    },
    {
        "faith": "faith"
    },
    {
        " , another with negotiations for ": null
    },
    {
        "peace": "peace"
    },
    {
        " , the third with ": null
    },
    {
        "reform": "reform movement"
    },
    {
        " , and the fourth with what they called common concerns . Every decision made by three deputations received ratification for the sake of form in general congregation and, if necessary led to ": null
    },
    {
        "decree": "decree"
    },
    {
        "s promulgated in session. Papal critics thus termed the council an assembly of copyists or even a set of grooms and scullions . However, some prelates, although absent, were represented by their proxies.     ": null
    },
    {
        "Nicholas of Cusa": "nicholas of cusa"
    },
    {
        " was a member of the delegation sent to Constantinople with the popes approval to bring back the Byzantine emperor and his representatives to the Council of Florence of 42 At the time of the councils conclusion in 42 Cusa was thirty-eight years old and thus, compared to the other clergy at the council, a fairly young man though one of the more accomplished in terms of the body of his complete works.       From Italy, France and Germany, the fathers came late to Basel. Cesarini devoted all his energies to the war against the ": null
    },
    {
        "Hussite": "hussite"
    },
    {
        "s until the ": null
    },
    {
        "disaster of Taus": "battle of domažlice"
    },
    {
        " forced him to evacuate ": null
    },
    {
        "Bohemia": "kingdom of bohemia"
    },
    {
        " in haste. ": null
    },
    {
        "Pope Eugene IV": "pope eugene iv"
    },
    {
        ", Martin Vs successor, lost hope that the council could be useful owing to the progress of ": null
    },
    {
        "heresy": "heresy"
    },
    {
        ", the reported troubles in ": null
    },
    {
        "Germany": "kingdom of germany"
    },
    {
        ", the war that had lately broken out between the ": null
    },
    {
        "duke": "duke"
    },
    {
        "s of ": null
    },
    {
        "Austria": "duke of austria"
    },
    {
        " and ": null
    },
    {
        "Burgundy": "duchy of burgundy"
    },
    {
        ", and finally, the small number of fathers who had responded to the summons of Martin V. That opinion and his desire to preside over the council in person, induced him to recall the fathers from Germany, as his poor health made it difficult for him to go. He commanded the council to disperse, and appointed ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        " as their meeting place in eighteen months time, with the intention of making the session of the council coincide with some conferences with representatives of the ": null
    },
    {
        "Orthodox Church": "eastern orthodox church"
    },
    {
        " of the Greek East, scheduled to be held there with a view to ": null
    },
    {
        "ecumenical": "ecumenism"
    },
    {
        " union .     That order led to an outcry among the fathers and incurred the deep disapproval of the legate Cesarini. They argued that the Hussites would think the Church afraid to face them and that the ": null
    },
    {
        "laity": "laity"
    },
    {
        " would accuse the clergy of shirking reform, both with disastrous effects. The pope explained his reasons and yielded certain points, but the fathers were intransigent. Considerable powers had been decreed to Church councils by the ": null
    },
    {
        "Council of Constance": "council of constance"
    },
    {
        ", which amid the troubles of the ": null
    },
    {
        "Western Schism": "western schism"
    },
    {
        " had proclaimed the superiority, in certain cases, of the council over the pope, and the fathers at Basel insisted upon their right of remaining assembled. They held sessions, promulgated decrees, interfered in the government of the ": null
    },
    {
        "papal countship of Venaissin": "comtat venaissin"
    },
    {
        ", treated with the Hussites, and, as representatives of the universal Church, presumed to impose laws upon the sovereign pontiff himself.     Eugene IV resolved to resist the Councils claim of supremacy, but he did not dare openly to repudiate the conciliar ": null
    },
    {
        "doctrine": "doctrine"
    },
    {
        " considered by many to be the actual foundation of the authority of the popes before the ": null
    },
    {
        "schism": "schism"
    },
    {
        ". He soon realized the impossibility of treating the fathers of Basel as ordinary ": null
    },
    {
        "rebels": "rebellion"
    },
    {
        ", and tried a compromise; but as time went on, the fathers became more and more intractable, and between him and them gradually arose an impassable barrier.     Abandoned by a number of his ": null
    },
    {
        "cardinals": "cardinal"
    },
    {
        ", condemned by most of the powers, deprived of his ": null
    },
    {
        "dominion": "dominion"
    },
    {
        "s by  condottieri  who shamelessly invoked the authority of the council, the pope made concession after concession and ended on 42 December 42 with a pitiable surrender of all the points at issue in a ": null
    },
    {
        "Papal bull": "papal bull"
    },
    {
        ", the terms of which were dictated by the fathers of Basel, that is, by declaring his bull of dissolution null and void and recognising that the synod as legitimately assembled throughout. However, Eugene IV did not ratify all the decrees coming from Basel, nor make a definite submission to the supremacy of the council. He declined to express any forced pronouncement on this subject, and his enforced silence concealed the secret design of safeguarding the principle of ": null
    },
    {
        "sovereignty": "sovereignty"
    },
    {
        ".        The fathers, filled with suspicion, would allow only the legates of the pope to preside over them on condition of their recognizing the superiority of the council. The legates submitted the humiliating formality but in their own names, it was asserted only after the fact, thus reserving the final judgment of the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        ". Furthermore, the difficulties of all kinds against which Eugene had to contend, such as the insurrection at ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", which forced him to escape by means of the ": null
    },
    {
        "Tiber": "tiber"
    },
    {
        ", lying in the bottom of a boat, left him at first little chance of resisting the enterprises of the council.       Emboldened by their success, the fathers approached the subject of reform, their principal object being to further curtail the power and resources of the papacy. They took decisions on the disciplinary measures that regulated the ": null
    },
    {
        "election": "election"
    },
    {
        "s, on the celebration of ": null
    },
    {
        "divine": "divinity"
    },
    {
        " service and on the periodical holding of diocesan ": null
    },
    {
        "synod": "synod"
    },
    {
        "s and provincial councils, which were usual topics in Catholic councils. They also made decrees aimed at some of the assumed rights by which the popes had extended their power and improved their finances at the expense of the local churches. Thus the council abolished ": null
    },
    {
        "annate": "annate"
    },
    {
        "s, greatly limited the abuse of reservation of the patronage of benefices by the Pope and completely abolished the right claimed by the pope of next presentation to benefices not yet vacant . Other conciliar decrees severely limited the jurisdiction of the court of Rome and even made rules for the election of popes and the constitution of the Sacred College. The fathers continued to devote themselves to the subjugation of the Hussites, and they also intervened, in rivalry with the pope, in the negotiations between France and ": null
    },
    {
        "England": "england"
    },
    {
        ", which led to the ": null
    },
    {
        "treaty of Arras": "treaty of arras"
    },
    {
        ", concluded by ": null
    },
    {
        "Charles VII of France": "charles vii of france"
    },
    {
        " with the duke of ": null
    },
    {
        "Burgundy": "duchy of burgundy"
    },
    {
        ". Also, ": null
    },
    {
        "circumcision": "circumcision"
    },
    {
        " was deemed to be a mortal sin.  Finally, they investigated and judged numbers of private cases, lawsuits between prelates, members of religious orders and holders of benefices, thus themselves committing one of the serious abuses for which they had criticized the court of Rome.       The Council clarified the Latin dogma of papal supremacy:             Eugene IV, however much he may have wished to keep on good terms with the fathers of Basel, found himself neither able nor willing to accept or observe all their decrees. The question of the union with the Greek church, especially, gave rise to a misunderstanding between them which soon led to a rupture. The ": null
    },
    {
        "Byzantine emperor": "byzantine emperor"
    },
    {
        " John VIII Palaiologos": "john viii palaiologos"
    },
    {
        ", pressed hard by the ": null
    },
    {
        "Ottoman Turks": "ottoman turks"
    },
    {
        ", was keen to ally himself with the Catholics. He consented to come with the principal representatives of the Byzantine Church to some place in the West where the union could be concluded in the presence of the pope and of the Latin council. There arose a double negotiation between him and Eugene IV on the one hand and the fathers of Basel on the other. The council wished to fix the meeting-place at a place remote from the influence of the pope, and they persisted in suggesting Basel, ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        " or ": null
    },
    {
        "Savoy": "duchy of savoy"
    },
    {
        ". On the other hand, the Byzantines wanted a coastal location in Italy for their ease of access by ship.            As a result of negotiations with the East, Emperor ": null
    },
    {
        "John VIII Palaiologos": "john viii palaiologos"
    },
    {
        " accepted ": null
    },
    {
        "Pope Eugene IV": "pope eugene iv"
    },
    {
        "s offer. By a bull dated 42 September 42 Pope Eugene again pronounced the dissolution of the Council of Basel and summoned the fathers to ": null
    },
    {
        "Ferrara": "ferrara"
    },
    {
        " in the ": null
    },
    {
        "Po valley": "po valley"
    },
    {
        ".     The first public session at Ferrara began on 42 January 42 Its first act declared the Council of Basel transferred to Ferrara and nullified all further proceedings at Basel. In the second public session , Pope Eugene IV excommunicated all who continued to assemble at Basel.     In early April 42 the Greek contingent, over 42 strong, arrived at Ferrara. On 42 April 42 the first solemn session at Ferrara began, with the Eastern Roman Emperor, the Patriarch of Constantinople and representatives of the ": null
    },
    {
        "Patriarchal Sees of Antioch": "patriarchate of antioch"
    },
    {
        ", ": null
    },
    {
        "Alexandria": "patriarchate of alexandria"
    },
    {
        " and ": null
    },
    {
        "Jerusalem": "greek orthodox patriarch of jerusalem"
    },
    {
        " in attendance and Pope Eugene IV presiding. The early sessions lasted until 42 July 42 with each ": null
    },
    {
        "theological issue of the Great Schism": "theological differences between the catholic church and the eastern orthodox church"
    },
    {
        " hotly debated, including the Processions of the Holy Spirit, the ": null
    },
    {
        "Filioque": "filioque"
    },
    {
        " clause in the ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        ", ": null
    },
    {
        "Purgatory": "purgatory"
    },
    {
        " and ": null
    },
    {
        "papal primacy": "papal primacy"
    },
    {
        ". Resuming proceedings on 42 October 42 the Council focused exclusively on the Filioque matter. Even as it became clear that the Greek Church would never consent to the Filioque clause, the Byzantine Emperor continued to press for a reconciliation.       With finances running thin and on the pretext that the plague was spreading in the area, both the Latins and the Greeks agreed to transfer the council to Florence. Stuart M. McManus, Byzantines in the Florentine polis: Ideology, Statecraft and ritual during the Council of Florence, The Journal of the Oxford University History Society, 42 , pp. 42–42 Continuing at Florence in January 42 the Council made steady progress on a compromise formula, ": null
    },
    {
        " ex filio ": "filioque"
    },
    {
        ".     In the following months, agreement was reached on the Western doctrine of Purgatory and a return to the pre-schism prerogatives of the Papacy. On 42 July 42 an agreement  was signed by all the Eastern bishops but one, Saint Mark of Ephesus, who, contrary to the views of all others, held that Rome continued in both ": null
    },
    {
        "heresy": "heresy"
    },
    {
        " and schism.     To complicate matters, ": null
    },
    {
        "Patriarch Joseph II of Constantinople": "patriarch joseph ii of constantinople"
    },
    {
        " had died the previous month. The Greek Patriarchs were unable to assert that ratification by the Eastern Church could be achieved without a clear agreement of the whole Church.     Upon their return, the Eastern bishops found their attempts toward agreement with the West broadly rejected by the monks, the populace, and by civil authorities . Facing the imminent threat, the Union was officially proclaimed by ": null
    },
    {
        "Isidore of Kiev": "isidore of kiev"
    },
    {
        " in Hagia Sophia on 42 December 42      The Emperor, bishops, and people of Constantinople accepted this act as a temporary provision until the removal of the Ottoman threat. Yet, it was too late: on 42 May 42 ": null
    },
    {
        "Constantinople fell": "fall of constantinople"
    },
    {
        ". The union signed at Florence, down to the present, has not been implemented by most Orthodox Churches.          The Council soon became even more international. The signature of this agreement for the union of the Latins and the Greeks encouraged Pope Eugenius to announce the good news to the ": null
    },
    {
        "Copt": "copt"
    },
    {
        "ic Christians, and invite them to send a delegation to Florence. He wrote a letter on 42 July 42 and to deliver it, sent ": null
    },
    {
        "Alberto da Sarteano": "alberto da sarteano"
    },
    {
        " as an apostolic delegate. On 42 August 42 Sarteano returned with four ": null
    },
    {
        "Ethiopians": "people of ethiopia"
    },
    {
        " from Emperor ": null
    },
    {
        "Zara Yaqob": "zara yaqob"
    },
    {
        " and Copts.  According to a contemporary observer They were black men and dry and very awkward in their bearing really, to see them they appeared to be very weak .  At that time, Rome had delegates from a multitude of nations, from ": null
    },
    {
        "Armenia": "medieval armenia"
    },
    {
        " to ": null
    },
    {
        "Russia": "muscovy"
    },
    {
        ", ": null
    },
    {
        "Greece": "frankokratia"
    },
    {
        " and various parts of north and east ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". Trexler The journey of the Magi p.42       During this time the council of Basel, though nullified at Ferrara and abandoned by Cesarini and most of its members, persisted nonetheless, under the presidency of ": null
    },
    {
        "Cardinal Aleman": "louis aleman"
    },
    {
        ". Affirming its ": null
    },
    {
        "ecumenical": "ecumenical council"
    },
    {
        " character on 42 January 42 it suspended Eugene IV. The council went on to pronounce Eugene IV deposed , giving rise to a new schism by electing duke ": null
    },
    {
        "Amadeus VIII of Savoy": "amadeus viii of savoy"
    },
    {
        ", as pope, who took the name of Felix V.       This schism lasted fully ten years, although the antipope found few adherents outside of his own hereditary states, those of ": null
    },
    {
        "Alfonso V of Aragon": "alfonso v of aragon"
    },
    {
        ", of the ": null
    },
    {
        "Swiss confederation": "old swiss confederacy"
    },
    {
        " and of certain universities. Germany remained neutral; Charles VII of France confined himself to securing to his kingdom  the benefit of a great number of the reforms decreed at Basel; England and Italy remained faithful to Eugene IV. Finally, in 42 ": null
    },
    {
        "Frederick III": "frederick iii, holy roman emperor"
    },
    {
        ", ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ", after negotiations with Eugene, commanded the burgomaster of Basel not to allow the presence of the council any longer in the imperial city.       In June 42 the rump of the council migrated to ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        ". The antipope, at the insistence of France, ended by abdicating . Eugene IV died on 42 February 42 and the council at Lausanne, to save appearances, gave their support to his successor, ": null
    },
    {
        "Pope Nicholas V": "pope nicholas v"
    },
    {
        ", who had already been governing the Church for two years. Trustworthy evidence, they said, proved to them that this pontiff accepted the dogma of the superiority of the council as defined at Constance and at Basel.       The struggle for East-West union at Ferrara and Florence, while promising, never bore fruit. While progress toward union in the East continued to be made in the following decades, all hopes for a proximate reconciliation were dashed with the fall of Constantinople in 42 Following their conquest, the Ottomans encouraged hardline anti-unionist Orthodox clerics in order to divide European Christians.      Perhaps the councils most important historical legacy was the lectures on Greek classical literature given in Florence by many of the delegates from Constantinople, including the renowned Neoplatonist ": null
    },
    {
        "Gemistus Pletho": "gemistus pletho"
    },
    {
        ". These greatly helped the progress of ": null
    },
    {
        "Renaissance humanism": "renaissance humanism"
    },
    {
        ". ": null
    }
]