[
    {
        "   Criminal procedure is the ": null
    },
    {
        "adjudication": "adjudication"
    },
    {
        " process of the ": null
    },
    {
        "criminal law": "criminal law"
    },
    {
        ". While criminal procedure differs dramatically by jurisdiction, the process generally begins with a formal ": null
    },
    {
        "criminal charge": "criminal charge"
    },
    {
        " with the person on trial either being free on ": null
    },
    {
        "bail": "bail"
    },
    {
        " or ": null
    },
    {
        "incarcerated": "incarcerated"
    },
    {
        ", and results in the ": null
    },
    {
        "conviction": "conviction"
    },
    {
        " or ": null
    },
    {
        "acquittal": "acquittal"
    },
    {
        " of the ": null
    },
    {
        "defendant": "defendant"
    },
    {
        ". Criminal procedure can be either in form of inquisitorial or adversarial criminal procedure.       Currently, in many countries with a democratic system and the rule of law, criminal procedure puts the ": null
    },
    {
        "burden of proof": "legal burden of proof"
    },
    {
        " on the ": null
    },
    {
        "prosecution": "prosecution"
    },
    {
        " & ndash; that is, it is up to the prosecution to prove that the defendant is guilty beyond any reasonable doubt, as opposed to having the defense prove that s/he is innocent, and any doubt is resolved in favor of the defendant. This provision, known as the ": null
    },
    {
        "presumption of innocence": "presumption of innocence"
    },
    {
        ", is required, for example, in the 42 countries that are members of the ": null
    },
    {
        "Council of Europe": "council of europe"
    },
    {
        ", under Article 42 of the ": null
    },
    {
        "European Convention on Human Rights": "european convention on human rights"
    },
    {
        ", and it is included in other human rights documents. However, in practice it operates somewhat differently in different countries. Such basic rights also include the right for the defendant to know what offence he or she has been arrested for or is being charged with, and the right to appear before a judicial official within a certain time of being arrested. Many jurisdictions also allow the defendant the right to legal ": null
    },
    {
        "counsel": "counsel"
    },
    {
        " and provide any defendant who cannot afford their own ": null
    },
    {
        "lawyer": "lawyer"
    },
    {
        " with a lawyer paid for at the public expense.       Most countries make a rather clear distinction between civil and criminal procedures. For example, an ": null
    },
    {
        "English": "england"
    },
    {
        " criminal court": "criminal law"
    },
    {
        " may force a defendant to pay a fine as punishment for his crime, and he may sometimes have to pay the ": null
    },
    {
        "legal costs": "legal costs"
    },
    {
        " of the ": null
    },
    {
        "prosecution": "prosecution"
    },
    {
        ". But the victim of the ": null
    },
    {
        "crime": "crime"
    },
    {
        " pursues his claim for ": null
    },
    {
        "compensation": "damages"
    },
    {
        " in a civil, not a criminal, action. In ": null
    },
    {
        "France": "france"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", and many countries besides, the victim of a crime may be awarded ": null
    },
    {
        "damages": "damages"
    },
    {
        " by a ": null
    },
    {
        "criminal court": "criminal law"
    },
    {
        " judge": "judge"
    },
    {
        ".     The standards of proof are higher in a ": null
    },
    {
        "criminal action": "criminal action"
    },
    {
        " than in a civil one since the loser risks not only financial penalties but also being sent to ": null
    },
    {
        "prison": "prison"
    },
    {
        " . In ": null
    },
    {
        "English law": "english law"
    },
    {
        " the prosecution must prove the guilt of a criminal “beyond reasonable doubt”; but the ": null
    },
    {
        "plaintiff": "plaintiff"
    },
    {
        " in a ": null
    },
    {
        "civil action": "civil action"
    },
    {
        " is required to prove his case “on the balance of probabilities”. Beyond reasonable doubt is not defined for the jury which decides the verdict, but it has been said by appeal courts that proving guilt beyond reasonable doubt requires the prosecution to exclude any reasonable hypothesis consistent with innocence: Plomp v. R. In a ": null
    },
    {
        "civil case": "civil case"
    },
    {
        ", however, the court simply weighs the evidence and decides what is most probable.     Criminal and ": null
    },
    {
        "civil procedure": "civil procedure"
    },
    {
        " are different. Although some systems, including the ": null
    },
    {
        "English": "england"
    },
    {
        ", allow a private citizen to bring a ": null
    },
    {
        "criminal prosecution": "criminal prosecution"
    },
    {
        " against another ": null
    },
    {
        "citizen": "citizen"
    },
    {
        ", ": null
    },
    {
        "criminal action": "criminal action"
    },
    {
        "s are nearly always started by the ": null
    },
    {
        "state": "state"
    },
    {
        ". ": null
    },
    {
        "Civil action": "civil action"
    },
    {
        "s, on the other hand, are usually started by ": null
    },
    {
        "individual": "individual"
    },
    {
        "s.     In Anglo-American law, the party bringing a criminal action is called the prosecution, but the party bringing a civil action is the plaintiff. In both kinds of action the other party is known as the defendant. A criminal case in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " against a person named Ms. Sanchez would be entitled United States v.  Sanchez if initiated by the federal government; if brought by a state, the case would typically be called State v. Sanchez or People v. Sanchez. In the United Kingdom, the criminal case would be styled R.  v. Sanchez. In both the United States and the United Kingdom, a civil action between Ms. Sanchez and a Mr. Smith would be Sanchez v. Smith if started by Sanchez and Smith v. Sanchez if begun by Smith.     Evidence given at a ": null
    },
    {
        "criminal trial": "criminal trial"
    },
    {
        " is not necessarily admissible in a ": null
    },
    {
        "civil action": "civil action"
    },
    {
        " about the same matter, just as evidence given in a civil cause is not necessarily admissible on a criminal trial. For example, the victim of a road accident does not directly benefit if the driver who injured him is found guilty of the ": null
    },
    {
        "crime": "crime"
    },
    {
        " of careless driving. He still has to prove his case in a civil action. In fact he may be able to prove his civil case even when the driver is found not guilty in the criminal trial. If the accused has given evidence on his trial he may be cross-examined on those statements in a subsequent civil action regardless of the criminal verdict.     Once the plaintiff has shown that the defendant is liable, the main argument in a civil court is about the amount of ": null
    },
    {
        "money": "money"
    },
    {
        ", or  damages , which the defendant should pay to the plaintiff.        The majority of ": null
    },
    {
        "civil law": "civil law"
    },
    {
        " jurisdictions follow an ": null
    },
    {
        "inquisitorial system": "inquisitorial system"
    },
    {
        " of adjudication, in which judges undertake an active investigation of the claims by examining the evidence at the trial .   In ": null
    },
    {
        "common law": "common law"
    },
    {
        " systems, the trial judge presides over proceedings grounded in the ": null
    },
    {
        "adversarial system": "adversarial system"
    },
    {
        " of ": null
    },
    {
        "dispute resolution": "dispute resolution"
    },
    {
        ", where both the prosecution and the defence prepare arguments to be presented before the court. Some civil law systems have adopted adversarial procedures.     Proponents of either system tend to consider that their system defends best the rights of the innocent. There is a tendency in common law countries to believe that civil law / ": null
    },
    {
        "inquisitorial system": "inquisitorial system"
    },
    {
        "s do not have the so-called ": null
    },
    {
        "presumption of innocence": "presumption of innocence"
    }
]