[
    {
        "         Crisis on Infinite Earths is an ": null
    },
    {
        "American comic book": "american comic book"
    },
    {
        " published by ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        ". The series, written by ": null
    },
    {
        "Marv Wolfman": "marv wolfman"
    },
    {
        " and ": null
    },
    {
        "pencilled": "penciller"
    },
    {
        " by ": null
    },
    {
        "George Pérez": "george pérez"
    },
    {
        ", was first serialized as a 42-issue ": null
    },
    {
        "limited series": "limited series"
    },
    {
        " from April 42 to March 42 As the main piece of a ": null
    },
    {
        "crossover": "crossover"
    },
    {
        " event, some plot elements were featured in ": null
    },
    {
        "tie-in": "tie-in"
    },
    {
        " issues of other publications. Since its initial publication, the series has been reprinted in various formats and editions.     The idea for the series stemmed from Wolfmans desire to abandon the ": null
    },
    {
        "DC Multiverse": "multiverse"
    },
    {
        " depicted in the companys comics—which he thought was unfriendly to readers—and create a single, unified ": null
    },
    {
        "DC Universe": "dc universe"
    },
    {
        " . The foundation of Crisis on Infinite Earths developed through a character  introduced in Wolfmans  The New Teen Titans  in July 42 before the series itself started. Pérez was not the intended artist for the series, but was excited when he learned of it and called illustrating it some of the most fun he ever had.     At the start of Crisis on Infinite Earths, the ": null
    },
    {
        "Anti-Monitor": "anti-monitor"
    },
    {
        " is unleashed on the DC Multiverse and begins to destroy the various Earths that it comprises. The Monitor tries to recruit heroes from around the Multiverse but is murdered, while ": null
    },
    {
        "Brainiac": "brainiac"
    },
    {
        " collaborates with the villains to conquer the remaining Earths. However, both the heroes and villains are eventually united by the ": null
    },
    {
        "Spectre": "spectre"
    },
    {
        "; the series concludes with ": null
    },
    {
        "Kal-L": "superman"
    },
    {
        ", ": null
    },
    {
        "Superboy-Prime": "superboy-prime"
    },
    {
        ", and ": null
    },
    {
        "Alexander Luthor Jr.": "alexander luthor jr."
    },
    {
        " defeating the Anti-Monitor and the creation of a single Earth in place of the Multiverse. Crisis on Infinite Earths is noted for its high death count; hundreds of characters died, including DC icons ": null
    },
    {
        "Kara Zor-El": "supergirl"
    },
    {
        "  and ": null
    },
    {
        "Barry Allen": "flash"
    },
    {
        " . The storys events resulted in the entire DCU being ": null
    },
    {
        "rebooted": "reboot"
    },
    {
        ".     The series was a bestseller for DC and has been reviewed positively by comic book critics, who praised its ambition and dramatic events. The story is credited with popularizing the idea of a large-scale crossover in comics. Crisis on Infinite Earths is the first installment in what became known as the ": null
    },
    {
        "Crisis trilogy": "crisis trilogy"
    },
    {
        "; it was followed by  Infinite Crisis  and  Final Crisis  . The story will serve as inspiration for ": null
    },
    {
        "Crisis on Infinite Earths": "crisis on infinite earths"
    },
    {
        " , an ": null
    },
    {
        "Arrowverse": "arrowverse"
    },
    {
        " crossover event consisting of an episode of each series:  Arrow ,  The Flash ,  Supergirl ,  Legends of Tomorrow , and  Batwoman . The event will also include characters from the television series  Black Lightning ,  Smallville , and  Birds of Prey .         ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " is an ": null
    },
    {
        "American comic book": "american comic book"
    },
    {
        " publisher": "publishing"
    },
    {
        " best known for its ": null
    },
    {
        "superhero stories": "superhero fiction"
    },
    {
        " featuring characters including ": null
    },
    {
        "Batman": "batman"
    },
    {
        ", ": null
    },
    {
        "Superman": "superman"
    },
    {
        ", and ": null
    },
    {
        "Wonder Woman": "wonder woman"
    },
    {
        ".  The company debuted in February 42 with  New Fun: The Big Comic Magazine .  Most of DCs comic books  take place within a ": null
    },
    {
        "shared universe": "shared universe"
    },
    {
        " called the ": null
    },
    {
        "DC Universe": "dc universe"
    },
    {
        " allowing plot elements, characters, and settings to ": null
    },
    {
        "cross over": "crossover"
    },
    {
        " with each other.  The concept of the DCU has provided DCs writers some challenges in maintaining ": null
    },
    {
        "continuity": "continuity"
    },
    {
        ", due to conflicting events within different comics that need to reflect the shared nature of the universe. The Flash of Two Worlds from  The Flash  42 , which featured ": null
    },
    {
        "Barry Allen": "flash"
    },
    {
        "  teaming up with ": null
    },
    {
        "Jay Garrick": "flash"
    },
    {
        "  was the first DC comic to suggest that the DCU was a part of a ": null
    },
    {
        "multiverse": "dc multiverse"
    },
    {
        ".       The DC Multiverse concept was expanded in later years with the DCU having infinite Earths; for example, the Golden Age versions of DC heroes resided on Earth-Two, while DCs Silver Age heroes were from Earth-One. Since Crisis on Earth-One! , DC has used the word ": null
    },
    {
        "Crisis": "crisis"
    },
    {
        " to describe important crossovers within the DC Multiverse.  Over the years, various writers took liberties creating additional parallel Earths as plot devices and to house characters DC had acquired from other companies, making the DC Multiverse a convoluted mess . DCs comic book sales were also far below those of their competitor ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        ".  According to  ComicsAlliance  journalist Chris Sims, the multiverse . . . felt old-fashioned. . . . Marvel, on the other hand, felt contemporary and when you stack them up against each other, theres one difference that sticks out above anything else: Marvel feels unified.      During the ": null
    },
    {
        "Bronze Age of Comic Books": "bronze age of comic books"
    },
    {
        ", writer ": null
    },
    {
        "Marv Wolfman": "marv wolfman"
    },
    {
        " became popular among DCs readers for his work on  Weird War Tales  and  The New Teen Titans . ": null
    },
    {
        "George Pérez": "george pérez"
    },
    {
        ", who illustrated The New Teen Titans, also began to rise to prominence in this era.  In 42 Pérez entered into an exclusive contract with DC, which was later extended one year.  Although The New Teen Titans was a major success for DC, the companys comic book sales were still below Marvels. Wolfman began to attribute this to the DC Multiverse, feeling The Flash of Two Worlds had created a nightmare : it was not reader-friendly for new readers to be able to keep track of and writers struggled with the continuity errors it caused. In The New Teen Titans 42 , Wolfman introduced a new character: the shadowy, potentially villainous ": null
    },
    {
        "Monitor": "monitor"
    },
    {
        "; this laid the foundation for Crisis on Infinite Earths.          In 42 Wolfman was editing  Green Lantern . He got a letter from a fan asking why a character did not recognize ": null
    },
    {
        "Green Lantern": "green lantern"
    },
    {
        " in a recent issue despite the two having had worked together in an issue three years earlier. Soon afterward,  Wolfman pitched Crisis on Infinite Earths as The History of the DC Universe,  seeing it as a way to simplify the DCU and attract new readers.  The History of the DC Universes title was changed to Crisis of Infinite Earths because its premise, involving the destruction of entire worlds, sounded more like a crisis.     Wolfman said when he pitched the series to DC, he realized it was going to be a completely new beginning for the DCU.  I knew up front, and they did too, how big this was going to be, he said. But, no-one knew how well it would sell, or whether it would sell at all. It was a risk DC was willing to take, because my thoughts were that DC needed a lot of help at that time, and they did too.  Wolfman also said he saw it as an attempt to improve DCs reputation for storytelling. Many readers at the time saw them as old-fashioned.     The crossover was fleshed out and coordinated at a meeting attended by president ": null
    },
    {
        "Jenette Kahn": "jenette kahn"
    },
    {
        ", ": null
    },
    {
        "Paul Levitz": "paul levitz"
    },
    {
        ", vice president and executive editor ": null
    },
    {
        "Dick Giordano": "dick giordano"
    },
    {
        " and DCs editors.  In 42 DC hired a researcher to go through their library and read every comic the company had published, a task that took two years. The series was delayed to 42 due to the time for research,  and again to 42 when it was still not ready for 42 and to coincide with DCs fiftieth anniversary.  As an event like Crisis on Infinite Earths had never happened before, those working on it met for around two hours a week; at the time, this was uncommon.     The groundwork for the series was laid the year before it was published. Crisis on Infinite Earths: Absolute Edition One of the greatest challenges for Wolfman and Giordano was coming up with a story. Wolfman cited making use of every DC character and creating a plot that was fun to read and filled with surprises as difficulties, as the series needed to sell well; if it did not, it could have caused a disaster for DC. Plotting became easier once a beginning and an ending had been determined and when Pérez became involved. Crisis on Infinite Earths was DCs first mainstream ": null
    },
    {
        "maxiseries": "limited series"
    },
    {
        ", which was still a relatively new concept.     Early in planning for Crisis on Infinite Earths, a list was made of characters that were part of the DCU; characters from other universes, such as those that formerly belonged to ": null
    },
    {
        "Charlton Comics": "charlton comics"
    },
    {
        ", also were used. According to Wolfman, one of the purposes of Crisis on Infinite Earths was to showcase all the characters DC had. The series is infamous for its high death count. Hundreds of characters died; among the most noted was Barry Allens. Wolfman has said he did not want to kill Allen, but DC ordered him to because it perceived the character as dull. Therefore, he conceived Allens death—in which he runs through time before vanishing—as a way to make the character seem more interesting and hopefully spare him.  Wolfman wanted to make the series unforgettable; he said that many writers had expressed interest in simplifying DCs continuity and he wanted to be the one to do so.     Pérez says he was not the intended artist for Crisis on Infinite Earths, but was excited when he learned about it, seeing it as an opportunity for revenge against Marvel, which he blamed for blocking the  JLA/Avengers  crossover he had been working on. He enjoyed working with Wolfman again, and took a leave of absence from The New Teen Titans to draw the series. George Pérez signs contract with DC, Takes leave of absence from Titans, The Comics Journal 42 , p. 42 DC initially did not know Pérez would want to work on it. According to Pérez, he was motivated by the fact that DC did not know if the series was going to be a success. He also wanted to draw everybody I could get my hands on and called illustrating the series some of the most fun he ever had. Pérez was excited because not only did he get to draw the Teen Titans again, but also obscure characters he was not familiar with, saying he could possibly have never gotten another chance.  One panel in Crisis on Infinite Earths shows the ": null
    },
    {
        "Marvel Universe": "marvel universe"
    },
    {
        " being destroyed with other earths.  When Giordano  had difficulty meeting deadlines while continuing as DC vice president and executive editor, editorial coordinator Pat Bastienne reassigned the inking to ": null
    },
    {
        "Jerry Ordway": "jerry ordway"
    },
    {
        " despite Giordanos objections.       The idea for Crisis on Infinite Earths was first noted in the December 42 issue of  The Comics Journal , which mentioned a twelve-part maxiseries scheduled for 42 The series was announced in Giordanos Meanwhile... column DC ran in its titles in June 42 Giordano warned readers that odd occurrences would begin to happen throughout DCs comics. He also clarified it would commemorate DCs fiftieth anniversary and would provide the company wonderful stepping-stones for new characters and comics. The series was marketed with the tagline Worlds will live, worlds will die and nothing will ever be the same .       The series began in January 42 and lasted for twelve issues, ending in December 42 . The close spacing of Crisis on Infinite Earths and Marvels similar crossover  Secret Wars  caused some fans to create conspiracy theories about ": null
    },
    {
        "idea theft": "plagiarism"
    },
    {
        ". According to writer ": null
    },
    {
        "Steve Gerber": "steve gerber"
    },
    {
        ", the series got virtually no promotion  ... How many handouts did you see? How many posters did you see in peoples windows? How much information was really distributed to the press and how much was gotten just by individual reporters going to Marv Wolfman and Crisis artist George Pérez?           Elements to set up Crisis on Infinite Earths were put in DCs comics years before the crossover took place; an example of this was the Monitors appearance in The New Teen Titans. In a January 42 42 memo, Giordano, Wolfman, and ": null
    },
    {
        "Len Wein": "len wein"
    },
    {
        " instructed editors and writers to use the Monitor twice in the coming year but not to show him: Because this series involves the entire DC Universe we do ask that each Editor and writer cooperate with the project by using a character called The Monitor in their books twice during the next year . This served to set up the series. When Wolfman and Giordano reiterated this in a 42 meeting, some editors were not pleased; one was so miffed he did not speak for the rest of the meeting.     ": null
    },
    {
        "Tie-in": "tie-in"
    },
    {
        "s for Crisis on Infinite Earths were published in DCs ": null
    },
    {
        "ongoing series": "ongoing series"
    },
    {
        ". Unlike the 42 Marvel crossover storyline  The Infinity Gauntlet , where Marvel only published tie-ins in titles that needed a boost in sales, the vast majority of DCs comics featured events that directly tied to the crossover.  The following comic book issues were labeled as part of the crossover; their covers contained a banner that read Special Crisis Cross-Over , along with the logo for DCs fiftieth anniversary.       All-Star Squadron  42–42    Amethyst  42    DC Comics Presents  42–42    Blue Devil  4242    The Fury of Firestorm  42–42    Green Lantern  42–42; 42    Infinity, Inc.  42–42; Annual 42    Justice League of America  42–42; Annual 42   JLA: Incarnations 42    Legion of Super-Heroes  42   The Losers Special 42    The New Teen Titans  42–42    The Omega Men  42    Superman  42–42    Swamp Thing  42    Wonder Woman  42–42   Legends of the DC Universe : Crisis on Infinite Earths 42    Crisis on Infinite Earths 42–42 was published in hardcover  and ": null
    },
    {
        "trade paperback": "trade paperback"
    },
    {
        "  editions, with cover art by George Pérez and Alex Ross.   Crisis on Infinite Earths: The Absolute Edition   is a slipcased, hardcover edition. The first volume reprints the limited series, and the second volume includes scripts, commentaries, retrospectives,  Official Crisis on Infinite Earths Index , and Official Crisis on Infinite Earths Cross-Over Index.   Crisis on Infinite Earths Deluxe Edition . Includes the series and the two-issue series  History of the DC Universe , alongside other bonus material.   Crisis on Infinite Earths Companion Deluxe Edition Vol. 42 . Compiles the tie-in stories released alongside the series.   Crisis on Infinite Earths Companion Deluxe Edition Vol. 42 . Compiles the tie-in stories released alongside the series.   Crisis on Infinite Earths Companion Deluxe Edition Vol. 42 . Compiles the tie-in stories released alongside the series.          The conflicting stories of the DCU are explained as a Multiverse, containing many parallel universes and alternate versions of the characters, with the primary DC continuity referred to as Earth-One. A cosmic being from the beginning of time known as the Monitor catalogues these realities, but he has an evil counterpart, the ": null
    },
    {
        "Anti-Monitor": "anti-monitor"
    },
    {
        ", who comes from an antimatter universe. After an accident with antimatter on one universe, the Anti-Monitor begins destroying many of the realities with a wave of antimatter, planning on becoming sole ruler of all realities.     To combat this, the Monitor recruits heroes from across time and space to set up five towers, to help merge the multiverse back into one to make it stronger. However, he is murdered by his protégée, ": null
    },
    {
        "Harbinger": "harbinger"
    },
    {
        ", who is possessed by one of the Anti-Monitors demons. His death releases enough energy to project the last five parallel Earths into a protective limbo. The Anti-Monitor recruits ": null
    },
    {
        "Psycho-Pirate": "psycho-pirate"
    },
    {
        " to his cause, infusing him with part of his power to manipulate the heroes of Earth42 Earth-S and Earth-X against the rest; this fails when all five Earths enter the limbo universe. Harbinger then recruits heroes from the remaining Earths to lead an assault on the Anti-Monitor in the antimatter universe, using ": null
    },
    {
        "Alexander Luthor Jr.": "alexander luthor jr."
    },
    {
        "s powers to open a portal between the limbo and antimatter universes. ": null
    },
    {
        "Pariah": "pariah"
    },
    {
        " tracks down the Anti-Monitor at his fortress, and the heroes destroy a converter, powered by stellar energy, to destroy the last five Earths; the injured Anti-Monitor retreats and Supergirl dies.     During a lull in the war, the villains unite under ": null
    },
    {
        "Brainiac": "brainiac"
    },
    {
        ", who kills Earth-Twos Alexei Luthor while recruiting the Earth-One Lex Luthor to conquer the remaining Earths. The Anti-Monitor meanwhile creates a new body for himself, and tries to use an antimatter cannon to penetrate the limbo universe and destroy the five partially merged Earths. The Flash dies stopping this attempt. A furious Anti-Monitor absorbs the energy of millions of worlds and vows to travel back through time to prevent the creation of the multiverse. The ": null
    },
    {
        "Spectre": "spectre"
    },
    {
        " unites the heroes and villains by warning them about the Anti-Monitors plan; the heroes travel back in time to stop the Anti-Monitor, while the villains travel back in time to the ancient planet ": null
    },
    {
        "Oa": "oa"
    },
    {
        " to prevent renegade scientist ": null
    },
    {
        "Krona": "krona"
    },
    {
        " from creating the technology necessary for the Anti-Monitors plan to succeed. The villains fail, and Krona continues his experiment. The Anti-Monitor waits for Alex Luthor to reopen the portal between the positive and antimatter universes, capturing the heroes, but a magically empowered Spectre creates an energy overload which shatters space and time. The five Earths merge into a single shared universe, and the superheroes return to the present; only those present at the dawn of time remember the original realities.     A cosmically empowered Anti-Monitor attacks again, transporting the new Earth to the antimatter universe and summoning a horde of shadow demons. He falls in a carefully planned counterattack, culminating in a battle with ": null
    },
    {
        "Kal-L": "superman"
    },
    {
        " Alexander Luthor of Earth-Three and ": null
    },
    {
        "Superboy": "superboy-prime"
    },
    {
        " of Earth-Prime, with help from ": null
    },
    {
        "New Gods": "new gods"
    },
    {
        " adversary ": null
    },
    {
        "Darkseid": "darkseid"
    },
    {
        ". In this final battle the Anti-Monitor, reduced to a flaming head, crashes into a star and is killed by the Earth-Two Superman. As they are the only four who remember the original past, Alex sends Earth-Two Superman, Earth-Two Lois Lane, Earth-Prime Superboy and himself to a pocket paradise dimension, leaving the heroes of the remaining Earth to sort out the aftermath of this crisis.       Despite relatively limited marketing and DC being unsure if the series would be successful, Crisis on Infinite Earths was a bestseller.     ": null
    },
    {
        "IGN": "ign"
    },
    {
        "s Hilary Goldstein summarized the series as a crucial turning point for DC Comics and credited it with saving the company. Goldstein called Wolfmans idea to simplify the DCU bold and unprecedented, noting the storys exceptional size and saying the story was unbelievable , if somewhat aged. He also praised Pérezs detailed artwork, saying no other artist could have possibly illustrated it as well as he did and gave the book a must have rating.  Fellow IGN writer Jesse Schedeen named Crisis on Infinite Earths one of the best DC crossovers, agreeing it was unprecedented and dramatic.      Marc Buxton of  Comic Book Resources  named Crisis on Infinite Earths the greatest comic book crossover ever, saying that no crossover has been bigger or as ambitious: where some events seem hesitant to actually leave a mark on their respective universes, Crisis did it with aplomb . He praised the series for exploring the entire DCU and felt it was a fitting event for DCs fiftieth anniversary.   Nerdist News  noted that many of the series central events—such as the deaths of Supergirl and Barry Allen—have become iconic moments in DCs history.      Not all reviewers have been as positive. Chris Sims wrote the series was messy and built awkwardly, describing it as a textbook definition of style over substance . Sims said it was far from the best work of Wolfman and Pérez; however, he still thought it was groundbreaking, saying, Its the first time in comics history that EVERYTHING was in danger .       A novelization of Crisis on Infinite Earths was written by Wolfman and published by ": null
    },
    {
        "iBooks": "byron preiss"
    },
    {
        " in 42 with cover art by Pérez and ": null
    },
    {
        "Alex Ross": "alex ross"
    },
    {
        ". The book follows the events of the original series; most of the story is presented from Barry Allens ": null
    },
    {
        "point of view": "point of view"
    },
    {
        ", while parts where he is not present are told from a third-person perspective. It also added some details, including internal monologue and updates to make the story more modern, such as characters having cell phones.  In 42 ": null
    },
    {
        "WizKids": "wizkids"
    },
    {
        " issued a toy pack centered around the Anti-Monitor as a part of its DC ": null
    },
    {
        "HeroClix": "heroclix"
    },
    {
        " toy line. The pack came with a large Anti-Monitor figure with LED-lit eyes, several smaller figures, and a map. An exclusive variant, based on the ": null
    },
    {
        "Sinestro Corps": "sinestro corps"
    },
    {
        ", was available at the ": null
    },
    {
        "San Diego Comic-Con": "san diego comic-con"
    },
    {
        " and ": null
    },
    {
        "Gen Con": "gen con"
    },
    {
        " Indy conventions that year.        Though it was not the first large-scale comic book crossover, Crisis on Infinite Earths is generally credited with popularizing the idea.  Comics historian Matthew K. Manning wrote that Crisis on Infinite Earths paved way for all future crossovers of similar scale, and Andrew J. Friedenthal said Crisis showed the two major superhero comic book publishers how they could utilize the continuity established by decades worth of stories to weave together a cohesive, metatextual tapestry that both appealed to long-time readers and brought in massive amounts of money . The series success inspired DC to begin a tradition of summer crossovers ; some of these include  Invasion!  ,  Armageddon 42  ,  Zero Hour: Crisis in Time ! , and  Identity Crisis  , and some mention the events of Crisis on Infinite Earths.  The second part of one of DCs later crossovers,  Convergence  , heavily references the series and sees DCs superheroes travel back to its era. The writers of Convergence all had fun writing stories set during Crisis on Infinite Earths, calling the series an exciting time for DC.       The series had an immediate effect on DC, dividing the companys history into two eras: Pre-Crisis and Post-Crisis . Wolfman and Pérez teamed again to produce the  History of the DC Universe  limited series to summarize the DCUs new history. Many of DCs characters had their histories ": null
    },
    {
        "rebooted": "reboot"
    },
    {
        ". Wonder Womans comic was relaunched entirely by Pérez, Wein, and ": null
    },
    {
        "Greg Potter": "greg potter"
    },
    {
        ".  Superman was first re-envisioned in the limited series  The Man of Steel  by ": null
    },
    {
        "John Byrne": "john byrne"
    },
    {
        "; his comic was retitled  The Adventures of Superman  to make way for a ": null
    },
    {
        "new Superman series": "superman vol. 2"
    },
    {
        ". Batman was minimally affected by the reboot, and his comic was not relaunched. However, he was still given ": null
    },
    {
        "an updated origin": "batman: year one"
    },
    {
        ", courtesy of ": null
    },
    {
        "Frank Miller": "frank miller"
    },
    {
        ". In addition, ": null
    },
    {
        "Wally West": "wally west"
    },
    {
        " replaced Barry Allen as the Flash, the Justice Leagues roster was changed, and characters DC acquired from other companies, such as ": null
    },
    {
        "Fawcett Publications": "fawcett publications"
    },
    {
        " and Charlton Comics, were integrated into the DCU.  The practice of re-envisioning characters in the new DCU lasted well into 42 with properties such as ": null
    },
    {
        "Green Lantern": "green lantern"
    },
    {
        ", ": null
    },
    {
        "Hawkman": "hawkman"
    },
    {
        ", ": null
    },
    {
        "Black Orchid": "black orchid"
    },
    {
        ", and the ": null
    },
    {
        "Suicide Squad": "suicide squad"
    },
    {
        " all being rebooted. The revamp raised sales 42% in the first year, and DC beat Marvel in ": null
    },
    {
        "direct market": "direct market"
    },
    {
        " sales for the first time in August and September 42  The Man of Steel 42 was the bestselling comic book issue of 42      Crisis on Infinite Earths has been referenced several times in the various television series that comprise the ": null
    },
    {
        "Arrowverse": "arrowverse"
    },
    {
        ", starting with the first episode of  The Flash  which aired in October 42 It features a newspaper from 42 that reads Flash Missing, Vanishes in Crisis . ": null
    },
    {
        "Grant Gustin": "grant gustin"
    },
    {
        ", who plays the Flash on the show, has said he thinks the goal of the series is to reach Crisis on Infinite Earths : Obviously wed have to go, I think 42 years to reach that, so theres a possibility for sure. Itll be fun to get there. The concept of a multiverse has been explored several times throughout the history of the franchise. Talking in 42 ": null
    },
    {
        "Geoff Johns": "geoff johns"
    },
    {
        ", when discussing the difference between the ": null
    },
    {
        "DC Extended Universe": "dc extended universe"
    },
    {
        " and the ": null
    },
    {
        "Marvel Cinematic Universe": "marvel cinematic universe"
    },
    {
        ", said We look at it as the multiverse. We have our TV universe and our film universe, but they all co-exist. For us, creatively, its about allowing everyone to make the best possible product, to tell the best story, to do the best world. Everyone has a vision and you really want to let the visions shine through ... Its just a different approach.  The storyline will inspire the 42 Arrowverse crossover, also titled ": null
    },
    {
        "Crisis on Infinite Earths": "crisis on infinite earths"
    },
    {
        " ,  with the original date seen in the pilot episode of The Flash having been moved up by five years.           Crisis on Infinite Earths is the first installment in what became known as the ": null
    },
    {
        "Crisis trilogy": "crisis trilogy"
    },
    {
        ". The second part of the trilogy, the seven-part  Infinite Crisis , was written by Geoff Johns and illustrated by ": null
    },
    {
        "Phil Jimenez": "phil jimenez"
    },
    {
        ", Pérez, ": null
    },
    {
        "Ivan Reis": "ivan reis"
    },
    {
        ", and ": null
    },
    {
        "Jerry Ordway": "jerry ordway"
    },
    {
        ". It was published from October 42 to June 42 with a number of tie-in issues.  In the series, Kal-L, Alexander Luthor, and Superboy-Prime escape from the pocket dimension they were left in at the end of the original series; Luthor, having gone insane, attempts to recreate the multiverse using the Anti-Monitors corpse. Whereas Crisis on Infinite Earths discarded the DC Multiverse, Infinite Crisis restored it.     The conclusion to the trilogy,  Final Crisis , began in May 42 and ended in January 42  The series was written by ": null
    },
    {
        "Grant Morrison": "grant morrison"
    },
    {
        ",  with art by ": null
    },
    {
        "J. G. Jones": "j. g. jones"
    },
    {
        ", ": null
    },
    {
        "Carlos Pacheco": "carlos pacheco"
    },
    {
        ", Marco Rudy, and ": null
    },
    {
        "Doug Mahnke": "doug mahnke"
    },
    {
        ".  In Final Crisis, Darkseid arrives on Earth and begins a conquest to overthrow reality, as part of a plan by ": null
    },
    {
        "Libra": "libra"
    },
    {
        " to conquer the Multiverse. The Justice League and ": null
    },
    {
        "Green Lantern Corps": "green lantern corps"
    },
    {
        " join forces in a desperate attempt to stop the upcoming onslaught.       ": null
    }
]