[
    {
        "In physics, the cross section is a measure of probability that a specific process will take place in a collision of two particles. For example, the ": null
    },
    {
        "Rutherford cross-section": "rutherford scattering"
    },
    {
        " is a measure of probability that an ": null
    },
    {
        "alpha-particle": "alpha-particle"
    },
    {
        " will be deflected by a given angle during a collision with an ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        "; the absorption cross-section of a ": null
    },
    {
        "black hole": "black hole"
    },
    {
        " is a measure of probability that a particle will be absorbed during a collision with the black hole. Cross section is typically denoted   and is expressed in terms of the transverse area that the incident particle must hit in order for the given process to occur.     When two particles interact, their mutual cross section is the area ": null
    },
    {
        "transverse": "transversality"
    },
    {
        " to their relative motion within which they must meet in order to ": null
    },
    {
        "scatter": "scattering"
    },
    {
        " from each other. If the particles are hard ": null
    },
    {
        "inelastic": "elasticity"
    },
    {
        " sphere": "sphere"
    },
    {
        "s that interact only upon contact, their scattering cross section is related to their geometric size. If the particles interact through some action-at-a-distance force, such as ": null
    },
    {
        "electromagnetism": "electromagnetism"
    },
    {
        " or ": null
    },
    {
        "gravity": "gravity"
    },
    {
        ", their scattering cross section is generally larger than their geometric size. When a cross section is specified as a function of some final-state variable, such as particle angle or energy, it is called a differential cross section. When a cross section is integrated over all scattering angles , it is called a total cross section.     Scattering cross sections may be defined in ": null
    },
    {
        "nuclear": "nuclear physics"
    },
    {
        ", ": null
    },
    {
        "atomic": "atomic physics"
    },
    {
        ", and ": null
    },
    {
        "particle physics": "particle physics"
    },
    {
        " for collisions of accelerated beams of one type of particle with targets of a second type of particle. The probability for any given reaction to occur is in proportion to its cross section. Thus, specifying the cross section for a given reaction is a proxy for stating the probability that a given scattering process will occur.     The measured ": null
    },
    {
        "reaction rate": "reaction rate"
    },
    {
        " of a given process depends strongly on experimental variables such as the density of the target material, the intensity of the beam, the detection efficiency of the apparatus, or the angle setting of the detection apparatus. However, these quantities can be factored away, allowing measurement of the underlying two-particle collisional cross section.     Differential and total scattering cross sections are among the most important measurable quantities in ": null
    },
    {
        "nuclear": "nuclear physics"
    },
    {
        ", ": null
    },
    {
        "atomic": "atomic physics"
    },
    {
        ", and ": null
    },
    {
        "particle physics": "particle physics"
    },
    {
        ".            In a ": null
    },
    {
        "gas": "gas"
    },
    {
        " of finite-sized particles there are collisions among particles that depend on their cross-sectional size. The average distance that a particle travels between collisions depends on the density of gas particles. These quantities are related by   : \\sigma \\frac,     where   : is the cross section of a two-particle collision ,   : is the ": null
    },
    {
        "mean free path": "mean free path"
    },
    {
        " between collisions ,   : is the ": null
    },
    {
        "number density": "number density"
    },
    {
        " of the target particles .     If the particles in the gas can be treated as hard spheres of radius  that interact by direct contact, as illustrated in Figure 42 then the effective cross section for the collision of a pair is   : \\sigma \\pi \\left^42     If the particles in the gas interact by a force with a larger range than their physical size, then the cross section is a larger effective area that may depend on a variety of variables such as the energy of the particles.     Cross sections can be computed for atomic collisions but also are used in the subatomic realm. For example, in ": null
    },
    {
        "nuclear physics": "nuclear physics"
    },
    {
        " a gas of low-energy ": null
    },
    {
        "neutron": "neutron"
    },
    {
        "s collides with nuclei in a reactor or other nuclear device, with a ": null
    },
    {
        "cross section that is energy-dependent": "neutron cross section"
    },
    {
        " and hence also with well-defined ": null
    },
    {
        "mean free path": "mean free path"
    },
    {
        " between collisions.       If a beam of particles enters a thin layer of material of thickness , the ": null
    },
    {
        "flux": "flux"
    },
    {
        "  of the beam will decrease by  according to   : \\frac -n \\sigma \\Phi,     where  is the total cross section of all events, including ": null
    },
    {
        "scattering": "scattering"
    },
    {
        ", ": null
    },
    {
        "absorption": "absorption"
    },
    {
        ", or transformation to another species. The number density of scattering centers is designated by . Solving this equation exhibits the exponential attenuation of the beam intensity:   : \\Phi \\Phi_42 e^,     where  is the initial flux, and  is the total thickness of the material. For light, this is called the ": null
    },
    {
        "Beer–Lambert law": "beer–lambert law"
    },
    {
        ".         Consider a ": null
    },
    {
        "classical": "classical mechanics"
    },
    {
        " measurement where a single particle is scattered off a single stationary target particle. Conventionally, a ": null
    },
    {
        "spherical coordinate system": "spherical coordinate system"
    },
    {
        " is used, with the target placed at the origin and the  axis of this coordinate system aligned with the incident beam. The angle  is the scattering angle, measured between the incident beam and the scattered beam, and the  is the ": null
    },
    {
        "azimuthal angle": "azimuthal angle"
    },
    {
        ".   :     The ": null
    },
    {
        "impact parameter": "impact parameter"
    },
    {
        "  is the perpendicular offset of the trajectory of the incoming particle, and the outgoing particle emerges at an angle . For a given interaction , the impact parameter and the scattering angle have a definite one-to-one functional dependence on each other. Generally the impact parameter can neither be controlled nor measured from event to event and is assumed to take all possible values when averaging over many scattering events. The differential size of the cross section is the area element in the plane of the impact parameter, i.e. . The differential angular range of the scattered particle at angle  is the solid angle element . The differential cross section is the quotient of these quantities, .     It is a function of the scattering angle , plus other observables such as the momentum of the incoming particle. The differential cross section is always taken to be positive, even though larger impact parameters generally produce less deflection. In cylindrically symmetric situations , the ": null
    },
    {
        "azimuthal angle": "azimuthal angle"
    },
    {
        "  is not changed by the scattering process, and the differential cross section can be written as   : \\frac \\int_42^ \\frac \\,\\mathrm\\varphi .     In situations where the scattering process is not azimuthally symmetric, such as when the beam or target particles possess magnetic moments oriented perpendicular to the beam axis, the differential cross section must also be expressed as a function of the azimuthal angle.     For scattering of particles of incident flux  off a stationary target consisting of many particles, the differential cross section  at an angle  is related to the flux of scattered particle detection  in particles per unit time by   : \\frac \\frac \\frac.     Here  is the finite angular size of the detector ,  is the ": null
    },
    {
        "number density": "number density"
    },
    {
        " of the target particles , and  is the thickness of the stationary target . This formula assumes that the target is thin enough that each beam particle will interact with at most one target particle.     The total cross section  may be recovered by integrating the differential cross section  over the full ": null
    },
    {
        "solid angle": "solid angle"
    },
    {
        " :   : \\sigma \\oint_ \\frac \\, \\mathrm d \\Omega \\int_42^ \\int_42^\\pi \\frac \\sin \\theta \\, \\mathrm d \\theta \\, \\mathrm d \\varphi.     It is common to omit the “differential” ": null
    },
    {
        "qualifier": "qualifier"
    },
    {
        " when the type of cross section can be inferred from context. In this case,  may be referred to as the integral cross section or total cross section. The latter term may be confusing in contexts where multiple events are involved, since “total” can also refer to the sum of cross sections over all events.     The differential cross section is extremely useful quantity in many fields of physics, as measuring it can reveal a great amount of information about the internal structure of the target particles. For example, the differential cross section of ": null
    },
    {
        "Rutherford scattering": "rutherford scattering"
    },
    {
        " provided strong evidence for the existence of the atomic nucleus.     Instead of the solid angle, the ": null
    },
    {
        "momentum transfer": "momentum transfer"
    },
    {
        " may be used as the independent variable of differential cross sections.     Differential cross sections in inelastic scattering contain ": null
    },
    {
        "resonance peaks": "resonance"
    },
    {
        " that indicate the creation of metastable states and contain information about their energy and lifetime.       In the ": null
    },
    {
        "time-independent": "stationary state"
    },
    {
        " formalism of ": null
    },
    {
        "quantum": "quantum mechanics"
    },
    {
        " scattering, the initial ": null
    },
    {
        "wave function": "wave function"
    },
    {
        " is taken to be a plane wave with definite ": null
    },
    {
        "momentum": "momentum"
    },
    {
        " :   : \\phi_- \\;\\stackrel\\; e^,     where  and  are the relative coordinates between the projectile and the target. The arrow indicates that this only describes the asymptotic behavior of the wave function when the projectile and target are too far apart for the interaction to have any effect.     After the scattering takes place, it is expected that the wave function takes on the following asymptotic form:   : \\phi_+ \\;\\stackrel\\; f \\frac,     where  is some function of the angular coordinates known as the ": null
    },
    {
        "scattering amplitude": "scattering amplitude"
    },
    {
        ". This general form is valid for any short-ranged, energy-conserving interaction. It is not true for long-ranged interactions, so there are additional complications when dealing with electromagnetic interactions.     The full wave function of the system behaves asymptotically as the sum   : \\phi \\;\\stackrel\\; \\phi_- + \\phi_+.     The differential cross section is related to the scattering amplitude:   : \\frac \\bigl|f\\bigr|^42     This has the simple interpretation as the probability density for finding the scattered projectile at a given angle.     A cross section is therefore a measure of the effective surface area seen by the impinging particles, and as such is expressed in units of area. The cross section of two ": null
    },
    {
        "particles": "elementary particle"
    },
    {
        "  is a measure of the interaction event between the two particles. The cross section is proportional to the probability that an interaction will occur; for example in a simple scattering experiment the number of particles scattered per unit of time  depends only on the number of incident particles per unit of time , the characteristics of target , and the type of interaction. For  we have   : \\begin   I_\\text & I_\\textN\\sigma, \\\\   \\sigma & \\frac \\frac \\\\   & \\text \\times \\frac.   \\end       If the ": null
    },
    {
        "reduced mass": "reduced mass"
    },
    {
        "es and ": null
    },
    {
        "momenta": "momentum"
    },
    {
        " of the colliding system are ,  and ,  before and after the collision respectively, the differential cross section is given by   : \\frac \\left^42 m_i m_f \\frac \\bigl|T_\\bigr|^42     where the on-shell  matrix is defined by   : S_ \\delta_ - 42\\pi i \\delta\\left \\delta\\left T_     in terms of the ": null
    },
    {
        "S-matrix": "s-matrix"
    },
    {
        ". Here  is the ": null
    },
    {
        "Dirac delta function": "dirac delta function"
    },
    {
        ". The computation of the S-matrix is the main goal of the ": null
    },
    {
        "scattering theory": "scattering theory"
    },
    {
        ".       Although the ": null
    },
    {
        "SI unit": "si unit"
    },
    {
        " of total cross sections is ": null
    },
    {
        "m 42 ": "square meter"
    },
    {
        ", smaller units are usually used in practice.     In nuclear and particle physics, the conventional unit is the barn ": null
    },
    {
        "b": "barn"
    },
    {
        ", where 42  b 42 −42  m 42 42  ": null
    },
    {
        "fm": "femtometre"
    },
    {
        " 42 .  Smaller ": null
    },
    {
        "prefixed": "metric prefix"
    },
    {
        " units such as ": null
    },
    {
        "mb": "milli-"
    },
    {
        " and ": null
    },
    {
        "μb": "micro-"
    },
    {
        " are also widely used. Correspondingly, the differential cross section can be measured in units such as mb/sr.     When the scattered radiation is visible light, it is conventional to measure the path length in ": null
    },
    {
        "centimetre": "centimetre"
    },
    {
        "s. To avoid the need for conversion factors, the scattering cross section is expressed in cm 42 , and the number concentration in cm −42 . The measurement of the scattering of visible light is known as ": null
    },
    {
        "nephelometry": "nephelometry"
    },
    {
        ", and is effective for particles of 42–42  ": null
    },
    {
        "µm": "micrometre"
    },
    {
        " in diameter: as such, it is widely used in ": null
    },
    {
        "meteorology": "meteorology"
    },
    {
        " and in the measurement of ": null
    },
    {
        "atmospheric pollution": "atmospheric pollution"
    },
    {
        ".     The scattering of ": null
    },
    {
        "X-ray": "x-ray"
    },
    {
        "s can also be described in terms of scattering cross sections, in which case the square ": null
    },
    {
        "ångström": "ångström"
    },
    {
        " is a convenient unit: 42  Å 42 42 −42  m 42  42 42  b. The sum of the scattering, photoelectric, and pair-production cross-sections is charted as the atomic attenuation coefficient , in barns. Nondestructive Testing Handbook Volume 42 Radiographic Testing, ASNT, 42 chapter 42         For light, as in other settings, the scattering cross section is generally different from the ": null
    },
    {
        "geometrical cross section": "cross section"
    },
    {
        " of a particle, and it depends upon the ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        " of light and the ": null
    },
    {
        "permittivity": "permittivity"
    },
    {
        ", shape, and size of the particle. The total amount of scattering in a sparse medium is proportional to the product of the scattering cross section and the number of particles present.     In terms of area, the total cross section  is the sum of the cross sections due to ": null
    },
    {
        "absorption": "absorption cross section"
    },
    {
        ", ": null
    },
    {
        "scattering": "scattering"
    },
    {
        ", and ": null
    },
    {
        "luminescence": "luminescence"
    },
    {
        ". The sum of the absorption and scattering cross sections is sometimes referred to as the extinction cross section.   : \\sigma \\sigma_\\text + \\sigma_\\text + \\sigma_\\text.   The total cross section is related to the ": null
    },
    {
        "absorbance": "absorbance"
    },
    {
        " of the light intensity through the ": null
    },
    {
        "Beer–Lambert law": "beer–lambert law"
    },
    {
        ", which says that absorbance is proportional to particle concentration:   : A_\\lambda C l \\sigma,   where  is the absorbance at a given ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        " ,  is the particle concentration as a number density, and  is the ": null
    },
    {
        "path length": "path length"
    },
    {
        ". The absorbance of the radiation is the ": null
    },
    {
        "logarithm": "logarithm"
    },
    {
        "  of the reciprocal of the ": null
    },
    {
        "transmittance": "transmittance"
    },
    {
        " :    : A_\\lambda -\\log \\mathcal.         In the context of scattering light on extended bodies, the scattering cross section, , describes the likelihood of light being ": null
    },
    {
        "scattered": "scattering"
    },
    {
        " by a macroscopic particle. In general, the scattering cross section is different from the ": null
    },
    {
        "geometrical cross section": "cross section"
    },
    {
        " of a particle, as it depends upon the ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        " of light and the ": null
    },
    {
        "permittivity": "permittivity"
    },
    {
        " in addition to the shape and size of the particle. The total amount of scattering in a sparse medium is determined by the product of the scattering cross section and the number of particles present. In terms of area, the total cross section  is the sum of the cross sections due to ": null
    },
    {
        "absorption": "absorption cross section"
    },
    {
        ", ": null
    },
    {
        "scattering": "scattering"
    },
    {
        ", and ": null
    },
    {
        "luminescence": "luminescence"
    },
    {
        ":   : \\sigma \\sigma_\\text + \\sigma_\\text + \\sigma_\\text.     The total cross section is related to the ": null
    },
    {
        "absorbance": "absorbance"
    },
    {
        " of the light intensity through the ": null
    },
    {
        "Beer–Lambert law": "beer–lambert law"
    },
    {
        ", which says that absorbance is proportional to concentration: , where  is the absorbance at a given ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        " ,  is the concentration as a ": null
    },
    {
        "number density": "number density"
    },
    {
        ", and  is the ": null
    },
    {
        "path length": "path length"
    },
    {
        ". The extinction or ": null
    },
    {
        "absorbance": "absorbance"
    },
    {
        " of the radiation is the ": null
    },
    {
        "logarithm": "logarithm"
    },
    {
        "  of the reciprocal of the ": null
    },
    {
        "transmittance": "transmittance"
    },
    {
        " :   : A_\\lambda - \\log \\mathcal.       There is no simple relationship between the scattering cross section and the physical size of the particles, as the scattering cross section depends on the wavelength of radiation used. This can be seen when driving in ": null
    },
    {
        "fog": "fog"
    },
    {
        "gy weather: the droplets of water scatter red light less than they scatter the shorter wavelengths present in white light, and the red rear fog light can be distinguished more clearly than the white headlights of an approaching vehicle. That is to say that the scattering cross section of the water droplets is smaller for red light than for light of shorter wavelengths, even though the physical size of the particles is the same.       The scattering cross section is related to the ": null
    },
    {
        "meteorological range": "visibility"
    },
    {
        " :   : L_\\text \\frac.     The quantity  is sometimes denoted , the scattering coefficient per unit length.            The elastic collision of two hard spheres is an instructive example that demonstrates the sense of calling this quantity a cross section.  and  are respectively the radii of the scattering center and scattered sphere.   The total cross section is   : \\sigma_\\text \\pi \\left^42     So in this case the total scattering cross section is equal to the area of the circle  within which the center of mass of the incoming sphere has to arrive for it to be deflected, and outside which it passes by the stationary scattering center.         Another example illustrates the details of the calculation of a simple ": null
    },
    {
        "light": "light"
    },
    {
        " scattering model obtained by a reduction of the dimension. For simplicity, we will consider the scattering of a beam of light on a plane treated as a uniform density of parallel rays and within the framework of ": null
    },
    {
        "geometrical optics": "geometrical optics"
    },
    {
        " from a circle with radius  with a perfectly reflecting boundary. Its three-dimensional equivalent is therefore the more difficult problem of a laser or flashlight light scattering from the mirror sphere, for example, from the mechanical bearing ball.      The unit of cross section in one dimension is the unit of length, for example 42  m. Let  be the angle between the ": null
    },
    {
        "light ray": "ray"
    },
    {
        " and the ": null
    },
    {
        "radius": "radius"
    },
    {
        " joining the reflection point of the light ray with the center point of the circle mirror. Then the increase of the length element perpendicular to the light beam is expressed by this angle as   : \\mathrm dx r \\cos \\alpha \\,\\mathrm d \\alpha,   the reflection angle of this ray with respect to the incoming ray is then , and the scattering angle is   : \\theta \\pi - 42 \\alpha.   The energy or the number of photons reflected from the light beam with the intensity or density of photons  on the length  is   : I \\,\\mathrm d \\sigma I \\,\\mathrm dx I r \\cos \\alpha \\,\\mathrm d \\alpha I \\frac \\sin \\left \\,\\mathrm d \\theta I \\frac \\,\\mathrm d \\theta.   The differential cross section is therefore    : \\frac \\frac \\sin \\left.   As it is seen from the behaviour of the ": null
    },
    {
        "sine": "sine"
    },
    {
        " function, this quantity has the maximum for the backward scattering , and the zero minimum for the scattering from the edge of the circle directly forward . It confirms the intuitive expectations that the mirror circle acts like a diverging ": null
    },
    {
        "lens": "lens"
    },
    {
        ", and a thin beam is more diluted the closer it is from the edge defined with respect to the incoming direction. The total cross section can be obtained by summing the differential section of the entire range of angles:   : \\sigma \\int_42^ \\frac \\,\\mathrm d \\theta \\int_42^ \\frac \\sin \\left \\,\\mathrm d \\theta \\left. -r \\cos \\left \\right|_42^ 42 r,   so it is equal as much as the circular mirror is totally screening the two-dimensional space for the beam of light. In three dimensions for the mirror ball with the radius  it is therefore equal .       We can now use the result from the Example 42 to calculate the differential cross section for the light scattering from the perfectly reflecting sphere in three dimensions. Let us denote now the radius of the sphere as . Let us parameterize the plane perpendicular to the incoming light beam by the cylindrical coordinates  and ": null
    }
]