[
    {
        "   Crucifix was an American ": null
    },
    {
        "hardcore punk": "hardcore punk"
    },
    {
        " band from ": null
    },
    {
        "Berkeley": "berkeley, california"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ", active from 42 to 42 They were among the most popular acts of the San Francisco punk scene of the early 42s. Crucifix was founded and fronted by ": null
    },
    {
        "Cambodia": "cambodia"
    },
    {
        "n-born singer Sothira Pheng, whose family had fled the country when the ": null
    },
    {
        "Khmer Rouge": "khmer rouge"
    },
    {
        " seized power.     They were distinct among American underground bands for their strong ": null
    },
    {
        "D-beat": "d-beat"
    },
    {
        " musical characteristics and ": null
    },
    {
        "anarchist": "anarchist"
    },
    {
        " content. The bands debut 42 full-length album  Dehumanization  on ": null
    },
    {
        "Corpus Christi Records": "corpus christi records"
    },
    {
        ", an offshoot of ": null
    },
    {
        "Crass Records": "crass"
    },
    {
        ", is often considered to be a cornerstone of political punk.       Crucifix was preceded by the short-lived band Subsidize Mess, featuring Jane Weems on Drums, Sothira on bass, Matt Borusso on guitar, and Christopher Douglas on vocals.     Crucifix was founded in 42 and fronted by ": null
    },
    {
        "Cambodia": "cambodia"
    },
    {
        "n-born singer Sothira Pheng, whose family had fled the country when the brutal ": null
    },
    {
        "Khmer Rouge": "khmer rouge"
    },
    {
        " seized power. The bands self-titled EP debuted on Universal Records of ": null
    },
    {
        "Berkeley": "berkeley, california"
    },
    {
        " in 42 and was followed by the  nineteen eighty-four  single on the bands own Freak Records in 42 This consisted of Sothira Pheng Vocals, Matt Borruso Bass - Chris Douglas Drums & Jimmy Crucifix Guitar this is considered to be their definitive work and a cornerstone of political punk. The bands debut full-length  Dehumanization  on ": null
    },
    {
        "Corpus Christi Records": "corpus christi records"
    },
    {
        "  is also widely considered to be their definitive work and a cornerstone of political punk. Jake Smith played guitar on this LP. Later ": null
    },
    {
        "Drew Bernstein": "drew bernstein"
    },
    {
        " formerly of ": null
    },
    {
        "Americas Hardcore": "americas hardcore"
    },
    {
        " replaced Smith on guitar. The band split up after a lengthy tour of US/Canada/Europe on July 42 42 A posthumous compilation album of singles and live tracks entitled Exhibit A was released on Kustomized Records in 42 When Corpus Christi folded the album  Dehumanization  was later reissued by ": null
    },
    {
        "Southern Records": "southern records"
    },
    {
        ".     Matt Borruso and Christopher Douglas later reemerged in Loudspeaker, a New York–based noise rock group. The band included guitarist Kurt Wolf , bassist Jens Jürgensen  and later bassist Charles Hanson . Christopher Douglas was later replaced by Martin Köb on drums. They released several recordings between 42 and 42     Sothira Pheng and Jimmy Crucifix now play with Proudflesh, a San Francisco-based Hard Punk Rock n Roll band with drummer Erik Lannon . Proudflesh released their first album in March 42 on Wired Gnome Records. Jimmy Crucifix also plays guitar in FANG.     Vocal samples from Annihilation , the opening track of the Dehumanization LP, were used by ": null
    },
    {
        "Orbital": "orbital"
    },
    {
        " on the song Choice . Annihilation was recorded in 42 by ": null
    },
    {
        "A Perfect Circle": "a perfect circle"
    },
    {
        " for their third LP,  eMOTIVe ; ": null
    },
    {
        "Sepultura": "sepultura"
    },
    {
        " also covered it as a bonus track on the album ": null
    },
    {
        "Nation": "nation"
    },
    {
        " .       Sothira Pheng   Jimmy Crucifix   Bryce Kanights   Matt Borruso   Christopher Douglas   Drew Bernstein   Jake Smith       42: Crucifix   42: Nineteen Eighty-Four   42:  Dehumanization     CD released in 42 by ": null
    },
    {
        "Southern Records": "southern records"
    },
    {
        " Exhibit A       Rat Music for Rat People, Vol. 42         - Crucifix interview from 42                       ": null
    }
]