[
    {
        "A cryopump or a cryogenic pump is a ": null
    },
    {
        "vacuum pump": "vacuum pump"
    },
    {
        " that traps ": null
    },
    {
        "gas": "gas"
    },
    {
        "es and ": null
    },
    {
        "vapour": "vapour"
    },
    {
        "s by condensing them on a cold surface, but are only effective on some gases. The effectiveness depends on the freezing and boiling points of the gas relative to the cryopumps temperature. They are sometimes used to block particular contaminants, for example in front of a ": null
    },
    {
        "diffusion pump": "diffusion pump"
    },
    {
        " to trap backstreaming oil, or in front of a ": null
    },
    {
        "McLeod gauge": "mcleod gauge"
    },
    {
        " to keep out water. In this function, they are called a cryotrap, waterpump or cold trap, even though the physical mechanism is the same as for a cryopump.     Cryotrapping can also refer to a somewhat different effect, where molecules will increase their residence time on a cold surface without actually freezing . There is a delay between the molecule impinging on the surface and rebounding from it. Kinetic energy will have been lost as the molecules slow down. For example, ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " does not condense at 42 ": null
    },
    {
        "kelvin": "kelvin"
    },
    {
        "s, but it can be cryotrapped. This effectively traps molecules for an extended period and thereby removes them from the vacuum environment just like cryopumping.       Cryopumps are commonly cooled by compressed helium, though they may also use dry ice, ": null
    },
    {
        "liquid nitrogen": "liquid nitrogen"
    },
    {
        ", or stand-alone versions may include a built-in ": null
    },
    {
        "cryocooler": "cryocooler"
    },
    {
        ". Baffles are often attached to the cold head to expand the surface area available for condensation, but these also increase the radiative heat uptake of the cryopump. Over time, the surface eventually saturates with condensate and thus the pumping speed gradually drops to zero. It will hold the trapped gases as long as it remains cold, but it will not condense fresh gases from leaks or backstreaming until it is regenerated. Saturation happens very quickly in low vacuums, so cryopumps are usually only used in high or ultrahigh vacuum systems.     The cryopump provides fast, clean pumping of all gases in the 42 −42 to 42 −42 ": null
    },
    {
        "Torr": "torr"
    },
    {
        " range. The cryopump operates on the principle that gases can be condensed and held at extremely low vapor pressures, achieving high speeds and throughputs. The cold head consists of a two-stage cold head cylinder and a drive unit displacer assembly. These together produce closed-cycle refrigeration at temperatures that range from 42 to 42K for the first-stage cold station to 42 to 42K for the second-stage cold station, typically.     Some cryopumps have multiple stages at various low temperatures, with the outer stages shielding the coldest inner stages. The outer stages condense high boiling point gases such as water and oil, thus saving the surface area and refrigeration capacity of the inner stages for lower boiling point gases such as nitrogen.     As cooling temperatures decrease when using dry ice, liquid nitrogen, then compressed helium, lower molecular-weight gases can be trapped. Trapping nitrogen, helium, and hydrogen requires extremely low temperatures and large surface area as described below. Even at this temperature, the lighter gases helium and hydrogen have very low trapping efficiency and are the predominant molecules in ultra-high vacuum systems.     Cryopumps are often combined with ": null
    },
    {
        "sorption pump": "sorption pump"
    },
    {
        "s by coating the cold head with highly adsorbing materials such as ": null
    },
    {
        "activated charcoal": "activated charcoal"
    },
    {
        " or a ": null
    },
    {
        "zeolite": "zeolite"
    },
    {
        ". As the ": null
    },
    {
        "sorbent": "sorbent"
    },
    {
        " saturates, the effectiveness of a sorption pump decreases, but can be recharged by heating the zeolite material to ": null
    },
    {
        "outgas": "outgassing"
    },
    {
        " it. The breakdown temperature of the zeolite materials porous structure may limit the maximum temperature that it may be heated to for regeneration.     Sorption pumps are a type of cryopump that is often used as roughing pumps to reduce pressures from the range of atmospheric to on the order of 42 ": null
    },
    {
        "Pa": "pascal"
    },
    {
        " , while lower pressures are achieved using a finishing pump ": null
    }
]