[
    {
        "      Cyberpunk is a ": null
    },
    {
        "cyberpunk": "cyberpunk"
    },
    {
        " role-playing game": "role-playing game"
    },
    {
        " written by ": null
    },
    {
        "Mike Pondsmith": "mike pondsmith"
    },
    {
        " and published by ": null
    },
    {
        "R. Talsorian Games": "r. talsorian games"
    },
    {
        " in 42 A popular second edition, Cyberpunk 42, was published in 42 and a number of further editions have been published.     Cyberpunk Cyberpunk was designed by Mike Pondsmith as an attempt to replicate the gritty realism of the cyberpunk ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novels of ": null
    },
    {
        "William Gibson": "william gibson"
    },
    {
        " and ": null
    },
    {
        "Walter Jon Williams": "walter jon williams"
    },
    {
        ". In particular, Willams novel  Hardwired  was an inspiration, and Williams helped playtest the game. The game was published in 42 by R. Talsorian Games. The game components of the boxed set consist of a 42-page Handbook, a 42-page Sourcebook, a 42-page Combat Book, 42 pages of game aids and two ten-sided dice.     A number of rules supplements were subsequently published in 42:   Rockerboy    Solo of Fortune     Hardwired , based on the Walter Jon Williams novel   Near Orbit: Space Supplement, with rules for space travel       The game is set in a dystopian world in the year 42 The global superpowers have collapsed, leaving world power in the hands of large Corporations that fight amongst themselves for dominance. Food blights have caused disastrous famines, and the Middle East is a radioactive desert. Technoshock is a widespread psychosis, as many people are unable to cope with synthetic muscle tissue, organic circuits and designer drugs. With the lack of government and police, casual violence is endemic.       Players take on the roles of stylish Cyberpunks who live by three rules:   Style over substance.   Attitude is everything.   Live on the edge.     The first step in character creation is to choose a role:          Players use a point-buy system to buy attributes, then uses a Lifepath Section to determine skills and personal background, including past loves and present-day motivations. Each character starts with a certain amount of money, and can use it to buy cybernetic implants to upgrade personal abilities.     Combat uses a 42-phase resolution each turn, and is generally quick and lethal. There are also rules for cybernetic hacking, called Netrunning. When characters jack in , they can interpret the Net in several different ways, including as a classic  Dungeons & Dragons  maze, or perhaps as a star-filled galaxy.     Cyberpunk 42 Cyberpunk 42, which featured updated rules for combat, Netrunning, and character generation. The games timeline was also ": null
    },
    {
        "retcon": "retcon"
    },
    {
        "ned to accommodate the ": null
    },
    {
        "German reunification": "german reunification"
    },
    {
        " in 42 It was released as a boxed set that contained a 42-page softcover book, and a 42-page reference guide and adventure.     R. Talsorian Games released two revised versions: Cyberpunk 42 version 42 , and Cyberpunk 42 version 42 .     A total of 42 rules supplements and sourcebooks, and 42 adventures were also published by R. Talsorian Games between 42 and 42 In addition, ": null
    },
    {
        "Atlas Games": "atlas games"
    },
    {
        " published twelve adventures under license between 42 and 42     Six novels set in the Cyberpunk 42 world were also published between 42 and 42     ": null
    },
    {
        "Dream Pod 42": "dream pod 9"
    },
    {
        " released Nights Edge in 42 taking the Cyberpunk 42 setting and adding a horror theme, including vampires and werewolves. Dream Pod 42 published 42 other supplements and adventures in this setting between 42 and 42       Cyberpunk 42 is set in the same world as the original edition, but the time has been moved forward seven years, from 42 to 42 Although the game referee can set the game anywhere in this world, the default setting is the fictional Night City, a city of five million people on the west coast of the United States located between ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " and ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ".       The basic rules system of Cyberpunk 42 are called the  Interlock System  and work in a similar fashion to first edition rules, being skill-based rather than ": null
    },
    {
        "level": "experience level"
    },
    {
        "-based; for successful play, players are awarded points to be spent on improving their characters skill sets.     The combat system is called Friday Night Firefight . The 42-phase combat rules of first edition have been discarded in favor of a simpler system. However, like first edition combat rules, Friday Night Firefight still emphasizes lethality. Unlike other role-playing systems where characters amass higher hit points as they progress, allowing them to survive higher amounts of combat damage, the amount of damage a character can sustain in Cyberpunk 42 does not increase as the character develops.     Cybergeneration   Cybergeneration was published in 42 as an alternate world to Cyberpunk 42, where a ": null
    },
    {
        "nanotech": "nanotech"
    },
    {
        " virus epidemic has resulted in a subgroup of teenagers with unusual, superhuman skills. The first version of Cybergeneration required the Cyberpunk 42 rulebook, but a second version became a standalone game.     Cyberpunk 42xCyberpunk v42, set in the 42s, following a fourth Corporate War. The rules are expanded to include AltCults , a society of full-body ": null
    },
    {
        "cyborgs": "cyborgs"
    },
    {
        " that can switch their brains into a variety of purpose-built body frames. Characters are now known as Edgerunners .     From 4242 two sourcebooks were published to accompany this edition.     Cyberpunk Red Cyberpunk Red, which functions as a prequel for the  Cyberpunk 42  video game.          Two different, independent ": null
    },
    {
        "collectible card game": "collectible card game"
    },
    {
        "s have been licensed and produced based on the Cyberpunk setting. The first, called  Netrunner , was designed by ": null
    },
    {
        "Richard Garfield": "richard garfield"
    },
    {
        ", and released by ": null
    },
    {
        "Wizards of the Coast": "wizards of the coast"
    },
    {
        " in 42 . The second was called Cyberpunk CCG, released in 42 designed by Peter Wacks and published by Social Games.       In 42 Mayhem Studio released the 42D platformer Cyberpunk: Arasakas Plot for the ": null
    },
    {
        "J42ME": "j2me"
    },
    {
        " platform.    ": null
    },
    {
        "CD Projekt Red": "cd projekt red"
    },
    {
        ", the developers of  The Witcher  series, are in the process of developing a non-linear RPG  Cyberpunk 42  with April 42th, 42 as the projected release date.          In the September 42 edition of  Dragon  , ": null
    },
    {
        "Jim Bambra": "jim bambra"
    },
    {
        " liked the production values of the original edition, but found many typos in the various books as well as a missing encounter table. Bambra found the setting does a superb job of capturing the flavor and atmosphere of a disturbingly plausible and realistic future. The development and presentation of the Net is stunning and can be used as a basis for countless numbers of adventures. No other game has succeeded in portraying computer hacking in such a vibrant and absorbing way. He concluded that this was not for everyone: Gamers brought up on heroic-fantasy or shiny science-fiction games may find the gritty realism of the Cyberpunk game not to their liking... To decide if this is the game for you, read a few of the Cyberpunk style novels. If you like them, don’t waste any time — rush out and buy the Cyberpunk game. Welcome to life on the edge.      In the September 42 edition of Dragon , ": null
    },
    {
        "Allen Varney": "allen varney"
    },
    {
        " found Cyberpunk 42 just as stylish as its first-edition predecessor, but he found even more typos in this edition than in the first edition. Varney liked the new streamlined combat system, but criticized the duality of modern combat, where Unarmored characters become pools of blood in 42 seconds of combat, but those in flak armor can shrug off submachine-gun fire. Varney also felt that the Netrunning system was much improved, calling the rules system elegant and original. Varney thought the second editions biggest flaw was lack of an index, but he also criticized the dichotomy of a system where you can break into Eurobank and embezzle five million bucks, but you better pay your phone bill on time or you’re in big trouble. He accused the game of being in the curious position of advocating rebellion, but only in socially acceptable ways. Nonetheless, Varney concluded that The Cyberpunk game’s second edition surpasses its first edition on every count. With its smooth action, pure cyberpunk atmosphere, easily accessible setting, and medium-low complexity, this game tops my list as the fields best route to dark near-future adventure.      In a 42 reader poll undertaken by Arcane magazine to determine the 42 most popular roleplaying games of all time, Cyberpunk was ranked 42th. Editor Paul Pettengale commented: Cyberpunk was the first of the straight cyberpunk RPGs, and is still the best. The difference between cyberpunk and other sci-fi is a matter of style and attitude. Everything about the Cyberpunk game, from the background to the rules system, is designed to create this vital atmosphere. Cyberpunk is set in an unforgiving world where betrayal and double-crosses are common, trust is hard to find and paranoia is a useful survival trait.         Challenge  42    White Wolf  42    White Wolf ": null
    }
]