[
    {
        "A cyclic nucleotide is a single-": null
    },
    {
        "phosphate": "phosphate"
    },
    {
        " nucleotide": "nucleotide"
    },
    {
        " with a cyclic bond arrangement between the ": null
    },
    {
        "sugar": "sugar"
    },
    {
        " and phosphate groups. Like other nucleotides, cyclic nucleotides are composed of three functional groups: a sugar, a ": null
    },
    {
        "nitrogenous base": "nitrogenous base"
    },
    {
        ", and a single phosphate group. As can be seen in the ": null
    },
    {
        "cyclic adenosine monophosphate": "cyclic adenosine monophosphate"
    },
    {
        " and ": null
    },
    {
        "cyclic guanosine monophosphate": "cyclic guanosine monophosphate"
    },
    {
        " images, the cyclic portion consists of two bonds between the phosphate group and the 42 and 42 ": null
    },
    {
        "hydroxyl": "hydroxyl"
    },
    {
        " groups of the sugar, very often a ": null
    },
    {
        "ribose": "ribose"
    },
    {
        ".     Their biological significance includes a broad range of ": null
    },
    {
        "protein": "protein"
    },
    {
        "-": null
    },
    {
        "ligand": "ligand"
    },
    {
        " interactions. They have been identified as ": null
    },
    {
        "secondary messenger": "secondary messenger"
    },
    {
        "s in both ": null
    },
    {
        "hormone": "hormone"
    },
    {
        " and ": null
    },
    {
        "ion-channel": "ion channel"
    },
    {
        " signalling in ": null
    },
    {
        "eukaryotic": "eukaryote"
    },
    {
        " cells, as well as ": null
    },
    {
        "allosteric effector": "allosteric effector"
    },
    {
        " compounds of ": null
    },
    {
        "DNA": "dna"
    },
    {
        " binding proteins in ": null
    },
    {
        "prokaryotic": "prokaryote"
    },
    {
        " cells. cAMP and cGMP are currently the most well documented cyclic nucleotides, however there is evidence that ": null
    },
    {
        "cCMP": "cyclic cmp"
    },
    {
        "  is also involved in eukaryotic cellular messaging. The role of cyclic uridine monophosphate is even less well known.     Discovery of cyclic nucleotides has contributed greatly to the understanding of ": null
    },
    {
        "kinase": "kinase"
    },
    {
        " and ": null
    },
    {
        "phosphatase": "phosphatase"
    },
    {
        " mechanisms, as well as protein regulation in general. Although more than 42 years have passed since their initial discovery, interest in cyclic nucleotides and their biochemical and physiological significance continues.       The understanding of the concept of second messengers, and in particular the role of cyclic nucleotides and their ability to relay physiological signals to a ": null
    },
    {
        "cell": "cell"
    },
    {
        ", has its origins in the research of ": null
    },
    {
        "glycogen": "glycogen"
    },
    {
        " metabolism by ": null
    },
    {
        "Carl": "carl ferdinand cori"
    },
    {
        " and ": null
    },
    {
        "Gerty Cori": "gerty cori"
    },
    {
        ", for which they were awarded a ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "nobel prize in physiology or medicine"
    },
    {
        " in 42 A number of incremental but important discoveries through the 42s added to their research, primarily focusing on the activity of ": null
    },
    {
        "glycogen phosphorylase": "glycogen phosphorylase"
    },
    {
        " in dog ": null
    },
    {
        "liver": "liver"
    },
    {
        ". Glycogen phosphorylase catalyzes the first step in ": null
    },
    {
        "glycogenolysis": "glycogenolysis"
    },
    {
        ", the process of breaking ": null
    },
    {
        "glycogen": "glycogen"
    },
    {
        " into its substituent ": null
    },
    {
        "glucose": "glucose"
    },
    {
        " parts. ": null
    },
    {
        "Earl Sutherland": "earl wilbur sutherland, jr."
    },
    {
        " investigated the effect of the hormones ": null
    },
    {
        "adrenaline": "epinephrine"
    },
    {
        " and ": null
    },
    {
        "glucagon": "glucagon"
    },
    {
        " on glycogen phosphorylase, earning him the Nobel Prize in Physiology or Medicine in 42     In 42 ": null
    },
    {
        "Edwin Krebs": "edwin g. krebs"
    },
    {
        " and ": null
    },
    {
        "Edmond Fischer": "edmond h. fischer"
    },
    {
        " discovered that ": null
    },
    {
        "adenosine triphosphate": "adenosine triphosphate"
    },
    {
        " is required for the conversion of ": null
    },
    {
        "glycogen phosphorylase": "phosphorylase"
    },
    {
        " b to glycogen phosphorylase a. While investigating the action of adrenaline on ": null
    },
    {
        "glycogenolysis": "glycogenolysis"
    },
    {
        " the next year, Sutherland and Walter Wosilait reported that inorganic phosphate is released when the ": null
    },
    {
        "enzyme": "enzyme substrate"
    },
    {
        " liver phosphorylase is inactivated; but when it is activated, it incorporates a phosphate. The “active factor” that the hormones produced was finally purified in 42 and then identified as containing a ": null
    },
    {
        "ribose": "ribose"
    },
    {
        ", a phosphate, and an ": null
    },
    {
        "adenine": "adenine"
    },
    {
        " in equal ratios. Further, it was proved that this factor reverted to 42’-AMP when it was inactivated.     Evgeny Fesenko, Stanislav Kolesnikov, and Arkady Lyubarsky discovered in 42 that ": null
    },
    {
        "cyclic guanosine monophosphate": "cyclic guanosine monophosphate"
    },
    {
        " can initiate the photoresponse in ": null
    },
    {
        "rods": "rod cell"
    },
    {
        ". Soon after, the role of cNMP in gated ion channels of chemosensitive ": null
    },
    {
        "cilia": "cilium"
    },
    {
        " of ": null
    },
    {
        "olfactory sensory neuron": "olfactory sensory neuron"
    },
    {
        "s was reported by Tadashi Nakamura and Geoffrey Gold. In 42 Lawrence Haynes and King-Wai Yau uncovered cNMP’s role in the light-dependent cyclic-nucleotide-gated channel of ": null
    },
    {
        "cone photoreceptors": "cone cell"
    },
    {
        ". By the end of the decade, the presence of two types of intramembrane receptors was understood: Rs  and Ri . Wei-Jen Tang and James Hurley reported in 42 that adenylyl cyclase, which synthesizes cAMP, is regulated not only by ": null
    },
    {
        "hormone": "hormone"
    },
    {
        "s and ": null
    },
    {
        "neurotransmitter": "neurotransmitter"
    },
    {
        "s, but also by ": null
    },
    {
        "phosphorylation": "phosphorylation"
    },
    {
        ", ": null
    },
    {
        "calcium": "calcium"
    },
    {
        ", ": null
    },
    {
        "forskolin": "forskolin"
    },
    {
        ", and guanine nucleotide-binding proteins .              The two most well-studied cyclic nucleotides are cyclic AMP and cyclic GMP , while cyclic CMP and cyclic UMP are less understood. cAMP is 42’42’-cyclic adenosine monophosphate, cGMP is 42’42’-cyclic guanosine monophosphate, cCMP is cytidine 42-monophosphate, and cUMP is uridine 42-cyclic phosphate.      Each cyclic nucleotide has three components. It contains a nitrogenous base : for example, ": null
    },
    {
        "adenine": "adenine"
    },
    {
        " in cAMP and ": null
    },
    {
        "guanine": "guanine"
    },
    {
        " in cGMP. It also contains a sugar, specifically the five-": null
    },
    {
        "carbon": "carbon"
    },
    {
        " ribose. And finally, a cyclic nucleotide contains a phosphate. A double-ring ": null
    },
    {
        "purine": "purine"
    },
    {
        " is the nitrogenous base for cAMP and cGMP, while cytosine, ": null
    },
    {
        "thymine": "thymine"
    },
    {
        ", and ": null
    },
    {
        "uracil": "uracil"
    },
    {
        " each have a single-ring nitrogenous base .     These three components are connected so that the nitrogenous base is attached to the first carbon of ribose , and the phosphate group is attached to the 42’ carbon of ribose. While all nucleotides have this structure, the phosphate group makes a second connection to the ribose ring at the 42’ carbon in cyclic nucleotides. Because the phosphate group has two separate bonds to the ribose sugar, it forms a cyclic ring.      The ": null
    },
    {
        "atom": "atom"
    },
    {
        " numbering convention is used to identify the carbons and nitrogens within a cyclic nucleotide. In the pentose, the carbon closest to the ": null
    },
    {
        "carbonyl": "carbonyl"
    },
    {
        " group is labeled C42 When a pentose is connected to a nitrogenous base, carbon atom numbering is distinguished with a prime notation, which differentiates these carbons from the atom numbering of the nitrogenous base.      Therefore, for cAMP, 42’42’-cyclic adenosine monophosphate indicates that a single phosphate group forms a cyclic structure with the ribose group at its 42’ and 42’ carbons, while the ribose group is also attached to adenosine .       Cyclic nucleotides are found in both prokaryotic and eukaryotic cells. Control of intracellular concentrations is maintained through a series of enzymatic reactions involving several families of proteins. In higher order mammals, cNMPs are present in many types of tissue.          Cyclic nucleotides are produced from the generic reaction NTP → cNMP + PP i ,  where N represents a nitrogenous base. The reaction is catalyzed by specific nucleotidyl cyclases, such that production of cAMP is catalyzed by ": null
    },
    {
        "adenylyl cyclase": "adenylyl cyclase"
    },
    {
        " and production of cGMP is catalyzed by ": null
    },
    {
        "guanylyl cyclase": "guanylyl cyclase"
    },
    {
        ".  ": null
    },
    {
        "Adenylyl cyclase": "adenylyl cyclase"
    },
    {
        " has been found in both a transmembrane and ": null
    },
    {
        "cytosol": "cytosol"
    },
    {
        "ic form, representing distinct protein classes and different sources of cAMP.       Both cAMP and cGMP are degraded by ": null
    },
    {
        "hydrolysis": "hydrolysis"
    },
    {
        " of the 42 ": null
    },
    {
        "phosphodiester bond": "phosphodiester bond"
    },
    {
        ", resulting in a 42NMP. Degradation is carried out primarily by a class of enzymes known as ": null
    },
    {
        "phosphodiesterase": "phosphodiesterase"
    },
    {
        "s . In mammalian cells, there are 42 known PDE families with varying ": null
    },
    {
        "isoforms": "protein isoform"
    },
    {
        " of each protein expressed based on the cells regulatory needs. Some phosphodiesterases are cNMP-specific, while others can hydrolyze non-specifically.  However, the cAMP and cGMP degradation pathways are much more understood than those for either cCMP or cUMP. The identification of specific PDEs for cCMP and cUMP has not been as thoroughly established.        Cyclic nucleotides can be found in many different types of eukaryotic cells, including photo-receptor rods and cones, ": null
    },
    {
        "smooth muscle cells": "smooth muscle cells"
    },
    {
        " and ": null
    },
    {
        "liver cells": "liver cells"
    },
    {
        ". Cellular concentrations of cyclic nucleotides can be very low, in the 42 −42 ": null
    },
    {
        "M": "molar concentration"
    },
    {
        " range, because ": null
    },
    {
        "metabolism": "metabolism"
    },
    {
        " and function are often localized in particular parts of the cell.  A highly conserved ": null
    },
    {
        "cyclic nucleotide-binding domain": "cyclic nucleotide-binding domain"
    },
    {
        " is present in all proteins that bind cNMPs, regardless of their biological function. The domain consists of a beta sandwich architecture, with the cyclic nucleotide binding pocket between the ": null
    },
    {
        "beta sheet": "beta sheet"
    },
    {
        "s. The binding of cNMP causes a conformational change that affects the proteins activity.  There is also data to support a synergistic binding effect amongst multiple cyclic nucleotides, with cCMP lowering the effective concentration of cAMP for activation of ": null
    },
    {
        "protein kinase A": "protein kinase a"
    },
    {
        " .        Cyclic nucleotides are integral to a communication system that acts within cells. They act as second messengers by relaying the signals of many first messengers, such as hormones and neurotransmitters, to their physiological destinations. Cyclic nucleotides participate in many physiological responses, including receptor-effector coupling, down-regulation of drug responsiveness, protein-kinase cascades, and transmembrane signal transduction.     Cyclic nucleotides act as second messengers when first messengers, which cannot enter the cell, instead bind to receptors in the cellular membrane. The receptor changes conformation and transmits a signal that activates an enzyme in the cell membrane interior called adenylyl cyclase. This releases cAMP into the cell interior, where it stimulates a protein kinase called cyclic AMP-dependent protein kinase. By phosphorylating proteins, cyclic AMP-dependent protein kinase alters protein activity. cAMPs role in this process terminates upon hydrolysis to AMP by phosphodiesterase.          Cyclic nucleotides are well-suited to act as second messengers for several reasons. Their synthesis is energetically favorable, and they are derived from common metabolic components . When they break down into AMP/GMP and inorganic phosphate, these components are non-toxic.  Finally, cyclic nucleotides can be distinguished from non-cyclic nucleotides because they are smaller and less ": null
    },
    {
        "polar": "chemical polarity"
    },
    {
        ".       The involvement of cyclic nucleotides on biological functions is varied, while an understanding of their role continues to grow. There are several examples of their biological influence. They are associated with long-term and short-term memory.  They also work in the liver to coordinate various enzymes that control ": null
    },
    {
        "blood glucose": "blood sugar"
    },
    {
        " and other ": null
    },
    {
        "nutrient": "nutrient"
    },
    {
        "s.  In ": null
    },
    {
        "bacteria": "bacteria"
    },
    {
        ", cyclic nucleotides bind to catabolite gene activator protein , which acts to increase metabolic enzymatic activity by increasing the rate of ": null
    },
    {
        "DNA": "dna"
    },
    {
        " transcription": "transcription"
    },
    {
        ". They also facilitate relaxation of smooth muscle cells in ": null
    },
    {
        "vascular": "vascular"
    },
    {
        " tissue,  and activate cyclic CNG channels in ": null
    },
    {
        "retina": "retina"
    },
    {
        "l photoreceptors and ": null
    },
    {
        "olfactory sensory neuron": "olfactory sensory neuron"
    },
    {
        "s. In addition, they potentially activate cyclic CNG channels in: ": null
    },
    {
        "pineal gland": "pineal gland"
    },
    {
        " light sensitivity, sensory neurons of the ": null
    },
    {
        "vomeronasal organ": "vomeronasal organ"
    },
    {
        " , ": null
    },
    {
        "taste receptor": "taste receptor"
    },
    {
        " cells, ": null
    },
    {
        "cellular signaling": "cell signaling"
    },
    {
        " in ": null
    },
    {
        "sperm": "sperm"
    },
    {
        ", airway ": null
    },
    {
        "epithelial": "epithelium"
    },
    {
        " cells, ": null
    },
    {
        "gonadotropin-releasing hormone": "gonadotropin-releasing hormone"
    },
    {
        " -secreting ": null
    },
    {
        "neuron": "neuron"
    },
    {
        "al cell line, and ": null
    },
    {
        "renal": "kidney"
    },
    {
        " inner medullary collecting duct": "collecting duct system"
    },
    {
        ".       Examples of disruptions of cNMP pathways include: mutations in CNG channel ": null
    },
    {
        "gene": "gene"
    },
    {
        "s are associated with degeneration of the retina and with ": null
    },
    {
        "color blindness": "color blindness"
    },
    {
        "; and ": null
    },
    {
        "overexpression": "gene expression"
    },
    {
        " of cytosolic or ": null
    },
    {
        "soluble adenylyl cyclase": "soluble adenylyl cyclase"
    },
    {
        " has been linked to human ": null
    },
    {
        "prostate carcinoma": "prostate cancer"
    },
    {
        ". Inhibition of sAC, or knockdown by ": null
    },
    {
        "RNA interference": "rna interference"
    },
    {
        " transfection": "transfection"
    },
    {
        " has been shown to prevent the ": null
    },
    {
        "proliferation": "cell growth"
    },
    {
        " of the prostate carcinoma cells. The regulatory pathway appears to be part of the EPAC pathway and not the PKA pathway.     Phosphodiesterases, principle regulators of cNMP degradation, are often targets for therapeutics. Caffeine is a known PDE inhibitor, while drugs used for the treatment of erectile dysfunction like ": null
    },
    {
        "sildenafil": "sildenafil"
    },
    {
        " and ": null
    },
    {
        "tadalafil": "tadalafil"
    }
]