[
    {
        "               Cymbeline , also known as The Tragedie of Cymbeline or Cymbeline, King of Britain, is a play by ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        " set in ": null
    },
    {
        "Ancient Britain": "british iron age"
    },
    {
        "  and based on legends that formed part of the ": null
    },
    {
        "Matter of Britain": "matter of britain"
    },
    {
        " concerning the early Celtic British King ": null
    },
    {
        "Cunobeline": "cunobeline"
    },
    {
        ". Although listed as a tragedy in the ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        ", modern critics often classify Cymbeline as a ": null
    },
    {
        "romance": "shakespeares late romances"
    },
    {
        " or even a ": null
    },
    {
        "comedy": "shakespearean comedy"
    },
    {
        ". Like  Othello  and  The Winters Tale , it deals with the themes of innocence and jealousy. While the precise date of composition remains unknown, the play was certainly produced as early as 42          ;In Britain   Cymbeline – Modeled on the historical King of Britain, ": null
    },
    {
        "Cunobeline": "cunobeline"
    },
    {
        ", and father to Imogen   Queen – Cymbelines second wife and mother to Cloten   ": null
    },
    {
        "Imogen/Innogen": "imogen"
    },
    {
        " – Cymbelines daughter by a former queen, later disguised as the page Fidele   Posthumus Leonatus – Innogens husband, adopted as an orphan and raised in Cymbelines family   Cloten – Queens son by a former husband and step-brother to Imogen   Belarius – banished lord living under the name Morgan, who abducted King Cymbelines infant sons in retaliation for his banishment   ": null
    },
    {
        "Guiderius": "guiderius"
    },
    {
        " – Cymbelines son, kidnapped in childhood by Belarius and raised as his son Polydore   ": null
    },
    {
        "Arvirargus": "arvirargus"
    },
    {
        " – Cymbelines son, kidnapped in childhood by Belarius and raised as his son Cadwal   Pisanio – Posthumus servant, loyal to both Posthumus and Imogen   Cornelius – court physician   Helen – lady attending Imogen   Two Lords attending Cloten   Two Gentlemen   Two Captains   Two Jailers     ;In Rome   Philario – Posthumus host in Rome   Iachimo/Giacomo – a Roman lord and friend of Philaro   French Gentleman   Dutch Gentleman   Spanish Gentleman   Caius Lucius – Roman ambassador and later general   Two ": null
    },
    {
        "Roman senators": "roman senate"
    },
    {
        " tribune": "tribune"
    },
    {
        "s   Roman captain   Philharmonus – soothsayer     ;Apparitions   ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " – King of the Gods in ": null
    },
    {
        "Roman Mythology": "roman mythology"
    },
    {
        "         Cymbeline, the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        "s vassal king of Britain, once had two sons, Guiderius and Arvirargus, but they were stolen twenty years earlier as infants by an exiled traitor named Belarius. Cymbeline discovers that his only child left, his daughter Imogen , has secretly married her lover Posthumus Leonatus, a member of Cymbelines court. The lovers have exchanged jewelry as tokens: Imogen with a bracelet, and Posthumus with a ring. Cymbeline dismisses the marriage and banishes Posthumus since Imogen—as Cymbelines only child—must produce a fully royal-blooded heir to succeed to ": null
    },
    {
        "the British throne": "monarchy of the united kingdom"
    },
    {
        ". In the meantime, Cymbelines Queen is conspiring to have Cloten married to Imogen to secure her bloodline. The Queen is also plotting to murder both Imogen and Cymbeline, procuring what she believes to be deadly poison from the court doctor. The doctor, Cornelius, is suspicious and switches the poison with a harmless sleeping potion. The Queen passes the poison along to Pisanio, Posthumus and Imogens loving servant—the latter is led to believe it is a medicinal drug. No longer able to be with her banished Posthumus, Imogen secludes herself in her chambers, away from Clotens aggressive advances.     Posthumus must now live in Italy, where he meets Iachimo , who challenges the prideful Posthumus to a bet that he, Iachimo, can seduce Imogen, who Posthumus has praised for her chastity, and then bring Posthumus proof of Imogens adultery. If Iachimo wins, he will get Posthumuss token ring. If Posthumus wins, not only must Iachimo pay him but also fight Posthumus in a duel with swords. Iachimo heads to Britain where he aggressively attempts to seduce the faithful Imogen, who sends him packing. Iachimo then hides in a chest in Imogens bedchamber and, when the princess falls asleep, emerges to steal from her Posthumuss bracelet. He also takes note of the room, as well as the mole on Imogens partly naked body, to be able to present false evidence to Posthumus that he has seduced his bride. Returning to Italy, Iachimo convinces Posthumus that he has successfully seduced Imogen. In his wrath, Posthumus sends two letters to Britain: one to Imogen, telling her to meet him at ": null
    },
    {
        "Milford Haven": "milford haven"
    },
    {
        ", on the Welsh coast; the other to the servant Pisanio, ordering him to murder Imogen at the Haven. However, Pisanio refuses to kill Imogen and reveals to her Posthumuss plot. He has Imogen disguise herself as a boy and continue to Milford Haven to seek employment. He also gives her the Queens poison , believing it will alleviate her psychological distress. In the guise of a boy, Imogen adopts the name Fidele , meaning faithful .     Back at Cymbelines court, Cymbeline refuses to pay his British tribute to the Roman ambassador Caius Lucius, and Lucius warns Cymbeline of the Roman Emperors forthcoming wrath, which will amount to an invasion of Britain by Roman troops. Meanwhile, Cloten learns of the meeting between Imogen and Posthumus at Milford Haven. Dressing himself enviously in Posthumuss clothes, he decides to go to Wales to kill Posthumus, and then rape, abduct, and marry Imogen. Imogen has now been travelling as Fidele through the Welsh mountains, her health in decline as she comes to a cave: the home of Belarius, along with his sons Polydore and Cadwal, whom he raised into great hunters. These two young men are in fact the British princes Guiderius and Arviragus, who themselves do not realise their own origin. The men discover Fidele , and, instantly captivated by a strange affinity for him , become fast friends. Outside the cave, Guiderius is met by Cloten, who throws insults, leading to a sword fight during which Guiderius beheads Cloten. Meanwhile, Imogens fragile state worsens and she takes the poison as a hopeful medicine; when the men re-enter, they find her dead. They mourn and, after placing Clotens body beside hers, briefly depart to prepare for the double burial. Imogen awakes to find the headless body, and believes it to be Posthumus due to the fact the body is wearing Posthumus clothes. Lucius Roman soldiers have just arrived in Britain and, as the army moves through Wales, Lucius discovers the devastated Fidele , who pretends to be a loyal servant grieving for his killed master; Lucius, moved by this faithfulness, enlists Fidele as a pageboy.     The treacherous Queen is now wasting away due to the disappearance of her son Cloten. Meanwhile, despairing of his life, a guilt-ridden Posthumus enlists in the Roman forces as they begin their invasion of Britain. Belarius, Guiderius, Arviragus, and Posthumus all help rescue Cymbeline from the Roman onslaught; the king does not yet recognise these four, yet takes notice of them as they go on to fight bravely and even capture the Roman commanders, Lucius and Iachimo, thus winning the day. Posthumus, allowing himself to be captured, as well as Fidele , are imprisoned alongside the true Romans, all of whom await execution. In jail, Posthumus sleeps, while the ghosts of his dead family appear to complain to ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " of his grim fate. Jupiter himself then appears in thunder and glory to assure the others that destiny will grant happiness to Posthumus and Britain.     Cornelius arrives in the court to announce that the Queen has died suddenly, and that on her deathbed she unrepentantly confessed to villainous schemes against her husband and his throne. Both troubled and relieved at this news, Cymbeline prepares to execute his new prisoners, but pauses when he sees Fidele , whom he finds both beautiful and somehow familiar. Fidele has noticed Posthumus ring on Iachimos finger and abruptly demands to know from where the jewel came. A remorseful Iachimo tells of his bet, and how he could not seduce Imogen, yet tricked Posthumus into thinking he had. Posthumus then comes forward to confirm Iachimos story, revealing his identity and acknowledging his wrongfulness in desiring Imogen killed. Ecstatic, Imogen throws herself at Posthumus, who still takes her for a boy and knocks her down. Pisanio then rushes forward to explain that Fidele is Imogen in disguise; Imogen still suspects that Pisanio conspired with the Queen to give her the poison. Pisanio sincerely claims innocence, and Cornelius reveals how the poison was a non-fatal potion all along. Insisting that his betrayal years ago was a set-up, Belarius makes his own happy confession, revealing Guiderius and Arviragus as Cymbelines own two long-lost sons. With her brothers restored to their place in the line of inheritance, Imogen is now free to marry Posthumus. An elated Cymbeline pardons Belarius and the Roman prisoners, including Lucius and Iachimo. Lucius calls forth his soothsayer to decipher a prophecy of recent events, which ensures happiness for all. Blaming his manipulative Queen for his refusal to pay earlier, Cymbeline now agrees to pay the tribute to the Roman Emperor as a gesture of peace between Britain and Rome, and he invites everyone to a great feast.       Cymbeline is grounded in the story of the historical British king ": null
    },
    {
        "Cunobeline": "cunobeline"
    },
    {
        ", which was originally recorded in Geoffrey of Monmouths ": null
    },
    {
        "Historia Regum Britanniae": "historia regum britanniae"
    },
    {
        ", but which Shakespeare likely found in the 42 edition of Raphael ": null
    },
    {
        "Holinsheds Chronicles": "holinsheds chronicles"
    },
    {
        ". Shakespeare based the setting of the play and the character Cymbeline on what he found in Holinsheds chronicles, but the plot and subplots of the play are derived from other sources. The subplot of Posthumus and Iachimos wager derives from story II.42 of ": null
    },
    {
        "Giovanni Boccaccio": "giovanni boccaccio"
    },
    {
        "s  The Decameron  and the anonymously authored Frederyke of Jennen. These share similar characters and wager terms, and both feature Iachimos equivalent hiding in a chest in order to gather proof in Imogens room. Iachimos description of Imogens room as proof of her infidelity derives from The Decameron, Nosworthy, J. M. Preface in  p.xxiv quote: and Pisanios reluctance to kill Imogen and his use of her bloody clothes to convince Posthumus of her death derive from Frederyke of Jennen. In both sources, the equivalent to Posthumus bracelet is stolen jewelry that the wife later recognizes while cross-dressed. Shakespeare also drew inspiration for Cymbeline from a play called The Rare Triumphs of Love and Fortune, first performed in 42 There are many parallels between the characters of the two plays, including a kings daughter who falls for a man of unknown birth who grew up in the kings court. The subplot of Belarius and the lost princes was inspired by the story of Bomelio, an exiled nobleman in The Rare Triumphs who is later revealed to be the protagonists father.       The first recorded production of Cymbeline, as noted by ": null
    },
    {
        "Simon Forman": "simon forman"
    },
    {
        ", was in April 42 It was first published in the  First Folio  in 42 When Cymbeline was actually written cannot be precisely dated.     The Yale edition suggests a collaborator had a hand in the authorship, and some scenes may strike the reader as particularly un-Shakespearean when compared with others. The play shares notable similarities in language, situation, and plot with ": null
    },
    {
        "Beaumont and Fletcher": "beaumont and fletcher"
    },
    {
        "s tragicomedy  Philaster, or Love Lies a-Bleeding  . Both plays concern themselves with a princess who, after disobeying her father in order to marry a lowly lover, is wrongly accused of infidelity and thus ordered to be murdered, before escaping and having her faithfulness proven. Furthermore, both were written for the same theatre company and audience. Some scholars believe this supports a dating of approximately 42 though it is not clear which play preceded the other.The editors of the Oxford and Norton Shakespeare believe the name of Imogen is a misprint for Innogen—they draw several comparisons between Cymbeline and  Much Ado About Nothing , in early editions of which a ": null
    },
    {
        "ghost character": "ghost character"
    },
    {
        " named Innogen was supposed to be ": null
    },
    {
        "Leonato": "governor leonato"
    },
    {
        "s wife . ": null
    },
    {
        "Stanley Wells": "stanley wells"
    },
    {
        " and Michael Dobson point out that Holinsheds Chronicles, which Shakespeare used as a source, mention an Innogen and that Formans eyewitness account of the April 42 performance refers to Innogen throughout. In spite of these arguments, most editions of the play have continued to use the name Imogen, and it has been suggested that Imogen may be intended to evoke the figure of Innogen but that the slight change in name is deliberate, as there are other characters in the play whose names appear to be slight variants of historical or pseudo-historical figures. However the prophecy interpretation at the end appears to support an -m- based name, rather than -nn- based one.     Milford Haven is not known to have been used during the period in which Cymbeline is set, and it is not known why Shakespeare used it in the play. ": null
    },
    {
        "Robert Nye": "robert nye"
    },
    {
        " noted that it was the closest seaport to Shakespeares home town of ": null
    },
    {
        "Stratford-upon-Avon": "stratford-upon-avon"
    },
    {
        ": But if you marched due west from Stratford, looking neither to left nor to right, with the idea of running away to sea in your young head, then Milford Haven is the port youd reach, a walk of about , about six days journey, that the young Shakespeare might well have taken, or at least dreamed of taking. ": null
    },
    {
        "Marisa R. Cull": "marisa r. cull"
    },
    {
        " notes its possible symbolism as the landing site of ": null
    },
    {
        "Henry Tudor": "henry vii of england"
    },
    {
        ", when he invaded England via Milford on 42 August 42 on his way to deposing ": null
    },
    {
        "Richard III": "richard iii of england"
    },
    {
        " and establishing the ": null
    },
    {
        "Tudor dynasty": "tudor dynasty"
    },
    {
        ". It may also reflect English anxiety about the loyalty of the ": null
    },
    {
        "Welsh": "welsh people"
    },
    {
        " and the possibility of future invasions at Milford.       Cymbeline was one of Shakespeares more popular plays during the eighteenth century, though critics including ": null
    },
    {
        "Samuel Johnson": "samuel johnson"
    },
    {
        " took issue with its complex plot:          ": null
    },
    {
        "William Hazlitt": "william hazlitt"
    },
    {
        " and ": null
    },
    {
        "John Keats": "john keats"
    },
    {
        ", however, numbered it among their favorite plays.     By the early twentieth century, the play had lost favor. ": null
    },
    {
        "Lytton Strachey": "lytton strachey"
    },
    {
        " found it difficult to resist the conclusion that was getting bored himself. Bored with people, bored with real life, bored with drama, bored, in fact, with everything except poetry and poetical dreams.  ": null
    },
    {
        "Harley Granville-Barker": "harley granville-barker"
    },
    {
        " had similar views, saying that the play shows that Shakespeare was becoming a wearied artist .     Some have argued that the play parodies its own content. ": null
    },
    {
        "Harold Bloom": "harold bloom"
    },
    {
        " says Cymbeline, in my judgment, is partly a Shakespearean self parody; many of his prior plays and characters are mocked by it.        Similarities between Cymbeline and historical accounts of the ": null
    },
    {
        "Roman Emperor Augustus": "augustus"
    },
    {
        " have prompted critics to interpret the play as Shakespeare voicing support for the political motions of ": null
    },
    {
        "James I": "james vi and i"
    },
    {
        ", who considered himself the British Augustus.  His political maneuvers to unite Scotland with England and Wales as an empire mirror Augustus  Pax Romana . The play reinforces the Jacobean idea that Britain is the successor to the civilized virtue of ancient Rome, portraying the parochialism and isolationism of Cloten and the Queen as villainous. Other critics have resisted the idea that Cymbeline endorses James Is ideas about national identity, pointing to several characters conflicted constructions of their geographic identities. For example, although Guiderius and Arviragus are the sons of Cymbeline, a British king raised in Rome, they grew up in a Welsh cave. The brothers lament their isolation from society, a quality associated with barbarousness, but Belarius, their adoptive father, retorts that this has spared them from corrupting influences of the supposedly civilized British court.     Iachimos invasion of Imogens bedchamber reflects concern that Britain was being maligned by Italian influence. As noted by Peter A. Parolin, Cymbeline’s scenes ostensibly set in ancient Rome are in fact anachronistic portrayals of sixteenth-century Italy, which was characterized by contemporary British authors as a place where vice, debauchery, and treachery had supplanted the virtue of ancient Rome. Though Cymbeline concludes with a peace forged between Britain and Rome, Iachimos corruption of Posthumus and metaphorical rape of Imogen demonstrate fears that Britains political union with other cultures might expose Britons to harmful foreign influences.       Scholars have emphasized that the play attributes great political significance to Imogens virginity and ": null
    },
    {
        "chastity": "chastity"
    },
    {
        ". There is some debate as to whether Imogen and Posthumus marriage is legitimate. Imogen has historically been played and received as an ideal, chaste woman maintaining qualities applauded in a ": null
    },
    {
        "patriarchal": "patriarchy"
    },
    {
        " structure; however, critics argue that Imogens actions contradict these social definitions through her defiance of her father and her cross-dressing. Yet critics including Tracy Miller-Tomlinson have emphasized the ways in which the play upholds patriarchal ideology, including in the final scene, with its panoply of male victors. Whilst Imogen and Posthumus marriage at first upholds ": null
    },
    {
        "heterosexual": "heterosexuality"
    },
    {
        " norms, their separation and final reunion leave open non-heterosexual possibilities, initially exposed by Imogens cross-dressing as Fidele. Miller-Tomlinson points out the falseness of their social significance as a perfect example of a public heterosexual marriage , considering that their private relations turn out to be homosocial, ": null
    },
    {
        "homoerotic": "homoeroticism"
    },
    {
        ", and hermaphroditic.      ": null
    },
    {
        "Queer theory": "queer theory"
    },
    {
        " has gained traction in scholarship on Cymbeline, building upon the work of ": null
    },
    {
        "Eve Kosofsky Sedgwick": "eve kosofsky sedgwick"
    },
    {
        " and ": null
    },
    {
        "Judith Butler": "judith butler"
    },
    {
        ". Scholarship on this topic has emphasized the plays ": null
    },
    {
        "Ovidian": "ovidian"
    },
    {
        " allusions and exploration of non-normative gender/sexuality – achieved through separation from traditional society into what Valerie Traub terms green worlds.  Amongst the most obvious and frequently cited examples of this non-normative dimension of the play is the prominence of homoeroticism, as seen in Guiderius and Arviraguss semi-sexual fascination with the disguised Imogen/Fidele. In addition to homoerotic and homosocial elements, the subjects of ": null
    },
    {
        "hermaphroditism": "hermaphrodite"
    },
    {
        " and paternity/maternity also feature prominently in queer interpretations of Cymbeline. ": null
    },
    {
        "Janet Adelman": "janet adelman"
    },
    {
        " set the tone for the intersection of paternity and hermaphroditism in arguing that Cymbelines lines, oh, what am I, / A mother to the birth of three? Ne’er mother / Rejoiced deliverance more , amount a parthenogenesis fantasy . Cymbeline, V.v.42 Cymbeline, V. vi.4242  According to Adelman and Tracey Miller-Tomlinson, in taking sole credit for the creation of his children Cymbeline acts a hermaphrodite who transforms a maternal function into a patriarchal strategy by regaining control of his male heirs and daughter, Imogen. Imogens own experience with gender fluidity and ": null
    },
    {
        "cross-dressing": "cross-dressing"
    },
    {
        " has largely been interpreted through a patriarchal lens. Unlike other Shakespearean agents of onstage gender fluidity – ": null
    },
    {
        "Portia": "portia"
    },
    {
        ", ": null
    },
    {
        "Rosalind": "rosalind"
    },
    {
        ", ": null
    },
    {
        "Viola": "viola"
    },
    {
        " and ": null
    },
    {
        "Julia": "the two gentlemen of verona"
    },
    {
        " – Imogen is not afforded empowerment upon her transformation into Fidele. Instead, Imogens power is inherited from her father and based upon the prospect of reproduction.       After the 42 performance mentioned by Simon Forman, there is no record of production until 42 when the play was revived at court for ": null
    },
    {
        "Charles I": "charles i of england"
    },
    {
        " and ": null
    },
    {
        "Henrietta Maria": "henrietta maria of france"
    },
    {
        ". The ": null
    },
    {
        "Caroline": "caroline era"
    },
    {
        " production was noted as being well likte by the kinge.  In 42 ": null
    },
    {
        "John Rich": "john rich"
    },
    {
        " staged the play with his company at ": null
    },
    {
        "Lincolns Inn Fields": "lincolns inn fields"
    },
    {
        ", with emphasis placed on the spectacle of the production rather than the text of the play. ": null
    },
    {
        "Theophilus Cibber": "theophilus cibber"
    },
    {
        " revived Shakespeares text in 42 with a performance at the ": null
    },
    {
        "Haymarket": "haymarket, london"
    },
    {
        ". There is evidence that Cibber put on another performance in 42 and another in 42     In 42 ": null
    },
    {
        "David Garrick": "david garrick"
    },
    {
        " edited a new version of the text. It is recognized as being close to the original Shakespeare, although there are several differences. Changes included the shortening of Imogens burial scene and the entire fifth act, including the removal of Posthumus dream. Garricks text was first performed in November of that year, starring Garrick himself as Posthumus. Several scholars have indicated that Garricks Posthumus was much liked. Valerie Wayne notes that Garricks changes made the play more nationalistic, representing a trend in perception of Cymbeline during that period. Garricks version of Cymbeline would prove popular; it was staged a number of times over the next few decades.     In the late eighteenth century, Cymbeline was performed in ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ".     The play entered the Romantic era with ": null
    },
    {
        "John Philip Kemble": "john philip kemble"
    },
    {
        "s company in 42 Kembles productions made use of lavish spectacle and scenery; one critic noted that during the bedroom scene, the bed was so large that Jachimo all but needed a ladder to view Imogen in her sleep. Kemble added a dance to Clotens comic wooing of Imogen. In 42 his brother ": null
    },
    {
        "Charles": "charles kemble"
    },
    {
        " mounted an antiquarian production at ": null
    },
    {
        "Covent Garden": "theatre royal, covent garden"
    },
    {
        "; it featured costumes designed after the descriptions of the ancient British by such writers as ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        " and ": null
    },
    {
        "Diodorus Siculus": "diodorus siculus"
    },
    {
        ".     ": null
    },
    {
        "William Charles Macready": "william charles macready"
    },
    {
        " mounted the play several times between 42 and 42 At the Theatre Royal, ": null
    },
    {
        "Marylebone": "marylebone"
    },
    {
        ", an ": null
    },
    {
        "epicene": "breeches role"
    },
    {
        " production was staged with Mary Warner, ": null
    },
    {
        "Fanny Vining": "fanny vining"
    },
    {
        ", ": null
    },
    {
        "Anna Cora Mowatt": "anna cora mowatt"
    },
    {
        ", and ": null
    },
    {
        "Edward Loomis Davenport": "edward loomis davenport"
    },
    {
        ".     In 42 Cymbeline was first performed in ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        ". In the late nineteenth century, the play was produced several times in ": null
    },
    {
        "India": "india"
    },
    {
        ".     In 42 as part of the celebrations of Shakespeares birth, ": null
    },
    {
        "Samuel Phelps": "samuel phelps"
    },
    {
        " performed the title role at ": null
    },
    {
        "Theatre Royal, Drury Lane": "theatre royal, drury lane"
    },
    {
        ". ": null
    },
    {
        "Helena Faucit": "helena faucit"
    },
    {
        " returned to the stage for this performance.     The play was also one of ": null
    },
    {
        "Ellen Terry": "ellen terry"
    },
    {
        "s last performances with ": null
    },
    {
        "Henry Irving": "henry irving"
    },
    {
        " at the ": null
    },
    {
        "Lyceum": "lyceum theatre, london"
    },
    {
        " in 42 Terrys performance was widely praised, though Irving was judged an indifferent Iachimo. Like Garrick, Irving removed the dream of Posthumus; he also curtailed Iachimos remorse and attempted to render Clotens character consistent. A review in the  Athenaeum  compared this trimmed version to ": null
    },
    {
        "pastoral": "pastoral"
    },
    {
        " comedies such as  As You Like It . The set design, overseen by ": null
    },
    {
        "Lawrence Alma-Tadema": "lawrence alma-tadema"
    },
    {
        ", was lavish and advertised as historically accurate, though the reviewer for the time complained of such anachronisms as gold crowns and printed books as props.     Similarly lavish but less successful was ": null
    },
    {
        "Margaret Mather": "margaret mather"
    },
    {
        "s production in New York in 42 The sets and publicity cost $42, but Mather was judged too emotional and undisciplined to succeed in a fairly cerebral role.     ": null
    },
    {
        "Barry Jackson": "barry jackson"
    },
    {
        " staged a ": null
    },
    {
        "modern dress": "modern dress"
    },
    {
        " production for the ": null
    },
    {
        "Birmingham Rep": "birmingham repertory theatre"
    },
    {
        " in 42 two years before his influential modern dress  Hamlet . ": null
    },
    {
        "Walter Nugent Monck": "walter nugent monck"
    },
    {
        " brought his ": null
    },
    {
        "Maddermarket Theatre": "maddermarket theatre"
    },
    {
        " production to Stratford in 42 inaugurating the post-war tradition of the play.     London saw two productions in the 42 season. ": null
    },
    {
        "Michael Benthall": "michael benthall"
    },
    {
        " directed the less successful production, at ": null
    },
    {
        "The Old Vic": "the old vic"
    },
    {
        ". The set design by ": null
    },
    {
        "Audrey Cruddas": "audrey cruddas"
    },
    {
        " was notably minimal, with only a few essential props. She relied instead on a variety of lighting effects to reinforce mood; actors seemed to come out of darkness and return to darkness. ": null
    },
    {
        "Barbara Jefford": "barbara jefford"
    },
    {
        " was criticised as too cold and formal for Imogen; Leon Gluckman played Posthumus, ": null
    },
    {
        "Derek Godfrey": "derek godfrey"
    },
    {
        " Iachimo, and ": null
    },
    {
        "Derek Francis": "derek francis"
    },
    {
        " Cymbeline. Following Victorian practice, Benthall drastically shortened the last act.     By contrast, ": null
    },
    {
        "Peter Hall": "peter hall"
    },
    {
        "s production at the ": null
    },
    {
        "Shakespeare Memorial": "royal shakespeare theatre"
    },
    {
        " presented nearly the entire play, including the long-neglected dream scene . Hall presented the play as a distant fairy tale, with stylised performances. The production received favourable reviews, both for Halls conception and, especially, for ": null
    },
    {
        "Peggy Ashcroft": "peggy ashcroft"
    },
    {
        "s Imogen. ": null
    },
    {
        "Richard Johnson": "richard johnson"
    },
    {
        " played Posthumus, and Robert Harris Cymbeline. Iachimo was played by ": null
    },
    {
        "Geoffrey Keen": "geoffrey keen"
    },
    {
        ", whose father ": null
    },
    {
        "Malcolm": "malcolm keen"
    },
    {
        " had played Jachimo with Ashcroft at the Old Vic in 42     Halls approach attempted to unify the plays diversity by means of a fairy-tale ": null
    },
    {
        "topos": "literary topos"
    },
    {
        ". The next major ": null
    },
    {
        "Royal Shakespeare Company": "royal shakespeare company"
    },
    {
        " production, in 42 went in the opposite direction. Working on a set draped with heavy white sheets, director ": null
    },
    {
        "William Gaskill": "william gaskill"
    },
    {
        " employed ": null
    },
    {
        "Brechtian": "bertolt brecht"
    },
    {
        " alienation effect": "alienation effect"
    },
    {
        "s, to mixed critical reviews. ": null
    },
    {
        "Bernard Levin": "bernard levin"
    },
    {
        " complained that the bare set deprived the play of necessary scenic splendor. The acting, however, was widely praised. ": null
    },
    {
        "Vanessa Redgrave": "vanessa redgrave"
    },
    {
        " as Imogen was often compared favourably to Ashcroft; ": null
    },
    {
        "Eric Porter": "eric porter"
    },
    {
        " was a success as Jachimo, as was ": null
    },
    {
        "Clive Swift": "clive swift"
    },
    {
        " as Cloten. ": null
    },
    {
        "Patrick Allen": "patrick allen"
    },
    {
        " was Posthumus, and ": null
    },
    {
        "Tom Fleming": "tom fleming"
    },
    {
        " played the title role.     A decade later, ": null
    },
    {
        "John Barton": "john barton"
    },
    {
        "s 42 production for the RSC  featured ": null
    },
    {
        "Sebastian Shaw": "sebastian shaw"
    },
    {
        " in the title role, ": null
    },
    {
        "Tim Pigott-Smith": "tim pigott-smith"
    },
    {
        " as Posthumus, ": null
    },
    {
        "Ian Richardson": "ian richardson"
    },
    {
        " as Jachimo, and ": null
    },
    {
        "Susan Fleetwood": "susan fleetwood"
    },
    {
        " as Imogen. ": null
    },
    {
        "Charles Keating": "charles keating"
    },
    {
        " was Cloten. As with contemporary productions of Pericles, this one used a narrator to signal changes in mood and treatment to the audience. ": null
    },
    {
        "Robert Speaight": "robert speaight"
    },
    {
        " disliked the set design, which he called too minimal, but he approved the acting.     In 42 David Jones revived the play for the RSC; the production was in general a disappointment, although ": null
    },
    {
        "Judi Dench": "judi dench"
    },
    {
        " as Imogen received reviews that rivalled Ashcrofts. ": null
    },
    {
        "Ben Kingsley": "ben kingsley"
    },
    {
        " played Jachimo; ": null
    },
    {
        "Roger Rees": "roger rees"
    },
    {
        " was Posthumus. In 42 Bill Alexander directed the play in The Other Place with Harriet Walter playing Imogen, David Bradley as Cymbeline and Nicholas Farrell as Posthumus.     At the ": null
    },
    {
        "Stratford Festival": "stratford festival of canada"
    },
    {
        ", the play was directed in 42 by ": null
    },
    {
        "Jean Gascon": "jean gascon"
    },
    {
        " and in 42 by ": null
    },
    {
        "Robin Phillips": "robin phillips"
    },
    {
        ". The latter production, which was marked by much-approved scenic complexity, featured ": null
    },
    {
        "Colm Feore": "colm feore"
    },
    {
        " as Jachimo, and ": null
    },
    {
        "Martha Burns": "martha burns"
    },
    {
        " as Imogen. The play was again at Stratford in 42 directed by David Latham. A large medieval tapestry unified the fairly simple stage design and underscored Lathams fairy-tale inspired direction.     In 42 Ajay Chowdhury directed an ": null
    },
    {
        "Anglo-Indian": "anglo-indian"
    },
    {
        " production of Cymbeline at the Rented Space Theatre Company. Set in India under British rule, the play features Iachimo, played by Rohan Kenworthy, as a British soldier and Imogen, played by Uzma Hameed, as an Indian princess.     At the new ": null
    },
    {
        "Globe Theatre": "globe theatre"
    },
    {
        " in 42 a cast of six  used extensive doubling for the play. The cast wore identical costumes even when in disguise, allowing for particular comic effects related to doubling      There have been some well-received theatrical productions including the ": null
    },
    {
        "Public Theater": "public theater"
    },
    {
        "s 42 production in New York City, directed by ": null
    },
    {
        "Andrei Șerban": "andrei șerban"
    },
    {
        ". Cymbeline was also performed at the ": null
    },
    {
        "Cambridge Arts Theatre": "cambridge arts theatre"
    },
    {
        " in October 42 in a production directed by Sir Trevor Nunn, and in November 42 at the ": null
    },
    {
        "Chicago Shakespeare Theatre": "chicago shakespeare theatre"
    },
    {
        ". The play was included in the 42 repertory season of the ": null
    },
    {
        "Oregon Shakespeare Festival": "oregon shakespeare festival"
    },
    {
        ".     In 42 and 42 the ": null
    },
    {
        "Hudson Shakespeare Company": "hudson shakespeare company"
    },
    {
        " of New Jersey produced two distinct versions of the play. The 42 production, directed by Jon Ciccarelli, embraced the fairy tale aspect of the story and produced a colorful version with wicked step mothers, feisty princesses and a campy Iachimo. The 42 version, directed by Rachel Alt, went in a completely opposite direction and placed the action on ranch in the American ": null
    },
    {
        "Old West": "old west"
    },
    {
        ". The Queen was a southern belle married to a rancher, with Imogen as a high society girl in love with the cowhand Posthumous.     In a 42 ": null
    },
    {
        "Cheek by Jowl": "cheek by jowl"
    },
    {
        " production, ": null
    },
    {
        "Tom Hiddleston": "tom hiddleston"
    },
    {
        " doubled as Posthumus and Cloten.     In 42 the Shakespeare Theatre Company of Washington, DC, presented a version of the play that emphasized its fable and folklore elements, set as a tale within a tale, as told to a child.     In 42 ": null
    },
    {
        "Antoni Cimolino": "antoni cimolino"
    },
    {
        " directed a production at the ": null
    },
    {
        "Stratford Festival": "stratford festival"
    },
    {
        " that steered into the fairy-tale elements of the text.     Also in 42 the ": null
    },
    {
        "South Sudan": "south sudan"
    },
    {
        " Theatre Company staged Cymbeline in ": null
    },
    {
        "Juba Arabic": "juba arabic"
    },
    {
        " for the ": null
    },
    {
        "Shakespeares Globe": "shakespeares globe"
    },
    {
        " Globe to Globe festival. It was translated by Derik Uya Alfred and directed by Joseph Abuk. Connections between the content of the play and South Sudans own political struggle have been drawn by the productions producers, as well as some scholars. Overall, the production was well received by audiences and critics. Critic Matt Truman gave the production four out of five stars, saying The worlds youngest nation seems delighted to be here and, played with this much heart, even Shakespeares most rambling romance becomes irresistible.      In 42 ": null
    },
    {
        "Samir Bhamra": "samir bhamra"
    },
    {
        " directed the play for Phizzical Productions with six actors playing multiple parts for a UK national tour. The cast included Sophie Khan Levy as Innojaan, Adam Youssefbeygi, Tony Hasnath, Liz Jadav and Robby Khela. The production was set in the souks of Dubai and the Bollywood film industry during the 42s communal riots and received acclaim from reviewers and academics alike.     Also in 42 a ": null
    },
    {
        "folk": "folk music"
    },
    {
        " musical": "musical theatre"
    },
    {
        " adaptation of Cymbeline was performed at the ": null
    },
    {
        "First Folio Theatre": "first folio theatre"
    },
    {
        " in Oak Brook, Illinois.  The setting was the ": null
    },
    {
        "American South": "southern united states"
    },
    {
        " during the ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        ", with Cymbeline as a man of high status who avoids military service. The play was performed outdoors and was accompanied by traditional ": null
    },
    {
        "Appalachian": "appalachian mountains"
    },
    {
        " folk songs.     In 42 ": null
    },
    {
        "Melly Still": "melly still"
    },
    {
        " directed Cymbeline at the ": null
    },
    {
        "Royal Shakespeare Company": "royal shakespeare company"
    },
    {
        ". This version of the play was performed at the ": null
    },
    {
        "Royal Shakespeare Theatre": "royal shakespeare theatre"
    },
    {
        " before moving to the ": null
    },
    {
        "Barbican": "barbican centre"
    },
    {
        " in late 42 The performance featured Bethan Cullinane as Innogen and ": null
    },
    {
        "Gillian Bevan": "gillian bevan"
    },
    {
        " as Cymbeline.          The play was adapted by ": null
    },
    {
        "Thomas dUrfey": "thomas durfey"
    },
    {
        " as The Injured Princess, or, the Fatal Wager; this version was produced at the ": null
    },
    {
        "Theatre Royal, Drury Lane": "theatre royal, drury lane"
    },
    {
        ", presumably by the united ": null
    },
    {
        "Kings Company": "kings company"
    },
    {
        " and ": null
    },
    {
        "Dukes Company": "dukes company"
    },
    {
        ", in 42 The play changes some names and details, and adds a subplot, typical of the Restoration, in which a virtuous waiting-woman escapes the traps laid by Cloten. DUrfey also changes Pisanios character so that he at once believes in Imogens guilt. For his part, DUrfeys Posthumus is ready to accept that his wife might have been untrue, as she is young and beautiful. Some details of this alteration survived in productions at least until the middle of the century.     William Hawkins revised the play again in 42 His was among the last of the heavy revisions designed to bring the play in line with ": null
    },
    {
        "classical unities": "classical unities"
    },
    {
        ". He cut the Queen, reduced the action to two places . The dirge With fairest flowers... was set to music by ": null
    },
    {
        "Thomas Arne": "thomas arne"
    },
    {
        ".     Nearer the end of the century, ": null
    },
    {
        "Henry Brooke": "henry brooke"
    },
    {
        " wrote an adaptation which was apparently never staged. His version eliminates the brothers altogether as part of a notable enhancement of Posthumus role in the play.     ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        ", who criticised the play perhaps more harshly than he did any of Shakespeares other works, took aim at what he saw as the defects of the final act in his 42  Cymbeline Refinished ; as early as 42 he had complained about the absurdities of the play to Ellen Terry, then preparing to act Imogen. He called it stagey trash of the lowest melodramatic order . He later changed his view, saying it was one of the finest of Shakespeares later plays , but he remained convinced that it goes to pieces in the final act . Accordingly, in Cymbeline Refinished he rewrote the last act, cutting many of the numerous revelations and expositions, while also making Imogen a much more assertive figure in line with his feminist views.     There have been a number of radio adaptations of Cymbeline between the 42s and the 42s. The ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " broadcast productions of Cymbeline in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " in 42 42 42 42 42 and 42 ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " broadcast a production of the play in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " in 42 In October 42 the BBC aired a production of ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        "s  Cymbeline Refinished , as well as ": null
    },
    {
        "Shaws": "george bernard shaw"
    },
    {
        " foreword to the play.       ": null
    },
    {
        "Lucius J. Henderson": "lucius j. henderson"
    },
    {
        " directed the first screen adaptation of Cymbeline in 42 The film was produced by the ": null
    },
    {
        "Thanhouser Company": "thanhouser company"
    },
    {
        " and starred ": null
    },
    {
        "Florence La Badie": "florence la badie"
    },
    {
        " as ": null
    },
    {
        "Imogen": "imogen"
    },
    {
        ", ": null
    },
    {
        "James Cruze": "james cruze"
    },
    {
        " as Posthumus, ": null
    },
    {
        "William Garwood": "william garwood"
    },
    {
        " as Iachimo, ": null
    },
    {
        "William Russell": "william russell"
    },
    {
        " as Cymbeline, and ": null
    },
    {
        "Jean Darnell": "jean darnell"
    },
    {
        " as the Queen.     In 42 the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " broadcast several scenes of ": null
    },
    {
        "André van Gyseghem": "andré van gyseghem"
    },
    {
        "s production of the play, which opened 42 November the same year, on television. The scenes that comprised the broadcast were pulled exclusively from Acts I and II of the play, and included the trunk scene from Act II Scene 42  In 42 the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " produced a similar television program, this time airing scenes from ": null
    },
    {
        "Michael Benthall": "michael benthall"
    },
    {
        "s theatrical production, which opened 42 September 42 Like the 42 program, the 42 broadcast ran for roughly half an hour and presented several scenes from Cymbeline, including the trunk scene.     In 42 ": null
    },
    {
        "Jerzy Jarocki": "jerzy jarocki"
    },
    {
        " directed an adaptation of the play for ": null
    },
    {
        "Polish": "poland"
    },
    {
        " television, starring Wiktor Sadecki as Cymbeline and Ewa Lassek as ": null
    },
    {
        "Imogen": "imogen"
    },
    {
        ".     ": null
    },
    {
        "Elijah Moshinsky": "elijah moshinsky"
    },
    {
        " directed the ": null
    },
    {
        "BBC Television Shakespeare": "bbc television shakespeare"
    },
    {
        " adaptation in 42 ignoring the ancient British period setting in favour of a more timeless and snow-laden atmosphere inspired by ": null
    },
    {
        "Rembrandt": "rembrandt"
    },
    {
        " and his ": null
    },
    {
        "contemporary Dutch painters": "dutch golden age"
    },
    {
        ". ": null
    },
    {
        "Richard Johnson": "richard johnson"
    },
    {
        ", ": null
    },
    {
        "Claire Bloom": "claire bloom"
    },
    {
        ", ": null
    },
    {
        "Helen Mirren": "helen mirren"
    },
    {
        ", and ": null
    },
    {
        "Robert Lindsay": "robert lindsay"
    },
    {
        " play Cymbeline, his Queen, Imogen, and Jachimo, respectively, with ": null
    },
    {
        "Michael Pennington": "michael pennington"
    },
    {
        " as Posthumus.     In 42 ": null
    },
    {
        "Ethan Hawke": "ethan hawke"
    },
    {
        " and director ": null
    },
    {
        "Michael Almereyda": "michael almereyda"
    },
    {
        ", who previously collaborated on the 42 film  Hamlet , re-teamed for the film  Cymbeline , in which Hawke plays Iachimo. The film is set in the context of urban gang warfare. ": null
    },
    {
        "Ed Harris": "ed harris"
    },
    {
        " takes the title role. ": null
    },
    {
        "Penn Badgley": "penn badgley"
    },
    {
        " plays the orphan Posthumus; ": null
    },
    {
        "Milla Jovovich": "milla jovovich"
    },
    {
        " plays the role of the Queen; ": null
    },
    {
        "Anton Yelchin": "anton yelchin"
    },
    {
        " is Cloten; and ": null
    },
    {
        "Dakota Johnson": "dakota johnson"
    },
    {
        " plays the role of Imogen.         Prior to operatic adaptations only incidental music was composed. The first operatic adaption seems to be composed by ": null
    },
    {
        "Edmond Missa": "edmond missa"
    },
    {
        " in 42 under the title Dinah ; American composer ": null
    },
    {
        "Christopher Berg": "christopher berg"
    },
    {
        " composed another one, of which scenes were performed in 42          The Song from Act II, Scene 42   was set to music by ": null
    },
    {
        "Franz Schubert": "franz schubert"
    },
    {
        " in 42     Perhaps the most famous verses in the play come from the funeral song of Act IV, Scene 42 which begins:   :Fear no more the heat o the sun,   :Nor the furious winters rages;   :Thou thy worldly task hast done,   :Home art gone, and taen thy wages:   :Golden lads and girls all must,   :As chimney-sweepers, come to dust.     The first two lines are quoted by ": null
    },
    {
        "Virginia Woolf": "virginia woolf"
    },
    {
        " in  Mrs. Dalloway  by the two main characters Clarissa and Septimus Smith. The lines, which turn Mrs. Dalloways thoughts to the trauma of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", are at once an elegiac dirge and a profoundly dignified declaration of endurance. The song provides a major organisational motif for the novel. The final couplet also appears in the ": null
    },
    {
        "Anton Myrer": "anton myrer"
    },
    {
        " novel, The Last Convertible.     The last two lines appear to have inspired ": null
    },
    {
        "T. S. Eliot": "t. s. eliot"
    },
    {
        " in Lines to a Yorkshire Terrier . He writes:     :Pollicle dogs and cats all must   :Jellicle cats and dogs all must   :Like undertakers, come to dust.     The song was set to music by ": null
    },
    {
        "Roger Quilter": "roger quilter"
    },
    {
        " as Fear No More the Heat o the Sun, No. 42 of Five Shakespeare Songs, Op. 42 . It was also set by ": null
    },
    {
        "Gerald Finzi": "gerald finzi"
    },
    {
        " as part of his ": null
    },
    {
        "song cycle": "song cycle"
    },
    {
        " on texts by Shakespeare  Let Us Garlands Bring  .     At the end of ": null
    },
    {
        "Stephen Sondheim": "stephen sondheim"
    },
    {
        "s ": null
    },
    {
        "The Frogs": "the frogs"
    },
    {
        ", William Shakespeare is competing against ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        " for the title of best playwright, deciding which of them is to be brought back from the dead in order to improve the world. Shakespeare sings the funeral song of Act IV, Scene 42 when asked about his view of death .     Fear no more the heat of the sun is the line that Winnie and her husband are trying to remember in Samuel Becketts  Happy Days ": null
    }
]