[
    {
        "thumb": "image:dagomevatican-1copy.jpg"
    },
    {
        "thumb": "image:dagomecambraicopy.jpg"
    },
    {
        "Dagome iudex is one of the earliest historical documents relating to ": null
    },
    {
        "Poland": "poland"
    },
    {
        ". Although Poland is not mentioned by name, it refers to Dagome and Ote  and their sons in 991, placing their land under the protection of the ": null
    },
    {
        "Apostolic See": "holy see"
    },
    {
        ". The documents name derives from its opening words.       The Dagome iudex survives in the form of a summary, completed c. 1080. It was found in a register compiled by a ": null
    },
    {
        "curial": "roman curia"
    },
    {
        " cardinal": "catholic cardinal"
    },
    {
        " during the ": null
    },
    {
        "papacy": "pope"
    },
    {
        " of ": null
    },
    {
        "Gregory VII": "pope gregory vii"
    },
    {
        ".     Most historians believe that the word  Dagome  is a melding of two names: the Christian  Dago,  for ": null
    },
    {
        "Dagobert": "dagobert"
    },
    {
        " , and the Slavic  Me,  for Mieszko. The ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word  iudex  could refer to prince. Another interpretation is that  Dagome iudex  is a corruption of  Ego Mesco dux  . In the Vatican copy, the e of Dagome might have an s adscriptum , although the Vatican copyist read iudex literally, relating it to ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        " and ": null
    },
    {
        "its four judges ": "giudicati"
    },
    {
        ".     Place names are misspelled by the writer who made the summary. He was apparently unaware that the document related to territory later called Poland.     The boundaries of the ": null
    },
    {
        "Gniezno": "gniezno"
    },
    {
        " state are described as those that extended to the Long Sea , ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", ": null
    },
    {
        "Rus": "rus people"
    },
    {
        ", ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ", ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        " and the ": null
    },
    {
        "Oder River": "oder river"
    },
    {
        ". ": null
    },
    {
        "Lesser Poland": "lesser poland"
    },
    {
        " is included by the mention of its capital, ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " . Between alemura, probably ": null
    },
    {
        "Olomouc": "olomouc"
    },
    {
        " and ": null
    },
    {
        "Upper Lusatia": "upper lusatia"
    },
    {
        " region of the ": null
    },
    {
        "Milceni": "milceni"
    },
    {
        "  When Lusatia came in sight of medieval writers, the  lived only in ": null
    },
    {
        "Lower Lusatia": "lower lusatia"
    },
    {
        ", the ": null
    },
    {
        "Milceni": "milceni"
    },
    {
        " in ": null
    },
    {
        "Upper Lusatia": "upper lusatia"
    },
    {
        ". Later on, the term Lusatia was spread to the south. Therefore, nowadays term ": null
    },
    {
        "Lusatian Mountains": "lusatian mountains"
    },
    {
        " does not totally fit with the history of settlement. a straightened border could include ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        ".     The text seems to use ciuitas schinesghe as a synonym of ": null
    },
    {
        "Greater Poland": "greater poland"
    },
    {
        ". Otherwise, the boundary description would be more logical if schenisghe meant the city of ": null
    },
    {
        "Szczecin": "szczecin"
    },
    {
        ". Of the other regions and places in Mieszkos territory, it mentioned only ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " and ": null
    },
    {
        "Lusatia": "lusatia"
    },
    {
        ", both without fines . The regions outside Mieszkos rule, pruzze  and russe  were mentioned with the word fines.     The Dagome iudex is of critical importance to ": null
    },
    {
        "Polish history": "history of poland"
    },
    {
        ", since it provided a general description of the future Polish state in that period. It, however, left many questions unanswered. First, it did not explain why ": null
    },
    {
        "Mieszko I": "mieszko i of poland"
    },
    {
        " placed his state under the Popes protection. Also, it is unclear why the document did not mention Mieszkos eldest son, ": null
    },
    {
        "Bolesław I the Brave": "bolesław i the brave"
    },
    {
        ". Instead, his sons by his second wife , Oda, were mentioned instead. Finally, Mieszko I is not referred to as Dagome in any other document.     Historians suppose that Bolesławs absence from the document might be explained by an old Slavic custom whereby children received their inheritance as soon as they reached the ": null
    },
    {
        "age of majority": "age of majority"
    },
    {
        ". Thus, ": null
    },
    {
        "Bolesław the Brave": "bolesław i the brave"
    },
    {
        " might have received ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " as his part of his fathers legacy before the Dagome iudex was written.     Dagome iudex Item in alio tomo sub Iohanne XV papa Dagome iudex et Ote senatrix et filii eorum: Misicam et Lambertus - nescio cuius gentis homines, puto autem Sardos fuisse, quoniam ipsi a IIII iudicibus reguntur - leguntur beato Petro contulisse unam civitatem in integro, que vocatur Schinesghe, cum omnibus suis pertinentiis infra hos affines, sicuti incipit a primo latere longum mare, fine Bruzze usque in locum, qui dicitur Russe et fines Russe extendente usque in Craccoa et ab ipsa Craccoa usque ad flumen Oddere recte in locum, qui dicitur Alemure, et ab ipsa Alemura usque in terram Milze recte intra Oddere et exinde ducente iuxta flumen Oddera usque in predictam civitatem Schinesghe. ": null
    },
    {
        "Pope John XV": "pope john xv"
    },
    {
        ", Dagome, Dagome is commonly identified as ": null
    },
    {
        "Mieszko I": "mieszko i of poland"
    },
    {
        ". However, the question remains open whether this was a misspelling or his Christian name. If the latter, it might correspond to the names ": null
    },
    {
        "Dago": "dago"
    },
    {
        " , ": null
    },
    {
        "Dagon": "dagon"
    },
    {
        " or ": null
    },
    {
        "Dagobert": "dagobert"
    },
    {
        " . lord, In classical Latin, the term iudex was used to refer to a person who is ordered to do some work on behalf of others and was identical in meaning to the Byzantine  archont . However, in medieval Latin iudex could also mean a sovereign ruler. Princes of ": null
    },
    {
        "Slavic": "slavs"
    },
    {
        " tribes were sometimes referred to as iudices. Nevertheless, some historians claim that this was a misspelling of the Latin  dux  . and ": null
    },
    {
        "Ote": "oda von haldensleben"
    },
    {
        ", lady, Literally, lady-senator . Cf. ": null
    },
    {
        "senate": "senate"
    },
    {
        " . and their sons ": null
    },
    {
        "Misico": "mieszko mieszkowic"
    },
    {
        " and ": null
    },
    {
        "Lambert": "lambert mieszkowic"
    },
    {
        " It is unclear why ": null
    },
    {
        "Bolesław I the Brave": "bolesław i the brave"
    },
    {
        ", Mieszkos eldest son and his successor, is not mentioned while the children from Mieszkos marriage to Ote are.  were supposed to give to Saint Peter one state in whole which is called Schinesghe, The origin of the name Schinesghe is unclear. Some historians argue that it is a corruption of ": null
    },
    {
        "Gniezno": "gniezno"
    },
    {
        " , then Polands capital. Others identify it with the town of ": null
    },
    {
        "Szczecin": "szczecin"
    },
    {
        ". with all its lands in borders which run along the long sea, Long sea : Some historians identify it with the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        ", others with the province of ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        " , a part of Poland ca. 990. along Prussia to the place called Rus, thence to ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " and from said Kraków to the River ": null
    },
    {
        "Oder": "oder"
    },
    {
        ", straight to a place called Alemure, Alemure might be the city of ": null
    },
    {
        "Olomouc": "olomouc"
    },
    {
        ", in ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        ". However, this is uncertain. and from said Alemure to the land of ": null
    },
    {
        "Milczanie": "milczanie"
    },
    {
        ", and from the borders of that people to the Oder and from that, going along the River Oder, ending at the earlier mentioned city of Schinesghe.                Notes based on interpretations by the Polish historian ": null
    },
    {
        "Gerard Labuda": "gerard labuda"
    },
    {
        ":                ": null
    }
]