[
    {
        "Dagobert I  was the king of ": null
    },
    {
        "Austrasia": "austrasia"
    },
    {
        " , ": null
    },
    {
        "king of all the Franks": "king of the franks"
    },
    {
        " , and king of ": null
    },
    {
        "Neustria": "neustria"
    },
    {
        " and ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        " . He was the last king of the ": null
    },
    {
        "Merovingian": "merovingian"
    },
    {
        " dynasty to wield any real royal power. Dagobert was the first of the ": null
    },
    {
        "Frankish king": "frankish king"
    },
    {
        "s to be buried in the royal tombs at ": null
    },
    {
        "Saint Denis Basilica": "saint denis basilica"
    },
    {
        ".       Dagobert was the eldest son of ": null
    },
    {
        "Chlothar II": "chlothar ii"
    },
    {
        " and Haldetrude and the grandson of ": null
    },
    {
        "Fredegund": "fredegund"
    },
    {
        ". Chlothar had reigned alone over all the Franks since 42 In 42 Chlothar made Dagobert king of ": null
    },
    {
        "Austrasia": "austrasia"
    },
    {
        ", almost certainly to bind the Austrasian nobility to the ruling Franks. As a child, Dagobert lived under the care of the Carolingian dynasty forebears and Austrasian magnates, ": null
    },
    {
        "Arnulf of Metz": "arnulf of metz"
    },
    {
        " and ": null
    },
    {
        "Pepin of Landen": "pepin of landen"
    },
    {
        ".     Chlothar attempted to manage the unstable alliances he had with other noble families throughout much of Dagoberts reign. When Chlothar granted Austrasia to Dagobert, he initially excluded ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ", the ": null
    },
    {
        "Vosges": "vosges mountains"
    },
    {
        ", and the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        ", but shortly thereafter the Austrasian nobility forced him to concede these regions to Dagobert. The rule of a Frank from the Austrasian heartland tied Alsace more closely to the Austrasian court. Dagobert created a new duchy  in southwest Austrasia to guard the region from Burgundian or Alemannic encroachments and ambitions. The duchy comprised the Vosges, the ": null
    },
    {
        "Burgundian Gate": "burgundian gate"
    },
    {
        ", and the ": null
    },
    {
        "Transjura": "transjurane burgundy"
    },
    {
        ". Dagobert made his courtier ": null
    },
    {
        "Gundoin": "gundoin"
    },
    {
        "—who incidentally established monasteries in Alsace and Burgundy—the first duke of this new polity that was to last until the end of the Merovingian dynasty. While Austrasian rulers such as Chlothar and Dagobert controlled these regions through part of the seventh-century, they eventually became autonomous kingdoms as powerful aristocratic families sought separate paths across their respective realms.            Upon the death of his father in 42 Dagobert inherited the Neustrian and Burgundian kingdoms. His half-brother ": null
    },
    {
        "Charibert": "charibert ii"
    },
    {
        ", son of ": null
    },
    {
        "Sichilde": "sichilde"
    },
    {
        ", claimed Neustria but Dagobert opposed him. Brodulf, brother of Sichilde, petitioned Dagobert on behalf of his young nephew, but Dagobert assassinated him and became sole king of the Franks. He later gave the Aquitaine to Charibert as a consolation prize.  In 42 Dagobert concluded a treaty with the Byzantine emperor ": null
    },
    {
        "Heraclius": "heraclius"
    },
    {
        ", which entailed enforcing the compulsory baptism of Jews throughout his kingdom. Besides signing this treaty, Dagobert also took steps to secure trade across his empire by protecting important markets along the mouth of the Rhine at Duurstede and Utrecht, which in part explains his later determination to defend the Austrasian Franks from the Avar menace.     Under the rule of Dagoberts father and like-minded Merovingians, Frankish society during the seventh-century experienced greater integration—the Catholic faith became predominant for instance—and a generally improved economic situation, but there was no initial impetus for the political unification of Gaul. Clothar II did not seek to force his Neustrian neighbors into submission, choosing instead a policy of cooperation. This did not prohibit plunder-raids to replenish the dynastic coffers, which Dagobert undertook in Spain for example—one raid there earned him 42 gold solidi. Historian Ian Wood claims that Dagobert was probably richer than most Merovingian monarchs and cites for example his assistance to the Visigoth ": null
    },
    {
        "Sisenand": "sisenand"
    },
    {
        "—whom he aided in his rise to the Visigothic throne in Spain—and for which, Sisenand awarded Dagobert a golden dish weighing some five-hundred pounds.     When Charibert and his son ": null
    },
    {
        "Chilperic": "chilperic of aquitaine"
    },
    {
        " were assassinated in 42 Dagobert had Burgundy and Aquitaine firmly under his rule, becoming the most powerful Merovingian king in many years and the most respected ruler in the West. In 42 Dagobert led a large army against ": null
    },
    {
        "Samo": "samo"
    },
    {
        ", the ruler of the ": null
    },
    {
        "Slavic": "slavic peoples"
    },
    {
        " Wends, partly at the request of the Germanic peoples living in the eastern territories and also due to Dagoberts quarrel with him about the Wends having robbed and killed a number of Frankish merchants. While Dagoberts Austrasian forces were defeated at the ": null
    },
    {
        "Wogastisburg": "battle of wogastisburg"
    },
    {
        ", his Alemmanic and Lombard allies were successful in repelling the Wends. Taking advantage of the situation at the time, the Saxons offered to help Dagobert if he agreed to rescind the 42 cow yearly tribute to the Austrasians. Despite accepting this agreement, Fredegar reports that it was to little avail since the Wends attacked again the following year.       Also in 42 the nobles of Austrasia revolted under the ": null
    },
    {
        "mayor of the palace": "mayor of the palace"
    },
    {
        ", ": null
    },
    {
        "Pepin of Landen": "pepin of landen"
    },
    {
        ". In 42 Dagobert appeased the rebellious nobles by putting his three-year-old son, ": null
    },
    {
        "Sigebert III": "sigebert iii"
    },
    {
        ", on the throne, thereby ceding royal power in the easternmost of his realms, just as his father had done for him eleven years earlier. In historian Ian Woods view, Dagoberts creation of a sub-kingdom for his son Sigibert had important long-term implications for the general structure of Merovingian Francia.      As king, Dagobert made ": null
    },
    {
        "Paris": "paris"
    },
    {
        " his capital. During his reign, he built the ": null
    },
    {
        "Altes Schloss": "burg meersburg"
    },
    {
        " in ": null
    },
    {
        "Meersburg": "meersburg"
    },
    {
        " , which today is the oldest inhabited castle in that country. Devoutly religious, Dagobert was also responsible for the construction of the ": null
    },
    {
        "Saint Denis Basilica": "saint denis basilica"
    },
    {
        " at the site of a ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " monastery in Paris. He also appointed St. Arbogast bishop of ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        ". Dagobert was beloved in many ways according to Fredegar, who wrote that He rendered justice to rich and poor alike, adding that, he took little sleep or food, and cared only so to act that all men should leave his presence full of joy and admiration.  Such images do not fully convey the power and domination wielded by Frankish kings like Dagobert, who along with his father Chlothar, reigned to such a degree that historian Patrick Geary described the period of their combined rule as the apogee of Merovingian royal power.      Dagobert went down in history as one of the greatest Frankish kings, having held his lands against the eastern hordes and with noblemen as far away as ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", who sought his overlordship. Only thirty-six when he died, Dagobert constituted the last of the great Merovingian kings, who, according to J.M. Wallace-Hadrill, had the ruthless energy of a Clovis and the cunning of a ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        ".  Despite having more or less united the Frankish realms, he likely was not expecting unitary rule to continue given the diverging interests of the Austrasian and Neustrian Franks, atop those of the Aquitanians and Burgundians. Upon his death, he was buried in the abbey of Saint-Denis and was the first Frankish king to be buried in the ": null
    },
    {
        "Saint Denis Basilica": "saint denis basilica"
    },
    {
        ", ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". The interment of Dagobert at Saint-Denis established a precedent for the future burial of French rulers there.               The author of the  Chronicle of Fredegar  criticises the king for his loose morals in having three queens almost simultaneously, as well as several concubines . When rex Brittanorum Judicael came to Clichy to visit with Dagobert, he opted not to dine with him due to his misgivings with Dagoberts moral choices, instead dining with the kings referendary, ": null
    },
    {
        "St. Audoen": "audoin"
    },
    {
        ". Fredegars chronicle names the three queens, ": null
    },
    {
        "Nanthild": "nanthild"
    },
    {
        " and the otherwise obscure Wulfegundis and Berchildis, but none of the concubines, stating that a full list of concubines would be too long. In 42/42 Dagobert married Gormatrude, a sister of his fathers wife ": null
    },
    {
        "Sichilde": "sichilde"
    },
    {
        "; but the marriage was childless. After divorcing Gormatrude in 42/42 he made ": null
    },
    {
        "Nanthild": "nanthild"
    },
    {
        ", a Saxon servant  from his personal entourage, his new queen. She gave birth to ": null
    },
    {
        "Clovis II": "clovis ii"
    },
    {
        " later king of Neustria and Burgundy. Shortly after his marriage to Nanthild, he took a girl called Ragnetrude to his bed, who gave birth to his youngest son, ": null
    },
    {
        "Sigebert III": "sigebert iii"
    },
    {
        " later king of Austrasia.        France historique et monumentale ": null
    },
    {
        "Scepter of Dagobert": "scepter of dagobert"
    },
    {
        "  Triens  of Dagobert I, ": null
    },
    {
        "Uzès": "uzès"
    },
    {
        ", 42–42 gold 42g. ": null
    },
    {
        "Monnaie de Paris": "monnaie de paris"
    },
    {
        "  Solidus  of Dagobert I, ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        ", 42–42 ": null
    },
    {
        "Cabinet des Médailles": "cabinet des médailles"
    },
    {
        " Triens": "triens"
    },
    {
        " of Dagobert I and moneyer Romanos, Augaune, 4242 gold 42g. ": null
    },
    {
        "Monnaie de Paris": "monnaie de paris"
    }
]