[
    {
        "The Dagor Bragollach   was the fourth battle of the ": null
    },
    {
        "Wars of Beleriand": "battles of beleriand"
    },
    {
        " in ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        "s fictional ": null
    },
    {
        "Middle-earth": "middle-earth"
    },
    {
        ". It was the great turning point in the ": null
    },
    {
        "War of the Jewels": "war of the jewels"
    },
    {
        ".          It began on a winters night in the beginning of the year 42 of the ": null
    },
    {
        "First Age": "first age"
    },
    {
        ", with the eruptions of the volcanic peaks of ": null
    },
    {
        "Thangorodrim": "thangorodrim"
    },
    {
        " sending out rivers of flame, poisonous fumes and clouds of smoke and ash. All this provided confusion, destruction and darkness to cover the advance of Morgoths forces. The fires, spearheaded by ": null
    },
    {
        "Glaurung": "glaurung"
    },
    {
        " the ": null
    },
    {
        "Dragon": "dragon"
    },
    {
        ", destroyed the vegetation of the grassy plain of ": null
    },
    {
        "Ard-galen": "ard-galen"
    },
    {
        ", which was later renamed Anfauglith, the Gasping Dust. Both ": null
    },
    {
        "Fingolfin": "fingolfin"
    },
    {
        ", High-king of the ": null
    },
    {
        "Noldor": "noldor"
    },
    {
        ", and ": null
    },
    {
        "Fëanor": "fëanor"
    },
    {
        "ian Noldor led by ": null
    },
    {
        "Maedhros": "maedhros"
    },
    {
        " had maintained camps of cavalry on Ard-galen as a forward watch on Morgoth. Many of these were caught by the fires and killed; the remainder were forced to escape to their fortresses in the mountains. Morgoths armies of Orcs, led by numerous ": null
    },
    {
        "Balrog": "balrog"
    },
    {
        "s, were now able to advance, without interference and under cover of darkness, to attack each of the realms of the Noldor simultaneously and individually, preventing the three Houses of the Noldor from joining forces or coming to one anothers assistance.     As in the Third Battle, ": null
    },
    {
        "Dagor Aglareb": "dagor aglareb"
    },
    {
        ", Morgoths prime objective was the capture of the central highland of ": null
    },
    {
        "Dorthonion": "dorthonion"
    },
    {
        ", a fief of ": null
    },
    {
        "Finrod": "finrod"
    },
    {
        "s realm that lay directly south of ": null
    },
    {
        "Angband": "angband"
    },
    {
        " across the plain. Possession of Dorthonion would provide Morgoth with a forward base easily supported from Angband while splitting the Noldorin forces in two, physically preventing any effort to unite forces against him. And the first realm to be overrun was Dorthonion. Both ": null
    },
    {
        "Angrod": "angrod"
    },
    {
        " and ": null
    },
    {
        "Aegnor": "aegnor"
    },
    {
        ", together with ": null
    },
    {
        "Bregolas": "bregolas"
    },
    {
        ", Lord of ": null
    },
    {
        "Ladros": "ladros"
    },
    {
        " and brother of ": null
    },
    {
        "Barahir": "barahir"
    },
    {
        ", died in battle, with Barahir holding onto western Dorthonion. ": null
    },
    {
        "Finrod Felagund": "finrod felagund"
    },
    {
        " led an army of reinforcements from ": null
    },
    {
        "Nargothrond": "nargothrond"
    },
    {
        ", but was ambushed by Morgoths forces at the ": null
    },
    {
        "Fens of Serech": "fens of serech"
    },
    {
        " and cut off from the bulk of his troops. Finrod would have been killed or captured but for a sortie by Barahir, who descended from Dorthonion and rescued the ": null
    },
    {
        "elven": "elf"
    },
    {
        " lord, despite suffering heavy losses. In return for Barahirs courage and loyalty, Finrod swore an oath of friendship to Barahir and his family, giving him his ": null
    },
    {
        "ring": "ring of barahir"
    },
    {
        " as a token. The armies of ": null
    },
    {
        "Hithlum": "hithlum"
    },
    {
        " also attempted to come to Dorthonions assistance, but were driven back to their hill fortresses in the ": null
    },
    {
        "Ered Wethrin": "ered wethrin"
    },
    {
        ", suffering severe losses. ": null
    },
    {
        "Hador": "hador"
    },
    {
        ", Lord of ": null
    },
    {
        "Dor-lómin": "dor-lómin"
    },
    {
        ", his younger son Gundor and many of their followers died in the rearguard of Fingolfins army as it retreated to the fortress of the Barad Eithel. Dorthonion, the centre of the northern Noldorin siege line, was gained by Morgoth, and a new pass south into Mid-Beleriand at Anach was opened for the Orcs.     With the Noldor and their allies thrown on the defensive and his primary objective—the capture of Dorthonion—achieved, the initiative was firmly in Morgoths grip. The gateway passes south into ": null
    },
    {
        "Beleriand": "beleriand"
    },
    {
        " and west into Hithlum were his next objectives. The river island fortress of ": null
    },
    {
        "Minas Tirith": "minas tirith"
    },
    {
        " in the Pass of ": null
    },
    {
        "Sirion": "river sirion"
    },
    {
        " in the west under ": null
    },
    {
        "Orodreth": "orodreth"
    },
    {
        " held. In the east, all the cavalry camps of the ": null
    },
    {
        "March of Maedhros": "march of maedhros"
    },
    {
        " were overrun, but the ferocity and valour of Maedhros was unmatched and his fortress on ": null
    },
    {
        "Himring": "himring"
    },
    {
        " withstood the assaults. The ": null
    },
    {
        "Pass of Aglon": "pass of aglon"
    },
    {
        " was breached, although Morgoths forces suffered severe losses, and ": null
    },
    {
        "Celegorm": "celegorm"
    },
    {
        " and ": null
    },
    {
        "Curufin": "curufin"
    },
    {
        " fled via the north marches of ": null
    },
    {
        "Doriath": "doriath"
    },
    {
        " towards Minas Tirith. Glaurung spearheaded a separate attack on ": null
    },
    {
        "Maglors Gap": "maglors gap"
    },
    {
        ", which was forced, and Morgoths armies ravaged the land between the arms of the river Gelion. ": null
    },
    {
        "Maglor": "maglor"
    },
    {
        " retreated to Maedhros fortress on Himring. Morgoths Orcs took the mountain forts on ": null
    },
    {
        "Mount Rerir": "mount rerir"
    },
    {
        ", and defiled ": null
    },
    {
        "Lake Helevorn": "lake helevorn"
    },
    {
        ", then advanced south through ": null
    },
    {
        "Thargelion": "thargelion"
    },
    {
        " and into East Beleriand over the fords of the river ": null
    },
    {
        "Gelion": "gelion"
    },
    {
        ". ": null
    },
    {
        "Caranthir": "caranthir"
    },
    {
        " fled far south to ": null
    },
    {
        "Amon Ereb": "amon ereb"
    },
    {
        ", where he and his brothers, ": null
    },
    {
        "Amrod": "amrod"
    },
    {
        " and ": null
    },
    {
        "Amras": "amras"
    },
    {
        ", allied with the ": null
    },
    {
        "Green Elves": "green elves"
    },
    {
        ". While Maglor and Maedhros held Himring, survivors from Dorthonion and the other eastern realms rallied there, and Maedhros managed to secure the Pass of Aglon. However, the March of Maedhros, the eastern wing of the northern Noldorin siege line against Morgoth, could not be re-established.     Finrod and his army retired south to Nargothrond, while Barahir continued to try to contest Dorthonion with a dwindling force of men. When the land became inhospitable, the women and children of the ": null
    },
    {
        "House of Bëor": "house of bëor"
    },
    {
        " relocated to Hithlum and ": null
    },
    {
        "Brethil": "brethil"
    },
    {
        " under the leadership of ": null
    },
    {
        "Emeldir": "emeldir"
    },
    {
        ", the wife of Barahir. The mountain forts of the ": null
    },
    {
        "Ered Wethrin": "ered wethrin"
    },
    {
        " around Hithlum also held against all attacks, although barely. The siege was broken, the ": null
    },
    {
        "sons of Fëanor": "sons of fëanor"
    },
    {
        " were scattered, parts of Finrods realm lost, Fingolfin and ": null
    },
    {
        "Fingon": "fingon"
    },
    {
        " were shut up in Hithlum, and ": null
    },
    {
        "Orcs": "orc"
    },
    {
        " roamed at will throughout the north. Despite their successes, the armies of Morgoth had suffered severe losses, The Silmarillion, p. 42 ... his own loss had been no less... ; The Lost Road and Other Writings, p.42 ...he was dismayed to find how great had been their loss... and he recalled his hosts in the spring, ending the main battle. ": null
    },
    {
        "Doriath": "doriath"
    },
    {
        " had been undisturbed by the war, and many ": null
    },
    {
        "Sindar": "sindar"
    },
    {
        " had deserted the Noldor at the beginning of the battle and settled there, increasing the strength of that realm.     As a result of these and ensuing battles, only of the Noldorin Elves around 42 were taken prisoners to Angband. The Lays of Beleriand, pp. 42 42 and  p. 42: ten thousand smiths...the thrall Noldoli... . In Vol. II the reference is thralls from after the Battle of Unnumbered Tears, the Fifth Battle; in Vol. III the reference is to the thralls taken in Fingolfins defeat in the Battle of Sudden Flame, the Fourth Battle.  p. 42: Great numbers of the Gnomes... they took captive...They laboured...in his mines and forges...          When Fingolfin, the High-king of the Noldor, learned of the defeats and heavy casualties of the Noldor, in despair and anger, he rode alone upon his war-horse, Rochallor, across ": null
    },
    {
        "Anfauglith": "anfauglith"
    },
    {
        " to challenge Morgoth to single combat. The Orcs fled at the rumour of his approach. When Fingolfin arrived at gate of the fortress of Angband, his challenge to Morgoth was accepted. They fought a great duel in which Fingolfin wounded Morgoth seven times with his sword ": null
    },
    {
        "Ringil": "list of middle-earth weapons and armourringil"
    },
    {
        ". Yet, he was felled by Morgoths mace, ": null
    },
    {
        "Grond": "list of middle-earth weapons and armourgrond"
    },
    {
        ", and crushed beneath Morgoths foot. Fingolfins body was borne away by ": null
    },
    {
        "Thorondor": "thorondor"
    },
    {
        ", King of ": null
    },
    {
        "Eagles": "eagle"
    },
    {
        ". Morgoth was permanently scarred by these wounds and from then on walked with a limp. Many accounts hold he never left his fortress again during the wars, though the account given in The Tale of the Children of Húrin is that he takes Húrin to the Haudh-en-Nirnaeth following the Battle of Unnumbered Tears.          Morgoth now consolidated his previous gains and exploited the disarray of the Noldor. From Angband, ": null
    },
    {
        "Sauron": "sauron"
    },
    {
        " was sent in command of a great force of Orc-hosts, Werewolves, and Wolves against the fortress of Minas Tirith on Tol Sirion, which Orodreth still held. Sauron took it by storm and Orodreth was driven out, his retreat to Nargothrond covered by the cavalry of Celegorm and Curufin. Sauron made Tol Sirion a base from which to spread terror and it was renamed ": null
    },
    {
        "Tol-in-Gaurhoth": "tol-in-gaurhoth"
    },
    {
        ", the Isle of Werewolves. From there he expanded the occupation of Dorthonion with such sorcery and horror that even the Orcs would only pass through it with speed. Barahir and his men were hunted down until only ": null
    },
    {
        "Beren": "beren"
    },
    {
        " lived and, at last, he too was driven out and eventually came to ": null
    },
    {
        "Doriath": "doriath"
    },
    {
        ". Now from the western gateway pass into Beleriand Sauron sent Orc-armies and Orc-legions south to encompass Doriath from the west. At that time, another Orc-host under ": null
    },
    {
        "Boldog": "boldog"
    },
    {
        " came over Dorthonion, now named ": null
    },
    {
        "Taur-nu-Fuin": "taur-nu-fuin"
    },
    {
        ", through the Anach Pass on the North March of Doriath and the Orc army that broke through the Pass of Aglon harried Radhrim, the East March of Doriath.     The marches of Doriath became a battleground between Orcs and the Grey Elves. Orcs sent by Sauron came south in force, but the Men of Brethil, aided by the Sindar of Doriath led by ": null
    },
    {
        "Beleg": "beleg"
    },
    {
        ", destroyed an Orc-legion at the crossing of ": null
    },
    {
        "Taeglin": "taeglin"
    },
    {
        " in 42 ": null
    },
    {
        "Thingol": "thingol"
    },
    {
        " and the Sindar of Doriath defeated the Orc-army occupying East Beleriand on Radhrim, the East March, in 42 and crushed the Orc-host of Boldog on the North March, in 42 A sortie from Himring destroyed the remnants of the Orcs. The second assault on Hithlum would see ": null
    },
    {
        "Galdor": "galdor the tall"
    },
    {
        ", Lord of Dor-lómin, die defending ": null
    },
    {
        "Barad Eithel": "barad eithel"
    },
    {
        ". Morgoth launched a two pronged assault in 42 one Orc-host lay siege to forts of the mountain passes of Ered Wethrin while the other came down from the north, crossing the ice and attacking Fingon on the plains of Hithlum. ": null
    },
    {
        "Húrin": "húrin"
    },
    {
        ", son of Galdor and the new lord of Dor-lómin, routed the armies of Morgoth and drove them back at Barad Eithel. Fingon, outnumbered on the plains, was reinforced by ": null
    },
    {
        "Círdan": "círdan"
    },
    {
        " and the ": null
    },
    {
        "Falathrim": "falathrim"
    },
    {
        " who sailed to his rescue in great strength, landing their warriors near the ": null
    },
    {
        "Gate of the Noldor": "gate of the noldor"
    },
    {
        ". The Orc-host, caught between the armies of Hithlum and ": null
    },
    {
        "Falas": "falas"
    },
    {
        ", was destroyed. In 42 ": null
    },
    {
        "Lúthien": "lúthien"
    },
    {
        " with the help of ": null
    },
    {
        "Huan": "huan"
    },
    {
        " first overthrew Sauron and destroyed his fortress ": null
    },
    {
        "Tol-in-Gaurhoth": "tol-in-gaurhoth"
    },
    {
        " and then in 42 with Beren, in the depths of Angband, they took a ": null
    },
    {
        "Silmaril": "silmaril"
    },
    {
        " from the Crown of Morgoth achieving what all the swords and armies and plans of the Noldor had failed to in nearly 42 years of war.       The achievements of ": null
    },
    {
        "Beren and Lúthien": "beren and lúthien"
    },
    {
        " marked the end of the Battle of Sudden Flame. The recovery of the Silmaril and the Elven victories of 4242 brought hope to the Elves and Men that Morgoth may be overcome. They inspired Maedhros to build an alliance of free peoples called the ": null
    },
    {
        "Union of Maedhros": "union of maedhros"
    },
    {
        " that he intended to take the war to the Gates of Angband. Following the Dagor Bragollach, after the 42 years of relative peace enjoyed during the Siege of Angband, fighting with Morgoths forces would never fully cease thereafter, but a semblance of peace returned to Beleriand for a while.       The ": null
    },
    {
        "Austria": "austria"
    },
    {
        "n ": null
    },
    {
        "black metal": "black metal"
    },
    {
        " band ": null
    },
    {
        "Summoning": "summoning"
    },
    {
        " features a song titled Dagor Bragollach on their ": null
    },
    {
        "Minas Morgul": "minas morgul"
    },
    {
        " album.     The ": null
    },
    {
        "German": "germany"
    },
    {
        " power metal": "power metal"
    },
    {
        " band ": null
    },
    {
        "Blind Guardian": "blind guardian"
    },
    {
        " features a song titled Battle of Sudden Flame in their ": null
    },
    {
        "Nightfall in Middle-Earth": "nightfall in middle-earth"
    },
    {
        " album. The song is based directly on the battle.     The ": null
    },
    {
        "German": "germany"
    },
    {
        " power metal": "power metal"
    },
    {
        " band ": null
    },
    {
        "Blind Guardian": "blind guardian"
    },
    {
        " also features a song titled Time Stands Still in their ": null
    },
    {
        "Nightfall in Middle-Earth": "nightfall in middle-earth"
    }
]