[
    {
        "   A dairy is a ": null
    },
    {
        "business enterprise": "business enterprise"
    },
    {
        " established for the harvesting or processing of animal ": null
    },
    {
        "milk": "milk"
    },
    {
        " – mostly from ": null
    },
    {
        "cows": "cattle"
    },
    {
        " or ": null
    },
    {
        "goat": "goat"
    },
    {
        "s, but also from ": null
    },
    {
        "buffaloes": "water buffalo"
    },
    {
        ", ": null
    },
    {
        "sheep": "sheep"
    },
    {
        ", ": null
    },
    {
        "horse": "horse"
    },
    {
        "s, or ": null
    },
    {
        "camel": "camel"
    },
    {
        "s – for human consumption. A dairy is typically located on a dedicated ": null
    },
    {
        "dairy farm": "dairy farming"
    },
    {
        " or in a section of a multi-purpose farm that is concerned with the harvesting of milk.     Terminology differs between countries. For example, in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", an entire dairy farm is commonly called a dairy . The building or farm area where milk is harvested from the cow is often called a milking parlor or parlor . Except in the case of smaller dairies, where cows are often put on pasture, and usually milked in stanchion barns . The farm area where milk is stored in bulk tanks is known as the farms milk house . Milk is then hauled  to a dairy plant also referred to as a dairy - where raw milk is further processed and prepared for commercial sale of ": null
    },
    {
        "dairy products": "dairy products"
    },
    {
        ". In ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ", farm areas for milk harvesting are also called milking parlours , and are historically known as milking sheds . As in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", sometimes milking sheds are referred to by their type, such as herring bone shed or pit parlour . Parlour design has evolved from simple barns or sheds to large rotary structures in which the workflow is very efficiently handled. In some countries, especially those with small numbers of animals being milked, the farm may perform the functions of a dairy plant, processing their own milk into salable ": null
    },
    {
        "dairy products": "dairy products"
    },
    {
        ", such as ": null
    },
    {
        "butter": "butter"
    },
    {
        ", ": null
    },
    {
        "cheese": "cheese"
    },
    {
        ", or ": null
    },
    {
        "yogurt": "yogurt"
    },
    {
        ". This on-site processing is a traditional method of producing specialist milk products, common in Europe.     In the United States a dairy can also be a place that processes, distributes and sells ": null
    },
    {
        "dairy product": "dairy product"
    },
    {
        "s, or a room, building or establishment where milk is stored and processed into milk products, such as ": null
    },
    {
        "butter": "butter"
    },
    {
        " or ": null
    },
    {
        "cheese": "cheese"
    },
    {
        ". In ": null
    },
    {
        "New Zealand English": "new zealand english"
    },
    {
        " the singular use of the word  dairy  almost exclusively refers to a ": null
    },
    {
        "corner shop": "corner shop"
    },
    {
        ", or ": null
    },
    {
        "superette": "superette"
    },
    {
        ". This usage is historical as such shops were a common place for the public to buy milk products.     As an attributive, the word dairy refers to milk-based products, derivatives and processes, and the animals and workers involved in their production: for example ": null
    },
    {
        "dairy cattle": "dairy cattle"
    },
    {
        ", ": null
    },
    {
        "dairy goat": "dairy goat"
    },
    {
        ". A dairy ": null
    },
    {
        "farm": "farm"
    },
    {
        " produces milk and a dairy ": null
    },
    {
        "factory": "factory"
    },
    {
        " processes it into a variety of dairy products. These establishments constitute the global dairy industry, a component of the ": null
    },
    {
        "food industry": "food industry"
    },
    {
        ".       Milk producing animals have been domesticated for thousands of years. Initially, they were part of the ": null
    },
    {
        "subsistence farming": "subsistence farming"
    },
    {
        " that ": null
    },
    {
        "nomads": "nomads"
    },
    {
        " engaged in. As the community moved about the country, their animals accompanied them. Protecting and feeding the animals were a big part of the ": null
    },
    {
        "symbiotic relationship": "symbiotic relationship"
    },
    {
        " between the animals and the ": null
    },
    {
        "herd": "herd"
    },
    {
        "ers.     In the more recent past, people in ": null
    },
    {
        "agricultural societies": "agriculture"
    },
    {
        " owned dairy animals that they milked for domestic and local consumption, a typical example of a ": null
    },
    {
        "cottage industry": "cottage industry"
    },
    {
        ". The animals might serve multiple purposes . In this case, the animals were normally milked by hand and the herd size was quite small, so that all of the animals could be milked in less than an hour—about 42 per milker. These tasks were performed by a dairymaid  or dairyman. The word dairy harkens back to Middle English dayerie, deyerie, from deye and further back to Old English dæge .     With ": null
    },
    {
        " industrialization": "industrial revolution"
    },
    {
        " and ": null
    },
    {
        "urbanization": "urbanization"
    },
    {
        ", the supply of milk became a commercial industry, with specialized ": null
    },
    {
        "breeds of cattle": "list of breeds of cattle"
    },
    {
        " being developed for dairy, as distinct from ": null
    },
    {
        "beef": "beef"
    },
    {
        " or ": null
    },
    {
        "draught": "working animalsanimals used for their strength"
    },
    {
        " animals. Initially, more people were employed as milkers, but it soon turned to ": null
    },
    {
        " mechanization": "mechanization"
    },
    {
        " with machines designed to do the milking.        Historically, the ": null
    },
    {
        "milking": "milking"
    },
    {
        " and the ": null
    },
    {
        "processing": "food processing"
    },
    {
        " took place close together in space and time: on a ": null
    },
    {
        "dairy farm": "dairy farming"
    },
    {
        ". People milked the animals by hand; on farms where only small numbers are kept, hand-milking may still be practiced. Hand-milking is accomplished by grasping the ": null
    },
    {
        "teat": "teat"
    },
    {
        "s  in the hand and expressing milk either by squeezing the fingers progressively, from the ": null
    },
    {
        "udder": "udder"
    },
    {
        " end to the tip, or by squeezing the teat between thumb and index finger, then moving the hand downward from udder towards the end of the teat. The action of the hand or fingers is designed to close off the milk duct at the udder end and, by the movement of the fingers, close the duct progressively to the tip to express the trapped milk. Each half or quarter of the udder is emptied one milk-duct capacity at a time.     The stripping action is repeated, using both hands for speed. Both methods result in the milk that was trapped in the ": null
    },
    {
        "milk duct": "milk duct"
    },
    {
        " being squirted out the end into a bucket that is supported between the knees of the milker, who usually sits on a low stool.     Traditionally the cow, or cows, would stand in the ": null
    },
    {
        "field": "field"
    },
    {
        " or paddock while being milked. Young stock, ": null
    },
    {
        "heifers": "cattle"
    },
    {
        ", would have to be trained to remain still to be milked. In many countries, the cows were tethered to a post and milked.          While most countries produce their own milk products, the structure of the dairy industry varies in different parts of the world. In major milk-producing countries most milk is distributed through whole sale markets. In Ireland and Australia, for example, farmers co-operatives own many of the large-scale processors, while in the United States many farmers and processors do business through individual contracts. In the United States, the countrys 42 ": null
    },
    {
        "farmers cooperatives": "farmers cooperatives"
    },
    {
        " sold 42% of milk in the U.S. in 42 with five cooperatives accounting for half that. This was down from 42 cooperatives in the 42s.  In developing countries, the past practice of farmers marketing milk in their own neighborhoods is changing rapidly. Notable developments include considerable foreign investment in the dairy industry and a growing role for dairy cooperatives. Output of milk is growing rapidly in such countries and presents a major source of income growth for many farmers. FAO, , FAO, Rome, 42     As in many other branches of the food industry, dairy processing in the major dairy producing countries has become increasingly concentrated, with fewer but larger and more efficient plants operated by fewer workers. This is notably the case in the United States, Europe, Australia and New Zealand. In 42 charges of ": null
    },
    {
        "antitrust": "antitrust"
    },
    {
        " violations have been made against major dairy industry players in the United States, which critics call Big Milk.   by John Burnett. All Things Considered, National Public Radio. 42 August 42 Another round of ": null
    },
    {
        "price fixing": "price fixing"
    },
    {
        " charges was settled in 42      Government intervention in milk markets was common in the 42th century. A limited antitrust exemption was created for U.S. dairy cooperatives by the ": null
    },
    {
        "Capper–Volstead Act": "capper–volstead act"
    },
    {
        " of 42 In the 42s, some U.S. states adopted price controls, and Federal Milk Marketing Orders started under the Agricultural Marketing Agreement Act of 42 and continue in the 42s. The Federal Milk Price Support Program began in 42 The ": null
    },
    {
        "Northeast Dairy Compact": "northeast dairy compact"
    },
    {
        " regulated wholesale milk prices in New England from 42 to 42      Plants producing liquid milk and products with short shelf life, such as yogurts, creams and soft cheeses, tend to be located on the outskirts of urban centres close to consumer markets. Plants manufacturing items with longer shelf life, such as butter, milk powders, cheese and whey powders, tend to be situated in rural areas closer to the milk supply. Most large processing plants tend to specialise in a limited range of products. Exceptionally, however, large plants producing a wide range of products are still common in Eastern Europe, a holdover from the former centralized, supply-driven concept of the market under Communist governments.      As processing plants grow fewer and larger, they tend to acquire bigger, more automated and more efficient equipment. While this technological tendency keeps manufacturing costs lower, the need for long-distance transportation often increases the environmental impact.  , by COWI Consulting Engineers and Planners, United Nations Environment Programme Division of Technology, Industry, and Economics, Denmark Miljøstyrelsen. Published by UNEP/Earthprint, 42 . Text at Agrifood Forum - Publications - Downloads - Sector Guides - Index.     Milk production is irregular, depending on cow biology. Producers must adjust the mix of milk which is sold in liquid form vs. processed foods depending on changing supply and demand.                When it became necessary to milk larger cows, the cows would be brought to a ": null
    },
    {
        "shed": "shed"
    },
    {
        " or ": null
    },
    {
        "barn": "barn"
    },
    {
        " that was set up with stalls  where the cows could be confined their whole life while they were milked. One person could milk more cows this way, as many as 42 for a skilled worker. But having cows standing about in the yard and shed waiting to be milked is not good for the cow, as she needs as much time in the paddock grazing as is possible. It is usual to restrict the twice-daily milking to a maximum of an hour and a half each time. It makes no difference whether one milks 42 or 42 cows, the milking time should not exceed a total of about three hours each day for any cow as they should be in stalls and laying down as long as possible to increase comfort which will in turn aid in milk production. A cow is physically milked for only about 42 minutes a day depending on her milk letdown time and the number of milkings per day.     As ": null
    },
    {
        "herd": "herd"
    },
    {
        " sizes increased there was more need to have efficient milking machines, sheds, milk-storage facilities , bulk-milk transport and shed cleaning capabilities and the means of getting cows from paddock to shed and back.     As herd numbers increased so did the problems of ": null
    },
    {
        "animal health": "animal health"
    },
    {
        ". In ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        " two approaches to this problem have been used. The first was improved ": null
    },
    {
        "veterinary medicine": "veterinary medicine"
    },
    {
        "s that the farmer could use. The other was the creation of veterinary clubs where groups of farmers would employ a ": null
    },
    {
        "veterinarian": "veterinary medicine"
    },
    {
        " full-time and share those services throughout the year. It was in the vets interest to keep the animals healthy and reduce the number of calls from farmers, rather than to ensure that the farmer needed to call for service and pay regularly.     This daily milking routine goes on for about 42 to 42 days per year that the cow stays in milk. Some small herds are milked once a day for about the last 42 days of the production cycle but this is not usual for large herds. If a cow is left unmilked just once she is likely to reduce milk-production almost immediately and the rest of the season may see her dried off and still consuming feed. However, once-a-day milking is now being practised more widely in New Zealand for profit and ": null
    },
    {
        "lifestyle": "lifestyle"
    },
    {
        " reasons. This is effective because the fall in milk yield is at least partially offset by labour and cost savings from milking once per day. This compares to some intensive farm systems in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " that milk three or more times per day due to higher milk yields per cow and lower marginal ": null
    },
    {
        "labor costs": "labor costs"
    },
    {
        ".     Farmers who are contracted to supply liquid milk for human consumption  often have to manage their ": null
    },
    {
        "herd": "herd"
    },
    {
        " so that the contracted number of cows are in milk the year round, or the required minimum milk output is maintained. This is done by mating cows outside their natural mating time so that the period when each cow in the herd is giving maximum production is in rotation throughout the year.     Northern hemisphere farmers who keep cows in barns almost all the year usually manage their herds to give continuous production of milk so that they get paid all year round. In the southern hemisphere the ": null
    },
    {
        "cooperative": "cooperative"
    },
    {
        " dairying systems allow for two months on no productivity because their systems are designed to take advantage of maximum grass and milk production in the spring and because the milk processing plants pay bonuses in the dry season to carry the farmers through the mid-winter break from milking. It also means that cows have a rest from milk production when they are most heavily pregnant. Some year-round milk farms are penalised financially for ": null
    },
    {
        "overproduction": "overproduction"
    },
    {
        " at any time in the year by being unable to sell their overproduction at current prices.     ": null
    },
    {
        "Artificial insemination": "artificial insemination"
    },
    {
        " is common in all high-production herds in order to improve the genetics of the female offspring which will be raised for replacements. AI also reduces the need for keeping potentially dangerous bulls on the farm. Male calves are sold to be raised for beef or veal. A cow will calve or freshen about once a year, until she is culled because of declining production, infertility or other health problems. Then the cow will be sold, most often going to slaughter.                 Dairy plants process the raw milk they receive from farmers so as to extend its marketable life. Two main types of processes are employed: heat treatment to ensure the safety of milk for human consumption and to lengthen its shelf-life, and dehydrating dairy products such as butter, hard cheese and milk powders so that they can be stored.       Today, milk is separated by huge machines in bulk into cream and skim milk. The cream is processed to produce various consumer products, depending on its thickness, its suitability for culinary uses and consumer demand, which differs from place to place and country to country.     Some milk is dried and powdered, some is condensed  mixed with varying amounts of ": null
    },
    {
        "sugar": "sugar"
    },
    {
        " and canned. Most cream from New Zealand and Australian factories is made into ": null
    },
    {
        "butter": "butter"
    },
    {
        ". This is done by ": null
    },
    {
        "churning": "churning"
    },
    {
        " the cream until the fat globules coagulate and form a monolithic mass. This butter mass is washed and, sometimes, salted to improve keeping qualities. The residual ": null
    },
    {
        "buttermilk": "buttermilk"
    },
    {
        " goes on to further processing. The butter is packaged and chilled for storage and sale. At a later stage these packages are broken down into home-consumption sized packs.       The product left after the cream is removed is called skim, or skimmed, milk. To make a consumable liquid a portion of cream is returned to the ": null
    },
    {
        "skim milk": "skim milk"
    },
    {
        " to make  low fat milk for human consumption. By varying the amount of cream returned, producers can make a variety of low-fat milks to suit their local market. Whole milk is also made by adding cream back to the skim to form a standardized product. Other products, such as ": null
    },
    {
        "calcium": "calcium"
    },
    {
        ", ": null
    },
    {
        "vitamin D": "vitamin d"
    },
    {
        ", and flavouring, are also added to appeal to consumers.       ": null
    },
    {
        "Casein": "casein"
    },
    {
        " is the predominant ": null
    },
    {
        "phosphoprotein": "phosphoprotein"
    },
    {
        " found in fresh milk. It has a very wide range of uses from being a filler for human foods, such as in ": null
    },
    {
        "ice cream": "ice cream"
    },
    {
        ", to the manufacture of products such as ": null
    },
    {
        "fabric": "cloth"
    },
    {
        ", ": null
    },
    {
        "adhesive": "adhesive"
    },
    {
        "s, and ": null
    },
    {
        "plastic": "plastic"
    },
    {
        "s.          Cheese is another product made from milk. Whole milk is reacted to form ": null
    },
    {
        "curd": "curd"
    },
    {
        "s that can be compressed, processed and stored to form cheese. In countries where milk is legally allowed to be processed without ": null
    },
    {
        "pasteurization": "pasteurize"
    },
    {
        ", a wide range of cheeses can be made using the bacteria found naturally in the milk. In most other countries, the range of cheeses is smaller and the use of artificial cheese curing is greater. ": null
    },
    {
        "Whey": "whey"
    },
    {
        " is also the byproduct of this process. Some people with ": null
    },
    {
        "lactose intolerance": "lactose intolerance"
    },
    {
        " are surprisingly able to eat certain types of cheese. This is because some traditionally made hard ": null
    },
    {
        "cheese": "cheese"
    },
    {
        "s, and soft ripened cheeses may create less reaction than the equivalent amount of milk because of the processes involved. Fermentation and higher fat content contribute to lesser amounts of lactose. Traditionally made ": null
    },
    {
        "Emmental": "emmental cheese"
    },
    {
        " or ": null
    },
    {
        "Cheddar": "cheddar cheese"
    },
    {
        " might contain 42% of the lactose found in whole milk. In addition, the aging methods of traditional cheeses reduce their lactose content to practically nothing.  Commercial cheeses, however, are often manufactured by processes that do not have the same lactose-reducing properties. Ageing of some cheeses is governed by regulations;  in other cases there is no quantitative indication of degree of ageing and concomitant lactose reduction, and lactose content is not usually indicated on labels.       In earlier times, ": null
    },
    {
        "whey": "whey"
    },
    {
        " or milk serum was considered to be a waste product and it was, mostly, fed to pigs as a convenient means of disposal. Beginning about 42 and mostly since about 42 ": null
    },
    {
        "lactose": "lactose"
    },
    {
        " and many other products, mainly food additives, are made from both casein and cheese whey.       ": null
    },
    {
        "Yogurt": "yogurt"
    },
    {
        " making is a process similar to cheese making, only the process is arrested before the curd becomes very hard.       Milk is also processed by various drying processes into powders. Whole milk, skim milk, buttermilk, and whey products are dried into a powder form and used for human and animal consumption. The main difference between production of powders for human or for animal consumption is in the protection of the process and the product from contamination. Some people drink milk reconstituted from powdered milk, because milk is about 42% water and it is much cheaper to transport the dried product.       ": null
    },
    {
        "Kumis": "kumis"
    },
    {
        " is produced commercially in ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        ". Although it is traditionally made from ": null
    },
    {
        "mare": "horse"
    },
    {
        "s milk, modern industrial variants may use cows milk instead.             Originally, milking and processing took place on the dairy farm itself. Later, cream was separated from the milk by machine on the farm, and transported to a ": null
    },
    {
        "factory": "factory"
    },
    {
        " to be made into butter. The skim milk was fed to ": null
    },
    {
        "pig": "pig"
    },
    {
        "s. This allowed for the high cost of transport , primitive trucks and the poor quality of roads. Only farms close to factories could afford to take whole milk, which was essential for cheesemaking in industrial quantities, to them.     Originally milk was distributed in ": null
    },
    {
        "pails": "pail"
    },
    {
        ", a lidded bucket with a handle. These proved impractical for transport by road or rail, and so the ": null
    },
    {
        "milk churn": "milk churn"
    },
    {
        " was introduced, based on the tall conical shape of the ": null
    },
    {
        "butter churn": "butter churn"
    },
    {
        ". Later large railway containers, such as the ": null
    },
    {
        "British Railway Milk Tank Wagon": "british railway milk tank wagon"
    },
    {
        " were introduced, enabling the transport of larger quantities of milk, and over longer distances.     The development of ": null
    },
    {
        "refrigeration": "refrigeration"
    },
    {
        " and better road transport, in the late 42s, has meant that most farmers milk their cows and only temporarily store the milk in large refrigerated ": null
    },
    {
        "bulk tank": "bulk tank"
    },
    {
        "s, from where it is later transported by truck to central processing facilities.     In many European countries, particularly the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", milk is then delivered direct to customers homes by a ": null
    },
    {
        "milk float": "milk float"
    },
    {
        ".     In the United States, a dairy cow produced about  of milk per year in 42 while the average ": null
    },
    {
        "Holstein cow": "holstein friesian cattle"
    },
    {
        " in 42 produces more than  of milk per year.                Milking machines are used to harvest milk from cows when manual milking becomes inefficient or labour-intensive. One early model was patented in 42  The milking unit is the portion of a milking machine for removing milk from an udder. It is made up of a claw, four teatcups, long milk tube, long pulsation tube, and a pulsator. The claw is an assembly that connects the short pulse tubes and short milk tubes from the teatcups to the long pulse tube and long milk tube. Claws are commonly made of stainless steel or plastic or both. Teatcups are composed of a rigid outer shell that holds a soft inner liner or inflation. Transparent sections in the shell may allow viewing of liner collapse and milk flow. The annular space between the shell and liner is called the pulse chamber.     Milking machines work in a way that is different from hand milking or calf suckling. Continuous vacuum is applied inside the soft liner to massage milk from the teat by creating a pressure difference across the teat canal . Vacuum also helps keep the machine attached to the cow. The vacuum applied to the teat causes congestion of teat tissues . Atmospheric air is admitted into the pulsation chamber about once per second to allow the liner to collapse around the end of teat and relieve congestion in the teat tissue. The ratio of the time that the liner is open and closed is called the pulsation ratio.     The four streams of milk from the teatcups are usually combined in the claw and transported to the milkline, or the collection bucket in a single milk hose. Milk is then transported or with a combination of airflow and mechanical ": null
    },
    {
        "pump": "pump"
    },
    {
        " to a central storage ": null
    },
    {
        "vat": "storage tank"
    },
    {
        " or ": null
    },
    {
        "bulk tank": "bulk tank"
    },
    {
        ". Milk is refrigerated on the farm in most countries either by passing through a ": null
    },
    {
        "heat-exchanger": "heat-exchanger"
    },
    {
        " or in the bulk tank, or both.     The photo to the right shows a bucket milking system with the stainless steel bucket visible on the far side of the cow. The two rigid stainless steel teatcup shells applied to the front two quarters of the udder are visible. The top of the flexible liner is visible at the top of the shells as are the short milk tubes and short pulsation tubes extending from the bottom of the shells to the claw. The bottom of the claw is transparent to allow observation of milk flow. When milking is completed the vacuum to the milking unit is shut off and the teatcups are removed.     Milking machines keep the milk enclosed and safe from external contamination. The interior milk contact surfaces of the machine are kept clean by a manual or automated washing procedures implemented after milking is completed. Milk contact surfaces must comply with regulations requiring food-grade materials  and are easily cleaned.     Most milking machines are powered by ": null
    },
    {
        "electricity": "electrical power industry"
    },
    {
        " but, in case of electrical failure, there can be an alternative means of motive power, often an ": null
    },
    {
        "internal combustion engine": "internal combustion engine"
    },
    {
        ", for the vacuum and milk pumps.              This type of milking facility was the first development, after open-paddock milking, for many farmers. The building was a long, narrow, lean-to shed that was open along one long side. The cows were held in a yard at the open side and when they were about to be milked they were positioned in one of the bails . Usually the cows were restrained in the bail with a breech chain and a rope to restrain the outer back leg. The cow could not move about excessively and the milker could expect not to be kicked or trampled while sitting on a stool and milking into a bucket. When each cow was finished she backed out into the yard again. The UK bail, initially developed by Wiltshire dairy farmer Arthur Hosier, was a six standing mobile shed with steps that the cow mounted, so the herdsman didnt have to bend so low. The milking equipment was much as today, a vacuum from a pump, pulsators, a claw-piece with pipes leading to the four shells and liners that stimulate and suck the milk from the teat. The milk went into churns, via a cooler.     As herd sizes increased a door was set into the front of each bail so that when the milking was done for any cow the milker could, after undoing the leg-rope and with a remote link, open the door and allow her to exit to the pasture. The door was closed, the next cow walked into the bail and was secured. When milking machines were introduced bails were set in pairs so that a cow was being milked in one paired bail while the other could be prepared for milking. When one was finished the machines cups are swapped to the other cow. This is the same as for Swingover Milking Parlours as described below except that the cups are loaded on the udder from the side. As herd numbers increased it was easier to double-up the cup-sets and milk both cows simultaneously than to increase the number of bails. About 42 cows an hour can be milked in a shed with 42 bails by one person. Using the same teat cups for successive cows has the danger of transmitting infection, mastitis, from one cow to another. Some farmers have devised their own ways to disinfect the clusters between cows.       In herringbone milking sheds, or parlours, cows enter, in single file, and line up almost perpendicular to the central aisle of the milking parlour on both sides of a central pit in which the milker works . After washing the udder and teats the cups of the milking machine are applied to the cows, from the rear of their hind legs, on both sides of the working area. Large herringbone sheds can milk up to 42 cows efficiently with two people.       Swingover parlours are the same as herringbone parlours except they have only one set of milking cups to be shared between the two rows of cows, as one side is being milked the cows on the other side are moved out and replaced with unmilked ones. The advantage of this system is that it is less costly to equip, however it operates at slightly better than half-speed and one would not normally try to milk more than about 42 cows with one person.          Rotary milking sheds consist of a turntable with about 42 to 42 individual stalls for cows around the outer edge. A good rotary will be operated with 42–42 stalls by one milkers. The turntable is turned by an electric-motor drive at a rate that one turn is the time for a cow to be milked completely. As an empty stall passes the entrance a cow steps on, facing the center, and rotates with the turntable. The next cow moves into the next vacant stall and so on. The operator, or milker, cleans the teats, attaches the cups and does any other feeding or whatever husbanding operations that are necessary. Cows are milked as the platform rotates. The milker, or an automatic device, removes the milking machine cups and the cow backs out and leaves at an exit just before the entrance. The rotary system is capable of milking very large herds—over a thousand cows.       ": null
    },
    {
        "Automatic milking": "automatic milking"
    },
    {
        " or robotic milking sheds can be seen in ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", New Zealand, the U.S., Canada, and many European countries. Current automatic milking sheds use the voluntary milking method. These allow the cows to voluntarily present themselves for milking at any time of the day or night, although repeat visits may be limited by the farmer through computer software. A ": null
    },
    {
        "robot": "robot"
    },
    {
        " arm is used to clean teats and apply milking equipment, while automated gates direct cow traffic, eliminating the need for the farmer to be present during the process. The entire process is computer controlled.        Farmers soon realised that a milking shed was a good place to feed cows supplementary foods that overcame local dietary deficiencies or added to the cows wellbeing and production. Each bail might have a box into which such feed is delivered as the cow arrives so that she is eating while being milked. A computer can read the eartag of each animal to ration the correct individual supplement. A close alternative is to use out-of-parlour-feeders, stalls that respond to a transponder around the cows neck that is programmed to provide each cow with a supplementary feed, the quantity dependent on her production, stage in lactation, and the benefits of the main ration     The holding yard at the entrance of the shed is important as a means of keeping cows moving into the shed. Most yards have a powered gate that ensures that the cows are kept close to the shed.     ": null
    },
    {
        "Water": "water"
    },
    {
        " is a vital commodity on a dairy farm: cows drink about 42 gallons a day, sheds need water to cool and clean them. Pumps and reservoirs are common at milking facilities. Water can be warmed by heat transfer with milk.       Milk coming from the cow is transported to a nearby storage vessel by the airflow leaking around the cups on the cow or by a special air inlet in the claw. From there it is pumped by a mechanical pump and cooled by a ": null
    },
    {
        "heat exchanger": "heat exchanger"
    },
    {
        ". The milk is then stored in a large vat, or ": null
    },
    {
        "bulk tank": "bulk tank"
    },
    {
        ", which is usually refrigerated until collection for processing.          In countries where cows are grazed outside year-round, there is little waste disposal to deal with. The most concentrated waste is at the milking shed, where the animal waste may be liquefied or left in a more solid form, either to be returned to be used on farm ground as organic fertilizer.      In the associated milk processing factories, most of the waste is washing water that is treated, usually by composting, and spread on farm fields in either liquid or solid form. This is much different from half a century ago, when the main products were butter, cheese and casein, and the rest of the milk had to be disposed of as waste .      In dairy-intensive areas, various methods have been proposed for disposing of large quantities of milk. Large application rates of milk onto land, or disposing in a hole, is problematic as the residue from the decomposing milk will block the soil pores and thereby reduce the water infiltration rate through the soil profile. As recovery of this effect can take time, any land-based application needs to be well managed and considered.  Other waste milk disposal methods commonly employed include solidification and disposal at a solid waste landfill, disposal at a wastewater treatment plant, or discharge into a sanitary sewer.        Dairy products manufactured under unsanitary or unsuitable conditions have an increased chance of containing bacteria. Proper ": null
    },
    {
        "sanitation": "sanitation"
    },
    {
        " practices help to reduce the rate of bacterial contamination, and ": null
    },
    {
        "pasteurization": "pasteurization"
    },
    {
        " greatly decreases the amount of contaminated milk that reaches the consumer. Many countries have required government oversight and regulations regarding dairy production, including requirements for ": null
    },
    {
        "pasteurization": "pasteurization"
    },
    {
        ".   ": null
    },
    {
        "Leptospirosis": "leptospirosis"
    },
    {
        " is an infection that can be transmitted to people who work in dairy production through exposure to urine or to contaminated water or soil.     ": null
    },
    {
        "Cowpox": "cowpox"
    },
    {
        " is a virus that today is rarely found in either cows or humans. It is a historically important disease, as it led to the first vaccination against the now eradicated ": null
    },
    {
        "smallpox": "smallpox"
    },
    {
        ".   ": null
    },
    {
        "Tuberculosis": "tuberculosis"
    },
    {
        " is able to be transmitted from cattle mainly via milk products that are ": null
    },
    {
        "unpasteurised": "pasteurization"
    },
    {
        ". The disease has been eradicated from many countries by testing for the disease and culling suspected animals.   ": null
    },
    {
        "Brucellosis": "brucellosis"
    },
    {
        " is a bacterial disease transmitted to humans by dairy products and direct animal contact. Brucellosis has been eradicated from certain countries by testing for the disease and culling suspected animals.   ": null
    },
    {
        "Listeria": "listeria monocytogenes"
    },
    {
        " is a bacterial disease associated with ": null
    },
    {
        "unpasteurised": "pasteurization"
    },
    {
        " milk, and can affect some cheeses made in traditional ways. Careful observance of the traditional cheesemaking methods achieves reasonable protection for the consumer.   ": null
    },
    {
        "Crohns disease": "crohns disease"
    },
    {
        " has been linked to infection with the bacterium ": null
    },
    {
        "M. paratuberculosis": "mycobacterium avium subspecies paratuberculosis"
    },
    {
        ",      which has been found in pasteurized retail milk in the UK and the USA.  M. paratuberculosis causes a similar disorder, ": null
    },
    {
        "Johnes disease": "johnes disease"
    },
    {
        ", in livestock.       A portion of the population, Iacobbo, K., & Iacobbo, M. . Vegetarians and vegans in America today. Greenwood Publishing Group. including many ": null
    },
    {
        "vegans": "veganism"
    },
    {
        " and ": null
    },
    {
        "Jains": "jain vegetarianism"
    },
    {
        ", object to dairy production as unethical, cruel to animals, and environmentally deleterious. They do not consume dairy products. They state that cattle suffer under conditions employed by the dairy industry. ": null
    },
    {
        "David J. Wolfson": "david j. wolfson"
    },
    {
        " . Beyond the law: Agribusiness and the systemic abuse of animals raised for food or food production. Animal Law, 42 42             In 42 it was found that ": null
    },
    {
        "bovine somatotropin": "bovine somatotropin"
    },
    {
        " would increase the yield of milk. Several pharmaceutical companies developed commercial rBST products and they have been approved for use in the US, Mexico, Brazil, India, Russia, and at least ten others. The World Health Organization, and others have stated that dairy products and meat from BST-treated cows are safe for human consumption. However, based on negative animal welfare effects,  rBST has not been allowed in Canada, Australia, New Zealand, Japan, Israel, or the European Union since 42 - and in the U.S. has lost popularity due to consumer demands for rBST-free cows,   with only about 42% of all cows in America now receiving rBST. ": null
    }
]