[
    {
        "   Damage is a ": null
    },
    {
        "42 novel": "1991 in literature"
    },
    {
        " by ": null
    },
    {
        "Josephine Hart": "josephine hart"
    },
    {
        " about a British ": null
    },
    {
        "politician": "politician"
    },
    {
        " who, in the prime of life, causes his own downfall through an inappropriate relationship. It was adapted into a ": null
    },
    {
        "film of the same title": "damage"
    },
    {
        " by ": null
    },
    {
        "Louis Malle": "louis malle"
    },
    {
        " in 42 as well as into an ": null
    },
    {
        "opera": "opera"
    },
    {
        "  by Greek composer ": null
    },
    {
        "Kharálampos Goyós": "kharálampos goyós"
    },
    {
        " in 42         The ": null
    },
    {
        "first person narrator": "first-person narrative"
    },
    {
        " of the novel is an unnamed medical doctor turned politician  whose promotion from ": null
    },
    {
        "MP": "member of parliament"
    },
    {
        " to cabinet member is imminent. Just then the ": null
    },
    {
        "MP": "member of parliament"
    },
    {
        " is casually introduced to his grown-up sons enigmatic girlfriend Anna and helplessly falls for her. For as long as it lasts, Martyn, his son, has no idea that his father is having an extramarital affair with his girlfriend , and Anna does not seem to mind being a young mans partner and simultaneously his fathers lover and object of desire. The ": null
    },
    {
        "MP": "member of parliament"
    },
    {
        " enjoys a brief period of sexual bliss, meeting Anna in various European cities and having sex with her in unlikely places. Eventually, she buys them a small flat in central ": null
    },
    {
        "London": "london"
    },
    {
        " where they meet on a regular basis.     One day Martyn happens to get hold of that address and, curious, goes there to investigate. He climbs up a flight of stairs to the top floor, opens the unlocked door to the apartment, and is shocked to see his father making love to his fiancée. Dazed and utterly confused, he tumbles backwards, hits the low banister and falls down the stairwell. The ": null
    },
    {
        "MP": "member of parliament"
    },
    {
        " runs down the stairs completely naked, finding Martyn dead, sprawled out on the ground floor. He kneels on the floor and clutches Martyns body to him until the police arrive. In the final scene, the ": null
    },
    {
        "MP": "member of parliament"
    },
    {
        ", stripped of his political office and living abroad as a recluse, sits in his solitary room staring at oversized photographs of Anna and Martyn on the wall.                      ": null
    }
]