[
    {
        "           James Danforth Quayle is an American politician and lawyer who served as the 44th ": null
    },
    {
        "vice president of the United States": "Vice President Of The United States"
    },
    {
        " from 1989 to 1993. Quayle was also a ": null
    },
    {
        "U.S. representative": "United States House Of Representatives"
    },
    {
        " from 1977 to 1981 and a ": null
    },
    {
        "U.S. senator": "United States Senate"
    },
    {
        " from 1981 to 1989 from the state of ": null
    },
    {
        "Indiana": "Indiana"
    },
    {
        ".     A native of ": null
    },
    {
        "Indianapolis": "Indianapolis"
    },
    {
        ", Indiana, Quayle spent most of his childhood in ": null
    },
    {
        "Paradise Valley": "Paradise Valley, Arizona"
    },
    {
        ", a suburb of ": null
    },
    {
        "Phoenix, Arizona": "Phoenix, Arizona"
    },
    {
        ". He married ": null
    },
    {
        "Marilyn Tucker": "Marilyn Quayle"
    },
    {
        " in 1972 and obtained his ": null
    },
    {
        "J.D.": "Juris Doctor"
    },
    {
        " degree from the ": null
    },
    {
        "Indiana University Robert H. McKinney School of Law": "Indiana University Robert H. Mckinney School Of Law"
    },
    {
        " in 1974. Quayle practiced law in ": null
    },
    {
        "Huntington, Indiana": "Huntington, Indiana"
    },
    {
        " with his wife before his election to the ": null
    },
    {
        "United States House of Representatives": "United States House Of Representatives"
    },
    {
        " in 1976. In 1980 Quayle was elected to the U.S. Senate.     In 1988, Vice President and ": null
    },
    {
        "Republican": "Republican Party"
    },
    {
        " presidential nominee ": null
    },
    {
        "George H. W. Bush": "George H. W. Bush"
    },
    {
        " chose Quayle as his running mate. Quayles vice presidential debate against Democratic candidate ": null
    },
    {
        "Lloyd Bentsen": "Lloyd Bentsen"
    },
    {
        " was notable for the ": null
    },
    {
        "Senator, youre no Jack Kennedy": "Senator, Youre No Jack Kennedy"
    },
    {
        " incident. The Bush/Quayle ticket won the ": null
    },
    {
        "1988 election": "1988 United States Presidential Election"
    },
    {
        " over the Democratic ticket of ": null
    },
    {
        "Michael Dukakis": "Michael Dukakis"
    },
    {
        " and Bentsen, and Quayle became Vice President in January 1989. As Vice President, he made official visits to 47 countries and was appointed chairman of the ": null
    },
    {
        "National Space Council": "National Space Council"
    },
    {
        ". He secured re-nomination for Vice President in ": null
    },
    {
        "1992": "1992 United States Presidential Election"
    },
    {
        ", but Democrat ": null
    },
    {
        "Bill Clinton": "Bill Clinton"
    },
    {
        " and his running mate, ": null
    },
    {
        "Al Gore": "Al Gore"
    },
    {
        ", defeated the Bush/Quayle ticket.     In 1994 Quayle published his memoir, Standing Firm. He declined to run for President in 1996 because he was suffering from ": null
    },
    {
        "phlebitis": "Phlebitis"
    },
    {
        ". Quayle sought the Republican presidential nomination in 2000 but later withdrew from the campaign and supported the eventual winner, ": null
    },
    {
        "George W. Bush": "George W. Bush"
    },
    {
        ". He joined ": null
    },
    {
        "Cerberus Capital Management": "Cerberus Capital Management"
    },
    {
        ", a private equity firm, in 1999.       Quayle was born in ": null
    },
    {
        "Indianapolis": "Indianapolis"
    },
    {
        ", ": null
    },
    {
        "Indiana": "Indiana"
    },
    {
        ", to Martha Corinne and ": null
    },
    {
        "James Cline Quayle": "James C. Quayle"
    },
    {
        ".  He has sometimes  been incorrectly referred to as James Danforth Quayle III. In his memoir he points out that his birth name was simply James Danforth Quayle. The name Quayle originates from the ": null
    },
    {
        "Isle of Man": "Isle Of Man"
    },
    {
        ", where his great-grandfather was born.      His maternal grandfather, ": null
    },
    {
        "Eugene C. Pulliam": "Eugene C. Pulliam"
    },
    {
        ", was a wealthy and influential publishing magnate who founded Central Newspapers, Inc., and owned over a dozen major newspapers, such as  The Arizona Republic  and  The Indianapolis Star . James C. Quayle moved his family to ": null
    },
    {
        "Arizona": "Arizona"
    },
    {
        " in 1955 to run a branch of the familys publishing empire.     After spending much of his youth in Arizona,  Retrieved 10 December 2016. Quayle returned to his native Indiana and graduated from Huntington North High School in ": null
    },
    {
        "Huntington": "Huntington, Indiana"
    },
    {
        " in 1965. He then matriculated at ": null
    },
    {
        "DePauw University": "Depauw University"
    },
    {
        ", where he received his ": null
    },
    {
        "B.A.": "Bachelor Of Arts"
    },
    {
        " degree in ": null
    },
    {
        "political science": "Political Science"
    },
    {
        " in 1969,  was a 3-year letterman for the University Golf Team and a member of the fraternity ": null
    },
    {
        "Delta Kappa Epsilon": "Delta Kappa Epsilon"
    },
    {
        " . After graduating, Quayle joined the ": null
    },
    {
        "Indiana National Guard": "Indiana National Guard"
    },
    {
        " and served from 1969 to 1975, reaching the rank of ": null
    },
    {
        "sergeant": "Sergeantunited States"
    },
    {
        ". While serving in the Guard, he earned a ": null
    },
    {
        "Juris Doctor": "Juris Doctor"
    },
    {
        " degree in 1974 at the ": null
    },
    {
        "Indiana University Robert H. McKinney School of Law": "Indiana University Robert H. Mckinney School Of Law"
    },
    {
        ". He met his future wife, ": null
    },
    {
        "Marilyn": "Marilyn Quayle"
    },
    {
        ", who was taking night classes at the same law school at the time. Alessandra Stanley, ,  Time Magazine , January 23, 1989. Accessed September 28, 2014.        Quayle became an investigator for the Consumer Protection Division of the Office of the ": null
    },
    {
        "Indiana Attorney General": "Indiana Attorney General"
    },
    {
        " in July 1971. Later that year he became an administrative assistant to Governor ": null
    },
    {
        "Edgar Whitcomb": "Edgar Whitcomb"
    },
    {
        ". From 1973 to 1974 he was the Director of the Inheritance Tax Division of the Indiana Department of Revenue. Upon graduating from law school, Quayle worked as associate publisher of his familys newspaper, the  Huntington Herald-Press .        In 1976 Quayle was elected to the ": null
    },
    {
        "House of Representatives": "United States House Of Representatives"
    },
    {
        " from ": null
    },
    {
        "Indianas 4th congressional district": "Indianas 4Th Congressional District"
    },
    {
        ", defeating eight-term ": null
    },
    {
        "incumbent": "Incumbent"
    },
    {
        " Democrat": "Democratic Party"
    },
    {
        " J. Edward Roush": "J. Edward Roush"
    },
    {
        " by a 55%-to-45% margin. He was reelected in 1978 by the biggest margin achieved to date in that district.       In ": null
    },
    {
        "1980": "1980 United States Senate Elections"
    },
    {
        ", at age 33, Quayle became the youngest person ever elected to the ": null
    },
    {
        "Senate": "United States Senate"
    },
    {
        " from the state of Indiana, defeating three-term incumbent Democrat ": null
    },
    {
        "Birch Bayh": "Birch Bayh"
    },
    {
        " with 54% of the vote. Making Indiana political history again, Quayle was reelected to the Senate in ": null
    },
    {
        "1986": "1986 United States Senate Elections"
    },
    {
        " with the largest margin ever achieved to that date by a candidate in a statewide Indiana race, taking 61% of the vote against his Democratic opponent, ": null
    },
    {
        "Jill Long": "Jill Long Thompson"
    },
    {
        ".     In November 1978 Congressman ": null
    },
    {
        "Leo Ryan": "Leo Ryan"
    },
    {
        " of California invited Quayle to accompany him on a delegation to investigate unsafe conditions at the ": null
    },
    {
        "Jonestown": "Jonestown"
    },
    {
        " settlement in ": null
    },
    {
        "Guyana": "Guyana"
    },
    {
        ", but Quayle was unable to participate. The decision likely saved Quayles life, because Ryan and his entourage were subsequently murdered at the airstrip in Jonestown as the party tried to escape the massacre.      In 1986 Quayle was criticized for championing the cause of ": null
    },
    {
        "Daniel Anthony Manion": "Daniel Anthony Manion"
    },
    {
        ", a candidate for a federal appellate judgeship, who was in law school one year above Quayle. The ": null
    },
    {
        "American Bar Association": "American Bar Association"
    },
    {
        " had evaluated Manion as qualified/unqualified , its lower passing grade.  Manion was nominated for the ": null
    },
    {
        "Seventh Circuit": "United States Court Of Appeals For The Seventh Circuit"
    },
    {
        " of the ": null
    },
    {
        "U.S. Court of Appeals": "United States Court Of Appeals"
    },
    {
        " by President ": null
    },
    {
        "Ronald Reagan": "Ronald Reagan"
    },
    {
        " on February 21, 1986, and confirmed by the Senate on June 26, 1986.          On August 16, 1988, at the Republican convention in New Orleans, Louisiana, George H. W. Bush chose Quayle to be his running mate in the ": null
    },
    {
        "1988 United States presidential election": "1988 United States Presidential Election"
    },
    {
        ". The choice immediately became controversial. Outgoing President Ronald Reagan praised Quayle for his energy and enthusiasm .  Press coverage of the convention was dominated by questions about the three Quayle problems . The questions involved his military service, a golf trip to Florida with Paula Parkinson, and whether he had enough experience to be vice president. Quayle seemed at times rattled and at other times uncertain or evasive as he tried to handle the questions. Delegates to the convention generally blamed television and newspapers for the focus on Quayles problems, but Bushs staff said they thought Quayle had mishandled the questions about his military record, leaving questions dangling.   Ander Plattner et al., Quayle Under Glass ,  U.S. News & World Report , August 29, 1988, p. 32. Although Bush was trailing by up to 15 points in public opinion polls taken before the convention, in August the Bush/Quayle ticket took the lead,   Gallup. which it did not relinquish for the rest of the campaign.     In the October 1988 vice-presidential debate, Quayle debated Democratic candidate ": null
    },
    {
        "Lloyd Bentsen": "Lloyd Bentsen"
    },
    {
        ". When the subject of the debate turned to Quayles relatively limited experience in public life, he compared the length of his congressional service with that of late President ": null
    },
    {
        "John F. Kennedy": "John F. Kennedy"
    },
    {
        " , as Kennedy had less experience than his rivals during the 1960 presidential nomination. It was a factual comparison, although Quayles advisers cautioned beforehand that it could be used against him. Bentsens response— ": null
    },
    {
        "Senator, youre no Jack Kennedy": "Senator, Youre No Jack Kennedy"
    },
    {
        " —subsequently became a part of the political lexicon. During the debate, Quayles strategy was to criticize Dukakis as too ": null
    },
    {
        "liberal": "Liberalism"
    },
    {
        ".  PBS. 2 December 1999. Retrieved 10 December 2016.           The Bush/Quayle ticket won the ": null
    },
    {
        "November election": "1988 United States Presidential Election"
    },
    {
        " by a 53–46 percent margin, sweeping 40 states and capturing 426 ": null
    },
    {
        "electoral votes": "Electoral College"
    },
    {
        ". Quayle did not cast ": null
    },
    {
        "any tie-breaking votes": "List Of Tie-Breaking Votes Cast By Vice Presidents Of The United States"
    },
    {
        " in his role as ": null
    },
    {
        "President of the Senate": "President Of The Senate"
    },
    {
        ", becoming only the second vice-president  not to do so while serving a complete term.       During his vice presidency, Quayle made official trips to 47 countries. Bush named Quayle head of the ": null
    },
    {
        "Council on Competitiveness": "U.S. Council On Competitiveness"
    },
    {
        " and the first chairman of the ": null
    },
    {
        "National Space Council": "National Space Council"
    },
    {
        ". As head of the NSC he called for greater efforts to protect Earth against the danger of potential ": null
    },
    {
        "asteroid": "Asteroid"
    },
    {
        " impacts. ,  Seattle Times , May 16, 1990.        After a briefing by Lt. General ": null
    },
    {
        "Daniel O. Graham": "Daniel O. Graham"
    },
    {
        ", , Max Hunter, and ": null
    },
    {
        "Jerry Pournelle": "Jerry Pournelle"
    },
    {
        ", Quayle sponsored the development of an experimental Single Stage to Orbit X-Program, which resulted in the building of the DC/X which was flown and tested at White Sands.           Quayle has since described the vice presidency as an awkward office. Youre president of the Senate. Youre not even officially part of the executive branch—youre part of the legislative branch. Youre paid by the Senate, not by the executive branch. And its the presidents agenda. Its not your agenda. Youre going to disagree from time to time, but you salute and carry out the orders the best you can .  Indianapolis Monthly. 4 October 2016. Retrieved 10 December 2016.     Murphy Brown Reflections on Urban America  to the ": null
    },
    {
        "Commonwealth Club of California": "Commonwealth Club Of California"
    },
    {
        " on the subject of the ": null
    },
    {
        "Los Angeles riots": "1992 Los Angeles Riots"
    },
    {
        ".  In the speech he blamed the violence on a decay of moral values and family structure in American society. In an aside, he cited the single mother title character in the television program  Murphy Brown  as an example of how popular culture contributes to this poverty of values , saying, It doesnt help matters when ": null
    },
    {
        "prime-time": "Prime Time"
    },
    {
        " TV has Murphy Brown—a character who supposedly epitomizes todays intelligent, highly paid, professional woman—mocking the importance of fathers, by bearing a child alone, and calling it just another lifestyle choice.      The ": null
    },
    {
        "Murphy Brown speech": "Murphy Brownmurphy Becomes A Single Mother"
    },
    {
        " became one of the most memorable incidents of the 1992 campaign. Long after the outcry had ended, the comment continued to have an effect on U.S. politics. ": null
    },
    {
        "Stephanie Coontz": "Stephanie Coontz"
    },
    {
        ", a professor of family history and the author of several books and essays about the history of ": null
    },
    {
        "marriage": "Marriage"
    },
    {
        ", says that this brief remark by Quayle about Murphy Brown kicked off more than a decade of outcries against the collapse of the family.  In 2002, ": null
    },
    {
        "Candice Bergen": "Candice Bergen"
    },
    {
        ", the actress who played Brown, said I never have really said much about the whole episode, which was endless, but his speech was a perfectly intelligent speech about fathers not being dispensable and nobody agreed with that more than I did. Others interpreted it differently; singer ": null
    },
    {
        "Tanya Tucker": "Tanya Tucker"
    },
    {
        " was widely quoted as saying Who the hell is Dan Quayle to come after single mothers?        Throughout his time as vice president, Quayle was widely ridiculed in the media and many in the general public, both in the U.S. and overseas, as an intellectual lightweight and an incompetent individual.  Contributing greatly to the perception of Quayles incompetence was his tendency to make public statements that were either impossible , self-contradictory , self-contradictory and confused , or just confused .     Shortly after Bush announced the ": null
    },
    {
        "Space Exploration Initiative": "Space Exploration Initiative"
    },
    {
        ", which included a ": null
    },
    {
        "manned landing": "Human Mission To Mars"
    },
    {
        " on ": null
    },
    {
        "Mars": "Mars"
    },
    {
        ", Quayle was asked his thoughts on sending humans to Mars. In his response, he made a series of scientifically incorrect statements: Mars is essentially in the same ": null
    },
    {
        "orbit": "Solar Systemstructure And Composition"
    },
    {
        " ...Mars is somewhat the same ": null
    },
    {
        "distance from the Sun": "Astronomical Unitexamples"
    },
    {
        ", which is very important. We have seen pictures where there are ": null
    },
    {
        "canals": "Martian Canal"
    },
    {
        ", we believe, and ": null
    },
    {
        "water": "Water On Mars"
    },
    {
        ". If there is water, that means there is ": null
    },
    {
        "oxygen": "Electrolysis Of Water"
    },
    {
        ". If oxygen, that means we can breathe.      On June 15, 1992, Quayle altered 12-year-old student William Figueroas correct spelling of potato to potatoe at the Muñoz Rivera Elementary School ": null
    },
    {
        "spelling bee": "Spelling Bee"
    },
    {
        " in ": null
    },
    {
        "Trenton, New Jersey": "Trenton, New Jersey"
    },
    {
        ".   He was the subject of widespread ridicule for his error. According to The New York Times  and Quayles memoirs, he was relying on cards provided by the school, which Quayle says included the misspelling. Quayle said he was uncomfortable with the version he gave, but did so because he decided to trust the schools incorrect written materials instead of his own judgment.       In the ": null
    },
    {
        "1992 election": "1992 United States Presidential Election"
    },
    {
        ", Bush and Quayle were challenged in their bid for reelection by the Democratic ticket of ": null
    },
    {
        "Arkansas Governor": "List Of Governors Of Arkansas"
    },
    {
        " Bill Clinton": "Bill Clinton"
    },
    {
        " and ": null
    },
    {
        "Tennessee": "Tennessee"
    },
    {
        " Senator": "United States Senate"
    },
    {
        " Al Gore": "Al Gore"
    },
    {
        " and the independent ticket of Texas businessman ": null
    },
    {
        "Ross Perot": "Ross Perot"
    },
    {
        " and retired Vice Admiral ": null
    },
    {
        "James Stockdale": "James Stockdale"
    },
    {
        ".     As Bush lagged in the polls in the weeks preceding the August ": null
    },
    {
        "1992 Republican National Convention": "1992 Republican National Convention"
    },
    {
        ", some Republican strategists  viewed Quayle as a liability to the ticket and pushed for his replacement.  Quayle ultimately survived the challenge and secured renomination.  Time , , October 19, 1992. Retrieved August 29, 2008.     During the 1992 presidential campaign, Quayle told the news media that he believed homosexuality was a choice, and the wrong choice.      Quayle faced off against Gore and Stockdale in the vice presidential ": null
    },
    {
        "debate": "Debate"
    },
    {
        " on October 13, 1992.  He attempted to avoid the one-sided outcome of his debate with Bentsen four years earlier by staying on the offensive.  Quayle criticized Gores book  Earth in the Balance  with specific page references, though his claims were subsequently criticized by the liberal group ": null
    },
    {
        "FAIR": "Fairness And Accuracy In Reporting"
    },
    {
        " for inaccuracy.  In Quayles closing argument, he sharply asked voters, Do you really believe Bill Clinton will tell the truth? and Do you trust Bill Clinton to be your president? Gore and Stockdale talked more about the policies and philosophies they espoused.  Republican loyalists were largely relieved and pleased with Quayles performance, and his camp attempted to portray it as an upset triumph against a veteran debater, but post-debate polls were mixed on whether Gore or Quayle had won. Columbia Journalism Review, September/October 1993  It ultimately proved to be a minor factor in the election, which Bush and Quayle subsequently lost.                     Quayle authored a 1994 memoir, Standing Firm, which became a bestseller. His second book, The American Family: Discovering the Values That Make Us Strong, was published in 1996 and a third book, Worth Fighting For, was published in 1999.     Quayle considered but decided against running for ": null
    },
    {
        "Governor of Indiana": "Governor Of Indiana"
    },
    {
        " in 1996. He decided against running for the ": null
    },
    {
        "1996 Republican presidential nomination": "1996 Republican Party Presidential Primaries"
    },
    {
        ", citing health problems related to ": null
    },
    {
        "phlebitis": "Phlebitis"
    },
    {
        ".  Quayle moved to Arizona in 1996.      Quayle announced, during an appearance on  Larry King Live , his intention to run for president in 2000.  In April 1999, Quayle officially announced his candidacy for the ": null
    },
    {
        "2000 Republican presidential nomination": "2000 Republican Party Presidential Primaries"
    },
    {
        ", attacking front-runner ": null
    },
    {
        "George W. Bush": "George W. Bush"
    },
    {
        " by saying we do not want another candidate who needs on-the-job training . In the first contest among the Republican candidates, the ": null
    },
    {
        "Ames Straw Poll": "Iowa Straw Poll"
    },
    {
        " of August 1999, he finished eighth. He withdrew from the race the following month and supported Bush.   Quayle, then working as an ": null
    },
    {
        "investment banker": "Investment Banking"
    },
    {
        " in Phoenix, was mentioned as a candidate for ": null
    },
    {
        "Governor of Arizona": "List Of Governors Of Arizona"
    },
    {
        " prior to the ": null
    },
    {
        "2002 election": "2002 Arizona Gubernatorial Election"
    },
    {
        ",  but eventually declined to run.     In a February 2010 interview with ": null
    },
    {
        "Megyn Kelly": "Megyn Kelly"
    },
    {
        " of ": null
    },
    {
        "Fox News": "Fox News"
    },
    {
        ", Quayle announced that his son ": null
    },
    {
        "Ben": "Ben Quayle"
    },
    {
        " would be a candidate for the U.S. Congress, running for a seat representing ": null
    },
    {
        "Arizonas 3rd congressional district": "Arizonas 3Rd Congressional District"
    },
    {
        ".  Ben won the election. In his first bid for reelection, due to redistricting, he faced off against fellow Republican Congressman ": null
    },
    {
        "David Schweikert": "David Schweikert"
    },
    {
        " in a ": null
    },
    {
        "primary": "Primary Election"
    },
    {
        " and narrowly lost.     On January 31, 2011, Quayle wrote a letter to President ": null
    },
    {
        "Barack Obama": "Barack Obama"
    },
    {
        " urging him to commute ": null
    },
    {
        "Jonathan Pollards": "Jonathan Pollard"
    },
    {
        "sentence. ,  Jweekly , February 10, 2011     In December 2011 Quayle endorsed ": null
    },
    {
        "Mitt Romney": "Mitt Romney"
    },
    {
        " for the Republican presidential nomination.      For the ": null
    },
    {
        "United States presidential election in 2016": "2016 United States Presidential Election"
    },
    {
        " Quayle endorsed ": null
    },
    {
        "Jeb Bush": "Jeb Bush Presidential Campaign, 2016"
    },
    {
        ".  After Bush failed to win the nomination, Quayle ultimately endorsed ": null
    },
    {
        "Donald Trump": "Donald Trump 2016 Presidential Campaign"
    },
    {
        "; he was later seen visiting with Trump at ": null
    },
    {
        "Trump Tower": "Trump Tower"
    },
    {
        " in ": null
    },
    {
        "Manhattan": "Manhattan"
    },
    {
        " prior to Trumps inauguration.      ": null
    },
    {
        "The Dan Quayle Center and Museum": "Quayle Vice Presidential Learning Center"
    },
    {
        ", in ": null
    },
    {
        "Huntington, Indiana": "Huntington, Indiana"
    },
    {
        ", features information on Quayle and on all U.S. Vice Presidents.     Quayle is an Honorary Trustee Emeritus of the ": null
    },
    {
        "Hudson Institute": "Hudson Institute"
    },
    {
        " and is president of Quayle and Associates. He has also been a member of the Board of Directors of Heckmann Corporation, a water-sector company, since the companys inception and serves as Chairman of the companys Compensation and Nominating & Governance Committees. Quayle is a director of ": null
    },
    {
        "Aozora Bank": "Aozora Bank"
    },
    {
        ", based in Tokyo, Japan.  He has also been on the board of directors of other companies, including ": null
    },
    {
        "K2 Sports": "K2 Sports"
    },
    {
        ", ": null
    },
    {
        "AmTran": "Amtran"
    },
    {
        " Inc., Central Newspapers Inc.,  BTC Inc.  and Carvana Co.        In 1999 Quayle joined ": null
    },
    {
        "Cerberus Capital Management": "Cerberus Capital Management"
    },
    {
        ", a multibillion-dollar ": null
    },
    {
        "private-equity": "Private Equity"
    },
    {
        " firm, where he serves as chairman of the companys Global Investments division.  As chairman of the international advisory board of Cerberus Capital Management, he recruited former ": null
    },
    {
        "Canadian prime minister": "Prime Minister Of Canada"
    },
    {
        " Brian Mulroney": "Brian Mulroney"
    },
    {
        ", who would have been installed as chairman if Cerberus had successfully acquired ": null
    },
    {
        "Air Canada": "Air Canada"
    },
    {
        ".      In early 2014, Quayle traveled to Belfast, Northern Ireland, in an attempt to speed approval for a deal in which Cerberus acquired nearly £1.3 billion in Northern Ireland loans from the Republic of Irelands ": null
    },
    {
        "National Asset Management Agency": "National Asset Management Agency"
    },
    {
        ". The Irish government is investigating the deal, and the ": null
    },
    {
        "US Securities and Exchange Commission": "U.S. Securities And Exchange Commission"
    },
    {
        ", the ": null
    },
    {
        "Federal Bureau of Investigation": "Federal Bureau Of Investigation"
    },
    {
        ", and the ": null
    },
    {
        "United States Attorney for the Southern District of New York": "United States Attorney For The Southern District Of New York"
    },
    {
        " are investigating Quayles involvement as a potentially very serious misuse of the vice presidents office.  As of December 2018, Quayle serves as Chairman of Global Investments at Cerberus.           Quayle lives with his wife, ": null
    },
    {
        "Marilyn Quayle": "Marilyn Quayle"
    },
    {
        ", in ": null
    },
    {
        "Paradise Valley, Arizona": "Paradise Valley, Arizona"
    },
    {
        ". They married in November 1972  and have three children: Tucker, ": null
    },
    {
        "Benjamin": "Ben Quayle"
    },
    {
        ", and Corinne.  Benjamin Quayle served in the U.S. House of Representatives from 2011 to 2013,  representing Arizonas 3rd congressional district.         Standing Firm: A Vice-Presidential Memoir, ": null
    },
    {
        "HarperCollins": "Harpercollins"
    },
    {
        ", May 1994. hardcover, ; mass market paperback, May 1995; ; Limited edition, 1994,  The American Family: Discovering the Values That Make Us Strong , Harpercollins, April 1996,  ,    Worth Fighting For, W Publishing Group, July 1999, ": null
    }
]