[
    {
        "      Daniel Jones was a ": null
    },
    {
        "London": "london"
    },
    {
        "-born ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " phonetician": "phonetics"
    },
    {
        " who studied under ": null
    },
    {
        "Paul Passy": "paul passy"
    },
    {
        ", professor of phonetics at the École des Hautes Études at the ": null
    },
    {
        "Sorbonne": "university of paris"
    },
    {
        " . He was head of the Department of Phonetics at ": null
    },
    {
        "University College, London": "university college, london"
    },
    {
        ".       In 1900, Jones studied briefly at William Tillys Marburg Language Institute in ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", where he was first introduced to phonetics. In 1903, he received his BA degree in mathematics at ": null
    },
    {
        "Cambridge": "university of cambridge"
    },
    {
        ", converted by payment to ": null
    },
    {
        "MA": "master of arts"
    },
    {
        " in 1907. From 1905 to 1906, he studied in ": null
    },
    {
        "Paris": "paris"
    },
    {
        " under ": null
    },
    {
        "Paul Passy": "paul passy"
    },
    {
        ", who was one of the founders of the ": null
    },
    {
        "International Phonetic Association": "international phonetic association"
    },
    {
        ", and in 1911, he married Passys niece Cyrille Motte. He briefly took private lessons from the British phonetician ": null
    },
    {
        "Henry Sweet": "henry sweet"
    },
    {
        ".     In 1907, he became a part-time lecturer at ": null
    },
    {
        "University College London": "university college london"
    },
    {
        " and was afterwards appointed to a full-time position. In 1912, he became the head of the Department of Phonetics and was appointed to a chair in 1921, a post he held until his retirement in 1949. From 1906 onwards, Jones was an active member of the International Phonetic Association, and was Assistant Secretary from 1907 to 1927, Secretary from 1927 to 1949, and President from 1950 to 1967.     In 1909, Jones wrote the short Pronunciation of English, a book he later radically revised. The resulting work, An Outline of English Phonetics, followed in 1918 and is the first truly comprehensive description of British ": null
    },
    {
        "Received Pronunciation": "received pronunciation"
    },
    {
        ", and the first such description of the standard pronunciation of any language.     The year 1917 was a landmark for Jones in many ways. He became the first linguist in the western world to use the term ": null
    },
    {
        "phoneme": "phoneme"
    },
    {
        " in its current sense, employing the word in his article The phonetic structure of the Sechuana Language . Jones, 1917b Jones had made an earlier notable attempt at a pronunciation dictionary Michaelis and Jones, 1913 but it was now that he produced the first edition of his famous  English Pronouncing Dictionary , Jones 1917a a work which in revised form is still in print. Daniel Jones, , Product Information. It was here that the ": null
    },
    {
        "cardinal vowel": "cardinal vowel"
    },
    {
        " diagram made a first appearance. p. ii     The problem of the phonetic description of vowels is of long standing, going back to the era of the ancient Indian linguists. Three nineteenth-century British phoneticians worked on this topic. ": null
    },
    {
        "Alexander Melville Bell": "alexander melville bell"
    },
    {
        " devised ": null
    },
    {
        "an ingenious iconic phonetic alphabet": "visible speech"
    },
    {
        " which included an elaborate system for vowels. Alexander Ellis had also suggested vowel symbols for his phonetic alphabets. Henry Sweet did much work on the systematic description of vowels, producing an elaborate system of vowel description involving a multitude of symbols. Jones however was the one who is generally credited with having gone much of the way towards a practical solution through his scheme of Cardinal Vowels, a relatively simple system of reference vowels which for many years has been taught systematically to students within the British tradition. Much of the inspiration for this scheme can be found in the earlier publications of Paul Passy.        In the original form of the Cardinal Vowels, Jones employed a dual-parameter system of description based on the supposed height of the tongue arch together with the shape of the lips. This he reduced to a simple ": null
    },
    {
        "quadrilateral diagram": "vowel quadrilateral"
    },
    {
        " which could be used to help visualize how vowels are articulated. Tongue height is represented on the vertical axis and front vs. back on the horizontal axis indicates the portion of the tongue raised on the horizontal axis. Lip-rounding is also built into the system, so that front vowels have spread or neutral lip postures, but the back vowels have more marked lip-rounding as vowel height increases. Jones thus arrived at a set of eight primary Cardinal Vowels , and recorded these on gramophone disc for HMV in 1917.     Later modifications to his theory allowed for an additional set of eight secondary Cardinal Vowels with reverse lip shapes, permitting the representation of eight secondary cardinal vowels . Eventually Jones also devised symbols for central vowels and positioned these on the vowel diagram. He made two further disc recordings for Linguaphone in 1943 and 1956.     With the passing years, the accuracy of many of Joness statements on vowels has come increasingly under question, and most linguists now consider that the vowel quadrilateral must be viewed as a way of representing auditory space in visual form, rather than the tightly defined articulatory scheme envisaged by Jones. Nevertheless, the International Phonetic Association still uses a version of Joness model, and includes a Jones-type vowel diagram on its influential International Phonetic Alphabet leaflet contained in the Handbook of the International Association . Many phoneticians resort to it constantly as a quick and convenient form of reference.     Although Jones is especially remembered for his work on the phonetics and phonology of English, he ranged far more widely. He produced phonetic/phonolological treatments which were masterly for their time on the sound systems of Cantonese, ": null
    },
    {
        "Tswana": "tswana language"
    },
    {
        " , Sinhalese, and Russian. He was the first phonetician to produce, in his Sechuana Reader , a competent description of an African tone language, including the concept of ": null
    },
    {
        "downstep": "downstep"
    },
    {
        ". Jones helped develop new ": null
    },
    {
        "alphabets": "alphabet"
    },
    {
        "for African languages, and suggested systems of romanisation for Indian languages and Japanese. He also busied himself with support for revised spelling for English through the ": null
    },
    {
        "Simplified Spelling Society": "simplified spelling society"
    },
    {
        ".     Apart from his own vast array of published work, Jones will be remembered for having acted as mentor to numerous scholars who later went on to become famous linguists in their own right. These included such names as ": null
    },
    {
        "Lilias Armstrong": "lilias armstrong"
    },
    {
        ", ": null
    },
    {
        "Harold Palmer": "harold e. palmer"
    },
    {
        ", ": null
    },
    {
        "Ida Ward": "ida ward"
    },
    {
        ", Hélène Coustenoble, ": null
    },
    {
        "Arthur Lloyd James": "arthur lloyd james"
    },
    {
        ", Dennis Fry, ": null
    },
    {
        "A. C. Gimson": "a. c. gimson"
    },
    {
        ", Gordon Arnold, J.D. OConnor, ": null
    },
    {
        "Clive Sansom": "clive sansom"
    },
    {
        ", and many more. For several decades his department at University College was pivotal in the development of phonetics and in making its findings known to the wider world. Collins and Mees speculate that it is Jones, not as is often thought ": null
    },
    {
        "Henry Sweet": "henry sweet"
    },
    {
        ", who provided ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        " with the basis for his fictional character Professor Henry Higgins in  Pygmalion . Collins and Mees 1998: 97–103     After retirement, Jones worked assiduously at his publications almost up to the end of his long life. He died at his home in ": null
    },
    {
        "Gerrards Cross": "gerrards cross"
    },
    {
        " on 4 December 1967.       ": null
    }
]