[
    {
        "         Dark Angel is an American ": null
    },
    {
        "cyberpunk": "cyberpunk"
    },
    {
        " television series that premiered on the ": null
    },
    {
        "Fox": "fox broadcasting company"
    },
    {
        " network on October 42 42 Created by ": null
    },
    {
        "James Cameron": "james cameron"
    },
    {
        " and ": null
    },
    {
        "Charles H. Eglee": "charles h. eglee"
    },
    {
        ", it starred ": null
    },
    {
        "Jessica Alba": "jessica alba"
    },
    {
        " in her ": null
    },
    {
        "breakthrough role": "breakthrough role"
    },
    {
        ". Set in 42 the series chronicles the life of ": null
    },
    {
        "Max Guevara": "max guevara"
    },
    {
        " , a ": null
    },
    {
        "genetically enhanced": "genetic engineering"
    },
    {
        " super-soldier who escapes from a covert military facility as a child. In a ": null
    },
    {
        "post-apocalyptic": "post-apocalyptic"
    },
    {
        " Seattle": "seattle"
    },
    {
        ", she tries to lead a normal life while eluding capture by government agents and searching for her brothers and sisters scattered in the aftermath of their escape. Dark Angel was the first and only series produced by the company Cameron/Eglee Productions, and was filmed in Vancouver at ": null
    },
    {
        "Lions Gate Studios": "lions gate studios"
    },
    {
        ".     The high-budget ": null
    },
    {
        "pilot episode": "television pilot"
    },
    {
        " marked Camerons television debut and was heavily promoted by Fox, reaching 42 million viewers. The first season, which was shown on Tuesday nights in the U.S., received mainly positive reviews and won several awards, including the ": null
    },
    {
        "Peoples Choice Award": "peoples choice awards"
    },
    {
        " for Favorite New TV Drama. Albas portrayal of Max also received mostly positive reviews and several awards. For the second season, the show was moved to the less desirable air time of ": null
    },
    {
        "Friday night": "friday night death slot"
    },
    {
        " and received some criticism for new plot elements. It suffered from a drop in ratings, averaging 42 million viewers per episode, and was ": null
    },
    {
        "canceled": "cancellation"
    },
    {
        ".     A series of novels continued the storyline, and a ": null
    },
    {
        "video game adaptation": "dark angel"
    },
    {
        " was also released. Dark Angel is considered to have ": null
    },
    {
        "gothic": "gothic fiction"
    },
    {
        " and ": null
    },
    {
        "female empowerment": "womens empowerment"
    },
    {
        " themes; Max followed a long line of strong female characters in Camerons work, including ": null
    },
    {
        "Sarah Connor": "sarah connor"
    },
    {
        " and ": null
    },
    {
        "Ellen Ripley": "ellen ripley"
    },
    {
        ". Dark Angel is considered to be part of a wave of shows in the late 42s and early 42s that feature strong female characters, alongside  Buffy the Vampire Slayer ,  Xena: Warrior Princess , and  La Femme Nikita .              In 42 a genetically enhanced nine-year-old female ": null
    },
    {
        "supersoldier": "supersoldier"
    },
    {
        " designated as X4242  escapes along with eleven others from a secret U.S. government institution codenamed Manticore where they were born, raised, and trained to be soldiers and ": null
    },
    {
        "assassins": "assassination"
    },
    {
        ". On June 42 42 months after X4242s escape, ": null
    },
    {
        "terrorist": "terrorist"
    },
    {
        "s detonate an ": null
    },
    {
        "electromagnetic pulse": "nuclear electromagnetic pulse"
    },
    {
        " weapon in ": null
    },
    {
        "the atmosphere": "earths atmosphere"
    },
    {
        " over the U.S., which destroys the vast majority of ": null
    },
    {
        "computer": "computer"
    },
    {
        " and ": null
    },
    {
        "communication": "communication"
    },
    {
        " systems, throwing the country into chaos.     Ten years later in 42 the now 42-year-old X4242 , who calls herself Max Guevara, struggles to search for her Manticore brothers and sisters. In the recovering United States which is now barely more than a ": null
    },
    {
        "developing country": "developing country"
    },
    {
        " she tries to live a relatively normal life and evade capture by Manticore, who wishes to recover their lost asset.   ": null
    },
    {
        "Logan Cale": "list of dark angel characters"
    },
    {
        " , an underground cyber-journalist with the alias Eyes Only, attempts to recruit her to help fight corruption in the post-Pulse world. She initially refuses but accepts after Cale is rendered a ": null
    },
    {
        "paraplegic": "paraplegia"
    },
    {
        " attempting the assignment he was recruiting her for. A romantic interest buds between the two. While assisting Cale, Max also makes a living as a ": null
    },
    {
        "bicycle messenger": "bicycle messenger"
    },
    {
        " at Jam Pony, a ": null
    },
    {
        "courier": "courier"
    },
    {
        " company, along with her friends Original Cindy , Herbal Thought , and Sketchy . Other X42s are periodically introduced, most significantly the unit leader Zack . The Manticore hunt for the escaped X42s is led by Colonel Donald Lydecker . Near the end of the season, Lydecker is betrayed by his superior, the even more ruthless Elizabeth Renfro , and he defects from Manticore. He aids Max and Zack in an assault on Manticore headquarters. Max is badly wounded and captured. Zack, who has also been captured, commits suicide to provide Max with his heart, as she needs an X42 ": null
    },
    {
        "heart transplant": "heart transplantation"
    },
    {
        " to survive.       Cale exposes Manticore to the world. Renfro decides to burn the facility to cover up the evidence and is killed in the process. Aided by Joshua , a transgenic with ": null
    },
    {
        "canine": "canidae"
    },
    {
        " DNA, Max escapes the facility and frees the other transgenics including ": null
    },
    {
        "Alec": "alec mcdowell"
    },
    {
        " , a fellow X42 who later joins Jam Pony. When Max is reunited with Cale he immediately becomes ill and almost dies. Max discovers that Manticore has infected her with a virus specifically designed to kill Cale, and the two must avoid all physical contact to keep him alive. Max learns that Joshua was the first transgenic created by Sandeman, Manticores founder. Over the course of the season, it is revealed that a millennia-old breeding cult has bred their own super-soldiers who rival the Manticore-produced transgenics. Ames White , a government agent tasked with eliminating the freed transgenics, is revealed to be a member of the cult. When a strange message written in Maxs genetic code makes an appearance on her skin it is revealed that Sandeman is a renegade from the breeding cult and Ames White is his son. White is still loyal to the cult and hates his fathers transgenic creations with a passion. Believing that Max is a threat to the breeding cults plans they attempt to kill her, but she escapes to Terminal City, an abandoned part of Seattle where hundreds of outcast transgenics have been hiding. When the police begin to surround Terminal City Max convinces the other transgenics to stand their ground rather than run. The series ends with the military surrounding Terminal City as the residents raise their newly designed flag from one of the buildings, and wait for a possible invasion.                 The first season introduced Jessica Alba as the main character ": null
    },
    {
        "Max Guevara": "max guevara"
    },
    {
        " , a genetically enhanced transgenic super-soldier who escaped from a government facility named Manticore. She works as a bike messenger for the courier company Jam Pony during the day and as a cat burglar at night. Michael Weatherly played Logan Cale, the shows second most prominent character. Cale is a wealthy cyber-journalist and vigilante who operates under the alias Eyes Only. He recruits Max to assist with his campaign against corruption and crime in return for helping her find information on her fellow Manticore escapees. Main roles were given to several of the couriers at Jam Pony, including Valarie Rae Miller as Cynthia Original Cindy McEachin, Richard Gunn as Calvin Sketchy Theodore, and Alimi Ballard as Herbal Thought. ": null
    },
    {
        "J. C. MacKenzie": "j. c. mackenzie"
    },
    {
        " played Reagan Normal Ronald, the companys boss, and ": null
    },
    {
        "Jennifer Blanc": "jennifer blanc"
    },
    {
        " played Kendra Maibaum, Maxs first roommate,  and John Savage played the main antagonist, Col. Donald Lydecker, who is trying to recapture Max and the other Manticore escapees.     The Lydecker character is written out of the series early in the second season, and Herbal Thought and Kendra Maibaum do not appear at all. Season two introduced Kevin Durand as Joshua, an experimental creature from Manticore who has distinct canine facial features. It also introduces Jensen Ackles as Alec McDowell , an X42 who has a romantic interest in Max, and ": null
    },
    {
        "Ashley Scott": "ashley scott"
    },
    {
        " as Asha Barlow, a resistance fighter who has a romantic interest in Cale. Martin Cummins portrayed the seasons main antagonist Ames White, a ": null
    },
    {
        "National Security Agency": "national security agency"
    },
    {
        " agent tasked with destroying the Manticore escapees.                 Following his success with the film  Titanic , director ": null
    },
    {
        "James Cameron": "james cameron"
    },
    {
        " teamed up with ": null
    },
    {
        "Charles H. Eglee": "charles h. eglee"
    },
    {
        " with whom he had previously worked on projects including  Piranha II: The Spawning . The two formed a production company, Cameron/Eglee Productions, and began working on ideas for a television series. They considered several options, including a family drama, before deciding on the idea of Dark Angel. Cameron said they began with the idea that Max would be a genetic construct who looked normal on the outside but was different on the cellular, genetic level. We explore what that could mean.  Cameron was influenced by the ": null
    },
    {
        "manga": "manga"
    },
    {
        "  Battle Angel Alita ,  which he was originally intending to ": null
    },
    {
        "adapt into a film": "alita: battle angel"
    },
    {
        " after completing Dark Angel.      Dark Angel would be the first and only work by Cameron/Eglee Productions.  Max followed a long line of strong female characters in Camerons work, including ": null
    },
    {
        "Sarah Connor": "sarah connor"
    },
    {
        " and ": null
    },
    {
        "Ellen Ripley": "ellen ripley"
    },
    {
        ". Cameron said its a win/win situation as women respond to characters who appear strong and capable and young male audiences want to see girls kick ass . Later they decided to set the series in a post-social collapse world, saying that the hysteria surrounding ": null
    },
    {
        "Y42K": "year 2000 problem"
    },
    {
        " served as inspiration; in the series, an ": null
    },
    {
        "electromagnetic pulse": "electromagnetic pulse"
    },
    {
        " previously destroyed every computer in the United States. ": null
    },
    {
        "Working title": "working title"
    },
    {
        "s for the series included Experimental Girl  and Maximum Girl . The project marked Camerons television debut; he worked mainly as a writer and executive producer for the series.             More than a thousand young actresses were considered for the part of Max. Cameron started reviewing audition tapes when the field had been narrowed down to twenty or thirty applicants. He was initially not impressed with Albas audition tape, saying she had her head down, she was reading out of the script  ... she didnt present herself all that well. But there was something about the way she read the script that copped an attitude that I liked. Cameron continually reviewed the audition tapes but kept coming back to Albas, eventually deciding that he needed to meet her. Alba was hired for the role before the script was written. Eglee said: We had the benefit of being able to write a script kind of backward, we were writing for this actress, with her cadences and her rhythms and her sensibilities and her attitude and her slang. To train for the role, Alba spent a year doing martial arts and gymnastics and riding motorcycles.     The two-hour premiere episode cost up to $42 million to produce, and Cameron reportedly brought the pilot in on time and on budget . Subsequent episodes had a considerably smaller budget. Fox spent heavily on the promotional campaign for the premiere, paying for theatrical trailers, billboards, and ": null
    },
    {
        "guerilla marketing": "guerilla marketing"
    },
    {
        ". Cameron took a very basic view of the shows chance of success, saying: If it flies, it flies. If it doesnt, it doesnt  ... If people connect with it, which I hope they will, fine. If we dont find an audience, we deserve to be off the air. Its that simple. Eglee admitted the series had been routinely over budget in the first season, and feared that this would be a factor in whether or not the show was renewed for a second season, though Cameron downplayed these concerns.      Fox just barely renewed the series for a second season. The budget for episodes in season two was $42 million each. After the intended director of the final episode did not work out, Cameron decided to step in and fill the position. He did this partially for the experience but also to show the network the potential for a third season. It was his first experience directing a TV drama.     The producers were initially told a third season had been approved, but two days later Fox informed them that the series had been canceled.      Dark Angel was set in Seattle, and filmed in ": null
    },
    {
        "Vancouver": "vancouver"
    },
    {
        ", ": null
    },
    {
        "British Columbia": "british columbia"
    },
    {
        ", at ": null
    },
    {
        "Lions Gate Studios": "lions gate studios"
    },
    {
        ". Other filming locations included the ": null
    },
    {
        "Vancouver Art Gallery": "vancouver art gallery"
    },
    {
        ", as well as ": null
    },
    {
        "Buntzen Lake": "buntzen lake"
    },
    {
        " and ": null
    },
    {
        "Riverview Hospital": "riverview hospital"
    },
    {
        ", also in British Columbia.        In the DVD commentary for Freak Nation , the series finale, Charles H. Eglee explained what had been planned for season three. The intention was to bring together the storylines of seasons one and two and reveal the mythology of Dark Angel. The season would reveal that thousands of years ago, Earth passed through a comets tail which deposited viral material that killed 42% of the human race. The breeding cult preserved the survivors genetic immunity so that when the comet returned, only members of the cult would survive. Sandeman, a cult member, and Maxs creator betrayed the cult and decided to give this genetic immunity to the rest of humanity through Max, who would be the savior of the human race. There were multiple ideas on how to spread Maxs immunity, including an air burst that would disperse the antibody through the atmosphere, or attaching the immunity to a ": null
    },
    {
        "common cold": "common cold"
    },
    {
        " virus .  This storyline is expanded upon in the final Dark Angel novel After the Dark though when the comet returns nobody falls ill, and it is believed that the cult simply had a false prediction.         The first season premiered in the United States on Tuesday, October 42 42 from 42:42 pm until 42:42 pm. Fox had to obtain agreements from its affiliates to broadcast past 42:42 pm, as most of them air local news programs at this time.  In subsequent weeks the show aired from 42:42 pm till 42:42 pm Tuesdays. During its first season, the show was preempted on several occasions, including by the ": null
    },
    {
        "42 World Series": "2000 world series"
    },
    {
        ", the ": null
    },
    {
        "Billboard Music Awards": "billboard music awards"
    },
    {
        " and coverage of the ": null
    },
    {
        "presidential election": "2000 united states presidential election"
    },
    {
        ". The frequent preemptions became a running joke on the set. Dark Angels scheduled air time put it in direct competition with  Angel  on ": null
    },
    {
        "The WB": "the wb"
    },
    {
        ". Critics debated which of the similarly named shows would dominate the time-slot. Jonathon Storm from  Philadelphia Media Network  believed that Dark Angel would prove victorious, while Brad Adgate, a research director at Horizon Media, predicted that Dark Angel would only initially take the lead in the ratings, as Angels strong fanbase would prevail in the long run. Brad Turrell, executive vice-president of Network Communication for the WB conceded that the heavy promotion for Dark Angel would give it higher initial ratings at first but believed that as Angel was a better show it would not be affected long-term. Concerned that there might be confusion between the two shows, the WB took out a full page ad in  TV Guide , which read There is only ONE. ": null
    },
    {
        "David Boreanaz": "david boreanaz"
    },
    {
        " is ANGEL. Angel won the time slot when Fox moved the broadcast time of Dark Angel to 42:42 pm on Fridays for its second season, where it preceded the new series  Pasadena .      The final episode of the series aired on May 42 42 as a special 42-minute episode.  Dark Angel has been syndicated on ": null
    },
    {
        "Syfy": "syfy"
    },
    {
        "  and the ": null
    },
    {
        "El Rey Network": "el rey network"
    },
    {
        " in the United States  and on ": null
    },
    {
        "E42": "e4"
    },
    {
        "  and the ": null
    },
    {
        "Horror Channel": "horror channel"
    },
    {
        " in the UK.        The ": null
    },
    {
        "score": "film score"
    },
    {
        " for the Dark Angel pilot was composed and conducted by ": null
    },
    {
        "Joel McNeely": "joel mcneely"
    },
    {
        ". The pilot score track Bicycle Ride was used in the end credits for the duration of the series. The pilot score was released in full as part of the original publicity press kit, titled Dark Angel: Complete Score from the Dark Angel Pilot. The 42-track CD was for promotional use only and not for resale.  McNeely returned to score the entire series, making frequent use of grumbling ": null
    },
    {
        "timpani": "timpani"
    },
    {
        " rolls, bass drum beats and shrill brass and violin crescendos that familiarly sketch the action arcs of the narrative.  Traditional orchestral elements are integrated with innovative electronic sounds and female vocals to create a sense of Maxs otherworldliness , haunting wind chimes, pseudo-Orientalist refrains and extenuated high-pitched eerie sounds evoke Maxs super-human abilities, and driving hip hop bass beats with heavy percussive effects high-pitched feedback and reverberation convey Maxs struggles with violence and her memories of Manticore. The theme song for the series was composed by ": null
    },
    {
        "Chuck D": "chuck d"
    },
    {
        " and ": null
    },
    {
        "Gary G-Wiz": "gary g-wiz"
    },
    {
        ". Both McNeely and G-Wiz cited Dark Angel as an opportunity to push sonic boundaries; G-Wiz stated that Eglee and music supervisor Randy Gerston kept calling him and telling him to make the theme song crazier . McNeely said scoring the series was like the difference between jazz and classical music. Im a jazz player, so Dark Angel is as free form and as weird as we want to get.      A soundtrack album consisting of hip hop and R & B songs was released on April 42 42 through ": null
    },
    {
        "Artemis Records": "artemis records"
    },
    {
        ". Eglee explained that he and Cameron began with the idea that they could do a hip hop youth ensemble thing , noting that hip hop had become the dominant influence in the country in the world and that they saw an opportunity to give the future of Dark Angel the soundtrack of contemporary American popular culture. In the soundtracks liner notes, Eglee writes: Reminiscent of another time and place  ... that part of the Bronx in the late 42s known as ": null
    },
    {
        "Fort Apache": "fort apache"
    },
    {
        ": a place that for ": null
    },
    {
        "white America": "white americans"
    },
    {
        ", defined lack and limitation, violence and hopelessness. What white Americans couldnt see or hear then was the beautiful thing being birthed there, which, years later, would come to be known as Hip Hop.  ... This album remembers the foundations of Hip Hop as it contemplates its future. Randy Gerston said that because of the near future setting of the series, he avoided any major hit songs as these would not sound futuristic. This gave them the opportunity to discover new talent instead. The album features predominately female hip hop and ": null
    },
    {
        "neo soul": "neo soul"
    },
    {
        " artists whose lyrics typically focus on the expression of female agency and power – particularly with regard to sexuality.  It peaked at No. 42 on the ": null
    },
    {
        "Top Independent Albums": "top independent albums"
    },
    {
        " chart.  Jason Birchmeier of ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        " gave the soundtrack three out of five stars. He noted the lack of major artists on the album and commented that it seems to be a female-orientated soundtrack, perhaps because of the shows female lead character . Birchmeier said many of the songs were quite impressive and that it exceeds your expectations for a television show soundtrack .             Dark Angel is considered to be in the ": null
    },
    {
        "cyberpunk": "cyberpunk"
    },
    {
        " genre. Writing in Reconstruction: Studies in Contemporary Culture, Lorna Jowett considered Dark Angel to be a hybrid of science fiction, ": null
    },
    {
        "Gothic": "gothic fiction"
    },
    {
        ", and ": null
    },
    {
        "action": "action fiction"
    },
    {
        " which incorporated forms and themes from all three genres. Jowett compared Dark Angel to the Gothic novel  Frankenstein , saying that Maxs genetic engineering makes her a postmodern Frankensteins monster, blurring boundaries between human and monster . Kathleen McConnell in Gothic Studies also compared Maxs unconventional conception to Frankensteins monster, and cited several other Gothic themes in the series. She states that Max fits the model of a Gothic heroine who ostensibly appear to be conforming to their accepted role within the ": null
    },
    {
        "patriarchy": "patriarchy"
    },
    {
        " but who actually subvert the fathers power at every possible occasion.  In her book Post-feminist Impasses in Popular Heroine Television, Alison Horbury theorizes that Dark Angel, along with the shows  Alias ,  La Femme Nikita , and  Dollhouse  have themes of abduction, physical and symbolic ": null
    },
    {
        "rape": "rape"
    },
    {
        ", motherlessness, and the discovery of a sister.     Several academics have considered Dark Angel to be part of a wave of shows in the late 42s and early 42s including  Buffy the Vampire Slayer ,  Xena: Warrior Princess , and La Femme Nikita that feature strong female characters. Writing in Science Fiction Film & Television, Clarice Butkus noted Max has been considered to be a distinctly millennial post-": null
    },
    {
        "third-wave feminist": "third-wave feminism"
    },
    {
        " warrior. She also felt that Maxs relationship and dialogue with Original Cindy, an ": null
    },
    {
        "African American": "african american"
    },
    {
        " lesbian, conveyed ": null
    },
    {
        "female empowerment": "womens empowerment"
    },
    {
        ". For example, Cindy encourages Max not to feel guilt over her sexual behaviour and instead to embrace a traditionally masculine approach to sex. McConnell and Jowett also cited Max as an example of female empowerment; Jowett considered Max to be the usual postmodern, ": null
    },
    {
        "postfeminist": "postfeminism"
    },
    {
        " representation of the female action hero with a reversal or a mixture of traditional gender traits.      Butkus stated that Dark Angel repeatedly paid homage to the film  Blade Runner . Lydecker, the flawed antagonist of Dark Angel is said to be a transposition of ": null
    },
    {
        "Deckard": "rick deckard"
    },
    {
        ", the flawed hero of Blade Runner. Alec McDowell/X4242s love interest is named Rachel, believed to be a reference to the ": null
    },
    {
        "replicant": "replicant"
    },
    {
        " Rachael": "list of blade runner charactersrachael"
    },
    {
        ", though in Dark Angel it is McDowell and not Rachel who is bio-engineered. His flashbacks of this traumatic relationship use piano music similar to that used in Blade Runner to denote memories and a desire for former times. Alecs genetic memory enhancements enable him, with only a few hours practice, to play a detailed piano piece by ": null
    },
    {
        "Frédéric Chopin": "frédéric chopin"
    },
    {
        ", the composer originally scripted for the scene in Blade Runner where Rachael inexplicably finds herself able to play the piano; both characters are considered to be pre-programmed by state forces to master superhuman skills.       Initial reaction to the series and Maxs character was mostly positive, with favorable reviews in  Rolling Stone  and  Time . Hal Boedeker of the  Orlando Sentinel  said: Televisions newest warrior woman possesses skills worthy of ": null
    },
    {
        "Catwoman": "catwoman"
    },
    {
        ", ": null
    },
    {
        "Xena": "xena"
    },
    {
        ", ": null
    },
    {
        "Emma Peel": "emma peel"
    },
    {
        ", and ": null
    },
    {
        "Wonder Woman": "wonder woman"
    },
    {
        ".  ": null
    },
    {
        "Howard Rosenberg": "howard rosenberg"
    },
    {
        " said: If pouty faces and sexy walks could destroy, the highly arresting Max would be wiping out the entire planet.  However ": null
    },
    {
        "Joyce Millman": "joyce millman"
    },
    {
        " said Max was little more than lips and ass and considered the series to be an expensive ": null
    },
    {
        "Britney Spears": "britney spears"
    },
    {
        " music video.  People  ran a negative review of the Pilot episode in October 42  though in December they listed Albas portrayal of Max as among the breakthrough performances of 42      The first episode was behind only  CSI: Crime Scene Investigation  as the most watched new show of the week, albeit in a week with fewer new shows because of the presidential debate coverage. Fox chose to debut Dark Angel instead of airing the ": null
    },
    {
        "first presidential debate": "united states presidential election debates, 2000first presidential debate — october 3"
    },
    {
        ", a move which TV analyst Marc Berman praised, saying: The people who watch the debates arent the people wholl tune into Dark Angel anyway , though he predicted that the premieres high ratings would not hold up as the show competed against more varied competition in subsequent weeks.  It was the tenth most popular show overall that week, attracting 42 million viewers.  Cameron said he did not know if the broadcast time change for the second season would have a positive or negative effect on the shows ratings, though R. D. Heldenfels of the  Sun Journal  noted the ": null
    },
    {
        "poor ratings of Friday night television": "friday night death slot"
    },
    {
        ", especially the low viewing rates among 42 to 42-year-olds, the age-group that Dark Angel was most popular with. The new time slot saw a ratings drop; for the 42–42 season Dark Angel averaged 42 million viewers, ranking number 42 in the ": null
    },
    {
        "Nielsen ratings": "nielsen ratings"
    },
    {
        ".      Commenting on the release of the second season, Cynthia Fuchs of  PopMatters  said the first season of Dark Angel was one of the few straight-up successes, a ratings hit among the coveted youth demographic. She praised the series but clarified: Im not getting carried away: Jim Cameron is not going to be making revolutionary art anytime soon.  Michael Sauter of  Entertainment Weekly  gave the first season a B+ and spoke highly of Alba, saying that for a while TVs hottest kick-butt heroine .  Elka Karl of ": null
    },
    {
        "Common Sense Media": "common sense media"
    },
    {
        " gave the entire series 42 out of 42 stars, saying: While the dialogue sometimes falls flat, overall the show is well-scripted and well acted, and Alba does an excellent job of carrying the series. Dark Angel isnt perfect by any stretch of the imagination, but it is compelling television that teen sci-fi fans will enjoy. While praising the first season, Randy Dankievitch of  TVOvermind  labelled the second season silly , criticizing dumb stories like Maxs dream episode Boo , the virus that prevents Logan and Max having physical contact, and the various half-animal Manticore experiments that are revealed.      Writing in his book The Encyclopedia of Superheroes on Film and Television, John Kenneth Muir said it was necessary for Cameron to set Dark Angel in the future because the prosperity of the U.S. in 42 offered little possibility for crime, squalor and other societal problems . While criticizing certain plot elements in the second season as contributing to the shows downfall, Muir said that larger factors in ratings dropping were the ": null
    },
    {
        "September 42 attacks": "september 11 attacks"
    },
    {
        ", the ": null
    },
    {
        "Enron scandal": "enron scandal"
    },
    {
        ", and the depletion of the U.S. governments surplus, which changed Dark Angels futuristic vision of recession in a Third-World America from an interesting, far-fetched premise to a depressing reminder that things could still get worse .     In 42 Max was ranked number 42 on  TV Guide s list of the 42 Greatest Sci-Fi Legends,  and in 42 Dave Golder of ": null
    },
    {
        "GamesRadar": "gamesradar"
    },
    {
        " ranked her number 42 on his list of the 42 sexiest women in sci-fi.  In 42 ": null
    },
    {
        "AfterEllen": "afterellen"
    },
    {
        " ranked Original Cindy number 42 on their list of the Top 42 Lesbian/": null
    },
    {
        "Bi": "bisexuality"
    },
    {
        " Sidekicks.  In 42 Kayti Burt of  Den of Geek  included Dark Angel at the top of her list of 42 Sci-Fi Shows That Dont Get Enough Love .  In 42 it was recognized that Dark Angel was the first American television series to feature an openly transgender actress playing a transgender character. In the season one episode Out , transgender actress Jessica Crockett portrayed Louise , a young woman on a date with Normal.        The 42 film  Hitman  re-used footage of Max and other Manticore children in training from Dark Angel. It was used to portray the Hitman protagonist ": null
    },
    {
        "Agent 42": "agent 47"
    },
    {
        ", a cloned assassin who, like the Manticore children, has a barcode on the back of his head.        In its first season Dark Angel won the Favorite Television New Dramatic Series award at the ": null
    },
    {
        "42th Peoples Choice Awards": "27th peoples choice awards"
    },
    {
        ",  and was nominated for Best Television by the ": null
    },
    {
        "International Horror Guild Award": "international horror guild award"
    },
    {
        "s.  The production team was nominated for the Excellence in Production Design Award by the ": null
    },
    {
        "Art Directors Guild": "art directors guild"
    },
    {
        ".  Editor Stephen Mark won Best Edited Motion Picture for Commercial Television at the ": null
    },
    {
        "Eddie Awards": "american cinema editorseddie award"
    },
    {
        " for the pilot episode,   and the pilot was also nominated for ": null
    },
    {
        "Outstanding Special Visual Effects": "primetime emmy award for outstanding special visual effects"
    },
    {
        " for the ": null
    },
    {
        "42rd Primetime Emmy Awards": "53rd primetime emmy awards"
    },
    {
        "  and Best Visual Effects: Dramatic Series by the ": null
    },
    {
        "Leo Awards": "leo awards"
    },
    {
        ".      Jessica Alba won Best Actress on Television at the ": null
    },
    {
        "42th Saturn Awards": "27th saturn awards"
    },
    {
        ", Breakout Star of the Year at the ": null
    },
    {
        "TV Guide Award": "tv guide award"
    },
    {
        "s,  Outstanding Actress in a New Television Series at the ": null
    },
    {
        "ALMA Award": "alma award"
    },
    {
        "s,   and Choice Actress at the ": null
    },
    {
        "42 Teen Choice Awards": "2001 teen choice awards"
    },
    {
        ".  She also received nominations for ": null
    },
    {
        "Best Actress – Television Series Drama": "golden globe award for best actress – television series drama"
    },
    {
        " for the ": null
    },
    {
        "42th Golden Globe Awards": "58th golden globe awards"
    },
    {
        "  and Best Performance in a TV Drama Series – Leading Young Actress for the ": null
    },
    {
        "42nd Young Artist Awards": "22nd young artist awards"
    },
    {
        ".      Dark Angel was nominated for fewer awards in its second season. It was nominated for Choice Drama/Action Adventure for the ": null
    },
    {
        "42 Teen Choice Awards": "2002 teen choice awards"
    },
    {
        ", where Alba was also nominated for Choice Actress, Drama.  Alba was also nominated for Outstanding Actress in a Television Series for the ALMA Awards.  At the Leo Awards the episode Boo received a nomination for Best Visual Effects: Dramatic Series, and David Geddes won Best Cinematography: Dramatic Series for the episode Two .             ": null
    },
    {
        "42th Century Fox Home Entertainment": "20th century fox home entertainment"
    },
    {
        " released seasons 42 and 42 of Dark Angel on DVD in ": null
    },
    {
        "region 42": "dvd region code"
    },
    {
        " , as well as a dual-coded region 42 and 42 set in 42 as six-disc sets packaged in cardboard sleeves containing three DVD cases each of two discs. Season 42 was released in R42/42 in February  and R42 in May, and season 42 was released in R42/42 in June  and R42 in October.     The R42 releases contain several special features, including four episodes with optional commentary in each season, ": null
    },
    {
        "blooper": "blooper"
    },
    {
        "s, deleted scenes, and ": null
    },
    {
        "featurette": "featurette"
    },
    {
        "s. The R42/42 releases contain no commentaries and fewer other special features, but the episodes are presented in anamorphic widescreen, while R42 releases are fullscreen.  Adam Tyner of  DVD Talk  gave the R42 first season three out of five stars for audio and video, and three and a half stars for special features.  Shannon Nutt of DVD Talk gave the R42 second season three stars out of five for audio and video, and two and a half stars for extras, stating: it appears a decent number of features, but then you discover the length of each one and really feel short-changed by Fox . She also noted the episodes commentary was mainly by writers and producers, and did not feature James Cameron or any of the actors.      Both seasons were re-released in R42 on June 42 42 with slim packaging consisting of one plastic case containing all six discs .        A ": null
    },
    {
        "video game of the same name": "dark angel"
    },
    {
        " based on the series was developed by ": null
    },
    {
        "Radical Entertainment": "radical entertainment"
    },
    {
        ", published by ": null
    },
    {
        "Sierra Entertainment": "sierra entertainment"
    },
    {
        " and released for ": null
    },
    {
        "PlayStation 42": "playstation 2"
    },
    {
        " on November 42 42 and later on ": null
    },
    {
        "Xbox": "xbox"
    },
    {
        ". Alba and Weatherly voiced their respective characters in the game. Development of the game started before the series was cancelled, and the game was met with mixed to negative reception upon release. Brett Todd of ": null
    },
    {
        "GameSpot": "gamespot"
    },
    {
        " gave the game 42 out of 42 saying: Although its impossible to say whether or not the developers morale was affected by the cancellation of the series, this third-person action adventure plays like it was cranked out to fulfill a contract and concluded the development of this game probably should have been cancelled at the same time as the television series .  Duke Ferris from ": null
    },
    {
        "Game Revolution": "game revolution"
    },
    {
        " gave the game a D+, saying that while fans of Dark Angel would enjoy it as it mirrors an episode of the show almost exactly , anybody else was likely to find it boring.      Three original ": null
    },
    {
        "novels": "novels"
    },
    {
        " written by ": null
    },
    {
        "Max Allan Collins": "max allan collins"
    },
    {
        " expand upon the Dark Angel television series, with two picking up directly where the series ended, and another serving as a prequel. A companion book, Dark Angel: The Eyes Only Dossier, was written by D.A. Stern. Dark Angel: Before the Dawn is a ": null
    },
    {
        "prequel": "prequel"
    },
    {
        " to the television series, detailing Maxs life after her escape from Manticore in 42 After witnessing footage taken in Seattle of a man she believes to be one of her X42 siblings, Max moves from Los Angeles to Seattle, meeting Original Cindy and Kendra on the way, before finding employment at Jam Pony. Max eventually discovers the man in the footage is her brother Seth, who unbeknown to her has been working for Logan as a personal agent. Shortly after being reunited with him at the ": null
    },
    {
        "Space Needle": "space needle"
    },
    {
        ", Seth, who has been injured, commits suicide by falling from it to avoid being captured by Lydecker. Max begins returning to the Space Needle to think and to be with Seth . Dark Angel: Skin Game immediately follows the events of Freak Nation , the final episode of season two, describing days in May 42 Skin Game focuses on a killer terrorizing the streets of Seattle and the growing suspicion and evidence that the killer could be transgenic. As the killings escalate, the U.S. Army and National Guard prepare themselves for an invasion of Terminal City. Max uncovers that the killer is a ": null
    },
    {
        "shapeshifting": "shapeshifting"
    },
    {
        " transgenic named Kelpy, though he has been unwillingly given a drug by Ames White that is causing his psychosis. When Max reveals this information to the public through Eyes Only, Ames White goes into hiding, and the invasion of Terminal City is called off. When Kelpy takes on Logans form he is killed by the virus Max carries which was designed to kill Logan. Dark Angel: After the Dark follows Skin Game. It is revealed that Maxs virus is gone, the most likely explanation being that when the virus killed Kelpy it went dormant as it believed its mission to kill Logan was accomplished. However, Logan and Maxs relationship is thrown into turmoil when he reveals that he inadvertently caused Seths death by sending him on an assignment. Just as Max is ready to forgive him, Logan is kidnapped by Ames White and the breeding cult, who are preparing for the coming of a comet they believe will destroy everyone except cult-members and transgenics through depositing viral material into Earths atmosphere. They are trying to kill Max as they believe she possesses a genetic code that will save ordinary humans from the comets viral material. With the aid of a team of transgenics, Max eventually rescues Logan and destroys the headquarters of the breeding cult; Joshua kills Ames White. When the comet arrives, nobody falls ill, and it is believed the cults prediction was false. Max finds Lydecker in a prison cell at the cults headquarters. He promises to help her find her mother if she saves him, and she agrees. The book ends with Logan and Max finally consummating their relationship.     The companion book, Dark Angel: The Eyes Only Dossier, begins with a letter written by Logan Cale during the stand-off at Terminal City. It is addressed to Detective Matt Sung, a recurring character from the series who aides Logan, instructing him that the package he is sending him contains documents pertaining to the four most critical Eyes Only investigations. If he is killed by the potential invasion of Terminal City, Logan wants Sung to carry on the investigations. The rest of the book contains the documents relating to the four investigations.": null
    }
]