[
    {
        "              Darwinism is a ": null
    },
    {
        "theory": "scientific theory"
    },
    {
        " of ": null
    },
    {
        "biological": "biology"
    },
    {
        " evolution": "evolution"
    },
    {
        " developed by the English naturalist ": null
    },
    {
        "Charles Darwin": "charles darwin"
    },
    {
        " and others, stating that all ": null
    },
    {
        "species": "species"
    },
    {
        " of organisms arise and develop through the ": null
    },
    {
        "natural selection": "natural selection"
    },
    {
        " of small, inherited variations that increase the individuals ability to compete, survive, and ": null
    },
    {
        "reproduce": "reproduction"
    },
    {
        ". Also called Darwinian theory, it originally included the broad concepts of ": null
    },
    {
        "transmutation of species": "transmutation of species"
    },
    {
        " or of evolution which gained general scientific acceptance after Darwin published  On the Origin of Species  in 1859, including concepts which predated Darwins theories. English biologist ": null
    },
    {
        "Thomas Henry Huxley": "thomas henry huxley"
    },
    {
        " coined the term Darwinism in April 1860.       Darwinism subsequently referred to the specific concepts of natural selection, the ": null
    },
    {
        "Weismann barrier": "weismann barrier"
    },
    {
        ", or the ": null
    },
    {
        "central dogma of molecular biology": "central dogma of molecular biology"
    },
    {
        ".  Though the term usually refers strictly to biological evolution, ": null
    },
    {
        "creationists": "creationism"
    },
    {
        " have appropriated it to refer to the ": null
    },
    {
        "origin of life": "abiogenesis"
    },
    {
        ". It is therefore considered the belief and acceptance of Darwins and of his predecessors work, in place of other theories, including ": null
    },
    {
        "divine design": "teleological argument"
    },
    {
        " and ": null
    },
    {
        "extraterrestrial origins": "panspermia"
    },
    {
        ".       English biologist ": null
    },
    {
        "Thomas Henry Huxley": "thomas henry huxley"
    },
    {
        " coined the term Darwinism in April 1860.  It was used to describe evolutionary concepts in general, including earlier concepts published by English philosopher ": null
    },
    {
        "Herbert Spencer": "herbert spencer"
    },
    {
        ". Many of the proponents of Darwinism at that time, including Huxley, had reservations about the significance of natural selection, and Darwin himself gave credence to what was later called ": null
    },
    {
        "Lamarckism": "lamarckism"
    },
    {
        ". The strict ": null
    },
    {
        "neo-Darwinism": "neo-darwinism"
    },
    {
        " of German evolutionary biologist ": null
    },
    {
        "August Weismann": "august weismann"
    },
    {
        " gained few supporters in the late 19th century. During the approximate period of the 1880s to about 1920, sometimes called ": null
    },
    {
        "the eclipse of Darwinism": "the eclipse of darwinism"
    },
    {
        " , scientists proposed various ": null
    },
    {
        "alternative evolutionary mechanisms": "alternatives to darwinism"
    },
    {
        " which eventually proved untenable. The development of the ": null
    },
    {
        "modern synthesis": "modern synthesis"
    },
    {
        " in the early 20th century, incorporating natural selection with ": null
    },
    {
        "population genetics": "population genetics"
    },
    {
        " and ": null
    },
    {
        "Mendelian genetics": "mendelian inheritance"
    },
    {
        ", revived Darwinism in an updated form.      While the term Darwinism has remained in use amongst the public when referring to modern evolutionary theory, it has increasingly been argued by science writers such as ": null
    },
    {
        "Olivia Judson": "olivia judson"
    },
    {
        " and ": null
    },
    {
        "Eugenie Scott": "eugenie scott"
    },
    {
        " that it is an inappropriate term for modern evolutionary theory.   For example, Darwin was unfamiliar with the work of the ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        "n scientist and ": null
    },
    {
        "Augustinian": "augustinians"
    },
    {
        " friar": "friar"
    },
    {
        " Gregor Mendel": "gregor mendel"
    },
    {
        ",  and as a result had only a vague and inaccurate understanding of ": null
    },
    {
        "heredity": "heredity"
    },
    {
        ". He naturally had no inkling of later theoretical developments and, like Mendel himself, knew nothing of ": null
    },
    {
        "genetic drift": "genetic drift"
    },
    {
        ", for example.       In the United States, creationists often use the term Darwinism as a ": null
    },
    {
        "pejorative": "pejorative"
    },
    {
        " term in reference to beliefs such as ": null
    },
    {
        "scientific materialism": "metaphysical naturalism"
    },
    {
        ", but in the United Kingdom the term has no negative connotations, being freely used as a shorthand for the body of theory dealing with evolution, and in particular, with evolution by natural selection.            While the term Darwinism had been used previously to refer to the work of ": null
    },
    {
        "Erasmus Darwin": "erasmus darwin"
    },
    {
        " in the late 18th century, the term as understood today was introduced when Charles Darwins 1859 book On the Origin of Species was reviewed by Thomas Henry Huxley in the April 1860 issue of the  Westminster Review .  Having hailed the book as a veritable ": null
    },
    {
        "Whitworth gun": "joseph whitworthwhitworth rifle"
    },
    {
        " in the armoury of liberalism promoting ": null
    },
    {
        "scientific naturalism": "naturalism"
    },
    {
        " over ": null
    },
    {
        "theology": "theology"
    },
    {
        ", and praising the usefulness of Darwins ideas while expressing professional reservations about Darwins ": null
    },
    {
        "gradualism": "gradualism"
    },
    {
        " and doubting if it could be proved that natural selection could form new species,  Huxley compared Darwins achievement to that of ": null
    },
    {
        "Nicolaus Copernicus": "nicolaus copernicus"
    },
    {
        " in explaining planetary motion:        These are the basic tenets of evolution by natural selection as defined by Darwin:     More individuals are produced each generation than can survive.   Phenotypic variation exists among individuals and the variation is heritable.   Those individuals with heritable traits better suited to the environment will survive.   When reproductive isolation occurs new species will form.     Another important evolutionary theorist of the same period was the Russian geographer and prominent anarchist ": null
    },
    {
        "Peter Kropotkin": "peter kropotkin"
    },
    {
        " who, in his book  Mutual Aid: A Factor of Evolution  , advocated a conception of Darwinism counter to that of Huxley. His conception was centred around what he saw as the widespread use of co-operation as a survival mechanism in human societies and animals. He used biological and ": null
    },
    {
        "sociological": "sociology"
    },
    {
        " arguments in an attempt to show that the main factor in facilitating evolution is cooperation between individuals in free-associated societies and groups. This was in order to counteract the conception of fierce ": null
    },
    {
        "competition": "competition"
    },
    {
        " as the core of evolution, which provided a ": null
    },
    {
        "rationalization": "rationalization"
    },
    {
        " for the dominant political, economic and social theories of the time; and the prevalent interpretations of Darwinism, such as those by Huxley, who is targeted as an opponent by Kropotkin. Kropotkins conception of Darwinism could be summed up by the following quote:            Darwinism soon came to stand for an entire range of evolutionary philosophies about both biology and society. One of the more prominent approaches, summed in the 1864 phrase ": null
    },
    {
        "survival of the fittest": "survival of the fittest"
    },
    {
        " by Herbert Spencer, later became emblematic of Darwinism even though Spencers own understanding of evolution was more similar to that of ": null
    },
    {
        "Jean-Baptiste Lamarck": "jean-baptiste lamarck"
    },
    {
        " than to that of Darwin, and predated the ": null
    },
    {
        "publication of Darwins theory": "publication of darwins theory"
    },
    {
        " in 1859. What is now called ": null
    },
    {
        "Social Darwinism": "social darwinism"
    },
    {
        " was, in its day, synonymous with Darwinism —the application of Darwinian principles of struggle to society, usually in support of anti-": null
    },
    {
        "philanthropic": "philanthropy"
    },
    {
        " political agenda. Another interpretation, one notably favoured by Darwins half-cousin ": null
    },
    {
        "Francis Galton": "francis galton"
    },
    {
        ", was that Darwinism implied that because natural selection was apparently no longer working on civilized people, it was possible for inferior strains of people  to overwhelm the superior strains, and voluntary corrective measures would be desirable—the foundation of ": null
    },
    {
        "eugenics": "eugenics"
    },
    {
        ".        In Darwins day there was no rigid definition of the term Darwinism , and it was used by opponents and proponents of Darwins biological theory alike to mean whatever they wanted it to in a larger context. The ideas had international influence, and ": null
    },
    {
        "Ernst Haeckel": "ernst haeckel"
    },
    {
        " developed what was known as Darwinismus in Germany, although, like Spencers evolution , Haeckels Darwinism had only a rough resemblance to the theory of Charles Darwin, and was not centered on natural selection. Schmitt S. . Haeckel: A German Darwinian? Comptes Rendus Biologies: 332: 110-118. In 1886, ": null
    },
    {
        "Alfred Russel Wallace": "alfred russel wallace"
    },
    {
        " went on a lecture tour across the United States, starting in New York and going via Boston, Washington, Kansas, Iowa and Nebraska to California, lecturing on what he called Darwinism without any problems.      In his book  Darwinism  , Wallace had used the term pure-Darwinism which proposed a greater efficacy for ": null
    },
    {
        "natural selection": "natural selection"
    },
    {
        ". Wallace, Alfred Russel. . . Macmillan and Company. Heilbron, John L. . The Oxford Companion to the History of Modern Science. OUP USA. p. 203.  ": null
    },
    {
        "George Romanes": "george romanes"
    },
    {
        " dubbed this view as Wallaceism , noting that in contrast to Darwin, this position was advocating a pure theory of natural selection to the exclusion of any supplementary theory. Romanes, John George. . . Volume 2: Heredity and Utility. The Open Court Publishing Company. p. 12 Costa, James T. . Wallace, Darwin, and the Origin of Species. Harvard University Press. p. 274.  Taking influence from Darwin, Romanes was a proponent of both natural selection and the ": null
    },
    {
        "inheritance of acquired characteristics": "inheritance of acquired characteristics"
    },
    {
        ". The latter was denied by Wallace who was a strict selectionist. Bolles, R. C; Beecher, M. D. . Evolution and Learning. Psychology Press. p. 45.  Romanes definition of Darwinism conformed directly with Darwins views and was contrasted with Wallaces definition of the term. Elsdon-Baker, F. . Spirited dispute: the secret split between Wallace and Romanes. Endeavour 32: 75-78       The term Darwinism is often used in the United States by promoters of ": null
    },
    {
        "creationism": "creationism"
    },
    {
        ", notably by leading members of the ": null
    },
    {
        "intelligent design movement": "intelligent design movement"
    },
    {
        ", as an epithet to attack evolution as though it were an ideology of ": null
    },
    {
        "philosophical naturalism": "philosophical naturalism"
    },
    {
        ", or ": null
    },
    {
        "atheism": "atheism"
    },
    {
        ". ": null
    },
    {
        "Scott 2007": "petto  &  godfrey 2007"
    },
    {
        ", Creation Science Lite: Intelligent Design as the New Anti-Evolutionism, p.  For example, in 1993, ": null
    },
    {
        "UC Berkeley": "university of california, berkeley"
    },
    {
        " law professor and author ": null
    },
    {
        "Phillip E. Johnson": "phillip e. johnson"
    },
    {
        " made this accusation of atheism with reference to ": null
    },
    {
        "Charles Hodges": "charles hodgedarwinism"
    },
    {
        "1874 book What Is Darwinism?.  This paper was originally delivered as a lecture at a symposium at Hillsdale College, in November 1992. Papers from the Symposium were published in the collection Man and Creation: Perspectives on Science and Theology , by Hillsdale College Press, Hillsdale MI 49242. However, unlike Johnson, Hodge confined the term to exclude those like American botanist ": null
    },
    {
        "Asa Gray": "asa gray"
    },
    {
        " who combined Christian faith with support for Darwins natural selection theory, before answering the question posed in the books title by concluding: It is Atheism.  Paper for CH506: American Church History, Dr. Nathan Feldmeth, Winter Quarter 1997, written while a student in the School of World Mission at ": null
    },
    {
        "Fuller Theological Seminary": "fuller theological seminary"
    },
    {
        ", Pasadena, California.  Darwinism is an attempt to explain design without a designer , according to ": null
    },
    {
        "evolutionary biologist": "evolutionary biologist"
    },
    {
        " Francisco J. Ayala": "francisco j. ayala"
    },
    {
        ".      Creationists use pejoratively the term Darwinism to imply that the theory has been held as true only by Darwin and a core group of his followers, whom they cast as ": null
    },
    {
        "dogma": "dogma"
    },
    {
        "tic and inflexible in their belief.  In the 2008 documentary film  Expelled: No Intelligence Allowed , which promotes ": null
    },
    {
        "intelligent design": "intelligent design"
    },
    {
        " , American writer and actor ": null
    },
    {
        "Ben Stein": "ben stein"
    },
    {
        " refers to scientists as Darwinists. Reviewing the film for  Scientific American , ": null
    },
    {
        "John Rennie": "john rennie"
    },
    {
        " says The term is a curious throwback, because in modern biology almost no one relies solely on Darwins original ideas... Yet the choice of terminology isnt random: Ben Stein wants you to stop thinking of evolution as an actual science supported by verifiable facts and logical arguments and to start thinking of it as a dogmatic, atheistic ideology akin to ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        ".      However, Darwinism is also used neutrally within the scientific community to distinguish the ": null
    },
    {
        "modern evolutionary synthesis": "modern evolutionary synthesis"
    },
    {
        ", which is sometimes called ": null
    },
    {
        "neo-Darwinism": "neo-darwinism"
    },
    {
        " , from those first proposed by Darwin. Darwinism also is used neutrally by historians to differentiate his theory from other evolutionary theories current around the same period. For example, Darwinism may be used to refer to Darwins proposed mechanism of natural selection, in comparison to more recent mechanisms such as genetic drift and ": null
    },
    {
        "gene flow": "gene flow"
    },
    {
        ". It may also refer specifically to the role of Charles Darwin as opposed to others in the ": null
    },
    {
        "history of evolutionary thought": "history of evolutionary thought"
    },
    {
        "—particularly contrasting Darwins results with those of earlier theories such as ": null
    },
    {
        "Lamarckism": "lamarckism"
    },
    {
        " or later ones such as the modern evolutionary synthesis.     In political discussions in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", the term is mostly used by its enemies. Its a rhetorical device to make evolution seem like a kind of faith, like ": null
    },
    {
        "Maoism": "maoism"
    },
    {
        ", says ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        " biologist ": null
    },
    {
        "E. O. Wilson": "e. o. wilson"
    },
    {
        ". He adds, Scientists dont call it Darwinism.      In the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " the term often retains its positive sense as a reference to natural selection, and for example British atheist ": null
    },
    {
        "Richard Dawkins": "richard dawkins"
    },
    {
        " wrote in his collection of essays  A Devils Chaplain , published in 2003, that as a scientist he is a Darwinist.      In his 1995 book  Darwinian Fairytales , ": null
    },
    {
        "Australian": "australian"
    },
    {
        " philosopher ": null
    },
    {
        "David Stove": "david stove"
    },
    {
        "  used the term Darwinism in a different sense than the above examples. Describing himself as non-religious and as accepting the concept of natural selection as a well-established fact, Stove nonetheless attacked what he described as flawed concepts proposed by some Ultra-Darwinists. Stove alleged that by using weak or false  ad hoc  reasoning, these Ultra-Darwinists used evolutionary concepts to offer explanations that were not valid: for example, Stove suggested that the ": null
    },
    {
        "sociobiological": "sociobiology"
    },
    {
        " explanation of ": null
    },
    {
        "altruism": "altruism"
    },
    {
        " as an evolutionary feature was presented in such a way that the argument was effectively immune to any criticism. English philosopher ": null
    },
    {
        "Simon Blackburn": "simon blackburn"
    },
    {
        " wrote a rejoinder to Stove,  though a subsequent essay by Stoves protegé ": null
    },
    {
        "James Franklin": "james franklin"
    },
    {
        "  suggested that Blackburns response actually confirms Stoves central thesis that Darwinism can explain anything.       In ": null
    },
    {
        "evolutionary aesthetics": "evolutionary aesthetics"
    },
    {
        " theory, there is evidence that perceptions of beauty are determined by ": null
    },
    {
        "natural selection": "natural selection"
    },
    {
        " and therefore Darwinian; that things, aspects of people and landscapes considered beautiful are typically found in situations likely to give enhanced survival of the perceiving humans ": null
    },
    {
        "gene": "gene"
    },
    {
        "s. The Oxford Handbook for Aesthetics ": null
    }
]