[
    {
        "     In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        " a data link is the means of ": null
    },
    {
        "connecting one location to another": "telecommunications link"
    },
    {
        " for the purpose of transmitting and receiving digital information. It can also refer to a set of electronics assemblies, consisting of a transmitter and a receiver  and the interconnecting data ": null
    },
    {
        "telecommunication circuit": "telecommunication circuit"
    },
    {
        ". These are governed by a ": null
    },
    {
        "link protocol": "link protocol"
    },
    {
        " enabling digital data to be transferred from a data source to a ": null
    },
    {
        "data sink": "sink"
    },
    {
        ".     There are at least three types of basic data-link configurations that can be conceived of and used:   ": null
    },
    {
        "Simplex communication": "simplex communication"
    },
    {
        "s, most commonly meaning all communications in one direction only.   ": null
    },
    {
        "Half-duplex": "half-duplex"
    },
    {
        " communications, meaning communications in both directions, but not both ways simultaneously.   ": null
    },
    {
        "Duplex communications": "duplex"
    },
    {
        ", communications in both directions simultaneously.     In civil ": null
    },
    {
        "aviation": "aviation"
    },
    {
        ", a data-link system  is used to send information between aircraft and ": null
    },
    {
        "air traffic control": "air traffic control"
    },
    {
        "lers when an aircraft is too far from the ATC to make voice radio communication and ": null
    },
    {
        "radar": "radar"
    },
    {
        " observations possible. Such systems are used for aircraft crossing the ": null
    },
    {
        "Atlantic": "atlantic"
    },
    {
        " and ": null
    },
    {
        "Pacific": "pacific"
    },
    {
        " oceans. One such system, used by ": null
    },
    {
        "Nav Canada": "nav canada"
    },
    {
        " and ": null
    },
    {
        "NATS": "nats holdings"
    },
    {
        " over the North Atlantic, uses a five-digit data link sequence number confirmed between air traffic control and the pilots of the aircraft before the aircraft proceeds to cross the ocean. This system uses the aircrafts ": null
    },
    {
        "flight management computer": "flight management system"
    },
    {
        " to send location, speed and altitude information about the aircraft to the ATC. ATC can then send messages to the aircraft regarding any necessary change of course.     In ": null
    },
    {
        "unmanned aircraft": "unmanned aircraft"
    },
    {
        ", land vehicles, boats, and spacecraft, a two-way  data-link is used to send ": null
    },
    {
        "control signals": "control system"
    },
    {
        ", and to receive ": null
    },
    {
        "telemetry": "telemetry"
    }
]