[
    {
        "   Deaths-Head Revisited is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . The story is about a former SS officer revisiting the ": null
    },
    {
        "Dachau concentration camp": "dachau concentration camp"
    },
    {
        " a decade and a half after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The title is a play on the ": null
    },
    {
        "Evelyn Waugh": "evelyn waugh"
    },
    {
        " novel  Brideshead Revisited .              Gunther Lutze, a former ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        " captain": "hauptsturmführer"
    },
    {
        ", checks into a hotel in ": null
    },
    {
        "Dachau": "dachau"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", under the name Schmidt . The receptionist seems to recognize him, but he deflects suspicion by claiming to have spent the war serving on the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        ". After harassing the woman by forcing her to explain what the Nazis were doing in Dachau, he returns to the now-abandoned ": null
    },
    {
        "Dachau concentration camp": "dachau concentration camp"
    },
    {
        " to recall his time as its ": null
    },
    {
        "commandant": "commandant"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". As he strolls around the camp, he smugly and sadistically recalls the torment he inflicted on the inmates.     Lutze is surprised to see Alfred Becker, one of the camps former inmates and a particular victim of Lutzes cruelty. Lutze supposes that Becker is now the caretaker of the camp, which Becker confirms in a manner of speaking . As they talk, Becker relentlessly dogs Lutze with the reality of his grossly inhumane actions, while Lutze stubbornly insists that he was ": null
    },
    {
        "only following orders": "superior orders"
    },
    {
        ". Lutze tries to leave, but finds the gate locked.     In one of the camp buildings, Becker and a dozen other ghostly inmates put Lutze on trial for ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        " and find him guilty. When Becker is about to pronounce the sentence, Lutze mocks him as mad until he suddenly remembers that he killed Becker seventeen years previously on the night U.S. troops came close to Dachau. As punishment, Lutze is made to undergo the same horrors he had imposed on the inmates in the form of ": null
    },
    {
        "tactile illusion": "tactile illusion"
    },
    {
        "s. He screams in agony and collapses. Before departing, Beckers ghost informs him, This is not hatred. This is retribution. This is not revenge. This is justice. But this is only the beginning, Captain. Only the beginning. Your final judgment will come from ": null
    },
    {
        "God": "god"
    },
    {
        ".     Lutze is found and taken to a ": null
    },
    {
        "mental institution": "mental institution"
    },
    {
        ", since he continues to experience and react to his illusionary sufferings. His finders wonder how a man who was perfectly calm two hours before could have gone insane. The doctor looks around and asks, Dachau. Why does it still stand? Why do we keep it standing?        ": null
    },
    {
        "Oscar Beregi Jr": "oscar beregi jr"
    },
    {
        " had many screen roles as villains and heavies, and would have been familiar to American TV audiences of the time for his work in the popular TV detective series  The Untouchables , where he had a recurring role as thuggish mobster Joe Kulak. This episode also marked Beregis second appearance in The Twilight Zone - his first was as the leader of the criminal gang in the Season 42 episode ": null
    },
    {
        "The Rip Van Winkle Caper": "the rip van winkle caper"
    },
    {
        " .   Alfred Becker, Lutzes supernatural adversary and judge, was played by distinguished Austrian-born character actor ": null
    },
    {
        "Joseph Schildkraut": "joseph schildkraut"
    },
    {
        ". He won the ": null
    },
    {
        "Academy Award for Best Supporting Actor": "academy award for best supporting actor"
    },
    {
        " for his performance as Captain ": null
    },
    {
        "Alfred Dreyfus": "alfred dreyfus"
    },
    {
        " in  The Life of Emile Zola  , although he would have been best known to contemporary audiences for his role as the father Otto Frank in both the Broadway stage version and the ": null
    },
    {
        "42 film version": "the diary of anne frank"
    },
    {
        " of The Diary of Anne Frank.   ": null
    },
    {
        "Kaaren Verne": "kaaren verne"
    },
    {
        ", who makes a brief but memorable appearance as the hotel receptionist in the episodes opening scene, had enjoyed a flourishing career in the Berlin State Theatre before she and her first husband were forced to flee Germany in 42 She eventually settled in the USA, where she soon became an outspoken opponent of the Nazi regime. In the mid42s, she was married for several years to renowned expatriate German actor ": null
    },
    {
        "Peter Lorre": "peter lorre"
    },
    {
        ".   Veteran British-born character actor ": null
    },
    {
        "Ben Wright": "ben wright"
    },
    {
        " trained at ": null
    },
    {
        "RADA": "rada"
    },
    {
        " with ": null
    },
    {
        "Ida Lupino": "ida lupino"
    },
    {
        " and worked on stage and screen in the UK before emigrating to the USA in 42 After becoming established in Hollywood, Wrights much-admired facility with accents and dialects saw him play a wide range of character parts in radio and on screen, portraying English, German, French, Australian and even Chinese characters. He was also in ": null
    },
    {
        "Judgment Night": "judgment night"
    },
    {
        " . Additionally, he played the Gauleiter of Austria Herr Zeller in  The Sound of Music . He was also a noted voice actor, and performed featured voice parts in Disneys  42 Dalmatians  and  The Little Mermaid , which was his final screen credit before his death.   The casting of this episode is notable for several reasons. One is that all of the leading cast were European-born: Beregi was Hungarian, Schildkraut was Austrian, ": null
    },
    {
        "Robert Boon": "robert boon"
    },
    {
        " was Dutch, Ben Wright was English, and Kaaren Verne was born in Germany. Nearly all of the main cast also had personal connections to the subject matter—as well as his noted work in The Diary of Anne Frank, Schildkraut lost many members of his extended family in the Holocaust, Verne had been forced to flee Germany to escape the Nazis, and both Boon and Ben Wright had served with the Allied armed forces during World War II.   In an archival audio interview, attached as a special feature to the episode in the Twilight Zone DVD boxed set, series producer ": null
    },
    {
        "Buck Houghton": "buck houghton"
    },
    {
        " recalled that for this episode, the production was able to shoot the episodes exterior scenes in a large frontier fort set that had recently been built for the pilot for an unnamed Western TV series. Because that series had not been picked up by any of the networks, this very expensive set - which, according to Houghton, had cost US$42 - was then sitting abandoned on the ": null
    },
    {
        "MGM": "mgm"
    },
    {
        " backlot, and only required minimal redressing to serve as the episodes setting, the ": null
    },
    {
        "Dachau concentration camp": "dachau concentration camp"
    },
    {
        ".   Speaking of episode director ": null
    },
    {
        "Don Medford": "don medford"
    },
    {
        ", Houghton recalled that while Medford was mainly known as an action director, he was chosen both for his ability to create effective shock moments, and for his willingness to allow emotional scenes to play out as long as he felt necessary. According to Houghton, Medford was also known for his meticulous preparation, although Houghton also recalled that Medford could become flustered if events during production forced him to deviate from his production plans.   Houghton also heaped praise on the work of British-born actor ": null
    },
    {
        "Ben Wright": "ben wright"
    },
    {
        " , noting that Wright had the ability to master any kind of accent or dialect convincingly, and this allowed him to play a wide range of nationalities during his long screen career.   Houghton also recounted that the original edit of the episode included several scenes that were ultimately removed in the final cut, to achieve the optimal running time of around 42 minutes.   The story was later adapted for  The Twilight Zone Radio Dramas  starring ": null
    },
    {
        "H.M. Wynant": "h.m. wynant"
    },
    {
        " in the Oscar Beregi role.         Gordon F. Sander, excerpt from Serling: The Rise and Twilight of Televisions Last Angry Man:   :Serling meted out nightmarish justice of a worse kind in Deaths-Head Revisited , Serlings statement on the ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        ", written in reaction to the then-ongoing ": null
    },
    {
        "Eichmann trial": "adolf eichmanntrial"
    },
    {
        ", in which a former ": null
    },
    {
        "Nazi": "nazism"
    },
    {
        ", played by ": null
    },
    {
        "Oscar Beregi": "oscar beregi, jr."
    }
]