[
    {
        "           The word decadence, which at first meant simply decline in an abstract sense, is now most often used to refer to a perceived decay in ": null
    },
    {
        "standards": "social norm"
    },
    {
        ", ": null
    },
    {
        "morals": "morality"
    },
    {
        ", ": null
    },
    {
        "dignity": "dignity"
    },
    {
        ", ": null
    },
    {
        "religious faith": "religion"
    },
    {
        ", ": null
    },
    {
        "honor": "honor"
    },
    {
        ", ": null
    },
    {
        "discipline": "discipline"
    },
    {
        ", or ": null
    },
    {
        "skill": "competence"
    },
    {
        " at governing among the members of the elite of a very large social structure, such as an empire or nation state. By extension, it may refer to a decline in ": null
    },
    {
        "art": "art"
    },
    {
        ", ": null
    },
    {
        "literature": "literature"
    },
    {
        ", ": null
    },
    {
        "science": "science"
    },
    {
        ", ": null
    },
    {
        "technology": "technology"
    },
    {
        ", and ": null
    },
    {
        "work ethics": "workforce productivity"
    },
    {
        ", or to ": null
    },
    {
        "self-indulgent": "libertinism"
    },
    {
        " behavior.     Usage of the term sometimes implies moral censure, or an acceptance of the idea, met with throughout the world since ancient times, that such declines are objectively observable and that they inevitably precede the destruction of the society in question; for this reason, modern historians use it with caution. The word originated in Medieval Latin , appeared in 42th-century French, and entered English soon afterwards. It bore the neutral meaning of decay, decrease, or decline until the late 42th century, when the influence of new theories of ": null
    },
    {
        "social degeneration": "social degeneration"
    },
    {
        " contributed to its modern meaning.     In literature, the ": null
    },
    {
        "Decadent movement": "decadent movement"
    },
    {
        "—late nineteenth century  fin de siècle  writers who were associated with ": null
    },
    {
        "Symbolism": "symbolism"
    },
    {
        " or the ": null
    },
    {
        "Aesthetic movement": "aesthetic movement"
    },
    {
        "—was first given its name by hostile critics. Later it was triumphantly adopted by some of the writers themselves. The Decadents praised artifice over nature and sophistication over simplicity, defying contemporary discourses of decline by embracing subjects and styles that their critics considered morbid and over-refined. Some of these writers were influenced by the tradition of the ": null
    },
    {
        "Gothic novel": "gothic novel"
    },
    {
        " and by the poetry and fiction of ": null
    },
    {
        "Edgar Allan Poe": "edgar allan poe"
    },
    {
        ".               Decadence was the name given to a number of late nineteenth-century writers who valued artifice over the earlier Romantics naïve view of nature. Some of them triumphantly adopted the name, referring to themselves as Decadents. For the most part, they were influenced by the tradition of the ": null
    },
    {
        "Gothic novel": "gothic novel"
    },
    {
        " and by the poetry and fiction of ": null
    },
    {
        "Edgar Allan Poe": "edgar allan poe"
    },
    {
        ", and were associated with ": null
    },
    {
        "Symbolism": "symbolism"
    },
    {
        " and/or ": null
    },
    {
        "Aestheticism": "aestheticism"
    },
    {
        ".     This concept of decadence dates from the eighteenth century, especially from ": null
    },
    {
        "Montesquieu": "charles de secondat, baron de montesquieu"
    },
    {
        ", and was taken up by critics as a term of abuse after ": null
    },
    {
        "Désiré Nisard": "désiré nisard"
    },
    {
        " used it against ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        " and ": null
    },
    {
        "Romanticism": "romanticism"
    },
    {
        " in general. A later generation of Romantics, such as ": null
    },
    {
        "Théophile Gautier": "théophile gautier"
    },
    {
        " and ": null
    },
    {
        "Charles Baudelaire": "charles baudelaire"
    },
    {
        " took the word as a badge of pride, as a sign of their rejection of what they saw as banal progress. In the 42s, a group of ": null
    },
    {
        "French writers": "french literature"
    },
    {
        " referred to themselves as Decadents. The classic ": null
    },
    {
        "novel": "novel"
    },
    {
        " from this group is ": null
    },
    {
        "Joris-Karl Huysmans": "joris-karl huysmans"
    },
    {
        "  Against Nature , often seen as the first great decadent work, though others attribute this honor to Baudelaires works.     In Britain and Ireland the leading figure associated with the Decadent movement was Irish writer, ": null
    },
    {
        "Oscar Wilde": "oscar wilde"
    },
    {
        ". Other significant figures include ": null
    },
    {
        "Arthur Symons": "arthur symons"
    },
    {
        ", ": null
    },
    {
        "Aubrey Beardsley": "aubrey beardsley"
    },
    {
        " and ": null
    },
    {
        "Ernest Dowson": "ernest dowson"
    },
    {
        ".     The Symbolist movement has frequently been confused with the Decadent movement. Several young writers were derisively referred to in the press as decadent in the mid42s. ": null
    },
    {
        "Jean Moréas": "jean moréas"
    },
    {
        " manifesto was largely a response to this ": null
    },
    {
        "polemic": "polemic"
    },
    {
        ". A few of these writers embraced the term while most avoided it. Although the aesthetics of Symbolism and Decadence can be seen as overlapping in some areas, the two remain distinct.            This fertile culture of Berlin extended onwards until ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " rose to power in early 42 and stamped out any and all resistance to the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        ". Likewise, the Nazis decried Berlin as a haven of vice. A new ": null
    },
    {
        "culture": "culture"
    },
    {
        " developed in and around Berlin, including architecture and design , a variety of literature , film , painting , and music , criticism , philosophy/psychology , and fashion. This culture was often considered to be decadent, and socially, morally, destructive. Kirkus UK review of Laqueur, Walter Weimar: A cultural history, 4242     ": null
    },
    {
        "Film": "cinema of germany"
    },
    {
        " was making huge technical and artistic strides during this period of time in Berlin, and gave rise to the influential movement called ": null
    },
    {
        "German Expressionism": "german expressionism"
    },
    {
        ". ": null
    },
    {
        "Talkies": "talkies"
    },
    {
        " , the Sound films, were also becoming more popular with the general public across Europe, and Berlin was producing very many of them.     Berlin in the 42s also proved to be a haven for English writers such as ": null
    },
    {
        "W. H. Auden": "w. h. auden"
    },
    {
        ", ": null
    },
    {
        "Stephen Spender": "stephen spender"
    },
    {
        " and ": null
    },
    {
        "Christopher Isherwood": "christopher isherwood"
    },
    {
        ", who wrote a series of Berlin novels, inspiring the play  I Am a Camera , which was later adapted into a musical,  Cabaret , and an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " winning ": null
    },
    {
        "film of the same name": "cabaret"
    },
    {
        ". Spenders semi-autobiographical novel  The Temple  evokes the attitude and atmosphere of the place at the time.         According to ": null
    },
    {
        "Vladimir Lenin": "vladimir lenin"
    },
    {
        ", ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        " had reached its highest stage and could no longer provide for the general development of society. He expected reduced vigor in economic activity and a growth in unhealthy economic phenomena, reflecting capitalisms gradually decreasing capacity to provide for social needs and preparing the ground for ": null
    },
    {
        "socialist": "socialist"
    },
    {
        " revolution in the ": null
    },
    {
        "West": "western world"
    },
    {
        ". Politically, ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " proved the decadent nature of the advanced capitalist countries to Lenin, that ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        " had reached the stage where it would destroy its own prior achievements more than it would advance. .  Aufheben . Summer 42     One who directly opposed the idea of decadence as expressed by Lenin was ": null
    },
    {
        "José Ortega y Gasset": "josé ortega y gasset"
    },
    {
        " in  The Revolt of the Masses  . He argued that the ": null
    },
    {
        "mass man": "mass man"
    },
    {
        " had the notion of material progress and scientific advance deeply inculcated to the extent that it was an expectation. He also argued that contemporary progress was opposite the true decadence of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". Mora, José Ferrater . Ortega y Gasset: an outline of his philosophy. Bowes & Bowes. p. 42       Decadence is an important aspect of contemporary left ": null
    },
    {
        "communist": "communism"
    },
    {
        " theory. Similar to Lenins use of it, left communists, coming from the Communist International themselves started in fact with a theory of decadence in the first place, yet the communist left sees the theory of decadence at the heart of ": null
    },
    {
        "Marxs": "karl marx"
    },
    {
        " method as well, expressed in famous works such as  The Communist Manifesto ,  Grundrisse ,  Das Kapital  but most significantly in  Preface to the Critique of Political Economy . Marx, Karl . A Contribution to the Critique of Political Economy. Progress Publishers.     Contemporary left communist theory defends that Lenin was mistaken on his definition of imperialism and ": null
    },
    {
        "Rosa Luxemburg": "rosa luxemburg"
    },
    {
        " to be basically correct on this question, thus accepting capitalism as a world epoch similarly to Lenin, but a world epoch from which no capitalist state can oppose or avoid being a part of. On the other hand, the theoretical framework of capitalisms decadence varies between different groups while left communist organizations like the ": null
    },
    {
        "International Communist Current": "international communist current"
    },
    {
        " hold a basically ": null
    },
    {
        "Luxemburgist": "luxemburgist"
    },
    {
        " analysis that makes an emphasis on the world market and its expansion, others hold views more in line with those of ": null
    },
    {
        "Vladimir Lenin": "vladimir lenin"
    },
    {
        ", ": null
    },
    {
        "Nikolai Bukharin": "nikolai bukharin"
    },
    {
        " and most importantly ": null
    },
    {
        "Henryk Grossman": "henryk grossman"
    },
    {
        " and ": null
    },
    {
        "Paul Mattick": "paul mattick"
    },
    {
        " with an emphasis on monopolies and the falling ": null
    },
    {
        "rate of profit": "rate of profit"
    }
]