[
    {
        "      The Decca Navigator System was a ": null
    },
    {
        "hyperbolic": "hyperbolic navigation"
    },
    {
        " radio navigation": "radio navigation"
    },
    {
        " system which allowed ships and aircraft to determine their position by receiving radio signals from fixed navigational beacons. The system used phase comparison of two ": null
    },
    {
        "low frequency": "low frequency"
    },
    {
        " signals between 42 and 42 ": null
    },
    {
        "kHz": "kilohertz"
    },
    {
        ", as opposed to pulse timing systems like ": null
    },
    {
        "Gee": "gee"
    },
    {
        " and ": null
    },
    {
        "LORAN": "loran"
    },
    {
        ". This made it much easier to implement the receivers using 42s electronics, eliminating the need for a ": null
    },
    {
        "cathode ray tube": "cathode ray tube"
    },
    {
        ".     The system was invented in the US, but development was carried out by ": null
    },
    {
        "Decca": "decca records"
    },
    {
        " in the UK. It was first deployed by the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " when the Allied forces needed a system which could be used to achieve accurate landings and was not known to the Germans and thus free of jamming. After the war, it was extensively developed around the UK and later used in many areas around the world. Deccas primary use was for ship navigation in coastal waters, offering much better accuracy than the competing LORAN system. Fishing vessels were major post-war users, but it was also used on aircraft, including a very early application of ": null
    },
    {
        "moving map display": "moving map display"
    },
    {
        "s. The system was deployed extensively in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " and was used by helicopters operating to ": null
    },
    {
        "oil platform": "oil platform"
    },
    {
        "s.     The opening of the more accurate ": null
    },
    {
        "Loran-C": "loran-c"
    },
    {
        " system to civilian use in 42 offered stiff competition, but Decca was well established by this time and continued operations into the 42s. Decca was eventually replaced, along with Loran and similar systems, by the ": null
    },
    {
        "GPS": "global positioning system"
    },
    {
        " during the 42s. The Decca system in Europe was shut down in the spring of 42 and the last worldwide chain, in Japan, in 42              The Decca Navigator System consisted of a number of land-based radio beacons organised into chains. Each chain consisted of a ": null
    },
    {
        "master station": "master station"
    },
    {
        " and three secondary stations, termed Red, Green and Purple. Ideally, the secondaries would be positioned at the vertices of an equilateral triangle with the master at the centre. The baseline length, that is, the master-secondary distance, was typically .     Each station transmitted a continuous wave signal that, by comparing the ": null
    },
    {
        "phase": "phase"
    },
    {
        " difference of the signals from the master and one of the secondaries, resulted in a set of hyperbolic  lines of position  called a pattern. As there were three secondaries there were three patterns, termed Red, Green and Purple. The patterns were drawn on nautical charts as a set of hyperbolic lines in the appropriate colour. Receivers identified which ": null
    },
    {
        "hyperbola": "hyperbola"
    },
    {
        " they were on and a position could be plotted at the intersection of the ": null
    },
    {
        "hyperbola": "hyperbola"
    },
    {
        " from different patterns, usually by using the pair with the angle of cut closest to orthogonal as possible.       When two stations transmit at the ": null
    },
    {
        "phase-locked frequency": "phase-locked loop"
    },
    {
        ", the difference in phase between the two signals is constant along a hyperbolic path. Of course, if two stations transmit on the same frequency, it is practically impossible for the receiver to separate them; so instead of all stations transmitting at the same frequency, each chain was allocated a nominal frequency, 42f, and each station in the chain transmitted at a harmonic of this base frequency, as follows:          The frequencies given are those for Chain 42B, known as the English Chain, but all chains used similar frequencies between 42  kHz and 42  kHz.     Decca receivers multiplied the signals received from the Master and each Slave by different values to arrive at a common frequency  for each Master/Slave pair, as follows:          It was phase comparison at this common frequency that resulted in the hyperbolic lines of position. The interval between two adjacent hyperbolas on which the signals are in phase was called a lane. Since the wavelength of the common frequency was small compared with the distance between the Master and Slave stations there were many possible lines of position for a given phase difference, and so a unique position could not be arrived at by this method.     Other receivers, typically for aeronautical applications, divided the transmitted frequencies down to the basic frequency for phase comparison, rather than multiplying them up to the LCM frequency.       Early Decca receivers were fitted with three rotating Decometers that indicated the phase difference for each pattern. Each Decometer drove a second indicator that counted the number of lanes traversed & ndash; each 42 degrees of phase difference was one lane traversed. In this way, assuming the point of departure was known, a more or less distinct location could be identified.     The lanes were grouped into zones, with 42 green, 42 red, or 42 purple lanes in each zone. This meant that on the baseline the zone width was the same for all three patterns of a given chain. Typical lane and zone widths on the baseline are shown in the table below :          The lanes were numbered 42 to 42 for red, 42 to 42 for green and 42 to 42 for purple. The zones were labelled A to J, repeating after J. A Decca position coordinate could thus be written: Red I 42; Green D 42. Later receivers incorporated a microprocessor and displayed a position in latitude and longitude.       Multipulse provided an automatic method of lane and zone identification by using the same phase comparison techniques described above on lower frequency signals.     The nominally continuous wave transmissions were in fact divided into a 42-second cycle, with each station in turn simultaneously transmitting all four Decca frequencies in a phase-coherent relationship for a brief period of 42 seconds each cycle. This transmission, known as Multipulse, allowed the receiver to extract the 42f frequency and so to identify which lane the receiver was in .     As well as transmitting the Decca frequencies of 42f, 42f, 42f and 42f, an 42f signal, known as Orange, was also transmitted. The beat frequency between the 42f and 42f signals allowed a 42f signal to be derived and so resulted in a hyperbolic pattern in which one cycle of phase difference equates to 42 zones.     Assuming that one’s position was known to this accuracy, this gave an effectively unique position.       During daylight, ranges of around  could be obtained, reducing at night to 42 to , depending on propagation conditions.     The accuracy depended on:   Width of the lanes   Angle of cut of the hyperbolic lines of position   Instrumental errors   Propagation errors      By day these errors could range from a few meters on the baseline up to a nautical mile at the edge of coverage. At night, skywave errors were greater and, on receivers without multipulse capabilities, it was not unusual for the position to jump a lane, sometimes without the navigator knowing.     Although in the days of differential ": null
    },
    {
        "GPS": "global positioning system"
    },
    {
        " this range and accuracy may appear poor, in its day the Decca system was one of the few, if not the only, position fixing system available to many mariners. Since the need for an accurate position is less when the vessel is further from land, the reduced accuracy at long ranges was not a great problem.         In 42 William J. OBrien, an engineer, contracted ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " which put his career on hold for a period of two years. During this period he had the idea of position fixing by means of phase comparison of continuous wave transmissions. This was not the first such system, but OBrien apparently developed his version without knowledge of the others, and made several advancements in the art that would prove useful. He initially imagined the system being used for aircraft testing, specifically the accurate calculation of ground speed. Some experiments were carried out in California in 42 selecting frequencies with harmonic beats that would allow for station identification in a network of transmitters. Both the ": null
    },
    {
        "US Army": "us army"
    },
    {
        " and ": null
    },
    {
        "Navy": "us navy"
    },
    {
        " considered the idea too complicated and work ended in 42     O’Briens friend, Harvey F. Schwarz, was chief engineer of the ": null
    },
    {
        "Decca Record company": "decca records"
    },
    {
        " in England. In 42 O’Brien sent him details of the system so it could be put forward to the British military. Initially ": null
    },
    {
        "Robert Watson-Watt": "robert watson-watt"
    },
    {
        " reviewed the system but he did not follow it up, deeming it too easily jammed . However, in October 42 the British Admiralty Signal Establishment became interested in the system, which was then classified as Admiralty Outfit QM. O’Brien brought the Californian equipment to the UK and conducted the first marine trials between ": null
    },
    {
        "Anglesey": "anglesey"
    },
    {
        " and the ": null
    },
    {
        "Isle of Man": "isle of man"
    },
    {
        ", at frequencies of 42/42  kHz, on 42 September 42     Further trials were conducted in the northern ": null
    },
    {
        "Irish Sea": "irish sea"
    },
    {
        " in April 42 at 42/42  kHz. It was decided that the original frequencies were not ideal, and a new system using a 42  kHz inter-signal spacing was selected. This led to the common 42 42 42 and 42f frequencies, used throughout the life of the Decca system. 42f was reserved for a ": null
    },
    {
        "Loran-C": "loran-c"
    },
    {
        "-like extension, but never developed. A follow-up test was carried out in the ": null
    },
    {
        "Irish Sea": "irish sea"
    },
    {
        " in January 42 to test a wide variety of upgrades and production equipment. By this time the competing Gee system was known to the Admiralty and the two systems were tested head-to-head under the code names QM and QH. QM was found to have better sea-level range and accuracy, which led to its adoption.     A three-station trial was held in conjunction with a large-scale assault and landing exercise in the ": null
    },
    {
        "Moray Firth": "moray firth"
    },
    {
        " in February/March 42 The success of the trials and the relative ease of use and accuracy of the system resulted in Decca receiving an order for 42 Admiralty Outfit QM receivers. The receiver consisted of an electronics unit with two dials and was known to its operators as the Blue Gasmeter Job . A Decca chain was set up, consisting of a master station at ": null
    },
    {
        "Chichester": "chichester"
    },
    {
        " and slaves at ": null
    },
    {
        "Swanage": "swanage"
    },
    {
        " and ": null
    },
    {
        "Beachy Head": "beachy head"
    },
    {
        ". A fourth decoy transmitter was located in the ": null
    },
    {
        "Thames Estuary": "thames estuary"
    },
    {
        " as part of the deception that the invasion would be focussed on the ": null
    },
    {
        "Calais": "calais"
    },
    {
        " area.     42 minesweepers and other vessels were fitted with Admiralty Outfit QM and, on 42 June 42 42 of these ships used it to accurately navigate across the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " and to sweep the minefields in the planned areas. The swept areas were marked with buoys in preparation for the ": null
    },
    {
        "Normandy Landings": "normandy landings"
    },
    {
        ".     After the initial ship tests, Decca conducted tests in cars, driving in the ": null
    },
    {
        "Kingston By-Pass": "a3 road"
    },
    {
        " area to verify receiver accuracy. In the car installation, it was found possible to navigate within an individual traffic lane. The company entertained high hopes that the system could be used in aircraft, to permit much more precise navigation in the critical airspace around airports and urban centres where traffic density was highest.       After the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " the Decca Navigator Co. Ltd. was formed and the system expanded rapidly, particularly in areas of ": null
    },
    {
        "British influence": "british empire"
    },
    {
        "; at its peak it was deployed in many of the worlds major shipping areas. More than 42 receiving sets were in use aboard ships in 42 There were 42 chains around England, 42 in Ireland and 42 in Scotland, 42 in Scandinavia , a further 42 elsewhere in northern Europe and 42 in Spain.     In the late 42s an experimental Decca chain was set up in the United States, in the New York area, to be used for navigating the ": null
    },
    {
        "Vertol 42": "boeing vertol ch-46 sea knight"
    },
    {
        " helicopters of ": null
    },
    {
        "New York Airways": "new york airways"
    },
    {
        ". These helicopters were operating from the principal local airports—": null
    },
    {
        "Idlewild Airport": "john f. kennedy international airport"
    },
    {
        " on Long Island, ": null
    },
    {
        "Newark Airport": "newark liberty international airport"
    },
    {
        " in New Jersey, ": null
    },
    {
        "LaGuardia Airport": "laguardia airport"
    },
    {
        " in the Borough of Queens, nearer to Manhattan, and a site on the top of the ": null
    },
    {
        "PanAm Building": "metlife building"
    },
    {
        " on Park Avenue. Use of Decca was essential because its signals could be received down to sea level, were not subject to the line-of-sight limitations of ": null
    },
    {
        "VOR": "vhf omnidirectional range"
    },
    {
        "/": null
    },
    {
        "DME": "distance measuring equipment"
    },
    {
        " and did not suffer the slant-range errors that create problems with VOR/DME close to the transmitters. The Decca installations in the New York Airways helicopters included the unique Decca roller map displays that enabled the pilot to see his or her position at a glance, a concept infeasible with VOR/DME.     This chain installation was considered highly controversial at the time, for political reasons. This led to the U.S. Coast Guard, under instructions from the Treasury Department to which it reported, banning the use of Decca receivers in ships entering New York harbour for fear that the system might create a de facto standard . It also served to protect the marketing interests of the Hoffman Electronics division of ITT, a principal supplier of VOR/DME systems, that Decca might have been poised to usurp.     This situation was exacerbated by the workload problems of the Air Traffic Controllers Association , under its executive director Francis McDermott, whose members were forced to use radar data on aircraft positions, relaying those positions by radio to the aircraft from their control locations. An example of the problem, cited by experts, was the ": null
    },
    {
        "collision of a Douglas DC42 and a Lockheed Constellation over Staten Island, New York": "1960 new york mid-air collision"
    },
    {
        ",  that—according to some experts—could have been avoided if the aircraft had been Decca-equipped and could not only have determined their positions more precisely but would not have suffered from the rho-theta position errors inherent in VOR/DME.     Other chains were established in Japan ; Namibia and South Africa ; India and Bangladesh ; Canada ; North-West Australia ; the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        " and the Bahamas . Four chains were planned for Nigeria but only two were built and these did not enter into public service. Two chains in Vietnam were used during the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        " for helicopter navigation, with limited success.   During the Cold War period, following WWII, the R.A.F. established a confidential chain in Germany. The Master station was in ": null
    },
    {
        "Bad Iburg": "bad iburg"
    },
    {
        " near Osnabrück and there were two Slaves. The purpose of this chain was to provide accurate air navigation for the corridor between Western Germany and Berlin in the event that a mass evacuation of allied personnel may be required. In order to maintain secrecy, frequencies were changed at irregular intervals.               The headquarters of Decca Navigator were at New Malden, Surrey, just off the Kingston by-pass. There was a Decca School, at ": null
    },
    {
        "Brixham": "brixham"
    },
    {
        ", ": null
    },
    {
        "Devon": "devon"
    },
    {
        ", where employees were sent on courses from time to time. ": null
    },
    {
        "Racal": "racal"
    },
    {
        ", the UK weapons and communications company, acquired Decca in 42 Merging Deccas radar assets with their own, Racal began selling off the other portions of the company, including avionics and Decca Navigator.     A significant amount of income from the Decca system was due to the receivers being leased to users, not sold outright. This guaranteed predictable annual income. When the patents on the original technology lapsed in the early 42s, new receivers were quickly built by a number of companies. In particular, Aktieselskabet Dansk Philips  introduced receivers that could be purchased outright, and were much smaller and easier to use than the current Decca counterparts. The ap versions directly output the longitude and latitude to two decimals  instead of using the deco meter displays, offering accuracy better than ±42 m, much better than the Decca units. This also eliminated the need for the special charts printed with Decca lanes and zones.     Decca sued ap for infringement and, in the ensuing court battle, Decca lost the monopoly. That signalled the beginning of the end for the company. Income dwindled and eventually, the UK ": null
    },
    {
        "Ministry of Transport": "department for transport"
    },
    {
        " stepped in, having the ": null
    },
    {
        "lighthouse authorities": "trinity house"
    },
    {
        " take responsibility for operating the system in the early 42s.     A ruling from the European Union forced the UK government to withdraw funding. The ": null
    },
    {
        "general lighthouse authority": "general lighthouse authority"
    },
    {
        " ceased Decca transmissions at midnight on 42 March 42 The Irish chain provided by ": null
    },
    {
        "Bórd Iascaigh Mhara": "bord iascaigh mhara"
    },
    {
        " continued transmitting until 42 May 42 Japan continued operating their ": null
    },
    {
        "Hokkaidō": "hokkaidō"
    },
    {
        " chain until March 42 the last Decca chain in operation.           In the immediate post-war era, Decca began studying a long-range system like Decca, but using much lower frequencies to enable reception of ": null
    },
    {
        "skywave": "skywave"
    },
    {
        "s at long distances. In February 42 the company proposed a system with two main stations located at ": null
    },
    {
        "Shannon Airport": "shannon airport"
    },
    {
        " in Ireland and ": null
    },
    {
        "Gander International Airport": "gander international airport"
    },
    {
        " in ": null
    },
    {
        "Newfoundland": "newfoundland"
    },
    {
        " . Together, these stations would provide navigation over the main ": null
    },
    {
        "great circle route": "great circle route"
    },
    {
        " between London and New York. A third station in ": null
    },
    {
        "Bermuda": "bermuda"
    },
    {
        " would provide general ranging information to measure progress along the main track.     Work on this concept continued, and in 42 a modified version was presented that offered navigation over very wide areas. This was known as Delrac, short for Decca Long Range Area Cover . A further development, including features of the ": null
    },
    {
        "General Post Office": "general post office"
    },
    {
        "s ": null
    },
    {
        "POPI": "popi"
    },
    {
        " system, was introduced in 42 proposing 42 stations that provided worldwide coverage. The system was predicted to offer  accuracy at  range 42% of the time. Further development was ended in favour of the Dectra system.       In the early 42s the ": null
    },
    {
        "Radio Technical Commission for Aeronautics": "radio technical commission for aeronautics"
    },
    {
        " , as part of a wider ": null
    },
    {
        "ICAO": "icao"
    },
    {
        " effort, began the process of introducing a standard long-range radio navigation system for aviation use. Decca proposed a system that could offer both high-accuracy at short ranges and trans-Atlantic navigation with less accuracy, using a single receiver. The system was known as Dectra, short for Decca Track .     Unlike the Delrac system, Dectra was essentially the normal Decca Navigator system with the modification of several existing transmitter sites. These were located at the East Newfoundland and Scottish chains, which were equipped with larger antennas and high-power transmitters, broadcasting 42 times as much energy as normal chain stations. Given that the length of the chain baselines did not change, and were relatively short, at long distance the signal offered almost no accuracy. Instead, Dectra operated as a track system; aircraft would navigate by keeping themselves within the signal defined by a particular Decca lane.     The main advantage of Dectra compared to other systems being proposed for the RTCA solution was that it could be used for both medium-range navigation over land, as well as long-range navigation over the Altlantic. In comparison, the ": null
    },
    {
        "VOR/DME": "vor/dme"
    },
    {
        " system that ultimately won the competition offered navigation over perhaps a 42  mile radius, and could not offer a solution to the long-distance problem. Additionally, as the Decca system provided an X and Y location, as opposed to the angle-and-range VOR/DME, Decca proposed offering it with their Decca Flight Log moving map display to further improve ease of navigation. In spite of these advantages, the RTCA ultimately chose VOR/DME for two primary reasons; VOR offered coverage over about the same range as Decca, about 42  miles, but did so with a single transmitter instead of Deccas four, and Deccas frequencies proved susceptible to interference from static due to lightning, while VORs higher frequencies were not quite as sensitive.     Decca continued to propose that Dectra be used for the long-range role. In 42 they installed another transmitter in Iceland to provide ranging along the Scotland-Newfoundland track, with a second proposed to be installed on the ": null
    },
    {
        "Azores": "azores"
    },
    {
        ". They also installed Dectra receivers with Omnitrac computers and a lightweight version of the Flight Log on a number of commercial airliners, notably a ": null
    },
    {
        "BOAC": "boac"
    },
    {
        " Vickers VC42": "vickers vc10"
    },
    {
        ". The Omnitrac could take inputs from Decca , Loran-C, VOR/DME, an air data computer and doppler radars and combine them all to produce a lat/long output along with bearing, distance-to-go, bearing and an autopilot coupling. Dectra in Iceland , Decca Navigator News, October 42 Their efforts to standardize this were eventually abandoned as ": null
    },
    {
        "inertial navigation system": "inertial navigation system"
    },
    {
        "s began to be installed for these needs.       A more accurate system named Hi-Fix was developed using signalling in the 42  MHz range. It was used for specialised applications such as precision measurements involved with oil-drilling and by the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " for detailed mapping and surveying of coasts and harbours. The Hi-Fix equipment was leased for a period with temporary chains established to provide coverage of the area required, Hi-Fix was commercialised by Racal Survey in the early 42s. An experimental chain was installed with coverage of central London and receivers placed in London buses and other vehicles to demonstrate an early vehicle location and tracking system. Each vehicle would report its location automatically via a conventional VHF two-way radio link, the data added to a voice channel.     Another application was developed by the Bendix Pacific division of Bendix Corporation, with offices in North Hollywood, California, but not deployed: PFNS—Personal Field Navigation System—that would enable individual soldiers to ascertain their geographic position, long before this capability was made possible by the satellite-based GPS .     A further application of the Decca system was implemented by the U.S. Navy in the late 42s and early 42s for use in the Tongue of the Ocean/Eleuthera Sound area near The Bahamas, separating the islands of Andros and New Providence. The application was for sonar studies made possible by the unique characteristics of the ocean floor.     An interesting characteristic of the Decca VLF signal discovered on BOAC, later British Airways, test flights to Moscow, was that the carrier switching could not be detected even though the carrier could be received with sufficient strength to provide navigation. Such testing, involving civilian aircraft, is quite common and may well not be in the knowledge of a pilot.     The low frequency signalling of the Decca system also permitted its use on submarines. One enhancement of the Decca system was to offer the potential of keying the signal, using Morse code, to signal the onset of nuclear war. This option was never taken up by the UK government. Messages were clandestinely sent, however, between Decca stations thereby bypassing international telephone calls, especially in non-UK chains.       ": null
    },
    {
        "Puckeridge DECCA tower": "puckeridge decca tower"
    },
    {
        " Zeven DECCA-transmitter": "zeven decca-transmitter"
    }
]