[
    {
        "                 Deer are the ": null
    },
    {
        "hoof": "hoof"
    },
    {
        "ed ": null
    },
    {
        "ruminant": "ruminant"
    },
    {
        " mammal": "mammal"
    },
    {
        "s forming the ": null
    },
    {
        "family": "family"
    },
    {
        " Cervidae. The two main groups of deer are the ": null
    },
    {
        "Cervinae": "cervinae"
    },
    {
        ", including the ": null
    },
    {
        "muntjac": "muntjac"
    },
    {
        ", the ": null
    },
    {
        "elk": "elk"
    },
    {
        " , the ": null
    },
    {
        "fallow deer": "fallow deer"
    },
    {
        ", and the ": null
    },
    {
        "chital": "chital"
    },
    {
        "; and the ": null
    },
    {
        "Capreolinae": "capreolinae"
    },
    {
        ", including the ": null
    },
    {
        "reindeer": "reindeer"
    },
    {
        " , the ": null
    },
    {
        "roe deer": "roe deer"
    },
    {
        ", and the ": null
    },
    {
        "moose": "moose"
    },
    {
        ". Female reindeer, and male deer of all species except the Chinese ": null
    },
    {
        "water deer": "water deer"
    },
    {
        ", grow and shed new ": null
    },
    {
        "antler": "antler"
    },
    {
        "s each year. In this they differ from permanently ": null
    },
    {
        "horn": "horn"
    },
    {
        "ed ": null
    },
    {
        "antelope": "antelope"
    },
    {
        ", which are part of a different family  within the same order of ": null
    },
    {
        "even-toed ungulates": "even-toed ungulates"
    },
    {
        " .     The ": null
    },
    {
        "musk deer": "musk deer"
    },
    {
        "  of Asia and ": null
    },
    {
        "chevrotain": "chevrotain"
    },
    {
        "s  of tropical African and Asian forests are separate families within the ruminant clade . They are no more closely related to deer than are other even-toed ungulates.     Deer appear in art from ": null
    },
    {
        "Paleolithic": "paleolithic"
    },
    {
        " cave painting": "cave painting"
    },
    {
        "s onwards, and they have ": null
    },
    {
        "played a role in mythology": "deer in mythology"
    },
    {
        ", religion, and literature throughout history, as well as in ": null
    },
    {
        "heraldry": "heraldry"
    },
    {
        ". Their economic importance includes the use of their meat as ": null
    },
    {
        "venison": "venison"
    },
    {
        ", their skins as soft, strong ": null
    },
    {
        "buckskin": "buckskin"
    },
    {
        ", and their antlers as handles for knives. Deer hunting has been a popular activity since at least the Middle Ages and remains a resource for many families today.               Deer live in a variety of ": null
    },
    {
        "biome": "biome"
    },
    {
        "s, ranging from ": null
    },
    {
        "tundra": "tundra"
    },
    {
        " to the ": null
    },
    {
        "tropical rainforest": "tropical rainforest"
    },
    {
        ". While often associated with forests, many deer are ": null
    },
    {
        "ecotone": "ecotone"
    },
    {
        " species that live in transitional areas between forests and thickets and prairie and savanna . The majority of large deer species inhabit temperate mixed deciduous forest, mountain mixed coniferous forest, tropical seasonal/dry forest, and savanna habitats around the world. Clearing open areas within forests to some extent may actually benefit deer populations by exposing the ": null
    },
    {
        "understory": "understory"
    },
    {
        " and allowing the types of grasses, weeds, and herbs to grow that deer like to eat. Additionally, access to adjacent croplands may also benefit deer. However, adequate forest or brush cover must still be provided for populations to grow and thrive.     Deer are widely distributed, with indigenous representatives in all continents except Antarctica and Australia, though Africa has only one native deer, the ": null
    },
    {
        "Barbary stag": "barbary stag"
    },
    {
        ", a subspecies of ": null
    },
    {
        "red deer": "red deer"
    },
    {
        " that is confined to the ": null
    },
    {
        "Atlas Mountains": "atlas mountains"
    },
    {
        " in the northwest of the continent. However, ": null
    },
    {
        "fallow deer": "fallow deer"
    },
    {
        " have been introduced to South Africa. Small species of ": null
    },
    {
        "brocket deer": "brocket deer"
    },
    {
        " and ": null
    },
    {
        "pudú": "pudú"
    },
    {
        "s of Central and South America, and ": null
    },
    {
        "muntjac": "muntjac"
    },
    {
        "s of Asia generally occupy dense forests and are less often seen in open spaces, with the possible exception of the ": null
    },
    {
        "Indian muntjac": "indian muntjac"
    },
    {
        ". There are also several species of deer that are highly specialized, and live almost exclusively in mountains, grasslands, swamps, and wet savannas, or riparian corridors surrounded by deserts. Some deer have a circumpolar distribution in both North America and Eurasia. Examples include the ": null
    },
    {
        "caribou": "reindeer"
    },
    {
        " that live in Arctic tundra and taiga and ": null
    },
    {
        "moose": "moose"
    },
    {
        " that inhabit ": null
    },
    {
        "taiga": "taiga"
    },
    {
        " and adjacent areas. Huemul deer  of South Americas ": null
    },
    {
        "Andes": "andes"
    },
    {
        " fill the ecological niches of the ": null
    },
    {
        "ibex": "ibex"
    },
    {
        " and ": null
    },
    {
        "wild goat": "wild goat"
    },
    {
        ", with the fawns behaving more like goat kids.     The highest concentration of large deer species in temperate North America lies in the ": null
    },
    {
        "Canadian Rocky Mountain": "canadian rocky mountains"
    },
    {
        " and ": null
    },
    {
        "Columbia Mountain": "columbia mountains"
    },
    {
        " regions between Alberta and British Columbia where all five North American deer species  can be found. This region has several clusters of national parks including ": null
    },
    {
        "Mount Revelstoke National Park": "mount revelstoke national park"
    },
    {
        ", ": null
    },
    {
        "Glacier National Park ": "glacier national park"
    },
    {
        ", ": null
    },
    {
        "Yoho National Park": "yoho national park"
    },
    {
        ", and ": null
    },
    {
        "Kootenay National Park": "kootenay national park"
    },
    {
        " on the British Columbia side, and ": null
    },
    {
        "Banff National Park": "banff national park"
    },
    {
        ", ": null
    },
    {
        "Jasper National Park": "jasper national park"
    },
    {
        ", and ": null
    },
    {
        "Glacier National Park ": "glacier national park"
    },
    {
        " on the Alberta and Montana sides. Mountain slope habitats vary from moist coniferous/mixed forested habitats to dry subalpine/pine forests with alpine meadows higher up. The foothills and river valleys between the mountain ranges provide a mosaic of cropland and deciduous parklands. The rare woodland caribou have the most restricted range living at higher altitudes in the subalpine meadows and ": null
    },
    {
        "alpine tundra": "alpine tundra"
    },
    {
        " areas of some of the mountain ranges. Elk and mule deer both migrate between the alpine meadows and lower coniferous forests and tend to be most common in this region. Elk also inhabit river valley bottomlands, which they share with White-tailed deer. The White-tailed deer have recently expanded their range within the foothills and river valley bottoms of the Canadian Rockies owing to conversion of land to cropland and the clearing of coniferous forests allowing more deciduous vegetation to grow up the mountain slopes. They also live in the aspen parklands north of Calgary and Edmonton, where they share habitat with the moose. The adjacent ": null
    },
    {
        "Great Plains": "great plains"
    },
    {
        " grassland habitats are left to herds of elk, ": null
    },
    {
        "American bison": "american bison"
    },
    {
        ", and ": null
    },
    {
        "pronghorn": "pronghorn"
    },
    {
        " antelope.          The ": null
    },
    {
        "Eurasia": "eurasia"
    },
    {
        "n Continent boasts the most species of deer in the world, with most species being found in Asia. Europe, in comparison, has lower diversity in plant and animal species. However, many national parks and protected reserves in Europe do have populations of red deer, ": null
    },
    {
        "roe deer": "roe deer"
    },
    {
        ", and fallow deer. These species have long been associated with the continent of Europe, but also inhabit ": null
    },
    {
        "Asia Minor": "anatolia"
    },
    {
        ", the ": null
    },
    {
        "Caucasus Mountains": "caucasus mountains"
    },
    {
        ", and Northwestern ": null
    },
    {
        "Iran": "iran"
    },
    {
        ". European fallow deer historically lived over much of Europe during the Ice Ages, but afterwards became restricted primarily to the Anatolian Peninsula, in present-day ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ".     Present-day fallow deer populations in Europe are a result of historic man-made introductions of this species, first to the Mediterranean regions of Europe, then eventually to the rest of Europe. They were initially park animals that later escaped and reestablished themselves in the wild. Historically, Europes deer species shared their deciduous forest habitat with other herbivores, such as the extinct ": null
    },
    {
        "tarpan": "tarpan"
    },
    {
        " , extinct ": null
    },
    {
        "aurochs": "aurochs"
    },
    {
        " , and the endangered ": null
    },
    {
        "wisent": "wisent"
    },
    {
        " . Good places to see deer in Europe include the ": null
    },
    {
        "Scottish Highlands": "scottish highlands"
    },
    {
        ", the Austrian ": null
    },
    {
        "Alps": "alps"
    },
    {
        ", the wetlands between Austria, Hungary, and the Czech Republic and some fine National Parks, including ": null
    },
    {
        "Doñana National Park": "doñana national park"
    },
    {
        " in Spain, the ": null
    },
    {
        "Veluwe": "veluwe"
    },
    {
        " in the Netherlands, the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        " in Belgium, and ": null
    },
    {
        "Białowieża National Park": "białowieża forest"
    },
    {
        " of Poland. Spain, Eastern Europe, and the Caucasus Mountains still have virgin forest areas that are not only home to sizable deer populations but also for other animals that were once abundant such as the wisent, ": null
    },
    {
        "Eurasian lynx": "eurasian lynx"
    },
    {
        ", ": null
    },
    {
        "Iberian lynx": "iberian lynx"
    },
    {
        ", ": null
    },
    {
        "wolves": "gray wolf"
    },
    {
        ", and ": null
    },
    {
        "brown bear": "brown bear"
    },
    {
        "s.     The highest concentration of large deer species in temperate Asia occurs in the mixed deciduous forests, mountain coniferous forests, and taiga bordering North Korea, Manchuria , and the Ussuri Region . These are among some of the richest deciduous and coniferous forests in the world where one can find ": null
    },
    {
        "Siberian roe deer": "siberian roe deer"
    },
    {
        ", ": null
    },
    {
        "sika deer": "sika deer"
    },
    {
        ", elk, and moose. Asian caribou occupy the northern fringes of this region along the Sino-Russian border.     Deer such as the sika deer, ": null
    },
    {
        "Thorolds deer": "thorolds deer"
    },
    {
        ", ": null
    },
    {
        "Central Asian red deer": "central asian red deer"
    },
    {
        ", and elk have historically been farmed for their antlers by ": null
    },
    {
        "Han Chinese": "han chinese"
    },
    {
        ", ": null
    },
    {
        "Turkic peoples": "turkic peoples"
    },
    {
        ", ": null
    },
    {
        "Tungusic peoples": "tungusic peoples"
    },
    {
        ", ": null
    },
    {
        "Mongolia": "mongolia"
    },
    {
        "ns, and ": null
    },
    {
        "Koreans": "koreans"
    },
    {
        ". Like the ": null
    },
    {
        "Sami people": "sami people"
    },
    {
        " of Finland and Scandinavia, the Tungusic peoples, Mongolians, and Turkic peoples of Southern Siberia, Northern Mongolia, and the Ussuri Region have also taken to raising semi-domesticated herds of Asian caribou.     The highest concentration of large deer species in the tropics occurs in Southern Asia in Indias Indo-Gangetic Plain Region and Nepals Terai Region. These fertile plains consist of tropical seasonal moist deciduous, dry deciduous forests, and both dry and wet savannas that are home to ": null
    },
    {
        "chital": "chital"
    },
    {
        ", ": null
    },
    {
        "hog deer": "hog deer"
    },
    {
        ", ": null
    },
    {
        "barasingha": "barasingha"
    },
    {
        ", Indian ": null
    },
    {
        "sambar": "sambar deer"
    },
    {
        ", and ": null
    },
    {
        "Indian muntjac": "indian muntjac"
    },
    {
        ". Grazing species such as the endangered barasingha and very common chital are gregarious and live in large herds. Indian sambar can be gregarious but are usually solitary or live in smaller herds. Hog deer are solitary and have lower densities than Indian muntjac. Deer can be seen in several national parks in India, Nepal, and Sri Lanka of which ": null
    },
    {
        "Kanha National Park": "kanha national park"
    },
    {
        ", ": null
    },
    {
        "Dudhwa National Park": "dudhwa national park"
    },
    {
        ", and ": null
    },
    {
        "Chitwan National Park": "chitwan national park"
    },
    {
        " are most famous. Sri Lankas ": null
    },
    {
        "Wilpattu National Park": "wilpattu national park"
    },
    {
        " and ": null
    },
    {
        "Yala National Park": "yala national park"
    },
    {
        " have large herds of Indian sambar and chital. The Indian sambar are more gregarious in Sri Lanka than other parts of their range and tend to form larger herds than elsewhere.     The Chao Praya River Valley of Thailand was once primarily tropical seasonal moist deciduous forest and wet savanna that hosted populations of hog deer, the now-extinct ": null
    },
    {
        "Schomburgks deer": "schomburgks deer"
    },
    {
        ", ": null
    },
    {
        "Elds deer": "elds deer"
    },
    {
        ", Indian sambar, and Indian muntjac. Both the hog deer and Elds deer are rare, whereas Indian sambar and Indian muntjac thrive in protected national parks, such as ": null
    },
    {
        "Khao Yai": "khao yai national park"
    },
    {
        ". Many of these South Asian and Southeast Asian deer species also share their habitat with other ": null
    },
    {
        "herbivores": "herbivory"
    },
    {
        ", such as ": null
    },
    {
        "Asian elephant": "asian elephant"
    },
    {
        "s, the various Asian rhinoceros species, various antelope species , and wild oxen . One way that different herbivores can survive together in a given area is for each species to have different food preferences, although there may be some overlap.     Australia has six ": null
    },
    {
        "introduced species": "introduced species"
    },
    {
        " of deer that have established sustainable wild populations from ": null
    },
    {
        "acclimatisation society": "acclimatisation society"
    },
    {
        " releases in the 42th century. These are the fallow deer, red deer, sambar, hog deer, ": null
    },
    {
        "rusa": "javan rusa"
    },
    {
        ", and chital. Red deer introduced into New Zealand in 42 from English and Scottish stock were domesticated in ": null
    },
    {
        "deer farm": "deer farm"
    },
    {
        "s by the late 42s and are common farm animals there now. Seven other species of deer were introduced into New Zealand but none are as widespread as red deer.                                                                                                                                                      ": null
    }
]