[
    {
        "               Deftones is an American ": null
    },
    {
        "alternative metal": "alternative metal"
    },
    {
        " band from ": null
    },
    {
        "Sacramento": "sacramento, california"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ". It was formed in 42 by ": null
    },
    {
        "Chino Moreno": "chino moreno"
    },
    {
        " , ": null
    },
    {
        "Stephen Carpenter": "stephen carpenter"
    },
    {
        " , ": null
    },
    {
        "Abe Cunningham": "abe cunningham"
    },
    {
        " and Dominic Garcia . During their first five years, the bands lineup changed several times, but stabilized in 42 when Cunningham rejoined after his departure in 42; by this time, ": null
    },
    {
        "Chi Cheng": "chi cheng"
    },
    {
        " was bassist. The lineup remained stable for fifteen years, with the exception of keyboardist and turntablist ": null
    },
    {
        "Frank Delgado": "frank delgado"
    },
    {
        " being added in 42 The band is known as one of the most experimental groups to have come from the alternative metal scene, and are sometimes dubbed by critics as the ": null
    },
    {
        "Radiohead": "radiohead"
    },
    {
        " of metal .     Deftones have released eight albums since their inception. After the lineup settled in 42 the band secured a recording contract with ": null
    },
    {
        "Maverick Records": "maverick records"
    },
    {
        ", and subsequently released their debut album  Adrenaline  in 42 Promoting the album by touring exhaustively with other bands in the scene, Deftones managed to gain a dedicated fan base through word of mouth. Their sophomore album  Around the Fur  was released in 42 reached chart positions along with its singles, and became the bands first to receive certification from the ": null
    },
    {
        "RIAA": "riaa"
    },
    {
        ". The band found even further success with their third album  White Pony  , which saw a transition away from their earlier, more aggressive sound into a more experimental direction. Its lead single ": null
    },
    {
        "Change ": "change"
    },
    {
        " is the bands most commercially successful single, and the track ": null
    },
    {
        "Elite": "elite"
    },
    {
        " won a ": null
    },
    {
        "Grammy Award for Best Metal Performance": "grammy award for best metal performance"
    },
    {
        "; it was also the bands first of three albums to be certified platinum in the United States.     Their ": null
    },
    {
        "self-titled fourth album": "deftones"
    },
    {
        " was released in 42 While the groups critical success continued, sales proved to be lackluster compared to White Pony. The follow-up,  Saturday Night Wrist , was released in 42 after a temporary falling out within the band due to creative tensions. Its completion was also delayed by personal issues within the band, some of which influenced its material. In 42 while Deftones were working on an album tentatively titled  Eros , Cheng was involved in a traffic collision. As a result, he was left in a minimally conscious state until his death in 42 of ": null
    },
    {
        "cardiac arrest": "cardiac arrest"
    },
    {
        ". After Chengs accident, Deftones halted production on Eros. ": null
    },
    {
        "Quicksand": "quicksand"
    },
    {
        " bassist ": null
    },
    {
        "Sergio Vega": "sergio vega"
    },
    {
        ", who had filled in as a touring member to replace Cheng, later became his permanent replacement. The band released  Diamond Eyes  and  Koi No Yokan  in 42 and 42 respectively. Their latest release, titled  Gore , was released in 42         When ": null
    },
    {
        "Stephen Carpenter": "stephen carpenter"
    },
    {
        " was 42 years old, he was hit by a car while ": null
    },
    {
        "skateboarding": "skateboarding"
    },
    {
        ". Confined to a wheelchair for several months, he began teaching himself guitar by playing along to bands such as ": null
    },
    {
        "Anthrax": "anthrax"
    },
    {
        ", ": null
    },
    {
        "Stormtroopers of Death": "stormtroopers of death"
    },
    {
        " and ": null
    },
    {
        "Metallica": "metallica"
    },
    {
        ".  The driver supposedly paid Carpenter a cash settlement that allowed the band to purchase equipment,  but ": null
    },
    {
        "Abe Cunningham": "abe cunningham"
    },
    {
        " commented in a 42 interview that the story about the settlement was simply a myth about how our band was started. Interview with ": null
    },
    {
        "Abe Cunningham": "abe cunningham"
    },
    {
        ",  , January 42          Carpenter, Cunningham and ": null
    },
    {
        "Chino Moreno": "chino moreno"
    },
    {
        " were childhood friends. All three went to ": null
    },
    {
        "C. K. McClatchy High School": "c. k. mcclatchy high school"
    },
    {
        " in Sacramento and remained friends through the citys skateboarding scene. Carpenter was a fan of ": null
    },
    {
        "heavy metal": "heavy metal music"
    },
    {
        ", and Moreno was interested in ": null
    },
    {
        "hardcore punk": "hardcore punk"
    },
    {
        " bands such as ": null
    },
    {
        "Bad Brains": "bad brains"
    },
    {
        " and ": null
    },
    {
        "post-punk": "post-punk"
    },
    {
        " and ": null
    },
    {
        "new wave": "new wave"
    },
    {
        " bands such as ": null
    },
    {
        "Depeche Mode": "depeche mode"
    },
    {
        ".  When Moreno found out that Carpenter played guitar, he set up a ": null
    },
    {
        "jam session": "jam"
    },
    {
        " with Cunningham, who played drums, and the three began playing regularly in Carpenters garage around 42 They recruited bassist Dominic Garcia some time after, and the band became a four-piece. When Cunningham left Deftones to join ": null
    },
    {
        "Phallucy": "phallucy"
    },
    {
        ", another band from Sacramento, Garcia switched to drums.   ": null
    },
    {
        "Chi Cheng": "chi cheng"
    },
    {
        " joined to play bass, and the band recorded a four-track demo soon afterwards. John Taylor replaced Garcia on drums in 42 until Cunninghams return in 42 Within two years, the band began playing club shows and later expanded their gigging territory to San Francisco and Los Angeles, where they played shows alongside bands such as ": null
    },
    {
        "Korn": "korn"
    },
    {
        ". While closing for another band in L.A., after the majority of the audience had left, the band impressed a ": null
    },
    {
        "Maverick Records": "maverick records"
    },
    {
        " representative. They were signed to the label after performing three of their songs for ": null
    },
    {
        "Freddy DeMann": "freddy demann"
    },
    {
        " and ": null
    },
    {
        "Guy Oseary": "guy oseary"
    },
    {
        ". Deftones Rolling Stone, 42     Carpenter created the bands name by combining the ": null
    },
    {
        "hip hop": "hip hop"
    },
    {
        " slang term ": null
    },
    {
        "def": "wikt:defadjective"
    },
    {
        "  with the suffix -tones, .  The name is also a pun on the term ": null
    },
    {
        "tone deaf": "tone deaf"
    },
    {
        ".     Adrenaline      The bands debut album,  Adrenaline , was recorded at ": null
    },
    {
        "Bad Animals Studio": "bad animals studio"
    },
    {
        " in ": null
    },
    {
        "Seattle, Washington": "seattle, washington"
    },
    {
        " and released on October 42 42 It was produced by Deftones and ": null
    },
    {
        "Terry Date": "terry date"
    },
    {
        ", who would go on to produce the bands next three albums. While they were initially unsuccessful, the band built a dedicated fan base through extensive touring, word-of-mouth and Internet promotion. Through their efforts, Adrenaline went on to sell over 42 copies. It is regarded as an important part of the 42s ": null
    },
    {
        "nu metal": "nu metal"
    },
    {
        " movement.  . Retrieved on October 42th, 42   An early track which predated Adrenaline but did not make the albums final cut was Teething ; the band contributed the song to ": null
    },
    {
        "the soundtrack": "the crow: city of angels"
    },
    {
        " for the 42 film  The Crow: City of Angels . The band can also be seen performing the song live during one of the films scenes.      The album spent 42 weeks on the  Billboard Heatseekers  chart, reaching a peak position of 42  When asked what he attributed the albums success to, Cheng responded, One word: perseverance. Weve been together for almost eight years, on the road for two, and we do it with honesty and integrity—and the kids can tell . Deftones  Guitar World Online  – Guitar School, 42 The album was certified gold by the ": null
    },
    {
        "RIAA": "riaa"
    },
    {
        " on July 42 42 and was certified platinum on September 42 42      Regarding the recording of the album, Cunningham said, At the time we did the first record—which I really like and think is good—you can tell the band was really young. Wed been playing most of those songs for quite a while, and we were just so happy to be making a record that we didnt really think a whole lot about making the songs better . Peiken, Matt. Interview with Abe Cunningham,  Modern Drummer , 42 Moreno felt that Adrenaline was recorded really fast and performed all his vocals live with the band in the room using a hand-held ": null
    },
    {
        "Shure SM42": "shure sm58"
    },
    {
        " microphone. Walkling, Dennis. Chillin with Chino: Deftones get Moody,  Circus , June 42 ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        "s review of Adrenaline praised the albums musical control, precision, overall groove and Cunninghams surprisingly sophisticated drumming . It was also noted that there is a bit of sameness in Chino Morenos whispered vocal melodies, which drags the record down a bit .      Around the Fur  Around the Fur , was recorded at Studio Litho in ": null
    },
    {
        "Seattle, Washington": "seattle, washington"
    },
    {
        " and produced by Date. Released on October 42 42 the album was dedicated to Dana Wells, the late stepson of the singer ": null
    },
    {
        "Max Cavalera": "max cavalera"
    },
    {
        " of ": null
    },
    {
        "Sepultura": "sepultura"
    },
    {
        ", ": null
    },
    {
        "Soulfly": "soulfly"
    },
    {
        " and ": null
    },
    {
        "Cavalera Conspiracy": "cavalera conspiracy"
    },
    {
        ". Cavalera also collaborated on Headup , a tribute to Wells. Interview with Chino Moreno and Max Cavalera,  Metal Hammer , September 42 Although not yet a member of the band, Delgado was credited as audio on five of the albums tracks. Cunninghams wife, Annalynn, provided guest vocals on MX .      When we went in to make this record, we really didnt have a set idea of what we wanted to come out with , said Moreno in a 42 interview with Chart magazine. However, he felt that the album fell into place once the band had settled into the studio. Bromley, Adrian. Keeping It Simple,  Chart , July 42 The band expanded its sound, spending more time with Date and giving more thought to the albums production. Cunningham varied his drum sound and experimented by using different types of ": null
    },
    {
        "snare drum": "snare drum"
    },
    {
        " on almost every track. The album was praised for its loud-soft ": null
    },
    {
        "dynamics": "dynamics"
    },
    {
        ", the flow of the tracks, Morenos unusual vocals, and the strong rhythm-section performance of Cheng and Cunningham. Smith, Matt. Deftones New Album Stays Heavy,  , 42 Glover, Adrian Gregory. Deftones: Running on Pure Passion,  Circus , May 42 ": null
    },
    {
        "Stephen Thomas Erlewine": "stephen thomas erlewine"
    },
    {
        "s review noted that while they dont have catchy riffs or a fully developed sound, Around the Fur suggests theyre about to come into their own .      Around the Fur propelled the band to fame in the alternative metal scene on the strength of radio and MTV airplay for the singles ": null
    },
    {
        "My Own Summer ": "my own summer"
    },
    {
        " and ": null
    },
    {
        "Be Quiet and Drive ": "be quiet and drive"
    },
    {
        " . Around the Fur sold 42 copies in its first week of release, and entered the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " at No. 42 , remaining on the charts for 42 weeks.  The band went back to touring, making appearances at the ": null
    },
    {
        "Warped Tour": "warped tour"
    },
    {
        " , ": null
    },
    {
        "Pinkpop Festival": "pinkpop festival"
    },
    {
        ", ": null
    },
    {
        "Roskilde Festival": "roskilde festival"
    },
    {
        " and ": null
    },
    {
        "Ozzfest": "ozzfest"
    },
    {
        " as well as releasing ": null
    },
    {
        "a live EP": "deftones"
    },
    {
        " on June 42 42 Around the Fur went on to reach RIAA gold status on June 42 42 and platinum status on June 42 42 My Own Summer appeared on  The Matrix: Music from the Motion Picture , released March 42 42      White Pony      On June 42 42 the band released their third album,  White Pony , again produced by Date and Deftones. It was recorded at ": null
    },
    {
        "The Plant Recording Studios": "record plant"
    },
    {
        " in ": null
    },
    {
        "Sausalito, California": "sausalito, california"
    },
    {
        " and at Larrabee Sound Studios, ": null
    },
    {
        "West Hollywood, California": "west hollywood, california"
    },
    {
        ". The album debuted at No. 42 on the U.S. Billboard chart with sales of 42 copies. Delgado, now a full-time band member, added new elements to the bands music. The melancholy Teenager , for example, was a departure in style and mood, a ": null
    },
    {
        "love song": "love song"
    },
    {
        " , according to Moreno.  Programming duties were carried out by DJ Crook, a friend of Moreno . Passenger was a collaboration with singer ": null
    },
    {
        "Maynard James Keenan": "maynard james keenan"
    },
    {
        " of ": null
    },
    {
        "Tool": "tool"
    },
    {
        ", and the refrain in Knife Prty featured vocals by Rodleen Getsic. Moreno also started contributing additional guitar work.           An interview with the band in  Alternative Press  described the recording process of White Pony. After a break from touring, the band spent four months in the studio writing and recording it, the longest amount of time they had dedicated to an album thus far. Moreno said that the majority of this time was spent trying to write songs, and that the writing of ": null
    },
    {
        "Change ": "change"
    },
    {
        " was the turning point where the band began working as a unit. Despite being pressured to release the album sooner, the band decided to take their time. Cheng explained, We didnt feel like we had anything to lose, so we made the record we wanted to make. Moreno did not have an overall lyrical theme in mind, but made a conscious decision to bring an element of fantasy into his lyrics: I basically didnt sing about myself on this record. I made up a lot of story lines and some dialogue, even. I took myself completely out of it and wrote about other things . Deftones  – Ride On  Alternative Press , August 42     Reviews were generally positive, commenting on Morenos increasing sophistication as a lyricist and the groups experimentalism.  Allmusics review said that Deftones went soft, but in an impressive way, to twist around its signature ": null
    },
    {
        "punk": "punk rock"
    },
    {
        " thrash": "crossover thrash"
    },
    {
        " sound .      The album was originally released as an 42-track edition beginning with Feiticeira and ending with Pink Maggit , and featuring gray cover art. A limited-edition print of 42 black-and-red jewel case versions of White Pony was released at the same time with a bonus twelfth track titled The Boys Republic .  Later, the band released ": null
    },
    {
        "Back to School ": "back to school"
    },
    {
        " , a rap-influenced interpretation of Pink Maggit . The song was released as a single and included as the new opening track of a re-released White Pony on October 42 42 The new release still had Pink Maggit as the final track and featured altered white cover art. Not entirely happy with re-releasing the album, the band negotiated to have Back to School made available as a free download for anyone who had already bought the original album. Moreno noted that Everybodys already downloaded our record before it came out anyway, otherwise Id be kind of feelin like, Man, why we putting all these different versions of the record? thats the best way we can actually get this song out to the people who already purchased this record, for free basically. And if they wanna buy the record again, its cool .      White Pony achieved platinum status on July 42 42 selling over 42 million copies in the US, and earning the band a 42 ": null
    },
    {
        "Grammy Award for Best Metal Performance": "grammy award for best metal performance"
    },
    {
        " for the song ": null
    },
    {
        "Elite": "elite"
    },
    {
        " .      Deftones      Deftones began work on their fourth album under the ": null
    },
    {
        "working title": "working title"
    },
    {
        " Lovers.  Regarding the albums direction, Cheng commented, Weve proven that we can musically go in any direction we want, and we want to get kind of heavy on this one .  Moreno underwent vocal training as a precaution after severely damaging his ": null
    },
    {
        "vocal cords": "vocal folds"
    },
    {
        " on the bands 42 summer tour. The band converted their rehearsal space in Sacramento into a fully equipped studio and recorded most of the album there at negligible cost. The band brought in Date to assist with production and also received input on musical arrangement from ": null
    },
    {
        "Greg Wells": "greg wells"
    },
    {
        " on several of the albums tracks. The band later added more material at Studio X in Seattle, Washington and at Larrabee Sound Studios. Overall, the album took 42 months and cost roughly $42 million to complete.   The band was fined by Maverick for missing deadlines.      In January 42 Deftones left the studio to perform several one-off shows in Australia and New Zealand as part of the annual ": null
    },
    {
        "Big Day Out": "big day out"
    },
    {
        " festival.  Shortly after, the band returned to the studio to finish their fourth album. The self-titled  Deftones  was released on May 42 42 It entered the Billboard 42 at No. 42 and sold 42 copies in its first week.  The album remained in the Billboard Top 42 for nine weeks, supported by the first single, ": null
    },
    {
        "Minerva": "minerva"
    },
    {
        " .  The band shot a video for the albums second single, ": null
    },
    {
        "Hexagram": "hexagram"
    },
    {
        " , with fans watching the band play the song in an indoor ": null
    },
    {
        "skatepark": "skatepark"
    },
    {
        " in ": null
    },
    {
        "Simi Valley, California": "simi valley, california"
    },
    {
        ".      Reviews were mainly positive, praising the band for the albums progression and originality in the midst of declining creativity in contemporary metal.  Moreno was quoted as saying, Its all on record. We told motherfuckers not to lump us in with ": null
    },
    {
        "nu metal": "nu metal"
    },
    {
        " because when those bands go down we arent going to be with them . In reviewing Deftones, Stephen Thomas Erlewine wrote that Hexagram , the albums opener, hits hard—harder than they ever have, revealing how mushy ": null
    },
    {
        "Staind": "staind"
    },
    {
        " is, or how toothless ": null
    },
    {
        "Linkin Park": "linkin park"
    },
    {
        " is . He also went on to say, however, that the album sticks a little too close to familiar territory .   The A.V. Club  similarly called the album less rewarding than its predecessor, though its peaks rival any in the genre .      The band released a compilation album titled B-Sides & Rarities on October 42 42 The CD includes various ": null
    },
    {
        "B-side": "b-side"
    },
    {
        "s and ": null
    },
    {
        "covers": "cover version"
    },
    {
        " from throughout their career, while the DVD contains behind-the-scenes footage and the bands complete videography up to that point.     Saturday Night Wrist      Rather than work with Date, their producer for many years, Deftones decided to record with ": null
    },
    {
        "Bob Ezrin": "bob ezrin"
    },
    {
        " on their fifth studio album. Cunningham said that while the group enjoyed working with Date, at this point, we just needed to change things up And this is definitely a different style. Working with him is just putting us fucking upside down. Hes cracking the whip .  After recording all the instrumental parts for the record, Moreno decided to record his vocals separately, and finished recording the album with former ": null
    },
    {
        "Far": "far"
    },
    {
        " guitarist ": null
    },
    {
        "Shaun Lopez": "shaun lopez"
    },
    {
        " as producer.  According to an interview with Abe Cunningham, there were tensions involved with the recording of Saturday Night Wrist that were related to the band members personal lives. Cunningham compared the process to pulling teeth.      The band released the album, titled  Saturday Night Wrist , on October 42 42 It debuted at No. 42 on the U.S. Billboard chart with sales of just over 42,  a significant decrease in the first-week sales of their two previous releases. The albums first single, ": null
    },
    {
        "Hole in the Earth": "hole in the earth"
    },
    {
        " , was released on September 42 42  It was later featured as downloadable content for the ": null
    },
    {
        "PlayStation 42": "playstation 3"
    },
    {
        " and ": null
    },
    {
        "Xbox 42": "xbox 360"
    },
    {
        " versions of  Guitar Hero 42 .  ": null
    },
    {
        "Mein": "mein"
    },
    {
        " was the albums second single, which was released on March 42 42  Collaborations on the record include ": null
    },
    {
        "Annie Hardy": "annie hardy"
    },
    {
        " from ": null
    },
    {
        "Giant Drag": "giant drag"
    },
    {
        " on the song Pink Cellphone and ": null
    },
    {
        "Serj Tankian": "serj tankian"
    },
    {
        " from ": null
    },
    {
        "System of a Down": "system of a down"
    },
    {
        " on the track Mein .     Deftones spent the majority of 42 and 42 touring around the world in support of the album, performing in North America, Europe, South America, Japan and Australia. The band also performed on such tours as ": null
    },
    {
        "Taste of Chaos": "taste of chaos"
    },
    {
        ",  ": null
    },
    {
        "Family Values Tour": "family values tour 2006"
    },
    {
        "  and the ": null
    },
    {
        "Soundwave Festival": "australian soundwave festival"
    },
    {
        ".      Eros sessions and Chengs car accident         In the fall of 42 Deftones started writing songs for what was planned to be their sixth studio album,  Eros . Moreno described the album as unorthodox and aggressive. Recording started on April 42 42      On November 42 42 Cheng was seriously injured in a car accident in ": null
    },
    {
        "Santa Clara, California": "santa clara, california"
    },
    {
        ". As a result of the injuries sustained in the crash, he remained in a ": null
    },
    {
        "minimally conscious state": "minimally conscious state"
    },
    {
        ". Following the accident, Chengs bandmates and his mother, Jeanne, began using the Deftones blog to post updates on Chengs condition. On December 42 42 it was announced that Cheng had been moved into the care of an unnamed hospital that specializes in the care and management of traumatic and non-trauma related brain injuries.      In late January 42 the band released a new statement, stating that our fallen comrade has not yet made significant progress , and that a friend of the band, ": null
    },
    {
        "Sergio Vega": "sergio vega"
    },
    {
        " , would be taking over as bassist in Chengs absence, as he had done temporarily in 42  On April 42 the band played their first show without Cheng since 42 at the ": null
    },
    {
        "Bamboozle Left": "bamboozle left"
    },
    {
        " festival in ": null
    },
    {
        "Irvine, California": "irvine, california"
    },
    {
        ".      On June 42 42 Deftones announced on their official website that Eros would be delayed indefinitely, saying, As we neared completion on Eros, we realized that this record doesnt best encompass and represent who we are currently as people and as musicians. And although those songs will see the light of day at some point, we collectively made the decision that we needed to take a new approach, and with Chis condition heavy on our minds while doing so. We needed to return to the studio to do what we felt was right artistically . They also said, The decision to hold off on releasing Eros has no connection with Chis condition or anything associated. This was, and is, purely a creative decision by the band to write, record, and deliver an amazing product .      Korn members ": null
    },
    {
        "Brian Head Welch": "brian   head   welch"
    },
    {
        " and ": null
    },
    {
        "Reginald Fieldy Arvizu": "reginald arvizu"
    },
    {
        ", along with members of ": null
    },
    {
        "Sevendust": "sevendust"
    },
    {
        ", ": null
    },
    {
        "Slipknot": "slipknot"
    },
    {
        " and other alternative metal bands, recorded and released ": null
    },
    {
        "A Song for Chi": "a song for chi"
    },
    {
        " , with proceeds benefiting Cheng and his family.  To aid in the fundraising for the Cheng family, the band announced two 42 benefit shows in Los Angeles.      A website—One Love for Chi—was launched by Deftones fan Gina Blackmore on March 42 42 about four months after Chengs accident. The site served as a platform for updates and information on Chengs condition, as well as serving as an auction site for items donated by friends of the band. All proceeds raised by the website were donated to his family so they could provide him the best possible medical care.      Diamond Eyes  Diamond Eyes , was originally scheduled for release on April 42 42; this date was later pushed back to May 42 In March, it was announced that the album had leaked onto the Internet, and the albums release date was moved forward to May 42 as a result.  On February 42 42 the albums first single, ": null
    },
    {
        "Rocket Skates": "rocket skates"
    },
    {
        " , was made available for free download at www.gunsrazorsknives.com.   The album was produced by ": null
    },
    {
        "Nick Raskulinecz": "nick raskulinecz"
    },
    {
        ".          On March 42 Deftones debuted their first radio-ready single, ": null
    },
    {
        "Diamond Eyes": "diamond eyes"
    },
    {
        " . Both Diamond Eyes and Rocket Skates received positive reviews from fans and critics, with many making comparisons of the two singles style and sound to that of material from the Around the Fur album.      Teaming up with bands ": null
    },
    {
        "Mastodon": "mastodon"
    },
    {
        " and Alice in Chains, Deftones went on tour in the fall of 42 in the United States and Canada. The tour was called ": null
    },
    {
        "Blackdiamondskye": "blackdiamondskye"
    },
    {
        ", a ": null
    },
    {
        "portmanteau": "portmanteau"
    },
    {
        " of the three bands latest albums . The tour included a limited edition series of silk-screened art prints promoting each show individually, created by the poster artist ": null
    },
    {
        "Jermaine Rogers": "jermaine rogers"
    },
    {
        ". Rogers has created a majority of the Deftones concert poster and print artwork since the late 42s.      On April 42 42 in honor of ": null
    },
    {
        "Record Store Day": "record store day"
    },
    {
        ", the band released an LP titled  Covers , containing several cover songs that the band had recorded over the years, including ": null
    },
    {
        "Drive": "drive"
    },
    {
        " , ": null
    },
    {
        "If Only Tonight We Could Sleep": "if only tonight we could sleep"
    },
    {
        "  and ": null
    },
    {
        "No Ordinary Love": "no ordinary love"
    },
    {
        " .  On October 42 Deftones released The Vinyl Collection 42–42 in a limited edition of 42 copies.     Koi No Yokan and Chengs death ": null
    },
    {
        "ESP Guitars": "esp guitars"
    },
    {
        "s ": null
    },
    {
        "YouTube": "youtube"
    },
    {
        " channel.  It was reported that Raskulinecz would return to produce their as-yet-unnamed seventh studio album.      It was also reported that the band would be recording several B-sides for the album, including an ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        " cover and possibly an ": null
    },
    {
        "Earth, Wind, and Fire": "earth, wind, and fire"
    },
    {
        " cover.  It was later announced that there would be no bonus tracks.  On July 42 Deftones performed a brand-new song titled Rosemary and also debuted another track titled Roller Derby .   Koi No Yokan  was announced on August 42 42  and released on November 42 42 by ": null
    },
    {
        "Reprise Records": "reprise records"
    },
    {
        ".     On April 42 42 despite making a partial recovery and returning home, Cheng died in a hospital in his hometown of Stockton, California, after falling into cardiac arrest. It had been nearly four-and-a-half years since the 42 accident.   Moreno announced in May that the album Eros, shelved in 42 after Chengs accident, was now more likely to be released following his death.      Gore and upcoming ninth studio album      In March 42 while Moreno was touring with his side project ": null
    },
    {
        "Crosses": "crosses"
    },
    {
        ", in support of their ": null
    },
    {
        "self-titled debut album": "crosses"
    },
    {
        ", the rest of Deftones began writing a follow-up to Koi No Yokan.  Deftones also previously reported that they intended to record a new album either in late 42 or early 42      On April 42 42 the first anniversary of Chengs death, Deftones released a track from Eros titled Smile on YouTube,  the first officially released material from the long-shelved album. The video was removed by ": null
    },
    {
        "Warner Music Group": "warner music group"
    },
    {
        " two days later due to copyright infringement, despite the track having been uploaded by Moreno.  Although the track has again been made available, it remains the only recording to be released from the Eros sessions to date.      In late February 42 just after the band had finished the new albums drum tracks, Moreno told  Rolling Stone  that Deftones had written 42 songs during the albums sessions. He described the album as a little more of a heady record than the previous album.  On May 42 42 Moreno was interviewed by  Kerrang!  about the new album, which he described as having a lot of different moods . He further explained that it was not a happy record , but also not a completely angry record .  Despite reports of Carpenters initial difficulty getting into the feel of the album, band members have noted the albums distinct collaborative nature.  Vega utilized a six-string bass when recording the new material, helping to push the band into new sonic territory.  After producing their previous two records with Raskulinecz, Deftones worked with a new producer, ": null
    },
    {
        "Matt Hyde": "matt hyde"
    },
    {
        ".      The album was pushed back multiple times from its originally scheduled September 42 release date.    On February 42 42 the band released the first single from Gore, titled Prayers/Triangles . Monroe, Jazz  . Pitchfork. Retrieved on February 42 42 Doomed User and Hearts/Wires were also made available ahead of the albums release, on March 42 and April 42 respectively.   Gore was officially released on April 42 42 The second official single, Phantom Bride , was released on June 42  The song featured a ": null
    },
    {
        "guitar solo": "guitar solo"
    },
    {
        " by ": null
    },
    {
        "Alice in Chains": "alice in chains"
    },
    {
        " guitarist ": null
    },
    {
        "Jerry Cantrell": "jerry cantrell"
    },
    {
        "; this is considered unusual for a Deftones song.      In 42 Chino Moreno revealed that Deftones had begun writing material for a new album, which he stated hoped would be out sometime in 42 Chino went on to state that the band would be going in a different direction than they had on Gore and that he would be taking a step back from leading the song writing to allow Stephen Carpenter and Abe Cunningham to be more involved in the material on the new album. In May 42 Chino was again asked about the new material and he stated the songs were considerably heavier than those on Gore.        Although initially rooted in heavy metal, Deftones have always claimed diverse influences from groups of various genres, with their musical style diversifying over their career.  Their sound has been described as alternative metal, ": null
    },
    {
        "art rock/art metal": "art rock"
    },
    {
        ", ": null
    },
    {
        "experimental rock": "experimental rock"
    },
    {
        ", ": null
    },
    {
        "nu metal": "nu metal"
    },
    {
        ", ": null
    },
    {
        "post-punk": "post-punk"
    },
    {
        ", , ": null
    },
    {
        "dream pop": "dream pop"
    },
    {
        ", ": null
    },
    {
        "drone rock": "drone music"
    },
    {
        ", ": null
    },
    {
        "post-metal": "post-metal"
    },
    {
        ", ": null
    },
    {
        "shoegazing": "shoegazing"
    },
    {
        ", ": null
    },
    {
        "stoner rock": "stoner rock"
    },
    {
        ", ": null
    },
    {
        "trip hop": "trip hop"
    },
    {
        ", ": null
    },
    {
        "glitch": "glitch"
    },
    {
        ", ": null
    },
    {
        "math metal": "math rock"
    },
    {
        ", and ": null
    },
    {
        "psychedelia": "psychedelic music"
    },
    {
        ".     Originally, the band was associated with the nu metal movement. However, following the release of their third album, White Pony, they were acknowledged by many critics to have moved beyond that label.        The music critic Johnny Loftus wrote, Rock critics usually reserve a special place for Deftones above or at least away from the rest of the turn-of-the-century metal movement Deftones have always seemed more curious, more willing to incorporate traditionally revered sounds like ": null
    },
    {
        "D.C. hardcore": "washington, d.c. hardcore"
    },
    {
        " and dream pop into their Northern California alt-metal .  Peter Buckley, the author of The Rough Guide to Rock, called the band one of the most primal, powerful, and experimental bands in the alternative metal scene.     Morenos lyrics were described by ": null
    },
    {
        "Time": "time"
    },
    {
        " as suggesting emotions rather than announcing them .  Moreno himself described his lyrics as ambiguous and sometimes impersonal, saying: I like to be ambiguous when writing to a certain extent, and throwing something so brash against that and playing with it. And also making it sound dimensional. Giving the feeling off that it is raw and it is emotional, but its not just connected with our personal story. Its not merely about our career and our lives, its bigger than that. When I hear the music, I get inspired to paint the lyrical pictures you describe, but Im not always talking about myself .  The bands legacy has been compared to ": null
    },
    {
        "alternative rock": "alternative rock"
    },
    {
        " group ": null
    },
    {
        "Radiohead": "radiohead"
    },
    {
        ", with some dubbing Deftones The Radiohead of metal .      Deftones influences include ": null
    },
    {
        "Afrika Bambaataa": "afrika bambaataa"
    },
    {
        ", ": null
    },
    {
        "The Cure": "the cure"
    },
    {
        ", ": null
    },
    {
        "Depeche Mode": "depeche mode"
    },
    {
        ", and ": null
    },
    {
        "Duran Duran": "duran duran"
    },
    {
        ".          Deftones members have worked on several side projects, with Moreno fronting ": null
    },
    {
        "Team Sleep": "team sleep"
    },
    {
        ", ": null
    },
    {
        "Crosses": "crosses"
    },
    {
        ", ": null
    },
    {
        "Palms": "palms"
    },
    {
        " and ": null
    },
    {
        "supergroup": "supergroup"
    },
    {
        " Saudade .  Carpenter works with cinematic electronic metal group ": null
    },
    {
        "Sol Invicto": "sol invicto"
    },
    {
        ", which he founded with producer ": null
    },
    {
        "Richie Londres": "richie londres"
    },
    {
        ".  Carpenter has also worked with the supergroup ": null
    },
    {
        "Kush": "kush"
    },
    {
        ", featuring members of ": null
    },
    {
        "Fear Factory": "fear factory"
    },
    {
        " and ": null
    },
    {
        "Cypress Hill": "cypress hill"
    },
    {
        ".  Delgado is a member of a DJ group called Decibel Devils, with DJ Crook of Team Sleep, Matt D and DJ Julez.  In 42 Cheng released a CD composed of his own ": null
    },
    {
        "spoken word": "spoken word"
    },
    {
        " poetry, called  The Bamboo Parachute .      Moreno has also made a number of guest appearances on songs by numerous other bands, such as First Commandment by ": null
    },
    {
        "Soulfly": "soulfly"
    },
    {
        ",  Bender by Sevendust,  Paralytic by ": null
    },
    {
        "Dead Poetic": "dead poetic"
    },
    {
        ",  Vengeance Is Mine by ": null
    },
    {
        "Droid": "droid"
    },
    {
        ",  Caviar by ": null
    },
    {
        "Dance Gavin Dance": "dance gavin dance"
    },
    {
        ",  Surrender Your Sons by ": null
    },
    {
        "Norma Jean": "norma jean"
    },
    {
        ",  Reprogrammed to Hate by ": null
    },
    {
        "Whitechapel": "whitechapel"
    },
    {
        ",  Embers by ": null
    },
    {
        "Lamb of God": "lamb of god"
    },
    {
        ",  and Lift Off by ": null
    },
    {
        "Mike Shinoda": "mike shinoda"
    },
    {
        " with ": null
    },
    {
        "Machine Gun Kelly": "machine gun kelly"
    },
    {
        ".  Moreno and Carpenter also appeared on the song If I Could on ": null
    },
    {
        "Tech N42ne": "tech n9ne"
    },
    {
        "s 42 album  All 42s and 42s .          ": null
    },
    {
        "Chino Moreno": "chino moreno"
    },
    {
        " – lead vocals ; rhythm guitar   ": null
    },
    {
        "Stephen Carpenter": "stephen carpenter"
    },
    {
        " – lead guitar   ": null
    },
    {
        "Abe Cunningham": "abe cunningham"
    },
    {
        " – drums   ": null
    },
    {
        "Frank Delgado": "frank delgado"
    },
    {
        " – keyboards, ": null
    },
    {
        "samplers": "sampling"
    },
    {
        ", ": null
    },
    {
        "turntables": "turntablism"
    },
    {
        "   Sergio Vega": "sergio vega"
    },
    {
        " – bass, backing vocals       Dominic Garcia – bass ; drums   John Taylor – drums   ": null
    },
    {
        "Chi Cheng": "chi cheng"
    },
    {
        " – bass, backing vocals               ": null
    },
    {
        "Elite": "elite"
    },
    {
        " Best Metal Performance": "best metal performance"
    },
    {
        "   White Pony    Koi No Yokan               ;Studio albums    Adrenaline     Around the Fur     White Pony     Deftones     Saturday Night Wrist     Diamond Eyes     Koi No Yokan     Gore        ": null
    }
]