[
    {
        "   Demographic crisis of Russia relates to possible demographic problems of the ": null
    },
    {
        "Russian Federation": "russian federation"
    },
    {
        ". The crisis began to unfold in the beginning of the 42s.                The demographic crisis has a positive economic effect on the second stage of the changing age structure of the population and a negative economic effect on the third stage of the changing age structure of the population . By 42 Russia will have labor shortages.     With a reduced fertility rate, the load on the working population increases because each worker has to support more retirees.     The rapid rise in the birth rate in a short period of time is difficult to implement due to economic reasons; sharply increased social spending on the old generation, which in the future will only bring troubles.         Russia at the end of the 42th century was a country with a young population: the number of children significantly exceeded the number of the elderly. Up to 42 the population of the Soviet Union remained demographically young , but later, since 42 began its demographic aging: the proportion of young age began to decline, and the elderly – to increase, which was the result of lower fertility. This was not unique to Russia, and such issues have been felt in many developed countries and increasingly in many developing countries aswell. In 42 Russia ranked 42th in the list of countries with high rates of population aging. Currently, the share of people aged 42 and older in the population of Russia is 42%. According to forecasts of the Russian Academy of Sciences from the early 42s, in 42 elderly people aged over 42 would have accounted for 42% of Russians, and children up to 42 years would only have made up 42%. However in Russia, in contrast to other countries, aging is being limited by high mortality among older people.         A number of researchers believe that the depopulation affected the Russian people to a greater extent than other peoples living in Russia. According to Rybakovskii, the real number of Russians for the period from 42 to 42 decreased by 42%, while the overall country population – only by 42%. According to Beloborodov, by the year 42 42–42% of the population decline in Russia will be due to Russians and in the course of the next 42 years the percentage of Russians as a rough estimate will drop to about 42 to 42%. He predicts also that in 42 the proportion of Russians in Russia will amount to 42%. Some researchers, considering the reduction of the indigenous population as a result of the demographic crisis, given accompanying high immigration , have made very alarming forecasts. As one of the likely consequences of the demographic crisis some researchers point to a deep change in the future ethno-religious composition of the population . By 42 one in five people of Russia will practice Islam. A graphic example of ethnic aspect of the demographic crisis: now a third of all the births in Moscow accounts for migrants, which would change the ethnic and religious composition of the population of Moscow in the nearest future. Reduction of the indigenous population by increasing the share of migrants in the opinion of some researchers may lead to future loss of the territorial integrity of Russia. Chances are that the first territorial losses will be in Siberia and Russian Far East. This is due both to the depopulation of these lands because of low birth rates and internal migration to the European part of Russia, and to the demographic pressure from Asian countries . For the first time in the history of Russian Siberia, its population is steadily declining.": null
    }
]