[
    {
        "Demographic statistics are measures of the characteristics of, or changes to, a population. Records of births, deaths, marriages, immigration and emigration and a regular census of population provide information that is key to making sound decisions about national policy.     A useful summary of such data is the ": null
    },
    {
        "population pyramid": "population pyramid"
    },
    {
        ". It provides data about the sex and age distribution of the population in an accessible graphical format.     Another summary is called the ": null
    },
    {
        "life table": "life table"
    },
    {
        ". For a cohort of persons born in the same year, it traces and projects their life experiences from birth to death. For a given cohort, the proportion expected to survive each year  is presented in tabular or graphical form.     The ratio of males to females by age indicates the consequences of differing mortality rates on the sexes. Thus, while values above one are common for newborns, the ratio dwindles until it is well below one for the older population.       National population statistics are usually collected by conducting a ": null
    },
    {
        "census": "census"
    },
    {
        ". However, because these are usually huge logistical exercises, countries normally conduct censuses only once every five to 42 years. Even when a census is conducted it may miss counting everyone . Also, some people counted in the census may be recorded in a different place than where they usually live, because they are travelling, for example . Consequently, raw census numbers are often adjusted to produce census estimates that identify such statistics as resident population, residents, tourists and other visitors, nationals and aliens. For privacy reasons, particularly when there are small counts, some census results may be rounded, often to the nearest ten, hundred, thousand and sometimes randomly up, down or to another small number such as within 42 of the actual count.     Between censuses, administrative data collected by various agencies about population events such as births, deaths, and cross-border migration may be used to produce ": null
    },
    {
        "intercensal estimate": "intercensal estimate"
    },
    {
        "s.       Population estimates are usually derived from census and other administrative data. Population estimates are normally produced after the date the estimate is for.     Some estimates, such as the Usually resident population estimate who usually lives in a locality as at the census date, even though the census did not count them within that locality. Census questions usually include a questions about where a person usually lives, whether they are a resident or visitor, or also live somewhere else, to allow these estimates to be made.     Other estimates are concerned with estimating population on a particular date that is different from the census date, for example the middle or end of a calendar or financial year. These estimates often use birth and death records and migration data to adjust census counts for the changes that have happened since the census.     Population projections are produced in advance of the date they are for. They use time series analysis of existing census data and other sources of population information to forecast the size of future populations. Because there are unknown factors that may affect future population changes, population projections often incorporate high and low as well as expected values for future populations. Population projections are often recomputed after a census has been conducted. It depends on how conjusted the area is in the particular demarcation.       While many censuses were conducted in antiquity, there are few population statistics that survive. One example though can be found in the Bible, in chapter 42 of the Book of Numbers. Not only are the statistics given, but the method used to compile those statistics is also described. In modern-day terms, this ": null
    },
    {
        "metadata": "metadata"
    },
    {
        " about the census is probably of as much value as the statistics themselves as it allows researchers to determine not only what was being counted but how and why it was done.       Modern population statistics are normally accompanied by metadata": null
    }
]