[
    {
        "           Depeche Mode  are an English ": null
    },
    {
        "electronic music": "Electronic Music"
    },
    {
        " band formed in ": null
    },
    {
        "Basildon": "Basildon"
    },
    {
        ", ": null
    },
    {
        "Essex": "Essex"
    },
    {
        ", in 1980. The group as of now consists of a trio of ": null
    },
    {
        "Dave Gahan": "Dave Gahan"
    },
    {
        " , ": null
    },
    {
        "Martin Gore": "Martin Gore"
    },
    {
        " , and ": null
    },
    {
        "Andy Fletcher": "Andy Fletcher"
    },
    {
        " .     Depeche Mode released their debut album  Speak & Spell  in 1981, bringing the band onto the British ": null
    },
    {
        "new wave": "New Wave Music"
    },
    {
        " scene. Founding member ": null
    },
    {
        "Vince Clarke": "Vince Clarke"
    },
    {
        " left after the release of the album; they recorded  A Broken Frame  as a trio. Gore took over as main songwriter and, later in 1982, ": null
    },
    {
        "Alan Wilder": "Alan Wilder"
    },
    {
        " replaced Clarke, establishing a lineup that continued for 13 years.     The bands last albums of the 1980s,  Black Celebration  and  Music for the Masses , established them as a dominant force within the electronic music scene. A highlight of this era was the bands June 1988 concert at the ": null
    },
    {
        "Pasadena Rose Bowl": "Rose Bowl"
    },
    {
        ", where they drew a crowd in excess of 60,000 people. In early 1990, they released  Violator , an international mainstream success. The following album,  Songs of Faith and Devotion  in 1993 was also a success, though internal struggles within the band during recording and touring resulted in Wilders departure in 1995.     Depeche Mode has had 54 songs in the ": null
    },
    {
        "UK Singles Chart": "Uk Singles Chart"
    },
    {
        " and 17 top 10 albums in the UK chart; they have sold more than 100 million records worldwide.    Q  included the band in the list of the 50 Bands That Changed the World! .  Depeche Mode also rank number 98 on ": null
    },
    {
        "VH1s": "Vh1"
    },
    {
        " 100 Greatest Artists of All Time .  In December 2016,  Billboard  named Depeche Mode the 10th most successful dance club artist of all time.            Depeche Modes origins date to 1977, when schoolmates Vince Clarke and Andy Fletcher formed a ": null
    },
    {
        "Cure": "The Cure"
    },
    {
        "-influenced band called No Romance In China, with Clarke on vocals and guitar and Fletcher on bass guitar. Fletcher would later recall, Why am I in the band? It was accidental right from the beginning. I was actually forced to be in the band. I played the guitar and I had a bass; it was a question of them roping me in.  In 1979, Clarke played guitar in an ": null
    },
    {
        "Ultravox": "Ultravox"
    },
    {
        " rip-off band , The Plan, with friends ": null
    },
    {
        "Robert Marlow": "Robert Marlow"
    },
    {
        " and Paul Langwith. . Erasureinfo.com. In 1978–79, ": null
    },
    {
        "Martin Gore": "Martin Gore"
    },
    {
        " played guitar in an acoustic duo, Norman and the Worms, with school friend Phil Burdett on vocals. . In 1979, Marlow, Gore and friend Paul Redmond formed a band called the French Look, with Marlow on vocals/keyboards, Gore on guitar and Redmond on keyboards. In March 1980, Clarke, Gore and Fletcher formed a band called Composition of Sound, with Clarke on vocals/guitar, Gore on keyboards and Fletcher on bass.     Soon after the formation of Composition of Sound, Clarke heard ": null
    },
    {
        "Wirral": "Metropolitan Borough Of Wirral"
    },
    {
        " band ": null
    },
    {
        "Orchestral Manoeuvres in the Dark": "Orchestral Manoeuvres In The Dark"
    },
    {
        " , whose output inspired him to make electronic music.   Along with OMD, other early influences included ": null
    },
    {
        "the Human League": "The Human League"
    },
    {
        ", ": null
    },
    {
        "Daniel Miller": "Daniel Miller"
    },
    {
        " and ": null
    },
    {
        "Fad Gadget": "Fad Gadget"
    },
    {
        ".  Clarke and Fletcher switched to synthesisers, working odd jobs in order to buy the instruments, or borrowing them from friends. ": null
    },
    {
        "Dave Gahan": "Dave Gahan"
    },
    {
        " joined the band in 1980 after Clarke heard him perform at a local ": null
    },
    {
        "Scout hut": "Scout Hall"
    },
    {
        " jam session": "Jam Session"
    },
    {
        ", singing a rendition of ": null
    },
    {
        "David Bowies": "David Bowie"
    },
    {
        "  Heroes ": "Heroes"
    },
    {
        ",  and Depeche Mode was born. Gahans and Gores favourite artists included ": null
    },
    {
        "Sparks": "Sparks"
    },
    {
        ", ": null
    },
    {
        "Siouxsie and the Banshees": "Siouxsie And The Banshees"
    },
    {
        ", . Look In. Sacred DM. 5 December 1981. ": null
    },
    {
        "Cabaret Voltaire": "Cabaret Voltaire"
    },
    {
        ", ": null
    },
    {
        "Talking Heads": "Talking Heads"
    },
    {
        " and ": null
    },
    {
        "Iggy Pop": "Iggy Pop"
    },
    {
        ". . Look In. Sacred DM. 12 December 1981. Gahans persona onstage was influenced by ": null
    },
    {
        "Dave Vanian": "Dave Vanian"
    },
    {
        ", frontman of ": null
    },
    {
        "The Damned": "The Damned"
    },
    {
        ".      When explaining the choice for the new name, taken from French fashion magazine Dépêche mode,  Gore said, It means hurried fashion or fashion dispatch. I like the sound of that.  However, the magazines name is Fashion News or Fashion Update  .     Gore recalled that the first time the band played as Depeche Mode was a school gig in May 1980.  There is a plaque commemorating the gig at the ": null
    },
    {
        "James Hornsby School": "James Hornsby School"
    },
    {
        " in Basildon, where Gore and Fletcher were pupils. The band made their recording debut in 1980 on the  Some Bizzare Album  with the song Photographic , later re-recorded for their debut album  Speak & Spell .     The band made a ": null
    },
    {
        "demo tape": "Demo"
    },
    {
        " but, instead of mailing the tape to record companies, they would go in and personally deliver it. They would demand the companies play it; according to Dave Gahan, most of them would tell us to fuck off. Theyd say leave the tape with us and wed say its our only one. Then wed say goodbye and go somewhere else.      According to Gahan, prior to securing their record contract, they were receiving offers from all the major labels. ": null
    },
    {
        "Phonogram": "Phonogram Inc."
    },
    {
        " offered them money you could never have imagined and all sorts of crazy things like clothes allowances .     While playing a live gig at the Bridge House in ": null
    },
    {
        "Canning Town": "Canning Town"
    },
    {
        ", Tickell, Paul . .  The Face . Sacred DM. the band were approached by Daniel Miller, an ": null
    },
    {
        "electronic music": "Electronic Music"
    },
    {
        "ian and founder of ": null
    },
    {
        "Mute Records": "Mute Records"
    },
    {
        ", who was interested in their recording a single for his burgeoning label. Paige, Betty . .  Sounds . Sacred DM. The result of this verbal contract was their first single, ": null
    },
    {
        "Dreaming of Me": "Dreaming Of Me"
    },
    {
        " , recorded in December 1980 and released in February 1981. It reached number 57 in the UK charts. Encouraged by this, the band recorded their second single, ": null
    },
    {
        "New Life": "New Life"
    },
    {
        " , which climbed to number 11 in the UK charts and got them an appearance on  Top of the Pops . The band went to London by train, carrying their synthesisers all the way to the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " studios.     The bands next single was ": null
    },
    {
        "Just Cant Get Enough": "Just Cant Get Enough"
    },
    {
        " . The ": null
    },
    {
        "synth-pop": "Synth-Pop"
    },
    {
        " single became the bands first UK top ten hit. The video is the only one of the bands videos to feature Vince Clarke. Depeche Modes debut album, Speak & Spell, was released in October 1981 and peaked at number ten on the UK album charts. Critical reviews were mixed;  Melody Maker  described it as a great album … one they had to make to conquer fresh audiences and please the fans who just cant get enough , Colbert, Paul . .  Melody Maker . Sacred DM. while  Rolling Stone  was more critical, calling the album ": null
    },
    {
        "PG-rated": "Rated Pg"
    },
    {
        " fluff .        Clarke began to voice his discomfort at the direction the band was taking, saying there was never enough time to do anything. Not with all the interviews and photo sessions . Ellen, Mark . .  Smash Hits . Clarke also said he was sick of touring, which Gahan said years later was bullshit to be quite honest. Gahan went on to say he suddenly lost interest in it and he started getting letters from fans asking what kind of socks he wore. In November 1981, Clarke publicly announced that he was leaving Depeche Mode.     Soon afterwards, Clarke joined up with blues singer ": null
    },
    {
        "Alison Moyet": "Alison Moyet"
    },
    {
        " to form ": null
    },
    {
        "Yazoo": "Yazoo"
    },
    {
        " . Initial talk of Clarkes continuing to write material for Depeche Mode ultimately amounted to nothing. According to third-party sources, Clarke offered the remaining members of Depeche Mode the track ": null
    },
    {
        "Only You": "Only You"
    },
    {
        " , but they declined. Clarke, however, denied in an interview that such an offer ever took place saying, I dont know where that came from. Thats not true.  The song went on to become a UK Top 3 hit for Yazoo. Gore, who had written Tora! Tora! Tora! and the instrumental Big Muff for Speak & Spell, became the bands main lyricist.     In late 1981, the band placed an anonymous ad in Melody Maker looking for another musician: Name band, synthesise, must be under twenty-one. ": null
    },
    {
        "Alan Wilder": "Alan Wilder"
    },
    {
        ", a classically trained keyboardist from West London, responded and, after two auditions and despite being 22 years old, was hired in early 1982, initially on a trial basis as a touring member. Wilder would later be called the Musical Director of the band, responsible for the bands sound until his departure in 1995. As producer ": null
    },
    {
        "Flood": "Flood"
    },
    {
        " would say, is sort of the craftsman, Martins the idea man and is the attitude.     In January 1982, the band released ": null
    },
    {
        "See You": "See You"
    },
    {
        " , their first single without Clarke, which managed to beat all three Clarke-penned singles in the UK charts, reaching number six. The following tour saw the band playing their first shows in North America. Two more singles, ": null
    },
    {
        "The Meaning of Love": "The Meaning Of Love"
    },
    {
        " and ": null
    },
    {
        "Leave in Silence": "Leave In Silence"
    },
    {
        " , were released ahead of the bands second studio album, on which they began work in July 1982. Daniel Miller informed Wilder that he was not needed for the recording of the album, as the core trio wanted to prove they could succeed without Vince Clarke.  A Broken Frame  was released that September, and the following month the band began ": null
    },
    {
        "their 1982 tour": "Broken Frame Tour"
    },
    {
        ". A non-album single, ": null
    },
    {
        "Get the Balance Right!": "Get The Balance Right!"
    },
    {
        " , was released in January 1983, the first Depeche Mode track to be recorded with Wilder.     Construction Time Again  Construction Time Again , Depeche Mode worked with producer ": null
    },
    {
        "Gareth Jones": "Gareth Jones"
    },
    {
        ", at ": null
    },
    {
        "John Foxxs": "John Foxx"
    },
    {
        "Garden Studios and at ": null
    },
    {
        "Hansa Studios": "Hansa Tonstudio"
    },
    {
        " in West Berlin . The album saw a dramatic shift in the groups sound, due in part to Wilders introduction of the ": null
    },
    {
        "Synclavier": "Synclavier"
    },
    {
        " and ": null
    },
    {
        "E-mu Emulator": "E-Mu Emulator"
    },
    {
        " samplers": "Sampler"
    },
    {
        ".  By sampling the noises of everyday objects, the band created an eclectic, ": null
    },
    {
        "industrial": "Industrial Music"
    },
    {
        "-influenced sound, with similarities to groups such as the ": null
    },
    {
        "Art of Noise": "Art Of Noise"
    },
    {
        " and ": null
    },
    {
        "Einstürzende Neubauten": "Einstürzende Neubauten"
    },
    {
        " . Benne .  . MUNA.     Everything Counts rose to number six in the UK, also reaching the top 30 in Ireland, South Africa, Switzerland, Sweden and West Germany. Wilder contributed two songs to the album, The Landscape Is Changing and Two Minute Warning . In September 1983, to promote Construction Time Again, the band launched ": null
    },
    {
        "a European concert tour": "Construction Time Again Tour"
    },
    {
        ".     Some Great Reward and growing international success  This changed in March 1984, when they released the single ": null
    },
    {
        "People Are People": "People Are People"
    },
    {
        " . The song became a hit, reaching No. 2 in Ireland and Poland, No. 4 in the UK and Switzerland, and No. 1 in West Germany — the first time a DM single topped a countrys singles chart — where it was used as the theme to West German TVs coverage of the ": null
    },
    {
        "1984 Olympics": "1984 Summer Olympics"
    },
    {
        ". Beyond this European success, the song also reached No. 13 on the US charts in mid-1985, the first appearance of a DM single on the ": null
    },
    {
        "Billboard Hot 100": "Billboard Hot 100"
    },
    {
        ", and was a Top 20 hit in Canada. People Are People became an anthem for the LGBT community,  regularly played at gay establishments and ": null
    },
    {
        "gay pride": "Gay Pride"
    },
    {
        " festivals in the late 1980s. ": null
    },
    {
        "Sire": "Sire Records"
    },
    {
        ", the bands North American record label, released a compilation of ": null
    },
    {
        "the same name": "People Are People"
    },
    {
        " which included tracks from A Broken Frame and Construction Time Again as well as several ": null
    },
    {
        "B-sides": "A-Side And B-Side"
    },
    {
        ".     On the American tour, the band was, according to Gore, shocked by the way the fans were turning up in droves at the concerts . He said that although the concerts were selling well, Depeche Mode struggled to sell records.     In September 1984,  Some Great Reward  was released. Melody Maker claimed that the album made one sit up and take notice of what is happening here, right under your nose. McIlheney, Barry . . Melody Maker. Sacred DM. In contrast to the political and environmental subjects addressed on the previous album, the songs on Some Great Reward were mostly concerned with more personal themes such as sexual politics , adulterous relationships , and arbitrary divine justice . Also included was the first Martin Gore ballad, Somebody — such songs would become a feature of all following albums. Somebody was released as a double A-side with Blasphemous Rumours , and was the first single with Gore on lead vocal. Some Great Reward became the first Depeche Mode album to enter the US album charts, and made the Top 10 in several European countries.      The World We Live In and Live in Hamburg  was the bands first video release, almost an entire concert from their 1984 ": null
    },
    {
        "Some Great Reward Tour": "Some Great Reward Tour"
    },
    {
        ". In July 1985, the band played their first-ever concerts behind the ": null
    },
    {
        "Iron Curtain": "Iron Curtain"
    },
    {
        ", in ": null
    },
    {
        "Budapest": "Budapest"
    },
    {
        " and ": null
    },
    {
        "Warsaw": "Warsaw"
    },
    {
        ". In October 1985, Mute released a compilation,  The Singles 81→85  , which included the two non-album hit singles ": null
    },
    {
        "Shake the Disease": "Shake The Disease"
    },
    {
        " and ": null
    },
    {
        "Its Called a Heart": "Its Called A Heart"
    },
    {
        " along with their B-sides.     In the United States, the bands music had first gained prominence on college radio and ": null
    },
    {
        "modern rock": "Modern Rock"
    },
    {
        " stations such as ": null
    },
    {
        "KROQ": "Kroq-Fm"
    },
    {
        " in Los Angeles, ": null
    },
    {
        "KQAK": "Kqak"
    },
    {
        " in San Francisco, ": null
    },
    {
        "WFNX": "Wfnx"
    },
    {
        " in Boston and ": null
    },
    {
        "WLIR": "Wlir"
    },
    {
        " on ": null
    },
    {
        "Long Island, New York": "Long Island"
    },
    {
        ", and hence they appealed primarily to an ": null
    },
    {
        "alternative": "Alternative Rock"
    },
    {
        " audience who were disenfranchised with the predominance of soft rock and disco hell  on the radio. This view of the band was in sharp contrast to how the band was perceived in Europe, despite the increasingly dark and serious tone in their songs. Adinolfi, Francesco . .  Record Mirror . Sacred DM. In Germany, France, and other European countries, Depeche Mode were considered teen idols and regularly featured in European teen magazines, becoming one of the most famous synth-pop bands in the mid-80s.     Black Celebration ": null
    },
    {
        "Stripped": "Stripped"
    },
    {
        " , and its accompanying album  Black Celebration . Retaining their often imaginative sampling and beginning to move away from the industrial pop sound that had characterised their previous two LPs, the band introduced an ominous, highly atmospheric and textured sound. Gores lyrics also took on a darker tone and became even more pessimistic.     The music video for ": null
    },
    {
        "A Question of Time": "A Question Of Time"
    },
    {
        " was the first to be directed by ": null
    },
    {
        "Anton Corbijn": "Anton Corbijn"
    },
    {
        ", beginning a working relationship that continues to the present day. Corbijn has directed a further 20 of the bands videos He has also filmed some of their live performances, and designed stage sets, as well as most covers for albums and singles from Violator and onwards.     Music for the Masses and 101  Music for the Masses  saw further alterations in the bands sound and working methods. For the first time a producer not related to Mute Records, Dave Bascombe, was called to assist with the recording sessions, although, according to Alan Wilder, Bascombes role ended up being more that of engineer.  In making the album, the band largely eschewed ": null
    },
    {
        "sampling": "Sampling"
    },
    {
        " in favour of ": null
    },
    {
        "synthesizer": "Synthesizer"
    },
    {
        " experimentation.  While chart performance of the singles ": null
    },
    {
        "Strangelove": "Strangelove"
    },
    {
        " , ": null
    },
    {
        "Never Let Me Down Again": "Never Let Me Down Again"
    },
    {
        " and ": null
    },
    {
        "Behind the Wheel": "Behind The Wheel"
    },
    {
        " proved to be disappointing in the UK, they performed well in countries such as Canada, Brazil, West Germany, South Africa, Sweden and Switzerland, often reaching the top 10.  Record Mirror  described Music for the Masses as the most accomplished and sexy Mode album to date . Levy, Eleanor . . Record Mirror. Sacred DM. The album also made a breakthrough in the American market.     The ": null
    },
    {
        "Music for the Masses Tour": "Music For The Masses Tour"
    },
    {
        " began 22 October 1987. On 7 March 1988, with no previous announcement that they would be the headlining act, Depeche Mode played in the ": null
    },
    {
        "Werner-Seelenbinder-Halle": "Werner-Seelenbinder-Halle"
    },
    {
        ", East Berlin,  becoming one of the few Western groups to perform in the Communist ": null
    },
    {
        "East Germany": "East Germany"
    },
    {
        ". They also performed concerts in Budapest and Prague in 1988,  both at the time also Communist.     The world tour ended 18 June 1988 with a concert at the ": null
    },
    {
        "Pasadena": "Pasadena, California"
    },
    {
        " Rose Bowl": "Rose Bowl"
    },
    {
        " with paid attendance of 60,453, the highest in eight years for the venue. The tour was a breakthrough for the band and a massive success in the United States. It was documented in  101  – a concert film by ": null
    },
    {
        "D. A. Pennebaker": "D. A. Pennebaker"
    },
    {
        " and its accompanying soundtrack album. The film is notable for its portrayal of fan interaction.   Alan Wilder is credited with coming up with the title, noting that the performance was the 101st and final performance of the tour.  On 7 September 1988, Depeche Mode performed Strangelove at the ": null
    },
    {
        "1988 MTV Video Music Awards": "1988 Mtv Video Music Awards"
    },
    {
        " at the ": null
    },
    {
        "Universal Amphitheatre": "Universal Amphitheatre"
    },
    {
        " in Los Angeles.      Violator and worldwide fame ": null
    },
    {
        "Milan": "Milan"
    },
    {
        " with producer Flood and engineer ": null
    },
    {
        "François Kevorkian": "François Kevorkian"
    },
    {
        ". The initial result of this session was the single ": null
    },
    {
        "Personal Jesus": "Personal Jesus"
    },
    {
        ". Prior to its release, a marketing campaign was launched with advertisements placed in the ": null
    },
    {
        "personals columns": "Personal Advertisement"
    },
    {
        " of UK regional newspapers with the words Your own personal Jesus. Later, the ads included a phone number one could dial to hear the song. The resulting furor helped propel the single to number 13 on the UK charts, becoming one of their biggest sellers to date; in the United States, it was their first gold single and their first Top 40 hit since People Are People , eventually becoming the biggest-selling 12-inch single in ": null
    },
    {
        "Warner Records": "Warner Bros. Records"
    },
    {
        " history up to that point.        Released in January 1990, ": null
    },
    {
        "Enjoy the Silence": "Enjoy The Silence"
    },
    {
        " reached number six in the UK . A few months later in the US, it reached number eight and earned the band a second gold single. It won Best British single at the 1991 ": null
    },
    {
        "Brit Awards": "Brit Awards"
    },
    {
        ".  To promote their new album,  Violator , the band held an in-store autograph signing at Wherehouse Entertainment in Los Angeles. The event attracted approximately 20,000 fans and turned into a near riot. Some who attended were injured by being pressed against the stores glass by the crowd.  As an apology to the fans who were injured, the band released a limited edition cassette tape to fans living in Los Angeles, distributed through radio station ": null
    },
    {
        "KROQ": "Kroq-Fm"
    },
    {
        " .     Violator was the first Depeche Mode album to enter the Top 10 of the ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        ", reaching Number 7 and staying 74 weeks in the chart. It was ": null
    },
    {
        "certified": "Recording Industry Association Of America"
    },
    {
        " triple platinum in America,  selling over 4.5 million units there. It remains the bands best selling album worldwide. Two more singles from the album — ": null
    },
    {
        "Policy of Truth": "Policy Of Truth"
    },
    {
        " and ": null
    },
    {
        "World in My Eyes": "World In My Eyes"
    },
    {
        " — were hits in the UK, with the former also charting in the US.        The ": null
    },
    {
        "World Violation Tour": "World Violation Tour"
    },
    {
        " saw the band play several stadium shows in the US. 42,000 tickets were sold within four hours for a show at Giants Stadium, and 48,000 tickets were sold within half-an-hour of going on sale for a show at ": null
    },
    {
        "Dodger Stadium": "Dodger Stadium"
    },
    {
        ". An estimated 1.2 million fans saw this tour worldwide.     In 1991, Depeche Mode contribution Deaths Door was released on ": null
    },
    {
        "the soundtrack album": "Until The End Of The World"
    },
    {
        " for the film  Until the End of the World . Film director Wim Wenders had challenged musical artists to write music the way they imagined they would in the year 2000, the setting of the movie.     Songs of Faith and Devotion and Wilders departure ": null
    },
    {
        "Madrid": "Madrid"
    },
    {
        " in January 1992, Dave Gahan had become interested in the new ": null
    },
    {
        "grunge": "Grunge"
    },
    {
        " scene sweeping the U.S. and was influenced by the likes of ": null
    },
    {
        "Janes Addiction": "Janes Addiction"
    },
    {
        ", ": null
    },
    {
        "Soundgarden": "Soundgarden"
    },
    {
        " and ": null
    },
    {
        "Nirvana": "Nirvana"
    },
    {
        ".       In 1993,  Songs of Faith and Devotion , again with Flood producing, saw them experimenting with arrangements based as much on heavily distorted electric guitars and live drums  as on synthesizers.  Live ": null
    },
    {
        "strings": "String Instrument"
    },
    {
        ", ": null
    },
    {
        "uilleann pipes": "Uilleann Pipes"
    },
    {
        " and female ": null
    },
    {
        "gospel": "Gospel Music"
    },
    {
        " vocals were other new additions to the bands sound. The album debuted at number one in both the UK and the US, only the sixth British act to achieve such a distinction to date. The first single from the album was the grunge-influenced ": null
    },
    {
        "I Feel You": "I Feel You"
    },
    {
        ". The gospel influences are most noticeable on the albums third single, ": null
    },
    {
        "Condemnation": "Condemnation"
    },
    {
        ". Interviews given by the band during this period tended to be conducted separately, unlike earlier albums, where the band was interviewed as a group.     The ": null
    },
    {
        "Devotional": "Devotional Tour"
    },
    {
        " world tour followed, documented by a concert film of the ": null
    },
    {
        "same name": "Devotional"
    },
    {
        ". The film was directed by ": null
    },
    {
        "Anton Corbijn": "Anton Corbijn"
    },
    {
        ", and in 1995 earned the band their first ": null
    },
    {
        "Grammy": "Grammy Award"
    },
    {
        " nomination.  The bands second live album,  Songs of Faith and Devotion Live , was released in December 1993. The tour continued into 1994 with the ": null
    },
    {
        "Exotic Tour": "Exotic Tour"
    },
    {
        ", which began in February 1994 in South Africa, and ended in April in Mexico. The final leg of the tour, consisting of more North American dates, followed shortly thereafter and ran until July. As a whole, the Devotional Tour is to date the longest and most geographically diverse Depeche Mode tour, spanning fourteen months and 159 individual performances.     Q magazine described the 1993 Devotional Tour as The Most Debauched RocknRoll Tour Ever. Ali, Omar . .  Time Out . Sacred DM. According to  The Independent , the smack-blasted Gahan required cortisone shots just to perform, borderline alcoholic Gore suffered two stress-induced seizures, and Andrew Fletchers deepening depression resulted, in the summer of 1994, in a full nervous breakdown.  Fletcher declined to participate in the second half of the Exotic Tour due to mental instability; he was replaced on stage by ": null
    },
    {
        "Daryl Bamonte": "Daryl Bamonte"
    },
    {
        ", who had worked with the band as a personal assistant since the beginning of their career in 1980.  Compact Space . Compact Space. 2011. Retrieved 3 August 2011.     In June 1995, Alan Wilder announced that he was leaving Depeche Mode, explaining:        He continued to work on his personal project ": null
    },
    {
        "Recoil": "Recoil"
    },
    {
        ", releasing a fourth album  in 1997.     Ultra    Despite Gahans increasingly severe personal problems, Gore tried repeatedly during 1995 and 1996 to get the band recording again. However, Gahan would rarely turn up to scheduled sessions, and when he did, it would take weeks to get any vocals recorded; one six-week session at ": null
    },
    {
        "Electric Lady": "Electric Lady Studios"
    },
    {
        " in New York produced just one usable vocal , and even that was pieced together from multiple takes. Gore was forced to contemplate breaking the band up and considered releasing the songs he had written as a solo album.  In mid-1996, after his near-fatal overdose, Gahan entered a court-ordered ": null
    },
    {
        "drug rehabilitation": "Drug Rehabilitation"
    },
    {
        " program to battle his addiction to cocaine and heroin. Cameron, Keith . . NME. Sacred DM. With Gahan out of rehab in 1996, Depeche Mode held recording sessions with producer ": null
    },
    {
        "Tim Simenon": "Tim Simenon"
    },
    {
        ".     Preceded by two singles, ": null
    },
    {
        "Barrel of a Gun": "Barrel Of A Gun"
    },
    {
        " and ": null
    },
    {
        "Its No Good": "Its No Good"
    },
    {
        " , the album  Ultra  was released in April 1997. The album debuted at No. 1 in the UK , and No. 5 in the US. The band did not tour in support of the album, with Fletcher quoted as saying: Were not fit enough. Daves only eight months into his sobriety, and our bodies are telling us to spend time with our families.  As part of the promotion for the release of the album, they did perform two short concerts in London and Los Angeles, called Ultra Parties.  Ultra spawned two further singles, ": null
    },
    {
        "Home": "Home"
    },
    {
        " and ": null
    },
    {
        "Useless": "Useless"
    },
    {
        " .     A second singles compilation,  The Singles 86–98 , was released in 1998, preceded by the new single ": null
    },
    {
        "Only When I Lose Myself": "Only When I Lose Myself"
    },
    {
        " , which had been recorded during the Ultra sessions. In April 1998, Depeche Mode held a press conference at the Hyatt Hotel in ": null
    },
    {
        "Cologne": "Cologne"
    },
    {
        " to announce ": null
    },
    {
        "The Singles Tour": "The Singles Tour"
    },
    {
        ". . DepecheMode.com. 20 April 1998. The tour was the first to feature two backing musicians in place of Alan Wilder—Austrian drummer Christian Eigner and British keyboardist ": null
    },
    {
        "Peter Gordeno": "Peter Gordeno"
    },
    {
        ".     Exciter  Exciter , produced by ": null
    },
    {
        "Mark Bell": "Mark Bell"
    },
    {
        " . Bell introduced a minimalist, digital sound to much of the album, influenced by ": null
    },
    {
        "IDM": "Intelligent Dance Music"
    },
    {
        " and ": null
    },
    {
        "glitch": "Glitch"
    },
    {
        ". ": null
    },
    {
        "Dream On": "Dream On"
    },
    {
        " , ": null
    },
    {
        "I Feel Loved": "I Feel Loved"
    },
    {
        " , ": null
    },
    {
        "Freelove": "Freelove"
    },
    {
        " and ": null
    },
    {
        "Goodnight Lovers": "Goodnight Lovers"
    },
    {
        " were released as singles in 2001 and 2002. Critical response to the album was mixed, with reasonably positive reviews from some magazines , while others  derided it as sounding underproduced, dull and lacklustre.      In March 2001, Depeche Mode held a press conference at the Valentino Hotel in ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        " to announce the ": null
    },
    {
        "Exciter Tour": "Exciter Tour"
    },
    {
        ". . 13 March 2001. The tour featured 84 performances for over 1.5 million fans in 24 countries. . Onipdvd.depechemode.com. The concerts held in Paris at the ": null
    },
    {
        "Palais Omnisports de Paris-Bercy": "Palais Omnisports De Paris-Bercy"
    },
    {
        " were filmed and later released in May 2002 as a ": null
    },
    {
        "live DVD": "Live Cd"
    },
    {
        " entitled  One Night in Paris .     In October 2002 the band won the first-ever Q magazine Innovation Award . . DepecheMode.com. 22 October 2002.     In 2003, Gahan released his first solo album,  Paper Monsters , and toured to promote the record. Also released in 2003 was Gores second solo album  Counterfeit² . . Martingore.com. Fletcher founded his own record label, ": null
    },
    {
        "Toast Hawaii": "Toast Hawaii"
    },
    {
        ", specialising in promoting electronic music.     A new remix compilation album,  Remixes 81–04 , was released in 2004, featuring new and unreleased promo mixes of the bands singles from 1981 to 2004. A new version of Enjoy the Silence , remixed by ": null
    },
    {
        "Mike Shinoda": "Mike Shinoda"
    },
    {
        " of ": null
    },
    {
        "Linkin Park": "Linkin Park"
    },
    {
        ", ": null
    },
    {
        "Enjoy the Silence 04": "Enjoy The Silence 04"
    },
    {
        " , was released as a single and reached No. 7 on the UK charts.     Playing the Angel    In October 2005, the band released their 11th studio album  Playing the Angel . Produced by ": null
    },
    {
        "Ben Hillier": "Ben Hillier"
    },
    {
        ", the album peaked at No. 1 in 18 countries and featured the hit single ": null
    },
    {
        "Precious": "Precious"
    },
    {
        " . This is the first Depeche Mode album to feature lyrics written by Gahan and, consequently, the first album since 1984s  Some Great Reward  featuring songs not written by Gore. ": null
    },
    {
        "Suffer Well": "Suffer Well"
    },
    {
        " was the first ever post-Clarke Depeche Mode single not to be written by Gore . The final single from the album was ": null
    },
    {
        "John the Revelator": "John The Revelator / Lilian"
    },
    {
        " , an uptempo electronic track with a running religious theme, accompanied by Lilian , a lush track that was a hit in many clubs all over the world.     To promote Playing the Angel, the band launched ": null
    },
    {
        "Touring the Angel": "Touring The Angel"
    },
    {
        ", a concert tour of Europe and North America that began in November 2005 and ran for nine months. During the last two legs of the tour Depeche Mode headlined a number of festivals including the ": null
    },
    {
        "Coachella Valley Music and Arts Festival": "Coachella Valley Music And Arts Festival"
    },
    {
        " and the ": null
    },
    {
        "O 2 Wireless Festival": "Wireless Festival"
    },
    {
        ". In total, the band played to more than 2.8 million people across 31 countries and the tour was one of the highest grossing and critically acclaimed tours of 2005/06. Speaking about the tour, Gahan praised it as probably the most enjoyable, rewarding live shows weve ever done. The new material was just waiting to be played live. It took on a life of its own. With the energy of the crowds, it just came to life. . ": null
    },
    {
        "Business Wire": "Business Wire"
    },
    {
        ". 11 September 2006. Two shows at ": null
    },
    {
        "Milans": "Milan"
    },
    {
        " Fila Forum": "Fila Forum"
    },
    {
        " were filmed and edited into a concert film, released on DVD as  Touring the Angel: Live in Milan . . Liveinmilan.depechemode.com.      A best-of compilation was released in November 2006, entitled  The Best Of, Volume 1  featuring a new single ": null
    },
    {
        "Martyr": "Martyr"
    },
    {
        " , an outtake from the Playing the Angel sessions. Later that month Depeche Mode received the ": null
    },
    {
        "MTV Europe Music Award": "2006 Mtv Europe Music Awards"
    },
    {
        " in the Best Group category. . DepecheMode.com. 2 November 2006.     In December 2006, ": null
    },
    {
        "iTunes": "Itunes"
    },
    {
        " released  The Complete Depeche Mode  as its fourth ever digital box-set. . Thecomplete.depechemode.com. 19 December 2006.     In August 2007, during promotion for Dave Gahans second solo album,  Hourglass , it was announced that Depeche Mode were heading back in studio in early 2008 to work on a new album. Van Isacker, B. . . Side-Line.     Sounds of the Universe ": null
    },
    {
        "Ben Hillier": "Ben Hillier"
    },
    {
        " to work on some songs that Martin Gore had demoed at his home studio in ": null
    },
    {
        "Santa Barbara, California": "Santa Barbara, California"
    },
    {
        ". Later that year it was announced that Depeche Mode were splitting from their long-term US label, Warner Music, and signing with ": null
    },
    {
        "EMI Music": "Emi"
    },
    {
        " worldwide. . ": null
    },
    {
        "EMI": "Emi"
    },
    {
        " Music. 7 October 2008. The album was created in four sessions, two in New York and two in Santa Barbara. A total of 22 songs were recorded, with the standard album being 13 songs in length while many of the others were released in subsequent deluxe editions. Kirn, Peter . .  Keyboard .        On 15 January 2009, the official Depeche Mode website announced that the bands 12th studio album would be called  Sounds of the Universe . . DepecheMode.com. 15 January 2009. The album was released in April 2009, also made available through an iTunes Pass, where the buyer received individual tracks in the weeks leading up to official release date. Andy Fletcher says the idea for their iTunes Pass was a combination of the bands and iTunes: I think the digital and record companies are starting to get their act together. They were very lazy in the first 10 years when downloads came in. Now theyre collaborating more and coming up with interesting ideas for fans to buy products. .  USA Weekend . 21 April 2009. The album went to number one in 21 countries. Critical response was generally positive and it was nominated for a Grammy in the ": null
    },
    {
        "Best Alternative Album": "Grammy Award For Best Alternative Music Album"
    },
    {
        " category.  ": null
    },
    {
        "Wrong": "Wrong"
    },
    {
        " was the first single from the album, released digitally in February 2009. Subsequent singles were ": null
    },
    {
        "Peace": "Peace"
    },
    {
        " and the double A-side ": null
    },
    {
        "Fragile Tension / Hole to Feed": "Fragile Tension / Hole To Feed"
    },
    {
        " . In addition, Perfect was released as a promotional-only single in the United States.     On 23 April 2009, Depeche Mode performed for the television program  Jimmy Kimmel Live!  at the ": null
    },
    {
        "famed corner": "Hollywood And Vine"
    },
    {
        " of ": null
    },
    {
        "Hollywood Boulevard": "Hollywood Boulevard"
    },
    {
        " and ": null
    },
    {
        "Vine Street": "Vine Street"
    },
    {
        ", drawing more than 12,000 fans, which was the largest audience the program had seen since its 2003 premiere, with a performance by Coldplay.      In May 2009, the band embarked on a concert tour in support of the album — called ": null
    },
    {
        "Tour of the Universe": "Tour Of The Universe"
    },
    {
        "; it had been announced at a press conference in October 2008 at the ": null
    },
    {
        "Olympiastadion": "Olympiastadion"
    },
    {
        " in Berlin.  There was a warm up show in ": null
    },
    {
        "Luxembourg": "Luxembourg"
    },
    {
        " and it officially started on 10 May 2009 in ": null
    },
    {
        "Tel Aviv": "Tel Aviv"
    },
    {
        ". The first leg of the tour was disrupted when Dave Gahan was struck down with ": null
    },
    {
        "gastroenteritis": "Gastroenteritis"
    },
    {
        ". During treatment, doctors found and removed a low grade tumour from the singers bladder. Gahans illness caused 16 concerts to be cancelled, but several of the shows were rescheduled for 2010.  The band headlined the ": null
    },
    {
        "Lollapalooza": "Lollapalooza"
    },
    {
        " festival during the North American leg of the tour. The tour also took the band back to South America for the first time since 1994s ": null
    },
    {
        "Exotic Tour": "Exotic Tour/Summer Tour 94"
    },
    {
        ". During the final European leg, the band played a show at Londons ": null
    },
    {
        "Royal Albert Hall": "Royal Albert Hall"
    },
    {
        " in aid of the ": null
    },
    {
        "Teenage Cancer Trust": "Teenage Cancer Trust"
    },
    {
        ", where former member Alan Wilder joined Martin Gore on stage for a performance of ": null
    },
    {
        "Somebody": "Blasphemous Rumours / Somebody"
    },
    {
        " .   In total the band played to more than 2.7 million people across 32 countries and the tour was one of the most profitable in America in 2009.   The concerts held at ": null
    },
    {
        "Palau Sant Jordi": "Palau Sant Jordi"
    },
    {
        ", ": null
    },
    {
        "Barcelona, Spain": "Barcelona"
    },
    {
        " were filmed and later released on DVD and ": null
    },
    {
        "Blu-ray Disc": "Blu-Ray"
    },
    {
        " release entitled  Tour of the Universe: Barcelona 20/21.11.09 .  In March 2010, Depeche Mode won the award for Best International Group – Rock / Pop at the ": null
    },
    {
        "ECHO Awards": "Echo"
    },
    {
        " in Germany.      On 6 June 2011, as the final commitment to their contract with EMI,  the band released a ": null
    },
    {
        "remix": "Remix Album"
    },
    {
        " compilation album": "Compilation Album"
    },
    {
        ", entitled  Remixes 2: 81–11  that features remixes by former members Vince Clarke and Alan Wilder.   Other remixers involved with the project were ": null
    },
    {
        "Nick Rhodes": "Nick Rhodes"
    },
    {
        " of ": null
    },
    {
        "Duran Duran": "Duran Duran"
    },
    {
        ", Van Isacker, B. . . Side-Line. ": null
    },
    {
        "Röyksopp": "Röyksopp"
    },
    {
        ", Karlsson & Winnberg of ": null
    },
    {
        "Miike Snow": "Miike Snow"
    },
    {
        ", ": null
    },
    {
        "Eric Prydz": "Eric Prydz"
    },
    {
        ", ": null
    },
    {
        "Clark": "Chris Clark"
    },
    {
        " and more.  A new remix of Personal Jesus by ": null
    },
    {
        "Stargate": "Stargate"
    },
    {
        ", entitled ": null
    },
    {
        "Personal Jesus 2011": "Personal Jesuspersonal Jesus 2011"
    },
    {
        " , was released as a single on 30 May 2011, in support of the compilation.     Depeche Mode contributed their cover of the U2 song ": null
    },
    {
        "So Cruel": "So Cruel"
    },
    {
        " to the tribute album  AHK-toong BAY-bi Covered  honouring the 20th anniversary of  Achtung Baby , a 1991 album by ": null
    },
    {
        "U2": "U2"
    },
    {
        ". The compilation CD was released with the December 2011 issue of  Q .       Delta Machine ": null
    },
    {
        "Tel Aviv": "Tel Aviv"
    },
    {
        " and continuing in Europe and North America.  Martin Gore revealed that Flood mixed the album, marking the producers first studio collaboration with the band since 1993s Songs of Faith and Devotion.     In December 2012, the band officially announced signing a worldwide deal with ": null
    },
    {
        "Columbia Records": "Columbia Records"
    },
    {
        " and releasing a new album in March 2013.  On 24 January 2013, it was confirmed that the album was titled  Delta Machine .  ": null
    },
    {
        "Heaven": "Heaven"
    },
    {
        " , the debut single from Delta Machine was released commercially on Friday 1 February 2013 . The release date in the UK was pushed back to 18 March 2013 . The physical release still bore the Mute Records logo, even though the band have now severed ties with their long standing label. Andy Fletcher mentioned in an interview this was due to their devotion to the label and with the bands insistence.     In March, the band announced North American dates to its ": null
    },
    {
        "Delta Machine summer tour": "The Delta Machine Tour"
    },
    {
        ", starting 22 August from ": null
    },
    {
        "Detroit": "Detroit"
    },
    {
        " and ending 8 October in ": null
    },
    {
        "Phoenix": "Phoenix, Arizona"
    },
    {
        ".  In June, other European dates  were confirmed for early 2014. The final gig of Delta Machine Tour took place in Moscow on 7 March 2014, at Olimpiski venue.     That month, Depeche Mode won the award for Best International Group – Rock / Pop at the ": null
    },
    {
        "ECHO Awards": "Echo"
    },
    {
        " in Germany. Also they were nominated at the category Album des Jahres for Delta Machine, but lost against ": null
    },
    {
        "Helene Fischers": "Helene Fischer"
    },
    {
        " Farbenspiel.       On 8 October 2014, the band announced  Live in Berlin , the new video and audio release filmed and recorded at the ": null
    },
    {
        "O2 World": "O2 World"
    },
    {
        " in Berlin, Germany in November 2013 during the Delta Machine Tour. It was released on 17 November 2014 worldwide. . DepecheMode.com. 8 October 2014.     In a 2015 Rolling Stone interview celebrating the 25th anniversary of  Violator , Martin Gore stated that ": null
    },
    {
        "Johnny Cashs": "Johnny Cash"
    },
    {
        "cover of ": null
    },
    {
        "Personal Jesus": "Personal Jesus"
    },
    {
        " is his favorite cover version of a Depeche Mode song.      Spirit      In September, the official Depeche Mode ": null
    },
    {
        "Facebook": "Facebook"
    },
    {
        " page hinted at a new release, later confirmed by the band to be a music video compilation, Video Singles Collection, scheduled for release in November by ": null
    },
    {
        "Sony": "Sony"
    },
    {
        ".   In October 2016, the band announced that their fourteenth album, titled  Spirit  and produced by ": null
    },
    {
        "James Ford": "James Ford"
    },
    {
        ", would be released in spring 2017.  The group has also been nominated for the 2018 ": null
    },
    {
        "Rock and Roll Hall of Fame": "Rock And Roll Hall Of Fame"
    },
    {
        ".      ": null
    },
    {
        "Wheres the Revolution": "Wheres The Revolution"
    },
    {
        " , the lead single from Spirit, was released 3 February 2017, along with its lyric video. The official video was published a week later, on 9 February.  The Global Spirit Tour officially kicked off on 5 May 2017 with a performance in Stockholm, Sweden, at the Friends Arena. The first leg of the tour covered European countries only, ending with a final stadium show in Cluj-Napoca, Romania, at the Cluj Arena. The second leg of the tour covered North America and returned to Europe. The North America leg of the tour kicked off in Salt Lake City, Utah, on 23 August, at the USANA Amphitheatre. The band remained in North America until 15 November when they left for Dublin to resume the European leg. The band ended the tour in Europe with two sold-out shows on 23 and 25 July 2018 in Berlin, Germany, at the Waldbühne.    In September 2019, the band announced that  Spirits in the Forest , a documentary that was partially filmed during these shows, would be released in theaters for one night only, November 21, 2019.        Depeche Mode drew its artistic influences from a wide range of artists and scenes. They cited the electronic ": null
    },
    {
        "quartet": "Quartet"
    },
    {
        " band ": null
    },
    {
        "Kraftwerk": "Kraftwerk"
    },
    {
        " as a primary influence for everyone in the band. Gore related what was their intent at their beginnings. My dream was to combine the emotion of ": null
    },
    {
        "Neil Young": "Neil Young"
    },
    {
        " or ": null
    },
    {
        "John Lennon": "John Lennon"
    },
    {
        " transmitted by Kraftwerks synthesizers. Soul music played by electronic instruments.  They also cited ": null
    },
    {
        "David Bowie": "David Bowie"
    },
    {
        ", ": null
    },
    {
        "The Clash": "The Clash"
    },
    {
        ",  ": null
    },
    {
        "Roxy Music": "Roxy Music"
    },
    {
        " and ": null
    },
    {
        "Brian Eno": "Brian Eno"
    },
    {
        ",  ": null
    },
    {
        "Elvis Presley": "Elvis Presley"
    },
    {
        ", ": null
    },
    {
        "the Velvet Underground": "The Velvet Underground"
    },
    {
        ",  and ": null
    },
    {
        "blues": "Blues"
    },
    {
        ".  Depeche Modes music has mainly been described as ": null
    },
    {
        "synth-pop": "Synth-Pop"
    },
    {
        ",   Cairns, Dan .  The Times .  ": null
    },
    {
        "new wave": "New Wave Music"
    },
    {
        ",   ": null
    },
    {
        "electronic rock": "Electronic Rock"
    },
    {
        ",     ": null
    },
    {
        "dance-rock": "Dance-Rock"
    },
    {
        "   alternative rock": "Alternative Rock"
    },
    {
        ", ": null
    },
    {
        "arena rock": "Arena Rock"
    },
    {
        "  and ": null
    },
    {
        "pop rock": "Pop Rock"
    },
    {
        ".  The band also experimented with various other genres throughout its career, including ": null
    },
    {
        "avant-garde": "Avant-Garde Music"
    },
    {
        ", ": null
    },
    {
        "electronica": "Electronica"
    },
    {
        ", ": null
    },
    {
        "pop": "Pop Music"
    },
    {
        ", ": null
    },
    {
        "soul": "Soul Music"
    },
    {
        ", ": null
    },
    {
        "techno": "Techno"
    },
    {
        ", ": null
    },
    {
        "industrial rock": "Industrial Rock"
    },
    {
        " and ": null
    },
    {
        "heavy metal": "Heavy Metal Music"
    },
    {
        ".      Depeche Mode were considered a teen pop band during their early period in the UK, and interviewed in teen pop magazines such as  Smash Hits .   Following the departure of ": null
    },
    {
        "Vince Clarke": "Vince Clarke"
    },
    {
        ", their music began to take on a darker tone, establishing a darker sound in the bands music, as Martin Gore assumed lead songwriting duties. Gores lyrics included themes such as sex, religion, and politics.  Gore has stated he feels lyrical themes which tackle issues related to solitude and loneliness are a better representation of reality, whereas he finds happy songs fake and unrealistic.  At the same time, he asserts that the bands music contains an element of hope. Condran, Ed . .  South Philly Review .          Depeche Mode have released a total of 14 studio albums, 10 compilation albums, six live albums, eight box sets, 13 video albums, 71 music videos, and 54 singles. They have sold over 100 million records and played live to more than 30 million fans worldwide. The band has had 50 songs in the UK Singles Chart, and one US and two UK number-one albums. . EMI Music. 1 May 2009. In addition, all of their studio albums have reached the UK Top 10 and their albums have spent over 210 weeks on the UK Charts.      Music critic ": null
    },
    {
        "Sasha Frere-Jones": "Sasha Frere-Jones"
    },
    {
        " claimed that the last serious English influence was Depeche Mode, who seem more and more significant as time passes. Frere-Jones, Sasha . .  The New Yorker . Depeche Modes releases have been nominated for five Grammy Awards:  Devotional  for ": null
    },
    {
        "Best Long Form Music Video": "Grammy Award For Best Music Film"
    },
    {
        "; ": null
    },
    {
        "I Feel Loved": "I Feel Loved"
    },
    {
        " and ": null
    },
    {
        "Suffer Well": "Suffer Well"
    },
    {
        " , both for ": null
    },
    {
        "Best Dance Recording": "Grammy Award For Best Dance Recording"
    },
    {
        ";  Sounds of the Universe  for Best Alternative Album; and ": null
    },
    {
        "Wrong": "Wrong"
    },
    {
        " for ": null
    },
    {
        "Best Short Form Music Video": "Grammy Award For Best Music Video"
    },
    {
        ". In addition, Depeche Mode have been honoured with a ": null
    },
    {
        "Brit Award": "Brit Awards"
    },
    {
        " for ": null
    },
    {
        "Enjoy the Silence": "Enjoy The Silence"
    },
    {
        " in the Best British Single category, the first-ever Q Magazine Innovation Award, and an Ivor Novello Award for ": null
    },
    {
        "Martin Gore": "Martin Gore"
    },
    {
        " in the category of International Achievement.     Depeche Mode were called the most popular electronic band the world has ever known by Q magazine,  one of the greatest British pop groups of all time by  The Sunday Telegraph , . DepecheMode.co.il. 12 March 2005. and the quintessential eighties techno-pop band by  Rolling Stone  and ": null
    },
    {
        "AllMusic": "Allmusic"
    },
    {
        ". They were ranked No. 2 on Electronic Music Realms list of The 100 Greatest Artists of Electronic Music,  ranked No. 158 on Acclaimed Musics list of Top 1000 Artists of All Time  and Q Magazine included them on their list of 50 bands that changed the world . In an interview in 2009, ": null
    },
    {
        "Simple Minds": "Simple Minds"
    },
    {
        " lead singer ": null
    },
    {
        "Jim Kerr": "Jim Kerr"
    },
    {
        " argued that Depeche Mode and ": null
    },
    {
        "U2": "U2"
    },
    {
        " were the only contemporaries of his band which could be said to have stayed constantly relevant .        Several major artists have cited the band as an influence, including: ": null
    },
    {
        "No Doubt": "No Doubt"
    },
    {
        ",  ": null
    },
    {
        "Marilyn Manson": "Marilyn Manson"
    },
    {
        ", ": null
    },
    {
        "The Killers": "The Killers"
    },
    {
        ",   ": null
    },
    {
        "Crosses": "Crosses"
    },
    {
        ", ": null
    },
    {
        "Coldplay": "Coldplay"
    },
    {
        ", ": null
    },
    {
        "Lady Gaga": "Lady Gaga"
    },
    {
        ", ": null
    },
    {
        "Muse": "Muse"
    },
    {
        ", ": null
    },
    {
        "Linkin Park": "Linkin Park"
    },
    {
        ",  . ": null
    },
    {
        "Mute": "Mute Records"
    },
    {
        ". ": null
    },
    {
        "The Crystal Method": "The Crystal Method"
    },
    {
        ",  ": null
    },
    {
        "Fear Factory": "Fear Factory"
    },
    {
        ", . Prog4you.com. ": null
    },
    {
        "La Roux": "La Roux"
    },
    {
        ",  ": null
    },
    {
        "Gotye": "Gotye"
    },
    {
        ",  ": null
    },
    {
        "Rammstein": "Rammstein"
    },
    {
        ", Kruspe, Richard . . Jam Magazine Online. ": null
    },
    {
        "a-ha": "A-Ha"
    },
    {
        ", Van Isacker, B. . . Side-Line. ": null
    },
    {
        "Arcade Fire": "Arcade Fire"
    },
    {
        ",  ": null
    },
    {
        "Nine Inch Nails": "Nine Inch Nails"
    },
    {
        ", and ": null
    },
    {
        "Chvrches": "Chvrches"
    },
    {
        ".      Depeche Mode contemporaries ": null
    },
    {
        "Pet Shop Boys": "Pet Shop Boys"
    },
    {
        "  . and ": null
    },
    {
        "Gary Numan": "Gary Numan"
    },
    {
        "  have also cited the band as an influence.     The dark themes and moods of Depeche Modes lyrics and music have been enjoyed by several ": null
    },
    {
        "heavy metal": "Heavy Metal Music"
    },
    {
        " artists, and the band influenced acts such as ": null
    },
    {
        "Marilyn Manson": "Marilyn Manson"
    },
    {
        ", and ": null
    },
    {
        "Deftones": "Deftones"
    },
    {
        ".  They have also been named as an influence on ": null
    },
    {
        "Detroit techno": "Detroit Techno"
    },
    {
        " and ": null
    },
    {
        "indie rock": "Indie Rock"
    },
    {
        ".        Early in their career, Depeche Mode were dismissive of benefit concerts such as ": null
    },
    {
        "Live Aid": "Live Aid"
    },
    {
        ". Martin himself stated, If these bands really care so much, they should just donate the money and let that be it. Why cant they do it without all the surrounding hype? . But in recent years, the band have applied their celebrity and cultural longevity to help promote and raise funds for several notable charity endeavours. They lent their support to high-profile charities such as ": null
    },
    {
        "MusiCares": "Musicares"
    },
    {
        ", ": null
    },
    {
        "Cancer Research UK": "Cancer Research Uk"
    },
    {
        " and the ": null
    },
    {
        "Teenage Cancer Trust": "Teenage Cancer Trust"
    },
    {
        ". The band has also supported the Small Steps Project, a humanitarian organisation based in the United Kingdom, aiming to assist economically disadvantaged children into education.  Since 2010, Depeche Mode have partnered with Swiss watchmaker ": null
    },
    {
        "Hublot": "Hublot"
    },
    {
        " to support Charity: Water, aimed at the provision of clean drinking water in developing countries.  In 2014, the partnership hosted a gala and fundraiser at the ": null
    },
    {
        "TsUM": "Tsum"
    },
    {
        " building in Moscow, raising $1.4 million for the charity.        Current members ": null
    },
    {
        "Andy Fletcher": "Andy Fletcher"
    },
    {
        "– keyboards, backing vocals   ": null
    },
    {
        "Martin Gore": "Martin Gore"
    },
    {
        "– keyboards, guitars, backing and lead vocals   ": null
    },
    {
        "Dave Gahan": "Dave Gahan"
    },
    {
        "– lead vocals     Touring members – drums, percussion   ": null
    },
    {
        "Peter Gordeno": "Peter Gordeno"
    },
    {
        "– keyboards, bass guitar, piano, backing vocals     Former members ": null
    },
    {
        "Vince Clarke": "Vince Clarke"
    },
    {
        "– keyboards, lead and backing vocals, guitars   ": null
    },
    {
        "Alan Wilder": "Alan Wilder"
    },
    {
        "– keyboards, piano, percussion, backing vocals     Timeline       ImageSize width:1000 height:250   PlotArea left:85 bottom:60 top:05 right:10   Alignbars justify   DateFormat mm/dd/yyyy   Period from:01/01/1980 till:12/31/2017   TimeAxis orientation:horizontal format:yyyy     Colors   id:Vocals value:red legend:Vocals   id:Bvocals value:pink legend:Backing_vocals   id:Guitars value:green legend:Guitars   id:Keyboards value:purple legend:Keyboards   id:Bass value:blue legend:Bass   id:Drums value:orange legend:Percussion   id:studio value:black legend:Studio_album   Legend orientation:hor position:bottom     ScaleMajor increment:2 start:1980     LineData   color:studio   layer:back   at:10/29/1981   at:09/27/1982   at:08/22/1983   at:09/24/1984   at:03/17/1986   at:09/28/1987   at:03/19/1990   at:03/22/1993   at:04/14/1997   at:05/14/2001   at:10/17/2005   at:04/20/2009   at:03/22/2013   at:03/17/2017     BarData   bar:Gahan text: Dave Gahan   bar:Gore text: Martin Gore   bar:Wilder text: Alan Wilder   bar:Clarke text: Vince Clarke   bar:Fletcher text: Andy Fletcher     PlotData   width:11 textcolor:black align:left anchor:from shift:   bar:Gahan from:10/29/1980 till:end color:Vocals   bar:Gore from:03/01/1980 till:end color:Keyboards   bar:Gore from:03/01/1980 till:end color:Vocals width:3   bar:Gore from:09/07/1983 till:03/11/1984 color:Guitars width:7   bar:Gore from:07/15/1987 till:end color:Guitars width:7   bar:Fletcher from:01/01/1980 till:10/29/1980 color:Bass   bar:Fletcher from:10/29/1980 till:end color:Keyboards   bar:Fletcher from:10/29/1980 till:end color:Bvocals width:3   bar:Fletcher from:03/19/1990 till:05/01/1997 color:Bass width:7   bar:Clarke from:01/01/1980 till:10/29/1980 color:Vocals width:3   bar:Clarke from:01/01/1980 till:10/29/1980 color:Guitars   bar:Clarke from:10/29/1980 till:12/03/1981 color:Bvocals width:3   bar:Clarke from:10/29/1980 till:12/03/1981 color:Keyboards   bar:Wilder from:10/14/1982 till:06/11/1995 color:Keyboards   bar:Wilder from:03/19/1990 till:06/11/1995 color:Drums width:7   bar:Wilder from:10/14/1982 till:06/11/1995 color:Bvocals width:3               Speak & Spell     A Broken Frame     Construction Time Again     Some Great Reward     Black Celebration     Music for the Masses     Violator     Songs of Faith and Devotion     Ultra     Exciter     Playing the Angel     Sounds of the Universe     Delta Machine     Spirit ": null
    }
]