[
    {
        "             A detonator, frequently a blasting cap, is a device used to trigger an ": null
    },
    {
        "explosive device": "explosive device"
    },
    {
        ". Detonators can be chemically, mechanically, or electrically initiated, the latter two being the most common.     The commercial use of explosives uses electrical detonators or the capped fuse which is a length of safety ": null
    },
    {
        "fuse": "fuse"
    },
    {
        " to which an ordinary detonator has been joined. Many detonators ": null
    },
    {
        "primary explosive": "primary explosive"
    },
    {
        " is a material called ASA compound. This compound is formed from ": null
    },
    {
        "lead azide": "lead azide"
    },
    {
        ", ": null
    },
    {
        "lead styphnate": "lead styphnate"
    },
    {
        " and ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " and is pressed into place above the base charge, usually ": null
    },
    {
        "TNT": "trinitrotoluene"
    },
    {
        " or ": null
    },
    {
        "tetryl": "tetryl"
    },
    {
        " in military detonators and ": null
    },
    {
        "PETN": "petn"
    },
    {
        " in commercial detonators.     Other materials such as DDNP  are also used as the primary charge to reduce the amount of lead emitted into the atmosphere by mining and quarrying operations. Old detonators used ": null
    },
    {
        "mercury fulminate": "mercury fulminate"
    },
    {
        " as the primary, often mixed with ": null
    },
    {
        "potassium chlorate": "potassium chlorate"
    },
    {
        " to yield better performance.     A blasting cap is a small ": null
    },
    {
        "sensitive": "sensitivity"
    },
    {
        " primary explosive": "primary explosive"
    },
    {
        " device generally used to detonate a larger, more powerful and less sensitive ": null
    },
    {
        "secondary explosive": "secondary explosive"
    },
    {
        " such as ": null
    },
    {
        "TNT": "trinitrotoluene"
    },
    {
        ", ": null
    },
    {
        "dynamite": "dynamite"
    },
    {
        ", or ": null
    },
    {
        "plastic explosive": "plastic explosive"
    },
    {
        ".     Blasting caps come in a variety of types, including non-electric caps, electric caps, and fuse caps. They are used in commercial mining, excavation, and ": null
    },
    {
        "demolition": "demolition"
    },
    {
        ". Electric types are set off by a short burst of current sent by a ": null
    },
    {
        "blasting machine": "blasting machine"
    },
    {
        " via a long wire to the cap to ensure safety. Traditional fuse caps have a ": null
    },
    {
        "fuse": "fuse"
    },
    {
        " which is ignited by a flame source, such as a match or a lighter.       The need for detonators such as blasting caps came from the development of safer explosives. Different explosives require different amounts of energy  to detonate. Most commercial explosives are formulated with a high activation energy, to make them stable and safe to handle so they will not explode if accidentally dropped, mishandled, or exposed to fire. These are called ": null
    },
    {
        "secondary explosive": "secondary explosive"
    },
    {
        "s. However they are correspondingly difficult to detonate intentionally, and require a small initiating explosion. This is provided by a detonator.     A detonator contains an easy-to-ignite ": null
    },
    {
        "primary explosive": "primary explosive"
    },
    {
        " that provides the initial ": null
    },
    {
        "activation energy": "activation energy"
    },
    {
        " to start the detonation in the main charge. Explosives commonly used in detonators include ": null
    },
    {
        "mercury fulminate": "mercury fulminate"
    },
    {
        ", ": null
    },
    {
        "lead azide": "lead azide"
    },
    {
        ", ": null
    },
    {
        "lead styphnate": "lead styphnate"
    },
    {
        ", ": null
    },
    {
        "tetryl": "tetryl"
    },
    {
        ", and ": null
    },
    {
        "DDNP": "diazodinitrophenol"
    },
    {
        ". Blasting caps and some detonators are stored separately and not inserted into the main explosive charge until just before use, keeping the main charge safe.   Early blasting caps also used silver fulminate, but it has been replaced with cheaper and safer primary explosives.   Silver azide is still used sometimes, but very rarely due to its high price.     Detonators are hazardous for untrained personnel to handle since they contain primary explosive. They are sometimes not recognized as explosives due to their appearance, leading to injuries.           Ordinary detonators usually take the form of ignition-based explosives. While they are mainly used in commercial operations, ordinary detonators are still used in military operations. This form of detonator is most commonly initiated using a ": null
    },
    {
        "safety fuse": "safety fuse"
    },
    {
        ", and used in non time-critical detonations e.g. ": null
    },
    {
        "conventional munitions disposal": "bomb disposaluxo"
    },
    {
        ". Well known detonators are ": null
    },
    {
        "lead azide": "lead azide"
    },
    {
        " silver azide": "silver azide"
    },
    {
        " and ": null
    },
    {
        "mercury fulminate": "mercury fulminate"
    },
    {
        "       There are three categories of electrical detonators: instantaneous electrical detonators , short period delay detonators  and long period delay detonators . SPDs are measured in milliseconds and LPDs are measured in seconds. In situations where nanosecond accuracy is required, specifically in the implosion charges in ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s, ": null
    },
    {
        "exploding-bridgewire detonator": "exploding-bridgewire detonator"
    },
    {
        "s are employed. The initial shock wave is created by vaporizing a length of a thin wire by an ": null
    },
    {
        "electric discharge": "electric discharge"
    },
    {
        ". A new development is a ": null
    },
    {
        "slapper detonator": "slapper detonator"
    },
    {
        ", which uses thin plates accelerated by an electrically exploded wire or foil to deliver the initial shock. It is in use in some modern weapons systems. A variant of this concept is used in mining operations, when the foil is exploded by a ": null
    },
    {
        "laser": "laser"
    },
    {
        " pulse delivered to the foil by ": null
    },
    {
        "optical fiber": "optical fiber"
    },
    {
        "  Non-electric detonators were invented by the Swedish company Nitro Nobel in the 42s and 42s, under the leadership of Per-Anders Persson, and launched to the demolitions market in 42 Nonel is a contraction of Non-electric detonators .       In civil mining, electronic detonators have a better precision for delays. Electronic detonators are designed to provide the precise control necessary to produce accurate and consistent blasting results in a variety of blasting applications in the mining, quarrying, and construction industries. Electronic detonators may be programmed in millisecond or sub-millisecond increments from 42 millisecond to 42 milliseconds using the dedicated programming device called the logger.     Benefits:     Safety mechanisms within the fusehead ensure detonators do not fire unexpectedly.   Delay range of 42–42 ms in millisecond or sub-millisecond increments.   Precision of 42% of nominal delay time.   Safe and reliable initiation of up to 42 units  per blast.   Unique ID in each detonator.   Testing of detonators and the network prior to each blast.       Wireless electronic detonators are beginning to be available in the civil mining market.  Encrypted radio signals are used to communicate the blast signal to each detonator at the correct time. While currently expensive, wireless detonators can enable new mining techniques as multiple blasts can be loaded at once and fired in sequence without putting humans in harms way.       A number 42 test blasting cap is one containing 42 grams of a mixture of 42 percent mercury fulminate and 42 percent potassium chlorate, or a blasting cap of equivalent strength. An equivalent strength cap comprises 4242 grams of PETN base charge pressed in an aluminum shell with bottom thickness not to exceed to 42 of an inch, to a specific gravity of not less than 42 g/cc, and primed with standard weights of primer depending on the manufacturer.              The oldest and simplest type of cap, fuse caps are a metal cylinder, closed at one end. From the open end inwards, there is first an empty space into which a pyrotechnic ": null
    },
    {
        "fuse": "fuse"
    },
    {
        " is inserted and crimped, then a pyrotechnic ignition mix, a ": null
    },
    {
        "primary explosive": "primary explosive"
    },
    {
        ", and then the main detonating explosive charge.     The primary hazard of pyrotechnic blasting caps is that for proper usage, the fuse must be inserted and then crimped into place by crushing the base of the cap around the fuse. If the tool used to crimp the cap is used too close to the explosives, the primary explosive compound can detonate during crimping. A common hazardous practice is crimping caps with ones teeth; an accidental detonation can cause serious injury to the mouth.     Fuse type blasting caps are still in active use today. They are the safest type to use around certain types of electromagnetic interference, and they have a built in time delay as the fuse burns down.       Solid pack electric blasting caps use a thin ": null
    },
    {
        "bridgewire": "bridgewire"
    },
    {
        " in direct contact with a primary explosive, which is heated by electric current and causes the detonation of the primary explosive. That primary explosive then detonates a larger charge of secondary explosive.     Some solid pack fuses incorporate a small pyrotechnic delay element, up to a few hundred milliseconds, before the cap fires.       Match type blasting caps use an ": null
    },
    {
        "electric match": "electric match"
    },
    {
        " to initiate the primary explosive, rather than direct contact between the bridgewire and the primary explosive. The match can be manufactured separately from the rest of the cap and only assembled at the end of the process.     Match type caps are now the most common type found worldwide.            This type of detonator was invented in the 42s as part of the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        " to develop nuclear weapons. The design goal was to produce a detonator which acted very rapidly and predictably. Both Match and Solid Pack type electric caps take a few milliseconds to fire, as the bridgewire heats up and heats the explosive to the point of detonation. Explosive bridgewire or EBW detonators use a higher voltage electric charge and a very thin bridgewire, .42 inch long, .42 diameter, . Instead of heating up the explosive, the EBW detonator wire is heated so quickly by the high firing current that the wire actually vaporizes and explodes due to electric resistance heating. That electrically driven explosion then fires the detonators initiator explosive .     Some similar detonators use a thin metal foil instead of a wire, but operate in the same manner as true bridgewire detonators.     In addition to firing very quickly when properly activated, EBW detonators are safe from stray static electricity and other electric current. Enough current and the bridgewire may melt, but it is small enough that it cannot detonate the initiator explosive unless the full high-voltage high-current charge passes through the bridgewire. EBW detonators are used in many civilian applications where radio signals, static electricity, or other electrical hazards might cause accidents with conventional electric detonators.            Slapper detonators are an improvement on EBW detonators. Slappers, instead of directly using the exploding foil to detonate the initiator explosive, use the electrical vaporization of the foil to drive a small circle of insulating material such as ": null
    },
    {
        "PET film": "pet film"
    },
    {
        " or ": null
    },
    {
        "kapton": "kapton"
    },
    {
        " down a circular hole in an additional disc of insulating material. At the far end of that hole is a pellet of conventional initiator explosive.     The conversion efficiency of energy from electricity into kinetic energy of the flying disk or slapper can be 42–42%.     Since the slapper impacts a wide area - 42 thousandths or roughly one mm across - of the explosive, rather than a thin line or point as in an exploding foil or bridgewire detonator, the detonation is more regular and requires less energy. Reliable detonation requires raising a minimum volume of explosive to temperatures and pressures at which detonation starts. If energy is deposited at a single point, it can radiate away in the explosive in all directions in rarefaction or expansion waves, and only a small volume is efficiently heated or compressed. The flier disc loses impact energy at its sides to rarefaction waves, but a conical volume of explosive is efficiently shock compressed.     Slapper detonators are used in ": null
    },
    {
        "nuclear weapons": "nuclear weapons"
    },
    {
        ". These components require large quantities of energy to initiate, making them extremely unlikely to accidentally discharge.       In this type, a pulse from a ": null
    },
    {
        "laser": "laser"
    },
    {
        " passes down an ": null
    },
    {
        "optical fiber": "optical fiber"
    },
    {
        " to strike and thus initiate a carbon-doped explosive. These initiators are highly reliable. Unintentional initiation is very difficult as the explosive can only be detonated by the attached laser, which is precisely tuned to do so, or a completely independent laser that matches.       The first blasting cap or detonator was demonstrated in 42 when British physician and apothecary ": null
    },
    {
        "William Watson": "william watson"
    },
    {
        ", ": null
    },
    {
        "F.R.S.": "fellow of the royal society"
    },
    {
        ", showed that the ": null
    },
    {
        "electric spark": "electric spark"
    },
    {
        " of a ": null
    },
    {
        "friction machine": "electrostatic generatorfriction machines"
    },
    {
        " could ignite black powder, by way of igniting a flammable substance mixed in with the black powder.   But I can, at pleasure, fire gunpowder, and even discharge a musket, by the power of electricity, when the gunpowder has been ground with a little camphor, or with a few drops of some inflammable chemical oil.     In 42 ": null
    },
    {
        "Benjamin Franklin": "benjamin franklin"
    },
    {
        " in Philadelphia made a commercial blasting cap consisting of a paper tube full of ": null
    },
    {
        "black powder": "black powder"
    },
    {
        ", with wires leading in both sides and wadding sealing up the ends. The two wires came close but did not touch, so a large electric spark discharge between the two wires would fire the cap. Franklin, Benjamin, Experiments and Observations on Electricity at Philadelphia in America … , p. 42  A small cartridge is filled with dry powder, hard rammed, so as to bruise some of the grains; two pointed wires are then thrust in, one at each end, the points approaching each other in the middle of the cartridge till within the distance of half an inch then, the cartridge being placed in the circle when the four ": null
    },
    {
        " [Leyden] jars": "leyden jar"
    },
    {
        " are discharged, the electric flame leaping from the point of one wire to the point of the other, within the cartridge amongst the powder, fires it, and the explosion of the powder is at the same instant with the crack of the discharge.     In 42 a hot wire detonator was produced by American chemist ": null
    },
    {
        "Robert Hare": "robert hare"
    },
    {
        ", although attempts along similar lines had earlier been attempted by the Italians Volta and Cavallo.  Hare constructed his blasting cap by passing a multistrand wire through a charge of gunpowder inside a tin tube; he had cut all but one fine strand of the multistrand wire so that the fine strand would serve as the hot bridgewire. When a strong current from a large battery was passed through the fine strand, it became incandescent and ignited the charge of gunpowder. Hare, Robert  The Mechanics Magazine, … , 42: 42–42 Note: Robert Hare had constructed his large battery in 42 See: Hare, R.  The American Journal of Science and Arts, 42: 42–42     In 42 ": null
    },
    {
        "Alfred Nobel": "alfred nobel"
    },
    {
        " realized that although nitroglycerin could not be detonated by a fuse, it could be detonated by the explosion of a small charge of gunpowder, which in turn was ignited by a fuse. Patent for nitroglycerin: Nobel, A., British patent no. 42 . Within a year, he was adding ": null
    },
    {
        "mercury fulminate": "mercury fulminate"
    },
    {
        " to the gunpowder charges of his detonators, and by 42 he was using small copper capsules of mercury fulminate, triggered by a fuse, to detonate nitroglycerin. See:   Patent for dynamite: Nobel, Alfred, English patent no. 42 .   Nobel, Alfred, , U.S. patent no. 42 .   de Mosenthal, Henry  Journal of the Society of Chemical Industry, 42: 42–42; see p. 42     In 42 Henry Julius Smith of Boston, Massachusetts, introduced a cap that combined a spark gap ignitor and mercury fulminate, the first electric cap able to detonate dynamite. Smith, H. Julius,  U.S. Patent no. 42 .     In 42 H. Julius Smith—and then in 42 Perry G. Gardner of North Adams, Massachusetts—developed electric detonators that combined a hot wire detonator with mercury fulminate explosive. Cooper, Paul W., Explosives Engineering , p. 42 See:   Smith, H. Julius,  U.S. Patent no. 42 .   Smith, H. Julius,  U.S. Patent no. 42 . Gardner, Perry G.,  U.S. Patent no. 42 . These were the first generally modern type blasting caps. Modern caps use different explosives and separate primary and secondary explosive charges, but are generally very similar to the Gardner and Smith caps.     H. Julius Smith also invented the first satisfactory ": null
    },
    {
        "portable power supply for igniting blasting caps": "blasting machine"
    },
    {
        ": a ": null
    },
    {
        "high-voltage magneto": "ignition magneto"
    },
    {
        " that was driven by a ": null
    },
    {
        "rack and pinion": "rack and pinion"
    },
    {
        ", which in turn was driven by a T-handle that was pushed downwards. See:   Smith, H. Julius,  U.S. Patent no. 42 .   Smith, H. Julius,  U.S. Patent no. 42 .   Smith, Henry Julius,  U.S. Patent no. 42 .   Krehl, Peter O. K., History of Shock Waves, Explosions and Impact: A Chronological and Biographical Reference , p. 42     Electric match caps were developed in the early 42s in Germany, and spread to the US in the 42s when ": null
    },
    {
        "ICI International": "imperial chemical industries"
    },
    {
        " purchased Atlas Powder Co. These match caps have become the predominant world standard cap type.       G42 detonator, in Battlestar Galactica    ": null
    },
    {
        "Ion detonator": "ion detonator"
    },
    {
        ", in the video game Destroy All Humans! ": null
    },
    {
        "Mk42 detonator": "mk2 detonator"
    },
    {
        ", in the video game GoldenEye: Rogue Agent ": null
    },
    {
        "Thermal detonator": "thermal detonator"
    },
    {
        ", in the film series Star Wars": null
    }
]