[
    {
        "     Diatomic molecules are ": null
    },
    {
        "molecules": "molecule"
    },
    {
        "composed of only two ": null
    },
    {
        "atom": "atom"
    },
    {
        "s, of the same or different ": null
    },
    {
        "chemical element": "chemical element"
    },
    {
        "s. The prefix di- is of Greek origin, meaning two . If a diatomic molecule consists of two atoms of the same element, such as ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " or ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " , then it is said to be ": null
    },
    {
        "homonuclear": "homonuclear molecule"
    },
    {
        ". Otherwise, if a diatomic molecule consists of two different atoms, such as ": null
    },
    {
        "carbon monoxide": "carbon monoxide"
    },
    {
        " or ": null
    },
    {
        "nitric oxide": "nitric oxide"
    },
    {
        " , the molecule is said to be ": null
    },
    {
        "heteronuclear": "heteronuclear molecule"
    },
    {
        ". The bond in a homonuclear diatomic molecule is non-polar.          The only ": null
    },
    {
        "chemical elements": "chemical element"
    },
    {
        "that form stable ": null
    },
    {
        "homonuclear": "homonuclear molecule"
    },
    {
        " diatomic molecules at ": null
    },
    {
        "standard temperature and pressure": "standard temperature and pressure"
    },
    {
        "  are the ": null
    },
    {
        "gas": "gas"
    },
    {
        "es ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " , ": null
    },
    {
        "nitrogen": "nitrogen"
    },
    {
        " , ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " , ": null
    },
    {
        "fluorine": "fluorine"
    },
    {
        " , and ": null
    },
    {
        "chlorine": "chlorine"
    },
    {
        " .      The ": null
    },
    {
        "noble gas": "noble gas"
    },
    {
        "es  are also gases at STP, but they are ": null
    },
    {
        "monatomic": "monatomic"
    },
    {
        ". The homonuclear diatomic gases and noble gases together are called elemental gases or molecular gases , to distinguish them from other gases that are ": null
    },
    {
        "chemical compound": "chemical compound"
    },
    {
        "s.      At slightly elevated temperatures, the halogens ": null
    },
    {
        "bromine": "bromine"
    },
    {
        " and ": null
    },
    {
        "iodine": "iodine"
    },
    {
        " also form diatomic gases.  All halogens have been observed as diatomic molecules, except for ": null
    },
    {
        "astatine": "astatine"
    },
    {
        ", which is uncertain.     The mnemonics BrINClHOF, pronounced Brinklehof ,  and HONClBrIF, pronounced Honkelbrif ,  and HOFBrINCl have been coined to aid recall of the list of diatomic elements.     Other elements form diatomic molecules when evaporated, but these diatomic species repolymerize when cooled. Heating elemental phosphorus gives ": null
    },
    {
        "diphosphorus": "diphosphorus"
    },
    {
        ", P 2 . Sulfur vapor is mostly ": null
    },
    {
        "disulfur": "disulfur"
    },
    {
        " . ": null
    },
    {
        "Dilithium": "dilithium"
    },
    {
        " and disodium  are known in the gas phase. Ditungsten and dimolybdenum form with ": null
    },
    {
        "sextuple bonds": "sextuple bond"
    },
    {
        "in the gas phase. ": null
    },
    {
        "Dirubidium": "dirubidium"
    },
    {
        " is diatomic.       All other diatomic molecules are ": null
    },
    {
        "chemical compounds": "chemical compound"
    },
    {
        "of two different elements. Many elements can combine to form ": null
    },
    {
        "heteronuclear": "heteronuclear molecule"
    },
    {
        " diatomic molecules, depending on temperature and pressure.     Some examples include, gases ": null
    },
    {
        "carbon monoxide": "carbon monoxide"
    },
    {
        " , ": null
    },
    {
        "nitric oxide": "nitric oxide"
    },
    {
        " , and ": null
    },
    {
        "hydrogen chloride": "hydrogen chloride"
    },
    {
        " .     Many 1:1 ": null
    },
    {
        "binary compounds": "binary compound"
    },
    {
        "are not normally considered diatomic because they are ": null
    },
    {
        "polymer": "polymer"
    },
    {
        "ic at room temperature, but they form diatomic molecules when evaporated, for example gaseous MgO, SiO, and many others.       Hundreds of diatomic molecules have been identified  in the environment of the Earth, in the laboratory, and in ": null
    },
    {
        "interstellar space": "list of molecules in interstellar space"
    },
    {
        ". About 99% of the ": null
    },
    {
        "Earths atmosphere": "earths atmosphere"
    },
    {
        " is composed of two species of diatomic molecules: nitrogen and oxygen . The natural abundance of ": null
    },
    {
        "hydrogen ": "hydrogen"
    },
    {
        " in the Earths atmosphere is only of the order of parts per million, but H 2 is the most abundant diatomic molecule in the universe. The interstellar medium is, indeed, dominated by hydrogen atoms.       All diatomic molecules are linear and characterized by a single parameter which is the ": null
    },
    {
        "bond length": "bond length"
    },
    {
        " or distance between the two atoms.       Diatomic elements played an important role in the elucidation of the concepts of element, atom, and molecule in the 19th century, because some of the most common elements, such as hydrogen, oxygen, and nitrogen, occur as diatomic molecules. ": null
    },
    {
        "John Daltons": "john dalton"
    },
    {
        "original atomic hypothesis assumed that all elements were monatomic and that the atoms in compounds would normally have the simplest atomic ratios with respect to one another. For example, Dalton assumed waters formula to be HO, giving the atomic weight of oxygen as eight times that of hydrogen,  instead of the modern value of about 16. As a consequence, confusion existed regarding atomic weights and molecular formulas for about half a century.     As early as 1805, ": null
    },
    {
        "Gay-Lussac": "gay-lussac"
    },
    {
        " and ": null
    },
    {
        "von Humboldt": "alexander von humboldt"
    },
    {
        " showed that water is formed of two volumes of hydrogen and one volume of oxygen, and by 1811 ": null
    },
    {
        "Amedeo Avogadro": "amedeo avogadro"
    },
    {
        " had arrived at the correct interpretation of waters composition, based on what is now called ": null
    },
    {
        "Avogadros law": "avogadros law"
    },
    {
        " and the assumption of diatomic elemental molecules. However, these results were mostly ignored until 1860, partly due to the belief that atoms of one element would have no ": null
    },
    {
        "chemical affinity": "chemical affinity"
    },
    {
        " toward atoms of the same element, and also partly due to apparent exceptions to Avogadros law that were not explained until later in terms of dissociating molecules.     At the 1860 ": null
    },
    {
        "Karlsruhe Congress": "karlsruhe congress"
    },
    {
        " on atomic weights, ": null
    },
    {
        "Cannizzaro": "cannizzaro"
    },
    {
        " resurrected Avogadros ideas and used them to produce a consistent table of atomic weights, which mostly agree with modern values. These weights were an important prerequisite for the discovery of the ": null
    },
    {
        "periodic law": "periodic law"
    },
    {
        " by ": null
    },
    {
        "Dmitri Mendeleev": "dmitri mendeleev"
    },
    {
        " and ": null
    },
    {
        "Lothar Meyer": "lothar meyer"
    },
    {
        ".        Diatomic molecules are normally in their lowest or ground state, which conventionally is also known as the X state. When a gas of diatomic molecules is bombarded by energetic electrons, some of the molecules may be excited to higher electronic states, as occurs, for example, in the natural aurora; high-altitude nuclear explosions; and rocket-borne electron gun experiments. Such excitation can also occur when the gas absorbs light or other electromagnetic radiation. The excited states are unstable and naturally relax back to the ground state. Over various short time scales after the excitation , transitions occur from higher to lower electronic states and ultimately to the ground state, and in each transition results a ": null
    },
    {
        "photon": "photon"
    },
    {
        " is emitted. This emission is known as ": null
    },
    {
        "fluorescence": "fluorescence"
    },
    {
        ". Successively higher electronic states are conventionally named A , B , C , etc. . The excitation energy must be greater than or equal to the energy of the electronic state in order for the excitation to occur.     In quantum theory, an electronic state of a diatomic molecule is represented by the ": null
    },
    {
        "molecular term symbol": "molecular term symbol"
    },
    {
        "   : ^ \\Lambda     where S is the total electronic spin quantum number, \\Lambda is the total electronic angular momentum quantum number along the internuclear axis, and v is the vibrational quantum number. \\Lambda takes on values 0, 1, 2, ..., which are represented by the electronic state symbols \\Sigma , \\Pi , \\Delta ,....   For example, the following table lists the common electronic states along with the energy of the lowest vibrational level of diatomic nitrogen , the most abundant gas in the Earths atmosphere. In the table, the subscripts and superscripts after \\Lambda give additional quantum mechanical details about the electronic state.             The aforementioned ": null
    },
    {
        "fluorescence": "fluorescence"
    },
    {
        " occurs in distinct regions of the ": null
    },
    {
        "electromagnetic spectrum": "electromagnetic spectrum"
    },
    {
        ", called ": null
    },
    {
        "emission bands": "emission bands"
    },
    {
        " : each band corresponds to a particular transition from a higher electronic state and vibrational level to a lower electronic state and vibrational level . For example, N 2 A - X emission bands are present in the spectral range from 0.14 to 1.45 μm . A given band can be spread out over several nanometers in electromagnetic wavelength space, owing to the various transitions that occur in the molecules rotational quantum number, J . These are classified into distinct sub-band branches, depending on the change in J . The R branch corresponds to \\Delta J +1 , the P branch to \\Delta J -1 , and the Q branch to \\Delta J 0 . Bands are spread out even further by the limited ": null
    },
    {
        "spectral resolution": "spectral resolution"
    },
    {
        " of the ": null
    },
    {
        "spectrometer": "spectrometer"
    },
    {
        " that is used to measure the ": null
    },
    {
        "spectrum": "spectrum"
    },
    {
        ". The spectral resolution depends on the instruments ": null
    },
    {
        "point spread function": "point spread function"
    },
    {
        ".       The ": null
    },
    {
        "molecular term symbol": "molecular term symbol"
    },
    {
        " is a shorthand expression of the angular momenta that characterize the electronic quantum states of a diatomic molecule, which are also ": null
    },
    {
        "eigenstates": "eigenstate"
    },
    {
        "of the electronic molecular ": null
    },
    {
        "Hamiltonian": "hamiltonian"
    },
    {
        ". It is also convenient, and common, to represent a diatomic molecule as two point masses connected by a massless spring. The energies involved in the various motions of the molecule can then be broken down into three categories: the translational, rotational, and vibrational energies.       The translational energy of the molecule is given by the ": null
    },
    {
        "kinetic energy": "kinetic energy"
    },
    {
        " expression:   : E_\\text\\fracmv^2     where m is the mass of the molecule and v is its velocity.       Classically, the kinetic energy of rotation is   :: E_\\text \\frac \\,   :where   :: L \\, is the ": null
    },
    {
        "angular momentum": "angular momentum"
    },
    {
        "   :: I \\, is the ": null
    },
    {
        "moment of inertia": "moment of inertia"
    },
    {
        " of the molecule     For microscopic, atomic-level systems like a molecule, angular momentum can only have specific discrete values given by   :: L^2 \\ell \\hbar^2 \\,   :where \\ell is a non-negative integer and \\hbar is the ": null
    },
    {
        "reduced Planck constant": "reduced planck constant"
    },
    {
        ".     Also, for a diatomic molecule the moment of inertia is   :: I \\mu r_^2 \\,   :where   :: \\mu \\, is the ": null
    },
    {
        "reduced mass": "reduced mass"
    },
    {
        " of the molecule and   :: r_ \\, is the average distance between the centers of the two atoms in the molecule.     So, substituting the angular momentum and moment of inertia into E rot , the rotational energy levels of a diatomic molecule are given by:   :: E_\\text \\frac \\ \\ \\ \\ \\ l0,1,2,... \\,       Another type of motion of a diatomic molecule is for each atom to oscillate—or ": null
    },
    {
        "vibrate": "vibration"
    },
    {
        "—along the line connecting the two atoms. The vibrational energy is approximately that of a ": null
    },
    {
        "quantum harmonic oscillator": "quantum harmonic oscillator"
    },
    {
        ":     :: E_\\text \\left\\hbar \\omega \\ \\ \\ \\ \\ n0,1,2,.... \\,   :where   :: n is an integer   :: \\hbar is the ": null
    },
    {
        "reduced Planck constant": "reduced planck constant"
    },
    {
        " and   :: \\omega is the ": null
    },
    {
        "angular frequency": "angular frequency"
    },
    {
        " of the vibration.       The spacing, and the energy of a typical spectroscopic transition, between vibrational energy levels is about 100 times greater than that of a typical transition between ": null
    },
    {
        "rotational energy": "rotational energy"
    },
    {
        " levels.          The ": null
    },
    {
        "good quantum numbers": "good quantum number"
    },
    {
        "for a diatomic molecule, as well as good approximations of rotational energy levels, can be obtained by modeling the molecule using ": null
    },
    {
        "Hunds cases": "hunds cases"
    }
]