[
    {
        "Diedrich Hermann Westermann was a ": null
    },
    {
        "German": "germany"
    },
    {
        " missionary, ": null
    },
    {
        "Africanist": "african studies"
    },
    {
        ", and ": null
    },
    {
        "linguist": "linguistics"
    },
    {
        ". He substantially extended and revised the work of ": null
    },
    {
        "Carl Meinhof": "carl meinhof"
    },
    {
        ", his teacher, although he rejected some of Meinhofs theories only implicitly. Westermann is seen as one of the founders of modern ": null
    },
    {
        "Africa": "africa"
    },
    {
        "n linguistics.     He carried out extensive linguistic and anthropological research in the area ranging from Senegal eastwards to the Upper Nile. His linguistic publications cover a wide range of African languages, including the ": null
    },
    {
        "Gbe languages": "gbe languages"
    },
    {
        ", ": null
    },
    {
        "Nuer": "nuer language"
    },
    {
        ", ": null
    },
    {
        "Kpelle": "kpelle language"
    },
    {
        ", ": null
    },
    {
        "Shilluk": "shilluk language"
    },
    {
        ", ": null
    },
    {
        "Hausa": "hausa language"
    },
    {
        ", and ": null
    },
    {
        "Guang": "guang language"
    },
    {
        ".     Westermanns comparative work, begun in 1911, initially brought together much of todays ": null
    },
    {
        "Niger–Congo": "niger–congo"
    },
    {
        " and ": null
    },
    {
        "Nilo-Saharan": "nilo-saharan"
    },
    {
        " language phyla under the name ": null
    },
    {
        "Sudanic languages": "sudanic languages"
    },
    {
        ". His most important later publication Die westlichen Sudansprachen 1927a divided these into East and West ": null
    },
    {
        "Sudanic languages": "sudanic languages"
    },
    {
        " and laid the basis for what would become Niger–Congo. In this book and a series of associated articles between 1925 and 1928, Westermann both identified a large number of roots that form the basis of our understanding of Niger–Congo and set out the evidence for the coherence of many of the families that constitute it. Much of the classification of African languages associated with Joseph Greenberg actually derives from the work of Westermann.     In 1927 Westermann published a  Practical Orthography of African Languages , which became later known as the Westermann script. Subsequently, he published the influential and oft-reprinted  Practical Phonetics for Students of African Languages  in collaboration with ": null
    },
    {
        "Ida C. Ward": "ida c. ward"
    },
    {
        " .     He was born in ": null
    },
    {
        "Baden": "baden, lower saxony"
    },
    {
        " near ": null
    },
    {
        "Bremen": "bremen"
    },
    {
        " and also died there.       Westermann, Diedrich H. Die Sudansprachen   Westermann, Diedrich H. The Shilluk People. Berlin.   Westermann, Diedrich H. Das Tschi und Guang. Ihre Stellung innerhalb der Ewe-Tschi Gruppe. MSOS, 28:1-85.   Westermann, Diedrich H. Das Ibo in Nigerien. Seine Stellung innerhalb der Kwa-Sprachen. MSOS, 29:32-60.   Westermann, Diedrich H. Das Edo in Nigerien. Seine Stellung innerhalb der Kwa-Sprachen. MSOS, 29:1-31.   Westermann, Diedrich H. Die westlichen Sudansprachen und ihre Beziehungen zum Bantu Berlin: de Gruyter.   Westermann, Diedrich H. Das Nupe in Nigerien. Seine Stellung innerhalb der Kwa-Sprachen. MSOS, 30:173-207.   Westermann, Diedrich H. Die westatlantische Gruppe der Sudansprachen. MSOS, 31:63-86.   Westermann, Diedrich Hermann & Ward, Ida C. Practical phonetics for students of African languages. London: Oxford University Press for the International African Institute.   Westermann, Diedrich H. Africans recount their lives. Eleven self-portraits , Essener Verlagsanstalt   Westermann, Diedrich H. . The missionary and anthropological research. Oxford University Press for the International African Institute.   Westermann, Diedrich H. . Sprachbeziehungen und Sprachverwandtschaft in Afrika. Sitzungsberichte der Deutschen Akademie der Wissenschaften zu Berlin, Philosophisch-Historische Klasse, 1948 . Berlin: Akademie-Verlag.   Westermann, Diedrich H. . The languages of West Africa. Oxford: Oxford University Press.   Westermann, Diedrich H. . Practical phonetics for students of African languages . Oxford: Oxford University Press.       Kallaway, Peter. Diedrich Westermann and the Ambiguities of Colonial Science in the Inter-War Era. The Journal of Imperial and Commonwealth History 2017 vol. 45 no. 6, p. 871–893 doi10.1080/03086534.2017.1379672                                         ": null
    }
]