[
    {
        "The Diets of Nuremberg, also called the ": null
    },
    {
        "Imperial Diets": "Imperial Diet"
    },
    {
        " of ": null
    },
    {
        "Nuremberg": "Nuremberg"
    },
    {
        ", took place at different times between the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        " and the 17th century.     The first Diet of Nuremberg, in 1211, elected the future emperor ": null
    },
    {
        "Frederick II of Hohenstaufen": "Frederick Ii, Holy Roman Emperor"
    },
    {
        " as German king.     At the Diet of 1356 the ": null
    },
    {
        "Emperor Charles IV": "Charles Iv, Holy Roman Emperor"
    },
    {
        " issued the ": null
    },
    {
        "Golden Bull of 1356": "Golden Bull Of 1356"
    },
    {
        ", which required each ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        " to summon the first Imperial ": null
    },
    {
        "Diet": "Diet"
    },
    {
        " after his election at Nuremberg. Apart from that, a number of other diets were held there.     Important to ": null
    },
    {
        "Protestantism": "Protestantism"
    },
    {
        " were the Diets of 1522 , 1524 and 1532 .       This Diet has become known mostly for the reaction of the papacy to the decision made on ": null
    },
    {
        "Luther": "Martin Luther"
    },
    {
        " at the ": null
    },
    {
        "Diet of Worms": "Diet Of Worms"
    },
    {
        " the previous year. The new pope, ": null
    },
    {
        "Adrian VI": "Adrian Vi"
    },
    {
        ", sent his nuncio ": null
    },
    {
        "Francesco Chieregati": "Francesco Chieregati"
    },
    {
        " to the Diet, to insist both that the ": null
    },
    {
        "Edict of Worms": "Edict Of Worms"
    },
    {
        " be executed, and that action be taken promptly against Luther. This demand, however, was coupled with a promise of thorough reform in the Roman hierarchy, frankly admitting the partial guilt of the Vatican in the decline of the Church.     In the recess drafted on 9 February 1523, however, the German princes rejected this appeal. Using Adrians admissions, they declared that they could not have it appear as though they wished to oppress evangelical truth and assist unchristian and evil abuses.       This Diet generally took the same line as the previous one. The Estates reiterated their decision from the previous Diet. The Cardinal-legate, Campeggio, who was present, showed his disgust at the behaviour of the Estates. On 18 April, the Estates decided to call a general gathering of the German nation, to meet at ": null
    },
    {
        "Speyer": "Speyer"
    },
    {
        " the following year and to decide what would be done until the meeting of the general council of the Church which they demanded. This resulted in the ": null
    },
    {
        "Diet of Speyer ": "Diet Of Speyer"
    },
    {
        ", which in turn was followed by the ": null
    },
    {
        "Diet of Speyer ": "Diet Of Speyer"
    },
    {
        ". The latter included the ": null
    },
    {
        "Protestation at Speyer": "Protestation At Speyer"
    }
]