[
    {
        "              Dilbert is an American ": null
    },
    {
        "comic strip": "Comic Strip"
    },
    {
        " written and illustrated by ": null
    },
    {
        "Scott Adams": "Scott Adams"
    },
    {
        ", first published on April 16, 1989. The strip is known for its ": null
    },
    {
        "satirical": "Satire"
    },
    {
        " office humor": "Office Humor"
    },
    {
        " about a ": null
    },
    {
        "white-collar": "White-Collar Worker"
    },
    {
        ", ": null
    },
    {
        "micromanage": "Micromanagement"
    },
    {
        "d office featuring engineer ": null
    },
    {
        "Dilbert": "Dilbert"
    },
    {
        " as the ": null
    },
    {
        "title character": "Title Role"
    },
    {
        ". The strip has spawned dozens of books, an ": null
    },
    {
        "animated television series": "Dilbert"
    },
    {
        ", a ": null
    },
    {
        "video game": "Dilberts Desktop Games"
    },
    {
        ", and hundreds of Dilbert-themed ": null
    },
    {
        "merchandise": "Merchandising"
    },
    {
        " items. Dilbert Future and The Joy of Work are among the most read books in the series. Adams received the ": null
    },
    {
        "National Cartoonists Society": "National Cartoonists Society"
    },
    {
        " Reuben Award": "National Cartoonists Societyreuben Award"
    },
    {
        " in 1997 and the Newspaper Comic Strip Award in the same year for his work on the strip. Dilbert appears online and in 2,000 newspapers worldwide in 65 countries and 25 languages.        Dilbert was picked up for syndication by ": null
    },
    {
        "United Feature Syndicate": "United Feature Syndicate"
    },
    {
        "  in 1989.     On June 3, 2010, United Media sold their licensing arm, along with the rights to Dilbert, to ": null
    },
    {
        "Iconix Brand Group": "Iconix Brand Group"
    },
    {
        ".  This led to Dilbert leaving United Media: in late December 2010, it was announced that Dilbert would move to ": null
    },
    {
        "Universal Uclick": "Universal Uclick"
    },
    {
        "  beginning in June 2011. Gardner, Alan.  The Daily Cartoonist . Dilbert has been with Universal Uclick — now known as ": null
    },
    {
        "Andrews McMeel Syndication": "Andrews Mcmeel Syndication"
    },
    {
        " — ever since.       The comic strip originally revolved around ": null
    },
    {
        "Dilbert": "Dilbert"
    },
    {
        " and his pet dog ": null
    },
    {
        "Dogbert": "Dogbert"
    },
    {
        " in their home. Many early plots revolved around Dilberts engineer nature or his bizarre inventions. Also prominent were plots based on Dogberts ": null
    },
    {
        "megalomaniacal": "Narcissistic Personality Disorder"
    },
    {
        " ambitions. Later, the location of most of the action moved to Dilberts workplace and the strip started to satirize technology, workplace, and company issues. The comic strips popular success is attributable to its workplace setting and themes, which are familiar to a large and appreciative audience;  Adams has said that switching the setting from Dilberts home to his office was when the strip really started to take off .  The workplace location is ": null
    },
    {
        "Silicon Valley": "Silicon Valley"
    },
    {
        ".      Dilbert portrays corporate culture as a ": null
    },
    {
        "Kafkaesque": "Franz Kafka.22Kafkaesque.22"
    },
    {
        " world of ": null
    },
    {
        "bureaucracy": "Bureaucracy"
    },
    {
        " for its own sake and office politics that stand in the way of productivity, where employees skills and efforts are not rewarded, and ": null
    },
    {
        "busy work": "Busy Work"
    },
    {
        " is praised. Much of the humor emerges as the audience sees the characters making obviously ridiculous decisions that are natural reactions to ": null
    },
    {
        "mismanagement": "Management"
    },
    {
        ".                    The main character in the strip, Dilbert is a stereotypical technically-minded single male. Until October 2014, he was usually depicted wearing a white dress shirt, black trousers and a red-and-black striped tie that inexplicably curves upward; after October 13, 2014, his standard apparel changed to a red polo shirt with a name badge on a lanyard around his neck.  Dilbert is a skilled engineer but has a poor social and romantic life.          The unnamed, oblivious manager of the engineering division of Dilberts company. Scott Adams states that he never named him so that people can imagine him to be their boss. In earlier strips he was depicted as a stereotypical late-middle-aged balding middle manager with jowls; it was not until later that he developed his signature pointy hair and the jowls disappeared. He is hopelessly incompetent at management, and often tries to compensate for his lack of skills with countless group therapy sessions and business strategies that rarely bear fruit. He does not understand technical issues, but always tries to disguise this, usually by using buzzwords he also does not understand. The Boss treats his employees alternately with enthusiasm or neglect; he often uses them to his own ends regardless of the consequences to them. Adams himself wrote that Hes not sadistic, just uncaring . His level of intelligence varies from near-vegetative to perceptive and clever, depending on the strips comic needs. His utter lack of consistent business ethics, however, is perfectly consistent. His brother is a demon named Phil, the Prince of Insufficient Light , and according to Adams, the pointy hair is intended to remind one of devils horns.          One of the longest serving engineers, Wally was originally a worker trying to get fired to get a severance package. He hates work and avoids it whenever he can. He often carries a cup of coffee, calmly sipping from it even in the midst of chaos or office-shaking revelations. Wally is extremely cynical. He is even more socially inept than Dilbert , and references to his lack of personal hygiene are not uncommon. Like the Pointy-haired Boss, Wally is utterly lacking in ethics and will take advantage of any situation to maximize his personal gain while doing the least possible amount of honest work. Until the change to business dorky wear of a polo shirt, Wally was invariably portrayed wearing a short sleeved dress shirt and tie. Adams has stated that Wally was based on a Pacific Bell coworker of his who was interested in a generous employee buy-out program—for the companys worst employees. This had the effect of causing this man—whom Adams describes as one of the more brilliant people Ive met —to work hard at being incompetent, rude, and generally poor at his job to qualify for the buy-out program. Adams has said that this inspired the basic laziness and amorality of Wallys character. Despite these personality traits Wally is accepted as part of Dilbert, Ted, Alice, and Asoks clique. Although his relationship with Alice is often antagonistic and Dilbert occasionally denies being his friend, their actions show at least a certain acceptance of him.          One of the more competent and highest paid engineers. She is often frustrated at her work, because she does not get proper recognition, which she believes is because she is female, though in reality it is likely because she has a quick, often violent temper, sometimes putting her Fist of Death to use, even with the Pointy-haired Boss. Alice is based on a woman that Scott Adams worked with named Anita, who is described as sharing Alices pink suit, fluffy hair, technical proficiency, coffee obsession, and take-no-crap attitude.          Dilberts anthropomorphic pet dog is the smartest dog on Earth. Dogbert is a megalomaniac intellectual dog, planning to one day conquer the world. He once succeeded, but became bored with the ensuing peace, and quit. Often seen in high-ranking consultant or technical support jobs, he constantly abuses his power and fools the management of Dilberts company, though considering the intelligence of the companys management in general and Dilberts boss in particular, this is not very hard to do. He also enjoys pulling scams on unsuspecting and usually dull customers to steal their money. However, despite Dogberts cynical exterior, he has been known to pull his master out of some tight jams. Dogberts nature as a pet was more emphasized during the earlier years of the strip; as the strip progressed, references to his acting like a dog became less common, although he still wags his tail when he perpetrates his scams. When an older Dilbert arrives while time-traveling from the future, he refers to Dogbert as majesty , indicating that Dogbert will one day indeed rule the world ... again, and make worshipping him retroactive so he could boss around time travelers.          Catbert is the evil director of ": null
    },
    {
        "human resources": "Human Resources"
    },
    {
        " in the Dilbert comic strip. He was supposed to be a one-time character but resonated with readers so well that Adams brought him back as the HR director. Catberts origins with the company are that he was hired by Dogbert. Dogbert hired him because he wanted an H.R. Director that appeared cute while secretly downsizing you.          A young intern, he works very hard but does not always get proper recognition. Asok is intensely intelligent but naive about corporate life; the shattering of his optimistic illusions becomes frequent comic fodder. He is Indian, and has graduated from the ": null
    },
    {
        "Indian Institutes of Technology": "Indian Institutes Of Technology"
    },
    {
        " . The other workers, especially the boss, often unwittingly trample on his cultural beliefs. On the occasions when Asok mentions this, he is normally ignored. His test scores and his IQ of 240 show that he is the smartest member of the engineering team. Nonetheless he is often called upon by the Boss to do odd jobs, and in meetings his ideas are usually left hanging. He is also seen regularly at the lunch table with Wally and Dilbert, experiencing jarring realizations of the nature of corporate life. There are a few jokes about his psychic powers, which he learned at the IIT. Yet despite his intelligence, ethics and mystical powers, Asok sometimes takes advice from Wally in the arts of laziness, and from Dilbert in surviving the office. As of February 7, 2014, Asok is officially gay, which never affects any storylines, but merely commemorates a decision by the Indian Supreme Court to uphold an anti-gay law.,   a decision which was overturned on September 6, 2018        An engineer who is often seen hanging out with Wally. He is referenced by name more often in older comics, but he is still seen occasionally. He has been accepted into Dilberts clique. He has been fired and killed numerous times , in which case a new Ted is apparently hired. In addition to this, he is often promoted and given benefits over the other employees. Ted has a wife and children who are referenced multiple times and seen on at least one occasion. Adams refers to him as Ted the Generic White Guy, because whenever he needs to fire or kill someone he uses Ted, but slowly over time Ted has become his own character.       Elbonia is a non-specific under-developed country used when Adams wants to involve a foreign country without hurting overseas sales . He says People think I have some specific country in mind when I write about Elbonia, but I dont. It represents the view that Americans have of any country that doesnt have cable television  — we think they all wear fur hats and wallow around waist-deep in mud . Seven years of Defective People  — page 184, Elbonians The entire country wears the same clothing and hats, and all men have full beards. They are occasionally bitter towards their wealthier western neighbors, but are quite happy to trade with them. The whole country is covered in mud, and has limited technology.     Elbonia is located somewhere in the former ": null
    },
    {
        "Soviet bloc": "Soviet Bloc"
    },
    {
        ": A strip dated April 2, 1990, refers to the Tiny ": null
    },
    {
        "East European": "East European"
    },
    {
        " country of Elbonia.  It is an extremely poor, ": null
    },
    {
        "fourth-world": "Least Developed Countries"
    },
    {
        " country that has abandoned ": null
    },
    {
        "Communism": "Communism"
    },
    {
        ".  The national ": null
    },
    {
        "bird": "Bird"
    },
    {
        " of Elbonia is the ": null
    },
    {
        "Frisbee": "Frisbee"
    },
    {
        ".  However, in a storyline from November 21-26, 2016, Dilbert visits Elbonia and it seems to be more advanced; no waist deep mud, more advanced technology, and the rental car scene looks almost like its in America or a more advanced European country.       His full title is Phil, the Prince of Insufficient Light & Supreme Ruler of Heck. The Pointy-Haired Bosss brother Phil, has the job of being one step down from Satan. His job is to punish those who commit minor sins, and his Pitch-Spoon is feared by those who do. He is known to Darn to Heck people who do things like using cell phones in the bathroom, steal office supplies, or those who simply do something annoying. In one strip, it was mentioned that being in Heck is not as bad as being in a cubicle.       The popularity of the comic strip within the corporate sector has led to the Dilbert character being used in many business magazines and publications, including several appearances on the cover of  Fortune Magazine . Many newspapers run the comic in their business section rather than in the regular comics section .       Media analyst ": null
    },
    {
        "Norman Solomon": "Norman Solomon"
    },
    {
        " and cartoonist ": null
    },
    {
        "Tom Tomorrow": "Tom Tomorrow"
    },
    {
        " claim  that Adamss caricatures of corporate culture seem to project empathy for white-collar workers, but the satire ultimately plays into the hands of upper corporate management itself. Solomon describes the characters of Dilbert as dysfunctional time-wasters, none of whom occupies a position higher than middle management, and whose inefficiencies detract from corporate values such as productivity and growth . Dilbert and his office-mates often find themselves baffled or victimized by the whims of managerial behavior, but they never seem to question it openly. Solomon cites the ": null
    },
    {
        "Xerox": "Xerox"
    },
    {
        " corporations use of Dilbert strips and characters in internally distributed inspirational pamphlets:          Adams responded in the February 2, 1998 strip  and in his book The Joy of Work, by simply restating Solomons argument, apparently suggesting that it was absurd and required no rebuttal.     In 1997, ": null
    },
    {
        "Tom Vanderbilt": "Tom Vanderbilt"
    },
    {
        " wrote in a similar vein in  The Baffler  magazine:          In 1998, ": null
    },
    {
        "Bill Griffith": "Bill Griffith"
    },
    {
        ", creator of  Zippy the Pinhead , chided Dilbert for crude drawings and simplistic humor. He wrote,        Adams lashed back with two comic strips called Pippy the Ziphead, in which Dogbert creates a comic by cramming as much artwork in as possible so no one will notice theres only one joke ... on the reader.  Dilbert notes that the strip is nothing but a clown with a small head who says random things , and Dogbert responds that he is maintaining his artistic integrity by creating a comic that no one will enjoy.  In September of the same year, Griffith mocked Adams Pippy the Ziphead with a strip of the same name drawn in a simplistic, stiff, Dilbert-like style set in an office setting and featuring the characters Zippy and Griffy retorting, I sense a joke was delivered. Yes. It was. My one joke. Ha.        In the late 1990s, an amateur cartoonist named Karl Hörnell began submitting a comic strip to  Savage Dragon  creator ": null
    },
    {
        "Erik Larsen": "Erik Larsen"
    },
    {
        " that parodied both Dilbert  and the ": null
    },
    {
        "Image Comics": "Image Comics"
    },
    {
        " series The Savage Dragon. This soon became a regular feature in the Savage Dragon comic book, titled The Savage Dragonbert and Hitlers Brainbert . The strip began as a specific parody of the comic book itself, set loosely within the office structure of Dilbert, with Hörnell doing an emulation of Adamss cartooning style.      Induhvidual . This term is based on the ": null
    },
    {
        "American English": "American English"
    },
    {
        " slang expression ": null
    },
    {
        "duh": "Wikt:Duh"
    },
    {
        "! The conscious misspelling of individual as induhvidual is a pejorative term for people who are not in ": null
    },
    {
        "Dogberts New Ruling Class": "Dogberts New Ruling Class"
    },
    {
        " . Its coining is explained in Dilbert Newsletter 6. The strip has also popularized the usage of the terms cow-orker and ": null
    },
    {
        "PHB": "Pointy-Haired Boss"
    },
    {
        ".       In 1997, Scott Adams masqueraded as a management consultant to ": null
    },
    {
        "Logitech": "Logitech"
    },
    {
        " executives , with the cooperation of the companys vice-chairman. He acted in much the way that he portrays management consultants in the comic strip, with an arrogant manner and bizarre suggestions, such as comparing ": null
    },
    {
        "mission statements": "Strategic Planningmission Statements And Vision Statements"
    },
    {
        "to broccoli soup. He convinced the executives to change their existing mission statement for their New Ventures Group from provide Logitech with profitable growth and related new business areas to scout profitable growth opportunities in relationships, both internally and externally, in emerging, mission-inclusive markets, and explore new paradigms and then filter and communicate and evangelize the findings .        To demonstrate what can be achieved with the most mundane objects if planned correctly and imaginatively, Adams has worked with companies to develop dream products for Dilbert and company. In 2001, he collaborated with design company ": null
    },
    {
        "IDEO": "Ideo"
    },
    {
        " to come up with the perfect cubicle , a fitting creation since many of the Dilbert strips make fun of the standard ": null
    },
    {
        "cubicle desk": "Cubicle"
    },
    {
        " and the environment that it creates. The result was both whimsical and practical.       This project was followed in 2004 with designs for  . An energy-efficient building was the result, designed to prevent many of the little problems that seem to creep into a normal building. For instance, to save time spent buying and decorating a ": null
    },
    {
        "Christmas tree": "Christmas Tree"
    },
    {
        " every year, the house has a large closet adjacent to the living room where the tree can be stored from year to year.       In 1995, Dilbert was the ": null
    },
    {
        "first": "List Of Early Webcomics"
    },
    {
        " syndicated comic strip to be published for free on the ": null
    },
    {
        "Internet": "Internet"
    },
    {
        ". Putting his ": null
    },
    {
        "email": "Email"
    },
    {
        " address in each Dilbert strip, Adams created a direct channel to customers, allowing him to modify the strip based on their feedback.  ": null
    },
    {
        "Joe Zabel": "Joe Zabel"
    },
    {
        " stated that Dilbert had a large influence on many of the ": null
    },
    {
        "webcomics": "Webcomic"
    },
    {
        "that followed it, establishing the ": null
    },
    {
        "nerd": "Nerd"
    },
    {
        "core genre as it found its audience.      In April 2008, Scott Adams announced that ": null
    },
    {
        "United Media": "United Media"
    },
    {
        " would be instituting an interactive feature on Dilbert.com, allowing fans to write speech bubbles and, in the near future, interact with Adams about the content of the strips. Adams has spoken positively about the change, saying, This makes cartooning a competitive sport.         In addition to the National Cartoonists Society ": null
    },
    {
        "Reuben Awards": "National Cartoonists Societyreuben Award"
    },
    {
        " won by Adams, the Dilbert strip has received a variety of other awards. Adams was named best international comic strip artist of 1995 in the ": null
    },
    {
        "Adamson Awards": "Adamson Awards"
    },
    {
        " given by the Swedish Academy of Comic Art.     Dilbert was named the best syndicated strip of 1997 in the ": null
    },
    {
        "Harvey Awards": "Harvey Award"
    },
    {
        "and won the ": null
    },
    {
        "Max & Moritz Prize": "Max  &  Moritz Prize"
    },
    {
        " as best international comic strip for 1998.                    The Dilbert Principle  Dogberts Top Secret Management Handbook  The Dilbert Future   The Joy of Work   Dilbert and the Way of the Weasel  Slapped Together: The Dilbert Business Anthology        Telling It Like It Isnt  — 1996;  You Dont Need Experience If Youve Got Attitude  — 1996;  Access Denied: Dilberts Quest for Love in the Nineties  — 1996;  Conversations With Dogbert  — 1996;  Work is a Contact Sport  — 1997;  The Boss: Nameless, Blameless and Shameless  — 1997;  The Dilbert Bunch  — 1997;  No Youd Better Watch Out  — 1997   Please Dont Feed The Egos  — 1997;  Random Acts of Catness  — 1998;  You Cant Schedule Stupidity  — 1998;  Dilbert Meeting Book Exceeding Tech Limits  — 1998;  Trapped In A Dilbert World – Book Of Days  — 1998;  Work—The Wally Way  — 1999;  Alice in Blunderland  — 1999;  All Dressed Down And Nowhere To Go  — 2002;  Dilberts Guide to the Rest of Your Life: Dispatches from Cubicleland  — 2007;  Dilbert Sudoku Comic Digest: 200 Puzzles Plus 50 Classic Dilbert Cartoons  — 2008;   Dilbert 2.0: 20 Years of Dilbert   — 2008; 576 pages, ≈6500 strips, and Scott Adamss notes from 1989 to 2008.       Young Dilbert in Hi-Tech Hijinks  — 1997; A Dilbert-branded computer game aimed at teaching young children about technology.   Corporate Shuffle by ": null
    },
    {
        "Richard Garfield": "Richard Garfield"
    },
    {
        "  — 1997; A Dilbert-branded card game similar to Wizard of the Coasts The Great Dalmuti and the drinking game ": null
    },
    {
        "President": "President"
    },
    {
        ".   The ": null
    },
    {
        "Dilberito": "Dilberito"
    },
    {
        ", a vegan microwave ": null
    },
    {
        "burrito": "Burrito"
    },
    {
        " offered in four flavors: Barbecue with barbecue sauce, Garlic & Herb with sauce, Indian with mango chutney, and Mexican with salsa.   Totally Nuts  — 1998; A limited edition ": null
    },
    {
        "Ben & Jerrys": "Ben  &  Jerrys"
    },
    {
        " ice cream flavor whose description was listed as: Butter almond ice cream with roasted hazelnuts, praline pecans & white fudge coated almonds .   A line of Dilbert mints that possessed the names Accomplish-mints, Appease-mints, Appoint-mints, Harass-mints, Improve-mints, Manage-mints, Pay-mints, Perfor-mints, and Postpone-mints.   Dilbert: the Board Game  — 2006; by Hyperion Games; A Dilbert-branded board game that was named one of  Games  magazines Top 100 Games   Day-by-Day calendars featuring the comic strip are available every year.   Dilbert: Escape From Cubeville  — 2010; A Dilbert-branded board game released in the Dilbert store section of dilbert.com.    Dilberts Desktop Games , a video game designed for the PC.          Dilbert was adapted into a ": null
    },
    {
        "UPN": "Upn"
    },
    {
        " animated television series starring ": null
    },
    {
        "Daniel Stern": "Daniel Stern"
    },
    {
        " as ": null
    },
    {
        "Dilbert": "Dilbert"
    },
    {
        ", ": null
    },
    {
        "Chris Elliott": "Chris Elliott"
    },
    {
        " as ": null
    },
    {
        "Dogbert": "Dogbert"
    },
    {
        ", and ": null
    },
    {
        "Kathy Griffin": "Kathy Griffin"
    },
    {
        " as Alice. The series ran for two seasons from January 25, 1999 to July 25, 2000. The first season centered around the creation of a new product called the Gruntmaster 6000 . It was critically acclaimed and won a Golden Globe award, leading to its renewal for a second season. The second season did away with the serial format and was composed entirely of standalone episodes, many of which shifted focus away from the workplace and involved absurdist plots such as Wally being mistaken for a religious leader  and Dilbert being accused of mass murder . Critical and fan reception was resoundingly negative to the change in format and storytelling, and the series was not renewed for a third season. The second season two-episode finale included Dilbert getting pregnant with the child of a cow, a ": null
    },
    {
        "hillbilly": "Hillbilly"
    },
    {
        ", ": null
    },
    {
        "robot": "Robot"
    },
    {
        " DNA, several dozen engineers , an elderly billionaire, and an ": null
    },
    {
        "alien": "Extraterrestrial Life"
    },
    {
        ", eventually ending up in a custody battle with ": null
    },
    {
        "Stone Cold Steve Austin": "Stone Cold Steve Austin"
    },
    {
        " as the Judge.       On April 7, 2008, dilbert.com presented its first Dilbert animation. The new Dilbert animations are animated versions of original comic strips produced by ": null
    },
    {
        "RingTales": "Ringtales"
    },
    {
        " and animated by ": null
    },
    {
        "Powerhouse Animation Studios": "Powerhouse Animation Studios"
    },
    {
        ". The animation videos run for around 30 seconds each and are added every weekday. On December 10, 2009 the RingTales produced animations were made available as a calendar application for mobile devices.        In October 2007, the Catfish Bend Casino in ": null
    },
    {
        "Burlington, Iowa": "Burlington, Iowa"
    },
    {
        " notified its staff that the casino was closing and they were going to be ": null
    },
    {
        "laid off": "Layoff"
    },
    {
        ". David Steward, an employee of seven years, then posted on an office bulletin board the Dilbert strip  of October 26, 2007 that compared management decisions to those of drunken ": null
    },
    {
        "lemurs": "Lemur"
    },
    {
        " . The casino called this very offensive ; they identified him from a surveillance tape, fired him, and tried to prevent him from receiving ": null
    },
    {
        "unemployment benefits": "Unemployment Benefits"
    },
    {
        ". However, an administrative law judge ruled in December 2007 that he would receive benefits, as his action was not intentional misbehavior. Scott Adams said that it might be the first confirmed case of an employee being fired for posting a Dilbert cartoon.  On February 20, 2008, the first of a series of Dilbert strips showed Wally being caught posting a comic strip that compares managers to drunken lemurs .  Adams later said that fans should stick to posting  Garfield  strips, as no one gets fired for that.       On February 29, 2016, Adams posted on his blog  that he would be taking a six-week vacation. During that time, strips would be written by him but drawn by guest artists who work for ": null
    },
    {
        "Universal Uclick": "Universal Uclick"
    },
    {
        ".  ": null
    },
    {
        "Jake Tapper": "Jake Tapper"
    },
    {
        " drew the strip on the week on May 23. ": null
    }
]