[
    {
        "              Dinosaurs are a diverse group of ": null
    },
    {
        "reptiles": "reptile"
    },
    {
        "  of the ": null
    },
    {
        "clade": "clade"
    },
    {
        " Dinosauria. They first appeared during the ": null
    },
    {
        "Triassic": "triassic"
    },
    {
        " period": "geological period"
    },
    {
        ", between 243 and 233.23  ": null
    },
    {
        "million years ago": "annum"
    },
    {
        ", although the exact origin and timing of the ": null
    },
    {
        "evolution of dinosaurs": "evolution of dinosaurs"
    },
    {
        " is the subject of active research. They became the dominant terrestrial ": null
    },
    {
        "vertebrates": "vertebrate"
    },
    {
        "after the ": null
    },
    {
        "Triassic–Jurassic extinction event": "triassic–jurassic extinction event"
    },
    {
        " 201.3  million years ago; their dominance continued through the ": null
    },
    {
        "Jurassic": "jurassic"
    },
    {
        " and ": null
    },
    {
        "Cretaceous": "cretaceous"
    },
    {
        " periods. The ": null
    },
    {
        "fossil": "fossil"
    },
    {
        " record demonstrates that ": null
    },
    {
        "birds": "bird"
    },
    {
        "are modern ": null
    },
    {
        "feathered dinosaur": "feathered dinosaur"
    },
    {
        "s, having ": null
    },
    {
        "evolved": "evolution of birds"
    },
    {
        " from earlier ": null
    },
    {
        "theropods": "theropoda"
    },
    {
        " during the ": null
    },
    {
        "Late Jurassic": "late jurassic"
    },
    {
        " epoch": "epoch"
    },
    {
        ". As such, birds were the only dinosaur lineage to survive the ": null
    },
    {
        "Cretaceous–Paleogene extinction event": "cretaceous–paleogene extinction event"
    },
    {
        " approximately 66  million years ago. Dinosaurs can therefore be divided into avian dinosaurs, or birds; and non-avian dinosaurs, which are all dinosaurs other than birds. This article deals primarily with non-avian dinosaurs.     Dinosaurs are a varied group of animals from ": null
    },
    {
        "taxonomic": "taxonomy"
    },
    {
        ", ": null
    },
    {
        "morphological": "morphology"
    },
    {
        " and ": null
    },
    {
        "ecological": "ecology"
    },
    {
        " standpoints. Birds, at over 10,000 living ": null
    },
    {
        "species": "species"
    },
    {
        ", are the most diverse group of vertebrates besides ": null
    },
    {
        "perciform": "perciformes"
    },
    {
        " fish. Using fossil evidence, ": null
    },
    {
        "paleontologists": "paleontology"
    },
    {
        " have identified over 500 distinct ": null
    },
    {
        "genera": "genus"
    },
    {
        " and more than 1,000 different species of non-avian dinosaurs. Dinosaurs are represented on every continent by both ": null
    },
    {
        "extant": "neontologyextant taxa vs. extinct taxa"
    },
    {
        " species and fossil remains. Through the first half of the 20th century, before birds were recognized to be dinosaurs, most of the scientific community believed dinosaurs to have been sluggish and ": null
    },
    {
        "cold-blooded": "poikilotherm"
    },
    {
        ". Most ": null
    },
    {
        "research conducted since the 1970s": "dinosaur renaissance"
    },
    {
        ", however, has indicated that all dinosaurs were active animals with elevated ": null
    },
    {
        "metabolisms": "metabolism"
    },
    {
        "and numerous adaptations for social interaction. Some were ": null
    },
    {
        "herbivorous": "herbivore"
    },
    {
        ", others ": null
    },
    {
        "carnivorous": "carnivore"
    },
    {
        ". Evidence suggests that all dinosaurs were ": null
    },
    {
        "egg-laying": "oviparity"
    },
    {
        "; and ": null
    },
    {
        "nest": "nest"
    },
    {
        "-building was a trait shared by many dinosaurs, both avian and non-avian.     While dinosaurs were ancestrally ": null
    },
    {
        "bipedal": "bipedalism"
    },
    {
        ", many ": null
    },
    {
        "extinct": "extinction"
    },
    {
        " groups included ": null
    },
    {
        "quadrupedal": "quadrupedalism"
    },
    {
        " species, and some were able to shift between these stances. Elaborate display structures such as horns or crests are common to all dinosaur groups, and some extinct groups developed ": null
    },
    {
        "skeletal": "skeleton"
    },
    {
        " modifications such as ": null
    },
    {
        "bony armor": "armour"
    },
    {
        " and ": null
    },
    {
        "spines": "spine"
    },
    {
        ". While the dinosaurs modern-day surviving avian lineage are generally small due to the constraints of flight, many prehistoric dinosaurs were large-bodied—the largest ": null
    },
    {
        "sauropod": "sauropoda"
    },
    {
        " dinosaurs are estimated to have reached lengths of  and heights of  and were the largest land animals of all time. Still, the idea that non-avian dinosaurs were uniformly gigantic is a misconception based in part on preservation bias, as large, sturdy ": null
    },
    {
        "bones": "bone"
    },
    {
        "are more likely to last until they are fossilized. Many dinosaurs were quite small:  Xixianykus , for example, was only about  long.     Since the first dinosaur fossils were recognized in the early 19th century, mounted fossil dinosaur skeletons have been major attractions at museums around the world, and dinosaurs have become an enduring part of world culture. The large sizes of some dinosaur groups, as well as their seemingly monstrous and fantastic nature, have ensured dinosaurs regular appearance in best-selling books and films, such as  Jurassic Park . Persistent public enthusiasm for the animals has resulted in significant funding for dinosaur science, and new discoveries are regularly covered by the media.       The ": null
    },
    {
        "taxon": "taxon"
    },
    {
        " Dinosauria was formally named in 1842 by ": null
    },
    {
        "paleontologist": "paleontology"
    },
    {
        " Sir Richard Owen": "richard owen"
    },
    {
        ", who used it to refer to the distinct tribe or sub-order of Saurian Reptiles that were then being recognized in ": null
    },
    {
        "England": "england"
    },
    {
        " and around the world.  The term is derived . Though the taxonomic name has often been interpreted as a reference to dinosaurs teeth, claws, and other fearsome characteristics, Owen intended it merely to evoke their size and majesty.     Other prehistoric animals, including ": null
    },
    {
        "pterosaur": "pterosaur"
    },
    {
        "s, ": null
    },
    {
        "mosasaur": "mosasaur"
    },
    {
        "s, ": null
    },
    {
        "ichthyosaur": "ichthyosaur"
    },
    {
        "s, ": null
    },
    {
        "plesiosaurs": "plesiosauria"
    },
    {
        ", and  Dimetrodon , while often popularly conceived of as dinosaurs, are not taxonomically classified as dinosaurs.  Pterosaurs are distantly related to dinosaurs, being members of the clade ": null
    },
    {
        "Ornithodira": "avemetatarsalia"
    },
    {
        ". The other groups mentioned are, like dinosaurs and pterosaurs, members of ": null
    },
    {
        "Sauropsida": "sauropsida"
    },
    {
        " , except Dimetrodon .          Under ": null
    },
    {
        "phylogenetic nomenclature": "phylogenetic nomenclature"
    },
    {
        ", dinosaurs are usually defined as the group consisting of the ": null
    },
    {
        "most recent common ancestor": "most recent common ancestor"
    },
    {
        " of  Triceratops  and ": null
    },
    {
        "modern birds": "birddiversification of modern birds"
    },
    {
        " , and all its descendants. It has also been suggested that Dinosauria be defined with respect to the MRCA of  Megalosaurus  and  Iguanodon , because these were two of the three genera cited by Richard Owen when he recognized the Dinosauria. Both definitions result in the same set of animals being defined as dinosaurs: Dinosauria ": null
    },
    {
        "Ornithischia": "ornithischia"
    },
    {
        " + ": null
    },
    {
        "Saurischia": "saurischia"
    },
    {
        " , encompassing ": null
    },
    {
        "ankylosauria": "ankylosauria"
    },
    {
        "ns , ": null
    },
    {
        "stegosauria": "stegosauria"
    },
    {
        "ns , ": null
    },
    {
        "ceratopsia": "ceratopsia"
    },
    {
        "ns , ": null
    },
    {
        "ornithopods": "ornithopoda"
    },
    {
        " , theropods , and ": null
    },
    {
        "sauropodomorphs": "sauropodomorpha"
    },
    {
        " .     Birds are now recognized as being the sole surviving lineage of theropod dinosaurs. In traditional ": null
    },
    {
        "taxonomy": "taxonomy"
    },
    {
        ", birds were considered a separate ": null
    },
    {
        "class": "class"
    },
    {
        " that had evolved from dinosaurs, a distinct ": null
    },
    {
        "superorder": "superorder"
    },
    {
        ". However, a majority of contemporary paleontologists concerned with dinosaurs reject the traditional style of classification in favor of ": null
    },
    {
        "phylogenetic": "phylogenetics"
    },
    {
        " taxonomy; this approach requires that, for a group to be natural, all descendants of members of the group must be included in the group as well. Birds are thus considered to be dinosaurs and dinosaurs are, therefore, not extinct.  Birds are classified as belonging to the subgroup ": null
    },
    {
        "Maniraptora": "maniraptora"
    },
    {
        ", which are ": null
    },
    {
        "coelurosaurs": "coelurosauria"
    },
    {
        ", which are theropods, which are saurischians, which are dinosaurs.     Research by Matthew G. Baron, ": null
    },
    {
        "David B. Norman": "david b. norman"
    },
    {
        ", and Paul M. Barrett in 2017 suggested a radical revision of dinosaurian systematics. Phylogenetic analysis by Baron et al. recovered the Ornithischia as being closer to the ": null
    },
    {
        "Theropoda": "theropoda"
    },
    {
        " than the ": null
    },
    {
        "Sauropodomorpha": "sauropodomorpha"
    },
    {
        ", as opposed to the traditional union of theropods with sauropodomorphs. They resurrected the clade ": null
    },
    {
        "Ornithoscelida": "ornithoscelida"
    },
    {
        " to refer to the group containing Ornithischia and Theropoda. Dinosauria itself was re-defined as the last common ancestor of  Triceratops horridus ,  Passer domesticus  and  Diplodocus carnegii , and all of its descendants, to ensure that sauropods and kin remain included as dinosaurs.  A version of this article appears in print on March 28, 2017, on Page D6 of the New York edition with the headline: Shaking Up the Dinosaur Family Tree.  This file contains Supplementary Text and Data, Supplementary Tables 1-3 and additional references. :           Using one of the above definitions, dinosaurs can be generally described as ": null
    },
    {
        "archosaurs": "archosaur"
    },
    {
        "with ": null
    },
    {
        "hind limbs held erect beneath the body": "terrestrial locomotionposture"
    },
    {
        ". Many prehistoric animal groups are popularly conceived of as dinosaurs, such as ichthyosaurs, mosasaurs, plesiosaurs, pterosaurs, and ": null
    },
    {
        "pelycosaurs": "pelycosaur"
    },
    {
        " , but are not classified scientifically as dinosaurs, and none had the erect hind limb posture characteristic of true dinosaurs. Dinosaurs were the dominant terrestrial vertebrates of the ": null
    },
    {
        "Mesozoic": "mesozoic"
    },
    {
        " Era": "era"
    },
    {
        ", especially the Jurassic and Cretaceous periods. Other groups of animals were restricted in size and niches; ": null
    },
    {
        "mammal": "mammal"
    },
    {
        "s, for example, rarely exceeded the size of a domestic cat, and were generally rodent-sized carnivores of small prey.     Dinosaurs have always been an extremely varied group of animals; according to a 2006 study, over 500 non-avian dinosaur genera have been identified with certainty so far, and the total number of genera preserved in the fossil record has been estimated at around 1850, nearly 75% of which remain to be discovered. An earlier study predicted that about 3,400 dinosaur genera existed, including many that would not have been preserved in the fossil record. By September 17, 2008, 1,047 different species of dinosaurs had been named.     In 2016, the estimated number of dinosaur species that existed in the Mesozoic was estimated to be 1,543–2,468.   Some are herbivorous, others carnivorous, including seed-eaters, fish-eaters, insectivores, and omnivores. While dinosaurs were ancestrally bipedal , some prehistoric species were quadrupeds, and others, such as  Anchisaurus  and Iguanodon, could walk just as easily on two or four legs. Cranial modifications like horns and crests are common dinosaurian traits, and some extinct species had bony armor. Although known for large size, many Mesozoic dinosaurs were human-sized or smaller, and modern birds are generally small in size. Dinosaurs today inhabit every continent, and fossils show that they had achieved global distribution by at least the ": null
    },
    {
        "Early Jurassic": "early jurassic"
    },
    {
        " epoch. Modern birds inhabit most available habitats, from terrestrial to marine, and there is evidence that some non-avian dinosaurs  could fly or at least glide, and others, such as ": null
    },
    {
        "spinosaurids": "spinosauridae"
    },
    {
        ", had ": null
    },
    {
        "semiaquatic": "list of semiaquatic tetrapods"
    },
    {
        " habits.       While recent discoveries have made it more difficult to present a universally agreed-upon list of dinosaurs distinguishing features, nearly all dinosaurs discovered so far share certain modifications to the ancestral ": null
    },
    {
        "archosaur": "archosaur"
    },
    {
        "ian skeleton, or are clear descendants of older dinosaurs showing these modifications. Although some later groups of dinosaurs featured further modified versions of these traits, they are considered typical for Dinosauria; the earliest dinosaurs had them and passed them on to their descendants. Such modifications, originating in the most recent common ancestor of a certain taxonomic group, are called the ": null
    },
    {
        "synapomorphies": "synapomorphy and apomorphy"
    },
    {
        " of such a group.     A detailed assessment of archosaur interrelations by ": null
    },
    {
        "Sterling Nesbitt": "sterling nesbitt"
    },
    {
        " confirmed or found the following twelve unambiguous synapomorphies, some previously known:   in the ": null
    },
    {
        "skull": "skull"
    },
    {
        ", a supratemporal fossa is present in front of the ": null
    },
    {
        "supratemporal fenestra": "skullstructure"
    },
    {
        ", the main opening in the rear skull roof   ": null
    },
    {
        "epipophyses": "epipophyses"
    },
    {
        ", obliquely backward pointing processes on the rear top corners, present in the anterior neck ": null
    },
    {
        "vertebra": "vertebra"
    },
    {
        "e behind the ": null
    },
    {
        "atlas": "atlas"
    },
    {
        " and ": null
    },
    {
        "axis": "axis"
    },
    {
        ", the first two neck vertebrae   apex of deltopectoral crest  located at or more than 30% down the length of the ": null
    },
    {
        "humerus": "humerus"
    },
    {
        "   radius": "radius"
    },
    {
        ", a lower arm bone, shorter than 80% of humerus length   ": null
    },
    {
        "fourth trochanter": "fourth trochanter"
    },
    {
        "  on the ": null
    },
    {
        "femur": "femur"
    },
    {
        " is a sharp flange   fourth trochanter asymmetrical, with distal, lower, margin forming a steeper angle to the shaft   on the ": null
    },
    {
        "astragalus": "talus bone"
    },
    {
        " and ": null
    },
    {
        "calcaneum": "calcaneus"
    },
    {
        ", upper ankle bones, the proximal articular facet, the top connecting surface, for the ": null
    },
    {
        "fibula": "fibula"
    },
    {
        " occupies less than 30% of the transverse width of the element   exoccipitals do not meet along the midline on the floor of the endocranial cavity, the inner space of the braincase   in the pelvis, the proximal articular surfaces of the ": null
    },
    {
        "ischium": "ischium"
    },
    {
        " with the ": null
    },
    {
        "ilium": "ilium"
    },
    {
        " and the ": null
    },
    {
        "pubis": "pubis"
    },
    {
        " are separated by a large concave surface   ": null
    },
    {
        "cnemial crest": "cnemial crest"
    },
    {
        " on the ": null
    },
    {
        "tibia": "tibia"
    },
    {
        " arcs anterolaterally   distinct proximodistally oriented ridge present on the posterior face of the distal end of the tibia   concave articular surface for the fibula of the calcaneum     Nesbitt found a number of further potential synapomorphies, and discounted a number of synapomorphies previously suggested. Some of these are also present in ": null
    },
    {
        "silesaurids": "silesauridae"
    },
    {
        ", which Nesbitt recovered as a sister group to Dinosauria, including a large anterior trochanter, metatarsals II and IV of subequal length, reduced contact between ischium and pubis, the presence of a cnemial crest on the tibia and of an ascending process on the astragalus, and many others.      A variety of other skeletal features are shared by dinosaurs. However, because they are either common to other groups of archosaurs or were not present in all early dinosaurs, these features are not considered to be synapomorphies. For example, as ": null
    },
    {
        "diapsid": "diapsid"
    },
    {
        "s, dinosaurs ancestrally had two pairs of ": null
    },
    {
        "Infratemporal fenestra": "infratemporal fenestra"
    },
    {
        "e , and as members of the diapsid group ": null
    },
    {
        "Archosaur": "archosaur"
    },
    {
        "ia, had additional openings in the ": null
    },
    {
        "snout": "antorbital fenestra"
    },
    {
        " and lower jaw. Additionally, several characteristics once thought to be synapomorphies are now known to have appeared before dinosaurs, or were absent in the earliest dinosaurs and independently evolved by different dinosaur groups. These include an elongated ": null
    },
    {
        "scapula": "scapula"
    },
    {
        ", or shoulder blade; a ": null
    },
    {
        "sacrum": "sacrum"
    },
    {
        " composed of three or more fused vertebrae ; and a ": null
    },
    {
        "perforate acetabulum": "acetabulumperforate acetabulum"
    },
    {
        ", or hip socket, with a hole at the center of its inside surface .  Another difficulty of determining distinctly dinosaurian features is that early dinosaurs and other archosaurs from the ": null
    },
    {
        "Late Triassic": "late triassic"
    },
    {
        " epoch are often poorly known and were similar in many ways; these animals have sometimes been misidentified in the literature.      Dinosaurs stand with their hind limbs erect in a manner similar to ": null
    },
    {
        "most modern mammals": "evolution of mammalserect limbs"
    },
    {
        ", but distinct from most other reptiles, whose limbs sprawl out to either side. This posture is due to the development of a laterally facing recess in the pelvis and a corresponding inwardly facing distinct head on the femur. Their erect posture enabled early dinosaurs to breathe easily while moving, which likely permitted stamina and activity levels that ": null
    },
    {
        "surpassed those of sprawling reptiles": "carriers constraint"
    },
    {
        ". Erect limbs probably also helped support the ": null
    },
    {
        "evolution": "evolution"
    },
    {
        " of large size by reducing bending stresses on limbs. Some non-dinosaurian archosaurs, including ": null
    },
    {
        "rauisuchia": "rauisuchia"
    },
    {
        "ns, also had erect limbs but achieved this by a pillar-erect configuration of the hip joint, where instead of having a projection from the femur insert on a socket on the hip, the ": null
    },
    {
        "upper pelvic bone": "ilium"
    },
    {
        " was rotated to form an overhanging shelf.              Dinosaurs diverged from their archosaur ancestors during the Middle to Late Triassic epochs, roughly 20  million years after the devastating ": null
    },
    {
        "Permian–Triassic extinction event": "permian–triassic extinction event"
    },
    {
        " wiped out an estimated 96% of all marine species and 70% of terrestrial vertebrate species approximately 252 million years ago. ": null
    },
    {
        "Radiometric dating": "radiometric dating"
    },
    {
        " of the ": null
    },
    {
        "rock formation": "list of rock formations"
    },
    {
        " that contained fossils from the early dinosaur ": null
    },
    {
        "genus": "genus"
    },
    {
        "  Eoraptor  at 231.4  million years old establishes its presence in the fossil record at this time.  Paleontologists think that Eoraptor resembles the ": null
    },
    {
        "common ancestor": "common descent"
    },
    {
        " of all dinosaurs; if this is true, its traits suggest that the first dinosaurs were small, bipedal ": null
    },
    {
        "predators": "predation"
    },
    {
        ". The discovery of primitive, dinosaur-like ornithodirans such as  Marasuchus  and  Lagerpeton  in ": null
    },
    {
        "Argentinian": "argentina"
    },
    {
        " Middle Triassic": "middle triassic"
    },
    {
        " strata supports this view; analysis of recovered fossils suggests that these animals were indeed small, bipedal predators. Dinosaurs may have appeared as early as 243  million years ago, as evidenced by remains of the genus  Nyasasaurus  from that period, though known fossils of these animals are too fragmentary to tell if they are dinosaurs or very close dinosaurian relatives.  Paleontologist Max C. Langer et al. determined that  Staurikosaurus  from the ": null
    },
    {
        "Santa Maria Formation": "santa maria formation"
    },
    {
        " dates to 233.23  million years ago, making it older in geologic age than Eoraptor.      When dinosaurs appeared, they were not the dominant terrestrial animals. The terrestrial habitats were occupied by various types of ": null
    },
    {
        "archosauromorphs": "archosauromorpha"
    },
    {
        " and ": null
    },
    {
        "therapsid": "therapsid"
    },
    {
        "s, like ": null
    },
    {
        "cynodonts": "cynodont"
    },
    {
        "and ": null
    },
    {
        "rhynchosaur": "rhynchosaur"
    },
    {
        "s. Their main competitors were the ": null
    },
    {
        "pseudosuchia": "pseudosuchia"
    },
    {
        ", such as ": null
    },
    {
        "aetosaur": "aetosaur"
    },
    {
        "s, ": null
    },
    {
        "ornithosuchids": "ornithosuchidae"
    },
    {
        " and rauisuchians, which were more successful than the dinosaurs.  Most of these other animals became extinct in the Triassic, in one of two events. First, at about 215  million years ago, a variety of ": null
    },
    {
        "basal": "basal"
    },
    {
        " archosauromorphs, including the ": null
    },
    {
        "protorosaurs": "protorosauria"
    },
    {
        ", became extinct. This was followed by the Triassic–Jurassic extinction event , that saw the end of most of the other groups of early archosaurs, like aetosaurs, ornithosuchids, ": null
    },
    {
        "phytosaur": "phytosaur"
    },
    {
        "s, and rauisuchians. Rhynchosaurs and ": null
    },
    {
        "dicynodonts": "dicynodont"
    },
    {
        "survived at least as late as early-mid ": null
    },
    {
        "Norian": "norian"
    },
    {
        " and late Norian or earliest ": null
    },
    {
        "Rhaetian": "rhaetian"
    },
    {
        " stage": "stage"
    },
    {
        "s, respectively,   and the exact date of their ": null
    },
    {
        "extinction": "extinction"
    },
    {
        " is uncertain. These losses left behind a land fauna of ": null
    },
    {
        "crocodylomorphs": "crocodylomorpha"
    },
    {
        ", dinosaurs, mammals, ": null
    },
    {
        "pterosaur": "pterosaur"
    },
    {
        "ians, and ": null
    },
    {
        "turtle": "turtle"
    },
    {
        "s. The first few lines of early dinosaurs ": null
    },
    {
        "diversified": "adaptive radiation"
    },
    {
        " through the ": null
    },
    {
        "Carnian": "carnian"
    },
    {
        " and ": null
    },
    {
        "Norian": "norian"
    },
    {
        " stages of the Triassic, possibly by occupying the niches of the groups that became extinct. Also notably, there was a heightened rate of extinction during the ": null
    },
    {
        "Carnian Pluvial Event": "carnian pluvial event"
    },
    {
        ".        Dinosaur evolution after the Triassic follows changes in vegetation and the location of continents. In the Late Triassic and Early Jurassic, the continents were connected as the single landmass ": null
    },
    {
        "Pangaea": "pangaea"
    },
    {
        ", and there was a worldwide dinosaur fauna mostly composed of ": null
    },
    {
        "coelophysoid": "coelophysoidea"
    },
    {
        " carnivores and early sauropodomorph herbivores. ": null
    },
    {
        "Gymnosperm": "gymnosperm"
    },
    {
        " plants , a potential food source, ": null
    },
    {
        "radiated": "evolutionary radiation"
    },
    {
        " in the Late Triassic. Early sauropodomorphs did not have sophisticated mechanisms for processing food in the mouth, and so must have employed other means of breaking down food farther along the digestive tract. The general homogeneity of dinosaurian faunas continued into the Middle and Late Jurassic, where most localities had predators consisting of ": null
    },
    {
        "ceratosauria": "ceratosauria"
    },
    {
        "ns, ": null
    },
    {
        "spinosauroids": "megalosauroidea"
    },
    {
        ", and ": null
    },
    {
        "carnosauria": "carnosauria"
    },
    {
        "ns, and herbivores consisting of stegosaurian ": null
    },
    {
        "ornithischia": "ornithischia"
    },
    {
        "ns and large sauropods. Examples of this include the ": null
    },
    {
        "Morrison Formation": "morrison formation"
    },
    {
        " of ": null
    },
    {
        "North America": "north america"
    },
    {
        " and ": null
    },
    {
        "Tendaguru Beds": "tendaguru formation"
    },
    {
        " of ": null
    },
    {
        "Tanzania": "tanzania"
    },
    {
        ". Dinosaurs in ": null
    },
    {
        "China": "china"
    },
    {
        " show some differences, with specialized ": null
    },
    {
        "sinraptorid": "metriacanthosauridae"
    },
    {
        " theropods and unusual, long-necked sauropods like  Mamenchisaurus . Ankylosaurians and ornithopods were also becoming more common, but ": null
    },
    {
        "prosauropods": "plateosauridae"
    },
    {
        " had become extinct. Conifers and ": null
    },
    {
        "pteridophytes": "pteridophyte"
    },
    {
        "were the most common plants. Sauropods, like the earlier prosauropods, were not oral processors, but ornithischians were evolving various means of dealing with food in the mouth, including potential ": null
    },
    {
        "cheek": "cheek"
    },
    {
        "-like organs to keep food in the mouth, and jaw motions to grind food. Another notable evolutionary event of the Jurassic was the appearance of true birds, descended from ": null
    },
    {
        "maniraptora": "maniraptora"
    },
    {
        "n ": null
    },
    {
        "coelurosauria": "coelurosauria"
    },
    {
        "ns.      By the ": null
    },
    {
        "Early Cretaceous": "early cretaceous"
    },
    {
        " and the ongoing breakup of Pangaea, dinosaurs were becoming strongly differentiated by landmass. The earliest part of this time saw the spread of ankylosaurians, ": null
    },
    {
        "iguanodontia": "iguanodontia"
    },
    {
        "ns, and ": null
    },
    {
        "brachiosaurids": "brachiosauridae"
    },
    {
        " through ": null
    },
    {
        "Europe": "europe"
    },
    {
        ", North America, and northern ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". These were later supplemented or replaced in Africa by large spinosaurid and ": null
    },
    {
        "carcharodontosaurid": "carcharodontosauridae"
    },
    {
        " theropods, and ": null
    },
    {
        "rebbachisaurid": "rebbachisauridae"
    },
    {
        " and ": null
    },
    {
        "titanosauria": "titanosauria"
    },
    {
        "n sauropods, also found in ": null
    },
    {
        "South America": "south america"
    },
    {
        ". In ": null
    },
    {
        "Asia": "asia"
    },
    {
        ", maniraptoran coelurosaurians like ": null
    },
    {
        "dromaeosaurids": "dromaeosauridae"
    },
    {
        ", ": null
    },
    {
        "troodontids": "troodontidae"
    },
    {
        ", and ": null
    },
    {
        "oviraptorosauria": "oviraptorosauria"
    },
    {
        "ns became the common theropods, and ": null
    },
    {
        "ankylosaurids": "ankylosauridae"
    },
    {
        " and early ceratopsians like Psittacosaurus became important herbivores. Meanwhile, ": null
    },
    {
        "Australia": "australia"
    },
    {
        " was home to a fauna of basal ankylosaurians, ": null
    },
    {
        "hypsilophodont": "hypsilophodont"
    },
    {
        "s, and iguanodontians. The stegosaurians appear to have gone extinct at some point in the late Early Cretaceous or early ": null
    },
    {
        "Late Cretaceous": "late cretaceous"
    },
    {
        ". A major change in the Early Cretaceous, which would be amplified in the Late Cretaceous, was the evolution of ": null
    },
    {
        "flowering plants": "angiosperm"
    },
    {
        ". At the same time, several groups of dinosaurian herbivores evolved more sophisticated ways to orally process food. Ceratopsians developed a method of slicing with teeth stacked on each other in batteries, and iguanodontians refined a method of grinding with ": null
    },
    {
        "dental batteries": "dinosaur toothdental batteries"
    },
    {
        ", taken to its extreme in ": null
    },
    {
        "hadrosaurids": "hadrosauridae"
    },
    {
        ". Some sauropods also evolved tooth batteries, best exemplified by the rebbachisaurid  Nigersaurus .      There were three general dinosaur faunas in the Late Cretaceous. In the northern continents of North America and Asia, the major theropods were ": null
    },
    {
        "tyrannosaurids": "tyrannosauridae"
    },
    {
        " and various types of smaller maniraptoran theropods, with a predominantly ornithischian herbivore assemblage of hadrosaurids, ceratopsians, ankylosaurids, and ": null
    },
    {
        "pachycephalosauria": "pachycephalosauria"
    },
    {
        "ns. In the southern continents that had made up the now-splitting ": null
    },
    {
        "Gondwana": "gondwana"
    },
    {
        ", ": null
    },
    {
        "abelisaurids": "abelisauridae"
    },
    {
        " were the common theropods, and titanosaurian sauropods the common herbivores. Finally, in Europe, dromaeosaurids, ": null
    },
    {
        "rhabdodontid": "rhabdodontidae"
    },
    {
        " iguanodontians, ": null
    },
    {
        "nodosaurid": "nodosauridae"
    },
    {
        " ankylosaurians, and titanosaurian sauropods were prevalent. Flowering plants were greatly radiating, with the first grasses appearing by the end of the Cretaceous. Grinding hadrosaurids and shearing ceratopsians became extremely diverse across North America and Asia. Theropods were also radiating as herbivores or ": null
    },
    {
        "omnivore": "omnivore"
    },
    {
        "s, with ": null
    },
    {
        "therizinosaur": "therizinosauria"
    },
    {
        "ians and ": null
    },
    {
        "ornithomimosauria": "ornithomimosauria"
    },
    {
        "ns becoming common.     The Cretaceous–Paleogene extinction event, which occurred approximately 66  million years ago at the end of the Cretaceous, caused the extinction of all dinosaur groups except for the ": null
    },
    {
        "neornithine": "birddiversification of modern birds"
    },
    {
        " birds. Some other diapsid groups, such as ": null
    },
    {
        "crocodilia": "crocodilia"
    },
    {
        "ns, ": null
    },
    {
        "sebecosuchia": "sebecosuchia"
    },
    {
        "ns, turtles, ": null
    },
    {
        "lizard": "lizard"
    },
    {
        "s, ": null
    },
    {
        "snake": "snake"
    },
    {
        "s, ": null
    },
    {
        "sphenodontia": "rhynchocephalia"
    },
    {
        "ns, and ": null
    },
    {
        "choristodera": "choristodera"
    },
    {
        "ns, also survived the event.     The surviving lineages of neornithine birds, including the ancestors of modern ": null
    },
    {
        "ratite": "ratite"
    },
    {
        "s, ": null
    },
    {
        "ducks and chickens": "fowl"
    },
    {
        ", and a variety of ": null
    },
    {
        "waterbirds": "charadriiformes"
    },
    {
        ", diversified rapidly at the beginning of the ": null
    },
    {
        "Paleogene": "paleogene"
    },
    {
        " period, entering ": null
    },
    {
        "ecological niches": "ecological niche"
    },
    {
        "left vacant by the extinction of Mesozoic dinosaur groups such as the arboreal ": null
    },
    {
        "enantiornithine": "enantiornithine"
    },
    {
        "s, aquatic ": null
    },
    {
        "hesperornithine": "hesperornithine"
    },
    {
        "s, and even the larger terrestrial theropods . It is often cited that mammals out-competed the neornithines for dominance of most terrestrial niches but many of these groups co-existed with rich mammalian faunas for most of the ": null
    },
    {
        "Cenozoic": "cenozoic"
    },
    {
        " Era.  ": null
    },
    {
        "Terror birds": "terror bird"
    },
    {
        "and ": null
    },
    {
        "bathornithids": "bathornithids"
    },
    {
        " occupied carnivorous guilds alongside predatory mammals,   and ratites are still fairly successful as mid-sized herbivores; eogruiids similarly lasted from the ": null
    },
    {
        "Eocene": "eocene"
    },
    {
        " to ": null
    },
    {
        "Pliocene": "pliocene"
    },
    {
        ", only becoming extinct very recently after over 20  million years of co-existence with many mammal groups.             Dinosaurs belong to a group known as archosaurs, which also includes modern crocodilians. Within the archosaur group, dinosaurs are differentiated most noticeably by their gait. Dinosaur legs extend directly beneath the body, whereas the legs of lizards and crocodilians sprawl out to either side.     Collectively, dinosaurs as a clade are divided into two primary branches, Saurischia and Ornithischia. Saurischia includes those taxa sharing a more recent common ancestor with birds than with Ornithischia, while Ornithischia includes all ": null
    },
    {
        "taxa": "taxon"
    },
    {
        " sharing a more recent common ancestor with Triceratops than with Saurischia. Anatomically, these two groups can be distinguished most noticeably by their ": null
    },
    {
        "pelvic": "pelvis"
    },
    {
        " structure. Early saurischians— lizard-hipped , from the ": null
    },
    {
        "Greek": "ancient greek"
    },
    {
        " sauros meaning lizard and ischion meaning hip joint —retained the hip structure of their ancestors, with a pubis bone directed ": null
    },
    {
        "cranially": "anatomical terms of location"
    },
    {
        ", or forward. This basic form was modified by rotating the pubis backward to varying degrees in several groups . Saurischia includes the theropods and sauropodomorphs .      By contrast, ornithischians— bird-hipped , from the Greek ornitheios meaning of a bird and ischion meaning hip joint —had a pelvis that superficially resembled a birds pelvis: the pubic bone was oriented ": null
    },
    {
        "caudally": "anatomical terms of location"
    },
    {
        " . Unlike birds, the ornithischian pubis also usually had an additional forward-pointing process. Ornithischia includes a variety of species which were primarily herbivores.        Image:Saurischia pelvis.png|": null
    },
    {
        "Saurischia": "saurischia"
    },
    {
        "n pelvis structure   Image:Tyrannosaurus pelvis left.jpg| Tyrannosaurus  pelvis   Image:Ornithischia pelvis.png|": null
    },
    {
        "Ornithischia": "ornithischia"
    },
    {
        "n pelvis structure   Image:Edmontosaurus pelvis left.jpg| Edmontosaurus  pelvis         The following is a simplified classification of dinosaur groups based on their evolutionary relationships, and organized based on the list of Mesozoic dinosaur species provided by Holtz . A more detailed version can be found at ": null
    },
    {
        "Dinosaur classification": "dinosaur classification"
    },
    {
        ".   The dagger is used to signify groups with no living members.   Dinosauria   :": null
    },
    {
        "Saurischia": "saurischia"
    },
    {
        "   ::†": null
    },
    {
        "Herrerasauria": "herrerasauridae"
    },
    {
        "   ::": null
    },
    {
        "Theropoda": "theropoda"
    },
    {
        "      :::†": null
    },
    {
        "Coelophysoidea": "coelophysoidea"
    },
    {
        "    :::†": null
    },
    {
        "Dilophosauridae": "dilophosauridae"
    },
    {
        "   :::†": null
    },
    {
        "Ceratosauria": "ceratosauria"
    },
    {
        "   :::": null
    },
    {
        "Tetanurae": "tetanurae"
    },
    {
        "   ::::†": null
    },
    {
        "Megalosauroidea": "megalosauroidea"
    },
    {
        "   ::::†": null
    },
    {
        "Carnosauria": "carnosauria"
    },
    {
        "    ::::": null
    },
    {
        "Coelurosauria": "coelurosauria"
    },
    {
        "    :::::†": null
    },
    {
        "Compsognathidae": "compsognathidae"
    },
    {
        "   :::::†": null
    },
    {
        "Tyrannosauridae": "tyrannosauridae"
    },
    {
        "    :::::†": null
    },
    {
        "Ornithomimosauria": "ornithomimosauria"
    },
    {
        "    :::::†": null
    },
    {
        "Alvarezsauroidea": "alvarezsauroidea"
    },
    {
        "   :::::": null
    },
    {
        "Maniraptora": "maniraptora"
    },
    {
        "   ::::::†": null
    },
    {
        "Therizinosauria": "therizinosauria"
    },
    {
        "   ::::::†": null
    },
    {
        "Oviraptorosauria": "oviraptorosauria"
    },
    {
        "   ::::::†": null
    },
    {
        "Archaeopterygidae": "archaeopterygidae"
    },
    {
        "   ::::::†": null
    },
    {
        "Deinonychosauria": "deinonychosauria"
    },
    {
        "   ::::::": null
    },
    {
        "Avialae": "avialae"
    },
    {
        "   :::::::†": null
    },
    {
        "Scansoriopterygidae": "scansoriopterygidae"
    },
    {
        "   :::::::†": null
    },
    {
        "Omnivoropterygidae": "omnivoropterygidae"
    },
    {
        "   :::::::†": null
    },
    {
        "Confuciusornithidae": "confuciusornithidae"
    },
    {
        "   :::::::†": null
    },
    {
        "Enantiornithes": "enantiornithes"
    },
    {
        "   :::::::": null
    },
    {
        "Euornithes": "euornithes"
    },
    {
        "   ::::::::†": null
    },
    {
        "Yanornithiformes": "yanornithiformes"
    },
    {
        "   ::::::::†": null
    },
    {
        "Hesperornithes": "hesperornithes"
    },
    {
        "   ::::::::": null
    },
    {
        "Aves": "bird"
    },
    {
        "      ::†": null
    },
    {
        "Sauropodomorpha": "sauropodomorpha"
    },
    {
        "   :::†": null
    },
    {
        "Guaibasauridae": "guaibasauridae"
    },
    {
        "   :::†": null
    },
    {
        "Plateosauridae": "plateosauridae"
    },
    {
        "   :::†": null
    },
    {
        "Riojasauridae": "riojasauridae"
    },
    {
        "   :::†": null
    },
    {
        "Massospondylidae": "massospondylidae"
    },
    {
        "   :::†": null
    },
    {
        "Sauropoda": "sauropoda"
    },
    {
        "    ::::†": null
    },
    {
        "Vulcanodontidae": "vulcanodontidae"
    },
    {
        "   ::::†": null
    },
    {
        "Eusauropoda": "eusauropoda"
    },
    {
        "   :::::†": null
    },
    {
        "Cetiosauridae": "cetiosauridae"
    },
    {
        "   :::::†": null
    },
    {
        "Turiasauria": "turiasauria"
    },
    {
        "   :::::†": null
    },
    {
        "Neosauropoda": "neosauropoda"
    },
    {
        "   ::::::†": null
    },
    {
        "Diplodocoidea": "diplodocoidea"
    },
    {
        "   ::::::†": null
    },
    {
        "Macronaria": "macronaria"
    },
    {
        "   :::::::†": null
    },
    {
        "Brachiosauridae": "brachiosauridae"
    },
    {
        "   :::::::†": null
    },
    {
        "Titanosaur": "titanosaur"
    },
    {
        "ia      :†": null
    },
    {
        "Ornithischia": "ornithischia"
    },
    {
        "   ::†": null
    },
    {
        "Heterodontosauridae": "heterodontosauridae"
    },
    {
        "    ::†": null
    },
    {
        "Thyreophora": "thyreophora"
    },
    {
        "   :::†": null
    },
    {
        "Ankylosauria": "ankylosauria"
    },
    {
        "    :::†": null
    },
    {
        "Stegosauria": "stegosauria"
    },
    {
        "   ::†": null
    },
    {
        "Neornithischia": "neornithischia"
    },
    {
        "   :::†": null
    },
    {
        "Ornithopod": "ornithopod"
    },
    {
        "a   :::†": null
    },
    {
        "Marginocephalia": "marginocephalia"
    },
    {
        "   ::::†": null
    },
    {
        "Pachycephalosauria": "pachycephalosauria"
    },
    {
        "   ::::†": null
    },
    {
        "Ceratopsia": "ceratopsia"
    },
    {
        "       Knowledge about dinosaurs is derived from a variety of fossil and non-fossil records, including fossilized bones, ": null
    },
    {
        "feces": "feces"
    },
    {
        ", ": null
    },
    {
        "trackway": "fossil trackway"
    },
    {
        "s, ": null
    },
    {
        "gastrolith": "gastrolith"
    },
    {
        "s, ": null
    },
    {
        "feather": "feather"
    },
    {
        "s, impressions of skin, ": null
    },
    {
        "internal organs": "organ"
    },
    {
        "and ": null
    },
    {
        "soft tissue": "soft tissue"
    },
    {
        "s.  Many fields of study contribute to our understanding of dinosaurs, including ": null
    },
    {
        "physics": "physics"
    },
    {
        " , ": null
    },
    {
        "chemistry": "chemistry"
    },
    {
        ", ": null
    },
    {
        "biology": "biology"
    },
    {
        ", and the ": null
    },
    {
        "Earth sciences": "earth science"
    },
    {
        " .  Two topics of particular interest and study have been dinosaur size and behavior.              Current evidence suggests that dinosaur average size varied through the Triassic, Early Jurassic, Late Jurassic and Cretaceous. Predatory theropod dinosaurs, which occupied most terrestrial carnivore niches during the Mesozoic, most often fall into the  category when sorted by estimated weight into categories based on ": null
    },
    {
        "order of magnitude": "order of magnitude"
    },
    {
        ", whereas ": null
    },
    {
        "recent": "holocene"
    },
    {
        " predatory carnivoran mammals peak in the  category. The ": null
    },
    {
        "mode": "mode"
    },
    {
        " of Mesozoic dinosaur body masses is between . This contrasts sharply with the average size of Cenozoic mammals, estimated by the ": null
    },
    {
        "National Museum of Natural History": "national museum of natural history"
    },
    {
        " as about .     The sauropods were the largest and heaviest dinosaurs. For much of the dinosaur era, the smallest sauropods were larger than anything else in their habitat, and the largest were an ": null
    },
    {
        "order of magnitude": "order of magnitude"
    },
    {
        " more massive than anything else that has since walked the Earth. Giant prehistoric mammals such as  Paraceratherium  were dwarfed by the giant sauropods, and only modern whales approach or surpass them in size.  There are several proposed advantages for the large size of sauropods, including protection from predation, reduction of energy use, and longevity, but it may be that the most important advantage was dietary. Large animals are more efficient at digestion than small animals, because food spends more time in their digestive systems. This also permits them to subsist on food with lower nutritive value than smaller animals. Sauropod remains are mostly found in rock formations interpreted as dry or seasonally dry, and the ability to eat large quantities of low-nutrient browse would have been advantageous in such environments.       Scientists will probably never be certain of the ": null
    },
    {
        "largest and smallest dinosaurs": "largest organisms"
    },
    {
        " to have ever existed. This is because only a tiny percentage of animals were ever fossilized and most of these remain buried in the earth. Few of the specimens that are recovered are complete skeletons, and impressions of skin and other soft tissues are rare. Rebuilding a complete skeleton by comparing the size and morphology of bones to those of similar, better-known species is an inexact art, and reconstructing the muscles and other organs of the living animal is, at best, a process of educated guesswork.         The tallest and heaviest dinosaur known from good skeletons is  Giraffatitan brancai  . Its remains were discovered in Tanzania between 1907 and 1912. Bones from several similar-sized individuals were incorporated into the skeleton now mounted and on display at the ": null
    },
    {
        "Museum für Naturkunde": "natural history museum, berlin"
    },
    {
        " in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        "; this mount is  tall and  long,   and would have belonged to an animal that weighed between  and   kilograms . The longest complete dinosaur is the  long  Diplodocus , which was discovered in ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        " in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " and displayed in ": null
    },
    {
        "Pittsburghs": "pittsburgh"
    },
    {
        " Carnegie Museum of Natural History": "carnegie museum of natural history"
    },
    {
        " in 1907.  The longest dinosaur known from good fossil material is the  Patagotitan : the skeleton mount in the ": null
    },
    {
        "American Museum of Natural History": "american museum of natural history"
    },
    {
        " in ": null
    },
    {
        "New York": "new york city"
    },
    {
        " is  long. The ": null
    },
    {
        "Museo Municipal Carmen Funes": "museo carmen funes"
    },
    {
        " in ": null
    },
    {
        "Plaza Huincul": "plaza huincul"
    },
    {
        ", ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", has an  Argentinosaurus  reconstructed skeleton mount  long.       There were larger dinosaurs, but knowledge of them is based entirely on a small number of fragmentary fossils. Most of the largest herbivorous specimens on record were discovered in the 1970s or later, and include the massive Argentinosaurus, which may have weighed  to   kilograms and reached length of ; some of the longest were the  long Diplodocus hallorum , the  long  Supersaurus  and  long  Patagotitan ; and the tallest, the  tall  Sauroposeidon , which could have reached a sixth-floor window. The heaviest and longest dinosaur may have been  Maraapunisaurus , known only from a now lost partial vertebral ": null
    },
    {
        "neural arch": "vertebrastructure"
    },
    {
        " described in 1878. Extrapolating from the illustration of this bone, the animal may have been  long and weighed  kg . However, as no further evidence of sauropods of this size has been found, and the discoverer, ": null
    },
    {
        "Edward Drinker Cope": "edward drinker cope"
    },
    {
        ", had made typographic errors before, it is likely to have been an extreme overestimation.      The largest carnivorous dinosaur was  Spinosaurus , reaching a length of , and weighing . Other large carnivorous theropods included  Giganotosaurus ,  Carcharodontosaurus  and  Tyrannosaurus .  Therizinosaurus  and  Deinocheirus  were among the tallest of the theropods. The largest ornithischian dinosaur was probably the hadrosaurid  Shantungosaurus giganteus  which measured   . The largest individuals may have weighed as much as .      The smallest dinosaur known is the ": null
    },
    {
        "bee hummingbird": "bee hummingbird"
    },
    {
        ",  with a length of only  and mass of around .  The smallest known non-": null
    },
    {
        "avialan": "avialae"
    },
    {
        " dinosaurs were about the size of ": null
    },
    {
        "pigeons": "pigeon"
    },
    {
        "and were those theropods most closely related to birds. For example,  Anchiornis huxleyi  is currently the smallest non-avialan dinosaur described from an adult specimen, with an estimated weight of 110  grams and a total skeletal length of . The smallest herbivorous non-avialan dinosaurs included  Microceratus  and  Wannanosaurus , at about  long each.            Many modern birds are highly social, often found living in flocks. There is general agreement that some behaviors that are common in birds, as well as in ": null
    },
    {
        "crocodiles": "crocodile"
    },
    {
        ", were also common among extinct dinosaur groups. Interpretations of behavior in fossil species are generally based on the pose of skeletons and their ": null
    },
    {
        "habitat": "habitat"
    },
    {
        ", ": null
    },
    {
        "computer simulations": "computer simulation"
    },
    {
        "of their ": null
    },
    {
        "biomechanics": "biomechanics"
    },
    {
        ", and comparisons with modern animals in similar ecological niches.     The first potential evidence for ": null
    },
    {
        "herd": "herd"
    },
    {
        "ing or ": null
    },
    {
        "flocking": "flocking"
    },
    {
        " as a widespread behavior common to many dinosaur groups in addition to birds was the 1878 discovery of 31   Iguanodon bernissartensis , ornithischians that were then thought to have perished together in ": null
    },
    {
        "Bernissart": "bernissart"
    },
    {
        ", ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", after they fell into a deep, flooded ": null
    },
    {
        "sinkhole": "sinkhole"
    },
    {
        " and drowned. Other mass-death sites have been discovered subsequently. Those, along with multiple trackways, suggest that gregarious behavior was common in many early dinosaur species. Trackways of hundreds or even thousands of herbivores indicate that duck-billed may have moved in great herds, like the ": null
    },
    {
        "American bison": "american bison"
    },
    {
        " or the African ": null
    },
    {
        "Springbok": "springbok"
    },
    {
        ". Sauropod tracks document that these animals traveled in groups composed of several different species, at least in ": null
    },
    {
        "Oxfordshire": "oxfordshire"
    },
    {
        ", England, although there is no evidence for specific herd structures. Congregating into herds may have evolved for defense, for ": null
    },
    {
        "migratory": "bird migration"
    },
    {
        " purposes, or to provide protection for young. There is evidence that many types of slow-growing dinosaurs, including various theropods, sauropods, ankylosaurians, ornithopods, and ceratopsians, formed aggregations of immature individuals. One example is a site in ": null
    },
    {
        "Inner Mongolia": "inner mongolia"
    },
    {
        " that has yielded the remains of over 20  Sinornithomimus , from one to seven years old. This assemblage is interpreted as a social group that was trapped in mud. The interpretation of dinosaurs as gregarious has also extended to depicting carnivorous theropods as ": null
    },
    {
        "pack hunters": "pack hunter"
    },
    {
        "working together to bring down large prey. However, this lifestyle is uncommon among modern birds, crocodiles, and other reptiles, and the ": null
    },
    {
        "taphonomic": "taphonomy"
    },
    {
        " evidence suggesting mammal-like pack hunting in such theropods as  Deinonychus  and  Allosaurus  can also be interpreted as the results of fatal disputes between feeding animals, as is seen in many modern diapsid predators.        The crests and ": null
    },
    {
        "frills": "neck frill"
    },
    {
        " of some dinosaurs, like the ": null
    },
    {
        "marginocephalia": "marginocephalia"
    },
    {
        "ns, theropods and ": null
    },
    {
        "lambeosaurine": "lambeosaurinae"
    },
    {
        "s, may have been too fragile to be used for active defense, and so they were likely used for sexual or aggressive displays, though little is known about dinosaur mating and ": null
    },
    {
        "territorialism": "territory"
    },
    {
        ". Head wounds from bites suggest that theropods, at least, engaged in active aggressive confrontations.     From a behavioral standpoint, one of the most valuable dinosaur fossils was discovered in the ": null
    },
    {
        "Gobi Desert": "gobi desert"
    },
    {
        " in 1971. It included a  Velociraptor  attacking a  Protoceratops , providing evidence that dinosaurs did indeed attack each other. Additional evidence for attacking live prey is the partially healed tail of an  Edmontosaurus , a hadrosaurid dinosaur; the tail is damaged in such a way that shows the animal was bitten by a tyrannosaur but survived. ": null
    },
    {
        "Cannibalism": "cannibalism"
    },
    {
        " amongst some species of dinosaurs was confirmed by tooth marks found in ": null
    },
    {
        "Madagascar": "madagascar"
    },
    {
        " in 2003, involving the theropod  Majungasaurus .     Comparisons between the ": null
    },
    {
        "scleral rings": "sclerotic ring"
    },
    {
        " of dinosaurs and modern birds and reptiles have been used to infer daily activity patterns of dinosaurs. Although it has been suggested that most dinosaurs were active during the day, these comparisons have shown that small predatory dinosaurs such as ": null
    },
    {
        "dromaeosaurids": "dromaeosauridae"
    },
    {
        ",  Juravenator , and  Megapnosaurus  were likely ": null
    },
    {
        "nocturnal": "nocturnal"
    },
    {
        ". Large and medium-sized herbivorous and ": null
    },
    {
        "omnivorous": "omnivore"
    },
    {
        " dinosaurs such as ceratopsians, sauropodomorphs, hadrosaurids, ": null
    },
    {
        "ornithomimosaurs": "ornithomimosauria"
    },
    {
        " may have been ": null
    },
    {
        "cathemeral": "cathemeral"
    },
    {
        ", active during short intervals throughout the day, although the small ornithischian  Agilisaurus  was inferred to be ": null
    },
    {
        "diurnal": "diurnality"
    },
    {
        ".     Based on current fossil evidence from dinosaurs such as  Oryctodromeus , some ornithischian species seem to have led a partially ": null
    },
    {
        "fossorial": "fossorial"
    },
    {
        " lifestyle. Many modern birds are ": null
    },
    {
        "arboreal": "arboreal"
    },
    {
        " , and this was also true of many Mesozoic birds, especially the ": null
    },
    {
        "enantiornithine": "enantiornithine"
    },
    {
        "s.  While some early bird-like species may have already been arboreal as well  most non-avialan dinosaurs seem to have relied on land-based locomotion. A good understanding of how dinosaurs moved on the ground is key to models of dinosaur behavior; the science of ": null
    },
    {
        "biomechanics": "biomechanics"
    },
    {
        ", pioneered by ": null
    },
    {
        "Robert McNeill Alexander": "robert mcneill alexander"
    },
    {
        ", has provided significant insight in this area. For example, studies of the forces exerted by muscles and gravity on dinosaurs skeletal structure have investigated how fast dinosaurs could run, whether ": null
    },
    {
        "diplodocids": "diplodocid"
    },
    {
        "could create ": null
    },
    {
        "sonic booms": "sonic boom"
    },
    {
        "via ": null
    },
    {
        "whip": "whip"
    },
    {
        "-like tail snapping, and whether sauropods could float.          Modern birds are known to ": null
    },
    {
        "communicate": "animal communication"
    },
    {
        " using visual and auditory signals, and the wide diversity of visual display structures among fossil dinosaur groups, such as horns, frills, crests, sails and feathers, suggests that visual communication has always been important in dinosaur biology. Reconstruction of the plumage color of  Anchiornis huxleyi , suggest the importance of color in visual communication in non-avian dinosaurs. The evolution of dinosaur vocalization is less certain. Paleontologist Phil Senter suggests that non-avian dinosaurs relied mostly on visual displays and possibly non-vocal acoustic sounds like hissing, jaw grinding or clapping, splashing and wing beating . He states they were unlikely to have been capable of vocalizing since their closest relatives, crocodilians and birds, use different means to vocalize, the former via the ": null
    },
    {
        "larynx": "larynx"
    },
    {
        " and the latter through the unique ": null
    },
    {
        "syrinx": "syrinx"
    },
    {
        ", suggesting they evolved independently and their common ancestor was mute.     The earliest remains of a syrinx, which has enough mineral content for fossilization, was found in a specimen of the duck-like  Vegavis iaai  dated 69-66 million year ago, and this organ is unlikely to have existed in non-avian dinosaurs. However, in contrast to Senter, the researchers have suggested that dinosaurs could vocalize and that the syrinx-based vocal system of birds evolved from a larynx-based one, rather than the two systems evolving independently. A 2016 study suggests that dinosaurs produced closed mouth vocalizations like cooing, which occur in both crocodilians and birds as well as other reptiles. Such vocalizations evolved independently in extant archosaurs numerous times, following increases in body size. The crests of the ": null
    },
    {
        "Lambeosaurini": "lambeosaurini"
    },
    {
        " and nasal chambers of ankylosaurids have been suggested to function in ": null
    },
    {
        "vocal resonance": "vocal resonance"
    },
    {
        ", though Senter states that the presence of resonance chambers in some dinosaurs is not necessarily evidence of vocalization as modern snakes have such chambers which intensify their hisses.               All dinosaurs laid ": null
    },
    {
        "amniotic eggs": "amniote"
    },
    {
        "with hard shells made mostly of ": null
    },
    {
        "calcium carbonate": "calcium carbonate"
    },
    {
        ".  Dinosaur eggs were usually laid in a nest. Most species create somewhat elaborate nests which can be cups, domes, plates, beds scrapes, mounds, or burrows.  Some species of modern bird have no nests; the cliff-nesting ": null
    },
    {
        "common guillemot": "common murre"
    },
    {
        " lays its eggs on bare rock, and male ": null
    },
    {
        "emperor penguins": "emperor penguin"
    },
    {
        "keep eggs between their body and feet. Primitive birds and many non-avialan dinosaurs often lay eggs in communal nests, with males primarily incubating the eggs. While modern birds have only one functional ": null
    },
    {
        "oviduct": "oviduct"
    },
    {
        " and lay one egg at a time, more primitive birds and dinosaurs had two oviducts, like crocodiles. Some non-avialan dinosaurs, such as  Troodon , exhibited iterative laying, where the adult might lay a pair of eggs every one or two days, and then ensured simultaneous hatching by delaying ": null
    },
    {
        "brooding": "broodinessbroodiness in non-avian animals"
    },
    {
        " until all eggs were laid.      When laying eggs, females grow a special type of bone between the hard outer bone and the ": null
    },
    {
        "marrow": "bone marrow"
    },
    {
        " of their limbs. This medullary bone, which is rich in ": null
    },
    {
        "calcium": "calcium"
    },
    {
        ", is used to make eggshells. A discovery of features in a  Tyrannosaurus rex  skeleton provided evidence of medullary bone in extinct dinosaurs and, for the first time, allowed paleontologists to establish the sex of a fossil dinosaur specimen. Further research has found medullary bone in the carnosaur Allosaurus and the ornithopod  Tenontosaurus . Because the line of dinosaurs that includes Allosaurus and Tyrannosaurus diverged from the line that led to Tenontosaurus very early in the evolution of dinosaurs, this suggests that the production of medullary tissue is a general characteristic of all dinosaurs.        Another widespread trait among modern birds  is parental care for young after hatching. ": null
    },
    {
        "Jack Horners": "jack horner"
    },
    {
        " 1978 discovery of a  Maiasaura  nesting ground in ": null
    },
    {
        "Montana": "montana"
    },
    {
        " demonstrated that parental care continued long after birth among ornithopods. A specimen of the ": null
    },
    {
        "Mongolia": "mongolia"
    },
    {
        "n ": null
    },
    {
        "oviraptorid": "oviraptoridae"
    },
    {
        "  Citipati osmolskae  was discovered in a ": null
    },
    {
        "chicken-like brooding position": "chickenbroodiness"
    },
    {
        " in 1993, which may indicate that they had begun using an insulating layer of feathers to keep the eggs warm.  A dinosaur embryo  was found without teeth, indicating that some parental care was required to feed the young dinosaurs. Trackways have also confirmed parental behavior among ornithopods from the ": null
    },
    {
        "Isle of Skye": "isle of skye"
    },
    {
        " in northwestern ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ".     However, there is ample evidence of ": null
    },
    {
        "precociality": "precociality"
    },
    {
        " or ": null
    },
    {
        "superprecociality": "precocialitysuperprecociality"
    },
    {
        " among many dinosaur species, particularly theropods. For instance, non-": null
    },
    {
        "ornithuromorph": "euornithes"
    },
    {
        " birds have been abundantly demonstrated to have had slow growth rates, ": null
    },
    {
        "megapode": "megapode"
    },
    {
        "-like egg burying behavior and the ability to fly soon after birth.     Both Tyrannosaurus rex and  Troodon formosus  display juveniles with clear superprecociality and likely occupying different ecological niches than the adults. Superprecociality has been inferred for sauropods.           Because both modern crocodilians and birds have four-chambered hearts , it is likely that this is a trait shared by all archosaurs, including all dinosaurs. While all modern birds have high metabolisms and are warm-blooded , a vigorous debate has been ongoing since the 1960s regarding how far back in the dinosaur lineage this trait extends. Scientists disagree as to whether non-avian dinosaurs were endothermic, ": null
    },
    {
        "ectotherm": "ectotherm"
    },
    {
        "ic, or some combination of both.       After non-avian dinosaurs were discovered, paleontologists first posited that they were ectothermic. This supposed cold-bloodedness was used to imply that the ancient dinosaurs were relatively slow, sluggish organisms, even though many modern reptiles are fast and light-footed despite relying on external sources of heat to regulate their body temperature. The idea of dinosaurs as ectothermic and sluggish remained a prevalent view until ": null
    },
    {
        "Robert T. Bob Bakker": "robert t. bakker"
    },
    {
        ", an early proponent of dinosaur ": null
    },
    {
        "endothermy": "endothermy"
    },
    {
        ", published an influential paper on the topic in 1968.       Modern evidence indicates that even non-avian dinosaurs and birds thrived in cooler temperate climates, and that at least some early species must have regulated their body temperature by internal biological means . Evidence of endothermy in Mesozoic dinosaurs includes the discovery of ": null
    },
    {
        "polar dinosaurs in Australia": "south polar region of the cretaceousdinosaurs"
    },
    {
        " and ": null
    },
    {
        "Antarctica": "antarcticamesozoic era"
    },
    {
        " as well as analysis of blood-vessel structures within fossil bones that are typical of endotherms. Scientific debate continues regarding the specific ways in which dinosaur temperature regulation evolved.           In saurischian dinosaurs, higher metabolisms were supported by the evolution of the avian respiratory system, characterized by an extensive system of air sacs that extended the lungs and invaded many of the bones in the skeleton, making them hollow. Early avian-style respiratory systems with air sacs may have been capable of sustaining higher activity levels than those of mammals of similar size and build. In addition to providing a very efficient supply of oxygen, the rapid airflow would have been an effective cooling mechanism, which is essential for animals that are active but too large to get rid of all the excess heat through their skin.      Like other reptiles, dinosaurs are primarily ": null
    },
    {
        "uricotelic": "uricotelic"
    },
    {
        ", that is, their ": null
    },
    {
        "kidneys": "kidney"
    },
    {
        "extract nitrogenous wastes from their bloodstream and excrete it as ": null
    },
    {
        "uric acid": "uric acid"
    },
    {
        " instead of ": null
    },
    {
        "urea": "urea"
    },
    {
        " or ": null
    },
    {
        "ammonia": "ammonia"
    },
    {
        " via the ureters into the intestine. In most living species, uric acid is excreted along with feces as a semisolid waste.    However, at least some modern birds  can be facultatively ": null
    },
    {
        "ammonotelic": "ammonotelic"
    },
    {
        ", excreting most of the nitrogenous wastes as ammonia.  They also excrete ": null
    },
    {
        "creatine": "creatine"
    },
    {
        ", rather than ": null
    },
    {
        "creatinine": "creatinine"
    },
    {
        " like mammals.  This material, as well as the output of the intestines, emerges from the ": null
    },
    {
        "cloaca": "cloaca"
    },
    {
        ".   In addition, many species regurgitate ": null
    },
    {
        "pellets": "pellet"
    },
    {
        ", and fossil pellets that may have come from dinosaurs are known from as long ago as the Cretaceous.             The possibility that dinosaurs were the ancestors of birds was first suggested in 1868 by ": null
    },
    {
        "Thomas Henry Huxley": "thomas henry huxley"
    },
    {
        ". After the work of ": null
    },
    {
        "Gerhard Heilmann": "gerhard heilmann"
    },
    {
        " in the early 20th century, the ": null
    },
    {
        "theory": "scientific theory"
    },
    {
        " of birds as dinosaur descendants was abandoned in favor of the idea of their being descendants of generalized ": null
    },
    {
        "thecodonts": "thecodontia"
    },
    {
        ", with the key piece of evidence being the supposed lack of ": null
    },
    {
        "clavicles": "clavicle"
    },
    {
        "in dinosaurs. However, as later discoveries showed, clavicles  were not actually absent; they had been found as early as 1924 in  Oviraptor , but misidentified as an ": null
    },
    {
        "interclavicle": "interclavicle"
    },
    {
        ". In the 1970s, ": null
    },
    {
        "John Ostrom": "john ostrom"
    },
    {
        " revived the dinosaur–bird theory, which gained momentum in the coming decades with the advent of ": null
    },
    {
        "cladistic analysis": "cladistics"
    },
    {
        ", and a great increase in the discovery of small theropods and early birds. Of particular note have been the fossils of the ": null
    },
    {
        "Yixian Formation": "yixian formation"
    },
    {
        ", where a variety of theropods and early birds have been found, often with feathers of some type. Birds share over a hundred distinct anatomical features with theropod dinosaurs, which are now generally accepted to have been their closest ancient relatives. They are most closely allied with maniraptoran coelurosaurs. A minority of scientists, most notably ": null
    },
    {
        "Alan Feduccia": "alan feduccia"
    },
    {
        " and ": null
    },
    {
        "Larry Martin": "larry martin"
    },
    {
        ", have proposed other evolutionary paths, including revised versions of Heilmanns basal archosaur proposal, or that maniraptoran theropods are the ancestors of birds but themselves are not dinosaurs, only ": null
    },
    {
        "convergent": "convergent evolution"
    },
    {
        " with dinosaurs.             ": null
    },
    {
        "Feathers": "feather"
    },
    {
        "are one of the most recognizable characteristics of modern birds, and a trait that was shared by all other dinosaur groups. Based on the current distribution of fossil evidence, it appears that feathers were an ancestral dinosaurian trait, though one that may have been selectively lost in some species.  Direct fossil evidence of feathers or feather-like structures has been discovered in a diverse array of species in many non-avian dinosaur groups, both among saurischians and ornithischians. Simple, branched, feather-like structures are known from ": null
    },
    {
        "heterodontosaurids": "heterodontosauridae"
    },
    {
        ", primitive ": null
    },
    {
        "neornithischia": "neornithischia"
    },
    {
        "ns  Supplement to the online  Journal of Vertebrate Paleontology , October 2013. and theropods, and primitive ceratopsians. Evidence for true, vaned feathers similar to the flight feathers of modern birds has been found only in the theropod subgroup Maniraptora, which includes ": null
    },
    {
        "oviraptorosaur": "oviraptorosauria"
    },
    {
        "s, troodontids, dromaeosaurids, and birds. Feather-like structures known as ": null
    },
    {
        "pycnofibres": "pterosaurpycnofibers"
    },
    {
        "have also been found in pterosaurs,  suggesting the possibility that feather-like filaments may have been common in the ": null
    },
    {
        "bird lineage": "avemetatarsalia"
    },
    {
        " and evolved before the appearance of dinosaurs themselves. Research into the genetics of ": null
    },
    {
        "American alligators": "american alligator"
    },
    {
        "has also revealed that ": null
    },
    {
        "crocodylian": "crocodilia"
    },
    {
        "scutes": "scute"
    },
    {
        "do possess feather-keratins during embryonic development, but these keratins are not expressed by the animals before hatching.       Archaeopteryx  was the first fossil found that revealed a potential connection between dinosaurs and birds. It is considered a ": null
    },
    {
        "transitional fossil": "transitional fossil"
    },
    {
        ", in that it displays features of both groups. Brought to light just two years after ": null
    },
    {
        "Charles Darwins": "charles darwin"
    },
    {
        "seminal  On the Origin of Species  , its discovery spurred the nascent debate between proponents of ": null
    },
    {
        "evolutionary biology": "evolutionary biology"
    },
    {
        " and ": null
    },
    {
        "creationism": "creationism"
    },
    {
        ". This early bird is so dinosaur-like that, without a clear impression of feathers in the surrounding rock, at least one specimen was mistaken for  Compsognathus . Since the 1990s, a number of additional feathered dinosaurs have been found, providing even stronger evidence of the close relationship between dinosaurs and modern birds. Most of these specimens were unearthed in the ": null
    },
    {
        "lagerstätte": "lagerstätten"
    },
    {
        " of the Yixian Formation, ": null
    },
    {
        "Liaoning": "liaoning"
    },
    {
        ", northeastern China, which was part of an island continent during the Cretaceous. Though feathers have been found in only a few locations, it is possible that non-avian dinosaurs elsewhere in the world were also feathered. The lack of widespread fossil evidence for feathered non-avian dinosaurs may be because delicate features like skin and feathers are not often preserved by fossilization and thus are absent from the fossil record.      The description of feathered dinosaurs has not been without controversy; perhaps the most vocal critics have been Alan Feduccia and Theagarten Lingham-Soliar, who have proposed that some purported feather-like fossils are the result of the decomposition of collagenous fiber that underlaid the dinosaurs skin, and that maniraptoran dinosaurs with vaned feathers were not actually dinosaurs, but ": null
    },
    {
        "convergent": "convergent evolution"
    },
    {
        " with dinosaurs. However, their views have for the most part not been accepted by other researchers, to the point that the scientific nature of Feduccias proposals has been questioned.     In 2016, it was reported that a dinosaur tail with feathers had been found enclosed in ": null
    },
    {
        "amber": "amber"
    },
    {
        ". The fossil is about 99  million years old.         Because feathers are often associated with birds, feathered dinosaurs are often touted as the ": null
    },
    {
        "missing link": "transitional fossil"
    },
    {
        " between birds and dinosaurs. However, the multiple skeletal features also shared by the two groups represent another important line of evidence for paleontologists. Areas of the skeleton with important similarities include the neck, pubis, ": null
    },
    {
        "wrist": "wrist"
    },
    {
        " , arm and ": null
    },
    {
        "pectoral girdle": "shoulder girdle"
    },
    {
        ", furcula , and ": null
    },
    {
        "breast bone": "keel"
    },
    {
        ". Comparison of bird and dinosaur skeletons through cladistic analysis strengthens the case for the link.           Large meat-eating dinosaurs had a complex system of air sacs similar to those found in modern birds, according to a 2005 investigation led by Patrick M. OConnor. The lungs of theropod dinosaurs likely pumped air into hollow sacs in their skeletons, as is the case in birds. What was once formally considered unique to birds was present in some form in the ancestors of birds , OConnor said.  In 2008, scientists described  Aerosteon riocoloradensis , the skeleton of which supplies the strongest evidence to date of a dinosaur with a bird-like breathing system. ": null
    },
    {
        "CT scanning": "ct scan"
    },
    {
        " of ": null
    }
]