[
    {
        "In ": null
    },
    {
        "abstract algebra": "abstract algebra"
    },
    {
        ", the direct sum is a construction which combines several ": null
    },
    {
        "modules": "module"
    },
    {
        " into a new, larger module. The direct sum of modules is the smallest module which contains the given modules as submodules with no unnecessary constraints, making it an example of a ": null
    },
    {
        "coproduct": "coproduct"
    },
    {
        ". Contrast with the ": null
    },
    {
        "direct product": "direct product"
    },
    {
        ", which is the ": null
    },
    {
        "dual": "duality"
    },
    {
        " notion.     The most familiar examples of this construction occur when considering ": null
    },
    {
        "vector space": "vector space"
    },
    {
        "s  and ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        "s . The construction may also be extended to cover ": null
    },
    {
        "Banach space": "banach space"
    },
    {
        "s and ": null
    },
    {
        "Hilbert space": "hilbert space"
    },
    {
        "s.         We give the construction first in these two cases, under the assumption that we have only two objects. Then we generalise to an arbitrary family of arbitrary modules. The key elements of the general construction are more clearly identified by considering these two cases in depth.         Suppose V and W are ": null
    },
    {
        "vector space": "vector space"
    },
    {
        "s over the ": null
    },
    {
        "field": "field"
    },
    {
        " K. The ": null
    },
    {
        "cartesian product": "cartesian product"
    },
    {
        " V × W can be given the structure of a vector space over K  by defining the operations componentwise:      +     α       for v, v 42 , v 42 ∈ V, w, w 42 , w 42 ∈ W, and α ∈ K.     The resulting vector space is called the direct sum of V and W and is usually denoted by a plus symbol inside a circle:     : V \\oplus W     It is customary to write the elements of an ordered sum not as ordered pairs , but as a sum v + w.     The subspace V × of V ⊕ W is isomorphic to V and is often identified with V; similarly for × W and W.  With this identification, every element of V ⊕ W can be written in one and only one way as the sum of an element of V and an element of W. The ": null
    },
    {
        "dimension": "dimension of a vector space"
    },
    {
        " of V ⊕ W is equal to the sum of the dimensions of V and W. One elementary use is the reconstruction   of a finite vector space from any subspace W and its orthogonal complement:     : \\mathbb^n W \\oplus W^     This construction readily generalises to any ": null
    },
    {
        "finite": "finite set"
    },
    {
        " number of vector spaces.         For ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        "s G and H which are written additively, the ": null
    },
    {
        "direct product": "direct product"
    },
    {
        " of G and H is also called a direct sum . Thus the ": null
    },
    {
        "cartesian product": "cartesian product"
    },
    {
        " G × H is equipped with the structure of an abelian group by defining the operations componentwise:      +       for g 42 , g 42 in G, and h 42 , h 42 in H.     Integral multiples are similarly defined componentwise by     n      for g in G, h in H, and n an ": null
    },
    {
        "integer": "integer"
    },
    {
        ". This parallels the extension of the scalar product of vector spaces to the direct sum above.     The resulting abelian group is called the direct sum of G and H and is usually denoted by a plus symbol inside a circle:     : G \\oplus H     It is customary to write the elements of an ordered sum not as ordered pairs , but as a sum g + h.     The subgroup G × of G ⊕ H is isomorphic to G and is often identified with G; similarly for × H and H.  With this identification, it is true that every element of G ⊕ H can be written in one and only one way as the sum of an element of G and an element of H. The ": null
    },
    {
        "rank": "rank of an abelian group"
    },
    {
        " of G ⊕ H is equal to the sum of the ranks of G and H.     This construction readily generalises to any ": null
    },
    {
        "finite": "finite set"
    },
    {
        " number of abelian groups.         One should notice a clear similarity between the definitions of the direct sum of two vector spaces and of two abelian groups. In fact, each is a special case of the construction of the direct sum of two ": null
    },
    {
        "modules": "module"
    },
    {
        ". Additionally, by modifying the definition one can accommodate the direct sum of an infinite family of modules. The precise definition is as follows .     Let R be a ring, and  a ": null
    },
    {
        "family": "indexed family"
    },
    {
        " of left R-modules indexed by the ": null
    },
    {
        "set": "set"
    },
    {
        " I. The direct sum of  is then defined to be the set of all sequences where \\alpha_i \\in M_i and \\alpha_i 42 for ": null
    },
    {
        "cofinitely many": "cofinitely many"
    },
    {
        " indices i.      It can also be defined as ": null
    },
    {
        "functions": "function"
    },
    {
        " α from I to the ": null
    },
    {
        "disjoint union": "disjoint union"
    },
    {
        " of the modules M i such that α  ∈  M i for all i ∈ I and α 42 for ": null
    },
    {
        "cofinitely many": "cofinitely many"
    },
    {
        " indices i. These functions can equivalently be regarded as ": null
    },
    {
        "finitely supported": "compact support"
    },
    {
        " sections of the ": null
    },
    {
        "fiber bundle": "fiber bundle"
    },
    {
        " over the index set I, with the fiber over i \\in I being M_i .     This set inherits the module structure via component-wise addition and scalar multiplication. Explicitly, two such sequences α and β can be added by writing _i \\alpha_i + \\beta_i for all i , and such a function can be multiplied with an element r from R by defining r_i _i for all i. In this way, the direct sum becomes a left R-module, and it is denoted     : \\bigoplus_ M_i.     It is customary to write the sequence as a sum \\Sigma \\alpha_i . Sometimes a primed summation \\Sigma \\alpha_i is used to indicate that ": null
    },
    {
        "cofinitely many": "cofinitely many"
    },
    {
        " of the terms are zero.         The direct sum is a ": null
    },
    {
        "submodule": "submodule"
    },
    {
        " of the ": null
    },
    {
        "direct product": "direct product"
    },
    {
        " of the modules M i . The direct product is the set of all functions α from I to the disjoint union of the modules M i with α∈M i , but not necessarily vanishing for all but finitely many i. If the index set I is finite, then the direct sum and the direct product are equal.   Each of the modules M i may be identified with the submodule of the direct sum consisting of those functions which vanish on all indices different from i. With these identifications, every element x of the direct sum can be written in one and only one way as a sum of finitely many elements from the modules M i .   If the M i are actually vector spaces, then the dimension of the direct sum is equal to the sum of the dimensions of the M i . The same is true for the ": null
    },
    {
        "rank of abelian groups": "rank of an abelian group"
    },
    {
        " and the ": null
    },
    {
        "length of modules": "length of a module"
    },
    {
        ".   Every vector space over the field K is isomorphic to a direct sum of sufficiently many copies of K, so in a sense only these direct sums have to be considered. This is not true for modules over arbitrary rings.   The ": null
    },
    {
        "tensor product": "tensor product"
    },
    {
        " distributes over direct sums in the following sense: if N is some right R-module, then the direct sum of the tensor products of N with M i is naturally isomorphic to the tensor product of N with the direct sum of the M i .   Direct sums are ": null
    },
    {
        "commutative": "commutative"
    },
    {
        " and ": null
    },
    {
        "associative": "associative"
    },
    {
        " , meaning that it doesnt matter in which order one forms the direct sum.   The group of R-linear homomorphisms from the direct sum to some left R-module L is naturally isomorphic to the ": null
    },
    {
        "direct product": "direct product"
    },
    {
        " of the sets of R-linear homomorphisms from M i to L:   :: \\operatorname_R\\biggl \\cong \\prod_\\operatorname_R\\left.   :Indeed, there is clearly a homomorphism τ from the left hand side to the right hand side, where τ is the R-linear homomorphism sending x∈M i to θ . The inverse of the homomorphism τ is defined by   : \\tau^ \\sum_ \\beta   :for any α in the direct sum of the modules M i . The key point is that the definition of τ −42 makes sense because α is zero for all but finitely many i, and so the sum is finite.   :In particular, the ": null
    },
    {
        "dual vector space": "dual space"
    },
    {
        " of a direct sum of vector spaces is isomorphic to the ": null
    },
    {
        "direct product": "direct product"
    },
    {
        " of the duals of those spaces.   The finite direct sum of modules is a ": null
    },
    {
        "biproduct": "biproduct"
    },
    {
        ": If   :: p_k: A_42 \\oplus \\cdots \\oplus A_n \\to A_k   :are the canonical projection mappings and   :: i_k: A_k \\mapsto A_42 \\oplus \\cdots \\oplus A_n   :are the inclusion mappings, then   :: i_42 \\circ p_42 + \\cdots + i_n \\circ p_n   :equals the identity morphism of A 42 ⊕ ··· ⊕ A n , and   :: p_k \\circ i_l   :is the identity morphism of A k in the case lk, and is the zero map otherwise.             Suppose M is some R-module, and M i is a ": null
    },
    {
        "submodule": "submodule"
    },
    {
        " of M for every i in I. If every x in M can be written in one and only one way as a sum of finitely many elements of the M i , then we say that M is the internal direct sum of the submodules M i . In this case, M is naturally isomorphic to the direct sum of the M i as defined above .     A submodule N of M is a direct summand of M if there exists some other submodule N′ of M such that M is the internal direct sum of N and N′. In this case, N and N′ are complementary submodules.       In the language of ": null
    },
    {
        "category theory": "category theory"
    },
    {
        ", the direct sum is a ": null
    },
    {
        "coproduct": "coproduct"
    },
    {
        " and hence a ": null
    },
    {
        "colimit": "limit"
    },
    {
        " in the category of left R-modules, which means that it is characterized by the following ": null
    },
    {
        "universal property": "universal property"
    },
    {
        ". For every i in I, consider the natural embedding     : j_i : M_i \\rightarrow \\bigoplus_ M_k     which sends the elements of M i to those functions which are zero for all arguments but i. If f i : M i → M are arbitrary R-linear maps for every i, then there exists precisely one R-linear map     : f : \\bigoplus_ M_i \\rightarrow M     such that f o j i  f i for all i.       The direct sum gives a collection of objects the structure of a commutative ": null
    },
    {
        "monoid": "monoid"
    },
    {
        ", in that the addition of objects is defined, but not subtraction. In fact, subtraction can be defined, and every commutative monoid can be extended to an ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        ". This extension is known as the ": null
    },
    {
        "Grothendieck group": "grothendieck group"
    },
    {
        ". The extension is done by defining equivalence classes of pairs of objects, which allows certain pairs to be treated as inverses. The construction, detailed in the article on the Grothendieck group, is universal , in that it has the ": null
    },
    {
        "universal property": "universal property"
    },
    {
        " of being unique, and homomorphic to any other embedding of an abelian monoid in an abelian group.         If the modules we are considering carry some additional structure , then the direct sum of the modules can often be made to carry this additional structure, as well. In this case, we obtain the ": null
    },
    {
        "coproduct": "coproduct"
    },
    {
        " in the appropriate ": null
    },
    {
        "category": "category"
    },
    {
        " of all objects carrying the additional structure. Two prominent examples occur for ": null
    },
    {
        "Banach space": "banach space"
    },
    {
        "s and ": null
    },
    {
        "Hilbert space": "hilbert space"
    },
    {
        "s.     In some classical texts, the notion of direct sum of ": null
    },
    {
        "algebras over a field": "algebra over a field"
    },
    {
        " is also introduced. This construction, however, does not provide a coproduct in the category of algebras, but a direct product .       A direct sum of ": null
    },
    {
        "algebras": "algebra over a field"
    },
    {
        " X and Y is the direct sum as vector spaces, with product   : .   Consider these classical examples:   : \\mathbf \\oplus \\mathbf is ": null
    },
    {
        "ring isomorphic": "ring isomorphism"
    },
    {
        " to ": null
    },
    {
        "split-complex number": "split-complex number"
    },
    {
        "s, also used in ": null
    },
    {
        "interval analysis": "interval analysis"
    },
    {
        ".   : \\mathbf \\oplus \\mathbf is the algebra of ": null
    },
    {
        "tessarine": "tessarine"
    },
    {
        "s introduced by ": null
    },
    {
        "James Cockle": "james cockle"
    },
    {
        " in 42   : \\mathbf \\oplus \\mathbf , called the ": null
    },
    {
        "split-biquaternion": "split-biquaternion"
    },
    {
        "s, was introduced by ": null
    },
    {
        "William Kingdon Clifford": "william kingdon clifford"
    },
    {
        " in 42   ": null
    },
    {
        "Joseph Wedderburn": "joseph wedderburn"
    },
    {
        " exploited the concept of a direct sum of algebras in his classification of ": null
    },
    {
        "hypercomplex number": "hypercomplex number"
    },
    {
        "s. See his Lectures on Matrices , page 42   Wedderburn makes clear the distinction between a direct sum and a direct product of algebras: For the direct sum the field of scalars acts jointly on both parts: \\lambda \\lambda x \\oplus \\lambda y while for the direct product a scalar factor may be collected alternately with the parts, but not both: \\lambda \\! .   ": null
    },
    {
        "Ian R. Porteous": "ian r. porteous"
    },
    {
        " uses the three direct sums above, denoting them ^42 R,\\ ^42 C,\\ ^42 H \\! , as rings of scalars in his analysis of Clifford Algebras and the Classical Groups .     The construction described above, as well as Wedderburns use of the terms direct sum and direct product follow a different convention from the one in ": null
    },
    {
        "category theory": "category theory"
    },
    {
        ". In categorical terms, Wedderburns direct sum is a ": null
    },
    {
        "categorical product": "product"
    },
    {
        ", whilst Wedderburns direct product is a ": null
    },
    {
        "coproduct ": "coproduct"
    },
    {
        ", which actually corresponds to the ": null
    },
    {
        "tensor product of algebras": "tensor product of algebras"
    },
    {
        ".          A composition algebra  is an ": null
    },
    {
        "algebra over a field": "algebra over a field"
    },
    {
        " A, an ": null
    },
    {
        "involution": "involution"
    },
    {
        " x xx,yzℂ, z 42 x,yii \\in IiX_i": null
    }
]