[
    {
        "Dirksland  is a town and former municipality on ": null
    },
    {
        "Goeree-Overflakkee": "goeree-overflakkee"
    },
    {
        " Island in the western ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", in the province of ": null
    },
    {
        "South Holland": "south holland"
    },
    {
        ". The former municipality had a population of about 42 in 42 and covered an area of about 42  km² of which about 42  km² was water. The former municipality of Dirksland also included the communities of ": null
    },
    {
        "Herkingen": "herkingen"
    },
    {
        ", and ": null
    },
    {
        "Melissant": "melissant"
    },
    {
        ". On January 42 42 Dirksland merged with ": null
    },
    {
        "Goedereede": "goedereede"
    },
    {
        ", ": null
    },
    {
        "Middelharnis": "middelharnis"
    },
    {
        ", and ": null
    },
    {
        "Oostflakkee": "oostflakkee"
    },
    {
        " into the new municipality of Goeree-Overflakkee.     The ": null
    },
    {
        "North Sea flood of 42": "north sea flood of 1953"
    },
    {
        " did not have as much of a destructive effect on Dirksland as the rest of the island, because Dirksland is somewhat higher. Dirksland is the largest of the three communities within the former municipality and also has the only hospital on Goeree-Overflakkee island. The Van Weel-Bethesda Hospital is one of the smallest in the country, but has an excellent reputation. Dirksland can be recognized from a distance by the tallest water tower in the country. The towns are agriculturally focused and have several campgrounds for people who prefer a bit of rest over the busy ": null
    },
    {
        "Ouddorp": "ouddorp"
    },
    {
        " area but still want to be close to shore. Dirksland has an inland harbor with a newly restored gate complex.       Image:Dirksland Kopergravure.jpg|Engraving of Dirksland, ca. 42   Image:Netherlands-Dirksland-watertower.jpg|The ": null
    },
    {
        "watertower": "watertower"
    },
    {
        " Windmill": "windmill"
    },
    {
        " De Eendracht in Dirksland       Herkingen lies on the south side of the island and borders the ": null
    },
    {
        "Grevelingenmeer": "grevelingenmeer"
    },
    {
        ", which is a saltwater lake that has been disconnected directly from the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " by the ": null
    },
    {
        "Brouwersdam": "brouwersdam"
    },
    {
        ", but still connects to the ": null
    },
    {
        "Oosterschelde": "oosterschelde"
    },
    {
        " which is saltwater. The Grevelingenmeer has quite a large size yachting marina and is a large water sports area with the main recreational areas on ": null
    },
    {
        "Schouwen-Duiveland": "schouwen-duiveland"
    },
    {
        ". The town of Herkingen currently hosts several of the largest modern windmills in the country.                             ": null
    }
]