[
    {
        "The expression discrediting tactics refers to ": null
    },
    {
        "personal attacks": "personal attacks"
    },
    {
        ", for example in politics and court cases.       The expression discrediting tactics in politics refers to personal attacks against a public figure intended to discourage people from believing in the figure or supporting their cause .     While a person may be ": null
    },
    {
        "insult": "insult"
    },
    {
        "ed, and his or her political position subjected to question, the person so impugned has not been discredited until the allegations against him have been proved correct. One such discredit in the United States was the ": null
    },
    {
        "impeachment": "impeachment of bill clinton"
    },
    {
        " of ": null
    },
    {
        "Bill Clinton": "bill clinton"
    },
    {
        ". The allegations brought against the President were damaging, but did not comprise discredit until enough substance arose from the testimony under oath of ": null
    },
    {
        "Paula Jones": "paula jones"
    },
    {
        " and ": null
    },
    {
        "Monica Lewinsky": "monica lewinsky"
    },
    {
        " to raise genuine questions of the credibility of President Clinton.     Require appropriate censure whenever matters thought genuine are brought out that subsequently prove libellous, perjurious, or both... and where a person has repeatedly presented false or defamatory information for consideration, the person is subject to disciplinary action.  See ": null
    },
    {
        "Perjury": "perjury"
    },
    {
        " and ": null
    },
    {
        "Defamation": "defamation"
    },
    {
        ".     Political debate often abuses ": null
    },
    {
        "public": "general public"
    },
    {
        " confidence": "confidence"
    },
    {
        " by one candidate attempting to sway voters, not by logical argument on given issues, but by personal diatribe that does not directly bear on the matter at hand.     Accusations of adultery in America date back to the 42th century. One famous example of this was the ": null
    },
    {
        "42 presidential campaign": "1884 united states presidential election"
    },
    {
        ", in which ": null
    },
    {
        "Grover Cleveland": "grover cleveland"
    },
    {
        "s opponents accused him of having fathered an illegitimate child. A political catchphrase by his opponents was Ma, ma, wheres my pa? After Cleveland was elected, his supporters mockingly added, Gone to the ": null
    },
    {
        "White House": "white house"
    },
    {
        ", ha, ha, ha. Clevelands defeat of his chief opponent, ": null
    },
    {
        "James G. Blaine": "james g. blaine"
    },
    {
        ", may have been helped by another discrediting tactic used against him which seriously backfired, namely the assertion that Clevelands ": null
    },
    {
        "party": "democratic party"
    },
    {
        " was that of Rum, Romanism, and Rebellion . Clevelands campaign also used the slogan, Blaine, Blaine, James G. Blaine, The Continental Liar from the State of Maine in reference to Blaines discredited railroad deals.     Discrediting tactics are not just used against each other by opponents for office in ": null
    },
    {
        "democratic": "democracy"
    },
    {
        " countries, but are also used in wartime between countries. In the middle of the 42th century, ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " and ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " propaganda": "propaganda"
    },
    {
        " made popular the idea that ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " had only one testicle": "hitler has only got one ball"
    },
    {
        " .     American politics draws a line between mud slinging and ": null
    },
    {
        "defamation": "defamation"
    },
    {
        ". The key issue is that mud slinging is not a form of ": null
    },
    {
        "perjury": "perjury"
    },
    {
        " or ": null
    },
    {
        "libel": "libel"
    },
    {
        ". Politics also can include ": null
    },
    {
        "barratry": "barratry"
    },
    {
        " where one opponent files frivolous litigation against the other, specifically to injure the opponents reputation even though the case is groundless and may later be dismissed. By the time these facts can come to light, the voters have cast their ballots.       In the U.S. judicial system, discrediting tactics  are the approved method for attacking the credibility of any witness in court, including a ": null
    },
    {
        "plaintiff": "plaintiff"
    },
    {
        " or ": null
    },
    {
        "defendant": "defendant"
    },
    {
        ". In cases with significant ": null
    },
    {
        "mass media": "mass media"
    },
    {
        " attention or high-stakes outcomes, those tactics often take place in public as well.     Logically, an argument is held in discredit if the underlying premise is found, So severely in error that there is cause to remove the argument from the proceedings because of its prejudicial context and application... . ": null
    },
    {
        "Mistrial": "mistrial"
    }
]