[
    {
        "There are a number of lines of defence against ": null
    },
    {
        "pest": "pest"
    },
    {
        "s and ": null
    },
    {
        "diseases": "plant pathogen"
    },
    {
        " in the ": null
    },
    {
        "orchard": "orchard"
    },
    {
        ", principal among these being the practice of good husbandry, creating healthy ": null
    },
    {
        "soil": "soil"
    },
    {
        " and ensuring high standards of garden hygiene. But no matter how diverse and healthy the garden ": null
    },
    {
        "eco-system": "eco-system"
    },
    {
        " may be, there will always be a degree of disease and pest presence. In many ways, some level of ": null
    },
    {
        "pathogen": "pathogen"
    },
    {
        " population in the garden can be not only acceptable but desirable as they are indicative of a generally healthful and diverse environment, and add to the overall robustness of the system as an immunity to such detrimental influences will build up, particularly in a balanced ": null
    },
    {
        "polycultural": "polyculture"
    },
    {
        " regime. Indeed, most of the plants we grow will tend to be selected because they are trouble free, and those that are more susceptible to attack will have fallen by the wayside over time. However, most farmers find it unacceptable that the food crops they grow are damaged by pests.     For these crops there has been considerable research and selective breeding carried out in order to find ": null
    },
    {
        "cultivar": "cultivar"
    },
    {
        "s that are resistant or immune to pest and disease damage. Breeding for ": null
    },
    {
        "plant disease resistance": "plant disease resistance"
    },
    {
        " generally has involved finding suitable ": null
    },
    {
        "genetic": "genetics"
    },
    {
        " material amongst existing stocks or in the wild, which is then incorporated into commercial varieties.          In the case of ": null
    },
    {
        "apples": "apple"
    },
    {
        ", in which research is being carried out in order to develop resistance to diseases such as ": null
    },
    {
        "apple scab": "apple scab"
    },
    {
        " , ": null
    },
    {
        "powdery mildew": "powdery mildew"
    },
    {
        " , orchard ": null
    },
    {
        "fireblight": "fireblight"
    },
    {
        " , ": null
    },
    {
        "woolly apple aphid": "woolly apple aphid"
    },
    {
        "  and ": null
    },
    {
        "collar rot": "collar rot"
    },
    {
        " , the main sources of resistant material used in breeding programmes such as those being run by ": null
    },
    {
        "East Malling Research Station": "east malling research station"
    },
    {
        " in England or ": null
    },
    {
        "Hortresearch": "hortresearch"
    },
    {
        " in New Zealand are major gene resistances derived from ": null
    },
    {
        "crab-apple": "crab-apple"
    },
    {
        "s. The Vf gene for black spot resistance is derived from the ornamental crab-apple species  Malus floribunda . Most black spot resistant cultivars developed around the world carry this gene, but there are some selections that carry the Vr or Vm gene. Major gene resistances to powdery mildew are derived from M. robusta and M. zumi , and the apple cultivar  Northern Spy  has a long-standing reputation for its major gene resistance to woolly apple aphid. Since early this century this resistance has been used to develop woolly aphid resistant rootstocks such as ": null
    },
    {
        "MM.42": "propagating fruit trees"
    },
    {
        " and M.42 Much later it was shown that the cultivar was also very resistant to collar rot and a useful breeding parent for this resistance.       Some plants can tolerate the presence of large numbers of insects without being severely affected. This is not very satisfactory however as insects will still cause damage, and in fact further breeding and population expansion of the pest species is supported. Other varieties are less attractive to pests, but this can be difficult to sustain or demonstrate.   The most valuable form of resistance is where the pest cannot survive as well on one variety as on another. In some cases this can actually make the plants immune to attack, as is the case with the ": null
    },
    {
        "lettuce": "lettuce"
    },
    {
        "s Avoncrisp and Avondefiance which were bred at the ": null
    },
    {
        "Institute of Horticultural Research": "horticulture research international"
    },
    {
        ", ": null
    },
    {
        "Wellesbourne": "wellesbourne"
    },
    {
        " during the 42s, which are fully resistant to ": null
    },
    {
        "lettuce root aphid": "lettuce root aphid"
    },
    {
        " .       Sometimes however there can be a trade-off, for those varieties which have increased immunity or resistance may be lacking in other qualities such as flavour, yield or quality. ": null
    },
    {
        "Celery": "celery"
    },
    {
        " resistant to the ": null
    },
    {
        "Fusarium": "fusarium"
    },
    {
        " fungus  may not succumb to this disease, but may also be unacceptably short, ribby and low yielding.   Further, a cultivar that is resistant to one disease may be more susceptible to another that is equally important. A lettuce cultivar that is resistant to ": null
    },
    {
        "mosaic virus": "mosaic virus"
    },
    {
        " may be sensitive to ": null
    },
    {
        "corky root disease": "corky root disease"
    },
    {
        ", whilst another that resists corky root may be vulnerable to ": null
    },
    {
        "downy mildew": "downy mildew"
    },
    {
        " .   Another drawback to resistance is that depending on the host pathogen system, resistance is sometimes not long lasting as new pathogen strains quickly develop, and further research and breeding is constantly needed.       Resistant varieties are not available for all crops. For several of the most damaging plant diseases, such as ": null
    },
    {
        "Potato blight": "potato blight"
    },
    {
        "  and ": null
    },
    {
        "white rot": "white rot"
    },
    {
        "  of the ": null
    },
    {
        "Allium": "allium"
    },
    {
        " family, no acceptable resistant cultivars are yet available. In addition, commercial seed companies and plant breeders rarely invest resources into developing resistant cultivars for more minor or speciality crops, which often tend to be those of greater interest to the organic grower.     In general it is probably fair to say that resistance will not fully guarantee total ": null
    },
    {
        "crop protection": "crop protection"
    },
    {
        ", but choosing resistant varieties should rather be considered as a part of an overall ": null
    },
    {
        "Integrated pest management": "integrated pest management"
    },
    {
        " strategy, especially against ": null
    },
    {
        "virus": "virus"
    },
    {
        " diseases. In particular they can be especially useful where the threat from specific pests and diseases is high.       The table below illustrates a number of pest and disease resistant vegetable crop varieties, although should not be considered comprehensive.     ": null
    }
]