[
    {
        "Distributed switching is an architecture in which multiple ": null
    },
    {
        "processor": "central processing unit"
    },
    {
        "-controlled switching units are distributed. There is often a hierarchy of switching elements, with a centralized ": null
    },
    {
        "host": "server"
    },
    {
        " switch": "stored program control exchange"
    },
    {
        " and with remote switches located close to concentrations of users.       Distributed switching is often used in ": null
    },
    {
        "telephone network": "telephone network"
    },
    {
        "s, though it is often called host-remote switching.     In rural areas, population centers tend to be too small for economical deployment of a full-featured dedicated ": null
    },
    {
        "telephone exchange": "telephone exchange"
    },
    {
        ", and distances between these centers make ": null
    },
    {
        "transmission": "transmission"
    },
    {
        " costs relatively high. Normal telephone traffic patterns show that most calling is done between people in a ": null
    },
    {
        "community of interest": "community of interest"
    },
    {
        ", in this case a geographical one: the population center. Use of distributed switching allows for the majority of calls that are local to that population center to be switched there without needing to be transported to and from the host switch.     The host switch provides connectivity between the remote switches and to the larger network, and the host may also directly handle some rare and complex call types  that the remote itself is not equipped to handle. Host switches also perform ": null
    },
    {
        "OAM & P": "oam & p"
    },
    {
        " functions, including billing, for the entire cluster of the host and its remote switches.     A key capability of a remote switch is the ability to act in ": null
    },
    {
        "emergency standalone": "emergency standalone"
    },
    {
        " mode, wherein local calls can still be placed even in the event that the connection between that remote and the host has been lost. In this mode, only local calling is available anyway, so the billing capability of the host switch is not required. ESA is increasingly available on ": null
    },
    {
        "digital loop carrier": "digital loop carrier"
    },
    {
        " platforms as well as on purpose-built remote switches in order to improve the scope of their utility.       Many data-centric telecommunications platforms such as ": null
    },
    {
        "router": "router"
    },
    {
        "s and ": null
    },
    {
        "Ethernet": "ethernet"
    },
    {
        " switches utilize distributed switching on separate cards within an equipment ": null
    },
    {
        "chassis": "chassis"
    },
    {
        ". Even when this is used, it is common to have a centralized ": null
    },
    {
        "switching fabric": "switching fabric"
    },
    {
        " to interconnect the distributed switches. This architecture has become less common as ": null
    },
    {
        "backplane": "backplane"
    },
    {
        " bus": "computer bus"
    }
]