[
    {
        "           Do Not Adjust Your Set  was a British television series produced originally by ": null
    },
    {
        "Rediffusion, London": "associated-rediffusion"
    },
    {
        ", then, by the fledgling ": null
    },
    {
        "Thames Television": "thames television"
    },
    {
        " for British commercial television channel ": null
    },
    {
        "ITV": "itv"
    },
    {
        " from 26 December 1967 to 14 May 1969. The show took its name from the message which was displayed when there was a problem with transmission.     It included early appearances of ": null
    },
    {
        "Denise Coffey": "denise coffey"
    },
    {
        ", ": null
    },
    {
        "David Jason": "david jason"
    },
    {
        ", ": null
    },
    {
        "Eric Idle": "eric idle"
    },
    {
        ", ": null
    },
    {
        "Terry Jones": "terry jones"
    },
    {
        ", and ": null
    },
    {
        "Michael Palin": "michael palin"
    },
    {
        "; the last three became members of the ": null
    },
    {
        "Monty Python": "monty python"
    },
    {
        " comedy troupe soon afterwards. Although originally conceived as a childrens programme, it quickly acquired a following amongst many adults, including future Pythons ": null
    },
    {
        "John Cleese": "john cleese"
    },
    {
        " and ": null
    },
    {
        "Graham Chapman": "graham chapman"
    },
    {
        " .     Satirical comedy/art/pop group The ": null
    },
    {
        "Bonzo Dog Doo-Dah Band": "bonzo dog doo-dah band"
    },
    {
        " also performed a song or two in each programme and frequently appeared as extras in sketches. The programme itself comprised a series of frequently satirical sketches, often presented in a bizarre, surreal and disjointed style which anticipates  Monty Pythons Flying Circus , which followed five months after the last episode of DNAYS. Strange animations between sketches were crafted for the final episodes by the then-unknown ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        ", who soon graduated to Python with Palin, Jones and Idle – part of Gilliams Christmas cards animation reappeared there in the Joy to the World segment.     One long-running feature of the show was  Captain Fantastic , a ": null
    },
    {
        "superhero": "superhero"
    },
    {
        " parody featuring David Jason in improbable and even macabre adventures against ": null
    },
    {
        "villainess": "villainess"
    },
    {
        " Mrs. Black . These segments were shot entirely on film, on location in London. The feature was so popular with the young audience that after DNAYS itself ended Captain Fantastic briefly continued in its own right.     In 1968, DNAYS won an international award, the Prix Jeunesse, in Munich.       Episodes produced by ": null
    },
    {
        "Associated-Rediffusion": "associated-rediffusion"
    },
    {
        ":   The very first episode, an introductory special meant for Boxing Day 1967, was accidentally switched with the first regular episode in all regions except for London.      Thirteen regular c.25 minute episodes broadcast between 26 December 1967 to 28 March 1968, Thursdays at 17:25.   Untitled special c.25 minutes broadcast 29 July 1968, Monday at 19:00.   Episodes produced by ": null
    },
    {
        "Thames": "thames"
    },
    {
        ":   Do not adjust your stocking , 40 minutes broadcast 25 December 1968, Wednesday 16:10. For a 1986 repeat, David Jason demanded to be removed from the show, thus creating an abridged version of 25 minutes.   Series two: 13 episodes of c.25 minutes broadcast between 19 February 1969 to 14 May 1969, Wednesdays at 17:20.   In common with another important Monty Python predecessor,  At Last the 1948 Show , many episodes were ": null
    },
    {
        "wiped": "wiping"
    },
    {
        ".       Nine of the 14 episodes from the first series were released on DVD in the UK and the US in August 2005. Both releases use the same ": null
    },
    {
        "NTSC": "ntsc"
    },
    {
        " Region 0 discs made from ": null
    },
    {
        "telerecordings": "telerecording"
    },
    {
        "of the original videotapes.     The episodes are renumbered 1 to 9, although, in fact they are episodes 1-2, 5-6, and 9-13 . The sole surviving episode from series 2 and Do Not Adjust Your Stocking were not included.  The 4th episode of the first series was only discovered afterwards - it survives because the show was entered for the Prix de Jeunesse award, so a copy was sent to the jury - and does not appear on the DVD either.  The surviving copy is on a semi-professional videotape copy made in the Thames era, and is thus the only series 1 episode with magnetic rather than optical sound quality.     The packaging further implies that Gilliams animations appear in these episodes, but they do not. Gilliam does appear as one of the additional writers in the credits for episodes three and four. The Bonzo Dog Doo Dah Band are seen playing their song ": null
    },
    {
        "Death Cab for Cutie": "death cab for cutie"
    },
    {
        "  on the DVD, Episode 7.     The ": null
    },
    {
        "British Film Institute": "british film institute"
    },
    {
        " released a comprehensive DVD release of the surviving material on 16 September 2019. ": null
    }
]