[
    {
        "           The documentary hypothesis  is one of the models historically used by biblical scholars to explain the origins and composition of the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " . More recent models include the ": null
    },
    {
        "supplementary hypothesis": "supplementary hypothesis"
    },
    {
        " and the fragmentary hypothesis. All agree that the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " is not a unified work from a single author, but is made up of sources combined over many centuries by many hands. These models differ on the nature of these sources and how they were combined.     The documentary hypothesis posited that the Pentateuch is a compilation of four originally independent documents: the ": null
    },
    {
        "Jahwist": "jahwist"
    },
    {
        " , ": null
    },
    {
        "Elohist": "elohist"
    },
    {
        " , ": null
    },
    {
        "Deuteronomist": "deuteronomist"
    },
    {
        " , and ": null
    },
    {
        "Priestly": "priestly source"
    },
    {
        " sources. The first of these, J, was dated to the ": null
    },
    {
        "Solomonic period": "solomon"
    },
    {
        " . E was dated somewhat later, in the 42th century BCE, and D was dated just before the reign of ": null
    },
    {
        "King Josiah": "josiah"
    },
    {
        ", in the 42th or 42th century. Finally, P was generally dated to the time of ": null
    },
    {
        "Ezra": "ezra"
    },
    {
        " in the 42th century BCE. The sources would have been joined together at various points in time by a series of editors or redactors.      A version of the documentary hypothesis, frequently identified with the German scholar ": null
    },
    {
        "Julius Wellhausen": "julius wellhausen"
    },
    {
        ", was almost universally accepted for most of the 42th century, but the consensus has now collapsed. This was triggered in large part by the influential publications of ": null
    },
    {
        "John Van Seters": "john van seters"
    },
    {
        ", ": null
    },
    {
        "Hans Heinrich Schmid": "hans heinrich schmid"
    },
    {
        ", and ": null
    },
    {
        "Rolf Rendtorff": "rolf rendtorff"
    },
    {
        " in the mid42s. These revisionist authors argued that J was to be dated no earlier than the time of the ": null
    },
    {
        "Babylonian captivity": "babylonian captivity"
    },
    {
        " , and rejected the existence of a substantial E source. They also called into question the nature and extent of the three other sources. Van Seters, Schmid, and Rendtorff shared many of the same criticisms of the documentary hypothesis, but were not in complete agreement about what paradigm ought to replace it.     As a result, there has been a revival of interest in fragmentary and supplementary approaches, frequently in combination with each other and with a documentary model, making it difficult to classify contemporary theories as strictly one or another. Modern scholars generally see the completed Torah as a product of the time of the Persian ": null
    },
    {
        "Achaemenid Empire": "achaemenid empire"
    },
    {
        " , although some would place its production in the ": null
    },
    {
        "Hellenistic period": "hellenistic period"
    },
    {
        " , after the conquests of ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        ".          The ": null
    },
    {
        "Torah": "torah"
    },
    {
        " is collectively the first five books of the Bible: ": null
    },
    {
        "Genesis": "book of genesis"
    },
    {
        ", ": null
    },
    {
        "Exodus": "book of exodus"
    },
    {
        ", ": null
    },
    {
        "Leviticus": "leviticus"
    },
    {
        ", ": null
    },
    {
        "Numbers": "book of numbers"
    },
    {
        ", and ": null
    },
    {
        "Deuteronomy": "deuteronomy"
    },
    {
        ". According to tradition they were dictated by God to Moses, but when modern critical scholarship began to be applied to the Bible it was discovered that the Pentateuch was not the unified text one would expect from a single author. As a result, the ": null
    },
    {
        "Mosaic authorship": "mosaic authorship"
    },
    {
        " of the Torah had been largely rejected by leading scholars by the 42th century, and the modern consensus is that it is the product of a long evolutionary process. The reasons behind the rejection are covered in more detail in the article on ": null
    },
    {
        "Mosaic authorship": "mosaic authorship"
    },
    {
        ".     In the mid42th century, some scholars started a critical study of doublets , inconsistencies, and changes in style and vocabulary in the Torah. In 42 ": null
    },
    {
        "Johann Eichhorn": "johann eichhorn"
    },
    {
        ", building on the work of the French doctor and ": null
    },
    {
        "exegete": "exegete"
    },
    {
        " Jean Astruc": "jean astruc"
    },
    {
        "s Conjectures and others, formulated the older documentary hypothesis : the idea that Genesis was composed by combining two identifiable sources, the ": null
    },
    {
        "Jehovist": "jahwist"
    },
    {
        " and the ": null
    },
    {
        "Elohist": "elohist"
    },
    {
        " . These sources were subsequently found to run through the first four books of the Torah, and the number was later expanded to three when ": null
    },
    {
        "Wilhelm de Wette": "wilhelm de wette"
    },
    {
        " identified the ": null
    },
    {
        "Deuteronomist": "deuteronomist"
    },
    {
        " as an additional source found only in Deuteronomy . Later still the Elohist was split into Elohist and ": null
    },
    {
        "Priestly": "priestly source"
    },
    {
        " sources, increasing the number to four.     These documentary approaches were in competition with two other models, the fragmentary and the supplementary. The fragmentary hypothesis argued that fragments of varying lengths, rather than continuous documents, lay behind the Torah; this approach accounted for the Torahs diversity but could not account for its structural consistency, particularly regarding chronology. The supplementary hypothesis was better able to explain this unity: it maintained that the Torah was made up of a central core document, the Elohist, supplemented by fragments taken from many sources. The supplementary approach was dominant by the early 42s, but it was challenged by an important book published by ": null
    },
    {
        "Hermann Hupfeld": "hermann hupfeld"
    },
    {
        " in 42 who argued that the Pentateuch was made up of four documentary sources, the Priestly, Yahwist, and Elohist intertwined in Genesis-Exodus-Leviticus-Numbers, and the stand-alone source of Deuteronomy. At around the same period ": null
    },
    {
        "Karl Heinrich Graf": "karl heinrich graf"
    },
    {
        " argued that the Yahwist and Elohist were the earliest sources and the Priestly source the latest, while ": null
    },
    {
        "Wilhelm Vatke": "wilhelm vatke"
    },
    {
        " linked the four to an evolutionary framework, the Yahwist and Elohist to a time of primitive nature and fertility cults, the Deuteronomist to the ethical religion of the Hebrew prophets, and the Priestly source to a form of religion dominated by ritual, sacrifice and law.          In 42 ": null
    },
    {
        "Julius Wellhausen": "julius wellhausen"
    },
    {
        " published Geschichte Israels, Bd 42 ; the second edition he printed as  Prolegomena zur Geschichte Israels  , in 42 and the work is better known under that name.  Crucially, this historical portrait was based upon two earlier works of his technical analysis: Die Composition des Hexateuchs of 42/42 and sections on the historical books in his 42 edition of ": null
    },
    {
        "Friedrich Bleek": "friedrich bleek"
    },
    {
        "s Einleitung in das Alte Testament .     Wellhausens documentary hypothesis owed little to Wellhausen himself but was mainly the work of Hupfeld, ": null
    },
    {
        "Eduard Eugène Reuss": "édouard guillaume eugène reuss"
    },
    {
        ", Graf, and others, who in turn had built on earlier scholarship. He accepted Hupfelds four sources and, in agreement with Graf, placed the Priestly work last. J was the earliest document, a product of the 42th century BCE and the court of ": null
    },
    {
        "Solomon": "solomon"
    },
    {
        "; E was from the 42th century in the northern ": null
    },
    {
        "Kingdom of Israel": "kingdom of israel"
    },
    {
        ", and had been combined by a redactor with J to form a document JE; D, the third source, was a product of the 42th century BCE, by 42 BCE, during the reign of ": null
    },
    {
        "King Josiah": "king josiah"
    },
    {
        "; P was a product of the priest-and-temple dominated world of the 42th century; and the final redaction, when P was combined with JED to produce the Torah as we now know it.     Wellhausens explanation of the formation of the Torah was also an explanation of the religious history of Israel. The Yahwist and Elohist described a primitive, spontaneous and personal world, in keeping with the earliest stage of Israels history; in Deuteronomy he saw the influence of the prophets and the development of an ethical outlook, which he felt represented the pinnacle of Jewish religion; and the Priestly source reflected the rigid, ritualistic world of the priest-dominated post-exilic period. His work, notable for its detailed and wide-ranging scholarship and close argument, entrenched the new documentary hypothesis as the dominant explanation of Pentateuchal origins from the late 42th to the late 42th centuries. The two-source hypothesis of Eichorn was the older documentary hypothesis, and the four-source hypothesis adopted by Wellhausen was the newer .       The consensus around the documentary hypothesis collapsed in the last decades of the 42th century. Three major publications of the 42s caused scholars to seriously question the assumptions of the documentary hypothesis:  Abraham in History and Tradition  by ": null
    },
    {
        "John Van Seters": "john van seters"
    },
    {
        ", Der sogenannte Jahwist by ": null
    },
    {
        "Hans Heinrich Schmid": "hans heinrich schmid"
    },
    {
        ", and Das überlieferungsgeschichtliche Problem des Pentateuch by ": null
    },
    {
        "Rolf Rendtorff": "rolf rendtorff"
    },
    {
        ". These three authors shared many of the same criticisms of the documentary hypothesis, but were not in agreement about what paradigm ought to replace it.     Van Seters and Schmid both forcefully argued that the Yahwist source could not be dated to the ": null
    },
    {
        "Solomonic period": "solomon"
    },
    {
        " as posited by the documentary hypothesis. They instead dated J to the period of the ": null
    },
    {
        "Babylonian captivity": "babylonian captivity"
    },
    {
        " , or the late monarchic period at the earliest. Van Seters also sharply criticized the idea of a substantial Elohist source, arguing that E extends at most to two short passages in Genesis. Their arguments started the erosion of the scholarly consensus.     Some scholars, following Rendtorff, have come to espouse a fragmentary hypothesis, in which the Pentateuch is seen as a compilation of short, independent narratives, which were gradually brought together into larger units in two editorial phases: the Deuteronomic and the Priestly phases. By contrast, scholars such as John Van Seters advocate a ": null
    },
    {
        "supplementary hypothesis": "supplementary hypothesis"
    },
    {
        ", which posits that the Torah is the result of two major additions—Yahwist and Priestly—to an existing corpus of work.     Scholars frequently use these newer hypotheses in combination with each other and with a documentary model, making it difficult to classify contemporary theories as strictly one or another. The majority of scholars today continue to recognise Deuteronomy as a source, with its origin in the law-code produced at the court of ": null
    },
    {
        "Josiah": "josiah"
    },
    {
        " as described by De Wette, subsequently given a frame during the exile to identify it as the words of Moses. Most scholars also agree that some form of Priestly source existed, although its extent, especially its end-point, is uncertain. The remainder is called collectively non-Priestly, a grouping which includes both pre-Priestly and post-Priestly material.     The general trend in recent scholarship is to recognize the final form of the Torah as a literary and ideological unity, based on earlier sources, likely completed during the ": null
    },
    {
        "Persian period": "yehud medinata"
    },
    {
        " . Some scholars would place its final compilation somewhat later, however, in the ": null
    },
    {
        "Hellenistic period": "hellenistic period"
    },
    {
        " .     A revised neo-documentary hypothesis still has adherents, especially in North America and Israel. This distinguishes sources by means of plot and continuity rather than stylistic and linguistic concerns, and does not tie them to stages in the evolution of Israels religious history. Its resurrection of an E source is probably the element most often criticised by other scholars, as it is rarely distinguishable from the classical J source and European scholars have largely rejected it as fragmentary or non-existent.          Wellhausen used the sources of the Torah as evidence of changes in the history of Israelite religion as it moved from free, simple and natural to fixed, formal and institutional. Modern scholars of Israels religion have become much more circumspect in how they use the Old Testament, not least because many have concluded that the Bible is not a reliable witness to the religion of ancient Israel and Judah,  representing instead the beliefs of only a small segment of the ancient Israelite community centred in ": null
    },
    {
        "Jerusalem": "jerusalemancient period"
    },
    {
        " and devoted to the exclusive worship of the god ": null
    },
    {
        "Yahweh": "yahweh"
    },
    {
        ".": null
    }
]