[
    {
        "           Dollar  is the name of more than 20 ": null
    },
    {
        "currencies": "currency"
    },
    {
        ", including those of ": null
    },
    {
        "Australia": "australian dollar"
    },
    {
        ", ": null
    },
    {
        "Canada": "canadian dollar"
    },
    {
        ", ": null
    },
    {
        "Hong Kong": "hong kong dollar"
    },
    {
        ", ": null
    },
    {
        "Jamaica": "jamaican dollar"
    },
    {
        ", ": null
    },
    {
        "Liberia": "liberian dollar"
    },
    {
        ", ": null
    },
    {
        "Namibia": "namibian dollar"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "new zealand dollar"
    },
    {
        ", ": null
    },
    {
        "Singapore": "singapore dollar"
    },
    {
        ", ": null
    },
    {
        "Taiwan": "new taiwan dollar"
    },
    {
        ", and the ": null
    },
    {
        "United States": "united states dollar"
    },
    {
        ". The U.S. dollar is also the official currency of the ": null
    },
    {
        "Caribbean Netherlands": "caribbean netherlands"
    },
    {
        ", ": null
    },
    {
        "East Timor": "east timor"
    },
    {
        ", ": null
    },
    {
        "Ecuador": "currency of ecuador"
    },
    {
        ", ": null
    },
    {
        "El Salvador": "el salvador"
    },
    {
        ", the ": null
    },
    {
        "Federated States of Micronesia": "federated states of micronesia"
    },
    {
        ", the ": null
    },
    {
        "Marshall Islands": "marshall islands"
    },
    {
        ", ": null
    },
    {
        "Palau": "palau"
    },
    {
        ", and ": null
    },
    {
        "Zimbabwe": "zimbabwe"
    },
    {
        ". One dollar is generally divided into 100 ": null
    },
    {
        "cents": "cent"
    },
    {
        ".       On 15 January 1520, the ": null
    },
    {
        "Kingdom of Bohemia": "kingdom of bohemia"
    },
    {
        " began minting coins from silver mined locally in ": null
    },
    {
        "Joachimsthal": "jáchymov"
    },
    {
        " and marked on reverse with the Bohemian lion. The coins were called  joachimsthaler , which became shortened in common usage to  thaler  or taler. The German name Joachimsthal literally means Joachims valley or Joachims dale .   This name found its way into other languages: ": null
    },
    {
        "Czech": "czech language"
    },
    {
        " and ": null
    },
    {
        "Slovenian": "slovakian"
    },
    {
        "  tolar , Hungarian ": null
    },
    {
        "tallér": "tallér"
    },
    {
        ", ": null
    },
    {
        "Danish": "danish language"
    },
    {
        " and ": null
    },
    {
        "Norwegian": "norwegian language"
    },
    {
        "  daler , ": null
    },
    {
        "Swedish": "swedish language"
    },
    {
        "  daler , ": null
    },
    {
        "Icelandic": "icelandic language"
    },
    {
        " dalur, ": null
    },
    {
        "Dutch": "dutch language"
    },
    {
        "  daalder or daler , ": null
    },
    {
        "Ethiopian": "ethiopian language"
    },
    {
        " ታላሪ , ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " tallero, ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " τάλληρον, τάλιρο, tàlleron, tàliro, ": null
    },
    {
        "Polish": "polish language"
    },
    {
        " talar, ": null
    },
    {
        "Persian": "persian language"
    },
    {
        " dare, as well as – via Dutch – into ": null
    },
    {
        "English": "english language"
    },
    {
        " as dollar.      A later Dutch coin also depicting a lion was called the  leeuwendaler or leeuwendaalder , literally lion daler. The ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " produced these coins to accommodate its booming international trade. The leeuwendaler circulated throughout the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " and was imitated in several German and Italian cities. This coin was also popular in the ": null
    },
    {
        "Dutch East Indies": "dutch east indies"
    },
    {
        " and in the Dutch ": null
    },
    {
        "New Netherland Colony": "new netherland"
    },
    {
        " . It was in circulation throughout the ": null
    },
    {
        "Thirteen Colonies": "thirteen colonies"
    },
    {
        " during the 17th and early 18th centuries and was popularly known as lion dollar .   The currencies of Romania and Bulgaria are, to this day, lion . The modern American-English pronunciation of dollar is still remarkably close to the 17th century Dutch pronunciation of daler.  Some well-worn examples circulating in the Colonies were known as dog dollars .      Spanish pesos – having the same weight and shape – came to be known as Spanish dólar. By the mid-18th century, the lion dollar had been replaced by ": null
    },
    {
        "Spanish dollar": "spanish dollar"
    },
    {
        ", the famous ": null
    },
    {
        "pieces of eight": "pieces of eight"
    },
    {
        " , which were distributed widely in the ": null
    },
    {
        "Spanish colonies in the New World": "spanish colonization of the americas"
    },
    {
        " and in the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ".    National Geographic. June 2002. p. 1. Ask Us.               The sign is first attested in business correspondence in the 1770s as a ": null
    },
    {
        "scribal abbreviation": "scribal abbreviation"
    },
    {
        " p s , referring to the Spanish American ": null
    },
    {
        "peso": "peso"
    },
    {
        ", Lawrence Kinnaird . The Western Fringe of Revolution,  The Western Historical Quarterly  7, 259.   that is, the Spanish dollar as it was known in British North America. These late 18th- and early 19th-century manuscripts show that the s gradually came to be written over the p developing a close equivalent to the $ mark, and this new symbol was retained to refer to the American dollar as well, once this currency was adopted in 1785 by the United States. ": null
    },
    {
        "Florian Cajori": "florian cajori"
    },
    {
        " . https://books.google.com/books?id7juWmvQSTvwC & pgRA1-PA22 & dqisbn:0486677664PRA1-PA22,M1 A History of Mathematical Notations , 15-29. Arthur S. Aiton and Benjamin W. Wheeler . The First American Mint , The Hispanic American Historical Review 11, 198 and note 2 on 198.   Riesco Terrero, Ángel . Diccionario de abreviaturas hispanas de los siglos XIII al XVIII: Con un apendice de expresiones y formulas juridico-diplomaticas de uso corriente. Salamanca: Imprenta Varona, 350.              By the time of the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        ", Spanish dólar gained significance because they backed paper money authorized by the individual colonies and the ": null
    },
    {
        "Continental Congress": "continental congress"
    },
    {
        ". Common in the Thirteen Colonies, Spanish dólar were even ": null
    },
    {
        "legal tender": "legal tender"
    },
    {
        " in one colony, ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        ".     On April 2, 1792, U.S. ": null
    },
    {
        "Secretary of the Treasury": "united states secretary of the treasury"
    },
    {
        " Alexander Hamilton": "alexander hamilton"
    },
    {
        " reported to Congress the precise amount of silver found in ": null
    },
    {
        "Spanish dollar": "spanish dollar"
    },
    {
        " coins in common use in the states. As a result, the ": null
    },
    {
        "United States dollar": "united states dollar"
    },
    {
        " was defined Act of April 2, A.D. 1792 of the Senate and House of Representatives of the United States of America in Congress assembled, Section 9. as a unit of pure silver weighing 371 4/16th grains , or 416 grains of standard silver . Section 13 of the Act. It was specified that the money of account of the United States should be expressed in those same dollars or parts thereof. Additionally, all lesser-denomination coins were defined as percentages of the dollar coin, such that a half-dollar was to contain half as much silver as a dollar, quarter-dollars would contain one-fourth as much, and so on.     In an act passed in January 1837, the dollars alloy was set at 15%. Subsequent coins would contain the same amount of pure silver as previously, but were reduced in overall weight . On February 21, 1853, the quantity of silver in the lesser coins was reduced, with the effect that their denominations no longer represented their silver content relative to dollar coins.     Various acts have subsequently been passed affecting the amount and type of metal in U.S. coins, so that today there is no legal definition of the term dollar to be found in U.S. statute.    Currently the closest thing to a definition is found in United States Code Title 31, Section 5116, paragraph b, subsection 2: The Secretary shall sell silver under conditions the Secretary considers appropriate for at least $1.292929292 a fine troy ounce. However, the dollars constitutional meaning has remained unchanged through the years .     Silver was mostly removed from U.S. coinage by 1965 and the dollar became a free-floating ": null
    },
    {
        "fiat currency": "fiat currency"
    },
    {
        " without a commodity backing defined in terms of real gold or silver. The ": null
    },
    {
        "US Mint": "united states mint"
    },
    {
        " continues to make silver $1-denomination coins, but these are not intended for general circulation.       The quantity of silver chosen in 1792 to correspond to one dollar, namely, 371.25 grains of pure silver, is very close to the ": null
    },
    {
        "geometric mean": "geometric mean"
    },
    {
        " of one ": null
    },
    {
        "troy pound": "troy pound"
    },
    {
        " and one ": null
    },
    {
        "pennyweight": "pennyweight"
    },
    {
        ". In what follows, dollar will be used as a unit of mass. A troy pound being 5760 ": null
    },
    {
        "grains": "grain"
    },
    {
        " and a pennyweight being 240 times smaller, or 24 grains, the geometric mean is, to the nearest hundredth, 371.81 grains. This means that the ratio of a pound to a dollar roughly equals the ratio of a dollar to a pennyweight . These ratios are also very close to the ratio of a gram to a grain: 15.43. Finally, in the United States, the ratio of the value of gold to the value of silver in the period from 1792 to 1873 averaged to about 15.5, being 15 from 1792 to 1834 and around 16 from 1834 to 1873. This is also nearly the value of the gold to silver ratio determined by Isaac Newton in 1717.      That these three ratios are all approximately equal has some interesting consequences. Let the gold to silver ratio be exactly 15.5. Then a pennyweight of gold, that is 24 grains of gold, is nearly equal in value to a dollar of silver . Second, a dollar of gold is nearly equal in value to a pound of silver . Third, the number of grains in a dollar roughly equals the number of grams in a troy pound .     The actual process of defining the US silver dollar had nothing to do with any geometric mean. The US government simply sampled all Spanish milled dollars in circulation in 1792 and arrived at the average weight in common use. And this was 371.25 grains of fine silver.         There are two quotes in the plays of ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        " referring to dollars as money. Coins known as thistle dollars were in use in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " during the 16th and 17th centuries,  and use of the English word, and perhaps even the use of the coin, may have begun at the ": null
    },
    {
        "University of St Andrews": "university of st andrews"
    },
    {
        ". This might be supported by a reference to the sum of ten thousand dollars in  Macbeth  . In the Sherlock Holmes story The Man with the Twisted Lip by Sir Arthur Conan Doyle, published in 1891 ": null
    },
    {
        "The Man with the Twisted Lip": "the man with the twisted lip"
    },
    {
        " , an Englishman posing as a London beggar describes the shillings and pounds he collected as dollars.     In 1804, a British five-": null
    },
    {
        "shilling": "shilling"
    },
    {
        " piece, or ": null
    },
    {
        "crown": "crown"
    },
    {
        ", was sometimes called dollar . It was an ": null
    },
    {
        "overstruck": "overstrike"
    },
    {
        " Spanish eight ": null
    },
    {
        "real": "spanish real"
    },
    {
        " coin , the original of which was known as a Spanish dollar. Large numbers of these eight-real coins were captured during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", hence their re-use by the ": null
    },
    {
        "Bank of England": "bank of england"
    },
    {
        ". They remained in use until 1811. All Things Austen: An Encyclopedia of Austens World  p. 444  During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", when the U.S. dollar was valued at five shillings, the half crown acquired the nickname half dollar in the UK.         Chinese demand for silver in the 19th and early 20th centuries led several countries, notably the United Kingdom, United States and ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", to mint ": null
    },
    {
        "trade dollar": "trade dollar"
    },
    {
        "s, which were often of slightly different weights from comparable domestic coinage. Silver dollars reaching China were often stamped with Chinese characters known as ": null
    },
    {
        "chop marks": "chop marks on coins"
    },
    {
        " , which indicated that that particular coin had been assayed by a well-known merchant and deemed genuine.                    Prior to 1873, the silver dollar circulated in many parts of the world, with a value in relation to the British gold ": null
    },
    {
        "sovereign": "british sovereign coin"
    },
    {
        " of roughly $1 4s 2d . As a result of the decision of the German Empire to stop minting silver thaler coins in 1871, in the wake of the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        ", the worldwide price of silver began to fall.  This resulted in the U.S. ": null
    },
    {
        "Coinage Act ": "coinage act"
    },
    {
        " which put the United States onto a ": null
    },
    {
        "de facto": "de facto"
    },
    {
        " gold standard. ": null
    },
    {
        "Canada": "canada"
    },
    {
        " and ": null
    },
    {
        "Newfoundland": "history of newfoundland and labrador"
    },
    {
        " were already on the gold standard, and the result was that the value of the dollar in North America increased in relation to silver dollars being used elsewhere, particularly ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        " and the ": null
    },
    {
        "Far East": "far east"
    },
    {
        ". By ": null
    },
    {
        "1900": "1900"
    },
    {
        ", value of silver dollars had fallen to 50 percent of gold dollars. Following the abandonment of the gold standard by Canada in 1931, the ": null
    },
    {
        "Canadian dollar": "canadian dollar"
    },
    {
        " began to drift away from parity with the U.S. dollar. It returned to parity a few times, but since the end of the ": null
    },
    {
        "Bretton Woods system": "bretton woods system"
    },
    {
        " of fixed exchange rates that was agreed to in 1944, the Canadian dollar has been floating against the U.S. dollar. The silver dollars of Latin America and ": null
    },
    {
        "South East Asia": "south east asia"
    },
    {
        " began to diverge from each other as well during the course of the 20th century. The ": null
    },
    {
        "Straits dollar": "straits dollar"
    },
    {
        " adopted a gold exchange standard in 1906 after it had been forced to rise in value against other silver dollars in the region. Hence, by 1935, when China and ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " came off the ": null
    },
    {
        "silver standard": "silver standard"
    },
    {
        ", the Straits dollar was worth 2s 4d ": null
    },
    {
        "sterling": "pound sterling"
    },
    {
        ", whereas the ": null
    },
    {
        "Hong Kong dollar": "hong kong dollar"
    },
    {
        " was worth only 1s 3d sterling .     The term dollar has also been adopted by other countries for currencies which do not share a common history with other dollars. Many of these currencies adopted the name after moving from a ": null
    },
    {
        "£sd": "£sd"
    },
    {
        "-based to a decimalized monetary system. Examples include the ": null
    },
    {
        "Australian dollar": "australian dollar"
    },
    {
        ", the ": null
    },
    {
        "New Zealand dollar": "new zealand dollar"
    },
    {
        ", the ": null
    },
    {
        "Jamaican dollar": "jamaican dollar"
    },
    {
        ", the ": null
    },
    {
        "Cayman Islands dollar": "cayman islands dollar"
    },
    {
        ", the ": null
    },
    {
        "Fiji dollar": "fijian dollar"
    },
    {
        ", the ": null
    },
    {
        "Namibian dollar": "namibian dollar"
    },
    {
        ", the ": null
    },
    {
        "Rhodesian dollar": "rhodesian dollar"
    },
    {
        ", the ": null
    },
    {
        "Zimbabwe dollar": "zimbabwe dollar"
    },
    {
        ", and the ": null
    },
    {
        "Solomon Islands dollar": "solomon islands dollar"
    },
    {
        ".   The  tala  is based on the ": null
    },
    {
        "Samoan": "samoan language"
    },
    {
        " pronunciation of the word dollar .   The ": null
    },
    {
        "Slovenian tolar": "slovenian tolar"
    },
    {
        " had the same etymological origin as dollar .   ": null
    }
]