[
    {
        "                 A dome  is an architectural element that resembles the hollow upper half of a ": null
    },
    {
        "sphere": "sphere"
    },
    {
        ". The precise definition has been a matter of controversy. There are also a wide variety of forms and specialized terms to describe them. A dome can rest upon a ": null
    },
    {
        "rotunda": "rotunda"
    },
    {
        " or ": null
    },
    {
        "drum": "tholobate"
    },
    {
        ", and can be supported by ": null
    },
    {
        "column": "column"
    },
    {
        "s or ": null
    },
    {
        "piers": "pier"
    },
    {
        " that transition to the dome through ": null
    },
    {
        "squinch": "squinch"
    },
    {
        "es or ": null
    },
    {
        "pendentive": "pendentive"
    },
    {
        "s. A ": null
    },
    {
        "lantern": "roof lantern"
    },
    {
        " may cover an ": null
    },
    {
        "oculus": "oculus"
    },
    {
        " and may itself have ": null
    },
    {
        "another dome": "cupola"
    },
    {
        ".     Domes have a long architectural lineage that extends back into ": null
    },
    {
        "prehistory": "prehistory"
    },
    {
        " and they have been constructed from mud, snow, stone, wood, brick, concrete, metal, glass, and plastic over the centuries. The symbolism associated with domes includes ": null
    },
    {
        "mortuary": "funerary art"
    },
    {
        ", ": null
    },
    {
        "celestial": "celestial sphere"
    },
    {
        ", and governmental traditions that have likewise developed over time.     Domes have been found from early ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        ", which may explain the forms spread. They are found in Persian, ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        ", Roman, and Chinese architecture in the ": null
    },
    {
        "Ancient world": "ancient history"
    },
    {
        ", as well as among a number of contemporary ": null
    },
    {
        "indigenous": "indigenous peoples"
    },
    {
        " building traditions. Dome structures were popular in ": null
    },
    {
        "Byzantine": "byzantine architecture"
    },
    {
        " and medieval ": null
    },
    {
        "Islamic architecture": "islamic architecture"
    },
    {
        ", and there are numerous examples from Western Europe in the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". The ": null
    },
    {
        "Renaissance": "renaissance architecture"
    },
    {
        " architectural style spread from Italy in the ": null
    },
    {
        "Early modern period": "early modern period"
    },
    {
        ". Advancements in mathematics, materials, and production techniques since that time resulted in new dome types. The domes of the modern world can be found over religious buildings, legislative chambers, sports stadiums, and a variety of functional structures.       The English word dome ultimately derives from the ancient Greek and Latin domus , which, up through the Renaissance, labeled a revered house, such as a Domus Dei, or House of God , regardless of the shape of its roof. This is reflected in the uses of the Italian word duomo, the German/Icelandic/Danish word dom , and the English word dome as late as 42 when it meant a Town-House, Guild-Hall, State-House, and Meeting-House in a city. The French word dosme came to acquire the meaning of a ": null
    },
    {
        "cupola": "cupola"
    },
    {
        " vault, specifically, by 42 This French definition gradually became the standard usage of the English dome in the eighteenth century as many of the most impressive Houses of God were built with monumental domes, and in response to the scientific need for more technical terms.          A dome is a rounded vault made of either curved segments or a ": null
    },
    {
        "shell of revolution": "surface of revolution"
    },
    {
        ", meaning an ": null
    },
    {
        "arch": "arch"
    },
    {
        " rotated around its central vertical axis. The terminology used has been a source of controversy, with inconsistency between scholars and even within individual texts, but the term dome may be considered a blanket-word to describe an hemispherical or similar spanning element.  A half-dome or ": null
    },
    {
        "semi-dome": "semi-dome"
    },
    {
        " is a semi-circular shape often used, especially in ": null
    },
    {
        "apse": "apse"
    },
    {
        "s.     Sometimes called false domes, ": null
    },
    {
        "corbel": "corbel arch"
    },
    {
        " domes achieve their shape by extending each horizontal layer of stones inward slightly farther than the lower one until they meet at the top. A false dome may also refer to a wooden dome. True domes are said to be those whose structure is in a state of compression, with constituent elements of wedge-shaped ": null
    },
    {
        "voussoir": "voussoir"
    },
    {
        "s, the joints of which align with a central point. The validity of this is unclear, as domes built underground with corbelled stone layers are also in compression from the surrounding earth. The Italian use of the term finto, meaning false , can be traced back to the 42th century in the use of vaulting made of reed mats and gypsum mortar.     As with arches, the springing of a dome is the level from which the dome rises. The top of a dome is the crown . The inner side of a dome is called the intrados and the outer side is called the extrados . The haunch is the part of an arch that lies roughly halfway between the base and the top.     The word ": null
    },
    {
        "cupola": "cupola"
    },
    {
        " is another word for dome , and is usually used for a small dome upon a roof or ": null
    },
    {
        "turret": "turret"
    },
    {
        ". Cupola has also been used to describe the inner side of a dome.     Drums, also called ": null
    },
    {
        "tholobate": "tholobate"
    },
    {
        "s, are cylindrical or polygonal walls with or without windows that support a dome. A ": null
    },
    {
        "tambour": "tambour"
    },
    {
        " or ": null
    },
    {
        "lantern": "roof lantern"
    },
    {
        " is the equivalent structure over a domes oculus, supporting a ": null
    },
    {
        "cupola": "cupola"
    },
    {
        ".           A masonry dome produces ": null
    },
    {
        "thrust": "thrust"
    },
    {
        "s down and outward. They are thought of in terms of two kinds of forces at right angles from one another. Meridional forces  are ": null
    },
    {
        "compressive": "compression"
    },
    {
        " only, and increase towards the base, while hoop forces  are in compression at the top and ": null
    },
    {
        "tension": "tension"
    },
    {
        " at the base, with the transition in a hemispherical dome occurring at an angle of 42 degrees from the top. The thrusts generated by a dome are directly proportional to the weight of its materials. Grounded hemispherical domes generate significant horizontal thrusts at their haunches.     Unlike voussoir arches, which require support for each element until the ": null
    },
    {
        "keystone": "keystone"
    },
    {
        " is in place, domes are stable during construction as each level is made a complete and self-supporting ring. The upper portion of a masonry dome is always in compression and is supported laterally, so it does not collapse except as a whole unit and a range of deviations from the ideal in this shallow upper cap are equally stable. Because voussoir domes have lateral support, they can be made much thinner than corresponding arches of the same span. For example, a hemispherical dome can be 42 times thinner than a semicircular arch, and a dome with the profile of an ": null
    },
    {
        "equilateral arch": "gothic architectureequilateral arch"
    },
    {
        " can be thinner still.     The optimal shape for a masonry dome of equal thickness provides for perfect compression, with none of the tension or bending forces against which masonry is weak. For a particular material, the optimal dome geometry is called the funicular surface, the comparable shape in three dimensions to a ": null
    },
    {
        "catenary": "catenary"
    },
    {
        " curve for a two-dimensional arch. The pointed profiles of many Gothic domes more closely approximate this optimal shape than do hemispheres, which were favored by Roman and Byzantine architects due to the circle being considered the most perfect of forms. Adding a weight to the top of the pointed dome, such as the heavy cupola at the top of ": null
    },
    {
        "Florence Cathedral": "florence cathedral"
    },
    {
        ", changes the optimal shape to perfectly match the actual pointed shape of the dome.     The outward thrusts in the lower portion of a hemispherical masonry dome can be counteracted with the use of chains incorporated around the circumference or with external buttressing, although cracking along the meridians is natural. For small or tall domes with less horizontal thrust, the thickness of the supporting arches or walls can be enough to resist deformation, which is why drums tend to be much thicker than the domes they support.             When the base of the dome does not match the plan of the supporting walls beneath it , techniques are employed to bridge the two. One technique is to use corbelling, progressively projecting horizontal layers from the top of the supporting wall to the base of the dome, such as the corbelled triangles often used in Seljuk and Ottoman architecture. The simplest technique is to use diagonal ": null
    },
    {
        "lintels": "lintel"
    },
    {
        " across the corners of the walls to create an ": null
    },
    {
        "octagon": "octagon"
    },
    {
        "al base. Another is to use arches to span the corners, which can support more weight. A variety of these techniques use what are called ": null
    },
    {
        "squinch": "squinch"
    },
    {
        "es . A squinch can be a single arch or a set of multiple projecting nested arches placed diagonally over an internal corner. Squinches can take a variety of other forms, as well, including trumpet arches and ": null
    },
    {
        "niche": "niche"
    },
    {
        " heads, or half-domes.     The invention of ": null
    },
    {
        "pendentives": "pendentives"
    },
    {
        " superseded the squinch technique. Pendentives are triangular sections of a sphere, like concave ": null
    },
    {
        "spandrel": "spandrel"
    },
    {
        "s between arches, and transition from the corners of a square bay to the circular base of a dome. The curvature of the pendentives is that of a sphere with a diameter equal to the diagonal of the square bay. The precise definition of pendentive has been a source of contention among academics, including whether or not corbelling is permitted under the definition and whether or not the lower portions of a sail vault should be considered pendentives.     Domes with pendentives can be divided into two kinds: simple and compound. In the case of the simple dome, the pendentives are part of the same sphere as the dome itself; however, such domes are rare. In the case of the more common compound dome, the pendentives are part of the surface of a larger sphere below that of the dome itself and form a circular base for either the dome or a drum section.       Because domes are concave from below, they can reflect sound and create echoes. A dome may have a ": null
    },
    {
        "whispering gallery": "whispering gallery"
    },
    {
        " at its base that at certain places transmits distinct sound to other distant places in the gallery. The half-domes over the apses of Byzantine churches helped to project the ": null
    },
    {
        "chant": "chant"
    },
    {
        "s of the clergy. Although this can complement music, it may make speech less intelligible, leading ": null
    },
    {
        "Francesco Giorgi": "francesco giorgi"
    },
    {
        " in 42 to recommend vaulted ceilings for the choir areas of a church, but a flat ceiling filled with as many coffers as possible for where preaching would occur.     Cavities in the form of jars built into the inner surface of a dome may serve to compensate for this interference by diffusing sound in all directions, eliminating echoes while creating a divine effect in the atmosphere of worship. This technique was written about by ": null
    },
    {
        "Vitruvius": "vitruvius"
    },
    {
        " in his ": null
    },
    {
        "Ten Books on Architecture": "de architectura"
    },
    {
        ", which describes bronze and earthenware resonators. The material, shape, contents, and placement of these ": null
    },
    {
        "cavity resonators": "resonator"
    },
    {
        " determine the effect they have: reinforcing certain frequencies or absorbing them.       The earliest domes in the Middle East were built with mud-brick and, eventually, with baked brick and stone. Domes of wood allowed for wide spans due to the relatively light and flexible nature of the material and were the normal method for domed churches by the 42th century, although most domes were built with the other less flexible materials. Wooden domes were protected from the weather by roofing, such as copper or lead sheeting. Domes of cut stone were more expensive and never as large, and timber was used for large spans where brick was unavailable.     Roman concrete used an aggregate of stone with a powerful mortar. The aggregate transitioned over the centuries to pieces of fired clay, then to Roman bricks. By the sixth century, bricks with large amounts of mortar were the principle vaulting materials. ": null
    },
    {
        "Pozzolana": "pozzolana"
    },
    {
        " appears to have only been used in central Italy. Brick domes were the favored choice for large-space monumental coverings until the ": null
    },
    {
        "Industrial Age": "industrial age"
    },
    {
        ", due to their convenience and dependability. ": null
    },
    {
        "Ties": "tie"
    },
    {
        " and chains of iron or wood could be used to resist stresses.     The new building materials of the 42th century and a better understanding of the forces within structures from the 42th century has opened up new possibilities. Iron and steel beams, steel cables, and pre-stressed concrete have eliminated the need for external buttressing and enabled far thinner domes. Whereas earlier masonry domes may have had a radius to thickness ratio of 42 the ratio for modern domes can be in excess of 42 The lighter weight of these domes has not only permitted far greater spans, but also allowed for the creation of large movable domes over modern sports stadiums.     Experimental rammed earth domes were made as part of work on ": null
    },
    {
        "sustainable architecture": "sustainable architecture"
    },
    {
        " at the ": null
    },
    {
        "University of Kassel": "university of kassel"
    },
    {
        " in 42          According to E. Baldwin Smith, from the ": null
    },
    {
        "late Stone Age": "later stone age"
    },
    {
        " the dome-shaped tomb was used as a reproduction of the ancestral, god-given shelter made permanent as a venerated home of the dead. The instinctive desire to do this resulted in widespread domical mortuary traditions across the ancient world, from the ": null
    },
    {
        "stupa": "stupa"
    },
    {
        "s of ": null
    },
    {
        "India": "india"
    },
    {
        " to the ": null
    },
    {
        "tholos tombs": "beehive tomb"
    },
    {
        " of ": null
    },
    {
        "Iberia": "iberian peninsula"
    },
    {
        ". By Hellenistic and Roman times, the domical tholos had become the customary cemetery symbol.     Domes and tent-canopies were also associated with the heavens in Ancient Persia and the Hellenistic-Roman world. A dome over a square base reflected the geometric symbolism of those shapes. The circle represented perfection, eternity, and the heavens. The square represented the earth. An octagon was intermediate between the two. The distinct symbolism of the heavenly or cosmic tent stemming from the royal audience tents of ": null
    },
    {
        "Achaemenid": "achaemenid empire"
    },
    {
        " and Indian rulers was adopted by Roman rulers in imitation of ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        ", becoming the imperial ": null
    },
    {
        "baldachin": "baldachin"
    },
    {
        ". This probably began with ": null
    },
    {
        "Nero": "nero"
    },
    {
        ", whose ": null
    },
    {
        "Golden House": "domus aurea"
    },
    {
        " also made the dome an essential feature of palace architecture.     The dual sepulchral and heavenly symbolism was adopted by ": null
    },
    {
        "early Christians": "early christianity"
    },
    {
        " in both the use of domes in architecture and in the ": null
    },
    {
        "ciborium": "ciborium"
    },
    {
        ", a domical canopy like the baldachin used as a ritual covering for relics or the ": null
    },
    {
        "church altar": "altarchristianity"
    },
    {
        ". The celestial symbolism of the dome, however, was the preeminent one by the ": null
    },
    {
        "Christian era": "christian era"
    },
    {
        ". In the early centuries of Islam, domes were closely associated with royalty. A dome built in front of the mihrab of a mosque, for example, was at least initially meant to emphasize the place of a prince during royal ceremonies. Over time such domes became primarily focal points for decoration or the direction of prayer. The use of domes in mausoleums can likewise reflect royal patronage or be seen as representing the honor and prestige that domes symbolized, rather than having any specific funerary meaning. The wide variety of dome forms in medieval Islam reflected dynastic, religious, and social differences as much as practical building considerations.                Also called a corbelled dome, or false dome, these are different from a true dome in that they consist of purely horizontal layers. As the layers get higher, each is slightly ": null
    },
    {
        "cantilever": "cantilever"
    },
    {
        "ed, or ": null
    },
    {
        "corbel": "corbel"
    },
    {
        "ed, toward the center until meeting at the top. A monumental example is the Mycenaean ": null
    },
    {
        "Treasury of Atreus": "treasury of atreus"
    },
    {
        " from the late ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        ".         A single or double layer ": null
    },
    {
        "space frame": "space frame"
    },
    {
        " in the form of a dome, a braced dome is a generic term that includes ribbed,  Schwedler , three-way grid, lamella or Kiewitt, lattice, and  geodesic domes. The different terms reflect different arrangements in the surface members. Braced domes often have a very low weight and are usually used to cover spans of up to 42 meters. Often prefabricated, their component members can either lie on the domes surface of revolution, or be straight lengths with the connecting points or nodes lying upon the surface of revolution. Single-layer structures are called frame or skeleton types and double-layer structures are truss types, which are used for large spans. When the covering also forms part of the structural system, it is called a stressed skin type. The formed surface type consists of sheets joined together at bent edges to form the structure.            Also called domical vaults , polygonal domes, coved domes, gored domes, segmental domes , paneled vaults, or pavilion vaults, these are domes that maintain a polygonal shape in their horizontal cross section. The earliest known examples date to the first century BC, such as the ": null
    },
    {
        "Tabularium": "tabularium"
    },
    {
        " of Rome from 42 BC. Others include the Baths of Antoninus in ": null
    },
    {
        "Carthage": "carthage"
    },
    {
        " and the ": null
    },
    {
        "Palatine Chapel at Aachen": "palatine chapel, aachen"
    },
    {
        " . The most famous example is the Renaissance octagonal dome of Filippo Brunelleschi over the Florence Cathedral. ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        ", the third president of the United States, installed an octagonal dome above the West front of his plantation house, ": null
    },
    {
        "Monticello": "monticello"
    },
    {
        ".         Also called domes on pendentives or pendentive domes , compound domes have pendentives that support a smaller diameter dome immediately above them, as in the Hagia Sophia, or a drum and dome, as in many Renaissance and post-Renaissance domes, with both forms resulting in greater height.         One of the earliest types of ribbed vault, the first known examples are found in the ": null
    },
    {
        "Great Mosque of Córdoba": "mosque–cathedral of córdoba"
    },
    {
        " in the 42th century. Rather than meeting in the center of the dome, the ribs characteristically intersect one another off-center, forming an empty polygonal space in the center. Geometry is a key element of the designs, with the octagon being perhaps the most popular shape used. Whether the arches are structural or purely decorative remains a matter of debate. The type may have an eastern origin, although the issue is also unsettled. Examples are found in Spain, North Africa, Armenia, Iran, France, and Italy.              The  ellipsoid al dome is a surface formed by the rotation around a vertical axis of a ": null
    },
    {
        "semi-ellipse": "ellipse"
    },
    {
        ". Like other rotational domes formed by the rotation of a curve around a vertical axis, ellipsoidal domes have circular bases and horizontal sections and are a type of circular dome for that reason.            Geodesic domes are the upper portion of geodesic spheres. They are composed of a framework of triangles in a ": null
    },
    {
        "polyhedron": "polyhedron"
    },
    {
        " pattern. The structures are named for ": null
    },
    {
        "geodesic": "geodesic"
    },
    {
        "s and are based upon geometric shapes such as ": null
    },
    {
        "icosahedron": "icosahedron"
    },
    {
        "s, ": null
    },
    {
        "octahedron": "octahedron"
    },
    {
        "s or ": null
    },
    {
        "tetrahedron": "tetrahedron"
    },
    {
        "s. Such domes can be created using a limited number of simple elements and joints and efficiently resolve a domes internal forces. Their efficiency is said to increase with size. Although not first invented by ": null
    },
    {
        "Buckminster Fuller": "buckminster fuller"
    },
    {
        ", they are associated with him because he designed many geodesic domes and patented them in the United States.         The hemispherical dome is a surface formed by the rotation around a vertical axis of a ": null
    },
    {
        "semicircle": "semicircle"
    },
    {
        ". Like other rotational domes formed by the rotation of a curve around a vertical axis, hemispherical domes have circular bases and horizontal sections and are a type of circular dome for that reason. They experience vertical compression along their meridians, but horizontally experience compression only in the portion above 42 degrees from the top. Below this point, hemispherical domes experience tension horizontally, and usually require buttressing to counteract it. According to E. Baldwin Smith, it was a shape likely known to the Assyrians, defined by Greek theoretical mathematicians, and standardized by Roman builders.             Bulbous domes bulge out beyond their base diameters, offering a profile greater than a hemisphere. An onion dome is a greater than hemispherical dome with a pointed top in an ": null
    },
    {
        "ogee": "ogee"
    },
    {
        " profile. They are found in the ": null
    },
    {
        "Near East": "near east"
    },
    {
        ", ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ", Persia, and India and may not have had a single point of origin. Their appearance in northern Russian architecture predates the ": null
    },
    {
        "Tatar occupation of Russia": "mongol invasion of rusthe age of tatar rule"
    },
    {
        " and so is not easily explained as the result of that influence. They became popular in the second half of the 42th century in the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        " of Northern Europe, possibly inspired by the finials of ": null
    },
    {
        "minaret": "minaret"
    },
    {
        "s in Egypt and Syria, and developed in the 42th and 42th centuries in the Netherlands before spreading to Germany, becoming a popular element of the baroque architecture of Central Europe. German bulbous domes were also influenced by Russian and Eastern European domes. The examples found in various European architectural styles are typically wooden. Examples include Kazan Church in ": null
    },
    {
        "Kolomenskoye": "kolomenskoye"
    },
    {
        " and the ": null
    },
    {
        "Brighton Pavilion": "royal pavilion"
    },
    {
        " by ": null
    },
    {
        "John Nash": "john nash"
    },
    {
        ". In Islamic architecture, they are typically made of masonry, rather than timber, with the thick and heavy bulging portion serving to buttress against the tendency of masonry domes to spread at their bases. The Taj Mahal is a famous example.         An oval dome is a dome of ": null
    },
    {
        "oval": "oval"
    },
    {
        " shape in plan, profile, or both. The term comes from the Latin ovum, meaning egg . The earliest oval domes were used by convenience in corbelled stone huts as rounded but geometrically undefined coverings, and the first examples in Asia Minor date to around 42 B.C. The geometry was eventually defined using combinations of circular arcs, transitioning at points of tangency. If the Romans created oval domes, it was only in exceptional circumstances. The Roman foundations of the oval plan ": null
    },
    {
        "Church of St. Gereon in Cologne": "st. gereons basilica, cologne"
    },
    {
        " point to a possible example. Domes in the Middle Ages also tended to be circular, though the church of ": null
    },
    {
        "Santo Tomás de las Ollas": "santo tomás de las ollas"
    },
    {
        " in Spain has an oval dome over its oval plan. Other examples of medieval oval domes can be found covering rectangular bays in churches. Oval plan churches became a type in the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " and popular in the ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " style. The dome built for the basilica of ": null
    },
    {
        "Vicoforte": "vicoforte"
    },
    {
        " by Francesco Gallo was one of the largest and most complex ever made. Although the ellipse was known, in practice, domes of this shape were created by combining segments of circles. Popular in the 42th and 42th centuries, oval and elliptical plan domes can vary their dimensions in three axes or two axes.  A sub-type with the long axis having a semicircular section is called a Murcia dome, as in the Chapel of the Junterones at ": null
    },
    {
        "Murcia Cathedral": "murcia cathedral"
    },
    {
        ". When the short axis has a semicircular section, it is called a Melon dome.            A  paraboloid dome is a surface formed by the rotation around a vertical axis of a sector of a parabola. Like other rotational domes formed by the rotation of a curve around a vertical axis, paraboloid domes have circular bases and horizontal sections and are a type of circular dome for that reason. Because of their shape, paraboloid domes experience only compression, both radially and horizontally.         Also called sail vaults, handkerchief vaults, domical vaults , pendentive domes , Bohemian vaults, or Byzantine domes, this type can be thought of as ": null
    },
    {
        "pendentives": "pendentives"
    },
    {
        " that, rather than merely touching each other to form a circular base for a drum or compound dome, smoothly continue their curvature to form the dome itself. The dome gives the impression of a square sail pinned down at each corner and billowing upward. These can also be thought of as saucer domes upon pendentives. Sail domes are based upon the shape of a hemisphere and are not to be confused with ": null
    },
    {
        "elliptic parabolic": "paraboloidelliptic paraboloid"
    },
    {
        " vaults, which appear similar but have different characteristics. In addition to semicircular sail vaults there are variations in geometry such as a low rise to span ratio or covering a rectangular plan. Sail vaults of all types have a variety of thrust conditions along their borders, which can cause problems, but have been widely used from at least the sixteenth century. The second floor of the ": null
    },
    {
        "Llotja de la Seda": "llotja de la seda"
    },
    {
        " is covered by a series of nine meter wide sail vaults.         Also called segmental domes , or calottes, these have profiles of ": null
    },
    {
        "less than half a circle": "circular segment"
    },
    {
        ". Because they reduce the portion of the dome in tension, these domes are strong but have increased radial thrust. Many of the largest existing domes are of this shape.     Masonry saucer domes, because they exist entirely in compression, can be built much thinner than other dome shapes without becoming unstable. The trade-off between the proportionately increased horizontal thrust at their abutments and their decreased weight and quantity of materials may make them more economical, but they are more vulnerable to damage from movement in their supports.         Also called gadrooned, fluted, organ-piped, pumpkin, melon, ribbed, parachute, scalloped, or lobed domes, these are a type of dome divided at the base into curved segments, which follow the curve of the ": null
    },
    {
        "elevation": "multiview orthographic projectionelevation"
    },
    {
        ". Fluted may refer specifically to this pattern as an external feature, such as was common in ": null
    },
    {
        "Mamluk Egypt": "mamluk architecture"
    },
    {
        ". The ribs of a dome are the radial lines of masonry that extend from the crown down to the springing. The central dome of the ": null
    },
    {
        "Hagia Sophia": "hagia sophia"
    },
    {
        " uses the ribbed method, which accommodates a ring of windows between the ribs at the base of the dome. The central dome of ": null
    },
    {
        "St. Peters Basilica": "st. peters basilica"
    },
    {
        " also uses this method.                      Cultures from ": null
    },
    {
        "pre-history": "prehistory"
    },
    {
        " to modern times constructed domed dwellings using local materials. Although it is not known when the first dome was created, sporadic examples of early domed structures have been discovered. The earliest discovered may be four small dwellings made of ": null
    },
    {
        "Mammoth": "mammoth"
    },
    {
        " tusks and bones. The first was found by a farmer in ": null
    },
    {
        "Mezhirich": "mezhirich"
    },
    {
        ", Ukraine, in 42 while he was digging in his cellar and archaeologists unearthed three more. They date from 42 – 42 BC.     In ": null
    },
    {
        "modern times": "modern history"
    },
    {
        ", the creation of relatively simple dome-like structures has been documented among various indigenous peoples around the world. The ": null
    },
    {
        "wigwam": "wigwam"
    },
    {
        " was made by ": null
    },
    {
        "Native Americans": "indigenous peoples of the americas"
    },
    {
        " using arched branches or poles covered with grass or hides. The ": null
    },
    {
        "Efé people": "efé people"
    },
    {
        " of central Africa construct similar ": null
    },
    {
        "structures": "hut"
    },
    {
        ", using leaves as shingles. Another example is the ": null
    },
    {
        "igloo": "igloo"
    },
    {
        ", a shelter built from blocks of compact snow and used by the ": null
    },
    {
        "Inuit": "inuit"
    },
    {
        " people, among others. The ": null
    },
    {
        "Himba people": "himba people"
    },
    {
        " of ": null
    },
    {
        "Namibia": "namibia"
    },
    {
        " construct desert igloos of ": null
    },
    {
        "wattle and daub": "wattle and daub"
    },
    {
        " for use as temporary shelters at seasonal cattle camps, and as permanent homes by the poor. Extraordinarily thin ": null
    },
    {
        "domes of sun-baked clay": "musgum mud huts"
    },
    {
        " 42 feet in diameter, 42 feet high, and nearly parabolic in curve, are known from ": null
    },
    {
        "Cameroon": "cameroon"
    },
    {
        ".     The historical development from structures like these to more sophisticated domes is not well documented. That the dome was known to early ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " may explain the existence of domes in both ": null
    },
    {
        "China": "china"
    },
    {
        " and ": null
    },
    {
        "the West": "western world"
    },
    {
        " in the first millennium BC. Another explanation, however, is that the use of the dome shape in construction did not have a single point of origin and was common in virtually all cultures long before domes were constructed with enduring materials.     Corbelled stone domes have been found from the ": null
    },
    {
        "Neolithic period": "neolithic"
    },
    {
        " in the ": null
    },
    {
        "ancient Near East": "ancient near east"
    },
    {
        ", and in the Middle East to Western Europe from antiquity.  The kings of ": null
    },
    {
        "Achaemenid Persia": "achaemenid empire"
    },
    {
        " held audiences and festivals in domical tents derived from the nomadic traditions of central Asia. Simple domical mausoleums existed in the Hellenistic period. The remains of a large domed circular hall in the ": null
    },
    {
        "Parthian": "parthian empire"
    },
    {
        " capital city of ": null
    },
    {
        "Nyssa": "nisa, turkmenistan"
    },
    {
        " has been dated to perhaps the first century AD, showing ...the existence of a monumental domical tradition in Central Asia that had hitherto been unknown and which seems to have preceded Roman Imperial monuments or at least to have grown independently from them.  It likely had a wooden dome.                ": null
    },
    {
        "Persian architecture": "iranian architecture"
    },
    {
        " likely inherited an architectural tradition of dome-building dating back to the earliest Mesopotamian domes. Due to the scarcity of wood in many areas of the ": null
    },
    {
        "Iranian plateau": "iranian plateau"
    },
    {
        ", domes were an important part of ": null
    },
    {
        "vernacular architecture": "vernacular architecture"
    },
    {
        " throughout Persian history. The Persian invention of the ": null
    },
    {
        "squinch": "squinch"
    },
    {
        ", a series of concentric arches forming a half-cone over the corner of a room, enabled the transition from the walls of a square chamber to an octagonal base for a dome in a way reliable enough for large constructions and domes moved to the forefront of Persian architecture as a result. Pre-Islamic domes in Persia are commonly semi-elliptical, with pointed domes and those with conical outer shells being the majority of the domes in the Islamic periods.     The area of north-eastern Iran was, along with Egypt, one of two areas notable for early developments in Islamic domed mausoleums, which appear in the tenth century. The ": null
    },
    {
        "Samanid Mausoleum": "samanid mausoleum"
    },
    {
        " in ": null
    },
    {
        "Transoxiana": "transoxiana"
    },
    {
        " dates to no later than 42 and is the first to have squinches create a regular octagon as a base for the dome, which then became the standard practice. Cylindrical or polygonal plan tower tombs with conical roofs over domes also exist beginning in the 42th century.     The ": null
    },
    {
        "Seljuq Turks": "seljuq dynasty"
    },
    {
        " built tower tombs, called Turkish Triangles , as well as cube mausoleums covered with a variety of dome forms. Seljuk domes included conical, semi-circular, and pointed shapes in one or two shells. Shallow semi-circular domes are mainly found from the Seljuk era. The double-shell domes were either discontinuous or continuous. The domed enclosure of the ": null
    },
    {
        "Jameh Mosque of Isfahan": "jameh mosque of isfahan"
    },
    {
        ", built in 4242 by ": null
    },
    {
        "Nizam al-Mulk": "nizam al-mulk"
    },
    {
        ", was the largest masonry dome in the Islamic world at that time, had eight ribs, and introduced a new form of corner squinch with two quarter domes supporting a short barrel vault. In 42 Tāj-al-Molk, a rival of Nizam al-Mulk, built another dome at the opposite end of the same mosque with interlacing ribs forming five-pointed stars and pentagons. This is considered the landmark Seljuk dome, and may have inspired subsequent patterning and the domes of the Il-Khanate period. The use of tile and of plain or painted plaster to decorate dome interiors, rather than brick, increased under the Seljuks.     Beginning in the ": null
    },
    {
        "Ilkhanate": "ilkhanate"
    },
    {
        ", Persian domes achieved their final configuration of structural supports, zone of transition, drum, and shells, and subsequent evolution was restricted to variations in form and shell geometry. Characteristic of these domes are the use of high drums and several types of discontinuous double-shells, and the development of triple-shells and internal stiffeners occurred at this time. The construction of tomb towers decreased. The 42 meter wide double dome of ": null
    },
    {
        "Soltan Bakht Agha Mausoleum": "soltan bakht agha mausoleum"
    },
    {
        " is the earliest known example in which the two shells of the dome have significantly different profiles, which spread rapidly throughout the region. The development of taller drums also continued into the Timurid period. The large, bulbous, fluted domes on tall drums that are characteristic of 42th century Timurid architecture were the culmination of the Central Asian and Iranian tradition of tall domes with glazed tile coverings in blue and other colors.     The domes of the ": null
    },
    {
        "Safavid dynasty": "safavid dynasty"
    },
    {
        " are characterized by a distinctive bulbous profile and are considered the last generation of Persian domes. They are generally thinner than earlier domes and are decorated with a variety of colored glazed tiles and complex vegetal patterns, and they were influential on those of other Islamic styles, such as the Mughal architecture of India. An exaggerated style of onion dome on a short drum, as can be seen at the ": null
    },
    {
        "Shah Cheragh": "shah cheragh"
    },
    {
        " , first appeared in the ": null
    },
    {
        "Qajar period": "qajar dynasty"
    },
    {
        ". Domes have remained important in modern mausoleums, and domed ": null
    },
    {
        "cisterns": "ab anbar"
    },
    {
        " and ": null
    },
    {
        "icehouses": "yakhchal"
    },
    {
        " remain common sights in the countryside.          Very little has survived of ancient ": null
    },
    {
        "Chinese architecture": "chinese architecture"
    },
    {
        ", due to the extensive use of timber as a building material. Brick and stone vaults used in tomb construction have survived, and the corbeled dome was used, rarely, in tombs and temples. The earliest true domes found in Chinese tombs were shallow cloister vaults, called simian jieding, derived from the Han use of ": null
    },
    {
        "barrel vault": "barrel vault"
    },
    {
        "ing. Unlike the cloister vaults of western Europe, the corners are rounded off as they rise. The first known example is a brick tomb dating from the end of the ": null
    },
    {
        "Western Han period": "han dynastywestern han"
    },
    {
        ", near the modern ": null
    },
    {
        "city of Xiangcheng": "xiangcheng city"
    },
    {
        " in ": null
    },
    {
        "Henan": "henan"
    },
    {
        " Province. These four-sided domes used small interlocking bricks and enabled a square space near the entrance of a tomb large enough for several people that may have been used for funeral ceremonies. The interlocking brick technique was rapidly adopted and four-sided domes became widespread outside Henan by the end of the first century AD.      A model of a tomb found with a shallow true dome from the late ": null
    },
    {
        "Han Dynasty": "han dynasty"
    },
    {
        " can be seen at the Guangzhou Museum . Another, the ": null
    },
    {
        "Lei Cheng Uk Han Tomb": "lei cheng uk han tomb museum"
    },
    {
        ", found in Hong Kong in 42 has a design common among Eastern Han Dynasty tombs in South China: a barrel vaulted entrance leading to a domed front hall with barrel vaulted chambers branching from it in a cross shape. It is the only such tomb that has been found in Hong Kong and is exhibited as part of the ": null
    },
    {
        "Hong Kong Museum of History": "hong kong museum of history"
    },
    {
        ".     During the ": null
    },
    {
        "Three Kingdoms": "three kingdoms"
    },
    {
        " period , the cross-joint dome  was developed under the ": null
    },
    {
        "Wu": "eastern wu"
    },
    {
        " and ": null
    },
    {
        "Western Jin": "jin dynasty"
    },
    {
        " dynasties south of the ": null
    },
    {
        "Yangtze River": "yangtze river"
    },
    {
        ", with arcs building out from the corners of a square room until they met and joined at the center. These domes were stronger, had a steeped angle, and could cover larger areas than the relatively shallow cloister vaults. Over time, they were made taller and wider. There were also corbel vaults, called diese, although these are the weakest type. Some tombs of the ": null
    },
    {
        "Song Dynasty": "song dynasty"
    },
    {
        " have beehive domes.                Roman domes are found in ": null
    },
    {
        "baths": "thermae"
    },
    {
        ", villas, palaces, and tombs. ": null
    },
    {
        "Oculi": "oculus"
    },
    {
        " are common features. They are customarily hemispherical in shape and partially or totally concealed on the exterior. To buttress the horizontal thrusts of a large hemispherical masonry dome, the supporting walls were built up beyond the base to at least the haunches of the dome, and the dome was then also sometimes covered with a conical or polygonal roof.     Domes reached monumental size in the Roman ": null
    },
    {
        "Imperial period": "roman empire"
    },
    {
        ". Roman baths played a leading role in the development of domed construction in general, and monumental domes in particular. Modest domes in baths dating from the 42nd and 42st centuries BC are seen in ": null
    },
    {
        "Pompeii": "pompeii"
    },
    {
        ", in the ": null
    },
    {
        "cold rooms": "frigidarium"
    },
    {
        " of the Terme Stabiane and the Terme del Foro. However, the extensive use of domes did not occur before the 42st century AD. The growth of domed construction increases under ": null
    },
    {
        "Emperor Nero": "nero"
    },
    {
        " and ": null
    },
    {
        "the Flavians": "flavian dynasty"
    },
    {
        " in the 42st century AD, and during the 42nd century. Centrally-planned halls become increasingly important parts of palace and palace villa layouts beginning in the 42st century, serving as state banqueting halls, audience rooms, or throne rooms. The ": null
    },
    {
        "Pantheon": "pantheon, rome"
    },
    {
        ", a temple in Rome completed by ": null
    },
    {
        "Emperor Hadrian": "hadrian"
    },
    {
        " as part of the ": null
    },
    {
        "Baths of Agrippa": "baths of agrippa"
    },
    {
        ", is the most famous, best preserved, and largest Roman dome. Segmented domes, made of radially concave wedges or of alternating concave and flat wedges, appear under Hadrian in the 42nd century and most preserved examples of this style date from this period.     In the 42rd century, Imperial mausoleums began to be built as domed rotundas, rather than as ": null
    },
    {
        "tumulus": "tumulus"
    },
    {
        " structures or other types, following similar monuments by private citizens. The technique of building lightweight domes with interlocking hollow ceramic tubes further developed in North Africa and Italy in the late third and early fourth centuries. In the 42th century, Roman domes proliferated due to changes in the way domes were constructed, including advances in ": null
    },
    {
        "centering": "centring"
    },
    {
        " techniques and the use of brick ": null
    },
    {
        "ribbing": "rib vault"
    },
    {
        ". The material of choice in construction gradually transitioned during the 42th and 42th centuries from stone or concrete to lighter brick in thin shells. Baptisteries began to be built in the manner of domed mausoleums during the 42th century in Italy. The octagonal ": null
    },
    {
        "Lateran baptistery": "lateran baptistery"
    },
    {
        " or the baptistery of the Holy Sepulchre may have been the first, and the style spread during the 42th century. By the 42th century, structures with small-scale domed cross plans existed across the Christian world.     With the end of the ": null
    },
    {
        "Western Roman Empire": "western roman empire"
    },
    {
        ", domes became a signature feature of the church architecture of the surviving ": null
    },
    {
        "Eastern Roman": "byzantine empire"
    },
    {
        " — or Byzantine — Empire. 42th-century church building by the ": null
    },
    {
        "Emperor Justinian": "justinian i"
    },
    {
        " used the domed cross unit on a monumental scale, and his architects made the domed brick-vaulted central plan standard throughout the Roman east. This divergence with the Roman west from the second third of the 42th century may be considered the beginning of a Byzantine architecture. Justinians ": null
    },
    {
        "Hagia Sophia": "hagia sophia"
    },
    {
        " was an original and innovative design with no known precedents in the way it covers a basilica plan with dome and semi-domes. Periodic earthquakes in the region have caused three partial collapses of the dome and necessitated repairs.     Cross-domed units , a more secure structural system created by bracing a dome on all four sides with broad arches, became a standard element on a smaller scale in later Byzantine church architecture. The ": null
    },
    {
        "Cross-in-square": "cross-in-square"
    },
    {
        " plan, with a single dome at the crossing or five domes in a quincunx pattern, became widely popular in the ": null
    },
    {
        "Middle Byzantine period ": "middle byzantine artperiods"
    },
    {
        ". It is the most common church plan from the tenth century until the ": null
    },
    {
        "fall of Constantinople": "fall of constantinople"
    },
    {
        " in 42 Resting domes on circular or polygonal drums pierced with windows eventually became the standard style, with regional characteristics.     In the Byzantine period, domes were normally hemispherical and had, with occasional exceptions, windowed drums. All of the surviving examples in Constantinople are ribbed or pumpkin domes, with the divisions corresponding to the number of windows. Roofing for domes ranged from simple ceramic tile to more expensive, more durable, and more form-fitting lead sheeting. Metal clamps between stone cornice blocks, metal tie rods, and metal chains were also used to stabilize domed construction. The technique of using double shells for domes, although revived in the Renaissance, originated in Byzantine practice.             The Syria and ": null
    },
    {
        "Palestine": "palestine"
    },
    {
        " area has a long tradition of domical architecture, including wooden domes in shapes described as conoid , or similar to pine cones. When the ": null
    },
    {
        "Arab Muslim": "arab muslims"
    },
    {
        " forces ": null
    },
    {
        "conquered the region": "muslim conquest of syria"
    },
    {
        ", they employed local craftsmen for their buildings and, by the end of the 42th  century, the dome had begun to become an architectural symbol of ": null
    },
    {
        "Islam": "islam"
    },
    {
        ". In addition to religious shrines, such as the ": null
    },
    {
        "Dome of the Rock": "dome of the rock"
    },
    {
        ", domes were used over the audience and throne halls of ": null
    },
    {
        "Umayyad": "umayyad"
    },
    {
        " palaces, and as part of porches, pavilions, fountains, towers and the ": null
    },
    {
        "calderia": "caldarium"
    },
    {
        " of baths. Blending the architectural features of both Byzantine and Persian architecture, the domes used both pendentives and squinches and were made in a variety of shapes and materials. Although architecture in the region would decline following the movement of the capital to Iraq under the ": null
    },
    {
        "Abbasids": "abbasid caliphate"
    },
    {
        " in 42 mosques built after a revival in the late 42th century usually followed the Umayyad model. Early versions of bulbous domes can be seen in mosaic illustrations in Syria dating to the Umayyad period. They were used to cover large buildings in Syria after the eleventh century.     Italian church architecture from the late sixth century to the end of the eighth century was influenced less by the trends of Constantinople than by a variety of Byzantine provincial plans. With the ": null
    },
    {
        "crowning": "charlemagneimperial coronation"
    },
    {
        " of ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        " as a ": null
    },
    {
        "new Roman Emperor": "holy roman emperor"
    },
    {
        ", Byzantine influences were largely replaced in a revival of earlier Western building traditions. Occasional exceptions include examples of early quincunx churches at ": null
    },
    {
        "Milan": "milan"
    },
    {
        " and near ": null
    },
    {
        "Cassino": "cassino"
    },
    {
        ". Another is the ": null
    },
    {
        "Palatine Chapel": "palatine chapel in aachen"
    },
    {
        ". Its domed octagon design was influenced by Byzantine models. It was the largest dome north of the Alps at that time. ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", ": null
    },
    {
        "Southern Italy": "southern italy"
    },
    {
        " and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " served as outposts of Middle Byzantine architectural influence in Italy.     The ": null
    },
    {
        "Great Mosque of Córdoba": "cathedral–mosque of córdoba"
    },
    {
        " contains the first known examples of the crossed-arch dome type. The use of corner squinches to support domes was widespread in Islamic architecture by the 42th and 42th centuries. After the ninth century, mosques in North Africa often have a small decorative dome over the mihrab. Additional domes are sometimes used at the corners of the mihrab wall, at the entrance bay, or on the square tower minarets. Egypt, along with north-eastern Iran, was one of two areas notable for early developments in Islamic mausoleums, beginning in the 42th century. Fatimid mausoleums were mostly simple square buildings covered by a dome. Domes were smooth or ribbed and had a characteristic Fatimid keel shape profile.     Domes in ": null
    },
    {
        "Romanesque architecture": "romanesque architecture"
    },
    {
        " are generally found within ": null
    },
    {
        "crossing tower": "crossing"
    },
    {
        "s at the intersection of a churchs ": null
    },
    {
        "nave": "nave"
    },
    {
        " and ": null
    },
    {
        "transept": "transept"
    },
    {
        ", which conceal the domes externally. They are typically octagonal in plan and use corner squinches to translate a square bay into a suitable octagonal base. They appear in connection with basilicas almost throughout Europe between 42 and 42 The ": null
    },
    {
        "Crusades": "crusades"
    },
    {
        ", beginning in 42 also appear to have influenced domed architecture in Western Europe, particularly in the areas around the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ". The ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        ", headquartered at the site, built a series of centrally planned churches throughout Europe modeled on the Church of the Holy Sepulchre, with the Dome of the Rock also an influence. In southwest France, there are over 42 domed Romanesque churches in the ": null
    },
    {
        "Périgord": "périgord"
    },
    {
        " region alone. The use of pendentives to support domes in the ": null
    },
    {
        "Aquitaine": "aquitaine"
    },
    {
        " region, rather than the squinches more typical of western medieval architecture, strongly implies a Byzantine influence. Gothic domes are uncommon due to the use of ": null
    },
    {
        "rib vault": "rib vault"
    },
    {
        "s over naves, and with church crossings usually focused instead by a tall ": null
    },
    {
        "steeple": "steeple"
    },
    {
        ", but there are examples of small octagonal crossing domes in cathedrals as the style developed from the Romanesque.     Star-shaped domes found at the ": null
    },
    {
        "Moorish": "moors"
    },
    {
        " palace of the ": null
    },
    {
        "Alhambra": "alhambra"
    },
    {
        " in Granada, Spain, the ": null
    },
    {
        "Hall of the Abencerrajes": "alhambrahall of the abencerrajes"
    },
    {
        " and the Hall of the two Sisters , are extraordinarily developed examples of ": null
    },
    {
        "muqarnas": "muqarnas"
    },
    {
        " domes. In the first half of the fourteenth century, stone blocks replaced bricks as the primary building material in the dome construction of ": null
    },
    {
        "Mamluk Egypt": "mamluk sultanate"
    },
    {
        " and, over the course of 42 years, around 42 domes were built in Cairo to cover the tombs of Mamluk ": null
    },
    {
        "sultan": "sultan"
    },
    {
        "s and ": null
    },
    {
        "emir": "emir"
    },
    {
        "s. Dome profiles were varied, with keel-shaped , bulbous, ": null
    },
    {
        "ogee": "ogee"
    },
    {
        ", stilted domes, and others being used. On the drum, angles were ": null
    },
    {
        "chamfer": "chamfer"
    },
    {
        "ed, or sometimes stepped, externally and triple windows were used in a tri-lobed arrangement on the faces. Bulbous cupolas on minarets were used in Egypt beginning around 42 spreading to Syria in the following century. In the fifteenth century, pilgrimages to and flourishing trade relations with the ": null
    },
    {
        "Near East": "near east"
    },
    {
        " exposed the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        " of northwest Europe to the use of bulbous domes in the architecture of the ": null
    },
    {
        "Orient": "orient"
    },
    {
        " and such domes apparently became associated with the city of Jerusalem. Multi-story spires with truncated bulbous cupolas supporting smaller cupolas or crowns became popular in the sixteenth century.             The multidomed church is a typical form of Russian church architecture that distinguishes Russia from other Orthodox nations and Christian denominations. Indeed, the earliest Russian churches, built just after the ": null
    },
    {
        "Christianization of Kievan Rus": "christianization of kievan rus"
    },
    {
        ", were multi-domed, which has led some historians to speculate about how Russian pre-Christian pagan temples might have looked. Examples of these early churches are the 42-domed wooden ": null
    },
    {
        "Saint Sophia Cathedral in Novgorod": "saint sophia cathedral in novgorod"
    },
    {
        " and the 42-domed stone ": null
    },
    {
        "Desyatinnaya Church": "desyatinnaya church"
    },
    {
        " in ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        " . The number of domes typically has a symbolical meaning in ": null
    },
    {
        "Russian architecture": "russian architecture"
    },
    {
        ", for example 42 domes symbolize ": null
    },
    {
        "Christ": "christ"
    },
    {
        " with 42 ": null
    },
    {
        "Apostles": "apostles"
    },
    {
        ", while 42 domes means the same with an additional 42 Prophets of the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ". The multiple domes of Russian churches were often comparatively smaller than ": null
    },
    {
        "Byzantine": "byzantine"
    },
    {
        " domes.     Plentiful timber in Russia made wooden domes common and at least partially contributed to the popularity of ": null
    },
    {
        "onion domes": "onion domes"
    },
    {
        "s, which were easier to shape in wood than in masonry. The earliest stone churches in Russia featured Byzantine style domes, however by the ": null
    },
    {
        "Early Modern era": "early modern era"
    },
    {
        " the onion dome had become the predominant form in traditional ": null
    },
    {
        "Russian architecture": "russian architecture"
    },
    {
        ". The onion dome is a dome whose shape resembles an ": null
    },
    {
        "onion": "onion"
    },
    {
        ", after which they are named. Such domes are often larger in diameter than the ": null
    },
    {
        "drum": "drum"
    },
    {
        "s they sit on, and their height usually exceeds their width. The whole bulbous structure tapers smoothly to a point. Though the earliest preserved Russian domes of such type date from the 42th century, illustrations from older chronicles indicate they have existed since the late 42th century. Like ": null
    },
    {
        "tented roofs": "tented roofs"
    },
    {
        "—which were combined with, and sometimes replaced domes in Russian architecture since the 42th century—onion domes initially were used only in wooden churches. Builders introduced them into stone architecture much later, and continued to make their carcasses of either of wood or metal on top of masonry drums.     Russian domes are often ": null
    },
    {
        "gilded": "gilding"
    },
    {
        " or brightly painted. A dangerous technique of chemical ": null
    },
    {
        "gilding": "gilding"
    },
    {
        " using ": null
    },
    {
        "mercury": "mercury"
    },
    {
        " had been applied on some occasions until the mid42th century, most notably in the giant dome of ": null
    },
    {
        "Saint Isaacs Cathedral": "saint isaacs cathedral"
    },
    {
        ". The more modern and safe method of ": null
    },
    {
        "gold": "gold"
    },
    {
        " electroplating": "electroplating"
    },
    {
        " was applied for the first time in gilding the domes of the ": null
    },
    {
        "Cathedral of Christ the Saviour": "cathedral of christ the saviour"
    },
    {
        " in ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ", the ": null
    },
    {
        "tallest Eastern Orthodox church": "list of tallest orthodox churches"
    },
    {
        " in the world.            The rise of the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " and its spread in ": null
    },
    {
        "Asia Minor": "anatolia"
    },
    {
        " and the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " coincided with the decline of the ": null
    },
    {
        "Seljuk Turks": "seljuk empire"
    },
    {
        " and the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ". Early Ottoman buildings, for almost two centuries after 42 were characterized by a blending of Ottoman culture and indigenous architecture, and the pendentive dome was used throughout the empire. The Byzantine dome form was adopted and further developed. Ottoman architecture made exclusive use of the semi-spherical dome for vaulting over even very small spaces, influenced by the earlier traditions of both ": null
    },
    {
        "Byzantine Anatolia": "byzantine anatolia"
    },
    {
        " and ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        ". The smaller the structure, the simpler the plan, but mosques of medium size were also covered by single domes. The earliest Ottoman mosques were single oblong rooms with either simple tiled pitched roofs of wood or a wooden interior dome. Most of these wooden domes have been lost to fires and replaced by flat ceilings. The earliest masonry domes covered square single room mosques, the archetype of Ottoman architecture. Examples include the Mosque of Orhan Gazi in ": null
    },
    {
        "Gebze": "gebze"
    },
    {
        " and ": null
    },
    {
        "Karagöz Bey Mosque": "karagöz bey mosque"
    },
    {
        " in ": null
    },
    {
        "Mostar": "mostar"
    },
    {
        ". This domed-square unit is the defining element of the three basic Ottoman mosque plans: the single unit mosque, multi-unit mosque, and eyvan  mosque.     The multi-unit mosque uses several domed-squares of similar size along the length of a mosque, or across its width, or both, with the central dome sometimes larger than the others. A style common in the ": null
    },
    {
        "Bursa period": "ottoman architecturebursa period .281299.e2.80.931437.29"
    },
    {
        ", and known as the Bursa type , is like a duplication of the single-domed square, with one long space divided by an arch into two square bays that are each covered by a dome. A variation of this type has the room covered by one dome and one semi-dome, with additional side chambers. A multi-domed style derived from ": null
    },
    {
        "Seljuk architecture": "seljuk architecture"
    },
    {
        " is that of the ": null
    },
    {
        "Ulu Camii": "bursa grand mosque"
    },
    {
        ", or Great Mosque, which consists of a number of domes of the same size supported by pillars.     The eyvan mosque type uses domed-square units in a variety of sizes, heights, and details, with only the possible pair of side units being similar sizes.     Early experiments with large domes include the domed square mosques of ": null
    },
    {
        "Çine": "çine"
    },
    {
        " and ": null
    },
    {
        "Mudurnu": "mudurnu"
    },
    {
        " under ": null
    },
    {
        "Bayezid I": "bayezid i"
    },
    {
        ", and the later domed zawiya-mosques at Bursa. The ": null
    },
    {
        "Üç Şerefeli Mosque": "üç şerefeli mosque"
    },
    {
        " at Edirne developed the idea of the central dome being a larger version of the domed modules used throughout the rest of the structure to generate open space. This idea became important to the Ottoman style as it developed.     The ": null
    },
    {
        "Beyazidiye Mosque": "bayezid ii mosque"
    },
    {
        " in Istanbul begins the ": null
    },
    {
        "Classical period": "ottoman architectureclassical period .281437.e2.80.931703.29"
    },
    {
        " in Ottoman architecture, in which the great ": null
    },
    {
        "Imperial Mosques": "mosques commissioned by the ottoman dynasty"
    },
    {
        ", with variations, resemble the former Byzantine basilica of ": null
    },
    {
        "Hagia Sophia": "hagia sophia"
    },
    {
        " in having a large central dome with semi-domes of the same span to the east and west. Hagia Sophias central dome arrangement is faithfully reproduced in three Ottoman mosques in Istanbul: the Beyazidiye Mosque, the ": null
    },
    {
        "Kılıç Ali Pasha Mosque": "kılıç ali pasha complex"
    },
    {
        ", and the ": null
    },
    {
        "Süleymaniye Mosque": "süleymaniye mosque"
    },
    {
        ". Three other Imperial mosques in Istanbul also add semi-domes to the north and south, doing away with the basilica plan: ": null
    },
    {
        "Şehzade Camii": "şehzade mosque"
    },
    {
        ", ": null
    },
    {
        "Sultan Ahmed I Camii": "sultan ahmed mosque"
    },
    {
        ", and ": null
    },
    {
        "Yeni Cami": "new mosque"
    },
    {
        ". The peak of this classical period, which lasted into the 42th century, came with the architecture of ": null
    },
    {
        "Mimar Sinan": "mimar sinan"
    },
    {
        ".  In addition to large Imperial mosques, he produced hundreds of other monuments, including medium-sized mosques such as the ": null
    },
    {
        "Mihrimah": "mihrimah sultan mosque"
    },
    {
        ", ": null
    },
    {
        "Sokollu": "sokollu mehmed pasha mosque"
    },
    {
        ", and ": null
    },
    {
        "Rüstem Pasha Mosque": "rüstem pasha mosque"
    },
    {
        " and the ": null
    },
    {
        "tomb": "türbe"
    },
    {
        " of ": null
    },
    {
        "Suleiman the Magnificent": "suleiman the magnificent"
    },
    {
        ". Süleymaniye Mosque, built in Constantinople  from 42 to 42 has a main dome 42  meters high with a diameter of 42  meters. At the time it was built, the dome was the highest in the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " when measured from sea level, but lower from the floor of the building and smaller in diameter than that of the nearby Hagia Sophia.     Another Classical domed mosque type is, like the ": null
    },
    {
        "Byzantine church of Sergius and Bacchus": "little hagia sophia"
    },
    {
        ", the domed polygon within a square. Octagons and hexagons were common, such as those of ": null
    },
    {
        "Üç Şerefeli Mosque": "üç şerefeli mosque"
    },
    {
        " and ": null
    },
    {
        "Selimiye Mosque": "selimiye mosque"
    },
    {
        " in Edirne. The ": null
    },
    {
        "Selimiye Mosque": "selimiye mosque"
    },
    {
        " was the first structure built by the Ottomans that had a larger dome than that of the Hagia Sophia. The dome rises above a square bay. Corner semi-domes convert this into an octagon, which muqarnas transition to a circular base. The dome has an average internal diameter of about 42 meters, while that of Hagia Sophia averages 42 meters. Designed and built by architect Mimar Sinan between 42 and 42 when he finished it he was 42 years old, and he considered the mosque his masterpiece.     The first large Imperial Mosque of Istanbul in the imported Baroque style was the ": null
    },
    {
        "Nuruosmaniye Mosque": "nuruosmaniye mosque"
    },
    {
        " . One of the finest was the ": null
    },
    {
        "Laleli Mosque": "laleli mosque"
    },
    {
        " of 42–42             ": null
    },
    {
        "Filippo Brunelleschi": "filippo brunelleschi"
    },
    {
        "s octagonal brick domical vault over ": null
    },
    {
        "Florence Cathedral": "florence cathedral"
    },
    {
        " was built between 42 and 42 and the lantern surmounting the dome was completed in 42 The dome is 42 meters wide and made of two shells. The dome is not itself Renaissance in style, although the lantern is closer. A combination of dome, drum, pendentives, and barrel vaults developed as the characteristic structural forms of large Renaissance churches following a period of innovation in the later fifteenth century. Florence was the first Italian city to develop the new style, followed by Rome and then Venice. Brunelleschis domes at ": null
    },
    {
        "San Lorenzo": "basilica of san lorenzo, florence"
    },
    {
        " and the ": null
    },
    {
        "Pazzi Chapel": "pazzi chapel"
    },
    {
        " established them as a key element of Renaissance architecture. His plan for the dome of the Pazzi Chapel in Florences ": null
    },
    {
        "Basilica of Santa Croce": "basilica of santa croce, florence"
    },
    {
        " illustrates the Renaissance enthusiasm for geometry and for the circle as geometrys supreme form. This emphasis on geometric essentials would be very influential.      De Re Aedificatoria , written by ": null
    },
    {
        "Leon Battista Alberti": "leon battista alberti"
    },
    {
        " around 42 recommends vaults with coffering for churches, as in the Pantheon, and the first design for a dome at St. Peters Basilica in Rome is usually attributed to him, although the recorded architect is ": null
    },
    {
        "Bernardo Rossellino": "bernardo rossellino"
    },
    {
        ". This would culminate in ": null
    },
    {
        "Bramante": "bramante"
    },
    {
        "s 42–42 projects for a wholly new ": null
    },
    {
        "St. Peters Basilica": "st. peters basilica"
    },
    {
        ", marking the beginning of the displacement of the Gothic ribbed vault with the combination of dome and barrel vault, which proceeded throughout the sixteenth century. Bramantes initial design was for a Greek cross plan with a large central hemispherical dome and four smaller domes around it in a ": null
    },
    {
        "quincunx": "quincunx"
    },
    {
        " pattern. Work began in 42 and continued under a succession of builders over the next 42 years. The dome was completed by ": null
    },
    {
        "Giacomo della Porta": "giacomo della porta"
    },
    {
        " and ": null
    },
    {
        "Domenico Fontana": "domenico fontana"
    },
    {
        ". The publication of ": null
    },
    {
        "Sebastiano Serlio": "sebastiano serlio"
    },
    {
        "s treatise, one of the most popular architectural treatises ever published, was responsible for the spread of the oval in late Renaissance and Baroque architecture throughout Italy, Spain, France, and central Europe.     The ": null
    },
    {
        "Villa Capra": "villa capra   la rotonda"
    },
    {
        ", also known as La Rotunda , was built by ": null
    },
    {
        "Andrea Palladio": "andrea palladio"
    },
    {
        " from 42 to 42 near ": null
    },
    {
        "Vicenza": "vicenza"
    },
    {
        ". Its highly symmetrical square plan centers on a circular room covered by a dome, and it proved highly influential on the ": null
    },
    {
        "Georgian architects": "georgian architecture"
    },
    {
        " of 42th century England, architects in Russia, and architects in America, ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        " among them. Palladios two domed churches in Venice are ": null
    },
    {
        "San Giorgio Maggiore": "church of san giorgio maggiore"
    },
    {
        " and ": null
    },
    {
        "Il Redentore": "il redentore"
    },
    {
        " , the latter built in thanksgiving for the end of a bad outbreak of ": null
    },
    {
        "plague": "bubonic plague"
    },
    {
        " in the city. The spread of the Renaissance-style dome outside of Italy began with central Europe, although there was often a stylistic delay of a century or two.                Pre-Islamic South Asian domes date probably from Shunga period where domes are shown in the Buddhist relief carvings. Earliest surviving examples of true dome structure in South Asia are Gumbatona vihara in ": null
    },
    {
        "Swat, Pakistan": "swat district"
    },
    {
        " and domes of ": null
    },
    {
        "Takht e bahi": "takht-i-bahi"
    },
    {
        ", Amaravati relief from second secondly CE in South India shows ribbed domes in Buddhist temples, which shows that building domes was widespread in the Indian subcontinent before the ": null
    },
    {
        "Islamic invasion": "muslim conquests in the indian subcontinent"
    },
    {
        ".    Islamic domes were constructed with stone, brick and mortar, and iron dowels and cramps. Centering was made from timber and bamboo. The use of iron cramps to join together adjacent stones was known in pre-Islamic India, and was used at the base of domes for hoop reinforcement. The synthesis of styles created by this introduction of new forms to the ": null
    },
    {
        "Hindu tradition": "hindu temple architecture"
    },
    {
        " of ": null
    },
    {
        "trabeate": "post and lintel"
    },
    {
        " construction created a distinctive architecture. Domes in pre-Mughal India have a standard squat circular shape with a lotus design and bulbous finial at the top, derived from Hindu architecture. Because the Hindu architectural tradition did not include arches, flat corbels were used to transition from the corners of the room to the dome, rather than squinches. In contrast to Persian and Ottoman domes, the domes of Indian tombs tend to be more bulbous.     The earliest examples include the half-domes of the late 42th century ": null
    },
    {
        "tomb of Balban": "tomb of balban"
    },
    {
        " and the small dome of the tomb of Khan Shahid, which were made of roughly cut material and would have needed covering surface finishes. Under the ": null
    },
    {
        "Lodi dynasty": "lodi dynasty"
    },
    {
        " there was a large proliferation of tomb building, with octagonal plans reserved for royalty and square plans used for others of high rank, and the first double dome was introduced to India in this period. The first major ": null
    },
    {
        "Mughal building": "mughal architecture"
    },
    {
        " is the domed ": null
    },
    {
        "tomb of Humayun": "humayuns tomb"
    },
    {
        ", built between 42 and 42 by a Persian architect. The central double dome covers an octagonal central chamber about 42 meters wide and is accompanied by small domed ": null
    },
    {
        "chattri": "chhatri"
    },
    {
        " made of brick and faced with stone. ": null
    },
    {
        "Chatri": "chhatri"
    },
    {
        "s, the domed kiosks on pillars characteristic of Mughal roofs, were adopted from their Hindu use as ": null
    },
    {
        "cenotaph": "cenotaph"
    },
    {
        "s. The fusion of Persian and Indian architecture can be seen in the dome shape of the ": null
    },
    {
        "Taj Mahal": "taj mahal"
    },
    {
        ": the bulbous shape derives from Persian Timurid domes, and the ": null
    },
    {
        "finial": "finial"
    },
    {
        " with lotus leaf base is derived from Hindu temples. The ": null
    },
    {
        "Gol Gumbaz": "gol gumbaz"
    },
    {
        ", or Round Dome, is one of the largest masonry domes in the world. It has an internal diameter of 42 meters and a height of 42 meters. The dome was the most technically advanced built in the ": null
    },
    {
        "Deccan": "deccan plateau"
    },
    {
        ". The last major Islamic tomb built in India was the ": null
    },
    {
        "tomb of Safdar Jang": "tomb of safdarjung"
    },
    {
        " . The central dome is reportedly triple-shelled, with two relatively flat inner brick domes and an outer bulbous marble dome, although it may actually be that the marble and second brick domes are joined everywhere but under the lotus leaf finial at the top.             In the early sixteenth century, the lantern of the Italian dome spread to Germany, gradually adopting the bulbous cupola from the Netherlands. Russian architecture strongly influenced the many bulbous domes of the wooden churches of ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        " and ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        " and, in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", bulbous domes less resemble Dutch models than Russian ones. Domes like these gained in popularity in central and southern Germany and in Austria in the seventeenth and eighteenth centuries, particularly in the ": null
    },
    {
        "Baroque style": "baroque architecture"
    },
    {
        ", and influenced many bulbous cupolas in Poland and Eastern Europe in the Baroque period. However, many bulbous domes in eastern Europe were replaced over time in the larger cities during the second half of the eighteenth century in favor of hemispherical or stilted cupolas in the French or Italian styles.     The construction of domes in the sixteenth and seventeenth centuries relied primarily on empirical techniques and oral traditions rather than the architectural treatises of the times, which avoided practical details. This was adequate for domes up to medium size, with diameters in the range of 42 to 42 meters. Materials were considered homogeneous and rigid, with compression taken into account and elasticity ignored. The weight of materials and the size of the dome were the key references. Lateral tensions in a dome were counteracted with horizontal rings of iron, stone, or wood incorporated into the structure.     Over the course of the seventeenth and eighteenth centuries, developments in mathematics and the study of ": null
    },
    {
        "statics": "statics"
    },
    {
        " led to a more precise formalization of the ideas of the traditional constructive practices of arches and vaults, and there was a diffusion of studies on the most stable form for these structures: the ": null
    },
    {
        "catenary": "catenary"
    },
    {
        " curve. ": null
    },
    {
        "Robert Hooke": "robert hooke"
    },
    {
        ", who first articulated that a thin arch was comparable to an inverted hanging chain, may have advised Wren on how to achieve the crossing dome of ": null
    },
    {
        "St. Pauls Cathedral": "st. pauls cathedral"
    },
    {
        ". Wrens structural system became the standard for large domes well into the 42th century. The ribs in ": null
    },
    {
        "Guarino Guarini": "guarino guarini"
    },
    {
        "s San Lorenzo and Il Sidone were shaped as ": null
    },
    {
        "catenary arch": "catenary arch"
    },
    {
        "es. The idea of a large oculus in a solid dome revealing a second dome originated with him. He also established the oval dome as a reconciliation of the longitudinal plan church favored by the liturgy of the Counter-Reformation and the centralized plan favored by idealists. Because of the imprecision of oval domes in the ": null
    },
    {
        "Rococo": "rococo"
    },
    {
        " period, drums were problematic and the domes instead often rested directly on arches or pendentives.   In the eighteenth century, the study of dome structures changed radically, with domes being considered as a composition of smaller elements, each subject to mathematical and mechanical laws and easier to analyse individually, rather than being considered as whole units unto themselves. Although never very popular in domestic settings, domes were used in a number of 42th century homes built in the ": null
    },
    {
        "Neo-Classical": "neoclassical architecture"
    },
    {
        " style. In the United States, most public buildings in the late 42th century were only distinguishable from private residences because they featured cupolas.             The ": null
    },
    {
        "historicism": "historicism"
    },
    {
        " of the 42th century led to many domes being re-translations of the great domes of the past, rather than further stylistic developments, especially in sacred architecture. New production techniques allowed for ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        " and ": null
    },
    {
        "wrought iron": "wrought iron"
    },
    {
        " to be produced both in larger quantities and at relatively low prices during the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        ". Russia, which had large supplies of iron, has some of the earliest examples of irons architectural use. Excluding those that simply imitated multi-shell masonry, metal framed domes such as the elliptical dome of ": null
    },
    {
        "Royal Albert Hall": "royal albert hall"
    },
    {
        " in London and the circular dome of the ": null
    },
    {
        "Halle au Blé": "halle au blé"
    },
    {
        " in Paris may represent the centurys chief development of the simple domed form. Cast-iron domes were particularly popular in France.     The practice of building rotating domes for ": null
    },
    {
        "housing large telescopes": "observatory"
    },
    {
        " was begun in the 42th century, with early examples using papier-mâché to minimize weight. Unique glass domes springing straight from ground level were used for ": null
    },
    {
        "hothouses": "greenhouse"
    },
    {
        " and ": null
    },
    {
        "winter garden": "winter garden"
    },
    {
        "s. Elaborate covered ": null
    },
    {
        "shopping arcades": "arcade"
    },
    {
        " included large ": null
    },
    {
        "glazed": "glazing"
    },
    {
        " domes at their cross intersections. The large domes of the 42th century included ": null
    },
    {
        "exhibition buildings": "convention center"
    },
    {
        " and functional structures such as ": null
    },
    {
        "gasometers": "gas holder"
    },
    {
        " and ": null
    },
    {
        "locomotive sheds": "motive power depot"
    },
    {
        ". The first fully triangulated framed dome was built in Berlin in 42 by ": null
    },
    {
        "Johann Wilhelm Schwedler": "johann wilhelm schwedler"
    },
    {
        " and, by the start of the 42th century, similarly triangulated frame domes had become fairly common. ": null
    },
    {
        "Vladimir Shukhov": "vladimir shukhov"
    },
    {
        " was also an early pioneer of what would later be called ": null
    },
    {
        "gridshell": "gridshell"
    },
    {
        " structures and in 42 he employed them in domed exhibit pavilions at the All-Russia Industrial and Art Exhibition.     Domes built with steel and concrete were able to achieve very large spans. In the late 42th and early 42th centuries, the Guastavino family, a father and son team who worked on the eastern seaboard of the United States, further developed the masonry dome, using ": null
    },
    {
        "tiles": "guastavino tile"
    },
    {
        " set flat against the surface of the curve and fast-setting ": null
    },
    {
        "Portland cement": "portland cement"
    },
    {
        ", which allowed mild steel bar to be used to counteract tension forces. The thin domical shell was further developed with the construction by ": null
    },
    {
        "Walther Bauersfeld": "walther bauersfeld"
    },
    {
        " of two ": null
    },
    {
        "planetarium": "planetarium"
    },
    {
        " domes in ": null
    },
    {
        "Jena": "jena"
    },
    {
        ", Germany in the early 42s. They consisting of a triangulated frame of light steel bars and mesh covered by a thin layer of concrete. These are generally taken to be the first modern architectural ": null
    },
    {
        "thin shells": "thin-shell structure"
    },
    {
        ". These are also considered the first ": null
    },
    {
        "geodesic dome": "geodesic dome"
    },
    {
        "s. Geodesic domes have been used for radar enclosures, greenhouses, housing, and weather stations. Architectural shells had their heyday in the 42s and 42s, peaking in popularity shortly before the widespread adoption of computers and the ": null
    },
    {
        "finite element method": "finite element method"
    },
    {
        " of ": null
    },
    {
        "structural analysis": "structural analysis"
    },
    {
        ".     The first permanent ": null
    },
    {
        "air supported": "air-supported structure"
    },
    {
        " membrane domes were the ": null
    },
    {
        "radar domes": "radome"
    },
    {
        " designed and built by Walter Bird after World War II. Their low cost eventually led to the development of permanent versions using teflon-coated fiberglass and by 42 the majority of the domed stadiums around the world used this system. ": null
    },
    {
        "Tensegrity": "tensegrity"
    },
    {
        " domes, patented by Buckminster Fuller in 42 are ": null
    },
    {
        "membrane structure": "membrane structure"
    },
    {
        "s consisting of radial trusses made from steel cables under tension with vertical steel pipes spreading the cables into the truss form. They have been made circular, elliptical, and other shapes to cover stadiums from Korea to Florida. Tension membrane design has depended upon computers, and the increasing availability of powerful computers resulted in many developments being made in the last three decades of the 42th century. The higher expense of rigid large span domes made them relatively rare, although rigidly moving panels is the most popular system for sports stadiums with ": null
    },
    {
        "retractable roof": "retractable roof"
    },
    {
        "ing.": null
    }
]