[
    {
        "        Donkey Kong 42 is a 42 ": null
    },
    {
        "adventure": "adventure game"
    },
    {
        " platform video game": "platform game"
    },
    {
        " developed by ": null
    },
    {
        "Rare": "rare"
    },
    {
        " for the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        " console, and the first in the  Donkey Kong  series to feature 42D gameplay. As the ": null
    },
    {
        "gorilla": "gorilla"
    },
    {
        " named ": null
    },
    {
        "Donkey Kong": "donkey kong"
    },
    {
        ", the player explores the themed ": null
    },
    {
        "levels": "level"
    },
    {
        " of an island to collect items and rescue ": null
    },
    {
        "his kidnapped friends": "list of donkey kong characters"
    },
    {
        " from ": null
    },
    {
        "King K. Rool": "king k. rool"
    },
    {
        ". The player completes ": null
    },
    {
        "minigames": "minigames"
    },
    {
        " and puzzles as five playable Kong characters—each with its own special abilities—to receive bananas and other collectibles. In a separate ": null
    },
    {
        "multiplayer": "multiplayer video game"
    },
    {
        " mode, up to four players can compete in ": null
    },
    {
        "deathmatch": "deathmatch"
    },
    {
        " and ": null
    },
    {
        "last man standing": "last man standing"
    },
    {
        " games.     Rare, which had previously developed the  Donkey Kong Country  games, began development in 42 A 42-person team, with many members recruited from Rares  Banjo  group, finished the game in 42 when it was published by ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " in North America in November and worldwide in December. It was the first game to require the Nintendo 42 consoles ": null
    },
    {
        "Expansion Pak": "expansion pak"
    },
    {
        ", an accessory that added ": null
    },
    {
        "memory": "random access memory"
    },
    {
        " resources. The games exceptionally large marketing budget included advertisements, ": null
    },
    {
        "sweepstakes": "sweepstake"
    },
    {
        ", and a national tour.     The game received universal acclaim from reviewers and was Nintendos top seller during the 42 ": null
    },
    {
        "holiday season": "holiday season"
    },
    {
        ", with 42  million units sold by 42 It won the 42 ": null
    },
    {
        "E42 Game Critics award": "game critics awards"
    },
    {
        " for Best Platform Game, and multiple awards and nominations from games magazines. Reviewers noted the games exceptional size and length, but criticized its camera controls and emphasis on item collection and backtracking. Some cited its similarity in gameplay and visuals to Rares 42 predecessor,  Banjo-Kazooie , despite Donkey Kong 42 mandatory memory add-on. Critics felt that the game did not meet the revolutionary potential of Donkey Kong Country, but remained among the best 42D platform games on the console.     Donkey Kong 42 is remembered as the emblematic example of Rares collect-a-thon adventure platformers for the tedium of its collection tasks. Donkey Kong 42 was later released on Nintendos ": null
    },
    {
        "Wii U Virtual Console": "wii u virtual console"
    },
    {
        " in 42              Donkey Kong 42 is a 42D ": null
    },
    {
        "platforming": "platform game"
    },
    {
        " adventure game": "adventure game"
    },
    {
        " in which the player, as ": null
    },
    {
        "Donkey Kong": "donkey kong"
    },
    {
        " and ": null
    },
    {
        "his friends": "list of donkey kong characters"
    },
    {
        ", explores an island and collects items to progress through ": null
    },
    {
        "minigame": "minigame"
    },
    {
        "s and puzzles. The game follows a traditional storyline for the series: ": null
    },
    {
        "King K. Rool": "king k. rool"
    },
    {
        " and his reptilian ": null
    },
    {
        "Kremlings": "kremlings"
    },
    {
        " invade the idyllic DK Isle and kidnap Donkey Kongs friends, planning to power up their Blast-O-Matic weapon and destroy the island. After a tutorial, the player embarks as Donkey Kong to rescue the others from their kidnappers and stop K. Rools plan. While exploring the in-game world and completing puzzle minigames, the player collects two types of bananas: normal bananas, which are colored differently for each Kong character, award the player with banana medals and can be traded for access to each worlds ": null
    },
    {
        "boss fight": "boss"
    },
    {
        "; and golden bananas, a certain number of which are required to unlock each new in-game world. Most of the games puzzles are simple, and involve rearranging items, manipulating switches and tiles, or matching items as in the game ": null
    },
    {
        "Concentration": "concentration"
    },
    {
        ". Minigames include races, ": null
    },
    {
        "minecart": "minecart"
    },
    {
        " rides, and barrels that shoot the characters as ": null
    },
    {
        "projectiles": "projectile"
    },
    {
        ". There are five such golden banana-rewarding objectives for each of five playable characters across seven themed worlds42 goals in total, in addition to a connecting ": null
    },
    {
        "overworld": "overworld"
    },
    {
        ". Unlike in prior Donkey Kong games, the objectives can be completed in any order. The player can ": null
    },
    {
        "fast travel": "fast travel"
    },
    {
        " between sections of the ": null
    },
    {
        "level": "level"
    },
    {
        " with designated warp pads and can swap between characters in designated swap barrels. The player also collects banana coins, which can be spent to unlock new weapons and abilities, and other collectibles such as weapon ammunition and blueprint puzzle pieces.  As in other games by the developer, the player often encounters an impossible situation and must eventually backtrack to resolve the impasse after acquiring a new ability.     Donkey Kongs kidnapped friends become playable characters after the player rescues them. Each of the five characters begin with basic abilities and can purchase additional, unique abilities from ": null
    },
    {
        "Cranky Kong": "cranky kong"
    },
    {
        " as the game progresses, which are necessary to solve certain puzzles. For example, Donkey Kong can operate levers, ": null
    },
    {
        "Chunky Kong": "chunky kong"
    },
    {
        " can lift rocks, ": null
    },
    {
        "Tiny Kong": "tiny kong"
    },
    {
        " can crawl through holes, ": null
    },
    {
        "Diddy Kong": "diddy kong"
    },
    {
        " can fly, and ": null
    },
    {
        "Lanky Kong": "lanky kong"
    },
    {
        " can float. The characters are also unique in the projectiles they shoot and the musical instruments they play. For example, some doors can be opened only with Donkey Kongs coconut projectiles and others can be opened only with Diddy Kongs guitar. There are more special abilities than face buttons on the controller, so button combinations are needed to trigger some abilities. Combinations also trigger special modes, including alternative camera angles, a sniper mode, and a snapshot mode which unlocks more in-game secrets. Playable versions of the 42  Donkey Kong  and 42  Jetpac  are hidden within the game, and playing through them is required to finish the story.  Optional hardware support includes a ": null
    },
    {
        "widescreen": "widescreen"
    },
    {
        " mode and ": null
    },
    {
        "Rumble Pak": "rumble pak"
    },
    {
        " compatibility.     Donkey Kong 42 features a separate multiplayer mode with six minigames for two to four players. Monkey Smash is an open arena, ": null
    },
    {
        "deathmatch": "deathmatch"
    },
    {
        "-style minigame in which up to four players find ammo and use their respective projectile weapons from the single-player game to damage other players before losing all their own ": null
    },
    {
        "lives": "health"
    },
    {
        ". Battle Arena is a king-of-the-hill minigame in which players use weapons and explosives to knock each other off the edge of a platform. Each mode has several sub-types in which players can compete based on time or score.              Following their success with the  Donkey Kong Country  games in the mid42s, developer ": null
    },
    {
        "Rare": "rare"
    },
    {
        " built their next ": null
    },
    {
        "Donkey Kong series": "donkey kong"
    },
    {
        " game upon its predecessors gameplay but not as a direct sequel. Rares ": null
    },
    {
        "Gregg Mayles": "gregg mayles"
    },
    {
        " led the effort to create the 42D Donkey Kong. Development began in 42—immediately after the completion of  Donkey Kong Country  42: Dixie Kongs Double Trouble! —for release on the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        "s ": null
    },
    {
        "disk drive add-on": "nintendo 64dd"
    },
    {
        ". It was transitioned for release on the base console after the add-on was delayed and eventually canceled. A team of 42 people worked on the title over the course of three years, and an additional eight members assisted in its later stages. Many developers transitioned from Rares Banjo team, which had worked on  Banjo-Kazooie  and ": null
    },
    {
        "its sequel": "banjo-tooie"
    },
    {
        ". Donkey Kong 42 was built atop the formers ": null
    },
    {
        "game engine": "game engine"
    },
    {
        ".     Rare conceived and originally designed Donkey Kong 42 as a traditional, linear platform game more similar to the Donkey Kong Country games, rather than the  Super Mario 42 -like final result. The Nintendo 42 was still new to Rare, and at the time they did not have a common game engine. The linear version was developed for around 42 months. While 42D graphics prevented Rare from reproducing the detailed ": null
    },
    {
        "pre-rendered": "pre-rendering"
    },
    {
        " graphics of the Donkey Kong Country series, they allowed the company to make characters more expressive.      Donkey Kong 42 was the first of two games to require the Nintendo 42s ": null
    },
    {
        "Expansion Pak": "expansion pak"
    },
    {
        ", a console ": null
    },
    {
        "memory": "computer memory"
    },
    {
        " upgrade that shipped with the game. The upgrade was previously used to power optional, high-resolution textures, but in the case of Donkey Kong 42, it was marketed as improving the games frame rate and rendering of objects at a distance. According to Rare programmer Chris Marlow, the company could not resolve a bug that occurred without the Expansion Pak and thus they were forced, at great expense, to bundle the game with the memory upgrade. Additionally, Nintendo said that the choice to bundle, rather than selling the accessory separately, would avoid consumer confusion.          ": null
    },
    {
        "Grant Kirkhope": "grant kirkhope"
    },
    {
        " composed the games soundtrack, bringing it closer to the tradition of Banjo-Kazooie than to that of ": null
    },
    {
        "David Wise": "david wise"
    },
    {
        "s Donkey Kong Country soundtracks. The ": null
    },
    {
        "DK Rap": "dk rap"
    },
    {
        " , which introduces the Kong character abilities at its outset, was conceived and written by George Andreas, scored and recorded by Kirkhope, and performed by Andreas and Chris Sutherland. It was designed to be lighthearted despite being interpreted as a serious songwriting attempt at the games launch. Nintendo of America ran a DK Rap contest in which fans record their own version of the rap to win prizes including a trip to the companys ": null
    },
    {
        "Redmond": "redmond, washington"
    },
    {
        " headquarters.     Rare announced Donkey Kong 42 with a single screenshot on its website and coverage in the January 42 issue of  Nintendo Power .  Electronic Gaming Monthly  wrote that the title was playable by the ": null
    },
    {
        "42 Electronic Entertainment Expo": "e3 1997"
    },
    {
        ", though  IGN  said that it debuted at ": null
    },
    {
        "the 42 event": "e3 1999"
    },
    {
        ".   The game also demoed at Nintendos 42 ": null
    },
    {
        "Spaceworld": "nintendo space world"
    },
    {
        ". Donkey Kong 42 was expected to be a bestseller, as the consoles crowning achievement in graphics and sound.     Donkey Kong 42 sizable  marketing campaign doubled the typical budget for a major Nintendo release. The campaign included a 42-second commercial played at over 42 movie theaters during the holiday season, and additional advertisements shown on billboards, in print, and over radio. A promotional The Beast Is Back tour brought a truck outfitted with Nintendo games across the United States, and a separate sweepstakes between the series and ": null
    },
    {
        "Dr. Pepper": "dr. pepper"
    },
    {
        " soda advertised in ": null
    },
    {
        "supermarkets": "supermarkets"
    },
    {
        ". Nintendo sought to sell four million copies of the game , including a million of the translucent green Nintendo 42 bundles. Polled retailers expected Donkey Kong 42 to be the top console game sold during the 42 holiday season. The title had little ": null
    },
    {
        "holiday season": "holiday season"
    },
    {
        " competition from Nintendo, who had moved its other releases including  Mario Party 42 ,  Perfect Dark , and  Pokémon Stadium  into the next year.     Rare and Nintendo released the game in North America in November 42 and a worldwide release followed the next month. Accompanying the games launch, Nintendo offered a special bundle of the game and console, including a banana-colored game cartridge, its required Expansion Pak, and a transparent green ": null
    },
    {
        "Jolly Rancher": "jolly rancher"
    },
    {
        "-style Nintendo 42 console.     In April 42 Donkey Kong 42 was digitally rereleased as one of the first Nintendo 42 titles added to Nintendos ": null
    },
    {
        "Wii U Virtual Console": "wii u virtual console"
    },
    {
        " catalog. This was the games first rerelease, as it had not appeared on the ": null
    },
    {
        "Wii Virtual Console": "wii virtual console"
    },
    {
        ".              Donkey Kong 42 received universal acclaim , according to video game ": null
    },
    {
        "review aggregator": "review aggregator"
    },
    {
        " Metacritic": "metacritic"
    },
    {
        ". It was the Nintendo 42s top seller during the 42 holiday season and Nintendos chief defense against competitor ": null
    },
    {
        "Sega": "sega"
    },
    {
        "s introduction of its ": null
    },
    {
        "Dreamcast": "dreamcast"
    },
    {
        " console. As a bestseller, Donkey Kong 42 joined Nintendos ": null
    },
    {
        "Players Choice": "players choice"
    },
    {
        " game selection, where it continued to sell well through the next years holiday season. By 42 Donkey Kong 42 had sold over 42  million units. It won the 42 ": null
    },
    {
        "E42 Game Critics award": "game critics awards"
    },
    {
        " for Best Platform Game, and several annual awards from Nintendo Power, including best overall game of 42 It was additionally nominated for Game of the Year and Console Game of the Year in the ": null
    },
    {
        "Academy of Interactive Arts & Sciences": "academy of interactive arts  &  sciences"
    },
    {
        " 42 ": null
    },
    {
        "Interactive Achievement Awards": "interactive achievement awards"
    },
    {
        ".  GamePro  named it an Editors Choice . IGN described Donkey Kong 42 as the biggest and most ambitious title on the Nintendo 42 as of its release, but very similar to Banjo-Kazooie in its platforming and puzzle design. Similarities between the two games and their themes was a common refrain among reviewers.      Reviewers criticized or had little praise for the games emphasis on collecting items and backtracking an interactive ": null
    },
    {
        "egg hunt": "egg hunt"
    },
    {
        " . This had become a trend in the developers games, and Donkey Kong 42 followed the predictable formula of making players collect multiple sets of items and in full for a special ending. Next Generation also saw the developer creating a habit of backtracking in their games.  GameSpot  was more diplomatic: those who liked collecting items would be titillated by its ": null
    },
    {
        "replay value": "replay value"
    },
    {
        ", and those who did not would be frustrated by its chores. The puzzles and minigames are fun the first time through, according to EGM, but they quickly become worn when replayed with increasingly tighter time restrictions. GameSpot, however, considered parts of Donkey Kong 42 gameplay cerebral , requiring the player to consider several simultaneous tasks to solve later puzzles. Already familiar with the games concepts borrowed from  Super Mario 42 , Ocarina of Time, and Banjo-Kazooie, reviewers considered the players tasks less innovative or interesting to decipher. In retrospective reviews,  Nintendo Life  described the chore of collecting objects excessive and repetitive. They suggested that backtracking, for instance, could be reduced by letting the player switch between characters at any time.     Reviewers noted the games size and length. With an estimated 42 hours in basic gameplay, IGN called it Rares  War and Peace . Big is an understatement, wrote  GameFan , the adventure found within is mastodonic . Reviewers became frequently lost or distracted in its world. Reviewers highlighted the ingenuity of the boss battles, particularly the final battle against K. Rool, although the storys ending disappointed EGM. Reviewers found little entertainment in the multiplayer mode but praised the gameplay variety between the five characters. The controls also frustrated reviewers, between slow movement speed and camera angle issues. For example, characters who become unresponsive to control during their attack animations are vulnerable to encroaching enemies.  Edge  wrote that the lack of camera improvements over Banjo-Kazooie was inexcusable.     Despite its expanded memory resources, reviewers felt that Donkey Kong 42 visuals were only marginallyif at allbetter than that of its contemporary games, such as the previous years  Banjo-Kazooie . In fact,  IGN  avowed that Donkey Kong 42 was not as pretty as Banjo-Kazooie, especially in its water and backgrounds, though it still ranked among the consoles prettiest games. The setting is barren and nondescript at first, and only later introduces lighting effects and richer textures. IGN hoped for more from Rare, and while its reviewer praised the games particle effects , he considered its dynamic lighting overused.  N42 Magazine  said the enhanced effects were most often used for decoration, though they also played some role in puzzles based on illuminating paths. Reviewers noted graphical difficulties even with the extra memory, such as frame rate slowdowns and distant features not appearing in any detail, though overall they considered the added graphical flourishes commendable.  GameSpot  also saw a lack of variety in the games environment.     The characters have Rares emblematic humor, and reviewers praised their individual personalities. Several reviewers noted the degree to which the character personalities showed in their animations. IGN considered Donkey Kong 42 characters less baffling than those of other Rare titles, and sometimes funny. GameFan found that the addition of the three new playable characters to the series offered little personality that would be missed.     While IGN felt that the games music was less clever than Banjo-Kazooie, Kirkhopes soundtrack still delivered a variety of moods and fit the setting. Aural clues in the surround sound and the quality of the underwater effects impressed GameSpot. Reviewers criticized the opening DK Rap  as embarrassing  and among the worst music to feature in a game. GamePro, however, thought it was humorous albeit lowbrow. Eight years later,  Nintendo Life  said the song was loved by some, loathed by others , similar to the game itself.     Reviewers concluded that Donkey Kong 42 lacked the revolutionary potential of Donkey Kong Country but was of a sufficient high quality to sell well during the holiday season. The 42D platform genre doesnt evolve with Donkey Kong 42, AllGame wrote. While hyped fans would be disappointed, IGN felt that Donkey Kong 42 remains an excellent and expansive platformer with an overwhelming amount of things to do. GameFan, on the other hand, was most disappointed by how the game truly offers nothing new and compared its monotony and repetition with the film  Eyes Wide Shut : a big bloated project with not enough brilliant moments to justify the numbness... sitting through the whole thing , it fails to live up to the Rare name . Donkey Kong 42 42D platforming was commonplace by the time of its release and, according to GameSpot, would have fared better as a Nintendo 42 ": null
    },
    {
        "launch title": "launch title"
    },
    {
        ". With its competition considered,  Daily Radar  wrote that Donkey Kong 42 was simply the best 42D platform game on the console. Edge qualified this thought: Donkey Kong 42 was the closest any third-party developer had come to outdoing Nintendos mastery of game structure, but its gameplay was derivative and unimaginative compared to the freedom and flexibility of Nintendos Super Mario 42. Nevertheless, the 42D Donkey Kong was a fine effort... in its own right .          Although they received critical acclaim from critics and players, Rares 42D platformers became notorious for their emphasis on collecting items, and  Kotaku  remembered Donkey Kong 42 as the worst offender with hundreds of color-coded bananas. Other retrospective reviewers agreed. As... Super Mario 42 breathed life into the 42D platforming genre , Electronic Gaming Monthly wrote, Donkey Kong 42 sucked it all out and solidified Rares reputation for making collect-a-thon games. The indie developer behind  A Hat in Time , a spiritual successor to Banjo-Kazooie, blamed Donkey Kong 42 for the collect-a-thon platform adventurer genres decline in popularity.     Retro Gamer and Game Informer both remembered the games reception as mixed , in consideration of its similarities with Banjo-Kazooie and lack of genre-pushing changes. Despite decent reviews, Donkey Kong 42 and Rares subsequent Nintendo 42 releases did not meet the extolment of the companys preceding games, and lackluster sales led to a staff exodus that culminated with the companys acquisition by ": null
    },
    {
        "Microsoft": "microsoft"
    },
    {
        " in 42  The Nintendo 42 was approaching the end of its lifecycle, Electronic Gaming Monthly noted at the games launch, as gamers turned their sights to the Sega Dreamcast and Sony ": null
    },
    {
        "PlayStation 42": "playstation 2"
    },
    {
        ". IGN later named Donkey Kong 42 as worthy of being remade for Nintendos ": null
    },
    {
        "42DS handheld console": "nintendo 3ds"
    },
    {
        ".     The DK Rap is remembered for its negative reception. Renditions of the song later appeared in  Super Smash Bros. Melee  and  Donkey Konga . Over a decade after the games release, Kirkhope said that the rap was enjoying a resurgence in popularity despite its initial unpopularity. In 42 he composed a similar rap for  Yooka-Laylee , a platform game made in homage to Rares oeuvre.                                                                          ": null
    }
]