[
    {
        "              Donkey Kong Country is a 42 ": null
    },
    {
        "platform game": "platform game"
    },
    {
        " developed by ": null
    },
    {
        "Rare": "rare"
    },
    {
        " and published by ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " for the ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        ", as part of the Donkey Kong franchise created by ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        ". The game centers on the duo of ": null
    },
    {
        "Donkey Kong": "donkey kong"
    },
    {
        " and his nephew ": null
    },
    {
        "Diddy Kong": "diddy kong"
    },
    {
        ", who are on a quest to recover their stolen banana hoard from ": null
    },
    {
        "King K. Rool": "king k. rool"
    },
    {
        " and his henchmen Kremlings.     Development began shortly after Rare founders, brothers ": null
    },
    {
        "Tim and Chris Stamper": "tim and chris stamper"
    },
    {
        ", ran experiments with a ": null
    },
    {
        "Silicon Graphics": "silicon graphics"
    },
    {
        " workstation to render 42D ": null
    },
    {
        "sprites": "sprite"
    },
    {
        ". Nintendo became interested in Rares work and acquired half of the company, leading to the production of a game for the SNES utilizing ": null
    },
    {
        "Alias": "poweranimator"
    },
    {
        " and SGI technology. The Stamper brothers expressed interest in creating a standalone Donkey Kong game and assembled a team of 42 developers to work on the game over 42 months. Donkey Kong Country is the first Donkey Kong game that was not produced or directed by the franchises creator ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        ", though he was involved with the project.     Following an aggressive marketing campaign, Donkey Kong Country received critical acclaim and sold more than nine million copies worldwide, making it the ": null
    },
    {
        "third best-selling SNES game": "list of best-selling super nintendo entertainment system video games"
    },
    {
        " and has been cited as one of the ": null
    },
    {
        "greatest video games of all time": "greatest video games of all time"
    },
    {
        ". It was ported to the ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " and ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " consoles, and was made available for Nintendos ": null
    },
    {
        "Virtual Console": "virtual console"
    },
    {
        ". Donkey Kong Country is the first game in the ": null
    },
    {
        "Donkey Kong Country series": "donkey kong country"
    },
    {
        " and was followed by two sequels on the SNES:  Donkey Kong Country 42: Diddys Kong Quest  in 42 and  Donkey Kong Country 42: Dixie Kongs Double Trouble!  in 42 In 42 the game was released as a part of the ": null
    },
    {
        "Super NES Classic Edition": "super nes classic edition"
    },
    {
        ".            Donkey Kong Country is a ": null
    },
    {
        "platforming game": "platforming game"
    },
    {
        " in which the player guides protagonists ": null
    },
    {
        "Donkey Kong": "donkey kong"
    },
    {
        " and ": null
    },
    {
        "Diddy Kong": "diddy kong"
    },
    {
        " through 42 ": null
    },
    {
        "side-scrolling": "side-scrolling"
    },
    {
        " level": "level"
    },
    {
        "s. DK and Diddy are the games main characters and the only playable characters. The player can switch between Kongs if both characters are present. The main modes of travel are running, jumping, and rolling; all of which both characters are capable. DK and Diddy have different advantages; DK defeats enemies more easily and has a handslap move that reveals hidden bunches of bananas, while Diddy is faster, smaller, and can jump higher than DK can.     Levels contain enemies, bananas, and other objects and collectibles. Enemies can be defeated by stomping, rolling, barrel-throwing, and by using an animal. The game has a variety of enemies, each with varying skills and defenses; for example, the crocodile-like ": null
    },
    {
        "Klaptrap": "klaptrap"
    },
    {
        "s must be stomped on because of their forward-facing jaws; rolling into them will cause the player to lose a Kong. If the other Kong takes damage, the player will lose a life and restart the level from the beginning, or at the previous Star Barrel. Bananas are the most common collectible; collecting 42 bananas grants the player an extra life. Bananas also guide the player through the levels and sometimes indicate the presence of another collectible or hidden area. Other collectibles include K-O-N-G letters and extra life balloons, which both help the player gain extra lives. When an item is collected, a corresponding counter briefly scrolls. Barrels are common objects; an element retained from the first Donkey Kong game. Wooden barrels can be picked up and thrown to defeat most enemies and reveal bonus rooms. Barrels with a red DK icon revive a Kong when one is absent. Barrel cannons propel the player-character in the direction the cannon is facing. In later levels, the player must time the releases between barrel cannons to progress. Barrels covered with stars allow the player to resume progress from his or her position in the level.     Bonus rooms are hidden in almost every level; they are accessed by destroying walls and entering hidden barrel cannons. Bonus rooms contain challenges in which the player-character can earn additional lives and items, and sometimes gain new shortcuts through the level.     In many levels, the player can gain assistance from various animal friends : Rambi the ": null
    },
    {
        "rhino": "rhinoceros"
    },
    {
        ", Expresso the ": null
    },
    {
        "ostrich": "ostrich"
    },
    {
        ", Enguarde the ": null
    },
    {
        "swordfish": "swordfish"
    },
    {
        ", Winky the ": null
    },
    {
        "frog": "frog"
    },
    {
        ", and Squawks the ": null
    },
    {
        "parrot": "parrot"
    },
    {
        ". Each animal provides a different type of aid; Rambi is powerful and can defeat most enemies with a swift charge, Expresso can run quickly and jump long distances, Enguarde can skewer most fish with a quick thrust of his ": null
    },
    {
        "bill": "beak"
    },
    {
        ", Winky can jump high and defeat certain enemies the Kongs cannot, and Squawks provides light in dark levels with a ": null
    },
    {
        "lantern": "lantern"
    },
    {
        ". Players can collect Animal Tokens; when three identical tokens are collected, the player-character is transported to a timed bonus level in which the player plays as the animal.     The ": null
    },
    {
        "game world": "game world"
    },
    {
        "s in Donkey Kong Country are themed to resemble ecosystems—jungles, factories, underwater, mountains, treetops, caves, mines and ruins—that are shared with many levels in that world. A series of map screens are used to track the players progress. Between each level, the player can navigate the character to the desired area; if a level has already been completed, the player can return to the map screen. Each level is marked with an icon; unfinished levels are marked by Kremling heads while completed areas are marked by heads of the Kong family members. Each world contains three way-points that house the three other members of the Kong family; ": null
    },
    {
        "Funky Kong": "funky kong"
    },
    {
        ", ": null
    },
    {
        "Candy Kong": "candy kong"
    },
    {
        ", and ": null
    },
    {
        "Cranky Kong": "cranky kong"
    },
    {
        ". Funky is a surfer who operates Funkys Flights , a service that allows the player to visit the overworld map. Candy is Donkey Kongs love interest and operates the save points, which are the only way to save the game in the original SNES version. Cranky is the original arcade Donkey Kong who offers to the player hints and complaints. The last level of each world is a boss battle that takes place in a small arena. When the boss is defeated the player returns to the overworld map.       On a stormy night, Donkey Kong assigns Diddy to guard his hoard of bananas as part of Diddys hero training, and promises to relieve him of the duty at midnight. Later that night, the ": null
    },
    {
        "Kremling": "kremling"
    },
    {
        "s overpower Diddy, seal him in a barrel, and steal all of the bananas, leaving a trail of bananas behind them. The next morning, DK wakes up and realizes he forgot to relieve Diddy. Cranky Kong begins to deride him, and DK resolves to find Diddy and the two Kongs set off to rescue their bananas from the Kremlings.            Before Donkey Kong Countrys production, ": null
    },
    {
        "Rare": "rare"
    },
    {
        "s Tim and Chris Stamper had invested and programmed experiments with a ": null
    },
    {
        "Silicon Graphics": "silicon graphics"
    },
    {
        " Challenge": "sgi challenge"
    },
    {
        " workstation, with the initial intent of developing a boxing game. Although their efforts did not progress beyond the stages of initial development, senior ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " staff who visited their studio at ": null
    },
    {
        "Twycross": "twycross"
    },
    {
        " were impressed with their progress after being shown a working demo. ": null
    },
    {
        "Genyo Takeda": "genyo takeda"
    },
    {
        " was dispatched to Japan to advise then-president of Nintendo ": null
    },
    {
        "Hiroshi Yamauchi": "hiroshi yamauchi"
    },
    {
        " about securing a deal with Rare. Following talks, Nintendo acquired 42% of Rare, which culminated in the production of a new title using Alias and SGI technology, and Rare became a ": null
    },
    {
        "second-party developer": "second-party developer"
    },
    {
        ". The Stampers expressed interest in making a game based on Donkey Kong, for which Nintendo gave permission.     Rare assembled a team of 42 people to work on the game, and according to product manager Dan Owsen, 42 people worked on Donkey Kong Country during its 42-month development cycle. Upon reviewing Rares first playable version of the game, Nintendo directed Rare to significantly reduce the difficulty because they wanted it to appeal to a broad audience and thought the games numerous secrets would provide sufficient challenge to hardcore gamers. Designer ": null
    },
    {
        "Gregg Mayles": "gregg mayles"
    },
    {
        " and his team arranged the stages so players with good timing could flow between obstacles without waiting. At this point, Donkey Kong creator ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        "  though otherwise mostly uninvolved with the project  made some last-minute suggestions, such as Donkey Kongs hand-slap move, that were incorporated into the final game.      The Donkey Kong character was redesigned to have a distinct, three-dimensional appearance. Using the ": null
    },
    {
        "red": "red"
    },
    {
        " necktie": "necktie"
    },
    {
        " introduced in 42s ": null
    },
    {
        "Game Boy": "game boy"
    },
    {
        " version of  Donkey Kong , the character gained a new look that continues to be used in nearly all games featuring him. Until ": null
    },
    {
        "Microsoft": "microsoft"
    },
    {
        "s purchase of Rare in 42 all Nintendo games featuring Donkey Kong credited Rare for the use of their Donkey Kong model. To develop DKs movements in the game, Rare staff spent hours at nearby ": null
    },
    {
        "Twycross Zoo": "twycross zoo"
    },
    {
        " watching and videotaping gorillas. They found that on the rare occasions when the gorillas moved, their movements were completely unsuitable for a fast-paced videogame , and thus DK and Diddy Kongs moving animations were loosely based upon the ": null
    },
    {
        "gallop": "canter and gallopgallop"
    },
    {
        " of horses.     Adapting to the then-cutting-edge Silicon Graphics workstations was a tense challenge for Rare, with a single 42D model requiring ages to render. David Wise reported that the team would often go home at 42PM, and by the next morning the images they were rendering at the time may have completed. The expensive equipment required careful control; Gunn claimed that the SGI machines required a massive ": null
    },
    {
        "air conditioning": "air conditioning"
    },
    {
        " unit to cool them to prevent overheating, whilst the team worked in the summer heat without relief. However, Gunn affirmed they believed the novel result was worth the extensive time required and heat generated by the units.     Rare created a redesign with the intent of updating the appearance of Donkey Kong Jr. for a new audience. However, Nintendo thought the model was too great a departure from Donkey Kong Jr.s original look, and insisted that Rare either rework it to match Donkey Kong Jr.s original appearance or present it as a new character. Mayles decided a new character suited the updated DK universe, so he kept the redesigned model and initially renamed the character Dinky Kong , but after legal advice Rare changed its name to Diddy Kong.          Donkey Kong Country is one of the first games for a mainstream home video game console to use ": null
    },
    {
        "pre-rendered": "pre-rendering"
    },
    {
        " 42D graphics, a technique used in the earlier 42 ": null
    },
    {
        "Finnish": "finland"
    },
    {
        " game  Stardust  for the ": null
    },
    {
        "Amiga": "amiga"
    },
    {
        ", and later in Rares  Killer Instinct , released the same year. Rare took significant financial risks in purchasing the expensive Silicon Graphics equipment used to render the graphics; ": null
    },
    {
        "David Wise": "david wise"
    },
    {
        ", Rares composer from 42 to 42 said the company purchased the workstations for £42 each. Rare developed a new compression technique that allowed them to incorporate more detail and animation for each sprite for a given memory footprint than had been previously achieved on the SNES, which better preserves the pre-rendered graphics. Both Nintendo and Rare call the technique for creating the games graphics Advanced Computer Modelling .       Donkey Kong Country had a US marketing budget of $42 million. To promote the game, ": null
    },
    {
        "Nintendo of America": "nintendo of america"
    },
    {
        " held an online promotional campaign through the Internet service ": null
    },
    {
        "Compuserve": "compuserve"
    },
    {
        " that involved downloadable video samples of the game, a trivia contest in which 42 people participated, and an hour-long ": null
    },
    {
        "online chat": "online chat"
    },
    {
        " conference attended by 42 people, in which ": null
    },
    {
        "Minoru Arakawa": "minoru arakawa"
    },
    {
        ", Peter Main and ": null
    },
    {
        "Howard Lincoln": "howard lincoln"
    },
    {
        " answered questions. A 42-minute VHS tape titled Donkey Kong Country: Exposed was sent to subscribers of  Nintendo Power  magazine. The video, which was hosted by comedian ": null
    },
    {
        "Josh Wolf": "josh wolf"
    },
    {
        ", shows a brief tour of Nintendo of Americas headquarters in ": null
    },
    {
        "Redmond, Washington": "redmond, washington"
    },
    {
        " and footage from the game in the final stages of development. Several game testers provide tips on accessing bonus levels and performing tricks in the game. Various interviews promote the level of graphical complexity as revolutionary for contemporaneous game systems. A segment at the end of the video reminds viewers that the game is available only on Nintendos 42-bit ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        " console and not on rival 42-bit and CD-ROM based consoles  that boasted superior processing power. The tape was regarded as a marketing success that significantly contributed to Donkey Kong Countrys sales.     Nintendo of America partnered with ": null
    },
    {
        "Kelloggs": "kelloggs"
    },
    {
        " for a promotional campaign in which the packaging for Kelloggs breakfast cereals would feature Donkey Kong Country character art and announce a prize giveaway. The campaign ran from the games release in November 42 until April 42       ": null
    },
    {
        "David Wise": "david wise"
    },
    {
        " composed most of the music for Donkey Kong Country, with ": null
    },
    {
        "Eveline Fischer": "eveline fischer"
    },
    {
        " also contributing. One track, composed for Killer Instinct by ": null
    },
    {
        "Robin Beanland": "robin beanland"
    },
    {
        ", was adopted and arranged by Wise for use as Funky Kong’s theme. Wise started composing for the game as a ": null
    },
    {
        "freelance": "freelance"
    },
    {
        " musician; he has said that he originally assumed the music he composed for the game would later be replaced with compositions by a Japanese composer, because he understood the importance of the Donkey Kong license to ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        ". ": null
    },
    {
        "Rare": "rare"
    },
    {
        " later asked Wise to record three jungle ": null
    },
    {
        "demo": "demo"
    },
    {
        " tunes that were merged to become the DK Jungle Swing , the first level ": null
    },
    {
        "track": "track"
    },
    {
        " in the game. Wise said, I guess someone thought the music was suitable, as they offered me a full time position at Rare .     Donkey Kong Country is known for its atmospheric music that mixes natural environmental sounds with prominent ": null
    },
    {
        "melodic": "melody"
    },
    {
        " and percussive accompaniments. It features a wide variety of musical styles that attempt to evoke the environments in which they appear. The music varies throughout the game and includes music from levels set in Africa-inspired jungles, caverns, oceanic reefs, frozen landscapes, and industrial factories. Wise cited ": null
    },
    {
        "Koji Kondo": "koji kondo"
    },
    {
        "s music for the Mario and Zelda games, ": null
    },
    {
        "Tim": "tim follin"
    },
    {
        " and Geoff Follins music for  Plok , ": null
    },
    {
        "synthesizer": "synthesizer"
    },
    {
        "-based film soundtracks released in the 42s, and early-to-mid42s rock and dance music as influences on the soundtrack for Donkey Kong Country. Wise wanted to imitate the sound of the ": null
    },
    {
        "Korg Wavestation": "korg wavestation"
    },
    {
        " synthesiser.     The games ": null
    },
    {
        "soundtrack": "video game music"
    },
    {
        " was released on ": null
    },
    {
        "Compact Disc": "compact disc"
    },
    {
        " under the title DK Jamz. It was sent to news media and retailers in November 42 as a promotional item, and was released to the general public in March 42 DK Jamz consists of 42 tracks; tracks 42 to 42 are completely silent and the remaining two tracks are secret bonus tracks not listed on the disc cover. The soundtrack was also the basis of an ": null
    },
    {
        "OverClocked ReMix": "overclocked remix"
    },
    {
        " collaboration titled Kong in Concert , which Wise later praised.            Donkey Kong Country was very successful upon release in November 42 Within a month of its launch in the United States, its sales reached nearly 42 copies.  It also garnered much praise in retrospective reviews, with an 42 percent approval rating at the review aggregator ": null
    },
    {
        "GameRankings": "gamerankings"
    },
    {
        ". According to some critics, the game saved the Super Nintendo Entertainment system, which faced growing competition from more technically proficient consoles like the ": null
    },
    {
        "Sega CD": "sega cd"
    },
    {
        " and the ": null
    },
    {
        "Sony PlayStation": "playstation"
    },
    {
        ".     Reviewers praised the games vibrant, colourful and groundbreaking graphics. ": null
    },
    {
        "IGN": "ign"
    },
    {
        "s Lucas Thomas expressed surprise that Nintendos 42-bit system could deliver rendered 42D models and praised the detailed character animations, lush backgrounds and the verdant jungle setting of the game.  GamePro  said the game has all the elements of a classic; outstanding graphics, involving game play, and lots of hidden stuff . At review aggregator ": null
    },
    {
        "GameRankings": "gamerankings"
    },
    {
        ", the SNES version received an 42% score, the Game Boy Color version 42%, and the Game Boy Advance version 42%.  Nintendo Power  gave a positive review to the ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " version of the game, saying it was improved with multiplayer minigames and a GB Printer feature , and that although the graphics lack the detail of the classic, theyre still worth going ape over . It was later ranked as the 42th-best game made for a Nintendo system in Nintendo Powers Top 42 Games list in 42  Next Generation  reviewed the SNES version of the game, and called it an amazing cart while noting that the gameplay falls a hair short of the typical Nintendo blockbuster.      The game was awarded GamePros best graphic achievement award at the 42 ": null
    },
    {
        "Consumer Electronics Show": "consumer electronics show"
    },
    {
        ". It won several awards from  Electronic Gaming Monthly , including Best SNES Game, Best Animation, Best Game Duo, and Game of the Year, in their 42 video game awards. It also received a Nintendo Power Award for Best Overall Game of 42 and two Kids Choice awards in 42 and 42 for Favorite Video Game. It is the only video game listed in  Time s top ten Best Products of 42; this achievement is somewhat overshadowed by the games later inclusion in Time 42 list of Top 42 Most Overrated Games of All Time. The game also rated ninth in ": null
    },
    {
        "GameSpy": "gamespy"
    },
    {
        "s 42 list of the 42 most overrated games of all time. Although described as overrated by some critics, the game has appeared on many ": null
    },
    {
        "best video games of all-time": "list of video games considered the best"
    },
    {
        " lists.           Donkey Kong creator ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        " allegedly criticised the game and called its gameplay mediocre. Miyamoto has since addressed these rumors and expressed fondness for the game, stating that he communicated with the Stampers almost daily during the games development. The game eventually sold a total of nine million copies. In the United States alone, its ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " re-release sold 42 copies and earned $42 million by August 42 Between January 42 and August 42 it was the 42th highest-selling game launched for the ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        ", ": null
    },
    {
        "Nintendo DS": "nintendo ds"
    },
    {
        " or ": null
    },
    {
        "PlayStation Portable": "playstation portable"
    },
    {
        " in the US.       Donkey Kong Countrys financial success was a major factor in keeping sales of the ": null
    },
    {
        "SNES": "snes"
    },
    {
        " high at a time when the next generation of consoles, including the ": null
    },
    {
        "Sony PlayStation": "playstation"
    },
    {
        " and the ": null
    },
    {
        "Sega Saturn": "sega saturn"
    },
    {
        ", were being released. The game sold six million units in its first holiday season. After selling nine million units, Donkey Kong Country became the ": null
    },
    {
        "second-best selling SNES game": "list of best-selling super nintendo entertainment system video games"
    },
    {
        " and set a record for the fastest-selling video game of all time. ": null
    },
    {
        "Rare": "rare"
    },
    {
        "s redesign of the Donkey Kong character has been used in all future ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " games featuring him, including his appearances in the  Super Smash Bros.  series and various Mario spinoff titles. Donkey Kong Countrys popularity spawned two direct sequels for SNES;  Donkey Kong Country 42: Diddys Kong Quest  was released the following year to critical acclaim and  Donkey Kong Country 42: Dixie Kongs Double Trouble!  debuted the year after that. ": null
    },
    {
        "Microsoft": "microsoft"
    },
    {
        " acquired Rare in 42 so Nintendo has since maintained the series with  Donkey Kong Country Returns  for the ": null
    },
    {
        "Wii": "wii"
    },
    {
        " and  Donkey Kong Country: Tropical Freeze  for the ": null
    },
    {
        "Wii U": "wii u"
    },
    {
        " and the ": null
    },
    {
        "Nintendo Switch": "nintendo switch"
    },
    {
        ". In addition to starring in Donkey Kong Country 42, the character Diddy Kong was popular enough to feature in his ": null
    },
    {
        "spin-off": "spin-off"
    },
    {
        ";  Diddy Kong Racing  was released for the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        " in 42       In 42 a version of Donkey Kong Country was released for the ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " . The GBC version has a new stage in Chimp Caverns called Necky Nutmare and a redesigned, longer version of Winkys Walkway. Some of the music from the original game was replaced in the GBC version with music that originated in  Donkey Kong Land . In 42 another version of the game was released for the ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        "; this version has increased brightness at the cost of contrast and colour saturation, to make the game easier to see on an unlit LCD screen. Both games have some new features, including new minigames, hidden pictures, and a Time Trial mode. The GBA version also has multiplayer games. Both versions have lower sound fidelity and a number of minor changes; Candy Kong no longer runs a save point so players can save the game in any area.     Donkey Kong Country was re-released on the ": null
    },
    {
        "Virtual Console": "virtual console"
    },
    {
        " for the ": null
    },
    {
        "Wii": "wii"
    },
    {
        " in Oceania on December 42 42 Europe the next day, and in North America on February 42 42 The Donkey Kong Country titles were removed from the Wii Shop Channel in November 42 but were reinstated for the ": null
    },
    {
        "Wii U Virtual Console": "wii u virtual console"
    },
    {
        " in 42 In Europe, Donkey Kong Country was released on the Wii U Virtual Console on October 42 42 and in Japan on November 42 42 On February 42 42 the first three Donkey Kong Country games were released on the Wii U Virtual Console  and were reinstated for the Wii Virtual Console in the United States. On March 42 42 Donkey Kong Country was released for the ": null
    },
    {
        "New Nintendo 42DS": "new nintendo 3ds"
    },
    {
        " Virtual Console.     The game was re-released for the ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " , ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " , ": null
    },
    {
        "Wii": "wii"
    },
    {
        " Virtual Console": "virtual console"
    },
    {
        " , ": null
    },
    {
        "Wii U": "wii u"
    },
    {
        " Virtual Console , ": null
    },
    {
        "New Nintendo 42DS": "new nintendo 3ds"
    },
    {
        " , and is pre-installed on the ": null
    },
    {
        "Super NES Classic Edition": "super nes classic edition"
    },
    {
        " .       ": null
    }
]