[
    {
        "Dorothy Cross is considered one of Irelands leading international artists. Working with diverse media, including ": null
    },
    {
        "sculpture": "sculpture"
    },
    {
        ", ": null
    },
    {
        "photography": "photography"
    },
    {
        ", ": null
    },
    {
        "video": "video"
    },
    {
        " and ": null
    },
    {
        "installation": "installation art"
    },
    {
        ", she represented ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        " at the 42 ": null
    },
    {
        "Venice Biennale": "venice biennale"
    },
    {
        ". Central to her work as a whole are themes of sexual and cultural identity, personal history, memory, and the gaps between the conscious and subconscious.       Cross was born in 42 in ": null
    },
    {
        "Cork": "cork"
    },
    {
        ", ": null
    },
    {
        "Ireland": "republic of ireland"
    },
    {
        ", one of three children of Fergus and Dorothy Cross. Her older brother Tom went on to become a zoologist and professor at University College, Cork, while her older sister Jane was a swimmer who was on a team that set a world relay record at the 42 World Masters Championships. Cross herself was a competitive swimmer in her teens, becoming All-Ireland champion in the 42-meter breaststroke at the age of 42 and going on to win other medals over the next few years.     Cross attended the Crawford Municipal School of Art in Cork before undertaking degree studies at ": null
    },
    {
        "Leicester Polytechnic": "de montfort university"
    },
    {
        ", England, from 42 to 42 She also studied at the ": null
    },
    {
        "San Francisco Art Institute": "san francisco art institute"
    },
    {
        ", California, from 42 to 42 and 42 to 42 where she completed an MFA Degree in printmaking.       Exhibiting regularly since the mid42s, Cross came to mainstream public attention with her first major solo installation, Ebb, at the Douglas Hyde Gallery in ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        ", Ireland. This was followed, in 42 by Powerhouse, at the ICA in Philadelphia, the Hyde Gallery and ": null
    },
    {
        "Camden Arts Centre": "camden arts centre"
    },
    {
        " in London and ": null
    },
    {
        "Kerlin Gallery": "kerlin gallery"
    },
    {
        " in Dublin. Like Ebb, several of the component parts that made up Powerhouse were found objects - many of which had been in her familys possession for years or were located from different environments. These were then incorporated into mixed media pieces for exhibit. Crosss general approach of creating works using found objects has been referred to as poetic amalgamation .     During the early 42s, Cross witnessed a traditional sieve created from stretched cows udder at a local museum in Norway and stated, Seeing that a cow could be used for something other than producing milk was a total revelation. In response, she began producing sculptural works, utilising cured cowhide, cow udders and stuffed snakes, which explored the cultural and symbolic significance of sexuality and subjectivity across cultures. For Cross, the use of udders generated a strange mixture of disgust, hilarity, and excitement. Virgin Shroud  , for example, is a veil made from a cow skin, with the udders forming a crown for the concealed figure; it references both the ": null
    },
    {
        "Virgin Mary": "virgin mary"
    },
    {
        " and ": null
    },
    {
        "Meret Oppenheim": "meret oppenheim"
    },
    {
        "s fur-lined teacup that was a partial inspiration for the piece.  Saddle  incorporates an upturned udder into the seat of a horses saddle.     Cross is perhaps best known for her public installation Ghost Ship in which a disused light ship was illuminated through use of luminous paint, in Scotmans Bay, off ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        "s ": null
    },
    {
        "Dún Laoghaire": "dún laoghaire"
    },
    {
        " Harbour. A recent series, Medusae, includes images of ": null
    },
    {
        "Chironex fleckeri": "chironex fleckeri"
    },
    {
        ", a type of ": null
    },
    {
        "jellyfish": "jellyfish"
    },
    {
        " and was made in collaboration with her brother Tom.     The ": null
    },
    {
        "Irish Museum of Modern Art": "irish museum of modern art"
    },
    {
        " held a major retrospective of her work in 42     An exhibition, View, that took place between September and November 42 at the ": null
    },
    {
        "Kerlin Gallery": "kerlin gallery"
    },
    {
        " in ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        ", ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", included a series of new sculptures and photographs. The works, which are exemplary of the artist’s complex exploration of the connection between humans and the natural world, and that play with material, relationship and time, capture the artist’s ongoing compulsion to agitate possibilities for new perspectives and points of view.       In 42 Cross was awarded an honorary doctorate by University College, Cork. During her years in the United States, she won a prestigious ": null
    },
    {
        "Pollock-Krasner Award": "pollock-krasner foundation"
    },
    {
        " . Her work has been supported by grants from the Wellcome Trust and the ": null
    },
    {
        "Arts Council of Ireland/": "arts council"
    },
    {
        "An Chomhairle Ealaíon": "an chomhairle ealaíon"
    },
    {
        " and Arts Council of England.       42 ": null
    },
    {
        "Battersea Arts Centre": "battersea arts centre"
    },
    {
        ", London - A Sense of Place Eclipse Slippery Slope             42": null
    },
    {
        "ela": "ela"
    },
    {
        " ": null
    }
]