[
    {
        "   A downland is an area of open chalk ": null
    },
    {
        "hill": "hill"
    },
    {
        "s. This term is especially used to describe the ": null
    },
    {
        "chalk": "chalk"
    },
    {
        " countryside in southern England. Areas of downland are often referred to as downs, deriving from the Old English word dun, meaning hill .       Downland is formed when ": null
    },
    {
        "chalk formation": "chalk formation"
    },
    {
        "s are raised above the surrounding rocks. The chalk slowly ": null
    },
    {
        "erodes": "erosion"
    },
    {
        " to form characteristic rolling hills and valleys. As the ": null
    },
    {
        "Cretaceous": "cretaceous"
    },
    {
        " chalk layer in southern England is typically tilted, chalk downland formations often have a marked ": null
    },
    {
        "scarp": "escarpment"
    },
    {
        " slope on one side, which is very steep, and a ": null
    },
    {
        "dip": "escarpment"
    },
    {
        " slope on the other, which is much shallower. Where the downs meet the sea, characteristic white chalk ": null
    },
    {
        "cliff": "cliff"
    },
    {
        "s form, such as the ": null
    },
    {
        "White Cliffs of Dover": "white cliffs of dover"
    },
    {
        " and ": null
    },
    {
        "Beachy Head": "beachy head"
    },
    {
        ".       Chalk deposits are very ": null
    },
    {
        "porous": "porous"
    },
    {
        ", so the height of the ": null
    },
    {
        "water table": "water table"
    },
    {
        " in chalk hills rises in winter and falls in summer. This leads to characteristic chalk downland features such as dry valleys or ": null
    },
    {
        "coombe": "combe"
    },
    {
        "s, and seasonally-flowing streams or ": null
    },
    {
        "winterbournes": "winterbourne"
    },
    {
        ". The modern practice of extracting water from this reservoir, in order to satisfy demand for water, may be putting some of these streams under extreme stress.     In the valleys below the downs there is typically a ": null
    },
    {
        "clay": "clay"
    },
    {
        " soil, and at the interface between the two a springline can occur where water emerges from the porous chalk. Along this line, settlements and farms were often built, as on the higher land no water was available. This is demonstrated very clearly beneath the scarp of the ": null
    },
    {
        "White Horse Hills": "white horse hills"
    },
    {
        ", above the ": null
    },
    {
        "Vale of White Horse": "vale of white horse"
    },
    {
        ". In many chalk downland areas there is no surface water at all other than artificially created ": null
    },
    {
        "dewpond": "dewpond"
    },
    {
        "s.       The ": null
    },
    {
        "soil profile": "soil profile"
    },
    {
        " of chalk downland in England is a thin soil overlaying the ": null
    },
    {
        "parent": "parent material"
    },
    {
        " chalk": "chalk"
    },
    {
        ". Weathering of the chalk has created a characteristic soil known as ": null
    },
    {
        "rendzina": "rendzina"
    },
    {
        ". Unlike many soils in which there are easily distinguished layers or ": null
    },
    {
        "soil horizon": "soil horizon"
    },
    {
        "s, a chalk rendzina soil consists of only a shallow dark ": null
    },
    {
        "humus": "humus"
    },
    {
        " rich surface layer which grades through a lighter brown hillwash containing small pellets of chalk, to the white of the chalk itself. This is largely because of the purity of the chalk, which is about 42% ": null
    },
    {
        "calcium carbonate": "calcium carbonate"
    },
    {
        ", and the consequent absence of soil-building ": null
    },
    {
        "clay": "clay"
    },
    {
        " minerals which are abundant, for example, in valley floors.     Steep slopes on chalk downland develop a ribbed pattern of grass covered horizontal steps a foot or two high. Although subsequently emphasised by cattle and sheep walking along them, these ": null
    },
    {
        "terracettes": "terracettes"
    },
    {
        " were formed by the movement of soil downhill, a process known as ": null
    },
    {
        "soil creep": "soil creep"
    },
    {
        ".            In temperate regions chalk downland is typically ": null
    },
    {
        "calcareous grassland": "calcareous grassland"
    },
    {
        ", a ": null
    },
    {
        "habitat": "habitat"
    },
    {
        " formed by grazing from both ": null
    },
    {
        "livestock": "livestock"
    },
    {
        " and wild animals. Chalk downland is often unsuitable for intensive ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ", ": null
    },
    {
        "horticulture": "horticulture"
    },
    {
        ", or development because of the nutrient-poor, shallow soil and difficult slopes. For this reason downland often survived uncultivated when other, more easily worked land was ploughed or reseeded. This shallow soil structure makes downland ecosystems extremely fragile and easy to destroy. With modern machinery and fertilizing techniques, it has become possible to use some previously uncultivated downland for farming, and the decline of extensive grazing has meant that many areas of downland, neither cultivated nor grazed, revert to ": null
    },
    {
        "scrub": "scrubland"
    },
    {
        " or other less rare habitat, essentially destroying the delicate calcareous grassland. The UK cover of lowland calcareous grassland has suffered a sharp decline in extent since the middle of the twentieth century. There are no comprehensive figures, but a sample of chalk sites in England surveyed in 42 and 42 showed a 42% loss in that period and an assessment of chalk grassland in ": null
    },
    {
        "Dorset": "dorset"
    },
    {
        " found that over 42% had been lost between the mid42s and the early 42s. Much remaining chalk downland has been protected against future development to preserve its unique ": null
    },
    {
        "biodiversity": "biodiversity"
    },
    {
        ".         ": null
    },
    {
        "Berkshire Downs": "berkshire downs"
    },
    {
        " and ": null
    },
    {
        "White Horse Hills": "uffington white horse"
    },
    {
        " Chiltern Hills": "chiltern hills"
    },
    {
        "    Cranborne Chase": "cranborne chase"
    },
    {
        " Dorset Downs": "dorset downs"
    },
    {
        "    Isle of Wight": "isle of wight"
    },
    {
        "    North Downs": "north downs"
    },
    {
        "    Purbeck Hills": "purbeck hills"
    },
    {
        "    Salisbury Plain": "salisbury plain"
    },
    {
        " South Downs": "south downs"
    },
    {
        "        Austin Chalk": "austin chalk"
    },
    {
        " formation, which underlies much of central ": null
    },
    {
        "Texas": "texas"
    }
]