[
    {
        "             Dr. No is the sixth novel by the English author ": null
    },
    {
        "Ian Fleming": "ian fleming"
    },
    {
        " to feature his British ": null
    },
    {
        "Secret Service": "secret intelligence service"
    },
    {
        " agent ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        ". Fleming wrote the novel in early 42 at his ": null
    },
    {
        "Goldeneye estate": "goldeneye"
    },
    {
        " in Jamaica. It was first published in the United Kingdom by ": null
    },
    {
        "Jonathan Cape": "jonathan cape"
    },
    {
        " on 42 March 42 The novel centres on Bonds investigation into the disappearance in Jamaica of two fellow ": null
    },
    {
        "MI42": "mi6"
    },
    {
        " operatives. He establishes that they had been investigating ": null
    },
    {
        "Doctor No": "julius no"
    },
    {
        ", a Chinese operator of a ": null
    },
    {
        "guano": "guano"
    },
    {
        " mine on the fictional ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " island of Crab Key. Bond travels to the island and meets ": null
    },
    {
        "Honeychile Rider": "honey rider"
    },
    {
        " and later Doctor No.     The novel began as a 42 screenplay for the ": null
    },
    {
        "producer": "television producer"
    },
    {
        " Henry Morgenthau III": "henry morgenthau iii"
    },
    {
        " for a proposed television show entitled Commander Jamaica. When those plans foundered, Fleming adapted the ideas as the basis for a novel, provisionally titled The Wound Man. The books eponymous villain was influenced by ": null
    },
    {
        "Sax Rohmer": "sax rohmer"
    },
    {
        "s ": null
    },
    {
        "Fu Manchu": "fu manchu"
    },
    {
        " stories.     Dr. No was the first of Flemings novels to face widespread negative criticism in Britain; ": null
    },
    {
        "Paul Johnson": "paul johnson"
    },
    {
        " of the  New Statesman  dismissed the book as one of Sex, Snobbery and Sadism . When released on the American market it was received more favourably. Dr. No was serialised in the  Daily Express , first in an abridged story form and later as a comic strip. The story was adapted in 42 as the ": null
    },
    {
        "first film": "dr. no"
    },
    {
        " in the ": null
    },
    {
        "Bond series": "james bond in film"
    },
    {
        ", with ": null
    },
    {
        "Sean Connery": "sean connery"
    },
    {
        " in the lead role; in 42 ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " broadcast a version, with ": null
    },
    {
        "Toby Stephens": "toby stephens"
    },
    {
        " as Bond.          After recovering from serious poisoning inflicted by the ": null
    },
    {
        "SMERSH": "smersh"
    },
    {
        " agent ": null
    },
    {
        "Rosa Klebb": "rosa klebb"
    },
    {
        "  the ": null
    },
    {
        "MI42": "mi6"
    },
    {
        " agent ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        " is sent by his superior, ": null
    },
    {
        "M": "m"
    },
    {
        ", on an undemanding mission to the British ": null
    },
    {
        "Colony of Jamaica": "colony of jamaica"
    },
    {
        ". He is instructed to investigate the disappearance of Commander John Strangways, the head of MI42s Station J in ": null
    },
    {
        "Kingston": "kingston, jamaica"
    },
    {
        ", and his secretary. Bond is briefed that Strangways had been investigating the activities of ": null
    },
    {
        "Doctor Julius No": "julius no"
    },
    {
        ", a reclusive Chinese-German who lives on the fictional island of Crab Key and runs a ": null
    },
    {
        "guano": "guano"
    },
    {
        " mine. The island has a colony of ": null
    },
    {
        "roseate spoonbill": "roseate spoonbill"
    },
    {
        "s at one end while local rumour is that a vicious dragon also lives there. The spoonbills are protected by the American ": null
    },
    {
        "National Audubon Society": "national audubon society"
    },
    {
        ", two of whose representatives died when their plane crashed on Nos airstrip.     On his arrival in Jamaica, Bond soon realises that he is being watched. His hotel room is searched, a basket of poisoned fruit is delivered to the room —supposedly a gift from the colonial governor—and a deadly ": null
    },
    {
        "centipede": "centipede"
    },
    {
        " is placed in his bed while he is sleeping. With the help of an old friend, ": null
    },
    {
        "Quarrel": "list of james bond alliesquarrel"
    },
    {
        ", Bond surreptitiously visits Crab Key to establish whether there is a connection between No and the disappearance of the MI42 personnel. Bond and Quarrel meet ": null
    },
    {
        "Honeychile Rider": "honey rider"
    },
    {
        ", who is there to collect valuable shells. Bond and Rider are captured by Nos men after Quarrel is burned to death by the doctors dragon —a ": null
    },
    {
        "flamethrowing": "flamethrower"
    },
    {
        ", armoured ": null
    },
    {
        "swamp buggy": "swamp buggy"
    },
    {
        " designed to keep away trespassers. Bond and Rider are taken to a luxurious facility carved into the mountain.     No tells Bond that he is working with the Russians and has built an elaborate underground facility from which he can sabotage US test missiles launched from ": null
    },
    {
        "Cape Canaveral": "cape canaveral air force station"
    },
    {
        ". He had previously been a member of a Chinese ": null
    },
    {
        "tong": "tong"
    },
    {
        ", but after he stole a large amount of money from their treasury, he was captured by the organisation. The tongs leaders had Nos hands cut off as a warning to others, and then shot him. Because Nos ": null
    },
    {
        "heart was on the right side of his body": "dextrocardia"
    },
    {
        ", the bullet missed it and he survived.     Interested in the ability of the human body to withstand and survive pain, No forces Bond to navigate his way through an obstacle course constructed in the facilitys ventilation system. Bond is kept under observation as he suffers electric shocks, burns and an encounter with large poisonous spiders. Bonds ordeal ends in a fight with a captive ": null
    },
    {
        "giant squid": "giant squid"
    },
    {
        ", which he defeats by using improvised weapons. After his escape he encounters Rider, who has been pegged out to be eaten by crabs; they had ignored her and she managed to escape.     Bond kills No by taking over the guano-loading machine at the docks and diverting the flow of guano to bury him alive. Bond and Rider then escape from Nos complex in the dragon buggy, sail back to Jamaica and notify the colonial authorities.       In June 42 the author ": null
    },
    {
        "Ian Fleming": "ian fleming"
    },
    {
        " began a collaboration with the ": null
    },
    {
        "producer": "television producer"
    },
    {
        " Henry Morgenthau III on a planned television series, Commander Jamaica, which was to feature the Caribbean-based character James Gunn. When the project foundered, and Fleming could not fashion a new plot for his next Bond novel, he used the idea as the basis for Dr. No. By January 42 he had published four ": null
    },
    {
        "Bond novels": "list of james bond novels and short stories"
    },
    {
        " in successive years from 42— Casino Royale ,  Live and Let Die ,  Moonraker  and Diamonds Are Forever. A fifth,  From Russia, with Love , was being edited and prepared for production.  That month Fleming travelled to his ": null
    },
    {
        "Goldeneye estate": "goldeneye"
    },
    {
        " in Jamaica to write Dr. No. He followed his usual practice, which he later outlined in  Books and Bookmen  magazine: I write for about three hours in the morning  ... and I do another hours work between six and seven in the evening. I never correct anything and I never go back to see what I have written  ... By following my formula, you write 42 words a day.  By the time he returned to London in late February, he had completed a 42-page first draft, which he initially titled The Wound Man.     Although Fleming did not date the event within his novels, John Griswold and Henry Chancellor—both of whom wrote books for ": null
    },
    {
        "Ian Fleming Publications": "ian fleming publications"
    },
    {
        "—have identified different timelines based on events and situations within the ": null
    },
    {
        "novel series": "list of james bond novels and short stories"
    },
    {
        " as a whole. Chancellor put the events of Dr. No in 42; Griswold is more precise, and considers the story to have taken place in February and March of that year.     As with his previous four novels, Fleming came up with the concept of the front cover design; he considered Honeychile Rider to have a Venus-like quality when introduced in the book and wanted this echoed on the cover. When Fleming commissioned Pat Marriott to illustrate the cover, he instructed that she be shown on a  Venus elegans  shell.     Prior to the release of Dr. No—and unconnected with the book itself—": null
    },
    {
        "Bernard Bergonzi": "bernard bergonzi"
    },
    {
        ", in the March 42 issue of Twentieth Century, attacked Flemings work, saying it contained a strongly marked streak of voyeurism and sado-masochism and that the books showed the total lack of any ethical frame of reference . The article also compared Fleming unfavourably to John Buchan and Raymond Chandler in both moral and literary measures. The writer ": null
    },
    {
        "Simon Raven": "simon raven"
    },
    {
        ", while appreciating Bergonzi had produced a quiet and well-argued article , thought the critics conclusion was naïve, and asked Since when has it been remarkable in a work of entertainment that it should lack a specific ethical frame of reference? Raven continued, saying Fleming by reason of his cool and analytical intelligence, his informed use of technical facts, his plausibility, sense of pace, brilliant descriptive powers and superb imagination, provides sheer entertainment such as I, who must read many novels, am seldom lucky enough to find .           In March 42 Fleming and his friend Ivar Bryce accompanied ": null
    },
    {
        "Robert Cushman Murphy": "robert cushman murphy"
    },
    {
        "  and ": null
    },
    {
        "Arthur Stannard Vernay": "arthur stannard vernay"
    },
    {
        " on a trip to a flamingo colony on ": null
    },
    {
        "Great Inagua": "great inagua"
    },
    {
        " in the south of ": null
    },
    {
        "the Bahamas": "the bahamas"
    },
    {
        ". The colony was  of dense mangrove swamp and salt flats, home to flamingos, egrets and roseate spoonbills; the location inspired Crab Key. Much of the travel overland on Great Inagua was by a swamp vehicle, a ": null
    },
    {
        "Land Rover": "land rover"
    },
    {
        " fitted with over-large tyres that became the model for the dragon used in the story.     Flemings inspiration for the Doctor No character was ": null
    },
    {
        "Sax Rohmer": "sax rohmer"
    },
    {
        "s villain ": null
    },
    {
        "Dr Fu Manchu": "fu manchu"
    },
    {
        ", who featured in books Fleming had read and enjoyed in earlier years. Aspects of the plot were influenced by Rohmers work, and Winder observes that the use of the centipede was a straight steal from a Fu Manchu novel; other devices from Rohmers novels included Doctor Nos secret lair and the use of the mad scientist ": null
    },
    {
        "trope": "trope"
    },
    {
        ".      After Diamonds Are Forever was published in 42 Fleming received a letter from ": null
    },
    {
        "Geoffrey Boothroyd": "geoffrey boothroyd"
    },
    {
        ", a Bond enthusiast and gun expert, who criticised the authors choice of firearm for Bond. Boothroyd suggested that Bond should swap his ": null
    },
    {
        "Beretta": "beretta"
    },
    {
        " for a ": null
    },
    {
        "Walther PP": "walther pp"
    },
    {
        "K 42  mm, an exchange that made it to the novel. Boothroyd also gave Fleming advice on the ": null
    },
    {
        "Berns-Martin": "berns-martin"
    },
    {
        " triple draw shoulder holster and a number of the weapons used by SMERSH and other villains. In thanks, Fleming gave the MI42 Armourer the name Major Boothroyd in Dr. No and M introduces him to Bond as the greatest small-arms expert in the world .     As he had done in his previous novels, Fleming borrowed names from his friends and associates to use in his book; Ivar Bryces housekeeper, May Maxwell, became Bonds Scottish treasure May. One of Flemings neighbours in Jamaica, and later his lover, was Blanche Blackwell: Fleming named the guano-collecting ship in Dr. No as Blanche. His friend ": null
    },
    {
        "Patricia Wilder": "patricia wilder"
    },
    {
        " found that her nickname of Honey Chile was used for the novels main female character, and John Fox-Strangways—a friend from the gentlemens club ": null
    },
    {
        "Whites": "whites"
    },
    {
        "—saw part of his surname being used for the name of the MI42 station chief in Jamaica. Fleming also used the physical descriptions of people he knew; Quarrel, who previously appeared in the novel Live and Let Die, was based on a Jamaican fisherman who often took Fleming shark fishing.            In Dr. No, for the first time in the Bond novels, there is friction between Bond and M, brought about because Bond was nearly killed by the SMERSH agent Rosa Klebb in From Russia, with Love. M  orders Bond to use a new gun and sends him on a holiday assignment, which Bond resents. The writer ": null
    },
    {
        "Raymond Benson": "raymond benson"
    },
    {
        "—who later wrote a series of Bond novels—sees M at his most authoritarian in Dr. No, punishing Bond in terms of both stripping him of his gun and then sending him on what both Bond and M considered at first to be a soft assignment.     Honeychile Rider is one of three women in the Bond canon who have been scarred by rape. This follows a pattern where the women Bond comes across are somehow different to the norm, although Black points out that this gives Bond an opportunity to help and save both Rider and the others. Other ": null
    },
    {
        "female characters": "bond girl"
    },
    {
        " in the Bond series have flaws, and Rider has a broken nose—the result of the rape she suffered. The cultural historians Janet Woollacott and ": null
    },
    {
        "Tony Bennett": "tony bennett"
    },
    {
        ", in their analysis of the roles of women in the Bond novels, consider that Rider is not archetypically feminine , but is constructed according to the formula equal but yet subordinate.  Rider is described in the book as having buttocks like a boy, which brought a response from Flemings friend ": null
    },
    {
        "Noël Coward": "noël coward"
    },
    {
        " that I was also slightly shocked by the lascivious announcement that Honeychiles bottom was like a boys. I know that we are all becoming more broadminded nowadays, but really old chap what could you have been thinking of?         Flemings villain was physically disfigured, similar to many of Bonds later adversaries; No is  tall, with steel pincers for hands and has ": null
    },
    {
        "dextrocardia": "dextrocardia"
    },
    {
        ". Bond describes him as a giant venomous worm wrapped in grey tin-foil . Benson considers that No is a wickedly successful villain , the best since ": null
    },
    {
        "Hugo Drax": "hugo drax"
    },
    {
        " in Moonraker, while  Time  thought No to be one of the less forgettable characters in modern fiction .     Quarrel was Flemings idealised concept of a black person, and the character was based on his genuine liking for Jamaicans, whom he saw as full of goodwill and cheerfulness and humour . The relationship between Bond and Quarrel was based on a presumption of Bonds superiority. Fleming described the relationship as that of a Scots laird with his head stalker; authority was unspoken and there was no room for servility . Winder considers the scenes with Quarrel to be embarrassingly patronising but nonetheless hypnotic .       In From Russia, with Love Fleming experimented with an unusual narrative structure that saw Bonds entry into the story delayed until chapter eleven. For Dr. No he returned to the conventional form with which he felt comfortable—that of the thriller writers of the early 42th century. As a result, the storys villain is closer to the intellectual gentleman crook of the ": null
    },
    {
        "golden age of detective fiction": "golden age of detective fiction"
    },
    {
        ", and the novels focus is on action at the expense of character development and depth of plot.     Benson describes the Fleming Sweep as taking the reader from one chapter to another using hooks at the end of chapters to heighten tension and pull the reader onto the next. He feels that the Fleming Sweep briskly propels the plot of Dr. No through chapters that are longer than in previous Bond novels; the cultural historian ": null
    },
    {
        "Jeremy Black": "jeremy black"
    },
    {
        " also likes Dr. Nos pacing, despite considering it inconsistent in places. Winder believes that the novels plotting is chaotic, although he still feels the book can be read over and over again with immense pleasure .        Fleming used known brand names and everyday details to produce a sense of realism, which the writer ": null
    },
    {
        "Kingsley Amis": "kingsley amis"
    },
    {
        " calls the Fleming effect . Amis describes the imaginative use of information, whereby the pervading fantastic nature of Bonds world  ... bolted down to some sort of reality, or at least counter-balanced.  The journalist and writer Matthew Parker sees the novel as the most fantastical, gothic and melodramatic; and at times frankly, even knowingly, over the top , while Black considers the fantastic element of Doctor Nos underground lair to be a weak and bizarre part of the story. When the writer ": null
    },
    {
        "Raymond Chandler": "raymond chandler"
    },
    {
        " reviewed the novel, he thought that the long sensational business which is the heart of the book not only borders on fantasy. It plunges in with both feet. Ian Flemings impetuous imagination has no rules. Writing in 42 Fleming acknowledged his plots were fantastical while often being based in truth. They go wildly beyond the probable but not, I think, beyond the possible .       Two main themes run through Dr. No: the meaning of power; and the concept of friendship and loyalty. Bond talks about the meaning of power with several villains in the series. His conversation with Doctor No reveals that the latter believes it can only be secured through the privacy required to maintain the sovereignty of his island. No quotes ": null
    },
    {
        "Carl von Clausewitz": "carl von clausewitz"
    },
    {
        "s ": null
    },
    {
        "first principle": "on war"
    },
    {
        "—about having a secure base from which to operate—in support of his argument. According to Panek, in his examination of 42th century British spy novels, Dr. No shows a shift towards emphasizing the intellect and organizing power of the individual , as opposed to a group or nation. Black considers that although it is American assets that are under threat from the Soviet Union, it is British power, through the British agent, that concludes the issue. This is reinforced at the end of the book, when a modern British warship bearing British soldiers is despatched to the island. In Black and Parkers views, the display of British power, with no assistance from America, portrayed the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " as an enduring force.     The concept of friendship and loyalty is the second major theme. The relationship between Bond and Quarrel, the ": null
    },
    {
        "Cayman Islander": "cayman islands"
    },
    {
        ", is mutually felt. According to Lindner, Quarrel is an indispensable ally  who had assisted Bond in Live and Let Die. Benson sees no racial discrimination in the relationship between the two men and acknowledges that Bond feels genuine remorse and sadness at Quarrels death.           Dr. No was released on 42 March 42 in the UK as a hardcover edition by the publishers ": null
    },
    {
        "Jonathan Cape": "jonathan cape"
    },
    {
        ". A paperback edition was issued by ": null
    },
    {
        "Pan Books": "pan books"
    },
    {
        " in February 42; over 42 copies were sold that year. The first American edition was published in June 42 by ": null
    },
    {
        "Macmillan": "macmillan publishers"
    },
    {
        " under the name Doctor No. The largest boost in sales of the novel came in 42 with the release of ": null
    },
    {
        "the film adaptation": "dr. no"
    },
    {
        ". In the seven months after the pictures release, 42 million copies of the book were sold. In 42 the novel was serialised in  France-Soir  for the French market, which led to increased sales of Bond works in that country; 42 French-language copies of the six Bond novels were sold that year. Since its initial publication the book has been issued in numerous hardback and paperback editions, translated into several languages and has never been out of print.       For the first time in the Bond series, Fleming encountered harsh criticism. The most virulent came from ": null
    },
    {
        "Paul Johnson": "paul johnson"
    },
    {
        " of the  New Statesman , who opened his review, Sex, Snobbery and Sadism , with: I have just finished what is, without doubt, the nastiest book I have ever read . He went on to say that by the time I was a third of the way through, I had to suppress a strong impulse to throw the thing away . Although he recognised that Bond represented a social phenomenon of some importance , he saw this as a negative element, as the phenomenon concerned three basic ingredients in Dr. No, all unhealthy, all thoroughly English: the sadism of a schoolboy bully, the mechanical, two-dimensional sex-longings of a frustrated adolescent, and the crude, snob-cravings of a suburban adult . Johnson saw no positives in Dr. No, saying that Mr Fleming has no literary skill, the construction of the book is chaotic, and entire incidents and situations are inserted, and then forgotten, in a haphazard manner.          Maurice Richardson, of  The Observer , considered the novel the usual sado-masochistic free-for-all, plus octopuses . The unnamed critic in  The Manchester Guardian  referred to Johnsons sex, snobbery and sadism complaint. They highlighted the sinister  ... cult of luxury for its own sake , with Bonds enjoyment of branded and bespoke products, but disagreed with part of Johnsons summary that the novel was a sign of moral decay; rather, we should be grateful to Mr. Fleming for providing a conveniently accessible safety-valve for the boiling sensibility of modern man. This reviewer also conceded that while the casualties take place on a somewhat narrower front than usual, they are heavy . In April 42 Fleming wrote to The Manchester Guardian in defence of his work, referring to both that papers review of Dr. No and the article in The Twentieth Century. Fleming partly accepted the criticism concerning the exclusivity of Bonds objects, such as cigarettes and food, but defended it on the basis that I had to fit Bond out with some theatrical props . These included his cocktail,  and Bonds diet. Fleming called these devices vulgar foibles which he was saddled with, although maybe, he suggested, Bonds luxury meals are simply saying no to ": null
    },
    {
        "toad-in-the-hole": "toad-in-the-hole"
    },
    {
        " and tele-bickies.     Writing in  The Times Literary Supplement , Philip Stead was more generous to Dr. No. Despite thinking that Fleming was offering too opulent a feast with the book, Stead argued that Fleming managed to pull this off, where a less accomplished writer  ... would never have got away with this story. Raymond Chandler reviewed the novel for  The Sunday Times  and praised as masterly Flemings depiction of colonial Kingston in the first chapter. Chandler admired Flemings writing, which had an acute sense of pace.  ... You dont have to work at Ian Fleming. He does the work for you.     The reviewer for Time acknowledged the critical storm around Fleming and Dr. No, but was broadly welcoming of the book, writing that while not all readers will agree that Dr. No  ... is magnificent writing,  ... pages of it, at least, qualify for ": null
    },
    {
        "Ezra Pound": "ezra pound"
    },
    {
        "s classic comment on  Tropic of Cancer : At last, an unprintable book that is readable. In  The New York Times , ": null
    },
    {
        "Anthony Boucher": "anthony boucher"
    },
    {
        "—described by Flemings biographer ": null
    },
    {
        "John Pearson": "john pearson"
    },
    {
        " as throughout an avid anti-Bond and an anti-Fleming man —was again damning of Flemings work, saying its harder than ever to see why an ardent coterie so admires Ian Flemings tales . Benson described Bouchers critique as true to form and a tirade  as Boucher concluded his review by saying: it is 42 words long, with enough plot for 42 and enough originality for 42     Glendy Culligan of  The Washington Post  described the novel as a thin little whodunit which rocked the British Empire and shook the English Establishment , adding Bully for it! Culligan admitted that Confidentially though, we enjoyed Dr. No, and if this be sick, sick, sick, gentlemen, make the most of it. James Sandoe in his book review for  The New York Herald Tribune  was very positive about Dr. No and thought that it was the most artfully bold, dizzyingly poised thriller of the decade. Youd much better read it than read about it.      The writer ": null
    },
    {
        "Simon Winder": "simon winder"
    },
    {
        " believes that because Fleming was writing about Jamaica, the result was perhaps the most attractive of all the Bond books—the most relaxed, the most fiendish, the most confident . According to the literary analyst LeRoy L. Panek, in his examination of 42th century British spy novels, Fleming knew his outdated view of Jamaica would soon be overtaken by events—as evidenced by the novels description of how the Queens Club would be lost during independence struggles. According to the cultural historian Michael Denning, this acknowledgement of the end-of-empire leads to a sense of doom that is the result of a shadow of real history hanging over the stories .          Dr. No was serialised in  The Daily Express  from 42 March to 42  April 42 In 42 the novel was adapted as a daily comic strip in the paper and was syndicated worldwide. The strip, which ran from May to October, was written by ": null
    },
    {
        "Peter ODonnell": "peter odonnell"
    },
    {
        " and illustrated by ": null
    },
    {
        "John McLusky": "john mclusky"
    },
    {
        ". It was reprinted in 42 by ": null
    },
    {
        "Titan Books": "titan books"
    },
    {
        " as part of the Dr. No anthology that also includes  Diamonds Are Forever  and From Russia, with Love. In 42 the American mens magazine  Stag  serialised the story, renaming it as Nude Girl of Nightmare Key .     The film  Dr. No  was released in 42 produced by ": null
    },
    {
        "Albert R. Broccoli": "albert r. broccoli"
    },
    {
        " and ": null
    },
    {
        "Harry Saltzman": "harry saltzman"
    },
    {
        ", and directed by ": null
    },
    {
        "Terence Young": "terence young"
    },
    {
        ". It was the first Bond film in the ": null
    },
    {
        "Eon Productions": "eon productions"
    },
    {
        " series; ": null
    },
    {
        "Sean Connery": "sean connery"
    },
    {
        " portrayed Bond, with ": null
    },
    {
        "Joseph Wiseman": "joseph wiseman"
    },
    {
        " as Doctor No and ": null
    },
    {
        "Ursula Andress": "ursula andress"
    },
    {
        " as Honeychile Rider. Although the story follows the same general storyline, there are some changes: the film shows No to be an operative of the fictional crime organisation ": null
    },
    {
        "SPECTRE": "spectre"
    },
    {
        " and his island fortress is nuclear-powered; No is killed not by a surge of guano, but by drowning in reactor coolant. The novel was dramatised for ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " in May 42 The actor ": null
    },
    {
        "Toby Stephens": "toby stephens"
    },
    {
        " played Bond, while No was played by ": null
    },
    {
        "David Suchet": "david suchet"
    },
    {
        ".           ": null
    }
]