[
    {
        "     An entity is a bounded portion of matter, something that ": null
    },
    {
        "exists": "existence"
    },
    {
        " on its own . It is irrelevant whether it is the actor or the thing created or affected in an action, whether it actually exists or might exist , whether it is present as a copy of the book Harry Potter or absent as the original book Harry Potter of which there are multiple copies.     The term is broad in scope and may refer to animals; natural features like mountains; inanimate objects like tables; numbers or sets as symbols written on a paper; human contrivances like laws, corporations and academic disciplines; or ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " beings like gods and spirits.     The adjectival form is entitative and refers to something considered in its own right.       The word entity is derived from the Latin entitas, which in turn derives from the Latin ens meaning being or existing . Entity may hence literally be taken to mean thing which exists .          Ontology is the study of being, existence and the recognition of entities. The words ontic and entity are derived respectively from the ancient Greek and Latin present participles that mean ": null
    },
    {
        "being": "being"
    },
    {
        " .          In ": null
    },
    {
        "law": "law"
    },
    {
        ", a legal entity is an entity that is capable of bearing legal ": null
    },
    {
        "rights": "rights"
    },
    {
        " and ": null
    },
    {
        "obligation": "obligation"
    },
    {
        "s, such as a ": null
    },
    {
        "natural person": "natural person"
    },
    {
        " or an ": null
    },
    {
        "artificial person": "legal person"
    },
    {
        " .          In ": null
    },
    {
        "politics": "politics"
    },
    {
        ", entity is used as term for territorial divisions of some countries .          In ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ", a disease entity is an illness due to a particular definite cause or to a specific pathological process. While a disease entity is not defined by a ": null
    },
    {
        "syndrome": "syndrome"
    }
]