[
    {
        "        Dragonflight is a ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novel by the American-Irish author ": null
    },
    {
        "Anne McCaffrey": "anne mccaffrey"
    },
    {
        ". It is the first book in the  Dragonriders of Pern  series. Dragonflight was first published by ": null
    },
    {
        "Ballantine Books": "ballantine books"
    },
    {
        " in July 42 It is a ": null
    },
    {
        "fix-up": "fix-up"
    },
    {
        " of ": null
    },
    {
        "novella": "novella"
    },
    {
        "s, including two which made McCaffrey the first woman writer to win a ": null
    },
    {
        "Hugo": "hugo award"
    },
    {
        " and ": null
    },
    {
        "Nebula Award": "nebula award"
    },
    {
        ".     In 42  Locus: The magazine of the science fiction & fantasy field  ranked Dragonflight at number nine among the 42 All-Time Best Fantasy Novels , based on a poll of subscribers.       Two components of Dragonflight were award-winning novellas published by  Analog  science fiction magazine. The first segment, Weyr Search, illustrated by ": null
    },
    {
        "John Schoenherr": "john schoenherr"
    },
    {
        ", had been the cover story for the October 42 issue.  The second segment, Dragonrider, appeared in two parts, beginning in December 42     Weyr Search features a young woman named Lessa being recruited to establish a telepathic bond with a queen dragon at its hatching, thus becoming a dragonrider, and the leader of a Weyr community on the fictional planet ": null
    },
    {
        "Pern": "pern"
    },
    {
        ". Dragonrider features the growth of Lessas queen dragon, Ramoth, and their training together. Analog editor ": null
    },
    {
        "John W. Campbell": "john w. campbell"
    },
    {
        " asked to see dragons fighting Thread , Perns menace from space, and he also suggested time travel. In response, McCaffrey wrote a third story titled Crack Dust, Black Dust , which was not published separately, but provided crucial material for the novel.        Dragonflight takes place in the far future on ": null
    },
    {
        "Pern": "pern"
    },
    {
        ", a planet colonized by humans. The colonists had originally intended to gradually adopt a low-technology agrarian lifestyle, but were forced to move more quickly after they encountered the deadly ": null
    },
    {
        "Thread": "thread"
    },
    {
        " raining down from the sky. By harnessing and riding the indigenous, flying, fire-breathing dragons , the colonists destroyed the Thread in the skies over Pern, creating pockets of safety over its surface, before it was able to burrow into the land and breed. Humanity finally managed to find equilibrium and began to create a thriving culture, society, and economy, eventually expanding right across Perns northern continent. However, when this narrative begins, an unusually long interval between Thread attacks has caused the general population to dismiss the threat as myth and gradually withdraw support from the Weyrs where dragons are bred and trained. By the time of this narrative, only one Weyr remains , maintaining a precarious existence.     Dragons are telepathic and are capable of forming a lifelong bond with one particular human in a process called Impression. Tradition, established thousands of years before the narrative, dictates that selected young humans with empathetic and telepathic talents are taken to the Hatching Grounds as candidates for Impression. The dragons come in several colors which generally correlate with their sizes; blue males, green females, brown males, bronze males, and golden females  – queens. Bronzes, the largest males, are by tradition the only ones who compete to win the queens in their mating flights. The green females are banned from breeding as they produce only small, less talented dragons. The golden queens are not only the largest dragons, they also hold a subtle control over their dragon communities ": null
    },
    {
        "Weyrs": "weyrs"
    },
    {
        ". The Queen sets out on a Mating Flight, pursued by several bronze males; the one who wins and mates with her assumes a leading position among the dragons, and his rider automatically becomes the leader of the human dragon riders. And the passion of the male dragon and queen mating up in the air can telepathically transfer itself to their male and female human partners, inducing them to a passionate human lovemaking .       Dragonflight is the story of ": null
    },
    {
        "Lessa": "lessa"
    },
    {
        ", the sole survivor of the noble ruling family of ": null
    },
    {
        "Ruatha Hold": "ruatha hold"
    },
    {
        " on the northern continent of Pern. When the rest of her family is killed by a cruel usurper, ": null
    },
    {
        "Fax": "fax"
    },
    {
        ", she survives by disguising herself as a drudge , partly through simply adopting a slovenly appearance, but also by using her hereditary telepathic abilities to make others see her as far older and less attractive than she actually is. Her only friend is a watch-wher, a somewhat telepathic animal related to dragons, that guards the Hold. Lessa psychically influences other Hold workers to do less than their best work, or to become clumsy or inefficient, in order to sabotage Ruatha as part of her strategy to make it economically unproductive, so that Fax will renounce it and she can retake her Hold.     ": null
    },
    {
        "Flar": "characters in dragonriders of pernflar"
    },
    {
        ", wingleader at ": null
    },
    {
        "Benden Weyr": "benden weyr"
    },
    {
        ", and rider of the bronze dragon Mnementh, finds Lessa while searching for candidates to impress a new queen dragon. The current queen has a batch of eggs due to hatch shortly, including a crucial golden egg. After killing Fax in single combat, following the rules of the Pernese ": null
    },
    {
        "code duello": "code duello"
    },
    {
        ", he realises that she manipulated him emotionally to kill Fax and engineered Faxs renouncement. Flar recognizes that Lessa possesses both unusually strong psychic abilities and great strength of will. He recognizes her potential to be the strongest Weyrwoman in recent history, and the path to his own leadership at Benden Weyr. Flar convinces a reluctant Lessa to give up her birthright as Lord Holder of Ruatha Hold for the larger domain of the dragonweyr and she agrees to pass the title on to ": null
    },
    {
        "Faxs newborn son": "jaxom"
    },
    {
        " . Flar takes Lessa to Benden Weyr, where she Impresses the queen hatchling Ramoth and becomes the Weyrwoman, the new co-leader of the last active ": null
    },
    {
        "Weyr": "weyr"
    },
    {
        ". On Ramoths first mating flight, Mnementh catches her, and by Weyr tradition, this makes Flar the Weyrleader.     One Weyr by itself is not enough to defend the planet; there had been six, but the other five Weyrs are now empty, deserted since the last Pass centuries before. In a desperate attempt to increase their numbers, a new queen, Prideth, and her rider, Kylara, are sent back  between  times ten turns, to allow Prideth time to mature and reproduce. Lessa travels four hundred turns into the past to bring the five missing Weyrs forward to her present. This is a huge strain for both her and Ramoth. She convinces the dragonriders of the five Weyrs to go with her to their future, and they use the Red Star as a guide to make smaller, less strenuous hops forward in time. This not only provides much needed skilled reinforcements in the battle against Thread, but explains how and why the five Weyrs were abandoned: they came forward in time.       Dragonflight includes the novellas Weyr Search, which won the 42 ": null
    },
    {
        "Hugo Award for Best Novella": "hugo award for best novella"
    },
    {
        "  and Dragonrider, which won the ": null
    },
    {
        "Nebula Award for Best Novella": "nebula award for best novella"
    },
    {
        "  in 42 McCaffrey was the first woman writer to win either award.     In 42 the ": null
    },
    {
        "American Library Association": "american library association"
    },
    {
        " cited the two early Pern trilogies , along with  The Ship Who Sang , when McCaffrey received the annual ": null
    },
    {
        "Margaret A. Edwards Award": "margaret a. edwards award"
    }
]