[
    {
        "           Draught beer, also spelt draft, is ": null
    },
    {
        "beer": "beer"
    },
    {
        " served from a ": null
    },
    {
        "cask": "cask ale"
    },
    {
        " or ": null
    },
    {
        "keg": "keg"
    },
    {
        " rather than from a bottle or can. Draught beer served from a pressurised keg is also known as             Until ": null
    },
    {
        "Joseph Bramah": "joseph bramah"
    },
    {
        " patented the ": null
    },
    {
        "beer engine": "beer engine"
    },
    {
        " in 1785, beer was served directly from the barrel and carried to the customer. The ": null
    },
    {
        "Old English": "old english"
    },
    {
        "  developed into a series of related words including drag, draw, and draught. By the time Bramahs beer pumps became popular, the use of the term draught to refer to the acts of serving or drinking beer was well established and transferred easily to beer served via the hand pumps. In time, the word came to be restricted to only such beer. The usual spelling is now draught in the ": null
    },
    {
        "United Kingdom": "british english"
    },
    {
        ", ": null
    },
    {
        "Ireland": "irish english"
    },
    {
        ", ": null
    },
    {
        "Australia": "australian english"
    },
    {
        ", and ": null
    },
    {
        "New Zealand": "new zealand english"
    },
    {
        "  and more commonly draft in ": null
    },
    {
        "North America": "north america"
    },
    {
        ",  although it can be spelt either way. Regardless of spelling, the word is pronounced  or   depending on the region the speaker is from.     Canned draught is beer served from a pressurised container featuring a ": null
    },
    {
        "widget": "widget"
    },
    {
        ".  Smooth flow  is the name brewers give to draught beers pressurised with a partial nitrogen gas blend.       In 1691, an article in the  London Gazette  mentioned ": null
    },
    {
        "John Lofting": "john lofting"
    },
    {
        ", who held a patent for a ": null
    },
    {
        "fire engine": "fire apparatus"
    },
    {
        ": The said patentee has also projected a very useful engine for starting of beer, and other liquors which will draw from 20 to 30 barrels an hour, which are completely fixed with brass joints and screws at reasonable rates .     In the early 20th century, draught beer started to be served from pressurised containers. Artificial ": null
    },
    {
        "carbonation": "carbonation"
    },
    {
        " was introduced in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " in 1936, with ": null
    },
    {
        "Watney": "james watney"
    },
    {
        "’s experimental ": null
    },
    {
        "pasteurised": "pasteurization"
    },
    {
        " beer ": null
    },
    {
        "Red Barrel": "watney combe  &  reidwatneys red barrel"
    },
    {
        ". Though this method of serving beer did not take hold in the UK until the late 1950s, it did become the favored method in the rest of Europe, where it is known by such terms as en pression. The carbonation method of serving beer subsequently spread to the rest of the world; by the early 1970s the term draught beer almost exclusively referred to beer served under pressure as opposed to the traditional cask or barrel beer.     In Britain, the ": null
    },
    {
        "Campaign for Real Ale": "campaign for real ale"
    },
    {
        " was founded in 1971 to protect traditional—unpressurised—beer and brewing methods. The group devised the term  real ale  to differentiate between beer served from the cask and beer served under pressure. The term real ale has since been expanded to include ": null
    },
    {
        "bottle-conditioned": "bottle conditioning"
    },
    {
        " beer.          Keg beer is often ": null
    },
    {
        "filtered": "filtration"
    },
    {
        " and/or ": null
    },
    {
        "pasteurised": "pasteurization"
    },
    {
        ", both of which are processes that render the ": null
    },
    {
        "yeast": "yeast"
    },
    {
        " inactive.     In brewing parlance, a keg is different from a ": null
    },
    {
        "cask": "cask"
    },
    {
        ". A cask has a tap hole near the edge of the top, and a ": null
    },
    {
        "spile": "spile"
    },
    {
        " hole on the side used for conditioning the unfiltered and unpasteurised beer. A keg has a single opening in the centre of the top to which a flow pipe is attached. Kegs are artificially pressurised after ": null
    },
    {
        "fermentation": "brewingfermenting"
    },
    {
        " with ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        " or a mixture of carbon dioxide and ": null
    },
    {
        "nitrogen": "nitrogen"
    },
    {
        " gas.     Keg has become a term of contempt used by some, particularly in the UK, since the 1960s when pasteurised draught beers started replacing traditional cask beers.     Keg beer was replacing traditional cask ale in all parts of the UK, primarily because it requires less care to handle. Since 1971, CAMRA has conducted a consumer campaign on behalf of those who prefer traditional cask beer. CAMRA has lobbied the ": null
    },
    {
        "British Parliament": "british parliament"
    },
    {
        " to ensure support for ": null
    },
    {
        "cask ale": "cask ale"
    },
    {
        " and ": null
    },
    {
        "microbreweries": "microbrewery"
    },
    {
        " have sprung up to serve those consumers who prefer traditional cask beer.     Pressurised CO 2 in the kegs headspace maintains carbonation in the beer. The CO 2 pressure varies depending on the amount of CO 2 already in the beer and the keg storage temperature. Occasionally the CO 2 gas is blended with nitrogen gas. CO 2 / nitrogen blends are used to allow a higher operating pressure in complex dispensing systems.     Nitrogen is used under high pressure when dispensing dry stouts and other creamy beers because it displaces CO 2 to form a rich tight ": null
    },
    {
        "head": "head"
    },
    {
        " and a less carbonated taste. This makes the beer feel smooth on the palate and gives a foamy appearance. Premixed bottled gas for creamy beers is usually 75% nitrogen and 25% CO 2 .  This premixed gas which only works well with creamy beers is often referred to as Guinness Gas, Beer Gas, or Aligal . Using Beer Gas with other ": null
    },
    {
        "beer styles": "beer style"
    },
    {
        "can cause the last 5% to 10% of the beer in each keg to taste very flat and lifeless. In the UK, the term keg beer would imply the beer is pasteurised, in contrast to unpasteurised cask ale. Some of the newer microbreweries may offer a nitro keg stout which is filtered but not pasteurized.       Cask beer should be stored and served at a cellar temperature of . Once a cask is opened, it should be consumed within three days. Keg beer is given additional cooling just prior to being served either by flash coolers or a remote cooler in the cellar. This chills the beer down to temperatures between .         The words draft and draught have been used as marketing terms to describe ": null
    },
    {
        "canned": "aluminum can"
    },
    {
        " or ": null
    },
    {
        "bottle": "bottle"
    },
    {
        "d beers, implying that they taste and appear like beers from a cask or keg. Commercial brewers use this as a marketing tool although it is incorrect to call any beer not drawn from a cask or keg draught . Two examples are ": null
    },
    {
        "Miller Genuine Draft": "miller genuine draft"
    },
    {
        ", a ": null
    },
    {
        "pale lager": "pale lager"
    },
    {
        " which is produced using a cold filtering system, and ": null
    },
    {
        "Guinness": "guinness"
    },
    {
        " stout in patented Draught-flow cans and bottles. Guinness is an example of beers that use a nitrogen ": null
    },
    {
        "widget": "widget"
    },
    {
        " to create a smooth beer with a very dense ": null
    },
    {
        "head": "beer head"
    },
    {
        ". Guinness has recently replaced the widget system from their bottled draught beer with a coating of cellulose fibres on the inside of the bottle. Statements indicate a new development in bottling technology that enables the mixture of nitrogen and carbon dioxide to be present in the beer without using a widget, making it according to Guinness more drinkable from the bottle.     In some countries, such as ": null
    },
    {
        "Japan": "japan"
    }
]