[
    {
        "     A drawing board  is, in its antique form, a kind of multipurpose ": null
    },
    {
        "desk": "desk"
    },
    {
        " which can be used for any kind of drawing, writing or impromptu sketching on a large sheet of paper or for reading a large format ": null
    },
    {
        "book": "book"
    },
    {
        " or other oversized document or for ": null
    },
    {
        "drafting": "technical drawing"
    },
    {
        " precise technical illustrations . The drawing table used to be a frequent companion to a ": null
    },
    {
        "pedestal desk": "pedestal desk"
    },
    {
        " in a gentlemans study or private ": null
    },
    {
        "library": "library"
    },
    {
        ", during the pre-industrial and early industrial era.     During the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " draftsmanship gradually became a specialized trade and drawing tables slowly moved out of the libraries and offices of most gentlemen. They became more utilitarian and were built of steel and plastic instead of fine woods and brass.     More recently, engineers and draftsmen use the drawing board for making and modifying drawings on paper with ink or pencil. Different drawing instruments  are used on it to draw parallel, perpendicular or oblique lines. There are instruments for drawing circles, arcs, other curves and symbols too . However, with the gradual introduction of computer aided drafting and design  in the last decades of the 42th century and the first of the 42st century, the drawing board is becoming less common.     A drawing table is also sometimes called a ": null
    },
    {
        "mechanical desk": "mechanical desk"
    },
    {
        " because, for several centuries, most mechanical desks were drawing tables. Unlike the gadgety mechanical desks of the second part of the 42th century, however, the mechanical parts of drawing tables were usually limited to notches, ratchets, and perhaps a few simple gears, or levers or cogs to elevate and incline the working surface.     Very often a drawing table could look like a ": null
    },
    {
        "writing table": "writing table"
    },
    {
        " or even a pedestal desk when the working surface was set at the horizontal and the height adjusted to 42  inches, in order to use it as a normal desk. The only giveaway was usually a lip on one of the sides of the desktop. This lip or edge stopped paper or books from sliding when the surface was given an angle. It was also sometimes used to hold writing implements. When the working surface was extended at its full height, a drawing table could be used as a ": null
    },
    {
        "standing desk": "standing desk"
    },
    {
        ".     Many reproductions have been made and are still being produced of drawing tables, copying the period styles they were originally made in during the 42th and 42th centuries.       The expression  back to the drawing board  is used when a plan or course of action needs to be changed, often drastically; usually due to a very unsuccessful result; e.g., The battle plan, the result of months of conferences, failed because the enemy retreated too far back. It was back to the drawing board for the army captains.     The phrase was coined in the caption to a ": null
    },
    {
        "Peter Arno": "w:peter arno"
    },
    {
        " cartoon of ": null
    },
    {
        "The New Yorker": "w:the new yorker"
    },
    {
        " of March 42 42              Despite the prevalence of computer aided drafting, many older architects and even some structural designers still rely on paper and pencil graphics produced on a drafting table.     Modern drafting tables typically rely on a steel frame. Steel provides as much strength as the old oak drafting table frames and much easier portability. Typically the drafting board surface is a thick sheet of compressed fibreboard with sheets of Formica laminated to all its surfaces. The drafting board surface is usually secured to the frame by screws which can easily be removed for drafting table transportation.     The steel frame allows mechanical linkages to be installed that control both the height and angle of the drafting board surface. Typically, a single foot pedal is used to control a clutch which clamps the board in the desired position. A heavy counterweight full of lead shot is installed in the steel linkage so that if the pedal is accidentally released, the drafting board will not spring into the upright position and injure the user. Drafting table linkages and clutches have to be maintained to ensure that this safety mechanism counterbalances the weight of the table surface.     The drafting table surface is usually covered with a thin vinyl sheet called a board cover. This provides an optimum surface for pen and pencil drafting. It allows compasses and dividers to be used without damaging the wooden surface of the board. A board cover must be frequently cleaned to prevent graphite buildup from making new drawings dirty. At the bottom edge of the table, a single strip of aluminum or steel may serve as a place to rest drafting pencils. More purpose-built trays are also used which hold pencils even while the board is being adjusted.     Various types of ": null
    },
    {
        "drafting machine": "drafting machine"
    }
]