[
    {
        "        Drawing is a form of ": null
    },
    {
        "visual art": "visual art"
    },
    {
        " in which a person uses various drawing instruments to mark ": null
    },
    {
        "paper": "paper"
    },
    {
        " or another ": null
    },
    {
        "two-dimensional": "two-dimensional"
    },
    {
        " medium. Instruments include ": null
    },
    {
        "graphite": "graphite"
    },
    {
        " pencil": "pencil"
    },
    {
        "s, ": null
    },
    {
        "pen and ink": "pen and ink"
    },
    {
        ", various kinds of ": null
    },
    {
        "paint": "paint"
    },
    {
        "s, ": null
    },
    {
        "ink": "ink"
    },
    {
        "ed ": null
    },
    {
        "brush": "brush"
    },
    {
        "es, ": null
    },
    {
        "colored pencil": "colored pencil"
    },
    {
        "s, ": null
    },
    {
        "crayon": "crayon"
    },
    {
        "s, ": null
    },
    {
        "charcoal": "charcoal"
    },
    {
        ", ": null
    },
    {
        "chalk": "sidewalk chalk"
    },
    {
        ", ": null
    },
    {
        "pastel": "pastel"
    },
    {
        "s, various kinds of ": null
    },
    {
        "erasers": "erasers"
    },
    {
        ", ": null
    },
    {
        "markers": "marker pen"
    },
    {
        ", ": null
    },
    {
        "stylus": "stylus"
    },
    {
        "es, and various metals . Digital drawing is the act of using a ": null
    },
    {
        "computer": "computer"
    },
    {
        " to draw. Common methods of digital drawing include a stylus or finger on a ": null
    },
    {
        "touchscreen": "touchscreen"
    },
    {
        " device, ": null
    },
    {
        "stylus": "stylus"
    },
    {
        "- or finger-to-": null
    },
    {
        "touchpad": "touchpad"
    },
    {
        ", or in some cases, a ": null
    },
    {
        "mouse": "computer mouse"
    },
    {
        ". There are many digital art ": null
    },
    {
        "programs": "graphics software"
    },
    {
        " and devices.     A drawing instrument releases a small amount of material onto a surface, leaving a visible mark. The most common support for drawing is ": null
    },
    {
        "paper": "paper"
    },
    {
        ", although other materials, such as ": null
    },
    {
        "cardboard": "paperboard"
    },
    {
        ", ": null
    },
    {
        "wood": "wood"
    },
    {
        ", plastic, ": null
    },
    {
        "leather": "leather"
    },
    {
        ", ": null
    },
    {
        "canvas": "canvas"
    },
    {
        ", and ": null
    },
    {
        "board": "lumber"
    },
    {
        ", may be used. Temporary drawings may be made on a ": null
    },
    {
        "blackboard": "blackboard"
    },
    {
        " or ": null
    },
    {
        "whiteboard": "whiteboard"
    },
    {
        " or indeed almost anything. The medium has been a popular and fundamental means of public expression throughout human history. It is one of the simplest and most efficient means of communicating visual ideas.  The wide availability of drawing instruments makes drawing one of the most common artistic activities.     In addition to its more artistic forms, drawing is frequently used in commercial ": null
    },
    {
        "illustration": "illustration"
    },
    {
        ", ": null
    },
    {
        "animation": "traditional animation"
    },
    {
        ", ": null
    },
    {
        "architecture": "architectural drawing"
    },
    {
        ", ": null
    },
    {
        "engineering": "engineering drawing"
    },
    {
        " and ": null
    },
    {
        "technical drawing": "technical drawing"
    },
    {
        ". A quick, freehand drawing, usually not intended as a finished work, is sometimes called a ": null
    },
    {
        "sketch": "sketch"
    },
    {
        ". An ": null
    },
    {
        "artist": "artist"
    },
    {
        " who practices or works in technical drawing may be called a ": null
    },
    {
        "drafter": "drafter"
    },
    {
        ", ": null
    },
    {
        "draftsman": "draftsman"
    },
    {
        " or a ": null
    },
    {
        "draughtsman": "draughtsman"
    },
    {
        ".             Drawing is one of the oldest forms of human expression within the visual arts. It is generally concerned with the marking of lines and areas of tone onto paper/other material, where the accurate representation of the visual world is expressed upon a plane surface.  Traditional drawings were ": null
    },
    {
        "monochrome": "monochrome"
    },
    {
        ", or at least had little colour, See ": null
    },
    {
        "grisaille": "grisaille"
    },
    {
        " and ": null
    },
    {
        "chiaroscuro": "chiaroscuro"
    },
    {
        " while modern colored-pencil drawings may approach or cross a boundary between drawing and painting. In Western terminology, drawing is distinct from painting, even though similar ": null
    },
    {
        "media": "list of artistic mediumsdrawing"
    },
    {
        " often are employed in both tasks. Dry media, normally associated with drawing, such as chalk, may be used in ": null
    },
    {
        "pastel": "pastel"
    },
    {
        " paintings. Drawing may be done with a liquid medium, applied with brushes or pens. Similar supports likewise can serve both: painting generally involves the application of liquid paint onto prepared canvas or panels, but sometimes an ": null
    },
    {
        "underdrawing": "underdrawing"
    },
    {
        " is drawn first on that same support.   Drawing is often exploratory, with considerable emphasis on observation, problem-solving and composition. Drawing is also regularly used in preparation for a painting, further obfuscating their distinction. Drawings created for these purposes are called studies.There are several categories of drawing, including ": null
    },
    {
        "figure drawing": "figure drawing"
    },
    {
        ", ": null
    },
    {
        "cartooning": "cartooning"
    },
    {
        ", ": null
    },
    {
        "doodling": "doodling"
    },
    {
        ", and ": null
    },
    {
        "freehand": "wikt:freehand"
    },
    {
        ". There are also many drawing methods, such as line drawing, stippling, ": null
    },
    {
        "shading": "shading"
    },
    {
        ", the surrealist method of ": null
    },
    {
        "entopic graphomania": "surrealist techniquesentopic graphomania"
    },
    {
        " , and tracing .     A quick, unrefined drawing may be called a  sketch .     In fields outside art, ": null
    },
    {
        "technical drawings": "technical drawing"
    },
    {
        "or plans of buildings, machinery, circuitry and other things are often called drawings even when they have been transferred to another medium by printing.           Drawing is one of the oldest forms of human expression, with evidence for its existence preceding that of written communication.  It is believed that drawing was used as a specialised form of communication before the invention of the written language,  demonstrated by the production of ": null
    },
    {
        "cave and rock paintings": "cave painting"
    },
    {
        " around 30,000 years ago .   2011c   These drawings, known as pictograms, depicted objects and abstract concepts.  The sketches and paintings produced by Neolithic times were eventually stylised and simplified in to symbol systems  and eventually into early ": null
    },
    {
        "writing systems": "bronze age writing"
    },
    {
        ".       Before the widespread availability of paper, 12th-century ": null
    },
    {
        "monks": "monks"
    },
    {
        " in European monasteries used intricate drawings to prepare illustrated, illuminated manuscripts on vellum and parchment. Drawing has also been used extensively in the field of science, as a method of discovery, understanding and explanation.       Drawing diagrams of observations is an important part of scientific study.     In 1609, astronomer ": null
    },
    {
        "Galileo Galilei": "galileo galilei"
    },
    {
        " explained the changing phases of Venus and also the sunspots through his observational telescopic drawings. In 1924, geophysicist ": null
    },
    {
        "Alfred Wegener": "alfred wegener"
    },
    {
        " used illustrations to visually demonstrate the origin of the continents.       Drawing is used to express ones creativity, and therefore has been prominent in the world of art. Throughout much of history, drawing was regarded as the foundation for artistic practice.  Initially, artists used and reused wooden tablets for the production of their drawings. See the discussion on erasable drawing boards and tafeletten in  Following the widespread availability of paper in the 14th century, the use of drawing in the arts increased. At this point, drawing was commonly used as a tool for thought and investigation, acting as a study medium whilst artists were preparing for their final pieces of work.   The ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " brought about a great sophistication in drawing techniques, enabling artists to represent things more realistically than before,  and revealing an interest in geometry and philosophy.      The invention of the first widely available form of ": null
    },
    {
        "photography": "photography"
    },
    {
        " led to a shift in the hierarchy of the arts.  Photography offered an alternative to drawing as a method for accurately representing visual phenomena, and traditional drawing practice was given less emphasis as an essential skill for artists, particularly so in Western society.        Drawing became significant as an art form around the late 15th century, with artists and master engravers such as ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        " and ": null
    },
    {
        "Martin Schongauer": "martin schongauer"
    },
    {
        " , the very first Northern engraver known by name. Schongauer came from Alsace, and was born into a family of goldsmiths. Albrecht Dürer, a master of the next generation, was also the son of a goldsmith.  . Accessed 20 February 2016     Old Master Drawings are often reflect the history of the country in which they were produced, and the fundamental characteristics of a nation at that time. In 17th-century Holland, a Protestant country, there were almost no religious artworks, and, with no King or court, most art was bought privately. Drawings of landscapes or genre scenes were often viewed not as sketches but as highly finished works of art. Italian drawings, however, show the influence of Catholicism and the Church, which played a major role in artistic patronage. The same is often true of French drawings, although in the 17th century the disciplines of French Classicism meant drawings were less Baroque than the more free Italian counterparts, which conveyed a greater sense of movement.      In the 20th century ": null
    },
    {
        "Modernism": "modernism"
    },
    {
        " encouraged imaginative originality  and some artists approach to drawing became less literal, more abstract. World-renowned artists such as Pablo Picasso, Andy Warhol and Jean-Michel Basquiat helped challenge the status quo, with drawing being very much at the centre of their practice, and often re-interpreting traditional technique.      Basquiats drawings were produced in many different mediums, most commonly ink, pencil, felt-tip or marker, and oil-stick, and he drew on any surface that came to hand, such as doors, clothing, refrigerators, walls and baseball helmets.      Modern-day artists such as Tracey Emin observe the legacy and importance of drawing, engraving and print making techniques in their vast array, passed down through millennia.     The centuries have produced a canon of notable artists and draftsmen, each with their own distinct language of drawing, including:   14th, 15th and 16th: ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        " . Accessed 20 February 2016 • ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        " • ": null
    },
    {
        "Hans Holbein the Younger": "hans holbein the younger"
    },
    {
        " • ": null
    },
    {
        "Michelangelo": "michelangelo"
    },
    {
        " • ": null
    },
    {
        "Pisanello": "pisanello"
    },
    {
        " • ": null
    },
    {
        "Raphael": "raphael"
    },
    {
        " Claude": "claude lorrain"
    },
    {
        " • ": null
    },
    {
        "Jacques de Gheyn II": "jacques de gheyn ii"
    },
    {
        " • ": null
    },
    {
        "Guercino": "guercino"
    },
    {
        " • ": null
    },
    {
        "Nicolas Poussin": "nicolas poussin"
    },
    {
        " • ": null
    },
    {
        "Rembrandt": "rembrandt harmenszoon van rijn"
    },
    {
        " • ": null
    },
    {
        "Peter Paul Rubens": "peter paul rubens"
    },
    {
        " • ": null
    },
    {
        "Pieter Saenredam": "pieter saenredam"
    },
    {
        " François Boucher": "françois boucher"
    },
    {
        " • ": null
    },
    {
        "Jean-Honoré Fragonard": "jean-honoré fragonard"
    },
    {
        " • ": null
    },
    {
        "Giovanni Battista Tiepolo": "giovanni battista tiepolo"
    },
    {
        " • ": null
    },
    {
        "Antoine Watteau": "antoine watteau"
    },
    {
        " Aubrey Beardsley": "aubrey beardsley"
    },
    {
        " • ": null
    },
    {
        "Paul Cézanne": "paul cézanne"
    },
    {
        " • ": null
    },
    {
        "Jacques-Louis David": "jacques-louis david"
    },
    {
        " • ": null
    },
    {
        "Honoré Daumier": "honoré daumier"
    },
    {
        " • ": null
    },
    {
        "Edgar Degas": "edgar degas"
    },
    {
        " • ": null
    },
    {
        "Théodore Géricault": "théodore géricault"
    },
    {
        " • ": null
    },
    {
        "Francisco Goya": "francisco goya"
    },
    {
        " • ": null
    },
    {
        "Jean-Auguste-Dominique Ingres": "jean-auguste-dominique ingres"
    },
    {
        " • ": null
    },
    {
        "Pierre-Paul Prudhon": "pierre-paul prudhon"
    },
    {
        " • ": null
    },
    {
        "Odilon Redon": "odilon redon"
    },
    {
        " • ": null
    },
    {
        "John Ruskin": "john ruskin"
    },
    {
        " • ": null
    },
    {
        "Georges Seurat": "georges seurat"
    },
    {
        " • ": null
    },
    {
        "Henri de Toulouse-Lautrec": "henri de toulouse-lautrec"
    },
    {
        " • ": null
    },
    {
        "Vincent van Gogh": "vincent van gogh"
    },
    {
        " Max Beckmann": "max beckmann"
    },
    {
        " • ": null
    },
    {
        "Jean Dubuffet": "jean dubuffet"
    },
    {
        " • ": null
    },
    {
        "M. C. Escher": "m. c. escher"
    },
    {
        " • ": null
    },
    {
        "Arshile Gorky": "arshile gorky"
    },
    {
        " • ": null
    },
    {
        "George Grosz": "george grosz"
    },
    {
        " • ": null
    },
    {
        "Paul Klee": "paul klee"
    },
    {
        " • ": null
    },
    {
        "Oscar Kokoschka": "oscar kokoschka"
    },
    {
        " • ": null
    },
    {
        "Käthe Kollwitz": "käthe kollwitz"
    },
    {
        " • ": null
    },
    {
        "Alfred Kubin": "alfred kubin"
    },
    {
        " • ": null
    },
    {
        "André Masson": "andré masson"
    },
    {
        " • ": null
    },
    {
        "Alphonse Mucha": "alphonse mucha"
    },
    {
        " • ": null
    },
    {
        "Jules Pascin": "jules pascin"
    },
    {
        " • ": null
    },
    {
        "Pablo Picasso": "pablo picasso"
    },
    {
        " • ": null
    },
    {
        "Egon Schiele": "egon schiele"
    },
    {
        " • ": null
    },
    {
        "Jean-Michel Basquiat": "jean-michel basquiat"
    },
    {
        " • ": null
    },
    {
        "Andy Warhol •": "andy warhol"
    },
    {
        " Frank Auerbach": "frank auerbach"
    },
    {
        " Larry D. Alexander": "larry d. alexander"
    },
    {
        " Tracey Emin": "tracey emin"
    },
    {
        " • ": null
    },
    {
        "Banksy": "banksy"
    },
    {
        " • ": null
    },
    {
        "Hayao Miyazaki": "hayao miyazaki"
    },
    {
        "       The medium is the means by which ink, pigment or color are delivered onto the drawing surface. Most drawing media are either dry , or use a fluid solvent or carrier . Watercolor pencils can be used dry like ordinary pencils, then moistened with a wet brush to get various painterly effects. Very rarely, artists have drawn with ": null
    },
    {
        "invisible ink": "invisible ink"
    },
    {
        ". Metalpoint drawing usually employs either of two metals: silver or lead. lara Broecke, Cennino Cenninis Il Libro dellArte: a new English Translation and Commentary with Italian Transcription, Archetype 2015 More rarely used are gold, platinum, copper, brass, bronze, and tinpoint.     Paper comes in a variety of different sizes and qualities, ranging from newspaper grade up to high quality and relatively expensive paper sold as individual sheets.  Papers vary in texture, hue, acidity, and strength when wet. Smooth paper is good for rendering fine detail, but a more toothy paper holds the drawing material better. Thus a coarser material is useful for producing deeper contrast.     Newsprint and typing paper may be useful for practice and rough ": null
    },
    {
        "sketches": "sketch"
    },
    {
        ". ": null
    },
    {
        "Tracing paper": "tracing paper"
    },
    {
        " is used to experiment over a half-finished drawing, and to transfer a design from one sheet to another. ": null
    },
    {
        "Cartridge paper": "cartridge paper"
    },
    {
        " is the basic type of drawing paper sold in pads. ": null
    },
    {
        "Bristol board": "bristol board"
    },
    {
        " and even heavier acid-free boards, frequently with smooth finishes, are used for drawing fine detail and do not distort when wet media are applied. Vellum is extremely smooth and suitable for very fine detail. Coldpressed watercolor paper may be favored for ink drawing due to its texture.     Acid-free, archival quality paper keeps its color and texture far longer than ": null
    },
    {
        "wood pulp": "wood pulp"
    },
    {
        " based paper such as ": null
    },
    {
        "newsprint": "newsprint"
    },
    {
        ", which turns yellow and becomes brittle much sooner.     The basic tools are a ": null
    },
    {
        "drawing board": "drawing board"
    },
    {
        " or table, ": null
    },
    {
        "pencil sharpener": "pencil sharpener"
    },
    {
        " and ": null
    },
    {
        "eraser": "eraser"
    },
    {
        ", and for ink drawing, ": null
    },
    {
        "blotting paper": "blotting paper"
    },
    {
        ". Other tools used are ": null
    },
    {
        "circle compass": "circle compass"
    },
    {
        ", ": null
    },
    {
        "ruler": "ruler"
    },
    {
        ", and ": null
    },
    {
        "set square": "set square"
    },
    {
        ". ": null
    },
    {
        "Fixative": "fixative"
    },
    {
        " is used to prevent pencil and crayon marks from smudging. ": null
    },
    {
        "Drafting tape": "drafting tape"
    },
    {
        " is used to secure paper to drawing surface, and also to mask an area to keep it free of accidental marks, such as sprayed or spattered materials and washes. An easel or slanted table is used to keep the drawing surface in a suitable position, which is generally more horizontal than the position used in painting.             Almost all draftsmen use their hands and fingers to apply the media, with the exception of some handicapped individuals who draw with their mouth or feet.      Prior to working on an image, the artist typically explores how various media work. They may try different drawing implements on practice sheets to determine value and texture, and how to apply the implement to produce various effects.     The artists choice of drawing strokes affects the appearance of the image. Pen and ink drawings often use ": null
    },
    {
        "hatching": "hatching"
    },
    {
        " – groups of parallel lines. This is unrelated to the ": null
    },
    {
        "hatching system": "hatching system"
    },
    {
        " in heraldry that indicates ": null
    },
    {
        "tincture": "tincture"
    },
    {
        " Cross-hatching uses hatching in two or more different directions to create a darker tone. Broken hatching, or lines with intermittent breaks, form lighter tones – and controlling the density of the breaks achieves a gradation of tone. ": null
    },
    {
        "Stippling": "stipple"
    },
    {
        " uses dots to produce tone, ": null
    },
    {
        "texture": "texture"
    },
    {
        " and ": null
    },
    {
        "shade": "shading"
    },
    {
        ". Different textures can be achieved depending on the method used to build tone.      Drawings in dry media often use similar techniques, though pencils and drawing sticks can achieve continuous variations in tone. Typically a drawing is filled in based on which hand the artist favors. A right-handed artist draws from left to right to avoid smearing the image. ": null
    },
    {
        "Erasers": "erasers"
    },
    {
        " can remove unwanted lines, lighten tones, and clean up stray marks. In a sketch or outline drawing, lines drawn often follow the contour of the subject, creating depth by looking like shadows cast from a light in the artists position.     Sometimes the artist leaves a section of the image untouched while filling in the remainder. The shape of the area to preserve can be painted with ": null
    },
    {
        "masking fluid": "masking"
    },
    {
        " or cut out of a ": null
    },
    {
        "frisket": "frisket"
    },
    {
        " and applied to the drawing surface, protecting the surface from stray marks until the mask is removed.     Another method to preserve a section of the image is to apply a spray-on fixative to the surface. This holds loose material more firmly to the sheet and prevents it from smearing. However the fixative spray typically uses chemicals that can harm the respiratory system, so it should be employed in a well-ventilated area such as outdoors.     Another technique is ": null
    },
    {
        "subtractive drawing": "subtractive drawing"
    },
    {
        " in which the drawing surface is covered with graphite or charcoal and then erased to make the image. South, Helen, The Everything Drawing Book, Adams Media, Avon, MA, 2004, pp. 152–53,           Shading is the technique of varying the tonal values on the paper to represent the shade of the material as well as the placement of the shadows. Careful attention to reflected light, shadows and highlights can result in a very realistic rendition of the image.     Blending uses an implement to soften or spread the original drawing strokes. Blending is most easily done with a medium that does not immediately ": null
    },
    {
        "fix": "fixative"
    },
    {
        " itself, such as graphite, chalk, or charcoal, although freshly applied ink can be smudged, wet or dry, for some effects. For shading and blending, the artist can use a ": null
    },
    {
        "blending stump": "tortillon"
    },
    {
        ", ": null
    },
    {
        "tissue": "facial tissue"
    },
    {
        ", a ": null
    },
    {
        "kneaded eraser": "kneaded eraser"
    },
    {
        ", a fingertip, or any combination of them. A piece of ": null
    },
    {
        "chamois": "chamois leather"
    },
    {
        " is useful for creating smooth textures, and for removing material to lighten the tone. Continuous tone can be achieved with graphite on a smooth surface without blending, but the technique is laborious, involving small circular or oval strokes with a somewhat blunt point.     Shading techniques that also introduce texture to the drawing include ": null
    },
    {
        "hatching": "hatching"
    },
    {
        " and ": null
    },
    {
        "stippling": "stippling"
    },
    {
        ". A number of other methods produce texture. In addition to the choice of paper, drawing material and technique affect texture. Texture can be made to appear more realistic when it is drawn next to a contrasting texture; a coarse texture is more obvious when placed next to a smoothly blended area. A similar effect can be achieved by drawing different tones close together. A light edge next to a dark background stands out to the eye, and almost appears to float above the surface.          Measuring the dimensions of a subject while blocking in the drawing is an important step in producing a realistic rendition of the subject. Tools such as a ": null
    },
    {
        "compass": "compass"
    },
    {
        " can be used to measure the angles of different sides. These angles can be reproduced on the drawing surface and then rechecked to make sure they are accurate. Another form of measurement is to compare the relative sizes of different parts of the subject with each other. A finger placed at a point along the drawing implement can be used to compare that dimension with other parts of the image. A ": null
    },
    {
        "ruler": "ruler"
    },
    {
        " can be used both as a ": null
    },
    {
        "straightedge": "straightedge"
    },
    {
        " and a device to compute proportions.          When attempting to draw a complicated shape such as a human figure, it is helpful at first to represent the form with a set of primitive volumes. Almost any form can be represented by some combination of the cube, sphere, cylinder, and cone. Once these basic volumes have been assembled into a likeness, then the drawing can be refined into a more accurate and polished form. The lines of the primitive volumes are removed and replaced by the final likeness. Drawing the underlying construction is a fundamental skill for representational art, and is taught in many books and schools. Its correct application resolves most uncertainties about smaller details, and makes the final image look consistent.      A more refined art of ": null
    },
    {
        "figure drawing": "figure drawing"
    },
    {
        " relies upon the artist possessing a deep understanding of anatomy and the human proportions. A trained artist is familiar with the skeleton structure, joint location, muscle placement, tendon movement, and how the different parts work together during movement. This allows the artist to render more natural poses that do not appear artificially stiff. The artist is also familiar with how the proportions vary depending on the age of the subject, particularly when drawing a portrait.                 Linear perspective is a method of portraying objects on a flat surface so that the dimensions shrink with distance. Each set of parallel, straight edges of any object, whether a building or a table, follows lines that eventually converge at a vanishing point. Typically this convergence point is somewhere along the horizon, as buildings are built level with the flat surface. When multiple structures are aligned with each other, such as buildings along a street, the horizontal tops and bottoms of the structures typically converge at a vanishing point.     When both the fronts and sides of a building are drawn, then the parallel lines forming a side converge at a second point along the horizon This is a two-point perspective.  Converging the vertical lines to a third point above or below the horizon then produces a three-point perspective.     Depth can also be portrayed by several techniques in addition to the perspective approach above. Objects of similar size should appear ever smaller the further they are from the viewer. Thus the back wheel of a cart appears slightly smaller than the front wheel. Depth can be portrayed through the use of texture. As the texture of an object gets further away it becomes more compressed and busy, taking on an entirely different character than if it was close. Depth can also be portrayed by reducing the contrast in more distant objects, and by making their colors less saturated. This reproduces the effect of atmospheric haze, and cause the eye to focus primarily on objects drawn in the foreground.              The ": null
    },
    {
        "composition": "composition"
    },
    {
        " of the image is an important element in producing an interesting work of ": null
    },
    {
        "artistic merit": "artistic merit"
    },
    {
        ". The artist plans element placement in the art to communicate ideas and feelings with the viewer. The composition can determine the focus of the art, and result in a harmonious whole that is aesthetically appealing and stimulating.     The ": null
    },
    {
        "illumination": "illumination"
    },
    {
        " of the subject is also a key element in creating an artistic piece, and the interplay of ": null
    },
    {
        "light and shadow": "chiaroscuro"
    },
    {
        " is a valuable method in the artists toolbox. The ": null
    },
    {
        "placement of the light sources": "three-point lighting"
    },
    {
        " can make a considerable difference in the type of message that is being presented. Multiple light sources can wash out any wrinkles in a persons face, for instance, and give a more youthful appearance. In contrast, a single light source, such as harsh daylight, can serve to highlight any texture or interesting features.     When drawing an object or figure, the skilled artist pays attention to both the area within the silhouette and what lies outside. The exterior is termed the ": null
    },
    {
        "negative space": "negative space"
    },
    {
        ", and can be as important in the representation as the figure. Objects placed in the background of the figure should appear properly placed wherever they can be viewed.     A ": null
    },
    {
        "study": "study"
    },
    {
        " is a draft drawing that is made in preparation for a planned final image. Studies can be used to determine the appearances of specific parts of the completed image, or for experimenting with the best approach for accomplishing the end goal. However a well-crafted study can be a piece of art in its own right, and many hours of careful work can go into completing a study.       Individuals display differences in their ability to produce visually accurate drawings.  A visually accurate drawing is described as being recognized as a particular object at a particular time and in a particular space, rendered with little addition of visual detail that can not be seen in the object represented or with little deletion of visual detail”.      Investigative studies have aimed to explain the reasons why some individuals draw better than others.   One study posited four key abilities in the drawing process: motor skills required for mark-making, the drawers own perception of their drawing, perception of objects being drawn, and the ability to make good representational decisions. Following this hypothesis, several studies have sought to conclude which of these processes are most significant in affecting the accuracy of drawings.          ;": null
    },
    {
        "Motor control": "motor control"
    },
    {
        "   Motor control is an important physical component in the Production Phase of the drawing process.  It has been suggested that motor control plays a role in drawing ability, though its effects are not significant.     ;": null
    },
    {
        "Perception": "perception"
    },
    {
        "   It has been suggested that an individuals ability to perceive an object they are drawing is the most important stage in the drawing process. This suggestion is supported by the discovery of a robust relationship between perception and drawing ability.      This evidence acted as the basis of ": null
    },
    {
        "Betty Edwards": "betty edwards"
    },
    {
        " how-to-draw book,  Drawing on the Right Side of the Brain .  Edwards aimed to teach her readers how to draw, based on the development of the readers perceptual abilities.     Furthermore, the influential artist and art critic ": null
    },
    {
        "John Ruskin": "john ruskin"
    },
    {
        " emphasised the importance of perception in the drawing process in his book The Elements of Drawing.  He stated that For I am nearly convinced, that once we see keenly enough, there is very little difficult in drawing what we see .     ;": null
    },
    {
        "Visual memory": "visual memory"
    },
    {
        "   This has also been shown to influence ones ability to create visually accurate drawings.   ": null
    },
    {
        "Short-term memory": "short-term memory"
    },
    {
        " plays an important part in drawing as ones gaze shifts between the object they are drawing and the drawing itself.      ;": null
    },
    {
        "Decision-making": "decision-making"
    },
    {
        "   Some studies comparing artists to non-artists have found that artists spend more time thinking strategically while drawing. In particular, artists spend more time on metacognitive activities such as considering different hypothetical plans for how they might progress with a drawing. ": null
    }
]