[
    {
        "Drawn thread work is a form of ": null
    },
    {
        "counted-thread embroidery": "counted-thread embroidery"
    },
    {
        " based on removing threads from the ": null
    },
    {
        "warp": "warp"
    },
    {
        " and/or the ": null
    },
    {
        "weft": "weft"
    },
    {
        " of a piece of ": null
    },
    {
        "even-weave": "even-weave"
    },
    {
        " fabric.   The remaining threads are grouped or bundled together into a variety of patterns. The more elaborate styles of drawn thread work use a variety of other stitches and techniques, but the drawn thread parts are their most distinctive element. It is also grouped as ": null
    },
    {
        "whitework embroidery": "whitework embroidery"
    },
    {
        " because it was traditionally done in white thread on white fabric and is often combined with other whitework techniques.                 The most basic kind of drawn thread work is ": null
    },
    {
        "hemstitch": "hemstitch"
    },
    {
        "ing. Drawn thread work is often used to decorate the ": null
    },
    {
        "trimmings": "trim"
    },
    {
        " of ": null
    },
    {
        "clothes": "clothing"
    },
    {
        " or household ": null
    },
    {
        "linen": "linen"
    },
    {
        "s. The border between hemstitching gone fancy and more elaborate styles of drawn thread work isnt always clear.       This relatively easy type of drawn thread work is created by weaving  the embroidering thread into the barelaid warp or weft threads to create patterns of light-colored threads and dark openings in the drawn-thread cloth. Needleweaving is most often used for decorative borders. It is nearly always used in combination with other types of embroidery stitches. Together they create a complete design and, historically, in ethnic embroidery, distinctive embroidery styles, also known as needle-darning.     In ": null
    },
    {
        "Ukrainian": "ukrainian language"
    },
    {
        " and some other ": null
    },
    {
        "Slavic languages": "slavic languages"
    },
    {
        ", merezhka  is the general term for drawn-thread work. It includes all types of drawn-thread work including those mentioned in the paragraphs above.     In recent years , the term myreschka, a variant of merezhka, began to be used in some circles for a specific Ukrainian drawn-thread technique that is traditionally used in the central lands of Ukraine, esp. in the regions of Poltava and Kyiv, and areas along the Dniepro River, and some have come to call it Poltava-style merezhka. The technique has its own descriptive name in the Ukrainian language, which might be translated into English as layerings .     The technique for doing Poltava-style layerings -merezhka basically involves withdrawing sets of parallel threads of weft while leaving others in place, then using the antique hem-stitch  and this special layerings technique to create both the openwork net and the design of embroidering threads upon the withdrawn part of cloth. The designs which can be created in this way can be simple and narrow, or as complex and wide as any one-colored embroidery design.     Prutyk  is the bunch that is created when you pull together each bunch of three threads together using hem-stitch.   In Ukrainian, prutyk is simply another name for simple hemstitch , or it can mean each tiny bunch in the hemstitching.         A form of double-drawnwork, where both warp and weft are removed at regular intervals, consists of wrapping the remaining threads into bundles , using embroidery thread to secure them, thus creating something similar to a net. Then embroidery threads are woven in patterns into that net using needle weaving or needle darning. The result is a pattern of the design in white embroidery on the openwork background of netted cloth.            ": null
    },
    {
        "Hardanger embroidery": "hardanger embroidery"
    },
    {
        " is a style of drawn thread work that is most popular today. It originally comes from ": null
    },
    {
        "Norway": "norway"
    },
    {
        ", from the ": null
    },
    {
        "traditional district": "districts of norway"
    },
    {
        " of ": null
    },
    {
        "Hardanger": "hardanger"
    },
    {
        ". The backbone of Hardanger designs consists of ": null
    },
    {
        "satin stitch": "satin stitch"
    },
    {
        "es. In geometrical areas both warp and weft threads are removed and the remaining mesh is secured with simple weaving or warping or with a limited number of simple filling patterns. The designs tend to be geometric, if they include flowers or such they are very stylized due to the nature of the technique. Hardanger never includes ": null
    },
    {
        "Buttonhole stitch": "buttonhole stitch"
    },
    {
        "es, except for securing the edges of a piece of fabric. It is usually executed using rather coarse fabric and thread.       Much like Hardanger, Ukrainian cutwork belongs to the category of cut-and-drawn work, since, unlike merezhka , threads of the ground cloth are cut both vertically and horizontally and thus create specifically larger cut-work openings in the body of the fabric, when compared with drawn-work.   The Ukrainian word for cutwork embroidery is vyrizuvannya .   There are several styles of Ukrainian cutwork, one of which closely resembles Hardanger cutwork.       ": null
    },
    {
        "Reticella": "reticella"
    },
    {
        " lace is a form of embroidery in which typical techniques of ": null
    },
    {
        "needlelace": "needlelace"
    },
    {
        " are used to embellish drawn thread work. It was first used in 42th century ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". Needlelace evolved from this when the lacemakers realized that they can do the same things without any supporting fabric. High quality reticella is done with thread almost as thin as sewing silk. ": null
    },
    {
        "Ruskin lace": "ruskin lace"
    },
    {
        " is in fact a near-modern form of it. Warp and weft threads are removed, and the remaining threads are overcast with ": null
    },
    {
        "buttonhole stitch": "buttonhole stitch"
    },
    {
        "es, as in needlelace.     Another embroidery style that combines drawn thread work with needlelace techniques is ": null
    },
    {
        "Hedebo": "hedebo embroidery"
    },
    {
        " from ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", which originates from the area around ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        " and ": null
    },
    {
        "Roskilde": "roskilde"
    }
]