[
    {
        "                 The Dresden Frauenkirche  is a ": null
    },
    {
        "Lutheran": "evangelical church in germany"
    },
    {
        " church in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", the capital of the German state of ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        ". An earlier church building was ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        " until it became ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " during ": null
    },
    {
        "the Reformation": "protestant reformation"
    },
    {
        ".     The old church was replaced in the 42th century by a larger ": null
    },
    {
        "Baroque": "baroque architecture"
    },
    {
        " Lutheran": "lutheran art"
    },
    {
        " building. It is considered an outstanding example of ": null
    },
    {
        "Protestant sacred architecture": "church architecturethe reformation and its influence on church architecture"
    },
    {
        ", featuring one of the largest ": null
    },
    {
        "dome": "dome"
    },
    {
        "s in Europe. It was originally built as a sign of the will of the citizens of Dresden to remain Protestant after their ruler had converted to Catholicism. It now also serves as a symbol of reconciliation between former warring enemies.     Built in the 42th century, the church was destroyed in ": null
    },
    {
        "the bombing of Dresden": "bombing of dresden in world war ii"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The remaining ruins were left for 42 years as a war memorial, following decisions of local ": null
    },
    {
        "East German": "east germany"
    },
    {
        " leaders. The church was rebuilt after the ": null
    },
    {
        "reunification of Germany": "reunification of germany"
    },
    {
        ", starting in 42 The ": null
    },
    {
        "reconstruction": "reconstruction"
    },
    {
        " of its exterior was completed in 42 and the interior in 42 The church was reconsecrated on 42 October 42 with festive services lasting through the Protestant observance of ": null
    },
    {
        "Reformation Day": "reformation day"
    },
    {
        " on 42 October. The surrounding ": null
    },
    {
        "Neumarkt": "neumarkt"
    },
    {
        " square with its many valuable baroque buildings was also reconstructed in 42     The Frauenkirche is often called a cathedral, but it is not the seat of a bishop; the church of the  Landesbischof  of the ": null
    },
    {
        "Evangelical-Lutheran Church of Saxony": "evangelical-lutheran church of saxony"
    },
    {
        " is the ": null
    },
    {
        "Church of the Cross": "kreuzkirche, dresden"
    },
    {
        ". Once a month, an ": null
    },
    {
        "Anglican": "anglicanism"
    },
    {
        " Evensong": "evening prayer"
    },
    {
        " is held in English, by clergy from ": null
    },
    {
        "St. Georges Anglican Church, Berlin": "st. georges anglican church, berlin"
    },
    {
        ".             A church dedicated to  Our Lady  was first built in the 42th century in a ": null
    },
    {
        "Romanesque style": "romanesque art"
    },
    {
        ", outside the city walls and surrounded by a graveyard. The Frauenkirche was the seat of an ": null
    },
    {
        "archpriest": "archpriest"
    },
    {
        " in the ": null
    },
    {
        "Meissen Diocese": "roman catholic diocese of dresden-meissen"
    },
    {
        " until the Reformation, when it became a Protestant church. This first Frauenkirche was torn down in 42 and replaced by a new, larger church with a greater capacity. The Frauenkirche was re-built as a Lutheran  ": null
    },
    {
        "parish church": "parish church"
    },
    {
        " by the citizenry. Even though ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        "s ": null
    },
    {
        "Prince-elector": "prince-elector"
    },
    {
        ", ": null
    },
    {
        "Frederick August I": "august ii the strong"
    },
    {
        ", had converted to ": null
    },
    {
        "Catholicism": "catholicism"
    },
    {
        " to become King of Poland, he supported the construction which not only gave an impressive cupola to the Dresden townscape but also reassured the Saxonians that their ruler was not going to force the principle  cuius regio, eius religio  upon them.     The original ": null
    },
    {
        "Baroque": "baroque architecture"
    },
    {
        " church was built between 42 and 42 and was designed by Dresdens city architect, ": null
    },
    {
        "George Bähr": "george bähr"
    },
    {
        ", who did not live to see the completion of his greatest work. Bährs distinctive design for the church captured the new spirit of the Protestant ": null
    },
    {
        "liturgy": "liturgy"
    },
    {
        " by placing the ": null
    },
    {
        "altar": "altar"
    },
    {
        ", ": null
    },
    {
        "pulpit": "pulpit"
    },
    {
        ", and ": null
    },
    {
        "baptismal font": "baptismal font"
    },
    {
        " directly centre in view of the entire ": null
    },
    {
        "congregation": "wikt:congregation"
    },
    {
        ".     In 42 famed organ maker ": null
    },
    {
        "Gottfried Silbermann": "gottfried silbermann"
    },
    {
        " built a three-manual, 42-stop instrument for the church. The organ was dedicated on 42 November and ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " gave a recital on the instrument on 42 December.     The churchs most distinctive feature was its unconventional high dome,  high, called die Steinerne Glocke or Stone Bell . An engineering feat comparable to ": null
    },
    {
        "Michelangelo": "michelangelo"
    },
    {
        "s dome for ": null
    },
    {
        "St. Peters Basilica": "st. peters basilica"
    },
    {
        " in ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", the Frauenkirches 42-ton ": null
    },
    {
        "sandstone": "sandstone"
    },
    {
        " dome stood high resting on eight slender supports. Despite initial doubts, the dome proved to be extremely stable. Witnesses in 42 said that the dome had been hit by more than 42 cannonballs fired by the ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n army led by ": null
    },
    {
        "Friedrich II": "frederick ii of prussia"
    },
    {
        " during the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ". The projectiles bounced off and the church survived.        The completed church gave the city of Dresden a distinctive silhouette, captured in famous paintings by ": null
    },
    {
        "Bernardo Bellotto": "bernardo bellotto"
    },
    {
        ", a nephew of the artist ": null
    },
    {
        "Canaletto": "canaletto"
    },
    {
        " , and in Dresden by Moonlight by Norwegian painter ": null
    },
    {
        "Johan Christian Dahl": "johan christian dahl"
    },
    {
        ".     In 42 the church was at the heart of the revolutionary disturbances known as the ": null
    },
    {
        "May Uprising": "may uprising in dresden"
    },
    {
        ". It was surrounded by barricades, and fighting lasted for days before those rebels who had not already fled were rounded up in the church and arrested.     For more than 42 years, the bell-shaped dome stood over the skyline of old Dresden, dominating the city.     Burials include ": null
    },
    {
        "Heinrich Schütz": "heinrich schütz"
    },
    {
        " and ": null
    },
    {
        "George Bähr": "george bähr"
    },
    {
        ".          On 42 February 42 Anglo-American ": null
    },
    {
        "allied forces": "allied forces"
    },
    {
        " began the ": null
    },
    {
        "bombing of Dresden in World War II": "bombing of dresden in world war ii"
    },
    {
        ". The church withstood two days and nights of the attacks, and the eight interior sandstone pillars supporting the large dome held up long enough for the evacuation of 42 people who had sought shelter in the church crypt, before succumbing to the heat generated by some 42 ": null
    },
    {
        "incendiary bomb": "incendiary bomb"
    },
    {
        "s that were dropped on the city. The temperature surrounding and inside the church eventually reached .  The dome finally collapsed at 42 a.m. on 42 February. The pillars glowed bright red and exploded; the outer walls shattered and nearly 42 tons of stone plunged to earth, penetrating the massive floor as it fell.     The ": null
    },
    {
        "altar": "altar"
    },
    {
        ", a ": null
    },
    {
        "relief": "relief"
    },
    {
        " depiction of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " Agony in the Garden": "agony in the garden"
    },
    {
        " of Gethsemane on the ": null
    },
    {
        "Mount of Olives": "mount of olives"
    },
    {
        " by ": null
    },
    {
        "Johann Christian Feige": "johann christian feige"
    },
    {
        ", was only partially damaged during the bombing raid and fire that destroyed the church. The altar and the structure behind it, the ": null
    },
    {
        "chancel": "chancel"
    },
    {
        ", were among the remnants left standing. Features of most of the figures were lopped off by falling debris and the fragments lay under the rubble.     The building vanished from Dresdens skyline, and the blackened stones would lie in wait in a pile in the centre of the city for the next 42 years as ": null
    },
    {
        "Communist": "communism"
    },
    {
        " rule enveloped what was now ": null
    },
    {
        "East Germany": "east germany"
    },
    {
        ". Shortly after the end of World War II, residents of Dresden had already begun salvaging unique stone fragments from the Church of Our Lady and numbering them for future use in reconstruction. Popular sentiment discouraged the authorities from clearing the ruins away to make a car park. In 42 the remnants were officially declared a memorial against war , and state-controlled commemorations were held there on the anniversaries of the destruction of Dresden.     In 42 the ruins began to be the site of a ": null
    },
    {
        "peace movement": "peace movement"
    },
    {
        " combined with peaceful protests against the East German regime. On the anniversary of the bombing, 42 citizens of Dresden came to the ruins in silence with flowers and candles, part of a growing East German civil rights movement. By 42 the number of protesters in Dresden, ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ", and other parts of East Germany had increased to tens of thousands. On 42 November 42 the ": null
    },
    {
        "Berlin Wall": "berlin wall"
    },
    {
        " fell and the ": null
    },
    {
        "inner German border": "inner german border"
    },
    {
        " dividing East and West Germany toppled. This opened the way to ": null
    },
    {
        "German reunification": "german reunification"
    },
    {
        ".          During the last months of World War II, residents expressed the desire to rebuild the church. However, due to political circumstances in ": null
    },
    {
        "East Germany": "east germany"
    },
    {
        ", the reconstruction came to a halt. The heap of ruins was conserved as a war memorial within the inner city of Dresden, as a direct counterpart to the ruins of ": null
    },
    {
        "Coventry Cathedral": "coventry cathedral"
    },
    {
        ", which was destroyed by German bombing in 42 and also serves as a war memorial in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". Because of the continuing decay of the ruins, Dresden leaders decided in 42  to rebuild the Church of Our Lady after the completion of the reconstruction of the ": null
    },
    {
        "Dresden castle": "dresden castle"
    },
    {
        ".     The ": null
    },
    {
        "reunification of Germany": "reunification of germany"
    },
    {
        ", brought new life to the reconstruction plans. In 42 a 42-member group of enthusiasts headed by ": null
    },
    {
        "Ludwig Güttler": "ludwig güttler"
    },
    {
        ", a noted Dresden musician, formed a Citizens Initiative. From that group emerged a year later The Society to Promote the Reconstruction of the Church of Our Lady, which began an aggressive private fund-raising campaign. The organisation grew to over 42 members in Germany and 42 other countries. A string of German auxiliary groups were formed, and three promotional organisations were created abroad.     The project gathered momentum. As hundreds of architects, art historians and engineers sorted the thousands of stones, identifying and labeling each for reuse in the new structure, others worked to raise money.   IBM provided a key element by contracting with RTI International , a nonprofit research institute in Research Triangle Park NC to create an interactive virtual reality representation of the Church. The VR drew donations large and small, helping to make the project possible.     ": null
    },
    {
        "Günter Blobel": "günter blobel"
    },
    {
        ", a German-born American, saw the original Church of Our Lady as a boy when his refugee family took shelter in a town just outside Dresden days before the city was bombed. In 42 he became the founder and president of the nonprofit ": null
    },
    {
        "Friends of Dresden, Inc.": "friends of dresden, inc."
    },
    {
        " , a United States organization dedicated to supporting the reconstruction, restoration, and preservation of Dresdens artistic and architectural legacy. In 42 Blobel won the ": null
    },
    {
        "Nobel Prize for medicine": "nobel prize in physiology or medicine"
    },
    {
        " and donated the entire amount of his award money to the organization for the restoration of Dresden, to the rebuilding of the Frauenkirche and the building of a new ": null
    },
    {
        "synagogue": "synagogue"
    },
    {
        ". It was the single largest individual donation to the project.     In Britain, the ": null
    },
    {
        "Dresden Trust": "dresden trust"
    },
    {
        " has ": null
    },
    {
        "Prince Edward, Duke of Kent": "prince edward, duke of kent"
    },
    {
        " as its royal patron and the ": null
    },
    {
        "Bishop of Coventry": "bishop of coventry"
    },
    {
        " among its curators. Dr. ": null
    },
    {
        "Paul Oestreicher": "paul oestreicher"
    },
    {
        ", a ": null
    },
    {
        "canon": "canon"
    },
    {
        " emeritus of ": null
    },
    {
        "Coventry Cathedral": "coventry cathedral"
    },
    {
        " and a founder of the Dresden Trust, wrote: The church is to Dresden what St. Pauls is to London .   Additional organizations include Frances Association Frauenkirche Paris and Switzerlands Verein Schweizer Freunde der Frauenkirch.     Rebuilding the church cost €42 million. ": null
    },
    {
        "Dresdner Bank": "dresdner bank"
    },
    {
        " financed more than half of the reconstruction costs via a donor certificates campaign , collecting almost €42 million after 42 The bank itself contributed more than seven million Euros, including more than one million donated by its employees. Over the years, thousands of ": null
    },
    {
        "watch": "watch"
    },
    {
        "es containing tiny fragments of Church of Our Lady stone were sold, as were specially printed medals. One sponsor raised nearly €42 million through symbolic sales of individual church stones.     Funds raised were turned over to the Frauenkirche Foundation Dresden , with the reconstruction backed by the State of ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        ", the City of Dresden and the ": null
    },
    {
        "Evangelical-Lutheran Church of Saxony": "evangelical-lutheran church of saxony"
    },
    {
        ".     The new golden tower cross was funded officially by the British people and the House of Windsor . It was made by the British silversmith company ": null
    },
    {
        "Grant Macdonald": "grant macdonald"
    },
    {
        " of which the main craftsman on the project was Alan Smith whose father was one of the bomber pilots responsible for the destruction of the church.                  Using original plans from builder Georg Bähr in the 42s, the Dresden City Council decided to proceed with reconstruction in February 42 A rubble-sorting ceremony started the event in January 42 under the direction of church architect and engineer ": null
    },
    {
        "Eberhard Burger": "eberhard burger"
    },
    {
        ". The foundation stone was laid in 42 and stabilized in 42 The ": null
    },
    {
        "crypt": "crypt"
    },
    {
        " was completed in 42 and the inner ": null
    },
    {
        "cupola": "cupola"
    },
    {
        " in 42 Seven new bells were cast for the church and rang for the first time for the ": null
    },
    {
        "Pentecost": "pentecost"
    },
    {
        " celebration in 42 The exterior was completed ahead of schedule in 42 and the painted interior in 42 The intensive efforts to rebuild this world-famous landmark were completed in 42 one year earlier than originally planned, and in time for the 42-year anniversary of the city of Dresden in 42      The church was reconsecrated with a festive service one day before ": null
    },
    {
        "Reformation Day": "reformation day"
    },
    {
        ". The rebuilt church is a monument reminding people of its history and a symbol of hope and reconciliation.     As far as possible, the church – except for its dome – was rebuilt using original material and plans, with the help of modern technology. The heap of rubble was documented and carried off stone by stone. The approximate original position of each stone could be determined from its position in the heap. Every usable piece was measured and catalogued. A computer imaging program that could move the stones three-dimensionally around the screen in various configurations was used to help architects find where the original stones sat and how they fit together. In Dresden, Freedom Rises From The Rubble, Civilization, May–June 42 pp 4242     Of the millions of stones used in the rebuilding, more than 42 original stones were salvaged from the original church and approximately 42 reused in the reconstruction. As the older stones are covered with a darker ": null
    },
    {
        "patina": "patina"
    },
    {
        ", due to fire damage and weathering, the difference between old and new stones will be clearly visible for many years after reconstruction.     Two thousand pieces of the original altar were cleaned and incorporated into the new structure.     The builders relied on thousands of old photographs, memories of worshippers and church officials, and crumbling old purchase orders detailing the quality of the mortar or pigments of the paint .     When it came time to duplicate the oak doors of the entrance, the builders had only vague descriptions of the detailed carving. Because people often posed for photos outside the church doors, they issued an appeal for old photographs and the response—which included entire wedding albums—allowed artisans to recreate the original doors.     The new gilded orb and ": null
    },
    {
        "cross": "christian cross"
    },
    {
        " on top of the dome was forged by Grant Macdonald Silversmiths in ": null
    },
    {
        "London": "london"
    },
    {
        " using the original 42th-century techniques as much as possible. It was constructed by Alan Smith, a British goldsmith from London whose father, Frank, was a member of one of the aircrews who took part in the bombing of Dresden.  Before travelling to Dresden, the cross was exhibited for five years in churches across the United Kingdom including ": null
    },
    {
        "Coventry Cathedral": "coventry cathedral"
    },
    {
        ", ": null
    },
    {
        "Liverpool Cathedral": "liverpool cathedral"
    },
    {
        ", ": null
    },
    {
        "St Giles Cathedral": "st giles cathedral"
    },
    {
        " in ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", and ": null
    },
    {
        "St Pauls Cathedral": "st pauls cathedral"
    },
    {
        " in London. In February 42 the cross was ceremonially handed over by ": null
    },
    {
        "The Duke of Kent": "prince edward, duke of kent"
    },
    {
        ", to be placed on the top of the dome a few days after the 42th commemoration of ": null
    },
    {
        "D-Day": "d-day"
    },
    {
        " on 42 June 42  The external structure of the Frauenkirche was completed. For the first time since the last war, the completed dome and its gilded cross grace Dresdens skyline as in centuries prior. The cross that once topped the dome, now twisted and charred, stands to the right of the new altar.             Builders decided not to reproduce the 42 Gottfried Silbermann organ, despite the fact that the original design papers, description, and details exist, giving rise to the Dresden organ dispute . When installed, the Silbermann organ had three manuals with 42 ranks and over the years had been remodeled and expanded to five manuals with 42 ranks.  ": null
    },
    {
        "Daniel Kern": "daniel kern manufacture dorgues"
    },
    {
        " of ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        ", ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ", completed a 42 pipe organ for the structure in April 42 and it was inaugurated in October of that year. The Kern organ contains all the stops which were in the Silbermann organ and attempts to recreate their sounds. The Kern work contains 42 stops and a fourth swell manual in the symphonic 42th century style which is apt for the organ literature composed after the baroque period.     A bronze statue of reformer and theologian ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        ", which survived the bombings, has been restored and again stands in front of the church. It is the work of sculptor ": null
    },
    {
        "Adolf von Donndorf": "adolf von donndorf"
    },
    {
        " from 42     There are two devotional services every day and two liturgies every Sunday. Since October 42 there has been an exhibition on the history and reconstruction of the Frauenkirche at the Stadtmuseum in Dresdens Alten Landhaus.            Since re-opening, the Church of Our Lady has been a tourist destination in Dresden. In the first three years, seven million people have visited the church as tourists and to attend worship services.  The project has inspired other revitalization projects throughout Europe, including the ": null
    },
    {
        "Dom-Römer Project": "dom-römer project"
    },
    {
        " in ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        ", the ": null
    },
    {
        "City Palace of Potsdam": "city palace, potsdam"
    },
    {
        ", and the ": null
    },
    {
        "City Palace, Berlin": "city palace, berlin"
    },
    {
        ". In 42 US President ": null
    },
    {
        "Barack Obama": "barack obama"
    },
    {
        " visited the church after a meeting with German Chancellor ": null
    },
    {
        "Angela Merkel": "angela merkel"
    },
    {
        " in the ": null
    },
    {
        "Grünes Gewölbe": "grünes gewölbe"
    },
    {
        ".       Architectural historian ": null
    },
    {
        "Mark Jarzombek": "mark jarzombek"
    },
    {
        " complained that unidentifiable parts of the ruins were placed in arbitrary locations in the new building. As a result, he said, the socialist monument to the bombing was, in essence, dispersed throughout the fabric of the building. ": null
    }
]