[
    {
        "     Drusilla, or Dru, is a fictional ": null
    },
    {
        "character": "character"
    },
    {
        " created by ": null
    },
    {
        "Joss Whedon": "joss whedon"
    },
    {
        " and ": null
    },
    {
        "David Greenwalt": "david greenwalt"
    },
    {
        " for the American ": null
    },
    {
        "television series": "television series"
    },
    {
        ",  Buffy the Vampire Slayer  and  Angel . The character is portrayed by American actress ": null
    },
    {
        "Juliet Landau": "juliet landau"
    },
    {
        ". Drusilla is introduced alongside her lover ": null
    },
    {
        "Spike": "spike"
    },
    {
        "  in the second season of Buffy the Vampire Slayer to serve as new antagonists to the series heroine, ": null
    },
    {
        "vampire Slayer": "slayer"
    },
    {
        " Buffy Summers": "buffy summers"
    },
    {
        "  and alongside ": null
    },
    {
        "Darla": "darla"
    },
    {
        "  and Wolfram & Hart as the main antagonist of the second season of Angel. In contrast to the series previous ": null
    },
    {
        "central villain": "big bad"
    },
    {
        ", the ancient and ceremonious ": null
    },
    {
        "Master": "master"
    },
    {
        " , Spike and Dru were introduced as a more unconventional but equally dangerous pair of vampires.     Though Spike and Dru had not been conceived as necessarily having to be either British or American, Landau chose to portray Drusilla with a ": null
    },
    {
        "Cockney": "cockney"
    },
    {
        " accent in keeping with the characters  Sid and Nancy  analogy . Drusillas physical appearance also drew from additional sources, such as ": null
    },
    {
        "supermodel": "supermodel"
    },
    {
        " Kate Moss": "kate moss"
    },
    {
        " and the 42s ": null
    },
    {
        "heroin chic": "heroin chic"
    },
    {
        " aesthetic. The characters backstory gives her ties to Buffys boyfriend ": null
    },
    {
        "Angel": "angel"
    },
    {
        " , and it is gradually established over the course of Buffy and Angel. A young psychic in ": null
    },
    {
        "Victorian": "victorian era"
    },
    {
        " London with a potential for sainthood, Drusilla was driven insane by Angel before he eventually turned her into a vampire. In Angel, the character recurs both in the present-day narrative and in ": null
    },
    {
        "flashback": "flashback"
    },
    {
        "s which depict her adventures across Europe and Asia with Angel and Spike. After Angel ended in 42 the character continued to appear in ": null
    },
    {
        "Expanded Universe": "expanded universe"
    },
    {
        " materials in other media. Landau went on to co-write a two-issue Drusilla story arc for ": null
    },
    {
        "IDW Publishing": "idw publishing"
    },
    {
        "s ": null
    },
    {
        "Angel comic book series": "angel: after the fall"
    },
    {
        " in 42 continuing her characters storyline.       Drusillas history unfolds in ": null
    },
    {
        "flashback": "flashback"
    },
    {
        "s scattered among numerous episodes of both  Buffy the Vampire Slayer  and  Angel ; they are not presented in chronological order. In ": null
    },
    {
        "Lie to Me": "lie to me"
    },
    {
        " , ": null
    },
    {
        "Angel": "angel"
    },
    {
        " explains that, in 42 when he was still Angelus, he became obsessed with Drusilla, a beautiful young ": null
    },
    {
        "Catholic": "roman catholicism"
    },
    {
        " woman who lived with her parents and two sisters in ": null
    },
    {
        "London": "london"
    },
    {
        ". Angelus sire ": null
    },
    {
        "Darla": "darla"
    },
    {
        " first discovered Drusilla, and presented her to Angelus as a new possible victim to torment. Drusilla had psychic abilities, and was capable of occasionally foretelling the future, especially tragic situations. However, she believed this to be an evil affliction and wished to enter a ": null
    },
    {
        "nunnery": "nunnery"
    },
    {
        " to cleanse herself. Angelus sensed her purity and became obsessed with destroying her, as Drusilla had the potential for sainthood. Angelus first made contact with her by murdering Drusillas priest, and impersonating him when she went to confession. When she confessed that she believed her abilities were evil, Angelus toyed with her by suggesting she embrace the evil instead of rejecting it. At some later point Angelus tortured and killed Drusillas entire family, causing her to flee to a ": null
    },
    {
        "convent": "convent"
    },
    {
        " in ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". On the day she was to take her holy vows, Angelus made her watch as he killed every person in the convent and engaged in sexual relations with Darla. The trauma of Angeluss atrocities drove Drusilla insane, and Angelus chose to turn her into a ": null
    },
    {
        "vampire": "vampire"
    },
    {
        ", as he considered her a masterpiece, a testament to his talent. Believing death to be a mercy to her at this point, he chose to sire her to make her pain eternal as an immortal.     After being sired, Drusilla, now a predator, joined Angelus and Darla on their murderous travels. In 42 Drusilla sired the young poet William, who joined the group. She and William, later known as ": null
    },
    {
        " Spike ": "spike"
    },
    {
        ", shared an intimate relationship, though Angelus continued to engage in sexual relations with Dru as well.     Shortly after Angelus is cursed with a soul, Spike and Drusilla go their separate ways from Darla and Angel. At some point before their arrival in ": null
    },
    {
        "Sunnydale": "sunnydale"
    },
    {
        " in late 42 Drusilla is attacked and severely injured by an angry mob in ": null
    },
    {
        "Prague": "prague"
    },
    {
        ", leaving her in a weakened and frail condition. Spike cares for her, and the couple decide to travel to the ": null
    },
    {
        "Hellmouth": "hellmouth"
    },
    {
        " in hopes that its energy will help to restore Drusillas strength and health.     They arrive in Sunnydale in the episode ": null
    },
    {
        "School Hard": "school hard"
    },
    {
        " , and Spike plots the downfall of the current ": null
    },
    {
        "Slayer": "slayer"
    },
    {
        ", ": null
    },
    {
        "Buffy Summers": "buffy summers"
    },
    {
        ". When he discovers that Drusilla can be cured by the blood of her sire, Spike captures Angel and allows Drusilla to torture him until it is time to perform the ritual. Although Buffy and her friends save Angel, the ritual is successful. Drusilla, fully restored, now takes care of Spike, who has been temporarily paralyzed by Buffys attack. When Angel reverts to Angelus, he re-joins the couple. Drusilla soon kills ": null
    },
    {
        "Kendra": "kendra young"
    },
    {
        ", another Slayer, by hypnotizing her and cutting her throat with a fingernail .     Drusilla is delighted by Angeluss determination to destroy the world and encourages his ongoing sexual attention; both dynamics strongly disturb Spike, who wants Drusilla to himself again and does not particularly want the world to end. Spike decides to help Buffy save the world in exchange for his and Drusillas safe passage from Sunnydale. Drusilla resists Spikes betrayal of Angelus, and he attacks her, ultimately carrying her unconscious body from the fray.     Drusilla and Spike flee to ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", where Drusilla becomes disillusioned with their relationship. Spikes alliance with the Slayer, combined with Drus skills of foresight and perception, prove to her that Spike is now tainted and that he is developing feelings for Buffy. Drusilla breaks up with Spike, and he rejects her offer to remain friends.     Drusilla reappears on Angel in 42 when ": null
    },
    {
        "Wolfram & Hart": "wolfram  &  hart"
    },
    {
        " brings her to ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " to re-sire Darla, who had been resurrected as a human but is dying of ": null
    },
    {
        "syphilis": "syphilis"
    },
    {
        ". Drusilla, who loves Darla like a parent, genuinely believes she is doing Darla a favor by siring her and is puzzled by Darlas brief rage before her renewed vampire nature kicks in. Reconciled, the two wreak havoc in the city until Angel sets them on fire. The two go underground to heal, but Drusilla leaves Darla, who is then protected by ": null
    },
    {
        "Lindsey McDonald": "lindsey mcdonald"
    },
    {
        ".     Drusilla returns to ": null
    },
    {
        "Sunnydale": "sunnydale"
    },
    {
        " in the episode ": null
    },
    {
        "Crush": "crush"
    },
    {
        " to persuade Spike to join Darla and herself in reforming their family unit, but instead, Spike seizes the opportunity to try to prove his love for Buffy by offering to stake Drusilla. Heartbroken by the actions of her former lover, Drusilla departs Sunnydale and remains at large. However, in Season Seven of Buffy, the ": null
    },
    {
        "First Evil": "first evil"
    },
    {
        " impersonates Drusilla in an unsuccessful attempt to break Spikes spirit. Spike claims that the First Evils impersonation is not crazy enough to be Drusilla.     In ": null
    },
    {
        "Angel": "angel: after the fall"
    },
    {
        " comics by ": null
    },
    {
        "IDW Publishing": "idw publishing"
    },
    {
        " set after the television series ended, Drusilla reappears, breaking out of a psychiatric institution, in the story arc Drusilla . Still mentally ill, her whereabouts since her last appearance in Angel remain unexplained. After assault by a crowd, she awakens, still pallid-skinned, in what appears to be Georgian London, in broad daylight and enters what seems to be her parents’ home. She encounters a doll and is called by a third party, possibly her parents. It is uncertain whether this is an elaborate hallucination, ": null
    },
    {
        "time travel": "time travel"
    },
    {
        " to her personal past or an alternate universe where she was never turned by Angelus. It is strongly implied, however, that the story actually takes place before Drusilla is sired, and the parts of it set in the modern day are actually a premonition in the human, 42th-century Drusillas mind. She later reappears in the ": null
    },
    {
        "Spike mini-series": "spike"
    },
    {
        " by IDW, where she encounters Spike in Las Vegas, having allied herself with a human who believes Spike stole his soul. Spike has Buffys friend ": null
    },
    {
        "Willow": "willow rosenberg"
    },
    {
        " magically transfer his soul to Drusilla to give her a shot at redemption, but they are forced to reverse the spell when it drives her even madder than she already is.     The character next appears in  Angel & Faith  by ": null
    },
    {
        "Dark Horse Comics": "dark horse comics"
    },
    {
        " in the story arc Daddy Issues , in which Drusilla has become sane thanks to the Lorophage demon, popularly referred to as the Highgate vampire, which ate her trauma and pain. In her new role as Mother Superior , she sought to perform similar treatments on the citizens of London, which Angel likened to lobotomies. When Angel killed the Lorophage, Drusilla becomes insane once more, and is free. Dark Horse intended to release the 42-issue miniseries Drusilla: Run and Catch, examining what happened next for her, but it was delayed until the conclusion of Season Nine. Later in the Angel & Faith series, it transpires she went on to kill one of the London Slayers affiliated with Faith. She returns in the second series, in which she helps the demon Archaeus build an army of vampires to take over Magic Town. However she flees in the finale when Angel, Faith and their allies defeat Archaeus and his army in a battle.       Drusilla has all the standard powers and vulnerabilities of a ": null
    },
    {
        "vampire": "vampire"
    },
    {
        ", plus minor psychic abilities. She is immortal, regenerates damage, drains human blood to survive, and is stronger than most humans. Drusillas technique in combat, although awkward-looking, has allowed her to briefly hold her own in a fight against Angel  and Spike , along with besting ": null
    },
    {
        "Kendra": "kendra"
    },
    {
        " the Vampire Slayer  before using the hypnosis technique and then killing her. It was also in this fight with Kendra that Drusilla showed that her fingernails are sharper than one would normally expect, as she uses them to slit Kendras throat. Darla had demonstrated a similar technique when she sired Angel; whether this is due to vampiric abilities or physical manipulation of nails is unclear.     Drusilla is also a ": null
    },
    {
        "seer": "clairvoyance"
    },
    {
        " with minor ": null
    },
    {
        "psychic": "psychic"
    },
    {
        " abilities. However, since she had these before becoming a vampire their source and cause are unknown. She receives vivid visions that contain possible glimpses of the future, and can also see into peoples minds and project false imagery into them . She is also capable of hypnotizing people, which she does by catching their gazes, pointing her fingers towards her victims eyes and then to her own, whispering to them . Drusilla uses this technique to murder Kendra in the episode ": null
    },
    {
        "Becoming, Part One": "becoming, part one"
    },
    {
        " . The Master uses a similar skill to paralyze Buffy in ": null
    },
    {
        "Prophecy Girl": "prophecy girl"
    },
    {
        " .     Like all vampires, she is vulnerable to holy items and sunlight, can be killed by ": null
    },
    {
        "decapitation": "decapitation"
    },
    {
        " or a stake to the heart, and cannot enter the home of a living human without first being invited by someone who lives there.       Actress ": null
    },
    {
        "Juliet Landau": "juliet landau"
    },
    {
        " said that when she first received the script, it indicated that Drusillas accent could be British or American. Landau felt Drusilla should really be ": null
    },
    {
        "Cockney": "cockney"
    },
    {
        ", especially with the whole  Sid and Nancy  analogy. Though she never considered portraying Drusilla with a ": null
    },
    {
        "Southern American accent": "southern american english"
    },
    {
        ", as James Marsters had considered for Spike, she notes that invited comparisons with ": null
    },
    {
        "Blanche DuBois": "blanche dubois"
    },
    {
        " would also have been interesting.      Drusillas madness is exhibited in her often-strange dialogue, which is peppered with ": null
    },
    {
        "non sequitur": "non sequitur"
    },
    {
        "s like Spike, do you love my insides? All the parts you cant see? Her behavior is girlish, accompanied by a dark, ": null
    },
    {
        "ironic": "irony"
    },
    {
        " twist. For instance, when she is happy, she will squeal and laugh like a young child, but she is happiest when committing ": null
    },
    {
        "torture": "torture"
    },
    {
        ", hunting humans, or witnessing mass destruction. She has a fondness for china dolls but keeps them blindfolded or gagged. She also loves flowers and cute animals, but is not ": null
    },
    {
        "sane": "sanity"
    },
    {
        " enough to care for them; as she says, Do you like daisies? I plant them but they always die. Everything I put in the ground withers and dies. She even goes so far as to own a ": null
    },
    {
        "Pekingese": "pekingese"
    },
    {
        " puppy. She speaks in a soft, mellow voice which contrasts with her dialogue.     Drusillas costumes were initially intended to be a cross between a ": null
    },
    {
        "Victorian": "victorian fashion"
    },
    {
        " period look and the Kate Moss ": null
    },
    {
        "heroin chic": "heroin chic"
    },
    {
        " fashion look, says Landau.        Drusilla appeared in 42 Buffyverse episodes:   ; Buffy the Vampire Slayer : Drusilla has appeared in 42 episodes, appearing in the second, fifth, and seventh seasons.   Season 42 : ": null
    },
    {
        "School Hard": "school hard"
    },
    {
        " , ": null
    },
    {
        "Halloween": "halloween"
    },
    {
        " , ": null
    },
    {
        "Lie to Me": "lie to me"
    },
    {
        " , ": null
    },
    {
        "Whats My Line, Part One": "whats my line"
    },
    {
        " , ": null
    },
    {
        "Whats My Line, Part Two": "whats my line"
    },
    {
        " , ": null
    },
    {
        "Surprise": "surprise"
    },
    {
        " , ": null
    },
    {
        "Innocence": "innocence"
    },
    {
        " , ": null
    },
    {
        "Bewitched, Bothered and Bewildered": "bewitched, bothered and bewildered"
    },
    {
        " , ": null
    },
    {
        "Passion": "passion"
    },
    {
        " , ": null
    },
    {
        "I Only Have Eyes For You": "i only have eyes for you"
    },
    {
        " , ": null
    },
    {
        "Becoming, Part One": "becoming"
    },
    {
        " , ": null
    },
    {
        "Becoming, Part Two": "becoming"
    },
    {
        "   Season 42 : ": null
    },
    {
        "Fool for Love": "fool for love"
    },
    {
        " , ": null
    },
    {
        "Crush": "crush"
    },
    {
        "   Season 42 : ": null
    },
    {
        "Lessons": "lessons"
    },
    {
        " , ": null
    },
    {
        "Bring on the Night": "bring on the night"
    },
    {
        " , ": null
    },
    {
        "Lies My Parents Told Me": "lies my parents told me"
    },
    {
        "     ;  Angel  : Drusilla has appeared in 42 episodes, appearing in the second and fifth seasons.   Season 42 : ": null
    },
    {
        "Dear Boy": "dear boy"
    },
    {
        " , ": null
    },
    {
        "Darla": "darla"
    },
    {
        " , ": null
    },
    {
        "The Trial": "the trial"
    },
    {
        " , ": null
    },
    {
        "Reunion": "reunion"
    },
    {
        " , ": null
    },
    {
        "Redefinition": "redefinition"
    },
    {
        "   Season 42 : ": null
    },
    {
        "Destiny": "destiny"
    },
    {
        " , ": null
    },
    {
        "The Girl in Question": "the girl in question"
    },
    {
        "     : Drusilla also appears in issues 42 and 42 of the canonical  Angel  comics . These are co-written by Landau, and tell the story of Drusilla after the television series.     Other stories featuring Drusilla include ": null
    },
    {
        "The Problem With Vampires": "tales of the vampiresissue1"
    },
    {
        " , from the 42 comic mini-series Tales of the Vampires. Drusilla appears in a number comics/novels of the Buffy/Angel expanded universe. She appears notably in her own mini-series:  Spike & Dru ": null
    }
]