[
    {
        "      The French ": null
    },
    {
        "lordship": "fief"
    },
    {
        " of Montpensier , located in historical ": null
    },
    {
        "Auvergne": "auvergne"
    },
    {
        ", became a ": null
    },
    {
        "countship": "countship"
    },
    {
        " in the 42th century.     It changed hands from the House of Thiern, to the House of Beaujeau, to the House of Drieux, to the House of Beaujeau again, and finally to the House of Ventadour, before it was sold in 42 by Bernard and Robert de Ventadour to ": null
    },
    {
        "John, Duke of Berry": "john, duke of berry"
    },
    {
        ", whose sons Charles and John were the first two to hold the title of Count of Montpensier.     After their deaths without issue, their younger sister Marie brought the countship to her third husband, ": null
    },
    {
        "John I, Duke of Bourbon": "john i, duke of bourbon"
    },
    {
        " . The countship was subsequently held by ": null
    },
    {
        "Louis de Bourbon": "louis i, count of montpensier"
    },
    {
        ", the younger son of John and Marie, and by his descendants up to ": null
    },
    {
        "Charles de Bourbon-Montpensier": "charles iii, duke of bourbon"
    },
    {
        ", the famous constable, who became duke of Bourbon by his marriage with his cousin, ": null
    },
    {
        "Suzanne de Bourbon": "suzanne, duchess of bourbon"
    },
    {
        ", in 42     In 42 & ndash;42 and 42–42 Montpensier followed the succession in ": null
    },
    {
        "Duchy of Auvergne": "duchy of auvergne"
    },
    {
        ", and from 42 onwards that of ": null
    },
    {
        "Dauphinate of Auvergne": "rulers of auvergnedauphins of auvergne"
    },
    {
        ".     Confiscated by King ": null
    },
    {
        "Francis I": "francis i of france"
    },
    {
        ", the countship was restored in 42 to ": null
    },
    {
        "Louise de Bourbon": "louise de bourbon, duchess of montpensier"
    },
    {
        ", sister of the ": null
    },
    {
        "Constable of France": "charles iii, duke of bourbon"
    },
    {
        ", and widow of the prince de ": null
    },
    {
        "La Roche-sur-Yon": "la roche-sur-yon"
    },
    {
        ", and to her son ": null
    },
    {
        "Louis": "louis iii de bourbon, duke of montpensier"
    },
    {
        ", and was erected into a ": null
    },
    {
        "duchy": "duchy"
    },
    {
        " in the ": null
    },
    {
        "peerage": "peerage"
    },
    {
        " of France  in 42 ": null
    },
    {
        "Marie": "marie, duchess of montpensier"
    },
    {
        ", daughter and heiress of Henry, Duke of Montpensier, brought the duchy to her husband ": null
    },
    {
        "Gaston, Duke of Orléans": "gaston, duke of orléans"
    },
    {
        ", brother of ": null
    },
    {
        "Louis XIII": "louis xiii of france"
    },
    {
        ", whom she married in 42 and their daughter and heiress, known as  La Grande Mademoiselle  was duchess of Montpensier.     When Mademoiselle Anne died childless, her heir was ": null
    },
    {
        "Elisabeth Charlotte, Princess Palatine": "elisabeth charlotte, princess palatine"
    },
    {
        ", the then wife of ": null
    },
    {
        "Duke of Orléans": "duke of orléans"
    },
    {
        ". The title subsequently remained in the ": null
    },
    {
        "Orléans": "orléans"
    },
    {
        " family, and was borne in particular by Antoine Philippe , son of ": null
    },
    {
        "Philippe Egalité": "philippe egalité"
    },
    {
        ", and by Antoine Marie Philippe Louis , son of King ": null
    },
    {
        "Louis-Philippe": "louis-philippe of france"
    },
    {
        " and father-in-law of King ": null
    },
    {
        "Alphonso XII of Spain": "alphonso xii of spain"
    },
    {
        ". Mademoiselle de Montpensier was a title conferred upon some women of the royal family, namely during the years previous to the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ".       ": null
    },
    {
        "Guy of Thiers, Seigneur of Montpensier": "guy of thiers, seigneur of montpensier"
    },
    {
        "   Agnès of Thiers, Dame of Montpensier": "agnès of thiers, dame of montpensier"
    },
    {
        " - daughter who married ": null
    },
    {
        "Humbert IV of Beaujeu, Sire of Beaujeu": "humbert iv of beaujeu, sire of beaujeu"
    },
    {
        " and Seigneur of Montpensier   ": null
    },
    {
        "Guichard I of Beaujeu, Seigneur of Montpensier": "guichard i of beaujeu, seigneur of montpensier"
    },
    {
        " - son   ": null
    },
    {
        "Guichard II of Beaujeu, Seigneur of Montpensier": "guichard ii of beaujeu, seigneur of montpensier"
    },
    {
        " - son   ": null
    },
    {
        "Humbert II of Beaujeu, Seigneur of Montpensier": "humbert ii of beaujeu, seigneur of montpensier"
    },
    {
        " - son   ": null
    },
    {
        "Jeanne of Beaujeu, Dame of Montpensier": "jeanne of beaujeu, dame of montpensier"
    },
    {
        " - daughter who married ": null
    },
    {
        "Jean II of Drieux, Count of Dreux": "jean ii of drieux, count of dreux"
    },
    {
        ", Seigneur of Montpensier   ": null
    },
    {
        "Robert V of Dreux, Seigneur of Montpensier": "robert v of dreux, seigneur of montpensier"
    },
    {
        " - son   ": null
    },
    {
        "Jean III of Dreux, Seigneur of Montpensier": "jean iii of dreux, seigneur of montpensier"
    },
    {
        " - brother   ": null
    },
    {
        "Pierre of Dreux, Seigneur of Montpensier": "pierre of dreux, seigneur of montpensier"
    },
    {
        " brother   ": null
    },
    {
        "Jeanne I of Dreux, Dame of Montpensier": "jeanne i of dreux, dame of montpensier"
    },
    {
        " - daughter   ": null
    },
    {
        "Louis I of Beaujeu, Seigneur of Montpensier": "louis i of beaujeu, seigneur of montpensier"
    },
    {
        " - descendant of a brother of Humbert II of Beaujeu, Seigneur of Montpensier   Marguerite of Beaujeu, Dame of Montpensier - daughter who married Ebles VIII of Ventadour, Viscount of Ventadour , Seigneur of Montpensier   Bernard of Ventadour, Seigneur of Montpensier - son       Charles de Valois, Count of Montpensier - son of ": null
    },
    {
        "John de Valois, Duke of Berry and Auvergne": "john, duke of berry"
    },
    {
        "   John de Valois, Count of Montpensier - brother   Marie of Valois, Countess of Montpensier - sister of John; in 42 she married ": null
    },
    {
        "John I, Duke of Bourbon": "john i, duke of bourbon"
    },
    {
        "   Louis I de Bourbon, Count of Montpensier - third and younger surviving son   Gilbert de Bourbon, Count of Montpensier - son of Louis I   Louis II de Bourbon, Count of Montpensier - son of Gilbert   Charles III de Bourbon, Count of Montpensier - brother of Louis II       Louise de Bourbon, Duchess of Montpensier - sister of Charles III   Louis de Bourbon, Duke of Montpensier - son of Louise   François de Bourbon, Duke of Montpensier - son of Louis   Henri de Bourbon, Duke of Montpensier - son of François   Marie de Bourbon, Duchess of Montpensier - daughter of Henri   Anne Marie Louise dOrléans, Duchess of Montpensier  - daughter of Marie   Philippe de France, Duke of Orléans - first cousin of Anne Marie Louise, given title in 42 by Louis XIV   Philippe dOrléans, Duke of Orléans, Duke of Montpensier - son of Philippe   Louis dOrléans, Duke of Orléans, Duke of Montpensier - son of Philippe   Louis Philippe dOrléans, Duke of Orléans, Duke of Montpensier - son of Louis   Philippe dOrléans, Duke of Orléans, Duke of Montpensier  - son of Louis Philippe I   Louis Philippe dOrléans, King of the French, Duke of Montpensier - son of Louis Philippe Joseph   Philippe dOrléans, Count of Paris, Duke of Montpensier - grandson of Louis Philippe   Philippe dOrléans, Duke of Orléans, Duke of Montpensier - son of Philippe   Jean dOrléans, Duke of Guise, Duke of Montpensier - cousin of Philippe   Henri dOrléans, Count of Paris, Duke of Montpensier - son of Jean   Henri dOrléans, Count of Paris, Duke of France, Duke of Montpensier - son of Henri       The title Duke of Montpensier has been used as a courtesy title by other members of the House of Orléans:     ": null
    },
    {
        "Antoine Philippe dOrléans, Duke of Montpensier": "antoine philippe, duke of montpensier"
    },
    {
        " second son of ": null
    },
    {
        "Louis Philippe II, Duke of Orléans": "louis philippe ii, duke of orléans"
    },
    {
        " Antoine dOrléans, Duke of Montpensier": "antoine, duke of montpensier"
    },
    {
        " youngest son of ": null
    },
    {
        "Louis Philippe, King of the French": "louis-philippe of france"
    },
    {
        " Duchess Marie Therese of Württemberg, Duchess of Montpensier": "duchess marie therese of württemberg"
    },
    {
        " , wife of ": null
    },
    {
        "Henri, comte de Paris, duc de France": "henri, count of paris"
    }
]