[
    {
        "        Duke Nukem 3D is a ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " video game": "video game"
    },
    {
        " developed by ": null
    },
    {
        "3D Realms": "3d realms"
    },
    {
        ". It is a sequel to the ": null
    },
    {
        "platform games": "platform game"
    },
    {
        "  Duke Nukem  and  Duke Nukem II , published by 3D Realms.     Duke Nukem 3D features the adventures of the titular ": null
    },
    {
        "Duke Nukem": "duke nukem"
    },
    {
        ", voiced by ": null
    },
    {
        "Jon St. John": "jon st. john"
    },
    {
        ", who fights against an ": null
    },
    {
        "alien invasion": "alien invasion"
    },
    {
        " on Earth. Along with  Wolfenstein 3D  and  Doom , Duke Nukem 3D is considered to be responsible for popularizing first-person shooters, and was released to major acclaim. Reviewers praised the interactivity of the environments, gameplay, level design, and unique risqué humor, a mix of pop-culture satire and lampooning of over-the-top Hollywood action heroes. The games violent nature, ": null
    },
    {
        "erotic elements": "eroticism"
    },
    {
        ", and ": null
    },
    {
        "portrayal of women": "gender representation in video games"
    },
    {
        " incited controversy.     The shareware version of the game was originally released on January 29, 1996, while the full version was released on April 19, 1996 as version 1.3d. The Plutonium PAK, an expansion pack which updated the game to version 1.4 and added a fourth eleven-level episode, was released in November 1996. The Atomic Edition, a standalone version of the game that included the content from the Plutonium PAK and updated the game to version 1.5, was later released; the original version of Duke Nukem 3D has since been discontinued. An official fifth episode was released on October 11, 2016 with 20th Anniversary World Tour published by ": null
    },
    {
        "Gearbox Software": "gearbox software"
    },
    {
        ". After ": null
    },
    {
        "fifteen years": "development of duke nukem forever"
    },
    {
        " in ": null
    },
    {
        "development hell": "development hell"
    },
    {
        ", a direct sequel was released in 2011 called  Duke Nukem Forever .          As a ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " whose gameplay is similar to  Doom , the gameplay of Duke Nukem 3D involves moving through levels presented from the protagonists point of view, shooting enemies on the way. The environments in Duke Nukem 3D are highly destructible and interactive; most props can be destroyed by the player.     Levels were designed in a fairly non-linear manner such that players can advantageously use ": null
    },
    {
        "air duct": "air duct"
    },
    {
        "s, back doors, and sewers to avoid enemies or find hidden caches. These locations are also filled with objects with which the player can interact, that either benefit the player in some form, light switches make it easier to see, while ": null
    },
    {
        "water fountains": "water fountain"
    },
    {
        "and broken ": null
    },
    {
        "hydrants": "hydrant"
    },
    {
        "provide some health points or simply diversion, and tipping ": null
    },
    {
        "strippers": "strippers"
    },
    {
        " provokes a quote from Duke, and a provocative reveal from the dancer.     Dukes arsenal consists of the Mighty Foot , a ": null
    },
    {
        "pistol": "pistol"
    },
    {
        ", a ": null
    },
    {
        "shotgun": "shotgun"
    },
    {
        ", a triple-barrelled ": null
    },
    {
        "chain gun": "chain gun"
    },
    {
        ", a ": null
    },
    {
        "rocket-propelled grenade launcher": "rocket-propelled grenade"
    },
    {
        ", ": null
    },
    {
        "pipe bomb": "pipe bomb"
    },
    {
        "s, freeze and ": null
    },
    {
        "shrink ray": "shrink ray"
    },
    {
        "s, laser ": null
    },
    {
        "land mines": "land mines"
    },
    {
        ", and the rapid fire Devastator rocket launcher. There is also an extra weapon known as the Expander , the opposite of the shrink ray weapon, which is only available in the Atomic Edition version of the game.     Various items can be picked up during gameplay. The portable ": null
    },
    {
        "medkit": "first-aid kit"
    },
    {
        " allows players to heal Duke at will. ": null
    },
    {
        "Steroids": "steroid"
    },
    {
        "speed up Dukes movement, as well as instantly reversing the effects of the shrink ray weapon and increasing the strength of Dukes Mighty Foot for a short period. ": null
    },
    {
        "Night vision": "night vision"
    },
    {
        " goggles allow players to see enemies in the dark. The HoloDuke device projects a ": null
    },
    {
        "hologram": "hologram"
    },
    {
        " of Duke which can be used to distract enemies. Protective boots allow Duke to cross dangerously hot or toxic terrain. In sections where progress requires more aquatic legwork, an ": null
    },
    {
        "aqua-lung": "aqua-lung"
    },
    {
        " allows Duke to take longer trips underwater. Dukes ": null
    },
    {
        "jet pack": "jet pack"
    },
    {
        " allows the player to move vertically and gain access to otherwise inaccessible areas.     The game features a wide variety of enemies; some of which are ": null
    },
    {
        "aliens": "extraterrestrial life in culture"
    },
    {
        " and other ": null
    },
    {
        "mutated": "mutant"
    },
    {
        " humans. The ": null
    },
    {
        "LAPD": "los angeles police department"
    },
    {
        " have been turned into Pig Cops , a ": null
    },
    {
        "play": "play on words"
    },
    {
        " on the derogatory term pig for police officers, with LARD emblazoned on their uniforms. As is usual for a first-person shooter, Duke Nukem encounters a large number of lesser foes, as well as ": null
    },
    {
        "bosses": "boss"
    },
    {
        ", usually at the end of episodes. Like Duke, these enemies have access to a wide range of weapons and equipment, and some weaker enemies have jet packs.       Duke Nukem 3D features multiplayer. At the time of its release, Internet-based gaming was just beginning. Duke Nukem 3D did not support the ": null
    },
    {
        "TCP/IP": "tcp/ip"
    },
    {
        " client/server model, instead based its network play on the ": null
    },
    {
        "IPX": "ipx"
    },
    {
        " LAN": "lan"
    },
    {
        ", modem or serial cable. Duke Nukem 3D players often either battled modem-to-modem, using the IPX network utility ": null
    },
    {
        "Kali": "kali"
    },
    {
        " or the ": null
    },
    {
        "Total Entertainment Network": "total entertainment network"
    },
    {
        " online pay service. Kali allowed users to connect to a chat room to host and join games. Duke Nukem 3D was one of the more popular games on TEN prior to the closure of the network in 1999. The game was also supported by ": null
    },
    {
        "DWANGO": "dwango"
    },
    {
        ".     Duke Nukem 3D levels were often used as the battlegrounds for these encounters, and users were even able to create their own ": null
    },
    {
        "levels": "level"
    },
    {
        ", or maps, using the ": null
    },
    {
        "level editor": "build engine"
    },
    {
        " bundled with the game, which was also used by the developers to design the initial levels. The game also features co-operative play which allows players to complete the story-based mode together. In Duke Nukem 3D: Atomic Edition, a new gameplay mode was introduced: Duke-Tag, a ": null
    },
    {
        "capture the flag": "capture the flag"
    },
    {
        " style mode.     Duke Nukem 3D has been ported to run on modern Microsoft Windows variants including Windows XP, Windows 7, and Windows 8. This has been made possible since the games ": null
    },
    {
        "source code": "source code"
    },
    {
        " was publicly released in 2003. Various ": null
    },
    {
        "source ports": "source port"
    },
    {
        "have been made including EDuke32, JFDuke3D, nDuke, hDuke, and xDuke. All five offer the original visual appearance of the game, while EDuke32 also supports ": null
    },
    {
        "OpenGL": "opengl"
    },
    {
        " rendering including the capability to use fan-created modern graphics using the High Resolution Pack. nDuke, hDuke and xDuke can still be played online in multiplayer DukeMatch format using launchers such as Duke Matcher and YANG, both freely available. EDuke32 multiplayer is in a state of ": null
    },
    {
        "development hell": "development hell"
    },
    {
        " following an attempt to rewrite the network functionality using a ": null
    },
    {
        "client–server model": "client–server model"
    },
    {
        ".         Duke Nukem 3D is set on Earth sometime in the early 21st century . The levels of Duke Nukem 3D take players outdoors and indoors through rendered street scenes, military bases, ": null
    },
    {
        "desert": "desert"
    },
    {
        "s, a flooded city, ": null
    },
    {
        "space station": "space station"
    },
    {
        "s, moon bases, and a ": null
    },
    {
        "Japanese": "japanese cuisine"
    },
    {
        " restaurant.     The game contains several humorous references to pop culture. Some of Dukes lines are drawn from movies such as  Aliens ,  Dirty Harry ,  Evil Dead II ,  Full Metal Jacket ,  Jaws ,  Pulp Fiction , and  They Live ; the captured women saying Kill me is a reference to Aliens. Players will encounter corpses of famous characters such as ": null
    },
    {
        "Luke Skywalker": "luke skywalker"
    },
    {
        ", ": null
    },
    {
        "Indiana Jones": "indiana jones"
    },
    {
        ", ": null
    },
    {
        "Snake Plissken": "snake plissken"
    },
    {
        ", ": null
    },
    {
        "the protagonist": "doomguy"
    },
    {
        " of  Doom , and a smashed ": null
    },
    {
        "T-800": "terminator"
    },
    {
        ". In the first episode, players navigate a tunnel in the wall of a prison cell hidden behind a poster, just like in  The Shawshank Redemption . During the second episode, players can see ": null
    },
    {
        "The Monolith": "monolith"
    },
    {
        "  on the moon. In the bathroom of the first level, ": null
    },
    {
        "867-5309": "867-5309"
    },
    {
        " is written on a wall.     The game cover itself is a parody of  Army of Darkness , with Duke posing as ": null
    },
    {
        "Ash Williams": "ash williams"
    },
    {
        ".       There is little narrative in the game, only a brief text prelude located under Help in the Main Menu, and a few ": null
    },
    {
        "cutscenes": "cutscene"
    },
    {
        "after the completion of an episode. The game picks up right after the events of  Duke Nukem II , with Duke returning to Earth in his space cruiser. As Duke descends on ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " in hopes of taking a vacation, his ship is shot down by unknown hostiles. While sending a distress signal, Duke learns that aliens are attacking Los Angeles and have mutated the ": null
    },
    {
        "LAPD": "lapd"
    },
    {
        ". With his vacation plans now ruined, Duke hits the eject button, and vows to do whatever it takes to stop the alien invasion.     In Episode One: L.A. Meltdown , Duke fights his way through a ": null
    },
    {
        "dystopia": "dystopia"
    },
    {
        "n Los Angeles. At a ": null
    },
    {
        "strip club": "strip club"
    },
    {
        ", he is captured by pig-cops, but escapes the alien-controlled penitentiary and tracks down the alien cruiser responsible for the invasion in the ": null
    },
    {
        "San Andreas Fault": "san andreas fault"
    },
    {
        ". Duke discovers that the aliens were capturing women, and detonates the ship. Levels in this episode include a movie theater, a Red Light District, a prison, and a nuclear-waste disposal facility.     In Episode Two: Lunar Apocalypse , Duke journeys to ": null
    },
    {
        "space": "outer space"
    },
    {
        ", where he finds many of the captured women held in various ": null
    },
    {
        "incubators": "incubator"
    },
    {
        "throughout space stations that had been conquered by the aliens. Duke reaches the alien mothership on the Moon and kills an alien Overlord. As Duke inspects the ships computer, it is revealed that the plot to capture women was merely a ruse to distract him. The aliens have already begun their attack on Earth.     In Episode Three: Shrapnel City , Duke battles the massive alien resistance through Los Angeles once again, and kills the leader of the alien menace: the Cycloid Emperor. The game ends as Duke promises that after some ": null
    },
    {
        "R & R": "r & r"
    },
    {
        " , he will be ...ready for more action! , as an anonymous woman calls him back to bed. Levels in this episode include a sushi bar, a movie set, a subway, and a hotel.     The story continues in the Atomic Edition. In Episode Four: The Birth , it is revealed that the aliens used a captured woman to give birth to the Alien Queen, a creature which can quickly spawn deadly alien protector drones. Duke is dispatched back to Los Angeles to fight hordes of aliens, including the protector drones. Eventually, Duke finds the lair of the Alien Queen, and kills her, thus thwarting the alien plot. Levels in this episode include a fast-food restaurant , a supermarket, a Disneyland parody called Babe Land, a police station, the ": null
    },
    {
        "Exxon Valdez": "exxon valdez"
    },
    {
        ", and ": null
    },
    {
        "Area 51": "area 51"
    },
    {
        ".     With the release of 20th Anniversary World Tour, the story progresses further. In Episode Five: Alien World Order , Duke finds out that the aliens initiated a world-scale invasion, so he sets out to repel their attack on various countries. Duke proceeds to clear out aliens from ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        ", ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ", ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", ": null
    },
    {
        "the Pyramids at Giza": "the pyramids at giza"
    },
    {
        ", and ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", with the final showdown with the returning alien threat taking place in Los Angeles, taking the game full circle. There, he defeats the Cycloid Incinerator, the current alien leader, stopping their threat for good.       Duke Nukem 3D was developed on a budget of roughly $300,000. The development team consisted of eight people for most of the development cycle, increasing to 12 or 13 people near the end. At one point, the game was being programmed to allow the player to switch between first person view, third person view, and fixed camera angles. ": null
    },
    {
        "Scott Miller": "scott miller"
    },
    {
        " of 3D Realms recalled that with Duke 3D, unlike every shooter that came before, we wanted to have sort of real life locations like a cinema theatre, you know, strip club, bookstores...     LameDuke is a ": null
    },
    {
        "beta version": "beta version"
    },
    {
        " of Duke Nukem 3D, which was released by 3D Realms as a bonus one year after the release of the official version. It has been released as is, with no support. LameDuke features four episodes: Mr. Caliber, Mission Cockroach, Suck Hole, and Hard Landing. Certain weapons were altered from the original versions and/or removed.     ": null
    },
    {
        "Lee Jacksons": "lee jackson"
    },
    {
        "theme song Grabbag has elicited many spin-offs and remixes over the years by both fans and professional musicians, including an officially sanctioned studio version by the popular ": null
    },
    {
        "thrash metal": "thrash metal"
    },
    {
        " outfit ": null
    },
    {
        "Megadeth": "megadeth"
    },
    {
        ". Another version of the song was recorded by ": null
    },
    {
        "Chris Kline": "chris kline"
    },
    {
        " in August 2005. ": null
    },
    {
        "3D Realms": "3d realms"
    },
    {
        " featured it on the front page of their website and contracted with Kline to use it to promote their ": null
    },
    {
        "Xbox Live": "xbox live"
    },
    {
        " release of Duke Nukem 3D.     The original official website was created by ": null
    },
    {
        "Jeffrey D. Erb": "jeffrey d. erb"
    },
    {
        " and Mark Farish of Intersphere Communications Ltd.         Shareware Version: The shareware version was the early version released on January 29, 1996 and contained the original first episode, but does not include the other two episodes, this version originally intended to be a demonstration of the game on the old shareware distribution model, so 3D Realms only officially allowed this version to be shared between multiple users.   Full Version: The full version was the first official version released on April 19, 1996 and contained the original three episodes. It also includes the full versions of Duke Nukem and Duke Nukem II as bonus content.   Plutonium PAK/Atomic Edition: The Atomic Edition of Duke Nukem 3D was released in November 1996 as a standalone game. It contained the original three episodes, as well as a new eleven-level fourth episode, bringing the level total to 41 as opposed to 30 in the original Duke Nukem 3D. The Plutonium PAK was released as an upgrade package to convert the original release of Duke Nukem 3D to the Atomic Edition . It introduced two new enemies, the Protector Drone and the Pig Cop Tank, a new final boss, the Alien Queen, and a new weapon, the Expander. Changes to the script made the game easier to ": null
    },
    {
        "mod": "mod"
    },
    {
        ", and players could set up a multiplayer session against CPU ": null
    },
    {
        "bots": "artificial intelligence"
    },
    {
        ". This is the only official add-on for the game developed by 3D Realms. Unlike the original release of Duke Nukem 3D, however, the Atomic Edition does not include Duke Nukem and Duke Nukem II.   East Meets West: Released in 1998, includes Duke Nukem 3D: Atomic Edition and the full version of  Shadow Warrior .   Duke: The Apocalypse contains Duke!ZONE II, Duke Xtreme, and a T-shirt.   Duke: The Apocalypse 2 contains Duke!ZONE, Duke It Out In D.C., a strategy guide, and a T-shirt.   Kill-A-Ton Collection: The Kill-A-Ton Collection was released in 1998 and includes: Duke Nukem I , Duke Nukem II, Duke Nukem 3D , Duke It Out In D.C., Duke!ZONE II, Duke Xtreme, and various editing utilities.   GOG Version: The Atomic Edition was released on ": null
    },
    {
        "GOG.com": "gog.com"
    },
    {
        " along with Duke Nukem 1, 2 and Manhattan Project in 2009. The entire catalog was removed from the website on December 31, 2015 due to a licensing agreement with ": null
    },
    {
        "Gearbox Software": "gearbox software"
    },
    {
        ".   Megaton Edition: Developed by General Arcade and published by ": null
    },
    {
        "Devolver Digital": "devolver digital"
    },
    {
        ", it was released through ": null
    },
    {
        "Steam": "steam"
    },
    {
        " on March 20, 2013. The Megaton Edition includes Duke Nukem 3D: Atomic Edition, Duke It Out In D.C., Duke Caribbean: Lifes a Beach, and Duke: Nuclear Winter all running on OpenGL, as well as the original MS-DOS version of Duke Nukem 3D: Atomic Edition. It supports SteamPlay for Windows, Mac OS X, and Linux, and is based on the code of the JFDuke3D source port by Jonathon Fowler. Online multiplayer was added to the game in January 2014. However, about a year later, the Megaton Edition was removed from all digital distribution as Devolver Digitals agreement with Gearbox Software has ended now that the latter company currently owns the ": null
    },
    {
        "intellectual property": "intellectual property"
    },
    {
        ". In 2016, Gearbox informed TechRaptor that they have plans to bring the game back this year, and that game became the 20th Anniversary World Tour.   Kill-a-Ton 2015 Collection: Released in May 2015 on ": null
    },
    {
        "Steam": "steam"
    },
    {
        ", includes everything that Kill-a-Ton Collection contained , plus two other expansions, Duke Caribbean: Lifes a Beach, and Duke: Nuclear Winter, as well as  Duke Nukem: Manhattan Project  and the  Balls of Steel  game. Like with the ": null
    },
    {
        "GOG.com": "gog.com"
    },
    {
        " release and Megaton Edition, it was removed from Steam at the end of 2015.   20th Anniversary World Tour: Developed by ": null
    },
    {
        "Nerve Software": "nerve software"
    },
    {
        " and Gearbox Software and published by Gearbox Publishing. It was announced by Gearbox Software on September 2, 2016 at PAX East, and its a re-release for the ": null
    },
    {
        "Xbox One": "xbox one"
    },
    {
        ", ": null
    },
    {
        "PlayStation 4": "playstation 4"
    },
    {
        ", and PC via Steam. World Tour includes an all-new 5th episode by the original episode designers, new music by composer ": null
    },
    {
        "Lee Jackson": "lee jackson"
    },
    {
        ", re-recorded voice lines by ": null
    },
    {
        "Jon St. John": "jon st. john"
    },
    {
        ", new enemies and new lighting effects. However, it does not contain the expansions from Kill-A-Ton Collection and Megaton Edition. World Tour was released on October 11, 2016.       Duke It Out In D.C.: This is an authorized add-on developed by ": null
    },
    {
        "Sunstorm Interactive": "sunstorm interactive"
    },
    {
        " and published by ": null
    },
    {
        "WizardWorks": "wizardworks"
    },
    {
        "; it was released in March 1997. President ": null
    },
    {
        "Bill Clinton": "bill clinton"
    },
    {
        " is captured by alien forces, and Duke must save him. This expansion pack featured 10 new levels that were based on real-world locations, such as: the ": null
    },
    {
        "White House": "white house"
    },
    {
        ", the ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        " headquarters, the ": null
    },
    {
        "Smithsonian": "smithsonian"
    },
    {
        " museum, the ": null
    },
    {
        "Washington Monument": "washington monument"
    },
    {
        ", and other areas in Washington, D.C. The add-on was also included as part of an official compilation called Duke Nukem: Kill-A-Ton Collection through business deals with 3D Realms. Charlie Wiederhold created levels for this add-on.   Duke Caribbean: Lifes a Beach: This is an authorized add-on developed by Sunstorm Interactive and published by WizardWorks; it was released in December 1997. Duke is relaxing on a tropical island when he discovers that the aliens are having their own vacation . This add-on includes a sunny Caribbean theme with 12 new levels that take place on beaches and vacation hotels. Charlie Wiederhold created several levels for this add-on. Wiederhold was later hired by 3D Realms to work on the sequel  Duke Nukem Forever .   Duke: Nuclear Winter: This is an authorized add-on developed by Simply Silly Software and published by WizardWorks; it was released in December 1997. ": null
    },
    {
        "Santa Claus": "santa claus"
    },
    {
        " is being mind-controlled by aliens into causing trouble on Earth. Several of the levels take place in ": null
    },
    {
        "Alaska": "alaska"
    },
    {
        " and the ": null
    },
    {
        "North Pole": "north pole"
    },
    {
        ".   Duke!ZONE: An authorized add-on released in 1996, published by WizardWorks, which includes 500 fan-made levels and various editing utilities.   Duke!ZONE II: An authorized follow-up add-on to Duke!ZONE, published by WizardWorks and released in 1997. Duke!ZONE II contains three new episodes, each containing seven levels, created by Simply Silly Software and the same 500 fan-made levels from the original Duke!ZONE.   Duke Xtreme: An authorized add-on released in 1997 and developed by Sunstorm Interactive, containing 50 levels and various editing utilities.   Duke Assault: An add-on released in 1997 containing over 1,500 levels for Duke Nukem 3D. It was published by WizardWorks and created by fans in the Duke Nukem 3D modding community.   Duke Nukems Penthouse Paradise: This is an official add-on for Duke Nukem 3D, created by ": null
    },
    {
        "Jeffrey D. Erb": "jeffrey d. erb"
    },
    {
        " and Mark Farish of Intersphere Communications Ltd. and available exclusively from ": null
    },
    {
        "GT Interactive": "gt interactive"
    },
    {
        " and ": null
    },
    {
        "Penthouse Magazine": "penthouse magazine"
    },
    {
        " in May 1997. Taking place between Duke Nukem 3D and the Atomic Edition, aliens interrupt Dukes R & R and a couple of Penthouse photo shoots. Duke has to fight his way through a hotel, clubs, and, finally, the Penthouse offices. The level features music from the industrial rock band ": null
    },
    {
        "Needle": "needle"
    },
    {
        ".   Duke - Its Zero Hour: An add-on developed by ZeroHour Software and released in November 1997. It was originally slated to be a retail product via WizardWorks, but the developers ended up releasing it for free. It has 11 new levels that feature 12 all-new monsters, five new weapons, music, and sound effects.       Duke Nukem 3D was ported to many consoles of the time. All of the ports featured some sort of new content.     Duke Nukem 3D  was released in 1997 in the USA only. Unlike every other version of the game, Duke Nukem cannot turn; he can only move forward, backward, and strafe to the left or right. Due to the Game.coms monochrome screen, it is also the only version to lack color. It only includes four levels from each of the original three episodes for a total of 12 levels. These levels were modified to accommodate Duke Nukems inability to turn.   Duke Nukem 3D  was ported by ": null
    },
    {
        "Lobotomy Software": "lobotomy software"
    },
    {
        " and published by ": null
    },
    {
        "Sega": "sega"
    },
    {
        " in 1997. It retains the original name and uses Lobotomy Softwares own fully 3D SlaveDriver engine. This version uses the ": null
    },
    {
        "Sega NetLink": "sega netlink"
    },
    {
        " for online gaming, and has built-in support for the Saturns analog pad. It also includes a hidden multiplayer mini-game called  Death Tank Zwei , and an exclusive bonus level called Urea 51, accessed through the level Fahrenheit . It was the final game branded by Sega of America under the Deep Water label, employed for games featuring adult content such as  Eternal Champions: Challenge from the Dark Side .   Duke Nukem: Total Meltdown , the ": null
    },
    {
        "PlayStation": "playstation"
    },
    {
        " port released in 1997, contains all three original episodes, plus an exclusive fourth episode, Plug n Pray, which includes six new levels and a secret level. The secret level was also included in the PC version of Duke Nukem 3D. The new episode features several new enemies, including three new types of Pig Cops, and a new final boss, the CyberKeef. This version also features remixed music, some rearranged from the PC version, and some original, in streaming XA-Audio made by ": null
    },
    {
        "Mark Knight": "mark knight"
    },
    {
        ".      Duke Nukem 64 is a port released in 1997 for the ": null
    },
    {
        "Nintendo 64": "nintendo 64"
    },
    {
        " which features a ": null
    },
    {
        "split screen": "split screen"
    },
    {
        " 4-player mode.  In-game music was removed due to ": null
    },
    {
        "limited storage capacity": "nintendo 64 game pak"
    },
    {
        ", many items were renamed to avoid drug and sex references, and new lines of dialogue were recorded specifically for this version to remove profanity. Several levels were altered to include areas from the Atomic Edition, such as a Duke Burger outlet in the second level which was not in the original PC version. Levels are played sequentially instead of as separate episodes. Other changes include the addition of four new weapons, dual sub-machine guns, a grenade launcher, a missile launcher, and the Plasma Cannon, alternative ammo types for the pistol, shotgun, and missile launcher, and a fully 3D model for the Cycloid Emperor boss. The Protector Drone, an enemy from the Atomic Edition, also appears a few times in the standard levels.      Duke Nukem 3D  was released in 1998 by ": null
    },
    {
        "Tec Toy": "tec toy"
    },
    {
        ". The visuals were drastically simplified, being closer to early shooters like  Wolfenstein 3D . It consisted solely of Lunar Apocalypse, the second from the original games three episodes, which was heavily modified to suit the game engine. This version was released in ": null
    },
    {
        "South America": "south america"
    },
    {
        " only. In 2015, Piko Interactive acquired the rights to the port from Tec Toy and released it worldwide in cartridge form on October 16, 2015.   Duke Nukem 3D  was released on September 24, 2008. This version features: the ability to rewind the game to any prior point upon dying, save clips of gameplay, and play cooperatively online, as well as the standard Dukematch online multiplayer mode. The music received a slight quality upgrade with modern ": null
    },
    {
        "MIDI": "midi"
    },
    {
        " tools.   Duke Nukem 3D  was released on August 11, 2009, and ported by MachineWorks Northwest. The game employs a new engine, which uses a trademarked touch-screen system called TapShoot to allow players to lock onto and dispatch foes. An update in September 2009 made the game compatible with the first and second-generation ": null
    },
    {
        "iPod Touch": "ipod touch"
    },
    {
        ". It also added a new control scheme which lets players control Duke by dragging their finger around the screen.   Duke Nukem 3D  was released on December 29, 2009. As shown in a MaemoWorlds video, Duke is controlled using the Qwerty keypad and touchscreen.   Duke Nukem 3D: Megaton Edition  was released on January 6, 2015 in North America, and January 7, 2015 in Europe. It is a port of the Megaton Edition released on Steam for Windows, Mac, and Linux. It was developed by General Arcade for the ": null
    },
    {
        "PC": "personal computer"
    },
    {
        ", ported to consoles by Abstraction Games, and published by ": null
    },
    {
        "Devolver Digital": "devolver digital"
    },
    {
        ". It features Cross-Buy and Cross-Play between both platforms. As of February 2016, the game is no longer available for download in North America due to publishing rights returning to Gearbox Software.   Duke Nukem 3D: 20th Anniversary World Tour : Released on October 11, 2016. Includes a new 5th episode, made by the original designers and new music by Lee Jackson, the original composer.       Duke Nukem 3D was a commercial hit, selling about 3.5 million copies. In the United States alone, it was the 12th best-selling computer game from 1993 to 1999, with 950,000 units sold. ": null
    },
    {
        "NPD Techworld": "npd techworld"
    },
    {
        ", a firm that tracked sales in the United States,  reported 1.25 million units sold of Duke Nukem 3D by December 2002.           Following the release of the Doom ": null
    },
    {
        "source code": "source code"
    },
    {
        " in 1997, gamers wanted a similar source code release from 3D Realms. The last major game to make use of the Duke Nukem 3D source code was TNT Teams  World War II GI  in 1999. Its programmer, Matthew Saettler, obtained permission from 3D Realms to expand the gameplay enhancements done on WWII GI to Duke Nukem 3D.     EDuke was a semi-official branch of Duke Nukem 3D that was released as a patch as Duke Nukem 3D v2.0 for Atomic Edition users on July 28, 2000. It included a demo mod made by several beta testers. It focused primarily on enhancing the CON scripting language in ways which allowed those modifying the game to do much more with the system than originally possible. Though a further version was planned, it never made it out of beta. It was eventually cancelled due to programmer time constraints. About a month after the release of the Duke Nukem 3D source code,  Blood  project manager Matt Saettler released the source code for both EDuke v2.0 and EDuke v2.1, the test version of which would have eventually become the next EDuke release, under the GPL.     The ": null
    },
    {
        "source code": "source code"
    },
    {
        " to the Duke Nukem 3D v1.5 executable, which uses the Build engine, was released as ": null
    },
    {
        "free software": "free software"
    },
    {
        " under the ": null
    },
    {
        "GPL": "gnu general public license"
    },
    {
        " on April 1, 2003. The game content remains under a proprietary license. The game was quickly ported by enthusiasts to modern operating systems.     The first Duke Nukem 3D port was from icculus.org. It is a cross-platform project that allows the game to be played on ": null
    },
    {
        "AmigaOS": "amigaos"
    },
    {
        ", ": null
    },
    {
        "AmigaOS 4": "amigaos 4"
    },
    {
        ", ": null
    },
    {
        "AROS": "aros"
    },
    {
        ", ": null
    },
    {
        "BeOS": "beos"
    },
    {
        ", ": null
    },
    {
        "FreeBSD": "freebsd"
    },
    {
        ", ": null
    },
    {
        "Linux": "linux"
    },
    {
        ", ": null
    },
    {
        "Mac OS X": "mac os x"
    },
    {
        ", ": null
    },
    {
        "MorphOS": "morphos"
    },
    {
        ", ": null
    },
    {
        "Solaris": "solaris"
    },
    {
        ", and ": null
    },
    {
        "Windows": "microsoft windows"
    },
    {
        " rather than MS-DOS. The icculus.org codebase would later be used as the base for several other ports, including Duke3d_32.     Another popular early project was Jonathon Fowlers JFDuke3D, which, in December 2003, received backing from the original author of Build, programmer ": null
    },
    {
        "Ken Silverman": "ken silverman"
    },
    {
        ". Fowler, in cooperation with Silverman, released a new version of JFDuke3D using ": null
    },
    {
        "Polymost": "build enginepolymost"
    },
    {
        ", an ": null
    },
    {
        "OpenGL": "opengl"
    },
    {
        "-enhanced renderer for Build which allows hardware acceleration and 3D model support along with 32-bit color high resolution textures. Another project based on JFDuke3D called xDuke, unrelated to the xDuke project based on Duke3d_w32, runs on the ": null
    },
    {
        "Xbox": "xbox"
    },
    {
        ". Silverman has since helped Fowler with a large portion of other engine work, including updating the network code, and helping to maintain various other aspects of the engine. Development appears to have stopped; as of January 2015, there have been no new versions since October 9, 2005.     While a few short-lived ": null
    },
    {
        "DOS": "dos"
    },
    {
        "-based EDuke projects emerged, it was not until the release of EDuke32, an extended version of Duke3D incorporating variants of both Fowlers ": null
    },
    {
        "Microsoft Windows": "microsoft windows"
    },
    {
        " JFDuke3D code, and Saettlers EDuke code, by one of 3D Realms forum moderators in late 2004, that EDukes scripting extensions received community focus. Among the various enhancements, support for advanced ": null
    },
    {
        "shader model": "shader model"
    },
    {
        " 3.0 based graphics was added to EDuke32 during late 2008-early 2009. In June 2008, thanks to significant porting contributions from the ": null
    },
    {
        "DOSBox": "dosbox"
    },
    {
        " team, EDuke32 became the only Duke Nukem 3D source port to compile and run natively on ": null
    },
    {
        "64-bit": "64-bit"
    },
    {
        " Linux systems without the use of a 32-bit compatibility environment.     On April 1, 2009, an ": null
    },
    {
        "OpenGL": "opengl"
    },
    {
        " Shader Model 3.0 renderer was revealed to have been developed for EDuke32, named Polymer to distinguish from Ken Silvermans Polymost. It allows for much more modern effects such as dynamic lighting and ": null
    },
    {
        "normal mapping": "normal mapping"
    },
    {
        ". Although Polymer is fully functional, it is technically incomplete and unoptimized, and is still in development. As of the fifth installment of the High Resolution Pack, released in 2011, the Polymer renderer is mandatory. In 2011, another significant development of EDuke32 was the introduction of true room over room , where sectors can be placed over other sectors, and can be seen at the same time. In practice, this allows for true three-dimensional level design that was previously impossible, although the base engine is still 2D.     On December 18, 2012, Chocolate Duke3D port was released. Inspired by  Chocolate Doom , the primary goal was to refactor the code so developers would easily read and learn from it.     In February 2013, a source ": null
    },
    {
        "code review": "code review"
    },
    {
        " article was published that described the internal working of the code.            All versions of the game have earned a positive aggregate score on ": null
    },
    {
        "GameRankings": "gamerankings"
    },
    {
        " and ": null
    },
    {
        "Metacritic": "metacritic"
    },
    {
        ". The original release on MS-DOS holds an aggregate score of 89% on GameRankings and a score of 89/100 on Metacritic. The version released on Nintendo 64 holds an aggregate score of 74% on GameRankings and a score of 73/100 on Metacritic. The version released on Xbox 360 holds an aggregate score of 81% on GameRankings while it holds a score of 80/100 on Metacritic. The iOS version holds an aggregate score of 64% on GameRankings.     Daniel Jevons of Maximum gave it five out of five stars, calling it absolutely perfect in every respect. He particularly cited the games speed and fluidity even on low-end PCs, imaginative weapons, varied and identifiable environments, true 3D level designs, and strong multiplayer mode. A  Next Generation  critic summarized: Duke Nukem 3D has everything Doom doesnt, but it also doesnt leave out the stuff that made Doom a classic. He praised the imaginative weapons, long and complex single-player campaign, competitive multiplayer, built-in level editor, and parental lock. Reviewers paid a lot of attention to the sexual content within the game. Reception of this element varied: Tim Soete of ": null
    },
    {
        "GameSpot": "gamespot"
    },
    {
        " felt that it was morally questionable , while the ": null
    },
    {
        "Game Revolution": "game revolution"
    },
    {
        " reviewer noted that it was done in a tongue-in-cheek manner, and he was not personally offended . GamingOnLinux reviewer Hamish Paul Wilson commented in a later retrospective how the games dark dystopian atmosphere filled with pornography and consumerist decadence in his view helped to ground the games more outlandish and obscene moments in context , concluding that in a world as perverse as this, someone like Duke becoming its hero seems almost inevitable.     Next Generation reviewed the Macintosh version of the game, and stated that Though it took a year, the Mac port of Duke Nukem 3D is an impressive feat, both for the games own features, and the quality of the port.      The Saturn version also received generally positive reviews, with critics particularly praising the use of real-world settings for the levels and Dukes numerous one-liners. Reviewers were also generally impressed with how accurately it replicates the PC version.  GamePro  summarized that All the gore, vulgarity, go-go dancers, and ultra-intense 3D combat action that made Duke Nukem excel on the PC are firmly intact in the Saturn version, making it one of the premier corridor shooters on the system.  However, some complained at the limitations of this versions multiplayer. Dan Hsu of  Electronic Gaming Monthly  said it was unfortunate that it supports only two players instead of four, while  Sega Saturn Magazine  editor Rich Leadbetter complained at the multiplayer being only supported through the ": null
    },
    {
        "Sega NetLink": "sega netlink"
    },
    {
        " and not the Saturn link cable, since the NetLink was not being released in Europe, effectively making the Saturn version single-player only to Europeans.     Next Generation reviewed the Nintendo 64 version of the game Duke Nukem 64, and stated that The sound effects and music are solid, the levels are still interactive as heck, and its never quite felt so good blasting enemies with a shotgun or blowing them to chunks with pipe bombs.      Duke Nukem 3D was a finalist for ": null
    },
    {
        "CNET Gamecenters": "cnet gamecenter"
    },
    {
        "1996 Best Action Game award, which ultimately went to  Quake . In 1996, Next Generation ranked it as the 35th top game of all time, called for many, the game  Quake  should have been. In 1996  Computer Gaming World  named Duke Nukem 3D 37 overall among the best games of all time and 13 among the best ways to die in computer gaming . It won a 1996 ": null
    },
    {
        "Spotlight Award": "spotlight awards"
    },
    {
        " for Best Action Game. In 1998,  PC Gamer  declared it the 29th-best computer game ever released, and the editors called it a gaming icon and an absolute blast .      PC Gamer  magazines readers voted it 13 on its all-time top games poll. April 2000 issue The editors of PC Game ranked it as the 12th top game of all time in 2001 citing the games humor and pop-culture references, and as the 15th best games of all time in 2005.  GamePro  included it among the most important video games of all time. In 2009, ": null
    },
    {
        "IGNs": "ign"
    },
    {
        "Cam Shea ranked it as the ninth top 10 Xbox Live Arcade game, stating that it was as fun as it was in its initial release, and praised the ability to rewind to any point before the player died.     Japanese gaming magazine  Famitsu  reviewed the PlayStation console port, giving it a 21 out of 40 score.       Duke Nukem 3D was attacked by some critics, who alleged that it promoted ": null
    },
    {
        "pornography": "pornography"
    },
    {
        " and murder. Jamia Wilson, then vice president of ": null
    },
    {
        "Womens Media Center": "womens media center"
    },
    {
        ", criticized the depictions of women for being extremely harmful, especially to young women . In response to the criticism encountered, ": null
    },
    {
        "censored": "censorship"
    },
    {
        " versions of the game were released in certain countries in order to avoid it being banned altogether. A similar censored version was carried at ": null
    },
    {
        "Wal-Mart": "wal-mart"
    },
    {
        " retail stores in the United States.     In Australia, the game was originally refused classification on release. 3D Realms repackaged the game with the parental lock feature permanently enabled, although a patch available on the 3D Realms website allowed the user to revert the game back into its uncensored U.S. version. The ": null
    },
    {
        "OFLC": "office of film and literature classification"
    },
    {
        " then attempted to have the game pulled from the shelves, but it was discovered that the distributor had notified them of this fact and the rating could not be surrendered; six months later, the game was reclassified and released uncensored with an MA15+ rating. In Germany, the ": null
    },
    {
        "BPjM": "bundesprüfstelle für jugendgefährdende medien"
    },
    {
        " placed the game on their List B of videos games, thus prohibiting its advertisement in the public. However, it was not fully confiscated, meaning that an adult could still request to see the game and buy it. In 1999, Duke Nukem 3D was banned in Brazil, along with Doom and several other first-person shooters after a rampage, in and around a movie theater, was supposedly inspired by the first level in the game.     Despite such concerns from critics, legislators, and publishers, Scott Miller later recounted that 3D Realms saw very little negative feedback to the games controversial elements from actual gamers or their parents. He pointed out that Duke Nukem 3D": null
    }
]