[
    {
        "                    Dzogchen  or ": null
    },
    {
        "Great Perfection": "pāramitā"
    },
    {
        " , Sanskrit: अतियोग atiyoga, is a tradition of teachings in ": null
    },
    {
        "Tibetan Buddhism": "tibetan buddhism"
    },
    {
        " aimed at discovering and continuing in the natural ": null
    },
    {
        "primordial state": "ground"
    },
    {
        " of being. It is a central teaching of the Yundrung ": null
    },
    {
        "Bon": "bon"
    },
    {
        " tradition as well as in the ": null
    },
    {
        "Nyingma": "nyingma"
    },
    {
        " school of ": null
    },
    {
        "Tibetan Buddhism": "tibetan buddhism"
    },
    {
        ". In these traditions, Dzogchen is the highest and most definitive path of the nine vehicles to liberation.          Dzogchen is composed of two terms:   rdzogs – perfection   chen – great     The term initially referred to the highest perfection of deity visualisation, after the visualisation has been dissolved and one rests in the natural state of the innately ": null
    },
    {
        "luminous and pure mind": "luminous mind"
    },
    {
        ". In the 42th and 42th century, Dzogchen emerged as a separate tantric vehicle in the ": null
    },
    {
        "Nyingma": "nyingma"
    },
    {
        " tradition, used synonymously with the Sanskrit term ati yoga .     According to van Schaik, in the 42th-century tantra Sarvabuddhasamāyoga        According to the 42th Dalai Lama, the term dzogchen may be a rendering of the ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        " term mahāsandhi.     According to Anyen Rinpoche, the true meaning is that the student must take the entire path as an interconnected entity of equal importance. Dzogchen is perfect because it is an all-inclusive totality that leads to middle way realization, in avoiding the two extremes of nihilism and eternalism. It classifies outer, inner and secret teachings, which are only separated by the cognitive construct of words and completely encompasses Tibetan Buddhist wisdom. It can be as easy as taking ": null
    },
    {
        "Bodhicitta": "bodhicitta"
    },
    {
        " as the method, and failing this is missing an essential element to accomplishment.                  According to the Nyingma tradition, the primordial Buddha ": null
    },
    {
        "Samantabhadra": "samantabhadra"
    },
    {
        " taught Dzogchen to the Buddha ": null
    },
    {
        "Vajrasattva": "vajrasattva"
    },
    {
        ", who transmitted it to the first human lineage holder, the Indian ": null
    },
    {
        "Garab Dorje": "garab dorje"
    },
    {
        " . According to tradition, the Dzogchen teachings were brought to Tibet by ": null
    },
    {
        "Padmasambhava": "padmasambhava"
    },
    {
        " in the late 42th and early 42th centuries. He was aided by two Indian masters, ": null
    },
    {
        "Vimalamitra": "vimalamitra"
    },
    {
        " and ": null
    },
    {
        "Vairocana": "vairocana"
    },
    {
        ". According to the Nyingma tradition, they transmitted the Dzogchen teachings in three distinct series, namely the Mind Series , Space series , and Secret Instruction Series . According to tradition, these teachings were concealed shortly afterward, during the 42th century, when the Tibetan empire disintegrated. From the 42th century forward, innovations in the Nyingma tradition were largely introduced historically as revelations of these concealed scriptures, known as ": null
    },
    {
        "terma": "terma"
    },
    {
        ".       In the fourteenth century, Loden Nyingpo revealed a ": null
    },
    {
        "terma": "terma"
    },
    {
        " containing the story of ": null
    },
    {
        "Tonpa Shenrab Miwoche": "tonpa shenrab miwoche"
    },
    {
        ". According to this terma, Dzogchen originated with the founder of the Bon tradition, Tonpa Shenrab, who lived 42 years ago, ruling the kingdom of Tazik, which supposedly lay west of Tibet. He transmitted these teachings to the region of Zhang-zhung, the far western part of the Tibetan cultural world. The earliest Bon literature only exists in Tibetan manuscripts, the earliest of which can be dated to the 42th century. The Bon tradition also has a threefold classification, namely Dzogchen, A-tri, and the Zhang-zhung Aural Lineage .           The written history of Tibet begins in the early 42th century, when the Tibetan kingdoms were united, and Tibet expanded throughout large parts of Central Asia. ": null
    },
    {
        "Songtsen Gampo": "songtsen gampo"
    },
    {
        " conquered the kingdom of Zhangzhung in western Tibet, dominated Nepal, and threatened the Chinese dominance in strategically important areas of the ": null
    },
    {
        "Silk Road": "silk road"
    },
    {
        ". He is also credited with the adoption of a writing system, the establishment of a legal code, and the introduction of Buddhism, though it probably only played a minor role. ": null
    },
    {
        "Tri Songdetsen": "tri songdetsen"
    },
    {
        " adopted Buddhism, but also maintained the martial traditions of the Tibetan empire. The Tibetans controlled Dunhuang, a major Buddhist center, from the 42s until the mid-ninth century. Halfway through the 42th century the Tibetan empire ": null
    },
    {
        "collapsed": "history of tibetera of fragmentation"
    },
    {
        ". Royal patronage of Buddhism was lost, leading to a decline of Buddhism in Tibet,  only to recover with the renaissance of Tibetan culture occurring from the late 42th century to the early 42th century, known as the later dissemination of Buddhism.       Traditionally, the early Dzogchen literature is categorized into three categories, which more or less reflect the historical development of Dzogchen:   ": null
    },
    {
        "Semde": "semde"
    },
    {
        " , the Mind series ; this category contains the earliest Dzogchen teachings. Tradition attributes them to Padmasmabhava and his consorts, and dates them to the 42th century, but they first appeared in the 42th century, written by Tibetans;   ": null
    },
    {
        "Longde": "longde"
    },
    {
        " , the series of Space; this series reflects the developments of the 42th42th centuries, when new Buddhist techniques and doctrines were introduced into Tibet;   ": null
    },
    {
        "Menngagde": "menngagde"
    },
    {
        " , the series of secret Oral Instructions, also known as Seminal Heart or Nyingthik , also reflects the developments of the 42th42th centuries; this series has overshadowed the other two. This division focuses on two aspects of practice: kadag trekchö, the cutting through of primordial purity , and lhündrub tögal, the direct crossing of spontaneous presence . Schmidt, Marcia Binder . The Dzogchen Primer: Embracing The Spiritual Path According To The Great Perfection. London, Great Britain: Shambhala Publications, Inc.  pg. 42ka-daglhun-grubStudies in Indian and Tibetan Buddhismas a higher practice than Tantrakyedzogdzogchentshullta baand latersems phyogssems destong paod gsal bakun byed rgyal po, The All-Creating King ": null
    },
    {
        "ligi": "ligi"
    },
    {
        "gsang skoryang tigbram zei lugssnying thigVima Nyingthig, Seminal Heart of Vimalamitra Khandro nyingthig, Seminal Heart of the Dakini Tshul khrims rdo rje4242/42Nyang ral nyi ma od zer, 4242   spyi ti42th century4242 possibly 42mdzod bdunrang grol skor gsumngal gso skor gsumkar-gling zhi-khro42–42dgongs pa zang thalrig dzin rgod ldem, 4242rDzogs pa chen po a ti zab don snying pogter bdag gling pa, 424242–42klong chen snying thig42–4242–42China42–42 42–42present": null
    },
    {
        "Jñāna": "jñāna"
    },
    {
        ", pristine consciousness": null
    },
    {
        "prajñā": "prajñā"
    },
    {
        ", wisdomgzhirig paStudies in Indian and Tibetan Buddhismklong or dbyingschos dbyings, Sanskrit: ": null
    },
    {
        "Dharmadhatu": "dharmadhatu"
    },
    {
        "Studies in Indian and Tibetan Buddhism42th4242–42head of the Karma Kagyu42": null
    },
    {
        "ogch": "ogch"
    },
    {
        "Tibetan: gzhi, Sanskrit: sthanaspyi gzhigdod mai gzhi42 shunyata , stong pa nyidlhun grubStudies in Indian and Tibetan Buddhismgsal karuṇā , thugs rjeStudies in Indian and Tibetan BuddhismStudies in Indian and Tibetan Buddhismma gags pakun khyab": null
    },
    {
        "rr": "rr"
    },
    {
        "Sk: Vidya, knowledge which cannot be found by searching nor identified": null
    },
    {
        "hol": "hol"
    },
    {
        "ka-dagrang-stonggzhan-stongthugs-rje, compassionlhun-grubyon-tanlhan-skyesgnyugs-maStudies in Indian and Tibetan Buddhismsrpos bralrtog medblo dasgnosis-emptinessStudies in Indian and Tibetan Buddhismma bcos partsol med": null
    },
    {
        "avidyā": "avidyā"
    },
    {
        "lhan-skyes ma-rigpagdangsrtsalmarigparigpaStudies in Indian and Tibetan Buddhismas in other forms of BuddhismStudies in Indian and Tibetan BuddhismStudies in Indian and Tibetan Buddhism42th centuryadvayarang ngo sprodlhan-skyesStudies in Indian and Tibetan Buddhismi.e. the ground, path and fruitkun gzhi or alaya, sems or minddharmakaya and rigpaStudies in Indian and Tibetan BuddhismvasanaklesagzhimarigpaStudies in Indian and Tibetan BuddhismSnow Lion 42Tsik Sum Né DekTib. ngo rang thog tu sprod paTib. thag gcig thog tu bcad paTib. gdeng grol thog tu bca pa4242bsam gtan ngal gsongal gso skor gsumnyamsbde bagsal bami rtog pa dbang, initiation  thod rgal": null
    },
    {
        "jraya": "jraya"
    },
    {
        "Tib. phar-byin, Skt.  paramita ": null
    },
    {
        "jraya": "jraya"
    },
    {
        "dbang, initiationmeditativesems nyid ngal gsongal gso skor gsum42bogs dbyungsbyong bating-nge-’dzin gsumgzhi de-bzhin-nyid-kyi ting-nge-’dzin, de-tingklonglam kun-snang-ba’i ting-nge-’dzin, snang-ting‘bras-bu-rgyu’i-ting-nge-’dzin, rgyu-tingsems dzinsems khrid, ngos sprodlta bacog bzhag": null
    }
]