[
    {
        "Dénis Lindbohm was a ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " author and ": null
    },
    {
        "occultist": "occultism"
    },
    {
        " and is considered one of the founders of Swedish ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        ". In his early years, he worked as a photographic technician in ": null
    },
    {
        "Malmö": "malmö"
    },
    {
        " and became involved in the nascent Swedish science fiction fandom. In the mid42s he became a full-time writer.       Draksådd   Mörker över Malmö   Mörkrets fåra   Jagets eld   Soldat från jorden    Stjärnpesten   Eden utan Adam   Flygande gift   Stjärnvargen   Domens stjärnor    Den gyllene randen   Regression   Nattens lösen   Bevingaren   Frostens barn   Solens vargar   A-ett   Eko över bron   Edens nyckel   Domens rötter   Eldens barn   Nattsidan   Gaias gudbarn   Spegelspelet   Allt har sin tid   Vägens förra slut   Glömda gudars väg   Vatten över huvud taget   Blå tornet   Siaren som sover   Vägen bortom Lövestad   Domedagens skymning   Evig exil   Droppar av dis och eld   Världförvist   Trollmakt   Dockan från Fomalhaut   Pentagram, Maktens portal   Det kom en orm till Eden   Skuggor över Elysion   Spegelns tredje sida   Blod på solen   Den magiska gåvan   Där blott andar vandrar   Stjärnbollen   Ljuset är själens färg   Den trolska världen   Magins system   Vägen som mörkret belyste   Fången är den fries dröm   Bortom barriären   Gudarnas lekskola   Pentagram – Maktens portal   Vi som är svärmen   Möten med makterna   Magins program   Legenden av stoft och stjärnor   Magi   Genom det inres port   Drömmens dimension   Makten som skapar och förgör   De ofödda   Bevingaren   Vid stjärnhjulets rand   Vägen genom pentagram   Magins problem   Makten som botar   Vi möttes i Babylon   Väktarna vid världens rand   Pentagrams andra sida   Den inre väktaren   Världar runt hörnet   Kvatur-Glon        - artikel av ": null
    },
    {
        "John-Henri Holmberg": "john-henri holmberg"
    },
    {
        ".    - hela boken i pdf-format, länken är nu uppdaterad till dess ursprung.   .                      ": null
    }
]