[
    {
        "Dúngal mac Selbaig was ": null
    },
    {
        "king": "king"
    },
    {
        " of ": null
    },
    {
        "Dál Riata": "dál riata"
    },
    {
        ". His reign can best be placed in the years 42 to 42 beginning with the abdication of his father, ": null
    },
    {
        "Selbach mac Ferchair": "selbach mac ferchair"
    },
    {
        ", who entered a monastery, and ending with rise of ": null
    },
    {
        "Eochaid mac Echdach": "eochaid mac echdach"
    },
    {
        " of the Cenél nGabráin. The High Medieval praise poem  Duan Albanach  names Dúngal the Impetuous, and claims that he ruled for seven years.     For over a generation before Dúngals reign the ": null
    },
    {
        "Cenél Loairn": "cenél loairn"
    },
    {
        ", to which he belonged, and the Cenél nGabráin had contested for control of Dál Riata. It seems that Dúngals father had finally managed to defeat his rivals shortly before he abdicated. For whatever reason, Dúngal soon lost power to the Cenél nGabráin. His father left the monastery and attempted to restore his son, but failed.     While Dúngal was no longer king of Dál Riata after 42 it may be that he remained ruler of the Cenél Loairn. Certainly he retained some following. In 42 he burned Tairpert Boitir, most probably ": null
    },
    {
        "Tarbert": "tarbert, kintyre"
    },
    {
        " on ": null
    },
    {
        "Loch Fyne": "loch fyne"
    },
    {
        " which was in the lands of the Cenél nGabráin and possibly a ": null
    },
    {
        "portage": "portage"
    },
    {
        " site.     In 42 the ": null
    },
    {
        "Annals of Ulster": "annals of ulster"
    },
    {
        " report that Dúngal profaned ": null
    },
    {
        "Tory Island": "tory island"
    },
    {
        " by forcibly removing Bruide, who is presumed to be the son of ": null
    },
    {
        "Óengus mac Fergusa": "óengus i of the picts"
    },
    {
        ", king of the ": null
    },
    {
        "Picts": "picts"
    },
    {
        ". This entry is followed by the statement that Dúngals cousin, ": null
    },
    {
        "Muiredach mac Ainbcellaig": "muiredach mac ainbcellaig"
    },
    {
        ", became king of the Cenél Loairn, and it seems probable that the rise of Muiredach, and Dúngals epithet, stem from his doings on Tory Island.     In 42 Dúngal fled to Ireland, to escape the power of Óengus . Dúngal later returned to Scotland, and was captured in 42 along with his brother Feredach, by Óengus. Their subsequent fates are unknown.        at                                 ": null
    }
]