[
    {
        "   Ernst Theodor Amadeus Hoffmann  was a German ": null
    },
    {
        "Romantic": "romanticism"
    },
    {
        " author of ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        " and ": null
    },
    {
        "Gothic": "gothic fiction"
    },
    {
        " horror": "horror fiction"
    },
    {
        ", a ": null
    },
    {
        "jurist": "jurist"
    },
    {
        ", composer, music critic and artist. ": null
    },
    {
        "Penrith Goff": "penrith goff"
    },
    {
        ", E.T.A. Hoffmann in ": null
    },
    {
        "E. F. Bleiler": "e. f. bleiler"
    },
    {
        ", Supernatural Fiction Writers: Fantasy and Horror. New York: Scribners, 1985. pp. 111–120.  ": null
    },
    {
        "Mike Ashley": "mike ashley"
    },
    {
        ", Hoffmann, E T A , in St. James Guide to Horror, Ghost, and Gothic Writers, ed. ": null
    },
    {
        "David Pringle": "david pringle"
    },
    {
        ". Detroit: St. James Press/Gale, 1998.  . ": null
    },
    {
        "Ludwig Tieck": "ludwig tieck"
    },
    {
        ", ": null
    },
    {
        "Heinrich von Kleist": "heinrich von kleist"
    },
    {
        ", and E. T. A. Hoffmann also profoundly influenced the development of European Gothic horror in the nineteenth century.... Heide Crawford, The Origins of the Literary Vampire. Lanham : Rowman & Littlefield, 2016.  . His stories form the basis of ": null
    },
    {
        "Jacques Offenbachs": "jacques offenbach"
    },
    {
        "opera  The Tales of Hoffmann , in which Hoffmann appears as the hero. He is also the author of the novella  The Nutcracker and the Mouse King , on which ": null
    },
    {
        "Pyotr Ilyich Tchaikovskys": "pyotr ilyich tchaikovsky"
    },
    {
        "ballet  The Nutcracker  is based. The ballet  Coppélia  is based on two other stories that Hoffmann wrote, while ": null
    },
    {
        "Schumanns": "robert schumann"
    },
    {
        "  Kreisleriana  is based on Hoffmanns character ": null
    },
    {
        "Johannes Kreisler": "johannes kreisler"
    },
    {
        ".     Hoffmanns stories highly influenced 19th-century literature, and he is one of the major authors of the Romantic movement.           Hoffmanns ancestors, both maternal and paternal, were ": null
    },
    {
        "jurist": "jurist"
    },
    {
        "s. His father, Christoph Ludwig Hoffmann , was a ": null
    },
    {
        "barrister": "barrister"
    },
    {
        " in ": null
    },
    {
        "Königsberg": "königsberg"
    },
    {
        ", ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        " , as well as a poet and amateur musician who played the ": null
    },
    {
        "viola da gamba": "viola da gamba"
    },
    {
        ". In 1767 he married his cousin, Lovisa Albertina Doerffer . Ernst Theodor Wilhelm, born on 24 January 1776, was the youngest of three children, of whom the second died in infancy.     When his parents separated in 1778, the father went to Insterburg  with his elder son, Johann Ludwig Hoffmann , while Ernsts mother stayed in Königsberg with her relatives: two aunts, Johanna Sophie Doerffer and Charlotte Wilhelmine Doerffer and their brother, Otto Wilhelm Doerffer , who were all unmarried. This trio raised the youngster.     The household, dominated by the uncle , was ": null
    },
    {
        "pietist": "pietist"
    },
    {
        "ic and uncongenial. Hoffmann was to regret his estrangement from his father. Nevertheless, he remembered his aunts with great affection, especially the younger, Charlotte, whom he nicknamed Tante Füßchen . Although she died when he was only three years old, he treasured her memory  and embroidered stories about her to such an extent that later biographers sometimes assumed her to be imaginary, until proof of her existence was found after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". Friedrich Schnapp. Hoffmanns Verwandte aus der Familie Doerffer in Königsberger Kirchenbüchern der Jahre 1740–1811. Mitteilungen der E. T. A. Hoffmann-Gesellschaft. 23 , 1–11.     Between 1781 and 1792 he attended the Lutheran school or  Burgschule , where he made good progress in classics. He was taught drawing by one Saemann, and counterpoint by a Polish organist named Podbileski, who was to be the prototype of Abraham Liscot in Kater Murr. Ernst showed great talent for piano-playing, and busied himself with writing and drawing. The provincial setting was not, however, conducive to technical progress, and despite his many-sided talents he remained rather ignorant of both classical forms and of the new artistic ideas that were developing in Germany. He had, however, read ": null
    },
    {
        "Schiller": "friedrich schiller"
    },
    {
        ", ": null
    },
    {
        "Goethe": "johann wolfgang von goethe"
    },
    {
        ", ": null
    },
    {
        "Swift": "jonathan swift"
    },
    {
        ", ": null
    },
    {
        "Sterne": "laurence sterne"
    },
    {
        ", ": null
    },
    {
        "Rousseau": "jean-jacques rousseau"
    },
    {
        " and ": null
    },
    {
        "Jean Paul": "jean paul"
    },
    {
        ", and wrote part of a novel titled Der Geheimnisvolle.     Around 1787 he became friends with ": null
    },
    {
        "Theodor Gottlieb von Hippel the Younger": "theodor gottlieb von hippel the younger"
    },
    {
        " , the son of a pastor, and nephew of ": null
    },
    {
        "Theodor Gottlieb von Hippel the Elder": "theodor gottlieb von hippel the elder"
    },
    {
        ", the well-known writer friend of ": null
    },
    {
        "Immanuel Kant": "immanuel kant"
    },
    {
        ". During 1792, both attended some of Kants lectures at the ": null
    },
    {
        "University of Königsberg": "university of königsberg"
    },
    {
        ". Their friendship, although often tested by an increasing social difference, was to be lifelong.     In 1794, Hoffmann became enamored of Dora Hatt, a married woman to whom he had given music lessons. She was ten years older, and gave birth to her sixth child in 1795.  In February 1796, her family protested against his attentions and, with his hesitant consent, asked another of his uncles to arrange employment for him in ": null
    },
    {
        "Glogau ": "głogów"
    },
    {
        ", ": null
    },
    {
        "Prussian Silesia": "prussian silesia"
    },
    {
        ". Rüdiger Safranski. E. T. A. Hoffmann: Das Leben eines skeptischen Phantasten. Carl Hanser, Munich, 1984.  Gerhard R. Kaiser. E. T. A. Hoffmann. J. B. Metzlersche, Stuttgart, 1988.        From 1796 Hoffmann obtained employment as a clerk for his uncle, Johann Ludwig Doerffer, who lived in Glogau with his daughter Minna. After passing further examinations he visited ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", where he was amazed by the paintings in the gallery, particularly those of ": null
    },
    {
        "Correggio": "antonio da correggio"
    },
    {
        " and ": null
    },
    {
        "Raphael": "raphael"
    },
    {
        ". During the summer of 1798, his uncle was promoted to a court in Berlin, and the three of them moved there in August—Hoffmanns first residence in a large city. It was there that Hoffmann first attempted to promote himself as a composer, writing an operetta called Die Maske and sending a copy to Queen ": null
    },
    {
        "Luise of Prussia": "louise of mecklenburg-strelitz"
    },
    {
        ". The official reply advised to him to write to the director of the Royal Theatre, a man named ": null
    },
    {
        "Iffland": "august wilhelm iffland"
    },
    {
        ". By the time the latter responded, Hoffmann had passed his third round of examinations and had already left for ": null
    },
    {
        "Posen ": "poznań"
    },
    {
        " in ": null
    },
    {
        "South Prussia": "south prussia"
    },
    {
        " in the company of his old friend Hippel, with a brief stop in Dresden to show him the gallery.     From June 1800 to 1803 he worked in Prussian provinces in the area of ": null
    },
    {
        "Greater Poland": "greater poland"
    },
    {
        " and ": null
    },
    {
        "Masovia": "masovia"
    },
    {
        ". This was the first time he had lived without supervision by members of his family, and he started to become what school principals, parsons, uncles, and aunts call dissolute.      His first job, at Posen, was endangered after Carnival on ": null
    },
    {
        "Shrove Tuesday": "shrove tuesday"
    },
    {
        " 1802, when caricatures of military officers were distributed at a ball. It was immediately deduced who had drawn them, and complaints were made to authorities in Berlin, who were reluctant to punish the promising young official. The problem was solved by promoting Hoffmann to ": null
    },
    {
        "Płock": "płock"
    },
    {
        " in ": null
    },
    {
        "New East Prussia": "new east prussia"
    },
    {
        ", the former capital of Poland , where administrative offices were relocated from ": null
    },
    {
        "Thorn ": "toruń"
    },
    {
        ". He visited the place to arrange lodging, before returning to Posen where he married Mischa . They moved to Płock in August 1802.     Hoffmann despaired because of his exile, and drew caricatures of himself drowning in mud alongside ragged villagers. He did make use, however, of his isolation, by writing and composing. He started a diary on 1 October 1803. An essay on the theatre was published in ": null
    },
    {
        "Kotzebues": "august von kotzebue"
    },
    {
        "periodical, Die Freimüthige, and he entered a competition in the same magazine to write a play. Hoffmanns was called Der Preis , and was itself about a competition to write a play. There were fourteen entries, but none was judged worthy of the award: 100 ": null
    },
    {
        "Friedrichs dor": "friedrich dor"
    },
    {
        ". Nevertheless, his entry was singled out for praise. Die Freimüthige, 11 February 1804. Volume II, no. 6, pages xxi–xxiv. This was one of the few good times of a sad period of his life, which saw the deaths of his uncle J. L. Hoffmann in Berlin, his Aunt Sophie, and Dora Hatt in Königsberg.     At the beginning of 1804 he obtained a post at ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ". On his way there, he passed through his hometown and met one of Dora Hatts daughters. He was never to return to Königsberg.       Hoffmann assimilated well with Polish society; the years spent in Prussian Poland he recognized as the happiest of his life. In Warsaw he found the same atmosphere he had enjoyed in Berlin, renewing his friendship with ": null
    },
    {
        "Zacharias Werner": "zacharias werner"
    },
    {
        ", and meeting his future biographer, a neighbour and fellow jurist called ": null
    },
    {
        "Julius Eduard Itzig": "julius eduard hitzig"
    },
    {
        " . Itzig had been a member of the Berlin literary group called the Nordstern, or North Stars, and he gave Hoffmann the works of ": null
    },
    {
        "Novalis": "novalis"
    },
    {
        ", ": null
    },
    {
        "Ludwig Tieck": "ludwig tieck"
    },
    {
        ", ": null
    },
    {
        "Achim von Arnim": "achim von arnim"
    },
    {
        ", ": null
    },
    {
        "Clemens Brentano": "clemens brentano"
    },
    {
        ", ": null
    },
    {
        "Gotthilf Heinrich von Schubert": "gotthilf heinrich von schubert"
    },
    {
        ", ": null
    },
    {
        "Carlo Gozzi": "carlo gozzi"
    },
    {
        " and ": null
    },
    {
        "Calderón": "pedro calderón de la barca"
    },
    {
        ". These relatively late introductions marked his work profoundly.     He moved in the circles of ": null
    },
    {
        "August Wilhelm Schlegel": "august wilhelm schlegel"
    },
    {
        ", ": null
    },
    {
        "Adelbert von Chamisso": "adelbert von chamisso"
    },
    {
        ", ": null
    },
    {
        "Friedrich de la Motte Fouqué": "friedrich de la motte fouqué"
    },
    {
        ", ": null
    },
    {
        "Rahel Levin": "rahel levin"
    },
    {
        " and ": null
    },
    {
        "David Ferdinand Koreff": "david ferdinand koreff"
    },
    {
        ".     As chief Prussian administrator of the city from 1795 to 1806, Hoffmann was responsible for assigning surnames to Warsaws Jewish community—a duty he executed based on whims. The names Hoffmann doled out would apparently depend on the day of the week—Monday the names of flowers, Friday the names of fish, or hung-over after drinking with a Prussian army officer military names like Festung, Fojer, Pistolet, and Trompeter. Norman Davies, Heart of Europe, 245-7     But Hoffmanns fortunate position was not to last: on 28 November 1806, during the ": null
    },
    {
        "War of the Fourth Coalition": "war of the fourth coalition"
    },
    {
        ", ": null
    },
    {
        "Napoleon Bonapartes": "napoleon"
    },
    {
        "troops captured Warsaw, and the Prussian bureaucrats lost their jobs. They divided the contents of the treasury between them and fled. In January 1807, Hoffmanns wife and two-year-old daughter Cäcilia returned to Posen, while he pondered whether to move to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " or go back to Berlin. A delay of six months was caused by severe illness. Eventually the French authorities demanded that all former officials swear allegiance or leave the country. As they refused to grant Hoffmann a passport to Vienna, he was forced to return to Berlin.   He visited his family in Posen before arriving in Berlin on 18 June 1807, hoping to further his career there as an artist and writer.       The next fifteen months were some of the worst in Hoffmanns life.   The city of Berlin was also occupied by Napoleons troops. Obtaining only meagre allowances, he had frequent recourse to his friends, constantly borrowing money and still going hungry for days at a time; he learned that his daughter had died. Nevertheless, he managed to compose his Six Canticles for a cappella choir: one of his best compositions, which he would later attribute to Kreisler in Lebensansichten des Katers Murr.      On 1 September 1808 he arrived with his wife in ": null
    },
    {
        "Bamberg": "bamberg"
    },
    {
        ", where he began a job as theatre manager. The director, Count Soden, left almost immediately for Würzburg, leaving a man named Heinrich Cuno in charge. Hoffmann was unable to improve standards of performance, and his efforts caused intrigues against him which resulted in him losing his job to Cuno. He began work as music critic for the  Allgemeine musikalische Zeitung , a newspaper in ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ", and his articles on ": null
    },
    {
        "Beethoven": "ludwig van beethoven"
    },
    {
        " were especially well received, and highly regarded by the composer himself. It was in its pages that the ": null
    },
    {
        "Kapellmeister": "kapellmeister"
    },
    {
        " Johannes Kreisler": "johannes kreisler"
    },
    {
        " character made his first appearance.     Hoffmanns breakthrough came in 1809, with the publication of Ritter Gluck, a story about a man who meets, or believes he has met, the composer ": null
    },
    {
        "Christoph Willibald Gluck": "christoph willibald gluck"
    },
    {
        " more than twenty years after the latters death. The theme alludes to the work of ": null
    },
    {
        "Jean Paul": "jean paul"
    },
    {
        ", who invented the term ": null
    },
    {
        "Doppelgänger": "doppelgänger"
    },
    {
        " the previous decade, and continued to exact a powerful influence over Hoffmann, becoming one of his earliest admirers. With this publication, Hoffmann began to use the pseudonym E. T. A. Hoffmann, telling people that the A stood for Amadeus, in homage to the composer ": null
    },
    {
        "Wolfgang Amadeus Mozart": "wolfgang amadeus mozart"
    },
    {
        " . However, he continued to use Wilhelm in official documents throughout his life, and the initials E. T. W. also appear on his gravestone.     The next year, he was employed at the Bamberg Theatre as stagehand, decorator, and playwright, while also giving private music lessons.   He became so enamored of a young singing student, Julia Marc, that his feelings were obvious whenever they were together, and Julias mother quickly found her a more suitable match. When Joseph Seconda offered Hoffmann a position as musical director for his opera company , he accepted, leaving on 21 April 1813.       Prussia had declared war against France on 16 March during the ": null
    },
    {
        "War of the Sixth Coalition": "war of the sixth coalition"
    },
    {
        ", and their journey was fraught with difficulties. They arrived on the 25th, only to find that Seconda was in Leipzig; on the 26th, they sent a letter pleading for temporary funds. That same day Hoffmann was surprised to meet Hippel, whom he had not seen for nine years.     The situation deteriorated, and in early May Hoffmann tried in vain to find transport to Leipzig. On 8 May, the bridges were destroyed, and his family were marooned in the city. During the day, Hoffmann would roam, watching the fighting with curiosity. Finally, on 20 May, they left for Leipzig, only to be involved in an accident which killed one of the passengers in their coach and injured his wife.     They arrived on 23 May, and Hoffmann started work with Secondas orchestra, which he found to be of the best quality. On 4 June an armistice began, which allowed the company to return to Dresden. But on 22 August, after the end of the armistice, the family was forced to relocate from their pleasant house in the suburbs into the town, and during the next few days the ": null
    },
    {
        "Battle of Dresden": "battle of dresden"
    },
    {
        " raged. The city was bombarded; many people were killed by bombs directly in front of him. After the main battle was over, he visited the gory battlefield. His account can be found in Vision auf dem Schlachtfeld bei Dresden. After a long period of continued disturbance, the town surrendered on 11 November, and on 9 December the company travelled to Leipzig.     On 25 February Hoffmann quarrelled with Seconda, and the next day he was given notice of twelve weeks. When asked to accompany them on their journey to Dresden in April, he refused, and they left without him. But during July his friend Hippel visited, and soon he found himself being guided back into his old career as a jurist.          At the end of September 1814, in the wake of Napoleons defeat, Hoffmann returned to Berlin and succeeded in regaining a job at the Kammergericht, the chamber court. His opera  Undine  was performed by the Berlin Theatre. Its successful run came to an end only after a fire on the night of the 25th performance. Magazines clamoured for his contributions, and after a while his standards started to decline. Nevertheless, many masterpieces date from this time.     During the period from 1819 Hoffmann was involved with legal disputes, while fighting ill health. Alcohol abuse and syphilis eventually caused weakening of his limbs during 1821, and paralysis from the beginning of 1822. His last works were dictated to his wife or to a secretary.     ": null
    },
    {
        "Prince Metternichs": "klemens von metternich"
    },
    {
        "anti-liberal programs began to put Hoffmann in situations that tested his conscience. Thousands of people were accused of treason for having certain political opinions,   and university professors were monitored during their lectures.     King ": null
    },
    {
        "Frederick William III of Prussia": "frederick william iii of prussia"
    },
    {
        " appointed an Immediate Commission for the investigation of political dissidence; when he found its observance of the rule of law too frustrating, he established a Ministerial Commission to interfere with its processes. The latter was greatly influenced by Commissioner Kamptz. During the trial of ": null
    },
    {
        " Turnvater Jahn": "friedrich ludwig jahn"
    },
    {
        ", the founder of the gymnastics association movement, Hoffmann found himself annoying Kamptz, and became a political target. When Hoffmann caricatured Kamptz in a story , Kamptz began legal proceedings. These ended when Hoffmanns illness was found to be life-threatening. The King asked for a reprimand only, but no action was ever taken. Eventually Meister Floh was published with the offending passages removed.     Hoffmann died of syphilis in Berlin on 25 June 1822 at the age of 46. His grave is preserved in the Protestant Friedhof III der Jerusalems- und Neuen Kirchengemeinde  in ": null
    },
    {
        "Berlin-Kreuzberg": "kreuzberg"
    },
    {
        ", south of ": null
    },
    {
        "Hallesches Tor": "hallesches tor"
    },
    {
        " at the underground station Mehringdamm.               Fantasiestücke in Callots Manier Fantasy pieces in the manner of ": null
    },
    {
        "Jacques Callot": "jacques callot"
    },
    {
        "   Ritter Gluck , Kreisleriana , Don Juan , Nachricht von den neuesten Schicksalen des Hundes Berganza   Der Magnetiseur , ": null
    },
    {
        " Der goldne Topf ": "the golden pot"
    },
    {
        " , Die Abenteuer der Silvesternacht    Die Elixiere des Teufels    Nachtstücke   ": null
    },
    {
        "Der Sandmann": "der sandmann"
    },
    {
        " , Das Gelübde , Ignaz Denner , Die Jesuiterkirche in G.   Das Majorat , Das öde Haus , Das Sanctus , Das steinerne Herz   Seltsame Leiden eines Theater-Direktors    Klein Zaches, genannt Zinnober    Die Serapionsbrüder   Der Einsiedler Serapion , Rat Krespel , Die Fermate , Der Dichter und der Komponist   Ein Fragment aus dem Leben dreier Freunde , Der Artushof , Die Bergwerke zu Falun , ": null
    },
    {
        " Nußknacker und Mausekönig ": "the nutcracker and the mouse king"
    },
    {
        "    , Eine Spukgeschichte , Die Automate , Doge und Dogaresse   Alte und neue Kirchenmusik , Meister Martin der Küfner und seine Gesellen , Das fremde Kind   Nachricht aus dem Leben eines bekannten Mannes , Die Brautwahl , Der unheimliche Gast   ": null
    },
    {
        "Das Fräulein von Scuderi": "mademoiselle de scuderi"
    },
    {
        " , Spielerglück , Der Baron von B.   Signor Formica , Zacharias Werner , Erscheinungen   Der Zusammenhang der Dinge , Vampirismus , Die ästhetische Teegesellschaft , Die Königsbraut   Prinzessin Brambilla    Lebensansichten des Katers Murr    Die Irrungen   Die Geheimnisse   Die Doppeltgänger   ": null
    },
    {
        "Meister Floh": "master flea"
    },
    {
        "   Des Vetters Eckfenster   Letzte Erzählungen           Messa d-moll   Trois Canzonettes à 2 et à 3 voix   6 Canzoni per 4 voci alla capella   Miserere b-moll   In des Irtisch weiße Fluten , Lied   Recitativo ed Aria „Prendi lacciar ti rendo   Tre Canzonette italiane ; 6 Duettini italiani   Nachtgesang, Türkische Musik, Jägerlied, Katzburschenlied für Männerchor       Die Maske , Singspiel   Die lustigen Musikanten , Singspiel   Incidental music to Zacharias Werners tragedy Das Kreuz an der Ostsee    Liebe und Eifersucht     Arlequin, ballet   Der Trank der Unsterblichkeit , romantic opera   Wiedersehn! , prologue   Dirna , melodrama   Incidental music to Julius von Sodens drama Julius Sabinus   Saul, König von Israel , melodrama   Aurora , heroic opera    Undine  , Zauberoper   Der Liebhaber nach dem Tode       Rondo für Klavier   Ouvertura. Musica per la chiesa d-moll   Klaviersonaten: A-Dur, f-moll, F-Dur, f-moll, cis-moll   Große Fantasie für Klavier   Sinfonie Es-Dur   Harfenquintett c-moll   Grand Trio E-Dur   Walzer zum Karolinentag   Teutschlands Triumph in der Schlacht bei Leipzig,   Serapions-Walzer            Hoffmann is one of the best-known representatives of ": null
    },
    {
        "German Romanticism": "german romanticism"
    },
    {
        ", and a pioneer of the ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        " genre, with a taste for the ": null
    },
    {
        "macabre": "macabre"
    },
    {
        " combined with ": null
    },
    {
        "realism": "realism"
    },
    {
        " that influenced such authors as ": null
    },
    {
        "Edgar Allan Poe": "edgar allan poe"
    },
    {
        " , ": null
    },
    {
        "Nikolai Gogol": "nikolai gogol"
    },
    {
        " Krys Svitlana,   Canadian-American Slavic Studies 47.1 : 1-20. Krys Svitlana,  Allusions to Hoffmann in Gogols Ukrainian Horror Stories from the Dikanka Collection.  Canadian Slavonic Papers: Special Issue, devoted to the 200th anniversary of Nikolai Gogols birth 51.2-3 : 243-266. , Charles Dickens , Charles Baudelaire , George MacDonald , Greville MacDonald, George MacDonald and His Wife London: Allen and Unwin, 1924 . Fyodor Dostoevsky , Vernon Lee , Another major influence for Lee is unmistakably E.T.A. Hoffmanns Der Sandmann... Christa Zorn, Vernon Lee : aesthetics, history, and the Victorian female intellectual. Athens : Ohio University Press, 2003. . Franz Kafka and Alfred Hitchcock . Hoffmanns story ": null
    },
    {
        "Das Fräulein von Scuderi": "mademoiselle de scuderi"
    },
    {
        " is sometimes cited as the first detective story and a direct influence on Poes The Murders in the Rue Morgue . ": null
    },
    {
        "The Seven Basic Plots": "the seven basic plots"
    },
    {
        ", Christopher Booker, Continuum, 2004, page 507     The twentieth-century Russian literary theorist Mikhail Bakhtin characterised Hoffmanns works as Menippea , essentially satirical and self-parodying in form, thus including him in a tradition that includes Cervantes , Diderot and Voltaire .     Robert Schumann s piano suite Kreisleriana takes its title from one of Hoffmanns books . Jacques Offenbach s masterwork, the opera ": null
    },
    {
        "Les contes dHoffmann": "the tales of hoffmann"
    },
    {
        " , is based on the stories, principally Der Sandmann , Rat Krespel , and Das verlorene Spiegelbild from ": null
    },
    {
        "Die Abenteuer der Silvester-Nacht": "die abenteuer der silvester-nacht"
    },
    {
        " . ": null
    },
    {
        "Klein Zaches genannt Zinnober": "klein zaches genannt zinnober"
    },
    {
        "  inspired an aria as well as the operetta Le Roi Carotte, 18721892Beethoven1808ed.19632004The Life and Opinions of Tomcat Murr, 1819–1821a genius musician1818short story18161814with the pet name of ETAH": null
    },
    {
        "v": "v"
    },
    {
        "19881972": null
    }
]