[
    {
        "        Sir Earle Christmas Grafton Page,   was an Australian politician who served as the 11th ": null
    },
    {
        "Prime Minister of Australia": "prime minister of australia"
    },
    {
        ", holding office for 19 days after the death of ": null
    },
    {
        "Joseph Lyons": "joseph lyons"
    },
    {
        " in 1939. He was the leader of the ": null
    },
    {
        "Country Party": "national party of australia"
    },
    {
        " from 1921 to 1939, and was the most influential figure in its early years.     Page was born in ": null
    },
    {
        "Grafton, New South Wales": "grafton, new south wales"
    },
    {
        ". He entered the ": null
    },
    {
        "University of Sydney": "university of sydney"
    },
    {
        " at the age of 15, and completed a degree in medicine at the age of 21. After completing his ": null
    },
    {
        "residency": "medical residency"
    },
    {
        " at Sydneys ": null
    },
    {
        "Royal Prince Alfred Hospital": "royal prince alfred hospital"
    },
    {
        ", he moved back to Grafton and opened a private hospital. He soon became involved in local politics, and in 1915 purchased a part-share in  The Daily Examiner , a local newspaper. He also briefly served as a military surgeon during World War I. Page gained prominence as an advocate of various development schemes for the ": null
    },
    {
        "Northern Rivers": "northern rivers"
    },
    {
        " region, especially those involving hydroelectricity. He also helped found a movement for ": null
    },
    {
        "New England statehood": "new england new state movement"
    },
    {
        ".     ": null
    },
    {
        "In 1919": "1919 australian federal election"
    },
    {
        ", Page was elected to ": null
    },
    {
        "federal parliament": "parliament of australia"
    },
    {
        " representing the ": null
    },
    {
        "Division of Cowper": "division of cowper"
    },
    {
        ". He joined the new Country Party the following year as its inaugural ": null
    },
    {
        "whip": "whip"
    },
    {
        ", and then replaced ": null
    },
    {
        "William McWilliams": "william mcwilliams"
    },
    {
        " as party leader in 1921. Page opposed the economic policies of Prime Minister ": null
    },
    {
        "Billy Hughes": "billy hughes"
    },
    {
        ", and when the Country Party gained the ": null
    },
    {
        "balance of power": "balance of power"
    },
    {
        " at the ": null
    },
    {
        "1922 election": "1922 australian federal election"
    },
    {
        ", he demanded Hughes resignation as the price for a coalition with the ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        ". He was subsequently made ": null
    },
    {
        "Treasurer": "treasurer of australia"
    },
    {
        " under the new prime minister, ": null
    },
    {
        "Stanley Bruce": "stanley bruce"
    },
    {
        ", serving in that role from 1923 to 1929. He had a significant degree of influence on domestic policy, with Bruce concentrating on international issues.     Page returned to cabinet after the ": null
    },
    {
        "1934 election": "1934 australian federal election"
    },
    {
        ", when the Country Party entered a new coalition with ": null
    },
    {
        "Joseph Lyons": "joseph lyons"
    },
    {
        " United Australia Party": "united australia party"
    },
    {
        ". He was appointed ": null
    },
    {
        "Minister for Commerce": "minister for agriculture"
    },
    {
        ", and concentrated on agricultural issues. When Lyons died in office in April 1939, Page was commissioned as his successor in a caretaker capacity while the UAP ": null
    },
    {
        "elected": "1939 united australia party leadership election"
    },
    {
        " a new leader, ": null
    },
    {
        "Robert Menzies": "robert menzies"
    },
    {
        ". Page subsequently refused to serve in Menzies cabinet, withdrawing the Country Party from the coalition, but this proved unpopular and he resigned the party leadership after a few months. The coalition was eventually reconstituted, and Page served again as Minister for Commerce under Menzies and ": null
    },
    {
        "Arthur Fadden": "arthur fadden"
    },
    {
        " until the governments defeat in October 1941.     Pages last major role was as ": null
    },
    {
        "Minister for Health": "minister for health"
    },
    {
        " in the post-war ": null
    },
    {
        "Menzies Government": "menzies government"
    },
    {
        ". He retired from cabinet at the age of 76, and died a short time after losing his seat at the ": null
    },
    {
        "1961 election": "1961 australian federal election"
    },
    {
        ". Page served in parliament for almost 42 years, and only Menzies lasted longer as the leader of a major Australian political party. He secured his partys independence by refusing overtures to join the Nationalists and the UAP, and the policies that he favoured – decentralisation, agrarianism, and government support of primary industry – have remained the basis of its platform up to the present day. The coalitions that he established and maintained with Bruce and Lyons have served as a model for ": null
    },
    {
        "all subsequent coalition governments": "coalition"
    },
    {
        ".         Earle Christmas Grafton Page was born in ": null
    },
    {
        "Grafton, New South Wales": "grafton, new south wales"
    },
    {
        ", on 8 August 1880. His first middle name, which he disliked, was given to him to carry on the surname of a childless relative, while his second middle name was in honour of his birthplace. Page was the fifth of eleven children born to Charles Page and Mary Johanna Haddon Cox. ": null
    }
]