[
    {
        "     The ": null
    },
    {
        "Eastern Orthodox Church": "eastern orthodox church"
    },
    {
        ", like the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", claims to be the ": null
    },
    {
        "One, Holy, Catholic and Apostolic Church": "four marks of the church"
    },
    {
        ".     The term ": null
    },
    {
        "Western Orthodoxy": "western orthodoxy"
    },
    {
        " is sometimes used to denominate what is technically a ": null
    },
    {
        "vicariate": "vicariate"
    },
    {
        " within the ": null
    },
    {
        "Antiochian Orthodox": "antiochian eastern-orthodox"
    },
    {
        " and the ": null
    },
    {
        "Russian Orthodox Church": "russian orthodox church"
    },
    {
        "es and thus a part of the Eastern Orthodox Church as that term is defined here. The term Western Orthodox Church is disfavored by members of that vicariate.     In the 5th century, ": null
    },
    {
        "Oriental Orthodoxy": "oriental orthodoxy"
    },
    {
        " separated from ": null
    },
    {
        "Chalcedonian Christianity": "chalcedonian christianity"
    },
    {
        " , well before the 11th century ": null
    },
    {
        "Great Schism": "east-west schism"
    },
    {
        ". It should not be confused with Eastern Orthodoxy.          The Orthodox Church is a ": null
    },
    {
        "communion": "full communion"
    },
    {
        " comprising the fourteen or sixteen separate ": null
    },
    {
        "autocephalous": "autocephaly"
    },
    {
        " hierarchical churches that recognize each other as canonical ": null
    },
    {
        "Orthodox Christian": "eastern orthodoxy"
    },
    {
        " churches. Each constituent church is self-governing; its highest-ranking bishop reports to no higher earthly authority. Each regional church is composed of constituent eparchies ruled by bishops. Some autocephalous churches have given an eparchy or group of eparchies varying degrees of autonomy . Such autonomous churches maintain varying levels of dependence on their mother church, usually defined in a Tomos or other document of autonomy. In many cases, autonomous churches are almost completely self-governing, with the mother church retaining only the right to appoint the highest-ranking bishop of the autonomous church.     Normal governance is enacted through a ": null
    },
    {
        "synod": "synod"
    },
    {
        " of bishops within each church. In case of issues that go beyond the scope of a single church, multiple self-governing churches send representatives to a wider synod, sometimes wide enough to be called an Orthodox ": null
    },
    {
        "ecumenical council": "ecumenical council"
    },
    {
        " . Such councils are deemed to have authority superior to that of any autocephalous church or its ranking bishop.     The Orthodox Church is decentralised, having no central authority, earthly head or a single ": null
    },
    {
        "Bishop": "bishop"
    },
    {
        " in a leadership role. Thus, the Orthodox Church uses a ": null
    },
    {
        "synod": "synod"
    },
    {
        "ical system ": null
    },
    {
        "canonically": "canon law"
    },
    {
        ", which is significantly different from the hierarchically organised Catholic Church that follows the doctrine of ": null
    },
    {
        "papal supremacy": "papal supremacy"
    }
]