[
    {
        "        An economic and monetary union is a type of ": null
    },
    {
        "trade bloc": "Trade Bloc"
    },
    {
        " featuring some combination of a ": null
    },
    {
        "common market": "Common Market"
    },
    {
        ", ": null
    },
    {
        "customs union": "Customs Union"
    },
    {
        " and a ": null
    },
    {
        "monetary union": "Monetary Union"
    },
    {
        ".     Established via a ": null
    },
    {
        "trade pact": "Trade Pact"
    },
    {
        ", an EMU constitutes the sixth of seven stages in the process of ": null
    },
    {
        "economic integration": "Economic Integration"
    },
    {
        ". An EMU agreement usually combines a customs union with a common market. A typical EMU establishes free trade and a common external ": null
    },
    {
        "tariff": "Tariff"
    },
    {
        " throughout its jurisdiction and enforces the freedom of movement of goods, services, and people. This arrangement is distinct from a ": null
    },
    {
        "monetary union": "Monetary Union"
    },
    {
        " , which does not usually involve a common market.     As with the economic and monetary union established among the 28 member states of the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ", an EMU may affect different parts of its jurisdiction in different ways. Some areas are subject to separate customs regulations from other areas subject to the EMU. These varying arrangements may be established in the formal agreement, or they may simply exist on a de facto basis. For example, not all EU member states use the ": null
    },
    {
        "Euro": "Euro"
    },
    {
        " established by its ": null
    },
    {
        "currency union": "Currency Union"
    },
    {
        ", and not all EU member states are part of the ": null
    },
    {
        "Schengen Area": "Schengen Area"
    },
    {
        ". Some nations participate in both unions, and some in neither.     ": null
    },
    {
        "Territories of the United States": "Territories Of The United States"
    },
    {
        ", ": null
    },
    {
        "Australian External Territories": "Australian External Territories"
    },
    {
        " and ": null
    },
    {
        "Realm of New Zealand": "Realm Of New Zealand"
    },
    {
        " territories share a ": null
    },
    {
        "currency": "Currency Union"
    },
    {
        " and, for the most part, the ": null
    },
    {
        "market": "Single Market"
    },
    {
        " of their respective mainland states, but are generally not part of the same ": null
    },
    {
        "customs territories": "Customs Territory"
    },
    {
        ".       Initial discussions about the formation of a union occurred at the Hague Summit in 1969. As a result of these talks, a daft plan was announced. During this time, the main member presiding over this decision was ": null
    },
    {
        "Pierre Werner": "Pierre Werner"
    },
    {
        ", ": null
    },
    {
        "Prime Minister of Luxembourg": "List Of Prime Ministers Of Luxembourg"
    },
    {
        "  .     The decision to form the ": null
    },
    {
        "EMU": "Economic And Monetary Union Of The European Union"
    },
    {
        " was accepted in December 1991, which later became part of the ": null
    },
    {
        "Maastricht Treaty": "Maastricht Treaty"
    },
    {
        " .       four main activities.     The first responsibility is to be in charge of i mplementing an effective monetary policy for the euro area with the objective of price stability. There is a group of economists whose only role is studying how to improve the monetary policy in maintaining price stability. They conduct research, and their results are presented to the leaders of the EMU. Thereafter, the role of the leaders is to find a suitable way to implement the economists work into their countrys policies. Maintaining price stability is a long-term goal for all states in the EMU, due to the effects it might have on the Euro as a currency.     Second, the EMU must coordinate economic and fiscal policies in EU countries. They must find an equilibrium between the implementation of monetary and fiscal policies. They will advise countries to have greater coordination, even if that means having countries tightly coupled with looser monetary and tighter fiscal policy. Not coordinating the monetary market could result in risking an unpredictable situation. The EMU will also have to deliberate on the option of a mixed policy which in some empirical studies have shown that sometimes it can have more benefits than expected.      Third, the EMU ensures that the single market runs smoothly . All member countries will respect the decisions made by the EMU and also ensuring that their actions will be in favor of a stable market      Finally, regulations of the EMU will aid in supervising and monitoring financial institutions . There is an imperative need for all members of the EMU to act in unison. Therefore, the EMU has to have institutions supervising all the member states to protect the main aim of the EMU.         Control fiscal policy that concerns government budgets   Control tax policies that determine how income is raised   Control structural policies that determine pension systems, labor- and capital-market regulations         ": null
    },
    {
        "Economic and Monetary Union of the European Union": "Economic And Monetary Union Of The European Union"
    },
    {
        " with the ": null
    },
    {
        "Euro": "Euro"
    },
    {
        " for the ": null
    },
    {
        "Eurozone": "Eurozone"
    },
    {
        " members   de facto the ": null
    },
    {
        "OECS": "Organisation Of Eastern Caribbean States"
    },
    {
        " Eastern Caribbean Currency Union": "Eastern Caribbean Currency Union"
    },
    {
        " with the ": null
    },
    {
        "East Caribbean dollar": "East Caribbean Dollar"
    },
    {
        " in the ": null
    },
    {
        "CSME": "Caricom Single Market And Economy"
    },
    {
        " The states participating in both initiatives are ": null
    },
    {
        "Antigua and Barbuda": "Antigua And Barbuda"
    },
    {
        ", ": null
    },
    {
        "Dominica": "Dominica"
    },
    {
        ", ": null
    },
    {
        "Grenada": "Grenada"
    },
    {
        ", ": null
    },
    {
        "Saint Kitts and Nevis": "Saint Kitts And Nevis"
    },
    {
        ", ": null
    },
    {
        "Saint Lucia": "Saint Lucia"
    },
    {
        ", ": null
    },
    {
        "Saint Vincent and the Grenadines": "Saint Vincent And The Grenadines"
    },
    {
        ".   de facto ": null
    },
    {
        "Switzerland–Liechtenstein": "Liechtenstein–Switzerland Relationscooperation"
    },
    {
        " Single market": "Single Market"
    },
    {
        " through participation in the ": null
    },
    {
        "internal market of the European Union": "Internal Market Of The European Union"
    },
    {
        ", ": null
    },
    {
        "customs union": "Customs Union"
    },
    {
        " since 1924, informal ": null
    },
    {
        "currency union": "Currency Union"
    },
    {
        " since 1920.               ": null
    },
    {
        "Belgium–Luxembourg Economic Union": "Belgium–Luxembourg Economic Union"
    },
    {
        " , superseded by the ": null
    },
    {
        "European EMU.": "Economic And Monetary Union Of The European Union"
    }
]