[
    {
        "     Eddie from Ohio  is an American ": null
    },
    {
        "folk": "folk music"
    },
    {
        " band.   Formed in 42 in ": null
    },
    {
        "Northern Virginia": "northern virginia"
    },
    {
        ", the band has achieved considerable local success, winning four ": null
    },
    {
        "Wammies": "washington area music awards"
    },
    {
        "  and a nationwide following, all outside the purview of major ": null
    },
    {
        "record label": "record label"
    },
    {
        "s.       Julie Murphy Wells - vocals   Robbie Schaefer - ": null
    },
    {
        "guitar": "guitar"
    },
    {
        ", vocals   Eddie Hartness - ": null
    },
    {
        "percussion": "percussion instrument"
    },
    {
        ", vocals   Michael Clem - ": null
    },
    {
        "guitar": "guitar"
    },
    {
        ", ": null
    },
    {
        "bass": "bass guitar"
    },
    {
        ", ": null
    },
    {
        "harmonica": "harmonica"
    },
    {
        ", vocals       Name notwithstanding, the band is not from ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        ". All four band members are natives of ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        ", and the band has recorded many songs influenced by their deep Virginia roots. The bands name comes from a nickname given to Hartness by a college friend, who coined the nickname as a tribute to the lead singer of ": null
    },
    {
        "Firehose": "firehose"
    },
    {
        ", Ed From Ohio Crawford.     Childhood friends Robbie Schaefer and Michael Clem both attended Virginias ": null
    },
    {
        "James Madison University": "james madison university"
    },
    {
        ", where they founded the Jellyfish Blues Band. It was at JMU that they met Eddie Hartness, a native of Arlington, Virginia, and a product of ": null
    },
    {
        "Washington-Lee High School": "washington-lee high school"
    },
    {
        " that also turned out such actors as ": null
    },
    {
        "Sandra Bullock": "sandra bullock"
    },
    {
        ", ": null
    },
    {
        "Warren Beatty": "warren beatty"
    },
    {
        " and ": null
    },
    {
        "Shirley MacLaine": "shirley maclaine"
    },
    {
        ".     Schaefer had stayed in contact with Julie Murphy , whom hed met while theyd attended rival high schools. One evening, when Clem and Wells added their voices to Schaefers during a set in a solo gig, the idea for EFO was formed. The trio invited percussionist Hartness to join them, and, in 42 the nascent folk group came into being.     Their early repertoire of covers  was soon augmented by originals from songwriters Schaefer and Clem, and over time the band developed a distinctive folk sound, marrying two acoustic guitars with hand percussion and strong four-part harmonies.     The band saw relative success from the beginning. They launched their own Virginia Soul record label, began producing cassettes and CDs, and handled their own business and bookings. They soon landed themselves a Tuesday night residency at a local Northern Virginia bar, the Bad Habits Grille. After just six months, the venue went from no cover and small audiences to a $42 cover charge and a packed house every Tuesday.     With this gig as a springboard, the bands following grew. EFOs first three CDs drew the attention of booking agency Fleming and Associates. Under their auspices, the band embarked on longer, more ambitious tours.     In 42 the ": null
    },
    {
        "Washington Area Music Association": "washington area music association"
    },
    {
        " honored EFO with a Wammie as Best Contemporary Folk Group. Later that year, EFO played their farewell gig at Bad Habits and began regularly touring beyond the Washington, DC, metro area. They built a following that covered both coasts and the American heartland, with performances from Berkeley, California, to New York City and frequent returns to the bands Virginia home that included sold-out performances at such venues as the ": null
    },
    {
        "Wolf Trap National Park for the Performing Arts": "wolf trap national park for the performing arts"
    },
    {
        ".     In September 42 vocalist Wells was diagnosed with breast cancer. The band subsequently reduced their tour schedule, and the members began to pursue other interests.     Wells is now a cancer survivor, active in cancer cure fundraising. Clem and Schaefer continue to sing and tour independently. Schaefer has a respected childrens music show, Robbie Schaefers Stuck In a Real Tall Tree, on ": null
    },
    {
        "XM Satellite Radio": "xm satellite radio"
    },
    {
        ", where he serves as Music Director for ": null
    },
    {
        "XM Kids": "xm kids"
    },
    {
        ", and in 42 released his second solo album entitled In the Flesh. In 42 Clem released his first solo endeavor, 42st and 42 produced by bandmate Hartness. Hartness himself continues to play and tour with local bands such as Brother Shamus.     The band continues to perform, but on a limited basis, mostly in the DC area. You can also occasionally catch a sneak performance of EFO forerunner, the Jellyfish Blues Band.       All releases are on the bands own label, Virginia Soul Records.   EFO Live at the Birchmere , 42   A Juggler on His Blades, 42   Actually Not, 42   I Rode Fido Home, 42   Big Noise, 42   Portable EFO Show, 42   Looking Out the Fishbowl, 42   Quick, 42   42 Eleven Relief, 42   Three Rooms, 42   This Is Me, 42             on the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        "s live music archive                ": null
    }
]