[
    {
        "        Edgar Rice Burroughs was an American fiction writer best known for his celebrated and prolific output in the adventure and science-fiction genres. Among the most notable of his creations are the jungle hero ": null
    },
    {
        "Tarzan": "tarzan"
    },
    {
        ", the heroic ": null
    },
    {
        "Mars": "mars"
    },
    {
        " adventurer ": null
    },
    {
        "John Carter": "john carter of mars"
    },
    {
        " and the fictional landmass within Earth known as ": null
    },
    {
        "Pellucidar": "pellucidar"
    },
    {
        ". Burroughs California ranch is now the center of the ": null
    },
    {
        "Tarzana": "tarzana, los angeles"
    },
    {
        " neighborhood in Los Angeles.           Burroughs was born on September 1, 1875, in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " , the fourth son of Major George Tyler Burroughs , a businessman and ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        " veteran, and his wife, Mary Evaline Burroughs . His middle name is from his paternal grandmother, Mary Coleman Rice Burroughs . .   He was of almost entirely English ancestry, with a family line that had been in ": null
    },
    {
        "North America": "north america"
    },
    {
        " since the ": null
    },
    {
        "Colonial": "colonialist"
    },
    {
        " era.      Through his Rice grandmother, Burroughs was descended from ": null
    },
    {
        "settler": "settler"
    },
    {
        " Edmund Rice": "edmund rice"
    },
    {
        ", one of the English ": null
    },
    {
        "Puritans": "puritan"
    },
    {
        "who moved to ": null
    },
    {
        "Massachusetts Bay Colony": "massachusetts bay colony"
    },
    {
        " in the early 17th Century. He once remarked, I can trace my ancestry back to ": null
    },
    {
        "Deacon": "deacon"
    },
    {
        " Edmund Rice. The Burroughs side of the family was also of English origin and also emigrated to Massachusetts around the same time. Many of his ancestors fought in the ": null
    },
    {
        "American Revolution": "american revolutionary war"
    },
    {
        ". Some of his ancestors settled in Virginia during the colonial period, and Burroughs often emphasized his connection with that side of his family, seeing it as romantic and warlike, Taliaferro, John. Tarzan Forever: The Life of Edgar Rice Burroughs, Creator of Tarzan, pp. 15, 27. and, in fact, could have counted among his close cousins no less than seven signers of the ": null
    },
    {
        "U.S. Declaration of Independence": "u.s. declaration of independence"
    },
    {
        ", including his third cousin, four times removed, 2nd ": null
    },
    {
        "President of the United States": "president of the united states"
    },
    {
        " John Adams": "john adams"
    },
    {
        ".      Burroughs was educated at a number of local schools. He then attended ": null
    },
    {
        "Phillips Academy": "phillips academy"
    },
    {
        ", in ": null
    },
    {
        "Andover, Massachusetts": "andover, massachusetts"
    },
    {
        ", and then the ": null
    },
    {
        "Michigan Military Academy": "michigan military academy"
    },
    {
        ". Graduating in 1895, and failing the entrance exam for the ": null
    },
    {
        "United States Military Academy": "united states military academy"
    },
    {
        " at West Point, he became an enlisted soldier with the ": null
    },
    {
        "7th U.S. Cavalry": "7th u.s. cavalry"
    },
    {
        " in ": null
    },
    {
        "Fort Grant": "fort grant, arizona"
    },
    {
        ", ": null
    },
    {
        "Arizona Territory": "arizona territory"
    },
    {
        ". After being diagnosed with a heart problem and thus ineligible to serve, he was discharged in 1897.              After his discharge Burroughs worked a number of different jobs. During the Chicago ": null
    },
    {
        "influenza": "influenza"
    },
    {
        " epidemic of 1891, he spent half a year at his brothers ranch on the ": null
    },
    {
        "Raft River": "raft river"
    },
    {
        " in ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ", as a ": null
    },
    {
        "cowboy": "cowboy"
    },
    {
        ", drifted somewhat afterward, then worked at his fathers Chicago battery factory in 1899, marrying his childhood sweetheart, Emma Hulbert , in January 1900.     In 1903, Burroughs joined his brothers, ": null
    },
    {
        "Yale": "yale"
    },
    {
        " graduates George and Harry, who were, by then, prominent Pocatello area ranchers in southern Idaho, and partners in the Sweetser-Burroughs Mining Company, where he took on managing their ill-fated ": null
    },
    {
        "Snake River": "snake river"
    },
    {
        " gold dredge": "gold dredge"
    },
    {
        ", a classic bucket-line dredge. The Burroughs brothers were also the sixth cousins, once removed, of famed miner ": null
    },
    {
        "Kate Rice": "kate rice"
    },
    {
        ", a brilliant and statuesque Maths professor who, in 1914, became the first female prospector in the Canadian North. Journalist and publisher ": null
    },
    {
        "C. Allen Thorndike Rice": "c. allen thorndike rice"
    },
    {
        " was also his third cousin.  Edmund Rice Association, Inc.: Meet Some of Edmund Rices Descendants: Notable Writers & Entertainers , page 11, Accessed October 11, 2017.     When the new mine proved unsuccessful, the brothers secured for Burroughs a position with the ": null
    },
    {
        "Oregon Short Line Railroad": "oregon short line railroad"
    },
    {
        " in Salt Lake City.  Offbeat Oregon: Ill-starred gold-mining venture worked out well for Tarzan fans , March 8, 2015, Accessed October 11, 2017. Burroughs resigned from the railroad in October 1904.       By 1911, after seven years of low wages as a pencil-sharpener wholesaler; Burroughs began to write fiction. By this time, Emma and he had two children, Joan , and Hulbert . During this period, he had copious spare time and began reading ": null
    },
    {
        "pulp-fiction magazines": "pulp magazine"
    },
    {
        ". In 1929, he recalled thinking that          In 1913, Burroughs and Emma had their third and last child, John Coleman Burroughs , later known for his illustrations of his fathers books.     In the 1920s, Burroughs became a pilot, purchased a Security Airster S-1 , and encouraged his family to learn to fly.     Daughter Joan married Tarzan film actor, James Pierce , starring with her husband, as the voice of Jane, during 1932-34 for the ": null
    },
    {
        "Tarzan": "tarzan"
    },
    {
        " radio series. The pair were wed for more than forty years, until her death, in 1972.     Burroughs divorced Emma in 1934 and, in 1935, married the former actress Florence Gilbert Dearholt , who was the former wife of his friend , Ashton Dearholt , with whom he had co-founded Burroughs-Tarzan Enterprises while filming The New Adventures of Tarzan. Burroughs adopted the Dearholts two children. He and Florence divorced in 1942.     Burroughs was in his late 60s and was in Honolulu at the time of the Japanese attack on Pearl Harbor . Despite his age, he applied for and received permission to become a war correspondent , becoming one of the oldest U.S. war correspondents during World War II . This period of his life is mentioned in William Brinkley s bestselling novel ": null
    },
    {
        "Dont Go Near the Water": "dont go near the water"
    },
    {
        ".       After the war ended, Burroughs moved back to Encino, California , where after many health problems, he died of a heart attack on March 19, 1950, having written almost 80 novels. He is buried at Tarzana, California, US.     When he died, he was believed to have been the writer who had made the most from films, earning over $2 million in royalties from 27 Tarzan pictures.     The Science Fiction Hall of Fame inducted Burroughs in 2003.       Aiming his work at the pulps, Burroughs had his first story, ": null
    },
    {
        "Under the Moons of Mars": "under the moons of mars"
    },
    {
        ", serialized by Frank Munsey in the February to July 1912 issues of ": null
    },
    {
        "The All-Story": "the all-story"
    },
    {
        " , with photographs. . – under the name Norman Bean to protect his reputation. Under the Moons of Mars inaugurated the Barsoom series and earned Burroughs US $400 . It was first published as a book by A. C. McClurg of Chicago in 1917, entitled ": null
    },
    {
        "A Princess of Mars": "a princess of mars"
    },
    {
        ", after three Barsoom sequels had appeared as serials and McClurg had published the first four serial Tarzan novels as books.     Burroughs soon took up writing full-time, and by the time the run of Under the Moons of Mars had finished, he had completed two novels, including ": null
    },
    {
        "Tarzan of the Apes": "tarzan of the apes"
    },
    {
        ", published from October 1912 and one of his most successful series.     Burroughs also wrote popular science fiction and fantasy stories involving adventurers from Earth transported to various planets , lost islands, and into the interior of the hollow earth in his ": null
    },
    {
        "Pellucidar": "pellucidar"
    },
    {
        " stories. He also wrote Westerns and historical romances. Besides those published in All-Story, many of his stories were published in ": null
    },
    {
        "The Argosy": "argosy"
    },
    {
        " magazine.     Tarzan was a cultural sensation when introduced. Burroughs was determined to capitalize on Tarzans popularity in every way possible. He planned to exploit Tarzan through several different media including a syndicated Tarzan comic strip , movies , and merchandise. Experts in the field advised against this course of action, stating that the different media would just end up competing against each other. Burroughs went ahead, however, and proved the experts wrong – the public wanted Tarzan in whatever fashion he was offered. Tarzan remains one of the most successful fictional characters to this day and is a cultural icon .     In either 1915 or 1919, Burroughs purchased a large ranch north of Los Angeles , California, which he named Tarzana . The citizens of the community that sprang up around the ranch voted to adopt that name when their community, Tarzana, California , was formed in 1927. . Also, the unincorporated community of Tarzan, Texas , was formally named in 1927 when the US Postal Service accepted the name, . reputedly coming from the popularity of the first ": null
    },
    {
        "Tarzan of the Apes": "tarzan of the apes"
    },
    {
        " film, starring Elmo Lincoln , and an early Tarzan comic strip.     In 1923, Burroughs set up his own company, Edgar Rice Burroughs, Inc. , and began printing his own books through the 1930s.       Because of the part Burroughss science fiction played in inspiring real exploration of Mars, an impact crater on Mars was named in his honor after his death. In a ": null
    },
    {
        "Paris Review": "paris review"
    },
    {
        " interview, Ray Bradbury said of Burroughs that Edgar Rice Burroughs never would have looked upon himself as a social mover and shaker with social obligations. But as it turns out – and I love to say it because it upsets everyone terribly – Burroughs is probably the most influential writer in the entire history of the world. Bradbury continued that By giving romance and adventure to a whole generation of boys, Burroughs caused them to go out and decide to become special.     In ": null
    },
    {
        "Something of Myself": "something of myself"
    },
    {
        " Rudyard Kipling wrote: My Jungle Books begat Zoos of . But the genius of all the genii was one who wrote a series called Tarzan of the Apes. I read it, but regret I never saw it on the films, where it rages most successfully. He had jazzed the motif of the Jungle Books and, I imagine, had thoroughly enjoyed himself. He was reported to have said that he wanted to find out how bad a book he could write and get away with, which is a legitimate ambition.     By 1963, Floyd C. Gale of ": null
    },
    {
        "Galaxy Science Fiction": "galaxy science fiction"
    },
    {
        " wrote when discussing reprints of several Burroughs novels by Ace Books , an entire generation has grown up inexplicably Burroughs-less . He stated that most of the authors books had been out of print for years and that only the occasional laughable Tarzan film reminded public of his fiction. Gale reported his surprise that after two decades his books were again available, with Canaveral Press , Dover Publications , and Ballantine Books also reprinting them.     Few critical books have been written about Burroughs. From an academic standpoint, the most helpful are Erling Holtsmarks two books: Tarzan and Tradition Holtsmark, Erling B. Tarzan and Tradition: Classical Myth in Popular Literature. Westport, CT: Greenwood, 1981. and Edgar Rice Burroughs; Holtsmark, Erling B. Edgar Rice Burroughs. Twaynes United States Author Series. Boston: Twayne, 1986. Stan Galloways The Teenage Tarzan: A Literary Analysis of Edgar Rice Burroughs Jungle Tales of Tarzan; Galloway, Stan. The Teenage Tarzan: A Literary Analysis of Edgar Rice Burroughs Jungle Tales of Tarzan. Jefferson, NC: McFarland, 2010. and Richard Lupoffs two books: Master of Adventure: Edgar Rice Burroughs Lupoff, Richard. Master of Adventure: Edgar Rice Burroughs. Lincoln: University of Nebraska Press, 2005. and Barsoom: Edgar Rice Burroughs and the Martian Vision. Lupoff, Richard. Barsoom: Edgar Rice Burroughs and the Martian Vision. Baltimore: Mirage Press, 1976. Galloway was identified by James Edwin Gunn as one of the half-dozen finest Burroughs scholars in the world ; Gunn, James. Foreword. The Teenage Tarzan by Stan Galloway. Jefferson, NC: McFarland, 2010. p. 3. Galloway called Holtsmark his most important predecessor. Preface. p. 5.           Barsoom series": null
    },
    {
        "A Princess of Mars": "a princess of mars"
    },
    {
        "   The Gods of Mars": "the gods of mars"
    },
    {
        "   The Warlord of Mars": "the warlord of mars"
    },
    {
        "   Thuvia, Maid of Mars": "thuvia, maid of mars"
    },
    {
        "   The Chessmen of Mars": "the chessmen of mars"
    },
    {
        "   The Master Mind of Mars": "the master mind of mars"
    },
    {
        "   A Fighting Man of Mars": "a fighting man of mars"
    },
    {
        "   Swords of Mars": "swords of mars"
    },
    {
        "   Synthetic Men of Mars": "synthetic men of mars"
    },
    {
        "   Llana of Gathol": "llana of gathol"
    },
    {
        "   John Carter of Mars": "john carter of mars"
    },
    {
        "     Tarzan series": null
    },
    {
        "Tarzan of the Apes": "tarzan of the apes"
    },
    {
        "   The Return of Tarzan": "the return of tarzan"
    },
    {
        "   The Beasts of Tarzan": "the beasts of tarzan"
    },
    {
        "   The Son of Tarzan": "the son of tarzan"
    },
    {
        "   Tarzan and the Jewels of Opar": "tarzan and the jewels of opar"
    },
    {
        "   Jungle Tales of Tarzan": "jungle tales of tarzan"
    },
    {
        "   Tarzan the Untamed": "tarzan the untamed"
    },
    {
        "   Tarzan the Terrible": "tarzan the terrible"
    },
    {
        "   Tarzan and the Golden Lion": "tarzan and the golden lion"
    },
    {
        "   Tarzan and the Ant Men": "tarzan and the ant men"
    },
    {
        "   Tarzan, Lord of the Jungle": "tarzan, lord of the jungle"
    },
    {
        "   Tarzan and the Lost Empire": "tarzan and the lost empire"
    },
    {
        "   Tarzan at the Earths Core": "tarzan at the earths core"
    },
    {
        "   Tarzan the Invincible": "tarzan the invincible"
    },
    {
        "   Tarzan Triumphant": "tarzan triumphant"
    },
    {
        "   Tarzan and the City of Gold": "tarzan and the city of gold"
    },
    {
        "   Tarzan and the Lion Man": "tarzan and the lion man"
    },
    {
        "   Tarzan and the Leopard Men": "tarzan and the leopard men"
    },
    {
        "   Tarzans Quest": "tarzans quest"
    },
    {
        "   Tarzan the Magnificent": "tarzan the magnificent"
    },
    {
        "   Tarzan and the Forbidden City": "tarzan and the forbidden city"
    },
    {
        "   Tarzan and the Foreign Legion": "tarzan and the foreign legion"
    },
    {
        "   Tarzan and the Tarzan Twins": "tarzan and the tarzan twins"
    },
    {
        "   Tarzan and the Madman": "tarzan and the madman"
    },
    {
        "   Tarzan and the Castaways": "tarzan and the castaways"
    },
    {
        "   Tarzan: The Lost Adventure": "tarzan: the lost adventure"
    },
    {
        "     Pellucidar series": null
    },
    {
        "At the Earths Core": "at the earths core"
    },
    {
        "   Pellucidar": "pellucidar"
    },
    {
        "   Tanar of Pellucidar": "tanar of pellucidar"
    },
    {
        "   Tarzan at the Earths Core": "tarzan at the earths core"
    },
    {
        "   Back to the Stone Age": "back to the stone age"
    },
    {
        "   Land of Terror": "land of terror"
    },
    {
        "   Savage Pellucidar": "savage pellucidar"
    },
    {
        "     Venus series": null
    },
    {
        "Pirates of Venus": "pirates of venus"
    },
    {
        "   Lost on Venus": "lost on venus"
    },
    {
        "   Carson of Venus": "carson of venus"
    },
    {
        "   Escape on Venus": "escape on venus"
    },
    {
        "   The Wizard of Venus": "the wizard of venus"
    },
    {
        "     Caspak series": null
    },
    {
        "The Land That Time Forgot": "the land that time forgot"
    },
    {
        "   The People That Time Forgot": "the people that time forgot"
    },
    {
        "   Out of Times Abyss": "out of times abyss"
    },
    {
        "     Moon series": null
    },
    {
        "The Moon Maid": "the moon maid"
    },
    {
        "    Part I: The Moon Maid   Part II: The Moon Men   Part III: The Red Hawk   These three texts have been published by various houses in one or two volumes. Adding to the confusion, some editions have the original introduction to Part I from the first publication as a magazine serial, and others have the shorter version from the first book publication, which included all three parts under the title The Moon Maid. .     Mucker series": null
    },
    {
        "The Mucker": "the mucker"
    },
    {
        "   The Return of the Mucker": "the return of the mucker"
    },
    {
        "   The Oakdale Affair": "the oakdale affair"
    },
    {
        "       The Monster Men": "the monster men"
    },
    {
        "   The Lost Continent": "beyond thirty"
    },
    {
        "    The Resurrection of Jimber-Jaw": "the resurrection of jimber-jaw"
    },
    {
        "   Beyond the Farthest Star": "beyond the farthest star"
    },
    {
        "       The Cave Girl": "the cave girl"
    },
    {
        "   The Eternal Lover": "the eternal lover"
    },
    {
        "    The Man-Eater": "the man-eater"
    },
    {
        "   The Lad and the Lion": "the lad and the lion"
    },
    {
        "    Jungle Girl          The Bandit of Hells Bend     The War Chief     Apache Devil     The Deputy Sheriff of Comanche County         The Outlaw of Torn     I am a Barbarian         Minidoka: 937th Earl of One Mile Series M     The Mad King     The Girl from Farriss     The Rider     The Efficiency Expert     The Girl from Hollywood     Marcia of the Doorstep     You Lucky Girl!     Pirate Blood     Forgotten Tales of Love and Murder     Brother Men         Master of Adventure: The Worlds of Edgar Rice Burroughs  by ": null
    },
    {
        "Richard A. Lupoff": "richard a. lupoff"
    },
    {
        " Tarzan Forever: The Life of Edgar Rice Burroughs, Creator of Tarzan by ": null
    },
    {
        "John Taliaferro": "john taliaferro"
    },
    {
        " Golden Anniversary Bibliography of Edgar Rice Burroughs by ": null
    },
    {
        "the Rev. Henry Hardy Heins": "henry hardy heins"
    },
    {
        "  Tarzan Alive  by ": null
    },
    {
        "Philip Jose Farmer": "philip jose farmer"
    },
    {
        " Burroughss Science Fiction by Robert R. Kudlay and Joan Leiby   Tarzan and Tradition and Edgar Rice Burroughs by Erling B. Holtsmark   Edgar Rice Burroughs by Irwin Porges   Edgar Rice Burroughs by Robert B. Zeuschner   The Burroughs Cyclopædia ed. by Clark A. Brady   A Guide to Barsoom by John Flint Roy   Tarzan: the Centennial Celebration by ": null
    },
    {
        "Scott Tracy Griffin": "scott tracy griffin"
    },
    {
        " Edgar Rice Burroughs: The Descriptive Bibliography of the Grosset & Dunlap Reprints": null
    }
]