[
    {
        "EDIF  is a vendor-neutral format based on ": null
    },
    {
        "S-Expressions": "s-expression"
    },
    {
        "in which to store Electronic ": null
    },
    {
        "netlists": "netlist"
    },
    {
        "and schematics. It was one of the first attempts to establish a neutral data exchange format for the ": null
    },
    {
        "electronic design automation": "electronic design automation"
    },
    {
        " industry. The goal was to establish a common format from which the proprietary formats of the EDA systems could be derived. When customers needed to transfer data from one system to another, it was necessary to write translators from one format to other. As the number of formats  multiplied, the translator issue became an N-squared problem. The expectation was that with EDIF the number of translators could be reduced to the number of involved systems.     Representatives of the EDA companies ": null
    },
    {
        "Daisy Systems": "daisy systems"
    },
    {
        ", ": null
    },
    {
        "Mentor Graphics": "mentor graphics"
    },
    {
        ", ": null
    },
    {
        "Motorola": "motorola"
    },
    {
        ", ": null
    },
    {
        "National Semiconductor": "national semiconductor"
    },
    {
        ", ": null
    },
    {
        "Tektronix": "tektronix"
    },
    {
        ", ": null
    },
    {
        "Texas Instruments": "texas instruments"
    },
    {
        " and the ": null
    },
    {
        "University of California, Berkeley": "university of california, berkeley"
    },
    {
        " established the EDIF Steering Committee in November 1983. Later ": null
    },
    {
        "Hilary Kahn": "hilary kahn"
    },
    {
        ", a computer science professor at the ": null
    },
    {
        "University of Manchester": "university of manchester"
    },
    {
        ", joined the team and led the development from version EDIF 2 0 0 till the final version 4 0 0.         The general format of EDIF involves using parentheses to delimit data definitions, and in this way it superficially resembles ": null
    },
    {
        "Lisp": "lisp"
    },
    {
        ". The basic tokens of EDIF 2.0.0 were keywords , strings , integer numbers, symbolic constants  and Identifiers , which are reference labels formed from a very restricted set of characters.   EDIF 3.0.0 and 4.0.0 dropped the symbolic constants entirely, using keywords instead.   So, the syntax of EDIF has a fairly simple foundation. A typical EDIF file looks like this:              ": null
    }
]