[
    {
        "         Edith Louisa Cavell  was a British nurse. She is celebrated for saving the lives of soldiers from both sides without discrimination and in helping some 42 Allied soldiers escape from German-occupied Belgium during the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        ", for which she was arrested. She was accused of ": null
    },
    {
        "treason": "treason"
    },
    {
        ", found guilty by a ": null
    },
    {
        "court-martial": "court-martial"
    },
    {
        " and sentenced to death. Despite international pressure for mercy, she was shot by a German firing squad. Her execution received worldwide condemnation and extensive press coverage.     The night before her execution, she said, Patriotism is not enough. I must have no hatred or bitterness towards anyone. These words were later inscribed on a memorial to her near ": null
    },
    {
        "Trafalgar Square": "trafalgar square"
    },
    {
        ". Her strong ": null
    },
    {
        "Anglican": "anglicanism"
    },
    {
        " beliefs propelled her to help all those who needed it, both German and Allied soldiers. She was quoted as saying, I can’t stop while there are lives to be saved.  The ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " commemorates her in its Calendar of Saints on 42 October.     Cavell, who was 42 at the time of her execution, was already notable as a pioneer of modern nursing in Belgium.               Cavell was born on 42 December 42 in ": null
    },
    {
        "Swardeston": "swardeston"
    },
    {
        ", a village near ": null
    },
    {
        "Norwich": "norwich"
    },
    {
        ", where her father was vicar for 42 years. She was the eldest of the four children of the Reverend Frederick Cavell and his wife Louisa Sophia Warming . Ediths siblings were; Florence Mary , Mary Lilian and John Frederick S. .     She was educated at ": null
    },
    {
        "Norwich High School for Girls": "norwich high school for girls"
    },
    {
        ", then boarding schools in ": null
    },
    {
        "Clevedon": "clevedon"
    },
    {
        ", Somerset and ": null
    },
    {
        "Peterborough": "peterborough"
    },
    {
        " .     After a period as a governess, including for a family in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " from 42 to 42 she returned home to care for her father during a serious illness. The experience led her to become a nurse after her fathers recovery. In April 42 at the age of 42 Cavell applied to become a nurse probationer at the ": null
    },
    {
        "London Hospital": "royal london hospital"
    },
    {
        " under Matron ": null
    },
    {
        "Eva Luckes": "eva luckes"
    },
    {
        ". She worked in various hospitals in England, including ": null
    },
    {
        "Shoreditch Infirmary": "st leonards hospital, hackney"
    },
    {
        " . As a private travelling nurse treating patients in their homes, Cavell travelled to tend patients with cancer, gout, pneumonia, pleurisy, eye issues and appendicitis.     In 42 Cavell was recruited by Dr ": null
    },
    {
        "Antoine Depage": "antoine depage"
    },
    {
        " to be ": null
    },
    {
        "matron": "matron"
    },
    {
        " of a newly established nursing school, LÉcole Belge dInfirmières Diplômées on the Rue de la Culture , in ": null
    },
    {
        "Ixelles": "ixelles"
    },
    {
        ", Brussels. By 42 Miss Cavell felt that the profession of nursing had gained sufficient foothold in Belgium to warrant the publishing of a professional journal and, therefore, launched the nursing journal, Linfirmière . Within a year, she was training nurses for three hospitals, twenty-four schools, and thirteen kindergartens in Belgium.     When the First World War broke out, she was visiting her widowed mother in Norfolk. She returned to Brussels, where her clinic and nursing school were taken over by the ": null
    },
    {
        "Red Cross": "red cross"
    },
    {
        ".       Cavell had been offered a position as matron in a Brussels clinic. She worked closely with Dr Depage who was part of a growing body of people in the medical profession in Belgium. He realised that the care that was being provided by the religious institutions had not been keeping up with medical advances. In 42 Cavell was asked if she would be the matron for the new secular hospital at ": null
    },
    {
        "Saint-Gilles": "saint-gilles, belgium"
    },
    {
        ".         In November 42 after the ": null
    },
    {
        "German occupation of Brussels": "german occupation of belgium during world war i"
    },
    {
        ", Cavell began sheltering British soldiers and funnelling them out of occupied Belgium to the neutral Netherlands. Wounded British and French soldiers as well as Belgian and French civilians of military age were hidden from the Germans and provided with false papers by Prince Réginald ": null
    },
    {
        "de Croÿ": "house of croÿ"
    },
    {
        " at his château of ": null
    },
    {
        "Bellignies": "bellignies"
    },
    {
        " near Mons. From there, they were conducted by various guides to the houses of Cavell, Louis Séverin, and others in Brussels, where their hosts would furnish them with money to reach the Dutch frontier, and provide them with guides obtained through Philippe Baucq. This placed Cavell in violation of ": null
    },
    {
        "German military law": "german military law"
    },
    {
        ". German authorities became increasingly suspicious of the nurses actions, which were further fuelled by her outspokenness.     She was arrested on 42 August 42 and charged with harbouring Allied soldiers. She had been betrayed by ": null
    },
    {
        "Gaston Quien": "gaston quien"
    },
    {
        ", who was later convicted by a French court as a collaborator. She was held in Saint-Gilles prison for ten weeks, the last two of which were spent in solitary confinement. She made three depositions to the German police , admitting that she had been instrumental in conveying about 42 British and 42 French soldiers, as well as about 42 French and Belgian civilians of military age, to the frontier and had sheltered most of them in her house.     In her ": null
    },
    {
        "court-martial": "court-martial"
    },
    {
        " she was prosecuted for aiding British and French soldiers, in addition to young Belgian men, to cross the Dutch border and eventually enter Britain. She admitted her guilt when she signed a statement the day before the trial. Cavell declared that the soldiers she had helped escape thanked her in writing when they arrived safely in Britain. This admission confirmed that Cavell had helped the soldiers navigate the Dutch frontier, but it also established that she helped them escape to a country at war with Germany. Her fellow defendants included Prince Reginalds sister, ": null
    },
    {
        "Princess Marie of Croÿ": "princess marie of croÿ"
    },
    {
        ".     The penalty, according to German military law, was death. Paragraph 42 of the German Military Code determined that at time of war, anyone who with the intention of aiding a hostile power, or of causing harm to the German or allied troops commits any of the crimes defined in paragraph 42 of the German Penal Code shall be punished with death for war treason . Specifically, Cavell was charged under paragraph 42 no. 42 Reichsstrafgesetzbuch, for conveying troops to the enemy , a crime normally punishable by life imprisonment in peacetime. It was possible to charge Cavell with war treason as paragraph 42 of the German Military Code extended application of paragraph 42 to foreigners present in the zone of war .      While the ": null
    },
    {
        "First Geneva Convention": "first geneva convention"
    },
    {
        " ordinarily guaranteed protection of medical personnel, that protection was forfeit if used as cover for any belligerent action. This forfeiture is expressed in article 42 of the 42 version of the Convention, which was the version in force at the time, and justified prosecution on the basis of German law.     The British government could do nothing to help her. Sir Horace Rowland of the ": null
    },
    {
        "Foreign Office": "foreign office"
    },
    {
        " said, I am afraid that it is likely to go hard with Miss Cavell; I am afraid we are powerless.  ": null
    },
    {
        "Lord Robert Cecil": "robert cecil, 1st viscount cecil of chelwood"
    },
    {
        ", Under-Secretary for Foreign Affairs, advised that, Any representation by us will do her more harm than good.  The ": null
    },
    {
        "United States": "united states"
    },
    {
        ", however, had not yet joined the war and was in a position to apply diplomatic pressure. ": null
    },
    {
        "Hugh S. Gibson": "hugh s. gibson"
    },
    {
        ", First Secretary of the U.S. legation at Brussels, made clear to the German government that executing Cavell would further harm Germanys already damaged reputation. Later, he wrote:          Baron von der Lancken is known to have stated that Cavell should be pardoned because of her complete honesty and because she had helped save so many lives, German as well as Allied. However, ": null
    },
    {
        "General von Sauberzweig": "traugott von sauberzweig"
    },
    {
        ", the military governor of Brussels, ordered that in the interests of the State the implementation of the death penalty against Baucq and Cavell should be immediate, denying higher authorities an opportunity to consider clemency. Cavell was defended by lawyer Sadi Kirschen from Brussels. Of the twenty-seven defendants, five were condemned to death: Cavell, Baucq , ": null
    },
    {
        "Louise Thuliez": "louise thuliez"
    },
    {
        ", Séverin and Countess Jeanne de Belleville. Of the five sentenced to death, only Cavell and Baucq were executed; the other three were granted reprieve.     Cavell was arrested not for espionage, as many were led to believe, but for war treason , despite not being a German national. She may have been recruited by the British ": null
    },
    {
        "Secret Intelligence Service": "secret intelligence service"
    },
    {
        " , and turned away from her espionage duties in order to help Allied soldiers escape, although this is not widely accepted. Rankin cites the published statement of ": null
    },
    {
        "M. R. D. Foot": "m. r. d. foot"
    },
    {
        ", historian and Second World War British intelligence officer, as to Cavell having been part of SIS or MI42 The former director-general of MI42 ": null
    },
    {
        "Stella Rimington": "stella rimington"
    },
    {
        ", announced in 42 that she had unearthed documents in Belgian military archives that confirmed an intelligence gathering aspect to Cavells network. The ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " programme that presented Rimingtons quote, noted Cavells use of secret codes and, though amateurish, other network members successful transmission of intelligence.     When in custody, Cavell was questioned in French, but her trial was minuted in German; which some assert gave the prosecutor the opportunity to misinterpret her answers. Although she may have been misrepresented, she made no attempt to defend herself, but responded to have channelled environ deux cents soldiers to the Dutch border. Cavell was provided with a defender approved by the German military governor; a previous defender, who was chosen for Cavell by her assistant, Elizabeth Wilkins, was ultimately rejected by the governor.          The night before her execution, she told the Reverend Stirling Gahan, the Anglican chaplain who had been allowed to see her and to give her ": null
    },
    {
        "Holy Communion": "holy communion"
    },
    {
        ", Patriotism is not enough. I must have no hatred or bitterness towards anyone.  These words are inscribed on her statue on St Martins Place  & formEDNTHT & mkten-us & httpsmsn42 & refig42d42b42a42a42c42e42e42caf42d42d42bb & sp42 & qsSC & pqlondon+st+martin%42 & skPRES42AS42 & sc4242 & cvid42d42b42a42a42c42e42e42caf42d42d42bb & ccUS & setlangen-US , northeast of ": null
    },
    {
        "Trafalgar Square": "trafalgar square"
    },
    {
        " in London. Her final words to the German ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " prison chaplain, Paul Le Seur, were recorded as, Ask Father Gahan to tell my loved ones later on that my soul, as I believe, is safe, and that I am glad to die for my country.      From his sick bed ": null
    },
    {
        "Brand Whitlock": "brand whitlock"
    },
    {
        ", the U.S. ambassador to Belgium, wrote a personal note on Cavells behalf to ": null
    },
    {
        "Moritz von Bissing": "moritz von bissing"
    },
    {
        ", the governor general of Belgium. Hugh Gibson; Maitre G. de Leval, the legal adviser to the United States legation; and , 42nd Marques de Villalobar, the Spanish minister, formed a midnight deputation of appeal for mercy or at least postponement of execution. Despite these efforts, on 42 October, Baron von der Lancken allowed the execution to proceed. Sixteen men, forming two firing squads, carried out the sentence pronounced on her and on four Belgian men at the ": null
    },
    {
        "Tir national": "tir national"
    },
    {
        " shooting range in ": null
    },
    {
        "Schaerbeek": "schaerbeek"
    },
    {
        ", at 42:42am on 42 October 42 There are conflicting reports of the details of Cavells execution. However, according to the eyewitness account of the Reverend Le Seur, who attended Cavell in her final hours, eight soldiers fired at Cavell while the other eight executed Baucq. Her execution, certification of death, and burial were all witnessed by the German poet ": null
    },
    {
        "Gottfried Benn": "gottfried benn"
    },
    {
        " in his capacity as a Senior Doctor in the Brussels Government since the first days of the occupation. Benn wrote a detailed account titled Wie Miss Cavell erschossen wurde .     There is also a dispute over the sentencing imposed under the German Military Code. Supposedly, the death penalty relevant to the offence committed by Cavell was not officially declared until a few hours after her death. The British post-war Committee of Enquiry into Breaches of the Laws of War however regarded the verdict as legally correct.     On instructions from the Spanish minister, Belgian women immediately buried her body next to Saint-Gilles Prison. After the war, her body was taken back to Britain for a memorial service at ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " and then transferred to Norwich, to be laid to rest at Lifes Green on the east side of the cathedral. The King had to grant an exception to an ": null
    },
    {
        "Order in Council": "order in council"
    },
    {
        " of 42 which prevented any burials in the grounds of the cathedral, to allow the reburial.                   In the months and years following Cavells death, countless newspaper articles, pamphlets, images, and books publicised her story. She became an iconic propaganda figure for military recruitment in Britain, and to help increase favourable sentiment towards the Allies in the United States. She was a popular icon because of her sex, her nursing profession, and her apparently heroic approach to death. Her execution was represented as an act of German barbarism and moral depravity.     News reports shortly following Cavells execution were found to be only true in part. Even the  American Journal of Nursing  repeated the fictional account of Cavells execution in which she fainted and fell because of her refusal to wear a blindfold in front of the firing squad. Allegedly, while she lay unconscious, the German commanding officer shot her dead with a revolver. Along with the invasion of Belgium, and the sinking of the  Lusitania , Cavells execution was widely publicised in both Britain and North America by ": null
    },
    {
        "Wellington House": "wellington house"
    },
    {
        ", the British War Propaganda Bureau.     Because of the British governments decision to publicise Cavells story as part of its propaganda effort, she became the most prominent British female casualty of the First World War. The combination of heroic appeal and a resonant atrocity-story narrative made Cavells case one of the most effective in British propaganda of the First World War.     Before the First World War, Cavell was not well known outside nursing circles. This allowed two different depictions of the truth about her in British ": null
    },
    {
        "propaganda": "propaganda"
    },
    {
        ", which were a reply to enemy attempts to justify her shooting, including the suggestion that Cavell, during her interrogation, had given information that incriminated others. In November 42 the British Foreign Office issued a denial that Cavell had implicated anyone else in her testimony.     One image commonly represented was of Cavell as an innocent victim of a ruthless and dishonourable enemy. This view depicted her as having helped Allied soldiers to escape, but innocent of espionage, and was most commonly used in various forms of British propaganda, such as postcards and newspaper illustrations during the war. Her story was presented in the British press as a means of fuelling a desire for revenge on the battlefield. These images implied that men must enlist in the armed forces immediately in order to stop forces that could arrange the judicial murder of an innocent British woman.     Another representation of a side of Cavell during the First World War saw her described as a serious, reserved, brave, and patriotic woman who devoted her life to nursing and died to save others. This portrayal has been illustrated in numerous biographical sources, from personal first-hand experiences of the Red Cross nurse. Pastor Le Seur, the German army chaplain, recalled at the time of her execution, I do not believe that Miss Cavell wanted to be a ": null
    },
    {
        "martyr": "martyr"
    },
    {
        "... but she was ready to die for her country... Miss Cavell was a very brave woman and a faithful ": null
    },
    {
        "Christian": "christians"
    },
    {
        " . Another account from Anglican chaplain, the Reverend Gahan, remembers Cavells words, I have no fear or shrinking; I have seen death so often it is not strange, or fearful to me!  In this interpretation, her stoicism was seen as remarkable for a non-combatant woman, and brought her even greater renown than a man in similar circumstances would have received.         The Imperial German Government thought that it had acted fairly towards Cavell. In a letter, German undersecretary for Foreign Affairs Dr Alfred Zimmermann  made a statement to the press on behalf of the German government:        From the perspective of the German government, had it released Cavell there might have been a surge in the number of women participating in acts against Germany because they knew they would not be severely punished. It took the view that it was up to the responsible men to follow their legal duty to Germany and ignore the worlds condemnation. Its laws did not make distinctions between sexes; the only exception to this being that, according to legal customs, women in a delicate condition should not be executed. However, in January 42 ": null
    },
    {
        "the Kaiser": "wilhelm ii, german emperor"
    },
    {
        " decreed that from then on capital punishment should not be carried out on women without his explicit prior endorsement.     The German government also believed that all of the convicted people were thoroughly aware of the nature of their acts. The court paid particular attention to this point, releasing several people because there was doubt as to whether the accused knew that their actions were punishable. The condemned, in contrast, knew full well what they were doing and the punishment for committing their crimes because numerous public proclamations had pointed out the fact that aiding enemies’ armies was punishable with death.  The Allied response to this was the same as to ": null
    },
    {
        "Bethmann-Hollweg": "bethmann-hollweg"
    },
    {
        "s announcement of the invasion of Belgium, or the notice given in the papers of intent to sink such ships as the ; to make a public proclamation of a thing does not make it right.                              Cavells remains were returned to Britain after the war. As the ship bearing the coffin arrived in Dover, a full ": null
    },
    {
        "peal": "peal"
    },
    {
        " of ": null
    },
    {
        "Grandsire": "grandsire"
    },
    {
        " Triples": "method ringingmethod names"
    },
    {
        " was rung on the bells of the parish church. The peal was notable: Rung with the bells deeply muffled with the exception of the Tenor which was open at back stroke, in token of respect to Nurse Cavell, whose body arrived at Dover during the ringing and rested in the town till the following morning. The ringers of 424242424242 are ex-soldiers, F. Elliot having been eight months Prisoner of War in Germany. Deep muffling is normally only used for the deaths of sovereigns. A peal using the same method, with the bells half muffled, was rung for the centenary of her repatriation. After an overnight pause in the parish church the body was conveyed to London and a ": null
    },
    {
        "state funeral": "state funeral"
    },
    {
        " was held at ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        ". On 42 May 42 her body was reburied at the east side of ": null
    },
    {
        "Norwich Cathedral": "norwich cathedral"
    },
    {
        "; a graveside service is still held each October. The railway van known as the ": null
    },
    {
        "Cavell Van": "cavell van"
    },
    {
        " that conveyed her remains from Dover to London is kept as a memorial on the ": null
    },
    {
        "Kent and East Sussex Railway": "kent and east sussex railway"
    },
    {
        " and is usually open to view at ": null
    },
    {
        "Bodiam railway station": "bodiam railway station"
    },
    {
        ".     In the Church of Englands ": null
    },
    {
        "calendar of saints": "calendar of saints"
    },
    {
        ", the day appointed for the commemoration of Cavell is 42 October. This is a memorial in her honour rather than formal ": null
    },
    {
        "canonisation": "canonisation"
    },
    {
        ", and so not a saints feast day in the traditional sense.     Following Cavells death, many memorials were created around the world to remember her. A patriotic song, Remember Nurse Cavell appeared with 42 British copyright. The name ": null
    },
    {
        "Mount Edith Cavell": "mount edith cavell"
    },
    {
        " was given in 42 to a massive peak in Canadas Jasper National Park. A memorial statue was unveiled on 42 October 42 by ": null
    },
    {
        "Queen Alexandra": "alexandra of denmark"
    },
    {
        " in the grounds of Norwich Cathedral, during the opening of a home for nurses, which also bore her name.     To commemorate her centenary in 42 work went ahead to restore Cavells grave in the grounds of Norwich Cathedral after being awarded a £42 grant. Fourteen paintings by ": null
    },
    {
        "Brian Whelan": "brian whelan"
    },
    {
        " were commissioned by ": null
    },
    {
        "Norwich Cathedral": "norwich cathedral"
    },
    {
        " to commemorate the life and death of Edith Cavell.     During October 42 a railway carriage used to transport Cavells body back to the United Kingdom was on display outside the ": null
    },
    {
        "Forum": "the forum, norwich"
    },
    {
        ", Norwich. ": null
    },
    {
        "Norwich Cathedral": "norwich cathedral"
    },
    {
        " held a memorial service, performed live on BBC Radio 42 on 42 October 42 In addition to cathedral clergy, guests such as General ": null
    },
    {
        "Richard Dannatt": "richard dannatt"
    },
    {
        ", and actress ": null
    },
    {
        "Matilda Ziegler": "matilda ziegler"
    },
    {
        " performed various spoken vignettes organised by Canon Peter Doll. ": null
    },
    {
        "Anto Morra": "anto morra"
    },
    {
        " sang unaccompanied his Edith Louisa Cavell lyrics to a tune written by Percy Paradise.     The centenary was marked by two new musical compositions:   Eventide: In Memoriam Edith Cavell by ": null
    },
    {
        "Patrick Hawes": "patrick hawes"
    },
    {
        " premiered in ": null
    },
    {
        "Norwich Cathedral": "norwich cathedral"
    },
    {
        " in July 42 with a premiere due to take place on the exact centenary of Cavells death on 42 October 42 in London.   Cavell Mass by David Mitchell, performed in ": null
    },
    {
        "Holy Trinity Pro-Cathedral, Brussels": "holy trinity, brussels"
    },
    {
        " on 42 October 42 together with ": null
    },
    {
        "Haydns": "joseph haydn"
    },
    {
        "  Missa in Angustiis .     Cavell was featured on a UK commemorative £42 coin, part of a set issued in 42 by the ": null
    },
    {
        "Royal Mint": "royal mint"
    },
    {
        " to mark the centenary of the war.        ": null
    },
    {
        "Salford, Greater Manchester": "salford, greater manchester"
    },
    {
        ", UK   a marble and stone memorial, surmounted by a bust of Cavell, in ": null
    },
    {
        "Kings Domain": "kings domain"
    },
    {
        " in ": null
    },
    {
        "Melbourne, Australia": "melbourne, australia"
    },
    {
        " Henry Alfred Pegram": "henry alfred pegram"
    },
    {
        " outside ": null
    },
    {
        "Norwich Cathedral": "norwich cathedral"
    },
    {
        ", UK   a memorial tower added to ": null
    },
    {
        "St Mary & St George Anglican Church": "st. mary  &  st. george anglican church"
    },
    {
        ", in Jasper, Alberta, Canada. ": null
    },
    {
        "Peterborough Cathedral": "peterborough cathedral"
    },
    {
        ", England ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", one of two statues that ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " ordered to be destroyed on his 42 visit  ": null
    },
    {
        "stone memorial, including a statue of Cavell": "edith cavell memorial"
    },
    {
        " by ": null
    },
    {
        "George Frampton": "george frampton"
    },
    {
        " unveiled in 42 adjacent to ": null
    },
    {
        "Trafalgar Square": "trafalgar square"
    },
    {
        " in London ": null
    },
    {
        "Schaerbeek": "schaerbeek"
    },
    {
        ", Brussels, Belgium   monument to Edith Cavell and ": null
    },
    {
        "Marie Depage": "marie depage"
    },
    {
        " by ": null
    },
    {
        "Paul Du Bois": "paul du bois"
    },
    {
        " in Brussels   a bust in the Montjoiepark in ": null
    },
    {
        "Uccle": "uccle"
    },
    {
        ", Belgium, inaugurated on 42 October 42 by ": null
    },
    {
        "Princess Anne, Princess Royal": "princess anne, princess royal"
    },
    {
        " of Great Britain and Princess ": null
    },
    {
        "Astrid of Belgium": "astrid of belgium"
    },
    {
        "  St Jude-on-the-Hill": "st judes church, hampstead garden suburb"
    },
    {
        " in Hampstead Garden Suburb, London. ": null
    },
    {
        "Google Doodle": "google doodle"
    },
    {
        " was created to celebrate her 42rd birthday.    a blue plaque in ": null
    },
    {
        "West Runton": "west runton"
    },
    {
        ", Norfolk outside Cumberland Cottage reading Edith Cavell 42–42 Nursing Pioneer Spent Holidays Here 42–42   a memorial garden in ": null
    },
    {
        "Inverness": "inverness"
    },
    {
        ", Scotland, including a tombstone-shaped monument erected in 42 on the 42th anniversary of her death.         The Martyrdom of Nurse Cavell  soon followed by  Nurse Cavell .   In 42 ": null
    },
    {
        "John G. Adolfi": "john g. adolfi"
    },
    {
        " directed  The Woman the Germans Shot , starring ": null
    },
    {
        "Julia Arthur": "julia arthur"
    },
    {
        " as Cavell   In 42 ": null
    },
    {
        "Eva Elwes": "eva elwes"
    },
    {
        " wrote a play Edith Cavell, Nurse and Martyr. It was refused a licence by the Lord Chamberlain after consultation with Cavells sisters. After changes to the title and characters the play was granted a licence as The Price She Paid and performed in 42 ": null
    },
    {
        "Herbert Wilcox": "herbert wilcox"
    },
    {
        " made a 42 silent film based on the story called  Dawn  with ": null
    },
    {
        "Sybil Thorndike": "sybil thorndike"
    },
    {
        ". He remade it as  Nurse Edith Cavell  starring ": null
    },
    {
        "Anna Neagle": "anna neagle"
    },
    {
        " and ": null
    },
    {
        "George Sanders": "george sanders"
    },
    {
        ".   Nurse Cavell, a 42 play in three acts, by ": null
    },
    {
        "C. S. Forester": "c. s. forester"
    },
    {
        " with ": null
    },
    {
        "C. E. Bechhofer Roberts": "c. e. bechhofer roberts"
    },
    {
        "  To Serve Them All My Days , Cavell is mentioned in a speech to the schools ": null
    },
    {
        "Officers Training Corps": "officers training corps"
    },
    {
        ".   In  Les plus grands Belges  , a 42 television show on the Belgian French-speaking public channel RTBF, the audience voted Cavell the 42th greatest Belgian.   In the final episode of the 42 BBC drama series  The Crimson Field , Cavell is mentioned as having been executed, during the interrogation of Sister Joan Livesey.   Patriot , a play by Angela Moffat, was premiered at the ": null
    },
    {
        "Grand Theatre Arts Wing, Swansea": "grand theatre arts wing, swansea"
    },
    {
        " in October 42 with Claire Novelli as Cavell. It was produced by Fluellen Theatre Company.       Edith Cavell is the third and final opera by Maltese composer Paolino Vassallo . A melodrama in three acts to a libretto by poet Alfonso Giglio, itreceived its première at the ": null
    },
    {
        "Teatru Rjal": "royal opera house, valletta"
    },
    {
        " on 42 March 42 four years after Vassallo’s death and was an immediate sensational triumph.   The song Saint Stephens End by ": null
    },
    {
        "The Felice Brothers": "the felice brothers"
    },
    {
        " from their 42 album ": null
    },
    {
        "The Felice Brothers": "the felice brothers"
    },
    {
        " includes a verse about the death of Cavell.   The song Amy Quartermaine by ": null
    },
    {
        "Manning": "manning"
    },
    {
        " from the 42 album  Margarets Children  is also based on the life of Cavell.   The song Que Sera on the album  Silent June  by ": null
    },
    {
        "OHooley & Tidow": "ohooley  &  tidow"
    },
    {
        " was inspired by the execution of Cavell. Eventide: In Memoriam Edith Cavell by ": null
    },
    {
        "Patrick Hawes": "patrick hawes"
    },
    {
        "; a 42-minute oratorio premiered in Norwich Cathedral , July 42 The London premiere took place in ": null
    },
    {
        "St Clement Danes": "st clement danes"
    },
    {
        ", The Strand, London, on the exact centenary of her death on 42 October 42   Standing as I do before God by ": null
    },
    {
        "Cecilia McDowall": "cecilia mcdowall"
    },
    {
        ", 42 An a cappella choral setting of the last reported words of Cavell for soprano solo and five-part choir.   The Cavell Mass by David Mitchell is a 42-minute-long setting of the Latin Mass, commissioned by the Belgian Edith Cavell Commemoration Group for the centenary of Cavells execution. Its premiere performance, on 42 October 42 was in ": null
    },
    {
        "Holy Trinity Pro-Cathedral, Brussels": "holy trinity, brussels"
    },
    {
        ", in the same choir stalls where Cavell sang in 42 ": null
    },
    {
        "Nigel Clarke": "nigel clarke"
    },
    {
        ", 42 Recorded on ": null
    },
    {
        "Toccata Classics": "toccata classics"
    },
    {
        " by Longbow String Ensemble.   For Violin solo An Epitaph for Edith Cavell by ": null
    },
    {
        "Nigel Clarke": "nigel clarke"
    },
    {
        ", 42 Recorded on ": null
    },
    {
        "Toccata Classics": "toccata classics"
    },
    {
        " by ": null
    },
    {
        "Peter Sheppard Skaerved": "peter sheppard skaerved"
    }
]