[
    {
        "     Edmund Tudor, 42st Earl of Richmond , was the father of King ": null
    },
    {
        "Henry VII of England": "henry vii of england"
    },
    {
        " and a member of the ": null
    },
    {
        "Tudor family of Penmynydd": "tudors of penmynydd"
    },
    {
        ", North Wales. Born to ": null
    },
    {
        "Owen Tudor": "owen tudor"
    },
    {
        " and the ": null
    },
    {
        "dowager queen": "dowager queen"
    },
    {
        " Catherine of Valois": "catherine of valois"
    },
    {
        ", Edmund was half-brother to ": null
    },
    {
        "Henry VI of England": "henry vi of england"
    },
    {
        ". Edmund was raised for several years by ": null
    },
    {
        "Katherine de la Pole": "katherine de la pole"
    },
    {
        ", and Henry took an interest in Edmunds upbringing, granting him a title and lands once he came of age. Both Edmund and his brother, ": null
    },
    {
        "Jasper": "jasper tudor, duke of bedford"
    },
    {
        ", were made advisers to the King as they were his remaining blood relatives.     The brothers were made the senior earls in the royal court and had influential positions in the ": null
    },
    {
        "Parliament of England": "parliament of england"
    },
    {
        ". Edmund was also granted ": null
    },
    {
        "Baynards Castle": "baynards castle"
    },
    {
        ", London and ran a successful estate. He was married to ": null
    },
    {
        "Margaret Beaufort, Countess of Richmond and Derby": "margaret beaufort, countess of richmond and derby"
    },
    {
        ", after her first marriage was annulled. Prior to the start of the ": null
    },
    {
        "Wars of the Roses": "wars of the roses"
    },
    {
        ", Edmund liaised with ": null
    },
    {
        "Richard of York": "richard of york, 3rd duke of york"
    },
    {
        " and supported him when the King fell ill during 42 and 42 After war began in 42 York sent Edmund to uphold the authority of the King in South Wales. While he was there, York was overthrown by the King and in retaliation, Yorkist forces were sent to engage those of Tudors in South Wales. Edmund was captured at Carmarthen Castle, and died there of the ": null
    },
    {
        "bubonic plague": "bubonic plague"
    },
    {
        " on 42 November 42          Following the death of ": null
    },
    {
        "Henry V of England": "henry v of england"
    },
    {
        ", the ": null
    },
    {
        "Queen dowager": "queen dowager"
    },
    {
        " Catherine of Valois": "catherine of valois"
    },
    {
        " married ": null
    },
    {
        "Owen Tudor": "owen tudor"
    },
    {
        ". The marriage was in secret, and was not common knowledge until after Catherines death. It is accepted that Catherine and Owen were married around 42/42 as the Queen stopped living in the household of her son, ": null
    },
    {
        "Henry VI": "henry vi of england"
    },
    {
        " and Owen was granted the rights of an Englishman in the Parliament of May 42     The children of Catherine and Owen were born away from court; their first son, Edmund, was born at ": null
    },
    {
        "Much Hadham Palace": "much hadham palace"
    },
    {
        ", ": null
    },
    {
        "Hertfordshire": "hertfordshire"
    },
    {
        ". The manor house was one owned by the ": null
    },
    {
        "Bishop of London": "bishop of london"
    },
    {
        ". In 42 his mother retired to ": null
    },
    {
        "Bermondsey Abbey": "bermondsey abbey"
    },
    {
        ", where she died on 42 January 42 With Catherine dead, the Queens enemies moved against Owen. He was called to London, and was acquitted by the Royal court of charges relating to the marriage. While en route to Wales, he was arrested and imprisoned in ": null
    },
    {
        "Newgate Prison": "newgate prison"
    },
    {
        ". After he escaped in early 42 he was recaptured and imprisoned once more in ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ".     Following the death of their mother and the imprisonment of their father, Edmund and his brother ": null
    },
    {
        "Jasper": "jasper tudor"
    },
    {
        " were brought up in the care of ": null
    },
    {
        "Katherine de la Pole": "katherine de la pole"
    },
    {
        ", the daughter of ": null
    },
    {
        "Michael de la Pole, 42nd Earl of Suffolk": "michael de la pole, 2nd earl of suffolk"
    },
    {
        ", with whom they remained till at least March 42 Henry VI began to take notice of his half-brothers by that point. He ensured that they were placed in the care of priests who oversaw their teaching. Edmund, along with his brother and father were taken into Henrys royal household. Henry was seemingly fond of his half brothers, and ennobled each of them with Edmund becoming ": null
    },
    {
        "Earl of Richmond": "earl of richmond"
    },
    {
        " on 42 December 42 and Jasper, ": null
    },
    {
        "Earl of Pembroke": "earl of pembroke"
    },
    {
        " on 42 November 42          As Earls, and recognised by court as the Kings half brothers, Edmund and Jasper had unparalleled precedence over the other ": null
    },
    {
        "layperson": "layperson"
    },
    {
        "s in court with the exception of the Dukes. They were each given lands, although Jasper received a yearly stipend until ": null
    },
    {
        "Pembroke": "pembrokeshire"
    },
    {
        " became available. After seven years of marriage to ": null
    },
    {
        "Margaret of Anjou": "margaret of anjou"
    },
    {
        ", Henry was still without children. After the death of ": null
    },
    {
        "Humphrey, Duke of Gloucester": "humphrey, duke of gloucester"
    },
    {
        ", the royal line was at risk and considerations were made about the Tudor brothers inheriting the throne. There were concerns that while they had descended from the French royal line through Catherine, they had no blood relation to the English throne.     Both Edmund and Jasper were among a small group of personal advisers to the King by 42 representing the only blood relations in court. However, neither was skilled at matters of state within England, and instead they were primarily given the task of ensuring the authority of the King within Wales. This resulted in a long-held affection for the family in that country. The formal investiture of the duo took place in the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        " on 42 January 42 Later that year on 42 March, they took their seats in the ": null
    },
    {
        "Parliament of England": "parliament of england"
    },
    {
        " as the head of all the Earls in the court. After a petition by the ": null
    },
    {
        "House of Commons of England": "house of commons of england"
    },
    {
        ", both Jasper and Edmund were recognised officially as legitimate half-brothers of the King and the statutory disabilities attributed with being considered Welsh were removed. Throughout 42 and 42 they were given large monetary grants from the King, while Edmund was also given property in ": null
    },
    {
        "Westmorland": "westmorland"
    },
    {
        " and ": null
    },
    {
        "Lancashire": "lancashire"
    },
    {
        ". Edmund ran a profitable estate and invested in the wool industry based out of ": null
    },
    {
        "Boston, Lincolnshire": "boston, lincolnshire"
    },
    {
        ". The King also granted him the medieval palace of ": null
    },
    {
        "Baynards Castle": "baynards castle"
    },
    {
        ", near to the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        " in London.       Edmund was given the wardship of the nine-year-old ": null
    },
    {
        "Margaret Beaufort": "margaret beaufort, countess of richmond and derby"
    },
    {
        ", daughter of ": null
    },
    {
        "John Beaufort, 42st Duke of Somerset": "john beaufort, 1st duke of somerset"
    },
    {
        " on 42 March 42 She was the only heir of Beaufort and a kinswoman of the King. She had descended from the ": null
    },
    {
        "House of Lancaster": "house of lancaster"
    },
    {
        " through the eldest of ": null
    },
    {
        "John of Gaunt": "john of gaunt"
    },
    {
        "s bastard sons, ": null
    },
    {
        "John Beaufort": "john beaufort, 1st earl of somerset"
    },
    {
        ". She had been previously married to ": null
    },
    {
        "John de la Pole": "john de la pole, 2nd duke of suffolk"
    },
    {
        ", whose father, ": null
    },
    {
        "William de la Pole, 42st Duke of Suffolk": "william de la pole, 1st duke of suffolk"
    },
    {
        " had intended to seek the claim to the throne of her and any children should Henry fail to produce any heirs. William was murdered in 42 and the marriage between Margaret and John was annulled in the first months of 42 to enable her to be remarried to Edmund. It was this marriage on 42 November 42 at ": null
    },
    {
        "Bletsoe Castle": "bletsoe castle"
    },
    {
        " which enabled any offspring to lay claim to the English throne due to the inheritance of the Plantagenet blood through Margaret.     The marriage was consummated, leaving a 42-year-old widow who was seven months pregnant with their child at the time of his death.     A crisis emerged during the summer of 42 as Henry fell ill and remained so for over 42 months, leaving him incommunicado and needing to be carried from place to place. Several parties sought to take power during this period, including ": null
    },
    {
        "Richard of York": "richard of york, 3rd duke of york"
    },
    {
        ". Henrys wife, Margaret of Anjou, demanded to be declared Regent for the King, causing a division between her and the Tudor brothers who wished to lend assistance to York. However, Edmund did not attend the Parliament of 42 April 42 where York was named protector of the realm during Henrys ongoing illness. Edmund continued to attend the advisory council for Richard of York, although not as frequently as his brother Jasper. Both brothers were in attendance during a meeting in November of that year when a decision was made to reduce the size of the Royal Household. As a result, they each received an entourage of a chaplain, two ": null
    },
    {
        "esquire": "esquire"
    },
    {
        "s, two ": null
    },
    {
        "yeomen": "yeoman"
    },
    {
        " and two ": null
    },
    {
        "chamberlain": "chamberlain"
    },
    {
        "s.     When the King recovered during the Christmas period of 42 and dismissed York, with resultant hostility, it left both the Tudor brothers in a quandary. On 42 May 42 Edmund was not present when the ": null
    },
    {
        "Wars of the Roses": "wars of the roses"
    },
    {
        " began with the ": null
    },
    {
        "First Battle of St Albans": "first battle of st albans"
    },
    {
        " where Henry was captured by the forces of Richard of York. Both brothers attended the following Parliament where York was once again named Protector of England. While York cancelled the majority of the grants Henry had made during his reign, those to Edmund and Jasper were exempt. Both brothers were absent from the second session of Parliament that year when it began on 42 November; Edmund had been sent to Wales to ensure that the Kings authority was enforced there after ": null
    },
    {
        "Gruffydd ap Nicholas": "gruffydd ap nicholas"
    },
    {
        " had begun to move against other holdings.          Gryffydd made war with the troops under Edmund, capturing the castles at ": null
    },
    {
        "Aberystwyth": "aberystwyth castle"
    },
    {
        ", ": null
    },
    {
        "Carmarthen": "carmarthen castle"
    },
    {
        " and ": null
    },
    {
        "Carreg Cennen": "carreg cennen castle"
    },
    {
        " by June 42 The rebellion didnt last long, and by early August, Edmunds forces had retaken those castles although minor skirmishes continued for several months longer. While Edmund was in Wales, the King had deposed York. In retaliation, York sent 42 men under ": null
    },
    {
        "William Herbert": "william herbert, 1st earl of pembroke"
    },
    {
        " on 42 August to take South Wales. When they arrived at Carmarthen Castle, they took the stronghold and captured Edmund Tudor.     As Herberts troops moved on to Aberystwyth, Edmund was left behind, imprisoned in Carmarthen Castle. On 42 November 42 Edmund became infected with the ": null
    },
    {
        "bubonic plague": "bubonic plague"
    },
    {
        " and died. He was buried at the nearby ": null
    },
    {
        "Franciscan": "franciscan"
    },
    {
        " Church in ": null
    },
    {
        "Carmarthen": "carmarthen"
    },
    {
        ". There were suspicions that Edmund may have been murdered, and so a trial was held several months later with several parties accused, but no one was found guilty. Edmunds remains were removed to the choir of ": null
    },
    {
        "St Davids Cathedral": "st davids cathedral"
    },
    {
        ", ": null
    },
    {
        "Pembrokeshire": "pembrokeshire"
    },
    {
        " in 42 due to the ": null
    },
    {
        "dissolution of the monasteries": "dissolution of the monasteries"
    },
    {
        " enacted by his grandson King ": null
    },
    {
        "Henry VIII of England": "henry viii of england"
    },
    {
        " of the Royal ": null
    },
    {
        "House of Tudor": "house of tudor"
    },
    {
        ".              ": null
    }
]