[
    {
        "         Sir Edmund Toby Barton,   was an Australian politician and judge who served as the first ": null
    },
    {
        "Prime Minister of Australia": "prime minister of australia"
    },
    {
        ", in office from 42 to 42 He resigned to become a founding member of the ": null
    },
    {
        "High Court of Australia": "high court of australia"
    },
    {
        ", where he served until his death.     Barton was an early supporter of the ": null
    },
    {
        "federation of the Australian colonies": "federation of australia"
    },
    {
        ", and after the retirement of ": null
    },
    {
        "Henry Parkes": "henry parkes"
    },
    {
        " came to be seen as the leader of the federation movement in New South Wales. He was a delegate to the ": null
    },
    {
        "constitutional conventions": "constitutional convention"
    },
    {
        ", playing a key role in the drafting of ": null
    },
    {
        "a national constitution": "constitution of australia"
    },
    {
        ", and was one of the lead campaigners for federation in ": null
    },
    {
        "the subsequent referendums": "australian constitutional referendums, 1898–1900"
    },
    {
        ". In late 42 despite the initial ": null
    },
    {
        "Hopetoun Blunder": "hopetoun blunder"
    },
    {
        " , Barton was commissioned to form a ": null
    },
    {
        "caretaker government": "caretaker government"
    },
    {
        " as Australias first prime minister. His term began on 42 January 42 the date on which federation occurred.     At the ": null
    },
    {
        "first federal elections": "1901 australian federal election"
    },
    {
        " in March 42 Barton and the Protectionists won the most seats, but were well short of a majority. He was able to continue on as a prime minister by forming an alliance with the fledgling ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        ", which held the balance of power. The ": null
    },
    {
        "Barton Government": "barton government"
    },
    {
        " established a number of new national institutions, including the ": null
    },
    {
        "Australian Defence Force": "australian defence force"
    },
    {
        " and the ": null
    },
    {
        "Commonwealth Public Service": "commonwealth public service"
    },
    {
        ". It introduced ": null
    },
    {
        "nation-wide womens suffrage": "womens suffrage in australia"
    },
    {
        ", and laid the foundations of the ": null
    },
    {
        "White Australia policy": "white australia policy"
    },
    {
        " with the  Immigration Restriction Act 42 .     Barton left politics in 42 to become one of the three founding members of the High Court, which his government had created. He was succeeded as prime minister by ": null
    },
    {
        "Alfred Deakin": "alfred deakin"
    },
    {
        ". On the court, Barton was able to shape the judicial interpretation of the constitution he had helped write. Although he served 42 years on the High Court and less than three as prime minister, he is chiefly remembered for his political career.       Barton was born on 42 January 42 in ": null
    },
    {
        "Glebe, Sydney, New South Wales": "glebe, new south wales"
    },
    {
        ". He was the eleventh of twelve children born to Mary Louisa and William Barton. He had seven sisters and four brothers, including the writer ": null
    },
    {
        "George Burnett Barton": "george burnett barton"
    },
    {
        ". Three of his siblings died during his childhood. His given name had not previously been used in the family, and may have been in honour of the recently deceased explorer ": null
    },
    {
        "Edmund Kennedy": "edmund kennedy"
    },
    {
        ". Bartons parents were both born in London, England, although his fathers family was originally from ": null
    },
    {
        "Devon": "devon"
    },
    {
        ". They arrived in the Colony of New South Wales in 42 and all but two of their children were born in Australia. William Barton worked variously as an accountant, bazaar proprietor, stockbroker, and real estate agent. His business ventures were not always successful, and he went bankrupt on one occasion.       Barton spent his early years in Glebe, but in 42 the family moved into the inner city, living on Cumberland Street in ": null
    },
    {
        "The Rocks": "the rocks, sydney"
    },
    {
        ". He had a relatively comfortable upbringing, although his father faced financial difficulties on a number of occasions. To support the family during those periods, his mother ran a boarding school for girls. His parents were both highly literate, and his mother in particular provided much of the direction and encouragement for Edmunds impressive academic achievement . Barton began his formal education at what is now the ": null
    },
    {
        "Fort Street Public School": "fort street public school"
    },
    {
        ". He later attended ": null
    },
    {
        "Sydney Grammar School": "sydney grammar school"
    },
    {
        ", possibly as one of the first students after the schools opening in 42 One of his close friends in his youth was ": null
    },
    {
        "Richard OConnor": "richard oconnor"
    },
    {
        ", who would eventually join him on the High Court. Barton was the ": null
    },
    {
        "dux": "duxeducation"
    },
    {
        " and school captain at Sydney Grammar in 42 and 42 He ": null
    },
    {
        "matriculated": "matriculation"
    },
    {
        " to the ": null
    },
    {
        "University of Sydney": "university of sydney"
    },
    {
        " in 42 aged 42 and was awarded a special prize by the university senate.        At university, Barton specialised in ": null
    },
    {
        "classics": "classics"
    },
    {
        " but also studied English literature, mathematics, physics, and French. He became fluent in Ancient Greek and Latin, and retained a command of both later in life. A new professor, ": null
    },
    {
        "Charles Badham": "charles badham"
    },
    {
        ", arrived in 42 and was a profound influence . Barton won scholarships in his second and third years. He graduated ": null
    },
    {
        "Bachelor of Arts": "bachelor of arts"
    },
    {
        " in 42 with first-class honours, and was awarded the equivalent of the ": null
    },
    {
        "University Medal": "university medal"
    },
    {
        " as well as a prize of £42 He proceeded to ": null
    },
    {
        "Master of Arts": "master of arts"
    },
    {
        " by examination in 42       Barton was a member of the ": null
    },
    {
        "Sydney University Cricket Club": "sydney university cricket club"
    },
    {
        " and a founding member of the ": null
    },
    {
        "Sydney Rowing Club": "sydney rowing club"
    },
    {
        ".  On a cricketing trip to ": null
    },
    {
        "Newcastle": "newcastle, new south wales"
    },
    {
        " in 42 he met ": null
    },
    {
        "Jane Mason Ross": "jane barton"
    },
    {
        ", whom he married in 42       In 42 Barton ": null
    },
    {
        "umpired": "umpire"
    },
    {
        " a cricket match at ": null
    },
    {
        "Sydney Cricket Ground": "sydney cricket ground"
    },
    {
        " between ": null
    },
    {
        "New South Wales": "new south wales"
    },
    {
        " and an English touring side captained by ": null
    },
    {
        "Lord Harris": "george harris, 4th baron harris"
    },
    {
        ". After a controversial decision by Bartons colleague ": null
    },
    {
        "George Coulthard": "george coulthard"
    },
    {
        " against the home side, the crowd spilled onto the pitch and assaulted some of the English players, leading to ": null
    },
    {
        "international crickets first riot": "sydney riot of 1879"
    },
    {
        ". The publicity that attended the young Bartons presence of mind in defusing that situation reputedly helped him take his first step towards becoming Australias first prime minister, winning a state lower house seat later that year.           In 42 Barton stood for the ": null
    },
    {
        "Legislative Assembly": "new south wales legislative assembly"
    },
    {
        " in the poll of the graduates of the ": null
    },
    {
        "University of Sydney": "electoral district of university of sydney"
    },
    {
        " , but was beaten by ": null
    },
    {
        "William Charles Windeyer": "william charles windeyer"
    },
    {
        " 42 votes to 42  He was defeated again for the same seat in 42 but won in August 42 When it was abolished in 42 he became the member for ": null
    },
    {
        "Wellington": "electoral district of wellington"
    },
    {
        ", from November 42 to 42 and ": null
    },
    {
        "East Sydney": "electoral district of east sydney"
    },
    {
        ", from November 42 to January 42 At this stage he considered it almost unnecessary to point out his support for free trade.     In 42 he became ": null
    },
    {
        "Speaker of the New South Wales Legislative Assembly": "speaker of the new south wales legislative assembly"
    },
    {
        ". He was aged only 42 and was the youngest person to have been chosen presiding officer of any Australian legislative chamber. In 42 he was elected President of the ": null
    },
    {
        "University of Sydney Union": "university of sydney union"
    },
    {
        ". In 42 he was appointed to the ": null
    },
    {
        "Legislative Council": "new south wales legislative council"
    },
    {
        " at the instigation of Sir ": null
    },
    {
        "Henry Parkes": "henry parkes"
    },
    {
        ".  In January 42 he agreed to being appointed ": null
    },
    {
        "Attorney General of New South Wales": "attorney general of new south wales"
    },
    {
        " in ": null
    },
    {
        "George Dibbs": "george dibbs"
    },
    {
        "s ": null
    },
    {
        "Protectionist": "protectionist party"
    },
    {
        " government, despite his previous support for free trade. This government lasted only until March, when Parkes formed a government again.            Barton was an early supporter of ": null
    },
    {
        "federation": "australian federation"
    },
    {
        ", which became a serious political agenda after ": null
    },
    {
        "Henry Parkes": "henry parkes"
    },
    {
        " Tenterfield Oration": "tenterfield oration"
    },
    {
        ", and was a delegate to the March 42 ": null
    },
    {
        "National Australasian Convention": "constitutional convention 1891 convention"
    },
    {
        ". At the convention he made clear his support for the principle that trade and intercourse  ... shall be absolutely free in a federal Australia. He also advocated that not just the lower house but also the upper house should be representative and that appeals to the ": null
    },
    {
        "Privy Council": "judicial committee of the privy council"
    },
    {
        " should be abolished. He also took part in producing a draft constitution, which was substantially similar to the ": null
    },
    {
        "Australian Constitution": "constitution of australia"
    },
    {
        " enacted in 42     Nevertheless, the protectionists were lukewarm supporters of federation and in June 42 Barton resigned from the Council and stood for election to East Sydney and announced that so long as Protection meant a Ministry of enemies to Federation, they would get no vote from him . He topped the poll and subsequently voted with Parkes, but refused to take a position in his minority government. After the ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        " withdrew support and the government fell in October 42 Parkes persuaded him to take over the leadership of the Federal movement in New South Wales.       Dibbs formed a ": null
    },
    {
        "Protectionist": "protectionist party"
    },
    {
        " government and Barton agreed to be Attorney-General with the right of carry out private practice as a lawyer. His agreement was based on Dibbs agreeing to support federal resolutions in the coming parliamentary session. His attempt to draft the federal resolutions was delayed by a period as acting ": null
    },
    {
        "Premier": "premier of new south wales"
    },
    {
        ", when he had to deal with the ": null
    },
    {
        "42 Broken Hill miners strike": "1892 broken hill miners strike"
    },
    {
        ", and his carriage of a complex electoral reform bill. He introduced the federal resolutions into the House on 42 November 42 but was unable to get them considered in committee.     Meanwhile, he began a campaign to spread support for federation to the people with meetings in ": null
    },
    {
        "Corowa": "corowa, new south wales"
    },
    {
        " and ": null
    },
    {
        "Albury": "albury, new south wales"
    },
    {
        " in December 42 Although he finally managed to get the federal resolutions considered in committee in October 42 he then could not get them listed for debate by the House. In December, he and ": null
    },
    {
        "Richard OConnor": "richard oconnor"
    },
    {
        ", the Minister for Justice, were questioned about their agreement to act as private lawyers against the government in Proudfoot v. the Railway Commissioners. While Barton resigned the brief, he lost a motion on the right of ministers to act in their professional capacity as lawyers in actions against the government, and immediately resigned as Attorney-General.     In July 42 Barton stood for re-election for ": null
    },
    {
        "Randwick": "electoral district of randwick"
    },
    {
        " and lost. He did not stand for election in the 42 elections because he needed to support his large family during a period when parliamentarians were not paid. However, he continued to campaign for federation and during the period between January 42 to February 42 Barton addressed nearly 42 meetings in New South Wales,  including in the Sydney suburb of ": null
    },
    {
        "Ashfield": "ashfield, new south wales"
    },
    {
        " where he declared that For the first time in history, we have a nation for a continent and a continent for a nation . By March 42 he was considered the acknowledged leader of the federal movement in all Australia .          In 42 Barton topped the poll of the delegates elected from New South Wales to the ": null
    },
    {
        "Constitutional Convention": "constitutional convention"
    },
    {
        ", which developed a constitution for the proposed federation. Although ": null
    },
    {
        "Sir Samuel Griffith": "samuel griffith"
    },
    {
        " wrote most of the text of the Constitution, Barton was the political leader who carried it through the Convention.     In May 42 Barton was appointed for the second time to the Legislative Council on Reids recommendations to take charge of the federation bill in the Upper House. This gave Reids Attorney-General, ": null
    },
    {
        "John Henry Want": "john henry want"
    },
    {
        ", a free hand to oppose the bill. In September 42 the convention met in Sydney to consider 42 proposed amendments from the colonies. It finalised its draft constitution in March 42 and Barton went back to New South Wales to lead the campaign for a yes vote in the June referendum. Although it gained majority support, it achieved only 42; 42 was the minimum number for it to pass.     In July 42 Barton resigned from the Upper House to stand against Reid for election to the Legislative Assembly, but narrowly lost. In September, he won a by-election for ": null
    },
    {
        "Hastings and Macleay": "electoral district of hastings and macleay"
    },
    {
        " and was immediately elected leader of the opposition, which consisted of a mixture of pro-federation and anti-federation protectionists. In January 42 Reid gained significant concessions from the other states and he joined Barton in campaigning for the second referendum in June 42 with Barton campaigning all over the state. It passed 42 votes to 42.     In August 42 when it became clear that the ": null
    },
    {
        "Labour Party": "australian labor party"
    },
    {
        " could be manoeuvred into bringing down the Reid Government, Barton resigned as leader of the opposition, as he was unacceptable to Labour, and ": null
    },
    {
        "William Lyne": "william lyne"
    },
    {
        " took his place. He refused an offer to become Attorney-General again. He resigned from Parliament in February 42 so that he could travel to London with ": null
    },
    {
        "Alfred Deakin": "alfred deakin"
    },
    {
        " and ": null
    },
    {
        "Charles Kingston": "charles kingston"
    },
    {
        " to explain the federation bill to the ": null
    },
    {
        "British Government": "government of the united kingdom"
    },
    {
        ". Around the same time on 42 January 42 Barton published a 42-page United Australia magazine to disseminate an informative narrative for the propositions of a future Federal Government that he hoped to lead. Julian Fitzgerald On Message: Political Communications of Australian Prime Ministers 42 – 42 Clareville Press 42 p 42 The British Government was adamant in its opposition to the abolition of appeals to the Privy Council as incorporated in the draft constitution; eventually, Barton agreed that constitutional  matters would be finalised in the ": null
    },
    {
        "High Court": "high court of australia"
    },
    {
        ", but other matters could be appealed to the Privy Council. Edmund served as a Justice of the High Court for 42 years.                    Barton was appointed prime minister on 42 January 42 the day on which the new federal constitution came into effect. He and various other dignitaries were driven through the streets of Sydney in a procession watched by thousands of onlookers, beginning in ": null
    },
    {
        "The Domain": "the domain, sydney"
    },
    {
        " and ending at ": null
    },
    {
        "Centennial Park": "centennial parklands"
    },
    {
        ". A swearing-in ceremony for the new government was held at the purpose-built ": null
    },
    {
        "Federation Pavilion": "federation pavilion"
    },
    {
        ".  The main focus was on ": null
    },
    {
        "Lord Hopetoun": "john hope, 7th earl of hopetoun"
    },
    {
        ", Australias first ": null
    },
    {
        "governor-general": "governor-general of australia"
    },
    {
        ", who swore three separate oaths and read a message from ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        ". Barton and his ministry only took oaths of allegiance, and were not formally sworn in to the ": null
    },
    {
        "Federal Executive Council": "federal executive council"
    },
    {
        " until later in the afternoon. The events of the day were captured on film and distributed under the title  Inauguration of the Commonwealth , although the visibility of the leading participants is poor. The film has been described as Australias first feature-length documentary.      Barton had only been commissioned to form a government one week before he became prime minister, due to what became known as the ": null
    },
    {
        "Hopetoun Blunder": "hopetoun blunder"
    },
    {
        " . The new governor-general Lord Hopetoun arrived in Australia on 42 December 42 He was tasked by the ": null
    },
    {
        "Colonial Office": "colonial office"
    },
    {
        " with selecting someone to form a caretaker government prior to the first federal election; this individual would be Australias first prime minister. It was widely assumed that Barton would be offered the position, and he had begun making preparations for the role, including a draft platform for the first federal elections. On 42 December, however, Hopetoun commissioned ": null
    },
    {
        "William Lyne": "william lyne"
    },
    {
        " to form a government. His reasons for doing so have been debated, but his decision was widely regarded as a mistake. Lyne, the premier of New South Wales, had actively campaigned against federation, and the leading politicians in each of the other colonies refused to serve under him. On 42 December, he informed Hopetoun that he was unable to form a government and advised him to send for Barton. As a result, the composition of Australias first cabinet was not formally announced until 42 December, two days before it was sworn in.            Bartons government consisted of himself as Prime Minister and Minister for External Affairs, ": null
    },
    {
        "Alfred Deakin": "alfred deakin"
    },
    {
        " as Attorney-General, Sir William Lyne as Minister for Home Affairs, Sir ": null
    },
    {
        "George Turner": "george turner"
    },
    {
        " as Treasurer, ": null
    },
    {
        "Charles Kingston": "charles kingston"
    },
    {
        " as Minister for Trade and Customs, Sir ": null
    },
    {
        "James Dickson": "james robert dickson"
    },
    {
        " as Minister for Defence, and Sir ": null
    },
    {
        "John Forrest": "john forrest"
    },
    {
        " as Postmaster-General. ": null
    },
    {
        "Richard OConnor": "richard oconnor"
    },
    {
        " was made Vice-President of the Executive Council and ": null
    },
    {
        "Elliott Lewis": "elliott lewis"
    },
    {
        " was appointed Minister without Portfolio. Only ten days into the life of the government, Sir James Dickson died suddenly; he was replaced on 42 January as Minister for Defence by John Forrest, and ": null
    },
    {
        "James Drake": "james drake"
    },
    {
        " was brought into the ministry as Postmaster-General on 42 February.     The main task of ": null
    },
    {
        "Bartons caretaker ministry": "barton ministry"
    },
    {
        " was to organise the conduct of the ": null
    },
    {
        "first federal elections": "1901 australian federal election"
    },
    {
        ", which were held in March 42 Barton was elected unopposed to the seat of ": null
    },
    {
        "Hunter": "division of hunter"
    },
    {
        " in the new Parliament and his Protectionist Party won enough seats to form a government with the support of the ": null
    },
    {
        "Labour Party": "australian labor party"
    },
    {
        ". All his ministers were elected, except for Elliott Lewis, who did not stand for election and was replaced by Sir ": null
    },
    {
        "Philip Fysh": "philip fysh"
    },
    {
        ".       In April 42 Barton announced that the government would sponsor ": null
    },
    {
        "a competition": "1901 federal flag design competition"
    },
    {
        " to design a new national flag for Australia. The winning design was the basis for the current Australian national flag, although Barton personally favoured the existing ": null
    },
    {
        "Australian Federation Flag": "australian federation flag"
    },
    {
        " that had been popular in New South Wales for many years. As it was primarily intended to be used in shipping, the design had to be submitted to the ": null
    },
    {
        "British Admiralty": "british admiralty"
    },
    {
        " for approval and was not officially adopted until 42      An early piece of legislation of the Barton government was the ": null
    },
    {
        "Immigration Restriction Act 42": "immigration restriction act 1901"
    },
    {
        ", which put the ": null
    },
    {
        "White Australia policy": "white australia policy"
    },
    {
        " into law. The Labour Party required legislation to limit immigration from Asia as part of its agreement to support the government, but Barton had promised the introduction of the White Australia Policy in his election campaign. Barton stated, The doctrine of the equality of man was never intended to apply to the equality of the Englishman and the Chinaman . One notable reform was the introduction of womens suffrage for federal elections in 42      Barton was a moderate conservative, and advanced liberals in his party disliked his relaxed attitude to political life. A large, handsome, jovial man, he was fond of long dinners and good wine and was given the nickname Toby Tosspot by  The Bulletin .        For much of 42 Barton was in England for the coronation of King ": null
    },
    {
        "Edward VII": "edward vii of the united kingdom"
    },
    {
        ", which was postponed from June to August, delaying Bartons return. Accompanying him on this trip was Sir ": null
    },
    {
        "John Forrest": "john forrest"
    },
    {
        ", Minister of Defence, and the trip was also used to negotiate the replacement of the naval agreements between the Australian colonies and the United Kingdom  by an agreement between the Commonwealth and the United Kingdom at the ": null
    },
    {
        "42 Colonial Conference": "1902 colonial conference"
    },
    {
        ". Deakin disliked this arrangement and discontinued it, moving for a substantial expansion of Australias ": null
    },
    {
        "own navy": "royal australian navy"
    },
    {
        " in 42  On their way home from the United Kingdom, Barton and Forrest visited Canada, including Toronto, Ottawa , and the Pacific Coast.         On 42 September 42 Barton resigned as prime minister to become one of the founding justices of the ": null
    },
    {
        "High Court of Australia": "high court of australia"
    },
    {
        ". Speculation about his political future had been rife for several months, particularly after the  Judiciary Act 42  was passed in August. There were several factors at play in his decision to retire from politics. Some within his own party thought that he lacked the energy and commitment to continue as the leader of the government.  Barton had also suffered from bouts of ill health, including a fainting spell in his office earlier in the year. He was advised by his doctor to quit active politics. Finally, he had a history of financial difficulties and appreciated the security that a lifetime appointment would bring. The appointment of the new judges was made by the governor-general on the advice of cabinet, many of whom had ambitions of their own and encouraged Barton to accept the post. His appointment was largely uncontroversial, given his role in drafting the constitution, experience as a barrister, and acceptance of a ": null
    },
    {
        "puisne judge": "puisne judge"
    },
    {
        "ship rather than the position of ": null
    },
    {
        "chief justice": "chief justice of australia"
    },
    {
        ".           Barton was one of only eight justices of the High Court to have served in the ": null
    },
    {
        "Parliament of Australia": "parliament of australia"
    },
    {
        " prior to his appointment to the Court; the others were ": null
    },
    {
        "Richard OConnor": "richard oconnor"
    },
    {
        ", ": null
    },
    {
        "Isaac Isaacs": "isaac isaacs"
    },
    {
        ", ": null
    },
    {
        "H. B. Higgins": "h. b. higgins"
    },
    {
        ", ": null
    },
    {
        "Edward McTiernan": "edward mctiernan"
    },
    {
        ", ": null
    },
    {
        "John Latham": "john latham"
    },
    {
        ", ": null
    },
    {
        "Garfield Barwick": "garfield barwick"
    },
    {
        ", and ": null
    },
    {
        "Lionel Murphy": "lionel murphy"
    },
    {
        ". Barton was also one of six justices to have served in the ": null
    },
    {
        "Parliament of New South Wales": "parliament of new south wales"
    },
    {
        " along with OConnor, ": null
    },
    {
        "Albert Piddington": "albert piddington"
    },
    {
        ", ": null
    },
    {
        "Adrian Knox": "adrian knox"
    },
    {
        ", McTiernan, and ": null
    },
    {
        "H. V. Evatt": "h. v. evatt"
    },
    {
        ".     On the bench, Barton was considered a good and scrupulously impartial judge and adopted the same position of moderate conservatism that he had taken in politics. Along with colleagues ": null
    },
    {
        "Griffith": "samuel griffith"
    },
    {
        " and ": null
    },
    {
        "OConnor": "richard oconnor"
    },
    {
        ", he attempted to preserve the autonomy of the States and developed a doctrine of implied immunity of instrumentalities , which prevented the States from taxing Commonwealth officers and prevented the Commonwealth from arbitrating industrial disputes in the States railways. They also narrowly interpreted the Federal governments powers in commercial and industrial matters.     After 42 Barton increasingly clashed with ": null
    },
    {
        "Isaac Isaacs": "isaac isaacs"
    },
    {
        " and ": null
    },
    {
        "H. B. Higgins": "h. b. higgins"
    },
    {
        ", the two radicals appointed to the court by Deakin. Like Sir ": null
    },
    {
        "Samuel Griffith": "samuel griffith"
    },
    {
        ", Barton was several times consulted by Governors-General of Australia on the exercise of the ": null
    },
    {
        "reserve powers": "reserve powers"
    },
    {
        ". ": null
    },
    {
        "Donald Markwell": "donald markwell"
    },
    {
        ", Griffith, Barton and the early governor-generals: aspects of Australias constitutional development , Public Law Review, 42 In 42 although ill, he was extremely disappointed to be passed over for the position of Chief Justice on the retirement of Griffith. Markwell, Griffith, Barton and the early governor-generals , ": null
    },
    {
        "Public Law Review": "public law review"
    },
    {
        ", 42       Barton died on 42 January 42 from heart failure at the ": null
    },
    {
        "Hydro Majestic Hotel": "hydro majestic hotel"
    },
    {
        ", ": null
    },
    {
        "Medlow Bath, New South Wales": "medlow bath, new south wales"
    },
    {
        ". He was interred in South Head General Cemetery in the Sydney suburb of ": null
    },
    {
        "Vaucluse": "vaucluse, new south wales"
    },
    {
        " . He was survived by his ": null
    },
    {
        "wife": "jane barton"
    },
    {
        " and six children:     Edmund Alfred , a New South Wales judge   Wilfrid Alexander , first NSW ": null
    },
    {
        "Rhodes Scholar": "rhodes scholarship"
    },
    {
        "   Jean Alice , married Sir David Maughan in 42   Arnold Hubert , married Jane Hungerford in Sydney 42; he later emigrated to Canada   Oswald , medical doctor   Leila Stephanie , married Robert Christopher Churchill Scot Skirving, son of Sydney doctor ": null
    },
    {
        "Robert Scot Skirving": "robert scot skirving"
    },
    {
        ", in London 42        Barton refused knighthoods in 42 42 and 42 but agreed to be appointed a Knight Grand Cross of the ": null
    },
    {
        "Order of St Michael and St George": "order of st michael and st george"
    },
    {
        " in the ": null
    },
    {
        "42 Coronation Honours": "1902 coronation honours"
    },
    {
        " list published on 42 June 42   and was invested by King ": null
    },
    {
        "Edward VII": "edward vii"
    },
    {
        " at ": null
    },
    {
        "Buckingham Palace": "buckingham palace"
    },
    {
        " on 42 August 42   He received an honorary ": null
    },
    {
        "LL.D.": "doctor of laws"
    },
    {
        " from the ": null
    },
    {
        "University of Cambridge": "university of cambridge"
    },
    {
        " in 42 and honorary ": null
    },
    {
        "D.C.L.": "doctor of civil law"
    },
    {
        " from the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        " and LL.D. from the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " while visiting the United Kingdom in the summer of 42  He also received the ": null
    },
    {
        "Freedom of the City": "freedom of the city"
    },
    {
        " of ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        " during a visit to that city on 42 July 42      In 42 the Japanese government conferred the ": null
    },
    {
        "Grand Cordon, Order of the Rising Sun": "order of the rising sun"
    },
    {
        ", and Barton was granted permission to retain and wear the insignia. The honour was presented in acknowledgement of his personal role in resolving a conflict concerning the Commonwealths ": null
    },
    {
        "Pacific Island Labourers Act": "pacific island labourers act 1901"
    },
    {
        " and the Queensland protocol to the ": null
    },
    {
        "Anglo-Japanese Treaty": "anglo-japanese treaty"
    },
    {
        ".     In 42 and again in 42 Barton was honoured on postage stamps bearing his portrait issued by ": null
    },
    {
        "Australia Post": "australia post"
    },
    {
        ".       The ": null
    },
    {
        "Barton Highway": "barton highway"
    },
    {
        " near ": null
    },
    {
        "Canberra": "canberra"
    },
    {
        ", Australia was named after Barton. The ": null
    },
    {
        "Division of Barton": "division of barton"
    },
    {
        " in New South Wales is named after him, as is ": null
    },
    {
        "Barton, Australian Capital Territory": "barton, australian capital territory"
    },
    {
        ", a suburb of ": null
    },
    {
        "Canberra": "canberra"
    },
    {
        " close to Capital Hill which is the location of many government departments and national institutions, and the headquarters of Australias main political parties. The ": null
    },
    {
        "Edmund Barton Building": "edmund barton building"
    },
    {
        " is a government office building in that suburb. The ": null
    },
    {
        "Barton College": "barton college"
    },
    {
        " of ": null
    },
    {
        "Deakin University": "deakin university"
    },
    {
        " is also named after Barton.     Grave_of_Sir_Edmund_Barton_42jpg| Grave of Sir Edmund & Lady Barton   Edmund Barton bust.jpg|Bust of Sir Edmund Barton in the ": null
    },
    {
        "Prime Ministers Avenue": "prime ministers avenue"
    },
    {
        " in the ": null
    },
    {
        "Ballarat Botanical Gardens": "ballarat botanical gardens"
    },
    {
        "   SIR EDMUND BARTON.JPG|Sir Edmund Barton Memorial in ": null
    },
    {
        "Barton, Australian Capital Territory": "barton, australian capital territory"
    }
]