[
    {
        "Eduard Gans was a ": null
    },
    {
        "German": "germany"
    },
    {
        " jurist.       Gans was born in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " to prosperous ": null
    },
    {
        "Jew": "jew"
    },
    {
        "ish parents. He studied law first at the ": null
    },
    {
        "Friedrich Wilhelm University": "humboldt university of berlin"
    },
    {
        ", ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", then at ": null
    },
    {
        "Göttingen": "university of göttingen"
    },
    {
        ", and finally at ": null
    },
    {
        "Heidelberg": "university of heidelberg"
    },
    {
        ", where he attended ": null
    },
    {
        "G. W. F. Hegel": "georg wilhelm friedrich hegel"
    },
    {
        "s lectures, and became thoroughly imbued with the principles of Hegels ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        ". In 42 after taking his doctors degree, he returned to Berlin as a lecturer. In 42 he converted to the ": null
    },
    {
        "Evangelical Church in Prussia": "evangelical church in prussia"
    },
    {
        ", and the following year was appointed extraordinary, and in 42 ordinary, professor in the Berlin University faculty of ": null
    },
    {
        "law": "law"
    },
    {
        ". Before converting, he was a member of the ": null
    },
    {
        "Society for the Culture and Science of the Jews": "wissenschaft des judentumsthe verein für kultur und wissenschaft der juden"
    },
    {
        ", alongside ": null
    },
    {
        "Joel Abraham List": "joel abraham list"
    },
    {
        ", ": null
    },
    {
        "Isaac Marcus Jost": "isaac marcus jost"
    },
    {
        " and ": null
    },
    {
        "Leopold Zunz": "leopold zunz"
    },
    {
        ".     At this period the historical school of ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        " was coming to the front, and Gans, his Hegelian tendencies predisposing him to treat law historically, applied the method to one special branch—the right of succession. His great work, Erbrecht in weltgeschichtlicher Entwicklung , is of permanent value, not only for its extensive survey of facts, but for the admirable manner in which the general theory of the slow evolution of legal principles is presented.     In 42 and again in 42 Gans visited ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        ", and formed an intimate acquaintance with the leaders of literary culture and criticism there. The liberality of his views, especially on political matters, drew upon Gans the displeasure of the ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n government, and his course of lectures on the history of the last fifty years  was prohibited. He died in Berlin.     Other works are a treatise on the fundamental laws of property , a portion of a systematic work on the Roman civil law , and a collection of his miscellaneous writings . Gans edited the Philosophie der Geschichte in Hegels Werke, and contributed a preface. He also wrote Das Erbrecht in Weltgeschichtlicher Entwickelung which was translated into ": null
    },
    {
        "French": "french language"
    }
]