[
    {
        "                          Education is the process of facilitating ": null
    },
    {
        "learning": "learning"
    },
    {
        ", or the acquisition of ": null
    },
    {
        "knowledge": "knowledge"
    },
    {
        ", ": null
    },
    {
        "skill": "skill"
    },
    {
        "s, ": null
    },
    {
        "values": "values"
    },
    {
        ", ": null
    },
    {
        "belief": "belief"
    },
    {
        "s, and ": null
    },
    {
        "habits.": "habit"
    },
    {
        " Educational methods include ": null
    },
    {
        "storytelling": "storytelling"
    },
    {
        ", ": null
    },
    {
        "discussion": "discussion"
    },
    {
        ", ": null
    },
    {
        "teaching": "teaching"
    },
    {
        ", ": null
    },
    {
        "training": "training"
    },
    {
        ", and directed ": null
    },
    {
        "research": "research"
    },
    {
        ". Education frequently takes place under the guidance of educators, however learners may also ": null
    },
    {
        "educate themselves": "autodidacticism"
    },
    {
        ".  Education can take place in ": null
    },
    {
        "formal": "formality"
    },
    {
        " or ": null
    },
    {
        "informal": "informal education"
    },
    {
        " settings and any ": null
    },
    {
        "experience": "experience"
    },
    {
        " that has a formative effect on the way one thinks, feels, or acts may be considered educational. The methodology of teaching is called ": null
    },
    {
        "pedagogy": "pedagogy"
    },
    {
        ".     Formal education is commonly divided formally into such stages as ": null
    },
    {
        "preschool": "preschool"
    },
    {
        " or ": null
    },
    {
        "kindergarten": "kindergarten"
    },
    {
        ", ": null
    },
    {
        "primary school": "primary school"
    },
    {
        ", ": null
    },
    {
        "secondary school": "secondary school"
    },
    {
        " and then ": null
    },
    {
        "college": "college"
    },
    {
        ", ": null
    },
    {
        "university": "university"
    },
    {
        ", or ": null
    },
    {
        "apprenticeship": "apprenticeship"
    },
    {
        ".     A ": null
    },
    {
        "right to education": "right to education"
    },
    {
        " has been recognized by some governments and the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ". Article 13 of the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " 1966 ": null
    },
    {
        "International Covenant on Economic, Social and Cultural Rights": "international covenant on economic, social and cultural rights"
    },
    {
        " recognizes a universal right to education. ICESCR, Article 13.1 In most regions, education is ": null
    },
    {
        "compulsory": "compulsory education"
    },
    {
        " up to a certain age. There is a movement for ": null
    },
    {
        "education reform": "education reform"
    },
    {
        ", and in particular for ": null
    },
    {
        "evidence-based education": "evidence-based education"
    },
    {
        ".       ": null
    },
    {
        "Etymologically": "etymologically"
    },
    {
        ", the word education is derived from the Latin word  ēducātiō  from  ēducō  which is related to the ": null
    },
    {
        "homonym": "homonym"
    },
    {
        "  ēdūcō  from  ē-  and  dūcō  . . Etymonline.com. Retrieved on 2011-10-21.                       Education began in prehistory, as adults trained the young in the knowledge and skills deemed necessary in their society. In pre-": null
    },
    {
        "literate": "literacy"
    },
    {
        " societies, this was achieved orally and through imitation. Story-telling passed knowledge, values, and skills from one generation to the next. As cultures began to extend their ": null
    },
    {
        "knowledge": "knowledge"
    },
    {
        " beyond skills that could be readily learned through imitation, formal education developed. Schools existed in Egypt at the time of the ": null
    },
    {
        "Middle Kingdom": "middle kingdom of egypt"
    },
    {
        ".       ": null
    },
    {
        "Plato": "plato"
    },
    {
        " founded the ": null
    },
    {
        "Academy": "platonic academy"
    },
    {
        " in ": null
    },
    {
        "Athens": "ancient athens"
    },
    {
        ", the first institution of higher learning in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ".  The city of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " in Egypt, established in 330 BCE, became the successor to Athens as the intellectual cradle of ": null
    },
    {
        "Ancient Greece": "ancient greece"
    },
    {
        ". There, the great ": null
    },
    {
        "Library of Alexandria": "library of alexandria"
    },
    {
        " was built in the 3rd century BCE. European civilizations suffered a collapse of literacy and organization following the fall of Rome in CE 476. Geoffrey Blainey; A Very Short History of the World; Penguin Books, 2004     In ": null
    },
    {
        "China": "china"
    },
    {
        ", ": null
    },
    {
        "Confucius": "confucius"
    },
    {
        " , of the ": null
    },
    {
        "State of Lu": "state of lu"
    },
    {
        ", was the countrys most influential ancient philosopher, whose educational outlook continues to influence the societies of China and neighbours like Korea, Japan, and Vietnam. Confucius gathered disciples and searched in vain for a ruler who would adopt his ideals for good governance, but his ": null
    },
    {
        "Analects": "analects"
    },
    {
        " were written down by followers and have continued to influence education in East Asia into the modern era.      The ": null
    },
    {
        "Aztecs": "aztecs"
    },
    {
        " also had a well-developed theory about education, which has an equivalent word in ": null
    },
    {
        "Nahuatl": "nahuatl"
    },
    {
        " called tlacahuapahualiztli. It means the art of raising or educating a person  or the art of strengthening or bringing up men.  This was a broad conceptualization of education, which prescribed that it begins at home, supported by formal schooling, and reinforced by community living. Historians cite that formal education was mandatory for everyone regardless of social class and gender.  There was also the word neixtlamachiliztli, which is the act of giving wisdom to the face. These concepts underscore a complex set of educational practices, which was oriented towards communicating to the next generation the experience and intellectual heritage of the past for the purpose of individual development and his integration into the community.     After the ": null
    },
    {
        "Fall of Rome": "fall of rome"
    },
    {
        ", the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " became the sole preserver of literate scholarship in Western Europe.  The church established ": null
    },
    {
        "cathedral schools": "cathedral schools"
    },
    {
        " in the Early Middle Ages as centres of advanced education. Some of these establishments ultimately evolved into ": null
    },
    {
        "medieval universities": "medieval universities"
    },
    {
        " and forebears of many of Europes modern universities. During the High Middle Ages, ": null
    },
    {
        "Chartres Cathedral": "chartres cathedral"
    },
    {
        " operated the famous and influential ": null
    },
    {
        "Chartres Cathedral School": "school of chartres"
    },
    {
        ". The medieval universities of Western Christendom were well-integrated across all of Western Europe, encouraged freedom of inquiry, and produced a great variety of fine scholars and natural philosophers, including ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        " of the ": null
    },
    {
        "University of Naples": "university of naples"
    },
    {
        ", ": null
    },
    {
        "Robert Grosseteste": "robert grosseteste"
    },
    {
        " of the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        ", an early expositor of a systematic method of scientific experimentation,  and Saint ": null
    },
    {
        "Albert the Great": "albertus magnus"
    },
    {
        ", a pioneer of biological field research.  Founded in 1088, the ": null
    },
    {
        "University of Bologne": "university of bologne"
    },
    {
        " is considered the first, and the oldest continually operating university. Nuria Sanz, Sjur Bergan: The heritage of European universities , 2nd edition, Higher Education Series No. 7, Council of Europe, 2006, ISBN, p. 136     Elsewhere during the Middle Ages, ": null
    },
    {
        "Islamic science": "islamic science"
    },
    {
        " and ": null
    },
    {
        "mathematics": "mathematics in medieval islam"
    },
    {
        " flourished under the Islamic ": null
    },
    {
        "caliphate": "caliphate"
    },
    {
        " which was established across the Middle East, extending from the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " in the west to the ": null
    },
    {
        "Indus": "indus"
    },
    {
        " in the east and to the ": null
    },
    {
        "Almoravid Dynasty": "almoravid dynasty"
    },
    {
        " and ": null
    },
    {
        "Mali Empire": "mali empire"
    },
    {
        " in the south.     ": null
    },
    {
        "The Renaissance": "the renaissance"
    },
    {
        " in Europe ushered in a ": null
    },
    {
        "new age of scientific and intellectual inquiry": "scientific revolution"
    },
    {
        " and appreciation of ancient Greek and Roman civilizations. Around 1450, ": null
    },
    {
        "Johannes Gutenberg": "johannes gutenberg"
    },
    {
        " developed a printing press, which allowed works of literature to spread more quickly. The European Age of Empires saw European ideas of education in philosophy, religion, arts and sciences spread out across the globe. Missionaries and scholars also brought back new ideas from other civilizations  – as with the ": null
    },
    {
        "Jesuit China missions": "jesuit china missions"
    },
    {
        " who played a significant role in the transmission of knowledge, science, and culture between China and Europe, translating works from Europe like ": null
    },
    {
        "Euclids Elements": "euclids elements"
    },
    {
        " for Chinese scholars and the thoughts of ": null
    },
    {
        "Confucius": "confucius"
    },
    {
        " for European audiences. ": null
    },
    {
        "The Enlightenment": "the enlightenment"
    },
    {
        " saw the emergence of a more secular educational outlook in Europe.     In most countries today, full-time education, whether at school or ": null
    },
    {
        "otherwise": "homeschooling"
    },
    {
        ", is compulsory for all children up to a certain age. Due to this the proliferation of compulsory education, combined with population growth, ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " has calculated that in the next 30  years more people will receive formal education than in all of human history thus far. Robinson, K.: . TED Talks, 2006, Monterey, CA, US.       Formal education occurs in a ": null
    },
    {
        "structured environment": "learning environment"
    },
    {
        " whose explicit purpose is teaching ": null
    },
    {
        "student": "student"
    },
    {
        "s. Usually, formal education takes place in a ": null
    },
    {
        "school": "school"
    },
    {
        " environment with ": null
    },
    {
        "classrooms": "classroom"
    },
    {
        "of multiple students learning together with a trained, certified teacher of the subject. Most ": null
    },
    {
        "school systems": "educational management"
    },
    {
        " are designed around a set of values or ideals that govern all educational choices in that system. Such choices include curriculum, ": null
    },
    {
        "organizational models": "school organizational models"
    },
    {
        ", design of the physical ": null
    },
    {
        "learning spaces": "learning space"
    },
    {
        ", student-teacher interactions, methods of assessment, class size, educational activities, and more.               Preschools provide education from ages approximately three to seven, depending on the country when children enter ": null
    },
    {
        "primary education": "primary education"
    },
    {
        ". These are also known as ": null
    },
    {
        "nursery schools": "nursery schools"
    },
    {
        " and as ": null
    },
    {
        "kindergarten": "kindergarten"
    },
    {
        ", except in the US, where the term kindergarten refers to the earliest levels of primary education.  Kindergarten provide a child-centred, preschool curriculum for three- to seven-year-old children that aim at unfolding the childs physical, intellectual, and moral nature with balanced emphasis on each of them.              Primary education consists of the first five to seven years of formal, structured education. In general, primary education consists of six to eight years of schooling starting at the age of five or six, although this varies between, and sometimes within, countries. Globally, around 89% of children aged six to twelve are enrolled in primary education, and this proportion is rising. UNESCO, Education For All Monitoring Report 2008, Net Enrollment Rate in primary education Under the ": null
    },
    {
        "Education For All": "education for all"
    },
    {
        " programs driven by ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        ", most countries have committed to achieving universal enrollment in primary education by 2015, and in many countries, it is compulsory. The division between primary and ": null
    },
    {
        "secondary education": "secondary education"
    },
    {
        " is somewhat arbitrary, but it generally occurs at about eleven or twelve years of age. Some education systems have separate ": null
    },
    {
        "middle school": "middle school"
    },
    {
        "s, with the transition to the final stage of secondary education taking place at around the age of fourteen. Schools that provide primary education, are mostly referred to as primary schools or elementary schools. Primary schools are often subdivided into ": null
    },
    {
        "infant schools": "infant school"
    },
    {
        "and ": null
    },
    {
        "junior school": "junior school"
    },
    {
        ".     In India, for example, ": null
    },
    {
        "compulsory education": "compulsory educationvariation in countries"
    },
    {
        " spans over twelve years, with eight years of elementary education, five years of primary schooling and three years of upper primary schooling. Various states in the republic of India provide 12 years of compulsory school education based on a national ": null
    },
    {
        "curriculum": "curriculum"
    },
    {
        " framework designed by the ": null
    },
    {
        "National Council of Educational Research and Training": "national council of educational research and training"
    },
    {
        ".                In most contemporary educational systems of the world, secondary education comprises the formal education that occurs during ": null
    },
    {
        "adolescence": "adolescence"
    },
    {
        ". It is characterized by transition from the typically compulsory, comprehensive ": null
    },
    {
        "primary education": "primary education"
    },
    {
        " for ": null
    },
    {
        "minors": "minor"
    },
    {
        ", to the optional, selective ": null
    },
    {
        "tertiary": "tertiary education"
    },
    {
        ", postsecondary , or ": null
    },
    {
        "higher": "higher education"
    },
    {
        " education  for ": null
    },
    {
        "adult": "adult"
    },
    {
        "s. Depending on the system, schools for this period, or a part of it, may be called secondary or ": null
    },
    {
        "high school": "high school"
    },
    {
        "s, ": null
    },
    {
        "gymnasiums": "gymnasium"
    },
    {
        ", ": null
    },
    {
        "lyceum": "lyceum"
    },
    {
        "s, middle schools, ": null
    },
    {
        "college": "college"
    },
    {
        "s, or vocational schools. The exact meaning of any of these terms varies from one system to another. The exact boundary between primary and secondary education also varies from country to country and even within them but is generally around the seventh to the tenth year of schooling.     Secondary education occurs mainly during the teenage years. In the United States, Canada, and ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", primary and secondary education together are sometimes referred to as ": null
    },
    {
        "K-12": "k–12"
    },
    {
        " education, and in New Zealand Year 1–13 is used. The purpose of secondary education can be to give ": null
    },
    {
        "common knowledge": "common knowledge"
    },
    {
        ", to prepare for ": null
    },
    {
        "higher education": "higher education"
    },
    {
        ", or to train directly in a ": null
    },
    {
        "profession": "profession"
    },
    {
        ".     Secondary education in the United States did not emerge until 1910, with the rise of large corporations and advancing technology in factories, which required ": null
    },
    {
        "skilled worker": "skilled worker"
    },
    {
        "s. In order to meet this new job demand, ": null
    },
    {
        "high schools": "high school"
    },
    {
        " were created, with a curriculum focused on practical job skills that would better prepare students for ": null
    },
    {
        "white collar": "white-collar worker"
    },
    {
        " or skilled ": null
    },
    {
        "blue collar": "blue-collar worker"
    },
    {
        " work. This proved beneficial for both employers and employees, since the improved human capital lowered costs for the employer, while skilled employees received higher wages.     Secondary education has a longer history in Europe, where grammar schools or academies date from as early as the 6th century,  in the form of ": null
    },
    {
        "public schools": "public education"
    },
    {
        ", ": null
    },
    {
        "fee-paying school": "fee-paying school"
    },
    {
        "s, or charitable educational foundations, which themselves date even further back.     ": null
    },
    {
        "Community colleges": "community college"
    },
    {
        "offer another option at this transitional stage of education. They provide nonresidential junior college courses to people living in a particular area.                   Higher education, also called tertiary, third stage, or postsecondary education, is the non-compulsory educational level that follows the completion of a school such as a high school or ": null
    },
    {
        "secondary school": "secondary school"
    },
    {
        ". Tertiary education is normally taken to include ": null
    },
    {
        "undergraduate": "undergraduate"
    },
    {
        " and ": null
    },
    {
        "postgraduate education": "postgraduate education"
    },
    {
        ", as well as ": null
    },
    {
        "vocational education and training": "vocational education"
    },
    {
        ". Colleges and universities mainly provide tertiary education. Collectively, these are sometimes known as tertiary institutions. Individuals who complete tertiary education generally receive ": null
    },
    {
        "certificates": "academic certificate"
    },
    {
        ", ": null
    },
    {
        "diploma": "diploma"
    },
    {
        "s, or ": null
    },
    {
        "academic degree": "academic degree"
    },
    {
        "s.     Higher education typically involves work towards a degree-level or ": null
    },
    {
        "foundation degree": "foundation degree"
    },
    {
        " qualification. In most developed countries, a high proportion of the population now enter higher education at some time in their lives. Higher education is therefore very important to national ": null
    },
    {
        "economies": "economies"
    },
    {
        ", both as a significant industry in its own right and as a source of trained and educated personnel for the rest of the economy.     University education includes teaching, research, and social services activities, and it includes both the undergraduate level  and the ": null
    },
    {
        "graduate": "graduate student"
    },
    {
        " level . Some universities are composed of several colleges.     One type of university education is a ": null
    },
    {
        "liberal arts": "liberal arts"
    },
    {
        " education, which can be defined as a ": null
    },
    {
        "college": "college"
    },
    {
        " or ": null
    },
    {
        "university": "university"
    },
    {
        " curriculum": "curriculum"
    },
    {
        " aimed at imparting broad general knowledge and developing general intellectual capacities, in contrast to a professional, ": null
    },
    {
        "vocational": "vocational education"
    },
    {
        ", or technical curriculum.  Although what is known today as liberal arts education began in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ",  the term ": null
    },
    {
        "liberal arts college": "liberal arts college"
    },
    {
        " is more commonly associated with institutions in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " such as ": null
    },
    {
        "Williams College": "williams college"
    },
    {
        " or ": null
    },
    {
        "Barnard College": "barnard college"
    },
    {
        ".                ": null
    },
    {
        "Vocational education": "vocational education"
    },
    {
        " is a form of education focused on direct and practical training for a specific trade or craft. Vocational education may come in the form of an ": null
    },
    {
        "apprenticeship": "apprenticeship"
    },
    {
        " or ": null
    },
    {
        "internship": "internship"
    },
    {
        " as well as institutions teaching courses such as ": null
    },
    {
        "carpentry": "carpentry"
    },
    {
        ", ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ", ": null
    },
    {
        "engineering": "engineering"
    },
    {
        ", ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ", ": null
    },
    {
        "architecture": "architecture"
    },
    {
        " and ": null
    },
    {
        "the arts": "the arts"
    },
    {
        ".             In the past, those who were disabled were often not eligible for public education. Children with disabilities were repeatedly denied an education by ": null
    },
    {
        "physicians": "physicians"
    },
    {
        " or special tutors. These early physicians  set the foundation for special education today. They focused on individualized instruction and functional skills. In its early years, special education was only provided to people with severe disabilities, but more recently it has been opened to anyone who has experienced difficulty learning.               While considered alternative today, most alternative systems have existed since ancient times. After the public school system was widely developed beginning in the 19th century, some parents found reasons to be discontented with the new system. ": null
    },
    {
        "Alternative education": "alternative education"
    },
    {
        " developed in part as a reaction to perceived limitations and failings of ": null
    },
    {
        "traditional education": "traditional education"
    },
    {
        ". A broad range of educational approaches emerged, including ": null
    },
    {
        "alternative school": "alternative school"
    },
    {
        "s, ": null
    },
    {
        "self learning": "autodidacticism"
    },
    {
        ", ": null
    },
    {
        "homeschooling": "homeschooling"
    },
    {
        ", and ": null
    },
    {
        "unschooling": "unschooling"
    },
    {
        ". Example ": null
    },
    {
        "alternative schools": "alternative school"
    },
    {
        "include ": null
    },
    {
        "Montessori schools": "montessori method"
    },
    {
        ", ": null
    },
    {
        "Waldorf schools": "waldorf education"
    },
    {
        " , ": null
    },
    {
        "Friends schools": "list of friends schools"
    },
    {
        ", ": null
    },
    {
        "Sands School": "sands school"
    },
    {
        ", ": null
    },
    {
        "Summerhill School": "summerhill school"
    },
    {
        ", ": null
    },
    {
        "Waldens Path": "waldens path"
    },
    {
        ", ": null
    },
    {
        "The Peepal Grove School": "the peepal grove school"
    },
    {
        ", ": null
    },
    {
        "Sudbury Valley School": "sudbury valley school"
    },
    {
        ", ": null
    },
    {
        "Krishnamurti schools": "jiddu krishnamurti"
    },
    {
        ", and ": null
    },
    {
        "open classroom": "open classroom"
    },
    {
        " schools. ": null
    },
    {
        "Charter schools": "charter school"
    },
    {
        "are another example of alternative education, which have in the recent years grown in numbers in the US and gained greater importance in its public education system.       In time, some ideas from these experiments and paradigm challenges may be adopted as the norm in education, just as ": null
    },
    {
        "Friedrich Fröbels": "friedrich fröbel"
    },
    {
        "approach to ": null
    },
    {
        "early childhood education": "early childhood education"
    },
    {
        " in 19th-century Germany has been incorporated into contemporary ": null
    },
    {
        "kindergarten": "kindergarten"
    },
    {
        " classrooms. Other influential writers and thinkers have included the ": null
    },
    {
        "Swiss": "switzerland"
    },
    {
        " humanitarian": "humanitarianism"
    },
    {
        " Johann Heinrich Pestalozzi": "johann heinrich pestalozzi"
    },
    {
        "; the ": null
    },
    {
        "American": "united states"
    },
    {
        " transcendentalists": "transcendentalism"
    },
    {
        " Amos Bronson Alcott": "amos bronson alcott"
    },
    {
        ", ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        ", and ": null
    },
    {
        "Henry David Thoreau": "henry david thoreau"
    },
    {
        "; the founders of ": null
    },
    {
        "progressive education": "educational progressivism"
    },
    {
        ", ": null
    },
    {
        "John Dewey": "john dewey"
    },
    {
        " and ": null
    },
    {
        "Francis Parker": "francis wayland parker"
    },
    {
        "; and educational pioneers such as ": null
    },
    {
        "Maria Montessori": "maria montessori"
    },
    {
        " and ": null
    },
    {
        "Rudolf Steiner": "rudolf steiner"
    },
    {
        ", and more recently ": null
    },
    {
        "John Caldwell Holt": "john caldwell holt"
    },
    {
        ", ": null
    },
    {
        "Paul Goodman": "paul goodman"
    },
    {
        ", ": null
    },
    {
        "Frederick Mayer": "frederick mayer"
    },
    {
        ", ": null
    },
    {
        "George Dennison": "george dennison"
    },
    {
        ", and ": null
    },
    {
        "Ivan Illich": "ivan illich"
    },
    {
        ".             ": null
    },
    {
        "Indigenous education": "indigenous education"
    },
    {
        " refers to the inclusion of indigenous knowledge, models, methods, and content within formal and non-formal educational systems. Often in a post-colonial context, the growing recognition and use of indigenous education methods can be a response to the erosion and loss of indigenous knowledge and language through the processes of colonialism. Furthermore, it can enable indigenous communities to reclaim and revalue their languages and cultures, and in so doing, improve the educational success of indigenous students.           Informal learning is one of three forms of learning defined by the ": null
    },
    {
        "Organisation for Economic Co-operation and Development": "organisation for economic co-operation and development"
    },
    {
        " . Informal learning occurs in a variety of places, such as at ": null
    },
    {
        "home": "home"
    },
    {
        ", ": null
    },
    {
        "work": "employment"
    },
    {
        ", and through daily interactions and shared relationships among members of society. For many learners, this includes ": null
    },
    {
        "language acquisition": "language acquisition"
    },
    {
        ", ": null
    },
    {
        "cultural norm": "cultural norm"
    },
    {
        "s, and ": null
    },
    {
        "manners": "manners"
    },
    {
        ".     In informal learning, there is often a reference person, a peer or expert, to guide the learner. If learners have a personal interest in what they are informally being taught, learners tend to expand their existing knowledge and conceive new ideas about the topic being learned.  For example, a museum is traditionally considered an informal learning environment, as there is room for free choice, a diverse and potentially non-standardized range of topics, flexible structures, socially rich interaction, and no externally imposed assessments.      While informal learning often takes place outside educational ": null
    },
    {
        "establishments": "school"
    },
    {
        " and does not follow a specified curriculum, it can also occur within educational settings and even during formal learning situations. Educators can structure their lessons to directly utilize their students informal learning skills within the education setting.     In the late 19th century, education through play began to be recognized as making an important contribution to child development.  In the early 20th century, the concept was broadened to include young adults but the emphasis was on physical activities.  ": null
    },
    {
        "L.P. Jacks": "l.p. jacks"
    },
    {
        ", also an early proponent of lifelong learning, described education through recreation: A master in the art of living draws no sharp distinction between his work and his play, his labour and his leisure, his mind and his body, his education and his recreation. He hardly knows which is which. He simply pursues his vision of excellence through whatever he is doing and leaves others to determine whether he is working or playing. To himself, he always seems to be doing both. Enough for him that he does it well.  Education through recreation is the opportunity to learn in a seamless fashion through all of lifes activities.  The concept has been revived by the ": null
    },
    {
        "University of Western Ontario": "university of western ontario"
    },
    {
        " to teach ": null
    },
    {
        "anatomy": "anatomy"
    },
    {
        " to medical students.          ": null
    },
    {
        "Autodidacticism": "autodidacticism"
    },
    {
        " is self-directed learning. One may become an autodidact at nearly any point in ones life. ": null
    },
    {
        "Notable autodidacts": "list of autodidacts"
    },
    {
        " include ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        " , ": null
    },
    {
        "Srinivasa Ramanujan": "srinivasa ramanujan"
    },
    {
        " , ": null
    },
    {
        "Michael Faraday": "michael faraday"
    },
    {
        " , ": null
    },
    {
        "Charles Darwin": "charles darwin"
    },
    {
        " , ": null
    },
    {
        "Thomas Alva Edison": "thomas alva edison"
    },
    {
        " , ": null
    },
    {
        "Tadao Ando": "tadao ando"
    },
    {
        " , ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        " , ": null
    },
    {
        "Frank Zappa": "frank zappa"
    },
    {
        " , and ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        " .          Evidence-based education is the use of well designed scientific studies to determine which education methods work best. It consists of evidence-based teaching and evidence-based learning. ": null
    },
    {
        "Evidence-based learning": "evidence-based learning"
    },
    {
        " methods such as ": null
    },
    {
        "spaced repetition": "spaced repetition"
    },
    {
        " can increase rate of learning.  The evidence-based education movement has its roots in the larger movement towards ": null
    },
    {
        "evidence-based-practices": "evidence-based practice"
    },
    {
        ".            Many large university institutions are now starting to offer free or almost free full courses such as ": null
    },
    {
        "Harvard": "harvard university"
    },
    {
        ", ": null
    },
    {
        "MIT": "massachusetts institute of technology"
    },
    {
        " and ": null
    },
    {
        "Berkeley": "university of california, berkeley"
    },
    {
        " teaming up to form ": null
    },
    {
        "edX": "edx"
    },
    {
        ". Other universities offering open education are prestigious private universities such as ": null
    },
    {
        "Stanford": "stanford university"
    },
    {
        ", ": null
    },
    {
        "Princeton": "princeton university"
    },
    {
        ", ": null
    },
    {
        "Duke": "duke university"
    },
    {
        ", ": null
    },
    {
        "Johns Hopkins": "johns hopkins university"
    },
    {
        ", the ": null
    },
    {
        "University of Pennylvania": "university of pennsylvania"
    },
    {
        ", and ": null
    },
    {
        "Caltech": "california institute of technology"
    },
    {
        ", as well as notable public universities including ": null
    },
    {
        "Tsinghua": "tsinghua university"
    },
    {
        ", ": null
    },
    {
        "Peking": "peking university"
    },
    {
        ", ": null
    },
    {
        "Edinburgh": "university of edinburgh"
    },
    {
        ", ": null
    },
    {
        "University of Michigan": "university of michigan"
    },
    {
        ", and ": null
    },
    {
        "University of Virginia": "university of virginia"
    },
    {
        ".     Open education has been called the biggest change in the way people learn since the printing press.  Despite favourable studies on effectiveness, many people may still desire to choose traditional campus education for social and cultural reasons.      Many open universities are working to have the ability to offer students standardized testing and traditional degrees and credentials. Cloete, ElsabeÂ. Electronic Education System Model. Department of Computer Science and Information Systems in South Africa, 17 Oct. 2000. Web. 3 June 2015.     The conventional merit-system degree is currently not as common in open education as it is in campus universities, although some ": null
    },
    {
        "open universities": "open universities"
    },
    {
        " do already offer conventional degrees such as the ": null
    },
    {
        "Open University": "open university"
    },
    {
        " in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". Presently, many of the major open education sources offer their own form of certificate. Due to the popularity of open education, these new kind of academic certificates are gaining more respect and equal ": null
    },
    {
        "academic value": "academic capital"
    },
    {
        " to traditional degrees.      Out of 182 colleges surveyed in 2009 nearly half said tuition for online courses was higher than for campus-based ones.      A recent meta-analysis found that online and blended educational approaches had better outcomes than methods that used solely face-to-face interaction. U.S. Department of Education, , 2010          The education sector or education system is a group of institutions whose primary purpose is to provide education to children and young people in educational settings. It involves a wide range of people . These institutions can vary according to different contexts.      Schools deliver education, with support from the rest of the education system through various elements such as ": null
    },
    {
        "education policies": "education policy"
    },
    {
        " and guidelines – to which school policies can refer – curricula and learning materials, as well as pre- and in-service teacher training programmes. The school environment – both physical and psychological – is also guided by school policies that should ensure the well-being of students when they are in school. The ": null
    },
    {
        "Organisation for Economic Co-operation and Development": "organisation for economic co-operation and development"
    },
    {
        " has found that schools tend to perform best when principals have full authority and responsibility for ensuring that students are proficient in core subjects upon graduation. They must also seek feedback from students for quality-assurance and improvement. Governments should limit themselves to monitoring student proficiency.      The education sector is fully integrated into society, through interactions with numerous stakeholders and other sectors. These include parents, local communities, religious leaders, NGOs, stakeholders involved in health, ": null
    },
    {
        "child protection": "child protection"
    },
    {
        ", justice and law enforcement , media and political leadership.            Chimombo pointed out educations role as a policy instrument, capable of instilling social change and economic advancement in developing countries by giving communities the opportunity to take control of their destinies.  The 2030 Agenda for Sustainable Development, adopted by the United Nations General Assembly in September 2015, calls for a new vision to address the environmental, social and economic concerns facing the world today. The Agenda includes 17 ": null
    },
    {
        "Sustainable Development Goals": "sustainable development goals"
    },
    {
        " , including SDG 4 on education.       Since 1909, the ratio of children in the developing world attending school has increased. Before then, a small minority of boys attended school. By the start of the 21st century, the majority of all children in most regions of the world attended school.     ": null
    },
    {
        "Universal Primary Education": "universal primary education"
    },
    {
        " is one of the eight international ": null
    },
    {
        "Millennium Development Goals": "millennium development goals"
    },
    {
        ", towards which progress has been made in the past decade, though barriers still remain. Liesbet Steer and Geraldine Baudienville 2010.  London: ": null
    },
    {
        "Overseas Development Institute": "overseas development institute"
    },
    {
        ". Securing charitable funding from prospective donors is one particularly persistent problem. Researchers at the ": null
    },
    {
        "Overseas Development Institute": "overseas development institute"
    },
    {
        " have indicated that the main obstacles to funding for education include conflicting donor priorities, an immature aid architecture, and a lack of evidence and advocacy for the issue. Additionally, ": null
    },
    {
        "Transparency International": "transparency international"
    },
    {
        " has identified ": null
    },
    {
        "corruption": "political corruption"
    },
    {
        " in the education sector as a major stumbling block to achieving Universal Primary Education in Africa.  Furthermore, demand in the developing world for improved educational access is not as high as foreigners have expected. Indigenous governments are reluctant to take on the ongoing costs involved. There is also economic pressure from some parents, who prefer their children to earn money in the short term rather than work towards the long-term benefits of education.     A study conducted by the ": null
    },
    {
        "UNESCO International Institute for Educational Planning": "unesco international institute for educational planning"
    },
    {
        " indicates that stronger capacities in educational planning and management may have an important spill-over effect on the system as a whole. . Sustainable capacity development requires complex interventions at the institutional, organizational and individual levels that could be based on some foundational principles:   national leadership and ownership should be the touchstone of any intervention;   strategies must be context relevant and context specific;   plans should employ an integrated set of complementary interventions, though implementation may need to proceed in steps;   partners should commit to a long-term investment in capacity development while working towards some short-term achievements;   outside intervention should be conditional on an impact assessment of national capacities at various levels;   a certain percentage of students should be removed for improvisation of academics .       Nearly every country now has ": null
    },
    {
        "universal primary education": "universal primary education"
    },
    {
        ".     Similarities – in systems or even in ideas – that schools share internationally have led to an increase in international student exchanges. The European ": null
    },
    {
        "Socrates-Erasmus Programme": "erasmus programme"
    },
    {
        "  facilitates exchanges across European universities. The ": null
    },
    {
        "Soros Foundation": "soros foundation"
    },
    {
        "  provides many opportunities for students from central Asia and eastern Europe. Programs such as the ": null
    },
    {
        "International Baccalaureate": "international baccalaureate"
    },
    {
        " have contributed to the internationalization of education. The global campus online, led by American universities, allows free access to class materials and lecture files recorded during the actual classes.     The ": null
    },
    {
        "Programme for International Student Assessment": "programme for international student assessment"
    },
    {
        " and the ": null
    },
    {
        "International Association for the Evaluation of Educational Achievement": "international association for the evaluation of educational achievement"
    },
    {
        " objectively monitor and compare the proficiency of students from a wide range of different nations.     The internationalization of education is sometimes equated by critics with the westernization of education. These critics say that the internationalization of education leads to the erosion of local education systems and indigenous values and norms, which are replaced with Western systems and cultural and ideological values and orientation.                Technology plays an increasingly significant role in improving access to education for people living in impoverished areas and ": null
    },
    {
        "developing countries": "developing countries"
    },
    {
        ". However, lack of technological advancement is still causing barriers with regards to quality and access to education in developing countries.  Charities like ": null
    },
    {
        "One Laptop per Child": "one laptop per child"
    },
    {
        " are dedicated to providing infrastructures through which the disadvantaged may access educational materials.     The ": null
    },
    {
        "OLPC foundation": "one laptop per child"
    },
    {
        ", a group out of ": null
    },
    {
        "MIT Media Lab": "mit media lab"
    },
    {
        " and supported by several major corporations, has a stated mission to develop a ": null
    },
    {
        "$100 laptop": "$100 laptop"
    },
    {
        " for delivering ": null
    },
    {
        "educational software": "educational software"
    },
    {
        ". The laptops were widely available as of 2008. They are sold at cost or given away based on donations.     In Africa, the ": null
    },
    {
        "New Partnership for Africas Development": "new partnership for africas development"
    },
    {
        " has launched an ": null
    },
    {
        "e-school program": "new partnership for africas development e-school program"
    },
    {
        " to provide all 600,000 primary and high schools with computer equipment, learning materials and ": null
    },
    {
        "internet access": "internet access"
    },
    {
        " within 10 years.  An International Development Agency project called nabuur.com,  started with the support of former American President ": null
    },
    {
        "Bill Clinton": "bill clinton"
    },
    {
        ", uses the ": null
    },
    {
        "Internet": "internet"
    },
    {
        " to allow co-operation by individuals on issues of social development.     ": null
    },
    {
        "India": "india"
    },
    {
        " is developing technologies that will bypass land-based ": null
    },
    {
        "telephone": "telephone"
    },
    {
        " and Internet infrastructure to deliver ": null
    },
    {
        "distance learning": "distance learning"
    },
    {
        " directly to its students. In 2004, the ": null
    },
    {
        "Indian Space Research Organisation": "indian space research organisation"
    },
    {
        " launched ": null
    },
    {
        "EDUSAT": "gsat-3"
    },
    {
        ", a communications satellite providing access to educational materials that can reach more of the countrys population at a greatly reduced cost.        Research into LCPS found that over 5 years to July 2013, debate around LCPSs to achieving ": null
    },
    {
        "Education for All": "education for all"
    },
    {
        " objectives was polarized and finding growing coverage in international policy.  The polarization was due to disputes around whether the schools are affordable for the poor, reach disadvantaged groups, provide quality education, support or undermine equality, and are financially sustainable. The report examined the main challenges encountered by development organizations which support LCPSs. Surveys suggest these types of schools are expanding across Africa and Asia. This success is attributed to excess demand. These surveys found concern for:   Equity: This concern is widely found in the literature, suggesting the growth in low-cost private schooling may be exacerbating or perpetuating already existing inequalities in developing countries, between urban and rural populations, lower- and higher-income families, and between girls and boys. The report findings suggest that girls may be underrepresented and that LCPS are reaching low-income families in smaller numbers than higher-income families.        The report showed some cases of successful voucher and subsidy programs; evaluations of international support to the sector are not widespread. Addressing regulatory ineffectiveness is a key challenge. Emerging approaches stress the importance of understanding the political economy of the market for LCPS, specifically how relationships of power and accountability between users, government, and private providers can produce better education outcomes for the poor.                       ": null
    },
    {
        "Educational psychology": "educational psychology"
    },
    {
        " is the study of how humans learn in educational settings, the effectiveness of educational interventions, the psychology of teaching, and the ": null
    },
    {
        "social psychology": "social psychology"
    },
    {
        " of ": null
    },
    {
        "schools": "school"
    },
    {
        "as ": null
    },
    {
        "organization": "organization"
    },
    {
        "s. Although the terms educational psychology and school psychology are often used interchangeably, researchers and theorists are likely to be identified as ": null
    },
    {
        "educational psychologists": ":category:educational psychologists"
    },
    {
        ", whereas practitioners in schools or school-related settings are identified as ": null
    },
    {
        "school psychologist": "school psychologist"
    },
    {
        "s. Educational psychology is concerned with the processes of educational attainment in the general population and in sub-populations such as ": null
    },
    {
        "gifted": "gifted"
    },
    {
        " children and those with specific ": null
    },
    {
        "disabilities": "disabilities"
    },
    {
        ".      Educational psychology can in part be understood through its relationship with other disciplines. It is informed primarily by ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", bearing a relationship to that discipline analogous to the relationship between ": null
    },
    {
        "medicine": "medicine"
    },
    {
        " and ": null
    },
    {
        "biology": "biology"
    },
    {
        ". Educational psychology, in turn, informs a wide range of specialties within educational studies, including ": null
    },
    {
        "instructional design": "instructional design"
    },
    {
        ", ": null
    },
    {
        "educational technology": "educational technology"
    },
    {
        ", curriculum development, ": null
    },
    {
        "organizational learning": "organizational learning"
    },
    {
        ", ": null
    },
    {
        "special education": "special education"
    },
    {
        " and ": null
    },
    {
        "classroom management": "classroom management"
    },
    {
        ". Educational psychology both draws from and contributes to ": null
    },
    {
        "cognitive science": "cognitive science"
    },
    {
        " and the ": null
    },
    {
        "learning sciences": "learning sciences"
    },
    {
        ". In universities, departments of educational psychology are usually housed within faculties of education, possibly accounting for the lack of representation of educational psychology content in introductory psychology textbooks .          ": null
    },
    {
        "Intelligence": "intelligence"
    },
    {
        " is an important factor in how the individual responds to education. Those who have higher intelligence tend to perform better at school and go on to higher levels of education.  This effect is also observable in the opposite direction, in that education increases measurable intelligence.  Studies have shown that while educational attainment is important in predicting intelligence in later life, intelligence at 53 is more closely correlated to intelligence at 8 years old than to educational attainment.        There has been much interest in learning modalities and styles over the last two decades. The most commonly employed learning modalities are: Swassing, R. H., Barbe, W. B., & Milone, M. N. . The Swassing-Barbe Modality Index: Zaner-Bloser Modality Kit. Columbus, OH: Zaner-Bloser.   ": null
    },
    {
        "Visual": "visual"
    },
    {
        ": learning based on observation and seeing what is being learned.   ": null
    },
    {
        "Auditory": "hearing"
    },
    {
        ": learning based on listening to instructions/information.   ": null
    },
    {
        "Kinesthetic": "kinesthetic"
    },
    {
        ": learning based on movement, e.g. hands-on work and engaging in activities.     Other commonly employed modalities include ": null
    },
    {
        "music": "music"
    },
    {
        "al, ": null
    },
    {
        "interpersonal": "interpersonal"
    },
    {
        ", ": null
    },
    {
        "verbal": "verbal reasoning"
    },
    {
        ", ": null
    },
    {
        "logical": "logical"
    },
    {
        ", and ": null
    },
    {
        "intrapersonal": "intrapersonal"
    },
    {
        ".     Dunn and Dunn  focused on identifying relevant stimuli that may influence learning and manipulating the school environment, at about the same time as ": null
    },
    {
        "Joseph Renzulli": "joseph renzulli"
    },
    {
        "  recommended varying teaching strategies. ": null
    },
    {
        "Howard Gardner": "howard gardner"
    },
    {
        "  detailing Multiple Intelligences identified a wide range of modalities in his ": null
    },
    {
        "Multiple Intelligences": "multiple intelligences"
    },
    {
        " theories. The ": null
    },
    {
        "Myers-Briggs Type Indicator": "myers-briggs type indicator"
    },
    {
        " and ": null
    },
    {
        "Keirsey Temperament Sorter": "keirsey temperament sorter"
    },
    {
        ", based on the works of ": null
    },
    {
        "Jung": "jung"
    },
    {
        ",  focus on understanding how peoples personality affects the way they interact personally, and how this affects the way individuals respond to each other within the learning environment. The work of ": null
    },
    {
        "David Kolb": "david kolb"
    },
    {
        " and ": null
    },
    {
        "Anthony Gregorcs": "anthony gregorc"
    },
    {
        "Type Delineator  follows a similar but more simplified approach.     Some theories propose that all individuals benefit from a variety of learning modalities, while others suggest that individuals may have preferred learning styles, learning more easily through visual or kinesthetic experiences. Barbe, W. B., & Swassing, R. H., with M. N. Milone. . Teaching through modality strengths: Concepts and practices. Columbus, OH: Zaner-Bloser A consequence of the latter theory is that effective teaching should present a variety of teaching methods which cover all three learning modalities so that different students have equal opportunities to learn in a way that is effective for them.  Guy Claxton has questioned the extent that ": null
    },
    {
        "learning styles": "learning styles"
    },
    {
        " such as Visual, Auditory and Kinesthetic are helpful, particularly as they can have a tendency to label children and therefore restrict learning.   Recent research has argued, there is no adequate evidence base to justify incorporating learning styles assessments into general educational practice.        ": null
    },
    {
        "Educational neuroscience": "educational neuroscience"
    },
    {
        " is an emerging ": null
    },
    {
        "scientific": "science"
    },
    {
        " field that brings together researchers in ": null
    },
    {
        "cognitive neuroscience": "cognitive neuroscience"
    },
    {
        ", ": null
    },
    {
        "developmental cognitive neuroscience": "developmental cognitive neuroscience"
    },
    {
        ", ": null
    },
    {
        "educational psychology": "educational psychology"
    },
    {
        ", ": null
    },
    {
        "educational technology": "educational technology"
    },
    {
        ", ": null
    },
    {
        "education theory": "education theory"
    },
    {
        " and other related disciplines to explore the interactions between biological processes and education.     Researchers in educational neuroscience investigate the ": null
    },
    {
        "neural": "neural"
    },
    {
        " mechanisms of ": null
    },
    {
        "reading": "reading"
    },
    {
        ", ": null
    },
    {
        "numerical cognition": "numerical cognition"
    },
    {
        ",  ": null
    },
    {
        "attention": "attention"
    },
    {
        ", and their attendant difficulties including ": null
    },
    {
        "dyslexia": "dyslexia"
    },
    {
        ",   ": null
    },
    {
        "dyscalculia": "dyscalculia"
    },
    {
        ",  and ": null
    },
    {
        "ADHD": "adhd"
    },
    {
        " as they relate to education. Several academic institutions around the world are beginning to devote resources to the establishment of educational neuroscience research.             As an academic field, philosophy of education is the philosophical study of education and its problems   its central subject matter is education, and its methods are those of ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " .  The philosophy of education may be either the philosophy of the process of education or the philosophy of the discipline of education. That is, it may be part of the discipline in the sense of being concerned with the aims, forms, methods, or results of the process of educating or being educated; or it may be metadisciplinary in the sense of being concerned with the concepts, aims, and methods of the discipline.  As such, it is both part of the field of education and a field of ": null
    },
    {
        "applied philosophy": "applied philosophy"
    },
    {
        ", drawing from fields of ": null
    },
    {
        "metaphysics": "metaphysics"
    },
    {
        ", ": null
    },
    {
        "epistemology": "epistemology"
    },
    {
        ", ": null
    },
    {
        "axiology": "axiology"
    },
    {
        " and the philosophical approaches  to address questions in and about ": null
    },
    {
        "pedagogy": "pedagogy"
    },
    {
        ", ": null
    },
    {
        "education policy": "education policy"
    },
    {
        ", and ": null
    },
    {
        "curriculum": "curriculum"
    },
    {
        ", as well as the process of ": null
    },
    {
        "learning": "learning theory"
    },
    {
        ", to name a few.  For example, it might study what constitutes upbringing and education, the values and norms revealed through upbringing and educational practices, the limits and legitimization of education as an academic discipline, and the relation between ": null
    },
    {
        "education theory": "education theory"
    },
    {
        " and practice.       There is no broad consensus as to what educations chief aim or aims are or should be. Different places, and at different times, have used educational systems for different purposes. The ": null
    },
    {
        "Prussian education system": "prussian education system"
    },
    {
        " in the 19th century, for example, wanted to turn boys and girls into adults who would serve the states political goals.       Some authors stress its value to the individual, emphasizing its potential for positively influencing students personal development, promoting autonomy, forming a cultural identity or establishing a career or occupation. Other authors emphasize educations contributions to societal purposes, including good citizenship, shaping students into productive members of society, thereby promoting societys general economic development, and preserving cultural values. Christopher Winch and John Gingell, Philosophy of Education: The Key Concepts . London:Routledge, 2008. pp. 10–11.     The purpose of education in a given time and place affects who is taught, what is taught, and how the education system behaves. For example, in the 21st century, many countries treat education as a ": null
    },
    {
        "positional good": "positional good"
    },
    {
        ".  In this competitive approach, people want their own students to get a better education than other students. This approach can lead to unfair treatment of some students, especially those from disadvantaged or marginalized groups. For example, in this system, a citys school system may draw school district boundaries so that nearly all the students in one school are from low-income families, and that nearly all the students in the neighboring schools come from more affluent families, even though concentrating low-income students in one school results in worse educational achievement for the entire school system.          In formal education, a ": null
    },
    {
        "curriculum": "curriculum"
    },
    {
        " is the set of courses and their content offered at a ": null
    },
    {
        "school": "school"
    },
    {
        " or ": null
    },
    {
        "university": "university"
    },
    {
        ". As an idea, curriculum stems from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word for  race course , referring to the course of ": null
    },
    {
        "deeds": "wikt:deed"
    },
    {
        " and experiences through which ": null
    },
    {
        "child": "child"
    },
    {
        "ren grow to become mature ": null
    },
    {
        "adult": "adult"
    },
    {
        "s. A curriculum is prescriptive and is based on a more general ": null
    },
    {
        "syllabus": "syllabus"
    },
    {
        " which merely specifies what topics must be understood and to what level to achieve a particular grade or standard.     An ": null
    },
    {
        "academic discipline": "list of academic disciplines"
    },
    {
        " is a branch of knowledge which is formally taught, either at the university – or via some other such method. Each discipline usually has several sub-disciplines or branches, and distinguishing lines are often both arbitrary and ambiguous. Examples of broad areas of academic disciplines include the ": null
    },
    {
        "natural science": "natural science"
    },
    {
        "s, ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "computer science": "computer science"
    },
    {
        ", ": null
    },
    {
        "social science": "social science"
    },
    {
        "s, ": null
    },
    {
        "humanities": "humanities"
    },
    {
        " and ": null
    },
    {
        "applied science": "applied science"
    },
    {
        "s.        Instruction is the facilitation of anothers learning. Instructors in primary and secondary institutions are often called ": null
    },
    {
        "teacher": "teacher"
    },
    {
        "s, and they direct the education of ": null
    },
    {
        "students": "student"
    },
    {
        "and might draw on many ": null
    },
    {
        "subjects": "course"
    },
    {
        " like ": null
    },
    {
        "reading": "reading"
    },
    {
        ", ": null
    },
    {
        "writing": "writing"
    },
    {
        ", ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "science": "science"
    },
    {
        " and ": null
    },
    {
        "history": "history"
    },
    {
        ". Instructors in post-secondary institutions might be called ": null
    },
    {
        "teacher": "teacher"
    },
    {
        "s, instructors, or ": null
    },
    {
        "professor": "professor"
    },
    {
        "s, depending on the type of institution; and they primarily teach only their specific discipline. Studies from the United States suggest that the quality of teachers is the single most important factor affecting student performance, and that countries which score highly on international tests have multiple policies in place to ensure that the teachers they employ are as effective as possible.   With the passing of NCLB in the United States , teachers must be highly qualified.              It has been argued that high rates of education are essential for countries to be able to achieve high levels of ": null
    },
    {
        "economic growth": "economic growth"
    },
    {
        ".  Empirical analyses tend to support the theoretical prediction that poor countries should grow faster than rich countries because they can adopt cutting edge technologies already tried and tested by rich countries. However, ": null
    },
    {
        "technology transfer": "technology transfer"
    },
    {
        " requires knowledgeable managers and engineers who are able to operate new machines or production practices borrowed from the leader in order to close the gap through imitation. Therefore, a countrys ability to learn from the leader is a function of its stock of ": null
    },
    {
        "human capital": "human capital"
    },
    {
        " . Recent study of the determinants of aggregate economic growth have stressed the importance of fundamental economic institutions  and the role of cognitive skills.      At the level of the individual, there is a large literature, generally related to the work of ": null
    },
    {
        "Jacob Mincer": "jacob mincer"
    },
    {
        ",  on how earnings are related to the schooling and other human capital. This work has motivated many studies, but is also controversial. The chief controversies revolve around how to interpret the impact of schooling. David Card, Causal effect of education on earnings, in Handbook of labor economics, Orley Ashenfelter and David Card . Amsterdam: North-Holland, 1999: pp. 1801–63 James J. Heckman, Lance J. Lochner, and Petra E. Todd., Earnings functions, rates of return and treatment effects: The Mincer equation and beyond, in Handbook of the Economics of Education, Eric A. Hanushek and Finis Welch . Amsterdam: North Holland, 2006: pp. 307–458. Some students who have indicated a high potential for learning, by testing with a high ": null
    },
    {
        "intelligence quotient": "intelligence quotient"
    },
    {
        ", may not achieve their full academic potential, due to financial difficulties.      Economists ": null
    },
    {
        "Samuel Bowles": "samuel bowles"
    },
    {
        " and Herbert Gintis argued in 1976 that there was a fundamental conflict in American schooling between the ": null
    },
    {
        "egalitarian": "egalitarianism"
    },
    {
        " goal of democratic participation and the inequalities implied by the continued profitability of capitalist production.      In ": null
    },
    {
        "The Case Against Education": "the case against education"
    },
    {
        ", Bryan Caplan argues that education is largely a waste of students time and taxpayers money. Specifically, all levels of education waste resources teaching many subjects that few students need to learn or have any real interest in. The bulk of what students learn is quickly forgotten after final examinations. University education, in particular, has become so vital to ones career only due to decades of ": null
    },
    {
        "credentialism and educational inflation": "credentialism and educational inflation"
    },
    {
        ". It merely serves the purpose of ": null
    },
    {
        "signalling": "signalling"
    },
    {
        " to employers that a graduate is probably brilliant, diligent and willing to tolerate serious boredom. To remedy this situation, primary schools should teach nothing but writing and mathematics. Secondary schools should add nothing but vocational training. Public spending on university education should be drastically reduced so that ": null
    },
    {
        "underemployment": "underemployment"
    },
    {
        "-prone degrees will become less attractive to students. The vast public funds thus saved could then be redirected to other purposes.          Many countries are now drastically changing the way they educate their citizens. The world is changing at an ever quickening rate, which means that a lot of knowledge becomes obsolete and inaccurate more quickly. The emphasis is therefore shifting to teaching the skills of learning: to picking up new knowledge quickly and in as agile a way as possible. Finnish schools have even begun to move away from the regular subject-focused curricula, introducing instead developments like phenomenon-based learning, where students study concepts like climate change instead.  There are also active ": null
    },
    {
        "educational interventions": "educational interventions for first-generation students"
    },
    {
        " to implement programs and paths specific to non-traditional students, such as ": null
    },
    {
        "first generation students": "first-generation college students in the united states"
    },
    {
        ".     Education is also becoming a commodity no longer reserved for children. Adults need it too.  Some governmental bodies, like the Finnish Innovation Fund Sitra in Finland, have even proposed compulsory lifelong education. ": null
    }
]