[
    {
        "     An effects unit or effects pedal is an ": null
    },
    {
        "electronic or digital": "music technology"
    },
    {
        " device that ": null
    },
    {
        "alters the sound": "audio signal processing"
    },
    {
        " of a ": null
    },
    {
        "musical instrument": "musical instrument"
    },
    {
        " or other audio source.     Common effects include ": null
    },
    {
        "distortion/overdrive": "distortion"
    },
    {
        ", often used with electric guitar in ": null
    },
    {
        "electric blues": "electric blues"
    },
    {
        " and rock music; ": null
    },
    {
        "dynamic": "dynamics"
    },
    {
        " effects such as ": null
    },
    {
        "volume pedals": "volume pedal"
    },
    {
        "and ": null
    },
    {
        "compressor": "audio compressor"
    },
    {
        "s, which affect loudness; ": null
    },
    {
        "filters": "linear filter"
    },
    {
        "such as ": null
    },
    {
        "wah-wah pedals": "wah-wah pedal"
    },
    {
        "and ": null
    },
    {
        "graphic equalizer": "graphic equalizer"
    },
    {
        "s, which modify frequency ranges; ": null
    },
    {
        "modulation": "modulation"
    },
    {
        " effects, such as ": null
    },
    {
        "chorus": "chorus effect"
    },
    {
        ", ": null
    },
    {
        "flangers": "flanger"
    },
    {
        "and ": null
    },
    {
        "phasers": "phaser"
    },
    {
        "; ": null
    },
    {
        "pitch": "pitch"
    },
    {
        " effects such as ": null
    },
    {
        "pitch shifters": "pitch shifter"
    },
    {
        "; and time effects, such as ": null
    },
    {
        "reverb": "reverb"
    },
    {
        " and ": null
    },
    {
        "delay": "delay"
    },
    {
        ", which create echoing sounds and emulate the sound of different spaces.       Most modern effects use ": null
    },
    {
        "solid-state electronics": "solid-state electronics"
    },
    {
        " or ": null
    },
    {
        "computer chips": "integrated circuit"
    },
    {
        ". Some effects, particularly older ones such as ": null
    },
    {
        "Leslie speakers": "leslie speaker"
    },
    {
        "and ": null
    },
    {
        "spring reverb": "spring reverb"
    },
    {
        "s, use mechanical components or ": null
    },
    {
        "vacuum tube": "vacuum tube"
    },
    {
        "s. Effects are often used as ": null
    },
    {
        "stompboxes": "effects unitstompboxes"
    },
    {
        ", which are typically placed on the floor and controlled with footswitches. They are also built into ": null
    },
    {
        "amplifiers": "guitar amplifier"
    },
    {
        ", ": null
    },
    {
        "tabletop units": "multi effects"
    },
    {
        " designed for DJs and record producers, and ": null
    },
    {
        "rackmounts": "effects unitrackmounts"
    },
    {
        ", and are widely used as software ": null
    },
    {
        "VSTs": "virtual studio technology"
    },
    {
        ".     Musicians, ": null
    },
    {
        "audio engineers": "audio engineer"
    },
    {
        "and record producers use effects units during live performances or in the studio, typically with electric guitar, bass guitar, ": null
    },
    {
        "electronic keyboard": "electronic keyboard"
    },
    {
        " or ": null
    },
    {
        "electric piano": "electric piano"
    },
    {
        ". While guitar effects are most frequently used with electric or ": null
    },
    {
        "electronic": "electronic musical instrument"
    },
    {
        " instruments, effects can also be used with ": null
    },
    {
        "acoustic": "acoustic music"
    },
    {
        " instruments, drums and vocals.            An effects unit is also called an effect box , effects device , effects processor or simply effects . In ": null
    },
    {
        "audio engineer": "audio engineer"
    },
    {
        " parlance, a signal without effects is dry and an effect-processed signal is wet . The abbreviation F/X or FX is sometimes used. A pedal-style unit may be called a stomp box , stompbox , effects pedal or pedal . A musician bringing many pedals to a live show or recording session often mounts the pedals on a ": null
    },
    {
        "guitar pedalboard": "guitar pedalboard"
    },
    {
        ", to reduce set-up and tear-down time and, for pedalboards with lids, protect the pedals during transportation. When a musician has multiple effects in a ": null
    },
    {
        "rack mount": "rack mount"
    },
    {
        "ed ": null
    },
    {
        "road case": "road case"
    },
    {
        ", this case may be called an effects rack or rig . When rackmounted effects are mounted in a roadcase, this also speeds up a musicians set-up and tear-down time, because all of the effects can be connected together inside the rack case and all of the units can be plugged into a powerbar.       Effects units are available in a variety of formats or form factors. Stompboxes are primarily used units in live performance and studio recordings. Rackmount devices saw a heavy usage during the later 20th century, due to their advanced processing power and desirable tones. However, by the 21st century, with the advent of digital Plug-Ins and more powerful Stompboxes for live usage, the need and practicality of rackmounted effects units went down, and as such, prices of rack effects have diminished due to lower usage. Clement, V . , Alfred Music. p.  30–31. An effects unit can consist of ": null
    },
    {
        "analog": "analogue electronics"
    },
    {
        " or ": null
    },
    {
        "digital": "digital data"
    },
    {
        " circuitry": "circuitry"
    },
    {
        " or a combination of the two. During a live performance, the effect is plugged into the electrical signal path of the instrument. In the studio, the instrument or other sound-sources ": null
    },
    {
        "auxiliary output": "aux-send"
    },
    {
        " is patched into the effect.   Form factors are part of a studio or musicians ": null
    },
    {
        "outboard gear": "outboard gear"
    },
    {
        ". Editors, Guitar Player Magazine .  How to Play Guitar: The Basics & Beyond. Hal Leonard. p. 82.            Stompboxes are small plastic or metal chassis which usually lie on the floor or in a ": null
    },
    {
        "pedalboard": "guitar pedalboard"
    },
    {
        " to be operated by the users feet. Pedals are often rectangle-shaped, but there are a range of other shapes . Typical simple stompboxes have a single footswitch, one to three ": null
    },
    {
        "potentiometers": "potentiometers"
    },
    {
        " for controlling the effect, and a single ": null
    },
    {
        "LED": "led"
    },
    {
        " that indicates if the effect is on. A typical distortion or overdrive pedals three potentiometers, for example, control the level or intensity of the distortion effect, the tone of the effected signal and the volume of the effected signal. Depending on the type of pedal, the potentiometers may control different parameters of the effect. For a ": null
    },
    {
        "chorus effect": "chorus effect"
    },
    {
        ", for example, the knobs may control the depth and speed of the effect. Complex stompboxes may have multiple footswitches, many knobs, additional switches or buttons that are operated with the fingers, and an alphanumeric ": null
    },
    {
        "LED": "led"
    },
    {
        " display that indicates the status of the effect with short acronyms . Mangum, Eric; Stubbs, Dean . . Hal Leonard. p. 8.   Some pedals have two knobs stacked on top of each other, enabling the unit to provide two knobs per single knob space.          An effects chain or signal chain is formed by connecting two or more stompboxes. Effect chains are typically created between the guitar and the amp or between the ": null
    },
    {
        "preamplifier": "preamplifier"
    },
    {
        " and the power amp. When a pedal is off or inactive, the electric ": null
    },
    {
        "audio signal": "audio signal"
    },
    {
        " coming into the pedal diverts onto a  bypass , an unaltered dry signal that continues on to other effects down the chain. In this way, a musician can combine effects within a chain in a variety of ways without having to reconnect boxes during a performance.        A controller or effects management system lets the musician create multiple effect chains, so they can select one or several chains by tapping a single switch. The switches are usually organized in a row or a simple grid.          To preserve the clarity of the tone, it is most common to put ": null
    },
    {
        "compression": "effects unitdynamics"
    },
    {
        ", ": null
    },
    {
        "wah": "wah-wah"
    },
    {
        " and ": null
    },
    {
        "overdrive": "distortion"
    },
    {
        " pedals at the start of the chain; modulation  in the middle; and time-based units  at the end. When using many effects, unwanted noise and hum can be introduced into the sound. Some performers use a ": null
    },
    {
        "noise gate pedal": "effects unitdynamics"
    },
    {
        " at the end of a chain to reduce unwanted noise and hum introduced by overdrive units or vintage gear.           ": null
    },
    {
        "Rackmount": "rackmount"
    },
    {
        "ed effects are typically built in a thin metal chassis with metal ears designed to be screwed into a ": null
    },
    {
        "19-inch rack": "19-inch rack"
    },
    {
        " that is standard to the telecommunication, ": null
    },
    {
        "computing": "computing"
    },
    {
        " and ": null
    },
    {
        "music technology": "music technology"
    },
    {
        " industries. Rackmounted effects may be one, two or three rack spaces high. When purchased from the store, rack-mounted equipment is not equipped with the rugged chassis features used on stompboxes and amps that are designed to be transported as standalone units, such as corner protectors. Rackmounted units are typically mounted in a rack, which is housed in a ": null
    },
    {
        "road case": "road case"
    },
    {
        ", a tough plastic case with removable front and rear covers that can be latched on during transportation to protect the knobs and switches and then removed during performances. A rackmount unit may contain ": null
    },
    {
        "electronic circuit": "electronic circuit"
    },
    {
        "ry identical to a stompboxs, although its circuits are typically more complex. Unlike stompboxes, rackmounts usually have several different types of effects.         Rackmounts are most commonly used in recording studios and front of house ": null
    },
    {
        "live sound mixing": "live sound mixing"
    },
    {
        " situations, though professional musicians who play electric bass, electric guitar, or synthesizers may use them in place of stompboxes, to create a rackmounted head unit for their speaker cabinet. Rackmounts are controlled by knobs, switches or buttons on their front panel, and often by a ": null
    },
    {
        "MIDI": "midi"
    },
    {
        " digital control interface. During live performances, a musician can operate rackmounted effects using a foot controller .  By setting up effects in a rack-mounted road case, this speeds up set-up and tear-down, because all of the effects can be connected together with patch cords and all of the units can be plugged into a power bar. This means that a musician only needs to plug in the main power bar into ": null
    },
    {
        "AC Mains": "ac mains"
    },
    {
        " power and plug their instrument into the rack, and the last effect units output into their ": null
    },
    {
        "instrument amplifier": "instrument amplifier"
    },
    {
        " and/or the ": null
    },
    {
        "PA system": "pa system"
    },
    {
        ".     Shock mount racks are designed for musicians who frequently move gear between venues. Shock mounts help to protect electronic devices from bumps during transportation. Devices that are less than 19  inches wide may use special ear adapters to mount on a rack.           A multi-effects device is a single electronics effects pedal or rackmount device that contains many different electronic effects. Multi-FX devices allow users to preset combinations of different effects, allowing musicians quick on-stage access to different effects combinations. Hunter, Dave . . Hal Leonard. p. 125. Multi-effects units typically have a range of distortion, chorus, flanger, phaser and reverb effects. The most expensive multi-effects units may also have looper functions. Pedal-style multieffects range from fairly inexpensive stompboxes that contain two pedals and a few knobs to control the effects to large, expensive floor units with many pedals and knobs. Rackmounted multieffects units are typically mounted in a rack. Guitarists and bassists may mount their rackmounted multieffects unit in the same rack with their preamplifier and power amplifier.     A tabletop unit is a type of multi-effects device that sits on a desk and is controlled manually. One such example is the ": null
    },
    {
        "Pod": "pod"
    },
    {
        " guitar amplifier modeler. Digital effects designed for DJs are often sold in tabletop models, so that the units can be placed alongside a ": null
    },
    {
        "DJ mixer": "dj mixer"
    },
    {
        ", turntables and ": null
    },
    {
        "CD scratching": "scratching"
    },
    {
        " gear. Bartlett, Bruce; Bartlett, Jenny . . Focal Press. p. 226. For a DJ, a pedal located on the floor would not be practical because she/he would find it hard to adjust the knobs.            Effects are often incorporated into ": null
    },
    {
        "amplifiers": "amplifier"
    },
    {
        "and even some types of instruments. Electric ": null
    },
    {
        "guitar amplifiers": "guitar amplifier"
    },
    {
        "typically have built-in ": null
    },
    {
        "reverb": "reverb"
    },
    {
        " and ": null
    },
    {
        "distortion": "distortion"
    },
    {
        ", while acoustic guitar and ": null
    },
    {
        "keyboard amplifiers": "keyboard amplifier"
    },
    {
        "tend to only have built-in reverb. Some acoustic instrument amplifiers have reverb, chorus, compression and equalization effects. Vintage guitar amps typically have ": null
    },
    {
        "tremolo": "tremolo"
    },
    {
        " and ": null
    },
    {
        "vibrato": "vibrato"
    },
    {
        " effects, and sometimes reverb. The Fender Bandmaster Reverb amp, for example, had built-in reverb and vibrato. Built-in effects may offer the user less control than standalone pedals or rackmounted units. For example, on some lower- to mid-priced ": null
    },
    {
        "bass amplifier": "bass amplifier"
    },
    {
        "s, the only control on the ": null
    },
    {
        "audio compression": "dynamic range compression"
    },
    {
        " effect is a button or switch to turn it on or off, or a single knob. In contrast, a pedal or rackmounted unit would typically provide ratio, threshold and attack knobs and sometimes soft knee or other options to allow the user to control the compression.     Since the 2000s, guitar amplifiers began having built-in multi-effects units or digital modeling effects. Bass amplifiers are less likely to have built-in effects, although some may have a ": null
    },
    {
        "compressor": "dynamic range compression"
    },
    {
        "/": null
    },
    {
        "limiter": "limiter"
    },
    {
        " or ": null
    },
    {
        "fuzz bass": "fuzz bass"
    },
    {
        " effect. Eiche. Jon; Fliegler, Ritchie , Hal Leonard. p. 25, 40, 52, 74. Bass amps from the 1980s sometimes included built-in ": null
    },
    {
        "bass chorus": "bass chorus"
    },
    {
        ".     Instruments with built-in effects include ": null
    },
    {
        "Hammond organ": "hammond organ"
    },
    {
        "s, ": null
    },
    {
        "electronic organ": "electronic organ"
    },
    {
        "s, ": null
    },
    {
        "electronic pianos": "electronic piano"
    },
    {
        "and ": null
    },
    {
        "digital synthesizer": "digital synthesizer"
    },
    {
        "s.  Built-in effects for keyboard typically include reverb, chorus and, for Hammond organ, vibrato. Many ": null
    },
    {
        "clonewheel organs": "clonewheel organ"
    },
    {
        " include an overdrive effect. Occasionally, acoustic-electric and electric guitars will have built-in effects, such as a preamp or equalizer.           The earliest sound effects were strictly studio productions. In the mid to late 1940s, ": null
    },
    {
        "recording engineers": "audio engineer"
    },
    {
        " and experimental musicians such as ": null
    },
    {
        "Les Paul": "les paul"
    },
    {
        " began manipulating ": null
    },
    {
        "reel-to-reel recording tape": "reel-to-reel audio tape recording"
    },
    {
        " to create echo effects and unusual, futuristic sounds. Microphone placement techniques were used in spaces with specially designed acoustic properties to simulate ": null
    },
    {
        "echo chamber": "echo chamber"
    },
    {
        "s.    In 1948 ": null
    },
    {
        "DeArmond": "harry dearmond"
    },
    {
        " released the Trem-Trol, the first commercially available stand-alone effects unit. This device produced a tremolo by passing an instruments electrical signal through a water-based electrolytic fluid.  Most stand-alone effects of the 1950s and early 60s such as the Gibson GA-VI vibrato unit and the Fender reverb box, were expensive and impractical, requiring bulky ": null
    },
    {
        "transformers": "transformer"
    },
    {
        "and high ": null
    },
    {
        "voltage": "voltage"
    },
    {
        "s. The original stand-alone units were not especially in-demand as many effects came built into amplifiers. The first popular stand-alone was the 1958 Watkins Copicat, a relatively portable tape echo effect made famous by the British band, ": null
    },
    {
        "The Shadows": "the shadows"
    },
    {
        ". Hunter, D . . Hal Leonard. p. 11–12.  13 September 2010          Effects built into ": null
    },
    {
        "guitar amplifiers": "guitar amplifiers"
    },
    {
        " were the first effects that musicians used regularly outside the studio. From the late 1940s onward, the ": null
    },
    {
        "Gibson": "gibson guitar corporation"
    },
    {
        " Guitar Corp. began including ": null
    },
    {
        "vibrato": "vibrato"
    },
    {
        " circuits in ": null
    },
    {
        "combo amplifier": "combo amplifier"
    },
    {
        "s. The 1950 Ray Butts EchoSonic amp was the first to feature the ": null
    },
    {
        "spring reverb": "reverberationspring reverberators"
    },
    {
        " echo sound, which quickly became popular with guitarists such as ": null
    },
    {
        "Chet Atkins": "chet atkins"
    },
    {
        ", ": null
    },
    {
        "Carl Perkins": "carl perkins"
    },
    {
        ", ": null
    },
    {
        "Scotty Moore": "scotty moore"
    },
    {
        ", ": null
    },
    {
        "Luther Perkins": "luther perkins"
    },
    {
        ", and ": null
    },
    {
        "Roy Orbison": "roy orbison"
    },
    {
        ". By the 1950s, ": null
    },
    {
        "tremolo": "tremolo"
    },
    {
        ", vibrato and ": null
    },
    {
        "reverb": "reverb"
    },
    {
        " were available as built-in effects on many ": null
    },
    {
        "guitar amplifier": "guitar amplifier"
    },
    {
        "s. Both ": null
    },
    {
        "Premier": "premier"
    },
    {
        " and Gibson built ": null
    },
    {
        "tube-powered amps": "guitar amplifiervacuum tube amplifiers"
    },
    {
        " with spring reverb. ": null
    },
    {
        "Fender": "fender musical instruments corporation"
    },
    {
        " began manufacturing the tremolo amps Tremolux in 1955 and Vibrolux in 1956. Hunter, D . . Hal Leonard. p.  11–13.     ": null
    },
    {
        "Distortion": "distortion"
    },
    {
        " was not an effect originally intended by amplifier manufacturers, but could often easily be achieved by overdriving the power supply in early ": null
    },
    {
        "tube amplifier": "tube amplifier"
    },
    {
        "s. In the 1950s, guitarists began deliberately increasing ": null
    },
    {
        "gain": "gain"
    },
    {
        " beyond its intended levels to achieve warm distorted sounds.  Among the first musicians to experiment with distortion were ": null
    },
    {
        "Willie Johnson": "willie johnson"
    },
    {
        " of ": null
    },
    {
        "Howlin Wolf": "howlin wolf"
    },
    {
        ", ": null
    },
    {
        "Goree Carter": "goree carter"
    },
    {
        ", ": null
    },
    {
        "Robert Palmer": "robert palmer"
    },
    {
        ", Church of the Sonic Guitar , pp.  13–38 in Anthony DeCurtis, Present Tense, ": null
    },
    {
        "Duke University Press": "duke university press"
    },
    {
        ", 1992, p. 19. . ": null
    },
    {
        "Joe Hill Louis": "joe hill louis"
    },
    {
        ",   ": null
    },
    {
        "Ike Turner": "ike turner"
    },
    {
        ",  ": null
    },
    {
        "Guitar Slim": "guitar slim"
    },
    {
        ",  and ": null
    },
    {
        "Chuck Berry": "chuck berry"
    },
    {
        ".      In 1954 ": null
    },
    {
        "Pat Hare": "pat hare"
    },
    {
        " produced heavily distorted ": null
    },
    {
        "power chords": "power chord"
    },
    {
        "for several recordings , creating a grittier, nastier, more ferocious electric guitar sound, ": null
    },
    {
        "Robert Palmer": "robert palmer"
    },
    {
        ", Church of the Sonic Guitar , pp.  13–38 in Anthony DeCurtis, Present Tense, ": null
    },
    {
        "Duke University Press": "duke university press"
    },
    {
        ", 1992, pp.  24–27. . accomplished by turning the volume knob on his amplifier all the way to the right until the speaker was screaming.  Link Wrays 1958 recording ": null
    },
    {
        "Rumble": "rumble"
    },
    {
        " inspired young musicians such as ": null
    },
    {
        "Pete Townshend": "pete townshend"
    },
    {
        " of ": null
    },
    {
        "The Who": "the who"
    },
    {
        ", ": null
    },
    {
        "Jimmy Page": "jimmy page"
    },
    {
        " of ": null
    },
    {
        "Led Zeppelin": "led zeppelin"
    },
    {
        ", ": null
    },
    {
        "Jeff Beck": "jeff beck"
    },
    {
        ", ": null
    },
    {
        "Dave Davies": "dave davies"
    },
    {
        " of ": null
    },
    {
        "The Kinks": "the kinks"
    },
    {
        ", and ": null
    },
    {
        "Neil Young": "neil young"
    },
    {
        " to explore distortion by various means.  In 1966, the British company ": null
    },
    {
        "Marshall Amplification": "marshall amplification"
    },
    {
        " began producing the Marshall 1963, a guitar amplifier capable of producing the distorted crunch that rock musicians were starting to seek.            The electronic ": null
    },
    {
        "transistor": "transistor"
    },
    {
        " finally made it possible to cram the aural creativity of the recording studio into small, highly portable stompbox units. Transistors replaced ": null
    },
    {
        "vacuum tubes": "vacuum tubes"
    },
    {
        ", allowing for much more compact formats and greater stability. The first transistorized guitar effect was the 1962 Maestro Fuzz Tone pedal, which became a sensation after its use in the 1965 Rolling Stones hit ": null
    },
    {
        " Satisfaction": "satisfaction"
    },
    {
        " .       Warwick Electronics manufactured the first ": null
    },
    {
        "wah-wah pedal": "wah-wah pedal"
    },
    {
        ", The Clyde McCoy, in 1967 and that same year Jim Morris of Kelsey-Morris Sound developed the first ": null
    },
    {
        "octave effect": "octave effect"
    },
    {
        ", which Jimi Hendrix named Octavio . In 1968, ": null
    },
    {
        "Univox": "univox"
    },
    {
        " began marketing Shin-eis ": null
    },
    {
        "Uni-Vibe": "uni-vibe"
    },
    {
        " pedal, an effect designed by noted audio engineer Fumio Mieda that mimicked the odd ": null
    },
    {
        "phase shift": "phase shift"
    },
    {
        " and ": null
    },
    {
        "chorus": "chorus effect"
    },
    {
        " effects of the ": null
    },
    {
        "Leslie rotating speakers": "leslie rotating speaker"
    },
    {
        "used in ": null
    },
    {
        "Hammond organ": "hammond organ"
    },
    {
        "s. The pedals soon became favorite effects of guitarists ": null
    },
    {
        "Jimi Hendrix": "jimi hendrix"
    },
    {
        " and ": null
    },
    {
        "Robin Trower": "robin trower"
    },
    {
        ". Upon first hearing the Octavia, Hendrix allegedly rushed back to the studio and immediately used it to record the guitar solos on ": null
    },
    {
        "Purple Haze": "purple haze"
    },
    {
        " and ": null
    },
    {
        "Fire": "fire"
    },
    {
        " .  In 1976, ": null
    },
    {
        "Roland": "roland corporation"
    },
    {
        " subsidiary ": null
    },
    {
        "Boss Corporation": "boss corporation"
    },
    {
        " released the CE-1 Chorus Ensemble, the first ": null
    },
    {
        "chorus pedal": "chorus pedal"
    },
    {
        ", created by taking a chorus circuit from an ": null
    },
    {
        "amplifier": "amplifier"
    },
    {
        " and putting it into a ": null
    },
    {
        "stompbox": "stompbox"
    },
    {
        ". , ": null
    },
    {
        "Reverb.com": "reverb.com"
    },
    {
        " By the mid-1970s a variety of solid-state effects pedals including ": null
    },
    {
        "flanger": "flanger"
    },
    {
        "s, chorus pedals, ": null
    },
    {
        "ring modulators": "ring modulator"
    },
    {
        "and ": null
    },
    {
        "phase shifters": "phase shifter"
    },
    {
        "were available. Hunter, D . . Hal Leonard. p.  11–15.         In the 1980s, digital ": null
    },
    {
        "rackmount": "effects unitrackmounts"
    },
    {
        " units began replacing stompboxes as the effects format of choice. Often musicians would record dry , unaltered tracks in the studio and effects would be added in post-production. The success of ": null
    },
    {
        "Nirvanas": "nirvana"
    },
    {
        "1991 album  Nevermind  helped to re-ignite interest in stompboxes. Some ": null
    },
    {
        "grunge": "grunge"
    },
    {
        " guitarists would chain several fuzz pedals together and plug them into a ": null
    },
    {
        "tube amplifier": "tube amplifier"
    },
    {
        ".  Throughout the 1990s, musicians committed to a ": null
    },
    {
        "lo-fi": "lo-fi music"
    },
    {
        " aesthetic such as ": null
    },
    {
        "J Mascis": "j mascis"
    },
    {
        " of ": null
    },
    {
        "Dinosaur Jr.": "dinosaur jr."
    },
    {
        ", ": null
    },
    {
        "Stephen Malkmus": "stephen malkmus"
    },
    {
        " of ": null
    },
    {
        "Pavement": "pavement"
    },
    {
        " and ": null
    },
    {
        "Robert Pollard": "robert pollard"
    },
    {
        " of ": null
    },
    {
        "Guided by Voices": "guided by voices"
    },
    {
        " continued to use ": null
    },
    {
        "analog": "analogue electronics"
    },
    {
        " effects pedals.        Effects and effects units—stompboxes in particular—have been celebrated by pop and rock musicians in album titles, songs and band names. The ": null
    },
    {
        "Big Muff": "big muff"
    },
    {
        ", a ": null
    },
    {
        "fuzzbox": "distortion"
    },
    {
        " manufactured by ": null
    },
    {
        "Electro-Harmonix": "electro-harmonix"
    },
    {
        ",  is commemorated by the ": null
    },
    {
        "Depeche Mode": "depeche mode"
    },
    {
        " song ": null
    },
    {
        "Big Muff": "speak  &  spell"
    },
    {
        " and the ": null
    },
    {
        "Mudhoney": "mudhoney"
    },
    {
        " EP": "extended play"
    },
    {
        "  Superfuzz Bigmuff . ": null
    },
    {
        "Nine Inch Nails": "nine inch nails"
    },
    {
        ", ": null
    },
    {
        "Pink Floyd": "pink floyd"
    },
    {
        ", ": null
    },
    {
        "George Harrison": "george harrison"
    },
    {
        ", ": null
    },
    {
        "They Might Be Giants": "they might be giants"
    },
    {
        " and ": null
    },
    {
        "Joy Division": "joy division"
    },
    {
        " are among the many musicians who have referenced effects units in their music.                  Distortion effects create warm, gritty, and fuzzy sounds by ": null
    },
    {
        "clipping": "clipping"
    },
    {
        " an instruments ": null
    },
    {
        "audio signal": "audio signal"
    },
    {
        ", which ": null
    },
    {
        "distorts": "distortion"
    },
    {
        " the shape of its ": null
    },
    {
        "wave form": "wave form"
    },
    {
        " and adds ": null
    },
    {
        "overtone": "overtone"
    },
    {
        "s. Distortion effects are sometimes called ": null
    },
    {
        "gain": "gain"
    },
    {
        " effects, as distorted guitar sounds were first achieved by increasing the electric power supply, e.g. gain, to ": null
    },
    {
        "tube amplifier": "tube amplifier"
    },
    {
        "s.   Aikin, Jim . , Hal Leonard. p. 171.      Distortion and overdrive: Distortion and overdrive units re-shape or clip an ": null
    },
    {
        "audio signals": "audio signal"
    },
    {
        " wave form": "wave form"
    },
    {
        " so that it has flattened peaks, creating warm sounds by adding ": null
    },
    {
        "harmonics": "harmonics"
    },
    {
        " or gritty sounds by adding ": null
    },
    {
        "inharmonic": "inharmonic"
    },
    {
        " overtones. In ": null
    },
    {
        "tube amplifiers": "guitar amplifier"
    },
    {
        ", distortion is created by compressing the instruments out-going ": null
    },
    {
        "electrical signal": "signal"
    },
    {
        " in ": null
    },
    {
        "vacuum tubes": "vacuum tube"
    },
    {
        "or valves . Distortion pedals produce perfectly flattened peaks or hard clipping. Overdrive pedals produce soft tube-like distortion by compressing the sine wave without completely flattening it. Much like tube amps, overdrive units produce clean sounds at quieter volumes and distorted warm sounds at louder volumes. Distortion and overdrive pedals may either be ": null
    },
    {
        "transistor": "transistor"
    },
    {
        "-based or digital.   While distortion pedals are most associated with electric guitar, they are also used with bass guitar , ": null
    },
    {
        "Hammond organ": "hammond organ"
    },
    {
        " and ": null
    },
    {
        "electric piano": "electric piano"
    },
    {
        ".   Distortion and overdrive effects: ": null
    },
    {
        "Boss DS-1": "boss ds-1"
    },
    {
        " Distortion, ": null
    },
    {
        "Ibanez Tube Screamer": "ibanez tube screamer"
    },
    {
        ", ": null
    },
    {
        "Marshall ShredMaster": "marshall shredmaster"
    },
    {
        ", ": null
    },
    {
        "MXR Distortion +": "mxr distortion +"
    },
    {
        ", ": null
    },
    {
        "Pro Co RAT": "pro co rat"
    },
    {
        ". ": null
    }
]