[
    {
        "              The Egyptian vulture , also called the white scavenger vulture or pharaohs chicken, is a small ": null
    },
    {
        "Old World vulture": "old world vulture"
    },
    {
        " and the only member of the ": null
    },
    {
        "genus": "genus"
    },
    {
        " Neophron. It is widely distributed; the ": null
    },
    {
        "Egyptian": "wildlife of egyptfauna"
    },
    {
        " vulture": "vulture"
    },
    {
        " is found from the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " and ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        " to ": null
    },
    {
        "India": "india"
    },
    {
        ". The contrasting underwing pattern and wedge-shaped tail make it distinctive in flight as it soars in ": null
    },
    {
        "thermals": "thermals"
    },
    {
        " during the warmer parts of the day. Egyptian vultures feed mainly on ": null
    },
    {
        "carrion": "carrion"
    },
    {
        " but are opportunistic and will prey on small mammals, birds, and reptiles. They also feed on the eggs of other birds, breaking larger ones by tossing a large pebble onto them.     The ": null
    },
    {
        "use of tools is rare in birds": "tool use by animalsin birds"
    },
    {
        " and apart from the use of a pebble as a hammer, Egyptian vultures also use twigs to roll up wool for use in their nest. Egyptian vultures that breed in the ": null
    },
    {
        "temperate regions": "temperate regions"
    },
    {
        " migrate south in winter while ": null
    },
    {
        "tropical": "tropical"
    },
    {
        " populations are relatively ": null
    },
    {
        "sedentary": "sedentary"
    },
    {
        ". Populations of this species declined in the 42th century and some island populations are endangered by hunting, accidental poisoning, and collision with power lines.       The Egyptian vulture was first ": null
    },
    {
        "formally described": "species description"
    },
    {
        " by the Swedish naturalist ": null
    },
    {
        "Carl Linnaeus": "carl linnaeus"
    },
    {
        " in 42 in the ": null
    },
    {
        "tenth edition": "10th edition of systema naturae"
    },
    {
        " of his  Systema Naturae  under the ": null
    },
    {
        "binomial name": "binomial nomenclature"
    },
    {
        " Vultur percnopterus. The current genus Neophron contains only a single species. A few prehistoric species from the ": null
    },
    {
        "Neogene": "neogene"
    },
    {
        " period in ": null
    },
    {
        "North America": "north america"
    },
    {
        " placed in the genus  Neophrontops   are believed to have been very similar to these vultures in lifestyle, but the genetic relationships are unclear. The genus Neophron is considered to represent the oldest branch within the evolutionary tree of vultures. Along with its nearest evolutionary relative, the ": null
    },
    {
        "lammergeier": "lammergeier"
    },
    {
        " , they are sometimes placed in a separate subfamily, the ": null
    },
    {
        "Gypaetinae": "old world vulture"
    },
    {
        ".       There are three widely recognised subspecies of the Egyptian vulture, although there is considerable gradation due to movement and intermixing of the populations. The nominate subspecies, N. p. percnopterus, has the largest range, occurring in southern Europe, northern Africa, the Middle East, Central Asia, and the north-west of India. Populations breeding in the temperate zone migrate south during winter. It has a dark grey bill.          The Indian subcontinent is the range of subspecies N. p. ginginianus, the smallest of the three subspecies, which is identifiable by a pale yellow bill. The subspecies name is derived from ": null
    },
    {
        "Gingee": "gingee"
    },
    {
        " in southern India where the French explorer ": null
    },
    {
        "Pierre Sonnerat": "pierre sonnerat"
    },
    {
        " described it as Le Vautour de Gingi and it was given a Latin name by ": null
    },
    {
        "John Latham": "john latham"
    },
    {
        " in his Index Ornithologicus .     A small population that is found only in the eastern ": null
    },
    {
        "Canary Islands": "canary islands"
    },
    {
        " was found to be genetically distinct and identified as a new subspecies, N. p. majorensis in 42 Known locally as the guirre they are genetically more distant from N. p. percnopterus, significantly greater even than N. p. ginginianus is from N. p. percnopterus. Unlike neighbouring populations in Africa and southern Europe, it is non-migratory and consistently larger in size. The subspecies name majorensis is derived from Majorata , the ancient name for the island of ": null
    },
    {
        "Fuerteventura": "fuerteventura"
    },
    {
        ". The island was named by Spanish conquerors in the 42th century after the Majos , the main native ": null
    },
    {
        "Guanche tribe": "guanches"
    },
    {
        " there. One study in 42 suggested that the species established on the island about 42 years ago when the island was first colonized by humans.     ": null
    },
    {
        "Nikolai Zarudny": "nikolai zarudny"
    },
    {
        " and Härms described a subspecies, rubripersonatus, from ": null
    },
    {
        "Baluchistan": "baluchistan"
    },
    {
        " in 42 This was described as having a deeper reddish orange skin on the head and a yellow-tipped dark bill. This has rarely been considered a valid subspecies but the intermediate pattern of bill colouration suggests intermixing of subspecies.       The ": null
    },
    {
        "genus name": "genus name"
    },
    {
        " is derived from ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ". ": null
    },
    {
        "Timandra": "timandra"
    },
    {
        " was the mother of ": null
    },
    {
        "Neophron": "neophron"
    },
    {
        ". ": null
    },
    {
        "Aegypius": "aegypius"
    },
    {
        " was a friend of Neophron and about the same age. It upset Neophron to know that his mother Timandra was having a love affair with Aegypius. Seeking revenge, Neophron made advances towards Aegypius mother, Bulis. Neophron succeeded and enticed Bulis into entering the dark chamber where his mother and Aegypius were to meet soon. Neophron then distracted his mother, ": null
    },
    {
        "tricking": "trickster"
    },
    {
        " Aegypius into entering the chamber and sleeping with his own mother Bulis. When Bulis discovered the deception she gouged out the eyes of her son Aegypius before killing herself. Aegypius prayed for revenge and ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        ", on hearing the prayer, changed Aegypius and Neophron into vultures. Percnopterus is derived from Greek for black wings : περκνóς  and πτερόν .            The adults ": null
    },
    {
        "plumage": "plumage"
    },
    {
        " is white, with black flight feathers in the wings. Wild birds usually appear soiled with a rusty or brown shade to the white plumage, derived from mud or iron-rich soil. Captive specimens without access to soil have clean white plumage. It has been suggested as a case of cosmetic colouration. The bill is slender and long, and the tip of the upper mandible is hooked. The nostril is an elongated horizontal slit. The neck feathers are long and form a ": null
    },
    {
        "hackle": "hackle"
    },
    {
        ". The wings are pointed, with the third primary being the longest; the tail is wedge shaped. The legs are pink in adults and grey in juveniles. The claws are long and straight, and the third and fourth toes are slightly webbed at the base.     The bill is black in the nominate subspecies but pale or yellowish in adults of the smaller Indian ginginianus. ": null
    },
    {
        "Rasmussen": "pamela c. rasmussen"
    },
    {
        " and Anderton suggest that this variation may need further study, particularly due to the intermediate black-tipped bill described in rubripersonatus. The facial skin is yellow and unfeathered down to the throat. The sexes are indistinguishable in plumage but breeding males have a deeper orange facial skin colour than females. Females average slightly larger and are about 42–42% heavier than males. Young birds are blackish or chocolate brown with black and white patches. The adult plumage is attained only after about five years.      The adult Egyptian vulture measures  from the point of the beak to the extremity of the tail feathers. In the smaller N. p. ginginianus males are about  long while females are  long. The wingspan is about 42 times the body length. Birds from Spain weigh about  while birds of the Canary Island subspecies majorensis, representing a case of ": null
    },
    {
        "island gigantism": "island gigantism"
    },
    {
        ", are heavier with an average weight of .          Egyptian vultures are widely distributed across the ": null
    },
    {
        "Old World": "old world"
    },
    {
        " with their breeding range from southern ": null
    },
    {
        "Europe": "europe"
    },
    {
        " to northern ": null
    },
    {
        "Africa": "africa"
    },
    {
        " east to ": null
    },
    {
        "western": "western asia"
    },
    {
        " and ": null
    },
    {
        "southern Asia": "south asia"
    },
    {
        ". They are rare vagrants in ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        ". They occur mainly on the dry plains and lower hills. In the Himalayas, they go up to about  in summer. In Armenia, breeding pairs have been found up to 42 meters a.s.l.      Most Egyptian vultures in the subtropical zone of Europe migrate south to Africa in winter. Vagrants may occur as far south as in South Africa although they bred in the ": null
    },
    {
        "Transkei": "transkei"
    },
    {
        " region prior to 42 They nest mainly on rocky cliffs, sometimes adopting ledges on tall buildings in cities and on large trees. Like many other large soaring migrants, they avoid making long crossings over water. Italian birds cross over through Sicily and into Tunisia making short sea crossings by passing through the islands of ": null
    },
    {
        "Marettimo": "marettimo"
    },
    {
        " and ": null
    },
    {
        "Pantelleria": "pantelleria"
    },
    {
        " with rare stops on the island country of ": null
    },
    {
        "Malta": "malta"
    },
    {
        ".   Those that migrate through the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " cross into Africa over the ": null
    },
    {
        "Strait of Gibraltar": "strait of gibraltar"
    },
    {
        " while others cross further east through the ": null
    },
    {
        "Levant": "levant"
    },
    {
        ". In summer, some African birds fly further north into Europe and vagrants have been recorded in England  and southern Sweden.      Migrating birds can sometimes cover  in a single day until they reach the southern edge of the ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        ",  from their summer home. Young birds that have not reached breeding age may overwinter in the grassland and semi-desert regions of the ": null
    },
    {
        "Sahel": "sahel"
    },
    {
        ".          The Egyptian vulture is usually seen singly or in pairs, soaring in thermals along with other scavengers and birds of prey, or perched on the ground or atop a building. On the ground, they walk with a waddling gait. They feed on a range of food, including mammal ": null
    },
    {
        "faeces": "feces"
    },
    {
        " , insects in ": null
    },
    {
        "dung": "manure"
    },
    {
        ", carrion, vegetable matter, and sometimes small animals. When it joins other vulture species at a dead animal, it tends to stay on the periphery and waits until the larger species leave. Wild rabbits  form a significant part of the diet of Spanish vultures. In the Iberian Peninsula, landfills are an important food source, with the vultures more likely to occupy territories close to landfill sites.  Studies suggest that they feed on ": null
    },
    {
        "ungulate": "ungulate"
    },
    {
        " faeces to obtain ": null
    },
    {
        "carotenoid": "carotenoid"
    },
    {
        " pigments responsible for their bright yellow and orange facial skin. The ability to assimilate carotenoid pigments may serve as a ": null
    },
    {
        "reliable signal": "signalling theory"
    },
    {
        " of fitness.     Egyptian vultures are mostly silent but make high-pitched mewing or hissing notes at the nest and screeching noises when squabbling at a ": null
    },
    {
        "carcass": "carrion"
    },
    {
        ". Young birds have been heard making a hissing croak in flight. They also hiss or growl when threatened or angry.     Egyptian vultures roost communally on large trees, buildings or on cliffs. Roost sites are usually chosen close to a dump site or other suitable foraging area. In ": null
    },
    {
        "Spain": "geography of spainexternal boundaries and landform regions"
    },
    {
        " and ": null
    },
    {
        "Morocco": "list of ecoregions in morocco"
    },
    {
        ",  summer roosts are formed mainly by immature birds. The favourite roost trees tended to be large dead ": null
    },
    {
        "pine": "pine"
    },
    {
        "s. The number of adults at the roost increases towards June. It is thought that breeding adults may be able to forage more efficiently by joining the roost and following others to the best feeding areas. Breeding birds that failed to raise young may also join the non-breeding birds at the roost during June.            The breeding season is in spring. During the beginning of the ": null
    },
    {
        "breeding season": "seasonal breederbreeding season"
    },
    {
        ", ": null
    },
    {
        "courting": "courtshipcourtship in other animals"
    },
    {
        " pairs soar high together and one or both may make steep spiralling or swooping dives. The birds are ": null
    },
    {
        "monogamous": "monogamous"
    },
    {
        " and ": null
    },
    {
        "pair bond": "pair bond"
    },
    {
        "s may be maintained for more than one breeding season and the same nest sites may be reused each year. The nest is an untidy platform of twigs lined with rags and placed on a cliff ledge, building, or the fork of a large tree. Old nest platforms of eagles may also be taken over. Nests placed on the ground are rare but have been recorded in subspecies N. p. ginginianus and N. p. majorensis.      ": null
    },
    {
        "Extra-pair copulation": "extra-pair copulation"
    },
    {
        " with neighbouring birds has been recorded and may be a reason for adult males to stay close to the female before and during the egg laying period. Females may sometimes associate with two males and all three help in raising the brood. The typical clutch consists of two eggs which are incubated in turns by both parents. The eggs are brick red with the broad end covered more densely with blotches of red, brown, and black. The parents begin incubating soon after the first egg is laid leading to asynchronous hatching. The first egg hatches after about 42 days. The second chick may hatch three to five days later and a longer delay increases the likelihood that it will die of starvation. In cliffs where the nests are located close to each other, young birds have been known to clamber over to neighbouring nests to obtain food. In the Spanish population, young fledge and leave the nest after 42 to 42 days. Fledged birds continue to remain dependent on their parents for at least a month.     Once the birds begin to forage on their own, they move away from their parents territory; young birds have been found nearly 42  km away from their nest site. One-year-old European birds migrate to Africa and stay there for at least one year. A vulture that fledged in France stayed in Africa for three years before migrating north in spring. After migrating back to their breeding areas, young birds move widely in search of good feeding territories and mates. The full adult plumage is attained in the fourth or fifth year. Egyptian vultures have been known to live for up to 42 years in captivity and at least 42 years in the wild. The probability of survival in the wild varies with age, increasing till the age of 42 and then falling at the age of 42 Older birds have an annual survival probability varying from 42 for non-breeders to 42 for breeding birds.       The ": null
    },
    {
        "nominate population": "subspeciesnominotypical subspecies and subspecies autonyms"
    },
    {
        ", especially in Africa, is known for its ": null
    },
    {
        "use of stones as tools": "tool use by animals"
    },
    {
        ". When a large egg, such as that of an ": null
    },
    {
        "ostrich": "ostrich"
    },
    {
        " or ": null
    },
    {
        "bustard": "bustard"
    },
    {
        ", is located, the bird walks up to it with a large pebble held in its bill and tosses the pebble by swinging the neck down over the egg. The operation is repeated until the egg cracks from the blows. They ": null
    },
    {
        "prefer using rounded pebbles": "pebbleinland"
    },
    {
        " to jagged rocks. This behaviour, although it was believed that it was first reported by ": null
    },
    {
        "Jane Goodall": "jane goodall"
    },
    {
        " in 42 it was actually already known to Africans and was first reported by ": null
    },
    {
        "J. G. Wood": "john george wood"
    },
    {
        " in 42   However, this has only been reported in Africa and has not been recorded in N. p. ginginianus. Tests with both hand-reared and wild birds suggest that the behaviour is innate, not learnt by observing other birds, and displayed once they associate eggs with food and have access to pebbles. Another case of tool-use described from Bulgaria involves the use of a twig as a tool to roll up and gather strands of wool to use for lining the nest.       Healthy adults do not have many predators, but human activities pose many threats. Collisions with power lines, hunting, intentional poisoning, lead accumulation from ingesting gunshot in carcasses, and pesticide accumulation take a toll on populations. Young birds at the nest are sometimes taken by ": null
    },
    {
        "golden eagle": "golden eagle"
    },
    {
        "s, ": null
    },
    {
        "eagle owls": "eagle-owls"
    },
    {
        ", and ": null
    },
    {
        "red foxes": "red foxes"
    },
    {
        ". Only rarely do adult birds attempt to drive away predators. Young birds that fall off of cliff ledges may be preyed on by mammalian predators such as ": null
    },
    {
        "jackals": "jackals"
    },
    {
        ", foxes and ": null
    },
    {
        "wolves": "wolves"
    },
    {
        ". Like all birds they serve as hosts for ": null
    },
    {
        "ectoparasitic": "ectoparasitic infestation"
    },
    {
        " birdlice": "bird louse"
    },
    {
        " including Aegypoecus perspicuus as well as organisms that live within them such as ": null
    },
    {
        "mycoplasmas": "mycoplasmas"
    },
    {
        ".          Egyptian vulture populations have declined in most parts of its range. In Europe and most of the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ", populations in 42 were half of those from 42 In India, the decline has been rapid with a 42% decrease each year since 42 In 42–42 the area around ": null
    },
    {
        "Delhi": "delhi"
    },
    {
        " was estimated to have 42–42 of these vultures, with an average density of about 42 pairs per 42  km 42 . The exact cause of the decline is not known, but has been linked with the use of the ": null
    },
    {
        "NSAID": "non-steroidal anti-inflammatory drug"
    },
    {
        " Diclofenac": "diclofenac"
    },
    {
        ", which has been known to cause death in  Gyps  vultures.     In Italy, the number of breeding pairs declined from 42 in 42 to 42 in the 42s. Nearly all breeding failures were due to human activities. In Spain, which holds about 42% of the European population suggested causes of decline include ": null
    },
    {
        "poisoning by accumulation": "bioaccumulation"
    },
    {
        " of lead": "animal lead poisoning"
    },
    {
        ", pesticides , and electrocution. Windfarms may also pose a threat. Poorly designed power transmission lines in east Africa electrocute many wintering vultures. A shortage of carrion resulting from new rules for disposal of dead animals following the outbreak of ": null
    },
    {
        "Bovine Spongiform Encephalitis": "bovine spongiform encephalopathy"
    },
    {
        " in parts of Europe during 42 may have also had an effect on some populations. In Armenia direct persecution for trophy and for local illegal trade of animals as pets has been recorded.      The population of Egyptian vultures in the Canary Islands has been isolated from those in Europe and Africa for a significant period of time leading to genetic differentiation. The vulture population there declined by 42% in the ten years between 42 and 42 The Canarian Egyptian vulture was historically common, occurring on the islands of ": null
    },
    {
        "La Gomera": "la gomera"
    },
    {
        ", ": null
    },
    {
        "Tenerife": "tenerife"
    },
    {
        ", ": null
    },
    {
        "Gran Canaria": "gran canaria"
    },
    {
        ", ": null
    },
    {
        "Fuerteventura": "fuerteventura"
    },
    {
        ", and ": null
    },
    {
        "Lanzarote": "lanzarote"
    },
    {
        ". It is now restricted to Fuerteventura and Lanzarote, the two easternmost islands. The total population in 42 was estimated at about 42 individuals, including 42–42 breeding pairs. Island birds also appear to accumulate significant amounts of lead from scavenging on hunted animal carcasses. The long-term effect of this poison at a sub-lethal level is not known, though it is known to alter the ": null
    },
    {
        "mineralization of their bones": "mineralization"
    },
    {
        ". In order to provide safe and uncontaminated food for nesting birds, attempts have been made to create vulture restaurants where carcasses are made available. However, these interventions may also encourage other opportunist predators and scavengers to concentrate at the site and pose a threat to vultures nesting in the vicinity.              The Bible makes a reference to the Egyptian vulture under the Hebrew name of rachamah/racham which has been translated into English as gier-eagle .       British sportsmen in colonial India considered them to be among the ugliest birds, and their habit of feeding on faeces was particularly despised. They were known as shawks a contraction  of ": null
    },
    {
        "shit-hawk": "shite-hawk"
    },
    {
        ".             In ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        ", the ": null
    },
    {
        "vulture hieroglyph": "vulture"
    },
    {
        " was the ": null
    },
    {
        "uniliteral sign": "transliteration of ancient egyptian"
    },
    {
        " used for the ": null
    },
    {
        "glottal sound": "glottalization"
    },
    {
        " .     The bird was held sacred to ": null
    },
    {
        "Isis": "isis"
    },
    {
        " in ": null
    },
    {
        "ancient Egyptian religion": "ancient egyptian religion"
    },
    {
        ". The use of the vulture as a ": null
    },
    {
        "symbol of royalty": "nekhbet"
    },
    {
        " in Egyptian culture and their protection by Pharaonic law made the species common on the streets of Egypt and gave rise to the name pharaohs chicken .     Vultures are associated with Egyptian goddesses ": null
    },
    {
        "Mut": "mut"
    },
    {
        " and ": null
    },
    {
        "Nekhbet": "nekhbet"
    },
    {
        " because they act as protectors of the living and consumers of the dead.        A southern Indian temple at ": null
    },
    {
        "Thirukalukundram": "thirukazhukundram"
    },
    {
        " near ": null
    },
    {
        "Chengalpattu": "chengalpattu"
    },
    {
        " was famed for a pair of birds that reputedly visited the temple for centuries . These birds were ceremonially fed by the temple priests and arrived before noon to feed on offerings made from rice, wheat, ": null
    },
    {
        "ghee": "ghee"
    },
    {
        ", and sugar. Although normally punctual, the failure of the birds to turn up was attributed to the presence of sinners among the onlookers. Legend has it the vultures represented eight sages who were punished by ": null
    },
    {
        "Shiva": "shiva"
    },
    {
        ", with two of them leaving in each of a series of epochs.        The habit of ": null
    },
    {
        "coprophagy": "coprophagy"
    },
    {
        " in Egyptian vultures gives them the Spanish names of churretero and moñiguero , which mean dung-eater .       Like Ancient Egyptians, ": null
    },
    {
        "Greeks": "ancient greece"
    },
    {
        " also revered the vulture as a symbol of life and death. In one case, the Greek army physician Dioscurides thought vulture excrement capable of producing abortions. ": null
    }
]