[
    {
        "                       An eighth note  or a quaver  is a musical note played for one eighth the duration of a ": null
    },
    {
        "whole note": "whole note"
    },
    {
        " , hence the name. This amounts to twice the value of the ": null
    },
    {
        "sixteenth note": "sixteenth note"
    },
    {
        " . It is half the duration of a ": null
    },
    {
        "quarter note": "quarter note"
    },
    {
        " , one quarter the duration of a ": null
    },
    {
        "half note": "half note"
    },
    {
        " , one eighth the duration of ": null
    },
    {
        "whole note": "whole note"
    },
    {
        " , one sixteenth the duration of a ": null
    },
    {
        "double whole note": "double whole note"
    },
    {
        " , and one thirty-second the duration of a ": null
    },
    {
        "longa": "longa"
    },
    {
        ". It is the equivalent of the fusa in ": null
    },
    {
        "mensural notation": "mensural notation"
    },
    {
        "      Eighth notes are notated with an oval, filled-in note head and a straight ": null
    },
    {
        "note stem": "note stem"
    },
    {
        " with one flag note flag . The stem is placed to the right of the notehead and extends upwards if the notehead lies below the middle line of the staff, and to the left of the notehead extending downwards if the notehead lies on or above the middle line of the staff, in instrumental notation. In vocal music, a middle-line notehead extends upward instead of downward. A related symbol is the eighth rest , which denotes a silence for the same duration .     In ": null
    },
    {
        "Unicode": "unicode"
    },
    {
        ", the symbols U42A and U42B are an eighth note and beamed pair of eighth notes respectively. The two symbols are inherited from the early 42s ": null
    },
    {
        "code page 42": "code page 437"
    },
    {
        ", where they occupied codes 42 and 42 respectively. Additions to the Unicode standard also incorporated additional eighth note depictions from Japanese ": null
    },
    {
        "emoji": "emoji"
    },
    {
        " sets: ascending eighth notes , descending eighth notes , a graphical generic musical note generally depicted as an eighth note , and three unconnected eighth notes in sequence . Unicodes ": null
    },
    {
        "Musical Symbols": "musical symbols"
    },
    {
        " block includes several variations of the eighth note; these are the versions intended to be used in computerized musical notation .     Eighth notes in , , , and  are beamed three eighth notes at a time. A single eighth note is always stemmed with a flag, while two or more are usually beamed in groups ": null
    }
]