[
    {
        "        Eisenach  is a ": null
    },
    {
        "town": "towngermany"
    },
    {
        " in ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        " with 42 inhabitants, located  west of ": null
    },
    {
        "Erfurt": "erfurt"
    },
    {
        ",  southeast of ": null
    },
    {
        "Kassel": "kassel"
    },
    {
        " and  northeast of ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        ". It is the main urban centre of western Thuringia and bordering northeastern ": null
    },
    {
        "Hessian": "hesse"
    },
    {
        " regions, situated near the former ": null
    },
    {
        "Inner German border": "inner german border"
    },
    {
        ". A major attraction is ": null
    },
    {
        "Wartburg": "wartburg"
    },
    {
        " castle, which has been a ": null
    },
    {
        "UNESCO world heritage": "unesco world heritage"
    },
    {
        " site since 42     Eisenach was an early capital of Thuringia in the 42th and 42th centuries. St.": null
    },
    {
        "Elizabeth": "elizabeth of hungary"
    },
    {
        " lived at the court of the ": null
    },
    {
        "Ludowingians": "ludowingians"
    },
    {
        " here between 42 and 42 Later, ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        " came to Eisenach and translated the ": null
    },
    {
        "Bible": "luther bible"
    },
    {
        " into German. In 42 ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " was born here. During the ": null
    },
    {
        "early modern period": "early modern period"
    },
    {
        ", Eisenach was a residence of the Ernestine ": null
    },
    {
        "Wettins": "house of wettin"
    },
    {
        " and was visited by numerous representatives of ": null
    },
    {
        "Weimar classicism": "weimar classicism"
    },
    {
        " like ": null
    },
    {
        "Johann Wolfgang Goethe": "johann wolfgang goethe"
    },
    {
        ".  In 42 the ": null
    },
    {
        "SDAP": "social democratic workers party of germany"
    },
    {
        ", one of the two precursors of the ": null
    },
    {
        "Social Democratic Party of Germany": "social democratic party of germany"
    },
    {
        " was founded in Eisenach.     Car production is an important industry in Eisenach. The  Automobilwerk Eisenach  was founded in 42 In the ": null
    },
    {
        "German Democratic Republic": "german democratic republic"
    },
    {
        ", the ": null
    },
    {
        "Wartburg": "wartburg"
    },
    {
        " was produced here.     Eisenach is situated on the ": null
    },
    {
        "Hörsel": "hörsel"
    },
    {
        " river, a tributary of the ": null
    },
    {
        "Werra": "werra"
    },
    {
        " between the ": null
    },
    {
        "Thuringian Forest": "thuringian forest"
    },
    {
        " in the south, the ": null
    },
    {
        "Hainich": "hainich"
    },
    {
        " mountains in the north-east and the ": null
    },
    {
        "East Hesse Highlands": "east hesse highlands"
    },
    {
        " in the north-west.              Eisenachs origin and early history is unknown. An 42th century Frankish settlement near Petersberg hill is regarded as the nucleus of Eisenach. However, there are no written sources about that early period. According to legend, ": null
    },
    {
        "Louis the Springer": "louis the springer"
    },
    {
        " began in 42 to establish ": null
    },
    {
        "Wartburg": "wartburg"
    },
    {
        " castle above the settlement.      In 42 the castle was first mentioned in a Saxon chronicle. Eisenach itself followed in a document dating to 42 where it was referred to as Isinacha .  During the 42s, the town was established by the construction of three independent market settlements around the Saturdays market , the Wednesdays market and the Mondays market . Due to its convenient location at a bottleneck between the ": null
    },
    {
        "Thuringian Forest": "thuringian forest"
    },
    {
        " in the south and the ": null
    },
    {
        "Hainich": "hainich"
    },
    {
        " mountains in the north, Eisenach benefitted from substantial west-east trade along ": null
    },
    {
        "Via Regia": "via regia"
    },
    {
        " from ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " to ": null
    },
    {
        "Erfurt": "erfurt"
    },
    {
        " and ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " and became a rich merchant town. During the second half of the 42th century, the town walls were erected and Eisenach got a planned grid of streets and alleys. In the late 42th century, the Wartburg became the main residence of the ": null
    },
    {
        "Ludowingians": "ludowingians"
    },
    {
        ", making Eisenach a leading place in todays western Thuringia and northern Hesse, which also belonged to the Ludowingian landgraviate. In 42 the legendary ": null
    },
    {
        "Sängerkrieg": "sängerkrieg"
    },
    {
        " supposedly took place at Wartburg castle.     In 42 St. ": null
    },
    {
        "Elizabeth": "elizabeth of hungary"
    },
    {
        " married Landgrave ": null
    },
    {
        "Louis IV": "louis iv, landgrave of thuringia"
    },
    {
        " and she lived in Eisenach or at Wartburg castle until 42  Later, she became the patroness of Thuringia and Hesse.     In 42 the Ludowingians died out which led to the ": null
    },
    {
        "War of the Thuringian Succession": "war of the thuringian succession"
    },
    {
        " between the ": null
    },
    {
        "Wettin": "house of wettin"
    },
    {
        "s and Duchess ": null
    },
    {
        "Sophie": "sophie of thuringia, duchess of brabant"
    },
    {
        " of ": null
    },
    {
        "Brabant": "duchy of brabant"
    },
    {
        ". As a consequence, the landgraviate was divided. Eisenach and the eastern parts went to the Wettins and ": null
    },
    {
        "Kassel": "kassel"
    },
    {
        ", ": null
    },
    {
        "Marburg": "marburg"
    },
    {
        " and the western parts went to Sophie . Eisenach kept a leading position among the Wettins Thuringian cities by becoming their Oberhof , so that their law had to be derived from Eisenachs municipal law and disputes had to be resolved here. The confident citizens of Eisenach fought against the Wettins rule to become a ": null
    },
    {
        "free imperial city": "free imperial city"
    },
    {
        " between 42 and 42 but lost. In the 42th century various crises followed: in 42 a big fire destroyed nearly all the buildings and the ": null
    },
    {
        "Black Death": "black death"
    },
    {
        " killed many inhabitants in 42 and 42 Since 42 Eisenach was no longer a Wettin residence, which led to a decline in urban development. In 42 in the ": null
    },
    {
        "division of Leipzig": "treaty of leipzig"
    },
    {
        " , the town fell to the ": null
    },
    {
        "Ernestine line": "ernestine line"
    },
    {
        " of the Wettins.          Between 42 and 42 the young ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        " attended the St. Georges Latin school in Eisenach in preparation for his following studies at the ": null
    },
    {
        "University of Erfurt": "university of erfurt"
    },
    {
        ". In 42/42 he was hidden by ": null
    },
    {
        "Frederick the Wise": "frederick iii, elector of saxony"
    },
    {
        " at Wartburg castle to protect him from the ": null
    },
    {
        "Imperial ban": "imperial ban"
    },
    {
        ". In that time, Luther translated the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " from Greek into German, in what was an important step both for the ": null
    },
    {
        "German Reformation": "german reformation"
    },
    {
        " and the development of a consistent German standard language.     Luther referred to Eisenach as ein Pfaffennest , since during his time there were 42 monks and nuns per 42 inhabitants.      In 42 there was heavy fighting in the area during the  Bauernkrieg .    In 42 the Lutheran Reformation was implemented in Eisenach. In 42 Eisenach became a ducal residence again for the house of ": null
    },
    {
        "Saxe-Eisenach": "saxe-eisenach"
    },
    {
        ".     ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " was born in Eisenach in 42 His father, ": null
    },
    {
        "Johann Ambrosius Bach": "johann ambrosius bach"
    },
    {
        " worked here as a musician at that time. Other famous composers and musicians associated with Eisenach during that period were ": null
    },
    {
        "Johann Pachelbel": "johann pachelbel"
    },
    {
        ", ": null
    },
    {
        "Johann Christoph Bach": "johann christoph bach"
    },
    {
        " and ": null
    },
    {
        "Georg Philipp Telemann": "georg philipp telemann"
    },
    {
        ". As the Eisenach dukes died out in 42 the town and the state became part of ": null
    },
    {
        "Saxe-Weimar": "saxe-weimar"
    },
    {
        ".  Nevertheless, the cultural life stayed unimpaired. The coterie around the poet  met up with famous personalities like ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        " and ": null
    },
    {
        "Christoph Martin Wieland": "christoph martin wieland"
    },
    {
        " in Eisenach.      From 42 to 42 Eisenach was part of the Duchy of ": null
    },
    {
        "Saxe-Weimar-Eisenach": "grand duchy of saxe-weimar-eisenach"
    },
    {
        ".             In 42 the ": null
    },
    {
        "Wartburg Festival": "wartburg festival"
    },
    {
        " took place in Eisenach, a meeting of students advocating moves towards a more liberal, constitutional state and a ": null
    },
    {
        "unification of Germany": "unification of germany"
    },
    {
        ". The industrial revolution started relatively early in Eisenach. As early as the first half of the 42th century, the first factories were founded. In 42 Eisenach was connected by the ": null
    },
    {
        "Thuringian Railway": "thuringian railway"
    },
    {
        " to ": null
    },
    {
        "Erfurt": "erfurt"
    },
    {
        " and ": null
    },
    {
        "Halle": "halle"
    },
    {
        "/": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " in the east and in 42 to ": null
    },
    {
        "Kassel": "kassel"
    },
    {
        " and ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " in the west. In 42 the ": null
    },
    {
        "Werra Railway": "eisenach–lichtenfels railway"
    },
    {
        " to ": null
    },
    {
        "Lichtenfels": "lichtenfels, bavaria"
    },
    {
        "  was opened.     In August 42 the leading socialists ": null
    },
    {
        "August Bebel": "august bebel"
    },
    {
        " and ": null
    },
    {
        "Wilhelm Liebknecht": "wilhelm liebknecht"
    },
    {
        " founded the ": null
    },
    {
        "SDAP": "social democratic workers party of germany"
    },
    {
        ", one of the two predecessors of todays ": null
    },
    {
        "SPD": "social democratic party of germany"
    },
    {
        " in Eisenach.  The ": null
    },
    {
        "Eisenach Program": "eisenach program"
    },
    {
        " remained the partys main manifesto for the following years. The late 42th and early 42th century was the period with the fastest urban growth in Eisenach. The Fahrzeugfabrik Eisenach , later  Automobilwerk Eisenach , basis of car production in Eisenach, was founded in 42 the first trams ran in 42 the  was erected in 42 and the ": null
    },
    {
        "J. S. Bach museum": "bach house"
    },
    {
        " opened in 42 Tourists also started to arrive in this period, drawn by the pleasing landscape and the various sights within the town.     Between the 42s and 42 Eisenach hosted one of the largest Jewish communities in Thuringia with nearly 42 members at the beginning of the 42th century. Many Jews migrated from the ": null
    },
    {
        "Rhön": "rhön"
    },
    {
        " area around ": null
    },
    {
        "Stadtlengsfeld": "stadtlengsfeld"
    },
    {
        " to Eisenach after their ": null
    },
    {
        "emancipation": "jewish emancipation"
    },
    {
        " in the early 42th century. The new synagogue was built in 42 and destroyed by the Nazis during  Kristallnacht  in November 42 Most Jews emigrated at that time, others were deported to concentration camps and murdered there. Before the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        ", BMW had produced motorcycles in the town. Christopher, John. The Race for Hitlers X-Planes , p.42 In preparation for World War II, new barracks were established in Eisenach and the car industry started the production of military equipment. After 42 around 42 ": null
    },
    {
        "forced labourers": "forced labour under german rule during world war ii"
    },
    {
        "  were pressed to work in the towns factories, where some of them died due to the bad working conditions. Postwar, the managing director of the ": null
    },
    {
        "BMW": "bmw"
    },
    {
        " aircraft engine": "aircraft engine"
    },
    {
        " works, Dr Schaaf, told the Fedden Mission there were as many as 42 working in the town, 42 in a plant inside a hillside turning out ": null
    },
    {
        "BMW 42": "bmw 132"
    },
    {
        " engines and parts for the ": null
    },
    {
        "42": "bmw 801"
    },
    {
        ", the rest in town. Christopher, p.42 The bombings during the war destroyed about 42 housing units and big parts of the car factories, as well as some historic buildings in the town centre, which were rebuilt soon after the war. The US Army arrived in Eisenach on 42 April 42 but the Soviets took over control of the town on 42 July 42 making it Communisms westernmost major town.     Eisenach was part of the ": null
    },
    {
        "GDR": "gdr"
    },
    {
        " after 42 The ": null
    },
    {
        "Inner German border": "inner german border"
    },
    {
        " ran only ten kilometres west of Eisenach and was closed in 42 cutting off parts of Eisenachs traditional hinterland. The location near the border inhibited the further development during the next 42 years and the population declined through that period. Nevertheless, Eisenach remained an important industrial location. The ": null
    },
    {
        "BMW": "bmw"
    },
    {
        " car factory was ": null
    },
    {
        "socialized": "socialization"
    },
    {
        " and under the new name ": null
    },
    {
        "EMW": "eisenacher motorenwerk"
    },
    {
        " produced the ": null
    },
    {
        "Wartburg": "wartburg"
    },
    {
        ", the so-called Mercedes of the East . The deteroriating condition of many historic houses led to a housing shortage during the 42s. The government fought this by demolishing some historic quarters and rebuilding them with  Plattenbau  settlements. The biggest Plattenbau district was built at the northern periphery of Eisenach between 42 and 42 with nearly 42 housing units. In 42 the tramway system was discontinued.     After ": null
    },
    {
        "German reunification": "german reunification"
    },
    {
        " in 42 the economic situation changed. The car factory was taken over by ": null
    },
    {
        "Opel": "opel"
    },
    {
        ", whereas many other factories were closed. On the other hand, Eisenach moved from the inner German border to the centre of the reunified country. Tourism saw significant growth and the Wartburg castle was designated a ": null
    },
    {
        "UNESCO world heritage site": "unesco world heritage site"
    },
    {
        " in 42 Nevertheless, the financial situation of Eisenach remained difficult, unemployment stayed above average and car production suffered from the business problems of Opel.              Eisenach is situated at the northern edge of the ": null
    },
    {
        "Thuringian Forest": "thuringian forest"
    },
    {
        ", at an elevation of about 42 m. The terrain is hilly, to the south also mountainous , with the central ": null
    },
    {
        "Hörsel": "hörsel"
    },
    {
        " valley crossing the town in east-western direction. The ": null
    },
    {
        "Nesse": "nesse"
    },
    {
        " river enters the Hörsel river in Eisenach after forming a valley through the spur of the Hörselberg mountains in the eastern municipal territory. The northern territory around the Neunkirchen, Stregda and Hötzelsroda districts is relatively flat and in agricultural use. Approximately  west of the town centre runs the wide ": null
    },
    {
        "Werra": "werra"
    },
    {
        " valley, where the Hörsel river enters this bigger river near Hörschel district. The southern municipal territory is covered with forest, same as some smaller parts north of the Hörsel river. The ": null
    },
    {
        "Hainich": "hainich"
    },
    {
        " mountains begin  north-east of Eisenach.          Eisenach abuts the districts of ": null
    },
    {
        "Wartburgkreis": "wartburgkreis"
    },
    {
        "  and ": null
    },
    {
        "Werra-Meißner-Kreis": "werra-meißner-kreis"
    },
    {
        " . The municipal border between Eisenach and Herleshausen was part of the ": null
    },
    {
        "inner German border": "inner german border"
    },
    {
        "/": null
    },
    {
        "Iron Curtain": "iron curtain"
    },
    {
        " from 42 to 42     The municipality of Eisenach includes beside the inner town the following rural districts :      The village of Fischbach was incorporated in 42 and is a part of the inner town today.       Eisenach has a ": null
    },
    {
        "humid continental climate": "humid continental climate"
    },
    {
        " or an ": null
    },
    {
        "oceanic climate": "oceanic climate"
    },
    {
        "  according to the ": null
    },
    {
        "Köppen climate classification": "köppen climate classification"
    },
    {
        " system.    Summers are warm and sometimes humid, winters are relatively cold. The towns topography creates a microclimate with mostly adequate air circulation along the west-eastern valley which made Eisenach a resort at the end of the 42th century. Annual precipitation is  with moderate rainfall throughout the year. Light snowfall mainly occurs from December through February, but snow cover does not usually remain for long in the inner town valley.          Eisenach has always been one of the larger towns in Thuringia with 42 to 42 inhabitants during the Middle Ages. By 42 the population rose to 42 and further to 42 as industrialisation started around 42 In 42 the town had 42 inhabitants, 42 in 42 42 in 42 and more than 42 in 42 as the peak was reached. Like the most other east German mid-sized towns, Eisenach has had a shrinking population since 42 It declined to 42 in 42 42 in 42 and 42 in 42 During the last few years , the annual change was . Suburbanization played only a small role in Eisenach. It occurred after reunification for a short time in the 42s, but most of the suburban areas are situated within the administrative town borders.     The birth deficit was 42 in 42 or 42 per 42 inhabitants . The net migration rate was 42 per 42 inhabitants in 42 .  The most important regions of origin of people who have moved to Eisenach are rural areas of Thuringia as well as foreign countries like Poland, Russia, Ukraine, Hungary, Serbia, Romania and Bulgaria.     Like in other eastern German cities, only a small share of Eisenachs population is foreign: circa 42% are non-Germans by citizenship and overall 42% are classified as migrants . Differing from the national average, the biggest groups of migrants in Eisenach are ": null
    },
    {
        "Vietnamese": "vietnamese people in germany"
    },
    {
        ", ": null
    },
    {
        "Russians": "russians in germany"
    },
    {
        " and ": null
    },
    {
        "Ukrainians": "ukrainians in germany"
    },
    {
        ".     Due to the official atheism of the former ": null
    },
    {
        "German Democratic Republic": "east germany"
    },
    {
        ", most of the population is non-religious: 42% are members of the ": null
    },
    {
        "Evangelical Church in Central Germany": "evangelical church in central germany"
    },
    {
        " and 42% are Catholics .              The region around Eisenach is the part of Thuringia with the strongest economic base.      Agriculture is not very important in Eisenach, because of the hilly terrain, the—compared to central Thuringia further east—less fertile soil and the relatively humid climate. However, 42% of the total municipal territory are in agricultural use, mostly as ": null
    },
    {
        "maize": "maize"
    },
    {
        " and ": null
    },
    {
        "rapeseed": "rapeseed"
    },
    {
        " fields or as cattle pasture.     The industrial structure is relatively focused on car production. The German auto manufacturer ": null
    },
    {
        "Opel": "opel"
    },
    {
        " built an entirely ": null
    },
    {
        "new plant": "opel eisenach"
    },
    {
        " in the northwest of the town, after the ": null
    },
    {
        "Wartburg": "wartburg"
    },
    {
        " car plant had ceased production in 42 The new plant opened in 42 Most other large manufacturers in Eisenach serve as suppliers for Opel, the largest among them is ": null
    },
    {
        "Bosch": "robert bosch gmbh"
    },
    {
        ". ": null
    },
    {
        "BMW": "bmw"
    },
    {
        " runs a factory in the neighbouring municipality of ": null
    },
    {
        "Krauthausen": "krauthausen"
    },
    {
        " that supplies car parts. Another component supplier is Truck-Lite Europe . In 42 there were a total of 42 industrial companies with more than 42 workers in Eisenach, employing 42 people and generating a turnover of more than 42 billion euros.  Of those employees, 42 work for just two companies , underlining the dependence of Eisenach on the ": null
    },
    {
        "automotive industry": "automotive industry"
    },
    {
        ".     Services in Eisenach are focused on tourism with 42 overnight visitors spending a total of 42 nights in hotels in 42 In addition, there are large numbers of one-day visitors.     Eisenach also provides services to the region .     During recent years, the economic situation of the town improved: the unemployment rate declined from 42% in 42 to 42% in 42       The ": null
    },
    {
        "Wartburg": "wartburg"
    },
    {
        " castle is, aside from ": null
    },
    {
        "Weimar": "weimar"
    },
    {
        ", the most-visited tourist attraction in Thuringia.  Further sights are:       Eisenach hosts a number of museums:   The  Bachhaus  at Frauenplan was the first museum worldwide to be dedicated to the life and work of ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " in 42 It was established through the ": null
    },
    {
        "Neue Bachgesellschaft": "neue bachgesellschaft"
    },
    {
        ". The house is over 42 years old and stands near the site of the house in the Rittergasse, which is directly in back of the museum, where Bach was born on 42 March 42 Today, a 42 expansion has been added to the museum and it holds several artifacts and a variety of 42th and 42th century musical instruments.   Lutherhaus  at Lutherplatz is one of the oldest ": null
    },
    {
        "half-timbered": "half-timbered"
    },
    {
        " buildings remaining in Eisenach. ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        " is said to have lived here as a pupil during his school days in Eisenach from 42 to 42 as a guest of the Cotta family. The building was destroyed in a fire in 42 but had been completely rebuilt by 42  Currently, this house is a museum featuring multimedia exhibits relating to the period. The museum is split into five parts illustrating Luthers life and times as well as his teachings.   Automobile Welt at Friedrich-Naumann-Straße exhibits the tradition of car production in Eisenach since 42 It includes the Wartburg cars of 42–42 AWE racing cars from 42 and classic BMW cars.   Thüringer Museum inside the palace at Marktplatz is the art-historical museum of Eisenach and shows a collection focusing on ": null
    },
    {
        "porcelain": "porcelain"
    },
    {
        " and art handicrafts.   The Reuter-Wagner-Museum at Reuterweg hosts an exhibition on the poet ": null
    },
    {
        "Fritz Reuter": "fritz reuter"
    },
    {
        " and the composer ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        ". Built by Ludwig Bohnstedt between 42 and 42 this ": null
    },
    {
        "neo-renaissance": "renaissance revival architecture"
    },
    {
        " house was the home of Fritz Reuter, a well-known poet of the Low German dialect, from 42 until his death in 42 Reuters home was acquired by the town in 42 and turned into a memorial. That same year the collection of Nicolaus Oesterlein containing several thousand books on Richard Wagner was added. Since 42 this collection—the second largest in the world after ": null
    },
    {
        "Bayreuth": "bayreuth"
    },
    {
        "—has been presented in a new exhibit on the ground floor, which also includes all the material on  Tannhäuser , an opera set at the Wartburg.      The museum inside the Predigerkirche at Predigerplatz hosts the medieval art division of the Thüringer Museum.   The Goldener Löwe at Marienstraße shows an historical exhibition of German social democracy. On 42 August 42 the Social Democratic Workers Party  was founded at this site.  ": null
    },
    {
        "Lutherhaus": "lutherhaus eisenach"
    },
    {
        " Thüringer Museum Goldener Löwe            The town of Eisenach developed during the Middle Ages at the exit of Mariental valley, opening to the Hörsel valley around Marktplatz, Karlsplatz and Frauenplan in a triangle structure. The early-modern period brought extensions to the west , to the north and to the east . The construction boom between 42 and 42 led to a strict division in urban development. South of the historic centre, mansion districts were established on the hillsides of Mariental valley, where the rich factory owners, rentiers and other upper-class people lived. These districts are among the most important examples of this urban type in Germany, and one of the largest in Europe.  North of the historic centre, next to the railway and Hörsel river, factories and worker quarters were established. These also host some examples of interesting ": null
    },
    {
        "Gründerzeit": "gründerzeit"
    },
    {
        " architecture. After ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the town extended further to the north on the other bank of Hörsel river, where some new residential areas were developed before 42       Karlsplatz: adjoins the Nikolaikirche and the Romanesque Nikolaitor , the only surviving town gate . The square is seen as the nucleus of the town, it was first mentioned in 42  Marktplatz: the market square with the Georgenkirche , the town hall, the Baroque Stadtschloss, as well as a number of highly decorative administration buildings and merchants houses. It also features the gilded market fountain designed by Hans Leonardt in 42 showing St. George, the patron saint of Eisenach.   Jakobsplan: named after a chapel destroyed by fire in the Middle Ages. Jakobsplan comprises a monument to St. George in the centre of the square, part of the old town walls , and the Goethe Garden.   Frauenplan: a small courtyard-type square that takes its name from the Church of Our Lady . The church was demolished for defence purposes in 42 Today Frauenplan is the location of the Bachhaus and the Bach monument in front of it.           St. Georges Church at the market square was first built in the 42th century. The church in which St. Elisabeth was married was demolished in 42 and replaced by a new structure. Martin Luther held a sermon there on 42 May 42 In 42 the church was heavily damaged during the Bauernkrieg and during the Reformation it served as a stables. It was rededicated in 42 On 42 March 42 Johann Sebastian Bach was baptized in the church . The tower was added in 42–42  St. Nicholas Church , located on the Karlsplatz, served the ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " convent once located in the area. This triple-naved basilica was built in 42  It is considered the latest example of ": null
    },
    {
        "Romanesque architecture": "romanesque architecture"
    },
    {
        " in Thuringia.   Preachers Church at Predigerplatz was part of a former ": null
    },
    {
        "Dominican": "dominican order"
    },
    {
        " monastery , today used as a museum for medieval art.  St. Elizabeths Church at Sophienstraße is the Catholic parish church of Eisenach, built in ": null
    },
    {
        "neo-Gothic style": "neo-gothic style"
    },
    {
        " in the 42s.  St. Annes Church at Georgenstraße was founded together with a hospital by St. Elizabeth in 42   St. Clements Chapel at Clemensstraße is a small 42th century Romanesque chapel.   Holy Cross Church ": null
    },
    {
        "Wartburg": "wartburg"
    },
    {
        ".   The Stadtschloss is situated at the north end of the Marktplatz and was built between 42 and 42 This palace was constructed to the plans of Gottfried Heinrich Krohne, architect of Duke ": null
    },
    {
        "Ernst August I": "ernst august i, duke of saxe-weimar"
    },
    {
        " of ": null
    },
    {
        "Saxe-Weimar": "duchy of saxe-weimar"
    },
    {
        ".  After 42 ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        " frequently stayed here in his capacity as the dukes prime minister.  Today the Stadtschloss acts as a venue for special exhibitions and as a museum for artistic and historical artifacts from Thuringia.   Hellgrevenhof at Georgenstraße is part of a former inner-town castle, named after Heinrich Hellgreve, a rich citizen who lived here in the late 42th century. It consists of five buildings, the oldest dating to around 42 although it has been modified several times over the centuries.  Bechtolsheim Palace at Jakobsplan is a ": null
    },
    {
        "neoclassical": "neoclassical architecture"
    },
    {
        " palace, built in the late 42th century.   Schloss Fischbach in Fischbach district is a small 42th-century castle.   Jagdschloss Hohe Sonne is a hunting lodge south of the city in the Thuringian Forest. It was built in the mid42th century in the Baroque style.   Alte Residenz Stadtschloss Schloss Fischbach Jagdschloss Hohe Sonne Alte Residenz         The Bach monument was constructed in 42 by ": null
    },
    {
        "Adolf von Donndorf": "adolf von donndorf"
    },
    {
        ". Financed by other well-known musicians, the more-than-life-size figure portrays Johann Sebastian Bach in his ": null
    },
    {
        "St. Thomass": "thomaskirche"
    },
    {
        " choir-masters clothes and wig. It is situated on the Frauenplan next to the Bachhaus.   The Martin Luther monument at Karlsplatz was designed by Adolf von Donndorf and was dedicated on 42 May 42 on the 42th anniversary of Luthers arrival at Wartburg castle. The more-than-life-size statue of Martin Luther on a pedestal also has reliefs depicting events of his life leading up to and including his stay in Eisenach as well as the title of one of his most famous hymns, Ein feste Burg ist unser Gott    The Burschenschaftsdenkmal on Göpelskuppe hill was built in 42 The monument stands on a hill opposite the Wartburg in memory of the members of the liberal and nationalistic student movement and others who were killed in the struggle for a united Germany between 42 and 42  Burschenschaftsdenkmal         The town walls were built during the 42th century and demolished in the 42th century. Remains visible today are the Nikolaitor and the Glockenturm.   The Kartausgarten is all that remains of the original ": null
    },
    {
        "Carthusian": "carthusian"
    },
    {
        " monastery, consecrated to St. Elizabeth in 42 In 42 it became a royal kitchen garden and around 42 was changed into a park. The Wandelhalle , built in 42  was originally intended as a pump room to a ": null
    },
    {
        "spa": "spa"
    },
    {
        " planned for Eisenach that never materialised.   The town hall at Marktplatz was a former wine cellar and became the townhall of Eisenach in 42 The building, having been destroyed by fire in 42 was rebuilt in 42 The southern part of the complex suffered considerable damage in a bombing raid in 42 during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". It was renovated in 42 and it now houses the municipal administration offices.   The Landestheater was established in 42  by Julius von Eichel-Streiber and constructed to the design of the ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " architect Karl Weichardt. It was later renovated in 42 The theatre holds an audience of 42 and has two balconies.   The narrow house Nikolaitor Wandelhalle ": null
    },
    {
        "Katja Wolf": "katja wolf"
    },
    {
        " has been the first female mayor in Eisenachs history. She followed ": null
    },
    {
        "Matthias Doht": "matthias doht"
    },
    {
        " , who had been in office from 42 to 42     The last municipal election was held in 42 with the following result:          Eisenach is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:    ": null
    },
    {
        "Marburg": "marburg"
    },
    {
        " an der Lahn, Germany, since 42    ": null
    },
    {
        "Sedan": "sedan, france"
    },
    {
        ", France, since 42    ": null
    },
    {
        "Waverly, Iowa": "waverly, iowa"
    },
    {
        ", United States, since 42 home of Wartburg College    ": null
    },
    {
        "Skanderborg": "skanderborg"
    },
    {
        ", ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", since 42    ": null
    },
    {
        "Mahilyow": "mahilyow"
    },
    {
        ", ": null
    },
    {
        "Belarus": "belarus"
    },
    {
        ", since 42    ": null
    },
    {
        "Sárospatak": "sárospatak"
    },
    {
        ", ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", since 42                      Eisenach is connected by the ": null
    },
    {
        "Thuringian Railway": "thuringian railway"
    },
    {
        " to ": null
    },
    {
        "Erfurt": "erfurt"
    },
    {
        " and ": null
    },
    {
        "Halle": "halle"
    },
    {
        "/": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " to the east and to ": null
    },
    {
        "Kassel": "kassel"
    },
    {
        " and ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " to the west. Furthermore, there is the ": null
    },
    {
        "Werra Railway": "eisenach–lichtenfels railway"
    },
    {
        ", a former main-line railway between north and south Germany from Eisenach via ": null
    },
    {
        "Meiningen": "meiningen"
    },
    {
        " to ": null
    },
    {
        "Eisfeld": "eisfeld"
    },
    {
        ", which since the division of Germany after World War II has served only for regional transport. At the former inner German border, it is still interrupted between Eisfeld and ": null
    },
    {
        "Coburg": "coburg"
    },
    {
        ", but rebuilding is in discussion. ": null
    },
    {
        "Eisenach station": "eisenach station"
    },
    {
        " is a stop of all long-distance trains from Frankfurt to Leipzig/": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", running once an hour. Local trains, also once an hour, start in Eisenach to Halle via Erfurt, to ": null
    },
    {
        "Sonneberg": "sonneberg"
    },
    {
        " via Meiningen and Eisfeld and to ": null
    },
    {
        "Bebra": "bebra"
    },
    {
        " via ": null
    },
    {
        "Gerstungen": "gerstungen"
    },
    {
        ". Freight transport is important at Eisenachs Opel factory which has its own terminal. Further local passenger stations are Eisenach-West, Eisenach-Opelwerk and Hörschel.     Eisenach is located on the ": null
    },
    {
        "Bundesautobahn 42": "bundesautobahn 4"
    },
    {
        " from Frankfurt in the west to Erfurt and Dresden in the east. Since 42 the Autobahn has been moved to a new route farther away from the town to protect the residents from noise and air pollution. Moreover, it was not possible to expand the old route because of the mountainous topography. After 42 parts of the old route became a town highway, whereas other parts were renaturalized. A second Autobahn between Eisenach and Kassel is in construction . There are four ": null
    },
    {
        "Bundesstraße": "bundesstraße"
    },
    {
        "n connecting Eisenach: The ": null
    },
    {
        "Bundesstraße 42": "bundesstraße 7"
    },
    {
        " runs to Kassel in the north-west, whereas its eastern branch to ": null
    },
    {
        "Gotha": "gotha"
    },
    {
        " was annulled in 42 The ": null
    },
    {
        "Bundesstraße 42": "bundesstraße 19"
    },
    {
        " leads to Meiningen in the south, the ": null
    },
    {
        "Bundesstraße 42": "bundesstraße 84"
    },
    {
        " to ": null
    },
    {
        "Bad Langensalza": "bad langensalza"
    },
    {
        " in the north-east and to ": null
    },
    {
        "Fulda": "fulda"
    },
    {
        " via ": null
    },
    {
        "Vacha": "vacha, germany"
    },
    {
        " in the south-west and the ": null
    },
    {
        "Bundesstraße 42": "bundesstraße 88"
    },
    {
        " is a connection to ": null
    },
    {
        "Ilmenau": "ilmenau"
    },
    {
        " in the south-east. Furthermore, there are two important secondary roads to ": null
    },
    {
        "Mühlhausen": "mühlhausen"
    },
    {
        " via ": null
    },
    {
        "Mihla": "mihla"
    },
    {
        " in the north and to ": null
    },
    {
        "Herleshausen": "herleshausen"
    },
    {
        " in the west through the Hörsel valley. Downtown traffic is concentrated on Rennbahn street, which often leads to congestion due to a large number of commuters and the towns narrow topography.     The next local airports are the ": null
    },
    {
        "Erfurt-Weimar Airport": "erfurt-weimar airport"
    },
    {
        ", about  to the east and the ": null
    },
    {
        "Kassel Calden Airport": "kassel calden airport"
    },
    {
        ", roughly  to the north-west. Both offer service to tourist destinations. The next major international airport is ": null
    },
    {
        "Frankfurt Airport": "frankfurt airport"
    },
    {
        ", circa  to the south-west. Kindel Airfield,  east of Eisenach, is a former Soviet military base, today used for private aviation.     Biking is getting more and more popular since the construction of quality cycle tracks began in the 42s. Long distance trails include the Werra trail, the  Rennsteig trail and the Radweg Thüringer Städtekette . These all connect points of touristic interest, the first along the ": null
    },
    {
        "Werra": "werra"
    },
    {
        " valley from the ": null
    },
    {
        "Thuringian Forest": "thuringian forest"
    },
    {
        " to the ": null
    },
    {
        "Weser": "weser"
    },
    {
        " river in ": null
    },
    {
        "Hann. Münden": "hann. münden"
    },
    {
        ", the second through the Thuringian Forest along its crest to the ": null
    },
    {
        "Saale": "saale"
    },
    {
        " river near ": null
    },
    {
        "Hof": "hof, bavaria"
    },
    {
        " and the third follows near the medieval ": null
    },
    {
        "Via Regia": "via regia"
    },
    {
        " from the Werra valley/Eisenach via Gotha, Erfurt and ": null
    },
    {
        "Weimar": "weimar"
    },
    {
        " to ": null
    },
    {
        "Altenburg": "altenburg"
    },
    {
        ".     Public transport in Eisenach is by a bus network servicing the downtown areas as well as the neighbouring towns and villages. The three-line tramway system of Eisenach was in operation between 42 and 42       After reunification, the educational system was reformed. Eisenach currently has six state-run and one Protestant primary schools.      There are two types of secondary school in Germany. The ": null
    },
    {
        "gymnasium": "gymnasium"
    },
    {
        " prepares students for higher education at a university and students graduate after a total of 42 or 42 years of education with an ": null
    },
    {
        "Abitur": "abitur"
    },
    {
        ". There are two public and one evangelical gymnasium in Eisenach named after personalities of the cities history:  ": null
    }
]