[
    {
        "   Ejea de los Caballeros ; ; is a town and ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " in the province of ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        ", part of the autonomous community of ": null
    },
    {
        "Aragon": "aragon"
    },
    {
        ", Spain. It is one of the five main towns in the  Comarca de las Cinco Villas  . The five villages are Ejea de los Caballeros itself, ": null
    },
    {
        "Sos del Rey Católico": "sos del rey católico"
    },
    {
        ", ": null
    },
    {
        "Uncastillo": "uncastillo"
    },
    {
        ", ": null
    },
    {
        "Sádaba": "sádaba"
    },
    {
        " and ": null
    },
    {
        "Tauste": "tauste"
    },
    {
        ".     They became part of the medieval ": null
    },
    {
        "Kingdom of Aragon": "kingdom of aragon"
    },
    {
        " in 42 during the Spanish ": null
    },
    {
        "Reconquista": "reconquista"
    },
    {
        ", as ": null
    },
    {
        "Muslim rule": "al-andalus"
    },
    {
        " in the region was falling back.       The town retains many medieval buildings, including:   the ": null
    },
    {
        "Romanesque": "romanesque architecture"
    },
    {
        " church of Santa María de la Corona. It was renewed in 4242   church of San Salvador . It has a 42th-century portal with Romanesque sculptures   Church of our Lady the Virgin of the Olive , renovated in 42 over a pre-existing medieval building       The municipality of Ejea de los Caballeros comprises nine different centres of population:   Ejea de los Caballeros       ": null
    },
    {
        "Pinsoro": "pinsoro"
    },
    {
        " Rivas": "rivas, aragon"
    },
    {
        " Santa Anastasia": "santa anastasia, aragon"
    },
    {
        " Valareña": "valareña"
    },
    {
        "     Rivas and Farasdués are two historic villages that have been dependencies of Ejea for decades. The other six centres were built in the nineteen fifties and sixties in order to settle inhabitants and farmers to grow irrigation crops because of the building of Yesa reservoir and Bardenas irrigation channel that brought water to this villages, among others .         The main local fiesta honours the Virgin of the Olive, the local saint. In June, it is also celebrated the patron saint, Saint John the Baptist, in a medieval way. Another local festival commemorates The Vote Day , an event during the ": null
    },
    {
        "Black Plague": "black plague"
    },
    {
        ", when the townsfolk voted for the bringing of the Virgin of the Olive across the town to worship her. The plague is purported to have ended that day in Ejea de los Caballeros.       ": null
    },
    {
        "Alberto Zapater": "alberto zapater"
    },
    {
        ", footballer        ": null
    },
    {
        "Marmande": "marmande"
    },
    {
        ", France    ": null
    },
    {
        "Portogruaro": "portogruaro"
    },
    {
        ", Italy                     ": null
    }
]