[
    {
        "        Rodrigo Díaz de Vivar  was a ": null
    },
    {
        "Castilian": "Kingdom Of Castile"
    },
    {
        " knight": "Knight"
    },
    {
        " and ": null
    },
    {
        "warlord": "Warlord"
    },
    {
        " in ": null
    },
    {
        "medieval Spain": "Medieval Spain"
    },
    {
        ". The ": null
    },
    {
        "Moors": "Moors"
    },
    {
        " called him El Cid , which meant the Lord , and the ": null
    },
    {
        "Christians": "Christians"
    },
    {
        ", El Campeador, which stood for The Battlefielder, Outstanding Warrior, or The one who stands out in the battlefield . He was born in ": null
    },
    {
        "Vivar del Cid": "Vivar Del Cid"
    },
    {
        ", a town near the city of ": null
    },
    {
        "Burgos": "Burgos"
    },
    {
        ". After his death, he became Spains celebrated ": null
    },
    {
        "national hero": "Folk Hero"
    },
    {
        " and the protagonist of the most significant medieval Spanish epic poem,  El Cantar de Mio Cid .      To this day, El Cid remains a Spanish popular folk-hero and national icon, with his life and deeds remembered in plays, films, folktales, songs, and video games.         Born a member of the minor nobility, El Cid was brought up at the court of ": null
    },
    {
        "King Ferdinand the Great": "Ferdinand The Great"
    },
    {
        " and served Ferdinands son, ": null
    },
    {
        "Sancho II of León and Castile": "Sancho Ii Of León And Castile"
    },
    {
        ". He rose to become the commander and royal standard-bearer  of ": null
    },
    {
        "Castile": "Kingdom Of Castile"
    },
    {
        " upon Sanchos ascension in 1065. Rodrigo went on to lead the Castilian military campaigns against Sanchos brothers, ": null
    },
    {
        "Alfonso VI of León": "Alfonso Vi Of León"
    },
    {
        " and ": null
    },
    {
        "García II of Galicia": "García Ii Of Galicia"
    },
    {
        ", as well as in the Muslim kingdoms in ": null
    },
    {
        "Al-Andalus": "Al-Andalus"
    },
    {
        ". He became renowned for his military prowess in these campaigns, which helped expand the territory of the Crown of Castile at the expense of the Muslims and Sanchos brothers kingdoms. When conspirators murdered Sancho in 1072, Rodrigo found himself in a difficult situation. Since Sancho was childless, the throne passed to his brother Alfonso, the same whom El Cid had helped remove from power. Although Rodrigo continued to serve the sovereign, he lost his ranking in the new court which treated him suspiciously and kept him at arms length. Finally, in 1081, he was ordered into exile.      El Cid found work fighting for the ": null
    },
    {
        "Muslim": "Muslim"
    },
    {
        " rulers of ": null
    },
    {
        "Zaragoza": "Taifa Of Zaragoza"
    },
    {
        ", whom he defended from its traditional enemy, ": null
    },
    {
        "Aragon": "Kingdom Of Aragon"
    },
    {
        ". While in exile, he regained his reputation as a strategist and formidable military leader. He repeatedly turned out victorious in battle against the ": null
    },
    {
        "Muslim": "Muslim"
    },
    {
        " rulers of ": null
    },
    {
        "Lérida": "Lérida"
    },
    {
        " and their Christian allies, as well as against a large Christian army under King ": null
    },
    {
        "Sancho Ramírez": "Sancho Ramírez"
    },
    {
        " of Aragon. In 1086, an expeditionary army of ": null
    },
    {
        "North Africa": "North Africa"
    },
    {
        "n ": null
    },
    {
        "Almoravids": "Almoravids"
    },
    {
        " inflicted a severe defeat to Castile, compelling Alfonso to overcome the resentments he harboured against El Cid. The terms for the return to Christian service must have been attractive enough since Rodrigo soon found himself fighting for his former Lord. Over the next several years, however, El Cid set his sights on the kingdom-city of ": null
    },
    {
        "Valencia": "Valencia"
    },
    {
        ", operating more or less independently of Alfonso while politically supporting the ": null
    },
    {
        "Banu Hud": "Banu Hud"
    },
    {
        " and other Muslim dynasties opposed to the Almoravids. He gradually increased his control over Valencia; the Islamic ruler, , became his tributary in 1092. When the Almoravids instigated an uprising that resulted in the death of al-Qadir, El Cid responded by laying siege to the city. Valencia finally fell in 1094, and El Cid established an independent principality on the Mediterranean coast of Spain. He ruled over a ": null
    },
    {
        "pluralistic": "Cultural Pluralism"
    },
    {
        " society with the popular support of Christians and Muslims alike.      El Cids final years were spent fighting the Almoravid ": null
    },
    {
        "Berbers": "Berbers"
    },
    {
        ". He inflicted upon them their first major defeat in 1094, on the plains of Caurte, outside Valencia, and continued resisting them until his death. Although Rodrigo remained undefeated in Valencia, his only son, and heir, Diego Rodríguez died fighting against the Almoravids in the service of Alfonso in 1097. After El Cids death in 1099, his wife, ": null
    },
    {
        "Jimena Díaz": "Jimena Díaz"
    },
    {
        ", succeeded him as ruler of Valencia, but she was eventually forced to surrender the principality to the Almoravids in 1102.            The name El Cid  is a modern Spanish denomination composed of the article el meaning the and Cid, which derives from the Old Castilian loan word Çid borrowed from the dialectal Arabic word سيد  sîdi  or ": null
    },
    {
        "sayyid": "Sayyid"
    },
    {
        ", which means Lord or Master . The ": null
    },
    {
        "Mozarabs": "Mozarab"
    },
    {
        "or the Arabs that served in his ranks may have addressed him in this way, which the Christians may have transliterated and adopted. Historians, however, have not yet found contemporary records referring to Rodrigo as Cid. Arab sources use instead Rudriq, Ludriq al-Kanbiyatur or al-Qanbiyatur . María Jesús Viguera Molins, «El Cid en las fuentes árabes», in César Hernández Alonso , Actas del Congreso Internacional el Cid, Poema e Historia , Ayuntamiento de Burgos, 2000, págs. 55–92.  The cognomen Campeador derives from Latin campi doctor, which means battlefield master . He probably gained it during the campaigns of King Sancho II of Castile against his brothers ": null
    },
    {
        "King Alfonso VI of León": "Alfonso Vi Of León And Castile"
    },
    {
        " and ": null
    },
    {
        "King García II of Galicia": "García Ii Of Galicia"
    },
    {
        ". While his contemporaries left no historical sources that would have addressed him as Cid, they left plenty of Christian and Arab records, some even signed documents with his autograph, addressing him as Campeador, which prove that he used the Christian cognomen himself. See Ramón Menéndez Pidal, , Revista de Filología Española, t. 5 , Madrid, Sucesores de Hernando, 1918. Digital copy Valladolid, Junta de Castilla y León. Consejería de Cultura y Turismo. Dirección General de Promociones e Instituciones Culturales, 2009–2010. Original in Archivo de la Catedral de Salamanca, caja 43, legajo 2, n.º 72. Alberto Montaner Frutos y Ángel Escobar, «El Carmen Campidoctoris y la materia cidiana», in Carmen Campidoctoris o Poema latino del Campeador, Madrid, Sociedad Estatal España Nuevo Milenio, 2001, pág. 73  Alberto Montaner Frutos,  Georges Martin , en el  de la revista electrónica , n.º 10 . Online since 22 January 2011. Last time visited November 28th 2011. Complete text in José Luis Martín Martín  & al., . The whole combination Cid Campeador is first documented ca. 1195 in the ": null
    },
    {
        "Navarro-Aragonese": "Navarro-Aragonese"
    },
    {
        " Linage de Rodric Díaz included in the Liber Regum under the formula mio Cid el Campeador.           El Cid was born Rodrigo Díaz circa AD 1043 in ": null
    },
    {
        "Vivar": "Vivar Del Cid"
    },
    {
        ",  also known as Castillona de Bivar, a small town about six miles north of ": null
    },
    {
        "Burgos": "Burgos"
    },
    {
        ", the capital of ": null
    },
    {
        "Castile": "Kingdom Of Castile"
    },
    {
        ". His father, Diego Laínez, was a ": null
    },
    {
        "courtier": "Noble Court"
    },
    {
        ", ": null
    },
    {
        "bureaucrat": "Bureaucracy"
    },
    {
        ", and ": null
    },
    {
        "cavalry": "Cavalry"
    },
    {
        "man who had fought in several battles. Despite the fact that El Cids mothers family was ": null
    },
    {
        "aristocratic": "Aristocracy"
    },
    {
        ", in later years the peasants would consider him one of their own. However, his relatives were not major court officials; documents show that El Cids paternal grandfather, Lain, confirmed only five documents of ": null
    },
    {
        "Ferdinand I": "Ferdinand I Of León And Castile"
    },
    {
        "s; his maternal grandfather, Rodrigo   Álvarez, certified only two of ": null
    },
    {
        "Sancho II": "Sancho Ii Of León And Castile"
    },
    {
        "s; and El Cids father confirmed only one.       As a young man in 1057, Rodrigo fought against the Moorish stronghold of ": null
    },
    {
        "Zaragoza": "Taifa Of Zaragoza"
    },
    {
        ", making its ": null
    },
    {
        "emir": "Emir"
    },
    {
        " al-Muqtadir": "Ahmad Al-Muqtadir"
    },
    {
        " a vassal of Sancho. In the spring of 1063, Rodrigo fought in the ": null
    },
    {
        "Battle of Graus": "Battle Of Graus"
    },
    {
        ", where Ferdinands half-brother, ": null
    },
    {
        "Ramiro I of Aragon": "Ramiro I Of Aragon"
    },
    {
        ", was laying siege to the Moorish town of Cinca, which was in Zaragozan lands. Al-Muqtadir, accompanied by Castilian troops including El Cid, fought against the Aragonese. The party slew Ramiro I, setting the Aragonese army on the run, and emerged victorious. One legend has said that during the conflict, El Cid killed an Aragonese ": null
    },
    {
        "knight": "Knight"
    },
    {
        " in ": null
    },
    {
        "single combat": "Single Combat"
    },
    {
        ", thereby receiving the honorific title Campeador .     When Ferdinand died, Sancho continued to enlarge his territory, conquering both Christian strongholds and the ": null
    },
    {
        "Moorish": "Moorish"
    },
    {
        " cities of ": null
    },
    {
        "Zamora": "Zamora, Spain"
    },
    {
        " and ": null
    },
    {
        "Badajoz": "Badajoz"
    },
    {
        ". When Sancho learned that Alfonso was planning on overthrowing him in order to gain his territory, Sancho sent Cid to bring Alfonso back so that Sancho could speak to him.            Sancho was assassinated in 1072, possibly as the result of a pact between his brother ": null
    },
    {
        "Alfonso": "Alfonso Vi Of León And Castile"
    },
    {
        " and his sister ": null
    },
    {
        "Urraca": "Urraca Of Zamora"
    },
    {
        ". Since Sancho died unmarried and childless, all of his power passed to his brother Alfonso who, almost immediately, returned from exile in ": null
    },
    {
        "Toledo": "Toledo, Spain"
    },
    {
        " and took his seat as king of Castile and León. He was, however, deeply suspected of having been involved in Sanchos murder. According to the epic of El Cid, the Castilian nobility led by El Cid and a dozen oath-helpers forced Alfonso to ": null
    },
    {
        "swear": "Oath"
    },
    {
        " publicly on holy relics multiple times in front of ": null
    },
    {
        "Santa Gadea": "Santa Gadea"
    },
    {
        "  Church in ": null
    },
    {
        "Burgos": "Burgos"
    },
    {
        " that he did not participate in the plot to kill his brother. This is widely reported as truth, but contemporary documents on the lives of both Rodrigo Diaz and Alfonso VI of Castile and León do not mention any such event. Rodrigos position as armiger regis was taken away and given to Rodrigos enemy, Count ": null
    },
    {
        "García Ordóñez": "García Ordóñez"
    },
    {
        ".     In 1079, Rodrigo was sent by Alfonso VI to ": null
    },
    {
        "Seville": "Seville"
    },
    {
        " to the court of ": null
    },
    {
        "al-Mutamid": "Al-Mutamid Ibn Abbad"
    },
    {
        " to collect the  parias  owed by that  taifa  to León–Castile.  While he was there Granada, assisted by other Castilian knights, attacked Seville, and Rodrigo and his forces repulsed the Christian and Grenadine attackers at the ": null
    },
    {
        "Battle of Cabra": "Battle Of Cabra"
    },
    {
        ", in the belief that he was defending the kings tributary. Count García Ordóñez and the other Castilian leaders The ": null
    },
    {
        "Historia Roderici": "Historia Roderici"
    },
    {
        " says that the other two Castilian leaders were Diego Pérez and Lope Sánchez.  were taken captive and held for three days before being released.       In the ": null
    },
    {
        "Battle of Cabra": "Battle Of Cabra"
    },
    {
        " , El Cid rallied his troops and turned the battle into a rout of Emir Abdullah of ": null
    },
    {
        "Granada": "Granada"
    },
    {
        " and his ally García Ordóñez. This unauthorized expedition into Granada however, greatly angered Alfonso and May 8, 1080 was the last time El Cid confirmed a document in King Alfonsos court. This is the generally the accepted reason for the exile of El Cid, although it must be noted that several others are plausible and indeed may have been contributing factors to the exile: jealous nobles turning Alfonso against El Cid through court intrigue, Alfonsos own personal animosity towards El Cid, as well as a possible misappropriation of some of the tribute from Seville by El Cid.     At first he went to ": null
    },
    {
        "Barcelona": "Barcelona"
    },
    {
        ", where ": null
    },
    {
        "Ramon Berenguer II": "Ramon Berenguer Ii, Count Of Barcelona"
    },
    {
        " refused his offer of service.               The exile was not the end of El Cid, either physically or as an important figure. After being rejected by ": null
    },
    {
        "Ramon Berenguer II": "Ramon Berenguer Ii, Count Of Barcelona"
    },
    {
        ", El Cid journeyed to the ": null
    },
    {
        "Taifa of Zaragoza": "Taifa Of Zaragoza"
    },
    {
        ", where he received a warmer welcome. In 1081, El Cid went on to offer his services to the ": null
    },
    {
        "Moorish": "Moors"
    },
    {
        " king of the northeast ": null
    },
    {
        "al-Andalus": "Al-Andalus"
    },
    {
        " city of ": null
    },
    {
        "Zaragoza": "Zaragoza"
    },
    {
        ", ": null
    },
    {
        "Yusuf al-Mutaman ibn Hud": "Yusuf Al-Mutaman Ibn Hud"
    },
    {
        ", and served both him and his successor, ": null
    },
    {
        "al-Mustain II": "Al-Mustain Ii"
    },
    {
        ". He was given the title El Cid  and served as a leading figure in a diverse ": null
    },
    {
        "Moorish": "Moorish"
    },
    {
        " force consisting of ": null
    },
    {
        "Muladi": "Muladi"
    },
    {
        "s, ": null
    },
    {
        "Berber": "Berber People"
    },
    {
        "s, ": null
    },
    {
        "Arabs": "Arab"
    },
    {
        "and ": null
    },
    {
        "Mali": "Mali"
    },
    {
        "ans.     According to Moorish accounts:   ": null
    },
    {
        "Andalusi": "Al-Andalus"
    },
    {
        "Knights": "Knight"
    },
    {
        "found El Cid their foe ill, thirsty and exiled from the court of ": null
    },
    {
        "Alfonso": "Alfonso Vi Of León And Castile"
    },
    {
        ", he was presented before the elderly ": null
    },
    {
        "Yusuf al-Mutaman ibn Hud": "Yusuf Al-Mutaman Ibn Hud"
    },
    {
        " and accepted command of the forces of the ": null
    },
    {
        "Taifa of Zaragoza": "Taifa Of Zaragoza"
    },
    {
        " as their Master.     In his History of Medieval Spain , Joseph F. OCallaghan writes:   That kingdom was divided between ": null
    },
    {
        "al-Mutamin": "Yusuf Al-Mutaman Ibn Hud"
    },
    {
        " who ruled ": null
    },
    {
        "Zaragoza": "Zaragoza"
    },
    {
        " proper, and his brother al-Mundhir, who ruled ": null
    },
    {
        "Lérida": "Taifa Of Lleida"
    },
    {
        " and ": null
    },
    {
        "Tortosa": "Tortosa"
    },
    {
        ". El Cid entered al-Mutamins service and successfully defended Zaragoza against the assaults of al-Mundhir, ": null
    },
    {
        "Sancho I of Aragón": "Sancho I Of Aragón"
    },
    {
        ", and Ramon Berenguer II, whom he held captive briefly in 1082.     In 1084, the army of the ": null
    },
    {
        "Taifa of Zaragoza": "Taifa Of Zaragoza"
    },
    {
        " under El Cid defeated the ": null
    },
    {
        "Aragon": "Aragon"
    },
    {
        "ese at the ": null
    },
    {
        "Battle of Morella": "Battle Of Morella"
    },
    {
        " near ": null
    },
    {
        "Tortosa": "Tortosa"
    },
    {
        ", but in autumn the Castilians started a loose siege of ": null
    },
    {
        "Toledo": "Toledo, Spain"
    },
    {
        " and later the next year the Christians captured ": null
    },
    {
        "Salamanca": "Salamanca"
    },
    {
        ", a stronghold of the ": null
    },
    {
        "Taifa of Toledo": "Taifa Of Toledo"
    },
    {
        ".     In 1086, the ": null
    },
    {
        "Almoravid": "Almoravid Dynasty"
    },
    {
        " invasion of the ": null
    },
    {
        "Iberian Peninsula": "Iberian Peninsula"
    },
    {
        ", through and around ": null
    },
    {
        "Gibraltar": "Gibraltar"
    },
    {
        ", began. The Almoravids, a ": null
    },
    {
        "Berber": "Berber People"
    },
    {
        " dynasty from ": null
    },
    {
        "North Africa": "North Africa"
    },
    {
        ", led by ": null
    },
    {
        "Yusuf ibn Tashfin": "Yusuf Ibn Tashfin"
    },
    {
        ", were asked to help defend the divided Moors from Alfonso. The Almoravid army, joined by that of several and Taifas, including ": null
    },
    {
        "Badajoz": "Badajoz"
    },
    {
        ", ": null
    },
    {
        "Málaga": "Málaga"
    },
    {
        ", ": null
    },
    {
        "Granada": "Granada"
    },
    {
        ", ": null
    },
    {
        "Tortosa": "Tortosa"
    },
    {
        " and ": null
    },
    {
        "Seville": "Seville"
    },
    {
        ", defeated a combined army of ": null
    },
    {
        "León": "Kingdom Of León"
    },
    {
        ", ": null
    },
    {
        "Aragón": "Kingdom Of Aragon"
    },
    {
        " and ": null
    },
    {
        "Castile": "Kingdom Of Castile"
    },
    {
        ".     In 1087, ": null
    },
    {
        "Raymond of Burgundy": "Raymond Of Burgundy"
    },
    {
        " and his Christian allies attempted to weaken the Taifa of Zaragozas northernmost stronghold by initiating the ": null
    },
    {
        "Siege of Tudela": "Siege Of Tudela"
    },
    {
        " and Alfonso captured ": null
    },
    {
        "Aledo, Murcia": "Aledo, Murcia"
    },
    {
        ", blocking the route between the Taifas in the eastern and western Iberian Peninsula.               Terrified after his crushing defeat, Alfonso recalled El Cid. It has been shown that El Cid was at court on July 1087; however, what happened after that is unclear.     El Cid returned to Alfonso, but now he had his own plans. He only stayed a short while and then returned to Zaragoza. El Cid was content to let the Almoravid armies and the armies of Alfonso fight without his help, even when there was a chance that the Almoravids might defeat Alfonso and take over all of Alfonsos lands. El Cid chose not to fight because he was hoping that both armies would weaken themselves.  That would make it easier for him to carry out his own plan to become ruler of the Kingdom of Valencia.       Around this time, El Cid, with a combined Christian and Moorish army, began maneuvering in order to create his own fiefdom in the Moorish ": null
    },
    {
        "Mediterranean": "Mediterranean Sea"
    },
    {
        " coastal city of ": null
    },
    {
        "Valencia": "Valencia"
    },
    {
        ". Several obstacles lay in his way. First was Berenguer Ramon II, who ruled nearby ": null
    },
    {
        "Barcelona": "Barcelona"
    },
    {
        ". In May 1090, El Cid defeated and captured Berenguer in the Battle of Tébar . Berenguer was later released and his nephew Ramon Berenguer III married El Cids youngest daughter Maria to ward against future conflicts.     Along the way to Valencia, El Cid also conquered other towns, many of which were near Valencia, such as ": null
    },
    {
        "El Puig": "El Puig"
    },
    {
        " and ": null
    },
    {
        "Quart de Poblet": "Quart De Poblet"
    },
    {
        ".     El Cid gradually came to have more influence on Valencia, then ruled by , of the ": null
    },
    {
        "Hawwara": "Houara"
    },
    {
        " Berber Dhunnunid dynasty. In October 1092 an uprising occurred in Valencia, inspired by the citys chief judge Ibn Jahhaf and the Almoravids. El Cid began a siege of Valencia. A December 1093 attempt to break the siege failed. By the time the siege ended in May 1094, El Cid had carved out his own principality on the coast of the Mediterranean. Officially El Cid ruled in the name of Alfonso; in reality, El Cid was fully independent. The city was both Christian and Muslim, and both Moors and Christians served in the army and as administrators.            El Cid and his wife ": null
    },
    {
        "Jimena Díaz": "Jimena Díaz"
    },
    {
        " lived peacefully in Valencia for five years until the Almoravids besieged the city. El Cid died on July 10, 1099.  His death was likely a result of the famine and deprivations caused by the siege. Valencia was captured by ": null
    },
    {
        "Masdali": "Masdali"
    },
    {
        " on May 5, 1102 and it did not become a Christian city again for over 125 years. Jimena fled to Burgos, Castile, in 1101. She rode into the town with her retinue and the body of El Cid. Originally buried in Castile in the monastery of , his body now lies at the center of ": null
    },
    {
        "Burgos Cathedral": "Burgos Cathedral"
    },
    {
        ".       After his demise, but still during the siege of Valencia, legend holds that Jimena ordered that the corpse of El Cid be fitted with his armour and set on his horse Babieca, to bolster the morale of his troops. In several variations of the story, the dead Rodrigo and his knights win a thundering charge against Valencias besiegers, resulting in a war-is-lost-but-battle-is-won ": null
    },
    {
        "catharsis": "Catharsis"
    },
    {
        " for generations of Christian Spaniards to follow. It is believed that the legend originated shortly after Jimena entered Burgos, and that it is derived from the manner in which Jimenas procession rode into Burgos, i.e., alongside her deceased husband.           During his campaigns, El Cid often ordered that books by classic ": null
    },
    {
        "Roman": "Ancient Rome"
    },
    {
        " and ": null
    },
    {
        "Greek": "Greek Literature"
    },
    {
        " authors on military themes be read aloud to him and his troops, for both entertainment and inspiration before battle. El Cids army had a novel approach to planning strategy as well, holding what might be called ": null
    },
    {
        "brainstorming": "Brainstorming"
    },
    {
        " sessions before each battle to discuss tactics. They frequently used unexpected strategies, engaging in what modern generals would call ": null
    },
    {
        "psychological warfare": "Psychological Warfare"
    },
    {
        " — waiting for the enemy to be paralyzed with terror and then attacking them suddenly; distracting the enemy with a small group of soldiers, etc. ": null
    }
]