[
    {
        "      In the fictional setting of  Warhammer 42 , the Eldar are a race of ": null
    },
    {
        "aliens": "extraterrestrials in fiction"
    },
    {
        " and playable army in the tabletop miniatures wargame. They are patterned after the ": null
    },
    {
        "High Elves": "high elves"
    },
    {
        " of fantasy fiction; long-lived, arrogant, and possessing great psychic powers. The Eldar once ruled the galaxy and seek to reclaim their old dominions from humanity and the other Warhammer 42 races.             Unlike some other armies which have versatile units, the Eldar have many specialists and few which can handle many roles. For example, the Eldar Howling Banshees are melee specialists and, with their power weapons and other special rules, excel at killing heavily armored infantry units in melee combat, while using them for ranged attacks often leads to failure. In contrast, the Eldar Dark Reaper excels at long range fighting but will almost certainly be taken down in melee by even moderately skilled/equipped melee units. However, Dire Avengers can be outfitted for either melee or ranged combat, though they will not be as able as a more specialized aspect.     Eldar vehicles, unlike their infantry counterparts, are very tough and hard to kill because of many evasive and shielding benefits. While no Eldar vehicle has the maximum armor value , they often have upgrades and special abilities which can compensate for this and make them more effective than heavier vehicles. Most Eldar vehicles can also be equipped with weapons designed for various purposes. Some examples include the Brightlance , the Star Cannon , and the Scatter Laser . This is in addition to other upgrades, such as the Star Engines, Holo-Fields, and Spirit Stones. With the exception of walkers, all Eldar vehicles are skimmers which allow them to move freely across the board and, with upgrades, at speeds only matched by the Dark Eldar and the Tau armies. The drawback is that Eldar vehicles are expensive to field in game. An example is the Eldar Wave Serpent, which is one of the most-expensive dedicated transport vehicles in the game.     Because of the Eldars comparatively weak armor and high fielding costs but comparatively powerful weapons and fast speed, successful game play is often stylized by outnumbered Eldar units which outmaneuver the opponent and kill entire squads before they have a chance to retaliate. This is also the cause of Eldar game play being regarded as unforgiving . Unlike Space Marines or Necron, who boast heavy armor, high toughness and some form of wound-resistance; the Eldar do not. Because of this lack of staying power, Eldar infantry is often subject to severe, and sometimes unrecoverable, losses after a bad tactical decision or even a series of poor rolls.          Millions of years ago, the Eldar once ruled the galaxy. After ": null
    },
    {
        "the defeat of the Necrons and the decline of the Old Ones": "necronshistory"
    },
    {
        ", with no serious enemies to challenge them or labors to burden them, they became the solitary masters of the galaxy. However, over the course of millennia, the unchallenged Eldar fell into the most extreme kind of decadence imaginable. Because the Eldar are highly psychic, this behavior led to the creation of the Chaos God of excess and hedonism, Slaanesh. When Slaanesh was finally born , the psychic shockwave killed most of the Eldar race.     A minority of the Eldar, somehow seeing the impending doom that would arise from their decadence, had earlier rejected the debauchery of their kin and had constructed colossal starships that they called  . Truly gargantuan in size, these Craftworlds were capable of housing hundreds of thousands of Eldar and their technological wonders, and would become their refuge from the turbulent times to come. While some craftworlds did not get far enough to escape the psychic shockwave, others did. The remaining Craftworlds are now spread around the galaxy; massive holofields, advance stealth systems, and the vastness of space itself, has largely masked their presence and only a few have become known. 42 years on, the Eldar have yet to recover due to their extremely low birthrates and conflicts with the other powers of the galaxy, such as the Orks and Imperium of man.          The majority of the normal infantry and vehicles as described in the Games Workshop Codex books for the Craftworld and Dark Eldar are available as plastic or fine cast resin kits via either the companys many high street stores or by their mail order service. Some limited edition models have been produced for the Craftworld Eldar, although as of February 42 these are only available as the old style lead casts on the open market. Models and rules for Super Heavy units and Eldar Titans are only available via ": null
    },
    {
        "Forge World": "forge world"
    },
    {
        ". The company ": null
    },
    {
        "Games Workshop": "games workshop"
    },
    {
        " does supply to independent retailers. Also, a few of these distributors whose primary focus is tabletop wargaming can order the more-complex resin kits from Forge World. Both companies have websites from which online purchases can be made. Because the Eldar are one of the original races featured in the 42K universe they have an extensive back catalogue of classic lead and plastic miniatures including many variants of squads, squad leaders and infantry models which can still be found on sale both in store and online for those with the patience to search.     Eldar scenery kits produced by ": null
    },
    {
        "Games Workshop": "games workshop"
    },
    {
        " include overgrown ruins and a webway gate, and brief descriptions have been given on how to build Eldar architecture and objectives in both the main Warhammer 42 rules books and in GWs monthly magazine  White Dwarf . Such publications, along with ": null
    },
    {
        "Games Workshop": "games workshop"
    },
    {
        "s web site also contain many articles on how to assemble, convert and paint the standard range of Eldar models.          In the sense that Warhammer 42 races parallel the earlier  Warhammer Fantasy Battle  game, the Eldar race mirrors the Elven people.     The Eldar in general consist of five distinct sides: the ": null
    },
    {
        "Craftworld Eldar": "eldar craftworlds"
    },
    {
        " , who are similar to the ": null
    },
    {
        "High Elves": "high elves"
    },
    {
        "; the ": null
    },
    {
        "Drukhari": "drukhari"
    },
    {
        ", who are similar to the ": null
    },
    {
        "Dark Elves": "dark elves"
    },
    {
        "; the Exodites, who are similar to the ": null
    },
    {
        "Wood Elves": "wood elves"
    },
    {
        "; the Harlequins, servants of Cegorach, the Laughing God; and the Ynnari, a new faction of the Eldar that worship the god Ynnead. These equivalences are only in very general thematic terms, however, as the major details of the races backgrounds differ greatly from their Warhammer Fantasy counterparts. For instance while the Dark Elves have long existed as the main antagonist to the High Elves in Warhammer Fantasy, Games Workshop originally incorporated both High and Dark Elves elements into the Craftworld Eldar for the Warhammer 42 universe. Only recently in 42 did they create the Dark Eldar as a separate army, and there is little back-story on the Eldar-versus-Dark Eldar rivalry. The Exodites exist mainly in Warhammer 42 background material and never had any specific models or dedicated army books for use in the tabletop game, however the Alaitoc Craftworld Eldar is closely linked with the Exodites.     Both the Elves and Eldar share some ": null
    },
    {
        "deities": "list of warhammer fantasy characterselves"
    },
    {
        ". The bloody-handed God Khaine is a recurring entity for both the Elves and Craftworld Eldar. For instance, Aenarion drew the Sword of Khaine to defeat the First Chaos Invasion, while Prince Yriel used the Spear of Twilight to repel Hive Fleet Kraken from the Iyanden Craftworld. The Brides of Khaine, commonly known as the Witch Elves, are one of the forces in the ranks of the Dark Elves; while the Craftworld Eldar can summon the Avatar of Khaine.          The Eldar are typically stylized with lightweight and sleek forms, organic contours, and bright colors. This is a direct foil to the bulky Orkz with ramshackle technology and often dull or dirty color schemes. The various Eldar  each have their own color schemes. Examples are Ulthwés black armor and bone helmets, Alaitocs blue armor and yellow helmets, and Saim-hanns red armor and white helmets. The various Eldar paths also have their own color schemes. For example, the Howling Banshees color scheme is bone armor, green loin cloth, and red helmet fringe. The Striking Scorpions color scheme is green armor and helmets, black weaponry, and gold trim. Despite this, many players tend to paint aspect warriors the color of their chosen Craftworld for sake of uniformity.     Eldar vehicles also follow the above policy of avoiding too many harsh edges and flat surfaces. Instead, the armor plating is curved and is often criss-crossed with various inset lines which run either parallel or perpendicular to other edges/lines. For painted examples of either, simply browse through the Eldar army section of the Games-Workshop web site.          The Eldar, like other races in Warhammer 42, take their current state from various cultures. The Eldar naming-schemes are typically derived from Gaelic. Some examples are the  Saim-Hann, Ulthwé, Biel-Tan, Alaitoc, etc. The Eldar background and persona are heavily derived from  The Lord of the Rings ": null
    }
]