[
    {
        "Electrical elements are conceptual abstractions representing ": null
    },
    {
        "idealized": "idealized"
    },
    {
        " electrical component": "electrical component"
    },
    {
        "s, such as ": null
    },
    {
        "resistor": "resistor"
    },
    {
        "s, ": null
    },
    {
        "capacitor": "capacitor"
    },
    {
        "s, and ": null
    },
    {
        "inductor": "inductor"
    },
    {
        "s, used in the ": null
    },
    {
        "analysis": "circuit analysis"
    },
    {
        " of ": null
    },
    {
        "electrical network": "electrical network"
    },
    {
        "s. All electrical networks can be analyzed as multiple electrical elements interconnected by wires. Where the elements roughly correspond to real components the representation can be in the form of a ": null
    },
    {
        "schematic diagram": "schematic diagramelectronic industry"
    },
    {
        " or ": null
    },
    {
        "circuit diagram": "circuit diagram"
    },
    {
        ". This is called a ": null
    },
    {
        "lumped-element circuit model": "lumped-element model"
    },
    {
        ". In other cases infinitesimal elements are used to model the network, in a ": null
    },
    {
        "distributed-element model": "distributed-element model"
    },
    {
        ".     These ideal electrical elements represent real, physical ": null
    },
    {
        "electrical or electronic components": "electronic component"
    },
    {
        " but they do not exist physically and they are assumed to have ideal properties, while actual electrical components have less than ideal properties, a degree of uncertainty in their values and some degree of nonlinearity. To model the nonideal behavior of a real circuit component may require a combination of multiple ideal electrical elements in order to approximate its function. For example, an inductor circuit element is assumed to have inductance but no resistance or capacitance, while a real inductor, a coil of wire, has some resistance in addition to its inductance. This may be modeled by an ideal inductance element in series with a resistance.     Circuit analysis using electric elements is useful for understanding many practical electrical networks using components. By analyzing the way a network is affected by its individual elements it is possible to estimate how a real network will behave.       Circuit elements can be classified into different categories. One is how many terminals they have to connect them to other components:   One-port elementsthese represent the simplest components, that have only two terminals to connect to. Examples are resistances, capacitances, inductances, and diodes.   Multiport elementsthese have more than two terminals. They connect to the external circuit through multiple pairs of terminals called ": null
    },
    {
        "port": "port"
    },
    {
        "s. For example, a transformer with three separate windings has six terminals and could be idealized as a three-port element; the ends of each winding are connected to a pair of terminals which represent a port.   Two-port elementsthese are the most common multiport elements, which have four terminals consisting of two ports.     Elements can also be divided into active and passive:   Active elements or sourcesthese are elements which can source electrical ": null
    },
    {
        "power": "electric power"
    },
    {
        "; examples are ": null
    },
    {
        "voltage source": "voltage source"
    },
    {
        "s and ": null
    },
    {
        "current source": "current source"
    },
    {
        "s. They can be used to represent ideal ": null
    },
    {
        "batteries": "battery"
    },
    {
        " and ": null
    },
    {
        "power supplies": "power supply"
    },
    {
        ".   Dependent sourcesThese are two-port elements with a voltage or current source which is proportional to the voltage or current at a second pair of terminals. These are used in the modelling of ": null
    },
    {
        "amplifying": "amplifier"
    },
    {
        " components such as ": null
    },
    {
        "transistor": "transistor"
    },
    {
        "s, ": null
    },
    {
        "vacuum tube": "vacuum tube"
    },
    {
        "s, and ": null
    },
    {
        "op-amp": "op-amp"
    },
    {
        "s.   Passive elementsThese are elements which do not have a source of energy, examples are diodes, resistances, capacitances, and inductances.     Another distinction is between linear and nonlinear:   Linear elementsthese are elements in which the constituent relation, the relation between voltage and current, is a ": null
    },
    {
        "linear function": "linear function"
    },
    {
        ". They obey the ": null
    },
    {
        "superposition principle": "superposition principle"
    },
    {
        ". Examples of linear elements are resistances, capacitances, inductances, and linear dependent sources. Circuits with only linear elements, ": null
    },
    {
        "linear circuit": "linear circuit"
    },
    {
        "s, do not cause ": null
    },
    {
        "intermodulation distortion": "intermodulation distortion"
    },
    {
        ", and can be easily analysed with powerful mathematical techniques such as the ": null
    },
    {
        "Laplace transform": "laplace transform"
    },
    {
        ".   Nonlinear elementsthese are elements in which the relation between voltage and current is a ": null
    },
    {
        "nonlinear function": "nonlinear function"
    },
    {
        ". An example is a diode, in which the current is an ": null
    },
    {
        "exponential function": "exponential function"
    },
    {
        " of the voltage. Circuits with nonlinear elements are harder to analyse and design, often requiring ": null
    },
    {
        "circuit simulation": "circuit simulation"
    },
    {
        " computer programs such as ": null
    },
    {
        "SPICE": "spice"
    },
    {
        ".       Only nine types of element , five passive and four active, are required to model any electrical component or circuit. Each element is defined by a relation between the ": null
    },
    {
        "state variable": "state variable"
    },
    {
        "s of the network: ": null
    },
    {
        "current": "current"
    },
    {
        ", I ; ": null
    },
    {
        "voltage": "voltage"
    },
    {
        ", V , ": null
    },
    {
        "charge": "electric charge"
    },
    {
        ", Q ; and ": null
    },
    {
        "magnetic flux": "magnetic flux"
    },
    {
        ", \\Phi .     Two sources:   ": null
    },
    {
        "Current source": "current source"
    },
    {
        ", measured in ": null
    },
    {
        "ampere": "ampere"
    },
    {
        "s – produces a current in a conductor. Affects charge according to the relation dQ -I\\,dt .   ": null
    },
    {
        "Voltage source": "voltage source"
    },
    {
        ", measured in ": null
    },
    {
        "volt": "volt"
    },
    {
        "s – produces a ": null
    },
    {
        "potential difference": "potential difference"
    },
    {
        " between two points. Affects magnetic flux according to the relation d\\Phi V\\,dt .   :: \\Phi in this relationship does not necessarily represent anything physically meaningful. In the case of the current generator, Q , the time integral of current, represents the quantity of electric charge physically delivered by the generator. Here \\Phi is the time integral of voltage but whether or not that represents a physical quantity depends on the nature of the voltage source. For a voltage generated by magnetic induction it is meaningful, but for an electrochemical source, or a voltage that is the output of another circuit, no physical meaning is attached to it.   ::Both these elements are necessarily non-linear elements. See ": null
    },
    {
        "Non-linear elements": "non-linear elements"
    },
    {
        " below.     Three ": null
    },
    {
        "passive": "passivity"
    },
    {
        " elements:   ": null
    },
    {
        "Resistance": "electrical resistance"
    },
    {
        " R , measured in ": null
    },
    {
        "ohms": "ohm"
    },
    {
        " – produces a voltage proportional to the current flowing through the element. Relates voltage and current according to the relation dV R\\,dI .   ": null
    },
    {
        "Capacitance": "capacitance"
    },
    {
        " C , measured in ": null
    },
    {
        "farad": "farad"
    },
    {
        "s – produces a current proportional to the rate of change of voltage across the element. Relates charge and voltage according to the relation dQ C\\,dV .   ": null
    },
    {
        "Inductance": "inductance"
    },
    {
        " L , measured in ": null
    },
    {
        "henries": "henry"
    },
    {
        " – produces the magnetic flux proportional to the rate of change of current through the element. Relates flux and current according to the relation d\\Phi L\\,dI .   Four abstract active elements:   Voltage-controlled voltage source Generates a voltage based on another voltage with respect to a specified gain. .   Voltage-controlled current source Generates a current based on a voltage elsewhere in the circuit, with respect to a specified gain, used to model ": null
    },
    {
        "field-effect transistor": "field-effect transistor"
    },
    {
        "s and ": null
    },
    {
        "vacuum tube": "vacuum tube"
    },
    {
        "s . The gain is characterised by a ": null
    },
    {
        "transfer conductance": "transfer conductance"
    },
    {
        " which will have units of ": null
    },
    {
        "siemens": "siemens"
    },
    {
        ".   Current-controlled voltage source Generates a voltage based on an input current elsewhere in the circuit with respect to a specified gain. . Used to model ": null
    },
    {
        "trancitor": "trancitor"
    },
    {
        "s. The gain is characterised by a ": null
    },
    {
        "transfer impedance": "transfer impedance"
    },
    {
        " which will have units of ": null
    },
    {
        "ohm": "ohm"
    },
    {
        "s.   Current-controlled current source Generates a current based on an input current and a specified gain. Used to model ": null
    },
    {
        "bipolar junction transistor": "bipolar junction transistor"
    },
    {
        "s. .   ::These four elements are examples of ": null
    },
    {
        "two-port elements": "two-port elements"
    },
    {
        ".          In reality, all circuit components are non-linear and can only be approximated to linear over a certain range. To more exactly describe the passive elements, their ": null
    },
    {
        "constitutive relation": "constitutive relation"
    },
    {
        " is used instead of simple proportionality. From any two of the circuit variables there are six constitutive relations that can be formed. From this it is supposed that there is a theoretical fourth passive element since there are only five elements in total found in linear network analysis. This additional element is called ": null
    },
    {
        "memristor": "memristor"
    },
    {
        ". It only has any meaning as a time-dependent non-linear element; as a time-independent linear element it reduces to a regular resistor. Hence, it is not included in ": null
    },
    {
        "linear time-invariant ": "lti system theory"
    },
    {
        " circuit models. The constitutive relations of the passive elements are given by; Ljiljana Trajković, Nonlinear circuits , The Electrical Engineering Handbook , pp.42–42 Academic Press, 42      Resistance: constitutive relation defined as f42 .   Capacitance: constitutive relation defined as f42 .   Inductance: constitutive relation defined as f42 .   Memristance: constitutive relation defined as f42 .     :where f is an arbitrary function of two variables.     In some special cases the constitutive relation simplifies to a function of one variable. This is the case for all linear elements, but also for example, an ideal ": null
    },
    {
        "diode": "diode"
    },
    {
        ", which in circuit theory terms is a non-linear resistor, has a constitutive relation of the form V f . Both independent voltage, and independent current sources can be considered non-linear resistors under this definition.     The fourth passive element, the memristor, was proposed by ": null
    },
    {
        "Leon Chua": "leon chua"
    },
    {
        " in a 42 paper, but a physical component demonstrating memristance was not created until thirty-seven years later. It was reported on April 42 42 that a working memristor had been developed by a team at ": null
    },
    {
        "HP Labs": "hp labs"
    },
    {
        " led by scientist ": null
    },
    {
        "R. Stanley Williams": "r. stanley williams"
    },
    {
        ".  EETimes, 42 April 42 , EETimes, 42 April 42  – 42 April 42  – 42 April 42 With the advent of the memristor, each pairing of the four variables can now be related.     There are also two special non-linear elements which are sometimes used in analysis but which are not the ideal counterpart of any real component:     ": null
    },
    {
        "Nullator": "nullator"
    },
    {
        ": defined as V I 42   ": null
    },
    {
        "Norator": "norator"
    },
    {
        ": defined as an element which places no restrictions on voltage and current whatsoever.     These are sometimes used in models of components with more than two terminals: transistors for instance.       All the above are two-terminal, or ": null
    },
    {
        "one-port": "one-port"
    },
    {
        ", elements with the exception of the dependent sources. There are two lossless, passive, linear ": null
    },
    {
        "two-port": "two-port network"
    },
    {
        " elements that are normally introduced into network analysis. Their constitutive relations in matrix notation are;     ;Transformer:     : \\begin V_42 \\\\ I_42 \\end \\begin 42 & n \\\\ -n & 42 \\end\\begin I_42 \\\\ V_42 \\end     ;Gyrator:     : \\begin V_42 \\\\ V_42 \\end \\begin 42 & -r \\\\ r & 42 \\end\\begin I_42 \\\\ I_42 \\end     The transformer maps a voltage at one port to a voltage at the other in a ratio of n. The current between the same two port is mapped by 42/n. The ": null
    },
    {
        "gyrator": "gyrator"
    },
    {
        ", on the other hand, maps a voltage at one port to a current at the other. Likewise, currents are mapped to voltages. The quantity r in the matrix is in units of resistance. The gyrator is a necessary element in analysis because it is not ": null
    },
    {
        "reciprocal": "reciprocity reciprocity for electrical networks"
    },
    {
        ". Networks built from the basic linear elements only are obliged to be reciprocal and so cannot be used by themselves to represent a non-reciprocal system. It is not essential, however, to have both the transformer and gyrator. Two gyrators in cascade are equivalent to a transformer but the transformer is usually retained for convenience. Introduction of the gyrator also makes either capacitance or inductance non-essential since a gyrator terminated with one of these at port 42 will be equivalent to the other at port 42 However, transformer, capacitance and inductance are normally retained in analysis because they are the ideal properties of the basic physical components ": null
    },
    {
        "transformer": "transformer"
    },
    {
        ", ": null
    },
    {
        "inductor": "inductor"
    },
    {
        " and ": null
    },
    {
        "capacitor": "capacitor"
    },
    {
        " whereas a ": null
    },
    {
        "practical gyrator": "gyratorimplementation: a simulated inductor"
    },
    {
        " must be constructed as an active circuit. Wadhwa, C.L., Network analysis and synthesis, pp.42–42 New Age International, . Herbert J. Carlin, Pier Paolo Civalleri, Wideband circuit design, pp.42–42 CRC Press, 42 . Vjekoslav Damić, John Montgomery, Mechatronics by bond graphs: an object-oriented approach to modelling and simulation, pp.42–42 Springer, 42 .       The following are examples of representation of components by way of electrical elements.   On a first degree of approximation, a ": null
    },
    {
        "battery": "battery"
    },
    {
        " is represented by a voltage source. A more refined model also includes a resistance in series with the voltage source, to represent the batterys internal resistance . A current source in parallel may be added to represent its leakage .   On a first degree of approximation, a ": null
    },
    {
        "resistor": "resistor"
    },
    {
        " is represented by a resistance. A more refined model also includes a series inductance, to represent the effects of its lead inductance . A capacitance in parallel may be added to represent the capacitive effect of the proximity of the resistor leads to each other. A wire can be represented as a low-value resistor   Current sources are more often used when representing ": null
    },
    {
        "semiconductor": "semiconductor"
    },
    {
        "s. For example, on a first degree of approximation, a bipolar ": null
    },
    {
        "transistor": "transistor"
    }
]