[
    {
        "               Electromagnetism is a branch of ": null
    },
    {
        "physics": "physics"
    },
    {
        " involving the study of the electromagnetic force, a type of ": null
    },
    {
        "physical interaction": "physical interaction"
    },
    {
        " that occurs between ": null
    },
    {
        "electrically charged": "electric charge"
    },
    {
        " particles. The electromagnetic force is carried by ": null
    },
    {
        "electromagnetic fields": "electromagnetic field"
    },
    {
        "composed of ": null
    },
    {
        "electric fields": "electric field"
    },
    {
        "and ": null
    },
    {
        "magnetic field": "magnetic field"
    },
    {
        "s, and it is responsible for ": null
    },
    {
        "electromagnetic radiation": "electromagnetic radiation"
    },
    {
        " such as ": null
    },
    {
        "light": "light"
    },
    {
        ". It is one of the four ": null
    },
    {
        "fundamental interactions": "fundamental interaction"
    },
    {
        " in ": null
    },
    {
        "nature": "nature"
    },
    {
        ", together with the ": null
    },
    {
        "strong interaction": "strong interaction"
    },
    {
        ", the ": null
    },
    {
        "weak interaction": "weak interaction"
    },
    {
        ", and ": null
    },
    {
        "gravitation": "gravitation"
    },
    {
        ".  At high energy the weak force and electromagnetic force are unified as a single ": null
    },
    {
        "electroweak force": "electroweak interaction"
    },
    {
        ".      Electromagnetic phenomena are defined in terms of the electromagnetic force, sometimes called the ": null
    },
    {
        "Lorentz force": "lorentz force"
    },
    {
        ", which includes both ": null
    },
    {
        "electricity": "electricity"
    },
    {
        " and ": null
    },
    {
        "magnetism": "magnetism"
    },
    {
        " as different manifestations of the same phenomenon. The electromagnetic force plays a major role in determining the internal properties of most objects encountered in daily life. The electromagnetic attraction between ": null
    },
    {
        "atomic nuclei": "atomic nuclei"
    },
    {
        " and their orbital ": null
    },
    {
        "electrons": "electron"
    },
    {
        "holds ": null
    },
    {
        "atoms": "atom"
    },
    {
        "together. Electromagnetic forces are responsible for the ": null
    },
    {
        "chemical bonds": "chemical bond"
    },
    {
        "between atoms which create ": null
    },
    {
        "molecule": "molecule"
    },
    {
        "s, and ": null
    },
    {
        "intermolecular force": "intermolecular force"
    },
    {
        "s. The electromagnetic force governs all chemical processes, which arise from interactions between the ": null
    },
    {
        "electrons": "molecular orbital"
    },
    {
        " of neighboring atoms.     There are numerous ": null
    },
    {
        "mathematical descriptions of the electromagnetic field": "mathematical descriptions of the electromagnetic field"
    },
    {
        ". In ": null
    },
    {
        "classical electrodynamics": "classical electrodynamics"
    },
    {
        ", electric fields are described as ": null
    },
    {
        "electric potential": "electric potential"
    },
    {
        " and ": null
    },
    {
        "electric current": "electric current"
    },
    {
        ". In ": null
    },
    {
        "Faradays law": "faraday law of induction"
    },
    {
        ", ": null
    },
    {
        "magnetic fields": "magnetic field"
    },
    {
        "are associated with ": null
    },
    {
        "electromagnetic induction": "electromagnetic induction"
    },
    {
        " and magnetism, and ": null
    },
    {
        "Maxwells equations": "maxwells equations"
    },
    {
        " describe how electric and magnetic fields are generated and altered by each other and by charges and currents.     The theoretical implications of electromagnetism, particularly the establishment of the speed of light based on properties of the medium of propagation , led to the development of ": null
    },
    {
        "special relativity": "special relativity"
    },
    {
        " by ": null
    },
    {
        "Albert Einstein": "albert einstein"
    },
    {
        " in 1905.               Originally, electricity and magnetism were considered to be two separate forces. This view changed with the publication of ": null
    },
    {
        "James Clerk Maxwells": "james clerk maxwell"
    },
    {
        "1873  A Treatise on Electricity and Magnetism  in which the interactions of positive and negative charges were shown to be mediated by one force. There are four main effects resulting from these interactions, all of which have been clearly demonstrated by experiments:   Electric charges  or  one another with a force ": null
    },
    {
        "inversely proportional": "proportionality inverse proportionality"
    },
    {
        " to the square of the distance between them: unlike charges attract, like ones repel.   Magnetic poles attract or repel one another in a manner similar to positive and negative charges and always exist as pairs: every north pole is yoked to a south pole.   An electric current inside a wire creates a corresponding circumferential magnetic field outside the wire. Its direction depends on the direction of the current in the wire.   A current is induced in a loop of wire when it is moved toward or away from a magnetic field, or a magnet is moved towards or away from it; the direction of current depends on that of the movement.        While preparing for an evening lecture on 21 April 1820, ": null
    },
    {
        "Hans Christian Ørsted": "hans christian ørsted"
    },
    {
        " made a surprising observation. As he was setting up his materials, he noticed a ": null
    },
    {
        "compass needle": "compass needle"
    },
    {
        " deflected away from ": null
    },
    {
        "magnetic north": "magnetic north"
    },
    {
        " when the electric current from the battery he was using was switched on and off. This deflection convinced him that magnetic fields radiate from all sides of a wire carrying an electric current, just as light and heat do, and that it confirmed a direct relationship between electricity and magnetism.     At the time of discovery, Ørsted did not suggest any satisfactory explanation of the phenomenon, nor did he try to represent the phenomenon in a mathematical framework. However, three months later he began more intensive investigations. Soon thereafter he published his findings, proving that an electric current produces a magnetic field as it flows through a wire. The ": null
    },
    {
        "CGS": "cgs"
    },
    {
        " unit of ": null
    },
    {
        "magnetic induction": "electromagnetic induction"
    },
    {
        "  is named in honor of his contributions to the field of electromagnetism.        His findings resulted in intensive research throughout the scientific community in ": null
    },
    {
        "electrodynamics": "electrodynamics"
    },
    {
        ". They influenced French physicist ": null
    },
    {
        "André-Marie Ampères": "andré-marie ampère"
    },
    {
        "developments of a single mathematical form to represent the magnetic forces between current-carrying conductors. Ørsteds discovery also represented a major step toward a unified concept of energy.     This unification, which was observed by ": null
    },
    {
        "Michael Faraday": "michael faraday"
    },
    {
        ", extended by ": null
    },
    {
        "James Clerk Maxwell": "james clerk maxwell"
    },
    {
        ", and partially reformulated by ": null
    },
    {
        "Oliver Heaviside": "oliver heaviside"
    },
    {
        " and ": null
    },
    {
        "Heinrich Hertz": "heinrich hertz"
    },
    {
        ", is one of the key accomplishments of 19th-century ": null
    },
    {
        "mathematical physics": "mathematical physics"
    },
    {
        ".  It has had far-reaching consequences, one of which was the understanding of the nature of ": null
    },
    {
        "light": "light"
    },
    {
        ". Unlike what was proposed by the electromagnetic theory of that time, light and other ": null
    },
    {
        "electromagnetic waves": "electromagnetic radiation"
    },
    {
        " are at present seen as taking the form of ": null
    },
    {
        "quantized": "quantum"
    },
    {
        ", self-propagating ": null
    },
    {
        "oscillatory": "oscillation"
    },
    {
        " electromagnetic field disturbances called ": null
    },
    {
        "photon": "photon"
    },
    {
        "s. Different ": null
    },
    {
        "frequencies": "frequency"
    },
    {
        " of oscillation give rise to the different forms of ": null
    },
    {
        "electromagnetic radiation": "electromagnetic radiation"
    },
    {
        ", from ": null
    },
    {
        "radio waves": "radio wave"
    },
    {
        "at the lowest frequencies, to visible light at intermediate frequencies, to ": null
    },
    {
        "gamma rays": "gamma ray"
    },
    {
        "at the highest frequencies.     Ørsted was not the only person to examine the relationship between electricity and magnetism. In 1802, ": null
    },
    {
        "Gian Domenico Romagnosi": "gian domenico romagnosi"
    },
    {
        ", an Italian legal scholar, deflected a magnetic needle using a Voltaic pile. The factual setup of the experiment is not completely clear, so if current flowed across the needle or not. An account of the discovery was published in 1802 in an Italian newspaper, but it was largely overlooked by the contemporary scientific community, because Romagnosi seemingly did not belong to this community.         An earlier , and often neglected, connection between electricity and magnetism was reported by a Dr. Cookson. VIII. An account of an extraordinary effect of lightning in communicating magnetism. Communicated by Pierce Dod, M.D. F.R.S. from Dr. Cookson of Wakefield in Yorkshire.   Phil. Trans. 1735 39, 74-75, published 1 January 1735 The account stated: A tradesman at Wakefield in Yorkshire, having put up a great number of knives and forks in a large box ... and having placed the box in the corner of a large room, there happened a sudden storm of thunder, lightning, & c. ... The owner emptying the box on a counter where some nails lay, the persons who took up the knives, that lay on the nails, observed that the knives took up the nails. On this the whole number was tried, and found to do the same, and that, to such a degree as to take up large nails, packing needles, and other iron things of considerable weight ... ": null
    },
    {
        "E. T. Whittaker": "e. t. whittaker"
    },
    {
        " suggested in 1910 that this particular event was responsible for lightning to be credited with the power of magnetizing steel; and it was doubtless this which led Franklin in 1751 to attempt to magnetize a sewing-needle by means of the discharge of Leyden jars. Whittaker, E.T. . A History of the Theories of Aether and Electricity from the Age of Descartes to the Close of the Nineteenth Century. Longmans, Green and Company.            The electromagnetic force is one of the four known ": null
    },
    {
        "fundamental force": "fundamental force"
    },
    {
        "s. The other fundamental forces are:   the ": null
    },
    {
        "weak nuclear force": "weak interaction"
    },
    {
        ", which binds to all known particles in the ": null
    },
    {
        "Standard Model": "standard model"
    },
    {
        ", and causes certain forms of ": null
    },
    {
        "radioactive decay": "radioactive decay"
    },
    {
        ". ;   the ": null
    },
    {
        "strong nuclear force": "strong interaction"
    },
    {
        ", which binds ": null
    },
    {
        "quarks": "quark"
    },
    {
        "to form ": null
    },
    {
        "nucleon": "nucleon"
    },
    {
        "s, and binds nucleons to form ": null
    },
    {
        "nuclei": "atomic nucleus"
    },
    {
        " gravitational force": "gravity"
    },
    {
        ".   All other forces  are derived from these four fundamental forces. Browne, Physics for Engineering and Science, p. 160: Gravity is one of the fundamental forces of nature. The other forces such as friction, tension, and the normal force are derived from the electric force, another of the fundamental forces. Gravity is a rather weak force... The electric force between two protons is much stronger than the gravitational force between them.     The electromagnetic force is responsible for practically all phenomena one encounters in daily life above the nuclear scale, with the exception of gravity. Roughly speaking, all the forces involved in interactions between ": null
    },
    {
        "atoms": "atom"
    },
    {
        "can be explained by the electromagnetic force acting between the electrically charged ": null
    },
    {
        "atomic nuclei": "atomic nucleus"
    },
    {
        " and ": null
    },
    {
        "electrons": "electron"
    },
    {
        "of the atoms. Electromagnetic forces also explain how these particles carry momentum by their movement. This includes the forces we experience in pushing or pulling ordinary material objects, which result from the ": null
    },
    {
        "intermolecular forces": "intermolecular force"
    },
    {
        "that act between the individual ": null
    },
    {
        "molecules": "molecule"
    },
    {
        "in our bodies and those in the objects. The electromagnetic force is also involved in all forms of ": null
    },
    {
        "chemical phenomena": "chemistry"
    },
    {
        ".     A necessary part of understanding the intra-atomic and intermolecular forces is the effective force generated by the momentum of the electrons movement, such that as electrons move between interacting atoms they carry momentum with them. As a collection of electrons becomes more confined, their minimum momentum necessarily increases due to the ": null
    },
    {
        "Pauli exclusion principle": "pauli exclusion principle"
    },
    {
        ". The behaviour of matter at the molecular scale including its density is determined by the balance between the electromagnetic force and the force generated by the exchange of momentum carried by the electrons themselves. Purcell, Electricity and Magnetism, 3rd Edition, p. 546: Ch 11 Section 6, Electron Spin and Magnetic Moment.            In 1600, ": null
    },
    {
        "William Gilbert": "william gilbert"
    },
    {
        " proposed, in his  De Magnete , that electricity and magnetism, while both capable of causing attraction and repulsion of objects, were distinct effects. Mariners had noticed that lightning strikes had the ability to disturb a compass needle. The link between lightning and electricity was not confirmed until ": null
    },
    {
        "Benjamin Franklins": "benjamin franklin"
    },
    {
        "proposed experiments in 1752. One of the first to discover and publish a link between man-made electric current and magnetism was ": null
    },
    {
        "Romagnosi": "romagnosi"
    },
    {
        ", who in 1802 noticed that connecting a wire across a ": null
    },
    {
        "voltaic pile": "voltaic pile"
    },
    {
        " deflected a nearby ": null
    },
    {
        "compass": "compass"
    },
    {
        " needle. However, the effect did not become widely known until 1820, when Ørsted performed a similar experiment.  Ørsteds work influenced Ampère to produce a theory of electromagnetism that set the subject on a mathematical foundation.     A theory of electromagnetism, known as ": null
    },
    {
        "classical electromagnetism": "classical electromagnetism"
    },
    {
        ", was developed by various physicists during the period between 1820 and 1873 when it culminated in the publication of a ": null
    },
    {
        "treatise": "a treatise on electricity and magnetism"
    },
    {
        " by ": null
    },
    {
        "James Clerk Maxwell": "james clerk maxwell"
    },
    {
        ", which unified the preceding developments into a single theory and discovered the electromagnetic nature of light. Purcell, p. 436. Chapter 9.3, Maxwells description of the electromagnetic field was essentially complete. In classical electromagnetism, the behavior of the electromagnetic field is described by a set of equations known as ": null
    },
    {
        "Maxwells equations": "maxwells equations"
    },
    {
        ", and the electromagnetic force is given by the ": null
    },
    {
        "Lorentz force law": "lorentz force"
    },
    {
        ". Purcell: p. 278: Chapter 6.1, Definition of the Magnetic Field. Lorentz force and force equation.     One of the peculiarities of classical electromagnetism is that it is difficult to reconcile with ": null
    },
    {
        "classical mechanics": "classical mechanics"
    },
    {
        ", but it is compatible with special relativity. According to Maxwells equations, the ": null
    },
    {
        "speed of light": "speed of light"
    },
    {
        " in a vacuum is a universal constant that is dependent only on the ": null
    },
    {
        "electrical permittivity": "permittivity"
    },
    {
        " and ": null
    },
    {
        "magnetic permeability": "magnetic permeability"
    },
    {
        " of ": null
    },
    {
        "free space": "free space"
    },
    {
        ". This violates ": null
    },
    {
        "Galilean invariance": "galilean invariance"
    },
    {
        ", a long-standing cornerstone of classical mechanics. One way to reconcile the two theories is to assume the existence of a ": null
    },
    {
        "luminiferous aether": "luminiferous aether"
    },
    {
        " through which the light propagates. However, subsequent experimental efforts failed to detect the presence of the aether. After important contributions of ": null
    },
    {
        "Hendrik Lorentz": "hendrik lorentz"
    },
    {
        " and ": null
    },
    {
        "Henri Poincaré": "henri poincaré"
    },
    {
        ", in 1905, ": null
    },
    {
        "Albert Einstein": "albert einstein"
    },
    {
        " solved the problem with the introduction of special relativity, which replaced classical kinematics with a new theory of kinematics compatible with classical electromagnetism.      In addition, relativity theory implies that in moving frames of reference, a magnetic field transforms to a field with a nonzero electric component and conversely, a moving electric field transforms to a nonzero magnetic component, thus firmly showing that the phenomena are two sides of the same coin. Hence the term electromagnetism .           The Maxwell equations are linear, in that a change in the sources results in a proportional change of the fields. ": null
    },
    {
        "Nonlinear dynamics": "nonlinear system"
    },
    {
        " can occur when electromagnetic fields couple to matter that follows nonlinear dynamical laws. This is studied, for example, in the subject of ": null
    },
    {
        "magnetohydrodynamics": "magnetohydrodynamics"
    },
    {
        ", which combines Maxwell theory with the ": null
    },
    {
        "Navier–Stokes equations": "navier–stokes equations"
    },
    {
        ".          Electromagnetic units are part of a system of electrical units based primarily upon the magnetic properties of electric currents, the fundamental SI unit being the ampere. The units are:    ": null
    },
    {
        "ampere": "ampere"
    },
    {
        "   coulomb": "coulomb"
    },
    {
        "   farad": "farad"
    },
    {
        "   henry": "henry"
    },
    {
        "   ohm": "ohm"
    },
    {
        "   siemens": "siemens"
    },
    {
        "   tesla": "tesla"
    },
    {
        "   volt": "volt"
    },
    {
        "   watt": "watt"
    },
    {
        "   weber": "weber"
    },
    {
        "      In the electromagnetic ": null
    },
    {
        "cgs": "centimetre gram second system of units"
    },
    {
        " system, electric current is a fundamental quantity defined via ": null
    },
    {
        "Ampères law": "ampères law"
    },
    {
        " and takes the ": null
    },
    {
        "permeability": "permeability"
    },
    {
        " as a dimensionless quantity whose value in a vacuum is unity. As a consequence, the square of the speed of light appears explicitly in some of the equations interrelating quantities in this system.          Formulas for physical laws of electromagnetism  need to be adjusted depending on what system of units one uses. This is because there is no ": null
    },
    {
        "one-to-one correspondence": "one-to-one correspondence"
    },
    {
        " between electromagnetic units in SI and those in CGS, as is the case for mechanical units. Furthermore, within CGS, there are several plausible choices of electromagnetic units, leading to different unit sub-systems , including ": null
    },
    {
        "Gaussian": "gaussian units"
    },
    {
        ", ESU , EMU , and ": null
    },
    {
        "Heaviside–Lorentz": "heaviside–lorentz"
    },
    {
        ". Among these choices, Gaussian units are the most common today, and in fact the phrase CGS units is often used to refer specifically to ": null
    },
    {
        "CGS-Gaussian units": "gaussian units"
    }
]