[
    {
        "         Eli Herschel Wallach  was an American film, television and stage actor whose career spanned more than six decades, beginning in the late 1940s. Trained in stage acting, which he enjoyed doing most, he became one of the greatest ": null
    },
    {
        "character actors": "character actor"
    },
    {
        "ever to appear on stage and screen , with over 90 film credits. On stage, he often co-starred with his wife, ": null
    },
    {
        "Anne Jackson": "anne jackson"
    },
    {
        ", becoming one of the best-known acting couples in the American theater. As a stage and screen character actor, Wallach had one of the longest-ever careers in show business, spanning 62 years from his Broadway debut to his last two major Hollywood studio movies .     Wallach initially studied ": null
    },
    {
        "method acting": "method acting"
    },
    {
        " under ": null
    },
    {
        "Sanford Meisner": "sanford meisner"
    },
    {
        ", and later became a founding member of the ": null
    },
    {
        "Actors Studio": "actors studio"
    },
    {
        ", where he studied under ": null
    },
    {
        "Lee Strasberg": "lee strasberg"
    },
    {
        ". His versatility gave him the ability to play a wide variety of different roles throughout his career, primarily as a ": null
    },
    {
        "supporting actor": "supporting actor"
    },
    {
        ".     For his debut screen performance in  Baby Doll  , he won a ": null
    },
    {
        "BAFTA Award for Best Newcomer": "bafta award for most promising newcomer to leading film roles"
    },
    {
        " and a ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        " nomination. Among his other most famous roles are Calvera in  The Magnificent Seven  , Guido in  The Misfits  , and Tuco in  The Good, the Bad and the Ugly  Other notable portrayals include outlaw Charlie Gant in  How the West Was Won  , Hitman Leon B. Little in  Tough Guys  , ": null
    },
    {
        "Don Altobello": "don altobello"
    },
    {
        " in  The Godfather Part III , Cotton Weinberger in  The Two Jakes  , and Arthur Abbott in  The Holiday  . One of Americas most prolific screen actors, Wallach remained active well into his nineties, with roles as recently as 2010 in  Wall Street: Money Never Sleeps  and  The Ghost Writer .     In 1988, Eli Wallach was inducted into the ": null
    },
    {
        "American Theater Hall of Fame": "american theater hall of fame"
    },
    {
        ".      Wallach has also received ": null
    },
    {
        "BAFTA Awards": "british academy film awards"
    },
    {
        ", ": null
    },
    {
        "Tony Awards": "tony award"
    },
    {
        "and ": null
    },
    {
        "Emmy Awards": "emmy award"
    },
    {
        "for his work, and received an ": null
    },
    {
        "Academy Honorary Award": "academy honorary award"
    },
    {
        " at the second annual ": null
    },
    {
        "Governors Awards": "governors awards"
    },
    {
        ", presented on November 13, 2010.     In March 2017, the ": null
    },
    {
        "Harry Ransom Center": "harry ransom center"
    },
    {
        " announced the acquisition of Wallachs papers, along with those of his wife. It will be made public when cataloging is complete.        Wallach was born in ": null
    },
    {
        "Red Hook, Brooklyn": "red hook, brooklyn"
    },
    {
        ", at 156 Union Street, a son of ": null
    },
    {
        "Jewish": "jews"
    },
    {
        " immigrants Abraham and Bertha Wallach, both from ": null
    },
    {
        "Poland": "poland"
    },
    {
        ". He had a brother and two sisters, with his family being the only Jews in an otherwise ": null
    },
    {
        "Italian American": "italian american"
    },
    {
        " neighborhood.  – Forward.com.  His parents owned Berthas Candy Store.  Wallach graduated in 1936 from the ": null
    },
    {
        "University of Texas": "university of texas at austin"
    },
    {
        " with a degree in history.  , Alumni and Friends, Department of History, University of Texas, Austin. While at the university, he performed in a play with fellow students ": null
    },
    {
        "Ann Sheridan": "ann sheridan"
    },
    {
        " and ": null
    },
    {
        "Walter Cronkite": "walter cronkite"
    },
    {
        ". In a later interview, Wallach said that he learned to ride horses while in Texas, adding that he liked Texas because it opened eyes to the word friendship. He explained, You could rely on people. If they gave you their word, that was it  ... It was an education. The Alcalde: Texas, March 2000.     Two years later he received a master of arts degree in education from the ": null
    },
    {
        "City College of New York": "city college of new york"
    },
    {
        ".  , Newswire, City College of New York, October 19, 2010. , The New York Times. He gained his first method acting experience at the ": null
    },
    {
        "Neighborhood Playhouse School of the Theatre": "neighborhood playhouse school of the theatre"
    },
    {
        " in New York City, where he studied under ": null
    },
    {
        "Sanford Meisner": "sanford meisner"
    },
    {
        ". , CBS News, June 25, 2014. There, according to Wallach, actors were forced to unlearn all their physical and vocal mannerisms, while traditional stage etiquette and singsong deliveries were utterly excised from his classroom. Gordon, Mel. Stanislavsky in America: An Actors Workbook, Routledge , p. 178.     Wallachs education was cut short when he was drafted into the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " in January 1942. He served as staff sergeant in a military hospital in ": null
    },
    {
        "Hawaii": "hawaii"
    },
    {
        " and later sent to ": null
    },
    {
        "Officer Candidate School": "officer candidate school"
    },
    {
        " in ": null
    },
    {
        "Abilene, Texas": "abilene, texas"
    },
    {
        " to train as a medical administrative officer. Commissioned a second lieutenant, he was ordered to ": null
    },
    {
        "Casablanca": "casablanca"
    },
    {
        ". Later, when he was serving in ": null
    },
    {
        "France": "france"
    },
    {
        ", a senior officer noticed his acting career and asked him to create a show for the patients. He and his unit wrote a play called Is This the Army?, which was inspired by Irving Berlins  This Is the Army . In the comedy, Wallach and the other actors mocked Axis dictators, with Wallach portraying ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ".                 Wallach took classes in acting at the ": null
    },
    {
        "Dramatic Workshop": "dramatic workshop"
    },
    {
        " of ": null
    },
    {
        "the New School": "the new school"
    },
    {
        " in ": null
    },
    {
        "New York": "new york city"
    },
    {
        " with the influential German director ": null
    },
    {
        "Erwin Piscator": "erwin piscator"
    },
    {
        ". He later became a founding member of the ": null
    },
    {
        "Actors Studio": "actors studio"
    },
    {
        ", taught by ": null
    },
    {
        "Lee Strasberg": "lee strasberg"
    },
    {
        ". There, he studied more method acting technique with founding member ": null
    },
    {
        "Robert Lewis": "robert lewis"
    },
    {
        ", and with other students including ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        ", ": null
    },
    {
        "Montgomery Clift": "montgomery clift"
    },
    {
        ", ": null
    },
    {
        "Herbert Berghof": "herbert berghof"
    },
    {
        ", ": null
    },
    {
        "Sidney Lumet": "sidney lumet"
    },
    {
        ", and his soon-to-be wife, ": null
    },
    {
        "Anne Jackson": "anne jackson"
    },
    {
        ".  Wallach became ": null
    },
    {
        "Marilyn Monroes": "marilyn monroe"
    },
    {
        "first new friend when she became a student at the Actors Studio, once insisting on watching him perform in  The Teahouse of the August Moon  from the backstage wings, simply to see up close how experienced actors perform a two-hour play. Gottfried, Martin. Arthur Miller: His Life and Work, Da Capo Press , p. 245. She also became friends with his wife, Anne Jackson, also studying at the Studio, and would visit the couple at their home and sometimes babysit their new child. Harding, Les. They Knew Marilyn Monroe: Famous Persons in the Life of the Hollywood Icon, McFarland , p. 154.     In 1945 Wallach made his ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " debut and he won a Tony Award in 1951 for his performance alongside ": null
    },
    {
        "Maureen Stapleton": "maureen stapleton"
    },
    {
        " in the ": null
    },
    {
        "Tennessee Williams": "tennessee williams"
    },
    {
        " play  The Rose Tattoo .  His other theater credits include  Mister Roberts ,  The Teahouse of the August Moon ,  Camino Real ,  Major Barbara  ,  Luv , and  Staircase , co-starring ": null
    },
    {
        "Milo OShea": "milo oshea"
    },
    {
        ", which was a serious depiction of an aging ": null
    },
    {
        "homosexual": "homosexuality"
    },
    {
        " couple. He also played a role in a tour of Antony and Cleopatra, produced by the actress ": null
    },
    {
        "Katharine Cornell": "katharine cornell"
    },
    {
        " in 1946. Mosel, Leading Lady: The World and Theatre of Katharine Cornell. He exposed Americans to the work of playwright ": null
    },
    {
        "Eugène Ionesco": "eugène ionesco"
    },
    {
        " in plays like  The Chairs  and  The Lesson  in 1958, and in 1961  Rhinoceros  opposite ": null
    },
    {
        "Zero Mostel": "zero mostel"
    },
    {
        ". He last starred on stage as the title character in  Visiting Mr. Green .         The stage was where Wallach focused his early career. From 1945 to 1950 he and his wife, ": null
    },
    {
        "Anne Jackson": "anne jackson"
    },
    {
        ", worked together acting in various plays by ": null
    },
    {
        "Tennessee Williams": "tennessee williams"
    },
    {
        ". The five years following, he continued only working on stage, not becoming involved in film work until 1956. During those years, however, they were generally having a hard time making ends meet. He recalls they were getting along on unemployment insurance and living in a one-room, $35 a month apartment on lower Fifth Avenue in the Village. When he did get offered early movie parts, he turned them down with no regrets, and very early in his career he explained his reasoning:          He said that the stage was what attracted him most and what he needed to do.  The Evening Class , TCM interview with ": null
    },
    {
        "Robert Osborne": "robert osborne"
    },
    {
        ", May 6, 2010. Acting is the most alive thing I can do, and the most joyous, he stated.     Wallach and Jackson became one of the best-known acting couples in the American theater, as iconic as Alfred Lunt and Lynn Fontanne, and Jessica Tandy and Hume Cronyn, and they looked for opportunities to work together. During an interview, he said of Jackson, I have tremendous respect and admiration for her as an actress. . . we have a terrific working compatibility when were in the same play, especially when the play means something important to us. Ross, Lillian, and Helen. The Player: A Profile of an Art, Simon and Schuster , pp. 159–160. When he did gravitate toward accepting parts in films, he did so to help pay the bills, he said, adding, for actors, movies are a means to an end.     Despite the fact that he eventually acted in over 90 films and almost as many television dramas, he continued to accept stage parts throughout his career, often with Jackson. They played in comedies like The Typists and The Tiger in 1963, and acted together in Waltz of the Toreadors in 1973. In 1978 they played in a revival of The Diary of Anne Frank, along with their daughters, and in 1984 they acted in Nest of the Wood Grouse, directed by ": null
    },
    {
        "Joseph Papp": "joseph papp"
    },
    {
        ". Four years later, in 1988, they acted in a revival of Cafe Crown, a portrait of the ": null
    },
    {
        "Yiddish theatre": "yiddish theatre"
    },
    {
        " scene during its prime. They continued acting together as late as 2000, while he also took on roles alone throughout all those years.          Wallachs film debut was in ": null
    },
    {
        "Elia Kazans": "elia kazan"
    },
    {
        "controversial 1956  Baby Doll , for which he won the ": null
    },
    {
        "British Academy Film Awards": "british academy film awards"
    },
    {
        " as Most Promising Newcomer. Heintzelman, Greta. Critical Companion to Tennessee Williams, Infobase Publishing , p. 33. Baby Doll was controversial because of its underlying sexual theme. Director ": null
    },
    {
        "Elia Kazan": "elia kazan"
    },
    {
        " however, set explicit limits on Wallachs scenes, telling him not to actually seduce ": null
    },
    {
        "Carroll Baker": "carroll baker"
    },
    {
        ", but instead to create an unfulfilled erotic tension. Wallach, Eli. The Good, the Bad, and Me: In My Anecdotage, Houghton Mifflin Harcourt , p. 172. Kazan later explained his reasoning:          Wallach went on to a prolific career as one of the greatest character actor s ever to appear on stage and screen, notes Turner Classic Movies , acting in over 90 films. Having grown up on the mean streets of an Italian American neighborhood, and his versatility as a method actor, Wallach developed the ability to play a wide variety of different roles, although he tried to not get pinned down to any single type of character. Right now Im playing an old man, he said at age 84. But Ive been through all the ethnic groups, from Mexican bandits to Italian Mafia heads to Okinawans to half-breeds, and now Im playing old Jews. Who knows?     Noting this versatility as a character actor, the Academy of Motion Picture Arts and Sciences called him the quintessential chameleon, with the ability to play different characters effortlessly, and L.A. Times theater critic Charles McNulty saw Wallachs power to illuminate his various screen or stage persona s as being radioactive. McNulty, Charles. Los Angeles Times, June 25, 2014. ": null
    },
    {
        "The Guardian": "the guardian"
    },
    {
        " newspaper has written that Wallach was made for character acting, and includes movie clips from some of his most memorable roles in a tribute to him. The Guardian, June 25, 2014.     In 1961, Wallach co-starred with Marilyn Monroe , Montgomery Clift and Clark Gable in ": null
    },
    {
        "The Misfits": "the misfits"
    },
    {
        ", Monroes and Gables last film before their deaths. Wallach never learned why he was cast in the film, although he suspected that Monroe had something to do with it. Its screenwriter, Arthur Miller , who was married to Monroe at the time, said that Eli Wallach is the happiest good actor Ive ever known. He really enjoys the work.     Some of his other films included ": null
    },
    {
        "The Lineup": "the lineup"
    },
    {
        " , ": null
    },
    {
        "Lord Jim": "lord jim"
    },
    {
        " with Peter OToole , a comic role in ": null
    },
    {
        "How to Steal a Million": "how to steal a million"
    },
    {
        " , again with OToole , and Audrey Hepburn , and as Tuco in Sergio Leone s ": null
    },
    {
        "The Good, the Bad and the Ugly": "the good, the bad and the ugly"
    },
    {
        " with Clint Eastwood , followed by other Spaghetti Western s, such as ": null
    },
    {
        "Ace High": "ace high"
    },
    {
        ". At one point, Henry Fonda had asked Wallach whether he himself should accept a part offered to him to act in a similar Western, ": null
    },
    {
        "Once Upon a Time in the West": "once upon a time in the west"
    },
    {
        " , which would also be directed by Leone. Wallach said Yes, youll enjoy the challenge, and Fonda later thanked Wallach for that advice. Schochet, Stephen. Hollywood Stories: Short, Entertaining Anecdotes about the Stars and Legend, Hollywood Stories Publishing , p. 118.     Wallach and Eastwood became friends during the filming of The Good, the Bad and the Ugly and he recalled their off-work time together: Clint was the tall, silent type. Hes the kind where you open up and do all the talking. He smiles and nods and stores it all away in that wonderful calculator of a brain. McGilligan, Patrick. Clint: The Life and Legend, Macmillan , p. 154. In 2003 Wallach acted in Mystic River , produced and directed by Eastwood, who once said working with Eli Wallach has been one of the great pleasures of my life. video: , 4 minutes.     A pivotal moment in Wallachs career came in 1953, when he, along with Frank Sinatra and Harvey Lembeck , tried out for the role of Maggio in the film ": null
    },
    {
        "From Here to Eternity": "from here to eternity"
    },
    {
        ". Sinatra biographer Kitty Kelly notes that while Sinatras test was good, it had none of the consummate acting ability of Wallach. Producer Harry Cohn and director Fred Zinnemann were dazzled by Wallachs screen test and wanted him to play the part. However, Wallach had previously been offered an important role in another Tennessee Williams play, ": null
    },
    {
        "Camino Real": "camino real"
    },
    {
        ", to be directed by Elia Kazan , and turned down the movie role. Wallach said that when he learned that the play had finally received financing, he grabbed the opportunity: It was a remarkable piece of writing by the leading playwright in America and it was going to be directed by the countrys best. There really wasnt much of a choice for me. Kelly, Kitty. His Way: An Unauthorized Biography Of Frank Sinatra, Random House . The film, however, went on to win eight Academy Awards, including one for Sinatra, which revived his career. Wallach recalled afterwards, Whenever Sinatra saw me, he’d say, Hello, you crazy actor! Wallach, however, claimed to have no regrets.     Film historian James Welsh states that during Wallachs career, he appeared in most of the prestige television dramas during the Golden Age of the 1950s, including Studio One, The Philco Television Playhouse, The Armstrong Circle Theatre, Playhouse 90, and The Hallmark Hall of Fame, among others. He won the 1966–1967 Emmy Award for his role in the telefilm The Poppy is Also a Flower. Welsch, James M. and Phillips, Gene D. The Francis Ford Coppola Encyclopedia, Scarecrow Press , p. 273. In 2006 Wallach appeared on NBC s ": null
    },
    {
        "Studio 60 on the Sunset Strip": "studio 60 on the sunset strip"
    },
    {
        ", playing a former writer who was blacklisted in the 1950s. His character was a writer on The Philco Comedy Hour, a show that aired on a fictional NBS network. This is a reference to ": null
    },
    {
        "The Philco Television Playhouse": "the philco television playhouse"
    },
    {
        ", in several episodes of which Wallach actually appeared in 1955. Wallach earned a 2007 Emmy nomination for his work on the show.     thu   During the filming of The Good, the Bad and the Ugly, Wallach nearly died three times. Once, he accidentally drank a bottle of acid which was placed next to his pop bottle; another time was in a scene where he was about to be hanged, someone fired a pistol which caused the horse underneath him to bolt and run a mile while Wallachs hands were still tied behind his back; in a different scene with him lying on a railroad track, he was close to being decapitated by steps jutting out from the train. Armour, Philip. The 100 Greatest Western Movies of All Time, Morris Book Publishing , p. 70.     Wallach appeared as DC Comics supervillain Mr. Freeze in the 1960s ": null
    },
    {
        "Batman": "batman"
    },
    {
        " television series. He said that he received more fan mail about his role as Mr. Freeze than about all of his other roles combined. Reuters, June 25, 2014.   He played Gus Farber in the television miniseries ": null
    },
    {
        "Seventh Avenue": "seventh avenue"
    },
    {
        " in 1977, and 10 years later, at the age of 71, he starred alongside Michael Landon in ": null
    },
    {
        "Highway to Heaven": "highway to heaven"
    },
    {
        " episode A Fathers Faith . Three years later he played aging mob boss Don Altobello in the third episode of Francis Ford Coppolas Godfather trilogy.     On November 13, 2010, at the age of 94, Wallach received an Academy Honorary Award for his contribution to the film industry from the Academy of Motion Picture Arts and Sciences . , November 13, 2010. A few years prior to that event, Kate Winslet told another audience that Wallach, with whom she acted in ": null
    },
    {
        "The Holiday": "the holiday"
    },
    {
        " in 2006, was one of the most charismatic men shed met, and her very own sexiest man alive.     Wallachs final performance was in the short film The Train . Wallach plays a holocaust survivor, who in a meeting teaches a self-consumed and preoccupied young man that life can change in a moment. The short was shot in early 2014 and premiered on August 6, 2015 at the Rhode Island International Film Festival.     Between 1984 and 1997, he also did voice overs in a series of commercials for the Toyota Pickup .       Eli Wallach was married to stage actress Anne Jackson for 66 years from March 5, 1948, until his death. They had three children: Peter , Roberta , and Katherine . Roberta played an epileptic teenager in Paul Zindel s ": null
    },
    {
        "The Effect of Gamma Rays on Man-in-the-Moon Marigolds": "the effect of gamma rays on man-in-the-moon marigolds"
    },
    {
        " and appeared in several other movies.     Wallach was a strict teetotaler and once asked the director John Huston for advice on how to play a drunk scene during the filming of ": null
    },
    {
        "The Misfits": "the misfits"
    },
    {
        ".     A few years before 2005, Wallach lost sight in his left eye as the result of a stroke.     His niece is the historian Joan Wallach Scott . A. O. Scott , a film critic for ": null
    },
    {
        "The New York Times": "the new york times"
    },
    {
        ", is his great-nephew.       Wallach died on June 24, 2014, of natural causes at the age of 98. He was survived by his wife of 66 years, three children, three grandchildren and a great-grandchild. His body was cremated.     Katherine Wallach told ": null
    },
    {
        "The New York Times": "the new york times"
    },
    {
        " Anne Jackson died on April 14, 2016, aged 90, at her home in ": null
    },
    {
        "Manhattan": "manhattan"
    },
    {
        ".                   ": null
    }
]