[
    {
        "   Elias Boudinot  was a lawyer and statesman from ": null
    },
    {
        "Elizabeth, New Jersey": "elizabeth, new jersey"
    },
    {
        " who was a delegate to the ": null
    },
    {
        "Continental Congress": "continental congress"
    },
    {
        "  and served as President of Congress from 1782 to 1783. He was elected as a ": null
    },
    {
        "U.S. Congressman": "united states house of representatives"
    },
    {
        " for ": null
    },
    {
        "New Jersey": "new jersey"
    },
    {
        " following the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ". He was appointed by President ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        " as Director of the ": null
    },
    {
        "United States Mint": "united states mint"
    },
    {
        ", serving from 1795 until 1805.              Elias Boudinot was born in ": null
    },
    {
        "Philadelphia": "philadelphia, pennsylvania"
    },
    {
        " on May 2, 1740. His father, Elias Boudinot III, was a merchant and silversmith; he was a neighbor and friend of ": null
    },
    {
        "Benjamin Franklin": "benjamin franklin"
    },
    {
        ". His mother, Mary Catherine Williams, was born in the ": null
    },
    {
        "British West Indies": "british west indies"
    },
    {
        "; her father was from ": null
    },
    {
        "Wales": "wales"
    },
    {
        ". Elias paternal grandfather, Elie Boudinot, was the son of Jean Boudinot and Marie Suire of Marans, Aunis, ": null
    },
    {
        "France": "france"
    },
    {
        ". They were a ": null
    },
    {
        "Huguenot": "huguenot"
    },
    {
        " family who fled to New York about 1687 to avoid the religious persecutions of King ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        ".     Mary Catherine Williams and Elias Boudinot Sr. were married on August 8, 1729. Over the next twenty years, they had nine children. The first, John, was born in the British West Indies-Antigua. Of the others, only the younger Elias and his siblings ": null
    },
    {
        "Annis": "annis boudinot stockton"
    },
    {
        ", Mary, and Elisha reached adulthood. Annis became one of the first published women poets in the ": null
    },
    {
        "Thirteen Colonies": "thirteen colonies"
    },
    {
        ", and her work appeared in leading newspapers and magazines. Elisha Boudinot became Chief Justice of the ": null
    },
    {
        "Supreme Court of New Jersey": "supreme court of new jersey"
    },
    {
        ".     After studying and being tutored at home, Elias Boudinot went to ": null
    },
    {
        "Princeton, New Jersey": "princeton, new jersey"
    },
    {
        " to read the law as a legal apprentice to ": null
    },
    {
        "Richard Stockton": "richard stockton"
    },
    {
        ". An attorney, he had married Elias older sister ": null
    },
    {
        "Annis Boudinot": "annis boudinot stockton"
    },
    {
        ". Richard Stockton was later a signatory of the ": null
    },
    {
        "Declaration of Independence": "united states declaration of independence"
    },
    {
        ".       In 1760, Boudinot was admitted to the bar, and began his practice in ": null
    },
    {
        "Elizabeth, New Jersey": "elizabeth, new jersey"
    },
    {
        ". He owned land adjacent to the road from Elizabethtown to ": null
    },
    {
        "Woodbridge Township, New Jersey": "woodbridge township, new jersey"
    },
    {
        ".          After getting established, on April 21, 1762, Boudinot married Hannah Stockton , Richards younger sister. They had two children, Maria Boudinot, who died at age two, and Susan Vergereau Boudinot.     Susan married ": null
    },
    {
        "William Bradford": "william bradford"
    },
    {
        ", who became ": null
    },
    {
        "Chief Justice of Pennsylvania": "supreme court of pennsylvania"
    },
    {
        " and ": null
    },
    {
        "Attorney General": "united states attorney general"
    },
    {
        " under ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        ". After her husbands death in 1795, Susan Boudinot Bradford returned to her parents home to live. The young widow edited her fathers papers. Now held by ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        ", these provide significant insight into the events of the Revolutionary era.     In 1805, Elias, Hannah and Susan moved to a new home in ": null
    },
    {
        "Burlington, New Jersey": "burlington, new jersey"
    },
    {
        ". Hannah died a few years after their move, and Elias lived there for the remainder of his years.       In his later years, Boudinot invested and speculated in land. He owned large tracts in ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        " including most of ": null
    },
    {
        "Green Township": "green township, hamilton county, ohio"
    },
    {
        " in what is now the western suburbs of ": null
    },
    {
        "Cincinnati": "cincinnati, ohio"
    },
    {
        ", where there is a street bearing his surname. At his death, he willed  to the city of Philadelphia for parks and city needs. He was buried in the churchyard of St. Marys Church, Burlington, New Jersey. , ": null
    },
    {
        "Biographical Directory of the United States Congress": "biographical directory of the united states congress"
    },
    {
        ". Accessed August 21, 2007.       Boudinot became a prominent lawyer and his practice prospered. As the revolution drew near, he aligned with the ": null
    },
    {
        "Whigs": "radical whigs"
    },
    {
        ", and was elected to the New Jersey provincial assembly in 1775. In the early stages of the ": null
    },
    {
        "Revolutionary War": "american revolutionary war"
    },
    {
        ", he was active in promoting enlistment; several times he loaned money to field commanders to purchase supplies. Boudinot helped support the activities of rebel spies. After the British occupation of New York City, spies were sent to ": null
    },
    {
        "Staten Island": "staten island"
    },
    {
        " and ": null
    },
    {
        "Long Island, New York": "long island, new york"
    },
    {
        " to observe and report on movements of specific British garrisons and regiments.     On May 5, 1777, General ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        " asked Boudinot to be appointed as commissary general for prisoners. Congress through the board of war concurred. Boudinot was commissioned as a colonel in the ": null
    },
    {
        "Continental Army": "continental army"
    },
    {
        " for this work. He served until July 1778, when competing responsibilities forced him to resign. The commissary managed enemy prisoners, and also was responsible for supplying ": null
    },
    {
        "American prisoners": "american revolution prisoners of war"
    },
    {
        " who were held by the British.     In November 1777, the New Jersey legislature named Boudinot as one of their delegates to the ": null
    },
    {
        "Second Continental Congress": "second continental congress"
    },
    {
        ". His duties as Commissary prevented his attendance, so in May 1778 he resigned. By early July he had been replaced and attended his first meeting of the Congress on July 7, 1778. As a delegate, he still continued his concerns for the welfare of prisoners of war. His first term ended that year.     In 1781, Boudinot returned to the Congress, for a term lasting through 1783. In November 1782, he was elected as ": null
    },
    {
        "President of the Continental Congress": "president of the continental congress"
    },
    {
        " for a one-year term. The President of Congress was a mostly ceremonial position with no real authority, but the office did require him to handle a good deal of correspondence and sign official documents.  On April 15, 1783 he signed the Preliminary Articles of Peace.  When the United States government was formed in 1789, Boudinot was elected from New Jersey to the US ": null
    },
    {
        "House of Representatives": "united states house of representatives"
    },
    {
        ". He was elected to the second and third congresses as well, where he generally supported the administration. He refused to join the expansion of affiliated groups that formed formal political parties.     In 1794, he declined to serve another term, and left Congress in early 1795. In October 1795, President ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        " appointed him as Director of the ": null
    },
    {
        "United States Mint": "united states mint"
    },
    {
        ", a position he held through succeeding administrations until he retired in 1805.       In addition to serving in political office, Elias supported many civic, religious, and educational causes during his life. Boudinot served as one of the trustees of the College of New Jersey  for nearly half a century, from 1772 until 1821. When the Continental Congress was forced to leave Philadelphia in 1783 while he was president, he moved the meetings to ": null
    },
    {
        "Princeton": "princeton, new jersey"
    },
    {
        ", where they met in the Colleges ": null
    },
    {
        "Nassau Hall": "nassau hall"
    },
    {
        ".     On September 24, 1789, the House of Representatives voted to recommend the First Amendment of the newly drafted Constitution to the states for ratification. The next day, Congressman Boudinot proposed that the House and Senate jointly request of President Washington to proclaim a day of thanksgiving for the many signal favors of Almighty God. Boudinot said that he   could not think of letting the session pass over without offering an opportunity to all the citizens of the United States of joining, with one voice, in returning to Almighty God their sincere thanks for the many blessings he had poured down upon them. The Annals of the Congress, The Debates and Proceedings in the Congress of the United States, Compiled From Authentic Materials, compiled by Joseph Gales, Senior , 1:949–950     Boudinot was elected a member of the ": null
    },
    {
        "American Antiquarian Society": "american antiquarian society"
    },
    {
        " in 1814.      A devout ": null
    },
    {
        "Presbyterian": "presbyterian"
    },
    {
        ", Boudinot supported missions and missionary work. He wrote The Age of Revelation in response to Thomas Paines The Age of Reason. He was one of the founders of the ": null
    },
    {
        "American Bible Society": "american bible society"
    },
    {
        ", and after 1816 served as its President.     He argued for the rights of black and ": null
    },
    {
        "American Indian": "native americans in the united states"
    },
    {
        " citizens, and sponsored students to the Board School for Indians in ": null
    },
    {
        "Connecticut": "connecticut"
    },
    {
        ". One of these, a young Cherokee named Gallegina Uwatie, also known as Buck Watie, stayed with him in Burlington on his way to the school. The two so impressed each other that Gallegina asked for and was given permission to adopt the statesmans name. Later known as ": null
    },
    {
        "Elias Boudinot": "elias boudinot"
    },
    {
        ", he was an editor of the Cherokee Phoenix, the nations first newspaper, which was published in Cherokee and English.       ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        " Library holds the Boudinot-Stockton papers, as well as many family possessions and portraits.   Elias Boudinot Elementary School in ": null
    },
    {
        "Burlington, New Jersey": "burlington, new jersey"
    },
    {
        " is named after him, as are the following:   Boudinot Street in Philadelphia, located between C and D Streets.   Boudinot Avenue in Western Hills, ": null
    },
    {
        "Cincinnati, Ohio": "cincinnati, ohio"
    },
    {
        " home of the original ": null
    },
    {
        "LaRosas": "larosas"
    },
    {
        " pizzeria.   Boudinot Place in ": null
    },
    {
        "Elizabeth, New Jersey": "elizabeth, new jersey"
    },
    {
        " Princeton, New Jersey": "princeton, new jersey"
    },
    {
        ".   Boudinot Lane in ": null
    },
    {
        "Franklin Township, New Jersey": "franklin township, somerset county, new jersey"
    },
    {
        " Bernards Township, Somerset County, New Jersey": "bernards township, somerset county, new jersey"
    },
    {
        "               The ": null
    },
    {
        "Presbyterian Historical Society": "presbyterian historical society"
    },
    {
        " in ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        " has a ": null
    }
]