[
    {
        "      The Elymians  were an ancient people who inhabited the western part of ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " during the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " and ": null
    },
    {
        "Classical antiquity": "classical antiquity"
    },
    {
        ".       Apart from mythological tales, there is little known about the identity and culture of the Elymians. They are indistinguishable from their Sicani neighbours in the archaeological record of the early ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " . Thereafter they appear to have adopted many aspects of the culture of the Greek colonists of Sicily, erecting the remarkable temple at ": null
    },
    {
        "Segesta": "segesta"
    },
    {
        " and using the ": null
    },
    {
        "Greek alphabet": "greek alphabet"
    },
    {
        " to write their own language. As yet, no one has succeeded in deciphering the ": null
    },
    {
        "Elymian language": "elymian language"
    },
    {
        ".            The Elymians maintained friendly relations with ": null
    },
    {
        "Carthage": "carthage"
    },
    {
        " but came into frequent conflict with the expansionist Greek colonies of western Sicily, especially ": null
    },
    {
        "Selinus": "selinus"
    },
    {
        ". Boundary disputes with Selinus broke out into open warfare on several occasions after 42 BC. They sought to ally first with ": null
    },
    {
        "Athens": "athens"
    },
    {
        " against Selinus, provoking the disastrous ": null
    },
    {
        "Sicilian expedition": "sicilian expedition"
    },
    {
        " of 42–42 BC. Following this failure they encouraged the Carthaginians to attack Selinus in 42 BC and succeeded in obtaining the destruction of their rivals.     However, they turned on Carthage during the ": null
    },
    {
        "First Punic War": "first punic war"
    },
    {
        " and allied with ": null
    },
    {
        "Rome": "roman republic"
    },
    {
        " instead. The Elymians were granted a privileged status under Roman rule and were exempted from taxes. This was said to have been in recognition of the Elymians claim of Trojan ancestry, which was seen as making them cousins of the Roman people, who also claimed to have been descended from the Trojans. The Elymians appear to have largely disappeared from view under Roman rule, presumably becoming assimilated into the general Sicilian population.          The Elymi shared western Sicily with the Sicani, the ": null
    },
    {
        "Phoenicia": "phoenicia"
    },
    {
        "ns, and later the Greeks. Their three most important cities were ": null
    },
    {
        "Segesta": "segesta"
    },
    {
        ", the political centre; ": null
    },
    {
        "Eryx": "eryx"
    },
    {
        " , a religious centre; and ": null
    },
    {
        "Entella": "entella"
    },
    {
        ". Other cities were ": null
    },
    {
        "Elima": "elima"
    },
    {
        ", ": null
    },
    {
        "Halyciae": "halyciae"
    },
    {
        " , ": null
    },
    {
        "Iaitas": "iaitas"
    },
    {
        ", ": null
    },
    {
        "Hypana": "hypana"
    },
    {
        ", and ": null
    },
    {
        "Drepanon": "drepanon"
    }
]