[
    {
        "           Embroidery is the ": null
    },
    {
        "craft": "craft"
    },
    {
        " of decorating ": null
    },
    {
        "fabric": "textile"
    },
    {
        " or other materials using a ": null
    },
    {
        "needle": "sewing needle"
    },
    {
        " to apply ": null
    },
    {
        "thread or yarn": "yarn"
    },
    {
        ".     Embroidery may also incorporate other materials such as ": null
    },
    {
        "pearl": "pearl"
    },
    {
        "s, ": null
    },
    {
        "bead": "bead"
    },
    {
        "s, ": null
    },
    {
        "quill": "quill"
    },
    {
        "s, and ": null
    },
    {
        "sequin": "sequin"
    },
    {
        "s. In modern days, embroidery is usually seen on caps, hats, coats, blankets, dress shirts, denim, dresses, stockings, and ": null
    },
    {
        "golf shirt": "golf shirt"
    },
    {
        "s. Embroidery is available with a wide variety of ": null
    },
    {
        "thread or yarn": "yarn"
    },
    {
        " color.     Some of the basic techniques or ": null
    },
    {
        "stitches": "embroidery stitch"
    },
    {
        " of the earliest embroidery are ": null
    },
    {
        "chain stitch": "chain stitch"
    },
    {
        ", ": null
    },
    {
        "buttonhole or blanket stitch": "buttonhole stitch"
    },
    {
        ", ": null
    },
    {
        "running stitch": "running stitch"
    },
    {
        ", ": null
    },
    {
        "satin stitch": "satin stitch"
    },
    {
        ", ": null
    },
    {
        "cross stitch": "cross stitch"
    },
    {
        ". Those stitches remain the fundamental techniques of hand embroidery today.                 The process used to tailor, patch, mend and reinforce cloth fostered the development of sewing techniques, and the decorative possibilities of sewing led to the art of embroidery. Indeed, the remarkable stability of basic embroidery stitches has been noted:          The art of embroidery has been found worldwide and several early examples have been found. Works in China have been dated to the ": null
    },
    {
        "Warring States period": "warring states period"
    },
    {
        " . In a garment from ": null
    },
    {
        "Migration period": "migration period"
    },
    {
        " Sweden, roughly 300–700 AD, the edges of bands of trimming are reinforced with running stitch, back stitch, stem stitch, tailors buttonhole stitch, and whip-stitching, but it is uncertain whether this work simply reinforced the seams or should be interpreted as decorative embroidery. Coatsworth, Elizabeth: Stitches in Time: Establishing a History of Anglo-Saxon Embroidery , in .     Ancient ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        " has credited the goddess ": null
    },
    {
        "Athena": "athena"
    },
    {
        " with passing down the art of embroidery along with ": null
    },
    {
        "weaving": "weaving"
    },
    {
        ", leading to the famed competition between herself and the mortal ": null
    },
    {
        "Arachne": "arachne"
    },
    {
        ".        Depending on time, location and materials available, embroidery could be the domain of a few experts or a widespread, popular technique. This flexibility led to a variety of works, from the royal to the mundane.     Elaborately embroidered clothing, religious objects, and household items often were seen as a mark of wealth and status, as in the case of ": null
    },
    {
        "Opus Anglicanum": "opus anglicanum"
    },
    {
        ", a technique used by professional workshops and guilds in medieval ": null
    },
    {
        "England": "england"
    },
    {
        ". In 18th-century England and its colonies, samplers employing fine silks were produced by the daughters of wealthy families. Embroidery was a skill marking a girls path into womanhood as well as conveying rank and social standing.      Conversely, embroidery is also a folk art, using materials that were accessible to nonprofessionals. Examples include ": null
    },
    {
        "Hardanger": "hardanger"
    },
    {
        " from Norway, ": null
    },
    {
        "Merezhka": "drawn thread workpoltava-style drawnwork"
    },
    {
        " from ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        ", ": null
    },
    {
        "Mountmellick embroidery": "mountmellick embroidery"
    },
    {
        " from Ireland, ": null
    },
    {
        "Nakshi kantha": "nakshi kantha"
    },
    {
        " from ": null
    },
    {
        "Bangladesh": "bangladesh"
    },
    {
        " and ": null
    },
    {
        "West Bengal": "west bengal"
    },
    {
        ", and ": null
    },
    {
        "Brazilian embroidery": "brazilian embroidery"
    },
    {
        ". Many techniques had a practical use such as ": null
    },
    {
        "Sashiko": "sashiko"
    },
    {
        " from ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", which was used as a way to reinforce clothing.                      Embroidery was an important art in the Medieval Islamic world. The 17th-century ": null
    },
    {
        "Turkish": "turkish people"
    },
    {
        " traveler ": null
    },
    {
        "Evliya Çelebi": "evliya çelebi"
    },
    {
        " called it the craft of the two hands . Because embroidery was a sign of high social status in Muslim societies, it became widely popular. In cities such as ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ", ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " and ": null
    },
    {
        "Istanbul": "istanbul"
    },
    {
        ", embroidery was visible on ": null
    },
    {
        "handkerchief": "handkerchief"
    },
    {
        "s, uniforms, flags, ": null
    },
    {
        "calligraphy": "calligraphy"
    },
    {
        ", shoes, ": null
    },
    {
        "robe": "robe"
    },
    {
        "s, tunics, horse trappings, slippers, sheaths, pouches, covers, and even on ": null
    },
    {
        "leather": "leather"
    },
    {
        " belts": "belt"
    },
    {
        ". Craftsmen embroidered items with ": null
    },
    {
        "gold": "gold"
    },
    {
        " and ": null
    },
    {
        "silver": "silver"
    },
    {
        " thread. Embroidery cottage industries, some employing over 800 people, grew to supply these items.      In the 16th century, in the reign of the ": null
    },
    {
        "Mughal Emperor": "mughal emperor"
    },
    {
        " Akbar": "akbar"
    },
    {
        ", his chronicler ": null
    },
    {
        "Abu al-Fazl ibn Mubarak": "abu al-fazl ibn mubarak"
    },
    {
        " wrote in the famous ": null
    },
    {
        "Ain-i-Akbari": "ain-i-akbari"
    },
    {
        ":   His majesty pays much attention to various stuffs; hence ": null
    },
    {
        "Iran": "iran"
    },
    {
        "i, ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        ", and ": null
    },
    {
        "Mongolia": "mongolia"
    },
    {
        "n articles of wear are in much abundance especially textiles embroidered in the patterns of Nakshi, Saadi, Chikhan, Ari, Zardozi, Wastli, Gota and Kohra. The imperial workshops in the towns of ": null
    },
    {
        "Lahore": "lahore"
    },
    {
        ", ": null
    },
    {
        "Agra": "agra"
    },
    {
        ", ": null
    },
    {
        "Fatehpur": "fatehpur sikri"
    },
    {
        " and ": null
    },
    {
        "Ahmedabad": "ahmedabad"
    },
    {
        " turn out many masterpieces of workmanship in fabrics, and the figures and patterns, knots and variety of fashions which now prevail astonish even the most experienced travelers. Taste for fine material has since become general, and the drapery of embroidered fabrics used at feasts surpasses every description.           The development of machine embroidery and its ": null
    },
    {
        "mass production": "mass production"
    },
    {
        " came about in stages during the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        ". The first embroidery machine was the ": null
    },
    {
        "hand embroidery machine": "hand embroidery machine"
    },
    {
        ", invented in France in 1832 by Josué Heilmann.  The next evolutionary step was the ": null
    },
    {
        "schiffli embroidery machine": "schiffli embroidery machine"
    },
    {
        ". The latter borrowed from the sewing machine and the ": null
    },
    {
        "Jacquard loom": "jacquard machine"
    },
    {
        " to fully automate its operation. The manufacture of ": null
    },
    {
        "machine-made embroideries": "st. gallen embroidery"
    },
    {
        " in ": null
    },
    {
        "St. Gallen": "st. gallen"
    },
    {
        " in eastern Switzerland flourished in the latter half of the 19th century. Röllin, Peter. Stickerei-Zeit, Kultur und Kunst in St. Gallen 1870–1930. VGS Verlagsgemeinschaft, St. Gallen 1989,  Both St. Gallen, Switzerland and ": null
    },
    {
        "Plauen, Germany": "plauen"
    },
    {
        " were important centers for machine embroidery and embroidery machine development. Many Swiss and Germans immigrated to ": null
    },
    {
        "Hudson county, New Jersey": "hudson county, new jersey"
    },
    {
        " in the early twentieth century and developed a machine embroidery industry there. Shiffli machines have continued to evolve and are still used for industrial scale embroidery.                 Embroidery can be classified according to what degree the design takes into account the nature of the base material and by the relationship of stitch placement to the fabric. The main categories are free or surface embroidery, counted embroidery, and needlepoint or canvas work.      In free or surface embroidery, designs are applied without regard to the weave of the underlying fabric. Examples include ": null
    },
    {
        "crewel": "crewel embroidery"
    },
    {
        " and traditional Chinese and Japanese embroidery.     ": null
    },
    {
        "Counted-thread embroidery": "counted-thread embroidery"
    },
    {
        " patterns are created by making stitches over a predetermined number of threads in the foundation fabric. Counted-thread embroidery is more easily worked on an ": null
    },
    {
        "even-weave": "even-weave"
    },
    {
        " foundation fabric such as embroidery ": null
    },
    {
        "canvas": "canvas"
    },
    {
        ", ": null
    },
    {
        "aida cloth": "aida cloth"
    },
    {
        ", or specially woven ": null
    },
    {
        "cotton": "cotton"
    },
    {
        " and ": null
    },
    {
        "linen": "linen"
    },
    {
        " fabrics. Examples include ": null
    },
    {
        "cross-stitch": "cross-stitch"
    },
    {
        " and some forms of ": null
    },
    {
        "blackwork embroidery": "blackwork embroidery"
    },
    {
        ".     While similar to counted thread in regards to technique, in ": null
    },
    {
        "canvas work": "canvas work"
    },
    {
        " or ": null
    },
    {
        "needlepoint": "needlepoint"
    },
    {
        ", threads are stitched through a fabric mesh to create a dense pattern that completely covers the foundation fabric. Examples of canvas work include ": null
    },
    {
        "bargello": "bargello"
    },
    {
        " and ": null
    },
    {
        "Berlin wool work": "berlin wool work"
    },
    {
        ".     Embroidery can also be classified by the similarity of appearance. In ": null
    },
    {
        "drawn thread work": "drawn thread work"
    },
    {
        " and ": null
    },
    {
        "cutwork": "cutwork"
    },
    {
        ", the foundation fabric is deformed or cut away to create holes that are then embellished with embroidery, often with thread in the same color as the foundation fabric. When created with white thread on white linen or cotton, this work is collectively referred to as ": null
    },
    {
        "whitework": "whitework"
    },
    {
        ". However, whitework can either be counted or free. ": null
    },
    {
        "Hardanger embroidery": "hardanger embroidery"
    },
    {
        " is a counted embroidery and the designs are often geometric.  Conversely, styles such as ": null
    },
    {
        "Broderie anglaise": "broderie anglaise"
    },
    {
        " are similar to free embroidery, with floral or abstract designs that are not dependent on the weave of the fabric.                   The fabrics and yarns used in traditional embroidery vary from place to place. ": null
    },
    {
        "Wool": "wool"
    },
    {
        ", ": null
    },
    {
        "linen": "linen"
    },
    {
        ", and ": null
    },
    {
        "silk": "silk"
    },
    {
        " have been in use for thousands of years for both fabric and yarn. Today, ": null
    },
    {
        "embroidery thread": "embroidery thread"
    },
    {
        " is manufactured in ": null
    },
    {
        "cotton": "cotton"
    },
    {
        ", ": null
    },
    {
        "rayon": "rayon"
    },
    {
        ", and ": null
    },
    {
        "novelty yarns": "novelty yarn"
    },
    {
        "as well as in traditional wool, linen, and silk. ": null
    },
    {
        "Ribbon": "ribbon"
    },
    {
        " embroidery uses narrow ribbon in silk or silk/": null
    },
    {
        "organza": "organza"
    },
    {
        " blend ribbon, most commonly to create floral motifs.     Surface embroidery techniques such as chain stitch and ": null
    },
    {
        "couching": "couching"
    },
    {
        " or laid-work are the most economical of expensive yarns; couching is generally used for ": null
    },
    {
        "goldwork": "goldwork"
    },
    {
        ". Canvas work techniques, in which large amounts of yarn are buried on the back of the work, use more materials but provide a sturdier and more substantial finished textile.     In both canvas work and surface embroidery an ": null
    },
    {
        "embroidery hoop": "embroidery hoop"
    },
    {
        " or frame can be used to stretch the material and ensure even stitching tension that prevents pattern distortion. Modern canvas work tends to follow symmetrical counted stitching patterns with designs emerging from the repetition of one or just a few similar stitches in a variety of hues. In contrast, many forms of surface embroidery make use of a wide range of stitching patterns in a single piece of work.            Contemporary embroidery is stitched with a ": null
    },
    {
        "computer": "computer"
    },
    {
        "ized embroidery machine using patterns digitized with ": null
    },
    {
        "embroidery software": "embroidery software"
    },
    {
        ". In ": null
    },
    {
        "machine embroidery": "machine embroidery"
    },
    {
        ", different types of fills add texture and design to the finished work. ": null
    },
    {
        "Machine embroidery": "machine embroidery"
    },
    {
        " is used to add ": null
    },
    {
        "logos": "logo"
    },
    {
        "and ": null
    },
    {
        "monograms": "monogram"
    },
    {
        "to business shirts or jackets, gifts, and team apparel as well as to decorate household linens, draperies, and decorator fabrics that mimic the elaborate hand embroidery of the past.     Machine embroidery is most typically done with ": null
    },
    {
        "rayon thread": "rayon"
    },
    {
        ", although ": null
    },
    {
        "polyester thread": "polyester"
    },
    {
        " can also be used. ": null
    },
    {
        "Cotton": "cotton"
    },
    {
        " thread, on the other hand, is prone to breaking and should be avoided if under 30 ": null
    },
    {
        "wt": "thread wt and gunze count"
    },
    {
        ".      There has also been a development in free hand machine embroidery, new machines have been designed that allow for the user to create free-motion embroidery which has its place in textile arts, quilting, dressmaking, home furnishings and more.  Users can use the embroidery software to digitize the digital embroidery designs. These digitized design are then transferred to the embroidery machine with the help of a flash drive and then the embroidery machine embroiders the selected design onto the fabric.       In the last couple of years there has been an exponential growth in the popularity of embroidering by hand. As a result of visual media such as Pinterest and Instagram, artists are able to share their work more extensively, which has inspired younger generations to pick up needle and threads.     Contemporary embroidery artists believe hand embroidery has grown in popularity as a result of an increasing need for relaxation and digitally disconnecting practises  . Along with technological advancements and social media, people are getting more aware of the need for digital detox and hand embroidery  allows for that.     Modern hand embroidery, as opposed to ": null
    },
    {
        "cross-stitching": "cross-stitch"
    },
    {
        ", is characterised by a more liberal approach. Where stitches are more freely combined in unconventional ways to create various textures and designs.       City and Guilds qualification  in embroidery allows embroiderers to become recognized for their skill. This qualification also gives them the credibility to teach. For example, the notable textiles artist, ": null
    },
    {
        "Kathleen Laurel Sage": "kathleen laurel sage"
    },
    {
        ",  began her teaching career by getting the City and Guilds Embroidery 1 and 2 qualifications. She has now gone on to write a book on the subject.  ": null
    },
    {
        "silk": "silk"
    },
    {
        " gauze ritual garment. Rows of even, round ": null
    },
    {
        "chain stitch": "chain stitch"
    },
    {
        " used for outline and color. 4th century BC, ": null
    },
    {
        "Zhou": "zhou dynasty"
    },
    {
        " tomb at Mashan, ": null
    },
    {
        "Hubei": "hubei"
    },
    {
        ", ": null
    },
    {
        "China": "china"
    },
    {
        " English": "english embroidery"
    },
    {
        " cope": "cope"
    },
    {
        ", late 15th or early 16th century. Silk velvet embroidered with silk and gold threads, closely laid and couched. Contemporary ": null
    },
    {
        "Art Institute of Chicago": "art institute of chicago"
    },
    {
        " St. Gallen Embroidery": "st. gallen embroidery"
    },
    {
        " parandja ": null
    },
    {
        "tefillin": "tefillin"
    },
    {
        " Bedouin": "bedouin"
    }
]