[
    {
        "         Emeritus /Emerita  , in its current usage, is an adjective used to designate a retired chairperson, professor, pastor, bishop, pope, director, president, prime minister, rabbi, emperor, or other person. Like the Romance languages derived from it, Latin contains many words that are gender-specific: Emeritus is used for a male; emerita for a female.     In some cases, the term is conferred automatically upon all persons who retire at a given rank, but in others, it remains a mark of distinguished service, awarded only to a few on retirement. It is also used when a person of distinction in a profession retires or hands over the position, enabling their former rank to be retained in their title, e.g., Professor Emeritus . The term emeritus does not necessarily signify that a person has relinquished all the duties of their former position, and they may continue to exercise some of them.       Ēmĕ́rĕre is a compound of the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " prefix ē-  meaning out of, from and mĕ́rĕre meaning earn ; ēmĕ́rĭtus is the past participle of the verb. The female equivalent, ēmĕ́rǐta , is also sometimes used, but as is often true of loanwords, the use of the donor languages inflectional system faces limits in the recipient language; in English, emeritus is often unmarked for gender.       In the United States and other countries, a fully tenured professor who retires from an educational institution in good standing may be given the title professor emeritus regardless of gender. The title professor emerita is sometimes used for women. In most systems and institutions, the rank is bestowed on all professors who have retired in good standing, while at others, it needs a special act or vote. Professors emeriti may, depending on local circumstances, retain office space or other privileges. The word is used either as a postpositional adjective , or as a prepositional adjective . The concept has in some places been expanded to include tenured associate professors or non-tenure-track faculty.     In the United Kingdom and most other parts of the world, the term emeritus professor is given only to a person of outstanding merit who had full professorial status before he or she retired. The possession of a PhD or other higher degree, or even full professorial status, is not sufficient for calling oneself emeritus professor upon retirement. The term Professor Emeritus is also recognised in the United Kingdom. The word is capitalized when it forms part of a title which is capitalized. Oxbridge colleges may appoint distinguished fellows who have retired as Emeritus Fellow .         When a diocesan bishop or auxiliary bishop retires, the word emeritus is added to his former title, i.e., Archbishop Emeritus of ... , Bishop Emeritus of ... , or Auxiliary Bishop Emeritus of ... Examples of usage are: The Most Reverend John Jones, Bishop Emeritus of Anytown ; and His Eminence Cardinal James Smith, Archbishop Emeritus of Anycity . The term Bishop Emeritus of a particular see can apply to several people, if the first lives long enough. The sees listed in the 42 Annuario Pontificio as having more than one Bishop Emeritus included Zárate-Campana, Villavicencio, Versailles, and Uruguaiana. There were even three Archbishops Emeriti of Taipei. The same suffix was applied to the Bishop of Rome, Pope Emeritus Benedict XVI, on his retirement. In the Roman Catholic Church the word emeritus does not imply that the person in question is no longer a ": null
    },
    {
        "priest": "priesthood in the catholic church"
    },
    {
        ".": null
    }
]