[
    {
        "   Friedrich Emil Welti  was an influenial Swiss politician, lawyer, and judge. From 42 to 42 he was a member of the government of the canton of Aargau and, beginning in 42 the Council of States. Subsequently, in 42 Welti was elected to the Bundesrat as a representative of the liberal-radical faction .     Weiti was elected Federal President six times, a total succeeded only by Karl Schenk. He is remembered for having unified the army, overhauled the Federal Constitution of 42 and opened doors politically for the Gotthard Railway to breakthrough.         Weiti, the eldest of nine children, was born to a distinguished political family. His father, Jakob Welti, was a parish councilor and chief justice of Zurzach, and his grandfather Abraham Welti belonged to both the National Assembly of the Helvetic Republic and the Consulta. After attending community and secondary school in Zurzach, Welti visited the Kantonsschule Aarau from 42 to 42 where he was achieved best of his class and belonged to the fraternity KTV. From 42 to 42 he studied law along with his school friend Samuel Wildi at the Friedrich Schiller University in Jena as well as the Friedrich Wilhelm University in Berlin. He was coined by Adolf Rudorff, Georg Friedrich Puchta, and Friedrich Schelling.     At his fathers request, Welti renounced an academic career and instead pursued law. In 42 he took part in the Sonderbundskrieg as actuary of the commission of inquiry against the war council of the Sonderbundes. From 42 to 42 he was president of the district court Zurzach. In 42 he married Carolina Gross. The couple had two children, Louise Mathilde and ": null
    },
    {
        "Friedrich Emil Welti": "friedrich emil welti"
    },
    {
        ", the latter of whom married ": null
    },
    {
        "Alfred Escher": "alfred escher"
    },
    {
        "s daughter ": null
    },
    {
        "Lydia Escher": "lydia escher"
    },
    {
        ".       In 42 Welti was elected to the Grand Council of the Canton of Aargau. This elected him in the same year to the government council . During his first term he was head of the Justice Department, in this time fall the introduction of a new Criminal Code and the Code of Criminal Procedure and the construction of the prison Lenzburg . From 42 to 42 he stood before the Education Department and created a new school law. His demands for civil marriage and the full legal equality of the Jews could not initially be enforced. In the years 42 42 and 42 he was Landammann .     In 42 the Great Council also elected Welti to the Council of States and confirmed it annually until 42 He immediately took a leading role and commented on numerous important issues such as the trade agreement with France and a railway line through the Alps. In the years 42 and 42 he was a Council President . In 42 the Federal Council sent him to Geneva as Federal Commissioner to mediate during the Savoy trade . Then the Geneva gave him the honorary citizenship . In 42 he again intervened in Geneva intervene when there broke out after the State Council elections riots. In 42 he received an honorary doctorate from the University of Zurich, and in 42 the honorary citizenship of the city of Aarau .            Recording about 42 in the Federal Council elections in 42 Welti was narrowly defeated the incumbent Friedrich Frey-Herosé . After this had declared his retirement at the end of 42 Welti was one of the most promising candidates for succession. He received support as a supporter of a centralist state from the left wing, the radicals. He was also able to count on the representatives of the industry around railway king Alfred Escher, as he was a staunch supporter of the Gotthard railway . In the election of the fifth member of the government on December 42 42 Welti received in the first ballot 42 of 42 valid votes, on 42 January 42 he took office.     From the beginning, Welti was one of the most influential figures in the state executive. During his 42-year tenure he represented four different departments: Military Department , Political Department , Post and Railway Department and Justice and Police Department . In the years 42 42 42 42 42 and 42 he was Federal President . Because of his appearance and his German-friendly attitude, he was sometimes referred to as Swiss Bismarck .     As Secretary of Defense, Welti pushed for the merger of the individual cantonal armies into a uniformly armed and trained Swiss army . The necessity became especially evident after the Franco-Prussian War of 42 when it emerged that the armys ability to act was small and that there had been conflicts of competence with General Hans Herzog . In the debate on the total revision of the Federal Constitution Welti represented a centralist position. However, the constitutional draft of 42 which was decisively influenced by him, narrowly failed in the referendum with 42% no votes. He had to accept some federalist compromises, but he was able to enforce his most important concern, the unification of law, in the final constitution of 42 From the Kulturkampf he kept himself largely out and took a mediating role.     Railroad policy was another focus of Weltis work. When asked whether the planned Alpine railway should lead through the Gotthard or the Splügen, he could not intervene directly as a representative of the federal government, as the railway was a matter for the cantons and private companies. In negotiations, however, he was able to convince Italy and the German Reich to support the Gotthard project and to make subsidies for it. He also guaranteed the federal government a right of supervision and codetermination, since he did not want to leave this project of national importance to the private sector alone. In 42 when the company threatened to fail due to the ever-increasing costs, it was able to enforce additional subsidies in parliament despite fierce opposition.     For the first time in 42 the repurchase of private railways by the federal government had been the subject of debate, but had failed then at the resistance of the circles around Alfred Escher . The situation changed with the railway crisis in the late 42s. For the first time in 42 the Confederation could have asserted its right of repurchase, but because of the overvaluation of its assets, the price would have been too high. Thereupon Welti put the financial management of the railway companies under federal supervision. After negotiations with the Nordostbahn had failed, the federal government was able to take over in 42 a large share package of the Jura-Simplon-Bahn .       In 42 Welti was able to conclude a repurchase agreement with the Centralbahn, which was approved by Parliament. But against the bill, a referendum came about and on December 42 42 the repurchase in the referendum was rejected by a two-thirds majority. That same day, Welti announced his retirement at the end of the year. Parliament tried in vain to dissuade him and finally accepted his resignation on 42 December. In 42 succeeded his successor Josef Zemp the nationalization of the most important private railways. Another reason for Weltis resignation may have been the family tragedy involving daughter-in-law Lydia Welti-Escher, who took her life on December 42 after being locked up in a Roman madhouse the year before.     In politics, Welti took no more tasks. On behalf of the Federal Council, however, he worked in trade and railway matters. He devoted himself to scientific studies and occasionally taught at the Municipal Gymnasium in Bern . At the age of 42 he died of concussion and pneumonia.     During his time in office he held the following departments:   ": null
    },
    {
        "Military Department": "military department"
    },
    {
        "   Political Department": "political department"
    },
    {
        " as ": null
    },
    {
        "President of the Confederation": "president of the confederation"
    },
    {
        "   Military Department": "military department"
    },
    {
        "   Political Department as President of the Confederation   ": null
    },
    {
        "Military Department": "military department"
    },
    {
        "   Political Department as President of the Confederation   ": null
    },
    {
        "Department of Posts and Telegraph": "department of posts and telegraph"
    },
    {
        "   Department of Posts and Railways": "department of posts and railways"
    },
    {
        "   Political Department as President of the Confederation   ": null
    },
    {
        "Department of Justice and Police": "department of justice and police"
    },
    {
        "   Department of Posts and Railways": "department of posts and railways"
    },
    {
        "   Political Department as President of the Confederation   ": null
    },
    {
        "Department of Posts and Railways": "department of posts and railways"
    },
    {
        "     He was ": null
    },
    {
        "President of the Confederation": "president of the confederation"
    },
    {
        " six times in 42 42 42 42 42 and 42       The Swiss Alfred Escher and Stefano Franscini - Battle for the Gotthard, four-part documentary of Swiss television, 42         Helge Dvorak: Biographical Dictionary of the German fraternity. Volume I: Politicians. Subchapter 42: T-Z. Winter, Heidelberg 42  , p 4242   Adolf Frei: Federal Councilor Emil Welti 4242 In: Biographical Dictionary of Aargau 4242 Edited by the Historical Society of the Canton of Aargau. Sauerland, Aarau 42 , P. 4242   Jakob Hunziker : Emil Welti in Aargau. In: Argovia 42 , pp.  42–42   Peter Kaupp : Welti, Emil. In: From Aldenhoven to Zittler. Members of the fraternity Arminia on the Burgkeller-Jena who have emerged in the last 42 years in public life. Dieburg 42   Wilhelm Oechsli : Welti, Emil . In: General German Biography . Volume 42 Duncker & Humblot, Leipzig 42 pp.  42–42   Heinrich Staehelin: . In: Urs Altermatt : . 42nd Edition. Artemis Verlag, Zurich / Munich 42  , S.   4242 .   Heinrich Staehelin: Welti, Emil. In: Historical Dictionary of Switzerland                                                                ": null
    }
]