[
    {
        "   Emil Theodor Kocher was a ": null
    },
    {
        "Swiss": "Switzerland"
    },
    {
        " physician and medical researcher who received the 1909 ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        " for his work in the physiology, pathology and surgery of the ": null
    },
    {
        "thyroid": "Thyroid"
    },
    {
        ". Among his many accomplishments are the introduction and promotion of aseptic surgery and scientific methods in surgery, specifically reducing the mortality of ": null
    },
    {
        "thyroidectomies": "Thyroidectomy"
    },
    {
        " below 1% in his operations.     He was the first Swiss citizen and the first surgeon to ever receive a Nobel Prize. He was considered a pioneer and leader in the field of surgery in his time.         Kochers father was Jakob Alexander Kocher , the sixth of seven children to Samuel Kocher , a carpenter, and Barbara Sutter . Jakob Alexander Kocher was a railway engineer and he moved in 1845 to ": null
    },
    {
        "Burgdorf, Switzerland": "Burgdorf, Switzerland"
    },
    {
        " , because of his job as regional engineer of ": null
    },
    {
        "Emmental": "Emmental"
    },
    {
        " . He was named chief engineer for street and water in the ": null
    },
    {
        "canton of Bern": "Canton Of Bern"
    },
    {
        " at the age of 34 years and he moved with his family to the capital, the city of Bern. In 1858 he left the states service and managed several engineering projects around Bern.     Theodor Kochers mother was Maria Kocher living from 1820 to 1900. She was a very religious woman and part of the ": null
    },
    {
        "Moravian Church": "Moravian Church"
    },
    {
        "; together with Jakob Alexander, she raised a family of five sons and one daughter .     Theodor Kocher was born on 25 August 1841 in Bern and baptized in the local ": null
    },
    {
        "Bern Minster": "Bern Minster"
    },
    {
        " on 16 September 1841. Together with the family, he moved to Burgdorf in 1845 where he started school. Later his family moved back to Bern where he went to middle and high school  where he was the first of his class. During high school, Theodor was interested in many subjects and was specifically drawn to art and ": null
    },
    {
        "classical philology": "Classical Philology"
    },
    {
        " but finally decided to become a doctor.       He started his studies after obtaining the Swiss ": null
    },
    {
        "Matura": "Matura"
    },
    {
        " in 1858 at the ": null
    },
    {
        "University of Bern": "University Of Bern"
    },
    {
        " where ": null
    },
    {
        "Anton Biermer": "Michael Anton Biermer"
    },
    {
        " and ": null
    },
    {
        "Hermann Askan Demme": "Hermann Askan Demme"
    },
    {
        " were teaching, two professors that impressed him most. He was a studious and dedicated student but still became a member of the ": null
    },
    {
        "Schweizerischer Zofingerverein": "Schweizerischer Zofingerverein"
    },
    {
        ", a ": null
    },
    {
        "Swiss fraternity": "Studentenverbindung"
    },
    {
        ".   He obtained his doctorate in Bern in 1865 or 1866 While the dissertation was published in 1866 and the HLS refers to 1866 as date of promotion and 1865 as date of completing his studies, all other sources point to 1865 as the date where Kocher obtained his doctorate with his dissertation about Behandlung der croupösen Pneumonie mit Veratrum-Präparaten  under professor Biermer with the predicate summa cum laude unamimiter.     In spring 1865, Kocher followed his teacher Biermer to ": null
    },
    {
        "Zürich": "Zürich"
    },
    {
        ", where ": null
    },
    {
        "Theodor Billroth": "Theodor Billroth"
    },
    {
        " was director of the hospital and influenced Kocher significantly. Kocher then proceeded to start a journey through Europe to meet several of the most famous surgeons of the time. It is not clear how Kocher financed his trip but according to Bonjour he received money from an unknown female ": null
    },
    {
        "Suisse romande": "Suisse Romande"
    },
    {
        " philanthropist who also supported his friend ": null
    },
    {
        "Marc Dufour": "Marc Dufour"
    },
    {
        " and was probably a member of the ": null
    },
    {
        "Moravian Church": "Moravian Church"
    },
    {
        ". In October 1865, he traveled to ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        ", passing through ": null
    },
    {
        "Leipzig": "Leipzig"
    },
    {
        " and visiting an old friend from high school, Hans Blum. In Berlin, he studied under ": null
    },
    {
        "Bernhard von Langenbeck": "Bernhard Von Langenbeck"
    },
    {
        " and applied for an assistant position with Langenbeck and ": null
    },
    {
        "Rudolf Virchow": "Rudolf Virchow"
    },
    {
        ". Since there was no position available, in April 1867 Kocher moved on to London where he first met ": null
    },
    {
        "Jonathan Hutchinson": "Jonathan Hutchinson"
    },
    {
        " and then worked for ": null
    },
    {
        "Henry Thompson": "Sir Henry Thompson, 1St Baronet"
    },
    {
        " and ": null
    },
    {
        "John Erichsen": "John Eric Erichsen"
    },
    {
        ". Furthermore, he was interested in the work of ": null
    },
    {
        "Isaac Baker Brown": "Isaac Baker Brown"
    },
    {
        " and ": null
    },
    {
        "Thomas Spencer Wells": "Thomas Spencer Wells"
    },
    {
        ", who also invited Kocher to go to the opera with his family. In July 1867, he traveled on to Paris to meet ": null
    },
    {
        "Auguste Nélaton": "Auguste Nélaton"
    },
    {
        ", ": null
    },
    {
        "Auguste Verneuil": "Aristide Auguste Stanislas Verneuil"
    },
    {
        " and ": null
    },
    {
        "Louis Pasteur": "Louis Pasteur"
    },
    {
        ". During his travels, he did not only learn novel techniques but also got to know leading surgeons in person and learned to speak English fluently which allowed him later on to follow the scientific progress in the English speaking world with ease.     Once returned to Bern, Kocher prepared for his ": null
    },
    {
        "habilitation": "Habilitation"
    },
    {
        " and on 12 October 1867, he wrote a petition to the ministry of education to award him the  venia docendi   which was granted to him. He became assistant to ": null
    },
    {
        "Georg Lücke": "Georg Albert Lücke"
    },
    {
        " who left Bern in 1872 to become professor in ": null
    },
    {
        "Strasbourg": "Strasbourg"
    },
    {
        ". Choong claims that Kocher became assistant in Bern already in 1866 but according to Bonjour, Kocher was then still in Berlin Kocher was hoping to get his position, but at the time it was customary to appoint German professors to positions at Swiss universities. Accordingly, the faculty suggested ": null
    },
    {
        "Franz König": "Franz König"
    },
    {
        " before Kocher to follow Lücke. However, the students and assistants as well as many doctors preferred Kocher and started a petition to the Bernese government to choose Kocher. Also the press was in favor of Kocher and several famous foreign surgeons, such as Langenbeck from Berlin and Billroth from ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        ", wrote letters in support of Kocher. Under this public pressure, the Bernese government  chose Kocher as the successor of Lücke as Ordinary Professor of Surgery and Director of the ": null
    },
    {
        "University": "University Of Bern"
    },
    {
        " Surgical Clinic at the  Inselspital  on 16 March 1872, despite a different proposal by the faculty.       In 1869, he married Marie Witschi-Courant Several alternative spellings to Marie Witschi-Courant exist, for example   Maria Witschi ,   Witchi ,   Witchi-Cournant ,   Maria Witschi but in letters Marie ": null
    }
]