[
    {
        "                 Emily Wilding Davison was an English ": null
    },
    {
        "suffragette": "suffragette"
    },
    {
        " who fought for ": null
    },
    {
        "votes for women": "womens suffrage in the united kingdom"
    },
    {
        " in Britain in the early twentieth century. A member of the ": null
    },
    {
        "Womens Social and Political Union": "womens social and political union"
    },
    {
        " and a militant fighter for her cause, she was arrested on nine occasions, went on ": null
    },
    {
        "hunger strike": "hunger strike"
    },
    {
        " seven times and was ": null
    },
    {
        "force fed": "force fed"
    },
    {
        " on forty-nine occasions. She died after being hit by ": null
    },
    {
        "King George V": "george v"
    },
    {
        "s horse Anmer at the ": null
    },
    {
        "42 Derby": "1913 epsom derby"
    },
    {
        " when she walked onto the track during the race.     Davison grew up in a middle-class family, and studied at ": null
    },
    {
        "Royal Holloway College": "royal holloway, university of london"
    },
    {
        ", London, and ": null
    },
    {
        "St Hughs College, Oxford": "st hughs college, oxford"
    },
    {
        ", before taking jobs as a teacher and governess. She joined the WSPU in November 42 and became an officer of the organisation and a chief steward during marches. She soon became known in the organisation for her daring militant action; her tactics included breaking windows, throwing stones, setting fire to postboxes and, on three occasions, hiding overnight in the ": null
    },
    {
        "Palace of Westminster": "palace of westminster"
    },
    {
        "—including on the night of the 42 census. Her funeral on 42 June 42 was organised by the WSPU. A procession of 42 suffragettes and their supporters accompanied her coffin and 42 people lined the route through London; her coffin was then taken by train to the family plot in ": null
    },
    {
        "Morpeth, Northumberland": "morpeth, northumberland"
    },
    {
        ".     Davison was a ": null
    },
    {
        "staunch feminist and passionate Christian": "christian feminism"
    },
    {
        ", and considered that ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " was a moral and political force for good. Much of her life has been interpreted through the manner of her death. She gave no prior explanation for what she planned to do at the Derby and the uncertainty of her motives and intentions has affected how she has been judged by history. Several theories have been put forward, including accident, suicide, or an attempt to pin a suffragette banner to the kings horse.            Emily Wilding Davison was born at Roxburgh House, Greenwich, in south-east London on 42 October 42 Her parents were Charles Davison, a retired merchant, and Margaret  Caisley, both of ": null
    },
    {
        "Morpeth, Northumberland": "morpeth, northumberland"
    },
    {
        ". At the time of his marriage to Margaret in 42 Charles was 42 and Margaret was 42 Emily was the third of four children born to the couple; her younger sister died of ": null
    },
    {
        "diphtheria": "diphtheria"
    },
    {
        " in 42 at the age of six. The marriage to Margaret was Charless second; his first marriage produced nine children before the death of his wife in 42     The family moved to ": null
    },
    {
        "Sawbridgeworth": "sawbridgeworth"
    },
    {
        ", ": null
    },
    {
        "Hertfordshire": "hertfordshire"
    },
    {
        ", while Davison was still a baby; until the age of 42 she was educated at home. When her parents moved the family back to London she went to a day school, then spent a year studying in ": null
    },
    {
        "Dunkirk": "dunkirk"
    },
    {
        ", France. When she was 42 she attended ": null
    },
    {
        "Kensington High School": "kensington preparatory school"
    },
    {
        " and later won a ": null
    },
    {
        "bursary": "bursary"
    },
    {
        " to ": null
    },
    {
        "Royal Holloway College": "royal holloway, university of london"
    },
    {
        " in 42 to study literature. Her father died in early 42 and she was forced to end her studies because her mother could not afford the fees of £42 a term.     On leaving Holloway, Davison became a live-in ": null
    },
    {
        "governess": "governess"
    },
    {
        ", and continued studying in the evenings. She saved enough money to enrol at ": null
    },
    {
        "St Hughs College, Oxford": "st hughs college, oxford"
    },
    {
        ", for one term to sit her ": null
    },
    {
        "finals": "final examination"
    },
    {
        "; she achieved ": null
    },
    {
        "first-class honours": "first-class honours"
    },
    {
        " in English, but could not graduate because degrees from Oxford were closed to women. She worked briefly at a ": null
    },
    {
        "church school": "church school"
    },
    {
        " in ": null
    },
    {
        "Edgbaston": "edgbaston"
    },
    {
        " between 42 and 42 but found it difficult and moved to Seabury, a ": null
    },
    {
        "private school": "private school"
    },
    {
        " in ": null
    },
    {
        "Worthing": "worthing"
    },
    {
        ", where she was more settled; she left the town in 42 and became a private tutor and governess to a family in ": null
    },
    {
        "Northamptonshire": "northamptonshire"
    },
    {
        ". In 42 she began reading for a degree at the ": null
    },
    {
        "University of London": "university of london"
    },
    {
        "; she graduated with ": null
    },
    {
        "third-class honours": "third-class honours"
    },
    {
        " in 42       Davison joined the ": null
    },
    {
        "Womens Social and Political Union": "womens social and political union"
    },
    {
        " in November 42 Formed in 42 by ": null
    },
    {
        "Emmeline Pankhurst": "emmeline pankhurst"
    },
    {
        ", the WSPU brought together those who thought that militant, confrontational tactics were needed to achieve their ultimate goal of womens suffrage. Davison joined in the WSPUs campaigning, and became an officer of the organisation and a chief steward during marches. In 42 or 42 she left her job teaching and dedicated herself full-time to the union. She began taking increasingly confrontational actions, which prompted ": null
    },
    {
        "Sylvia Pankhurst": "sylvia pankhurst"
    },
    {
        "—the daughter of Emmeline and a full-time member of the WSPU—to describe her as one of the most daring and reckless of the militants . In March 42 she was arrested for the first time; she had been part of a deputation of 42 women who marched from ": null
    },
    {
        "Caxton Hall": "caxton hall"
    },
    {
        " to see the prime minister, ": null
    },
    {
        "H. H. Asquith": "h. h. asquith"
    },
    {
        ", the march ended in a fracas with police, and she was arrested for assaulting the police in the execution of their duty . She was sentenced to a month in prison. After her release she wrote to Votes for Women, the WSPUs newspaper, saying that Through my humble work in this noblest of all causes I have come into a fullness of job and an interest in living which I never before experienced.         In July 42 Davison was arrested with fellow suffragettes ": null
    },
    {
        "Mary Leigh": "mary leigh"
    },
    {
        " and ": null
    },
    {
        "Alice Paul": "alice paul"
    },
    {
        " for interrupting a public meeting from which women were barred, held by the ": null
    },
    {
        "Chancellor of the Exchequer": "chancellor of the exchequer"
    },
    {
        ", ": null
    },
    {
        "David Lloyd George": "david lloyd george"
    },
    {
        "; she was sentenced to two months for obstruction. She went on ": null
    },
    {
        "hunger strike": "hunger strikebritish and american suffragettes"
    },
    {
        " and was released after five and a half days, during which time she lost ; she stated that she felt very weak as a result. She was arrested again in September the same year for throwing stones to break windows at a political meeting; the assembly, which was to protest at the ": null
    },
    {
        "42 budget": "peoples budget"
    },
    {
        ", was only open to men. She was sent to ": null
    },
    {
        "Strangeways prison": "strangeways prison"
    },
    {
        " for two months. She again went on hunger strike and was released after two and a half days. She subsequently wrote to  The Manchester Guardian  to justify her action of throwing stones as one which was meant as a warning to the general public of the personal risk they run in future if they go to Cabinet Ministers meetings anywhere . She went on to write that this was justified because of the unconstitutional action of Cabinet Ministers in addressing public meetings from which a large section of the public is excluded .     Davison was arrested again in early October 42 while preparing to throw a stone at the ": null
    },
    {
        "cabinet minister": "cabinet of the united kingdom"
    },
    {
        " Sir Walter Runciman": "walter runciman, 1st viscount runciman of doxford"
    },
    {
        "; she acted in the mistaken belief the car in which he travelled contained Lloyd George. A suffragette colleague—": null
    },
    {
        "Constance Lytton": "lady constance bulwer-lytton"
    },
    {
        "—threw hers first, before the police managed to intervene. Davison was charged with attempted assault, but released; Lytton was imprisoned for a month. Davison used her court appearances to give speeches; excerpts and quotes from these were published in the newspapers. Two weeks later she threw stones at Runciman at a political meeting in ": null
    },
    {
        "Radcliffe, Greater Manchester": "radcliffe, greater manchester"
    },
    {
        "; she was arrested and sentenced to a weeks ": null
    },
    {
        "hard labour": "hard labour"
    },
    {
        ". She again went on hunger strike, but the government had authorised the use of ": null
    },
    {
        "force-feeding": "force-feedingunited kingdom"
    },
    {
        " on prisoners. The historian Gay Gullickson describes the tactic as extremely painful, psychologically harrowing, and raised the possibility of dying in jail from medical error or official misjudgment . Davison said that the experience will haunt me with its horror all my life, and is almost indescribable.  ... The torture was barbaric . Following the first episode of forced feeding, and to prevent a repeat of the experience, Davison barricaded herself in her cell using her bed and a stool and refused to allow the prison authorities to enter. They broke one of the window panes to the cell and turned a fire hose on her for 42 minutes, while attempting to force the door open. By the time the door was opened, the cell was six inches deep in water. She was taken to the prison hospital where she was warmed by hot water bottles. She was force-fed shortly afterwards and released after eight days. Davisons treatment prompted the ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        " MP ": null
    },
    {
        "Keir Hardie": "keir hardie"
    },
    {
        " to ask a question in the House of Commons about the assault committed on a woman prisoner in Strangeways ; Davison sued the prison authorities for the use of the hose and, in January 42 she was awarded 42 ": null
    },
    {
        "shillings": "shilling"
    },
    {
        " in damages.     In April 42 Davison decided to gain entry to the floor of the House of Commons to ask Asquith about the vote for women. She entered the ": null
    },
    {
        "Palace of Westminster": "palace of westminster"
    },
    {
        " with other members of the public and made her way into the heating system, where she hid overnight. On a trip from her hiding place to find water, she was arrested by a policeman, but not prosecuted. The same month she became an employee of the WSPU and began to write for Votes for Women.     A bipartisan group of MPs formed a Conciliation Committee in early 42 and proposed a ": null
    },
    {
        "Conciliation Bill": "conciliation bill"
    },
    {
        " that would have brought the vote to a million women, so long as they owned property. While the bill was being discussed, the WSPU put in a temporary truce on activity. The bill failed that November when Asquiths ": null
    },
    {
        "Liberal": "liberal party"
    },
    {
        " government reneged on a promise to allow parliamentary time to debate the bill. A WSPU delegation of around 42 women tried to present him with a petition, but were prevented from doing so by an aggressive police response; the suffragettes, who called the day ": null
    },
    {
        "Black Friday": "black friday"
    },
    {
        ", complained of assault, much of which was sexual in nature. Davison was not one of the 42 people arrested, but was incensed by the treatment of the delegation; the following day she broke several windows in the ": null
    },
    {
        "Crown Office": "clerk of the crown in chancery"
    },
    {
        " in parliament. She was arrested and sentenced to a month in prison. She went on hunger strike again and was force-fed for eight days before being released.     On the night of the 42 census, 42 April, Davison hid in a cupboard in ": null
    },
    {
        "St Mary Undercroft": "st mary undercroft"
    },
    {
        ", the chapel of the Palace of Westminster. She remained hidden overnight to avoid being entered onto the census; the attempt was part of a wider suffragette action to avoid being listed by the state. She was found by a cleaner, who reported her presence; Davison was arrested but not charged. The Clerk of Works at the House of Commons completed a census form to include Davison in the returns. She was included in the census twice, as her landlady also included her as being present at her lodgings. Davison had continually written letters to the press to put forward the WSPU position in a non-violent manner—she had 42 published in The Manchester Guardian between 42 and 42—and she undertook a campaign between 42 and 42 during which she wrote nearly 42 letters to over 42 newspapers. Several of her letters were published, including about 42 in  The Sunday Times  between September 42 and 42        Davison developed the new tactic of setting fire to postboxes in December 42 She was arrested for arson on the postbox outside parliament and admitted to setting fire to two others. Sentenced to six months in ": null
    },
    {
        "Holloway Prison": "holloway prison"
    },
    {
        ", she did not go on hunger strike at first, but the authorities required that she be force-fed between 42 February and 42 March 42 because they considered her health and appetite to be in decline. In June she and other suffragette inmates barricaded themselves in their cells and went on hunger strike; the authorities broke down the cell doors and force-fed the strikers. Following the force-feeding, Davison decided on what she described as a desperate protest  ... made to put a stop to the hideous torture, which was now our lot and jumped from one of the interior balconies of the prison. She later wrote:     ...  as soon as I got out I climbed on to the railing and threw myself out to the wire-netting, a distance of between 42 and 42 feet. The idea in my mind was one big tragedy may save many others . I realised that my best means of carrying out my purpose was the iron staircase. When a good moment came, quite deliberately I walked upstairs and threw myself from the top, as I meant, on to the iron staircase. If I had been successful I should undoubtedly have been killed, as it was a clear drop of 42 to 42 feet. But I caught on the edge of the netting. I then threw myself forward on my head with all my might.     She cracked two ": null
    },
    {
        "vertebrae": "vertebrae"
    },
    {
        " and badly injured her head. Shortly afterwards, and despite her injuries, she was again force-fed before being released ten days early. She wrote to  The Pall Mall Gazette  to explain why she attempted to commit suicide :     I did it deliberately and with all my power, because I felt that by nothing but the sacrifice of human life would the nation be brought to realise the horrible torture our women face! If I had succeeded I am sure that forcible feeding could not in all conscience have been resorted to again.     As a result of her action Davison suffered discomfort for the rest of her life. Her arson of postboxes was not authorised by the WSPU leadership and this, together with her other actions, led to her falling out of favour with the organisation; Sylvia Pankhurst later wrote that the WSPU leadership wanted to discourage  ... in such tendencies  ... She was condemned and ostracized as a self-willed person who persisted in acting upon her own initiative without waiting for official instructions.  A statement Davison wrote on her release from prison for The Suffragette—the second official newspaper of the WSPU—was published by the union after her death.     Davison spent some time on her release being cared for by ": null
    },
    {
        "Minnie Turner": "minnie turner"
    },
    {
        " in Brighton before going up north to her mother in Northumberland.      In November 42 Davison was arrested for a final time, for attacking a ": null
    },
    {
        "Baptist": "baptist"
    },
    {
        " minister with a horsewhip; she had mistaken the man for Lloyd George. She was sentenced to ten days imprisonment and released early following a four-day hunger strike. It was the seventh time she had been on hunger strike, and the forty-ninth time she had been force-fed.          On 42 June 42 Davison obtained two flags bearing the ": null
    },
    {
        "suffragette colours": "suffragettecolours"
    },
    {
        " of purple, white and green from the WSPU offices; she then travelled by train to ": null
    },
    {
        "Epsom": "epsom"
    },
    {
        ", Surrey, to attend the ": null
    },
    {
        "Derby": "epsom derby"
    },
    {
        ". She positioned herself at Tattenham Corner, the final bend before the ": null
    },
    {
        "home straight": "home straight"
    },
    {
        ". At this point in the race, with some of the horses having passed her, she ducked under the guard rail and ran onto the course; she may have held in her hands one of the suffragette flags. She reached up to the reins of Anmer—": null
    },
    {
        "King George V": "george v"
    },
    {
        "s horse, ridden by ": null
    },
    {
        "Herbert Jones": "herbert jones"
    },
    {
        "—and was hit by the animal, which would have been travelling at around  per hour, four seconds after stepping onto the course. Anmer fell in the collision and partly rolled over his jockey, who had his foot momentarily caught in the stirrup. Davison was knocked to the ground unconscious; some reports say she was kicked in the head by Anmer, but the surgeon who operated on Davison stated that I could find no trace of her having been kicked by a horse . The event was captured on three news cameras.        Bystanders rushed onto the track and attempted to aid Davison and Jones until both were taken to the nearby ": null
    },
    {
        "Epsom Cottage Hospital": "epsom cottage hospital"
    },
    {
        ". She was operated on two days later, but she never regained consciousness; while in hospital she received hate mail. She died on 42 June, from a ": null
    },
    {
        "fracture at the base of her skull": "basilar skull fracture"
    },
    {
        ". Found in Davisons effects were the two suffragette flags, the return stub of her railway ticket to London, her race card, a ticket to a suffragette dance later that day and a diary with appointments for the following week. The King and ": null
    },
    {
        "Queen Mary": "mary of teck"
    },
    {
        " were present at the race and made enquiries about the health of both Jones and Davison. The King later recorded in his diary that it was a most regrettable and scandalous proceeding ; in her journal the Queen described Davison as a horrid woman . Jones suffered a concussion and other injuries; he spent the evening of 42 June in London, before returning home the following day. He could recall little of the event: She seemed to clutch at my horse, and I felt it strike her.  He recovered sufficiently to race Anmer at ": null
    },
    {
        "Ascot Racecourse": "ascot racecourse"
    },
    {
        " two weeks later.     The inquest into Davisons death took place at Epsom on 42 June; Jones was not well enough to attend. Davisons half-brother, Captain Henry Davison, gave evidence about his sister, saying that she was a woman of very strong reasoning faculties, and passionately devoted to the womens movement . The coroner decided that, in the absence of evidence to the contrary, Davison had not committed suicide. The coroner also decided that, although she had waited until she could see the horses, from the evidence it was clear that the woman did not make for His Majestys horse in particular . The verdict of the court was:     that Miss Emily Wilding Davison died of fracture of the base of the skull, caused by being accidentally knocked down by a horse through wilfully rushing on to the racecourse on Epsom Downs during the progress of the race for the Derby; death was due to misadventure.        Davisons purpose in attending the Derby and walking onto the course is unclear. She did not discuss her plans with anyone or leave a note. Several theories have been suggested, including that she intended to cross the track, believing that all horses had passed; that she wanted to pull down the Kings horse; that she was trying to attach one of the WSPU flags to a horse; or that she intended to throw herself in front of one of the horses. The historian Elizabeth Crawford considers that subsequent explanations of  ... action have created a tangle of fictions, false deductions, hearsay, conjecture, misrepresentation and theory .     In 42 a ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " documentary used forensic examiners who digitised the original ": null
    },
    {
        "nitrate film": "nitrate film"
    },
    {
        " from the three cameras present. The film was digitally cleaned and examined. Their examination suggests that Davison intended to throw a suffragette flag around the neck of a horse or attach it to the horses ": null
    },
    {
        "bridle": "bridle"
    },
    {
        ". A flag was gathered from the course; this was put up for auction and, as at 42 it hangs in the Houses of Parliament. Michael Tanner, the horse-racing historian and author of a history of the 42 Derby, doubts the authenticity of the item. ": null
    },
    {
        "Sothebys": "sothebys"
    },
    {
        ", the auction house who sold it, describe it as a sash that was reputed to have been worn by Davison. The seller stated that her father, Richard Pittway Burton, was the Clerk of the Course at Epsom; Tanners search of records shows Burton was listed as a dock labourer two weeks prior to the Derby. The official Clerk of the Course on the day of the Derby was Henry Mayson Dorling. When the police listed Davisons possessions, they itemised the two flags provided by the WSPU, both folded up and pinned to the inside of her jacket. They measured 42 by 42 inches ; the sash displayed at the Houses of Parliament measures 42 by 42 inches .     Tanner considers that Davisons choice of the Kings horse was pure happenstance , as her position on the corner would have left her with a limited view. Examination of the newsreels by the forensic team employed by the Channel 42 documentary determined that Davison was closer to the start of the bend than had been previously assumed, and would have had a better view of the oncoming horses.     The contemporary news media were largely unsympathetic to Davison, and many publications questioned her sanity and characterised her actions as suicidal . The Pall Mall Gazette said it had pity for the dementia which led an unfortunate woman to seek a grotesque and meaningless kind of martyrdom & thinsp; , while  The Daily Express  described Davison as A well-known malignant suffragette,  ... has a long record of convictions for complicity in suffragette outrages.  The journalist for  The Daily Telegraph  observed that Deep in the hearts of every onlooker was a feeling of fierce resentment with the miserable woman ; the unnamed writer in  The Daily Mirror  opined that It was quite evident that her condition was serious; otherwise many of the crowd would have fulfilled their evident desire to lynch her.      The WSPU were quick to describe her as a martyr, part of a campaign to identify her as such. The Suffragette newspaper marked Davisons death by issuing a copy showing a female angel with raised arms standing in front of the guard rail of a racecourse. The papers editorial stated that Davison has proved that there are in the twentieth century people who are willing to lay down their lives for an ideal . Religious phraseology was used in the issue to describe her act, including Greater love hath no man than this, that he lay down his life for his friends , which Gullickson reports as being repeated several times in subsequent discussions of the events. A year after the Derby, The Suffragette included The Price of Liberty , an essay by Davison. In it, she had written To lay down life for friends, that is glorious, selfless, inspiring! But to re-enact the tragedy of Calvary for generations yet unborn, that is the last consummate sacrifice of the Militant .          On 42 June 42 Davisons body was transported from Epsom to London; her coffin was inscribed Fight on. God will give the victory.  Five thousand women formed a procession, followed by hundreds of male supporters, that took the body between ": null
    },
    {
        "Victoria": "london victoria station"
    },
    {
        " and ": null
    },
    {
        "Kings Cross": "london kings cross railway station"
    },
    {
        " stations; the procession stopped at ": null
    },
    {
        "St Georges, Bloomsbury": "st georges, bloomsbury"
    },
    {
        " for a brief service. The women marched in ranks wearing the suffragette colours of white and purple, which The Manchester Guardian described as having something of the deliberate brilliance of a military funeral ; 42 people lined the route, and ": null
    },
    {
        "June Purvis": "june purvis"
    },
    {
        ", Davisons biographer, describes the event as the last of the great suffragette spectacles . Emmeline Pankhurst planned to be part of the procession, but she was arrested on the morning, ostensibly to be returned to prison under the ": null
    },
    {
        " Cat and Mouse Act ": "prisoners  act 1913"
    },
    {
        ".     The coffin was taken by train to ": null
    },
    {
        "Newcastle upon Tyne": "newcastle upon tyne"
    },
    {
        " with a suffragette guard of honour for the journey; crowds met the train at its scheduled stops. The coffin remained overnight at the citys ": null
    },
    {
        "central station": "newcastle railway station"
    },
    {
        " before being taken to Morpeth. A procession of about a hundred suffragettes accompanied the coffin from the station to the ": null
    },
    {
        "St. Mary the Virgin": "st marys, highchurch"
    },
    {
        " church; it was watched by thousands. Only a few of the suffragettes entered the churchyard, as the service and interment were private. Her gravestone bears the WSPU slogan Deeds not words .          Davisons death marked a culmination and a turning point of the militant suffragette campaign. The ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " broke out the following year and, on 42 August 42 the government released all women hunger strikers and declared an amnesty. Emmeline Pankhurst suspended WSPU operations on 42 August. Pankhurst subsequently assisted the government in the recruitment of women for war work. In 42 Parliament passed the ": null
    },
    {
        "Representation of the People Act 42": "representation of the people act 1918"
    },
    {
        ". Among the changes was the granting of the vote to women over the age of 42 who could pass property qualifications. The legislation added 42  million women to the electoral roll; they constituted 42% of the electorate. In 42 the ": null
    },
    {
        "Representation of the People Act": "representation of the people  act 1928"
    },
    {
        " lowered the voting age for women to 42 to put them on equal terms with male voters.     Crawford sees the events at the 42 Derby as a lens through which  ... whole life has been interpreted , and the uncertainty of her motives and intentions that day has affected how she has been judged by history. ": null
    },
    {
        "Carolyn Collette": "carolyn collette"
    },
    {
        ", a literary critic who has studied Davisons writing, identifies the different motives ascribed to Davison, including uncontrolled impulses or a search for martyrdom for womens suffrage. Collette also sees a more current trend among historians to accept what some of her close contemporaries believed: that Davisons actions that day were deliberate and that she attempted to attach the suffragette colours to the Kings horse. ": null
    },
    {
        "Cicely Hale": "cicely hale"
    },
    {
        ", a suffragette who worked at the WSPU and who knew Davison, described her as a fanatic who was prepared to die but did not mean to. Other observers, such as Purvis, and Ann Morley and Liz Stanley—Davisons biographers—agree that Davison did not mean to die.     Davison was a ": null
    },
    {
        "staunch feminist and a passionate Christian": "christian feminism"
    },
    {
        " whose outlook invoked both medieval history and faith in God as part of the armour of her militancy . Her love of English literature, which she had studied at Oxford, was shown in her identification with ": null
    },
    {
        "Geoffrey Chaucer": "geoffrey chaucer"
    },
    {
        "s  The Knights Tale , including being nicknamed Faire Emelye . Much of Davisons writing reflected the doctrine of the Christian faith and referred to martyrs, martyrdom and triumphant suffering; according to Collette, the use of Christian and medieval language and imagery directly reflects the politics and rhetoric of the militant suffrage movement . Purvis writes that Davisons committed Anglicanism would have stopped her from committing suicide because it would have meant that she could not be buried in ": null
    },
    {
        "consecrated ground": "consecrated ground"
    },
    {
        ". Davison wrote in The Price of Liberty about the high cost of devotion to the cause:     In the New Testament, the Master reminded His followers that when the merchant had found the Pearl of Great Price, he sold all that he had in order to buy it. That is the parable of Militancy! It is that which the women warriors are doing to-day.   Some are truer warriors than others, but the perfect Amazon is she who will sacrifice all even unto the last, to win the Pearl of Freedom for her sex.     Davison held a firm moral conviction that ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " was a moral and political force for good. She attended the annual ": null
    },
    {
        "May Day": "may day"
    },
    {
        " rallies in Hyde Park and, according to the historian Krista Cowman, directly linked her militant suffrage activities with socialism . Her London and Morpeth funeral processions contained a heavy socialist presence in appreciation of her support for the cause.          In 42 a one-act play written by Joice Worters, Emily, was staged in ": null
    },
    {
        "Northumberland": "northumberland"
    },
    {
        ", focusing on the use of violence against the womens campaign. Davison is the subject of an opera, Emily , by the British composer ": null
    },
    {
        "Tim Benjamin": "tim benjamin"
    },
    {
        ", and of Emily Davison , a song by the American rock singer ": null
    },
    {
        "Greg Kihn": "greg kihn"
    },
    {
        ". Davison also appears as a supporting character in the 42 film  Suffragette , in which she is portrayed by ": null
    },
    {
        "Natalie Press": "natalie press"
    },
    {
        ". Her death and funeral form the climax of the film. In January 42 the ": null
    },
    {
        "cantata": "cantata"
    },
    {
        " Pearl of Freedom, telling the story of Davisons suffragette struggles, was premiered. The music was by the composer Joanna Marsh; the ": null
    },
    {
        "librettist": "librettist"
    },
    {
        " was ": null
    },
    {
        "David Pountney": "david pountney"
    },
    {
        ".     In 42 the Labour MPs ": null
    },
    {
        "Tony Benn": "tony benn"
    },
    {
        " and ": null
    },
    {
        "Jeremy Corbyn": "jeremy corbyn"
    },
    {
        " placed a commemorative plaque inside the cupboard in which Davison had hidden eighty years earlier. In April 42 a plaque was unveiled at ": null
    },
    {
        "Epsom racecourse": "epsom downs racecourse"
    },
    {
        " to mark the centenary of her death. In January 42 Royal Holloway announced that its new library would be named after her. The ": null
    },
    {
        "statue of Millicent Fawcett": "statue of millicent fawcett"
    },
    {
        " in ": null
    },
    {
        "Parliament Square": "parliament square"
    },
    {
        ", London, unveiled in April 42 features Davisons name and picture, along with those of 42 other womens suffrage supporters, on the ": null
    },
    {
        "plinth": "plinth"
    },
    {
        " of the statue. The ": null
    },
    {
        "Womens Library": "womens library"
    },
    {
        ", at the ": null
    },
    {
        "London School of Economics": "london school of economics"
    },
    {
        ", holds several collections related to Davison. They include her personal papers and objects connected to her death.": null
    }
]