[
    {
        "        An emulsion is a ": null
    },
    {
        "mixture": "mixture"
    },
    {
        " of two or more ": null
    },
    {
        "liquids": "liquid"
    },
    {
        "that are normally ": null
    },
    {
        "immiscible": "immiscible"
    },
    {
        " . Emulsions are part of a more general class of two-phase systems of ": null
    },
    {
        "matter": "matter"
    },
    {
        " called ": null
    },
    {
        "colloid": "colloid"
    },
    {
        "s. Although the terms colloid and emulsion are sometimes used interchangeably, emulsion should be used when both phases, dispersed and continuous, are liquids. In an emulsion, one liquid  is ": null
    },
    {
        "dispersed": "dispersion"
    },
    {
        " in the other . Examples of emulsions include ": null
    },
    {
        "vinaigrette": "vinaigrette"
    },
    {
        "s, homogenized ": null
    },
    {
        "milk": "milk"
    },
    {
        ", and some ": null
    },
    {
        "cutting fluids": "cutting fluid"
    },
    {
        "for ": null
    },
    {
        "metal working": "metal working"
    },
    {
        ".     The word emulsion comes from the Latin emulgere to milk out, from ex out + mulgere to milk , as milk is an emulsion of fat and water, along with other components.      Two liquids can form different types of emulsions. As an example, oil and water can form, first, an oil-in-water emulsion, wherein the oil is the dispersed phase, and water is the continuous phase.  Second, they can form a water-in-oil emulsion, wherein water is the dispersed phase and oil is the continuous phase. Multiple emulsions are also possible, including a water-in-oil-in-water emulsion and an oil-in-water-in-oil emulsion.      Emulsions, being liquids, do not exhibit a static internal structure. The droplets dispersed in the continuous phase are usually assumed to be ": null
    },
    {
        "statistically distributed": "probability distribution"
    },
    {
        ".     The term emulsion is also used to refer to the photo-sensitive side of ": null
    },
    {
        "photographic film": "photographic film"
    },
    {
        ". Such a ": null
    },
    {
        "photographic emulsion": "photographic emulsion"
    },
    {
        " consists of ": null
    },
    {
        "silver halide": "silver halide"
    },
    {
        " colloidal particles dispersed in a ": null
    },
    {
        "gelatin": "gelatin"
    },
    {
        " matrix. ": null
    },
    {
        "Nuclear emulsions": "nuclear emulsion"
    },
    {
        "are similar to photographic emulsions, except that they are used in particle physics to detect high-energy ": null
    },
    {
        "elementary particle": "elementary particle"
    },
    {
        "s.            Emulsions contain both a dispersed and a continuous phase, with the boundary between the phases called the interface  . Emulsions tend to have a cloudy appearance because the many ": null
    },
    {
        "phase interfaces": "phase boundary"
    },
    {
        " scatter": "scattering"
    },
    {
        " light as it passes through the emulsion. Emulsions appear ": null
    },
    {
        "white": "white"
    },
    {
        " when all light is scattered equally. If the emulsion is dilute enough, higher-frequency light will be scattered more, and the emulsion will appear ": null
    },
    {
        "blue": "blue"
    },
    {
        "r  – this is called the ": null
    },
    {
        "Tyndall effect": "tyndall effect"
    },
    {
        " . If the emulsion is concentrated enough, the color will be distorted toward comparatively longer wavelengths, and will appear more ": null
    },
    {
        "yellow": "yellow"
    },
    {
        ". This phenomenon is easily observable when comparing ": null
    },
    {
        "skimmed milk": "skimmed milk"
    },
    {
        ", which contains little fat, to ": null
    },
    {
        "cream": "cream"
    },
    {
        ", which contains a much higher concentration of milk fat. One example would be a mixture of water and oil.     Two special classes of emulsions  – ": null
    },
    {
        "microemulsions": "microemulsion"
    },
    {
        "and nanoemulsions, with droplet sizes below 100  nm  – appear translucent.  This property is due to the fact that light waves are scattered by the droplets only if their sizes exceed about one-quarter of the wavelength of the incident light. Since the ": null
    },
    {
        "visible spectrum": "visible spectrum"
    },
    {
        " of light is composed of wavelengths between 390 and 750 ": null
    },
    {
        "nanometers": "nanometer"
    },
    {
        ", if the droplet sizes in the emulsion are below about 100  nm, the light can penetrate through the emulsion without being scattered.  Due to their similarity in appearance, translucent nanoemulsions and ": null
    },
    {
        "microemulsions": "microemulsions"
    },
    {
        " are frequently confused. Unlike translucent nanoemulsions, which require specialized equipment to be produced, microemulsions are spontaneously formed by “solubilizing” oil molecules with a mixture of ": null
    },
    {
        "surfactant": "surfactant"
    },
    {
        "s, co-surfactants, and co-": null
    },
    {
        "solvent": "solvent"
    },
    {
        "s. The required surfactant concentration in a ": null
    },
    {
        "microemulsion": "microemulsion"
    },
    {
        " is, however, several times higher than that in a translucent nanoemulsion, and significantly exceeds the concentration of the dispersed phase. Because of many undesirable side-effects caused by surfactants, their presence is disadvantageous or prohibitive in many applications. In addition, the stability of a microemulsion is often easily compromised by dilution, by heating, or by changing pH levels.     Common emulsions are inherently unstable and, thus, do not tend to form spontaneously. Energy input  – through shaking, stirring, ": null
    },
    {
        "homogenizing": "homogenization"
    },
    {
        ", or exposure to power ": null
    },
    {
        "ultrasound": "ultrasound"
    },
    {
        "   – is needed to form an emulsion. Over time, emulsions tend to revert to the stable state of the phases comprising the emulsion. An example of this is seen in the separation of the oil and vinegar components of ": null
    },
    {
        "vinaigrette": "vinaigrette"
    },
    {
        ", an unstable emulsion that will quickly separate unless shaken almost continuously. There are important exceptions to this rule  – ": null
    },
    {
        "microemulsions": "microemulsions"
    },
    {
        " are ": null
    },
    {
        "thermodynamically": "thermodynamics"
    },
    {
        " stable, while translucent nanoemulsions are ": null
    },
    {
        "kinetically": "kinetics"
    },
    {
        " stable.     Whether an emulsion of oil and water turns into a water-in-oil emulsion or an oil-in-water emulsion depends on the volume fraction of both phases and the type of emulsifier  present. In general, the ": null
    },
    {
        "Bancroft rule": "bancroft rule"
    },
    {
        " applies. Emulsifiers and emulsifying particles tend to promote dispersion of the phase in which they do not dissolve very well. For example, proteins dissolve better in water than in oil, and so tend to form oil-in-water emulsions .     The geometric structure of an emulsion mixture of two lyophobic liquids with a large concentration of the secondary component is fractal: Emulsion particles unavoidably form dynamic inhomogeneous structures on small length scale. The geometry of these structures is fractal. The size of elementary irregularities is governed by a universal function which depends on the volume content of the components. The fractal dimension of these irregularities is 2.5.        Emulsion stability refers to the ability of an emulsion to resist change in its properties over time.   There are four types of instability in emulsions: ": null
    },
    {
        "flocculation": "flocculation"
    },
    {
        ", ": null
    },
    {
        "creaming": "creaming"
    },
    {
        "/": null
    },
    {
        "sedimentation": "sedimentation"
    },
    {
        ", ": null
    },
    {
        "coalescence": "coalescence"
    },
    {
        ", and ": null
    },
    {
        "Ostwald ripening": "ostwald ripening"
    },
    {
        ". Flocculation occurs when there is an attractive force between the droplets, so they form flocs, like bunches of grapes. This process can be desired, if controlled in its extent, to tune physical properties of emulsions such as their flow behaviour.  Coalescence occurs when droplets bump into each other and combine to form a larger droplet, so the average droplet size increases over time. Emulsions can also undergo ": null
    },
    {
        "creaming": "creaming"
    },
    {
        ", where the droplets rise to the top of the emulsion under the influence of ": null
    },
    {
        "buoyancy": "buoyancy"
    },
    {
        ", or under the influence of the ": null
    },
    {
        "centripetal force": "centripetal force"
    },
    {
        " induced when a ": null
    },
    {
        "centrifuge": "centrifuge"
    },
    {
        " is used. Creaming is a common phenomenon in dairy and non-dairy beverages and usually does not change the droplet size.  Sedimentation is the opposite phenomenon of creaming and normally observed in water-in-oil emulsions . Sedimentation happens when the dispersed phase is denser than the continuous phase and the gravitational forces pull the denser globules towards the bottom of the emulsion. Similar to creaming, sedimentation follows Stoke’s law.     An appropriate surface active agent  can increase the kinetic stability of an emulsion so that the size of the droplets does not change significantly with time. The stability of an emulsion, like a ": null
    },
    {
        "suspension": "suspension_"
    },
    {
        ", can be studied in terms of ": null
    },
    {
        "zeta potential": "zeta potential"
    },
    {
        ", which indicates the repulsion between droplets or particles. If the size and dispersion of droplets does not change over time, it is said to be stable.  For example, oil-in-water emulsions containing ": null
    },
    {
        "mono- and diglycerides": "mono- and diglycerides of fatty acids"
    },
    {
        " and milk protein as ": null
    },
    {
        "surfactant": "surfactant"
    },
    {
        " showed that stable oil droplet size over 28 days storage at 25°C.       The stability of emulsions can be characterized using techniques such as light scattering, focused beam reflectance measurement, centrifugation, and ": null
    },
    {
        "rheology": "rheology"
    },
    {
        ". Each method has advantages and disadvantages.        The kinetic process of destabilization can be rather long  – up to several months, or even years for some products.  Often the formulator must accelerate this process in order to test products in a reasonable time during product design. Thermal methods are the most commonly used – these consist of increasing the emulsion temperature to accelerate destabilization .  Temperature affects not only the viscosity but also the interfacial tension in the case of non-ionic surfactants or, on a broader scope, interactions between droplets within the system. Storing an emulsion at high temperatures enables the simulation of realistic conditions for a product , but also accelerates destabilization processes up to 200 times.     Mechanical methods of acceleration, including vibration, centrifugation, and agitation, can also be used.     These methods are almost always empirical, without a sound scientific basis.       An emulsifier is a substance that stabilizes an emulsion by increasing its ": null
    },
    {
        "kinetic stability": "chemical kinetics"
    },
    {
        ". One class of emulsifiers is known as surface active agents , or ": null
    },
    {
        "surfactant": "surfactant"
    },
    {
        "s. Emulsifiers are compounds that typically have a polar or hydrophilic part and a non-polar part. Because of this, emulsifiers tend to have more or less solubility either in water or in oil. Emulsifiers that are more soluble in water will generally form oil-in-water emulsions, while emulsifiers that are more soluble in oil will form water-in-oil emulsions. Cassiday, L. . Emulsions: Making oil and water mix. Retrieved from      Examples of food emulsifiers are:   ": null
    },
    {
        "Egg yolk": "egg yolk"
    },
    {
        "  – in which the main emulsifying agent is ": null
    },
    {
        "lecithin": "lecithin"
    },
    {
        ". In fact, lecithos is the Greek word for egg yolk.   ": null
    },
    {
        "Mustard": "mustard seed"
    },
    {
        "  – where a variety of chemicals in the ": null
    },
    {
        "mucilage": "mucilage"
    },
    {
        " surrounding the seed hull act as emulsifiers   ": null
    },
    {
        "Soy lecithin": "soy lecithin"
    },
    {
        " is another emulsifier and thickener   ": null
    },
    {
        "Pickering stabilization": "pickering emulsion"
    },
    {
        "  – uses particles under certain circumstances   ": null
    },
    {
        "Sodium phosphates": "sodium phosphates"
    },
    {
        " Mono- and diglycerides": "mono- and diglycerides of fatty acids"
    },
    {
        " - a common emulsifier found in many food products   ": null
    },
    {
        "Sodium stearoyl lactylate": "sodium stearoyl lactylate"
    },
    {
        " DATEM": "datem"
    },
    {
        "  – an emulsifier used primarily in baking   Simple cellulose – a ": null
    },
    {
        "particulate emulsifier": "pickering emulsion"
    },
    {
        " derived from plant material using only water     ": null
    },
    {
        "Detergents": "detergent"
    },
    {
        "are another class of surfactant, and will interact physically with both ": null
    },
    {
        "oil": "cooking oil"
    },
    {
        " and ": null
    },
    {
        "water": "water"
    },
    {
        ", thus stabilizing the interface between the oil and water droplets in suspension. This principle is exploited in ": null
    },
    {
        "soap": "soap"
    },
    {
        ", to remove ": null
    },
    {
        "grease": "yellow grease"
    },
    {
        " for the purpose of ": null
    },
    {
        "cleaning": "cleaning agent"
    },
    {
        ". Many different emulsifiers are used in ": null
    },
    {
        "pharmacy": "pharmacy"
    },
    {
        " to prepare emulsions such as ": null
    },
    {
        "creams": "cream"
    },
    {
        " and ": null
    },
    {
        "lotion": "lotion"
    },
    {
        "s. Common examples include ": null
    },
    {
        "emulsifying wax": "emulsifying wax"
    },
    {
        ", ": null
    },
    {
        "polysorbate 20": "polysorbate 20"
    },
    {
        ", and ": null
    },
    {
        "ceteareth 20": "ceteareth"
    },
    {
        ".      Sometimes the inner phase itself can act as an emulsifier, and the result is a nanoemulsion, where the inner state disperses into ": null
    },
    {
        "nano-": "nano-"
    },
    {
        "size droplets within the outer phase. A well-known example of this phenomenon, the ": null
    },
    {
        "ouzo effect": "ouzo effect"
    },
    {
        " , happens when water is poured into a strong alcoholic ": null
    },
    {
        "anise": "anise"
    },
    {
        "-based beverage, such as ": null
    },
    {
        "ouzo": "ouzo"
    },
    {
        ", ": null
    },
    {
        "pastis": "pastis"
    },
    {
        ", ": null
    },
    {
        "absinthe": "absinthe"
    },
    {
        ", ": null
    },
    {
        "arak": "arak"
    },
    {
        ", or ": null
    },
    {
        "raki": "rakı"
    },
    {
        ". The anisolic compounds, which are soluble in ": null
    },
    {
        "ethanol": "ethanol"
    },
    {
        ", then form nano-size droplets and emulsify within the water. The resulting color of the drink is opaque and milky white.       A number of different chemical and physical processes and mechanisms can be involved in the process of emulsification: ": null
    },
    {
        "acacia": "gum arabic"
    },
    {
        " and ": null
    },
    {
        "tragacanth": "tragacanth"
    },
    {
        ", which are hydrocolloids, as well as PEG , glycerine, and other polymers like CMC , all increase the viscosity of the medium, which helps create and maintain the suspension of globules of dispersed phase           Oil-in-water emulsions are common in food products:   Crema in ": null
    },
    {
        "espresso": "espresso"
    },
    {
        " – coffee oil in water , unstable emulsion   ": null
    },
    {
        "Mayonnaise": "mayonnaise"
    },
    {
        " and ": null
    },
    {
        "Hollandaise sauces": "hollandaise sauce"
    },
    {
        "– these are oil-in-water emulsions stabilized with egg yolk ": null
    },
    {
        "lecithin": "lecithin"
    },
    {
        ", or with other types of food additives, such as ": null
    },
    {
        "sodium stearoyl lactylate": "sodium stearoyl lactylate"
    },
    {
        " Homogenized milk": "homogenized milk"
    },
    {
        " – an emulsion of milk fat in water, with milk proteins as the emulsifier   ": null
    },
    {
        "Vinaigrette": "vinaigrette"
    },
    {
        " – an emulsion of vegetable oil in vinegar, if this is prepared using only oil and vinegar , an unstable emulsion results     Water-in-oil emulsions are less common in food, but still exist:   ": null
    },
    {
        "Butter": "butter"
    },
    {
        " – an emulsion of water in butterfat   ": null
    },
    {
        "Margarine": "margarine"
    },
    {
        "     Other foods can be turned into products similar to emulsions, for example ": null
    },
    {
        "meat emulsion": "meat emulsion"
    },
    {
        " is a suspension of meat in liquid that is similar to true emulsions.       In ": null
    },
    {
        "pharmaceutics": "pharmaceutics"
    },
    {
        ", ": null
    },
    {
        "hairstyling": "hairstyling product"
    },
    {
        ", ": null
    },
    {
        "personal hygiene": "personal hygiene"
    },
    {
        ", and ": null
    },
    {
        "cosmetics": "cosmetics"
    },
    {
        ", emulsions are frequently used. These are usually oil and water emulsions but dispersed, and which is continuous depends in many cases on the ": null
    },
    {
        "pharmaceutical formulation": "pharmaceutical formulation"
    },
    {
        ". These emulsions may be called ": null
    },
    {
        "cream": "cream"
    },
    {
        "s, ": null
    },
    {
        "ointment": "ointment"
    },
    {
        "s, ": null
    },
    {
        "liniments": "liniment"
    },
    {
        ", ": null
    },
    {
        "paste": "paste"
    },
    {
        "s, ": null
    },
    {
        "film": "thin film"
    },
    {
        "s, or ": null
    },
    {
        "liquid": "liquid"
    },
    {
        "s, depending mostly on their oil-to-water ratios, other additives, and their intended ": null
    },
    {
        "route of administration": "route of administration"
    },
    {
        ".   The first 5 are ": null
    },
    {
        "topical": "topical"
    },
    {
        " dosage form": "dosage form"
    },
    {
        "s, and may be used on the surface of the ": null
    },
    {
        "skin": "human skin"
    },
    {
        ", ": null
    },
    {
        "transdermal": "transdermal"
    },
    {
        "ly, ": null
    },
    {
        "ophthalmically": "eye drop"
    },
    {
        ", ": null
    },
    {
        "rectal": "rectal"
    },
    {
        "ly, or ": null
    },
    {
        "vagina": "vagina"
    },
    {
        "lly. A highly liquid emulsion may also be used ": null
    },
    {
        "oral": "oral administration"
    },
    {
        "ly, or may be ": null
    },
    {
        "injected": "injection"
    },
    {
        " in some cases.     Microemulsions are used to deliver ": null
    },
    {
        "vaccines": "vaccine"
    },
    {
        "and kill ": null
    },
    {
        "microbe": "microbe"
    },
    {
        "s.  Typical emulsions used in these techniques are nanoemulsions of ": null
    },
    {
        "soybean oil": "soybean oil"
    },
    {
        ", with particles that are 400–600  nm in diameter.  The process is not chemical, as with other types of ": null
    },
    {
        "antimicrobial": "antimicrobial"
    },
    {
        " treatments, but mechanical. The smaller the droplet the greater the ": null
    },
    {
        "surface tension": "surface tension"
    },
    {
        " and thus the greater the force required to merge with other ": null
    },
    {
        "lipids": "lipids"
    },
    {
        ". The oil is emulsified with detergents using a ": null
    },
    {
        "high-shear mixer": "high-shear mixer"
    },
    {
        " to stabilize the emulsion so, when they encounter the lipids in the ": null
    },
    {
        "cell membrane": "cell membrane"
    },
    {
        " or envelope of ": null
    },
    {
        "bacteria": "cell envelope"
    },
    {
        " or ": null
    },
    {
        "virus": "virus"
    },
    {
        "es, they force the lipids to merge with themselves. On a mass scale, in effect this disintegrates the membrane and kills the pathogen. The soybean oil emulsion does not harm normal human cells, or the cells of most other ": null
    },
    {
        "higher organisms": "higher organisms"
    },
    {
        ", with the exceptions of ": null
    },
    {
        "sperm cells": "spermatozoon"
    },
    {
        " and ": null
    },
    {
        "blood cells": "blood cells"
    },
    {
        ", which are vulnerable to nanoemulsions due to the peculiarities of their membrane structures. For this reason, these nanoemulsions are not currently used ": null
    },
    {
        "intravenous": "intravenous"
    },
    {
        "ly . The most effective application of this type of nanoemulsion is for the ": null
    },
    {
        "disinfection": "disinfection"
    },
    {
        " of surfaces. Some types of nanoemulsions have been shown to effectively destroy ": null
    },
    {
        "HIV-1": "hiv-1"
    },
    {
        " and ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " pathogens on non-": null
    },
    {
        "porous": "porous"
    },
    {
        " surfaces.       Emulsifying agents are effective at extinguishing fires on small, thin-layer spills of flammable liquids . Such agents encapsulate the fuel in a fuel-water emulsion, thereby trapping the flammable vapors in the water phase. This emulsion is achieved by applying an ": null
    },
    {
        "aqueous": "aqueous solution"
    },
    {
        " surfactant solution to the fuel through a high-pressure nozzle. Emulsifiers are not effective at extinguishing large fires involving bulk/deep liquid fuels, because the amount of emulsifier agent needed for extinguishment is a function of the volume of the fuel, whereas other agents such as ": null
    },
    {
        "aqueous film-forming foam": "fire-fighting foam"
    },
    {
        " need cover only the surface of the fuel to achieve vapor mitigation.           Emulsions are used to manufacture polymer dispersions – polymer production in an emulsion phase has a number of process advantages, including prevention of coagulation of product. Products produced by such polymerisations may be used as the emulsions – products including primary components for glues and paints. Synthetic ": null
    },
    {
        "latex": "latex"
    }
]