[
    {
        "   Endocrinology  is a branch of ": null
    },
    {
        "biology": "biology"
    },
    {
        " and ": null
    },
    {
        "medicine": "medicine"
    },
    {
        " dealing with the ": null
    },
    {
        "endocrine system": "endocrine system"
    },
    {
        ", its diseases, and its specific secretions known as ": null
    },
    {
        "hormone": "hormone"
    },
    {
        "s. It is also concerned with the integration of developmental events proliferation, growth, and differentiation, and the psychological or behavioral activities of ": null
    },
    {
        "metabolism": "metabolism"
    },
    {
        ", ": null
    },
    {
        "growth and development": "human development"
    },
    {
        ", ": null
    },
    {
        "tissue": "tissue"
    },
    {
        " function, ": null
    },
    {
        "sleep": "sleep"
    },
    {
        ", ": null
    },
    {
        "digestion": "digestion"
    },
    {
        ", ": null
    },
    {
        "respiration": "respiration"
    },
    {
        ", ": null
    },
    {
        "excretion": "excretion"
    },
    {
        ", ": null
    },
    {
        "mood": "mood"
    },
    {
        ", ": null
    },
    {
        "stress": "stress"
    },
    {
        ", ": null
    },
    {
        "lactation": "lactation"
    },
    {
        ", ": null
    },
    {
        "movement": "motor coordination"
    },
    {
        ", ": null
    },
    {
        "reproduction": "reproduction"
    },
    {
        ", and ": null
    },
    {
        "sensory perception": "sensory perception"
    },
    {
        " caused by ": null
    },
    {
        "hormone": "hormone"
    },
    {
        "s. Specializations include behavioral endocrinology Nelson, R. J. 2005. An Introduction to Behavioral Endocrinology, Fourth Edition. Sinauer Associates, Sunderland, MA.   and ": null
    },
    {
        "comparative endocrinology": "comparative endocrinology"
    },
    {
        ".     The endocrine system consists of several ": null
    },
    {
        "glands": "glands"
    },
    {
        ", all in different parts of the body, that secrete hormones directly into the blood rather than into a duct system. Therefore, ": null
    },
    {
        "endocrine glands": "endocrine gland"
    },
    {
        "are regarded as ductless glands. Hormones have many different functions and modes of action; one hormone may have several effects on different target organs, and, conversely, one target organ may be affected by more than one hormone.        Endocrinology is the study of the endocrine system in the ": null
    },
    {
        "human body": "human body"
    },
    {
        ". This is a system of ": null
    },
    {
        "glands": "gland"
    },
    {
        "which secrete hormones. Hormones are chemicals which affect the actions of different organ systems in the body. Examples include ": null
    },
    {
        "thyroid hormone": "thyroid hormone"
    },
    {
        ", ": null
    },
    {
        "growth hormone": "growth hormone"
    },
    {
        ", and ": null
    },
    {
        "insulin": "insulin"
    },
    {
        ". The endocrine system involves a number of feedback mechanisms, so that often one hormone  will control the action or release of another secondary hormone . If there is too much of the secondary hormone, it may provide negative feedback to the primary hormone, maintaining ": null
    },
    {
        "homeostasis": "homeostasis"
    },
    {
        ".     In the original 1902 definition by Bayliss and Starling , they specified that, to be classified as a hormone, a chemical must be produced by an organ, be released into the blood, and be transported by the blood to a distant organ to exert its specific function. This definition holds for most classical hormones, but there are also ": null
    },
    {
        "paracrine": "paracrine"
    },
    {
        " mechanisms , ": null
    },
    {
        "autocrine": "autocrine signaling"
    },
    {
        " signals , and ": null
    },
    {
        "intracrine": "intracrine"
    },
    {
        " signals .  A ": null
    },
    {
        "neuroendocrine": "neuroendocrine"
    },
    {
        " signal is a classical hormone that is released into the blood by a neurosecretory neuron .       Griffin and Ojeda identify three different classes of hormones based on their chemical composition:           Amines, such as ": null
    },
    {
        "norepinephrine": "norepinephrine"
    },
    {
        ", ": null
    },
    {
        "epinephrine": "epinephrine"
    },
    {
        ", and ": null
    },
    {
        "dopamine": "dopamine"
    },
    {
        " , are derived from single ": null
    },
    {
        "amino acid": "amino acid"
    },
    {
        "s, in this case tyrosine. ": null
    },
    {
        "Thyroid": "thyroid"
    },
    {
        " hormones such as 3,5,3’-triiodothyronine and 3,5,3’,5’-tetraiodothyronine make up a subset of this class because they derive from the combination of two iodinated tyrosine amino acid residues.       ": null
    },
    {
        "Peptide hormones": "peptide hormones"
    },
    {
        " and protein hormones consist of three  to more than 200  amino acid residues and can have a molecular mass as large as 31,000 grams per mole. All hormones secreted by the pituitary gland are peptide hormones, as are ": null
    },
    {
        "leptin": "leptin"
    },
    {
        " from adipocytes, ": null
    },
    {
        "ghrelin": "ghrelin"
    },
    {
        " from the stomach, and ": null
    },
    {
        "insulin": "insulin"
    },
    {
        " from the ": null
    },
    {
        "pancreas": "pancreas"
    },
    {
        ".          ": null
    },
    {
        "Steroid hormones": "steroid hormones"
    },
    {
        " are converted from their parent compound, ": null
    },
    {
        "cholesterol": "cholesterol"
    },
    {
        ". ": null
    },
    {
        "Mammal": "mammal"
    },
    {
        "ian steroid hormones can be grouped into five groups by the receptors to which they bind: ": null
    },
    {
        "glucocorticoid": "glucocorticoid"
    },
    {
        "s, ": null
    },
    {
        "mineralocorticoid": "mineralocorticoid"
    },
    {
        "s, ": null
    },
    {
        "androgen": "androgen"
    },
    {
        "s, ": null
    },
    {
        "estrogen": "estrogen"
    },
    {
        "s, and ": null
    },
    {
        "progestogen": "progestogen"
    },
    {
        "s. Some forms of ": null
    },
    {
        "vitamin D": "vitamin d"
    },
    {
        ", such as ": null
    },
    {
        "calcitriol": "calcitriol"
    },
    {
        ", are steroid-like and bind to homologous receptors, but lack the characteristic fused ring structure of true steroids.              Although every organ system secretes and responds to hormones , the clinical specialty of endocrinology focuses primarily on the endocrine organs, meaning the organs whose primary function is hormone secretion. These organs include the ": null
    },
    {
        "pituitary": "pituitary"
    },
    {
        ", ": null
    },
    {
        "thyroid": "thyroid"
    },
    {
        ", ": null
    },
    {
        "adrenal": "adrenal"
    },
    {
        "s, ": null
    },
    {
        "ovaries": "ovary"
    },
    {
        ", ": null
    },
    {
        "testes": "testes"
    },
    {
        ", and ": null
    },
    {
        "pancreas": "pancreas"
    },
    {
        ".     An endocrinologist is a ": null
    },
    {
        "physician": "physician"
    },
    {
        " who specializes in treating disorders of the endocrine system, such as ": null
    },
    {
        "diabetes": "diabetes"
    },
    {
        ", ": null
    },
    {
        "hyperthyroidism": "hyperthyroidism"
    },
    {
        ", and many others .       The medical specialty of endocrinology involves the diagnostic evaluation of a wide variety of symptoms and variations and the long-term management of disorders of deficiency or excess of one or more hormones.     The diagnosis and treatment of endocrine diseases are guided by ": null
    },
    {
        "laboratory": "laboratory"
    },
    {
        " tests to a greater extent than for most specialties. Many diseases are investigated through excitation/stimulation or inhibition/suppression testing. This might involve injection with a stimulating agent to test the function of an endocrine organ. Blood is then sampled to assess the changes of the relevant hormones or metabolites. An endocrinologist needs extensive knowledge of ": null
    },
    {
        "clinical chemistry": "clinical chemistry"
    },
    {
        " and ": null
    },
    {
        "biochemistry": "biochemistry"
    },
    {
        " to understand the uses and limitations of the investigations.     A second important aspect of the practice of endocrinology is distinguishing human variation from disease. Atypical patterns of physical development and abnormal test results must be assessed as indicative of disease or not. ": null
    },
    {
        "Diagnostic imaging": "diagnostic imaging"
    },
    {
        " of endocrine organs may reveal incidental findings called ": null
    },
    {
        "incidentaloma": "incidentaloma"
    },
    {
        "s, which may or may not represent disease.     Endocrinology involves caring for the person as well as the disease. Most endocrine disorders are ": null
    },
    {
        "chronic diseases": "chronic disease"
    },
    {
        "that need lifelong care. Some of the most common endocrine diseases include ": null
    },
    {
        "diabetes": "diabetes"
    },
    {
        " mellitus, ": null
    },
    {
        "hypothyroidism": "hypothyroidism"
    },
    {
        " and the ": null
    },
    {
        "metabolic syndrome": "metabolic syndrome"
    },
    {
        ". Care of diabetes, obesity and other chronic diseases necessitates understanding the patient at the personal and social level as well as the molecular, and the physician–patient relationship can be an important therapeutic process.     Apart from treating patients, many endocrinologists are involved in ": null
    },
    {
        "clinical science": "clinical science"
    },
    {
        " and ": null
    },
    {
        "medical research": "medical research"
    },
    {
        ", ": null
    },
    {
        "teaching": "teaching"
    },
    {
        ", and ": null
    },
    {
        "hospital management": "hospital management"
    },
    {
        ".       Endocrinologists are specialists of ": null
    },
    {
        "internal medicine": "internal medicine"
    },
    {
        " or ": null
    },
    {
        "pediatrics": "pediatrics"
    },
    {
        ". Reproductive endocrinologists deal primarily with problems of ": null
    },
    {
        "fertility": "fertility"
    },
    {
        " and menstrual function—often training first in obstetrics. Most qualify as an ": null
    },
    {
        "internist": "internist"
    },
    {
        ", ": null
    },
    {
        "pediatrician": "pediatrician"
    },
    {
        ", or ": null
    },
    {
        "gynecologist": "gynecologist"
    },
    {
        " for a few years before specializing, depending on the local training system. In the U.S. and Canada, training for board certification in internal medicine, ": null
    },
    {
        "pediatrics": "pediatrics"
    },
    {
        ", or ": null
    },
    {
        "gynecology": "gynecology"
    },
    {
        " after medical school is called residency. Further formal training to subspecialize in adult, ": null
    },
    {
        "pediatric": "pediatric endocrinology"
    },
    {
        ", or reproductive endocrinology is called a fellowship. Typical training for a North American endocrinologist involves 4 years of college, 4 years of medical school, 3 years of residency, and 2 years of fellowship. In the US, adult endocrinologists are board certified by the ": null
    },
    {
        "American Board of Internal Medicine": "american board of internal medicine"
    },
    {
        " or the ": null
    },
    {
        "American Osteopathic Board of Internal Medicine": "american osteopathic board of internal medicine"
    },
    {
        " in Endocrinology, Diabetes and Metabolism.           :See main article at  Endocrine diseases    Endocrinology also involves study of the diseases of the endocrine system. These diseases may relate to too little or too much secretion of a hormone, too little or too much action of a hormone, or problems with receiving the hormone.       Because endocrinology encompasses so many conditions and diseases, there are many organizations that provide education to patients and the public. ": null
    },
    {
        "The Hormone Foundation": "the hormone foundation"
    },
    {
        " is the public education affiliate of ": null
    },
    {
        "The Endocrine Society": "the endocrine society"
    },
    {
        " and provides information on all endocrine-related conditions. Other educational organizations that focus on one or more endocrine-related conditions include the ": null
    },
    {
        "American Diabetes Association": "american diabetes association"
    },
    {
        ", Human Growth Foundation, American Menopause Foundation, Inc., and Thyroid Foundation of America.     In North America the principal professional organizations of endocrinologists include The Endocrine Society,  the ": null
    },
    {
        "American Association of Clinical Endocrinologists": "american association of clinical endocrinologists"
    },
    {
        ",  the American Diabetes Association,  the Lawson Wilkins Pediatric Endocrine Society,  and the American Thyroid Association.      In Europe, the  and the  are the main organisations representing professionals in the fields of adult and paediatric endocrinology, respectively.     In the United Kingdom, the ": null
    },
    {
        "Society for Endocrinology": "society for endocrinology"
    },
    {
        "  and the British Society for Paediatric Endocrinology and Diabetes  are the main professional organisations.     The European Society for Paediatric Endocrinology  is the largest international professional association dedicated solely to paediatric endocrinology. There are numerous similar associations around the world.          The earliest study of endocrinology began in China. The Chinese were isolating sex and pituitary hormones from human ": null
    },
    {
        "urine": "urine"
    },
    {
        " and using them for medicinal purposes by 200 BC.  They used many complex methods, such as sublimation of steroid hormones. Another method specified by Chinese texts—the earliest dating to 1110—specified the use of ": null
    },
    {
        "saponin": "saponin"
    },
    {
        "  to extract hormones, but ": null
    },
    {
        "gypsum": "gypsum"
    },
    {
        "  was also known to have been used.     Although most of the relevant tissues and endocrine glands had been identified by early anatomists, a more humoral approach to understanding biological function and disease was favoured by the ": null
    },
    {
        "ancient Greek": "ancient greece"
    },
    {
        " and ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " thinkers such as ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        ", ": null
    },
    {
        "Hippocrates": "hippocrates"
    },
    {
        ", ": null
    },
    {
        "Lucretius": "lucretius"
    },
    {
        ", ": null
    },
    {
        "Celsus": "aulus cornelius celsus"
    },
    {
        ", and ": null
    },
    {
        "Galen": "galen"
    },
    {
        ", according to Freeman et al.,  and these theories held sway until the advent of ": null
    },
    {
        "germ theory": "germ theory of disease"
    },
    {
        ", physiology, and organ basis of pathology in the 19th century.     In 1849, ": null
    },
    {
        "Arnold Berthold": "arnold adolph berthold"
    },
    {
        " noted that castrated cockerels did not develop combs and wattles or exhibit overtly male behaviour.  He found that replacement of testes back into the abdominal cavity of the same bird or another castrated bird resulted in normal behavioural and morphological development, and he concluded that the testes secreted a substance that conditioned the blood that, in turn, acted on the body of the cockerel. In fact, one of two other things could have been true: that the testes modified or activated a constituent of the blood or that the testes removed an inhibitory factor from the blood. It was not proven that the testes released a substance that engenders male characteristics until it was shown that the extract of testes could replace their function in castrated animals. Pure, crystalline ": null
    },
    {
        "testosterone": "testosterone"
    },
    {
        " was isolated in 1935.      The ": null
    },
    {
        "Graves disease": "graves disease"
    },
    {
        " was named after Irish doctor ": null
    },
    {
        "Robert James Graves": "robert james graves"
    },
    {
        ",  who described a case of ": null
    },
    {
        "goiter": "goiter"
    },
    {
        " with ": null
    },
    {
        "exophthalmos": "exophthalmos"
    },
    {
        " in 1835. The German ": null
    },
    {
        "Karl Adolph von Basedow": "karl adolph von basedow"
    },
    {
        " also independently reported the same constellation of symptoms in 1840, while earlier reports of the disease were also published by the Italians Giuseppe Flajani and Antonio Giuseppe Testa, in 1802 and 1810 respectively,  and by the English physician ": null
    },
    {
        "Caleb Hillier Parry": "caleb hillier parry"
    },
    {
        "  in the late 18th century.  ": null
    },
    {
        "Thomas Addison": "thomas addison"
    },
    {
        " was first to describe ": null
    },
    {
        "Addisons disease": "addisons disease"
    },
    {
        " in 1849.       In 1902 ": null
    },
    {
        "William Bayliss": "william bayliss"
    },
    {
        " and ": null
    },
    {
        "Ernest Starling": "ernest starling"
    },
    {
        " performed an experiment in which they observed that acid instilled into the ": null
    },
    {
        "duodenum": "duodenum"
    },
    {
        " caused the ": null
    },
    {
        "pancreas": "pancreas"
    },
    {
        " to begin secretion, even after they had removed all nervous connections between the two. Bayliss WM, Starling EH. The mechanism of pancreatic secretion. J Physiol 1902;28:325–352. The same response could be produced by injecting extract of jejunum mucosa into the jugular vein, showing that some factor in the mucosa was responsible. They named this substance ": null
    },
    {
        "secretin": "secretin"
    },
    {
        " and coined the term hormone for chemicals that act in this way.     ": null
    },
    {
        "Joseph von Mering": "joseph von mering"
    },
    {
        " and ": null
    },
    {
        "Oskar Minkowski": "oskar minkowski"
    },
    {
        " made the observation in 1889 that removing the ": null
    },
    {
        "pancreas": "pancreas"
    },
    {
        " surgically led to an increase in ": null
    },
    {
        "blood sugar": "blood sugar"
    },
    {
        ", followed by a coma and eventual death—symptoms of ": null
    },
    {
        "diabetes mellitus": "diabetes mellitus"
    },
    {
        ". In 1922, Banting and Best realized that homogenizing the pancreas and injecting the derived extract reversed this condition.      ": null
    },
    {
        "Neurohormones": "neurohormone"
    },
    {
        "were first identified by ": null
    },
    {
        "Otto Loewi": "otto loewi"
    },
    {
        " in 1921. Loewi, O. Uebertragbarkeit der Herznervenwirkung. Pflugers Arch. ges Physiol. 1921;189:239-42. He incubated a frogs heart  in a saline bath, and left in the solution for some time. The solution was then used to bathe a non-innervated second heart. If the vagus nerve on the first heart was stimulated, negative ": null
    },
    {
        "inotropic": "inotropic"
    },
    {
        " and ": null
    },
    {
        "chronotropic": "chronotropic"
    },
    {
        " activity were seen in both hearts. This did not occur in either heart if the vagus nerve was not stimulated. The vagus nerve was adding something to the saline solution. The effect could be blocked using ": null
    },
    {
        "atropine": "atropine"
    },
    {
        ", a known ": null
    },
    {
        "inhibitor": "enzyme inhibitor"
    },
    {
        " to ": null
    },
    {
        "heart": "heart"
    },
    {
        " vagal nerve stimulation. Clearly, something was being secreted by the ": null
    },
    {
        "vagus nerve": "vagus nerve"
    },
    {
        " and affecting the heart. The vagusstuff causing the myotropic effects was later identified to be ": null
    },
    {
        "acetylcholine": "acetylcholine"
    },
    {
        " and ": null
    },
    {
        "norepinephrine": "norepinephrine"
    },
    {
        ". Loewi won the Nobel Prize for his discovery.     Recent work in endocrinology focuses on the molecular mechanisms responsible for triggering the effects of ": null
    },
    {
        "hormone": "hormone"
    },
    {
        "s. The first example of such work being done was in 1962 by ": null
    },
    {
        "Earl Sutherland": "earl wilbur sutherland jr."
    },
    {
        ". Sutherland investigated whether hormones enter cells to evoke action, or stayed outside of cells. He studied ": null
    },
    {
        "norepinephrine": "norepinephrine"
    },
    {
        ", which acts on the liver to convert ": null
    },
    {
        "glycogen": "glycogen"
    },
    {
        " into ": null
    },
    {
        "glucose": "glucose"
    },
    {
        " via the activation of the ": null
    },
    {
        "phosphorylase": "phosphorylase"
    },
    {
        " enzyme. He homogenized the liver into a membrane fraction and soluble fraction , added norepinephrine to the membrane fraction, extracted its soluble products, and added them to the first soluble fraction. Phosphorylase activated, indicating that norepinephrines target receptor was on the cell membrane, not located intracellularly. He later identified the compound as cyclic AMP  and with his discovery created the concept of second-messenger-mediated pathways. He, like Loewi, won the Nobel Prize for his groundbreaking work in endocrinology. ": null
    }
]