[
    {
        "         An endothermic process is any process which requires or absorbs ": null
    },
    {
        "energy": "energy"
    },
    {
        " from its surroundings, usually in the form of ": null
    },
    {
        "heat": "heat"
    },
    {
        ". It may be a chemical process, such as dissolving ammonium nitrate in water, or a physical process, such as the melting of ice cubes. The term was coined by ": null
    },
    {
        "Marcellin Berthelot": "marcellin berthelot"
    },
    {
        " from the Greek roots endo-, derived from the word endon meaning within , and the root therm , meaning hot or warm in the sense that a reaction depends on absorbing heat if it is to proceed. The opposite of an endothermic process is an ": null
    },
    {
        "exothermic process": "exothermic process"
    },
    {
        ", one that releases, gives out energy in the form of heat. Thus in each term the prefix refers to where heat goes as the reaction occurs, though in reality it only refers to where the energy goes, without necessarily being in the form of heat.       All chemical reactions involve both the breaking of existing and the making of new chemical bonds. A reaction to break a bond always requires the input of energy and so such a process is always endothermic. When atoms come together to form new chemical bonds, the electrostatic forces bringing them together leave the bond with a large excess of energy . If that energy is not dissipated, the new bond would quickly break apart again. Instead, the new bond can shed its excess energy - by radiation, by transfer to other motions in the molecule, or to other molecules through collisions - and then become a stable new bond. Shedding this excess energy is the exothermicity that leaves the molecular system. Whether a given overall reaction is exothermic or endothermic is determined by the relative contribution of these bond breaking endothermic steps and new bond stabilizing exothermic steps.     The concept is frequently applied in ": null
    },
    {
        "physical sciences": "physical sciences"
    },
    {
        " to, for example, ": null
    },
    {
        "chemical reaction": "chemical reaction"
    },
    {
        "s, where ": null
    },
    {
        "thermal energy": "thermal energy"
    },
    {
        " is converted to chemical ": null
    },
    {
        "bond energy": "bond energy"
    },
    {
        ".     Endothermic analysis only accounts for the ": null
    },
    {
        "enthalpy": "enthalpy"
    },
    {
        " change of a reaction. The full energy analysis of a reaction is the ": null
    },
    {
        "Gibbs free energy": "gibbs free energy"
    },
    {
        " , which includes an ": null
    },
    {
        "entropy": "entropy"
    },
    {
        " and temperature term in addition to the enthalpy. A reaction will be a ": null
    },
    {
        "spontaneous process": "spontaneous process"
    },
    {
        " at a certain temperature if the products have a lower Gibbs free energy  even if the enthalpy of the products is higher. Entropy and enthalpy are different terms, so the change in entropic energy can overcome an opposite change in enthalpic energy and make an endothermic reaction favorable.       ": null
    },
    {
        "Photosynthesis": "photosynthesis"
    },
    {
        " Melting": "melting"
    },
    {
        " of ice   ": null
    },
    {
        "Evaporating": "evaporation"
    },
    {
        " liquid water   ": null
    },
    {
        "Sublimation": "sublimation"
    },
    {
        " of ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        "   Cracking": "cracking"
    },
    {
        " of ": null
    },
    {
        "alkanes": "alkane"
    },
    {
        "  Thermal decomposition": "thermal decomposition"
    },
    {
        " reactions   Electrolytic decomposition of ": null
    },
    {
        "sodium chloride": "sodium chloride"
    },
    {
        " into ": null
    },
    {
        "sodium hydroxide": "sodium hydroxide"
    },
    {
        " and ": null
    },
    {
        "hydrogen chloride": "hydrogen chloride"
    },
    {
        " ammonium chloride": "ammonium chloride"
    },
    {
        " in water   ": null
    },
    {
        "Nucleosynthesis": "nucleosynthesis"
    },
    {
        " of elements heavier than ": null
    },
    {
        "nickel": "nickel"
    },
    {
        " in stellar cores   High-energy neutrons can produce ": null
    },
    {
        "tritium": "tritium"
    },
    {
        " from ": null
    },
    {
        "lithium-7": "lithium-7"
    },
    {
        " in an endothermic reaction, consuming 2.466 MeV. This was discovered when the 1954 ": null
    },
    {
        "Castle Bravo": "castle bravocause of high yield"
    },
    {
        " nuclear test produced an unexpectedly high yield.    Nuclear fusion of elements heavier than iron in ": null
    },
    {
        "supernova": "supernova"
    },
    {
        "e Qian, Y.-Z.; Vogel, P.; Wasserburg, G. J. . Diverse Supernova Sources for the r-Process . Astrophysical Journal 494 : 285–296. . . ": null
    }
]