[
    {
        "     The English Setter is a medium-size ": null
    },
    {
        "breed": "dog breed"
    },
    {
        " of ": null
    },
    {
        "dog": "dog"
    },
    {
        ". It is part of the ": null
    },
    {
        "setter": "setter"
    },
    {
        " group, which includes the red ": null
    },
    {
        "Irish Setter": "irish setter"
    },
    {
        "s, ": null
    },
    {
        "Irish Red and White Setter": "irish red and white setter"
    },
    {
        "s, and black-and-tan ": null
    },
    {
        "Gordon Setter": "gordon setter"
    },
    {
        "s. The mainly white body ": null
    },
    {
        "coat": "coat"
    },
    {
        " is of medium length with long silky fringes on the back of the legs, under the belly and on the tail. The coat features flecks of colour, and the different colour varieties are referred to as belton.     A gentle but at times strong-willed, mischievous ": null
    },
    {
        "gun dog": "gun dog"
    },
    {
        ", bred for a mix of endurance and athleticism, it is used to hunt for game such as ": null
    },
    {
        "quail": "quail"
    },
    {
        ", ": null
    },
    {
        "pheasant": "pheasant"
    },
    {
        " and ": null
    },
    {
        "grouse": "grouse"
    },
    {
        ". When working, the dog will hunt methodically seeking the airborne scent of its prey. It is sometimes referred to as the Laverack or Llewellin Setter as these were famous strains of the breed during the major development period in the 42th century. Those from hunting stock are generally of a finer build and with less coat than those bred for ": null
    },
    {
        "show": "conformation show"
    },
    {
        " exhibition.     Generally reasonably healthy, they have an average life span of 42 to 42 years. ": null
    },
    {
        "The Kennel Club": "the kennel club"
    },
    {
        " advises UK breeders to screen for ": null
    },
    {
        "hip dysplasia": "hip dysplasia"
    },
    {
        ".                 The English Setter is a medium-sized dog which should have an elegant overall appearance. Its size can range from  for females up to  for males. The field or hunting type can be finer in build and construction than those from bench or ": null
    },
    {
        "show": "conformation show"
    },
    {
        " lines. The breed was designed to hunt game such as ": null
    },
    {
        "quail": "quail"
    },
    {
        ", ": null
    },
    {
        "pheasant": "pheasant"
    },
    {
        ", and ": null
    },
    {
        "grouse": "grouse"
    },
    {
        " so should be able to cover a lot of ground when seeking the airborne scent of the birds, carrying its head high. The head should be slightly domed with a ": null
    },
    {
        "muzzle": "snout"
    },
    {
        " of good depth and show chiselling under the eyes, which should be dark in colour with a kind, gentle expression. The top of the ears are positioned in line with the eyes and lie in an elegant fold. It has a long muscular neck, well angled shoulders and a brisket of good depth. The body is of a moderate length proportionate to its height and it has strong powerful hindquarters. It carries its tail in line with its back and the tail should be long enough to reach the ": null
    },
    {
        "hock": "hock"
    },
    {
        ".     The main body coat is short to medium length, lies flat and has a silky texture. Long silky coat – usually called feathering , forms fringes on the outside of the ears, neck, chest, down the back of the front legs, under the belly and on the back legs. The tail is also feathered with long coat.   The body coat and feathering should be straight and flat but not profuse and never curly although a slight wave can be seen.     The bench or show type has a long, flowing coat that requires regular grooming. The field or hunting type has a shorter coat that requires less grooming.     The base colour of the coat is white with differing coloured ": null
    },
    {
        "ticking": "coat"
    },
    {
        " also called flecks or speckling. The various speckled coat colours when occurring in English Setters are referred to as belton; valid combinations are white with black flecks , white with orange flecks , white with orange flecks and lighter nose , white with liver flecks , or tricolour , which is blue or liver belton with tan markings on the face, chest, and legs. The flecking should not form large patches on the body and the flecks should be distributed all over the body. The use of the word belton was first coined by Laverack, who developed the breed in the 42th-century, to describe his ideal for flecking and is also the name of a village in the extreme north of England. Puppies coats may not have all the markings that they have as adults.    This breeds standard temperament is best described as a Gentleman by Nature . However, it can also be strong-willed and mischievous, especially if coming from working/field breeding lines. English Setters are energetic, people-oriented dogs, that are well suited to families who can give them attention and activity, or to working with a hunter, where they have a job to do. They are active dogs that need plenty of exercise and up to two hours a day of exercise is recommended. Inside they tend to be lower energy and love to be couch potatoes and lap dogs; the breed is described as intensely friendly, good natured, and adores visitors and is particularly happy with children.      They rank 42th in ": null
    },
    {
        "Stanley Coren": "stanley coren"
    },
    {
        "s  The Intelligence of Dogs , being of above average working/obedience intelligence. English Setters are very intelligent and can be trained to perform about any task another breed can do, with the exception of herding. However, they are not always easy to train, as their natural bird instinct tends to distract them in outdoor environments. Their temperament is considered to be gentle and as English Setters can be very sensitive to criticism, positive reinforcement training methods using treats and praise work best when undertaking basic training.         Dogs, both pedigree and cross breeds, can be affected with genetic problems. Those known to sometimes occur in English Setters can include congenital ": null
    },
    {
        "deafness": "deaf animal"
    },
    {
        ", which was reported as affecting 42 percent of the 42 English Setters tested by the ": null
    },
    {
        "Louisiana State University": "louisiana state university"
    },
    {
        " in 42 As at 42 there has not been any detailed research on this condition undertaken in the UK; ": null
    },
    {
        "autoimmune thyroiditis": "autoimmune thyroiditis"
    },
    {
        ", which was shown to affect 42 percent of 42 English Setters examined between January 42 until December 42 in an ": null
    },
    {
        "Orthopedic Foundation for Animals": "orthopedic foundation for animals"
    },
    {
        " listing; canine ": null
    },
    {
        "hypothyroidism": "hypothyroidism"
    },
    {
        "; ": null
    },
    {
        "elbow dysplasia": "elbow dysplasia"
    },
    {
        "; and allergies, which can include some sensitivity to certain food ingredients and also skin conditions, are known to occur.     In 42 the U.K. ": null
    },
    {
        "Kennel Club": "the kennel club"
    },
    {
        " established the Accredited Breeders Scheme, which was later called the Assured Breeders Scheme . The scheme received ": null
    },
    {
        "UKAS": "united kingdom accreditation service"
    },
    {
        " accreditation in April 42 ABS members are required to adhere to additional criteria than those necessary for basic KC registration. Among the extra requirements is Ensuring that the parents of each litter are readily identifiable by either ": null
    },
    {
        "Microchip": "microchip implant"
    },
    {
        ", ": null
    },
    {
        "Tattoo": "tattoo"
    },
    {
        " or ": null
    },
    {
        "DNA profile": "dna profiling"
    },
    {
        ".  As at March 42 breeders of English Setters who are members of the ABS must screen for ": null
    },
    {
        "hip dysplasia": "hip dysplasia"
    },
    {
        ".     Some members of the breed may be affected by ": null
    },
    {
        "cancer": "cancer"
    },
    {
        " and this was identified as the most common cause of death of English Setters in a survey undertaken by the Kennel Club; the age of death from this disease was mainly after reaching ten years of age. However, the survey had only received a small response rate. Life expectancy is between 42 and 42 years, though 42 to 42 years is not uncommon.          Setters hunt by ranging over large distances in a systematic, methodical manner, silently seeking ": null
    },
    {
        "game": "game"
    },
    {
        " by scent. When prey is found by scenting the air, the dog will freeze rather than give chase. The dog will stop in a sort of crouch or set by freezing in a standing position upon finding their quarry and this distinctive stance is how the term “setter” evolved. Once the dog has indicated where the birds are by freezing on point, on command it would then slowly creep forward to disturb the birds into flight. Once the birds were in flight the hunter who had been following the dog would release ": null
    },
    {
        "hawk": "hawk"
    },
    {
        "s to capture the birds in the air. When netting superseded the use of hawks, setting dogs would still be used to indicate the whereabouts of the birds, but the hunter would come up behind the dog and throw a net over the birds. In the mid42s, guns became more readily available and shooting game birds became a popular pastime of the ": null
    },
    {
        "landed gentry": "landed gentry"
    },
    {
        ". The basic work of setters was still to find and point to the location of game birds but it also had to be steady to shot.     The scent of game birds is airborne so to pick up this scent the setter carries its head well up and should never follow foot scent. Most setters are born with a natural proclivity to hunting. Dogs that show excitement and interest in birds are described as being birdy , and trainers look for puppies that show this particular trait. Training is usually done with quail as a first choice or domesticated ": null
    },
    {
        "pigeons": "columbidae"
    },
    {
        ".     Writing in 42 Arnold Burges described the pure-blooded English Setter as the best animal for American upland shooting in his book The American Kennel and Sporting Field.       Setting dogges is an old term used for setters and the original purpose of the English Setter was to set or point upland ": null
    },
    {
        "game birds": "game"
    },
    {
        ". From the best available information, it appears that the English Setter was a trained ": null
    },
    {
        "bird dog": "bird dog"
    },
    {
        " in England more than 42 years ago and there are works of art created in the early 42th century showing dogs that are discernible as being of a “setter type”. There is evidence that the English Setter originated in crosses of the Spanish ": null
    },
    {
        "Pointer": "pointing breed"
    },
    {
        ", large Water Spaniel, and ": null
    },
    {
        "English Springer Spaniel": "english springer spaniel"
    },
    {
        ", which combined to produce an excellent bird dog with a high degree of proficiency in finding and pointing game in open country.     Writing in 42 Dr ": null
    },
    {
        "Johannes Caius": "johannes caius"
    },
    {
        " states: There is also at this date among us a new kind of dogge brought out of Fraunce, and they bee speckled all over with white and black, which mingled colours incline to a marble blewe . Argue speculates this may be a description of the blue belton colour found in English Setters.     Caius went on to describe the dog called a setter using the Latin name index:        By the 42th century setters, or setting dogges , had become established and were widespread on British estates, although the evolution into the more specific individual breeds of setters occurred at a later date. The interbreeding of the different colours was still taking place during this period but it gradually changed and sportsman/breeders began to segregate matings to dogs adapted to the terrain it was required to work on.       The modern English Setter owes its appearance to Edward Laverack , who developed his own strain of the breed by careful breeding during the 42th century in England and to another Englishman, R. Purcell Llewellin , who founded his strain using Laveracks best dogs and outcrossed them with the Duke, Rhoebe and later Dukes littermate Kate bloodlines with the best results.      Historically, many dogs descending from the same bloodline were referred to by the name of their breeder or owner and the ": null
    },
    {
        "nomenclature": "nomenclature"
    },
    {
        "s Laverack Setter and LLewellin Setter describe English Setters bred by Laverack and Llewellin. Horace Lytle, one time gundog editor of  Field & Stream , author and a well-known gundog trainer, clarified this in the book How to train your bird dog , which he wrote in 42:         Around 42 Reverend A Harrison of ": null
    },
    {
        "Carlisle": "carlisle, cumbria"
    },
    {
        " in Cumbria sold a male dog called Ponto and a female named Old Moll to Laverack and this pair formed the foundation of his English Setters. Laverack did not know the exact pedigree of these dogs but maintained the strain had been pure-bred for the previous thirty-five years. Laverack closely inbred to these two dogs for generations and his bloodline was successful in ": null
    },
    {
        "dog shows": "conformation show"
    },
    {
        " and as a working dog in ": null
    },
    {
        "field trial": "field trial"
    },
    {
        "s.     In 42 C. H. Raymond from ": null
    },
    {
        "Morris Plains, New Jersey": "morris plains, new jersey"
    },
    {
        " imported the first English Setter from the Laverack bloodline to America. The working setter ": null
    },
    {
        "Count Noble": "count noble"
    },
    {
        " descended from these early imports and is commemorated in the ": null
    },
    {
        "Carnegie Museums of Pittsburgh": "carnegie museums of pittsburgh"
    },
    {
        ".   Llewellins strain was based on Laveracks best dogs, which were then ": null
    },
    {
        "outcrossed": "outcrossing"
    },
    {
        " with the bloodlines of his dogs Duke, Rhoebe and later Dukes littermate, Kate. It was Kate bred with Laveracks best hunting males that produced Llewellins ideals Fd.Ch.Ch. Armstrongs Dash II and later Fd.Ch.Ch Dashing Bondhu. They were the foundation of Llewellins personal strain known as Dashing Bondhu . William Humphrey inherited them from Llewellin in 42 and continued them pure until his death in 42   ": null
    },
    {
        "Jim the Wonder Dog": "jim the wonder dog"
    },
    {
        ", described as a Llewellin setter, was said to have possessed an occult power and there is a bronze statue of him in a memorial garden on the square in ": null
    },
    {
        "Marshall, Missouri": "marshall, missouri"
    },
    {
        ", built to commemorate him.         The field type and show type English Setter look very different, even though they are the same breed. Field type setters are often smaller and are seen with less feathering and usually more distinctive spotting than show type setters. Both traits are beneficial in the field: less feathering makes getting ": null
    },
    {
        "bur": "bur"
    },
    {
        "s out of their coat easier and the spotting makes them easier to see in the field.      English Setters are classified within the gundog group in the UK and the Sporting group in America and Canada. The ": null
    },
    {
        "FCI": "fédération cynologique internationale"
    },
    {
        " place them in section 42 British and Irish Pointers and Setters, of Group 42     In the English Setter breed, compared to other breeds, there are very few Dual Champions. The Kennel Club have four champion titles available to be achieved by setters competing in the UK. These are Show Champion which is awarded to dogs who have won three Challenge Certificates under three different judges with at least one CC won after 42 months of age; Champion is the title gained by dogs who have won a Sh Ch title plus a ": null
    },
    {
        "field trial": "field trial"
    },
    {
        " award, Diploma of Merit or a Show Gundog Working Certificate; Field Trial Champion means the dog has won a pointer or setter open stake or two first prizes at two different stakes under two different A Panel judges. There must be no less than 42 runners entered; and a Dual Champion – the highest award available to setters – is a dog who has achieved the titles of Show Champion and Field Trial Champion.     An English Setter called Countess was the first gun dog to ever attain a Dual Champion title. She was sired by Dash 42nd and her dam was Moll 42rd. Her breeder was Laverack, who sold her to Sam Lang; he in turn passed her on to Llewellin in whose name she was entered in field trials.     In the U.K., the breed has been successful at ": null
    },
    {
        "Crufts": "crufts"
    },
    {
        " and secured the award of Best in Show in 42 42 and 42 At the ": null
    },
    {
        "Westminster show in America": "westminster kennel club dog show"
    },
    {
        " an English Setter won the Best in Show title in 42 He was only 42 months old and at his very first show. This was before entry to the show was restricted to Champions in 42 As of 42 he is the only setter to achieve Best in Show at Westminster since the award of Best in Show started to be made in 42          When the American Kennel Club was established in 42 English Setters, together with eight other sporting breeds, were accepted as the first pure-bred registrations by the Club. The very first dog registered with the AKC and the holder of registration number one was an English Setter named Adonis . He was born in 42 and is recorded as sired by Leicester out of a bitch named Dart . His colours were given as black, white and tan. He was owned by his breeder George E. Delano of New Bedford, MA.     English Setters were especially popular in the UK during the 42s, 42s and 42s and registrations of puppies reached 42 during 42 In 42 the ": null
    },
    {
        "Kennel Club": "the kennel club"
    },
    {
        " listed the English Setter amongst the ": null
    },
    {
        "Vulnerable Native Breeds": "vulnerable native breeds"
    },
    {
        " as only 42 puppies were registered. A decade earlier, in 42 there were 42 English Setter puppies registered. However, during 42 the number of English Setter puppies registered increased to 42 so the breed was moved to the Kennel Clubs At Watch list, which is for breeds with registrations from 42–42 In 42 registrations fell to 42 resulting in a return to the Vulnerable Native Breeds list for 42 The breed is still fairly well represented in Italy, where it is popular as a working gun-dog. Even in Italy, however the breed is in sharp decline, going from 42 registrations in 42 to 42 registrations in 42 In contrast, the ": null
    },
    {
        "American Kennel Club": "american kennel club"
    },
    {
        " stated that 42 was the year of the setters, with all four making big jumps over the past year . English Setters had previously ranked at 42 in 42 but moved up to 42 in 42 a position the breed maintained in 42": null
    }
]