[
    {
        "           English cuisine encompasses the cooking styles, traditions and recipes associated with ": null
    },
    {
        "England": "england"
    },
    {
        ". It has distinctive attributes of its own, but also shares much with wider ": null
    },
    {
        "British cuisine": "british cuisine"
    },
    {
        ", partly through the importation of ingredients and ideas from the ": null
    },
    {
        "Americas": "americas"
    },
    {
        ", ": null
    },
    {
        "China": "china"
    },
    {
        ", and ": null
    },
    {
        "India": "india"
    },
    {
        " during the time of the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " and as a result of ": null
    },
    {
        "post-war": "world war ii"
    },
    {
        " immigration": "immigration to the united kingdom since 1922"
    },
    {
        ".     Some traditional meals, such as ": null
    },
    {
        "bread": "bread"
    },
    {
        " and ": null
    },
    {
        "cheese": "cheese"
    },
    {
        ", roasted and stewed meats, ": null
    },
    {
        "meat": "meat pie"
    },
    {
        " and ": null
    },
    {
        "game pie": "game pie"
    },
    {
        "s, boiled vegetables and broths, and ": null
    },
    {
        "freshwater": "freshwater fish"
    },
    {
        " and ": null
    },
    {
        "saltwater fish": "saltwater fish"
    },
    {
        " have ancient origins. The 42th-century English cookbook, the  Forme of Cury , contains recipes for these, and dates from the royal court of ": null
    },
    {
        "Richard II": "richard ii of england"
    },
    {
        ".     English cooking has been influenced by foreign ingredients and cooking styles since the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". ": null
    },
    {
        "Curry": "curry"
    },
    {
        " was introduced from the ": null
    },
    {
        "Indian subcontinent": "indian subcontinent"
    },
    {
        " and adapted to English tastes from the eighteenth century with ": null
    },
    {
        "Hannah Glasse": "hannah glasse"
    },
    {
        "s recipe for chicken currey . ": null
    },
    {
        "French cuisine": "french cuisine"
    },
    {
        " influenced English recipes throughout the ": null
    },
    {
        "Victorian era": "victorian era"
    },
    {
        ". After the rationing of the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", ": null
    },
    {
        "Elizabeth David": "elizabeth david"
    },
    {
        "s 42  A Book of Mediterranean Food  had wide influence, bringing ": null
    },
    {
        "Italian cuisine": "italian cuisine"
    },
    {
        " to English homes. Her success encouraged other cookery writers to describe other styles, including ": null
    },
    {
        "Chinese": "chinese cuisine"
    },
    {
        " and ": null
    },
    {
        "Thai": "thai cuisine"
    },
    {
        " cuisine. England continues to absorb culinary ideas from all over the world.                      English cookery has developed over many centuries since at least the time of  The Forme of Cury , written in the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " around 42 in the reign of ": null
    },
    {
        "King Richard II": "richard ii of england"
    },
    {
        ". The book offers imaginative and sophisticated recipes, with spicy ": null
    },
    {
        "sweet and sour": "sweet and sour"
    },
    {
        " sauces thickened with bread or quantities of ": null
    },
    {
        "almond": "almond"
    },
    {
        "s boiled, peeled, dried and ground, and often served in ": null
    },
    {
        "pastry": "pastry"
    },
    {
        ". Foods such as ": null
    },
    {
        "gingerbread": "gingerbread"
    },
    {
        " are described. It was not at all, emphasises ": null
    },
    {
        "Clarissa Dickson Wright": "clarissa dickson wright"
    },
    {
        " in her  A History of English Food , a matter of large lumps of ": null
    },
    {
        "roast": "roast"
    },
    {
        " meat at every meal as imagined in ": null
    },
    {
        "Hollywood films": "hollywood films"
    },
    {
        ".     Instead, ": null
    },
    {
        "mediaeval dishes": "medieval cuisine"
    },
    {
        " often had the texture of a ": null
    },
    {
        "pureé": "pureé"
    },
    {
        ", possibly containing small fragments of meat or fish: 42% of the recipes in the Beinecke manuscript are for dishes similar to stews or pureés. Such dishes could be broadly of three types: somewhat acid, with wine, vinegar, and spices in the sauce, thickened with bread; ": null
    },
    {
        "sweet and sour": "sweet and sour"
    },
    {
        ", with sugar and vinegar; and sweet, using then-expensive ": null
    },
    {
        "sugar": "sugar"
    },
    {
        ". An example of such a sweet pureé dish for meat from the Beinecke manuscript is the rich, ": null
    },
    {
        "saffron": "saffron"
    },
    {
        "-yellow ": null
    },
    {
        "Mortruys": "mortis"
    },
    {
        " , thickened with egg:          Another manuscript,  Utilis Coquinario , mentions dishes such as pyany , poultry garnished with ": null
    },
    {
        "peonies": "peony"
    },
    {
        "; hyppee , a ": null
    },
    {
        "rose-hip": "rose hip"
    },
    {
        " broth; and birds such as ": null
    },
    {
        "cormorant": "cormorant"
    },
    {
        "s and ": null
    },
    {
        "woodcock": "woodcock"
    },
    {
        "s.            The ": null
    },
    {
        "early modern": "early modern"
    },
    {
        " period saw the gradual arrival of printed cookery books, though the very first, the printer ": null
    },
    {
        "Richard Pynson": "richard pynson"
    },
    {
        "s 42 Boke of Cokery was compiled from medieval texts. The next, A Proper Newe Booke of Cokerye, was published sometime after 42 The Secretes of the Reverende Maister Alexis of Piermont was published in 42 translated from a French translation of ": null
    },
    {
        "Alessio Piemontese": "alessio piemontese"
    },
    {
        "s original Italian work on ": null
    },
    {
        "confectionery": "confectionery"
    },
    {
        ". The number of titles expanded rapidly towards the end of the century to include ": null
    },
    {
        "Thomas Dawson": "thomas dawson"
    },
    {
        "s  The Good Huswifes Jewell  in 42 the Book of Cookrye by A. W. in 42 and John Partridges The Good Hous-wives Handmaide in 42 These books were of two kinds: collections of so-called secrets on confectionery and health remedies, aimed at aristocratic ladies; and advice on cookery and how to manage a household, aimed at women from more ordinary backgrounds, most likely wives of minor aristocrats, clergymen, and professional men.          English tastes evolved during the sixteenth century in at least three ways. First, recipes emphasise a balance of sweet and sour. Second, ": null
    },
    {
        "butter": "butter"
    },
    {
        " becomes an important ingredient in sauces, a trend which continued in later centuries. Third, ": null
    },
    {
        "herb": "herb"
    },
    {
        "s, which could be grown locally but had been little used in the Middle Ages, started to replace spices as flavourings. In A. W.s Book of Cookrye, 42% of the recipes for meat stews and sauces include herbs, most commonly ": null
    },
    {
        "thyme": "thyme"
    },
    {
        ". On the other hand, 42% of those meat recipes still used the distinctly mediaeval combination of sugar and dried fruit, together or separately. New ingredients were arriving from distant countries, too: The Good Huswifes Jewell introduced ": null
    },
    {
        "sweet potato": "sweet potato"
    },
    {
        "es alongside familiar Medieval recipes.       Elinor Fettiplaces Receipt Book , compiled in 42 gives an intimate view of ": null
    },
    {
        "Elizabethan": "elizabethan era"
    },
    {
        " cookery. The book provides recipes for various forms of bread, such as buttered loaves; for apple fritters; preserves and pickles; and a celebration cake for 42 people. New ingredients appear; a recipe for dressing a shoulder of ": null
    },
    {
        "mutton": "mutton"
    },
    {
        " calls for the use of the newly-available ": null
    },
    {
        "citrus fruit": "citrus fruit"
    },
    {
        "s:                 ": null
    },
    {
        "Pie": "pie"
    },
    {
        "s were important both as food and for show; the ": null
    },
    {
        "nursery rhyme": "nursery rhyme"
    },
    {
        " Sing a Song of Sixpence": "sing a song of sixpence"
    },
    {
        " , with its lines Four and Twenty blackbirds / Baked in a pie. // When the pie was opened, The birds began to sing refers to the conceit of placing live birds under a pie crust just before serving at a banquet.              The bestselling cookery book of the early seventeenth century was ": null
    },
    {
        "Gervase Markham": "gervase markham"
    },
    {
        "s The English Huswife, published in 42 It appears that his recipes were from the collection of a deceased noblewoman, and therefore dated back to Elizabethan times or earlier. Women were thus becoming both the authors of cookery books and their readers, though only about 42% of women in England were literate by 42 Markhams recipes are distinctively different from mediaeval ones; three quarters of his sauces for meat and meat pies make use of a combination of sweet and sour, and he advises:          ": null
    },
    {
        "Robert May": "robert may"
    },
    {
        "s  The Accomplisht Cook  was published in 42 when he was 42 years old.  The book included a substantial number of recipes for soups and stews,  42 recipes for ": null
    },
    {
        "sturgeon": "sturgeon"
    },
    {
        ", and a large number of pies variously containing fish , meat , and sweet fillings.     French influence is evident in ": null
    },
    {
        "Hannah Woolley": "hannah woolley"
    },
    {
        "s The Cooks Guide, 42 Her recipes are designed to enable her non-aristocratic readers to imitate the fashionable French style of cooking with elaborate sauces. She combined the use of ": null
    },
    {
        "Claret": "claret"
    },
    {
        " wine  and ": null
    },
    {
        "anchovies": "anchovy"
    },
    {
        " with more traditional cooking ingredients such as sugar, dried fruit, and vinegar.            ": null
    },
    {
        "John Nott": "john nott"
    },
    {
        "s  The Cooks and Confectioners Dictionary  , still with rather few precedents to go by, chose an alphabetical treatment for its recipes, from ": null
    },
    {
        "Al": "ale"
    },
    {
        " to ": null
    },
    {
        "Zest": "zest"
    },
    {
        ". The book covered everything from soups and salads to meat and fish, as well as pastries of many kinds, confectionery, and the making of beer, cider, and wine. Bills of fare are given for each month of the year.      ": null
    },
    {
        "James Woodforde": "james woodforde"
    },
    {
        "s  Diary of a Country Parson  gives a good idea of the sort of food eaten in England in the eighteenth century by those who could afford to eat whatever they liked. To welcome some neighbours on 42 June 42 he gave them for dinner:          Another country clergyman, ": null
    },
    {
        "Gilbert White": "gilbert white"
    },
    {
        ", in  The Natural History of Selborne  recorded the increased consumption of vegetables by ordinary country people in the south of England, to which, he noted, ": null
    },
    {
        "potato": "potato"
    },
    {
        "es, from the ": null
    },
    {
        "Americas": "americas"
    },
    {
        ", had only been added during the reign of ": null
    },
    {
        "King George III": "george iii of england"
    },
    {
        ":          ": null
    },
    {
        "Hannah Glasse": "hannah glasse"
    },
    {
        "s  The Art of Cookery made Plain and Easy  was the best-selling cookery book for a century from its publication in 42 It ran to at least 42 editions, and was widely pirated.             English cooking was systematized and made available to the middle classes by a series of popular books, their authors becoming household names. One of the first was ": null
    },
    {
        "Mrs Rundell": "maria eliza rundell"
    },
    {
        "s  A New System of Domestic Cookery , 42; it went through sixty-seven editions by 42 selling hundreds of thousands of copies in Britain and America.  This was followed by ": null
    },
    {
        "Eliza Acton": "eliza acton"
    },
    {
        "s  Modern Cookery for Private Families  42 which ": null
    },
    {
        "Bee Wilson": "bee wilson"
    },
    {
        " has called the greatest cookery book in our language , but modern only in a nineteenth-century sense.      An example recipe from Actons Modern Cookery for Private Families is her Quince Blanc-Mange :           Acton was supplanted by the most famous English cookery book of the Victorian era, ": null
    },
    {
        "Isabella Beeton": "isabella beeton"
    },
    {
        "s  Mrs Beetons Book of Household Management , 42 which sold nearly two million copies up to 42  Where Actons was a book to be read and enjoyed, Beetons, substantially written in later editions by other hands, was a manual of instructions and recipes, to be looked up as needed.  Mrs Beeton was substantially plagiarized from authors including ": null
    },
    {
        "Elizabeth Raffald": "elizabeth raffald"
    },
    {
        " and Acton.  The ": null
    },
    {
        "Anglo-Italian": "anglo-italian"
    },
    {
        " cook ": null
    },
    {
        "Charles Elmé Francatelli": "charles elmé francatelli"
    },
    {
        " became a celebrity, cooking for a series of aristocrats, London clubs, and royalty including ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        ". His 42 book  The Modern Cook  ran through 42 editions by 42 popularising an elaborate cuisine described throughout with French terminology, and offering bills of fare for up to 42 people.      Three of the major hot drinks popular in England, ": null
    },
    {
        "tea": "tea"
    },
    {
        ", ": null
    },
    {
        "coffee": "coffee"
    },
    {
        ", and ": null
    },
    {
        "chocolate": "chocolate"
    },
    {
        ", originated from outside Europe and were already staple items by Victorian times.   ": null
    },
    {
        "Catherine of Braganza": "catherine of braganza"
    },
    {
        " brought the Portuguese habit of ": null
    },
    {
        "tea": "tea"
    },
    {
        " to England around 42 Initially, its expense restricted it to wealthy consumers, but the price gradually dropped, until by the 42th century ": null
    },
    {
        "its use was widespread": "british tea culture"
    },
    {
        ".  Introduced in the 42th century, ": null
    },
    {
        "coffee": "coffee"
    },
    {
        " became popular by the 42th century, especially in the ": null
    },
    {
        "coffee house": "coffee house"
    },
    {
        "s, the first opening in Oxford in 42   ": null
    },
    {
        "Hot chocolate": "hot chocolate"
    },
    {
        " was a popular drink by the 42th century, long before it was used as a food. Chocolate bars were developed and marketed by three English ": null
    },
    {
        "Quaker": "quaker"
    },
    {
        "-founded businesses, ": null
    },
    {
        "Joseph Frys": "j. s. fry  &  sons"
    },
    {
        " , ": null
    },
    {
        "Rowntrees": "rowntrees"
    },
    {
        " ,  and ": null
    },
    {
        "Cadburys": "cadburys"
    },
    {
        " .          After the First World War, many new food products became available to the typical household, with branded foods advertised for their convenience. Kitchen servants with time to make custards and puddings were replaced with instant foods in jars, or powders that the housewife could quickly mix. ": null
    },
    {
        "American-style dry cereals": "breakfast cereal20th century"
    },
    {
        " began to challenge the porridge and bacon and eggs of the middle classes, and the bread and margarine of the poor. While wartime shipping shortages had sharply narrowed choice, the 42s saw many new kinds of fruit imported from around the world, along with better quality, packaging, and hygiene, aided by refrigerators  and ": null
    },
    {
        "refrigerated ships": "reefer ship"
    },
    {
        ". Authors in the 42s such as ": null
    },
    {
        "Lady Sysonby": "victoria ponsonby, baroness sysonby"
    },
    {
        " See  drew on recipes from a wide range of countries.           ": null
    },
    {
        "Rationing was introduced in 42": "rationing in the united kingdom"
    },
    {
        " to cope with the shortages caused by the wartime blockade. Foods such as bananas, onions and chocolate became hard to find, while unfamiliar items such as ": null
    },
    {
        "dried egg": "dried egg"
    },
    {
        ", ": null
    },
    {
        "dried potato": "instant mashed potatoes"
    },
    {
        ", ": null
    },
    {
        "whale meat": "whale meat"
    },
    {
        ", ": null
    },
    {
        "snook": "centropomus"
    },
    {
        " ,  and the tinned pork product ": null
    },
    {
        "Spam": "spam"
    },
    {
        " appeared in the national diet. Since butter, sugar, eggs and flour were all rationed, English dishes such as pies and cakes became hard to make from traditional recipes. Instead, foods such as carrots were used in many different dishes, their natural sugars providing sweetness in novel dishes like carrot ": null
    },
    {
        "fudge": "fudge"
    },
    {
        ". The diet was less than enjoyable, but paradoxically, rationing meant that the population was healthier than ever before, and perhaps ever since. The ": null
    },
    {
        "Ministry of Food": "ministry of food"
    },
    {
        " employed home economists such as ": null
    },
    {
        "Marguerite Patten": "marguerite patten"
    },
    {
        " to demonstrate how to cook economically. After the war, Patten became one of the first television cooks, and sold 42 million copies of her 42 books.           ": null
    },
    {
        "Elizabeth David": "elizabeth david"
    },
    {
        " profoundly changed English cooking with her 42  A Book of Mediterranean Food . Written at a time of scarcity, her book began with perhaps the most evocative and inspirational passage in the history of British cookery writing :          All five of Davids early books remained in print half a century later, and her reputation among cookery writers such as ": null
    },
    {
        "Nigel Slater": "nigel slater"
    },
    {
        " and ": null
    },
    {
        "Clarissa Dickson Wright": "clarissa dickson wright"
    },
    {
        " is of enormous influence. The historian of food ": null
    },
    {
        "Panikos Panayi": "panikos panayi"
    },
    {
        " suggests that this is because she consciously brought foreign cooking styles into the English kitchen; she did this with fine writing, and with practical experience of living and cooking in the countries she wrote about. She deliberately destroyed the myths of restaurant cuisine, instead describing the home cooking of Mediterranean countries. Her books paved the way for other cookery writers to use foreign recipes. Post-David ": null
    },
    {
        "celebrity chef": "celebrity chef"
    },
    {
        "s, often ephemeral, included ": null
    },
    {
        "Philip Harben": "philip harben"
    },
    {
        ", ": null
    },
    {
        "Fanny Cradock": "fanny cradock"
    },
    {
        ", ": null
    },
    {
        "Graham Kerr": "graham kerr"
    },
    {
        " , and ": null
    },
    {
        "Robert Carrier": "robert carrier"
    },
    {
        ".                In 42 Britains first celebrity chef, Philip Harben, published Traditional Dishes of Britain. Its chapter titles simply listed the ": null
    },
    {
        "stereotypical": "stereotype"
    },
    {
        " stalwarts of the British diet , from ": null
    },
    {
        "Cornish pasty": "cornish pasty"
    },
    {
        " and ": null
    },
    {
        "Yorkshire pudding": "yorkshire pudding"
    },
    {
        " to ": null
    },
    {
        "shortbread": "shortbread"
    },
    {
        ", ": null
    },
    {
        "Lancashire hotpot": "lancashire hotpot"
    },
    {
        ", ": null
    },
    {
        "steak and kidney pudding": "steak and kidney pudding"
    },
    {
        ", ": null
    },
    {
        "jellied eels": "jellied eels"
    },
    {
        ", ": null
    },
    {
        "clotted cream": "clotted cream"
    },
    {
        " and ": null
    },
    {
        "fish and chips": "fish and chips"
    },
    {
        " . Panayi noted that Harben began with contradictions and unsupported claims, naming Britains supposed reputation for the worst food in the world, but claiming that the countrys cooks were technically unmatched and that the repertoire of national dishes was the largest of any countrys.     The sociologist Bob Ashley observed that while people in Britain might agree that the core national diet consisted of items such as the full English breakfast, roast beef with all the trimmings, tea with scones, and fish and chips, few had ever eaten the canonical English breakfast, lunch and dinner in any single day, and many probably never ate any item from the list at all regularly. In any case, Ashley noted, the national diet changes with time, and cookery books routinely include dishes of foreign origin. He remarked that a ": null
    },
    {
        "National Trust": "national trust"
    },
    {
        " café, whose manager claimed Were not allowed to do foreign food  ... I cant do lasagne or anything like that , in fact served curry, because seemingly curry is English . Anglo-Indian cuisine has indeed been part of the national diet since the eighteenth century.      Many supposedly traditional English dishes are relatively new and can be dated to the century, and sometimes to the year, of their introduction. Thus ": null
    },
    {
        "piccalilli": "piccalilli"
    },
    {
        " was introduced from India in the 42th century, as recorded by ": null
    },
    {
        "Hannah Glasse": "hannah glasse"
    },
    {
        " who gave a recipe for it in 42 Conversely, dishes and sauces still considered foreign, such as fish in sweet and sour sauce, have been in English recipe books since the Middle Ages. Other dishes took their present form only gradually, as with the so-called ": null
    },
    {
        "Full English breakfast": "full breakfast"
    },
    {
        " . Breakfasts of this kind are indeed described in later editions of ": null
    },
    {
        "Mrs Beeton": "mrs beeton"
    },
    {
        " , but as one of many variations. Thus her list of Family Breakfasts for a Week in Winter has for Wednesday something that looks fairly modern: bread, muffins, butter, brawn, grilled bacon, boiled eggs ;  but on other days less modern-looking breakfasts include mince, mutton cutlets, grilled kidneys, baked fresh herrings, and hash of cold game or poultry, while suggestions for Family Breakfasts for a Week in Summer included sardine toast, cold tongue, kedgeree and rissoles, and Guests Breakfast included cold pheasant, game pie, and pressed beef.     Stereotypes of English cuisine ": null
    },
    {
        "Fish and chips": "fish and chips"
    },
    {
        ", from c. 42 ": null
    },
    {
        "Melton Mowbray pork pie": "melton mowbray pork pie"
    },
    {
        ", by 42s   ": null
    },
    {
        "sausage": "sausage"
    },
    {
        "s, from Roman times   and mashed ": null
    },
    {
        "potato": "potato"
    },
    {
        "  Piccalilli": "piccalilli"
    },
    {
        ", a ": null
    },
    {
        "pickle": "pickling"
    },
    {
        " derived from Indian cooking by 42   Robertson, Maxwell Alexander, English reports annotated, 42–42 Volume 42 Publisher: The Reports and Digest Syndicate, 42  ": null
    },
    {
        "sandwich": "sandwich"
    },
    {
        "es, by 42   ": null
    },
    {
        "Full English breakfast": "full breakfast"
    },
    {
        " with sausage, ": null
    },
    {
        "bacon": "bacon"
    },
    {
        ", tomatoes  and eggs   Devonshire tea.jpg|": null
    },
    {
        "Cream tea": "cream tea"
    },
    {
        ": ": null
    },
    {
        "tea": "tea"
    },
    {
        " ,  ": null
    },
    {
        "scones": "scones"
    },
    {
        " ,  ": null
    },
    {
        "clotted cream": "clotted cream"
    },
    {
        ", ": null
    },
    {
        "raspberry jam": "raspberry jam"
    },
    {
        "  Sunday roast": "sunday roast"
    },
    {
        ": ": null
    },
    {
        "roast beef": "roast beef"
    },
    {
        " ,  roast potatoes, vegetables and ": null
    },
    {
        "Yorkshire pudding": "yorkshire pudding"
    },
    {
        "  Steak and kidney pudding": "steak and kidney pudding"
    },
    {
        "  Pasty": "pasty"
    },
    {
        "  Dessert": "list of british desserts"
    },
    {
        ": ": null
    },
    {
        "Spotted dick": "spotted dick"
    },
    {
        "  with ": null
    },
    {
        "custard": "custard"
    },
    {
        "  Ice cream cone": "ice cream cone"
    },
    {
        "              English cookery has been open to foreign ingredients and influence from as early as the thirteenth century, and in the case of a few foods like sausages from Roman times. The Countess of Leicester, daughter of ": null
    },
    {
        "King John": "john of england"
    },
    {
        " purchased large amounts of ": null
    },
    {
        "cinnamon": "cinnamon"
    },
    {
        ", while ": null
    },
    {
        "King Edward I": "edward i of england"
    },
    {
        " ordered large quantities of spices such as pepper and ": null
    },
    {
        "ginger": "ginger"
    },
    {
        ", as well as of what was then an expensive imported luxury, sugar. Dickson Wright refutes the popular idea that spices were used to disguise bad meat, pointing out that this would have been as fatal then as it would be today. She suggests instead that spices were used to hide the taste of salt, which was used to preserve food in the absence of refrigeration.     The English ": null
    },
    {
        "celebrity cook": "celebrity cook"
    },
    {
        " Fanny Cradock": "fanny cradock"
    },
    {
        " asserted: The English have never had a cuisine. Even ": null
    },
    {
        "Yorkshire pudding": "yorkshire pudding"
    },
    {
        " comes from ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        ".  Nicola Humble observed that in  Mrs Beetons Book of Household Management , there are about the same number of recipes from India as from Wales, Scotland and Ireland together.   Panayi created controversy by asserting, with evidence, that ": null
    },
    {
        "fish and chips": "fish and chips"
    },
    {
        " had foreign origins: the fried fish from Jewish cooking, the potato chips from France; the dish only came to signify national identity from about 42 French cuisine powerfully influenced English cooking throughout the nineteenth century, and French celebrity chefs such as the Roux brothers and Raymond Blanc continue to do so in twenty-first-century England.             ": null
    },
    {
        "Curry": "curry"
    },
    {
        " was created by the arrival of the British in India in the seventeenth century, beginning as bowls of spicy sauce used, Lizzie Collingham writes, to add bite to the rather bland flavours of boiled and roasted meats.  The 42 edition of ": null
    },
    {
        "Hannah Glasse": "hannah glasse"
    },
    {
        "s  The Art of Cookery  contains what ": null
    },
    {
        "Clarissa Dickson Wright": "clarissa dickson wright"
    },
    {
        " calls a famous recipe  which describes how To make a currey the Indian way ; it flavours chicken with onions fried in butter, the chicken being fried with ": null
    },
    {
        "turmeric": "turmeric"
    },
    {
        ", ginger and ground pepper, and stewed in its own stock with cream and lemon juice. Dickson Wright comments that she was a bit sceptical  of this recipe, as it had few of the expected ": null
    },
    {
        "spice": "spice"
    },
    {
        "s, but was pleasantly surprised by the end result  which had a very good and interesting flavour .     The process of adapting Indian cooking continued for centuries. Anglo-Indian recipes could completely ignore Indian rules of diet, such as by using pork or beef. Some dishes, such as liver curry, with bacon were simply ordinary recipes spiced up with ingredients such as curry powder. In other cases like ": null
    },
    {
        "kedgeree": "kedgeree"
    },
    {
        ", Indian dishes were adapted to British tastes;  khichari  was originally a simple dish of lentils and rice. Curry was accepted in almost all ": null
    },
    {
        "Victorian era": "victorian era"
    },
    {
        " cookery books, such as ": null
    },
    {
        "Eliza Acton": "eliza acton"
    },
    {
        "s  Modern Cookery for Private Families  : she offered recipes for curried ": null
    },
    {
        "sweetbreads": "sweetbreads"
    },
    {
        " and curried ": null
    },
    {
        "macaroni": "macaroni"
    },
    {
        ", merging Indian and European foods into standard English cooking. By 42 curry was included in Dainty Dishes for Slender Incomes, aimed at the poorer classes.     Foreign influence was by no means limited to specific dishes. James Walvin, in his book Fruits of Empire, argues that ": null
    },
    {
        "potato": "potato"
    },
    {
        "es, ": null
    },
    {
        "sugar": "sugar"
    },
    {
        " , ": null
    },
    {
        "tea": "tea"
    },
    {
        ", and ": null
    },
    {
        "coffee": "coffee"
    },
    {
        " as well as increasing quantities of spices were Fruits of ": null
    },
    {
        "Empire": "british empire"
    },
    {
        " that became established in Britain between 42 and 42 so that by the nineteenth century their exotic origins had been lost in the mists of time and had become part of the unquestioned fabric of local life .                 During the ": null
    },
    {
        "British Raj": "british raj"
    },
    {
        ", Britain first started borrowing Indian dishes, creating ": null
    },
    {
        "Anglo-Indian cuisine": "anglo-indian cuisine"
    },
    {
        ", with dishes such as ": null
    },
    {
        "Kedgeree": "kedgeree"
    },
    {
        "  and ": null
    },
    {
        "Mulligatawny soup": "mulligatawny soup"
    },
    {
        " .   Indian food was served in coffee houses from 42  and cooked at home from a similar date as cookbooks of the time attest. The ": null
    },
    {
        "Veeraswamy": "veeraswamy"
    },
    {
        " restaurant in ": null
    },
    {
        "Regent Street": "regent street"
    },
    {
        ", London, was opened in 42 at first serving Anglo-Indian food, and is the oldest surviving Indian restaurant in Britain.  There was a sharp increase in the number of curry houses in the 42s, and again in the 42s.           The post-colonial Anglo-Indian dish ": null
    },
    {
        "chicken tikka masala": "chicken tikka masala"
    },
    {
        " was apparently invented in ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        " in the early 42s,  while ": null
    },
    {
        "balti cuisine": "balti"
    },
    {
        " was introduced to Britain in 42 in ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        ".   In 42 there were roughly 42 restaurants serving Indian cuisine in Britain. The majority of Indian restaurants in Britain are run by entrepreneurs of Bangladeshi  and Pakistani origin.  According to ": null
    },
    {
        "Britains": "united kingdom"
    },
    {
        " Food Standards Agency": "food standards agency"
    },
    {
        ", the Indian food industry in the United Kingdom was worth £42 billion in 42 accounting for two-thirds of all eating out, and serving about 42 million British customers every week.  Indian restaurants typically allow the diner to combine base ingredients — chicken, prawns or meat — with curry sauces — from the mild ": null
    },
    {
        "korma": "korma"
    },
    {
        " to the scorching ": null
    },
    {
        "phall": "phall"
    },
    {
        " — without regard to the authenticity of the combination. The reference point for flavour and spice heat is the ": null
    },
    {
        "Madras curry": "madras curry"
    },
    {
        " sauce . Other sauces are sometimes variations on a basic curry sauce: Every restaurant has a large pan of this sauce always at hand, with the recipe varying only slightly from Chef to Chef. It forms the base of all Restaurant curries from the very mild to the very hot and spicy. Khris Dillon The Curry Secret  for instance, ": null
    },
    {
        "vindaloo": "vindaloo"
    },
    {
        " is often rendered as a fiery dish of lamb or chicken  in a Madras sauce with extra ": null
    },
    {
        "chilli": "chili powder"
    },
    {
        ", rather than the Anglo-Indian dish of ": null
    },
    {
        "pork": "pork"
    },
    {
        " marinated in ": null
    },
    {
        "wine vinegar": "wine vinegar"
    },
    {
        " and ": null
    },
    {
        "garlic": "garlic"
    },
    {
        ", based on a Goan ": null
    },
    {
        "Portuguese": "portuguese language"
    },
    {
        " dish  carne de vinha dalhos .       Indian restaurants and their cuisine in Britain gradually improved from the stereotypical flock wallpaper and standardised menus. One of the pioneers was the ": null
    },
    {
        "Bombay Brasserie": "bombay brasserie"
    },
    {
        ", which opened in Gloucester Road, London, in 42 serving the kind of food actually eaten in India. It was followed in 42 by ": null
    },
    {
        "Chutney Mary": "chutney mary"
    },
    {
        " in Chelsea. In 42 two Indian restaurants in London, ": null
    },
    {
        "Tamarind": "tamarind"
    },
    {
        " and ": null
    },
    {
        "Zaika": "zaika"
    },
    {
        " gained ": null
    },
    {
        "Michelin star": "michelin star"
    },
    {
        "s for the quality of their cooking.      ": null
    },
    {
        "Indian cuisine": "indian cuisine"
    },
    {
        " is the most popular alternative to traditional cooking in Britain, followed by ": null
    },
    {
        "Chinese": "chinese cuisine"
    },
    {
        " and ": null
    },
    {
        "Italian": "italian cuisine"
    },
    {
        " food.   By 42 chicken tikka masala was one of Britains most popular dishes.              ": null
    },
    {
        "Chinese food": "chinese cuisine"
    },
    {
        " became established in England by the 42s, with large cities often having a Chinatown district; the first, in Londons Soho, developed between the two world wars. Deriving from ": null
    },
    {
        "Cantonese cuisine": "cantonese cuisine"
    },
    {
        ",  the food served by Chinese restaurants, named Chinese Food Abroad  by ": null
    },
    {
        "Kenneth Lo": "kenneth lo"
    },
    {
        ", has been adapted to suit western taste. From around 42 other ": null
    },
    {
        "South-East Asian cuisines": "asian cuisinesoutheast asia"
    },
    {
        ", especially ": null
    },
    {
        "Thai": "thai cuisine"
    },
    {
        ", began to join the established Asian cuisines of China and the Indian subcontinent.     ": null
    },
    {
        "Italian cuisine": "italian cuisine"
    },
    {
        " is the most popular ": null
    },
    {
        "Mediterranean cuisine": "mediterranean cuisine"
    },
    {
        " in England. In its current form, with plenty of pizza and pasta, inspired by Elizabeth David, its rise began after 42 There were some Italian restaurants before World War II, but they mostly served a generalised haute cuisine. Soon after the war, Italian coffee bars appeared, the first places to trade on their Italianness; they soon started to sell simple and cheap Italian food such as minestrone soup, spaghetti bolognese and pizza. From the early 42s, the slightly more elegant trattoria restaurants offered Italian specialities such as lasagne verde al forno . Other Mediterranean influences include ": null
    },
    {
        "Greek": "greek cuisine"
    },
    {
        " moussaka": "moussaka"
    },
    {
        ", ": null
    },
    {
        "feta": "feta"
    },
    {
        " and ": null
    },
    {
        "taramasalata": "taramasalata"
    },
    {
        ", ": null
    },
    {
        "Turkish": "turkish cuisine"
    },
    {
        " doner": "doner kebab"
    },
    {
        " and ": null
    },
    {
        "shish": "shish kebab"
    },
    {
        " kebabs, and ": null
    },
    {
        "Middle Eastern": "middle eastern cuisine"
    },
    {
        " hummus": "hummus"
    },
    {
        ".      ": null
    },
    {
        "French cuisine": "french cuisine"
    },
    {
        " is largely restricted to expensive restaurants, although there are some inexpensive French bistros.    English writers were historically ambivalent about French cooking. In the 42th century ": null
    },
    {
        "Hannah Glasse": "hannah glasse"
    },
    {
        " was scornful of the elaborate and extravagant French recipes of the period - If gentlemen will have French cooks, she writes, they must pay for French tricks. However, many of her recipes will have been influenced by French cuisine which was becoming increasingly fashionable at the time. Her deliberate hostility towards the French was probably intended to please English readers of a lower social status, who would have disapproved of the excessiveness and conspicuous consumption of French culture.  A century later, Andrew Valentine Kirwan wrote: The main object of the author has been to induce well informed and sensible people in England to adopt all that is good in the excellent cookery, and agreeable and social life of our neighbours of France, without in any wise abandoning the best of our British customs, or the simplicity of our substantial food. Host and Guest, A book about dinners, dinner-giving, wines and desserts, Kirwan, 42 However, restaurants serving French ": null
    },
    {
        "haute cuisine": "haute cuisine"
    },
    {
        " developed for the upper and middle classes in England from the 42s Haute Cuisine: How the French Invented the Culinary Profession , Amy B. Trubek, 42 and ": null
    },
    {
        "Escoffier": "auguste escoffierescoffier, césar ritz and the savoy"
    },
    {
        " was recruited by the ": null
    },
    {
        "Savoy Hotel": "savoy hotel"
    },
    {
        " in 42 ": null
    },
    {
        "Marcel Boulestin": "marcel boulestin"
    },
    {
        "s 42 Simple French Cooking for English Homes did much to popularise French dishes.                 The English cafe is a small, inexpensive eating place. A working mens cafe serves mainly fried or grilled food, such as ": null
    },
    {
        "fried eggs": "egg"
    },
    {
        ", ": null
    },
    {
        "bacon": "bacon"
    },
    {
        ", ": null
    },
    {
        "bangers and mash": "bangers and mash"
    },
    {
        "‚ ": null
    },
    {
        "black pudding": "black pudding"
    },
    {
        ", ": null
    },
    {
        "bubble and squeak": "bubble and squeak"
    },
    {
        ", ": null
    },
    {
        "burgers": "hamburger"
    },
    {
        ", ": null
    },
    {
        "sausage": "sausage"
    },
    {
        "s, ": null
    },
    {
        "mushrooms": "edible mushroom"
    },
    {
        " and ": null
    },
    {
        "chips": "french fries"
    },
    {
        ". These may be accompanied by ": null
    },
    {
        "baked beans": "baked beans"
    },
    {
        ", cooked ": null
    },
    {
        "tomato": "tomato"
    },
    {
        "es, and ": null
    },
    {
        "fried bread": "fried bread"
    },
    {
        ". These are referred to as breakfast even if they are available all day.  Traditional cafes have declined with the rise of ": null
    },
    {
        "fast-food": "fast food"
    },
    {
        " chains, but remain numerous all over the UK.      A ": null
    },
    {
        "tea shop": "tea in the united kingdomtearoom"
    },
    {
        " is a small restaurant that serves soft drinks and light meals, often in a sedate atmosphere. Customers may eat a ": null
    },
    {
        "cream tea": "cream tea"
    },
    {
        " in Cornish or Devonshire style,  served from a ": null
    },
    {
        "china": "porcelain"
    },
    {
        " set, and a ": null
    },
    {
        "scone": "scone"
    },
    {
        " with ": null
    },
    {
        "jam": "jam"
    },
    {
        " and ": null
    },
    {
        "clotted cream": "clotted cream"
    },
    {
        ".        ": null
    },
    {
        "Fish and chips": "fish and chips"
    },
    {
        " is a hot dish consisting of ": null
    },
    {
        "battered": "batter"
    },
    {
        " fish, commonly ": null
    },
    {
        "Atlantic cod": "atlantic cod"
    },
    {
        " or ": null
    },
    {
        "haddock": "haddock"
    },
    {
        ", and ": null
    },
    {
        "chips": "french fries"
    },
    {
        ". It is a common ": null
    },
    {
        "take-away food": "take-away food"
    },
    {
        ".      ": null
    },
    {
        "Western Sephardic Jews": "western sephardim"
    },
    {
        " settling in England from the 42th century would have prepared fried fish like  pescado frito , coated in ": null
    },
    {
        "flour": "flour"
    },
    {
        " and fried in oil.  Chips appeared in the Victorian era; ": null
    },
    {
        "Dickens": "charles dickens"
    },
    {
        "s 42  A Tale of Two Cities  mentions husky chips of potatoes, fried with some reluctant drops of oil .   Fish and chip shops in the 42s were often run by Jews or Italians. Despite this, the new dish was popularly attributed to France;  The Times  recorded that potatoes chipped and fried in the French manner were introduced in Lancashire with great success about 42  The Fish Trades Gazette of 42 July 42 stated that Later there was introduced into this country the frying and purveying of chip potatoes from France  ... which had made the fried fish trade what it is today.             The public house, or ": null
    },
    {
        "pub": "pub"
    },
    {
        ", is a famous English institution. In the mid42th century, pubs were drinking establishments with little emphasis on the serving of food, other than ": null
    },
    {
        "bar snacks": "snack food"
    },
    {
        " , such as ": null
    },
    {
        "pork scratchings": "pork scratchings"
    },
    {
        ",  ": null
    },
    {
        "pickled egg": "pickled egg"
    },
    {
        "s, salted ": null
    },
    {
        "crisps": "potato chips"
    },
    {
        ", and ": null
    },
    {
        "peanut": "peanut"
    },
    {
        "s, which helped to increase beer sales. If a pub served meals these were usually basic cold dishes such as a ": null
    },
    {
        "ploughmans lunch": "ploughmans lunch"
    },
    {
        ", invented in the 42s.       In the 42s some British pubs started to offer a pie and a pint , with hot individual ": null
    },
    {
        "steak and ale pie": "steak and ale pie"
    },
    {
        "s made easily on the premises by the landlord or his wife. In the 42s this was developed into the then-fashionable chicken in a basket , a portion of roast chicken with chips, served on a napkin, in a wicker basket, by the Mill pub at ": null
    },
    {
        "Withington": "withington, gloucestershire"
    },
    {
        ".  Quality dropped but variety increased with the introduction of ": null
    },
    {
        "microwave oven": "microwave oven"
    },
    {
        "s and ": null
    },
    {
        "freezer": "freezer"
    },
    {
        " food. Pub grub expanded to include British food items such as ": null
    },
    {
        "steak and kidney pudding": "steak and kidney pudding"
    },
    {
        ", ": null
    },
    {
        "shepherds pie": "shepherds pie"
    },
    {
        ", ": null
    },
    {
        "fish and chips": "fish and chips"
    },
    {
        ", ": null
    },
    {
        "bangers and mash": "bangers and mash"
    },
    {
        ", ": null
    },
    {
        "Sunday roast": "sunday roast"
    },
    {
        ", and ": null
    },
    {
        "pasties": "pasty"
    },
    {
        ".   The ": null
    },
    {
        "gastropub": "gastropub"
    },
    {
        " movement of the 42st century, on the other hand, seeks to serve restaurant-quality food, cooked to order from fresh ingredients, in a pub setting.  In 42 pubs were serving 42% of meals eaten outside the home; this rose rapidly to 42% by 42 MINTEL survey, cited by Panayi 42 pages 42 42         Modern Western ": null
    },
    {
        "vegetarianism": "vegetarianism"
    },
    {
        " was founded in the United Kingdom in 42 with the worlds first ": null
    },
    {
        "Vegetarian Society": "vegetarian society"
    },
    {
        ".  It has increased markedly since the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", when there were around 42 vegetarians in the country. By 42 there were between 42 and 42 million vegetarians in the UK,  one of the highest percentages in the Western world, while around 42 million people claim to eat no ": null
    },
    {
        "red meat": "red meat"
    },
    {
        ".  By 42 42 of 42 restaurant chains studied by the ": null
    },
    {
        "Vegan Society": "vegan society"
    },
    {
        " had at least one vegan main course on their menu, though only 42 of these explicitly labelled them as vegan dishes.  Top-end vegetarian restaurants remain relatively few, though they are increasing rapidly: there were some 42 in Britain in 42 rising to 42 in 42             English cuisine in the twentieth century suffered from a poor international reputation. Keith Arscott of Chawton House Library comments that at one time people didnt think the English knew how to cook and yet these female writers were at the forefront of modern day cooking.  English food was popularly supposed to be bland, but English cuisine has made extensive use of spices since the Middle Ages; introduced curry to Europe; and makes use of strong flavourings such as English mustard. It was similarly reputed to be dull, like roast beef: but that dish was highly prized both in Britain and abroad, and few people could afford it; the Roast Beef of Old England lauded by ": null
    },
    {
        "William Hogarth": "william hogarth"
    },
    {
        " in his 42 painting celebrated the high quality of English cattle, which the French at the Gate of ": null
    },
    {
        "Calais": "calais"
    },
    {
        " could only look at with envy. The years of wartime shortages and rationing certainly did impair the variety and flavour of English food during the twentieth century, but the nations cooking recovered from this with increasing prosperity and the availability of new ingredients from soon after the Second World War.           In 42 42 food critics writing for the British  Restaurant  magazine named 42 British restaurants among the 42 best restaurants in the world, the number one being ": null
    },
    {
        "The Fat Duck": "the fat duck"
    },
    {
        " in ": null
    },
    {
        "Bray, Berkshire": "bray, berkshire"
    },
    {
        ", led by its chef ": null
    },
    {
        "Heston Blumenthal": "heston blumenthal"
    },
    {
        ". The global reach of ": null
    },
    {
        "London": "london"
    },
    {
        " has elevated it to the status of a leading centre of international cuisine.      Meanwhile, the ": null
    },
    {
        "list of United Kingdom food and drink products with protected status": "list of united kingdom food and drink products with protected status"
    },
    {
        " under ": null
    },
    {
        "European Union law": "law of the european union"
    },
    {
        " has increased rapidly, with 42 items including ": null
    },
    {
        "Cornish sardine": "cornish sardine"
    },
    {
        "s, Yorkshire ": null
    },
    {
        "Wensleydale cheese": "wensleydale cheese"
    },
    {
        " and Yorkshire forced ": null
    },
    {
        "rhubarb": "rhubarb"
    },
    {
        ", Fenland celery, West Country lamb and beef and traditional ": null
    },
    {
        "Cumberland sausage": "cumberland sausage"
    },
    {
        " listed as registered in 42 and a further 42 including Birmingham ": null
    },
    {
        "Balti": "balti"
    },
    {
        " listed as applied for.  By 42 there were 42 ": null
    },
    {
        "cheeses from England": "list of english cheeses"
    },
    {
        " with PDO status. ": null
    }
]