[
    {
        "In the card game ": null
    },
    {
        "contract bridge": "contract bridge"
    },
    {
        ", an entry-shifting squeeze is a mixture between a material squeeze and an immaterial squeeze. The material part is the same as in a trump squeeze or a ": null
    },
    {
        "squeeze": "squeeze play"
    },
    {
        " without the count. The immaterial part is that depending on the choice of discards of the squeezee an entry into one or into the other hand is created. For that very reason an entry-shifting squeeze is always a positional squeeze.          In the first ": null
    },
    {
        "diagram": "contract bridge diagram"
    },
    {
        " clubs are trumps and South could claim all tricks on a ": null
    },
    {
        "crossruff": "crossruff"
    },
    {
        " were it not for the trump in Easts hand. When the club jack is played, the entry-shifting squeeze comes to his rescue.   If West sheds a heart, the jack is overtaken with the ace, a heart ruffed and North is left with the last trump and a master heart. If West chooses to discard a diamond, the club jack is underplayed with the five. Norths club ace ruffs the diamonds good and the South hand wins the last two tricks.     The entry-shifting mechanism works also in No Trumps, as can be seen in the next example.        As only five tricks out of remaining six cards are required, this is a squeeze without the count. It is not possible to rectify the count as there are not enough communications between the two hands. The entry-shifting mechanism will overcome this though.   South leads the A and West has no good discard. If he discards a spade, the J is played and South continues with a spade to the ace and the spade eight. West returns a heart to Souths ace, but the diamond king serves as an entry to the established spades. If West chooses to discard a heart, the diamond king is played and after ace of hearts and another heart, the Q will serve as an entry.                ": null
    }
]