[
    {
        "           In the United States today, the organized ": null
    },
    {
        "environmental movement": "Environmental Movement"
    },
    {
        " is represented by a wide range of organizations sometimes called ": null
    },
    {
        "non-governmental organizations": "Non-Governmental Organization"
    },
    {
        "or NGOs. These organizations exist on local, national, and international scales. Environmental NGOs vary widely in political views and in the amount they seek to influence the ": null
    },
    {
        "environmental policy of the United States": "Environmental Policy Of The United States"
    },
    {
        " and other governments. The environmental movement today consists of both large national groups and also many smaller local groups with local concerns. Some resemble the old U.S. conservation movement - whose modern expression is The Nature Conservancy, Audubon Society and National Geographic Society - American organizations with a worldwide influence.       The early ": null
    },
    {
        "Conservation movement": "Conservation Movement"
    },
    {
        ", which began in the late 19th century, included fisheries and ": null
    },
    {
        "wildlife management": "Wildlife Management"
    },
    {
        ", water, soil conservation and ": null
    },
    {
        "sustainable forestry": "Sustainable Forestry"
    },
    {
        ". Today it includes sustainable yield of natural resources, preservation of wilderness areas and ": null
    },
    {
        "biodiversity": "Biodiversity"
    },
    {
        ".   The modern Environmental movement, which began in the 1960s with concern about air and water pollution, became broader in scope to including all landscapes and human activities. See ": null
    },
    {
        "List of environmental issues": "List Of Environmental Issues"
    },
    {
        ".   Environmental health movement dating at least to ": null
    },
    {
        "Progressive Era": "Progressive Era"
    },
    {
        " urban reforms including clean water supply, more efficient removal of raw sewage and reduction in crowded and unsanitary living conditions. Today Environmental health is more related to nutrition, preventive medicine, aging well and other concerns specific to the human bodys well-being.   ": null
    },
    {
        "Sustainability movement": "Sustainable Living"
    },
    {
        " which started in the 1980s focused on ": null
    },
    {
        "Gaia theory": "Gaia Theory"
    },
    {
        ", ": null
    },
    {
        "value of Earth": "Value Of Earth"
    },
    {
        " and other interrelations between human sciences and human responsibilities. Its spinoff ": null
    },
    {
        "deep ecology": "Deep Ecology"
    },
    {
        " was more spiritual but often claimed to be science.   ": null
    },
    {
        "Environmental justice": "Environmental Justice"
    },
    {
        " is a movement that began in the U.S. in the 1980s and seeks an end to ": null
    },
    {
        "environmental racism": "Environmental Racism"
    },
    {
        ". Often, low-income and minority communities are located close to highways, garbage dumps, and factories, where they are exposed to greater pollution and environmental health risk than the rest of the population. The Environmental Justice movement seeks to link social and ecological environmental concerns, while at the same time keeping environmentalists conscious of the dynamics in their own movement, i.e. racism, sexism, homophobia, classicism, and other malaises of dominant culture.     As public awareness and the environmental sciences have improved in recent years, environmental issues have broadened to include key concepts such as ": null
    },
    {
        "sustainability": "Sustainability"
    },
    {
        " and also new emerging concerns such as ": null
    },
    {
        "ozone depletion": "Ozone Depletion"
    },
    {
        ", ": null
    },
    {
        "global warming": "Global Warming"
    },
    {
        ", ": null
    },
    {
        "acid rain": "Acid Rain"
    },
    {
        ", ": null
    },
    {
        "land use": "Land Use"
    },
    {
        " and biogenetic pollution.     Environmental movements often interact or are linked with other social movements, e.g. for peace, human rights, and ": null
    },
    {
        "animal rights": "Animal Rights"
    },
    {
        "; and ": null
    },
    {
        "against nuclear weapons and/or nuclear power": "Anti-Nuclear Movement In The United States"
    },
    {
        ", endemic diseases, poverty, hunger, etc.     Some US colleges are now going green by signing the Presidents Climate Commitment, a document that a college President can sign to enable said colleges to practice environmentalism by switching to solar power, etc.             Early European settlers came to the United States brought from Europe the concept of the ": null
    },
    {
        "commons": "Commons"
    },
    {
        ". In the colonial era, access to natural resources was allocated by individual towns, and disputes over fisheries or land use were resolved at the local level. Changing technologies, however, strained traditional ways of resolving disputes of resource use, and local governments had limited control over powerful special interests. For example, the damming of rivers for mills cut off upriver towns from fisheries; logging and clearing of forest in watersheds harmed local fisheries downstream. In New England, many farmers became uneasy as they noticed clearing of forest changed stream flows and a decrease in bird population which helped control insects and other pests. These concerns become widely known with the publication of ": null
    },
    {
        "Man and Nature": "Man And Nature"
    },
    {
        " by ": null
    },
    {
        "George Perkins Marsh": "George Perkins Marsh"
    },
    {
        ". The environmental impact method of analysis is generally the main mode for determining what issues the environmental movement is involved in. This model is used to determine how to proceed in situations that are detrimental to the environment by choosing the way that is least damaging and has the fewest lasting implications.        Conservation first became a national issue during the ": null
    },
    {
        "progressive eras": "Progressive Era"
    },
    {
        " conservation movement": "Conservation Movement"
    },
    {
        " . The early national conservation movement shifted emphasis to scientific management which favored larger enterprises and control began to shift from local governments to the states and the federal government. Some writers credit sportsmen, hunters and fishermen with the increasing influence of the conservation movement. In the 1870s sportsman magazines such as American Sportsmen, Forest and Stream, and ": null
    },
    {
        "Field and Stream": "Field And Stream"
    },
    {
        " are seen as leading to the growth of the conservation movement. This conservation movement also urged the establishment of state and national parks and forests, wildlife refuges, and national monuments intended to preserve noteworthy natural features.   Conservation groups focus primarily on an issue thats origins are routed in general expansion. As ": null
    },
    {
        "Industrialization": "Industrialization"
    },
    {
        " became more prominent as well as the increasing trend towards ": null
    },
    {
        "Urbanization": "Urbanization"
    },
    {
        " the conservative environmental movement began. Contrary to popular belief conservation groups are not against expansion in general, instead they are concerned with efficiency with resources and land development.          ": null
    },
    {
        "Theodore Roosevelt": "Theodore Roosevelt"
    },
    {
        " and his close ally ": null
    },
    {
        "George Bird Grinnell": "George Bird Grinnell"
    },
    {
        ", were motivated by the wanton waste that was taking place at the hand of market hunting. This practice resulted in placing a large number of North American game species on the edge of extinction. Roosevelt recognized that the laissez-faire approach of the U.S. Government was too wasteful and inefficient. In any case, they noted, most of the natural resources in the western states were already owned by the federal government. The best course of action, they argued, was a long-term plan devised by national experts to maximize the long-term economic benefits of natural resources. To accomplish the mission, Roosevelt and Grinnell formed the ": null
    },
    {
        "Boone and Crockett Club": "Boone And Crockett Club"
    },
    {
        " in 1887. The Club was made up of the best minds and influential men of the day. The ": null
    },
    {
        "Boone and Crockett Clubs": "Boone And Crockett Club"
    },
    {
        "contingency of conservationists, scientists, politicians, and intellectuals became Roosevelts closest advisers during his march to preserve wildlife and habitat across North America.  As president, ": null
    },
    {
        "Theodore Roosevelt": "Theodore Roosevelt"
    },
    {
        " became a prominent ": null
    },
    {
        "conservationist": "Conservation Movement"
    },
    {
        ", putting the issue high on the national agenda. Douglas Brinkley, The Wilderness Warrior: Theodore Roosevelt and the Crusade for America ch 15-26 He worked with all the major figures of the movement, especially his chief advisor on the matter, ": null
    },
    {
        "Gifford Pinchot": "Gifford Pinchot"
    },
    {
        ". Roosevelt was deeply committed to conserving natural resources, and is considered to be the nations first ": null
    },
    {
        "conservation": "Conservation Biology"
    },
    {
        " President. He encouraged the ": null
    },
    {
        "Newlands Reclamation Act": "Newlands Reclamation Act"
    },
    {
        " of 1902 to promote federal construction of dams to irrigate small farms and placed 230 million acres under federal protection. Roosevelt set aside more Federal land for ": null
    },
    {
        "national parks": "National Park"
    },
    {
        "and ": null
    },
    {
        "nature preserves": "Nature Preserve"
    },
    {
        "than all of his predecessors combined. W. Todd Benson, President Theodore Roosevelts Conservations Legacy     Roosevelt established the ": null
    },
    {
        "United States Forest Service": "United States Forest Service"
    },
    {
        ", signed into law the creation of five ": null
    },
    {
        "National Parks": "National Parks"
    },
    {
        ", and signed the 1906 ": null
    },
    {
        "Antiquities Act": "Antiquities Act"
    },
    {
        ", under which he proclaimed 18 new ": null
    },
    {
        "U.S. National Monument": "U.S. National Monument"
    },
    {
        "s. He also established the first 51 ": null
    },
    {
        "Bird Reserve": "Bird Reserve"
    },
    {
        "s, four ": null
    },
    {
        "Game Preserve": "Game Preserve"
    },
    {
        "s, and 150 ": null
    },
    {
        "National Forests": "United States National Forest"
    },
    {
        ", including ": null
    },
    {
        "Shoshone National Forest": "Shoshone National Forest"
    },
    {
        ", the nations first. The area of the United States that he placed under public protection totals approximately .     ": null
    },
    {
        "Gifford Pinchot": "Gifford Pinchot"
    },
    {
        " had been appointed by McKinley as chief of Division of Forestry in the Department of Agriculture. In 1905, his department gained control of the national forest reserves. Pinchot promoted private use under federal supervision. In 1907, Roosevelt designated 16 million acres of new national forests just minutes before a deadline.     In May 1908, Roosevelt sponsored the ": null
    },
    {
        "Conference of Governors": "Conference Of Governors"
    },
    {
        " held in the White House, with a focus on natural resources and their most efficient use. Roosevelt delivered the opening address: Conservation as a National Duty.     In 1903 Roosevelt toured the Yosemite Valley with ": null
    },
    {
        "John Muir": "John Muir"
    },
    {
        ", who had a very different view of conservation, and tried to minimize commercial use of water resources and forests. Working through the ": null
    },
    {
        "Sierra Club": "Sierra Club"
    },
    {
        " he founded, Muir succeeded in 1905 in having Congress transfer the ": null
    },
    {
        "Mariposa Grove": "Mariposa Grove"
    },
    {
        " and Yosemite Valley to the ": null
    },
    {
        "National Park Service": "National Park Service"
    },
    {
        ". While Muir wanted nature preserved for the sake of pure beauty, Roosevelt subscribed to Pinchots formulation, to make the forest produce the largest amount of whatever crop or service will be most useful, and keep on producing it for generation after generation of men and trees. Gifford Pinchot, Breaking New Ground, p. 32. Muir and the Sierra Club vehemently opposed the damming of the ": null
    },
    {
        "Hetch Hetchy Valley": "Hetch Hetchy Valley"
    },
    {
        " in Yosemite in order to provide water to the city of San Francisco. Roosevelt and Pinchot supported the dam, as did President ": null
    },
    {
        "Woodrow Wilson": "Woodrow Wilson"
    },
    {
        ". The ": null
    },
    {
        "Hetch Hetchy": "Hetch Hetchy"
    },
    {
        " dam was finished in 1923 and is still in operation, but the Sierra Club still wants to tear it down. Robert W. Righter, The Battle over Hetch Hetchy: Americas Most Controversial Dam and the Birth of Modern Environmentalism     Other influential conservationists of the ": null
    },
    {
        "Progressive Era": "Progressive Era"
    },
    {
        " included ": null
    },
    {
        "George Bird Grinnell": "George Bird Grinnell"
    },
    {
        " , the ": null
    },
    {
        "Izaak Walton League": "Izaak Walton League"
    },
    {
        " and ": null
    },
    {
        "John Muir": "John Muir"
    },
    {
        ", the founder of the ": null
    },
    {
        "Sierra Club": "Sierra Club"
    },
    {
        " in 1892. Conservationists organized the ": null
    },
    {
        "National Parks Conservation Association": "National Parks Conservation Association"
    },
    {
        ", the ": null
    },
    {
        "Audubon Society": "Audubon Society"
    },
    {
        ", and other groups that still remain active.       ": null
    },
    {
        "Franklin Delano Roosevelt": "Franklin Delano Roosevelt"
    },
    {
        " , like his cousin Theodore Roosevelt, was an ardent conservationist. He used numerous programs of the departments of Agriculture and Interior T.H. Watkins, Righteous Pilgrim: The Life and Times of Harold L. Ickes, 1874-1952 to end wasteful land-use, mitigate the effects of the ": null
    },
    {
        "Dust Bowl": "Dust Bowl"
    },
    {
        ", and efficiently develop natural resources in the West. David B. Woolner and Henry L. Henderson, eds. FDR and the Environment One of the most popular of all ": null
    },
    {
        "New Deal": "New Deal"
    },
    {
        " programs was the ": null
    },
    {
        "Civilian Conservation Corps": "Civilian Conservation Corps"
    },
    {
        " , which sent two million poor young men to work in rural and wilderness areas, primarily on conservation projects. Neil M. Maher, Natures New Deal: The Civilian Conservation Corps and the Roots of the American Environmental Movement       After World War II increasing encroachment on wilderness land evoked the continued resistance of conservationists, who succeeded in blocking a number of projects in the 1950s and 1960s, including the proposed ": null
    },
    {
        "Bridge Canyon Dam": "Bridge Canyon Dam"
    },
    {
        " that would have backed up the waters of the Colorado River into the ": null
    },
    {
        "Grand Canyon National Park": "Grand Canyon National Park"
    },
    {
        ".     The Inter-American Conference on the Conservation of Renewable Natural Resources met in 1948 as a collection of nearly 200 scientists from all over the Americans forming the trusteeship principle that:     No generation can exclusively own the renewable resources by which it lives. We hold the commonwealth in trust for prosperity, and to lessen or destroy it is to commit treason against the future New York Times, September 18, 1948 in Fairchild, W.B. Renewable Resources: A World Dilemma: Recent Publications on Conservation , Geographical Review 39 pp. 86 - 98            During the 1950s, 1960s and 1970s, several events occurred which raised the public awareness of harm to the environment caused by man. In 1954, the 23 man crew of the Japanese fishing vessel  Lucky Dragon  was exposed to radioactive fallout from a hydrogen bomb test at ": null
    },
    {
        "Bikini Atoll": "Bikini Atoll"
    },
    {
        ", in 1969, an ecologically ": null
    },
    {
        "catastrophic oil spill": "1969 Santa Barbara Oil Spill"
    },
    {
        " from an offshore well in Californias Santa Barbara Channel, Barry Commoners protest against nuclear testing, ": null
    },
    {
        "Rachel Carsons": "Rachel Carson"
    },
    {
        "book ": null
    },
    {
        "Silent Spring": "Silent Spring"
    },
    {
        ", ": null
    },
    {
        "Paul R. Ehrlichs": "Paul R. Ehrlich"
    },
    {
        " The Population Bomb": "The Population Bomb"
    },
    {
        " all added anxiety about the environment. Pictures of Earth from space emphasized that the earth was small and fragile.      As the public became more aware of environmental issues, concern about ": null
    },
    {
        "air pollution": "Air Pollution In The United States"
    },
    {
        ", ": null
    },
    {
        "water pollution": "Water Pollution In The United States"
    },
    {
        ", solid waste disposal, dwindling energy resources, radiation, ": null
    },
    {
        "pesticide poisoning": "Pesticide Poisoning"
    },
    {
        " , noise pollution, and other environmental problems engaged a broadening number of sympathizers. That public support for environmental concerns was widespread became clear in the ": null
    },
    {
        "Earth Day": "Earth Day"
    },
    {
        " demonstrations of 1970.           In the modern wilderness preservation movement, important philosophical roles are played by the writings of ": null
    },
    {
        "John Muir": "John Muir"
    },
    {
        " who had been activist in the late 19th and early 20th century. Along with Muir perhaps most influential in the modern movement is ": null
    },
    {
        "Henry David Thoreau": "Henry David Thoreau"
    },
    {
        " who published ": null
    },
    {
        "Walden": "Walden"
    },
    {
        " in 1854. Also important was ": null
    },
    {
        "forester": "Forester"
    },
    {
        " and ": null
    },
    {
        "ecologist": "Ecologist"
    },
    {
        " Aldo Leopold": "Aldo Leopold"
    },
    {
        ", one of the founders of the Wilderness Society in 1935, who wrote a classic of nature observation and ethical philosophy,  A Sand County Almanac , ": null
    },
    {
        "published in 1949": "1949 In Literature"
    },
    {
        ". Other philosophical foundations were established by ": null
    },
    {
        "Ralph Waldo Emerson": "Ralph Waldo Emerson"
    },
    {
        " and ": null
    },
    {
        "Thomas Jefferson": "Thomas Jefferson"
    },
    {
        ".     There is also a growing movement of campers and other people who enjoy outdoor recreation activities to help preserve the environment while spending time in the wilderness.           The anti-nuclear movement in the United States consists of more than 80 ": null
    },
    {
        "anti-nuclear": "Anti-Nuclear"
    },
    {
        " groups that have acted to oppose ": null
    },
    {
        "nuclear power": "Nuclear Power"
    },
    {
        " or ": null
    },
    {
        "nuclear weapons": "Nuclear Weapons"
    },
    {
        ", or both, in the United States. These groups include the ": null
    },
    {
        "Abalone Alliance": "Abalone Alliance"
    },
    {
        ", ": null
    },
    {
        "Clamshell Alliance": "Clamshell Alliance"
    },
    {
        ", ": null
    },
    {
        "Institute for Energy and Environmental Research": "Institute For Energy And Environmental Research"
    },
    {
        ", ": null
    },
    {
        "Nuclear Information and Resource Service": "Nuclear Information And Resource Service"
    },
    {
        ", and ": null
    },
    {
        "Physicians for Social Responsibility": "Physicians For Social Responsibility"
    },
    {
        ". The anti-nuclear movement has delayed construction or halted commitments to build some new nuclear plants, and has pressured the ": null
    },
    {
        "Nuclear Regulatory Commission": "Nuclear Regulatory Commission"
    },
    {
        " to enforce and strengthen the safety regulations for nuclear power plants. Jerry Brown and ": null
    },
    {
        "Rinaldo Brutoco": "Rinaldo Brutoco"
    },
    {
        " . Profiles in Power: The Anti-nuclear movement and the Dawn of the Solar Age, p. 198.     ": null
    },
    {
        "Anti-nuclear": "Anti-Nuclear"
    },
    {
        " protests reached a peak in the 1970s and 1980s and grew out of the ": null
    },
    {
        "environmental movement": "Environmental Movement"
    },
    {
        ". Herbert P. Kitschelt.  British Journal of Political Science, Vol. 16, No. 1, 1986, p. 62. Campaigns which captured national public attention involved the ": null
    },
    {
        "Calvert Cliffs Nuclear Power Plant": "Calvert Cliffs Nuclear Power Plant"
    },
    {
        ", ": null
    },
    {
        "Seabrook Station Nuclear Power Plant": "Seabrook Station Nuclear Power Plant"
    },
    {
        ", ": null
    },
    {
        "Diablo Canyon Power Plant": "Diablo Canyon Power Plant"
    },
    {
        ", ": null
    },
    {
        "Shoreham Nuclear Power Plant": "Shoreham Nuclear Power Plant"
    },
    {
        ", and ": null
    },
    {
        "Three Mile Island": "Three Mile Island"
    },
    {
        ".  On June 12, 1982, one million people demonstrated in New York Citys ": null
    },
    {
        "Central Park": "Central Park"
    },
    {
        " against ": null
    },
    {
        "nuclear weapons": "Nuclear Weapons"
    },
    {
        " and for an end to the ": null
    },
    {
        "cold war": "Cold War"
    },
    {
        " arms race": "Arms Race"
    },
    {
        ". It was the largest anti-nuclear ": null
    },
    {
        "protest": "Demonstration"
    },
    {
        " and the largest political demonstration in American history. Jonathan Schell.  The Nation, July 2, 2007.   International Day of Nuclear Disarmament protests were held on June 20, 1983 at 50 sites across the United States.   Miami Herald, June 21, 1983.   There were many ": null
    },
    {
        "Nevada Desert Experience": "Nevada Desert Experience"
    },
    {
        " protests and peace camps at the ": null
    },
    {
        "Nevada Test Site": "Nevada Test Site"
    },
    {
        " during the 1980s and 1990s. Robert Lindsey.  New York Times, February 6, 1987.  New York Times, April 20, 1992.     More recent campaigning by anti-nuclear groups has related to several nuclear power plants including the ": null
    },
    {
        "Enrico Fermi Nuclear Power Plant": "Enrico Fermi Nuclear Power Plant"
    },
    {
        ",    ": null
    },
    {
        "Indian Point Energy Center": "Indian Point Energy Center"
    },
    {
        ", ": null
    },
    {
        "Oyster Creek Nuclear Generating Station": "Oyster Creek Nuclear Generating Station"
    },
    {
        ",   ": null
    },
    {
        "Greater Media": "Greater Media"
    },
    {
        " Examiner, June 28, 2007. ": null
    },
    {
        "Pilgrim Nuclear Generating Station": "Pilgrim Nuclear Generating Station"
    },
    {
        ",  ": null
    },
    {
        "Salem Nuclear Power Plant": "Salem Nuclear Power Plant"
    },
    {
        ",  and ": null
    },
    {
        "Vermont Yankee Nuclear Power Plant": "Vermont Yankee Nuclear Power Plant"
    },
    {
        ".  There have also been campaigns relating to the ": null
    },
    {
        "Y-12 Nuclear Weapons Plant": "Y-12 National Security Complexcurrent Status"
    },
    {
        ",  the ": null
    },
    {
        "Idaho National Laboratory": "Idaho National Laboratory"
    },
    {
        ",  proposed Yucca Mountain nuclear waste repository,  the ": null
    },
    {
        "Hanford Site": "Hanford Site"
    },
    {
        ", the ": null
    },
    {
        "Nevada Test Site": "Nevada Test Site"
    },
    {
        ",   The New York Times , August 10, 1989. ": null
    },
    {
        "Lawrence Livermore National Laboratory": "Lawrence Livermore National Laboratory"
    },
    {
        ",   The TriValley Herald, August 11, 2003. and transportation of nuclear waste from the ": null
    },
    {
        "Los Alamos National Laboratory": "Los Alamos National Laboratory"
    },
    {
        ". Concerned Citizens for Nuclear Safety .      Some scientists and engineers have expressed reservations about nuclear power, including: ": null
    },
    {
        "Barry Commoner": "Barry Commoner"
    },
    {
        ", ": null
    },
    {
        "S. David Freeman": "S. David Freeman"
    },
    {
        ", ": null
    },
    {
        "John Gofman": "John Gofman"
    },
    {
        ", ": null
    },
    {
        "Arnold Gundersen": "Arnold Gundersen"
    },
    {
        ", ": null
    },
    {
        "Mark Z. Jacobson": "Mark Z. Jacobson"
    },
    {
        ", ": null
    },
    {
        "Amory Lovins": "Amory Lovins"
    },
    {
        ", ": null
    },
    {
        "Arjun Makhijani": "Arjun Makhijani"
    },
    {
        ", ": null
    },
    {
        "Gregory Minor": "Gregory Minor"
    },
    {
        ", ": null
    },
    {
        "Joseph Romm": "Joseph Romm"
    },
    {
        " and ": null
    },
    {
        "Benjamin K. Sovacool": "Benjamin K. Sovacool"
    },
    {
        ". Scientists who have opposed nuclear weapons include ": null
    },
    {
        "Linus Pauling": "Linus Pauling"
    },
    {
        " and ": null
    },
    {
        "Eugene Rabinowitch": "Eugene Rabinowitch"
    },
    {
        ".              Antitoxics groups are a subgroup that is affiliated with the Environmental Movement in the United States, that is primarily concerned with the effects that cities and their by products have on humans. This aspect of the movement is a self-proclaimed movement of housewives . Concern around the issues of ground water contamination and air pollution rose in the early 1980s and individuals involved in antitoxics groups claim that they are concerned for the health of their families.   A prominent case can be seen in the Love Canal Homeowners association ; in this case a housing development was built on a site that had been used for toxic dumping by the Hooker Chemical Company. As a result of this dumping the residents had symptoms of skin irritation, ": null
    },
    {
        "Lois Gibbs": "Lois Gibbs"
    },
    {
        ", a resident of the development, started a grassroots campaign for reparations. Eventual success led to the government having to purchase homes that were sold in the development.       Prior to the 1970s the protection of basic air and water supplies was a matter mainly left to each state. During the 1970s, primary responsibility for clean air and water shifted to the federal government. Growing concerns, both environmental and economic, from cities and towns as well as sportsman and other local groups, and senators such as Maines ": null
    },
    {
        "Edmund S. Muskie": "Edmund S. Muskie"
    },
    {
        ", led to passage of extensive legislation, notably the ": null
    },
    {
        "Clean Air Act": "Clean Air Act"
    },
    {
        " of 1970 and the ": null
    },
    {
        "Water Pollution Control Act": "Water Pollution Control Act"
    },
    {
        " Amendments of 1972. Other legislation included the 1970 ": null
    },
    {
        "National Environmental Policy Act": "National Environmental Policy Act"
    },
    {
        " , which established the ": null
    },
    {
        "Council on Environmental Quality": "Council On Environmental Quality"
    },
    {
        "; the ": null
    },
    {
        "Marine Protection, Research, and Sanctuaries Act of 1972": "Marine Protection, Research, And Sanctuaries Act Of 1972"
    },
    {
        "; the ": null
    },
    {
        "Endangered Species Act": "Endangered Species Act"
    },
    {
        " of 1973, the ": null
    },
    {
        "Safe Drinking Water Act": "Safe Drinking Water Act"
    },
    {
        " , the ": null
    },
    {
        "Resource Conservation and Recovery Act": "Resource Conservation And Recovery Act"
    },
    {
        " , the Water Pollution Control Act Amendments of 1977, which became known as the ": null
    },
    {
        "Clean Water Act": "Clean Water Act"
    },
    {
        ", and the Comprehensive Environmental Response, Compensation, and Liability Act, commonly known as the ": null
    },
    {
        "Superfund Act": "Superfund"
    },
    {
        " . These laws regulated public drinking water systems, toxic substances, pesticides, and ocean dumping; and protected wildlife, wilderness, and wild and scenic rivers. Moreover, the new laws provide for pollution research, standard setting, contaminated site cleanup, monitoring, and enforcement.     The creation of these laws led to a major shift in the environmental movement. Groups such as the Sierra Club shifted focus from local issues to becoming a lobby in Washington and new groups, for example, the Natural Resources Defense Council and Environmental Defense, arose to influence politics as well.        In the 1980s President ": null
    },
    {
        "Ronald Reagan": "Ronald Reagan"
    },
    {
        " sought to curtail scope of environmental protection taking steps such as appointing ": null
    },
    {
        "James G. Watt": "James G. Watt"
    },
    {
        " who was called one of the most blatantly anti-environmental political appointees . The major environmental groups responded with mass mailings which led to increased membership and donations. The large environmental organization increasingly relied on ties within Washington, D.C. to advance their environmental agenda. At the same time membership in environmental groups became more suburban and urban. Groups such as animal rights, and the gun control lobby became linked with environmentalism while sportsmen, farmers and ranchers were no longer influential in the movement.     When industry groups lobbied to weaken regulation and a backlash against environmental regulations, the so-called ": null
    },
    {
        "wise use movement": "Wise Use Movement"
    },
    {
        " gained importance and influence. The wise use movement and ": null
    },
    {
        "anti-environmental": "Anti-Environmentalism"
    },
    {
        " groups were able to portray environmentalist as out of touch with mainstream values.        In 2004, with the environmental movement seemingly stalled, some environmentalists started questioning whether environmentalism was even a useful political framework. According to a controversial essay titled   American environmentalism has been remarkably successful in protecting the air, water, and large stretches of wilderness in ": null
    },
    {
        "North America": "North America"
    },
    {
        " and Europe, but these environmentalists have stagnated as a vital force for cultural and political change.     Shellenberger and Nordhaus wrote, Today environmentalism is just another special interest. Evidence for this can be found in its concepts, its proposals, and its reasoning. What stands out is how arbitrary environmental leaders are about what gets counted and what doesnt as environmental. Most of the movements leading thinkers, funders, and advocates do not question their most basic assumptions about who we are, what we stand for, and what it is that we should be doing. Their essay was followed by a speech in San Francisco called Is Environmentalism Dead? by former Sierra Club President, ": null
    },
    {
        "Adam Werbach": "Adam Werbach"
    },
    {
        ", who argued for the evolution of environmentalism into a more expansive, relevant and powerful progressive politics. Werbach endorsed building an environmental movement that is more relevant to average Americans, and controversially chose to lead Wal-Marts effort to take sustainability mainstream.     These post-environmental movement thinkers argue that the ecological crises the human species faces in the 21st century are qualitatively different from the problems the environmental movement was created to address in the 1960s and 1970s. They argue that climate change and ": null
    },
    {
        "habitat destruction": "Habitat Destruction"
    },
    {
        " are global and more complex, therefore demanding far deeper transformations of the economy, the culture and political life. The consequence of environmentalisms outdated and arbitrary definition, they argue, is political irrelevancy.     These politically neutral groups tend to avoid global conflicts and view the settlement of inter-human conflict as separate from regard for nature – in direct contradiction to the ecology movement and peace movement which have increasingly close links: while Green Parties, ": null
    },
    {
        "Greenpeace": "Greenpeace"
    },
    {
        ", and groups like the ACTivist Magazine regard ecology, biodiversity, and an end to non-human extinction as an absolute basis for peace, the local groups may not, and see a high degree of global competition and conflict as justifiable if it lets them preserve their own local uniqueness. However, such groups tend not to burn out and to sustain for long periods, even generations, protecting the same local treasures.     Local groups increasingly find that they benefit from collaboration, e.g. on consensus decision making methods, or making ": null
    },
    {
        "simultaneous policy": "Simultaneous Policy"
    },
    {
        ", or relying on common legal resources, or even sometimes a common glossary. However, the differences between the various groups that make up the modern environmental movement tend to outweigh such similarities, and they rarely co-operate directly except on a few major global questions. In a notable exception, over 1,000 local groups from around the country united for a single day of action as part of the ": null
    },
    {
        "Step It Up 2007": "Step It Up 2007"
    },
    {
        " campaign for real solutions to global warming.     Groups such as The Bioregional Revolution are calling on the need to bridge these differences, as the converging problems of the 21st century they claim compel the people to unite and to take decisive action. They promote ": null
    },
    {
        "bioregionalism": "Bioregionalism"
    },
    {
        ", ": null
    },
    {
        "permaculture": "Permaculture"
    },
    {
        ", and local economies as solutions to these problems, ": null
    },
    {
        "overpopulation": "Human Overpopulation"
    },
    {
        ", ": null
    },
    {
        "global warming": "Global Warming"
    },
    {
        ", ": null
    },
    {
        "global epidemics": "Epidemics"
    },
    {
        ", and ": null
    },
    {
        "water scarcity": "Water Scarcity"
    },
    {
        ", but most notably to ": null
    },
    {
        "peak oil": "Peak Oil"
    },
    {
        " – the prediction that the country is likely to reach a maximum in global oil production which could spell drastic changes in many aspects of the residents everyday lives.       Many environmental lawsuits turn on the question of who has standing; are the legal issues limited to property owners, or does the general public have a right to intervene? Christopher D. Stones 1972 essay, Should trees have standing? seriously addressed the question of whether natural objects themselves should have ": null
    },
    {
        "legal rights": "Legal Rights"
    },
    {
        ", including the right to participate in lawsuits. Stone suggested that there was nothing absurd in this view, and noted that many entities now regarded as having legal rights were, in the past, regarded as things that were regarded as legally rightless; for example, aliens, children and women. His essay is sometimes regarded as an example of the ": null
    },
    {
        "fallacy of hypostatization": "Reification"
    },
    {
        ".     One of the earliest lawsuits to establish that citizens may sue for environmental and aesthetic harms was Scenic Hudson Preservation Conference v. Federal Power Commission, decided in 1965 by the Second Circuit Court of Appeals. The case helped halt the construction of a power plant on Storm King Mountain in New York State. See also ": null
    },
    {
        "United States environmental law": "United States Environmental Law"
    },
    {
        " and ": null
    },
    {
        "David Sive": "David Sive"
    },
    {
        ", an attorney who was involved in the case.          ": null
    },
    {
        "Conservation biology": "Conservation Biology"
    },
    {
        " is an important and rapidly developing field.     One way to avoid the stigma of an ism was to evolve early anti-nuclear groups into the more scientific Green Parties, sprout new NGOs such as Greenpeace and Earth Action, and devoted groups to protecting global biodiversity and preventing global warming and climate change. But in the process, much of the emotional appeal, and many of the original aesthetic goals were lost. Nonetheless, these groups have well-defined ethical and political views, backed by science.     ": null
    },
    {
        "skeptical of the environmental movement": "Environmental Skepticism"
    },
    {
        " and feel that it is more deeply rooted in politics than science. Although there have been serious ": null
    },
    {
        "debates about climate change": "Global Warming Controversy"
    },
    {
        " and effects of some ": null
    },
    {
        "pesticides and herbicides that mimic animal sex steroids": "Endocrine Disruptors"
    },
    {
        ", science has shown that some of the claims of environmentalists have credence.     Claims made by environmentalists may be perceived as veiled attacks on industry and globalization rather than legitimate environmental concerns. Detractors note that a significant number of environmental theories and predictions have been inaccurate and suggest that the regulations recommended by environmentalists will more likely harm society rather than help nature.          Specific examples include when ": null
    },
    {
        "Rachel Carson": "Rachel Carson"
    },
    {
        ", in her book Silent Spring, suggested that the pesticide ": null
    },
    {
        "DDT": "Ddt"
    },
    {
        " caused cancer and drastically harmed ecosystems. DDT is highly toxic to aquatic life, including crawfish, daphnids, sea shrimp and many species of fish. However, ": null
    },
    {
        "DDT is also used to control malaria": "Ddtuse Against Malaria"
    },
    {
        ".     Prominent novelist and Harvard Medical School graduate ": null
    },
    {
        "Michael Crichton": "Michael Crichton"
    },
    {
        " appeared before the U.S. ": null
    },
    {
        "Senate Committee on Environment and Public Works": "Senate Committee On Environment And Public Works"
    },
    {
        " to address such concerns and recommended the employment of ": null
    },
    {
        "double-blind experiment": "Double-Blind Experiment"
    },
    {
        "ation in environmental research. Crichton suggested that because environmental issues are so political in nature, policy makers need neutral, conclusive data to base their decisions on, rather than conjecture and rhetoric, and double-blind experiments are the most efficient way to achieve that aim.     A consistent theme acknowledged by both supporters and critics of the environmental movement is that we know very little about the Earth we live in. Most fields of environmental studies are relatively new, and therefore what research we have is limited and does not date far enough back for us to completely understand long-term environmental trends. This has led a number of environmentalists to support the use of the ": null
    },
    {
        "precautionary principle": "Precautionary Principle"
    },
    {
        " in policy making, which ultimately asserts that we dont know how certain actions may affect the environment, and because there is reason to believe they may cause more harm than good we should refrain from such actions.          In the December 1994 Wild Forest Review, Alexander Cockburn and Jeffrey St. Clair wrote The mainstream environmental movement was elitist, highly paid, detached from the people, indifferent to the working class, and a firm ally of big government.…The environmental movement is now accurately perceived as just another well-financed and cynical special interest group, its rancid infrastructure supported by Democratic Party operatives and millions in grants from corporate foundations.          Historian and President of the American Historical Association ": null
    },
    {
        "William Cronon": "William Cronon"
    },
    {
        " has criticized the modern environmental movement for having a romantic idealizations of ": null
    },
    {
        "wilderness": "Wilderness"
    },
    {
        ". Cronon writes wilderness serves as the unexamined foundation on which so many of the quasi-religious values of modern environmentalism rest. Cronon claims that to the extent that we live in an urban-industrial civilization but at the same time pretend to ourselves that our real home is in the wilderness, to just that extent we give ourselves permission to evade responsibility for the lives we actually lead.     Similarly ": null
    },
    {
        "Michael Pollan": "Michael Pollan"
    },
    {
        " has argued that the wilderness ethic leads people to dismiss areas whose wildness is less than absolute. In his book Second Nature, Pollan writes that once a landscape is no longer virgin it is typically written off as fallen, lost to nature, irredeemable.       Within the environmental movement an ideological debate has taken place between those with an ": null
    },
    {
        "ecocentric": "Ecocentric"
    },
    {
        " view point and an ": null
    },
    {
        "anthropocentric": "Anthropocentric"
    },
    {
        " view point. The anthropocentric view has been seen as the conservationist approach to the environment with nature viewed, at least in part, as resource to be used by man. In contrast to the conservationist approach the ecocentric view, associated with ": null
    },
    {
        "John Muir": "John Muir"
    },
    {
        ", ": null
    },
    {
        "Henry David Thoreau": "Henry David Thoreau"
    },
    {
        " and ": null
    },
    {
        "William Wordsworth": "William Wordsworth"
    },
    {
        " referred to as the preservationist movement. This approach sees nature in a more spiritual way. Many environmental historians consider the split between John Muir and ": null
    },
    {
        "Gifford Pinchot": "Gifford Pinchot"
    },
    {
        ". During the preservation / conservation debate the term preservationist become to be seen as a pejorative term.     While the ecocentric view focused on biodiversity and wilderness protection the anthropocentric view focus on urban pollution and social justice. Some environmental writers, for example ": null
    },
    {
        "William Cronon": "William Cronon"
    },
    {
        " have criticized the ecocentric view as have a dualist view as man being separate from nature. Critics of the anthropocentric view point contend that the environmental movement has been taken over by so-called ": null
    },
    {
        "leftist": "Leftist"
    },
    {
        " with an agenda beyond environmental protection.     Several books after the middle of the 20th century contributed to the rise of American environmentalism , especially among college and university students and the more literate public. One was the publication of the first textbook on ": null
    },
    {
        "ecology": "Ecology"
    },
    {
        ",  Fundamentals of Ecology , by ": null
    },
    {
        "Eugene Odum": "Eugene Odum"
    },
    {
        " and ": null
    },
    {
        "Howard Odum": "Howard T. Odum"
    },
    {
        ", in 1953. Another was the appearance of the best-seller  Silent Spring  by ": null
    },
    {
        "Rachel Carson": "Rachel Carson"
    },
    {
        ", in 1962. Her book brought about a whole new interpretation on pesticides by exposing their harmful effects in nature. From this book many began referring to Carson as the mother of the environmental movement . Another influential development was a 1965 lawsuit, Scenic Hudson Preservation Conference v. Federal Power Commission, opposing the construction of a power plant on ": null
    },
    {
        "Storm King Mountain": "Storm King Mountain"
    },
    {
        ", which is said to have given birth to modern ": null
    },
    {
        "United States environmental law": "United States Environmental Law"
    },
    {
        ". The wide popularity of The Whole Earth Catalog s, starting in 1968, was quite influential among the younger, hands-on, activist generation of the 1960s and 1970s. Recently, in addition to opposing environmental degradation and protecting wilderness, an increased focus on coexisting with natural biodiversity has appeared, a strain that is apparent in the movement for ": null
    },
    {
        "sustainable agriculture": "Sustainable Agriculture"
    },
    {
        " and in the concept of ": null
    },
    {
        "Reconciliation Ecology": "Reconciliation Ecology"
    },
    {
        ".               Environmentalists became much more influential in American politics after the creation or strengthening of numerous US environmental laws, including the ": null
    },
    {
        "Clean Air Act": "Clean Air Act"
    },
    {
        " and ": null
    },
    {
        "Clean Water Act": "Clean Water Act"
    },
    {
        " and the formation of the ": null
    },
    {
        "United States Environmental Protection Agency": "United States Environmental Protection Agency"
    },
    {
        " in 1970. These successes were followed by the enactment of a whole series of laws regulating ": null
    },
    {
        "waste": "Waste"
    },
    {
        " , ": null
    },
    {
        "toxic substances": "Toxin"
    },
    {
        " , ": null
    },
    {
        "pesticides": "Pesticides"
    },
    {
        " , clean-up of polluted sites , protection of ": null
    },
    {
        "endangered species": "Endangered Species"
    },
    {
        " , and more.     Fewer environmental laws have been passed in the last decade as corporations and other ": null
    },
    {
        "conservative": "American Conservatism"
    },
    {
        " interests have increased their influence over ": null
    },
    {
        "American politics": "Politics Of The United States"
    },
    {
        ". Corporate cooperation against environmental lobbyists has been organized by the ": null
    },
    {
        "Wise Use": "Wise Use"
    },
    {
        " group. At the same time, many environmentalists have been turning toward other means of persuasion, such as working with business, community, and other partners to promote ": null
    },
    {
        "sustainable development": "Sustainable Development"
    },
    {
        ".     Much environmental activism is directed towards ": null
    },
    {
        "conservation": "Conservation Movement"
    },
    {
        " Perez, Alejandro Colsa, Bernadette Grafton, Paul Mohai, Rebecca Hardin, Katy Hintzen, and Sara Orvis. Evolution of the environmental justice movement: activism, formalization and differentiation. Environmental Research Letters 10, no. 10 : 105002. as well as the prevention or elimination of pollution. However, ": null
    },
    {
        "conservation movement": "Conservation Movement"
    },
    {
        "s, ": null
    },
    {
        "ecology movement": "Ecology Movement"
    },
    {
        "s, ": null
    },
    {
        "peace movement": "Peace Movement"
    },
    {
        "s, ": null
    },
    {
        "green parties": "Green Parties"
    },
    {
        ", ": null
    },
    {
        "green-": "Green Anarchism"
    },
    {
        " and ": null
    },
    {
        "eco-anarchists": "Eco-Anarchism"
    },
    {
        " often subscribe to very different ideologies, while supporting the same goals as those who call themselves environmentalists . To outsiders, these groups or factions can appear to be indistinguishable.     As ": null
    },
    {
        "human population": "World Population"
    },
    {
        " and industrial activity continue to increase, environmentalists often find themselves in serious conflict with those who believe that human and industrial activities should not be overly regulated or restricted, such as some ": null
    },
    {
        "libertarians": "Libertarianism"
    },
    {
        ".     Environmentalists often clash with others, particularly corporate interests, over issues of the management of ": null
    },
    {
        "natural resources": "Natural Resources"
    },
    {
        ", like in the case of the ": null
    },
    {
        "atmosphere": "Earths Atmosphere"
    },
    {
        " as a carbon dump , the focus of ": null
    },
    {
        "climate change": "Climate Change"
    },
    {
        ", and ": null
    },
    {
        "global warming": "Global Warming"
    },
    {
        " controversy. They usually seek to protect commonly owned or unowned resources for future generations.          While most environmentalists are mainstream and peaceful, a small minority are more radical in their approach. Adherents of ": null
    },
    {
        "radical environmentalism": "Radical Environmentalism"
    },
    {
        " and ": null
    },
    {
        "ecological anarchism": "Green Anarchism"
    },
    {
        " are involved in ": null
    },
    {
        "direct action": "Direct Action"
    },
    {
        " campaigns to protect the environment. Some campaigns have employed controversial tactics including ": null
    },
    {
        "sabotage": "Sabotage"
    },
    {
        ", ": null
    },
    {
        "blockade": "Blockade"
    },
    {
        "s, and ": null
    },
    {
        "arson": "Arson"
    },
    {
        ", while most use peaceful protests such as marches, tree-sitting, and the like. There is substantial debate within the environmental movement as to the acceptability of these tactics, but almost all environmentalists condemn ": null
    },
    {
        "violent": "Violence"
    },
    {
        " actions that can harm ": null
    },
    {
        "humans": "Humans"
    }
]