[
    {
        "            Eithne Pádraigín Ní Bhraonáin , known professionally as Enya, is an Irish singer, songwriter, record producer and musician. Born into a musical family and raised in the Irish-speaking area of ": null
    },
    {
        "Gweedore": "Gweedore"
    },
    {
        " in ": null
    },
    {
        "County Donegal": "County Donegal"
    },
    {
        ", Enya began her music career when she joined her familys ": null
    },
    {
        "Celtic": "Celtic Music"
    },
    {
        " band ": null
    },
    {
        "Clannad": "Clannad"
    },
    {
        " in 1980 on keyboards and backing vocals. She left in 1982 with their manager and producer ": null
    },
    {
        "Nicky Ryan": "Nicky Ryan"
    },
    {
        " to pursue a solo career, with Ryans wife ": null
    },
    {
        "Roma Ryan": "Roma Ryan"
    },
    {
        " as her lyricist. Enya developed her sound over the following four years with multitracked vocals and keyboards with elements of ": null
    },
    {
        "new age": "New-Age Music"
    },
    {
        ", Celtic, classical, church, and folk music. She has sung in ten languages.     Enyas first projects as a solo artist included soundtrack work for  The Frog Prince  and the 1987 ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " documentary series  The Celts , which was released as her debut album,  Enya  . She signed with ": null
    },
    {
        "Warner Music UK": "Warner Music Group"
    },
    {
        ", which granted her artistic freedom and minimal interference from the label. The commercial and critical success of  Watermark  propelled her to worldwide fame, helped by the international top-10 hit single ": null
    },
    {
        "Orinoco Flow": "Orinoco Flow"
    },
    {
        " . This was followed by the multi-million selling albums  Shepherd Moons  ,  The Memory of Trees  and  A Day Without Rain  . Sales of the latter and its lead single, ": null
    },
    {
        "Only Time": "Only Time"
    },
    {
        " , surged in the United States following its use in the media coverage of the ": null
    },
    {
        "September 11 attacks": "September 11 Attacks"
    },
    {
        ". Following  Amarantine  and  And Winter Came...  , Enya took an extended break from music; she returned in 2012 and released  Dark Sky Island  .     Enya is known for her privacy and has never undertaken a concert tour. She is Irelands bestselling solo artist  and second-bestselling artist behind ": null
    },
    {
        "U2": "U2"
    },
    {
        ", with a ": null
    },
    {
        "discography": "Enya Discography"
    },
    {
        " that has sold 26.5  million ": null
    },
    {
        "certified albums": "Recording Industry Association Of America"
    },
    {
        " in the United States  and an estimated 75 million records worldwide, making her one of the ": null
    },
    {
        "best-selling music artists of all time": "List Of Best-Selling Music Artists"
    },
    {
        ".  A Day Without Rain remains the bestselling new-age album, with an estimated 16 million copies sold worldwide.  Enya has won awards including seven ": null
    },
    {
        "World Music Award": "World Music Award"
    },
    {
        "s, four ": null
    },
    {
        "Grammy Awards": "Grammy Award"
    },
    {
        "for ": null
    },
    {
        "Best New Age Album": "Grammy Award For Best New Age Album"
    },
    {
        ",  and an ": null
    },
    {
        "Ivor Novello Award": "Ivor Novello Award"
    },
    {
        ". She was nominated for an ": null
    },
    {
        "Academy Award": "Academy Awards"
    },
    {
        " and a ": null
    },
    {
        "Golden Globe Award": "Golden Globe Award"
    },
    {
        " for ": null
    },
    {
        "May It Be": "May It Be"
    },
    {
        " , written for  The Lord of the Rings: The Fellowship of the Ring  .          Eithne Pádraigín Ní Bhraonáin was born on 17 May 1961 in Dore, within the area of the parish ": null
    },
    {
        "Gaoth Dobhair": "Gaoth Dobhair"
    },
    {
        ", in the northwestern county of ": null
    },
    {
        "Donegal": "County Donegal"
    },
    {
        ", Ireland.  It is a ": null
    },
    {
        "Gaeltacht": "Gaeltacht"
    },
    {
        " region where ": null
    },
    {
        "Irish": "Irish Language"
    },
    {
        " is the primary language. Her name is ": null
    },
    {
        "anglicised": "Anglicisation"
    },
    {
        " as Enya Patricia Brennan,  where Enya is the phonetic spelling of how Eithne is pronounced in her native ": null
    },
    {
        "Ulster dialect of Irish": "Ulster Irish"
    },
    {
        "; Ní Bhraonáin translates to daughter of Brennan .  The fifth of nine children, Enya was born into a Roman Catholic ": null
    },
    {
        "family of musicians": "Clannadthe Brennan Family"
    },
    {
        ".  Her father, Leo Brennan, was the leader of the Slieve Foy Band, an ": null
    },
    {
        "Irish showband": "Irish Showband"
    },
    {
        ", and ran ": null
    },
    {
        "Leos Tavern": "Leos Tavern"
    },
    {
        " in Meenaleck; her mother, Máire Brennan , who had distant Spanish roots and whose ancestors settled on ": null
    },
    {
        "Tory Island": "Tory Island"
    },
    {
        ", was an amateur musician who played in Leos band  and taught music at ": null
    },
    {
        "Gweedore Community School": "Pobalscoil Ghaoth Dobhair"
    },
    {
        ".  Enyas maternal grandfather Aodh was the headmaster of the primary school in Dore, and her grandmother was a teacher there. Aodh was also the founder of the ": null
    },
    {
        "Gweedore Theatre": "Amharclann Ghaoth Dobhair"
    },
    {
        " company.      Enya described her upbringing as very quiet and happy. At age three, she took part in her first singing competition at the annual ": null
    },
    {
        "Feis Ceoil": "Feis Ceoil"
    },
    {
        " music festival. She took part in pantomimes at Gweedore Theatre and sang with her siblings in her mothers choir at St Marys church in ": null
    },
    {
        "Derrybeg": "Derrybeg"
    },
    {
        ". She learned English at primary school and began piano lessons at age four. I had to do school work and then travel to a neighbouring town for piano lessons, and then more school work. I ... remember my brothers and sisters playing outside ... and I would be inside playing the piano. This one big book of ": null
    },
    {
        "scale": "Scale"
    },
    {
        "s, practising them over and over.  At eleven, Enyas grandfather paid for her education at a strict ": null
    },
    {
        "convent": "Convent"
    },
    {
        " boarding school in ": null
    },
    {
        "Milford": "Milford, County Donegal"
    },
    {
        "  run by nuns of the ": null
    },
    {
        "Loreto order": "Sisters Of Loreto"
    },
    {
        ", where she developed a taste for classical music, art, ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " and ": null
    },
    {
        "watercolour": "Watercolour"
    },
    {
        " painting. It was devastating to be torn away from such a large family, but it was good for my music. Enya left the school at 17 and studied classical music in college for one year with the aim of becoming a piano teacher sort of person. I never thought of myself composing or being on stage.           In the 1970s several members of Enyas family formed ": null
    },
    {
        "Clannad": "Clannad"
    },
    {
        ", a ": null
    },
    {
        "Celtic": "Celtic Music"
    },
    {
        " band with ": null
    },
    {
        "Nicky Ryan": "Nicky Ryan"
    },
    {
        " as their manager, sound engineer and producer and his future wife ": null
    },
    {
        "Roma Ryan": "Roma Ryan"
    },
    {
        " assisting with the tour management and administrative duties.             ;Studio albums    Enya      Watermark     Shepherd Moons     The Memory of Trees     A Day Without Rain     Amarantine     And Winter Came...     Dark Sky Island ": null
    }
]