[
    {
        "Equidae  is the ": null
    },
    {
        "taxonomic": "taxonomy"
    },
    {
        " family": "family"
    },
    {
        " of ": null
    },
    {
        "horses": "horse"
    },
    {
        "and related animals, including the extant ": null
    },
    {
        "horse": "horse"
    },
    {
        "s, ": null
    },
    {
        "donkey": "donkey"
    },
    {
        "s, and ": null
    },
    {
        "zebra": "zebra"
    },
    {
        "s, and many other ": null
    },
    {
        "species": "species"
    },
    {
        " known only from ": null
    },
    {
        "fossil": "fossil"
    },
    {
        "s. All ": null
    },
    {
        "extant": "extant taxon"
    },
    {
        " species are in the ": null
    },
    {
        "genus": "genus"
    },
    {
        "  Equus . Equidae belongs to the order ": null
    },
    {
        "Perissodactyla": "perissodactyla"
    },
    {
        ", which includes the extant ": null
    },
    {
        "tapirs": "tapir"
    },
    {
        "and ": null
    },
    {
        "rhinoceros": "rhinoceros"
    },
    {
        ", and several extinct families.     The term equid refers to any member of this family, including any ": null
    },
    {
        "equine": "equine"
    },
    {
        ".               The oldest known ": null
    },
    {
        "fossils": "fossil"
    },
    {
        "assigned to Equidae date from the early ": null
    },
    {
        "Eocene": "eocene"
    },
    {
        ", 54 million years ago. They used to be assigned to the genus  Hyracotherium , but the ": null
    },
    {
        "type species": "type species"
    },
    {
        " of that genus now is regarded to be not a member of this family. The other species have been split off into different genera. These early Equidae were fox-sized animals with three toes on the hind feet, and four on the front feet. They were herbivorous browsers on relatively soft plants, and already adapted for running. The complexity of their brains suggest that they already were alert and intelligent animals.  Later species reduced the number of toes, and developed teeth more suited for grinding up grasses and other tough plant food.     The family became relatively diverse during the ": null
    },
    {
        "Miocene": "miocene"
    },
    {
        ", with many new species appearing. By this time, equids were more truly horse-like, having developed the typical body shape of the modern animals.  Many of these species bore the main weight of their bodies on their central, third, toe, with the others becoming reduced, and barely touching the ground, if at all. The sole surviving genus, Equus, had evolved by the early ": null
    },
    {
        "Pleistocene": "pleistocene"
    },
    {
        ", and spread rapidly through the world.                     Order Perissodactyla   † indicates ": null
    },
    {
        "extinct": "extinction"
    },
    {
        " taxa.   Family Equidae  Haringtonhippus  Hay, Oliver P. . Contributions to the Knowledge of the Mammals of the Pleistocene of North America . Proceedings of the United States National Museum. 48 : 535–549.    Genus † Epihippus   Haplohippus   Heptaconodon   Eohippus   Minippus   Orohippus   Pliolophus   Protorohippus   Sifrhippus   Xenicohippus   Eurohippus   Propalaeotherium  ": null
    },
    {
        "Anchitheriinae": "anchitheriinae"
    },
    {
        "  Anchitherium   Archaeohippus   Desmatippus   Hypohippus   Kalobatippus   Megahippus   Mesohippus   Miohippus   Parahippus   Sinohippus  ": null
    },
    {
        "Equinae": "equinae"
    },
    {
        "  Merychippus   Scaphohippus   Acritohippus  ": null
    },
    {
        "Hipparionini": "hipparionini"
    },
    {
        "  Eurygnathohippus   Hipparion   Hippotherium   Nannippus   Neohipparion   Proboscidipparion   Pseudhipparion  ": null
    },
    {
        "Equini": "equini"
    },
    {
        " Protohippina": "protohippina"
    },
    {
        "  Calippus   Protohippus   Astrohippus   Dinohippus   Equus     Genus † Hippidion   Onohippidium   Pliohippus   Heteropliohippus   Parapliohippus ": null
    }
]