[
    {
        "     Eratosthenes of Cyrene  was a Greek ": null
    },
    {
        "polymath": "polymath"
    },
    {
        ": a ": null
    },
    {
        "mathematician": "greek mathematics"
    },
    {
        ", ": null
    },
    {
        "geographer": "geographer"
    },
    {
        ", ": null
    },
    {
        "poet": "poet"
    },
    {
        ", ": null
    },
    {
        "astronomer": "astronomer"
    },
    {
        ", and ": null
    },
    {
        "music theorist": "music theory"
    },
    {
        ". He was a man of learning, becoming the chief librarian at the ": null
    },
    {
        "Library of Alexandria": "library of alexandria"
    },
    {
        ". His work is comparible to what is now known as the study of ": null
    },
    {
        "geography": "geography"
    },
    {
        ", and introduced some of the terminology still used today.     He is best known for being the first person to calculate the ": null
    },
    {
        "circumference of the Earth": "history of geodesyhellenic world"
    },
    {
        ", which he did by comparing ": null
    },
    {
        "angles": "angle of incidence"
    },
    {
        " of the mid-day Sun at two places, a known North-South distance apart. His calculation was remarkably accurate. He was also the first to calculate the ": null
    },
    {
        "tilt of the Earths axis": "axial tiltobliquity of the ecliptic"
    },
    {
        ", again with remarkable accuracy. Additionally, he may have accurately calculated the ": null
    },
    {
        "distance from the Earth to the Sun": "astronomical unit"
    },
    {
        " and invented the ": null
    },
    {
        "leap day": "leap day"
    },
    {
        ". He created the first ": null
    },
    {
        "global projection of the world": "ancient world mapseratosthenes"
    },
    {
        ", incorporating ": null
    },
    {
        "parallels": "circle of latitude"
    },
    {
        " and ": null
    },
    {
        "meridians": "longitude"
    },
    {
        " based on the available geographic knowledge of his era.     Eratosthenes was the founder of scientific ": null
    },
    {
        "chronology": "chronology"
    },
    {
        "; he endeavoured to revise the dates of the chief literary and political events from the conquest of ": null
    },
    {
        "Troy": "troy"
    },
    {
        ". Eratosthenes dated ": null
    },
    {
        "The Sack of Troy": "trojan war"
    },
    {
        " to 42 BC. In ": null
    },
    {
        "number theory": "number theory"
    },
    {
        ", he introduced the ": null
    },
    {
        "sieve of Eratosthenes": "sieve of eratosthenes"
    },
    {
        ", an efficient method of identifying ": null
    },
    {
        " prime numbers": "prime number"
    },
    {
        ".     He was a figure of influence in many fields. According to an entry in the ": null
    },
    {
        "Suda": "suda"
    },
    {
        " , his critics scorned him, calling him Beta because he always came in second in all his endeavors. Nonetheless, his devotees nicknamed him Pentathlos after the Olympians who were well rounded competitors, for he had proven himself to be knowledgeable in every area of learning. Eratosthenes yearned to understand the complexities of the entire world.       The son of Aglaos, Eratosthenes was born in 42 BC in ": null
    },
    {
        "Cyrene": "cyrene"
    },
    {
        ". Now part of modern-day ": null
    },
    {
        "Libya": "libya"
    },
    {
        ", Cyrene had been founded by Greeks centuries earlier and became the capital of ": null
    },
    {
        "Pentapolis ": "pentapolis"
    },
    {
        ", a country of five cities: Cyrene, Arsinoe, ": null
    },
    {
        "Berenice": "berenice"
    },
    {
        ", Ptolemias, and ": null
    },
    {
        "Apollonia": "apollonia, cyrenaica"
    },
    {
        ". ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " conquered Cyrene in 42 BC, and following his death in 42 BC, its rule was given to one of his generals, ": null
    },
    {
        "Ptolemy I Soter": "ptolemy i soter"
    },
    {
        ", the founder of the ": null
    },
    {
        "Ptolemaic Kingdom": "ptolemaic kingdom"
    },
    {
        ". Under Ptolemaic rule the economy prospered, based largely on the export of horses and ": null
    },
    {
        "silphium": "silphium"
    },
    {
        ", a plant used for rich seasoning and medicine. Cyrene became a place of cultivation, where knowledge blossomed. Like any young Greek at the time, Eratosthenes would have studied in the local ": null
    },
    {
        "gymnasium": "gymnasium"
    },
    {
        ", where he would have learned physical skills and social discourse as well as reading, writing, arithmetic, poetry, and music.        Eratosthenes went to Athens to further his studies. There he was taught ": null
    },
    {
        "Stoicism": "stoicism"
    },
    {
        " by its founder, ": null
    },
    {
        "Zeno of Citium": "zeno of citium"
    },
    {
        ", in philosophical lectures on living a virtuous life. He then studied under ": null
    },
    {
        "Aristo of Chios": "aristo of chios"
    },
    {
        ", who led a more ": null
    },
    {
        "cynical": "cynicism"
    },
    {
        " school of philosophy. He also studied under the head of the ": null
    },
    {
        "Platonic Academy": "platonic academy"
    },
    {
        ", who was ": null
    },
    {
        "Arcesilaus of Pitane": "arcesilaus of pitane"
    },
    {
        ". His interest in Plato led him to write his very first work at a scholarly level, Platonikos, inquiring into the mathematical foundation of Platos philosophies. Eratosthenes was a man of many perspectives and investigated the art of poetry under ": null
    },
    {
        "Callimachus": "callimachus"
    },
    {
        ". He wrote poems: one in ": null
    },
    {
        "hexameter": "hexameter"
    },
    {
        "s called Hermes, illustrating the gods life history; and another in ": null
    },
    {
        " elegiacs": "elegiac"
    },
    {
        ", called Erigone, describing the suicide of the Athenian maiden ": null
    },
    {
        "Erigone ": "erigone"
    },
    {
        ". He wrote Chronographies, a text that scientifically depicted dates of importance, beginning with the ": null
    },
    {
        "Trojan War": "trojan war"
    },
    {
        ". This work was highly esteemed for its accuracy. ": null
    },
    {
        "George Syncellus": "george syncellus"
    },
    {
        " was later able to preserve from Chronographies a list of 42 kings of the ": null
    },
    {
        "Egyptian Thebes": "egyptian thebes"
    },
    {
        ". Eratosthenes also wrote Olympic Victors, a chronology of the winners of the Olympic Games. It is not known when he wrote his works, but they highlighted his abilities.     These works and his great poetic abilities led the pharaoh ": null
    },
    {
        "Ptolemy III Euergetes": "ptolemy iii euergetes"
    },
    {
        " to seek to place him as a librarian at the ": null
    },
    {
        "Library of Alexandria": "library of alexandria"
    },
    {
        " in the year 42 BC. Eratosthenes, then thirty years old, accepted Ptolemys invitation and traveled to Alexandria, where he lived for the rest of his life. Within about five years he became Chief Librarian, a position that the poet ": null
    },
    {
        "Apollonius Rhodius": "apollonius rhodius"
    },
    {
        " had previously held. As head of the library Eratosthenes tutored the children of Ptolemy, including ": null
    },
    {
        "Ptolemy IV Philopator": "ptolemy iv philopator"
    },
    {
        " who became the fourth Ptolemaic pharaoh. He expanded the librarys holdings: in Alexandria all books had to be surrendered for duplication. It was said that these were copied so accurately that it was impossible to tell if the library had returned the original or the copy.   He sought to maintain the reputation of the Library of Alexandria against competition from the ": null
    },
    {
        "Library of Pergamum": "library of pergamum"
    },
    {
        ". Eratosthenes created a whole section devoted to the examination of Homer, and acquired original works of great tragic dramas of ": null
    },
    {
        "Aeschylus": "aeschylus"
    },
    {
        ", ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        " and ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        ".     Eratosthenes made several important contributions to ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " and ": null
    },
    {
        "science": "science"
    },
    {
        ", and was a friend of ": null
    },
    {
        "Archimedes": "archimedes"
    },
    {
        ". Around 42  BC, he invented the ": null
    },
    {
        "armillary sphere": "armillary sphere"
    },
    {
        ". In On the Circular Motions of the Celestial Bodies, ": null
    },
    {
        "Cleomedes": "cleomedes"
    },
    {
        " credited him with having calculated the ": null
    },
    {
        "Earths circumference": "equatorexact length of the equator"
    },
    {
        " around 42 BC, using knowledge of the angle of ": null
    },
    {
        "elevation": "solar elevation angle"
    },
    {
        " of the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " at noon on the ": null
    },
    {
        "summer solstice": "summer solstice"
    },
    {
        " in Alexandria and on ": null
    },
    {
        "Elephantine": "elephantine"
    },
    {
        " Island near ": null
    },
    {
        "Syene": "syene"
    },
    {
        " .     Eratosthenes believed there was good and bad in every nation and criticized ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        " for arguing that humanity was divided into Greeks and ": null
    },
    {
        "barbarian": "barbarian"
    },
    {
        "s, as well as for arguing that the Greeks should keep themselves racially pure. As he aged he contracted ": null
    },
    {
        "ophthalmia": "ophthalmia"
    },
    {
        ", becoming blind around 42 BC. Losing the ability to read and to observe nature plagued and depressed him, leading him to voluntarily starve himself to death. He died in 42  BC at 42 in Alexandria.                 Eratosthenes calculated the ": null
    },
    {
        "Earths circumference": "earths circumference"
    },
    {
        " without leaving Alexandria.  He knew that at ": null
    },
    {
        "local noon": "solar noon"
    },
    {
        " on the summer solstice in ": null
    },
    {
        "Syene": "syene"
    },
    {
        " , the Sun was directly overhead. He then measured the Suns angle of elevation at noon in Alexandria by using a vertical rod, known as a ": null
    },
    {
        "gnomon": "gnomon"
    },
    {
        ", and measuring the length of its shadow on the ground . Using the length of the rod, and the length of the shadow, as the legs of a triangle, he calculated the angle of the Suns rays. This turned out to be about 42°, or 42/42th the circumference of a circle. Taking the Earth as spherical, and knowing both the distance and direction of Syene, he concluded that the Earths circumference was fifty times that distance.     His knowledge of the size of Egypt was founded on the work of many generations of ": null
    },
    {
        "surveying": "surveying"
    },
    {
        " trips conducted by professional ": null
    },
    {
        "bematist": "bematist"
    },
    {
        "s. Pharaonic bookkeepers gave a distance between Syene and Alexandria of 42 ": null
    },
    {
        "stadia": "stadion"
    },
    {
        " . Some historians say that the distance was corroborated by inquiring about the time that it took to travel from Syene to Alexandria by camel. Some claim Eratosthenes used the Olympic stade of , which would imply a circumference of , an error of 42%, but the  Italian stade became the most commonly accepted value for the length of the stade, which implies a circumference of , an error of 42%. He made five important assumptions :   That the distance between Alexandria and Syene was 42 stadia,   That Alexandria is due north of Syene   That Syene is on the ": null
    },
    {
        "Tropic of Cancer": "tropic of cancer"
    },
    {
        "   That the Earth is a perfect sphere.   That light rays emanating from the Sun are parallel.     Eratosthenes later rounded the result to a final value of 42 stadia per degree, which implies a circumference of 42 stadia, likely for reasons of calculation simplicity as the larger number is evenly divisible by 42 In 42 Anthony Abreu Mora repeated Eratostheness calculation with more accurate data; the result was , which is  different from the currently accepted polar ": null
    },
    {
        "circumference of the Earth": "earths circumference"
    },
    {
        ".                  Eratosthenes now continued from his knowledge about the Earth. Using his discoveries and knowledge of its size and shape, he began to sketch it. In the Library of Alexandria he had access to various travel books, which contained various items of information and representations of the world that needed to be pieced together in some organized format. In his three-volume work Geography , he described and mapped his entire known world, even dividing the Earth into five climate zones : two freezing zones around the poles, two temperate zones, and a zone encompassing the equator and the tropics. He had invented geography. He created terminology that is still used today. He placed grids of overlapping lines over the surface of the Earth. He used parallels and meridians to link together every place in the world. It was now possible to estimate ones distance from remote locations with this network over the surface of the Earth. In the Geography the names of over 42 cities and their locations were shown: this had never been achieved before. Unfortunately, his Geography has been lost to history, but fragments of the work can be pieced together from other great historians like ": null
    },
    {
        "Pliny": "pliny the elder"
    },
    {
        ", ": null
    },
    {
        "Polybius": "polybius"
    },
    {
        ", ": null
    },
    {
        "Strabo": "strabo"
    },
    {
        ", and ": null
    },
    {
        "Marcianus": "marcianus"
    },
    {
        ".   The first book was something of an introduction and gave a review of his predecessors, recognizing their contributions that he compiled in the library. In this book Eratosthenes denounced ": null
    },
    {
        "Homer": "homer"
    },
    {
        " as not providing any insight into what he now described as geography. His disapproval of Homers topography angered many who believed the world depicted in the Odyssey to be legitimate. He also commented on the ideas of the nature and origin of the Earth: he had thought of Earth as an immovable globe; while on its surface was a place that was changing. He had hypothesized that at one time the ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        " was a vast lake that covered the countries that surrounded it; and had only become connected to the ocean to the west when a passage had opened up sometime in its history.   In the second book is his discovery about the circumference of the Earth. This is where, according to Pliny, The world was grasped. Here Eratosthenes described his famous story of the well in Syene, wherein at noon each summer solstice, the Suns rays shone straight down into the city-center well  . This book would now be considered a text on ": null
    },
    {
        "mathematical geography": "mathematical geography"
    },
    {
        ".   His third book of the Geography contained ": null
    },
    {
        "political geography": "political geography"
    },
    {
        ". He cited countries and used parallel lines to divide the map into sections, to give accurate descriptions of the realms. This was a breakthrough, and can be considered the beginning of geography. For this, Eratosthenes was named the Father of Modern Geography.       Eratosthenes was described by the ": null
    },
    {
        "Suda Lexicon": "suda lexicon"
    },
    {
        " as a Πένταθλος which can be translated as All-Rounder , for he was skilled in a variety of things: He was a true polymath. He was nicknamed Beta because he was great at many things and tried to get his hands on every bit of information but never achieved the highest rank in anything; ": null
    },
    {
        "Strabo": "strabo"
    },
    {
        " accounts Eratosthenes as a mathematician among geographers and a geographer among mathematicians.   ": null
    },
    {
        "Eusebius of Caesarea": "eusebius of caesarea"
    },
    {
        " in his  Preparatio Evangelica  includes a brief chapter of three sentences on celestial distances . He states simply that Eratosthenes found the distance to the Sun to be   and the distance to the Moon to be 42 stadia. The expression for the distance to the Sun has been translated either as 42,42 stadia , or as 42,42 stadia . The meaning depends on whether Eusebius meant 42 myriad plus 42 or 42 and 42 myriad. With a stade of , 42,42 stadia is , approximately the distance from the Earth to the Sun.   Eratosthenes also calculated the Suns diameter. According to Macrobious, Eratosthenes made the diameter of the Sun to be about 42 times that of the Earth. The actual figure is approximately 42 times.   During his time at the Library of Alexandria, Eratosthenes devised a calendar using his predictions about the ": null
    },
    {
        "ecliptic": "ecliptic"
    },
    {
        " of the Earth. He calculated that there are 42 days in a year and that every fourth year there would be 42 days.   He was also very proud of his solution for ": null
    },
    {
        "Doubling the Cube": "doubling the cube"
    },
    {
        ". His motivation was that he wanted to produce catapults. Eratosthenes constructed a mechanical line drawing device to calculate the cube, called the mesolabio. He dedicated his solution to King Ptolemy, presenting a model in bronze with it a letter and an epigram. Archimedes was Eratosthenes friend and he, too, worked on the war instrument with mathematics. Archimedes dedicated his book The Method to Eratosthenes, knowing his love for learning and mathematics.               Eratosthenes proposed a simple ": null
    },
    {
        "algorithm": "algorithm"
    },
    {
        " for finding ": null
    },
    {
        "prime numbers": "prime numbers"
    },
    {
        ". This algorithm is known in mathematics as the ": null
    },
    {
        "Sieve of Eratosthenes": "sieve of eratosthenes"
    },
    {
        ".     In mathematics, the sieve of Eratosthenes , one of a number of ": null
    },
    {
        "prime number sieves": "generating primesprime sieves"
    },
    {
        ", is a simple, ancient algorithm for finding all prime numbers up to any given limit. It does so by iteratively marking as composite, i.e., not prime, the multiples of each prime, starting with the multiples of 42 The multiples of a given prime are generated starting from that prime, as a sequence of numbers with the same difference, equal to that prime, between consecutive numbers. This is the sieves key distinction from using trial division to sequentially test each candidate number for divisibility by each prime.       Eratosthenes was one of the most pre-eminent scholarly figures of his time, and produced works covering a vast area of knowledge before and during his time at the Library. He wrote on many topics  — geography, mathematics, philosophy, chronology, literary criticism, grammar, poetry, and even old comedies. Unfortunately, there are only fragments left of his works after the ": null
    },
    {
        "destruction of the Library of Alexandria": "destruction of the library of alexandria"
    },
    {
        ".       Platonikos Hermes Erigone Chronographies Olympic Victors Περὶ τῆς ἀναμετρήσεως τῆς γῆς     Гεωγραϕικά     Arsinoe    Ariston ; lost; quoted by ": null
    },
    {
        "Athenaeus": "athenaeus"
    },
    {
        " in the  Deipnosophistae Katasterismoi": null
    }
]