[
    {
        "           Erectile dysfunction , also known as impotence, is a type of ": null
    },
    {
        "sexual dysfunction": "sexual dysfunction"
    },
    {
        " characterized by the inability to develop or maintain an ": null
    },
    {
        "erection": "erection"
    },
    {
        " of the ": null
    },
    {
        "penis": "human penis"
    },
    {
        " during ": null
    },
    {
        "sexual activity": "human sexual activity"
    },
    {
        ". ED can have psychological consequences as it can be tied to relationship difficulties and ": null
    },
    {
        "self-image": "self-image"
    },
    {
        ".       A physical cause can be identified in about 80% of cases. These include ": null
    },
    {
        "cardiovascular disease": "cardiovascular disease"
    },
    {
        ", ": null
    },
    {
        "diabetes mellitus": "diabetes mellitus"
    },
    {
        ", neurological problems such as following ": null
    },
    {
        "prostatectomy": "prostatectomy"
    },
    {
        ", ": null
    },
    {
        "hypogonadism": "hypogonadism"
    },
    {
        ", and ": null
    },
    {
        "drug side effects": "adverse drug reaction"
    },
    {
        ". ": null
    },
    {
        "Psychological": "psychology"
    },
    {
        " impotence is where erection or penetration fails due to thoughts or feelings; this is somewhat less frequent, in the order of about 10% of cases. In psychological impotence, there is a strong ": null
    },
    {
        "response to placebo treatment": "placebo effect"
    },
    {
        ". The term erectile dysfunction is not used for other disorders of erection, such as ": null
    },
    {
        "priapism": "priapism"
    },
    {
        ".       Treatment involves addressing the underlying causes, lifestyle modifications, and addressing psychosocial issues. In many cases, a trial of pharmacological therapy with a ": null
    },
    {
        "PDE5 inhibitor": "pde5 inhibitor"
    },
    {
        ", such as ": null
    },
    {
        "sildenafil": "sildenafil"
    },
    {
        ", can be attempted. In some cases, treatment can involve inserting ": null
    },
    {
        "prostaglandin": "prostaglandin"
    },
    {
        " pellets into the ": null
    },
    {
        "urethra": "urethra"
    },
    {
        ", injecting smooth muscle relaxants and vasodilators into the penis, a ": null
    },
    {
        "penile prosthesis": "penile prosthesis"
    },
    {
        ", a ": null
    },
    {
        "penis pump": "penis pump"
    },
    {
        ", or ": null
    },
    {
        "vascular reconstructive surgery": "vascular surgery"
    },
    {
        ".  It is the most common sexual problem in men. Cunningham GR, Rosen RC. Overview of male sexual dysfunction. In: UpToDate, Martin KA , UpToDate, Waltham, MA, 2018.       ED is characterized by the regular or repeated inability to achieve or maintain an ": null
    },
    {
        "erection": "erection"
    },
    {
        " of sufficient rigidity to accomplish sexual activity. It is defined as the persistent or recurrent inability to achieve and maintain a penile erection of sufficient rigidity to permit satisfactory sexual activity for at least 3 months. Chowdhury SH, Cozma AI, Chowdhury JH. Erectile Dysfunction. Essentials for the Canadian Medical Liscensing Exam: Review and Prep for MCCQE Part I. 2nd edition. Wolters Kluwer. Hong Kong. 2017.       ED often has an impact on the emotional well-being of both men and their partners. Many men do not seek treatment due to feelings of embarrassment. About 75% of diagnosed cases of ED go untreated.        Causes of or contributors to ED include the following:   Prescription drugs    Neurogenic disorders     Cavernosal disorders     ": null
    },
    {
        "Hyperprolactinemia": "hyperprolactinemia"
    },
    {
        "    Psychological causes: ": null
    },
    {
        "performance anxiety": "stage fright"
    },
    {
        ", ": null
    },
    {
        "stress": "stress"
    },
    {
        ", and ": null
    },
    {
        "mental disorders": "mental disorders"
    },
    {
        "    Surgery     ": null
    },
    {
        "Aging": "aging"
    },
    {
        ": It is four times more common in men aged in their 60s than those in their 40s.    ": null
    },
    {
        "Kidney failure": "kidney failure"
    },
    {
        " smoking": "smoking"
    },
    {
        ", which is a key risk factor for ED as it promotes ": null
    },
    {
        "arterial narrowing": "atherosclerosis"
    },
    {
        ".        Surgical intervention for a number of conditions may remove anatomical structures necessary to erection, damage nerves, or impair blood supply. ED is a common complication of treatments for prostate cancer, including ": null
    },
    {
        "prostatectomy": "prostatectomy"
    },
    {
        " and destruction of the ": null
    },
    {
        "prostate": "prostate"
    },
    {
        " by ": null
    },
    {
        "external beam radiation": "external beam radiation"
    },
    {
        ", although the prostate gland itself is not necessary to achieve an erection. As far as inguinal hernia surgery is concerned, in most cases, and in the absence of postoperative complications, the operative repair can lead to a recovery of the sexual life of people with preoperative sexual dysfunction, while, in most cases, it does not affect people with a preoperative normal sexual life.      ED can also be associated with bicycling due to both neurological and vascular problems due to compression.  The increase risk appears to be about 1.7-fold.      Concerns that use of pornography can cause ED  have little support in epidemiological studies, according to a 2015 literature review.        Penile erection is managed by two mechanisms: the reflex erection, which is achieved by directly touching the penile shaft, and the psychogenic erection, which is achieved by erotic or emotional stimuli. The former uses the peripheral nerves and the lower parts of the spinal cord, whereas the latter uses the ": null
    },
    {
        "limbic system": "limbic system"
    },
    {
        " of the ": null
    },
    {
        "brain": "human brain"
    },
    {
        ". In both cases, an intact neural system is required for a successful and complete erection. Stimulation of the penile shaft by the ": null
    },
    {
        "nervous system": "nervous system"
    },
    {
        " leads to the secretion of ": null
    },
    {
        "nitric oxide": "nitric oxide"
    },
    {
        " , which causes the relaxation of smooth muscles of ": null
    },
    {
        "corpora cavernosa": "corpus cavernosum penis"
    },
    {
        " , and subsequently penile erection. Additionally, adequate levels of ": null
    },
    {
        "testosterone": "testosterone"
    },
    {
        "  and an intact ": null
    },
    {
        "pituitary gland": "pituitary gland"
    },
    {
        " are required for the development of a healthy erectile system. As can be understood from the mechanisms of a normal erection, impotence may develop due to hormonal deficiency, disorders of the neural system, lack of adequate penile blood supply or psychological problems.  ": null
    },
    {
        "Spinal cord injury causes sexual dysfunction": "sexuality after spinal cord injury"
    },
    {
        " including ED. Restriction of blood flow can arise from impaired ": null
    },
    {
        "endothelial": "endothelial"
    },
    {
        " function due to the usual causes associated with ": null
    },
    {
        "coronary artery disease": "coronary artery disease"
    },
    {
        ", but can also be caused by ": null
    },
    {
        "prolonged exposure to bright light": "over-illumination"
    },
    {
        ".       In many cases, the diagnosis can be made based on the persons history of symptoms. In other cases, a physical examination and ": null
    },
    {
        "laboratory investigations": "blood test"
    },
    {
        " are done to rule out more serious causes such as ": null
    },
    {
        "hypogonadism": "hypogonadism"
    },
    {
        " or ": null
    },
    {
        "prolactinoma": "prolactinoma"
    },
    {
        ".     One of the first steps is to distinguish between physiological and psychological ED. Determining whether involuntary erections are present is important in eliminating the possibility of psychogenic causes for ED. Obtaining full erections occasionally, such as ": null
    },
    {
        "nocturnal penile tumescence": "nocturnal penile tumescence"
    },
    {
        " when asleep , tends to suggest that the physical structures are functionally working.   Similarly, performance with ": null
    },
    {
        "manual stimulation": "masturbation"
    },
    {
        ", as well as any performance anxiety or acute situational ED, may indicate a psychogenic component to ED.     Other factors leading to ED are ": null
    },
    {
        "diabetes mellitus": "diabetes mellitus"
    },
    {
        ", which is a well-known cause of ": null
    },
    {
        "neuropathy": "neuropathy"
    },
    {
        "sambiguati": "sambiguati"
    },
    {
        "DSM-IV": "dsm-iv"
    },
    {
        "ro": "ro"
    },
    {
        "see imagee.g., those with sickle cell anemia2 mgsee image below": null
    }
]