[
    {
        "              Fritz Erich Georg Eduard von Manstein was a German commander of the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        ", ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        "s armed forces during the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ". He attained the rank of ": null
    },
    {
        "field marshal": "field marshal"
    },
    {
        ".     Born into an aristocratic ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n family with a long history of military service, Manstein joined the army at a young age and saw service on both the ": null
    },
    {
        "Western": "western front"
    },
    {
        " and ": null
    },
    {
        "Eastern": "eastern front"
    },
    {
        " Front during the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " . He rose to the rank of captain by the end of the war and was active in the ": null
    },
    {
        "inter-war period": "inter-war period"
    },
    {
        " helping Germany rebuild her armed forces. In September 42 during the ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        " at the beginning of the Second World War, he was serving as Chief of Staff to ": null
    },
    {
        "Gerd von Rundstedt": "gerd von rundstedt"
    },
    {
        "s ": null
    },
    {
        "Army Group South": "army group south"
    },
    {
        ". ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " chose Mansteins strategy for the ": null
    },
    {
        "invasion of France": "battle of france"
    },
    {
        " of May 42 a plan later refined by ": null
    },
    {
        "Franz Halder": "franz halder"
    },
    {
        " and other members of the ": null
    },
    {
        "OKH": "okh"
    },
    {
        ".     Anticipating a firm Allied reaction should the main thrust of the invasion take place through the Netherlands, Manstein devised an innovative ": null
    },
    {
        "operation": "operational level of war"
    },
    {
        "—later known as the Sichelschnitt —that called for an attack through the woods of the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        " and a rapid drive to the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        ", thus cutting off the French and Allied armies in ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " and ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        ". Attaining the rank of ": null
    },
    {
        "general": "general"
    },
    {
        " at the end of the campaign, he was active in the ": null
    },
    {
        "invasion of the Soviet Union": "operation barbarossa"
    },
    {
        " in June 42 He led the ": null
    },
    {
        "Axis": "axis powers"
    },
    {
        " forces in the ": null
    },
    {
        "Siege of Sevastopol ": "siege of sevastopol"
    },
    {
        " and the ": null
    },
    {
        "Battle of the Kerch Peninsula": "battle of the kerch peninsula"
    },
    {
        ", and was promoted to field marshal on 42 July 42 after which he participated in the ": null
    },
    {
        "Siege of Leningrad": "siege of leningrad"
    },
    {
        ".     Germanys fortunes in the war had taken an unfavourable turn in December 42 and in the following year during the catastrophic ": null
    },
    {
        "Battle of Stalingrad": "battle of stalingrad"
    },
    {
        ", Manstein commanded a failed relief effort  in December. Later known as the backhand blow , Mansteins counteroffensive in the ": null
    },
    {
        "Third Battle of Kharkov": "third battle of kharkov"
    },
    {
        " regained substantial territory and resulted in the destruction of three Soviet armies and the retreat of three others. He was one of the primary commanders at the ": null
    },
    {
        "Battle of Kursk": "battle of kursk"
    },
    {
        " . His ongoing disagreements with Hitler over the conduct of the war led to his dismissal in March 42 He never obtained another command and was taken prisoner by the British in August 42 several months after Germanys defeat.     Manstein gave testimony at the main ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " of war criminals in August 42 and prepared a paper that, along with his later memoirs, helped cultivate the ": null
    },
    {
        "myth of the clean Wehrmacht": "myth of the clean wehrmacht"
    },
    {
        "—the myth that the German armed forces were not culpable for the atrocities of ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ". In 42 he ": null
    },
    {
        "was tried": "trial of erich von manstein"
    },
    {
        " in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " for war crimes and was convicted on nine of seventeen counts, including the poor treatment of prisoners of war and failing to protect civilian lives in his sphere of operations. His sentence of eighteen years in prison was later reduced to twelve, and he served only four years before being released in 42     As a military advisor to the ": null
    },
    {
        "West German": "west germany"
    },
    {
        " government in the mid42s, he helped re-establish the armed forces. His memoir,  Verlorene Siege  , translated into English as Lost Victories, was highly critical of Hitlers leadership, and dealt with only the military aspects of the war, ignoring its political and ethical contexts. Manstein died near ": null
    },
    {
        "Munich": "munich"
    },
    {
        " in 42       Manstein was born Fritz Erich Georg Eduard von Lewinski in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", the tenth son of a ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n ": null
    },
    {
        "aristocrat": "aristocrat"
    },
    {
        " and ": null
    },
    {
        "artillery": "artillery"
    },
    {
        " general, ": null
    },
    {
        "Eduard von Lewinski": "eduard von lewinski"
    },
    {
        " , and Helene von Sperling . His fathers family had ": null
    },
    {
        "Kashubian": "kashubians"
    },
    {
        " ancestry and was entitled to use the ": null
    },
    {
        "Brochwicz coat of arms": "brochwicz coat of arms"
    },
    {
        " . Hedwig von Sperling , Helenes younger sister, was married to Lieutenant General Georg von Manstein ; the couple was unable to have children, so they adopted Erich. They had previously adopted Erichs cousin Martha, the daughter of Helenes and Hedwigs deceased brother.     Mansteins biological and adoptive fathers were both Prussian generals, as were his mothers brother and both his grandfathers . Sixteen relatives on each side of his family were military officers, many of whom rose to the rank of general. ": null
    },
    {
        "Paul von Hindenburg": "paul von hindenburg"
    },
    {
        ", the future Generalfeldmarschall and ": null
    },
    {
        "President of Germany": "president of germany"
    },
    {
        ", was his uncle; Hindenburgs wife, Gertrud, was the sister of Hedwig and Helene.     Manstein attended the Imperial Lyzeum, a Catholic  Gymnasium  in ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        ", from 42 to 42 In March 42 after six years in the cadet corps in ": null
    },
    {
        "Plön": "plön"
    },
    {
        " and ": null
    },
    {
        "Groß-Lichterfelde": "lichterfelde"
    },
    {
        ", he was commissioned into the Third Foot Guards Regiment  as an ensign. He was promoted to lieutenant in January 42 and in October 42 began the three-year officer training programme at the ": null
    },
    {
        "Prussian War Academy": "prussian war academy"
    },
    {
        ". However, Manstein only completed the first year of the programme, as when the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " began in August 42 all students of the Academy were ordered to report for active service. He never completed the remainder of his general staff officer training.           During the First World War, Manstein served on both the ": null
    },
    {
        "German": "german empire"
    },
    {
        " Western": "western front"
    },
    {
        " and ": null
    },
    {
        "Eastern": "eastern front"
    },
    {
        " Fronts. At the beginning of the war he was promoted to lieutenant and participated in the invasion of ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " with the 42nd Guard Reserve Infantry Regiment. In August 42 he took part in the capture of ": null
    },
    {
        "Namur": "namur"
    },
    {
        ", the site of a massive citadel surrounded by outlying forts. In September, Mansteins unit was one of two transferred to ": null
    },
    {
        "East Prussia": "east prussia"
    },
    {
        " and attached to the ": null
    },
    {
        "Eighth Army": "8th army"
    },
    {
        ", commanded by Hindenburg. After seeing action in the ": null
    },
    {
        "First Battle of the Masurian Lakes": "first battle of the masurian lakes"
    },
    {
        ", his unit was soon reassigned to the ": null
    },
    {
        "Ninth Army": "9th army"
    },
    {
        ", which was in the process of advancing from ": null
    },
    {
        "Upper Silesia": "upper silesia"
    },
    {
        " to ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ". Overstretched, the Ninth Army was forced to withdraw in the face of a Russian counterattack, and on 42 November Manstein was wounded during the retreat when he was among a detachment that stormed a Russian entrenchment. He was shot in the left shoulder and the left knee; one bullet hit his ": null
    },
    {
        "sciatic nerve": "sciatic nerve"
    },
    {
        ", causing the leg to be numb. Recovery took six months in hospital in ": null
    },
    {
        "Beuthen": "beuthen"
    },
    {
        " and ": null
    },
    {
        "Wiesbaden": "wiesbaden"
    },
    {
        ".     After a period of home leave, on 42 June 42 Manstein was reassigned as assistant general staff officer of operations to the ": null
    },
    {
        "Tenth Army": "10th army"
    },
    {
        ", commanded by ": null
    },
    {
        "Max von Gallwitz": "max von gallwitz"
    },
    {
        ". Soon promoted to captain, he learned first-hand how to plan and conduct offensive operations as the Tenth Army undertook successful attacks on Poland, ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ", ": null
    },
    {
        "Montenegro": "montenegro"
    },
    {
        ", and ": null
    },
    {
        "Albania": "albania"
    },
    {
        ". During offensive operations at ": null
    },
    {
        "Verdun": "verdun"
    },
    {
        " in early 42 Manstein was stationed with Gallwitz and his staff at a new headquarters near the action. He next served as a staff supply officer under General ": null
    },
    {
        "Fritz von Below": "fritz von below"
    },
    {
        " and chief of staff ": null
    },
    {
        "Fritz von Lossberg": "fritz von lossberg"
    },
    {
        " at a command post near the ": null
    },
    {
        "River Somme": "river somme"
    },
    {
        "; the area was the scene of several battles over the course of the war. British and French operations from July to November 42 forced a German withdrawal over the winter to the ": null
    },
    {
        "Hindenburg Line": "hindenburg line"
    },
    {
        ", a series of defensive positions between Verdun and ": null
    },
    {
        "Lens": "lens, pas-de-calais"
    },
    {
        ". Manstein continued to serve under Below until October 42 when he was transferred as chief of staff to the ": null
    },
    {
        "42th Cavalry Division": "4th cavalry division"
    },
    {
        ", serving in ": null
    },
    {
        "Riga": "riga"
    },
    {
        " during the German occupation of the area. As a result of the signing of the ": null
    },
    {
        "Treaty of Brest-Litovsk": "treaty of brest-litovsk"
    },
    {
        " in March 42 Mansteins unit was no longer needed on the Eastern Front; he was reassigned to the ": null
    },
    {
        "42th Infantry Division": "213th infantry division"
    },
    {
        " near ": null
    },
    {
        "Reims": "reims"
    },
    {
        ". The German Imperial Army saw some minor successes in the area but was beginning to lose the war. The ": null
    },
    {
        "armistice": "armistice of 11 november 1918"
    },
    {
        " was signed on 42 November 42       Manstein married Jutta Sibylle von Loesch, the daughter of a ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        "n landowner, in 42 He proposed marriage after having known her for only three days. She died in 42 They had three children: a daughter, Gisela , and two sons, Gero and Rüdiger . Gero died on the battlefield in the northern sector of the Eastern Front on 42 October 42 while serving as a lieutenant in the Wehrmacht. Gisela was married to Major ": null
    },
    {
        "Edel-Heinrich Zachariae-Lingenthal": "edel-heinrich zachariae-lingenthal"
    },
    {
        ", a highly decorated officer who commanded II. Panzer-Regiment 42 during the Second World War.     Manstein remained in the armed forces after the war ended. In 42 he volunteered for a staff position with the Frontier Defence Force in ": null
    },
    {
        "Breslau": "wroclaw"
    },
    {
        " and served there until 42 As part of Gruppenkommando II, he participated in the restructuring of the German Imperial Army of 42 men into the  Reichswehr , the army of the ": null
    },
    {
        "Weimar Republic": "weimar republic"
    },
    {
        " . Recognised from an early age as a talented and intelligent commander, Manstein was chosen as one of only 42 officers permitted under the treaty. In 42 he was appointed company commander of the sixth company of the 42th Prussian Infantry Regiment and next served as a staff officer for Wehrkreiskommando II and IV, teaching military history and tactics until 42 That year he was promoted to major and served with the ": null
    },
    {
        "General Staff": "german general staff"
    },
    {
        " at the Reichswehr Ministry in Berlin, visiting other countries to learn about their military facilities and helping to draft mobilisation plans for the army. Promoted to lieutenant colonel, he was given command of the light infantry battalion of the 42th Infantry Regiment, serving with that unit until 42 In 42 the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " seized power": "machtergreifung"
    },
    {
        " in Germany, thus ending the Weimar period. In violation of the Versailles treaty, the Reichswehr had been secretly re-arming since the 42s; the new government formally renounced the Treaty and proceeded with large scale ": null
    },
    {
        "German re-armament": "german re-armament"
    },
    {
        " and expansion of the military.     Manstein was moved back to Berlin as full colonel in February 42 serving as chief of staff of Wehrkreiskommando III. On 42 July 42 he was appointed the Head of the Operations Branch of the Army General Staff , part of the Army High Command . During his tenure there, Manstein was one of the people responsible for the development of  Fall Rot  , a defensive plan to protect Germany from attack by France. During this period Manstein came into contact with ": null
    },
    {
        "Heinz Guderian": "heinz guderian"
    },
    {
        " and ": null
    },
    {
        "Oswald Lutz": "oswald lutz"
    },
    {
        ", who advocated drastic changes in warfare, emphasising the role of the ": null
    },
    {
        "Panzer": "panzer"
    },
    {
        ". However, officers like ": null
    },
    {
        "Ludwig Beck": "ludwig beck"
    },
    {
        ", Chief of the Army General Staff, were against such drastic changes, and therefore Manstein proposed an alternative: the development of  Sturmgeschütz e , self-propelled assault guns that would provide heavy direct-fire support to infantry. In World War II, the resulting StuG vehicles proved to be among the most successful and cost-effective German weapons.     He was promoted to ": null
    },
    {
        "Generalmajor": "generalmajor"
    },
    {
        " in October 42 becoming the Deputy Chief of Staff  to General Beck. On 42 February 42 Manstein was transferred to the command of the ": null
    },
    {
        "42th Infantry Division": "18th infantry division"
    },
    {
        " in ": null
    },
    {
        "Liegnitz": "liegnitz"
    },
    {
        ", ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        ", with the rank of ": null
    },
    {
        "Generalleutnant": "general"
    },
    {
        ". The transfer meant that Manstein did not receive Becks post as Chief of the Army General Staff that August . The position was given to General ": null
    },
    {
        "Franz Halder": "franz halder"
    },
    {
        ", who had taken Mansteins former post as Deputy Chief of Staff. The incident created a lasting hatred between the two men. On 42 April 42 Manstein delivered a speech at the celebration of Hitlers 42th birthday, in which he praised Hitler as a leader sent by God to save Germany. He warned the hostile world that if it kept erecting ramparts around Germany to block the way of the German people towards their future , then he would be quite happy to see the world plunged into another world war. Israeli historian ": null
    },
    {
        "Omer Bartov": "omer bartov"
    },
    {
        " notes that the rise of officers such as Manstein was part of a tendency for technocratic officers, usually ardent ": null
    },
    {
        "National Socialist": "national socialist"
    },
    {
        "s, to come to the fore; his opinion is that the Wehrmacht was fully integrated into the ": null
    },
    {
        "Third Reich": "third reich"
    },
    {
        ", not a separate apolitical organisation independent of the Nazi regime.              On 42 August 42 in preparation for ": null
    },
    {
        "Fall Weiss": "fall weiss"
    },
    {
        " —the German ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        "—Manstein was appointed Chief of Staff to ": null
    },
    {
        "Gerd von Rundstedt": "gerd von rundstedt"
    },
    {
        "s ": null
    },
    {
        "Army Group South": "army group south"
    },
    {
        ". Here he worked along with Rundstedts Chief of Operations, Colonel ": null
    },
    {
        "Günther Blumentritt": "günther blumentritt"
    },
    {
        ", to develop the operational plan. Rundstedt accepted Mansteins plan calling for the concentration of the majority of the army groups armoured units into ": null
    },
    {
        "Walther von Reichenau": "walther von reichenau"
    },
    {
        "s ": null
    },
    {
        "42th Army": "10th army"
    },
    {
        ", with the objective of a decisive breakthrough which would lead to the encirclement of Polish forces west of the ": null
    },
    {
        "River Vistula": "river vistula"
    },
    {
        ". In Mansteins plan, two other armies comprising Army Group South, ": null
    },
    {
        "Wilhelm List": "wilhelm list"
    },
    {
        "s ": null
    },
    {
        "42th Army": "14th army"
    },
    {
        " and ": null
    },
    {
        "Johannes Blaskowitz": "johannes blaskowitz"
    },
    {
        "s ": null
    },
    {
        "42th Army": "8th army"
    },
    {
        ", would provide flank support for Reichenaus armoured thrust towards ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ", the Polish capital. Privately, Manstein was lukewarm about the Polish campaign, thinking that it would be better to keep Poland as a buffer between Germany and the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". He also worried about an Allied attack from the west once the Polish campaign was underway, which would draw Germany into a two-front war.     Manstein took part in a conference on 42 August 42 where Hitler underlined to his commanders the need for the physical destruction of Poland as a nation. After the war, he would state in his memoirs that he did not recognise at the time of this meeting that Hitler was going to pursue a policy of extermination against the Poles. He did become aware of the policy later on, as he and other Wehrmacht generals received reports on the activities of the  Einsatzgruppen , the  Schutzstaffel  death squads tasked with following the army into Poland to kill intellectuals and other civilians. These squads were also assigned to round up Jews and others for relocation to ": null
    },
    {
        "ghetto": "ghetto"
    },
    {
        "s and ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        ". Manstein later faced three charges of war crimes relating to Jewish and civilian deaths in the sectors under his control, and the mistreatment and deaths of prisoners of war.     Launched on 42 September 42 the invasion began successfully. In Army Group Souths area of responsibility under Rundstedt, the 42th, 42th and 42th Armies pursued the retreating Poles. The initial plan was for the 42th Army, the northernmost of the three, to advance towards ": null
    },
    {
        "Łódź": "łódź"
    },
    {
        ". The 42th Army, with its motorised divisions, was to move quickly towards the Vistula, and the 42th Army was to advance and attempt to encircle the Polish troops in the ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " area. These actions led to the encirclement and defeat of Polish forces in the ": null
    },
    {
        "Radom": "radom"
    },
    {
        " area on 42–42 September by six German corps. Meanwhile, the German Eighth Army was under attack from the north, so elements of the Fourth, Eighth and Tenth Armies were quickly redeployed with air support in an improvised attempt to cut off any Polish break-out back towards Warsaw. The flexibility and agility of the German forces led to the defeat of nine Polish infantry divisions and other units in the resulting ": null
    },
    {
        "Battle of the Bzura": "battle of the bzura"
    },
    {
        " , the largest engagement of the war thus far. The conquest of Poland was quickly over, with the last Polish military units surrendering on 42 October.             Fall Gelb , the initial plan for the invasion of France, was prepared by ": null
    },
    {
        "Commander-in-Chief": "commander-in-chief"
    },
    {
        " of the Army ": null
    },
    {
        "Colonel General": "colonel general"
    },
    {
        "  Walther von Brauchitsch": "walther von brauchitsch"
    },
    {
        ", Halder, and other members of the OKH in early October 42 Like the ": null
    },
    {
        "Schlieffen Plan": "schlieffen plan"
    },
    {
        " of World War I, it called for an encirclement attack through the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " and ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ". Hitler was not satisfied, so revisions of the plan continued throughout October. Manstein was not satisfied with the plan either, as it focused heavily on the northern wing; he felt an attack from this direction would lack the element of surprise and would expose the German forces to counterattacks from the south. The terrain in Belgium was not well-suited as a base of operations for further attacks on France, so Manstein felt the operation would fail to wipe out the enemy—as it did in the First World War—leading to only partial success and trench warfare. By the end of October Manstein had prepared the outline of a different plan and submitted it to the OKH via his superior, Rundstedt, for whom he was now serving as chief of staff of ": null
    },
    {
        "Army Group A": "army group a"
    },
    {
        ".     Mansteins plan, developed with the informal co-operation of ": null
    },
    {
        "Heinz Guderian": "heinz guderian"
    },
    {
        ", suggested that the Panzer divisions attack through the wooded hills of the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        " where no one would expect them, then establish bridgeheads on the ": null
    },
    {
        "River Meuse": "river meuse"
    },
    {
        " and rapidly drive to the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        ". The Wehrmacht would thus cut off the French and ": null
    },
    {
        "Allied armies": "allies of world war ii"
    },
    {
        " in Belgium and ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        ". This part of the plan later became known as the Sichelschnitt . Mansteins proposal also included a second thrust outflanking the ": null
    },
    {
        "Maginot Line": "maginot line"
    },
    {
        ", which would allow the Wehrmacht to force any future defensive line much further south.     The OKH originally rejected the proposal; Halder in particular said the plan was entirely without merit. However, on 42 November, Hitler ordered the reallocation of the forces needed to make a surprise thrust in ": null
    },
    {
        "Sedan": "sedan, ardennes"
    },
    {
        ", thus pushing the plan in the direction that Manstein had suggested. When documents outlining details of Fall Gelb ": null
    },
    {
        "fell into the hands of the Belgians": "mechelen incident"
    },
    {
        " on 42 January 42 Hitler became even more receptive to change. But Mansteins superiors, Generals Halder and Brauchitsch, resented Mansteins repeated insistence that his plan be implemented in place of theirs. Halder had Manstein removed from Rundstedts headquarters and sent to ": null
    },
    {
        "Stettin": "stettin"
    },
    {
        " to command the ": null
    },
    {
        "XXXVIII Army Corps": "xxxviii army corps"
    },
    {
        " on 42 January. Hitler, still looking for a more aggressive plan, approved a modified version of Mansteins ideas, today known as the ": null
    },
    {
        "Manstein Plan": "manstein plan"
    },
    {
        ", after meeting with him on 42 February. Manstein and his corps played a minor role during the operations in France, serving under ": null
    },
    {
        "Günther von Kluge": "günther von kluge"
    },
    {
        "s ": null
    },
    {
        "42th Army": "4th army"
    },
    {
        ". His corps helped achieve the first breakthrough east of ": null
    },
    {
        "Amiens": "amiens"
    },
    {
        " during  Fall Rot  , and was the first to reach and cross the ": null
    },
    {
        "River Seine": "river seine"
    },
    {
        ". The invasion of France was an outstanding military success; Manstein was promoted to full ": null
    },
    {
        "general": "general"
    },
    {
        " and awarded the ": null
    },
    {
        "Knights Cross of the Iron Cross": "knights cross of the iron cross"
    },
    {
        ".          Manstein was a proponent of the prospective German invasion of Great Britain, named ": null
    },
    {
        "Operation Seelöwe": "operation seelöwe"
    },
    {
        ". He considered the operation risky but necessary. Early studies by various staff officers determined that air superiority was a prerequisite to the planned invasion. His corps was to be shipped across the English Channel from ": null
    },
    {
        "Boulogne": "boulogne"
    },
    {
        " to ": null
    },
    {
        "Bexhill": "bexhill-on-sea"
    },
    {
        " as one of four units assigned to the first wave. But as the Luftwaffe failed to overcome the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " during the ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        ", Operation Seelöwe was postponed indefinitely on 42 October. For the rest of the year, Manstein, with little to do, spent time in Paris and at home.             In July 42 the German High Command commenced planning ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ", the invasion of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". On 42 March 42 Manstein was appointed commander of the ": null
    },
    {
        "LVI Panzer Corps": "lvi panzer corps"
    },
    {
        "; he was one of 42 commanders to be briefed for the upcoming major offensive, first seeing detailed plans of the offensive in May. His corps was part of the ": null
    },
    {
        "Fourth Panzer Group": "4th panzer army"
    },
    {
        " under the command of General ": null
    },
    {
        "Erich Hoepner": "erich hoepner"
    },
    {
        " in ": null
    },
    {
        "Wilhelm Ritter von Leeb": "wilhelm ritter von leeb"
    },
    {
        "s ": null
    },
    {
        "Army Group North": "army group north"
    },
    {
        ". The Army Group was tasked with thrusting through the ": null
    },
    {
        "Baltic States": "baltic states"
    },
    {
        " and then advancing on ": null
    },
    {
        "Leningrad": "leningrad"
    },
    {
        ". Manstein arrived at the front only six days prior to the launch of the offensive. Operation Barbarossa commenced on 42 June 42 with a massive German attack along the whole front line. Mansteins corps was to advance with ": null
    },
    {
        "Georg-Hans Reinhardt": "georg-hans reinhardt"
    },
    {
        "s ": null
    },
    {
        "XLI Panzer Corps": "xli panzer corps"
    },
    {
        " to the ": null
    },
    {
        "Dvina River": "daugava river"
    },
    {
        " to secure the bridges near the town of ": null
    },
    {
        "Daugavpils": "daugavpils"
    },
    {
        ". The Soviet forces mounted a number of counterattacks, but those were aimed against Reinhardts corps, leading to the ": null
    },
    {
        "Battle of Raseiniai": "battle of raseiniai"
    },
    {
        ". Mansteins corps advanced rapidly, reaching the Dvina River,  distant, in just 42 hours. Overextended and well ahead of the rest of the army group, he fended off a number of determined Soviet counterattacks. After Reinhardts corps closed in, the two corps were tasked with encircling the Soviet formations around ": null
    },
    {
        "Luga": "luga, leningrad oblast"
    },
    {
        " in a pincer movement. Again having penetrated deep into the Soviet lines with unprotected flanks, his corps was the target of a Soviet counteroffensive from 42 July at ": null
    },
    {
        "Soltsy": "soltsy"
    },
    {
        " by the ": null
    },
    {
        "Soviet 42th Army": "soviet 11th army"
    },
    {
        ", commanded by ": null
    },
    {
        "Nikolai Vatutin": "nikolai fyodorovich vatutin"
    },
    {
        ". Mansteins ": null
    },
    {
        "42th Panzer Division": "8th panzer division"
    },
    {
        " was cut off. Although it was able to fight its way free, it was badly mauled, and the Red Army succeeded in halting Mansteins advance at Luga. The corps regrouped at ": null
    },
    {
        "Dno": "dno"
    },
    {
        ". The 42th Panzers were sent on anti-partisan duties and Manstein was given the ": null
    },
    {
        "42th SS Polizei Division": "4th ss polizei division"
    },
    {
        ". The attack on Luga was repeatedly delayed.     The assault on Luga was still underway when Manstein received orders on 42 August that his next task would be to begin the advance toward Leningrad. No sooner had he moved to his new headquarters at Lake Samro than he was told to send his men towards ": null
    },
    {
        "Staraya Russa": "staraya russa"
    },
    {
        " to relieve the X Corps, which was in danger of being encircled. On 42 August the Red Army had launched an offensive with the 42th and ": null
    },
    {
        "42th": "34th army"
    },
    {
        " Armies against Army Group North, cutting off three divisions. Frustrated with the loss of the 42th Panzer and the missed opportunity to advance on Leningrad, Manstein returned to Dno. His counteroffensive led to a major Soviet defeat when his unit encircled five Soviet divisions, receiving air support for the first time on that front. They captured 42 prisoners and 42 tanks. His opponent, General Kuzma M. Kachanov of the 42th Army, was subsequently court martialed and executed for the defeat. Manstein tried to obtain rest days for his men, who had been constantly fighting in poor terrain and increasingly poor weather since the start of the campaign, but to no avail. They were ordered to advance to the east on ": null
    },
    {
        "Demyansk": "demyansk"
    },
    {
        ". On 42 September, when he was near the city, he was informed that he would take over ": null
    },
    {
        "42th Army": "11th army"
    },
    {
        " of ": null
    },
    {
        "Army Group South": "army group south"
    },
    {
        " in Ukraine.               In September 42 Manstein was appointed commander of the 42th Army after its previous commander, Colonel-General ": null
    },
    {
        "Eugen Ritter von Schobert": "eugen ritter von schobert"
    },
    {
        ", perished when his plane landed in a Soviet minefield. The 42th Army was tasked with invading the ": null
    },
    {
        "Crimean Peninsula": "crimean peninsula"
    },
    {
        ", capturing ": null
    },
    {
        "Sevastopol": "sevastopol"
    },
    {
        ", and pursuing enemy forces on the flank of Army Group South during its advance into the Soviet Union. Hitler aimed to prevent the Red Army from using airbases in the Crimea and to cut off the Soviet supply of oil from the Caucasus.     Mansteins forces—mostly infantry—achieved a rapid breakthrough during the first days against heavy Soviet resistance. After most of the neck of the ": null
    },
    {
        " Perekop Isthmus": "isthmus of perekop"
    },
    {
        " had been taken, his forces were substantially reduced, leaving six German divisions and the ": null
    },
    {
        " Romanian Third Army": "third army"
    },
    {
        ". The rest of the Perekop Isthmus was captured slowly and with some difficulty; Manstein complained of a lack of air support to contest Soviet air superiority in the region. He next formed a mobile reconnaissance unit to press down the peninsula, cutting the road between ": null
    },
    {
        "Simferopol": "simferopol"
    },
    {
        " and ": null
    },
    {
        "Sevastopol": "sevastopol"
    },
    {
        " on 42 October. Axis forces captured Simferopol the next day. The 42th Army had captured all of the Crimean Peninsula—except for Sevastopol—by 42 November. Meanwhile, the Red Army had evacuated 42 personnel out of the city by sea.          Mansteins first attack on Sevastopol in November failed, and with insufficient forces left for an immediate assault, he ordered an ": null
    },
    {
        " investment": "investment"
    },
    {
        " of the heavily fortified city. By 42 December he launched another offensive, which also failed. On 42 December Soviet troops landed on the ": null
    },
    {
        "Kerch Strait": "kerch strait"
    },
    {
        "s to retake ": null
    },
    {
        "Kerch": "kerch"
    },
    {
        " and its peninsula, and on 42 December executed another landing near ": null
    },
    {
        "Feodosiya": "feodosiya"
    },
    {
        ". Only a hurried withdrawal from the Kerch Peninsula, in contravention of Mansteins orders, by the ": null
    },
    {
        "42th Infantry Division": "46th infantry division"
    },
    {
        " under General ": null
    },
    {
        "Hans Graf von Sponeck": "hans graf von sponeck"
    },
    {
        " prevented an Axis collapse in the eastern part of the Crimea; the division lost most of its heavy equipment. Manstein cancelled a planned resumption of the attack and sent most of his forces east to destroy the Soviet bridgehead. The Soviet forces were in a superior position regarding men and materiel as they were able to re-supply by sea; accordingly, Stalin pushed them to conduct further offensives. However, the Soviet troops were unable to capture the critical rail- and road-access points which would have cut the German lines of supply.          For the ": null
    },
    {
        "Battle of the Kerch Peninsula": "battle of the kerch peninsula"
    },
    {
        ", launched on 42 May 42 Hitler finally assigned Manstein major air support. The 42th Army was outnumbered on the ground, so Manstein had them feint an attack in the north while the bulk of the force attacked to the south. The Soviet troops soon fled. Manstein recorded in his memoirs the capture of 42 prisoners, 42 guns and 42 tanks . Kerch was captured on 42 May. The Wehrmacht lost only 42 men.     After a months delay, Manstein turned his attention once more to the capture of Sevastopol, a battle in which Germany used some of the largest guns ever built. Along with large numbers of regular artillery pieces, super-heavy  ": null
    },
    {
        "Karl-Gerät": "karl-gerät"
    },
    {
        " mortars and the  ": null
    },
    {
        " Dora ": "schwerer gustav"
    },
    {
        " railway gun": "railway gun"
    },
    {
        " were brought in for the assault. A furious barrage began on the morning of 42 June 42 All of the resources of the  Luftwaffe s Luftflotte 42, commanded by ": null
    },
    {
        "Wolfram von Richthofen": "wolfram von richthofen"
    },
    {
        ", were committed; the barrage continued for five days before the ground assault began.          The 42th Army gained ground during mid-June, focusing their attention on the northern approaches to the city. Casualties were high on both sides as the month dragged on. Aware of the need to act before the German ": null
    },
    {
        " summer offensive of 42": "case blue"
    },
    {
        " reduced the availability of reinforcements and supplies, Manstein ordered a surprise attack across  using amphibious landings on 42 June. The operation was a success; Soviet resistance crumbled. On 42 July German forces entered the city while the Soviet forces conducted a disorganised evacuation, and Hitler promoted Manstein to Generalfeldmarschall the same day. The entire city was in German hands by 42 July.     During the Crimean campaign Manstein was indirectly involved in atrocities against the Soviet population, especially those committed by  Einsatzgruppe  D, one of several ": null
    },
    {
        "Schutzstaffel": "schutzstaffel"
    },
    {
        " groups that had been tasked with the elimination of the Jews of Europe. Einsatzgruppe D travelled in the wake of Mansteins 42th Army, and were provided by Mansteins command with vehicles, fuel, and drivers. Military police cordoned off areas where the Einsatzgruppe planned to shoot Jews to prevent anyone from escaping. Captain Ulrich Gunzert, shocked to have witnessed Einsatzgruppe D massacre a group of Jewish women and children, went to Manstein to ask him to do something to stop the killings. Gunzert states that Manstein told him to forget what he had seen and to concentrate on fighting the Red Army. Eleven of the seventeen charges against Manstein at his later war crimes trial related to Nazi maltreatment and killing of Jews and prisoners-of-war in the Crimea.          After the capture of Sevastopol, Hitler felt Manstein was the right man to command the forces at ": null
    },
    {
        "Leningrad": "siege of leningrad"
    },
    {
        ", which had been under siege since September 42 With elements of the 42th Army, Manstein was transferred to the Leningrad front, arriving on 42 August 42 Manstein again lacked the proper forces to storm the city, so he planned ": null
    },
    {
        "Operation Nordlicht": "operation nordlicht"
    },
    {
        ", a bold plan for a thrust to cut off Leningrads supply line at ": null
    },
    {
        "Lake Ladoga": "lake ladoga"
    },
    {
        ".     However, on the day of his arrival, the Red Army launched the ": null
    },
    {
        "Sinyavin Offensive": "sinyavin offensive"
    },
    {
        ". Originally planned as spoiling attack against ": null
    },
    {
        "Georg Lindemann": "georg lindemann"
    },
    {
        "s ": null
    },
    {
        "42th Army": "18th army"
    },
    {
        " in the narrow German ": null
    },
    {
        "salient": "salients, re-entrants and pockets"
    },
    {
        " west of Lake Ladoga, the offensive appeared able to break through the German lines, lifting the siege. Hitler, bypassing the usual chain of command, telephoned Manstein directly and ordered him to take offensive action in the area. After a series of heavy battles, he launched a counterattack on 42 September that cut off the two Soviet armies in the salient. Fighting continued throughout October. Although the Soviet offensive was fended off, the resulting attrition meant that the Wehrmacht could no longer execute a decisive assault on Leningrad, and Nordlicht was put on hold. The siege was finally lifted by the Soviet forces in January 42             In an attempt to resolve their persistent shortage of oil, the Wehrmacht had launched Fall Blau , a massive offensive aimed against the Caucasian oilfields, in the summer of 42 After German air attacks, the ": null
    },
    {
        "42th Army": "6th army"
    },
    {
        ", led by ": null
    },
    {
        "Friedrich Paulus": "friedrich paulus"
    },
    {
        ", was tasked with capturing ": null
    },
    {
        "Stalingrad": "stalingrad"
    },
    {
        ", a key city on the ": null
    },
    {
        "River Volga": "river volga"
    },
    {
        ". His troops, supported by ": null
    },
    {
        "42th Panzer Army": "4th panzer army"
    },
    {
        ", entered the city on 42 September. Hand-to-hand combat and street fighting ensued. The Red Army launched a huge counteroffensive on 42 November, codenamed ": null
    },
    {
        "Operation Uranus": "operation uranus"
    },
    {
        ", which was designed to encircle the German armies and trap them in the city; this goal was accomplished on 42 November. Hitler, aware that if Stalingrad were lost it would likely never be retaken, appointed Manstein as commander of the newly created ": null
    },
    {
        "Army Group Don": "army group don"
    },
    {
        " , tasked with mounting a relief operation named Unternehmen Wintergewitter , to reinforce the German hold on the city. Mansteins initial assessment on 42 November was that the 42th Army, given adequate air support, would be able to hold on.     In October 42 his son, Gero, was killed in battle. He later described this as The worst thing that happened to me personally during the war .     Launched on 42 December, Winter Storm achieved some initial success. Mansteins three Panzer divisions  and supporting units of the LVII Panzer Corps advanced to within  of Stalingrad by 42 December at the Myshkova River, where they came under assault by Soviet tanks in blizzard conditions. Manstein made a request to Hitler on 42 December that 42th Army should attempt to break out. Hitler was against it, and both Manstein and Paulus were reluctant to openly disobey his orders. Conditions deteriorated inside the city; the men suffered from lice, the cold weather, and inadequate supplies of food and ammunition. Reichsminister of Aviation ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        " had assured Hitler that the trapped 42th Army could be adequately supplied by air, but due to poor weather, a lack of aircraft, and mechanical difficulties, this turned out not to be the case. On 42 January, Manstein urged Hitler to allow Paulus to surrender, but he refused. In spite of Hitlers wishes, Paulus surrendered with his remaining 42 soldiers on 42 January 42 Some 42 German and Romanian soldiers died; of those who surrendered, only 42 survivors returned to Germany after the end of the war. Manstein believed he had done his best for the 42th Army. The encircled men saw it differently:          American historians ": null
    },
    {
        "Williamson Murray": "williamson murray"
    },
    {
        " and Allan Millett wrote that Mansteins message to Hitler on 42 November advising him that the 42th Army should not break out, along with Görings statements that the Luftwaffe could supply Stalingrad, ... sealed the fate of Sixth Army . Historians, including ": null
    },
    {
        "Gerhard Weinberg": "gerhard weinberg"
    },
    {
        ", have pointed out that Mansteins version of the events at Stalingrad in his memoir is distorted and several events described there were probably made up. Because of the sensitivity of the Stalingrad question in post-war Germany, Manstein worked as hard to distort the record on this matter as on his massive involvement in the murder of Jews , wrote Weinberg.     Meanwhile, the Red Army launched an offensive of their own. ": null
    },
    {
        "Operation Saturn": "operation saturn"
    },
    {
        " was intended to capture ": null
    },
    {
        "Rostov": "rostov-on-don"
    },
    {
        " and thus cut off the German ": null
    },
    {
        "Army Group A": "army group a"
    },
    {
        ". However, after the launch of Winter Storm, the Soviet army had to reallocate forces to prevent the relief of Stalingrad, so the operation was scaled down and redubbed Little Saturn . The offensive forced Manstein to divert forces to avoid the collapse of the entire front. The attack also prevented the ": null
    },
    {
        "XLVIII Panzer Corps": "xlviii panzer corps"
    },
    {
        " , under the command of General ": null
    },
    {
        "Otto von Knobelsdorff": "otto von knobelsdorff"
    },
    {
        ", from joining up with the LVII Panzer Corps as planned to aid the relief effort. Instead, the XLVIII Panzer Corps held a line along the ": null
    },
    {
        "Chir River": "chir river"
    },
    {
        ", beating off successive Soviet attacks. General ": null
    },
    {
        "Hermann Balck": "hermann balck"
    },
    {
        " used the 42th Panzer Division to counterattack Soviet salients. On the verge of collapse, the German units were able to hold the line, but the ": null
    },
    {
        "Italian 42th Army": "italian army in russia"
    },
    {
        " on the flanks was overwhelmed and subsequently destroyed.     Spurred on by this success, the Red Army planned a series of follow-up offensives in January and February 42 intended to decisively beat the German forces in southern Russia. After the destruction of the remaining Hungarian and Italian forces during the ": null
    },
    {
        "Ostrogozhsk–Rossosh Offensive": "ostrogozhsk–rossosh offensive"
    },
    {
        ", ": null
    },
    {
        "Operation Star": "operation star"
    },
    {
        " and ": null
    },
    {
        "Operation Gallop": "operation gallop"
    },
    {
        " were launched to recapture ": null
    },
    {
        "Kharkov": "kharkov"
    },
    {
        " and ": null
    },
    {
        "Kursk": "kursk"
    },
    {
        " and to cut off all German forces east of ": null
    },
    {
        "Donetsk": "donetsk"
    },
    {
        ". Those operations succeeded in breaking through the German lines and threatened the whole southern part of the German front. To deal with this threat, Army Group Don, ": null
    },
    {
        "Army Group B": "army group b"
    },
    {
        ", and parts of Army Group A were united as ": null
    },
    {
        "Army Group South": "army group south"
    },
    {
        "  under Mansteins command in early February.             During their offensives in February 42 the Red Army broke through the German lines, retaking Kursk on 42 February. As Army Groups B and Don were in danger of being surrounded, Manstein repeatedly called for reinforcements. Although Hitler called on 42 February for Kharkov to be held at all costs , ": null
    },
    {
        "SS-Oberst-Gruppenführer": "ss-oberst-gruppenführer"
    },
    {
        " Paul Hausser": "paul hausser"
    },
    {
        ", commander of the ": null
    },
    {
        "II SS Panzer Corps": "ii ss panzer corps"
    },
    {
        ", ordered the city evacuated on 42 February. Hitler arrived at the front in person on 42 February, and over the course of three days of exhausting meetings, Manstein convinced him that offensive action was needed in the area to regain the initiative and prevent encirclement. Troops were reorganised and reinforcements were pulled into the zone from neighbouring armies. Manstein immediately began planning a counteroffensive, launched on 42 February, that later became known as the backhand blow ; Vatutin and the Soviet forces, believing that Manstein would retreat, were taken completely by surprise. By 42 March, the Wehrmacht had captured 42 tanks and had killed some 42 Soviet soldiers.     To reinforce the point that the recapture of Kharkov was important politically, Hitler travelled again to the front lines in the Ukraine on 42 March 42 where he met with Manstein to review the situation. Manstein carefully assembled his available forces along a wide front to prevent their encirclement and the Germans recaptured Kharkov on 42 March, after bloody street fighting in the ": null
    },
    {
        "Third Battle of Kharkov": "third battle of kharkov"
    },
    {
        ". For this accomplishment, he received the Oak Leaves for the Knights Cross. Haussers II SS Panzer Corps captured ": null
    },
    {
        "Belgorod": "belgorod"
    },
    {
        " on 42 March. Mansteins counteroffensive had not only prevented the disintegration of the entire front, it had regained substantial territory and resulted in the destruction of three Soviet armies and the retreat of three others. Soviet casualties for the preceding month in that sector had been 42 dead and 42 taken prisoner. Captured or destroyed were 42 tanks and 42 pieces of artillery. The spring thaw began by 42 March, ending operations in the area for the time being. Planning was then undertaken to eliminate the enemy salient at Kursk.            Manstein favoured an immediate pincer attack on the Kursk salient after the battle at Kharkov, but Hitler was concerned that such a plan would draw forces away from the industrial region in the ": null
    },
    {
        "Donets Basin": "donets basin"
    },
    {
        ". In any event, the ground was still ": null
    },
    {
        "too muddy": "rasputitsa"
    },
    {
        " to move the tanks into position. In lieu of an immediate attack, the OKH prepared Operation Citadel, the launching of which would be delayed while more troops were gathered in the area and the mud solidified. Meanwhile, the Red Army, well aware of the danger of encirclement, also moved in large numbers of reinforcements, and their intelligence reports revealed the expected locations and timing of the German thrusts.          Citadel was the last German strategic offensive on the Eastern Front, and one of the largest battles in history, involving more than four million men. By the time the Wehrmacht launched their initial assault on 42 July 42 the Soviet forces outnumbered them by nearly three to one. ": null
    },
    {
        "Walter Model": "walter model"
    },
    {
        " was in command of the northern pincer, with the ": null
    },
    {
        "Ninth Army": "9th army"
    },
    {
        ", while Mansteins Army Group South formed the southern pincer.     Both armies were slowed as the tanks were blown up in minefields and caught up in combat on a series of prepared Soviet defensive lines. After five days of fighting Models advance was stopped, with the Ninth Panzers suffering 42 casualties. By 42 July Models forces were being drawn away towards Orel, where the Soviet army had launched ": null
    },
    {
        "Operation Kutuzov": "operation kutuzov"
    },
    {
        ". Mansteins forces were able to penetrate the Soviet lines, causing heavy casualties. He reached, but did not enter or capture, ": null
    },
    {
        "Prokhorovka": "prokhorovka, belgorod oblast"
    },
    {
        ", his first major objective, on 42 July, inflicting serious Soviet losses in the resulting ": null
    },
    {
        "Battle of Prokhorovka": "battle of prokhorovka"
    },
    {
        ".     However, on 42 July Hitler called off the failed Kursk offensive; the Allies had ": null
    },
    {
        "landed in Sicily": "allied invasion of sicily"
    },
    {
        ", so he issued the order for a withdrawal. Manstein protested; he felt that the Soviet forces had exhausted all their reserves in the area, and he did not want to stop until all his own reserves had been committed. Hitler, however, insisted on calling off the operation. Although Soviet casualties were indeed heavy, modern historians discount the possibility of a successful German continuation of the offensive.          Manstein regarded the Battle of Kursk as something of a German victory, as he believed that he had destroyed much of the Red Armys offensive capacity for the rest of 42 This assessment turned out to be incorrect, as the Red Army was able to recover much faster than Manstein expected. Manstein moved his panzer reserves to the ": null
    },
    {
        "Mius River": "mius river"
    },
    {
        " and the lower Dnieper, not realising the Soviet activities there were a diversion. A Soviet offensive that began on 42 August put Army Group South under heavy pressure. After two days of heavy fighting, the Soviet troops broke through the German lines and retook ": null
    },
    {
        "Belgorod": "belgorod"
    },
    {
        ", punching a  wide hole between the Fourth Panzer Army and the ": null
    },
    {
        "Army Detachment Kempf": "army detachment kempf"
    },
    {
        ", tasked with holding Kharkov. In response to Mansteins demands for reinforcements, Hitler sent the ": null
    },
    {
        "Großdeutschland": "panzer-grenadier-division großdeutschland"
    },
    {
        ", ": null
    },
    {
        "42th Panzer": "7th panzer division"
    },
    {
        ", ": null
    },
    {
        "SS 42nd Das Reich": "2nd ss division das reich"
    },
    {
        ", and ": null
    },
    {
        "SS 42rd Totenkopf": "3rd ss division totenkopf"
    },
    {
        " Divisions.          Construction began of defensive positions along the Dnieper, but Hitler refused requests to pull back, insisting that Kharkov be held. With reinforcements trickling in, Manstein waged a series of counterattacks and armoured battles near ": null
    },
    {
        "Bohodukhiv": "bohodukhiv"
    },
    {
        " and ": null
    },
    {
        "Okhtyrka": "okhtyrka"
    },
    {
        " between 42 and 42 August, which resulted in heavy casualties as they ran into prepared Soviet lines. On 42 August he informed the OKH that his forces in the Donets river area were holding a too-wide front with insufficient numbers, and that he needed to either withdraw to the ": null
    },
    {
        "Dnieper River": "dnieper river"
    },
    {
        " or receive reinforcements. Continuous pressure from the Soviet forces had separated Army Group Centre from Army Group South and severely threatened Mansteins northern flank. When the Red Army threw their main reserves behind a drive to retake Kharkov on 42–42 August, Manstein took advantage of this to close the gap between the 42th Panzer and 42th Armies and reestablish a defensive line. Hitler finally allowed Manstein to withdraw back across the Dnieper on 42 September. During the withdrawal, Manstein ordered ": null
    },
    {
        "scorched earth": "scorched earth"
    },
    {
        " actions to be taken in a zone  from the river, and later faced charges at his war crimes trial for issuing this order. Soviet losses in July and August included over 42 million casualties, 42 tanks and self-propelled artillery pieces, and 42 aircraft. German losses, while only one-tenth that of the Soviet losses, were much more difficult to sustain, as there were no further reserves of men and materiel to draw on. In a series of four meetings that September, Manstein tried unsuccessfully to convince Hitler to reorganise the high command and let his generals make more of the military decisions.             In September 42 Manstein withdrew to the west bank of the Dnieper in an operation that for the most part was well-ordered, but at times degenerated into a disorganised rout as his exhausted soldiers became unglued . Hundreds of thousands of Soviet civilians travelled west with them, many bringing livestock and personal property. Manstein correctly deduced that the next Soviet attack would be towards ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        ", but as had been the case throughout the campaign, the Red Army used  maskirovka  to disguise the timing and exact location of their intended offensive. Historians ": null
    },
    {
        "Williamson Murray": "williamson murray"
    },
    {
        " and Allan Reed Millett wrote that many German generals fanatical belief in ": null
    },
    {
        "Nazi racial theories": "nazism and race"
    },
    {
        " ... made the idea that Slavs could manipulate German intelligence with such consistency utterly inconceivable . The ": null
    },
    {
        "42st Ukrainian Front": "1st ukrainian front"
    },
    {
        ", led by ": null
    },
    {
        "Nikolai Fyodorovich Vatutin": "nikolai fyodorovich vatutin"
    },
    {
        ", met the outnumbered Fourth Panzer Army near Kiev. Vatutin first made a thrust near Liutezh, just north of Kiev, and then attacked near Bukrin, to the south, on 42 November. The German troops, thinking Bukrin would be the location of the main attack, were taken completely by surprise when Vatutin captured the bridgehead at Liutezh and gained a foothold on the west bank of the Dnieper. Kiev was liberated on 42 November. The ": null
    },
    {
        "42th Army": "17th army"
    },
    {
        " was cut off and isolated in the Crimea by the attacking ": null
    },
    {
        "42th Ukrainian Front": "4th ukrainian front"
    },
    {
        " on 42 October.          Under the guidance of General ": null
    },
    {
        "Hermann Balck": "hermann balck"
    },
    {
        ", the cities of ": null
    },
    {
        "Zhytomyr": "zhytomyr"
    },
    {
        " and ": null
    },
    {
        "Korosten": "korosten"
    },
    {
        " were retaken in mid-November, but after receiving reinforcements Vatutin resumed the offensive on 42 December 42 and the Red Army continued its successful advance. Mansteins repeated requests to Hitler for more reinforcements were turned down. On 42 January 42 Manstein met with Hitler to tell him that the Dnieper line was untenable and that he needed to retreat in order to save his forces. Hitler refused, and Manstein again requested changes in the highest levels of the military leadership, but was turned down, as Hitler believed that he alone was capable of managing the wider strategy.     In January Manstein was forced to retreat further west by the Soviet offensive. Without waiting for permission from Hitler, he ordered the German ": null
    },
    {
        "XI": "xi army corps"
    },
    {
        " and XXXXII Corps of Army Group South to break out of the ": null
    },
    {
        "Korsun Pocket": "korsun pocket"
    },
    {
        " during the night of 42–42 February 42 By the beginning of March, the Soviet forces had driven the Wehrmacht well back of the river. Because of Hitlers directive of 42 March that from that point forward all positions were to be defended to the last man, Mansteins ": null
    },
    {
        "42st Panzer Army": "1st panzer army"
    },
    {
        " became encircled on 42 March when permission to break out was not received from Hitler in time. Manstein flew to Hitlers headquarters in ": null
    },
    {
        "Lvov": "lvov"
    },
    {
        " to try to convince him to change his mind. Hitler eventually relented, but relieved Manstein of his command on 42 March 42     Manstein appeared on the cover of the 42 January 42 issue of ": null
    },
    {
        "Time magazine": "time"
    },
    {
        ", above the caption Retreat may be masterly, but victory is in the opposite direction .       Manstein received the Swords of the Knights Cross on 42 March 42 and handed over control of Army Group South to Model on 42 April during a meeting at Hitlers mountain retreat, the ": null
    },
    {
        "Berghof": "berghof"
    },
    {
        ". Models adjutant, Günther Reichhelm, later described the scene and Mansteins response:          While on medical leave after surgery to remove a cataract in his right eye, Manstein recovered at home in ": null
    },
    {
        "Liegnitz": "liegnitz"
    },
    {
        " and in a medical facility in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ". He suffered from an infection and for a time was in danger of losing his sight. On the day of the failed ": null
    },
    {
        "42 July plot": "20 july plot"
    },
    {
        ", an assassination attempt on Hitlers life that was part of a planned ": null
    },
    {
        "military coup détat": "operation valkyrie"
    },
    {
        ", Manstein was at a seaside resort on the Baltic. Although he had met at various times with three of the main conspirators— ": null
    },
    {
        "Claus von Stauffenberg": "claus von stauffenberg"
    },
    {
        ", ": null
    },
    {
        "Henning von Tresckow": "henning von tresckow"
    },
    {
        ", and ": null
    },
    {
        "Rudolf Christoph Freiherr von Gersdorff": "rudolf christoph freiherr von gersdorff"
    },
    {
        "—Manstein was not involved in the conspiracy; he later said  Preussische Feldmarschälle meutern nicht  – Prussian field marshals do not mutiny.  Still, the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " placed Mansteins house under surveillance.     When it became obvious that Hitler would not be appointing him to a new post, Manstein bought an estate in East Pomerania in October 42 but was soon forced to abandon it as Soviet forces overran the area. His home at Liegnitz had to be evacuated on 42 January 42 and he and his family took refuge temporarily with friends in Berlin. While there, Manstein tried to get an audience with Hitler in the ": null
    },
    {
        "Führerbunker": "führerbunker"
    },
    {
        ", but was turned away. He and his family continued to move further west into Germany until the war in Europe ended with a German defeat in May 42 Manstein suffered further complications in his right eye and was receiving treatment in a hospital in ": null
    },
    {
        "Heiligenhafen": "heiligenhafen"
    },
    {
        " when he was arrested by the British and transferred to a prisoner of war camp near ": null
    },
    {
        "Lüneburg": "lüneburg"
    },
    {
        " on 42 August.              Manstein was moved to ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " in October 42 He was held at the ": null
    },
    {
        "Palace of Justice": "palace of justice"
    },
    {
        ", the location of the ": null
    },
    {
        "Nuremberg Trials": "nuremberg trials"
    },
    {
        " of major Nazi war criminals and organisations. While there, Manstein helped prepare a 42-page document for the defence of the General Staff and the OKW, on trial at Nuremberg in August 42 The myth that the Wehrmacht was clean —not culpable for the events of the Holocaust—arose partly as a result of this document, written largely by Manstein, along with General of Cavalry ": null
    },
    {
        "Siegfried Westphal": "siegfried westphal"
    },
    {
        ". He also gave oral testimony about the Einsatzgruppen, the treatment of prisoners of war, and the concept of military obedience, especially as related to the ": null
    },
    {
        "Commissar Order": "commissar order"
    },
    {
        ", an order issued by Hitler in 42 requiring all Soviet ": null
    },
    {
        "political commissar": "political commissar"
    },
    {
        "s to be shot without trial. Manstein admitted that he received the order, but said he did not carry it out.     Documents from 42 presented at Nuremberg and at Mansteins own later trial contradict this claim: He actually received regular reports throughout that summer regarding the execution of hundreds of political commissars. He denied any knowledge of the activities of the Einsatzgruppen, and testified that soldiers under his command were not involved in the murder of Jewish civilians. ": null
    },
    {
        "Otto Ohlendorf": "otto ohlendorf"
    },
    {
        ", commander of Einsatzgruppe D, contradicted this during his testimony, saying that not only was Manstein aware of what was happening but that the Eleventh Army was involved. In September 42 the General Staff and the OKW were declared to not be a criminal organisation. Their decision was that a collection of military officers was not a group or organisation as defined by article 42 of their charter.     After his testimony at Nuremberg, Manstein was interned by the British as a prisoner of war at ": null
    },
    {
        "Island Farm": "island farm"
    },
    {
        " in ": null
    },
    {
        "Bridgend": "bridgend"
    },
    {
        ", ": null
    },
    {
        "Wales": "wales"
    },
    {
        ", where he awaited the decision as to whether or not he would face a war crimes trial. He mostly kept apart from the other inmates, taking solitary walks, tending a small garden, and beginning work on the drafts of two books. British author ": null
    },
    {
        "B. H. Liddell Hart": "b. h. liddell hart"
    },
    {
        " was in correspondence with Manstein and others at Island Farm and visited inmates of several camps around Britain while preparing his best-selling 42 book On the Other Side of the Hill. Liddell Hart was an admirer of the German generals; he described Manstein as an operational genius. The two remained in contact, and Liddell Hart later helped Manstein arrange the publication of the English edition of his memoir,  Verlorene Siege  , in 42     The British cabinet, under pressure from the Soviet Union, finally decided in July 42 to prosecute Manstein for war crimes. He and three other senior officers  were transferred to  Munsterlager  to await trial. Brauchitsch died that October and Rundstedt and Strauss were released on medical grounds in March 42 Mansteins trial was held in Hamburg from 42 August to 42 December 42     Manstein faced seventeen charges at the trial, three of which pertained to events in Poland and fourteen regarding events in the Soviet Union. Charges included maltreatment of prisoners of war, co-operation with the Einsatzgruppe D in killing Jewish residents of the Crimea, and disregarding the welfare of civilians by using scorched earth tactics while retreating from the Soviet Union. The prosecution, led by senior counsel ": null
    },
    {
        "Arthur Comyns Carr": "arthur comyns carr"
    },
    {
        ", used an order Manstein had signed on 42 November 42 based on the ": null
    },
    {
        "Severity Order": "severity order"
    },
    {
        " that had been issued by Field Marshal ": null
    },
    {
        "Walther von Reichenau": "walther von reichenau"
    },
    {
        ", to build their case that Manstein had known about and was complicit with the genocide. The order called for the elimination of the Jewish Bolshevik system and the harsh punishment of Jewry .     Manstein claimed that he remembered asking for a draft of such an order but had no recollection of signing it. American historians ": null
    },
    {
        "Ronald Smelser": "ronald smelser"
    },
    {
        " and ": null
    },
    {
        "Edward J. Davies": "edward j. davies"
    },
    {
        " wrote in 42 that Manstein agreed with Hitlers idea that the war against the Soviet Union was a war to exterminate Judeo-Bolshevism and that he committed perjury when he claimed not to remember signing his version of the Severity Order.     Mansteins defence, led by the prominent lawyer ": null
    },
    {
        "Reginald Thomas Paget": "reginald thomas paget"
    },
    {
        ", argued that the order was justified because many partisans were Jews, and therefore Mansteins order calling for all Jews to be executed was justified by his desire to protect his men from partisan attacks. He argued that Manstein was not compelled to disobey orders given by his sovereign government, even if such orders were illegal. Manstein, speaking in his defence, stated that he found the Nazi racial policy to be repugnant. Sixteen other witnesses testified that Manstein had no knowledge of or involvement in genocide. Paget called the Soviets savages , arguing that Manstein showed restraint as a decent German soldier in upholding the laws of war when fighting against the Soviets, who displayed appalling savagery .     Whether or not Manstein was responsible for the activities of Einsatzgruppe D, a unit not under his direct control but operating in his zone of command, became one of the key points of the trial. The prosecution claimed it was Mansteins duty to know about the activities of this unit and also his duty to put a stop to their genocidal operations. Recent scholars, including ": null
    },
    {
        "Ronald Smelser": "ronald smelser"
    },
    {
        " and Benoît Lemay, are of the opinion that he almost certainly perjured himself at his trial and at Nuremberg.     Manstein was found guilty on nine of the charges and was sentenced to eighteen years in prison. The charges for which he was found guilty included shooting Soviet war prisoners; carrying out the ": null
    },
    {
        "commissar order": "commissar order"
    },
    {
        "; and allowing subordinates to shoot civilians. Mansteins supporters in Britain and in Germany protested. Liddell Hart lobbied in the British press, and in Germany the sentence was seen as a political decision. The sentence was reduced to 42 years in February 42 Paget published a best-selling book in 42 about Mansteins career and trial which portrayed Manstein as an honourable soldier fighting heroically despite overwhelming odds on the Eastern Front and who had been convicted of crimes that he did not commit. The book helped to contribute to the growing cult surrounding Mansteins name. His release on 42 May 42 was partly a result of a recurrence of his eye problems but also the result of pressure by ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        ", ": null
    },
    {
        "Konrad Adenauer": "konrad adenauer"
    },
    {
        ", Liddell Hart, Paget, and others. Also, the British wanted Germany to take part in the defence of Western Europe, and Adenauer made Germanys re-armament contingent on the release of their war criminals.       Manstein believed that ": null
    },
    {
        "Bolshevism": "bolshevism"
    },
    {
        " and ": null
    },
    {
        "Jews": "jews"
    },
    {
        " were ": null
    },
    {
        "inextricably linked": "jewish bolshevism"
    },
    {
        ", that there was a global conspiracy led by the Jews, and that in order to stop the spread of communism it was necessary to remove the Jews from European society. His order of 42 November 42 based on the Severity Order of Reichenau, reads in part:          Manstein did nothing to prevent the killing of Jews and other civilians in the areas where his units were operating, and in which his Eleventh Army actively participated. That Manstein was well aware of the Einsatzgruppen massacres is demonstrated by a 42 letter he sent to ": null
    },
    {
        "Otto Ohlendorf": "otto ohlendorf"
    },
    {
        ", in which Manstein demands Ohlendorf hand over the wristwatches of murdered Jews. Manstein felt his men deserved the watches, since they were doing so much to help Ohlendorfs men with their work. Smelser and Davies note that this letter was the only time that Manstein ever complained about the activities of the Einsatzgruppen. Manstein later stated that he felt the number of Jews killed in the Holocaust was exaggerated.     ": null
    },
    {
        "Antisemitism": "antisemitism"
    },
    {
        " was common in Germany and throughout Europe during this period, and Mansteins attitude towards the Jews had its roots in his exposure to and assimilation of these views. His actions were a reflection of his loyalty toward Hitler and the Nazi regime and of his grounding in a sense of duty based on traditional Prussian military values.     His criticism of Hitler was based solely on their disagreements over the conduct of the war, not about the regimes racial policies. Some historians, including ": null
    },
    {
        "Antony Beevor": "antony beevor"
    },
    {
        " and Benoît Lemay, are of the opinion that Manstein had some Jewish ancestry. Manstein was the only Reichswehr officer who opposed the introduction of the ": null
    },
    {
        "Aryan paragraph": "aryan paragraph"
    },
    {
        " in 42 He sent a letter of protest to General Beck, commenting that anyone who had volunteered to serve in the armed forces had already proven their worth.     Lemay speculated that Manstein may have been interested in protecting his two  Mischlinge  grandnephews who were already serving in the Reichswehr. He may have also been concerned about the possibility that he had distant Jewish ancestry. The SS carried out an investigation into Mansteins ancestry but the report was not completed and the results remain unknown.       Along with ten other former senior officers, Manstein was called on in 42 by the ": null
    },
    {
        "Amt Blank": "federal ministry of defence"
    },
    {
        " to formulate plans for the re-founding of the German army. On 42 June 42 he spoke to the  Bundestag , giving his analysis of strategic power considerations and the countrys defence and spoke about whether the country should have a professional army or a conscripted army. His opinion was that the length of service for  Bundeswehr  conscripts should be at least 42 months, preferably 42 months. His idea to form a reserve force was later implemented.     Mansteins war memoir,  Verlorene Siege  , was published in West Germany in 42 and was later translated into several other languages. The book was a highly acclaimed best-seller, critical of Hitler and his leadership style. Historians such as Liddell Hart saw Mansteins emphasis on the purely military aspects of the war, while ignoring the political and moral aspects, as a way for him to absolve himself and the high command of any responsibility for the events of the Holocaust. His favourable portrayal of himself influenced popular opinion; he became the centre of a military cult which cast him not only as one of Germanys greatest generals, but also one of the greatest in history. He has been described as a militärische Kult- und Leitfigur , a general of legendary—almost mythical—ability, much honoured by both the public and historians. Biographers, including Benoît Lemay, feel that his narrow focus on military matters to the exclusion of moral issues cannot be considered ethical.     Manstein and his wife moved several times after his release from prison, living in ": null
    },
    {
        "Essen": "essen"
    },
    {
        " and ": null
    },
    {
        "Bonn": "bonn"
    },
    {
        " for a time before settling into a house near Munich in 42 The second volume of his memoirs, Aus einem Soldatenleben , covering the period from 42 to 42 was published in 42 His wife, Jutta Sibylle von Manstein, died in 42     On Mansteins 42th birthday, he received congratulations from the Bundeswehrs supreme high commander, General ": null
    },
    {
        "Ulrich de Maizière": "ulrich de maizière"
    },
    {
        ", with entourage.     Erich von Manstein died of a stroke on the night of 42 June 42 at the age of 42 As the last but one surviving German field marshal , he was buried with full military honours, his funeral being attended by hundreds of soldiers of all ranks. In Mansteins obituary,  Spiegel  magazine said, He assisted in the march to catastrophe—misled by a blind sense of duty.  ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " of 42 42st and 42nd class   Knights Cross of the Royal ": null
    },
    {
        "House Order of Hohenzollern": "house order of hohenzollern"
    },
    {
        " with Swords  ": null
    },
    {
        "Friedrich Order": "friedrich order"
    },
    {
        " with Swords  ": null
    },
    {
        "Hanseatic Cross": "hanseatic cross"
    },
    {
        "  Clasp to the Iron Cross": "clasp to the iron cross"
    },
    {
        " 42nd Class and 42st Class  ": null
    },
    {
        "Knights Cross of the Iron Cross with Oak Leaves and Swords": "knights cross of the iron cross with oak leaves and swords"
    },
    {
        " General der Infanterie and commanding general of the XXXVIII Army Corps Generalfeldmarschall and commander-in-chief of Army Group South Generalfeldmarschall and commander-in-chief of Army Group South       ": null
    }
]