[
    {
        "Ermanno Wolf-Ferrari  was an ": null
    },
    {
        "Italian": "italy"
    },
    {
        " composer": "composer"
    },
    {
        " and ": null
    },
    {
        "teacher": "teacher"
    },
    {
        ". He is best known for his comic ": null
    },
    {
        "opera": "opera"
    },
    {
        "s such as  Il segreto di Susanna  . A number of his works were based on plays by ": null
    },
    {
        "Carlo Goldoni": "carlo goldoni"
    },
    {
        ", including  Le donne curiose  ,  I quatro rusteghi  and  Il campiello  .       Ermanno Wolf-Ferrari was born in ": null
    },
    {
        "Venice": "venice"
    },
    {
        " in 42 the son of German painter August Wolf and Emilia Ferrari, from Venice. He added his mothers maiden-name, Ferrari, to his surname in 42 Although he studied piano from an early age, music was not the primary passion of his young life. As a teenager Wolf-Ferrari wanted to be a painter like his father; he studied intensively in Venice and ": null
    },
    {
        "Rome": "rome"
    },
    {
        " and traveled abroad to study in ": null
    },
    {
        "Munich": "munich"
    },
    {
        ". It was there that he decided to concentrate instead on ": null
    },
    {
        "music": "music"
    },
    {
        ", taking lessons from ": null
    },
    {
        "Josef Rheinberger": "josef rheinberger"
    },
    {
        ". He enrolled at the Munich conservatory and began taking counterpoint and composition classes. These initially casual music classes eventually completely eclipsed his art studies, and music took over Wolf-Ferraris life. He wrote his first works in the 42s.      At age 42 Wolf-Ferrari left the conservatory and traveled home to Venice. There he worked as a choral conductor, married, had a son called Federico Wolf-Ferrari, and met both ": null
    },
    {
        "Arrigo Boito": "arrigo boito"
    },
    {
        " and ": null
    },
    {
        "Verdi": "verdi"
    },
    {
        ". In 42 having failed to have two previous efforts published, Wolf-Ferrari saw the first performance of one of his ": null
    },
    {
        "opera": "opera"
    },
    {
        "s, Cenerentola, based on the story of Cinderella. The opera was a failure in Italy, and the humiliated young composer moved back to Munich. German audiences would prove more appreciative of his work; a revised version of Cenerentola was a hit in Bremen in 42 while the cantata La vita nuova brought the young composer international fame.     Wolf-Ferrari now began transforming the wild and witty farces of the 42th-century Venetian playwright Carlo Goldoni into comic operas. The resulting works were musically eclectic, melodic, and utterly hilarious; every single one became an international success. In fact, until the outbreak of World War I, Wolf-Ferraris operas were among the most performed in the world. In 42 he became professor of composition and director of the ": null
    },
    {
        "Liceo Benedetto Marcello": "conservatorio di musica benedetto marcello di venezia"
    },
    {
        ".     In 42 Wolf-Ferrari tried his hand at full-blooded ": null
    },
    {
        "Verismo": "verismo"
    },
    {
        " with  I gioielli della Madonna ; a story of passion, sacrilege and madness. It was quite popular in its day and for a period after, especially in Chicago, where the great Polish soprano ": null
    },
    {
        "Rosa Raisa": "rosa raisa"
    },
    {
        " made it a celebrated vehicle. ": null
    },
    {
        "Maria Jeritza": "maria jeritza"
    },
    {
        "  triumphed in it at the ": null
    },
    {
        "Metropolitan Opera": "metropolitan opera"
    },
    {
        ", in an all-out spectacular production in 42     World War I, however, was a nightmare for Wolf-Ferrari. The young composer, who had been dividing his time between Munich and Venice, suddenly found his two countries at war with each other. With the outbreak of the War, he moved to ": null
    },
    {
        "Zurich": "zurich"
    },
    {
        " and composed much less, though he still wrote another comedy,  Gli amanti sposi  . A new melancholy vein appeared in his post-war work; his operas grew darker and more emotionally complex.      He did not really pick up his rate of output until the 42s, when he wrote  Das Himmelskleid  and  Sly  , the latter based on ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s  The Taming of the Shrew . In 42 he became professor of composition at the ": null
    },
    {
        "Mozarteum": "mozarteum"
    },
    {
        " in ": null
    },
    {
        "Salzburg": "salzburg"
    },
    {
        ". In 42 he moved again to Zürich before returning to his home city of Venice. He died in Venice at ": null
    },
    {
        "Palazzo Malipiero": "palazzo malipiero"
    },
    {
        " and is buried in the Venetian cemetery ": null
    },
    {
        "Island of San Michele": "island of san michele"
    },
    {
        ".       As well as his operas, Wolf-Ferrari wrote a number of instrumental works, mainly at the very beginning and very end of his career. Only his ": null
    },
    {
        "violin concerto": "violin concerto"
    },
    {
        " has ever been performed with anything approaching regularity, though he also wrote Idillio-concertino , various pieces of ": null
    },
    {
        "chamber music": "chamber music"
    },
    {
        " including a ": null
    },
    {
        "piano quintet": "piano quintet"
    },
    {
        " and two ": null
    },
    {
        "piano trio": "piano trio"
    },
    {
        "s, three ": null
    },
    {
        "violin sonata": "violin sonata"
    },
    {
        "s and a number of works for the ": null
    },
    {
        "organ": "organ"
    },
    {
        " amongst others.     Wolf-Ferraris work is not performed very widely  although he is generally thought of as probably the finest writer of Italian comic opera of his time. His works often recall the ": null
    },
    {
        "opera buffa": "opera buffa"
    },
    {
        " of the 42th century, although he also wrote more ambitious works in the manner of ": null
    },
    {
        "Pietro Mascagni": "pietro mascagni"
    },
    {
        ", which are thought of less well.             ::See  List of operas by Ermanno Wolf-Ferrari  La vita nuova, cantata 42   42 Rispetti, Op. 42   42 Rispetti, Op. 42   Canzoniere, Op. 42       Serenade for Strings in E flat major   Idillio-concertino in A major for Oboe and small orchestra, Op. 42   Suite-concertino in F major for Bassoon and small orchestra, Op. 42   Venezianische Suite in A minor, Op.42   Triptychon op.42   Divertimento in D major op.42   Arabesken für Orchester op.42   Violin Concerto in D, Op. 42 Guila Bustabo in ammirazione   Sinfonia Brevis in E flat major op.42   Concertino in A flat major for English horn and small orchestra, Op. 42       String Sextet in C minor In manuscript, mentioned by Hamann in his Ermanno Wolf-Ferrari, . Performed in several concerts in Germany in 42 - see    Sinfonia da Camera Op. 42   Sonata No.42 for Violin & Piano in G minor, Op.42   Sonata No.42 for Violin & Piano in A minor, Op.42   Sonata No.42 for Violin & Piano in E major, Op.42   Sonata for Cello & Piano in G major, Op.42   String Duo in G minor for Violin & Cello, Op.42b   String Duo, Introduzio mnjkkjkne e Balletto , for Violin & Cello, Op.42   String Trio in B minor for Violin, Viola & Cello, WoO.   String Trio in A minor for Violin, Viola & Cello, Op.42   String Quartet in E minor, Op.42   String Quintet in C major for 42 Violins, 42 Violas & Cello, Op.42   Piano Trio No.42 in D major, Op.42   Piano Trio No.42 in F major, Op.42   Piano Trio Sonata for in F major for 42 Violins & Piano, Op.42   Piano Quintet in D major, Op.42       Wolf-Ferrari, Ermanno by John C G Waterhouse, in The New Grove Dictionary of Music and Musicians, ed. ": null
    },
    {
        "Stanley Sadie": "stanley sadie"
    },
    {
        "      Wolf-Ferrari, Ermanno by John C G Waterhouse, in The New Grove Dictionary of Opera , ed. Stanley Sadie ": null
    }
]