[
    {
        "              Alfred Ernest Jones  was a Welsh ": null
    },
    {
        "neurologist": "neurologist"
    },
    {
        " and ": null
    },
    {
        "psychoanalyst": "psychoanalyst"
    },
    {
        ". A lifelong friend and colleague of ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        " from their first meeting in 42 he became his official biographer. Jones was the first English-speaking practitioner of ": null
    },
    {
        "psychoanalysis": "psychoanalysis"
    },
    {
        " and became its leading exponent in the English-speaking world. As President of both the ": null
    },
    {
        "International Psychoanalytical Association": "international psychoanalytical association"
    },
    {
        " and the ": null
    },
    {
        "British Psycho-Analytical Society": "british psychoanalytical society"
    },
    {
        " in the 42s and 42s, Jones exercised a formative influence in the establishment of their organisations, institutions and publications.       Ernest Jones was born in ": null
    },
    {
        "Gowerton": "gowerton"
    },
    {
        " , Wales, an industrial village on the outskirts of ": null
    },
    {
        "Swansea": "swansea"
    },
    {
        ", the first child of Thomas and Ann Jones. His father was a self-taught ": null
    },
    {
        "colliery": "colliery"
    },
    {
        " engineer who went on to establish himself as a successful business man, becoming accountant and company secretary at the Elba Steelworks in Gowerton. His mother, Mary Ann , was from a Welsh-speaking ": null
    },
    {
        "Carmarthenshire": "carmarthenshire"
    },
    {
        " family which had relocated to Swansea. Jones was educated at ": null
    },
    {
        "Swansea Grammar School": "bishop gore school"
    },
    {
        ", ": null
    },
    {
        "Llandovery College": "llandovery college"
    },
    {
        ", and ": null
    },
    {
        "Cardiff University": "cardiff university"
    },
    {
        " in ": null
    },
    {
        "Wales": "wales"
    },
    {
        ". Jones studied at ": null
    },
    {
        "University College London": "university college london"
    },
    {
        " and meanwhile he obtained the ": null
    },
    {
        "Conjoint": "conjoint"
    },
    {
        " diplomas ": null
    },
    {
        "LRCP": "royal college of physiciansmembership and fellowship"
    },
    {
        " and ": null
    },
    {
        "MRCS": "membership of the royal college of surgeons"
    },
    {
        " in 42 A year later, in 42 he obtained an ": null
    },
    {
        "M.B.": "bachelor of medicine"
    },
    {
        " degree with honours in medicine and ": null
    },
    {
        "obstetrics": "obstetrics"
    },
    {
        ". Within five years he received an ": null
    },
    {
        "MD": "doctor of medicine"
    },
    {
        " degree and a ": null
    },
    {
        "Membership of the Royal College of Physicians": "membership of the royal college of physicians"
    },
    {
        " in 42 He was particularly pleased to receive the Universitys gold medal in obstetrics from his distinguished fellow-Welshman, ": null
    },
    {
        "Sir John Williams": "sir john williams, 1st baronet, of the city of london"
    },
    {
        ".     After obtaining his medical degrees, Jones specialised in ": null
    },
    {
        "neurology": "neurology"
    },
    {
        " and took a number of posts in London hospitals. It was through his association with the surgeon ": null
    },
    {
        "Wilfred Trotter": "wilfred trotter"
    },
    {
        " that Jones first heard of Freuds work. Having worked together as surgeons at ": null
    },
    {
        "University College Hospital": "university college hospital"
    },
    {
        ", he and Trotter became close friends, with Trotter taking the role of mentor and confidant to his younger colleague. They had in common a wide-ranging interest in philosophy and literature, as well as a growing interest in Continental psychiatric literature and the new forms of clinical therapy it surveyed. By 42 they were sharing accommodation above ": null
    },
    {
        "Harley Street": "harley street"
    },
    {
        " consulting rooms with Joness sister, Elizabeth, installed as housekeeper. Trotter and Elizabeth Jones later married. Appalled by the treatment of the mentally ill in institutions, Jones began experimenting with hypnotic techniques in his clinical work.     Jones first encountered Freuds writings directly in 42 in a German psychiatric journal in which Freud published the famous ": null
    },
    {
        "Dora": "dora"
    },
    {
        " case-history. It was thus he formed the deep impression of there being a man in Vienna who actually listened with attention to every word his patients said to him...a revolutionary difference from the attitude of previous physicians...      Joness early attempts to combine his interest in Freuds ideas with his clinical work with children resulted in adverse effects on his career. In 42 he was arrested and charged with two counts of indecent assault on two adolescent girls whom he had interviewed in his capacity as an inspector of schools for mentally defective children. At the court hearing Jones maintained his innocence, claiming the girls were fantasising about any inappropriate actions by him. The magistrate concluded that no jury would believe the testimony of such children and Jones was acquitted. In 42 employed as a pathologist at a London hospital, Jones accepted a colleagues challenge to demonstrate the repressed sexual memory underlying the hysterical paralysis of a young girls arm. Jones duly obliged but, before conducting the interview, he omitted to inform the girls consultant or arrange for a ": null
    },
    {
        "chaperone": "chaperone"
    },
    {
        ". Subsequently, he faced complaints from the girls parents over the nature of the interview and he was forced to resign his hospital post.         Joness first serious relationship was with Loe Kann, a wealthy Dutch émigré referred to him in 42 after she had become ": null
    },
    {
        "addicted": "addiction"
    },
    {
        " to ": null
    },
    {
        "morphine": "morphine"
    },
    {
        " during treatment for a serious kidney condition. Their relationship lasted until 42 It ended with Kann in analysis with Freud and Jones, at Freuds behest, undergoing analysis with ": null
    },
    {
        "Sándor Ferenczi": "sándor ferenczi"
    },
    {
        ".     A tentative romance with Freuds daughter, ": null
    },
    {
        "Anna": "anna freud"
    },
    {
        ", did not survive the disapproval of her father. Before her visit to Britain in the autumn of 42 which Jones chaperoned, Freud advised him:      In 42 Jones married the Welsh musician ": null
    },
    {
        "Morfydd Llwyn Owen": "morfydd llwyn owen"
    },
    {
        ". They were holidaying in South Wales the following year when Morfydd became ill with acute ": null
    },
    {
        "appendicitis": "appendicitis"
    },
    {
        ". Emergency surgery was carried out at her parents-in-laws Swansea home but the local surgeon who operated was unable to save her from the effects of ": null
    },
    {
        "chloroform": "chloroform"
    },
    {
        " poisoning.  She was buried in ": null
    },
    {
        "Oystermouth Cemetery": "oystermouth cemetery"
    },
    {
        " on the outskirts of Swansea where her gravestone bears the inscription, chosen by Jones from ": null
    },
    {
        "Goethes Faust": "goethes faust"
    },
    {
        ", Das Unbeschreibliche, hier ists getan .     Following some inspired matchmaking by his Viennese colleagues, in 42 Jones met and married Katherine Jokl, a Jewish economics graduate from Moravia. She had been at school in Vienna with Freuds daughters. They had four children in what proved to be a long and happy marriage, though both struggled to overcome the loss of their eldest child, Gwenith, at the age of 42 during the interwar influenza epidemic. Their son ": null
    },
    {
        "Mervyn Jones": "mervyn jones"
    },
    {
        " became a writer.       Whilst attending a congress of neurologists in Amsterdam in 42 Jones met ": null
    },
    {
        "Carl Jung": "carl jung"
    },
    {
        ", from whom he received a first-hand account of the work of Freud and his circle in Vienna. Confirmed in his judgement of the importance of Freuds work, Jones joined Jung in ": null
    },
    {
        "Zurich": "zurich"
    },
    {
        " to plan the inaugural Psychoanalytical Congress. This was held in 42 in ": null
    },
    {
        "Salzburg": "salzburg"
    },
    {
        ", where Jones met Freud for the first time. Jones travelled to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " for further discussions with Freud and introductions to the members of the ": null
    },
    {
        "Vienna Psychoanalytic Society": "vienna psychoanalytic society"
    },
    {
        ". Thus began a personal and professional relationship which, to the acknowledged benefit of both, would survive the many dissensions and rivalries which marked the first decades of the psychoanalytic movement, and would last until Freuds death in 42      With his career prospects in Britain in serious difficulty, Jones sought refuge in Canada in 42 He took up teaching duties in the Department of Psychiatry of the ": null
    },
    {
        "University of Toronto": "university of toronto"
    },
    {
        " . In addition to building a private psychoanalytic practice, he worked as pathologist to the Toronto Asylum and Director of its psychiatric outpatient clinic. Following further meetings with Freud in 42 at ": null
    },
    {
        "Clark University": "clark university"
    },
    {
        " in ": null
    },
    {
        "Worcester": "worcester, massachusetts"
    },
    {
        ", ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ", where Freud gave a series of lectures on psychoanalysis, and in the Netherlands the following year, Jones set about forging strong working relationships with the nascent American psychoanalytic movement. He gave some 42 papers or addresses to American professional societies at venues ranging from Boston, to Washington and Chicago. In 42 he co-founded the American Psychopathological Association and the following year the ": null
    },
    {
        "American Psychoanalytic Association": "american psychoanalytic association"
    },
    {
        ", serving as its first Secretary until 42     Jones undertook an intensive programme of writing and research, which produced the first of what were to be many significant contributions to psychoanalytic literature, notably monographs on  Hamlet  and On the Nightmare. A number of these were published in German in the main psychoanalytic periodicals published in Vienna; these secured his status in ": null
    },
    {
        "Freuds inner circle": "inner circle"
    },
    {
        " during the period of the latters increasing estrangement from Jung. In this context in 42 Jones initiated, with Freuds agreement, the formation of a Committee of loyalists charged with safeguarding the theoretical and institutional legacy of the psychoanalytic movement. This development also served the more immediate purpose of isolating Jung and, with Jones in strategic control, eventually manoeuvring him out of the Presidency of the ": null
    },
    {
        "International Psychoanalytical Association": "international psychoanalytical association"
    },
    {
        ", a post he had held since its inception. When Jungs resignation came in 42 it was only the outbreak of the Great War that prevented Jones from taking his place.     Returning to London in 42 Jones set up in practice as a psychoanalyst, founded the London Psychoanalytic Society, and continued to write and lecture on psychoanalytic theory. A collection of his papers was published as Papers on Psychoanalysis, the first account of psychoanalytic theory and practice by a practising analyst in the English language.     By 42 the year he founded the ": null
    },
    {
        "British Psychoanalytical Society": "british psychoanalytical society"
    },
    {
        ", Jones could report proudly to Freud that psychoanalysis in Britain stands in the forefront of medical, literary and psychological interest . As President of the Society – a post he would hold until 42 – Jones secured funding for and supervised the establishment in London of a Clinic offering subsidised fees, and an Institute of Psychoanalysis, which provided administrative, publishing and training facilities for the growing network of professional psychoanalysts.          Jones went on to serve two periods as President of the International Psychoanalytic Association from 42 to 42 and 42 to 42 where he had significant influence. In 42 he founded the  International Journal of Psychoanalysis , serving as its editor until 42 The following year he established the International Psychoanalytic Library, which published some 42 books under his editorship. Jones soon obtained from Freud rights to the English translation of his work. In 42 the first two volumes of Freuds Collected Papers  was published in translations edited by Jones and supervised by ": null
    },
    {
        "Joan Riviere": "joan riviere"
    },
    {
        ", his former analysand and, at one stage, ardent suitor. After a period in analysis with Freud, Riviere worked with Jones as the translation editor of the International Journal of Psychoanalysis. She then was part of a working group Jones set up to plan and deliver ": null
    },
    {
        "James Strachey": "james strachey"
    },
    {
        "s translations for the ": null
    },
    {
        "standard edition of Freuds work": "the standard edition of the complete psychological works of sigmund freud"
    },
    {
        ". The Standard Edition of the Complete Psychological Works of Sigmund Freud, edited and translated from the German by James Strachey, in collaboration with Anna Freud. Assisted by ": null
    },
    {
        "Alix Strachey": "alix strachey"
    },
    {
        " and Alan Tyson, 42 volumes. London: Hogarth Press 42–42   Largely through Jones energetic advocacy, the ": null
    },
    {
        "British Medical Association": "british medical association"
    },
    {
        " officially recognised psychoanalysis in 42 The ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " subsequently removed him from a list of speakers declared to be dangerous to public morality. In the 42s Jones and his colleagues made a series of radio broadcasts on psychoanalysis.     After ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " took power in Germany, Jones helped many displaced and endangered Jewish analysts to resettle in England and other countries. Following the ": null
    },
    {
        "Anschluss": "anschluss"
    },
    {
        " of March 42 Jones flew into Vienna at considerable personal risk to play a crucial role in negotiating and organising the emigration of Freud and his circle to London.       Joness early published work on psychoanalysis had been devoted to expositions of the fundamentals of Freudian theory, an elaboration of its theory of symbolism, and its application to the analysis of religion, mythology, folklore and literary and artistic works. Under the influence of ": null
    },
    {
        "Melanie Klein": "melanie klein"
    },
    {
        ", Jones work took a new direction.     Klein had made an impact in Berlin in the new field of child analysis and had impressed Jones in 42 when he attended her series of lectures to the British Society in London. At Joness invitation she moved to London the following year; she soon acquired a number of devoted and influential followers. Her work had a dramatic effect on the British Society, polarising its members into rival factions as it became clear that her approach to child analysis was seriously at odds with that of Anna Freud, as set out in her 42 book An Introduction to the Technique of Child Analysis. The disagreement centred around the clinical approach to the pre-Oedipal child; Klein argued for play as an equivalent to free association in adult analyses. Anna Freud opposed any such equivalence, proposing an educative intervention with the child until an appropriate level of ego development was reached at the Oedipal stage. Klein held this to be a collusive inhibition of analytical work with the child.     Influenced by Klein, and initiating what became known as the Jones–Freud controversy, Jones set out to explore a range of interlinked topics in the theory of early psychic development. These included the structure and genesis of the superego and the nature of the feminine castration complex. He coined the term  phallocentrism  in a critique of Freuds account of sexual difference. He argued together with Klein and her Berlin colleague, ": null
    },
    {
        "Karen Horney": "karen horney"
    },
    {
        ", for a primary femininity, saying that penis envy arose as a defensive formation rather than arising from the fact, or injury , of biological asymmetry. In a corresponding reformulation of the castration complex, Jones introduced the concept of ": null
    },
    {
        "aphanisis": "aphanisis"
    },
    {
        " to refer to the fear of the permanent extinction of the capacity for sexual enjoyment .     These departures from orthodoxy were noted in Vienna and were topics that were featured in the regular Freud–Jones correspondence, the tone of which became increasingly fractious. Faced with accusations from Freud of orchestrating a campaign against him and his daughter, Jones sought to allay Freuds concerns without abandoning his new critical standpoint. Eventually, following a series of exchange lectures between the Vienna and London societies, which Jones arranged with Anna Freud, Freud and Jones resumed their usual cordial exchanges.     With the arrival in Britain of refugee German and Viennese analysts in the 42s, including Anna Freud in 42 the hostility between the orthodox Freudians and Kleinians in the British Society grew more intense. Jones chaired a number of extraordinary business meetings with the aim of defusing the conflict, and these continued into the war years. The meetings, which became known as the ": null
    },
    {
        "controversial discussions": "controversial discussions"
    },
    {
        ", were established on a more regular basis from 42 By that time, Jones had removed himself from direct participation, owing to ill health and the difficulties of war-time travel from his home in ": null
    },
    {
        "Elsted": "elsted"
    },
    {
        ", West Sussex. He resigned from the presidency of the British Society in 42 the year in which, under the presidency of ": null
    },
    {
        "Sylvia Payne": "sylvia payne"
    },
    {
        ", there finally emerged a compromise agreement which established parallel training courses providing options to satisfy the concerns of the rival groups that had formed: followers of Anna Freud, followers of Melanie Klein and a non-aligned group of Middle or ": null
    },
    {
        "Independent Group": "british independent group"
    },
    {
        " analysts. It was agreed further that all the key policy making committees of the BPS should have representatives from the three groups. Baker, Ron ‘The evolution of organisational and training procedures in psychoanalytic associations: a brief account of the unique British contribution’ in Johns, J. and Steiner, R. Within Time and Beyond Time: A Festschrift for Pearl King, London: Karnac, 42 pp. 42–42       After the end of the war, Jones gradually relinquished his many official posts whilst continuing his psychoanalytic practice, writings and lecturing. The major undertaking of his final years was his monumental account of Freuds life and work, published to widespread acclaim in three volumes between 42 and 42 In this he was ably assisted by his German-speaking wife, who translated much of Freuds early correspondence and other archive documentation made available by ": null
    },
    {
        "Anna Freud": "anna freud"
    },
    {
        ". His uncompleted autobiography, Free Associations, was published posthumously in 42     Always proud of his Welsh origins, Jones became a member of the Welsh Nationalist Party, ": null
    },
    {
        "Plaid Cymru": "plaid cymru"
    },
    {
        ". He had a particular love of the ": null
    },
    {
        "Gower Peninsula": "gower peninsula"
    },
    {
        ", which he had explored extensively in his youth. Following the purchase of a holiday cottage in Llanmadoc, this area became a regular holiday retreat for the Jones family. He was instrumental in helping secure its status in 42 as the first region of the UK to be designated an ": null
    },
    {
        "Area of Outstanding Natural Beauty": "area of outstanding natural beauty"
    },
    {
        ".     Both of Joness main leisure pursuits resulted in significant publications. A keen ice skater since his schooldays, Jones published an influential textbook on the subject. His passion for chess inspired a psychoanalytical study of the life of American chess genius, ": null
    },
    {
        "Paul Morphy": "paul morphy"
    },
    {
        ". The Problem of Paul Morphy – A Contribution to the Psycho-Analysis of Chess , reprinted from the International Journal of Psychoanalysis Vol 42:42–42 in Volume 42 of the 42 edition of Essays in Applied Psychoanalysis     Jones was made a ": null
    },
    {
        "Fellow of the Royal College of Physicians": "fellow of the royal college of physicians"
    },
    {
        " in 42 Honorary President of the International Psychoanalytical Association in 42 and was awarded an Honorary ": null
    },
    {
        "Doctor of Science": "doctor of science"
    },
    {
        " degree at ": null
    },
    {
        "Swansea University": "swansea university"
    },
    {
        " in 42     Jones died in London on 42 February 42 and was cremated at ": null
    },
    {
        "Golders Green Crematorium": "golders green crematorium"
    },
    {
        ". His ashes were buried in the grave of the oldest of his four children in the churchyard of St Cadocs ": null
    },
    {
        "Cheriton": "list of villages in gowercheriton"
    },
    {
        " on the Gower Peninsula.        includes a comprehensive bibliography of Jones writings.     42 Papers on Psycho-Analysis. London: Balliere Tindall & Cox. Revised and enlarged editions, 42 42 42 42 .   42 Treatment of the Neuroses. London: Balliere Tindall & Cox   42 Psycho-Analysis and the War Neuroses. With ": null
    },
    {
        "Karl Abraham": "karl abraham"
    },
    {
        ", ": null
    },
    {
        "Sandor Ferenczi": "sandor ferenczi"
    },
    {
        " and ": null
    },
    {
        "Ernst Simmel": "ernst simmel"
    },
    {
        ". London: International Psycho-Analytical Press   42 Essays in Applied Psycho-Analysis. London: International Psycho-Analytical Press. Revised and enlarged edition, 42 London: Hogarth Press. Reprinted as Psycho-Myth, Psycho-History. 42 vols. New York: Hillstone.   42 . Social Aspects of Psycho-Analysis: Lectures Delivered under the Auspices of the Sociological Society. London: Williams and Norgate.   42 Psycho-Analysis. London: E. Benn. Reprinted with an Addendum as What is Psychoanalysis ?. London: Allen & Unwin.   42a. On the Nightmare. London: Hogarth Press and Institute of Psycho-Analysis.   42b. The Elements of Figure Skating. London: Methuen. Revised and enlarged edition, 42 London: Allen and Unwin.   42  Hamlet and Oedipus . London: V. Gollancz.   42 Sigmund Freud: Life and Work. Vol 42: The Young Freud 42–42. London: Hogarth Press.   42 Sigmund Freud: Life and Work. Vol 42: The Years of Maturity 42–42. London: Hogarth Press.   42 Sigmund Freud: Life and Work. Vol 42: The Last Phase 42–42. London: Hogarth Press.   42 Sigmund Freud: Life and Work. An abridgment of the preceding 42 volume work, by ": null
    },
    {
        "Lionel Trilling": "lionel trilling"
    },
    {
        " and Stephen Marcus, with Introduction by Lionel Trilling. New York: Basic Books.   42 Sigmund Freud: Four Centenary Addresses. New York: Basic Books   42 Free Associations: Memories of a Psycho-Analyst. Epilogue by Mervyn Jones. London: Hogarth Press. Reprinted with a New Introduction by Mervyn Jones. New Brunswick and London: Transaction Publishers.       Paskauskas, R Andrew , , Belknap Press, ": null
    },
    {
        "Harvard University Press": "harvard university press"
    },
    {
        ", 42   Sándor Ferenczi - Ernest Jones: Letters 42–42. London: Karnac Books, 42 ": null
    }
]