[
    {
        "   Ernest Orlando Lawrence was a pioneering American ": null
    },
    {
        "nuclear scientist": "nuclear chemistry"
    },
    {
        " and winner of the ": null
    },
    {
        "Nobel Prize in Physics": "nobel prize in physics"
    },
    {
        " in 42 for his invention of the ": null
    },
    {
        "cyclotron": "cyclotron"
    },
    {
        ". He is known for his work on ": null
    },
    {
        "uranium-isotope separation": "enriched uraniumenrichment methods"
    },
    {
        " for the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        ", as well as for founding the ": null
    },
    {
        "Lawrence Berkeley National Laboratory": "lawrence berkeley national laboratory"
    },
    {
        " and the ": null
    },
    {
        "Lawrence Livermore National Laboratory": "lawrence livermore national laboratory"
    },
    {
        ".     A graduate of the ": null
    },
    {
        "University of South Dakota": "university of south dakota"
    },
    {
        " and ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        ", Lawrence obtained a ": null
    },
    {
        "PhD": "phd"
    },
    {
        " in physics at ": null
    },
    {
        "Yale": "yale university"
    },
    {
        " in 42 In 42 he was hired as an associate professor of physics at the ": null
    },
    {
        "University of California, Berkeley": "university of california, berkeley"
    },
    {
        ", becoming the youngest full professor there two years later. In its library one evening, Lawrence was intrigued by a diagram of an accelerator that produced ": null
    },
    {
        "high-energy particles": "particle physics"
    },
    {
        ". He contemplated how it could be made compact, and came up with an idea for a circular accelerating chamber between the poles of an ": null
    },
    {
        "electromagnet": "electromagnet"
    },
    {
        ". The result was the first ": null
    },
    {
        "cyclotron": "cyclotron"
    },
    {
        ".     Lawrence went on to build a series of ever larger and more expensive cyclotrons. His Radiation Laboratory became an official department of the University of California in 42 with Lawrence as its director. In addition to the use of the cyclotron for physics, Lawrence also supported its use in research into medical uses of radioisotopes. During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Lawrence developed electromagnetic ": null
    },
    {
        "isotope separation": "isotope separation"
    },
    {
        " at the Radiation Laboratory. It used devices known as ": null
    },
    {
        "calutron": "calutron"
    },
    {
        "s, a hybrid of the standard laboratory ": null
    },
    {
        "mass spectrometer": "mass spectrometer"
    },
    {
        " and cyclotron. A huge electromagnetic separation plant was built at ": null
    },
    {
        "Oak Ridge, Tennessee": "oak ridge, tennessee"
    },
    {
        ", which came to be called ": null
    },
    {
        "Y42": "y-12 national security complex"
    },
    {
        ". The process was inefficient, but it worked.     After the war, Lawrence campaigned extensively for government sponsorship of large scientific programs, and was a forceful advocate of ": null
    },
    {
        "Big Science": "big science"
    },
    {
        " , with its requirements for big machines and big money. Lawrence strongly backed ": null
    },
    {
        "Edward Teller": "edward teller"
    },
    {
        "s campaign for a second nuclear weapons laboratory, which Lawrence located in ": null
    },
    {
        "Livermore, California": "livermore, california"
    },
    {
        ". After his death, the ": null
    },
    {
        "Regents of the University of California": "regents of the university of california"
    },
    {
        " renamed the ": null
    },
    {
        "Lawrence Livermore National Laboratory": "lawrence livermore national laboratory"
    },
    {
        " and ": null
    },
    {
        "Lawrence Berkeley National Laboratory": "lawrence berkeley national laboratory"
    },
    {
        " after him. Chemical element number 42 was named ": null
    },
    {
        "lawrencium": "lawrencium"
    },
    {
        " in his honor after its discovery at Berkeley in 42       Ernest Orlando Lawrence was born in ": null
    },
    {
        "Canton, South Dakota": "canton, south dakota"
    },
    {
        " on August 42 42 His parents, Carl Gustavus and Gunda Lawrence, were both the offspring of Norwegian immigrants who had met while teaching at the high school in Canton, where his father was also the superintendent of schools. He had a younger brother, ": null
    },
    {
        "John H. Lawrence": "john h. lawrence"
    },
    {
        ", who would become a ": null
    },
    {
        "physician": "physician"
    },
    {
        ", and was a pioneer in the field of ": null
    },
    {
        "nuclear medicine": "nuclear medicine"
    },
    {
        ". Growing up, his best friend was ": null
    },
    {
        "Merle Tuve": "merle tuve"
    },
    {
        ", who would also go on to become a highly accomplished physicist.     Lawrence attended the public schools of Canton and ": null
    },
    {
        "Pierre": "pierre, south dakota"
    },
    {
        ", then enrolled at ": null
    },
    {
        "St. Olaf College": "st. olaf college"
    },
    {
        " in ": null
    },
    {
        "Northfield, Minnesota": "northfield, minnesota"
    },
    {
        ", but transferred after a year to the ": null
    },
    {
        "University of South Dakota": "university of south dakota"
    },
    {
        " in ": null
    },
    {
        "Vermillion": "vermillion, south dakota"
    },
    {
        ". He completed his bachelors degree in chemistry in 42 and his ": null
    },
    {
        "Master of Arts": "master of arts"
    },
    {
        " degree in physics from the ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        " in 42 under the supervision of ": null
    },
    {
        "William Francis Gray Swann": "william francis gray swann"
    },
    {
        ". For his masters thesis, Lawrence built an experimental apparatus that rotated an ": null
    },
    {
        "ellipsoid": "ellipsoid"
    },
    {
        " through a ": null
    },
    {
        "magnetic field": "magnetic field"
    },
    {
        ".       Lawrence followed Swann to the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ", and then to ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        " in ": null
    },
    {
        "New Haven, Connecticut": "new haven, connecticut"
    },
    {
        ", where Lawrence completed his ": null
    },
    {
        "Doctor of Philosophy": "doctor of philosophy"
    },
    {
        " degree in physics in 42 as a Sloane Fellow, writing his doctoral thesis on the ": null
    },
    {
        "photoelectric effect": "photoelectric effect"
    },
    {
        " in potassium vapor.  He was elected a member of ": null
    },
    {
        "Sigma Xi": "sigma xi"
    },
    {
        ", and, on Swanns recommendation, received a ": null
    },
    {
        "National Research Council": "united states national research council"
    },
    {
        " fellowship. Instead of using it to travel to Europe, as was customary at the time, he remained at Yale University with Swann as a researcher.     With ": null
    },
    {
        "Jesse Beams": "jesse beams"
    },
    {
        " from the ": null
    },
    {
        "University of Virginia": "university of virginia"
    },
    {
        ", Lawrence continued to research the photoelectric effect. They showed that photoelectrons appeared within 42 x 42 −42 seconds of the photons striking the photoelectric surface—close to the limit of measurement at the time. Reducing the emission time by switching the light source on and off rapidly made the spectrum of energy emitted broader, in conformance with ": null
    },
    {
        "Werner Heisenberg": "werner heisenberg"
    },
    {
        "s ": null
    },
    {
        "uncertainty principle": "uncertainty principle"
    },
    {
        ".       In 42 and 42 Lawrence received offers of ": null
    },
    {
        "assistant professor": "assistant professor"
    },
    {
        "ships from the ": null
    },
    {
        "University of Washington": "university of washington"
    },
    {
        " in ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        " and the ": null
    },
    {
        "University of California": "university of california at berkeley"
    },
    {
        " at a salary of $42 per annum. Yale promptly matched the offer of the assistant professorship, but at a salary of $42. Lawrence chose to stay at the more prestigious Yale, but because he had never been an instructor, the appointment was resented by some of his fellow faculty, and in the eyes of many it still did not compensate for his South Dakota immigrant background.     Lawrence was hired as an ": null
    },
    {
        "associate professor": "associate professor"
    },
    {
        " of physics at the University of California in 42 and two years later became a full professor, becoming the universitys youngest professor. ": null
    },
    {
        "Robert Gordon Sproul": "robert gordon sproul"
    },
    {
        ", who became university president the day after Lawrence became a professor, was a member of the ": null
    },
    {
        "Bohemian Club": "bohemian club"
    },
    {
        ", and he sponsored Lawrences membership in 42 Through this club, Lawrence met ": null
    },
    {
        "William Henry Crocker": "william henry crocker"
    },
    {
        ", ": null
    },
    {
        "Edwin Pauley": "edwin pauley"
    },
    {
        ", and ": null
    },
    {
        "John Francis Neylan": "john francis neylan"
    },
    {
        ". They were influential men who helped him obtain money for his energetic nuclear particle investigations. There was great hope for medical uses to come from the development of particle physics, and this led to much of the early funding for advances Lawrence was able to obtain.     While at Yale, Lawrence met Mary Kimberly Blumer, the eldest of four daughters of George Blumer, the dean of the ": null
    },
    {
        "Yale School of Medicine": "yale school of medicine"
    },
    {
        ".   They first met in 42 and became engaged in 42 and were married on May 42 42 at ": null
    },
    {
        "Trinity Church on the Green": "trinity church on the green"
    },
    {
        " in ": null
    },
    {
        "New Haven, Connecticut": "new haven, connecticut"
    },
    {
        ". They had six children: Eric, Margaret, Mary, Robert, Barbara, and Susan.  Lawrence named his son Robert after ": null
    },
    {
        "theoretical physicist": "theoretical physicist"
    },
    {
        " Robert Oppenheimer": "robert oppenheimer"
    },
    {
        ", his closest friend in Berkeley.  In 42 Mollys sister Elsie married ": null
    },
    {
        "Edwin McMillan": "edwin mcmillan"
    },
    {
        ", who would go on to win the ": null
    },
    {
        "Nobel Prize in Chemistry": "nobel prize in chemistry"
    },
    {
        " in 42            The invention that brought Lawrence to international fame started out as a sketch on a scrap of a paper napkin. While sitting in the library one evening in 42 Lawrence glanced over a journal article by ": null
    },
    {
        "Rolf Widerøe": "rolf widerøe"
    },
    {
        ",  and was intrigued by one of the diagrams.  This depicted a device that produced ": null
    },
    {
        "high-energy particles": "particle physics"
    },
    {
        " by means of a succession of small pushes . The device depicted was laid out in a straight line using increasingly longer electrodes. At the time, physicists were beginning to explore the ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        ". In 42 the New Zealand physicist ": null
    },
    {
        "Ernest Rutherford": "ernest rutherford"
    },
    {
        " had fired alpha particles into ": null
    },
    {
        "nitrogen": "nitrogen"
    },
    {
        " and had succeeded in knocking ": null
    },
    {
        "proton": "proton"
    },
    {
        "s out of some of the nuclei. But nuclei have a positive charge that repels other positively charged nuclei, and they are bound together tightly by a force that physicists were only just beginning to understand. To break them up, to disintegrate them, would require much higher energies, of the order of millions of volts.        Lawrence saw that such a ": null
    },
    {
        "particle accelerator": "particle accelerator"
    },
    {
        " would soon become too long and unwieldy for his university laboratory. In pondering a way to make the accelerator more compact, Lawrence decided to set a circular accelerating chamber between the poles of an electromagnet. The magnetic field would hold the charged protons in a spiral path as they were accelerated between just two semicircular electrodes connected to an alternating potential. After a hundred turns or so, the protons would impact the target as a beam of high-energy particles. Lawrence excitedly told his colleagues that he had discovered a method for obtaining particles of very high energy without the use of any high voltage. He initially worked with Niels Edlefsen. Their first ": null
    },
    {
        "cyclotron": "cyclotron"
    },
    {
        " was made out of brass, wire, and sealing wax and was only four inches in diameter—it could literally be held in one hand, and probably cost $42 in all.      What Lawrence needed to develop the idea was capable graduate students to do the work. Edlefsen left to take up an assistant professorship in September 42 and Lawrence replaced him with David H. Sloan and ": null
    },
    {
        "M. Stanley Livingston": "m. stanley livingston"
    },
    {
        ", who he set to work on developing Widerøes accelerator and Edlefsens cyclotron, respectively. Both had their own financial support. Both designs proved practical, and by May 42 Sloans ": null
    },
    {
        "linear accelerator": "linear accelerator"
    },
    {
        " was able to accelerate ions to 42 MeV. Livingston had a greater technical challenge, but when he applied 42  V to his 42-inch cyclotron on January 42 42 he got 42-": null
    },
    {
        "electron volt": "electron volt"
    },
    {
        " protons spinning around. A week later, he had 42 MeV with 42 V, more than enough for his PhD thesis on its construction.          In what would become a recurring pattern, as soon as there was the first sign of success, Lawrence started planning a new, bigger machine. Lawrence and Livingston drew up a design for a  cyclotron in early 42 The magnet for the $42  42-inch cyclotron weighed 42 tons, but Lawrence found a massive 42-ton magnet rusting in a junkyard in Palo Alto for the 42-inch that had originally been built during World War I to power a transatlantic radio link.  In the cyclotron, he had a powerful scientific instrument, but this did not translate into scientific discovery. In April 42 ": null
    },
    {
        "John Cockcroft": "john cockcroft"
    },
    {
        " and ": null
    },
    {
        "Ernest Walton": "ernest walton"
    },
    {
        " at the ": null
    },
    {
        "Cavendish Laboratory": "cavendish laboratory"
    },
    {
        " in England announced that they had bombarded ": null
    },
    {
        "lithium": "lithium"
    },
    {
        " with ": null
    },
    {
        "proton": "proton"
    },
    {
        "s and succeeded in transmuting it into ": null
    },
    {
        "helium": "helium"
    },
    {
        ". The energy required turned out to be quite low—well within the capability of the 42-inch cyclotron. On learning about it, Lawrence sent a wire to Berkeley and asked for Cockcroft and Waltons results to be verified. It took the team until September to do so, mainly due to lack of adequate detection apparatus.     Although important discoveries continued to elude Lawrences ": null
    },
    {
        "Radiation Laboratory": "lawrence berkeley national laboratory"
    },
    {
        ", mainly due to its focus on the development of the cyclotron rather than its scientific use, through his increasingly larger machines, Lawrence was able to provide crucial equipment needed for experiments in ": null
    },
    {
        "high energy physics": "particle physics"
    },
    {
        ". Around this device, he built what became the worlds foremost laboratory for the new field of nuclear physics research in the 42s. He received a ": null
    },
    {
        "patent": "patent"
    },
    {
        " for the cyclotron in 42  which he assigned to the ": null
    },
    {
        "Research Corporation": "research corporation"
    },
    {
        ", a private foundation that funded much of Lawrences early work.     In February 42 ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        "s president, ": null
    },
    {
        "James B. Conant": "james b. conant"
    },
    {
        ", made attractive offers to Lawrence and Oppenheimer. The University of Californias president, ": null
    },
    {
        "Robert Gordon Sproul": "robert gordon sproul"
    },
    {
        ", responded by improving conditions. The Radiation Laboratory became an official department of the University of California on July 42 42 with Lawrence formally appointed its director, with a full-time assistant director, and the University agreed to make $42 a year available for its research activities. Lawrence employed a simple business model: He staffed his laboratory with graduate students and junior faculty of the physics department, with fresh Ph.D.s willing to work for anything, and with fellowship holders and wealthy guests able to serve for nothing.        Using the new 42-inch cyclotron, the team at Berkeley discovered that every element that they bombarded with recently discovered ": null
    },
    {
        "deuterium": "deuterium"
    },
    {
        " emitted energy, and in the same range. They, therefore, postulated the existence of a new and hitherto unknown particle that was a possible source of limitless energy. ": null
    },
    {
        "William Laurence": "william laurence"
    },
    {
        " of  The New York Times  described Lawrence as a new miracle worker of science . At Cockcrofts invitation, Lawrence attended the 42 ": null
    },
    {
        "Solvay Conference": "solvay conference"
    },
    {
        " in Belgium. This was a regular gathering of the worlds top physicists. Nearly all were from Europe, but occasionally an outstanding American scientist like ": null
    },
    {
        "Robert A. Millikan": "robert a. millikan"
    },
    {
        " or ": null
    },
    {
        "Arthur Compton": "arthur compton"
    },
    {
        " would be invited to attend. Lawrence was asked to give a presentation on the cyclotron. Lawrences claims of limitless energy met a very different reception in Solvay. He ran into withering skepticism from the Cavendish Laboratorys ": null
    },
    {
        "James Chadwick": "james chadwick"
    },
    {
        ", the physicist who had discovered the ": null
    },
    {
        "neutron": "neutron"
    },
    {
        " in 42 for which he was awarded the Nobel Prize in 42 In a British accent that sounded condescending to American ears, Chadwick suggested that what Lawrences team was observing was contamination of their apparatus.        When he returned to Berkeley, Lawrence mobilized his team to go painstakingly over the results to gather enough evidence to convince Chadwick. Meanwhile, at the Cavendish laboratory, Rutherford and ": null
    },
    {
        "Mark Oliphant": "mark oliphant"
    },
    {
        " found that deuterium ": null
    },
    {
        "fuses": "nuclear fusion"
    },
    {
        " to form ": null
    },
    {
        "helium42": "helium-3"
    },
    {
        ", which causes the effect that the cyclotroneers had observed. Not only was Chadwick correct in that they had been observing contamination, but they had overlooked yet another important discovery, that of nuclear fusion. Lawrences response was to press on with the creation of still larger cyclotrons. The 42-inch cyclotron was superseded by a 42-inch cyclotron in June 42 which in turn was superseded by a 42-inch cyclotron in May 42 It was used to bombard iron and produced its first radioactive isotopes in June.     As it was easier to raise money for medical purposes, particularly cancer treatment, than for nuclear physics, Lawrence encouraged the use of the cyclotron for medical research. Working with his brother John and Israel Lyon Chaikoff from the University of Californias Physiology Department, Lawrence supported research into the use of radioactive isotopes for therapeutic purposes. ": null
    },
    {
        "Phosphorus42": "phosphorus-32"
    },
    {
        " was easily produced in the cyclotron, and John used it to cure a woman afflicted with ": null
    },
    {
        "polycythemia vera": "polycythemia vera"
    },
    {
        ", a blood disease. John used phosphorus42 created in the 42-inch cyclotron in 42 in tests on mice with ": null
    },
    {
        "leukemia": "leukemia"
    },
    {
        ". He found that the radioactive phosphorus concentrated in the fast-growing cancer cells. This then led to clinical trials on human patients. A 42 evaluation of the therapy showed that remissions occurred under certain circumstances. Lawrence also had hoped for the medical use of neutrons. The first cancer patient received ": null
    },
    {
        "neutron therapy": "neutron therapy"
    },
    {
        " from the 42-inch cyclotron on November 42 Chaikoff conducted trials on the use of radioactive isotopes as ": null
    },
    {
        "radioactive tracer": "radioactive tracer"
    },
    {
        "s to explore the mechanism of biochemical reactions.     Lawrence was awarded the ": null
    },
    {
        "Nobel Prize in Physics": "nobel prize in physics"
    },
    {
        " in November 42 for the invention and development of the cyclotron and for results obtained with it, especially with regard to artificial radioactive elements .  He was the first at Berkeley as well as the first South Dakotan to become a Nobel Laureate, and the first to be so honored while at a state-supported university. The Nobel award ceremony was held on February 42 42 in ": null
    },
    {
        "Berkeley, California": "berkeley, california"
    },
    {
        ", due to ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", in the auditorium of ": null
    },
    {
        "Wheeler Hall": "wheeler hall"
    },
    {
        " on the campus of the university. Lawrence received his medal from Carl E. Wallerstedt, ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        "s ": null
    },
    {
        "Consul General": "consul general"
    },
    {
        " in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ". ": null
    },
    {
        "Robert W. Wood": "robert w. wood"
    },
    {
        " wrote to Lawrence and presciently noted As you are laying the foundations for the cataclysmic explosion of uranium ... Im sure old Nobel would approve.      In March 42 ": null
    },
    {
        "Arthur Compton": "arthur compton"
    },
    {
        ", ": null
    },
    {
        "Vannevar Bush": "vannevar bush"
    },
    {
        ", ": null
    },
    {
        "James B. Conant": "james b. conant"
    },
    {
        ", ": null
    },
    {
        "Karl T. Compton": "karl t. compton"
    },
    {
        ", and ": null
    },
    {
        "Alfred Lee Loomis": "alfred lee loomis"
    },
    {
        " traveled to Berkeley to discuss Lawrences proposal for a 42-inch cyclotron with a 42-ton magnet that was estimated to cost $42 million. The ": null
    },
    {
        "Rockefeller Foundation": "rockefeller foundation"
    },
    {
        " put up $42 million to get the project started.           After the outbreak of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " in Europe, Lawrence became drawn into military projects. He helped recruit staff for the ": null
    },
    {
        "MIT Radiation Laboratory": "mit radiation laboratory"
    },
    {
        ", where American physicists developed the ": null
    },
    {
        "cavity magnetron": "cavity magnetron"
    },
    {
        " invented by Oliphants team in Britain. The name of the new laboratory was deliberately copied from Lawrences laboratory in Berkeley for security reasons. He also became involved in recruiting staff for underwater sound laboratories to develop techniques for detecting German submarines. Meanwhile, work continued at Berkeley with cyclotrons. In December 42 ": null
    },
    {
        "Glenn T. Seaborg": "glenn t. seaborg"
    },
    {
        " and ": null
    },
    {
        "Emilio Segrè": "emilio segrè"
    },
    {
        " used the  cyclotron to bombard ": null
    },
    {
        "uranium42": "uranium-238"
    },
    {
        " with ": null
    },
    {
        "deuterons": "deuterons"
    },
    {
        " producing a new element, ": null
    },
    {
        "neptunium42": "neptunium-238"
    },
    {
        ", which decayed by ": null
    },
    {
        "beta emission": "beta emission"
    },
    {
        " to form ": null
    },
    {
        "plutonium42": "plutonium-238"
    },
    {
        ". One of its isotopes, ": null
    },
    {
        "plutonium42": "plutonium-239"
    },
    {
        ", could undergo nuclear fission which provided another way to make an ": null
    },
    {
        "atomic bomb": "atomic bomb"
    },
    {
        ".      Lawrence offered Segrè a job as a research assistant—a relatively lowly position for someone who had discovered an element—for US$42 a month for six months. However, when Lawrence learned that Segrè was legally trapped in California, he reduced Segrès salary to US$42 a month. When the regents of the University of California wanted to terminate Segrès employment owing to his foreign nationality, Lawrence managed to retain Segrè by hiring him as a part-time lecturer paid by the Rockefeller Foundation. Similar arrangements were made to retain his doctoral students ": null
    },
    {
        "Chien-Shiung Wu": "chien-shiung wu"
    },
    {
        " and ": null
    },
    {
        "Kenneth Ross MacKenzie": "kenneth ross mackenzie"
    },
    {
        " when they graduated.        In September 42 Oliphant met with Lawrence and Oppenheimer at Berkeley, where they showed him the site for the new  cyclotron. Oliphant, in turn, took the Americans to task for not following up the recommendations of the British ": null
    },
    {
        "MAUD Committee": "maud committee"
    },
    {
        ", which advocated a program to develop an ": null
    },
    {
        "atomic bomb": "atomic bomb"
    },
    {
        ". Lawrence had already thought about the problem of separating the fissile isotope ": null
    },
    {
        "uranium42": "uranium-235"
    },
    {
        " from ": null
    },
    {
        "uranium42": "uranium-238"
    },
    {
        ", a process known today as ": null
    },
    {
        "uranium enrichment": "uranium enrichment"
    },
    {
        ". Separating uranium isotopes was difficult because the two isotopes have very nearly identical chemical properties, and could only be separated gradually using their small mass differences. Separating isotopes with a ": null
    },
    {
        "mass spectrometer": "mass spectrometer"
    },
    {
        " was a technique Oliphant had pioneered with ": null
    },
    {
        "lithium": "lithium"
    },
    {
        " in 42      Lawrence began converting his old 42-inch cyclotron into a giant mass spectrometer. On his recommendation, the director of the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        ", ": null
    },
    {
        "Brigadier General": "brigadier general"
    },
    {
        " Leslie R. Groves, Jr.": "leslie r. groves, jr."
    },
    {
        ", appointed Oppenheimer as head of its ": null
    },
    {
        "Los Alamos Laboratory": "los alamos laboratory"
    },
    {
        " in ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        ". While the Radiation laboratory developed the electromagnetic uranium enrichment process, the Los Alamos Laboratory designed and constructed the atomic bombs. Like the Radiation Laboratory, it was run by the University of California.     Electromagnetic isotope separation used devices known as ": null
    },
    {
        "calutron": "calutron"
    },
    {
        "s, a hybrid of two laboratory instruments, the mass spectrometer and cyclotron. The name was derived from California university cyclotrons . In November 42 Lawrences team at Berkeley was bolstered by 42 British scientists, including Oliphant.     In the electromagnetic process, a magnetic field deflected charged particles according to mass. The process was neither scientifically elegant nor industrially efficient. Compared with a ": null
    },
    {
        "gaseous diffusion": "gaseous diffusion"
    },
    {
        " plant or a ": null
    },
    {
        "nuclear reactor": "nuclear reactor"
    },
    {
        ", an electromagnetic separation plant would consume more scarce materials, require more manpower to operate, and cost more to build. Nonetheless, the process was approved because it was based on proven technology and therefore represented less risk. Moreover, it could be built in stages, and would rapidly reach industrial capacity.       Responsibility for the design and construction of the electromagnetic separation plant at ": null
    },
    {
        "Oak Ridge, Tennessee": "oak ridge, tennessee"
    },
    {
        ", which came to be called ": null
    },
    {
        "Y42": "y-12 national security complex"
    },
    {
        ", was assigned to ": null
    },
    {
        "Stone & Webster": "stone  &  webster"
    },
    {
        ". The calutrons, using 42 tons of silver, were manufactured by ": null
    },
    {
        "Allis-Chalmers": "allis-chalmers"
    },
    {
        " in Milwaukee and shipped to Oak Ridge. The design called for five first-stage processing units, known as Alpha racetracks, and two units for final processing, known as Beta racetracks. In September 42 Groves authorized construction of four more racetracks, known as Alpha II. When the plant was started up for testing on schedule in October 42 the 42-ton vacuum tanks crept out of alignment because of the power of the magnets and had to be fastened more securely. A more serious problem arose when the magnetic coils started shorting out. In December Groves ordered a magnet to be broken open, and handfuls of rust were found inside. Groves then ordered the racetracks to be torn down and the magnets sent back to the factory to be cleaned. A pickling plant was established on-site to clean the pipes and fittings.        ": null
    },
    {
        "Tennessee Eastman": "tennessee eastman"
    },
    {
        " was hired to manage Y42 Y42 initially enriched the uranium42 content to between 42% and 42%, and shipped the first few hundred grams of this to Los Alamos laboratory in March 42 Only 42 part in 42 of the uranium feed emerged as final product. The rest was splattered over equipment in the process. Strenuous recovery efforts helped raise production to 42% of the uranium42 feed by January 42 In February the Alpha racetracks began receiving slightly enriched feed from the new ": null
    },
    {
        "S42 thermal diffusion plant": "s-50"
    },
    {
        ". The next month it received enhanced feed from the ": null
    },
    {
        "K42": "k-25"
    },
    {
        " gaseous diffusion plant. By April 42 K42 was producing uranium sufficiently enriched to feed directly into the Beta tracks.     On July 42 42 Lawrence observed the ": null
    },
    {
        "Trinity nuclear test": "trinity nuclear test"
    },
    {
        " of the first atomic bomb with Chadwick and ": null
    },
    {
        "Charles A. Thomas": "charles a. thomas"
    },
    {
        ". Few were more excited at its success than Lawrence. The question of how to use the now functional weapon on Japan became an issue for the scientists. While Oppenheimer favored no demonstration of the power of the new weapon to Japanese leaders, Lawrence felt strongly that a demonstration would be wise. When a uranium bomb was used without warning in the ": null
    },
    {
        "atomic bombing of Hiroshima": "atomic bombing of hiroshima"
    },
    {
        ", Lawrence felt great pride in his accomplishment.     Lawrence hoped that the Manhattan Project would develop improved calutrons and construct Alpha III racetracks, but they were judged to be uneconomical. The Alpha tracks were closed down in September 42 Although performing better than ever, they could not compete with K42 and the new K42 which commenced operation in January 42 In December, the Y42 plant was closed, thereby cutting the Tennessee Eastman payroll from 42 to 42 and saving $42  million a month. Staff numbers at the Radiation laboratory fell from 42 in May 42 to 42 by the end of the year.                After the war, Lawrence campaigned extensively for government sponsorship of large scientific programs. He was a forceful advocate of Big Science with its requirements for big machines and big money, and in 42 he asked the Manhattan Project for over $42 million for research at the Radiation Laboratory. Groves approved the money, but cut a number of programs, including Seaborgs proposal for a hot radiation laboratory in densely populated Berkeley, and John Lawrences for production of medical isotopes, because this need could now be better met from nuclear reactors. One obstacle was the University of California, which was eager to divest its wartime military obligations. Lawrence and Groves managed to persuade Sproul to accept a contract extension. In 42 the Manhattan Project spent $42 on physics at the University of California for every dollar spent by the University.        The 42-inch cyclotron was completed with wartime dollars from the Manhattan Project. It incorporated new ideas by Ed McMillan, and was completed as a ": null
    },
    {
        "synchrocyclotron": "synchrocyclotron"
    },
    {
        ".  It commenced operation on November 42 42 For the first time since 42 Lawrence actively participated in the experiments, working with ": null
    },
    {
        "Eugene Gardner": "eugene gardner"
    },
    {
        " in an unsuccessful attempt to create recently discovered ": null
    },
    {
        "pi meson": "pi meson"
    },
    {
        "s with the synchrotron. ": null
    },
    {
        "César Lattes": "césar lattes"
    },
    {
        " then used the apparatus they had created to find negative pi mesons in 42     Responsibility for the ": null
    },
    {
        "national laboratories": "united states department of energy national laboratories"
    },
    {
        " passed to the newly created ": null
    },
    {
        "Atomic Energy Commission": "united states atomic energy commission"
    },
    {
        " on January 42 42 That year, Lawrence asked for $42 million for his projects, which included a new linear accelerator and a new gigaelectronvolt synchrotron which became known as the ": null
    },
    {
        "bevatron": "bevatron"
    },
    {
        ". The University of Californias contract to run the Los Alamos laboratory was due to expire on July 42 42 and some board members wished to divest the university of the responsibility for running a site outside California. After some negotiation, the university agreed to extend the contract for what was now the Los Alamos National Laboratory for four more years and to appoint ": null
    },
    {
        "Norris Bradbury": "norris bradbury"
    },
    {
        ", who had replaced Oppenheimer as its director in October 42 as a professor. Soon after, Lawrence received all the funds he had requested.        Notwithstanding the fact that he voted for ": null
    },
    {
        "Franklin Roosevelt": "franklin roosevelt"
    },
    {
        ", Lawrence was a ": null
    },
    {
        "Republican": "republican party"
    },
    {
        ", who had strongly disapproved of Oppenheimers efforts before the war to unionize the Radiation Laboratory workers, which Lawrence considered leftwandering activities . Lawrence considered political activity to be a waste of time better spent in scientific research, and preferred that it be kept out of the Radiation Laboratory.    In the chilly ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " climate of the post-war University of California, Lawrence accepted the ": null
    },
    {
        "House Un-American Activities Committee": "house un-american activities committee"
    },
    {
        "s actions as legitimate, and did not see them as indicative of a systemic problem involving ": null
    },
    {
        "academic freedom": "academic freedom"
    },
    {
        " or ": null
    },
    {
        "human rights": "human rights"
    },
    {
        ". He was protective of individuals in his laboratory, but even more protective of the reputation of the laboratory. He was forced to defend Radiation Laboratory staff members like ": null
    },
    {
        "Robert Serber": "robert serber"
    },
    {
        " who were investigated by the Universitys Personnel Security Board. In several cases, he issued character references in support of staff. However, Lawrence barred Robert Oppenheimers brother ": null
    },
    {
        "Frank": "frank oppenheimer"
    },
    {
        " from the Radiation Laboratory, damaging his relationship with Robert. An acrimonious loyalty oath campaign at the University of California also drove away faculty members. When hearings were held to revoke Robert Oppenheimers security clearance, Lawrence declined to attend on account of illness, but a transcript in which he was critical of Oppenheimer was presented in his absence. Lawrences success in building a creative, collaborative laboratory was undermined by the ill-feeling and distrust resulting from political tensions.       Lawrence was alarmed by the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        "s ": null
    },
    {
        "first nuclear test": "rds-1"
    },
    {
        " in August 42 The proper response, he concluded, was an all-out effort to build a bigger nuclear weapon: the ": null
    },
    {
        "hydrogen bomb": "hydrogen bomb"
    },
    {
        ". Lawrence proposed to use accelerators instead of nuclear reactors to produce the neutrons needed to create the ": null
    },
    {
        "tritium": "tritium"
    },
    {
        " the bomb required, as well as plutonium, which was more difficult, as much higher energies would be required.  He first proposed the construction of Mark I, a prototype $42 million, 42 MeV ": null
    },
    {
        "linear accelerator": "linear accelerator"
    },
    {
        ", codenamed Materials Test Accelerator .  He was soon talking about a new, even larger MTA known as the Mark II, which could produce ": null
    },
    {
        "tritium": "tritium"
    },
    {
        " or ": null
    },
    {
        "plutonium": "plutonium"
    },
    {
        " from depleted uranium42 Serber and Segrè attempted in vain to explain the technical problems that made it impractical, but Lawrence felt that they were being unpatriotic.      Lawrence strongly backed ": null
    },
    {
        "Edward Teller": "edward teller"
    },
    {
        "s campaign for a second nuclear weapons laboratory, which Lawrence proposed to locate with the MTA Mark I at ": null
    },
    {
        "Livermore, California": "livermore, california"
    },
    {
        ". Lawrence and Teller had to argue their case not only with the Atomic Energy Commission, which did not want it, and the Los Alamos National Laboratory, which was implacably opposed but with proponents who felt that Chicago was the more obvious site for it. The new laboratory at Livermore was finally approved on July 42 42 but the Mark II MTA was canceled. By this time, the Atomic Energy Commission had spent $42 million on the Mark I, which had commenced operation, but was mainly used to produce ": null
    },
    {
        "polonium": "polonium"
    },
    {
        " for the nuclear weapons program. Meanwhile, the ": null
    },
    {
        "Brookhaven National Laboratory": "brookhaven national laboratory"
    },
    {
        "s ": null
    },
    {
        "Cosmotron": "cosmotron"
    },
    {
        " had generated a 42 GeV beam.       In addition to the Nobel Prize, Lawrence received the ": null
    },
    {
        "Elliott Cresson Medal": "elliott cresson medal"
    },
    {
        " and the ": null
    },
    {
        "Hughes Medal": "hughes medal"
    },
    {
        " in 42 the ": null
    },
    {
        "Comstock Prize in Physics": "comstock prize in physics"
    },
    {
        " in 42 the ": null
    },
    {
        "Duddell Medal and Prize": "duddell medal and prize"
    },
    {
        " in 42 the ": null
    },
    {
        "Holley Medal": "holley medal"
    },
    {
        " in 42 the ": null
    },
    {
        "Medal for Merit": "medal for merit"
    },
    {
        " in 42 the ": null
    },
    {
        "William Procter Prize": "william procter prize for scientific achievement"
    },
    {
        " in 42 ": null
    },
    {
        "Faraday Medal": "faraday medal"
    },
    {
        " in 42 and the ": null
    },
    {
        "Enrico Fermi Award": "enrico fermi award"
    },
    {
        " from the Atomic Energy Commission in 42 He was made an ": null
    },
    {
        "Officer of the Legion dHonneur": "legion dhonneur"
    },
    {
        " in 42 and was the first recipient of the ": null
    },
    {
        "Sylvanus Thayer Award": "sylvanus thayer award"
    },
    {
        " by the ": null
    },
    {
        "US Military Academy": "united states military academy"
    },
    {
        " in 42     In July 42 President ": null
    },
    {
        "Dwight D. Eisenhower": "dwight d. eisenhower"
    },
    {
        " asked Lawrence to travel to ": null
    },
    {
        "Geneva, Switzerland": "geneva, switzerland"
    },
    {
        ", to help negotiate a proposed ": null
    },
    {
        "Partial Nuclear Test Ban Treaty": "partial nuclear test ban treaty"
    },
    {
        " with the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". AEC Chairman ": null
    },
    {
        "Lewis Strauss": "lewis strauss"
    },
    {
        " had pressed for Lawrences inclusion. The two men had argued the case for the development of the hydrogen bomb, and Strauss had helped raise funds for Lawrences cyclotron in 42 Strauss was keen to have Lawrence as part of the Geneva delegation because Lawrence was known to favor continued nuclear testing. Despite suffering from a serious flare-up of his chronic ": null
    },
    {
        "ulcerative colitis": "ulcerative colitis"
    },
    {
        ", Lawrence decided to go, but he became ill while in Geneva, and was rushed back to the hospital at ": null
    },
    {
        "Stanford University": "stanford university"
    },
    {
        ". Surgeons ": null
    },
    {
        "removed much of his large intestine": "ileostomy"
    },
    {
        ", but found other problems, including severe ": null
    },
    {
        "atherosclerosis": "atherosclerosis"
    },
    {
        " in one of his arteries. He died in Palo Alto Hospital on August 42 42 Molly did not want a public funeral but agreed to a memorial service at the First Congregationalist Church in Berkeley. University of California President ": null
    },
    {
        "Clark Kerr": "clark kerr"
    },
    {
        " delivered the ": null
    },
    {
        "eulogy": "eulogy"
    },
    {
        ".     Just 42 days after his death, the ": null
    },
    {
        "Regents of the University of California": "regents of the university of california"
    },
    {
        " voted to rename two of the universitys nuclear research sites after Lawrence: the ": null
    },
    {
        "Lawrence Livermore National Laboratory": "lawrence livermore national laboratory"
    },
    {
        " and the ": null
    },
    {
        "Lawrence Berkeley National Laboratory": "lawrence berkeley national laboratory"
    },
    {
        ".  The ": null
    },
    {
        "Ernest Orlando Lawrence Award": "ernest orlando lawrence award"
    },
    {
        " was established in his memory in 42  Chemical element number 42 discovered at the Lawrence Berkeley National Laboratory in 42 was named ": null
    },
    {
        "lawrencium": "lawrencium"
    },
    {
        " after him.  In 42 the ": null
    },
    {
        "Lawrence Hall of Science": "lawrence hall of science"
    },
    {
        " public science education center was established in his honor. His papers are in the ": null
    },
    {
        "Bancroft Library": "bancroft library"
    },
    {
        " at the University of California in Berkeley.      In the 42s, Lawrences widow petitioned the University of California Board of Regents on several occasions to remove her husbands name from the Livermore Laboratory, due to its focus on nuclear weapons Lawrence helped build, but was denied each time.     She outlived her husband by more than 42 years and died in ": null
    },
    {
        "Walnut Creek, California": "walnut creek, california"
    },
    {
        ", at the age of 42 on January 42 42     ": null
    },
    {
        "George B. Kauffman": "george b. kauffman"
    },
    {
        " wrote that:        ": null
    }
]