[
    {
        "   Ernst Friedrich Ferdinand Zermelo  was a German ": null
    },
    {
        "logician": "logician"
    },
    {
        " and ": null
    },
    {
        "mathematician": "mathematician"
    },
    {
        ", whose work has major implications for the ": null
    },
    {
        "foundations of mathematics": "foundations of mathematics"
    },
    {
        ". He is known for his role in developing ": null
    },
    {
        "Zermelo–Fraenkel axiomatic set theory": "zermelo–fraenkel set theory"
    },
    {
        " and his proof of the ": null
    },
    {
        "well-ordering theorem": "well-ordering theorem"
    },
    {
        ".          Ernst Zermelo graduated from Berlins Luisenstädtisches Gymnasium  in 42 He then studied ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "physics": "physics"
    },
    {
        " and ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " at the universities of ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", ": null
    },
    {
        "Halle": "halle, saxony-anhalt"
    },
    {
        " and ": null
    },
    {
        "Freiburg": "freiburg"
    },
    {
        ". He finished his doctorate in 42 at the ": null
    },
    {
        "University of Berlin": "university of berlin"
    },
    {
        ", awarded for a dissertation on the ": null
    },
    {
        "calculus of variations": "calculus of variations"
    },
    {
        " . Zermelo remained at the University of Berlin, where he was appointed assistant to ": null
    },
    {
        "Planck": "max planck"
    },
    {
        ", under whose guidance he began to study ": null
    },
    {
        "hydrodynamics": "hydrodynamics"
    },
    {
        ". In 42 Zermelo went to ": null
    },
    {
        "Göttingen": "göttingen"
    },
    {
        ", at that time the leading centre for mathematical research in the world, where he completed his ": null
    },
    {
        "habilitation thesis": "habilitation thesis"
    },
    {
        " in 42     In 42 Zermelo left Göttingen upon being appointed to the chair of mathematics at ": null
    },
    {
        "Zurich University": "university of zurich"
    },
    {
        ", which he resigned in 42   He was appointed to an honorary chair at the ": null
    },
    {
        "University of Freiburg": "university of freiburg"
    },
    {
        " in 42 which he resigned in 42 because he disapproved of Adolf Hitlers regime. At the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and at his request, Zermelo was reinstated to his honorary position in Freiburg.              In 42 in the Paris conference of the ": null
    },
    {
        "International Congress of Mathematicians": "international congress of mathematicians"
    },
    {
        ", ": null
    },
    {
        "David Hilbert": "david hilbert"
    },
    {
        " challenged the mathematical community with his famous ": null
    },
    {
        "Hilberts problems": "hilberts problems"
    },
    {
        ", a list of 42 unsolved fundamental questions which mathematicians should attack during the coming century. The first of these, a problem of ": null
    },
    {
        "set theory": "set theory"
    },
    {
        ", was the ": null
    },
    {
        "continuum hypothesis": "continuum hypothesis"
    },
    {
        " introduced by ": null
    },
    {
        "Cantor": "georg cantor"
    },
    {
        " in 42 and in the course of its statement Hilbert mentioned also the need to prove the ": null
    },
    {
        "well-ordering theorem": "well-ordering theorem"
    },
    {
        ".     Zermelo began to work on the problems of set theory under Hilberts influence and in 42 published his first work concerning the addition of ": null
    },
    {
        "transfinite cardinals": "cardinal numbers"
    },
    {
        ". By that time he had also discovered the so-called ": null
    },
    {
        "Russell paradox": "russell paradox"
    },
    {
        ". In 42 he succeeded in taking the first step suggested by Hilbert towards the continuum hypothesis when he proved the ": null
    },
    {
        "well-ordering theorem": "well-ordering theorem"
    },
    {
        " . This result brought fame to Zermelo, who was appointed Professor in Göttingen, in 42 His proof of the ": null
    },
    {
        "well-ordering theorem": "well-ordering theorem"
    },
    {
        ", based on the powerset axiom and the ": null
    },
    {
        "axiom of choice": "axiom of choice"
    },
    {
        ", was not accepted by all mathematicians, mostly because the axiom of choice was a paradigm of non-constructive mathematics. In 42 Zermelo succeeded in producing an improved proof making use of Dedekinds notion of the chain of a set, which became more widely accepted; this was mainly because that same year he also offered an ": null
    },
    {
        "axiomatization": "axiomatization"
    },
    {
        " of set theory.     Zermelo began to axiomatize set theory in 42; in 42 he published his results despite his failure to prove the consistency of his axiomatic system. See the article on ": null
    },
    {
        "Zermelo set theory": "zermelo set theory"
    },
    {
        " for an outline of this paper, together with the original axioms, with the original numbering.     In 42 ": null
    },
    {
        "Adolf Fraenkel": "adolf fraenkel"
    },
    {
        " and ": null
    },
    {
        "Thoralf Skolem": "thoralf skolem"
    },
    {
        " independently improved Zermelos axiom system. The resulting 42 axiom system, now called ": null
    },
    {
        "Zermelo-Fraenkel axioms": "zermelo–fraenkel set theory"
    },
    {
        " , is now the most commonly used system for ": null
    },
    {
        "axiomatic set theory": "axiomatic set theory"
    },
    {
        ".     Proposed in 42 the ": null
    },
    {
        "Zermelos navigation problem": "zermelos navigation problem"
    },
    {
        " is a classic ": null
    },
    {
        "optimal control": "optimal control"
    },
    {
        " problem. The problem deals with a boat navigating on a body of water, originating from a point O to a destination point D. The boat is capable of a certain maximum speed, and we want to derive the best possible control to reach D in the least possible time.     Without considering external forces such as current and wind, the optimal control is for the boat to always head towards D. Its path then is a line segment from O to D, which is trivially optimal. With consideration of current and wind, if the combined force applied to the boat is non-zero the control for no current and wind does not yield the optimal path.           ": null
    },
    {
        "Jean van Heijenoort": "jean van heijenoort"
    },
    {
        ", 42 From Frege to Gödel: A Source Book in Mathematical Logic, 42–42. Harvard Univ. Press.   42 Proof that every set can be well-ordered, 42−42   42 A new proof of the possibility of well-ordering, 42–42   42 Investigations in the foundations of set theory I, 42–42   42 On an Application of Set Theory to the Theory of the Game of Chess in Rasmusen E., ed., 42 Readings in Games and Information, Wiley-Blackwell: 42–42   42 On boundary numbers and domains of sets: new investigations in the foundations of set theory in Ewald, William B., ed., 42 From Kant to Hilbert: A Source Book in the Foundations of Mathematics, 42 vols. ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ": 42–42     Works by others:   Zermelos Axiom of Choice, Its Origins, Development, & Influence, Gregory H. Moore, being Volume 42 of Studies in the History of Mathematics and Physical Sciences,": null
    }
]