[
    {
        "        Erotica is any literary or artistic work that deals substantively with subject matter that is ": null
    },
    {
        "erotically": "Eroticism"
    },
    {
        " stimulating": "Sexual Stimulation"
    },
    {
        " or ": null
    },
    {
        "sexually arousing": "Sexual Arousal"
    },
    {
        " but is not ": null
    },
    {
        "pornographic": "Pornographic"
    },
    {
        ". ": null
    },
    {
        "Erotic art": "Erotic Art"
    },
    {
        " may use any artistic form to depict erotic content, including ": null
    },
    {
        "painting": "Painting"
    },
    {
        ", ": null
    },
    {
        "sculpture": "Sculpture"
    },
    {
        ", ": null
    },
    {
        "drama": "Drama"
    },
    {
        ", ": null
    },
    {
        "film": "Erotic Film"
    },
    {
        " or ": null
    },
    {
        "music": "Music"
    },
    {
        ". ": null
    },
    {
        "Erotic literature": "Erotic Literature"
    },
    {
        " and ": null
    },
    {
        "erotic photography": "Erotic Photography"
    },
    {
        " have become genres in their own right.     Curiosa is erotica and pornography as discrete, ": null
    },
    {
        "collectable": "Collectable"
    },
    {
        " items, usually in published or printed form. In the ": null
    },
    {
        "antiquarian": "Antiquarian"
    },
    {
        " book trade, pornographic works are often listed under curiosa , erotica or ": null
    },
    {
        "facetiae": "Facetiae"
    },
    {
        " .        A distinction is often made between erotica and ": null
    },
    {
        "pornography": "Pornography"
    },
    {
        " , although some viewers may not distinguish between them. A key distinction, some have argued, is that pornographys objective is the graphic depiction of sexually explicit scenes, while erotica seeks to tell a story that involves sexual themes that include a more plausible depiction of human sexuality than in pornography. . William J. Gehrke. The Tech. December 10, 1996. Additionally, works considered degrading or exploitative tend to be classified by those who see them as such, as porn rather than as erotica and consequently, pornography is often described as exploitative or degrading. . Jug Suraiya.  The Times of India . August 15, 2004. Many countries have laws banning or at least regulating what is considered pornographic material, which generally does not apply to erotica.     Feminist writer ": null
    },
    {
        "Gloria Steinem": "Gloria Steinem"
    },
    {
        " distinguishes erotica from pornography, writing: Erotica is as different from pornography as love is from rape, as dignity is from humiliation, as partnership is from slavery, as pleasure is from pain. Steinems argument hinges on the distinction between reciprocity versus domination, as she writes: Blatant or subtle, pornography involves no equal power or mutuality. In fact, much of the tension and drama comes from the clear idea that one person is dominating the other.    The Naked Maja by ": null
    },
    {
        "Francisco de Goya": "Francisco De Goya"
    },
    {
        " Édouard-Henri Avril": "Édouard-Henri Avril"
    },
    {
        " terracotta": "Terracotta"
    },
    {
        " plaque depicting a man and a woman having ": null
    },
    {
        "sexual intercourse": "Sexual Intercourse"
    },
    {
        ". From ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    }
]