[
    {
        "     Erpe-Mere  is a ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "East Flanders": "east flanders"
    },
    {
        " in the ": null
    },
    {
        "Denderstreek": "denderstreek"
    },
    {
        ". The municipality comprises the towns of ": null
    },
    {
        "Aaigem": "aaigem"
    },
    {
        ", ": null
    },
    {
        "Bambrugge": "bambrugge"
    },
    {
        ", ": null
    },
    {
        "Burst": "burst"
    },
    {
        ", ": null
    },
    {
        "Erondegem": "erondegem"
    },
    {
        ", ": null
    },
    {
        "Erpe": "erpe"
    },
    {
        ", ": null
    },
    {
        "Mere": "mere, belgium"
    },
    {
        ", ": null
    },
    {
        "Ottergem": "ottergem"
    },
    {
        " and ": null
    },
    {
        "Vlekkem": "vlekkem"
    },
    {
        ". There is also a hamlet in Bambrugge: ": null
    },
    {
        "Egem": "egem"
    },
    {
        ". Erpe-Mere is crossed by 42 brooks, the ": null
    },
    {
        "Molenbeek": "molenbeek"
    },
    {
        " and the ": null
    },
    {
        "Molenbeek-Ter Erpenbeek": "molenbeek-ter erpenbeek"
    },
    {
        ". On January 42 42 Erpe-Mere had a total population of 42. The total area is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km². The current mayor of Erpe-Mere is Hugo De Waele, from the CD & V party.       The municipality was formed in 42 by the merger of the eight sub-municipalities of today, but the sub-communities Erpe and Mere initially disagreed on the new name for the merged municipality. While Erpe had the largest area, Mere was central in the entire area and had more inhabitants. As a compromise they choose the double name Erpe-Mere.          The municipality is bordered to the north by ": null
    },
    {
        "Lede": "lede, belgium"
    },
    {
        ", in the east by ": null
    },
    {
        "Aalst": "aalst, belgium"
    },
    {
        " and ": null
    },
    {
        "Haaltert": "haaltert"
    },
    {
        ", in the south by ": null
    },
    {
        "Herzele": "herzele"
    },
    {
        " and in the west by ": null
    },
    {
        "Sint-Lievens-Houtem": "sint-lievens-houtem"
    },
    {
        ". Erpe-Mere is located north of the foothills of the ": null
    },
    {
        "Flemish Ardennes": "flemish ardennes"
    },
    {
        ", in the region ": null
    },
    {
        "Denderstreek": "denderstreek"
    },
    {
        ". The area north of the N42 is between 42 and 42 meters high, the area between the N42 and E42 is between 42 and 42 meters high and the area south of it has hills peaks up to 42 meters. The most famous of them is the Gotegemberg in Mere, not for his height of 42 meters, but for its slope of 42% making it a popular challenge for cyclists.     The territory is traversed by two brooks that both bear the name Molenbeek. The Molenbeek from the Upper Scheldt crosses Burst, Bambrugge, Ottergem, Vlekkem and Erondegem before it flows into the Scheldt. The Molenbeek-Ter Erpenbeek flows into the Dender.     The Romans knew early there was white natural stone called Vlaamse Arduin or Lediaanse Steen in Steenberg of Bambrugge. This white natural stone was suitable as a foundation for the masonry of Roman villas and as building material for columns and capitals of the Roman temples. From about the 42th or 42th century there was already extracted white sandstone in Bambrugge . The common types of white natural stone in Brabant in the 42th to 42th Century were extracted in Steenberg. Extraction continued until after World War II. Today it is the administrative center of Erpe-Mere.     There is a 42 hectare nature reserve called ": null
    },
    {
        "Den Dotter": "den dotter"
    },
    {
        " in the sub-municipalities of ": null
    },
    {
        "Aaigem": "aaigem"
    },
    {
        " and ": null
    },
    {
        "Heldergem": "heldergem"
    },
    {
        " .       Erpe-Mere has an exit to the ": null
    },
    {
        "A42": "a10 motorway"
    },
    {
        "/": null
    },
    {
        "E42": "european route e40"
    },
    {
        " and a regional railway station on the railway line Kortrijk–Oudenaarde–Zottegem–Erpe-Mere–Aalst–Brussels. Also the N42 , the N42 and the N42 cross the municipality.       The water tower of the Tussengemeentelijke Maatschappij der Vlaanderen voor Watervoorziening.         Landmarks include the mills of the municipality, through which runs the Denderroute South and the Molenbeekroute. Due to the geography of the area, there are eleven water mills in Erpe-Mere, with Erpe-Mere having the most water mills in Belgium, seven of which are protected by law. One mill was largely demolished, but there are still remains of this mill and the mill house is still intact. Another mill was also converted into a house. On the Koudenberg, one of the highest hills of the community, there is a windmill that is protected by law. It was re-mounted on its base in 42 after being restored in 42 by a studio in Roeselare. The Kruiskoutermolen was restored in 42 and is operational. It can be visited by appointment with the tourist service.      ": null
    },
    {
        "KRC Bambrugge": "krc bambrugge"
    },
    {
        ", ": null
    },
    {
        "KFC Olympic Burst": "kfc olympic burst"
    },
    {
        ", ": null
    },
    {
        "FC Mere": "fc mere"
    },
    {
        " and ": null
    },
    {
        "SK Aaigem": "sk aaigem"
    },
    {
        ". ": null
    },
    {
        "FC Edixvelde": "fc edixvelde"
    },
    {
        " was absorbed by FC Mere. ": null
    },
    {
        "FC Oranja Erpe": "fc oranja erpe"
    },
    {
        " and ": null
    },
    {
        "KFC Olympia Erondegem": "kvc erpe erondegemkfc olympia erondegem"
    },
    {
        " merged into KVC Erperondegem that was some years later also absorbed by FC Mere.     Each year the Steenbergcross, the first international ": null
    },
    {
        "cyclo-cross": "cyclo-cross"
    },
    {
        " race of the season, is held at Steenberg in Bambrugge. The national clubhouse of the motorcycle club ": null
    },
    {
        "Blue Angels": "blue angels motorcycle club"
    }
]