[
    {
        "                  Johannes Erwin Eugen Rommel was a German general and military theorist. Popularly known as the Desert Fox, he served as ": null
    },
    {
        "field marshal": "Field Marshal"
    },
    {
        " in the ": null
    },
    {
        "Wehrmacht": "Wehrmacht"
    },
    {
        " of ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        " during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", as well as serving in the ": null
    },
    {
        "Reichswehr": "Reichswehr"
    },
    {
        " of the ": null
    },
    {
        "Weimar Republic": "Weimar Republic"
    },
    {
        ", and the army of ": null
    },
    {
        "Imperial Germany": "German Empire"
    },
    {
        ".     Rommel was a highly decorated officer in World War I and was awarded the  Pour le Mérite  for his actions on the ": null
    },
    {
        "Italian Front": "Italian Front"
    },
    {
        ". In 1937 he published his classic book on military tactics,  Infantry Attacks , drawing on his experiences from World War I. In World War II, he distinguished himself as the commander of the ": null
    },
    {
        "7th Panzer Division": "7Th Panzer Division"
    },
    {
        " during the ": null
    },
    {
        "1940 invasion of France": "Battle Of France"
    },
    {
        ". His leadership of German and Italian forces in the ": null
    },
    {
        "North African campaign": "North African Campaign"
    },
    {
        " established his reputation as one of the most able tank commanders of the war, and earned him the nickname der Wüstenfuchs, the Desert Fox . Among his British adversaries he had a reputation for ": null
    },
    {
        "chivalry": "Chivalry"
    },
    {
        ", and his phrase war without hate has been used to describe the North African campaign.  He later commanded the German forces opposing the ": null
    },
    {
        "Allied": "Allies Of World War Ii"
    },
    {
        " cross-channel ": null
    },
    {
        "invasion of Normandy": "Invasion Of Normandy"
    },
    {
        " in June 1944.     Rommel supported the ": null
    },
    {
        "Nazi seizure of power": "Nazi Seizure Of Power"
    },
    {
        " and ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        ", although his reluctant stance towards ": null
    },
    {
        "antisemitism": "Antisemitism"
    },
    {
        " and ": null
    },
    {
        "Nazi ideology": "Nazi Ideology"
    },
    {
        " and his level of knowledge of ": null
    },
    {
        "the Holocaust": "The Holocaust"
    },
    {
        " remain matters of debate among scholars. In 1944, Rommel was ": null
    },
    {
        "implicated": "Plot Against Hitler"
    },
    {
        " in the ": null
    },
    {
        "20 July plot": "20 July Plot"
    },
    {
        " to assassinate Hitler. Due to Rommels status as a national hero, Hitler desired to eliminate him quietly instead of immediately executing him, as many other plotters were. Rommel was given a choice between committing ": null
    },
    {
        "suicide": "Suicide"
    },
    {
        ", in return for assurances that his reputation would remain intact and that his family would not be persecuted following his death, or facing a trial that would result in his disgrace and execution; he chose the former and committed suicide using a ": null
    },
    {
        "cyanide pill": "Cyanide Pill"
    },
    {
        ".  Rommel was given a state funeral, and it was announced that he had succumbed to his injuries from the strafing of his staff car in Normandy.     Rommel has become a larger-than-life figure in both Allied and ": null
    },
    {
        "Nazi propaganda": "Nazi Propaganda"
    },
    {
        ", and in postwar popular culture, with numerous authors considering him an apolitical, brilliant commander and a victim of the ": null
    },
    {
        "Third Reich": "Third Reich"
    },
    {
        " although this assessment is contested by other authors as the ": null
    },
    {
        "Rommel myth": "Rommel Myth"
    },
    {
        ". Rommels reputation for conducting a clean war was used in the interest of the ": null
    },
    {
        "West German rearmament": "Wiederbewaffnung"
    },
    {
        " and reconciliation between the former enemies – the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " and the ": null
    },
    {
        "United States": "United States"
    },
    {
        " on one side and the new ": null
    },
    {
        "Federal Republic of Germany": "Federal Republic Of Germany"
    },
    {
        " on the other. Several of Rommels former subordinates, notably his chief of staff ": null
    },
    {
        "Hans Speidel": "Hans Speidel"
    },
    {
        ", played key roles in ": null
    },
    {
        "German rearmament": "Wiederbewaffnung"
    },
    {
        " and integration into ": null
    },
    {
        "NATO": "Nato"
    },
    {
        " in the postwar era. The German Armys largest military base, the ": null
    },
    {
        "Field Marshal Rommel Barracks, Augustdorf": "Field Marshal Rommel Barracks, Augustdorf"
    },
    {
        ", is named in his honour.            Rommel was born on 15 November 1891 in ": null
    },
    {
        "Southern Germany": "Southern Germany"
    },
    {
        " at ": null
    },
    {
        "Heidenheim": "Heidenheim An Der Brenz"
    },
    {
        ",  from ": null
    },
    {
        "Ulm": "Ulm"
    },
    {
        ", in the ": null
    },
    {
        "Kingdom of Württemberg": "Kingdom Of Württemberg"
    },
    {
        ", then part of the ": null
    },
    {
        "German Empire": "German Empire"
    },
    {
        ". He was the third of five children of Erwin Rommel Senior , a teacher and school administrator, and his wife Helene von Lutz, whose father ": null
    },
    {
        "Karl von Luz": "Karl Von Luz"
    },
    {
        " headed the local government council. As a young man Rommels father had been a lieutenant in the artillery. Rommel had one older sister, an art teacher who was his favorite sibling, one older brother named Manfred who died in infancy and two younger brothers, of whom one became a successful dentist and the other an opera singer.     At age 18 Rommel joined the local 124th Württemberg Infantry Regiment as a  Fähnrich  , in 1910, studying at the Officer Cadet School in ": null
    },
    {
        "Danzig": "Danzig"
    },
    {
        ". He graduated in November 1911 and was commissioned as a ": null
    },
    {
        "lieutenant": "Lieutenant"
    },
    {
        " in January 1912 and was assigned to the 124th Infantry in ": null
    },
    {
        "Weingarten": "Weingarten, Württemberg"
    },
    {
        ". He was posted to Ulm in March 1914 to the 46th Field Artillery Regiment, ": null
    },
    {
        "XIII Corps": "Xiii  Corps"
    },
    {
        ", as a battery commander. He returned to the 124th when war was declared. While at Cadet School, Rommel met his future wife, 17-year-old Lucia Maria Mollin , of Polish and Italian descent.            During World War I, Rommel fought in ": null
    },
    {
        "France": "France"
    },
    {
        " as well as in the ": null
    },
    {
        "Romanian": "Romanian Campaign"
    },
    {
        "  and ": null
    },
    {
        "Italian campaigns": "Italian Campaign"
    },
    {
        ". He successfully employed the tactics of penetrating enemy lines with heavy covering fire coupled with rapid advances, as well as moving forward rapidly to a flanking position to arrive at the rear of hostile positions, to achieve tactical surprise. His first combat experience was on 22 August 1914 as a platoon commander near Verdun, when – catching a French garrison unprepared – Rommel and three men opened fire on them without ordering the rest of his platoon forward. The armies continued to skirmish in open engagements throughout September, as the static ": null
    },
    {
        "trench warfare": "Trench Warfare"
    },
    {
        " typical of the First World War was still in the future. For his actions in September 1914 and January 1915, Rommel was awarded the ": null
    },
    {
        "Iron Cross": "Iron Cross"
    },
    {
        ", Second Class. Rommel was promoted to  Oberleutnant  and transferred to the newly created Royal Wurttemberg Mountain Battalion of the  Alpenkorps  in September 1915, as a company commander. In November 1916 in Danzig, Rommel and Lucia married.     In August 1917, his unit was involved in the ": null
    },
    {
        "battle for Mount Cosna": "Second Battle Of Oituz"
    },
    {
        ", a heavily fortified objective on the border between Hungary and Romania, which they took after two weeks of difficult uphill fighting. The Mountain Battalion was next assigned to the ": null
    },
    {
        "Isonzo front": "Italian Front"
    },
    {
        ", in a mountainous area in Italy. The offensive, known as the ": null
    },
    {
        "Battle of Caporetto": "Battle Of Caporetto"
    },
    {
        ", began on 24 October 1917. Rommels battalion, consisting of three rifle companies and a machine gun unit, was part of an attempt to take enemy positions on three mountains: ": null
    },
    {
        "Kolovrat": "Kolovrat"
    },
    {
        ", ": null
    },
    {
        "Matajur": "Matajur"
    },
    {
        ", and Stol. In two and a half days, from 25 to 27 October, Rommel and his 150 men captured 81 guns and 9,000 men , at the loss of six dead and 30 wounded. Rommel achieved this remarkable success by taking advantage of the terrain to outflank the Italian forces, attacking from unexpected directions or behind enemy lines, and taking the initiative to attack when he had orders to the contrary. In one instance, the Italian forces, taken by surprise and believing that their lines had collapsed, surrendered after a brief firefight. In this battle, Rommel helped pioneer ": null
    },
    {
        "infiltration tactics": "Infiltration Tactics"
    },
    {
        ", a new form of maneuver warfare just being adopted by German armies, and later by foreign armies, and described by some as Blitzkrieg without tanks. He played no role in the early adoption of Blitzkrieg in World War II though. Acting as advance guard in the capture of ": null
    },
    {
        "Longarone": "Longarone"
    },
    {
        " on 9 November, Rommel again decided to attack with a much smaller force. Convinced that they were surrounded by an entire German division, the 1st Italian Infantry Division – 10,000 men – surrendered to Rommel. For this and his actions at Matajur, he received the order of ": null
    },
    {
        "Pour le Mérite": "Pour Le Mérite"
    },
    {
        ".     In January 1918, Rommel was promoted to  Hauptmann  and assigned to a staff position with XLIV Army Corps, where he served for the remainder of the war.       Rommel remained with the 124th Regiment until October 1920. The regiment was involved in quelling riots and civil disturbances that were occurring throughout Germany at this time. Wherever possible Rommel avoided the use of force in these confrontations. In 1919 he was briefly sent to Friedrichshafen on Lake Constance, where he restored order by sheer force of personality in the 32nd Internal Security Company, which was composed of rebellious and pro-communist sailors. He decided against storming the nearby city of ": null
    },
    {
        "Lindau": "Lindau"
    },
    {
        ", which had been taken by revolutionary communists.  Instead, Rommel negotiated with the city council and managed to return it to the legitimate government through diplomatic means. This was followed by his defence of ": null
    },
    {
        "Schwäbisch Gmünd": "Schwäbisch Gmünd"
    },
    {
        ", again bloodless. He was then posted to the Ruhr where a red army was responsible for fomenting unrest. Historian  praises Rommel as a coolheaded and moderate mind, exceptional amid the many takeovers of revolutionary cities by regular and irregular units and the associated massive violence.     According to Reuth, this period left an indelible impression on Rommels mind that Everyone in this Republic was fighting each other, along with direct experience of people attempting to convert Germany into a socialist republic on Soviet lines. There are similarities with Hitlers experiences: like Rommel, Hitler had known the solidarity of trench warfare and had then participated in the Reichswehrs suppression of the First and Second Bavarian Soviet Republics. The need for national unity thus became a decisive legacy of the first World War. Brighton notes that while both believed in the ": null
    },
    {
        "Stab-in-the-back myth": "Stab-In-The-Back Myth"
    },
    {
        ", Rommel was able to succeed using peaceful methods because he saw the problem in empty stomachs rather than in Judeo-Bolshevism & ndash; which right-wing soldiers such as Hitler blamed for the chaos in Germany.          On 1 October 1920 Rommel was appointed to a company command with the 13th Infantry Regiment in Stuttgart, a post he held for the next nine years. He was then assigned as an instructor at the ": null
    },
    {
        "Dresden": "Dresden"
    },
    {
        " Infantry School from 1929 to 1933, and during this time was promoted to major, in April 1932. While at Dresden, he wrote a manual on infantry training, published in 1934. In October 1933 he was promoted to  Oberstleutnant  and given his next command, the 3rd  Jäger  Battalion, 17th Infantry Regiment, stationed at ": null
    },
    {
        "Goslar": "Goslar"
    },
    {
        ". Here he first met Hitler, who inspected his troops on 30 September 1934. In September 1935 Rommel was moved to the War Academy at Potsdam as an instructor, for the next three years. His book  Infanterie greift an  , a description of his wartime experiences along with his analysis, was published in 1937. It became a bestseller, which, according to Scheck, later enormously influenced many armies of the world;   in Scribd. ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        " was one of many people who owned a copy.     Hearing of Rommels reputation as an outstanding military instructor, in February 1937 Hitler assigned him as the War Ministry liaison officer to the ": null
    },
    {
        "Hitler Youth": "Hitler Youth"
    },
    {
        " in charge of military training. Here he clashed with ": null
    },
    {
        "Baldur von Schirach": "Baldur Von Schirach"
    },
    {
        ", the Hitler Youth leader, over the training that the boys should receive. Trying to fulfill a mission assigned to him by the Ministry of War, Rommel had proposed a plan that would have effectively subordinated Hitler Youth to the army, removing it from NSDAP control. That went against Schirachs express wishes. Schirach appealed directly to Hitler; consequently Rommel was quietly removed from the project in 1938. He had been promoted to  Oberst  , on 1 August 1937, and in 1938 he was appointed commandant of the ": null
    },
    {
        "Theresian Military Academy": "Theresian Military Academy"
    },
    {
        " at ": null
    },
    {
        "Wiener Neustadt": "Wiener Neustadt"
    },
    {
        ". In October 1938 Hitler specially requested that Rommel be seconded to command the  Führerbegleitbatallion  . This unit accompanied Hitler whenever he traveled outside of Germany. During this period Rommel indulged his interest in engineering and mechanics by learning about the inner workings and maintenance of internal combustion engines and heavy machine guns. He memorized ": null
    },
    {
        "logarithm tables": "Logarithm Tables"
    },
    {
        " in his spare time and enjoyed skiing and other outdoor sports.                Rommel was promoted to  Generalmajor  on 23 August 1939 and assigned as commander of the  Führerbegleitbatallion , tasked with guarding Hitler and his field headquarters during the ": null
    },
    {
        "invasion of Poland": "Invasion Of Poland"
    },
    {
        ", which began on 1 September. According to Remy, Rommels private letters at this time show that he did not understand Hitlers true nature and intentions, as he quickly went from predicting a swift peaceful settlement of tensions to approving Hitlers reaction to the ": null
    },
    {
        "Gleiwitz incident": "Gleiwitz Incident"
    },
    {
        " . Hitler took a personal interest in the campaign, often moving close to the front in the  Führersonderzug  . Rommel attended Hitlers daily war briefings and accompanied him everywhere, making use of the opportunity to observe first-hand the use of tanks and other motorized units. On 26 September Rommel returned to Berlin to set up a new headquarters for his unit in the ": null
    },
    {
        "Reich Chancellery": "Reich Chancellery"
    },
    {
        ". Rommel returned briefly to Warsaw on 5 October to prepare for the German victory parade. He described the devastated Warsaw in a letter to his wife, concluding with: There has been no water, no power, no gas, no food for two days. They have erected numerous barricades which blocked civilian movement and exposed people to bombardments from which they could not escape. The mayor estimated the number of the dead and injured to be 40,000  ... The inhabitants probably drew a breath of relief that we have arrived and rescued them .                Following the campaign in Poland, Rommel began lobbying for command of one of Germanys ": null
    },
    {
        "panzer division": "Panzer Division"
    },
    {
        "s, of which there were then only ten. Rommels successes in World War I were based on surprise and manoeuvre, two elements for which the new panzer units were ideally suited. Rommel received a promotion to a generals rank from Hitler ahead of more senior officers. Rommel obtained the command he aspired to, despite having been earlier turned down by the armys personnel office, which had offered him command of a mountain division instead. According to Caddick-Adams, he was backed by Hitler, the influential Fourteenth Army commander ": null
    },
    {
        "Wilhelm List": "Wilhelm List"
    },
    {
        " and likely Guderian as well.     Going against military protocol, this promotion added to Rommels growing reputation as one of Hitlers favoured commanders, although his later outstanding leadership in France quelled complaints about his self-promotion and political scheming. The ": null
    },
    {
        "7th Panzer Division": "7Th Panzer Division"
    },
    {
        " had recently been converted to an armoured division consisting of 218 tanks in three battalions , with two rifle regiments, a motorcycle battalion, an engineer battalion, and an anti-tank battalion. Upon taking command on 10 February 1940, Rommel quickly set his unit to practising the maneuvers they would need in the upcoming campaign.       The invasion began on 10 May 1940. By the third day Rommel and the advance elements of his division, together with a detachment of the 5th Panzer Division under Colonel Hermann Werner, had reached the ": null
    },
    {
        "River Meuse": "River Meuse"
    },
    {
        ", where they found the bridges had already been destroyed .  Rommel was active in the forward areas, directing the efforts to make a crossing, which were initially unsuccessful due to suppressive fire by the French on the other side of the river. Rommel brought up tanks and ": null
    },
    {
        "flak": "Flak"
    },
    {
        " units to provide counter-fire and had nearby houses set on fire to create a smokescreen. He sent infantry across in rubber boats, appropriated the bridging tackle of the ": null
    },
    {
        "5th Panzer Division": "5Th Panzer Division"
    },
    {
        ", personally grabbed a light machine gun to fight off a French counterattack supported by tanks, and went into the water himself, encouraging the sappers and helping lash together the pontoons. By 16 May Rommel reached ": null
    },
    {
        "Avesnes": "Avesnes"
    },
    {
        ", and contravening all orders and doctrine, he pressed on to Cateau. That night, the French II Army Corps was shattered and on 17 May, Rommels forces took 10,000 prisoners, losing 36 men in the process. He was surprised to find out only his vanguard had followed his tempestuous surge. The High Command and Hitler had been extremely nervous about his disappearance, although they awarded him the Knights Cross. Rommels successes and the new possibilities offered by the new tank arm were welcomed by a small number of generals, but worried and paralysed the rest.               On 20 May Rommel reached ": null
    },
    {
        "Arras": "Arras"
    },
    {
        ". General ": null
    },
    {
        "Hermann Hoth": "Hermann Hoth"
    },
    {
        " received orders that the town should be bypassed and its British garrison thus isolated. He ordered the 5th Panzer Division to move to the west and 7th Panzer Division to the east, flanked by the ": null
    },
    {
        "SS Division Totenkopf": "3Rd Ss Panzer Division Totenkopf"
    },
    {
        ". The following day the British launched a counterattack, meeting the SS Totenkopf with two infantry battalions supported by heavily armoured ": null
    },
    {
        "Matilda Mk I": "Matilda Mk I"
    },
    {
        " and ": null
    },
    {
        "Matilda II": "Matilda Ii"
    },
    {
        " tanks in the ": null
    },
    {
        "Battle of Arras": "Battle Of Arras"
    },
    {
        ". The German 37  mm anti-tank gun proved ineffective against the heavily armoured Matildas. The 25th Panzer Regiment and a battery of  anti-aircraft guns were called in to support, and the British withdrew.     On 24 May, Field Marshal ": null
    },
    {
        "von Rundstedt": "Gerd Von Rundstedt"
    },
    {
        " and Field Marshal von Kluge issued a halt order, which Hitler approved.  The reason for this decision is still a matter of debate. The halt order was lifted on 26 May. 7th Panzer continued its advance, reaching ": null
    },
    {
        "Lille": "Lille"
    },
    {
        " on 27 May. For the assault, Hoth placed the 5th Panzer Divisions Panzer Brigade under Rommels command. The ": null
    },
    {
        "Siege of Lille": "Siege Of Lille"
    },
    {
        " continued until 31 May, when the French garrison of 40,000 men surrendered. 7th Panzer was given six days leave, during which Rommel was summoned to Berlin to meet with Hitler. He was the only divisional commander present at the planning session for  Fall Rot  , the second phase of the invasion of France. By this time the ": null
    },
    {
        "evacuation of the BEF": "Dunkirk Evacuation"
    },
    {
        " was complete; over 338,000 Allied troops had been evacuated across the Channel, though they had to leave behind all their heavy equipment and vehicles.       Rommel, resuming his advance on 5 June, drove for the ": null
    },
    {
        "River Seine": "River Seine"
    },
    {
        " to secure the bridges near ": null
    },
    {
        "Rouen": "Rouen"
    },
    {
        ". Advancing  in two days, the division reached Rouen to find the bridges destroyed. On 10 June, Rommel reached the coast near ": null
    },
    {
        "Dieppe": "Dieppe"
    },
    {
        ", sending Hoth the laconic message Bin an der Küste or Am on the coast . On 17 June, 7th Panzer was ordered to advance on ": null
    },
    {
        "Cherbourg": "Cherbourg"
    },
    {
        ", where additional British evacuations were underway. The division advanced  in 24 hours, and after two days of shelling, the French garrison surrendered on 19 June. The speed and surprise it was consistently able to achieve, to the point where both the enemy and the  Oberkommando des Heeres  at times lost track of its whereabouts, earned the 7th Panzers the nickname Gespensterdivision .     After the armistice with the French was signed on 22 June, the division was placed in reserve, being sent first to the Somme and then to Bordeaux to re-equip and prepare for Unternehmen Seelöwe , the planned invasion of Britain. This invasion was later cancelled as Germany was not able to acquire the air superiority needed for a successful outcome, while the Kriegsmarine was massively outnumbered by the Royal Navy.       In France, Rommel ordered the execution of one French officer who refused three times to cooperate when being taken prisoner; there are disputes as to whether this execution was justified.  Bewley remarks that the shooting of a prisoner who does not behave as a prisoner is a legal option; however, this act was brutal because the officer did not have a gun, while Richard Weston, veteran at Tobruk, argues that it was not only legal but also made sense considering Rommels situation.   Caddick-Adams comments that this would make Rommel a war criminal condemned by his own hand, and that other authors overlook this episode. French historian Petitfrère remarks that Rommel was in a hurry and had no time for useless palavers, although this act was still debatable.  Telp remarks that, For all his craftiness, Rommel was chivalrous by nature and not prone to order or condone acts of needless violence  ... He treated prisoners of war with consideration. On one occasion, he was forced to order the shooting of a French lieutenant-colonel for refusing to obey his captors.  Scheck says, Although there is no evidence incriminating Rommel himself, his unit did fight in areas where German massacres of black French prisoners of war were extremely common in June 1940.    Les crimes nazis lors de la libération de la France Dominique Lormier 2014.     According to some authors, during the fighting in France, Rommels 7th Panzer Division, alongside troops from 5th Panzer Division, committed numerous atrocities against French troops including the murder of 50 surrendering officers and men at Quesnoy and the nearby Airaines Les Combats dAiraines et environs, juin 1940 André Laboulet impr. Lafosse, p. 21, 1972.  After the war a memorial was erected to the commanding French officer ": null
    },
    {
        "Charles NTchoréré": "Charles Ntchoréré"
    },
    {
        " allegedly executed by soldiers under Rommels command. The division is considered by Scheck to have been likely responsible for the execution of POWs in Hangest-sur-Somme, while Scheck believes they were too far away to have been involved in the massacres at Airaines and nearby villages. French historian ": null
    },
    {
        "Dominique Lormier": ":Fr:Dominque Lormier"
    },
    {
        " states the number of victims of 7th Panzer Division in Airaines at 109 mostly French-African soldiers from Senegal. Dominique Lormier: Les crimes nazis lors de la libération de la France Historian Daniel Butler agrees that it was possible the massacre at Le Quesnoy happened given the existence of Nazis like Hanke in Rommels division, while stating that in comparison with other German units, few sources regarding such actions of the men of the 7th Panzer exist . Showalter claims there was no massacre at Le Quesnoy. Patton And Rommel: Men of War in the Twentieth Century - Dennis Showalter - 1996 In fact, the garrison of Le Quesnoy, most of them Senegalese, took a heavy toll of the German infantry in house-to-house fighting. Unlike other occasions in 1940, when Germans and Africans met, there was no deliberate massacre of survivors. Claus Telp comments that Airaines was not in the sector of the 7th, but at Hangest and Martainville elements of the 7th might have shot some prisoners and used British Colonel Broomhall as a human shield .            On 6 February 1941, Rommel was appointed commander of the new  Deutsches Afrika Korps  , consisting of the 5th Light Division  and of the ": null
    },
    {
        "15th Panzer Division": "15Th Panzer Division"
    },
    {
        ". He was promoted to  Generalleutnant  three days later and flew to ": null
    },
    {
        "Tripoli": "Tripoli"
    },
    {
        " on 12 February. The DAK had been sent to ": null
    },
    {
        "Libya": "Libya"
    },
    {
        " in ": null
    },
    {
        "Operation Sonnenblume": "Operation Sonnenblume"
    },
    {
        ", to support ": null
    },
    {
        "Italian": "Kingdom Of Italy"
    },
    {
        " troops that had been severely defeated by British Commonwealth forces in ": null
    },
    {
        "Operation Compass": "Operation Compass"
    },
    {
        ". His efforts in the ": null
    },
    {
        "Western Desert Campaign": "Western Desert Campaign"
    },
    {
        " earned Rommel the nickname the Desert Fox from British journalists. Allied troops in Africa were commanded by General ": null
    },
    {
        "Archibald Wavell": "Archibald Wavell"
    },
    {
        ", Commander-in-Chief ": null
    },
    {
        "Middle East Command": "Middle East Command"
    },
    {
        ".       Rommel and his troops were technically subordinate to Italian commander-in-chief General ": null
    },
    {
        "Italo Gariboldi": "Italo Gariboldi"
    },
    {
        ". Disagreeing with the  Oberkommando der Wehrmacht  orders to assume a defensive posture along the front line at ": null
    },
    {
        "Sirte": "Sirte"
    },
    {
        ", Rommel resorted to subterfuge and insubordination to take the war to the British. According to Remy, the General Staff tried to slow him down but Hitler encouraged him to advance—an expression of the conflict which had existed between Hitler and the army leadership since the invasion of Poland. He decided to launch a limited offensive on 24 March with the 5th Light Division, supported by two Italian divisions. This thrust was not anticipated by the British, who had ": null
    },
    {
        "Ultra": "Ultra"
    },
    {
        " intelligence showing that Rommel had orders to remain on the defensive until at least May, when the 15th Panzer Division were due to arrive.          The British ": null
    },
    {
        "Western Desert Force": "Western Desert Force"
    },
    {
        " had meanwhile been weakened by the transfer in mid-February of three divisions for the ": null
    },
    {
        "Battle of Greece": "Battle Of Greece"
    },
    {
        ". They fell back to ": null
    },
    {
        "Mersa El Brega": "Mersa El Brega"
    },
    {
        " and started constructing defensive works. Rommel continued his attack against these positions to prevent the British from building up their fortifications. After a day of fierce fighting on 31 March, the Germans captured Mersa El Brega. Splitting his force into three groups, Rommel resumed the advance on 3 April. ": null
    },
    {
        "Benghazi": "Benghazi"
    },
    {
        " fell that night as the British pulled out of the city. Gariboldi, who had ordered Rommel to stay in Mersa El Brega, was furious. Rommel was equally forceful in his response, telling Gariboldi, One cannot permit unique opportunities to slip by for the sake of trifles . A signal arrived from General ": null
    },
    {
        "Franz Halder": "Franz Halder"
    },
    {
        " reminding Rommel that he was to halt in Mersa El Brega. Knowing Gariboldi could not speak German, Rommel told him the message gave him complete freedom of action. Gariboldi backed down.     On 4 April, Rommel was advised by his supply officers that fuel was running short, which could result in a delay of up to four days. The problem was Rommels fault, as he had not advised his supply officers of his intentions, and no fuel dumps had been set up. Rommel ordered the 5th Light Division to unload all their lorries and return to ": null
    },
    {
        "El Agheila": "El Agheila"
    },
    {
        " to collect fuel and ammunition. Driving through the night, they were able to reduce the halt to a single day. Fuel supply was problematic throughout the campaign, as no petrol was available locally; it had to be brought from Europe by tanker and then carried by road to where it was needed. Food and fresh water were also in short supply and it was difficult to move tanks and other equipment off-road through the sand. Cyrenaica was captured by 8 April, except for the port city of ": null
    },
    {
        "Tobruk": "Tobruk"
    },
    {
        ", which was besieged on 11 April.               The ": null
    },
    {
        "siege of Tobruk": "Siege Of Tobruk"
    },
    {
        " was not technically a ": null
    },
    {
        "siege": "Siege"
    },
    {
        ", as the defenders were still able to move supplies and reinforcements into the city via the port. Rommel knew that by capturing the port he could greatly reduce the length of his supply lines and increase his overall port capacity, which was insufficient even for day-to-day operations and only half that needed for offensive operations. The city, which had been heavily fortified by the Italians during their 30-year occupation, was garrisoned by the 18th Infantry Brigade of the Australian ": null
    },
    {
        "7th Division": "7Th Division"
    },
    {
        ", the Australian ": null
    },
    {
        "9th Division": "9Th Division"
    },
    {
        ", HQ 3rd Armoured Brigade, several thousand British infantrymen, and one regiment of Indian infantry, for a total of 36,000 men. The commanding officer was Australian ": null
    },
    {
        "Lieutenant General": "Lieutenant General"
    },
    {
        " Leslie Morshead": "Leslie Morshead"
    },
    {
        ". Hoping to catch the defenders off-guard, Rommel launched a failed attack on 14 April.          Rommel requested reinforcements, but the OKW, then completing preparations for ": null
    },
    {
        "Operation Barbarossa": "Operation Barbarossa"
    },
    {
        ", refused. General ": null
    },
    {
        "Friedrich Paulus": "Friedrich Paulus"
    },
    {
        ", head of the Operations Branch of OKH, arrived on 25 April to review the situation. He was present for a second failed attack on the city on 30 April. On 4 May Paulus ordered that no further attempts should be made to take Tobruk via a direct assault. This order was not open to interpretation, and Rommel had no choice but to comply. Aware of this order from intelligence reports, Churchill urged Wavell to seize the initiative. While awaiting further reinforcements and a shipment of 300 tanks that were already on their way, Wavell launched a limited offensive code named ": null
    },
    {
        "Operation Brevity": "Operation Brevity"
    },
    {
        " on 15 May. The British briefly seized ": null
    },
    {
        "Sollum": "Sollum"
    },
    {
        ", ": null
    },
    {
        "Fort Capuzzo": "Fort Capuzzo"
    },
    {
        ", and the important ": null
    },
    {
        "Halfaya Pass": "Halfaya Pass"
    },
    {
        ", a bottleneck along the coast near the border between Libya and Egypt. Rommel soon forced them to withdraw. On 15 June Wavell launched ": null
    },
    {
        "Operation Battleaxe": "Operation Battleaxe"
    },
    {
        ". The attack was defeated in a four-day battle at Sollum and Halfaya Pass, resulting in the loss of 98 British tanks. The Germans lost 12 tanks, while capturing and seriously damaging over 20 British tanks. The defeat resulted in Churchill replacing Wavell with General ": null
    },
    {
        "Claude Auchinleck": "Claude Auchinleck"
    },
    {
        " as theatre commander. Rommel appointed ": null
    },
    {
        "Heinrich Kirchheim": "Heinrich Kirchheim"
    },
    {
        " as commander of ": null
    },
    {
        "5th Light Division": "5Th Light Division"
    },
    {
        " on 16 May, became displeased and replaced him with ": null
    },
    {
        "Johann von Ravenstein": "Johann Von Ravenstein"
    },
    {
        " on 30 May 1941.      In August, Rommel was appointed commander of the newly created Panzer Group Africa, with ": null
    },
    {
        "Fritz Bayerlein": "Fritz Bayerlein"
    },
    {
        " as his chief of staff. The Afrika Korps, comprising the 15th Panzer Division and the 5th Light Division, now reinforced and redesignated 21st Panzer Division, was put under command of Generalleutnant ": null
    },
    {
        "Ludwig Crüwell": "Ludwig Crüwell"
    },
    {
        ". In addition to the Afrika Korps, Rommels Panzer Group had the ": null
    },
    {
        "90th Light Division": "90Th Light Infantry Division"
    },
    {
        " and four Italian divisions, three infantry divisions investing Tobruk, and one holding Bardia. The two Italian armoured divisions,  Ariete  and  Trieste , were still under Italian control. They formed the ": null
    },
    {
        "Italian XX Motorized Corps": "Italian Xx Motorized Corps"
    },
    {
        " under the command of General ": null
    },
    {
        "Gastone Gambara": "Gastone Gambara"
    },
    {
        ". Two months later Hitler decided he must have German officers in better control of the Mediterranean theatre, and appointed Field Marshal ": null
    },
    {
        "Albert Kesselring": "Albert Kesselring"
    },
    {
        " as Commander in Chief, South. Kesselring was ordered to get control of the air and sea between Africa and Italy.               Following his success in Battleaxe, Rommel returned his attention to the capture of Tobruk. He made preparations for a new offensive, to be launched between 15 and 20 November. Meanwhile, Auchinleck reorganised Allied forces and strengthened them to two corps, ": null
    },
    {
        "XXX": "Xxx Corps"
    },
    {
        " and ": null
    },
    {
        "XIII": "Xiii Corps"
    },
    {
        ", which formed the ": null
    },
    {
        "British Eighth Army": "British Eighth Army"
    },
    {
        ", which was placed under the command of ": null
    },
    {
        "Alan Cunningham": "Alan Cunningham"
    },
    {
        ". Auchinleck had 770 tanks and double the number of Axis aircraft. Rommel opposed him with the 15th and 21st Panzer Divisions with a total of 260 tanks, the 90th Light Infantry division, five Italian infantry divisions, and one Italian armoured division of 278 tanks.     Auchinleck launched ": null
    },
    {
        "Operation Crusader": "Operation Crusader"
    },
    {
        ", a major offensive to relieve Tobruk, on 18 November 1941. The XIII Corps on the right were assigned to attack Sidi Omar, Capuzzo, Sollum, and Bardia; the XXX Corps were to move on the left southern flank to a position about  south of Tobruk, with the expectation that Rommel would find this move so threatening that he would move his armour there in response. Once Rommels tanks were written down, the British ": null
    },
    {
        "70th Infantry Division": "70Th Infantry Division"
    },
    {
        " would break out of Tobruk to link up with XXX Corps. Rommel reluctantly decided on 20 November to call off his planned attack on Tobruk.          Some elements of the ": null
    },
    {
        "7th Armoured Division": "7Th Armoured Division"
    },
    {
        " were stopped on 19 January by the Italian Ariete Armoured Division at Bir el Gobi, but they also managed to capture the airfields at Sidi Rezegh,  from Tobruk. Engaging the Allied tanks located there became Rommels primary objective. Noting that the British armour was separated into three groups incapable of mutual support, he concentrated his Panzers so as to gain local superiority. The expected breakout from Tobruk, which took place on 20 November, was stopped by the Italians. The airfield at Sidi Rezegh was retaken by 21st Panzer on 22 November. In four days of fighting, the Eighth Army lost 530 tanks and Rommel only 100. The German forces near Halfaya Pass were cut off on 23 November.     Wanting to exploit the British halt and their apparent disorganisation, on 24 November Rommel counterattacked near the Egyptian border in an operation that became known as the dash to the wire . Unknown to Rommel, his troops passed within  of a major British supply dump. Cunningham asked Auchinleck for permission to withdraw into Egypt, but Auchinleck refused, and soon replaced Cunningham as commander of Eighth Army with Major General ": null
    },
    {
        "Neil Ritchie": "Neil Ritchie"
    },
    {
        ". The German counterattack stalled as it outran its supplies and met stiffening resistance, and was criticised by the German High Command and some of Rommels staff officers.     While Rommel drove into Egypt, the remaining Commonwealth forces east of Tobruk threatened the weak Axis lines there. Unable to reach Rommel for several days, Rommels Chief of Staff, ": null
    },
    {
        "Siegfried Westphal": "Siegfried Westphal"
    },
    {
        ", ordered the 21st Panzer Division withdrawn to support the siege of Tobruk. On 27 November the British attack on Tobruk linked up with the defenders, and Rommel, having suffered losses that could not easily be replaced, had to concentrate on regrouping the divisions that had attacked into Egypt. By 7 December Rommel fell back to a defensive line at Gazala, just west of Tobruk, all the while under heavy attack from the ": null
    },
    {
        "Desert Air Force": "Desert Air Force"
    },
    {
        ". The Bardia garrison surrendered on 2 January and Halfaya on 17 January 1942. The Allies kept up the pressure, and Rommel was forced to retreat all the way back to the starting positions he had held in March, reaching ": null
    },
    {
        "El Agheila": "El Agheila"
    },
    {
        " in December 1941. The British had retaken almost all of Cyrenaica, but Rommels retreat dramatically shortened his supply lines.                 On 5 January 1942 the Afrika Korps received 55 tanks and new supplies and Rommel started planning a counterattack. On 21 January, Rommel launched the attack. Caught by surprise by the Afrika Korps, the Allies lost over 110 tanks and other heavy equipment. The Axis forces retook Benghazi on 29 January and ": null
    },
    {
        "Timimi": "Timimi"
    },
    {
        " on 3 February, with the Allies pulling back to a defensive line just before the Tobruk area south of the coastal town of Gazala. Rommel placed a thin screen of mobile forces before them, and held the main force of the Panzerarmee well back near Antela and Mersa Brega. Between December 1941 and June 1942, Rommel had excellent information about the disposition and intentions of the Commonwealth forces. ": null
    },
    {
        "Bonner Fellers": "Bonner Fellers"
    },
    {
        ", the US diplomat in Egypt, was sending detailed reports to the ": null
    },
    {
        "US State Department": "Us State Department"
    },
    {
        " using a compromised code.        Following Kesselrings successes in creating local air superiority around the British naval and air bases at ": null
    },
    {
        "Malta": "Malta"
    },
    {
        " in April 1942, an increased flow of supplies reached the Axis forces in Africa. With his forces strengthened, Rommel contemplated a major offensive operation for the end of May. He knew the British were planning offensive operations as well, and he hoped to pre-empt them. While out on reconnaissance on 6 April, he was severely bruised in the abdomen when his vehicle was the target of artillery fire. The British had 900 tanks in the area, 200 of which were new ": null
    },
    {
        "Grant": "M3 Lee"
    },
    {
        " tanks. Unlike the British, the Axis forces had no armoured reserve; all operable equipment was put into immediate service. Rommels ": null
    },
    {
        "Panzer Army Africa": "Panzer Army Africa"
    },
    {
        " had a force of 320 German tanks; 50 of these were the light ": null
    },
    {
        "Panzer II": "Panzer Ii"
    },
    {
        " model. In addition, 240 Italian tanks were in service, but these were under-gunned and poorly armoured.          Early in the afternoon of 26 May 1942, Rommel attacked first and the ": null
    },
    {
        "Battle of Gazala": "Battle Of Gazala"
    },
    {
        " commenced. Italian infantry supplemented with small numbers of armoured forces assaulted the centre of the Gazala fortifications. To give the impression that this was the main assault, spare aircraft engines mounted on trucks were used to create huge clouds of dust. Ritchie was not convinced by this display, and left the 4th and 22nd Armoured Brigades in position at the south end of the Commonwealth position. Under the cover of darkness, the bulk of Rommels motorized and armoured forces drove south to skirt the left flank of the British, coming up behind them and attacking to the north the following morning. Throughout the day a running armour battle occurred, where both sides took heavy losses. The Grant tanks proved to be impossible to knock out except at close range.     Renewing the attack on the morning of 28 May, Rommel concentrated on encircling and destroying separate units of the British armour. Repeated British counterattacks threatened to cut off and destroy the Afrika Korps. Running low on fuel, Rommel assumed a defensive posture, forming the Cauldron . He made use of the extensive British minefields to shield his western flank. Meanwhile, Italian infantry cleared a path through the mines to provide supplies. On 30 May Rommel resumed the offensive, attacking westwards to link with elements of Italian X Corps, which had cleared a path through the Allied minefields to establish a supply line. On 1 June, Rommel accepted the surrender of some 3,000 soldiers of the 150th Brigade. On 6 June, 90th Light Division and the Trieste Division assaulted the Free French strongpoint in the ": null
    },
    {
        "Battle of Bir Hakeim": "Battle Of Bir Hakeim"
    },
    {
        ", but the defenders continued to thwart the attack until finally evacuating on 10 June. With his communications and the southern strongpoint of the British line thus secured, Rommel shifted his attack north again, relying on the British minefields of the Gazala lines to protect his left flank. Threatened with being completely cut off, the British began a retreat eastward toward Egypt on 14 June, the so-called Gazala Gallop .          On 15 June Axis forces reached the coast, cutting off the escape for the Commonwealth forces still occupying the Gazala positions. With this task completed, Rommel struck for Tobruk while the enemy was still confused and disorganised. Tobruks defenders were at this point the 2nd South African Infantry Division, 4th Antiaircraft Brigade, 11th Indian Infantry, 32nd Army Tank, and 201st Guards Brigades, all under command of Major General ": null
    },
    {
        "Hendrik Klopper": "Hendrik Klopper"
    },
    {
        ". The assault on Tobruk began at dawn on 20 June, and Klopper surrendered at dawn the following day. With Tobruk, Rommel achieved the capture of 32,000 defenders, the port, and huge quantities of supplies. Only at the ": null
    },
    {
        "fall of Singapore": "Battle Of Singapore"
    },
    {
        ", earlier that year, had more ": null
    },
    {
        "British Commonwealth": "Commonwealth Of Nations"
    },
    {
        " troops been captured at one time. On 22 June, Hitler promoted Rommel to Generalfeldmarschall for this victory.           Following his success at Gazala and Tobruk, Rommel wanted to seize the moment and not allow 8th Army a chance to regroup. He strongly argued that the Panzerarmee should advance into Egypt and drive on to Alexandria and the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        ", as this would place almost all the Mediterranean coastline in Axis hands, ease conditions on the ": null
    },
    {
        "Eastern Front": "Eastern Front"
    },
    {
        ", and potentially lead to the capture from the south of the oil fields in the ": null
    },
    {
        "Caucasus": "Caucasus"
    },
    {
        " and ": null
    },
    {
        "Middle East": "Middle East"
    },
    {
        ". Indeed, Allied strategists feared that if Rommel captured Egypt, he would next overrun the Middle East before possibly linking up with the forces besieging the Caucasus. However, Hitler viewed the North African campaign primarily as a way to assist his Italian allies, not as an objective in and of itself. He would not consider sending Rommel the reinforcements and supplies he needed to take and hold Egypt, as this would have required diverting men and supplies from his primary focus: the Eastern Front.     Rommels success at Tobruk worked against him, as Hitler no longer felt it was necessary to proceed with ": null
    },
    {
        "Operation Herkules": "Operation Herkules"
    },
    {
        ", the proposed attack on Malta. Auchinleck relieved Ritchie of command of the Eighth Army on 25 June, and temporarily took command himself. Rommel knew that delay would only benefit the British, who continued to receive supplies at a faster rate than Rommel could hope to achieve. He pressed an attack on the heavily fortified town of ": null
    },
    {
        "Mersa Matruh": "Mersa Matruh"
    },
    {
        ", which Auchinleck had designated as the fall-back position, surrounding it on 28 June. The ": null
    },
    {
        "2nd New Zealand Division": "2Nd New Zealand Division"
    },
    {
        " and ": null
    },
    {
        "50th Infantry Division": "50Th  Infantry Division"
    },
    {
        " were almost caught, with 50th Division fleeing on the 27th and 2nd Division escaping after a short engagement during the pre-dawn hours of 28 June. The four divisions of X Corps were caught in the encirclement, and were ordered by Auchinleck to attempt a breakout. The ": null
    },
    {
        "29th Indian Infantry Brigade": "29Th Indian Infantry Brigade"
    },
    {
        " was nearly destroyed, losing 6,000 troops and 40 tanks. The fortress fell on 29 June. In addition to stockpiles of fuel and other supplies, the British abandoned hundreds of tanks and trucks. Those that were functional were put into service by the Panzerarmee.               Rommel continued his pursuit of the Eighth Army, which had fallen back to heavily prepared defensive positions at ": null
    },
    {
        "El Alamein": "El Alamein"
    },
    {
        ". This region is a natural choke point, where the ": null
    },
    {
        "Qattara Depression": "Qattara Depression"
    },
    {
        " creates a relatively short line to defend that could not be outflanked to the south because of the steep escarpment. On 1 July the ": null
    },
    {
        "First Battle of El Alamein": "First Battle Of El Alamein"
    },
    {
        " began. Rommel had around 100 available tanks. The Allies were able to achieve local air superiority, with heavy bombers attacking the 15th and 21st Panzers, who had also been delayed by a sandstorm. The 90th Light Division veered off course and were pinned down by South African artillery fire. Rommel continued to attempt to advance for two more days, but repeated sorties by the Desert Air Force meant he could make no progress. On 3 July, he wrote in his diary that his strength had faded away . Attacks by 21st Panzer on 13 and 14 July were repulsed, and an Australian attack on 16–17 July was held off with difficulty. Throughout the first half of July, Auchinleck concentrated attacks on the Italian ": null
    },
    {
        "60th Infantry Division Sabratha": "60Th Infantry Division Sabratha"
    },
    {
        " at Tel el Eisa. The ridge was captured by the ": null
    },
    {
        "26th Australian Brigade": "26Th Brigade"
    },
    {
        " on 16 July. Both sides suffered similar losses throughout the month, but the Axis supply situation remained less favourable. Rommel realised that the tide was turning. A break in the action took place at the end of July as both sides rested and regrouped.        Preparing for a renewed drive, the British replaced Auchinleck with General ": null
    },
    {
        "Harold Alexander": "Harold Alexander"
    },
    {
        " on 8 August. ": null
    },
    {
        "Bernard Montgomery": "Bernard Montgomery, 1St Viscount Montgomery Of Alamein"
    },
    {
        " was made the new commander of Eighth Army that same day. The Eighth Army had initially been assigned to General ": null
    },
    {
        "William Gott": "William Gott"
    },
    {
        ", but he was killed when his plane was shot down on 7 August. Rommel knew that a British convoy carrying over 100,000 tons of supplies was due to arrive in September. He decided to launch an attack at the end of August with the 15th and 21st Panzer Division, 90th Light Division, and the Italian XX Motorized Corps in a drive through the southern flank of the El Alamein lines. Expecting an attack sooner rather than later, Montgomery fortified the Alam el Halfa ridge with the 44th Division, and positioned the 7th Armoured Division about  to the south.             The ": null
    },
    {
        "Battle of Alam el Halfa": "Battle Of Alam El Halfa"
    },
    {
        " was launched on 30 August. The terrain left Rommel with no choice but to follow a similar tactic as he had at previous battles: the bulk of the forces attempted to sweep around from the south while secondary attacks were launched on the remainder of the front. It took much longer than anticipated to get through the minefields in the southern sector, and the tanks got bogged down in unexpected patches of quicksand . Under heavy fire from British artillery and aircraft, and in the face of well prepared positions that Rommel could not hope to outflank due to lack of fuel, the attack stalled. By 2 September, Rommel realized the battle was unwinnable, and decided to withdraw.     Montgomery had made preparations to cut the Germans off in their retreat, but in the afternoon of 2 September he visited Corps commander ": null
    },
    {
        "Brian Horrocks": "Brian Horrocks"
    },
    {
        " and gave orders to allow the Germans to retire. This was to preserve his own strength intact for the main battle which was to come. On the night of 3 September the 2nd New Zealand Division and 7th Armoured Division positioned to the north engaged in an assault, but they were repelled in a fierce rearguard action by the 90th Light Division. Montgomery called off further action to preserve his strength and allow for further desert training for his forces. In the attack Rommel had suffered 2,940 casualties and lost 50 tanks, a similar number of guns, and 400 lorries, vital for supplies and movement. The British losses, except tank losses of 68, were much less, further adding to the numerical inferiority of Panzer Army Afrika. The Desert Air Force inflicted the highest proportions of damage on Rommels forces. He now realized the war in Africa could not be won. Physically exhausted and suffering from a liver infection and low blood pressure, Rommel flew home to Germany to recover his health. General ": null
    },
    {
        "Georg Stumme": "Georg Stumme"
    },
    {
        " was left in command in Rommels absence.                Improved decoding by British intelligence  meant that the Allies had advance knowledge of virtually every Mediterranean convoy, and only 30 percent of shipments were getting through. In addition, Mussolini diverted supplies intended for the front to his garrison at Tripoli and refused to release any additional troops to Rommel. The increasing Allied air superiority and lack of fuel meant Rommel was forced to take a more defensive posture than he would have liked for the ": null
    },
    {
        "second Battle of El Alamein": "Second Battle Of El Alamein"
    },
    {
        ". The German defences to the west of the town included a minefield  deep with the main defensive line – itself several thousand yards deep – to its west. This, Rommel hoped, would allow his infantry to hold the line at any point until motorized and armoured units in reserve could move up and counterattack any Allied breaches. The British offensive began on 23 October. Stumme, in command in Rommels absence, died of an apparent heart attack while examining the front on 24 October, and Rommel was ordered to return from his medical leave, arriving on the 25th. Montgomerys intention was to clear a narrow path through the minefield at the northern part of the defenses, at the area called Kidney Ridge, with a feint to the south. By the end of 25 October, the 15th Panzer, the defenders in this sector, had only 31 serviceable tanks remaining of their initial force of 119. Rommel brought the 21st Panzer and Ariete Divisions north on 26 October, to bolster the sector. On 28 October, Montgomery shifted his focus to the coast, ordering his 1st and 10th Armoured Divisions to attempt to swing around and cut off Rommels line of retreat. Meanwhile, Rommel concentrated his attack on the Allied ": null
    },
    {
        "salient": "Salient"
    },
    {
        " at Kidney Ridge, inflicting heavy losses. However, Rommel had only 150 operational tanks remaining, and Montgomery had 800, many of them ": null
    },
    {
        "Shermans": "M4 Sherman"
    },
    {
        ".     Montgomery, seeing his armoured brigades losing tanks at an alarming rate, stopped major attacks until the early hours of 2 November, when he opened Operation Supercharge, with a massive artillery barrage. This was followed by penetration at the salient by two armoured and two infantry divisions. Rommels counterattack at 11:00 inflicted severe casualties on the Commonwealth troops, but by 20:00, with only 35 tanks remaining, he ordered his forces to disengage and begin to withdraw. At midnight, he informed the OKW of his decision, and received a reply directly from Hitler the following afternoon: he ordered Rommel and his troops to hold their position to the last man. Rommel, who believed that the lives of his soldiers should never be squandered needlessly, was stunned. While he had pledged an oath of absolute obedience to Hitler, he thought this order was pointless, even madness, and had to be disobeyed. Rommel initially complied with the order, but after discussions with Kesselring and others, he issued orders for a retreat on 4 November. The delay proved costly in terms of his ability to get his forces out of Egypt. He later said the decision to delay was what he most regretted from his time in Africa. Meanwhile, the British 1st and 7th Armoured Division had broken through the German defences and were preparing to swing north and surround the Axis forces. On the evening of the 4th, Rommel finally received word from Hitler authorizing the withdrawal. By this time it was impossible for Rommel to save his non-motorized units.          A series of short delaying actions was fought over the coastal highway, but no line could be held for any length of time, as Rommel lacked the armour and fuel to defend his open southern flank. Rommel continued to retreat west, abandoning Halfaya Pass, Sollum, Mersa Brega and El Agheila. The line Rommel was aiming for was Gabes gap in Tunisia. Luftwaffe Field Marshal Kesselring strongly criticized Rommels decision to retreat all the way to Tunisia, as each airfield the Germans abandoned extended the range of the Allied bombers and fighters. Rommel defended his decision, pointing out that if he tried to assume a defensive position the Allies would destroy his forces and take the airfields anyway; the retreat saved the lives of his remaining men and shortened his supply lines. By now, Rommels remaining forces fought in reduced strength combat groups, whereas the Allied forces had great numerical superiority and control of the air. Upon his arrival in ": null
    },
    {
        "Tunisia": "Tunisia"
    },
    {
        ", Rommel noted with some bitterness the reinforcements, including the 10th Panzer Division, arriving in Tunisia following the Allied invasion of Morocco.          Having reached Tunisia, Rommel launched an attack against the ": null
    },
    {
        "U.S. II Corps": "U.S. Ii Corps"
    },
    {
        " which was threatening to cut his lines of supply north to Tunis. Rommel inflicted a sharp defeat on the American forces at the ": null
    },
    {
        "Kasserine Pass": "Battle Of The Kasserine Pass"
    },
    {
        " in February, his last battlefield victory of the war, and his first engagement against the United States Army.     Rommel immediately turned back against the British forces, occupying the ": null
    },
    {
        "Mareth Line": "Mareth Line"
    },
    {
        " . While Rommel was at Kasserine at the end of January 1943, the Italian General ": null
    },
    {
        "Giovanni Messe": "Giovanni Messe"
    },
    {
        " was appointed commander of Panzer Army Africa, renamed the Italo-German Panzer Army in recognition of the fact that it consisted of one German and three Italian corps. Though Messe replaced Rommel, he diplomatically deferred to him, and the two coexisted in what was theoretically the same command. On 23 February Armeegruppe Afrika was created with Rommel in command. It included the Italo-German Panzer Army under Messe and the German 5th Panzer Army in the north of Tunisia under General ": null
    },
    {
        "Hans-Jürgen von Arnim": "Hans-Jürgen Von Arnim"
    },
    {
        ".     The last Rommel offensive in North Africa was on 6 March 1943, when he attacked Eighth Army at the ": null
    },
    {
        "Battle of Medenine": "Battle Of Medenine"
    },
    {
        ". The attack was made with ": null
    },
    {
        "10th": "10Th Panzer Division"
    },
    {
        ", ": null
    },
    {
        "15th": "15Th Panzer Division"
    },
    {
        ", and ": null
    },
    {
        "21st": "21St Panzer Division"
    },
    {
        " Panzer Divisions. Alerted by ": null
    },
    {
        "Ultra": "Ultra"
    },
    {
        " intercepts, Montgomery deployed large numbers of anti-tank guns in the path of the offensive. After losing 52 tanks, Rommel called off the assault. On 9 March he returned to Germany. Command was handed over to General Hans-Jürgen von Arnim. Rommel never returned to Africa. The fighting there continued on for another two months, until 13 May 1943, when General Messe surrendered the Armeegruppe Afrika to the Allies.       On 23 July 1943 Rommel was moved to ": null
    },
    {
        "Greece": "Greece"
    },
    {
        " as commander of ": null
    },
    {
        "Army Group E": "Army Group E"
    },
    {
        " to counter a possible British invasion. He arrived in Greece on 25 July, but was recalled to Berlin the same day due to the overthrow of Mussolini. Rommel was to be posted to Italy as commander of the newly formed ": null
    },
    {
        "Army Group B": "Army Group B"
    },
    {
        ". On 16 August 1943 Rommels headquarters moved to ": null
    },
    {
        "Lake Garda": "Lake Garda"
    },
    {
        " in northern Italy and formally assumed command of the army group, which consisted of the ": null
    },
    {
        "44th Infantry Division": "44Th Infantry Division"
    },
    {
        ", the ": null
    },
    {
        "26th Panzer Division": "26Th Panzer Division"
    },
    {
        " and the ": null
    },
    {
        "1st SS Panzer Division Leibstandarte SS Adolf Hitler": "1St Ss Panzer Division Leibstandarte Ss Adolf Hitler"
    },
    {
        ". When Italy announced its armistice with the Allies on 8 September, his forces took part in ": null
    },
    {
        "Operation Achse": "Operation Achse"
    },
    {
        ", disarming the Italian forces.     Hitler met with Rommel and Kesselring to discuss future operations in Italy on 30 September 1943. Rommel insisted on a defensive line north of Rome, while Kesselring was more optimistic and advocated holding a line south of Rome. Hitler preferred Kesselrings recommendation, and therefore revoked his previous decision for the subordination of Kesselrings forces to Rommels army group. On 19 October Hitler decided that Kesselring would be the overall commander of the forces in Italy, sidelining Rommel.     Rommel had wrongly predicted that the collapse of the German line in Italy would be fast. On 21 November Hitler gave Kesselring overall command of the Italian theater, moving Rommel and Army Group B to ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        " in France with responsibility for defending the French coast against the long anticipated Allied invasion.          On 4 November 1943, Rommel became General Inspector of the Western Defences. He was given a staff that befitted an army group commander, and the powers to travel, examine and make suggestions on how to improve the defences, but not a single soldier. Hitler, who was having a disagreement with him over military matters, intended to use Rommel as a psychological trump card.     There was broad disagreement in the German High Command as to how best to meet the expected allied invasion of Northern France. The Commander-in-Chief West, Gerd von Rundstedt, believed there was no way to stop the invasion near the beaches due to the firepower possessed by the Allied navies, as had been experienced at ": null
    },
    {
        "Salerno": "Allied Invasion Of Italygerman Counterattacks"
    },
    {
        ". He argued that the German armour should be held in reserve well inland near ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " where they could be used to counter-attack in force in a more traditional military doctrine. The allies could be allowed to extend themselves deep into France where a battle for control would be fought, allowing the Germans to envelop the allied forces in a pincer movement, cutting off their avenue of retreat. He feared the piecemeal commitment of their armoured forces would cause them to become caught in a battle of attrition which they could not hope to win.             The notion of holding the armour inland to use as a mobile reserve force from which they could mount a powerful counterattack applied the classic use of armoured formations as seen in France 1940. These tactics were still effective on the Eastern Front, where control of the air was important but did not dominate the action. Rommels own experiences at the end of the North African campaign revealed to him that the Germans would not be allowed to preserve their armour from air attack for this type of massed assault. Rommel believed their only opportunity would be to oppose the landings directly at the beaches, and to counterattack there before the invaders could become well established. Though there had been some defensive positions established and gun emplacements made, the ": null
    },
    {
        "Atlantic Wall": "Atlantic Wall"
    },
    {
        " was a token defensive line. Rundstedt had confided to Rommel that it was for propaganda purposes only.     Upon arriving in Northern France Rommel was dismayed by the lack of completed works. According to ": null
    },
    {
        "Ruge": "Friedrich Ruge"
    },
    {
        ", Rommel was in a staff position and could not issue orders, but he took every effort to explain his plan to commanders down to the platoon level, who took up his words eagerly, but more or less open opposition from the above slowed down the process. Finally, Rundstedt, who only respected Rommel grudgingly , intervened and supported Rommels request for being made a commander. It was granted in 15 January 1944, when much valuable time had been lost.      He set out to improve the fortifications along the ": null
    },
    {
        "Atlantic Wall": "Atlantic Wall"
    },
    {
        " with great energy and engineering skill.. This was a compromise: Rommel now commanded the 7th and 15th armies; he also had authority over a 20-kilometer-wide strip of coastal land between ": null
    },
    {
        "Zuiderzee": "Zuiderzee"
    },
    {
        " and the mouth of the Loire. The chain of command was convoluted: the airforce and navy had their own chiefs, as did the South and Southwest France and the Panzer group; Rommel also needed Hitlers permissions to use the tank divisions. Undeterred, Rommel had millions of mines laid and thousands of tank traps and obstacles set up on the beaches and throughout the countryside, including in fields suitable for glider aircraft landings, the so-called ": null
    },
    {
        "Rommels asparagus": "Rommels Asparagus"
    },
    {
        ". In April 1944 Rommel promised Hitler that the preparations would be complete by 1 May, but by the time of the Allied invasion the preparations were far from finished. The quality of some of the troops manning them was poor and many bunkers lacked sufficient stocks of ammunition.     Rundstedt expected the Allies to invade in the ": null
    },
    {
        "Pas-de-Calais": "Pas-De-Calais"
    },
    {
        " because it was the shortest crossing point from Britain, its port facilities were essential to supplying a large invasion force, and the distance from Calais to Germany was relatively short. Rommel and Hitlers views on the matter is a matter of debate between authors, with both seeming to change their positions.              Hitler vacillated between the two strategies. In late April, he ordered the ": null
    },
    {
        "I SS Panzer Corps": "I Ss Panzer Corps"
    },
    {
        " placed near Paris, far enough inland to be useless to Rommel, but not far enough for Rundstedt. Rommel moved those armoured formations under his command as far forward as possible, ordering General ": null
    },
    {
        "Erich Marcks": "Erich Marcks"
    },
    {
        ", commanding the 84th Corps defending the Normandy section, to move his reserves into the frontline. Although Rommel was the dominating personality in Normandy with Rundstedt willing to delegate most of the responsibilities to him , Rommels strategy of an armor-supported coastal defense line was opposed by some officers, most notably ": null
    },
    {
        "Leo Geyr von Schweppenburg": "Leo Geyr Von Schweppenburg"
    },
    {
        ", who was supported by Guderian.     Hitler compromised and gave Rommel three divisions , let Rundstedt retain four and turned the other three to Army Group G, pleasing no one.      The Allies staged elaborate deceptions for ": null
    },
    {
        "D-Day": "D-Day"
    },
    {
        " , giving the impression that the landings would be at Calais. Although Hitler himself expected a Normandy invasion for a while, Rommel and most Army commanders in France believed there would be two invasions, with the main invasion coming at the Pas-de-Calais. Rommel drove defensive preparations all along the coast of Northern France, particularly concentrating fortification building in the ": null
    },
    {
        "River Somme": "River Somme"
    },
    {
        " estuary. By D-Day on 6 June 1944 nearly all the German staff officers, including Hitlers staff, believed that Pas-de-Calais was going to be the main invasion site, and continued to believe so even after the landings in Normandy had occurred.          The 5 June storm in the channel seemed to make a landing very unlikely, and a number of the senior officers were away from their units for training exercises and various other efforts. On 4 June the chief meteorologist of the 3 Air Fleet reported that weather in the channel was so poor there could be no landing attempted for two weeks. On 5 June Rommel left France and on 6 June he was at home celebrating his wifes birthday. He was recalled and returned to his headquarters at 10pm. Meanwhile, earlier in the day, Rundstedt had requested the reserves be transferred to his command. At 10am Keitel advised that Hitler declined to release the reserves but that Rundstedt could move the ": null
    },
    {
        "12th SS Panzer Division Hitlerjugend": "12Th Ss Panzer Division Hitlerjugend"
    },
    {
        " closer to the coast, with the ": null
    },
    {
        "Panzer-Lehr-Division": "Panzer-Lehr-Division"
    },
    {
        " placed on standby. Later in the day, Rundstedt received authorisation to move additional units in preparation for a counterattack, which Rundstedt decided to launch on 7 June. Upon arrival, Rommel concurred with the plan. By nightfall, Rundstedt, Rommel and Speidel continued to believe that the Normandy landing might have been a diversionary attack, as the Allied deception measures still pointed towards Calais. The 7 June counterattack did not take place as the 12th SS did not arrive on time due to the Allied air bombardments. All this made the German command structure in France in disarray during the opening hours of the D-Day invasion.     Facing relatively small-scale German counterattacks, the Allies secured five beachheads by nightfall of 6 June, landing 155,000 troops. The Allies pushed ashore and expanded their beachhead despite strong German resistance. Rommel believed that if his armies pulled out of range of Allied naval fire, it would give them a chance to regroup and re-engage them later with a better chance of success. While he managed to convince Rundstedt, they still needed to win over Hitler. At a meeting with Hitler in ": null
    },
    {
        "Margival": "Margival"
    },
    {
        " on 17 June, Rommel warned Hitler about the inevitable collapse in the German defences, but was rebuffed and told to focus on military operations.     By mid-July the German position was crumbling. On 17 July 1944, as Rommel was returning from visiting the headquarters of the I SS Panzer Corps, a fighter piloted by ": null
    },
    {
        "Charley Fox": "Charley Fox"
    },
    {
        " of ": null
    },
    {
        "412 Squadron": "412 Transport Squadron"
    },
    {
        ",  or ": null
    },
    {
        "Jacques Remlinger": ":Fr:Jacques Remlinger"
    },
    {
        " of ": null
    },
    {
        "No. 602 Squadron RAF": "No. 602 Squadron Raf"
    },
    {
        " , by Pierre Clostermann. Véronique Chemla, «  », 18 juin 2015. or ": null
    },
    {
        "Johannes Jacobus le Roux": "Johannes Jacobus Le Roux"
    },
    {
        " of ": null
    },
    {
        "No. 602 Squadron RAF": "No. 602 Squadron Raf"
    },
    {
        " Marco Mattioli, ”Chris” Le Roux, luomo che attaccò Rommel, in Aerei nella Storia, nº 76, Parma, West-Ward Edizioni, febbraio-marzo 2011, pp. 12–15, ISSN 1591-1071 . strafed his staff car near ": null
    },
    {
        "Sainte-Foy-de-Montgommery": "Sainte-Foy-De-Montgommery"
    },
    {
        ". The driver sped up and attempted to get off the main roadway, but a 20  mm round shattered his left arm, causing the vehicle to veer off of the road and crash into trees. Rommel was thrown from the car, suffering injuries to the left side of his face from glass shards and three fractures to his skull.  He was hospitalised with major head injuries .          The role that Rommel played in the militarys ": null
    },
    {
        "resistance against Hitler": "German Resistance To Nazism"
    },
    {
        " or the ": null
    },
    {
        "20 July plot": "20 July Plot"
    },
    {
        " is difficult to ascertain, as most of the leaders who were directly involved did not survive and limited documentation on the conspirators plans and preparations exists. One piece of evidence that points to the possibility that Rommel came to support the assassination plan was ": null
    },
    {
        "General Eberbachs": "Heinrich Eberbach"
    },
    {
        "confession to his son while in British captivity, which stated that Rommel explicitly said to him that Hitler and his close associates had to be killed because this would be the only way out for Germany.     This conversation occurred about a month before Rommel was coerced into committing suicide. Other notable evidence includes the papers of Rudolf Hartmann and Carl-Heinrich von Stülpnagel, who were among the leaders of the military resistance . These papers, accidentally discovered by historian Christian Schweizer in 2018 while doing research on Rudolf Hartmann, include Hartmanns eyewitness account of a conversation between Rommel and Carl-Heinrich von Stülpnagel in May 1944, as well as photos of the mid-May 1944 meeting between the inner circle of the resistance and Rommel at Kossmanns house. According to Hartmann, by the end of May, in another meeting at Hartmanns quarters in Mareil-Marly, Rommel showed decisive determination and clear approval of the inner circles plan.           According to a post-war account by ": null
    },
    {
        "Karl Strölin": "Karl Strölin"
    },
    {
        ", three of Rommels friends—the Oberbürgermeister of Stuttgart, Strölin , ": null
    },
    {
        "Alexander von Falkenhausen": "Alexander Von Falkenhausen"
    },
    {
        " and ": null
    },
    {
        "Carl Heinrich von Stülpnagel": "Carl Heinrich Von Stülpnagel"
    },
    {
        "—began efforts to bring Rommel into the anti-Hitler conspiracy in early 1944. According to Strölin, sometime in February, Rommel agreed to lend his support to the resistance. On 15 April 1944 Rommels new chief of staff, ": null
    },
    {
        "Hans Speidel": "Hans Speidel"
    },
    {
        ", arrived in Normandy and reintroduced Rommel to Stülpnagel. Speidel had previously been connected to ": null
    },
    {
        "Carl Goerdeler": "Carl Goerdeler"
    },
    {
        ", the civilian leader of the resistance, but not to the plotters led by ": null
    },
    {
        "Claus von Stauffenberg": "Claus Von Stauffenberg"
    },
    {
        ", and came to Stauffenbergs attention only due to his appointment to Rommels headquarters. The conspirators felt they needed the support of a field marshal on active duty. ": null
    },
    {
        "Erwin von Witzleben": "Erwin Von Witzleben"
    },
    {
        ", who would have become commander-in-chief of the Wehrmacht had the plot succeeded, was a field marshal, but had been inactive since 1942. The conspirators gave instructions to Speidel to bring Rommel into their circle.     Speidel met with former foreign minister ": null
    },
    {
        "Konstantin von Neurath": "Konstantin Von Neurath"
    },
    {
        " and Strölin on 27 May in Germany, ostensibly at Rommels request, although the latter was not present. Neurath and Strölin suggested opening immediate surrender negotiations in the West, and, according to Speidel, Rommel agreed to further discussions and preparations. Around the same timeframe, the plotters in Berlin were not aware that Rommel had allegedly decided to take part in the conspiracy. On 16 May, they informed ": null
    },
    {
        "Allen Dulles": "Allen Dulles"
    },
    {
        ", through whom they hoped to negotiate with the Western Allies, that Rommel could not be counted on for support.     At least initially, Rommel opposed assassinating Hitler. According to some authors,    he gradually changed his attitude. After the war, his widow—among others—maintained that Rommel believed an assassination attempt would spark civil war in Germany and Austria, and Hitler would have become a martyr for a lasting cause. Instead, Rommel reportedly suggested that Hitler be arrested and brought to trial for his crimes; he did not attempt to implement this plan when Hitler visited Margival, France, on 17 June. The arrest plan would have been highly improbable, as Hitlers security was extremely tight. Rommel would have known this, having commanded Hitlers army protection detail in 1939. He was in favour of peace negotiations, and repeatedly urged Hitler to negotiate with the Allies, which is dubbed by some as hopelessly naive , considering no one would trust Hitler,  and as naive as it was idealistic, the attitude he showed to the man he had sworn loyalty . According to Reuth, the reason Lucie Rommel did not want her husband to be associated with any conspiracy was that even after the war, the German population neither grasped nor wanted to comprehend the reality of the genocide, thus conspirators were still treated as traitors and outcasts. On the other hand, the resistance depended on the reputation of Rommel to win over the population. Some officers who had worked with Rommel also recognized the relationship between Rommel and the resistance: Westphal said that Rommel did not want any more senseless sacrifices. Butler, using Ruges recollections, reports that when told by Hitler himself that no one will make peace with me , Rommel told Hitler that if he was the obstacle for peace, he should resign or kill himself, but Hitler insisted on fanatical defense. Reuth, based on Jodls testimony, reports that Rommel forcefully presented the situation and asked for political solutions from Hitler, who rebuffed that Rommel should leave politics to him. Brighton comments that Rommel seemed devoted, even though he did not have much faith in Hitler anymore, considering he kept informing Hitler in person and by letter about his changing beliefs, despite facing a military dilemma as well as a personal struggle. Lieb remarks that Rommels attitude in describing the situation honestly and requiring political solutions was almost without precedent and contrary to the attitude of many other generals. Remy comments that Rommel put himself and his family at risk for the resistance out of a combination of his concern for the fate of Germany, his indignation at atrocities and the influence of people around him.     On 15 July, Rommel wrote a letter to Hitler giving him a last chance to end the hostilities with the Western Allies, urging Hitler to draw the proper conclusions without delay . What Rommel did not know was that the letter took two weeks to reach Hitler because of Kluges precautions.  Various authors report that many German generals in Normandy, including some SS officers like ": null
    },
    {
        "Hausser": "Paul Hausser"
    },
    {
        ", ": null
    },
    {
        "Bittrich": "Wilhelm Bittrich"
    },
    {
        ", ": null
    },
    {
        "Dietrich": "Sepp Dietrich"
    },
    {
        " and Rommels former opponent Geyr von Schweppenburg pledged support to him, even against Hitlers orders, while Kluge supported him with much hesitation.    Von Rundstedt encouraged Rommel to carry out his plans but refused to do anything himself, remarking that it had to be a man who was still young and loved by the people,   while ": null
    },
    {
        "von Manstein": "Erich Von Manstein"
    },
    {
        " was also approached by Rommel but categorically refused, although he did not report them to Hitler either.   ": null
    },
    {
        "Peter Hoffmann": "Peter Hoffmann"
    },
    {
        " reports that he also attracted into his orbit officials who had previously refused to support the conspiracy, like ": null
    },
    {
        "Julius Dorpmüller": "Julius Dorpmüller"
    },
    {
        " and ": null
    },
    {
        "Karl Kaufmann": "Karl Kaufmann"
    },
    {
        "      On 17 July, Rommel was incapacitated by an Allied air attack, which many authors describe as a fateful event that drastically altered the outcome of the bomb plot.       Writer Ernst Jünger commented: The blow that felled Rommel  ... robbed the plan of the shoulders that were to be entrusted the double weight of war and civil war - the only man who had enough naivety to counter the simple terror that those he was about to go against possessed.      After the failed bomb attack of 20 July, many conspirators were arrested and the dragnet expanded to thousands. Rommel was first implicated when Stülpnagel, after his suicide attempt, repeatedly muttered Rommel in delirium.   Under torture, Hofacker named Rommel as one of the participants. Additionally, Goerdeler had written down Rommels name on a list as potential Reich President .     On 27 September, Martin Bormann submitted to Hitler a memorandum which claimed that the late General Stülpnagel, Colonel von Hofacker, Kluges nephew who has been executed, Lieutenant Colonel Rathgens, and several ... living defendants have testified that Field Marshal Rommel was perfectly in the picture about the assassination plan and has promised to be at the disposal of the New Government.   Gestapo agents were sent to Rommels house in Ulm and placed him under surveillance.     Historian Peter Lieb considers the memorandum, as well as Eberbachs conversation and the testimonies of surviving resistant members to be the three key sources that indicate Rommels support of the assassination plan. He further notes that while Speidel had an interest in promoting his own post-war career, his testimonies should not be dismissed, considering his bravery as an early resistance figure. Remy writes that even more important than Rommels attitude to the assassination is the fact Rommel had his own plan to end the war. He began to contemplate this plan some months after El Alamein and carried it out with a lonely decision and conviction, and in the end, had managed to bring military leaders in the West to his side.                Rommels case was turned over to the Court of Military Honour —a ": null
    },
    {
        "drumhead court-martial": "Drumhead Court-Martial"
    },
    {
        " convened to decide the fate of officers involved in the conspiracy. The court included Generalfeldmarshall ": null
    },
    {
        "Wilhelm Keitel": "Wilhelm Keitel"
    },
    {
        ", Generalfeldmarshall ": null
    },
    {
        "Gerd von Rundstedt": "Gerd Von Rundstedt"
    },
    {
        ", Generaloberst ": null
    },
    {
        "Heinz Guderian": "Heinz Guderian"
    },
    {
        ", General der Infanterie ": null
    },
    {
        "Walther Schroth": "Walther Schroth"
    },
    {
        " and Generalleutnant ": null
    },
    {
        "Karl-Wilhelm Specht": "Karl-Wilhelm Specht"
    },
    {
        ", with General der Infanterie ": null
    },
    {
        "Karl Kriebel": "Karl Kriebel"
    },
    {
        " and Generalleutnant ": null
    },
    {
        "Heinrich Kirchheim": "Heinrich Kirchheim"
    },
    {
        "  as deputy members and Generalmajor ": null
    },
    {
        "Ernst Maisel": "Ernst Maisel"
    },
    {
        " as protocol officer. The Court acquired information from Speidel, Hofacker and others that implicated Rommel, with Keitel and ": null
    },
    {
        "Ernst Kaltenbrunner": "Ernst Kaltenbrunner"
    },
    {
        " assuming that he had taken part in the subversion. Keitel and Guderian then made the decision that favoured Speidels case and at the same time shifted the blame to Rommel. By normal procedure, this would lead to Rommels being brought to ": null
    },
    {
        "Roland Freislers": "Roland Freisler"
    },
    {
        " Peoples Court": "Peoples Court"
    },
    {
        ", a ": null
    },
    {
        "kangaroo court": "Kangaroo Court"
    },
    {
        " that always decided in favour of the prosecution. However, Hitler knew that having Rommel branded and executed as a traitor would severely damage morale on the home front.   He thus decided to offer Rommel the chance to ": null
    },
    {
        "take his own life": "Suicide"
    },
    {
        ".     Two generals from Hitlers headquarters, ": null
    },
    {
        "Wilhelm Burgdorf": "Wilhelm Burgdorf"
    },
    {
        " and ": null
    },
    {
        "Ernst Maisel": "Ernst Maisel"
    },
    {
        ", visited Rommel at his home on 14 October 1944. Burgdorf informed him of the charges and offered him three options: he could choose to defend himself personally to Hitler in Berlin, or if he refused to do so , he would either face the Peoples Court—which would have been tantamount to a death sentence—or choose a quiet suicide. In the former case, ": null
    },
    {
        "his family would have suffered": "Sippenhaft"
    },
    {
        " even before the all-but-certain conviction and execution, and his staff would have been arrested and executed as well. In the latter case, the government would claim that he died a hero and bury him with full military honours, and his family would receive full pension payments. Burgdorf had brought a ": null
    },
    {
        "cyanide": "Cyanide Poisoning"
    },
    {
        " capsule.     Rommel denied involvement in the plot, declaring his love for Hitler, and saying that he would gladly serve his Fatherland again. Myth of humane Nazi Erwin Rommel debunked The Telegraph 19 December 2008.  Der Spiegel  notes that he was talking to the messengers of death & ndash; Burgdorf and Maisel & ndash; and some would claim that he was acting out of helpless defense & ndash; although Der Spiegel thought his love for Hitler was sincere. Remy, however, suggests that Rommel was trying in some way to apologise to Hitler about whom he had conflicting emotions, which Maisel  realised and found disgusting and a hypocrisy , because Maisel & ndash; a loyal, unapologetic Hitler supporter, even after the war & ndash; could not understand how someone could try to kill someone he loved; Rommels previous replies about his role in the attempt had made Maisel believe that he was part of the plot.        Before the two officers came, Rommel had told his family and friends that he would not reach Berlin alive, considering the fact that his appearing before a court would be the end of Hitler , too. He now realized that an SS detachment had surrounded his village and he could not contact even his headquarters. With that in mind, Rommel opted to commit suicide, and explained his decision to his wife and son. Wearing his Afrika Korps jacket and carrying his field marshals baton, Rommel went to Burgdorfs ": null
    },
    {
        "Opel": "Opel"
    },
    {
        ", driven by SS Master Sergeant Heinrich Doose, and was driven out of the village. After stopping, Doose and Maisel walked away from the car, leaving Rommel with Burgdorf. Five minutes later Burgdorf gestured to the two men to return to the car, and Doose noticed that Rommel was slumped over, having taken the cyanide. He died before being taken to the Wagner-Schule field hospital. Ten minutes later, the group telephoned Rommels wife to inform her of his death. ": null
    },
    {
        "Manfred Rommel": "Manfred Rommel"
    },
    {
        ", Nuremberg testimony . The Daily Telegraph. 10 November 2013. . ": null
    },
    {
        "History": "History"
    },
    {
        ". Retrieved 23 August 2014.  Witnesses were struck by the smile of deep contempt on the dead mans face, never seen in life, and his widow thought it was for Hitler.           The official story of Rommels death, as reported to the public, stated that Rommel had died of either a heart attack or a cerebral ": null
    },
    {
        "embolism": "Embolism"
    },
    {
        "—a complication of the skull fractures he had suffered in the earlier strafing of his staff car.  To strengthen the story still further, Hitler ordered an official day of mourning in commemoration. As previously promised, Rommel was given a ": null
    },
    {
        "state funeral": "State Funeral"
    },
    {
        ". The fact that his state funeral was held in Ulm instead of Berlin had, according to his son, been stipulated by Rommel. Manfred Rommel: Trotz allem heiter. Stuttgart 1998, 3rd edition, p. 69. Hitler sent Field Marshal von Rundstedt, who was unaware that Rommel had died as a result of Hitlers orders, as his representative at Rommels funeral. The body was cremated so no incriminating evidence would be left. The truth behind Rommels death became known to the Allies when intelligence officer Charles Marshall interviewed Rommels widow, Lucia Rommel, Marshall p. as well as from a letter by Rommels son ": null
    },
    {
        "Manfred": "Manfred Rommel"
    },
    {
        " in April 1945.      Rommels grave is located in Herrlingen, a short distance west of ": null
    },
    {
        "Ulm": "Ulm"
    },
    {
        ". For decades after the war on the anniversary of his death, veterans of the Africa campaign, including former opponents, would gather at his tomb in Herrlingen.          On the Italian front in the First World War Rommel was a successful tactician in fast-developing mobile battle, and this shaped his subsequent style as a military commander. He found that taking initiative and not allowing the enemy forces to regroup led to victory. Some authors, like Porch, comment that his enemies were often less organised, second-rate, or depleted, and his tactics were less effective against adequately led, trained and supplied opponents and proved insufficient in the later years of the war. Others point out that through his career, he frequently fought while out-numbered and out-gunned, sometimes overwhelmingly so, while having to deal with internal opponents in Germany who hoped that he would fail.                                           Bigwigs  ... despised Rommel  ... It was very much the way Hitler liked to keep it. He was the classic divide-and-rule dictator . Rommels former enemies put together a pact against Rommel. It started at the Ehrenhof and ended in Hitlers immediate surrounding with Bormann and Keitel .        Rommel is praised by numerous authors as a great leader of men.                               The historian and journalist ": null
    },
    {
        "Basil Liddell Hart": "Basil Liddell Hart"
    },
    {
        " concludes that he was a strong leader worshipped by his troops, respected by his adversaries and deserving to be named as one of the Great Captains of History . ": null
    },
    {
        "Owen Connelly": "Owen Connelly"
    },
    {
        " concurs, writing that No better exemplar of military leadership can be found and quoting ": null
    },
    {
        "Friedrich von Mellenthin": "Friedrich Von Mellenthin"
    },
    {
        " on the inexplicable mutual understanding that existed between Rommel and his troops.    Hitler, though, remarked that, Unfortunately Field-Marshal Rommel is a very great leader full of drive in times of success, but an absolute pessimist when he meets the slightest problems.  Telp criticises Rommel for not extending the benevolence he showed in promoting his own officers careers to his peers, who he ignored or slighted in his reports.          Taking his opponents by surprise and creating uncertainty in their minds were key elements in Rommels approach to offensive warfare: he took advantage of sand storms and the dark of night to conceal the movement of his forces. He was aggressive and often directed battle from the front or piloted a reconnaissance aircraft over the lines to get a view of the situation. When the British mounted ": null
    },
    {
        "a commando raid": "Operation Flipper"
    },
    {
        " deep behind German lines in an effort to kill Rommel and his staff on the eve of their ": null
    },
    {
        "Crusader offensive": "Operation Crusader"
    },
    {
        ", Rommel was indignant that the British expected to find his headquarters 250 miles behind his front. Mellenthin and Harald Kuhn write that at times in North Africa his absence from a position of communication made command of the battles of the Afrika Korps difficult. Mellenthin lists Rommels counterattack during Operation Crusader as one such instance.      Butler concurred, saying that leading from the front is a good concept but Rommel took it so far – he frequently directed the actions of a single company or battalion – that he made communication and coordination between units problematic, as well as risking his life to the extent that he could easily have been killed even by his own artillery. ": null
    },
    {
        "Kesselring": "Kesselring"
    },
    {
        " also complained about Rommel cruising about the battlefield like a division or corps commander; but Gause and Westphal, supporting Rommel, replied that in the African desert only this method would work and that it was useless to try to restrain Rommel anyway.      His staff officers, although admiring towards their leader, complained about the self-destructive Spartan lifestyle that made life harder, diminished his effectiveness and forced them to bab him as unobtrusively as possible .     For his leadership during the French campaign Rommel received both praise and criticism. Many, such as General ": null
    },
    {
        "Georg Stumme": "Georg Stumme"
    },
    {
        ", who had previously commanded 7th Panzer Division, were impressed with the speed and success of Rommels drive. Others were reserved or critical: ": null
    },
    {
        "Kluge": "Günther Von Kluge"
    },
    {
        ", his commanding officer, argued that Rommels decisions were impulsive and that he claimed too much credit, by falsifying diagrams or by not acknowledging contributions of other units, especially the Luftwaffe. Some pointed out that Rommels division took the highest casualties in the campaign. Others point out that in exchange for 2,160 casualties and 42 tanks, it captured more than 100,000 prisoners and destroyed nearly two divisions worth of enemy tanks , vehicles and guns.     Rommel spoke German with a pronounced southern German or ": null
    },
    {
        "Swabian": "Swabian German"
    },
    {
        " accent. He was not a part of the ": null
    },
    {
        "Prussian aristocracy": "Prussian Aristocracy"
    },
    {
        " that dominated the German high command, and as such was looked upon somewhat suspiciously by the ": null
    },
    {
        "Wehrmachts": "Wehrmacht"
    },
    {
        "traditional power structure. Rommel felt a commander should be physically more robust than the troops he led, and should always show them an example. He expected his subordinate commanders to do the same.      Rommel was direct, unbending, tough in his manners, to superiors and subordinates alike, disobedient even to Hitler whenever he saw fit, although gentle and diplomatic to the lower ranks and POWs.           Despite being publicity-friendly, he was also shy, introverted, clumsy and overly formal even to his closest aides, judging people only on their merits, although loyal and considerate to those who had proved reliability, and he displayed a surprisingly passionate and devoted side to a very small few with whom he had dropped the seemingly impenetrable barriers. Many of these traits seemed to manifest even at a very young age.                     Rommels relationship with the Italian High Command in North Africa was generally poor. Although he was nominally subordinate to the Italians, he enjoyed a certain degree of autonomy from them; since he was directing their troops in battle as well as his own, this was bound to cause hostility among Italian commanders. Conversely, as the Italian command had control over the supplies of the forces in Africa, they resupplied Italian units preferentially, which was a source of resentment for Rommel and his staff. Rommels direct and abrasive manner did nothing to smooth these issues.   Diario storico del Comando Supremo , vol.5 to 9, Italian Army General Staff Historical Office     Verbali delle riunioni tenute dal Capo di SM Generale , vol.2 and 3, Italian Army General Staff Historical Office        While certainly much less proficient than Rommel in their leadership, aggressiveness, tactical outlook and mobile warfare skills,    Italian commanders were competent in logistics, strategy and artillery doctrine: their troops were ill-equipped but well-trained. As such, the Italian commanders were repeatedly at odds with Rommel over concerns with issues of supply.   Montanari, Le operazioni in Africa Settentrionale , vol. 1 to 4, Italian Army General Staff Historical Office, 1985–1993.   Field Marshal Kesselring was assigned Supreme Commander Mediterranean, at least in part to alleviate command problems between Rommel and the Italians. This effort resulted only in partial success, with Kesselrings own relationship with the Italians being unsteady and Kesselring claiming Rommel ignored him as readily as he ignored the Italians.   Kesselring, The Memoirs of Field Marshal Kesselring, pp. 124–125.      Rommel often went directly to Hitler with his needs and concerns, taking advantage of the favoritism that the Führer displayed towards him and adding to the distrust that Kesselring and the German High Command already had of him.     According to Scianna, opinion among the Italian military leaders was not unanimous. In general, Rommel was a target of criticism and a scapegoat for defeat rather than a glorified figure, with certain generals also trying to replace him as the heroic leader or hijack the ": null
    },
    {
        "Rommel myth": "Rommel Myth"
    },
    {
        " for their own benefit. Nevertheless, he never became a hated figure, although the abandonment myth , despite being repudiated by officers of the X Corps themselves, was long-lived. Many found Rommels chaotic leadership and emotional character hard to work with, yet the Italians held him in higher regard than other German senior commanders, militarily and personally.     Very different, however, was the perception of Rommel by Italian common soldiers and NCOs, who, like the German field troops, had the deepest trust and respect for him.   M.Montanari, Le Operazioni in Africa Settentrionale, Vol.IV, chapter III, 1985–1993, pp. 119–197.    Paolo Colacicchi, an officer in the Italian Tenth Army recalled that Rommel became sort of a myth to the Italian soldiers and that the ": null
    },
    {
        "Bersaglieri": "Bersaglieri"
    },
    {
        " baptised him Rommelito       Rommel himself held a much more generous view about the Italian soldier than about their leadership, towards whom his disdain, deeply rooted in militarism, was not atypical, although unlike Kesselring he was incapable of concealing it.    Unlike many of his superiors and subordinates who held racist views, he was usually kindly disposed to the Italians in general.        Some authors like Sadkovich blame Rommel for abandoning his Italian units, refusing cooperation, rarely acknowledging their achievements and other improper behaviour towards his Italian allies.    However, others point out that the Italians under Rommel, in comparison with many of their compatriots in other areas, were better led, supplied, and trained, fighting well as a result, with a ratio of wounded and killed Italians similar to that of the Germans.          In one case, a false accusation of Rommels supposed mistreatment of Italians made by Goering was refuted by Mussolini himself. In 1943, Jodl stated that the only German commander numerous officers and soldiers in Italy would willingly subordinate themselves to would be Rommel.                Many authors describe Rommel as having a reputation of being a chivalrous, humane, and professional officer, and that he earned the respect of both his own troops and his enemies.                       Rommel described the conduct of the desert war as War without Hate in his papers, and according to Youngs biography and Lucks memoirs, during the desert campaign German and British troops encountering each other between battles were sometimes openly friendly.     According to Maurice Remy, orders issued by Hitler during Rommels stay in a hospital resulted in massacres in the course of ": null
    },
    {
        "Operation Achse": "Operation Achse"
    },
    {
        ", disarming the Italian forces after the ": null
    },
    {
        "armistice": "Armistice Of Cassibile"
    },
    {
        " with the Allies in 1943, but Rommel treated his Italian opponents with his usual fairness, requiring that the prisoners should be accorded the same conditions as German civilians. Remy opines that an order in which Rommel, in fact protesting against Hitlers directives, called for no sentimental scruples against Badoglio-dependent bandits in uniforms of the once brothers-in-arms should not be taken out of context. ": null
    },
    {
        "Peter Lieb": "Peter Lieb"
    },
    {
        " agrees that the order did not radicalize the war and that the disarmament in Rommels area of responsibility happened without major bloodshed. Italian internees were sent to Germany for forced labour, but Rommel was unaware of this.     In the ": null
    },
    {
        "Normandy campaign": "Normandy Campaign"
    },
    {
        " both Allied and German troops murdered prisoners of war on occasion during June and July 1944. But Rommel withheld Hitlers ": null
    },
    {
        "Commando Order": "Commando Order"
    },
    {
        " to execute captured commandos from his Army Group B, with his units reporting that they were treating commandos as regular POWs. It is likely that he had acted similarly in North Africa; though this is disputed by historian ": null
    },
    {
        "Szymon Datner": "Szymon Datner"
    },
    {
        ", who writes that Rommel may have been simply trying to conceal atrocities of Nazi Germany from the Allies.   Zbrodnie Wehrmachtu na jeńcach wojennych armii regularnych w II wojnie światowej   Szymon Datner Wydawn. Ministerstwa Obrony Narodowej, 1964, page 254.   Other authors argue that generosity to opponents was a natural trait of the man. Telp states that Rommel by nature was chivalrous and not prone to order needless violence. Robert Forczyk considers Rommel a true great captain with chivalry.    Remy states that although Rommel had heard rumours about massacres while fighting in Africa, his personality combined with special circumstances to mean that he was not fully confronted with the reality of atrocities before 1944. When Rommel learned about the atrocities SS Division Leibstandarte committed in Italy in September 1943, he allegedly forbade his son to join the ": null
    },
    {
        "Waffen-SS": "Waffen-Ss"
    },
    {
        ".       Some authors cite, among other cases, Rommels naive reaction to events in Poland while he was there: he paid a visit to his wifes uncle, famous Polish priest and patriotic leader , who was murdered within days, but Rommel never understood this and, at his wifes urgings, kept writing letter after letter to Himmlers adjutants asking them to keep track and take care of their relative.    Knopp and Mosier agree that he was naive politically, citing his request for a Jewish ": null
    },
    {
        "Gauleiter": "Gauleiter"
    },
    {
        " in 1943.       Despite this, Lieb finds it hard to believe that a man in Rommels position could have known nothing about atrocities, while accepting that locally he was separated from the places where these atrocities occurred. Der Spiegel comments that Rommel was simply in denial about what happened around him. Alaric Searle points out that it was the early diplomatic successes and bloodless expansion that blinded Rommel to the true nature of his beloved Führer, whom he then naively continued to support. Scheck believes it may be forever unclear whether Rommel recognized the unprecedented depraved character of the regime.       Historian ": null
    },
    {
        "Richard J. Evans": "Richard J. Evans"
    },
    {
        " has stated that German soldiers in Tunisia raped Jewish women, and the success of Rommels forces in capturing or securing Allied, Italian and Vichy French territory in North Africa led to many Jews in these areas being killed by other German institutions as part of the ": null
    },
    {
        "Holocaust": "Holocaust"
    },
    {
        ". More specifically, several German historians have argued that while Rommel did not have strong racial views, if he had succeeded in his goal of invading the Middle East during 1942 large numbers of Jews in Palestine would have been murdered by an SS unit which had been deployed to North Africa in July 1942 to operate behind the lines of the Afrika Korps. According to Mallmann and Cüppers, a post-war CIA report described Rommel as having met with ": null
    },
    {
        "Walther Rauff": "Walther Rauff"
    },
    {
        ", who was responsible for the unit, and been disgusted after learning about the plan from him and as having sent him on his way; but they conclude that such a meeting is hardly possible as Rauff was sent to report to Rommel at Tobruk on 20 July and Rommel was then 500  km away conducting the First El Alamein.    On 29 July, Rauffs unit was sent to Athens, expecting to enter Africa when Rommel crossed the Nile. However, in view of the Axis deteriorating situation in Africa it returned to Germany in September.    Historian Jean-Christoph Caron opines that there is no evidence that Rommel knew or would have supported Rauffs mission; he also believes Rommel bore no direct responsibility regarding the SSs looting of gold in Tunisia.    Historian Haim Saadon, Director of the Center of Research on North African Jewry in WWII, goes further, stating that there was no extermination plan: Rauffs documents show that his foremost concern was helping the Wehrmacht to win, and he came up with the idea of forced labour camps in the process. By the time these labour camps were in operation, according to ": null
    },
    {
        "Ben H. Shepherd": "Ben H. Shepherd"
    },
    {
        ", Rommel had already been retreating and there is no proof of his contact with the Einsatzkommando. Haaretz comments that the CIA report is most likely correct regarding both the interaction between Rommel and Rauff and Rommels objections to the plan: Rauffs assistant Theodor Saevecke, and declassified information from Rauffs file, both report the same story. Haaretz also remarks that Rommels influence probably softened the Nazi authorities attitude to the Jews and to the civilian population generally in North Africa.        Historian ": null
    },
    {
        "Martin Kitchen": "Martin Kitchen"
    },
    {
        " states that the reputation of the Afrika Korps was preserved due to circumstances: the sparsely populated desert areas did not lend themselves to ethnic cleansing; the German forces never reached the large Jewish populations in Egypt and Palestine; and in the urban areas of Tunisia and Tripolitania the Italian government constrained the German efforts to discriminate against or eliminate Jews who were Italian citizens. Despite this, the North African Jews themselves believed that it was Rommel who prevented the Final Solution from being carried out against them when German might dominated North Africa from Egypt to Morocco.       According to Curtis and Remy, 120,000 Jews lived in Algeria, 200,000 in Morocco, about 80,000 in Tunisia ,    and 26,000 in Libya. According to ": null
    },
    {
        "Marshall": "Charles F. Marshall"
    },
    {
        ", Rommel sharply protested the Jewish policies and other immoralities and was an opponent of the Gestapo. He also refused to comply with Hitlers order to execute Jewish POWs. His own Afrika Korps was known among soldiers of Jewish descent as a refuge, safe from racial laws and discrimination.    Rommel was himself an eccentric and horrible violinist.a bribe from ": null
    },
    {
        "Sepp Dietrich": "Sepp Dietrich"
    },
    {
        " Kristallfuchs partly out of fear that he would offset Hitler  the latter two were party members and also strongly supported by Hitlereither for political benefits, sympathy for someone who evoked a romantic archetype, or genuine admiration for his actions  ": null
    },
    {
        "ne 19": "Ne 19"
    },
    {
        "......Festung EuropaHe also did value justice itself: According to Admiral Ruges diary, Rommel told Ruge: Justice is the indispensable foundation of a nation. Unfortunately, the higher-ups are not clean. The slaughterings are grave sins.  magnetismus to the ": null
    },
    {
        "Hradschin Castle": "Hradčany"
    },
    {
        " in Prague, in an open top car, without another bodyguardAccording to Speer, he would normally send extremely unclear reports which annoyed Hitler greatly.   Inside The Third Reich by Albert Speer, 2015, Hachette UK,      - He was bitterly annoyed with Rommel, who would often give extremely unclear bulletins on the days movements. In other words, he veiled them from headquarters, sometimes for days, only to report an entirely changed situation. Hitler liked Rommel personally but could ill brook this sort of conduct.   in contact with Rommel in Normandya love-hate relationshipthey had almost daily, hour-long, highly animated conversations, with the preferred topic being technical innovations Nur-Soldat The dominant parent in Rommels life was his mother Helene, a minor von and a loving but ambitious and class-conscious mother who strongly stirred him towards a military career   the body and soul of war , a fellow officer commentedin Maurice Remys phraseHitler also played innocent by trying to erect a monument for the national hero, on 7 March 1945  even willing to undermine German operations and strategy in the process for the sole purpose of embarrassing himRommel imposed a high number of courts martial, but according to Westphal, he never signed the final order. Owen Connelly comments that he could afford easy discipline because of his charismaEven when informed of Rommels involvement in the plot, hurt and vengeful, Hitler at first wanted to retire Rommel, and eventually offered him a last-minute chance to explain himself and refute the claims, which Rommel apparently did not take advantage of.   Führerkultlater a leading figure in the Bundeswehr...": null
    },
    {
        "g": "G"
    },
    {
        "filmwhich is admitted by Proske...including the possibleStorbeck states that there are many other witnesses who will provide the opposite views, and also questions the use of an extremely ill Manfred Rommel to achieve a portrayal filmmakers wantwith several leaders of the Bundeswehr like , ": null
    },
    {
        "Hartmut Bagger": "Hartmut Bagger"
    },
    {
        " and  declaring him as their personal role modelthe OKW , the OKH  and the Italian Supreme CommandAccording to Rommel, he planned to proceed to see Hitler the next day to discuss the situation in Normandywhich is the opposite of the German doctrinewho mostly came from the General Staffa reputedly strategy-oriented commanderUpon which Schwarzkopf also comments Rommel had a feel for the battlefield like no other man.  1987–1991the others being ": null
    },
    {
        "Isoroku Yamamoto": "Isoroku Yamamoto"
    },
    {
        " and ": null
    },
    {
        "Reinhard Heydrich": "Reinhard Heydrich"
    },
    {
        "Lucie1894–1971 ": null
    },
    {
        "rttembe": "Rttembe"
    },
    {
        "Württemberg     ": null
    },
    {
        "th recipie": "Th Recipie"
    },
    {
        " xth recipie": "Xth Recipie"
    },
    {
        " xth recipie": "Xth Recipie"
    },
    {
        "  he always kept his troops at least 2 kilometers from their housesat that time by the center-left PD": null
    }
]