[
    {
        "   Erzulie  is a family of ": null
    },
    {
        "loa": "loa"
    },
    {
        ", or spirits in ": null
    },
    {
        "Vodou": "haitian vodou"
    },
    {
        ".            Erzulie Fréda ": null
    },
    {
        "Dahomey": "dahomey"
    },
    {
        ", the ": null
    },
    {
        "Rada": "rada loa"
    },
    {
        " aspect of Erzulie, is the Haitian African spirit of love, beauty, jewelry, dancing, luxury, and flowers. She wears three ": null
    },
    {
        "wedding ring": "wedding ring"
    },
    {
        "s, one for each husband - ": null
    },
    {
        "Damballa": "damballa"
    },
    {
        ", ": null
    },
    {
        "Agwe": "agwe"
    },
    {
        " and ": null
    },
    {
        "Ogoun": "ogoun"
    },
    {
        ". Her symbol is a heart, her colours are pink, blue, white and gold, and her favourite sacrifices include jewellery, perfume, sweet cakes and liqueurs. Coquettish and very fond of beauty and finery, Erzulie Freda is femininity and compassion embodied, yet she also has a darker side; she is seen as jealous and spoiled and within some Vodoun circles is considered to be lazy. During ritual possession, she may enter the body of either a man or a woman. She enjoys the game of flirtation and seduces people without distinguishing between sexes.   In ": null
    },
    {
        "Christian iconography": "christian iconography"
    },
    {
        " she is often identified with the ": null
    },
    {
        "Mater Dolorosa": "our lady of sorrows"
    },
    {
        ", as well as another loa named Metres Ezili. She is conceived of as never able to attain her hearts most fervent desire. For this reason she always leaves a service in tears. Common syncretizations include Iyalorde Oxum, that is the goddess Oshun as she relates to the Yoruba goddess of erotic love, gold and femininity.         Erzulie Dantòr is the Queen of the Petro nation and the mother of Ti Jean Petro , she is often depicted as a fearsome black woman, protectively holding Ti Jean Petro in her arms. She is a particularly fierce protector of women, children and the neglects of society. She is the Lwa Pwen, in contrast with Èrzuli Freda who will bless you with material riches, Èrzulie Dantòr will give you the Spiritual Knowledge needed to navigate through this material reality. Èrzulie Dantòrs wealth lasts and can be passed on from one generation to another, whereas Èrzuli Freda, in any of her jealous fits, can deprive overnight of the gains she helped you to achieve.     She is often portrayed to resemble the ": null
    },
    {
        "Black Madonna of Częstochowa": "black madonna of częstochowa"
    },
    {
        ", as she is represented as being dark-skinned with two scars on her face. Her colours are red, black and blue. Her favourite sacrifices include black pigs, griot , blood , and ": null
    },
    {
        "rum": "rhum agricole"
    },
    {
        ".     Ti Jean Petro is her son and Jean Petro is her lover or husband.         Erzulie Freda - The vain and flirty goddess of love. Her horses tend to cry tears of longing and regret. She is ": null
    },
    {
        "syncretized": "syncretism"
    },
    {
        " with ": null
    },
    {
        "Our Lady of Sorrows": "our lady of sorrows"
    },
    {
        " .   Erzulie Mansur - Represents maternal love and protects children from harm.   Granne Erzulie - Represents the wisdom granted by experience and maturity and grandmotherly kindness and love. She is syncretized with ": null
    },
    {
        "St. Anne": "st. anne"
    },
    {
        ", the mother of the Virgin Mary.       Erzulie Den Tort or Erzulie Dantor Protects women and children and deals revenge against those who wrong them.   Erzulie Balianne - Silences hearts. Keeps secrets or ensures that secrets will not be revealed. Helps people to forget past loves and overcome passionate emotions. Her horses tend to speak as if they have a gag in their mouth. She is syncretized with ": null
    },
    {
        "The Immaculate Heart": "immaculate heart of mary"
    },
    {
        ".   Erzulie Mapiangue Deals with the pain of childbirth and the protection of unborn and newborn babies. Her horses tend to get in a fetal position or birthing position and cry tears of pain. Common syncretization is as the ": null
    },
    {
        "Virgin and Infant of Prague": "infant jesus of prague"
    },
    {
        ", which wear matching red velvet robes and gold crowns.   Erzulie Yeux Rouge or Erzulie Ge-Rouge Takes revenge on unfaithful lovers. Her horses cry tears of bitter sadness.   Erzulie Toho Aids the jealous or slighted in love. Her horses cry tears of anger.       Erzulie La Flambeau   Erzulie Wangol        La Sirène or  Mami Wata  is associated with Erzulie and sometimes is displayed in Erzulies roles as mother, lover, and protector. Her husband is ": null
    },
    {
        "Agwe": "agwe"
    },
    {
        ", the King of the Sea and patron of sailors and fishermen.    Marinette Bras-Chêche  or Marinette Bwa Chech , a Kongo Loa, is similar to Erzulie Dantor. She represents revolt and misfortune and is prayed to either to placate her wrath or to direct her fury at another. She is in the form of a skeleton or rotting corpse and is syncretically represented by the  Anima Sola  .   Mai-Louise is an Ibo goddess.   Ti-Quitta / Ti Kitha, a Loa of sexuality and fertility, is one of the Quitta Loas. One of her aspects is Ti Quitta Demembre .    Maman Brigitte  , is a ": null
    },
    {
        "Guede goddess": "guede"
    },
    {
        " who is the wife of  Baron Samedi  and protector of gravestones or funerary markers. She is syncretically represented by ": null
    },
    {
        "St Brigit": "st brigit"
    },
    {
        ".   Tsillah Wedo is associated with Erzulie. She is depicted as a beautiful virgin of great wealth.       ;Music    Erzulie nennen O , a song in honor of Erzulie Freda that was composed in the 42s by ": null
    },
    {
        "Kandjo": "auguste de pradines"
    },
    {
        ", continues to be played in Haiti as part of its folkloric repertoire.   A 42 song on the album Rising Above Bedlam by ": null
    },
    {
        "Jah Wobble": "jah wobble"
    },
    {
        "s Invaders of the Heart. Released by Oval Records in 42 The album was a shortlisted nominee for the 42 Mercury Prize.   A 42 solo album by free-jazz pianist Cecil Taylor is called  Erzulie Maketh Scent .   Mistress of Erzulie was the first track on ": null
    },
    {
        "Alannah Myles": "alannah myles"
    },
    {
        " 42 album  A-lan-nah .   Erzulie is also a character in the Broadway musical  Once On This Island  as the beautiful goddess of love.   In the ": null
    },
    {
        "Steely Dan": "steely dan"
    },
    {
        " song Two Against Nature , the narrator describes Madame Erzulie as a ": null
    },
    {
        "succubus": "succubus"
    },
    {
        " who bangs you silly but leaves a nasty bite.     ;Literature   A powerful swamp witch/voodoo woman in Terry Pratchetts Discworld novel  Witches Abroad  is named Erzulie Gogol. She is the lover of Genuas former ruler, Baron Saturday . Fantastic Fiction    In the  Buffy the Vampire Slayer  comic  Past Lives, part 42 , Erzulie is invoked to clear a room of all magic.   Erzulie, ": null
    },
    {
        "Papa Legba": "papa legba"
    },
    {
        " and ": null
    },
    {
        "Baron Samedi": "baron samedi"
    },
    {
        " all appear in the ": null
    },
    {
        "WildCats": "wildcats"
    },
    {
        " original comic series, assisting ": null
    },
    {
        "Voodoo": "voodoo"
    },
    {
        ".   There is discussion of a portrait of Maitresse Erzulie in ": null
    },
    {
        "Zadie Smith": "zadie smith"
    },
    {
        "s 42 novel  On Beauty . ": null
    },
    {
        "Zadie Smith": "zadie smith"
    },
    {
        " On Beauty": "on beauty"
    },
    {
        " — London, 42    Erzulie is a love goddess in House of Whispers in  The Sandman Universe  comics series.   Erzulie and other popular Loa together with the adepts of Voodoo are depicted in ": null
    },
    {
        "Andrei Gusev": "andrei gusev"
    },
    {
        "s novel Our Wild Sex in Malindi . ": null
    },
    {
        "Andrei Gusev": "andrei gusev"
    },
    {
        " , 42 ": null
    },
    {
        "Andrei Gusev": "andrei gusev"
    },
    {
        "  in Lady’s Club      ;Television   In  The Spectacular Spider-Man  animated series, Ezili is the surname of the villain ": null
    },
    {
        "Calypso": "calypso"
    },
    {
        ", a voodoo practitioner who had no last name in the original comics.     ;Broadway   In the Broadway show  Once On This Island ": null
    }
]