[
    {
        "        Escape Clause is episode six of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on November 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              Mean-spirited, abusive ": null
    },
    {
        "hypochondriac": "hypochondriac"
    },
    {
        " Walter Bedeker sells his soul to the ": null
    },
    {
        "devil": "devil"
    },
    {
        " in exchange for immortality": "deal with the devil"
    },
    {
        ", adding enough conditions to keep him out of Cadwalladers clutches forever. Cadwallader readily agrees to his demands, only stipulating an ": null
    },
    {
        "escape clause": "escape clause"
    },
    {
        " which allows Bedeker to choose the time of his death if he tires of being immortal.     Bedeker uses his newfound invulnerability to collect insurance money and cheap thrills by hurling himself into life-threatening accidents. Soon growing bored with this, he comes to the realization that his constant fear of fatal illness was the one thing which gave him any interest in life. He tells his wife that he is going to attempt to regain the thrill by jumping off the roof of their apartment building.     While trying to stop him, his wife accidentally falls off the edge herself. Bedeker phones the authorities and tells them he murdered his wife, hoping to experience the electric chair.     However, due to his lawyers defense strategy, he is instead sentenced to life in prison without parole. Cadwallader visits Bedeker in his holding cell to remind him of the escape clause. Realizing he will face eternity in prison if he does not use it, Bedeker nods and suffers a fatal ": null
    },
    {
        "heart attack": "myocardial infarction"
    },
    {
        ". The guard discovers his lifeless body and sighs, Poor devil...        ": null
    },
    {
        "David Wayne": "david wayne"
    },
    {
        " as Walter Bedeker   ": null
    },
    {
        "Thomas Gomez": "thomas gomez"
    },
    {
        " as Mr. Cadwallader   ": null
    },
    {
        "Virginia Christine": "virginia christine"
    },
    {
        " as Ethel Bedeker   ": null
    },
    {
        "Dick Wilson": "dick wilson"
    },
    {
        " as insurance man 42   ": null
    },
    {
        "Joe Flynn": "joe flynn"
    },
    {
        " as insurance man 42   ": null
    },
    {
        "Wendell Holmes": "wendell holmes"
    },
    {
        " as Bedekers lawyer   ": null
    },
    {
        "Raymond Bailey": "raymond bailey"
    },
    {
        " as Bedekers doctor       Escape Clause was one of the three episodes-in-production mentioned by Rod Serling in his 42 promotional film pitching the series to potential sponsors, the others being ": null
    },
    {
        "The Lonely": "the lonely"
    },
    {
        " and ": null
    },
    {
        "Mr. Denton on Doomsday": "mr. denton on doomsday"
    },
    {
        " .       Here was a little gem. Good work, Rod Serling. This little piece about a hypochondriac who gets tangled up with an obese, clerical devil ranked with the best that has ever been accomplished in half-hour filmed television. —Excerpt from the Daily Variety review.     ": null
    },
    {
        "Disney": "disney"
    },
    {
        "s ": null
    },
    {
        "Twilight Zone Tower of Terror": "twilight zone tower of terror"
    },
    {
        " has a reference to this episode located in the basement of the attraction. The elevators have a certificate of inspection plaque, signed by Cadwallader , bearing the inspection number 42 . These numbers represent October 42 42 the date The Twilight Zone first aired.       Zicree, Marc Scott: The Twilight Zone Companion. Sillman-James Press, 42   DeVoe, Bill. . Trivia from The Twilight Zone. Albany, GA: Bear Manor Media.  The Twilight Zone: Unlocking the Door to a Television Classic. Churchville, MD: OTR Publishing.                           ": null
    }
]