[
    {
        "   Escape Velocity is a ": null
    },
    {
        "single-player": "single-player"
    },
    {
        " role-playing": "role-playing"
    },
    {
        " space trading and combat": "space flight simulator gamespace trading and combat simulator"
    },
    {
        " video game": "video game"
    },
    {
        " series first introduced in 42 by ": null
    },
    {
        "Ambrosia Software": "ambrosia software"
    },
    {
        " for the ": null
    },
    {
        "Apple Macintosh": "apple macintosh"
    },
    {
        ". Two other similar games based on the original,  EV Override  and  EV Nova , followed in 42 and 42 respectively, the latter of which is also available on ": null
    },
    {
        "Microsoft Windows": "microsoft windows"
    },
    {
        ". In addition there is a ": null
    },
    {
        "trading card game": "collectible card game"
    },
    {
        " available based on the storyline of the EV Nova universe.     The series was created as a joint effort between several people and groups. ": null
    },
    {
        "Matt Burch": "matt burch"
    },
    {
        " programmed all three games in their entirety except for the registration system and various libraries. He also devised and created the scenario for the first game. ": null
    },
    {
        "Ambrosia Software": "ambrosia software"
    },
    {
        ", headed by Andrew Welch, managed marketing, registration, and distribution, as well as providing several external libraries used by the games. Early test versions of the game went by the name Merc . Peter Cartwright wrote the scenario for EV Override and the Australian company ": null
    },
    {
        "ATMOS": "atmos software"
    },
    {
        " created the scenario of EV Nova; both originated as plug-ins for the preceding games before being picked up by Ambrosia as sequels. The fighter pilot voices in the original game were provided by Patrick Delahanty. A plug-in of additional phrases was also created and later included as part of EV Override.     While there have been no announcements regarding the future of the series since the 42 release of Escape Velocity Nova, the extensible plug-in system allows users to continue developing new third-party content for the game.       The first two Escape Velocity games are only available in their original forms for the ": null
    },
    {
        "Apple Macintosh": "apple macintosh"
    },
    {
        " and are ": null
    },
    {
        "Classic": "classic"
    },
    {
        "-only. EV Nova is a ": null
    },
    {
        "Carbon": "carbon"
    },
    {
        " application and runs natively on both the original ": null
    },
    {
        "Mac OS": "mac os"
    },
    {
        " and ": null
    },
    {
        "Mac OS X": "mac os x"
    },
    {
        ", and has been ported to ": null
    },
    {
        "Windows": "microsoft windows"
    },
    {
        ". Version 42.42 of EV Nova, released in December 42 is a Universal Binary, and runs natively on Intel-based Macs. Adapted versions of the scenarios of the first two games that run natively in EV Nova are available for free.     This series follows the general licensing rule for Ambrosia Software. All three games are ": null
    },
    {
        "shareware": "shareware"
    },
    {
        ". Ambrosias shareware system allows most distribution of unregistered games. Copies of the first two Escape Velocity games will work without limitation for 42 days. Afterwards, the player is simply reminded at startup that they have not registered, and told how many times they have run the game, as well as for how many hours it has been run. There is also the character called Capn Hector  who reminds the player to register. During the trial this is done by flying by the players ship and sending a message. After the trial period has expired, the character starts attacking the player, but in EV Override, Capn Hector also steals the players credits. Players can not damage Capn Hector directly, though in the original game it was possible for splash damage to disable or destroy her ship.     An unregistered copy of EV Nova is more limited. In addition to the attacks by Capn Hector, certain ships and technologies cannot be obtained after the thirty-day trial ends, and even before then, the games story lines stop about two thirds of the way through, and plug-ins are not supported. Once the game has been registered, Capn Hector and all of the other restrictions disappear from the game.     The entire series features an open-ended plug-in architecture, allowing new scenarios to be written by users. This technology is based on the ": null
    },
    {
        "Macintosh resource fork": "resource fork"
    },
    {
        " format, making it possible to develop plug-ins without using any purpose-designed editors . Since Windows does not support resource forks and it is therefore impossible to preserve them when transferring files to Windows-based computers, an alternate format and a conversion system were devised for the Windows version of the game.       Much of the game takes place in space, with the player flying a ship from a third-person overhead perspective. The player has the option of engaging in both combat and trade. Players are able to fly through hundreds of star systems, which are connected to each other by hyperlinks. Ships travel between star systems along the hyperlinks by engaging their hyperdrive, a form of ": null
    },
    {
        "faster-than-light": "faster-than-light"
    },
    {
        " travel. In Nova, wormholes or hypergates may also be utilized for instantaneous travel. Most systems contain stellar objects such as planets and space stations. Players can land on these objects, where they may be given the option to trade, gain missions, and purchase new spaceships or add-on outfits for their current spaceship. The plot is advanced through missions available from facilities on planets as well as ": null
    },
    {
        "NPC": "non-player character"
    },
    {
        "s flying through space. Players can choose which missions to follow and which governments to form a good relationship with or to be entirely neutral. They can choose to be a trader or a mercenary or an asteroid miner among a number of things or a combination of several.     The three games are alike in gameplay only; the universe and plot are completely separate and unrelated between the releases . Each releases engine contains improvements on the previous version, although by far the most significant improvements were made in the third release.     A turbo boost can be acquired which, when activated, plays an audio clip from the introduction to the British television program  Thunderbirds .     Occasionally the player will encounter ": null
    },
    {
        "Sinistar": "sinistar"
    },
    {
        ", including his voice files.       The plot of the original Escape Velocity involves disputes between the Confederation government and a Rebellion against it. As noted earlier, the player may choose sides based on who they believe is right, who they believe is stronger, who they believe it is more profitable to support, or any other criteria. The player begins with a ": null
    },
    {
        "shuttlecraft": "shuttlecraft"
    },
    {
        " resembling those from  Star Trek .       The Confederation is one of two main governments in the original game. According to the game, as humanity expanded into the ": null
    },
    {
        "Milky Way Galaxy": "milky way galaxy"
    },
    {
        ", the new colonies operated independently of each other. However, an invasion by an unknown alien race forced the colonies to unify under Earths leadership. This became known as the Confederation. The Confederation and the aliens fought a bloody war, with millions of humans being killed. Eventually the Confederation prevailed. At the start of the game, the Confederation and the Rebellion are locked in a bloody stalemate. The Confederation uses four ships in its military, namely the Confederate Patrol Ship, the Confederate Gunboat, the Confederate Frigate and the Confederate Cruiser.     The Rebellion is the other main government in Escape Velocity. According to the game, after winning the war with the aliens, the Confederation did not relinquish its naval power and began exploiting the resources of the outer worlds. Those worlds eventually seceded, provoking a civil war. The Rebellion is in turn criticized for its aggressive nature, support of quasi-criminal organizations, and attacks on civilian shipping and liners. The Rebellion uses four ships in their campaign against the Confederation, namely the Manta, the Rebel Destroyer, the Rebel Cruiser and the Escort Carrier, the last of which is seen only when the player is working for the Confederation.     The Cydonians of New Cydonia and Letheans of Lethe Prime occupy two systems in the galactic southeast of the galaxy and are also locked in a war over water rights at the start of the game; more specific information regarding the conflict is never provided. Both sides utilize the Defender, the Argosy, and the Corvette when fighting in space. The Cydonians also use the Lightning, whereas the Letheans supplement these ships with the Rapier.     The game also includes several trading corporations, including Starbound Shipping, Consolidated Express, and United Galactic Express. Starbound Shipping and United Galactic Express are both in direct competition with Consolidated Express, and are therefore de facto allies. Astex Mining Corporation is a mining company that works exclusively for the Confederation, and as a result is often targeted by the Rebellion and its sympathizers.     The Artemis Group are a family run organization devoted to eliminating pirates as well as ensure the galactic order remains balanced. They attempt to prevent either the Confederation or Rebellion from winning the civil war.     The starting planet, Levo, which is in a system by the same name, has a militia patrolling it to defend it from Pirates, though Pirates never appear in the system except when following the player because of valuable cargo in their possession.     There are a number of Pirates in the game, who immediately attempt to destroy any non-Pirate ship they spot, with the exception of the player once they have achieved a high combat rating. The Pirates do not plunder their targets due to limitations in the game; the player, however, is allowed to board ships, and may from there steal money, cargo, fuel, or ammunition, or attempt to capture the ship for use as their own or as an escort. Another key detail, Pirates may board your ship if they disable you. In EV Nova, Pirates do board and plunder ships, including the player.        MacUser  named Escape Velocity the best ": null
    },
    {
        "shareware": "shareware"
    },
    {
        " game of 42           Escape Velocity has two sequels:  Override  and  Nova  .     Endless Sky is an ": null
    },
    {
        "open-source video game": "open-source video game"
    },
    {
        " released in ": null
    },
    {
        "Q42": "calendar yearquarters"
    },
    {
        " 42 which journalist Adam Smith writing for  Rock, Paper, Shotgun  called the closest thing to an Escape Velocity game since the release of ": null
    },
    {
        "Nova": "escape velocity nova"
    },
    {
        " in 42  ": null
    }
]