[
    {
        "     The escort carrier or escort aircraft carrier , also called a jeep carrier or baby flattop in the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " or Woolworth Carrier by the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ", was a small and slow type of ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        " used by the Royal Navy, the United States Navy, the ": null
    },
    {
        "Imperial Japanese Navy": "imperial japanese navy"
    },
    {
        " and ": null
    },
    {
        "Imperial Japanese Army Air Force": "imperial japanese army air forcearmy escort-aircraft carriers"
    },
    {
        " in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". They were typically half the length and a third the displacement of larger ": null
    },
    {
        "fleet carrier": "fleet carrier"
    },
    {
        "s, slower, carried fewer planes, and more-lightly armed and armored. Escort carriers were most often built upon a commercial ship hull, so they were cheaper and could be built quickly. This was their principal advantage as they could be completed in greater numbers as a stop-gap when fleet carriers were scarce. However, the lack of protection made escort carriers particularly vulnerable, and several were sunk with great loss of life. The ": null
    },
    {
        "light carrier": "light aircraft carrier"
    },
    {
        " was a similar concept to escort carriers in most respects, but were capable of higher speeds to allow operation alongside fleet carriers.     Escort carriers were too slow to keep up with the main forces consisting of fleet carriers, battleships, and cruisers. Instead, they were used to escort ": null
    },
    {
        "convoy": "convoy"
    },
    {
        "s, defending them from enemy threats such as submarines and planes. In the invasions of mainland Europe and Pacific islands, escort carriers provided ": null
    },
    {
        "air support": "air support"
    },
    {
        " to ground forces during ": null
    },
    {
        "amphibious operation": "amphibious operation"
    },
    {
        "s. Escort carriers also served as backup aircraft transports for fleet carriers and ferried aircraft of all military services to points of delivery.     In the ": null
    },
    {
        "Battle of the Atlantic": "battle of the atlantic"
    },
    {
        ", escort carriers were used to protect convoys against ": null
    },
    {
        "U-boat": "u-boat"
    },
    {
        "s. Initially escort carriers accompanied the merchant ships and helped to fend off attacks from aircraft and submarines. As numbers increased later in the war, escort carriers also formed part of hunter-killer groups that ": null
    },
    {
        "sought out submarines": "anti-submarine warfareworld war ii"
    },
    {
        " instead of being attached to a particular convoy.     In the Pacific theater, CVEs provided air support of ground troops in the ": null
    },
    {
        "Battle of Leyte Gulf": "battle of leyte gulf"
    },
    {
        ". They lacked the speed and weapons to counter enemy fleets, relying on the protection of a ": null
    },
    {
        "Fast Carrier Task Force": "fast carrier task force"
    },
    {
        ". However, at the ": null
    },
    {
        "Battle off Samar": "battle off samar"
    },
    {
        ", one U.S. task force of escort carriers managed to successfully defend itself against a much larger Japanese force of battleships and cruisers. The Japanese met a furious defense of carrier aircraft, screening destroyers, and destroyer escorts, proving that CVEs could appear to have the same striking power as full CVs.     Of the 151 aircraft carriers built in the U.S. during World War II, 122 were escort carriers. Though no examples survive to this day, the  was the most numerous class of aircraft carrier, with 50 launched. Second was the , with 45 launched.       In the early 1920s, the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        " imposed limits on the maximum size and total tonnage of aircraft carriers for the five main naval powers. Later treaties largely kept these provisions. As a result, construction between the World Wars had been insufficient to meet operational needs for aircraft carriers as World War II expanded from Europe. Too few fleet carriers were available to simultaneously transport aircraft to distant bases, support amphibious invasions, offer carrier landing training for replacement pilots, conduct anti-submarine patrols, and provide defensive air cover for deployed battleships and cruisers. The foregoing mission requirements limited use of fleet carriers′ unique offensive strike capability demonstrated at the ": null
    },
    {
        "Battle of Taranto": "battle of taranto"
    },
    {
        " and the ": null
    },
    {
        "Attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        ". Conversion of existing ships provided additional aircraft carriers until new construction became available.     Conversions of cruisers and passenger liners with speed similar to fleet carriers were identified by the U.S. as ": null
    },
    {
        "light aircraft carriers": "light aircraft carrier"
    },
    {
        "  able to operate at battle fleet speeds. Slower conversions were classified as escort carriers and were considered naval auxiliaries suitable for pilot training and transport of aircraft to distant bases.     The Royal Navy had recognized a need for carriers to defend its trade routes in the 1930s. Hague 2000 p.83 While designs had been prepared for trade protection carriers and five suitable liners identified for conversion, nothing further was done mostly because there were insufficient aircraft for even the fleet carriers under construction at the time. However, by 1940 the need had become urgent and  was converted from the captured German merchant ship MV Hannover and commissioned in July 1941. Brown pp. 62–63 For defense from German aircraft, convoys were supplied first with ": null
    },
    {
        "fighter catapult ships": "fighter catapult ship"
    },
    {
        "and ": null
    },
    {
        "CAM ships": "cam ship"
    },
    {
        "that could carry a single fighter. In the interim, before escort carriers could be supplied, they also brought in ": null
    },
    {
        "merchant aircraft carriers": "merchant aircraft carrier"
    },
    {
        "that could operate four aircraft.     In 1940, Admiral ": null
    },
    {
        "William Halsey": "william f. halsey, jr."
    },
    {
        " recommended construction of naval auxiliaries for pilot training. Friedman 1983 p.162 In early 1941 the British asked the US to build on their behalf six carriers of an improved Audacity design but the US had already begun their own escort carrier. Brown p. 63 On 1 February 1941, the United States Chief of Naval Operations gave priority to construction of naval auxiliaries for aircraft transport. Friedman 1983 p. 165 U.S. ships built to meet these needs were initially referred to as auxiliary aircraft escort vessels  in February 1942 and then auxiliary aircraft carrier  on 5 August 1942. Evans, Robert L. Cinderella Carriers . United States Naval Institute Proceedings. August 1976. pp. 53–60. The first U.S. example of the type was . ": null
    },
    {
        "Operation Torch": "operation torch"
    },
    {
        " and North Atlantic anti-submarine warfare proved these ships capable aircraft carriers for ship formations moving at the speed of trade or amphibious invasion convoys. U.S. classification revision to escort aircraft carrier  on 15 July 1943 reflected upgraded status from auxiliary to combatant. Friedman 1983 pp. 159–160 They were informally known as Jeep carriers or baby flattops . It was quickly found that the escort carriers had better performance than light carriers, which tended to pitch badly in moderate to high seas. The Commencement Bay class was designed to incorporate the best features of American CVLs on a more stable hull with a less expensive propulsion system. Friedman 1983 p. 159     Among their crews, CVE was sarcastically said to stand for Combustible, Vulnerable, and Expendable . Magazine protection was minimal in comparison to fleet aircraft carriers. Friedman 1983 p. 176  was sunk within minutes by a single torpedo, and  exploded from undetermined causes with very heavy loss of life. Three escort carriers—,  and —were destroyed by  kamikaze s, the largest ships to meet such a fate.     Allied escort carriers were typically around  long, not much more than half the length of the almost  fleet carriers of the same era, but were less than  of the weight. A typical escort carrier displaced about , as compared to almost  for a full-size fleet carrier. The aircraft ": null
    },
    {
        "hangar": "hangar"
    },
    {
        " typically ran only  of the way under the flight deck and housed a combination of 24–30 fighters and bombers organized into one single composite squadron . By comparison, a late ": null
    },
    {
        "Essex-class fleet carrier": "essex-class aircraft carrier"
    },
    {
        " could carry a total of 103 aircraft organized into separate fighter, bomber and torpedo-bomber squadrons.     The island on these ships was small and cramped, and located well forward of the ": null
    },
    {
        "funnels": "funnel"
    },
    {
        ". Although the first escort carriers had only one aircraft elevator, having two elevators , along with the single aircraft catapult, quickly became standard. The carriers employed the same system of arresting cables and tail hooks as on the big carriers, and procedures for ": null
    },
    {
        "launch and recovery": "launch and recovery cycle"
    },
    {
        " were the same as well.     The crew size was less than  of that of a large carrier, but this was still a bigger complement than most naval vessels. It was large enough to justify the existence of facilities such as a permanent canteen or snack bar, called a ": null
    },
    {
        "gedunk bar": "gedunk bar"
    },
    {
        ", in addition to the mess. The bar was open for longer hours than the mess and sold several flavors of ": null
    },
    {
        "ice cream": "ice cream"
    },
    {
        ", along with cigarettes and other consumables. There were also several ": null
    },
    {
        "vending machines": "vending machine"
    },
    {
        "available on board.     In all, 130 Allied escort carriers were launched or converted during the war. Of these, six were British conversions of merchant ships: , , , ,  and . The remaining escort carriers were U.S.-built. Like the British, the first U.S. escort carriers were converted merchant vessels . The Bogue-class carriers were based on the hull of the ": null
    },
    {
        "Type C3 cargo ship": "type c3 ship"
    },
    {
        ". The last 69 escort carriers of the  and  classes were purpose-designed and purpose-built carriers drawing on the experience gained with the previous classes.          Originally developed at the behest of the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " to operate as part of a North Atlantic ": null
    },
    {
        "convoy": "convoy"
    },
    {
        " escort, rather than as part of a naval strike force, many of the escort carriers produced were assigned to the Royal Navy for the duration of the war under the ": null
    },
    {
        "Lend-Lease": "lend-lease"
    },
    {
        " act. They supplemented and then replaced the converted ": null
    },
    {
        "merchant aircraft carriers": "merchant aircraft carrier"
    },
    {
        "that were put into service by the British and Dutch as an emergency measure until the escort carriers became available. As convoy escorts, they were used by the Royal Navy to provide air scouting, to ward off enemy long-range scouting aircraft and, increasingly, to spot and hunt submarines. Often additional escort carriers also joined convoys, not as fighting ships, but as transporters, ferrying aircraft from the U.S. to Britain. In this case, the aircraft cargo could be doubled by storing aircraft on the flight deck as well as in the hangar.     The ships sent to the Royal Navy were slightly modified, partly to suit the traditions of that service. Among other things the ice cream making machines were removed, since they were considered unnecessary luxuries on ships, which served ": null
    },
    {
        "grog": "grog"
    },
    {
        " and other ": null
    },
    {
        "alcoholic beverage": "alcoholic beverage"
    },
    {
        "s. The heavy duty ": null
    },
    {
        "washing machines": "washing machine"
    },
    {
        "of the laundry room were also removed since all a British sailor needs to keep clean is a bucket and a bar of soap .     Other modifications were due to the need for a completely enclosed hangar when operating in the ": null
    },
    {
        "North Atlantic": "north atlantic"
    },
    {
        " and in support of the ": null
    },
    {
        "Arctic convoys": "arctic convoys"
    },
    {
        ".       Meanwhile, the U.S. discovered their own use for the escort carriers. In the North Atlantic, they supplemented the escorting ": null
    },
    {
        "destroyers": "destroyer"
    },
    {
        "by providing air support for anti-submarine warfare. One of these escort carriers, , was instrumental in the capture of  off North Africa in 1944.     In the ": null
    },
    {
        "Pacific theater": "pacific war"
    },
    {
        ", escort carriers lacked the speed to sail with fast carrier attack groups, so were often tasked to escort the landing ships and troop carriers during the ": null
    },
    {
        "island-hopping": "leapfrogging"
    },
    {
        " campaign. In this role they provided air cover for the troopships and flew the first wave of attacks on beach fortifications in amphibious landing operations. On occasion, they even escorted the large carriers, serving as emergency airstrips and providing fighter cover for their larger sisters while these were busy readying or refueling their own planes. They also transported aircraft and spare parts from the U.S. to remote island airstrips.     The ": null
    },
    {
        "attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        " brought up an urgent need for ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        "s, so some ": null
    },
    {
        "T3 tankers": "t3 tanker"
    },
    {
        "were converted to escort carriers,  is example of how a T3 tanker ": null
    },
    {
        "hull": "hull"
    },
    {
        " AO-33 was rebuilt to be an escort carrier. The T3 tanker size and speed made the T3 a useful escort carrier. There were two classes of T3 hull carriers: Sangamon class and Commencement Bay class.               A major battle for these escort carriers was the ": null
    },
    {
        "Battle off Samar": "battle off samar"
    },
    {
        " in the Philippines on 25 October 1944. The Japanese lured Admiral ": null
    },
    {
        "William Halsey, Jr.": "william halsey, jr."
    },
    {
        " into chasing a decoy fleet with his ": null
    },
    {
        "3rd Fleet": "united states third fleet"
    },
    {
        ". This left aircraft from 16 small and slow escort carriers in three task groups armed primarily to bomb ground forces; along with their protective screen of destroyers and slower ": null
    },
    {
        "destroyer escort": "destroyer escort"
    },
    {
        "s, with Taffy 3 bearing the brunt of the fight. They faced a Japanese force of four ": null
    },
    {
        "battleship": "battleship"
    },
    {
        "s, including the formidable  , eight ": null
    },
    {
        "cruiser": "cruiser"
    },
    {
        "s, and 11 destroyers. The American ships held off the Japanese.     The slow carriers could not outrun  cruisers. They launched their aircraft and maneuvered to avoid shellfire for over an hour. They took dozens of hits, mostly from armor-piercing rounds that passed right through their thin, unarmored hulls without exploding. , sunk in this action, was the only U.S. carrier lost to enemy surface gunfire in the war, and the Japanese concentration of fire on this one carrier assisted the escape of the others. The carriers′ only substantial armament—aside from their aircraft—was a single 5 in ": null
    },
    {
        "dual-purpose gun": "dual-purpose gun"
    },
    {
        " mounted on the stern, but the pursuing Japanese cruisers closed to within range of these guns. One of the guns caused critical damage to the burning Japanese heavy cruiser  and a subsequent bomb dropped from one of the task forces aircraft hit the heavy cruisers forward machinery room, leaving her dead in the water. Several kamikaze aircraft were shot down by carrier gunners, with only  lost to air attack. The Americans lost a similar number of ships and men to the ": null
    },
    {
        "Battle of Coral Sea": "battle of coral sea"
    },
    {
        " and ": null
    },
    {
        "Battle of Midway": "battle of midway"
    },
    {
        " combined.               Many escort carriers were ": null
    },
    {
        "Lend-Lease": "lend-lease"
    },
    {
        "d to the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", this list specifies the breakdown in service to each navy.     : Two ships, one in USN service  and one in British service .   : Four ships, one mainly in USN service  and three in British service.   : Four ships, all in USN service.   : 45 ships, 11 in USN service, 34 in British service as Attacker class and Ruler class .   : 50 ships, all in USN service.   : 19 ships, all in USN service, including two that were accepted but not commissioned and laid up for many years after the war. Four more units were canceled and scrapped on the building slips. The Commencement Bay-class ships were seen as the finest escort carriers ever built, Friedman 1983, p. 199. and several units continued in service after the war as training carriers, aircraft ferries and other auxiliary uses.     In addition, six escort carriers were produced by the British during the war .     The table below lists escort carriers and similar ships performing the same missions. The first four were built as early fleet aircraft carriers. ": null
    },
    {
        "Merchant aircraft carriers": "merchant aircraft carrier"
    },
    {
        " carried trade cargo in addition to operating aircraft. Aircraft transports carried larger numbers of planes by eliminating accommodation for operating personnel and storage of fuel and ammunition.                      The years following World War II brought many revolutionary new technologies to the navy, most notably the ": null
    },
    {
        "helicopter": "helicopter"
    },
    {
        " and the ": null
    },
    {
        "jet fighter": "fighter aircraftfirst generation jet fighters"
    },
    {
        ", and with this a complete rethinking of its strategies and ships′ tasks. Although several of the latest Commencement Bay-class CVE were deployed as floating airfields during the ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        ", the main reasons for the development of the escort carrier had disappeared or could be dealt with better by newer weapons. The emergence of the helicopter meant that helicopter-deck equipped ": null
    },
    {
        "frigates": "frigate"
    },
    {
        "could now take over the CVEs role in a convoy while also performing their own traditional role as submarine hunters. Ship-mounted ": null
    },
    {
        "guided missile": "guided missile"
    },
    {
        " launchers took over much of the aircraft protection role, and ": null
    },
    {
        "in-flight refueling": "in-flight refueling"
    },
    {
        " abolished the need for floating stopover points for transport or patrol aircraft. As a result, after the Commencement Bay class, no new escort carriers were designed, and with every downsizing of the navy, the CVEs were the first to be mothballed.     Several escort carriers were pressed back into service during the first years of the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        " because of their ability to carry large numbers of aircraft. Redesignated AKV , they were manned by a civilian crew and used to ferry whole aircraft and spare parts from the U.S. to Army, Air Force and Marine bases in ": null
    },
    {
        "South Vietnam": "south vietnam"
    },
    {
        ". However, CVEs were useful in this role only for a limited period. Once all major aircraft were equipped with refueling probes, it became much easier to fly the aircraft directly to its base instead of shipping it overseas.     The last chapter in the history of escort carriers consisted of two conversions: As an experiment,  was converted from an aircraft carrier into a pure ": null
    },
    {
        "helicopter carrier": "helicopter carrier"
    },
    {
        " and used by the Marine Corps to carry assault helicopters for the first wave of ": null
    },
    {
        "amphibious warfare": "amphibious warfare"
    },
    {
        " operations. Later, Thetis Bay became a full amphibious assault ship . Although in service only from 1955 to 1964, the experience gained in her training exercises greatly influenced the design of todays ": null
    },
    {
        "amphibious assault ship": "amphibious assault ship"
    },
    {
        "s.     In the second conversion, in 1961,  had all her aircraft handling equipment removed and four tall radio antennas installed on her long, flat deck. In lieu of aircraft, the hangar deck now had no fewer than 24 military radio transmitter trucks bolted to its floor. Rechristened , the ship was used as a communication relay ship and served dutifully through the Vietnam War as a floating radio station, relaying transmissions between the forces on the ground and the command centers back home. Like Thetis Bay, the experience gained before Annapolis was stricken in 1976 helped develop todays purpose-built ": null
    },
    {
        "amphibious command ships": "amphibious command ship"
    },
    {
        "of the .     Unlike almost all other major classes of ships and patrol boats from World War II, most of which can be found in a museum or port, no escort carrier or American ": null
    },
    {
        "light carrier": "light aircraft carrier"
    },
    {
        " has survived: all were destroyed during the war or broken up in the following decades. The ": null
    },
    {
        "Dictionary of American Naval Fighting Ships": "dictionary of american naval fighting ships"
    },
    {
        " records that the last former escort carrier remaining in naval service — USS Annapolis — was sold for scrapping 19 December 1979. The last American light carrier was , which was broken up in 2002 after a decade-long attempt to preserve the vessel.     The U.S. designed the ": null
    },
    {
        "Sea Control Ship": "sea control ship"
    },
    {
        "  – GlobalSecurity.org to serve a similar role; whilst none were actually built, the ": null
    },
    {
        "Spanish Principe de Asturias": "spanish aircraft carrier principe de asturias"
    },
    {
        " and the Thai ": null
    },
    {
        "Chakri Naruebet": "htms chakri naruebet"
    }
]