[
    {
        "           The Eternal Champion is a fictional creation of the author ": null
    },
    {
        "Michael Moorcock": "michael moorcock"
    },
    {
        " and is a recurrent feature in many of his novels.         The fictional ": null
    },
    {
        "Moorcock Multiverse": "multiverse"
    },
    {
        ", consisting of several universes, many layered dimensions, spheres, and alternative worlds, is the place where the eternal struggle between ": null
    },
    {
        "Law and Chaos": "law and chaos"
    },
    {
        ", the two main forces of Moorcocks worlds, takes place. In all these dimensions and worlds, these forces constantly war for supremacy. Since the victory of Law or Chaos would cause the Multiverse either to become permanently static or totally formless, the Cosmic Balance enforces certain limits which the powers of Law and Chaos violate at their peril. Law, Chaos, and the Balance are active, but seemingly non-sentient, forces which empower various champions and representatives.     The Champion Eternal, a Hero who exists in all ": null
    },
    {
        "dimensions": "dimensions"
    },
    {
        ", times and worlds, is the one who is chosen by fate to fight for the Cosmic Balance; however, he often does not know of his role, or, even worse, he struggles against it, never to succeed. Since his role is to intervene when either Law or Chaos have gained an excess of power, he is always doomed to be surrounded by strife and destruction, although he may go through long periods of relative quiet.     All the incarnations of the Eternal Champion are facets of each other, and the Champion may also be aided by a companion, who, like himself, exists in various incarnations. Likewise the Champion is often associated with a romantic interest that is possibly an aspect of an eternal figure. Other characters in the various books have occasionally crossed over from one universe to another, although it is unclear what their status in the multiverse may be. Normally, the incarnations of the Champion do not interact and are treated as serial incarnations for facets of a single consciousness, but various cataclysmic events may bring them together in various ways. This is very dangerous , but amplifies the Champions power enormously.     In every aspect, the Champion is a warrior almost without peer: when he wields some version of his usual weapon, the Black Sword  and few can stand against him. He is also usually an adept, if often unwilling, leader of fighters and has strategic and tactical abilities.       Incarnations of the Eternal Champion include:   Alan Powys   Alerik   Alivale   Artos the Celt   Asquiol of Pompeii   Aubec, Earl of Malador   Brian   ": null
    },
    {
        "Captain Cornelius": "the coming of the terraphiles"
    },
    {
        "  Corum Jhaelen Irsei": "corum jhaelen irsei"
    },
    {
        "   Duke ": null
    },
    {
        "Dorian Hawkmoon": "dorian hawkmoon"
    },
    {
        " Elric of Melniboné": "elric of melniboné"
    },
    {
        " Erekosë": "erekosë"
    },
    {
        ", the first identity assumed by John Daker   Prince Flamadin, the fourth identity assumed by John Daker   Franik   Ghardas Valabasian, Conqueror of the Distant Suns   Goldberg   Ilanth   Ilian of Garathorm   ": null
    },
    {
        "Jerry Cornelius": "jerry cornelius"
    },
    {
        " Jherek Carnelian": "jherek carnelian"
    },
    {
        "  the one aspect of the Champion who remembers his previous lives.   Karl Glogauer, who turns out to be the real man behind the messianic figure of Jesus Christ   Klan   Konrad Arflane   Mejink-La-Kos   Michael Kane   Mv Okom Sebpt ORiley, Gunholder of the Qui Lors Ventures   Oshbek-Uy   ": null
    },
    {
        "Oswald Bastable": "oswald bastable"
    },
    {
        " Pyat": "pyat quartet"
    },
    {
        " or Maxim Arturovitch Pyatnitski   ": null
    },
    {
        "Roland": "roland"
    },
    {
        "    Ryan   Shaleen   Sojan the Swordsman   Graf ": null
    },
    {
        "Ulrich von Bek": "ulrich von bek"
    },
    {
        " Ulysses": "odysseus"
    },
    {
        "  the second identity assumed by John Daker   The Scar-Faced Brooder from Michael Moorcocks The Time Dweller: One of the earliest incarnations of the Eternal Champion, but set in Earths final years         Some of the incarnations of the Companion to Champions include:     Jaspar Colinadous   Jermays the Crooked   Jhary-a-Conel   Alnac Kreb    Moonglum   Oladahn   Gurni Gurnisson       Some of the incarnations of the Eternal Consort include:   Cymoril   Zarozinia   Catherine Cornelius   Ermizhad   Rhalina   Medhbh   Yisselda   Sabrina   Alisaard   Colinda Dovero   Mrs. Amelia Underwood   Oona von Bek   Sam Oakenhurst   Queen Eloarde         There is also a very obvious repetition of characters whose first names begins with the letter j , and whose last names begins with the letter c . Some of these J & C characters seem to be companions, while others seem to be mentors, and still others are champions .     A summary of J & C characters created by Michael Moorcock:     Jaspar Colinadous   Jehamiah Cohnahlias   Jeremiah Jerry Cornell   Jermays the Crooked   ": null
    },
    {
        "Jerry Cornelius": "jerry cornelius"
    },
    {
        " Jherek Carnelian": "jherek carnelian"
    },
    {
        " White Wolf Publishing": "white wolf publishing"
    },
    {
        " from 42 to 42 . That was the last time they were published all together in a comprehensive collection, though there have been several stories  added to the cycle since then, and some of the stories have been published in new editions , as well. In brackets are listed the incarnation of the Eternal Champion featured in a given story.     Vol. 42: The Eternal Champion  The Eternal Champion  & 42;": null
    },
    {
        "Erekosë/John Daker": "erekosë"
    },
    {
        " & 42;   The Sundered Worlds     Phoenix in Obsidian     To Rescue Tanelorn   Vol. 42: Von Bek  The War Hound and the Worlds Pain  & 42;": null
    },
    {
        "Ulrich von Bek": "ulrich von bek"
    },
    {
        " & 42;    The City in the Autumn Stars    The Dragon in the Sword   The Pleasure Gardens of Felipe Sagittarius   Vol. 42: Hawkmoon all four stories with ": null
    },
    {
        "Dorian Hawkmoon": "dorian hawkmoon"
    },
    {
        "    The Jewel in the Skull   The Mad Gods Amulet   The Sword of the Dawn   The Runestaff     Vol. 42:  A Nomad of the Time Streams  all three stories with ": null
    },
    {
        "Oswald Bastable": "oswald bastable"
    },
    {
        "    The Warlord of the Air   The Land Leviathan   The Steel Tsar    Vol. 42:  Elric: Song of the Black Sword  all six stories with ": null
    },
    {
        "Elric": "elric of melniboné"
    },
    {
        "   Elric of Melniboné The Fortress of the Pearl The Sailor on the Seas of Fate also Erekosë, ": null
    },
    {
        "Corum": "corum jhaelen irsei"
    },
    {
        ", and Hawkmoon   The Dreaming City   While the Gods Laugh   The Singing Citadel   Vol. 42: The Roads Between the Worlds The Wrecks of Time     The Winds of Limbo     The Shores of Death    Vol. 42: Corum: The Coming of Chaos   The Knight of the Swords The Queen of the Swords The King of the Swords   Vol. 42: Sailing to Utopia The Ice Schooner    The Black Corridor    The Distant Suns Colonel Jerry Cornelius, who seems to be a different character from ": null
    },
    {
        "Jerry Cornelius": "jerry cornelius"
    },
    {
        "   Flux   Vol. 42: Kane of Old Mars   City of the Beast    Lord of the Spiders    Masters of the Pit    Vol. 42:  The Dancers at the End of Time    An Alien Heat The Hollow Lands The End of All Songs   Vol. 42: Elric: The Stealer of Souls   The Sleeping Sorceress    The Revenge of the Rose Stormbringer   Vol. 42: Corum: The Prince with the Silver Hand   The Bull and the Spear The Oak and the Ram The Sword and the Stallion   Vol. 42: Legends from the End of Time   Pale Roses   White Stars   Ancient Shadows   Constant Fire    Elric at the End of Time   Vol. 42: Earl Aubec and Other Stories     Vol. 42: Count Brass   Count Brass The Champion of Garathorm   The Quest for Tanelorn       The New Nature of the Catastrophe    The Cornelius Quartet      The Final Programme   A Cure for Cancer   The English Assassin   The Condition of Muzak  A Cornelius Calendar  The Adventures of Una Persson and Catherine Cornelius in the Twentieth Century   The Entropy Tango  The Great Rock n Roll Swindle    ": null
    }
]