[
    {
        "Ethical non-naturalism is the ": null
    },
    {
        "meta-ethical": "meta-ethics"
    },
    {
        " view which claims that:   Ethical ": null
    },
    {
        "sentence": "sentence"
    },
    {
        "s express ": null
    },
    {
        "proposition": "proposition"
    },
    {
        "s.   Some such propositions are true.   Those propositions are made true by objective features of the world, independent of human opinion.   These moral features of the world are not ": null
    },
    {
        "reducible": "reductionism"
    },
    {
        " to any set of non-moral features.     This makes ethical non-naturalism a non-definist form of ": null
    },
    {
        "moral realism": "moral realism"
    },
    {
        ", which is in turn a form of ": null
    },
    {
        "cognitivism": "cognitivism"
    },
    {
        ". Ethical non-naturalism stands in opposition to ": null
    },
    {
        "ethical naturalism": "ethical naturalism"
    },
    {
        ", which claims that moral terms and properties are reducible to non-moral terms and properties, as well as to all forms of moral ": null
    },
    {
        "anti-realism": "anti-realism"
    },
    {
        ", including ": null
    },
    {
        "ethical subjectivism": "ethical subjectivism"
    },
    {
        " , ": null
    },
    {
        "error theory": "error theory"
    },
    {
        " , and ": null
    },
    {
        "non-cognitivism": "non-cognitivism"
    },
    {
        " .       According to ": null
    },
    {
        "G. E. Moore": "g. e. moore"
    },
    {
        ", ": null
    },
    {
        "Goodness": "goodness and value theory"
    },
    {
        " is a simple, undefinable, non-natural ": null
    },
    {
        "property": "property"
    },
    {
        ". To call goodness non-natural does not mean that it is ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " or ": null
    },
    {
        "divine": "god"
    },
    {
        ". It does mean, however, that goodness cannot be reduced to natural properties such as needs, wants or pleasures. Moore also stated that a reduction of ethical properties to a divine command would be the same as stating their naturalness. This would be an example of what he referred to as the ": null
    },
    {
        "naturalistic fallacy": "naturalistic fallacy"
    },
    {
        ".     Moore claimed that goodness is ": null
    },
    {
        "indefinable": "definition"
    },
    {
        " , i.e., it cannot be defined in any other terms. This is the central claim of non-naturalism. Thus, the meaning of sentences containing the word good cannot be explained entirely in terms of sentences not containing the word good. One cannot substitute words referring to ": null
    },
    {
        "pleasure": "pleasure"
    },
    {
        ", needs or anything else in place of good.     Some properties, such as hardness, roundness and dampness, are clearly natural properties. We encounter them in the real world and can ": null
    },
    {
        "perceive": "perception"
    },
    {
        " them. On the other hand, other properties, such as being good and being right, are not so obvious. A great novel is considered to be a good thing; goodness may be said to be a property of that novel. Paying ones debts and telling the truth are generally held to be right things to do; rightness may be said to be a property of certain human ": null
    },
    {
        "action": "action theory"
    },
    {
        "s.     However, these two types of property are quite different. Those natural properties, such as hardness and roundness, can be perceived and encountered in the real world. On the other hand, it is not immediately clear how to physically see, touch or measure the goodness of a novel or the rightness of an action.       Moore did not consider goodness and rightness to be natural properties, i.e., they cannot be defined in terms of any natural properties. How, then, can we know that anything is good and how can we distinguish good from bad?     Moral epistemology, the part of epistemology that studies how we know moral facts and how moral beliefs are justified, has proposed an answer. British epistemologists, following Moore, suggested that humans have a special ": null
    },
    {
        "faculty": "aptitude"
    },
    {
        ", a faculty of moral ": null
    },
    {
        "intuition": "intuition"
    },
    {
        ", which tells us what is good and bad, right and wrong.     ": null
    },
    {
        "Ethical intuitionists": "ethical intuitionism"
    },
    {
        " assert that, if we see a good person or a right action, and our faculty of moral intuition is sufficiently developed and unimpaired, we simply intuit that the person is good or that the action is right. Moral intuition is supposed to be a ": null
    },
    {
        "mental process": "mental process"
    },
    {
        " different from other, more familiar faculties like sense-perception, and that moral judgments are its outputs. When someone judges something to be good, or some action to be right, then the person is using the faculty of moral intuition. The faculty is attuned to those non-natural properties. Perhaps the best ordinary notion that approximates moral intuition would be the idea of a ": null
    },
    {
        "conscience": "conscience"
    },
    {
        ".       Moore also introduced what is called the ": null
    },
    {
        "open-question argument": "open-question argument"
    },
    {
        ", a position he later rejected.     Suppose a definition of good is pleasure-causing. In other words, if something is good, it causes pleasure; if it causes pleasure, then it is, by definition, good. Moore asserted, however, that we could always ask, But are pleasure-causing things good? This would always be an open question. There is no foregone conclusion that, indeed, pleasure-causing things are good.   In his initial argument, Moore concluded that any similar definition of goodness could be criticized in the same way.                     ": null
    }
]