[
    {
        "        Etymologiae , also known as the Origines  and usually abbreviated Orig., is an ": null
    },
    {
        "etymological": "medieval etymology"
    },
    {
        " encyclopedia": "encyclopedia"
    },
    {
        " compiled by ": null
    },
    {
        "Isidore of Seville": "isidore of seville"
    },
    {
        " towards the end of his life. Isidore was encouraged to write the book by his friend ": null
    },
    {
        "Braulio, Bishop of Saragossa": "braulio of zaragoza"
    },
    {
        ". The Etymologies summarized and organized a wealth of knowledge from hundreds of classical sources; three of its books are derived largely from ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        "s  Natural History . Isidore acknowledges Pliny, but not his other principal sources, namely Cassiodorus, Servius and Solinus. The work contains whatever Isidore, an influential ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " bishop, thought worth keeping. Its subject matter is extremely diverse, ranging from grammar and rhetoric to the earth and the cosmos, buildings, metals, war, ships, humans, animals, medicine, law, religions and the hierarchies of angels and saints.     Etymologiae covers an encyclopedic range of topics. ": null
    },
    {
        "Etymology": "etymology"
    },
    {
        ", the origins of words, is prominent, but the work covers among other things ": null
    },
    {
        "grammar": "grammar"
    },
    {
        ", ": null
    },
    {
        "rhetoric": "rhetoric"
    },
    {
        ", ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "geometry": "geometry"
    },
    {
        ", ": null
    },
    {
        "music": "music"
    },
    {
        ", ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ", ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ", ": null
    },
    {
        "law": "law"
    },
    {
        ", the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        " and ": null
    },
    {
        "heretical": "heretical"
    },
    {
        " sects, ": null
    },
    {
        "pagan": "pagan"
    },
    {
        " philosopher": "philosopher"
    },
    {
        "s, ": null
    },
    {
        "language": "language"
    },
    {
        "s, ": null
    },
    {
        "cities": "cities"
    },
    {
        ", ": null
    },
    {
        "animal": "animal"
    },
    {
        "s and ": null
    },
    {
        "bird": "bird"
    },
    {
        "s, the ": null
    },
    {
        "physical world": "earth"
    },
    {
        ", ": null
    },
    {
        "geography": "geography"
    },
    {
        ", ": null
    },
    {
        "public buildings": "architecture"
    },
    {
        ", ": null
    },
    {
        "road": "road"
    },
    {
        "s, ": null
    },
    {
        "metals": "metals"
    },
    {
        ", ": null
    },
    {
        "rocks": "rocks"
    },
    {
        ", ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ", ": null
    },
    {
        "ship": "ship"
    },
    {
        "s, ": null
    },
    {
        "clothes": "clothes"
    },
    {
        ", ": null
    },
    {
        "food": "food"
    },
    {
        " and ": null
    },
    {
        "tool": "tool"
    },
    {
        "s.     Etymologiae was the most used textbook throughout the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". It was so popular that it was read in place of many of the original ": null
    },
    {
        "classical texts": "classics"
    },
    {
        " that it summarized, so these ceased to be copied and were lost. It was cited by ": null
    },
    {
        "Dante Alighieri": "dante alighieri"
    },
    {
        ", who placed Isidore in his  Paradiso , quoted by ": null
    },
    {
        "Geoffrey Chaucer": "geoffrey chaucer"
    },
    {
        ", and mentioned by the poets ": null
    },
    {
        "Boccaccio": "giovanni boccaccio"
    },
    {
        ", ": null
    },
    {
        "Petrarch": "petrarch"
    },
    {
        " and ": null
    },
    {
        "John Gower": "john gower"
    },
    {
        ". Among the thousand-odd surviving ": null
    },
    {
        "manuscript": "manuscript"
    },
    {
        " copies is the 42th-century  Codex Gigas ; the earliest surviving manuscript, the Codex Sangallensis, preserves books XI to XX from the 42th century. Etymologiae was printed in at least ten editions between 42 and 42 after which its importance faded in the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ". The first scholarly edition was printed in Madrid in 42; the first modern ": null
    },
    {
        "critical edition": "critical edition"
    },
    {
        " was edited by ": null
    },
    {
        "Wallace Lindsay": "wallace lindsay"
    },
    {
        " in 42     Etymologiae is less well known in modern times, though the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        " considered naming its author Isidore the ": null
    },
    {
        "patron saint": "patron saint"
    },
    {
        " of the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ". Scholars recognize its importance both for its preservation of classical texts and for the insight it offers into the medieval mindset.         ": null
    },
    {
        "Isidore of Seville": "isidore of seville"
    },
    {
        " was born around 42 in Spain, under the unstable rule of the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " after the collapse of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " in the West. His older brother, Leander, the abbot of a ": null
    },
    {
        "Seville": "seville"
    },
    {
        " monastery, supervised Isidores education, probably in the school attached to his monastery. Leander was a powerful priest, a friend of Pope Gregory, and eventually he became bishop of Seville. Leander also made friends with the Visigothic kings sons, Hermenigild and Reccared. In 42 ": null
    },
    {
        "Reccared": "reccared"
    },
    {
        " became king, and in 42 under Leanders religious direction he became a ": null
    },
    {
        "Catholic": "roman catholicism"
    },
    {
        ", controlling the choice of bishops. Reccared died in 42 not long after appointing Isidore as bishop of ": null
    },
    {
        "Seville": "seville"
    },
    {
        ". Isidore helped to unify the kingdom through Christianity and education, eradicating the ": null
    },
    {
        "Arian heresy": "arian heresy"
    },
    {
        " which had been widespread, and led National Councils at Toledo and Seville. Isidore had a close friendship with king ": null
    },
    {
        "Sisebut": "sisebut"
    },
    {
        ", who came to the throne in 42 and with another Seville churchman, ": null
    },
    {
        "Braulio": "braulio of zaragoza"
    },
    {
        ", who later became bishop of ": null
    },
    {
        "Saragossa": "saragossa"
    },
    {
        ". Isidore was widely read, mainly in Latin with a little Greek and Hebrew. He was familiar with the works of both the church fathers and pagan writers such as ": null
    },
    {
        "Martial": "martial"
    },
    {
        ", ": null
    },
    {
        "Tertullian": "tertullian"
    },
    {
        " and ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        ", this last the author of the major encyclopaedia then in existence, the  Natural History . The classical encyclopedists had already introduced alphabetic ordering of topics, and a literary rather than observational approach to knowledge: Isidore followed those traditions. Isidore became well known in his lifetime as a scholar. He started to put together a collection of his knowledge, the Etymologies, in about 42 and continued to write until about 42                Etymologiae presents in abbreviated form much of that part of the learning of ": null
    },
    {
        "antiquity": "classical antiquity"
    },
    {
        " that ": null
    },
    {
        "Christians": "christians"
    },
    {
        " thought worth preserving. ": null
    },
    {
        "Etymologies": "medieval etymology"
    },
    {
        ", often very far-fetched, form the subject of just one of the encyclopedias twenty books , but perceived linguistic similarities permeate the work. An idea of the quality of Isidores etymological knowledge is given by Peter Jones: Now we know most of his derivations are total nonsense  .     Isidores vast encyclopedia of ancient learning includes subjects from ": null
    },
    {
        "theology": "theology"
    },
    {
        " to furniture, and provided a rich source of classical lore and learning for medieval writers. In his works including the Etymologiae, Isidore quotes from around 42 works from over 42 authors. ": null
    },
    {
        "Bishop Braulio": "braulio of zaragoza"
    },
    {
        ", to whom Isidore dedicated it and sent it for correction, divided it into its twenty books.     An analysis by Jacques André of Book XII shows it contains 42 quotations from named authors and 42 borrowed but uncited usages: 42 from ": null
    },
    {
        "Solinus": "solinus"
    },
    {
        "; 42 from ": null
    },
    {
        "Servius": "servius"
    },
    {
        "; 42 from Pliny the Elder. Isidore takes care to name classical and Christian scholars whose material he uses, especially, in descending order of frequency, Aristotle , Jerome , Cato , Plato , Pliny, Donatus, Eusebius, Augustine, Suetonius, and Josephus. He mentions as prolific authors the pagan ": null
    },
    {
        "Varro": "varro"
    },
    {
        " and the Christians ": null
    },
    {
        "Origen": "origen"
    },
    {
        " and ": null
    },
    {
        "Augustine": "augustine"
    },
    {
        ". But his translator Stephen Barney notes as remarkable that he never actually names the compilers of the encyclopedias that he used at second or third hand , ": null
    },
    {
        "Aulus Gellius": "aulus gellius"
    },
    {
        ", ": null
    },
    {
        "Nonius Marcellus": "nonius marcellus"
    },
    {
        ", ": null
    },
    {
        "Lactantius": "lactantius"
    },
    {
        ", ": null
    },
    {
        "Macrobius": "macrobius"
    },
    {
        ", and ": null
    },
    {
        "Martianus Capella": "martianus capella"
    },
    {
        ". Barney further notes as most striking  that Isidore never mentions three out of his four principal sources : Cassiodorus, Servius and Solinus. Conversely, he names ": null
    },
    {
        "Pythagoras": "pythagoras"
    },
    {
        " eight times, even though Pythagoras wrote no books. The Etymologies are thus complacently derivative .     In book II, dealing with dialectic and rhetoric, Isidore is heavily indebted to translations from the Greek by ": null
    },
    {
        "Boethius": "boethius"
    },
    {
        ", and in book III, he is similarly in debt to ": null
    },
    {
        "Cassiodorus": "cassiodorus"
    },
    {
        ", who provided the gist of Isidores treatment of arithmetic. ": null
    },
    {
        "Caelius Aurelianus": "caelius aurelianus"
    },
    {
        " contributes generously to the part of book IV dealing with medicine. Isidores view of Roman law in book V is viewed through the lens of the ": null
    },
    {
        "Visigoth": "visigoth"
    },
    {
        "ic compendiary called the  Breviary of Alaric , which was based on the ": null
    },
    {
        "Code of Theodosius": "code of theodosius"
    },
    {
        ", which Isidore never saw. Through Isidores condensed paraphrase a third-hand memory of Roman law passed to the Early Middle Ages. Lactantius is the author most extensively quoted in book XI, concerning man. Books XII, XIII and XIV are largely based on Pliny the Elders  Natural History  and Solinus, whereas the lost Prata of ": null
    },
    {
        "Suetonius": "suetonius"
    },
    {
        ", which can be partly pieced together from what is quoted in Etymologiae, seems to have inspired the general plan of the work, as well as many of its details.     Isidores Latin, replete with nonstandard ": null
    },
    {
        "Vulgar Latin": "vulgar latin"
    },
    {
        ", stands at the cusp of Latin and the local ": null
    },
    {
        "Romance language": "romance languages"
    },
    {
        " of Hispania. According to the prefatory letters, the work was composed at the urging of his friend ": null
    },
    {
        "Braulio, Bishop of Saragossa": "braulio of zaragoza"
    },
    {
        ", to whom Isidore, at the end of his life, sent his codex inemendatus , which seems to have begun circulating before Braulio was able to revise and issue it with a dedication to the late Visigothic King ": null
    },
    {
        "Sisebut": "sisebut"
    },
    {
        ".         The Etymologies organizes knowledge, mainly drawn from the classics, into twenty books:          In Book I, Isidore begins with a lengthy section on the first of three subjects in the mediaeval ": null
    },
    {
        "Trivium": "trivium"
    },
    {
        ", considered at the time the core of essential knowledge, ": null
    },
    {
        "grammar": "grammar"
    },
    {
        ". He covers the letters of the alphabet, parts of speech, accents, punctuation and other marks, shorthand and abbreviations, writing in cipher and sign language, types of mistake and histories. He derives the word for letters  from the Latin words for to read  and road , as if the term were legitera , arguing that letters offer a road for people who read.     Book II completes the mediaeval Trivium with coverage of ": null
    },
    {
        "rhetoric": "rhetoric"
    },
    {
        " and ": null
    },
    {
        "dialectic": "dialectic"
    },
    {
        ". Isidore describes what rhetoric is, kinds of argument, maxims, elocution, ways of speaking, and figures of speech. On dialectic, he discusses philosophy, syllogisms, and definitions. He equates the Greek term syllogism with the Latin term argumentation , which he derives from the Latin for clear mind .     Book III covers the mediaeval ": null
    },
    {
        "Quadrivium": "quadrivium"
    },
    {
        ", the four subjects that supplemented the Trivium being ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "geometry": "geometry"
    },
    {
        ", ": null
    },
    {
        "music": "music"
    },
    {
        ", and ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ". He argues that there are infinitely many numbers, as you can always add one to whatever number you think is the limit. He attributes geometry to ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        ", arguing that because the ": null
    },
    {
        "River Nile": "river nile"
    },
    {
        " flooded and covered the land with mud, geometry was needed to mark out peoples land with lines and measures . Isidore distinguishes astronomy from ": null
    },
    {
        "astrology": "astrology"
    },
    {
        " and covers the world, the sky and the celestial sphere, the ": null
    },
    {
        "zodiac": "zodiac"
    },
    {
        ", the sun, moon, stars, ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        ", and planets, and the names of the stars. He derives the curved  vault of the heavens from the Latin word for upside-down . He explains eclipses of the sun as the moon coming between the earth and the sun and eclipses of the moon as happening when it runs into the shadow of the earth. He condemns the Roman naming of the planets after their gods: Jupiter, Saturn, Mars, Venus, and Mercury.     Book IV covers ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ", including the four humours, diseases, remedies and medical instruments. He derives the word medicine from the Latin for moderation , and ": null
    },
    {
        "sciatica": "sciatica"
    },
    {
        "  from the affected part of the body, the hip .     Book V covers ": null
    },
    {
        "law": "law"
    },
    {
        " and ": null
    },
    {
        "chronology": "chronology"
    },
    {
        ". Isidore distinguishes natural, civil, international, military and public law among others. He discusses the purpose of law, legal cases, witnesses, offences and penalties. On chronology, Isidore covers periods of time such as days, weeks, and months, solstices and equinoxes, seasons, special years such as Olympiads and Jubilees, generations and ages.     In Book VI, Isidore describes ecclesiastical books and offices starting with the Old and New Testaments, the authors and names of the holy books, libraries and translators, authors, writing materials including tablets, papyrus and parchment, books, scribes, and Christian festivals.     Book VII describes the basic scheme concerning ": null
    },
    {
        "God": "god"
    },
    {
        ", ": null
    },
    {
        "angel": "angel"
    },
    {
        "s and ": null
    },
    {
        "saint": "saint"
    },
    {
        "s, in other words the hierarchies of ": null
    },
    {
        "heaven": "heaven"
    },
    {
        " and ": null
    },
    {
        "earth": "earth"
    },
    {
        ", from patriarchs, prophets and apostles down the scale through people named in the gospels to martyrs, clergymen, monks and ordinary Christians.     Book VIII covers religion in the shape of the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ", the ": null
    },
    {
        "Jew": "jew"
    },
    {
        "s and ": null
    },
    {
        "heretical": "heresy"
    },
    {
        " sect": "sect"
    },
    {
        "s, ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        "s  including poets, ": null
    },
    {
        "sibyl": "sibyl"
    },
    {
        "s and ": null
    },
    {
        "magi": "magi"
    },
    {
        ", and the ": null
    },
    {
        "pagan gods": "roman gods"
    },
    {
        ".     Book IX covers ": null
    },
    {
        "language": "language"
    },
    {
        "s, peoples, ": null
    },
    {
        "kingdoms": "monarchy"
    },
    {
        ", ": null
    },
    {
        "cities": "city"
    },
    {
        " and titles.     Book X is a word-list of nouns and adjectives, together with supposed ": null
    },
    {
        "etymologies": "etymology"
    },
    {
        " for them. For example, the letter D begins with the word for master , as he is the head of a household ; the adjective docile  is derived by Isidore from the verb for to teach , because docile people are able to learn; and the word for abominable  is explained as being not worth the grain called ": null
    },
    {
        "spelt": "spelt"
    },
    {
        " .     Book XI covers human beings, ": null
    },
    {
        "portents": "portent"
    },
    {
        " and transformations. Isidore derives human beings  from the Latin for soil , as in Genesis 42:42 it says that man is made from the soil. Urine  gets its name either from the fact that it can burn  the skin or, Isidore hedges, that it is from the kidneys . Femina, meaning woman, comes from femora/femina meaning thighs, as this part of the body shows she is not a man. The Latin for buttocks is clunis as they are near the large intestine or colon .     Book XII covers ": null
    },
    {
        "animal": "animal"
    },
    {
        "s, including small animals, ": null
    },
    {
        "snake": "snake"
    },
    {
        "s, ": null
    },
    {
        "worm": "worm"
    },
    {
        "s, ": null
    },
    {
        "fish": "fish"
    },
    {
        ", ": null
    },
    {
        "bird": "bird"
    },
    {
        "s and other beasts that fly. Isidores treatment is as usual full of conjectural etymology, so a horse is called equus because when in a team of four horses they are balanced . The spider  is so called from the air  that feeds it. The ": null
    },
    {
        "electric ray": "electric ray"
    },
    {
        "  is called that because it numbs  anyone who touches it.     Book XIII describes the ": null
    },
    {
        "physical world": "physics"
    },
    {
        ", ": null
    },
    {
        "atom": "atom"
    },
    {
        "s, ": null
    },
    {
        "classical element": "classical element"
    },
    {
        "s, the sky, clouds, thunder and lightning, rainbows, winds, and waters including the sea, the Mediterranean, bays, tides, lakes, rivers and floods. The sky is called caelum as it has stars stamped on to it, like a decorated pot . Clouds are called nubes as they veil  the sky, just as brides  wear veils for their weddings. The wind is called ventus in Latin as it is angry and violent . There are many kinds of water: some water is salty, some alkaline, some with alum, some sulfuric, some tarry, and some containing a cure for illnesses.  There are waters that cure eye injuries, or make voices melodious, or cause madness, or cure infertility. The water of the Styx causes immediate death.          Book XIV covers ": null
    },
    {
        "geography": "geography"
    },
    {
        ", describing the Earth, islands, promontories, mountains and caves. The earth is divided into three parts, Asia occupying half the globe, and Europe and Africa each occupying a quarter. Europe is separated from Africa by the Mediterranean, reaching in from the Ocean that flows all around the land. Isidore writes that the orbis of the earth, translated by Barney as globe , derives its name from the roundness of the circle, because it resembles a wheel; hence a small wheel is called a small disk  . Barney notes that orbis refers to the circle of lands around the Mediterranean, and hence to the total known extent of land.  Isidore illustrated the Etymologies with a circular ": null
    },
    {
        "T-O map": "t-o map"
    },
    {
        "  which also gave a vague impression of a ": null
    },
    {
        "flat disc-shaped Earth": "flat earth"
    },
    {
        ", though authors disagree about Isidores beliefs on the matter.     Book XV covers cities and buildings including public buildings, houses, storehouses and workshops, parts of buildings, tents, fields and roads.     Book XVI covers ": null
    },
    {
        "metal": "metal"
    },
    {
        "s and ": null
    },
    {
        "rocks": "rock"
    },
    {
        ", starting with dust and earth, and moving on to gemstones of different colours, glass and mines. Metals include gold, silver, copper, iron, lead and ": null
    },
    {
        "electrum": "electrum"
    },
    {
        ". Weights and measures end the book. Games with boards and dice are described.     Book XVII describes ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        " including grains, legumes, vines, trees, aromatic herbs and vegetables.     Book XVIII covers the terms of ": null
    },
    {
        "war": "war"
    },
    {
        ", ": null
    },
    {
        "game": "game"
    },
    {
        "s and ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        ". Isidore describes standards, trumpets, weapons including swords, spears, arrows, slings, battering rams, and armour including shields, breastplates and helmets. Athletic games include running and jumping, throwing and wrestling. Circus games are described, with chariot racing, horse racing and vaulting. In the theatre, comedy, tragedy, mime and dance are covered. In the amphitheatre, Isidore covers those who fight with nets, nooses and other weapons.     Book XIX covers ": null
    },
    {
        "ship": "ship"
    },
    {
        "s including boats, sails, ropes and nets; forges and tools; building, including walls, decorations, ceilings, mosaics, statues, and building tools; and ": null
    },
    {
        "clothes": "clothes"
    },
    {
        ", including types of dress, cloaks, bedding, tools, rings, belts and shoes. The word net , is derived from retaining  fish, or perhaps, writes Isidore, from the ropes  they are attached to.     Book XX completes Isidores encyclopaedia, describing ": null
    },
    {
        "food": "food"
    },
    {
        " and drink and vessels for these, storage and cooking vessels; ": null
    },
    {
        "furnishings": "furnishings"
    },
    {
        " including beds and chairs; vehicles, farm and garden tools and equipment for horses.                  Isidore was widely influential throughout the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", feeding directly into word lists and encyclopaedias by ": null
    },
    {
        "Papias": "papias"
    },
    {
        ", ": null
    },
    {
        "Huguccio": "huguccio"
    },
    {
        ", ": null
    },
    {
        "Bartholomaeus Anglicus": "bartholomaeus anglicus"
    },
    {
        " and ": null
    },
    {
        "Vincent of Beauvais": "vincent of beauvais"
    },
    {
        ", as well as being used everywhere in the form of small snippets. His influence also pertained to early medieval riddle collections such as the ": null
    },
    {
        "Bern Riddles": "bern riddles"
    },
    {
        " or the Aenigmata of ": null
    },
    {
        "Aldhelm": "aldhelm"
    },
    {
        ". He was cited by ": null
    },
    {
        "Dante Alighieri": "dante alighieri"
    },
    {
        ", quoted by ": null
    },
    {
        "Geoffrey Chaucer": "geoffrey chaucer"
    },
    {
        ", and his name was mentioned by the poets ": null
    },
    {
        "Boccaccio": "giovanni boccaccio"
    },
    {
        ", ": null
    },
    {
        "Petrarch": "petrarch"
    },
    {
        " and ": null
    },
    {
        "John Gower": "john gower"
    },
    {
        " among others. Dante went so far as to place Isidore in Paradise in the final part of his  Divine Comedy ,  Paradiso  .     Through the Middle Ages Etymologiae was the textbook most in use, regarded so highly as a repository of classical learning that, in a great measure, it superseded the use of the individual works of the classics themselves, full texts of which were no longer copied and thus were lost. It was one of the most popular compendia in medieval libraries.         An editors enthusiasm is soon chilled by the discovery that Isidores book is really a mosaic of pieces borrowed from previous writers, sacred and profane, often their ipsa verba without alteration, ": null
    },
    {
        "Wallace Lindsay": "wallace lindsay"
    },
    {
        " noted in 42 having recently edited Isidore for the ": null
    },
    {
        "Clarendon Press": "clarendon press"
    },
    {
        ", with the further observation, however, that a portion of the texts quoted have otherwise been lost: the Prata of ": null
    },
    {
        "Suetonius": "suetonius"
    },
    {
        ", for instance, can only be reconstructed from Isidores excerpts.     In the view of John T. Hamilton, writing in The Classical Tradition in 42 Our knowledge of ancient and early medieval thought owes an enormous amount to this encyclopedia, a reflective catalogue of received wisdom, which the authors of the only complete translation into English introduce as arguably the most influential book, after the Bible, in the learned world of the Latin West for nearly a thousand years  These days, of course, Isidore and his Etymologies are anything but household names... but the Vatican has named Isidore the patron saint of the Internet, which is likely to make his work slightly better known.      Ralph Hexter, also writing in The Classical Tradition, comments on Isidores largest and massively influential work... on which he was still at work at the time of his death... his own architecture for the whole is relatively clear ... At the deepest level Isidores encyclopedia is rooted in the dream that language can capture the universe and that if we but parse it correctly, it can lead us to the proper understanding of Gods creation. His word derivations are not based on principles of historical linguistics but follow their own logic... Isidore is the master of bricolage... His reductions and compilations did indeed transmit ancient learning, but Isidore, who often relied on ": null
    },
    {
        "scholia": "scholia"
    },
    {
        " and earlier compilations, is often simplistic scientifically and philosophically, especially compared to .. figures such as ": null
    },
    {
        "Ambrose": "ambrose"
    },
    {
        " and ": null
    },
    {
        "Augustine": "augustine"
    },
    {
        ".         Peter Jones, writing in the  Daily Telegraph , compares The Etymologies to the Internet:            Almost 42 manuscript copies of Etymologiae have survived. The earliest is held at the ": null
    },
    {
        "St. Gall Abbey library": "st. gall abbey library"
    },
    {
        ", Switzerland, in the Codex Sangallensis: it is a 42th-century copy of books XI to XX.  The 42th-century  Codex Gigas , the largest extant medieval manuscript, now held in the ": null
    },
    {
        "National Library of Sweden": "national library of sweden"
    },
    {
        ", contains a copy of the Etymologiae.      In 42 at ": null
    },
    {
        "Augsburg": "augsburg"
    },
    {
        ", Etymologiae became one of the first books to be printed, quickly followed by ten more editions by 42 Juan de Grial produced the first scholarly edition in Madrid in 42 ": null
    },
    {
        "Faustino Arevalo": "faustino arevalo"
    },
    {
        " included it as two of the 42 volumes of his Opera omnia in Rome . Rudolph Beer produced a facsimile edition of the Toledo manuscript of the Etymologies in 42 Wallace Lindsay edited the first modern critical edition in 42 Jacques Fontaine and Manuel C. Diaz y Diaz have between 42 and 42 supervised the production of the first five volumes of the Etymologies in the Belle Lettres series Auteurs Latins du Moyen Age , with extensive footnotes.       ": null
    }
]