[
    {
        "     Eucalypt is a descriptive name for woody plants with capsule fruiting bodies belonging to seven closely related genera  found across Australasia:    Eucalyptus ,  Corymbia ,  Angophora ,  Stockwellia ,  Allosyncarpia ,  Eucalyptopsis  and  Arillastrum .       For an example of changing historical perspectives, in 42 largely genetic evidence indicated that some prominent Eucalyptus species were actually more closely related to Angophora than to other eucalypts; they were accordingly split off into the new genus Corymbia.     Although separate, all of these genera and their species are allied and it remains the standard to refer to the members of all seven genera Angophora, Corymbia, Eucalyptus, Stockwellia, Allosyncarpia, Eucalyptopsis and Arillastrum as eucalypts or as the eucalypt group.     The extant genera Stockwellia, Allosyncarpia, Eucalyptopsis and Arillastrum comprise six known species, restricted to monsoon forests and rainforests in north-eastern Australia, ": null
    },
    {
        "Arnhem Land": "arnhem land"
    },
    {
        " plateau, ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        ", the ": null
    },
    {
        "Moluccas": "moluccas"
    },
    {
        " and ": null
    },
    {
        "New Caledonia": "new caledonia"
    },
    {
        ". These genera are recognised as having evolved from ancient lineages of the family Myrtaceae. According to genetic, fossil and morphological evidence, it is hypothesised that they evolved into separate taxa before the evolution of the more widespread and well-known genera Eucalyptus, Corymbia and Angophora, and all of their many species.      Eucalyptus deglupta  has naturally spread the furthest from the Australian geographic origin of the genus Eucalyptus, being the only species known growing naturally in the nearby northern hemisphere, from New Guinea to ": null
    },
    {
        "New Britain": "new britain"
    },
    {
        ", ": null
    },
    {
        "Sulawesi": "sulawesi"
    },
    {
        ", ": null
    },
    {
        "Seram Island": "seram island"
    },
    {
        " to ": null
    },
    {
        "Mindanao": "mindanao"
    },
    {
        ", ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ".  Eucalyptus urophylla  also grows naturally as far west as the ": null
    },
    {
        "Flores": "flores"
    },
    {
        " and ": null
    },
    {
        "Timor": "timor"
    },
    {
        " islands.            Eucalypts from fire prone habitats are attuned to withstand fire in several ways:     Their seeds are often held in an insulated capsule, which opens only in response to and after the devastation of a ": null
    },
    {
        "bushfire": "bushfires in australia"
    },
    {
        ". Once cooled down, the land becomes a freshly fertilised seed bed.   Oils in the leaves tend to make the fire more severe and therefore more damaging to less attuned species, giving an evolutionary advantage to the eucalypts.   ": null
    },
    {
        "Epicormic buds": "epicormic shoot"
    },
    {
        " under the often thick ": null
    },
    {
        "bark": "bark"
    },
    {
        " of the ": null
    },
    {
        "trunk": "trunk"
    },
    {
        " and ": null
    },
    {
        "branch": "branch"
    },
    {
        "es are ready to sprout new ": null
    },
    {
        "stem": "plant stem"
    },
    {
        "s and ": null
    },
    {
        "leaves": "leaf"
    }
]