[
    {
        "Eugen Semitjov was a ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " journalist, author and artist of ": null
    },
    {
        "Russian": "russians"
    },
    {
        " descent who was born in Sweden.         He started drawing in 42 during his Swedish military service. He was an expert in ": null
    },
    {
        "spacecraft": "spacecraft"
    },
    {
        ", especially ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " ones and worked as a translator from Russian during Juriy ": null
    },
    {
        "Gagarin": "yuri gagarin"
    },
    {
        " visit to Sweden.   He also often worked as an ": null
    },
    {
        "illustrator": "illustrator"
    },
    {
        " for ": null
    },
    {
        "Aftonbladet": "aftonbladet"
    },
    {
        ", especially when the subject was related to space technology, he covered the Apollo space program as a journalist in Florida. As a Russian speaker, he got rare interviews with people involved in the Soviet space program. His non-fiction books covered actress Greta Garbo, science, speculative science such as possible future space colonies, starships using illustrations by known Space artists such as Fred Gambino and ": null
    },
    {
        "David A. Hardy": "david a. hardy"
    },
    {
        ". One interesting detail is that Eugen -at a time when the belief that aliens visited Earth was common - published one book on the subject which he deliberately gave a title and cover art to attract the true believers. Where the bulk of the book was debunking a number of the most known UFO cases. He was the author of the ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " comic  Allan Kämpe , which was first published in December 42 The stories might at first seem to be a simple copy of  Flash Gordon , the comic has more in common with ": null
    },
    {
        "Sidney Jordan": "sidney jordan"
    },
    {
        "s, ": null
    },
    {
        "Jeff Hawke": "jeff hawke"
    },
    {
        ". He also wrote a small number of youth novels. For his journalistic work Eugen Semitjov won Stora Journalistpriset The grand price for Journalism in Sweden in 42                                                    ": null
    }
]