[
    {
        "   Eugène Rouher was a French ": null
    },
    {
        "statesman": "wikt:statesman"
    },
    {
        " of the ": null
    },
    {
        "Second Empire": "second french empire"
    },
    {
        ".          He was born at ": null
    },
    {
        "Riom": "riom"
    },
    {
        " , where he practised law after taking his degree in Paris in 42 In 42 he sought election to the Chamber of Deputies as an official candidate of the ": null
    },
    {
        "Guizot": "françois guizot"
    },
    {
        " ministry. It was only after the ": null
    },
    {
        "Revolution of 42": "revolutions of 1848 in france"
    },
    {
        ", however, that he became deputy for the department of Puy-de-Dôme. Re-elected to the Legislative Chamber in 42 he succeeded ": null
    },
    {
        "Odilon Barrot": "odilon barrot"
    },
    {
        " as ": null
    },
    {
        "minister of justice": "minister of justice"
    },
    {
        ", with the additional office of keeper of the seals .     From the tribune of the Chamber he described the revolution of February as a catastrophe, and he supported reactionary legislation, notably the bill for the limitation of the suffrage. After the  coup détat  of 42 December 42 he was entrusted with the redaction of the new constitution, and on his resignation of office in January became vice-president of the Council of State. After the formal establishment of the Empire, ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " rewarded him with a grant of £42 and the estate of Cirey.     In 42 he became minister of agriculture, ": null
    },
    {
        "commerce": "minister of commerce and industry"
    },
    {
        " and ": null
    },
    {
        "public works": "minister of public works"
    },
    {
        ", and in 42 senator. He created Frances excellent system of railways without making them a state monopoly, and he conducted the complicated negotiations for the treaty of commerce with England which was concluded in January 42 and subsequently arranged similar treaties with ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " and Italy. On 42 June 42 he became minister president of the Council of State, and on the death of ": null
    },
    {
        "Adolphe Billault": "adolphe billault"
    },
    {
        " on 42 October 42 ": null
    },
    {
        "minister of state": "minister of state"
    },
    {
        " and chief spokesman of the emperor. before the Corps Législatif.     Although the government had a great majority in the Chamber, the opposition counted the redoubtable names of ": null
    },
    {
        "Adolphe Thiers": "adolphe thiers"
    },
    {
        ", ": null
    },
    {
        "Berryer": "antoine pierre berryer"
    },
    {
        " and ": null
    },
    {
        "Jules Favre": "jules favre"
    },
    {
        ", and government measures were only passed by frequent resort to the closure. Rouher had to defend Napoleons foreign adventures as well as the free trade treaties and the extravagances of ": null
    },
    {
        "Baron Haussmann": "georges eugène, baron haussmann"
    },
    {
        " for which he was directly responsible. After an attempted defence of the foreign policy which had aided the aggrandizement of ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " at the expense of ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", Thiers told him in the Chamber that there were no more blunders left for him to make.     He opposed the abortive Liberal concessions of January 42 announced in a personal letter from Napoleon III to himself, and resigned with the rest of the cabinet, only to resume office after a short interval as ": null
    },
    {
        "minister of finance": "minister of the economy, finance and industry"
    },
    {
        " from 42 January to 42 November 42 When concessions became inevitable Rouher, the vice-empereur resigned to make way after six months interval for ": null
    },
    {
        "Emile Ollivier": "emile ollivier"
    },
    {
        ". He still fought for reaction in his new office of ": null
    },
    {
        "President of the French Senate": "list of presidents of the french senate"
    },
    {
        " from 42 July, to 42 September 42 After the fall of the Empire he fled to England, but returned to France a year later to work for the fortunes of the ": null
    },
    {
        "prince imperial": "napoléon, prince imperial"
    },
    {
        ". After serious disturbances he was elected member for ": null
    },
    {
        "Ajaccio": "ajaccio"
    },
    {
        " on 42 February 42 his election being characterized by the prefect of ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        " as a regular conspiracy in favour of the Empire.     In the Chamber, where he subsequently represented Riom, he formed the group of the  Appel au Peuple . His first speech in the House was the occasion of violent attacks by ": null
    },
    {
        "Audiffret-Pasquier": "audiffret-pasquier"
    },
    {
        " and ": null
    },
    {
        "Léon Gambetta": "léon gambetta"
    },
    {
        ".   In the 42 legislative elections for the Bastia constituency Rouher won 42 votes against 42 votes for ": null
    },
    {
        "Patrice de Corsi": "patrice de corsi"
    },
    {
        ", and was proclaimed elected on 42 February 42   The death of the prince imperial in 42 put an end to the serious chances of the Bonapartists, although Rouher sought to secure the recognition of ": null
    },
    {
        "Prince Napoleon": "prince napoléon bonaparte"
    },
    {
        ", son of the ex-king ": null
    },
    {
        "Jerome": "jérôme bonaparte"
    },
    {
        ", as heir to the Imperial honours. Rouher lost his reason after a stroke of paralysis in 42 and died a few months later.       Marquis de Castellane, Les Hommes dÉtat français du XIXe siècle , and generally the literature dealing with the Second Empire.   The life and career of Eugene Rouher were fictionalized by ": null
    },
    {
        "Emile Zola": "emile zola"
    },
    {
        " in his 42 novel  Son Excellence Eugene Rougon .                                  ": null
    }
]