[
    {
        "        The Euphrates  is the longest and one of the most historically important rivers of ": null
    },
    {
        "Western Asia": "western asia"
    },
    {
        ". Together with the ": null
    },
    {
        "Tigris": "tigris"
    },
    {
        ", it is one of the two defining rivers of ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " . Originating in the ": null
    },
    {
        "Armenian Highlands": "armenian highlands"
    },
    {
        " , the Euphrates flows through ": null
    },
    {
        "Syria": "syria"
    },
    {
        " and ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        " to join the Tigris in the ": null
    },
    {
        "Shatt al-Arab": "shatt al-arab"
    },
    {
        ", which empties into the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ".       The ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " form Euphrátēs  was adapted from ": null
    },
    {
        "Old Persian": "old persian"
    },
    {
        " 𐎢𐎳𐎼𐎠𐎬𐎢 Ufrātu,  itself from ": null
    },
    {
        "Elamite": "elamite language"
    },
    {
        " 𒌑𒅁𒊏𒌅𒅖 ú-ip-ra-tu-iš. The Elamite name is ultimately derived from a name spelt in ": null
    },
    {
        "cuneiform": "cuneiform"
    },
    {
        " as 𒌓𒄒𒉣 , which read as ": null
    },
    {
        "Sumerian language": "sumerian language"
    },
    {
        " is Buranuna and read as ": null
    },
    {
        "Akkadian language": "akkadian language"
    },
    {
        " is Purattu ; many cuneiform signs have a Sumerian pronunciation and an Akkadian pronunciation, taken from a Sumerian word and an Akkadian word that mean the same. In ": null
    },
    {
        "Akkadian": "akkadian language"
    },
    {
        " the river was called Purattu,  which has been perpetuated in ": null
    },
    {
        "Semitic languages": "semitic languages"
    },
    {
        "  and in other nearby languages of the time . The Elamite, Akkadian, and possibly Sumerian forms are suggested to be from an unrecorded ": null
    },
    {
        "substrate language": "substrate language"
    },
    {
        ".  ": null
    },
    {
        "Tamaz V. Gamkrelidze": "tamaz v. gamkrelidze"
    },
    {
        " and ": null
    },
    {
        "Vyacheslav Ivanov": "vyacheslav ivanov"
    },
    {
        " suggest the Proto-Sumerian burudu copper  as an origin, with an explanation that Euphrates was the river by which the copper ore was transported in rafts, since Mesopotamia was the center of copper metallurgy during the period.      The earliest references to the Euphrates come from ": null
    },
    {
        "cuneiform": "cuneiform script"
    },
    {
        " texts found in ": null
    },
    {
        "Shuruppak": "shuruppak"
    },
    {
        " and pre-": null
    },
    {
        "Sargonic": "sargon of akkad"
    },
    {
        " Nippur": "nippur"
    },
    {
        " in southern ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        " and date to the mid-3rd millennium BCE. In these texts, written in ": null
    },
    {
        "Sumerian": "sumerian language"
    },
    {
        ", the Euphrates is called Buranuna . The name could also be written KIB.NUN. or d KIB.NUN, with the prefix ": null
    },
    {
        "d": "dingir"
    },
    {
        " indicating that the river was a ": null
    },
    {
        "divinity": "divinity"
    },
    {
        ". In Sumerian, the name of the city of ": null
    },
    {
        "Sippar": "sippar"
    },
    {
        " in modern-day Iraq was also written UD.KIB.NUN, indicating a historically strong relationship between the city and the river.       The Euphrates is the longest river of ": null
    },
    {
        "Western Asia": "western asia"
    },
    {
        ".  It emerges from the confluence of the ": null
    },
    {
        "Kara Su": "karasu"
    },
    {
        " or Western Euphrates  and the ": null
    },
    {
        "Murat Su": "murat river"
    },
    {
        " or Eastern Euphrates   upstream from the town of ": null
    },
    {
        "Keban": "keban , elazığ"
    },
    {
        " in southeastern Turkey.  Daoudy and Frenken put the length of the Euphrates from the source of the Murat River to the confluence with the ": null
    },
    {
        "Tigris": "tigris"
    },
    {
        " at , of which  is in ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ",  in ": null
    },
    {
        "Syria": "syria"
    },
    {
        " and  in Iraq.   The same figures are given by Isaev and Mikhailova.  The length of the ": null
    },
    {
        "Shatt al-Arab": "shatt al-arab"
    },
    {
        ", which connects the Euphrates and the Tigris with the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ", is given by various sources as .      Both the Kara Su and the Murat Su rise northwest from ": null
    },
    {
        "Lake Van": "lake van"
    },
    {
        " at elevations of  and  ": null
    },
    {
        "amsl": "above mean sea level"
    },
    {
        ", respectively.  At the location of the ": null
    },
    {
        "Keban Dam": "keban dam"
    },
    {
        ", the two rivers, now combined into the Euphrates, have dropped to an elevation of  amsl. From Keban to the Syrian–Turkish border, the river drops another  over a distance of less than . Once the Euphrates enters the ": null
    },
    {
        "Upper Mesopotamian": "al jazira, mesopotamia"
    },
    {
        " plains, its ": null
    },
    {
        "grade": "grade"
    },
    {
        " drops significantly; within Syria the river falls  while over the last stretch between ": null
    },
    {
        "Hīt": "hīt"
    },
    {
        " and the Shatt al-Arab the river drops only .        The Euphrates receives most of its water in the form of rainfall and melting snow, resulting in peak volumes during the months April through May. ": null
    },
    {
        "Discharge": "discharge"
    },
    {
        " in these two months accounts for 36 percent of the total annual discharge of the Euphrates, or even 60–70 percent according to one source, while low runoff occurs in summer and autumn.  The average natural annual flow of the Euphrates has been determined from early- and mid-twentieth century records as  at Keban,  at ": null
    },
    {
        "Hīt": "hīt"
    },
    {
        " and  at ": null
    },
    {
        "Hindiya": "hindiya"
    },
    {
        ".  However, these averages mask the high inter-annual variability in discharge; at ": null
    },
    {
        "Birecik": "birecik"
    },
    {
        ", just north of the Syro–Turkish border, annual discharges have been measured that ranged from a low volume of  in 1961 to a high of  in 1963.      The discharge regime of the Euphrates has changed dramatically since the construction of the first dams in the 1970s. Data on Euphrates discharge collected after 1990 show the impact of the construction of the numerous dams in the Euphrates and of the increased withdrawal of water for irrigation. Average discharge at Hīt after 1990 has dropped to  per second . The seasonal variability has equally changed. The pre-1990 peak volume recorded at Hīt was  per second, while after 1990 it is only  per second. The minimum volume at Hīt remained relatively unchanged, rising from  per second before 1990 to  per second afterward.            In Syria, three rivers add their water to the Euphrates; the ": null
    },
    {
        "Sajur": "sajur river"
    },
    {
        ", the ": null
    },
    {
        "Balikh": "balikh river"
    },
    {
        " and the ": null
    },
    {
        "Khabur": "khabur"
    },
    {
        ". These rivers rise in the foothills of the ": null
    },
    {
        "Taurus Mountains": "taurus mountains"
    },
    {
        " along the Syro–Turkish border and add comparatively little water to the Euphrates. The Sajur is the smallest of these tributaries; emerging from two streams near ": null
    },
    {
        "Gaziantep": "gaziantep"
    },
    {
        " and draining the plain around ": null
    },
    {
        "Manbij": "manbij"
    },
    {
        " before emptying into the ": null
    },
    {
        "reservoir": "reservoir"
    },
    {
        " of the ": null
    },
    {
        "Tishrin Dam": "tishrin dam"
    },
    {
        ". The Balikh receives most of its water from a ": null
    },
    {
        "karstic": "karst topography"
    },
    {
        " spring near Ayn al-Arus and flows due south until it reaches the Euphrates at the city of ": null
    },
    {
        "Raqqa": "raqqa"
    },
    {
        ". In terms of length, drainage basin and discharge, the Khabur is the largest of these three. Its main karstic springs are located around ": null
    },
    {
        "Ras al-Ayn": "ras al-ayn, al-hasakah"
    },
    {
        ", from where the Khabur flows southeast past ": null
    },
    {
        "Al-Hasakah": "al-hasakah"
    },
    {
        ", where the river turns south and drains into the Euphrates near ": null
    },
    {
        "Busayrah": "busayrah"
    },
    {
        ". Once the Euphrates enters Iraq, there are no more natural tributaries to the Euphrates, although canals connecting the Euphrates basin with the Tigris basin exist.                    The ": null
    },
    {
        "drainage basins": "drainage basin"
    },
    {
        "of the Kara Su and the Murat River cover an area of  and , respectively. Estimates of the area of the Euphrates drainage basin vary widely; from a low  to a high . Recent estimates put the basin area at ,   and .  The greater part of the Euphrates basin is located in Turkey, Syria, and Iraq. According to both Daoudy and Frenken, Turkeys share is 28 percent, Syrias is 17 percent and that of Iraq is 40 percent. Isaev and Mikhailova estimate the percentages of the drainage basin lying within Turkey, Syria and Iraq at 33, 20 and 47 percent respectively. Some sources estimate that approximately 15 percent of the drainage basin is located within ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        ", while a small part falls inside the borders of ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        ". Finally, some sources also include ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " in the drainage basin of the Euphrates; a small part of the eastern desert  drains toward the east rather than to the west.              The Euphrates flows through a number of distinct ": null
    },
    {
        "vegetation": "vegetation"
    },
    {
        " zones. Although millennia-long human occupation in most parts of the Euphrates basin has significantly degraded the landscape, patches of original vegetation remain. The steady drop in annual rainfall from the sources of the Euphrates toward the Persian Gulf is a strong determinant for the vegetation that can be supported. In its upper reaches the Euphrates flows through the mountains of Southeast Turkey and their southern foothills which support a ": null
    },
    {
        "xeric": "xeric"
    },
    {
        " woodland": "woodland"
    },
    {
        ". Plant species in the moister parts of this zone include various ": null
    },
    {
        "oak": "oak"
    },
    {
        "s, ": null
    },
    {
        "pistachio trees": "pistacia"
    },
    {
        ", and  Rosaceae  . The drier parts of the xeric woodland zone supports less dense oak forest and Rosaceae. Here can also be found the wild variants of many cereals, including ": null
    },
    {
        "einkorn wheat": "einkorn wheat"
    },
    {
        ", ": null
    },
    {
        "emmer wheat": "emmer wheat"
    },
    {
        ", ": null
    },
    {
        "oat": "oat"
    },
    {
        " and ": null
    },
    {
        "rye": "rye"
    },
    {
        ".  South of this zone lies a zone of mixed woodland-": null
    },
    {
        "steppe": "steppe"
    },
    {
        " vegetation. Between Raqqa and the Syro–Iraqi border the Euphrates flows through a steppe landscape. This steppe is characterised by ": null
    },
    {
        "white wormwood": "artemisia herba-alba"
    },
    {
        "  and  Chenopodiaceae . Throughout history, this zone has been heavily overgrazed due to the practicing of ": null
    },
    {
        "sheep": "sheep"
    },
    {
        " and ": null
    },
    {
        "goat": "goat"
    },
    {
        " pastoralism": "pastoralism"
    },
    {
        " by its inhabitants.  Southeast of the border between Syria and Iraq starts true ": null
    },
    {
        "desert": "desert"
    },
    {
        ". This zone supports either no vegetation at all or small pockets of Chenopodiaceae or  Poa sinaica . Although today nothing of it survives due to human interference, research suggests that the Euphrates Valley would have supported a ": null
    },
    {
        "riverine forest": "riparian zone"
    },
    {
        ". Species characteristic of this type of forest include the ": null
    },
    {
        "Oriental plane": "platanus orientalis"
    },
    {
        ", the ": null
    },
    {
        "Euphrates poplar": "populus"
    },
    {
        ", the ": null
    },
    {
        "tamarisk": "tamarix"
    },
    {
        ", the ": null
    },
    {
        "ash": "fraxinus"
    },
    {
        " and various wetland plants.      Among the fish species in the Tigris–Euphrates basin, the family of the ": null
    },
    {
        "Cyprinidae": "cyprinidae"
    },
    {
        " are the most common, with 34 species out of 52 in total.  Among the Cyprinids, the ": null
    },
    {
        "mangar": "mangar"
    },
    {
        " has good ": null
    },
    {
        "sport fishing": "recreational fishing"
    },
    {
        " qualities, leading the British to nickname it Tigris salmon. The  Rafetus euphraticus  is an endangered ": null
    },
    {
        "soft-shelled turtle": "trionychidae"
    },
    {
        " that is limited to the Tigris–Euphrates river system.       The ": null
    },
    {
        "Neo-Assyrian": "neo-assyrian empire"
    },
    {
        " palace reliefs from the 1st millennium BCE depict ": null
    },
    {
        "lion": "lion"
    },
    {
        " and bull hunts in fertile landscapes.  Sixteenth to nineteenth century European travellers in the Syrian Euphrates basin reported on an abundance of animals living in the area, many of which have become rare or even extinct. Species like ": null
    },
    {
        "gazelle": "gazelle"
    },
    {
        ", ": null
    },
    {
        "onager": "onager"
    },
    {
        " and the now-extinct ": null
    },
    {
        "Arabian ostrich": "arabian ostrich"
    },
    {
        " lived in the steppe bordering the Euphrates valley, while the valley itself was home to the ": null
    },
    {
        "wild boar": "wild boar"
    },
    {
        ". Carnivorous species include the ": null
    },
    {
        "gray wolf": "gray wolf"
    },
    {
        ", the ": null
    },
    {
        "golden jackal": "golden jackal"
    },
    {
        ", the ": null
    },
    {
        "red fox": "red fox"
    },
    {
        ", the ": null
    },
    {
        "leopard": "leopard"
    },
    {
        " and the lion. The ": null
    },
    {
        "Syrian brown bear": "syrian brown bear"
    },
    {
        " can be found in the mountains of Southeast Turkey. The presence of ": null
    },
    {
        "European beaver": "european beaver"
    },
    {
        " has been attested in the bone assemblage of the prehistoric site of ": null
    },
    {
        "Abu Hureyra": "abu hureyra"
    },
    {
        " in Syria, but the beaver has never been sighted in historical times.                The ": null
    },
    {
        "Hindiya Barrage": "hindiya barrage"
    },
    {
        " on the Iraqi Euphrates, based on plans by British civil engineer ": null
    },
    {
        "William Willcocks": "william willcocks"
    },
    {
        " and finished in 1913, was the first modern water diversion structure built in the Tigris–Euphrates river system.  The Hindiya Barrage was followed in the 1950s by the ": null
    },
    {
        "Ramadi Barrage": "ramadi barrage"
    },
    {
        " and the nearby Abu Dibbis Regulator, which serve to regulate the flow regime of the Euphrates and to discharge excess flood water into the ": null
    },
    {
        "depression": "depression"
    },
    {
        " that is now ": null
    },
    {
        "Lake Habbaniyah": "lake habbaniyah"
    },
    {
        ". Iraqs largest dam on the Euphrates is the ": null
    },
    {
        "Haditha Dam": "haditha dam"
    },
    {
        "; a  ": null
    },
    {
        "earth-fill dam": "embankment dam"
    },
    {
        " creating ": null
    },
    {
        "Lake Qadisiyah": "lake qadisiyah"
    },
    {
        ".  Syria and Turkey built their first dams in the Euphrates in the 1970s. The ": null
    },
    {
        "Tabqa Dam": "tabqa dam"
    },
    {
        " in Syria was completed in 1973 while Turkey finished the Keban Dam, a prelude to the immense ": null
    },
    {
        "Southeastern Anatolia Project": "southeastern anatolia project"
    },
    {
        ", in 1974. Since then, Syria has built two more dams in the Euphrates, the ": null
    },
    {
        "Baath Dam": "baath dam"
    },
    {
        " and the Tishrin Dam, and plans to build a fourth dam – the ": null
    },
    {
        "Halabiye Dam": "halabiye dam"
    },
    {
        " – between Raqqa and ": null
    },
    {
        "Deir ez-Zor": "deir ez-zor"
    },
    {
        ".  The Tabqa Dam is Syrias largest dam and its reservoir  is an important source of irrigation and drinking water. It was planned that  should be irrigated from Lake Assad, but in 2000 only  had been realized.   Syria also built three smaller dams on the Khabur and its tributaries.      With the implementation of the Southeastern Anatolia Project  in the 1970s, Turkey launched an ambitious plan to harness the waters of the Tigris and the Euphrates for irrigation and hydroelectricity production and provide an economic stimulus to its southeastern provinces.  GAP affects a total area of  and approximately 7 million people; representing about 10 percent of Turkeys total surface area and population, respectively. When completed, GAP will consist of 22 dams – including the Keban Dam – and 19 power plants and provide irrigation water to  of agricultural land, which is about 20 percent of the irrigable land in Turkey.  C.  of this irrigated land is located in the Euphrates basin.  By far the largest dam in GAP is the ": null
    },
    {
        "Atatürk Dam": "atatürk dam"
    },
    {
        ", located c.  northwest of ": null
    },
    {
        "Şanlıurfa": "şanlıurfa"
    },
    {
        ". This  and  dam was completed in 1992; thereby creating a reservoir that is the third-largest lake in Turkey. With a maximum capacity of , the Atatürk Dam reservoir is large enough to hold the entire annual discharge of the Euphrates.  Completion of GAP was scheduled for 2010 but has been delayed because the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        " has withheld funding due to the lack of an official agreement on water sharing between Turkey and the downstream states on the Euphrates and the Tigris.      Apart from barrages and dams, Iraq has also created an intricate network of canals connecting the Euphrates with Lake Habbaniyah, ": null
    },
    {
        "Lake Tharthar": "lake tharthar"
    },
    {
        ", and Abu Dibbis reservoir; all of which can be used to store excess floodwater. Via the ": null
    },
    {
        "Shatt al-Hayy": "shatt al-hayy"
    },
    {
        ", the Euphrates is connected with the Tigris. The largest canal in this network is the Main Outfall Drain or so-called Third River; constructed between 1953 and 1992. This  canal is intended to drain the area between the Euphrates and the Tigris south of ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        " to prevent ": null
    },
    {
        "soil salinization": "soil salinitysalinity due to irrigation"
    },
    {
        " from irrigation. It also allows large freight barges to navigate up to Baghdad.                   The construction of the dams and irrigation schemes on the Euphrates has had a significant impact on the environment and society of each riparian country. The dams constructed as part of GAP – in both the Euphrates and the Tigris basins – have affected 382 villages and almost 200,000 people have been resettled elsewhere. The largest number of people was displaced by the building of the Atatürk Dam, which alone affected 55,300 people.  A survey among those who were displaced showed that the majority were unhappy with their new situation and that the compensation they had received was considered insufficient.  The flooding of Lake Assad led to the forced displacement of c. 4,000 families, who were resettled in other parts of northern Syria as part of a now abandoned plan to create an ": null
    },
    {
        "Arab belt": "kurds in syriaarab cordon"
    },
    {
        " along the borders with Turkey and Iraq.        Apart from the changes in the discharge regime of the river, the numerous dams and irrigation projects have also had other effects on the environment. The creation of reservoirs with large surfaces in countries with high average temperatures has led to increased ": null
    },
    {
        "evaporation": "evaporation"
    },
    {
        "; thereby reducing the total amount of water that is available for human use. Annual evaporation from reservoirs has been estimated at  in Turkey,  in Syria and  in Iraq.  Water quality in the Iraqi Euphrates is low because irrigation water tapped in Turkey and Syria flows back into the river, together with dissolved fertilizer chemicals used on the fields.  The salinity of Euphrates water in Iraq has increased as a result of upstream dam construction, leading to lower suitability as drinking water.  The many dams and irrigation schemes, and the associated large-scale water abstraction, have also had a detrimental effect on the ecologically already fragile ": null
    },
    {
        "Mesopotamian Marshes": "mesopotamian marshes"
    },
    {
        " and on freshwater fish ": null
    },
    {
        "habitats": "habitat"
    },
    {
        "in Iraq.       The inundation of large parts of the Euphrates valley, especially in Turkey and Syria, has led to the flooding of many ": null
    },
    {
        "archaeological sites": "archaeological site"
    },
    {
        "and other places of cultural significance.  Although concerted efforts have been made to record or save as much of the endangered ": null
    },
    {
        "cultural heritage": "cultural heritage"
    },
    {
        " as possible, many sites are probably lost forever. The combined GAP projects on the Turkish Euphrates have led to major international efforts to document the archaeological and cultural heritage of the endangered parts of the valley. Especially the flooding of ": null
    },
    {
        "Zeugma": "zeugma, commagene"
    },
    {
        " with its unique ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        "mosaics": "mosaic"
    },
    {
        "by the reservoir of the ": null
    },
    {
        "Birecik Dam": "birecik dam"
    },
    {
        " has generated much controversy in both the Turkish and international press.   The construction of the Tabqa Dam in Syria led to a large international campaign coordinated by ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " to document the heritage that would disappear under the waters of Lake Assad. Archaeologists from numerous countries excavated sites ranging in date from the ": null
    },
    {
        "Natufian": "natufian culture"
    },
    {
        " to the ": null
    },
    {
        "Abbasid": "abbasid caliphate"
    },
    {
        " period, and two minarets were dismantled and rebuilt outside the flood zone. Important sites that have been flooded or affected by the rising waters of Lake Assad include ": null
    },
    {
        "Mureybet": "mureybet"
    },
    {
        ", ": null
    },
    {
        "Emar": "emar"
    },
    {
        " and Abu Hureyra.  A similar international effort was made when the Tishrin Dam was constructed, which led, among others, to the flooding of the important ": null
    },
    {
        "Pre-Pottery Neolithic B": "pre-pottery neolithic b"
    },
    {
        " site of Jerf el-Ahmar.  An ": null
    },
    {
        "archaeological survey": "archaeological field survey"
    },
    {
        " and ": null
    },
    {
        "rescue excavations": "rescue archaeology"
    },
    {
        " were also carried out in the area flooded by Lake Qadisiya in Iraq.  Parts of the flooded area have recently become accessible again due to the drying up of the lake, resulting not only in new possibilities for archaeologists to do more research, but also providing opportunities for ": null
    },
    {
        "looting": "archaeological looting in iraq"
    },
    {
        ", which has been rampant elsewhere in Iraq in the wake of the ": null
    },
    {
        "2003 invasion": "2003 invasion of iraq"
    },
    {
        ".                  The early occupation of the Euphrates basin was limited to its upper reaches; that is, the area that is popularly known as the ": null
    },
    {
        "Fertile Crescent": "fertile crescent"
    },
    {
        ". ": null
    },
    {
        "Acheulean": "acheulean"
    },
    {
        " stone ": null
    },
    {
        "artifacts": "artifact"
    },
    {
        " have been found in the Sajur basin and in the ": null
    },
    {
        "El Kowm oasis": "el kowm"
    },
    {
        " in the central ": null
    },
    {
        "Syrian steppe": "syrian steppe"
    },
    {
        "; the latter together with remains of  Homo erectus  that were dated to 450,000 years old.   In the Taurus Mountains and the upper part of the Syrian Euphrates valley, early permanent villages such as Abu Hureyra – at first occupied by ": null
    },
    {
        "hunter-gatherers": "hunter-gatherer"
    },
    {
        "but later by some of the earliest ": null
    },
    {
        "farmer": "farmer"
    },
    {
        "s, Jerf el-Ahmar, Mureybet and ": null
    },
    {
        "Nevalı Çori": "nevalı çori"
    },
    {
        " became established from the eleventh millennium BCE onward.  In the absence of irrigation, these early farming communities were limited to areas where rainfed agriculture was possible, that is, the upper parts of the Syrian Euphrates as well as Turkey.  Late Neolithic villages, characterized by the introduction of ": null
    },
    {
        "pottery": "pottery"
    },
    {
        " in the early 7th millennium BCE, are known throughout this area.  Occupation of lower Mesopotamia started in the 6th millennium and is generally associated with the introduction of irrigation, as rainfall in this area is insufficient for dry agriculture. Evidence for irrigation has been found at several sites dating to this period, including ": null
    },
    {
        "Tell es-Sawwan": "tell es sawwan"
    },
    {
        ".  During the 5th millennium BCE, or late ": null
    },
    {
        "Ubaid period": "ubaid period"
    },
    {
        ", northeastern Syria was dotted by small villages, although some of them grew to a size of over .  In Iraq, sites like ": null
    },
    {
        "Eridu": "eridu"
    },
    {
        " and ": null
    },
    {
        "Ur": "ur"
    },
    {
        " were already occupied during the Ubaid period.  Clay boat models found at ": null
    },
    {
        "Tell Mashnaqa": "tell mashnaqa"
    },
    {
        " along the ": null
    },
    {
        "Khabur": "khabur"
    },
    {
        " indicate that riverine transport was already practiced during this period.  The ": null
    },
    {
        "Uruk period": "uruk period"
    },
    {
        ", roughly coinciding with the 4th millennium BCE, saw the emergence of truly ": null
    },
    {
        "urban": "urbanism"
    },
    {
        " settlements across Mesopotamia. Cities like ": null
    },
    {
        "Tell Brak": "nagar, syria"
    },
    {
        " and ": null
    },
    {
        "Uruk": "uruk"
    },
    {
        " grew to over  in size and displayed monumental architecture.  The spread of southern Mesopotamian pottery, architecture and ": null
    },
    {
        "sealings": "cylinder seal"
    },
    {
        " far into Turkey and ": null
    },
    {
        "Iran": "iran"
    },
    {
        " has generally been interpreted as the material reflection of a widespread trade system aimed at providing the Mesopotamian cities with raw materials. ": null
    },
    {
        "Habuba Kabira": "habuba kabira"
    },
    {
        " on the Syrian Euphrates is a prominent example of a settlement that is interpreted as an Uruk colony.            During the ": null
    },
    {
        "Jemdet Nasr": "jemdet nasr period"
    },
    {
        " and Early Dynastic periods , southern Mesopotamia experienced a growth in the number and size of settlements, suggesting strong population growth. These settlements, including ": null
    },
    {
        "Sumero-Akkadian": "sumero-akkadian"
    },
    {
        " sites like ": null
    },
    {
        "Sippar": "sippar"
    },
    {
        ", ": null
    },
    {
        "Uruk": "uruk"
    },
    {
        ", ": null
    },
    {
        "Adab": "adab"
    },
    {
        " and ": null
    },
    {
        "Kish": "kish"
    },
    {
        ", were organized in competing ": null
    },
    {
        "city-state": "city-state"
    },
    {
        "s.  Many of these cities were located along canals of the Euphrates and the Tigris that have since dried up, but that can still be identified from ": null
    },
    {
        "remote sensing": "remote sensing"
    },
    {
        " imagery.  A similar development took place in ": null
    },
    {
        "Upper Mesopotamia": "upper mesopotamia"
    },
    {
        ", ": null
    },
    {
        "Subartu": "subartu"
    },
    {
        " and ": null
    },
    {
        "Assyria": "assyria"
    },
    {
        ", although only from the mid 3rd millennium and on a smaller scale than in Lower Mesopotamia. Sites like ": null
    },
    {
        "Ebla": "ebla"
    },
    {
        ", ": null
    },
    {
        "Mari": "mari, syria"
    },
    {
        " and ": null
    },
    {
        "Tell Leilan": "tell leilan"
    },
    {
        " grew to prominence for the first time during this period.      Large parts of the Euphrates basin were for the first time united under a single ruler during the ": null
    },
    {
        "Akkadian Empire": "akkadian empire"
    },
    {
        " and ": null
    },
    {
        "Ur III": "third dynasty of ur"
    },
    {
        " empires, which controlled – either directly or indirectly through vassals – large parts of modern-day Iraq and northeastern Syria.  Following their collapse, the ": null
    },
    {
        "Old Assyrian Empire": "old assyrian empire"
    },
    {
        " and Mari asserted their power over northeast Syria and northern Mesopotamia, while southern Mesopotamia was controlled by city-states like ": null
    },
    {
        "Isin": "isin"
    },
    {
        ", ": null
    },
    {
        "Kish": "kish"
    },
    {
        " and ": null
    },
    {
        "Larsa": "larsa"
    },
    {
        " before their territories were absorbed by the newly emerged state of ": null
    },
    {
        "Babylonia": "babylonia"
    },
    {
        " under ": null
    },
    {
        "Hammurabi": "hammurabi"
    },
    {
        " in the early to mid 18th century BCE.      In the second half of the 2nd millennium BCE, the Euphrates basin was divided between ": null
    },
    {
        "Kassite": "kassites"
    },
    {
        " Babylon in the south and ": null
    },
    {
        "Mitanni": "mitanni"
    },
    {
        ", ": null
    },
    {
        "Assyria": "assyria"
    },
    {
        " and the ": null
    },
    {
        "Hittite Empire": "hittites"
    },
    {
        " in the north, with the ": null
    },
    {
        "Middle Assyrian Empire": "middle assyrian empire"
    },
    {
        " eventually eclipsing the Hittites, Mitanni and Kassite Babylonians.  Following the end of the Middle Assyrian Empire in the late 11th century BCE, struggles broke out between Babylonia and Assyria over the control of the Iraqi Euphrates basin. The ": null
    },
    {
        "Neo-Assyrian Empire": "neo-assyrian empire"
    },
    {
        " eventually emerged victorious out of this conflict and also succeeded in gaining control of the northern Euphrates basin in the first half of the 1st millennium BCE.      In the centuries to come, control of the wider Euphrates basin shifted from the Neo-Assyrian Empire to the short lived ": null
    },
    {
        "Median Empire": "median empire"
    },
    {
        " and equally brief ": null
    },
    {
        "Neo-Babylonian Empire": "neo-babylonian empire"
    },
    {
        " in the last years of the 7th century BC, and eventually to the ": null
    },
    {
        "Achaemenid Empire": "achaemenid empire"
    },
    {
        " .  The Achaemenid Empire was in turn overrun by ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        ", who defeated the last king ": null
    },
    {
        "Darius III": "darius iii of persia"
    },
    {
        " and died in Babylon in 323 BCE.      Subsequent to this, the region came under the control of the ": null
    },
    {
        "Seleucid Empire": "seleucid empire"
    },
    {
        " , ": null
    },
    {
        "Parthian Empire": "parthian empire"
    },
    {
        " , and was fought over by the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", its succeeding ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " and the ": null
    },
    {
        "Sassanid Empire": "sassanid empire"
    },
    {
        " , until the ": null
    },
    {
        "Islamic conquest": "islamic conquest"
    },
    {
        " of the mid 7th century AD. The ": null
    },
    {
        "Battle of Karbala": "battle of karbala"
    },
    {
        " took place near the banks of this river in 680 AD.     In the north, the river served as a border between ": null
    },
    {
        "Greater Armenia": "kingdom of armenia"
    },
    {
        " and ": null
    },
    {
        "Lesser Armenia": "lesser armenia"
    },
    {
        " .             After ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the borders in Southwest Asia were redrawn in the ": null
    },
    {
        "Treaty of Lausanne ": "treaty of lausanne"
    },
    {
        ", when the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " was ": null
    },
    {
        "partitioned": "partitioning of the ottoman empire"
    },
    {
        ". Clause 109 of the treaty stipulated that the three riparian states of the Euphrates  had to reach a mutual agreement on the use of its water and on the construction of any hydraulic installation.  An agreement between Turkey and Iraq signed in 1946 required Turkey to report to Iraq on any hydraulic changes it made on the Tigris–Euphrates river system, and allowed Iraq to construct dams on Turkish territory to manage the flow of the Euphrates.         The river featured on the ": null
    },
    {
        "coat of arms of Iraq": "coat of arms of iraq"
    },
    {
        " from 1932-1959.        Turkey and Syria completed their first dams on the Euphrates – the Keban Dam and the Tabqa Dam, respectively – within one year of each other and filling of the reservoirs commenced in 1975. At the same time, the area was hit by severe drought and river flow toward Iraq was reduced from  in 1973 to  in 1975. This led to an international crisis during which Iraq threatened to bomb the Tabqa Dam. An agreement was eventually reached between Syria and Iraq after intervention by Saudi Arabia and the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ".   A similar crisis, although not escalating to the point of military threats, occurred in 1981 when the Keban Dam reservoir had to be refilled after it had been almost emptied to temporarily increase Turkeys hydroelectricity production.  In 1984, Turkey unilaterally declared that it would ensure a flow of at least  per second, or  per year, into Syria, and in 1987 a bilateral treaty to that effect was signed between the two countries.  Another bilateral agreement from 1989 between Syria and Iraq settles the amount of water flowing into Iraq at 60 percent of the amount that Syria receives from Turkey.  In 2008, Turkey, Syria and Iraq instigated the Joint Trilateral Committee on the management of the water in the Tigris–Euphrates basin and on 3 September 2009 a further agreement was signed to this effect.    On April 15, 2014, Turkey began to reduce the flow of the Euphrates into Syria and Iraq. The flow was cut off completely on May 16, 2014 resulting in the Euphrates terminating at the Turkish–Syrian border.  This was in violation of an agreement reached in 1987 in which Turkey committed to releasing a minimum of  of water per second at the Turkish–Syrian border.              Throughout history, the Euphrates has been of vital importance to those living along its course. With the construction of large hydropower stations, irrigation schemes, and pipelines capable of transporting water over large distances, many more people now depend on the river for basic amenities such as electricity and drinking water than in the past. Syrias Lake Assad is the most important source of drinking water for the city of ": null
    },
    {
        "Aleppo": "aleppo"
    },
    {
        ",  to the west of the river valley.  The lake also supports a modest state-operated fishing industry.  Through a newly restored power line, the Haditha Dam in Iraq provides electricity to Baghdad.        ": null
    }
]