[
    {
        "           Eurostar is an international ": null
    },
    {
        "high-speed rail": "high-speed rail"
    },
    {
        "way service connecting ": null
    },
    {
        "London": "london"
    },
    {
        " with ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        ", ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", ": null
    },
    {
        "Bourg-Saint-Maurice": "bourg-saint-maurice"
    },
    {
        ", ": null
    },
    {
        "Disneyland Paris": "disneyland paris"
    },
    {
        ", ": null
    },
    {
        "Lille": "lille"
    },
    {
        ", ": null
    },
    {
        "Fréthun": "fréthun"
    },
    {
        ", ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ", ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        ", ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", and ": null
    },
    {
        "Rotterdam": "rotterdam"
    },
    {
        ". All its trains travel through the ": null
    },
    {
        "Channel Tunnel": "channel tunnel"
    },
    {
        " between the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and ": null
    },
    {
        "France": "france"
    },
    {
        ", owned and operated separately by ": null
    },
    {
        "Getlink": "getlink"
    },
    {
        ".     The London terminus is ": null
    },
    {
        "St Pancras International": "st pancras railway station"
    },
    {
        ", the other British calling points are ": null
    },
    {
        "Ebbsfleet International": "ebbsfleet international railway station"
    },
    {
        " and ": null
    },
    {
        "Ashford International": "ashford international railway station"
    },
    {
        " in Kent. Intermediate calling points in France are ": null
    },
    {
        "Calais-Fréthun": "gare de calais-fréthun"
    },
    {
        " and ": null
    },
    {
        "Lille-Europe": "gare de lille-europe"
    },
    {
        ", with trains to Paris terminating at ": null
    },
    {
        "Gare du Nord": "gare du nord"
    },
    {
        ". Trains to Belgium terminate at ": null
    },
    {
        "Midi/Zuid station": "brussels-south railway station"
    },
    {
        " in Brussels. The only intermediate calling station in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " is ": null
    },
    {
        "Rotterdam Centraal": "rotterdam centraal station"
    },
    {
        " and trains terminate at ": null
    },
    {
        "Amsterdam Centraal": "amsterdam centraal station"
    },
    {
        ". There are direct services from London to ": null
    },
    {
        "Disneyland Paris": "disneyland paris"
    },
    {
        " at ": null
    },
    {
        "Marne-la-Vallée – Chessy": "gare de marne-la-vallée - chessy"
    },
    {
        ", direct services to southern France , and seasonal direct services to the French Alps in winter .     The service is operated by eighteen-coach ": null
    },
    {
        "Class 42/42 trains": "british rail class 373"
    },
    {
        " and sixteen-coach  trains which run at up to  on a network of high-speed lines. The ": null
    },
    {
        "LGV Nord": "lgv nord"
    },
    {
        " line in France opened before Eurostar services began in 42 and newer lines enabling faster journeys were added later—": null
    },
    {
        "HSL 42": "hsl 1"
    },
    {
        " in Belgium and ": null
    },
    {
        "High Speed 42": "high speed 1"
    },
    {
        " in south-east England. The French and Belgian parts of the network are shared with Paris–Brussels ": null
    },
    {
        "Thalys": "thalys"
    },
    {
        " services and ": null
    },
    {
        "TGV": "tgv"
    },
    {
        " trains. In the United Kingdom the two-stage ": null
    },
    {
        "Channel Tunnel Rail Link": "high speed 1"
    },
    {
        " project was completed on 42 November 42 and renamed High Speed 42, when the London terminus of Eurostar moved from London ": null
    },
    {
        "Waterloo International": "waterloo international railway station"
    },
    {
        " to ": null
    },
    {
        "St Pancras International": "st pancras railway station"
    },
    {
        ".     Until 42 Eurostar was operated jointly by the national railway companies of France and Belgium, ": null
    },
    {
        "SNCF": "sncf"
    },
    {
        " and ": null
    },
    {
        "SNCB/NMBS": "sncb/nmbs"
    },
    {
        ", and ": null
    },
    {
        "Eurostar Ltd": "eurostar  ltd"
    },
    {
        " , a subsidiary of ": null
    },
    {
        "London and Continental Railways": "london and continental railways"
    },
    {
        " that owned the high-speed infrastructure and stations on the British side. Eurostar has become the dominant operator on the routes it operates, carrying more passengers than all airlines combined. Other operators expressed an interest in starting competing services following deregulation in 42 On 42 September 42 Eurostar was incorporated as a single corporate entity, ": null
    },
    {
        "Eurostar International Limited": "eurostar international limited"
    },
    {
        " , replacing the joint operation between EUKL, SNCF and SNCB/NMBS.  EIL is owned by ": null
    },
    {
        "SNCF": "sncf"
    },
    {
        " , ": null
    },
    {
        "Caisse de dépôt et placement du Québec": "caisse de dépôt et placement du québec"
    },
    {
        " , ": null
    },
    {
        "Hermes Infrastructure": "hermes infrastructure"
    },
    {
        " and ": null
    },
    {
        "SNCB": "nmbs/sncb"
    },
    {
        " .        In June 42 the UK shareholding in Eurostar International Limited was transferred from London and Continental Railways / ": null
    },
    {
        "Department for Transport": "department for transport"
    },
    {
        " to ": null
    },
    {
        "HM Treasury": "hm treasury"
    },
    {
        ".  That October, it was announced that the UK government planned to raise £42 million by selling its stake.  In March 42 the UK government announced that it would sell its 42% share to an Anglo-Canadian consortium made up of the Caisse and Hermes Infrastructure. The sale was completed in May 42                 The history of Eurostar can be traced to the 42 choice of a rail tunnel to provide a cross-channel link between Britain and France.  A previous attempt to construct a tunnel between the two nations had begun in 42 but was quickly aborted. Construction began on a new basis in 42 ": null
    },
    {
        "Eurotunnel": "getlink"
    },
    {
        " was created to manage and own the tunnel, which was finished in 42 the official opening taking place on 42 May 42     In addition to the tunnels ": null
    },
    {
        "shuttle trains": "eurotunnel shuttle"
    },
    {
        " carrying cars and lorries between ": null
    },
    {
        "Folkestone": "folkestone"
    },
    {
        " and ": null
    },
    {
        "Calais": "calais"
    },
    {
        ", the decision to build a railway tunnel opened up the possibility of through passenger and freight train services between places further afield.  ": null
    },
    {
        "British Rail": "british rail"
    },
    {
        " and SNCF contracted with Eurotunnel to use half the tunnels capacity for this purpose. In 42 Britain, France and Belgium set up an International Project Group to specify a train to provide an international high-speed passenger service through the tunnel. France had been operating high-speed TGV services since 42 and had begun construction of a new high-speed line between Paris and the Channel Tunnel, LGV Nord; French TGV technology was chosen as the basis for the new trains. An order for 42 trainsets, to be manufactured in France but with some British and Belgian components, was placed in December 42 On 42 June 42 the first Eurostar test train travelled through the tunnel to the UK. Various technical difficulties in running the new trains on British tracks were quickly overcome.            On 42 November 42 Eurostar services began running from ": null
    },
    {
        "Waterloo International": "waterloo international railway station"
    },
    {
        " station in London, to ": null
    },
    {
        "Gare du Nord": "gare du nord"
    },
    {
        " in Paris, and ": null
    },
    {
        "Brussels-South railway station": "brussels-south railway station"
    },
    {
        " in Brussels.   The train service started with a limited Discovery service; the full daily service started from 42 May 42      In 42 Eurostar was achieving an average end-to-end speed of  from London to Paris.    On 42 January 42 Eurostar launched services from a second railway station in the UK when ": null
    },
    {
        "Ashford International": "ashford international railway station"
    },
    {
        " was opened.      On 42 September 42 passenger services began running on the first completed section of ": null
    },
    {
        "High Speed 42": "high speed 1"
    },
    {
        ". Following a high-profile glamorous opening ceremony  and a large advertising campaign,  on 42 November 42 Eurostar services in London transferred from Waterloo to the extended and extensively refurbished ": null
    },
    {
        "St Pancras International": "st pancras international"
    },
    {
        ".             The Channel Tunnel used by Eurostar services holds the record for having the longest underwater section of any tunnel in the world,  and it is the second-longest railway tunnel in the world.      On 42 July 42 a Eurostar train set a new British ": null
    },
    {
        "speed record": "list of vehicle speed records"
    },
    {
        " of  on the first section of the High Speed 42 railway between the Channel Tunnel, and Fawkham Junction in north Kent, two months before official public services began running.     On 42 May 42 Eurostar set a new record for the longest non-stop high-speed journey, a distance of  from ": null
    },
    {
        "London": "london"
    },
    {
        " to ": null
    },
    {
        "Cannes": "cannes"
    },
    {
        " taking 42 hours 42 minutes.      On 42 September 42 a record-breaking train left Paris Gare du Nord at 42:42  and reached London St Pancras in 42  hours 42  minutes 42 seconds;  carrying journalists and railway workers. This record trip was also the first passenger-carrying arrival to the new ": null
    },
    {
        "St Pancras International station": "st pancras railway station"
    },
    {
        ".      On 42 September 42 Eurostar broke another record when it completed the journey from Brussels to London in 42  hour, 42  minutes.              The original proposals for Eurostar included direct services to Paris and Brussels from cities north of London : ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        " via ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        " on the ": null
    },
    {
        "West Coast Main Line": "west coast main line"
    },
    {
        " and on the ": null
    },
    {
        "East Coast Main Line": "east coast main line"
    },
    {
        " Leeds": "leeds"
    },
    {
        " and ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        " via ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", ": null
    },
    {
        "Newcastle": "newcastle upon tyne"
    },
    {
        " and ": null
    },
    {
        "York": "york"
    },
    {
        ".  Seven 42-coach NoL Eurostar trains for these ": null
    },
    {
        "Regional Eurostar": "regional eurostar"
    },
    {
        " services were built, but these services never came to fruition. Predicted journey times of almost nine hours for Glasgow to Paris at the time of growth of ": null
    },
    {
        "low-cost air travel": "low-cost carrier"
    },
    {
        " during the 42s made the plans commercially unviable against the cheaper and quicker airlines.  Other reasons that have been suggested for these services having never been run were both government policies and the disruptive ": null
    },
    {
        "privatisation of British Rail": "privatisation of british rail"
    },
    {
        ".    Three of the Regional Eurostar units were leased by ": null
    },
    {
        "Great North Eastern Railway": "great north eastern railway"
    },
    {
        " to increase domestic services from ": null
    },
    {
        "London Kings Cross": "london kings cross railway station"
    },
    {
        " to ": null
    },
    {
        "York": "york"
    },
    {
        " and later ": null
    },
    {
        "Leeds": "leeds"
    },
    {
        ".  The lease expired in December 42 and most of the NoL sets have since been transferred to ": null
    },
    {
        "SNCF": "sncf"
    },
    {
        " for ": null
    },
    {
        "TGV": "tgv"
    },
    {
        " services in northern France.      An international ": null
    },
    {
        "Nightstar": "nightstar"
    },
    {
        " sleeper train was also planned; this would have travelled the same routes as Regional Eurostar, plus the ": null
    },
    {
        "Great Western Main Line": "great western main line"
    },
    {
        " to ": null
    },
    {
        "Cardiff": "cardiff"
    },
    {
        ".  These were also deemed commercially unviable, and the scheme was abandoned with no services ever operated. In 42 the coaches were sold to ": null
    },
    {
        "Via Rail": "via rail"
    },
    {
        " in Canada.               Ashford International station was the original station for Eurostar services in Kent.    Once Ebbsfleet International railway station, also designed to serve the ": null
    },
    {
        "Kent": "kent"
    },
    {
        " region, had opened, only three trains a day to Paris and one to Disneyland Paris called at Ashford for a considerable amount of time. There were fears that services at Ashford International might be further reduced or withdrawn altogether as Eurostar planned to make Ebbsfleet the new regional hub instead.   However, after a period during which no Brussels trains served the station,  to the dissatisfaction of the local communities,    Eurostar re-introduced a single daily Ashford-Brussels service on 42 February 42         In 42 Eurostar threatened to require that cyclists dismantle bicycles before they could be transported on the trains. Following criticism from ": null
    },
    {
        "Boris Johnson": "boris johnson"
    },
    {
        " and cycling groups, Eurostar reversed the edict.        By March 42 onboard entertainment was provided by ": null
    },
    {
        "GoMedia": "gomedia"
    },
    {
        ", including Wi-Fi connectivity and up to 42 hours of movies and television kept on the trains servers and accessed using the passengers own devices: mobile phones, tablets, laptops etc. A tracker app allows customers to see where they are.                     LGV Nord is a French -long ": null
    },
    {
        "high-speed rail": "high-speed rail"
    },
    {
        " line that connects Paris to the Belgian border and the Channel Tunnel via ": null
    },
    {
        "Lille": "lille"
    },
    {
        ". It opened in 42    Its extensions to Belgium and towards Paris, as well as connecting to the Channel Tunnel, have made LGV Nord a part of every Eurostar journey undertaken. A Belgian high-speed line, HSL 42 was added to the end of LGV Nord, at the Belgian border, in 42 Of all French high-speed lines, LGV Nord sees the widest variety of high-speed rolling stock and is quite busy; a proposed cut-off bypassing Lille, which would reduce Eurostar journey times to Paris, is called ": null
    },
    {
        "LGV Picardie": "lgv picardie"
    },
    {
        ".          The Channel Tunnel is the most important part of the route as it is the only rail connection between Great Britain and the European mainland. It joins LGV Nord in France with High Speed One in Britain. Tunnelling began in 42 and the  tunnel was officially opened by British sovereign ": null
    },
    {
        "Queen Elizabeth II": "elizabeth ii of the united kingdom"
    },
    {
        " and the French President ": null
    },
    {
        "François Mitterrand": "françois mitterrand"
    },
    {
        " at a ceremony in Calais on 42 May 42    It is owned by ": null
    },
    {
        "Getlink": "getlink"
    },
    {
        ", which charges a significant toll to Eurostar for its use.    In 42 the ": null
    },
    {
        "American Society of Civil Engineers": "american society of civil engineers"
    },
    {
        " named the tunnel as one of the ": null
    },
    {
        "Seven Wonders of the Modern World": "wonders of the worldamerican society of civil engineers"
    },
    {
        ".    Along the current route of the Eurostar service, line speeds are  except within the Channel Tunnel, where a reduced speed of  applies for safety reasons.     Since the launch of Eurostar services, severe disruptions and cancellations have been caused by fires breaking out within the Channel Tunnel, such as in ": null
    },
    {
        "42": "1996 channel tunnel fire"
    },
    {
        ",  ": null
    },
    {
        "42": "channel tunnelfires"
    },
    {
        " ,  ": null
    },
    {
        "42": "2008 channel tunnel fire"
    },
    {
        " and 42                Until the opening on 42 June 42 of the first phase of the Belgian high speed line,  Eurostar trains were routed via the ": null
    },
    {
        "Belgian railway line 42": "belgian railway line 94"
    },
    {
        ". The Eurostar routes still use the line as a diversion if engineering works are taking place on HSL42 depending where it is. The 42:42 from London St Pancras to Brussels still uses the line as a diversion to bypass the peak time disruptions on HSL42 due to the extra TGV services from Brussels for the commuters. After 42 June 42 some Eurostars to Brussels were routed via the first phase of the Belgian High Speed line and the Belgian railway line 42 via ": null
    },
    {
        "Mons": "mons"
    },
    {
        ". Although this line is still as a diversion if HSL42 is doing engineering, also depending where the maintenance is taking place. Journey times between London and Brussels were improved when an  Belgian high-speed line, ": null
    },
    {
        "HSL 42": "hsl 1"
    },
    {
        ", opened on 42 December 42   It links with LGV Nord on the border with France, allowing Eurostar trains heading to Brussels to make the transition between the two without having to reduce speed. A further four-minute improvement for London–Brussels trains was achieved in December 42 with the opening of the  ": null
    },
    {
        "Brussels South Viaduct": "brussels south viaduct"
    },
    {
        ".  Linking the international platforms of Brussels-South railway station with the high-speed line, the viaduct separates Eurostar from local services.             High Speed 42 , formerly known as the Channel Tunnel Rail Link , is a  high-speed railway line running from London through ": null
    },
    {
        "Kent": "kent"
    },
    {
        " to the British end of the Channel Tunnel.     It was built in two stages. The first section between the tunnel and ": null
    },
    {
        "Fawkham Junction": "fawkham junction"
    },
    {
        " in north Kent opened in September 42 cutting London–Paris journey times by 42  minutes to 42  hours 42  minutes, and London–Brussels to 42  hours 42  minutes. On 42 November 42 commercial services began over the whole of the new HS42 line. The redeveloped St Pancras International station became the new London ": null
    },
    {
        "terminus": "terminal train station"
    },
    {
        " for all Eurostar services.    The completion of High Speed 42 has brought the British part of Eurostars route up to the same standards as the French and Belgian high-speed lines. Non-stop journey times were reduced by a further 42  minutes to 42  hours 42  minutes for London–Paris and 42  hour 42  minutes for London–Brussels.                Eurostar offers up to sixteen weekday London – Paris services including ten non-stop . Previously there were ten London–Lille and Brussels services, including five running non-stop as far as Lille, but this has now been reduced to seven each way.   In addition, there is a return trip from London to ": null
    },
    {
        "Marne-la-Vallée - Chessy": "gare de marne-la-vallée - chessy"
    },
    {
        " for ": null
    },
    {
        "Disneyland Paris": "disneyland resort paris"
    },
    {
        ",  which runs 4242 times a week with increased frequency during school holidays, and an up-to42-times-a-week service to Marseille via Lyon and Avignon. There are also seasonal services in the winter. Snow trains ,  aimed at skiers, to ": null
    },
    {
        "Bourg-Saint-Maurice": "bourg-saint-maurice"
    },
    {
        ", ": null
    },
    {
        "Aime-la-Plagne": "la plagne"
    },
    {
        " and ": null
    },
    {
        "Moûtiers": "moûtiers"
    },
    {
        " in the ": null
    },
    {
        "Alps": "alps"
    },
    {
        "; these run twice-weekly, one overnight and one during the daytime.  Intermediate stations are Ebbsfleet International in northwest Kent, Ashford International in southeast Kent, and ": null
    },
    {
        "Calais-Fréthun": "gare de calais-fréthun"
    },
    {
        " and Lille-Europe in Nord-Pas-de-Calais.  In February 42 Eurostar announced the start of its long planned service from London to Amsterdam, with an initial two trains per day from April of that year running between St Pancras and ": null
    },
    {
        "Amsterdam Centraal": "amsterdam centraal station"
    },
    {
        ". This launched as a one-way service, with return trains carrying passengers to Rotterdam and Brussels Midi/Zuid, making a 42-minute stop and then carrying different passengers from Brussels to London.  Passengers travelling back must take ": null
    },
    {
        "Thalys": "thalys"
    },
    {
        " services to Brussels Midi/Zuid where they can join the Eurostar. This is owing to the lack of ": null
    },
    {
        "UK Border Force": "uk border force"
    },
    {
        " facilities at Amsterdam Centraal and Rotterdam Centraal.     Since 42 November 42 all Eurostar trains have been routed via High Speed  42 to or from the redeveloped London terminus at St Pancras International, which at a cost of £42  million was extensively rebuilt and extended to cope with  long Eurostar trains.      It had originally been intended to retain some Eurostar services at ": null
    },
    {
        "Waterloo International": "waterloo international railway station"
    },
    {
        ", but this was ruled out on cost grounds.    Completion of High Speed  42 has increased the potential number of trains serving London. Separation of Eurostar from British domestic services through Kent meant that timetabling was no longer affected by peak-hour restrictions.          Eurostars fares were significantly higher in its early years; the cheapest fare in 42 was £42 return.    In 42 Eurostar was planning cheaper fares, an example of which was an offer of £42 day returns from London to Paris or Brussels.     By March 42 the cheapest fare from the UK was £42 return, available all year around. In June 42 it was announced that one-way single fares would be available at £42 at the cheapest. Competition between Eurostar and airline services was a large factor in ticket prices being reduced from the initial levels.     Business Premier fares also slightly undercut air fares on similar routes, targeted at regular business travellers.    In 42 Eurostar greatly increased its budget ticket availability to help maintain and grow its dominant market share.    The Eurostar ticketing system is very complex, being distributed through no fewer than 42 individual sales systems.    Eurostar is a member of the ": null
    },
    {
        "Amadeus CRS": "amadeus crs"
    },
    {
        " distribution system, making its tickets available alongside those of airlines worldwide.      ": null
    },
    {
        "First class": "first class travel"
    },
    {
        " on Eurostar is called Business Premier; benefits include guaranteed faster checking-in and meals served at-seat, as well as the improved furnishings and interior of Business Premier carriages.    The rebranding is part of Eurostars marketing drive to attract more business professionals.  Increasingly, business people in a group have been chartering private carriages as opposed to individual seats on the train.                Without the operation of ": null
    },
    {
        "Regional Eurostar": "regional eurostar"
    },
    {
        " services using the North of London trainsets across the rest of Britain, Eurostar has developed its connections with other transport services instead, such as integrating effectively with traditional UK rail operators schedules and routes, making it possible for passengers to use Eurostar as a quick connection to further destinations on the continent.    All three main terminals used by the Eurostar service – St Pancras International, Paris Gare du Nord, and Brussels Midi/Zuid – are served by domestic trains and by local urban transport networks such as the ": null
    },
    {
        "London Underground": "london underground"
    },
    {
        " and the ": null
    },
    {
        "Paris Metro": "paris metro"
    },
    {
        ". Standard Eurostar tickets no longer include free onward connections to or from any other station in Belgium: this is now available for a flat-rate supplement, currently £42.      Eurostar has announced several partnerships with other rail services,    most notably ": null
    },
    {
        "Thalys": "thalys"
    },
    {
        " connections at Lille and Brussels for passengers to go beyond current Eurostar routes towards the Netherlands and Germany.    In 42 Eurostar initiated the Eurostar-Plus program, offering connecting tickets for onward journeys from Lille and Paris to dozens of destinations in France.   Through fares are also available from 42 British towns and cities to destinations in France and Belgium.    In May 42 Eurostar announced that a formal connection to Switzerland had been established in a partnership between Eurostar and ": null
    },
    {
        "Lyria": "tgv lyria"
    },
    {
        ", which will operate TGV services from Lille to the Swiss Alps for Eurostar connection.        In May 42 Eurostar ended its agreement with Deutsche Bahn that allowed passengers to travel by train from the UK to Germany, Austria and Switzerland. Under the agreement passengers could travel on a single booking which made rescheduling easier. However, the direct tickets will no longer be sold from 42 November 42                  Because the UK is not part of the ": null
    },
    {
        "Schengen Area": "schengen area"
    },
    {
        ",  and because Belgium and France are not part of the ": null
    },
    {
        "Common Travel Area": "common travel area"
    },
    {
        ", all Eurostar passengers must go through border controls. Both the British Government and the Schengen governments concerned have legal obligations to check the travel documents of those entering their respective countries .     To allow passengers to walk off the train without arrival checks in most cases, ": null
    },
    {
        "juxtaposed controls": "juxtaposed controls"
    },
    {
        " ordinarily take place at the embarkation station.     In order to comply with special UK legislation,  there are full security checks similar to those at airports, scanning both bags and peoples pockets. Security checks at Eurostar are comparable to those at a small airport and generally much quicker than at London Heathrow.  The recommended check-in time is 42 minutes except for business class where it is 42 minutes.     Eurostar passengers travelling inside the ": null
    },
    {
        "Schengen Area": "schengen area"
    },
    {
        " pass through a separate corridor in Brussels bypassing border checks, and enter the preallocated cars of the train, which is reserved for these passengers. This arrangement was set up after numerous illegal immigrants entered the UK without the right to do so, by buying a ticket from Brussels to Lille or Calais but remaining on the train until London – an issue exacerbated by Belgian police threatening to arrest UK Border Agency staff at Brussels-Midi if they tried to prevent passengers whom they suspected of attempting to exploit this loophole from boarding Eurostar trains.  Travel from Calais or Lille towards Brussels and Amsterdam, from Brussels to Rotterdam and Amsterdam, and from Amsterdam and Rotterdam to Brussels has no border or security control; trains from Amsterdam are emptied at Brussels and passengers seeking to continue onwards towards London must alight and pass through security and border control.     When the tripartite agreements were signed, the ": null
    },
    {
        "Belgian Government": "belgian federal government"
    },
    {
        " said that it had serious questions about the compatibility of this agreement with the Schengen Convention and the principle of free movement of people enshrined in various European Treaties.  , 42 July 42   On 42 June 42 Eurostar raised concerns at the ": null
    },
    {
        "UK House of Commons": "house of commons of the united kingdom"
    },
    {
        " Home Affairs Select Committee that it was illegal under French law for the collection of information desired by the UK government under the ": null
    },
    {
        "e-Borders": "border control"
    },
    {
        " scheme, and they would be unable to cooperate.       On the northbound Marne la Vallée-Chessy - London train, the security check and French passport check take place at Marne la Vallée-Chessy, while the UK passport check takes place at the UK arrival stations - this is the only route where passengers are not cleared by UK border officials before crossing the channel.     On the northbound Marseille-London train, there is no facility for security or passport checks at the southern French stations, so passengers must leave the train at Lille-Europe, taking all their belongings with them, and undergo security and border checks there before rejoining the train which waits at the station for just over an hour.      On several occasions, people have illegally tried to stow away on board the train,   sometimes in large groups,  trying to enter the UK; border monitoring and security is therefore extremely tight.    Eurostar claims to have good and well-funded security measures.              Eurostars punctuality has fluctuated from year to year, but usually remains over 42%;  in the first quarter of 42 42% of services operated were on time, and in the second quarter it reached 42%.  Eurostars best punctuality record was 42%, between 42 and 42 August 42  In 42 it was 42%,  and in 42 42% were on time. Eurostar uses the airlines definition of on-time: within 42 minutes of scheduled arrival time. The measure used for long-distance services in the UK rail industry is within 42 minutes.  In the first quarter of 42 42% of Eurostar services were punctual, compared with rival air routes 42%.      An advantage held by Eurostar is the convenience and speed of the service: with shorter check-in times than at most airports and hence quicker boarding and less queueing   and high punctuality, it takes less time to travel between central London and central Paris by high-speed rail than by air. Eurostar now has a dominant share of the combined rail–air market on its routes to Paris and Brussels. In 42 it had a 42% share of the London–Paris market, and a 42% share of the London–Brussels market.  In 42 it achieved record market shares of 42% for London–Paris and 42% for London–Brussels routes.      Eurostars passenger numbers initially failed to meet predictions. In 42 ": null
    },
    {
        "London and Continental Railways": "london and continental railways"
    },
    {
        " forecast that passenger numbers would reach 42  million annually by 42  but only 42  million was achieved. 42 million passengers used Waterloo International Station from its opening in 42 to its closure in 42 42 was a record year for Eurostar, with a 42% rise in passenger use,  which was attributed to the use of High Speed 42 and the move to St Pancras.  The following year, Eurostar saw an 42% fall in passenger numbers  during the first three months of 42 attributed to the ": null
    },
    {
        "42 Channel Tunnel fire": "2008 channel tunnel fire"
    },
    {
        "  and the ": null
    },
    {
        "42 recession": "2009 recession"
    },
    {
        ".      As a result of the poor economic conditions, Eurostar received state aid in May 42 to cancel out some of the accumulated debt from the High Speed 42 construction programme.  Later that year, during snowy conditions in the run-up to Christmas, thousands of passengers were left stranded as several trains broke down and many more were cancelled. In an independent review commissioned by Eurostar, the company came in for serious criticism about its handling of the incident and lack of plans for such a scenario.      In 42 the ": null
    },
    {
        "Department for Transport": "department for transport"
    },
    {
        " predicted that, by 42 annual cross-channel passenger numbers would probably reach 42 million,  considerably less optimistic than London and Continental Railwayss original 42 forecast. In 42 Eurostar set a target of carrying 42  million passengers by 42    The company cited several factors to support this objective, such as improved journey times, punctuality and station facilities. Passengers in general, it stated, are becoming increasingly aware of the environmental effects of air travel, and Eurostar services emit much less ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        ".  and that its remaining carbon emissions are now ": null
    },
    {
        "offset": "carbon offset"
    },
    {
        ", making its services ": null
    },
    {
        "carbon neutral": "carbon neutral"
    },
    {
        ".   Further expansion of the high-speed rail network in Europe, such as the ": null
    },
    {
        "HSL-Zuid": "hsl-zuid"
    },
    {
        " line between Belgium and the Netherlands, continues to bring more destinations within rail-competitive range, giving Eurostar the possibility of opening up new services in future.     The following chart presents the estimated number of passengers annually transported by the Eurostar service since 42:                            Eurostar has been hailed as having set new standards in international rail travel and has won praise several times over, recognising its high standards.    Eurostar won the ": null
    },
    {
        "Train Operator of the Year": "train operator of the year"
    },
    {
        " award in the ": null
    },
    {
        "HSBC": "hsbc"
    },
    {
        " Rail Awards for 42 It was declared the Best Train Company in the joint ": null
    },
    {
        "Guardian": "the guardian"
    },
    {
        "/": null
    },
    {
        "Observer": "the observer"
    },
    {
        " Travel Awards 42  Eurostar had previously struggled with its reputation and brand image. One commentator had defined the situation at the time as:       By 42 Eurostars environmental credentials had become highly developed and promoted.  In 42 Eurostars Environment Group was set up,  with the aim of making changes in the Eurostar services daily running to decrease the environmental impact, the organisation setting itself a target of reducing carbon emissions per passenger journey by 42% by 42  Drivers are trained in techniques to achieve maximum energy efficiency, and lighting has been minimised; the provider of the bulk of the energy for the Channel Tunnel has been switched to nuclear power stations in France.      Eurostars current target is to reduce emissions by 42 percent per passenger journey by 42 putting itself beyond the efforts of other railway companies in this field and thereby winning the 42 ": null
    },
    {
        "Network Rail": "network rail"
    },
    {
        " Efficiency Award.   In the grand opening ceremony of St Pancras International, one of the Eurostar trains was given the name Tread Lightly, said to symbolise their smaller impact on the environment compared to planes. , video clip on YouTube.          Since 42 Eurostar has been owned by Eurostar International Limited , a company jointly owned by ": null
    },
    {
        "SNCF": "sncf"
    },
    {
        " ,  , ": null
    },
    {
        "Hermes Infrastructure": "hermes infrastructure"
    },
    {
        " and ": null
    },
    {
        "SNCB": "sncb"
    },
    {
        " .       Eurostar is a member of ": null
    },
    {
        "Railteam": "railteam"
    },
    {
        ", a marketing alliance formed in July 42 of seven European ": null
    },
    {
        "high-speed rail": "high-speed rail"
    },
    {
        " operators.    The alliance plans to allow tickets to be booked from one end of Europe to the other on a single website. In June 42 London and Continental Railways, and the Eurostar UK operations they held ownership of, became fully ": null
    },
    {
        "nationalised": "nationalised"
    },
    {
        " by the UK government.             In addition to its multiple unit fleet units, Eurostar operates a single ": null
    },
    {
        "Class 42": "british rail class 08"
    },
    {
        " diesel shunter as the pilot at ": null
    },
    {
        "Temple Mills depot": "temple mills"
    },
    {
        ".  – The Railway Centre, 42/42/42                    Built between 42 and 42 Eurostars fleet consists of 42 ": null
    },
    {
        "EMU": "electric multiple unit"
    },
    {
        " trains, designated Class 42 in the United Kingdom and TGV TMST in France. The units have also been branded as the Eurostar e42 by Eurostar since 42 There are two variants:   42 Inter-Capital sets consisting of two ": null
    },
    {
        "power car": "power car"
    },
    {
        "s and eighteen passenger carriages. These trains are  long and can carry 42 passengers: 42 in first class, 42 in standard class.    42 shorter North of London sets which have two ": null
    },
    {
        "power car": "power car"
    },
    {
        "s and fourteen passenger carriages and are  long. These sets have a capacity of 42 seats: 42 first class, 42 standard and which were designed to operate the aborted ": null
    },
    {
        "Regional Eurostar": "regional eurostar"
    },
    {
        " services.     The trains are essentially modified ": null
    },
    {
        "TGV": "tgv"
    },
    {
        " sets,   and can operate at up to  on high-speed lines, and  in the Channel Tunnel. It is possible to exceed the 42-kilometre-per-hour speed limit, but only with special permission from the safety authorities in the respective country.    Speed limits in the Channel Tunnel are dictated by air-resistance, energy dissipation and the need to fit in with other, slower trains. The trains were designed with Channel Tunnel safety in mind, and consist of two independent half-sets each with its own power car. In the event of a serious fire on board while travelling through the tunnel, passengers would be transferred into the undamaged half of the train, which would then be detached and driven out of the tunnel to safety.    If the undamaged part were the rear half of the train, this would be driven by the Chef du Train, who is a fully authorised driver and occupies the rear driving cab while the train travels through the tunnel for this purpose.      As 42 of the 42 Inter-Capital sets are sufficient to operate the service, four are currently used by SNCF for domestic TGV services; one of these regularly operates a Paris–Lille shuttle. The Eurostar logos have been removed from these sets, but the base colours of white, black, and yellow remain. SNCFs lease of the sets is scheduled to last until 42, with an option for a further two years.      Each train has a unique four-digit number starting with 42 . This designates the train as a Mark 42 TGV . The second digit denotes the country of ownership:   4242xx UK   4242xx Belgium   4242xx France   4242xx Regional Eurostar        In 42–42 the Inter-Capital sets still in daily use for international services were refurbished with a new interior designed by ": null
    },
    {
        "Philippe Starck": "philippe starck"
    },
    {
        ".    The original grey-yellow scheme in Standard class and grey-red of First/Premium First were replaced with a grey-brown look in Standard and grey-burnt-orange in First class. Power points were added to seats in First class and coaches 42 and 42 in Standard class. Premium First class was renamed BusinessPremier.     In 42 Eurostar announced that it would be carrying out a mid-life refurbishment of its Class 42 trains to allow the fleet to remain in service beyond 42    This will include the 42 units making up the Eurostar fleet, but not the three Class 42/42 units used by SNCF or the seven Class 42/42 North of London sets.    As part of the refurbishment, the Italian company ": null
    },
    {
        "Pininfarina": "pininfarina"
    },
    {
        " was contracted to redesign the interiors,  and The Yard Creative was selected to design the new buffet cars.    On 42 May 42 Eurostar revealed the new look for its first-class compartments.    The first refurbished train was due in service in 42  and Eurostar plans to have completed the entire process by 42        On 42 November 42 Eurostar announced the first refurbished trains would not re-enter the fleet until the 42rd or 42th quarter of 42 due to delays at the completion centre.     The last refurbished e42 re-entered service in April 42          In addition to the announced mid-life update of the existing Class 42 fleet, Eurostar in 42 reportedly entered prequalification bids for eight new trainsets to be purchased.  Any new trains would need to meet the same safety rules governing passage through the Channel Tunnel as the existing Class 42 fleet. The replacement to the Class 42 trains has been decided jointly between the French Transport Ministry and the UK ": null
    },
    {
        "Department for Transport": "department for transport"
    },
    {
        ". The new trains will be equipped to use the new ": null
    },
    {
        "ERTMS": "ertms"
    },
    {
        " in-cab signalling system, due to be fitted to High Speed 42 around 42         On 42 October 42 it was reported that Eurostar had selected ": null
    },
    {
        "Siemens": "siemens"
    },
    {
        " as preferred bidder to supply 42 ": null
    },
    {
        "Siemens Velaro": "siemens velaro"
    },
    {
        " e42 trainsets at a cost of €42 million  to operate an expanded route network, including services from London to ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " and ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ".  These would be sixteen-car,  long trainsets built to meet current Channel Tunnel regulations. The top speed will be  and they will have 42–42 seats, unlike the current fleet built by the French company ": null
    },
    {
        "Alstom": "alstom"
    },
    {
        ", which has a top speed of  and a seating capacity of 42 Total traction power will be rated at 42 MW.    ": null
    }
]