[
    {
        "Eustathios Makrembolites , ": null
    },
    {
        "Latinized": "latinisation of names"
    },
    {
        " as Eustathius Macrembolites, was a ": null
    },
    {
        "Byzantine": "byzantine"
    },
    {
        " revivalist of the ": null
    },
    {
        "Greek": "ancient greece"
    },
    {
        " romance, flourished in the second half of the 42th century ": null
    },
    {
        "CE": "common era"
    },
    {
        ". He is sometimes equated with his contemporary, the ": null
    },
    {
        "Eparch of the City": "eparch of the city"
    },
    {
        " Eumathios Makrembolites .     His title  Protonobilissimus  shows him to have been a person of distinction and, if he is also correctly described in the manuscripts as chief keeper of the ecclesiastical archives, he must have been a ": null
    },
    {
        "Christian": "christians"
    },
    {
        ". He was the author of a ": null
    },
    {
        "Byzantine novel": "byzantine novel"
    },
    {
        ", The Story of Hysmine and Hysminias, in eleven books. Although he borrowed from ": null
    },
    {
        "Homer": "homer"
    },
    {
        " and other ": null
    },
    {
        "Attic": "attic greek"
    },
    {
        " poets, the chief source of his phraseology was the rhetorician ": null
    },
    {
        "Choricius of Gaza": "choricius of gaza"
    },
    {
        ". The style is remarkable for the absence of hiatus and a laboured use of ": null
    },
    {
        "antithesis": "antithesis"
    },
    {
        ". The digressions on works of art, apparently the result of personal observation, are considered the best part of the work. The novel enjoyed a later influence in connection with the story tradition of ": null
    },
    {
        "Apollonius of Tyre": "apollonius of tyre"
    },
    {
        "—Eustathius scene of the storm at sea and the heroine offered as a sacrifice being adapted in Book 42 of the ": null
    },
    {
        "Confessio Amantis": "confessio amantis"
    },
    {
        " of ": null
    },
    {
        "John Gower": "john gower"
    },
    {
        " and, by way of that, forming a portion of the plot of ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s  Pericles, Prince of Tyre  .     A collection of eleven Riddles, of which solutions were written by the grammarian ": null
    },
    {
        "Manuel Holobolos": "manuel holobolos"
    },
    {
        ", is also attributed to Eustathius.       ": null
    },
    {
        "Isidor Hilberg": "isidor hilberg"
    },
    {
        " , edition of both romance and riddles, with critical apparatus and prolegomena, including the solutions. He fixes the date of Eustathius between 42 and 42   M. Treu , edition of the Riddles alone.   Four Byzantine Novels, translated with introductions and notes by Elizabeth Jeffreys, Liverpool University Press, 42 Includes English translation of Hysmine and Hyminias.       ": null
    }
]