[
    {
        "     Everybody Loves Raymond is an American ": null
    },
    {
        "sitcom": "sitcom"
    },
    {
        " television series created by ": null
    },
    {
        "Philip Rosenthal": "philip rosenthal"
    },
    {
        " that aired on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " from September 42 42 to May 42 42 with a total of 42 episodes spanning over nine seasons. It was produced by ": null
    },
    {
        "Wheres Lunch": "philip rosenthal"
    },
    {
        " and ": null
    },
    {
        "Worldwide Pants": "worldwide pants"
    },
    {
        ", in association with ": null
    },
    {
        "HBO Independent Productions": "hbo"
    },
    {
        ". The cast members are ": null
    },
    {
        "Ray Romano": "ray romano"
    },
    {
        ", ": null
    },
    {
        "Patricia Heaton": "patricia heaton"
    },
    {
        ", ": null
    },
    {
        "Brad Garrett": "brad garrett"
    },
    {
        ", ": null
    },
    {
        "Doris Roberts": "doris roberts"
    },
    {
        ", ": null
    },
    {
        "Peter Boyle": "peter boyle"
    },
    {
        ", ": null
    },
    {
        "Madylin Sweeten": "madylin sweeten"
    },
    {
        ", and ": null
    },
    {
        "Monica Horan": "monica horan"
    },
    {
        ". Most episodes of the nine season series were filmed in front of a ": null
    },
    {
        "live studio audience": "studio audience"
    },
    {
        ", with a few exceptions.          The show is centered on the life of an ": null
    },
    {
        "Italian-American": "italian-american"
    },
    {
        " everyman": "everyman"
    },
    {
        " named Raymond Barone, a ": null
    },
    {
        "sportswriter": "sportswriter"
    },
    {
        " for  Newsday  living with his family on ": null
    },
    {
        "Long Island": "long island"
    },
    {
        ". Beleaguered, diffident and dryly ": null
    },
    {
        "sarcastic": "sarcasm"
    },
    {
        ", Raymond takes few things seriously, making jokes in nearly every situation, no matter how troubling or serious. He often avoids responsibilities around the house and with his kids, leaving this to wife, Debra.     Raymond and Debra have a daughter Ally and twin sons Michael and Geoffrey . The Barone children are regular characters but not a major focus. Raymonds parents, Marie and Frank, live across the street with older son Robert . All Barone relatives frequently make their presence known to the annoyance of Raymond and Debra; Debras justifiable complaints about Raymonds overbearing family serve as one of the shows comedic elements. Out of the three unwanted visitors, Debra is particularly intimidated by Marie, an ": null
    },
    {
        "insulting": "spite"
    },
    {
        ", controlling, ": null
    },
    {
        "manipulative": "psychological manipulation"
    },
    {
        " woman who criticizes Debra passive-aggressively and praises Ray, clearly favoring him over other son Robbie, whose birth necessitated her marriage .     Raymond typically falls in the middle of family arguments, incapable of taking any decisive stand, especially if it might invoke his mothers disapproval. Robert, a miserable gentle giant, jealous of his younger siblings position as favorite son and also of the success his brother has achieved both professionally and personally, is Rays biggest rival. Robert and Raymond frequently argue like overgrown children, focusing much of their energy on ": null
    },
    {
        "picking on": "bullying"
    },
    {
        " or one upping each other, although deep down they love each other dearly.     Frank Barone is a fiery retiree prone to directing insults and merciless put-downs at any and all targets. Largely an absentee father when the boys were growing up, Frank buries his feelings and rarely yields to sentiment. As the series progresses, however, several episodes demonstrate that the senior Barone loves his family immensely. Unlike everyone else, Frank has no problem comically criticizing Marie and often comes to Debras defense whenever Marie comments disparagingly about their daughter-in-law.     Raymond and Debras marriage is fraught with conflicts. Raymond prefers ": null
    },
    {
        "sports television": "sports television"
    },
    {
        " over discussions with Debra on marital matters. Like his father, Raymond works full-time, leaving most child-rearing responsibilities to his wife; and he is often forced to help around the house. One of the shows recurring elements finds the couple having a long discussion in bed each night before going to sleep.                  ": null
    },
    {
        "Raymond Ray Barone": "ray barone"
    },
    {
        "  is a sportswriter for  Newsday . He lives in ": null
    },
    {
        "Lynbrook": "lynbrook, new york"
    },
    {
        ", ": null
    },
    {
        "Long Island": "long island"
    },
    {
        " with his wife, Debra, and their three children Alexandra , Geoffrey, and Michael. His parents Frank & Marie and brother Robert live across the street. Raymonds character is loosely based on the real-life Romano, as he is the father of twin boys and a girl. Ray is emotionally unable to take any sort of stand on anything, especially if it brings him to any sort of conflict with his mother—the exception is when he protests about sex or some trivial matter. Raymonds mother favors him over Robert.   ": null
    },
    {
        "Debra Barone": "debra barone"
    },
    {
        "  is Raymonds wife, and mother of Ally, Michael and Geoffrey. As a housewife, Debra claims she is frequently overworked, underappreciated, and stressed out. This leads to her yelling and occasionally attacking inanimate objects, largely because she has to deal with all the housework and her three rambunctious children with almost no assistance or support from Raymond; additionally, she constantly puts up with Maries intrusiveness and criticism. On frequent occasions this frustration boils over and is vented towards Raymond. While Debra has a fractious relationship with Marie, she is shown to share many tender moments with Robert, and occasionally Frank.   ": null
    },
    {
        "Robert Barone": "robert barone"
    },
    {
        "  is Raymonds older brother and the son of Frank and Marie. Standing at 42½ , he is the tallest Barone, and has several quirks, the biggest being a nervous habit of touching food to his chin before eating it, once referred to as crazy chin. Robert is often jealous of the attention that Raymond receives from their mother, to the exclusion of his every achievement. Robert has been a ": null
    },
    {
        "New York City police": "new york city police department"
    },
    {
        " officer for over 42 years and attains the rank of lieutenant by the end of the series. His height, appearance, and depressed demeanor are the source of much humor. However, despite his imposing size, Robert is a very skilled dancer. Divorced from first wife Joanne prior to the beginning of the series, he is frequently unlucky with women, until his on-off relationship with his girlfriend Amy McDougall finally results in marriage.   ": null
    },
    {
        "Marie Barone": "marie barone"
    },
    {
        "  is Raymond and Roberts mother and the wife of Frank. Intrusive, controlling, manipulative, and over-nurturing , she is a housewife who excels in cooking, cleaning, and other things dealing with keeping a good home and family. Marie and Frank live across the street from Raymond and Debra in ": null
    },
    {
        "Lynbrook": "lynbrook, new york"
    },
    {
        ", ": null
    },
    {
        "Long Island": "long island"
    },
    {
        ", New York which often irritates the latter couple. Maries meddling tendencies include going through their mail, redoing their laundry, and upstaging Debra in the kitchen. She also goes to great lengths to control Roberts love life and get him to settle down and bring her more grandchildren.   ": null
    },
    {
        "Francis Frank Barone": "frank barone"
    },
    {
        "  is Raymonds father and Maries husband, a retired ": null
    },
    {
        "bookkeeper": "bookkeeper"
    },
    {
        ", and registered real estate agent, with a stubborn masculine personality and no interest in personal hygiene. A ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " veteran": "veteran"
    },
    {
        ", Frank served in the ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        ", which he frequently brings up to everyones annoyance. He mocks his sons inability to handle their own personal and domestic problems; unlike his sons, he is not intimidated by Marie and disparages her regularly with little to no provocation. Although both he and Marie maintain that he only married her for her cooking, he is shown to care about her genuinely. He is a member of the Order of the Caribou Lodge, and was named Man of the Year by his fellow members.   Amy McDougall/Barone  becomes Robert Barones second wife , and is the best friend of Debra, who introduces her to Robert. A recurring character for the first seven seasons of the series, Amy became essentially a regular cast member for the remainder of the shows run. However, Horans name did not get added to the opening credits until the final season. Many issues cause Amy and Robert to break up in the first six seasons, with one being caused by Raymond, and another happening because Robert was seeing other women, one of whom was his ex-wife. Quite often, Amy apologizes to someone even if she did not do anything wrong. She was born to very religious parents who, according to Amy, wouldnt yell if they were on fire. In real life, Horan is the wife of creator/executive producer ": null
    },
    {
        "Philip Rosenthal": "philip rosenthal"
    },
    {
        ".   Alexandra Ally Barone  is the daughter of Raymond and Debra. She is the oldest of the Barone children. She is not seen much, even though she is credited in the main cast. She is said to be a better cook than her mother, and maybe someday her grandmother. In real life, Madylin is the sister of Sawyer and Sullivan Sweeten.   Geoffrey Barone  and Michael Barone are the twin sons of Raymond and Debra. Their names in the pilot were Gregory and Matthew. In real life, twins Sawyer and Sullivan are brothers of Madylin Sweeten.     The King of Queens ": null
    },
    {
        "Kevin James": "kevin james"
    },
    {
        " was an actor and writer on Everybody Loves Raymond. Once James got his own show,  The King of Queens , the two shows crossed over.     The first crossover happened on The King of Queens. In it, ": null
    },
    {
        "Ray Barone": "ray barone"
    },
    {
        " and ": null
    },
    {
        "Doug Heffernan": "doug heffernan"
    },
    {
        " become friends. Later on the same night, Kevin James showed up on Everybody Loves Raymond as Doug Heffernan.  The shows would go on to crossover several more times.     There are two ": null
    },
    {
        "continuity errors": "continuity errors"
    },
    {
        " in this universe. Kevin James played a different character in earlier seasons of Everybody Loves Raymond than on The King of Queens. The second one is that ": null
    },
    {
        "Chris Elliott": "chris elliott"
    },
    {
        " appeared as one character on Everybody Loves Raymond, and another on The King of Queens.           In 42 series creator/producer ": null
    },
    {
        "Philip Rosenthal": "philip rosenthal"
    },
    {
        " traveled to Russia to adapt the show for local audiences. His experience was documented by a film crew and released as the ": null
    },
    {
        "documentary": "documentary"
    },
    {
        " feature  Exporting Raymond .     The Russian version is titled  Воронины  .         The show was adapted in Poland under the title  Wszyscy kochają Romana  .  It was picked up by ": null
    },
    {
        "TVN": "tvn"
    },
    {
        " and premiered on September 42 42 However, due to low ratings , the station put the show on hiatus after four episodes.      In Egypt, a sitcom called El Bab Fil Bab , which means Close Doors in ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        ", is produced by ": null
    },
    {
        "Sony Pictures Television": "sony pictures television"
    },
    {
        ", translating Everybody Loves Raymond with minor changes to adapt the Eastern Culture. The first season aired in the month of ": null
    },
    {
        "Ramadan": "ramadan"
    },
    {
        " 42; second season in 42     A Dutch remake called Iedereen is gek op Jack  premiered in February 42 The second season started airing in March 42 and ended in May 42     An Israeli remake called Mishpacah Lo Bochrim    premiered in October 42 and was cancelled after 42 episodes aired.     A pilot for a British remake, titled The Smiths, has been commissioned to be produced for ": null
    },
    {
        "BBC One": "bbc one"
    },
    {
        " and was filmed in May 42 at Elstree Studios. ": null
    },
    {
        "Lee Mack": "lee mack"
    },
    {
        " wrote and starred in the pilot, as Michael Smith. The pilot also starred ": null
    },
    {
        "Catherine Tate": "catherine tate"
    },
    {
        ", Tom Davis, ": null
    },
    {
        "Gwen Taylor": "gwen taylor"
    },
    {
        " and ": null
    },
    {
        "David Troughton": "david troughton"
    },
    {
        ". Tartaglione, Nancy.   Deadline Hollywood  .     An Indian remake, titled ": null
    },
    {
        "Sumit Sambhal Lega": "sumit sambhal lega"
    },
    {
        " , premiered on August 42 42 on ": null
    },
    {
        "STAR Plus": "star plus"
    },
    {
        ".     A Czech remake called Rudyho Má Každý Rád premiered on ČT42 on August 42 42 comprising 42 episodes.          The show reruns in ": null
    },
    {
        "syndication": "broadcast syndication"
    },
    {
        " on various channels, such as ": null
    },
    {
        "TBS": "tbs"
    },
    {
        " and ": null
    },
    {
        "TV Land": "tv land"
    },
    {
        ", and in most TV markets on local stations.  Paramount Comedy. The show is still broadcast regularly in the UK. From 42 to 42 ": null
    },
    {
        "King World": "king world productions"
    },
    {
        " distributed the show for off-network syndication and ": null
    },
    {
        "Warner Bros. International Television": "warner bros. international television"
    },
    {
        " handled international distribution. In 42 ": null
    },
    {
        "CBS Television Distribution": "cbs television distribution"
    },
    {
        " took over King Worlds distribution. CBS only owns American syndication rights; ancillary rights are controlled by ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " and ": null
    },
    {
        "Warner Bros. Television": "warner bros. television"
    },
    {
        " . The show airs every morning on ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " in the United Kingdom.     Everybody Loves Raymond has aired in the UK on ABC42 & Disney Channel. And in Australia on ": null
    },
    {
        "Seven Network": "seven network"
    },
    {
        " , on ": null
    },
    {
        "Network Ten": "network ten"
    },
    {
        " , on ": null
    },
    {
        "Eleven": "eleven"
    },
    {
        " and on Foxtels Pay TV network ": null
    },
    {
        "TVH!TS": "tvh!ts"
    },
    {
        " previously called ": null
    },
    {
        "TV42": "tv1"
    },
    {
        " . The show reruns in India on the channel Romedy Now.       ": null
    },
    {
        "HBO": "hbo home videohome video"
    },
    {
        " released the Complete Series of Everybody Loves Raymond on DVD in Regions 42 42 and 42 Region 42 Complete Box Set was released on August 42 42 In Australia, the first five seasons were re-released in 42 in slimmer packaging . Also, some were released with a cardboard slip cover. Also, in North America, the first two seasons were each re-released in 42 in standard keep cases with cardboard slipcovers in a double-season pack. It is unknown whether or not they will be sold individually like this. Also, in 42 the sixth and seventh season two-pack was reissued in the keep case packaging. Recently, Season 42 was re-released in standard keep cases. It is also unknown whether or not the remaining seasons will be reissued in the slimmer packaging. As of September 42 all episodes are available on Netflix for streaming. Also on September 42 42 The Complete 42st Season was released on VHS. The sixth-season DVD set contained the episode ": null
    },
    {
        "Maries Sculpture": "everybody loves raymond"
    },
    {
        " , which previously had not aired in the United Kingdom and was not released until almost five years after the end of the 42th season.                Two  Entertainment Weekly  reviews of the show have been posted. Ken Tuckers review shortly after the shows debut awarded it a B+; he stated the shows writing wasnt top-notch , but Romano manages to communicate something distinctive. Tucker, Ken . .  Entertainment Weekly . Retrieved May 42 42 A 42 review by Bruce Fretts, which gave the show the same score, said that the show may now be the best sitcom on the air. Fretts, Bruce . .  Entertainment Weekly . Retrieved May 42 42 ": null
    },
    {
        "Common Sense Media": "common sense media"
    },
    {
        "s Betsy Wallace, who awarded the show four out of five stars, wrote: the cast is stellar and plotlines shed light on universal human insecurities, such as doubting that your spouse still finds you attractive as you grow older. However, she warned that the shows intimacy issues of married couples -- including frequency of sex -- often take center stage, as well as the shows mild language. Wallace, Betsy. . ": null
    },
    {
        "Common Sense Media": "common sense media"
    },
    {
        ". Retrieved May 42 42 ": null
    },
    {
        "Plugged In": "plugged in"
    },
    {
        " said in their review, Seven years and a mantle full of Emmys later, Raymond is still smartly scripted, now with new characters added to a maturing, expanding family. Isaac, Steven. . ": null
    },
    {
        "Plugged In": "plugged in"
    },
    {
        ". Retrieved May 42 42 In 42  Complex  ranked the show as 42th of The 42 Funniest TV Comedies of All Time , with writer Matt Barone saying that Youd want to pat Ray on the shoulder and say, We feel for you, man, if you werent laughing so hard.  Also in 42  TV Guide  ranked it 42 on its list of the 42 Best Series of All Time .             During its nine seasons, Everybody Loves Raymond was nominated for 42 ": null
    },
    {
        "Primetime Emmy Award": "primetime emmy award"
    },
    {
        "s, winning 42 of them, including 42 for acting. The series was also nominated for 42 ": null
    },
    {
        "Screen Actors Guild Award": "screen actors guild award"
    },
    {
        "s and won the ": null
    },
    {
        "Writers Guild of America Award": "writers guild of america award"
    },
    {
        " for ": null
    },
    {
        "Episodic Comedy": "writers guild of america award for television: episodic comedy"
    },
    {
        " for ": null
    },
    {
        "Italy": "italy"
    },
    {
        " in 42       :Note: Each U.S. network television season starts in late September and ends in late May, which coincides with the completion of May sweeps . All times mentioned in this section were Eastern & Pacific     The series finale scored a 42 household rating, 42 million viewers  and an 42 rating among adults 42–42 At 42pm, Everybody Loves Raymond: The Last Laugh averaged a 42 household rating, 42 million viewers and a 42 among adults 42–42 Throughout the latter six seasons of the show, Everybody Loves Raymond maintained its position on the top ten rankings.     The highest average rating for the series is in italic text.   ": null
    }
]