[
    {
        "   Everett McKinley Dirksen was an ": null
    },
    {
        "American": "americans"
    },
    {
        " politician. A member of the ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        ", he represented ": null
    },
    {
        "Illinois": "illinois"
    },
    {
        " in the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        " and the ": null
    },
    {
        "United States Senate": "united states senate"
    },
    {
        ". As ": null
    },
    {
        "Senate Minority Leader": "party leaders of the united states senate"
    },
    {
        " from 42 to 42 he played a highly visible and key role in the politics of the 42s. He helped write and pass the ": null
    },
    {
        "Civil Rights Act of 42": "civil rights act of 1964"
    },
    {
        " and the ": null
    },
    {
        "Civil Rights Act of 42": "civil rights act of 1968"
    },
    {
        ", both landmark pieces of legislation during the ": null
    },
    {
        "Civil Rights Movement": "civil rights movement"
    },
    {
        ". He was also one of the Senates strongest supporters of the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". A talented orator with a florid style and a notably rich baritone voice, his flamboyant speeches caused his detractors to refer to him as The Wizard of Ooze .     Born in ": null
    },
    {
        "Pekin, Illinois": "pekin, illinois"
    },
    {
        ", Dirksen served as an artillery officer during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " and opened a bakery after the war. After serving on the Pekin City Council, he won election to the House of Representatives in 42 In the House, he was considered a moderate and supported much of the ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        "; he became more conservative and isolationist over time, but reversed himself to support US involvement in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". He won election to the Senate in 42 unseating Senate Majority Leader ": null
    },
    {
        "Scott W. Lucas": "scott w. lucas"
    },
    {
        ". In the Senate, he favored ": null
    },
    {
        "conservative": "conservatism in the united states"
    },
    {
        " economic policies and supported the ": null
    },
    {
        "internationalism": "internationalism"
    },
    {
        " of President ": null
    },
    {
        "Dwight D. Eisenhower": "dwight d. eisenhower"
    },
    {
        ". Dirksen succeeded ": null
    },
    {
        "William F. Knowland": "william f. knowland"
    },
    {
        " as Senate Minority Leader after the latter declined to seek re-election in 42     As the Senate Minority Leader, Dirksen emerged as a prominent national figure of the Republican Party during the 42s. He developed a good working relationship with Senate Majority Leader ": null
    },
    {
        "Mike Mansfield": "mike mansfield"
    },
    {
        " and supported President ": null
    },
    {
        "Lyndon B. Johnson": "lyndon b. johnson"
    },
    {
        "s handling of the Vietnam War. He helped break the ": null
    },
    {
        "Southern": "southern united states"
    },
    {
        " filibuster": "filibuster in the united states"
    },
    {
        " of the Civil Rights Act of 42 While still serving as Senate Minority Leader, Dirksen died in 42       Dirksen was born in ": null
    },
    {
        "Pekin": "pekin, illinois"
    },
    {
        ", Illinois, a small city near ": null
    },
    {
        "Peoria": "peoria, illinois"
    },
    {
        ", He was the son of German immigrants from East Frisia , Antje born in Loquard, and Johann Friedrich Dirksen, born in Jennelt. Everetts parents gave him the middle name McKinley for President ": null
    },
    {
        "William McKinley": "william mckinley"
    },
    {
        ". He had a fraternal twin, Thomas Reed Dirksen , and another brother, Benjamin, named for President ": null
    },
    {
        "Benjamin Harrison": "benjamin harrison"
    },
    {
        ". Johann and Antje Dirksen spoke a ": null
    },
    {
        "Low German": "low german"
    },
    {
        " dialect at home, and taught German to their children, but Johann had lived in the United States long enough to become politically aware; the names of all three boys were a nod to his ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        " leanings. Johann Dirksen, who worked at the Pekin Wagon Works as a design painter in addition to farming, had a debilitating stroke when Everett Dirksen was five years old, and he died when Everett Dirksen was nine. He had been Antjes second husband; with her first husband, Beren Ailts , she was the mother of two sons, Everett Dirksens half brothers Thomas and Henry.     Dirksen grew up on a farm managed by his mother on Pekins outskirts, in a neighborhood called Bonchefiddle, ": null
    },
    {
        "Low German": "low german"
    },
    {
        " for Beantown , because frugal immigrants grew beans for the family dinner table in their front yards instead of decorative flowers. He attended the local schools, graduated from Pekin High School in 42 as the class salutatorian, and helped support the family by working at a Pekin corn refining factory. A visit to the Minnesota home of one of his half brothers led to Dirksens attendance at the ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        ". He was a ": null
    },
    {
        "pre-law": "pre-law"
    },
    {
        " student from 42 to 42 and paid his tuition by working in the classified advertising department at the  Minneapolis Tribune , and as a door-to-door magazine and book salesman, an attorneys assistant, and a clerk in a railroad freight office. While attending college, Dirksen participated in the ": null
    },
    {
        "Student Army Training Corps": "reserve officers training corpsstudent army training corps"
    },
    {
        ", and attained the rank of major in the schools corps of cadets. He also gained his first political experience by giving local and on-campus speeches in support of Republican nominee ": null
    },
    {
        "Charles Evans Hughes": "charles evans hughes"
    },
    {
        " during the ": null
    },
    {
        "42 campaign for president": "1916 united states presidential election"
    },
    {
        ".       At the start of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", Benjamin Dirksen was medically unfit for military service, and Thomas was married. With the Dirksens under local scrutiny because of their German heritage—Dirksens mother refused to take down a living room photo of ": null
    },
    {
        "Kaiser Wilhelm II": "wilhelm ii, german emperor"
    },
    {
        ", as demanded by a self-appointed Pekin loyalty commission , on the grounds that its a free country —it fell to Everett Dirksen to demonstrate the familys patriotism by serving in uniform.     Dirksen dropped out of college to enlist in the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        ". On January 42 42—his twenty-first birthday—Dirksen joined the Army. He completed his initial training in field artillery at ": null
    },
    {
        "Camp Custer": "camp custer"
    },
    {
        ", ": null
    },
    {
        "Michigan": "michigan"
    },
    {
        ", performed duty with his unit at ": null
    },
    {
        "Camp Jackson": "fort jackson"
    },
    {
        ", ": null
    },
    {
        "South Carolina": "south carolina"
    },
    {
        ", and attained the rank of sergeant. Dirksen went to France in 42 and attended the artillery school and ": null
    },
    {
        "officer training": "officer candidate school"
    },
    {
        " at ": null
    },
    {
        "Saumur": "saumur"
    },
    {
        ". He was commissioned as a ": null
    },
    {
        "second lieutenant": "second lieutenantunited states"
    },
    {
        ", and assigned to the 42th Field Artillery Regiment, a unit of the ": null
    },
    {
        "42th Division": "85th infantry division"
    },
    {
        ". Dirksen was trained as an aerial observer, and conducted ": null
    },
    {
        "target acquisition": "target acquisition"
    },
    {
        " and ": null
    },
    {
        "assessment": "bomb damage assessment"
    },
    {
        " of field artillery bombardments in the ": null
    },
    {
        "Saint-Mihiel": "saint-mihiel"
    },
    {
        " sector as a member of the 42th Field Artillerys 42th and 42th ": null
    },
    {
        "Balloon Companies": "history of military ballooningworld war i"
    },
    {
        ". He later performed the same duty for the 42th Balloon Company, a unit of the ": null
    },
    {
        "IV Corps": "iv corps"
    },
    {
        ". He subsequently served in the Intelligence staff section of the IV Corps headquarters. Dirksen performed ": null
    },
    {
        "post-war occupation": "allied occupation of the rhineland"
    },
    {
        " duty with IV Corps in Germany until mid42 Offered the opportunity to remain with the Army of Occupation because of his fluency in German, Dirksen declined, received his discharge, and returned to Pekin.       He was a member of the ": null
    },
    {
        "Reformed Church in America": "reformed church in america"
    },
    {
        ", founded in the 42th century by Dutch immigrants. Donald J. Bruggink and Kim N. Baker, By Grace Alone: Stories of the Reformed Church in America p. 42     After the war, Dirksen invested money in an electric washing machine business, but it failed, after which he joined his brothers in running the Dirksen Brothers Bakery. He expressed his artistic side by writing a number of unpublished short stories, as well as plays with former classmate Hubert Ropp. In addition, Dirksen was active in the ": null
    },
    {
        "American Legion": "american legion"
    },
    {
        ", and appearances on its behalf gave him the opportunity to hone his public speaking skills.      His political career began in 42 when he was elected to the nonpartisan Pekin City Council. He placed first in field of eight candidates vying for four seats. At the time, the top votegetter also received appointment as the citys commissioner of accounts and finance, and Dirksen held both posts from 42 to 42      Dirksen was a ": null
    },
    {
        "Freemason": "freemason"
    },
    {
        " and was a member of Pekin Lodge 42 in Pekin. In 42 he was Grand Orator of the Grand Lodge of Illinois. He was honored with the ": null
    },
    {
        "42rd degree": "33rd degree"
    },
    {
        " in 42        After losing in the 42 Republican primary to represent ": null
    },
    {
        "Illinoiss 42th congressional district": "illinoiss 16th congressional district"
    },
    {
        ", Dirksen won the nomination and the congressional seat in 42 and was re-elected seven times. His support for many ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        " programs initially marked him as a moderate, pragmatic Republican, though over time he became increasingly conservative and isolationist.   During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", he lobbied successfully for an expansion of congressional staff resources to eliminate the practice under which House and Senate committees borrowed executive branch personnel to accomplish legislative work. He reversed his isolationist stance to support the war effort, but also secured the passage of an amendment to the ": null
    },
    {
        "Lend Lease Act": "lend lease act"
    },
    {
        " by introducing it while 42 of the Houses Democrats were at a luncheon. It provided that the Senate and the House could, by a simple majority in a ": null
    },
    {
        "concurrent resolution": "concurrent resolution"
    },
    {
        ", revoke the war powers granted to the President. Everett Dirksen, Current Biography 42, p.42; 42 to 42 , TIME Magazine, February 42 42     Dirksens penchant for changing his mind was noted by the  Chicago Sun-Times , which once noted that he had changed his mind 42 times on foreign policy matters, 42 times on military affairs, and 42 times on agricultural policies.     Dirksen studied law privately in ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        " after he was elected to Congress. He was admitted to the District of Columbia Bar in 42 and the bar of Illinois in 42     In December 42 Dirksen announced that he would be a candidate for the Republican presidential nomination in 42 He stated that a coalition of midwestern Republican representatives had urged him to run and that his campaign was serious. However, press pundits had assumed that the candidacy was a vehicle to siphon support away from the campaign of ": null
    },
    {
        "Wendell Willkie": "wendell willkie"
    },
    {
        ", whose reputation as a maverick and staunch internationalist had earned him the hatred of many Republican Party regulars, especially in the ": null
    },
    {
        "Midwest": "midwest"
    },
    {
        ". Time Magazine, December 42 42 Dirksens presidential campaign was apparently still alive on the eve of the 42 convention, as Time speculated that he was running for vice-president. Time, June 42 42 Dirksen received no votes for either office from delegates at the convention.     Dirksen continued to be re-elected. In 42 he began to experience trouble in his right eye, which was diagnosed as ": null
    },
    {
        "chorioretinitis": "chorioretinitis"
    },
    {
        ". Despite a number of physicians  recommending that the eye be removed, Dirksen chose treatment and rest; he recovered most of the sight in the afflicted eye. In 42 he declined to run for re-election because of his ailment. He returned to politics two years later and was elected to the U.S. Senate.             Dirksen was elected as senator in 42 when he unseated Senate Majority Leader ": null
    },
    {
        "Scott W. Lucas": "scott w. lucas"
    },
    {
        ". In the campaign, the support of ": null
    },
    {
        "Wisconsin": "wisconsin"
    },
    {
        " Senator ": null
    },
    {
        "Joseph McCarthy": "joseph mccarthy"
    },
    {
        " helped Dirksen gain a narrow victory. As an ally of McCarthy, Dirksen tried but failed to get him to apologize for his misdeeds to stave off his censure in 42 which Dirksen voted against. Dirksens canny political skill, rumpled appearance, and convincing if sometimes flowery overblown oratory earned him a prominent national reputation.     In 42 Dirksen supported the presidential candidacy of fellow Senator ": null
    },
    {
        "Robert A. Taft": "robert a. taft"
    },
    {
        " of ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        ", the longtime leader of the Republican partys conservative wing. At the national party convention, Dirksen gave a speech attacking New York Governor ": null
    },
    {
        "Thomas E. Dewey": "thomas e. dewey"
    },
    {
        ", a liberal Republican and the leading supporter of General ": null
    },
    {
        "Dwight Eisenhower": "dwight eisenhower"
    },
    {
        ", the commander of the Allied forces in Europe in World War II and Tafts opponent for the Republican presidential nomination. During his speech, Dirksen pointed at Dewey on the convention floor and shouted, Dont take us down the path to defeat again,  a reference to Deweys presidential defeats in 42 and 42 His speech was met by cheers from conservative delegates and loud boos from pro-Eisenhower delegates. After Eisenhower won the nomination, Dirksen then supported him.     In 42 he was elected ": null
    },
    {
        "Senate Minority Leader": "united states senate minority leader"
    },
    {
        ", defeating ": null
    },
    {
        "Kentucky": "kentucky"
    },
    {
        "s more liberal senator, ": null
    },
    {
        "John Sherman Cooper": "john sherman cooper"
    },
    {
        ", 4242 Dirksen successfully united the various factions of the Republican Party by granting younger Republicans more representation in the Senate leadership and better committee appointments. He held the position of Senate Minority Leader until his death.     Along with ": null
    },
    {
        "Charles Halleck": "charles halleck"
    },
    {
        " and later, ": null
    },
    {
        "Gerald Ford": "gerald ford"
    },
    {
        ", his contemporaries as House Minority Leaders, Dirksen was the official voice of the Republican Party during most of the 42s. He discussed politics on television news programs. On several occasions, political cartoonist ": null
    },
    {
        "Herblock": "herblock"
    },
    {
        " depicted Dirksen and Halleck as vaudeville song-and-dance men, wearing identical elaborate costumes and performing an act called The Ev and Charlie Show.     Dirksens voting record was consistently conservative on economic issues. He developed a good rapport with the Senates majority leaders, ": null
    },
    {
        "Lyndon B. Johnson": "lyndon b. johnson"
    },
    {
        " and ": null
    },
    {
        "Mike Mansfield": "mike mansfield"
    },
    {
        ". On foreign policy he reversed his early isolationism to support the internationalism of Republican President Eisenhower and Democratic President ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        ". He was a leading hawk on the issue of the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", a position he held well before President Johnson decided to escalate the war.     Dirksen said in February 42:   First I agree that obviously we cannot retreat from our position in Vietnam. I have been out there three times, once as something of an emissary for then President Eisenhower. I took a good look at it. It is a difficult situation, to say the least. But we are in to the tune of some $42 million. I think the last figure I have seen indicates that we have over 42 military out there, ostensibly as advisers and that sort of thing. We are not supposed to have combatant troops, even though we were not signatories to the treaty that was signed at Geneva when finally they got that whole business out of the fire. But we are going to have to muddle through for a while and see what we do. Even though it costs us $42 million a day.         As Johnson followed the recommendations and escalated the war, Dirksen gave him strong support in public and inside the Republican caucus. Some Republicans advised him that it would be to the partys advantage to oppose Johnson. Ford commented, I strongly felt that although I agreed with the goals of the Johnson administration in Vietnam, I vigorously criticized their prosecution of the war. Now, Dirksen never took that same hard-line position that I took.           In 42 as Southern Democratic Senators staged a filibuster, which ran 42 days to block passage of the Civil Rights Act of 42 Dirksen, ": null
    },
    {
        "Thomas Kuchel": "thomas kuchel"
    },
    {
        " , ": null
    },
    {
        "Hubert Humphrey": "hubert humphrey"
    },
    {
        " , and ": null
    },
    {
        "Mike Mansfield": "mike mansfield"
    },
    {
        " introduced a substitute bill that they hoped would attract enough swing votes to end the filibuster. It was weaker than the House version, on the governments power to regulate the conduct of private business, but it was not so weak it would cause the House to reconsider the legislation. Also, the Department of Justice said the Mansfield-Dirksen Amendment would not prevent effective enforcement. However, Senator ": null
    },
    {
        "Richard Russell, Jr.": "richard russell, jr."
    },
    {
        " refused to allow a vote on the amendment. Finally, Senator ": null
    },
    {
        "Thruston Morton": "thruston morton"
    },
    {
        " proposed an amendment that guaranteed jury trials in all criminal contempt cases except voting rights. It was approved on June 42 and Humphrey made a deal with three Republicans to substitute it for the Mansfield-Dirksen Amendment in exchange for their supporting ": null
    },
    {
        "cloture": "cloture"
    },
    {
        " on the ": null
    },
    {
        "filibuster": "filibuster"
    },
    {
        ". Thus, after 42 days of filibuster, the substitute bill passed in the Senate, and the House–Senate conference committee agreed to adopt the Senate version of the bill. Library of Congress exhibition, The Civil Rights Act of 42     At that cloture vote, Dirksen said: ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        " wrote in his diary substantially this sentiment: Stronger than all the armies is an idea whose time has come. The time has come for equality of opportunity in sharing of government, in education, and in employment. It must not be stayed or denied.      On March 42 42 Dirksen introduced a constitutional amendment to permit ": null
    },
    {
        "public school": "public school"
    },
    {
        " administrators providing for organized prayer by students; the introduction was in response to  Engel v. Vitale , which struck down the practice. Considered by opponents to violate the principle of ": null
    },
    {
        "separation of church and state": "separation of church and state"
    },
    {
        ", the amendment was defeated in the Senate and gained only 42 affirmative votes, far short of the 42 votes a constitutional amendment needs for passage. Dirksen was a firm opponent of the doctrine of ": null
    },
    {
        "one man, one vote": "one man, one vote"
    },
    {
        " on the grounds that large cities  could render rural residents of a state powerless in their state governments; after the ": null
    },
    {
        "Warren Court": "warren court"
    },
    {
        " imposed one-man-one-vote on all state legislative houses in  Reynolds v. Sims , he led an effort to convene an ": null
    },
    {
        "Article V convention": "article v convention"
    },
    {
        " for an amendment to the Constitution that would allow for legislative districts of unequal population.  Dirksen died before enough states passed resolutions for the convention, by which point the court-ordered re-engineered legislatures began repealing their predecessors resolutions.     Dirksen is noted as saying, A billion here, a billion there, pretty soon, youre talking real money. Although there is no direct record of the remark, , The Dirksen Center.  he is believed to have made it during an appearance on  The Tonight Show Starring Johnny Carson . Dirksen is also quoted as having said, The mind is no match with the heart in persuasion; constitutionality is no match with compassion.           Dirksen was also known for his fondness for the ": null
    },
    {
        "common marigold": "tagetes"
    },
    {
        ". When political discussions became tense, he would lighten the atmosphere by taking up his perennial campaign to have the marigold named the national flower, but it never succeeded. In 42 his hometown of Pekin started holding an annual ": null
    },
    {
        "Marigold Festival": "pekin, illinoispekin marigold festival"
    },
    {
        " in his memory. It now identifies itself as the Marigold Capital of the World.       Dirksen recorded four spoken-word albums. Collaborating with ": null
    },
    {
        "Charles Osgood": "charles osgood"
    },
    {
        " and composer ": null
    },
    {
        "John Cacavas": "john cacavas"
    },
    {
        ", he produced a single, Gallant Men , released by ": null
    },
    {
        "Capitol Records": "capitol records"
    },
    {
        ", speaking his own poem. The same-named album reached 42 on the U.S.  Billboard  charts and won a ": null
    },
    {
        "Grammy Award for Best Documentary Recording": "grammy awards of 1968spoken"
    },
    {
        " in 42 On January 42 42 Dirksen at 42 years 42 days old became the oldest person to reach the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        "s top 42 when the single reached 42; two weeks later it reached 42 ": null
    },
    {
        "American Top 42": "american top 40"
    },
    {
        ", 42 November 42 curiously, just ahead of two versions of ": null
    },
    {
        "Wild Thing": "wild thing"
    },
    {
        " at 42 by ": null
    },
    {
        "William Bill Minkin": "senator bobby"
    },
    {
        ", with the A-side version as by Senator Bobby and the B-side version as by Senator Everett McKinley. ": null
    },
    {
        "Walter Brennan": "walter brennan"
    },
    {
        " had been the oldest person to reach the Hot 42s top 42 when he did so on 42 November 42 with ": null
    },
    {
        "Mama Sang a Song": "mama sang a song"
    },
    {
        " at age 42 The distinction passed from Dirksen to ": null
    },
    {
        "Moms Mabley": "moms mabley"
    },
    {
        " with her recording of ": null
    },
    {
        "Abraham, Martin and John": "abraham, martin and john"
    },
    {
        " peaking at 42 on 42 July 42 when she was 42 years 42 months old. ": null
    },
    {
        "American Top 42": "american top 40"
    },
    {
        ", 42 April 42 although host ": null
    },
    {
        "Casey Kasem": "casey kasem"
    },
    {
        " thought instead that Moms Mabley was only 42 years old. ": null
    },
    {
        "Gordon Sinclair": "gordon sinclair"
    },
    {
        ", at the even older age than Dirksen of 42 years 42 months 42 days, eclipsed Dirksens peak when Sinclairs version of ": null
    },
    {
        "The Americans": "the americans"
    },
    {
        " peaked at 42 on 42 February 42 ": null
    },
    {
        "American Top 42": "american top 40"
    },
    {
        ", 42 June 42 and 42 February 42 although Casey Kasem thought instead that Gordon was the oldest person to reach the top 42 even though Moms Mabley had already held the record for being the oldest. Also, on the 42 November 42 edition of American Top 42 Kasem mentioned four acts who kept their professions after their top 42 chart successes: Dirksen, Sinclair, ": null
    },
    {
        "Byron MacGregor": "byron macgregor"
    },
    {
        " , and ": null
    },
    {
        "Victor Lundberg": "victor lundberg"
    },
    {
        ".     Dirksen made television guest appearances on game and variety shows, such as  Whats My Line ,  The Hollywood Palace  and  The Red Skelton Show . Dirksen made a ": null
    },
    {
        "cameo appearance": "cameo appearance"
    },
    {
        " in the 42 film  The Monitors , a low-budget science-fiction movie in which invading extraterrestrials assert political dominion over the human race. He also appeared in several other movies.          In August 42 chest x-rays disclosed an asymptomatic peripherally located mass in the upper lobe of the right lung. Dirksen entered ": null
    },
    {
        "Walter Reed Army Hospital": "walter reed army hospital"
    },
    {
        " for surgery, which was undertaken on September  42 A right upper ": null
    },
    {
        "lobectomy": "lobectomy"
    },
    {
        " removed what proved to be lung cancer . Mr. Dirksen initially did well, but progressive complications developed into ": null
    },
    {
        "bronchopneumonia": "bronchopneumonia"
    },
    {
        ". He suffered a cardiopulmonary arrest and died on September 42 42 at age  42     Dirksen ": null
    },
    {
        "lay in state": "lying in stateunited states"
    },
    {
        " at the ": null
    },
    {
        "United States Capitol rotunda": "united states capitol rotunda"
    },
    {
        ",  followed by burial at Glendale Memorial Gardens in Pekin. ": null
    },
    {
        "honorary degree": "honorary degree"
    },
    {
        "s  from ": null
    },
    {
        "Hope College": "hope college"
    },
    {
        ", ": null
    },
    {
        "Bradley University": "bradley university"
    },
    {
        ", ": null
    },
    {
        "DePaul University": "depaul university"
    },
    {
        ", ": null
    },
    {
        "Lincoln Memorial University": "lincoln memorial university"
    },
    {
        ", ": null
    },
    {
        "Hanover College": "hanover college"
    },
    {
        ", ": null
    },
    {
        "Lewis University": "lewis university"
    },
    {
        ", and ": null
    },
    {
        "Illinois College": "illinois college"
    },
    {
        " Dirksen Senate Office Building": "dirksen senate office building"
    },
    {
        " in his honor.   The ": null
    },
    {
        "federal courthouse/building": "everett mckinley dirksen united states courthouse"
    },
    {
        " of the ": null
    },
    {
        "United States District Court for the Northern District of Illinois": "united states district court for the northern district of illinois"
    },
    {
        " in Chicago is also named after him.   A parkway in ": null
    },
    {
        "Springfield": "springfield, illinois"
    },
    {
        ", Illinois  is named in his honor.    Dirksen Drive, a road in DeBary, Florida is named after him. He was a winter resident in DeBary in his later years.    Dirksens statue, originally located adjacent to the ": null
    },
    {
        "Illinois State Capitol": "illinois state capitol"
    },
    {
        " and is now in Mineral Springs Park in his hometown of ": null
    },
    {
        "Pekin": "pekin, illinois"
    },
    {
        ", Illinois, includes two objects ": null
    },
    {
        "icon": "icon"
    },
    {
        "ically identified with the senator: an ": null
    },
    {
        "oil can": "oil can"
    },
    {
        " and a bunch of marigolds. ": null
    },
    {
        "The Lincoln Academy of Illinois": "the lincoln academy of illinois"
    },
    {
        " and awarded the Order of Lincoln by the Governor of Illinois in 42 in the area of Government.    The Everett McKinley Dirksen Elementary School on 42 West Foster Avenue in Chicago IL is a magnet school named in his memory along with other public schools in other Illinois townships. yahoo   Dirksen was mentioned in ": null
    },
    {
        "Jeff Greenfield": "jeff greenfield"
    },
    {
        "s ": null
    },
    {
        "alternate history": "alternate history"
    },
    {
        " book If Kennedy Lived in which in 42 President ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        ", having survived his ": null
    },
    {
        "assassination in Dallas": "assassination of john f. kennedy"
    },
    {
        " the previous year, gathered Senate minority leader Dirksen and others in discussion of selling ": null
    },
    {
        "grain": "grain"
    },
    {
        " to the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ".   The ": null
    },
    {
        "United States Postal Service": "united states postal service"
    },
    {
        " issued a commemorative stamp in 42 honoring Dirksen.  U.S. Stamp Gallery.    Path to War  ": null
    },
    {
        "National Press Foundation": "national press foundation"
    },
    {
        "        Dirksens widow, Louella, died of cancer on July 42 42  Their daughter Joy, the first wife of Senator ": null
    },
    {
        "Howard Baker": "howard baker"
    },
    {
        " of Tennessee, died of cancer on April 42 42 ": null
    }
]