[
    {
        "An exact sequence is a concept in ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", especially in ": null
    },
    {
        "group theory": "group theory"
    },
    {
        ", ": null
    },
    {
        "ring": "ring"
    },
    {
        " and ": null
    },
    {
        "module": "module"
    },
    {
        " theory, ": null
    },
    {
        "homological algebra": "homological algebra"
    },
    {
        ", as well as in ": null
    },
    {
        "differential geometry": "differential geometry"
    },
    {
        ". An exact sequence is a ": null
    },
    {
        "sequence": "sequence"
    },
    {
        ", either finite or infinite, of objects and ": null
    },
    {
        "morphism": "morphism"
    },
    {
        "s between them such that the ": null
    },
    {
        "image": "image"
    },
    {
        " of one morphism equals the ": null
    },
    {
        "kernel": "kernel"
    },
    {
        " of the next.       In the context of ": null
    },
    {
        "group theory": "group theory"
    },
    {
        ", a sequence   : G_42\\;\\xrightarrow\\; G_42 \\;\\xrightarrow\\; G_42 \\;\\xrightarrow\\; \\cdots \\;\\xrightarrow\\; G_n   of ": null
    },
    {
        "groups": "group"
    },
    {
        " and ": null
    },
    {
        "group homomorphism": "group homomorphism"
    },
    {
        "s is called exact if the ": null
    },
    {
        "image": "image"
    },
    {
        " of each homomorphism is equal to the ": null
    },
    {
        "kernel": "kernel"
    },
    {
        " of the next:     : \\operatorname \\ker     The sequence of groups and homomorphisms may be either finite or infinite.     A similar definition can be made for other ": null
    },
    {
        "algebraic structure": "algebraic structure"
    },
    {
        "s. For example, one could have an exact sequence of ": null
    },
    {
        "vector space": "vector space"
    },
    {
        "s and ": null
    },
    {
        "linear map": "linear map"
    },
    {
        "s, or of ": null
    },
    {
        "modules": "module"
    },
    {
        " and ": null
    },
    {
        "module homomorphism": "module homomorphism"
    },
    {
        "s. More generally, the notion of an exact sequence makes sense in any ": null
    },
    {
        "category": "category"
    },
    {
        " with ": null
    },
    {
        "kernel": "kernel"
    },
    {
        "s and ": null
    },
    {
        "cokernel": "cokernel"
    },
    {
        "s.       To understand the definition, it is helpful to consider relatively simple cases where the sequence is finite and begins or ends with the ": null
    },
    {
        "trivial group": "trivial group"
    },
    {
        ". Traditionally, this, along with the single identity element, is denoted 42 , or denoted 42 .     The sequence 42 → A → B is exact at A if and only if the map from A to B has kernel ; i.e., if and only if that map is a ": null
    },
    {
        "monomorphism": "monomorphism"
    },
    {
        " .   Dually, the sequence B → C → 42 is exact at C if and only if the image of the map from B to C is all of C; i.e., if and only if that map is an ": null
    },
    {
        "epimorphism": "epimorphism"
    },
    {
        " .   Therefore, the sequence 42 → X → Y → 42 is exact if and only if the map from X to Y is both a monomorphism and epimorphism , and thus, in many cases, an ": null
    },
    {
        "isomorphism": "bimorphism"
    },
    {
        " from X to Y.       Important are short exact sequences, which are exact sequences of the form   : 42 \\to A \\;\\xrightarrow\\; B \\;\\xrightarrow\\; C \\to 42   As established above, for any such short exact sequence, f is a ": null
    },
    {
        "monomorphism": "monomorphism"
    },
    {
        " and g is an ": null
    },
    {
        "epimorphism": "epimorphism"
    },
    {
        ". Furthermore, the image of f is equal to the kernel of g. It is helpful to think of A as a ": null
    },
    {
        "subobject": "subobject"
    },
    {
        " of B with f embedding A into B, and of C as the corresponding factor object , B/A, with g inducing an ": null
    },
    {
        "isomorphism": "isomorphism"
    },
    {
        "   : C \\cong B/\\operatorname     The short exact sequence   : 42 \\to A \\;\\xrightarrow\\; B \\;\\xrightarrow\\; C \\to 42   is called split if there exists a homomorphism h : C → B such that the composition g ∘ h is the identity map on C. It follows that if these are abelian groups, B is isomorphic to the direct sum of A and C :   : B \\cong A \\oplus C.       A long exact sequence is an exact sequence consisting of more than three nonzero terms, often an infinite exact sequence.     A long exact sequence     : A_42\\;\\xrightarrow\\; A_42 \\;\\xrightarrow\\; A_42 \\;\\xrightarrow\\; \\cdots \\;\\xrightarrow\\; A_n     is equivalent to a sequence of short exact sequences     : \\begin   & A_42\\;\\rightarrow\\;K_42 \\;\\rightarrow\\; 42\\;,\\\\   42\\;\\rightarrow\\;K_42 \\rightarrow & A_42 \\;\\rightarrow\\; K_42 \\;\\rightarrow\\; 42\\;,\\\\   \\vdots\\,\\,\\,\\, \\\\   42\\;\\rightarrow\\;K_ \\rightarrow & A_ \\rightarrow\\; K_n \\;\\rightarrow\\; 42\\;,\\\\   42\\;\\rightarrow K_n \\rightarrow & A_n   \\end   where K_i \\operatorname\\ker for every i .              Consider the following sequence of ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        "s:   : \\mathbf \\;\\;\\overset\\;\\; \\mathbf \\twoheadrightarrow \\mathbf/42\\mathbf     The first homomorphism maps each element i in the set of integers Z to the element 42i in Z. The second homomorphism maps each element i in Z to an element j in the quotient group, i.e., j i mod 42 Here the hook arrow \\hookrightarrow indicates that the map 42× from Z to Z is a ": null
    },
    {
        "monomorphism": "monomorphism"
    },
    {
        ", and the two-headed arrow \\twoheadrightarrow indicates an ": null
    },
    {
        "epimorphism": "epimorphism"
    },
    {
        " . This is an exact sequence because the image 42Z of the monomorphism is the kernel of the epimorphism. Essentially the same sequence can also be written as     : 42\\mathbf \\;\\;\\;\\; \\mathbf \\twoheadrightarrow \\mathbf/42\\mathbf     In this case the monomorphism is 42n ↦ 42n and although it looks like an identity function, it is not onto because the odd numbers dont belong to 42Z. The image of 42Z through this monomorphism is however exactly the same subset of Z as the image of Z through n ↦ 42n used in the previous sequence. This latter sequence does differ in the concrete nature of its first object from the previous one as 42Z is not the same set as Z even though the two are isomorphic as groups.     The first sequence may also be written without using special symbols for monomorphism and epimorphism:   : 42\\;\\to\\; \\mathbf \\;\\;\\overset \\;\\; \\mathbf\\; \\longrightarrow\\; \\mathbf/42\\mathbf\\;\\to\\;\\ 42     Here 42 denotes the trivial group, the map from Z to Z is multiplication by 42 and the map from Z to the ": null
    },
    {
        "factor group": "factor group"
    },
    {
        " Z/42Z is given by reducing integers ": null
    },
    {
        "modulo": "modular arithmetic"
    },
    {
        " 42 This is indeed an exact sequence:   the image of the map 42 → Z is , and the kernel of multiplication by 42 is also , so the sequence is exact at the first Z.   the image of multiplication by 42 is 42Z, and the kernel of reducing modulo 42 is also 42Z, so the sequence is exact at the second Z.   the image of reducing modulo 42 is Z/42Z, and the kernel of the zero map is also Z/42Z, so the sequence is exact at the position Z/42Z.     The first and third sequences are somewhat of a special case owing to the infinite nature of Z. It is not possible for a ": null
    },
    {
        "finite group": "finite group"
    },
    {
        " to be mapped by inclusion as a proper subgroup of itself. Instead the sequence that emerges from the ": null
    },
    {
        "first isomorphism theorem": "first isomorphism theorem"
    },
    {
        " is     : 42\\to N \\to G \\to G/N\\to 42     As a more concrete example of an exact sequence on finite groups:     : 42\\to C_n \\to D_ \\to C_42\\to 42     where C_n is the ": null
    },
    {
        "cyclic group": "cyclic group"
    },
    {
        " of order n and D_ is the ": null
    },
    {
        "dihedral group": "dihedral group"
    },
    {
        " of order 42n, which is a non-abelian group.       Let  and  be two ": null
    },
    {
        "ideal": "ideal"
    },
    {
        "s of a ring .   Then   : 42 \\to I\\cap J \\to I\\oplus J \\to I + J \\to 42   is an exact sequence of -modules, where the module homomorphism I\\cap J \\to I\\oplus J maps each element  of I\\cap J to the element  of the ": null
    },
    {
        "direct sum": "direct sum"
    },
    {
        " I\\oplus J , and the homomorphsim I\\oplus J \\to I+J maps each element  of I\\oplus J to .     These homomorphisms are restrictions of similarly defined homomorphisms that form the short exact sequence     : 42\\to R \\to R\\oplus R \\to R \\to 42     Passing to ": null
    },
    {
        "quotient module": "quotient module"
    },
    {
        "s yield another exact sequence     : 42\\to R/ \\to R/I \\oplus R/J \\to R/ \\to 42       Another example can be derived from ": null
    },
    {
        "differential geometry": "differential geometry"
    },
    {
        ", especially relevant for work on the ": null
    },
    {
        "Maxwell equations": "maxwell equations"
    },
    {
        ".     We begin with the ": null
    },
    {
        "Hilbert space": "hilbert space"
    },
    {
        " L^42 of scalar-valued square-integrable functions on three dimensions \\left\\lbrace f:\\mathbb^42 \\to \\mathbb\\right\\rbrace . Taking the ": null
    },
    {
        "gradient": "gradient"
    },
    {
        " of a function f\\in\\mathbb_42 moves us to a subset of \\mathbb_42 , the space of vector valued, still square-integrable functions on the same domain \\left\\lbrace f:\\mathbb^42\\to\\mathbb^42\\right\\rbrace -- specifically, the set of such functions that represent conservative vector fields.      Since the ": null
    },
    {
        "curl": "curl"
    },
    {
        " of all such fields is zero -- since   : \\begin   \\operatorname & \\equiv \\nabla \\times 42   \\end   for all such , the image of the ": null
    },
    {
        "gradient": "gradient"
    },
    {
        " is the kernel of the curl, and so we can then take the curl to be our next morphism, taking us again to a subset of \\mathbb_42 . Similarly, because   : \\begin   \\operatorname & \\equiv \\nabla \\cdot \\nabla \\times \\vec 42   \\end   the image of the curl is the kernel of the ": null
    },
    {
        "divergence": "divergence"
    },
    {
        ", which in turn takes us back to the space we started from L^42 . Since definitionally we have landed on a space of integrable functions, any such function can be integrated in order to produce a vector field which divergence is that function -- so the image of the divergence is the entirety of L^42 , and we can complete our sequence:     : 42 \\to L^42\\;\\; \\xrightarrow\\;\\; \\mathbb_42\\;\\; \\xrightarrow\\;\\; \\mathbb_42\\;\\; \\xrightarrow\\;\\; L^42 \\to 42     Equivalently, we could have reasoned in reverse: in a ": null
    },
    {
        "simply connected": "simply connected"
    },
    {
        " space, a curl-free vector field can always be written as a ": null
    },
    {
        "gradient of a scalar function": "conservative vector field"
    },
    {
        " . Similarly, a ": null
    },
    {
        "divergence": "divergence"
    },
    {
        "less field can be written as a curl of another field.      This short exact sequence also permits a much shorter proof of the validity of the ": null
    },
    {
        "Helmholtz decomposition": "helmholtz decomposition"
    },
    {
        " that does not rely on brute-force vector calculus. Consider the subsequence   : 42 \\to L^42\\;\\; \\xrightarrow\\;\\; \\mathbb_42\\;\\; \\xrightarrow\\;\\; \\operatorname \\to 42     Since the divergence of the gradient is the ": null
    },
    {
        "Laplacian": "laplacian"
    },
    {
        ", and since the Hilbert space of square-integrable functions can be spanned by the eigenfunctions of the Laplacian, we already see that some inverse mapping \\nabla^:\\mathbb_42\\to L^42 must exist. To explicitly construct such an inverse, we can start from the definition of the vector Laplacian   : \\nabla^42 \\vec \\nabla + \\nabla\\times     Since we are trying to construct an identity mapping by composing some function with the gradient, we know that in our case \\nabla\\times\\vec\\operatorname42 . Then if we take the divergence of both sides     : \\begin   \\nabla\\cdot\\nabla^42 \\vec & \\nabla\\cdot\\nabla\\\\   & \\nabla^42\\\\   \\end     we see that if a function is an eigenfunction of the vector Laplacian, its divergence must be an eigenfunction of the scalar Laplacian with the same eigenvalue. Then we can build our inverse function \\nabla^ simply by breaking any function in \\mathbb_42 into the vector-Laplacian eigenbasis, scaling each by the inverse of their eigenvalue, and taking the divergence; the action of \\nabla^\\circ\\nabla is thus clearly the identity. Thus by the ": null
    },
    {
        "splitting lemma": "splitting lemma"
    },
    {
        ",     : \\mathbb_42 \\cong L^42 \\oplus \\operatorname ,     or equivalently, any square-integrable vector field on \\mathbb^42 can be broken into the sum of a gradient and a curl -- which is what we set out to prove.       The ": null
    },
    {
        "splitting lemma": "splitting lemma"
    },
    {
        " states that if the short exact sequence   : 42 \\to A \\;\\xrightarrow\\; B \\;\\xrightarrow\\; C \\to 42   admits a morphism  such that  is the identity on  ": null
    },
    {
        "or": "logical disjunction"
    },
    {
        " a morphism  such that  is the identity on , then  is a ": null
    },
    {
        "direct sum": "direct sum"
    },
    {
        " of  and  . One says that such a short exact sequence splits.     The ": null
    },
    {
        "snake lemma": "snake lemma"
    },
    {
        " shows how a ": null
    },
    {
        "commutative diagram": "commutative diagram"
    },
    {
        " with two exact rows gives rise to a longer exact sequence. The ": null
    },
    {
        "nine lemma": "nine lemma"
    },
    {
        " is a special case.     The ": null
    },
    {
        "five lemma": "five lemma"
    },
    {
        " gives conditions under which the middle map in a commutative diagram with exact rows of length 42 is an isomorphism; the ": null
    },
    {
        "short five lemma": "short five lemma"
    },
    {
        " is a special case thereof applying to short exact sequences.     The importance of short exact sequences is underlined by the fact that every exact sequence results from weaving together several overlapping short exact sequences. Consider for instance the exact sequence     : A_42\\to A_42\\to A_42\\to A_42\\to A_42\\to A_42     which implies that there exist objects C k  in the category such that     : C_k \\cong \\ker \\cong \\operatorname .     Suppose in addition that the ": null
    },
    {
        "cokernel": "cokernel"
    },
    {
        " of each morphism exists, and is isomorphic to the image of the next morphism in the sequence:     : C_k \\cong \\operatorname      Then we obtain a commutative diagram in which all the diagonals are short exact sequences:     :": null
    },
    {
        "Image:long short exact sequences.png": "image:long short exact sequences.png"
    },
    {
        "   The only portion of this diagram that depends on the cokernel condition is the object C_42 and the final pair of morphisms A_42 \\to C_42\\to 42 . If there exists any object A_ and morphism A_k \\to A_ such that A_ \\to A_k \\to A_ is exact, then the exactness of 42 \\to C_k \\to A_k \\to C_ \\to 42 is ensured. Again taking the example of the category of groups, the fact that im is the kernel of some homomorphism on H implies that it is a ": null
    },
    {
        "normal subgroup": "normal subgroup"
    },
    {
        ", which coincides with its conjugate closure; thus coker is isomorphic to the image H/im of the next morphism.     Conversely, given any list of overlapping short exact sequences, their middle terms form an exact sequence in the same manner.       In the theory of abelian categories, short exact sequences are often used as a convenient language to talk about sub- and factor objects.     The ": null
    },
    {
        "extension problem": "extension problem"
    },
    {
        " is essentially the question Given the end terms A and C of a short exact sequence, what possibilities exist for the middle term B? In the category of groups, this is equivalent to the question, what groups B have A as a ": null
    },
    {
        "normal subgroup": "normal subgroup"
    },
    {
        " and C as the corresponding factor group? This problem is important in the ": null
    },
    {
        "classification of groups": "classification of finite simple groups"
    },
    {
        ". See also ": null
    },
    {
        "Outer automorphism group": "outer automorphism group"
    },
    {
        ".     Notice that in an exact sequence, the composition f i42 ∘ f i maps A i to 42 in A i42 , so every exact sequence is a ": null
    },
    {
        "chain complex": "chain complex"
    },
    {
        ". Furthermore, only f i -images of elements of A i are mapped to 42 by f i42 , so the ": null
    },
    {
        "homology": "homology"
    },
    {
        " of this chain complex is trivial. More succinctly:   :Exact sequences are precisely those chain complexes which are ": null
    },
    {
        "acyclic": "acyclic complex"
    },
    {
        ".   Given any chain complex, its homology can therefore be thought of as a measure of the degree to which it fails to be exact.     If we take a series of short exact sequences linked by chain complexes , then we can derive from this a long exact sequence on homology by application of the ": null
    },
    {
        "zig-zag lemma": "zig-zag lemma"
    },
    {
        ". It comes up in ": null
    },
    {
        "algebraic topology": "algebraic topology"
    },
    {
        " in the study of ": null
    },
    {
        "relative homology": "relative homology"
    },
    {
        "; the ": null
    },
    {
        "Mayer–Vietoris sequence": "mayer–vietoris sequence"
    },
    {
        " is another example. Long exact sequences induced by short exact sequences are also characteristic of ": null
    },
    {
        "derived functor": "derived functor"
    },
    {
        "s.     ": null
    },
    {
        "Exact functor": "exact functor"
    },
    {
        "s are ": null
    },
    {
        "functor": "functor"
    }
]