[
    {
        "        The Exakta  was a camera produced by the  Ihagee Kamerawerk in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", founded as the Industrie und Handels-Gesellschaft mbH, in 42 The inspiration and design of both the VP Exakta and the Kine Exakta are the work of the Ihagee engineer Karl Nüchterlein , who did not survive the Second World War.       Highlights of Exakta cameras include:   First ": null
    },
    {
        "single-lens reflex camera": "single-lens reflex camera"
    },
    {
        " for ": null
    },
    {
        "42 roll film": "127 film"
    },
    {
        " came in 42   First wind-on lever in 42   First built-in ": null
    },
    {
        "flash": "flash"
    },
    {
        " socket, activated by the ": null
    },
    {
        "shutter": "shutter"
    },
    {
        ", in 42   First SLR for ": null
    },
    {
        "42mm film": "135 film"
    },
    {
        " came in 42 the ": null
    },
    {
        "Kine Exakta": "kine exakta"
    },
    {
        "     Early ": null
    },
    {
        "Kine Exakta": "kine exakta"
    },
    {
        "s had a fixed waist-level ": null
    },
    {
        "viewfinder": "viewfinder"
    },
    {
        ", but later models, starting with the Exakta Varex, had an interchangeable waist- or eye-level finder. Examat and Travemat ": null
    },
    {
        "through-the-lens metering": "through-the-lens metering"
    },
    {
        " prism": "prism"
    },
    {
        "s were introduced in the mid42s. Most controls—including the shutter release and the film wind lever—are on the left-hand side, unlike most other cameras. The film is transported in the opposite direction to other 42mm SLRs. In classic Exaktas—made between 42 and 42—two film canisters can be used, one containing unexposed film and a second into which is wound the exposed film. A sliding knife built into the bottom of the camera can be used to slice the film so that the canister containing the exposed film can be removed while preserving the unexposed film in the main canister. The knife was omitted in the Exakta VX42 one of the last official Exakta cameras.     The shutter release on classic Exaktas is on the front of the camera, rather than the top. It is pressed with the left forefinger. This is quite similar to the Praktina design , the shutter-release of which was located on the right-hand side of the camera-body front. Most later lenses produced for Exakatas , known either as automatic or semi-automatic lenses, included a button in an extension that would align over the camera bodys shutter release when the lens was mounted. The diaphragm of these lenses remained fully open, providing a bright viewfinder image, until the button was depressed halfway, when the iris would be stopped down to the shooting aperture; pressed farther, the lens button engaged the cameras shutter release button, tripping the shutter.          There was a full line of specialized equipment available for these ": null
    },
    {
        "system camera": "system camera"
    },
    {
        "s that included ": null
    },
    {
        "microscope": "microscope"
    },
    {
        " adaptor, extension ": null
    },
    {
        "bellows": "bellows"
    },
    {
        ", ": null
    },
    {
        "stereo": "stereo"
    },
    {
        " attachments, medical attachments and various specialized finder screens. Equipment is fully compatible between all models manufactured between 42 and 42 The spelling found on cameras has traditionally been Exakta, but some early Kine-Exaktas were marked Exacta specifically for marketing in France, Portugal and the U.S., perhaps for copyright reasons; and certainly a great number of American collectors refer to the whole range as the Exacta. A related line of smaller, simpler cameras was the Exa line; these, too, existed in several variations. The ": null
    },
    {
        "Beseler": "charles beseler company"
    },
    {
        " Topcon": "topcon"
    },
    {
        " line of 42mm cameras used the same lens mount as the Exakta. In the early 42s the Exakta RTL 42 was introduced; it accepted the older models lenses but had its own range of viewfinders, which included a model with through-the-lens light metering. ": null
    },
    {
        "M42 lens mount": "m42 lens mount"
    },
    {
        " variants of the RTL line of cameras also appeared under the Practica name.     After an economic collapse following ": null
    },
    {
        "Germanys reunification": "german reunification"
    },
    {
        ", the successor of the firm is now back in business. This company is not related to the Dutchman Johan Steenbergen, the founder of Ihagee, or with the Exakta, which was discontinued in the 42s.     ": null
    }
]