[
    {
        "        Excalibur  is the ": null
    },
    {
        "legendary sword": "Legendary Swords"
    },
    {
        " of ": null
    },
    {
        "King Arthur": "King Arthur"
    },
    {
        ", sometimes also ": null
    },
    {
        "attributed with magical powers": "Magic Sword"
    },
    {
        " or associated with the rightful ": null
    },
    {
        "sovereignty": "Sovereignty"
    },
    {
        " of Britain. Excalibur and the ": null
    },
    {
        "Sword in the Stone": "Excalibur And The Sword In The Stone"
    },
    {
        " are sometimes said to be the same weapon, but in most versions they are considered separate. Excalibur was associated with the ": null
    },
    {
        "Arthurian legend": "Arthurian Legend"
    },
    {
        " very early on. In ": null
    },
    {
        "Welsh": "Welsh Language"
    },
    {
        ", it is called Caledfwlch; in ": null
    },
    {
        "Cornish": "Cornish Language"
    },
    {
        ", Calesvol; in ": null
    },
    {
        "Breton": "Breton Language"
    },
    {
        ", Kaledvoulch; and in ": null
    },
    {
        "Latin": "Latin Language"
    },
    {
        ", Caliburnus.       The name Excalibur ultimately derives from the ": null
    },
    {
        "Welsh": "Welsh Language"
    },
    {
        " Caledfwlch , which is a ": null
    },
    {
        "compound": "Compound"
    },
    {
        " of  hard and  breach, cleft . Caledfwlch appears in several early Welsh works, including the prose tale  Culhwch and Olwen . The name was later used in Welsh adaptations of foreign material such as the Bruts , which were based on ": null
    },
    {
        "Geoffrey of Monmouth": "Geoffrey Of Monmouth"
    },
    {
        ". It is often considered to be related to the phonetically similar  Caladbolg , a sword borne by several figures from ": null
    },
    {
        "Irish mythology": "Irish Mythology"
    },
    {
        ", although a borrowing of Caledfwlch from Irish Caladbolg has been considered unlikely by ": null
    },
    {
        "Rachel Bromwich": "Rachel Bromwich"
    },
    {
        " and D. Simon Evans. They suggest instead that both names may have similarly arisen at a very early date as generic names for a sword . This sword then became exclusively the property of Arthur in the British tradition.     Geoffrey of Monmouth, in his  Historia Regum Britanniae  , ": null
    },
    {
        "Latinised": "Latinisation"
    },
    {
        " the name of Arthurs sword as Caliburnus . Most Celticists consider Geoffreys Caliburnus to be derivative of a ": null
    },
    {
        "lost": "Lost Works"
    },
    {
        " Old Welsh": "Old Welsh"
    },
    {
        " text in which bwlch  had not yet been ": null
    },
    {
        "lenited": "Lenition"
    },
    {
        " to fwlch . In the late 15th/early 16th-century Middle Cornish play  Beunans Ke , Arthurs sword is called Calesvol, which is etymologically an exact Middle Cornish cognate of the Welsh Caledfwlch. It is unclear if the name was borrowed from the Welsh , or represents an early, ": null
    },
    {
        "pan-Brittonic": "Common Brittonic"
    },
    {
        " traditional name for Arthurs sword. Koch, John. Celtic Culture: A Historical Encyclopedia, Volume 1, ABC-CLIO, 2006, p. 329.     In ": null
    },
    {
        "Old French": "Old French"
    },
    {
        " sources this then became Escalibor, Excalibor, and finally the familiar Excalibur. ": null
    },
    {
        "Geoffrey Gaimar": "Geoffrey Gaimar"
    },
    {
        ", in his Old French  LEstoire des Engleis  , mentions Arthur and his sword: this Constantine was the nephew of Arthur, who had the sword Caliburc . Hardy, T.D. and Martin, C. T. , Gaimar, Geoffrey. LEstoire des Engles , Eyre and Spottiswoode, London, 1889, p. 2. Wright, T. ; Gaimar, Geoffrey. Gaimar, Havelok et Herward, ": null
    },
    {
        "Caxton Society": "Caxton Society"
    },
    {
        ", London, 1850, p. 2 In ": null
    },
    {
        "Waces": "Wace"
    },
    {
        "  Roman de Brut  , an Old French translation and versification of Geoffreys Historia, the sword is called Calabrum, Callibourc, Chalabrun, and Calabrun . De Lincy, Roux , Wace, Roman de Brut, v. II, Edouard Frère, Rouen, 1838, pp. 51, 88, 213, 215.     In ": null
    },
    {
        "Chrétien de Troyes": "Chrétien De Troyes"
    },
    {
        " late 12th-century Old French ": null
    },
    {
        "Perceval": "Perceval, The Story Of The Grail"
    },
    {
        ", Arthurs knight ": null
    },
    {
        "Gawain": "Gawain"
    },
    {
        " carries the sword Escalibor and it is stated, for at his belt hung Escalibor, the finest sword that there was, which sliced through iron as through wood Bryant, Nigel . Perceval: The Story of the Grail, DS Brewer, 2006, p. 69. . This statement was probably picked up by the author of the Estoire Merlin, or Vulgate Merlin, where the author asserts that Escalibor is a ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " name which means in French cuts iron, steel, and wood Loomis, R. S. Arthurian Tradition and Chrétien de Troyes, Columbia, 1949, p. 424. . It is from this fanciful etymological musing that ": null
    },
    {
        "Thomas Malory": "Thomas Malory"
    },
    {
        " got the notion that Excalibur meant cut steel Vinaver, Eugene The works of Sir Thomas Malory, Volume 3. Clarendon, 1990, p. 1301. .               In Arthurian romance, a number of explanations are given for Arthurs possession of Excalibur. In ": null
    },
    {
        "Robert de Borons": "Robert De Boron"
    },
    {
        "  Merlin , the first tale to mention the sword in the stone motif, Arthur obtained the British throne by pulling a sword from an anvil sitting atop a stone that appeared in a churchyard on Christmas Eve. Bryant, Nigel , Merlin and the Grail: Joseph of Arimathea, Merlin, Perceval : the Trilogy of Prose Romances Attributed to Robert de Boron, DS Brewer, 2001, p. 107ff. The story of the Sword in the Stone has an analogue in some versions of the story of ": null
    },
    {
        "Sigurd": "Sigurd"
    },
    {
        ", whose father, ": null
    },
    {
        "Sigmund": "Sigmund"
    },
    {
        ", draws the sword ": null
    },
    {
        "Gram": "Gram"
    },
    {
        " out of the tree ": null
    },
    {
        "Barnstokkr": "Barnstokkr"
    },
    {
        " where it is embedded by the Norse god ": null
    },
    {
        "Odin": "Odin"
    },
    {
        ". In this account, as foretold by ": null
    },
    {
        "Merlin": "Merlin"
    },
    {
        ", the act could not be performed except by the true king, meaning the divinely appointed king or true heir of ": null
    },
    {
        "Uther Pendragon": "Uther Pendragon"
    },
    {
        ". As Malory writes: Whoso pulleth out this sword of this stone and anvil, is rightwise king born. Sir Thomas Malory, William Caxton Morte Darthur: Sir Thomas Malorys Book of King Arthur and of His Noble Knights of the Round Table . p. 28. J.B. Lippincott and Company, 1868. This version also appears in the 1938 Arthurian novel  The Sword in the Stone  by British author ": null
    },
    {
        "T. H. White": "T. H. White"
    },
    {
        ", and the ": null
    },
    {
        "Disney adaptation": "The Sword In The Stone"
    },
    {
        "; they both quote the line from Thomas Malory in the 15th century. The identity of this sword as Excalibur is made explicit in the later Prose Merlin, part of the ": null
    },
    {
        "Lancelot-Grail": "Lancelot-Grail"
    },
    {
        " cycle . Micha, Alexandre . Merlin: roman du XIIIe siècle .     However, in the most famous English-language version of the Arthurian tales, Malorys 15th-century  Le Morte dArthur , early in his reign Arthur breaks the Sword from the Stone while in combat against King ": null
    },
    {
        "Pellinore": "Pellinore"
    },
    {
        ", and is given Excalibur by the Lady of the Lake in exchange for a later boon. Similarly, in the ": null
    },
    {
        "Post-Vulgate Cycle": "Post-Vulgate Cycle"
    },
    {
        ", Excalibur was given to Arthur by the ": null
    },
    {
        "Lady of the Lake": "Lady Of The Lake"
    },
    {
        " sometime after he began to reign. In the ": null
    },
    {
        "Vulgate Mort Artu": "Lancelot-Grail"
    },
    {
        ", Arthur is at the brink of death and so orders ": null
    },
    {
        "Griflet": "Griflet"
    },
    {
        " to throw the sword into the enchanted lake; after two failed attempts , Griflet finally complies with the wounded kings request and a hand emerges from the lake to catch it. This tale becomes attached to ": null
    },
    {
        "Bedivere": "Bedivere"
    },
    {
        " instead of Griflet in Malory and the English tradition. Malory records both versions of the legend in his Le Morte dArthur, naming both swords as Excalibur.         In Welsh legends, Arthurs sword is known as Caledfwlch. In Culhwch and Olwen, it is one of Arthurs most valuable possessions and is used by Arthurs warrior ": null
    },
    {
        "Llenlleawg": "Llenlleawg"
    },
    {
        " the Irishman to kill the Irish king Diwrnach while stealing his magical cauldron. Irish mythology mentions a weapon Caladbolg, the sword of ": null
    },
    {
        "Fergus mac Róich": "Fergus Mac Róich"
    },
    {
        ", which was also known for its incredible power and was carried by some of Irelands greatest heroes. The name, which can also mean hard cleft in ": null
    },
    {
        "Irish": "Irish Language"
    },
    {
        ", appears in the plural, caladbuilc, as a generic term for great swords in Togail Troi , a 10th-century Irish translation of the classical tale. Thurneysen, R. Zur Keltischen Literatur und Grammatik , Zeitschrift für celtische Philologie, Volume 12, p. 281ff. ORahilly, T. F. Early Irish history and mythology, Dublin Institute for Advanced Studies, 1957, p. 68.     Though not named as Caledfwlch, Arthurs sword is described vividly in  The Dream of Rhonabwy , one of the tales associated with the Mabinogion : Then they heard ": null
    },
    {
        "Cadwr Earl of Cornwall": "Cador"
    },
    {
        " being summoned, and saw him rise with Arthurs sword in his hand, with a design of two ": null
    },
    {
        "chimeras": "Chimera"
    },
    {
        " on the golden hilt; when the sword was unsheathed what was seen from the mouths of the two chimeras was like two flames of fire, so dreadful that it was not easy for anyone to look.        Geoffreys Historia is the first non-Welsh source to speak of the sword. Geoffrey says the sword was forged in ": null
    },
    {
        "Avalon": "Avalon"
    },
    {
        " and Latinises the name Caledfwlch as Caliburnus. When his influential pseudo-history made it to ": null
    },
    {
        "Continental Europe": "Continental Europe"
    },
    {
        ", writers altered the name further until it finally took on the popular form Excalibur . The legend was expanded upon in the Vulgate Cycle and in the Post-Vulgate Cycle which emerged in its wake. Both included the work known as the Prose Merlin, but the Post-Vulgate authors left out the Merlin continuation from the earlier cycle, choosing to add an original account of Arthurs early days including a new origin for Excalibur.          In several early French works, such as ": null
    },
    {
        "Chrétien de Troyes": "Chrétien De Troyes"
    },
    {
        "  Perceval, the Story of the Grail  and the Vulgate Lancelot Proper section, Excalibur is used by Gawain, Arthurs nephew and one of his best knights. This is in contrast to later versions, where Excalibur belongs solely to the king. The challenge of drawing a sword from a stone also appears in the later Arthurian stories of ": null
    },
    {
        "Galahad": "Galahad"
    },
    {
        ", whose achievement of the task indicates that he is destined to find the ": null
    },
    {
        "Holy Grail": "Holy Grail"
    },
    {
        ".     In many versions, Excaliburs blade was engraved with phrases on opposite sides: Take me up and Cast me away . In addition, when Excalibur was first drawn, in the first battle testing Arthurs sovereignty, its blade blinded his enemies. Malory Book I, 19, from The Works of Sir Thomas Malory, Ed. ": null
    },
    {
        "Vinaver, Eugène": "Eugène Vinaver"
    },
    {
        ", 3rd ed. Field, Rev. P. J. C. . 3 vol. Oxford: Oxford University Press. , , . . writes: thenne he drewe his swerd Excalibur, but it was so breyght in his enemyes eyen that it gaf light lyke thirty torchys. Nineteenth-century poet ": null
    },
    {
        "Alfred, Lord Tennyson": "Alfred Tennyson, 1St Baron Tennyson"
    },
    {
        ", described the sword in full ": null
    },
    {
        "Romantic": "Romanticism"
    },
    {
        " detail in his poem Morte dArthur , later rewritten as The Passing of Arthur , one of the  Idylls of the King : There drew he forth the brand Excalibur, / And o’er him, drawing it, the winter moon, / Brightening the skirts of a long cloud, ran forth / And sparkled keen with frost against the hilt / For all the haft twinkled with ": null
    },
    {
        "diamond": "Diamond"
    },
    {
        " sparks, / Myriads of ": null
    },
    {
        "topaz": "Topaz"
    },
    {
        "-lights, and ": null
    },
    {
        "jacinth": "Jacinth"
    },
    {
        "-work / Of subtlest jewellery.     In some tellings, Excaliburs ": null
    },
    {
        "scabbard": "Scabbard"
    },
    {
        " was said to have powers of its own, as the one wearing it would not lose even a drop of blood. Any wounds received while wearing the scabbard would not bleed at all, thus preventing the death of the wearer. For this reason, Merlin chides Arthur for preferring the sword over the scabbard, saying that the latter was the greater treasure. In the later romance tradition, including Le Morte dArthur, the scabbard is stolen from Arthur by his half-sister ": null
    },
    {
        "Morgan le Fay": "Morgan Le Fay"
    },
    {
        " in revenge for the death of her beloved ": null
    },
    {
        "Accolon": "Accolon"
    },
    {
        " and thrown into a lake, never to be found again. This act later enables the death of Arthur at the ": null
    },
    {
        "Battle of Camlann": "Battle Of Camlann"
    },
    {
        ".       Other weapons have been associated with Arthur. Welsh tradition also knew of a dagger named ": null
    },
    {
        "Carnwennan": "Carnwennan"
    },
    {
        " and a spear named Rhongomyniad that belonged to him. Carnwennan first appears in Culhwch and Olwen, where Arthur uses it to slice the witch Orddu in half. Rhongomyniad is also mentioned in Culhwch, although only in passing; it appears as simply Ron in Geoffreys Historia. Geoffrey also names Arthurs shield as Pridwen, but in Culhwch, Prydwen is the name of Arthurs ship while his shield is named Wynebgwrthucher .     The ": null
    },
    {
        "Alliterative Morte Arthure": "Alliterative Morte Arthure"
    },
    {
        ", a ": null
    },
    {
        "Middle English": "Middle English"
    },
    {
        " poem, mentions Clarent, a sword of peace meant for knighting and ceremonies as opposed to battle, which ": null
    },
    {
        "Mordred": "Mordred"
    },
    {
        " stole and then used to kill Arthur at Camlann. , TEAMS, retrieved 26-02-2007 The Prose Lancelot of the Vulgate Cycle mentions a sword called Seure, which belonged to the king but was used by ": null
    },
    {
        "Lancelot": "Lancelot"
    },
    {
        " in one battle. Warren, Michelle. History On The Edge: Excalibur and the Borders of Britain, 1100-1300 p. 212.            In ": null
    },
    {
        "Welsh mythology": "Welsh Mythology"
    },
    {
        ", the Dyrnwyn , one of the ": null
    },
    {
        "Thirteen Treasures of the Island of Britain": "Thirteen Treasures Of The Island Of Britain"
    },
    {
        ", is said to be a powerful sword belonging to ": null
    },
    {
        "Rhydderch Hael": "Rhydderch Hael"
    },
    {
        ", Tri Thlws ar Ddeg, ed. and tr. Bromwich : pp. 240–1. one of the Three Generous Men of Britain mentioned in the ": null
    },
    {
        "Welsh Triads": "Welsh Triads"
    },
    {
        ". When drawn by a worthy or well-born man, the entire blade would blaze with fire. Rhydderch was never reluctant to hand the weapon to anyone, hence his nickname Hael the Generous , but the recipients, as soon as they had learned of its peculiar properties, always rejected the sword.     There are other similar weapons described in other mythologies. In particular, ": null
    },
    {
        "Claíomh Solais": "Claíomh Solais"
    },
    {
        ", which is an Irish term meaning Sword of Light , or Shining Sword , appears in a number of orally transmitted Irish folk-tales.        ": null
    }
]