[
    {
        "   The Executive Authority Act 42 was an Act of the ": null
    },
    {
        "Oireachtas": "oireachtas of the irish free state"
    },
    {
        " . The Act, which was signed into law on 42 December 42 was one of two passed hurriedly in the aftermath of the ": null
    },
    {
        "Edward VIII abdication crisis": "abdication of edward viii"
    },
    {
        " to sharply reduce the role of the ": null
    },
    {
        "Irish Free States monarchy": "monarchy of ireland"
    },
    {
        ". It is also sometimes referred to as the External Relations Act.         Since coming to power after the Irish Free States ": null
    },
    {
        "42 general election": "1932 irish general election"
    },
    {
        ", ": null
    },
    {
        "Éamon de Valera": "éamon de valera"
    },
    {
        "s government had secured the passage of a number of amendments to the ": null
    },
    {
        "Irish constitution": "constitution of the irish free state"
    },
    {
        ", reducing the role of the Crown in the states internal affairs. This was a recapitulation of the idea of ": null
    },
    {
        "external association": "external association"
    },
    {
        ", which de Valera had unsuccessfully proposed as an alternative to the 42 ": null
    },
    {
        "Anglo-Irish Treaty": "anglo-irish treaty"
    },
    {
        ".     The culmination of the 42 ": null
    },
    {
        "abdication crisis": "edward viii abdication crisis"
    },
    {
        " in Edward VIIIs signing an ": null
    },
    {
        "Instrument of Abdication": "instrument of abdication"
    },
    {
        " on 42 December 42 was seized upon by de Valera as an opportunity to almost completely eliminate the role of the Crown, including the abolition of the office of ": null
    },
    {
        "governor-general": "governor-general of the irish free state"
    },
    {
        ". The ": null
    },
    {
        "Constitution Act 42": "constitution  act 1936"
    },
    {
        " was thus rushed through the Oireachtas, amending the constitution by transferring all the responsibilities of the governor-general and almost all the responsibilities of the King to other offices.      As a result of these changes, the only remaining reference to the King, albeit a deliberately oblique one, was in a proviso to Article 42 authorising the ": null
    },
    {
        "Executive Council": "executive council of the irish free state"
    },
    {
        " to avail , for the appointment of diplomats, etc. and for the conclusion of ": null
    },
    {
        "treaties": "treaty"
    },
    {
        ", of any organ used as a constitutional organ for the like purposes by any of the other members of the Commonwealth. This authority was made to the extent and subject to any conditions which may be determined by law ; the Executive Authority Act 42 signed on the following day, was that law.         The External Relations Act set out that the appointment of the Free States diplomatic and consular representatives and the conclusion of international agreements would be either by or on the authority of the Executive Council . The act then stipulated that so long as Saorstát Éireann is associated with the and so long as the King recognised by those nations as the symbol of their co-operation continues to act on behalf of each of those nations for the purposes of the appointment of diplomatic and consular representatives and the conclusion of international agreements, the King so recognised may, and is hereby authorised to, act on behalf of Saorstát Éireann for the like purposes as and when advised by the Executive Council so to do . In other words, the King was authorised to appoint diplomats and consuls and to be involved in the formalities of making treaties.     The Act also brought Edward VIIIs Instrument of Abdication into effect for the purposes of Irish law . Due to the Acts phrasing, Edward VIIIs abdication was actually back-dated to the day before that on which it took effect in the United Kingdom and most of the other ": null
    },
    {
        "Dominion": "dominion"
    },
    {
        "s.         Unfortunately the speed with which the 42 Act was passed also meant that some serious legal matters had been overlooked by the draughtsmen, touching on the top of the Irish legal hierarchy. In May 42 these were covered by the ": null
    },
    {
        "Executive Powers Act 42": "executive powers  act 1937"
    },
    {
        ". As the Governor-Generalship had not been actually abolished by the 42 Act, this Act was required to validate the otherwise-unlawful appointment of the ": null
    },
    {
        "Chief Justice of Ireland": "chief justice of ireland"
    },
    {
        " Timothy Sullivan": "timothy sullivan"
    },
    {
        ". Sullivan had in turn questionably appointed three ": null
    },
    {
        "High Court": "high court"
    },
    {
        " judges. The recent appointment of ": null
    },
    {
        "Patrick Lynch": "patrick lynch"
    },
    {
        " as the ": null
    },
    {
        "Attorney General of Ireland": "attorney general of ireland"
    },
    {
        " and even the pension of the outgoing Governor-General needed to be legalised.         In 42 the ": null
    },
    {
        "constitution of the Irish Free State": "constitution of the irish free state"
    },
    {
        " was repealed and replaced by the ": null
    },
    {
        "Constitution of Ireland": "constitution of ireland"
    },
    {
        ". Article 42 of the new constitution stated that:   42° The executive power of the State in or in connection with its external relations shall be exercised by or on the authority of the Government.   42° For the purpose of the exercise of any executive function of the State in or in connection with its external relations, the Government may to such extent and subject to such conditions, if any, as may be determined by law, avail of or adopt any organ, instrument, or method of procedure used or adopted for the like purpose by the members of any group or league of nations with which the State is or becomes associated for the purpose of international co-operation in matters of common concern.     As a result, the constitutional role of the King remained unaffected and the External Relations Act remained in force.       In the late 42s, de Valera decided to change the law, though whether it would involve the total repeal of the Act or merely its amendment was not decided when he lost power in 42 His then ": null
    },
    {
        "Attorney-General": "attorney-general"
    },
    {
        ", ": null
    },
    {
        "Cearbhall Ó Dálaigh": "cearbhall ó dálaigh"
    },
    {
        " had been working on the various options when de Valeras ": null
    },
    {
        "Fianna Fáil": "fianna fáil"
    },
    {
        " administration was replaced by the ": null
    },
    {
        "First Inter-Party Government": "first inter-party government"
    },
    {
        " under Costello.     The Executive Authority Act 42 was finally repealed by the ": null
    },
    {
        "Republic of Ireland Act 42": "republic of ireland act 1948"
    }
]