[
    {
        "   Existentialism Is a Humanism  is a 42 work by the philosopher ": null
    },
    {
        "Jean-Paul Sartre": "jean-paul sartre"
    },
    {
        ", based on a lecture by the same name he gave at Club Maintenant in Paris, on 42 October 42 In early translations, Existentialism and Humanism was the title used in the United Kingdom; the work was originally published in the United States as Existentialism, and a later translation employs the original title. The work, once influential and a popular starting-point in discussions of ": null
    },
    {
        "Existentialist": "existentialist"
    },
    {
        " thought, has been widely criticized by philosophers, including Sartre himself, who later rejected some of the views he expressed in it.         Sartre asserts that the key defining concept of existentialism is that the ": null
    },
    {
        "existence": "existence"
    },
    {
        " of a person is prior to their ": null
    },
    {
        "essence": "essence"
    },
    {
        ". The term ": null
    },
    {
        "existence precedes essence": "existence precedes essence"
    },
    {
        " subsequently became a maxim of the existentialist movement. Put simply, this means that there is nothing to dictate that persons character, goals in life, and so on; that only the individual can define their essence. According to Sartre, man first of all exists, encounters himself, surges up in the world – and defines himself afterwards .     Thus, Sartre rejects what he calls deterministic excuses and claims that people must take ": null
    },
    {
        "responsibility": "moral responsibility"
    },
    {
        " for their behavior. Sartre defines ": null
    },
    {
        "anguish": "anguish"
    },
    {
        " as the emotion that people feel once they realize that they are responsible not just for themselves, but for all humanity. Anguish leads people to realize that their actions guide humanity and allows them to make judgments about others based on their attitude towards freedom. Anguish is also associated with Sartres notion of ": null
    },
    {
        "despair": "wiktionary:despair"
    },
    {
        ", which he defines as optimistic reliance on a set of possibilities that make action possible. Sartre claims that In fashioning myself, I fashion Man , saying that the individuals action will affect and shape mankind. The ": null
    },
    {
        "being-for-itself": "pour soi"
    },
    {
        " uses despair to embrace freedom and take meaningful action in full acceptance of whatever consequences may arise as a result. He also describes ": null
    },
    {
        "abandonment": "abandonment"
    },
    {
        " as the loneliness that atheists feel when they realize that there is no God to prescribe a way of life, no guidance for people on how to live; that were abandoned in the sense of being alone in the universe and the arbiters of our own essence. Sartre closes his work by emphasizing that existentialism, as it is a philosophy of action and ones defining oneself, is optimistic and liberating.       First published in French in 42 Existentialism and Humanism was published in an English translation by Philip Mairet in 42 In the United States, the work was originally published as Existentialism. An English translation by Carol Macomber, with an introduction by ": null
    },
    {
        "Annie Cohen-Solal": "annie cohen-solal"
    },
    {
        " and notes and preface by Arlette Elkaïm-Sartre, was published under the title Existentialism Is a Humanism in 42       Existentialism Is a Humanism has been a popular starting-point in discussions of existentialist thought,  and in ": null
    },
    {
        "Thomas Baldwin": "thomas baldwin"
    },
    {
        "s words, seized the imagination of a generation.  However, Sartre himself later rejected some of the views he expressed in the work, and regretted its publication. Other philosophers have critiqued the lecture on various grounds: ": null
    },
    {
        "Martin Heidegger": "martin heidegger"
    },
    {
        " wrote in a letter to the philosopher and Germanist ": null
    },
    {
        "Jean Beaufret": "jean beaufret"
    },
    {
        " that while Sartres statement that existence precedes essence reverses the metaphysical statement that essence precedes existence, the reversal of a metaphysical statement remains a metaphysical statement. In Heideggers view, Sartre stays with metaphysics in oblivion of the truth of Being.  ": null
    },
    {
        "Marjorie Grene": "marjorie grene"
    },
    {
        " found Sartres discussion of the problem of the relation between individuals in Existentialism and Humanism to be weaker than the one he had previously offered in  Being and Nothingness . ": null
    },
    {
        "Walter Kaufmann": "walter kaufmann"
    },
    {
        " commented that the lecture has been widely mistaken for the definitive statement of existentialism, but is rather a brilliant lecture which bears the stamp of the moment. According to Kaufmann, Sartre makes factual errors, including misidentifying philosopher ": null
    },
    {
        "Karl Jaspers": "karl jaspers"
    },
    {
        " as a Catholic, and presenting a definition of existentialism that is open to question. Thomas C. Anderson criticized Sartre for asserting without explanation that if a person seeks freedom from false, external authorities, then he or she must invariably allow this freedom for others. ": null
    },
    {
        "Iris Murdoch": "iris murdoch"
    },
    {
        " found one of Sartres discussions with a Marxist interesting, but otherwise considered Existentialism and Humanism to be a rather bad little book.  ": null
    },
    {
        "Mary Warnock": "mary warnock, baroness warnock"
    },
    {
        " believed Sartre was right to dismiss the work.     The philosopher ": null
    },
    {
        "Frederick Copleston": "frederick copleston"
    },
    {
        " stated that Sartre, like ": null
    },
    {
        "Georg Wilhelm Friedrich Hegel": "georg wilhelm friedrich hegel"
    },
    {
        " and ": null
    },
    {
        "Edmund Husserl": "edmund husserl"
    },
    {
        ", interpreted the views of ": null
    },
    {
        "René Descartes": "rené descartes"
    },
    {
        " as an anticipation of his own philosophical views. The neurobiologist ": null
    },
    {
        "Steven Rose": "steven rose"
    },
    {
        " described a statement in which Sartre maintained that man will be what he makes of himself as a windily rhetorical paean to the dignity of universalistic man and more an exercise in political sloganeering than a sustainable philosophical position. He pointed to aging and disease as examples of factors that limit human freedom. The philosopher ": null
    },
    {
        "Slavoj Žižek": "slavoj žižek"
    },
    {
        " argued that there is a parallel between Sartres views and claims made by the character Father Zosima in ": null
    },
    {
        "Fyodor Dostoyevsky": "fyodor dostoyevsky"
    },
    {
        "s novel  The Brothers Karamazov  : whereas Sartre believes that with total freedom comes total responsibility, for Father Zosima each of us must make us responsible for all mens sins .": null
    }
]