[
    {
        "   The expanding nozzle is a type of ": null
    },
    {
        "rocket nozzle": "rocket nozzle"
    },
    {
        " that, unlike traditional designs, maintains its efficiency at a wide range of altitudes. It is a member of the class of ": null
    },
    {
        "altitude compensating nozzle": "altitude compensating nozzle"
    },
    {
        "s, a class that also includes the ": null
    },
    {
        "plug nozzle": "plug nozzle"
    },
    {
        " and ": null
    },
    {
        "aerospike": "aerospike engine"
    },
    {
        ". While the expanding nozzle is the least technically advanced and simplest to understand from a modeling point of view, it also appears to be the most difficult design to build.     In the traditional ": null
    },
    {
        "bell nozzle": "bell nozzle"
    },
    {
        " the engine skirt is shaped to gradually flare out from the small-diameter exit from the combustion chamber, growing larger further from the chamber. The basic idea is to lower the pressure of the exhaust by expanding it in the nozzle, until it reaches ambient air pressure at the exit. For operations at sea level   the skirt is generally short and highly angled, at least in comparison to a skirt designed for operations in space, which are longer and more gradually shaped. This means that a rocket engine that spends any significant amount of time climbing through the atmosphere cannot be optimally shaped; as it climbs the ambient pressure changes, so the exact shape and length of the skirt would have to change in order to maintain the proper pressure. Rocket designers have to select the sweet spot that is most appropriate to their needs, realizing that this will reduce thrust by as much as 42% at other altitudes.     The expanding nozzle addresses this to a degree by including two skirts on a single engine, one inside the other. The first skirt, attached directly to the ": null
    },
    {
        "combustion chamber": "combustion chamber"
    },
    {
        ", is designed for use at lower altitudes and is short and squat. The second, sitting outside the first, fits over the lower altitude bell to extend it into a longer and narrower bell used for higher altitudes. At liftoff the outer bell is pulled up from the inner bell, out of the way of the exhaust. As the spacecraft climbs, the outer bell is pushed back down over the inner bell to increase the thrust efficiency. Thus an expanding nozzle can have two sweet spots, which can lead to a major improvement in overall performance.     Generally simple in concept, the expanding nozzle is considerably more complex to build than it might seem. Engine bells must be cooled to avoid damage from the hot rocket exhaust, and this has presented problems in expanding nozzle designs. The cooling is normally accomplished by running either the oxidizer or fuel  through tubing in the bell. With the bell moving, plumbing carrying the coolant to the bell has to be flexible and this increases complexity to the extent that the advantages of the design are often considered too costly. In the case of liquid hydrogen, the fluid also has the disadvantage of being highly reactive chemically, making a variety of common flexible materials unsuitable for use in this role.     For the aforementioned reasons modern designs  feature ": null
    },
    {
        "radiatively cooled": "radiative cooling"
    },
    {
        " reinforced carbon–carbon": "reinforced carbon–carbon"
    },
    {
        " nozzle extensions needing no coolant plumbing at all.     The first engine design to include an expanding nozzle appears to be the ": null
    },
    {
        "Pratt & Whitney XLR42": "pratt  &  whitney xlr-129"
    },
    {
        ". The XLR42 was intended to power a ": null
    },
    {
        "McDonnell Aircraft": "mcdonnell aircraft"
    },
    {
        " boost-glide aircraft design that was entered as part of the ": null
    },
    {
        "Project ISINGLASS": "project isinglass"
    },
    {
        " study looking at follow-on designs to replace the ": null
    },
    {
        "Lockheed A42": "lockheed a-12"
    },
    {
        " that was just entering service. It was a ": null
    },
    {
        "liquid oxygen": "liquid oxygen"
    },
    {
        "/": null
    },
    {
        "liquid hydrogen": "liquid hydrogen"
    },
    {
        " design that used staged combustion and generated about  thrust. An enlarged version of the XLR42 was proposed for the ": null
    },
    {
        "Space Shuttle Main Engine": "space shuttle main engine"
    },
    {
        " contest, but this was won by the ": null
    },
    {
        "RS42": "rs-25"
    },
    {
        ", an enlarged ": null
    },
    {
        "Rocketdyne HG42": "hg-3"
    },
    {
        ". Since these engines are fired from the point of liftoff into extra-atmospheric space flight, any sort of altitude compensation could dramatically improve their overall performance. The expanding nozzle was later abandoned in a cost-cutting phase, and the RS42 suffers a 42% loss of performance at low altitude as a result.     ": null
    },
    {
        "Glushko": "valentin glushko"
    },
    {
        " has used an expanding nozzle on one design, the ": null
    },
    {
        "RD42": "rd-701"
    },
    {
        " tripropellant rocket": "tripropellant rocket"
    },
    {
        ". Funding ran out with the ": null
    },
    {
        "fall of the Soviet state": "history of post-soviet russia"
    }
]