[
    {
        "Expectations from the Muslim Woman, also called Our Expectations of the Muslim Woman, is regarded as one of ": null
    },
    {
        "Ali Shariati": "ali shariati"
    },
    {
        "s most important lectures referring to ": null
    },
    {
        "womens rights": "womens rights"
    },
    {
        " in ": null
    },
    {
        "Islam": "islam"
    },
    {
        ".     The point of his lecture is not to show that womens rights do not exist in Islam, but to show that what Shariati saw as anti-Islamic traditions have had tragic results for Muslim women. He uses ": null
    },
    {
        "Fatima Zahra": "fatima zahra"
    },
    {
        ", the daughter of ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        ", as an example of a woman who played a significant role in political life.     He begins his lecture by stating that:     Most often, we are satisfied by pointing out that Islam gives great value to science or establishes progressive rights for women. Unfortunately we never actually use or benefit from this value or these rights.     He continues by stating that:     From the 42th through to the 42th century any attempt to address the special problem of the social rights of women and their specific characteristics has been seen as a mere by-product of a spiritual or psychic shock or the result of a revolutionary crisis in centers of learning or as a response to political currents and international movements. Thus, traditional societies, historical societies, religious societies, either in the East or in the West have all been directly or indirectly influenced by these thoughts, intellectual currents and even new social realities.     He argues that the liberation of women has begun in the West, and many fear it occurring in the Muslim world, in part because they are misinformed, and have not looked at Islam through an historical perspective, and are relying on their own misinterpretation of Islam:     In such societies the newly-educated class, the pseudo-intellectuals, who are in the majority, strongly and vigorously welcome this crisis. They themselves even act as one of the forces that strengthen this corrupting and destructive transformation.     Shariati believed that women in Iran under the ": null
    },
    {
        "Shah": "mohammad reza pahlavi"
    }
]