[
    {
        "           Frederik Willem de Klerk   is a South African politician who served as ": null
    },
    {
        "State President of South Africa": "state president of south africa"
    },
    {
        " from 1989 to 1994 and as ": null
    },
    {
        "Deputy President": "deputy president of south africa"
    },
    {
        " from 1994 to 1996. As South Africas last head of state from the era of white-minority rule, he and his government dismantled the ": null
    },
    {
        "apartheid": "apartheid in south africa"
    },
    {
        " system and introduced ": null
    },
    {
        "universal suffrage": "universal suffrage"
    },
    {
        ". Ideologically a ": null
    },
    {
        "conservative": "conservatism"
    },
    {
        " and an ": null
    },
    {
        "economic liberal": "economic liberalism"
    },
    {
        ", he led the ": null
    },
    {
        "National Party": "national party"
    },
    {
        " from 1989 to 1997.     Born in ": null
    },
    {
        "Johannesburg": "johannesburg"
    },
    {
        ", ": null
    },
    {
        "British Dominion": "dominion"
    },
    {
        " of ": null
    },
    {
        "South Africa": "union of south africa"
    },
    {
        ", to an influential ": null
    },
    {
        "Afrikaner": "afrikaners"
    },
    {
        " family, de Klerk studied at ": null
    },
    {
        "Potchefstroom University": "potchefstroom university"
    },
    {
        " before pursuing a career in law. Joining the National Party, to which he had family ties, he was elected to parliament and sat in the ": null
    },
    {
        "white-minority government": "dominant minority"
    },
    {
        " of ": null
    },
    {
        "P. W. Botha": "p. w. botha"
    },
    {
        ", holding a succession of ministerial posts. As a minister, he supported and enforced apartheid, a system of ": null
    },
    {
        "racial segregation": "racial segregation"
    },
    {
        " that privileged ": null
    },
    {
        "white South Africans": "white south africans"
    },
    {
        ". After Botha resigned in 1989, de Klerk replaced him, first as leader of the National Party and then as State President. Although observers expected him to continue Bothas defence of apartheid, de Klerk decided to end the policy. He was aware that growing ethnic animosity and violence was leading South Africa into a racial civil war. Amid this violence, the state security forces committed widespread human rights abuses and encouraged violence between ": null
    },
    {
        "Xhosa": "xhosa people"
    },
    {
        " and ": null
    },
    {
        "Zulu": "zulu people"
    },
    {
        ", although de Klerk later denied sanctioning such actions. He permitted ": null
    },
    {
        "anti-apartheid": "internal resistance to south african apartheid"
    },
    {
        " marches to take place, legalised a range of previously banned anti-apartheid political parties, and freed imprisoned anti-apartheid activists, including ": null
    },
    {
        "Nelson Mandela": "nelson mandela"
    },
    {
        ". He also dismantled South Africas nuclear weapons program.     De Klerk negotiated with Mandela to fully dismantle apartheid and establish a transition to universal suffrage. In 1993, he publicly apologised for apartheids harmful effects, although not for apartheid itself. He oversaw the ": null
    },
    {
        "1994 non-racial election": "1994 south african general election"
    },
    {
        " in which Mandela led the ": null
    },
    {
        "African National Congress": "african national congress"
    },
    {
        " to victory; de Klerks National Party took second place with 20% of the vote. After the election, de Klerk became a Deputy President in Mandelas ANC-led ": null
    },
    {
        "coalition": "coalition government"
    },
    {
        ", the ": null
    },
    {
        "Government of National Unity": "government of national unity"
    },
    {
        ". In this position, he supported the governments liberal economic policies. De Klerk had desired a total amnesty for political crimes committed under apartheid and opposed the ": null
    },
    {
        "Truth and Reconciliation Commission": "truth and reconciliation commission"
    },
    {
        " set up to investigate past ": null
    },
    {
        "human rights": "human rights in south africa"
    },
    {
        " abuses by both pro and anti-apartheid groups. His working relationship with Mandela was strained, although he later spoke fondly of him. In May 1996, after the National Party objected to the ": null
    },
    {
        "new constitution": "constitution of south africa"
    },
    {
        ", de Klerk withdrew it from the coalition government; the party disbanded the following year and reformed as the ": null
    },
    {
        "New National Party": "new national party"
    },
    {
        ". In 1997, he retired from active politics and since then has lectured internationally.     De Klerk is a controversial figure. The recipient of a wide range of awards—including the ": null
    },
    {
        "Nobel Peace Prize": "nobel peace prize"
    },
    {
        "—he was widely praised for dismantling apartheid and bringing universal suffrage to South Africa. Conversely, anti-apartheid activists criticised him for offering only a qualified apology for apartheid and for ignoring the human rights abuses carried out by his state security forces, while South Africas white right-wing claimed that by abandoning apartheid he had betrayed the interests of the countrys white minority.             F. W. de Klerk was born on 18 March 1936 in ": null
    },
    {
        "Mayfair": "mayfair, gauteng"
    },
    {
        ", a suburb of ": null
    },
    {
        "Johannesburg": "johannesburg"
    },
    {
        ". His parents were ": null
    },
    {
        "Johannes Jan de Klerk": "johannes de klerk"
    },
    {
        " and Hendrina Cornelia Coetzer – her forefather was a Kutzer who stems from ": null
    },
    {
        "Austria": "austria"
    },
    {
        " .   A. Kamsteeg, E. Van Dijk, F.W. de Klerk, man of the moment. 1990 He was his parents second son, having a brother, ": null
    },
    {
        "Willem": "willem de klerk"
    },
    {
        ", who was eight years his senior. De Klerks first language is Afrikaans and the earliest of his distant ancestors to arrive in what is now South Africa did so in the late 1680s.      De Klerks family had played a leading role in Afrikaner society; they had longstanding affiliations with South Africas ": null
    },
    {
        "National Party": "national party"
    },
    {
        ". His paternal great-grandfather, ": null
    },
    {
        "Jan van Rooy": "jan van rooy"
    },
    {
        ", had been a senator, while his paternal grandfather, Willem, had been a clergyman who fought in the ": null
    },
    {
        "Anglo-Boer War": "anglo-boer war"
    },
    {
        " and who stood twice, unsuccessfully, as a National Party candidate. His paternal aunts husband was ": null
    },
    {
        "J. G. Strijdom": "johannes gerhardus strijdom"
    },
    {
        ", a former Prime Minister. His own father, ": null
    },
    {
        "Jan de Klerk": "jan de klerk"
    },
    {
        ", was also a Senator, having served as the secretary of the National Party in Transvaal, president of the senate for seven years, and a member of the countrys cabinet for fifteen years under three Prime Ministers. In this environment, de Klerk was exposed to politics from childhood. He and family members would be encouraged to hold family debates; his more conservative opinions would be challenged by his brother Willem, who was sympathetic to the more ": null
    },
    {
        "liberal": "liberalism"
    },
    {
        ", enlightened faction of the National Party. Willem became a political analyst and later split from the National Party to found the liberal ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        ".     The name de Klerk is derived from Le Clerc, Le Clercq and De Clercq, and is of French ": null
    },
    {
        "Huguenot origin": "huguenots in south africa"
    },
    {
        "  . De Klerk noted that he is also of Dutch descent,   with an ": null
    },
    {
        "Indian": "indian south africansdutch slavery in the cape"
    },
    {
        " ancestor from the late 1600s or early 1700s.  He is also said to be descended from the ": null
    },
    {
        "Khoi": "khoikhoi"
    },
    {
        " interpreter known as ": null
    },
    {
        "Krotoa": "krotoa"
    },
    {
        " or Eva.      De Klerks upbringing was secure and comfortable.     When de Klerk was twelve years old, the ": null
    },
    {
        "apartheid": "apartheid"
    },
    {
        " system was officially institutionalised by the South African government; his father had been one of its originators. He therefore was, according to his brother, one of a generation that grew up with the concept of apartheid . He was inculturated in the norms and values of Afrikaner society, including festivals like ": null
    },
    {
        "Kruger Day": "kruger day"
    },
    {
        ", loyalty to the Afrikaner nation, and stories of the age of injustice that the Afrikaner faced under the British. He was brought up in the ": null
    },
    {
        "Gereformeerde Kerk": "gereformeerde kerk"
    },
    {
        ", the smallest and most ": null
    },
    {
        "socially conservative": "social conservatism"
    },
    {
        " of South Africas ": null
    },
    {
        "three Dutch Reformed Churches": "dutch reformed church in south africa"
    },
    {
        ".     The de Klerk family moved around South Africa during his childhood, and he changed schools seven times over seven years. He eventually became a boarder at the Monument High School in ": null
    },
    {
        "Krugersdorp": "krugersdorp"
    },
    {
        ", where he graduated with a first-class pass in 1953. He was nevertheless disappointed not to get the four distinctions he was hoping for.         Between 1954 and 1958, de Klerk studied at ": null
    },
    {
        "Potchefstroom University": "potchefstroom university"
    },
    {
        ", graduating with both a ": null
    },
    {
        "Bachelor of Arts": "bachelor of arts"
    },
    {
        " and a ": null
    },
    {
        "Bachelor of Law": "bachelor of law"
    },
    {
        ". He later noted that during this legal training, he became accustomed to thinking in terms of legal principles . While studying there, he became editor of the student newspaper, vice-chair of the student council, and a member of the ": null
    },
    {
        "Afrikaanse Studentebonds": "afrikaanse studentebond"
    },
    {
        "national executive council. At university, he was initiated into the ": null
    },
    {
        "Broederbond": "broederbond"
    },
    {
        ", a secret society for the Afrikaner social elite. As a student, he played both tennis and hockey and was known as something of a ladies man . At the university, he began a relationship with ": null
    },
    {
        "Marike Willemse": "marike de klerk"
    },
    {
        ", the daughter of a professor at the ": null
    },
    {
        "University of Pretoria": "university of pretoria"
    },
    {
        ". The couple married in 1959, when de Klerk was 23 and his wife 22.     After university, de Klerk pursued a legal career, becoming an ": null
    },
    {
        "articled clerk": "articled clerk"
    },
    {
        " with the firm Pelser in Klerksdorp. Relocating to Pretoria, he became an articled clerk for another law firm, Mac-Robert.   In 1962, he set up his own law partnership in ": null
    },
    {
        "Vereeniging": "vereeniging"
    },
    {
        ", Transvaal, which he built into a successful business over ten years.   During this period, he involved himself in a range of other activities. He was the national chair of the Junior Rapportryers for two years, and chair of the Law Society of Vaal Triangle. He was also on the council of the local technikon, on the council of his church, and on a local school board.         In 1972, his alma mater offered him a chair in its law faculty, which he accepted. Within a matter of days he was also approached by members of the National Party, who requested that he stand for the party at ": null
    },
    {
        "Vereeniging": "vereeniging"
    },
    {
        ". De Klerks candidature was successful and in November he was elected to the ": null
    },
    {
        "House of Assembly": "house of assembly of south africa"
    },
    {
        ". There, he established a reputation as a formidable debater. He took on a number of roles in the party and government. He became the information officer of the Transvaal National Party, responsible for its propaganda output, and helped to establish a new National Party youth movement. He joined various party parliamentary study groups, including those on the ": null
    },
    {
        "Bantustans": "bantustans"
    },
    {
        ", labour, justice, and home affairs. As a member of various parliamentary groups, de Klerk went on several foreign visits, to Israel, Germany, the United Kingdom, and United States. It was in the latter in 1976 that he observed what he later described as the pervasive racism of U.S. society, later noting that he saw more racial incidents in one month there than in South Africa in a year . In South Africa, de Klerk also played a senior role in two ": null
    },
    {
        "select committees": "select committees"
    },
    {
        ", one formulating a policy on opening hotels to non-whites and the other formulating a new censorship law that was less strict than the one that had preceded it.     In 1975, Prime Minister ": null
    },
    {
        "John Vorster": "john vorster"
    },
    {
        " predicted that de Klerk would one day become leader of South Africa. Vorster planned to promote de Klerk to the position of a deputy minister in January 1976, but instead the job went to ": null
    },
    {
        "Andries Treurnicht": "andries treurnicht"
    },
    {
        ".   In April 1978, de Klerk was promoted to the position of Minister of Social Welfare and Pensions. In this role, he restored full autonomy to sporting control bodies which had for a time been under the jurisdiction of the government. As minister of Post and Telecommunications he finalised contracts that oversaw the electrification of that sector. As Minister of Mining he formalised a policy on coal exports and the structuring of ": null
    },
    {
        "Eskom": "eskom"
    },
    {
        " and the ": null
    },
    {
        "Atomic Energy Corporation": "atomic energy corporation"
    },
    {
        ". He then became Minister of the Interior, he oversaw the repeal of the Mixed Marriages Act.   In 1981, de Klerk was awarded the Decoration for Meritorious Service for his work in the government.   As education minister between 1984 and 1989 he upheld the apartheid system in South Africas schools, and extended the department to cover all racial groups.     For most of his career, de Klerk had a very conservative reputation, and was seen as someone who would obstruct change in South Africa. He had been a forceful proponent of apartheids system of racial segregation and was perceived as an advocate of the white minoritys interests.   While serving under ": null
    },
    {
        "P. W. Bothas": "p. w. botha"
    },
    {
        "government, de Klerk was never part of Bothas inner circle.         P. W. Botha resigned as leader of the National Party after an apparent stroke, and de Klerk defeated Bothas preferred successor, finance minister ": null
    },
    {
        "Barend du Plessis": "barend du plessis"
    },
    {
        ", in the race to succeed him. On 2 February 1989, he was elected leader of the National Party. He defeated main rival ": null
    },
    {
        "Barend du Plessis": "barend du plessis"
    },
    {
        " to the position by a slim majority of eight votes, 69-61. Soon after, he called for the introduction of a new South African constitution, hinting that it would need to provide greater concession to non-white racial groups. After becoming party leader, de Klerk extended his foreign contacts. He travelled to London, where he met with British Prime Minister ": null
    },
    {
        "Margaret Thatcher": "margaret thatcher"
    },
    {
        ". Although she opposed the anti-apartheid movements calls for economic sanctions against South Africa, at the meeting she urged de Klerk to release the imprisoned anti-apartheid activist ": null
    },
    {
        "Nelson Mandela": "nelson mandela"
    },
    {
        ". He also expressed a desire to meet with representatives of the U.S. government in ": null
    },
    {
        "Washington D.C.": "washington d.c."
    },
    {
        ", although American ": null
    },
    {
        "Secretary of State": "united states secretary of state"
    },
    {
        " James Baker": "james baker"
    },
    {
        " informed him that the U.S. government considered it inopportune to have de Klerk meet with ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " George H. W. Bush": "george h. w. bush"
    },
    {
        ".              Botha resigned on 14 August, and de Klerk was named acting state president until 20 September, when he was elected to a full five-year term as state president.  After he became acting president, ANC leaders spoke out against him, believing that he would be no different from his predecessors; he was widely regarded as a staunch supporter of apartheid. The prominent anti-apartheid activist ": null
    },
    {
        "Desmond Tutu": "desmond tutu"
    },
    {
        " shared this assessment, stating: I dont think weve got to even begin to pretend that there is any reason for thinking that we are entering a new phase. Its just musical chairs . Tutu and ": null
    },
    {
        "Allan Boesak": "allan boesak"
    },
    {
        " had been planning a protest march in Cape Town, which the security chiefs wanted to prevent. De Klerk nevertheless turned down their proposal to ban it, agreeing to let the march proceed and stating that the door to a new South Africa is open, it is not necessary to batter it down . The march took place and was attended by approximately 30,000 people. Further protest marches followed in Grahamstown, Johannesburg, Pretoria, and Durban. De Klerk later noted that his security forces could not have prevented the marchers from gathering: The choice, therefore, was between breaking up an illegal march with all of the attendant risks of violence and negative publicity, or of allowing the march to continue, subject to conditions that could help to avoid violence and ensure good public order.  This decision marked a clear departure from the approach of the Botha era.     As President, he authorised the continuation of secret talks in ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        " between his National Intelligence Service and two exiled ANC leaders, ": null
    },
    {
        "Thabo Mbeki": "thabo mbeki"
    },
    {
        " and ": null
    },
    {
        "Jacob Zuma": "jacob zuma"
    },
    {
        ". In October, he personally agreed to meet with Tutu, Boesak, and ": null
    },
    {
        "Frank Chikane": "frank chikane"
    },
    {
        " in a private meeting in Pretoria. That month, he also released a number of elderly anti-apartheid activists then imprisoned, including ": null
    },
    {
        "Walter Sisulu": "walter sisulu"
    },
    {
        ". He also ordered the closure of the ": null
    },
    {
        "National Security Management System": "national security management system"
    },
    {
        ".   In December he visited Mandela in prison, speaking with him for three hours about the idea of transitioning away from white-minority rule. The collapse of the ": null
    },
    {
        "Eastern Bloc": "eastern bloc"
    },
    {
        " and the dissolution of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " meant that he no longer feared that ": null
    },
    {
        "Marxists": "marxism"
    },
    {
        " would manipulate the ANC. As he later related, the collapse of the Marxist economic system in Eastern Europe... serves as a warning to those who insist on persisting with it in Africa. Those who seek to force this failure of a system on South Africa should engage in a total revision of their point of view. It should be clear to all that it is not the answer here either.           On 2 February 1990, in an address to the countrys parliament, he introduced plans for sweeping reforms of the political system. A number of banned political parties, including the ANC and ": null
    },
    {
        "Communist Party of South Africa": "communist party of south africa"
    },
    {
        ", would be legalised, although he empasized that this did not constitute an endorsement of their socialist economic policies nor of violent actions carried out by their members, and the ": null
    },
    {
        "Separate Amenities Act of 1953": "reservation of separate amenities act, 1953"
    },
    {
        ", which governed the segregation of public facilities, would be lifted and all of those who were imprisoned solely for belonging to a banned organisation would be freed, including Nelson Mandela; the latter was released a week later. The vision set forth in de Klerks address was for South Africa to become a Western-style ": null
    },
    {
        "liberal democracy": "liberal democracy"
    },
    {
        "; with a market-oriented economy which valued private enterprise and restricted the governments role in economics.     De Klerk later related that that speech was mainly aimed at breaking our stalemate in Africa and the West. Internationally we were teetering on the edge of the abyss.  Throughout South Africa and across the world, there was astonishment at de Klerks move. Foreign press coverage was largely positive and de Klerk received messages of support from other governments. Tutu said that Its incredible... Give him credit. Give him credit, I do.  Some black radicals regarded it as a gimmick and that it would prove to be without substance. It was also received negatively by some on the white right-wing, including in the ": null
    },
    {
        "Conservative Party": "conservative party"
    },
    {
        ", who believed that de Klerk was betraying the white population. De Klerk believed that the sudden growth of the Conservatives and other white right-wing groups was a passing phase reflecting anxiety and insecurity. These white right-wing groups were aware that they would not get what they wanted through the forthcoming negotiations, and so increasingly tried to derail the negotiations using revolutionary violence. The white-dominated liberal ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " found itself in limbo, as de Klerk embraced much of the platform it had espoused, leaving it without a clear purpose.     Further reforms followed; membership of the National Party was opened up to non-whites. In June, parliament approved new legislation that repealed the ": null
    },
    {
        "Natives Land Act, 1913": "natives land act, 1913"
    },
    {
        " and ": null
    },
    {
        "Native Trust and Land Act, 1936": "native trust and land act, 1936"
    },
    {
        ". The ": null
    },
    {
        "Population Registration Act": "population registration act"
    },
    {
        ", which established the racial classificatory guidelines for South Africa, was rescinded.     In legislative terms, he enabled the gradual end of apartheid. De Klerk also opened the way for the negotiations of the government with the anti-apartheid-opposition about a new constitution for the country. Nevertheless, he was accused by ": null
    },
    {
        "Anthony Sampson": "anthony sampson"
    },
    {
        " of complicity in the violence among the ANC, the ": null
    },
    {
        "Inkatha Freedom Party": "inkatha freedom party"
    },
    {
        " and elements of the security forces. In  Mandela: The Authorised Biography , Sampson accuses de Klerk of permitting his ministers to build their own criminal empires.                        His presidency was dominated by the ": null
    },
    {
        "negotiation process": "negotiations to end apartheid in south africa"
    },
    {
        ", mainly between his NP government and the ANC, which led to the democratization of South Africa. Throughout the negotiations, de Klerk primarily sought to prevent majority rule to preserve power for the white South African minority. His efforts, however, were thwarted when the ": null
    },
    {
        "Boipatong massacre": "boipatong massacre"
    },
    {
        " caused a resurgence of international pressure against South Africa, leading to a weaker position at the negotiation tables for the National party.  In 1992, de Klerk held a whites-only ": null
    },
    {
        "referendum on ending apartheid": "1992 south african apartheid referendum"
    },
    {
        ", with the result being an overwhelming yes vote to continue negotiations to end apartheid. Nelson Mandela was distrustful of the role played by de Klerk in the negotiations, particularly as he believed that de Klerk was knowledgeable about third force attempts to foment violence in the country and destabilize the negotiations.      In 1990, de Klerk gave orders to end ": null
    },
    {
        "South Africas nuclear weapons programme": "south africa and weapons of mass destruction"
    },
    {
        "; the process of nuclear disarmament was essentially completed in 1991. The existence of the programme was not officially acknowledged before 1993. Von Wielligh, N. & von Wielligh-Steyn, L. . The Bomb – South Africa’s Nuclear Weapons Programme. Pretoria: Litera.      In 1993, de Klerk and Mandela were jointly awarded the ": null
    },
    {
        "Nobel Peace Prize": "nobel peace prize"
    },
    {
        " for their work in ending apartheid. The awarding of the prize to de Klerk was controversial, especially in the light of de Klerks reported admission that he ordered a massacre of supposed ": null
    },
    {
        "Azanian Peoples Liberation Army": "azanian peoples liberation army"
    },
    {
        " fighters, including teenagers, shortly before going to Oslo in 1993.  It appears that this massacre may form part of the basis for criminal charges that the Anti-Racism Action Forum laid against de Klerk in early 2016.  Further, de Klerks role in the destabilization of the country during the negotiation process through the operation of a third force came to the attention of the Truth and Reconciliation Commission, and was never ultimately clarified.       After the first ": null
    },
    {
        "universal elections in 1994": "1994 south african general election"
    },
    {
        ", de Klerk became deputy president in the government of national unity under Nelson Mandela, a post he kept until 1996. In 1997 he resigned the leadership of the National Party and retired from politics.     In 1993, de Klerk issued an apology for the actions of the apartheid government, stating that: It was not our intention to deprive people of their rights and to cause misery, but eventually apartheid led to just that. Insofar as that occurred we deeply regret it... Yes we are sorry . Tutu urged for people to accept the apology, stating that saying sorry is not an easy thing to do... We should be magnanimous and accept it as a magnanimous act , although was privately frustrated that de Klerks apology had been qualified and had not gone so far as to call apartheid an intrinsically evil policy.         De Klerk had been unhappy that changes had been made to the inauguration ceremony, rendering it multi-religious rather than reflecting the newly elected leaders particular denomination. When he was being sworn in, and the chief justice said So help me God , de Klerk did not repeat this, instead stating, in Afrikaans: So help me the triune God, Father, Son, and Holy Spirit .     Mandela reappointed de Klerks finance minister, ": null
    },
    {
        "Derek Keys": "derek keys"
    },
    {
        ", and retained ": null
    },
    {
        "Chris Stals": "chris stals"
    },
    {
        ", a former member of the Broederbond, as the head of the Central Bank.   De Klerk supported the coalitions economic policies, stating that it accepted a broad framework of responsible economic policies .     De Klerks working relationship with Mandela was often strained, with the former finding it difficult adjusting to the fact that he was no longer president. De Klerk also felt that Mandela deliberately humiliated him, while Mandela found de Klerk to be needlessly provocative in cabinet. One dispute occurred in September 1995, after Mandela gave a Johannesburg speech criticising the National Party. Angered, de Klerk avoided Mandela until the latter requested they meet; when they ran into each other, they publicly argued in the street. Mandela later expressed regret for their disagreement but did not apologise for his original comments.   De Klerk was also having problems from within his own party, some of whose members claimed that he was neglecting the party while in the government.     Many in the National Party—including many members of its executive committee—were unhappy with the other parties agreed upon new constitution in May 1996. The party had wanted the constitution to guarantee that it would be represented in the government until 2004, although it did not do this.   On 9 May, de Klerk withdrew the National Party from the coalition government. The decision shocked several of his six fellow Afrikaner cabinet colleagues; ": null
    },
    {
        "Pik Botha": "pik botha"
    },
    {
        ", for example, was left without a job as a result. ": null
    },
    {
        "Roelf Meyer": "roelf meyer"
    },
    {
        " felt betrayed by de Klerks act, while ": null
    },
    {
        "Leon Wessels": "leon wessels"
    },
    {
        " thought that de Klerk had not tried hard enough to make the coalition work. De Klerk declared that he would lead the National Party in vigorous opposition to Mandelas government to ensure a proper multi-party democracy, without which there may be a danger of South Africa lapsing into the African pattern of one-party states .              In de Klerks view, his greatest defeat in the negotiations with Mandela had been his inability to secure a blanket amnesty for all those working for the government or state during the apartheid period.   De Klerk was unhappy with the formation of the ": null
    },
    {
        "Truth and Reconciliation Commission": "truth and reconciliation commission"
    },
    {
        " . He had hoped that the TRC would be made up of an equal number of individuals from both the old and new governments, as there had been in the ": null
    },
    {
        "Chilean human rights commission": "rettig report"
    },
    {
        ". Instead, the TRC was designed to broadly reflect the wider diversity of South African society, and contained only two members who had explicitly supported apartheid, one a member of a right-wing group that had opposed de Klerks National Party. De Klerk did not object to Tutu being selected as the TRCs chair for he regarded him as politically independent of Mandelas government, but he was upset that ": null
    },
    {
        "Alex Boraine": "alex boraine"
    },
    {
        " had been selected as its deputy chair, later saying of Boraine: beneath an urbane and deceptively affable exterior beat the heart of a zealot and an inquisitor.      De Klerk appeared before the TRC hearing to testify for ": null
    },
    {
        "Vlakplaas": "vlakplaas"
    },
    {
        " commanders who were accused of having committed human rights abuses during the apartheid era. He acknowledged that security forces had resorted to unconventional strategies in dealing with anti-apartheid revolutionaries, but that within my knowledge and experience, they never included the authorisation of assassination, murder, torture, rape, assault or the like . After further evidence of said abuses was produced by the commission, de Klerk stated that he found the revelations to be as shocking and as abhorrent as anybody else but insisted that he and other senior party members were not willing to accept responsibility for the criminal actions of a handful of operatives , stating that their behaviour was not authorised not intended by his government. Given the widespread and systemic nature of the abuses that had taken place, as well as statements by security officers that their actions had been sanctioned by higher ranking figures, Tutu questioned how de Klerk and other government figures could not have been aware of them. Tutu had hoped that de Klerk or another senior white political figure from the apartheid era would openly accept responsibility for the human rights abuses, thereby allowing South Africa to move on; this was something that de Klerk would not do.     The TRC found de Klerk guilty of being an accessory to gross violations of human rights on the basis that as State President he had been told that P. W. Botha had authorised the bombing of Khotso House but had not revealed this information to the Committee. De Klerk challenged the TRC on this point, and it backed down. When the final TRC report was released 2002, it made a more limited accusation: that de Klerk had failed to give full disclosure about events that took place during his Presidency and that in view of his knowledge about the Khotso House bombing, his statement that none of his colleagues had authorised gross human rights abuses was indefensible .   In his later autobiography, de Klerk acknowledged that the TRC did significant damage to his public image.       In 1997, de Klerk was offered the Harper Fellowship at ": null
    },
    {
        "Yale Law School": "yale law school"
    },
    {
        ". He declined, citing protests at the university. Gold, Emily. .  . Yale Herald, 23. Retrieved 29 May 2012. De Klerk did, however, ": null
    },
    {
        "speak": "robert c. vance distinguished lecture series"
    },
    {
        " at ": null
    },
    {
        "Central Connecticut State University": "central connecticut state university"
    },
    {
        " the day before his fellowship would have begun.          In 1999, de Klerk and his wife of 38 years, ": null
    },
    {
        "Marike de Klerk": "marike de klerk"
    },
    {
        ", were divorced following the discovery of his affair with Elita Georgiades,  then the wife of ": null
    },
    {
        "Tony Georgiades": "tony georgiades"
    },
    {
        ", a Greek shipping tycoon who had allegedly given de Klerk and the NP financial support.  Soon after his divorce, de Klerk and Georgiades were married. His divorce and remarriage scandalised conservative South African opinion, especially among the ": null
    },
    {
        "Calvinist Afrikaners": "afrikaner calvinism"
    },
    {
        ". In 2000, his autobiography, The Last Trek – A New Beginning, was published. In 2002, following the murder of his former wife, the manuscript of her own autobiography, A Place Where the Sun Shines Again, was submitted to de Klerk, who urged the publishers to suppress a chapter dealing with his infidelity.      In 2000, de Klerk established the pro-peace ": null
    },
    {
        "FW de Klerk Foundation": "fw de klerk foundation"
    },
    {
        " of which he is the chairman. De Klerk is also chairman of the ": null
    },
    {
        "Global Leadership Foundation": "global leadership foundation"
    },
    {
        ", headquartered in London, which he set up in 2004, an organisation which works to support democratic leadership, prevent and resolve conflict through mediation and promote good governance in the form of democratic institutions, open markets, human rights and the rule of law. It does so by making available, discreetly and in confidence, the experience of former leaders to todays national leaders. It is a not-for-profit organisation composed of former heads of government and senior governmental and international organisation officials who work closely with heads of government on governance-related issues of concern to them.     On 3 December 2001, Marike de Klerk was found stabbed and strangled to death in her ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        " flat. De Klerk, who was on a brief visit to ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ", Sweden, to celebrate the 100-year anniversary of the Nobel Prize foundation, immediately returned to mourn his dead ex-wife. The atrocity was reportedly condemned strongly by South African president ": null
    },
    {
        "Thabo Mbeki": "thabo mbeki"
    },
    {
        " and ": null
    },
    {
        "Winnie Mandela": "winnie mandela"
    },
    {
        ", among others, who openly spoke in favour of Marike de Klerk. On 6 December, 21-year-old security guard Luyanda Mboniswa was arrested for the murder. On 15 May 2003, he received two life sentences for murder, as well as three years for breaking into Marike de Klerks apartment.      In 2004, de Klerk quit the ": null
    },
    {
        "New National Party": "new national party"
    },
    {
        " and sought a new political home after it the NNP merged with the ruling ANC. That same year, while giving an interview to US journalist ": null
    },
    {
        "Richard Stengel": "richard stengel"
    },
    {
        ", de Klerk was asked whether South Africa had turned out the way he envisioned it back in 1990. His response was:     There are a number of imperfections in the new South Africa where I would have hoped that things would be better, but on balance I think we have basically achieved what we set out to achieve. And if I were to draw balance sheets on where South Africa stands now, I would say that the positive outweighs the negative by far. There is a tendency by commentators across the world to focus on the few negatives which are quite negative, like how are we handling AIDS, like our role vis-à-vis Zimbabwe. But the positives – the stability in South Africa, the adherence to well-balanced economic policies, fighting inflation, doing all the right things in order to lay the basis and the foundation for sustained economic growth – are in place.      In 2008, he repeated in a speech that despite all the negatives facing South Africa, he is very positive about the country .      In 2006, he underwent surgery for a malignant tumour in his colon. His condition deteriorated sharply, and he underwent a ": null
    },
    {
        "tracheotomy": "tracheotomy"
    },
    {
        " after developing respiratory problems.    He recovered and on 11 September 2006 gave a speech at ": null
    },
    {
        "Kent State University Stark Campus": "kent state university stark campus"
    },
    {
        ".   , CNN World Africa, 21 December 2006.     In January 2007, de Klerk was a speaker promoting peace and democracy in the world at the Towards a Global Forum on New Democracies event in Taipei, Taiwan, along with other dignitaries including Polands ": null
    },
    {
        "Lech Wałęsa": "lech wałęsa"
    },
    {
        " and Taiwans then president ": null
    },
    {
        "Chen Shui-Bian": "chen shui-bian"
    },
    {
        ".           De Klerk is an Honorary Patron of the ": null
    },
    {
        "University Philosophical Society": "university philosophical society"
    },
    {
        " of ": null
    },
    {
        "Trinity College, Dublin": "trinity college, dublin"
    },
    {
        ", and Honorary Chairman of the ": null
    },
    {
        "Prague Society for International Cooperation": "prague society for international cooperation"
    },
    {
        ". He has also received the Gold Medal for Outstanding Contribution to Public Discourse from the ": null
    },
    {
        "College Historical Society": "college historical society"
    },
    {
        " of Trinity College, Dublin, for his contribution to ending apartheid.     De Klerk is also a Member of the Advisory Board of the Global Panel Foundation  based in Berlin, Copenhagen, New York, Prague, Sydney and Toronto – founded by the Dutch entrepreneur Bas Spuybroek in 1988, with the support of Dutch billionaire Frans Lurvink and former Dutch Foreign Minister ": null
    },
    {
        "Hans van den Broek": "hans van den broek"
    },
    {
        ". The Global Panel Foundation is known for its behind-the-scenes work in public policy and the annual presentation of the ": null
    },
    {
        "Hanno R. Ellenbogen Citizenship Award": "hanno r. ellenbogen citizenship award"
    },
    {
        " with the ": null
    },
    {
        "Prague Society for International Cooperation": "prague society for international cooperation"
    },
    {
        ".     After the inauguration of ": null
    },
    {
        "Jacob Zuma": "jacob zuma"
    },
    {
        " as South Africas president in May 2009, de Klerk said he is optimistic that Zuma and his government can confound the prophets of doom .      In a BBC interview broadcast in April 2012, he said he lived in an all-white neighbourhood. He had five servants, three coloured and two black: We are one great big family together; we have the best of relationships. About Nelson Mandela, he said, When Mandela goes it will be a moment when all South Africans put away their political differences, will take hands, and will together honour maybe the biggest known South African that has ever lived. Interview by Stephen Sackur on Hardtalk, broadcast on BBC World Service 18 & 19 April 2012.     Upon hearing of the ": null
    },
    {
        "death of Mandela": "death of nelson mandela"
    },
    {
        ", de Klerk said: He was a great unifier and a very, very special man in this regard beyond everything else he did. This emphasis on reconciliation was his biggest legacy.  He attended the memorial service for him on December 10, 2013.     In 2015, de Klerk wrote to The Times newspaper in the UK criticising moves to remove a statue to ": null
    },
    {
        "Cecil Rhodes": "cecil rhodes"
    },
    {
        " at ": null
    },
    {
        "Oriel College, Oxford": "oriel college, oxford"
    },
    {
        ".  He was subsequently criticized by some activists who described it as ironic that the last apartheid President should be defending a statue of a man labelled by critics as the architect of apartheid .  The ": null
    },
    {
        "Economic Freedom Fighters": "economic freedom fighters"
    },
    {
        " called for him to be stripped of his Nobel Peace Prize.           De Klerk was widely regarded as a politically conservative figure in South Africa. At the same time, he was flexible rather than dogmatic in his approach to political issues.   He often hedged his bets and sought to accommodate divergent perspectives, favouring compromise over confrontation.   Within the National Party, he continually strove for unity, coming to be regarded—according to his brother—as a party man, a veritable Mr National Party . To stem defections from the right-wing end of the National Party, he made ultra-conservative noises . This general approach led to the perception that he was trying to be all things to all men .     De Klerk stated that within the party, he never formed part of a political school of thought, and I deliberately kept out of the cliques and foments of the enlightened and conservative factions in the party. If the policy I propounded was ultra-conservative, then that was the policy; it was not necessarily I who was ultra-conservative. I saw my role in the party as that of an interpreter of the partys real median policy at any stage.    De Klerk stated that The silver thread throughout my career was my advocacy of National Party policy in all its various formulations. I refrained from adjusting that policy or adapting it to my own liking or convictions. I analysed it as it was formulated, to the letter.      For much of his career, de Klerk believed in apartheid and its system of racial segregation.   According to his brother, de Klerk underwent a political conversion that took him from supporting apartheid to facilitating its demolition. This change was not a dramatic event however, but was built... on pragmatism - it evolved as a process.    He did not believe that South Africa would become a non-racial society , but rather sought to build a non-racist society in which ethnic divisions remained; in his view I do not believe in the existence of anything like a non-racial society in the literal sense of the word , citing the example of the United States and United Kingdom where there was no legal racial segregation but that distinct racial groups continued to exist.     De Klerk accepted the principle of ": null
    },
    {
        "freedom of religion": "freedom of religion"
    },
    {
        ", although still believed that the state should promote Christianity.         Glad and Blanton stated that de Klerks political choices were undergirded by self-confidence and commitment to the common good.  His brother Willem stated that de Klerks demeanour was marked by soberness, humility and calm , that he was an honest, intelligent, and open minded individual, and that he had a natural cordiality and a solid sense of courtesy and good manners . He felt that de Klerks charisma came not from an exceptionally strong individualism but from his rationality, logic and balance . He was, according to de Klerk, a man of compromise rather than a political innovator or entrepreneur .     Willem stated that he keeps an ear to the ground and is sensitive to the slightest tremors , and that it was this which made him a superb politician . Willem also stated that his brother was a team-man who consults others, takes them into his confidence, honestly shares information with his colleagues, and has a knack of making people feel importance and at peace .   His former wife Marike described de Klerk as being extremely sensitive to beautiful things , exhibiting something akin to an artistic temperament.     Willem also noted that in the most profound sense , de Klerk was driven by his concern for Afrikanerdom and the survival of his own people in their fatherland . De Klerk was deeply upset that many Afrikaners did not realise that his reforms to dismantle apartheid were carried out with the intention of preserving a future for the Afrikaner people in South Africa.     With Marike, de Klerk had three children: Jan, who became a farmer in Western Transvaal, Willem, who went into ": null
    },
    {
        "public relations": "public relations"
    },
    {
        ", and Susan, who became a teacher. Willem stated that de Klerk had a close relationship with his children, and that he was a loving man who hugs and cuddles .     De Klerk was a chain smoker and also enjoyed a glass of whisky or wine while relaxing. In adult life, he enjoyed playing golf and hunting, as well as going for brisk walks.         Glad and Blanton stated that de Klerk, along with Mandela, accomplished the rare feat of bringing about systemic revolution through peaceful means.  His brother noted that de Klerks role in South African history was to dismantle more than three centuries of white supremacy , and that in doing so his was not a role of white surrender, but a role of white conversion to a new role in society.   In September 1990, Potchefstroom University awarded de Klerk with an honorary doctorate.     South Africas Conservative Party came to regard him as its most hated adversary.": null
    }
]