[
    {
        "A false document is a technique, employed to create ": null
    },
    {
        "verisimilitude": "verisimilitude"
    },
    {
        " in a work of fiction, where an author tries to create a sense of authenticity beyond the normal and expected suspension of disbelief for a ": null
    },
    {
        "work of art": "work of art"
    },
    {
        " by inventing and inserting documents that appear to be factual. The goal of a false document is to convince an audience that what is being presented is factual.       A ": null
    },
    {
        "forged": "forgery"
    },
    {
        " document, the ": null
    },
    {
        "Zinoviev Letter": "zinoviev letter"
    },
    {
        ", helped bring the downfall of the first ": null
    },
    {
        "Labour Government": "labour party"
    },
    {
        " in Britain. Conspiracies within secret intelligence services have occurred more recently, leading ": null
    },
    {
        "Harold Wilson": "harold wilson"
    },
    {
        " to put in place rules to prevent in the 1960s ": null
    },
    {
        "phone tapping": "phone tapping"
    },
    {
        " of ": null
    },
    {
        "members of Parliament": "members of parliament"
    },
    {
        ", for example.      The Protocols of the Elders of Zion , purporting to describe a ": null
    },
    {
        "Jew": "jew"
    },
    {
        "ish plan for global domination, was first published in Russia in 1903, translated into multiple languages, and disseminated internationally in the early part of the 20th century.       Artist ": null
    },
    {
        "JSG Boggss": "j. s. g. boggs"
    },
    {
        "life and work have been extensively explored by author and journalist ": null
    },
    {
        "Lawrence Weschler": "lawrence weschler"
    },
    {
        ". Boggs drew currency with exceptional care and accuracy, but he only ever drew one side. He then attempted to buy things with the piece of paper upon which he has drawn the currency. His goal was to pass each bill for its face value in common transactions. He bought lunch, clothes, and lodging in this manner, and after the transactions were complete, his bills fetched many times their face value on the art market. Boggs did not make any money from the much larger art market value of his work, only from reselling the goods bought, the change and receipts and other such materials. He was arrested in many countries, and there was much controversy surrounding his work.     ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        "  F for Fake  is a prime example of a film which is both about falsification  as well as having falsified moments within the film. The movie follows the exploits of a famous art forger, his biographer ": null
    },
    {
        "Clifford Irving": "clifford irving"
    },
    {
        ", and the subsequent fake ": null
    },
    {
        "autobiography": "autobiography"
    },
    {
        " of ": null
    },
    {
        "Howard Hughes": "howard hughes"
    },
    {
        " that Irving tries to publish. The issues of veracity and forgery are explored in the film, while at the same time, Welles tricks the audience by incorporating fake bits of narrative alongside the documentary footage.       There is a long history of producers creating tie-in material to promote and merchandise movies and television shows. Tie-in materials as far-ranging as toys, games, lunch boxes, clothing and so on have all been created and in some cases generate as much or more revenue as the original programming. One big merchandising arena is publishing. In most cases such material is not considered ": null
    },
    {
        "canon": "canon"
    },
    {
        " within the shows mythology; however, in some instances the books, magazines, etc. are specifically designed by the creators to be canonical. With the rise of the Internet, in-canon online material has become more prominent.          A number of ": null
    },
    {
        "hoax": "hoax"
    },
    {
        "es have involved false documents:   ": null
    },
    {
        "Salamander Letter": "salamander letter"
    },
    {
        "  The Report From Iron Mountain  ": null
    },
    {
        "Oera Linda": "oera linda"
    },
    {
        " book   The ": null
    },
    {
        "Hitler Diaries": "hitler diaries"
    },
    {
        "  Dossiers Secrets dHenri Lobineau               ": null
    },
    {
        "Pseudepigrapha": "pseudepigrapha"
    },
    {
        " are ": null
    },
    {
        "falsely attributed": "false attribution"
    },
    {
        " works, texts whose claimed author is not the true author, or a work whose real author attributed it to a figure of the past. Bauckham, Richard; Pseudo-Apostolic Letters , Journal of Biblical Literature, Vo. 107, No. 3, September 1988, pp. 469–94. Pseudepigraphy covers the false ascription of names of ": null
    },
    {
        "authors": "author"
    },
    {
        "to works, even to authentic works that make no such claim within their text. Thus a widely accepted but incorrect attribution of authorship may make a completely authentic text pseudepigraphical. Assessing the actual writer of a text locates questions of pseudepigraphical attribution within the discipline of ": null
    },
    {
        "literary criticism": "literary criticism"
    },
    {
        ".     In ": null
    },
    {
        "biblical studies": "biblical studies"
    },
    {
        ", the term pseudepigrapha typically refers to an assorted collection of Jewish religious works thought to be written c. 300 BC to 300 AD. They are distinguished by ": null
    },
    {
        "Protestants": "protestantism"
    },
    {
        " from the ": null
    },
    {
        "Deuterocanonical books": "deuterocanonical books"
    },
    {
        " or ": null
    },
    {
        "Apocrypha": "apocrypha"
    },
    {
        " , the books that appear in extant copies of the ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        " from the fourth century on,  and the ": null
    },
    {
        "Vulgate": "vulgate"
    },
    {
        " but not in the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        " or in ": null
    },
    {
        "Protestant Bible": "protestant bible"
    },
    {
        "s.  The ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " distinguishes only between the deuterocanonical and all the other books, that are called ": null
    },
    {
        "biblical apocrypha": "biblical apocrypha"
    },
    {
        ", a name that is also used for the pseudepigrapha in the Catholic usage. In addition, two books considered canonical in the ": null
    },
    {
        "Orthodox Tewahedo": "orthodox tewahedo"
    },
    {
        " churches, viz. ": null
    },
    {
        "Book of Enoch": "book of enoch"
    },
    {
        " and ": null
    },
    {
        "Book of Jubilees": "book of jubilees"
    },
    {
        ", are categorized as pseudepigrapha from the point of view of ": null
    },
    {
        "Chalcedonian Christianity": "chalcedonian christianity"
    }
]