[
    {
        "         In ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", false friends are words in different languages that look or sound similar, but differ significantly in meaning. An example is the English embarrassed and the Spanish  embarazada  , the word parents and the ": null
    },
    {
        "Portuguese": "portuguese language"
    },
    {
        " parentes , or the word sensible, which means reasonable in English, but sensitive in French and Spanish.     The term originates from a book by French linguists describing the phenomenon, which was translated in 1928 and entitled, false friend of a translator .     As well as producing completely false friends, the use of ": null
    },
    {
        "loanwords": "loanword"
    },
    {
        "often results in the use of a word in a restricted ": null
    },
    {
        "context": "context"
    },
    {
        ", which may then develop new meanings not found in the original language. For example, angst means fear in a general sense in German, but when it was borrowed into English in the context of psychology, its meaning was restricted to a particular type of fear described as a neurotic feeling of anxiety and depression .  Also, gymnasium meant both a place of education and a place for exercise in Latin, but its meaning was restricted to the former in German and to the latter in English, making the expressions into false friends in those languages as well as in Greek, where it started out as a place for naked exercise.          False friends, or bilingual homophones  are words in two or more languages that ": null
    },
    {
        "look": "homonym"
    },
    {
        " or ": null
    },
    {
        "sound": "homophone"
    },
    {
        " similar, but differ significantly in meaning.      The origin of the term is as a shortened version of the expression false friend of a translator , the English translation of a French expression  introduced by linguists Maxime Kœssler and Jules Derocquigny in their 1928 book,  False Friends, or the Pitfalls of the English Vocabulary   with a sequel, Autres Mots anglais perfides.       From the ": null
    },
    {
        "etymological": "etymology"
    },
    {
        " point of view, false friends can be created in several ways.       If language A borrowed a word from language B, or both borrowed the word from a third language or inherited it from a common ancestor, and later the word shifted in meaning or acquired additional meanings in at least one of these languages, a ": null
    },
    {
        "native speaker": "first language"
    },
    {
        " of one language will face a false friend when learning the other. Sometimes, presumably both senses were present in the common ancestor language, but the cognate words got different restricted senses in Language A and Language B.     Actual, which in English is usually a synonym of real, has a different meaning in other European languages, in which it means current or up-to-date, and has the logical derivative as a ": null
    },
    {
        "verb": "verb"
    },
    {
        ", meaning to make current or to update. Actualise in English means to make a reality of.      The word friend itself has cognates in the other Germanic languages; but the Scandinavian ones  predominantly mean relative. The original ": null
    },
    {
        "Proto-Germanic": "proto-germanic"
    },
    {
        " word meant simply someone whom one cares for and could therefore refer to both a friend and a relative, but lost various degrees of the friend sense in Scandinavian languages, while it mostly lost the sense of relative in English.      The ": null
    },
    {
        "Estonian": "estonian language"
    },
    {
        " and ": null
    },
    {
        "Finnish languages": "finnish language"
    },
    {
        "are closely related, which gives rise to false friends:        Or Estonian vaimu ‘spirit; ghost’ and Finnish vaimo ‘wife’, ; or Estonian huvitav ‘interesting’ and Finnish huvittava ‘amusing’.     A high level of lexical similarity exists between ": null
    },
    {
        "German": "german language"
    },
    {
        " and ": null
    },
    {
        "Dutch": "dutch language"
    },
    {
        ",  but shifts in meaning of words with a shared etymology have in some instances resulted in bi-directional false friends:             In Belgium, similarities between Dutch and French words often lead to confusion when several different meanings of the same word are mixed up and thus mistranslated. In satirical sketch comedy  Sois Belge et tais-toi! , performed by Joël Riguelle in 2009, the following examples are given:           The Italian word confetti ‘sugared almonds’ has acquired a new meaning in English, French and Dutch; in Italian, the corresponding word is coriandoli.      English and Spanish, both of which have borrowed from ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " and ": null
    },
    {
        "Latin": "latin language"
    },
    {
        ", have multiple false friends, such as:     -Sp. darse cuenta - Engl. realize / Sp. realizar - Engl. carry out     -Sp. realmente - Engl. actually / Sp. actualmente - Engl. presently     -Sp. publicidad - Engl. advert / Sp. advertencia - Engl. warning.     -Sp. extraño - Engl. bizarre / Sp. bizarro - Engl. brave.     English and Japanese also have diverse false friends, many of them being  wasei-eigo  and  gairaigo  words.               In Swedish, the word rolig means fun: ett roligt skämt , while in the closely related languages Danish and Norwegian it means calm . However, the Swedish original meaning of calm is retained in some related words such as ro, calmness, and orolig, worrisome, anxious, literally un-calm.  The Danish and Norwegian word semester means term , but the Swedish word semester means holiday. The Danish word frokost means lunch, the Norwegian word frokost means breakfast.     In French, the word https://fr.wiktionary.org/wiki/hure Hure refers to the head of a boar, while in German  Hure  means prostitute.            ": null
    },
    {
        "Pseudo-anglicisms": "pseudo-anglicism"
    },
    {
        "are new words formed from English ": null
    },
    {
        "morphemes": "morpheme"
    },
    {
        "independently from an analogous English construct and with a different intended meaning.      ": null
    },
    {
        "Japanese": "japanese language"
    },
    {
        " is replete with pseudo-anglicisms, known as  wasei-eigo  .       In bilingual situations, false friends often result in a ": null
    },
    {
        "semantic change": "semantic change"
    },
    {
        "—a real new meaning that is then commonly used in a language. For example, the ": null
    },
    {
        "Portuguese": "portuguese language"
    },
    {
        " humoroso changed its referent in American Portuguese to humorous, owing to the ": null
    },
    {
        "English": "english language"
    },
    {
        " surface-cognate humorous.      Corn  was originally the dominant type of grain in a region . It means usually ": null
    },
    {
        "cereals": "cereal"
    },
    {
        "in general in the British Isles, but has come to mean exclusively ": null
    },
    {
        "maize": "maize"
    },
    {
        " in North America.     The American ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " fattoria lost its original meaning farm in favor of factory owing to the phonetically similar surface-cognate ": null
    },
    {
        "English": "english language"
    },
    {
        " factory . Instead of the original fattoria, the phonetic adaptation American ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " farma became the new signifier for farm .     This phenomenon is analyzed by ": null
    },
    {
        "Ghilad Zuckermann": "ghilad zuckermann"
    },
    {
        " as ": null
    },
    {
        "phono-semantic matching": "phono-semantic matching"
    },
    {
        " . ": null
    }
]