[
    {
        "           A fast Fourier transform  is an ": null
    },
    {
        "algorithm": "algorithm"
    },
    {
        " that computes the ": null
    },
    {
        "discrete Fourier transform": "discrete fourier transform"
    },
    {
        " of a sequence, or its inverse . ": null
    },
    {
        "Fourier analysis": "fourier analysis"
    },
    {
        " converts a signal from its original domain to a representation in the ": null
    },
    {
        "frequency domain": "frequency domain"
    },
    {
        " and vice versa. The DFT is obtained by decomposing a ": null
    },
    {
        "sequence": "sequence"
    },
    {
        " of values into components of different frequencies. This operation is useful in many fields, but computing it directly from the definition is often too slow to be practical. An FFT rapidly computes such transformations by ": null
    },
    {
        "factorizing": "matrix decomposition"
    },
    {
        " the ": null
    },
    {
        "DFT matrix": "dft matrix"
    },
    {
        " into a product of ": null
    },
    {
        "sparse": "sparse matrix"
    },
    {
        " factors. As a result, it manages to reduce the ": null
    },
    {
        "complexity": "computational complexity theory"
    },
    {
        " of computing the DFT from O\\left , which arises if one simply applies the definition of DFT, to O , where N is the data size. The difference in speed can be enormous, especially for long data sets where N may be in the thousands or millions. In the presence of ": null
    },
    {
        "round-off error": "round-off error"
    },
    {
        ", many FFT algorithms are much more accurate than evaluating the DFT definition directly or indirectly. There are many different FFT algorithms based on a wide range of published theories, from simple ": null
    },
    {
        "complex-number arithmetic": "complex number"
    },
    {
        " to ": null
    },
    {
        "group theory": "group theory"
    },
    {
        " and ": null
    },
    {
        "number theory": "number theory"
    },
    {
        ".     Fast Fourier transforms are widely used for ": null
    },
    {
        "applications": "discrete fourier transformapplications"
    },
    {
        " in engineering, music, science, and mathematics. The basic ideas were popularized in 42 but some algorithms had been derived as early as 42 In 42 ": null
    },
    {
        "Gilbert Strang": "gilbert strang"
    },
    {
        " described the FFT as the most important ": null
    },
    {
        "numerical algorithm": "numerical analysis"
    },
    {
        " of our lifetime , and it was included in Top 42 Algorithms of 42th Century by the ": null
    },
    {
        "IEEE": "ieee"
    },
    {
        " magazine Computing in Science & Engineering.     The best-known FFT algorithms depend upon the ": null
    },
    {
        "factorization": "factorization"
    },
    {
        " of N, but there are FFTs with ": null
    },
    {
        "O": "big o notation"
    },
    {
        " complexity": "computational complexity theory"
    },
    {
        " for all N, even for ": null
    },
    {
        "prime": "prime number"
    },
    {
        "  N. Many FFT algorithms only depend on the fact that e^ is an N-th ": null
    },
    {
        "primitive root of unity": "primitive root of unity"
    },
    {
        ", and thus can be applied to analogous transforms over any ": null
    },
    {
        "finite field": "finite field"
    },
    {
        ", such as ": null
    },
    {
        "number-theoretic transform": "number-theoretic transform"
    },
    {
        "s. Since the inverse DFT is the same as the DFT, but with the opposite sign in the exponent and a 42/N factor, any FFT algorithm can easily be adapted for it.       The development of fast algorithms for DFT can be traced to ": null
    },
    {
        "Carl Friedrich Gauss": "carl friedrich gauss"
    },
    {
        "s unpublished work in 42 when he needed it to interpolate the orbit of asteroids ": null
    },
    {
        "Pallas": "2 pallas"
    },
    {
        " and ": null
    },
    {
        "Juno": "3 juno"
    },
    {
        " from sample observations. His method was very similar to the one published in 42 by ": null
    },
    {
        "James Cooley": "james cooley"
    },
    {
        " and ": null
    },
    {
        "John Tukey": "john tukey"
    },
    {
        ", who are generally credited for the invention of the modern generic FFT algorithm. While Gausss work predated even ": null
    },
    {
        "Joseph Fourier": "joseph fourier"
    },
    {
        "s results in 42 he did not analyze the computation time and eventually used other methods to achieve his goal.     Between 42 and 42 some versions of FFT were published by other authors. ": null
    },
    {
        "Frank Yates": "frank yates"
    },
    {
        " in 42 published his version called interaction algorithm, which provided efficient computation of ": null
    },
    {
        "Hadamard and Walsh transforms": "hadamard transform"
    },
    {
        ". Yates algorithm is still used in the field of statistical design and analysis of experiments. In 42 ": null
    },
    {
        "G. C. Danielson": "g. c. danielson"
    },
    {
        " and ": null
    },
    {
        "Cornelius Lanczos": "cornelius lanczos"
    },
    {
        " published their version to compute DFT for ": null
    },
    {
        "x-ray crystallography": "x-ray crystallography"
    },
    {
        ", a field where calculation of Fourier transforms presented a formidable bottleneck. While many methods in the past had focused on reducing the constant factor for O\\left computation by taking advantage of symmetries , Danielson and Lanczos realized that one could use the periodicity and apply a doubling trick to get O runtime.     James Cooley and John Tukey published a ": null
    },
    {
        "more general version of FFT": "cooley–tukey fft algorithm"
    },
    {
        " in 42 that is applicable when N is composite and not necessarily a power of 42 Tukey came up with the idea during a meeting of ": null
    },
    {
        "President Kennedy": "president kennedy"
    },
    {
        "s Science Advisory Committee where a discussion topic involved detecting nuclear tests by the Soviet Union by setting up sensors to surround the country from outside. To analyze the output of these sensors, an FFT algorithm would be needed. In discussion with Tukey, ": null
    },
    {
        "Richard Garwin": "richard garwin"
    },
    {
        " recognized the general applicability of the algorithm not just to national security problems, but also to a wide range of problems including one of immediate interest to him, determining the periodicities of the spin orientations in a 42-D crystal of Helium42 Garwin gave Tukeys idea to Cooley  for implementation. Cooley and Tukey published the paper in a relatively short time of six months. As Tukey did not work at IBM, the patentability of the idea was doubted and the algorithm went into the public domain, which, through the computing revolution of the next decade, made FFT one of the indispensable algorithms in digital signal processing.       Let x 42 , …, x N−42 be ": null
    },
    {
        "complex number": "complex number"
    },
    {
        "s. The ": null
    },
    {
        "DFT": "discrete fourier transform"
    },
    {
        " is defined by the formula     : X_k \\sum_^ x_n e^ \\qquad k 42\\ldots,N42     where e^ is a ": null
    },
    {
        "primitive": "primitive root of unity"
    },
    {
        " th root of 42     Evaluating this definition directly requires O\\left operations: there are N outputs X k , and each output requires a sum of N terms. An FFT is any method to compute the same results in O operations. All known FFT algorithms require ": null
    },
    {
        "Θ": "big o notationuse in computer science"
    },
    {
        " operations, although there is no known proof that a lower complexity score is impossible.     To illustrate the savings of an FFT, consider the count of complex multiplications and additions for N42 data points. Evaluating the DFTs sums directly involves N 42 complex multiplications and N complex additions, of which O operations can be saved by eliminating trivial operations such as multiplications by 42 leaving about 42 million operations. On the other hand, the radix42 ": null
    },
    {
        "Cooley–Tukey algorithm": "cooley–tukey algorithm"
    },
    {
        ", for N a power of 42 can compute the same result with only log 42  complex multiplications and N  log 42  complex additions, in total about 42 operations - a thousand times less than with direct evaluation. In practice, actual performance on modern computers is usually dominated by factors other than the speed of arithmetic operations and the analysis is a complicated subject , but the overall improvement from O\\left to O remains.                By far the most commonly used FFT is the Cooley–Tukey algorithm. This is a ": null
    },
    {
        "divide and conquer algorithm": "divide and conquer algorithm"
    },
    {
        " that ": null
    },
    {
        "recursively": "recursion"
    },
    {
        " breaks down a DFT of any ": null
    },
    {
        "composite": "composite number"
    },
    {
        " size N N 42 N 42 into many smaller DFTs of sizes N 42 and N 42 , along with O multiplications by complex ": null
    },
    {
        "roots of unity": "roots of unity"
    },
    {
        " traditionally called ": null
    },
    {
        "twiddle factor": "twiddle factor"
    },
    {
        "s .     This method was popularized by a publication of Cooley and Tukey in 42 but it was later discovered that those two authors had independently re-invented an algorithm known to ": null
    },
    {
        "Carl Friedrich Gauss": "carl friedrich gauss"
    },
    {
        " around 42 .     The best known use of the Cooley–Tukey algorithm is to divide the transform into two pieces of size N/42 at each step, and is therefore limited to power-of-two sizes, but any factorization can be used in general . These are called the radix42 and mixed-radix cases, respectively . Although the basic idea is recursive, most traditional implementations rearrange the algorithm to avoid explicit recursion. Also, because the Cooley–Tukey algorithm breaks the DFT into smaller DFTs, it can be combined arbitrarily with any other algorithm for the DFT, such as those described below.            There are FFT algorithms other than Cooley–Tukey. ": null
    },
    {
        "Cornelius Lanczos": "cornelius lanczos"
    },
    {
        " did pioneering work on the FFT and FFS  with ": null
    },
    {
        "G. C. Danielson": "g. c. danielson"
    },
    {
        " .     For N N 42 N 42 with ": null
    },
    {
        "coprime": "coprime"
    },
    {
        " N 42 and N 42 , one can use the ": null
    },
    {
        "prime-factor": "prime-factor fft algorithm"
    },
    {
        " algorithm , based on the ": null
    },
    {
        "Chinese remainder theorem": "chinese remainder theorem"
    },
    {
        ", to factorize the DFT similarly to Cooley–Tukey but without the twiddle factors. The Rader–Brenner algorithm is a Cooley–Tukey-like factorization but with purely imaginary twiddle factors, reducing multiplications at the cost of increased additions and reduced ": null
    },
    {
        "numerical stability": "numerical stability"
    },
    {
        "; it was later superseded by the ": null
    },
    {
        "split-radix": "split-radix fft algorithm"
    },
    {
        " variant of Cooley–Tukey . Algorithms that recursively factorize the DFT into smaller operations other than DFTs include the Bruun and ": null
    },
    {
        "QFT": "quick fourier transform algorithm"
    },
    {
        " algorithms.  ": null
    },
    {
        "Bruuns algorithm": "bruuns fft algorithm"
    },
    {
        ", in particular, is based on interpreting the FFT as a recursive factorization of the ": null
    },
    {
        "polynomial": "polynomial"
    },
    {
        " z N  −  42 here into real-coefficient polynomials of the form z M  −  42 and z 42M  +  az M  +  42     Another polynomial viewpoint is exploited by the Winograd FFT algorithm, which factorizes z N  −  42 into ": null
    },
    {
        "cyclotomic polynomial": "cyclotomic polynomial"
    },
    {
        "s—these often have coefficients of 42  42  or  −42 and therefore require few multiplications, so Winograd can be used to obtain minimal-multiplication FFTs and is often used to find efficient algorithms for small factors. Indeed, Winograd showed that the DFT can be computed with only O irrational multiplications, leading to a proven achievable lower bound on the number of multiplications for power-of-two sizes; unfortunately, this comes at the cost of many more additions, a tradeoff no longer favorable on modern ": null
    },
    {
        "processors": "central processing unit"
    },
    {
        " with ": null
    },
    {
        "hardware multipliers": "floating-point unit"
    },
    {
        ". In particular, Winograd also makes use of the PFA as well as an algorithm by Rader for FFTs of prime sizes.     ": null
    },
    {
        "Raders algorithm": "raders fft algorithm"
    },
    {
        ", exploiting the existence of a ": null
    },
    {
        "generator": "generating set of a group"
    },
    {
        " for the multiplicative ": null
    },
    {
        "group": "group"
    },
    {
        " modulo prime N, expresses a DFT of prime size N as a cyclic ": null
    },
    {
        "convolution": "convolution"
    },
    {
        " of size N − 42 which can then be computed by a pair of ordinary FFTs via the ": null
    },
    {
        "convolution theorem": "convolution theorem"
    },
    {
        " . Another prime-size FFT is due to L. I. Bluestein, and is sometimes called the ": null
    },
    {
        "chirp-z algorithm": "chirp-z algorithm"
    },
    {
        "; it also re-expresses a DFT as a convolution, but this time of the same size , via the identity     : nk -\\frac 42 + \\frac 42 + \\frac 42     ": null
    },
    {
        "Hexagonal Fast Fourier Transform": "hexagonal fast fourier transform"
    },
    {
        " aims at computing an efficient FFT for the hexagonally sampled data by using a new addressing scheme for hexagonal grids, called Array Set Addressing .       In many applications, the input data for the DFT are purely real, in which case the outputs satisfy the symmetry     : X_ X_k^     and efficient FFT algorithms have been designed for this situation . One approach consists of taking an ordinary algorithm and removing the redundant parts of the computation, saving roughly a factor of two in time and memory. Alternatively, it is possible to express an even-length real-input DFT as a complex DFT of half the length , followed by O post-processing operations.     It was once believed that real-input DFTs could be more efficiently computed by means of the ": null
    },
    {
        "discrete Hartley transform": "discrete hartley transform"
    },
    {
        " , but it was subsequently argued that a specialized real-input DFT algorithm can typically be found that requires fewer operations than the corresponding DHT algorithm for the same number of inputs. Bruuns algorithm is another method that was initially proposed to take advantage of real inputs, but it has not proved popular.     There are further FFT specializations for the cases of real data that have ": null
    },
    {
        "even/odd": "even and odd functions"
    },
    {
        " symmetry, in which case one can gain another factor of roughly two in time and memory and the DFT becomes the ": null
    },
    {
        "discrete cosine": "discrete cosine transform"
    },
    {
        "/": null
    },
    {
        "sine transform": "discrete sine transform"
    },
    {
        " . Instead of directly modifying an FFT algorithm for these cases, DCTs/DSTs can also be computed via FFTs of real data combined with O pre- and post-processing.              A fundamental question of longstanding theoretical interest is to prove lower bounds on the ": null
    },
    {
        "complexity": "computational complexity theory"
    },
    {
        " and exact operation counts of fast Fourier transforms, and many open problems remain. It is not even rigorously proved whether DFTs truly require Ω  operations, even for the simple case of ": null
    },
    {
        "power of two": "power of two"
    },
    {
        " sizes, although no algorithms with lower complexity are known. In particular, the count of arithmetic operations is usually the focus of such questions, although actual performance on modern-day computers is determined by many other factors such as ": null
    },
    {
        "cache": "cache"
    },
    {
        " or ": null
    },
    {
        "CPU pipeline": "pipeline"
    },
    {
        " optimization.     Following work by ": null
    },
    {
        "Shmuel Winograd": "shmuel winograd"
    },
    {
        " , a tight Θ lower bound is known for the number of real multiplications required by an FFT. It can be shown that only 42N - 42\\log_42^42 - 42\\log_42 - 42 irrational real multiplications are required to compute a DFT of power-of-two length N 42^m . Moreover, explicit algorithms that achieve this count are known . However, these algorithms require too many additions to be practical, at least on modern computers with hardware multipliers .     A tight lower bound is not known on the number of required additions, although lower bounds have been proved under some restrictive assumptions on the algorithms. In 42 Morgenstern proved an Ω lower bound on the addition count for algorithms where the multiplicative constants have bounded magnitudes . This result, however, applies only to the unnormalized Fourier transform , and does not explain why the Fourier matrix is harder to compute than any other unitary matrix under the same scaling. ": null
    },
    {
        "Pan": "victor pan"
    },
    {
        " proved an Ω lower bound assuming a bound on a measure of the FFT algorithms asynchronicity , but the generality of this assumption is unclear. For the case of power-of-two N, ": null
    },
    {
        "Papadimitriou": "christos papadimitriou"
    },
    {
        " argued that the number N \\log_42 N of complex-number additions achieved by Cooley–Tukey algorithms is optimal under certain assumptions on the ": null
    },
    {
        "graph": "graph"
    },
    {
        " of the algorithm . Thus far, no published FFT algorithm has achieved fewer than N \\log_42 N complex-number additions for power-of-two  N.     A third problem is to minimize the total number of real multiplications and additions, sometimes called the arithmetic complexity . Again, no tight lower bound has been proven. Since 42 however, the lowest published count for power-of-two N was long achieved by the ": null
    },
    {
        "split-radix FFT algorithm": "split-radix fft algorithm"
    },
    {
        ", which requires 42N\\log_42 - 42N + 42 real multiplications and additions for N math /math  ref name Haynal_42 /  ref name Duhamel_Vetterli_42 /  ref name Edelman_McCorquodale_Toledo_42 /  ref name Guo_Burrus_42 / ref name Shentov_Mitra_Heute_Hossen_42 /  ": null
    }
]