[
    {
        "The Federation of Expellees  is a ": null
    },
    {
        "non-profit organization": "Non-Profit Organization"
    },
    {
        " formed in ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        " on 27 October 1957 to represent the interests of German nationals of all ethnicities and foreign ": null
    },
    {
        "ethnic Germans": "Ethnic German"
    },
    {
        "and their families who either fled their homes in parts of ": null
    },
    {
        "Central and Eastern Europe": "Central And Eastern Europe"
    },
    {
        ", or were forcibly ": null
    },
    {
        "expelled following World War II": "Expulsion Of Germans After World War Ii"
    },
    {
        ".     Since 2014 the president of the Federation has been ": null
    },
    {
        "Bernd Fabritius": "Bernd Fabritius"
    },
    {
        ", a ": null
    },
    {
        "Christian Social Union in Bavaria": "Christian Social Union In Bavaria"
    },
    {
        " politician.            It is estimated that in the aftermath of World War II between 13 and 16 million ": null
    },
    {
        "ethnic Germans": "Ethnic Germans"
    },
    {
        " fled or were ": null
    },
    {
        "expelled": "The_Expelled"
    },
    {
        " from parts of Central and Eastern Europe, including the ": null
    },
    {
        "former eastern territories of Germany": "Former Eastern Territories Of Germany"
    },
    {
        " , the ": null
    },
    {
        "Czech Republic": "Czech Republic"
    },
    {
        ", ": null
    },
    {
        "Slovakia": "Slovakia"
    },
    {
        ", ": null
    },
    {
        "Slovenia": "Slovenia"
    },
    {
        ", ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        ", ": null
    },
    {
        "Croatia": "Croatia"
    },
    {
        ", ": null
    },
    {
        "Serbia": "Serbia"
    },
    {
        " , the ": null
    },
    {
        "Kaliningrad Oblast": "Kaliningrad Oblast"
    },
    {
        " of ": null
    },
    {
        "Russia": "Russia"
    },
    {
        ", hitherto ": null
    },
    {
        "USSR": "Ussr"
    },
    {
        " and prior to this, the northern part of ": null
    },
    {
        "East Prussia": "East Prussia"
    },
    {
        ", ": null
    },
    {
        "Lithuania": "Lithuania"
    },
    {
        ", ": null
    },
    {
        "Romania": "Romania"
    },
    {
        " and other East European countries.          The Charter of the German Expellees  of August 5, 1950, announced their belief in requiring that the right to the homeland is recognized and carried out as one of the fundamental rights of mankind given by God , while renouncing revenge and retaliation in the face of the unending suffering  of the previous decade, and supporting the unified effort to rebuild Germany and Europe.     The charter has been criticised for avoiding mentioning Nazi atrocities of ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        " and Germans who were forced to emigrate due to Nazi repressions.  Beata Ociepka, Związek Wypędzonych w systemie politycznym RFN i jego wpływ na stosunki polsko-niemieckie 1982-1992 , page 235, Wydawnictwo Uniwersytetu Wrocławskiego, 1997 Critics argue that the Charter presents the history of German people as starting from the expulsions, while ignoring events like the ": null
    },
    {
        "Holocaust": "Holocaust"
    },
    {
        ".     Professor ": null
    },
    {
        "Micha Brumlik": "Micha Brumlik"
    },
    {
        " pointed out that one third of signatories were former devoted Nazis and many actively helped in realisation of Hitlers goals.     ": null
    },
    {
        "Ralph Giordano": "Ralph Giordano"
    },
    {
        " wrote in  Hamburger Abendblatt  the Charter doesnt contain a word about ": null
    },
    {
        "Hitler": "Hitler"
    },
    {
        ", ": null
    },
    {
        "Auschwitz": "Auschwitz"
    },
    {
        " and ": null
    },
    {
        "Buchenwald": "Buchenwald"
    },
    {
        ". Not to mention any sign of apologies for the suffering of the murdered people , avoids mentioning the reasons for expulsions and called the document example of German art of crowding out the truth The fact that the charter completely ignores the reasons for the expulsions deprives it of any value .          Between 1953, when the ": null
    },
    {
        "Federal Expellee Law": "Federal Expellee Law"
    },
    {
        " was passed, and 1991, the ": null
    },
    {
        "West German": "West Germany"
    },
    {
        " government passed several laws dealing with German expellees. The most notable of these is the ": null
    },
    {
        "Law of Return": "Right Of Returngermany"
    },
    {
        " which granted ": null
    },
    {
        "German citizenship": "German Citizenship"
    },
    {
        " to any ethnic German. Several additions were later made to these laws.     The German Law of Return declared refugee status to be inheritable. According to the ": null
    },
    {
        "Federal Expellee Law": "Federal Expellee Law"
    },
    {
        ",  Par. 7/2. Retrieved 29-10-2017 the spouse and the descendants of an expellee are to be treated as if they were expellees themselves, regardless of whether they had been personally displaced. The Federation of Expellees has steadily lobbied to preserve the inheritability clause.       The Federation of Expellees was formed on 27 October 1957 in West Germany. Before its founding, the  Bund der Heimatvertriebenen  , formed in 1950, represented the interests of displaced German expellees. Intriguingly, in its first few years, the league was more successful in West Germany than in ": null
    },
    {
        "East Germany": "East Germany"
    },
    {
        ".       Previous West German governments, especially those led by the Christian Democratic Union, had shown more rhetorical support for the territorial claims made on behalf of German refugees and expellees. Although the ": null
    },
    {
        "Social Democrats": "Social Democratic Party Of Germany"
    },
    {
        " showed strong support for the expellees, especially under ": null
    },
    {
        "Kurt Schumacher": "Kurt Schumacher"
    },
    {
        " and ": null
    },
    {
        "Erich Ollenhauer": "Erich Ollenhauer"
    },
    {
        ", Social Democrats in more recent decades have generally been less supportive & mdash; and it was under ": null
    },
    {
        "Willy Brandt": "Willy Brandt"
    },
    {
        " that ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        " recognized the ": null
    },
    {
        "Oder-Neisse line": "Oder-Neisse Line"
    },
    {
        " as the eastern German border with Poland under his policy of ": null
    },
    {
        "Ostpolitik": "Ostpolitik"
    },
    {
        ". In reality, accepting the internationally recognized boundary made it more possible for eastern Germans to visit their lost homelands.     In 1989-1990 the West German government realized they had an opportunity to reunify the Federal Republic of Germany and the Soviet created German Democratic Republic. But they believed that if this were to be achieved, it had to be done quickly. One of the potential complications was the claim to the historical eastern territories of Germany; unless this was renounced, some foreign governments might not agree to ": null
    },
    {
        "German reunification": "German Reunification"
    },
    {
        ". The West German government under the CDU accepted the 1990 ": null
    },
    {
        "Treaty on the Final Settlement With Respect to Germany": "Treaty On The Final Settlement With Respect To Germany"
    },
    {
        " , which officially re-established the sovereignty of both German states. A condition of this agreement was that Germany accept the post-World War II frontiers. Upon reunification in 1990, the ": null
    },
    {
        "constitution": "Basic Law For The Federal Republic Of Germany"
    },
    {
        " was amended to state that Germanys territory had reached its full extent. Article 146 was amended so that Article 23 of the current constitution could be used for reunification. Once the five reestablished federal states in the east had been united with the west, the Basic Law was amended again to show that there were no other parts of Germany, which existed outside of the unified territory, that had not acceded.         In 2000 the Federation of Expellees also initiated the formation of the ": null
    },
    {
        "Center Against Expulsions": "Center Against Expulsions"
    },
    {
        " . Chairwoman of this Center is Erika Steinbach, who headed it together with former ": null
    },
    {
        "SPD": "Social Democratic Party Of Germany"
    },
    {
        " politician Prof. Dr. ": null
    },
    {
        "Peter Glotz": "Peter Glotz"
    },
    {
        " .     Recently Erika Steinbach, the chair of the Federation of Expellees, has rejected any compensation claims. The vice president of the Federation Rudi Pawelka is however a chairman of the supervisory board of the ": null
    },
    {
        "Prussian Trust": "Prussian Trust"
    },
    {
        ".     A European organisation for expellees has been formed: EUFV. Headquarters is Trieste, Italy.          The expellees are organized in 21 regional associations , according to the areas of origin of its members, 16 state organizations  according to their current residence, and 5 associate member organizations. It is the single representative federation for the approximately 15 million Germans who after fleeing, being expelled, evacuated or emigrating, found refuge in the Federal Republic of Germany. The Federation claims to have 1.3 million members ,  and to be a political force of some influence in Germany. This figure was disputed in January 2010 by the German news service DDP, which reported an actual membership of 550,000. Reported by ARD News service in January 2010. The figure of 550,000 does not include the State of Mecklenburg-Vorpommern. The news report mentioned that an expert in the area of Expellees Prof. Matthias Stickler of the University Würzburg as saying that a decline in BdV membership is understandable because it mirrors the death of the generation of that era  According to Erika Steinbach only 100,000 of the members contribute financially.  Otto Langels, , deutschlandfunk . Retrieved 29.10.2017     The federation helps its members to integrate into German society. Many of the members assist the societies of their place of birth.         From 1959 to 1964, the first president of the Federation was ": null
    },
    {
        "Hans Krüger": "Hans Krüger"
    },
    {
        ", a former ": null
    },
    {
        "Nazi": "Nazism"
    },
    {
        " judge and activist. , Deutsche Welle . Retrieved 29.10.2017 After the war Krüger was a ": null
    },
    {
        "West German": "Germany"
    },
    {
        " politician": "Politician"
    },
    {
        " of the ": null
    },
    {
        "Christian Democratic Union": "Christian Democratic Union"
    },
    {
        " , was a Member of Parliament from 1957 to 1965, served as ": null
    },
    {
        "Federal Minister for Displaced Persons, Refugees and War Victims": "Federal Ministry For Displaced Persons, Refugees And War Victims"
    },
    {
        " for 4 months in 1963-64 in the First Cabinet of ": null
    },
    {
        "Ludwig Erhard": "Ludwig Erhard"
    },
    {
        ". He stepped down from cabinet and other positions in 1964 amid controversy about his war-time background. Krüger was succeeded as president by ": null
    },
    {
        "Wenzel Jaksch": "Wenzel Jaksch"
    },
    {
        " in 1964 who held the position until his untimely death in 1966.        ": null
    },
    {
        "Hans Krüger": "Hans Krüger"
    },
    {
        "    Wenzel Jaksch": "Wenzel Jaksch"
    },
    {
        "   Reinhold Rehs": "Reinhold Rehs"
    },
    {
        "   Herbert Czaja": "Herbert Czaja"
    },
    {
        "   Fritz Wittmann": "Fritz Wittmann"
    },
    {
        "   Erika Steinbach": "Erika Steinbach"
    },
    {
        "   Bernd Fabritius": "Bernd Fabritius"
    },
    {
        "             Landsmannschaft Ostpreußen": "Landsmannschaft Ostpreußen"
    },
    {
        " Landsmannschaft Schlesien": "Landsmannschaft Schlesien"
    },
    {
        " Deutsch-Baltische Gesellschaft": "Deutsch-Baltische Gesellschaft"
    },
    {
        " Landsmannschaft der Deutschen aus Litauen": "Landsmannschaft Der Deutschen Aus Litauen"
    },
    {
        " e.V.   Landsmannschaft der Oberschlesier e.V. - Bundesverband -   Pommersche Landsmannschaft - Zentralverband - e.V.   ": null
    },
    {
        "Landsmannschaft der Deutschen aus Russland": "Landsmannschaft Der Deutschen Aus Russland"
    },
    {
        " e.V.   Landsmannschaft der Sathmarer Schwaben in der Bundesrepublik Deutschland e.V.   ": null
    },
    {
        "Landsmannschaft der Siebenbürger Sachsen in Deutschland": "Landsmannschaft Der Siebenbürger Sachsen In Deutschland"
    },
    {
        " e.V.   ": null
    },
    {
        "Sudetendeutsche Landsmannschaft Bundesverband": "Sudetendeutsche Landsmannschaft Bundesverband"
    },
    {
        " e.V.   ": null
    },
    {
        "Landsmannschaft der Deutschen aus Ungarn": "Landsmannschaft Der Deutschen Aus Ungarn"
    },
    {
        " Landsmannschaft Westpreußen": "Landsmannschaft Westpreußen"
    },
    {
        " e.V.         Landesverband Baden-Württemberg   Landesverband Bayern   Landesverband Berlin   Landesverband Brandenburg   Landesverband Bremen   Landesverband Hamburg   Landesverband Hessen   Landesverband Mecklenburg-Vorpommern   Landesverband Niedersachsen   Landesverband Nordrhein-Westfalen   Landesverband Rheinland-Pfalz   Landesverband Saar   Landesverband Sachsen / Schlesische Lausitz   Landesverband Sachsen-Anhalt   Landesverband Schleswig-Holstein   Landesverband Thüringen         When in government, both CDU and SPD have tended to favor improved relations with ": null
    },
    {
        "Central": "Central Europe"
    },
    {
        " and ": null
    },
    {
        "Eastern Europe": "Eastern Europe"
    },
    {
        ", even when this conflicts with the interests of the displaced people. The issue of the eastern border and the return of the  Heimatvertriebene  to their ancestral homes are matters which the current German government, German constitutional arrangements and German treaty obligations have virtually closed.     The refugees claims were unanimously rejected by the affected countries and became a source of mistrust between Germany, Poland and the Czech Republic. These governments argue that the expulsion of Germans and related border changes were not enacted by the Polish or Czech governments, but rather were ordered by the ": null
    },
    {
        "Potsdam Conference": "Potsdam Conference"
    },
    {
        ". Furthermore, the nationalization of private property by Polands former communist government did not apply only to Germans but was enforced on all people, regardless of ethnic background. A further complication is that many of the current Polish population in historical eastern Germany are themselves expellees who were driven from ": null
    },
    {
        "Polish areas annexed by the Soviet Union": "Polish Areas Annexed By The Soviet Union"
    },
    {
        " and were forced to leave their homes and property behind as well.     Some Germans had settled in Poland after 1939, and treating these ex-colonists as expellees, Erika Steinbach included, under German law of these ex-colonists as expellees, adds to the controversy. However, the vast majority of expelled Germans were descended from families who had lived in Eastern Europe for many centuries, while the majority of German colonists in Nazi-occupied Poland were ": null
    },
    {
        "Baltic": "Baltic Germans"
    },
    {
        " and other East European Germans themselves displaced by the ": null
    },
    {
        "Nazi-Soviet population transfers": "Nazi-Soviet Population Transfers"
    },
    {
        ".         The Federation has been accused by the GDR and Poland to have Nazi roots. A recent study confirmed that 13 members of the first council of the Federation had a Nazi past.      The Polish daily newspaper ": null
    },
    {
        "Rzeczpospolita": "Rzeczpospolita"
    },
    {
        " reported that during BdV meetings in 2003, publications using hate-language to describe Poles butchering Germans were available for sale, as were recordings of ": null
    },
    {
        "Waffen SS": "Waffen Ss"
    },
    {
        " marches on compact discs, including those glorifying the ": null
    },
    {
        "Invasion of Poland": "Invasion Of Poland"
    },
    {
        ". Also, far right groups openly distributed their materials at BdV meetings. While the BdV officially denied responsibility for this, no steps were taken to address the concerns raised.      In February 2009, the Polish newspaper Polska wrote that over one third of the Federation top officials were former Nazi activists, and based this on an article published by the German magazine  Der Spiegel  in 2006. The German paper ": null
    },
    {
        "Frankfurter Allgemeine Zeitung": "Frankfurter Allgemeine Zeitung"
    },
    {
        " wrote that Der Spiegel said this not in respect to the Federation of Expellees, but in respect to a predecessor organization that was dissolved in 1957.  Stefan Dietrich, , ": null
    },
    {
        "Frankfurter Allgemeine Zeitung": "Frankfurter Allgemeine Zeitung"
    },
    {
        ", . ": null
    }
]