[
    {
        "                      A federation  is a ": null
    },
    {
        "political entity": "political entity"
    },
    {
        " characterized by a ": null
    },
    {
        "union": "political union"
    },
    {
        " of partially ": null
    },
    {
        "self-governing provinces, states, or other regions": "federated state"
    },
    {
        " under a central ": null
    },
    {
        "federal government": "federal governments"
    },
    {
        " . In a federation, the self-governing status of the component states, as well as the division of power between them and the central government, is typically constitutionally entrenched and may not be altered by a unilateral decision of either party, the states or the federal political body. Alternatively, a federation is a form of government in which sovereign power is formally divided between a central authority and a number of constituent regions so that each region retains some degree of control over its internal affairs.     It is often argued that federal states where the central government has overriding powers, are not truly federal states. For example, such overriding powers may include: the constitutional authority to suspend a constituent states government by invoking gross mismanagement or civil unrest, or to adopt national legislation that overrides or infringe on the constituent states powers by invoking the central governments constitutional authority to ensure peace and good government or to implement obligations contracted under an international treaty.     The governmental or constitutional structure found in a federation is considered to be federalist, or to be an example of ": null
    },
    {
        "federalism": "federalism"
    },
    {
        ". It can be considered the opposite of another system, the ": null
    },
    {
        "unitary state": "unitary state"
    },
    {
        ". ": null
    },
    {
        "France": "france"
    },
    {
        ", for example, has been unitary for multiple centuries. ": null
    },
    {
        "Austria": "austria"
    },
    {
        " and its  Bundesländer  was a unitary state with ": null
    },
    {
        "administrative division": "administrative division"
    },
    {
        "s that became federated through the implementation of the ": null
    },
    {
        "Austrian Constitution": "constitution of austria"
    },
    {
        " following the 42 collapse of ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ". ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", with its 42 ": null
    },
    {
        "states, or Bundesländer": "states of germany"
    },
    {
        ", is an example of a federation. Federations are often ": null
    },
    {
        "multiethnic": "ethnic group"
    },
    {
        " and cover a large area of territory , but neither is necessarily the case .     Several ancient chiefdoms and kingdoms, such as the 42th-century BCE ": null
    },
    {
        "League of Corinth": "league of corinth"
    },
    {
        ", ": null
    },
    {
        "Noricum": "noricum"
    },
    {
        " in ": null
    },
    {
        "Central Europe": "central europe"
    },
    {
        ", and the ": null
    },
    {
        "Iroquois Confederacy": "iroquois"
    },
    {
        " in ": null
    },
    {
        "pre-Columbian North America": "pre-columbian north america"
    },
    {
        ", could be described as federations or ": null
    },
    {
        "confederation": "confederation"
    },
    {
        "s. The ": null
    },
    {
        "Old Swiss Confederacy": "old swiss confederacy"
    },
    {
        " was an early example of formal non-unitary statehood.     Several colonies and dominions in the ": null
    },
    {
        "New World": "new world"
    },
    {
        " consisted of autonomous provinces, transformed to federal states upon independence such as the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", and various countries in ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        " . Some of the New World federations failed; the ": null
    },
    {
        "Federal Republic of Central America": "federal republic of central america"
    },
    {
        " broke up into independent states less than 42 years after its founding. Others, such as ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " and ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        ", have shifted between federal, ": null
    },
    {
        "confederal": "confederation"
    },
    {
        ", and unitary systems, before settling into federalism. ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " became a federation only after the fall of ": null
    },
    {
        "the monarchy": "brazilian empire"
    },
    {
        ", and ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        " became a federation after the ": null
    },
    {
        "Federal War": "federal war"
    },
    {
        ". Australia and Canada are also federations.     Germany is another ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        " that has switched between confederal, federal and unitary rules, since the ": null
    },
    {
        "German Confederation": "german confederation"
    },
    {
        " was founded in 42 The ": null
    },
    {
        "North German Confederation": "north german confederation"
    },
    {
        ", the succeeding ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " and the ": null
    },
    {
        "Weimar Republic": "weimar republic"
    },
    {
        " were federations.     Founded in 42 the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " was formally a federation of ": null
    },
    {
        "Soviet republics": "republics of the soviet union"
    },
    {
        ", ": null
    },
    {
        "autonomous republics": "autonomous soviet socialist republics of the soviet union"
    },
    {
        " and other federal subjects, though in practice highly centralized under the ": null
    },
    {
        "government of the Soviet Union": "government of the soviet union"
    },
    {
        ". The ": null
    },
    {
        "Russian Federation": "russia"
    },
    {
        " has inherited a similar system.     ": null
    },
    {
        "Nigeria": "nigeria"
    },
    {
        ", ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        " and ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        "  became federations on or shortly before becoming independent from the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        ".     In some recent cases, federations have been instituted as a measure to handle ": null
    },
    {
        "ethnic conflict": "ethnic conflict"
    },
    {
        " within a state, such as ": null
    },
    {
        "Bosnia and Herzegovina": "bosnia and herzegovina"
    },
    {
        ", and ": null
    },
    {
        "Iraq since 42": "federalism in iraq"
    },
    {
        ".     With the ": null
    },
    {
        "United States Constitution": "united states constitution"
    },
    {
        " having become effective on 42 March 42 the ": null
    },
    {
        "United States": "united states"
    },
    {
        " is the oldest surviving federation. On the other end of the timeline is ": null
    },
    {
        "Nepal": "nepal"
    },
    {
        ", which became the newest federation after its ": null
    },
    {
        "constitution": "constitution of nepal 2015"
    },
    {
        " went into effect on 42 September 42                                       The component states are in some sense sovereign, insofar as certain powers are reserved to them that may not be exercised by the central government. However, a federation is more than a mere loose alliance of independent states. The component states of a federation usually possess no powers in relation to foreign policy and so enjoy no independent status under ": null
    },
    {
        "international law": "international law"
    },
    {
        ". However, German Länder have that power,  which is beginning to be exercised on a European level.     Some federations are called ": null
    },
    {
        "asymmetric": "asymmetric federation"
    },
    {
        " because some states have more autonomy than others. An example of such a federation is ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        ", in which ": null
    },
    {
        "Sarawak": "sarawak"
    },
    {
        " and ": null
    },
    {
        "Sabah": "sabah"
    },
    {
        " agreed to form the federation on different terms and conditions from the states of ": null
    },
    {
        "Peninsular Malaysia": "peninsular malaysia"
    },
    {
        ".     A federation often emerges from an initial agreement between a number of separate states. The purpose can be the will to solve mutual problems and to provide for mutual defense or to create a ": null
    },
    {
        "nation-state": "nation state"
    },
    {
        " for an ethnicity spread over several states. The former was the case with the United States and Switzerland. However, as the histories of countries and nations vary, the federalist system of a state can be quite different from these models. Australia, for instance, is unique in that it came into existence as a nation by the democratic vote of the citizens of each state, who voted yes in referendums to adopt the ": null
    },
    {
        "Australian Constitution": "australian constitution"
    },
    {
        ". Brazil, on the other hand, has experienced both the federal and the unitary state during its history. Some present day states of the Brazilian federation retain borders set during the Portuguese colonization , whereas the latest state, ": null
    },
    {
        "Tocantins": "tocantins"
    },
    {
        ", was created by the ": null
    },
    {
        "42 Constitution": "1988 brazilian constitution"
    },
    {
        " for chiefly administrative reasons.     Seven of the top eight ": null
    },
    {
        "largest countries by area": "list of countries and outlying territories by total area"
    },
    {
        " are governed as federations.       A ": null
    },
    {
        "unitary state": "unitary state"
    },
    {
        " is sometimes one with only a single, centralized, national tier of government. However, unitary states often also include one or more self-governing regions. The difference between a federation and this kind of unitary state is that in a unitary state the autonomous status of self-governing regions exists by the sufferance of the central government, and may be unilaterally revoked. While it is common for a federation to be brought into being by agreement between a number of formally independent states, in a unitary state self-governing regions are often created through a process of devolution, where a formerly centralized state agrees to grant autonomy to a region that was previously entirely subordinate. Thus federations are often established voluntarily from below whereas devolution grants self-government from above.     It is often part of the philosophy of a unitary state that, regardless of the actual status of any of its parts, its entire territory constitutes a single sovereign entity or ": null
    },
    {
        "nation-state": "nation state"
    },
    {
        ", and that by virtue of this the central government exercises sovereignty over the whole territory as of right. In a federation, on the other hand, sovereignty is often regarded as residing notionally in the component states, or as being shared between these states and the central government.            A ": null
    },
    {
        "confederation": "confederation"
    },
    {
        ", in modern political terms, is usually limited to a permanent union of sovereign states for common action in relation to other states. Oxford English Dictionary The closest entity in the world to a confederation at this time is the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ". While the word confederation was officially used when the present Canadian federal system was established in 42 the term refers only to the process and not the resulting state since Canadian provinces are not sovereign and do not claim to be. In the case of Switzerland, while the country is still known as the Swiss Confederation this is also now a misnomer since the Swiss cantons lost their sovereign status in 42  . Swissworld.org. Retrieved on 424242     In Belgium, however, the opposite movement is underway. One of the most important recent books about the Belgian institutions, written by one of the leading French-speaking jurists concludes: Vers le confédéralisme . See: Charles-Etienne Lagasse, Les Nouvelles institutions politiques de la Belgique et de lEurope, Erasme, ": null
    },
    {
        "Namur": "namur"
    },
    {
        " 42 p. 42  Belgium was founded as a centralized state, after the French model, but has gradually been reformed into a federal state by consecutive constitutional reforms since the 42s. Moreover, although nominally called a federal state, the countrys structure already has a number of ": null
    },
    {
        "confederational traits": "confederationbelgium"
    },
    {
        " . At present, there is a growing movement to transform the existing federal state into a looser confederation with two or three constitutive states and/or two special regions. Many Flemings would prefer two states, Flanders and Wallonia, and two special regions, Brussels and the German-speaking region. In Wallonia, there is wider support for three states: Flanders, Wallonia and Brussels.     A confederation is most likely to feature three differences when contrasted with a federation: No real direct powers: many confederal decisions are externalized by member-state legislation; Decisions on day-to-day-matters are not taken by simple majority but by special majorities or even by consensus or unanimity ; Changes of the constitution, usually a treaty, require unanimity.     Over time these terms acquired distinct connotations leading to the present difference in definition. An example of this is the United States under the ": null
    },
    {
        "Articles of Confederation": "articles of confederation"
    },
    {
        ". The Articles established a national government under what today would be defined as a federal system . However, Canadians, designed with a stronger central government than the U.S. in the wake of the Civil War of the latter, use the term ": null
    },
    {
        " Confederation ": "canadian confederation"
    },
    {
        " to refer to the formation or joining, not the structure, of Canada. Legal reforms, court rulings, and political compromises have somewhat decentralized Canada in practice since its formation in 42       An ": null
    },
    {
        "empire": "empire"
    },
    {
        " is a multi-ethnic state, ": null
    },
    {
        "multinational state": "multinational state"
    },
    {
        ", or a group of nations with a ": null
    },
    {
        "central government": "central government"
    },
    {
        " established usually through ": null
    },
    {
        "coercion": "coercion"
    },
    {
        " . An empire often includes self-governing regions, but these will possess autonomy only at the sufferance of the central government. On the other hand, a political entity that is an empire in name, may comprise several partly autonomous kingdoms organised together in a federation, with the empire being ruled over by an ": null
    },
    {
        "emperor": "emperor"
    },
    {
        " or senior king . One example of this was the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " .           A ": null
    },
    {
        "federacy": "federacy"
    },
    {
        " Some dictionaries, such as the Websters Encyclopedic Unabridged Dictionary of the English Language , state that federacy is synonymous with confederacy . In French, the English words federacy, confederacy, and confederation are all translated by confédération . is where a unitary state incorporates one or more self-governing ": null
    },
    {
        "autonomous area": "autonomous area"
    },
    {
        "s. It is distinguished from a federation in that the constitutional structure of the state is still unitary, but incorporates federalist principles. Some federations, notably the ": null
    },
    {
        "Åland Islands": "åland islands"
    },
    {
        ", were established through ": null
    },
    {
        "international treaty": "international treaty"
    },
    {
        ".       A federation differs from a ": null
    },
    {
        "devolved state": "devolution"
    },
    {
        ", such as ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        " and the United Kingdom, because, in a devolved state, the central government can revoke the independence of the subunits  without changing the constitution.       A federation also differs from an ": null
    },
    {
        "associated state": "associated state"
    },
    {
        ", such as the ": null
    },
    {
        "Federated States of Micronesia": "federated states of micronesia"
    },
    {
        " and ": null
    },
    {
        "Cook Islands": "cook islands"
    },
    {
        " and ": null
    },
    {
        "Niue": "niue"
    },
    {
        " .   There are two kinds of associated states: in case of Micronesia, the association is concluded by a treaty between two sovereign states; in the case of the Cook Islands and Niue, the association is concluded by domestic legal arrangements.       The relation between the ": null
    },
    {
        "Crown dependencies": "crown dependencies"
    },
    {
        " of the ": null
    },
    {
        "Isle of Man": "isle of man"
    },
    {
        " and the bailiwicks of ": null
    },
    {
        "Guernsey": "guernsey"
    },
    {
        " and ": null
    },
    {
        "Jersey": "jersey"
    },
    {
        " in the ": null
    },
    {
        "Channel Islands": "channel islands"
    },
    {
        " and the United Kingdom is very similar to a federate relation: the Islands enjoy independence from the United Kingdom, which, via The Crown, takes care of their foreign relations and defense – although the UK Parliament does have overall power to legislate for the dependencies. However, the islands are neither an incorporated part of the United Kingdom nor are they considered to be independent or associated states. The Isle of Man does not have a monarch, per se; rather, the ": null
    },
    {
        "British Monarch": "monarchy of the united kingdom"
    },
    {
        " is,  ex officio , ": null
    },
    {
        "Lord of Mann": "lord of mann"
    },
    {
        ".       ": null
    },
    {
        "Dependent territories": "dependent territory"
    },
    {
        ", such as the ": null
    },
    {
        "British overseas territories": "british overseas territories"
    },
    {
        ", are vested with varying degrees of power; some enjoy considerable independence from the sovereign state, which only takes care of their foreign relations and defense. However, they are neither considered to be part of it nor recognized as sovereign or associated states.     De facto federationsde facto federations.      De facto federations, or quasi-federations, are often termed ": null
    },
    {
        "regional state": "regional state"
    },
    {
        "s .            ": null
    },
    {
        "Spain": "spain"
    },
    {
        " is suggested as one possible de facto federation  as it grants more self-government to its ": null
    },
    {
        "autonomous communities": "autonomous communities of spain"
    },
    {
        "   than are retained by the constituent entities of most federations.  For the ": null
    },
    {
        "Spanish parliament": "cortes generales"
    },
    {
        " to revoke the autonomy of regions such as ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        ", ": null
    },
    {
        "Catalonia": "catalonia"
    },
    {
        " or the ": null
    },
    {
        "Basque Country": "basque country"
    },
    {
        " would be a political near-impossibility, though nothing bars it legally. The Spanish parliament has, however, suspended the autonomy of ": null
    },
    {
        "Catalonia": "catalonia"
    },
    {
        " in response to the ": null
    },
    {
        "Catalan declaration of independence": "catalan declaration of independence"
    },
    {
        ", in the lead up to the ": null
    },
    {
        "42 Catalan election": "catalan regional election, 2017"
    },
    {
        ".  Additionally, some autonomies such as ": null
    },
    {
        "Navarre": "navarre"
    },
    {
        " or the Basque Country have full control over taxation and spending, transferring a small payment to the central government for the common services . For example, scholar Enrique Guillén López discusses the federal nature of Spains government .  , JUDICIAL REVIEW IN SPAIN: THE CONSTITUTIONAL COURT, 42 Loyola of Los Angeles Law Review 42 42 . Each autonomous community is governed by a ": null
    },
    {
        "Statute of Autonomy": "statute of autonomy"
    },
    {
        "  under the ": null
    },
    {
        "Spanish Constitution of 42": "constitution of spain"
    },
    {
        ".            Although South Africa bears some elements of a federal system, such as the allocation of certain powers to provinces, it is nevertheless constitutionally and functionally a unitary state.                  The ": null
    },
    {
        "European Union": "european union"
    },
    {
        " is a type of ": null
    },
    {
        "political union": "political union"
    },
    {
        " or confederation . Federalist Paper No. 42 , p.42 Alexander Hamilton ": null
    },
    {
        "Robert Schuman": "robert schuman"
    },
    {
        ", the initiator of the European Community system, wrote that a ": null
    },
    {
        "transnational": "transnational governance"
    },
    {
        " Community like the founding of the ": null
    },
    {
        "European Coal and Steel Community": "european coal and steel community"
    },
    {
        " lay midway between an association of States where they retained complete independence and a federation leading to a fusion of States in a ": null
    },
    {
        "super-state": "superstate"
    },
    {
        ". La Communaute du Charbon et de lAcier, p42 Paul Reuter with a preface by Robert Schuman. Paris 42 The ": null
    },
    {
        "Founding Fathers of the European Union": "founding fathers of the european union"
    },
    {
        " wrote the ": null
    },
    {
        "Europe Declaration ": "europe declaration"
    },
    {
        " at the time of the signing of the ": null
    },
    {
        "Treaty of Paris": "treaty of paris"
    },
    {
        " on 42 April 42 saying that Europe should be organized on a transnational foundation. They envisaged a structure quite different from a federation called the ": null
    },
    {
        "European Political Community": "european political community"
    },
    {
        ".     The EU is a three-pillar structure of the original supranational ": null
    },
    {
        "European Economic Community": "european economic community"
    },
    {
        " and the nuclear non-proliferation treaty, ": null
    },
    {
        "Euratom": "euratom"
    },
    {
        ", plus two largely ": null
    },
    {
        "intergovernmental": "intergovernmentalism"
    },
    {
        " pillars dealing with External Affairs and Justice and Home Affairs. The EU is therefore not a  de jure  federation, although some academic observers conclude that after 42 years of institutional evolution since the ": null
    },
    {
        "Treaties of Rome": "treaties of rome"
    },
    {
        " it is becoming one.  The European Union possesses attributes of a federal state. However, its central government is far weaker than that of most federations and the individual members are sovereign states under international law, so it is usually characterized as an unprecedented form of supra-national union. The EU has responsibility for important areas such as trade, monetary union, agriculture, fisheries. Nonetheless, EU ": null
    },
    {
        "member state": "member state of the european union"
    },
    {
        "s retain the right to act independently in matters of foreign policy and defense, and also enjoy a near-monopoly over other major policy areas such as criminal justice and taxation. Since the ": null
    },
    {
        "Treaty of Lisbon": "treaty of lisbon"
    },
    {
        ", the Member States right to leave the Union is codified, and the Union operates with more ": null
    },
    {
        "qualified majority voting": "qualified majority voting"
    },
    {
        " in many areas.                    A more nuanced view has been given by the German Constitutional Court.  The original German uses the word Staatenverbund, which they translate as association of sovereign states , rather than the word Staatenbund or Bundesstaat . Here the EU is defined as an association of sovereign national states .  With this view, the European Union resembles more of a ": null
    },
    {
        "confederation": "confederation"
    },
    {
        ".          Constitutionally, the power vested in the ": null
    },
    {
        "special administrative region": "special administrative region of the peoples republic of china"
    },
    {
        "s of the Peoples Republic is granted from the ": null
    },
    {
        "Central Peoples Government": "central peoples government"
    },
    {
        ", through a decision by the ": null
    },
    {
        "National Peoples Congress": "national peoples congress"
    },
    {
        ". However, there have been certain largely informal grants of power to the provinces, to handle economic affairs and implement national policies, resulting in a system some have termed federalism ": null
    },
    {
        "with Chinese characteristics": "with chinese characteristics"
    },
    {
        " .          Constitutionally a ": null
    },
    {
        "unitary state": "unitary state"
    },
    {
        ", the political system in Myanmar bears many elements of federalism. Each ": null
    },
    {
        "administrative divisions": "administrative divisions of myanmar"
    },
    {
        " have its own cabinets and chief ministers, making it more like a federation rather than a unitary state.            Certain forms of political and constitutional dispute are common to federations. One issue is that the exact division of power and responsibility between federal and regional governments is often a source of controversy. Often, as is the case with the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", such conflicts are resolved through the judicial system, which delimits the powers of federal and local governments. The relationship between federal and local courts varies from nation to nation and can be a controversial and complex issue in itself.     Another common issue in federal systems is the conflict between regional and national interests, or between the interests and aspirations of different ethnic groups. In some federations the entire jurisdiction is relatively homogeneous and each constituent state resembles a miniature version of the whole; this is known as congruent federalism. On the other hand, ": null
    },
    {
        "incongruent federalism": "incongruent federalism"
    },
    {
        " exists where different states or regions possess distinct ethnic groups.     The ability of a federal government to create national institutions that can mediate differences that arise because of linguistic, ethnic, religious, or other regional differences is an important challenge. The inability to meet this challenge may lead to the secession of parts of a federation or to civil war, as occurred in the United States  and ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ". In the case of ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        ", ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " was expelled from the federation because of rising racial tension. In some cases, internal conflict may lead a federation to collapse entirely, as occurred in ": null
    },
    {
        "Nigeria": "nigeria"
    },
    {
        ", the ": null
    },
    {
        "Federation of Rhodesia and Nyasaland": "federation of rhodesia and nyasaland"
    },
    {
        ", the ": null
    },
    {
        "Gran Colombia": "gran colombia"
    },
    {
        ", the ": null
    },
    {
        "United Provinces of Central America": "united provinces of central america"
    },
    {
        ", and the ": null
    },
    {
        "West Indies Federation": "west indies federation"
    },
    {
        ".       The federal government is the common or national government of a federation. A federal government may have distinct powers at various levels authorized or delegated to it by its member states. The structure of federal governments vary. Based on a broad definition of a basic ": null
    },
    {
        "federalism": "federalism"
    },
    {
        ", there are two or more levels of government that exist within an established territory and govern through common institutions with overlapping or shared powers as prescribed by a constitution.     The federal government is the government at the level of the sovereign state. Usual responsibilities of this level of government are maintaining ": null
    },
    {
        "national security": "national security"
    },
    {
        " and exercising international diplomacy, including the right to sign binding ": null
    },
    {
        "treaties": "treaties"
    },
    {
        ". Basically, a modern federal government, within the limits defined by its constitution, has the power to make laws for the whole country, unlike local governments. As originally written, the ": null
    },
    {
        "United States Constitution": "united states constitution"
    },
    {
        " was created to limit the federal government from exerting power over the states by enumerating only specific powers. It was further limited by the addition of the ": null
    },
    {
        "Tenth Amendment": "tenth amendment to the united states constitution"
    },
    {
        " contained in the ": null
    },
    {
        "Bill of Rights": "united states bill of rights"
    },
    {
        " and the ": null
    },
    {
        "Eleventh Amendment": "eleventh amendment to the united states constitution"
    },
    {
        ". However, later amendments, particularly the ": null
    },
    {
        "Fourteenth Amendment": "fourteenth amendment to the united states constitution"
    },
    {
        ", gave the federal government considerable authority over states.     Federal government within this structure are the government ministries and departments and agencies to which the ministers of government are assigned.     For a detailed list of federated units, see . There are 42 federations as of October 42 Forum of federations                    ": null
    },
    {
        "Federal Republic": "federal republic"
    },
    {
        " of: ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", ": null
    },
    {
        "Somalia": "somalia"
    },
    {
        ", ": null
    },
    {
        "Nigeria": "nigeria"
    },
    {
        ".   Federation: ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", ": null
    },
    {
        "Saint Kitts and Nevis": "saint kitts and nevis"
    },
    {
        ", ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        "   Republic: ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        " , ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        ", ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        ", ": null
    },
    {
        "South Sudan": "south sudan"
    },
    {
        ".   Others:   Bolivarian Republic    ": null
    },
    {
        "Confederation": "confederation"
    },
    {
        "    Commonwealth": "commonwealth"
    },
    {
        "    Dominion": "british dominionscanada"
    },
    {
        "    Federal Democratic Republic    Federated States    Federative Republic    Islamic Republic    Kingdom    Union    United Emirates    United States    None:   ": null
    },
    {
        "Bosnia and Herzegovina": "bosnia and herzegovina"
    },
    {
        "   Canada   ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        " United Kingdom of Portugal, Brazil and the Algarves": "united kingdom of portugal, brazil and the algarves"
    },
    {
        "   Hispaniola": "unification of hispaniola"
    },
    {
        "   Peru–Bolivian Confederation": "peru–bolivian confederation"
    },
    {
        "   Confederate States of America": "confederate states of america"
    },
    {
        "   Confederate Ireland": "confederate ireland"
    },
    {
        "   Federal State of Austria": "federal state of austria"
    },
    {
        "   Federal Republic of Cameroon": "cameroon"
    },
    {
        "   United Provinces of Central America": "united provinces of central america"
    },
    {
        "   United States of Colombia": "united states of colombia"
    },
    {
        "   Czechoslovakia": "czechoslovakia"
    },
    {
        "   Republic of Kenya": "republic of kenya"
    },
    {
        "   Federated Dutch Republic": "federated dutch republic"
    },
    {
        "   Federation of Ethiopia and Eritrea": "federation of ethiopia and eritrea"
    },
    {
        "   French Equatorial Africa": "french equatorial africa"
    },
    {
        "   French Indochina": "french indochina"
    },
    {
        "   French West Africa": "french west africa"
    },
    {
        "   The ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        "        North German Confederation": "north german confederation"
    },
    {
        "   German Empire": "german empire"
    },
    {
        "   Weimar Republic": "weimar republic"
    },
    {
        "   East Germany": "east germany"
    },
    {
        "   Inca Empire": "inca empire"
    },
    {
        "   United States of Indonesia": "united states of indonesia"
    },
    {
        "   United Kingdom of Libya": "united kingdom of libya"
    },
    {
        "   Federated Malay States": "federated malay states"
    },
    {
        "   Federation of Malaya": "federation of malaya"
    },
    {
        " Gained independence in 42 joined with ": null
    },
    {
        "Sabah": "sabah"
    },
    {
        ", ": null
    },
    {
        "Sarawak": "sarawak"
    },
    {
        ", and Singapore to form ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        " in 42   ": null
    },
    {
        "Malayan Union": "malayan union"
    },
    {
        "   Mali Federation": "mali federation"
    },
    {
        "   Mengjiang": "mengjiang"
    },
    {
        "    New Granada": "neogranadine confederation"
    },
    {
        "   Republic of China": "beiyang government"
    },
    {
        "   Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        "   Federation of Rhodesia and Nyasaland": "federation of rhodesia and nyasaland"
    },
    {
        "   Russian Soviet Federative Socialist Republic": "russian soviet federative socialist republic"
    },
    {
        "   Union of Soviet Socialist Republics": "soviet union"
    },
    {
        " The constitution of the USSR defined it as a federation, but at least until its final years in the late eighties and early nineties of the 42th century, it had in practice a highly centralized governance.    ": null
    },
    {
        "Federal Republic of Spain": "first spanish republic"
    },
    {
        "   Syrian Federation": "syrian federation"
    },
    {
        "   Congo-Léopoldville": "congo-léopoldville"
    },
    {
        "   South Africa": "south africa"
    },
    {
        "   Uganda": "uganda"
    },
    {
        "   West Indies Federation": "west indies federation"
    },
    {
        "   Socialist Federal Republic of Yugoslavia": "socialist federal republic of yugoslavia"
    },
    {
        " The Socialist Federal Republic of Yugoslavia was officially proclaimed in 42 Prior to this, the communist Yugoslav state was named Democratic Federal Yugoslavia in 42 and then Federal Peoples Republic of Yugoslavia in 42 See: ": null
    },
    {
        "Socialist Federal Republic of Yugoslavia": "socialist federal republic of yugoslavia"
    },
    {
        ".   ": null
    },
    {
        "Federal Republic of Yugoslavia": "serbia and montenegro"
    },
    {
        "     Some of the ": null
    },
    {
        "proclaimed Arab federations": "confederationhistorical confederations"
    },
    {
        " were confederations de facto": null
    }
]