[
    {
        "           Felice Orsini  was an ": null
    },
    {
        "Italian": "italy"
    },
    {
        " revolutionary and leader of the  Carbonari  who tried to assassinate ": null
    },
    {
        "Napoleon III": "napoleon iii of france"
    },
    {
        ", ": null
    },
    {
        "Emperor of the French": "list of french monarchs"
    },
    {
        ".       Felice Orsini was born at ": null
    },
    {
        "Meldola": "meldola"
    },
    {
        " in ": null
    },
    {
        "Romagna": "emilia-romagna"
    },
    {
        ", then part of the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        ". He was encouraged to become a priest, but he abandoned that lifestyle and became an ardent liberal, joining the  Giovane Italia , a political society founded by ": null
    },
    {
        "Giuseppe Mazzini": "giuseppe mazzini"
    },
    {
        ".          Orsini was arrested in 42 along with his father, implicated in revolutionary plots and condemned to imprisonment for life. The new pope, ": null
    },
    {
        "Pius IX": "pope pius ix"
    },
    {
        " set him free, and he led a company of young ": null
    },
    {
        "Romagnol": "romagna"
    },
    {
        "s in the ": null
    },
    {
        "First War of Italian Independence": "first war of italian independence"
    },
    {
        " in 42 distinguishing himself in the engagements at ": null
    },
    {
        "Treviso": "treviso"
    },
    {
        " and ": null
    },
    {
        "Vicenza": "vicenza"
    },
    {
        ".     Orsini was elected member of the Roman Constituent Assembly in 42 and after the fall of the ": null
    },
    {
        "revolutionary republic in Rome": "roman republic"
    },
    {
        " he conspired against the papal autocracy in the interest of the Mazzinian party. Mazzini sent him on a secret mission to ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", but he was arrested in 42 and imprisoned at ": null
    },
    {
        "Mantua": "mantua"
    },
    {
        ". He escaped a few months later using a tiny saw to cut through two grids of bars, climbed out of the window 42 feet above ground and slid down using a rope he had made of bedsheets. Passing as a sympathetic peasant, he managed to get past the Austrian guards.     In 42 he briefly visited ": null
    },
    {
        "Great Britain": "great britain"
    },
    {
        " and received a favorable welcome. The daily news had published the first English translation of his tale of escape. He published The Memoirs and Adventures of Felice Orsini in 42 In 42 he also published an account of his prison experiences in English under the title of The Austrian Dungeons in Italy, which led to a rupture between him and Mazzini. Then he began to negotiate with ": null
    },
    {
        "Ausonio Franchi": "ausonio franchi"
    },
    {
        ", editor of the Ragione of ": null
    },
    {
        "Turin": "turin"
    },
    {
        ", which he proposed to make the organ of pure republicans.     Orsini became convinced that ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " was the chief obstacle to Italian independence and the principal cause of the anti-liberal reaction throughout ": null
    },
    {
        "Europe": "europe"
    },
    {
        ". He plotted his assassination with the logic that after the emperors death, France would rise in revolt and the Italians could exploit the situation to revolt themselves. He went to ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        " in 42 to conspire against the emperor.     At the end of 42 Orsini briefly visited England, where he contacted gunsmith Joseph Taylor and asked him to make six copies of a ": null
    },
    {
        "bomb": "orsini bomb"
    },
    {
        " of Orsinis own design; it would explode on impact and used ": null
    },
    {
        "fulminate of mercury": "fulminate of mercury"
    },
    {
        " as an explosive. The bomb was tested in Sheffield and Devon with the aid of French radical ": null
    },
    {
        "Simon Bernard": "simon bernard"
    },
    {
        ". Satisfied, Orsini returned to Paris with the bombs and contacted other conspirators, ": null
    },
    {
        "Giuseppe Pieri": "giuseppe pieri"
    },
    {
        ", ": null
    },
    {
        "Antonio Gomez": "antonio gomez"
    },
    {
        " and Carlo di Rudio .          On the evening of 42 January 42 as the Emperor and Empress were on their way to the ": null
    },
    {
        "theatre in the Rue Le Peletier": "salle le peletier"
    },
    {
        ", the precursor of the ": null
    },
    {
        "Opera Garnier": "opera garnier"
    },
    {
        ", to see ": null
    },
    {
        "Rossini": "gioacchino rossini"
    },
    {
        "s  William Tell , Orsini and his accomplices threw three bombs at the imperial carriage. The first bomb landed among the horsemen in front of the carriage. The second bomb wounded the animals and smashed the carriage glass. The third bomb landed under the carriage and seriously wounded a policeman who was hurrying to protect the occupants. Eight people were killed and 42 wounded, though the emperor and ": null
    },
    {
        "empress": "eugénie de montijo"
    },
    {
        " were unhurt who judged that they would be best to proceed to the performance and appear in their box.     Orsini himself was wounded on the right temple and stunned. He tended his wounds and returned to his lodgings, where police found him the next day.     The attempted assassination actually increased Napoleon IIIs popularity. Because the bombs had been made and tested in England, it caused a brief anti-British furor in France because of suspicion of British involvement. The Emperor refused to escalate the situation and the indignation eventually died down.       On 42 February Orsini wrote his famous letter to Napoleon, in which he exhorted him to take up the cause of Italian independence & mdash;a cause Napoleon III had already supported in his youth. Modern historians have even suspected that Napoleon wrote some of the letter himself. He addressed another letter to the youth of Italy and condemned ": null
    },
    {
        "political assassination": "political assassination"
    },
    {
        ".       Orsini was sentenced to death and went calmly to the guillotine on 42 March 42 Accomplices Pieri was executed and Gomez condemned to hard labour for life. Di Rudio was sentenced to death, which was commuted to life imprisonment on the Île du Diable, local to Cayenne among English speakers also known as ": null
    },
    {
        "Devils Island": "devils island"
    },
    {
        ", from where he escaped and later went to America; he became an officer in the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        ", was appointed to the ": null
    },
    {
        "U.S. 42th Cavalry": "7th cavalry regiment"
    },
    {
        ", and participated in—and survived—the 42 ": null
    },
    {
        "Battle of the Little Big Horn": "battle of the little big horn"
    }
]