[
    {
        "               Fencing is a group of three related ": null
    },
    {
        "combat sports": "combat sports"
    },
    {
        ". The three disciplines in modern fencing are the ": null
    },
    {
        "foil": "foil"
    },
    {
        ", the ": null
    },
    {
        "épée": "épée"
    },
    {
        ", and the ": null
    },
    {
        "sabre": "sabre"
    },
    {
        " ; winning points are made through the weapons contact with an opponent. A fourth discipline, ": null
    },
    {
        "singlestick": "singlestick"
    },
    {
        ", appeared in the 1904 Olympics but was dropped after that, and is not a part of modern fencing. Fencing was one of the first sports to be played in the Olympics. Based on the traditional skills of ": null
    },
    {
        "swordsmanship": "swordsmanship"
    },
    {
        ", the modern sport arose at the end of the 19th century, with the ": null
    },
    {
        "Italian": "italy"
    },
    {
        " school having modified the ": null
    },
    {
        "historical European martial art": "historical european martial arts"
    },
    {
        " of ": null
    },
    {
        "classical fencing": "classical fencing"
    },
    {
        ", and the ": null
    },
    {
        "French": "france"
    },
    {
        " school later refining the Italian system. There are three forms of modern fencing, each of which uses a different kind of weapon and has different rules; thus the sport itself is divided into three competitive scenes: foil, épée, and sabre. Most competitive fencers choose to specialize in one weapon only.     Competitive fencing is one of the five activities which have been featured in every modern ": null
    },
    {
        "Olympic Games": "olympic games"
    },
    {
        ", the other four being ": null
    },
    {
        "athletics": "athletics at the summer olympics"
    },
    {
        ", ": null
    },
    {
        "cycling": "cycling at the summer olympics"
    },
    {
        ", ": null
    },
    {
        "swimming": "swimming at the summer olympics"
    },
    {
        ", and ": null
    },
    {
        "gymnastics": "gymnastics at the summer olympics"
    },
    {
        ".                Fencing is governed by Fédération Internationale dEscrime . Today, its head office is in ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        ", Switzerland. The FIE is composed of 145 national federations, each of which is recognised by its state ": null
    },
    {
        "Olympic Committee": "national olympic committee"
    },
    {
        " as the sole representative of Olympic-style fencing in that country.             The FIE maintains the current rules  used by FIE sanctioned international events, including world cups, world championships and the Olympic Games. The FIE handles proposals to change the rules the first year after an Olympic year in the annual congress. The US Fencing Association has slightly different rules, but usually adheres to FIE standards.               Fencing traces its roots to the development of ": null
    },
    {
        "swordsmanship": "swordsmanship"
    },
    {
        " for ": null
    },
    {
        "duels": "duel"
    },
    {
        "and ": null
    },
    {
        "self defense": "self defense"
    },
    {
        ". Fencing is believed to have originated in Spain; some of the most significant books on fencing were written by Spanish fencers. Treatise on Arms  was written by Diego de Valera between 1458 and 1471 and is one of the oldest surviving manuals on western fencing  shortly before dueling came under official ban by the Catholic Monarchs. In conquest, the Spanish forces carried fencing around the world, particularly to southern Italy, one of the major areas of strife between both nations. . Hcs.harvard.edu. Retrieved on 2012-05-16.  . Educar.org . Retrieved on 2012-05-16. Fencing was mentioned in the play  The Merry Wives of Windsor  written sometime prior to 1602.       The mechanics of modern fencing originated in the 18th century in an Italian school of fencing of the Renaissance, and under their influence, were improved by the French school of fencing. . Fencing.net. Retrieved on 2012-05-16.  . Library.thinkquest.org. Retrieved on 2012-05-16. The Spanish school of fencing stagnated and was replaced by the Italian and French schools.       The shift towards fencing as a sport rather than as military training happened from the mid-18th century, and was led by ": null
    },
    {
        "Domenico Angelo": "domenico angelo"
    },
    {
        ", who established a fencing academy, Angelos School of Arms, in ": null
    },
    {
        "Carlisle House": "carlisle house, sohocarlisle house, carlisle street"
    },
    {
        ", ": null
    },
    {
        "Soho": "soho"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        " in 1763. F.H.W. Sheppard, ed. Survey of London volume 33 The Parish of St. Anne, Soho , ": null
    },
    {
        "London County Council": "london county council"
    },
    {
        ", London: University of London, 1966, pp. 143 & ndash;48, . There, he taught the ": null
    },
    {
        "aristocracy": "aristocracy"
    },
    {
        " the fashionable art of ": null
    },
    {
        "swordsmanship": "swordsmanship"
    },
    {
        ". His school was run by three generations of his family and dominated the art of European fencing for almost a century.           He established the essential rules of ": null
    },
    {
        "posture": "list of human positions"
    },
    {
        " and ": null
    },
    {
        "footwork": "footwork"
    },
    {
        " that still govern modern sport fencing, although his attacking and ": null
    },
    {
        "parry": "parry"
    },
    {
        "ing methods were still much different from current practice. Although he intended to prepare his students for real combat, he was the first fencing master to emphasize the ": null
    },
    {
        "health": "health"
    },
    {
        " and sporting benefits of fencing more than its use as a killing art, particularly in his influential book LÉcole des armes , published in 1763.     Basic conventions were collated and set down during the 1880s by the French fencing master Camille Prévost. It was during this time that many officially recognised fencing associations began to appear in different parts of the world, such as the ": null
    },
    {
        "Amateur Fencers League of America": "amateur fencers league of america"
    },
    {
        " was founded in 1891, the Amateur Fencing Association of Great Britain in 1902, and the Fédération Nationale des Sociétés d’Escrime et Salles d’Armes de France in 1906.      The first regularized fencing competition was held at the inaugural ": null
    },
    {
        "Grand Military Tournament and Assault at Arms": "royal tournament"
    },
    {
        " in 1880, held at the ": null
    },
    {
        "Royal Agricultural Hall": "royal agricultural hall"
    },
    {
        ", in ": null
    },
    {
        "Islington": "islington"
    },
    {
        " in June. The Tournament featured a series of competitions between ": null
    },
    {
        "army": "british army"
    },
    {
        " officers and soldiers. Each bout was fought for five hits and the foils were pointed with black to aid the judges.  The ": null
    },
    {
        "Amateur Gymnastic & Fencing Association": "british gymnastics"
    },
    {
        " drew up an official set of fencing regulations in 1896.     Fencing was part of the ": null
    },
    {
        "Olympic Games": "olympic games"
    },
    {
        " in the ": null
    },
    {
        "summer of 1896": "fencing at the 1896 summer olympics"
    },
    {
        ". Sabre events have been held at every ": null
    },
    {
        "Summer Olympics": "summer olympics"
    },
    {
        "; foil events have been held at every Summer Olympics except 1908; épée events have been held at every Summer Olympics except in the ": null
    },
    {
        "summer of 1896": "1896 summer olympics"
    },
    {
        " because of unknown reasons.     Starting with ": null
    },
    {
        "épée": "épée"
    },
    {
        " in 1933, side judges were replaced by the Laurent-Pagan electrical scoring apparatus, Alaux, Michel. Modern Fencing: Foil, Epee, and Sabre. Scribners, 1975, p. 83. with an audible tone and a red or green light indicating when a touch landed. ": null
    },
    {
        "Foil": "foil"
    },
    {
        " was automated in 1956, ": null
    },
    {
        "sabre": "sabre"
    },
    {
        " in 1988. The scoring box reduced the bias in judging, and permitted more accurate scoring of faster actions, lighter touches, and more touches to the back and flank than before.        There are three weapons in modern fencing: foil, épée, and sabre. Each weapon has its own rules and strategies. Equipment needed includes at least 2 swords, a lamé , a white jacket, underarm protector, two body and mask cords, knee high socks, glove and knickers.             The foil is a light thrusting weapon with a maximum weight of 500 grams. The foil targets the torso, but not the arms or legs. The foil has a small circular hand guard that serves to protect the hand from direct stabs. As the hand is not a valid target in foil, this is primarily for safety. Touches are scored only with the tip; hits with the side of the blade do not register on the electronic scoring apparatus . Touches that land outside the target area  stop the action, but are not scored. Only a single touch can be awarded to either fencer at the end of a phrase. If both fencers land touches within a close enough interval of milliseconds to register two lights on the machine, the ": null
    },
    {
        "referee": "referee"
    },
    {
        " uses the rules of right of way to determine which fencer is awarded the touch, or if an off-target hit has priority over a valid hit, in which case no touch is awarded. If the referee is unable to determine which fencer has right of way, no touch is awarded.               The épée is a thrusting weapon like the foil, but heavier, with a maximum total weight of 775 grams. In épée, the entire body is valid target. The hand guard on the épée is a large circle that extends towards the pommel, effectively covering the hand, which is a valid target in épée. Like foil, all hits must be with the tip and not the sides of the blade. Hits with the side of the blade do not register on the electronic scoring apparatus . As the entire body is legal target, there is no concept of an off-target touch, except if the fencer accidentally strikes the floor, setting off the light and tone on the scoring apparatus. Unlike foil and sabre, épée does not use right of way , and awards simultaneous touches to both fencers. However, if the score is tied in a match at the last point and a double touch is scored, the point is null and void.               The sabre is a light cutting and thrusting weapon that targets the entire body above the waist, except the weapon hand. Sabre is the newest weapon to be used. Like the foil, the maximum legal weight of a sabre is 500 grams. The hand guard on the sabre extends from hilt to the point at which the blade connects to the pommel. This guard is generally turned outwards during sport to protect the sword arm from touches. Hits with the entire blade or point are valid. As in foil, touches that land outside the target area are not scored. However, unlike foil, these off-target touches do not stop the action, and the fencing continues. In the case of both fencers landing a scoring touch, the referee determines which fencer receives the point for the action, again through the use of right of way .           Most ": null
    },
    {
        "personal protective equipment": "personal protective equipment"
    },
    {
        " for fencing is made of tough ": null
    },
    {
        "cotton": "cotton"
    },
    {
        " or ": null
    },
    {
        "nylon": "nylon"
    },
    {
        ". ": null
    },
    {
        "Kevlar": "kevlar"
    },
    {
        " was added to top level uniform pieces following the death of ": null
    },
    {
        "Vladimir Smirnov": "vladimir viktorovich smirnov"
    },
    {
        " at the 1982 World Championships in ": null
    },
    {
        "Rome": "rome"
    },
    {
        ". However, Kevlar is degraded by both ": null
    },
    {
        "ultraviolet light": "ultraviolet light"
    },
    {
        " and ": null
    },
    {
        "chlorine": "chlorine"
    },
    {
        ", which can complicate cleaning.     Other ballistic fabrics, such as ": null
    },
    {
        "Dyneema": "dyneema"
    },
    {
        ", have been developed that ": null
    },
    {
        "resist puncture": "puncture resistance"
    },
    {
        ", and which do not degrade the way that Kevlar does. FIE rules state that tournament wear must be made of fabric that resists a force of , and that the mask bib must resist twice that amount.     The complete fencing kit includes:     ;Jacket   :The jacket is form-fitting, and has a strap  that passes between the legs. In sabre fencing, jackets are cut along the waist. A small ": null
    },
    {
        "gorget": "gorget"
    },
    {
        " of folded fabric is sewn in around the collar to prevent an opponents blade from slipping under the mask and along the jacket upwards towards the neck. Fencing instructors may wear a heavier jacket, such as one reinforced by plastic foam, to deflect the frequent hits an instructor endures.   ;Plastron   :A ": null
    },
    {
        "plastron": "plastron"
    },
    {
        " is an underarm protector worn underneath the jacket. It provides double protection on the side of the sword arm and upper arm. There is no seam under the arm, which would line up with the jacket seam and provide a weak spot.   ;Glove   :The sword hand is protected by a ": null
    },
    {
        "glove": "glove"
    },
    {
        " with a gauntlet that prevents blades from going up the sleeve and causing injury. The glove also improves grip.   ;Breeches   :": null
    },
    {
        "Breeches": "breeches"
    },
    {
        " or ": null
    },
    {
        "knickers": "knickerbockers"
    },
    {
        " are short trousers that end just below the knee. The breeches are required to have 10  cm of overlap with the jacket. Most are equipped with suspenders .   ;Socks   :Fencing socks are long enough to cover the knee; some cover most of the thigh.   ;Shoes   :Fencing shoes have flat soles, and are reinforced on the inside for the back foot, and in the heel for the front foot. The reinforcement prevents wear from lunging.   ;Mask   :The fencing mask has a bib that protects the neck. The mask should support  on the metal mesh and  of penetration resistance on the bib. FIE regulations dictate that masks must withstand  on the mesh and  on the bib. Some modern masks have a see-through visor in the front of the mask. These have been used at high level competitions , however, they are currently banned in foil and épée by the FIE, following a 2009 incident in which a visor was pierced during the European Junior Championship competition. There are foil, sabre, and three-weapon masks.   ;Chest protector   :A chest protector, made of plastic, is worn by female fencers and, sometimes, by boys. Fencing instructors also wear them, as they are hit far more often during training than their students. In foil fencing, the hard surface of a chest protector decreases the likelihood that a hit registers.   ;Lamé   :A lamé is a layer of electrically conductive material worn over the fencing jacket in foil and sabre fencing. The lamé covers the entire target area, and makes it easier to determine whether a hit fell within the target area. In sabre fencing, the lamés sleeves end in a straight line across the wrist; in foil fencing, the lamé is sleeveless. A ": null
    },
    {
        "body cord": "body cord"
    },
    {
        "  body cord": "body cord"
    },
    {
        ". The body cord serves as the connection between a fencer and a reel of wire that is part of a system for electrically detecting that the weapon has touched the opponent. There are two types: one for ": null
    },
    {
        "épée": "épée"
    },
    {
        ", and one for ": null
    },
    {
        "foil": "foil"
    },
    {
        " and ": null
    },
    {
        "sabre": "sabre"
    },
    {
        ".     Épée body cords consist of two sets of three prongs each connected by a wire. One set plugs into the fencers weapon, with the other connecting to the reel. Foil and sabre body cords have only two prongs on the weapon side, with the third wire connecting instead to the fencers lamé. The need in foil and sabre to distinguish between on and off-target touches requires a wired connection to the valid target area.     A body cord consists of three wires known as the A, B, and C lines. At the reel connector The B pin is in the middle, the A pin is 1.5  cm to one side of B, and the C pin is 2  cm to the other side of B. This asymmetrical arrangement ensures that the cord cannot be plugged in the wrong way around.     In foil, the A line is connected to the lamé and the B line runs up a wire to the tip of the weapon. The B line is normally connected to the C line through the tip. When the tip is depressed, the circuit is broken and one of three things can happen:    ": null
    },
    {
        "lamé": "lamé"
    },
    {
        " : Valid touch   The tip is touching the opponents weapon or the grounded strip: nothing, as the current is still flowing to the C line.   The tip is not touching either of the above: Off-target hit .   In Épée, the A and B lines run up separate wires to the tip . When the tip is depressed, it connects the A and B lines, resulting in a valid touch. However, if the tip is touching the opponents weapon or the grounded strip, nothing happens when it is depressed, as the current is redirected to the C line. Grounded strips are particularly important in Épée, as without one, a touch to the floor registers as a valid touch .     In Sabre, similarly to Foil, the A line is connected to the lamé, but both the B and C lines are connected to the body of the weapon. Any contact between the ones B/C line and the opponents A line results in a valid touch. There is no need for grounded strips in Sabre, as hitting something other than the opponents lame does nothing.      In a professional fencing competition, a complete set of electric equipment is needed.     A complete set of foil electric equipment includes:   An electric ": null
    },
    {
        "body cord": "body cord"
    },
    {
        ", which runs under the fencers jacket on his/her dominate side.   An electric blade.   A conductive lamé or electric vest.   A conductive bib .   An electric mask cord, connecting the conductive bib and the lamé.   The electric equipment of sabre is very similar to that of foil. In addition, equipment used in sabre includes:   A larger conductive lame.   An electric sabre.   A completely conductive mask.   A conductive glove or overlay.   Épée fencers lack a lamé, conductive bib, and head cord due to their target area. Also, their body cords are constructed differently as described above. However, they possess all of the other components of a foil fencers equipment.          Techniques or movements in fencing can be divided into two categories: offensive and defensive. Some techniques can fall into both categories . Certain techniques are used offensively, with the purpose of landing a hit on your opponent while holding the right of way . Others are used defensively, to protect against a hit or obtain the right of way.      The attacks and defences may be performed in countless combinations of feet and hand actions. For example, fencer A attacks the arm of fencer B, drawing a high outside parry; fencer B then follows the parry with a high line riposte. Fencer A, expecting that, then makes his own parry by pivoting his blade under fencer Bs weapon , putting fencer Bs tip off target and fencer A now scoring against the low line by angulating the hand upwards.     Whenever a point is scored, the fencers will go back to their starting mark. The fight will start again after the following commands have been given by the referee : En garde , Êtes-vous prêts ? , Allez .       ": null
    },
    {
        "Attack": "attack"
    },
    {
        ": A basic fencing technique, also called a thrust, consisting of the initial offensive action made by extending the arm and continuously threatening the opponents target. They are four different attacks In sabre, attacks are also made with a cutting action.   Riposte: An attack by the defender after a successful parry. After the attacker has completed their attack, and it has been parried, the defender then has the opportunity to make an attack, and take right of way.   ": null
    },
    {
        "Feint": "feint"
    },
    {
        ": A false attack with the purpose of provoking a reaction from the opposing fencer.   ": null
    },
    {
        "Lunge": "lunge"
    },
    {
        ": A thrust while extending the front leg by using a slight kicking motion and propelling the body forward with the back leg.   Beat attack: In foil and sabre, the attacker beats the opponents blade to gain priority and continues the attack against the target area. In épée, a similar beat is made but with the intention to disturb the opponents aim and thus score with a single light.   Disengage: A blade action whereby the blade is moved around the opponents blade to threaten a different part of the target or deceive a parry.   Compound attack: An attack preceded by one or more feints which oblige the opponent to parry, allowing the attacker to deceive the parry.   Continuation/renewal of Attack: A typical épée action of making a 2nd attack after the first attack is parried. This may be done with a change in line; for example, an attack in the high line is then followed with an attack to the low line ; or from the outside line to the inside line . A second continuation is stepping slight past the parry and angulating the blade to bring the tip of the blade back on target. A renewal may also be direct , in which case it is called a remise. In foil or sabre, a renewal is considered to have lost right of way, and the defenders immediate riposte, if it lands, will score instead of the renewal.   Flick: a technique used primarily in foil and épée. It takes advantage of the extreme flexibility of the blade to use it like a whip, bending the blade so that it curves over and strikes the opponent with the point; this allows the fencer to hit an obscured part of the target . This technique has become much more difficult due to timing changes which require the point to stay depressed for longer to set off the light.       ": null
    },
    {
        "Parry": "parry"
    },
    {
        ": Basic defence technique, block the opponents weapon while it is preparing or executing an attack to deflect the blade away from the fencers valid area and to give fencer the right of way. Usually followed by a riposte, a return attack by the defender.   Circle parry: A parry where the weapon is moved in a circle to catch the opponents tip and deflect it away.   Counter attack: A basic fencing technique of attacking your opponent while generally moving back out of the way of the opponents attack. Used quite often in épée to score against the attackers hand/arm. More difficult to accomplish in foil and sabre unless one is quick enough to make the counterattack and retreat ahead of the advancing opponent without being scored upon, or by evading the attacking blade via moves such as the In Quartata or Passata-sotto . Counterattacks can also be executed in opposition, grazing along the opponents blade and deflecting it to cause the attack to miss.   Point-in-line: A specific position where the arm is straight and the point is threatening the opponents target area. In foil and sabre, this gives one priority if the extension is completed before the opponent begins the final action of their attack. When performed as a defensive action, the attacker must then disturb the extended weapon to re-take priority; otherwise the defender has priority and the point-in-line will win the touch if the attacker does not manage a single light. In épée, there is no priority; the move may be used as a means by either fencer to achieve a double-touch and advance the score by 1 for each fencer. In all weapons, the point-in-line position is commonly used to slow the opponents advance and cause them to delay the execution of their attack.            University students compete internationally at the ": null
    },
    {
        "World University Games": "universiade"
    },
    {
        ". The United States holds two national level university tournaments including the ": null
    },
    {
        "NCAA": "national collegiate athletic association"
    },
    {
        " championship and the ": null
    },
    {
        "USACFC": "usacfc"
    },
    {
        " National Championships .in s USACFC. Retrieved on 2012-05-16. tournaments in the US and the ": null
    },
    {
        "BUCS": "british universities and colleges sport"
    },
    {
        " fencing championships in the United Kingdom.     National fencing organisations have set up programmes to encourage more students to fence. Examples include the Regional Youth Circuit program US Fencing Youth Development Website,  . in the US and the Leon Paul Youth Development series in the UK.     In recent years, attempts have been made to introduce fencing to a wider and younger audience, by using foam and plastic swords, which require much less protective equipment. This makes it much less expensive to provide classes, and thus easier to take fencing to a wider range of schools than traditionally has been the case. There is even a competition series in Scotland – the Plastic-and-Foam Fencing FunLeague The  website. – specifically for Primary and early Secondary school-age children using this equipment.     The UK hosts two national competitions in which schools compete against each other directly: the ": null
    },
    {
        "Public Schools": "public school"
    },
    {
        " Fencing Championship, a competition only open to Independent Schools, . and the Scottish Secondary Schools Championships, open to all secondary schools in Scotland. It contains both teams and individual events and is highly anticipated. Schools organise matches directly against one another and school age pupils can compete individually in the British Youth Championships.     Many universities in Ontario, Canada have fencing teams that participate in an annual inter-university competition called the OUA Finals.       Other variants include ": null
    },
    {
        "wheelchair fencing": "wheelchair fencing"
    },
    {
        " for those with disabilities, chair fencing, one-hit épée  and the various types of non-Olympic competitive fencing.  Chair fencing is similar to wheelchair fencing, but for the able bodied. The opponents set up opposing chairs and fence while seated; all the usual rules of fencing are applied. An example of the latter is the ": null
    },
    {
        "American Fencing League": "american fencing league"
    },
    {
        " : the format of competitions is different and the right of way rules are interpreted in a different way. In a number of countries, school and university matches deviate slightly from the FIE format. A variant of the sport using toy ": null
    },
    {
        "lightsabers": "lightsaber"
    },
    {
        "earned national attention when ": null
    },
    {
        "ESPN2": "espn2"
    },
    {
        " acquired the rights to a selection of matches and included it as part of its ESPN8: The Ocho programming block in August 2018. ": null
    }
]