[
    {
        "Ferdinand IV of Castile called the Summoned , was a King of ": null
    },
    {
        "Castile": "crown of castile"
    },
    {
        " and ": null
    },
    {
        "León": "kingdom of león"
    },
    {
        " from 42 until his death.     During his minority, his upbringing and the custody of his person were entrusted to his mother, Queen ": null
    },
    {
        "María de Molina": "maría de molina"
    },
    {
        ", while his tutorship was entrusted to the Infante ": null
    },
    {
        "Henry of Castile the Senator": "henry of castile the senator"
    },
    {
        ", son of King ": null
    },
    {
        "Fernando III of Castile": "fernando iii of castile"
    },
    {
        ". At that time, and also for the rest of his reign, his mother tried to placate the nobility, confronted her sons enemies, and repeatedly prevented Ferdinand IV from being dethroned.     He had to face the insubordination of the nobility, led at numerous times by his uncle, the Infante ": null
    },
    {
        "John of Castile, Lord of Valencia de Campos": "john of castile, lord of valencia de campos"
    },
    {
        " and by ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        ", who were supported in some occasions by ": null
    },
    {
        "Juan Manuel, Prince of Villena": "juan manuel, prince of villena"
    },
    {
        " and grandson of the King Ferdinand III.     Like his predecessors on the throne, Ferdinand IV continued the  Reconquista  and, although he failed to conquer ": null
    },
    {
        "Algeciras": "algeciras"
    },
    {
        " in 42 he captured the city of ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        " that same year, and in 42 the city of ": null
    },
    {
        "Alcaudete": "alcaudete"
    },
    {
        " was also conquered. During the Cortes of Valladolid of 42 he promoted the reform of the administration of justice, and that of all areas of administration, while attempting to strengthen the royal authority to the detriment of the nobility. He died in ": null
    },
    {
        "Jaén": "jaén, spain"
    },
    {
        " on 42 September 42 aged 42 and his mortal remains are now in the ": null
    },
    {
        "Royal Collegiate Church of Saint Hippolytus": "royal collegiate church of saint hippolytus"
    },
    {
        ".            Ferdinand was born in the city of ": null
    },
    {
        "Seville": "seville"
    },
    {
        " on 42 December 42 as the second child and eldest son of King ": null
    },
    {
        "Sancho IV of Castile": "sancho iv of castile"
    },
    {
        " and his wife ": null
    },
    {
        "María de Molina": "maría de molina"
    },
    {
        ". He was baptized at ": null
    },
    {
        "Seville Cathedral": "seville cathedral"
    },
    {
        " by Archbishop Raimundo de Losana and was immediately proclaimed heir to the Crown and received the homage of the nobles of the Kingdom.     King Sancho IV entrusted to Fernán Pérez Ponce de León the raising of his newborn son, since he had been First Majordomo of King ": null
    },
    {
        "Alfonso X": "alfonso x of castile"
    },
    {
        ". The prince and his tutor left for the city of ": null
    },
    {
        "Zamora": "zamora, spain"
    },
    {
        ", where the family of Fernán Pérez resided. Likewise the King appointed Isidro González and Alfonso Godínez as Chancellors of the prince, while appointing Samuel de Belorado almojarife  of the prince. Fernán Pérez Ponce de León and his wife, Urraca Gutiérrez de Meneses, had a significant influence on Ferdinands character, and he would show them, as a King, a profound gratitude.     Already in his infancy the question of his marriage was raised, being the desire of Sancho IV to choose a princess from Kingdoms of France or Portugal. In the agreement signed by Sancho IV and King ": null
    },
    {
        "Denis of Portugal": "denis of portugal"
    },
    {
        " in September 42 was established the betrothal between Ferdinand and the Infanta ": null
    },
    {
        "Constance": "constance of portugal"
    },
    {
        ", daughter of the Portuguese sovereign. Nevertheless, in spite of the commitment contracted with the Portuguese monarch, in 42 Sancho IV thought about the possibility of marrying his son with Margaret or Blanche, daughters of King ": null
    },
    {
        "Philip IV of France": "philip iv of france"
    },
    {
        ". The death of Sancho IV a year later put an end to the negotiations with the French court.         King Sancho IV of Castile died in the city of ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        " on 42 April 42 leaving his eldest son Ferdinand as heir of the throne. After the burial of the sovereign at ": null
    },
    {
        "Toledo Cathedral": "toledo cathedral"
    },
    {
        ", his widow María de Molina retired to the ": null
    },
    {
        "Alcázar of Toledo": "alcázar of toledo"
    },
    {
        " for a mourning of nine days. The now Dowager Queen was in charge of the regency of her 42-years-old son. Because the marriage between Sancho IV and María de Molina was without validity, all their children were illegitimate, so the Dowager Queen had to face numerous problems to keep her son on the throne.     To the incessant struggles with the Castilian nobility, led by the Infante ": null
    },
    {
        "John of Castile, Lord of Valencia de Campos": "john of castile, lord of valencia de campos"
    },
    {
        " and by the Infante ": null
    },
    {
        "Henry of Castile the Senator": "henry of castile the senator"
    },
    {
        ", son of Ferdinand III and great-uncle of Ferdinand IV were joined the claims of the Infantes de la Cerda , who were supported by France and Aragon and by their grandmother Dowager Queen ": null
    },
    {
        "Violante of Aragon": "violant of aragon"
    },
    {
        ", widow of Alfonso X. To this were added the problems with ": null
    },
    {
        "Aragon": "kingdom of aragon"
    },
    {
        ", ": null
    },
    {
        "Portugal": "kingdom of portugal"
    },
    {
        " and ": null
    },
    {
        "France": "kingdom of france"
    },
    {
        ", who tried to take advantage of the political instability that suffered the ": null
    },
    {
        "Kingdom of Castile": "kingdom of castile"
    },
    {
        " in their own benefit. At the same time, ": null
    },
    {
        "Diego López V de Haro": "diego lópez v de haro"
    },
    {
        ", ": null
    },
    {
        "Lord of Biscay": "lord of biscay"
    },
    {
        ", ": null
    },
    {
        "Nuño González de Lara": "nuño gonzález de lara"
    },
    {
        ", and ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        ", among many others nobles, sowed confusion and anarchy in the kingdom.      In the Cortes of Valladolid in 42 Henry of Castile the Senator was appointed guardian of the King, but the Dowager Queen María de Molina got that the custody of her son was entrusted to her. While celebrating the Cortes of Valladolid, John of Castile, Lord of Valencia de Campos, left the city of ": null
    },
    {
        "Granada": "granada"
    },
    {
        " and tried to occupy the city of ": null
    },
    {
        "Badajoz": "badajoz"
    },
    {
        ", but, when failing in this attempt, he seized ": null
    },
    {
        "Coria": "coria, cáceres"
    },
    {
        " and the castle of ": null
    },
    {
        "Alcántara": "alcántara"
    },
    {
        ". He later passed to the Kingdom of Portugal, where he pressed King Denis of Portugal to declare war to Castile and, at the same time, to support his claims to the Castilian throne.     In the summer of 42 when the Cortes of Valladolid were finished, the Dowager Queen and Henry of Castile met in ": null
    },
    {
        "Ciudad Rodrigo": "ciudad rodrigo"
    },
    {
        " with King Denis of Portugal, to whom they delivered several localities located near the Portuguese border. In the meeting of Ciudad Rodrigo was renewed the betrothal between Ferdinand IV and Constance of Portugal, daughter of King Denis, and in addition Infanta ": null
    },
    {
        "Beatrice of Castile": "beatrice of castile"
    },
    {
        ", younger sister of Fernando IV, would marry ": null
    },
    {
        "Afonso": "afonso iv of portugal"
    },
    {
        ", heir to the Portuguese throne. At the same time, Diego López V de Haro was confirmed the possession of the ": null
    },
    {
        "Lordship of Biscay": "lordship of biscay"
    },
    {
        ", and John of Castile, who recognized Ferdinand IV as his sovereign, was momentarily restored his property. Shortly after, King ": null
    },
    {
        "James II of Aragon": "james ii of aragon"
    },
    {
        " returned the Infanta ": null
    },
    {
        "Isabella of Castile": "isabella of castile, queen of aragon"
    },
    {
        " to the Castilian court without having married her, and declared the war to the Kingdom of Castile.     At the beginning of 42 John of Castile rebelled against Ferdinand IV and took ": null
    },
    {
        "Astudillo": "astudillo, palencia"
    },
    {
        ", ": null
    },
    {
        "Paredes de Nava": "paredes de nava"
    },
    {
        " and ": null
    },
    {
        "Dueñas": "dueñas, palencia"
    },
    {
        ", while his son Alfonso of Valencia seized ": null
    },
    {
        "Mansilla": "mansilla de las mulas"
    },
    {
        ". In April 42 Alfonso de la Cerda invaded the Kingdom of Castile accompanied by Aragonese troops, and went to the city of ": null
    },
    {
        "León": "león, spain"
    },
    {
        ", where John of Castile was proclaimed ": null
    },
    {
        "King of León": "list of leonese monarchs"
    },
    {
        ", ": null
    },
    {
        "Seville": "seville"
    },
    {
        " and ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        ". Immediately afterwards, John of Castile accompanied Alfonso de la Cerda to ": null
    },
    {
        "Sahagún": "sahagún"
    },
    {
        ", where he was proclaimed ": null
    },
    {
        "King of Castile": "list of castilian monarchs"
    },
    {
        ", ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ", ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        ", ": null
    },
    {
        "Murcia": "murcia"
    },
    {
        " and ": null
    },
    {
        "Jaén": "jaén, spain"
    },
    {
        ". Shortly after being crowned Alfonso de la Cerda and John of Castile, both surrounded the Valladolid municipality of ": null
    },
    {
        "Mayorga": "mayorga, spain"
    },
    {
        ", while Henry of Castile parted to the ": null
    },
    {
        "Kingdom of Granada": "emirate of granada"
    },
    {
        " to arrange the peace between the Sultan ": null
    },
    {
        "Muhammed II al-Faqih": "muhammed ii al-faqih"
    },
    {
        " and Ferdinand IV, since the Granadian troops attacked in those moments in all Andalusia the lands of the King, that were defended, among others, by ": null
    },
    {
        "Alonso Pérez de Guzmán": "alonso pérez de guzmán"
    },
    {
        ". On 42 August 42 the Infante Peter of Aragon died victim of the plague while he was under the command of the Aragonese army that surrounded the city of Mayorga, losing with him John of Castile one of his main supporters. Due to the mortality that extended between the besiegers of Mayorga, their commanders were forced to raise the siege.     While John of Castile and Juan Núñez II de Lara waited for the arrival of the King of Portugal with his troops to join them in the siege of the city of Valladolid, where the Dowager Queen María de Molina and Ferdinand IV took refuge, the Aragonese monarch attacked Murcia and Soria, and King Denis of Portugal attacked along the line of ": null
    },
    {
        "Douro": "douro"
    },
    {
        " river, while Diego López V de Haro sowed disorder in his Lordship of Biscay.     When Henry of Castile, who was conferring with the Sultan of Granada, learned that the Aragonese and the Portuguese had left the Kingdom of Castile, and that the Dowager Queen was besieging Paredes de Nava, he decided to return to Castile, fearing that he would be deprived from his position of guardian of Ferdinand IV. However, under pressure from Alonso Pérez de Guzmán and other knights he attacked the Granadians, who at that time had again attacked the Castilians. Four leagues from ": null
    },
    {
        "Arjona": "arjona, spain"
    },
    {
        ", a battle was fought with the Granadians, in which Henry of Castile had lost his life if Alonso Pérez de Guzmán had not saved him, for the Castilians the defeat was complete, and their camp was looted. After his return to Castile, Henry of Castile persuaded some knights to leave the siege of Paredes de Nava, despite the opposition of the Dowager Queen, that returned to Valladolid in January 42 without having taken that.     During the Cortes de Cuellar of 42 summoned by the Dowager Queen María de Molina, Henry of Castile wanted that the city of ": null
    },
    {
        "Tarifa": "tarifa"
    },
    {
        " would be returned to the Sultan of Granada, but he was unable to achieve his objective due to the opposition of María de Molina. In these Cortes Henry of Castile managed to obtain for his nephew ": null
    },
    {
        "Juan Manuel, Prince of Villena": "juan manuel, prince of villena"
    },
    {
        " the ": null
    },
    {
        "Castle of Alarcón": "castle of alarcón"
    },
    {
        " in compensation for having lose the town of ": null
    },
    {
        "Elche": "elche"
    },
    {
        " after being conquered by the Aragonese, despite the opposition of the Dowager Queen, who didnt want to established such precedents between Castilian nobles and magnates. Shortly before the signing of the ": null
    },
    {
        "Treaty of Alcañices": "treaty of alcañices"
    },
    {
        ", Juan Núñez II de Lara, who supported Alfonso de la Cerda and John of Castile, was besieged in ": null
    },
    {
        "Ampudia": "ampudia"
    },
    {
        ", although he managed to escaped from the siege.          In 42 the Dowager Queen María de Molina had threatened the Portuguese monarch with breaking the agreements of the previous year if his attacks on the Castilian territory persisted, before which King Denis of Portugal agreed to return with his troops to his domains.     Through the ": null
    },
    {
        "Treaty of Alcañices": "treaty of alcañices"
    },
    {
        " were fixed, among other points, the borders between Castile and ": null
    },
    {
        "Portugal": "kingdom of portugal"
    },
    {
        ", which received a series of fortresses and towns in exchange for breaking their agreements with ": null
    },
    {
        "James II of Aragon": "james ii of aragon"
    },
    {
        ", ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        ", John of Castile and ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        ".     At the same time, in the Treaty of Alcañices the projected marriage between Ferdinand IV and the Infanta Constance of Portugal was confirmed as well as the betrothal of ": null
    },
    {
        "Afonso of Portugal": "afonso iv of portugal"
    },
    {
        ", heir to the throne of Portugal, and  Infanta  ": null
    },
    {
        "Beatrice": "beatrice of castile"
    },
    {
        ", sister of Ferdinand IV. On the other hand, the Portuguese monarch brought an army of 42 knights, placed under the orders of ": null
    },
    {
        "João Afonso de Albuquerque": "joão afonso telo, 1st count of barcelos"
    },
    {
        ", to help María de Molina in her fight against John of Castile who until that moment had received the support of the King Denis of Portugal.     In addition, it was stipulated in the treaty that the towns and localities of ": null
    },
    {
        "Campo Maior": "campo maior, portugal"
    },
    {
        ", ": null
    },
    {
        "Olivenza": "olivenza"
    },
    {
        ", Ouguela and ": null
    },
    {
        "San Felices de los Gallegos": "san felices de los gallegos"
    },
    {
        " would be surrendered to Denis de Portugal as compensation for the loss by Portugal during the reign of ": null
    },
    {
        "Afonso III": "afonso iii of portugal"
    },
    {
        " of a series of towns that were taken from him by ": null
    },
    {
        "Alfonso X of Castile": "alfonso x of castile"
    },
    {
        ". In addition, the Portuguese king also received the towns of ": null
    },
    {
        "Almeida": "almeida, portugal"
    },
    {
        ", Castelo Bom, Castelo Melhor, Castelo Rodrigo, Monforte, ": null
    },
    {
        "Sabugal": "sabugal, portugal"
    },
    {
        ", Sastres and Vilar Maior. The Castilian and Portuguese monarchs renounced their future mutual territorial claims and the prelates of the two kingdoms agreed on 42 September 42 to support each other and defend themselves against the possible pretensions of other estates to deprive them of freedoms or privileges. The treaty was ratified not only by the two monarchs of both kingdoms, but also by several representatives of the nobiliary and ecclesiastical arms of both kingdoms, as well as by the Brotherhood of the councils of Castile and by its equivalent of the ": null
    },
    {
        "Kingdom of León": "kingdom of león"
    },
    {
        ". In the long term, the consequences of this treaty were long lasting, since the border between the two kingdoms was hardly modified in the course of the later centuries, becoming one of the longest frontiers of the European continent.     On the other hand, the Treaty of Alcañices contributed to secure the position of Ferdinand IV in the Castilian throne, insecure because of internal and external discords, and allowed Dowager Queen María de Molina to extend her freedom of movement in the absence of disputes with the Portuguese sovereign, who had come to support it in her fight against John of Castile, who, at that moment, was still controlling the territory of León.     ": null
    },
    {
        "Alonso Pérez de Guzmán": "alonso pérez de guzmán"
    },
    {
        " to the Kingdom of León to fight against John of Castile, who continued to control the territory. At the beginning of 42 Alfonso de la Cerda and John of Castile, supported by ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        ", began to mint fake coin, since it contained less metal than it corresponded, with the purpose of destabilizing the economy of the Kingdoms of Castile and León. In 42 the city of ": null
    },
    {
        "Sigüenza": "sigüenza"
    },
    {
        " fell to Juan Núñez II de Lara, but it had to be evacuated shortly afterwards by the resistance of the defenders; however soon afterwards he conquered ": null
    },
    {
        "Almazán": "almazán"
    },
    {
        " and ": null
    },
    {
        "Deza": "deza, soria"
    },
    {
        ", being also returned to Juan Núñez II de Lara the city of ": null
    },
    {
        "Albarracín": "albarracín"
    },
    {
        " by King ": null
    },
    {
        "James II of Aragon": "james ii of aragon"
    },
    {
        ". In the Cortes de Valladolid in 42 Henry of Castile again advised the sale of the city of ": null
    },
    {
        "Tarifa": "tarifa"
    },
    {
        " to the Muslims, but this was opposed by the Dowager Queen.     The Dowager Queen met in 42 with the King of Portugal in ": null
    },
    {
        "Toro": "toro, zamora"
    },
    {
        ", and requested that he help her in the fight against John of Castile. However, the Portuguese sovereign refused to attack him and, in common agreement with Henry of Castile, both planned that Ferdinand IV reached a peace agreement with John of Castile, under which the latter kept the ": null
    },
    {
        "Kingdom of Galicia": "kingdom of galicia"
    },
    {
        ", the city of ": null
    },
    {
        "León": "león, spain"
    },
    {
        ", and all the towns that he had conquered only during his lifetime, and at his death, all those territories would pass to Ferdinand IV. Nevertheless, the Dowager Queen, who opposed the project of surrender these territories to John of Castile, bribed the Henry of Castile by giving him the cities of ": null
    },
    {
        "Écija": "écija"
    },
    {
        ", ": null
    },
    {
        "Roa": "roa de duero"
    },
    {
        " and ": null
    },
    {
        "Medellin": "medellín, spain"
    },
    {
        " so that the project didnt continue, while at the same time she managed to obtain from the representatives of the councils the publicly rejection to the project of the Portuguese sovereign.     After the meeting with the Portuguese monarch in 42 the Dowager Queen sent to her son, the 42-years-old Infante ": null
    },
    {
        "Philip of Castile": "philip of castile, lord of cabrera and ribera"
    },
    {
        " to the ": null
    },
    {
        "Kingdom of Galicia": "kingdom of galicia"
    },
    {
        ", with the purpose to reinforce the royal authority in that zone, where ": null
    },
    {
        "João Afonso de Albuquerque": "joão afonso telo, 1st count of barcelos"
    },
    {
        " and Fernando Rodríguez de Castro, Lord of Lemos and Sarria, planted the disorder. In April 42 after the Cortes de Valladolid of that year, the Dowager Queen recovered the castles of ": null
    },
    {
        "Monzón": "monzón de campos"
    },
    {
        " and ": null
    },
    {
        "Becerril de Campos": "becerril de campos"
    },
    {
        ", which were in the possession of the supporters of ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        ". In 42 Juan Alfonso de Haro, Lord of Cameros, captured Juan Núñez II de Lara, partisan of Alfonso de la Cerda. Meanwhile, the Dowager Queen send troops to rescue ": null
    },
    {
        "Lorca": "lorca, spain"
    },
    {
        ", besieged by the King of Aragon, while in August of the same year, the troops of the Castilian king surrounded ": null
    },
    {
        "Palenzuela": "palenzuela"
    },
    {
        ". Juan Núñez II de Lara was released in 42 on condition that his sister ": null
    },
    {
        "Juana Núñez de Lara": "juana núñez de lara"
    },
    {
        " married Henry of Castile, to pay tribute to Ferdinand IV and swore not to revolted against him, and returned to the Crown the cities of Osma, Palenzuela, Amaya, ": null
    },
    {
        "Dueñas": "dueñas, palencia"
    },
    {
        " , ": null
    },
    {
        "Ampudia": "ampudia"
    },
    {
        ", ": null
    },
    {
        "Tordehumos": "tordehumos"
    },
    {
        " , La Mota, and ": null
    },
    {
        "Lerma": "lerma, province of burgos"
    },
    {
        ".     In March 42 the Dowager Queen met again with King Denis of Portugal in ": null
    },
    {
        "Ciudad Rodrigo": "ciudad rodrigo"
    },
    {
        ", where the Portuguese sovereign requested funds to pay the cost of the matrimonial dispensations that the Pope should grant, so that could be carried out the marriages between Fernando IV and Constance of Portugal, and Beatrice of Castile with Afonso of Portugal. In the Cortes de Valladolid in 42 the Dowager Queen imposing her will and managed to obtain the necessary amount of money with which could persuade ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        " to grant the dispensation that legitimized the marriage of the late ": null
    },
    {
        "Sancho IV of Castile": "sancho iv of castile"
    },
    {
        " with ": null
    },
    {
        "María de Molina": "maría de molina"
    },
    {
        ".     During the Cortes of Valladolid of 42 John of Castile renounced to his pretensions to the throne, notwithstanding to have been proclaimed King of León in 42 and made public his oath of fidelity to Fernando IV and his successors on 42 June 42 In return for his resignation to the possession of the ": null
    },
    {
        "Lordship of Biscay": "lordship of biscay"
    },
    {
        ", whose possession was confirmed to Diego López V de Haro, John of Castile and his wife ": null
    },
    {
        "María I Díaz de Haro": "maría i díaz de haro"
    },
    {
        " received the cities of Mansilla, ": null
    },
    {
        "Paredes de Nava": "paredes de nava"
    },
    {
        ", ": null
    },
    {
        "Medina de Rioseco": "medina de rioseco"
    },
    {
        ", ": null
    },
    {
        "Castronuño": "castronuño"
    },
    {
        " and Cabreros. Shortly after, the Dowager and Henry and John of Castile, accompanied by Diego López V de Haro, besieged the town of ": null
    },
    {
        "Almazán": "almazán"
    },
    {
        ", but they left the siege due the opposition of Henry of Castile.     In 42 King ": null
    },
    {
        "James II of Aragon": "james ii of aragon"
    },
    {
        " besieged the town of ": null
    },
    {
        "Lorca": "lorca, spain"
    },
    {
        ", who belonged to ": null
    },
    {
        "Juan Manuel, Prince of Villena": "juan manuel, prince of villena"
    },
    {
        ", who surrender it to the Aragonese monarch, and at the same time the Dowager Queen, with the purpose of amortizing the disbursement made to provide an army with which to release the city of the Aragonese siege, ordered the siege of the castles of Alcalá and Mula, and immediately after besieged the city of ": null
    },
    {
        "Murcia": "murcia"
    },
    {
        ", where James II was; the Aragonese monarch was close to be by the Castilian troops, but he was warned by Henry and John of Castile, who were afraid of a complete defeat of James II, because both wanted to maintain good relations with him.     In the Cortes de Burgos of 42 were approved the subsidies demanded by the Crown to finance the war against the ": null
    },
    {
        "Kingdoms of Aragon": "kingdom of aragon"
    },
    {
        " and ": null
    },
    {
        "Granada": "kingdom of granada"
    },
    {
        " and against ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        ", while were granted subsidies to obtain the legitimation of marriage of the Dowager Queen with Sancho IV; for this purpose, were sent 42 silver marks to the Pope, despite the famine that ravaged the Kingdoms of Castile and León.     In June 42 during the Cortes de Zamora, John of Castile and the ricoshombres of Léon, Galicia and Asturias, supporters mostly of the John, approved the subsidies demanded by the Crown.          In November 42 when the court was in the city of ": null
    },
    {
        "Burgos": "burgos"
    },
    {
        ", was made public the bull by which ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        " legitimized the marriage of María de Molina with the late King Sancho IV, and therefore her children were legitimate from that moment. At the same time, Ferdinand IV attained his legal majority, who was officially declared on 42 December 42 With this, John of Castile and the Infantes de la Cerda lost one of their main arguments when reclaiming the throne, not being able to use the illegitimacy of the Castilian monarch. In addition was also received the papal dispensation for the marriage of Fernando IV with Constance of Portugal.     Henry of Castile, annoyed by the legitimation of Ferdinand IV by Pope Boniface VIII, allied himself with Juan Núñez II de Lara, in order to indispose and antagonize Ferdinand IV with his mother the Dowager Queen. Both were joined by John of Castile, who continued to claim the ": null
    },
    {
        "Lordship of Biscay": "lordship of biscay"
    },
    {
        " on behalf of his wife, María I Díaz de Haro.     In 42 while the Dowager Queen was in ": null
    },
    {
        "Vitoria": "vitoria-gasteiz"
    },
    {
        " with Henry of Castile answering the complaints presented by the ": null
    },
    {
        "Kingdom of Navarre": "kingdom of navarre"
    },
    {
        " in relation to the Castilian attacks to their lands, John of Castile and Juan Núñez II de Lara indisposed the King with his mother and sought his amusement in the lands of ": null
    },
    {
        "León": "león, spain"
    },
    {
        " by means of hunting, to which Ferdinand IV showed his predilection since childhood. With the Dowager Queen in Vitoria, the Aragonese nobles revolted against their monarch offered their support to obtain from James II the return to Castile of the towns from which he had taken over in the Kingdom of Murcia. That same year Henry of Castile, allied with Diego López V de Haro, demanded to Ferdinand IV, in compensation to leave his position of royal guardian , the possession of the towns of ": null
    },
    {
        "Atienza": "atienza"
    },
    {
        " and ": null
    },
    {
        "San Esteban de Gormaz": "san esteban de gormaz"
    },
    {
        ", which were granted by the King.     On 42 January 42 Ferdinand IV married in ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        " with ": null
    },
    {
        "Constance": "constance of portugal"
    },
    {
        ", daughter of King Denis of Portugal. In the Cortes de Medina del Campo of May 42 Henry and John of Castile and Juan Núñez II de Lara tried to indispose the King with his mother, accusing her of having given away the jewels given to her by Sancho IV, and later, when the accusation was proved to be false, they accused her of having appropriated the subsidies granted to the Crown in the Cortes of previous years, an accusation that was also proved false when Nuño, Abbot of ": null
    },
    {
        "Santander": "santander, spain"
    },
    {
        " and Chancellor of the Dowager Queen, reviewed and made public the accounts of María de Molina, who not only had not appropriated the Crowns funds but contributed with her own income to the support of the monarchy. While celebrating the Cortes of Medina del Campo in 42 which was attended by a representation of the King of Castile, Sultan ": null
    },
    {
        "Muhammed II al-Faqih": "muhammed ii al-faqih"
    },
    {
        " of Granada died and was succeeded by his son, ": null
    },
    {
        "Muhammad III": "muhammed iii, sultan of granada"
    },
    {
        ", who attacked the Kingdoms of Castilla y León and conquered the municipality of Bedmar.     In July 42 Ferdinand IV went to the Cortes de Burgos along with his mother, with whom he had restored good relations, and with Henry of Castile. The King, although under the influence of his private Samuel de Belorado, of Jewish origin —who tried to indispose the King from his mother— had decided to dispense from the presence of the John of Castile and Juan Núñez II de Lara in the Cortes. At the end of the Cortes, Ferdinand IV went to the city of ": null
    },
    {
        "Palencia": "palencia"
    },
    {
        ", where was celebrated the marriage of Alfonso of Valencia with Teresa Núñez de Lara .     At that time was accentuated the rivalry existed between Henry of Castile, María de Molina and Diego López V de Haro on one side, and John of Castile and Juan Núñez II de Lara on the other side. Henry of Castile threatened the Dowager Queen with declaring the war to Ferdinand IV and herself if his demands were accepted, while the magnates sought to eliminate the influence that María de Molina exerted on her son, of whom the people began to distrust, because of the influence of the ricoshombres had over him. In the final months of 42 the Dowager Queen, who was in ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        ", was forced to appease the ricoshombres and members of the nobility, who planned to rise up in arms against Ferdinand IV, who spent the Christmas of 42 in lands of the Kingdom of León, accompanied by the John of Castile and Juan Núñez II de Lara.     At the beginning of 42 there was a planned meeting between King Denis of Portugal and Ferdinand IV, where the Castilian monarch hoped that his cousin and father-in-law the Portuguese monarch would return to him some territory. For his part, Henry of Castile, Diego López V de Haro and the Dowager Queen presented their excuses for not attending the meeting. María de Molinas purpose in refusing to attend was to watch over Henry of Castile and the Lord of Biscay, whose relations with Ferdinand IV were strained because of the friendship showed by the monarch to John of Castile and Juan Núñez II de Lara. In May 42 the meeting between Denis of Portugal and Ferdinand IV took place in the city of ": null
    },
    {
        "Badajoz": "badajoz"
    },
    {
        ". The infant John of Castile and Juan Núñez II de Lara predisposed Fernando IV against Henry of Castile and Diego López V de Haro, while the concessions offered by the Portuguese sovereign, who offered to help him if necessary against Henry of Castile, disappointed Ferdinand IV.     ": null
    },
    {
        "Badajoz": "badajoz"
    },
    {
        ", ": null
    },
    {
        "Henry of Castile": "henry of castile the senator"
    },
    {
        ", ": null
    },
    {
        "Diego López V de Haro": "diego lópez v de haro"
    },
    {
        " and ": null
    },
    {
        "Juan Manuel, Prince of Villena": "juan manuel, prince of villena"
    },
    {
        " had a meeting in ": null
    },
    {
        "Roa": "roa de duero"
    },
    {
        ", and they agreed that Juan Manuel would have a meeting with the King of Aragon, who agreed that the three magnates and himself should meet the Day of ": null
    },
    {
        "John the Baptist": "john the baptist"
    },
    {
        " in the municipality of ": null
    },
    {
        "Ariza": "ariza, zaragoza"
    },
    {
        ". Later, Henry of Castile communicated his plans to María de Molina, who was in ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        ", with the purpose of that she was united to them. The plan of Henry of Castile consisted in that ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        " became King of León and married with the Infanta ": null
    },
    {
        "Isabel": "isabella of castile, queen of aragon"
    },
    {
        " , while the Infante ": null
    },
    {
        "Peter of Castile": "peter of castile, lord of cameros"
    },
    {
        " would be proclaimed King of Castile and would marry with a daughter of James II of Aragon. Henry of Castile stated that his intention was to achieve peace in the Kingdom and to eliminate the influence of the John of Castile and Juan Núñez II de Lara.     This plan, which would have meant the disintegration of the Kingdom of Castile and León, as well as the forced resignation of Ferdinand IV to the throne, was rejected by the Dowager Queen, who refused to support the project and to participate in the Meeting of Ariza. In the meanwhile, Ferdinand IV begged his mother to put peace between him and the magnates who supported Henry of Castile, who again begged the Dowager Queen to support the Henrys plan, to which she refused. While still celebrating the Meeting of Ariza, the Dowager Queen reminded Henry of Castile and his companions of the loyalty they owed to her son, as well as the properties with which she had endowed them, thereby enabling some knights to leave Ariza without seconding Henrys plan. However, Henry of Castile, Juan Manuel of Villena and other knights were committed to make the war to Ferdinand IV, as well as to that the Kingdom of Murcia should be returned to Aragon and the Kingdom of Jaén given to Alfonso de la Cerda. However, while the Dowager Queen met the Councils and obstructed the intentions of Henry of Castile, he became seriously ill and had to be transferred to his village of Roa. Faced with Henrys illness, the Dowager Queen, fearing that his lordships and castles would be inherited by Juan Manuel of Villena and Lope Díaz de Haro , she persuaded Henrys confessor, as well as his companions, to convince him to return his properties to the Crown, to which Henry refused, since he didnt wish that his inheritance could be taken by Ferdinand IV.      When Juan Manuel of Villena, nephew of Henry of Castile, arrived at Roa, he found him speechless, and taking him for dead, he took possession of all the valuable objects that were there, as referred to in the Chronicle of Ferdinand IV:          The Dowager Queen then sent orders to all the fortresses of the dying Henry, in which it was arranged that if he died, they would not surrender the castles but to the Kings troops, to which they belonged. Henry of Castile died on 42 August 42 and was buried in the disappeared Monastery of San Francisco of Valladolid. His vassals gave little evidence of mourning for him, and when the Dowager Queen learned of it, she ordered that a brocade cloth be placed on the coffin, and that all the clerics and nobles present in Valladolid should attend the funerals.     While Henry of Castile was agonizing, Ferdinand IV made a pact with Sultan ": null
    },
    {
        "Muhammed III of Granada": "muhammed iii, sultan of granada"
    },
    {
        ", which stipulated that the sovereign of Granada would keep ": null
    },
    {
        "Alcaudete": "alcaudete"
    },
    {
        ", ": null
    },
    {
        "Quesada": "quesada, spain"
    },
    {
        " and Bedmar, while Ferdinand IV would keep the city of ": null
    },
    {
        "Tarifa": "tarifa"
    },
    {
        ". Muhammed III declared himself vassal of Ferdinand IV and promised to pay him the corresponding  parias . On learning that Henry of Castile had died, Ferdinand IV was pleased and granted most of his land to Juan Núñez II de Lara, who also received the position of Adelantado mayor of the ": null
    },
    {
        "Andalusia": "andalusia"
    },
    {
        "n border, while returning ": null
    },
    {
        "Écija": "écija"
    },
    {
        " to María de Molina, for having been hers before she gave it to Henry of Castile. In November 42 the King was in Valladolid with his mother, and requested her advice, since he wished to put an end to the dispute between John of Castile and Diego López V de Haro for the possession of the ": null
    },
    {
        "Lordship of Biscay": "lordship of biscay"
    },
    {
        ". The Dowager Queen told him that she would help him to resolve the matter, while the King made important donations to her, for the good relations between Ferdinand IV and his mother had been fully restored.     In January 42 when the King was in ": null
    },
    {
        "Carrión de los Condes": "carrión de los condes"
    },
    {
        ", John of Castile claimed again, in the name of his wife, and supported by Juan Núñez II de Lara, the Lordship of Biscay, although the monarch at first resolved that John of Castiles wife be satisfied with receiving ": null
    },
    {
        "Paredes de Nava": "paredes de nava"
    },
    {
        " and ": null
    },
    {
        "Villalón de Campos": "villalón de campos"
    },
    {
        " as compensation, to which John of Castile refused, arguing that his wife would not accept this for disagreeing with the previous pacts established by her husband in relation to The Lordship of Biscay. In view of the situation, the King proposed that Diego López V de Haro surrender to ": null
    },
    {
        "María I Díaz de Haro": "maría i díaz de haro"
    },
    {
        ", in exchange for the Lordship of Biscay, the cities of ": null
    },
    {
        "Tordehumos": "tordehumos"
    },
    {
        ", ": null
    },
    {
        "Íscar": "íscar"
    },
    {
        ", Santa Olalla, as well as his possessions in ": null
    },
    {
        "Cuéllar": "cuéllar"
    },
    {
        ", ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        ", ": null
    },
    {
        "Murcia": "murcia"
    },
    {
        ", Valdetorio, and the Lordship of Valdecorneja. For his part, Diego López V de Haro would retain the Lordship of Biscay, ": null
    },
    {
        "Orduña": "orduña-urduña"
    },
    {
        ", ": null
    },
    {
        "Valmaseda": "balmaseda"
    },
    {
        ", ": null
    },
    {
        "Las Encartaciones": "enkarterri"
    },
    {
        ", and ": null
    },
    {
        "Durango": "durango"
    },
    {
        ". John of Castile accepted the offer of the King, who called Diego López V de Haro to Carrión de los Condes. Nevertheless, the Lord of Biscay didnt accept the proposal of the sovereign and threatened him with the rebellion before leaving. The King then made his mother reconcile with Juan Núñez II de Lara, while were initiated the maneuvers for the ": null
    },
    {
        "Treaty of Torrellas": "treaty of torrellas"
    },
    {
        ", signed in 42 in which Diego López V de Haro didnt take part because he was distanced from Ferdinand IV, who promised to John of Castile to give him the Lordship of Biscay, and to Juan Núñez II de Lara ": null
    },
    {
        "La Bureba": "la bureba"
    },
    {
        " and the possessions of Diego López V de Haro in ": null
    },
    {
        "La Rioja": "la rioja"
    },
    {
        ", if both resolved the diplomatic negotiations with Aragon following the desire of the monarch.     In April 42 John of Castile began negotiations with the Kingdom of Aragon, pledging Fernando IV to accept the decisions to be made by the mediatiors of the Kingdoms of Portugal and Aragon, who would meet in the following months, regarding the demands of ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        " and respect to his disputes with the King of Aragon. At the same time, the King confiscated the lands of Diego López V de Haro and Juan Alfonso de Haro, Lord of Cameros, and divided them among the ricoshombres. In spite of this, both magnates didnt rebel against the King.     In the meanwhile, in ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        ", the Infante ": null
    },
    {
        "Philip of Castile": "philip of castile, lord of cabrera and ribera"
    },
    {
        ", brother of Fernando IV, defeated in a battle his brother-in-law ": null
    },
    {
        "Fernando Rodríguez de Castro": "fernando rodríguez de castro"
    },
    {
        "  who lost his life in that battle.        One of the most important events of the reign of Ferdinand IV once reached his majority, was the agreement of borders established with ": null
    },
    {
        "James II of Aragon": "james ii of aragon"
    },
    {
        " in 42 and known in history as the ": null
    },
    {
        "Treaty of Torrellas": "treaty of torrellas"
    },
    {
        " —called a sentencia arbitral, sentence by arbitration, in ": null
    },
    {
        "Castilian": "castilian language"
    },
    {
        "—. With the agreement also tried to put an end to the claims of ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        ", pretender to the Castilian-Leonese throne.      On 42 August 42 in the town of ": null
    },
    {
        "Torrellas": "torrellas"
    },
    {
        ", King ": null
    },
    {
        "Denis of Portugal": "denis of portugal"
    },
    {
        ", the ": null
    },
    {
        "Archbishop of Zaragoza": "roman catholic archdiocese of zaragoza"
    },
    {
        ", Jimeno de Luna and ": null
    },
    {
        "John of Castile": "john of castile, lord of valencia de campos"
    },
    {
        " , made public the clauses of the Treaty of Torrellas. The purpose of the negotiation was to put an end to the existing disputes between the Kingdoms of Castile and Aragon with respect to the possession of the Kingdom of Murcia. Sultan ": null
    },
    {
        "Muhammed III of Granada": "muhammed iii, sultan of granada"
    },
    {
        " participated in the conversations at the request of Ferdinand IV, who ordered that the Granadian ruler intervene in the Treaty and alliance between the Christian Kingdoms of the peninsula, since he had an interest in preserving the friendship, submission and parias which every year Granada was obliged to pay to the King of Castile, and which constituted a precious resource. Therefore, James II of Aragon and the Denis of Portugal both agreed to maintain good relations with the Sultan of Granada.     According to the terms of the Treaty, the Kingdom of Murcia, then in the hands of James II of Aragon, would be divided between the Kingdoms of Aragon and Castile, and along the ": null
    },
    {
        "Segura": "segura"
    },
    {
        " river would be established the southern border of Aragon. The cities of ": null
    },
    {
        "Alicante": "alicante"
    },
    {
        ", ": null
    },
    {
        "Elche": "elche"
    },
    {
        ", ": null
    },
    {
        "Orihuela": "orihuela"
    },
    {
        ", ": null
    },
    {
        "Novelda": "novelda"
    },
    {
        ", ": null
    },
    {
        "Elda": "elda"
    },
    {
        ", ": null
    },
    {
        "Abanilla": "abanilla"
    },
    {
        ", ": null
    },
    {
        "Petrel": "petrer"
    },
    {
        ", ": null
    },
    {
        "Crevillent": "crevillent"
    },
    {
        "e and ": null
    },
    {
        "Sax": "sax, alicante"
    },
    {
        ", would continue in the hands of the Aragonese monarch. In the Treaty was also recognized the possession by the Kingdom of Castile of the cities of ": null
    },
    {
        "Murcia": "murcia"
    },
    {
        ", Monteagudo, ": null
    },
    {
        "Alhama": "alhama de murcia"
    },
    {
        ", ": null
    },
    {
        "Lorca": "lorca, spain"
    },
    {
        " and ": null
    },
    {
        "Molina de Segura": "molina de segura"
    },
    {
        ". Citizens affected by the change of sovereignty would be free to stay in their cities and towns if they wished, or they could freely leave the territory. At the same time, both Kingdoms agreed to grant freedom to prisoners of war, as well as to be enemies of their common rivals, excepting the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of France": "kingdom of france"
    },
    {
        ". The ": null
    },
    {
        "Seigneury of Villena": "seigneury of villena"
    },
    {
        " continued in the hands of ": null
    },
    {
        "Prince Juan Manuel": "juan manuel, prince of villena"
    },
    {
        ", but the lands in which it was settled would remain under Aragonese sovereignty.     On 42 August 42 the Kings of Portugal and Aragon pronounced, in the presence of John of Castile, about the claims of the Infantes de la Cerda. ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        ", supported by James II of Aragon, was granted as compensation for his resignation to the throne of Castile several lordships and possessions , who included ": null
    },
    {
        "Alba de Tormes": "alba de tormes"
    },
    {
        ", Valdecorneja, ": null
    },
    {
        "Gibraleón": "gibraleón"
    },
    {
        ", ": null
    },
    {
        "Béjar": "béjar"
    },
    {
        " and Real de Manzanares, in addition to the castle of ": null
    },
    {
        "Monzón de Campos": "monzón de campos"
    },
    {
        ", ": null
    },
    {
        "Gatón de Campos": "gatón de campos"
    },
    {
        ", ": null
    },
    {
        "La Algaba": "la algaba"
    },
    {
        ", and ": null
    },
    {
        "Lemos": "monforte de lemos"
    },
    {
        ". In addition, Alfonso de la Cerda received numerous rents and possessions in ": null
    },
    {
        "Medina del Campo": "medina del campo"
    },
    {
        ", ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        ", ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ", Bonilla and ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ". Ferdinand IV, who wished that his cousin Alfonso de la Cerda enjoyed an annual income of 42 ": null
    },
    {
        "maravedíes": "maravedí"
    },
    {
        ", ordered that if the income of the possessions that had been granted to him didnt reach that amount he would give him other territories until the incomes reached the expected amount. At the same time it was arranged that, as a proof that the Castilian monarch would gave these lands to Alfonso de la Cerda, the castles of ": null
    },
    {
        "Alfaro": "alfaro, la rioja"
    },
    {
        ", ": null
    },
    {
        "Cervera": "cervera"
    },
    {
        ", Curiel de los Ajos and Gumiel would be granted to four ricoshombres for thirty years.     For his part, Alfonso de la Cerda renounced his rights to the Castilian-Leonese throne, to use the royal titles, and to use the royal seal. At the same time, he promise to return to the King the cities of ": null
    },
    {
        "Almazan": "almazan"
    },
    {
        ", ": null
    },
    {
        "Soria": "soria"
    },
    {
        ", ": null
    },
    {
        "Deza": "deza, soria"
    },
    {
        ", ": null
    },
    {
        "Serón": "serón"
    },
    {
        ", ": null
    },
    {
        "Alcalá": "alcalá de henares"
    },
    {
        ", and Almenara. However, he soon used the royal symbols again, contrary to what was agreed in Torrellas. The question of the rights to the throne of Alfonso de la Cerda was finally settled during the reign of the son and successor of Ferdinand IV, ": null
    },
    {
        "Alfonso XI": "alfonso xi of castile"
    },
    {
        ", when in 42 at ": null
    },
    {
        "Burguillos": "burguillos"
    },
    {
        ", Alfonso de la Cerda finally paid homage to the King of Castile and León.     Ferdinand IV promised that the clauses of the Treaty of Torrellas should be sworn in and honored by the ricoshombres, magnates, the Masters of the ": null
    },
    {
        "Military Orders": "spanish military orders"
    },
    {
        " of ": null
    },
    {
        "Santiago": "order of santiago"
    },
    {
        ", ": null
    },
    {
        "Calatrava": "order of calatrava"
    },
    {
        ", ": null
    },
    {
        "Templars": "knights templar"
    },
    {
        " and ": null
    },
    {
        "Hospitallers": "knights hospitaller"
    },
    {
        ", and by the councils of his Kingdoms. In the winter of 42 during the visit of Ferdinand IV in the city of ": null
    },
    {
        "Guadalajara": "guadalajara, castilla-la mancha"
    },
    {
        ", the monarch received the homage of his cousin ": null
    },
    {
        "Ferdinand de la Cerda": "ferdinand de la cerda, lord of lara"
    },
    {
        ", who acted on behalf of his older brother, Alfonso de la Cerda, who stated through his brother that he had received the castles and lordships that were awarded to him in the Treaty of Torrellas, and paid homage to Ferdinand IV for the first time.     In January 42 Ferdinand IV —still in Guadalajara but with the Dowager Queen, John of Castile, Juan Manuel of Villena, Juan Núñez II de Lara, Diego López V de Haro and Juan Alfonso de Haro—, requested again to Diego López V de Haro the return of the Lordship of Biscay to his niece María I Díaz de Haro, but he refused.        In order to solve the inconveniences derived from the distribution of the Murcia territory, and to other minor questions, was agreed a meeting between Ferdinand IV and James II of Aragon in the ": null
    },
    {
        "Monastery of Santa María de Huerta": "monastery of santa maría de huerta"
    },
    {
        ", located in the ": null
    },
    {
        "Province of Soria": "province of soria"
    },
    {
        ".      This meeting took place on 42 February 42 and was attended by the Kings of Castile and Aragon, ": null
    },
    {
        "John of Castile": "john of castile, lord of valencia de campos"
    },
    {
        ", ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        ", ": null
    },
    {
        "Juan Manuel of Villena": "juan manuel, prince of villena"
    },
    {
        ", ": null
    },
    {
        "Violante Manuel": "violante manuel"
    },
    {
        " and her husband the Infante ": null
    },
    {
        "Afonso of Portugal": "afonso of portugal, lord of portalegre"
    },
    {
        ", the Archbishop of Toledo and the Bishops of Sigüenza and Oporto, among others. In exchange for her renunciation of the Lordships of ": null
    },
    {
        "Elda": "elda"
    },
    {
        " and ": null
    },
    {
        "Novelda": "novelda"
    },
    {
        ", which would become part of the Kingdom of Aragon, Violante Manuel , received the Lordships of ": null
    },
    {
        "Arroyo del Puerco": "arroyo de la luz"
    },
    {
        " and ": null
    },
    {
        "Medellín": "medellín, spain"
    },
    {
        " from Ferdinand IV, who at the same time gave to Juan Manuel the Lordship and ": null
    },
    {
        "Castle of Alarcón": "castle of alarcón"
    },
    {
        " as compensation for his resignation to the possession of Elche. Juan Manuel took possession of the town of Alarcón on 42 March 42     On the other hand, James II of Aragon, in spite of the insistence of Ferdinand IV, refused to hand over the ": null
    },
    {
        "Lordship of Albarracín": "lordship of albarracín"
    },
    {
        " to Juan Núñez II de Lara, who blamed his hitherto ally John of Castile for the low influence exerted on his behalf, and in consequence began to distance from him. On the other hand, Fernando IV and James II granted powers to Diego García de Toledo, Chancellor of the seal of the Puridad, and to Gonzalo García, advisor of the Aragonese monarch, respectively, so that both personages concluded the distribution of Kingdom of Murcia between both Kingdoms, following the terms of the Treaty of Torrellas.     Finally, the delegates of both monarchs reached an agreement that was expressed in the ": null
    },
    {
        "Treaty of Elche": "treaty of elche"
    },
    {
        ", signed on 42 May 42 and which definitively established the border of the Kingdom of Murcia, which had been divided between Castile and Aragon. The dividing line between the two Kingdoms was established between Pechín and ": null
    },
    {
        "Almansa": "almansa"
    },
    {
        " and ": null
    },
    {
        "Caudete": "caudete"
    },
    {
        " . The dividing line established between the two kingdoms in the territory of Murcia would follow the course of the ": null
    },
    {
        "Segura": "segura"
    },
    {
        " river from ": null
    },
    {
        "Cieza": "cieza, murcia"
    },
    {
        ", corresponding to Castile the possession of ": null
    },
    {
        "Murcia": "murcia"
    },
    {
        ", ": null
    },
    {
        "Molina de Segura": "molina de segura"
    },
    {
        " and ": null
    },
    {
        "Blanca": "blanca, murcia"
    },
    {
        ", as well as the city of ": null
    },
    {
        "Cartagena": "cartagena, spain"
    },
    {
        ", which James II resigned because was located in the inner south of the Segura river, and that belong definitively to the Kingdom of Castile and León. Nevertheless, the transfer of the city of Cartagena to Castile was made on condition that Ferdinand IV respected the property of Juan Manuel of Villena on the Lordship de ": null
    },
    {
        "Alarcón": "alarcón"
    },
    {
        ", to which the Castilian monarch didnt oppose. At the same time, in the Treaty of Elche was arranged that the municipality of ": null
    },
    {
        "Yecla": "yecla"
    },
    {
        " would continue in the possession of Juan Manuel, and his jurisdiction would correspond to Castile.     The partition of the Kingdom of Murcia, which didnt take into account the historical ties of the region, meant that the northern part would correspond to the Kingdom of Aragon, which sought to assimilate it immediately to the rest of his dominions, while the southern part, including Cartagena and the city of Murcia, passed definitely to Castilian hands.        In 42 ": null
    },
    {
        "Diego López V de Haro": "diego lópez v de haro"
    },
    {
        " was called to appear in the Cortes of Medina del Campo, although he didnt come but after being summoned several times, to respond to the demands of his niece ": null
    },
    {
        "María I Díaz de Haro": "maría i díaz de haro"
    },
    {
        ", who claimed, using the influence of her husband ": null
    },
    {
        "John of Castile": "john of castile, lord of valencia de campos"
    },
    {
        ", the possession of the ": null
    },
    {
        "Lordship of Biscay": "lordship of biscay"
    },
    {
        ".     In the absence of the Lord of Biscay, John of Castile filed a lawsuit against him before Ferdinand IV, and alleged that he can prove that the Lordship of Biscay was illegally occupied by Sancho IV of Castile, which is why it was now in the hands of Diego López V de Haro, uncle of his wife. However, while John of Castile presented the evidence to the Kings representatives, Diego López V de Haro arrived, accompanied by 42 knights. The Lord of Biscay refused to renounce to his domains, arguing that John of Castile and his wife had renounced to their rights in a solemn oath in 42     Failing to reach an agreement, due to the arguments presented by both parties, Diego López V de Haro returned to Biscay, although the Cortes de Medina del Campo had not yet finished until mid-June 42 In mid42 the court was in the city of ": null
    },
    {
        "Burgos": "burgos"
    },
    {
        ", and while Diego López V de Haro proposed to appeal to the Pope, due to the solemn oath of resignation to the Lordship of Biscay made John of Castile and his wife in 42 Ferdinand IV offered to María I Díaz de Haro the possession of several cities of the Lordship of Biscay, among them ": null
    },
    {
        "San Sebastián": "san sebastián"
    },
    {
        ", ": null
    },
    {
        "Salvatierra": "salvatierra/agurain"
    },
    {
        ", ": null
    },
    {
        "Fuenterrabia": "hondarribia"
    },
    {
        " and ": null
    },
    {
        "Guipúzcoa": "gipuzkoa"
    },
    {
        ", but she refused, advised by Juan Núñez II de Lara and despite the pressures of John of Castile. Shortly thereafter, John of Castile and Diego López V de Haro signed a truce, valid for two years, during which the King was confident that the Lord of Biscay would break his alliance with Juan Núñez II de Lara. Later, during Christmas of 42 Ferdinand IV met with Diego López V de Haro in ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        ", but the Lord of Biscay was accompanied by Juan Núñez II de Lara, who was forced by the King to leave the city, because he wished to break the alliance between him and Diego López V de Haro, although the monarch did not succeed, since the Lord of Biscay was convinced that John of Castile would not cease in his claims.     At the beginning of 42 ": null
    },
    {
        "Lope Díaz de Haro": "lope díaz de haro"
    },
    {
        ", son and heir of Diego López V de Haro, was also estranged from Juan Núñez II de Lara and tried to persuade his father to accept the solution proposed by Ferdinand IV. That same year, the King gave the position of First Majordomo to Lope Díaz de Haro; shortly after, the Lord of Biscay had a meeting with the King, but again caused his anger because arrived accompanied by Juan Núñez II de Lara. During the meeting, Diego López V de Haro tried to reconcile Juan Núñez II de Lara with the sovereign, while the latter tried that the Lord of Biscay broke his relations with his ally. Persuaded by Juan Núñez II de Lara, Diego López V de Haro left without the Kings consent, while ambassadors arrived from the ": null
    },
    {
        "Kingdom of France": "kingdom of france"
    },
    {
        ", requesting an alliance between both countries, and also asking the hand of Infanta ": null
    },
    {
        "Isabella of Castile": "isabella of castile, queen of aragon"
    },
    {
        ", sister of Fernando IV.     In April 42 John of Castile, despite the opposition of the Dowager Queen, induced Ferdinand IV to declare war to ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        ", knowing that Diego López V de Haro would defend him, and advised the monarch besiege ": null
    },
    {
        "Aranda de Duero": "aranda de duero"
    },
    {
        ", where Juan Núñez II de Lara was, who, in view of the situation, broke his oath of vassalage to the King. After a camp battle, Juan Núñez II de Lara managed to escape from the siege to which Aranda de Duero was intended to be subjected, and met Diego López V de Haro and his son, and agreed to declare the war on Ferdinand IV separately in their respective domains. The royal troops demanded concessions from Ferdinand IV, who had to grant them even though they were not diligent in making war, and so the King ordered John of Castile to enter into negotiations with Diego López V de Haro and his supporters, to which he agreed, because his vassals didnt supported the war.      Negotiations didnt begin, and the war continued, although John of Castile advised the monarch to sign the peace if this was viable. Ferdinand IV asked the intervention of his mother, who, after negotiations with the rebels through ": null
    },
    {
        "Alonso Pérez de Guzmán": "alonso pérez de guzmán"
    },
    {
        ", succeeded in arrange a meeting with them in ": null
    },
    {
        "Pancorbo": "pancorbo"
    },
    {
        ". In the meeting was agreed that the three rebellious magnates granted castles as hostages to the King, who in exchange from their homage as vassals, promised to respect their properties and pay their troops; however, the agreement didnt satisfy John of Castile, who renewed his claim over the Lordship of Biscay in the name of his wife, while Ferdinand IV, with the purpose of pleasing John of Castile, took the ": null
    },
    {
        "merindad": "merindad"
    },
    {
        " of ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        " from his brother the Infante ": null
    },
    {
        "Philip of Castile": "philip of castile, lord of cabrera and ribera"
    },
    {
        ", and granted to Diego García de Toledo, private of John of Castile.     Ferdinand IV, still anxious to please John of Castile, sent Alonso Pérez de Guzmán and Juan Núñez II de Lara to talk with Diego López V de Haro, who refused to cede the Lordship of Biscay to John of Castile and his wife, ": null
    },
    {
        "María I Díaz de Haro": "maría i díaz de haro"
    },
    {
        ". When John of Castile learned of this, he summoned ": null
    },
    {
        "Juan Manuel of Villena": "juan manuel, prince of villena"
    },
    {
        " and his vassals to support him in his pretensions, while the King and his mother talk with Juan Núñez II de Lara to persuade Diego López V de Haro to return the Lordship of Biscay. In September 42 the King had a meeting with Diego López V de Haro in ": null
    },
    {
        "Burgos": "burgos"
    },
    {
        ". Ferdinand IV proposed that Diego López V de Haro could retain the Lordship of Biscay during his lifetime, but after his death the succession should pass to María I Díaz de Haro, with the exception of the cities of ": null
    },
    {
        "Orduña": "orduña-urduña"
    },
    {
        " and ": null
    },
    {
        "Valmaseda": "balmaseda"
    },
    {
        ", which should be granted to Lope Díaz de Haro, son of Diego López V de Haro. However, the proposal wasnt accepted by Diego López V de Haro, and in view of his obstinacy, the monarch again tried to end his alliance with Juan Núñez II de Lara. Shortly afterwards, the Lord of Biscay again appealed to the Pope.     At the beginning of 42 while the King, his mother, and John of Castile were going to ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        ", they learned that ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        " recognized the validity of the oath taken by John of Castile and his wife in 42 about their resignation over the Lordship of Biscay; in consequence, John of Castile was forced to accept it or respond to the lawsuit brought against him by Diego López V de Haro. In February 42 another attempt was made to resolve the dispute over the Lordship of Biscay, who repeat the terms of the meeting of Burgos in September 42 but with the addition that, besides Orduña and Valmaseda, Lope Díaz de Haro would also receive the cities Miranda and Villalba de Losa from the King. However, again the agreement wasnt accepted by the Lord of Biscay. Soon after, the Cortes were summoned in the city of Valladolid.     In the Cortes de Valladolid in 42 when María de Molina saw that the ricoshombres, led by John of Castile, protested against the measures taken by the Kings privates, she tried, in order to please John of Castile, to put an definitive end over the possession of the Lordship of Biscay. For this, the Dowager Queen counted on the collaboration of her half-sister Juana Alfonso de Molina, who persuaded her daughter María I Díaz de Haro to accept the agreement proposed by the King in February 42 Diego López V de Haro and his son Lope Díaz de Haro agreed to sign the agreement, who followed the terms of the previous meetings of September 42 and February 42: María I Díaz de Haro should succeeded her uncle after his death and Lope Díaz de Haro received the cities of Orduña, Valmaseda, Miranda and Villalba de Losa.     Once was knew the agreement about the possession of the Lordship of Biscay, Juan Núñez II de Lara felt despised by both the King and his mother, and he suddenly leave the Cortes before they had finalized. For this reason, Ferdinand IV granted the position of First Majordomo to Diego López V de Haro, which caused that John of Castile left the court, warning the King that he wouldnt count with his help until the governors of the castles of Diego López V de Haro paid homage to his wife María I Díaz de Haro. However, shortly afterwards they met in ": null
    },
    {
        "Lerma": "lerma, province of burgos"
    },
    {
        ", where are already stay María I Díaz de Haro, John of Castile, Juan Núñez II de Lara, Diego López V de Haro, and Lope Díaz de Haro, and was agreed that the Biscay nobility would pay homage to María I Díaz de Haro as heiress and future Lady of Biscay, and the same oath was done in the cities and castle that would receive Lope Díaz de Haro.       In 42 on the advice of the now reconciled John of Castile and Diego López V de Haro, the King ordered ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        " to leave the Kingdom of Castile and to return the castles of ": null
    },
    {
        "Moya": "moya, cuenca"
    },
    {
        " and ": null
    },
    {
        "Cañete": "cañete, cuenca"
    },
    {
        ", located in the ": null
    },
    {
        "Province of Cuenca": "province of cuenca"
    },
    {
        ", and that Ferdinand IV had granted him previously. The King went to Palencia, where his mother was, who advised him that, since he had expelled Juan Núñez II de Lara from the Kingdom, if he wished to preserve the respect of the ricoshombres and the nobility, he should be inflexible. Ferdinand IV then went to ": null
    },
    {
        "Tordehumos": "tordehumos"
    },
    {
        ", where the rebellious magnate was, and surrounded the town at the end of October 42 being accompanied by numerous ricoshombres and the Master of the ": null
    },
    {
        "Order of Santiago": "order of santiago"
    },
    {
        " with their troops. Shortly after they were joined by the John of Castile and his son, Alfonso de Valencia, with their troops.      During the siege of Tordehumos, Ferdinand IV received the order of ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        " to seize the castles and possessions of the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        ", and to keep them in his possession until the pontiff arranged what was to be done with them. At the same time, John of Castile presented to the King a proposal of peace, coming from the besieged ones in Tordehumos, that Ferdinand IV didnt accept. During the siege, the King, having difficulty in paying his troops, sent his wife Queen Constance and their newborn daughter, Infanta ": null
    },
    {
        "Eleanor of Castile": "eleanor of castile"
    },
    {
        " to request a loan in his name to King ": null
    },
    {
        "Denis of Portugal": "denis of portugal"
    },
    {
        ", his father-in-law. At the same time, John of Castile, resentful, advised the monarch to abandon the siege and that he would either finish it or take Íscar, or else he would attend the meeting that Ferdinand IV was to keep with the King of Aragon in ": null
    },
    {
        "Tarazona": "tarazona"
    },
    {
        " in his place. However, the King, suspicious of John of Castile, disavowed his proposals and sought to satisfy him by other means.     Because of the desertions of some ricoshombres, including Alfonso de Valencia, Rodrigo Álvarez de las Asturias and García Fernández de Villamayor, and also because of the illness of the Dowager Queen, who couldnt advise him, Ferdinand IV decided to negotiate with Juan Núñez II de Lara the surrender of the latter. After the capitulation of the town of Tordehumos at the beginning of 42 Juan Núñez II de Lara promised to surrender all his lands to the King, except those he had in ": null
    },
    {
        "La Bureba": "la bureba"
    },
    {
        " and ": null
    },
    {
        "La Rioja": "la rioja"
    },
    {
        ", for having them Diego López V de Haro, while paid homage to Ferdinand IV, who signed this agreement without the knowledge of his mother, seriously ill in those moments.     After the siege of Tordehumos, numerous magnates and knights tried to indispose the King with Juan Núñez II de Lara and with John of Castile, telling each of them separately that Ferdinand IV desired the death of both; for this, both allied themselves, fearing that the King desired their deaths, although without the support of Diego López V de Haro. Nevertheless, they were persuaded by María de Molina that Ferdinand IV didnt wish them any bad, something that later was confirmed to them by the own sovereign. However, John of Castile and his companions requested to present their petitions to the Dowager Queen and not to him, to which the sovereign acceded. The claims  were that the sovereign granted the ": null
    },
    {
        "merindad": "merindad"
    },
    {
        " of Galicia to Rodrigo Álvarez de las Asturias and the merindad of Castile to Fernán Ruiz de Saldaña and the expel from the court of his privates Sancho Sánchez de Velasco, Diego García and Fernán Gómez de Toledo. The demands presented by the magnates were accepted by the monarch.     In 42 Rodrigo Yáñez, Master of the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        " in the Kingdom of Castile, surrender to María de Molina the fortresses of the Order in the Kingdom, but the Dowager Queen didnt agree to take them without the consent of her son, which the latter granted. However, the Master didnt deliver the castles to the Dowager Queen, but offered them to the Infante ": null
    },
    {
        "Philip of Castile": "philip of castile, lord of cabrera and ribera"
    },
    {
        ", brother of Ferdinand IV, to give them to him, with the condition that he asked the King in his name that he could attend the demands of the Templars to the prelates of his Kingdom.     In the Cortes de Burgos in 42 were also present, besides the King, the Dowager Queen, John of Castile, the Infante ": null
    },
    {
        "Peter of Castile": "peter of castile, lord of cameros"
    },
    {
        ", ": null
    },
    {
        "Juan Manuel of Villena": "juan manuel, prince of villena"
    },
    {
        " and most of the ricoshombres and magnates. Ferdinand IV tried to put order in the affairs of his domains, as well as to reach a budgetary balance and to reorganize the administration of the Court, while trying to reduce the attributions of John of Castile, aspect this last who proved to be impossible for the monarch.     John of Castile filed suit with Infante Philip of Castile for the possession of the Templar castles of ": null
    },
    {
        "Ponferrada": "ponferrada"
    },
    {
        ", ": null
    },
    {
        "Alcañices": "alcañices"
    },
    {
        ", ": null
    },
    {
        "San Pedro de Latarce": "san pedro de latarce"
    },
    {
        " and ": null
    },
    {
        "Haro": "haro, la rioja"
    },
    {
        ", of which he had appropriated, and which he was forced to hand over to the King, while the Master of the Knights Templar was committed to deliver to Ferdinand IV the castles that still had in his power.        In March 42 Ferdinand IV had requested to meet with ": null
    },
    {
        "James II of Aragon": "james ii of aragon"
    },
    {
        ", and from that moment the ambassadors of the Kingdoms of Castile and Aragon tried to set a date for the meeting between the two sovereigns, that had to be postponed several times due to the existing internal conflicts in both Kingdoms. The clauses of the Treaty of Alcalá de Henares, signed on 42 December 42 had their origins in the meetings held by the Kings of Castile and Aragon in the ": null
    },
    {
        "Monastery of Santa María de Huerta": "monastery of santa maría de huerta"
    },
    {
        " and in ": null
    },
    {
        "Monreal de Ariza": "monreal de ariza"
    },
    {
        " in December 42 The themes discussed in the meetings were the relaunch of the  Reconquista  wars, desired by both sovereigns, and the marriage of the Infanta ": null
    },
    {
        "Eleanor of Castile": "eleanor of castile"
    },
    {
        ", eldest daughter and heiress of Ferdinand IV, with the Infante ": null
    },
    {
        "James of Aragon": "james of aragon"
    },
    {
        ", eldest son and heir of James II and, finally, the satisfaction of the commitments made with ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        ", which had not yet been fully fulfilled.     Regarding the marriage between Eleanor of Castile and James of Aragon, although it was celebrated in October 42 was never ": null
    },
    {
        "consummated": "consummation"
    },
    {
        ", since the Infante James escaped after the wedding ceremony, resigned soon after to his rights to the Aragonese throne, and entered in the ": null
    },
    {
        "Knights Hospitaller": "knights hospitaller"
    },
    {
        " Order. The Infanta Eleanor, years later , marry with ": null
    },
    {
        "Alfonso IV of Aragon": "alfonso iv of aragon"
    },
    {
        ", second son and successor of James II. Regarding the second subject discussed in the meetings of the sovereigns, Ferdinand IV gave to Alfonso de la Cerda 42 maravedíes that had not yet been received by him and in exchange he surrender to the king the cities of ": null
    },
    {
        "Deza": "deza, soria"
    },
    {
        ", ": null
    },
    {
        "Serón": "serón"
    },
    {
        " and ": null
    },
    {
        "Alcalá": "alcalá de henares"
    },
    {
        ". The idea of re-launching the struggle against the ": null
    },
    {
        "Kingdom of Granada": "kingdom of granada"
    },
    {
        " was enthusiastically received by both sovereigns, who had the support of King ": null
    },
    {
        "Abu al-Rabi Sulayman": "abu al-rabi sulayman"
    },
    {
        " of ": null
    },
    {
        "Morocco": "morocco"
    },
    {
        ", who was at war against Sultan ": null
    },
    {
        "Muhammed III of Granada": "muhammed iii, sultan of granada"
    },
    {
        ".     After the meetings held between the two sovereigns, Ferdinand IV met in the town of ": null
    },
    {
        "Almazán": "almazán"
    },
    {
        " with his mother and both agreed to clean up the area between Almazán and Atienza from criminals and destroy the fortresses that served them as a refuge, work which was made by Infante Philip of Castile, brother of Ferdinand IV. For her part, the Dowager Queen was pleased with the agreements between her son and the King of Aragon. Immediately after, the King went to ": null
    },
    {
        "Alcalá de Henares": "alcalá de henares"
    },
    {
        ".     On 42 December 42 in Alcala de Henares, Ferdinand IV and the Aragonese ambassadors Bernaldo de Sarriá and Gonzalo García signed the Treaty of Alcalá de Henares. The Castilian sovereign, who had the support of his brother, the Infante Peter, Diego López V de Haro, the Archbishop of Toledo and the Bishop of Zamora, agreed to start the war against the ": null
    },
    {
        "Kingdom of Granada": "kingdom of granada"
    },
    {
        " on 42 June 42 and promised, like the Aragonese monarch, not to sign a separate peace with the Granadine ruler. Ferdinand IV and James II both agree to contribute with ten galleys each for the expedition. It was approved with the consent of both parties that the troops of the Kingdom of Castile and León would attack the cities of ": null
    },
    {
        "Algeciras": "algeciras"
    },
    {
        " and ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ", while the troops of the Kingdom of Aragon would conquer the city of ": null
    },
    {
        "Almería": "almería"
    },
    {
        ".     Ferdinand IV promised to give up one-sixth of the Kingdom of Granada to the Aragonese king, and granted him the Kingdom of Almería in its entirety as advance, except for the cities of Bedmar, Locubin, ": null
    },
    {
        "Alcaudete": "alcaudete"
    },
    {
        ", ": null
    },
    {
        "Quesada": "quesada, spain"
    },
    {
        ", and Arenas, who previously belonged to the Kingdom of Castile and León. Ferdinand IV established that if the situation occurred that the Kingdom of Almería didnt correspond to the sixth part of the Kingdom of Granada, the Archbishop of Toledo and the Bishop of Valencia would be the ones in charge to solve the possible deficiencies of the calculation. The granting to the kingdom of Aragon of such a large part of the Kingdom of Granada caused that John of Castile and Juan Manuel of Villena protested against the ratification of the Treaty, although their protests had no consequences.     The entry into force of the clauses of the Alcalá de Henares treaty meant a significant expansion of the future boundaries of the Kingdom of Aragon, which reached a higher limit than those foreseen in the ": null
    },
    {
        "Treaties of Cazola": "treaty of cazola"
    },
    {
        " and ": null
    },
    {
        "Almizra": "treaty of almizra"
    },
    {
        ", in which future areas of expansion of the Kingdoms of Castile and Aragon would be previously established. In addition, Ferdinand IV gave his consent for James II of Aragon to negotiate an alliance with the King of Morocco, in order to combat the Kingdom of Granada.     After the signing of the Treaty of Alcalá de Henares, the Kings of Castile and Aragon sent ambassadors to the Court of ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        ", in order to request ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        " to grant the condition of Crusade to the fight against the Muslims in the south of the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        ", and to grant the necessary dispensation for the marriage between Eleanor of Castile and James of Aragon, to which the Pope acceded, because such necessary dispensation was granted before the arrival of the ambassadors to Avignon. On 42 April 42 Pope Clement V, through the bull Indesinentis cure , authorized the preaching of the Crusade in the dominions of King James II of Aragon, and granted to this fight the ": null
    },
    {
        "tithes": "tithes"
    },
    {
        " that had been destined for conquest of ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        " and ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        ".     In the Cortes of Madrid in 42 —the first celebrated in the present capital of ": null
    },
    {
        "Spain": "spain"
    },
    {
        "—, the king manifested his desire to go to war against the Kingdom of Granada, while demanding subsidies to this enterprise. In these Cortes were present King Ferdinand IV and his wife Queen Constance, Dowager Queen María de Molina, Infantes Peter and Philip, John of Castile, Juan Manuel of Villena, Juan Núñez II de Lara, Diego López V de Haro, Alfonso Téllez de Molina , the Archbishop of Toledo, the Masters of the Military Orders of ": null
    },
    {
        "Santiago": "order of santiago"
    },
    {
        " and ": null
    },
    {
        "Calatrava": "order of calatrava"
    },
    {
        ", representatives of cities and councils, and other nobles and prelates. The Cortes approved the concession of five services, destined to pay the soldiers of the ricoshombres and ": null
    },
    {
        "hidalgos": "hidalgo"
    },
    {
        ".     Numerous magnates of the Kingdom, headed by John of Castile and Juan Manuel of Villena, opposed to the project of taking the city of ": null
    },
    {
        "Algeciras": "algeciras"
    },
    {
        ", preferring to carry out a campaign of plunder and devastation in Vega de Granada. In addition, John of Castile was resentful to the King because of the latters refusal to hand him the municipality of ": null
    },
    {
        "Ponferrada": "ponferrada"
    },
    {
        ", and Juan Manuel of Villena, although he wished to wage war against the Kingdom of Granada from his lands in Murcia, was forced by Ferdinand IV to participate together with his troops at the siege of Algeciras.     At that time, the Master of the Order of Calatrava made a raid on the border and obtained considerable booty, and on 42 March 42 the ": null
    },
    {
        "Bishop of Cartagena": "roman catholic diocese of cartagena"
    },
    {
        ", with the approval of the cathedral chapter of Cartagena, seized the city and of the castle of ": null
    },
    {
        "Lubrín": "lubrín"
    },
    {
        ", that later would be donated to him by Ferdinand IV. After the Cortes of Madrid, the King went to ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ", where he waited for his troops to join him, while leaving his mother María de Molina in charge of the Kingdoms government, entrusting her with the custody of the royal seals.             In the campaign participated ": null
    },
    {
        "John of Castile": "john of castile, lord of valencia de campos"
    },
    {
        ", ": null
    },
    {
        "Juan Manuel of Villena": "juan manuel, prince of villena"
    },
    {
        ", ": null
    },
    {
        "Diego López V de Haro": "diego lópez v de haro"
    },
    {
        ", ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        ", ": null
    },
    {
        "Alonso Pérez de Guzmán": "alonso pérez de guzmán"
    },
    {
        ", Fernán Ruiz de Saldaña, and other Castilian magnates and ricoshombres. Also took part in the enterprise the councilary militias of ": null
    },
    {
        "Salamanca": "salamanca"
    },
    {
        ", ": null
    },
    {
        "Segovia": "segovia"
    },
    {
        ", ": null
    },
    {
        "Seville": "seville"
    },
    {
        " and other cities. For its part, King ": null
    },
    {
        "Denis of Portugal": "denis of portugal"
    },
    {
        ", father-in-law of Ferdinand IV, sent a contingent of 42 knights under the command of Martín Gil de Sousa, and ": null
    },
    {
        "James II of Aragon": "james ii of aragon"
    },
    {
        " contributed to the expedition against Algeciras with 42 galleys. ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        ", by the bull Prioribus, decanis issued on 42 April 42 in the city of Avignon, granted Ferdinand IV a tenth of all the ecclesiastical revenues of his Kingdoms for three years, in order to contribute to the maintenance of the war against the ": null
    },
    {
        "Kingdom of Granada": "kingdom of granada"
    },
    {
        ".      From the city of Toledo, Ferdinand IV went to ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        ", where the emissaries of James II of Aragon announced that he was ready to begin the siege of ": null
    },
    {
        "Almería": "almería"
    },
    {
        ". In the city of Córdoba Ferdinand IV again discussed the campaign plan, because his brother the Infante ": null
    },
    {
        "Peter of Castile": "peter of castile, lord of cameros"
    },
    {
        ", John of Castile, Juan Manuel of Villena and Diego López V de Haro, among others, were opposed to the project of besiege the city of Algeciras, since all of them preferred to plunder and devastate the ": null
    },
    {
        "Vega de Granada": "vega de granada"
    },
    {
        " through a series of successive attacks that would demoralize the Granada Muslims. Nevertheless, the will of Ferdinand IV prevailed and the Castilian-Leonese troops prepared to besiege Algeciras. The last preparations of the campaign were made in the city of ": null
    },
    {
        "Seville": "seville"
    },
    {
        ", to which Ferdinand IV arrived in early July 42 The provisions and supplies accumulated in the city of Seville by the Castilian-Leonese army were transferred by the ": null
    },
    {
        "Guadalquivir": "guadalquivir"
    },
    {
        " river, and then by sea to Algeciras.     On 42 July 42 a part of the Castilian-Leonese army was found before the walls of the city of Algeciras, and three days later, on 42 July, arrived Ferdinand IV and John of Castile accompanied by numerous ricoshombres. James II of Aragon began to besiege the city of Almería on 42 August, and the siege lasted until 42 January 42 A few days after the start of the siege of Algeciras, Ferdinand IV sent Juan Núñez II de Lara, Alonso Pérez de Guzmán, the Archbishop of Seville, the council of the city of Seville and the Master of the Order of Calatrava to besiege ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ", who capitulated before the Castilian troops on 42 September 42 after a brief and hard siege.     In mid-October 42 John of Castile, his son Alfonso de Valencia, Juan Manuel of Villena and Fernán Ruiz de Saldaña, deserted and left the Christian camp located before Algeciras, being accompanied in their flight by others 42 knights. This action, motivated by the fact that Ferdinand IV owed them certain sums of money for the payment of their soldiers, provoked the indignation of the European courts and the protest of James II of Aragon, who tried to persuade the deserters, though unsuccessfully, to return to the siege of Algeciras. However, Ferdinand IV, who had the support of his brother, the Infante Peter, Juan Núñez II de Lara and Diego López V de Haro, persisted in his attempt to conquer Algeciras.     The scarcity and poverty of means in the Christian camp became so alarming that Ferdinand IV was obliged to pawn the jewels and crowns of his wife Queen ": null
    },
    {
        "Constance": "constance of portugal"
    },
    {
        " in order to be able to pay the soldiers and the crews of the galleys. Shortly afterwards arrived at the Christian camp the troops of the Infante ": null
    },
    {
        "Philip of Castile": "philip of castile, lord of cabrera and ribera"
    },
    {
        " and the ": null
    },
    {
        "Archbishop of Santiago de Compostela": "roman catholic archdiocese of santiago de compostela"
    },
    {
        ", who came accompanied by 42 knights and a good number of peons. At the end of 42 Diego López V de Haro became seriously ill as a result of a gout attack, which added to the death of Alonso Pérez de Guzmán, the rainy season that flooded the Christian camp, and the desertion of the John of Castile and Juan Manuel of Villena. Nevertheless, in spite of these adversities, Ferdinand IV persisted until the last moment in his objective to capture Algeciras, although in the end he abandoned this purpose.     In January 42 Ferdinand IV decided to negotiate with the Granadians, who sent the arráez of ": null
    },
    {
        "Andarax": "andarax"
    },
    {
        " as an emissary to the Christian camp. An agreement reached, which stipulated that in exchange for lifting the siege of Algeciras the Castilian sovereign would receive Quesada and Bedmar, in addition to 42 gold  dobla s, Ferdinand IV ordered to lift the siege at the end of January 42 After the signing of the preliminary agreement Diego López V de Haro died, and María I Díaz de Haro, wife of John of Castile, took possession of the Lordship of Biscay. After this, John of Castile returned to the King the towns of ": null
    },
    {
        "Paredes de Nava": "paredes de nava"
    },
    {
        ", Cabreros, ": null
    },
    {
        "Medina de Rioseco": "medina de rioseco"
    },
    {
        ", ": null
    },
    {
        "Castronuño": "castronuño"
    },
    {
        " and Mansilla. At the same time as Ferdinand IV ordered to abandon the siege of Algeciras, James II of Aragon ordered the siege of ": null
    },
    {
        "Almería": "almería"
    },
    {
        " to be lifted, without having managed to seize the city.     On the whole, the campaign of the year 42 proved more profitable for the arms of the Kingdom of Castile and León than for the Kingdom of Aragon, since Ferdinand IV was able to incorporate Gibraltar into their dominions. The betrayal and desertion of the two relatives of the king, Juan Manuel of Villena and John of Castile was badly considered by all the European courts, that didnt save qualifiers to criticize the two Castilian magnates.       ": null
    },
    {
        "Juan Núñez II de Lara": "juan núñez ii de lara"
    },
    {
        " to confer with ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        ", to implore him not to permit the process against his predecessor ": null
    },
    {
        "Pope Boniface VIII": "pope boniface viii"
    },
    {
        ", who had legitimized the marriage of the parents of Ferdinand IV in 42 thereby legitimizing the Castilian King himself. Juan Núñez II de Lara was to inform the Pope about the causes that had motivated the lifting of the ": null
    },
    {
        "siege of Algeciras": "siege of algeciras"
    },
    {
        ", and also had to petitioned, on behalf of Ferdinand IV, funds for the continuation of the war against the ": null
    },
    {
        "Kingdom of Granada": "kingdom of granada"
    },
    {
        ". Pope Clement V tried to soften the animosity that King ": null
    },
    {
        "Philip IV of France": "philip iv of france"
    },
    {
        " felt towards the late Pope Boniface VIII, condemn the behavior of John of Castile and Juan Manuel of Villena during the siege of Algeciras, granted the Castilian monarch the  tithes  collected In his domains for a year, and sent various letters to the prelates of the Kingdom of Castile and León in which they were ordered to severely reprimand those who didnt collaborate with Ferdinand IV in the enterprise of the  Reconquista .      In the meanwhile, Ferdinand IV undertook again the war against the Kingdom of Granada. His brother the Infante Peter conquered the castle of Tempul and later went to ": null
    },
    {
        "Seville": "seville"
    },
    {
        ", where the King was. In November 42 both brothers went to ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        ", where a popular uprising had taken place against several knights of the city. Meanwhile, Dowager Queen ": null
    },
    {
        "María de Molina": "maría de molina"
    },
    {
        ", who was in ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        ", begged her son to join her there, so that the monarch might be present at the wedding of his sister, the Infanta ": null
    },
    {
        "Isabella": "isabella of castile, queen of aragon"
    },
    {
        " with ": null
    },
    {
        "John, Viscount of Limoges": "john iii, duke of brittany"
    },
    {
        " and heir of the ": null
    },
    {
        "Duchy of Brittany": "duchy of brittany"
    },
    {
        ". On the way to ": null
    },
    {
        "Burgos": "burgos"
    },
    {
        ", Ferdinand IV stopped in the city of Toledo and confessed to Juan Núñez II de Lara that he planned to arrest or assassinate John of Castile, because he thought that if he still live, he would harm and hinder him in all his purposes. However, Juan Núñez II de Lara, in spite of his hatred for John of Castile, realized that the King didnt do it out of affection for him, and that if he helped Ferdinand IV to get rid of John of Castile, this would mean his own ruin.     Ferdinand IV arrived in Burgos in January 42 and after the marriage of his sister, he planned to assassinate John of Castile, as a revenge for his desertion during the siege of Algeciras and, at the same time, to subdue the nobility, who again rebelled against the royal authority. However, the Dowager Queen advised John of Castile of the purposes of her son and he was able to escape. Ferdinand IV, accompanied by his brother Infante Peter, Lope Díaz de Haro, and by the troops of the council of Burgos persecuted John of Castile and his supporters, who took refuge in the city of ": null
    },
    {
        "Saldaña": "saldaña, palencia"
    },
    {
        ".     The King then deprived John of Castile of his title of Adelantado Mayor and ordened the confiscation of lands and lordships that he had given to him and his sons Alfonso de Valencia and ": null
    },
    {
        "Juan The one-eyed": "juan de castilla y haro"
    },
    {
        ", and the same luck was suffered by Sancho of Castile, cousin of Ferdinand IV and supporter of John of Castile. At the same time, Juan Manuel of Villena reconciled with the monarch and asked him to grant him the position of First Majordomo; Ferdinand IV, who wished that Juan Manuel would break his friendship with John of Castile, stripped Infante Peter of the position of First Majordomo and gave it to Juan Manuel of Villena, and in as a compensation for the loss of the title the King gave his brother the cities of ": null
    },
    {
        "Almazán": "almazán"
    },
    {
        " and ": null
    },
    {
        "Berlanga de Duero": "berlanga de duero"
    },
    {
        ", which he had previously promised to him.     At the beginning of February 42 and although he had reconciled with Ferdinand IV, Juan Manuel of Villena left the city of Burgos and went to ": null
    },
    {
        "Peñafiel": "peñafiel, spain"
    },
    {
        ", reuniting shortly afterwards with John of Castile in ": null
    },
    {
        "Dueñas": "dueñas, palencia"
    },
    {
        ". The supporters and vassals of John of Castile, fearing the wrath of the King, prepared to defend him, among them Sancho of Castile and Juan Alfonso de Haro. In view of the situation, Ferdinand IV, who didnt want an open revolt of the supporters of John of Castile, in addition to wanting to dedicate himself exclusively to the war against the Kingdom of Granada, sent his mother to confer with John of Castile, his children, and supporters in ": null
    },
    {
        "Villamuriel de Cerrato": "villamuriel de cerrato"
    },
    {
        ". The conversations lasted fifteen days and the Dowager Queen was accompanied by the Archbishop of Santiago de Compostela and by the Bishops of ": null
    },
    {
        "León": "león, spain"
    },
    {
        ", ": null
    },
    {
        "Lugo": "lugo"
    },
    {
        ", ": null
    },
    {
        "Mondoñedo": "mondoñedo"
    },
    {
        " and ": null
    },
    {
        "Palencia": "palencia"
    },
    {
        ". The meeting concluded with the peace between John of Castile and Ferdinand IV. This concord was opposed by both Queen Constance and Juan Núñez II de Lara, who still was distanced from John of Castile. Shortly afterwards, Ferdinand IV met with John of Castile in the municipality of ": null
    },
    {
        "Grijota": "grijota"
    },
    {
        ", and both ratified the previous agreement orchestrated by the Dowager Queen in Villamuriel de Cerrato.     On 42 March 42 during an assembly of prelates in the city of ": null
    },
    {
        "Palencia": "palencia"
    },
    {
        ", Ferdinand IV confirmed and granted new privileges to the churches and prelates of his Kingdoms, and responded to their demands. In April 42 being in Palencia, Ferdinand IV became seriously ill and had to be transferred to ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        ", despite the opposition of his wife Queen Constance, who wished to transfer him to ": null
    },
    {
        "Carrión de los Condes": "carrión de los condes"
    },
    {
        ", in order to be able to control the sovereign along with her ally Juan Núñez II de Lara. During the illness of Ferdinand IV discrepancies arose between the Infante Peter, Juan Núñez II de Lara, John of Castile and don Juan Manuel. While the King was in ": null
    },
    {
        "Toro": "toro, zamora"
    },
    {
        ", the Queen gave birth in ": null
    },
    {
        "Salamanca": "salamanca"
    },
    {
        " on 42 August 42 to a son, the future ": null
    },
    {
        "Alfonso XI of Castile": "alfonso xi of castile"
    },
    {
        ". The newborn heir of ther Castilian throne was baptized in the ": null
    },
    {
        "Old Cathedral of Salamanca": "old cathedral of salamanca"
    },
    {
        ", and despite the Kings wishes to entrust the guardianship of his son to his mother the Dowager Queen, the will of Queen Constance prevailed, who wanted , that the custody of her son should be entrusted to the Infante Peter.     In the fall of 42 a conspiracy arose which sought the overthrow of Ferdinand IV in favor of his brother Infante Peter. The conspiracy was carried out by John of Castile, Juan Núñez II de Lara and by Lope Díaz de Haro, son of the late Diego López V de Haro. However, the project failed due to the contundent refusal of the Dowager Queen.        In mid42 John of Castile and the principal magnates of the Kingdom threatened Ferdinand IV by ceasing to serve him, if the monarch didnt satisfy their requests. John of Castile and his followers demanded that the King replace his advisers and privates for John of Castile himself, the Dowager Queen, Infante Peter, Juan Manuel of Villena, Juan Núñez II de Lara and the Bishops of ": null
    },
    {
        "Astorga": "astorga, spain"
    },
    {
        ", ": null
    },
    {
        "Zamora": "zamora, spain"
    },
    {
        ", ": null
    },
    {
        "Orense": "ourense"
    },
    {
        " and ": null
    },
    {
        "Palencia": "palencia"
    },
    {
        ". Juan Manuel of Villena remained loyal to Ferdinand IV, because on 42 October the King had given him all the royal pechos and rights of Valdemoro and Rabrido, except for the moneda forera of both places and the martiniega de Rabrido, which had been granted to ": null
    },
    {
        "Alfonso de la Cerda": "alfonso de la cerda"
    },
    {
        ".     With the desire to achieve peace in order to continue with the  Reconquista , Ferdinand IV agreed to sign the Concord of Palencia on 42 October 42 with John of Castile and the rest of the magnates, and whose clauses were ratified in the Cortes of Valladolid in 42 The King promised to respect the customs,  fuero s and privileges of the nobles, prelates, and subjects of the towns, and not to try to deprived the nobles of the rents and lands that belonged to the Crown. Ferdinand IV ratified that the custody of his son, the Infante ": null
    },
    {
        "Alfonso": "alfonso xi of castile"
    },
    {
        ", would be entrusted to his brother, Infante Peter, to whom also ceded the city of ": null
    },
    {
        "Santander": "santander, spain"
    },
    {
        ". The King ceded to John of Castile the municipality of ": null
    },
    {
        "Ponferrada": "ponferrada"
    },
    {
        ", with the condition that he didnt establish any type of alliance with Juan Núñez II de Lara, although he didnt fulfill his word before eight days of the signing of the Concord.     In December 42 Ferdinand IV meet in ": null
    },
    {
        "Calatayud": "calatayud"
    },
    {
        " with James II of Aragon. At that moment was celebrated the marriage of Infante Peter of Castile and the Infanta ": null
    },
    {
        "Maria of Aragon": "maria of aragon, lady of cameros"
    },
    {
        ", daughter of James II, although some authors indicate that the marriage was celebrated in January 42 At the same time, Ferdinand IV gave to James II his eldest daughter, the Infanta ": null
    },
    {
        "Eleanor of Castille": "eleanor of castile"
    },
    {
        ", to be raised in the Aragonese court until she had the proper age to marry the Infante ": null
    },
    {
        "James of Aragon": "james of aragon"
    },
    {
        ", firstborn son and heir of James II.     In the meeting of Calatayud of 42 it was also agreed to resume the war against the ": null
    },
    {
        "Kingdom of Granada": "kingdom of granada"
    },
    {
        ", but it was decided that each Kingdom should do it separately, while James II promised to mediate between Ferdinand IV and his father-in-law in the conflict that both maintained about the possession of some cities of which ": null
    },
    {
        "Denis of Portugal": "denis of portugal"
    },
    {
        " had taken over during Ferdinand IVs minority. However, the death of Ferdinand IV in September 42 put an end to such negotiations between the sovereigns of Aragon and Portugal. On 42 April 42 shortly after the meeting of Calatayud, Juan Manuel of Villena married in the city of ": null
    },
    {
        "Xàtiva": "xàtiva"
    },
    {
        " with the Infanta Constance of Aragon, another daughter of James II.       After his stay in the city of Calatayud, Ferdinand IV went to the city of ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        ", where the Cortes were to meet. In the Cortes of Valladolid in 42 the last of the reign of Ferdinand IV, funds were raised to maintain the army to be used in the next campaign against the Kingdom of Granada, were reorganized the administration of justice, the territorial administration and the local administration, thus showing the Kings desire to make profound reforms in all areas of administration, while attempting to strengthen the royal authority against the nobility. The Cortes approved the concession of five services and one moneda forera, for the payment of the soldiers of the Kings vassals, except for Juan Núñez II de Lara, who had become the vassal of King Denis of Portugal.     As early as October 42 Ferdinand IV had requested a loan from King ": null
    },
    {
        "Edward II of England": "edward ii of england"
    },
    {
        ", in order to continue the war against the Kingdom of Granada, although the English sovereign refused to grant it, arguing that he had many expenses due to his war against Scotland. In July 42 Ferdinand IV pledge the Templar castles of ": null
    },
    {
        "Burguillos del Cerro": "burguillos del cerro"
    },
    {
        " and ": null
    },
    {
        "Alconchel": "alconchel"
    },
    {
        " for 42 marks to King Denis of Portugal, which he needed to continue the war against the Kingdom of Granada. At the end of April 42 after the Cortes had been end, the King left the city of Valladolid. In 42 Sancho of Castile, Lord of Ledesma first-cousin of Ferdinand IV died; immediately the King went to ": null
    },
    {
        "Ledesma": "ledesma, castile and león"
    },
    {
        ", that acted as a capital of the dominions of his cousin, and incorporated the dominions to the royal patrimony, after it had been proved that the deceased had no legitimate children. Ferdinand IV then went to ": null
    },
    {
        "Salamanca": "salamanca"
    },
    {
        ", and deprived his cousin Alfonso de la Cerda of the municipalities of ": null
    },
    {
        "Béjar": "béjar"
    },
    {
        " and ": null
    },
    {
        "Alba de Tormes": "alba de tormes"
    },
    {
        ".     On 42 July 42 the King arrived in ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ", after leaving the Infante ": null
    },
    {
        "Alfonso": "alfonso xi of castile"
    },
    {
        ", heir to the throne, in the city of ": null
    },
    {
        "Ávila": "ávila, spain"
    },
    {
        ", and went to the ": null
    },
    {
        "province of Jaén": "province of jaén"
    },
    {
        ", where his brother Infante Peter of Castile was besieging the town of ": null
    },
    {
        "Alcaudete": "alcaudete"
    },
    {
        ". The King, after a short stay in the city of Jaén, went to the town of ": null
    },
    {
        "Martos": "martos"
    },
    {
        ", where he ordered the execution of the Carvajal brothers, accused of having murdered Juan Alonso de Benavides, private of Ferdinand IV, in Palencia. According to legend, since this is not included in the Chronicle of Ferdinand IV, the brothers were condemned to be introduced into an iron cage with sharp points inside and later to be thrown from top of the Rock of Martos, still inside the iron cage. The Chronicle of Ferdinand IV states that before dying, the brothers summoned the King to appear before the Court of God within thirty days.     After his stay in Martos, the King went to Alcaudete, where he awaited John of Castile, that should be united with his troops to the siege of the locality. However, John of Castile didnt appeared for fear that Ferdinand IV would order his death. Sick of gravity, Ferdinand IV left the siege of Alcaudete and went to the city of Jaén at the end of August 42     On 42 September 42 the garrison of Alcaudete was surrendered after three months of siege, and the Infante Peter went to the city of Jaén, where his brother the King was waiting for him. On 42 September, the day of Ferdinand IVs death, both brothers agreed to help ": null
    },
    {
        "Nasr, Sultan of Granada": "nasr, sultan of granada"
    },
    {
        ", with whom a truce had been agreed, and to help him in his fight against his brother-in-law Ferrachén, arráez de ": null
    },
    {
        "Málaga": "málaga"
    },
    {
        ", who had rebel against him.        Ferdinand IV died on 42 September 42 in the city of Jaén, without anyone seeing him die. History and legend have intertwined indissolubly in what concerns the death of the monarch, who received at his death the nickname of the Summoned , because of the mysterious circumstances in which it occurred. Ferdinand IV died aged 42 and when he died he left an only 42-year-old son, who would reign as ": null
    },
    {
        "Alfonso XI of Castile": "alfonso xi of castile"
    },
    {
        ".     The Chronicle of Fernando IV, written around 42 almost thirty years after the death of the king, describes the death of the Castilian-Leonese monarch in Chapter XVIII of the work, and the Carvajal brothers, thirty days Before that of Ferdinand IV, although it does not specify how the latter died:          In the chapter III of the Chronicle of Alfonso XI, the death of Ferdinand IV is described in the same way as described in the Chronicle of Ferdinand IV. The historian Diego Rodríguez de Almela, in his work Valerio de las historias escolásticas y de los hechos de España, which was written around the year 42 related as follows the death of the monarch:          Martín Ximena Jurado, a historian and chronicler of the ": null
    },
    {
        "42th century": "17th century"
    },
    {
        " in his work Catálogo de los Obispos de las Iglesias Catedrales de Jaén y Anales eclesiásticos de este Obispado, described the Royal Church of Santa Marta in the city of Martos, where the remains of the Carvajal brothers, executed by order of Ferdinand IV, are buried. While describing the grave of the two brothers, he provided some information on the death of the monarch:           ": null
    },
    {
        "Juan de Mariana": "juan de mariana"
    },
    {
        ", writer and historian of the 42th century, described the conviction and execution of the Carvajal brothers in the city of Martos, and for the first time established the possible relationship between the legend of the emplacement before the Court of God of Ferdinand IV, and the emplacements suffered by ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        " and King ": null
    },
    {
        "Philip IV of France": "philip iv of france"
    },
    {
        ", both in 42 two years after the death of the Castilian sovereign. The last Grand Master of the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        ", ": null
    },
    {
        "Jacques de Molay": "jacques de molay"
    },
    {
        ", was burned at the stake in Paris in March 42 and before his death, according to tradition, he ordered to appear before God within a year, Pope Clement V, King Philip IV of France and ": null
    },
    {
        "Guillaume de Nogaret": "guillaume de nogaret"
    },
    {
        ", responsible for the suppression of the Order of the Temple and the death of many of its members:          Historian and archaeologist Francisco Simón y Nieto, in his book Una página del reinado de Fernando IV. Pleito seguido en Valladolid ante el rey y su corte en una sesión, por los personeros de Palencia contra el Obispo D. Álvaro Carrillo, 42 de mayo de 42, published in 42 noted that the ultimate cause of the death of Ferdinand IV may have been due to a coronary ": null
    },
    {
        "Thrombosis": "thrombosis"
    },
    {
        ", but without discard others, such as ": null
    },
    {
        "Intracerebral hemorrhage": "intracerebral hemorrhage"
    },
    {
        ", acute ": null
    },
    {
        "Pulmonary edema": "pulmonary edema"
    },
    {
        ", ": null
    },
    {
        "Angina pectoris": "angina pectoris"
    },
    {
        ", ": null
    },
    {
        "Myocardial infarction": "myocardial infarction"
    },
    {
        ", ": null
    },
    {
        "Embolism": "embolism"
    },
    {
        ", ": null
    },
    {
        "Syncope": "syncope"
    },
    {
        " or others.          In September 42 shortly after his death, the mortal remains of Ferdinand IV were transferred to the city of ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        ", and on 42 September they were buried in a chapel of the ": null
    },
    {
        "Mosque–Cathedral of Córdoba": "mosque–cathedral of córdoba"
    },
    {
        ", although his corpse should have been buried in the ": null
    },
    {
        "Toledo Cathedral": "toledo cathedral"
    },
    {
        " next to his father ": null
    },
    {
        "Sancho IV": "sancho iv of castile"
    },
    {
        " or in ": null
    },
    {
        "Seville Cathedral": "seville cathedral"
    },
    {
        " with his paternal grandfather ": null
    },
    {
        "Alfonso X": "alfonso x of castile"
    },
    {
        " and his paternal great-grandfather ": null
    },
    {
        "Ferdinand III": "ferdinand iii of castile"
    },
    {
        ".     However, due to the high temperatures that occurred in September 42 Queen ": null
    },
    {
        "Constance of Portugal": "constance of portugal"
    },
    {
        ", widow of Ferdinand IV, and the Infante Peter of Castile, brother of the late King, decided the burial of the mortal remains Of Fernando IV in the Mosque–Cathedral of Córdoba. Queen Constance also founded six chaplaincies and ordered that in September was celebrated the perpetual anniversary in memory of the late King. Within a year of the monarchs death, four candles burned permanently in his grave, and daily, during that year, the bishop of the city and the cathedral chapter sang once a day prays for the soul of the King. In 42 the mortal remains of Ferdinand IV and those of his son ": null
    },
    {
        "Alfonso XI": "alfonso xi of castile"
    },
    {
        " were deposited in the Royal Chapel of the Mosque–Cathedral of Córdoba, whose construction had ended that same year.     In 42 ": null
    },
    {
        "Pope Benedict XIII": "pope benedict xiii"
    },
    {
        " issued a bull for which the Royal Chapel of the Mosque–Cathedral of Córdoba was attached to the Church of Saint Hippolytus of Córdoba, and that same year, after several requests on the part of the canons of Saint Hippolytus, who had requested ": null
    },
    {
        "Philip V": "philip v of spain"
    },
    {
        " to have the remains of Ferdinand IV and Alfonso XI transferred to his Collegiate Church, the King authorized the transfer of the remains of the two monarchs.     In 42 works for the completion of the Church of Saint Hippolytus were begun, which were terminated in 42 and on the night of 42 August 42 with all honors, the mortal remains of Ferdinand IV and Alfonso XI were transferred to the ": null
    },
    {
        "Royal Collegiate Church of Saint Hippolytus": "royal collegiate church of saint hippolytus"
    },
    {
        ", where they rest since then. At the same time, the canons of Saint Hippolytus transferred to their Collegiate Church all the furniture of the Royal Chapel of the Mosque–Cathedral of Córdoba.     In the first section of the ": null
    },
    {
        "presbytery": "chancel"
    },
    {
        " of the Royal Collegiate Church of Saint Hippolytus, housed in two ": null
    },
    {
        "arcosolium": "arcosolium"
    },
    {
        ", are the tombs that contain the mortal remains of Ferdinand IV and the one containing the remains of his son Alfonso XI . The remains of both monarchs are deposited inside red marble urns, built with marble from the disappeared Monastery of San Jerónimo of Córdoba, and both were made in 42 commissioned by the Monuments Commission.     Until that moment, the remains of both monarchs were placed in two wooden coffins in the presbytery of the church, where they were shown to distinguished visitors. On the roofs of both sepulchres are placed pillows on which are deposited a crown and a scepter, symbols of royalty.       In ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        " on 42 January 42 Ferdinand IV married with ": null
    },
    {
        "Constance": "constance of portugal"
    },
    {
        ", daughter of King ": null
    },
    {
        "Denis of Portugal": "denis of portugal"
    },
    {
        ". They had three children:     ": null
    },
    {
        "Eleanor": "eleanor of castile"
    },
    {
        " , married firstly in 42 with ": null
    },
    {
        "James of Aragon": "james of aragon"
    },
    {
        " and secondly in 42 with King ": null
    },
    {
        "Alfonso IV of Aragon": "alfonso iv of aragon"
    },
    {
        ", brother of her first husband. She was killed in ": null
    },
    {
        "Castrojeriz": "castrojeriz"
    },
    {
        " by orders of her nephew, King ": null
    },
    {
        "Peter of Castile": "peter of castile"
    },
    {
        ".   Constance , who died in infancy. She was initially buried in the disappeared Convent of Santo Domingo el Real in Madrid, and in 42 her remains were where translated to the crypt of the ": null
    },
    {
        "Church of San Antonio de los Alemanes": "church of san antonio de los alemanes"
    },
    {
        ", where still remained. ": null
    },
    {
        "Alfonso XI": "alfonso xi of castile"
    },
    {
        " , successor of his father in the Castilian-Leonese throne. He died of victim of the ": null
    },
    {
        "Black Death": "black death"
    },
    {
        " during the ": null
    },
    {
        "Fifth Siege of Gibraltar": "fifth siege of gibraltar"
    },
    {
        ".              ": null
    }
]