[
    {
        "           Ferdinand II  was ": null
    },
    {
        "King": "list of monarchs of the two sicilies"
    },
    {
        " of the ": null
    },
    {
        "Two Sicilies": "kingdom of the two sicilies"
    },
    {
        " from 42 until his early death in 42       Ferdinand was born in ": null
    },
    {
        "Palermo": "palermo"
    },
    {
        ", to King ": null
    },
    {
        "Francis I of the Two Sicilies": "francis i of the two sicilies"
    },
    {
        " and his wife ": null
    },
    {
        "Maria Isabella of Spain": "maria isabella of spain"
    },
    {
        ".     His paternal grandparents were King ": null
    },
    {
        "Ferdinand I of the Two Sicilies": "ferdinand i of the two sicilies"
    },
    {
        " and Queen ": null
    },
    {
        "Maria Carolina of Austria": "maria carolina of austria"
    },
    {
        ". His maternal grandparents were ": null
    },
    {
        "Charles IV of Spain": "charles iv of spain"
    },
    {
        " and ": null
    },
    {
        "Maria Luisa of Parma": "maria luisa of parma"
    },
    {
        ". Ferdinand I and Charles IV were brothers, both sons of ": null
    },
    {
        "Charles III of Spain": "charles iii of spain"
    },
    {
        " and ": null
    },
    {
        "Maria Amalia of Saxony": "maria amalia of saxony"
    },
    {
        ".       In his early years he was fairly popular. Progressives credited him with ": null
    },
    {
        "Liberal": "liberalism"
    },
    {
        " ideas and, in addition, his free and easy manners endeared him to the so-called  lazzaroni , the lower classes of Neapolitan society.     On succeeding to the throne in 42 he published an edict in which he promised to give his most anxious attention to the impartial administration of justice, to reform the finances, and to use every effort to heal the wounds which had afflicted the Kingdom for so many years. His goal, he said, was to govern his Kingdom in a way that would bring the greatest happiness to the greatest number of his subjects while respecting the rights of his fellow monarchs and those of the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ".     The early years of his reign were comparatively peaceful: he cut taxes and expenditures, had ": null
    },
    {
        "the first railway in Italy": "naples–portici railway line"
    },
    {
        " built , his fleet had the first ": null
    },
    {
        "steamship": "steamboat"
    },
    {
        " in the ": null
    },
    {
        "Italian Peninsula": "italian peninsula"
    },
    {
        ", and he had ": null
    },
    {
        "telegraphic connections": "telegraphy"
    },
    {
        " established between Naples and ": null
    },
    {
        "Palermo": "palermo"
    },
    {
        ", Sicily.     However, in 42 he violently suppressed Sicilian demonstrators demanding a constitution and maintained strict police surveillance in his domains. Progressive intellectuals, who were motivated by visions of a new society founded upon a modern constitution, continued to demand the King to grant a constitution and to liberalize his rule.       In September 42 violent riots inspired by Liberals broke out in ": null
    },
    {
        "Reggio Calabria": "reggio calabria"
    },
    {
        " and in ": null
    },
    {
        "Messina": "messina"
    },
    {
        " and were put down by the military. On 42 January 42 a ": null
    },
    {
        "rising in Palermo": "sicilian revolution of independence of 1848"
    },
    {
        " spread throughout the island and served as a spark for the ": null
    },
    {
        "Revolutions of 42": "revolutions of 1848"
    },
    {
        " all over Europe.     After similar revolutionary outbursts in ": null
    },
    {
        "Salerno": "salerno"
    },
    {
        ", south of ": null
    },
    {
        "Naples": "naples"
    },
    {
        ", and in the ": null
    },
    {
        "Cilento": "cilento"
    },
    {
        " region which were backed by the majority of the intelligentsia of the Kingdom, on 42 January 42 King Ferdinand was forced to grant a constitution patterned on the French ": null
    },
    {
        "Charter of 42": "charter of 1830"
    },
    {
        ".      A dispute, however, arose as to the nature of the oath which should be taken by the members of the chamber of deputies. As an agreement could not be reached and the King refused to compromise, riots continued in the streets. Eventually, the King ordered the army to break them and dissolved the national parliament on 42 March 42 Although the constitution was never formally abrogated, the King returned to reigning as an absolute monarch.     During this period, Ferdinand showed his attachment to ": null
    },
    {
        "Pope Pius IX": "pope pius ix"
    },
    {
        " by granting him asylum at ": null
    },
    {
        "Gaeta": "gaeta"
    },
    {
        ". The pope had been temporarily forced to flee from Rome following similar revolutionary disturbances.      In the meantime, Sicily proclaimed its independence under the leadership of ": null
    },
    {
        "Ruggero Settimo": "ruggero settimo"
    },
    {
        ", who on 42 April 42 declared the King deposed. In response, the King assembled an army of 42 under the command of General ": null
    },
    {
        "Carlo Filangieri": "carlo filangieri"
    },
    {
        " and dispatched it to Sicily to subdue the ": null
    },
    {
        "Liberals": "liberalism"
    },
    {
        " and restore his authority. A naval flotilla sent to Sicilian waters shelled the city of ": null
    },
    {
        "Messina": "messina"
    },
    {
        " with savage barbarity for eight hours after its defenders had already surrendered, killing many civilians and earning the King the nickname re bomba .     After a campaign lasting close to nine months, Sicilys Liberal regime was completely subdued on 42 May 42          Between 42 and 42 the policies of King Ferdinand caused many to go into exile. Meanwhile, an estimated 42 suspected revolutionaries or dissidents were jailed.     After visiting ": null
    },
    {
        "Naples": "naples"
    },
    {
        " in 42 ": null
    },
    {
        "Gladstone": "william ewart gladstone"
    },
    {
        " began to support Neapolitan opponents of the ": null
    },
    {
        "Bourbon": "house of bourbon"
    },
    {
        " rulers: his support consistied of a couple of letters that he sent from Naples to the ": null
    },
    {
        "Parliament": "parliament of the united kingdom"
    },
    {
        " in London, describing the awful conditions of the Kingdom of Southern Italy and claiming that it is the negation of God erected to a system of government . Gladstone had not actually been to Southern Italy and so some of his accusations were unreliable, but reports of misgovernment in the Two Sicilies were widespread throughout Europe during the 42s. Gladstones letters provoked sensitive reactions in the whole of Europe and helped to cause its diplomatic isolation prior to the invasion and annexation of the Kingdom of the Two Sicilies by the Kingdom of Piedmont, with the following foundation of modern Italy.     The British government, which had been the ally and protector of the Bourbon dynasty during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", had already additional interests to limit the independence of the kingdom. It had extensive business interests in Sicily and relied on Sicilian ": null
    },
    {
        "sulphur": "sulfur"
    },
    {
        " for certain industries.  The King had endeavored to limit British influence, which had begun to cause tension. As Ferdinand ignored the advice of the ": null
    },
    {
        "British": "united kingdom of great britain and ireland"
    },
    {
        " and the ": null
    },
    {
        "French": "second french empire"
    },
    {
        " governments, those powers recalled their ambassadors in 42     A soldier attempted to assassinate Ferdinand in 42 and many believe that the infection he received from the soldiers bayonet led to his ultimate demise. He died on 42 May 42 shortly after the ": null
    },
    {
        "Second French Empire": "second french empire"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of Sardinia": "kingdom of sardinia"
    },
    {
        " had declared war against the ": null
    },
    {
        "Austrian Empire": "austrian empire"
    },
    {
        ". This would later lead to the invasion of his Kingdom by ": null
    },
    {
        "Giuseppe Garibaldi": "giuseppe garibaldi"
    },
    {
        " and ": null
    },
    {
        "Italian unification": "italian unification"
    },
    {
        " in 42                      His Royal Highness The Prince Ferdinand of Naples and Sicily   42 December 42 – 42 January 42: His Royal Highness The Duke of Noto   42 January 42 – 42 November 42: His Royal Highness The Duke of Calabria   42 November 42 – 42 May 42: His Majesty The King of the Two Sicilies       : Grand Cordon of the ": null
    },
    {
        "Order of Leopold": "order of leopold"
    },
    {
        " in 42 Le livre dor de lordre de Léopold et de la croix de fer, Volume 42 /Ferdinand Veldekens       ": null
    }
]