[
    {
        "        Ferdinand Peroutka was a Czech journalist and writer. A prominent political thinker and journalist during the ": null
    },
    {
        "First Czechoslovak Republic": "first czechoslovak republic"
    },
    {
        ", Peroutka was persecuted by the ": null
    },
    {
        "Nazi": "nazi germany"
    },
    {
        " regime for his democratic convictions and imprisoned at ": null
    },
    {
        "Buchenwald concentration camp": "buchenwald concentration camp"
    },
    {
        ". Following the ": null
    },
    {
        "42 coup": "1948 czechoslovak coup détat"
    },
    {
        " by the ": null
    },
    {
        "Communist Party of Czechoslovakia": "communist party of czechoslovakia"
    },
    {
        ", he emigrated to both the United Kingdom and, later, the United States.       Peroutka was born to a Czech-German family in ": null
    },
    {
        "Prague": "prague"
    },
    {
        " in 42 In 42 he began his career as a journalist. After World War I, he became an editor-in-chief of a new newspaper Tribuna . Some articles published in Tribuna were later incorporated into books Z deníku žurnalistova and above all Jací jsme —in this book Peroutka mapped some myths about the Czech nation.     In 42 Peroutka passed from Tribuna to  Lidové noviny  and founded—thanks to ": null
    },
    {
        "Tomáš Masaryk": "tomáš masaryk"
    },
    {
        "s donation—revue  Přítomnost  . As a commentator he became very influential, standing on the position of the Castle and criticizing both communists and the Right represented by the national-democratic party of the first Czechoslovak prime minister ": null
    },
    {
        "Karel Kramář": "karel kramář"
    },
    {
        ". Peroutka expressed his political and other opinions also in several books: Boje o dnešek , Ano a ne , Budování státu and Osobnost, chaos a zlozvyky . As a representative of the Czech democratic tradition, Peroutka was arrested after the outbreak of World War II in 42 and held in the ": null
    },
    {
        "Buchenwald": "buchenwald"
    },
    {
        " concentration camp until 42 He was offered freedom on the condition that he would serve as editor of a collaborationist Přítomnost; he refused and spent the whole of the war in Buchenwald.     After liberation, Peroutka became an editor-in-chief of the newspaper Svobodné noviny and refounded his famous revue Přítomnost under the name Dnešek . The journal became prominent through its critical stance on postwar violence committed on the German minority and hundreds of alleged collaborators. Nonetheless it also fit the general pattern of the time by hosting illusory views of the Communist party underestimating its totalitarian pretensions. Peroutka wrote two dramas: Oblak a valčík and Štastlivec Sula . Political articles Peroutka issued in the book Tak nebo tak . The ": null
    },
    {
        "42 Czechoslovak coup détat": "1948 czechoslovak coup détat"
    },
    {
        " caused Peroutka to decide to emigrate. In 42 he became a director of the Czech division of the ": null
    },
    {
        "Radio Free Europe": "radio free europe"
    },
    {
        ". The summa of his democratic life views was issued in 42 as Democratic Manifesto.     Peroutka also became a novelist in exile. He re-wrote his drama to the novel of the same name. The second novel, Pozdější život Panny , deals with the idea of the rescue of ": null
    },
    {
        "Joan of Arc": "jeanne darc"
    },
    {
        ". Peroutkas last drama was named Kdybych se ještě jednou narodil .        are available at the Hoover Institution Archives                                           ": null
    }
]