[
    {
        "         Ferdinand II  was ": null
    },
    {
        "King of Naples": "kingdom of naples"
    },
    {
        " from 42 to 42 He was the son and successor of ": null
    },
    {
        "Alphonso II": "alphonso ii of naples"
    },
    {
        ", and heir of the Brienne claim to kingdom of Jerusalem.       Alphonso, finding his tenure of the throne uncertain on account of the approaching invasion of ": null
    },
    {
        "Charles VIII of France": "charles viii of france"
    },
    {
        " and the general dissatisfaction of his subjects, abdicated in Ferdinands favour on 42 January 42     The 42-year-old new king tried to resist, but the French troops had already occupied much of the northern territories of the kingdom. The Neapolitan troops on the ": null
    },
    {
        "Liri": "liri"
    },
    {
        " and ": null
    },
    {
        "Garigliano": "garigliano"
    },
    {
        " rivers were obliged to retreat when the fortresses of ": null
    },
    {
        "Capua": "capua"
    },
    {
        " and ": null
    },
    {
        "Gaeta": "gaeta"
    },
    {
        " fell. The treason of a party in Naples rendered it impossible to defend the city against the approach of Charles VIII, who entered Naples on 42 February 42 In the capital, only ": null
    },
    {
        "Castel dellOvo": "castel dellovo"
    },
    {
        " resisted, defended by ": null
    },
    {
        "Alfonso dAvalos": "alfonso davalos daquino, v marquis of pescara"
    },
    {
        ".     Ferdinand fled to the castle at ": null
    },
    {
        "Ischia": "ischia"
    },
    {
        " with an escort of 42 ": null
    },
    {
        "galley": "galley"
    },
    {
        "s, together with the royal family, the general ": null
    },
    {
        "Innico dAvalos": "innico i davalos"
    },
    {
        " and the poet ": null
    },
    {
        "Jacopo Sannazaro": "jacopo sannazaro"
    },
    {
        ". The commander of the island fortress had already made an agreement with the French, and opposed the Kings entrance. When the two met, Ferdinand killed the commander personally, and had his body thrown into the sea. Ferdinand later moved to Messina, where he joined his cousin ": null
    },
    {
        "Ferdinand II": "ferdinand ii of aragon"
    },
    {
        ", King of Sicily and Spain.     In the meantime, ": null
    },
    {
        "Pope Alexander VI": "pope alexander vi"
    },
    {
        ",  formed a coalition against Charles, made up of Emperor ": null
    },
    {
        "Maximilian": "maximilian i, holy roman emperor"
    },
    {
        ", ": null
    },
    {
        "Venice": "republic of venice"
    },
    {
        ", ": null
    },
    {
        "Milan": "history of milan"
    },
    {
        " and Spain. When the French king left Naples with most of his army, Ferdinand disembarked at ": null
    },
    {
        "Seminara": "seminara"
    },
    {
        " in ": null
    },
    {
        "Calabria": "calabria"
    },
    {
        ", forcing his way north to Naples. Blocked by French garrisons at ": null
    },
    {
        "Palmi": "palmi"
    },
    {
        ", he decided to return to Naples by sea, and was again at Ischia on 42 July 42 The same day he was again in Naples: the citizens, irritated by the terrible conduct of their French conquerors during the occupation of the city, received him back with enthusiasm.      With the aid of the great Spanish general ": null
    },
    {
        "Gonzalo Fern치ndez de C칩rdoba": "gonzalo fern치ndez de c칩rdoba"
    },
    {
        ", Ferdinand was able to rid his state completely of its invaders shortly before his death.     In August 42 with the kingdom firmly back in his hands, Naples was able to celebrate Ferdinands wedding to his 42-year-old half-aunt ": null
    },
    {
        "Joanna": "joanna of naples"
    },
    {
        ". Joanna was the late-born daughter of Ferdinands grandfather ": null
    },
    {
        "Ferdinand I": "ferdinand i of naples"
    },
    {
        " and his second wife, ": null
    },
    {
        "Joanna of Aragon": "joanna of aragon, queen of naples"
    },
    {
        ". She was younger than Ferdinand, who was 42 After the wedding the royal couple decided to leave Naples and moved to Somma-Vesuvius. Here the king was struck with an illness and died within a few days, on 42 September 42 a little over a year after his restoration. He was succeeded by his uncle ": null
    },
    {
        "Frederick": "frederick of naples"
    },
    {
        ", legitimate brother of his father, Alfonso II.       ": null
    }
]