[
    {
        "The Festa do Peão de Barretos  is a ": null
    },
    {
        "rodeo": "rodeo"
    },
    {
        " featuring ": null
    },
    {
        "bull": "bull"
    },
    {
        "s and ": null
    },
    {
        "horse": "horse"
    },
    {
        "s. In Barretos, Brazil hundreds such festivals are held throughout the year. The Festa do Peão is one of the most famous such festivals, and has become world-famous for its size. The festival is held every year in the ": null
    },
    {
        "São Paulo ": "são paulo"
    },
    {
        " city of ": null
    },
    {
        "Barretos": "barretos"
    },
    {
        ", where it has traditionally been organized and promoted by the social club Os Independentes .         The festival has its origins in the transfer of cattle from pasturing in the nearby states of ": null
    },
    {
        "Minas Gerais": "minas gerais"
    },
    {
        ", ": null
    },
    {
        "Goiás": "goiás"
    },
    {
        ", ": null
    },
    {
        "Mato Grosso do Sul": "mato grosso do sul"
    },
    {
        ", and ": null
    },
    {
        "Mato Grosso": "mato grosso"
    },
    {
        " to slaughterhouses in Barretos. The cowboys in the entourages that led the herds would meet in the afternoons and compete with each other to see who could ride the most spirited horses - the precursor to todays competition. The more difficult tradition of riding bulls instead of horses was brought from the United States.     In 42 in ": null
    },
    {
        "Barretos": "barretos"
    },
    {
        ", a group of ": null
    },
    {
        "bachelor": "bachelor"
    },
    {
        "s organized the first recorded Festa do Peão de Boiadeiro. Since that time the festival has become world-famous for its scale, and the high quality of cowboys, horses, and bulls. The festival takes place every August, coinciding with the anniversary of the founding of Barretos, August 42 It continues to be organized by The Independents.     42 was the 42th annual Festa. Until 42 the festivities took place in Paulo de Lima park, in the center of Barretos, where memorable expositions of cattle took place during the 42s through the 42s. Since 42 The Independents have held the event in a 42-hectare park with a ": null
    },
    {
        "stadium": "stadium"
    },
    {
        " large enough to hold 42 thousand people, designed by renowned Brazilian ": null
    },
    {
        "architect": "architect"
    },
    {
        " Oscar Niemeyer": "oscar niemeyer"
    },
    {
        ".         - Organizers home page                                      ": null
    }
]