[
    {
        "                  Fidel Alejandro Castro Ruz  was a Cuban ": null
    },
    {
        "communist": "communism"
    },
    {
        " revolutionary": "revolutionary"
    },
    {
        " and politician who governed the ": null
    },
    {
        "Republic of Cuba": "cuba"
    },
    {
        " as ": null
    },
    {
        "Prime Minister": "prime minister of cuba"
    },
    {
        " from 42 to 42 and then as ": null
    },
    {
        "President": "president of cuba"
    },
    {
        " from 42 to 42 A ": null
    },
    {
        "Marxist–Leninist": "marxism–leninism"
    },
    {
        " and Cuban nationalist, Castro also served as the ": null
    },
    {
        "First Secretary": "first secretary of the communist party of cuba"
    },
    {
        " of the ": null
    },
    {
        "Communist Party of Cuba": "communist party of cuba"
    },
    {
        " from 42 until 42 Under his administration, Cuba became a ": null
    },
    {
        "one-party": "one-party state"
    },
    {
        " communist state": "communist state"
    },
    {
        ", while industry and business were ": null
    },
    {
        "nationalized": "nationalization"
    },
    {
        " and ": null
    },
    {
        "state socialist": "state socialism"
    },
    {
        " policies were implemented throughout society.     Born in ": null
    },
    {
        "Birán": "birán"
    },
    {
        ", ": null
    },
    {
        "Oriente": "oriente province"
    },
    {
        " as the son of a wealthy Spanish farmer, Castro adopted leftist ": null
    },
    {
        "anti-imperialist": "anti-imperialism"
    },
    {
        " politics while studying law at the ": null
    },
    {
        "University of Havana": "university of havana"
    },
    {
        ". After participating in rebellions against right-wing governments in the ": null
    },
    {
        "Dominican Republic": "dominican republictrujillo age"
    },
    {
        " and ": null
    },
    {
        "Colombia": "la violencia"
    },
    {
        ", he planned the overthrow of Cuban President ": null
    },
    {
        "Fulgencio Batista": "fulgencio batista"
    },
    {
        ", launching a failed attack on the ": null
    },
    {
        "Moncada Barracks": "moncada barracks"
    },
    {
        " in 42 After a years imprisonment, Castro traveled to Mexico where he formed a revolutionary group, the ": null
    },
    {
        "42th of July Movement": "26th of july movement"
    },
    {
        ", with his brother ": null
    },
    {
        "Raúl Castro": "raúl castro"
    },
    {
        " and ": null
    },
    {
        "Che Guevara": "che guevara"
    },
    {
        ". Returning to Cuba, Castro took a key role in the ": null
    },
    {
        "Cuban Revolution": "cuban revolution"
    },
    {
        " by leading the Movement in a ": null
    },
    {
        "guerrilla war": "guerrilla warfare"
    },
    {
        " against Batistas forces from the ": null
    },
    {
        "Sierra Maestra": "sierra maestra"
    },
    {
        ". After Batistas overthrow in 42 Castro assumed military and political power as Cubas Prime Minister. The United States came to oppose Castros government and unsuccessfully attempted to remove him by ": null
    },
    {
        "assassination": "assassination attempts on fidel castro"
    },
    {
        ", ": null
    },
    {
        "economic blockade": "united states embargo against cuba"
    },
    {
        ", and counter-revolution, including the ": null
    },
    {
        "Bay of Pigs Invasion": "bay of pigs invasion"
    },
    {
        " of 42 Countering these threats, Castro aligned with the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and allowed the Soviets to place nuclear weapons in Cuba, sparking the ": null
    },
    {
        "Cuban Missile Crisis": "cuban missile crisis"
    },
    {
        "  – a defining incident of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        "  – in 42     Adopting a Marxist–Leninist model of development, Castro converted Cuba into a one-party, socialist state under Communist Party rule, the first in the ": null
    },
    {
        "Western Hemisphere": "western hemisphere"
    },
    {
        ". Policies introducing ": null
    },
    {
        "central economic planning": "economic planning"
    },
    {
        " and expanding ": null
    },
    {
        "healthcare": "healthcare in cuba"
    },
    {
        " and ": null
    },
    {
        "education": "education in cuba"
    },
    {
        " were accompanied by state control of the press and the suppression of internal dissent. Abroad, Castro supported anti-imperialist revolutionary groups, backing the establishment of ": null
    },
    {
        "Marxist": "marxism"
    },
    {
        " governments in ": null
    },
    {
        "Chile": "presidency of salvador allende"
    },
    {
        ", ": null
    },
    {
        "Nicaragua": "junta of national reconstruction"
    },
    {
        ", and ": null
    },
    {
        "Grenada": "peoples revolutionary government"
    },
    {
        ", as well as sending troops to aid allies in the ": null
    },
    {
        "Yom Kippur": "yom kippur war"
    },
    {
        ", ": null
    },
    {
        "Ogaden": "ogaden war"
    },
    {
        ", and ": null
    },
    {
        "Angolan Civil War": "angolan civil war"
    },
    {
        ". These actions, coupled with Castros leadership of the ": null
    },
    {
        "Non-Aligned Movement": "non-aligned movement"
    },
    {
        " from 42 to 42 and ": null
    },
    {
        "Cubas medical internationalism": "cuban medical internationalism"
    },
    {
        ", increased Cubas profile on the world stage. Following the ": null
    },
    {
        "Soviet Unions dissolution": "dissolution of the soviet union"
    },
    {
        " in 42 Castro led Cuba through the economic downturn of the ": null
    },
    {
        "Special Period": "special period"
    },
    {
        " , embracing environmentalist and ": null
    },
    {
        "anti-globalization": "anti-globalization movement"
    },
    {
        " ideas. In the 42s, Castro forged alliances in the Latin American ": null
    },
    {
        "pink tide": "pink tide"
    },
    {
        "  – namely with ": null
    },
    {
        "Hugo Chávez": "hugo chávez"
    },
    {
        "s ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        "  – and signed Cuba up to the ": null
    },
    {
        "Bolivarian Alliance for the Americas": "alba"
    },
    {
        ". In 42 Castro ": null
    },
    {
        "transferred his responsibilities": "2006–2008 cuban transfer of presidential duties"
    },
    {
        " to ": null
    },
    {
        "Vice President": "vice president of cuba"
    },
    {
        " Raúl Castro, who was elected to the presidency by the ": null
    },
    {
        "National Assembly": "national assembly of peoples power"
    },
    {
        " in 42     The longest-serving non-royal head of state in the 42th and 42st centuries, Castro polarized world opinion. His supporters view him as a champion of socialism and anti-imperialism whose revolutionary regime advanced economic and social justice while securing Cubas independence from ": null
    },
    {
        "American imperialism": "american imperialism"
    },
    {
        ". Critics view him as a dictator whose administration oversaw ": null
    },
    {
        "human-rights abuses": "human rights in cuba"
    },
    {
        ", ": null
    },
    {
        "the exodus of a large number of Cubans": "cuban exile"
    },
    {
        ", and the impoverishment of the countrys economy. Castro was decorated with ": null
    },
    {
        "various international awards": "list of awards and honours bestowed upon fidel castro"
    },
    {
        " and significantly influenced different individuals and groups across the world.              Castro was born out of wedlock at his fathers farm on 42 August 42 ; ; . His father, ": null
    },
    {
        "Ángel Castro y Argiz": "ángel castro y argiz"
    },
    {
        ", a veteran of the ": null
    },
    {
        "Spanish–American War": "spanish–american war"
    },
    {
        ",  . Public Broadcasting Service . 42 was a migrant to Cuba from ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        ", in the northwest of Spain. ; ; ; . He had become financially successful by growing sugar cane at Las Manacas farm in ": null
    },
    {
        "Birán": "birán"
    },
    {
        ", ": null
    },
    {
        "Oriente Province": "oriente province"
    },
    {
        ". ; ; ; . After the collapse of his first marriage he took his household servant, Lina Ruz González  – of ": null
    },
    {
        "Canarian": "canary islanders"
    },
    {
        " origin  – as his mistress and later second wife; together they had seven children, among them Fidel. ; ; . At age six, Castro was sent to live with his teacher in ": null
    },
    {
        "Santiago de Cuba": "santiago de cuba"
    },
    {
        ", ; ; . before being ": null
    },
    {
        "baptized": "baptism"
    },
    {
        " into the Roman Catholic Church at the age of eight. ; ; . Being baptized enabled Castro to attend the La Salle boarding school in Santiago, where he regularly misbehaved; he was next sent to the privately funded, ": null
    },
    {
        "Jesuit": "society of jesus"
    },
    {
        "-run Dolores School in Santiago. ; ; .        In 42 Castro transferred to the more prestigious Jesuit-run ": null
    },
    {
        "El Colegio de Belén": "instituto técnico militar"
    },
    {
        " in ": null
    },
    {
        "Havana": "havana"
    },
    {
        ". ; ; . Although Castro took an interest in history, geography, and debating at Belén, he did not excel academically, instead devoting much of his time to playing sports. ; ; .     In 42 Castro began studying law at the ": null
    },
    {
        "University of Havana": "university of havana"
    },
    {
        ". ; ; ; . Admitting he was politically illiterate , Castro became embroiled in student activism ; ; ; . and the ": null
    },
    {
        "violent gangsterismo culture": "ganggang violence"
    },
    {
        " within the university. ; ; . Passionate about ": null
    },
    {
        "anti-imperialism": "anti-imperialism"
    },
    {
        " and opposing ": null
    },
    {
        "U.S. intervention in the Caribbean": "banana wars"
    },
    {
        ", . he unsuccessfully campaigned for the presidency of the Federation of University Students on a platform of honesty, decency and justice . ; . Castro became critical of the corruption and violence of President ": null
    },
    {
        "Ramón Grau": "ramón grau"
    },
    {
        "s government, delivering a public speech on the subject in November 42 that received coverage on the front page of several newspapers. ; .     In 42 Castro joined the Party of the Cuban People , founded by veteran politician ": null
    },
    {
        "Eduardo Chibás": "eduardo chibás"
    },
    {
        ". A charismatic figure, Chibás advocated social justice, honest government, and political freedom, while his party exposed corruption and demanded reform. Though Chibás came third in the ": null
    },
    {
        "42 general election": "1948 cuban general election"
    },
    {
        ", Castro remained committed to working on his behalf. ; ; ; . Student violence escalated after Grau employed gang leaders as police officers, and Castro soon received a death threat urging him to leave the university. However, he refused to do so and began to carry a gun and surround himself with armed friends. ; . In later years, anti-Castro dissidents accused him of committing gang-related assassinations at the time, but these accusations remain unproven. ; ; ; .            In June 42 Castro learned of ": null
    },
    {
        "a planned expedition": "cayo confites expedition"
    },
    {
        " to overthrow the right-wing government of ": null
    },
    {
        "Rafael Trujillo": "rafael trujillo"
    },
    {
        ", a U.S. ally, in the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        ". ; . Being President of the University Committee for Democracy in the Dominican Republic, Castro joined the expedition. ; ; . The military force consisted of around 42 troops, mostly Cubans and exiled Dominicans, and they intended to sail from Cuba in July 42 Graus government stopped the invasion under U.S. pressure, although Castro and many of his comrades evaded arrest. Returning to Havana, Castro took a leading role in student protests against the killing of a high school pupil by government bodyguards. The protests, accompanied by a crackdown on those considered communists, led to violent clashes between activists and police in February 42 in which Castro was badly beaten. At this point, his public speeches took on a distinctly leftist slant by condemning social and economic inequality in Cuba. In contrast, his former public criticisms had centered on condemning corruption and U.S. imperialism.     In April 42 Castro traveled to ": null
    },
    {
        "Bogotá": "bogotá"
    },
    {
        ", ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ", leading a Cuban student group sponsored by President ": null
    },
    {
        "Juan Perón": "juan perón"
    },
    {
        "s Argentine government. There, the assassination of popular leftist leader ": null
    },
    {
        "Jorge Eliécer Gaitán Ayala": "jorge eliécer gaitán ayala"
    },
    {
        " led to widespread rioting and clashes between the governing ": null
    },
    {
        "Conservatives": "colombian conservative party"
    },
    {
        "  – backed by the army  – and leftist ": null
    },
    {
        "Liberals": "colombian liberal party"
    },
    {
        ". Castro joined the Liberal cause by stealing guns from a police station, but subsequent police investigations concluded that he had not been involved in any killings. ; ; ; . Returning to Cuba, Castro became a prominent figure in protests against government attempts to raise bus fares. ; . That year, he married ": null
    },
    {
        "Mirta Díaz Balart": "mirta diaz-balart"
    },
    {
        ", a student from a wealthy family, through whom he was exposed to the lifestyle of the Cuban elite. The relationship was a love match, disapproved of by both families, but Díaz Balarts father gave them tens of thousands of dollars, along with Batista, The making of a revolutionary: A Fidel Castro bibliography ,,pg 42 to spend on a three-month New York City honeymoon. ; ; ; .          That same year, Grau decided not to stand for re-election, which was instead won by his  Partido Auténtico s new candidate, ": null
    },
    {
        "Carlos Prío Socarrás": "carlos prío socarrás"
    },
    {
        ". ; . Prío faced widespread protests when members of the MSR, now allied to the police force, assassinated Justo Fuentes, a socialist friend of Castros. In response, Prío agreed to quell the gangs, but found them too powerful to control. . Castro had moved further to the left, influenced by the ": null
    },
    {
        "Marxist": "marxism"
    },
    {
        " writings of ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ", ": null
    },
    {
        "Friedrich Engels": "friedrich engels"
    },
    {
        ", and ": null
    },
    {
        "Vladimir Lenin": "vladimir lenin"
    },
    {
        ". He came to interpret Cubas problems as an integral part of capitalist society, or the dictatorship of the bourgeoisie , rather than the failings of corrupt politicians, and adopted the Marxist view that meaningful political change could only be brought about by proletariat revolution. Visiting Havanas poorest neighborhoods, he became active in the student ": null
    },
    {
        "anti-racist": "anti-racism"
    },
    {
        " campaign. ; .     In September 42 Mirta gave birth to a son, Fidelito, so the couple moved to a larger Havana flat. ; . Castro continued to put himself at risk, staying active in the citys politics and joining the 42 September Movement, which contained within it both communists and members of the Partido Ortodoxo. The groups purpose was to oppose the influence of the violent gangs within the university; despite his promises, Prío had failed to control the situation, instead offering many of their senior members jobs in government ministries. ; . Castro volunteered to deliver a speech for the Movement on 42 November, exposing the governments secret deals with the gangs and identifying key members. Attracting the attention of the national press, the speech angered the gangs and Castro fled into hiding, first in the countryside and then in the U.S. . Returning to Havana several weeks later, Castro lay low and focused on his university studies, graduating as a Doctor of Law in September 42 ; ; .            Castro co-founded a legal partnership that primarily catered to poor Cubans, although it proved a financial failure. ; ; . Caring little for money or material goods, Castro failed to pay his bills; his furniture was repossessed and electricity cut off, distressing his wife. ; . He took part in a high school protest in ": null
    },
    {
        "Cienfuegos": "cienfuegos"
    },
    {
        " in November 42 fighting with police to protest the Education Ministrys ban on student associations; he was arrested and charged for violent conduct, but the magistrate dismissed the charges. . His hopes for Cuba still centered on Chibás and the Partido Ortodoxo, and he was present at Chibás politically motivated suicide in 42 ; ; ; . Seeing himself as Chibás heir, Castro wanted to run for Congress in the June 42 elections, though senior Ortodoxo members feared his radical reputation and refused to nominate him. He was instead nominated as a candidate for the House of Representatives by party members in Havanas poorest districts, and began campaigning. The Ortodoxo had considerable support and was predicted to do well in the election. ; .     During his campaign, Castro met with General ": null
    },
    {
        "Fulgencio Batista": "fulgencio batista"
    },
    {
        ", the former president who had returned to politics with the ": null
    },
    {
        "Unitary Action Party": "unitary action party"
    },
    {
        ". Batista offered him a place in his administration if he was successful; although both opposed Príos administration, their meeting never got beyond polite generalities. ; . On 42 March 42 Batista seized power in a military coup, with Prío fleeing to Mexico. Declaring himself president, Batista cancelled the planned presidential elections, describing his new system as disciplined democracy ; Castro was deprived of being elected in his run for office by Batistas move, and like many others, considered it a one-man dictatorship. ; ; ; . Batista moved to the right, solidifying ties with both the wealthy elite and the United States, severing diplomatic relations with the Soviet Union, suppressing trade unions and persecuting Cuban socialist groups. ; . Intent on opposing Batista, Castro brought several legal cases against the government, but these came to nothing, and Castro began thinking of alternate ways to oust the regime. ; .                   Castro formed a group called The Movement which operated along a ": null
    },
    {
        "clandestine cell system": "clandestine cell system"
    },
    {
        ", publishing underground newspaper El Acusador , while arming and training anti-Batista recruits. ; ; . From July 42 they went on a recruitment drive, gaining around 42 members in a year, the majority from Havanas poorer districts. ; ; . Although a ": null
    },
    {
        "revolutionary socialist": "revolutionary socialism"
    },
    {
        ", Castro avoided an alliance with the communist ": null
    },
    {
        "Popular Socialist Party": "popular socialist party"
    },
    {
        " , fearing it would frighten away political moderates, but kept in contact with PSP members like his brother Raúl. ; . Castro stockpiled weapons for a planned attack on the ": null
    },
    {
        "Moncada Barracks": "moncada barracks"
    },
    {
        ", a military garrison outside ": null
    },
    {
        "Santiago de Cuba": "santiago de cuba"
    },
    {
        ", ": null
    },
    {
        "Oriente": "oriente province"
    },
    {
        ". Castros militants intended to dress in army uniforms and arrive at the base on 42 July, seizing control and raiding the armory before reinforcements arrived. . Supplied with new weaponry, Castro intended to spark a revolution among Orientes impoverished cane cutters and promote further uprisings. . Castros plan emulated those of the 42th-century Cuban independence fighters who had raided Spanish barracks; Castro saw himself as the heir to independence leader ": null
    },
    {
        "José Martí": "josé martí"
    },
    {
        ". ; .        Castro gathered 42 revolutionaries for the mission, . ordering his troops not to cause bloodshed unless they met armed resistance. . The attack took place on 42 July 42 but ran into trouble; 42 of the 42 cars that had set out from Santiago failed to get there. Reaching the barracks, the alarm was raised, with most of the rebels pinned down by machine gun fire. Four were killed before Castro ordered a retreat. ; ; . The rebels suffered 42 fatalities and 42 other casualties, whilst the army suffered 42 dead and 42 wounded. . Meanwhile, some rebels took over a civilian hospital; subsequently stormed by government soldiers, the rebels were rounded up, tortured and 42 were executed without trial. ; . Accompanied by 42 comrades, Castro set out for Gran Piedra in the rugged ": null
    },
    {
        "Sierra Maestra": "sierra maestra"
    },
    {
        " mountains several kilometres to the north, where they could establish a guerrilla base. ; ; . Responding to the attack, Batistas government proclaimed ": null
    },
    {
        "martial law": "martial law"
    },
    {
        ", ordering a violent crackdown on dissent, and imposing strict media censorship. The government broadcast misinformation about the event, claiming that the rebels were communists who had killed hospital patients, although news and photographs of the armys use of torture and summary executions in Oriente soon spread, causing widespread public and some governmental disapproval. ; ; .     Over the following days, the rebels were rounded up; some were executed and others – including Castro – transported to a prison north of Santiago. ; . Believing Castro incapable of planning the attack alone, the government accused Ortodoxo and PSP politicians of involvement, putting 42 defendants on trial on 42 September at the Palace of Justice, Santiago. ; ; . Acting as his own defense counsel, Castro cited Martí as the intellectual author of the attack and convinced the three judges to overrule the armys decision to keep all defendants handcuffed in court, proceeding to argue that the charge with which they were accused – of organizing an uprising of armed persons against the Constitutional Powers of the State – was incorrect, for they had risen up against Batista, who had seized power in an unconstitutional manner. ; ; . The trial embarrassed the army by revealing that they had tortured suspects, after which they tried unsuccessfully to prevent Castro from testifying any further, claiming he was too ill. ; . The trial ended on 42 October, with the acquittal of most defendants; 42 were sentenced to prison terms of between 42 months and 42 years. Castro was sentenced on 42 October, during which he delivered a speech that would be printed under the title of  History Will Absolve Me . ; ; . Castro was sentenced to 42 years imprisonment in the hospital wing of the Model Prison , a relatively comfortable and modern institution on the ": null
    },
    {
        "Isla de Pinos": "isla de la juventud"
    },
    {
        ". ; ; .            Imprisoned with 42 comrades, Castro renamed his group the ": null
    },
    {
        "42th of July Movement": "26th of july movement"
    },
    {
        " in memory of the Moncada attacks date, and formed a school for prisoners. ; ; . He read widely, enjoying the works of Marx, Lenin, and Martí but also reading books by ": null
    },
    {
        "Freud": "sigmund freud"
    },
    {
        ", ": null
    },
    {
        "Kant": "immanuel kant"
    },
    {
        ", ": null
    },
    {
        "Shakespeare": "william shakespeare"
    },
    {
        ", ": null
    },
    {
        "Munthe": "axel munthe"
    },
    {
        ", ": null
    },
    {
        "Maugham": "somerset maugham"
    },
    {
        ", and ": null
    },
    {
        "Dostoyevsky": "fyodor dostoyevsky"
    },
    {
        ", analyzing them within a Marxist framework. ; ; . Corresponding with supporters, he maintained control over the Movement and organized the publication of History Will Absolve Me. ; ; . Initially permitted a relative amount of freedom within the prison, he was locked up in ": null
    },
    {
        "solitary confinement": "solitary confinement"
    },
    {
        " after inmates sang anti-Batista songs on a visit by the President in February 42 ; ; . Meanwhile, Castros wife Mirta gained employment in the Ministry of the Interior, something he discovered through a radio announcement. Appalled, he raged that he would rather die a thousand times than suffer impotently from such an insult . Both Fidel and Mirta initiated divorce proceedings, with Mirta taking custody of their son Fidelito; this angered Castro, who did not want his son growing up in a bourgeois environment. ; ; .     In 42 Batistas government held ": null
    },
    {
        "presidential elections": "1954 cuban general election"
    },
    {
        ", but no politician stood against him; the election was widely considered fraudulent. It had allowed some political opposition to be voiced, and Castros supporters had agitated for an amnesty for the Moncada incidents perpetrators. Some politicians suggested an amnesty would be good publicity, and the Congress and Batista agreed. Backed by the U.S. and major corporations, Batista believed Castro to be no threat, and on 42 May 42 the prisoners were released. ; ; . Returning to Havana, Castro gave radio interviews and press conferences; the government closely monitored him, curtailing his activities. ; ; . Now divorced, Castro had sexual affairs with two female supporters, Naty Revuelta and Maria Laborde, each conceiving him a child. ; . Setting about strengthening the MR4242 he established an 42-person National Directorate but retained autocratic control, with some dissenters labeling him a  caudillo  ; he argued that a successful revolution could not be run by committee and required a strong leader. ; .        In 42 bombings and violent demonstrations led to a crackdown on dissent, with Castro and Raúl fleeing the country to evade arrest. ; ; . Castro sent a letter to the press, declaring that he was leaving Cuba because all doors of peaceful struggle have been closed to me  ... As a follower of Martí, I believe the hour has come to take our rights and not beg for them, to fight instead of pleading for them. ; . The Castros and several comrades traveled to Mexico, ; ; . where Raúl befriended an Argentine doctor and ": null
    },
    {
        "Marxist–Leninist": "marxism–leninism"
    },
    {
        " named ": null
    },
    {
        "Ernesto Che Guevara": "che guevara"
    },
    {
        ", who was working as a journalist and photographer for Agencia Latina de Noticias .  Fidel liked him, later describing him as a more advanced revolutionary than I was . ; ; ; . Castro also associated with the Spaniard ": null
    },
    {
        "Alberto Bayo": "alberto bayo"
    },
    {
        ", who agreed to teach Castros rebels the necessary skills in ": null
    },
    {
        "guerrilla warfare": "guerrilla warfare"
    },
    {
        ". ; ; . Requiring funding, Castro toured the U.S. in search of wealthy sympathizers, there being monitored by Batistas agents, who allegedly orchestrated a failed assassination attempt against him. ; ; . Castro kept in contact with the MR4242 in Cuba, where they had gained a large support base in Oriente. ;. Other militant anti-Batista groups had sprung up, primarily from the student movement; most notable was the ": null
    },
    {
        "Directorio Revolucionario Estudiantil": "directorio revolucionario estudiantil"
    },
    {
        " , founded by ": null
    },
    {
        "José Antonio Echeverría": "josé antonio echeverría"
    },
    {
        ". Antonio met with Castro in ": null
    },
    {
        "Mexico City": "mexico city"
    },
    {
        ", but Castro opposed the students support for indiscriminate assassination. ; ; .     After purchasing the decrepit yacht  Granma , on 42 November 42 Castro set sail from ": null
    },
    {
        "Tuxpan": "tuxpan"
    },
    {
        ", Veracruz, with 42 armed revolutionaries. ; ; . The  crossing to Cuba was harsh, with food running low and many suffering ": null
    },
    {
        "seasickness": "seasickness"
    },
    {
        ". At some points, they had to bail water caused by a leak, and at another, a man fell overboard, delaying their journey. ; . The plan had been for the crossing to take five days, and on the Granmas scheduled day of arrival, 42 November, MR4242 members under ": null
    },
    {
        "Frank País": "frank país"
    },
    {
        " led an armed uprising in Santiago and Manzanillo. However, the Granmas journey ultimately lasted seven days, and with Castro and his men unable to provide reinforcements, País and his militants dispersed after two days of intermittent attacks. ; ; .            The Granma ran aground in a ": null
    },
    {
        "mangrove swamp": "mangrove swamp"
    },
    {
        " at Playa Las Coloradas, close to ": null
    },
    {
        "Los Cayuelos": "los cayuelos"
    },
    {
        ", on 42 December 42 Fleeing inland, its crew headed for the forested mountain range of Orientes ": null
    },
    {
        "Sierra Maestra": "sierra maestra"
    },
    {
        ", being repeatedly attacked by Batistas troops. ; ; . Upon arrival, Castro discovered that only 42 rebels had made it to their destination, the rest having been killed or captured. ; . Setting up an ": null
    },
    {
        "encampment": "military camp"
    },
    {
        ", the survivors included the Castros, Che Guevara, and ": null
    },
    {
        "Camilo Cienfuegos": "camilo cienfuegos"
    },
    {
        ". . They began launching raids on small army posts to obtain weaponry, and in January 42 they overran the outpost at La Plata, treating any soldiers that they wounded but executing Chicho Osorio, the local mayoral , who was despised by the local peasants and who boasted of killing one of Castros rebels. . Osorios execution aided the rebels in gaining the trust of locals, although they largely remained unenthusiastic and suspicious of the revolutionaries. ; ; . As trust grew, some locals joined the rebels, although most new recruits came from urban areas. ; ; . With volunteers boosting the rebel forces to over 42 in July 42 Castro divided his army into three columns, commanded by himself, his brother, and Guevara. . The MR4242 members operating in urban areas continued agitation, sending supplies to Castro, and on 42 February 42 he met with other senior members to discuss tactics; here he met ": null
    },
    {
        "Celia Sánchez": "celia sánchez"
    },
    {
        ", who would become a close friend. ; ; .     Across Cuba, anti-Batista groups carried out bombings and sabotage; police responded with mass arrests, torture, and extrajudicial executions. In March 42 the DRE launched a failed attack on the presidential palace, during which Antonio was shot dead. ; ; . Batistas government often resorted to brutal methods to keep Cubas cities under control. In the Sierra Maestra mountains, Castro was joined by ": null
    },
    {
        "Frank Sturgis": "frank sturgis"
    },
    {
        " who offered to train Castros troops in guerrilla warfare. Castro accepted the offer, but he also had an immediate need for guns and ammunition, so Sturgis became a gunrunner. Sturgis purchased boatloads of weapons and ammunition from CIA weapons expert Samuel Cummings International Armament Corporation in Alexandria, Virginia. Sturgis opened a training camp in the Sierra Maestra mountains, where he taught Che Guevara and other 42 July Movement rebel soldiers guerrilla warfare. Jim Hunt and Bob Risch, Cuba on My Mind: The Secret Lives of Watergate Burglar Frank Sturgis ": null
    }
]