[
    {
        "              Figure skating is a sport in which individuals, duos, or groups perform on ": null
    },
    {
        "figure skates": "Figure Skate"
    },
    {
        "on ice. It was the first winter sport to be included in the ": null
    },
    {
        "Olympic Games": "Olympic Games"
    },
    {
        ", when it was contested at the ": null
    },
    {
        "1908 Olympics": "Figure Skating At The 1908 Summer Olympics"
    },
    {
        " in London. The four Olympic disciplines are ": null
    },
    {
        "mens singles, ladies singles": "Single Skating"
    },
    {
        ", ": null
    },
    {
        "pair skating": "Pair Skating"
    },
    {
        ", and ": null
    },
    {
        "ice dance": "Ice Dance"
    },
    {
        ". Non-Olympic disciplines include ": null
    },
    {
        "synchronized skating": "Synchronized Skating"
    },
    {
        ", ": null
    },
    {
        "Theater on Ice": "Ice Theatre"
    },
    {
        ", and ": null
    },
    {
        "four skating": "Four Skating"
    },
    {
        ". From intermediate through senior-level competition, skaters generally perform two programs , which may include ": null
    },
    {
        "spins": "Figure Skating Spins"
    },
    {
        ", ": null
    },
    {
        "jumps": "Figure Skating Jumps"
    },
    {
        ", ": null
    },
    {
        "moves in the field": "Moves In The Field"
    },
    {
        ", ": null
    },
    {
        "lifts": "Figure Skating Lifts"
    },
    {
        ", ": null
    },
    {
        "throw jumps": "Figure Skating Jumpsthrow Jumps"
    },
    {
        ", ": null
    },
    {
        "death spiral": "Death Spiral"
    },
    {
        "s, and other elements or moves, depending on the discipline.     The blade has a groove on the bottom creating two distinct ": null
    },
    {
        "edges": "Glossary Of Figure Skating Terms"
    },
    {
        ": inside and outside. Judges prefer that skaters glide on one edge of the blade and not on both at the same time, which is referred to as a flat edge. During a spin, skaters use the sweet spot of the blade, formally called a rocker, which is the roundest portion of the blade, just behind the toe pick and near the middle of the blade. Skates used in singles and pair skating have a set of large, jagged teeth called toe picks on the front of the blade. Toe picks are mainly used for the take-off on jumps. Ice dance blades have smaller toe picks.     Figure skaters compete at various levels from beginner up to the Olympic level at local, regional, sectional, national, and international competitions. The ": null
    },
    {
        "International Skating Union": "International Skating Union"
    },
    {
        " regulates international figure skating judging and competitions. These include the ": null
    },
    {
        "Winter Olympics": "Figure Skating At The Olympic Games"
    },
    {
        ", the ": null
    },
    {
        "World Championships": "World Figure Skating Championships"
    },
    {
        ", the ": null
    },
    {
        "World Junior Championships": "World Junior Figure Skating Championships"
    },
    {
        ", the ": null
    },
    {
        "European Championships": "European Figure Skating Championships"
    },
    {
        ", the ": null
    },
    {
        "Four Continents Championships": "Four Continents Figure Skating Championships"
    },
    {
        ", the Grand Prix series , and the ": null
    },
    {
        "ISU Challenger Series": "Isu Challenger Series"
    },
    {
        ".     The sport is also associated with show business. Major competitions generally conclude with exhibition galas, in which the top skaters from each discipline perform non-competitive programs. Many skaters, both during and after their competitive careers, also skate in ice shows, which run during the competitive season and the off-season.          The term professional in skating refers not to skill level but competitive status. Figure skaters competing at the highest levels of international competition are not professional skaters. They are sometimes referred to as amateurs, though some earn money. Professional skaters include those who have lost their ISU eligibility and those who perform only in shows. They may include former Olympic and World champions who have ended their competitive career as well as skaters with little or no international competitive experience.     In languages other than English, Japanese, Korean, Chinese, Italian, Polish and Russian, figure skating is usually referred to by a name that translates as artistic skating.               The most visible difference in relation to ": null
    },
    {
        "ice hockey": "Ice Hockey"
    },
    {
        " skates is that figure skates have a set of large, jagged teeth called toe picks on the front part of the blade. These are used primarily in jumping and should not be used for stroking or spins. If used during a spin, the toe pick will cause the skater to lose momentum, or move away from the center of the spin. Blades are mounted to the sole and heel of the boot with screws. Typically, high-level figure skaters are professionally fitted for their boots and blades at a reputable skate shop. Professionals are also employed to sharpen blades to individual requirements.        Blades are about 3/16  inch  thick. When viewed from the side, the blade of a figure skate is not flat, but curved slightly, forming an arc of a circle with a ": null
    },
    {
        "radius": "Radius"
    },
    {
        " of . This curvature is referred to as the rocker of the blade. The sweet spot is the part of the blade on which all spins are rotated; this is usually located near the ": null
    },
    {
        "stanchion": "Stanchion"
    },
    {
        " of the blade, below the ball of the foot. The blade is also hollow ground ; a groove on the bottom of the blade creates two distinct edges, inside and outside. The inside edge of the blade is on the side closest to the skater; the outside edge of the blade is on the side farthest from the skater. In figure skating, it is always desirable to skate on only one edge of the blade. Skating on both at the same time  may result in lower skating skills scores. The apparently effortless power and glide across the ice exhibited by elite figure skaters fundamentally derives from ": null
    },
    {
        "efficient use of the edges to generate speed": "Conservation Of Angular Momentumconservation Of Angular Momentum"
    },
    {
        ".     During a spin, skaters use the sweet spot of the blade, which is one of two rockers to be found on a blade and is the roundest portion of the blade. The sweet spot is located just behind the toe pick and near the middle of the blade. The other rocker is the more general curvature of the blade when stroking or gliding.     Ice dancers blades are about an inch shorter in the rear than those used by skaters in other disciplines, to accommodate the intricate footwork and close partnering in dance. Dancers blades also have a smaller toe pick as they do not require the large toe pick used for jumping in the other disciplines. Hard plastic skate guards are used when the skater must walk in his or her skates when not on the ice, to protect the blade from dirt or material on the ground that may dull the blade. Soft blade covers called soakers are used to absorb condensation and protect the blades from rust when the skates are not being worn. In competition, skaters are allowed three minutes to make repairs to their skates.     There are many different types of boots and blades to suit different disciplines and abilities. For example athletes who are performing advanced multi-rotational jumps often need a stiffer boot that is higher and gives more support. Athletes working on single or double jumps require less support and may use a less stiff boot. Ice dancers may prefer a lower cut boot that is designed to enable more knee bend.     Likewise, blades designed for free and pairs skating have a longer tail to assist landing. The blade profile and picks are designed to assist with spinning and with jump entry, take-off, landing and exit. Modern blade technology increasingly uses carbon fibre and materials other than steel to make blades lighter. These materials may also be more flexible and help cushion jump landings and be protective of young athletes joints. Ice dance blades have short tails to enable close foot work and reduce the risk of blade clash in close complex moves. They may also be thinner to assist with glide and fast changes of edge.     Off-ice training is the term for physical conditioning that takes place off the ice. Besides regular physical exercise, skaters do walk-throughs of jumps off the ice in order to practice sufficient rotation and height of their jumps, and to practice consistency in landing on one foot.          There is significant variation in the dimensions of ice rinks. Olympic-sized rinks have dimensions of , ": null
    },
    {
        "NHL": "National Hockey League"
    },
    {
        "-sized rinks are , while European rinks are sometimes . The ": null
    },
    {
        "ISU": "International Skating Union"
    },
    {
        " prefers Olympic-sized rinks for figure skating competitions, particularly for major events. According to ISU rule 342, a figure skating rink for an ISU event if possible, shall measure sixty meters in one direction and thirty meters in the other, but not larger, and not less than fifty-six meters in one direction and twenty-six meters in the other. The scoring system rewards skaters who have good ice coverage, i.e. those who efficiently cover the entire ice surface during their programs. Olympic-sized rinks make the differences in skill between skaters more apparent but they are not available for all events. If a rink has different dimensions, a skaters jump setup and speed may be hindered as he or she adjusts.     Ice quality is judged by smoothness, friction, hardness, and brittleness. Factors affecting ice quality include temperature, water quality, and usage, with toe picks causing more deterioration. For figure skating, the ice surface temperature is normally maintained between  and , with the Olympic disciplines requiring slightly softer ice than synchronized skating .  Typically after every two warm-up groups, an ": null
    },
    {
        "ice resurfacer": "Ice Resurfacer"
    },
    {
        " cleans and smooths the surface of the ice sheet. Inadequate ice quality may affect skaters performances.     Some rinks have a harness system installed to help skaters learn new jumps in a controlled manner. A heavy-duty cable is securely attached to two of the walls around the ice, with a set of pulleys riding on the cable. The skater wears a vest or belt, with a cable or rope attached to it, and the cable/rope is threaded through the movable pulley on the cable above. The coach holds the other end of the cable and lifts the skater by pulling the cable/rope. The skater can then practice the jump with the coach assisting the completion. This is used when a skater needs more help on a jump. However, if the coaches see fit, they could use another harness usually called the fishing pole harness. It is named that because it looks similar to a fishing pole. The skater will put on the harness and the coach will adjust it so it fits the skater. The skater will go and do the jump with very little help from their coach. They can also do the jump on any pattern they choose, whereas, the other harness, they must do in a straight line.           As an Olympic sport, figure skating comprises the following disciplines:       Singles  competition for men and women , wherein individual skaters perform ": null
    },
    {
        "jumps": "Figure Skating Jump"
    },
    {
        ", ": null
    },
    {
        "spins": "Figure Skating Spin"
    },
    {
        ", ": null
    },
    {
        "step sequence": "Step Sequence"
    },
    {
        "s, ": null
    },
    {
        "spirals": "Figure Skating Spirals"
    },
    {
        ", and other elements in their programs.    Pair skating  teams, consisting of a man and a woman skating together. Pairs perform elements that are specific to the discipline such as: ": null
    },
    {
        "throw jumps": "Figure Skating Jumpsjumps In Pair Skating"
    },
    {
        ", in which the man throws the woman into a jump; ": null
    },
    {
        "lifts": "Figure Skating Liftspair Lifts"
    },
    {
        ", in which the woman is held above the mans head in one of various grips and positions; ": null
    },
    {
        "pair spins": "Figure Skating Spinspair Skating And Ice Dancing"
    },
    {
        ", in which both skaters spin together about a common axis; ": null
    },
    {
        "death spiral": "Death Spiral"
    },
    {
        "s; and other elements such as side-by-side jumps and spins in unison.    Ice dance  is again for couples consisting of a woman and a man skating together. In contrast to pair skating, ice dance focuses on intricate footwork performed in close dance holds, in time with the music. ": null
    },
    {
        "Ice dance lifts": "Figure Skating Liftsdance Lifts"
    },
    {
        " must not go above the shoulder, and throws and jumps are disallowed.     The four disciplines of mens singles, ladies singles, pair skating and ice dance are also incorporated into a team event, which appeared on the Olympic program for the first time at the ": null
    },
    {
        "2014 Winter Olympics": "Figure Skating At The 2014 Winter Olympics – Team Trophy"
    },
    {
        ".            Synchronized skating , formerly known as precision skating , is for mixed-gender groups of between twelve and twenty figure skaters. This discipline resembles a group form of ice dance, with additional emphasis on precise formations of the group as a whole and complex transitions between formations. The basic formations include wheels, blocks, lines, circles, and intersections. The close formations, and the need for the team to stay in unison, add to the difficulty of the footwork performed by the skaters in these elements. Formal proposals have been put forward by the ": null
    },
    {
        "ISU": "International Skating Union"
    },
    {
        " to include synchronized skating in the 2018 and 2022 Winter Olympics, but so far these efforts have been unsuccessful.    Ice theatre , also known as Theatre on Ice , is a form of group skating that is less structured than synchronized skating and allows the use of theatrical costuming and ": null
    },
    {
        "props": "Theatrical Property"
    },
    {
        ".    Four skating  is a discipline in which a team of four skaters, consisting of two men and two women, perform singles and pairs elements in unison, as well as unique elements that involve all four skaters.    Special figures  is the tracing of elaborate original designs on the ice. This was a common discipline in the early days of figure skating and appeared once at the Olympics, in ": null
    },
    {
        "1908": "Figure Skating At The 1908 Summer Olympics"
    },
    {
        ".   Adagio skating is a form of pair skating most commonly seen in ice shows, where the skaters perform many acrobatic lifts, but few or none of the other elements that are performed by competitive pair skaters.   Acrobatic skating, also known as Acrobatics on ice or Extreme skating , is a combination of circus arts, technical artistic gymnastics skills, and figure skating.            Each element receives a score according to its base value and grade of execution , resulting in a combined technical elements score . At competitions, a technical specialist identifies the elements and assigns each one a level of difficulty, ranging from B to Level 4 . For each element, a panel of judges determines the GOE, ranging between –5 and +5, according to how well the skater executes the element. The GOE is weighted according to the base value of the element.     The ISU defines a fall as a loss of control with the result that the majority of the skaters body weight is not on the blade but supported by hands, knees, or buttocks.                  Jumps involve the skater leaping into the air and rotating rapidly to land after completing one or more rotations. There are many types of jumps, identified by the way the skater takes off and lands, as well as by the number of rotations that are completed.     Each jump receives a score according to its base value and grade of execution . Quality of execution, technique, height, speed, flow and ice coverage are considered by the judges. An under-rotated jump   ": null
    }
]