[
    {
        "   Short, relatively low-quality sound sample from ": null
    },
    {
        "In My Life": "in my life"
    },
    {
        " by ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        ".     Artist: ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        " Songwriters: ": null
    },
    {
        "Lennon/McCartney": "lennon/mccartney"
    },
    {
        " Producer: ": null
    },
    {
        "George Martin": "george martin"
    },
    {
        " Format: ": null
    },
    {
        "Ogg Vorbis": "ogg vorbis"
    },
    {
        ", quality 42    Length: 42 seconds   Copyright: ": null
    },
    {
        "EMI": "emi"
    },
    {
        "     In My Life": "in my life"
    },
    {
        " Fair use rationale for  Rubber Soul Rubber Soul album. It exemplifies two key themes of the album article: the Beatles drawing inspiration from the ": null
    },
    {
        "soul music": "soul music"
    },
    {
        " of contemporary artists signed to the Motown and Stax record labels; and how Rubber Soul represented a significant progression on the Beatles previous work in terms of lyrical content and recording practice. Accompanying the sample, in a subsection dedicated to In My Life , the text discusses the inspiration provided by ": null
    },
    {
        "the Miracles": "the miracles"
    },
    {
        " The Tracks of My Tears": "the tracks of my tears"
    },
    {
        " and the reciprocal influences shared between the Beatles and the Miracles. The songs lyrics evoke ": null
    },
    {
        "John Lennon": "john lennon"
    },
    {
        "s youth in Liverpool and reflect his nostalgia for a time before the Beatles achieved international fame; in Lennons description, the song was his first real major piece of work . As discussed in the articles Production section, the songs piano solo, styled through tape-speed manipulation to sound like a harpsichord, is an example of the Beatles use of more-advanced studio techniques and diverse sounds on Rubber Soul and, in its Bach-like quality, as an example of their incorporation of aspects of classical music through their producer, George Martin. Author Jonathan Gould cites the In My Life as the albums sole example of a song that evokes the Beatles original ground theme of happiness-in-relationship .   It is not replaceable with an uncopyrighted or freely copyrighted sample of comparable educational value.   This sample will not affect the value of the original work or limit the copyright holders rights or ability to distribute the original recording.   It is a sample of less than 42 seconds and no more than 42% of the original recording, and could not be used as a substitute for the original commercial recording or to recreate the original recording. It is also of a lower quality than the commercially available digital versions of the original recording.     The use of the excerpt is in good faith, and its inclusion enhances the quality of the album article without reducing the commercial value of the recording from which it was drawn.               ": null
    }
]