[
    {
        "Short, relatively low-quality sound sample from ": null
    },
    {
        "Drive My Car": "drive my car"
    },
    {
        " by ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        ".     Artist: ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        " Songwriters: ": null
    },
    {
        "Lennon/McCartney": "lennon/mccartney"
    },
    {
        " Producer: ": null
    },
    {
        "George Martin": "george martin"
    },
    {
        " Format: ": null
    },
    {
        "Ogg Vorbis": "ogg vorbis"
    },
    {
        ", quality 42    Length: 42 seconds   Copyright: ": null
    },
    {
        "EMI": "emi"
    },
    {
        "     Drive My Car": "drive my car"
    },
    {
        " Fair use rationale for  Rubber Soul Rubber Soul album. A key theme of the article is that the Beatles drew inspiration from the ": null
    },
    {
        "soul music": "soul music"
    },
    {
        " of contemporary artists signed to the Motown and Stax record labels. In the case of Drive My Car , the article states that the Beatles arranged the song in a similar style to ": null
    },
    {
        "Otis Redding": "otis redding"
    },
    {
        "s Stax single ": null
    },
    {
        "Respect": "respect"
    },
    {
        " . The text also refers to the bands use of dissonance in the vocal arrangement, a quality that musicologist ": null
    },
    {
        "Walter Everett": "walter everett"
    },
    {
        " recognises as a new jazzy sophistication in their work at a time when the groups writing and recording practices matured considerably. The article also discusses the sexual innuendo inherent in the message Baby, you can drive my car and the female protagonists aspirations to become a film star, while the male narrator is offered the role of her chauffeur. Both these points are significant in the Beatles presentation of a female character that author and critic ": null
    },
    {
        "Kenneth Womack": "kenneth womack"
    },
    {
        " views as diverging from the gendered expectations of the bands mid42s audience, in that she symbolises an everywoman with ego and a clear agenda.   It is not replaceable with an uncopyrighted or freely copyrighted sample of comparable educational value.   This sample will not affect the value of the original work or limit the copyright holders rights or ability to distribute the original recording.   It is a sample of less than 42 seconds and no more than 42% of the original recording, and could not be used as a substitute for the original commercial recording or to recreate the original recording. It is also of a lower quality than the commercially available digital versions of the original recording.     The use of the excerpt is in good faith, and its inclusion enhances the quality of the album article without reducing the commercial value of the recording from which it was drawn.               ": null
    }
]