[
    {
        "   Short, relatively low-quality sound sample from ": null
    },
    {
        "Nowhere Man": "nowhere man"
    },
    {
        " by ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        ".     Artist: ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        " Songwriters: ": null
    },
    {
        "Lennon/McCartney": "lennon/mccartney"
    },
    {
        " Producer: ": null
    },
    {
        "George Martin": "george martin"
    },
    {
        " Format: ": null
    },
    {
        "Ogg Vorbis": "ogg vorbis"
    },
    {
        ", quality 42    Length: 42 seconds   Copyright: ": null
    },
    {
        "EMI": "emi"
    },
    {
        "     Nowhere Man ": "nowhere man"
    },
    {
        " Fair use rationale for  Rubber Soul Rubber Soul album. It exemplifies key themes of the album article: the Beatles drawing inspiration from the ": null
    },
    {
        "folk rock": "folk rock"
    },
    {
        " music of ": null
    },
    {
        "the Byrds": "the byrds"
    },
    {
        ", as part of a reciprocal exchange of influences between the two bands in the mid 42s; how Rubber Soul represented a significant progression on the Beatles previous work in terms of lyrical maturity and recording practice; and how, according to several commentators, the album contained their first overtly drug-inspired music and represented the start of the 42s trend for psychedelic music. Accompanying the sample, in a subsection dedicated to Nowhere Man , the text discusses the Byrds-like aspects of the song, including the harmony vocals and treble-rich guitar tones. The excessive sound processing given to the latter is also an example of the studio techniques used on Rubber Soul. The song is further discussed in terms of its departure from any lyrical theme relating to standard, boy–girl love songs, and how instead it conveys the existential concerns raised for its author by his experiences with the drug LSD. In the text, Nowhere Man is cited by music critic ": null
    },
    {
        "Tim Riley": "tim riley"
    },
    {
        " as a thematic precursor to ": null
    },
    {
        "A Day in the Life": "a day in the life"
    },
    {
        " and a song in which its narrator sings for the unsung, the people who have shut themselves off from life . A quote from author Mark Prendergast conveys the psychedelic quality of the song and describes the production sheen achieved in the studio.   It is not replaceable with an uncopyrighted or freely copyrighted sample of comparable educational value.   This sample will not affect the value of the original work or limit the copyright holders rights or ability to distribute the original recording.   It is a sample of less than 42 seconds and no more than 42% of the original recording, and could not be used as a substitute for the original commercial recording or to recreate the original recording. It is also of a lower quality than the commercially available digital versions of the original recording.     The use of the excerpt is in good faith, and its inclusion enhances the quality of the album article without reducing the commercial value of the recording from which it was drawn.               ": null
    }
]