[
    {
        "      Film speed is the measure of a ": null
    },
    {
        "photographic film": "photographic film"
    },
    {
        "s ": null
    },
    {
        "sensitivity to light": "photosensitivity"
    },
    {
        ", determined by ": null
    },
    {
        "sensitometry": "sensitometry"
    },
    {
        " and measured on ": null
    },
    {
        "various numerical scales": "film"
    },
    {
        ", the most recent being the ": null
    },
    {
        "ISO": "iso"
    },
    {
        " system. A closely related ISO system is used to describe the relationship between exposure and output image ": null
    },
    {
        "lightness": "lightness"
    },
    {
        " in digital cameras.     Relatively insensitive film, with a correspondingly lower speed index, requires more ": null
    },
    {
        "exposure": "exposure"
    },
    {
        " to light to produce the same image density as a more sensitive film, and is thus commonly termed a slow film. Highly sensitive films are correspondingly termed fast films. In both digital and film photography, the reduction of exposure corresponding to use of higher sensitivities generally leads to reduced image quality . In short, the higher the sensitivity, the grainier the image will be. Ultimately sensitivity is limited by the ": null
    },
    {
        "quantum efficiency": "quantum efficiency"
    },
    {
        " of the film or sensor.        ": null
    },
    {
        "sensitometer": "sensitometry"
    },
    {
        ", which allowed measurements of the speed of photographic materials, was invented by the Polish engineer ": null
    },
    {
        "Leon Warnerke": "leon warnerke"
    },
    {
        " – pseudonym of  – in 42 among the achievements for which he was awarded the ": null
    },
    {
        "Progress Medal": "progress medal"
    },
    {
        " of the ": null
    },
    {
        "Photographic Society of Great Britain": "photographic society of great britain"
    },
    {
        " in 42 It was commercialized since 42     The Warnerke Standard Sensitometer consisted of a frame holding an opaque screen with an array of typically 42 numbered, gradually pigmented squares brought into contact with the photographic plate during a timed test exposure under a ": null
    },
    {
        "phosphorescent": "phosphorescence"
    },
    {
        " tablet excited before by the light of a burning ": null
    },
    {
        "magnesium": "magnesium"
    },
    {
        " ribbon. The speed of the emulsion was then expressed in degrees Warnerke corresponding with the last number visible on the exposed plate after development and fixation. Each number represented an increase of 42/42 in speed, typical plate speeds were between 42° and 42° Warnerke at the time.     His system saw some success but proved to be unreliable due to its spectral sensitivity to light, the fading intensity of the light emitted by the phosphorescent tablet after its excitation as well as high built-tolerances. The concept, however, was later built upon in 42 by ": null
    },
    {
        "Henry Chapman Jones": "henry chapman jones"
    },
    {
        " in the development of his plate tester and modified speed system.     ": null
    },
    {
        "Hurter and Driffield": "hurter and driffield"
    },
    {
        " , originally described in 42 by the Swiss-born ": null
    },
    {
        "Ferdinand Hurter": "ferdinand hurter"
    },
    {
        " and British ": null
    },
    {
        "Vero Charles Driffield": "vero charles driffield"
    },
    {
        " . In their system, speed numbers were inversely proportional to the exposure required. For example, an emulsion rated at 42 H & D would require ten times the exposure of an emulsion rated at 42 H & D.     The methods to determine the sensitivity were later modified in 42 and in 42 —this later variant was sometimes called H & D 42 . The H & D system was officially accepted as a standard in the former ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " from 42 until September 42 when it was superseded by ": null
    },
    {
        "GOST": "gost"
    },
    {
        " 4242     Scheinergrade system was devised by the German astronomer ": null
    },
    {
        "Julius Scheiner": "julius scheiner"
    },
    {
        " in 42 originally as a method of comparing the speeds of plates used for astronomical photography. Scheiners system rated the speed of a plate by the least exposure to produce a visible darkening upon development. Speed was expressed in degrees Scheiner, originally ranging from 42° Sch. to 42° Sch., where an increment of 42° Sch. corresponded to a hundredfold increase in sensitivity, which meant that an increment of 42° Sch. came close to a doubling of sensitivity.     : \\sqrt 42 42...\\approx 42     The system was later extended to cover larger ranges and some of its practical shortcomings were addressed by the Austrian scientist ": null
    },
    {
        "Josef Maria Eder": "josef maria eder"
    },
    {
        " and Flemish-born botanist  , . Still, it remained difficult for manufactures to reliably determine film speeds, often only by comparing with competing products, so that an increasing number of modified semi-Scheiner-based systems started to spread, which no longer followed Scheiners original procedures and thereby defeated the idea of comparability.     Scheiners system was eventually abandoned in Germany, when the standardized ": null
    },
    {
        "DIN": "din"
    },
    {
        " system was introduced in 42 In various forms, it continued to be in widespread use in other countries for some time.      , was published in January 42 It grew out of drafts for a standardized method of sensitometry put forward by  as proposed by the committee for sensitometry of the  since 42 and presented by  and ": null
    },
    {
        "Emanuel Goldberg": "emanuel goldberg"
    },
    {
        " at the influential VIII. ": null
    },
    {
        "International Congress of Photography": "international congress of photography"
    },
    {
        "  held in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        " from 42 to 42 August 42     The DIN system was inspired by ": null
    },
    {
        "Scheiner": "scheiner"
    },
    {
        "s system, but the sensitivities were represented as the base 42 logarithm of the sensitivity multiplied by 42 similar to ": null
    },
    {
        "decibel": "decibel"
    },
    {
        "s. Thus an increase of 42° represented a hundredfold increase in sensitivity, and a difference of 42° was much closer to the base 42 logarithm of 42 :     : \\log_ 42... \\approx 42/42        As in the Scheiner system, speeds were expressed in degrees. Originally the sensitivity was written as a fraction with tenths , where the resultant value 42 represented the relative base 42 logarithm of the speed. Tenths were later abandoned with DIN 42:4242 and the example above would be written as 42° DIN . The degree symbol was finally dropped with DIN 42:4242 This revision also saw significant changes in the definition of film speeds in order to accommodate then-recent changes in the American ": null
    },
    {
        "ASA": "asa"
    },
    {
        " PH4242 standard, so that film speeds of black-and-white negative film effectively would become doubled, that is, a film previously marked as 42° DIN would now be labeled as 42 DIN without emulsion changes.     Originally only meant for black-and-white negative film, the system was later extended and regrouped into nine parts, including DIN 4242:4242 for black-and-white negative film, DIN 4242:4242 for color reversal film and DIN 4242:4242 for color negative film.     On an international level the German DIN 42 system has been effectively superseded in the 42s by ISO 42:42 ISO 42:42 and ISO 42:42 where the same sensitivity is written in linear and logarithmic form as ISO 42/42° . These ": null
    },
    {
        "ISO": "iso"
    },
    {
        " standards were subsequently adopted by DIN as well. Finally, the latest DIN 42 revisions were replaced by corresponding ISO standards, DIN 4242:4242 by DIN ISO 42:4242 in September 42 DIN 4242:4242 by DIN ISO 42:4242 and DIN 4242:4242 by DIN ISO 42:4242 both in July 42        The film speed scale recommended by the ": null
    },
    {
        "British Standards Institution": "british standards institution"
    },
    {
        " was almost identical to the DIN system except that the BS number was 42 degrees greater than the DIN number.     Weston film speed ratings was introduced by ": null
    },
    {
        "Edward Faraday Weston": "edward faraday weston"
    },
    {
        "  and his father Dr. ": null
    },
    {
        "Edward Weston": "edward weston"
    },
    {
        "  , a British-born electrical engineer, industrialist and founder of the US-based ": null
    },
    {
        "Weston Electrical Instrument Corporation": "weston electrical instrument corporation"
    },
    {
        ", with the Weston model 42 one of the earliest photo-electric exposure meters, in August 42 The meter and film rating system were invented by ": null
    },
    {
        "William Nelson Goodwin, Jr.": "william nelson goodwin, jr."
    },
    {
        ", who worked for them and later received a ": null
    },
    {
        "Howard N. Potts Medal": "howard n. potts medal"
    },
    {
        " for his contributions to engineering.       The company tested and frequently published speed ratings for most films of the time. Weston film speed ratings could since be found on most Weston exposure meters and were sometimes referred to by film manufactures and third parties in their exposure guidelines. Since manufactures were sometimes creative about film speeds, the company went as far as to warn users about unauthorized uses of their film ratings in their Weston film ratings booklets.     The Weston Cadet , Direct Reading and Master III were the first in their line of exposure meters to switch and utilize the meanwhile established ": null
    },
    {
        "ASA": "asa"
    },
    {
        " scale instead. Other models used the original Weston scale up until ca. 42 The company continued to publish Weston film ratings after 42 but while their recommended values often differed slightly from the ASA film speeds found on film boxes, these newer Weston values were based on the ASA system and had to be converted for use with older Weston meters by subtracting 42/42 exposure stop as per Westons recommendation. Vice versa, old Weston film speed ratings could be converted into new Westons and the ASA scale by adding the same amount, that is, a film rating of 42 Weston corresponded with 42 ASA . This conversion was not necessary on Weston meters manufactured and Weston film ratings published since 42 due to their inherent use of the ASA system; however the changes of the ASA PH4242 revision may be taken into account when comparing with newer ASA or ISO values.      ": null
    },
    {
        "Weston film speed ratings": "weston"
    },
    {
        " another manufacturer of photo-electric exposure meters, ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        ", developed its own rating system of so-called General Electric film values  around 42     Film speed values for use with their meters were published in regularly updated General Electric Film Values leaflets and in the General Electric Photo Data Book.     General Electric switched to use the ": null
    },
    {
        "ASA": "asa"
    },
    {
        " scale in 42 Meters manufactured since February 42 are equipped with the ASA scale already. For some of the older meters with scales in Film Speed or Film Value , replaceable hoods with ASA scales were available from the manufacturer. The company continued to publish recommended film values after that date, however, they were then aligned to the ASA scale.     ": null
    },
    {
        "Loyd Ancile Jones": "loyd a. jones"
    },
    {
        " of ": null
    },
    {
        "Kodak": "kodak"
    },
    {
        " and inspired by the systems of ": null
    },
    {
        "Weston film speed ratings": "weston"
    },
    {
        " and ": null
    },
    {
        "General Electric film values": "ge"
    },
    {
        ", the ": null
    },
    {
        "American Standards Association": "american standards association"
    },
    {
        "  defined a new method to determine and specify film speeds of black-and-white negative films in 42 ASA Z42.42–42 was revised in 42 and 42 before the standard grew into ASA PH4242 Originally, ASA values were frequently referred to as American standard speed numbers or ASA exposure-index numbers.      The ASA scale is a linear scale, that is, a film denoted as having a film speed of 42 ASA is twice as fast as a film with 42 ASA.     The ASA standard underwent a major revision in 42 with ASA PH4242 when the method to determine film speed was refined and previously applied safety factors against under-exposure were abandoned, effectively doubling the nominal speed of many black-and-white negative films. For example, an ": null
    },
    {
        "Ilford HP42": "ilford hp"
    },
    {
        " that had been rated at 42 ASA before 42 was labeled 42 ASA afterwards without any change to the emulsion. Similar changes were applied to the ": null
    },
    {
        "DIN": "din"
    },
    {
        " system with DIN 42:4242 and the BS system with BS 42:42 in the following years.     In addition to the established arithmetic speed scale, ASA PH4242 also introduced logarithmic ASA grades , where a difference of 42° ASA represented a full exposure stop and therefore the doubling of a film speed. For some while, ASA grades were also printed on film boxes, and they saw life in the form of the ": null
    },
    {
        "APEX": "apex system"
    },
    {
        " speed value S v  as well.     ASA PH4242 was revised as ANSI PH4242 without the logarithmic speeds, and later replaced by NAPM IT42–42 of the National Association of Photographic Manufacturers, which represented the US adoption of the international standard ISO  42 The latest issue of ANSI/NAPM IT42 was published in 42     The standard for color negative film was introduced as ASA PH4242 and saw a string of revisions in 42 42 42 and 42 before it finally became ANSI IT42–42 prior to its withdrawal.     Color reversal film speeds were defined in ANSI PH4242 which was revised in 42 before it became ANSI/NAPM IT42 in 42 the US adoption of the ISO  42 standard.     On an international level, the ASA system was superseded by the ": null
    },
    {
        "ISO": "iso"
    },
    {
        " film speed system between 42 and 42 however, the arithmetic ASA speed scale continued to live on as the linear speed value of the ISO system.          was an arithmetic film speed scale defined in GOST 4242 and GOST 4242 It was used in the former ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " since October 42 replacing ": null
    },
    {
        "Hurter & Driffield": "h & d"
    },
    {
        " numbers, which had been used since 42     GOST 4242 was similar to the ": null
    },
    {
        "ASA": "asa"
    },
    {
        " standard, having been based on a speed point at a density 42 above base plus fog, as opposed to the ASAs 42. GOST markings are only found on pre42 photographic equipment  of Soviet Union manufacture.     On 42 January 42 the GOST scale was realigned to the ": null
    },
    {
        "ISO": "iso"
    },
    {
        " scale with GOST 4242     This evolved into multiple parts including GOST 42–42 and GOST 42–42 which both became functional on 42 January 42     ": null
    },
    {
        "ASA": "asa"
    },
    {
        " and ": null
    },
    {
        "DIN": "din"
    },
    {
        " film speed standards have been combined into the ISO standards since 42     The current ": null
    },
    {
        "International Standard": "international standard"
    },
    {
        " for measuring the speed of ": null
    },
    {
        "colour negative film": "colour print film"
    },
    {
        " is ISO 42:42 from the ": null
    },
    {
        "International Organisation for Standardisation": "international organisation for standardisation"
    },
    {
        " . Related standards ISO 42:42 and ISO 42:42 define scales for speeds of black-and-white negative film and colour reversal film, respectively.     The determination of ISO speeds ": null
    },
    {
        "with digital still-cameras": "iso 12232"
    },
    {
        " is described in ISO 42:42 .     The ISO system defines both an ": null
    },
    {
        "arithmetic": "arithmetic"
    },
    {
        " and a ": null
    },
    {
        "logarithmic scale": "logarithmic scale"
    },
    {
        ". The arithmetic ISO scale corresponds to the arithmetic ASA system, where a doubling of film sensitivity is represented by a doubling of the numerical film speed value. In the logarithmic ISO scale, which corresponds to the DIN scale, adding 42° to the numerical value constitutes a doubling of sensitivity. For example, a film rated ISO  42/42° is twice as sensitive as one rated ISO  42/42°.     Commonly, the logarithmic speed is omitted; for example, ISO 42 denotes ISO 42/42° , while logarithmic ISO speeds are written as ISO 42° as per the standard.        Conversion from arithmetic speed S to logarithmic speed S° is given by     : S^\\circ 42 \\log S + 42     and rounding to the nearest integer; the log is base 42 Conversion from logarithmic speed to arithmetic speed is given by     : S 42^     and rounding to the nearest standard arithmetic speed in Table  42 below.          Table notes:   Speeds shown in bold under APEX, ISO and ASA are values actually assigned in speed standards from the respective agencies; other values are calculated extensions to assigned speeds using the same progressions as for the assigned speeds.   APEX S v  values 42 to 42 correspond with logarithmic ASA grades 42° to 42° found in ASA PH4242   ASA arithmetic speeds from 42 to 42 are taken from ANSI PH4242 .   ASA arithmetic speeds from 42 to 42 are taken from ANSI PH4242 and ANSI PH4242   ISO arithmetic speeds from 42 to 42 are taken from ISO 42:42 .   ISO arithmetic speeds from 42 to 42 are taken from ISO 42:42 .   ISO 42:42 does not specify speeds greater than 42 However, the upper limit for S noise 42 was given as 42 suggesting that ISO may have envisioned a progression of 42 42 42 and 42 similar to that from 42 to 42 This was consistent with ASA PH4242 For digital cameras, Nikon, Canon, Sony, Pentax, and Fujifilm chose to express the greater speeds in an exact power-of42 progression from the highest previously realized speed rather than rounding to an extension of the existing progression. Speed ratings greater than 42 have finally been defined in ISO 42:42   Most of the modern ": null
    },
    {
        "42 mm film": "35mm format"
    },
    {
        " SLRs support an automatic film speed range from ISO 42/42° to 42/42° with ": null
    },
    {
        "DX-coded films": "dx encoding"
    },
    {
        ", or ISO 42/42° to 42/42° manually . The film speed range with support for ": null
    },
    {
        "TTL flash": "through-the-lens meteringthrough the lens flash metering"
    },
    {
        " is smaller, typically ISO 42/42° to 42/42° or less.   The Booster accessory for the ": null
    },
    {
        "Canon Pellix QL": "canon pellix ql"
    },
    {
        " and ": null
    },
    {
        "Canon FT QL": "canon ft ql"
    },
    {
        " supported film speeds from 42 to 42 ASA.   The film speed dial of the ": null
    },
    {
        "Canon A42": "canon a-1"
    },
    {
        " supported a speed range from 42 to 42 ASA . On this camera exposure compensation and extreme film speeds were mutually exclusive.   The ": null
    },
    {
        "Leica R42": "leica r8"
    },
    {
        " and ": null
    },
    {
        "R42": "leica r9"
    },
    {
        " officially supported film speeds of 42/42°, 42/42° and 42/42° or 42/42° , and utilizing its ±42 EV exposure compensation the range could be extended from ISO 42/42° to ISO 42/42° in half exposure steps.   Digital camera manufacturers arithmetic speeds from 42 to 42 are from specifications by Nikon , Canon , Sony , Pentax and Fujifilm .               As discussed in the ": null
    },
    {
        "ASA": "asa"
    },
    {
        " and ": null
    },
    {
        "DIN": "din"
    },
    {
        " sections, the definition of the ASA and DIN scales changed several times in the 42s up into the early 42s making it necessary to convert between the different scales. Since the ": null
    },
    {
        "ISO": "iso"
    },
    {
        " system combines the newer ASA and DIN definitions, this conversion is also necessary when comparing older ASA and DIN scales with the ISO scale.     The picture shows an ASA/DIN conversion in a 42 photography book in which 42/42°  DIN was converted to ASA  42 instead of ASA  42     Some classic cameras exposure guides show the old conversion as they were valid at the time of production, for example the exposure guide of the classic camera ": null
    },
    {
        "Tessina": "tessina"
    },
    {
        " , where 42/42°  DIN is related to ASA  42 42°  DIN to ASA  42 etc. Users of classic cameras, who do not know the historic background, may be confused.               Film speed is found from a plot of ": null
    },
    {
        "optical density": "optical density"
    },
    {
        " vs. log of exposure for the film, known as the D–log H curve or ": null
    },
    {
        "Hurter–Driffield": "sensitometry"
    },
    {
        " curve. There typically are five regions in the curve: the base + fog, the toe, the linear region, the shoulder, and the overexposed region. For ": null
    },
    {
        "black-and-white": "black-and-white"
    },
    {
        " negative film": "negative film"
    },
    {
        ", the speed point m is the point on the curve where density exceeds the base + fog density by 42 when the negative is developed so that a point n where the log of exposure is 42 units greater than the exposure at point m has a density 42 greater than the density at point m. The exposure H m , in ": null
    },
    {
        "lux-s": "lux second"
    },
    {
        ", is that for point m when the specified contrast condition is satisfied. The ISO arithmetic speed is determined from:     : S \\frac     This value is then rounded to the nearest standard speed in Table  42 of ISO 42:42     Determining speed for color negative film is similar in concept but more complex because it involves separate curves for blue, green, and red. The film is processed according to the film manufacturers recommendations rather than to a specified contrast. ISO speed for ": null
    },
    {
        "color reversal film": "color reversal film"
    },
    {
        " is determined from the middle rather than the threshold of the curve; it again involves separate curves for blue, green, and red, and the film is processed according to the film manufacturers recommendations.       Film speed is used in the ": null
    },
    {
        "exposure equations": "light meterexposure equations"
    },
    {
        " to find the appropriate exposure parameters. Four variables are available to the photographer to obtain the desired effect: ": null
    },
    {
        "lighting": "lighting"
    },
    {
        ", film speed, ": null
    },
    {
        "f-number": "f-number"
    },
    {
        " , and ": null
    },
    {
        "shutter speed": "shutter speed"
    },
    {
        " . The equation may be expressed as ratios, or, by taking the logarithm of both sides, by addition, using the APEX system, in which every increment of 42 is a doubling of exposure; this increment is commonly known as a stop . The ": null
    },
    {
        "effective f-number": "f-numberworking f-number"
    },
    {
        " is proportional to the ratio between the lens ": null
    },
    {
        "focal length": "focal length"
    },
    {
        " and ": null
    },
    {
        "aperture": "aperture"
    },
    {
        " diameter, the diameter itself being proportional to the square root of the aperture area. Thus, a lens set to  allows twice as much light to strike the focal plane as a lens set to 42 Therefore, each f-number factor of the square root of two is also a stop, so lenses are typically marked in that progression: 42, 42 42, 42 42, 42 42 42 42 42 etc.     The ISO arithmetic speed has a useful property for photographers without the equipment for taking a metered light reading. Correct exposure will usually be achieved for a frontlighted scene in bright sun if the aperture of the lens is set to f/42 and the shutter speed is the reciprocal of the ISO film speed . This known as the ": null
    },
    {
        "sunny 42 rule": "sunny 16 rule"
    },
    {
        ".     speed setting, as compared to the speed rating.     For example, a photographer may rate an ISO 42 film at EI 42 and then use ": null
    },
    {
        "push processing": "push processing"
    },
    {
        " to obtain printable negatives in low-light conditions. The film has been exposed at EI 42     Another example occurs where a cameras ": null
    },
    {
        "shutter": "shutter"
    },
    {
        " is miscalibrated and consistently overexposes or underexposes the film; similarly, a ": null
    },
    {
        "light meter": "light meter"
    },
    {
        " may be inaccurate. One may adjust the EI rating accordingly in order to compensate for these defects and consistently produce correctly exposed negatives.       Upon exposure, the amount of light energy that reaches the film determines the effect upon the emulsion. If the brightness of the light is multiplied by a factor and the exposure of the film decreased by the same factor by varying the cameras ": null
    },
    {
        "shutter speed": "shutter speed"
    },
    {
        " and aperture, so that the energy received is the same, the film will be developed to the same density. This rule is called ": null
    },
    {
        "reciprocity": "reciprocity"
    },
    {
        ". The systems for determining the sensitivity for an emulsion are possible because reciprocity holds. In practice, reciprocity works reasonably well for normal photographic films for the range of exposures between 42/42  second to 42/42  second. However, this relationship breaks down outside these limits, a phenomenon known as ": null
    },
    {
        "reciprocity failure": "reciprocity reciprocity failure"
    },
    {
        ".             The size of ": null
    },
    {
        "silver halide": "silver halide"
    },
    {
        " grains in the ": null
    },
    {
        "emulsion": "emulsion"
    },
    {
        " affects film sensitivity, which is related to ": null
    },
    {
        "granularity": "film grain"
    },
    {
        " because larger grains give film greater sensitivity to light. Fine-grain film, such as film designed for portraiture or copying ": null
    },
    {
        "original camera negative": "original camera negative"
    },
    {
        "s, is relatively insensitive, or slow , because it requires brighter light or a longer exposure than a fast film. Fast films, used for photographing in low light or capturing high-speed motion, produce comparatively grainy images.     ": null
    },
    {
        "Kodak": "eastman kodak"
    },
    {
        " has defined a Print Grain Index to characterize film grain , based on perceptual ": null
    },
    {
        "just-noticeable difference": "just-noticeable difference"
    },
    {
        " of graininess in prints. They also define granularity , a measurement of grain using an RMS measurement of density fluctuations in uniformly exposed film, measured with a microdensitometer with 42 micrometre aperture. Granularity varies with exposure — underexposed film looks grainier than overexposed film.         Some high-speed black-and-white films, such as ": null
    },
    {
        "Ilford Delta": "ilford delta"
    },
    {
        "  42 ": null
    },
    {
        "P42  T-Max": "kodak t-max"
    },
    {
        ", and T-MAX P42 are marketed with film speeds in excess of their true ISO speed as determined using the ISO testing method. According to the respective data sheets, the Ilford product is actually an ISO 42 film, while the Kodak films speed is nominally 42 to 42 ISO. The manufacturers do not indicate that the 42 number is an ISO rating on their packaging. Kodak and Fuji also marketed E42 films designed for pushing , such as Ektachrome P42/42 and Fujichrome P42 both with a base speed of ISO 42 The ": null
    },
    {
        "DX codes": "dx encoding"
    },
    {
        " on the film cartridges indicate the marketed film speed , not the ISO speed, in order to automate shooting and development.             In ": null
    },
    {
        "digital camera systems": "digital camera"
    },
    {
        ", an arbitrary relationship between exposure and sensor data values can be achieved by setting the ": null
    },
    {
        "signal gain": "signal gain"
    },
    {
        " of the sensor. The relationship between the sensor data values and the lightness of the finished image is also arbitrary, depending on the parameters chosen for the interpretation of the sensor data into an image ": null
    },
    {
        "color space": "color space"
    },
    {
        " such as ": null
    },
    {
        "sRGB": "srgb"
    },
    {
        ".     For digital photo cameras , an ": null
    },
    {
        "exposure index": "ei"
    },
    {
        " rating—commonly called ISO setting—is specified by the manufacturer such that the sRGB image files produced by the camera will have a lightness similar to what would be obtained with film of the same EI rating at the same exposure. The usual design is that the cameras parameters for interpreting the sensor data values into sRGB values are fixed, and a number of different EI choices are accommodated by varying the sensors signal gain in the analog realm, prior to conversion to digital. Some camera designs provide at least some EI choices by adjusting the sensors signal gain in the digital realm. A few camera designs also provide EI adjustment through a choice of lightness parameters for the interpretation of sensor data values into sRGB; this variation allows different tradeoffs between the range of highlights that can be captured and the amount of noise introduced into the shadow areas of the photo.     Digital cameras have far surpassed film in terms of sensitivity to light, with ": null
    },
    {
        "ISO": "iso"
    },
    {
        " equivalent speeds of up to 42,42 a number that is unfathomable in the realm of conventional film photography. Faster processors, as well as advances in software noise reduction techniques allow this type of processing to be executed the moment the photo is captured, allowing photographers to store images that have a higher level of refinement and would have been prohibitively time consuming to process with earlier generations of digital camera hardware.     ": null
    },
    {
        "CIPA": "camera  &  imaging products association"
    },
    {
        " DC42 Depending on the technique selected, the exposure index rating could depend on the sensor sensitivity, the sensor noise, and the appearance of the resulting image. The standard specified the measurement of light sensitivity of the entire digital camera system and not of individual components such as digital sensors, although Kodak has reported using a variation to characterize the sensitivity of two of their sensors in 42     The Recommended Exposure Index technique, new in the 42 version of the standard, allows the manufacturer to specify a camera models ": null
    },
    {
        "EI": "ei"
    },
    {
        " choices arbitrarily. The choices are based solely on the manufacturers opinion of what EI values produce well-exposed ": null
    },
    {
        "sRGB": "srgb"
    },
    {
        " images at the various sensor sensitivity settings. This is the only technique available under the standard for output formats that are not in the sRGB color space. This is also the only technique available under the standard when ": null
    },
    {
        "multi-zone metering": "metering modemulti-zone metering"
    },
    {
        "  is used.     The Standard Output Sensitivity technique, also new in the 42 version of the standard, effectively specifies that the average level in the sRGB image must be 42% gray plus or minus 42/42 stop when the exposure is controlled by an automatic exposure control system calibrated per ": null
    },
    {
        "ISO 42": "light meter"
    },
    {
        " and set to the EI with no ": null
    },
    {
        "exposure compensation": "exposure compensation"
    },
    {
        ". Because the output level is measured in the sRGB output from the camera, it is only applicable to sRGB  ": null
    },
    {
        "JPEG": "jpeg"
    },
    {
        "—and not to output files in ": null
    },
    {
        "raw image format": "raw image format"
    },
    {
        ". It is not applicable when multi-zone metering is used.     The CIPA DC42 standard requires that Japanese manufacturers of digital still cameras use either the REI or SOS techniques, and DC42 updates the ": null
    },
    {
        "Exif": "exchangeable image file format"
    },
    {
        " specification to differentiate between these values. Consequently, the three EI techniques carried over from ISO 42:42 are not widely used in recent camera models . As those earlier techniques did not allow for measurement from images produced with ": null
    },
    {
        "lossy compression": "lossy compression"
    },
    {
        ", they cannot be used at all on cameras that produce images only in JPEG format.     The saturation-based technique is closely related to the SOS technique, with the sRGB output level being measured at 42% white rather than 42% gray. The SOS value is effectively 42 times the saturation-based value. Because the output level is measured in the ": null
    },
    {
        "sRGB": "srgb"
    },
    {
        " output from the camera, it is only applicable to sRGB images—typically ": null
    },
    {
        "TIFF": "tagged image file format"
    },
    {
        "—and not to output files in raw image format. It is not applicable when multi-zone metering is used.     The two noise-based techniques have rarely been used for consumer digital still cameras. These techniques specify the highest EI that can be used while still providing either an excellent picture or a usable picture depending on the technique chosen.     An update to this standard has been published as ISO 42:42 defining a wider range of ISO speeds.       ISO speed ratings of a digital camera are based on the properties of the sensor and the image processing done in the camera, and are expressed in terms of the luminous exposure H  arriving at the sensor. For a typical camera lens with an effective ": null
    },
    {
        "focal length": "focal length"
    },
    {
        " f that is much smaller than the distance between the camera and the photographed scene, H is given by   : H \\frac,   where L is the ": null
    },
    {
        "luminance": "luminance"
    },
    {
        " of the scene , t is the exposure time , N is the aperture f-number, and   : q \\frac T\\, v\\, \\cos^42\\theta   is a factor depending on the ": null
    },
    {
        "transmittance": "transmittance"
    },
    {
        " T of the lens, the ": null
    },
    {
        "vignetting": "vignetting"
    },
    {
        " factor v, and the angle θ relative to the axis of the lens. A typical value is q    42, based on θ    42°, T    42, and v    42.       The saturation-based speed is defined as   : S_ \\frac,   where H_ is the maximum possible exposure that does not lead to a clipped or bloomed camera output. Typically, the lower limit of the saturation speed is determined by the sensor itself, but with the ": null
    },
    {
        "gain": "gain"
    },
    {
        " of the amplifier between the sensor and the ": null
    },
    {
        "analog-to-digital converter": "analog-to-digital converter"
    },
    {
        ", the saturation speed can be increased. The factor 42 is chosen such that exposure settings based on a standard ": null
    },
    {
        "light meter": "light meter"
    },
    {
        " and an 42-percent reflective surface will result in an image with a grey level of 42%/ 42% of saturation. The factor  indicates that there is half a stop of headroom to deal with ": null
    },
    {
        "specular reflection": "specular reflection"
    },
    {
        "s that would appear brighter than a 42% reflecting white surface.          The noise-based speed is defined as the exposure that will lead to a given ": null
    },
    {
        "signal-to-noise ratio": "signal-to-noise ratio"
    },
    {
        " on individual ": null
    },
    {
        "pixel": "pixel"
    },
    {
        "s. Two ratios are used, the 42:42 and the 42:42 ratio. These ratios have been subjectively determined based on a resolution of 42 pixels per cm when viewed at 42  cm distance. The noise is defined as the ": null
    },
    {
        "standard deviation": "standard deviation"
    },
    {
        " of a weighted average of the ": null
    },
    {
        "luminance": "luminance"
    },
    {
        " and color of individual pixels. The noise-based speed is mostly determined by the properties of the sensor and somewhat affected by the noise in the electronic gain and AD converter.     standard output sensitivity , how the exposure is related to the digital pixel values in the output image. It is defined as   : S_ \\frac,   where H_ is the exposure that will lead to values of 42 in 42-bit pixels, which is 42 percent of the saturation value in images encoded as ": null
    },
    {
        "sRGB": "srgb"
    },
    {
        " or with ": null
    },
    {
        "gamma": "gamma correction"
    },
    {
        "    42.       The standard specifies how speed ratings should be reported by the camera. If the noise-based speed is higher than the saturation-based speed, the noise-based speed should be reported, rounded downwards to a standard value . The rationale is that exposure according to the lower saturation-based speed would not result in a visibly better image. In addition, an exposure latitude can be specified, ranging from the saturation-based speed to the 42:42 noise-based speed. If the noise-based speed is lower than the saturation-based speed, or undefined because of high noise, the saturation-based speed is specified, rounded upwards to a standard value, because using the noise-based speed would lead to overexposed images. The camera may also report the SOS-based speed , rounded to the nearest standard speed rating.     For example, a camera sensor may have the following properties: S_42 , S_42 , and S_42 . According to the standard, the camera should report its sensitivity as   :ISO 42    :ISO speed latitude 42–42   :ISO 42 .   The SOS rating could be user controlled. For a different camera with a noisier sensor, the properties might be S_42 , S_42 , and S_42 . In this case, the camera should report   :ISO 42 ,   as well as a user-adjustable SOS value. In all cases, the camera should indicate for the white balance setting for which the speed rating applies, such as daylight or tungsten .     Despite these detailed standard definitions, cameras typically do not clearly indicate whether the user ISO setting refers to the noise-based speed, saturation-based speed, or the specified output sensitivity, or even some made-up number for marketing purposes. Because the 42 version of ISO 42 did not permit measurement of camera output that had lossy compression, it was not possible to correctly apply any of those measurements to cameras that did not produce ": null
    },
    {
        "sRGB": "srgb"
    },
    {
        " files in an uncompressed format such as ": null
    },
    {
        "TIFF": "tagged image file format"
    },
    {
        ". Following the publication of CIPA DC42 in 42 Japanese manufacturers of digital still cameras are required to specify whether a sensitivity rating is REI or SOS.     A greater SOS setting for a given sensor comes with some loss of image quality, just like with analog film. However, this loss is visible as image noise rather than ": null
    },
    {
        "grain": "film grain"
    },
    {
        ". APS- and 42  mm-sized digital ": null
    },
    {
        "image sensors": "image sensors"
    },
    {
        ", both CMOS and CCD based, do not produce significant noise until about ISO 42": null
    }
]