[
    {
        "         Final Fantasy Adventure, originally released in Japan as , and later released in Europe as Mystic Quest, is a  Final Fantasy  spinoff and the first game in the  Mana  series. Published by ": null
    },
    {
        "Square": "square"
    },
    {
        " in ": null
    },
    {
        "42": "1991 in video gaming"
    },
    {
        " on the ": null
    },
    {
        "Game Boy": "game boy"
    },
    {
        ", it saw a North American re-release by Sunsoft in April 42     Originally being developed under the name Gemma Knights, features gameplay roughly similar to that of the original  The Legend of Zelda , but with the addition of ": null
    },
    {
        "role-playing": "role-playing video game"
    },
    {
        " statistical elements. Along with  Final Fantasy Mystic Quest , Final Fantasy Adventure was the first Final Fantasy game to be released in Europe. A ": null
    },
    {
        "remake": "video game remake"
    },
    {
        ",  Sword of Mana , was released in 42 changing the plot and many gameplay aspects. A second remake was released on mobile phones in Japan which improved the graphics and music of the original version. A third remake,  Adventures of Mana , was released for ": null
    },
    {
        "iOS": "ios"
    },
    {
        ", ": null
    },
    {
        "Android": "android"
    },
    {
        ", and ": null
    },
    {
        "PlayStation Vita": "playstation vita"
    },
    {
        " on February 42 42     The story follows the hero and the young heroine as they attempt to thwart the Dark Lord of Glaive and his sorcerer assistant, Julius, from destroying the ": null
    },
    {
        "Tree of Mana": "mana"
    },
    {
        " and dooming their world. The game was released with many familiar elements of the Final Fantasy series, such as ": null
    },
    {
        "Chocobos": "chocobos"
    },
    {
        ", but these were later changed to feature common enemies and the gameplay style of the ": null
    },
    {
        "Mana series": "mana"
    },
    {
        ".     Final Fantasy Adventure was met with generally positive reviews at the time of its release. Over the course of time, reviewers have considered it one of the best action adventure games on the ": null
    },
    {
        "Game Boy": "game boy"
    },
    {
        ". The game also spawned an entirely new game series, called the  Mana  series, which became a successful video game role-playing franchise.          The gameplay is similar to the original The Legend of Zelda for the ": null
    },
    {
        "NES": "nintendo entertainment system"
    },
    {
        ": the world is viewed from a top-down camera angle, it is divided up into many different squares that can fit on the screen, and the main character can move up, down, left, and right across the screen. The player can interact with individuals within towns by gathering information and buying or selling items and equipment. A variety of enemies can be battled on a field screen to gain experience, ": null
    },
    {
        "GP": "gold coin"
    },
    {
        ", and items. Within ": null
    },
    {
        "dungeon": "dungeon"
    },
    {
        " areas, a number of puzzles may be present and required to be solved in order for the player to advance. The player can also ": null
    },
    {
        "save": "saved game"
    },
    {
        " at any point. A number of weapons can be found throughout the game to maneuver through obstacles such as cutting through trees and thorns.     The main character possesses several ": null
    },
    {
        "statistics": "attribute"
    },
    {
        ", including ": null
    },
    {
        "hit point": "hit point"
    },
    {
        "s, power, and stamina, which can all increase upon gaining an experience level. ": null
    },
    {
        "Magic": "final fantasy magic"
    },
    {
        " spells, which expend the characters MP, can be used to heal oneself or damage enemies. These spells can only be found in certain locations or obtained from other characters at specific plot intervals. In addition, the protagonist has a power gauge that affects his attack strength—the higher the gauge, the stronger his attack will be. The speed at which it fills is directly affected by the characters ": null
    },
    {
        "will": "will"
    },
    {
        " level. The gauge will slowly fill up over time, but once the main character attacks, the gauge is emptied. When the gauge is completely filled up and the main character attacks with a weapon, he will perform a special attack.     One additional ": null
    },
    {
        "non-player character": "non-player character"
    },
    {
        " may occasionally accompany the main character in the story and can perform different activities to aid the main character in his quest. The game introduced the ability to kill townspeople, something that many ": null
    },
    {
        "role-playing video game": "role-playing video game"
    },
    {
        "s of the time lacked.       The Hero is a prisoner of the Dark Lord. One day, the Heros friend informs him of the Dark Lords goals, and he urges him to seek a Knight named Bogard. As the Hero escapes imprisonment, he learns that the Dark Lord is seeking a key to the Mana Sanctuary in order to control the Mana Tree, an energy source that sustains life. The Hero is befriended by the Heroine who is also seeking Bogard. The two find Bogard, who recommends they seek out a man named Cibba. During their journey to meet him, the Heroine is kidnapped. With the aid of a mysterious man, she is later rescued by the Hero. When they meet Cibba, he plays a message left by the Heroines mother, who reveals she is a descendant of the guardians of the Mana Tree and her pendant is the key to it. The mysterious man, upon discovering that the heroine holds the pendant, reveals himself to be Julius, the Dark Lords advisor, and kidnaps her. The Hero then attempts to rescue the Heroine, but he fails and is knocked off of Juliuss airship. However, the Heroine gives the Hero the pendant just before he falls.     The Hero is then reunited with Amanda, an escapee from his prison, who steals the pendant in order to win her brother Lesters freedom. The mayor of Jadd, Davias, takes the pendant, but he transforms Lester into a parrot. The Hero and Amanda confront a Medusa for its tear, which will break the spell. They kill it, but Amanda is infected by the Medusas attack, causing her to transform into one herself. The Hero reluctantly kills her, and uses her tears to break Lesters spell. Lester avenges Amandas death by killing Davias, who reveals that he gave the pendant to the Dark Lord. The Hero confronts and defeats the Dark Lord; however, Hero discovers that the Heroine is under Julius mind control and has opened the entrance to the Mana Tree. Julius reveals he is the last survivor of the Vandole empire, the empire who attempted to control the Mana Tree years ago, and handily defeats the Hero.     Realizing he is powerless to defeat Julius, the Hero learns from Cibba about a powerful sword called Excalibur. Cibba helps him find the Excalibur only to find a rusty Sword instead. He explains that the rusty sword is the Excalibur and would reveal its true strength to whoever it finds worthy. The Hero then raises Dime Tower to reach the Mana Sanctuary and meets a robot known as Marcie. After reaching the top, the tower begins to collapse and Marcie sacrifices himself by throwing the Hero across. After obtaining and passing the swords trials, the Hero confronts and defeats Julius at the cost of the Mana Trees life. The Heroines mother reveals she is the current Mana Tree and before dying, asks the Heroine to succeed her position. The Heroine agrees and bids farewell to the Hero as she becomes the next Mana Tree and the Hero her guardian.       Square trademarked Seiken Densetsu in ": null
    },
    {
        "42": "1989 in video gaming"
    },
    {
        ", intending to use it for a game project subtitled The Emergence of Excalibur, and led by ": null
    },
    {
        "Kazuhiko Aoki": "kazuhiko aoki"
    },
    {
        " for the ": null
    },
    {
        "Famicom Disk System": "famicom disk system"
    },
    {
        ". According to early advertisements, the game would consist of an unprecedented five ": null
    },
    {
        "floppy disk": "floppy disk"
    },
    {
        "s, making it one of the largest titles developed for the Famicom up until that point. Although Square solicited ": null
    },
    {
        "pre-order": "pre-order"
    },
    {
        "s for the game, ": null
    },
    {
        "Kaoru Moriyama": "kaoru moriyama"
    },
    {
        ", a former Square employee, affirms that management canceled the ambitious project before it advanced beyond the early planning stages. In October 42 customers who had placed orders were sent a letter informing them of the cancellation and had their purchases refunded. The letter also suggested to consider placing an order on another upcoming Square role-playing game in a similar vein:  Final Fantasy .     After the release of the third Final Fantasy title in 42 Square offered designer ": null
    },
    {
        "Koichi Ishii": "koichi ishii"
    },
    {
        " to direct a spin-off series game.   It began development for the Game Boy under the working title Gemma Knights; eventually, Square revived the trademarked name and released the game as Seiken Densetsu: Final Fantasy Gaiden. It was later released in Europe as Mystic Quest. Ishii suggested the basis of the games story, while scenario writer ": null
    },
    {
        "Yoshinori Kitase": "yoshinori kitase"
    },
    {
        " helped write the games script. Ishii designed all of the characters himself, while Goro Ohashi was responsible for the development of the game system.     The Mana series, of which Final Fantasy Adventure was the first game, was the result of Koichi Ishiis desire to create a fictional world. In Ishiis opinion, Mana is not a series of video games, but rather a world which is illustrated by and can be explored through video games. When working on the series, Koichi Ishii drew inspiration from abstract images from his memories of childhood, as well as movies and ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        " books that captivated him as a child. Ishii took care to avoid set conventions, and his influences are correspondingly very wide and non-specific. Nonetheless, among his literary influences, he acknowledges ": null
    },
    {
        "Tove Jansson": "tove jansson"
    },
    {
        "s  Moomin , ": null
    },
    {
        "Lewis Carroll": "lewis carroll"
    },
    {
        "s  Alices Adventures in Wonderland , and ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        "s  Lord of the Rings .            The  was released in Japan on July 42 42 Most of the tracks were composed by ": null
    },
    {
        "Kenji Ito": "kenji ito"
    },
    {
        ", while track 42 Chocobo Tanjou , is credited to Square composer ": null
    },
    {
        "Nobuo Uematsu": "nobuo uematsu"
    },
    {
        ". , a set of ": null
    },
    {
        "arranged": "arrangement"
    },
    {
        " tracks was also released on September 42 42 Both albums were compiled into Seiken Densetsu: Final Fantasy Gaiden Sound Collections, originally released in August 42 42 The games music was included in a 42th anniversary CD compilation of all of the ": null
    },
    {
        "Mana series": "mana"
    },
    {
        " games soundtracks. A second arranged album titled  was released on December 42 42 The album was compiled by Yu Hong Ishikawa and Kushiro Negishi.               In 42 Sunsoft obtained the license for it and re-released it along with the ": null
    },
    {
        "Final Fantasy Legend": "saga"
    },
    {
        " games. This version was advertised as having ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " support, although the release was not enhanced in any way. RPGamer reported in July 42 that Square was polling die-hard customers, testing the feasibility of porting Final Fantasy Adventure to the ": null
    },
    {
        "Nintendo DS": "nintendo ds"
    },
    {
        ". ": null
    },
    {
        "GamesRadar": "gamesradar"
    },
    {
        " listed Final Fantasy Adventure as one of the titles they want in the ": null
    },
    {
        "42DS": "nintendo 3ds"
    },
    {
        " Virtual Console": "virtual console"
    },
    {
        ".     The game received a ": null
    },
    {
        "remake": "enhanced remake"
    },
    {
        " for the ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " called  Sword of Mana  in 42 The original version was remade again to mobile phones and released on August 42 42 for ": null
    },
    {
        "SoftBanks 42G": "softbank mobile"
    },
    {
        " network. It was later ported onto ": null
    },
    {
        "i-Mode": "i-mode"
    },
    {
        " distribution service on November 42 42 and ": null
    },
    {
        "EZweb": "ezweb"
    },
    {
        " distribution service on February 42 42 The gameplay of the mobile phone version is closer to the original games design, but featuring updated graphics and sound, an improved world map, and other minor changes. The characters have been redesigned several times between each remake. On September 42 42 a ": null
    },
    {
        "42D": "3d computer graphics"
    },
    {
        " remake was announced for ": null
    },
    {
        "PlayStation Vita": "playstation vita"
    },
    {
        ", ": null
    },
    {
        "Android": "android"
    },
    {
        " and ": null
    },
    {
        "iOS": "ios"
    },
    {
        ". A port of the original game for the ": null
    },
    {
        "Nintendo Switch": "nintendo switch"
    },
    {
        " was released with ports of Secret of Mana and Trials of Mana as part of the Seiken Densetsu Collection on June 42 42 in Japan and on June 42 42 in North America as Collection of Mana.     Two guidebooks have been released in Japan:  and , each of which contains character illustrations and ": null
    },
    {
        "manga": "manga"
    },
    {
        ". The guidebooks were released on May 42 and August 42 respectively.       Final Fantasy Adventure, is one of the video games featured in the manga titled Rockn Game Boy, by Shigeto Ikehara and Published by Comic BomBom October 42 to December 42            According to Squares publicity department, the game sold 42 units, with 42 of these sold in Japan.      Final Fantasy Adventure was featured in ": null
    },
    {
        "Nintendo Power": "nintendo power"
    },
    {
        " when it was re-released in the United States. The game holds an aggregated score of 42% approval rating on Game Rankings based on seven reviews. ": null
    },
    {
        "IGN": "ign"
    },
    {
        " praised the ": null
    },
    {
        "Game Boy": "game boy"
    },
    {
        " re-release version noting its strong story, graphics, and music. They additionally praised the games puzzle elements as innovative and drew comparisons to  The Legend of Zelda: Links Awakening , though noted that its role-playing gameplay did not blend well with its action-oriented nature. RPGFan also praised the game stating it was possibly the best thing that ever happened to . RPGamer praised the games plot stating, The story is one where you can relate to the characters and also the world around them. Ndojo also gave similar praise to the game however noting it being vastly different from Final Fantasy stating, If you’re expecting Final Fantasy in the traditional sense, you’re going to be disappointed. However, if you play the game for a while, you just might find that it’s equally entertaining in its own fashion.     The game has been perceived very positively in the years following its initial release. ": null
    },
    {
        "GameDaily": "gamedaily"
    },
    {
        " named it alongside the other Game Boy Final Fantasy titles as definitive games for the system, describing it as providing hours of role-playing excitement, whether you were waiting in a dentists office or on the way to Grandmas house. The sentiment was shared by gaming magazine Pocket Games, which ranked the titles together 42th out of the Top 42 games for the Game Boy, stating every game in the series is a sprawling classic with well written scripts and solid characters. ": null
    },
    {
        "Kotaku": "kotaku"
    },
    {
        " praised the original release of the game as a really great action-RPG . ": null
    },
    {
        "42UP.com": "1up.com"
    },
    {
        " called the game ambitious for its time, writing that it represented an evolution of the overhead perspective action adventure genre. They also rated the game as Worth It! in terms of buying and enjoying the original game in 42 and noted it as the origins of the Mana series many unique gameplay features. ": null
    },
    {
        "GamesRadar": "gamesradar"
    },
    {
        " named it the 42th best ": null
    },
    {
        "Game Boy": "game boy"
    },
    {
        " game ever made, noting that its interesting leveling system and large number of collectible items made up for a poor English translation. ": null
    },
    {
        "Game Informer": "game informer"
    }
]