[
    {
        "        Final Fantasy Mystic Quest, released as Mystic Quest Legend in PAL regions and as  in Japan, is a ": null
    },
    {
        "role-playing": "role-playing video game"
    },
    {
        " video game": "video game"
    },
    {
        " for the ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        ". The game was released as a spin-off to ": null
    },
    {
        "Square": "square"
    },
    {
        "s popular  Final Fantasy  series of video games. Final Fantasy Mystic Quest was first released in North America in ": null
    },
    {
        "42": "1992 in video gaming"
    },
    {
        " and marketed as a simplified role-playing game...designed for the entry-level player in an attempt to broaden the genres appeal. The games presentation and battle system is broadly similar to that of the main series, but it differed in its inclusion of ": null
    },
    {
        "action-adventure game": "action-adventure game"
    },
    {
        " elements. Final Fantasy Mystic Quest was the first Final Fantasy game to be released in Europe.     In the game, the player controls a youth named Benjamin in his quest to save the world. His goal is to reclaim a set of stolen crystals that determine the state of the worlds four elemental powers. The gameplay takes a departure from the main series in a variety of ways. Many series staples are eliminated, such as ": null
    },
    {
        "random battle": "random battle"
    },
    {
        "s, ": null
    },
    {
        "save point": "save point"
    },
    {
        "s, manual equipment, and the party system. The game received middling reviews and sales in North America and Japan, citing its simplified gameplay and lack of depth in the games story. Over time, the game has kept the reputation for being a beginners Final Fantasy and has been praised for its music.           Like previous games in the series, Final Fantasy Mystic Quest is presented in a top-down perspective , with players directly navigating the main character around the world to interact with objects and people. The game features a unique way of traveling the world map. Unlike past Final Fantasy games, players cannot freely roam the world map. Instead, they travel along set paths from one icon to the next. Some routes are blocked off , but become accessible when the player succeeds in a specific task, such as completing a dungeon. Once its path is open, the player can enter an icon; the games plot and action takes place within these icons, which include towns, dungeons, and battlefields. The game is characterized by featuring ": null
    },
    {
        "action-adventure game": "action-adventure game"
    },
    {
        " elements; besides jumping, players can use weapons outside of battle, which play an active role in exploration. Players can chop down trees with an axe, detonate bombs to open sealed doorways, or use a ": null
    },
    {
        "grappling hook": "grappling hook"
    },
    {
        " to clear wide gaps. The game also has more puzzles than earlier Final Fantasy games. In the Falls Basin, for example, players must move pillars of ice across the ground level in such a fashion that they can be used as platforms to jump across on the second level. Final Fantasy Mystic Quest also does away with save points; players can save their progress at any time during exploration.          Final Fantasy Mystic Quest eliminates the system of ": null
    },
    {
        "random enemy encounters": "random encounter"
    },
    {
        ", a trademark of the main series. Instead, battles are represented in dungeons as stationary enemy ": null
    },
    {
        "sprite": "sprite"
    },
    {
        "s, and the player is given the option of approaching the enemy and engaging a battle. Once engaged in battle, the player is thrust into the battle screen, which presents a ": null
    },
    {
        "window": "window"
    },
    {
        "-based menu with three commands to choose from: battle, run, or control. Running from battle transports the player back to the field screen, while choosing control toggles between the allys battle mode, where the player can manually control the main characters ally or opt for a ": null
    },
    {
        "computer-controlled": "game artificial intelligence"
    },
    {
        " ally. If players choose to battle, they are presented with a submenu of four more options: physically attack the enemy, cast a spell, use a curative item , or defend. The games battle system relies on ": null
    },
    {
        "conditional turn-based combat": "final fantasy battle systemsconditional turn-based"
    },
    {
        ", where the characters and enemies cycle through rounds in battling each other, with the first action of the turn awarded to the fastest character. Enemy sprites are always far larger than player sprites in battle, despite appearing further away from the game camera. Some animals attack by physically crushing the players.     Character health is represented by an incremental ": null
    },
    {
        "life bar": "health life bar"
    },
    {
        ", although the player may choose to have it displayed in numerical fractions as in most role-playing games. If all character life bars reach zero, the game is over, but the player is given the option of continuing and restarting the battle. If the player chooses this option, however, the main characters attack power may suffer temporarily as a penalty. A characters performance in battle is determined by numerical figures  for vitality, attacking power, defensive capabilities, speed, magical prowess, accuracy, and evasion. Character statistics are driven by ": null
    },
    {
        "experience point": "experience point"
    },
    {
        "s gained from winning battles, which accumulate until players achieve milestones known as experience levels. Besides awarding experience points, battling enemies also earns the player ": null
    },
    {
        "gold pieces": "common elements of final fantasycurrency"
    },
    {
        " , which can be used to buy weapons, armor, and curative items. In the absence of random enemy encounters, battlefields are scattered across the world map. Players are immediately thrust into a battle when entering a battlefield, and must win ten enemy battles to clean out the battlefield. Once a battlefield is cleaned out, players are awarded either a large amount of experience, a large amount of GP, a piece of armor, or a magic spell.          Unlike all other Final Fantasy games, players cannot manually equip characters with armor. Instead, newly acquired armor replaces the main characters current equipment, or upgrades a current version of a weapon, e.g. obtaining the knight sword will replace the steel sword. Using the L and R buttons allows the user to cycle through the weapons that have been collected so far. Benjamin uses four types of weapons: swords, axes, bombs, and claws. Although the weapons share a similar function in battle, all have different purposes when exploring the field map. The Dragon Claw, for example, doubles as a ": null
    },
    {
        "grappling hook": "grappling hook"
    },
    {
        ". The weapon arsenal in Final Fantasy Mystic Quest is considerably smaller than most role-playing games.     ": null
    },
    {
        "Magic": "final fantasy magic"
    },
    {
        " in Final Fantasy Mystic Quest is not learned by designated spellcasters through experience. Instead, the main character acquires magic spells through treasure chests or as a reward for clearing out battlefields. The system of spellcasting is similar to that of the original Final Fantasy; rather than using ": null
    },
    {
        "magic point": "magic point"
    },
    {
        "s to draw upon for supplying magic, spells are used according to a set number for their type, i.e., white magic, black magic, or wizard magic. The allotted number for each type increases as a character levels up. A spells effectiveness is also proportional to a characters experience level; the higher the characters level, the more powerful the Fire spell, for example. The spell catalog in Final Fantasy Mystic Quest is limited compared to most other Final Fantasy games. Items in the game are analogous to the spells. Notably, the Heal spell and potion act as a cure-all for ": null
    },
    {
        "status ailments": "status effect"
    },
    {
        ", eliminating the need for unique status recovery items. Similarly, the Cure spell and potion each restore 42% of your maximum hit points regardless of level, so there is no need for a range of potion or spell strengths.           The fictional events of Final Fantasy Mystic Quest take place on a single continent of an unnamed world, which is divided into four distinct regions: Foresta, Aquaria, Fireburg, and Windia. The welfare of each region is determined by the state of one of four shining crystals: earth, water, fire, and wind, respectively. For centuries the Focus Tower had stood at the heart of the world. It had been a center for trade and knowledge, and the worlds people met there to peacefully settle their differences. But on one warm summer day, powerful monsters stormed the Tower, stole the four crystals, and then took off with the magical coins that kept the Towers doors unlocked. The monsters began consuming the power of the crystals; they grew in strength while the world began to decay. An old prophecy tells that at the time the vile four steal the power and divide the world behind four doors, a knight will appear to vanquish the darkness.       The game opens with an adventurous youth named Benjamin climbing the Hill of Destiny. While exploring, his village is destroyed in an earthquake. As Benjamin is climbing the Hill, he meets a mysterious old man who charges Benjamin with fulfilling the knights prophecy. Although initially in disbelief, Benjamin accepts the role and the Old Man shows him the Focus Tower . After defeating a monster at the top of the hill, Benjamin follows the Old Man to the Level Forest, where he is tasked with recovering the Crystal of Earth. Proceeding to Foresta, he meets with an axe-wielding girl named Kaeli, who agrees to help Benjamin if he can help her rid the Level Forest of monsters. Kaeli is ambushed and poisoned in the process, and her mother informs Benjamin of the Elixir and where it can be found. Benjamins search for Elixir to heal Kaeli brings him to Bone Dungeon, where hes aided by a treasure hunter named Tristam in succeeding dual purposes: not only does Benjamin get Elixir from Tristam to heal Kaeli, but he defeats one of the four Vile Evils, Flamerous Rex, to free the Crystal of Earth and in turn restore life to the dying village of Foresta. Tristam leaves and Benjamin heals Kaeli.     Benjamin is then told that Aquaria is in danger, and is in need of help. He is told that he should see Spencer. He is also told that a girl named Phoebe can help him as well. After proceeding through the first stage of the Focus Tower, and arriving in the province of Aquaria, Benjamin locates Phoebe, and learns that Spencer is trapped underground by thick ice floes. Phoebe needs the wakewater, which is said to be able to help free Aquaria. Benjamin and Phoebe head to the Wintry Cave and defeat a monster to obtain the Libra Crest. Using this crest to enter the Libra Temple, they find that the source of the wakewater has dried up. Finding the Old Man in the back of the Libra Temple, they find that he holds the only bag of wakewater, and to use it on the plant in the center of town. Back in Aquaria, they find that the wakewater doesnt work, and reviving the crystal is the only thing that will save the town and Spencer. They head off for the Ice Pyramid and defeat the second of the Vile Evils, the Ice Golem. The Ice Crystal is saved, and Benjamin and Phoebe head back to Aquaria. They find the town is now like Foresta and Spencer is back and digging his tunnel to save Captain Mac . Upon leaving, Spencer hands the Venus Key to Benjamin, and tells him to head for Fireburg.     Benjamin arrives in the Focus Tower to find the Old Man again, who tells him to find Reuben, and disappears. Benjamin then heads for Fireburg, and finds Reuben. Reuben joins when Benjamin promises to help free Reubens dad, Arion. Upon finding Tristam in the Inn , they find the coward who left Arion in the mine in a locked house. He teaches Benjamin how to throw the bombs and says that it will free Arion. Benjamin and Reuben then proceed to the Mine and free Arion. Arion tells some tales of how the Fire Crystal has gone berserk, and Reuben goes off with Benjamin to the Volcano to stop the Vile Evil from stealing the crystals power. After defeating the Dualhead Hydra, Benjamin and Reuben find the Fire Crystal returning to power. They decide to head to Windia, and Reuben is ambushed by monsters and falls off the rope bridge. Tristam comes along and helps Benjamin cross the bridge, but they are stymied by a tree who wont talk to them. Tristam says that there is a gal in Foresta who can talk to tree spirits, and the two drop in on Aquaria where Kaeli was trying to find Spencer. Benjamin and Tristam go down into the tunnel and find Spencer, who tells Tristam of a great treasure. They leave, and Phoebe plants a bomb that collapses a tunnel Spencer was building. She leaves to tell Spencer what happened, and Benjamin takes Kaeli to the Alive Forest to talk to the dormant tree spirit. He tells them that he will take them to Windia if they kill the monsters dwelling within him. They do, and he takes them to Windia.     Upon arriving in Windia, Benjamin and Kaeli find Otto, whose daughter was caught in Pazuzus Tower when the winds from nearby Mount Gale knocked out his Rainbow Road. The only way the road works is when there is no wind, so Benjamin and Kaeli proceed to Mount Gale and stop the wind by defeating a powerful monster at the top. After returning to Windia, Otto powers up the Rainbow Road and the two adventurers proceed to Pazuzus Tower. After giving chase, they corner Pazuzu and defeat the fourth Vile Evil and restore the Wind Crystal. Norma is reunited with Otto, and Kaeli stays to take care of her. Reuben shows up and after a series of long events Captain Mac is rescued. Reuben falls down because of the injury sustained on the Rope Bridge, and Phoebe joins Benjamin instead.     The Old Man tells Benjamin an ominous addendum to the prophecy: the one behind the four is darker than the night, and rises midst the land. It becomes known that the Dark King is the true source of evil. Benjamin thus sails to Doom Castle to confront the Dark King, who threatens to enslave Benjamin along with the rest of mankind. The Dark King claims that he wrote and spread the prophecy Benjamin had followed throughout his quest. Once the Dark King is defeated, the old man congratulates Benjamin and reveals that he is the Fifth Crystal, The Crystal of Light in the guise of a human. At the end of the game, Benjamin is seen still craving adventure, and he borrows the ship from Captain Mac as his friends gather to wish him off. While sailing, Tristam makes a surprise appearance.       Although designed by one of Squares development teams in Japan, Final Fantasy Mystic Quest was specifically geared for the U.S. market. At the time, console role-playing games were not a major genre in North America; Square thus attempted to broaden the genres appeal through Final Fantasy Mystic Quest. Square had already released several Final Fantasy spinoffs in North America, including the first three titles in the ": null
    },
    {
        "SaGa series": "saga"
    },
    {
        " as Final Fantasy Legend, and the first ": null
    },
    {
        "Mana series": "mana"
    },
    {
        " game as Final Fantasy Adventure, and wished to further break into the popular American consciousness. Squares executives cited the alleged difficulty of RPGs as the reason Americans shied away from them, and eased the difficulty level by tweaking various aspects of the main series gameplay. The American release of  Final Fantasy IV  was altered to make the game simpler, for example. Mystic Quest was to take this one step further, and the Japanese developers worked with the American offices to make sure the game was accessible to children.     Mystic Quest was developed in a graphic and gameplay style similar to  Final Fantasy Legend III  . The gameplay shares numerous similarities with that title, featuring a very similar battle system, graphical interface, and dungeon system. Even the jump feature from Final Fantasy Legend III has been reproduced, and almost all of the icons - from caves to the enemy sprites - are a color-upgraded version of Final Fantasy Legend IIIs character set. Besides allowing for computer-controlled allies, the game did away with random battles, complicated storylines, and text-based menus. To appeal to the perceived tastes of North American audiences, which gravitated towards fast-paced games, Square included action-adventure game elements; players could now brandish weapons outside of battle, jump, use a grappling hook, and set bombs to open new paths. North American translator Ted Woolsey explained that The action/adventure players...are larger in numbers and the demographic is different. They tend to be younger and like the idea of jumping straight into the action with a sword in their hands; its an empowerment issue - you get to go out there, start whacking things and it feels good! With the more traditional RPGs, it takes a good 42 or 42 hours of playing before youre finally hooked. Woolsey stated that Mystic Quest was one of the easiest games he had to translate, due to the games small size. Because the game was marketed towards a younger demographic, the game sold for US$ 42. Mystic Quest also came with an Official Strategy Guide that helped inexperienced and new RPG players complete it.       After its U.S. debut, Final Fantasy Mystic Quest was released in Japan under the title Final Fantasy USA: Mystic Quest. The European release of the game was released in English, German and French, and had the title changed to Mystic Quest Legend to avoid confusion with ": null
    },
    {
        "Final Fantasy Adventure": "final fantasy adventure"
    },
    {
        ", which had been released in Europe as Mystic Quest. Final Fantasy Mystic Quest was first unveiled in June at the 42 Summer Consumer Electronics Show in Chicago , where it was a popular venue, and the game was later presented in more detail in the Fall 42 issue of the Ogopogo Examiner.       Final Fantasy Mystic Quests soundtrack was composed by Ryuji Sasai and Yasuhiro Kawakami. It was one of the first games in the ": null
    },
    {
        "Final Fantasy": "final fantasy"
    },
    {
        " series not to be composed by regular series composer Nobuo Uematsu , after ": null
    },
    {
        "Final Fantasy Adventure": "final fantasy adventure"
    },
    {
        "  and the ": null
    },
    {
        "Final Fantasy Legend": "final fantasy legend"
    },
    {
        " games . The album was first released on one Compact Disc by NTT Publishing on September 42 42 ROM capacity limits and hardware limitations made the composition process difficult. After the game was completed, Sasai recorded two remixes on his days off for the games album, and personally played the guitar parts. “Mountain Range of Whirlwinds” was built off of Sasais liking of the sound of the french horn , and its ability to go the length of the song and convey a sense of mountains. The track Last Castle was written in a short time, and was used to create imagery of a field, but its length left very little space for the Battle 42 song.               According to Squares publicity department, Final Fantasy Mystic Quest sold a total of 42 units, with roughly half of these sold in Japan.     On its original North American release, it scored a 42/42 in the November 42 issue of ": null
    },
    {
        "Nintendo Power": "nintendo power"
    },
    {
        ", a 42/42 in ": null
    },
    {
        "Electronic Gaming Monthly": "electronic gaming monthly"
    },
    {
        ", and 42% in ": null
    },
    {
        "Electronic Games": "electronic games"
    },
    {
        ". The game did not generate much excitement in either America or Japan, although it is thought to have appealed to younger fans. The game ultimately failed in its bid to bring mainstream North American popularity to console RPGs , and simultaneously alienated fans of the series anticipating another epic following ": null
    },
    {
        "Final Fantasy IV": "final fantasy iv"
    },
    {
        ". It has also been described as Final Fantasy with an identity crisis due to the inherent flaw of creating a game that didnt appeal to the masses or the hard-core gaming audience.     Years later, reviewers have not looked favorably on Mystic Quest, including Kotaku calling it the worst Final Fantasy , and GamesRadar calling it a franchise embarrassment for its enemies that stand still and wait for players to attack. IGN rated the Wii Virtual Console release a 42, or Okay , citing an extremely repetitive and simple battle system, and very little character development. 42UP.com rated the game a Not Worth It! , calling handholding and insubstantial .     It was, however, praised for its music, including 42UP.com praising its sweet sampled metal guitar licks , and listed the final boss battle music as one of the must download songs for the Final Fantasy music game ": null
    },
    {
        "Theatrhythm Final Fantasy": "theatrhythm final fantasy"
    },
    {
        ". It was also praised by GamesRadar for its music, mentioning the boss battle in their Game Music of the Day column, and also mentioning the rest of the game music as smooth and easy listening. On April 42 42 GameSpot included Mystic Quest in an Aprils Fools list entitled Top 42 Final Fantasy Games , which mostly consisted of spin-off s from the main series and unrelated games. Mystic Quest was praised for being easy and having simplistic graphics and plot. In October 42 the game was released on Nintendos Virtual Console . Famitsu has also reported that Square was preparing the game for release on the Android mobile platform in 42     The main character Benjamin and two songs appear in the rhythm game ": null
    },
    {
        "Theatrhythm Final Fantasy: Curtain Call": "theatrhythm final fantasy: curtain call"
    },
    {
        ".     ": null
    }
]