[
    {
        "        Flintheart Glomgold is a fictional character in ": null
    },
    {
        "Disney": "the walt disney company"
    },
    {
        " comic books": "comic books"
    },
    {
        ", created by ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        " in 42 He is a South African ": null
    },
    {
        "white duck": "american pekin duck"
    },
    {
        " and the ": null
    },
    {
        "archenemy": "archenemy"
    },
    {
        " of ": null
    },
    {
        "Scrooge McDuck": "scrooge mcduck"
    },
    {
        ", usually portrayed as an ambitious, ruthless, and ": null
    },
    {
        "manipulative": "psychological manipulation"
    },
    {
        " businessman who shares many of the same qualities as Scrooge—the drive for massive wealth, and the ": null
    },
    {
        "cunning": "wiktionary:cunning"
    },
    {
        " and creativity to obtain the same—but he lacks any of Scrooges tendencies towards ": null
    },
    {
        "generosity": "generosity"
    },
    {
        " and ": null
    },
    {
        "compassion": "compassion"
    },
    {
        ". In ": null
    },
    {
        "Don Rosa": "don rosa"
    },
    {
        "s  The Life and Times of Scrooge McDuck  he is said to be a ": null
    },
    {
        "Boer": "boer"
    },
    {
        ".     Glomgold is one of Scrooges main rivals along with the ": null
    },
    {
        "Beagle Boys": "beagle boys"
    },
    {
        ", ": null
    },
    {
        "Magica De Spell": "magica de spell"
    },
    {
        ", and ": null
    },
    {
        "John D. Rockerduck": "john d. rockerduck"
    },
    {
        ", and also holds the title of being The Second Richest Duck in the World where Scrooge is the richest. His appearance is deliberately similar to that of Scrooge, but he is usually drawn with a full ": null
    },
    {
        "beard": "beard"
    },
    {
        " and ": null
    },
    {
        "sideburns": "sideburns"
    },
    {
        " as opposed to simple side-": null
    },
    {
        "whiskers": "whiskers"
    },
    {
        ", black or purple ": null
    },
    {
        "frock coat": "frock coat"
    },
    {
        " instead of Scrooges red or blue one, and a dark ": null
    },
    {
        "tam oshanter": "tam oshanter"
    },
    {
        " instead of Scrooges ": null
    },
    {
        "top hat": "top hat"
    },
    {
        ".           Glomgold was originally created in 42 by Scrooge McDuck artist and creator ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        ", the creator of much of the ": null
    },
    {
        "Duck universe": "duck universe"
    },
    {
        ". Characterized as an unrepentant ": null
    },
    {
        "miser": "miser"
    },
    {
        ", ": null
    },
    {
        "tycoon": "tycoon"
    },
    {
        ", ": null
    },
    {
        "plutocrat": "plutocrat"
    },
    {
        ", and general ": null
    },
    {
        "villain": "villain"
    },
    {
        ", he rarely sees any problem with breaking the law, cheating, or using other unfair tactics in order to fulfill his goal of becoming the worlds richest duck. That makes him a broken mirror of Scrooge McDuck, whose own avarice is usually tempered with kindness or charity.      Glomgold first appeared in  The Second-Richest Duck , first published in September 42 In this story, Scrooge, who holds the title of the Richest Duck in the World, learns that a businessman from the valley of the ": null
    },
    {
        "Limpopo": "limpopo"
    },
    {
        ", South Africa has also claimed this title. Scrooge decides to confront this claimant to his title and travels to South Africa along with his nephew ": null
    },
    {
        "Donald": "donald duck"
    },
    {
        " and his great-nephews ": null
    },
    {
        "Huey, Dewey and Louie": "huey, dewey and louie"
    },
    {
        " Duck": "duck family"
    },
    {
        ". The rest of the story concentrates on comparing and contrasting the two rivals during a race through The Heart of Africa , by seeing who has the largest ball of string, because they are shown equal in everything else, from cash to gold mines to even who has the most pumpkins. The race is supposed to determine which one of them deserves the title.     The two characters resemble each other both in appearance and behavior though their main common point seems to be that they are extremely competitive, and neither of them can accept the idea of someone else being equal or superior to them. Flintheart, like Scrooge, keeps a percentage of his fortune in his own Money Bin, identical to that of Scrooge , while the rest of his fortune is invested in a worldwide financial empire of his own that equals that of Scrooge, although Scrooges main sources of wealth are his industries, while Flinthearts are his diamond mines.     However, the main difference between them seems to be their way of life. Scrooges Money Bin is at the center of ": null
    },
    {
        "Duckburg": "duckburg"
    },
    {
        ", ": null
    },
    {
        "Calisota": "calisota"
    },
    {
        ", United States, a constantly expanding industrial city, while Flinthearts is in the center of a valley, located somewhere in the lands around Limpopo, surrounded by wildlife and away from human activities. While Scrooge finds himself surrounded by an extended family  and a large number of allies and rivals , Flintheart lives a life of solitude and seems to have no family, friends or for that matter rivals except Scrooge himself. While Scrooge has his nephews helping him or advising him, Flintheart faces every situation alone. This appears to have hardened him – he is considerably more ruthless than Scrooge – but also leaves him vulnerable to being simply outnumbered by his rivals. Even at the end of the story, when Scrooge has won and Flintheart passes out after finding he is only second best, he has to be carried home by Huey, Louie and Dewey because he has no one else to help him.     The solitary South African re-appeared to challenge Scrooge to a rematch in  The Money Champ , first published in September 42 This time the confrontation takes place in Scrooges grounds in Duckburg with the citys population witnessing the event, and they only count their wealth in cash and not their investments, so they have to liquidate much of their fortunes. Flintheart uses a number of underhand plots against Scrooge, but his plans backfire when their cost in money also costs Flintheart his chance at victory. The story adds little to what was established in the previous one. However, for the first time, some panels concentrate on Flinthearts thoughts, revealing that his insecurities about his own worth are the driving force behind both his efforts to best Scrooge and his dishonest tactics, , and that Flintheart believes said tactics are betrayals of his dear old mothers fondest hopes .     Barks would use Flintheart for a third and last time in  So Far and no Safari , first published in January 42 This was one of the last stories Barks created before his retirement. The themes of the story are considerably darker than the two previous ones. Flinthearts intentions towards Scrooge are clearly depicted as murderous. The story starts with Scrooge planning to participate in an auction for an old South African ": null
    },
    {
        "gold mine": "gold mine"
    },
    {
        ". It is considered exhausted but Scrooges mechanics believe that the main vein of gold hasnt even been reached. While Scrooge is piloting his private plane over South Africa, with Donald, Huey, Dewey and Louie as passengers, Flintheart appears piloting his own plane. It is equipped with machine guns, with which he shoots down Scrooge. While Scrooge is still trying to reach the auction, Flintheart repeatedly tries to get rid of him.     When Scrooge manages to reach the ": null
    },
    {
        "Kalahari Desert": "kalahari desert"
    },
    {
        ", Flinthearts plane is revealed to be a bomber as well. Flintheart bombards Scrooge and his nephews, but misses. When he returns for a second bombing run, the Ducks have dressed some rocks with their clothing and have taken cover elsewhere. Flintheart mistakes the rocks for his targets and destroys them, noting that his rivals are now dinner for the jackals. His victory is short-lived, however. Because he was flying low, the bomb explosions damaged his planes fuel tank. He crash-lands the plane and finds himself in no better condition than Scrooge. The rest of the story presents Scrooges and Flinthearts rival efforts to cross the Kalahari and reach the auction. The end of the story finds them at the auction, tired from their difficult treks, but still rivaling each other, while an exhausted Donald has fallen asleep. It is considered Flinthearts darkest appearance and among his strongest and most memorable ones.       During the ten years that followed his creators retirement the character made infrequent appearances, appearing only in four comic book stories. He wasnt nearly as recognizable as other rivals of Scrooge, like Italian sorceress ": null
    },
    {
        "Magica DeSpell": "magica despell"
    },
    {
        ", who appeared far more often. Flintheart returned to prominence in 42 when ": null
    },
    {
        "Egmont": "egmont group"
    },
    {
        " editors Lars Bergström and ": null
    },
    {
        "Stefan Printz-Påhlson": "stefan printz-påhlson"
    },
    {
        " decided to revive the character. Since then Flintheart Glomgold has appeared in more than 42 Egmont stories, some of which depict him as an influential member of Duckburgs Billionaires Club .      In ": null
    },
    {
        "Werner Wejp-Olsen": "werner wejp-olsen"
    },
    {
        " and ": null
    },
    {
        "Daniel Branca": "daniel branca"
    },
    {
        "s 42 comic book story The Top Treasure in Town Flinthearts grandfather Stoneheart Glomgold, who in 42 worked as a ": null
    },
    {
        "hansom cab": "hansom cab"
    },
    {
        " driver in London, is introduced. In ": null
    },
    {
        "John Lustig": "john lustig"
    },
    {
        " and ": null
    },
    {
        "Vicars": "vicar"
    },
    {
        " comic book story Family of Fore it was stated that both he and Scrooge are distantly related to by then deceased Scottish golf enthusiast Bogey McDivot. McDivot has only been mentioned in that story. In Lars Jensen and Vicars 42 comic book story Happy Birthday, Flintheart Glomgold , Glomgolds nephew Slackjaw Snorehead is introduced. Slackjaw is a genial ": null
    },
    {
        "slacker": "slacker"
    },
    {
        "; very friendly and cheerful as well as a genius with a talent for business. He does however prefer to hang around with his friends to do nothing all day rather than use his intellect productively, which is very infuriating to Glomgold. In the English translation Slackjaw at times uses South African slang . In Lars Jensen and ": null
    },
    {
        "Marco Rota": "marco rota"
    },
    {
        "s 42 story The Glomgold Heritage , Flinthearts father, Brickheart Glomgold, and mother appeared briefly. It is also revealed in that story that Flinthearts grandfather Stoneheart was a Scotsman who moved to London and later on, together with his son Brickheart, traveled to South Africa after being wrongly accused for theft. From this experience the Glomgolds learned that the world was unfair and cruel, and that they had to look out for themselves even if that meant acting outside the law. In the 42 ": null
    },
    {
        "DuckTales": "ducktales"
    },
    {
        " comic book story The Smart Nephew by ": null
    },
    {
        "Bob Gregory": "bob gregory"
    },
    {
        ", ": null
    },
    {
        "Cosme Quartieri": "cosme quartieri"
    },
    {
        " and ": null
    },
    {
        "Jorge Sanchez": "jorge sanchez"
    },
    {
        ", another nephew of Glomgold appears: the smart and brave Junior.       In 42 ": null
    },
    {
        "Keno Don Rosa": "keno don rosa"
    },
    {
        " created his first Scrooge McDuck story, ": null
    },
    {
        "The Son of the Sun": "the son of the sun"
    },
    {
        " , first published in July 42 Rosas detailed style of drawing, references to Barks stories like ": null
    },
    {
        "Lost in the Andes!": "lost in the andes!"
    },
    {
        " , detailed references to often obscure historical figures and events and strong characterization would later make Rosa fans consider him one of Barks most popular successors . Those themes are all evident in his first story. It begins with Flintheart questioning Scrooges many successes as a treasure-hunter. He claims that discovering riches that are already concentrated by others is not that hard and that he could do it better than Scrooge if he decided to try. Soon he is following Scrooge and his nephews in their latest treasure hunt, locating a hidden temple of ": null
    },
    {
        "Manco Cápac": "manco cápac"
    },
    {
        ", who was the legendary founder of the ": null
    },
    {
        "Inca": "inca"
    },
    {
        " dynasty. The temple is hidden somewhere in the tops of the Andes and according to inscriptions earlier found by Scrooge supposed to contain a great treasure. In the course of the story Flintheart is shown to be one of Scrooges most charismatic, resourceful and ruthless rivals.     Rosa, who admits to have a soft spot for the character, has used Flintheart in a growing number of stories and has offered him a sort of origin. In his stories Flintheart is a ": null
    },
    {
        "Boer": "boer"
    },
    {
        " from the province of ": null
    },
    {
        "Transvaal": "transvaal province"
    },
    {
        ". He was born around the same time as Scrooge and first met him during the Gold Rush of 42 . Like Scrooge, Flintheart was born in poverty and was working his way up the financial ladder. While unsuccessfully searching for diamonds, he attempted to steal the findings of more successful fellow miners. As a result, he was tied to the horns of a water buffalo and the animal was then sent running. Flintheart was found and saved by Scrooge. Flintheart offered to be the guide of the recently arrived gold miner from ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", since he knew the territory. Scrooge accepted him as a needed companion and friend. But at night while Scrooge was sleeping, Flintheart stole his ox-cart along with all his equipment and supplies and left him alone in the wilderness. Having underestimated Scrooge, he was surprised when Scrooge caught up to him, furious and vengeful. When Scrooge finished with him, Flintheart was publicly humiliated, thoroughly embittered and imprisoned for theft. The two rivals made vows to themselves that helped shape some of their character traits. Scrooge vowed to never trust anybody ever again, in order not to be betrayed again. Apparently this is the source of Scrooges distrust towards others whether they are allies, rivals or complete strangers and the reason he is secretive about his thoughts and emotions. On the other hand, a completely defeated Flintheart vowed that he will work to become so rich that nobody can humiliate him again . Because Scrooge officially meets Glomgold for the first time in The second richest Duck in 42 Don Rosa makes sure Glomgolds name is never mentioned in his tale. Since Glomgold gets Scrooges name, some fans could think hes more interested in defeating and humiliating Scrooge as a revenge for getting imprisoned rather than becoming the worlds richest duck. According to Rosas unofficial timelines it would take him twenty years of hard work as a diamond miner till finally he became rich in 42 by his profits. He would spend the next fifty years working his way up the financial ladder both by hard efforts and dishonest methods when needed.     Don Rosa also revealed in at least two stories another thing that makes Flintheart a ": null
    },
    {
        "counterpart": "wikt:counterpart"
    },
    {
        " to Scrooge: the ": null
    },
    {
        "Number One Rand": "number one rand"
    },
    {
        ", the first coin Flintheart Glomgold ever earned . In ": null
    },
    {
        "Return to Plain Awful": "return to plain awful"
    },
    {
        ", this ": null
    },
    {
        "rand": "south african rand"
    },
    {
        " makes his first appearance, a cameo, and has nothing to do with the story, alongside a framed ": null
    },
    {
        "pound note": "banknotes of the pound sterling"
    },
    {
        " labelled as Glomgolds No. 42 Pound and a diamond under a glass dome labelled as My First Diamond . In ": null
    },
    {
        "A Little Something Special": "a little something special"
    },
    {
        ", the Rand makes an equally small but more relevant role. ": null
    },
    {
        "Magica De Spell": "magica de spell"
    },
    {
        " teamed up with him and ": null
    },
    {
        "the Beagle Boys": "the beagle boys"
    },
    {
        " to get the ": null
    },
    {
        "Number One Dime": "number one dime"
    },
    {
        ". Scrooge reminds Magica he will no longer be the richest duck in the world after they steal his fortune and the Dime will be worthless to her. Based on the advice Scrooge gives her in exchange for his dime back, Magica steals Flinthearts first rand. To make things worse for Glomgold, Magica takes the ": null
    },
    {
        "Beagle Boys": "beagle boys"
    },
    {
        " with her to the Valley of ": null
    },
    {
        "Limpopo": "limpopo"
    },
    {
        " and they carry all they can of Flinthearts cash. Despite the fact he teamed up with them in that story against Scrooge, he still dares to ask what did he do to deserve that.     Notable is the fact that Flintheart Glomgolds first coin could not be a rand because the ": null
    },
    {
        "South African Rand": "south african rand"
    },
    {
        " did not come into existence until 42 Before a ": null
    },
    {
        "unified South Africa": "union of south africa"
    },
    {
        " in 42 , many authorities in the region issued coins and banknotes in their own currencies, often equivalent to the Pound Sterling of the ": null
    },
    {
        "Cape of Good Hope": "cape of good hope"
    },
    {
        " colony that had existed since 42 Adding it to the fact that Don Rosas stories usually take place in the 42s, it means it would be impossible for anyone to own a rand in such stories.          An animated version of the character appeared in the TV series  DuckTales , which started airing on September 42 42 The Second Richest Duck was among the series most prominent characters, and this helped his introduction to a wider audience. But some drastic changes came to the character. His Scottish ancestry was emphasised over his nationality, which is never mentioned due to the then deteriorating political situation in South Africa and he was depicted as wearing a traditional Scottish ": null
    },
    {
        "kilt": "kilt"
    },
    {
        ". His voice actor ": null
    },
    {
        "Hal Smith": "hal smith"
    },
    {
        " gave him an unidentifiable generic accent instead of a South African accent. His place of residence was also changed from Limpopo to Duckburg. The previously unaffiliated ": null
    },
    {
        "Beagle Boys": "beagle boys"
    },
    {
        " were now depicted as working for him on an occasional basis. In Attack of the Metal Mites , Glomgold sends the metal mites to eat whole money from Scrooges bin. Glomgold almost succeeds when ": null
    },
    {
        "Fenton Crackshell": "fenton crackshell"
    },
    {
        " stopped the metal mites and the last ones retrieved by Dijon spread in Glomgolds office. The biggest humiliation of all this is the fact Scrooge finds a way to earn honest money with the metal mites captured by Fenton. In the two-part series finale The Golden Goose Glomgold almost beats Scrooge at being the worlds richest duck with the help of the Golden Goose, until he gets turned into gold himself.     Glomgold is also a recurring ": null
    },
    {
        "antagonist": "antagonist"
    },
    {
        " in the DuckTales comic book series, notably the series  Scrooges Quest . In the final chapter of that series, All That Glitters Is Not Glomgold, Glomgold has taken advantage of Scrooges long absence and distraction to buy out all of Scrooges assets and seize control of Duckburg. While Scrooge was a more benevolent businessman, Glomgold is determined to soak the citys people for as much money as he can, charging exorbitant prices for food and services, while keeping their lives as closely regimented as possible. Scrooge cannily uses Glomgolds own ": null
    },
    {
        "paranoia": "paranoia"
    },
    {
        " against him, wandering around town, making apparently innocuous inspections of Glomgolds businesses, and causing Glomgold to tear apart his own holdings, looking for Scrooges sabotage. By the end of the comic, Glomgold has destroyed all of his assets in Duckburg, and Scrooge has regained his own fortune. As Scrooge explains to his nephews, Glomgold is so evil and sneaky that he thinks everyone is as evil and sneaky as he is. Yet in the final pages of the comic, Glomgold seems to be perfectly content, living in a wooden shanty in Duckburgs slums, sharing a meager meal with one of his former clerks. As Glomgold explains, now that he has nothing left, theres nothing further that Scrooge can do to him, and Glomgold is looking forward to making himself rich again, since making a fortune is much more satisfying than having one. In this he reflects much of Scrooges own philosophy.     In the ": null
    },
    {
        "Disney": "walt disney"
    },
    {
        " series  Darkwing Duck  episode ": null
    },
    {
        "In Like Blunt": "in like blunt"
    },
    {
        " , Glomgold makes a cameo appearance-along with the ": null
    },
    {
        "Beagle Boys": "beagle boys"
    },
    {
        " and ": null
    },
    {
        "Magica De Spell": "magica de spell"
    },
    {
        "-as a bidder for the secret ": null
    },
    {
        "S.H.U.S.H.": "s.h.u.s.h."
    },
    {
        " agent list.     Flintheart also appears in the 42  DuckTales  video game for the ": null
    },
    {
        "Nintendo Entertainment System": "nintendo entertainment system"
    },
    {
        " . After Scrooge completes all the regular levels, Flintheart challenges him to a race in which the winner will take all of the treasure Scrooge has acquired. Glomgold also appears in the 42 video game sequel  DuckTales 42 , also for the NES, once again trying to obtain the treasures that Scrooge had collected and also kidnaps Webby in order to get Scrooge to hand over the treasure. When he does Glomgold is revealed to be the final boss the D42 In  DuckTales: Remastered , Glomgold is voiced by ": null
    },
    {
        "Brian George": "brian george"
    },
    {
        " , and his role is greatly expanded. In Remastered, Glomgold attacks Scrooge in the Himalayas, attempting to shoot Launchpad out of the skies, but is thwarted by Scrooge. He appears again on the Moon, attempting to collect the Green Cheese of Longevity before Scrooge does. Later, he forms an uneasy alliance with Scrooge to help him rescue his nephews from Magica De Spell, but later reveals that he was in cahoots with her all along in order to get Scrooges Number One Dime from him for her own purposes. As in the original, Scrooge must race Glomgold and Magica in order to reclaim his Number One Dime in the end. Glomgold appeared in Ducktales: Scrooges Loot, and also as Boss in the RPG card game titled The Duckforce Rises for the Android and iOS.     Glomgold is the main antagonist in the PC game  DuckTales: The Quest for Gold . In the intro scene, he barges into Scrooges office, lamenting about he is tired being the second richest duck in the world, and challenges Scrooge to a wealth contest sponsored by Dime Magazine: in the next 42 days, the one who collects the most treasure shall be the Duck of the Year. The contest is held in the Isle of Macaroon, which is a homage to the four-parter Catch as Cash Can episode, except that the contest gives 42 days, not 42 Just like in the episodes, Glomgold hires the Beagle Boys against Scrooge and his nephews, and will constantly try to race Scrooge to the treasure locations, or snatching treasure from other locations. The ultimate goal of the game is to collect more money, thus, beating Glomgold and becoming Duck of the Year.     Glomgold appeared on the 42 list of the  Forbes Fictional 42 , a compilation of the wealthiest characters in fiction. A ": null
    },
    {
        "spike in the price of gold": "gold as an investment"
    },
    {
        " during the late 42s and early 42s allowed Glomgold to become the second-wealthiest fictional character. His nemesis, Scrooge McDuck , surpassed him in the 42 list, in which Glomgold did not appear.     Glomgold, now voiced by ": null
    },
    {
        "Keith Ferguson": "keith ferguson"
    },
    {
        ", returns as Scrooges nemesis in the ": null
    },
    {
        "42 reboot": "ducktales"
    },
    {
        " of DuckTales. Glomgold also now appears much stouter than in previous versions, however, his outfit and personality remains relatively unchanged from the 42 version. In this version, it is implied Glomgold is South African but pretends to be Scottish in order to outdo ": null
    },
    {
        "Scrooge McDuck": "scrooge mcduck"
    },
    {
        ".  This is confirmed in The Ballad of Duke Baloney! , where its revealed that Glomgold was born Duke Baloney, a shoeshine boy who did Scrooges shoes and given a dime as payment to teach him self-reliance; only for him to instead feel cheated and create his Glomgold persona over the years to get revenge.       A few years prior to Flinthearts debut, another character was described as the Worlds Second-Richest Duck. His only appearance took place in Carl Barks story Turkey With All the Schemings . In that story, ": null
    },
    {
        "Donald Duck": "donald duck"
    },
    {
        " found himself unable to afford a Christmas dinner and decided to trick ": null
    },
    {
        "Scrooge McDuck": "scrooge mcduck"
    },
    {
        " into paying for dinner for him. To do so, Donald posed as a ": null
    },
    {
        "South-American": "south america"
    },
    {
        " businessman named Petrolio de Vaselino and had Scrooge take him to the Ritz. While eating dessert, Donald accidentally ate his phony moustache, making him look like the Duke of Baloni, described by Scrooge as the Worlds Second-Richest Duck. By coincidence, Scrooge had a newspaper article talking about the Duke visiting ": null
    },
    {
        "Duckburg": "duckburg"
    },
    {
        ". The fact Scrooge remained willing to make business with him suggests the Duke never claimed to be richer than him. Not much else is known about the real Duke since he just made a cameo at the beginning of the last page and his only purpose in the story was cluing Scrooge to the fact he was dealing with an imposter. After removing Donalds wig, Scrooge was determined to make Donald pay. He asked the waiter if the restaurant was for sale and was given a price of one million dollars. In a surprising move, as he had spent the whole last night trying to make sure Donald wouldnt leave and force him to pay the bill, Scrooge quickly pulled the required amount from his pockets and bought the restaurant. Donald then was forced to wash the dishes to pay the bill. It is never said when Flintheart became richer than the Duke or if the two ever met. However, this is homaged in the 42 DuckTales animated series, where it is revealed that Duke Baloney is Flinthearts birth name.                                                                 ": null
    },
    {
        "de:Liste der Bewohner EntenhausensMac Moneysac": "de:liste der bewohner entenhausensmac moneysac"
    }
]