[
    {
        "   The flipper is the name of a particular ": null
    },
    {
        "bowling": "bowling"
    },
    {
        " delivery used in ": null
    },
    {
        "cricket": "cricket"
    },
    {
        ", generally by a ": null
    },
    {
        "leg spin": "leg spin"
    },
    {
        " bowler": "bowler"
    },
    {
        ". In essence it is a back spin ball. Squeezed out of the front of the hand with the thumb and first and second fingers, it keeps deceptively low after pitching and can accordingly be very difficult to play. The flipper is comparable to a ": null
    },
    {
        "riseball": "riseball"
    },
    {
        " in fast-pitch softball.     By putting ": null
    },
    {
        "backspin": "backspin"
    },
    {
        " on the ball the ": null
    },
    {
        "Magnus effect": "magnus effect"
    },
    {
        " results in air travelling over the top of the ball quickly and cleanly whilst air travelling under the ball is turbulent. The lift produced means that the ball drops slower and travels further than a normal delivery. The slower descent also results in the ball bouncing lower.     The flipper is bowled on the opposite side to a slider, much in the same way that the top-spinner is bowled. On release, the bowler pinches or clicks the thumb and forefinger, causing the ball to come out underneath the hand. There must be sufficient tension in the wrist and fingers to impart a good helping of backspin or underspin. In doing so the flipper will float on towards the ": null
    },
    {
        "batsman": "batsman"
    },
    {
        " and land on a fuller length than he anticipated, often leaving him caught on the back foot when he wrongly assumes it to be a pullable or a cuttable ball. The back spin or underspin will cause the ball to hurry on at great pace with very little bounce, though this may be harder to achieve on softer wickets. A series of normal leg spinners or ": null
    },
    {
        "topspinner": "topspinner"
    },
    {
        "s, with their dropping looping flight, will have the batsman used to the ball pitching on a shorter length. The batsman may wrongly assume that the flipper will drop and loop like a normal overspinning delivery, resulting in the ball pitching under the bat and going on to either hit the stumps or result in ": null
    },
    {
        "leg before wicket": "leg before wicket"
    },
    {
        ".     Much of the effectiveness of the flipper is attributable to the pop , that is, the extra pace and change in trajectory that is imparted to the ball when it is squeezed out of the bowlers hand.     Occasionally, the term flipper has been used to describe other types of deliveries. The Australian leg spinner ": null
    },
    {
        "Bob Holland": "bob holland"
    },
    {
        " employed a back spinning ball that he simply pushed backwards with the heel of his palm. Sometimes this form of front-hand flipper is called a zooter . It is easier to bowl but not as effective as the amount of backspin is much less.       It was reputedly invented by the Australian leg-spinner ": null
    },
    {
        "Clarrie Grimmett": "clarrie grimmett"
    },
    {
        ". Grimmett became so enamoured with the delivery that at times he bowled it almost as frequently as his stock leg break. The great ": null
    },
    {
        "Don Bradman": "don bradman"
    },
    {
        " once remarked to Grimmett that he must have forgotten how to bowl a leg break, as he bowled so many flippers. Bradman was bowled shortly thereafter at a memorial match by Grimmett who produced a perfectly pitched stock ball that turned just enough to remove Bradmans off bail. There yare Don, I told you I could bowl a leg break was Grimmetts alleged response.     The flipper was the signature delivery of ": null
    },
    {
        "Anil Kumble": "anil kumble"
    },
    {
        " of India and the Australian leg-spinner ": null
    },
    {
        "Shane Warne": "shane warne"
    },
    {
        " in his earlier years, until injury and later shoulder surgery restricted his ability to bowl flippers accurately. Like the googly, it may become more difficult to bowl as a bowler ages due to the flexibility and suppleness it demands from the bowlers wrist.     It is difficult to disguise the flipper entirely when bowling, as the hand action is distinctly different from a leg break. When Clarrie Grimmett first began bowling the delivery, batsmen would listen for the telltale clicking sound of his fingers; to compensate, Grimmett would often click the fingers of his non-bowling hand when not bowling the flipper to confuse the batsman.     ": null
    },
    {
        "Abdul Qadir ": "abdul qadir"
    },
    {
        " of Pakistan achieved great success with the flipper making it one of his signature deliveries, along with him ": null
    },
    {
        "Shane Warne": "shane warne"
    },
    {
        " was also arguably the leading exponent of the flipper in more recent times. ": null
    },
    {
        "Anil Kumble": "anil kumble"
    },
    {
        " of India used the flipper well to his advantage. ": null
    },
    {
        "Brad Hogg": "brad hogg"
    },
    {
        " of Australia has also used the flipper with great success in ": null
    },
    {
        "Limited Overs Cricket": "one day international"
    }
]