[
    {
        "Floor Leaders, also known as a caucus leader, are leaders of their political parties in a body of a ": null
    },
    {
        "legislature": "Legislature"
    },
    {
        ".       In the Philippines each body of the bicameral ": null
    },
    {
        "Philippine Congress": "Philippine Congress"
    },
    {
        " has a minority floor leader and a majority floor leader. For the ": null
    },
    {
        "Philippine Senate": "Philippine Senate"
    },
    {
        ", there is the ": null
    },
    {
        "Majority Floor Leader of the Senate of the Philippines": "Majority Floor Leader Of The Senate Of The Philippines"
    },
    {
        " and the ": null
    },
    {
        "Minority Floor Leader of the Senate of the Philippines": "Minority Floor Leader Of The Senate Of The Philippines"
    },
    {
        ". For the ": null
    },
    {
        "Philippine House of Representatives": "Philippine House Of Representatives"
    },
    {
        " there is the ": null
    },
    {
        "Majority Floor Leader of the House of Representatives of the Philippines": "Majority Floor Leader Of The House Of Representatives Of The Philippines"
    },
    {
        " and the ": null
    },
    {
        "Minority Floor Leader of the House of Representatives of the Philippines": "Minority Floor Leader Of The House Of Representatives Of The Philippines"
    },
    {
        ". They do not represent political parties but rather political groupings within each body.           In the ": null
    },
    {
        "United States Senate": "United States Senate"
    },
    {
        ", they are elected by their respective party conferences to serve as the chief Senate spokespeople for their parties and to manage and schedule the legislative and executive business of the Senate. By custom, the ": null
    },
    {
        "Presiding Officer": "Presiding Officer Of The United States Senate"
    },
    {
        " gives the floor leaders priority in obtaining recognition to speak on the ": null
    },
    {
        "floor": "Floor"
    },
    {
        " of the Senate.     In the Senates two-party system, the floor leaders are the spokespeople from both major parties, elected by their parties. As well serve essentially as executives of their parties within the Senate. The Floor Leaders are referred to as the ": null
    },
    {
        "Senate Majority Leader": "Party Leaders Of The United States Senate"
    },
    {
        ", who belongs to the party with the most Senators, and the ": null
    },
    {
        "Senate Minority Leader": "Party Leaders Of The United States Senate"
    },
    {
        ", who belongs to the other major party.       Similar positions exist in the ": null
    },
    {
        "United States House of Representatives": "United States House Of Representatives"
    },
    {
        ", except that role of majority leader normally goes to the second-highest member of the leadership of the majority party, because it traditionally elects its party leader to the position of ": null
    },
    {
        "speaker": "Speaker Of The United States House Of Representatives"
    }
]