[
    {
        "   Florianus , also known as Florian, was ": null
    },
    {
        "Roman Emperor": "roman emperor"
    },
    {
        " in 42 from July to September. He was the maternal half-brother of ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        ", who was proclaimed emperor in late 42 after the unexpected death of Emperor ": null
    },
    {
        "Aurelian": "aurelian"
    },
    {
        ". After Tacitus died in July 42 allegedly assassinated as a consequence of a military plot, Florianus proclaimed himself emperor, with the recognition of the ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        " and much of the empire. However, Florianus soon had to deal with the revolt of ": null
    },
    {
        "Probus": "probus"
    },
    {
        ", who rose up shortly after Florianus ascended the throne, with the backing of the provinces of ": null
    },
    {
        "Egypt": "roman egypt"
    },
    {
        ", ": null
    },
    {
        "Syria": "roman syria"
    },
    {
        ", ": null
    },
    {
        "Palestine": "roman palestine"
    },
    {
        ", and ": null
    },
    {
        "Phoenicia": "roman phoenicia"
    },
    {
        ". Probus took advantage of the terrain of the ": null
    },
    {
        "Cilician Gates": "cilician gates"
    },
    {
        ", and the hot climate of the area, which Florianus army was unaccustomed to, to chip away at their morale. Because of this, in September 42 Florianus army rose up against him and killed him.          In late 42 Florianus maternal half-brother, ": null
    },
    {
        "Tacitus": "marcus claudius tacitus"
    },
    {
        ", was proclaimed Roman Emperor after the unexpected death of Emperor ": null
    },
    {
        "Aurelian": "aurelian"
    },
    {
        ". Soon after, Tacitus appointed Florianus as ": null
    },
    {
        "praetorian prefect": "praetorian prefect"
    },
    {
        ". Tacitus then ordered Florianus to lead troops to ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        ", in order to repel raids into Roman territory by the ": null
    },
    {
        "Goths": "goths"
    },
    {
        ". After Tacitus died suddenly in July 42 allegedly as a consequence of a military plot, Florianus swiftly proclaimed himself emperor, and was recognized as such by the ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        ", and the western provinces. Florianus then continued to campaign against the Goths, winning a major victory before the news reached him of the revolt of ": null
    },
    {
        "Probus": "probus"
    },
    {
        ", who had served successfully as a commander under both Aurelian and Tacitus. Probus revolt was supported by the provinces of ": null
    },
    {
        "Egypt": "roman egypt"
    },
    {
        ", ": null
    },
    {
        "Syria": "roman syria"
    },
    {
        ", ": null
    },
    {
        "Palestine": "roman palestine"
    },
    {
        ", and ": null
    },
    {
        "Phoenicia": "roman phoenicia"
    },
    {
        ".     Despite his military experience, Probus was in a precarious position, as he held the support of only a small part of the Empire, while much of the Empire backed Florianus. Probus also took advantage of his control of Egyptian grain, which he used to swiftly cut off the supply of grain to the rest of the empire. Probus led his troops to ": null
    },
    {
        "Asia Minor": "asia minor"
    },
    {
        ", in order to defend the ": null
    },
    {
        "Cilician Gates": "cilician gates"
    },
    {
        ", allowing him to utilize guerrilla warfare to wage a war of attrition rather than a straightforward confrontation. Florianus led his troops to ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        ", and ": null
    },
    {
        "billeted": "billeted"
    },
    {
        " his forces in ": null
    },
    {
        "Tarsus": "tarsus, mersin"
    },
    {
        ". However many of his troops, who were unaccustomed to the hot climate of the area, fell ill due to a summer heat wave. Upon learning of this, Probus launched raids around the city, in order to weaken the morale of Florianus forces. This strategy was successful, and Florianus lost control of his army, which in September rose up against him and killed him. In total, Florianus reign lasted less than three months.                      ": null
    }
]