[
    {
        "           Flora MacDonald ; was a member of ": null
    },
    {
        "the Macdonalds of Sleat": "clan macdonald of sleat"
    },
    {
        ", who helped ": null
    },
    {
        "Charles Edward Stuart": "charles edward stuart"
    },
    {
        " evade government troops after the ": null
    },
    {
        "Battle of Culloden": "battle of culloden"
    },
    {
        " in April 42 Her family supported the government during the ": null
    },
    {
        "42 Rising": "jacobite rising of 1745"
    },
    {
        " and Flora later claimed to have assisted Charles out of sympathy for his situation.     She was arrested and held in the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        " but released under a general amnesty in June 42 She later married Allan MacDonald and the couple emigrated to ": null
    },
    {
        "North Carolina": "north carolina"
    },
    {
        " in 42 Their support for the British government during the ": null
    },
    {
        "American War of Independence": "american war of independence"
    },
    {
        " meant the loss of their American estates and they returned to Scotland, where Flora died in 42          Flora was born in 42 at ": null
    },
    {
        "Milton": "milton"
    },
    {
        " on the island of ": null
    },
    {
        "South Uist": "south uist"
    },
    {
        " in the ": null
    },
    {
        "Outer Hebrides": "outer hebrides"
    },
    {
        ", third and last child of Ranald MacDonald and his second wife Marion. Her father was a member of the minor gentry, being ": null
    },
    {
        "tacksman": "tacksman"
    },
    {
        " and ": null
    },
    {
        "leaseholder": "leasehold estate"
    },
    {
        " of Milton and ": null
    },
    {
        "Balivanich": "balivanich"
    },
    {
        "; she had two brothers, Angus, who later inherited the Milton tack and Ronald, who died young.     Her father died soon after her birth and in 42 her mother remarried Hugh MacDonald of ": null
    },
    {
        "Armadale, Skye": "armadale, isle of skye"
    },
    {
        ". Flora was brought up by her fathers cousin, Sir Alexander MacDonald of ": null
    },
    {
        "Sleat": "clan macdonald of sleat"
    },
    {
        " and suggestions she was educated in Edinburgh have not been confirmed. While some MacDonalds remained Catholic, particularly in the Islands, her family was part of the ": null
    },
    {
        "Presbyterian": "presbyterian"
    },
    {
        " majority.          Flora was visiting ": null
    },
    {
        "Benbecula": "benbecula"
    },
    {
        " in the Outer Hebrides when ": null
    },
    {
        "Prince Charles": "charles edward stuart"
    },
    {
        " and a small group of aides took refuge there after the ": null
    },
    {
        "Battle of Culloden": "battle of culloden"
    },
    {
        " in June 42 One of his companions, Captain Conn ONeill from ": null
    },
    {
        "County Antrim": "county antrim"
    },
    {
        " was distantly related to Flora and asked for her help.     ": null
    },
    {
        "MacDonald of Sleat": "clan macdonald of sleat"
    },
    {
        " had not joined the ": null
    },
    {
        "Rebellion": "jacobite rising of 1745"
    },
    {
        " and Benbecula was controlled by a pro-government ": null
    },
    {
        "militia": "militia"
    },
    {
        " commanded by Floras step-father, Hugh MacDonald. This connection allowed her to obtain the necessary permits but she apparently hesitated, fearing the consequences for her family if they were caught. She may have been taking less of a risk than it appears; witnesses later claimed Hugh advised the Prince where to hide from his search parties.     Passes were issued allowing passage to the mainland for Flora, a boats crew of six men and two personal servants, including Charles disguised as an Irish maid called ": null
    },
    {
        "Betty Burke": "betty burke"
    },
    {
        ". On 42 June, they landed near Sir Alexanders house at Monkstadt, near ": null
    },
    {
        "Kilbride, Skye": "kilbride, skye"
    },
    {
        ". In his absence, his wife Lady Margaret arranged lodging with her steward, MacDonald of ": null
    },
    {
        "Kingsburgh": "kingsburgh, skye"
    },
    {
        ", who told Charles to remove his disguise, as it simply made him more conspicuous. The next day, Charles was taken from ": null
    },
    {
        "Portree": "portree"
    },
    {
        " to the island of ": null
    },
    {
        "Raasay": "raasay"
    },
    {
        "; Flora remained on Skye and they never met again.      Two weeks later, the boatmen were detained and confessed; Flora and Kingsburgh were arrested and taken to the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        ". After Lady Margaret interceded on her behalf with the chief Scottish legal officer, ": null
    },
    {
        "Duncan Forbes of Culloden": "duncan forbes, lord culloden"
    },
    {
        ", she was allowed to live outside the Tower under the supervision of a Kings Messenger and released after the June 42 ": null
    },
    {
        "Act of Indemnity": "act of indemnity 1747"
    },
    {
        ". Aristocratic sympathisers collected over £42 for her, one of the contributors being ": null
    },
    {
        "Frederick, Prince of Wales": "frederick, prince of wales"
    },
    {
        ", heir to the throne; Flora allegedly told him she helped Charles out of charity and would have done the same for him.     On 42 November 42 at the age of 42 she married Allan MacDonald, a captain in the British army and Kingsburghs eldest son. The couple first lived at ": null
    },
    {
        "Flodigarry": "flodigarry"
    },
    {
        ", Skye and inherited the family estate after Kingsburgh died in 42 The writer ": null
    },
    {
        "Samuel Johnson": "dr. johnson"
    },
    {
        ", who met her in 42 during his visit to the island, described her as a woman of soft features, gentle manners, kind soul and elegant presence . He was also author of the inscription on her memorial at ": null
    },
    {
        "Kilmuir": "kilmuir, skye"
    },
    {
        ": a name that will be mentioned in history, and if courage and fidelity be virtues, mentioned with honour .         Allan MacDonald served in the ": null
    },
    {
        "42th": "114th regiment of foot"
    },
    {
        " and ": null
    },
    {
        "42nd Regiments of Foot": "62nd  regiment of foot"
    },
    {
        " during the 42–42 ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " but was a poor businessman. After quarrelling with his clan chief over rent, he and Flora emigrated to ": null
    },
    {
        "Anson County, North Carolina": "anson county, north carolina"
    },
    {
        " in 42 where they settled on an estate near Mountain Creek, named Killegray. When the ": null
    },
    {
        "American War of Independence": "american war of independence"
    },
    {
        " began in 42 Allan raised the Anson Battalion of the Loyalist North Carolina Militia, a total of around 42 men, including his sons Alexander and James. En route to the coast for collection by British transports, they were attacked by an American force at the ": null
    },
    {
        "Battle of Moores Creek Bridge": "battle of moores creek bridge"
    },
    {
        " on 42 February 42 and Allan was taken prisoner.      In April 42 the ": null
    },
    {
        "North Carolina Provincial Congress": "north carolina provincial congress"
    },
    {
        " confiscated Loyalist-owned property and Flora was evicted from Killegray, with the loss of all her possessions. Meyer, p.42 After 42 months in captivity, Allan was released in September 42; he was posted to ": null
    },
    {
        "Fort Edward, Nova Scotia": "fort edward"
    },
    {
        " as commander of the ": null
    },
    {
        "42th Regiment of Foot": "84th regiment of foot"
    },
    {
        " where Flora joined him in August 42          After a harsh winter in ": null
    },
    {
        "Halifax, Nova Scotia": "halifax, nova scotia"
    },
    {
        ", in September 42 Flora took passage for London in the Dunmore, a British ": null
    },
    {
        "privateer": "privateer"
    },
    {
        "; during the voyage, she broke her arm and ill-health delayed her return to Scotland until spring 42     She spent the next few years living with various family members, including ": null
    },
    {
        "Dunvegan": "dunvegan"
    },
    {
        ", home of her son-in-law Major General Alexander Macleod, the largest landowner in Skye after the MacDonalds. The compensation received for the loss of their North Carolina estates was insufficient to allow them to settle in Nova Scotia and Allan returned to Scotland in 42 Since Kingsburgh was now occupied by Floras half-sister and her husband, Flora and Allan settled on the nearby tack of Penduin.     She died in 42 at the age of 42 and was buried in ": null
    },
    {
        "Kilmuir": "kilmuir, skye"
    },
    {
        " Cemetery, her husband following in September 42 They had seven surviving children, two daughters and five sons, two of whom were lost at sea in 42 and 42; a third son John made his fortune in India, enabling his parents to spend their last years in some comfort.          Traditional portrayals of the escape focus on Charles, Flora being relegated to a secondary role and receiving less credit than is her due. She rarely spoke of the episode and her last contact with Charles was when they parted ways at Portree; it appears at least one motive was that his presence endangered her family.     The ": null
    },
    {
        "Victorians": "victorian era"
    },
    {
        " created a Scottish cultural identity expressed through tartans, the late 42th-century inventions of ": null
    },
    {
        "Burns Suppers": "burns suppers"
    },
    {
        " and ": null
    },
    {
        "Highland Games": "highland games"
    },
    {
        ", and the co-option of romantic icons like ": null
    },
    {
        "Mary, Queen of Scots": "mary, queen of scots"
    },
    {
        " and Bonnie Prince Charlie. In 42 Flora took her place in this pantheon with the publication of an alleged Autobiography; ": null
    },
    {
        "ghost-written": "ghostwriter"
    },
    {
        " by her granddaughter Flora Frances Wylde, this contains so many errors it could not have been written by her. Repeated by Charles Ewald in his 42 book The Life and Times of Prince Charles Edward, it remains the basis for many popular perspectives on her life and motivations.     In 42 ": null
    },
    {
        "Sir Harold Boulton": "sir harold boulton, 2nd baronet"
    },
    {
        " wrote an adaptation of an existing melody which he named ": null
    },
    {
        "The Skye Boat Song": "the skye boat song"
    },
    {
        ". This was soon followed by the first performance of the ": null
    },
    {
        "Scottish highland dance": "scottish highland dance"
    },
    {
        " Flora MacDonalds Fancy , while a bronze statue was erected at ": null
    },
    {
        "Inverness Castle": "inverness castle"
    },
    {
        " in 42  The ": null
    },
    {
        "Flora Macdonald Academy": "flora macdonald college"
    },
    {
        " in ": null
    },
    {
        "Red Springs, North Carolina": "red springs, north carolina"
    },
    {
        " is named after her; until 42 it was also the site of the ": null
    },
    {
        "North Carolina Highland Games": "scotland county  highland games"
    },
    {
        ".     Flora was painted several times by Scottish portrait artist ": null
    },
    {
        "Allan Ramsay": "allan ramsay"
    },
    {
        " , the majority of which were destroyed. The one used in this article was done after her release from the Tower in 42–42; in 42 a previously unrecorded painting, allegedly also by Ramsay, was discovered in Florida.      Fictional portrayals include;     ": null
    },
    {
        "Inglis Fletcher": "inglis fletcher"
    },
    {
        ", The Scotswoman ; a novel based on Flora MacDonalds life in North Carolina during the American War of Independence;    Highlander: The Series ; in the 42rd-season episode, Take Back the Night , Ceirdwyn, an Immortal, is living under the name Flora MacDonald when Charles and his party stop on their way to the coast, seeking a boat to France;    A Breath of Snow and Ashes ; the 42th book of ": null
    },
    {
        "Diana Gabaldon": "diana gabaldon"
    },
    {
        "s ": null
    },
    {
        "The Outlander": "outlander series"
    },
    {
        " series, the episode features an account of Flora MacDonalds arrival in the American colonies.     In the 42 film ": null
    },
    {
        "Bonnie Prince Charlie": "bonnie prince charlie"
    },
    {
        ", Flora is portrayed by ": null
    },
    {
        "Margaret Leighton": "margaret leighton"
    },
    {
        ", with ": null
    },
    {
        "David Niven": "david niven"
    }
]