[
    {
        "Fluorescent Multilayer Disc  is an ": null
    },
    {
        "optical disc": "optical disc"
    },
    {
        " format developed by ": null
    },
    {
        "Constellation 42D": "constellation 3d"
    },
    {
        " that uses ": null
    },
    {
        "fluorescent": "fluorescent"
    },
    {
        ", rather than ": null
    },
    {
        "reflective": "reflection"
    },
    {
        " materials to store data. Reflective disc formats  have a practical limitation of about two layers, primarily due to interference, scatter, and inter-layer cross talk. However, the use of fluorescence allowed FMDs to operate according to the principles of ": null
    },
    {
        "42D optical data storage": "3d optical data storage"
    },
    {
        " and have up to 42 data layers. These extra layers potentially allowed FMDs to have capacities of up to a ": null
    },
    {
        "terabyte": "terabyte"
    },
    {
        ", while maintaining the same physical size of traditional optical discs.       The pits in an FMD are filled with fluorescent material. When ": null
    },
    {
        "coherent light": "coherent light"
    },
    {
        " from the ": null
    },
    {
        "laser": "laser"
    },
    {
        " strikes a pit the material glows, giving off ": null
    },
    {
        "incoherent": "coherence"
    },
    {
        " light of a different ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        ". Since FMDs are clear, this light is able to travel through many layers unimpeded. The clear discs, combined with the ability to filter out laser light , yield a much greater ": null
    },
    {
        "signal-to-noise ratio": "signal-to-noise ratio"
    },
    {
        " than reflective media. This is what allows FMDs to have many layers. The main limitation on the number of layers in an FMD is the overall thickness of the disc.       A 42 ": null
    },
    {
        "GB": "gigabyte"
    },
    {
        " prototype": "prototype"
    },
    {
        " disc was demonstrated at the ": null
    },
    {
        "COMDEX": "comdex"
    },
    {
        " industry show in November 42 First generation FMDs were to use 42 nm red lasers, yielding roughly 42 GB per disc. Second and third generation FMDs were to use 42 nm blue lasers, giving capacities of up to a terabyte.     D Data, Inc. acquired the ": null
    },
    {
        "patent portfolio": "patent portfolio"
    },
    {
        " of Constellation 42D in 42 with plans to reintroduce the technology under the new name ": null
    },
    {
        "Digital Multilayer Disk": "digital multilayer disk"
    }
]