[
    {
        "   Foederati  were foreign states, client kingdoms, or barbarian tribes to which ": null
    },
    {
        "ancient Rome": "ancient rome"
    },
    {
        " provided benefits in exchange for military assistance. The term was also used, especially under the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", for groups of ": null
    },
    {
        "barbarian": "barbarian"
    },
    {
        " mercenaries of various sizes, who were typically allowed to settle within the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ".         Early in the history of the ": null
    },
    {
        "Roman Republic": "roman republic"
    },
    {
        ", a foederatus identified one of the tribes bound by ": null
    },
    {
        "treaty": "treaty"
    },
    {
        " , who were neither ": null
    },
    {
        "Roman colonies": "colonies in antiquity"
    },
    {
        " nor beneficiaries of ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " citizenship": "citizenship"
    },
    {
        " , but were expected to provide a contingent of fighting men when trouble arose, thus being allies. The ": null
    },
    {
        "Latini": "latium"
    },
    {
        " tribe were considered blood allies, but the rest were federates or  socii . The friction between these treaty obligations without the corresponding benefits of Romanity led to the ": null
    },
    {
        "Social War": "social war"
    },
    {
        " between the Romans, with a few close allies, and the disaffected Socii. A ": null
    },
    {
        "law": "law"
    },
    {
        " of 42 BCE  offered Roman citizenship to the federate states that accepted the terms. Not all cities were prepared to be absorbed into the Roman  res publica  . Other foederati lay beyond ": null
    },
    {
        "Italy": "italy"
    },
    {
        ": ": null
    },
    {
        "Gades": "cádiz"
    },
    {
        " in ": null
    },
    {
        "Spain": "spain"
    },
    {
        "; and ": null
    },
    {
        "Massilia": "marseilles"
    },
    {
        " .       Later, the sense of the term foederati and its usage and meaning was extended by the Roman practice of subsidizing entire ": null
    },
    {
        "barbarian": "barbarian"
    },
    {
        " tribes & mdash; which included the ": null
    },
    {
        "Franks": "franks"
    },
    {
        ", ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        ", ": null
    },
    {
        "Alans": "alans"
    },
    {
        ", ": null
    },
    {
        "Huns": "huns"
    },
    {
        " and, best known, the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " & mdash; in exchange for providing warriors to fight in the Roman armies. ": null
    },
    {
        "Alaric": "alaric i"
    },
    {
        " began his career leading a band of Gothic foederati.     At first, the Roman subsidy took the form of money or food, but as tax revenues dwindled in the 42th and 42th centuries, the foederati were billeted on local landowners, which came to be identical to being allowed to settle on Roman territory. Large local landowners living in distant border provinces  on extensive, largely self-sufficient villas, found their loyalties to the central authority, already conflicted by other developments, further compromised in such situations. Then, as these loyalties wavered and became more local, the Empire began to devolve into smaller territories and closer personal ": null
    },
    {
        "fealties": "fealty"
    },
    {
        ".       The first Roman treaty with the Goths was after the defeat of ": null
    },
    {
        "Ariaric": "ariaric"
    },
    {
        " in 42 but whether or not this treaty was a foedus is unclear.  Thomas F. X. Noble. ed. 42 p.42     The Franks became foederati in 42 ": null
    },
    {
        "CE": "common era"
    },
    {
        ", when Emperor ": null
    },
    {
        "Julian": "julian"
    },
    {
        " let them keep the areas in northern ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        ", which had been depopulated during the preceding century. Roman soldiers defended the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " and had major armies  south and west of the Rhine. Frankish settlers were established in the areas north and east of the Romans and helped with the Roman defense by providing intelligence and a buffer state. The breach of the Rhine borders in the frozen winter of 42 and 42 made an end to the Roman presence at the Rhine when both the Romans and the allied Franks ": null
    },
    {
        "were overrun": "battle of mainz"
    },
    {
        " by a tribal migration en masse of ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " and ": null
    },
    {
        "Alans": "alans"
    },
    {
        ".     In 42 CE, some of the ": null
    },
    {
        "Goths": "goths"
    },
    {
        " asked Emperor ": null
    },
    {
        "Valens": "valens"
    },
    {
        " to allow them to settle on the southern bank of the ": null
    },
    {
        "Danube": "danube"
    },
    {
        " river, and were accepted into the empire as foederati. These same Goths then rose in rebellion and defeated the Romans in the ": null
    },
    {
        "Battle of Adrianople": "battle of adrianople"
    },
    {
        " in 42 CE. The critical ensuing loss of military manpower forced the Western Roman Empire to rely much more on foederati levies thereafter.     The loyalty of the tribes and their chieftains was never reliable, and in 42 the Visigoths, this time under the lead of ": null
    },
    {
        "Alaric": "alaric i"
    },
    {
        ", once again rose in rebellion. The father of one of the most powerful late Roman generals, ": null
    },
    {
        "Stilicho": "stilicho"
    },
    {
        ", was from the ranks of the foederati.       At the ": null
    },
    {
        "Battle of Faesulae": "battle of faesulae"
    },
    {
        " in 42 Stilicho defeated the Gothic king ": null
    },
    {
        "Radagaisus": "radagaisus"
    },
    {
        " and his combined Vandal and Goth army, only with the support of Gothic chieftain ": null
    },
    {
        "Sarus": "sarus the goth"
    },
    {
        " and Hunnic ruler ": null
    },
    {
        "Uldin": "uldin"
    },
    {
        ".     In 42 the general ": null
    },
    {
        "Flavius Aetius": "flavius aetius"
    },
    {
        " entered the service of the usurper ": null
    },
    {
        "Joannes": "joannes"
    },
    {
        " as  cura palatii  and was sent by Joannes to ask the ": null
    },
    {
        "Huns": "huns"
    },
    {
        " for assistance. Joannes, a high-ranking officer, lacked a strong army and fortified himself in his capital, ": null
    },
    {
        "Ravenna": "ravenna"
    },
    {
        ", where he was killed in the summer of 42 Shortly afterwards, Aetius returned to Italy with a large force of Huns to find that power in the west was now in the hands of ": null
    },
    {
        "Valentinian III": "valentinian iii"
    },
    {
        " and his mother ": null
    },
    {
        "Galla Placidia": "galla placidia"
    },
    {
        ". After fighting against Aspars army, Aetius managed a compromise with Galla Placidia. He sent back his army of Huns and in return obtained the rank of comes et magister militum per Gallias, the commander in chief of the Roman army in ": null
    },
    {
        "Gaul": "roman gaul"
    },
    {
        ".     Around 42 , ": null
    },
    {
        "Attaces": "attaces"
    },
    {
        ", the king of the ": null
    },
    {
        "Alans": "alans"
    },
    {
        ", fell in battle against the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        ", who at the time were still allies of ": null
    },
    {
        "Rome": "roman empire"
    },
    {
        ", in Hispania, and most of the surviving Alans appealed to ": null
    },
    {
        "Gunderic": "gunderic"
    },
    {
        ". Gunderic accepted their request and thus became King of the Vandals and Alans.     Late in Gunderics reign, the Vandals themselves began to clash more and more with the Visigothic Foederati, often getting the worse of these battles because the Visigoths were so much more numerous. After Gunderic died early in 42 the Vandals elected his half-brother ": null
    },
    {
        "Genseric": "genseric"
    },
    {
        " as his successor, and Genseric left ": null
    },
    {
        "Iberia": "iberian peninsula"
    },
    {
        " to the Visigoths in favor of invading Roman ": null
    },
    {
        "Africa": "africa"
    },
    {
        ".     By the 42th century, lacking the wealth needed to pay and train a professional army, Western Roman military strength was almost entirely reliant on foederati units. In 42 ": null
    },
    {
        "Attila the Hun": "attila the hun"
    },
    {
        " was defeated only with help of the foederati , and the foederati would deliver the fatal blow to the dying nominal ": null
    },
    {
        "Western Roman Empire": "western roman empire"
    },
    {
        " in 42 when their ": null
    },
    {
        "commander": "germanic chieftain"
    },
    {
        " Odoacer": "odoacer"
    },
    {
        " deposed the usurper Western Emperor, ": null
    },
    {
        "Romulus Augustulus": "romulus augustulus"
    },
    {
        ", and sent the imperial insignia back to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " with the Senates request that the 42-year-old West/East sub-division of the empire be abolished. Even before the ": null
    },
    {
        "eventual collapse of the Western Roman Empire": "fall of the western roman empire"
    },
    {
        " in 42 several kingdoms with the status of foederati managed to gain a full independence formally recognized by the ": null
    },
    {
        "Western Roman Empire": "western roman empire"
    },
    {
        ", such as the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " through the peace treaty concluded in 42 between their king ": null
    },
    {
        "Genseric": "genseric"
    },
    {
        " and ": null
    },
    {
        "Valentinian III": "valentinian iii"
    },
    {
        "  and the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " through the peace treaty concluded in 42 between their king ": null
    },
    {
        "Euric": "euric"
    },
    {
        " and ": null
    },
    {
        "Julius Nepos": "julius nepos"
    },
    {
        ".      After the collapse of the Hunnic empire, the ": null
    },
    {
        "Ostrogoths": "ostrogoths"
    },
    {
        " entered into relations with the ": null
    },
    {
        "Eastern Roman Empire": "byzantine empire"
    },
    {
        " and were settled in ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        " to become foederati of the Byzantines. During the latter half of the 42th century, the Ostrogoths relationship with the Byzantines started to shift from friendship to enmity, just as the Visigoths had done before them, and their king ": null
    },
    {
        "Theoderic the Great": "theoderic the great"
    },
    {
        " led them to frequently ravage the provinces of the Eastern Roman Empire, eventually threatening Constantinople itself. Eventually, Theoderic and emperor ": null
    },
    {
        "Zeno": "zeno"
    },
    {
        " worked out an arrangement beneficial to both sides, in which Theoderic invaded Odoacers kingdom and eventually conquered Italy.       Foederati were still present in the ": null
    },
    {
        "Eastern Roman army": "byzantine army"
    },
    {
        " during the 42th century. ": null
    },
    {
        "Belisarius": "belisarius"
    },
    {
        " and ": null
    },
    {
        "Narses": "narses"
    },
    {
        " victorious armies included many foederati, including Hunnic archers and Herule mercenaries, when they reconquered Africa and Italy. At the ": null
    },
    {
        "Battle of Taginae": "battle of taginae"
    },
    {
        ", a large contingent of the Byzantine army was made up of ": null
    },
    {
        "Lombards": "lombards"
    },
    {
        ", ": null
    },
    {
        "Gepids": "gepids"
    },
    {
        " and ": null
    },
    {
        "Bulgars": "bulgars"
    },
    {
        ".     In the east, foederati were formed from several Arab tribes to protect against the Persian-allied Arab ": null
    },
    {
        "Lakhmids": "lakhmids"
    },
    {
        " and the tribes of the Arabian peninsula. Among these foederati were the ": null
    },
    {
        "Tanukhids": "tanukhids"
    },
    {
        ", ": null
    },
    {
        "Banu Judham": "banu judham"
    },
    {
        ", ": null
    },
    {
        "Banu Amela": "banu amela"
    },
    {
        " and the ": null
    },
    {
        "Ghassanids": "ghassanids"
    },
    {
        ". The term Foederati continues to be attested in the Eastern Roman armies until around the reign of ": null
    },
    {
        "Maurice": "maurice"
    },
    {
        ". ": null
    }
]