[
    {
        "            Ford Madox Brown was a ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " painter of moral and historical subjects, notable for his distinctively graphic and often ": null
    },
    {
        "Hogarthian": "william hogarth"
    },
    {
        " version of the ": null
    },
    {
        "Pre-Raphaelite": "pre-raphaelite"
    },
    {
        " style. Arguably, his most notable painting was  Work  . Brown spent the latter years of his life painting the twelve works known as  The Manchester Murals , depicting ": null
    },
    {
        "Mancunian history": "history of manchester"
    },
    {
        ", for ": null
    },
    {
        "Manchester Town Hall": "manchester town hall"
    },
    {
        ".          Brown was the grandson of the medical theorist ": null
    },
    {
        "John Brown": "john brown"
    },
    {
        ", founder of the ": null
    },
    {
        "Brunonian system of medicine": "brunonian system of medicine"
    },
    {
        ". His great grandfather was a Scottish labourer. His father Ford Brown served as a purser in the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ", including a period serving under ": null
    },
    {
        "Sir Isaac Coffin": "sir isaac coffin, 1st baronet"
    },
    {
        " and a period on ": null
    },
    {
        "HMS Arethusa": "hms arethusa"
    },
    {
        ". He left the Navy after the end of the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ".     In 1818, Ford Brown married Caroline Madox, of an old Kentish family, from which his middle name was taken. Ford Madox Brown ,  1911 Encyclopædia Britannica . Browns parents had limited financial resources, and they moved to ": null
    },
    {
        "Calais": "calais"
    },
    {
        " to seek cheaper lodgings, where their daughter Elizabeth Coffin was born in 1819 and their son Ford Madox Brown in 1821.     Browns education was limited, as the family frequently moved between lodgings in the ": null
    },
    {
        "Pas-de-Calais": "pas-de-calais"
    },
    {
        " and relatives in ": null
    },
    {
        "Kent": "kent"
    },
    {
        ", but he showed artistic talent in copying of old master prints. His father initially sought a naval career for his son, writing to his former captain Sir Isaac Coffin. The family moved to ": null
    },
    {
        "Bruges": "bruges"
    },
    {
        " in 1835 so Brown could study at the academy under ": null
    },
    {
        "Albert Gregorius": "albert gregorius"
    },
    {
        ". Brown moved to ": null
    },
    {
        "Ghent": "ghent"
    },
    {
        " in 1836 to continue his studies under ": null
    },
    {
        "Pieter van Hanselaere": "pieter van hanselaere"
    },
    {
        ". He moved to ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " in 1837 to study under ": null
    },
    {
        "Gustaf Wappers": "gustaf wappers"
    },
    {
        ". He continued to study in Antwerp after his mothers death in 1839. His sister died in 1840, and then his father in 1842.             The Tate Gallery holds an early example of Browns work, a portrait of his father.  He first exhibited at the Royal Academy in 1840, a work inspired by ": null
    },
    {
        "Lord Byrons": "lord byron"
    },
    {
        "poem  The Giaour  and then completed a version of The Execution of Mary, Queen of Scots, with his cousin and future wife Elisabeth Bromley as one of his models. He lived in Montmartre with his new wife and aging father in 1841. He painted  Manfred on the Jungfrau , inspired by Lord Byrons poem  Manfred  while he was in Paris.     In 1843 he submitted work to the Westminster Cartoon Competition, for compositions to decorate the new ": null
    },
    {
        "Palace of Westminster": "palace of westminster"
    },
    {
        ". His entry, The Body of Harold Brought before William, was not successful. His early works were, however, greatly admired by the young ": null
    },
    {
        "Dante Gabriel Rossetti": "dante gabriel rossetti"
    },
    {
        ", who asked him to become his tutor. Through Rossetti, Brown came into contact with the artists who went on to form the ": null
    },
    {
        "Pre-Raphaelite Brotherhood": "pre-raphaelite brotherhood"
    },
    {
        ". Though closely linked to them, he was never actually a member of the brotherhood itself, but adopted the bright colours and realistic style of ": null
    },
    {
        "William Holman Hunt": "william holman hunt"
    },
    {
        " and ": null
    },
    {
        "John Everett Millais": "john everett millais"
    },
    {
        ". He was also influenced by the works of Holbein that he saw in Basel in 1845, and by ": null
    },
    {
        "Friedrich Overbeck": "friedrich overbeck"
    },
    {
        " and ": null
    },
    {
        "Peter Cornelius": "peter cornelius"
    },
    {
        ", whom he met in Rome in 1845-46.     Brown struggled to make his mark in the 1850s, with his paintings failing to find buyers, and he considered emigrating to India. In 1852 he started work on two of his most significant works.     One of his most famous images is  The Last of England , painted from 1852 to 1855, which was sold in March 1859 for 325 ": null
    },
    {
        "Guineas": "guinea"
    },
    {
        " Sale of Valuable Pictures,  The Times , 28 March 1859 . It depicts a pair of stricken emigrants as they sail away on the ship that will take them from England forever. It was inspired by the departure of the Pre-Raphaelite sculptor ": null
    },
    {
        "Thomas Woolner": "thomas woolner"
    },
    {
        ", who had left for Australia. In an unusual ": null
    },
    {
        "tondo": "tondo"
    },
    {
        " format, the painting is structured with Browns characteristic linear energy, and emphasis on apparently grotesque and banal details, such as the cabbages hanging from the ships side. The husband and wife are portraits of Brown and his second wife Emma.        Browns most important painting was  Work  , begun in Hampstead in 1852 and which he showed at his retrospective exhibition in 1865. ": null
    },
    {
        "Thomas Plint": "thomas plint"
    },
    {
        " advanced funds to enable Brown to complete the work, in anticipation of obtaining the finished painting, but died in 1861 before the painting had been completed. Dianne Sachko Macleod, ‘": null
    },
    {
        "Plint, Thomas Edward": "thomas plint"
    },
    {
        " ’, Oxford Dictionary of National Biography, Oxford University Press, Sept 2004 In this painting, Brown attempted to depict the totality of the mid-": null
    },
    {
        "Victorian": "victorian era"
    },
    {
        " social experience in a single image, depicting navvies digging up a road  and disrupting the old social hierarchies as they did so. The image erupts into proliferating details from the dynamic centre of the action, as the workers tear a hole in the road  – and, symbolically, in the social fabric. Each character represents a particular social class and role in the modern urban environment.     Brown wrote a catalogue to accompany the special exhibition of Work. This publication included an extensive explanation of Work that nevertheless leaves many questions unanswered. Browns concern with the social issues addressed in Work prompted him to open a ": null
    },
    {
        "soup kitchen": "soup kitchen"
    },
    {
        " for Manchesters hungry, and to attempt to aid the citys unemployed to find work by founding a labour exchange.       Brown found patrons in the north of England, including Plint, ": null
    },
    {
        "George Rae": "george rae"
    },
    {
        " from Birkenhead,  ": null
    },
    {
        "John Miller": "john miller"
    },
    {
        " from Liverpool, and ": null
    },
    {
        "James Leathart": "james leathart"
    },
    {
        " from Newcastle. By the late 1850s he had lost patience with the poor reception he received at the Royal Academy and ceased to show his works there, rejecting an offer from Millais to support his becoming an associate member. He founded the ": null
    },
    {
        "Hogarth Club": "hogarth club"
    },
    {
        " in 1858, with ": null
    },
    {
        "William Morris": "william morris"
    },
    {
        ", ": null
    },
    {
        "Edward Burne-Jones": "edward burne-jones"
    },
    {
        ", and his former pupil Rossetti. After a successful period of a few years, the club reached over 80 members, including several prominent members of the Royal Academy, but Brown resigned in 1860, and the club collapsed in 1861.     From the 1860s, Brown also designed furniture and stained glass. He was a founder partner of ": null
    },
    {
        "William Morriss": "william morris"
    },
    {
        "design company, ": null
    },
    {
        "Morris, Marshall, Faulkner & Co.": "morris, marshall, faulkner  &  co."
    },
    {
        ", in 1861, which dissolved in 1874 with Morris continuing on his own. He was a close friend of the landscape artist ": null
    },
    {
        "Henry Mark Anthony": "henry mark anthony"
    },
    {
        ".     Browns major achievement after Work was  The Manchester Murals , a cycle of twelve paintings in the Great Hall of ": null
    },
    {
        "Manchester Town Hall": "manchester town hall"
    },
    {
        " depicting the history of the city. Brown would be 72 by the time he finished the murals. In total, he took six years perfecting the murals, which were his last major work.                 Ford Madox Brown was married twice. His first wife Elizabeth Bromley was his first cousin, the daughter of his mothers sister Mary. They were married in ": null
    },
    {
        "Meopham": "meopham"
    },
    {
        " in Kent in April 1841, shortly before his 20th birthday and less than a year after the sudden death of his sister Elizabeth. They lived in ": null
    },
    {
        "Montmartre": "montmartre"
    },
    {
        " in 1841 with Browns invalid father who died the following summer.     Their first child died young as an infant in November 1842. Their daughter ": null
    },
    {
        "Emma Lucy": "lucy madox brown"
    },
    {
        " was born in 1843 and the family moved back to England in 1844. They travelled to Rome in 1845 to alleviate the illness of his wife, who was suffering from consumption . She died in Paris in June 1846, aged 27, on the journey back to England from Rome.     Emma Hill became a frequent model for Brown from 1848; for example, she is the wife in  The Last of England . She became his mistress, and they shared a house in London, but social convention discouraged him from marrying an illiterate daughter of a bricklayer. Their daughter ": null
    },
    {
        "Catherine Emily": "catherine madox brown"
    },
    {
        " was born in 1850, and eventually they were married at ": null
    },
    {
        "St Dunstan-in-the-West": "st dunstan-in-the-west"
    },
    {
        " in April 1853.     Their son, Oliver Madox Brown showed promise both as an artist and poet, but died of ": null
    },
    {
        "blood poisoning": "blood poisoning"
    },
    {
        " before his maturity. The death of Nolly was a crushing blow for Brown, and he kept a room for his sons belongings as a shrine. Another son Arthur was born in September 1856. Brown used Arthur as the model for the baby held by a ragged girl in the foreground of Work, but he died aged only ten months old in July 1857.      His daughters Lucy and Catherine were also competent artists. Lucy married ": null
    },
    {
        "William Michael Rossetti": "william michael rossetti"
    },
    {
        " in 1874. Catherine, married ": null
    },
    {
        "Francis Hueffer": "francis hueffer"
    },
    {
        "; through Catherine, Brown was the grandfather of novelist ": null
    },
    {
        "Ford Madox Ford": "ford madox ford"
    },
    {
        " and great-grandfather of ": null
    },
    {
        "Labour": "labour party"
    },
    {
        " Home Secretary": "home secretary"
    },
    {
        " Frank Soskice": "frank soskice"
    },
    {
        ".       Browns second wife died in October 1890, and he died in Primrose Hill, north London, in 1893. He is buried in the ": null
    },
    {
        "St Pancras and Islington Cemetery": "st pancras and islington cemetery"
    },
    {
        " in ": null
    },
    {
        "East Finchley": "east finchley"
    },
    {
        ".  He was given a secular funeral, and the funeral oration was delivered by the American ": null
    },
    {
        "Moncure D. Conway": "moncure d. conway"
    },
    {
        ", the secularist after whom ": null
    },
    {
        "Conway Hall": "conway hall"
    },
    {
        " was later named. ": null
    },
    {
        "TLS": "the times literary supplement"
    },
    {
        "  Ford Madox Brown, 1867, drawn by ": null
    },
    {
        "Dante Gabriel Rossetti": "dante gabriel rossetti"
    },
    {
        "           The ": null
    },
    {
        "J D Wetherspoon": "j d wetherspoon"
    },
    {
        " pub": "pub"
    },
    {
        " in Oxford Road, ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        " is named after Ford Madox Brown.  It states on the Wetherspoons website that This J D Wetherspoon pub is named after the much-travelled artist Ford Madox Brown, a one-time resident of Victoria Park, a suburb south of the pub. The pub opened in 2007.        James Leathart Traveller The Irish Girl Cromwell, Protector of the Vaudois Finding of Don Juan by Haidee Cordelias Portion Byrons Dream ": null
    },
    {
        "Louis IX": "louis ix"
    },
    {
        " in the stained glass of the East window of ": null
    },
    {
        "All Saints Church, Cambridge": "all saints church, cambridge"
    },
    {
        "   Image:Ford Madox Brown - Chaucer at the court of Edward III - Google Art Project.jpg| Chaucer at the Court of Edward III , oil on canvas painting by Ford Madox Brown, 1847–1851, ": null
    },
    {
        "Art Gallery of New South Wales": "art gallery of new south wales"
    },
    {
        "   Image:Romeo and juliet brown.jpg| Romeo and Juliet  parting on the balcony in Act III. ": null
    },
    {
        "Delaware Art Museum": "delaware art museum"
    },
    {
        " King Renes Honeymoon, 1864, an imaginary scene in the life of the art-loving medieval king ": null
    },
    {
        "René of Anjou": "rené of anjou"
    },
    {
        " Jesus washing Peters feet": null
    }
]