[
    {
        "Since its independence from France in 42 ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        " has pursued an activist foreign policy. In the 42s and 42s, Algeria was noted for its support of ": null
    },
    {
        "Third World": "third world"
    },
    {
        " policies and independence movements. Since its independence, Algeria has been a member of the ": null
    },
    {
        "Arab League": "arab league"
    },
    {
        " and of the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ".     Algeria has diplomatic relations with more than 42 foreign countries, and over 42 countries maintain diplomatic representation in Algiers.           Following its in 42 Algeria was far from being an isolated country, absent from the global scene. On the contrary, the Algerian government, pursuing the dynamics that had started during the ": null
    },
    {
        "war for independence": "algerian war"
    },
    {
        " into the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ", used the countrys strategic geopolitical position – at the crossroads of Europe, sub-Saharan Africa and Arab world – to assert its own interests. Algeria came to see itself as a full actor of the Cold War, and not simply a bystander caught in a crossfire between the Western and the Eastern blocs. Moreover, Algeria played a central role in the creation of the ": null
    },
    {
        "Third World": "third world"
    },
    {
        " as a global political project, using its position at the intersection of international agendas – notably between non-alignment and Afro-Asianism positions, and between ": null
    },
    {
        "anticolonial": "anti-imperialism"
    },
    {
        " and ": null
    },
    {
        "socialist": "socialism"
    },
    {
        " movements.       Being a newly independent country from the colonial rule of a Western power – France –, and having waged a liberation war with a socialist orientation, Algeria was naturally inclined to turn towards the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and its allies. However, the countrys strategic advantages increased its importance to the eyes of the Western bloc. Firstly, ": null
    },
    {
        "France": "france"
    },
    {
        " wanted to preserve its interests in the oil and gas exploitations in Algeria. As ": null
    },
    {
        "Charles de Gaulle": "charles de gaulle"
    },
    {
        " stated to the Algerian Finance Minister in 42 “If the Algerian government respects its commitments and takes into account our interests, it can count on our cooperation”. Hence, French economic aid continued to flow in Algeria, to insure that its control on the petrol industry and its possibility to run ": null
    },
    {
        "atomic tests in the Saharan desert": "nuclear weapons testing"
    },
    {
        " were maintained. Under ": null
    },
    {
        "Ben Bella": "ahmed ben bella"
    },
    {
        ", diplomatic relations with France were normalized, the negotiations concerning oil and gas leading to an agreement in 42 As to the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", they wanted to prevent Algeria from becoming yet another socialist country joining the ranks of the Soviet bloc. Hence, along with minor military equipment, the United States provided Algeria with a food program which delivered free food to the population. However, the Algerian commitment to supporting left-wing anticolonial movements in Africa went against American interests in the continent, which led to an indirect conflict with the United States and an increasingly hostile relationship between the two countries.     During the war for independence, the ": null
    },
    {
        "ALN": "national liberation army"
    },
    {
        " had already benefitted from equipment, training and advice from communist countries: the USSR , ": null
    },
    {
        "China": "china"
    },
    {
        ", ": null
    },
    {
        "Yugoslavia": "yugoslavia"
    },
    {
        " and ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ". Moreover, ALN delegations had visited China and ": null
    },
    {
        "North Vietnam": "north vietnam"
    },
    {
        " to learn from their ": null
    },
    {
        "guerrilla": "guerrilla warfare"
    },
    {
        " strategies. Help and support from the communist bloc therefore increased after independence:     Even though Algeria was not a communist regime, the Soviet Union invested massive amounts of money and material help in the country. For instance, in 42 the USSR granted $42 million in import credits for Soviet machinery to help build the Algerian industry, and committed to building a petrochemical research institute. The Soviet Union also agreed to buy agricultural products and minerals that Algeria was struggling to export. It was finally the countrys main military supplier, providing planes, tanks, armored vehicles, ships, light weapons and ammunition for a total of 42 billion dollars from 42 to 42   The other great communist power, China, demonstrated its interest in Algeria as a fellow antiimperialist country. Hence, when ": null
    },
    {
        "Zhou Enlai": "zhou enlai"
    },
    {
        " visited Algeria in December 42 he granted Algeria a low-interest loan of $42 million. Moreover, the Chinese were more aggressive in their support for armed groups fighting imperialist and neo-imperialist regimes in Africa. Algeria and China therefore cooperated on this matter, with China contributing to ANP training camps, and shipping weapons and revolutionary militants to Algeria.     The ": null
    },
    {
        "Sino-Soviet split": "sino-soviet split"
    },
    {
        " strengthened the two communist countries’ competition for Algeria. However, China was inferior economically and militarily to the USSR, and could not match the USSRs industrial equipment and sophisticated armaments. Moreover, as the autogestion model proved to be widely inefficient, Algeria started to move towards a more centralized and Soviet-style economy by the end of 42       Ben Bellas foreign policy was marked by globalism, as it was not restrained to a specific culture nor geographical region. Rather, the project of the Third World and its diverse manifestations – the ": null
    },
    {
        "Non-Aligned Movement": "non-aligned movement"
    },
    {
        ", the ": null
    },
    {
        "Afro-Asian Peoples Solidarity Organization": "afro-asian peoples solidarity organisation"
    },
    {
        ", etc. – were meant to include all the developing and anti-imperialist countries, and Algeria intended to play a major role in its development.     This role is perfectly summarized by ": null
    },
    {
        "Amilcar Cabral": "amílcar cabral"
    },
    {
        "’s – leader of the ": null
    },
    {
        "African Party for the Independence of Guinea and Cape Verde": "african party for the independence of guinea and cape verde"
    },
    {
        " – famous declaration that Algeria was the “Mecca of revolution”. Indeed, the Algerian foreign policy had been influenced by ": null
    },
    {
        "Frantz Fanon": "frantz fanon"
    },
    {
        "’s and other radical Third World thinkers’ urgings to “export revolution” to other countries suffering from the yoke of imperial oppression. Therefore, the support of armed nationalists and revolutionaries was one of the foundations of Algerian relations with African countries. Ever since 42 the FLN camps in Algerias neighboring countries  had been used to provide training and material help to revolutionary movements. By 42 Algeria was offering refuge, funds, weapons and training to rebels from a dozen African countries: the left-wing opposition in Morocco, the secessionist Sanwi government in Ivory Coast, the ": null
    },
    {
        "Sawaba party": "sawaba"
    },
    {
        " in Niger, the CNL in ": null
    },
    {
        "Congo-Leopoldville": "republic of the congo"
    },
    {
        ", the ": null
    },
    {
        "UPC": "union of the peoples of cameroon"
    },
    {
        " in Cameroon, the ": null
    },
    {
        "MPLA": "mpla"
    },
    {
        " and ": null
    },
    {
        "FNLA": "national liberation front of angola"
    },
    {
        " in Angola , and several armed groups in Zanzibar, Portuguese Guinea, South Africa and Namibia.     However, the Third World project also materialized through the various conferences and international organizations that united developing countries. Firstly, the ": null
    },
    {
        "Non-Aligned Movement": "non-aligned movement"
    },
    {
        ", which was founded in Belgrade in 42 and which Algeria joined shortly after its independence, defined the concept of non-alignment in the Cold War as a way for poor countries to exploit the conflicts and tensions and hence to promote their own interests. According to Jeffrey J. Byrne, the Algerian conception of the Non-Aligned Movement was that of a “political, goal-oriented and geographically unbounded anti-imperial solidarity”. The Third World coalition could therefore encompass Latin America countries, and even Europe ones like Yugoslavia. Algeria was particularly important in this sense, as it acted as a bridge between blocs and regions. For instance, its position at the crossroads of the Arab and the sub-Saharan worlds enabled Algeria to create links and unity between these two regions: at Algerias request, Arab countries supported Angolan and other African revolutions, while African countries endorsed the Palestinian cause. However, these global Third World solidarity links went further than Africa: for example, the ": null
    },
    {
        "National Liberation Front of South Vietnam": "viet cong"
    },
    {
        " opened a permanent office in Algiers . One of the most successful Third World projects was the ": null
    },
    {
        "Organization of African Unity": "organisation of african unity"
    },
    {
        ", founded in Addis Ababa in 42 to formalize and institutionalize the main Third World principles. Moreover, Algeria advocated for the creation within the organization of a “liberation committee”, the “Committee of Nine”, to support national liberation movements . This embodies the Algerian view of Third Worldism: the institutionalization of collective defiance towards the imperial system.     Therefore, if the multipolarity of international relations – the traditional East versus West bipolarism, but also the intra-communist poles and the development of Third World alternatives – had benefitted the non-aligned states such as Algeria, the latters increasing reliance on the Soviet Union – especially since the ": null
    },
    {
        "Sand War": "sand war"
    },
    {
        " against Morocco in 42 – risked jeopardizing the countrys independence and its relations with other powers, such as the United States or China.       Algerian foreign relations during the presidency of ": null
    },
    {
        "Houari Boumediene": "houari boumédiène"
    },
    {
        " marked a shift towards more stable and Algero-centered policies, by opposition to ": null
    },
    {
        "Ben Bella": "ahmed ben bella"
    },
    {
        "’s cosmopolitism. However, this greater focus on the country’s economic needs and traditional Islamic culture did not end the period of international ambitions.       ": null
    },
    {
        "Pan-Africanism": "pan-africanism"
    },
    {
        " and ": null
    },
    {
        "Pan-Arabism": "pan-arabism"
    },
    {
        " were strengthened during the Boumediene era. Algeria had joined the ": null
    },
    {
        "Arab League": "arab league"
    },
    {
        " in 42 and hosted its 42 summit in Algiers. This strong relation with other Arab countries, notably with ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", was reinforced after Boumediene’s seizure of power. For instance, in 42 Egyptian president ": null
    },
    {
        "Gamal Abdel Nasser": "gamal abdel nasser"
    },
    {
        " sent thousands of teachers to support Algeria in the Arabization of its educational system. After Nasser’s death in 42 Boumediene increasingly represented the political project of Pan-Arabism; and in 42 Algeria played a major role in the organization of the war against ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", as well as calling for oil to be used as a weapon in the ": null
    },
    {
        "OPEC": "opec"
    },
    {
        ". Moreover, in 42 Algiers hosted the Pan-African Cultural Festival: this grandiose display of an African identity, forged from the continent’s common experience of Western imperialism, reunited anticolonial militants from numerous countries of the Third World. Far from being opposed, Pan-Arabism and Pan-Africanism were, under Algerian influence, united: Boumediène summoned an extraordinary session of the Organization for African Unity following the ": null
    },
    {
        "Kippur War": "yom kippur war"
    },
    {
        " in 42 which resulted in the creation of a special committee to coordinate the Organization and the Arab League, and in the break of diplomatic relations of 42 African states with Israel. Finally, Boumediène presided over a larger and more powerful Non-Aligned Movement in 42     Algeria’s approach to international politics was motivated by the need for a “liberation” from the Western neocolonial economic superiority. Hence, in October 42 Algiers hosted the meeting of the “": null
    },
    {
        "Group of 42": "group of 77"
    },
    {
        "”, which united 42 developing countries on major revendications: a global reform of the terms of trade and a greater collaboration between Third World countries to set the prices for their raw materials. Furthermore, the main points of Boumedienes address to the United Nations General Assembly in 42 – reparations for colonization and a transfer of resources from North to South – were adopted by UN. The notion of a “new international economic order” emerged as a way to reshape the world economy to the benefit of developing countries, based on the principle of sovereign equality between states.       Boumediene took pride in Algerias non-aligned status, by claiming its distance from both Soviet-style socialism and Western capitalism, while the country enjoyed an increasing prosperity. However, support from the Communist bloc did not halt. Indeed, because of their dependence on raw materials and their lack of hard currencies, commerce between Third World countries was negligible. The USSR, on the contrary, was able to deliver military equipment, industrial expertise, and trade outputs: the Soviets replaced France as the first destination for Algerian wine, and provided 42 tons of wheat when a draught hit the country in 42     Once again, the support Algeria received from the Soviet bloc was not exclusive to that of the Western bloc. Even though Boumediene took strong public stands, as when he claimed in 42 after a summer of violence against Algerians living in France that if the French government could not insure the security of Algerian immigrants, he would repatriate them regardless of the cost, ": null
    },
    {
        "Algerian-French relations": "algeria–france relations"
    },
    {
        " were progressively normalized during the 42 decade. This posturing, like the nationalization of oil in 42 served to increase his popularity in internal politics. However, France remained a model of prosperity, Algeria was still heavily dependent on France economically, and in 42 French President ": null
    },
    {
        "Valéry Giscard d’Estaing": "valéry giscard destaing"
    },
    {
        " made the first presidential visit since independence. More generally, Algeria continued to do business with the West, and avoided to be overly dependent on Soviet support. Indeed, despite the break of relations with the United States after the ": null
    },
    {
        "Six-Day War": "six-day war"
    },
    {
        " in 42 the Americans had almost replaced France as Algerias primary trade partner by the early 42s. Therefore, the competition between the West and the USSR gave Algeria opportunities to diversify its economic partnerships.       Since his inauguration in 42 President ": null
    },
    {
        "Bouteflika": "bouteflika"
    },
    {
        " has sought to extend Algerias international influence, traveling extensively throughout the world. In July 42 he became the first Algerian President to visit the ": null
    },
    {
        "US White House": "us white house"
    },
    {
        " in 42 years.     He has made official visits, among others, to ": null
    },
    {
        "France": "france"
    },
    {
        ", ": null
    },
    {
        "Republic of South Africa": "republic of south africa"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        ", ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", ": null
    },
    {
        "South Korea": "south korea"
    },
    {
        " and ": null
    },
    {
        "Russia": "russia"
    },
    {
        ".         Algeria has friendly relations with other countries in the ": null
    },
    {
        "Maghreb": "maghreb"
    },
    {
        ", ": null
    },
    {
        "Tunisia": "tunisia"
    },
    {
        " and ": null
    },
    {
        "Libya": "libya"
    },
    {
        ", and with Sub-Saharan countries ": null
    },
    {
        "Mali": "mali"
    },
    {
        " and ": null
    },
    {
        "Niger": "niger"
    },
    {
        ". Algeria has taken the lead in working on issues related to the African continent. Host of the ": null
    },
    {
        "Organisation of African Unity": "organisation of african unity"
    },
    {
        " Conference in 42 Algeria also was key in bringing ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        " and ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        " to the peace table in 42 It has worked closely with other African countries to establish the ": null
    },
    {
        "New Partnership for Africas Development": "new partnership for africas development"
    },
    {
        ". Algeria has taken a lead in reviving the ": null
    },
    {
        "Arab Maghreb Union": "arab maghreb union"
    },
    {
        " with other regional Arab countries.                          ": null
    }
]