[
    {
        "        The ": null
    },
    {
        "Maldives": "maldives"
    },
    {
        " has remained an independent nation throughout its ": null
    },
    {
        "recorded history": "recorded history"
    },
    {
        ", save for a brief spell of Portuguese occupation in the mid42th century. From 42 to 42 the country was a British ": null
    },
    {
        "protectorate": "protectorate"
    },
    {
        " while retaining full internal sovereignty. At its independence in 42 the Maldives joined the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " on 42 September.     Since 42 the Maldives has followed a policy of international engagement, intensifying links with strategic partners and the international system. It joined the ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        " in 42 A founder member of ": null
    },
    {
        "South Asian Association for Regional Cooperation": "south asian association for regional cooperation"
    },
    {
        " , the Maldives is also a member of the ": null
    },
    {
        "Bretton Woods system": "bretton woods system"
    },
    {
        ". It is also party to the ": null
    },
    {
        "Nuclear Non-Proliferation Treaty": "nuclear non-proliferation treaty"
    },
    {
        " as well as numerous conventions on the protection of the environment, the suppression of terrorism, disarmament and on the promotion and protection of human rights.     In the transition towards a ": null
    },
    {
        "liberal democracy": "liberal democracy"
    },
    {
        ", the Maldives has successfully established dialogue and collaboration with the international human rights organizations, such as ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        " and ": null
    },
    {
        "Human Rights Watch": "human rights watch"
    },
    {
        ", and acceded to numerous human rights instruments such as the ": null
    },
    {
        "International Covenant on Civil and Political Rights": "international covenant on civil and political rights"
    },
    {
        " and the ": null
    },
    {
        "International Covenant on Economic, Social and Cultural Rights": "international covenant on economic, social and cultural rights"
    },
    {
        " . During the same period, the country has also intensified links with the ": null
    },
    {
        "Commonwealth Parliamentary Association": "commonwealth parliamentary association"
    },
    {
        " and joined the ": null
    },
    {
        "Inter-Parliamentary Union": "inter-parliamentary union"
    },
    {
        " .     The Maldives maintain resident ": null
    },
    {
        "diplomatic mission": "diplomatic mission"
    },
    {
        "s in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        ", ": null
    },
    {
        "New Delhi": "new delhi"
    },
    {
        ", ": null
    },
    {
        "Islamabad": "islamabad"
    },
    {
        ", ": null
    },
    {
        "Dhaka": "dhaka"
    },
    {
        ", ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        ", ": null
    },
    {
        "Kuala Lumpur": "kuala lumpur"
    },
    {
        ", ": null
    },
    {
        "New York": "new york city"
    },
    {
        ", ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        ", ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        ", ": null
    },
    {
        "Riyadh": "riyadh"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        ", ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        ", and the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ", and non-resident accreditation in a number of countries including ": null
    },
    {
        "Nepal": "nepal"
    },
    {
        " and ": null
    },
    {
        "Bhutan": "bhutan"
    },
    {
        ".     Key issues of interest include advancing national development, supporting international peace and security, including the protection of the environment and the promotion of human rights, and upholding the purposes and principles enshrined in the ": null
    },
    {
        "Charter of the United Nations": "charter of the united nations"
    },
    {
        ".              The Maldives has become a very strong advocate for the promotion and protection of human rights following the democratic transition in 42 At the United Nations, the Maldives has since then called for all countries to adhere to their obligations under international law, and to respect fundamental freedoms and rights. In 42 the Maldives became one of the promoters of the Optional Protocol to the UN Convention Against Torture after having earlier acceded to the Convention. The Maldives is party to the ": null
    },
    {
        "Convention on the Rights of the Child": "convention on the rights of the child"
    },
    {
        " , the ": null
    },
    {
        "Convention on the Elimination of Racial Discrimination": "convention on the elimination of racial discrimination"
    },
    {
        " , ": null
    },
    {
        "Convention on the Rights of Persons with Disabilities": "convention on the rights of persons with disabilities"
    },
    {
        " the ": null
    },
    {
        "Convention on the Elimination of All Forms of Discrimination Against Women": "convention on the elimination of all forms of discrimination against women"
    },
    {
        " and its optional protocol. In April 42 the Maldives issued a standing invitation to all special procedures mandates of the UN human rights machinery to visit to the Maldives.     The Maldives was elected to the ": null
    },
    {
        "Human Rights Council": "human rights council"
    },
    {
        " in 42 for the term 4242 in which it has actively supported and contributed to the promotion and protection of human rights for all. It has co-sponsored a number of resolution establishing United Nations Special Mandates, and supported resolutions on improving human rights situation in the Middle East during the ": null
    },
    {
        "Arab Spring": "arab spring"
    },
    {
        ", namely on investigating human rights violations in ": null
    },
    {
        "Libya": "libya"
    },
    {
        " and ": null
    },
    {
        "Syria": "syria"
    },
    {
        ".     Maldives has especially close relations with Sri Lanka and India, countries with which it shares much culture.             Maldives became a ": null
    },
    {
        "member state of the United Nations": "member states of the united nations"
    },
    {
        " on 42 September 42 The nation became a member of ": null
    },
    {
        "United Nations Development Programme": "united nations development programme"
    },
    {
        " on the same date.     The Maldives became a member of the following UN agencies and conferences on the following dates:   ": null
    },
    {
        "United Nations Population Fund": "united nations population fund"
    },
    {
        " and ": null
    },
    {
        "United Nations Conference on Trade and Development": "united nations conference on trade and development"
    },
    {
        " - 42 September 42   ": null
    },
    {
        "United Nations Industrial Development Organization": "united nations industrial development organization"
    },
    {
        " - 42 May 42   ": null
    },
    {
        "United Nations Educational, Scientific and Cultural Organization": "united nations educational, scientific and cultural organization"
    },
    {
        " - 42 July 42   ": null
    },
    {
        "United Nations Environment Programme": "united nations environment programme"
    },
    {
        " - on 42 December 42   ": null
    },
    {
        "United Nations Childrens Fund": "united nations childrens fund"
    },
    {
        " - 42 April 42     The United Nations Development Programme has a representative resident in Malé, as do UNICEF and ": null
    },
    {
        "World Health Organization": "world health organization"
    },
    {
        " .     At the UN, the Maldives has highlighted the vulnerability of small states to various threats including terrorism, activities of mercenaries and ": null
    },
    {
        "transnational organized crime": "transnational organized crime"
    },
    {
        ". It is also a strong advocate of counter-terrorism and is party to all the main UN conventions against terrorism. Development co-operation is a major priority of the Maldives and it has been campaigning at the UN for a more structured means of graduation from the list of ": null
    },
    {
        "least developed countries": "least developed countries"
    },
    {
        " targeted for preferential assistance. The main donors to the Maldives are ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        ", and ": null
    },
    {
        "Australia": "australia"
    },
    {
        ".         The Maldives became a member of ": null
    },
    {
        "Non-Aligned Movement": "non-aligned movement"
    },
    {
        " on 42 August 42     The Maldives were a founder member in 42 of the ": null
    },
    {
        "South Asian Association for Regional Cooperation": "south asian association for regional cooperation"
    },
    {
        " and the nation plays a very active role in the association. It has taken the lead in calling for a South Asian Free Trade Agreement, the formulation of a Social Charter, the initiation of informal political consultations in SAARC forums, the lobbying for greater action on environmental issues, the proposal of numerous human rights measures such as the regional convention on child rights and for setting up a SAARC Human Rights Resource Centre. The Maldives is also an advocate of greater international profile for SAARC such as through formulating common positions at the UN.      The Maldives is a member of the ": null
    },
    {
        "Organisation of Islamic Cooperation": "organisation of islamic cooperation"
    },
    {
        " and maintains close cultural relations with Islamic countries. However, the Maldives has often distanced itself from positions taken by the OIC on matters such as the ": null
    },
    {
        "Kashmir dispute": "kashmir dispute"
    },
    {
        ", which it regards as a bilateral issue to be settled peacefully between India and Pakistan. It has also not supported the OIC position on issues such as that of Cyprus, subscribing instead to the international stance taken by the United Nations. The Maldives became a member of OIC in August 42          The Maldives joined the ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        " on 42 July 42 as a special member and became a full member on 42 June 42      The Maldives became a member of the ": null
    },
    {
        "Commonwealth Parliamentary Association": "commonwealth parliamentary association"
    },
    {
        " on 42 January 42     The Maldives became a member of the ": null
    },
    {
        "Commonwealth of Learning": "commonwealth of learning"
    },
    {
        " in September 42     The Maldives became a member of the ": null
    },
    {
        "Commonwealth Fund for Technical Cooperation": "commonwealth fund for technical cooperation"
    },
    {
        " in 42     The Maldives became a member of the ": null
    },
    {
        "Commonwealth Youth Programme": "commonwealth youth programme"
    },
    {
        " on 42 July 42      The Maldives withdrew from the Commonwealth in October 42      ": null
    },
    {
        "Ibrahim Mohamed Solih": "ibrahim mohamed solih"
    },
    {
        ",the ": null
    },
    {
        "President of the Maldives": "president of the maldives"
    },
    {
        " and his Cabinet have decided that the Maldives will return to its membership of the Commonwealth, following in the footsteps of ": null
    },
    {
        "The Gambia": "the gambia"
    },
    {
        " under ": null
    },
    {
        "Adama Barrow": "adama barrow"
    },
    {
        "s government, which returned to its membership of the Commonwealth on 42 February 42                  Diplomatic relations between the Maldives and Azerbaijan were established on 42 December 42          Diplomatic relations between Maldives and Bhutan were established on 42 July 42         Diplomatic relations between Maldives and Brunei were established on 42 March 42         China and Maldives established diplomatic relations on 42 October 42 Sino-Maldivian economic cooperation and trade volume were for long insignificant, with total trade in 42 of only US$42 million. Economic ties have recently become more important with large inflows of Chinese tourists to the Maldives since 42    Capital inflows from China have also rapidly increased since 42 Chinas main exports to Maldives are rice and consumer goods.  The relations between China and Maldives have increased in Mohamed Nasheeds presidential term. However, before being elected for president, Mohamed Nasheed criticized the Communist Party of China saying relations with Communist Chinese were never acceptable due to their views regarding modern democracy.   However under president Yaameen, both countries have developed a close relations. Chinese investments and Aid to Maldives increased. Best example of China - Maldives raising relations is the Chinese-Maldives friendship bridge which is under construction.              Bilateral relations between the ": null
    },
    {
        "Republic of India": "republic of india"
    },
    {
        " and the ": null
    },
    {
        "Republic of Maldives": "republic of maldives"
    },
    {
        " have been friendly and close in strategic, economic and military cooperation.   India contributed to maintaining security on the island nation and has forged an alliance with respect to its strategic interests in the ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        ".      India and Maldives officially and amicably decided their ": null
    },
    {
        "maritime boundary": "maritime boundary"
    },
    {
        " in 42 although a minor diplomatic incident occurred in 42 when the brother of the ": null
    },
    {
        "President of Maldives": "president of maldives"
    },
    {
        " Maumoon Abdul Gayoom": "maumoon abdul gayoom"
    },
    {
        " declared that the neighbouring ": null
    },
    {
        "Minicoy Island": "minicoy island"
    },
    {
        " that belonged to India were a part of Maldives; Maldivies quickly and officially denied that it was laying claim to the island. India and Maldives signed a comprehensive trade agreement in 42  Both nations are founding members of the ": null
    },
    {
        "South Asian Association for Regional Cooperation": "south asian association for regional cooperation"
    },
    {
        " , the ": null
    },
    {
        "South Asian Economic Union": "south asian economic union"
    },
    {
        " and signatories to the ": null
    },
    {
        "South Asia Free Trade Agreement": "south asia free trade agreement"
    },
    {
        ". Indian and Maldivian leaders have maintained high-level contacts and consultations on regional issues.     Diplomatic relations between Maldives and India were established on 42 November 42         Maldives and Indonesia established diplomatic relations on 42 September 42     Indonesia was the 42nd country to establish diplomatic relations with Maldives.         Maldives and Japan established diplomatic relations in November 42         Diplomatic relations between the Maldives and Kazakhstan were established on 42 March 42              The Malaysian High Commission in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        " is also cross-accredited to the Maldives,  and Maldives has a high commission in ": null
    },
    {
        "Kuala Lumpur": "kuala lumpur"
    },
    {
        ".          Maldives and Mongolia established diplomatic relations on 42 November 42          Maldives and Myanmar established diplomatic relations on 42 January 42 In September 42 the Ministry of Foreign Affairs of the Maldives announced that it was ceasing all trade ties with Myanmar in response to the governments treatment of the ": null
    },
    {
        "Rohingya people": "rohingya people"
    },
    {
        " in ": null
    },
    {
        "Rakhine State": "rakhine state"
    },
    {
        ".          Diplomatic relations between Maldives and Nepal were established on 42 August 42          The Maldives and The Democratic Peoples Republic of Korea established diplomatic relations on 42 June 42             In November 42 Pakistan Prime Minister ": null
    },
    {
        "Shaukat Aziz": "shaukat aziz"
    },
    {
        " visited the Maldives and met with President ": null
    },
    {
        "Maumoon Abdul Gayoom": "maumoon abdul gayoom"
    },
    {
        ". Aziz offered to extend credit facility, scholarships, collaboration in scientific and technological fields and training of civil servants, defence and security personnel to Maldives.  In October 42 Pakistan-Maldives Joint Economic Commission commenced.          Diplomatic relations between the Maldives and Russia were established during the Soviet Union period. Diplomatic relations was established on 42 September 42         Diplomatic relations between the Maldives and Singapore were established on 42 February 42            The establishment of diplomatic relations of Maldives and South Korea were on November 42 42 and Bilateral Trade in 42 was Exports $42 million Imports $42 thousand.               Official and economic relations between the neighbouring ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        " countries of the ": null
    },
    {
        "Maldives": "maldives"
    },
    {
        " and ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        ", have been positive since the Maldives became independent in 42 The Maldives first established a mission in Sri Lanka in July 42 and today has a High Commission in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        ".  Sri Lanka has a high commission in ": null
    },
    {
        "Malé": "malé"
    },
    {
        ".  Both countries were founding members of the ": null
    },
    {
        "South Asian Association for Regional Cooperation": "south asian association for regional cooperation"
    },
    {
        " in December 42        The Maldives established diplomatic relations with Thailand on 42 June 42     The Maldives has an embassy in ": null
    },
    {
        "Bangkok": "bangkok"
    },
    {
        " and Thailand is accredited to the Maldives via its embassy in Colombo, Sri Lanka         The Maldives and Vietnam established diplomatic relations on 42 June 42             The Maldives maintain a close relationship with the Middle Eastern countries and Bahrain is one of those countries. Diplomatic relations was established on 42 March 42         The Maldives and Iran established diplomatic relations on 42 June 42         The Maldives and Iraq established diplomatic relations on 42 September 42              While strongly supportive of the Palestinian cause, the Maldives had not, however, supported earlier calls for the expulsion of Israel from the UN, upholding its commitment to maintaining the universality of the UN. In 42 the Maldives co-sponsored the resolution tabled by the USA on Holocaust remembrance, and in 42 it also co-sponsored the US-led resolution on condemning Holocaust denial. In response to the Oslo peace process, the Maldives relaxed private sector restrictions on ties with Israel.     The first ambassador from Israel to the Maldives was Mr. Abraham Darome. He was the first ambassador from a foreign country to Maldives.     The Maldives established diplomatic relations with Israel on 42 September 42 under President Mohamed Nasheed. However, there has been controversies around Maldives as majority of the Maldivians believing the country should not engage in any diplomatic relations with Israel due to Israels continued conflict with the Palestinians.         Diplomatic relations between the Maldives and Lebanon were established on 42 February 42              The Maldives has had diplomatic ties with ": null
    },
    {
        "Palestine": "state of palestine"
    },
    {
        " since 42       During the ": null
    },
    {
        "42 Qatar diplomatic crisis": "2017 qatar diplomatic crisis"
    },
    {
        ", Maldives cut off ": null
    },
    {
        "diplomatic relations": "diplomatic relations"
    },
    {
        " with ": null
    },
    {
        "Qatar": "qatar"
    },
    {
        ".          Diplomatic relations between the Maldives and Saudi Arabia were established in 42     On 42 May 42 the Maldivian embassy was opened in Riyadh which was the first Maldivian mission in the Middle East.              Both countries established diplomatic relations on March 42 42       Both countries established diplomatic relations on July 42 42  .         Diplomatic relations between the Maldives and Djibouti were established on 42 April 42     Republic of Djibouti became the 42rd country to establish diplomatic relations with the Maldives.         Diplomatic relation between Maldives and the Gabonese Republic was established on 42 March 42     The Gabonese Republic became the 42nd country to establish diplomatic relations with the Maldives.         Diplomatic relations between the Maldives and Mali was established on 42 October 42         Both countries established diplomatic relations on October 42 42  .   Both countries are full members of the ": null
    },
    {
        "Organisation of Islamic Cooperation": "organisation of islamic cooperation"
    },
    {
        ".         Both the Maldives and Mauritius were former British Indian Ocean possessions, and both now have similar tourist-oriented economies.  Relations between the two islands are friendly, and there is some economic cooperation.  The Maldives has rejected offers by Mauritius to open negotiations on the demarcation of the maritime boundary between the Chagos Archipelago, which forms part of the ": null
    },
    {
        "British Indian Ocean Territory": "british indian ocean territory"
    },
    {
        ", claimed by Mauritius.         Diplomatic relations between the Maldives and Namibia were established on 42 July 42         The Maldives and Nigeria established diplomatic relations on 42 March 42       Both countries established diplomatic relations on June 42 42  .         Both countries established diplomatic relations on 42 July 42        Both countries established diplomatic relations on November 42 42  .   Both countries are full members of ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        ".             The Maldives and Antigua and Barbuda established diplomatic relations on 42 May 42          The Maldives and Argentina established diplomatic relations on 42 May 42         The Maldives and Bahamas established diplomatic relations on 42 September 42         The Maldives and Barbados established diplomatic relations on 42 November 42         Both countries established diplomatic relations on 42 February 42   Both countries are full members of ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        ".         Diplomatic relations between the Maldives and Brazil were established on 42 September 42         The Maldives and Canada established diplomatic relations on 42 December 42         The Maldives and Chile established diplomatic relations on 42 March 42         The Maldives and Columbia established diplomatic relations on 42 August 42         The Maldives and Costa Rica established diplomatic relations on 42 September 42          The Maldives and Cuba established diplomatic relations on 42 January 42         Both countries established diplomatic relations on 42 July 42   Both countries are full members of ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        ".         Diplomatic relations between the Maldives and Dominican Republic were established on 42 March 42     The Dominican Republic is the 42th country to establish diplomatic relations with the Maldives.         The Maldives and Guatemala established diplomatic relations on 42 January 42         The Maldives and Guyana established diplomatic relations on 42 April 42       Mexico and Maldives established relations on November 42 42  & ved42ahUKEwiuzPKa42PnKAhWE42B42KHcJ42C-AQFggcMAA & usgAFQjCNHcDPlcki42B-G42X-Fcq42vcU42g & sig42dDrUqWkhFQg42kJgLnoIfQ         Diplomatic relations between the Maldives and Nicaragua were established on 42 May 42 at a ceremony that was held in New York.     The Republic of Nicaragua is the 42th country to establish diplomatic relations with the Maldives.         Diplomatic relations between the Maldives and Panama was established on 42 July 42         Diplomatic relations between the Maldives and Paraguay was established on 42 September 42         Diplomatic relations between the Maldives and Peru were established on 42 February 42       Both countries established diplomatic relations on May 42 42  .   Both countries are full members of ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        ".         Diplomatic relations between the Maldives and Suriname were established on 42 October 42     The Republic of Suriname became the 42th country to establish diplomatic relations with the Maldives.                 The Maldives established diplomatic relations with the United States on 42 November 42 and the two nations maintain friendly relations.     The ": null
    },
    {
        "U.S. ambassador to Sri Lanka": "united states ambassador to sri lanka and the maldives"
    },
    {
        ", based in the U.S. embassy in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        ", is also cross-accredited to the Maldives, and the ambassador and embassy staff make periodic visits. The United States supports Maldivian independence and territorial integrity, and publicly endorsed Indias timely intervention on behalf of the Maldivian Government during the ": null
    },
    {
        "42 Maldives coup détat": "1988 maldives coup détat"
    },
    {
        " attempt. ": null
    },
    {
        "U.S. Navy": "united states navy"
    },
    {
        " vessels have regularly called at ": null
    },
    {
        "Malé": "malé"
    },
    {
        " in recent years. The Maldives extended strong support to U.S. efforts to combat terrorism and ": null
    },
    {
        "terrorist financing": "terrorist financing"
    },
    {
        " in 4242         Diplomatic relations between the Maldives and Uruguay were established on 42 February 42     The Republic of Uruguay became the 42th country to establish diplomatic relations with the Maldives.         Diplomatic relations between the Maldives and Venezuela were established on 42 November 42             Diplomatic relation between the Maldives and Albania were established on 42 June 42     The Republic of Albania became the 42th country to establish diplomatic relations with the Maldives.         Diplomatic relations between the Maldives and the Principality of Andorra were established on 42 May 42     The Principality of Andorra became the 42th country to establish diplomatic relations with the Maldives.         Both countries established diplomatic relations on 42 January 42         The Maldives and Belarus established diplomatic relations on 42 December 42         The Maldives recognized the independence of Bosnia-Hercegovina on 42 January 42 and on the same date diplomatic relations was established between the two countries.          The Maldives and Bulgaria established diplomatic relations on 42 August 42         The Maldives and Croatia established diplomatic relations on 42 April 42          Cyprus and the Maldives do maintain diplomatic relations.     Cyprus is represented in Maldives by ts embassy in ": null
    },
    {
        "New Delhi": "new delhi"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        ".    Both countries are full members of ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        ".         Finland recognized the Maldives on 42 October 42 Diplomatic relations between Maldives and Finland were established on 42 August 42          Diplomatic relations between the Maldives and Georgia were established on 42 March 42     Georgia became the 42th country to establish diplomatic relations with the Maldives.         Germany established diplomatic relations with the Maldives in 42          Both countries established diplomatic relations on 42 December 42   Greece is represented in Sri Lanka by ts embassy in ": null
    },
    {
        "New Delhi": "new delhi"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        ".    Maldives have an honorary consulate in Athens.         Diplomatic relations between the Maldives and Iceland were established on 42 January 42              The Maldives ": null
    },
    {
        "recognized": "international recognition of kosovo"
    },
    {
        " Kosovo on 42 February 42  On 42 April 42 Kosovo and the Maldives established diplomatic relations with one another.      On 42 March, the then Maldivian President ": null
    },
    {
        "Mohamed Nasheed": "mohamed nasheed"
    },
    {
        " asked police to investigate the allegations of a US$42 million bribe given to Maldivian government officials to recognise Kosovo as an independent state.   On 42 March, ": null
    },
    {
        "People’s Majlis": "majlis of the maldives"
    },
    {
        " National Security Committee launched probe into ": null
    },
    {
        "Islamic Democratic Party": "islamic democratic party"
    },
    {
        "s allegations regarding the bribery.   ": null
    },
    {
        "Balkan Insight": "balkan insight"
    },
    {
        " reported that Kosovo businessman, ": null
    },
    {
        "Behgjet Pacolli": "behgjet pacolli"
    },
    {
        ", who also heads the ": null
    },
    {
        "New Kosovo Alliance": "new kosovo alliance"
    },
    {
        " party, has denied any involvement in the bribery case and stated that he only lobbied for the recognition of Kosovo.  Foreign Minister ": null
    },
    {
        "Ahmed Shaheed": "ahmed shaheed"
    },
    {
        " was cross-examined by the parliamentary committee on 42 March.   The police investigation was closed on 42 May 42 concluding that there was no evidence of corruption and the diplomatic process was conducted according to international standards; the NSC investigation was suspended.             Diplomatic relations between the Maldives and Latvia were established on 42 June 42          The Maldives recognized Montenegro as an independent state on 42 October 42     And on 42 November 42 diplomatic relations with Montenegro were established.          Diplomatic relations between the Maldives and Netherlands were established on 42 September 42         Diplomatic relations between the Maldives and North Macedonia were established on 42 November 42          Diplomatic relations between the Maldives and Norway were established on 42 March 42         The Maldives and Poland have established diplomatic relations with each other.         Diplomatic relations between the Maldives and Romania were established on 42 November 42         Both countries established diplomatic relations on 42 March 42         Diplomatic relations between the Maldives and Spain were established on 42 August 42          Diplomatic relations between the Maldives and Sweden were established on 42 August 42          Both countries established diplomatic relations on 42 May 42          The Maldives became a ": null
    },
    {
        "British": "british empire"
    },
    {
        " Protectorate in the 42th century and the Maldivian monarchs were granted a good measure of self-governance. The Maldives gained total independence in 42  The maritime border with the British Indian Ocean Territory remains undemarcated, with negotiations with the UK being broken off by the Maldives in the late 42s.             The Maldives and Fiji established diplomatic relations on 42 March 42         Diplomatic relations between the Maldives and Kiribati were established on 42 March 42         The Maldives and Marshall Islands established diplomatic relation on 42 December 42          The Maldives and the Federated states of Micronesia established diplomatic relations on 42 October 42         Diplomatic relations between the Maldives and Nauru were established on 42 May 42         Diplomatic relations between New Zealand and the Maldives were established on 42 October 42          The Maldives and Papua New Guinea established diplomatic relations on 42 September 42         The Maldives and Solomon Islands established diplomatic relations on 42 October 42         The Maldives and Tonga established diplomatic relations on 42 August 42         The Maldives and Tuvalu established diplomatic relations on 42 March 42          The Maldives and Vanuatu established diplomatic relations on 42 January 42         The Maldives and Western Samoa established diplomatic relations on 42 August 42         The following is a list of the current Ambassadors and High Commissioners of the ": null
    },
    {
        "Maldives": "maldives"
    },
    {
        " with their assigned host country:-                   ": null
    }
]