[
    {
        "   The foreign relations of Laos , internationally designated by its official name as the Lao Peoples Democratic Republic, after the takeover by the ": null
    },
    {
        "Pathet Lao": "pathet lao"
    },
    {
        " in December 1975, were characterized by a hostile posture toward the West, with the government of the Lao Peoples Democratic Republic aligning itself with the ": null
    },
    {
        "Soviet bloc": "soviet bloc"
    },
    {
        ", maintaining close ties with the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and depending heavily on the Soviets for most of its foreign assistance. Laos also maintained a special relationship with Vietnam and formalized a 1977 treaty of friendship and cooperation that created tensions with China.     With the collapse of the Soviet Union and with Vietnams decreased ability to provide assistance, Laos has sought to improve relations with its regional neighbors and has emerged from ": null
    },
    {
        "international isolation": "international isolation"
    },
    {
        " through improved and expanded relations with other nations such as Pakistan, Saudi Arabia, China, Turkey, Australia, France, Japan, and Sweden. Trade relations with the United States were normalized in 2004. Laos was admitted into the ": null
    },
    {
        "Association of Southeast Asian Nations": "association of southeast asian nations"
    },
    {
        " in July 1997 and applied to join the ": null
    },
    {
        "World Trade Organization": "world trade organization"
    },
    {
        " in 1998. In 2005 it attended the inaugural ": null
    },
    {
        "East Asia Summit": "east asia summit"
    },
    {
        ".       Laos is a member of the following international organizations: ": null
    },
    {
        "Agency for Cultural and Technical Cooperation": "agency for cultural and technical cooperation"
    },
    {
        " , ASEAN, ": null
    },
    {
        "ASEAN Free Trade Area": "asean free trade area"
    },
    {
        " , ASEAN Regional Forum, ": null
    },
    {
        "Asian Development Bank": "asian development bank"
    },
    {
        ", ": null
    },
    {
        "Colombo Plan": "colombo plan"
    },
    {
        ", ": null
    },
    {
        "Economic and Social Commission for Asia and Pacific": "economic and social commission for asia and pacific"
    },
    {
        " , ": null
    },
    {
        "Food and Agriculture Organization": "food and agriculture organization"
    },
    {
        " , ": null
    },
    {
        "Group of 77": "group of 77"
    },
    {
        ", ": null
    },
    {
        "International Bank for Reconstruction and Development": "international bank for reconstruction and development"
    },
    {
        " , ": null
    },
    {
        "International Civil Aviation Organization": "international civil aviation organization"
    },
    {
        " , ": null
    },
    {
        "International Development Association": "international development association"
    },
    {
        " , ": null
    },
    {
        "International Fund for Agricultural Development": "international fund for agricultural development"
    },
    {
        " , ": null
    },
    {
        "International Finance Corporation": "international finance corporation"
    },
    {
        " , ": null
    },
    {
        "International Federation of Red Cross and Red Crescent Societies": "international federation of red cross and red crescent societies"
    },
    {
        ", ": null
    },
    {
        "International Labour Organization": "international labour organization"
    },
    {
        " , ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        " , ": null
    },
    {
        "Intelsat": "intelsat"
    },
    {
        " , and ": null
    },
    {
        "Interpol": "interpol"
    },
    {
        ".     Laos is also a member of the International Olympic Commission , International Telecommunication Union , Mekong Group, Non-Aligned Movement , Pacific Alliance , Permanent Court of Arbitration , United Nations, United Nations Convention on Trade and Development , United Nations Educational, Scientific and Cultural Organization , United Nations Industrial Development Organization , Universal Postal Union , World Federation of Trade Unions, World Health Organization , World Intellectual Property Organization , World Meteorological Organization , World Tourism Organization, World Trade Organization .                Laos has established relations with 134 countries  and the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ".   Laos has not yet established diplomatic relations with:   El Salvador, Honduras, Bolivia, Uruguay   Belize, Bahamas, Haiti, Antigua and Barbuda, St. Lucia, St. Vincent and the Grenadines, Barbados, Guyana, Suriname, Dominica, Trinidad and Tobago   Vatican City   Jordan, Bhutan   Botswana, Namibia, Swaziland, Lesotho, Comoros, Malawi, DRCongo, Congo, Burundi, Uganda, South Sudan, Eritrea, Djibouti, Central African Republic, Chad, Cameroon, Equatorial Guinea, Gabon, São Tomé and Príncipe, Togo, Burkina Faso, Sierra Leone, Guinea-Bissau, Senegal, Gambia, Cape Verde   Palau, Micronesia, Nauru, Cook Islands, Tuvalu, Kiribati, Marshall Islands, Niue, Solomon Islands, Tonga, Samoa   ": null
    },
    {
        "Sovereign Military Order of Malta": "sovereign military order of malta"
    },
    {
        " states with limited recognition": "list of states with limited recognition"
    },
    {
        ".          Both countries established diplomatic relations on April 21, 1998.             Brunei has an embassy in Vientiane, and Laos has an embassy in ": null
    },
    {
        "Bandar Seri Begawan": "bandar seri begawan"
    },
    {
        ".                    Relations with the Peoples Republic of China have improved over the years. Although the two were allies during the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", the ": null
    },
    {
        "Sino-Vietnamese War": "sino-vietnamese war"
    },
    {
        " in 1979 led to a sharp deterioration in Sino-Lao relations. These relations began to improve in the late 1980s. In 1989 Sino-Lao relations were normalized. In 2017 China invested in Laos under its ": null
    },
    {
        "Belt and Road Initiative": "belt and road initiative"
    },
    {
        ".             Following its occupation of Vietnam, France absorbed Laos into ": null
    },
    {
        "French Indochina": "french indochina"
    },
    {
        " via treaties with Siam in 1893 and 1904. During World War II, the Japanese occupied French Indochina. When Japan surrendered, Lao nationalists declared Laos independent, but by early 1946, French troops had reoccupied the country and conferred limited autonomy on Laos. During the ": null
    },
    {
        "First Indochina War": "indochina war"
    },
    {
        ", the ": null
    },
    {
        "Indochinese Communist Party": "indochinese communist party"
    },
    {
        " formed the ": null
    },
    {
        "Pathet Lao": "pathet lao"
    },
    {
        " resistance organization committed to Lao independence. Laos gained full independence following the French defeat by the Vietnamese communists and the subsequent ": null
    },
    {
        "Geneva peace conference": "geneva conference"
    },
    {
        " in 1954.     Today, Laos maintains an embassy in Paris.  France maintains an embassy in ": null
    },
    {
        "Vientiane": "vientiane"
    },
    {
        ".           Since established diplomatic relations on 1957, both nations enjoys cordial relations. Indonesia have an embassy in ": null
    },
    {
        "Vientiane": "vientiane"
    },
    {
        ", while Laos have an embassy in ": null
    },
    {
        "Jakarta": "jakarta"
    },
    {
        ". Indonesia supported and welcomed Laos membership to the ": null
    },
    {
        "Association of Southeast Asian Nations": "association of southeast asian nations"
    },
    {
        " in 1997. Laos and Indonesia agreed to enhance relations to focus on exploring the potential of both nations to cooperate on trade and investment. The two nations expressed a desire to reach further agreements relating to security, tourism, sport, air transport and education.  Indonesia through bilateral cooperation assist Laos on capacity building and development in various sectors, through scholarships, and trainings for Laos students.           During the collapse of the Communist Bloc, the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " could no longer afford aid for the development of Laos.  This made Laos seek aid from other countries to help develop their country and has led the country to adopt a neutral foreign policy. When this policy of neutrality was adopted, relations with Malaysia were established.                        Formal relations between Laos and the Philippines were officially established on January 14, 1955. Relations between the two countries were said to have started during the early period of the Vietnam War. Operation Brotherhood, a joint international venture by Jaycees International, sent 50 volunteer Filipino doctors, agriculturists, and nutritionists to Laos and Vietnam from 1957 to 1964. Laos has an embassy in Manila while the Philippines has an embassy in Vientiane.     Lao Prime Ministers Bounnhang Vorachith, Bouasone Bouphavanh and Thongsing Thammavong made their state visit to the Philippines in 2002, June 2007 and May 2012 respectively. Philippine Presidents Fidel V. Ramos visited Laos in October 1997. Philippine President Gloria Macapagal-Arroyo visited Laos in November 2004 for the ASEAN summit and Philippine President Benigno Aquino III visited Laos in November 2012 for the Asia-Europe Meeting Summit.     There are about 730 Filipinos in Laos as of 2013, mostly working as professionals as teachers, nurses, engineers, hotel employees and consultants. Filipinos are often offered lower fares on riding tuktuks compared to other foreigners. Filipinos are one of the biggest contributors to Laos English programs due to the English fluency possessed by most Filipinos.        ": null
    },
    {
        "embassy in Moscow": "embassy of laos in moscow"
    },
    {
        ".    Russia has an embassy in ": null
    },
    {
        "Vientiane": "vientiane"
    },
    {
        ".           Both countries have established diplomatic relations in 1962.         ": null
    },
    {
        "South Korea": "south korea"
    },
    {
        "n company in Laos which is currently the largest ": null
    },
    {
        "private enterprise": "private enterprise"
    },
    {
        ".  and Establishment of Diplomatic Relations : Jun.22, 1974 / Severance - Jul.24, 1975 / Reestablishment - Oct.25, 1995.             Thai-Lao relations were strained somewhat in 2006 ahead of the release of the sports comedy  Lucky Loser , which Lao diplomats warned might offend ": null
    },
    {
        "Lao people": "lao people"
    },
    {
        " and spark disturbances similar to the ": null
    },
    {
        "2003 Phnom Penh riots": "2003 phnom penh riots"
    },
    {
        ". The films release was cancelled.     Thailand is Laos principal means of access to the sea and its primary trading partner. Despite strong economic and cultural ties with Thailand, parts of the border shared by the two countries are indefinite. Within a year of serious border clashes in 1987, Lao and Thai leaders signed a communiqué, signaling their intention to improve relations. Since then, they have made slow but steady progress, notably the construction and opening of the Friendship Bridge between the two countries.            Laos-United States relations officially began when the United States opened a ": null
    },
    {
        "legation": "legation"
    },
    {
        " in Laos in 1950, when Laos was a semi-autonomous state within ": null
    },
    {
        "French Indochina": "french indochina"
    },
    {
        ". These relations were maintained after Laotian independence in 1954.     The U.S. government provided more than $13.4 million in foreign assistance to Laos in FY 2006, in areas including ": null
    },
    {
        "unexploded ordnance": "unexploded ordnance"
    },
    {
        " clearance and removal, health and ": null
    },
    {
        "avian influenza": "avian influenza"
    },
    {
        ", education, economic development, and ": null
    },
    {
        "governance": "governance"
    },
    {
        ".     In December 2004, ": null
    },
    {
        "George W. Bush": "george w. bush"
    },
    {
        " signed into law a bill extending normal trade relations to Laos. In February 2005, a ": null
    },
    {
        "bilateral trade agreement": "bilateral trade agreement"
    },
    {
        " between the two countries entered into force. There has been a consequent rise in Lao exports to the United States, although the volume of trade remains small in absolute terms. Bilateral trade reached $15.7 million in 2006, compared with $8.9 million in 2003. The Lao Government is working to implement the provisions of the BTA and on 2 February 2013 joined the ": null
    },
    {
        "World Trade Organization": "world trade organization"
    },
    {
        ".            Although Vietnams historical record of leadership over the Pathet Lao during the ": null
    },
    {
        "civil war": "laotian civil war"
    },
    {
        " and its military power and proximity will not cease to exist, Laos struck out ahead of Vietnam with its New Economic Mechanism to introduce market mechanisms into its economy. In so doing, Laos has opened the door to rapprochement with Thailand and China at some expense to its special dependence on Vietnam. Brown, MacAlister and Joseph J. Zasloff. Relations with Vietnam .  . ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " Federal Research Division": "federal research division"
    },
    {
        " . This article incorporates text from this source, which is in the ": null
    },
    {
        "public domain": "public domain"
    }
]