[
    {
        "     Since ": null
    },
    {
        "Slovenia": "slovenia"
    },
    {
        " declared independence in 1991, its ": null
    },
    {
        "Governments": "government of slovenia"
    },
    {
        " have underscored their commitment in improving cooperation with neighbouring countries and to actively contribute to international efforts aimed at bringing stability to ": null
    },
    {
        "Southeast Europe": "southeast europe"
    },
    {
        ". Resource limitations have nevertheless been a problem hindering the efficiency of the Slovenian diplomacy. In the 1990s, foreign relations, especially with ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", ": null
    },
    {
        "Austria": "austria"
    },
    {
        " and ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        ", triggered internal political controversies. In the last eight years, however, a wide consensus has been reached among the vast majority of Slovenian political parties to jointly work in the improvement of the countrys diplomatic infrastructure and to avoid politicizing the foreign relations by turning them into an issue of internal political debates.         Slovenia is engaged with 29 countries in bilateral military exchange - most actively with the ": null
    },
    {
        "United States": "united states"
    },
    {
        " - and in regional cooperative arrangements in ": null
    },
    {
        "Central": "central europe"
    },
    {
        " and ": null
    },
    {
        "Southeast Europe": "southeast europe"
    },
    {
        ". Slovenia participates in five major multinational regional peacekeeping bodies;   Together with ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        " and ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", Slovenia formed a ": null
    },
    {
        "Multinational Land Force": "multinational land force"
    },
    {
        " in April 1998 with regional ": null
    },
    {
        "peacekeeping": "peacekeeping"
    },
    {
        " ability. Further non-military cooperation within the Trilateral includes the fields of transportation infrastructure, fighting money laundering and ": null
    },
    {
        "organized crime": "organized crime"
    },
    {
        ", WMD non-proliferation, border controls, and environmental protection;   Slovenia is a member of Central European Nations Cooperation on Peacekeeping , together with ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        ", ": null
    },
    {
        "Czech Republic": "czech republic"
    },
    {
        ", ": null
    },
    {
        "Romania": "romania"
    },
    {
        ", ": null
    },
    {
        "Slovakia": "slovakia"
    },
    {
        ", and ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ". Within this organization, a combined infantry peacekeeping unit was formed March 1998;   Slovenia has observer status, like the United States, in Multinational Peacekeeping Force Southeast European , with other participants being ": null
    },
    {
        "Albania": "albania"
    },
    {
        ", ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        ", ": null
    },
    {
        "Greece": "greece"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", ": null
    },
    {
        "North Macedonia": "north macedonia"
    },
    {
        ", ": null
    },
    {
        "Romania": "romania"
    },
    {
        ", and ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ";   Slovenia joined 13 other nations in forming the brigade-sized ": null
    },
    {
        "Standby High-Readiness Brigade": "standby high-readiness brigade"
    },
    {
        " , headquartered in ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        ";   From May to July 1997, Slovenia contributed to Operation ALBA in Albania with a 25-person medical unit, which was well received and commended by the Italian commander. Thereafter, it continued to support efforts to restore stability in Albania by participating in the WEUs Multinational Advisory Police Element helping to reconstitute and train Albanian police. The government has pledged to the Albanian Government its continuing support;   Since November 1997, Slovenia has participated in its first ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " peacekeeping operation, contributing 27 troops to an Austrian UNFICYP contingent on Cyprus. Slovenia also has peacekeepers with the UN at Naharya Ogl, ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", on the ": null
    },
    {
        "Lebanese": "lebanon"
    },
    {
        " border.      ": null
    },
    {
        "IFOR": "ifor"
    },
    {
        " and is very engaged in the ": null
    },
    {
        "SFOR": "sfor"
    },
    {
        " effort, providing VIP support helicopter and light transport aircraft missions and use of an airbase in southern Slovenia;   Slovenia has provided a platoon of military police for the Italian-led ": null
    },
    {
        "Multinational Specialized Unit": "multinational specialized unit"
    },
    {
        " in ": null
    },
    {
        "Sarajevo": "sarajevo"
    },
    {
        " since January 1999;   Slovenias latest initiative is its International Trust Fund for Demining and Humanitarian Assistance in ": null
    },
    {
        "Bosnia and Herzegovina": "bosnia and herzegovina"
    },
    {
        ", which will finance up to $56 million in mine removal and victim rehabilitation services in the region.       Slovenias bilateral relations with its neighbors are generally good and cooperative. However, a few unresolved disputes with Croatia remain. They are related mostly to the succession of the ": null
    },
    {
        "former Yugoslavia": "former yugoslavia"
    },
    {
        ", including demarcation of their common border. In addition, unlike the other successor states of the former Yugoslavia, Slovenia did not normalize relations with the ": null
    },
    {
        "Federal Republic of Yugoslavia": "federal republic of yugoslavia"
    },
    {
        "  until after the passing from power of ": null
    },
    {
        "Slobodan Milošević": "slobodan milošević"
    },
    {
        "; although the Slovenes did open a representative office in ": null
    },
    {
        "Podgorica": "podgorica"
    },
    {
        " to work with Montenegrin President ": null
    },
    {
        "Milo Đukanovićs": "milo đukanović"
    },
    {
        "government.     Succession issues, particularly concerning liabilities and assets of the former Yugoslavia, remain a key factor in Slovenias relations in the region. On the whole, no conflicts mar relations with neighbors, which are on a sound footing. Numerous cooperative projects are either underway or envisioned, and bilateral and multilateral partnerships are deepening. Differences, many of which stem from Yugoslavias time, have been handled responsibly and are being resolved.                                  ": null
    }
]