[
    {
        "The foreign relations of the Cayman Islands  are largely managed from the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", as the islands remains ": null
    },
    {
        "one of 14 overseas territories": "british overseas territories"
    },
    {
        " under ": null
    },
    {
        "British jurisdiction and sovereignty": "british empire"
    },
    {
        ". However, the ": null
    },
    {
        "Government of the Cayman Islands": "government of the cayman islands"
    },
    {
        " have ": null
    },
    {
        "autonomy": "autonomy"
    },
    {
        " and often resolves important issues with foreign governments alone, without intervention from Britain. Although in its early days, the Cayman Islands most important relationships were with Britain and ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ", in recent years, this has shifted, and they now rely more so on the ": null
    },
    {
        "United States": "united states"
    },
    {
        " and ": null
    },
    {
        "Canada": "canada"
    },
    {
        ".     Though the Cayman Islands are involved in no major international disputes, they have come under some criticism due to the use of their territory for ": null
    },
    {
        "narcotics trafficking": "narcotics trafficking"
    },
    {
        " and ": null
    },
    {
        "money laundering": "money laundering"
    },
    {
        ". In an attempt to address this, the Government entered into the Narcotics Agreement of 1984 and the ": null
    },
    {
        "Mutual Legal Assistance Treaty": "mutual legal assistance treaty"
    },
    {
        " of 1986 with the United States, in order to reduce the use of their facilities associated with these activities. In more recent years, they have stepped up the fight against money laundering, by limiting banking secrecy, introducing requirements for customer identification and record keeping, and requiring banks to cooperate with foreign investigators.     Due to their status as an overseas territory of the UK, the Cayman Islands have no representation either on the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", or in most other international organizations. However, the Cayman Islands still participates in some international organisations, being a full member of the ": null
    },
    {
        "Central Development Bank": "central development bank"
    },
    {
        " and ": null
    },
    {
        "International Olympic Committee": "international olympic committee"
    },
    {
        ", an associate member of ": null
    },
    {
        "Caricom": "caricom"
    },
    {
        " and ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        ", and a member of a subbureau of ": null
    },
    {
        "Interpol": "interpol"
    },
    {
        ".                ": null
    }
]