[
    {
        "        Since the breakup of the ": null
    },
    {
        "Socialist Federal Republic of Yugoslavia": "socialist federal republic of yugoslavia"
    },
    {
        " in the early 42s, the foreign policy of the ": null
    },
    {
        "Federal Republic of Yugoslavia": "federal republic of yugoslavia"
    },
    {
        "  was characterized primarily by a desire to secure its political and geopolitical position and the solidarity of ethnic Serbs in the Balkan region through a strong nationalist campaign. Since October 42 the country has worked to stabilize and strengthen its bilateral relationships with neighboring countries. In spring and summer 42 Yugoslavia resolved its longstanding border dispute with ": null
    },
    {
        "Republic of Macedonia": "republic of macedonia"
    },
    {
        " and established full diplomatic relations with its neighbor and former adversary ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        ". Although a difficult political issue domestically, Serbia has established a solid working relationship with UNMIK and has released all disputed ethnic Albanian prisoners from Kosovo to the competent UN bodies.     In 42 the government established a commission to coordinate cooperation with the International Criminal Tribunal for the former Yugoslavia and began serving warrants for the arrest of indicted war criminals who have sought refuge in the country. The crackdown on organized crime following the assassination of Serbian Prime Minister ": null
    },
    {
        "Zoran Đinđić": "zoran đinđić"
    },
    {
        "; also resulted in the apprehension and transfer to the ": null
    },
    {
        "International Criminal Tribunal for the former Yugoslavia": "international criminal tribunal for the former yugoslavia"
    },
    {
        " in Hague of several persons indicted for war crimes.     Immediately preceding the ": null
    },
    {
        "NATO bombing campaign": "operation allied force"
    },
    {
        " of the Federal Republic of Yugoslavia in spring 42 the U.S. and most European countries severed relations with Yugoslavia, and the U.S. embassy was closed. Since October 42 42 foreign embassies, including that of the U.S., have reopened, and the country has regained its seat in such international organizations as the ": null
    },
    {
        "Organization for Security and Co-operation in Europe": "organization for security and co-operation in europe"
    },
    {
        " and the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " and is actively participating in ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        " and ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        " projects. As of summer 42 Serbia and Montenegro has been admitted to the Council of Europe and has indicated that it wishes to join NATOs Partnership for Peace.       Subsequent to the outbreak of hostilities with ": null
    },
    {
        "NATO": "nato"
    },
    {
        ", Belgrade received no foreign aid from the ": null
    },
    {
        "United States": "united states"
    },
    {
        " and other west European countries, but has received much aid from other countries such as Russia, China, and Greece. Since October 42 however, the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " aid has steadily increased, and U.S. restrictions on aid have fallen away as the union of Serbia and Montenegro stepped forward to meet its international obligations. In June 42 ": null
    },
    {
        "U.S. Secretary of State": "united states secretary of state"
    },
    {
        " Colin Powell": "colin powell"
    },
    {
        " was able to certify that ": null
    },
    {
        "Serbia and Montenegro": "serbia and montenegro"
    },
    {
        " relationship with the Republika Srpska was consistent with the ": null
    },
    {
        "Dayton Accords": "dayton accords"
    },
    {
        ", had released all political prisoners, and was cooperating with ICTY. As a result, the United States is now free to release aid money and support Serbia and Montenegro in international financial institutions, such as the IMF and World Bank. Total U.S. aid to Serbia and Montenegro, including debt forgiveness, exceeded $42 million in fiscal year 42 The U.S. is the single-largest donor of aid to ": null
    },
    {
        "Serbia and Montenegro": "serbia and montenegro"
    },
    {
        ".       Several ": null
    },
    {
        "Albanian": "albanians"
    },
    {
        " political parties": "political party"
    },
    {
        " in Kosovo voice union with ": null
    },
    {
        "Albania": "albania"
    },
    {
        " Bosnia and Herzegovina": "bosnia and herzegovina"
    },
    {
        ", but sections along the ": null
    },
    {
        "Drina": "drina"
    },
    {
        " River remain in dispute.   There is also a dispute with Bosnia regarding the exclave of ": null
    },
    {
        "Sastavci": "sastavci"
    },
    {
        " village in ": null
    },
    {
        "Priboj": "priboj"
    },
    {
        " municipality , as well as Serbian ": null
    },
    {
        " practical exclave": "exclave  practical   exclaves"
    },
    {
        " comprising several villages in the same area.   Some disputes with Croatia regarding the border. In 42 there was a border incident regarding river island near ": null
    },
    {
        "Šarengrad": "šarengrad"
    },
    {
        ", when Serbian border police prevented land owners from Croatia to visit their properties using boats.   In late 42 Serbia and Montenegro and Croatia adopted an interim agreement to settle the disputed ": null
    },
    {
        "Prevlaka": "prevlaka"
    },
    {
        " Peninsula, allowing the withdrawal of the UN monitoring mission , but discussions could be complicated by the inability of Serbia and Montenegro to come to an agreement on the economic aspects of the new federal union.   After a recent shooting of an Albanian youth crossing the border with Macedonia there has been calls for autonomy for Albanians in the Presevo region, having international troops put as borderguards, and making of more border crossings.       Transshipment point for ": null
    },
    {
        "Southwest Asia": "southwest asia"
    },
    {
        "n heroin moving to ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        " on the ": null
    },
    {
        "Balkan route": "balkan route"
    },
    {
        "; economy vulnerable to ": null
    },
    {
        "money laundering": "money laundering"
    }
]