[
    {
        "   The foreign relations of Norway are based on the countrys membership in ": null
    },
    {
        "NATO": "nato"
    },
    {
        " and within the workings of the United Nations . Additionally, despite not being a member of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " , Norway takes a part in the ": null
    },
    {
        "integration": "european integration"
    },
    {
        " of EU through its membership in the ": null
    },
    {
        "European Economic Area": "european economic area"
    },
    {
        ". ": null
    },
    {
        "Norway": "norway"
    },
    {
        "s foreign ministry includes both the minister of foreign affairs and minister of international development.          The ": null
    },
    {
        "Ministry of Foreign Affairs": "norwegian ministry of foreign affairs"
    },
    {
        " was established on the same day that Norway ": null
    },
    {
        "declared the dissolution of the union": "dissolution of the union between norway and sweden in 1905"
    },
    {
        " with Sweden: June 42 42 Although diplomats could not present credentials to foreign governments until the Swedish king formally renounced his right to the Norwegian throne, a number of unofficial representatives worked on the provisional governments behalf until the first Norwegian ambassador, ": null
    },
    {
        "Hjalmar Christian Hauge": "hjalmar christian hauge"
    },
    {
        ", sought accreditation by the United States Secretary of State ": null
    },
    {
        "Elihu Root": "elihu root"
    },
    {
        " on November 42 42     The initial purposes of the newly formed Foreign Ministry were to represent Norways interests through diplomatic channels, and to provide consular services for Norwegian shipping and commerce overseas. In 42 the ": null
    },
    {
        "Storting": "storting"
    },
    {
        " decided to establish six embassies in Europe, with two more in the Americas: one in the United States and one in ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ". 42 consular offices were also opened.     During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the foreign ministry was confronted with unprecedented challenges in maintaining neutrality for Norway, in particular in order to protect its merchant fleet.     In 42 the ministry was consolidated and reorganised to ensure fuller cooperation between the diplomatic and consular branches. The reorganization included the formation of a designated career path for diplomats that included completion of a university entrance examination and professional experience from international trade. The economic hardship of the times forced austerity measures at the ministry for the next several years.     When Norway was invaded by ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " in 42 the government fled to the United Kingdom and reconstituted in exile in ": null
    },
    {
        "Bracknell": "bracknell"
    },
    {
        ", outside London. ": null
    },
    {
        "Kingston House": "kingston house"
    },
    {
        " in London was later used. The government moved back to Norway following the peace in 42     After the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Norway was a founding member of the ": null
    },
    {
        "North Atlantic Treaty Organisation": "north atlantic treaty organisation"
    },
    {
        " and the United Nations, the latter having Norwegian ": null
    },
    {
        "Trygve Lie": "trygve lie"
    },
    {
        " as inaugural ": null
    },
    {
        "Secretary-General": "united nations secretary-general"
    },
    {
        ".             Since the end of the Cold War, Norway has developed a model to foreign policy known as the Norwegian model, the goal of which is to contribute to peace and stability through coordinated response among governmental and non-governmental Norwegian organizations; acting as an honest broker in international conflicts; an informal network of Norwegian individuals with access and credibility among parties; and the willingness to take the long view in international issues.     The post-war foreign policy of Norway can be described along four dimensions:       Norways strategic importance for waging war in the North Atlantic became important in the failed neutrality policy of World War II. Norway became a founding member of NATO in order to ally itself with countries that shared its democratic values. Both through diplomatic and military cooperation, Norway has played a visible role in the formation and operations of NATO. It allowed a limited number of military bases and exercises to be based in its territories, which caused some controversy when NATO decided to put forward bases in Northern Norway in preparation for a conflict with the Soviet Union.       ": null
    },
    {
        "Norway": "norway"
    },
    {
        " supports international cooperation and the peaceful settlement of disputes, recognizing the need for maintaining a strong national defence through ": null
    },
    {
        "collective security": "collective security"
    },
    {
        ". Accordingly, the cornerstones of Norwegian policy are active membership in ": null
    },
    {
        "NATO": "nato"
    },
    {
        " and support for the United Nations and its specialized agencies. Norway also pursues a policy of economic, social, and cultural cooperation with other Nordic countries—": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", ": null
    },
    {
        "Finland": "finland"
    },
    {
        ", and ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        "—through the ": null
    },
    {
        "Nordic Council": "nordic council"
    },
    {
        ". Its relations with ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        " are very close due to the cultural bond the two nations share. Norway ended a 42-year term on the ": null
    },
    {
        "UN Security Council": "un security council"
    },
    {
        " in January 42 and chaired the ": null
    },
    {
        "Iraq Sanctions Committee": "iraq sanctions committee"
    },
    {
        ".     Norway is the only Scandinavian country that is not a member of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ". Membership has been proposed within Norway, and referendums over Norwegian membership were held in 42 and 42 Popular opinion was split between rural and urban areas. See Norway and the European Union .     The present government is not planning to raise the possibility for future membership.     Norway also has a history of co-operation and friendship with the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", due to their shared cultural heritage since Viking times. The Vikings conquered areas including the ": null
    },
    {
        "Hebrides": "hebrides"
    },
    {
        ", Orkney and ": null
    },
    {
        "Shetland": "shetland"
    },
    {
        " for several hundred years. Norway is only 42 kilometres  east of ": null
    },
    {
        "Unst": "unst"
    },
    {
        ", the northernmost island of Shetland. The Norwegian embassy to the United Kingdom is located in London, and Norway also maintains a Consulate General in ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ". A Norway Spruce is given by the city of Oslo and presented to London as a Christmas tree for display in ": null
    },
    {
        "Trafalgar Square": "trafalgar square"
    },
    {
        " as a token of gratitude for the UKs support during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". King Haakon, his son Crown Prince Olav and the countrys government lived in exile in London throughout the war. As part of the tradition, the Lord Mayor of Westminster visits Oslo in the late autumn to take part in the felling of the tree, and the Mayor of Oslo then goes to London to light the tree at the Christmas ceremony.         Norway has played an active role as a third party mediator in a number of international conflicts. The late foreign minister ": null
    },
    {
        "Johan Jørgen Holst": "johan jørgen holst"
    },
    {
        " was instrumental in forging the ": null
    },
    {
        "Oslo Accords": "oslo accords"
    },
    {
        " between ": null
    },
    {
        "Israel": "israel"
    },
    {
        " and the ": null
    },
    {
        "PLO": "plo"
    },
    {
        ". ": null
    },
    {
        "Thorvald Stoltenberg": "thorvald stoltenberg"
    },
    {
        " was part of the unsuccessful mediation team in seeking an end to the war in ": null
    },
    {
        "Bosnia": "bosnia and herzegovina"
    },
    {
        ". Norway has contributed both mediation services and financial assistance in ": null
    },
    {
        "Guatemala": "guatemala"
    },
    {
        ".     As of 42 Norwegian diplomats are acting as mediators in ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        ", ": null
    },
    {
        "Bosnia": "bosnia and herzegovina"
    },
    {
        ", ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        ", and ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ". Some of those countries accuse Norway of supporting and propping up separatist groups. ": null
    },
    {
        "Israel": "israel"
    },
    {
        " is often bitter with harsh criticisms from Norwegian politicians. The spat was at its highest when finance minister ": null
    },
    {
        "Kristin Halvorsen": "kristin halvorsen"
    },
    {
        " supported boycott of Israeli goods.  in early 42 Finance ministry spokesman, Runar Malkenes, told the BBC News website that there are no moves to push for a boycott of Israeli goods at government level.  ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        " has been actively supported by ": null
    },
    {
        "Norway": "norway"
    },
    {
        " during its liberation from ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        ".  As of recent, Ethiopia expelled six Norwegian diplomats due to Norways alleged support to Terrorist group and Eritrea.  Norway retaliated by cutting aid to ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        ".       Territorial claims in ": null
    },
    {
        "Antarctica": "antarctica"
    },
    {
        "  are only recognized by Australia, France, ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        " and the United Kingdom.       A number of scholars have argued that Norway has through its foreign policy engaged in status-seeking.   Through an activist foreign policy, Norway has sought to elevate its standing among the international systems small powers and middle powers, and earn recognition from the great powers.                              ": null
    }
]