[
    {
        " Belgium  is a country in Europe and member of major international organizations like the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " and ": null
    },
    {
        "NATO": "nato"
    },
    {
        " which are both headquartered in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", Belgium.     As a federal state, the ": null
    },
    {
        "Communities and Regions": "communities, regions and language areas of belgium"
    },
    {
        " have their own foreign relations and are able to conclude treaties themselves.          Because of its location at the crossroads of ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        ", Belgium has historically been the route of invading armies from its larger neighbours. With virtually defenceless borders, Belgium has traditionally sought to avoid domination by the more powerful nations which surround it through a policy of mediation. The ": null
    },
    {
        "Concert of Europe": "concert of europe"
    },
    {
        " sanctioned the creation of ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " in 42 on the condition that the country remain strictly ": null
    },
    {
        "neutral": "neutral country"
    },
    {
        ".     This policy of neutrality ended after the experience of German occupation during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". In the years preceding ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Belgium tried to return to a policy of neutrality, but once again, Germany invaded the country. In 42 Belgium signed the ": null
    },
    {
        "Treaty of Brussels": "treaty of brussels 1948"
    },
    {
        " with the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", and ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        ", and one year later became one of the founding members of the ": null
    },
    {
        "Atlantic Alliance": "atlantic alliance"
    },
    {
        ".       The Belgians have been strong advocates of ": null
    },
    {
        "European integration": "european integration"
    },
    {
        ", and most aspects of their foreign, economic, and trade policies are coordinated through the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " , which has its main headquarters  in Brussels. Belgiums postwar customs union with the Netherlands and Luxembourg paved the way for the formation of the ": null
    },
    {
        "European Community": "european community"
    },
    {
        " , of which Belgium was a founding member.     Likewise, the Benelux abolition of internal border controls was a model for the wider ": null
    },
    {
        "Schengen Accord": "schengen treaty"
    },
    {
        ", which today is integrated in the ": null
    },
    {
        "acquis communautaire": "acquis communautaire"
    },
    {
        " and aims at common visa policies and free movement of people across common borders. At the same time the Belgians, perceiving their diminutive role on the international scene, are strong advocates of strengthening economic and political integration within the EU. Belgium actively seeks improved relations with the new democracies of central and eastern Europe through such fora as the ": null
    },
    {
        "Organization for Security and Cooperation in Europe": "organization for security and cooperation in europe"
    },
    {
        ", EU association agreements, and ": null
    },
    {
        "NATO": "nato"
    },
    {
        "s ": null
    },
    {
        "Partnership for Peace": "partnership for peace"
    },
    {
        " with the former ": null
    },
    {
        "Warsaw Pact": "warsaw pact"
    },
    {
        " countries and several others.       Belgium remains a strong proponent of ": null
    },
    {
        "NATO": "nato"
    },
    {
        ". It cooperates closely with the ": null
    },
    {
        "United States": "united states"
    },
    {
        " within the alliance framework, in addition to supporting European defense efforts through the ": null
    },
    {
        "Western European Union": "western european union"
    },
    {
        " . Both ": null
    },
    {
        "NATO": "nato"
    },
    {
        " and the EU have their headquarters in Brussels; SHAPE  is in the south of the country, near Mons. Since January 42 the WEU has been headquartered in Brussels.          Belgium has been one of the strongest supporters of NATO since the inception of the alliance in 42 Having suffered through two invasions in two world wars, Belgium was aware of its security needs and the limitations of its means for self-defense. As a result, the leaders of that nation began calling for the formation of a defensive alliance shortly after the liberation of Belgium at the end of World War II. In March 42 Belgium joined with France, Luxembourg, the Netherlands, and Britain in an agreement to establish a joint defense system. This agreement, known as the ": null
    },
    {
        "Treaty of Brussels": "treaty of brussels"
    },
    {
        ", was a recognition that individual national responses to the threat of aggression were inadequate and that a united defense effort was necessary for mutual security.     In 42 after expressions of concern by several European states that the Treaty of Brussels was too limited in scope and effectiveness, the prime minister of Canada called for a mutual defense system comprising Western Europe and North America. On April 42 42 the foreign minister of Belgium joined with representatives from Britain, Canada, Denmark, France, Iceland, Italy, Luxembourg, the Netherlands, Norway, Portugal, and the United States in signing the treaty forming NATO. Greece and Turkey became members in 42 West Germany joined the alliance in 42 and Spain became a member in 42 The treaty established NATO as a multilateral political alliance that binds its members to obligations of mutual defense and economic cooperation.     During the Cold War, Belgiums major NATO roles included: participating in the defense of the central European region by air-land defense of an army corps area in the Federal Republic of Germany ; military defense of its national territory and its immediate sea approaches, and the organization, defense and support of allied Lines of Communication ; and maintaining a mobile Belgian task force with a land component issued from a para-commando regiment and an air transport command.     Belgium has influenced the alliance policy in many ways. One of the countrys most prominent international statesmen, Paul Henri Spaak, served as secretary general of NATO from 42 to 42 When France withdrew from the military operations of NATO in 42 the Supreme Headquarters Allied Powers Europe was transferred to ": null
    },
    {
        "Mons": "mons"
    },
    {
        ", in a rural area southwest of Brussels. Six months later, the organizations political headquarters was also relocated to Brussels.     In 42 the North Atlantic Council formally adopted a proposal, formulated by Belgian foreign minister ": null
    },
    {
        "Pierre Harmel": "pierre harmel"
    },
    {
        ", that altered the nature of NATO policy. The Harmel plan called for NATO to be partially transformed from an entirely defensive system to one designed to encourage East-West détente and increased political consultation among the members of the alliance. By the late 42s, however, the optimistic policy of East- West rapprochement had deteriorated. Arms control negotiations were not achieving results, and the NATO countries became increasingly concerned about the Soviet military buildup.     In December 42 the members of NATO decided to modernize the Europe-based United States nuclear arsenal by deploying 42 new ground-launched missile systems in Western Europe that were capable of reaching the Soviet Union. The deployment would consist of 42 ": null
    },
    {
        "Pershing II": "pershing ii"
    },
    {
        " ballistic missiles and 42 ": null
    },
    {
        "BGM42G Ground Launched Cruise Missiles ": "bgm-109g ground launched cruise missile"
    },
    {
        ", all armed with single nuclear warheads. The missiles were to be deployed in five countries: the Pershing IIs and some cruise missiles in West Germany and cruise missiles only in Britain, Italy, the Netherlands, and Belgium. The NATO allies also agreed to attempt negotiations with the Soviet Union in order to limit further nuclear deployment in Europe. The NATO decision was an integrated, or dual-track, approach involving both modernization and arms control negotiation.     During the consultations that preceded the NATO decision, the Belgian coalition government was described as supportive of the proposed missile deployment. The NATO ministers expected the government to endorse the proposal and accept the missile deployment on Belgian territory. Domestic opposition, especially from the Dutch-speaking ": null
    },
    {
        "Socialist Party Differently ": "socialistische partij anders"
    },
    {
        ", however, caused the government to condition its support for the deployment policy. Belgium endorsed the decision to modernize the nuclear capability of NATO but wavered on its applicability to Belgian territory. The government was unable to concentrate fully on the issue of deployment in 42 because of its preoccupation with linguistic and economic issues.     In September 42 however, the government issued an ambiguous non-decision that allowed supporters and opponents of deployment to claim victory. Belgian acceptance was linked to progress in the Intermediate Nuclear Force , negotiations being conducted by the United States and NATO with the Soviet Union and the Warsaw Pact. If the negotiations did not succeed in lessening tensions between the states, then Belgium would, in concert with its Allies, take all the measures agreed upon by the NATO partners , i.e., would allow the missiles to be stationed on Belgian territory. There would also be semiannual review of this 42 policy until a firm decision could be made.     The SP continued to be the political group most strongly opposed to deployment. It made opposition to deployment one of its reasons for participating in the government, and its leaders have made a considerable political investment in the issue. The leader of the SP, ": null
    },
    {
        "Karel Van Miert": "karel van miert"
    },
    {
        ", saw the initial NATO decision as an example of overwhelming American pressure on the Europeans and stressed that deployment in Belgium be linked to a possible INF agreement with the Soviet Union. However, the underlying rationale for opposition by the SF may have been lack of economic gain to the Dutch-speaking areas of Belgium.     The opposition may also have been mounted as a reaction to the strong anti-nuclear sentiment in neighboring countries, namely, the Netherlands and West Germany. The French-speaking ": null
    },
    {
        "Socialist Party ": "parti socialiste"
    },
    {
        " has not seriously opposed deployment. The lack of PS opposition may have been positively influenced by the economic benefits to ": null
    },
    {
        "Wallonia": "wallonia"
    },
    {
        " that would result from deployment in that region.     Because of the fragility of coalition politics, as well as the continued economic strain in late 42 the Belgian government was still unable to make a firm decision on cruise missile deployment. It has nonetheless taken initial steps to implement the plan, including the selection and construction of a site for the missiles at ": null
    },
    {
        "Florennes": "florennes"
    },
    {
        ". A large number of Belgian officials continued to support the NATO dual-track decision and stressed Belgian willingness to counteract any increased Soviet threat to Western Europe. Nevertheless, in late 42 it seemed likely that the government would continue to postpone a final decision as long as possible.     The approval of the 42 Belgian decision to accept Ground Launched Cruise Missiles at Florennes, Belgium, and its subsequent implementation, was a highly political and controversial issue. During the negotiations, however, there was never a question of Belgiums support for the NATO alliance. Indeed, when the time came to act, Prime Minister ": null
    },
    {
        "Wilfried Martens": "wilfried martens"
    },
    {
        " announced in March 42 his governments final agreement to the installation of the missiles.     Despite some opposition, Belgium generally supported the NATO modernization programs for air defense and intermediate-range nuclear weapons. Ground-launched cruise missiles were assigned to a base in Florennes in the province of Namur and were expected to be operational by early 42; however, the final decision on Belgian acceptance of the missiles was subject to domestic political considerations. In late 42 improvements in the air defense system were subject to intense debate; decisions to upgrade the existing defense system were based on economic, not military, considerations.       Belgium has been involved in regional integration since the first half of the 42th century, first with the ": null
    },
    {
        "Belgium-Luxembourg Economic Union": "belgium-luxembourg economic union"
    },
    {
        ", founded in 42 and then, since 42 with the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " and ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        " in the ": null
    },
    {
        "Benelux": "benelux"
    },
    {
        ".       A peculiar feature of Belgian ": null
    },
    {
        "federalism": "federalism"
    },
    {
        " is the fact that the countrys ": null
    },
    {
        "Communities and Regions": "communities, regions and language areas of belgium"
    },
    {
        " maintain their own international relations, including the conclusion of treaties. Thus, there are a number of bilateral Dutch-Flemish international institutions, such as the ": null
    },
    {
        "Dutch Language Union": "dutch language union"
    },
    {
        " or the institutions for the control of the river ": null
    },
    {
        "Scheldt": "scheldt"
    },
    {
        ", in which only ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        " takes part. Likewise, only the ": null
    },
    {
        "French Community of Belgium": "french community of belgium"
    },
    {
        " takes part in ": null
    },
    {
        "La Francophonie": "la francophonie"
    },
    {
        ". For instance, UNVs Online Volunteering service received a financial contribution from the Federal Public Service Foreign Affairs, Foreign Trade and Development Cooperation of the Kingdom of Belgium for the years 42 and 42 to support the outreach to the francophone world and the promotion of volunteerism.  Ministers of the Communities and the Regions represent Belgium in the Council of the European Union when their competencies are dealt with.          Belgium retains special but often stormy relationships with its former colonies, ": null
    },
    {
        "Congo": "democratic republic of the congo"
    },
    {
        ", ": null
    },
    {
        "Rwanda": "rwanda"
    },
    {
        " and ": null
    },
    {
        "Burundi": "burundi"
    },
    {
        ". The current constitution of Democratic Republic of the Congo was designed with the assistance of Belgian legal scholars.       Belgium has resorted several times to international dispute settlement, notably in cases at both the ": null
    },
    {
        "International Court of Justice": "international court of justice"
    },
    {
        " and the ": null
    },
    {
        "Permanent Court of Arbitration": "permanent court of arbitration"
    },
    {
        " with the Netherlands concerning the diversion of water from the Meuse the frontier at the ": null
    },
    {
        "enclave": "enclave"
    },
    {
        " of ": null
    },
    {
        "Baarle-Hertog": "baarle-hertog"
    },
    {
        " and the revitalisation of the so-called ": null
    },
    {
        "Iron Rhine": "iron rhine"
    },
    {
        " railroad . There have been other points of contention with the Netherlands, such as the deepening of the river Scheldt or the route for the high-speed rail link between Brussels and Amsterdam. This does however not influence the overall amicable character of Belgo-Dutch relationship.     Other former cases at international courts between Belgium and other countries are  — in chronological order  — the ": null
    },
    {
        "Oscar Chinn Case": "oscar chinn case"
    },
    {
        " of 42 ": null
    }
]