[
    {
        "   The ": null
    },
    {
        "Byelorussian SSR": "byelorussian ssr"
    },
    {
        " was one of only two ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " republics to be separate members of the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " . Both republics and the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " joined the UN when the organization was founded in 1945.       After the ": null
    },
    {
        "dissolution of the Soviet Union": "dissolution of the soviet union"
    },
    {
        ", at which time Belarus gained its independence, Belarus became a member of the ": null
    },
    {
        "Commonwealth of Independent States": "commonwealth of independent states"
    },
    {
        " , the ": null
    },
    {
        "Organization for Security and Cooperation in Europe": "organization for security and cooperation in europe"
    },
    {
        " , ": null
    },
    {
        "NATOs": "nato"
    },
    {
        " Partnership for Peace": "partnership for peace"
    },
    {
        ", the ": null
    },
    {
        "North Atlantic Cooperation Council": "north atlantic cooperation council"
    },
    {
        ", the ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        ", and the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        ". The adoption by Supreme Council of the BSSR of the declaration of State Sovereignty of Belarus in 1990 was a turning point on the development of the state. It has also been ": null
    },
    {
        "in a supranational union with Russia": "union state"
    },
    {
        " since 2 April 1996, although this has had little practical effect.          The introduction of ": null
    },
    {
        "free trade": "free trade"
    },
    {
        " between Russia and Belarus in mid-1995 led to a spectacular growth in bilateral trade, which was only temporarily reversed in the wake of the ": null
    },
    {
        "financial crisis of 1998": "history of post-soviet russiathe crises of 1998"
    },
    {
        ". President ": null
    },
    {
        "Alexander Lukashenko": "alexander lukashenko"
    },
    {
        " sought to develop a closer relationship with Russia. The framework for the Union of Russia and Belarus was set out in the Treaty On the Formation of a Community of Russia and Belarus , the Treaty on Russia-Belarus Union, the Union Charter , and the Treaty of the Formation of a Union State . The integration treaties contained commitments to ": null
    },
    {
        "monetary union": "monetary union"
    },
    {
        ", ": null
    },
    {
        "equal rights": "civil rights"
    },
    {
        ", single citizenship, and a common defence and ": null
    },
    {
        "foreign policy": "foreign policy"
    },
    {
        ".          Following the recognition of Belarus as an independent state in December 1991 by the ": null
    },
    {
        "European Community": "european community"
    },
    {
        ", EC/EU-Belarus relations initially experienced a steady progress. The signature of the Partnership and Cooperation Agreement in 1995 signaled a commitment to political, economic and trade cooperation. Some assistance was provided to Belarus within the framework of the ": null
    },
    {
        "TACIS": "tacis"
    },
    {
        " programme and also through various aid programs and loans. However, progress in EU-Belarus relations stalled in 1996 after serious setbacks to the development of democracy, and the ": null
    },
    {
        "Drazdy conflict": "drazdy conflict"
    },
    {
        ". The EU did not recognize the 1996 constitution, which replaced the 1994 constitution. The ": null
    },
    {
        "Council of the European Union": "council of the european union"
    },
    {
        " decided against Belarus in 1997: The PCA was not concluded, nor was its trade-related part; Belarusian membership in the ": null
    },
    {
        "Council of Europe": "council of europe"
    },
    {
        " was not supported; bilateral relations at the ministerial level were suspended and EU technical assistance programs were frozen.   Acknowledging the lack of progress in relation to bilateral relations and the internal situation following the position adopted in 1997, the EU adopted a step-by-step approach in 1999, whereby sanctions would be gradually lifted upon fulfillment of the four benchmarks set by the ": null
    },
    {
        "Organization for Security and Co-operation in Europe": "organization for security and co-operation in europe"
    },
    {
        ". In 2000, some moderately positive developments toward the implementation of recommendations made by the OSCE AMG were observed but were not sufficient in the realm of access to fair and free elections.       The United States has encouraged Belarus to conclude and adhere to agreements with the ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        " on the program of macroeconomic stabilization and related reform measures, as well as to undertake increased privatization and to create a favorable climate for business and investment. Although there has been some American direct private investment in Belarus, its development has been relatively slow given the uncertain pace of reform. An Overseas Private Investment Corporation agreement was signed in June 1992 but has been suspended since 1995 because Belarus did not fulfill its obligations under the agreement. Belarus is eligible for ": null
    },
    {
        "Export-Import Bank": "export-import bank of the united states"
    },
    {
        " short-term financing ": null
    },
    {
        "insurance": "insurance"
    },
    {
        " for U.S. investments, but because of the adverse business climate, no projects have been initiated. The IMF granted standby credit in September 1995, but Belarus has fallen off the program and did not receive the second tranche of funding, which had been scheduled for regular intervals throughout 1996.     The United States - along with the European Union - has restricted the travel of President Alexander Lukashenko and members of his inner circle, as well as imposing economic sanctions.               The structure of Belarus trade reflects the low competitiveness and output decline of manufacturing industry in the country over the past decade, leading to the predominance of primary production, work-intensive goods as exports. Belarusian exports to the EU consist mainly of agricultural and textile products, while imports from the EU are primarily machinery.     Belarus is a beneficiary of the EUs Generalised System of Preferences . The European Commission decided in 2003 to initiate an investigation into violations of freedom of association in Belarus as the first step towards a possible temporary withdrawal of the GSP from Belarus.     In December 2004, the EU adopted a position aimed at imposing travel restrictions on officials from Belarus responsible for the fraudulent parliamentary elections and referendum on 17 October 2004, and for human rights violations during subsequent peaceful political demonstrations in ": null
    },
    {
        "Minsk": "minsk"
    },
    {
        ".   The ": null
    },
    {
        "European Parliament": "european parliament"
    },
    {
        " released a statement in March 2005 in which it denounced the Belarusian government as a dictatorship. The European parliamentarians were primarily concerned about the suppression of independent media outlets in the country and the fraudulent referendum. A resolution of the European Parliament declared that the personal bank accounts of President Lukashenko and other high-ranking Belarusian officials should be tracked and frozen.     In 2005, ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        " reported a pattern of deliberate obstruction, harassment and intimidation of human rights defenders in Belarus. ": null
    },
    {
        "Reporters Without Borders": "reporters without borders"
    },
    {
        " accused the Belarusian authorities of hounding and arresting journalists from the countrys Polish minority. Lukashenko has closed the countrys main Polish newspaper, printing a bogus paper instead with the same name and size that praises his incumbent government. Several foreign, mainly Polish, journalists have been arrested or expelled from the country. Lukashenko accused Poland of an attempt to overthrow his government by stirring up a peaceful revolution in Belarus comparable to the ": null
    },
    {
        "Orange Revolution": "orange revolution"
    },
    {
        " in ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " in 2004.     Later in 2005 the Belarusian ": null
    },
    {
        "riot police": "riot police"
    },
    {
        " seized the headquarters of the ": null
    },
    {
        "Union of Poles in Belarus": "union of poles in belarus"
    },
    {
        ", an association representing the 400,000 ": null
    },
    {
        "ethnic minority": "ethnic minority"
    },
    {
        " Polish living in western areas the country that were part of Poland until ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The dispute between Poland and Belarus escalated further as Poland responded by recalling its ambassador from Belarus for indefinite consultations, and called on the European Union to impose sanctions on the Belarusian leadership in order to curtail the ": null
    },
    {
        "human rights": "human rights"
    },
    {
        " abuses in Belarus. Belarusian papers described this as a dirty political game, and part of a cold war waged on president Lukashenko. Polish Foreign Minister ": null
    },
    {
        "Adam Rotfeld": "adam rotfeld"
    },
    {
        " said a clampdown was under way, aimed at destroying  all elements of political pluralism and independence  in Belarus.        In August 2005 the EUs executive commission called for human rights to be respected in Belarus. The commission said it was considering offering support to independent media in the country and had set aside more than eight million euros from its budget to offer support for human rights activities. France expressed her solidarity with Poland on the issue of human rights in Belarus a day after the EU declared it was worried about the situation in that country. Several former Soviet Republics, including neighbouring Ukraine, also expressed their concerns about the development of the situation in Belarus.     In May 2009 Belarus and the EU agree on cooperation in the ": null
    },
    {
        "Eastern Partnership": "eastern partnership"
    },
    {
        " . However, it is contended by some scholars that the is unable to create a workable partnership. ": null
    },
    {
        "Elena Korosteleva": "elena korosteleva"
    },
    {
        ", The Limits of the EU Governance: Belarus Response to the European Neighbourhood Policy , Contemporary Politics, Vol. 15, June 2009, pp. 229–45 This proved to be correct when Belarus withdrew from the Partnership on 30 September 2011. ,  Eur Activ , 2011-10-30     In August 2012, Belarus expelled all ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " diplomats, including the Swedish Ambassador to Belarus, Stefan Eriksson, and closed its embassy in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ", after a Swedish ": null
    },
    {
        "public relations": "public relations"
    },
    {
        " firm released ": null
    },
    {
        "teddy bears": "teddy bear"
    },
    {
        "carrying pro-democracy flyers in parachutes from an airplane over Minsk on 4 July 2012. Lukashenko also fired his air defence chief and the head of the border guards over the incident. Their replacements have been told not to hesitate to use force to stop future intrusions from abroad. ,  BBC News , 2012-08-08          Russia remains the largest and most important partner for Belarus both in the political and economic fields. After protracted disputes and setbacks, the two countries ": null
    },
    {
        "customs duties were unified": "customs union"
    },
    {
        " in March 2001 but the customs controls were soon restored. In terms of trade, almost half of Belarusian export goes to Russia. Due to the structure of Belarusian ": null
    },
    {
        "industry": "industry"
    },
    {
        ", Belarus relies heavily on Russia both for export markets and for the supply of ": null
    },
    {
        "raw materials": "raw material"
    },
    {
        "and components. After initial negotiation with the ": null
    },
    {
        "Russian Central Bank": "central bank of the russian federation"
    },
    {
        " on ": null
    },
    {
        "monetary union": "monetary union"
    },
    {
        ", the ": null
    },
    {
        "Russian ruble": "russian ruble"
    },
    {
        " was set to be introduced in Belarus in 2004, but this was postponed first until 2005, then until 2006, and now seems to have been suspended indefinitely.          Belarus has had an ongoing discussion to relaunch IMF-backed reforms, concluding an arrangement for an IMF Staff-monitored program in 2001. However, the authorities did not follow through with reforms as hoped, leaving an uncertain future for IMF-backed cooperation. Belarus authorities have said on several occasions that they find IMF intervention and recommendations in Belarus counter-productive to the economic development of those countries.   The relationships with the United States have been further strained, after ": null
    },
    {
        "Congress of the United States": "congress of the united states"
    },
    {
        " unanimously passed the ": null
    },
    {
        "Belarus Democracy Act of 2004": "belarus democracy act of 2004"
    },
    {
        ".     On 7 March 2008 the government of Belarus ejected US Ambassador ": null
    },
    {
        "Karen B. Stewart": "karen b. stewart"
    },
    {
        " from the country, following a row over travel restrictions placed on President Lukashenko and sanctions against state-owned chemical company ": null
    },
    {
        "Belneftekhim": "belneftekhim"
    },
    {
        ". The Belarusian Foreign Ministry announced at the same time that it was recalling its own ambassador to the US. This was followed by the expulsion of ten other U.S. embassy staff from Minsk in late April. At the same time the government of Belarus ordered the U.S. Embassy in Minsk to cut its staff by half.     A ": null
    },
    {
        "White House": "white house"
    },
    {
        " spokesman described the expulsion as deeply disappointing .       Due to strained relations with the United States and the European Union, as well as occasional high-level disputes with Russia over prices on core imported natural resources such as oil and gas, Belarus aims to develop better relations with countries in other regions like Middle East, Asia, and ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        ". Rafal Czachor, Polityka wielowektorowości Republiki Białoruś – geneza, podstawy konceptualne, przykłady realizacji, Wrocławski Przegląd Międzynarodowy, Vol. 1, 2011, pp.54-56,                                      ": null
    }
]