[
    {
        "     The foreign policy of the Netherlands is based on four basic commitments: to the ": null
    },
    {
        "Atlantic cooperation": "atlanticism"
    },
    {
        ", to ": null
    },
    {
        "European integration": "european integration"
    },
    {
        ", to ": null
    },
    {
        "international development": "international development"
    },
    {
        " and to ": null
    },
    {
        "international law": "international law"
    },
    {
        ". While historically the ": null
    },
    {
        "Kingdom of the Netherlands": "kingdom of the netherlands"
    },
    {
        " was a neutral state, since 1945 it has become a member of ": null
    },
    {
        "NATO": "nato"
    },
    {
        ", the United Nations, the European Union and many other international organisations. The Dutch economy is very open and relies on international trade. During and after the 17th century—its ": null
    },
    {
        "Golden Age": "dutch golden age"
    },
    {
        "--the Dutch built up a commercial and colonial empire. It was a leading shipping and naval power and was often at war with England, its main rival. Its main colonial holding was Indonesia, which fought for and achieved independence after 1945. The historical ties inherited from its colonial past still influence the foreign relations of the Netherlands. Foreign trade policy is handled by the European Union. The Dutch have been active in international peacekeeping roles.             In the ": null
    },
    {
        "Dutch Golden Age": "dutch golden age"
    },
    {
        ", which had its zenith around 1667, there was a flowering of trade, industry, the arts and the ": null
    },
    {
        "sciences": "list of people from the dutch golden agescience"
    },
    {
        ". A rich worldwide ": null
    },
    {
        "Dutch empire": "dutch empire"
    },
    {
        " developed and the ": null
    },
    {
        "Dutch East India Company": "dutch east india company"
    },
    {
        " became one of the earliest and most important of national mercantile companies based on entrepreneurship and trade.     During the 18th century the power and wealth of the Netherlands declined. A series of wars with the more powerful ": null
    },
    {
        "British": "anglo-dutch wars"
    },
    {
        " and ": null
    },
    {
        "French": "franco-dutch war"
    },
    {
        " neighbors weakened it. Britain seized the North American colony of ": null
    },
    {
        "New Amsterdam": "new amsterdam"
    },
    {
        ", turning it into New York. There was growing unrest and ": null
    },
    {
        "conflict": "second stadtholderless periodcrisis and the orangist revolution of 1747"
    },
    {
        " between the ": null
    },
    {
        "Orangists": "orangism"
    },
    {
        " and the ": null
    },
    {
        "Patriots": "patriottentijd"
    },
    {
        ". The French Revolution spilled over after 1789, and a pro-French ": null
    },
    {
        "Batavian Republic": "batavian republic"
    },
    {
        " was established in 1795–1806. Napoleon made it a satellite state, the ": null
    },
    {
        "Kingdom of Holland": "kingdom of holland"
    },
    {
        " , and later simply a French imperial province.     In 1815–1940 it was neutral and played a minor role in world diplomacy, apart from a failed effort to control Belgium ": null
    },
    {
        "before giving up in 1839.": "belgian revolution"
    },
    {
        " A. Vandenbosch, Dutch Foreign Policy since 1815 . It was invaded and cruelly treated by Germany in 1940–45, with starvation and killing the Jews the main Nazi policies.          The Dutch Government conducted a review of foreign policy main themes, organization, and funding in 1995. The document The Foreign Policy of the Netherlands: A Review outlined the new direction of Dutch foreign policy. The Netherlands prioritizes enhancing European integration, maintaining relations with neighboring states, ensuring European security and stability , and participating in conflict management and peacekeeping missions. The foreign policy review also resulted in the reorganization of the ": null
    },
    {
        "Ministry of Foreign Affairs": "ministry of foreign affairs"
    },
    {
        ". Through the creation of regional departments, the Ministry coordinates tasks previously divided among the international cooperation, foreign affairs, and economic affairs sections.          Dutch security policy is based primarily on membership in NATO, which the Netherlands co-founded in 1949. Because of Dutch participation in NATO ": null
    },
    {
        "nuclear weapons": "netherlands and weapons of mass destruction"
    },
    {
        " are stationed in the Netherlands, see ": null
    },
    {
        "Volkel Air Base": "volkel air basepossible nuclear weapons"
    },
    {
        ".     The Dutch also pursue defense cooperation within Europe, both multilaterally – in the context of the ": null
    },
    {
        "Western European Union": "western european union"
    },
    {
        " and the ": null
    },
    {
        "European Security and Defence Policy": "european security and defence policy"
    },
    {
        " of the EU – and bilaterally, as in the German-Netherlands Corps. In recent years, the Dutch have become significant contributors to UN peacekeeping efforts around the world as well as to the Stabililzation Force in Bosnia and Herzegovina  in Bosnia.       The Dutch have been strong advocates of European integration, and most aspects of their foreign, economic, and trade policies are coordinated through the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " . The Dutch postwar customs union with ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " and ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        "  paved the way for the formation of the European Community , of which the Netherlands was a founding member. Likewise, the Benelux abolition of internal border controls was a model for the wider ": null
    },
    {
        "Schengen Accord": "schengen treaty"
    },
    {
        ", which today has 29 European signatories pledged to common visa policies and free movement of people across common borders.     The Dutch stood at the cradle of the 1992 ": null
    },
    {
        "Maastricht Treaty": "maastricht treaty"
    },
    {
        " and have been the architects of the ": null
    },
    {
        "Treaty of Amsterdam": "treaty of amsterdam"
    },
    {
        " concluded in 1998. The Dutch have thus played an important role in European political and monetary integration; indeed, until the year 2003, Dutchman ": null
    },
    {
        "Wim Duisenberg": "wim duisenberg"
    },
    {
        " headed the European Central Bank. In addition, Dutch financial minister Gerrit Zalm was the main critic of the violation of the ": null
    },
    {
        "Stability and Growth Pact": "stability and growth pact"
    },
    {
        " by France and Germany in 2004 and 2005.            The Netherlands is among the worlds leading aid donors, giving almost $8  billion, about 0.8% of its gross national income in official development assistance . It is one of five countries worldwide that meets the longstanding UN ODA target of 0.7% ODA/GNI. The country consistently contributes large amounts of aid through multilateral channels, especially the ": null
    },
    {
        "United Nations Development Programme": "united nations development programme"
    },
    {
        ", the international financial institutions, and EU programs. A large portion of Dutch aid funds also are channeled through private organizations that have almost total autonomy in choice of projects.     The Netherlands is a member of the ": null
    },
    {
        "European Bank for Reconstruction and Development": "european bank for reconstruction and development"
    },
    {
        ", which recently initiated economic reforms in central Europe. The Dutch strongly support the ": null
    },
    {
        "Middle East peace process": "projects working for peace among israelis and arabs"
    },
    {
        " and in 1998 earmarked $29  million in contributions to international donor-coordinated activities for the occupied territories and also for projects in which they worked directly with ": null
    },
    {
        "Palestinian": "palestinian people"
    },
    {
        " authorities. These projects included improving environmental conditions and support for multilateral programs in cooperation with local non-governmental organizations. In 1998, the Dutch provided significant amounts of aid to the former Yugoslavia and Africa. The Dutch consistently provide significant amounts of ": null
    },
    {
        "humanitarian relief aid": "humanitarian aid"
    },
    {
        " to the victims of the worst natural disasters, such as the ": null
    },
    {
        "Hurricane Mitch": "hurricane mitch"
    },
    {
        " in ": null
    },
    {
        "Central America": "central america"
    },
    {
        " in 1998, ": null
    },
    {
        "2004 Indian Ocean earthquake and tsunami": "2004 indian ocean earthquake and tsunami"
    },
    {
        " in ": null
    },
    {
        "South": "south asia"
    },
    {
        " and ": null
    },
    {
        "Southeast Asia": "southeast asia"
    },
    {
        ", the ": null
    },
    {
        "Hurricane Katrina": "hurricane katrina"
    },
    {
        " in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " in 2005, ": null
    },
    {
        "2010 Haiti earthquake": "2010 haiti earthquake"
    },
    {
        ", and more recent catastrophes in ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        " and ": null
    },
    {
        "Burma": "burma"
    },
    {
        " including the ": null
    },
    {
        "Typhoon Haiyan": "typhoon haiyan"
    },
    {
        " in the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        " in 2013, and ": null
    },
    {
        "2015 Nepal earthquake": "april 2015 nepal earthquake"
    },
    {
        ".       Developing countries aspiring to purchase foreign goods and services to invest in, inter alia, port facilities, roads, public transport, health care, or drinking water facilities may be eligible for a special Dutch grant facility. The grant facility, known as ORET serves to award grants to governments of developing countries for making payments to foreign suppliers. , via Google Docs. Retrieved 2011-10-23.          A centuries-old tradition of legal scholarship has made the Netherlands the home of the ": null
    },
    {
        "International Court of Justice": "international court of justice"
    },
    {
        "; the ": null
    },
    {
        "Iran-United States Claims Tribunal": "iran-united states claims tribunal"
    },
    {
        "; the ": null
    },
    {
        "International Criminal Tribunal for the former Yugoslavia": "international criminal tribunal for the former yugoslavia"
    },
    {
        "; the ": null
    },
    {
        "International Criminal Tribunal for Rwanda": "international criminal tribunal for rwanda"
    },
    {
        "; and the ": null
    },
    {
        "International Criminal Court": "international criminal court"
    },
    {
        " . In addition it hosts the European police organization, ": null
    },
    {
        "Europol": "europol"
    },
    {
        "; and the ": null
    },
    {
        "Organisation for the Prohibition of Chemical Weapons": "organisation for the prohibition of chemical weapons"
    },
    {
        ".            As a relatively small country, the Netherlands generally pursues its foreign policy interests within the framework of multilateral organizations. The Netherlands is an active and responsible participant in the United Nations system as well as other multilateral organizations such as the ": null
    },
    {
        "Organization for Security and Cooperation in Europe": "organization for security and cooperation in europe"
    },
    {
        ", ": null
    },
    {
        "Organisation for Economic Co-operation and Development": "organisation for economic co-operation and development"
    },
    {
        " , ": null
    },
    {
        "World Trade Organization": "world trade organization"
    },
    {
        " , and ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        ".     The Netherlands is one of the founding members of what today is the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ". It was one of the first countries to start European integration, through the ": null
    },
    {
        "Benelux": "benelux"
    },
    {
        " in 1944 and the ": null
    },
    {
        "European Coal and Steel Community": "european coal and steel community"
    },
    {
        " in 1952. Being a small country with a history of neutrality it was the host country for the important ": null
    },
    {
        "Maastricht Treaty": "maastricht treaty"
    },
    {
        " and ": null
    },
    {
        "Amsterdam Treaty": "amsterdam treaty"
    },
    {
        " and is the seat of the ": null
    },
    {
        "International Court of Justice": "international court of justice"
    },
    {
        ".          The country is one of the major producers of illicit ": null
    },
    {
        "amphetamines": "amfetamine"
    },
    {
        " and other synthetic drugs. It also functions as an important gateway for ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        ", heroin, and ": null
    },
    {
        "hashish": "hashish"
    },
    {
        " entering Europe. A large portion of the worlds ": null
    },
    {
        "XTC": "ecstasy"
    },
    {
        " consumption is supplied by illegal ": null
    },
    {
        "laboratories": "laboratory"
    },
    {
        " from the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ".     The Dutch also work with the U.S. and other countries on international programs against drug trafficking and organized crime. The Dutch-U.S. cooperation focuses on joint anti-drug operations in the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        ", including an agreement establishing ": null
    },
    {
        "Forward Operating Locations": "forward operating site"
    },
    {
        " on the Dutch Kingdom islands of ": null
    },
    {
        "Curaçao": "curaçao"
    },
    {
        " and ": null
    },
    {
        "Aruba": "aruba"
    },
    {
        ". The Netherlands is a signatory to international counter-": null
    },
    {
        "narcotics": "narcotics"
    },
    {
        " agreements, a member of the United Nations ": null
    },
    {
        "International Drug Control Program": "international drug control"
    },
    {
        ", the UN ": null
    },
    {
        "Commission on Narcotic Drugs": "commission on narcotic drugs"
    },
    {
        ", and is a contributor to international counter-narcotics.     From June 26 until December 22, 2006, two children, Ammar and Sara , lived in the Dutch ": null
    },
    {
        "embassy": "diplomatic mission"
    },
    {
        " in ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        " because of a ": null
    },
    {
        "child custody": "child custody"
    },
    {
        " dispute between the Dutch mother, supported by Dutch law and the ": null
    },
    {
        "Hague Convention on the Civil Aspects of International Child Abduction": "hague convention on the civil aspects of international child abduction"
    },
    {
        ", and the Syrian father, supported by Syrian law . The children had been living in Syria since 2004, after an alleged ": null
    },
    {
        "international child abduction": "child abductioninternational child abduction"
    },
    {
        " by the father from the Netherlands to Syria, during a ": null
    },
    {
        "family contact": "contact"
    },
    {
        " in which he supposedly would visit Paris with them. The children fled to the embassy because they would like to live with their mother in the Netherlands. ": null
    },
    {
        "Minister of Foreign Affairs": "minister of foreign affairs"
    },
    {
        " Ben Bot": "ben bot"
    },
    {
        " travelled to Damascus, negotiated and on December 22 the children finally could return to the Netherlands.     The father claims that the Dutch government has promised not to prosecute him for the abduction. However, a Dutch prosecutor claims that he is free to prosecute the father and may well do that, and that the Dutch have only retracted the international request to arrest him outside the Netherlands. See also ": null
    },
    {
        ":nl:Ammar en Sara": ":nl:ammar en sara"
    },
    {
        "Mark Ruttes": "mark rutte"
    },
    {
        "government provided materials to the ": null
    },
    {
        "Levant Front": "levant front"
    },
    {
        " rebel group in ": null
    },
    {
        "Syria": "syria"
    },
    {
        ".  In September 2018, the Dutch public prosecution department declared the Levant Front to be a criminal organisation of terrorist intent , describing it as a ": null
    },
    {
        "salafist": "salafism"
    },
    {
        " and jihadistic group that strives for the setting up of the caliphate .      In July 2019, the UN ambassadors from 22 nations, including Netherlands, signed a joint letter to the ": null
    },
    {
        "UNHRC": "united nations human rights council"
    },
    {
        " condemning China’s mistreatment of the ": null
    },
    {
        "Uyghurs": "uyghurs"
    },
    {
        " as well as its mistreatment of other minority groups, urging the Chinese government to close the ": null
    },
    {
        "Xinjiang re-education camps": "xinjiang re-education camps"
    },
    {
        ".         The Caribbean islands of ": null
    },
    {
        "Aruba": "aruba"
    },
    {
        ", ": null
    },
    {
        "Curaçao": "curaçao"
    },
    {
        ", ": null
    },
    {
        "Sint Maarten": "sint maarten"
    },
    {
        ", ": null
    },
    {
        "Bonaire": "bonaire"
    },
    {
        ", ": null
    },
    {
        "Sint Eustatius": "sint eustatius"
    },
    {
        " and ": null
    },
    {
        "Saba": "saba"
    },
    {
        " are dependencies of the Netherlands. The latter three are part of the Netherlands proper and are collectively known as the ": null
    },
    {
        "Caribbean Netherlands": "caribbean netherlands"
    },
    {
        ". ": null
    },
    {
        "Suriname": "suriname"
    },
    {
        " and ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        " became independent of the Netherlands in the period of decolonization: Suriname in 1975 and Indonesia in 1945 .                                     ": null
    }
]