[
    {
        "        The foreign relations of Latvia are the primary responsibility of the ": null
    },
    {
        "Ministry of Foreign Affairs": "Ministry Of Foreign Affairs"
    },
    {
        ". Todays Republic of Latvia regards itself as a continuation of the 1918–1940 republic. After the declaration on the restoration of its full independence on August 21, 1991, ": null
    },
    {
        "Latvia": "Latvia"
    },
    {
        " became a member of the United Nations on September 17, 1991, and is a signatory to a number of UN organizations and other international agreements. Latvia welcomes further cooperation and integration with ": null
    },
    {
        "NATO": "Nato"
    },
    {
        ", ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ", ": null
    },
    {
        "OECD": "Organisation For Economic Co-Operation And Development"
    },
    {
        " and other Western organizations. It also seeks more active participation in UN peacekeeping efforts worldwide.     ": null
    },
    {
        "Council of Europe": "Council Of Europe"
    },
    {
        ", ": null
    },
    {
        "CERCO": "Cerco"
    },
    {
        ", ": null
    },
    {
        "International Council for the Exploration of the Sea": "International Council For The Exploration Of The Sea"
    },
    {
        ", ": null
    },
    {
        "International Civil Aviation Organization": "International Civil Aviation Organization"
    },
    {
        ", ": null
    },
    {
        "International Atomic Energy Agency": "International Atomic Energy Agency"
    },
    {
        ", ": null
    },
    {
        "UNESCO": "Unesco"
    },
    {
        ", ": null
    },
    {
        "UNICEF": "Unicef"
    },
    {
        ", ": null
    },
    {
        "International Criminal Court": "International Criminal Court"
    },
    {
        ", the ": null
    },
    {
        "World Bank": "World Bank"
    },
    {
        ", ": null
    },
    {
        "International Monetary Fund": "International Monetary Fund"
    },
    {
        ", and the ": null
    },
    {
        "European Bank for Reconstruction and Development": "European Bank For Reconstruction And Development"
    },
    {
        ". It also is a member of the ": null
    },
    {
        "Organization for Security and Co-operation in Europe": "Organization For Security And Co-Operation In Europe"
    },
    {
        " and of the North Atlantic Coordinating Council.     On September 20, 2003, in a nationwide referendum, the Latvians voted to join the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " and Latvias EU membership took effect on May 1, 2004. Latvia became a member state of ": null
    },
    {
        "NATO": "Nato"
    },
    {
        " on March 29, 2004.     Through its Ministry of Foreign Affairs, Latvia maintains embassies in Argentina, Austria, Belarus, Belgium, Canada, the Peoples Republic of China, the Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, India, Israel, Italy, Lithuania, Netherlands, Nicaragua, Norway, Poland, Portugal, Russia, South Africa, South Korea, Sweden, Ukraine, the United Kingdom, the United States, and Uzbekistan.        It also operates missions to the United Nations in New York City and Geneva, to the European Union, the Chemical Weapons Nonproliferation Organization, the OSCE, NATO, ": null
    },
    {
        "World Trade Organization": "World Trade Organization"
    },
    {
        ", and the ": null
    },
    {
        "Food and Agriculture Organization": "Food And Agriculture Organization"
    },
    {
        " of the United Nations.     Latvia has a Consulate General in Russia; Consulates in Belarus and Russia; Honorary Consulates General in Australia, Cyprus, India, Israel, and Norway; and Honorary Consulates in Argentina, Australia, Austria, Belarus, Brazil, Canada, Chile, Cyprus, Denmark, Egypt, Finland, France, Georgia, Germany, Greece, Iceland, Ireland, Israel, Italy, Jordan, Kazakhstan, Kyrgyzstan, Lebanon, Luxembourg, Mexico, Moldova, Netherlands, Norway, Pakistan, Philippines, Poland, Singapore, South Africa, South Korea, Spain, Sweden, Switzerland, Thailand, Turkey, and Venezuela.                      Ongoing talks over ": null
    },
    {
        "maritime boundary": "Maritime Boundary"
    },
    {
        " dispute with Lithuania, primary concern is oil exploration rights; however, matters between two countries remain fairly peaceful.       Treaty delimiting the boundary with Russia has been signed and ratified in 2007, under the treaty the ": null
    },
    {
        "Abrene district": "Abrene District"
    }
]