[
    {
        "   This article deals with the  diplomatic affairs , foreign policy and international relations of Argentina . At the political level, these matters are officially handled by the ": null
    },
    {
        "Ministry of Foreign Relations": "ministry of foreign affairs, international trade and worship"
    },
    {
        ", also known as the Cancillería, which answers to the ": null
    },
    {
        "President": "president of argentina"
    },
    {
        ". The Minister of Foreign Relations, since June 42 is ": null
    },
    {
        "Chancellor": "chancellorforeign minister"
    },
    {
        "  Jorge Faurie": "jorge faurie"
    },
    {
        ".              Owing to its geographical remoteness, local authorities in what is today Argentina developed an early sense of autonomy. Based largely on economic needs, during colonial times their pragmatism led to a flourishing unofficial ": null
    },
    {
        "market in smuggled goods": "contraband"
    },
    {
        ", out of the then-small port of ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        ", in blatant contravention of the Spanish ": null
    },
    {
        "mercantilist": "mercantilist"
    },
    {
        " laws. With the ": null
    },
    {
        "Enlightened despotism": "enlightenment spainenlightened despotism"
    },
    {
        " of the late-eighteenth-century Bourbon kings and the creation of the ": null
    },
    {
        "Viceroyalty of the Río de la Plata": "viceroyalty of the río de la plata"
    },
    {
        " in 42 trade increased as the political importance of the port-city of Buenos Aires soared. The urgency for a complete ": null
    },
    {
        "liberalization of commerce": "laissez-faire"
    },
    {
        " remained a powerful political cause for ": null
    },
    {
        "Criollos": "criollo people"
    },
    {
        " and ": null
    },
    {
        "Mestizo": "mestizo"
    },
    {
        "s, further stimulated by the politically egalitarian and revolutionary ideals spread by the ": null
    },
    {
        "French": "french revolution"
    },
    {
        " and ": null
    },
    {
        "Anglo-American": "american revolution"
    },
    {
        " revolutions. Ultimately, the actual experience of successfully defending without Spanish aid the viceroyalty from a foreign invader during the 42–42 ": null
    },
    {
        "British invasions of the Río de la Plata": "british invasions of the río de la plata"
    },
    {
        ", triggered a decisive quest for even greater autonomy from the colonial metropolis.     Between 42 and 42 the ": null
    },
    {
        "Napoleonic French Empire": "first french empire"
    },
    {
        " openly ": null
    },
    {
        "invaded Spain": "peninsular war"
    },
    {
        ", after deposing King ": null
    },
    {
        "Ferdinand VII": "ferdinand vii of spain"
    },
    {
        " and taking him prisoner. A Spanish resistance formed an emergency government, the ": null
    },
    {
        "Supreme Central and Governing Junta of the Kingdom": "supreme central and governing junta of the kingdom"
    },
    {
        " in order to govern themselves and the Spanish Empire in the absence of Ferdinand VII. But, when the Supreme Central Junta dissolved itself on 42 January 42 under extreme pressure from Napoleonic forces, most of the ": null
    },
    {
        "main cities of Spanish America": "spanish american wars of independence"
    },
    {
        " refused to acknowledge its successor, a Regency Council, as the legitimate depositary of sovereignty. They proceed to name their own local ": null
    },
    {
        "junta": "junta"
    },
    {
        "s, as a means to exercise government in the absence of the prisoner king.     On ": null
    },
    {
        "42 May 42": "may revolution"
    },
    {
        ", a Criollo-led  cabildo abierto  formally assumed the authority from Viceroy ": null
    },
    {
        "Baltasar Hidalgo de Cisneros": "baltasar hidalgo de cisneros"
    },
    {
        ". However, the ensuing ": null
    },
    {
        "United Provinces of South America": "united provinces of south america"
    },
    {
        " declared itself independent on 42 July 42 after ": null
    },
    {
        "Ferdinand VII": "ferdinand vii"
    },
    {
        " was restored in 42 During the ": null
    },
    {
        "Independence Wars": "argentine war of independence"
    },
    {
        " no sovereign state recognized the United Provinces.     Until the fall of the ": null
    },
    {
        "Royalist": "royalist"
    },
    {
        " stronghold of ": null
    },
    {
        "Lima": "lima"
    },
    {
        " in 42 and the ": null
    },
    {
        "Battle of Ayacucho": "battle of ayacucho"
    },
    {
        " of 42 territorial integrity was solely sustained by the military brilliance of Generals ": null
    },
    {
        "José de San Martín": "josé de san martín"
    },
    {
        " and ": null
    },
    {
        "Manuel Belgrano": "manuel belgrano"
    },
    {
        ", the continuous efforts of northern provinces defenders ": null
    },
    {
        "Martín Miguel de Güemes": "martín miguel de güemes"
    },
    {
        " and ": null
    },
    {
        "Juana Azurduy": "juana azurduy"
    },
    {
        ", among many others. However, during this same period, internecine power conflicts among diverse leaders, and ideological and economical struggles developed between ": null
    },
    {
        "Buenos Aires Province": "buenos aires province"
    },
    {
        " and much of the rest of the United Provinces, with many of the Provinces bonding themselves into a ": null
    },
    {
        "Federal League": "liga federal"
    },
    {
        ", inspired by Federalist ": null
    },
    {
        "José Gervasio Artigas": "josé gervasio artigas"
    },
    {
        " leadership. In practice, each side treated the others grievances as a foreign policy matter.     The  Unitarian  Constitution of 42 was immediately rejected by the provinces, and a state of anarchy ensued following the ": null
    },
    {
        "Battle of Cepeda": "battle of cepeda"
    },
    {
        ". The only cause that could regain unity among the hostile factions was the 42 invasion of what today is ": null
    },
    {
        "Uruguay": "uruguay"
    },
    {
        " on the part of ": null
    },
    {
        "Brazilian Empire": "brazilian empire"
    },
    {
        ". Uruguay, then known as the Province of the Eastern Bank of the Uruguay River, was considered a somewhat breakaway Province, since ": null
    },
    {
        "Montevideo": "montevideo"
    },
    {
        " served as the seat of the ": null
    },
    {
        "Royalist": "royalist"
    },
    {
        " Viceroy ": null
    },
    {
        "Francisco Javier de Elío": "francisco javier de elío"
    },
    {
        " during its war on the ": null
    },
    {
        "May Revolution": "may revolution"
    },
    {
        "; and that, after the independentists victory, the Province became the main stronghold of the ": null
    },
    {
        "Federal League": "liga federal"
    },
    {
        " leader ": null
    },
    {
        "José Gervasio Artigas": "josé gervasio artigas"
    },
    {
        ", who waged a long and bitter dispute during the 42s against the ": null
    },
    {
        "Unitarians": "unitarian party"
    },
    {
        " about the shape the national organization would have.     The war crisis led to a new Constitution and a first semblance of a united national government, at the same time it represented the first foreign policy crisis of the young nation , as it forced the nation into war with Brazil.     The common cause the crisis provided did lead to enough institutional stability to have the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " recognize Argentina  and led to the election of the first ": null
    },
    {
        "President of Argentina": "list of heads of state of argentina"
    },
    {
        ". The opportunity for unity, however, was wasted largely because the new President, ": null
    },
    {
        "Bernardino Rivadavia": "bernardino rivadavia"
    },
    {
        ", pushed a new Constitution even more biased towards Buenos Aires agenda than the failed 42 document. The war with Brazil, moreover, went badly. Land battles were won, early on, and despite some heroic feats on the part on Irish-born Admiral ": null
    },
    {
        "Guillermo Brown": "guillermo brown"
    },
    {
        ", the war dragged on, resulting in bankruptcy. This and the hated new constitution led to the end of the first republic by 42; it also led, however, to peace with Brazil and the formation of an independent ": null
    },
    {
        "Uruguay": "uruguay"
    },
    {
        ".     42 September 42 treaty itself became another foreign policy crisis, as it triggered a violent coup détat by generals opposed to what they saw as a unilateral surrender. The murder of the man responsible for the treaty, Buenos Aires Governor ": null
    },
    {
        "Manuel Dorrego": "manuel dorrego"
    },
    {
        ", itself led to a countercoup that brought with it the promise of a lasting peace; but eventually led to destabilizing consequences.     The countercoup brought in a new governor for the ": null
    },
    {
        "Buenos Aires Province": "buenos aires province"
    },
    {
        ", who would in time become the leading figure of a loose ": null
    },
    {
        "confederation": "confederation"
    },
    {
        " of Argentine Provinces . ": null
    },
    {
        "Juan Manuel de Rosas": "juan manuel de rosas"
    },
    {
        " made it his mission to stabilize Argentina in a confederacy under the tutelage of Buenos Aires Province. This led to repression, massacres of Native Americans in the ": null
    },
    {
        "Pampas": "pampas"
    },
    {
        " and, in 42 an international embargo over the case of a French journalist tortured to death at Rosas orders. An unyielding Rosas might have let the impasse continue for a decade or more; but, Admiral ": null
    },
    {
        "Guillermo Brown": "guillermo brown"
    },
    {
        " made his talents amenable once again, forcing the French blockade to be lifted in 42     Having come to power avenging the murder of a man who had decided to cease interference in Uruguay, Rosas invaded Uruguay upon the 42 election of a government there antagonistic to his personal commercial interests . Commercially close with the French and British Empires, Uruguays crisis met with swift reprisals against Rosas and the Argentine Confederacy from the two mighty powers. Slapped with fresh embargoes and a joint blockade, Argentina by 42 found itself bankrupt and with rogue nation standing; on 42 February 42 a surprise military campaign led by the Governor of ": null
    },
    {
        "Entre Ríos Province": "entre ríos province"
    },
    {
        ", ": null
    },
    {
        "Justo José de Urquiza": "justo josé de urquiza"
    },
    {
        ", put an end to the Rosas regime and, until 42 at least, serious Argentine foreign policy misadventures.          The deposition of Rosas led to Argentinas present institutional framework, outlined in the ": null
    },
    {
        "42 constitution": "argentine constitution"
    },
    {
        ". The document, drafted by a legal scholar specializing in the interpretation of the ": null
    },
    {
        "United States Constitution": "united states constitution"
    },
    {
        " put forth national social and economic development as its overriding principle. Where foreign policy was concerned, it specifically put emphasis on the need to encourage immigration and little else, save for the national defense against aggressions. This, of course, was forced into practice by Paraguayan dictator ": null
    },
    {
        "Francisco Solano López": "francisco solano lópez"
    },
    {
        "s disastrous 42 invasion of northern Argentine territory, leading to an ": null
    },
    {
        "alliance": "paraguayan war"
    },
    {
        " between 42s-era adversaries Argentina, Brazil and Uruguay and the loss of hundreds of thousands of lives .     Setbacks notwithstanding, the policy was successful. Domestically, Argentina was quickly transformed by immigration and foreign investment into, arguably, the most educationally and economically advanced nation in Latin America. Whatever else was happening domestically, internationally, Argentine policy earned a reputation for pragmatism and the reliance of conflict resolution as a vehicle to advance national interests. The eras new strongman, Gen. ": null
    },
    {
        "Julio Roca": "julio roca"
    },
    {
        ", was the first Argentine leader to treat foreign policy on equal footing with foreign investment and immigration incentives, universal education and repression as instruments of national development. His first administration occupied ": null
    },
    {
        "Patagonia": "patagonia"
    },
    {
        " and entered into an 42 agreement with Chile to that effect and his second one commissioned archaeologist ": null
    },
    {
        "Francisco Moreno": "francisco moreno"
    },
    {
        " to survey an appropriate boundary between the two neighbors, which brought Chile into the historic ": null
    },
    {
        "42 pact": "pactos de mayo"
    },
    {
        ", settling questions over Patagonian lands east of the ": null
    },
    {
        "Andes": "andes"
    },
    {
        ". Later that year, endorsed his Foreign Secretarys successful negotiation of a debt dispute between ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        ", France and Germany. Foreign Secretary ": null
    },
    {
        "Luis Drago": "luis drago"
    },
    {
        "s proposal in this, a dispute among third parties, became the ": null
    },
    {
        "Drago Doctrine": "drago doctrine"
    },
    {
        ", part of ": null
    },
    {
        "international law": "international law"
    },
    {
        " to this day.      This success led to a joint effort between Argentina, Brazil and ": null
    },
    {
        "Chile": "chile"
    },
    {
        " to negotiate a peaceful resolution to the United States ": null
    },
    {
        "occupation of Veracruz, Mexico": "veracruz incident"
    },
    {
        " in April 42 That May, the three nations foreign ministers hosted U.S. officials in Canada, a conference instrumental in the withdrawal of U.S. troops that November. This also resulted in the 42 ": null
    },
    {
        "ABC pact": "abc pact"
    },
    {
        " signed between the three and, like Brazil and Chile, Argentina thereafter pursued a pragmatic foreign policy, focused on preserving favorable trade relationships. This policy was in evidence during the 42 ": null
    },
    {
        "Roca-Runciman Treaty": "roca-runciman treaty"
    },
    {
        ", which secured Argentine markets among British colonies, and in the Argentine position during the ": null
    },
    {
        "Chaco War": "chaco war"
    },
    {
        ". Resulting from the 42 discovery of petroleum in the area, the dispute developed into war after ": null
    },
    {
        "Bolivia": "bolivia"
    },
    {
        "s appeal for Argentine intervention in what it saw as Paraguayan incursions into potentially oil-rich lands were rejected. Bolivia invaded in July 42 and, despite its legitimate claim to what historically had been its territory, its governments ties to ": null
    },
    {
        "Standard Oil of New Jersey": "standard oil of new jersey"
    },
    {
        "  Wirth, John. The Oil Business in Latin America. Beard Books, 42 led Buenos Aires to withhold diplomatic efforts until, in June 42 a cease-fire was signed. The laborious negotiations called in Buenos Aires by Argentine Foreign Minister ": null
    },
    {
        "Carlos Saavedra Lamas": "carlos saavedra lamas"
    },
    {
        " yielded him Latin Americas first ": null
    },
    {
        "Nobel Prize for Peace": "nobel prize for peace"
    },
    {
        " in 42 and a formal peace treaty in July 42          As they had during World War I, Argentine governments of different ideological stripes remained consistent in one important foreign policy point: they maintained Argentina neutral, preferring to offer the nations vast ": null
    },
    {
        "agricultural export": "agriculture in argentina"
    },
    {
        " capacity to British and U.S. wartime needs; indeed, Argentine trade surpluses totalled US$42  billion during World War I and US$42  billion during World War II.      In early 42 the United States and 42 Latin American countries met in Mexico at the ": null
    },
    {
        "Inter-American Conference on Problems of War and Peace": "inter-american conference on problems of war and peace"
    },
    {
        ". Argentina was not invited. The conference demanded that Argentina declare war on Germany or else it would be isolated. Argentina did so on 42 March 42 and kept its status in the Pan-American Union and at the insistence of Latin American delegations was admitted to the new United Nations.               The incipient ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " in evidence following World War II led the new administration of ": null
    },
    {
        "Juan Perón": "juan perón"
    },
    {
        " to conclude that a third world war might follow. Perón restored diplomatic relations with the Soviet Union and, in 42 articulated a third way as his foreign policy doctrine, in hopes of avoiding friction with either superpower, while opening the door to grain sales to the perennially shortage-stricken Soviets. Though commercial concerns continued to dominate foreign policy, conflict resolution was again ventured into when President ": null
    },
    {
        "Arturo Frondizi": "arturo frondizi"
    },
    {
        " initiated negotiations between U.S. President ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        " and Cuban representative ": null
    },
    {
        "Ernesto Che Guevara": "che guevara"
    },
    {
        " during a Western Hemisphere summit in ": null
    },
    {
        "Uruguay": "uruguay"
    },
    {
        " in August 42 Frondizi followed these exchanges with private discussions with Che Guevara in Buenos Aires, a misstep resulting in the Argentine militarys opposition to further talks. Ultimately, Cuba was expelled from the ": null
    },
    {
        "Organization of American States": "organization of american states"
    },
    {
        " in January 42 and Frondizi was forced by the military to resign that March. The effort, though fruitless, showed audacity on the part of Frondizi, whom President Kennedy called a really tough man. Clarín. 42 April 42            Argentinas relations with its neighbor ": null
    },
    {
        "Chile": "chile"
    },
    {
        ", though generally cordial, have been strained by territorial disputes – mostly along their mountainous shared border – since the nineteenth century.     In 42 the ": null
    },
    {
        "Argentine Navy": "argentine navy"
    },
    {
        " shelled a Chilean lighthouse during the ": null
    },
    {
        "Snipe incident": "snipe incident"
    },
    {
        ".     On 42 November 42 the Argentine Gendarmerie killed Chilean Lieutenant Hernán Merino Correa, member of ": null
    },
    {
        "Carabineros de Chile": "carabineros de chile"
    },
    {
        " in the ": null
    },
    {
        "Laguna del Desierto incident": "laguna del desierto incident"
    },
    {
        ".     In 42 the bellicose See Argentine Historian Luis Alberto Romero  about the Argentine Government: By that time, a bellicose current of opinion had arisen among the military and its friend, an attitude rooted in a strain of Argentine nationalism, which drew substance from strong chauvinistic sentiments. Diverse ancient fantasies in societys historical imaginary-the patria grande , the spoliation that the country had suffered- where added to a new fantasy of entering the first world through a strong foreign policy. All this combined with the traditional messianic military mentality and the ingeniousness of its strategies which were ignorant of the most elemental facts of international politics. The aggression against Chile, stymied by papal mediation, was transferred to Great Britain ... Argentine dictatorship abrogated the binding ": null
    },
    {
        "Beagle Channel Arbitration": "beagle channel arbitration"
    },
    {
        " and started the ": null
    },
    {
        "Operation Soberania": "operation soberania"
    },
    {
        " in order to invade Chile but aborted it a few hours later due to military and political reasons. See Alejandro Luis Corbacho Predicting the Probability of War during Brinkmanship Crisis: The Beagle and the Malvinas conflicts  : The newspaper Clarín explained some years later that such caution was based, in part, on military concerns. In order to achieve a victory, certain objectives had to be reached before the seventh day after the attack. Some military leaders considered this not enough time due to the difficulty involved in transportation through the passes over the Andean Mountains. and in cite 42: According to Clarín, two consequences were feared. First, those who were dubious feared a possible regionalization of the conflict. Second, as a consequence, the conflict could acquire great power proportions. In the first case decision makers speculated that Peru, Bolivia, Ecuador and Brazil might intervene. Then the great powers could take sides. In this case, the resolution of the conflict would depend not on the combatants, but on the countries that supplied the weapons. The conflict was resolved after the Argentine defeat in the Falklands by ": null
    },
    {
        "Papal mediation in the Beagle conflict": "papal mediation in the beagle conflict"
    },
    {
        " of ": null
    },
    {
        "Pope John Paul II": "pope john paul ii"
    },
    {
        " and in the form of a ": null
    },
    {
        "Treaty of Peace and Friendship of 42 between Chile and Argentina": "treaty of peace and friendship of 1984 between chile and argentina"
    },
    {
        " , granting the islands to Chile and most of the ": null
    },
    {
        "Exclusive economic zone": "exclusive economic zone"
    },
    {
        " to Argentina; since then, other border disputes with Chile have been resolved via diplomatic negotiations.     After nearly twenty years of intermittent negotiations with the United Kingdom, the ": null
    },
    {
        "military dictatorship": "national reorganization process"
    },
    {
        " in Argentina ": null
    },
    {
        "invaded": "1982 invasion of the falkland islands"
    },
    {
        " and ": null
    },
    {
        "occupied": "occupation of the falkland islands"
    },
    {
        " the British-controlled ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        " and ": null
    },
    {
        "adjoining archipelagos": "south georgia and the south sandwich islands"
    },
    {
        " on 42 April 42 starting the ": null
    },
    {
        "Falklands War": "falklands war"
    },
    {
        " . The war itself lasted just 42 days but cost the lives of nearly a thousand Argentine and British troops as well as three ": null
    },
    {
        "Falkland Islanders": "falkland islanders"
    },
    {
        " and resulted in the islands coming back under British administration on 42 June 42 dealing the dictatorship a humiliating blow and, inadvertently, opening Argentinas door to democracy.     Since the return of civilian rule to Argentina in 42 relations with Chile, the United Kingdom and the international community in general improved and Argentine officials have since publicly ruled out interpreting neighboring countries policies as any potential threat; but Argentina still does not enjoy the full trust of the Chilean political class. See notes of the Chilean Foreign Minister ": null
    },
    {
        "Jose Miguel Insulza": "jose miguel insulza"
    },
    {
        ", in  La Tercera  de Santiago de Chile, 42 July 42:  See notes of Senator ": null
    },
    {
        "Jorge Martínez Bush": "jorge martínez bush"
    },
    {
        " in  La Tercera  de Santiago de Chile, 42 July 42:   See notes of the Chilean Foreign Minister ": null
    },
    {
        "Ignacio Walker": "ignacio walker"
    },
    {
        ",  Clarín  de B.A., 42 July 42:  See also Reciprocidad en las Relaciones Chile – Argentina of Andrés Fabio Oelckers Sainz in :  También en Chile, todavía genera un gran rechazo el hecho que Argentina declarase nulo el fallo arbitral británico y además en una primera instancia postergara la firma del laudo papal por el diferendo del Beagle  See notes of Director académico de la Facultad Latinoamericana de Ciencias Sociales ": null
    },
    {
        "Flacso": "flacso"
    },
    {
        ", Francisco Rojas, in Santiago de Chile, in  La Nación  de Buenos Aires, 42 September 42:   See notes of Chilean Defense Minister ": null
    },
    {
        "Edmundo Pérez Yoma": "edmundo pérez yoma"
    },
    {
        " in Centro Superior de Estudios de la Defensa Nacional del Reino de España , appeared in Argentine newspaper  El Cronista Comercial , 42 May 42:  . These notes were later relativized by the Chilean Government      Michel Morris stated that Argentina has used threats and force to pursue its claims against Chile and Great Britain and that some of the hostile acts or armed incidents appear to have been caused by zealous local commanders.        Early on in the administration of President ": null
    },
    {
        "Carlos Menem": "carlos menem"
    },
    {
        " , Argentina restored diplomatic relations with the United Kingdom and developed a strong partnership with the United States. It was at this time that Argentina left the ": null
    },
    {
        "Non-Aligned Movement": "non-aligned movement"
    },
    {
        " and adopted a policy of automatic alignment with the United States. In 42 Menems Foreign Minister, ": null
    },
    {
        "Guido di Tella": "guido di tella"
    },
    {
        ", memorably pronounced the U.S.–Argentine alliance to be a carnal relationship.         Argentina was the only Latin American country to participate in the 42 ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        " and all phases of the ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        " operation. It has contributed to United Nations ": null
    },
    {
        "peacekeeping": "peacekeeping"
    },
    {
        " operations worldwide, with Argentine soldiers/engineers and police/Gendarmerie serving in ": null
    },
    {
        "El Salvador": "el salvador"
    },
    {
        "–": null
    },
    {
        "Honduras": "honduras"
    },
    {
        "–": null
    },
    {
        "Nicaragua": "nicaragua"
    },
    {
        " , ": null
    },
    {
        "Guatemala": "guatemala"
    },
    {
        ", Ecuador–": null
    },
    {
        "Peru": "peru"
    },
    {
        ", ": null
    },
    {
        "Western Sahara": "western sahara"
    },
    {
        ", Angola, ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        ", Cyprus, ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        ", Kosovo, ": null
    },
    {
        "Bosnia": "bosnia and herzegovina"
    },
    {
        " and ": null
    },
    {
        "East Timor": "east timor"
    },
    {
        ".     In recognition of its contributions to international security and peacekeeping, U.S. President ": null
    },
    {
        "Bill Clinton": "bill clinton"
    },
    {
        " designated Argentina as a ": null
    },
    {
        "major non-NATO ally": "major non-nato ally"
    },
    {
        " in January 42  The country is currently the only nation in Latin America that holds this distinction.     At the United Nations, Argentina supported United States policies and proposals, among them the condemnations of Cuba on the issue of human rights, and the fight against international terrorism and narcotics trafficking. In November 42 Argentina hosted the United Nations conference on climate change, and in October 42 in Berlin, became one of the first nations worldwide to adopt a voluntary ": null
    },
    {
        "greenhouse gas": "greenhouse gas"
    },
    {
        " emissions target.     Argentina also became a leading advocate of ": null
    },
    {
        "non-proliferation": "nuclear proliferation"
    },
    {
        " efforts worldwide. After trying to develop nuclear weapons during the ": null
    },
    {
        "42 military dictatorship": "national reorganization process"
    },
    {
        ", Argentina scrapped the project with the return of democratic rule in 42 and became a strong advocate of non-proliferation efforts and the peaceful use of nuclear technologies.     Since the return of democracy, Argentina has also turned into strong proponent of enhanced regional stability in South America, the country revitalized its relationship with Brazil; and during the 42s settled lingering border disputes with ": null
    },
    {
        "Chile": "chile"
    },
    {
        "; discouraged military takeovers in Ecuador and ": null
    },
    {
        "Paraguay": "paraguay"
    },
    {
        "; served with the United States, Brazil and Chile as one of the four guarantors of the Ecuador–Peru peace process. Argentinas reputation as a mediator was damaged, however, when President Menem and some members of his cabinet were accused of approving the illegal sale of weapons to Ecuador and to ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        ".     In 42 President Menem made a state visit to the United Kingdom, and the Prince of Wales reciprocated with a visit to Argentina. In 42 the two countries agreed to normalize travel to the ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        "  from the mainland and resumed direct flights.     In the 42s, Argentina was an enthusiastic supporter of the ": null
    },
    {
        "Summit of the Americas": "summit of the americas"
    },
    {
        " process, and chaired the ": null
    },
    {
        "Free Trade Agreement of the Americas": "free trade agreement of the americas"
    },
    {
        " initiative.          Within the term of President ": null
    },
    {
        "Néstor Kirchner": "néstor kirchner"
    },
    {
        ", from 42 onwards, Argentina suspended its policy of automatic alignment with the United States and moved closer to other Latin American countries. Argentina no longer supports the UN Commission on Human Rights resolution criticizing the human rights situation in Cuba and calling upon the Government of Cuba to adhere to international human rights norms , but has chosen instead to abstain. In the ": null
    },
    {
        "42 United Nations Security Council election": "2006 united nations security council election"
    },
    {
        ", Argentina supported, like all Mercosur countries, the candidacy of Venezuela over Guatemala for a non-permanent seat in the Security Council.     The ": null
    },
    {
        "Mercosur": "mercosur"
    },
    {
        " has become a central part of the Argentine foreign policy, with the goal of forming a Latin American ": null
    },
    {
        "trade bloc": "trade bloc"
    },
    {
        ". Argentina has chosen to form a bloc with Brazil when it comes to external negotiations, though the economic asymmetries between South Americas two largest countries have produced tension at times.     Between 42 and 42 November 42 the city of ": null
    },
    {
        "Mar del Plata": "mar del plata"
    },
    {
        " hosted the ": null
    },
    {
        "Fourth Summit of the Americas": "mar del plata summit of the americas"
    },
    {
        ". Although the themes were unemployment and poverty, most of the discussion was focused on the FTAA. The summit was a failure in this regard, but marked a clear split between the countries of the Mercosur, plus ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        ", and the supporters of the FTAA, led by the United States, Mexico and Canada. FTAA negotiations have effectively stalled until at least the conclusion of the 42 ": null
    },
    {
        "Doha round": "doha round"
    },
    {
        " global trade talks.     In 42 Argentina assumed again  the two-year non-permanent position on the ": null
    },
    {
        "UN Security Council": "un security council"
    },
    {
        ".     As of 42 during Kirchners almost four years in power, Argentina entered into 42 bilateral agreements, including 42 with ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        ", 42 with ": null
    },
    {
        "Chile": "chile"
    },
    {
        ", 42 with ": null
    },
    {
        "Bolivia": "bolivia"
    },
    {
        ", 42 with Brazil, 42 with China, 42 with Germany, 42 with the United States and Italy, and 42 with ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        ", Paraguay, Spain and Russia.           Mauricio Macri started his term with a series of foreign policy objectives: re-invigorate bilateral relations with the US and Europe, revise the foundations of Mercosur, evaluating alternatives that imply more free trade and go back to a single exchange rate, allow for a revival of commodity exports and attract foreign direct investment. However, the realization of these objectives will depend on the evolution of domestic and regional developments.               Argentina claims part of Antarctica as ": null
    },
    {
        "Argentine Antarctica": "argentine antarctica"
    },
    {
        ", an area delimited by the ": null
    },
    {
        "42° West": "25th meridian west"
    },
    {
        " and ": null
    },
    {
        "42° West": "74th meridian west"
    },
    {
        " meridians and the ": null
    },
    {
        "42° South": "60th parallel south"
    },
    {
        " parallel. This claim overlaps the ": null
    },
    {
        "British": "british antarctic territory"
    },
    {
        " and ": null
    },
    {
        "Chilean claims": "antártica chilena province"
    },
    {
        ", though all territorial claims in Antarctica are currently suspended under the ": null
    },
    {
        "Antarctic Treaty System": "antarctic treaty system"
    },
    {
        ". Argentina also claims the ": null
    },
    {
        "British overseas territories": "british overseas territories"
    },
    {
        " of the ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        "  and ": null
    },
    {
        "South Georgia and the South Sandwich Islands": "south georgia and the south sandwich islands"
    },
    {
        ". In addition a  long border with ": null
    },
    {
        "Chile": "chile"
    },
    {
        " in the ": null
    },
    {
        "Southern Patagonian Ice Field": "southern patagonian ice field"
    },
    {
        " is awaiting demarcation as required under a 42 treaty.     On 42 April 42 the Argentine government submitted a claim to the United Nations for  of ocean territory to be recognised as Argentinas ": null
    },
    {
        "continental shelf": "continental shelf"
    },
    {
        " as governed by the ": null
    },
    {
        "Convention on the Continental Shelf": "convention on the continental shelf"
    },
    {
        " and ": null
    },
    {
        "Convention on the Law of the Sea": "convention on the law of the sea"
    },
    {
        ".  Argentina claims to have spent 42 years investigating the matter and submitted  of documents in support of the claim. If the claim is recognised by the UN then Argentina will gain the rights to the commercial exploitation of the sea bed . The new claim will add to the existing  of commercial shelf already managed by Argentina and includes the disputed ": null
    },
    {
        "British overseas territories": "british overseas territories"
    },
    {
        " of the ": null
    },
    {
        "Falklands": "falkland islands"
    },
    {
        ", ": null
    },
    {
        "South Georgia and the South Sandwich Islands": "south georgia and the south sandwich islands"
    },
    {
        " and parts of Antarctica disputed with ": null
    },
    {
        "Chile": "chile"
    },
    {
        " and the United Kingdom. As of 42 the UN commission on the limits of the continental shelf  decided to expand Argentina maritime territory in the ": null
    },
    {
        "South Atlantic Ocean": "south atlantic ocean"
    },
    {
        " by 42% thus increasing by  its territorial waters, fixing the limit of its territory at 42 to 42 miles from its coast.   However, the UN commissions ruling included a caveat referencing the unresolved diplomatic dispute between Argentina and the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " over the Falkland Islands.        Argentina, through its ": null
    },
    {
        "Coast Guard": "prefectura naval argentina"
    },
    {
        " and ": null
    },
    {
        "Navy": "argentine navy"
    },
    {
        ", has been traditionally greatly involved in fishery protection in the ": null
    },
    {
        "Argentine Sea": "argentine sea"
    },
    {
        " with the first major incidents tracing back to the 42s when a destroyer fired and holed a Russian trawler and continued through recent years.         In November 42 an Argentine judge issued an arrest warrant for former Iranian President ": null
    },
    {
        "Akbar Hashemi Rafsanjani": "akbar hashemi rafsanjani"
    },
    {
        " and eight other ex-officials in relation to the ": null
    },
    {
        "42 bombing": "amia bombing"
    },
    {
        " of the Jewish-Argentine Mutual Association community center in Buenos Aires which killed 42 people.  Iran refused to carry out the arrest demanded by the warrant claiming it to be a Zionist plot . As a result, President Néstor Kirchner ordered the ": null
    },
    {
        "security forces": "list of law enforcement agenciesargentina"
    },
    {
        " to be on the alert for incidents similar to the 42 bombing.      Argentina has a dispute with neighboring Uruguay about two pulp mills on the Uruguay side of the shared ": null
    },
    {
        "Uruguay River": "uruguay river"
    },
    {
        " near the Argentine city of ": null
    },
    {
        "Gualeguaychú": "gualeguaychú, entre ríos"
    },
    {
        ".  Residents of Gualeguaychú, concerned about pollution from the mills, blockaded bridges across the river in 42 The case was brought before the ": null
    },
    {
        "International Court of Justice": "international court of justice"
    },
    {
        ". No final judgement has been passed yet by the ICJ but the denial of preliminary measures in July 42 allowed the mills to begin functioning.                                      ": null
    }
]