[
    {
        "                 Fortaleza  is the state capital of ": null
    },
    {
        "Ceará": "ceará"
    },
    {
        ", located in ": null
    },
    {
        "Northeastern Brazil": "northeast region, brazil"
    },
    {
        ". It belongs to the Metropolitan mesoregion of Fortaleza and microregion of Fortaleza. Located 2285  km from ": null
    },
    {
        "Brasilia": "brasília"
    },
    {
        ", the federal capital, the city has developed on the banks of the creek Pajeú, and its name is an allusion to ": null
    },
    {
        "Fort Schoonenborch": "fort schoonenborch"
    },
    {
        ", which gave rise to the city, built by the Dutch during their second stay in the area between 1649 and 1654. The ": null
    },
    {
        "motto": "motto"
    },
    {
        " of Fortaleza, present in its ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " is the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word Fortitudine, which means with strength/courage .     In 2013, Fortaleza was the twelfth richest city in the country in GDP and second in the Northeast, with 49 billion reais . It also has the third richest metropolitan area in the North and Northeast regions. It is an important industrial and commercial center of Brazil, the nations eighth largest municipality in purchasing power. According to the ": null
    },
    {
        "Ministry of Tourism": "ministry of tourism"
    },
    {
        ", the city reached the mark of second most desired destination of Brazil and fourth among Brazilian cities in tourists received. The ": null
    },
    {
        "BR-116": "br-116"
    },
    {
        ", the most important highway of the country, starts in Fortaleza. The municipality is part of the Common Market of ": null
    },
    {
        "Mercosur": "mercosur"
    },
    {
        " Cities, and also the Brazilian state capital which is closest to ": null
    },
    {
        "Europe": "europe"
    },
    {
        ", 5608  km from ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ", ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        ".     Fortaleza is symptomatic of the wealth divide in Brazil. It ranks 83rd in a measure of ": null
    },
    {
        "wealth disparity": "economic inequality"
    },
    {
        ". This, and a prevalence of drug trafficking , has contributed to a serious crime problem. Many neighborhoods are in fact ": null
    },
    {
        "favelas": "favela"
    },
    {
        "and not safe, particularly at night. Fortaleza ranks ": null
    },
    {
        "ninth worldwide in intentional murder rate": "list of cities by murder rate"
    },
    {
        ", exceeding the national rate of over 59 per 100,000. While the major tourist attractions are well policed or segregated with security barriers for the well to do, it is evident that the majority of the population lives in defensively equipped homes and that the old time custom of evening sidewalk socializing is disappearing.     To the north of the city lies the Atlantic Ocean; to the south are the ": null
    },
    {
        "municipalities": "municipalities of brazil"
    },
    {
        " of ": null
    },
    {
        "Pacatuba": "pacatuba, ceará"
    },
    {
        ", ": null
    },
    {
        "Eusébio": "eusébio, ceará"
    },
    {
        ", ": null
    },
    {
        "Maracanaú": "maracanaú"
    },
    {
        " and ": null
    },
    {
        "Itaitinga": "itaitinga"
    },
    {
        "; to the east is the municipality of ": null
    },
    {
        "Aquiraz": "aquiraz"
    },
    {
        " and the Atlantic Ocean; and to the west is the municipality of ": null
    },
    {
        "Caucaia": "caucaia"
    },
    {
        ". Residents of the city are known as Fortalezenses. Fortaleza is one of the three leading cities in the Northeast region together with ": null
    },
    {
        "Recife": "recife"
    },
    {
        " and ": null
    },
    {
        "Salvador": "salvador, bahia"
    },
    {
        ".      The city was one of the host cities of the ": null
    },
    {
        "2014 FIFA World Cup": "2014 fifa world cup"
    },
    {
        ". A ": null
    },
    {
        "stadium": "castelão"
    },
    {
        " was re-constructed at considerable cost and amid much controversy.  The stadium is now underutilized and its infrastructure crumbling.               Fortalezas history began on February 2, 1500, when ": null
    },
    {
        "Spaniard": "spaniard"
    },
    {
        " Vicente Pinzón": "vicente yáñez pinzón"
    },
    {
        " landed in Mucuripes cove and named the new land Santa Maria de la Consolación. Because of the ": null
    },
    {
        "Treaty of Tordesillas": "treaty of tordesillas"
    },
    {
        ", the discovery was never officially sanctioned. Colonisation began in 1603, when the ": null
    },
    {
        "Portuguese": "portuguese people"
    },
    {
        " Pero Coelho de Souza constructed the Fort of São Tiago and founded the settlement of Nova Lisboa .   After a victory over the French in 1612, Martins Soares Moreno expanded the Fort of São Tiago and changed its name to Forte de São Sebastião.   at Fortaleza, Ceará site     In 1630 the Dutch invaded the ": null
    },
    {
        "Brazilian Northeast": "brazilian northeast"
    },
    {
        " and in 1637 they took the Fort of São Sebastião and ruled over Ceará. In battles with the Portuguese and natives in 1644 the fort was destroyed. Under captain Matthias Beck the ": null
    },
    {
        "Dutch West Indies Company": "dutch west indies company"
    },
    {
        " built a new fortress by the banks of river Pajeú. Fort Schoonenborch officially opened on August 19, 1649. After the capitulation of ": null
    },
    {
        "Pernambuco": "pernambuco"
    },
    {
        " in 1654, the Dutch handed over this fortress to the Portuguese, who renamed it Fortaleza da Nossa Senhora de Assunção , after which the city of Fortaleza takes its name.   at Fortaleza, Ceará site     Fortaleza was officially founded as a village 1726, becoming the capital of ": null
    },
    {
        "Ceará": "ceará"
    },
    {
        " state in 1799.           During the 19th century, Fortaleza was consolidated as an urban centre in Ceará, supported by the cotton industry. With the transformation of the city into a regional export center and with the increase of direct navigation to Europe, the customs building of Fortaleza was built in 1812. In 1824, the city was targeted by the revolutionaries of ": null
    },
    {
        "Confederation of the Equator": "confederation of the equator"
    },
    {
        ".               In the twentieth century, Fortaleza underwent significant urban changes, with improvements and the rural exodus to the city, with growth mostly towards the end of the decade of 1910, this made the city the seventh most populated city in Brazil. In 1922, Fortaleza reached its first hundred thousand inhabitants with the annexation of the cities of Messejana and Parangaba, now important districts of the city.    In 1954, the first university in the city was created, the ": null
    },
    {
        "Universidade Federal do Ceará": "universidade federal do ceará"
    },
    {
        " .      In 1983 DIF I started to integrate the territory of the new city of ": null
    },
    {
        "Maracanaú": "maracanaú"
    },
    {
        ", which, just some years ago, was made again part of the Greater Fortaleza . In the 1980s, Fortaleza exceeded ": null
    },
    {
        "Recife": "recife"
    },
    {
        " in population terms, becoming the second most populous city in ": null
    },
    {
        "Northeastern Brazil": "northeastern brazil"
    },
    {
        ", with 2,571,896 inhabitants.      During the ": null
    },
    {
        "political awakening": "history of brazil since 1985"
    },
    {
        " that followed the military regime, the people elected the citys first woman mayor, Maria Luíza Fontenele of the ": null
    },
    {
        "Brazilian Workers Party": "workers party"
    },
    {
        ", which meant that the city administration was controlled by a party of the centre-left. At the end of the twentieth century, the administration of the city hall and the city underwent a range of structural changes with the opening of several avenues, hospitals, cultural spaces and it became one of the main tourist destinations in the Northeast and in Brazil.            Fortaleza has a typical ": null
    },
    {
        "tropical climate": "tropical climate"
    },
    {
        ", specifically a ": null
    },
    {
        "tropical wet and dry climate": "tropical savanna climate"
    },
    {
        " , with high temperatures and relative humidity throughout the year. However, these conditions are usually relieved by pleasant winds blowing from the ocean. Average temperatures are not much different throughout the year. December is the warmest month, with a high of  and low of . The rainy season spans from January to June, with rainfall particularly prodigious in March and April. The average annual temperature is . The relative humidity in Fortaleza is 79%, with average annual rainfall of . There is usually rain during the first seven months of the year from January to July. During this period, ": null
    },
    {
        "relative humidity": "relative humidity"
    },
    {
        " is high. Fortalezas climate is usually very dry from August to December, with very little rainfall.     Rainfall is like all of Northeastern Brazil among the most variable in the world, comparable to central ": null
    },
    {
        "Queensland": "queensland"
    },
    {
        " cities like ": null
    },
    {
        "Townsville": "townsville, queensland"
    },
    {
        " and ": null
    },
    {
        "Mackay": "mackay, queensland"
    },
    {
        ". Dewar, Robert E. and Wallis, James R; ‘Geographical patterning of interannual rainfall variability in the tropics and near tropics: An L-moments approach’; in  Journal of Climate , 12; pp. 3457-3466 In the notorious drought year of 1877 as little as  fell, and in 1958 only , but in the Nordestes record wet year of 1985 Fortaleza received .          In Fortaleza there are some remaining areas of ": null
    },
    {
        "mangrove": "mangrove"
    },
    {
        " in preserved areas.         Ten miles offshore is the ": null
    },
    {
        "Pedra da Risca do Meio Marine State Park": "pedra da risca do meio marine state park"
    },
    {
        ", created in 1997 to protect the reefs.             Wetlands, canals and parks are heavily polluted . It may not be safe to consume the typical beach hut serving of mangrove crabs     The vegetation of Fortaleza is typically coastal. The ": null
    },
    {
        "restinga": "restinga"
    },
    {
        " areas are found in ": null
    },
    {
        "dune": "dune"
    },
    {
        " regions near the mouths of the Ceará, Cocó and Pacoti rivers, in the beds of which there is still a mangrove forest. In other green areas of the city, there is no longer native vegetation, consisting of varied vegetation, fruit trees more commonly.  The city is home to seven environmental conservation units. These are the Sabiaguaba Dunes Municipal Natural Park, the Sabiaguaba Environmental Protection Area, the Maraponga Lagoon Ecological Park, the Cocó Ecological Park, the Ceará River Estuary Environmental Protection Area, the Environmental Protection Area of the Rio Pacoti and the ": null
    },
    {
        "Pedra da Risca do Meio Marine State Park": "pedra da risca do meio marine state park"
    },
    {
        ".  There is also, in the city, the Area of Relevant Ecological Interest of Sírio Curió, that protects the last enclave of ": null
    },
    {
        "Atlantic Forest": "atlantic forest"
    },
    {
        " in the urban zone.      The Cocó River is part of the river basin of the east coast of Ceará and has a total length of about 50  km in its main area. The park is inserted in the area of greater environmental sensitivity of the city, where it is possible to identify geoenvironmental formations such as coastal plain, fluvial plain and surface of the coastal trays. The Cocó river mangrove is home to ": null
    },
    {
        "mollusks": "mollusks"
    },
    {
        ", ": null
    },
    {
        "crustaceans": "crustaceans"
    },
    {
        ", ": null
    },
    {
        "fish": "fish"
    },
    {
        ", ": null
    },
    {
        "reptiles": "reptiles"
    },
    {
        ", ": null
    },
    {
        "birds": "birds"
    },
    {
        " and ": null
    },
    {
        "mammals": "mammals"
    },
    {
        ". The park has a structure of visitation, with guides, ecological trails and equipment and events of ": null
    },
    {
        "environmental education": "environmental education"
    },
    {
        " and ": null
    },
    {
        "ecotourism": "ecotourism"
    },
    {
        ". The Coaçu River, affluent of the river Cocó, forms in its bed the lagoon of the Precabura.       The ": null
    },
    {
        "Rio Pacoti": "pacoti river"
    },
    {
        " provides much of the water supply for Fortaleza.  At the municipal boundary with ": null
    },
    {
        "Caucaia": "caucaia"
    },
    {
        ", the estuary of the Rio Ceará is covered by an environmental protection area , which was set up in 1999.           According to the ": null
    },
    {
        "2010 IBGE Census": "brazilian institute of geography and statistics"
    },
    {
        ", there were 2,315,116 people residing in the city of Fortaleza.    The census revealed the following numbers: 1,403,292 ": null
    },
    {
        "Pardo": "pardo"
    },
    {
        "  people , 901,816 ": null
    },
    {
        "White": "white brazilian"
    },
    {
        " people , 110,811 ": null
    },
    {
        "Black": "afro-brazilian"
    },
    {
        " people , 33,161 ": null
    },
    {
        "Asian": "asian brazilian"
    },
    {
        " people , 3,071 ": null
    },
    {
        "Amerindian": "indigenous peoples in brazil"
    },
    {
        " people .        In 2005 the Central Bank of Brazil in Fortaleza suffered a spectacular robbery which still stands as one of the worlds largest     In 2010, the city of Fortaleza was the 5th most populous city proper in ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", after ": null
    },
    {
        "São Paulo": "são paulo"
    },
    {
        ", ": null
    },
    {
        "Rio de Janeiro": "rio de janeiro"
    },
    {
        ", ": null
    },
    {
        "Salvador": "salvador, bahia"
    },
    {
        ", and ": null
    },
    {
        "Brasília": "brasília"
    },
    {
        ".        In 2010, the city had 433,942 ": null
    },
    {
        "opposite-sex couples": "intimate relationship"
    },
    {
        " and 1,559 ": null
    },
    {
        "same-sex couple": "same-sex couple"
    },
    {
        "s. The population of Fortaleza was 53.2% female and 46.8% male.     The following cities are included in the ": null
    },
    {
        "metropolitan area": "metropolitan area"
    },
    {
        " of Fortaleza : Fortaleza, Caucaia, Maracanaú, Maranguape, Aquiraz, Pacatuba, Pacajus, Horizonte, São Gonçalo do Amarante, Itatinga, Guaiúba and Chorozinho.      According to a genetic study from 2011, pardos and whites from Fortaleza, which comprise the largest share of the population, showed European ancestry of about 70%, the rest divided between Native American and African ancestries.  A 2015 study, however, found out the following composition in Fortaleza: 48,9% of European contribution, 35,4% of Native American input and 15,7% of African ancestry.                  The prevailing religion of Fortaleza is the Roman Catholic branch of Christianity.        Source: IBGE 2000.      According to the census of 2010, 1,664,521 people, 67.88% of the population, followed ": null
    },
    {
        "Roman Catholicism": "roman catholicism"
    },
    {
        ", 523,456 were ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        ", 31 691 represented ": null
    },
    {
        "Spiritism": "spiritism"
    },
    {
        " and 162 985 had no religion whatsoever. Other religions, such as ": null
    },
    {
        "Umbanda": "umbanda"
    },
    {
        ", ": null
    },
    {
        "Candomblé": "candomblé"
    },
    {
        ", other ": null
    },
    {
        "Afro-Brazilian religions": "afro-brazilian religions"
    },
    {
        ", ": null
    },
    {
        "Spiritualism": "spiritualism"
    },
    {
        ", ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        ", ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        ", ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        ", ": null
    },
    {
        "Islam": "islam"
    },
    {
        ", other Eastern religions, ": null
    },
    {
        "Esotericism": "esotericism"
    },
    {
        " and other Christian churches like ": null
    },
    {
        "Mormon": "mormon"
    },
    {
        " had a smaller number of adherents.               The administration of the municipality is made from the executive and legislative branches.  ": null
    },
    {
        "Roberto Cláudio": "roberto cláudio rodrigues bezerra"
    },
    {
        ", of the ": null
    },
    {
        "PDT": "democratic labour party"
    },
    {
        ", won 650,607 votes in the 2012 election, and was elected mayor.   Legislative power rests with the City Council of Fortaleza, composed of 43 city councilors, elected for four-year terms, responsible for drafting municipal laws and supervising the executive.  The municipality is, in addition, governed by organic law. In January 2015, there were 1 659 091 voters in Fortaleza ,  distributed in thirteen electoral zones. The number of persons directly and indirectly employed in the municipal public administration in 2013 was respectively 31 318 and 4 950.      The city also houses the seat of state executive power, the Abolition Palace, occupied by governor ": null
    },
    {
        "Camilo Santana": "camilo santana"
    },
    {
        ", of the ": null
    },
    {
        "PT": "workers party"
    },
    {
        ", elected in the ": null
    },
    {
        "general elections in Brazil in 2014": "brazilian general election, 2014"
    },
    {
        ".  historically headquarters of the Iracema Club, which was Ceded to the Municipal Hall and now houses municipal executive bodies.  In the city, there is the Administrative Center Governor Virgílio Távora.      Among the institutions present in the city, are the Fortaleza Air Base, the Port Authority of Ceará, School of Apprentice Sailors of Ceará and the Command of the Tenth Military Region. The city also has units of the International Committee of the ": null
    },
    {
        "Red Cross": "red cross"
    },
    {
        " and ": null
    },
    {
        "UNICEF": "unicef"
    },
    {
        ".  Since 1996, a city is part of the Common Market of Cities of ": null
    },
    {
        "Mercosur": "mercosur"
    },
    {
        ".                  At the beginning of the decade of 2000, among the capitals of the Northeast, Fortaleza had the third largest Gross Domestic Product , being surpassed by ": null
    },
    {
        "Recife": "recife"
    },
    {
        " and ": null
    },
    {
        "Salvador": "salvador, bahia"
    },
    {
        ".  In 2012, the GDP of Fortaleza reached the value of 43.4 billion Reais, the tenth highest of the country.  In the same year, the value of taxes on products net of subsidies at current prices was R $6,612,822,000 and the municipalitys GDP per capita was R$17.359,53.    The citys booming economy is reflected in purchasing power, the countrys eighth largest, with estimated consumption potential at 42 billion reais in 2014.      The main economic source of the municipality is centered in the ": null
    },
    {
        "tertiary sector": "tertiary sector of the economy"
    },
    {
        ", with its diversified segments of commerce and service rendering. Next, the secondary sector stands out, with the industrial complexes. In 2012, the city had 873,746 people in employment.             According to the Master Plan of Fortaleza, the Special Areas for the Preservation of Historic, Cultural and Archaeological Heritage are the regions of the Center, Parangaba, Alagadiço Novo/José de Alencar, Benfica, Porangabuçu and Praia de Iracema. Properties of conservation interest.  The architectural heritage of Fortaleza in the form of fallen goods, however, is predominantly concentrated in the center of the city.   The Mucuripe Lighthouse is unfortunately in ruins today, Ceará and Fortaleza were part of the pioneering group of states and cities to adopt public policies to protect the living intangible heritage of their culture, through the Masters of Culture program.          Among the theaters, the largest and most popular are ": null
    },
    {
        "Theatro José de Alencar": "theatro josé de alencar"
    },
    {
        ", São José Theater, São Luiz Cinema Theater, and Teatro RioMarand Teatro Via Sul.  The Ceará Museum houses numerous artifacts, including pieces of paleontology and furniture.  The ": null
    },
    {
        "Dragão do Mar Center of Art and Culture": "dragão do mar center of art and culture"
    },
    {
        " is the main cultureal centre, and includes the Ceará Museum of Culture, the Museum of Contemporary Art of Ceará, theaters, a planetarium, cinemas, shops and spaces for public presentations, as well as housing the Public Library Governador Menezes Pimentel, Oporto Iracema of the Arts and the School of Arts and Crafts Thomaz Pompeu Sobrinho.  The Casa de Jose Alencar is one of the Brazilian museums recognised as dealing with Brazilian literature.  It was opened in 1964 and houses art collections, a gallery, a library and the ruins of the first steam power plant in Ceará.  In the different SERs of the city, the complexes of the CUCA Network are spread, which are facilities dedicated to art, leisure and education, especially for young people.      ": null
    },
    {
        "Freemasonry": "freemasonry"
    },
    {
        " is represented by the Grand Masonic Lodge of Ceará and the Great State East of Ceará. There are also service clubs in the city, such as the ": null
    },
    {
        "Lions Club": "lions club"
    },
    {
        " and Rotary International.      The Ceará handicraft has its main market and showcase in Fortaleza. In the city, there are several specific places for trade in handicraft products, such as the Ceará Craft Center , Ceará Tourism Center , Crafts Fair of Beira-Mar, and on Avenida Monsenhor Tabosa.             The main literary manifestation of Fortalezas history emerged at the end of the ": null
    },
    {
        "19th century": "19th century"
    },
    {
        ", in the cafes of Praça do Ferreira, known as the Spiritual Bakery, a pioneer in the dissemination of modern ideas in Brazilian literature that would only be adopted nationally in the following century, in the ": null
    },
    {
        "Modern Art Week": "modern art week"
    },
    {
        ".   The most important historical entities of high culture still present in the city are the Ceará Institute and the Ceará Academy of Letters, the first academy of letters created in Brazil, founded in 1887 and 1894 respectively. The Ceará Institute has helped launch important names in national historiography and philosophy, such as ": null
    },
    {
        "Farias Brito": "farias brito"
    },
    {
        " and Capistrano de Abreu.  Among the writers who are members of the Cearense Academy of Letters and members or patrons of the Brazilian Academy of Letters, are ": null
    },
    {
        "Gustavo Barroso": "gustavo barroso"
    },
    {
        ", ": null
    },
    {
        "Araripe Júnior": "araripe júnior"
    },
    {
        ", ": null
    },
    {
        "José de Alencar": "josé de alencar"
    },
    {
        ", Heráclito Graça, ": null
    },
    {
        "Franklin Tavora": "franklin tavora"
    },
    {
        ", Clóvis Beviláqua and ": null
    },
    {
        "Rachel de Queiroz": "rachel de queiroz"
    },
    {
        ", the first woman to Be part of the entity. The Casa de Juvenal Galeno is another historical cultural institution of Fortaleza, named after one of the greatest poets born in the city, Juvenal Galeno. The house became well known for its festivals of poetry and seminaries.      In cinema, the most well known name is ": null
    },
    {
        "Zelito Viana": "zelito viana"
    },
    {
        ", director of films like ": null
    },
    {
        "Villa-Lobos: A Life of Passion": "villa-lobos: a life of passion"
    },
    {
        " and Life and Death of Severina. More recently, ": null
    },
    {
        "Karim Aïnouz": "karim aïnouz"
    },
    {
        " has directed": null
    },
    {
        "Madame Satã": "madame satã"
    },
    {
        ", ": null
    },
    {
        "Suely in the Sky": "suely in the sky"
    },
    {
        " and ": null
    },
    {
        "Futuro Beach": "futuro beach"
    },
    {
        ", and script of ": null
    },
    {
        "Lower City": "lower city"
    },
    {
        ", ": null
    },
    {
        "Cinema, Aspirins and Vultures": "cinema, aspirins and vultures"
    },
    {
        " and ": null
    },
    {
        "Behind the Sun": "behind the sun"
    },
    {
        ". Another current exponent of cinema born in Fortaleza is Halder Gomes, director and screenwriter of Holliúdy Cinema. New filmmakers in the city have gained in recent years prominent exhibitions such as at the ": null
    },
    {
        "Rio de Janeiro International Film Festival": "rio de janeiro international film festival"
    },
    {
        ".  The most traditional cinema event in Fortaleza is the Cine Ceará , considered one of the main festivals of the country.          The main fashion name in the city is the ": null
    },
    {
        "Lino Villaventura": ":pt:lino villaventura"
    },
    {
        ", who, from Fortaleza, designed himself nationally and internationally and today is one of the main names of ": null
    },
    {
        "São Paulo Fashion Week": "são paulo fashion week"
    },
    {
        ", besides being one of the founding designers of this fashion week.  There are major events in the city, such as the Dragão Fashion Brasil, considered the largest fashion event in the Northeast and the third largest in the country.      Much of the clothing that is produced in Ceará flows through Fortaleza, which in turn is recognized as one of the most important textile centers of the country, giving the garment industry great weight in the metropolitan economy.  Brands of the city like ": null
    },
    {
        "Santana Textiles": "santana textiles"
    },
    {
        " and headquarters of brands like Esplanada and Otoch have considerable regional influence.             ": null
    },
    {
        "Forró": "forró"
    },
    {
        " is the most popular musical genre in the city. Bands originating in Fortaleza, such as Mastruz com Leite and Aviões do Forró, were responsible for the popularization of electronic forró, which promoted the revaluation of the accordion in the genre and brought it closer to pop music. The forró pé-de serra, however, still holds great cultural influence and commercial prominence in the city.      In ": null
    },
    {
        "Música popular brasileira": "música popular brasileira"
    },
    {
        ", some of the names from Fortaleza were Fagner, Ednardo, Belchior and Amelinha. The musical tradition of Fortaleza, however, goes back to the composer Alberto Nepomuceno, one of the greatest names in classical music in Brazil, a pioneer in the development of the countrys musical nationalism, and therefore considered the founder of Brazilian music . The Alberto Nepomuceno Conservatory is one of the citys leading music schools.          Fortaleza ": null
    },
    {
        "Carnival": "carnival"
    },
    {
        " season is not as famous as that in other northeastern cities like Salvador or Recife, as the local population prefer to spend the holiday at others beach cities of Ceará. Through the streets of Fortaleza, the Carnival brings the ": null
    },
    {
        "samba": "samba"
    },
    {
        " together with festivities as a celebration of Fortalezas past and diverse culture. It is particularly notable for its unique style of maracatu known as ": null
    },
    {
        "maracatu cearense": "maracatu cearense"
    },
    {
        ".          The gastronomy of Fortaleza is very close to the typical Northeastern cuisine, and, traditional include the baião de dois, usually accompanied by barbecue of mutton or meat of sun, and tapioca which is a pancake made from the starch of cassava. The seafood is another ingredient of typical dishes of fortalezeense cuisine, such as the steak moqueca and the mackerel and snapper fish.      The fruit of the sea identity of the coast of the state is the ": null
    },
    {
        "crab": "crab"
    },
    {
        ". ": null
    },
    {
        "Shrimp": "shrimp"
    },
    {
        " and ": null
    },
    {
        "lobster": "lobster"
    },
    {
        " are also widely used delicacies in dishes such as shrimp rice or shrimp dumplings.          Acquario Ceará, due to be one of the largest oceanariums in Brazil, is currently under construction.  Attractions such as the ": null
    },
    {
        "Beach Park": "beach park"
    },
    {
        " theme park, located in the Great Fortaleza, Avenida Beira Mar and its bars, restaurants and music clubs, the beaches of Futuro and Iracema and Pirata Bar have placed Fortaleza among the Brazilian destinations preferred by Europeans.      ": null
    },
    {
        "Scuba diving": "scuba diving"
    },
    {
        " is possible in the area of ": null
    },
    {
        "Pedra da Risca do Meio Marine State Park": "pedra da risca do meio marine state park"
    },
    {
        ", a marine protected area located about 10 ": null
    },
    {
        "nautical miles": "nautical mile"
    },
    {
        "from the shoreline of Fortaleza.  ": null
    },
    {
        "Boats": "boat"
    },
    {
        "and ": null
    },
    {
        "skyscrapers": "skyscraper"
    },
    {
        "in the litoral.            Fortaleza has about  of urban beaches.  Mucuripe is the place where ": null
    },
    {
        "jangadas": "jangada"
    },
    {
        "can be found. Still used by fishermen to go into high seas, jangadas can be seen along the way during the afternoon and evenings, and returning from the sea in the morning; part of the catch of the day is sold in an old style fish market.  ": null
    },
    {
        "Iracema Beach": "iracema beach"
    },
    {
        "      The health indexes of the Fortaleza population are better than the Brazilian average. According to data from 2010, the infant mortality rate up to one year old was 15.8 per 1000 live births in Fortaleza, against a Brazilian average of 16.7.  By 2013, 90.6% of children under one year of age had their immunization records up to date. In 2012, 37,577 live births were registered, and the infant mortality rate up to five years of age was 13.2 per 1000. Of the total number of children under two years old weighed by the ": null
    },
    {
        "Family Health Program": "programa saúde da família"
    },
    {
        " in 2013, 0.8% were malnourished.      In 2009, Fortaleza had a total of 35 general hospitals, of which 11 were public, 21 were private, two were ": null
    },
    {
        "philanthropic": "philanthropic"
    },
    {
        ", and one was a trade union. The Doctor José Frota Institute is the largest hospital administered by the Municipal Government, and the General Hospital of Fortaleza is the largest hospital administered by the State Government. In addition, it had 54 specialized hospitals and eight polyclinics. The total number of physicians working in the health network of the municipality was 13,604, approximately 5.4 per thousand inhabitants.  Fortaleza has 117 units of health posts, three  administered by the municipality and six administered by the state.   The first hospital built in Fortaleza was the ": null
    },
    {
        "Santa Casa de Misericórdia": "santa casa de misericórdia"
    },
    {
        ", founded in 1861.  Among the most important public health institutions in the city, the most important is the Dr. José Frota Institute, the largest hospital administered by the Municipal Government, and the General Hospital of Fortaleza, the largest hospital administered by the State Government. Among the private institutions, the largest are the Unimed Fortaleza Regional Hospital, Antônio Prudente Hospital, Monte Klinikum Hospital and São Mateus Hospital.      One of the most important basic health programs in Fortaleza is the ": null
    },
    {
        "Family Health Program": "programa saúde da família"
    },
    {
        ", within which the city is in third place in the country in extension of coverage, with hundreds of teams distributed in dozens of care units.  The Emergency Mobile Care Service is the municipalitys health care service, which serves an average of 200 daily occurrences.      The University Hospital Walter Cantídio is the largest liver transplantation facility in the country.  The Faculty of Medicine of the UFC is the 13th best medical school in Brazil, 2nd best medical school in the North and Northeast regions and the best medical school in Ceará. UFCs medical degree is still one of the most popular in the country.                 The current passenger terminal of ": null
    },
    {
        "Pinto Martins – Fortaleza International Airport": "pinto martins – fortaleza international airport"
    },
    {
        ", located in the center of Fortaleza, was built between 1996 and 1998.  The airport is now undergoing an expansion process, from which the number of boarding bridges will increase from seven to sixteen and the passenger terminal will be expanded from 38,000 m² to 133,000 m². In 2014, the airport was capable of serving 6.2 million passengers per year, but after expansion, capacity would be 11.2 million.      Pinto Martins Airport is the third busiest airport in the Northeast Region and one of the busiest in the country, receiving on average 1,500 international aircraft and 65,000 domestic aircraft per year. In 2013, it received more than 5.9 million passengers.             In 2013, Fortaleza had 908,074 vehicles, of which 511,109 were cars, and 229 154 motorcycles. Traffic density at peak times in the city is rated as the fourth largest in the country, with 48% of congested roads. The cycle network of Fortaleza is composed of 116.4  km, of which 78.8  km are cycle paths and 37.6  km are cycle paths. The municipality also has a public bicycle system, Bicicletar, which had 40 stations and 400 units in April 2015. In 2015, the municipal taxi fleet was composed of 4 886 vehicles, including common, adapted and special use vehicles.     The citys road transport system is regulated by the Fortaleza Urban Transportation Company , an agency of the Municipality of Fortaleza. The collective transport carried out by buses is called the Integrated Transportation System , and its operation began in 1992.      The system of traffic monitoring is known by the acronym CTAFOR,  which stands for  .            The Fortaleza Metro is operated by Companhia Cearense de Transportes Metropolitanos . Founded on May 2, 1997, the company is responsible for administration, construction and metro planning in Fortaleza and its metropolitan region. The system is headed by the Government of the State of Ceará and has as current president Eduardo Hotz.     The Fortaleza Metro started on October 1, 2014. As of 2014 18 of the 20 stations planned for the South Line are in operation, along with 9 stations of the West Line.      ": null
    },
    {
        "MetroFor": "metrofor"
    },
    {
        " is the  ": null
    },
    {
        "rapid transit": "rapid transit"
    },
    {
        " system for the city of Fortaleza.        Engenheiro João Tomé ": null
    },
    {
        "Bus station": "bus station"
    },
    {
        " is the Fortaleza Bus terminal official name. Was Contstructed in 1973. It carries a daily average of over 8,000 ": null
    },
    {
        "passenger": "passenger"
    },
    {
        "s. 35 Bus companies and close to 200 ": null
    },
    {
        "bus line": "bus line"
    },
    {
        "s. The bus station is centrally located within the city limits. Only  from the city centre and  from Praia de Iracema Beach. Fortaleza bus station is accessible by at least 2 city bus lines: Av. Borges de Melo I and Av. Borges de Melo II. Fortaleza has multiple ": null
    },
    {
        "Bus Rapid Transit": "bus rapid transit"
    },
    {
        ", or BRT, lines throughout the city and has plans to extend this network of transportation        Fortaleza officially has  of ": null
    },
    {
        "bike lane": "bike lane"
    },
    {
        "s.        The average person in Fortaleza spends 89 minutes riding public transit on a weekday, and 30% of public transit riders ride for more than 2 hours every day. People typically wait 24 minutes at a stop or station for public transit; on average, 52% of riders wait for over 20 minutes every day. The average distance people usually ride in a single trip with public transit is 6.8  km, while 10% travel for over 12  km in a single direction.   Material was copied from this source, which is available under a ": null
    },
    {
        "Creative Commons Attribution 4.0 International License": "creativecommons:by/4.0/"
    },
    {
        " .         The main games of the Ceará State Championship are played in Fortaleza. There are several association football clubs in the city, including ": null
    },
    {
        "Ceará SC": "ceará sporting club"
    },
    {
        ", ": null
    },
    {
        "Fortaleza EC": "fortaleza esporte clube"
    },
    {
        " and ": null
    },
    {
        "Ferroviário AC": "ferroviário atlético clube"
    },
    {
        ". It was one of the host cities of the ": null
    },
    {
        "2013 FIFA Confederations Cup": "fifa confederations cup 2013"
    },
    {
        " and ": null
    },
    {
        "2014 FIFA World Cup": "2014 fifa world cup"
    },
    {
        ".     ": null
    },
    {
        "José de Alencar": "josé de alencar"
    },
    {
        ", famous writer from the 19th century   ": null
    },
    {
        "Alberto Nepomuceno": "alberto nepomuceno"
    },
    {
        ", famous composer from the 19th century   ": null
    },
    {
        "Rachel de Queiroz": "rachel de queiroz"
    },
    {
        ", first female writer in ": null
    },
    {
        "Academia Brasileira de Letras": "academia brasileira de letras"
    },
    {
        " André Diamant": "andré diamant"
    },
    {
        ", international chess ": null
    },
    {
        "grandmaster": "grandmaster"
    },
    {
        " Casimiro Montenegro Filho": "casimiro montenegro filho"
    },
    {
        ", founder of the Brazilian Air Force Aeronautical Technologic Institute - ": null
    },
    {
        "ITA": "instituto tecnológico de aeronáutica"
    },
    {
        " Maurício Peixoto": "maurício peixoto"
    },
    {
        ", mathematician, one of the founders of ": null
    },
    {
        "IMPA": "instituto nacional de matemática pura e aplicada"
    },
    {
        " Gilberto Câmara": "gilberto câmara"
    },
    {
        ", former director of Brazils ": null
    },
    {
        "National Institute for Space Research": "national institute for space research"
    },
    {
        "   Hélder Câmara": "hélder câmara"
    },
    {
        ", Roman Catholic Archbishop nominated for the Nobel Peace Prize   ": null
    },
    {
        "Castelo Branco": "humberto de alencar castelo branco"
    },
    {
        ", former president   ": null
    },
    {
        "Karim Aïnouz": "karim aïnouz"
    },
    {
        ", film director   ": null
    },
    {
        "Ed Lincoln": "ed lincoln"
    },
    {
        ", musician and composer   ": null
    },
    {
        "Shelda Bede": "shelda bede"
    },
    {
        ", beach volleyball player and olympic medalist   ": null
    },
    {
        "Raffael": "raffael"
    },
    {
        ", professional footballer   ": null
    },
    {
        "Ronny Araújo": "ronny heberson furtado de araújo"
    },
    {
        ", professional footballer   ": null
    },
    {
        "Mário Jardel": "mário jardel"
    },
    {
        ", retired professional footballer   ": null
    },
    {
        "Marcus Aurélio": "marcus aurélio"
    },
    {
        ", mixed martial arts professional   ": null
    },
    {
        "Wilson Gouveia": "wilson gouveia"
    },
    {
        ", mixed martial arts professional   ": null
    },
    {
        "Thiago Alves": "thiago alves"
    },
    {
        ", mixed martial arts professional   ": null
    },
    {
        "Hermes França": "hermes frança"
    },
    {
        ", mixed martial arts professional   ": null
    },
    {
        "Jorge Gurgel": "jorge gurgel"
    },
    {
        ", mixed martial arts professional   ": null
    },
    {
        "Heloneida Studart": "heloneida studart"
    },
    {
        ", writer, politician, womens rights advocate                Fortaleza is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:   ": null
    }
]