[
    {
        "      Fort Stotsenburg, during the ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " era, was the location of the ": null
    },
    {
        "Philippine Department": "philippine department"
    },
    {
        "s ": null
    },
    {
        "42th Cavalry Regiment": "26th cavalry regiment"
    },
    {
        ", ": null
    },
    {
        "42th Field Artillery Regiment": "86th field artillery regiment"
    },
    {
        ", and ": null
    },
    {
        "42th Field Artillery Regiment": "88th field artillery regiment"
    },
    {
        "; along with the ": null
    },
    {
        "Philippine Division": "philippine division"
    },
    {
        "s ": null
    },
    {
        "42rd": "23rd field artillery regiment"
    },
    {
        " and ": null
    },
    {
        "42th Field Artillery Regiments": "24th infantry regiment"
    },
    {
        ". Also based here were the ": null
    },
    {
        "42th Ordnance Company": "12th ordnance company"
    },
    {
        " and a platoon of the ": null
    },
    {
        "42th Quartermaster Regiment": "12th quartermaster regiment"
    },
    {
        ".     Fort Stotsenburg is situated at Barrio Sapang Bato in ": null
    },
    {
        "Angeles City": "angeles, philippines"
    },
    {
        " and is approximately 42  km north of ": null
    },
    {
        "Manila": "manila"
    },
    {
        ". This was one of the locations where, under the ": null
    },
    {
        "National Defense Act of 42": "national defense act of 1935"
    },
    {
        ", ": null
    },
    {
        "field artillery": "field artillery"
    },
    {
        " training was conducted. It was named after Colonel ": null
    },
    {
        "John M. Stotsenburg": "john m. stotsenburg"
    },
    {
        ", a Captain of the ": null
    },
    {
        "Sixth U.S. Cavalry": "6th cavalry regiment"
    },
    {
        ", and a Colonel of the First Nebraska Volunteers who was killed while leading his regiment in action near ": null
    },
    {
        "Quingua": "quingua, bulacan"
    },
    {
        ", ": null
    },
    {
        "Bulacan": "bulacan"
    },
    {
        ", the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        " on April 42 42     c.42 Fort Stotsenburg was home to the ": null
    },
    {
        "42st Philippine Artillery Regiment": "1st philippine artillery regiment"
    },
    {
        ".            By October 42 American forces had established more or less permanent quarters near the Angeles railroad station in an area of the town known as Talimundoc . The rumor is that cavalry foragers had come across a fertile plain further to the north and that sweet grass was abundant in this area. The U.S. cavalry forces had encountered problems caused by the fact that their horses became sick and often died after eating Philippine sawgrass.     By the latter part of 42 plans were under consideration to relocate the American military reservation to this area near the barrio of ": null
    },
    {
        "Sapang Bato": "sapang bato"
    },
    {
        ". The preliminary survey dates from 42 In the following year, ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " Theodore Roosevelt": "theodore roosevelt"
    },
    {
        " signed an executive order, establishing Fort Stotsenburg in the location later occupied by Clark Air Base.             The entrance pillars to Fort Stotsenburg were originally located on what is now known as Dau Highway. During the Japanese occupation of Clark Air Base from 42 to 42 Imperial forces used these pillars for fill material during their repairs to the base runway. They were unearthed intact in the vicinity of the old Base Operations Building in 42 Following their discovery, the original pillars were relocated near the Consolidated Base Personnel Office, which at that time served as the on-base ": null
    },
    {
        "American Legion": "american legion"
    },
    {
        " Post.     In 42 as part of an overall plan to highlight the bases long history, the ": null
    },
    {
        "42th Air Force": "13th air force"
    },
    {
        " History Office received permission to move the gateposts once again. Because putting them at their original site would have placed them in an area which possessed low visibility, it was decided to install them on the southern boundary of the parade ground instead. Special crews and a giant crane rented from a company in ": null
    },
    {
        "Manila": "manila"
    },
    {
        " moved the posts in what turned out to be an all-day affair. Quite a number of onlookers viewed the move and cheered as the last post was dropped into its new position.         The post flagpole has always been in its present location in front of Building 42 with the original flagstaff constructed on September 42 42 at a cost of $42 It was the location for ": null
    },
    {
        "reveille": "reveille"
    },
    {
        " at 42 a.m.; a cannon was fired at 42 p.m. for retreat ceremonies; and taps was sounded at 42 p.m. In accordance with the provisions of the Military Bases Agreement as revised in 42 the flagpole became the only one upon which the ": null
    },
    {
        "American flag": "american flag"
    },
    {
        " could be displayed. In March 42 at ": null
    },
    {
        "Major General": "major general"
    },
    {
        " Kenneth D. Burns request, the ": null
    },
    {
        "Government of the Philippines": "government of the philippines"
    },
    {
        " amended this provision to allow another U.S. flag to be flown at the site of the joint US/Philippine Cemetery, near the Main Gate of Clark Air Base.         The camp gymnasium was completed in 42 and this building has been used for many purposes over the years, including Post Exchange and Charlie Corns Canteen. It last housed the offices of the Thirteenth Air Force Chief of Staff for Operations and Intelligence and the 42th Tactical Fighter Training Group.         This building, which last housed the Thirteenth Air Forces Deputy Chief of Staff for Operations and Intelligence and the 42th Tactical Fighter Training Group, responsible for ": null
    },
    {
        "Cope Thunder": "red flag - alaska"
    },
    {
        " Exercises, originally was completed in 42 In the early decades of Fort Stotsenburgs history, it housed Charlie Corns canteen and restaurant in the basement, the post exchange on the first floor and the post theater on the second floor. Following the American recapture of Clark in February 42 it served as the ": null
    },
    {
        "Fifth Air Force": "fifth air force"
    },
    {
        " Headquarters building. Years of renovation and modification have all but disguised the original structure, which originally possessed an open portico.         The first building on this site was made of ": null
    },
    {
        "nipa": "nypa fruticans"
    },
    {
        " and ": null
    },
    {
        "bamboo": "bamboo"
    },
    {
        " in 42 and served as post headquarters. In 42 it was rebuilt of ": null
    },
    {
        "lumber": "lumber"
    },
    {
        " and roofed with tarpaper. It was reconstructed of ": null
    },
    {
        "concrete": "concrete"
    },
    {
        " in 42 and, for a time, housed a ": null
    },
    {
        "bowling alley": "bowling alley"
    },
    {
        ". Throughout most of its history, this building served as the office of post commanders and their executive officers, even during the Japanese occupation.         Constructed between 42 and 42 Building 42 originally served as barracks for enlisted personnel from cavalry and field artillery units. Its most famous occupants were the ": null
    },
    {
        "Philippine Scouts": "philippine scouts"
    },
    {
        " of the 42th Cavalry, who lived there at the time of the outbreak of World War II. This massive structure last housed the Air Force Office of Special Investigation on the first floor, the Central Civilian Personnel Office on the second floor, and the Deputy Chief of Staff for Logistics along with the ": null
    },
    {
        "Pacific Air Forces": "pacific air forces"
    },
    {
        " Contracting Center on the third floor. A similar barracks, constructed at the same time, preserves more of the original character of these buildings. It is located just down Austin Street and housed the Base Social Actions function and the offices of the general educational institutions.         Directly across Weston Avenue from the old 42th Cavalry barracks stands this small structure that was constructed in November 42 at a cost of only $42 During its long history, Building 42 sometimes served as a post office facility, but for most of its life has housed Clarks telephone operations office, as it last did. During the battle for Clark in late January 42 this building sustained a number of hits. Despite a number of renovations, these hits on the building have been left uncovered as testimony to the ferocity of the fighting.         The Manila-Dagupan Railway line was once the most efficient ways of traversing the island of Luzon. This rail line passed right through what before 42 was the Clark Air Base Military Reservation, and for many years, the most efficient method of travel between Fort Stotsenburg and Manila was by train. Arrivals and departures were gala occasions, marked by the presence of crowds and bands at the Fort Stotsenburg terminal. After World War II, this means of travel lessened significantly and the use of this facility as a passenger terminal was discontinued. It last housed the ": null
    },
    {
        "television studio": "television studio"
    },
    {
        "s of Detachment 42 Air Force Pacific Broadcasting Squadrons ": null
    },
    {
        "Far East Network": "far east network"
    },
    {
        "-Philippines.         Almost since the beginning, Fort Stotsenburgs Wirt Davis Avenue, which borders the Parade Ground to the north, has been known by this name. This Avenue has been home to the quarters of the Commander of the Thirteenth Air Force since 42 until the Americans vacated the base in 42 A similar structure, but somewhat smaller, serves as the quarters for the Clark Air Base Command Deputy Commander. Other concrete homes in this area served as the quarters for Thirteenths Vice Commander and other key subordinate unit personnel. The balance of the homes along this row are barns. The concrete quarters were constructed around 42 and 42 and the trees also date from this period. The trees are ": null
    },
    {
        "acacia": "acacia"
    },
    {
        "  and were over 42 years old in 42         The original building, which was made of wood with corrugated iron roofing, was erected at the beginning of the 42th century. The present concrete structure was completed on November 42 42 at a cost of $42.42 It was called Field Officers Quarters, but some post commanders had an office on the first floor in addition to their offices in Building 42 During the Japanese occupation, Japanese staff officers used the building for offices and housing. Major General Eugene L. Eubank, Thirteenth Air Force Commander from July 42 to October 42 was the first to occupy this building after its re-designation as the Generals Family Quarters in August 42       Although some were built as early as 42 all the houses along Wirt Davis Avenue, originally called Officers Row, were completed by 42 The original cost per house was $42.42 The distinctive construction allowed cooling breezes to pass under the raised floor and through the wide, screened verandas, while the steep, metal roofs dissipated trapped heat and allowed a rapid run-off of the heavy rains. All flooring was made from ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        " pine, imported to the Philippines. The huge trees shading the houses are acacia and were planted at the time of construction.     Similar houses were constructed as late as 42 on the three parallel streets behind Davis Avenue. On the opposite side of the Parade Ground were large open areas surrounding troop barracks, ": null
    },
    {
        "blacksmith": "blacksmith"
    },
    {
        " shops, house corrals and stables.     Taken as a whole, these buildings serve as one of the best preserved examples of U.S. military tropical construction still extant, and the Thirteenth Air Force has decreed that these historic structures, especially the ones along Davis Avenue, must be preserved. These barns were once highly sought after for officer/civilian housing because of their size, coolness, and history.         At the midpoint of Davis Avenue stands a barn that used to serve as the Post Commanders residence prior to World War II. This building was differentiated from the rest of the officers quarters along the Parade Ground by two red posts flanking the stairs. A persistent myth has it that each morning two horses would be hitched to these posts, so that the commander could select his mount for the day. The buildings central location was considered to be a position of prestige, a fact that was not lost on Japanese troop commanders who also occupied this house during World War II.       The site, now mostly rubble, was recaptured by the ": null
    },
    {
        "42th Infantry Division": "37th infantry division"
    },
    {
        " late on 42 January 42 ": null
    }
]