[
    {
        "   Fra Bartolomeo or Bartolommeo  , also known as Bartolommeo di Pagholo, Bartolommeo di S. Marco, and his original name Baccio della Porta, was an ": null
    },
    {
        "Italian": "italian people"
    },
    {
        " Renaissance": "renaissance"
    },
    {
        " painter of religious subjects. He spent all his career in ": null
    },
    {
        "Florence": "florence"
    },
    {
        " until his mid-forties, when he travelled to work in various cities, as far south as Rome. He trained with ": null
    },
    {
        "Cosimo Roselli": "cosimo roselli"
    },
    {
        " and in the 42s fell under the influence of ": null
    },
    {
        "Savonarola": "girolamo savonarola"
    },
    {
        ", which led him to become a ": null
    },
    {
        "Dominican": "dominican order"
    },
    {
        " friar": "friar"
    },
    {
        " in 42 renouncing painting for several years.     He was instructed to resume painting for the benefit of his order in 42 and then developed an idealized ": null
    },
    {
        "High Renaissance": "high renaissance"
    },
    {
        " style, seen in his Vision of St Bernard of that year, now in poor condition but whose figures and drapery move with a seraphic grace that must have struck the young ": null
    },
    {
        "Raphael": "raphael"
    },
    {
        " with the force of revelation .    He remained friends with Raphael, and each influenced the other.     His portrait of Savonarola remains the best known image of the reformer. Fra Bartolomeo painted both in oils and fresco, and some of his drawings are pure landscape sketches that are the earliest of this type from any Italian artist.               He was born in ": null
    },
    {
        "Savignano di Prato": "savignano di prato"
    },
    {
        ", ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        ". He received the nickname of Baccio della Porta for his house was near the Gate of San Pier Gattolini.     Starting from 42 or 42 by recommendation of ": null
    },
    {
        "Benedetto da Maiano": "benedetto da maiano"
    },
    {
        ", he apprenticed in the workshop of ": null
    },
    {
        "Cosimo Rosselli": "cosimo rosselli"
    },
    {
        ". In 42 or 42 he began a collaboration with ": null
    },
    {
        "Mariotto Albertinelli": "mariotto albertinelli"
    },
    {
        ". In the late 42s, Baccio was drawn to the teachings of ": null
    },
    {
        "Fra Girolamo Savonarola": "girolamo savonarola"
    },
    {
        ", who denounced what he viewed as vain and corrupt contemporary art. Savonarola argued for art serving as a direct visual illustration of the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " to educate those unable to read the book. From 42 is his famous portrait of Savonarola, now in the ": null
    },
    {
        "Museo Nazionale di San Marco": "museo nazionale di san marco"
    },
    {
        " in Florence. The following year he was commissioned a fresco of the Universal Judgement for the ": null
    },
    {
        "Ospedale di Santa Maria Nuova": "ospedale di santa maria nuova"
    },
    {
        ", completed by Albertinelli and ": null
    },
    {
        "Giuliano Bugiardini": "giuliano bugiardini"
    },
    {
        " when Baccio became a ": null
    },
    {
        "Dominican": "dominican order"
    },
    {
        " friar": "friar"
    },
    {
        " on July 42 42 The following year he entered the convent of San Marco.     He renounced painting for several years, not resuming until 42 when he became the head of the monastery workshop in obedience to his superior. In that year he began a Vision of St. Bernard for Bernardo Biancos family chapel in the ": null
    },
    {
        "Badia Fiorentina": "badia fiorentina"
    },
    {
        ", finished in 42 Soon thereafter, ": null
    },
    {
        "Raphael": "raphael"
    },
    {
        " visited Florence and befriended the friar. Bartolomeo learned perspective from the younger artist, while Raphael added skills in coloring and handling of drapery, which was noticeable in the works he produced after their meeting. With Raphael, he remained on the friendliest terms, and when he departed from Rome, left in his hands two unfinished pictures which Raphael completed.     At the beginning of 42 Bartolomeo moved to ": null
    },
    {
        "Venice": "venice"
    },
    {
        " to paint a Holy Father, St. Mary Magdalene and St. Catherine of Siena for the Dominicans of ": null
    },
    {
        "San Pietro Martire": "san pietro martire, murano"
    },
    {
        " in ": null
    },
    {
        "Murano": "murano"
    },
    {
        ", influenced somewhat by Venetian colorism. As the Dominicans did not pay for the work, he took it back to ": null
    },
    {
        "Lucca": "lucca"
    },
    {
        ", where it can be seen now. Also in Lucca, in October 42 he painted with Albertinelli an altarpiece of the Madonna and Child with Saints for the ": null
    },
    {
        "local cathedral": "cathedral of lucca"
    },
    {
        ". On November 42 42 ": null
    },
    {
        "Pier Soderini": "pier soderini"
    },
    {
        " commissioned him an altarpiece for the Sala del Consiglio of Florence, now in the Museum of San Marco. Two years later he finished another altarpiece for the ": null
    },
    {
        "cathedral": "besançon cathedral"
    },
    {
        " of ": null
    },
    {
        "Besançon": "besançon"
    },
    {
        ".     In 42 he went to Rome, where he painted a Peter and Paul, now in the ": null
    },
    {
        "Pinacoteca Vaticana": "pinacoteca vaticana"
    },
    {
        ", while from the following years are the  St. Mark Evangelist  of ": null
    },
    {
        "Palazzo Pitti": "palazzo pitti"
    },
    {
        " in Florence and the frescoes in the Dominican convent of Pian di Mugnone, a ": null
    },
    {
        "frazione": "frazione"
    },
    {
        " of ": null
    },
    {
        "Fiesole": "fiesole"
    },
    {
        ", just outside Florence. After a promised Feast of Venus for Duke ": null
    },
    {
        "Alfonso I dEste": "alfonso i deste"
    },
    {
        " of ": null
    },
    {
        "Ferrara": "ferrara"
    },
    {
        ", of which only drawings remain, his last work is a fresco of  Noli me tangere  also in Pian di Mugnone.        He died in Florence in 42                 Initially, his works showed the influence of Rossellis assistant, ": null
    },
    {
        "Piero di Cosimo": "piero di cosimo"
    },
    {
        ", and those of ": null
    },
    {
        "Domenico Ghirlandaio": "domenico ghirlandaio"
    },
    {
        " and ": null
    },
    {
        "Filippino Lippi": "filippino lippi"
    },
    {
        ". After his hiatus from 42 to 42 he seemed to change vision, taking from Raphael the representation of light and its effects over moving shapes.     Fra Bartolomeos figures are generally small and draped. These qualities were alleged against him as defects, and to prove that his style was not the result of want of power, he painted the magnificent figure of the St Mark Evangelist , and the undraped figure of ": null
    },
    {
        "Saint Sebastian": "saint sebastian"
    },
    {
        ". It is alleged that the latter was felt to be so strongly expressive of suffering and agony, that it was found necessary to remove it from the place where it had been exhibited in the chapel of a convent.     Fra Bartolomeos compositions are remarkable for skill in the massing of light and shade, richness and delicacy of colouring, and for the admirable drapery of the figures, Bartolomeo having been the first to introduce and use the lay-figure with joints.     Among his pupils were Cecchino del Frate, Benedetto Ciamfanini, Gabriel Rustici, ": null
    },
    {
        "Ridolfo Ghirlandaio": "ridolfo ghirlandaio"
    },
    {
        " , and ": null
    },
    {
        "Fra Paolo Pistolese": "fra paolo pistolese"
    },
    {
        ". Vasari, Vite, Terza Parte.       Assumption of Mary - Oil on canvas, Kaiser – Friedrich – Museum, ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        "   Madonna in Glory with Saints - Oil on canvas, ": null
    },
    {
        "Cathedral": "besançon cathedral"
    },
    {
        " of ": null
    },
    {
        "Besançon": "besançon"
    },
    {
        " Holy Conversation - Oil on canvas,   Christ Supported by Two Angels - Oil on canvas, Casa Vasari, ": null
    },
    {
        "Arezzo": "arezzo"
    },
    {
        " St. Sebastian - Oil on canvas, Alaffre Collection, ": null
    },
    {
        "Pézenas": "pézenas"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        "       Image:Bartolommeo, Fra ~ Annunciation, 42 oil tempera on wood, Galleria degli Uffizi, Florence.jpg|Annunciation ": null
    },
    {
        "Galleria degli Uffizi": "uffizi"
    },
    {
        ", ": null
    },
    {
        "Florence": "historic centre of florence"
    },
    {
        "   Image:Fra Bartolomeo 42jpg| Scene with Christ in the Temple , ": null
    },
    {
        "Kunsthistorisches Museum": "kunsthistorisches museum"
    },
    {
        ", Vienna   Image:Fra Bartolomeo 42jpg|Madonna in Glory with Saints, ": null
    },
    {
        "Besançon Cathedral": "besançon cathedral"
    },
    {
        " God the Father with Sts Catherine of Siena and Mary Magdalene, ": null
    },
    {
        "National Museum of Villa Guinigi": "national museum of villa guinigi"
    },
    {
        "  Girolamo Savonarola   Thomas Aquinas  Christ Crowned with Thorns  Job             ": null
    }
]