[
    {
        "       Francis Brett Young was an ": null
    },
    {
        "English": "england"
    },
    {
        " novelist": "novelist"
    },
    {
        ", ": null
    },
    {
        "poet": "poet"
    },
    {
        ", ": null
    },
    {
        "playwright": "playwright"
    },
    {
        ", and ": null
    },
    {
        "composer": "composer"
    },
    {
        ".       Francis Brett Young was born in ": null
    },
    {
        "Halesowen": "halesowen"
    },
    {
        ", ": null
    },
    {
        "Worcestershire": "worcestershire"
    },
    {
        " . He received his early education at a private school in ": null
    },
    {
        "Sutton Coldfield": "sutton coldfield"
    },
    {
        ". His father was a doctor and his mother also came from a medical family, so it was natural that he go to the school for the sons of doctors, ": null
    },
    {
        "Epsom College": "epsom college"
    },
    {
        ". He was there when, at fourteen, he suffered the death of his beloved mother. He later went on to train at the ": null
    },
    {
        "University of Birmingham": "university of birmingham"
    },
    {
        " to become a qualified physician. He met his wife Jessie Hankinson while he was lodging at ": null
    },
    {
        "Edgbaston": "edgbaston"
    },
    {
        " in Birmingham and she was training at ": null
    },
    {
        "Anstey College of Physical Education": "anstey college of physical education"
    },
    {
        ", then housed in nearby ": null
    },
    {
        "The Leasowes": "the leasowes"
    },
    {
        " .     He started medical practice on the steamship SS Kintuck, on a long voyage to the Far East. He returned with the money to purchase his own medical practice at Cleveland House, ": null
    },
    {
        "Brixham": "brixham"
    },
    {
        ", ": null
    },
    {
        "Devon": "devon"
    },
    {
        ", in 42 Established in his first secure job, he was able to be secretly married to Jessie Hankinson in December 42 Jessie was also a singer and he accompanied her, as well as composing two sets of songs for her, published in 42 and 42 His first attempt at a novel, Undergrowth, was a collaboration with his brother, Eric.     During the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        " he saw service in ": null
    },
    {
        "German East Africa": "german east africa"
    },
    {
        " in the ": null
    },
    {
        "Royal Army Medical Corps": "royal army medical corps"
    },
    {
        ", but was invalided out in 42 and no longer able to practise medicine. His own account of these wartime events is given in his book Marching on Tanga; passages censored from that book were later covertly used in his novel Jim Redlake.     Unable to work as a doctor, he decided to devote himself to his writing, and in 42 he began the first of his Mercian novels. From 42 the couple went to live in ": null
    },
    {
        "Capri": "capri"
    },
    {
        " until 42 but also travelled widely, including trips to ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ", the United States and summers in the ": null
    },
    {
        "Lake District": "lake district"
    },
    {
        " of England. They returned to live in England, initially in the Lake District as neighbours of fellow novelist ": null
    },
    {
        "Hugh Walpole": "hugh walpole"
    },
    {
        ". Here they lived in ": null
    },
    {
        "Esthwaite Lodge": "esthwaite lodge"
    },
    {
        ", a country house, still standing, south of ": null
    },
    {
        "Hawkshead": "hawkshead"
    },
    {
        " on the west side of ": null
    },
    {
        "Esthwaite Water": "esthwaite water"
    },
    {
        ". Then, from 42 they settled at the dilapidated Craycombe House, ": null
    },
    {
        "Fladbury": "fladbury"
    },
    {
        ", ": null
    },
    {
        "Worcestershire": "worcestershire"
    },
    {
        ", which he was able to buy and slowly renovate due to his continuing success as a writer. His income also enabled him to spend the winters in Capri, which was vital due to his poor health. This changed as Italy became fascist and war approached, and in 42 he purchased Talland House between ": null
    },
    {
        "Looe": "looe"
    },
    {
        " and ": null
    },
    {
        "Polperro": "polperro"
    },
    {
        " as an alternative winter retreat. When war came in 42 Craycombe House was requisitioned by the Red Cross and turned into a convalescent home for the armed services.     In 42 near to the wars end, he published his epic poem The Island, recounting in verse the whole history of Britain from the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " to the ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        ". The entire first edition of 42 sold out immediately, even in wartime conditions, and was then reprinted.     The winters and wartime privations in England had taken their toll on his poor health. In October 42 having seen The Island through to publication, he had a serious heart attack. At the end of the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " he moved to ": null
    },
    {
        "Montagu": "montagu, western cape"
    },
    {
        " in the ": null
    },
    {
        "Klein Karoo": "klein karoo"
    },
    {
        ", ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ". The climate suited him, and he was even able to complete the writing of a non-fiction guide book for the ": null
    },
    {
        "South African Tourist Board": "south african tourist board"
    },
    {
        ". He died in ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        " in 42 His ashes were returned to England, and are buried in ": null
    },
    {
        "Worcester Cathedral": "worcester cathedral"
    },
    {
        ".       Like many authors he uses the places and occupations he knew as the backdrops for his work. There is much description of the sea, war and medical practice set in places as far apart as the West Midlands and West Country of England and ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ". His first published novel Deep Sea has ": null
    },
    {
        "Brixham": "brixham"
    },
    {
        " as a background while Portrait of Clare is set in the West Midlands, as are several of his works from this period. The Iron Age is set partly in ": null
    },
    {
        "Ludlow": "ludlow"
    },
    {
        ", ": null
    },
    {
        "Shropshire": "shropshire"
    },
    {
        ".       The central project of Francis Brett Youngs career was a series of linked novels set in a loosely fictionalised version of the English ": null
    },
    {
        "West Midlands": "west midlands"
    },
    {
        " and ": null
    },
    {
        "Welsh Borders": "welsh marches"
    },
    {
        ". The Mercian novels were originally inspired by the construction of ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        " Corporations ": null
    },
    {
        "Elan Valley Reservoirs": "elan valley reservoirs"
    },
    {
        " from 42–42 and the country traversed by their associated aqueduct. The Black Diamond; Preface - Francis Brett Young; Collins, 42 The Black Diamond tells the story of a labourer working on the aqueduct in the region around ": null
    },
    {
        "Knighton": "knighton, powys"
    },
    {
        ", while The House Under the Water deals at length with the construction of the reservoirs themselves. The series expanded into a wide-ranging study of Midlands society from the 42s through to the outbreak of the Second World War. Although linked by recurring characters, each of the Mercian novels can be read as an independent work. They range in style from the atmospheric psychological horror of Cold Harbour  The Annotated Supernatural Horror in Literature ; Chapter IX—H. P. Lovecraft, ed. ": null
    },
    {
        "S. T. Joshi": "s. t. joshi"
    },
    {
        "; ": null
    },
    {
        "Hippocampus Press": "hippocampus press"
    },
    {
        ", 42;  to the romantic family saga of Portrait of Clare , which won that years ": null
    },
    {
        "James Tait Black Memorial Prize": "james tait black memorial prize"
    },
    {
        ".     Like ": null
    },
    {
        "Thomas Hardy": "thomas hardy"
    },
    {
        "s ": null
    },
    {
        "Wessex": "wessex"
    },
    {
        " novels, the Mercian novels are unified by their setting—a semi-fictionalised realisation of an actual geographical region. While some actual place-names appear unchanged , most locations appear under a fictional name . Other locations appear to be fictional conflations of various real-world places; e.g., the ": null
    },
    {
        "Black Country": "black country"
    },
    {
        " town of Wednesford; resembling in many respects the actual town of ": null
    },
    {
        "Wednesbury": "wednesbury"
    },
    {
        " but located by the author in the Stour Valley , and the hamlet of Cold Harbour; modelled on Wassell Grove near ": null
    },
    {
        "Hagley": "hagley"
    },
    {
        " Cold Harbour - Francis Brett Young, House of Stratus, 42;  but described by him as overlooking the ": null
    },
    {
        "Black Country": "black country"
    },
    {
        ".       Undergrowth   Deep Sea   The Iron Age   Marching to Tanga    The Young Physician   Poems, 4242   The Black Diamond   The Red Knight Collins, London  Cold Harbour    Portrait of Clare     My Brother Jonathan    Jim Redlake   Mr. and Mrs. Pennington   The House Under the Water   This Little World   White Ladies   Far Forest   Portrait of a Village   They Seek a Country   Dr. Bradley Remembers   The City of Gold   Mr Luctons Freedom    A Man About the House  , play and film both 42   The Island   In South Africa   Wistanslow     The papers of Francis Brett Young are held at the University of Birmingham Special Collections.       Several of his books were adapted for film and television, including  My Brother Jonathan  starring ": null
    },
    {
        "Michael Denison": "michael denison"
    },
    {
        ", ": null
    },
    {
        "Dulcie Gray": "dulcie gray"
    },
    {
        " and ": null
    },
    {
        "James Robertson Justice": "james robertson justice"
    },
    {
        "; and  Portrait of Clare  starring ": null
    },
    {
        "Margaret Johnston": "margaret johnston"
    },
    {
        ", ": null
    },
    {
        "Richard Todd": "richard todd"
    },
    {
        " and ": null
    },
    {
        "Robin Bailey": "robin bailey"
    },
    {
        ". Both also share ": null
    },
    {
        "Aston Rowant railway station": "aston rowant railway station"
    },
    {
        " as a filming location.     In 42 My Brother Jonathan was adapted into a British television series starring ": null
    },
    {
        "Daniel Day-Lewis": "daniel day-lewis"
    },
    {
        " and ": null
    },
    {
        "Barbara Kellerman": "barbara kellerman"
    },
    {
        ".        Francis Brett Young .   Jessica Brett Young. Francis Brett Young: A Biography .   ": null
    },
    {
        "David Cannadine": "david cannadine"
    },
    {
        ". This Little World: The Value of the Novels of Francis Brett Young as a Guide to the State of Midland Society, 4242 .          Dutch translation of Marching on Tanga, Bibliotheek van de Eerste Wereldoorlog, at Dulce et Decorum. Accessed 42 October 42                                               ": null
    }
]