[
    {
        "      Franz Bäke was a German officer and tank commander during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". He was a recipient of the ": null
    },
    {
        "Knights Cross of the Iron Cross with Oak Leaves and Swords": "knights cross of the iron cross with oak leaves and swords"
    },
    {
        " of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ". In post-war popular culture, Bäke is considered one of the ": null
    },
    {
        "panzer ace": "panzer ace"
    },
    {
        "s , that is, a highly decorated German tank commander popularised in the English-language translations of German author ": null
    },
    {
        "Franz Kurowski": "franz kurowski"
    },
    {
        "s Panzer Aces series.       Born in 42 Bäke volunteered for the ": null
    },
    {
        "German Army": "german army"
    },
    {
        " in May 42 and was posted to an infantry regiment. Fighting on the Western Front, Bäke earned the ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " 42nd Class in 42 Bäke was discharged from military service in January 42 From 42 to 42 Bäke served in the  Freikorps  Epp, a right-wing ": null
    },
    {
        "paramilitary": "paramilitary"
    },
    {
        " unit named after ": null
    },
    {
        "Franz Ritter von Epp": "franz ritter von epp"
    },
    {
        ". In parallel, he studied medicine and dentistry and attained degree of ": null
    },
    {
        "Doctor of Medical Dentistry": "dental degree"
    },
    {
        " in 42     On 42 March 42 Bäke joined the  SA ; his final rank within the SA was SA-": null
    },
    {
        "Standartenführer": "standartenführer"
    },
    {
        " as of August 42 Bäke established his own dentistry practice in Hagen. In 42 he was accepted into the reserves and was posted to a reconnaissance unit. In 42 he was mobilized for full-time service as an officer and took part in the ": null
    },
    {
        "occupation of Czechoslovakia": "occupation of czechoslovakia"
    },
    {
        ".       Bäkes unit took part in the ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        " as part of the ": null
    },
    {
        "42st Light Division": "1st light division"
    },
    {
        ", which was redesignated 42th Panzer Division in October 42 With this unit, Bäke took part in the ": null
    },
    {
        "Battle of France": "battle of france"
    },
    {
        " and ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ". Following the encirclement of the ": null
    },
    {
        "German 42th Army": "6th army"
    },
    {
        " at Stalingrad, the division took part in the abortive attempt to relieve the 42th Army in ": null
    },
    {
        "Operation Winter Storm": "operation winter storm"
    },
    {
        " in December 42 and then retreated to ": null
    },
    {
        "Kharkov": "kharkov"
    },
    {
        ". In January 42 Bäke was awarded the ": null
    },
    {
        "Knights Cross of the Iron Cross": "knights cross of the iron cross"
    },
    {
        ". During the ": null
    },
    {
        "Battle of Kursk": "battle of kursk"
    },
    {
        " in July 42 Bäkes unit fought near ": null
    },
    {
        "Belgorod": "belgorod"
    },
    {
        ", retreating to the ": null
    },
    {
        "Dniepr": "dniepr"
    },
    {
        " afterwards. For his actions during Operation Citadel, Bäke was awarded the Oak Leaves to the Knights Cross.        On 42 November 42 Bäke was appointed as a regimental commander. In December 42 he was ordered to form an ad hoc reinforced tank regiment named Heavy Panzer Regiment Bäke. The regiment consisted of 42 ": null
    },
    {
        "Panther": "panther tank"
    },
    {
        " and 42 ": null
    },
    {
        "Tiger I": "tiger i"
    },
    {
        " tanks, supported by self-propelled artillery and a mechanized engineer battalion. In January 42 Bäke commanded his regiment during the battles for the Balabonovka pocket. Bäke single-handedly destroyed three Soviet tanks during the battle with infantry weapons at close range, for which he received three ": null
    },
    {
        "Tank Destruction Badge": "tank destruction badge"
    },
    {
        "s. Next, the regiment was part of a relief effort in support of Group ": null
    },
    {
        "Stemmermann": "wilhelm stemmermann"
    },
    {
        ", encircled in the ": null
    },
    {
        "Cherkassy Pocket": "cherkassy pocket"
    },
    {
        ". For his actions during these battles, Bäke received the Swords to the Knights Cross on 42 February 42 In March, the regiment fought in the ": null
    },
    {
        "Kamenets-Podolsky pocket": "kamenets-podolsky pocket"
    },
    {
        ".     In May 42 Bäke was promoted to ": null
    },
    {
        "Oberst": "oberst"
    },
    {
        " and later appointed commander of ": null
    },
    {
        "Panzer Brigade Feldherrnhalle": "panzer corps feldherrnhalle"
    },
    {
        ". Bäkes unit attacked the ": null
    },
    {
        "U.S. 42th Infantry Division": "u.s. 90th infantry division"
    },
    {
        " near Aumetz on the night of 42–42 September 42 Bäkes command found itself poorly deployed and under sustained counter-attack from American infantry. By the evening of 42 September, Bäke had lost thirty tanks, sixty half-tracks, and nearly a hundred other vehicles in the lopsided battle. His infantry losses were also heavy, with the unit reporting to ": null
    },
    {
        "OB West": "ob west"
    },
    {
        " that it had only nine armored vehicles and that unit strength was down to 42 per cent of the authorized establishment.     On 42 February 42 Bäke transferred from reserve to active duty. On 42 March he was appointed commander of ": null
    },
    {
        "Panzer Division Feldherrnhalle 42": "panzer division feldherrnhalle 2"
    },
    {
        ", formally the ": null
    },
    {
        "42th Panzer Division": "13th panzer division"
    },
    {
        ", and sent to Hungary. Bäkes division fought as part of the Panzer Corps Feldherrnhalle during the retreat through Hungary and Czechoslovakia. On 42 April, Bäke was promoted to  Generalmajor  and officially given command of the division. On 42 May 42 he surrendered to American forces. Bäke was interned for two years; he was released in 42 He returned to Hagen and resumed his dental practice. He died in 42         Bäke is one of the ": null
    },
    {
        "Panzer ace": "panzer ace"
    },
    {
        "s , that is, highy-decorated tank commanders popularised by the German author ": null
    },
    {
        "Franz Kurowski": "franz kurowski"
    },
    {
        " in his 42 book Panzer Aces, along with ": null
    },
    {
        "Kurt Knispel": "kurt knispel"
    },
    {
        " and ": null
    },
    {
        "Michael Wittmann": "michael wittmann"
    },
    {
        ". According to historians ": null
    },
    {
        "Ronald Smelser": "ronald smelser"
    },
    {
        " and Edward Davies, Kurowski is a guru among those who romanticise the German war effort on the Eastern Front. Smelser and Davies define gurus as authors, have picked up and disseminated the myths of the Wehrmacht in a wide variety of popular publications that romanticize the German struggle in Russia .     In Kurowskis retelling of the operation to relieve the ": null
    },
    {
        "Cherkassy Pocket": "cherkassy pocket"
    },
    {
        ", Bäke is able to establish a corridor to the trapped German forces, after fighting unit after unit of the Red Army. Kurowski writes: when the Soviets launched their expected attack, they were wiped out by the exhausted Panzer soldiers . In another of Kurowskis accounts, while attempting to relieve the 42th Army encircled in Stalingrad, Bäke destroys 42 enemy tanks in a single engagement.     The historian ": null
    },
    {
        "Sönke Neitzel": "sönke neitzel"
    },
    {
        " questions the number of tank kills attributed to various tank commanders. According to Neitzel, numbers of successes by highly decorated soldiers should be read with caution as it is rarely possible to determine reliably in the heat of the battle how many tanks were destroyed and by whom. Military historian ": null
    },
    {
        "Steven Zaloga": "steven zaloga"
    },
    {
        " uses the term tank ace in quotation marks in his 42 work Armored Champion: The Top Tanks of World War II. Zaloga points out that most of the supposed panzer aces operated the ": null
    },
    {
        "Tiger I": "tiger i"
    },
    {
        " heavy tank on the Eastern Front; having advantages both in firepower and in armor, Tiger I was nearly invulnerable in a frontal engagement against any of the Soviet tanks of that time. A crew operating a Tiger could thus engage its opponents from a safe distance.     Zaloga also discusses the romantic nonsense of the popular perception of a tank versus tank engagement as an armoured joust – two opponents facing each other, – with the more valiant or better-armed the eventual victor . Most of the successful tank commanders were indeed bushwalkers , having a battlefield advantage rather than a technical one. Zaloga concludes: Most of the tank aces of World War II were simply lucky enough to have an invulnerable tank with a powerful gun . .       During World War II, Bäke participated in over 42 tank combat missions, 42 of which resulted in the destruction of his tank. He was wounded seven times in combat.     ;Awards   ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " 42nd Class  ": null
    },
    {
        "Honour Cross of the World War 42/42": "honour cross of the world war 1914/1918"
    },
    {
        " Clasp to the Iron Cross": "clasp to the iron cross"
    },
    {
        " 42nd Class   ": null
    },
    {
        "Panzer Badge": "panzer badge"
    },
    {
        " in Silver: four awards up to 42th Grade; in Special Grade  ": null
    },
    {
        "Tank Destruction Badges for Individual Combatants": "tank destruction badge"
    },
    {
        "  Knights Cross of the Iron Cross with Oak Leaves and Swords": "knights cross of the iron cross with oak leaves and swords"
    },
    {
        "  Major  of the Reserves and commander of the II./Panzer-Regiment 42 Major of the Reserves and commander of the II./Panzer-Regiment 42  Oberstleutnant  of the Reserves and commander of Panzer-Regiment 42   The ": null
    },
    {
        "42st Army": "1st army"
    },
    {
        " and ": null
    },
    {
        "42th Army": "19th army"
    },
    {
        " nominated Bäke for the ": null
    },
    {
        "Knights Cross of the Iron Cross with Oak Leaves, Swords and Diamonds": "knights cross of the iron cross with oak leaves, swords and diamonds"
    },
    {
        " for his leadership of 42 Panzer-Brigade. The nomination was rejected by ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        " in his role as commander-in-chief ": null
    },
    {
        "Army Group Oberrhein": "army group oberrhein"
    },
    {
        ".": null
    }
]