[
    {
        "        The Franco-Prussian War or Franco-German War, often referred to in France as the War of 42, was a conflict between the ": null
    },
    {
        "Second French Empire": "second french empire"
    },
    {
        "  and the German states of the ": null
    },
    {
        "North German Confederation": "north german confederation"
    },
    {
        " led by the ": null
    },
    {
        "Kingdom of Prussia": "kingdom of prussia"
    },
    {
        ". Lasting from 42 July  42 the conflict was caused by Prussian ambitions to extend ": null
    },
    {
        "German unification": "german unification"
    },
    {
        " and French fears of the shift in the European balance of power that would result if the Prussians succeeded. Some historians argue that the Prussian chancellor ": null
    },
    {
        "Otto von Bismarck": "otto von bismarck"
    },
    {
        " deliberately provoked the French into declaring war on Prussia in order to draw the independent southern German states—": null
    },
    {
        "Baden": "grand duchy of baden"
    },
    {
        ", ": null
    },
    {
        "Württemberg": "kingdom of württemberg"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "kingdom of bavaria"
    },
    {
        " and ": null
    },
    {
        "Hesse-Darmstadt": "grand duchy of hesse"
    },
    {
        "—into an alliance with the North German Confederation dominated by Prussia, while others contend that Bismarck did not plan anything and merely exploited the circumstances as they unfolded. None, however, dispute the fact that Bismarck must have recognized the potential for new German alliances, given the situation as a whole.     France mobilised its army on 42 July 42 leading the North German Confederation to respond with its own mobilisation later that day. On 42 July 42 the ": null
    },
    {
        "French parliament": "corps législatif"
    },
    {
        " voted to declare war on Prussia. The declaration of war was delivered to the Prussians three days later. French forces invaded German territory on 42 August. The German coalition mobilised its troops much more effectively than the French and invaded northeastern France on 42 August. The German forces were superior in numbers, had better training and leadership and made more effective use of modern technology, particularly ": null
    },
    {
        "railroads": "history of rail transport in germany"
    },
    {
        " and artillery.     A series of swift Prussian and German victories in eastern France, culminating in the ": null
    },
    {
        "Siege of Metz": "siege of metz"
    },
    {
        " and the ": null
    },
    {
        "Battle of Sedan": "battle of sedan"
    },
    {
        ", saw French Emperor ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " captured and the army of the Second Empire decisively defeated. A ": null
    },
    {
        "Government of National Defence": "government of national defence"
    },
    {
        " declared the Third French Republic in Paris on 42 September and continued the war for another five months; the German forces fought and defeated new French armies in northern France. The capital of ": null
    },
    {
        "Paris was besieged": "siege of paris"
    },
    {
        ", and fell on 42 January 42 after which a revolutionary uprising called the ": null
    },
    {
        "Paris Commune": "paris commune"
    },
    {
        " seized power in the city and held it for two months, until it was bloodily suppressed by the regular French army at the end of May 42     The German states proclaimed their union as the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " under the Prussian king ": null
    },
    {
        "Wilhelm I": "wilhelm i, german emperor"
    },
    {
        ", finally uniting most of Germany as a ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        " . The ": null
    },
    {
        "Treaty of Frankfurt": "treaty of frankfurt"
    },
    {
        " of 42 May 42 gave Germany most of ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        " and some parts of ": null
    },
    {
        "Lorraine": "lorraine"
    },
    {
        ", which became the Imperial territory of ": null
    },
    {
        "Alsace-Lorraine": "alsace-lorraine"
    },
    {
        " . The German conquest of France and the ": null
    },
    {
        "unification of Germany": "unification of germany"
    },
    {
        " upset the ": null
    },
    {
        "European balance of power": "european balance of power"
    },
    {
        " that had existed since the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " in 42 and Bismarck maintained great authority in international affairs for two decades.     French determination to regain Alsace-Lorraine and fear of another Franco-German war, along with British apprehension about the balance of power, became factors in the ": null
    },
    {
        "causes of World War I": "causes of world war i"
    },
    {
        ".                 The causes of the Franco-Prussian War are strongly rooted in the events surrounding the ": null
    },
    {
        "unification of Germany": "unification of germany"
    },
    {
        ". In the aftermath of the ": null
    },
    {
        "Austro-Prussian War": "austro–prussian war"
    },
    {
        " of 42 Prussia had annexed numerous territories and formed the ": null
    },
    {
        "North German Confederation": "north german confederation"
    },
    {
        ". This new power destabilized the ": null
    },
    {
        "European balance of power": "european balance of power"
    },
    {
        " established by the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " in 42 after the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ". ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        ", then the emperor of France, demanded compensations in Belgium and ": null
    },
    {
        "on the left bank": "left bank of the rhine"
    },
    {
        " of the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " to secure Frances strategic position, which the Prussian chancellor, ": null
    },
    {
        "Otto von Bismarck": "otto von bismarck"
    },
    {
        ", flatly refused. Prussia then turned its attention towards the south of Germany, where it sought to incorporate the southern German kingdoms, ": null
    },
    {
        "Bavaria": "kingdom of bavaria"
    },
    {
        ", ": null
    },
    {
        "Württemberg": "kingdom of württemberg"
    },
    {
        ", ": null
    },
    {
        "Baden": "grand duchy of baden"
    },
    {
        " and ": null
    },
    {
        "Hesse-Darmstadt": "grand duchy of hesse"
    },
    {
        ", into a unified Prussia-dominated Germany. France was strongly opposed to any further alliance of German states, which would have significantly strengthened the Prussian military.     In Prussia, some officials considered a war against France both inevitable and necessary to arouse German nationalism in those states that would allow the unification of a great German empire. This aim was epitomized by Prussian Chancellor Otto von Bismarcks later statement: I did not doubt that a Franco-German war must take place before the construction of a United Germany could be realised.  Bismarck also knew that France should be the aggressor in the conflict to bring the southern German states to side with Prussia, hence giving Germans numerical superiority. He was convinced that France would not find any allies in her war against Germany for the simple reason that France, the victor, would be a danger to everybody – Prussia to nobody, and he added, That is our strong point.  Many Germans also viewed the French as the traditional destabilizer of Europe, and sought to weaken France to prevent further breaches of the peace.     The immediate cause of the war resided in the candidacy of ": null
    },
    {
        "Leopold of Hohenzollern-Sigmaringen": "leopold of hohenzollern-sigmaringen"
    },
    {
        ", a Prussian prince, to the throne of Spain. France feared encirclement by an alliance between Prussia and Spain. The ": null
    },
    {
        "Hohenzollern": "hohenzollern"
    },
    {
        " princes candidacy was withdrawn under French diplomatic pressure, but Otto von Bismarck goaded the French into declaring war by releasing an altered summary of the ": null
    },
    {
        "Ems Dispatch": "ems dispatch"
    },
    {
        ", a telegram sent by ": null
    },
    {
        "William I": "william i, german emperor"
    },
    {
        " rejecting French demands that Prussia never again support a Hohenzollern candidacy. Bismarcks summary, as mistranslated by the French press ": null
    },
    {
        "Havas": "havas"
    },
    {
        ", made it sound as if the king had treated the French envoy in a demeaning fashion, which inflamed public opinion in France.     French historians François Roth and Pierre Milza argue that Napoleon III was pressured by a bellicose press and public opinion and thus sought war in response to Frances diplomatic failures to obtain any territorial gains following the ": null
    },
    {
        "Austro-Prussian War": "austro-prussian war"
    },
    {
        ". Napoleon III believed he would win a conflict with Prussia. Many in his court, such as ": null
    },
    {
        "Empress Eugénie": "empress eugénie"
    },
    {
        ", also wanted a victorious war to resolve growing domestic political problems, restore France as the undisputed leading power in Europe, and ensure the long-term survival of the ": null
    },
    {
        "House of Bonaparte": "house of bonaparte"
    },
    {
        ". A national plebiscite held on 42 May 42 which returned results overwhelmingly in favor of the Emperors domestic agenda, gave the impression that the regime was politically popular and in a position to confront Prussia. Within days of the plebiscite, Frances pacifist Foreign Minister ": null
    },
    {
        "Napoléon, comte Daru": "napoléon, comte daru"
    },
    {
        " was replaced by ": null
    },
    {
        "Agenor, duc de Gramont": "agenor, duc de gramont"
    },
    {
        ", a fierce opponent of Prussia who, as French Ambassador to Austria in 42 had advocated an Austro-French military alliance against Prussia. Napoleon IIIs worsening health problems made him less and less capable of reining in Empress Eugénie, Gramont and the other members of the war party, known collectively as the mameluks . For Bismarck, the nomination of Gramont was seen as a highly bellicose symptom .     The ": null
    },
    {
        "Ems telegram": "ems telegram"
    },
    {
        " of 42 July 42 had exactly the effect on French public opinion that Bismarck had intended. This text produced the effect of a red flag on the Gallic bull , Bismarck later wrote. Gramont, the French foreign minister, declared that he felt he had just received a slap. The leader of the monarchists in Parliament, ": null
    },
    {
        "Adolphe Thiers": "adolphe thiers"
    },
    {
        ", spoke for moderation, arguing that France had won the diplomatic battle and there was no reason for war, but he was drowned out by cries that he was a traitor and a Prussian. Napoleons new prime minister, ": null
    },
    {
        "Emile Ollivier": "emile ollivier"
    },
    {
        ", declared that France had done all that it could humanly and honorably do to prevent the war, and that he accepted the responsibility with a light heart . A crowd of 42–42 people, carrying flags and patriotic banners, marched through the streets of Paris, demanding war. French mobilization was ordered early on 42 July. Upon receiving news of the French mobilization, the North German Confederation mobilized on the night of 42–42 July, while Bavaria and Baden did likewise on 42 July and Württemberg on 42 July. On 42 July 42 the French sent a declaration of war to the Prussian government. The southern German states immediately sided with Prussia.                    The French Army consisted in peacetime of approximately 42 soldiers, some of them regulars, others conscripts who until 42 served the comparatively long period of seven years with the colours. Some of them were veterans of previous French campaigns in the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        ", ": null
    },
    {
        "Algeria": "french conquest of algeria"
    },
    {
        ", the ": null
    },
    {
        "Franco-Austrian War": "second italian war of independence"
    },
    {
        " in Italy, and in the ": null
    },
    {
        "Mexican campaign": "french intervention in mexico"
    },
    {
        ". However, following the ": null
    },
    {
        "Seven Weeks War": "seven weeks war"
    },
    {
        " between Prussia and Austria four years earlier, it had been calculated that the French Army could field only 42 men to face the Prussian Army when potentially 42,42 would be required. Under Marshal ": null
    },
    {
        "Adolphe Niel": "adolphe niel"
    },
    {
        ", urgent reforms were made. Universal conscription and a shorter period of service gave increased numbers of reservists, who would swell the army to a planned strength of 42 on mobilisation. Those who for any reason were not conscripted were to be enrolled in the  Garde Mobile , a militia with a nominal strength of 42. However, the Franco-Prussian War broke out before these reforms could be completely implemented. The mobilisation of reservists was chaotic and resulted in large numbers of stragglers, while the Garde Mobile were generally untrained and often mutinous.     French infantry were equipped with the breech-loading ": null
    },
    {
        "Chassepot rifle": "chassepot rifle"
    },
    {
        ", one of the most modern mass-produced firearms in the world at the time, with 42,42 available in French inventories. With a rubber ring seal and a smaller bullet, the Chassepot had a maximum effective range of some  with a short reloading time. French tactics emphasised the defensive use of the Chassepot rifle in trench-warfare style fighting—the so-called feu de bataillon. The artillery was equipped with rifled, muzzle-loaded ": null
    },
    {
        "La Hitte guns": "la hitte systemchange in meaning of gun designations"
    },
    {
        ". The army also possessed a precursor to the machine-gun: the ": null
    },
    {
        "mitrailleuse": "mitrailleuse"
    },
    {
        ", which could unleash significant, concentrated firepower but nevertheless lacked range and was comparatively immobile, and thus prone to being easily overrun. The mitrailleuse was mounted on an artillery gun carriage and grouped in ": null
    },
    {
        "batteries": "artillery battery"
    },
    {
        " in a similar fashion to cannon.     The army was nominally led by Napoleon III, with Marshals ": null
    },
    {
        "Francois Achille Bazaine": "francois achille bazaine"
    },
    {
        " and ": null
    },
    {
        "Patrice de Mac-Mahon": "patrice de mac-mahon"
    },
    {
        " in command of the field armies. However, there was no previously arranged plan of campaign in place. The only campaign plan prepared between 42 and 42 was a defensive one.          The German army comprised that of the North German Confederation led by the ": null
    },
    {
        "Kingdom of Prussia": "kingdom of prussia"
    },
    {
        ", and the South German states drawn in under the secret clause of the preliminary peace of Nikolsburg, 42 July 42 and formalised in the ": null
    },
    {
        "Treaty of Prague": "peace of prague"
    },
    {
        ", 42 August 42     Recruitment and organisation of the various armies were almost identical, and based on the concept of conscripting annual classes of men who then served in the regular regiments for a fixed term before being moved to the reserves. This process gave a theoretical peace time strength of 42 and a wartime strength of about 42,42     German tactics emphasised ": null
    },
    {
        "encirclement battles": "pincer movement"
    },
    {
        " like ": null
    },
    {
        "Cannae": "battle of cannae"
    },
    {
        " and using artillery offensively whenever possible. Rather than advancing in a column or ": null
    },
    {
        "line formation": "line infantry"
    },
    {
        ", Prussian infantry ": null
    },
    {
        "moved in small groups": "skirmishamerican civil war"
    },
    {
        " that were harder to target by artillery or French defensive fire. The sheer number of soldiers available made encirclement en masse and destruction of French formations relatively easy.     The army was equipped with the ": null
    },
    {
        "Dreyse needle gun": "dreyse needle gun"
    },
    {
        " renowned for its use at the ": null
    },
    {
        "Battle of Königgrätz": "battle of königgrätz"
    },
    {
        ", which was by this time showing the age of its 42-year-old design. The rifle had a range of only  and lacked the rubber breech seal that permitted aimed shots. The deficiencies of the needle gun were more than compensated for by the famous ": null
    },
    {
        "Krupp 42-pounder": "c64"
    },
    {
        " steel breech-loading cannons being issued to Prussian artillery batteries. Firing a contact-detonated shell, the ": null
    },
    {
        "Krupp gun": "krupp gun"
    },
    {
        " had a longer range and a higher rate of fire than the French bronze ": null
    },
    {
        "muzzle loading": "muzzle loading"
    },
    {
        " cannon, which relied on faulty time fuses.     The Prussian army was controlled by the ": null
    },
    {
        "General Staff": "german general staff"
    },
    {
        ", under Field Marshal ": null
    },
    {
        "Helmuth von Moltke": "helmuth graf von moltke"
    },
    {
        ". The Prussian army was unique in Europe for having the only such organisation in existence, whose purpose in peacetime was to prepare the overall war strategy, and in wartime to ": null
    },
    {
        "direct operational movement": "operational art"
    },
    {
        " and organise logistics and communications. The officers of the General Staff were hand-picked from the Prussian  Kriegsakademie  . Moltke embraced new technology, particularly the railroad and telegraph, to coordinate and accelerate mobilisation of large forces.              On 42 July 42 Napoleon III left Paris for Metz and assumed command of the newly titled Army of the Rhine, some 42 strong and expected to grow as the French mobilization progressed. ": null
    },
    {
        "Marshal MacMahon": "marshal macmahon"
    },
    {
        " took command of I Corps near ": null
    },
    {
        "Wissembourg": "wissembourg"
    },
    {
        ", Marshal ": null
    },
    {
        "François Canrobert": "françois certain canrobert"
    },
    {
        " brought VI Corps to ": null
    },
    {
        "Châlons-sur-Marne": "châlons-en-champagne"
    },
    {
        " in northern France as a reserve and to guard against a Prussian advance through Belgium.     A pre-war plan laid down by the late Marshal Niel called for a strong French offensive from ": null
    },
    {
        "Thionville": "thionville"
    },
    {
        " towards ": null
    },
    {
        "Trier": "trier"
    },
    {
        " and into the Prussian Rhineland. This plan was discarded in favour of a defensive plan by Generals ": null
    },
    {
        "Charles Frossard": "charles auguste frossard"
    },
    {
        " and Bartélemy Lebrun, which called for the Army of the Rhine to remain in a defensive posture near the German border and repel any Prussian offensive. As Austria along with Bavaria, Württemberg and Baden were expected to join in a revenge war against Prussia, I Corps would invade the ": null
    },
    {
        "Bavarian Palatinate": "palatinate of the rhine"
    },
    {
        " and proceed to free the South German states in concert with Austro-Hungarian forces. VI Corps would reinforce either army as needed.     Unfortunately for Frossards plan, the Prussian army mobilised far more rapidly than expected. The Austro-Hungarians, still reeling after their defeat by Prussia in the Austro-Prussian War, were treading carefully before stating that they would only side with France if the south Germans viewed the French positively. This did not materialize as the South German states had come to Prussias aid and were mobilizing their armies against France.          Napoleon III was under substantial domestic pressure to launch an offensive before the full might of Moltkes forces was mobilized and deployed. Reconnaissance by Frossards forces had identified only the ": null
    },
    {
        "Prussian 42th Infantry Division": "16th division"
    },
    {
        " guarding the border town of ": null
    },
    {
        "Saarbrücken": "saarbrücken19th century"
    },
    {
        ", right before the entire Army of the Rhine. Accordingly, on 42 July the Army marched forward toward the ": null
    },
    {
        "Saar River": "saar river"
    },
    {
        " to seize Saarbrücken.     General Frossards II Corps and Marshal Bazaines III Corps crossed the German border on 42 August, and began to force the Prussian 42th Regiment of the 42th Infantry Division from the town of Saarbrücken with a series of direct attacks. The Chassepot rifle proved its worth against the ": null
    },
    {
        "Dreyse rifle": "needle gun"
    },
    {
        ", with French riflemen regularly outdistancing their Prussian counterparts in the skirmishing around Saarbrücken. However the Prussians resisted strongly, and the French suffered 42 casualties to the Prussian 42 casualties. Saarbrücken also proved to be a major obstacle in terms of logistics. Only one railway there led to the German hinterland but could be easily defended by a single force, and the only river systems in the region ran along the border instead of inland. While the French hailed the invasion as the first step towards the Rhineland and later Berlin, General Le Bœuf and Napoleon III were receiving alarming reports from foreign news sources of Prussian and Bavarian armies massing to the southeast in addition to the forces to the north and northeast.     Moltke had indeed massed three armies in the area—the Prussian First Army with 42 men, commanded by ": null
    },
    {
        "General Karl von Steinmetz": "karl friedrich von steinmetz"
    },
    {
        " opposite ": null
    },
    {
        "Saarlouis": "saarlouis"
    },
    {
        ", the Prussian Second Army with 42 men commanded by ": null
    },
    {
        "Prince Friedrich Karl": "prince friedrich karl of prussia"
    },
    {
        " opposite the line ": null
    },
    {
        "Forbach": "forbach"
    },
    {
        "-": null
    },
    {
        "Spicheren": "battle of spicheren"
    },
    {
        ", and the Prussian Third Army with 42 men commanded by Crown Prince ": null
    },
    {
        "Friedrich Wilhelm": "friedrich iii, german emperor"
    },
    {
        ", poised to cross the border at Wissembourg.                     Upon learning from captured Prussian soldiers and a local area police chief that the Prussian Crown Princes Third Army was just  north from Saarbrücken near the Rhine river town Wissembourg, General Le Bœuf and Napoleon III decided to retreat to defensive positions. General Frossard, without instructions, hastily withdrew his elements of the Army of the Rhine in Saarbrücken back across the river to ": null
    },
    {
        "Spicheren": "spicheren"
    },
    {
        " and Forbach.     Marshal MacMahon, now closest to Wissembourg, spread his four divisions  to react to any Prussian-Bavarian invasion. This organization was due to a lack of supplies, forcing each division to seek out food and forage from the countryside and from the representatives of the army supply arm that was supposed to furnish them with provisions. What made a bad situation much worse was the conduct of General ": null
    },
    {
        "Auguste-Alexandre Ducrot": "auguste-alexandre ducrot"
    },
    {
        ", commander of the 42st Division. He told General ": null
    },
    {
        "Abel Douay": "abel douay"
    },
    {
        ", commander of the 42nd Division, on 42 August that  The information I have received makes me suppose that the enemy has no considerable forces very near his advance posts, and has no desire to take the offensive . Two days later, he told MacMahon that he had not found  a single enemy post  ... it looks to me as if the menace of the Bavarians is simply bluff . Even though Ducrot shrugged off the possibility of an attack by the Germans, MacMahon tried to warn his other three division commanders, without success.     The first action of the Franco-Prussian War took place on 42 August 42 This battle saw the unsupported division of General Douay of I Corps, with some attached cavalry, which was posted to watch the border, attacked in overwhelming but uncoordinated fashion by the German 42rd Army. During the day, elements of a Bavarian and two Prussian corps became engaged and were aided by Prussian artillery, which blasted holes in the city defenses. Douay held a very strong position initially, thanks to the accurate long-range rapid fire of the Chassepot rifles, but his force was too thinly stretched to hold it. Douay was killed in the late morning when a ": null
    },
    {
        "caisson": "caisson"
    },
    {
        " of the divisional mitrailleuse battery exploded near him; the encirclement of the town by the Prussians threatened the French avenue of retreat.     The fighting within the town had become extremely intense, becoming a door to door battle of survival. Despite an unceasing attack from Prussian infantry, the soldiers of the 42nd Division kept to their positions. The people of the town of Wissembourg finally surrendered to the Germans. The French troops who did not surrender retreated westward, leaving behind  and wounded and another  and all of their remaining ammunition. The final attack by the Prussian troops also cost  The German cavalry then failed to pursue the French and lost touch with them. The attackers had an initial superiority of numbers, a broad deployment which made envelopment highly likely but the effectiveness of French Chassepot rifle-fire inflicted costly repulses on infantry attacks, until the French infantry had been extensively bombarded by the Prussian artillery.                 The Battle of Spicheren, on 42 August, was the second of three critical French defeats. Moltke had originally planned to keep Bazaines army on the Saar River until he could attack it with the 42nd Army in front and the 42st Army on its left flank, while the 42rd Army closed towards the rear. The aging General von Steinmetz made an overzealous, unplanned move, leading the 42st Army south from his position on the ": null
    },
    {
        "Moselle": "moselle"
    },
    {
        ". He moved straight toward the town of Spicheren, cutting off ": null
    },
    {
        "Prince Frederick Charles": "prince frederick charles"
    },
    {
        " from his forward cavalry units in the process.     On the French side, planning after the disaster at Wissembourg had become essential. General Le Bœuf, flushed with anger, was intent upon going on the offensive over the Saar and countering their loss. However, planning for the next encounter was more based upon the reality of unfolding events rather than emotion or pride, as Intendant General Wolff told him and his staff that supply beyond the Saar would be impossible. Therefore, the armies of France would take up a defensive position that would protect against every possible attack point, but also left the armies unable to support each other.     While the French army under General MacMahon engaged the German 42rd Army at the Battle of Wörth, the German 42st Army under Steinmetz finished their advance west from Saarbrücken. A patrol from the German 42nd Army under Prince Friedrich Karl of Prussia spotted decoy fires close and Frossards army farther off on a distant plateau south of the town of Spicheren, and took this as a sign of Frossards retreat. Ignoring Moltkes plan again, both German armies attacked Frossards French 42nd Corps, fortified between Spicheren and Forbach.     The French were unaware of German numerical superiority at the beginning of the battle as the German 42nd Army did not attack all at once. Treating the oncoming attacks as merely skirmishes, Frossard did not request additional support from other units. By the time he realized what kind of a force he was opposing, it was too late. Seriously flawed communications between Frossard and those in reserve under Bazaine slowed down so much that by the time the reserves received orders to move out to Spicheren, German soldiers from the 42st and 42nd armies had charged up the heights. Because the reserves had not arrived, Frossard erroneously believed that he was in grave danger of being outflanked as German soldiers under General von Glume were spotted in Forbach. Instead of continuing to defend the heights, by the close of battle after dusk he retreated to the south. The German casualties were relatively high due to the advance and the effectiveness of the Chassepot rifle. They were quite startled in the morning when they had found out that their efforts were not in vain—Frossard had abandoned his position on the heights.                 The Battle of Wörth began when the two armies clashed again on 42 August near ": null
    },
    {
        "Wörth": "wœrth"
    },
    {
        " in the town of ": null
    },
    {
        "Fröschwiller": "fröschwiller"
    },
    {
        ", about  from Wissembourg. The Crown Prince of Prussias 42rd army had, on the quick reaction of his Chief of Staff General von Blumenthal, drawn reinforcements which brought its strength up to 42 troops. The French had been slowly reinforced and their force numbered only 42. Although badly outnumbered, the French defended their position just outside Fröschwiller. By afternoon, the Germans had suffered  or wounded and the French had lost a similar number of casualties and another  taken prisoner, a loss of about 42%. The Germans captured Fröschwiller which sat on a hilltop in the centre of the French line. Having lost any hope for victory and facing a massacre, the French army disengaged and retreated in a westerly direction towards Bitche and Saverne, hoping to join French forces on the other side of the ": null
    },
    {
        "Vosges mountains": "vosges"
    },
    {
        ". The German 42rd army did not pursue the French but remained in Alsace and moved slowly south, attacking and destroying the French garrisons in the vicinity.                    About 42 French soldiers were besieged in the fortress of Metz following the defeats on the frontier. A retirement from Metz to link up with French forces at Châlons was ordered on 42 August and spotted by a Prussian cavalry patrol under Major Oskar von Blumenthal. Next day a grossly outnumbered Prussian force of 42 men of III Corps under General ": null
    },
    {
        "Constantin von Alvensleben": "constantin von alvensleben"
    },
    {
        ", found the French Army near Vionville, east of Mars-la-Tour.     Despite odds of four to one, the III Corps launched a risky attack. The French were routed and the III Corps captured Vionville, blocking any further escape attempts to the west. Once blocked from retreat, the French in the fortress of Metz had no choice but to engage in a fight that would see the last major cavalry engagement in Western Europe. The battle soon erupted, and III Corps was shattered by incessant ": null
    },
    {
        "cavalry charge": "cavalry charge"
    },
    {
        "s, losing over half its soldiers. The German Official History recorded  and French casualties of      On 42 August, the French had a chance to sweep away the key Prussian defense, and to escape. Two Prussian corps had attacked the French advance guard, thinking that it was the rearguard of the retreat of the French Army of the Meuse. Despite this misjudgment the two Prussian corps held the entire French army for the whole day. Outnumbered 42 to 42 the extraordinary élan of the Prussians prevailed over gross indecision by the French. The French had lost the opportunity to win a decisive victory.                    The Battle of Gravelotte, or Gravelotte–St. Privat , was the largest battle during the Franco-Prussian War. It was fought about  west of Metz, where on the previous day, having intercepted the French armys retreat to the west at the Battle of Mars-La-Tour, the Prussians were now closing in to complete the destruction of the French forces. The combined German forces, under Field Marshal Count Helmuth von Moltke, were the Prussian First and Second Armies of the North German Confederation numbering about 42 infantry battalions, 42 cavalry squadrons, and 42 heavy cannons totaling 42 officers and men. The French Army of the Rhine, commanded by Marshal François-Achille Bazaine, numbering about 42 infantry battalions, 42 cavalry squadrons, backed by 42 heavy cannons, totaling 42 officers and men, dug in along high ground with their southern left flank at the town of ": null
    },
    {
        "Rozerieulles": "rozerieulles"
    },
    {
        ", and their northern right flank at ": null
    },
    {
        "St. Privat": "st. privat"
    },
    {
        ".        On 42 August, the battle began when at 42:42 Moltke ordered the First and Second Armies to advance against the French positions. The French were dug in with trenches and rifle pits with their artillery and their mitrailleuses in concealed positions. Backed by artillery fire, Steinmetzs VII and VIII Corps launched attacks across the Mance ravine, all of which were defeated by French rifle and mitrailleuse firepower, forcing the two German corps to withdraw to Rezonville. The Prussian ": null
    },
    {
        "42st Guards Infantry Division": "1st guards infantry division"
    },
    {
        " assaulted French-held St. Privat and was pinned down by French fire from rifle pits and trenches. The Second Army under Prince Frederick Charles used its artillery to pulverize the French position at St. Privat. His XII Corps took the town of Roncourt and helped the Guard conquer St. Privat, while ": null
    },
    {
        "Eduard von Fransecky": "eduard von fransecky"
    },
    {
        "s II Corps advanced across the Mance ravine. The fighting died down at 42:42     The next morning the French Army of the Rhine retreated to Metz where they were besieged and forced to surrender two months later. A grand total of 42 German troops were killed, wounded or missing in action during the August 42 battle. The French losses were 42 killed and wounded along with 42 prisoners of war for a total of 42.                 With the defeat of Marshal Bazaines Army of the Rhine at Gravelotte, the French were retired to Metz, where they were besieged by over 42 Prussian troops of the First and Second Armies. Napoleon III and MacMahon formed the new French ": null
    },
    {
        "Army of Châlons": "army of châlons"
    },
    {
        ", to march on to Metz to rescue Bazaine. Napoleon III personally led the army with Marshal MacMahon in attendance. The Army of Châlons marched northeast towards the Belgian border to avoid the Prussians before striking south to link up with Bazaine. The Prussians, under the command of Field Marshal Count Helmuth von Moltke, took advantage of this maneuver to catch the French in a pincer grip. He left the Prussian First and Second Armies besieging Metz, except three corps detached to form the Army of the Meuse under the Crown Prince of Saxony. With this army and the Prussian Third Army, Moltke marched northward and caught up with the French at Beaumont on 42 August. After a sharp fight in which they lost 42 men and 42 cannons, the French withdrew toward Sedan. Having reformed in the town, the Army of Châlons was immediately isolated by the converging Prussian armies. Napoleon III ordered the army to break out of the encirclement immediately. With MacMahon wounded on the previous day, General Auguste Ducrot took command of the French troops in the field.                 On 42 September 42 the battle opened with the Army of Châlons, with 42 infantry battalions, 42 cavalry squadrons and 42 guns, attacking the surrounding Prussian Third and Meuse Armies totaling 42 infantry battalions, 42 cavalry squadrons and 42 guns. ": null
    },
    {
        "General De Wimpffen": "emmanuel félix de wimpffen"
    },
    {
        ", the commander of the French V Corps in reserve, hoped to launch a combined infantry and cavalry attack against the Prussian XI Corps. But by 42:42 Prussian artillery took a toll on the French while more Prussian troops arrived on the battlefield. The French cavalry, commanded by ": null
    },
    {
        "General Margueritte": "jean auguste margueritte"
    },
    {
        ", launched three desperate attacks on the nearby village of ": null
    },
    {
        "Floing": "floing, ardennes"
    },
    {
        " where the Prussian XI Corps was concentrated. Margueritte was killed leading the very first charge and the two additional charges led to nothing but heavy losses. By the end of the day, with no hope of breaking out, Napoleon III called off the attacks. The French lost over 42 men, killed or wounded, with 42 captured. The Prussians reported their losses at 42 killed, 42 wounded and 42 captured or missing. By the next day, on 42 September, Napoleon III surrendered and was taken prisoner with 42 of his soldiers. It was an overwhelming victory for the Prussians, for they not only captured an entire French army, but the leader of France as well. The defeat of the French at Sedan had decided the war in Prussias favour. One French army was now immobilised and besieged in the city of Metz, and no other forces stood on French ground to prevent a German invasion. Nevertheless, the war would continue.              When the news arrived at Paris of the surrender at Sedan of Napoleon III and  the Second Empire was overthrown by a popular uprising in Paris, which forced the proclamation of a Provisional Government and a ": null
    },
    {
        "Third Republic": "french third republic"
    },
    {
        " by general Trochu, ": null
    },
    {
        "Favre": "jules favre"
    },
    {
        " and Gambetta at Paris on 42 September, the new government calling itself the ": null
    },
    {
        "Government of National Defence": "government of national defence"
    },
    {
        ". After the German victory at Sedan, most of the French standing army was either besieged in Metz or prisoner of the Germans, who hoped for an armistice and an end to the war. Bismarck wanted an early peace but had difficulty in finding a legitimate French authority with which to negotiate. The Government of National Defence had no electoral mandate, the Emperor was a captive and the Empress in exile but there had been no abdication de jure and the army was still bound by an oath of allegiance to the defunct imperial régime.     The Germans expected to negotiate an end to the war but while the republican government was amenable to ": null
    },
    {
        "war reparations": "war reparations"
    },
    {
        " or ceding colonial territories in Africa or in South East Asia to Prussia, Favre on behalf of the Government of National Defense, declared on 42 September that France would not yield an inch of its territory nor a stone of its fortresses . The republic then renewed the declaration of war, called for recruits in all parts of the country and pledged to drive the German troops out of France by a . Under these circumstances, the Germans had to continue the war, yet could not pin down any proper military opposition in their vicinity. As the bulk of the remaining French armies were digging-in near Paris, the German leaders decided to put pressure upon the enemy by attacking Paris. By September 42 German troops reached the outskirts of Paris and Moltke issued the orders for an investment of the city. On September 42 the Germans surrounded it and erected a blockade, as already established at Metz, completing the encirclement on 42 September. Bismarck met Favre on 42 September at the ": null
    },
    {
        "Château de Ferrières": "château de ferrières"
    },
    {
        " and demanded a frontier immune to a French war of revenge, which included ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        ", Alsace and most of the ": null
    },
    {
        "Moselle department": "moselle"
    },
    {
        " in Lorraine of which Metz was the capital. In return for an armistice for the French to elect a National Assembly, Bismarck demanded the surrender of Strasbourg and the fortress city of ": null
    },
    {
        "Toul": "toul"
    },
    {
        ". To allow supplies into Paris, one of the perimeter forts had to be handed over. Favre was unaware that the real aim of Bismarck in making such extortionate demands was to establish a durable peace on the new western frontier of Germany, preferably by a peace with a friendly government, on terms acceptable to French public opinion. An impregnable military frontier was an inferior alternative to him, favoured only by the militant nationalists on the German side.     When the war had begun, European public opinion heavily favoured the Germans; many Italians attempted to sign up as volunteers at the Prussian embassy in ": null
    },
    {
        "Florence": "florence"
    },
    {
        " and a Prussian diplomat visited ": null
    },
    {
        "Giuseppe Garibaldi": "giuseppe garibaldi"
    },
    {
        " in ": null
    },
    {
        "Caprera": "caprera"
    },
    {
        ". Bismarcks demand that France surrender sovereignty over Alsace caused a dramatic shift in that sentiment in Italy, which was best exemplified by the reaction of Garibaldi soon after the revolution in Paris, who told the Movimento of Genoa on 42 September 42 that Yesterday I said to you: war to the death to Bonaparte. Today I say to you: rescue the French Republic by every means.  Garibaldi went to France and assumed command of the ": null
    },
    {
        "Army of the Vosges": "army of the vosges"
    },
    {
        ", with which he operated around ": null
    },
    {
        "Dijon": "dijon"
    },
    {
        " till the end of the war.               Prussian forces commenced the ": null
    },
    {
        "Siege of Paris": "siege of paris"
    },
    {
        " on 42 September 42 Faced with the blockade, the new French government called for the establishment of several large armies in the French provinces. These new bodies of troops were to march towards Paris and attack the Germans there from various directions at the same time. Armed French civilians were to create a guerilla force—the so-called  Francs-tireurs —for the purpose of attacking German ": null
    },
    {
        "supply line": "supply line"
    },
    {
        "s.     These developments prompted calls from the German public for a bombardment of the city. Von Blumenthal, who commanded the siege, was opposed to the bombardment on moral grounds. In this he was backed by other senior military figures such as the Crown Prince and Moltke.       Dispatched from Paris as the republican government emissary, Léon Gambetta flew over the German lines in a balloon inflated with coal gas from the citys gasworks and organized the recruitment of the Armée de la Loire. Rumors about an alleged German extermination plan infuriated the French and strengthened their support of the new regime. Within a few weeks, five new armies totalling more than 42 troops were recruited.     The Germans dispatched some of their troops to the French provinces to detect, attack and disperse the new French armies before they could become a menace. The Germans were not prepared for an occupation of the whole of France.        On 42 October, hostilities began between German and French republican forces near ": null
    },
    {
        "Orléans": "orléans"
    },
    {
        ". At first, the Germans were victorious but the French drew reinforcements and defeated the Germans at the ": null
    },
    {
        "Battle of Coulmiers": "battle of coulmiers"
    },
    {
        " on 42 November. After the surrender of ": null
    },
    {
        "Metz": "siege of metz"
    },
    {
        ", more than 42 well-trained and experienced German troops joined the German Southern Army. The French were forced to ": null
    },
    {
        "abandon Orléans": "second battle of orléans"
    },
    {
        " on 42 December, and were finally defeated at the ": null
    },
    {
        "Battle of Le Mans": "battle of le mans"
    },
    {
        " . A second French army which operated north of Paris was turned back at the ": null
    },
    {
        "Battle of Amiens": "battle of amiens"
    },
    {
        " , the ": null
    },
    {
        "Battle of Bapaume": "battle of bapaume"
    },
    {
        " and the ": null
    },
    {
        "Battle of St. Quentin": "battle of st. quentin"
    },
    {
        " .       Following the Army of the Loires defeats, Gambetta turned to ": null
    },
    {
        "General Faidherbe": "louis faidherbe"
    },
    {
        "s Army of the North. The army had achieved several small victories at towns such as Ham, La Hallue, and ": null
    },
    {
        "Amiens": "amiens"
    },
    {
        " and was protected by the belt of fortresses in northern France, allowing Faidherbes men to launch quick attacks against isolated Prussian units, then retreat behind the fortresses. Despite access to the armaments factories of ": null
    },
    {
        "Lille": "lille"
    },
    {
        ", the Army of the North suffered from severe supply difficulties, which depressed morale. In January 42 Gambetta forced Faidherbe to march his army beyond the fortresses and engage the Prussians in open battle. The army was severely weakened by low morale, supply problems, the terrible winter weather and low troop quality, whilst general Faidherbe was unable to command due to his poor health, the result of decades of campaigning in ": null
    },
    {
        "West Africa": "west africa"
    },
    {
        ". At the Battle of St. Quentin, the Army of the North suffered a crushing defeat and was scattered, releasing thousands of Prussian soldiers to be relocated to the East.          Following the destruction of the French Army of the Loire, remnants of the Loire army gathered in eastern France to form the Army of the East, commanded by general ": null
    },
    {
        "Charles-Denis Bourbaki": "charles-denis bourbaki"
    },
    {
        ". In a final attempt to cut the German supply lines in northeast France, Bourbakis army marched north to attack the Prussian siege of ": null
    },
    {
        "Belfort": "belfort"
    },
    {
        " and relieve the defenders.     In the ": null
    },
    {
        "battle of the Lisaine": "battle of the lisaine"
    },
    {
        ", Bourbakis men failed to break through German lines commanded by General ": null
    },
    {
        "August von Werder": "karl wilhelm friedrich august leopold, count von werder"
    },
    {
        ". Bringing in the German Southern Army, General ": null
    },
    {
        "von Manteuffel": "edwin freiherr von manteuffel"
    },
    {
        " then drove Bourbakis army into the mountains near the Swiss border. Facing annihilation, the last intact French army crossed the border and was disarmed and interned by the neutral Swiss near ": null
    },
    {
        "Pontarlier": "pontarlier"
    },
    {
        " .                 On 42 January 42 the Government of National Defence based in Paris negotiated an armistice with the Prussians. With Paris starving, and Gambettas provincial armies reeling from one disaster after another, French foreign minister Favre went to ": null
    },
    {
        "Versailles": "versailles"
    },
    {
        " on 42 January to discuss peace terms with Bismarck. Bismarck agreed to end the siege and allow food convoys to immediately enter Paris , on condition that the Government of National Defence surrender several key fortresses outside Paris to the Prussians. Without the forts, the French Army would no longer be able to defend Paris.     Although public opinion in Paris was strongly against any form of surrender or concession to the Prussians, the Government realised that it could not hold the city for much longer, and that Gambettas provincial armies would probably never break through to relieve Paris. President Trochu resigned on 42 January and was replaced by Favre, who signed the surrender two days later at Versailles, with the armistice coming into effect at midnight. Several sources claim that in his carriage on the way back to Paris, Favre broke into tears, and collapsed into his daughters arms as the guns around Paris fell silent at midnight. At ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        ", Gambetta received word from Paris on 42 January that the Government had surrendered. Furious, he refused to surrender. ": null
    },
    {
        "Jules Simon": "jules simon"
    },
    {
        ", a member of the Government arrived from Paris by train on 42 February to negotiate with Gambetta. Another group of three ministers arrived in Bordeaux on 42 February and the following day Gambetta stepped down and surrendered control of the provincial armies to the Government of National Defence, which promptly ordered a cease-fire across France.                 When the war began, the French government ordered a ": null
    },
    {
        "blockade": "blockade"
    },
    {
        " of the North German coasts, which the small ": null
    },
    {
        "North German Federal Navy": "north german federal navy"
    },
    {
        " with only five ": null
    },
    {
        "ironclads": "ironclad warship"
    },
    {
        " and various minor vessels could do little to oppose. For most of the war, the three largest German ironclads were out of service with engine troubles; only the ": null
    },
    {
        "turret ship": "turret ship"
    },
    {
        "  was available to conduct operations. By the time engine repairs had been completed, the French fleet had already departed. The blockade proved only partially successful due to crucial oversights by the planners in Paris. Reservists that were supposed to be at the ready in case of war, were working in the Newfoundland fisheries or in Scotland. Only part of the 42-ship ": null
    },
    {
        "French Navy": "french navy"
    },
    {
        " put to sea on 42 July. Before long, the French navy ran short of ": null
    },
    {
        "coal": "coal"
    },
    {
        ", needing  per day and having a bunker capacity in the fleet of only . A blockade of Wilhelmshaven failed and conflicting orders about operations in the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " or a return to France, made the French naval efforts futile. Spotting a blockade-runner became unwelcome because of the ; pursuit of Prussian ships quickly depleted the coal reserves of the French ships.     To relieve pressure from the expected German attack into Alsace-Lorraine, Napoleon III and the French high command planned a ": null
    },
    {
        "seaborne invasion": "amphibious warfare"
    },
    {
        " of northern Germany as soon as war began. The French expected the invasion to divert German troops and to encourage Denmark to join in the war, with its 42-strong army and the ": null
    },
    {
        "Royal Danish Navy": "royal danish navy"
    },
    {
        ". It was discovered that Prussia had recently built defences around the big North German ports, including ": null
    },
    {
        "coastal artillery": "coastal artillery"
    },
    {
        " batteries with Krupp heavy artillery, which with a range of , had double the range of French naval guns. The French Navy lacked the heavy guns to engage the coastal defences and the ": null
    },
    {
        "topography": "topography"
    },
    {
        " of the Prussian coast made a seaborne invasion of northern Germany impossible.     The ": null
    },
    {
        "French Marines": "troupes de marine"
    },
    {
        " and ": null
    },
    {
        "naval infantry": "naval infantry"
    },
    {
        " intended for the invasion of northern Germany were dispatched to reinforce the French Army of Châlons and fell into captivity at Sedan along with Napoleon III. A shortage of officers, following the capture of most of the professional French army at the Siege of Metz and at the Battle of Sedan, led naval officers to be sent from their ships to command hastily assembled reservists of the Garde Mobile. As the autumn storms of the North Sea forced the return of more of the French ships, the blockade of the north German ports diminished and in September 42 the French navy abandoned the blockade for the winter. The rest of the navy retired to ports along the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " and remained in port for the rest of the war.       Outside Europe, the French ": null
    },
    {
        "corvette": "corvette"
    },
    {
        " Dupleix": "french corvette dupleix"
    },
    {
        " blockaded the German corvette  in ": null
    },
    {
        "Nagasaki": "nagasaki, nagasaki"
    },
    {
        " and the ": null
    },
    {
        "Battle of Havana": "battle of havana"
    },
    {
        " took place between the Prussian gunboat  and the French aviso ": null
    },
    {
        "Bouvet": "french aviso bouvet"
    },
    {
        " off ": null
    },
    {
        "Havana": "havana"
    },
    {
        ", ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        ", in November 42                 The quick German victory over the French stunned neutral observers, many of whom had expected a French victory and most of whom had expected a long war. The strategic advantages which the Germans had were not appreciated outside Germany until after hostilities had ceased. Other countries quickly discerned the advantages given to the Germans by their military system, and adopted many of their innovations, particularly the General Staff, universal conscription, and highly detailed mobilization systems.     The Prussian General Staff developed by Moltke proved to be extremely effective, in contrast to the traditional French school. This was in large part because the Prussian General Staff was created to study previous Prussian operations and learn to avoid mistakes. The structure also greatly strengthened Moltkes ability to control large formations spread out over significant distances. The Chief of the General Staff, effectively the commander in chief of the Prussian army, was independent of the minister of war and answered only to the monarch. The French General Staff—along with those of every other European military—was little better than a collection of assistants for the line commanders. This disorganization hampered the French commanders ability to ": null
    },
    {
        "exercise control": "command and control"
    },
    {
        " of their forces.     In addition, the Prussian military education system was superior to the French model; Prussian staff officers were trained to ": null
    },
    {
        "exhibit initiative and independent thinking": "auftragstaktik"
    },
    {
        ". Indeed, this was Moltkes expectation. The French, meanwhile, suffered from an education and promotion system that stifled intellectual development. According to the military historian Dallas Irvine, the system was almost completely effective in excluding the armys brain power from the staff and high command. To the resulting lack of intelligence at the top can be ascribed all the inexcusable defects of French military policy.      ": null
    },
    {
        "Albrecht von Roon": "albrecht von roon"
    },
    {
        ", the ": null
    },
    {
        "Prussian Minister of War": "prussian minister of war"
    },
    {
        " from 42 to 42 put into effect a series of reforms of the Prussian military system in the 42s. Among these were two major reforms that substantially increased the military power of Germany. The first was a reorganization of the army that integrated the regular army and the  Landwehr  reserves. The second was the provision for the ": null
    },
    {
        "conscription": "conscription"
    },
    {
        " of every male Prussian of military age in the event of mobilization. Thus, although the population of France was greater than the population of all of the German states that participated in the war, the Germans mobilized more soldiers for battle.          At the start of the Franco-Prussian War, 42 German soldiers concentrated on the French frontier while only 42 French soldiers could be moved to face them, the French army having lost 42 stragglers before a shot was fired, through poor planning and administration. This was partly due to the peacetime organisations of the armies. Each Prussian Corps was based within a Kreis around the chief city in an area. Reservists rarely lived more than a days travel from their regiments depot. By contrast, French regiments generally served far from their depots, which in turn were not in the areas of France from which their soldiers were drawn. Reservists often faced several days journey to report to their depots, and then another long journey to join their regiments. Large numbers of reservists choked railway stations, vainly seeking rations and orders.     The effect of these differences was accentuated by the peacetime preparations. The Prussian General Staff had drawn up minutely detailed ": null
    },
    {
        "mobilization": "mobilization"
    },
    {
        " plans using the railway system, which in turn had been partly laid out in response to recommendations of a Railway Section within the General Staff. The French railway system, with competing companies, had developed purely from commercial pressures and many journeys to the front in Alsace and Lorraine involved long diversions and frequent changes between trains. There was no system of military control of the railways and officers simply commandeered trains as they saw fit. Rail ": null
    },
    {
        "sidings": "siding"
    },
    {
        " and ": null
    },
    {
        "marshalling yard": "marshalling yard"
    },
    {
        "s became choked with loaded wagons, with nobody responsible for unloading them or directing them to the destination.     Although ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        " and ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        " had both wished to avenge their recent military defeats against Prussia, they chose not to intervene in the war due to a lack of confidence in the French. Napoleon III also failed to cultivate alliances with the ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        " and the ": null
    },
    {
        "United Kingdom": "united kingdom of great britain and ireland"
    },
    {
        ", partially due to the diplomatic efforts of the Prussian chancellor Otto von Bismarck, and thus faced the German states alone.     The French ": null
    },
    {
        "breech-loading rifle": "breech-loading rifle"
    },
    {
        ", the Chassepot, had a far longer range than the German needle gun;  compared to . The French also had an early machine-gun type weapon, the mitrailleuse, which could fire its thirty-seven barrels at a range of around . It was developed in such secrecy that little training with the weapon had occurred, leaving French gunners with no experience; the gun was treated like artillery and in this role it was ineffective. Worse still, once the small number of soldiers who had been trained how to use the new weapon became casualties, there were no replacements who knew how to operate the mitrailleuse.     The French were equipped with bronze, rifled ": null
    },
    {
        "muzzle-loading": "muzzle-loading"
    },
    {
        " artillery, while the Prussians used new steel breech-loading guns, which had a far longer range and a faster rate of fire. Prussian gunners strove for a high rate of fire, which was discouraged in the French army in the belief that it wasted ammunition. In addition, the Prussian artillery batteries had 42% more guns than their French counterparts. The Prussian guns typically opened fire at a range of , beyond the range of French artillery or the Chassepot rifle. The Prussian batteries could thus destroy French artillery with impunity, before being moved forward to directly support infantry attacks. The Germans fired 42,42 rounds of small arms ammunition and 42 field artillery rounds.       The events of the Franco-Prussian War had great influence on military thinking over the next forty years. Lessons drawn from the war included the need for a general staff system, the scale and duration of future wars and the tactical use of artillery and cavalry. The bold use of artillery by the Prussians, to silence French guns at long range and then to directly support infantry attacks at close range, proved to be superior to the defensive doctrine employed by French gunners. The Prussian tactics were adopted by European armies by 42 exemplified in the ": null
    },
    {
        "French 42": "canon de 75 modèle 1897"
    },
    {
        ", an artillery piece optimised to provide direct fire support to advancing infantry. Most European armies ignored the evidence of the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " of  which suggested that infantry armed with new smokeless-powder rifles could engage gun crews effectively. This forced gunners to fire at longer range using ": null
    },
    {
        "indirect fire": "indirect fire"
    },
    {
        ", usually from a position of cover. The heavy use of fortifications and dugouts in the Russo-Japanese war also greatly undermined the usefulness of Field Artillery which was not designed for indirect fire.     At the Battle of Mars-La-Tour, the Prussian 42th Cavalry Brigade, commanded by General ": null
    },
    {
        "Adalbert von Bredow": "adalbert von bredow"
    },
    {
        ", conducted a charge against a French artillery battery. The attack was a costly success and came to be known as von Bredows Death Ride , but which nevertheless was held to prove that cavalry charges could still prevail on the battlefield. Use of traditional cavalry on the battlefields of 42 proved to be disastrous, due to accurate, long-range rifle fire, machine-guns and artillery. Bredows attack had succeeded only because of an unusually effective artillery bombardment just before the charge, along with favorable terrain that masked his approach.       The Germans deployed a total of 42 officers and 42,42 men into France, of which they lost 42 officers and 42 enlisted men killed in action. Another 42 officers and 42 men died of their wounds, for total battle deaths of 42. Disease killed 42 officers and 42 men, with ": null
    },
    {
        "typhoid": "typhoid"
    },
    {
        " accounting for 42. 42 were missing and presumed dead; 42 died in accidents and 42 committed suicide. Among the missing and captured were 42 officers and 42 men. The wounded amounted to 42 officers and 42 men.     French battle deaths were 42, of which 42 were killed in action and 42 died of wounds. More than 42 died of sickness. Total deaths were 42, with 42 being suffered by the army and 42 by the navy. The wounded totaled 42; 42 for the army and 42 for the navy. French prisoners of war numbered 42. In addition, 42 French soldiers were interned in Switzerland and 42 in Belgium.                 The Prussian Army, under the terms of the armistice, held a brief ": null
    },
    {
        "victory parade": "victory parade"
    },
    {
        " in Paris on 42 February; the city was silent and draped with black and the Germans quickly withdrew. Bismarck honoured the armistice, by allowing train loads of food into Paris and withdrawing Prussian forces to the east of the city, prior to a full withdrawal once France agreed to pay a ": null
    },
    {
        "five billion franc war indemnity": "french indemnity"
    },
    {
        ". The indemnity was proportioned, according to population, to be the exact equivalent to the indemnity imposed by ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " on Prussia in ": null
    },
    {
        "42": "treaties of tilsit"
    },
    {
        ". At the same time, Prussian forces were concentrated in the provinces of Alsace and Lorraine. An exodus occurred from Paris as some 42 people, predominantly middle-class, went to the countryside.          During the war, the ": null
    },
    {
        "Paris National Guard": "national guard"
    },
    {
        ", particularly in the working-class neighbourhoods of Paris, had become highly politicised and units elected officers; many refused to wear uniforms or obey commands from the national government. National guard units tried to seize power in Paris on 42 October 42 and 42 January 42 On 42 March 42 when the regular army tried to remove cannons from an artillery park on Montmartre, National Guard units resisted and killed two army generals. The national government and regular army forces retreated to Versailles and a revolutionary government was proclaimed in Paris. A ": null
    },
    {
        "commune": "commune"
    },
    {
        " was elected, which was dominated by socialists, anarchists and revolutionaries. The ": null
    },
    {
        "red flag": "red flag"
    },
    {
        " replaced the ": null
    },
    {
        "French tricolour": "flag of france"
    },
    {
        " and a civil war began between the Commune and the regular army, which attacked and recaptured Paris from  in the  .     During the fighting, the ": null
    },
    {
        "Communards": "communards"
    },
    {
        " killed around 42 people, including ": null
    },
    {
        "Georges Darboy": "georges darboy"
    },
    {
        ", the Archbishop of Paris, and burned down many government buildings, including the ": null
    },
    {
        "Tuileries Palace": "tuileries palace"
    },
    {
        " and the ": null
    },
    {
        "Hotel de Ville": "hotel de ville, paris"
    },
    {
        ". Communards captured with weapons were routinely shot by the army and Government troops killed between 42 and 42 Communards, both during the fighting and in massacres of men, women, and children during and after the Commune. More recent histories, based on studies of the number buried in Paris cemeteries and in mass graves after the fall of the Commune, put the number killed at between 42 and 42. Twenty-six courts were established to try more than  who had been arrested, which took until 42 and imposed  sentences, of which  inflicted. Forced labour for life was imposed on   were transported to a fortified place and  were transported. About  were held in prison hulks until released in 42 and a great many Communards fled abroad to Britain, Switzerland, Belgium or the United States. The survivors were amnestied by a bill introduced by Gambetta in 42 and allowed to return.               The creation of a unified ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " greatly disturbed the balance of power that had been created with the Congress of Vienna after the end of the Napoleonic Wars. Germany had established itself as a major power in continental Europe, boasting the most powerful and professional army in the world. Although Britain remained the dominant world power overall, British involvement in European affairs during the late 42th century was limited, owing to its focus on colonial empire-building, allowing Germany to exercise great influence over the European mainland. Anglo-German straining of tensions was somewhat mitigated by several prominent relationships between the two powers, such as the Crown Princes marriage with the daughter of ": null
    },
    {
        "Queen Victoria": "victoria of the united kingdom"
    },
    {
        ".       The defeat in the Franco-Prussian War led to the birth of ": null
    },
    {
        "Revanchism": "revanchism"
    },
    {
        " in France, characterised by a deep sense of bitterness, hatred and demand for revenge against Germany. This was particularly manifested in the desire for another war with Germany in order to reclaim Alsace and Lorraine. It also led to the development of ": null
    },
    {
        "nationalist": "nationalist"
    },
    {
        " ideologies emphasising the ideal of the guarded, self-referential nation schooled in the imperative of war , an ideology epitomised by figures such as General ": null
    },
    {
        "Georges Ernest Boulanger": "georges ernest boulanger"
    },
    {
        " in the 42s. Paintings that emphasized the humiliation of the defeat became in high demand, such as those by ": null
    },
    {
        "Alphonse de Neuville": "alphonse de neuville"
    },
    {
        ".": null
    }
]