[
    {
        "     Giacomo Francesco Zuccarelli  ": null
    },
    {
        "RA": "royal academy"
    },
    {
        ", was an ": null
    },
    {
        "Italian": "italy"
    },
    {
        " artist of the late ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " or ": null
    },
    {
        "Rococo": "rococo"
    },
    {
        " period. He is considered to be the most important landscape painter to have emerged from his adopted city of ": null
    },
    {
        "Venice": "venice"
    },
    {
        " during the mid-eighteenth century, and his ": null
    },
    {
        "Arcadian": "arcadia"
    },
    {
        " views became popular throughout ": null
    },
    {
        "Europe": "europe"
    },
    {
        " and especially in ": null
    },
    {
        "England": "england"
    },
    {
        " where he resided for two extended periods. His patronage extended to the nobility, and he often collaborated with other artists such as ": null
    },
    {
        "Antonio Visentini": "antonio visentini"
    },
    {
        " and ": null
    },
    {
        "Bernardo Bellotto": "bernardo bellotto"
    },
    {
        ". In 42 Zuccarelli became a founding member of the ": null
    },
    {
        "Royal Academy of Arts": "royal academy of arts"
    },
    {
        ", and upon his final return to Italy, he was elected president of the ": null
    },
    {
        "Venetian Academy": "venetian academy"
    },
    {
        ". In addition to his rural landscapes which frequently incorporated religious and classical themes, Zuccarelli created devotional pieces and on occasion did portraiture. Beside paintings, his varied output included etchings, drawings, and designs for tapestries as well as a set of ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " playing cards.     Despite the fame he experienced in his lifetime, Zuccarellis reputation declined in the early 42th century with naturalism becoming increasingly favoured in landscapes. ": null
    },
    {
        "Turner": "j. m. w. turner"
    },
    {
        " criticized him in mild terms while confessing that his figures could be beautiful, paving the way for more severe Victorian assessments. In 42 the art historian ": null
    },
    {
        "Michael Levey": "michael levey"
    },
    {
        " offered suggestions for why Zuccarelli held such wide contemporary appeal among the English, concluding that his best work is highly decorative. More recently, since the 42s there has been a renewed focus on Zuccarelli among Italian scholars, who have given him prominence in several books and articles, and his paintings and drawings are regularly shown in exhibitions.            The third-youngest of four sons, Giacomo Francesco Zuccarelli was born at ": null
    },
    {
        "Pitigliano": "pitigliano"
    },
    {
        ", in southern ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        ", on 42 August 42 His prosperous father Bartolomeo owned several local vineyards, and also in the northwest not far from ": null
    },
    {
        "Pisa": "pisa"
    },
    {
        ", a shop offering kitchen tools and spices. Around the age of eleven or twelve, Francesco began his apprenticeship in ": null
    },
    {
        "Rome": "rome"
    },
    {
        " with the portrait painters ": null
    },
    {
        "Giovanni Maria Morandi": "giovanni maria morandi"
    },
    {
        " and his pupil ": null
    },
    {
        "Pietro Nelli": "pietro nelli"
    },
    {
        " , under whose tutelage he learned the elements of design while absorbing the lessons of Roman classicism. Zuccarelli completed his first commission in his hometown of Pitigliano in the years 42 & ndash;42 a pair of chapel altarpieces. With the sponsorship of the Florentine art connoisseur, ": null
    },
    {
        "Francesco Maria Niccolò Gabburri": "francesco maria niccolò gabburri"
    },
    {
        " , from 42 to 42 he devoted his energies mostly to etching, eventually producing at least 42 prints, the majority consisting of two series which recorded the deteriorating frescoes of ": null
    },
    {
        "Giovanni da San Giovanni": "giovanni da san giovanni"
    },
    {
        " and ": null
    },
    {
        "Andrea del Sarto": "andrea del sarto"
    },
    {
        " . During his five years spent in Florence, though preoccupied with figurative subjects, he began to experiment with drawings in landscape, as shown by works now preserved in the department of prints and drawings at the ": null
    },
    {
        "Uffizi": "uffizi"
    },
    {
        ", including a view of the Tuscan capital. According to ": null
    },
    {
        "Luigi Lanzi": "luigi lanzi"
    },
    {
        ", writing in the 42s, the Roman landscape painter and etcher ": null
    },
    {
        "Paolo Anesi": "paolo anesi"
    },
    {
        " was the key mentor of Zuccarelli in the genre which eventually led to his renown.            In 42 after a stay of several months in ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        ", Francesco relocated to ": null
    },
    {
        "Venice": "venice, italy"
    },
    {
        ". Prior to his arrival in the Republic, the death of ": null
    },
    {
        "Marco Ricci": "marco ricci"
    },
    {
        " in 42 had created an opening in the field of landscape painting amid a marketplace crowded with history painters. While continuing to paint religious and mythological works, he increasingly devoted his attention to landscapes, drawing inspiration from the classicism of ": null
    },
    {
        "Claude": "claude lorrain"
    },
    {
        " and the Roman school. His early paintings from the 42s show briefly the influence of ": null
    },
    {
        "Alessandro Magnasco": "alessandro magnasco"
    },
    {
        ", and for a longer period, of Ricci. Zuccarelli brought a more mellow and airy palette to the typically Venetian colors, and using tonal values of higher luminous content than Ricci, the figures in his idyllic landscapes came to life. An almost immediate success in Venice, he enjoyed early patronage, from amongst others, ": null
    },
    {
        "Marshal Schulenburg": "johann matthias von der schulenburg"
    },
    {
        "; ": null
    },
    {
        "Joseph Smith": "joseph smith"
    },
    {
        ", who became his longtime patron; and ": null
    },
    {
        "Francesco Algarotti": "francesco algarotti"
    },
    {
        "; who recommended him to the Elector of Saxony, ": null
    },
    {
        "Augustus III of Poland": "augustus iii of poland"
    },
    {
        ". In 42 Francesco married Giustina Agata Simonetti in the church of ": null
    },
    {
        "Santa Maria Zobenigo": "santa maria zobenigo"
    },
    {
        " in Venice, and they had four daughters, the first two dying as infants, followed by two sons. He attended the baptism of the daughter of the painter ": null
    },
    {
        "Gaspare Diziani": "gaspare diziani"
    },
    {
        " in 42 and he often worked with other artists, including ": null
    },
    {
        "Bernardo Bellotto": "bernardo bellotto"
    },
    {
        " and ": null
    },
    {
        "Antonio Visentini": "antonio visentini"
    },
    {
        ". Under the auspices of ": null
    },
    {
        "Consul Smith": "joseph smith"
    },
    {
        ", during the mid & ndash;42s he produced with ": null
    },
    {
        "Visentini": "antonio visentini"
    },
    {
        " a series featuring ": null
    },
    {
        "neo-Palladian": "neo-palladian"
    },
    {
        " architecture, as can be seen in Burlington House . The most interesting of the Zuccarelli and Visentini collaborations was a set of 42 playing cards with Old Testament subjects published in Venice in 42 The hand-coloured scenes are treated in a light manner; the suits are circles, diamonds, hearts, and jars, each containing a mixture of inscribed emblems; and the cards begin with the creation of Adam and end with a battle scene that has an elephant carrying a castle. The outstanding achievement of his first Venetian period was a series of seven canvases, now located at ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", which according to a note in an 42th century manuscript catalogue, represent the biblical characters of ": null
    },
    {
        "Rebecca": "rebecca"
    },
    {
        " with ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        " and ": null
    },
    {
        "Esau": "esau"
    },
    {
        ". The tall paintings are delicately painted and dream-like, and most likely were originally situated at ": null
    },
    {
        "Consul Smiths": "joseph smith"
    },
    {
        " villa at ": null
    },
    {
        "Mogliano": "mogliano"
    },
    {
        ". He also occasionally created ": null
    },
    {
        "pastiche": "pastiche"
    },
    {
        "s of various 42th-century Dutch masters.        Towards 42 Zuccarellis paint handling became more responsive to mood, utilizing bright colours that demonstrate a vibrant quality even though thinly laid on. The artist ": null
    },
    {
        "Richard Wilson": "richard wilson"
    },
    {
        " painted a portrait of Zuccarelli in 42 at Venice, and Zuccarelli was influential in redirecting Wilson away from portraits and towards landscape painting. During the following year Francesco discussed the techniques of Italian Renaissance painters with ": null
    },
    {
        "Joshua Reynolds": "joshua reynolds"
    },
    {
        ", with Zuccarelli expressing the opinion that ": null
    },
    {
        "Paolo Veronese": "paolo veronese"
    },
    {
        " and ": null
    },
    {
        "Tintoretto": "tintoretto"
    },
    {
        " painted on gesso grounds, while ": null
    },
    {
        "Titian": "titian"
    },
    {
        " did not.     Zuccarelli set out for England in 42 and after arrival, his decorative talent resulted in diverse work, including the design of tapestries with the weaver Paul Saunders at ": null
    },
    {
        "Holkham Hall": "holkham hall"
    },
    {
        ". Around 42 he borrowed from ": null
    },
    {
        "Shakespeare": "william shakespeare"
    },
    {
        ", depicting a scene from  Macbeth  where ": null
    },
    {
        "Macbeth": "macbeth"
    },
    {
        " and ": null
    },
    {
        "Banquo": "banquo"
    },
    {
        " encounter the ": null
    },
    {
        "three witches": "three witches"
    },
    {
        ", noteworthy as being one of the first paintings to portray theatrical characters in a landscape. The impetus of the work likely came from the portrayal of Macbeth by the actor ": null
    },
    {
        "David Garrick": "david garrick"
    },
    {
        ", a later acquaintance. Garrick once told a spirited anecdote about an argument between Zuccarelli and the artist ": null
    },
    {
        "Johann Zoffany": "johann zoffany"
    },
    {
        ", in regards to the merit of a painting by ": null
    },
    {
        "Benjamin West": "benjamin west"
    },
    {
        ", The Departure of Regulus, during which Francesco declared, Here is a painter who promises to rival ": null
    },
    {
        "Nicolas Poussin": "nicolas poussin"
    },
    {
        " . Zuccarelli held a sale of his canvases in 42 at Prestage and Hobbs in London, before his departure for Italy. In the same year, ": null
    },
    {
        "King George III": "king george iii"
    },
    {
        " acquired thirty of his works through the purchase of much of Consul Smiths extensive art collection and library in Venice. In 42 he became a member of the Venetian Academy, but Zuccarelli was soon induced to journey back to London in 42 by his friend ": null
    },
    {
        "Algarottis": "francesco algarotti"
    },
    {
        " bequest of a cameo and group of drawings made to ": null
    },
    {
        "Lord Chatham": "william pitt, 1st earl of chatham"
    },
    {
        ". On this second visit to England, he was lauded by the English nobility and critics alike, and invited to exhibit at leading art societies; moreover, ": null
    },
    {
        "King George III": "king george iii"
    },
    {
        " is said to have commissioned the out-sized painting River Landscape with the Finding of Moses . Francesco Zuccarelli was a founding member, in 42 of the ": null
    },
    {
        "Royal Academy of Arts": "royal academy of arts"
    },
    {
        ".            Upon his return to Venice in 42 Zuccarelli was received with affection and pride, and in September of that year, the artistic community appointed him director of the ": null
    },
    {
        "Academy of Fine Arts of Venice": "gallerie dellaccademia"
    },
    {
        ", followed by president in the following month. Now entering his eighth decade, he departed from his accustomed Arcadian landscapes and adopted an approach more congenial to the current Venetian taste, ": null
    },
    {
        "neoclassical": "neoclassicism"
    },
    {
        " in outlook, harkening back to his youthful emulation of Ricci. A masterpiece of his late maturity, the unusual Landscape with Bridge, Figures, and a Statue, adheres to the model of ": null
    },
    {
        "Francesco Guardi": "francesco guardi"
    },
    {
        " who reinvented ": null
    },
    {
        "capricci": "capriccio"
    },
    {
        " by casting them with pre-romantic moods, while at the same time the composition gently mocks Guardi, by the placement of the statue in the center of the composition. The painting has many elements common to Zuccarelli, such as a fisherman, waterfall, bridge with animals, traveler, and a peasant, but is done with quick brushstrokes, a technique characteristic of this period, and the atmosphere is one of pathos, recalling his earlier Macbeth and the Witches. Another beautiful canvas, Banquet of a Villa, at which outdoor diners sit at a festive table, is realistic in a manner reminiscent of ": null
    },
    {
        "Pietro Longhi": "pietro longhi"
    },
    {
        ", and the parallel and sloping bands of landscape are typical of those favoured by English topographical artists. This continued desire to look at fresh approaches, even as he grew old, perhaps helps explain why Zuccarelli showed little interest in his role as president of the ossified Venetian Academy, where he was often absent from sessions. In 42 without giving notice, and to the consternation of the membership, he departed permanently to Florence.     It is apparent that Zuccarelli kept in contact with Great Britain, for in 42 he was commissioned for a set of four paintings destined for the Scottish residence of ": null
    },
    {
        "Wedderburn Castle": "wedderburn castle"
    },
    {
        ", based on engravings of the ruins of ": null
    },
    {
        "Palmyra": "palmyra"
    },
    {
        ", first published by ": null
    },
    {
        "Robert Wood": "robert wood"
    },
    {
        " in 42 The small Turkish style figures standing amidst the classical ruins are in keeping with other oriental scenes of his late maturity, some of which are similar to paintings done by ": null
    },
    {
        "Giovanni Antonio Guardi": "giovanni antonio guardi"
    },
    {
        " for Zuccarellis early patron Marshal Schulenburg in 42 & ndash;42 Having been a member of the Florentine Academy of Design since his youth, Zuccarelli was created Master of Nudes at the academy in 42 a more prestigious designation than that of a painter of landscapes, then considered a minor art form, in comparison to the traditional elite status given to figure drawing. Zuccarelli continued teaching at the academy until its reorganization in 42     In his will of 42 Francesco made his beloved wife Giustina his sole heir, and one and a half years later, he died in Florence on 42 December 42 His lengthy obituary, which appeared in the Gazzetta Toscana, described his personality as straightforward, humble, grateful, compassionate, generous, uniting these solid virtues in the most courteous tactful manner, with much grace in speaking , and it also took note that since his youth, he possessed a natural genius for landscapes.            Francesco Zuccarelli was one of the few Venetian painters of his era to win universal acclaim, even from critics who rejected the concept of Arcadia. He was especially popular among the followers of ": null
    },
    {
        "Rousseau": "jean-jacques rousseau"
    },
    {
        ". ": null
    },
    {
        "Francesco Maria Tassi": "francesco maria tassi"
    },
    {
        " , in his Lives of the Painters, Sculptors, and Architects of Bergamo remarks that Zuccarelli paints landscapes with the most charming figures and thus excels not only artists of modern times but rivals the great geniuses of the past; for no one previously knew how to combine the delights of an harmonious ground with figures gracefully posed and represented in the most natural colours . With the move to more representational modes of depicting landscape in the 42th century, negative criticism began to develop, as described by the art historian ": null
    },
    {
        "Michael Levey": "michael levey"
    },
    {
        " in a landmark 42 article, Francesco Zuccarelli in England: ": null
    },
    {
        "Turners": "j. m. w. turner"
    },
    {
        " view was restrained, saying Zuccarellis work was meretricious , lacking the charm and grace of ": null
    },
    {
        "Watteau": "jean-antoine watteau"
    },
    {
        ", and yet his figures were sometimes beautiful ; while Victorian writers, among them partisans of Richard Wilson, sensitive to the neglect of their favourite while the Italian flourished, used adjectives such as theatrical and insincere. Levey contributed to a reevaluation of the artist by explaining the appeal of Zuccarelli to his contemporaries, drawing a parallel with the affection of the 42th century English for pastoral poetry, since everyone could recognize a pleasing convention when they saw one; in this case, a fairyland where the skies are forever blue, the trees forever green.  The exaltation of the rural life as a retreat from the bustle of urbanity had the sanction of a long and distinguished history; for ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        " had recommended it, ": null
    },
    {
        "Petrarch": "petrarch"
    },
    {
        " had practiced it; Zuccarelli was left to illustrate it ; and in Leveys continuation, at its best—in comparison to an age he never saw—Zuccarellis work is highly decorative and still capable of giving pleasure . While sparsely treated in Italy for much of the 42th and early 42th centuries, the painter never fell into disfavour there as in England. The last few decades have seen a resurgence of interest in Zuccarelli by Italian scholars, notably by Federico Dal Forno, who published an artistic biography with sixty paintings in 42 and Federica Spadotto, who issued a ": null
    },
    {
        "catalogue raisonné": "catalogue raisonné"
    },
    {
        " in 42 In a larger cultural context, modern historians have considered him to be a figure of interest with his love of escapism, seen as not untypical of the late Baroque.     During the mid to late 42th century Francesco Zuccarelli was widely imitated, and artists influenced by him included ": null
    },
    {
        "Richard Wilson": "richard wilson"
    },
    {
        ", ": null
    },
    {
        "Giuseppe Zais": "giuseppe zais"
    },
    {
        ", ": null
    },
    {
        "Giovanni Battista Cimaroli": "giovanni battista cimaroli"
    },
    {
        ", and ": null
    },
    {
        "Vittorio Amedeo Cignaroli": "vittorio amedeo cignaroli"
    },
    {
        ". Among those who created engravings after his work were ": null
    },
    {
        "Joseph Wagner": "joseph wagner"
    },
    {
        ", ": null
    },
    {
        "Fabio Berardi": "fabio berardi"
    },
    {
        ", ": null
    },
    {
        "Giovanni Volpato": "giovanni volpato"
    },
    {
        ", ": null
    },
    {
        "Francesco Bartolozzi": "francesco bartolozzi"
    },
    {
        ", and ": null
    },
    {
        "William Woollett": "william woollett"
    },
    {
        ".     The Francesco Zuccarelli Municipal Library and Historical Archives is located in the Fortezza Orsini Cultural Centre, in Pitigliano, Italy, the town of the artists childhood.   Also in the vicinity, the Museum of the Orsini Palace has on permanent exhibit Zuccarellis earliest commissioned altarpieces.        His paintings are rarely signed, yet they often contain a gourd water bottle that was held at the waist by rural Italian women, a punning allusion to his surname, zucco being the Italian word for gourd. A defining touch found consistently across the long span of Francescos career is a serene and vaguely sweet expression on the faces of his rounded figures.              Saint Michael the Archangel defeating the Devil; and The Redeemer and the Holy Souls of Purgatory - Oil on canvas, 42  cm x 42  cm, Museo di Palazzo Orsini, Pitigliano   Landscape with a Castle; and Landscape with a Bridge - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Museum of Fine Arts": "museum of fine arts"
    },
    {
        ", Budapest   Landscape with River and Shepherds at Rest; and Landscape with Bridge and Knight - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Accademia Carrara": "accademia carrara di belle arti di bergamo"
    },
    {
        ", Bergamo   Landscape with Peasants at a Fountain - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "The Metropolitan Museum of Art": "metropolitan museum of art"
    },
    {
        ", New York   Landscape with a Sleeping Child and a Woman Milking a Cow - Oil on panel, 42  cm x 42  cm, ": null
    },
    {
        "Holyrood Palace": "holyrood palace"
    },
    {
        ", Edinburgh   Landscape with a Wayside Tavern - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Hampton Court Palace": "hampton court palace"
    },
    {
        ", East Molesey, Surrey   Landscape with a Woman fording a Stream on Horseback - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", Windsor   Roman Capriccio with Triumphal Arch, the Pyramid of Cestius, St. Peters Basilica and the Castle of the Holy Angel  - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Galleria nazionale": "galleria nazionale di parma"
    },
    {
        ", Parma   Wooded Landscape with the Meeting of Isaac and Rebecca - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", Windsor  Landscape with Jacob Watering Labans Flock - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", Windsor   Landscape with a Waterfall and Two Women with a Boy Fishing - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Buckingham Palace": "buckingham palace"
    },
    {
        ", City of Westminster   Bacchanal - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Gallerie dellAccademia": "gallerie dellaccademia"
    },
    {
        ", Venice   The Banqueting Hall, Whitehall  - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", Windsor   Silenus with Nymphs - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Sanssouci": "sanssouci"
    },
    {
        ", Potsdam    Saint Jerome Emiliani with Orphans and the Virgin in Glory with Child - Oil on canvas, 42  cm x 42  cm, Pinacoteca Repossi, Chiari   Portrait of Ercole Comini at Two Years - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Accademia Carrara": "accademia carrara di belle arti di bergamo"
    },
    {
        ", Bergamo   Pastoral Scene - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Hermitage Museum": "hermitage museum"
    },
    {
        ", Saint Petersburg   Eastern Couple with Dromedary - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Palazzo Thiene": "palazzo thiene"
    },
    {
        ", Vicenza   Refreshment during the Ride - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Fitzwilliam Museum": "fitzwilliam museum"
    },
    {
        ", Cambridge   Et in Arcadio Ego - Oil on canvas, 42  cm x 42  cm, collection ": null
    },
    {
        "Sir James Fergusson": "sir james fergusson, 8th baronet"
    },
    {
        ", London   River Landscape with the Finding of Moses - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", Windsor   Saint John the Baptist Preaching on the River Jordan - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Pinacoteca di Brera": "pinacoteca di brera"
    },
    {
        ", Milan   Bull Hunting - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Gallerie dellAccademia": "gallerie dellaccademia"
    },
    {
        ", Venice   Banquet at a Villa - Oil on canvas, 42  cm x 42  cm, ": null
    },
    {
        "Fondo Ambiente Italiano": "fondo ambiente italiano"
    },
    {
        ", Milan       Exhibition of Italian Pictures from the 42s and 42s - Milan, 42   Exhibition of Italian Art - London, 42   Exhibition of Venetian Landscape Painting from the 42s - Rome, 42   Five Centuries of Venetian Painting - Venice, 42   Eighteenth Century Venice - London, 42   An Exhibition of 42th Century Venice - Detroit, 42   From Caravaggio to Tiepolo - Rome, 42   Italian Art and Britain - London, 42   Landscapes and Vedute - Milan, 42   Venice in the 42th Century - Paris, 42   George III Collector and Patron - London, 42   European Drawings from the Fitzwilliam - New York, 42 & ndash;42   Portrait of Italy in the Century of Tiepolo - Paris, 42   Aspects of Venetian Painting in the 42th Century - Madrid, 42   The Glory of Venice - London and Washington, 42 & ndash;42   The Grand Tour: Landscape and Veduta Paintings, Venice and Rome in the 42th Century - Atlanta, 42   From Canaletto to Zuccarelli: Venetian Landscapes of the 42s - Milan, 42   Portrait of the City: The Vicenza Palladio in the Views of Zuccarelli - Vicenza, 42   Canaletto and the Art of Venice Landscape with the Penitent Magdalene .  c. 42 Drawing. British Museum. Standing Female Figure Carrying a Lamp. Etching. Florence, 42 Il Malmantile Racquistato. Etching. Florence, 42 Landscape with River and Shepherds at Rest. c. 42 ": null
    },
    {
        "Accademia Carrara": "accademia carrara di belle arti di bergamo"
    },
    {
        " Self-portrait. Drawing in chalks. 42 or 42 ": null
    },
    {
        "Royal Academy of Arts": "royal academy of arts"
    },
    {
        " Roman Capriccio with Triumphal Arch , the Pyramid of Cestius , St. Peters Basilica and the Castle of the Holy Angel . ": null
    },
    {
        "Bernardo Bellotto": "bernardo bellotto"
    },
    {
        " and Francesco Zuccarelli. Mid & ndash;42s. ": null
    },
    {
        "Galleria nazionale": "galleria nazionale di parma"
    },
    {
        "  Burlington House . ": null
    },
    {
        "Antonio Visentini": "antonio visentini"
    },
    {
        " and Francesco Zuccarelli. 42 ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        "  Cicero Finds the Tomb of Archimedes . 42 ": null
    },
    {
        "Sanssouci": "sanssouci"
    },
    {
        "  Transfiguration of Jesus   Old Testament Playing Cards . Francesco Zuccarelli and ": null
    },
    {
        "Antonio Visentini": "antonio visentini"
    },
    {
        ". Venice, 42 ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        ". Margheritina Tassi. 42 ": null
    },
    {
        "Accademia Carrara": "accademia carrara di belle arti di bergamo"
    },
    {
        " Pastorale. c. 42 ": null
    },
    {
        "Ca Rezzonico": "ca rezzonico"
    },
    {
        " Ruins of Palmyra. Wool and silk tapestry by Paul Saunders, designed by Francesco Zuccarelli. 42 ": null
    },
    {
        "V & A Museum": "victoria and albert museum"
    },
    {
        " View of Vicenza. c. 42 ": null
    },
    {
        "Palazzo Leoni Montanari": "palazzo leoni montanari, vicenza"
    },
    {
        ", Vicenza. ": null
    },
    {
        "Intesa Sanpaolo": "intesa sanpaolo"
    },
    {
        " collection.   Bemberg Fondation Toulouse - Fête champêtre - Francesco Zuccarelli - inv 42jpg|Garden party. After 42 Fondation Bemberg, ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        " Landscape with the Story of Cadmus Killing the Dragon. Exhibited in 42 ": null
    },
    {
        "Tate": "tate"
    },
    {
        ", London. Mountain Landscape with Washerwomen and a Fisherman. c. 42 & ndash;42 ": null
    },
    {
        "National Gallery of Art": "national gallery of art"
    },
    {
        ", Washington, D.C. River Landscape with the Finding of Moses . 42 ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        " Seated female nude. Before 42 ": null
    },
    {
        "V & A Museum": "victoria and albert museum"
    },
    {
        ", London. Five Young Women in a Landscape. ": null
    },
    {
        "Metropolitan Museum of Art": "metropolitan museum of art"
    },
    {
        ", New York. ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", Windsor. Festa Floralia. ": null
    },
    {
        "Kedleston Hall": "kedleston hall"
    }
]