[
    {
        "   Franz Ignaz Danzi  was a ": null
    },
    {
        "German": "germany"
    },
    {
        " cellist": "cello"
    },
    {
        ", ": null
    },
    {
        "composer": "composer"
    },
    {
        " and ": null
    },
    {
        "conductor": "conducting"
    },
    {
        ", the son of the ": null
    },
    {
        "Italian": "italy"
    },
    {
        " cellist": "cello"
    },
    {
        " Innocenz Danzi , and brother of the noted singer ": null
    },
    {
        "Franzeska Danzi": "francesca lebrun"
    },
    {
        ". Born in ": null
    },
    {
        "Schwetzingen": "schwetzingen"
    },
    {
        ", Franz Danzi worked in ": null
    },
    {
        "Mannheim": "mannheim"
    },
    {
        ", ": null
    },
    {
        "Munich": "munich"
    },
    {
        ", ": null
    },
    {
        "Stuttgart": "stuttgart"
    },
    {
        " and ": null
    },
    {
        "Karlsruhe": "karlsruhe"
    },
    {
        ", where he died.     Danzi lived at a significant time in the history of European concert music. His career, spanning the transition from the late Classical to the early Romantic styles, coincided with the origin of much of the music that lives in our concert halls and is familiar to contemporary classical-music audiences. As a young man he knew ": null
    },
    {
        "Wolfgang Amadeus Mozart": "wolfgang amadeus mozart"
    },
    {
        ", whom he revered; he was a contemporary of ": null
    },
    {
        "Ludwig van Beethoven": "ludwig van beethoven"
    },
    {
        ", about whom he—like many of his generation—had strong but mixed feelings; and he was a mentor for the young ": null
    },
    {
        "Carl Maria von Weber": "carl maria von weber"
    },
    {
        ", whose music he respected and promoted.     Born in ": null
    },
    {
        "Schwetzingen": "schwetzingen"
    },
    {
        " and raised in ": null
    },
    {
        "Mannheim": "mannheim"
    },
    {
        ", Danzi studied with his father and with ": null
    },
    {
        "Georg Joseph Vogler": "georg joseph vogler"
    },
    {
        " before he joined the superlative orchestra of the Elector ": null
    },
    {
        "Karl Theodor": "charles theodore, elector of bavaria"
    },
    {
        " in 42 as a teenager. In 42 the first of his woodwind compositions was published at Mannheim. His father, principal cellist of the orchestra, was praised by ": null
    },
    {
        "Mozart": "wolfgang amadeus mozart"
    },
    {
        " for his playing at the premiere of  Idomeneo . Danzi remained behind in a Mannheim that was rendered more provincial when Karl Theodor moved his court to ": null
    },
    {
        "Munich": "munich"
    },
    {
        " in 42 After an apprenticeship with the small theater orchestra left in Mannheim, he rejoined the main court in Munich as principal cellist—taking his fathers position—in 42     In 42 he married the singer Maria Margarethe Marchand, with whom he travelled in an opera troupe to Leipzig, Prague, Venice, and Florence.     By 42 once more in Munich, he rose to the position of assistant ": null
    },
    {
        "Kapellmeister": "kapellmeister"
    },
    {
        " in one of the most important musical centers of Europe, but in 42 unhappy at the treatment he received at court and despairing of any further advancement, he left Munich to be Kapellmeister in the smaller and less important ": null
    },
    {
        "Stuttgart": "stuttgart"
    },
    {
        " court of the new king of ": null
    },
    {
        "Württemberg": "württemberg"
    },
    {
        ", ": null
    },
    {
        "Frederick I": "frederick of württemberg"
    },
    {
        ". After five years he moved again to ": null
    },
    {
        "Karlsruhe": "karlsruhe"
    },
    {
        ", where he spent the last years of his life at the Royal Konservatorium struggling to raise the modest courtly musical establishment to respectability.     Although not himself a composer of the first rank, Danzi was a highly competent musician. At best, his music is charming, tuneful, and well crafted. He is known today chiefly for his ": null
    },
    {
        "woodwind quintets": "wind quintet"
    },
    {
        ", in which he took justifiable pride for the idiomatic treatment of the individual instruments. He composed in most major genres of the time, including opera, church music, orchestral works, and many varieties of chamber music. He was a first-rate cellist as well as a conscientious and—by all reports—effective orchestra leader and conductor.     ": null
    },
    {
        "Francesca Lebrun": "francesca lebrun"
    },
    {
        " , a singer and composer, was Franz Danzis sister.     At ": null
    },
    {
        "Schwetzingen": "schwetzingen"
    },
    {
        ", the city concert hall was renamed in his honor in 42            Among his compositions are:   Symphonie Concertante in E major for Wind Quintet and Orchestra   42 String Quartets, Op. 42   42 String Quartets, Op. 42   42 Duos for viola and cello   42 Duos for viola and cello, Op. 42   Wind Sextet in E major, Op. 42   Septet in E major, Op. 42   Septet in E major, Op. 42   Sinfonia in C major for Orchestra, Op. 42   ": null
    },
    {
        "Horn Sonata": "horn sonata no. 1"
    },
    {
        " in E major, Op. 42   42 String Quartets, Op. 42   Flute Concerto No. 42 in G major, Op. 42   Flute Concerto No. 42 in D minor, Op. 42   42 Quartets for Bassoon and Strings, Op. 42   ": null
    },
    {
        "Quintet in D minor for Piano and Winds": "quintet for piano and winds no. 1"
    },
    {
        ", Op. 42   Symphonie Concertante in B major for Flute, Clarinet and Orchestra, Op. 42   Flute Concerto No. 42 in D minor, Op. 42   Flute Concerto No. 42 in D major, Op. 42   ": null
    },
    {
        "Sonata concertante in E minor for Horn and Piano": "horn sonata no. 2"
    },
    {
        ", Op. 42   42 Potpourris for Clarinet and Orchestra, Op. 42   Concertino, for Clarinet, Solo Bassoon and Chamber Band, Op. 42   Quintet in F major for Piano and Winds, Op. 42   Quintet in D major for Piano and Winds, Op. 42   42 Wind Quintets, Op. 42   42 String Quintets , Op. 42   42 Wind Quintets, Op. 42   42 Wind Quintets, Op. 42   42 Trios for Flute and Strings, Op. 42   42 Bassoon Concertos   Cello Concerto in A major   Cello Concerto in E minor   Horn Concerto in E major   Ouvertüre in E major for Orchestra   Piano Concerto in E major   Sonata in D major for 42 Organs   Sonatina in D major for Flute and Piano   Sonata for Clarinet and Piano in B major Sonata Concertante   Sinfonia Concertante in E major for Flute, Oboe, French Horn, Bassoon, and Orchestra   42 Pieces Faciles for Piano, Op. 42   42 Arias from Operas by Mozart          ": null
    },
    {
        "A substantial list of newly-published editions of Danzis works in Russian Wikipedia": ":ru:список произведений франца данциосновные издания"
    },
    {
        "                                                                         ": null
    }
]