[
    {
        "Franz Scholz was a ": null
    },
    {
        "German": "germany"
    },
    {
        " priest": "priest"
    },
    {
        " and professor of ": null
    },
    {
        "theology": "theology"
    },
    {
        " from ": null
    },
    {
        "Breslau": "breslau"
    },
    {
        ", ": null
    },
    {
        "Silesia": "province of silesia"
    },
    {
        ". He had eight brothers and two sisters. His youngest brother Gerhard is now 42 He studied at Breslaus Catholic St.-Matthias-": null
    },
    {
        "Gymnasium": "gymnasium"
    },
    {
        ", then Caritas Science at ": null
    },
    {
        "Freiburg": "freiburg"
    },
    {
        ". He studied the ": null
    },
    {
        "Polish language": "polish language"
    },
    {
        " at ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " and ": null
    },
    {
        "Lublin": "lublin"
    },
    {
        ". In 42 he became a priest and took up a position as chaplain at Cross Church in Breslau. In this office Schulz attended to the spiritual needs of Polish seasonal workers in the Silesian capital city. After receiving his doctorate he transferred to St. Bonifacius Church in ": null
    },
    {
        "Görlitz": "görlitz"
    },
    {
        ".     In 42 the eastern part of the city of Görlitz was split off and became known as ": null
    },
    {
        "Zgorzelec": "zgorzelec"
    },
    {
        " when the Polish-German border was redrawn. Because of his knowledge of Polish, Scholz was able to remain in Zgorzelec, but he chose to leave in 42 when Germans who remained in the city were forced to adopt Polish citizenship.     Scholz went to the nearby city of ": null
    },
    {
        "Cottbus": "cottbus"
    },
    {
        ", but when it became part of the ": null
    },
    {
        "German Democratic Republic": "german democratic republic"
    },
    {
        " in 42 he moved to ": null
    },
    {
        "West Germany": "west germany"
    },
    {
        ". There, Scholz taught many classes dealing with morals and theology and he received many honors, including Papal Honorary Titles.     Professor Scholz was a theologian with many years of practical experience with parishioners and inmates, and he had experience with Polish life and people. He left a large volume of written material. He was especially opposed to the proposed beatification of the Primate of Poland, ": null
    },
    {
        "August Cardinal Hlond": "august hlond"
    },
    {
        ".                                            ": null
    }
]