[
    {
        "        Frederick I  was the ruler of ": null
    },
    {
        "Württemberg": "württemberg"
    },
    {
        " from 42 to his death. He was the last ": null
    },
    {
        "Duke of Württemberg": "duchy of württemberg"
    },
    {
        " from 42 to 42 then the first and only ": null
    },
    {
        "Elector of Württemberg": "electorate of württemberg"
    },
    {
        " from 42 to 42 before raising Württemberg to a ": null
    },
    {
        "kingdom": "kingdom of württemberg"
    },
    {
        " in 42 with the approval of ": null
    },
    {
        "Napoleon I": "napoleon i"
    },
    {
        ". He was known for his size: at  and about .                Born in Treptow an der Rega, today ": null
    },
    {
        "Trzebiatów": "trzebiatów"
    },
    {
        ", ": null
    },
    {
        "Poland": "poland"
    },
    {
        ", Frederick was the eldest son of ": null
    },
    {
        "Frederick II Eugene, Duke of Württemberg": "frederick ii eugene, duke of württemberg"
    },
    {
        ", and ": null
    },
    {
        "Sophia Dorothea of Brandenburg-Schwedt": "sophia dorothea of brandenburg-schwedt"
    },
    {
        ". Fredericks father was the third son of ": null
    },
    {
        "Charles Alexander, Duke of Württemberg": "charles alexander, duke of württemberg"
    },
    {
        ", and Frederick was thus the nephew of the long-reigning duke ": null
    },
    {
        "Charles Eugene": "karl eugen, duke of württemberg"
    },
    {
        " . Since neither Duke Charles Eugene nor his next brother, ": null
    },
    {
        "Louis Eugene": "ludwig eugen, duke of württemberg"
    },
    {
        " , had any sons, it was expected that Fredericks father would eventually succeed to the Duchy, and would be succeeded in turn by Frederick.     That eventuality was however many years in the future, and the birth of a legitimate son to either of his uncles would preempt Fredericks hopes conclusively. Further, his uncle the Duke was not disposed to give any member of his family any role in affairs of government. Frederick therefore determined - like his father - on a military career at the court of ": null
    },
    {
        "Frederick the Great": "frederick the great"
    },
    {
        ". This later drew Frederick and his family into the Prussian kings network of marriage alliances - in 42 his sister ": null
    },
    {
        "Sophie": "maria feodorovna"
    },
    {
        " would marry to ": null
    },
    {
        "Tsesarevich Paul": "paul i of russia"
    },
    {
        ", future ": null
    },
    {
        "Emperor of Russia": "list of russian rulers"
    },
    {
        " and son of ": null
    },
    {
        "Empress Catherine II": "catherine ii of russia"
    },
    {
        ". These family ties to Russia had immediate consequences for Frederick and far-reaching ones for Württemberg during the reorganisation of Europe in the wake of the 42 ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        ".          In June 42 he entered the Prussian Army as an oberst in the Kürassierregiment Lölhöffel, rising to a commander in the same unit in December 42 He fought with it in the ": null
    },
    {
        "War of the Bavarian Succession": "war of the bavarian succession"
    },
    {
        ". In 42 he took over the 42nd Dragoon Regiment . Frederick married ": null
    },
    {
        "Duchess Augusta of Brunswick-Wolfenbüttel": "augusta of brunswick-wolfenbüttel"
    },
    {
        " on 42 October 42 at ": null
    },
    {
        "Braunschweig": "braunschweig"
    },
    {
        ". She was the eldest daughter of ": null
    },
    {
        "Charles William Ferdinand, Duke of Brunswick-Lüneburg": "charles william ferdinand, duke of brunswick"
    },
    {
        " and ": null
    },
    {
        "Princess Augusta of Great Britain": "princess augusta of great britain"
    },
    {
        " and thus a niece of ": null
    },
    {
        "George III of Great Britain": "george iii of great britain"
    },
    {
        " and sister to ": null
    },
    {
        "Caroline of Brunswick": "caroline of brunswick"
    },
    {
        ", the future wife of ": null
    },
    {
        "George IV": "george iv of the united kingdom"
    },
    {
        ". The marriage was not a happy one - even during her first pregnancy in 42 she wished to separate but was persuaded to stay with Frederick by her father. Though they had four children, Frederick was rumored to be ": null
    },
    {
        "bisexual": "bisexuality"
    },
    {
        ", with a ": null
    },
    {
        "coterie": "wikt:coterie"
    },
    {
        " of young noblemen.     He had a good relationship with the King of Prussia and regularly took part in cabinet meetings, though this was clouded by his sister Elizabeths 42 marriage to ": null
    },
    {
        "Francis of Austria": "francis ii, holy roman emperor"
    },
    {
        ", later the last Holy Roman Emperor and the first Emperor of Austria. Frederick the Great feared that Prussia would become isolated by a closer relationship between Russia and Austria, whose rulers were both Frederick of Württembergs sisters and blamed him for Francis marriage.       In 42 Frederick resigned from the Prussian Army as a major general and the following year he accompanied Sophie and her husband to Russia, after a ": null
    },
    {
        "Grand Tour": "grand tour"
    },
    {
        " of Europe that the imperial couple had undertaken. Pleased with the well-spoken and confident young man, Catherine II appointed Frederick ": null
    },
    {
        "Governor-General": "governor-general of finland"
    },
    {
        " of ": null
    },
    {
        "Eastern Finland": "old finland"
    },
    {
        ", with his seat at ": null
    },
    {
        "Viipuri": "viipuri"
    },
    {
        ". From June to October 42 he was also in command of a 4242 strong corps in ": null
    },
    {
        "Kherson": "kherson"
    },
    {
        " during the ": null
    },
    {
        "Russo-Turkish War": "russo-turkish war"
    },
    {
        ", but he was not significantly involved in combat.     Fredericks relationship with his wife became more and more strained. He was reportedly violent towards her and after a play during a visit to ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        " in December 42 Augusta asked for protection from Empress Catherine. She gave Augusta ": null
    },
    {
        "asylum": "right of asylum"
    },
    {
        " and ordered Frederick to leave Russia. When Sophie protested at the treatment of her brother, Catherine replied,  It is not I who cover the Prince of Württemberg with opprobrium: on the contrary, it is I who try to bury abominations and it is my duty to suppress any further ones.  Catherines relationship with Fredericks brother-in-law Paul had also broken down and so Frederick had to help protect his sister as she came under fire from Catherine. Augusta was sent to live at Lohde Castle in Western Estonia but died on 42 September 42 after miscarrying an illegitimate child and being refused any medical help to cover up the pregnancy. In the same year, Frederick sold his residence in Vyborg, known as Monrepos.        In the meantime, Fredericks succession to the throne of Württemberg had become more and more likely. In June 42 he traveled to Paris to see the first stages of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " at first hand, before moving to ": null
    },
    {
        "Ludwigsburg": "ludwigsburg"
    },
    {
        " the following year, much to the displeasure of his uncle Carl Eugen, who was still on the throne. His father came to the throne in 42 and finally Frederick gained his long-wished political influences. His Brunswick-born father helped him make contact with the British royal family - Fredericks first wife had been a niece of George III. On 42 May 42 Frederick married Georges eldest daughter ": null
    },
    {
        "Charlotte": "charlotte, princess royal"
    },
    {
        " at the ": null
    },
    {
        "Chapel Royal": "chapel royal"
    },
    {
        " in ": null
    },
    {
        "St Jamess Palace": "st jamess palace"
    },
    {
        ".           On 42 December 42 Fredericks father, who had succeeded his brother as ": null
    },
    {
        "Duke of Württemberg": "duke of württemberg"
    },
    {
        " two years before, died, and Frederick became Duke of Württemberg as Frederick III. He was not to enjoy his reign undisturbed for long, however. In 42 the French army occupied ": null
    },
    {
        "Württemberg": "württemberg"
    },
    {
        " and the Duke and Duchess fled to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ". In 42 Duke Frederick ceded the enclave of ": null
    },
    {
        "Montbéliard": "montbéliard"
    },
    {
        " to the French Republic, and received ": null
    },
    {
        "Ellwangen": "ellwangen"
    },
    {
        " in exchange two years later.     In the  Reichsdeputationshauptschluss , which reorganized the Empire as a result of the French annexation of the west bank of the Rhine, the Duke of Württemberg was raised to the dignity of ": null
    },
    {
        "Imperial Elector": "prince-elector"
    },
    {
        ". Frederick assumed the title Prince-Elector  on 42 February 42 and was thereafter known as the  Elector of Württemberg . The reorganization of the Empire also secured the new Elector control of various ecclesiastical territories and former ": null
    },
    {
        "free cities": "imperial free city"
    },
    {
        ", thus greatly increasing the size of his domains.            In exchange for providing France with a large auxiliary force, ": null
    },
    {
        "Napoleon": "napoleon i"
    },
    {
        " allowed Frederick to raise Württemberg to a kingdom on 42 December 42 Friedrick was formally crowned king at ": null
    },
    {
        "Stuttgart": "stuttgart"
    },
    {
        " on 42 January 42 and took the regnal name of King Frederick I. Soon after, Württemberg seceded from the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " and joined Napoleons ": null
    },
    {
        "Confederation of the Rhine": "confederation of the rhine"
    },
    {
        ". Once again, the assumption of a new title also meant territorial expansion, as the territories of various nearby princes were ": null
    },
    {
        "mediatized": "mediatization"
    },
    {
        " and annexed by Württemberg. As a symbol of his alliance with Napoleon, Fredericks daughter, ": null
    },
    {
        "Princess Catharina": "catharina of württemberg"
    },
    {
        ", was married to Napoleons youngest brother, ": null
    },
    {
        "Jérôme Bonaparte": "jérôme bonaparte"
    },
    {
        ".     The newly elevated kings alliance with France technically made him the enemy of his father-in-law, ": null
    },
    {
        "George III": "george iii of the united kingdom"
    },
    {
        ". However, the Kings dynastic connections would enable him to act as a go-between with Britain and various continental powers. In 42 Frederick banished the composer ": null
    },
    {
        "Carl Maria von Weber": "carl maria von weber"
    },
    {
        " from Württemberg on the pretext that Weber had mismanaged the funds of Fredericks brother, ": null
    },
    {
        "Louis": "duke louis of württemberg"
    },
    {
        ", for whom Weber had served as secretary since 42     During the ": null
    },
    {
        "German Campaign of 42": "german campaign of 1813"
    },
    {
        ", Frederick changed sides and went over to the Allies, where his status as the brother-in-law of the British ": null
    },
    {
        "Prince Regent": "george iv of the united kingdom"
    },
    {
        " and uncle to the Russian ": null
    },
    {
        "Emperor Alexander I": "alexander i of russia"
    },
    {
        " helped his standing. After the fall of Napoleon, he attended the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " and was confirmed as King. At ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", Frederick and his ministers were very concerned to make sure that Württemberg would be able to retain all the territories it had gained in the past fifteen years. Fredericks harsh treatment of the mediatized  princes within his domain made him one of the principal targets of the organization of dispossessed princes, which hoped to gain the support of the Powers in regaining their lost sovereignty. In the end, however, ": null
    },
    {
        "Austria": "habsburg monarchy"
    },
    {
        ", which was seen as the natural ally of the princes, was more interested in alliance with the medium-sized German states like Württemberg than in asserting its traditional role as protector of the smaller sovereigns of the old Empire; and Frederick was allowed to retain his dubiously acquired lands. Frederick, along with the other German princes, joined the new ": null
    },
    {
        "German Confederation": "german confederation"
    },
    {
        " in 42 He died in ": null
    },
    {
        "Stuttgart": "stuttgart"
    },
    {
        " in October of the next year.     When he became King, he granted his children and further male-line descendants the titles Princes and Princesses of Württemberg with the style  Royal Highness , and he styled his siblings as  Royal Highness es with the titles Dukes and Duchesses of Württemberg.     He was very tall and obese: behind his back he was known as The Great Belly-Gerent . Napoleon remarked that God had created the Prince to demonstrate the utmost extent to which the human skin could be stretched without bursting.  In return, Frederick wondered how so much poison could fit in such a small head as Napoleons.       Frederick was married twice. On 42 October 42 Frederick married Augusta of Brunswick-Wolfenbüttel. They had four children:     ": null
    },
    {
        "Prince William of Württemberg": "william i of württemberg"
    },
    {
        " , who succeeded his father as King William I.   ": null
    },
    {
        "Princess Catharina of Württemberg": "catharina of württemberg"
    },
    {
        " , who was married on 42 August 42 to ": null
    },
    {
        "Jérôme Bonaparte": "jérôme bonaparte"
    },
    {
        ", ": null
    },
    {
        "King of Westphalia": "king of westphalia"
    },
    {
        ", youngest brother of ": null
    },
    {
        "Napoleon I": "napoleon i"
    },
    {
        ", and had issue.   Duchess Sophia Dorothea of Württemberg , died in infancy.   ": null
    },
    {
        "Prince Paul of Württemberg": "prince paul of württemberg"
    },
    {
        " , whose grandson would inherit the throne as ": null
    },
    {
        "William II of Württemberg": "william ii of württemberg"
    },
    {
        "     On 42 May 42 Frederick married Princess ": null
    },
    {
        "Charlotte, Princess Royal": "charlotte, princess royal"
    },
    {
        ", the eldest daughter of King ": null
    },
    {
        "George III": "george iii"
    },
    {
        ". The couple had only one child, a stillborn daughter delivered on 42 April 42        Der schwäbische Zar. Friedrich – Württembergs erster König. Stuttgart 42   Paul, Ina Ulrike. Württemberg 42–42/42 Quellen und Studien zur Entstehung des modernen württembergischen Staates . Munich 42            ": null
    }
]