[
    {
        "      Frederick Augustus II  was ": null
    },
    {
        "King": "monarch"
    },
    {
        " of ": null
    },
    {
        "Saxony": "kingdom of saxony"
    },
    {
        " and a member of the ": null
    },
    {
        "House of Wettin": "house of wettin"
    },
    {
        ".     He was the eldest son of ": null
    },
    {
        "Maximilian, Prince of Saxony": "maximilian, prince of saxony"
    },
    {
        " & mdash; younger son of the Elector Frederick Christian of Saxony & mdash; by his first wife, ": null
    },
    {
        "Caroline of Bourbon, Princess of Parma": "princess carolina of parma"
    },
    {
        ".           From his birth, it was clear that one day Frederick Augustus would become the ruler of Saxony. His father was the only son of the Elector Frederick Christian of Saxony who left surviving male issue. When the King Frederick Augustus I died and Anton succeeded him as King, Frederick Augustus became second in line to the throne, preceded only by his father Maximilian.     He was an officer in the ": null
    },
    {
        "War of the Sixth Coalition": "war of the sixth coalition"
    },
    {
        ". However, he had little interest in military affairs.       The ": null
    },
    {
        "July Revolution": "july revolution"
    },
    {
        " of 1830 in ": null
    },
    {
        "France": "france"
    },
    {
        " marked the beginning of disturbances in Saxony that autumn. The people claimed a change in the constitution and demanded a young regent of the kingdom to share the government with the King Anton. On 1 September the Prince Maximilian renounced his rights of succession in favor of his son Frederick Augustus, who was proclaimed Prince Co-Regent  of Saxony. On 2 February 1832 Frederick Augustus brought Free Autonomy to the cities. Also, by an edict of 17 March of that year, the farmers were freed from the corvée and hereditary submission.       On 6 June 1836, King Anton died and Frederick Augustus succeeded him. As an intelligent man, he was quickly popular with the people as he had been since the time of his regency. The new king solved political questions only from a pure sense of duty. Mostly he preferred to leave these things on the hands of his ministers.     A standardized jurisdiction for Saxony created the ": null
    },
    {
        "Criminal Code": "criminal code"
    },
    {
        " of 1836. During the ": null
    },
    {
        "Revolutionary disturbances of 1848": "german revolutions of 1848–49"
    },
    {
        " , he appointed liberal ministers in the government, lifted censorship, and remitted a liberal electoral law. Later his attitude changed. On 28 April Frederick August II dissolved the Parliament. In 1849, Frederick Augustus was forced to flee to the ": null
    },
    {
        "Königstein Fortress": "königstein fortress"
    },
    {
        ". The ": null
    },
    {
        "May Uprising": "may uprising in dresden"
    },
    {
        " was crushed by Saxon and ": null
    },
    {
        "Prussian troops": "prussian army"
    },
    {
        " and Frederick was able to return after only a few days.       In 1844 Frederick Augustus, accompanied by his personal physician ": null
    },
    {
        "Carl Gustav Carus": "carl gustav carus"
    },
    {
        ", made an informal  visit to England and Scotland. Among places they visited were ": null
    },
    {
        "Lyme Regis": "lyme regis"
    },
    {
        " where he purchased from the local fossil collector and dealer, ": null
    },
    {
        "Mary Anning": "mary anning"
    },
    {
        ", an ichthyosaur skeleton for his own extensive natural history collection. It was not a state visit, but the King was the guest of ": null
    },
    {
        "Queen Victoria": "victoria of the united kingdom"
    },
    {
        " and ": null
    },
    {
        "Prince Albert": "albert, prince consort"
    },
    {
        " at ": null
    },
    {
        "Windsor Castle": "windsor castle"
    },
    {
        ", visited many of the sights in ": null
    },
    {
        "London": "london"
    },
    {
        " and in the university cities of ": null
    },
    {
        "Oxford": "oxford university"
    },
    {
        " and ": null
    },
    {
        "Cambridge": "cambridge university"
    },
    {
        ", and toured widely in England, Wales and Scotland. C.G.Carus, The King of Saxonys Journey through England and Scotland, 1844, english edition, London, Chapman and Hall, 1846        During a journey in ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        ", he had an accident in Brennbüchel in which he fell in front of a horse that stepped on his head. On 8 August 1854, he died in the Gasthof Neuner. He was buried on 16 August in the ": null
    },
    {
        "Katholische Hofkirche": "katholische hofkirche"
    },
    {
        " of ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ". In his memory, the Dowager Queen Maria arranged to establish the Königskapelle at the accident place, which was consecrated one year later, some of the last members of the Saxon royal family, including ": null
    },
    {
        "Maria Emanuel, Margrave of Meissen": "maria emanuel, margrave of meissen"
    },
    {
        ", are buried beside the chapel       In ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " on 26 September 1819 and again in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        " on 7 October 1819 , Frederick Augustus married firstly with the ": null
    },
    {
        "Archduchess Maria Caroline of Austria": "marie caroline, crown princess of saxony"
    },
    {
        " , daughter of Emperor ": null
    },
    {
        "Francis I": "francis ii, holy roman emperor"
    },
    {
        " of ": null
    },
    {
        "Austria": "austrian empire"
    },
    {
        ". They had no children.     In ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        " on 24 April 1833 Frederick Augustus married secondly with the ": null
    },
    {
        "Princess Maria Anna of Bavaria": "maria anna of bavaria"
    },
    {
        " , daughter of the King ": null
    },
    {
        "Maximilian I Joseph of Bavaria": "maximilian i joseph of bavaria"
    },
    {
        ". Like his first marriage, this was childless.     The musician ": null
    },
    {
        "Theodor Uhlig": "theodor uhlig"
    },
    {
        " was an illegitimate son of Frederick Augustus. John Warrack, Uhlig, Theodor, ": null
    },
    {
        "Oxford Music Online": "oxford music online"
    },
    {
        ",consulted 23.6.2010     Without legitimate issue, after his death Frederick Augustus was succeeded by his younger brother, ": null
    },
    {
        "Johann": "john of saxony"
    },
    {
        ".                                                                                                         ": null
    }
]