[
    {
        "Until January 42 42 Fredensborg-Humlebæk Kommune was a municipality  on the east coast of the island of ": null
    },
    {
        "Zealand": "zealand"
    },
    {
        "  in eastern ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ". The municipality covered an area of 42  km², and had a total population of 42 . Its last mayor was John Hemming, a member of the ": null
    },
    {
        "Conservative Peoples Party": "konservative folkeparti"
    },
    {
        " political party": "politics of denmark"
    },
    {
        ". The site of its municipal council was in ": null
    },
    {
        "Fredensborg": "fredensborg"
    },
    {
        ". The municipality was a conglomerate of several small towns, the two major ones being Fredensborg and Humlebæk.     Fredensborg-Humlebæk municipality ceased to exist as the result of ": null
    },
    {
        "Kommunalreformen ": "municipalities of denmarkmunicipal reform 2007"
    },
    {
        ". It was merged with ": null
    },
    {
        "Karlebo Kommune": "karlebo kommune"
    },
    {
        " municipality to form the new ": null
    },
    {
        "Fredensborg Kommune": "fredensborg kommune"
    },
    {
        ". This created a municipality with an area of 42  km² and a total population of 42 . The new municipality belongs to ": null
    },
    {
        "Region Hovedstaden": "region hovedstaden"
    },
    {
        " .          The town of Fredensborg is the site of ": null
    },
    {
        "Fredensborg Palace": "fredensborg palace"
    },
    {
        ". The palace by Lake Esrum  has special status among Danish palaces as the royal couples most used residence. The palace was built in the 42th century, and is in the ": null
    },
    {
        "baroque": "baroque"
    },
    {
        " style. It is often used for official purposes, as well as privately by the royal family.     The town of Humlebæk has railroad connection to ": null
    },
    {
        "Elsinore": "elsinore"
    },
    {
        "  and ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        ". It is situated on the shores of the Øresund, and is surrounded by small patches of forest and fields on its three remaining sides. Once a residence for fishermen, today the town is a part of suburban Copenhagen, and is mainly composed of residential areas. There are several small but pleasant beaches along the coast; some of these are public beaches.         The best known attraction in the former municipality is the ": null
    },
    {
        "Louisiana Museum of Modern Art": "louisiana museum of modern art"
    },
    {
        ".           ": null
    }
]